{"title":"Hydrogeochemical characteristics, driving factors, and health risk assessment of karst groundwater in Southwest Hubei Province, China","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11069?af=R","date":1721328822000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/52acbf37-0a85-465e-a5b9-19d597d7792c/wer11069-toc-0001-m.png\" alt=\"Hydrogeochemical characteristics, driving factors, and health risk assessment of karst groundwater in Southwest Hubei Province, China\" />\n<p>Mathematical and statistical methods are used to analyze the hydrogeochemical characteristics and controlling factors. The results show that the groundwater facies type was mainly HCO<sub>3</sub>-Ca and mainly controlled by water–rock interaction. Demonstrating H<sub>2</sub>SO<sub>4</sub> and HNO<sub>3</sub> plays an important role in the dissolution of carbonate minerals.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>In South China, karst groundwater is an important water resource for industrial, agricultural, and drinking purposes. However, karst aquifers are highly vulnerable to pollution, leading to deteriorating karst groundwater quality and posing potential health risks to local residents. In this study, 22 groundwater samples were collected from a karst aquifer in the southwestern part of Hubei Province. The hydrogeochemical characteristics and their controlling factors were examined, and the potential health risks associated with groundwater pollutant concentrations in karst groundwater were assessed. The results showed that the groundwater is slightly alkaline with low chemical oxygen demand values, indicating good water quality. The groundwater facies type was identified as HCO<sub>3</sub>-Ca at most sample spots, showing low total dissolved solids concentrations. Substantial spatial variations in Na<sup>+</sup>, CO<sub>3</sub>\n<sup>2−</sup>, and NO<sub>2</sub>\n<sup>−</sup> concentrations were found, whereas spatial variations in the K<sup>+</sup>, Ca<sup>2+</sup>, Cl<sup>−</sup>, HCO<sub>3</sub>\n<sup>−</sup>, and F<sup>−</sup> concentrations were small. In addition, the dissolution of gypsum deposits and magnesium carbonate sedimentary rocks at sampling sites resulted in groundwater facies types of HCO<sub>3</sub>•SO<sub>4</sub>-Ca and HCO<sub>3</sub>-Ca•Mg, with low total dissolved solids concentrations. The karst groundwater chemistry in the study area was mainly controlled by water–rock interactions, as well as by the dissolution of gypsum deposits and magnesium carbonate sedimentary rocks at specific groundwater sampling sites. The groundwater Cl<sup>−</sup> concentrations were mainly affected by atmospheric precipitation. NO<sub>3</sub>\n<sup>−</sup> was mainly derived from atmospheric precipitation, domestic sewage, septic tanks, and industrial activities, whereas SO<sub>4</sub>\n<sup>2−</sup> was derived from atmospheric precipitation, sulfate rock dissolution, and sulfide mineral oxidation. These results highlight the absence of potential human health risks of NO<sub>3</sub>\n<sup>−</sup> and F<sup>−</sup> to infants, children, and adults, as their concentrations are below the corresponding regional background values. In contrast, the potential health risks of Cl<sup>−</sup> cannot be ignored, particularly for infants. This study offers scientific guidelines for protecting and allocating local groundwater resources.</p>","author":"Qiang Shan, \nXizhao Tian, \nHao Xie, \nZhiqiang Gong, \nYongsheng Lin, \nZhiwen Dang, \nJun Li, \nShengzhang Zou, \nTianlong Zhu","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"270c97057eb1d91562faa1f66dd07f368fdd18d402f8cde9c49ec32aa6ffa948","category":"Environment"}