{"title":"Loss of functional diversity rather than species diversity of pollinators decreases community‐wide trait matching and pollination function","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2435.14527?af=R","date":1715144986000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b83859ef-d02b-4d13-88a8-5733fb3b33ba/fec14527-toc-0001-m.png\" alt=\"Loss of functional diversity rather than species diversity of pollinators decreases community-wide trait matching and pollination function\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/02/the-decline-of-long-tongued-pollinators-causes-a-community-wide-mismatch-between-flower-and-pollinator-morphology/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLoss of animal species and functional diversity can degrade ecosystem functions and services in plant–animal mutualistic networks, but their relative effects have rarely been previously examined in natural communities. Contrary to previously published theoretical results, under natural conditions, changes in pollinator functional niches caused by species and functional diversity losses are dynamic and often unpredictable. The lack of studies on natural networks limits our ability to predict future effects of decreasing pollinator diversity on wild and cultivated plants.\n\nWe quantitatively evaluated the relative effects of pollinator species and functional diversity loss on plant–pollinator trait matching and pollination success across 40 spatiotemporally variable coastal networks.\n\nWe found that low pollinator functional diversity (low abundance of long-tongued pollinators) reduced community-level plant functional specialization and trait matching between flowers and pollinators by reducing functional floral-niche partitioning among pollinators. In contrast, pollinator species diversity did not influence community-level trait matching. Furthermore, decreasing community-level trait matching had a negative effect on community-level plant pollination success, regardless of flower morphology.\n\nThe present study demonstrated that pollinator functional diversity loss, rather than species diversity loss, was the main factor contributing to pollination functional loss in the plant–pollinator networks studied. We also demonstrated the importance of assessing functional aspects of plant–pollinator networks to evaluate community-level pollination functional loss under global pollinator decline.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/02/the-decline-of-long-tongued-pollinators-causes-a-community-wide-mismatch-between-flower-and-pollinator-morphology/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>要旨</h2>\n<p>\n\n植物と相利共生する動物の種多様性および機能的多様性の減少は、植物―動物の相利共生ネットワークのもつ生態系機能やサービスを低下させうる。しかし、自然群集における種および機能的多様性の減少の相対的な影響の強さについては研究されていない。自然条件下において、送粉者の種および機能的多様性の減少による各送粉者種の機能的ニッチの変化は、理論的な予測とは異なり、動的で予測は難しい。送粉者の多様性の減少が野生・栽培植物に与える影響を予測するためには、実際の環境に近い多くの種から構成されるネットワークを用いた研究が不可欠である。\n\n本研究では、本州と伊豆諸島における時空間的に異なる40の海浜植物群集の植物―送粉者ネットワークを用いて、送粉者の種多様性および機能的多様性の減少が植物―送粉者の相互作用に関わる形質のマッチングと送粉成功に与える相対的な影響を検証した。\n\nその結果、長口吻送粉者の減少による機能的多様性の減少にともない、群集レベルの植物の機能的なジェネラリスト度が増加し、形質ミスマッチが増加した。一方で、送粉者の種多様性は形質のマッチングに影響しなかった。また、群集レベルの形質ミスマッチの増加は、植物群集内の多様な形態の花において送粉成功を低下させた。\n\nこれらの結果から、植物―送粉者ネットワークにおける送粉機能の減少を引き起こす主要因は、種多様性の減少ではなく、送粉者の機能的多様性の減少であることが示唆された。また、形質マッチングなどの機能的な指標は植物―送粉者ネットワークの送粉機能の健全性を測る指標として有用である可能性がある。\n</p>","author":"Masayoshi K. Hiraiwa, \nAtushi Ushimaru","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"2713c2b5f44c9cc6637dc9fd9a5526114b88e2989f836d00b240e6f4a783802d","category":"Environment"}