{"title":"Our lifestyles are back to ‘normal’, but is our mental health? Longitudinal assessment of psychological distress during the COVID-19 pandemic among Spanish adults: April 2021 to August 2022","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003389","date":1721224800000,"content":"<p>by Aviana O. Rosen, Maria Dolores Hidalgo, Colleen B. Mistler, Nekane Balluerka, Arantxa Gorostiaga, Juana Gómez-Benito, Ashley L. Holmes, Tania B. Huedo-Medina</p>\r\n\r\nThe COVID-19 pandemic had a detrimental effect on mental health since its start in 2020 and current data on mental health is limited. This study provides recent longitudinal data on psychological distress among a country-wide sample of adults. We recruited and surveyed 1,956 adults in Spain in April 2021 and August 2022 on sociodemographic- and pandemic-related psychological distress using the General Distress 21-item version of the Depression, Anxiety, and Stress Scale (DASS). Paired sampled t-tests assessed DASS scores by sex from April 2021 to August 2022; and one-way ANOVAs assessed DASS scores across sociodemographic characteristics. Results showed that psychological distress slightly improved across the total sample from April 2021 to August 2022; though females, young adults, students, and individuals with lower income experienced more psychological distress. Increases in severe stress scores were found particularly among men. Our data provides an overview of the psychological distress of Spanish adults 2.5 years into the pandemic and provides novel evidence that though life has resumed a sense of normalcy after the COVID-19 pandemic, the mental health of key populations (e.g., females, young adults, students, low-income) is still suffering and further intervention and resources are needed.","author":"Aviana O. Rosen","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"271391af46fefccaa31637df26a0771277c48197f07c2d9df2ce9af5298c0507","category":"Environment"}