{"title":"macOS Monterey: Update now or wait?","link":"https://www.macworld.com/article/546040/macos-monterey-update-now-or-wait.html","date":1635175090000,"content":"<div>\n<section><div></div></section><p>Apple’s latest operating system for the Mac, macOS Monterey, becomes available on Monday, October 25. And while Apple pushes users to upgrade right away, should you? There are a lot of good reasons for upgrading as soon as possible, but there are also a lot of good reasons to wait. If you’re trying to decide, let’s go over those reasons, and we’ll also give you our recommendation.</p>\n\n\n\n<h2>macOS Monterey: Why you should update now</h2>\n\n\n\n<p>The main reason why you should upgrade now is to get access to most of the <a href=\"https://www.macworld.com/article/348192/macos-12-monterey-features-release-compatibility-how-to-install.html\">new features</a>. If you want new productivity tools, Monterey has <a href=\"https://www.macworld.com/article/351264/macos-monterey-quick-note-hot-corners-how-to.html\">Quick Note</a>, <a href=\"https://www.macworld.com/article/351669/macos-monterey-how-to-live-text-look-up-photos-quick-look-safari.html\">Live Text</a>, and <a href=\"https://www.macworld.com/article/353477/how-to-macos-monterey-set-up-customize-focus-modes-mac.html\">Focus</a>. The new <a href=\"https://www.macworld.com/article/348837/macos-monterey-low-power-mode-system-preferences-how-to-enable.html\">Low Power Mode</a> can be very helpful if you have an older MacBook and you spend a lot of time managing battery life. If you have a more current Mac, the AirPlay to Mac feature is a great way to play content from an iPhone or iPad to a Mac. The Shared with You feature is a convenient way to organize the things you save or get sent in Photos, Safari, Apple News, Apple Podcasts, and the Apple TV app. </p>\n\n\n\n<p>iCloud+ has the Hide My Email feature that allows you to create email aliases for your real email account, HomeKit Secure Video support, and <a href=\"https://www.macworld.com/article/348965/icloud-plus-private-relay-safari-vpn-ip-address-encryption-privacy.html\">Private Relay</a> (still in beta), which hides your IP address and location while you’re on the web. And the Maps and Books apps are better than ever. Safari also has several new features, and the one that may make you want to upgrade is <a href=\"https://www.macworld.com/article/349519/safari-15-macos-12-monterey-big-sur-tab-bar-groups-design-sidebar-how-to.html\">Tab Groups</a>, where you can organize websites, handy for folks who do a lot of research online.</p>\n\n\n\n<p>The marquee feature for Monterey right now (more on that in a bit) is Shortcuts. Shortcuts made its debut in iOS, and now the automation tool is on the Mac. If you have a repetitive task that takes multiple steps, you can use Shortcuts to automate the process and save yourself from going crazy. While Monterey still includes the long-time Automator automation app, you’ll find Shortcuts easier to use.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/macos-monterey-shortcuts.jpg?quality=50&amp;strip=all\" /><figcaption><p>Shortcuts made its debut on iOS and was an instant hit. Now it’s coming to the Mac.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Besides the new features, Monterey brings a lot of under-the-hood improvements and optimizations, including security updates and optimizations to make the operating system run more efficiently. For more information on how to use the new features, check out our <a href=\"https://www.macworld.com/article/353470/macos-monterey-superguide-features-tips-tricks-updates.html\">macOS Monterey Superguide</a>.</p>\n\n\n\n<h2>macOS Monterey: Why you should wait</h2>\n\n\n\n<p>While it’s tempting to jump on the Monterey wave as soon as it comes, but there’s really no rush. Apple will support macOS Big Sur for a while and won’t stop releasing updates for many months.</p>\n\n\n\n<p>A very good reason to wait is that the true marquee features of Monterey aren’t ready yet. The main feature is Universal Control, which lets you instantly connect an iPad to a Mac so you can use it as a second screen. In Apple’s demos, it works kind of like magic—all you do is place the iPad next to the Mac, and the connection is done automatically. But apparently, the magic still needs to be worked out, because Apple announced that Universal Control won’t be available until “later this fall.” It’s completely missing from macOS Monterey and hasn’t appeared in any of the betas yet.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/macos-monterey-universal-control.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Apple needs more time to make sure Universal Control is ready for Mac and iPad users.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>The other big feature that isn’t ready at Monterey’s launch is SharePlay. This is the feature where people on FaceTime calls can watch the same TV or movie stream, listen to the same music, or someone can share their Mac screen. Like Universal Control, it’s not available until “later this fall.”</p>\n\n\n\n<p>If you want the new Safari, you actually don’t need to upgrade to Monterey to get it—it’s part of Safari 15, which is available for macOS Big Sur. To get it, check for updates in the System Update pane in System Preferences.</p>\n\n\n\n<p>The other main reason you may not want to upgrade now is to avoid bugs. While Apple has a beta program that the public can participate in, the final release to the general public means that there are even more Macs running the operating system, which means bugs may be found that weren’t discovered during beta. macOS Monterey appeared very stable in its latest beta, but bugs can pop up at any time. Apple will likely fix any major ones in a macOS 12.0.1 update within weeks.</p>\n\n\n\n<h2>Macworld recommends: Safe to upgrade, but…</h2>\n\n\n\n<p>If you’re anxious to get your hands on the new features that are ready right now, upgrading to macOS Monterey should be a smooth experience. It’s not a massive overhaul over Big Sur, and while there may be some new bugs that get discovered after the final release, as we said, Apple tends to issue patches quickly.</p>\n\n\n\n<p>But if what you’re waiting for is Universal Control or SharePlay, there’s nothing wrong with waiting to upgrade until those features are ready. You also get the added benefit of point-release updates that fix new bugs.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"27153a204305a223e86359b87b9633ba95e68d9325bae69bd188389d35ec09d3","category":"Apple"}