{"title":"BBC’s “Sport’s Strangest Crimes” Digs into the Death of Marco Pantani","link":"https://bikerumor.com/bbcs-sports-strangest-crimes-digs-into-the-death-of-marco-pantani/","date":1687417440000,"content":"<p>The BBC’s Sport’s Strangest Crimes has released a 10-episode podcast series digging into the mysterious death of legendary climber Marco Pantani, aka il Pirato… The Pirate. With fresh evidence brought forth by his family, a wide variety of the world’s top racers, journalists, and experts weigh in to see if he, and his story, can finally be laid to rest.</p>\n\n\n\n<p><strong>PRESS RELEASE:</strong> The colorful life and tragic death of Marco Pantani remains one of the most compelling stories in sports history.</p>\n\n\n\n<p>Hosted by comedian and cycling fan Hugh Dennis, this new BBC Radio 5 Live podcast will attempt to uncover what really happened to the man known as ‘The Pirate’. Widely regarded as the best climbing specialist in the history of cycling, Pantani was unbeatable. A rock star of cycling, the Italian national hero was rarely out of the press for his achievements, alongside allegations of doping, race-fixing, and corruption.</p>\n\n\n\n<p>But when Italy’s greatest cyclist was mysteriously found dead, sensational allegations of mafia involvement saw the world of cycling collide headfirst with the murky underworld of organized crime.</p>\n\n\n\n<p>With cycling-obsessed host Hugh Dennis, Pantani: Death of a Pirate will take listeners from the mountains of rural Italy, to the shady commercial underbelly of a sport on the rise, as we hear from mafia experts, journalists, historians, the police, and big names in the world of cycling, including MattRendell and Phil Liggett. Together, with an iconic era of cycling providing the backdrop, they will all consider one of the most dramatic and tantalizing questions in sports history… would the mafia really kill a cyclist?</p>\n\n\n\n<p>Hugh Dennis says: “‘Would the mafia really kill a cyclist?’ has to be one of the strangest questions ever asked in cycling… and yet, ten episodes later, here we are. Saddle in – sorry – for one of the craziest stories you’ll ever hear, about the mysterious death of one of the most incredible climbers the sport has ever seen.”</p>\n\n\n\n<p>The podcast will be released in full as a boxset on Thursday, June 22. <a href=\"https://www.bbc.co.uk/sounds/brand/p09k7ctp\" target=\"_blank\">Stream every episode here</a>, and listen to <a href=\"https://www.bbc.co.uk/sounds/play/p0fvl6f0\" target=\"_blank\">the series trailer here</a>.</p>\n<p>The post <a href=\"https://bikerumor.com/bbcs-sports-strangest-crimes-digs-into-the-death-of-marco-pantani/\">BBC’s “Sport’s Strangest Crimes” Digs into the Death of Marco Pantani</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Tyler Benedict","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"271ab62db41951e168c99aaa1af74f28a6af45158d65b75645129be7c601195a","category":"Cycling"}