{"title":"BikeRadar Rides | A lap of the Isle of Wight","link":"https://www.bikeradar.com/features/routes-and-rides/bikeradar-rides-a-lap-of-the-isle-of-wight/","date":1632942016000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/BikeRadar-Rides-The-Wight-Stuff-07-b57f03f.jpg?quality=90&amp;resize=620,413\" />                                            <p>One sunny morning, Matt Baird, the editor over at BikeRadar’s sister title, <a href=\"https://www.cyclingplus.com/\">Cycling Plus magazine</a>, and I cycled off the ferry from Southampton to East Cowes.  We were here on the Isle of Wight to ride the perimeter of the island – around 65 miles – in a day.</p>\n<p>The Isle bills itself as a cycling island. And a walking island. And a running island. If it moves, the marketing team tag and sell it.</p>\n<p>It’s also a fossil island, with professional and amateur palaeontologists flocking here, with finds as old as 130 million years.</p>\n<p>However, this set-adrift land only broke from the mainland around 8,000 years ago at the end of the last Ice Age. Sea levels rose, flooding the Solent.</p>\n<p>This didn’t stop enterprising Celts populating the island and it was they who gave it its name in 400BC, Wight meaning ‘place of the division’.</p>\n<p>What lies beneath, then, is a huge pull for dinosaur hunters. What sits above is equally appealing for bike riders, as the roads are the smoothest you’ll find anywhere in the UK.</p>\n<p>I’m no engineer, but having ridden in France I read that their smoother surfaces are down to using less-coarse asphalt because of lower rainfall.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A circuit of the island can easily be covered in a single day’s ride.</span></figcaption><span> <i>Steve Sayers / Immediate Media</i></span></div>\n<p>I can’t verify this, but the Isle does enjoy less rain. Whatever the reason, potholes are a pockmark reserved for the British mainland.</p>\n<p>The roads are also quiet. Usually. But as we climbed out of East Cowes and headed toward the east coast and Nettlestone on our lap of the island, traffic was busier than normal thanks to the rise of the ‘staycation’.</p>\n<p>Things soon settled down once we passed Osborne House, the former residence of Queen Victoria and the place where she departed this mortal coil.</p>\n<p>It’s worth a visit, as ornate furnishings and artefacts decorate the rooms and corridors where Victoria entertained heads of state; in fact, echoes of the empire emanate from every chamber including the frankly psychedelic Durbar Room, designed by Rudyard Kipling’s father John Lockwood in an elaborate Indian style.</p>\n<p>Our languid, relaxed pace was mirrored by the lazy mobile connection – a plus point on holiday but, if you’re married to GPS, download the route to your <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">bike computer</a> first.</p>\n<p>Then again, it’s not really necessary as the route is clearly signposted, whichever direction you’re circumnavigating the island. Chapeau to the marketing board from technophobes like I.</p>\n<p></p>\n<h2>Sea-ing is believing</h2>\n<p>The east side of the island is characterised by a series of climbs that rise and fall sharply.</p>\n<p>It’s hardly severe, but they are still numerous and steep enough to hurt when you’re tipping the scales at a packet of peanuts over 14 stone.</p>\n<p>I’ve always prided myself on endurance, a proliferation of slow-twitch muscle fibres easing this two-wheeled tortoise to the finish.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Glorious views are a good distraction on the climbs.</span></figcaption><span> <i>Steve Sayers / Immediate Media</i></span></div>\n<p>Sadly, slow-twitchers come at the expense of hare-like fast-twitchers, meaning this is a route profile that cuts deep. It’s death by a thousand inclines.</p>\n<p>Editor Matt has no such issues, his lithe nine-stone stature rising up the hills with the metronomic confidence of the garlic bulbs bursting into life at the side of the country lanes we’re riding.</p>\n<p>They’re an Isle staple, with French soldiers in the Second World War discovering that garlic flourished here due to the chalky soil, light and unique climate.</p>\n<p>The section towards Bembridge is arguably the most workmanlike of the ride, though pleasant enough with chilled flat stretches beneath canopies of trees.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Fast-twitcher meets slow-twitcher on multiple climbs.</span></figcaption><span> <i>Steve Sayers / Immediate Media</i></span></div>\n<p>For an island tour, the first 25km are devoid of sea views, but that changes at Bembridge.</p>\n<p>This is home to many of the island’s wealthiest residents, a place where yachts bob away beneath the Earl of Yarborough Monument, a massive obelisk of granite to commemorate the man who was the first Commodore of the Royal Yacht Squadron at Cowes.</p>\n<p>If it’s an imposing nod to the island’s maritime past, Sir Ben Ainslie is a nod to its present.</p>\n<p>The Olympic sailing legend lives in Seaview on the north-east of the Isle and there’s talk that his team, Ineos Team UK, will compete in the next America’s Cup, with Cowes mooted as the venue.</p>\n<p>If it happens, it’d be over 170 years since the first America’s Cup was contested around this land.</p>\n<p>Anyway, the roads then narrowed and flattened and we were spewed out somewhere familiar – hazily familiar.</p>\n<p>For this was Appuldurcombe House, the shell of a large 18th-century Baroque country house that doubled as my wedding venue.</p>\n<p>On that Saturday in late-March 2018, attendees at what they’d term the world’s coldest wedding (climatically not emotionally) witnessed us both forgetting the first dance, no doubt a blessing for all present.</p>\n<p>Then my wife fell asleep before we cut the cake, and my dad and best man had to carry her to bed.</p>\n<p>The bits we can remember are memorable, but not as memorable as the goings-on of former owner Sir Richard Worsley, who gained notoriety for insisting his wife, Seymour, accept countless lovers – up to 27 – so he could satiate his voyeuristic sexual urge by observing through the keyhole.</p>\n<p>It was one of 18th-century Britain’s greatest scandals and was immortalised in the 2015 film The Scandalous Lady W starring Natalie Dormer.</p>\n<h2>The hunt for food</h2>\n<p>We headed further west to Niton and the salubrious environs of Norris’s family grocers for a banquet of prawn wrap, chicken breast, cashew nuts and water to refill electrolyte-fizzing bottles.</p>\n<p>It proved revitalising but also highlighted the paucity of bike provisions, especially on the south of the island.</p>\n<p>Make sure you’re well fuelled for heading up the west side as a gradual, grinding ascent to Blackgang burns a match or two. It’s well worth the effort, though, as the views are incredible.</p>\n<p>Where the east was dominated by hedgerows and trees, the west is open fields that draw your senses to the English Channel.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The climbs reward with views of the English Channel.</span></figcaption><span> <i>Steve Sayers / Immediate Media</i></span></div>\n<p>We descended at speed before drawing to an abrupt halt at the base of Blackgang to reprise a childhood memory, for here is the theme park that’d lit up the imagination of many a child’s summer holidays.</p>\n<p>Blackgang Chine, opened in the 1840s, is the oldest theme park in the UK.</p>\n<p>Its original remit of offering scenery and curiosity to the middle classes led to its most famous attraction, a large whale skeleton washed up by nearby Needles.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Make sure you’re well fuelled for heading up the west side as a gradual, grinding ascent to Blackgang burns a match or two.</span></figcaption><span> <i>Steve Sayers / Immediate Media</i></span></div>\n<p>It’s still a showpiece today alongside the Rumpus Mansion, the Valley of the Dodos and Cowboy Town. It’s a ramshackle, eccentric and charming park and an antidote to modern-day sterility – so much so that it’s featured in the book, <em>Bollocks to Alton Towers</em>.</p>\n<p>The Military Road then carried us through the often-windswept Area of Outstanding Beauty and along the Tennyson Heritage Coast. Here, there are few buildings and a wild and desolate atmosphere.</p>\n<p>Roadkill is common, despite the appreciated paucity of cars, but life flourishes, too, with birds of prey above, resting on fence posts and watching fields of alpacas. Or llamas. I’m never quite sure which is which.</p>\n<h2>Straight outta Compton</h2>\n<p>The official route deviates inland to pass Brighstone and its rows of thatched cottages and traditional farmhouses.</p>\n<p>It’s here that we took a breather for further fuel and fluids, boosting flagging glucose levels.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Thirsty work, but someone’s got to do it.</span></figcaption><span> <i>Steve Sayers / Immediate Media</i></span></div>\n<p>More specifically, we’re in the car park of Compton Beach, aka fossil nirvana with its famous dinosaur footprint that’s still visible at low tide.</p>\n<p>It’s an outlier among subtler fossilisation, so if like me the only fossil you’d recognise is a concentric ammonite and your Isle ride coincides with a holiday, I’d recommend a guided fossil-hunting tour.</p>\n<p>Either that or persist with trying to convince your family that the white pebble you’ve picked up is a dinosaur tooth.</p>\n<p>We were around 75-80km in and the longest ascent of the day awaited, made easier by the still sunny conditions.</p>\n<p>The exposed ridge overlooking Freshwater can resemble a wind tunnel, however, so bear that in mind for autumnal adventures.</p>\n<p></p>\n<p>Hit the peak, suck in the view, breathe in the sea air and enjoy an exhilarating descent into Freshwater where 65kph registered on my computer. I smiled, then nervously smiled.</p>\n<p>My inner Vincenzo Nibali was replaced by, well, my 44-year-old father-of-two me and I scrubbed some speed. It was still memorable, just safely memorable.</p>\n<p>Freshwater celebrates the cerebral with an annual literary festival. Its most famous writer was Poet Laureate Alfred Tennyson, who sought escape from his legion of fans in the 1850s.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Exhilarating descents are aplenty, not least on the road to Freshwater.</span></figcaption><span> <i>Steve Sayers / Immediate Media</i></span></div>\n<p>Charles Dickens and Enid Blyton were both reportedly inspired by the isle, as is current resident Alan Titchmarsh, whose raunchy novels inspired The Guardian to call Alan’s style “sex in a pullover”.</p>\n<p>The remainder of the ride was characterised by more sedate stimulation: peaceful country lanes, wildflowers and rolling roads through the town of Newton.</p>\n<p>This is where our photographer’s ebike ran out of power. Steve’s grin turned to a grimace, his bike from friend to foe.</p>\n<p>With around 10km to go, Steve’s ride had arguably just begun. He dug deep and against grey clouds creeping over from the mainland’s Lowry-like industrial backdrop – this time of Fawley oil refinery rather than Salford – we reached our West Cowes finish line, more than seven hours after we set off, albeit a good portion of that devoted to stops for photography.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Journey’s end: from a land bridge to a ship’s bridge.</span></figcaption><span> <i>Steve Sayers / Immediate Media</i></span></div>\n<p>There is a heaven that shines over the Isle of Wight, especially for road cyclists. The safe, fast, smooth roads are mainly traffic-free, and a sense of history and beauty pervades every pedal stroke.</p>\n<p>It’s one of the sunniest places in England, enjoying an average 37 hours of weekly sun compared to a mere 29 on the mainland.</p>\n<p>With more than 1,350m of climbing, from short, sharp pitches on the east side to longer, shallower drags on the west side, a lap of the island is a wonderful, challenging day for all, with committed masochists having the option to ride both clockwise and anti-clockwise in the same day.</p>\n<section><div>\n        <h4>Local knowledge</h4>\n<p><strong>Distance:</strong> 104km/65 miles<br /><strong>Total Elevation:</strong> 1,350m/4,429ft<br /><strong>Grade:</strong> Naughty steep pitches crank up the difficulty<br /><strong>Route:</strong> <a href=\"https://www.komoot.com/tour/428899729\" target=\"_blank\">Download the full route on Komoot</a> or use the QR code</p>\n<p><strong>Where to stay:</strong> We stayed at Pebbles Lodge, Gurnard, on the west side of Cowes. The lodges are in the owner’s garden and are comfortable and clean. Just remember to close the side gate so the owner’s dog doesn’t escape! It was £100 for the night and we booked via booking.com. We stayed overnight and returned to the mainland the following morning but this ride is easily doable in a day, meaning a foot-passenger day ticker is also an option.</p>\n<p><strong>Where to eat:</strong> Our late finish, drained energy resources and Euro 2020 football on the telly saw us acquire less-than-textbook refuelling via Sainsbury’s Indian ready-meals. The next morning, before our ferry back to the mainland, we enjoyed breakfast at Joliffe’s Eatery in Cowes. I had the tasty eggs benedict but would recommend something a little less saucy if followed by cycling.</p>\n<p><strong>Find, plan and share adventures with komoot:</strong> <a href=\"https://www.bikeradar.com/advice/buyers-guides/guide-to-using-komoot/\" target=\"_blank\">Komoot</a> is an app that lets you find, plan and share adventures with the easy route planner. Driven by a desire to explore, and powered by the outdoor community’s recommendations it’s komoot’s mission to inspire great adventures, making them accessible to all.</p>\n<p>\n\n    </p></div>\n            <div>\n            <div>\n                <div><img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/BikeRadar-Rides-The-Wight-Stuff-12-7d623d7.png?quality=45&amp;resize=556,556\" /></div></div>\n        </div>\n    </section><p> </p>","author":"James Witts","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"271dc7dad1f33914492bf8eb849774110241e197bfaa8963988cbe8806cc5615","category":"Cycling"}