{"title":"Modified mRNA Mediated CCN5 Gene Transfer Ameliorates Cardiac Dysfunction and Fibrosis Without Adverse Structural Remodeling","link":"https://www.preprints.org/manuscript/202404.1934/v1","date":1714402566000,"content":"Modified mRNAs (modRNAs) are an emerging delivery method for gene therapy. In particular, the modRNA-based COVID-19 vaccines have proven that modRNA is a safe and effective therapeutic tool. Moreover, modRNA has the potential to treat various human diseases including cardiac dysfunction. Acute myocardial infarction (MI) is a major cardiac disorder that currently lacks curative treatment options. MI is commonly accompanied by fibrosis and impaired cardiac function. Our group previously demonstrated that the matricellular protein CCN5 inhibits cardiac fibrosis (CF) and improves cardiac dysfunction. However, it remains elusive whether the early intervention of CF under stress conditions is beneficial or more detrimental due to potential adverse effects such as left ventricular (LV) rupture. To obtain acute CCN5 expression, we used modRNA-mediated gene transfer in a mouse MI model. To evaluate CCN5 activity, we established two independent experimental schemes: 1) preventive intervention and 2) therapeutic intervention. Cardiac function and structural changes were measured by echocardiography and magnetic resonance imaging. Finally, fibrosis and the underlying molecular pathway were analyzed by western blotting, quantitative real-time polymerase chain reaction, and immunohistochemistry.\nThe modRNA-CCN5 gene transfer successfully ameliorated CF and enhanced cardiac function in both preventive and therapeutic interventions without LV rupture or any adverse cardiac remodeling. Conclusively, early intervention in CF by modRNA-CCN5 gene transfer is an efficient and safe therapeutic modality for treating MI-induced heart failure without adverse structural remodeling.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"272b6a485056ae769cdcb70cfaac42b16084590c8dd8d94f90e96151d332af86","category":"Interdisciplinary"}