{"title":"257 Total degradable and undegradable protein and carbohydrate supply to dairy cows from the newly developed blended fat stimulated feed product in comparison with commercial protein and energy feeds","link":"https://academic.oup.com/jas/article/102/Supplement_3/358/7757235?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The objectives of this study were to determine total rumen degradable and undegradable protein and carbohydrate supply to dairy cows from the newly developed value-added blended fat stimulated feed product (BFSFP) in comparison with commercial protein and energy feeds. The new blended fat stimulated feed products with three-batch samples (BFSFP1, BFSFP2, BFSFP3) were developed. Barley grain samples (n = 3) and canola meal samples (n = 3) were obtained from Canadian Feed Research Center. Total rumen degradable and undegradable protein and carbohydrate supply to dairy cows were determined using the updated Cornell Net Carbohydrate and Protein System. The treatment design was a one-way structure. The experimental design was a CRD with feed treatments as a fixed effect. The data were analyzed using the Mixed model procedure of SAS. Tukey method was used for mean separation. The results showed that compared with commercially available energy-rich and protein-rich feeds, the BFSFP had less (<span>P</span> &lt; 0.05) total degradable protein supply to dairy cows (TRDP: 17.0 vs. 23.9, 7.4%DM) and total undegradable protein supply (TRUP: 13.9 vs. 17.8, 5.1%DM) than canola meal and greater than barley grain. For carbohydrate degradable and undegradable supply to dairy cows, the results showed that the BFSFP had greater (<span>P</span> &lt; 0.05) total degradable carbohydrate supply to dairy cows (TRUC) than canola meal and less than barley grain (TRDC: 26.0 vs. 20.8, 56.6%DM, respectively). The BFSFP had greater total undegradable carbohydrate supply (TRUC) than canola meal and barley grain (supply (TRUC: 30.3 vs. 28.7, 26.6%DM, respectively, <span>P</span> = 0.09).</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2730b06ed6ba06464ad3c74e925aa08e27a1f184c84437e7b8ecd594eb247f13","category":"Environment"}