{"title":"Novel glassbox based explainable boosting machine for fault detection in electrical power transmission system","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309459","date":1724853600000,"content":"<p>by Iqra Akhtar, Shahid Atiq, Muhammad Umair Shahid, Ali Raza, Nagwan Abdel Samee, Maali Alabdulhafith</p>\r\n\r\nThe reliable operation of electrical power transmission systems is crucial for ensuring consumer’s stable and uninterrupted electricity supply. Faults in electrical power transmission systems can lead to significant disruptions, economic losses, and potential safety hazards. A protective approach is essential for transmission lines to guard against faults caused by natural disturbances, short circuits, and open circuit issues. This study employs an advanced artificial neural network methodology for fault detection and classification, specifically distinguishing between single-phase fault and fault between all three phases and three-phase symmetrical fault. For fault data creation and analysis, we utilized a collection of line currents and voltages for different fault conditions, modelled in the MATLAB environment. Different fault scenarios with varied parameters are simulated to assess the applied method’s detection ability. We analyzed the signal data time series analysis based on phase line current and phase line voltage. We employed SMOTE-based data oversampling to balance the dataset. Subsequently, we developed four advanced machine-learning models and one deep-learning model using signal data from line currents and voltage faults. We have proposed an optimized novel glassbox Explainable Boosting (EB) approach for fault detection. The proposed EB method incorporates the strengths of boosting and interpretable tree models. Simulation results affirm the high-efficiency scores of 99% in detecting and categorizing faults on transmission lines compared to traditional fault detection state-of-the-art methods. We conducted hyperparameter optimization and k-fold validations to enhance fault detection performance and validate our approach. We evaluated the computational complexity of fault detection models and augmented it with eXplainable Artificial Intelligence (XAI) analysis to illuminate the decision-making process of the proposed model for fault detection. Our proposed research presents a scalable and adaptable method for advancing smart grid technology, paving the way for more secure and efficient electrical power transmission systems.","author":"Iqra Akhtar","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"27384d8e5669f41dbccb051eba4a70bbb9806940500c65346e534a7e6a8b4a76","category":"Interdisciplinary"}