{"title":"Coconut: Expanding avenues in processing and an exposition on non‐conventional value‐added products","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13764?af=R","date":1722235421000,"content":"<h2>Abstract</h2>\n<p>Coconut palm (<i>Cocos nucifera</i>) is a treasured tree of the tropics, with every part put to use. The edible portions are loaded with diverse nutrients and nutraceutical ingredients. While the unique mineral profile of the liquid endosperm, the low-glycemic inflorescence sap (neera) and the medium-chain triglyceride fraction of coconut oil are better recognized, other fractions such as the haustorium remain underexplored. Overall, it is evident that, globally, the present status of coconut value addition is conventional, limited to a handful of products, and novel products hold a promising scope. A massive fraction of global coconut production goes for culinary and religious purposes. In the article, value-added products from coconut are classified into conventional and non-conventional products, with the latter in focus. Based on the part from which it is collected, all products have been categorized as haustorium-based, inflorescence-based, kernel-based and water-based products. For each non-conventional product introduced, its production approach and unique application range are highlighted. Given its health-promoting capabilities, characteristic sensorial attributes, wide application range and technological advancements, coconuts are increasingly being recognized around the world, even in regions that do not cultivate them; this applies to non-food products as well. In the context of value-added products from coconuts, this decade has witnessed a surge in research and commercial interest considering the inclusion of coconut as an ingredient in several food and nutraceutical products. The future will certainly consider regulatory protocols and standards, better documentation of the health impact of coconut-based diets, and the sustainability of coconut production, processing and consumption. © 2024 Society of Chemical Industry.</p>","author":"Sarangapany Ashwin Kumar, \nAditi Negi, \nParamasivam Santhoshkumar, \nJeyan Arthur Moses, \nVadakkepulppara Ramachandran Nair Sinija","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"273c49c1c918ec03992a4afe2e0e9d9cfa950cd08912806bf1c5c471fdf8d678","category":"Environment"}