{"title":"Effect of Gender Composition on Modern Contraceptive Uptake Among Married Women of Reproductive Age in Pakistan: A Facility-Based Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202410.1871/v1","date":1729758732000,"content":"Pakistan is confronted with a formidable challenge of high population growth, compounded by cultural norms prioritizing male offspring, leading to adverse implications for family planning (FP) efforts and demographic trends. Despite efforts to promote contraception, including a national family planning program, Pakistan continues to struggle with low and stagnant contraceptive prevalence rates and high unmet contraceptive needs among married women. The influence of gender composition on modern contraceptive uptake remains underexplored, necessitating research to elucidate its impact on reproductive behavior. This study was based on a secondary analysis of a facility-based cross-sectional survey conducted in six districts of Sindh and Punjab provinces in Pakistan. A subset of 495 married women of reproductive age (MWRA) seeking health services from March to June 2019 was used for this study. Logistic regression analysis was employed to examine the association between the gender composition of children and MWRA’s modern contraceptive uptake, adjusting for covariates such as province, age of women, and health facility type. The analysis revealed a significant association between the gender composition of children and modern contraceptive uptake among MWRA. As the number of daughters increased without sons, the likelihood of contraceptive uptake remained low (Adjusted odds ratio [AOR]: 0.12; 95% CI: 0.04–0.34, p &lt; 0.000), while having at least one son substantially increased the odds of contraceptive use (AOR: 19.91; 95% CI: 8.00–49.50, p &lt; 0.000). Notably, the gender composition of one daughter with two sons emerged as the most preferred gender composition, because the odds of contraceptive uptake were significantly increased. The findings highlight the pervasive influence of gender composition on reproductive decision-making in Pakistan, with a clear preference for sons driving modern contraceptive behavior among MWRA. These results underscore the need for targeted interventions to address gender norms and biases while promoting equitable access to FP services. Engaging men in FP initiatives is crucial for challenging traditional gender norms and fostering informed decision-making regarding contraception. Gender preference influences modern contraceptive uptake among MWRA in Pakistan, with a strong preference for sons driving reproductive behavior. Addressing gender norms and biases while promoting informed choice is essential for enhancing modern contraceptive uptake and achieving sustainable population growth. Targeted interventions, including male engagement strategies, are needed to challenge societal gender norms and empower individuals to make autonomous decisions regarding family planning.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"274ea80c9158049d1ef513cafec3ed1ae3aa9c6146a282ab726b63696e36de2a","category":"Interdisciplinary"}