{"title":"The underlying architecture of musical sensibility: One general factor, four subdimensions, and strong genetic effects","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15227?af=R","date":1727522033000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/6930d9bd-2294-4c68-9fb2-f0599717ad92/nyas15227-gra-0001-m.png\" alt=\"The underlying architecture of musical sensibility: One general factor, four subdimensions, and strong genetic effects\" />\n<p>This study examines the underlying structure and the genetic and environmental etiology of musical sensibility, understood as the tendency to be emotionally and aesthetically engaged by music. Our results provide preliminary evidence of a common musical sensibility factor. We further found that the heritable influences on the different dimensions of musical sensibility were strong (49–65%) and highly overlapping.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Current evidence suggests moderate heritability of music phenotypes, such as music listening and achievement. However, other fundamental traits underlying people's interest in music and its relevance for their lives have been largely neglected, and little is known about the genetic and environmental etiology of what we refer to as musical sensibility—the tendency to be emotionally and aesthetically engaged by music. This study investigated the latent structure, as well as the genetic and environmental factors influencing individual variability in multiple domains of musical sensibility, and the etiological architecture of the relationship between the dimensions. To this end, we used phenotypic confirmatory factor analytic and biometric twin modeling to analyze self-reported ratings on four dimensions of musical sensibility in a sample of Norwegian twins (<i>N</i> = 2600). The results indicate a phenotypic higher-order structure, whereby both the resulting general musical sensibility factor and the conceptually narrower domains were strongly heritable (49–65%). Multivariate analyses of the genetic and environmental covariance further revealed substantial overlap in genetic variance across domains.</p>","author":"Heidi Marie Umbach Hansen, \nEspen Røysamb, \nOlav Mandt Vassend, \nNikolai Olavi Czajkowski, \nTor Endestad, \nAnne Danielsen, \nBruno Laeng","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"274e3218fc433fb1ccc1a02d2881b16dd526c26ea4fbac9d09e5a3a22d996c65","category":"Environment"}