{"title":"Assessing Rheology Effects and Pore Space Complexity in Polymer Flow Through Porous Media: A Pore‐Scale Simulation Study","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036125?af=R","date":1716447600000,"content":"<h2>Abstract</h2>\n<p>Non-Newtonian fluid flow within porous media, exemplified by polymer remediation of contaminated groundwater/aquifer systems, presents complex challenges due to the fluids' complex rheological behavior within 3D tortuous pore structures. This paper introduces a pore-scale flow simulator based on the OpenFOAM open-source library, designed to model shear-thinning flow within porous media. Leveraging this developed solver, extensive pore-scale flow simulations were conducted on μ-CT images of various real and synthetic porous media with varying complexity for both power-law and Cross-fluid models. We focused on the macroscale-averaged deviation between bulk viscosity and the in-situ viscosity, commonly denoted by a shift factor. We provided an in-depth evaluation of the shift factor's dependency on the fluid's rheological attributes and the rock's pore space complexity. The least-squares fitted values of the shift factor fell in the range of 1.6–9.5. Notably, the most pronounced shift factor emerged for extreme flow behavior indices. Our findings highlight not just the critical role of rheological parameters, but also demonstrate how the shift factor fluctuates based on tortuosity, characteristic pore length, and the cementation exponent. In particular, less porous/permeable systems with smaller characteristic pore lengths exhibited larger shift factors due to higher variations of shear rate and local viscosity in narrower flow paths. Additionally, the shift factor increased as rock became more tortuous and heterogeneous. The introduced pore-scale simulation proves instrumental in determining the macroscopic averaged shift factor. This, in consequence, is vital for precise computations of viscosity and pressure drop when dealing with non-Newtonian fluid flow in porous media.</p>","author":"Mehdi Amiri, \nJafar Qajar, \nAli Q. Raeini, \nAmir Raoof","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"2751653a99fbb5ec1e604e8b3c710d2feb4b6bf4c6059ef55628526754ac8207","category":"Environment"}