{"title":"Evaluating equity, diversity, and inclusion in Canadian Postgraduate Medical Education: A cross-sectional analysis of online content","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307584","date":1724767200000,"content":"<p>by Mohamed Bondok, Mostafa Bondok, Liana Martel, Christine Law</p>\r\nBackground <p>Medical graduates applying to Residency through the Canadian Resident Matching System (CaRMS) utilize the internet to gather information on programs and their overarching Postgraduate Medical Education (PGME) Office. This study aims to evaluate how PGME websites across Canada convey their commitment to equity, diversity, and inclusion (EDI) through their website features.</p> Methods <p>Cross-sectional analysis of the 17 Canadian PGME websites against 20 EDI criteria based on contemporary literature, across five domains: leadership and governance, recruitment, accommodations, community engagement, and pathways to entry. Non-parametric testing was conducted to explore the relationship between EDI performance and municipal population diversity and geographic region.</p> Results <p>The evaluation of PGME websites, policies, reports, and plans revealed a mean score of 8.65/20 (SD = 3.00), with scores ranging from a minimum of 4/20 to a maximum of 13/20, indicating variability in EDI representation. Specifically, the domain of leadership and governance demonstrated the highest mean proportion of completed criteria (51%), while community engagement had the lowest (24%). Notably, 9 out of 17 PGME websites (53%) met at least 10 EDI criteria. Analysis by geographic region demonstrates significant mean differences (p = 0.02), with Ontario (10.50, SD = 2.17) and Western Provinces (11.00, SD = 0.00) scoring notably higher than Quebec (4.50, SD = 0.58), the Prairies (8.50, SD = 2.12), and the Atlantic region (8.00, SD = 2.83).</p> Conclusions <p>The assessment of Canadian PGME websites reveals varying levels of commitment to EDI. While many programs exhibit strong EDI representation in mission statements, access to mental health services, and anti-discrimination policies, there are notable gaps in leadership messaging, diverse interview panels, family-friendly policies, and deliberate recruitment of underrepresented groups. Regional differences highlight the need for sharing best practices to promote inclusivity across the country. Improving EDI efforts on PGME websites can promote the recruitment and retention of a diverse resident population.</p>","author":"Mohamed Bondok","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"276426319f6f08a9f6c795502bf7f31f95097004ff6101da34a128a881c5b117","category":"Interdisciplinary"}