{"title":"Why the [expletive] can’t we travel back in time?","link":"https://arstechnica.com/?p=1815029","date":1638275439000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-97583266-800x534.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-97583266.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/detail-from-albert-einsteins-general-theory-of-relativity-news-photo/97583266?adppopup=true\"> David Silverman / Staff</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Look, we’re not <i>totally</i> ignorant about time. We know that the dimension of time is woven together with the three dimensions of space, creating a four-dimensional fabric for the Universe. We know that the passage of time is relative; depending on your frame of reference, you can slip forward into the future as gently as you please. (You just need to either go close to the speed of light or get cozy with a black hole, but those are just minor problems of engineering, not physics.)</p>\n<p>But as far as we can tell, we can’t reverse the flow of time. All evidence indicates that travel into the past is forbidden in our Universe. Every time we try to concoct a time machine, some random rule of the Universe comes in and slaps our hand away from the temporal cookie jar.</p>\n<p>And yet, we have no idea why. The reasons really seem random; there is nothing fundamental we can point to, no law or equation or concept that definitively explains why thou shalt not travel into the past. And that’s pretty frustrating. It’s obvious that the Universe is telling us something important… we just don’t know what it’s saying.</p></div><p><a href=\"https://arstechnica.com/?p=1815029#p3\">Read 43 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1815029&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"276a069e7b468ee8c339671fbd48600e9e4111c3a05bf3db476d613e8b6c1df5","category":"Tech"}