{"title":"Enhancing Motor Performance and Physical Fitness in Children with Developmental Coordination Disorder Through Fundamental Motor Skills Exercise","link":"https://www.preprints.org/manuscript/202409.2200/v1","date":1727429089000,"content":"A lack of evidence exists regarding the intervention effect on motor performance, including the timing ability and health-related physical fitness, of children with developmental coordination disorder (DCD). We aimed to assess the effects of school-based intervention that improves fundamental motor skills (FMS) on the motor performance and health-related physical fitness of children with DCD. The participants were 55 children (age 8 – 9 years) with DCD. Children with DCD were randomly assigned to either the intervention group (n = 27) or control group (n = 28). The intervention group participated in FMS training. The control group participated in a conventional physical education class. Motor performance was evaluated before and after the intervention using the Test of Gross Motor Development, second edition, Movement Assessment Battery for Children, second edition, and Interactive Metronome. Health-related physical fitness was assessed using the physical activity promotion system. A significant difference was observed when we considered the interaction effect of the intervention and time regarding motor performance and health-related physical fitness; however, no significant difference was observed regarding body composition. In conclusion, the intervention showed significant improvements in the parameters evaluated, suggesting that a school-based intervention to improve FMS may effectively improve the motor performance and health-related physical fitness of children with DCD.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"27825aa39cb51d240417324695dd6d0817c8d7ab1272bb856626a7f38e71bc89","category":"Interdisciplinary"}