{"title":"What’s the difference between Campagnolo’s road groupsets?","link":"https://www.cyclist.co.uk/news/10091/what-s-the-difference-between-campagnolo-s-road-groupsets","date":1631624926000,"content":"<span>\n      <span><a href=\"/authors/joseph-delves\">Joseph Delves</a></span>\n  </span><div>  \n  <div>      <div><span>14 Sep 2021</span></div>    </div></div><p>\nGroupsets Explained: We look at the differences between all of Campagnolo’s road bike groupsets</p>\n<div>\n      <p> Out of the three leading groupset manufacturers, Italian firm Campagnolo is the smallest but most storied. Accounting for a volume of sales inversely proportional to the number of mechanics with its logo tattooed somewhere about their body, its products inspire unusual levels of devotion.</p>\n<p>Formerly the stuff of dream bike builds, the increase in the cost of Shimano’s top-tier offerings might yet spark something of a renaissance for the Vicenza-based firm. Always a high-end manufacturer, Campagnolo long since ceded the entry-level and mid-market to its less tasteful rivals. Allowing it to concentrate solely on racing products plus its Ekar gravel range, its groupsets have a reputation for durability, beautiful aesthetics, and premium pricing.</p>\n<p>With such a focused range, many technologies appear across multiple groupsets in the firm’s range. Currently producing a single electronic groupset, this is the much lusted after Super Record EPS 12-speed. Below this sits the 12-speed mechanical options of Super Record, Record, and Chorus, plus the Centaur 11-speed groupset. Supplemented by the dedicated Ekar 13-speed gravel groupset, which uses a single front chainring, you can find a breakdown of each groupset’s key features and how it compares to its rivals below.</p>\n<h3>What’s the difference?</h3>\n<p>Campagnolo’s more expensive groupsets have increased numbers of gears, lower weight, and the option of electronic shifting. That said, shared technology means key areas like braking power are often standardised across several tiers. Well known for its use of materials like titanium and carbon fibre, the look and feel of the groupsets also change as you spend more. Always a firm to go its own way, it’s worth noting that while Campagnolo will work on any bike and with most wheels, you may need to swap the freehub on your rear wheels to accommodate the brand’s uniquely shaped cassettes.</p>\n<p>Below you’ll find a quick explanation of each of Campagnolo major road bike groupsets, along with a list of its key features and variants.</p>\n<h3>Every Campagnolo road groupset compared…</h3>\n<h3>Campagnolo Super Record EPS 12-speed</h3>\n<p><strong>Verdict:</strong> Outrageously light, very expensive, and a tad clunkier looking than Shimano. Still the choice of the well-healed cognoscenti.</p>\n<p><strong>RRP:</strong> £4,110<br />\n<strong>Cassette:</strong> 12-speed<br />\n<strong>Largest sprocket:</strong> 32t<br />\n<strong>Shifting:</strong> Electronic only<br />\n<strong>Brakes:</strong> Hydraulic disc or conventional calliper<br />\n<strong>Overall Weight:</strong> 2,255g approx (disc version)</p>\n<p>The first firm to launch a 12-speed groupset in 2018, Campagnolo followed it up with this electronic version a year later. The company’s non plus ultra, its extensive use of carbon fibre makes it incredibly light. Also pretty eye-wateringly expensive, its rrp is a tad over £4,000. Aimed very much at going fast, it still offers some concessions to those yet to win themselves a pro contract. This includes a cassette option that provides a 32t largest sprocket, which, when twinned with a compact 50/34t crankset, should see anyone over even very steep climbs. Part of the second generation of electronic groupset Campagnolo has produced, the firm’s familiar shifting remains. This sees the brake lever take no part in shifting your gears. Instead, a lever behind it accomplishes the upshift, while a tumb-activated tab inside of the hood moves the gears in the opposite direction. Despite the switch to electronic motors, the system retains most of the reassuring clunk that Campagnolo is known for. This is evident in the shifters, whose design pretty much removes the possibility of miss-shifts, and how the derailleurs deposit the chain solidly onto the selected sprocket or chainring. A wired system in an increasingly cable-free world, shifters and derailleurs are connected to a central battery pack that lives in the seatpost. Like rival Shimano, but unlike Sram, Campagnolo offers Super Record EPS in both conventional calliper and disc brake configurations. Borrowing the same disc callipers as found on its other ranges, these are notable for their excellent modulation.</p>\n<p><a href=\"/%20https%3A//www.cyclist.co.uk/news/6146/campagnolo-launches-12-speed-super-record-eps\" target=\"_blank\">Read our review here</a></p>\n<h3>Campagnolo Super Record 12-speed</h3>\n<p><strong>Verdict:</strong> Far and away the best mechanical groupset you can buy if you can stomach the price</p>\n<p><strong>RRP:</strong> £2,857<br />\n<strong>Cassette:</strong> 12-speed<br />\n<strong>Largest sprocket:</strong> 34t<br />\n<strong>Shifting:</strong> Mechanical<br />\n<strong>Brakes:</strong> Hydraulic disc or conventional calliper<br />\n<strong>Overall Weight:</strong> 2,050g approx (disc version)</p>\n<p>Campagnolo’s top-end mechanical groupset shares many components with the electronic ESP version. In fact, almost everything but the shifters and derailleurs carries over. Leaving it even lighter, the non-electric version also manages a trick that its pricier sibling can’t yet accomplish. This comes in the form of its ability to accommodate cassettes with sprockets as large as 34t. Allowing everyday riders to take on slopes normally reserved for the most sadistic stages of La Vuelta, it’s a slight nod towards average cyclists from an otherwise race-focused groupset. Again accomodating disc or conventional calliper options, the timeless look of the main components nicely complement either version. While you might have to rely on your digits rather than a pair of servo motors to do the shifting, Super Record does have perhaps the most efficient mechanical shifting of any group. Allowing you to drop down the cassette three cogs or up five via a single push of the corresponding lever, this is more than on any other groupset. Equally lovely is the operation of the crankset. Made of hollow carbon fibre bonded to a titanium axle, it’s ridiculously light. Running on Cult ceramic bearings, its design epitomises the firm’s approach to small details.</p>\n<p><a href=\"/reviews/4571/campagnolo-super-record-12-speed-groupset-review\" target=\"_blank\">Read our full review here</a> </p>\n<h3>Campagnolo Record 12-speed</h3>\n<p><strong>Verdict:</strong> A marginally more affordable version of the world’s best 12-speed mechanical groupset</p>\n<p><strong>RRP:</strong> £2,000<br />\n<strong>Cassette:</strong> 12-speed<br />\n<strong>Largest sprocket:</strong> 34t<br />\n<strong>Shifting:</strong> Mechanical<br />\n<strong>Brakes:</strong> Hydraulic disc or conventional calliper<br />\n<strong>Overall Weight:</strong> 2,450g approx (disc version)</p>\n<p>Still a very premium product, the regular Record groupset shares many components and does an almost remarkably similar job to the posher Super Record group. However, while features like the chain, cassettes, and brakes are identical, other components have been tweaked to bring their prices a little closer to earth. In doing so a few bits of titanium become steel, such as the axle on the carbon crankset or the bolts on the derailleur. Touches like the bottom bracket’s ceramic bearings are also jettisoned. Still, we’re talking about less than 200 grams added across the entire groupset. The gearing ratios offered are still the same while stopping power is identical. Again allowing the same wide up or downshifts, the shape of the hoods is subtly different to that found on Super Record, while the levers themselves lose some weight-saving cutouts. On the plus side, you do get the firm’s Vari-Cushion technology which aims to provide comfort and support even in poor weather.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/buying-guides/10066/what-s-the-difference-between-shimanos-road-groupsets\">What’s the difference between Shimano's road groupsets?</a></div>      <div><a href=\"/8745/campagnolo-ekar-13-speed-1x-gravel-groupset\">Campagnolo goes 13-speed with its Ekar 1x gravel groupset</a></div>      <div><a href=\"/news/6146/campagnolo-launches-12-speed-super-record-eps\">Campagnolo launches 12-speed Super Record EPS</a></div>      <div><a href=\"/news/6342/campagnolo-chorus-12-speed-groupset\">Campagnolo Chorus 12-speed groupset review</a></div>    </div></div><h3>Campagnolo Chorus 12-speed</h3>\n<p><strong>Verdict:</strong> An attractive and good value mechanical alternative to Shimano with outstanding durability and an additional 12th sprocket.</p>\n<p><strong>RRP:</strong> £1,699<br />\n<strong>Cassette:</strong> 12-speed<br />\n<strong>Largest sprocket:</strong> 34t<br />\n<strong>Shifting:</strong> Mechanical<br />\n<strong>Brakes:</strong> Hydraulic disc or conventional calliper<br />\n<strong>Overall Weight:</strong> 2,580g approx</p>\n<p>Is Chorus the Campagnolo groupset for the rest of us? Previously pitched as a slightly premium competitor to Shimano’s Ultegra range, the decision to make that groupset electronic-only leaves Chorus without an obvious rival. However, as Shimano is heading towards offering mechanical shifting as an entry-level only product, we can see a lot more bikes switching to this groupset. For one thing, you get twelve sprockets at the back. You also get a healthy serving of carbon fibre goodness across the groupset. Finding its way into everything from the crank arms to the rear derailleur body, other parts are now aluminium or steel. However, taken as a whole, Chorus is no heavyweight. With an eye on both the gravel and sportive market, it also offers a wide range of ways to spread out its 2x12-speed gearing. These include a sub-compact 48/32t crankset, along with the ability to accommodate a 34t largest cassette sprocket. Allowing for an easiest 1:1 gearing ratio, this should put the kibosh on ever having to get off and push. With most components explicitly made for the groupset, the brakes and rotors again carry over from Campagnolo’s higher echelons. </p>\n<p><a href=\"/news/6342/campagnolo-chorus-12-speed-groupset\" target=\"_blank\">Read our full review here</a>.</p>\n<h3>Campagnolo Centaur 11-speed</h3>\n<p><strong>Verdict:</strong> Lack of disc-brake options make this competent groupset of niche interest</p>\n<p><strong>RRP:</strong> £650<br />\n<strong>Cassette:</strong> 11-speed<br />\n<strong>Largest sprocket:</strong> 32t<br />\n<strong>Shifting:</strong> Mechanical<br />\n<strong>Brakes:</strong> Conventional calliper only<br />\n<strong>Overall Weight:</strong> 2,470g Approx</p>\n<p>Denuded of carbon fibre and forced to debase itself by looking for work among more proletarian bicycles, Centaur is Campagnolo’s entry-level groupset. Available only with conventional rim brake callipers, it currently finds itself fishing in a much-reduced pool when it comes to getting itself included on new bikes. However, as an aftermarket product, it still has much to recommend it. For one, you get a not inconsiderable 11 sprockets on the back. Aesthetically and functionally, it still borrows from its posher siblings. This is most notable in the construction of the Ultra-Torque axle system crankset and the shape and operation of the shift and brake levers. Despite its much-reduced price, you still get a lot of the distinct Campagnolo feel. From the ergonomics and function of the shifters to the reassuring way each gear change registers, it’s all pure Campy. Durability versus other makers groupsets is also very creditable. Unfortunately, the lack of disc brakes will make it a non-starter for many riders, while the fact you can only fit a 32t largest sprocket means it’s not the most beginner-friendly option out there either.</p>\n<h3>Campagnolo Ekar 13-speed</h3>\n<p><strong>Verdict</strong>: A fantastic wide-ratio 13-speed mechanical gravel groupset that suggests the shape of things to come</p>\n<p><strong>RRP:</strong> £1,449<br />\n<strong>Cassette:</strong> 13-speed<br />\n<strong>Largest sprocket:</strong> 44t<br />\n<strong>Shifting:</strong> Mechanical<br />\n<strong>Brakes:</strong> Hydraulic disc</p>\n<p>So tied up with road racing culture, the forward-thinking Ekar gravel groupset took many by surprise. This 13-speed single-chairing mechanical system has a vast range of clever features. Billed as the world’s lightest gravel groupset, perhaps the biggest headline is its thirteen sequential gears which are linked up to a single chainring. However, it’s not just the number of gears on offer but the range that sets Ekar apart. Its cassette goes from a tiny nine teeth up to a vast 44t. Able to offer the same range typically provided by twin-chainring setups, small jumps between the first few cogs mean shifts made when pedalling at high-speed won’t unsettle riders. Made of two pieces of intricately machined steel, the cassette’s 44t maximum sprocket keeps the bike rolling on even the steepest grades. To accommodate this colossal range, Campagnolo has created a new N3W freehub standard. Now, while most people won’t rejoice at the introduction of another standard, this one does at least accomplish something worthwhile, plus it’s retrofittable to many existing wheels. Other parts are also pretty special, like the rear derailleur with a clutch function to retain the chain or the incredibly light but tough carbon crankset. With just one side doing the shifting, the Ekar’s Ergopower lever uses the same upshift paddle ergonomics as Campagnolo’s road levers and can shift up to three sprockets at a time. However, the unique downshift lever is C-shaped to allow you to drop down gears either from the hoods or facilitate downshifting from the drops. Now brought in-house, Ekar’s disc brake callipers are similar feeling to those on other Campagnolo groups but ever so slightly more powerful. Of course, some firms will tell you electric is the future for gravel. However, we’re not so sure, and this groupset is part of the reason why.</p>\n<p><a href=\"/8745/campagnolo-ekar-13-speed-1x-gravel-groupset\" target=\"_blank\">Read our first impressions of the Ekar groupset here</a> </p>\n<h3>How does each Campagnolo groupset compare with its immediate neighbour?</h3>\n<p>Not sure whether to damage your bank balance or go conservative when choosing your next groupset? To help you decide, we’ve listed the main differences between each groupset and its nearest neighbour in the Campagnolo hierarchy. Highlighting instances where you get more for your money and others where you can get equal performance for less cash, here’s how they match up.</p>\n<h3>Super Record EPS vs Super Record</h3>\n<p>A nice easy one to start. Almost the only fundamental difference between Super Record EPS and Super Record is the EPS groupset’s electronic shifting. This means that while the derailleurs and shifters differ, every other component remains the same. Otherwise, the only additional variance is the mechanical groupset’s ability to accommodate a bigger 34t sprocket than the 32t max that the ESP derailleur can manage. Unsurprisingly, you’ll pay more for electronic shifting. About £1,400 more. The EPS system’s battery and wiring also leave it around 200 grams heavier, although that’s neither here nor there.</p>\n<h3>Super Record vs Record</h3>\n<p>As we shift down from the mechanical Super Record to the similarly mechanical Record groupset, not a lot changes. Visually and mechanically very similar, a few bits of titanium and carbon fibre are replaced. This sees components like the axle on the crankset switched to steel, while some carbon parts in the derailleur become aluminium. However, the cumulative effect is to add less than 200 grams to the groupset’s overall weight. Considering that Super Record is about £800 more expensive, that’s a lot of quids per gram. You also lose out on the Cult ceramic bearings found in the more expensive groupsets bottom bracket. The shape of the levers changes slightly too, although with Record using Campagnolo’s Vari-Cushion technology, this might not be a downgrade depending on your tastes.</p>\n<h3>Record vs Chorus</h3>\n<p>Price fluctuations seem to have brought Chorus closer to Record in terms of cost. Still, even if the jump up another level is now smaller, there’s a lot to recommend the more recently released Chorus Groupset. For one thing, you get the same 12-speeds. It also shares the same excellent disc brakes as the rest of Campagnolo’s higher tiers. More consumer-focused than any of the Record ranges, you also get additional gearing options like the useful sub-compact 48/32t crankset. The operation of the groupset is still very much campy in style, and you get flashy carbon cranks. Of course, there are some trade-offs, but overall weight is less than two hundred grams more than its posher sibling. All this makes Chorus the best value Campagnolo groupset.</p>\n<h3>Chorus vs Centaur</h3>\n<p>Many of the prominent Campagnolo designs trickle their way down the brand’s cheapest groupset. This means you’ll get a two-piece Power Torque crankset and the familiar shifter design. However, more flashy features are absent. Also missing is the ability to run disc brakes, which will make this a non-viable option for many riders. In a way, this is a shame, as the switch down to 11-speed leaves the budget Centaur groupset highly durable. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/bikes\">Bikes</a></div>    </div></div>","author":"jdelves","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"278af970017b305378e9ad10c1520d1f9b51a92bfaaeaf35d9d2d0cf98ba365c","category":"Cycling"}