{"title":"In-kernel WireGuard is on its way to FreeBSD and the pfSense router","link":"https://arstechnica.com/?p=1749817","date":1615847989000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/wireguard-freebsd-desktop-800x450.png\" alt=\"Screenshot of WireGuard's fearsome logo.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/wireguard-freebsd-desktop.png\" class=\"enlarge-link\" data-height=\"720\" data-width=\"1280\">Enlarge</a> <span class=\"sep\">/</span> FreeBSD is getting its own in-kernel WireGuard module in the near future, thanks to a sponsored code contribution from Netgate, followed by additional code and review from Jason Donenfeld and several FreeBSD and OpenBSD developers. (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://www.wireguard.com/\">WireGuard / Jim Salter</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>This morning, WireGuard founding developer Jason Donenfeld <a href=\"https://lists.zx2c4.com/pipermail/wireguard/2021-March/006494.html\">announced</a> a working, in-kernel implementation of his WireGuard VPN protocol for the FreeBSD 13 kernel. This is great news for BSD folks—and users of BSD-based routing appliances and distros such as <a href=\"https://www.pfsense.org/\">pfSense</a> and <a href=\"https://opnsense.org/\">opnSense</a>.</p>\n<p>If you're not familiar with WireGuard, it establishes connections more quickly than traditional VPNs like OpenVPN. It's also, in our personal experience, overwhelmingly more reliable when managing large numbers of connections. Your author used to spend several hours a month shelling into machines and manually re-establishing broken OpenVPN tunnels, even <em>after</em> writing watchdog scripts to attempt to detect and re-establish them automatically—tearing it all out and replacing this several-hundred-machine-monitoring network with WireGuard-based infrastructure cut that down to \"zero hours per month.\"</p>\n<p>In addition to performance and reliability, WireGuard brings modern protocols, versioned crypto that literally cannot be set up incorrectly, and a far cleaner, lighter codebase than most competitors—Linus Torvalds once declared it \"a work of art\" by comparison to OpenVPN and IPSec.</p></div><p><a href=\"https://arstechnica.com/?p=1749817#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1749817&comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"27933521988f7f8507e1e4d96f4df3ed52c7e6721a0276bb03322684b11b0bcf","category":"Tech"}