{"title":"The curious case of the Dana platypus and what it can teach us about how lead shotgun pellets behave in fluid preserved museum specimens and may limit their scientific value","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309845","date":1729260000000,"content":"<p>by Henrik Lauridsen, Daniel Klingberg Johansson, Christina Carøe Ejlskov Pedersen, Kasper Hansen, Michiel Krols, Kristian Murphy Gregersen, Julie Nogel Jæger, Catherine Jane Alexandra Williams, Ditte-Mari Sandgreen, Aage Kristian Olsen Alstrup, Mads Frost Bertelsen, Peter Rask Møller</p>\r\n\r\nFluid preserved animal specimens in the collections of natural history museums constitute an invaluable archive of past and present animal diversity. Well-preserved specimens have a shelf-life spanning centuries and are widely used for e.g. anatomical, taxonomical and genetic studies. The way specimens were collected depended on the type of animal and the historical setting. As many small mammals and birds were historically collected by shooting, large quantities of heavy metal residues, primarily lead, may have been introduced into the sample in the form of lead shot pellets. Over time, these pellets may react with tissue fluids and/or the fixation and preservation agents and corrode into lead salts. As these chemicals are toxic, they could constitute a health issue to collection staff. Additionally, heavy element chemicals interfere with several imaging technologies increasingly used for non-invasive studies, and may confound anatomical and pathological investigations on affected specimens. Here we present a case-study based on platypus (<i>Ornithorhynchus anatinus</i>) and other small mammals containing lead pellets from the collection of The Natural History Museum of Denmark.","author":"Henrik Lauridsen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"279768c095c88522df1c26f2649b2efdef664c94b93588cb39350a83533c1b6c","category":"Interdisciplinary"}