{"title":"Anthropic รายงานการศึกษา AI กลุ่ม LLM ต้องมองเป็นเป็นกลุ่มนิวรอน","link":"https://www.blognone.com/node/136141","date":1696773507000,"content":"<div><div><div><p>การพัฒนาของปัญญาประดิษฐ์กลุ่มโมเดลภาษาขนาดใหญ่ (large language model - LLM) ทำให้มีความพยายามศึกษาการทำงานโครงสร้างภายในของโมเดลเหล่านี้ว่ามัน “คิด” อย่างไร และตอนนี้ Anthropic ผู้สร้าง Claude AI ก็ออกมารายงานถึงแนวทางการศึกษา LLM ว่าควรมองเป็นกลุ่มนิวรอน เรียกว่าฟีเจอร์</p>\n<p>ที่ผ่านมาการศึกษาปัญญาประดิษฐ์กลุ่ม deep learning โดยเฉพาะในงานที่เป็นการจัดการภาพนั้น มักจะพบว่านิวรอนแต่ละตัวถูกกระตุ้นโดยอินพุตที่ตรงไปตรงมา เช่น นิวรอนบางตัวอาจจะถูกกระตุ้นโดยภาพแมวเท่านั้น บางตัวถูกกระตุ้นโดยภาพหมา เราสามารถวิเคราะห์อย่างละเอียดได้ว่าอินพุดแบบใดจึงกระตุ้นนิวรอนเหล่านี้ แต่ใน LLM เมื่อมองเป็นนิวรอนรายตัว Anthropic กลับพบว่านิวรอนแต่ละตัวถูกกระตุ้นในภาวะที่ต่างกันไปจนหารูปแบบไม่ได้</p>\n<p>ทาง Anthropic เสนอว่าแทนที่จะมองนิวรอนรายตัว ควรมองเป็นกลุ่มของนิวรอนและดูจากรูปแบบการกระตุ้นของทั้งกลุ่มนั้น เรียกว่าฟีเจอร์ เมื่อมองการกระตุ้นของฟีเจอร์โดยรวมแล้วจะพบรูปแบบที่ชัดเจนขึ้น บางฟีเจอร์ถูกกระตุ้นเมื่อเห็นลำดับ DNA, บางฟีเจอร์ถูกกระตุ้นเมื่อเห็น HTTP request, และบางกลุ่มถูกกระตุ้นเมื่อเห็นภาษาฮีบรู</p>\n<p>การทดลองอย่างหนึ่งคือระหว่างการใส่อินพุตเป็นชุดของตัวเลข แต่บังคับกระตุ้นฟีเจอร์บางกลุ่ม ก็จะทำให้เอาท์พุตของโมเดลโดยรวมเป็นไปตามลักษณะของฟีเจอร์นั้นๆ เช่น กระตุ้นกลุ่มภาษาจีนกลางก็จะได้เอาท์พุตเป็นภาษาจีนกลาง กระตุ้นกลุ่มภาษาฮีบรูก็จะได้ภาษาฮีบรู, บางฟีเฟอร์สามารถระบุได้ว่าเป็นตัวอักษรภาษาอังกฤษตัวใหญ่</p>\n<p>แนวทางการศึกษาอย่างละเอียดว่าปัญญาประดิษฐ์มองเห็นอะไรจึงให้คำตอบแต่ละคำตอบมาเป็นส่วนสำคัญของการพัฒนาปัญญาประดิษฐ์โดยพยายาทำให้มันปลอดภัยยิ่งขึ้นไปในอนาคต</p>\n<p>ที่มา - <a href=\"https://www.anthropic.com/index/decomposing-language-models-into-understandable-components\">Anthropic</a></p>\n<p><img src=\"https://efficient-manatee.transforms.svdcdn.com/production/images/Frame-111.png?w=2074&amp;h=1352&amp;auto=compress%2Cformat&amp;fit=crop&amp;dm=1696466775&amp;s=c40af83efe25e614bcb12c0e83c44589\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/anthropic\">Anthropic</a></div><div><a href=\"/topics/llm\">LLM</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"27a1b95dd67f000e8c732924e93191220d324436727fec728e76c66fb4e05f35","category":"Thai"}