{"title":"12 Effects of increasing SID lysine (Lys) and metabolizable energy (ME) levels of lactation diets fed to young and multiparous sows","link":"https://academic.oup.com/jas/article/102/Supplement_2/59/7664899?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Providing insufficient lysine to lactating sows can reduce piglet performance and subsequent farrowing performance of sows. Current SID lysine and ME recommendations for lactating sows are approximately 60 g/d and 20 Mcal/d, respectively. Because of variations in feed intake during lactation, a portion of sows do not meet recommended Lys intake levels. There is no clear understanding of the Lys:Calorie ratio when dietary energy is increased in the summer to ensure adequate caloric intake. The objective was to evaluate a potential advantage of feeding diets with SID Lys and energy levels that exceed recommendations to lactating sows. A total of 855 sows were fed during the summer of 2023 in 2×2 factorial arrangement of treatments in a randomized complete block design. Factors included SID lysine [low (0.85%) vs high (1.11%)] and ME [low (3,183 kcal/kg) vs high (3,334 kcal/kg)]. Diets were formulated to deliver 61 g of SID lysine at 0.85% inclusion to sows that consume 7.2 kg of complete feed per day. Primary outcome variables were sow body composition, lactation average daily feed intake (ADFI), average piglet weaning weight, and pre-wean mortality. There were no interactions between treatments (<span>P</span> &gt; 0.05). SID Lys intake was 61.2 and 76.4 g/d for low and high Lys, respectively (<span>P</span> &lt; 0.01). ME intake was 21.9 and 23.4 Mcal/d for low and high energy, respectively (<span>P</span> &lt; 0.01). Contrary to expectations, ADFI did not differ (<span>P</span> = 0.25) between sows fed the low- and high-energy diets, however, sows fed low lysine consumed 0.29 kg more feed (<span>P</span> &lt; 0.01) per day compared with sows fed high lysine. There were no differences (<span>P</span> ≥ 0.70) in the number of piglets born alive for any treatment group. Sows fed high energy had 0.27 fewer (<span>P</span> &lt; 0.01) still-born piglets per litter compared with sows fed low energy. Pre-wean mortality was also reduced (<span>P</span> = 0.05) by 0.76 percentage units in litters of sows fed the high-energy diet compared with litters of sows fed the low energy. Lysine level had no effects on farrowing and litter performance (<span>P</span> &gt; 0.05). Litters from sows fed the high-energy diet gained 1.2 kg more (<span>P</span> = 0.05) body weight during lactation and tended to result in litter-weaned weights that were 1.5 kg heavier (<span>P</span> = 0.06) than litters from sows fed the low-energy diet. Feeding a diet with a greater lysine concentration during lactation reduced feed intake but did not affect litter performance. In contrast, increasing dietary energy immediately before farrowing and during lactation did not affect sow feed intake but reduced pre-wean mortality and resulted in fewer still-born piglets, greater litter gains, and heavier litter weaning weights.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"27aff5fb2ae14dda77ff28458a3ffd09c5902adc155e31bcc97ab5fa2baebc4e","category":"Environment"}