{"title":"Study: These ancient straight-shelled cephalopods lived the vertical life","link":"https://arstechnica.com/?p=1786458","date":1628875905000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/cephalopod3CROP-B-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/cephalopod3CROP-B.jpg\">Enlarge</a> <span>/</span> Reconstruction of the orthocone ammonite <em>Baculites compressus</em>. A new study reveals that the creatures likely lived a vertically oriented lifestyle. (credit: David Peterman)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The fossil record is chock-full of the fossilized remains of spiral-shelled <a href=\"https://en.wikipedia.org/wiki/Ammonoidea\">ammonoids</a>, whose shapes are reminiscent of rams' horns. But there was another type of ammonoid with long, straight, uncoiled shells, known as <a href=\"https://en.wikipedia.org/wiki/Orthocone\">orthocones</a>, that particularly flourished during the early <a href=\"https://en.wikipedia.org/wiki/Paleozoic\">Paleozoic</a>. Prior reconstructions have depicted these creatures as being horizontal swimmers, similar to today's squid.</p>\n<p>But a new investigation that involved dropping 3D-printed models into water tanks reveals that most species of orthocones would not have been able to swim well horizontally. Instead, the creatures likely led a vertically oriented lifestyle, moving leisurely up and down through the water column to hunt and sometimes executing rapid upward dodges as needed to avoid predators, according to <a href=\"https://peerj.com/articles/11797/\">a recent paper</a> published in the journal PeerJ.</p>\n<p>Co-authors David Peterman and Kathleen Ritterbush are paleontologists at the University of Utah. They previously developed digital models of ammonoids with coiled shells to investigate the evolution and lifestyle of these creatures. This time, they've turned their attention to a species of orthocone cephalopods (<em>Baculites compressus</em>) that lived during the Cretaceous period. The authors hypothesized that there must be some adaptive benefit to having a straight shell, since the spiral shell of the orthoconic ammonoids has evolved several times in different lineages found in the fossil record.</p></div><p><a href=\"https://arstechnica.com/?p=1786458#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1786458&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"27b55108b9aa0662ff243c8ea9c893323724b7b9b205171f45a63c9f882fd73e","category":"Tech"}