{"title":"Windows 11 SE won’t be sold separately, can’t be reinstalled once removed","link":"https://arstechnica.com/?p=1812074","date":1636644644000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/Windows_11_SE_Bloom_Screensaver-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/Windows_11_SE_Bloom_Screensaver.jpg\">Enlarge</a> <span>/</span> Windows 11 SE's default wallpaper.  (credit: Microsoft)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Microsoft is taking the fight to Chromebooks in schools with the <a href=\"https://arstechnica.com/gadgets/2021/11/the-latest-surface-is-a-250-laptop-that-takes-a-swing-at-cheap-chromebooks/\">$250 Surface Laptop SE</a>, but inexpensive hardware is only part of the equation. One reason Chromebooks have succeeded in education is because of Chrome OS, which is well-suited for lower-end hardware, easy for IT administrators to manage, and hard to break with errant apps or malware.</p>\n\n<p>Microsoft's answer to Chrome OS is <a href=\"https://www.microsoft.com/en-us/education/products/windows-11-se\">Windows 11 SE</a>. Unlike past efforts like Windows in S mode (which is still its own separate thing), Windows 11 SE isn't just a regular version of Windows with a cheaper license or a cut-down version that runs fewer apps. Windows 11 SE defaults to saving all files (including user profile information) to students' OneDrive accounts, and it has had some standard Windows 11 features removed to ensure a \"distraction-free\" learning environment that performs better on low-end devices. The operating system also gives IT administrators exclusive control over the apps and browser extensions that can be installed and run via <a href=\"https://www.microsoft.com/en-us/education/intune?ranMID=24542&amp;ranEAID=fl7OML4te6w&amp;ranSiteID=fl7OML4te6w-NgaEREana3hmXu6XPA1ZEw&amp;epi=fl7OML4te6w-NgaEREana3hmXu6XPA1ZEw&amp;irgwc=1&amp;OCID=AID2200057_aff_7593_1243925&amp;tduid=%28ir__hu9sfphxkwkf6y1ndwtfs1ms2e2xow6qpppy1fqq00%29%287593%29%281243925%29%28fl7OML4te6w-NgaEREana3hmXu6XPA1ZEw%29%28%29&amp;irclickid=_hu9sfphxkwkf6y1ndwtfs1ms2e2xow6qpppy1fqq00\">Microsoft Intune</a>.</p>\n<p>If you're a school IT administrator with a fleet of PC laptops or desktops, you might wonder if you can buy and install Windows 11 SE on hardware you already have so you can benefit from its changes without buying new hardware. The answer, Microsoft tells us, is no. The only way to get Windows 11 SE is on laptops that ship with Windows 11 SE. And if you re-image a Windows 11 SE device with a different version of Windows 10 or Windows 11, it won't even be possible to reinstall Windows 11 SE after that.</p></div><p><a href=\"https://arstechnica.com/?p=1812074#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1812074&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"27bbc98d4ff9d231b9a8f7a37a82a5db73f3961783a1add7f754261b0332950a","category":"Tech"}