{"title":"Industrial structure optimization and green growth in China based on a population heterogeneity perspective","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12487?af=R","date":1715068394000,"content":"<h2>Abstract</h2>\n<p>Population and industrial structure, as foundational characteristics of economic and social systems, exhibit significant spatial heterogeneity and dynamic evolutionary trends in their impact on sustainable economic and social development. However, existing research often employs subjective spatial categorization of samples and overlooks the dynamic transitions of influencing patterns, potentially leading to biases in empirical results. To address this, the current study, based on the calculation of green total factor productivity (GTFP) for 30 provinces in China from 2000 to 2018, incorporates a finite mixture model. This model examines the objective heterogeneity and dynamic transition patterns of industrial structure's impact on GTFP, both from the perspectives of industrial structure advancement (ISA) and rationalization (ISR), and reveals the mechanisms of heterogeneity and dynamic changes from a population standpoint. The findings indicate that there are three patterns in the impact of industrial structure on GTFP, with nearly half of the provinces undergoing pattern transitions during the observation period. The key factors for these transitions are identified as the improvement in human capital levels and urbanization rates. In provinces like Beijing, Guangdong, and Shanghai, ISA and ISR significantly promote GTFP, with their effects further enhanced by increased urbanization and human capital levels. Conversely, in regions such as Shanxi and Hebei, ISA does not favor GTFP improvement, and while ISR can enhance GTFP, this positive effect diminishes with increasing urbanization and labor force numbers. This research not only enriches the literature on the positive interaction patterns between industrial and population structures but also provides a comprehensive analytical framework for governments to adopt differentiated policy measures for sustainable economic development.</p>","author":"Tingting Li, \nWei Dou, \nJing Han, \nWenqing Zhang","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"27bd18c42bdb4ed64c5ce9956cf1f1035fe15f686486965ff8b2a45c50b85bf9","category":"Environment"}