{"title":"Time-varying causality relationships between trade openness, technological innovation, industrialization, financial development, and carbon emissions in Thailand","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304830","date":1717164000000,"content":"<p>by Nguyen Thi Quy, Nguyen Chi Hai, Ha Thi Thieu Dao</p>\r\n\r\nOver the last twenty years, there has been swift growth in industrialization and technological advancements, driving economic progress. Nevertheless, it is inevitable that these sectors will bring about environmental shifts. Thus far, endeavors have been undertaken to assess the influence of industrialization and technological advancements on environmental deterioration. Additionally, the extensive discussion surrounding the impact of financial development, trade openness, and technological innovation on the environment has not yielded conclusive empirical findings. Studies often operate under the assumption of symmetric relationships, potentially leading to biased results. Adding to the discussion on the drivers of carbon neutrality, the time-dependent effects of critical aspects such as financial development and technological innovation should inform meaningful policies for environmental management. This article explores the time-varying causal association between trade openness, industrialization, financial development, technological innovation, and CO2 emissions in Thailand using novel time-varying Granger causality tests. The time-varying causality outcomes demonstrate that the associations change significantly over time, in contrast to the results of Toda-Yamamoto causality. Overall, there exists a bidirectional relationship between industrialization, financial development, trade openness, technological innovation, and CO2 emissions over different time sequences. These outcomes have implications for both policy and research.","author":"Nguyen Thi Quy","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"27c4a823484c0aa422aa7f60efd035e3c3de31ae323a34e58c934da06353220a","category":"Interdisciplinary"}