{"title":"168 Evaluate the digestibility effects of alfalfa-bermudagrass mixtures on beef cattle in the Deep South","link":"https://academic.oup.com/jas/article/102/Supplement_1/46/7618002?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>In the Deep South, one of the hardest times of year for cattle producers is the summer due to extreme temperatures and low-quality perennial forages. Incorporating a high-quality crop like alfalfa (Medicago sativa) into forage mixtures could be economically advantageous; however, there is not much alfalfa produced in the Deep South. Therefore, our objective was to evaluate the effects of forage type on in vivo digestibility and nutrient balance in beef cattle systems. There was also an interest in differing conserved forage types, so we analyzed digestion dynamics influenced by various conserved forage types. Three treatments including bermudagrass (Cynodon dactylon) hay, alfalfa baleage, and alfalfa-bermudagrass baleage were supplied to four fistulated steers (average 412.34 kg +/- 41.25 kg) with a calculated daily forage allowance based on intake, body weight, and feed refusals. Each diet was allocated to one of three periods in which all four animals received the same diet due to potential feed spoilage. Each period had a 21-d adaptation period followed by a 5-d collection period to analyze total fecal excretion, feed intake, feed refusal, total urine output, and rumen fluid dynamics. Data were analyzed using R Core Team (2023) and the GLIMMIX procedure of SAS version 9.4 (SAS Inst., Cary, NC). There were significant differences in dry matter digestibility (DMD) between diets (P &lt; 0.0015). We found that alfalfa-bermudagrass baleage had a 9% (+/- 0.058, 95% C.I.) less DMD than bermudagrass hay (P &lt; 0.0088) and alfalfa baleage had a 7% (+/- 0.058, 95% C.I.) greater DMD than bermudagrass hay (P &lt; 0.025). Results indicate that alfalfa baleage provides the most nutrient use efficiency when comparing alfalfa-bermudagrass mixtures. There was no significant conserved forage effect potentially due to baleage quality and inadequate fermentation of the alfalfa-bermudagrass baleage. That said, there is still potential for beef cattle producers in the Deep South to diversify feeding strategies by using nutrient-rich forage additives like alfalfa and different conserved forage methods to increase digestibility, thus increasing returns in their operations.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"27cdf6aa8a1632f959f2e36fbc28a8ce89fb9a2c1b15b209bc9b8dd2a6ec247e","category":"Environment"}