{"title":"An Insight into the Anticancer and Antibacterial Properties of New 4-(Benzylamino)benzoic Acid Derivatives: Synthesis and X-ray Crystallographic Analysis","link":"https://www.preprints.org/manuscript/202409.2060/v1","date":1727334901000,"content":"A prominent class of reactions, reductive aminations are used extensively in research labs and industry to synthesize amines; which are applied in a variety of medicines, agrochemicals, and biomolecules. Amine compounds are essential in many aspects of life; amino groups exist in many natural and agricultural products. New 4-(benzylamino)benzoic acid derivatives with general formula of C14H12NO2R, where [R= (H), (4-Cl), (4-NMe), (4-Br), (3-NO2), (4-NO2), (2-OMe), (3-OMe), (4-OMe), (2,3-OMe), (3,4-OMe), (2-OH, 3-OMe), (3-OMe, 4-OH), (3,5-OMe, 4-OH), (2-OH, 5-Br), (3-OH), (4-SMe), (2,3-OH), (3-CF3)] (compounds 1-19) were obtained by reductive amination reaction via reacting p-amino benzoic acid with benzaldehyde derivatives and sodium borohydride. All prepared compounds has been characterized by a variety of spectroscopic techniques (HRMS, FT-IR, 1H, and 13C{1H} NMR) and elemental analysis. Furthermore, the structure of some of the synthesized derivatives were confirmed by single crystal X-ray diffraction (R = 4-Cl, 4-Br, 2-OMe,  3-OMe, 4-OMe, 2,3-OMe), compounds 2, 4, 7-9 and 11, respectively. Moreover, some of these new compounds have shown somehow moderate antibacterial activities against different strains of bacteria (gram-positive and gram-negative) with MIC values ranging from 64-256 µg/ mL. The anticancer activities of all compounds (IC50 values, µM) were evaluated against different cell lines, HGF (Fibroblasts; normal cell line), A549 (Non-Small Cell Lung Cancer cell line) and H69 (Small Cell Lung Cancer cell line). Compound 18 showed a considerable IC50 value of 90.69 against A549 and an excellent value of 32.22 and H69, respectively.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"27d0693584bc9da6cbc6ae952949f61d992ea64ccf4506cbb2d12416e1bac117","category":"Interdisciplinary"}