{"title":"Best free photo editing app for Mac: Alternatives to Photos","link":"https://www.macworld.com/article/668272/free-mac-photo-editors.html","date":1684505489000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple includes the free Photos app on all Macs, iPhones and iPads, but this app is primarily intended for organising your photo collection, and only has a limited selection of editing tools. </p>\n\n\n\n<p>If you’re a keen photographer and want to have more creative control over your work–but don’t want to pay for the privilege–then take a look at the free photo editing apps for Mac below. We’ve taken a look at the best alternatives to Photos that provide a wider and more powerful set of photo-editing tools. </p>\n\n\n\n<p>In this article we round up the best free photo-editing programs for the Mac, including Adobe Express, Google Photos, Gimp and more. If you don’t mind paying for a decent photo editing app then we recommend you take a look at our round up of the <a href=\"https://www.macworld.com/article/668968/best-photo-editing-software-for-mac.html\">Best photo editing software for Mac</a>, which includes the likes of Adobe Photoshop, Lightroom and Photoshop Express, Pixelmator Pro, Affinity Photo and many more. </p>\n\n\n\n<p>If you were hoping to get Photoshop for free read <a href=\"https://www.macworld.com/article/676673/how-to-get-photoshop-for-mac.html\">How to get Photoshop on a Mac</a>, which includes a section on a way to get Photoshop for free.</p>\n\n\n\n<h2>Best free photo editor for Mac</h2>\n\n\n\n\t\t<div>\n\t\t\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tApple Photos\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img alt=\"Apple Photos\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Photos-app-for-Mac.jpg?quality=50&amp;strip=all\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tFree\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-668272-6-1923381-9934&amp;u=https://www.apple.com/uk/ios/photos/\" target=\"_blank\">$0 at  Apple Photos for iOS </a><a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-668272-6-1923381-9934&amp;u=https://www.apple.com/macos/photos/\" target=\"_blank\">$0 at  Apple Photos for macOS</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>Photos is the free photo editing and image library app on every Mac, iPhone and iPad. It’s completely free, easy to use, and has the benefit of syncing across all your devices if you take advantage of Apple’s iCloud Photo library (for which you will need to pay for <a href=\"https://www.macworld.com/article/672409/how-much-does-icloud-cost.html\">iCloud storage</a>, from $0.99/£0.79 a month for 50GB). </p>\n\n<p>Prior to 2015 Photos on the Mac was iPhoto. When Apple replaced iPhoto with Photos in 2015 it also stopped selling another photo app, Aperture, which offered more advanced image editing. Photos has more in common with Photos for iOS and very little in common with Aperture. It’s not a professional image editing app, but it is easy to use and will do for basic to moderate photo management, and quick image tweaking. </p>\n\n<p>The app is a great a tool for organising your photos. It arranges your pictures and videos into the same Years, Collections and Moments as on iOS. You can assign photos to Albums and Shared Albums and Projects. Searching for images can be made easier by identifying People in them so that you can, for example, see every image featuring a particular person in your library. Add a year to the search to see every photo of that person in that year. You can also search for all your photos with cats, or plants or the sea in them, for example. </p>\n\n<p>If it’s image editing feature you are interested in you can apply the same Instagram-like filters as are available in the iOS version of the app, but you can also adjust light, color, switch to black &amp; white, eliminate red-eye, adjust white balance, reduce noise and sharpen. There’s a Heal tool, but there’s an absence of pen or brush-based tools in the Edit toolkit. You can’t sharpen or blur individual spots in the picture, for example, or fix the brightness/darkness of regions of the picture. Nor can you add text or shapes, or make selections. For a quick edit you can click on the Auto Enhance icon, which adjusts colour and contrast for the image–as a result images tend to look brighter and more colorful. For advice and help read <a href=\"https://www.macworld.com/article/671648/how-to-edit-in-photos-for-mac.html\">How to edit in Photos for Mac</a>. </p>\n\n<p>Photos is both very easy to use and you can edit and improve images, easily share them with friends and family directly (via Shared Albums) or to social networks like FaceBook. But if you want more in the way of editing tool you might need to look further–in which case, check out our alternative options below. </p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/667309/photos-for-mac-review.html\" target=\"_blank\">\n\t\t\t\t\t\tApple Photos review \t\t\t\t\t</a>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tAdobe Express\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img width=\"3466\" height=\"2466\" alt=\"Adobe Express\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Adobe-Express.jpg?quality=50&amp;strip=all\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tFree, or $9.99 a month\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://adobe.prf.hn/click/camref:1011lroIY/pubref:1-1-668272-6-1923128-9928/destination:https://www.adobe.com/express/\" target=\"_blank\">$0 at  Adobe Express Free</a><a href=\"https://adobe.prf.hn/click/camref:1011lroIY/pubref:1-1-668272-6-1923128-9928/destination:https://www.adobe.com/express/pricing\" target=\"_blank\">$9.99 at  Adobe Express Premium (per month)</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>Adobe describes Express–formerly known as Spark–as a tool for ‘social graphics and more’, but this online web app also includes a number of useful photo-editing tools that are available for free through any web browser.</p>\n\n<p>When you log-in to <a href=\"https://adobe.prf.hn/click/camref:1011lroIY/pubref:1-1-668272-1-0-0/destination:https://www.adobe.com/express/\" target=\"_blank\">Express</a> with your web browser, it starts by offering you a variety of templates designed for social media posts, or for creating documents such as posters, menus or even a resume. But, if you just want to do some quick photo-editing work, then you can easily import photos of your own or use some of the free stock photos that are included with Express.</p>\n\n<p>As you import a photo, Express allows you to quickly resize it or pan around in order to focus on a particular part of the image. You then enter the main Express workspace, which includes a selection of simple filter effects, as well as slider controls that allow you to quickly adjust brightness, contrast and other settings. You can import additional photos and superimpose them in order to create a collage, and you can also add text and graphics, including a number of ready-made logos and artwork for creating posters, fliers and other documents. Express even has simple layer controls, which allow you to edit photo, text and graphics elements individually.</p>\n\n<p>The basic version of Express is free to use, but there is a Premium subscription plan that costs <a href=\"https://adobe.prf.hn/click/camref:1011lroIY/pubref:1-1-668272-1-0-0/destination:https://www.adobe.com/express/pricing\" target=\"_blank\">$9.99</a>/<a href=\"https://adobe.prf.hn/click/camref:1011lroIY/pubref:1-1-668272-1-0-0/destination:https://www.adobe.com/express/pricing\" target=\"_blank\">£9.98</a> per month and includes some additional editing tools, as well as a huge library of stock photos, templates, and fonts. Adobe also offers discounts to students, teachers and non-profit organisations, and there’s a <a href=\"https://adobe.prf.hn/click/camref:1011lroIY/pubref:1-1-668272-1-0-0/destination:https://www.adobe.com/express/pricing\" target=\"_blank\">30-day free trial</a> for the Premium option also available.</p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tSeashore\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img alt=\"Seashore\" src=\"https://images.macworld.co.uk/cmsdata/slideshow/3514061/best_free_cheap_mac_photo_editors_seashore.jpg\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tFree\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/seashore/id1448648921&amp;xcust=1-1-668272-6-648967-19572&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">$0 at  App Store</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>Gimp (which we look at later in this article) may be free, but it’s not the most user-friendly program around. Seashore started life as a ‘fork’ of Gimp – a kind of clone that took Gimp as its starting point – but it has developed a distinct identity of its own over the years.</p>\n\n<p>It doesn’t offer the same level of editing power as Gimp, but Seashore is a lot more straightforward to use. A simple toolbar running across the top of the editing window provides quick access to features such as a crop tool, pen, paintbrush, colour dropper, and clone tool. There’s also a Text tool for adding captions and annotations.</p>\n\n<p>As you select each tool, a second context-sensitive toolbar appears below it that offers additional options for that particular tool. So selecting the paintbrush will show options for adjusting the shape and size of the brush, along with features such as different materials and brush textures.</p>\n\n<p>There’s a selection of colour effects and filters, and – unusually for open-source software – it even provides a manual that explains how the various effects work to help you get started. More advanced tools include colour adjustment, and controls for brightness and contrast, along with precise selection tools that allow you to apply edits just to specific areas of an image.</p>\n\n<p>The app also supports layers for creating composite images, and alpha channels for adjusting transparency. The app’s interface is a little eccentric – such as the sneaky vanishing dialogue boxes that sometimes turn transparent while you’re using them – but Seashore is a great option for getting started with photo editing without spending a penny.</p>\n\n<p>You can download it from the \n<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/gb/app/seashore/id1448648921?mt=12&amp;xcust=1-1-668272-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Mac App Store</a>.</p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/666608/seashore-review.html\" target=\"_blank\">\n\t\t\t\t\t\tSeashore review \t\t\t\t\t</a>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tGoogle Photos\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img alt=\"Google Photos\" src=\"https://images.macworld.co.uk/cmsdata/slideshow/3514061/best_free_cheap_photo_editors_mac_google_1600.jpg\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tFree\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://photos.google.com/apps&amp;xcust=1-1-668272-6-657480-10535&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">$0 at  Google</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>For some reason, Google decided to kill off its popular Picasa photo app a few years ago, and its photographic offerings now focus on the online Google Photos service.</p>\n\n<p>This is essentially Google’s version of Apple’s Photos and iCloud. There’s a simple app available for Macs and iOS devices that allows you to upload your photos to the Google website – and videos too, if you want – and then sync them across all your devices (as long as they’re signed into your Google account). You can view all your photos online using a web browser on your Mac, and organise them into albums for easy browsing.</p>\n\n<p>The actual editing tools are pretty basic, limited to a selection of simple filters, and slider controls for adjusting lighting and colour, along with tools for cropping, rotation and adjusting aspect ratio. You can also combine a set of photos to create a collage or animated slideshow, but Google Photos’ editing tools are certainly more limited than Photos on the Mac and most of the other photo-editing apps that we review here.</p>\n\n<p>However, Google Photos does have one big strong point that might tempt you away from simply sticking with iCloud. High-res photos and video can take up a lot of storage space, and when you sign up for a Google account its Google Drive service gives you 15GB of free online storage for your files – compared to just 5GB for iCloud Drive (although, as we mentioned above, you can upgrade your iCloud Drive to 50GB for just $0.99p/£0.79 a month, which is actually pretty good value).</p>\n\n<p>If you’re going on vacation and plan to take a stack of photos on your trip, then it might be worth signing up for Google Photos just for the extra storage, and then using Photos or another app to do some serious editing when you get back home.</p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tGimp\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img alt=\"Gimp\" src=\"https://images.macworld.co.uk/cmsdata/slideshow/3514061/best_free_cheap_photo_editors_mac_gimp_1600.jpg\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tFree\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.gimp.org/&amp;xcust=1-1-668272-6-638122-19666&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">$0 at  GIMP Team</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>Gimp is a popular open-source photo-editor that has been available for many years, and which runs on Macs, Windows and even Linux (its full name is GNU Image Manipulation Program, named after the GNU version of Linux). But while it’s free to download, Gimp’s powerful editing tools are light years beyond the simple selfie filters and effects that you find in most free apps. There are no ads and no in-app purchases to tempt cash out of you, either.</p>\n\n<p>The downside of Gimp’s Linux background is that its interface will come as a bit of a shock to most Mac users. Instead of colourful icons and helpful tools, Gimp fills its main editing screen with dull grey icons and long menus and dialogue boxes containing annoyingly small text descriptions.</p>\n\n<p>The app can also feel a little sluggish when applying some of its more complex effects, which suggests that it hasn’t been optimised to take advantage of Mac-specific technologies such as Apple’s Metal graphics system.</p>\n\n<p>But if you’re determined to avoid spending any money at all then you’ll find that Gimp offers a range of powerful tools that are rarely found in a free app such as this.</p>\n\n<p>There are dozens of filters and effects, with a handy split-screen view that gives you ‘before’ and ‘after’ views of your photos. There are even a few animated effects, such as ‘wave’ and ‘ripple’ that you can use to create GIF files for the web. Gimp also has many of the same editing tools as more expensive rivals such as Photoshop Elements, with precise selection tools, layers, clone brush, and a variety of transformation tools, such as crop, scale and shear. And, if you’re feeling really brave, you can delve into some very powerful and precise colour and lighting controls too.</p>\n\n<p>Gimp is undoubtedly a powerful and versatile photo-editor, and it seems churlish to criticise a free app such as this – but the program’s unfriendly interface could deter quite a few people, so it might be worth parting with some cash if you’d rather work with something a little more user-friendly.</p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tPhotoScape X\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img alt=\"PhotoScape X\" src=\"https://images.macworld.co.uk/cmsdata/slideshow/3514061/best_free_cheap_photo_editors_mac_photoscape_x_1600.jpg\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tFree, Pro costs $39.99\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/photoscape-x-photo-editor/id929507092&amp;xcust=1-1-668272-6-660735-19528&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">$0 at  App Store</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>PhotoScape X is a relative newcomer when compared to photo-editing veterans like Photoshop Elements, but this free app has proved popular with many users on both Macs and Windows PCs. It’s also quite unusual, as it completely ignores the traditional interface design of most of its photo-editing rivals.</p>\n\n<p>Instead of tool bars and palettes, PhotoScape X displays its main editing window with a series of tabs running along the top of the window. Each tab focuses on a specific task, starting with the Viewer tab that provides a quick preview of an entire folder of photos at once.</p>\n\n<p>You can then select a specific photo that you want to work on and switch into the Editor tab. This includes a wide range filters, effects and lighting controls, with a handy ‘Compare’ button that shows ‘before’ and ‘after’ versions of your photos. You can also tidy up your photos using options such as red-eye removal, and a ‘healing’ brush to eliminate scratches and other blemishes.</p>\n\n<p>The other tabs at the top of the editing window tend to focus on working with multiple photos, including the Batch tab, which allows you to crop, resize or apply effects to a whole group of photos all at once. We also like the GIF tab, which allows you to quickly combine a series of photos into an animated GIF for use on the web.</p>\n\n<p>One area where PhotoScape X does fall short is with its rather limited selection tools – which means that you generally have to apply edits and effects to an entire photo rather than selected areas within an image. There is a Pro version of the app available as an in-app purchase that provides additional editing tools for £38.99/$39.99, but that seems a little pricey when compared to affordable rivals such as Pixelmator.</p>\n\n<p>You can download it from the \n<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/gb/app/photoscape-x-photo-editor/id929507092?mt=12&amp;xcust=1-1-668272-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Mac App Store</a>.</p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t</div>\n\n\t\t\n\n\n<p></p>\n\nPersonal Software</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"27d18d9ffe95fcc2b647278277a42bf71138449b916e86f268482aeb0821bdee","category":"Apple"}