{"title":"Computer vision‐assisted photogrammetry and one‐image 3D modeling in marine mammals","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13083?af=R","date":1712234898000,"content":"<h2>Abstract</h2>\n<p>Image processing using traditional photogrammetric methods is a labor-intensive process. The collection of photogrammetry images during aerial surveys is expanding rapidly, creating new challenges to analyze images promptly and efficiently, while reducing human error during processing. Computer vision-assisted photogrammetry, a field of artificial intelligence (AI), can automate image processing, greatly enhancing the efficiency of photogrammetry. Here, we present a practical and efficient program capable of automatically extracting the fine-scale photogrammetry of East Asian finless porpoises (<i>Neophocaena asiaeorientalis sunameri</i>). Our results indicated that computer vision-assisted photogrammetry could achieve the same accuracy as traditional photogrammetry, and the results of the comparisons were validated against the direct measurements. Three-dimensional (3D) models using computer vision-assisted photogrammetric morphometrics generated trustworthy body volume estimates. We also explored the one image-based 3D modeling technique, which is less accurate, but still useful when only one image of the animal is available. Although several limitations exist in the current program, improvements could be made to narrow the virtual-reality gap when more images are available for machine learning and training. We recommend this program for analyzing images of marine mammals possessing a similar morphological contour.</p>","author":"Changqun Zhang, \nHaojie Zhou, \nSheel Shah, \nRandall W Davis, \nYujiang Hao, \nKaung‐Ti Yung, \nKexiong Wang, \nDing Wang","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"27d72e66d386314d196bbd4772e34d5a37df403c03957b71b28e19e93a36a4a3","category":"Environment"}