{"title":"487 Rumen degradation, N-To-Energy Synchronization, and Intestinal digestion Study in dairy cows: Effect of oat varieties and types (feed type vs. milling type)","link":"https://academic.oup.com/jas/article/102/Supplement_3/164/7757008?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This study aimed to determine the impact of four oat varieties and types (feed type vs. milling type) on the rumen degradation kinetics of nutrients, intestinal digestion of nutrients, and N to energy synchronization. Twelve samples [4 varieties (Arborg, Haymaker, Nasser, Summit) × 3 harvested years (2018, 2019, 2020)] were used for in situ rumen incubation analysis, three-step in vitro analysis, and available N to energy synchronization evaluations. The experiment design was RCBD design (oat varieties as a fixed effect and harvested year as a random block effect). Statistical analysis was performed by MIXED procedure model of SAS 9.4, and significance was declared at <span>P</span> &lt; 0.05 and tendency at 0.05 ≤ <span>P</span> &lt; 0.10. Results showed that Haymaker and Arborg oat had higher rate of degradation of degradable fractions (Kd) of dry matter (DM), crude protein (CP), and starch than that of Nasser oat (<span>P</span> &lt; 0.05). Nasser oat had greatest rumen bypass dry matter (BDM, g/kg DM), and rumen bypass feed starch (BST, g/kg DM) in these four varieties (<span>P</span> &lt; 0.05) while the effective degradability of dry matter (EDDM, g/kg DM), effective degradability of feed crude protein (EDCP, g/kg DM), and effective degradability of feed starch (EDST, g/kg DM) of Nasser oat were least among varieties (<span>P</span> &lt; 0.05). There were significant differences in BDM, EDDM, %BST, and EDST between milling oat and feed oat. For the intestinal nutrient digestibility, Summit oat had greatest intestinal digestibility of rumen bypass dry matter (%dBDM) among four varieties (<span>P</span> &lt; 0.05), and the value of intestinal digestible rumen bypass dry matter (IDBDM, g/kg DM) of Summit was greatest in these varieties, which has greater IDBDM (g/kg DM) content than that of Nasser oat (<span>P</span> &lt; 0.05). Nasser oat also had the least total digestible dry matter (TDDM, g/kg DM) in these varieties (<span>P</span> &lt; 0.05). Summit oat had similar intestinal digestibility of rumen bypass protein (%dBCP) with Haymaker and Nasser oat but had greater %dBCP content than that of Arborg oat (<span>P</span> &lt; 0.05). Nasser oat had greater intestinal digestible rumen bypass protein (%IDBCP, % of CP) in these four varieties (<span>P</span> &lt; 0.05), while its value of total digestible protein (TDCP, g/kg DM) was the smallest and the TDCP content of Nasser oat was less than Haymaker oat (<span>P</span> &lt; 0.05). Summit and Arborg oat had greater total digestible feed starch (TDST) than that of Nasser oat (<span>P</span> &lt; 0.05). Significant differences were found on %dBDM, IDBDM, TDDM, and TDST between the feed type and milling type oat (<span>P</span> &lt; 0.05). Haymaker oat had similar ratio of N to organic matter (OM) of the oat (N/OM) with Nasser oat but had greater N/OM content than that of Arborg and Summit oat (<span>P</span> &lt; 0.05).</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"27e3136b4025b15248eb75648da83532d9845be000c21ca1aa05d37c20955099","category":"Environment"}