{"title":"PCWorld ชี้ การมีชิป NPU ในพีซี ไม่ได้ยกระดับการประมวลผล AI มากอย่างที่โฆษณา","link":"https://www.blognone.com/node/137677","date":1705331290000,"content":"<div><div><div><p>เทรนด์ยอดฮิตของวงการพีซีในปี 2024 ย่อมหนีไม่พ้นคำว่า \"AI PC\" ซึ่งหมายถึงพีซีที่มีชิปเร่งความเร็วการประมวลผล AI หรือ Neural Processing Unit (NPU) มาให้ด้วย เช่น <a href=\"https://www.blognone.com/node/135830\">Intel Core Ultra</a> หรือ <a href=\"https://www.blognone.com/node/137122\">Ryzen Mobile บางรุ่นย่อย</a></p>\n<p>อย่างไรก็ตาม Mark Hachman บรรณาธิการอาวุโสของ PCWorld ตั้งข้อสังเกตว่าผู้ใช้อย่างเราๆ ไม่ควรคาดหวังว่า NPU จะกลายเป็นสิ่งมหัศจรรย์ช่วยเปลี่ยนแปลงวงการพีซีไปอย่างสิ้นเชิง เพราะคำว่า AI มีความหมายกว้างมาก ตั้งแต่การสร้างภาพตามคำสั่ง (image generation), โมเดลภาษาขนาดใหญ่ (LLM), แช็ทบ็อท ไปจนถึงฟีเจอร์เฉพาะอย่างในแอพบางตัว (เช่น Photoshop/Lightroom)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/9f81c2fd6cbfbd14b55d04b2a51f4ff5.jpg\" /></p>\n<p>ประเด็นถัดมา Hachman มีโอกาสได้ลองทดสอบโน้ตบุ๊กที่ใช้ Core Ultra 7 165H เครื่องจริง และลองรันเบนช์มาร์ค <a href=\"https://benchmarks.ul.com/procyon/ai-inference-benchmark-for-windows\">Procyon</a> วัดประสิทธิภาพการประมวลผล AI และพบว่าจีพียูยังเป็นแกนหลักอยู่ โดยคะแนนแต่ละส่วนเป็นดังนี้</p>\n<ul>\n<li>Procyon (OpenVINO) NPU: 356</li>\n<li>Procyon (OpenVINO) GPU: 552</li>\n<li>Procyon (OpenVINO) CPU: 196</li>\n</ul>\n<p>เขาชี้ว่าการมี NPU ช่วยยกระดับประสิทธิภาพงานด้าน AI บางประเภทได้จริง แต่สุดท้ายแล้วจีพียูก็ยังสำคัญกว่า แถมประโยชน์ของ NPU ที่แท้จริงไม่ใช่เรื่องประสิทธิภาพ แต่เป็นการใช้พลังงานที่ดีขึ้น ช่วยให้แบตเตอรี่โน้ตบุ๊กใช้ได้ยาวนานขึ้น (ตัวอย่างการใช้งานที่เห็นภาพชัดเจนคือ วิดีโอคอลล์ใน Microsoft Teams เป็นเวลานาน และให้ AI ช่วยตัดเสียงรบกวน เบลอภาพพื้นหลัง แบบนี้ NPU ช่วยให้แบตลดช้าลงได้)</p>\n<p>Hachman สรุปว่าตอนนี้เราเพิ่งเริ่มเข้าสู่ยุค AI PC เท่านั้น การมีชิป NPU ในตัวเป็นเรื่องดี แต่ไม่ใช่สิ่งที่จำเป็นต้องมี เพราะเรารัน AI บนจีพียูได้เสมอ แถมผู้ใช้ส่วนใหญ่คงรัน AI ผ่านคลาวด์กันมากกว่า นอกจากนี้ฮาร์ดแวร์ยังจะพัฒนาไปอีกมาก ตัวอย่างของอินเทลเองคือชิป Lunar Lake รุ่นถัดไปจะออกภายในสิ้นปี 2024 และจะมีประสิทธิภาพ NPU ดีขึ้นกว่าเดิม 3 เท่าด้วย</p>\n<p>ที่มา - <a href=\"https://www.pcworld.com/article/2199565/ai-reality-check-new-npus-dont-matter-as-much-as-youd-think.html\">PCWorld</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/processor\">Processor</a></div><div><a href=\"/topics/core-ultra\">Core Ultra</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"27e50cbc78cb51e3c60402d0c5c7766ec2662e71beecb94ab495059e4f4592ad","category":"Thai"}