{"title":"Role of ionic crystals as interfacial layers in metal‐semiconductor junction","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400028?af=R","date":1719208391000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c10afb77-720b-4ec2-bf26-36574e2c752f/appl202400028-gra-0001-m.png\" alt=\"Role of ionic crystals as interfacial layers in metal-semiconductor junction\" /><p>Inserting an ionic crystal with 1. High Ionicity on Phillips' scale, 2. Large band gap, 3. Low defect formation energy. between metal and semiconductor induces band bending in favor of electron transport and simultaneously mitigates resistive losses; contact resistivity of the contact structure\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Optoelectronic devices performance is governed by the band alignment nature in heterojunctions. Interfacial Layers (ILs) play an immense role in charge carrier-selectivity and their transport behavior. Considering the investigations on a wide array of solid-state surfaces and heterojunctions performed both experimentally and theoretically, we found that the electron localizability, which is quantifiable through the bandgap energy and band width, affects the surface properties of crystals and hence the electronic properties of the interfaces. In combination with other observations, a strategy for contact design is developed for enhancing charge carrier transport across the boundaries and the interfaces, one can optimize stack structures with IL by maximizing their respective transport mechanism, similar to what has been done with silicon solar cells by doping. In this case, charge carrier transport across the interface can be maximized by making the depletion region width smaller without altering the heterojunction barrier's height.</p>","author":"Basil Eldeeb, \nHisham Nasser, \nRaşit Turan","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"27e9f31b6bf7b9aa64c0c00c6508a3df45ab89a901845b20e77220388cf53d56","category":"Environment"}