{"title":"Stay or go? Geographic variation in risks due to climate change for fishing fleets that adapt in-place or adapt on-the-move","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000285","date":1707487200000,"content":"<p>by Jameal F. Samhouri, Blake E. Feist, Michael Jacox, Owen R. Liu, Kate Richerson, Erin Steiner, John Wallace, Kelly Andrews, Lewis Barnett, Anne H. Beaudreau, Lyall Bellquist, Mer Pozo Buil, Melissa A. Haltuch, Abigail Harley, Chris J. Harvey, Isaac C. Kaplan, Karma Norman, Amanda Phillips, Leif K. Rasmuson, Eric J. Ward, Curt Whitmire, Rebecca L. Selden</p>\r\n\r\nFrom fishers to farmers, people across the planet who rely directly upon natural resources for their livelihoods and well-being face extensive impacts from climate change. However, local- and regional-scale impacts and associated risks can vary geographically, and the implications for development of adaptation pathways that will be most effective for specific communities are underexplored. To improve this understanding at relevant local scales, we developed a coupled social-ecological approach to assess the risk posed to fishing fleets by climate change, applying it to a case study of groundfish fleets that are a cornerstone of fisheries along the U.S. West Coast. Based on the mean of three high-resolution climate projections, we found that more poleward fleets may experience twice as much local temperature change as equatorward fleets, and 3–4 times as much depth displacement of historical environmental conditions in their fishing grounds. Not only are they more highly exposed to climate change, but some poleward fleets are &gt;10x more economically-dependent on groundfish. While we show clear regional differences in fleets’ flexibility to shift to new fisheries via fisheries diversification (‘adapt in-place’) or shift their fishing grounds in response to future change through greater mobility (‘adapt on-the-move’), these differences do not completely mitigate the greater exposure and economic dependence of more poleward fleets. Therefore, on the U.S. West Coast more poleward fishing fleets may be at greater overall risk due to climate change, in contrast to expectations for greater equatorward risk in other parts of the world. Through integration of climatic, ecological, and socio-economic data, this case study illustrates the potential for widespread implementation of risk assessment at scales relevant to fishers, communities, and decision makers. Such applications will help identify the greatest opportunities to mitigate climate risks through pathways that enhance flexibility and other dimensions of adaptive capacity.","author":"Jameal F. Samhouri","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"27f9932fa6ea905bb796b6228a9cb6c3220560a63ef8ecc2f8b8ea6f590842d4","category":"Environment"}