{"title":"International Network Structures in Capsule Endoscopy Research: Co-Author Analysis from 2000 to 2023","link":"https://www.preprints.org/manuscript/202408.2141/v1","date":1724943702000,"content":"Aim: To elucidate the international network structures and evolution of collaborations in capsule endoscopy research from 2000 to 2023 by analyzing co-authorship networks.  Method: This study analyzed co-authorship patterns in capsule endoscopy research articles published from 2000 to 2023 using data from the Web of Science (WoS). I employed Python (version 3.10.5) in the PyCharm development environment (version 2022.1.3) to conduct a network analysis using social network analysis principles. The analysis included macro-level metrics (network density, clustering coefficient, components, and average path length) and micro-level metrics (degree centrality, closeness centrality, and betweenness centrality) to assess collaboration intensity, key contributors, and network cohesion.  Result: The co-authorship network analysis revealed evolving collaboration patterns over three distinct periods (2000-2009, 2010-2019, and 2020-2023). Initially, the network exhibited low density and high fragmentation, with key contributors such as Guido Costamagna and Jonathan A. Leighton prominently positioned. Over time, the network expanded with increased density and clustering, though it remained fragmented. In recent years, the network showed increased cohesion with reduced components and notable contributors like Anastasios Koulaouzidis and Xavier Dray, reflecting the growing importance of international collaborations, particularly involving researchers from Japan, Italy, and Israel. Conclusion: The study highlights the dynamic nature of international collaborations in capsule endoscopy research, with increasing connectivity and influential contributors playing pivotal roles in advancing the field. These findings underscore the value of international cooperation in enhancing diagnostic and therapeutic approaches in capsule endoscopy, pointing to future opportunities for deeper collaboration and integration.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"280b5272802dcceb738a223c4730a597b5f55cdb3c267d3aafc7b2df90027c9e","category":"Interdisciplinary"}