{"title":"Apple says it will refuse gov’t demands to expand photo-scanning beyond CSAM","link":"https://arstechnica.com/?p=1785740","date":1628522407000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-security-privacy-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-security-privacy.jpg\">Enlarge</a> (credit: Getty Images | Yuichiro Chino)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Apple today said it will refuse any government demands to expand its new photo-scanning technology beyond the current plan of using it only to detect CSAM (child sexual abuse material).</p>\n<p>Apple has faced days of criticism from security experts, privacy advocates, and privacy-minded users over the plan it announced Thursday, in which iPhones and other Apple devices will scan photos before they are uploaded to iCloud. Many critics pointed out that once the technology is on consumer devices, it won't be difficult for Apple to expand it beyond the detection of CSAM in response to government demands for broader surveillance. We covered how the program will work in detail in an <a href=\"https://arstechnica.com/tech-policy/2021/08/apple-explains-how-iphones-will-scan-photos-for-child-sexual-abuse-images/\">article Thursday night</a>.</p>\n<p>Governments have been pressuring Apple to install backdoors into its end-to-end encryption system for years, and Apple acknowledged that governments are likely to make the exact demands that security experts and privacy advocates have been warning about. In a <a href=\"https://www.apple.com/child-safety/pdf/Expanded_Protections_for_Children_Frequently_Asked_Questions.pdf\">FAQ released today</a> with the title, \"Expanded Protections for Children,\" there is a question that asks, \"Could governments force Apple to add non-CSAM images to the hash list?\"</p></div><p><a href=\"https://arstechnica.com/?p=1785740#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1785740&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"280d69b3c857d6edaaa0cd2edd925b0e5f73bfc5f7eace671c7e3e5828b8dac1","category":"Tech"}