{"title":"Here's How Web Apps Work in macOS Sonoma","link":"https://www.macrumors.com/2023/06/14/how-web-apps-work-macos-sonoma/","date":1686746489000,"content":"In macOS Sonoma, currently in beta, you can create individual web apps for any website that you frequent in Safari, and have them sit beside other apps in your Dock. Let's take a closer look at how it all works by turning MacRumors.com into a virtual Mac app as an example.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/macos-sonoma-web-app-MacRumors.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nIn macOS Sonoma, any website viewed in Safari can be turned into a web app, thanks to a new \"Add to Dock\" option in the File menu. In other words, no work is required on the part of web developers to make a site web app compatible, although there are some elements of web apps that developers can have control over (see below).\r<br />\n\r<br />\n<h2>How to Turn MacRumors into a Web App</h2>\r<br />\n<ol><li>In macOS Sonoma developer beta, navigate to <a href=\"https://www.macrumors.com\">MacRumors.com</a> in Safari.</li>\r<br />\n<li>Choose <strong>File -&gt; Add to Dock</strong> in the menu bar.</li>\r<br />\n<li>If you want, you can change the MacRumors icon by clicking it in the Add to Dock window. You can also edit the web app's name using the title field – \"MacRumors\" is more succinct, for example.</li>\r<br />\n<li>Click the blue <strong>Add</strong> button.</li></ol><img src=\"https://images.macrumors.com/article-new/2023/06/macos-sonoma-tidbits6.jpg\" alt width=\"2880\" height=\"1800\" />\r<br />\n\r<br />\nYou will now see the MacRumors web app sitting in your Dock, ready for use independently of Safari. The web app works with Mission Control and Stage Manager just like any app, and can also be opened via Launchpad or Spotlight Search. \r<br />\n\r<br />\nOn opening the web app, you'll notice its window includes a simplified toolbar with navigation buttons (note: Website developers can control whether these are shown). As you can see in the image, the MacRumors theme color for the site blends into the toolbar for a more seamless look.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/web-app-MacRumors-macos.jpg\" alt width=\"2880\" height=\"1800\" />\r<br />\nIn terms of navigation, the scope of the web app is dictated by the host of the webpage – in this case <a href=\"https://www.macrumors.com\">www.macrumors.com</a> – so you can navigate anywhere within the MacRumors website, but if you click a link outside of the host page, such as the MacRumors Forums, which is separately hosted at <a href=\"http://forums.macrumors.com\">forums.macrumors.com</a>, this will open the linked webpage in Safari. Therefore, if you are a frequenter of both the MacRumors website and the MacRumors Forums, you should create separate web apps for each. \r<br />\n\r<br />\nWeb developers have the ability to refine the scope of a web app to a specific path on their site if they wish. For example, MacRumors could theoretically provide a facility to make web apps dedicated to navigating only how-to articles or guides. This is something MacRumors may implement in the future.\r<br />\n\r<br />\n<h2>Website Logins and Notifications</h2>\r<br />\nBy default, Safari copies a website's cookies to its web app. So if you create a MacRumors Forums web app and you were logged into your account at the time, you will remain logged in inside the web app. Even if you weren't logged in, you can do so within the web app with minimal effort, since Apple has integrated support for Password and Passkey AutoFill.\r<br />\n\r<br />\nIf a website already supports web push notifications – as MacRumors does – and you have <a href=\"https://www.macrumors.com/push/\">signed up to them</a>, you will receive web app push notifications that display the corresponding MacRumors icon, giving you more context than a standard Safari notification and icon would. \r<br />\n\r<br />\nThe web app icon in the Dock will also show a badge when a notification is received. Web app notifications are silent by default, although developers can change them to play a sound. However, the end decision over sound and icon badges is left to the user in <strong>System Settings -&gt; Notifications</strong>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/web-app-notifications-mr.jpg\" alt width=\"1508\" height=\"1218\" />\r<br />\nWeb apps also respect Focus modes, so you can include or exclude them from allowed notifications based on what you're doing. Lastly, with privacy in mind, Apple has added options to control web apps' access to camera, microphone, and location in <strong>System Settings -&gt; Privacy &amp; Security</strong>, just like for native apps.\r<br />\n\r<br />\nFor those who wish to delve further into macOS Sonoma, it is <a href=\"https://www.macrumors.com/how-to/download-macos-sonoma-developer-beta-free/\">currently available to download as a developer beta</a>, although caution is warranted, as beta versions can be unstable and buggy. For those willing to wait, the official public release is expected to land in the fall.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">macOS Sonoma</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macos-sonoma.243\">macOS Sonoma</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/14/how-web-apps-work-macos-sonoma/\">Here's How Web Apps Work in macOS Sonoma</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/heres-how-web-apps-work-in-macos-sonoma.2392933/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"280da97656c1ff82650265c23ae79d7398dd11bee5a0b94c833bac1a6481a450","category":"Apple"}