{"title":"Toward trustworthy COVID-19 interventions: Building vaccine trust through community-university partnerships","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300872","date":1711548000000,"content":"<p>by Laura A. Bray, Lori L. Jervis, Amanda E. Janitz, Laura Ross, Gloria Tallbull, Timothy M. VanWagoner, the CATCH-UP Vaccines Team </p>\r\n\r\nPrior research identifies trust as critical to increase vaccine acceptance and uptake. However, few intervention studies have sought to develop or test strategies for bolstering vaccine-related trust. To address this gap, this exploratory study identifies features of COVID-19 vaccine hesitancy interventions that can promote or undermine trust across three interconnected domains: institutional, interpersonal, and product (the vaccine itself). We draw on focus groups (N = 27 participants) with community and university partners involved with hosting COVID-19 testing and vaccine events in underserved Oklahoma communities. Focus groups explored participants’ experiences serving community health needs and elicited feedback on proposed vaccine hesitancy interventions. Proposed interventions included two technology-based strategies (text message reminders and tablet-based testimonials and education) and one dialogue-based strategy (anti-body test interpretation). We find that community partners perceived local universities as trustworthy institutions because of their association with popular sports programs, academic credentials, and proximity, creating opportunities to address vaccine-related distrust through community-university partnerships. The most promising intervention strategies for building interpersonal trust included engaging in one-on-one dialogue and using autonomy enhancing approaches. Finally, interventions that successfully encouraged vaccine trust did so by incorporating personalized health information about individuals’ potential level of protection and susceptibility to the COVID-19 virus. These findings can inform future public health efforts to create trustworthy vaccine hesitancy interventions.","author":"Laura A. Bray","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"28107cb9ae9e5cfd305f223ab4066587e21b79b6fefd42751fb0cc0c4c7f89e9","category":"Interdisciplinary"}