{"title":"Real-world Evidence on Use of Ceftazidime-Avibactam in the Management of Gram-Negative Infections: A Retrospective Analysis","link":"https://www.preprints.org/manuscript/202406.0711/v1","date":1718166352000,"content":"There is limited real-world data from India examining the treatment characteristics, safety, and efficacy of ceftazidime-avibactam against Gram-negative organisms especially multidrug-resistant pathogens including Carbapenem-Resistant Enterobacterales and Carbapenem-Resistant Pseudomonas. In this retrospective study, the real-world treatment patterns, effectiveness, and safety of ceftazidime-avibactam in treating Gram- negative infections were assessed. Data was extracted from electronic health records of adult patients admitted to the hospital with documented Gram-negative infection who had received treatment for at least 48 hours with ceftazidime-avibactam as a part of routine clinical management. Among the 189 patients, on day 3, clinical symptoms improvement was recorded in 79.6% of patients. Clinical success was achieved in 79.5% and 76.3% of assessed patients on day 7 and day 14/End-of-treatment, respectively. Microbiological success was reported in 76% of patients on day 7 and in 60.3% of patients on day 14 or EOT. The mean treatment duration of ceftazidime-avibactam therapy was 6.92 (± 4.1) days. No new safety concerns were identified. In conclusion, this study provides real-world evidence on treatment patterns and clinical outcomes associated with ceftazidime-avibactam in India, complementing the previously reported literature. The results suggest ceftazidime-avibactam is an effective and tolerable option for the management of Gram-negative infections in critically ill patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"28119bdaa88172aa441ff215ceb4c1d98accb42f4ac94ef71fe156c6eb43f8c6","category":"Interdisciplinary"}