{"title":"Open-Label, Pilot, Randomized Controlled Clinical Trial Evaluating Four Oral Hygiene Regimens Using a Manual Toothbrush, Toothpaste, and Mouthwash","link":"https://www.preprints.org/manuscript/202405.0869/v1","date":1715611732000,"content":"In this pilot study, 84 subjects with a history of poor oral hygiene were enrolled in an interventional, randomized, prospective, open-label controlled trial. The aim was to provide preliminary clinical data on the products, the recruitment monthly rate, and patient satisfaction to estimate resources for the main study, as well as descriptive data on oral microbiota rebalancing. The population was divided into five groups: 20 participants received delicate mint toothpaste, 12 mint toothpaste, 20 mint mouthwash, and 20 delicate mint toothpaste and mint mouthwash using a specifically custom-designed toothbrush. The 12 subjects in the control group continued to use their oral care products without changing their normal routine. The study duration was 28 days.All subjects tolerated the products well, and there were no adverse events. Recruitment capability and procedures allowed a realistic estimation for the future main trial. The products did not cause any changes in tooth color. The participants who completed the treatment consisting of delicate mint toothpaste, mint mouthwash, and the specifically custom-designed toothbrush showed the gingival sensitivity best results (p≤0.000). The products induced a statistically significant decrease in plaque in all treated groups (p≤0.000) and an improvement of gingival sensitivity (delicate mint toothpaste, p≤0.005; mint toothpaste, p≤0.015; and mint mouthwash, p≤0.015). All the products were effective in stabilizing the oral microbiota.The tested products showed an optimal safety profile. They also stabilized the biodiversity of the oral microbiota, making it less susceptible to microbial fluctuations than the control group.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"281278bbebfd45ea63885ccabf2859d60aedef51afb6d435f19551832dc2a537","category":"Interdisciplinary"}