{"title":"Lachlan Morton finishes his Alt-Tour 5 days ahead of the peloton","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/lachlan-morton-finishes-his-alt-tour-5-days-ahead-of-the-peloton","date":1626194635000,"content":"\n      <p><span>Lachlan Morton’s Alt-Tour seemed like an almost impossible challenge. To ride to the end of the Tour de France faster than a peloton of professional riders </span>armed with team busses, massages, nutritionists and hotels, seemed like a big ask for a lone unsupported rider. This morning, though, Morton completed his laps of the Champs Elysees, riding the final stage of his Alt-Tour 5 days ahead of the peloton.</p>\n<div></div>\n<p><span>Morton attempted to pay homage to the earliest days of the Tour de France in his Alt-Tour, stripping things back to basics with no support vehicles and carrying all his necessary food, tools and sleeping equipment on his bike with him. He struggled through the mountains and ploughed on during flat stages in a ride which has been inspirational to many.</span></p>\n\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-alt-tour-lachlan-morton-s-alternative-tour-de-france?\">Related – Lachlan Morton's riding his very own 5,510km Tour de France</a></strong></em></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/The-Alt-Tour_Day-18_2_Credit-Rapha_1024x1024.jpg?v=1626185547\" /></span></p>\n<h4><strong>The numbers:</strong></h4>\n<p><span><strong>Total distance:</strong> 5,550km</span></p>\n<p><span><strong>Total ride time:</strong> 225 hours</span></p>\n<p><span><strong>Total climbing:</strong> 66,831m</span></p>\n<p><span><strong>Average speed:</strong> 24kmh</span></p>\n<p><span><strong>Longest day:</strong> 579km in 19 hours</span></p>\n<p><span>To put these eye-watering statistics into perspective, Morton has ridden 2400km further and completed 15,000m of climbing more than the peloton, riding all of the transfers in between stages, too. There were no planes or swanky team buses for the Australian as he was left completely to his own devices, sleeping in his tent and scavenging any food he could buy from local supermarkets and cafes.</span></p>\n\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Tour de France 2021 Guide</a></strong></em></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/4M4A3626_1024x1024.jpg?v=1626185423\" /></span></p>\n<p><span>His journey hasn’t been an easy one, knee and foot pain forced him to complete the majority of the ride in sandals. Taking no shortcuts, Morton completed two ascents of Ventoux as the peloton did last week, hauling his equipment up with him, a far cry from the lightweight climbing bikes riders had in the Tour. As he drew closer to Paris, the EF rider faced a brutal headwind. The relentlessness of the conditions meant that it was as much a physical challenge as it was a mental one.</span></p>\n\n<p><span><em><strong><a href=\"https://go.skimresources.com/?id=173655X1642184&amp;xs=1&amp;url=https%3A%2F%2Fwww.rapha.cc%2Fgb%2Fen%2Fcollections%2Fpro-team%2Fcategory%2Fpro-team\">Shop Rapha Pro Team</a></strong></em></span></p>\n<p><span>Upon his arrival in Paris, though, Lachlan was surprised by a visit from his father who had flown out to see him and offer some moral support. Emotions ran high and this was all the motivation needed for Morton to complete those final laps around the </span>Champs-Élysées <span>at dawn this morning.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/The-Alt-Tour_Day-18_3_Credit-Rapha_1024x1024.jpg?v=1626185468\" /></span></p>\n<p><span>Although it has been a personal battle and experience for Lachlan Morton, the challenge is bigger than one individual. Throughout his ride, Lachlan has been fundraising for <a href=\"https://worldbicyclerelief.org/\" target=\"_blank\">World Bicycle Relief</a>, an organisation providing young people who are challenged by the barrier of distance with a robust Buffalo Bicycle which they need to access an education. Morton has surpassed his target of £200,000, raising a total of £386,379 for the charity so far.</span></p>\n<p><span>As well as raising money for an important cause, the ride has become a spectacle which has inspired more people to get on bikes and be involved in cycling, something that both Rapha and EF have been trying to achieve since the British apparel brand released its <a href=\"https://www.rapha.cc/fr/fr/roadmap\">Road Map</a>. Dot watchers have joined Morton on his route and followed his progress, creating a community spirit vital to keeping up morale on Morton's challenge.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/The-Alt-Tour_Day-18_4_Credit-Rapha_1024x1024.jpg?v=1626185506\" /></span></p>\n<p><span>Lachlan’s Alt-Tour is a fitting tribute to the Tour de France, a race which has, for so long, inspired riders to push their limits, encouraging determination and resilience. It’s fair to say very few people expected Morton to reach Paris a whole 5 days ahead of the chasing peloton. So, after two weeks of incredibly inspiring rides, all we can say is chapeau to Lachlan Morton.</span></p>\n<p><span>If you want to help Lachlan reach his £400k fundraising target for World Bicycle Relief you can donate via the link </span><a href=\"https://rapha.us6.list-manage.com/track/click?u=e92df2a4578ae687ad337572a&amp;id=5cd53c3ac4&amp;e=ea3719f21b\"><span>here</span></a><span>.</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2814003959fa56ef068e60e5fd32589ab35694cd250e15aaeb211ada342e8fd8","category":"Cycling"}