{"title":"Transcript-Level Analysis of Molecular Alterations Associated With the Development of Premalignant Bronchial Lesions","link":"https://www.preprints.org/manuscript/202404.1357/v1","date":1713532830000,"content":"Premalignant lesions in the bronchial epithelium represent early stages of squamous cell lung carcinoma, challenging to detect with conventional methods. While previous studies have focused on gene expression, here we examine transcriptomic alterations associated with lesion development with the emphasis on protein-coding transcripts. We reanalyzed publicly available RNAseq dataset on airway epithelial cells from 82 smokers with and without premalignant lesions. Transcript abundances were quantified using kallisto, and differential expression and transcript usage analysis was conducted using the sleuth and RATs packages. Functional characterization included overrepresentation analysis (clusterProfiler), weighted co-expression network analysis (WGCNA), and network analysis (Enrichr-KG). We detected 5,906 differentially expressed transcripts, with significant enrichment in pathways related to oxidative phosphorylation and mitochondrial function. Transcript-level WGCNA identified single module correlated with dysplasia status, enriched in cilium-related biological processes. Analysis of hubs within this module highlighted key genes including RABL2B, DNAH1, EFHC1 and VWA3A, and revealed transcription factors such as FOXJ1 and ZNF474 as potential regulators. Our findings underscore the value of transcript-level analysis in uncovering novel insights into premalignant lesion biology. By examining transcripts rather than genes, we identified potential biomarkers associated with early lung carcinogenesis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"281e16885938e3b6df4d1232a44b2fcc3453cbe23fe5b7782953acdc7bc19072","category":"Interdisciplinary"}