{"title":"Effect of chiropractic care on low back pain for active-duty military members: Mediation through biopsychosocial factors","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310642","date":1727791200000,"content":"<p>by Zacariah K. Shannon, Cynthia R. Long, Elizabeth A. Chrischilles, Christine M. Goertz, Robert B. Wallace, Carri Casteel, Ryan M. Carnahan</p>\r\n\r\nThis study evaluates biopsychosocial factors as mediators of the effect of chiropractic care on low back pain (LBP) intensity and interference for active-duty military members. Data from a multi-site, pragmatic clinical trial comparing six weeks of chiropractic care plus usual medical care to usual medical care alone for 750 US active-duty military members with LBP were analyzed using natural-effect, multiple-mediator modeling. Mediation of the adjusted mean effect difference on 12-week outcomes of PROMIS-29 pain interference and intensity by 6-week mediators of other PROMIS-29 physical, mental, and social health subdomains was evaluated. The effect difference on pain interference occurring through PROMIS-29 biopsychosocial factors (natural indirect effect = -1.59, 95% CI = -2.28 to -0.88) was 56% (95% CI = 35 to 96) of the total effect (-2.82, 95% CI = -3.98 to -1.53). The difference in effect on pain intensity occurring through biopsychosocial factors was smaller (natural indirect effect = -0.32, 95% CI = -0.50 to -0.18), equaling 26% (95% CI = 15 to 42) of the total effect (-1.23, 95% CI = -1.52 to -0.88). When considered individually, all physical, mental, and social health factors appeared to mediate the effect difference on pain interference and pain intensity with mental health factors having smaller effect estimates. In contrast with effects on pain interference, much of the effect of adding chiropractic care to usual medical care for US military members on pain intensity did not appear to occur through the PROMIS-29 biopsychosocial factors. Physical and social factors appear to be important intermediate measures for patients receiving chiropractic care for low back pain in military settings. Further study is needed to determine if the effect of chiropractic care on pain intensity for active-duty military occurs through other unmeasured factors, such as patient beliefs, or if the effect occurs directly.","author":"Zacariah K. Shannon","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2826cb3002d6b3c154f1a945d575ae8799242e0a63e7cc63de0c0fdcca7daee7","category":"Interdisciplinary"}