{"title":"Zooplankton in northern lakes show taxon‐specific responses in fatty acids across climate‐productivity and ecosystem size gradients","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12539?af=R","date":1713603156000,"content":"<h2>Abstract</h2>\n<p>Northern lakes are facing rapid environmental alterations—including warming, browning, and/or changes in nutrient concentrations—driven by climate change. These environmental changes can have profound impacts on the synthesis and trophic transfer of polyunsaturated fatty acids (PUFA), which are important biochemical molecules for consumer growth and reproduction. Zooplankton are a key trophic link between phytoplankton and fish, but their biochemical responses to environmental change are not well understood. In this study, we assess the trends in fatty acid (FA) composition of zooplankton taxa among 32 subarctic and temperate lakes across broad climate-productivity and ecosystem size gradients. We found that genus-level taxonomy explained most FA variability in zooplankton (54%), suggesting that environmental changes that alter the taxonomic composition also affect the FA composition of zooplankton communities. Furthermore, the FA responses and their underlying environmental drivers differed between cladocerans and copepods. Cladocerans, including widespread <i>Bosmina</i> spp. and <i>Daphnia</i> spp., showed pronounced responses across the climate-productivity gradient, with abrupt declines in PUFA, particularly eicosapentaenoic acid and arachidonic acid in warmer, browner, and more eutrophic lakes. Conversely, calanoid copepods had high and relatively stable PUFA levels across the gradient. In addition, all zooplankton taxa increased in stearidonic acid levels in larger lakes where PUFA-rich cryptophytes were more abundant. Overall, our results suggest that climate-driven environmental alterations pose heterogeneous impacts on PUFA levels among zooplankton taxa, and that the negative impacts of climate warming are stronger for cladocerans, especially so in small lakes.</p>","author":"Fernando Chaguaceda, \nDanny C. P. Lau, \nWillem Goedkoop, \nMariem Fadhlaoui, \nIsabelle Lavoie, \nTobias Vrede","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"2834d31ffa03e83f16ba4d9fab086739884dc36c772db3b74b3d813fa0bb4272","category":"Environment"}