{"title":"Ori and the Will of the Wisps","link":"https://markpeak.net/ori-and-the-will-of-the-wisps/","date":1621355267000,"content":"<p>เล่นภาคแรก <a href=\"https://markpeak.net/ori-and-the-blind-forest/\">Ori and the Blind Forest</a> แล้วชอบ มีจังหวะเลยไปหาภาคสองมาเล่นต่อ (เล่นบนพีซี Steam ด้วยจอย Xbox One) ก็พบว่าไม่ผิดหวัง</p>\n<p>รีวิวทุกเจ้าพูดตรงกับว่า Ori and the Will of the Wisps เป็นภาคต่อที่ยิ่งใหญ่กว่าภาคแรก ก็คิดว่าสะท้อนภาพรวมของเกมได้ดี มันเป็นการนำเกมภาคแรก (ที่ทำได้ค่อนข้างดีอยู่แล้ว) มาปรับปรุง (ในที่นี้คือ refine) ให้ดีขึ้นในทุกๆ ด้าน โดยเฉพาะด้านกราฟิกและเกมเพลย์</p>\n<h2>Graphic</h2>\n<p>สิ่งแรกสุดที่จับต้องได้คือกราฟิกของ the Will of the Wisps พัฒนาขึ้นแบบก้าวกระโดดมาก จากฉาก 2D แนวการ์ตูนในภาคแรก กลายมาเป็นฉาก 3D แบบหลายเลเยอร์ซ้อนทับกันไป การทำฉากเป็น 3D เต็มรูปแบบทำให้โลกในเกมสมจริงมาก เพราะสภาพแสงเปลี่ยนไปตลอดเวลาตามการเคลื่อนไหวของตัว Ori</p>\n<p>Ori เป็นภูติแห่งแสง มีประกายรอบตัวอยู่แล้ว เดินไปไหนก็จะมีแสงสะท้อนจากวัตถุในฉากนั้นๆ โดยเฉพาะยิ่งในฉากที่มืดๆ การสะท้อนแสงยิ่งโดดเด่นเข้าไปอีก (ฉากเปิดเรื่องแรกๆ ที่ Ori ตกไปในป่ามืดๆ และต้องใช้คบไฟกวัดแกว่ง เห็นการสะท้อนของไฟแล้วประทับใจมากๆ)</p>\n<p>นอกจากนี้ องค์ประกอบในฉากยังจับต้องได้ทั้งหมด ใบไม้หรือกิ่งไม้บนพื้นสามารถสั่นไหวตามการสะท้อนของอาวุธแต่ละประเภทได้ต่างกัน น้ำหยดหรือกระเพื่อม ฯลฯ รายละเอียดพวกนี้น่าประทับใจมากๆ และดูจากภาพนิ่งหรือแม้แต่คลิปก็ตาม มันไม่สามารถสัมผัสได้ 100% เท่ากับการได้ปฏิสัมพันธ์กับฉากจริงๆ ผ่านการควบคุมของเราเอง</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/05/06_WotW_E3_2018.jpg\" /></p>\n<p>ตัว Ori เองก็เปลี่ยนจากการเป็นภาพ sprite 2D ในภาคแรก กลายเป็นโมเดล 3D (ที่เคลื่อนไหวในระนาบ 2D) เต็มรูปแบบ ทำให้แอคชั่นเยอะ และเปลี่ยนไปมาตามบริบทของฉากได้เช่นกัน – <a href=\"https://www.rockpapershotgun.com/how-animation-powers-ori-and-the-will-of-the-wisps\">อ่านรายละเอียดในบทสัมภาษณ์ของ Moon Studio</a></p>\n<p>ในบทสัมภาษณ์อีกอันของทีมงาน บอกว่า Ori ภาค 2 เป็นตัวอย่างที่แสดงให้เห็นว่าเกมแอคชั่น 2D (ที่ในวงการเรียก Metroidvania) ที่สร้างด้วยเทคโนโลยีกราฟิกของยุคสมัยนี้ควรเป็นอย่างไร ก็คิดว่าเป็นข้อสรุปที่ดีจริงๆ คือดันขีดจำกัดของเกม 2D แบบนี้ไปจนสุดทาง</p>\n<blockquote><p>Deliver an outstanding visual experience that really shows the world what a 2D metroidvania could look like in today’s time.</p></blockquote>\n<p>มีคนทำคลิปเปรียบเทียบกราฟิกของเกม 2 ภาคไว้ด้วย</p>\n<p></p>\n<p>ข้อเสียที่ตามมาของกราฟิกอลังการระดับนี้ แน่นอนว่าโหลดช้า และปัญหาเฟรมเรตครับ</p>\n<p>โหลดช้านี่ตอนเข้าเกม ผมสามารถสั่งเปิดเกมแล้วเดินไปกินน้ำหรือเข้าห้องน้ำ กลับมาก็พร้อมเล่นได้พอดีๆ ซึ่งถือว่าช้ากว่าเดิมมากเมื่อเทียบกับภาคแรก</p>\n<p>ส่วนเฟรมเรตตกนี่เจอได้บ่อยๆ (โดยเฉพาะจังหวะคับขัน) สเปกเครื่องที่ใช้เป็น GeForce 1060 Mobile ที่เล่นภาคแรกได้สบายๆ มาเจอ the Will of the Wisps เข้าไปก็มีร้องไห้เป็นพักๆ เหมือนกัน ไม่เคยคิดว่าอยากได้การ์ดจอแรงๆ ก็จากเกมแบบ Ori นี่ล่ะ (เกมมีเวอร์ชัน Switch ด้วย ก็น่าเคารพยกย่องในการ optimize ให้สามารถเล่นเกมกราฟิกแบบนี้ได้บน Switch)</p>\n<p>เทรลเลอร์ Ori เวอร์ชัน optimized for Xbox Series X เห็นแล้วอิจฉาแสนยานุภาพเครื่อง</p>\n<p></p>\n<h2>Gameplay</h2>\n<p>ถัดจากเรื่องกราฟิก สิ่งที่ต่างจากภาคแรกมากพอสมควรคือระบบของเกมเพลย์ โดยแกนหลักแล้ว the Will of the Wisps ยังเป็นเกมแนว platformer ที่เน้นการ “เหาะเหินเดินอากาศ” เช่นเดียวกับภาคแรก</p>\n<p>สิ่งที่เปลี่ยนไปคือระบบการต่อสู้ (combat) เดิมในภาคแรก อาวุธของ Ori คือภูตแสง Sien ที่เป็นอาวุธยิงระยะไกล (แต่วิ่งหาศัตรอัตโนมัติ ไม่ต้องเล็งแบบ Rockman) ทำให้การต่อสู้มักเป็นการยิงจากระยะไกล</p>\n<p>ในภาคสองนี้ อาวุธหลักของ Ori เปลี่ยนมาเป็นดาบแสง ที่ต้องสู้ในระยะสั้น (melee combat) ทำให้เกมเพลย์เปลี่ยนไปจากเดิมพอสมควร และยังมีระบบสล็อตอาวุธ (เลือกได้ครั้งละ 3 สล็อต จากอาวุธ 10 กว่าชนิด) ทำให้เกมเพลย์หลากหลายขึ้น เพราะเรามีอิสระในการเลือกอาวุธได้มาก (แต่ก็มีข้อเสียเหมือนกันคือ อาวุธบางอย่างผมไม่เคยใช้เลยตลอดทั้งเกม หรืออาวุธบางอย่างใช้เฉพาะช่วงแรกๆ ตามดีไซน์ของเรื่อง)</p>\n<p>เกมภาคแรก Ori มีทรัพยากร 3 อย่างคือ ชีวิต (life), พลังงาน (energy) ใช้ฟื้นพลังและสร้างจุดเซฟ และแสง (light) ใช้อัพเกรดความสามารถ</p>\n<p>พอมาเป็นภาคสอง แถบพลังชีวิตยังเหมือนเดิม แต่ระบบพลังงานเปลี่ยนไป เพราะไม่ต้องสร้างจุดเซฟเองแล้ว เปลี่ยนมาเป็นระบบเซฟอัตโนมัติแทน ทำให้เกมลื่นไหลขึ้นเพราะตายแล้วไม่ต้องเริ่มใหม่ไกลเพราะลืมเซฟ และไม่ต้องมาห่วงเรื่องเซฟเกมบ่อยๆ (ภาคแรกนี่ ผมเซฟแทบทุกหน้าเหว 555)</p>\n<p>ส่วนทรัพยากรแสง ก็เปลี่ยนไปเยอะ เดิมทีภาคแรกใช้ระบบ skill tree อัพเกรดความสามารถ แต่ภาคนี้สะสมแสงในรูปเงินในเกม (currency) ใช้ซื้อความสามารถบางอย่าง (ในเกมเรียก shard) แล้วเอามาสวมใส่ (equip) ตามสล็อตที่มีให้ รูปแบบคล้ายเกม RPG มากขึ้น แสงที่เก็บได้ยังนำไปซื้อไอเทมอื่นๆ ในเกม เช่น แผนที่ได้ด้วย</p>\n<p>ตัวเลเวลในเกมยังเป็นเหมือนเดิม คือ เป็นแผนที่ใหญ่ที่เดินต่อกันได้ทั้งหมด ซึ่งสนุกและเพลิดเพลินในแง่ exploration สำรวจฉากและโลกในเกม พัซเซิลในฉากก็มีความแปลกใหม่น่าสนใจดี อีกสิ่งที่เพิ่มเข้ามาคือระบบเควสต์ย่อย (side quest) ที่มีเนื้อเรื่องและภารกิจมากขึ้น มีเป้าหมายคอยไกด์จุดที่ผู้เล่นจะต้องไปต่อได้ดีขึ้น</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/05/OriandtheWilloftheWisp_E32019_01.jpg\" /></p>\n<p>สิ่งที่เพิ่มเข้ามาจากภาคแรกคือ มี boss fight แล้ว (เกมภาคแรกไม่มีบอสให้สู้เลย ไคลแม็กซ์เป็นการหนีตายออกจากฉาก) ทำให้เกมสนุกขึ้นอีกเยอะ บอสทำได้อลังการและท้าทายดี ส่วนข้อวิจารณ์คือบอสมีจำนวนน้อยไปหน่อยยังไม่ค่อยอิ่ม และรู้สึกว่าบอสช่วงแรกๆ ยากกว่าบอสตัวหลังๆ อยู่มาก (ยากสุดในความรู้สึก คือ แมงมุมและกบ หลังจากนั้นง่ายหมด)</p>\n<p>ความยากของเกมรู้สึกว่าไม่ยากเท่าภาคแรก (อาจเป็นเพราะคุ้นกับการควบคุมและแนวคิดต่างๆ ของเกมแล้ว) ทำให้ไม่ struggle มากนัก ผมใช้เวลาเล่นแบบชิวๆ เก็บโน่นนี่ประมาณ 19 ชั่วโมง ก็จบเกมแบบเก็บของได้เกือบครบ 100%</p>\n<h2>เนื้อเรื่อง</h2>\n<p>เป็นจุดอ่อนของ Ori มาตั้งแต่ภาคแรก และภาคนี้ก็ยังเป็นจุดอ่อนอยู่ (บางคนชมว่าเรื่องดีแต่ผมไม่ค่อยชอบ)</p>\n<p>ต้องอธิบายว่า Ori เป็นเกมแนวการ์ตูน ที่มีระดับของความดาร์คมากกว่าการ์ตูน Disney/Pixar ทั่วไป นั่นคือ มีมอนสเตอร์น่ากลัว มีตัวละครสำคัญตาย ดังนั้นอาจไม่เหมาะกับเด็กที่เล็กมากๆ สักเท่าไร</p>\n<p>แต่ครั้นจะคาดหวังเนื้อเรื่องที่ซับซ้อนแบบผู้ใหญ่ ก็ดันไปไม่สุดขนาดนั้นอีก จุดยืนของเรื่องเลยกึ่งๆ ว่าตกลงจะดาร์คแค่ไหน เหมือนคิดจะไปดาร์คแต่ก็ไม่สุดทาง ไม่รู้จะคาดหวังระดับของเส้นเรื่องขนาดไหนดี</p>\n<p>วิธีเล่าเรื่องในเกมก็ไม่ได้น่าจดจำมากนัก ผมจำชื่อตัวละครในเกมแทบไม่ได้เลย เกมภาคนี้มีระบบหมู่บ้านเป็นที่พักใจปลอดภัย มีตัวละครต่างๆ มาอาศัยอยู่ให้รู้สึกผูกพัน แต่เอาเข้าจริง เรื่องราวของตัวละครก็ไม่ได้น่าสนใจขนาดนั้น และกลายเป็นน่ารำคาญด้วยซ้ำที่ต้องเดินตามหาว่าตัวละครไหนอยู่ตรงไหนในหมู่บ้าน</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/05/OriandtheWilloftheWisp_E32019_02.jpg\" /></p>\n<p>เนื้อเรื่องของ The Will of the Wisps แบบสรุปๆ คือ ต่อจากภาคแรกที่ Ori ฟื้นฟูป่า Nibel ได้สำเร็จ คืนแสง Sein ให้กับต้นไม้ศักดิ์สิทธิ์ไป ก็นำไข่ของ Kuro นกฮูกตัวร้ายของภาคแรกมาเลี้ยงเป็นนกฮูกน้อยชื่อ Ku</p>\n<p>ภาคสอง Ori กับ Ku บังเอิญบินข้ามทะเลมาเจอพายุ และไปตกอยู่อีกเกาะชื่อ Niwen เลยต้องมาทำภารกิจฟื้นฟูเกาะแห่งนี้อีกเหมือนกัน โดยต้องรวบรวมภูตแสงของเกาะนี้ชื่อ Seir (ก็ไม่เข้าใจว่าทำไมต้องตั้งชื่อคล้ายๆ กันให้มันสับสน) ที่กระจัดกระจายออกเป็น 5 ซีก (ภูตแต่ละตัวเรียก wisp) ซึ่งก็เป็นที่มาของชื่อเกมนี้ เจตจำนงค์ของภูต The Will of the Wisps</p>\n<h2>สรุป</h2>\n<p>เป็นเกม 2D platformer ที่ประทับใจมาก พัฒนาขึ้นจากภาคแรกขึ้นทุกด้าน ข้อดีกล่าวไปหมดแล้ว ใครชอบเล่นเกมแนวนี้ก็แนะนำ ใครที่ชอบภาคแรกก็ไม่ควรพลาดเพราะดีขึ้นจากเดิมมาก เป็นตัวอย่างของภาคต่อที่ดี</p>\n<p>ข้อเสียคือเนื้อเรื่องอย่างที่เขียนไปแล้ว และอัตรา replayability ค่อนข้างต่ำ เพราะเล่นจบหมดแล้วก็ไม่มีอะไรให้น่าเล่นซ้ำอีก</p>\n<p>สรุปคะแนนคือ 9/10 หักตรงเนื้อเรื่อง 1 คะแนน</p>The post <a href=\"https://markpeak.net/ori-and-the-will-of-the-wisps/\">Ori and the Will of the Wisps</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"2836cb643b9909cb42fb66afecccc1128f48dc427fd8b871770c70664416ad5c","category":"Thai"}