{"title":"Tetris’ creators reveal the game’s greatest unsolved mysteries","link":"https://arstechnica.com/?p=1934178","date":1682526004000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Video directed by Lisandro Perez-Rey, edited by Shandor Garrison. <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/81d574c9-d6dc-4156-8c4a-af7b47748f82mezzanine.txt\">Click here for transcript</a>. </p></div>\n<p>Despite creating one of the most recognizable video games of all time, <em>Tetris</em> creators Alexey Pajitnov (who first coded the game in Russia) and Henk Rogers (who was instrumental in bringing the game to prominence in the West) have not been all that recognizable to the general public. That has started to change, though, with the recent release of <a href=\"https://arstechnica.com/gaming/2023/03/review-apple-tvs-tetris-buries-a-compelling-true-story-in-cheesy-melodrama/\">Apple TV's <em>Tetris</em> movie</a>, which dramatizes the real-life story of the pair's unlikely friendship and business partnership.</p>\n<p>In Ars Technica's latest Unsolved Mysteries video, Pajitnov and Rogers went all the way back to the game's earliest origins. That includes the origin of \"the <em>Tetris</em> song,\" aka <a href=\"https://www.youtube.com/watch?v=umEDct4BoGc\">Korobeiniki</a>, which NES <em>Tetris</em> fans have had stuck in their heads for decades now.</p>\n<p>\"In 1988, when I first published <em>Tetris</em> in Japan... I knew somehow that Alexey didn't want <em>Tetris</em> associated with the Cold War side of Russia or the Soviet Union at the time,\" Rogers told Ars. \"So I looked back in the history of Russia and found some folk songs.\"</p></div><p><a href=\"https://arstechnica.com/?p=1934178#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1934178&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2838b19b2093d585dbbf270ef2a5c943457ccf9ca93e93940aa2679773cea313","category":"Tech"}