{"title":"A matter of time: the losses and gains of the GC favourites","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-matter-of-time","date":1688235249000,"content":"\n      <p><span>Richard Serra’s sculpture </span><i><span>The Matter of Time</span></i><span> is one of the centrepieces of the permanent collection at the Guggenheim Museum Bilbao. Its huge rolled steel curves, lines and surfaces, bending and warping in space, force its viewers to contemplate time unfolding, both chronologically as they walk through the massive but claustrophobic organic shapes of the sculpture, but also metaphysically: according to the artist, </span><i><span>The Matter of Time </span></i><span>explores the idea of time existing and being experienced in multiple ways. “Time is the focus,” he told </span><i><span>ArtForum </span></i><span>magazine in 2005. “It’s not time on the clock, not literal time; it’s subliminal, it’s subjective.”</span></p>\n<div></div>\n<p><span>The favourites of the 2023 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> would well understand the idea of time existing in both objective and subjective ways. </span><i><span>Basque Magazine</span></i><span> described </span><i><span>The Matter of Time </span></i><span>as creating “stratified temporalities” and the general classification is already separating into broad layers: Adam Yates, the stage winner in Bilbao and the first yellow jersey of the race, finished four seconds ahead of his twin brother Simon. </span></p>\n<p><span>A dozen more riders, including double winner Tadej Pogačar and defending champion Jonas Vingegaard, came in 12 seconds down, and it is inevitable that the eventual winner of the Tour and probably most of the final top 10 are among these first finishers. The next group, 27 riders, were 33 seconds behind Yates. Bonus seconds on the line added a more subjective experience of time to the first GC listing of the race. Layers upon layers.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg01_yates_pogacar_vinegegaard_fans_tdf_2023.jpg?v=1688235069\" alt /><em>Stage one of the Tour set the GC battle alight from the very start (Image by James Start)</em></span></p>\n<p>For some fancied riders, the subjective experience of time today was slow and painful but also mercilessly fast. Alexey Lutsenko, seventh and eighth in the last two Tours, was dropped on the Côte de Vivero with more than 30km to go, the small space that manifested itself between his front wheel and the rear wheel of the rider in front of him soon expanding into a deficit of almost 10 minutes.</p>\n<p>Richard Carapaz, third overall in 2021, crashed on the Vivero descent, and badly hurt himself, taking minutes to remount his bike then conceding a quarter of an hour by Bilbao. For Enric Mas, three times a Vuelta runner-up and fifth here in 2020, time is up altogether. He crashed at the same time as Carapaz and never got back on his bike, standing dazed and static by the side of the road as the peloton rushed ahead, putting time and space between themselves and the Spaniard.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2023-stage-two-preview-the-longest-stage\"><em><strong>Read more: Tour de France stage two preview</strong></em></a> </p>\n<p>This was the most dynamic opening stage of the Tour de France in the modern era, going all the way back to the first prologue in 1967 (won by a Basque rider – José-Maria Errandonea) and beyond. The Basque Grand Départ promised to be like no other, and the punchy hills – a cat-four, three cat-threes and a cat-two – combined with the impatient ambition of the Tour peloton, smashed the race to pieces. On the final climb, the short but steep Côte de Pike, riders crossed the summit in ones, twos and threes, hemmed in by lines of fans in a roiling cauldron of passion.</p>\n<p>We were given a sneak preview of the likely shape of the Tour, as Pogačar and Vingegaard looked the strongest over the final climb. However, we also got a sneak preview of the racing styles and tactical preferences of the top two favourites. Pogačar, all fiery enthusiasm and energy, looked to Vingegaard to work with him to the finish as they crested the climb with only Cofidis rider Victor Lafay for company, well clear of the next quartet of riders (the Yates twins, Mattias Skjelmose and David Gaudu). The Dane, all ice-cold patience and strategic parsimony, shook his head and wouldn’t come through. This allowed the first 14 to coalesce into a group.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_2816.jpg?v=1688234951\" alt /><em>Tadej Pogačar dons the white jersey, but has his eyes on yellow (Image by Alex Whitehead/SWPix.com)</em></p>\n<p>But we also got a sneak preview that UAE will be employing guerilla warfare throughout the 2023 Tour de France, against the more conventional weapons of Jumbo-Visma. Pogačar’s teammate Adam Yates was given the nod to go ahead on the descent and Simon Yates followed. This meant Jumbo-Visma had to chase. If Vingegaard had worked with Pogačar, who would have chased in the group behind? There were only three teams with more than one rider, and two of them were UAE and Jumbo. Groupama-FDJ, with Thibaut Pinot and Gaudu, might have taken responsibility, but in a pursuit match between Pogačar and Vingegaard (plus Lafay), and Pinot and Gaudu, there would only be one winner.</p>\n<p><a href=\"https://www.rouleur.cc/pages/the-rouleur-newsletter\"><strong><em>Sign up to our daily Tour de France newsletter and receive exclusive stories from the world's greatest race</em></strong></a></p>\n<p>Jumbo-Visma went from a situation of Vingegaard possibly gaining time and the other Jumbo riders not having to work, to Vingegaard conceding time to a Tour fourth-place finisher and Vuelta winner (and four bonus seconds to Pogačar), and the other team members having to ride after all behind the Yates twins. The time gains were small, the Tour is long, and they only had to chase for 10km, but there are promising signs that Jumbo-Visma are not going to be left to ride tempo around France while everybody else sits in.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg01_vingegaard_fans01_tdf_2023.jpg?v=1688234566\" alt /><em>Jonas Vingegaard on the Côte de Pike (Image by James Startt)</em></p>\n<p>The tactical games of the lead group meant that this stage was contested at the front by the smartest riders, and not necessarily the strongest. The Yates twins have an impressive palmarès, but they were both distanced by Pogačar and Vingegaard on the Côte de Pike – on the longer climbs of the Pyrenees and Alps, Vingegaard may be less inclined to save himself for later. However, in reprising the one-two finish they achieved in Morzine in the 2013 Tour de l’Avenir (in the opposite order), the Yates twins made themselves early but strong contenders for the top five in Paris and maybe even the podium, as well as adding considerable strategic dimensions to Pogačar’s Tour assault. Ever since Simon Yates was born a few minutes before Adam on August 7, 1992, the Yates twins have been half-wheeling each other through cycling and life. Today, Adam Yates nudged his wheel ahead.</p>\n<p>The winners after a single day at the 2023 Tour make up a fairly short list. Pogačar and Vingegaard remain the strong favourites; the Yates twins are both sharp and have the experience to put together a good Tour. 2022 Giro d'Italia winner Jai Hindley made it into the favourites’ group, as did Gaudu and Pinot, Mikel Landa and dark horse Skjelmose.</p>\n<p>You could compare an attempt on the GC at the Tour de France to the construction of a house. Lay foundations, erect walls, put a roof on, work on the details… But the Tour is also like a beautiful sculpture made from a block of stone, and Tadej Pogačar and Jonas Vingegaard are already chipping away.</p>\n<p><em>*Cover image by James Startt </em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"283837ced6aede1e0e3aca1b385f2bbdcd90cf8cd939ba50c8c609f42adc60f0","category":"Cycling"}