{"title":"'I don’t think I’ll be riding around chatting': Lizzie Deignan in at the deep end as she makes her racing return","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/lizzie-deignan-on-her-come-back-to-the-womens-peloton-and-ardennes-classics","date":1681855650000,"content":"\n      <p>A first day is never easy. The butterflies sensation fill your stomach and your mind is left wandering what the day will hold. It is especially hard for women who come back after maternity leave, having had their lives completely changed with a new addition to their family. But for Lizzie Deignan this is her second time returning to the professional peloton after maternity leave, and no amount of nerves is wavering her confidence in her abilities to be riding with the best. </p>\n<div></div>\n<p>The Trek-Segafredo rider is perhaps the most notable proof that female cyclists can have children and still come back to winning races. After having her daughter Orla in 2018, Deignan returned the following season in 2019 and went on to win the Women’s Tour the same year. Before announcing she was expecting a second child in September 2022, Deignan had added an impressive list of victories next to her name, including <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a> Femmes, Tour de Suisse Women’s and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/liege-bastogne-liege-all-you-need-to-know-about-the-oldest-monument\">Liège-Bastogne-Liège</a> Femmes. </p>\n<p>Six months after giving birth to her son, Deignan is making her 2023 debut at La Flèche Wallonne – one of the toughest one-day races in the Women’s WorldTour calendar. However, this was not the original plan for the 34-year-old rider. Trek-Segafredo haven’t had the best of luck so far this season with injuries and illnesses, so Deignan has been called into action two weeks earlier than expected. </p>\n<p>In a press conference ahead of her come back race, she said: “I did plan to have a bit longer to prepare for the Vuelta [<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-femenina-2023-everything-you-need-to-know\">La Vuelta Feminina</a>] as I just thought that would have been a nicer, easier transition, but you know, professional sport isn’t about what is easier or nicer all the time. </p>\n<p>“At the end of the day, I am a teammate and it’s really important for me to support them. I could see that they were struggling in terms of filling the spots and it would be silly for me to be at home training, when actually I can get the same things I need from racing. It just means I am not going to be as comfortable in starting as I would have liked. But you know the Vuelta is only two weeks away, it’s not like I've been called up two months early.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CorVosSWpix.com1994.jpg?v=1681839023\" alt=\"Lizzie Deignan celebrating her Paris-Roubaix win\" /><em>Lizzie Deignan was the first ever Paris-Roubaix Femmes winner </em></p>\n<p>The British rider was welcomed back with open arms by her team at Trek-Segafredo, who she has been with since 2019 and who have supported her throughout both her pregnancies. However, she knows that Flèche Wallonne may not be the warmest of welcomes back to racing. Instead, the race will be a brutal introduction, including three ascents of the Mur de Huy. “I don’t think I’ll be riding around chatting”, Deignan said.</p>\n<p>Thankfully, Trek-Segafredo are not putting any pressure on Deignan to come back and produce immediate results, and in this week’s Ardennes Classics she'll be one of the workers in the team alongside Lucinda Brand. </p>\n<p>“The team is incredibly strong,” said Deignan. “You have Spratty [Amanda Spratt] who is still coming back from her season last year and I think she’s improving all the time. Then you have Elisa Longo Borghini, whose palmarès speaks for itself – you should never underestimate her in the Ardennes. We then have the two young girls, Shirin [van Anrooij] and Gaia [Realini]. Shirin is an exceptional talent and she’s quickly progressing in the results as well. Her ride at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/amstel-gold-race\">Amstel Gold Race</a> was really impressive. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/better-than-i-could-have-expected-shirin-van-anrooij-on-her-big-binda-win-and-going-for-ardennes-glory\"><em><strong>Read more: Shirin van Anrooij on her big Trofeo Binda win and going for Ardennes glory</strong></em></a></p>\n<p>“Then Gaia is just an out-and-out climber and you don’t have many races in the calendar yet where she has been able to showcase her talent, so I think there’s no better place than on the Mur de Huy, right? So I think we’re going in with real prospects that could win both tomorrow and Sunday.” </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20201004LBF1059-A.S.O._Thomas_Maheux.jpg?v=1681839101\" alt=\"Lizzie Deignan at Liege\" /><em>The British rider added the iconic Monument, Liège-Bastonge-Liège, to her palmarès in 2020</em></p>\n<p>Liège-Bastogne-Liège is a race that Deignan conquered in 2020, but she is aware that she won't be in contention to deliver a result in Belgium, admitting that coming back from maternity leave a second time round has been harder than before. </p>\n<p>“Physically I’m good, training has gone really well and all my endurance numbers are really good. I feel really physically fit but in terms of that top end, race punch fitness, I don’t have that, and I cannot ignore that. You know, I haven’t made those steps in training yet to win a race.”</p>\n<p>Deignan added: “In terms of my power and stuff, it has definitely taken a little bit longer this time around, and that has been difficult physically. I’m still a bit in the unknown in terms of where my form will be in comparison to the other riders.” </p>\n<p>The British rider has been keeping up with women’s racing while she has been on maternity leave, seeing for herself the dominance that SD Worx has had this season so far. But she is not threatened by the Dutch team's winning streak and notes that there is still plenty of opportunities remaining for her and her team in the months to come. </p>\n<p>“We know that Lotte Kopecky and Demi Vollering are exceptional athletes and they’re really bouncing off each other at the moment. But I think it's a long season, and I think it's really easy to quickly jump to conclusions about the team. And from an inside perspective, I know the challenges that some of our top riders have faced, like Elisa having Covid and still managing to pull off a third in <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Flanders</a> is a pretty exceptional performance. I think it will get more competitive as the season goes on and things balance out a bit. But yeah, they've dominated the spring for sure. The season is long, we'll be back,” she said. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_6791_b8338bd1-8344-4c31-9563-2f63bfc691e7.jpg?v=1681839192\" alt=\"Lizzie Deignan in the Women's Tour\" /><em>Lizzie Deignan is the only rider to have won the Women's Tour more than once</em> </p>\n<p>Throughout her career Deignan has been the leading light of British women's road racing. While her return to the professional peloton will excite many of the British fans, and with few British winners making their mark in Deignan’s absence, will she feel a pressure to fill this role again?</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/what-does-the-postponement-of-the-women-s-tour-mean-for-women-s-cycling\"><em><strong>Read more: What next for the Women's Tour? </strong></em></a></p>\n<p>“You might not be seeing the riders on the podium or in the top 10 right now, but I think there is a generation coming through that I hope will put me under pressure as I don’t want to be comfortable in selection and things like that,\" she said, pointing to the burgeoning career of young British riders like Pfeiffer Georgi, Alice Towers and Anna Henderson. “I’m certainly not sitting here thinking, OK, Glasgow, I’m sure I’m going to have a spot on the team, which I think is a reflection of the riders coming up.”</p>\n<p>“Previously I knew I was a shoe in for Yorkshire but I don’t feel like that for Glasgow. I think I have to prove myself to be in that team now, and I think that's a really good indication of where the talent is.”</p>\n<p>So much of Deignan’s life has changed since starting her career over 10 years ago, but her return to Trek-Segafredo has felt like nothing has changed. Having a few races under her belt will arm Deignan with the confidence she needs to get back to her winning ways. The 34-year-old is going into her first season back with an open mind as she doesn’t know exactly when she’ll be back on her best form. She is aware the women’s peloton is getting more and more competitive, and believes it is a case of being realistic. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CorVosSWpix.com1988-2.jpg?v=1681839240\" alt=\"Lizzie Deignan in Paris-Roubaix\" /><em>She has paved the way for other female cyclists who would like to have children and keep their careers in professional cycling</em></p>\n<p>“I really hope that on Sunday [at Liège-Bastogne-Liège], I already feel the benefit from having done one race,” Deignan said. “I remember the last time I came back after maternity leave, I found that with each race there was a significant improvement in terms of race rhythm, feeling and sensation on the bike. So, I hope that on Sunday I already feel better having done one race already.” </p>\n<p>Already looking ahead to the future of her career she said: “The things that motivate me are the World Championships and Olympics, it would also be really exciting to take part in the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> and also the new opportunities now available. I’m the rider with the most Monuments at the moment, so I’d like to try and go for new Monuments that I don’t have yet like Milan-Sanremo and Il Lombardia.</p>\n<p>“I would love to be able to aim for five Monuments in my career – that would be special.” </p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"283aef873c16e4d105df8257c6aea95f87f1238ec680218bb8341a9fe607dc48","category":"Cycling"}