{"title":"Someone stabbed a cave bear in the head with a spear 35,000 years ago","link":"https://arstechnica.com/?p=1773928","date":1623855752000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/cave-bear-skull-and-replica-spearhead-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/cave-bear-skull-and-replica-spearhead.jpg\">Enlarge</a> (credit: Gimranov et al. 2021)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>During the last Ice Age, more than 100 cave bears died in Imanay Cave, a 100-meter-long corridor of stone in Russia’s southern Ural Mountains. The dead bears, along with a cave lion and a few other Pleistocene mammals, left behind nearly 10,000 bones, which have mostly worn down to small fragments over the millennia. Most of them were so-called small cave bears, <i>Ursus spelaeus eremus</i>, notable for being smaller than the so-called large cave bear, <i>Ursus spelaeus—</i>and for their apparent habit of dying en masse while hibernating through the harsh Pleistocene winters, leaving behind huge assemblages of bones for modern paleontologists to find.</p>\n<p>Most of the cave bear bones found in Eurasia, including the ones at Imanay Cave, show no signs of violence, butchering, or gnawing. They seem to have died quietly, perhaps of cold, starvation, or illness. But while cleaning one cave bear skull from Imanay, Dmitry Gimranov of the Ural Branch of the Russian Academy of Sciences and his colleagues noticed a rather suspicious hole in the parietal bone, near the back of the skull.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/cave-bear-skull.png\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/cave-bear-skull-640x311.png\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/cave-bear-skull.png\">The hole in the parietal bone (left side of photo) matches the cross-section of stone projectile points also found in the cave.</a> (credit: Gimranov et al. 2021)</p></div>\n<p>The lower edge of the hole is a gentle curve with a flattened base, while the upper edge is more uneven and widens sharply in the middle. Its shape is strikingly similar to the cross-section of stone projectile points unearthed in the same layer of cave sediment as most of the bear bones. Those points tend to have a flat ventral (or lower) side and a more curved dorsal (or upper) side with a sharp rib of stone sticking up along the center. And they're about the same size as the hole in the bear skull.</p></div><p><a href=\"https://arstechnica.com/?p=1773928#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1773928&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"28413eff0ff201a830ee1fbc6ca67608446de70024ecab7316664181c46fc9fc","category":"Tech"}