{"title":"A giant meteorite has been lost in the desert since 1916—here’s how we might find it","link":"https://arstechnica.com/?p=2005521","date":1708719840000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/meteorite1-800x624.jpg\" alt=\"Chinguetti slice at the National Museum of Natural History\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/meteorite1.jpg\">Enlarge</a> <span>/</span> Chinguetti slice at the National Museum of Natural History. A larger meteorite reported in 1916 hasn't been spotted since. (credit: <a href=\"https://creativecommons.org/licenses/by-sa/2.0/\">Claire H./CC BY-SA 2.0</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In 1916, a French consular official reported finding a giant \"iron hill\" deep in the Sahara desert, roughly 45 kilometers (28 miles) from Chinguetti, <a href=\"https://en.wikipedia.org/wiki/Mauritania\">Mauritania</a>—purportedly a meteorite (technically a <a href=\"https://en.wikipedia.org/wiki/Mesosiderite\">mesosiderite</a>) some 40 meters (130 feet) tall and 100 meters (330 feet) long. He brought back a small fragment, but the meteorite hasn't been found again since, despite the efforts of multiple expeditions, calling its very existence into question.</p>\n<p>Three British researchers have conducted their own analysis and proposed a means of determining once and for all whether the <a href=\"https://en.wikipedia.org/wiki/Chinguetti_meteorite\">Chinguetti meteorite</a> really exists, detailing their findings in a new <a href=\"https://arxiv.org/abs/2402.14150\">preprint posted</a> to the physics arXiv. They contend that they have narrowed down the likely locations where the meteorite might be buried under high sand dunes and are currently awaiting access to data from a magnetometer survey of the region in hopes of either finding the mysterious missing meteorite or confirming that it likely never existed.</p>\n<p>Captain Gaston Ripert was in charge of the Chinguetti camel corps. One day he overheard a conversation among the chameliers (camel drivers) about an unusual iron hill in the desert. He convinced a local chief to guide him there one night, taking Ripert on a 10-hour camel ride along a \"disorienting\" route, making a few detours along the way. He may even have been literally blindfolded, depending on how one interprets the French phrase <em>en aveugle</em>, which can mean either \"blind\" (i.e. without a compass) or \"blindfolded.\" The 4-kilogram fragment Ripert collected was later analyzed by noted geologist <a href=\"https://en.wikipedia.org/wiki/Alfred_Lacroix\">Alfred Lacroix</a>, who considered it a significant discovery. But when others failed to locate the larger Chinguetti meteorite, people started to doubt Ripert's story.</p></div><p><a href=\"https://arstechnica.com/?p=2005521#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2005521&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"284282ab10b59f7697f9be9477cd8ebc0558a832fc7136fb9dc8f30273b03ba6","category":"Tech"}