{"title":"Hydrogen Production by Steam Reforming of Ethanol and Dry Reforming of Methane with CO2 on Ni/Vermiculite: Stability Improvement via Acid-Base Treatment of the Support","link":"https://www.preprints.org/manuscript/202404.0079/v1","date":1711967639000,"content":"In this study, vermiculite was explored as a support material for nickel catalysts in two key processes in syngas production through dry reforming of methane with CO2 and steam reforming of ethanol. The vermiculite was subjected to acid or base treatment, then, Ni catalysts were prepared through incipient wetness impregnation and characterized using various techniques, including X-ray, FTIR, temperature programmed reduction (H2-TPR). TG-TD analyses were performed to assess the formation of carbon deposits on spent catalysts. The Ni based catalysts were used in the reaction tests without a reduction pre-treatment. Initially, raw vermiculite-supported nickel showed limited catalytic activity, however after acid (Ni/VTA) or base (Ni/VTB) treatment, vermiculite became an effective support for nickel in dry methane reforming. The resulting catalysts (Ni/VTB and Ni/VTA) displayed outstanding performance, with high methane conversion and hydrogen yield. Acidic treatment improved the reduction of nickel species and reduced carbon deposition, outperforming alkali treatment. The prepared catalysts were also explored in ethanol steam reforming. The performance was investigated as a function of the temperature, water/ethanol ratio, and space velocity, with acid-treated catalysts performing as the best. The study emphasized the importance of contact time with the catalyst and addressed challenges related to carbon formation and sintering for long-term stability. In conclusion, acidic treatment of the vermiculite support, before Ni deposition, significantly enhanced the catalytic activity and stability of nickel catalysts in both dry methane reforming and ethanol steam reforming processes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2845cea4f4fe4d03bb20fd7ed252ed1ba8fb53c23e77bb120816f2f54bc2b699","category":"Interdisciplinary"}