{"title":"Fluctuation of functional somatic disorders in a population-based cohort. The DanFunD study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312031","date":1729087200000,"content":"<p>by Signe U. Schovsbo, Line L. Kårhus, Anne A. Bjerregaard, Marie W. Petersen, Lisbeth Frostholm, Per Fink, Tina B. W. Carstensen, Lene F. Eplov, Michael E. Benros, Susanne Brix, Anja L. Madsen, Allan Linneberg, Thomas M. Dantoft, Torben Jørgensen</p>\r\nBackground <p>Evidence of incidence of functional somatic disorders (FSD) is hampered by unclear delimitations of the conditions and little is known about the possible interchangeability between syndromes. Further, knowledge on remission and persistence of FSD in the general population is limited. We aimed to assess the natural course of various FSD over 5 years in the general population.</p> Methods <p>A follow-up study (Danish Study of Functional Disorders—DanFunD) was conducted in a random sample of the general population comprising 5,738 participants aged 18–76 years at baseline. Both at baseline and five-year follow-up, participants filled in validated questionnaires on symptoms to delimitate two approaches of FSD, the bodily distress syndrome (BDS) and four functional somatic syndromes (FSS): irritable bowel (IB), chronic fatigue (CF), chronic widespread pain (CWP), and multiple chemical sensitivity (MCS).</p> Results <p>Both BDS and FSS showed a five-year incidence around 11%. Incidence of the individual FSS varied from 0.8% (MCS) to 5.7% (CF). BDS and FSS showed a remission proportion close to 50%. We found a high degree of interchangeability between each FSS varying from 15.0% to 23.4%.</p> Conclusion <p>We identified a marked fluctuation pattern of FSD during a five-year period, with a high degree of interchangeability between each FSS. The study stresses the importance of large population-based cohorts with transparent delimitation of FSD in future research to understand these complex conditions.</p>","author":"Signe U. Schovsbo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"28475fbb0c2f42973b11577df5691b231c0ce7b1a715fca2f86c6833f58e662f","category":"Interdisciplinary"}