{"title":"Untargeted lipidomics analysis in women with morbid obesity and type 2 diabetes mellitus: A comprehensive study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303569","date":1715695200000,"content":"<p>by Laia Bertran, Jordi Capellades, Sonia Abelló, Carmen Aguilar, Teresa Auguet, Cristóbal Richart</p>\r\n\r\nThere is a phenotype of obese individuals termed metabolically healthy obese that present a reduced cardiometabolic risk. This phenotype offers a valuable model for investigating the mechanisms connecting obesity and metabolic alterations such as Type 2 Diabetes Mellitus (T2DM). Previously, in an untargeted metabolomics analysis in a cohort of morbidly obese women, we observed a different lipid metabolite pattern between metabolically healthy morbid obese individuals and those with associated T2DM. To validate these findings, we have performed a complementary study of lipidomics. In this study, we assessed a liquid chromatography coupled to a mass spectrometer untargeted lipidomic analysis on serum samples from 209 women, 73 normal-weight women (control group) and 136 morbid obese women. From those, 65 metabolically healthy morbid obese and 71 with associated T2DM. In this work, we find elevated levels of ceramides, sphingomyelins, diacyl and triacylglycerols, fatty acids, and phosphoethanolamines in morbid obese vs normal weight. Conversely, decreased levels of acylcarnitines, bile acids, lyso-phosphatidylcholines, phosphatidylcholines (PC), phosphatidylinositols, and phosphoethanolamine PE (O-38:4) were noted. Furthermore, comparing morbid obese women with T2DM vs metabolically healthy MO, a distinct lipid profile emerged, featuring increased levels of metabolites: deoxycholic acid, diacylglycerol DG (36:2), triacylglycerols, phosphatidylcholines, phosphoethanolamines, phosphatidylinositols, and lyso-phosphatidylinositol LPI (16:0). To conclude, analysing both comparatives, we observed decreased levels of deoxycholic acid, PC (34:3), and PE (O-38:4) in morbid obese women vs normal-weight. Conversely, we found elevated levels of these lipids in morbid obese women with T2DM vs metabolically healthy MO. These profiles of metabolites could be explored for the research as potential markers of metabolic risk of T2DM in morbid obese women.","author":"Laia Bertran","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"284c2a4dbc966f8d2bec3bde9e60f2a33c26a71f919a7320c80e981f342f5d5d","category":"Interdisciplinary"}