{"title":"Atomic macOS Stealer Malware Can Steal Keychain Info, Files, Browser Wallets and More","link":"https://www.macrumors.com/2023/04/28/atomic-macos-stealer-malware/","date":1682708846000,"content":"While Apple's Macs are less targeted by malware than Windows PCs, concerning Mac malware does pop up regularly. This week, there's new Mac malware out in the wild that Mac users should be aware of.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/macos-atomic-malware-demo.jpg\" alt width=\"760\" height=\"302\" />\r<br />\nCalled Atomic macOS Stealer (AMOS), the malware was found on Telegram <a href=\"https://blog.cyble.com/2023/04/26/threat-actor-selling-new-atomic-macos-amos-stealer-on-telegram/\">by Cyble Research</a>. A Telegram user was selling access to the malware, which is designed to steal sensitive information like usernames and passwords.\r<br />\n\r<br />\nWhoever designed the Atomic macOS Stealer is working behind the scenes to improve it and add new functionality to make it more effective. In its current incarnation, AMOS is able to access keychain passwords, system information, files from the desktop and documents folder, and the password of the Mac.\r<br />\n\r<br />\nIt is able to infiltrate browser apps like Chrome and Firefox, extracting autofill information, passwords, cookies, wallets, and credit card information. Cryptowallets like Electrum, Binance, and Atomic are specific targets.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/macos-atomic-malware.jpg\" alt width=\"752\" height=\"777\" />\r<br />\nAMOS can be purchased with a web panel that makes it easy to manage malware targets, along with tools for brute-forcing private keys. The malware and accompanying services to make it easier to use against victims can be purchased on Telegram for $1,000 per month.\r<br />\n\r<br />\nA .dmg file is used to get the malware on a victim's machine, and once installed, it immediately begins accessing sensitive information and sending it to a remote server. A fake system prompt is presented to get access to the system password, and it asks for access to files in the documents and desktop folders.\r<br />\n\r<br />\nBecause this requires a user to click on a .dmg file to install, Mac users can avoid the malware by not installing any kind of untrusted software from an unverified source. Cyble Research recommends installing software from the <a href=\"https://www.macrumors.com/guide/mac-app-store/\">Mac App Store</a>, using strong passwords and multi-factor authentication, and using biometric authentication where possible.\r<br />\n\r<br />\nUsers should also avoid opening links in emails, using caution whenever an app asks for permissions, and keeping devices, operating systems, and apps up to date.<br />This article, \"<a href=\"https://www.macrumors.com/2023/04/28/atomic-macos-stealer-malware/\">Atomic macOS Stealer Malware Can Steal Keychain Info, Files, Browser Wallets and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/atomic-macos-stealer-malware-can-steal-keychain-info-files-browser-wallets-and-more.2388098/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2855184214cfdc0999e135767d517e9641fc3ce174d3abc3b5111ac198e4369a","category":"Apple"}