{"title":"Why I won’t miss the focus-killing Touch Bar on the next MacBook Pro","link":"https://www.macworld.com/article/351326/macbook-pro-touch-bar-function-keys.html","date":1626948900000,"content":"\n<div>\n<section><div></div></section><p>Five years ago this fall, Apple <a href=\"https://www.macworld.com/article/229139/macbook-pro-with-touch-bar-review-the-best-bits-of-ios-in-a-really-great-mac.html\">introduced a new MacBook Pro</a>. But this wasn’t your ordinary spec-bump, this MacBook Pro featured a love-it or hate-it feature: the Touch Bar, Apple’s answer to touchscreen interfaces that became popular in Windows laptops. The OLED strip replaced the top row of keys on the MacBook Pro keyboard, and the controls it displays change based on the software you are using.</p>\n\n\n\n<p>Some thought the Touch Bar was a brilliant innovation, including a few here at Macworld. When the Touch Bar was unveiled, Macworld posted articles proclaiming that, “<a href=\"https://www.macworld.com/article/3136316/hands-on-the-macbook-pros-innovative-touch-bar-will-grab-you.html\">The MacBook Pro’s innovative Touch Bar will grab you</a>,” and that the “<a href=\"https://www.macworld.com/article/229033/why-the-macbook-pros-new-touch-bar-is-the-touchscreen-done-right.html\">Touch Bar is the touchscreen done right</a>.” But those were the opinions of individuals I worked with, and my experience with the Touch Bar was different. I didn’t like it at all.</p>\n\n\n\n<p>Five years after its debut, the MacBook Pro is reportedly undergoing a dramatic change, one that involves new Apple silicon, new designs, and possibly, <a href=\"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-mini-led-m1x-touch-bar-card-reader-webcam-thunderbolt-magsafe-price-release.html\">the end of the Touch Bar</a>. While the Apple silicon implementation is arguably the most exciting feature, the idea that my beloved Function keys could return is one that I relish.</p>\n\n\n\n<h2>I don’t work that way</h2>\n\n\n\n<p>The main reason why I dislike the Touch Bar is that it just doesn’t fit with the way I use the Mac. Most of the time, my hands are on the keyboard, and my eyes are focused on the screen. And over time, I’ve learned keyboard combinations to do the functions I need to do most often. My workflow doesn’t get broken up and I don’t lose my focus.</p>\n\n\n\n<p>Also, I split my time pretty evenly between a MacBook Pro and a Mac Pro (the trash can one). Apple never created a desktop keyboard with a Touch Bar—it would probably have to be built with a T2 controller and dramatically raise the price. So acclimating myself to the Touch Bar seemed fruitless. I could use the MacBook Pro to learn the Touch Bar, but then those lessons learned couldn’t be applied when I’m at my Mac Pro. I can’t use my Mac Pro to get familiar the Touch Bar—and anyway, I prefer the Function keys; the dedicated keys to screen brightness, volume, and playback; and the Escape key.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/m1-macbook-pro-touch-bar.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The 13-inch M1 MacBook Pro has a Touch Bar. Could it be the only Apple-silicon laptop with one?</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>So when the Touch Bar came out, I largely ignored it for most of its five years, using it only when I had to. But as rumors started to spread about its demise, I decided to find out what, if anything, I had been missing. Over the past few months, I’ve made a concerted effort to use the Touch Bar and make it part of my workflow.</p>\n\n\n\n<p>Then, a few days ago, <a href=\"https://www.macworld.com/author/michael-simon\">my editor</a> at Macworld asked me to write about my thoughts on the Touch Bar—he didn’t know about the usability experiment I was doing for myself. The assignment request happened to come at the perfect time to reflect upon my experience.</p>\n\n\n\n<p>As it turns out, my mind hasn’t changed. I still dislike the Touch Bar, but not as much as I did before. That’s because I’ve found the one instance when I really value what it can do when filling out forms online. This is when the Touch Bar acts like the on-screen keyboard on the iPhone, and it makes text suggestions for the form. Not only is it a time-saver, but it spares me from possibly mistyping my entry.</p>\n\n\n\n<h2>RIP, Touch Bar</h2>\n\n\n\n<p>That one use case isn’t enough to pronounce my devotion to the Touch Bar, though. What I learned from my experiment is that I just can’t get over the habit of changing my focus when I work. To use the Touch Bar, I have to stop typing, look at the Touch Bar, find the icon that represents the function I need, and then press it. And yes, while it reads like a lot to do, it actually takes just a few seconds, but it’s not about time wasted. </p>\n\n\n\n<p>It’s about focus, and it gets broken when I have to use the Touch Bar. Most of the time, I can instantly regain that focus, but I have caught myself at times drifting and doing something else instead of what I’m supposed to be doing, and it started when I had to look at the Touch Bar. When Apple finally reveals its new MacBook Pros, I’ll be eager to find out what’s going on with the Apple silicon inside. But then I’ll look to the outside to see if the Touch Bar is there. </p>\n\n\n\n<p>And if it’s not, I’ll be welcoming back the Function keys with happy fingers. </p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"285daad922c3aebd1f7327450169d067cf7794b81e93c7bf03754ead2f102586","category":"Apple"}