{"title":"Global outlook on affordability of biotherapeutic drugs","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15171?af=R","date":1718344080000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/e39e55c1-6839-432d-bc35-73962a8db234/nyas15171-gra-0001-m.png\" alt=\"Global outlook on affordability of biotherapeutic drugs\" />\n<p>To our knowledge, the present paper is the first in-depth study that measures the affordability of different biotherapeutic products in 40 countries with different economic levels. The affordability of biotherapeutics was generally poor in all countries, particularly in low middle-income countries. Our findings emphasize the need for measures to make these biotherapeutics accessible to everyone. It is critical that governments, policymakers, and manufacturers work together to take concerted measures to alleviate the situation.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Although biotherapeutic drugs have the potential of transforming the management of many life-threatening diseases, their affordability and accessibility remain an issue. This study offers an overview of the global affordability of biotherapeutic products. For this, prices for 10 representative biotherapeutic products were examined in 40 countries, including high-income countries (HICs), upper middle-income countries (UMICs), lower middle-income countries (LMICs), and low-income countries (LICs). The affordability of these biotherapeutics was calculated based on the World Health Organization/Health Action International (WHO/HAI) method. As expected, affordability was found to be better in HICs, followed by UMICs, LMICs, and finally, LICs. Furthermore, based on the trend of per capita income, we predict that in UMICs and LMICs, the affordability of high molecular weight biologics will worsen by 1.5× and 2× by 2030, respectively, and further by 4× and 6× by 2040. On the other hand, affordability will stay nearly the same for people living in HICs in the coming decades. Our analysis suggests that it is imperative that measures be taken to make this class of products more affordable and accessible. Governments can contribute by creating conducive policies. Global institutions like the WHO can play a significant role as well. Finally, manufacturers need to invest in and implement manufacturing innovations.</p>","author":"Anurag S. Rathore, \nPeter J. Gardner, \nHemlata Chhabra, \nRuchir Raman","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"2867e126f97d10f27523806d2f92a8714cda11675bc55f20c9995326149a9aff","category":"Environment"}