{"title":"Exploring the impact of child underweight status on common childhood illnesses among children under five years in Bangladesh along with spatial analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311183","date":1727359200000,"content":"<p>by Khondokar Naymul Islam, Sumaya Sultana, Ferdous Rahman, Abdur Rahman</p>\r\nBackground <p>In developing countries like Bangladesh, under-five children are mostly experiencing and suffering from common diseases like fever, cough, diarrhea, and acute respiratory infections (ARI). To mitigate these problems, it’s crucial to spot prevalent areas and take proper action. This study investigates the spatial distribution and associated factors of prevalent childhood illnesses across Bangladesh.</p> Methods and findings <p>This research comprised 8,306 children’s information from the Bangladesh Demographic and Health Survey (BDHS) 2017–18. We performed chi-square, t-tests, binary logistic regression and spatial analyses in this work. BDHS survey data and GPS data were aggregated to identify common childhood illnesses among under-five children. Moran’s index first mapped childhood illnesses. Afterward, Getis-Ord Gi* discovered hot and cold spots for illnesses. However, Kriging interpolation predicted child illnesses in unsampled areas. Here, 33.2% (CI: 32.2–34.3), 36% (CI: 35–37.1), 4.7% (CI: 4.3–5.2), and 12.9% (CI: 12.2–13.6) of children under five had fever, cough, diarrhea, and ARI, respectively. In the fortnight before to the survey, 47.3% (CI: 46.2–48.3) of under-5 children were ill. Common childhood illnesses are associated with children’s (age, underweight status, etc.), mothers’ (age, education, etc.), and household factors (residency, wealth index, etc.). Underweight status is associated with fever, cough and at least one disease. The unsampled north-western and south-western areas of Bangladesh had a higher prevalence of fever, cough, ARI and at least one common disease. Cough was most common in the central-northern region; fever was most common in the lower southern region; and ARI was most common in Bangladesh’s south-east. Childhood diseases were more prevalent in Bangladesh’s central-northern and southern regions.</p> Conclusions <p>Our research demonstrates the regional clustering of common childhood diseases in Bangladesh. Policymakers should focus on these higher-prevalence regions, and the necessary preventive measures should be taken immediately.</p>","author":"Khondokar Naymul Islam","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"28777fba3a78cc65f2822654d427236faff0c3c91537739c1128d60ffe14a4e2","category":"Interdisciplinary"}