{"title":"327 Evaluation of glucose supplement provided with enrichment to reduce hunger induced stress in gestating sows","link":"https://academic.oup.com/jas/article/102/Supplement_3/9/7757219?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This study aimed to evaluate the effect of myo-inositol (MYO; glucose supplementation) in alginate hydrogel beads (AHBs) covered in maternal pheromone (MP) via an enrichment source (perforated plastic jugs) using measures of behavior, physiology, and farrowing performance of feed restricted pregnant sows. First parity pregnant sows (n = 36) with an average body weight (BW) of 200 kg were randomly assigned into three treatment groups: a negative control group, not provided with AHB-MYO nor enrichment (NEG), a positive control group provided with AHB-MP without MYO via enrichment (POS), and a treatment group provided with AHB-MYO-MP via enrichment (TRT). The AHB consumption results before (d 0) and after treatment (d 7) revealed that the median AHB consumption for the POS group was significantly greater than for TRT (<span>P</span> &lt; 0.01). The hematological data showed a significantly greater lymphocyte (LYM) count in NEG than TRT on d 7 (<span>P</span> &lt; 0.05) but did not differ from POS. Monocytes (MON) were greater for TRT sows at d 0 and d 7 (<span>P</span> = 0.04 and <span>P</span> = 0.003, respectively) compared with NEG group, whereas LYM in TRT was greater than POS on d 7 (<span>P</span> &lt; 0.001) only. Platelet distribution width was greater for POS than NEG (<span>P</span> = 0.04) but did not differ from TRT on d 7. TRT had a greater total plasma protein (TP) concentration than NEG and POS groups on d 7 (<span>P</span> = 0.01 and <span>P</span> = 0.03, respectively). Similarly, AST was significantly greater for POS than NEG on d 7 (<span>P</span> = 0.01). There was no significant difference in farrowing performance among the treatment groups. The behavior data showed greater active behaviors (such as eating, drinking, interacting with other sows or enrichment) in TRT than POS and NEG during the first and second hour (<span>P</span> &lt; 0.05) whereas standing behaviors and interacting behaviors in TRT were greater than POS and NEG during the second hour after providing AHBs (<span>P</span> &lt; 0.05) and did not differ at any time after the second hour. In conclusion, the AHB-MYO coated in MP increased exploration of enrichment but did not significantly influence stress parameters (cortisol) nor farrowing performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"287b102bf26baea4ea2bd5a75ea11a6015372eb179fe7dc556bf33e7727997b2","category":"Environment"}