{"title":"Is your macOS FileVault Recovery Key current? Here’s how to check","link":"https://www.macworld.com/article/340731/is-your-macos-filevault-recovery-key-current-heres-how-to-check.html","date":1617099300000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>FileVault is an excellent tool to protect your Mac&rsquo;s drive when it&rsquo;s shut down. When FileVault is active, someone powering up your machine cannot gain access through any means to the encrypted data on your startup volume without knowing the password of one of your accounts.</p>\n\n\n\n<p>(FileVault also enables full-disk encryption on Intel Macs without a T2 Security Chip. All T2-equipped Macs starting in 2017 and all M1 Apple silicon Macs have FDE always enabled.)</p>\n\n\n\n<p>When you turn on FileVault, macOS prompts you about a critical backup element, the FileVault Recovery key. You can choose to store it in escrow and securely via iCloud. Then you just need your iCloud account, password, and second-factor (like a trusted device) to regain access if you ever find yourself locked out of your Mac, where an account password ceases to work.</p>\n\n\n\n<p>But you can also opt to track the Recovery Key yourself, <a href=\"https://www.macworld.com/article/3268809/how-to-find-your-filevault-recovery-key-in-macos.html\">as I describe in this column from 2018</a>. However, a reader asked a question that can result if you disable and re-enable FileVault&mdash;which takes just seconds with a T2-equipped or M1 Mac&mdash;or migrate to a new Mac. This might leave you with multiple Recovery Keys you&rsquo;ve noted over time.</p>\n\n\n\n<p>If you haven&rsquo;t carefully tracked your Recovery Key, you could wind up being unsure which is accurate for your current Mac and FileVault encryption setup. There&rsquo;s fortunately an easy way to check.</p>\n\n\n\n<ol><li>Launch <em>Applications &gt; Utilities &gt; Terminal</em>.</li><li>Type exactly the follow and press return: <code>sudo fdesetup validaterecovery</code></li><li>The <code>sudo</code> command warns you about the dangers of this &ldquo;superuser&rdquo; mode if it&rsquo;s the first time you&rsquo;ve used. Enter your password (you must be using an administrator account), and press <em>Return</em>.</li><li>At the &ldquo;Enter the current recovery key:&rdquo; prompt type or paste in the Recovery Key and press <em>Return</em>.</li></ol><p>You will see <code>true</code> if the Recovery Key the current key; <code>false</code> if not. If you get the latter and you typed rather than pasted in your Recovery, consider you might have mistyped it and try again.</p>\n\n\n\n<p>If you didn&rsquo;t enter the key in exactly the format that they&rsquo;re provided in, the app will note &ldquo;Error: not a valid recovery key.&rdquo; Try re-entering.</p>\n\n\n\n<p>If none of your keys prove valid, you should immediately disable and re-enable FileVault, <a href=\"https://www.macworld.com/article/3512016/how-to-cope-with-a-filevault-recovery-key-disappearing-while-you-write-it-down.html\">following the instructions in this column</a> under the heading, &ldquo;No record of Recovery Key.&rdquo;</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1336\" height=\"1174\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macos-big-sur-filevault-preferences.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"macOS Big Sur FileVault\" class=\"wp-image-100060384\" srcset=\"https://www.macworld.com/wp-content/uploads/2021/03/macos-big-sur-filevault-preferences.jpg 1336w, https://www.macworld.com/wp-content/uploads/2021/03/macos-big-sur-filevault-preferences.jpg?resize=300,264 300w, https://www.macworld.com/wp-content/uploads/2021/03/macos-big-sur-filevault-preferences.jpg?resize=768,675 768w, https://www.macworld.com/wp-content/uploads/2021/03/macos-big-sur-filevault-preferences.jpg?resize=1024,900 1024w\" sizes=\"(max-width: 1336px) 100vw, 1336px\"><figcaption><p>FileVault controls are located in <em>System Preferences &gt; Security &amp; Privacy,</em> under the FileVault tab.</p> But you need to use the Terminal to check the validity of your FileVault Recovery Key.</figcaption></figure><p class=\"imageCredit\">Apple</p></div>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Aust&eacute;.</em></p>\n\n\n\n<h2 id=\"ask-mac-911\">Ask Mac 911</h2>\n\n\n\n<p>We&rsquo;ve compiled a list of the questions we get asked most frequently along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we&rsquo;re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a> including screen captures as appropriate, and whether you want your full name used. Not every question will be answered, we don&rsquo;t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div></body></html>","author":"Glenn Fleishman","siteTitle":"Google Maps can now give you directions inside a mall or airport","siteHash":"2630f990a97c0fb1c464acf767310f86292d38708c1b5c81971b6e1c2a08ae5b","entryHash":"28876312ced036a414ad162a188b87330b78a57740dfb723cb3eeeda0671d670","category":"Apple"}