{"title":"The LoreOne is the world’s first custom 3D-printed carbon cycling shoe","link":"https://cyclingtips.com/2021/07/the-loreone-is-the-worlds-first-custom-3d-printed-carbon-cycling-shoe/","date":1627369252000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/LoreOne-cycling-shoe-650x366.jpg\" /></div><h2>The LoreOne is the world’s first custom 3D-printed carbon cycling shoe</h2><p>\n</p><p>First teased earlier this year and now open for pre-order, <a href=\"https://lore.cc/\" target=\"_blank\">Lore Cycle</a> is a start-up from Silicon Valley looking to shake up the cycling shoe market with a novel design produced with new-age tech. The space-age, sandal-like kicks combine a 3D-printed carbon exterior skeleton with a soft foam liner for a custom road shoe like no other. </p>\n\n\n\n<p>And because they’re space-age, you’d better believe they’ve got a price that’s out of this world.</p>\n\n\n\n<h2>Scan, print, deliver </h2>\n\n\n\n<p>The LoreOne, the first product from Lore Cycle, arrives with a staggering number of bold claims, patent-pending concepts and (over)qualified staff with resumes that include major consumer brands. </p>\n\n\n\n<p>At the company helm sits Stephan Drake. He’s the founder of DPS Skis, a company credited for producing innovative carbon fibre-based skis, with his new venture appearing to borrow some design elements from the ski boot world. </p>\n\n\n\n<p>Also within the stacked staff roster – mostly from outside the bike industry – sits Colby Pearce, a former Olympic track cyclist and now <a href=\"https://www.colbypearce.com/\" target=\"_blank\">bike fitting specialist</a>. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/LoreOne-cycling-shoe-2-1340x754.jpg\" /><figcaption>The LoreOne offers an aesthetic that clearly hasn’t come from the cycling world. </figcaption></figure>\n\n\n\n<p>Lore’s consumer-direct business model is unexpectedly unique for a custom shoe company. Notably, they plan to produce the custom shoes without any in-the-flesh interaction with the owners of the feet, instead relying on the wonders of modern technology. </p>\n\n\n\n<p>The first stage in the custom ordering process is to use a proprietary iPhone app developed by the Lore team. Named <a href=\"https://morphic.me/\" target=\"_blank\">Morphic</a>, this app essentially takes a 3D scan of your foot for the custom shoe to then be made from. According to Lore, this app has the scalability to “create performance body-mapped products to multiple sporting good categories.” </p>\n\n\n\n<p>Once you’ve requested Siri to scan your feet, the design whooshes off to the Californian-based team to produce your one-off shoes. Here, Lore 3D-print a custom sized and shaped carbon fibre structure dubbed the CarbonAirFrame (CAF) which forms the rigid skeleton of the shoe. </p>\n\n\n\n<p>The idea of a carbon outer shell with a separate soft inner liner isn’t new to cycling. Mavic used a similar approach with its rather limited <a href=\"https://cyclingtips.com/2020/01/tech-gallery-head-to-toe-with-the-shoes-and-helmets-of-the-tour-down-under/\" target=\"_blank\">Comete Ultimate II shoes</a>, and other companies have played with a similar – albeit more integrated – concept. However, Lore’s custom approach certainly takes the idea to another level. </p>\n\n\n\n<p>Lore hasn’t detailed what specific 3D printing technology it’s using, but the claimed recyclable continuous carbon fibre method points toward a pre-impregnated (aka<strong> </strong>pre-preg) carbon fibre tow which is then bonded with a thermoplastic. However, there are different approaches to continuous carbon fibre 3D printing; <a href=\"https://www.youtube.com/watch?v=YI8y7rwSMFk\" target=\"_blank\">Anisoprint</a> is just one specialist company in the space, with a technique that may offer a clue into how the carbon fibre aspect of Lore’s shoes are made.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/LoreOne-cycling-shoe-3-1340x754.jpg\" /><figcaption>Beep boop. </figcaption></figure>\n\n\n\n<p>3D printing the carbon structures also provides Lore with the opportunity to customise the finer points of the shoes, such as the cleat placement and cleat compatibility. You can choose between a regular three-hole setup or a Speedplay-specific four-hole layout. And according to Lore, your first and fifth metatarsal bone positions (the ‘knuckles’ of your feet) will come marked for easy cleat set up. </p>\n\n\n\n<p>The open web-like structure is matched to a ventilated foam liner. Together, it’s claimed that the LoreOne is the most ventilated cycling shoe on the market. That is, of course, a great benefit for a few months of the year, but could be a real negative at other times. To mitigate against the weather, Lore will provide a range of fitted shoe covers including aero knit, aero textile and foul weather versions. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/LoreOne-cycling-shoe-1-1340x754.jpg\" /><figcaption>Lore offers a selection of shoe covers in case you don’t like the sandal look.</figcaption></figure>\n\n\n\n<p>The company hasn’t provided any specific details or imagery of the shoe’s retention system, but there appear to be ski boot-like buckles that close the carbon fibre structure onto the foot. What appears to be an adjustable strap wraps from behind the heel and over the top of the shoe. </p>\n\n\n\n<p>Weights will of course vary depending on the required size and shape, but Lore claims a size US10 will be approximately 270 grams per shoe. That figure means the LoreOne are far from the lightest road cycling shoe on the market, but it’s clear the company has its sights set on other performance metrics. </p>\n\n\n\n<h2>Big claims for a big price </h2>\n\n\n\n<p>The new shoes come with some rather big claims, just as you may expect of a start-up cycling brand from Silicon Valley. </p>\n\n\n\n<p>If I’m honest, I reckon some of their statements directly undermine the legitimacy Lore is trying to build, but then, they’re also undeniably amusing.</p>\n\n\n\n<p>“The LORE project is three massive steps forward from any other shoe on the market. Prepare to have your head explode while your feet feel true power transfer for the first time ever,” quotes Colby Pearce in the release. </p>\n\n\n\n<p>“The technology used in the design and manufacturing is light years ahead of everything else. The way the athlete works with the shoe is groundbreaking, and the foothold is unparalleled. The LoreOne shoe will change the way you interact with your bike, forever.”</p>\n\n\n\n<p>That head-exploding power transfer is seemingly related to how the shoe holds the foot, which is somewhat upside-down from the norm. Most cycling shoes provide support from the sole, whereas Lore does it from the rigid topside of the shoe and with a “perfect” heel cup. Lore claims that this patented concept allows “the foot to athletically spread under load” with “less stress on the nervous system.” </p>\n\n\n\n<p>The company also claims that this vertically-aligned retention of the foot is of direct benefit to power transfer with less energy waste at the 6 and 12 o’clock dead strokes. That of course will greatly depend on your pedalling action, but such a claim isn’t too far away from what Specialized says about its new <a href=\"https://cyclingtips.com/2021/01/specialized-s-works-ares-shoe-review-a-sprinters-shoe-for-everyone/\" target=\"_blank\">sprinter-focussed Ares shoe</a>. </p>\n\n\n\n<p>Lore’s <a href=\"https://lore.cc/\" target=\"_blank\">pre-order has opened</a> with the extremely specific sum of 277 pairs available for 2021. Those early takers will, in exchange for US$1,900, get themselves a limited edition “Founder’s Kit” that reads like a Christmas-time cosmetics bundle giveaway. </p>\n\n\n\n<p>Included in the kit are the freshest of fresh custom shoes printed just for you, three different sets of overshoes, a limited edition pennant to commemorate the purchase, a shoe travel bag and an equally limited edition cycling cap. </p>\n\n\n\n<p>The 278th customer will miss out on the goodies and be added to the regular build queue which is scheduled to start printing in 2022. The pricing for the regular non-limited LoreOnes is unchanged at US$1,900.</p>\n\n\n\n<p>The asking price makes S-Works, Rapha and Lake look like last year’s bargain bin dregs, and is notably still well over double the likes of a Rocket7 custom cycling shoe. </p>\n\n\n\n<p>It’s also about what you’d expect of a custom 3D-printed carbon fibre cycling shoe that calls for a proprietary scanning app. </p>\n\n\n\n<p>To flip a quote from Lore into a question, what other shoes “blur the line between body, spirit, and bicycle?” Certainly none that I can afford. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/the-loreone-is-the-worlds-first-custom-3d-printed-carbon-cycling-shoe/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"288e0f6bb4d0fa7619aef5ba5e2e3982b7b3d7c9a5a928320feb9c614e76fe91","category":"Cycling"}