{"title":"AMD launches Ryzen 8000G desktop CPUs, with updated iGPUs and AI acceleration","link":"https://arstechnica.com/?p=1994104","date":1704727837000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/8000g-6-2-980x551.jpeg\" alt=\"AMD's first Ryzen 8000 desktop processors are what the company used to call &quot;APUs,&quot; a combination of a fast integrated GPU and a reasonably capable CPU. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/8000g-6-2.jpeg\">Enlarge</a> <span>/</span> AMD's first Ryzen 8000 desktop processors are what the company used to call \"APUs,\" a combination of a fast integrated GPU and a reasonably capable CPU.  (credit: AMD)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>AMD's G-series Ryzen desktop processors have always been a bit odd—a little behind the curve on AMD's latest CPU architectures, but with integrated graphics performance that's enough for a tiny and/or cheap gaming desktop without a dedicated graphics card. They're also usually updated much more slowly than AMD's other desktop Ryzens. Today, AMD is announcing a new lineup of Ryzen 8000G processors, chips that should provide a substantial boost over 2021's Ryzen 5000G chips as long as you don't mind buying a new socket AM5 motherboard and RAM to go with them.</p>\n<p>There are three new processors releasing on January 31. The most powerful is the $329 Ryzen 7 8700G, an 8-core CPU with a Radeon 780M GPU. The next step down, and probably the best combination of price and performance, is the $229 6-core Ryzen 5 8600G, which comes with a slightly slower Radeon 760M GPU.</p>\n<p>At the bottom of the range is the $179 Ryzen 5 8500G. It also includes six CPU cores, but with a wrinkle: two of those cores are regular Zen 4 cores, while four are <a href=\"https://arstechnica.com/gadgets/2023/11/amd-starts-bringing-its-own-tiny-cpu-cores-to-new-ryzen-7040-laptop-chips/\">smaller \"Zen 4c\" cores</a> that are optimized to save space rather than run at high clock speeds. Zen 4c can do exactly the same things as Zen 4, but Zen 4c won't be as fast, something to be aware of when you're comparing the chips. The 8500G includes a Radeon 740M GPU.</p></div><p><a href=\"https://arstechnica.com/?p=1994104#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1994104&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"28b8c74562cd43ca1d1adb613f221a71dcadbf79910055488c1efb4ab35d7399","category":"Tech"}