{"title":"Role of Rabenosyn-5 and Rab5b in host cell cytosol uptake reveals conservation of endosomal transport in malaria parasites","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002639","date":1717164000000,"content":"<p>by Ricarda Sabitzki, Anna-Lena Roßmann, Marius Schmitt, Sven Flemming, Andrés Guillén-Samander, Hannah Michaela Behrens, Ernst Jonscher, Katharina Höhn, Ulrike Fröhlke, Tobias Spielmann</p>\r\n\r\nVesicular trafficking, including secretion and endocytosis, plays fundamental roles in the unique biology of <i>Plasmodium falciparum</i> blood-stage parasites. Endocytosis of host cell cytosol (HCC) provides nutrients and room for parasite growth and is critical for the action of antimalarial drugs and parasite drug resistance. Previous work showed that PfVPS45 functions in endosomal transport of HCC to the parasite’s food vacuole, raising the possibility that malaria parasites possess a canonical endolysosomal system. However, the seeming absence of VPS45-typical functional interactors such as rabenosyn 5 (Rbsn5) and the repurposing of Rab5 isoforms and other endolysosomal proteins for secretion in apicomplexans question this idea. Here, we identified a parasite Rbsn5-like protein and show that it functions with VPS45 in the endosomal transport of HCC. We also show that PfRab5b but not PfRab5a is involved in the same process. Inactivation of PfRbsn5L resulted in PI3P and PfRab5b decorated HCC-filled vesicles, typical for endosomal compartments. Overall, this indicates that despite the low sequence conservation of PfRbsn5L and the unusual N-terminal modification of PfRab5b, principles of endosomal transport in malaria parasite are similar to that of model organisms. Using a conditional double protein inactivation system, we further provide evidence that the PfKelch13 compartment, an unusual apicomplexa-specific endocytosis structure at the parasite plasma membrane, is connected upstream of the Rbsn5L/VPS45/Rab5b-dependent endosomal route. Altogether, this work indicates that HCC uptake consists of a highly parasite-specific part that feeds endocytosed material into an endosomal system containing more canonical elements, leading to the delivery of HCC to the food vacuole.","author":"Ricarda Sabitzki","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"28bb1e215c68e7dbee12a71da36c93ded870de230ee18e5ac51651e6317b41ca","category":"Environment"}