{"title":"Use of Non-Chlorine Sanitizer in Improving the Quality and Safety of Marketed Fresh Salad Vegetables","link":"https://www.preprints.org/manuscript/202404.1281/v1","date":1713520589000,"content":"The safety of vegetable food is compromised by various factors, including the inefficient or excessive use of sanitizers. Instances of individuals falling ill after consuming raw vegetables have been reported, with outbreaks of diseases caused by pathogens on fresh vegetables becoming increasingly prevalent globally, attracting significant media coverage and impacting the economic viability of vegetable cultivation. Measures to enhance food safety in postharvest horticultural produce involve controlling microbial proliferation and minimizing cross-contamination. Sanitizers were utilized in the food safety arsenal for a variety of purposes, including pathogen elimination and microbe reduction, hand, tools, and vegetable contact surface cleaning, and produce shelf life extension. Choosing an appropriate sanitizer for all vegetables is difficult due to a lack of knowledge on which sanitizers are ideal for the many types of vegetables grown on farms under different environmental circumstances. Although chlorine-based sanitizers, such as sodium or calcium hypochlorite, have been widely used for the past 50 years, recent research has revealed that chlorine reacts with an organic compound in fresh vegetables to produce trihalomethane, a carcinogen precursor, and as a result, many countries have prohibited the use of chlorine in all foods. As a result, horticulture research groups worldwide are exploring for non-chlorine, ecologically friendly sanitizers for the vegetable industry. They also want to understand more about present procedures in the vegetable business for employing alternative sanitizers, as well as the efficacy and potential dangers to the food safety of fresh salad vegetables. This review-cum-research paper presented detailed information on non-chlorine sanitizers, such as their efficacy, benefits, drawbacks, regulatory requirements, and the need for additional research to lower the risk of marketed salad vegetable food safety.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"28be3742bd59c1c258ac771d5c8bc254fdcf3ba861aa08c03c1be8550fd07784","category":"Interdisciplinary"}