{"title":"Apple Announces Final Cut Pro and Logic Pro for iPad With Subscription Models","link":"https://www.macrumors.com/2023/05/09/apple-announces-final-cut-pro-and-logic-pro-for-ipad/","date":1683637597000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2023/05/apple-brings-final-cut-pro-and-logic-pro-to-ipad/\">announced</a> that Final Cut Pro and Logic Pro are coming to the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> later this month via subscription models.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nApple says that Final Cut Pro and Logic Pro feature all-new touch interfaces that take advantage of multi-touch on the ‌iPad‌:<blockquote>Final Cut Pro and Logic Pro for iPad bring all-new touch interfaces that allow users to enhance their workflows with the immediacy and intuitiveness of multi-touch. Final Cut Pro for iPad introduces a powerful set of tools for video creators to record, edit, finish, and share, all from one portable device. Logic Pro for iPad puts the power of professional music creation in the hands of the creator — no matter where they are — with a complete collection of sophisticated tools for songwriting, beat making, recording, editing, and mixing.</blockquote>\r<br />\n<div></div>\r<br />\nFinal Cut Pro and Logic Pro for the ‌iPad‌ will each be available for $4.99 per month or $49.99 per year, with a one-month free trial. Final Cut Pro requires an ‌iPad‌ with an <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> chip or newer, while Logic Pro requires an A12 Bionic ‌iPad‌ or newer. The apps will be available on the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> starting on Tuesday, May 23.\r<br />\n\r<br />\n<h3>Final Cut Pro</h3>\r<br />\nFinal Cut Pro includes a digital jog wheel to navigate the Magnetic Timeline, move clips, and make frame-accurate edits. Live drawing allows users to draw and write directly on top of video content with the <a href=\"https://www.macrumors.com/guide/apple-pencil/\">Apple Pencil</a>, with support for ‌Apple Pencil‌ hover  to skim and preview footage. Key commands are enabled when using an external keyboard. Final Cut Pro on ‌iPad‌ also supports the 12.9-inch <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>'s Reference Mode for color accurate editing.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Apple-iPad-Final-Cut-Pro-lifestyle-multicam.jpg\" alt width=\"3840\" height=\"2560\" />\r<br />\nMachine learning features include Scene Removal Mask to quickly remove or replace backgrounds without using a green screen, Auto Crop for adjusting footage for vertical, square, and other aspect ratios, and Voice Isolation to remove background noise easily.\r<br />\n\r<br />\nThe app includes a library of graphics, effects, and audio, including HDR backgrounds, animated patterns, and soundtracks that automatically adjust to the duration of a video.\r<br />\n\r<br />\nPro camera mode allows creators to shoot video in Final Cut Pro in landscape or portrait, monitor audio and recording time, and manually control settings like exposure, white balance, and focus. Multicam video editing automatically synchronizes clips for editing together, making it possible to switch angles with a single touch.\r<br />\n\r<br />\nMedia can be imported from Files or <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a> and saved directly inside a Final Cut Pro project. The app also supports import of projects created in iMovie, and users can export Final Cut Pro projects made on ‌iPad‌ to the Mac.\r<br />\n\r<br />\n<h3>Logic Pro</h3>\r<br />\nLogic Pro for the ‌iPad‌ uses a range of multi-touch gestures to play software instruments and and navigate projects. The ‌Apple Pencil‌ facilitates precision edits and detailed drawn track automation. Like Final Cut Pro, key commands are supported when using an external keyboard. Using the ‌iPad‌'s built-in microphones, users can also capture audio directly in the app.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Apple-iPad-Logic-Pro-lifestyle-mixer.jpg\" alt width=\"3840\" height=\"2560\" />\r<br />\nThe app has a full-featured mixer with channel strips, volume faders, pan controls, plug‑ins, sends, and precise automation. Multi-touch lets creators move and mix multiple faders at once, and the mixer meter bridge lets them navigate an overview of track levels.\r<br />\n\r<br />\nAn all-new sound browser with dynamic filtering helps creators explore all available instrument patches, audio patches, plug‑in presets, samples, and loops in one location. Users can simply tap to listen to any sound before adding it to a project.\r<br />\n\r<br />\nThe app includes over 100 instruments and effect plug-ins, with plug-in tiles for the most important controls. Production tools enable users to chop and flip samples, program beats and bass lines, and create custom drum kits.\r<br />\n\r<br />\nA new time and pitch-morphing plug-in called Beat Breaker allows creators to swipe and pinch to reshape and shuffle sounds. The Quick Sampler can chop and transform samples into new playable instruments, while Step Sequencer lets users program drum patterns, bass lines, and melodies, and automate plug‑ins. Drum Machine Designer offers the ability to create custom drum kits by applying samples and plug‑ins to any drum pad. Using Live Loops, users can quickly build arrangements.\r<br />\n\r<br />\nLogic Pro for the ‌iPad‌ supports roundtrip capabilities to move projects between Logic Pro for the Mac and ‌iPad‌. ‌iPad‌ users can export completed songs in multiple lossless and compressed formats, as well as individual audio track stems. Creators can make a soundtrack in Logic Pro and export it into Final Cut Pro when working across music and video. Logic Pro for the ‌iPad‌ also supports the ability to open GarageBand projects.<div>Tags: <a href=\"https://www.macrumors.com/guide/logic-pro/\">Logic Pro</a>, <a href=\"https://www.macrumors.com/guide/final-cut-pro/\">Final Cut Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/09/apple-announces-final-cut-pro-and-logic-pro-for-ipad/\">Apple Announces Final Cut Pro and Logic Pro for iPad With Subscription Models</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-announces-final-cut-pro-and-logic-pro-for-ipad-with-subscription-models.2389080/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"28c8d4a72035a4da7c31338b4c7664c283c4593083a90d1e9a77a7902657d909","category":"Apple"}