{"title":"Clinicopathological Appearance of Epidermal Growth Factor-Containing Fibulin-Like Extracellular Matrix Protein 1 Deposition in the Lower Gastrointestinal Tract: An Autopsy-Based Study","link":"https://www.preprints.org/manuscript/202406.0925/v1","date":1718283220000,"content":"This study examined the patterns of epidermal growth factor-containing fibulin-like extracellular matrix protein 1 (EFEMP1) deposition in the small intestine and colon to evaluate the association between histopathological severity of EFEMP1 deposition and constipation and determine if amyloid transthyretin (ATTR) and EFEMP1 deposits can colocalize. In 40 older cases (≥80 years of age), EFEMP1 deposition in the small intestine initiated in the submucosal and subserous vessels, subserous interstitium, and serosa (early stage); progressing to the muscularis propria and peri-Auerbach plexus area (intermediate stage); and finally, spreading diffusely to areas, excluding the mucosa and muscularis mucosa (advanced stage). The colon had a similar pattern of progression. During the middle-to-advanced stages, amyloid formation was observed in some vascular and serous deposits. We identified a subgroup of cases in which EFEMP1 deposition was the only presumed cause of constipation. Additionally, we demonstrated the colocalization of ATTR and EFEMP1 deposition. Apple-green birefringence was detected under polarized light only in approximately one-half of the cases in the small intestine and one-third of the cases in the colon. These findings emphasize that EFEMP1 deposits may be associated with lower gastrointestinal pathological conditions. Given the challenges of histopathological diagnosis on Congo red-stained specimens, we recommend the combined use of elastic fiber staining and immunohistochemistry for EFEMP1 to prevent overlooking this deposition.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"28e6d1b75e3b450a11e12cbf78951543413cf882fe84e0d292f8ad75727fa06e","category":"Interdisciplinary"}