{"title":"No EXIF: A Canyonlands Retrospective in Medium Format – Kyle Klain & John Watson","link":"https://theradavist.com/2021/10/no-exif-a-canyonlands-retrospective-in-medium-format/?utm_source=rss&utm_medium=rss&utm_campaign=no-exif-a-canyonlands-retrospective-in-medium-format","date":1634126446000,"content":"<p><i>While many of the sites and vistas here are fairly well known, we will not be providing names and furthering keywording the area for the Internets. We encourage you to find a Canyonlands map, a cup of tea, and a good reading lamp and enjoy letting your mind wander the nooks, grottos, bends, and spires on the map unfolded before you.<span> </span></i><span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/12.-Mornings-GW690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Arrival</strong></p>\n<p>The first strays of light began illuminating the bald domes of sandstone above us while the unhurried rustle of nylon and down sleeping bags hinted that the others must also be awakening. It was already later than expected since the deep canyon walls shielded our camp from the fulgid desert sun and after an unforeseen cold front pushed into the Four Corners we laid snug and content awaiting the frost to cede from our tent walls. Our first morning, now within the embrace of towering walls, would be lethargic and chilled–a prequel to the pace of our trip for the next few days.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/3.-Prepared...probably-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Back in December, during the strictest restrictions of the pandemic and the shortest days of the year, a hail-mary text circulated between John and me. We were guessing at the chances that travel would be opening up come spring and the likelihood that our age group would have access to vaccines. No matter, even with permits unused we could consider it a donation to the National Park Service. More importantly, though, was the hope that we could once again visit the spectacular landscape and history of canyon country. We took a shot in the dark and the permit struck our inboxes shortly thereafter, beaming as our ticket of optimism in the depths of the dark winter.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/29.-Navigation-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Now, donning our down jackets and beanies, we collected ourselves and began the great untethering–we mutually agreed to abstain from technology and brought only a paper map and a pair of film cameras. In an attempt to regain control of our thoughts and emotions, we wanted to experience the bewildering landscape before us with fresh eyes and minds free of digital interruption. It was quiet. The faint hint of coffee circulated in the cool morning air. Cari and Kimmy were perched backlit above camp, warming their shoulders and cupping their mugs, slowly reanimating like the whiptail lizard on the adjacent sandstone bench. We were alive.<span>  </span>We were back.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/14.-Water-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Time</strong></p>\n<p>Nothing is static here. We can see the various courses water has attempted throughout the years, including subtle reroutes in the past months that could become the next canyon millennia from now. The braids of the trail meander around the newly fallen stone and navigate the changing growth of reeds and cottonwoods, sometimes becoming hard to follow while other times looking as if it has been used since the Ancestral Puebloan folks were farming this rare riparian canyon bottom.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/8.-Kim-Framed-GW690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Walking down the main trail our conversations drift between topics as mundane as the pros and cons of hiking in sandals vs boots and commentary on the unseasonably cool weather. John and I discuss our camera choices; he’s carrying his much-beloved Mamiya 7II and my egregiously large Fujifilm GW690II. We’re debating the merits of bringing only our film cameras on this trip as we’ll certainly have plenty of stunning moments to capture and knowing our cabinets at home are stacked with top-tier digital equipment.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/25.-Composition-GW690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Accepting our choices and being relieved of instant internal criticism was our primary motivation. There is no doubt that film has its own look, for better or worse, but in this case, the process is more important than the result. Like the slow food movement, we’re slow photographing. We have come this far to try our best to be present and to let our minds wander through the layers of the Colorado Plateau.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/6.-Old-Cabin-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We first pass a cabin abandoned by a rancher, a century before. The chimney stack is still erect and the hand-hewn wood beams are pale from decades in the unrelenting desert sun. Comparing the condition of this homestead against the multitude of thousand-year-old dwellings left behind by the previous inhabitants reveals the ignorance of the former. Most Ancestral Pueblo dwellings we visit are south-facing and tucked under a cliff wall, leveraging the winter sun for warmth and the canyon shadows in the summer to stay cool. His cabin, however, is exposed and unprotected.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/49.-Kimmy-GW690.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/10/48.-Cari-Cari-M7ii.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/10/50.-Kyle-M7ii.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/10/47.-Johnny-GW690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>This canyon is unusual in that it provides a perennial stream that keeps the cottonwoods healthy and is home to thousands of archeological sites. As we walk along the narrow path cutting through the crypto soils, we begin to see the sprouts of squash that have returned to the fertile canyon year after year for well over 800 years. John and Cari take time to admire potsherds that frequent our trail. Kim and I climb the ledges and alcoves to assuage our curiosities.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/31.-Wow-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Our group arrives at one of two well-known pictograph panels tucked in a deep canyon seep protected from the elements. Sitting at the base is an ammo can with some archeological theories provided by the National Park Service and a new sign barring visitors from climbing into the cave and viewing the panel up close (this photo was taken from outside the cave with a telephoto lens). This was new and was not here in previous years when Kim and I had visited. The pressures of our unrelenting desire to experience these places have started to take their toll. Sites, just like this one, continue to be vandalized, touched, and traced, geo-tagged, and promoted.<span> </span></p>\n<blockquote><p>“This place is a part of the history of all the Native peoples in this region. It’s like a book for us, and when many tribes have a chapter in this book, it tells us a lot about why we are the way we are. But it’s also part of the history of the peoples of the United States and the world. I believe that tribal peoples of this region shouldn’t be the only ones to take responsibility for protecting the cultural resources; they belong to everyone, and everyone should take responsibility for protecting them.”</p>\n<p><i>Jim Enote, Pueblo of Zuni – Bears Ears Coalition <a href=\"https://bearsearscoalition.org/\" target=\"_blank\">bearsearscoalition.org</a></i></p></blockquote>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/23.-Metate-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The sites are certainly not stagnant, though, just as the land itself. Years ago I witnessed a massive rock wall collapse in the middle of a sunny afternoon, taking with it a small pictograph panel and permanently encasing a stone granary. On other trips, we have watched heavy rains wash away generations of potsherds into the ochre San Juan river and mighty Colorado. Listening to the proponents of the Bears Ears National Monument tell their stories, you realize this place has never been stagnant–it is alive.</p>\n<p><em>Preservation, it seems, may be just another myth we tell ourselves.<span> </span></em></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/4.-Trails-_-Crypto-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Land</strong></p>\n<p>Our route headed down canyon, which in Canyon Country is always preferable. Flash floods and prevailing winds nearly always point the branches and debris downstream. It’s best to go with the flow. Though we started our trip in a wet blizzard, the winter had been dry and warm. We easily pushed back wilted reeds and willows and walked on cracked earth that should have been a swampy flat any other year. Everywhere around us were signs of distress–cottonwoods aching to reveal their electric green spring leaves, snake grass, and rice struggling to return–and the perennial stream seemed sporadic and unreliable.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/15.-Drink-up-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>John and I kneel in a thicket of grass, filtering water from a burbling pool no bigger than our hands. A canyon towhee perched in the cottonwood overhead watches our slow progress before announcing his departure. The canyon, otherwise, is oddly quiet. The typical bustle of spring is muted.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/34.-Napping-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The Cedar Mesa sandstone radiates the unobscured sun directly overhead. Despite the cool temperatures, we shed our layers and absorb the abundant warmth. Cari drapes her brimmed hat over her eyes and takes a nap. Nearby, cliffs soar high above, casting shadows on pockets of large pines tucked in grottos and alcoves. Light winds rustle the remaining dried foliage from last autumn. Our minds wander as our bodies relax and the physical world returns.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/39.-Trails-GW690.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/10/40.-Cottonwoods-GW690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Drought is no stranger to this place. Over millennia peoples have come and gone to the rhythm of climate oscillations. For the past decade, this region has been blighted by arid winters and hot, monsoon-less summers. Even now, despite an otherwise empty landscape, we cannot escape the realities of a changing climate. How soon do we forget the forces of drought on history? An epiphany occurs that we’re living in the midst of the two most prominent sources of human suffering and migration: drought and disease.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/41.-Campsite-GW690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>It doesn’t take long to be reminded of the challenges of our modern world. Near our designated camp we find an illegal fire ring with fresh soot staining and not too far a site that seems to have been dug up in search of fossils. A little further ahead some toilet paper clings to the cacti and a social trail cuts through more soil. Even out here, deep in the maze of sandstone and cliffs, we cannot escape our own selfishness.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/44.-Dinner-GW690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Resolve</strong></p>\n<p>Our morning rituals have slowed. It is a lot colder than expected and until the sun is up, we balk at thoughts of breaking camp. The hiss of stoves punctures the silent air and the clank of titanium echoes off the stone. We have a lot of miles ahead so it is best if we pack up and start on our way.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/51.-Panels-GW690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>At the last logbook, notes from visitors complain of lack of water and as we move lower in elevation, the stream is dry with an occasional dank hole to pump from. Miles and miles pass and we see more dwellings and granaries, but now also more signs of more recent people. Again, more fire rings, campsites, trash. We observe the changing landscape, both literally and metaphorically</p>\n<blockquote><p>[Those] “who prefer to thrill at nature’s wonders in a less vigorous way will be able to drive their modern cars over smooth paved roads to the colorful fantasy land. Nor should the most ardent wilderness lover begrudge these access roads which will make the sights of Canyonlands available to all Americans. . . It’s too big and too tough to spoil.”<span> </span></p>\n<p><i>Times- Independent (in Moab), May 19, 1966</i></p></blockquote>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/54.-The-Way-Out-GW690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>It’s hard not to see the pressures that we put on places like this. The pandemic pushed more people outside and our desire to share and post wonderful locations has done the land no favors, let alone the agencies that are tasked with protecting them. Is it that we share too much?<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/58.-Kyle-_-Kim-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We are nearing our exit after electing to skip our last night in favor of a car camp on the canyon’s rim. There are too many people in the lower canyon and our go-to sites are already claimed. The parking lot is completely full and sprinkled with license plates from all over the country. Older couples fresh out of REI are checking their maps, while some rock climbers are cooking from their rundown van. No matter our background, we are all here for similar reasons.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/59.-John-_-Cari-GW690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>For the first time in years, we returned to this place that we love and it is hard to shake the feeling of sadness. One can only imagine the similar but much deeper pain that the nearby tribes express about the land. We agree to become better listeners and pursue more diverse sources of education. It feels as if we are on the cusp of another ethic, one that includes more experienced and time-hardened knowledge and hopefully stepping away from personal brand-building and ego that has saturated our newsfeeds and led to the destruction of these types of important spaces. There must be a better way.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/60.-Goodnight-M7ii.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The final strays of sunlight hit the tops of the buttes and the snowy peaks of the La Sal contrast against the bright oranges of the sandstone below. We’re fully bundled against the thermal winds whipping over the canyon rim and huddled together to save our body warmth and to enjoy the sunset. We had high expectations for this trip and it delivered, albeit not in the ways we may have originally intended. As always, it is better to leave with more questions than answers.<span> </span></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"28ea08556f3a4a100723eae7a6f22669a572b7c14582297863a658a595abe4bf","category":"Cycling"}