{"title":"Treatment of Oily Effluents Using a Bacterial Cellulose Membrane as the Filter Bed","link":"https://www.preprints.org/manuscript/202406.0712/v1","date":1718113540000,"content":"One of the main challenges in the treatment of industrial wastewater is the removal of oil-in-water emulsions, which are stable and therefore difficult to treat. Bacterial cellulose (BC) has structural characteristics that make it an ideal filtration membrane. The present study investigated the effectiveness of a BC membrane filtration system for the treatment of oily industrial wastewaters. The results demonstrated that BC is highly effective at removing oily contaminants (~99%), reducing the colour and particulate matter of wastewater, as well as eliminating nearly the entire microbiological load (~99%). SEM, MEV, FTIR, XRD, and TGA demonstrated the presence of oil in the interior of the membrane after filtration, characteristic peaks of its chemical composition, and a 40% reduction in crystallinity. TGA revealed an increase from three (pre-filtration) to five (post-filtration) stages of thermal degradation, indicating the retention of the contaminant in the BC. The mechanical tests demonstrated that the membrane has tensile strength of 72.13 ± 8.22 MPa and tolerated elongation of up to 21.11 ± 4.81% prior to tearing. The BC membrane also exhibited excellent flexibility, as it could be folded &amp;gt; 100 times at the same point without exhibiting signs of tearing. The BC surpasses traditional methods, such as activated charcoal and effluent treatment stations, in the removal of emulsified oils. The findings demonstrate that BC is promising for the treatment of industrial wastewaters, which is a field that requires continual technological innovations to mitigate the environmental impacts of the oil industry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"28ec939e52c65c7dfa24faa33c05f38723253907f7f355ca4a16ac5b62201f3c","category":"Interdisciplinary"}