{"title":"Examination of the proportion and characteristics of cognitive function changes during hospitalization in patients with cardiovascular diseases","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309306","date":1724335200000,"content":"<p>by Takahiro Shimoda, Shinzi Suzuki, Daisuke Mizukoshi, Wada Saori, Erina Yokoshima, Tomoko Terai</p>\r\nObjective <p>Cognitive function decline is influenced by cardiovascular diseases and associated risk factors. However, changes in the cognitive function of patients with cardiovascular diseases during hospitalization and the factors influencing these changes remain unclear. This study elucidated the proportion and characteristics of changes in cognitive function during hospitalization in patients with cardiovascular diseases.</p> Methods <p>We conducted cognitive function assessments at admission and discharge for patients with cardiovascular diseases. Using the Mini-Mental State Examination (MMSE) and the Japanese version of the Montreal Cognitive Assessment (MoCA-J), we categorized the patients into cognitive impairment, mild cognitive impairment (MCI), and non-cognitive impairment. Changes in MMSE or MoCA-J scores of ≥2 points at discharge were classified as improvement or decline, and all others as maintenance.</p> Results <p>The cognitive impairment, MCI, and non-cognitive impairment categories comprised 215 (41.3%), 224 (40.2%), and 103 (18.5%) patients, respectively. The results of the cognitive function assessment at the time of discharge classified 90 patients (35.9%) into the maintenance group, 117 (46.6%) into the improvement group, and 44 (17.5%) into the decline group based on changes during hospitalization. There was a statistically significant difference among the three groups only in cognitive function at admission (P = 0.026). In multivariate analysis, those with MCI or cognitive impairment at admission and younger patients were associated with improved cognitive function during hospitalization. No factors were extracted that showed statistically significant associations with cognitive decline.</p> Conclusion <p>Approximately half of the patients with cardiovascular disease experienced improvements in cognitive function during hospitalization, while approximately 20% showed a decline in cognitive function during the same period. These findings demonstrate the importance of assessing cognitive changes in hospitalized patients with cardiovascular disease. Future studies are needed to identify factors associated with changes in cognitive function.</p>","author":"Takahiro Shimoda","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"28f236c0ac150e8910dee3fdba1e02f99c8a1b3b27f346f9e25c3f39800f7a3b","category":"Interdisciplinary"}