{"title":"Apple Vision Pro has only one path to success: the HomePod mini","link":"https://www.macworld.com/article/2214584/wait-affordable-apple-vision-pro.html","date":1706044771000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The Vision Pro is now available for sale! Apple has released videos and press releases detailing the experiences that will be available on day one and people are already complaining about which <a href=\"https://www.macworld.com/article/2201774/apple-vision-pro-youtube-netflix-spotify-native-apps.html\">services</a> <em>won’t</em> be there. Overall, though, it seems like a great product.</p>\n\n\n\n<p>But how is this going to work? Not technically, but as a business. Can it succeed?</p>\n\n\n\n<p>Unless you are tremendously wealthy and think nothing of throwing $3,500 at an impulse buy, the barrier to purchasing the Vision Pro is high. Most people are going to want to try it first, which means going to a mall. For like an hour. In 2024. Eesh. Who wants to do that? Then, unless you happened to be blessed with 20/20 vision, you’re going to have to get a current prescription. And is it from an optometrist or ophthalmologist? Who even knows? Then you’re going to have to shell out an additional $149 (or $99 for non-prescription readers).</p>\n\n\n\n<p>This isn’t like wandering into Costco and sheepishly picking up another pair of AirPods because, yes, you lost them <em>again</em>. This requires some work even before you get to the payment part.</p>\n\n\n\n<p>There is a previous product that might give us a clue about the Vision Pro’s prospects. The <a href=\"https://www.macworld.com/article/667557/homepod-review.html\">original HomePod</a> was likewise a premium product; “Look how good our sound is!” That was great for people who want the best sound. Now, audiophiles, if you could, please skip ahead to the next paragraph. They’re gone? Okay, yeah, the rest of us know most people don’t care. Sure, we want <em>good</em> audio, but it doesn’t have to be so finely tuned in Ogg Vorbis that your homeowners’ association writes you because they think you have a 70-person orchestra in your house. Good enough is good enough for a lot of people. </p>\n\n\n\n<p>Okay, let’s go catch up with the audiophiles. See you at the meeting for normals later. Hey, audiophiles! No, we weren’t talking about you. </p>\n\n\n\n<p>Moving on, if we use the <a href=\"https://www.macworld.com/article/2198260/apple-vision-pro-homepod-success-sales-price-second-generation.html\">HomePod example</a>–a convenient one to use since the Vision Pro costs 10 times what the original HomePod did–a non-Pro Apple Vision headset would cost $999. If you look at other headsets on the market, that does seem like an Apple price point, but the Macalope would very surprised to see one ship for that little.</p>\n\n\n\n<p>If we’re still trying to figure out how this is going to work, it’s probably pertinent to remember that the original HomePod <em>didn’t</em> work. The $350 price tag was just more than most people wanted to pay for a smart speaker in the age when Amazon was practically giving them away. But it worked enough to pave the way for the <a href=\"https://www.macworld.com/article/234895/homepod-mini-review.html\">HomePod mini</a>, which has been a great success at $99. And the <a href=\"https://www.macworld.com/article/1509062/homepod-2023-review.html\">HomePod came back last year</a> at a reduced $299.</p>\n\n\n\n<p>So we’ve determined that the price of the Vision Pro has to come down. We are very smart and are doing a great job here. Unfortunately, you can’t just jump to the end. You can’t just say “Make a cheaper one.” Well, you can <em>say</em> that, but Tim Cook will slap you with an old burrito. One he found in the executive fridge that says “PROPERTY OF RON JOHNSON – DO NOT EAT, <em>PHIL!</em>” See, there’s this little thing called “economies of scale” that Apple has to get in order to get the price down. It’s like driving to New York. You’ve gotta go through upstate New Jersey. Nobody wants to, but that’s just how you get there. Even if you’re coming from Connecticut for some reason. No one knows why.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://images.idgesg.net/images/idge/imported/imageapi/2021/12/28/13/macalope-2021-100915055-orig.jpg?quality=50&amp;strip=all&amp;auto=webp&amp;quality=85,70\" alt=\"Macalope\" width=\"1500\" height=\"1000\" /></figure><p>IDG</p></div>\n\n\n\n\n<p>Apple can’t get the parts to be cheaper until a lot of them get made and the process gets more efficient. The good news, the Vision Pro seems to be off to a strong start.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/2214079/vision-pro-preorder-weekend-sales-180000-units-report.html\">“Apple reportedly sold nearly 200,000 ‘very niche’ Vision Pro headsets”</a></p>\n\n\n\n<p>Those aren’t iPhone numbers but the iPhone didn’t cost $3,500.</p>\n\n\n\n<p>So, it will probably take longer for Apple to get the price down on the Vision Pro or come out with just a Vision for the Rest of Us. But it’ll happen. And there’s a reason they say patience is a virtue.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"28f3c2a7fd34189d3d8a07b61a09a71ae560f6d64c8f36d3005247fe3b0615ea","category":"Apple"}