{"title":"Prevalence, severity and impacts of breathlessness in Indian adults: An exploratory, nationally representative, cross-sectional online survey","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002655","date":1714658400000,"content":"<p>by Slavica Kochovska, Rajam Iyer, Sungwon Chang, Diana Ferreira, Vanessa N. Brunelli, Irina Kinchin, Danny J. Eckert, Joseph Clark, Jacob Sandberg, Magnus Ekström, David Currow, Sujeet Rajan</p>\r\n\r\nThere are no known estimates of the prevalence, severity and impacts from breathlessness in low- and middle-income countries. This study aimed to explore the prevalence, severity, self-attributed underlying conditions and impacts of <i>breathlessness limiting exertion</i> in community-dwelling adults in India. This exploratory, population-based online survey recruited a pre-planned sample of 3,000 adult respondents stratified by age, sex and rurality (quotas as per the 2011 Indian National Census). Measures included: demographics; <i>breathlessness limiting exertion</i> (modified Medical Research [mMRC] scale); health-related quality of life (EQ-5D-5L); and disability (World Health Organisation’s Disability Assessment Schedule 2.0 12-item questionnaire [WHODAS-12]). Respondents (n = 3,046) had a mean age of 38 years (SD 15); 57% were male, 59% lived in rural areas and 33% had completed 12<sup>th</sup> grade. <i>Breathlessness limiting exertion</i> (mMRC ≥1) was reported by 44%, mostly attributed to poor nutrition (28%), lung conditions excluding tuberculosis (17%) or anaemia (13%). Compared to those without breathlessness, a higher proportion of people with breathlessness (mMRC ≥1) reported problems across all EQ-5D-5L dimensions. Most people reporting breathlessness (81%) indicated the symptom had adversely affected their normal activities. Disability scores (WHODAS-12 total and individual domains) increased as breathlessness worsened. To conclude, in India, conservative estimates indicate 626 million people live with breathlessness of whom 52 million people live with severe breathlessness. The symptom is associated with poorer health-related quality of life and marked disability, including reduced ability to perform daily activities.","author":"Slavica Kochovska","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"28f7a9bf9d4a0d8dd86e7401bd502d10965421cb7978a97bf96eb4a8298bc2b8","category":"Environment"}