{"title":"A family affair: Linda Jacobsson on tackling some of cycling's toughest climbs with her baby in tow","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-family-adventure-linda-jacobssen","date":1692786976000,"content":"\n      <p>The Stelvio Pass, Passo Giau, Col du Joly, Mont Ventoux, Col d'Izoard, Passo Stalle, and Furkelpass – these are all mountain passes that thousands of cyclists dream of conquering in their lifetime. For most, only a few will be checked off their list. Yet, at less than a year old, Julia Jacobsson has already conquered these iconic climbs. Her parents have cycled over 6,000 kilometres and ascended 10,000 metres in elevation over the past six months, with Julia in tow in a specially designed trolley attached to their bikes.</p>\n<div></div>\n<p><span>“We spent five weeks in Gran Canaria in February. Then we went back home to pack the car in March, where we then went to Croatia, Italy, mostly in the Dolomites and northern Italy, Switzerland and now France,” Linda Jacobsson, Julia’s mother, told </span><i><span>Rouleur </span></i><span>from the Annecy Tourist Centre near the end of her trip. </span></p>\n<p><span>Linda and her partner Marcus Svensson are both from Sweden, and therefore, fortunate enough to benefit from the country’s generous childcare policy that grants fathers the same opportunity as mothers to take a full year off work to spend with their child. Seizing this chance, they decided to embark on a family adventure during the latter half of the year. “We won’t be able to do an adventure like this when she starts kindergarten, so we tried to make the most of it now. And now with this set-up with the trolley, it works pretty well and we have managed to integrate her into our lifestyle,” she explained. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/rouleur-performance/getting-more-out-of-maternity\"><strong><em>Read more: Getting more out of maternity: How Joss Lowden trained through pregnancy</em></strong></a></p>\n<p>Linda herself grew up in a family that embraced the cycling lifestyle. “We were 100% a cycling family,” she fondly recalled. At the age of 15, Linda started to race, and so did her brother. A true family affair, the club they joined was also the one their dad would help coach, and Linda stayed at the club until she was 20. Meeting her now husband Marcus through cycling, they spent their time travelling around on their bikes and entering races before they began their family. Linda noted that she wasn’t so much a competitive cyclist before having Julia, more of a “serious amateur cyclist”.</p>\n<p><span>Given their shared passion for cycling and travel, the decision to have a child was a carefully considered one. Once Julia reached the age of six months and could sit up on her own, Linda and Marcus deemed it the right time to venture out with her in the trolley.</span></p>\n<p><span><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Foto_2023-07-09_08_06_38.jpg?v=1692200898\" /></span><span>“We began with one hour to one and a half hour rides and slowly built up. The first few rides you’re not so comfortable with the traffic and how to attach the trolley and lean your bike, but after a few rides, you just get better and better. We always ride together too, so we feel pretty safe. We haven’t had any close calls and the traffic has been really respectful, plus the parent who doesn’t have the trolley will always go behind. </span></p>\n<p><span>“When we go up the mountains, people are usually there as tourists, so they are focusing on the drive. I wouldn’t go with the trailer on a busy road or in morning traffic because everyone will be going to work and will be stressed. But up in the mountains, nobody is stressed,” Linda said. </span></p>\n<p>Climbing such legendary climbs is no easy feat – especially six months postpartum and pulling a trolley with a baby. However, Linda continued to cycle throughout her pregnancy and has years of bike endurance in her legs, with her body used to the long hours on the bike. Back on the bike after having Julia, Linda said she focused mainly on easy rides as she was breastfeeding and didn’t want her cycling to impact that. Building up her time on the bike slowly was the key to her return to cycling up such big mountains. She also placed no pressure or stress on herself to be the same cyclist she was pre-baby – a mentality she took with her on the climbs with the trolley.</p>\n<p>“It’s just a slower pace,” she said. “It’s just you need the whole day to go for a ride. For instance, if you were to go by yourself, we’d then double whatever time that took if we were going out with the trolley. You know you’ll need to take breaks because something has happened, so allowing for the extra time means having no stress if you are planning a big day out.”</p>\n<p>Planning has been crucial during their six-month adventure away from home. Linda acknowledged that her mind could never relax. It was always vigilant, as someone needed to watch over Julia the whole time when on the bike. Even after rides, Linda explained that she no longer has the luxury of spending 30 minutes checking Strava. Julia is her top priority, which is why meticulous planning ahead of time was essential. Yet, this small task is a minor trade-off for her significant passion. </p>\n<p><span><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/57C8A016-8056-4148-99BF-FBCBB9F813CF.jpg?v=1692200825\" />“I think you have to think about what really matters to you,” Linda said. “For me, it’s my family and my passion for cycling. That’s the two things I have energy for. So we live very simply. We don’t plan to have other things that distract us or take time away from this.” </span></p>\n<p>Linda is undoubtedly demonstrating to new mothers that embarking on adventures – big or small – is achievable and fulfilling. Expressing a desire to do something is one thing, but challenging societal perceptions is another challenge. After having a baby, mothers often face higher expectations than fathers. Linda observed that it's not questioned when a man wants to pursue his hobby or sport. But when a mother expresses the same desire, she's bombarded with queries like “How will you balance it?” and “What about the baby?”. Linda emphasises that parenting is a shared and equal responsibility and that mothers shouldn't have to lose what they enjoy doing when they become a parent.</p>\n<p>Refusing to relinquish something she's cherished her entire life, Linda displayed bravery by defying societal norms. She said to herself and her husband, “I want to do this. I want to continue cycling. It's not just the father who gets to continue whatever he likes.”</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"28fd1ed92f68b4b16b1b445b84c77a44ec601b4fae4864ee0e1ca8c6739922bd","category":"Cycling"}