{"title":"Challenges Disclosure of Environmental Accounting Performance and its Impact on Supply Chains and Sustainable Development of Companies - Experiences of Some Companies in the (GCC) Countries - 2024","link":"https://www.preprints.org/manuscript/202410.0800/v1","date":1728552719000,"content":"In response to the growing environmental concerns and sustainability imperatives in the (GCC) and the world in general, companies are increasingly being urged to integrate environmental accountability into their core strategies and operations by accounting for environmental performance in their financial statements and the impact on supply chains and sustainable development. The problem of the study is to identify the impact of environmental accounting disclosure challenges on supply chains and sustainable development in companies. By taking the experiments of 20 companies and representatives of the study community interested in the topic, and using the heuristic research approach through the questionnaire tool and a set of key variables, including the adoption of disclosure on environmental accounting performance (DEAP), supply chain sustainability performance(SP), Sustainable Development Index(SD), and using the (PLS) program, in the statistical analysis, the study reached the most important results: The study revealed a positive relationship between the disclosure of environmental accounting performance, improved supply chains and sustainable development in the companies represented by the study sample in the (GCC), where both financial performance and environmental performance contribute to achieving the Sustainable Development Goals and supply chains. Accordingly, the study recommends many recommendations, the most important of which are: the need for companies to be encouraged to disclose the performance of environmental accounting as a strategic necessity, promote more sustainable supply chain management, improve financial performance, and effectively contribute to achieving the Sustainable Development Goals, thereby enhancing sustainability within companies and across supply chains, the study also recommends the need to continue studies in this aspect, especially in the (GCC) and East Asian countries, to urge companies to disclose the performance of environmental accounting in their financial statements.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2904723941da3f6b82b3473851504f34fa4771bb1526a85a8a0f1d7691dedd21","category":"Interdisciplinary"}