{"title":"Canvas","link":"https://neizod.dev/2022/11/09/canvas.html","date":1668008024000,"content":"<p>สองสามปีมานี้เล่นบอร์ดเกมน้อยลงจนแทบจะเป็นศูนย์ ส่วนหนึ่งก็น่าจะเป็นเพราะแกงค์ที่เคยเล่นประจำวงแตกไปแล้ว (โควิด ย้ายประเทศ แต่งงาน ฯลฯ) แต่หลักๆ เลยคงเป็นเพราะไม่มีเวลามากกว่า พอเป็นแบบนี้เลยทำให้ไม่ได้สะสมเกมเพิ่มด้วย … จนกระทั่งเดินเล่นใน B2S แบบไม่ได้คิดอะไร ก็พลันสะดุดตากับเจ้าสิ่งนี้</p>\n\n<blockquote>\n  <p><img src=\"/images/game/canvas/box.jpg\" alt /></p>\n\n  <p>กล่องบอร์ดเกม Canvas</p>\n</blockquote>\n\n<p>คือมองเผินๆ นี่อาจไม่รู้เลยว่าเป็นบอร์ดเกม<sup><a href=\"#fn:1\">1</a></sup> เพราะมันเลียนแบบภาพวาดบนกรอบผ้าใบได้เหมือนมาก –โอเคว่าอาจจะไม่เหมือนซะทีเดียวเพราะไม่ได้ใช้ผ้าใบจริงๆ– แต่ก็คือที่สันกล่องด้านต่างๆ ก็เป็นการลงสีต่อเนื่องมาจากหน้ากล่องเหมือนการวาดภาพบนกรอบผ้าใบจริงๆ เลย จนกว่าจะพลิกไปดูหลังกล่องนั่นแหละ ถึงจะเห็นตัวหนังสือคำอธิบายว่าเป็นบอร์ดเกม</p>\n\n<p>เรียกได้ว่าถ้าใครชอบศิลปะแนวนี้ แค่เอามาประดับผนังบ้านประหนึ่งว่าเป็นภาพวาดผืนผ้าใบก็สวยแล้ว</p>\n\n<p>แต่ตัวเกมก็ยังมีความเป็นศิลปะอย่างเต็มเปี่ยมอีกด้วย เพราะผู้เล่นจะได้รับบทเป็นศิลปินที่ต้องการสร้างสรรค์ผลงานชิ้นเอก โดยคัดสรรองค์ประกอบสามอย่างที่ไม่ซ้ำใครมา “วาดภาพ” ของตน ซึ่งจะเลือกวาดตามใจตนเองแบบที่เห็นว่างดงาม หรือจะแคร์กับทัศนคติของนักวิจารณ์และวาดเพื่อโบว์แดงก็ย่อมได้</p>\n\n<p>โดยส่วนกลไกของการวาดภาพนี้ก็ทำออกมาได้เข้าถึงง่ายมากๆ โดยเฉพาะกับคนที่วาดภาพไม่เก่งอย่างเรา เพราะเกมไม่ได้ให้เราวาดภาพเองจริงๆ แต่ให้การ์ดพลาสติกใสที่มีภาพองค์ประกอบต่างๆ มาเลย เรามีหน้าที่แค่จับการ์ดเหล่านั้นมาซ้อนกันเพื่อสร้างเป็นภาพวาดตามต้องการก็เรียบร้อย</p>\n\n<p>ส่วนตัวจุดที่เล่นแล้วแอบรู้สึกขัดใจ คงจะเป็นระบบคิดคะแนนที่ให้คะแนนก้าวกระโดดไปหน่อย จนเหมือนว่าถ้าเล่นพลาดแต้มตามนี่ก็จะไม่มีวันพลิกเกมได้เลย (หรือเพราะว่าตั้งแต่ซื้อมานี่มีโอกาสได้เล่นกับ <a href=\"//twitter.com/srakrn\">@srakrn</a> แค่สองคน แต่เกมเขียนไว้ว่าเล่นได้ถึงห้าคน เลยยังดึงความสนุกของเกมออกมาได้ไม่เต็มที่กันนะ?)</p>\n\n<blockquote>\n  <p><img src=\"/images/game/canvas/paintings.jpg\" alt /></p>\n\n  <p>ภาพวาดบางส่วนจากจิตรกรเอก @srakrn</p>\n</blockquote>\n\n<p>แต่เราว่าสำหรับคนรักศิลปะแล้ว ไม่ต้องเล่นมันเป็นเกมตามกฎที่เขียนไว้ก็ได้ แค่จับการ์ดพวกนี้มาเรียงซ้อนกันก็น่าจะสนุกแล้ว (และถ้าเป็นนักวาดก็อาจได้ไอเดียใหม่ๆ ไว้ประยุกต์ใช้กับงานจริงได้อีกด้วย)</p>\n\n<div>\n  <ol>\n    <li>\n      <p>ตอนอยู่ในร้านค้าก็รู้แหละเพราะอยู่ในโซนบอร์ดเกม แถมยังมีพลาสติกห่อพร้อมแปะป้ายชื่อเกมหรา <a href=\"#fnref:1\">↩</a></p>\n    </li>\n  </ol>\n</div>","author":"","siteTitle":"neizod's speculation","siteHash":"939338c5557b1743f2c128736c6006e145dcabc81da9970f1c0dc8ae2feb0830","entryHash":"2906ba64cf402f1d4caeacb0024bd1f4baecabe0438a75d215679e41f53a790b","category":"Thai"}