{"title":"Review: Twelve South's 'ButterFly' is a Great Travel Charger","link":"https://www.macrumors.com/review/twelve-south-butterfly-travel-charger/","date":1702661522000,"content":"Earlier this month, Twelve South launched the <a href=\"https://www.twelvesouth.com/products/butterfly-2-in-1-magsafe-charger?_pos=1&amp;_sid=e1b3bb14a&amp;_ss=r&amp;sscid=c1k7_ikhz3&amp;source=shareasale\">ButterFly 2-in-1 MagSafe Charger</a>, and it may be the best multi-device travel charger that's come out to date. The \"ButterFly\" name comes from the shape, as it has two magnetic sides connected by a small strap in the middle.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/twelve-south-butterfly-2.jpg\" width=\"2474\" height=\"1390\" />\r<br />\nWhen folded up, the ButterFly is just two inches around and fits in a palm or a pocket, making it easy to transport. Unfolded, there's a 15W <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> charger on one side for the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, and Apple Watch charging puck on the other side. The Apple Watch charger supports fast charging for the Apple Watch Series 7 and later, allowing for quicker charging speeds.\r<br />\n\r<br />\n<div></div>\r<br />\nThe Apple Watch charger can be used flat or it can be popped out to support Nightstand mode and bands that can't charge in a flat orientation. The ‌MagSafe‌ side is a simple charging puck that connects to ‌MagSafe‌ iPhones and other devices like the ‌MagSafe‌ AirPods.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/twelve-south-butterfly-empty.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThere is a USB-C port on the ButterFly to power it, and Twelve South includes a braided black USB-C cable and 30W power adapter. There are swappable plugs so that you'll have the plug you need if you're traveling to another country. There's a standard plug for the U.S. and Canada, a two-prong plug for Europe, a three-prong plug for the UK, Ireland, and other countries, and a plug that works in Australia, New Zealand, and China. You can swap in the one you need and store the rest for trips.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/twelve-south-butterfly-size.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThe ButterFly is made from a silver aluminum material that matches well with Apple's devices, with the two halves of the charger connected by a vegan leatheresque strap. It's an attractive design, and the connection between the two pieces seems like it's secure enough to hold up over time.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/twelve-south-butterfly-dual-charging.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nTwelve South designed the ButterFly with some clever features, so it is able to work with StandBy on the ‌iPhone‌. It can fold over in both directions, so it can be used as a Nightstand for the Apple Watch with the ‌iPhone‌ half folded under, or it can prop an ‌iPhone‌ up in the proper orientation for StandBy mode by folding the Apple Watch half under.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/twelve-south-butterfly-standby.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nTechnically you're supposed to fold it flat when you're charging an ‌iPhone‌ and an Apple Watch at the same time, but I was able to put it in a triangle position to get StandBy mode working while the Apple Watch was also charging. I don't find StandBy mode that useful so I doubt I'll use it in that orientation when traveling, but it's an option.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/twelve-south-butterfly-standby-charging.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nIn charging tests, the ‌MagSafe‌ charger did indeed charge my <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> Max at 15W, and I got the same charging results that I see with Apple's own ‌MagSafe‌ charger. My close to dead <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 9</a> charged up to 84 percent in a little under an hour, which is what I expect from an Apple Watch fast charger.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/twelve-south-butterfly-apple-watch.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nIf you wear an Apple Watch to bed, you probably know that an Apple Watch fast charger is a must to get enough battery to make it through the day in short charging spurts, so I appreciate that Twelve South included fast charge capabilities.\r<br />\n\r<br />\nBoth the Apple Watch charging puck and the ‌MagSafe‌ charger can charge the ‌MagSafe‌ AirPods, which makes this 2-in-1 charger almost as versatile as a 3-in-1 model.\r<br />\n\r<br />\n<h2>Bottom Line</h2>\r<br />\nThis is the most compact travel charger I've tried, and I have no complaints, except for the price tag. $130 is expensive, but it is using two of Apple's proprietary technologies - Apple Watch fast charging and ‌MagSafe‌.\r<br />\n\r<br />\nOther than the cost, this is the perfect travel charger and if you're looking for a premium solution that folds down small and works well with the ‌iPhone‌, AirPods, and Apple Watch, the ButterFly is worth checking out.\r<br />\n\r<br />\n<h2>How to Buy</h2>\r<br />\nThe ButterFly charger from Twelve South can be <a href=\"https://www.twelvesouth.com/products/butterfly-2-in-1-magsafe-charger?_pos=1&amp;_sid=e1b3bb14a&amp;_ss=r&amp;sscid=c1k7_ikhz3&amp;source=shareasale\">purchased from the Twelve South website</a> or <a href=\"https://www.apple.com/shop/product/HR2V2ZM/A/twelve-south-butterfly-2-in-1-usb-c-magsafe-charger\">from the Apple website</a> for $130.<div>Tag: <a href=\"https://www.macrumors.com/guide/twelve-south/\">Twelve South</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/twelve-south-butterfly-travel-charger/\">Review: Twelve South's 'ButterFly' is a Great Travel Charger</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-twelve-souths-butterfly-is-a-great-travel-charger.2413835/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"29159d7dbf55aba43169bb3dda78654b5ff6494234d0a1665d6a5663794f72b9","category":"Apple"}