{"title":"In the Drops: New Giro Synthe helmet, Albion Zoa jacket, Coros watch and Nick Knowles","link":"https://www.cyclist.co.uk/news/10257/giro-synthe-helmet","date":1637074877000,"content":"<span>\n      <span><a href=\"/authors/joe-robinson\">Joe Robinson</a></span>\n  </span><div>  \n  <div>      <div><span>19 Nov 2021</span></div>    </div></div><p>\nSome lovely stuff to use on and off the bike in our weekly gear round-up</p>\n<div>\n      <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/article_main_image/public/2021/11/albion-zoa-2.jpg?itok=Esp3LUMX\" />  </div>\n<div>\n      <p> TGIF, am I right? Stick on Gogglebox, tuck in to that fish and chips, pour that cold glass of Sav and slip into your comfy PJs, doctor's orders.</p>\n<p>This week's <em>In the Drops</em> is brought to you by Joe Robinson, digital editor at <em>Cyclist</em>. Lover of 23mm clincher tyres, ball-playing Italian centre halves and tired jokes about getting a nose bleed if I go north of the Watford Gap.</p>\n<p>It's been a somber week for me as personal friend Nick Knowles was given the boot from DIY SOS after 22 years due to breaking the BBC's broadcasting rules having appeared as a builder in a Shreddies advert earlier this year. I say personal friend, I was on the quiz show <em>Perfection</em> in 2012 which he hosted and he called me 'clever for an 18-year-old'. Sad to see the mighty fall though, isn't it.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/reviews/9947/shimano-dura-ace-r9200-and-ultegra-r8100-shimano-finally-goes-12-speed\">Shimano Dura-Ace R9200 and Ultegra R8100: Shimano finally goes 12-speed</a></div>      <div><a href=\"/buying-guides/1671/buyers-guide-to-road-bike-groupsets\">Buyer's guide to road bike groupsets </a></div>      <div><a href=\"/shimano/1391/shimano-dura-ace-9100-groupset-review\">Shimano Dura-Ace 9100 groupset review</a></div>      <div><a href=\"/buying-guides/677/gifts-for-cyclists\">Best gifts for cyclists: presents for the cyclist in your life</a></div>    </div></div><p>\nMoving on, this week at <em>Cyclist</em> has been dominated by winter. We've been busy updating some of our expert guides to keep you riding this winter.</p>\n<p>There's advice on <a href=\"/news/8998/how-to-keep-your-feet-warm-while-cycling-in-winter\">how to keep your toes warm</a>, a succinct guide to <a href=\"/in-depth/3783/cyclist-guide-to-wet-weather-riding\">wet weather riding</a>, and an in-depth tutorial on <a href=\"/buying-guides/561/how-to-prepare-your-bike-for-winter-cycling\">preparing your bike for the winter months</a>. We've also put together a <a href=\"/in-depth/1803/giro-ditalia-watch-live-stages-route-riders-teams-start-list/page/0/1\">complete guide to the 2022 Giro d'Italia</a> which should be a whopper, not least thanks to their being 51,000m of vertical elevation.</p>\n<p>Robyn Davidson told us about <a href=\"/news/10266/rapha-gore-tex-jackets\" target=\"_blank\">Rapha's new Gore-Tex range</a>, Will Strickson revealed you can now race <a href=\"/news/10261/race-republic-virtual-everesting\">Floyd Landis up a virtual Mount Everest</a> and Emma Cole covered a pair of <a href=\"/news/10260/silca-titanium-3d-printed-cleats\">titanium cleats that cost £63</a>. All absurd in their own way.</p>\n<h2>Albion Zoa jacket</h2>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/classicu_2021-11-14_121455.792.jpg\" />  </div>\n</div>\n<p>The team at Deptford-based Albion are smart cookies. To avoid any legal dramas, they reached a patent agreement with both West Bromwich Albion and Brighton and Hove Albion regarding the use of the word 'Albion' in sportswear. Basically Albion gets all the outdoor cycling stuff but can never start a football club.</p>\n<p>Albion's smarts don't stop there, either. Enter the brand's latest Zoa insulated jacket.</p>\n<p>In Bob Mortimer's words 'a puffa puffa jacket', the insulated Zoa relies on fabrics provided by Pertex, the brains behind North Face's mountaineering range. The outer fabric uses 100% recycled material a DWR coating that's said to be fluorine free and sustainable.</p>\n<p>The inner material is apparently 55% recycled material and is designed in such a way to trap body heat for better insulation.</p>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/albion-zoa-1.jpg\" />  </div>\n</div>\n<p>The fit has been optimised for riding although this jacket looks just as good off the bike as it does on it – I think you'd agree looking at the above image, right?</p>\n<p>There are also lots of small details that we love too. Stuff like the tight, waterproof cuffs, concealed rear pocket which can double as a pillow and adjustable hood with eyelets for helmet straps.</p>\n<p>The Zoa Insulated jacket is available in sizes XS through to XXL, and it comes in orange, black, and black and orange and costs £185.</p>\n<ul>\n<li><a href=\"https://www.albioncycling.com/product/zoa-insulated-jacket-orange/\" target=\"_blank\"><strong>Buy the Albion Zoa insulated jacket from Albion (£185)</strong></a></li>\n</ul>\n<h2>Coros Vertix 2 smartwatch</h2>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/coros-watch-1.jpg\" />  </div>\n</div>\n<p>A watch that's as versatile as a St Bernard with opposable thumbs, I've been using the new Vertix 2 from Coros for all of my sporting needs recently and have been delighted with its performance so far.</p>\n<p>The in-built GPS systems have been flawless for both cycling and running – I’ve been lost not once – while the beefy 3.3mm colour screen means visibility isn't an issue for even the most hard of sight mole.</p>\n<p>You can also keep an eye on your heart, if your ticker so desires, with the electrocardiogram feature, and you can control your music via the watch – meaning you can skip through Little River Band and Gallagher and Lyle singles with great ease.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/reviews/9947/shimano-dura-ace-r9200-and-ultegra-r8100-shimano-finally-goes-12-speed\">Shimano Dura-Ace R9200 and Ultegra R8100: Shimano finally goes 12-speed</a></div>      <div><a href=\"/buying-guides/1671/buyers-guide-to-road-bike-groupsets\">Buyer's guide to road bike groupsets </a></div>      <div><a href=\"/shimano/1391/shimano-dura-ace-9100-groupset-review\">Shimano Dura-Ace 9100 groupset review</a></div>      <div><a href=\"/buying-guides/677/gifts-for-cyclists\">Best gifts for cyclists: presents for the cyclist in your life</a></div>    </div></div><p>\nAnother big bonus is the 60 day – yes, 60 day – battery life which I can vouch for. No worries of battery death while out riding here. Unless you've gone for a 61 day ride, that is.</p>\n<p>Cost is £599, the strap is silicon and orange and it can go up to 10 metres underwater. It can also tell the time.</p>\n<ul>\n<li><a href=\"https://www.sportsshoes.com/product/cor17/coros-vertix-2-gps-adventure-watch-~-aw21/\" target=\"_blank\"><strong>Buy the Coros Vertix 2 smartwatch from SportShoes for £599</strong></a></li>\n</ul>\n<h2>Restrap top tube bag</h2>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/restrap-toptube-1.jpg\" />  </div>\n</div>\n<p>For a long time, I used to think top tube bags were for squares. The sort of thing reserved for cyclo-tourers and those who use Quad Locks, not hip, trendy folk like me. I'm more about using CO2 canisters and keeping kefir yogurt in my handlebar bag.</p>\n<p>Then I got hold of Restrap's top tube bag last month and realised how much of an idiot I had been. It's so convenient having your phone, food and tools all within easy and accessible reach while on the move.</p>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/restrap-toptube-2.jpg\" />  </div>\n</div>\n<p>The bag is handmade in a Yorkshire workshop using waterproof textured nylon There's a sturdy YKK zip and the bag has enough space to house £4.56 of pick 'n' mix from the local cinema.</p>\n<p>The bag costs £31.99, only comes in black and is compatible with most bikes.</p>\n<ul>\n<li><strong><a href=\"https://www.chainreactioncycles.com/restrap-top-tube-bag/rp-prod165762\" target=\"_blank\">Buy the Restrap Top Tube bag from ChainReactionCycles (£31.99)</a></strong></li>\n</ul>\n<h2>Giro Synthe helmet</h2>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/giro_synthe_ii_group11.jpg\" />  </div>\n</div>\n<p>We've been fans of the Giro Synthe since it first appeared in 2014, blending light weight with comfort, good ventilation, aerodynamics and stylish looks (cf. this <a href=\"/reviews/4158/giro-synthe-mips-reflective-helmet-review\" target=\"_blank\">2018 Giro Synthe review</a>). No wonder you see them all over the place.</p>\n<p>In fact, so good has the Synthe been over the years that Giro is obviously struggling to find ways to improve it. This latest model – the Synthe Mips II – looks all but identical to the previous version, except the mesh panel in the side has disappeared.</p>\n<p>That panel was apparently there to aid aerodynamics, but it seems that removing it hasn't made any significant difference to the Synthe's wind-cheating attributes, but it has allowed for improved ventilation and helps to lose a bit of weight (don't get excited – the helmet has only dropped 5g, which is about the weight of a 20p piece).</p>\n<p>Importantly, losing the mesh panel makes the new Synthe look a bit more refined. Even more importantly, the Mips 'rotational management system' inside the helmet (the plastic liner that slips to help lessen the force of impacts) is now 'integrated', meaning it has been designed alongside the helmet to fit and function better, further helping with comfort.</p>\n<p>It's so comfy, you could wear it to bed.</p>\n<ul>\n<li><a href=\"https://www.wiggle.co.uk/giro-synthe-ii-helmet-mips\" target=\"_blank\"><strong>Get a Giro Synthe from Wiggle here (RRP £179.99)</strong></a></li>\n</ul>\n<h2>What we’re into this week: Bob Mortimer's book and the television</h2>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/screenshot_2021-11-16_at_14.48.50.png?itok=F-9DoMIQ\" />  </div>\n</div>\n<p>My better half Jade works as a literary agent so is always trying to get me to read books. I usually ignore her pleas – pointing out that she'd never return the favour and join me on a bike ride – but recently we reached a compromise by way of audiobooks.</p>\n<p>I have started with comedian Bob Mortimer's autobiography 'And Away'. I've always loved Mortimer’s work – <em>Shooting Stars</em>, <em>Big Night Out</em>, <a href=\"https://open.spotify.com/show/00U0NJ6FGep57SZQIJZ4Iy?si=28f80920c2024f20\" target=\"_blank\">the <em>Athletico Mince</em> podcast</a> and, most recently, <em>Gone Fishing</em> with Paul Whitehouse. I also feel like he'd be a great bloke to have a pint and a daft laugh with down the pub.</p>\n<p>His voice is soft and always on the verge of a little chuckle and the stories within often seem so ridiculous you are left to wonder if they really are true of whether Mortimer is exercising some artistic license.</p>\n<p>Not knowing whether they are true or not is part of the fun and listening along makes me feel like I'm reminiscing with an old friend. <a href=\"https://www.waterstones.com/book/and-away/bob-mortimer/9781398505292\" target=\"_blank\">You can get a copy from Waterstones here</a>.</p>\n<p>I also had a weekend off of football last Saturday which gave me the chance to debut at my local Parkrun in Swanley which is a brilliant event, very well organised and incredibly inclusive too.</p>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/stath-lets-flats.jpeg?itok=8PS4UAG0\" />  </div>\n</div>\n<p>Finally, I've been watching some good telly recently, both new and old.</p>\n<p>The latest series of <em>Succession</em> is, as you’d expect, phenomenal. We are watching a classic develop before our eyes. So is Series 11 of <em>Curb Your Enthusiasm</em>, Larry David’s semi-fictionalised sitcom.</p>\n<p>I've just started Series 1 of <em>Mad Men</em> and plan to keep going with that, and I polished off the first series of Channel 4 BAFTA-winning comedy, <em>Stath Lets Flats</em>, a show that genuinely made me laugh out loud.</p>\n<p>All of the above come with my highest recommendations. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/clothing\">Clothing</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"291939da49dc1d801e42fb1758f1480b74e36c0d72e7e69c04ff1dc6c8bd9137","category":"Cycling"}