{"title":"The Run Up – a unique insight into the Women’s WorldTour","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-run-up-a-unique-insight-into-the-women-s-worldtour","date":1619086153000,"content":"\n      <p><span>Ever wondered what goes into winning a professional bike race? We all see the victory celebrations of the rider who crosses the line first, but there is always a story behind that win, and a whole team who has helped along the way. </span></p>\n<p><span>The Run Up, a new web series featuring Team SD Worx, Trek Segafredo and Canyon-SRAM, is here to give a previously unseen view of the world’s best women’s cycling teams.</span></p>\n\n<p><span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide\"><strong><em>Related – The Women's WorldTour Racing Calendar</em></strong></a></span></p>\n<p><span>It has been widely discussed that women’s cycling needs more exposure and coverage. This will, in turn, lead to interest from the sponsors and investors that the sport needs in order to survive. We’re slowly becoming able to watch more women’s races, but we still know very little about the people behind the glasses and helmets that we watch on TV.</span></p>\n<p><span>The Run Up hopes to change this. By filming riders at the top of the Women’s WorldTour, the series will follow each team’s preparation for the biggest events on the calendar, starting with <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/liege-bastogne-liege-women-2021-preview\">Liege-Bastogne-Liege this weekend</a>. </span></p>\n<p><span>“As a sports fan myself I am always inspired and excited to see the character behind the athlete,” says Trek-Segafredo’s Lizzie Deignan. “I think it’s a really interesting idea to allow fans of women’s cycling behind the scenes to get to know the characters within our sport, there are so many diverse and interesting women in the peloton.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/5X7A8975_1024x1024.jpg?v=1619084189\" /></span></p>\n<p><span>We can expect to see a combination of raw footage and rider interviews, from the high hopes before a big event, to the tense moments in the team bus if targets were not reached. With a look into team meetings, we’ll be able to see if a team executed their plan A, or if they had to ditch the plan entirely once the race got underway.</span></p>\n<p><span>The series aims to promote passion among fans by showing the emotions of riders, but also those of the team staff. As Trek Segafredo rider Lizzie Diegnan points out, both Giorgia Bronzini and Ina-Yoko Teutenberg work as directeur sportifs at different races for her team. This means the team’s tactics will differ depending on the DS on the day, one of the small complexities of cycling that will be explored in The Run Up.</span></p>\n<p><span>Deignan also explains that riders like herself – who win or are on the podium regularly – tend to perform most of the media duties for the team, be it in post-race interviews or leading up to a big event. The Run Up will give a voice to riders who we don’t always see finishing at the front of races, but who are crucial to the victories of their team leaders. Domestiques often have a unique tale to tell about their experience of each race.</span></p>\n<p><span>The blueprint of shows like The Run Up has been tested and well-received in projects such as Netflix’s ‘Formula 1: Drive to Survive’, where fans were given an exclusive look inside Formula 1. Canyon SRAM rider, Tiffany Cromwell, explains that the Netflix documentary has opened up untapped markets for Formula 1 and she is optimistic that ‘The Run Up’ may do the same for women's cycling.</span></p>\n<div></div>\n<p><span>‘Drive to Survive’ has made F1 more accessible, it’s a sport that might otherwise be complicated and exclusive. Cycling also has many unique intricacies and The Run Up hopes to help a wider audience understand these and grow fan engagement by doing so. “It's an opportunity for the world to gain a greater insight into what goes on behind the scenes at the highest level, to prepare for the world's biggest and toughest races and the rollercoaster of emotions that comes with it,” explains Cromwell. </span></p>\n<p><span>“It's an exciting new project that I'm confident will help widen the audience of women's cycling and hopefully bring more people into the sport and inspire people along the way,” she says.</span></p>\n<p><span>Although coverage of women’s cycling has improved in recent years, broadcasts of races are often inconsistent, making it difficult for fans to follow a clear narrative. In The Run Up we will be able to see a cohesive flow of races and understand the progress of the teams as they move through the season. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/5X7A9128_1024x1024.jpg?v=1619084215\" /></span></p>\n<p><span>Admittedly, it’s unusual to see rival teams unite and be part of the same project, but SRAM is the link between the three WorldTour outfits, sponsoring each of them. Since the inception of Canyon-SRAM, the company has had the aim of growing women’s cycling and inspiring the next generation, The Run Up is an important step towards this. Despite being on different teams, all riders share the same goal: to increase the exposure of their sport. </span></p>\n<p><span>SD Worx’s Ashleigh Moolman Pasio explains that while it has been frustrating for her to witness the inequalities between men’s and women’s cycling, being proactive is the best use of her energy. Through The Run Up, she hopes to lead by example and show that change is possible by thinking differently and showcasing the unique aspects of women’s cycling through human stories.</span></p>\n<p><span>N</span>arrated by cycling journalist and commentator José Been, the first episode of The Run Up is set to cover the lead up to Liège-Bastone-Liège and will premiere on Saturday the 24th April on <a href=\"https://www.therunupseries.com/\">The Run Up website</a> as well as The Run Up's <a href=\"https://www.youtube.com/channel/UCrTDni31No8ae_ZsBIJ4AZw\">YouTube channel</a>.</p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"291bf42237035d58a8f6d1d321eecb7f5ef0efabe9d97fdecf3110a3e7152cc1","category":"Cycling"}