{"title":"Google Chrome Address Bar Gains Improved Typo Correction and Autocompletion","link":"https://www.macrumors.com/2023/10/18/chrome-address-bar-improvements/","date":1697662265000,"content":"Google today <a href=\"https://blog.google/products/chrome/chrome-address-bar-updates/\">shared some information</a> on updates that it is making to the address bar (or search bar) on mobile devices and the web, with these updates aimed at making it easier to find the website that you're looking for.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/06/Chrome-Feature-22.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nWhen you make a typo when putting in a URL, Chrome can detect the typo and show you suggestions of the site you might actually want to visit based on your previously visited websites. Chrome is also smarter at autocompleting URLs, filling in suggestions based on sites you've visited in the past.\r<br />\n\r<br />\nIf, for example, you have visited https://www.google.com/travel/flights in the past, just typing in \"flights\" will see Google bringing that website up as a suggestion to visit. The typo correction features are available now on the desktop and on iOS, while the autocompletion update is limited to the desktop for now.\r<br />\n\r<br />\nChrome now allows you to search within your bookmark folders from the address bar, and it will suggest highly popular sites even if you've never visited them, two features available on both the desktop and mobile devices. Finally, Chrome on the desktop has an improved visual layout that offers faster response times and makes the address bar easier to read.\r<br />\n\r<br />\nMore information on the changes can be <a href=\"https://blog.google/products/chrome/chrome-address-bar-updates/\">found in Google's Chrome blog</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/chrome/\">Chrome</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/18/chrome-address-bar-improvements/\">Google Chrome Address Bar Gains Improved Typo Correction and Autocompletion</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/google-chrome-address-bar-gains-improved-typo-correction-and-autocompletion.2407993/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"291d1e41f8e9564e54e78deb282caa0e10cda41ede7a2044562e3b70d3c6f534","category":"Apple"}