{"title":"A eulogy for Lightning, the little port that could","link":"https://www.macworld.com/article/2057212/eulogy-for-lightning.html","date":1694082600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Dearly beloved, we are gathered here today to bid goodbye to a titan of technology, a revolutionary amongst rebels, a connoisseur of connections, taken from us too–well, perhaps not <em>too</em> soon. I speak, of course, of our friend and colleague, the Lightning cable.</p>\n\n\n\n<p>There are those who will say that such a send-off is premature, but the writing is on the wall. When Apple unveils its latest iPhone next week, the expectation is that the venerable Lightning port will be supplanted by one of its eternal rivals, USB-C.</p>\n\n\n\n<p>But let us not simply mourn what is being taken from us: let us instead remember and celebrate what Lightning did with its life, the joy and happiness it brought to an entire ecosystem. Its presence will not soon be forgotten.</p>\n\n\n\n<h2>A bolt from the blue</h2>\n\n\n\n<p><a href=\"https://www.macworld.com/article/219180/what-apples-new-lightning-connector-means-for-you.html\">Lightning was born on September 12, 2021</a>, ushered into this world by Apple senior vice president Phil Schiller. Schiller touted the benefits it would bring over its predecessor, the 30-pin dock connector that had originated on 2003’s third-generation iPod.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/30-pin-lightning-usbc.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"30pin lightning usbc\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/30-pin-lightning-usbc.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/09/30-pin-lightning-usbc.jpg?resize=300%2C104&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/30-pin-lightning-usbc.jpg?resize=768%2C265&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/30-pin-lightning-usbc.jpg?resize=1200%2C415&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/30-pin-lightning-usbc.jpg?resize=1536%2C531&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/09/30-pin-lightning-usbc.jpg?resize=2048%2C707&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"415\" /><figcaption><p>iPhones started with a 30-pin connector (left), which was replaced by Lightning (middle), which will be replaced by USB-C (right).</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>“A modern connector for the next decade” was how Schiller presciently the new connector. (Had it been me, I perhaps would have gone for “a more elegant connector for a more civilized age”, but I digress.)</p>\n\n\n\n<p>Lightning boasted an all-digital design, improved durability, and an adaptive interface that let it handle whatever function was required: power, video, audio, data, and so on. Most importantly for Apple, it was 80 percent smaller than the dock connector, freeing up valuable space inside the iPhone. Most important for <em>users</em>, on the other hand, was probably the reversibility that meant there was no wrong way to connect it to the iPhone. (Well, mostly.)</p>\n\n\n\n<p>All in all, Lightning boasted an impressive resume with which to introduce itself to the world, and it quickly took Apple’s lineup by storm, spreading from the iPhone 5 to not only the iPod and iPad but the Mac and accessories as well. It seemed Lightning was well on its way to world domination.</p>\n\n\n\n<h2>Charging point</h2>\n\n\n\n<p>Of course, Lightning’s early days weren’t all smooth sailing. Many consumers protested its sudden appearance on the scene, clinging tightly to their many dock-connector cables and accessories. It would take some years for Lightning to win them all over, and in many cases, it was a war of attrition.</p>\n\n\n\n<p>And yet, despite its eventual success, Lightning never quite rose to the same prominence as its storied predecessor. Yes, there were third-party accessories that with a built-in connector—portable batteries and speaker docks, no end of adapters. But the world into which Lightning was born was very different from that of the dock connector.</p>\n\n\n\n<p>For one thing, the evolution of technologies like Bluetooth and Wi-Fi had already begun to supplant a lot of the uses for which the cable had once been considered king. Apple offered features like the ability to sync to one’s Mac via Wi-Fi or send audio via AirPlay, and the convenience of those features—not having to hunt up a cable when you needed one, or fiddle with connectors—was hard to beat.</p>\n\n\n\n<p>Moreover, the companies that had been so bullish to jump on the 30-pin dock connector integration in the heyday of the iPod and early days of the iPhone seemed to be rethinking things in the Lightning era. After all, why design a product to only work with one company’s devices if you could instead use a wireless standard that would work with <em>any</em> mobile device?</p>\n\n\n\n<p>Even Apple’s relationship with Lightning wasn’t entirely monogamous, as in recent years it’s introduced multiple ways to power up one’s iPhone without having to resort to a cable that you plug in: first Qi charging, and then with its own improvement on the standard, MagSafe.</p>\n\n\n\n<p>Lightning might have been a solid standby, but it was hardly the undisputed champion.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/ios-control-center-wifi-bluetooth.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS Control Center WiFi Bluetooth\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/ios-control-center-wifi-bluetooth.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/09/ios-control-center-wifi-bluetooth.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/ios-control-center-wifi-bluetooth.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/ios-control-center-wifi-bluetooth.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/ios-control-center-wifi-bluetooth.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/09/ios-control-center-wifi-bluetooth.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/09/ios-control-center-wifi-bluetooth.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/09/ios-control-center-wifi-bluetooth.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>Wireless technologies like Wi-Fi and Bluetooth have reduced the need for a cable.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>A long, slow decline</h2>\n\n\n\n<p>And so we come to both praise Lighting <em>and</em> bury it. But for those who retain some fondness for the connector, never fear: its demise will not be sudden and swift, but long and drawn out. I fully expect to be finding Lightning cables in my drawers for the next decade.</p>\n\n\n\n<p>The introduction of a USB-C iPhone is only one step in the end of Lightning’s journey–albeit a major one. The port has already been supplanted across the iPad lineup and even on the Apple TV’s Siri Remote, but it survives in <a href=\"https://www.macworld.com/article/2025699/usb-c-iphone-15-lightning-airpods-magic-mouse-trackpad-pencil.html\">Mac accessories, the AirPods, and the first-gen Apple Pencil</a>, at least for the time being.</p>\n\n\n\n<p>So let’s raise our glasses to Lighting and all it accomplished in the more than a decade it was on the scene. It did its job and it did it well, and now it goes to a well-deserved rest. In lieu of flowers, please send dongles.</p>\n\nAccessories, iPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"29267386b91e55cf4da7aa7cbbaa5e0e961e730c711eaca2b272a40406b8e472","category":"Apple"}