{"title":"The global impact of COVID-19 on tuberculosis: A thematic scoping review, 2020–2023","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003043","date":1720015200000,"content":"<p>by Michael H. Marco, Sevim Ahmedov, Kenneth G. Castro</p>\r\nBackground <p>This thematic scoping review of publications sought to understand the global impact of COVID-19 on tuberculosis (TB), interpret the scope of resonating themes, and offer policy recommendations to stimulate TB recovery and future pandemic preparedness.</p> Data sources <p>Publications were captured from three search engines, PubMed, EBSCO, and Google Scholar, and applicable websites written in English from January 1, 2020, to April 30, 2023.</p> Study selection <p>Our scoping review was limited to publications detailing the impact of COVID-19 on TB. Original research, reviews, letters, and editorials describing the deleterious and harmful––yet sometimes positive––impact of COVID-19 (sole exposure) on TB (sole outcome) were included. The objective was to methodically categorize the impacts into themes through a comprehensive review of selected studies to provide significant health policy guidance.</p> Data extraction <p>Two authors independently screened citations and full texts, while the third arbitrated when consensus was not met. All three performed data extraction.</p> Data synthesis/Results <p>Of 1,755 screened publications, 176 (10%) covering 39 countries over 41 months met the inclusion criteria. By independently using a data extraction instrument, the three authors identified ten principal themes from each publication. These themes were later finalized through a consensus decision. The themes encompassed TB’s care cascade, patient-centered care, psychosocial issues, and health services: 1) case-finding and notification (n = 45; 26%); 2) diagnosis and laboratory systems (n = 19; 10.7%) 3) prevention, treatment, and care (n = 22; 12.2%); 4) telemedicine/telehealth (n = 12; 6.8%); 5) social determinants of health (n = 14; 8%); 6) airborne infection prevention and control (n = 8; 4.6%); 7) health system strengthening (n = 22; 13%); 8) mental health (n = 13; 7.4%); 9) stigma (n = 11; 6.3%); and 10) health education (n = 10; 5.7%).</p> Limitations <p>Heterogeneity of publications within themes.</p> Conclusions <p>We identified ten globally generalizable themes of COVID-19’s impact on TB. The impact and lessons learned from the themed analysis propelled us to draft public health policy recommendations to direct evidence-informed guidance that strengthens comprehensive global responses, recovery for TB, and future airborne pandemic preparedness.</p>","author":"Michael H. Marco","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"2928512a9e4d809e1ffa7736e51c8da2535ce9c1f5e9785c745b94e367bb6296","category":"Environment"}