{"title":"BMC Teammachine SLR1 Four review","link":"https://www.cyclist.co.uk/reviews/9417/bmc-teammachine-slr1-four-review","date":1616684009000,"content":"<span>\n      <span><a href=\"/authors/joe-robinson\">Joe Robinson</a></span>\n  </span><div>  \n  <div>      <div><span>Friday, March 26, 2021 - 12:29</span></div>    </div></div><p>\nThe Teammachine SLR1 Four is a bike that's almost too good to be true</p>\n<div>  \n  <div>      <div><div>  \n  <div>\n    <div>\n      <div></div>\n    </div>\n  </div>\n      <span>\n      <strong>4.5</strong>\n      / <span>5</span>\n    </span>\n  \n</div>\n</div>    </div></div><div>  \n  <div>      <div>£6,500</div>    </div></div><div>\n      <p> The BMC Teammachine is an exceptional bike. Since its launch in 2011, there have been four iterations, all of which have been tested by a member of the <em>Cyclist</em> team, and all of which have been adorned with the highest praise.</p>\n<p>The first version of the bike, launched in 2011 and guided to Tour de France glory by Cadel Evans the same year, drew a line in the sand for how modern race bikes would perform going forward.</p>\n<p>It was light, stiff, it had dropped seatstays. Later versions pushed boundaries too, with the 2017 Teammachine being the first WorldTour bike to embrace disc brakes, remain aggressive and weigh in at that magical 6.8kg mark. And most recently, the <em>Cyclis</em>t team even declared the latest version of the Teammachine, launched in 2020, the <a href=\"/in-depth/9177/best-of-the-best-cyclist-s-favourite-all-round-race-bikes\" target=\"_blank\">best all-rounder you can currently buy on the market</a>.</p>\n<p><em>Cyclist</em> tech editor <a href=\"/in-depth/9177/best-of-the-best-cyclist-s-favourite-all-round-race-bikes\" target=\"_blank\">Sam Challis said that this most recent iteration of the Teammachine</a> was a bike that made him ‘feel like a better rider everywhere’ and that ‘by definition, all-rounders are an exercise in compromise, so for BMC to keep mixing ingredients into the Teammachine dish without spoiling its already delicious flavour gets ever more impressive with each update’. High praise, indeed.</p>\n<p></p><div><div>\n  <a href=\"/reviews/9413/bmc-teammachine-slr1-four-images#1\"><p><span>Image 2 of</span> 7</p><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/03/bmc-teammachine-slr1four-2.jpeg?itok=H--tmyKc\" /></a></div>\n<p><span>Image 2 of </span>7</p>\n</div><p></p>\n<p>The Teammachine SLR01 Four I have been testing recently is the exact same quality of frameset as the one we declared the best all-rounder just with a more considered, wallet-friendly spec.</p>\n<p><a href=\"https://www.tredz.co.uk/.BMC-Teammachine-SLR01-Four-2021-Road-Bike_233498.htm\" target=\"_blank\"><strong><em>Buy now from Tredz for £6,500</em></strong></a></p>\n<p>So I still get the new aero-focussed and faster kamm-tail tube shapes of the front and head tubes, the thinner and deeper fork, stiff yet light 820g frame, compact and racy geometry and dropped seatstays for comfort.</p>\n<p>But instead of Sram Red eTap AXS, there is Shimano Ultegra Di2. Instead of the DT Swiss PRC 1100 Dicut Mon Chasseral wheels, BMC’s own CRD-351 wheelset. And swap out BMC’s ICS carbon integrate cockpit for its semi-integrated ICS2 steam and RAB 02 handlebar alternative.</p>\n<p>For this trade-off, you cede 500g in weight, perhaps a few watts from the cockpit swap, the slightest drop in efficiency in gear shifting and a touch of stiffness from the different wheelset. But nothing to the extent an amateur rider would lose sleep over. And it’s not bad considering the SLR01 Four costs £6,500, a full £3,750 less than the top-spec.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/9435/cyclist-doorstep-rides-no1-digital-editor-joes-ride-around-kent\">Cyclist Doorstep Rides, No1: Digital editor Joe's ride around Kent</a></div>    </div></div><p>\nEspecially when, just as my colleague Sam experienced on the top-tier model, this Teammachine SLR01 Four is a bike that has blown me away.</p>\n<p>From the very first ride, I couldn’t believe how well-balanced this latest Teammachine is. I consider where I ride, Kent, to be the perfect place to test an all-rounder bike. While admittedly lacking in long Alpine climbs, we have every terrain you could imagine.</p>\n<p>Insidiously steep climbs, technical descents, exposed flat roads and even those power ascents that you can smash in the big ring on a good day. A day’s riding here can make or break a bike.</p>\n<p>The Teammachine SLR01 was able to conquer it all. Stiff and light on the steep stuff. Balanced and assured on the descents. Fast on the flats. Comfortable for the longer days.</p>\n<p>And let's not forget the fact that this bike actually comes with two matching bottle cages, both of which have been designed to complement the shape of the down tube for better aerodynamics. A touch of class, even if one does – slightly annoyingly – encroach on to downtube decal.</p>\n<p>Being picky, the only fault I could really find was in BMC’s in-house CRD-351 wheels. Not so much in that they did not perform well – at 1,714g they aren't overly heavy and also noticeably assured when cornering – but the fact that while they have a tubeless-ready rim, their internal rim depth of 17mm is quite narrow by today’s standards. It leaves you slightly impeded from enjoying the full benefits of running wider tubeless tyre systems at lower pressures.</p>\n<p></p><div><div>\n  <a href=\"/reviews/9413/bmc-teammachine-slr1-four-images#5\"><p><span>Image 6 of</span> 7</p><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/03/bmc-teammachine-slr1four-6.jpeg?itok=JTQTtyPC\" /></a></div>\n<p><span>Image 6 of </span>7</p>\n</div><p></p>\n<p>But besides that, there is nothing to complain about. Each time I rode this bike, my mind thought of AG2R-Citroen’s Greg van Avermaet or Qhubeka-Assos’s Fabio Aru who will be using a version of this frame to race Monuments and Grand Tours this year. There really will be no complaints when it comes to what they are racing on.</p>\n<h3>Conclusion</h3>\n<p>As far as mid-tier all-round race bikes go, I’ve tried and tested quite a few in my time at <em>Cyclist</em> and, in my honest opinion, in terms of sheer performance, the Teammachine SLR01 Four really has topped the lot. This is a bike that really does make you a better rider than you usually are.</p>\n<p>And yet, weirdly, while I think this bike is exceptional and made me faster in every way imaginable (the ultimate goal of any bike), there’s something that stops me from absolutely loving it.</p>\n<p><a href=\"https://www.tredz.co.uk/.BMC-Teammachine-SLR01-Four-2021-Road-Bike_233498.htm\" target=\"_blank\"><strong><em>Buy now from Tredz for £6,500</em></strong></a></p>\n<p>Why? Well, it’s like a modern-day car such as BMW’s new 3-Series Hybrid. They are so good, so advanced that they almost drive themselves. You cannot fault their performance in the slightest and you know it’s the pinnacle of engineering at that very moment. Yet this weird part of you pines for that old 03’ plate Saab 9-3 convertible that’s seen better days.</p>\n<p>Because while that shiny new Beemer will certainly turn heads on the motorway, it’s the Saab that’s going to leave you with that smug, self-righteous expression on your face.</p>\n<p>So yeah, you race crits at the weekend, take sportives seriously or even indulge in high-paced group rides with your mates, reach for the BMC Teammachine SLR01 Four in a heartbeat. No questions asked. But if like me you prefer to slowly plod to the nearest cafe just so you can stand next to your bike, then you may be left wanting something else.</p>\n<h3>Spec</h3>\n<table>\n<tbody>\n<tr>\n<td>Frame</td>\n<td>Teammachine SLR01</td>\n</tr>\n<tr>\n<td>Fork</td>\n<td>Teammachine SLR01</td>\n</tr>\n<tr>\n<td>Groupset</td>\n<td>Shimano Ultegra R8070 Di2</td>\n</tr>\n<tr>\n<td>Brakes</td>\n<td>Shimano Ultegra R8070 disc</td>\n</tr>\n<tr>\n<td>Chainset</td>\n<td>Shimani Ultegra 52-36</td>\n</tr>\n<tr>\n<td>Cassette</td>\n<td>Shimano Ultegra 11-30</td>\n</tr>\n<tr>\n<td>Bars</td>\n<td>BMC RAB 02 Carbon</td>\n</tr>\n<tr>\n<td>Stem</td>\n<td>BMC ICS2</td>\n</tr>\n<tr>\n<td>Seatpost</td>\n<td>Teammachinne SLR01</td>\n</tr>\n<tr>\n<td>Saddle</td>\n<td>Fizik Antares Verus Evo R5</td>\n</tr>\n<tr>\n<td>Wheels</td>\n<td>CRD-351 SL Carbon</td>\n</tr>\n<tr>\n<td>Tyres</td>\n<td>Vittoria Corsa, 25mm</td>\n</tr>\n<tr>\n<td>Weight</td>\n<td>7.2kg</td>\n</tr>\n<tr>\n<td>Contact</td>\n<td><a href=\"http://www.bmc-switzerland.com/\">www.bmc-switzerland.com</a></td>\n</tr>\n</tbody>\n</table>\n<p><a href=\"/cyclist-reviews-policy\" target=\"_blank\"><em>All reviews are fully independent and no payments have been made by companies featured in reviews</em></a> </p>\n  </div>\n<div>  \n  <div>      <div>\n<div>\n\n          &lt;&gt;<span><a href=\"/reviews/9413/bmc-teammachine-slr1-four-images\">BMC Teammachine SLR1 Four images</a></span>&lt;/&gt;\n      \n  \n  <div>\n\n    \n    \n    <div><span>\n      <span><a href=\"/reviews\">Reviews</a></span>\n  </span><div>  \n  <div>      <div><span>25 Mar 2021</span></div>    </div></div><div>\n        <div><ul><li><a href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.cyclist.co.uk%2Freviews%2F9413%2Fbmc-teammachine-slr1-four-images\">\r\n  <span>\r\n      \r\n          \r\n      \r\n  </span>\r\n  <span>facebook</span>\r\n</a>\r\n</li>\n<li><a href=\"http://twitter.com/home?status=BMC%20Teammachine%20SLR1%20Four%20images%20https%3A%2F%2Fwww.cyclist.co.uk%2Freviews%2F9413%2Fbmc-teammachine-slr1-four-images\">\r\n  <span>\r\n      \r\n      \r\n      \r\n  </span>\r\n  <span>twitter</span>\r\n</a>\r\n</li>\n<li><a href=\"https://plus.google.com/share?url=BMC%20Teammachine%20SLR1%20Four%20images%20https%3A%2F%2Fwww.cyclist.co.uk%2Freviews%2F9413%2Fbmc-teammachine-slr1-four-images\">\r\n  <span>\r\n      \r\n          \r\n            \r\n              \r\n              \r\n            \r\n          \r\n      \r\n  </span>\r\n  <span>google+</span>\r\n</a>\r\n</li>\n<li><a href=\"mailto:?subject=BMC%20Teammachine%20SLR1%20Four%20images&amp;body=https%3A%2F%2Fwww.cyclist.co.uk%2Freviews%2F9413%2Fbmc-teammachine-slr1-four-images\">\r\n  <span>\r\n      \r\n          \r\n        \r\n  </span>\r\n  <span>email</span>\r\n</a>\r\n</li>\n</ul></div>  </div>\n</div><div>  \n  <div>      <div><div>\n  <a href=\"/reviews/9413/bmc-teammachine-slr1-four-images#0\"><p><span>Image 1 of</span> 7</p><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/03/bmc-teammachine-slr1four-1.jpeg?itok=wlReASRE\" /></a></div>\n</div>    </div></div>  </div>\n\n  \n</div>\n</div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"292b2699f6be1172669a2febaa8d348b93878a2473c634ebf4006dc10ef15fb3","category":"Cycling"}