{"title":"Into the rivers and through the woods: Specialized’s e-mountain bike","link":"https://arstechnica.com/?p=1943379","date":1688122857000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/IMG_1199-800x600.jpeg\" alt=\"Image of a mountain bike leaned against a stone wall.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/IMG_1199.jpeg\">Enlarge</a> <span>/</span> Behold, the Turbo Levo. (credit: John Timmer)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>I consider myself a bit of a bicycle fanatic. I've ridden tens of thousands of miles, stripped bikes down to their frames and rebuilt them, and completed a 130-mile ride from New York City to the tip of Long Island. But I have intentionally cut myself off from one of the most exciting, rapidly developing parts of the cycling world. I've never ridden a mountain bike.</p>\n<p>This is partly because I know my weaknesses. I expected I'd like it, and being an inveterate gear hound, I would end up wanting to buy one. A lack of money in grad school followed by lack of space for two bikes in New York City meant that wasn't an option. So I stuck to the road and avoided even exposing myself to temptation.</p>\n<p>I now have a bit more money and a bit more space, and my resistance started to crack a bit when I <a href=\"https://arstechnica.com/cars/2023/01/doing-it-all-a-foldable-mountain-e-bike-with-extra-fat-tires/\">tested a dual-suspension frame bike</a> late last year. But that foldable, ultra-fat-tire frame didn't give me the confidence I needed to try trails that would challenge both the bike and my lack of skill. It was, however, enough to get me to say yes when Specialized offered some review time with its Levo series of e-mountain bikes. After hitting a few parks with the <a href=\"https://fave.co/42T1wY4\" target=\"_blank\">Turbo Levo Comp Alloy</a>, I'm here to report that I was right in avoiding trail riding for as long as I did.</p></div><p><a href=\"https://arstechnica.com/?p=1943379#p3\">Read 30 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1943379&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2932b546bfefd7a5e199df8031e0e4f9dfc9730292715512abef7432cee9cea9","category":"Tech"}