{"title":"Delving into the determinants of plant community patterns in Rivers — A case study of Hydrological Basin of Sebou (HBS)","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2651?af=R","date":1713419635000,"content":"<h2>Abstract</h2>\n<p>The critical role of macrophytes in aquatic environments cannot be overstated, but little attention has been paid to macrophytes in Moroccan rivers. This study aims to investigate the environmental factors that affect the presence and distribution of macrophytes in the Hydrological Basin of Sebou (HBS) in Morocco. The study focused on 39 hydrological stations, distributed across the five hydro-ecoregions of the basin. The results show that the number of aquatic species is limited and significantly lower than that of riparian species, which are more diverse. Analysis of similarity (ANOSIM) revealed that there is a significant difference in the riparian species communities between the various hydro-ecoregions (R = 0.1853, Bonferroni corrected α = 0.0022). However, when only aquatic species were considered, ANOSIM showed no significant difference (R = 0.05524, Bonferroni corrected α = 0.1453), and the results were confirmed by the PERMANOVA test. Furthermore, ANOSIM did not reveal a clear difference in the composition of aquatic species between stations with low and high nutrients (R = 0.01348, <i>p</i> = 0.4245). The Student's <i>t</i>-test also showed no significant difference in the variation of riparian and aquatic species numbers between the two groups (all species combined: t = 0.1639, <i>p</i> = 0.8723; riparian species: t = 0.4740, <i>p</i> = 0.6434; aquatic species: t = 0.9869, <i>p</i> = 0.3417).</p>\n<p>These findings highlight the need for further research into environmental factors limiting aquatic species diversity and nutrient thresholds affecting macrophyte abundance. Understanding these elements is crucial for addressing species distribution constraints and elucidating nutrient dynamics that influence macrophyte populations, enriching ecosystem management and conservation strategies.</p>","author":"Abdellah Maissour, \nSaad Benamar","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"2933495fca9df8b10edef19cd1075f00fbf635971063ee872284aeb0f0170ef4","category":"Environment"}