{"title":"Simon says: 1x road bikes are a solution in search of a problem","link":"https://www.bikeradar.com/features/opinion/1x-on-road-bikes/","date":1682694023000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Simon-says-1x-wont-go-mainstream-d0397a2.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Simon-says-1x-wont-go-mainstream-d0397a2.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Simon-says-1x-wont-go-mainstream-d0397a2.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Simon-says-1x-wont-go-mainstream-d0397a2.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Simon-says-1x-wont-go-mainstream-d0397a2.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Simon-says-1x-wont-go-mainstream-d0397a2.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Simon-says-1x-wont-go-mainstream-d0397a2.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Simon-says-1x-wont-go-mainstream-d0397a2.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Simon-says-1x-wont-go-mainstream-d0397a2.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Simon-says-1x-wont-go-mainstream-d0397a2.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"A Shimano Ultegra R8000 crankset with Dura-Ace Di2 R9200 front derailleur surrounded by love hearts\" title=\"Simon says 1x won't go mainstream\" />                                            <p>With several teams and riders using single-chainring setups during this year’s Spring Classics, 1x drivetrains for road bikes are back in the conversation again.</p>\n<p>While 1x setups do have their advantages in certain scenarios, and new hub gear tech is a potential game-changer, a 1x revolution on road bikes still feels a long way off.</p>\n<p>In my opinion, front derailleurs are just too good these days and, for the most part, what you gain from ditching them on a road bike doesn’t outweigh the drawbacks.</p>\n\n<h2>When does 1x on a road bike make sense?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> 1x aero chainrings are increasingly popular on time trial bikes.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>As spelled out in our <a href=\"https://www.bikeradar.com/advice/buyers-guides/1x-drivetrains/\">1x drivetrains explained</a> article, there are a number of advantages (and disadvantages) to single-chainring setups for road bikes.</p>\n<p>In scenarios where a wide range of gears isn’t needed, such as during relatively flat rides or races, then a 1x drivetrain can provide all the gears you need in a simpler package.</p>\n<p>1x drivetrains can also be more aerodynamic. According to UK-based experts AeroCoach, switching to its ARC 1x aero chainrings can save between “between 1 to 4 watts at 30mph / 48kph”, depending on the size of the front derailleur you’re removing.</p>\n<p>That’s a marginal gain, but one increasingly exploited on <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-your-best-ever-time-trial/\">time trial</a> and criterium bikes.</p>\n<p>Using a chain guard (which helps prevent the chain from dropping off the chainring) naturally compromises any aerodynamic gains somewhat.</p>\n<p>However, such setups can provide greater chain security compared to a 2x setup, which can be critical in races such as <a href=\"https://www.bikeradar.com/features/pro-bike/2023-paris-roubaix-tech-trends/\">Paris-Roubaix</a>.</p>\n<p>Wout van Aert, for example, used a 1x <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-12-speed-red-etap-axs-hrd-review/\">SRAM Red eTap AXS</a> drivetrain at both <a href=\"https://www.bikeradar.com/features/pro-bike/wout-van-aert-1x/\">Milan-San Remo</a> and Paris-Roubaix this year, likely for this specific reason.</p>\n<p>Depending on setup, a 1x drivetrain can also be lighter. Dedicated <a href=\"https://www.bikeradar.com/features/pro-bike/2022-hill-climb-bikes/\">hill climb bikes</a> almost always use 1x drivetrains, for example.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Hill climb bikes are often set up 1x because it can be lighter and there’s no need for two chainrings.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<h2>The disadvantages of 1x drivetrains on road bikes</h2>\n<p>It’s clear, then, that there are some advantages to 1x drivetrains on the road in certain scenarios. There are, however, some disadvantages too.</p>\n<p>Most obviously, ditching your front derailleur and one of your chainrings means significantly reducing the number and range of gears on your bike.</p>\n<p>It’s possible to compensate for this by using a wider-range cassette out back and carefully matching your chainring size to each ride. However, getting close to the range of a 2x setup comes with compromises.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The tighter cassettes used with 2x drivetrains offer greater scope for finding an optimum cadence.</span></figcaption><span> <i>Jack Evans / Our Media</i></span></div>\n<p>Firstly, wide-range cassettes (which are required if you want to maintain a similar gearing range to a 2x system) can be heavier than tighter ones.</p>\n<p>More problematically, though, they typically come with much larger jumps between gears and use smaller cogs at the bottom end to help you gain extra range with a smaller front chainring.</p>\n<p>This can be annoying because gradient changes on the road are typically more gradual than off-road, and large gaps between the gear ratios can leave you searching for an optimum gear and cadence in certain scenarios.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Wide-range cassettes for 1x drivetrains, such as this Campagnolo Ekar 9-42t, offer amazing gearing range but also come with compromises.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>The smaller cogs, such as the 10-tooth or 9-tooth versions seen on <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-force-axs-review/\">SRAM AXS</a> or <a href=\"https://www.bikeradar.com/reviews/components/groupsets/campagnolo-ekar-groupset-review/\">Campagnolo Ekar</a> cassettes, and chainrings are also marginally less efficient than larger ones (because the chain needs to articulate at tighter angles than with larger ones).</p>\n<p>Though SRAM and Shimano would argue it isn’t <a href=\"https://www.bikeradar.com/advice/workshop/cross-chaining/\">cross chaining</a> in the truest sense of the word, 1x drivetrains also force the chain into more extreme angles at the ends of the cassette compared to 2x drivetrains.</p>\n<p>Both of these factors can lead to increased frictional losses within the drivetrain, which in turn means slightly less of your effort reaches the tyres with a 1x drivetrain compared to a 2x drivetrain (all else being equal).</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The original 3T Strada’s 1x drivetrain may have been more aero, but it was likely less efficient too.</span></figcaption><span> <i>Matthew Allen / Immediate Media</i></span></div>\n<p>In terms of how much less, <a href=\"https://www.velonews.com/gear/gear-issue-friction-differences-between-1x-and-2x-drivetrains/\" target=\"_blank\">testing by CeramicSpeed on behalf of <em>VeloNews</em></a> has shown a 2x 11-speed Shimano drivetrain was around 3 watts more efficient on average than a SRAM Force 1x drivetrain.</p>\n<p>The differences widen when using the smallest cogs on each cassette, though. A 53×11 gear was shown to be around 6 watts more efficient than a 48×10, for example.</p>\n<p>Of course, if you’re not <a href=\"https://www.bikeradar.com/advice/workshop/how-to-clean-a-bike-chain/\">keeping your chain perfectly clean</a> at all times, then efficiency losses from optimising sprocket and chainring sizes are arguably a moot point.</p>\n<p>However, It’s easy to see how frictional losses can quickly cancel out any potential aero gain, if you size down your chainrings and cassette cogs when switching to 1x.</p>\n<h2>Front derailleurs are just too good</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Shimano’s Dura-Ace Di2 RD-R9250 front derailleur is arguably the best in its class, but most modern road bike groupsets offer excellent front shifting.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>Regardless of the specific advantages and disadvantages mentioned above, the major reason I won’t be switching to 1x on my road bikes any time soon is this: front derailleurs are just really good nowadays.</p>\n<p>Modern <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road bike groupsets</a> at almost every level offer such excellent front shifting performance that choosing to forego a front derailleur feels like cutting off your nose to spite your face.</p>\n<p>The gold standard for front shifting is, without doubt, currently found on <a href=\"https://www.bikeradar.com/advice/buyers-guides/electronic-groupsets/\">electronic groupsets</a>. Many (myself included) consider <a href=\"https://www.bikeradar.com/brand/shimano/\">Shimano</a> to be the market leader in this area, but <a href=\"https://www.bikeradar.com/brand/sram/\">SRAM</a> and <a href=\"https://www.bikeradar.com/brand/campagnolo/\">Campagnolo</a> don’t lag far behind at all.</p>\n<p>However, even mechanical groupsets manage front shifting fantastically well, these days.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Shimano’s workhorse 105 R7000 drivetrain offers flawless front shifting at a bargain price.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>I’m currently testing the new <a href=\"https://www.bikeradar.com/news/2023-trek-emonda-alr/\">Trek Émonda ALR 5</a>, which uses a <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-105-r7000-r7020-groupset-review/\">Shimano 105 R7000</a> drivetrain, and the front shifting is practically flawless.</p>\n<p>Of course, a poorly timed shift or bad setup can still cause issues, but front shifting generally doesn’t feel like a problem that needs solving anymore.</p>\n<p>My Giant TCR Advanced Pro Disc, for example, is currently set up with a <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-di2-r9200-review/\">Shimano Dura-Ace Di2 R9200 groupset</a>, with a 12-speed 11-34t cassette out back and a non-standard, 53/36t chainring combination up front.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> My 53/36t chainrings and 11-34t cassette shift well and offer a huge range of relatively tightly spaced gears.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>Despite falling outside of Shimano’s recommendations (I’m even using 11-speed chainrings on a <a href=\"https://www.bikeradar.com/reviews/training/power-meters/stages-power-lr-shimano-ultegra-r8000-review/\">Stages LR Ultegra R8000 power meter</a> crankset), it shifts brilliantly. I get a lovely big chainring for fast riding, an easiest gear ratio small enough to spin my way up nearly any <em>Muur</em>, and gear ratios that are pretty tight too.</p>\n<p>I’ve even tried 53/34t before (with both electronic and mechanical Shimano groupsets) and found it works fine too. It’s not quite as good as when set up as Shimano intends (53/39t, 52/36t or 50/34t), but it’s perfectly usable when you need smaller climbing gears for a short period and don’t want to reset your derailleur height and cable tension.</p>\n<h3>Is the Classified Powershift hub a game changer?</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Classified’s Powershift hub is interesting tech that seems to perform excellently, but it doesn’t come cheap for now.</span></figcaption><span> <i>Tom Marvin / Our Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/news/classified-parcours-partnership/\">Classified’s Powershift hub gear system</a> is a wirelessly controlled, 2-speed planetary gear system integrated into a rear hub. It’s often touted as a ‘front derailleur killer’, but I just don’t see that happening.</p>\n<p>While our full review of the system is still in the works, it’s fair to say our initial impressions have been very positive. It does appear to offer solutions to many of the disadvantages of 1x mentioned above – maybe we can have our cake and eat it after all.</p>\n<p>The issue for me, though, is that it’s just far too expensive. Classified’s R50 and <a href=\"https://www.bikeradar.com/features/first-look-friday/classified-g30-powershift-wheelset/\">G30 Powershift wheelsets</a>, for example, cost £2,300 – only £25 less than the entire Trek Émonda ALR 5 mentioned previously.</p>\n<p>And what do you actually gain for all that cash compared to sticking with a 2x drivetrain? A marginal improvement to aerodynamic efficiency and… that’s about it?</p>\n<p>Of course, the cost of Classified’s hub tech will likely come down over time if it proves popular, but considering a 105 R7000 crankset and front derailleur have RRPs of £159.99 and £44.99 respectively (and can usually be found online for far less), I don’t think price parity is on the horizon any time soon.</p>\n<h2>Thanks 1x, but no thanks</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> For all-rounder road bikes, it’s hard to beat the versatility offered by 2x drivetrains.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>I won’t deny that I’ve toyed with the idea of running 1x drivetrains on some of my bikes.</p>\n<p>My <a href=\"https://www.bikeradar.com/features/bikeradar-builds-simons-planet-x-exocet-2-time-trial-bike/\">Planet X Exocet 2 time trial bike</a> and <a href=\"https://www.bikeradar.com/features/bikeradar-builds-simons-2009-giant-tcr-advanced-sl/\">2009 Giant TCR Advanced SL</a> – which could be granted a new lease of life as a hill climb bike since I got my <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/giant-tcr-advanced-pro-2-disc-long-term-review/\">Giant TCR Advanced Pro Disc</a> (look out for that in <a href=\"https://youtu.be/01n3XHOtsyI\">Hill Climb Diaries</a> at some point) – are potentially ideal candidates for <a href=\"https://www.bikeradar.com/features/how-to-convert-your-bike-to-a-1x-drivetrain/\">1x conversions</a>.</p>\n<p>On my less specialised road bikes, though, 2x is where it’s at.</p>\n<p><span>With the kind of performance and versatility offered by modern front derailleurs, the small potential improvements offered by 1x drivetrains just don’t seem worth it – even for someone like me who </span><a href=\"https://www.bikeradar.com/advice/workshop/how-to-wax-a-chain/\">waxes chains</a><span>, wears </span><a href=\"https://www.bikeradar.com/features/rule-28-aero-base-layer/\">aero baselayers</a><span> and generally obsesses over the tiniest gains.</span></p>\n<p>Instead, 1x for road bikes still feels like a solution in search of a problem.</p>","author":"Simon von Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"29382c6311da67bbaad6c56177fe845f3232dfd8ba676206a4b8c65a38522fc0","category":"Cycling"}