{"title":"Identification and Characterization of Reclaimed and Unreclaimed Mine Features Using Lidar and Temporal Remote Sensing Methods within the Coastal Plain Uranium Mining Region of Texas","link":"https://www.preprints.org/manuscript/202407.2426/v1","date":1722323192000,"content":"Open-pit uranium mining in the south Texas Gulf Coast region was active during the second half of the 20th century. Although some mines have extensive records documenting the locations and extents with descriptions of reclamation procedures and timelines, abandoned and reclaimed mines with minimal documentation concurrently exist where little is known about locations, mine waste volumes, and reclamation status. Advanced mapping of these mining operations is helpful for producing basic mine land inventories and assessments of mine waste; identifying potential undeveloped resources and environmental health issues; and for developing proper management, restoration, and reclamation strategies.\n\nWe studied known reclaimed and unreclaimed mine sites to develop a spatiotemporal mapping approach utilizing multiple techniques in remote sensing as a proof of concept. A mapping classification system was developed to identify uranium mine waste-rock piles, mine pits (with and without waste water), the total area of land disturbance due to mining, and to differentiate abandoned and reclaimed mine features using lidar (Light Detection and Ranging) analysis and multispectral temporal analysis. \n\nVisual interpretation of Landsat imagery and time-series analysis revealed the temporal life-cycle of mining, historical areas of disturbance, and reclamation; however, mine features below vegetation canopies are not always visible in satellite imagery. Lidar laser scanning penetrates the vegetation canopy to measure the topographic elevation and exposes anthropogenic modifications to the landscape. Lidar analysis (bare earth elevation surface, slope, topographic contours, topographic textures, and overland-flow hydrography) revealed mine features, and expansive areas of mining disturbance.\n\nThe spatiotemporal mapping approach proved to be useful for identifying and characterizing known mine features, areas of disturbance, and reclamation status. Historical pre-mining topographic data were available at only 4 of the mines for comparison where the cut-and-fill tool estimated 21% less waste-rock volume, indicating that information about pre-mining terrain topography and/or subsurface mine waste geometry is needed to improve accuracies for quantifying buried mine waste volume at reclaimed mine sites.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"29431561f3486b33c83483e88d55be578ef9591377bf68174d31861ea5bde3a1","category":"Interdisciplinary"}