{"title":"Advancements and trends in ecological models for lake ecosystems: A bibliometric analysis (2002–2022)","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2655?af=R","date":1722317571000,"content":"<h2>Abstract</h2>\n<p>Ecological models hold significant potential for advancing lake research. In this study, we employed CiteSpace, a bibliometric analysis tool, and VOSviewer, a visualisation software, to facilitate a comprehensive understanding of recent advancements in ecological modelling within the context of lake research. The objective was to furnish valuable references in support of the widespread application of ecological models in aquatic environments. Using the 4688 articles collected in the Web of Science (WoS) core database as the sample data source, conducting corresponding data mining and quantitative analysis through visualisation analysis software such as CiteSpace and VOSviewer. From the perspectives of literature output patterns, keyword co-occurrence networks and future research directions, in-depth quantitative and visual analysis is carried out on the current status of research on lake ecological models, research institutions, journal publication situations, prolific authors and research hot topics. Through meticulous examination of literature and organisational categorisation techniques, we systematically scrutinised and synthesised the present state, limitations and noteworthy considerations associated with models such as EFDC, CE-QUAL-W2, DYRESM-CAEDYM, AQUATOX, Vollenweider, PCLake, MIKE, WASP and Deflt3D in the context of lake research. Our findings reveal that research focal points from 2002 to 2022 encompass climate change, the ramifications of eutrophication on aquatic ecosystems and the effects of phytoplankton and resuspended sediments on lake management.</p>","author":"Wei Li, \nJianjian Wang, \nCheng Chen, \nJiang Xia, \nYong Niu, \nZhiguo Yu, \nShan Qu, \nJunjie Jia","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"294bd7f8b95da6cce543339f5813f95ebe87fcb34e3e36f14a49f6823983011a","category":"Environment"}