{"title":"Meet Anna Kiesenhofer, the unlikely Olympic champion","link":"https://cyclingtips.com/2021/09/meet-anna-kiesenhofer-the-unlikely-olympic-champion/","date":1631582804000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033343-020-650x433.jpeg\" /></div><h2>Meet Anna Kiesenhofer, the unlikely Olympic champion</h2><p>\n</p><p>The story of Anna Kiesenhofer <a href=\"https://cyclingtips.com/2021/07/anna-kiesenhofer-takes-surprise-victory-in-tokyo-olympic-road-race/\" target=\"_blank\">winning gold in the Olympic women’s road race</a> went way beyond our little cycling bubble. It was the story of the ultimate Olympic dream, the story of a rider who had no chance to win but who ultimately won.</p>\n\n\n\n<p>Since that Sunday at the end of July Anna Kiesenhofer’s life has been turned upside down. When CyclingTips sat down for an interesting chat with the Austrian, we certainly weren’t the only ones keen to do so.</p>\n\n\n\n<p>“Yeah, I had many interview requests,” she starts. “But I learned to say no to them. It’s really all kind of requests like newspapers, websites, but also universities who want something for their monthly newsletters, or requests from bloggers. To be honest with you, I didn’t read it all. It’s not that I like to say no but I had to say no. “ </p>\n\n\n\n<p>Kiesenhofer ended up in a storm of publicity. Austria won seven medals in Tokyo and Kiesenhofer’s gold medal was the first for her country in the summer Games since 2004. Her win was a big deal in a country that normally excels at the Winter Olympics.</p>\n\n\n\n<p>“After a month it’s now calming down a bit but especially the first days were crazy,” she says. “I didn’t have time to process what had happened. I was telling a story to everyone but wasn’t really thinking deeper. Later I sat down but didn’t have that eureka moment indicating I processed it all. It’s time that does the job eventually.”</p>\n\n\n\n<p>All this publicity does not come naturally to 30-year-old Kiesenhofer who comes across as a softly spoken, modest, and down-to-earth person.</p>\n\n\n\n<p>“We had this official celebration in Austria afterwards with the president and other politicians,” she says. “I am naturally an introvert but I have learned to deal with the attention and I don’t get nervous any more. You tend to change when you win Olympic gold as an introvert,” she adds with a smile.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CSevgzkN87B/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> Dit bericht bekijken op Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CSevgzkN87B/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">Een bericht gedeeld door Anna Kiesenhofer (@annakiesenhofer)</a></p></div></blockquote> \n\n\n\n<p>Kiesenhofer’s cycling career was something of an accident. Many riders who start cycling at a later age have a similar backstory: they come from other endurance sports, with running often taking centre stage as the most important stepping stone to cycling. </p>\n\n\n\n<p>“I started with running but like so many endurance freaks I ended up with an injury and then discovered the bike,” she explains. “The bike had always been a means of transport to university, for example, so it was natural that when I couldn’t run any more, I would ride more. It changed from a means of transport to a competitive goal.”</p>\n\n\n\n<p>Kiesenhofer studied physics and mathematics at the Technische Universität Wien (Vienna Technical University) and continued her academic career with a PhD in partial differential equations. A PhD usually takes many years of hard work but Kiesenhofer is clear as to which achievement she rates higher. </p>\n\n\n\n<p>“This Olympic gold medal is so much bigger than my PhD,” she says. “This was harder. If you count the number of people with a PhD in the world and those with a gold medal …</p>\n\n\n\n<p>“If you are reasonably smart you can get a PhD but with a gold medal you can want it as much as you want but most people will never get it. It’s for now the proudest moment in my life. It’s not only about the medal but it’s also the road towards it, the story behind it, and all the small races I won but no one recognized. The medal is a reward for all it.”</p>\n\n\n\n<p>The medal and the story behind it made Kiesenhofer an instant celebrity in the cycling world but also in the academic world she has been part of for over 10 years now. She received and still receives many messages on social media.</p>\n\n\n\n<p>“Many people feel inspired and I find that really flattering,” she says. “Many people from an academic background like students, postdocs, but even professors also sent me messages [saying] that I showed you can do both [academia and elite sport] and that I inspired them to run or ride as well.”</p>\n\n\n\n<p>Science has always been a big part of Kiesenhofer’s life. She studied physics and mathematics because she wanted to understand the world around her. Every race she does, including her Olympic mission, starts with science.</p>\n\n\n\n<p>“It was actually of mix and science and listening to my body,” she says. “My approach is always analytical. I make a training plan before I go out and keep up with the scientific literature, but in sports you learn by trial and error mostly. I have been doing endurance sports for 10 years now with cycling, running, and triathlon and I know what works for my body now.”</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CB5Y9KHpTcS/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> Dit bericht bekijken op Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CB5Y9KHpTcS/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">Een bericht gedeeld door Anna Kiesenhofer (@annakiesenhofer)</a></p></div></blockquote> \n\n\n\n<p>Let’s go back to Sunday July 25. That morning she was Anna Kiesenhofer, one of only 67 women at the startline of the 137 km Olympic road race. Three hours and 45 minutes later she was Olympic champion.</p>\n\n\n\n<p>“It didn’t feel like a special day,” she recalls. “I had a good night’s sleep which isn’t normal before a race for me. Physically I was where I wanted to be. I was prepared. I had studied the course. I knew I had done everything I could so I knew that even when something goes wrong it’s not my fault. I was confident, calm and was feeling strong. I knew all the ingredients were there to have a good race.</p>\n\n\n\n<p>“In Tokyo you are surrounded by all these super fit people. Normally I am the fittest around and now everyone was super fit. It was a bit strange. You start wondering: ‘did I train enough? Am I good enough?’ I had expected this feeling and I had prepared myself and told myself ‘Anna, you deserve to be here.’ I just focused on my routine.</p>\n\n\n\n<p>“Mentally I was preparing myself too. I went through the mental plan and the nutrition plan. I wasn’t worrying about the others.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/CORVOS_00033343-016-1340x893.jpg\" /><figcaption>Anna Kiesenhofer putting the hammer down in the breakaway at the Olympics.</figcaption></figure>\n\n\n\n<p>Kiesenhofer’s plan was to be in the breakaway because she doesn’t feel comfortable riding in a bunch. It’s one of the reasons we won’t see her riding for a UCI team next year.</p>\n\n\n\n<p>“Plan A was to attack right away and plan B was to attack later,” she says with a laugh. “All the plans were actually to attack. Plan B was also plan A and C. I wrote down three kilometre marks to attack. That was at zero, 35, and 70 kilometres.”</p>\n\n\n\n<p>It turned out to be an attack at kilometre zero. Kiesenhofer found herself in the company of four other riders and they quickly gained a lead of over 10 minutes; a lead that is very uncommon in women’s races. Kiesenhofer didn’t think too much of it. In her career she has only done 11 UCI races that weren’t championships. </p>\n\n\n\n<p>“I have very little experience with women’s pro races in general,” she admits. “I saw that in the men’s race the breakaway had a big gap the day before so it didn’t strike me as unusual. But it seems that it is very unusual in the women’s race. Also our race was much shorter.</p>\n\n\n\n<p>“I was also surprised a bit they gave us so much room because we’re strong riders. We were more than riders who were only there to show their nations. With Anna Plichta, myself – even if I am not known I am strong and a good time triallist – and also Omer Shapira. It was a mix of a little underestimation and us being strong and riding so well.” </p>\n\n\n\n<p>The rest is history. Plichta, Shapira and Kiesenhofer kept riding well together and there was no organized chase in the peloton. Everyone was looking at the Netherlands who, with four potential Olympic champions on the team, were expected to control the race. They didn’t. Or couldn’t. </p>\n\n\n\n<p>As the Fuji International Speedway drew closer Kiesenhofer attacked on a climb and left Shapira and Plichta behind. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/CORVOS_00033343-019-1340x894.jpg\" /><figcaption>Solo attack in the final hour of the road race in Tokyo.</figcaption></figure>\n\n\n\n<p>“I was asked a lot when I knew I was going to win,” she says. “My answer would be that I couldn’t believe until after the finish line but later I thought about this more. Winning went through my mind when I attacked the break. It was then that I started playing with the thought of actually winning it but it was still a long way to go.” </p>\n\n\n\n<p>A long and hard hour of racing on her own remained. It was an hour of managing the pain and just keeping on going.</p>\n\n\n\n<p>“The first step [to dealing with pain] is to prepare that you will hurt,” she says. “I didn’t prepare for this time trial effort of course but I was mentally prepared to suffer. You think in advance how you are going to behave when the pain strikes because it will start sooner or later. The strategy is not as different as a hard training session. As an athlete you deal with pain all the time. </p>\n\n\n\n<p>“I also split the distance into pieces. That helps. It helps to think of the people who inspire me. I thought of my family in front of the TV and my boyfriend. He inspires me in the way he copes with pain and challenges and how he always did his training no matter how much stress he had at work.</p>\n\n\n\n<p>“I also thought about the athletes I admire for their ability to suffer. In my case these are mostly unknown amateur cyclists but I have also been a fan of Annemiek van Vleuten or Anna van der Breggen but I don’t know them personally. I do have this personal connection with those amateur racers. You can find inspiration everywhere.” </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033343-047-1340x894.jpeg\" /><figcaption>Kiesenhofer on the podium with silver-medalist Van Vleuten (Netherlands), and bronze medalist Elisa Longo Borghini (Italy).</figcaption></figure>\n\n\n\n<p>While Kiesenhofer has become an inspiration for many people around the world, and her life changed drastically in one day, she will not make life-changing decisions just yet. </p>\n\n\n\n<p>“The victory opened many opportunities and I am not going to decline those,” she says. “I will reduce my hours at university for now because I had a full-time job. The aftermath of the race takes so much time in dealing with management, with interviews, or sponsors. I needed the time and don’t want to rush the thinking about what’s next. It means I have more time for cycling, active or passive, now.”</p>\n\n\n\n<p>The Road World Championships are the only race left for the Austrian this year but she has many things to do still in 2021.</p>\n\n\n\n<p>“I just need some time off to think about where I want to go,” she says. “This has all taken a lot of energy: the training before and the stress afterwards. I was a bit disappointed in myself at first that I am not now super motivated again as an Olympic champion, but I have to accept it. Everyone wants a piece of me. I need some calmness to really process it all.”</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CP0DE0zBMOD/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> Dit bericht bekijken op Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CP0DE0zBMOD/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">Een bericht gedeeld door Anna Kiesenhofer (@annakiesenhofer)</a></p></div></blockquote> \n\n\n\n<p>“In the future I maybe want to work in cycling when I maybe don’t want to do maths my whole life,” she says. “Maybe I will try coaching or work in cycling innovation. I always want to keep learning. The authority that comes with being an Olympic champion can now work in my favor. On the online forums when I used to ask a question they wouldn’t listen and now they say: ‘she is the Olympic champion so she must be right,’” she adds with a broad smile.</p>\n\n\n\n<p>And the medal? That coveted piece of metal that is the result of all this? It’s somewhere in her house but she is not sentimental about it. When a journalist wants to see it, she takes it out but she is not getting crazy about it. </p>\n\n\n\n<p>“I had done so many small races for which I prepared extremely well and sacrificed as much or almost as much as for the Olympics,” she says. “You don’t get a gold medal but you work just as hard. I know many amateurs who work as hard and face the same sacrifices. It feels strange that no one saw all the small races that meant the world to me personally.</p>\n\n\n\n<p>“I did the same as for any race or gran fondo but in the end I walked away as Olympic champion. Maybe you push a bit harder at the Olympics but I have always been a perfectionist without any compromises.” </p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/meet-anna-kiesenhofer-the-unlikely-olympic-champion/\">Read More</a>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"294da454043518d58276edb2769ebdbc01238ce07845135575b7513bb0695fd2","category":"Cycling"}