{"title":"Flood‐oriented watershed health and ecological security conceptual modeling using pressure, state, and response (PSR) approach for the Sharghonj Watershed, South Khorasan Province, Iran","link":"https://onlinelibrary.wiley.com/doi/10.1111/nrm.12385?af=R","date":1707819326000,"content":"<h2>Abstract</h2>\n<p>Today, watersheds have changed under the influence of various environmental and human factors, and their expected performance has decreased in terms of meeting human needs, providing natural responses, and reducing environmental risks. However, evaluating health status and its impact on various factors has not been given enough attention. To this end, an attempt has been made to evaluate the health and ecological security of the subwatersheds of the Sharghonj Watershed using the pressure-state-response approach emphasizing flood-related issues in the region. Toward that, 21 preliminary hydrological, anthropogenic, natural, and climatic criteria were selected. The preliminary variables were then finalized based on the results of the collinearity test and the data availability. The final variables were appropriately allocated to pressure, state, and response (PSR) indices, and associated health and ecological security indices were determined at the subwatershed scale. The results showed that the PSR ranged from 0.56 to 0.86, 0.46 to 0.84, and 0.35 to 0.96, respectively. Health and ecological security also varied from 0.53 to 0.83 and 0.27 to 1.01 in different subwatersheds. Eventually, the weighted mean PSR indices for the Sharghonj Watershed were 0.72, 0.67, and 0.73, respectively. The weighted mean health and ecological security indices were 0.70 and 0.68, respectively. The research results indicated that the dynamic of various variables related to floods considerably affects the health of the Sharghonj Watershed. It could be concluded from the results that the Sharghonj Watershed is highly flood-susceptible, whose health and ecological security status was mainly controlled by the damages due to the destruction of residences and orchards by floods in the past few years. The results of the current study provide an appropriate roadmap to the decision makers and planners for the better management of the watershed resources in the region through allocating adequate financial support and implementation measures to priority subwatersheds.</p>","author":"Reza Chamani, \nSeyed Hamidreza Sadeghi, \nSomaye Zare, \nHengameh Shekohideh, \nAzam Mumzaei, \nHamed Amini, \nLaila Hemmati, \nReza Zarei","siteTitle":"Wiley: Natural Resource Modeling: Table of Contents","siteHash":"3719477483f67b16afdbb60e07461dbbb5827188dd5d72806069fb36caa95c59","entryHash":"295384c7066078d2b6b4b305b9dbd00093d0d4f815d81ad2d218aa11c8cb6cf5","category":"Environment"}