{"title":"The Dust-Up: We Need A Better Way to Measure MTB Seat-Tube Angle – Travis Engel","link":"https://theradavist.com/measuring-mtb-seat-tube-angles/","date":1698836163000,"content":"<p><em>Today’s edition of <a href=\"https://theradavist.com/tag/the-dust-up/\" target=\"_blank\">The Dust-Up</a> is a nerdy little tour through the world of effective seat-tube angles. <a href=\"https://theradavist.com/tag/travis-engel/\" target=\"_blank\">Travis Engel</a> thinks that the way we measure them is a little … obtuse. That number on your bike’s geometry chart may not mean what you think it means. He informs his opinions by talking to some mountain bike brands who are taking a fresh look at this deceptively complex dimension. </em><span></span></p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/SA-05.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/SA-05.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/SA-05.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/SA-05.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/SA-05.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/SA-05.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/SA-05.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/SA-05.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>My first draft of this Dust-Up was very different. It was going to be titled, “Mountain Bike Seat Tubes Still Aren’t Steep Enough.” I do believe that’s true, but I don’t believe it’s true for everyone. Right now, my rides are nothing but long climbs and long descents. If I lived somewhere with more undulating terrain, I might dread the industry’s steady march towards near-vertical seat tubes. Similarly, if I didn’t have a 34-inch inseam, I might not be slamming my saddle forward. Fitting bikes to bodies can get complicated. It’s why we’re seeing size-specific chainstays, suspension tunes, and even wheel diameters. You’d think seat-tube angles wouldn’t need that kind of special treatment.</p>\n<p>A 73-degree seat-tube angle will move 30mm forward for every 100mm it moves down. That’s good enough for road bikes, but as we occasionally need to be reminded, mountain bikes are not road bikes. The time spent out of the saddle is often more important than the time spent in the saddle. That’s why, barely a decade ago, “reach” became the dominant shorthand for mountain-bike frame size. Point is, a shift in design philosophy was accompanied by a shift in how we understand it. And there’s clearly been a shift in seat-tube angles.</p>\n<p>Six or seven years ago, few brands strayed far from those 73 degrees. Now, seat tubes are topping 78 and 79 degrees. And that trend is still evolving. Brands are taking a fresh look at how seat-tube angle interacts with a bike’s suspension travel, intended use, and frame size. I’d argue that distilling all this down to a single number oversimplifies an important aspect of how a bike ultimately rides. Maybe we need a more granular definition of what our seat-tube angles actually are. Or maybe we need to consider that the important measurement is “saddle offset,” which isn’t an angle at all. I’ll get into it. Because we need a better way to measure seat-tube angle.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/SA-06.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/SA-06.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/SA-06.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/SA-06.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/SA-06.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/SA-06.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/SA-06.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/SA-06.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>The primary issue is that the industry can’t agree on what “effective seat-tube angle” even means. Aside from bikes like <a href=\"https://theradavist.com/starling-cycles-murmur-v3-review/\" target=\"_blank\">our beloved Starling Murmur,</a> most full-suspension bikes and even some hardtails don’t have straight seat tubes that point directly to the bottom bracket. If your frame is all dog’s legs and Dutch angles, you can’t just put a protractor on your seat post and count the notches. You’ve got to measure the imaginary line from saddle to bottom bracket. That’s essentially how a lot of brands do it.</p>\n<p>They’ll design their seat-tube angle to stay consistent from XS to XXL by measuring it at the heights that are appropriate for their respective frame sizes. But that’s not how <em>everyone</em> does it. Some brands measure the angle originating from a point level with the top of the head tube. And that is utterly baffling. Even the shortest riders would rarely run their saddles that low. So once you’re at proper extension, your saddle will sit further back than the geometry chart claims. And the taller the rider, the bigger the discrepancy. Problem is, very few brands will tell you which method they use.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1447\" src=\"https://media.theradavist.com/uploads/2023/10/SA-10.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/SA-10.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/SA-10.jpg?resize=1024,741&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/SA-10.jpg?resize=768,556&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/SA-10.jpg?resize=1800,1302&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/SA-10.jpg?resize=1335,966&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/SA-10.jpg?resize=700,506&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/SA-10.jpg?resize=1536,1111&amp;quality=75 1536w\" /></p>\n<p>I did some random temperature-checks with some random mainstream brands, getting their position on this whole issue (all of whom use some form of the estimated-saddle-height method). Canyon’s Product Development Engineer, Leo Malmeryd, is working on what I think is a step in the right direction. But it’s tricky. He hesitates to add new, unfamiliar lines to a geometry chart. After all, those charts can be overwhelming for some consumers. “Right now, on our website, we have the basic geometry, but then we have a tab for component geometry,” Malmeryd explains. That’s where people can get things like handlebar width or shock eye-to-eye length.</p>\n<p>A deeper explanation of seat-tube angle could be handled in a similar way. “I’m proposing another tab for ‘advanced geometry.’ Our goal then is to display the reference seat height for each frame size, as well as the seat-tube angle horizontal from the head tube and at the maximum and minimum seat height.” So, if someone like me wanted to know more about how their bike will fit, they could come to that advanced chart with their personal saddle height in hand, find themselves somewhere within that published range, and get a pretty good idea what their effective seat-tube angle would be.</p>\n<p>If every brand adopted that approach, it would add some much-needed transparency to the issue. Nerdy riders would, of course, eat it up, but <i>less</i> nerdy riders might gain a deeper understanding of how nuanced frame geometry can be. Those nuances get lost when brands stamp a nice round number on the seat-angle box, and copy/paste throughout a size range. In fact, it was a brand who <i>doesn’t</i> copy/paste their seat-tube angles that really opened my mind to new ways to think about this. Although at the time of writing this, the fate of Nukeproof is uncertain, they have some cool ideas about saddle position. As you go up the size range, Nukeproof seat-tube angles get steeper, not slacker. They’re not the only brand to do this, but how they got there is pretty unique.</p>\n<p><img loading=\"lazy\" width=\"1920\" height=\"1074\" src=\"https://media.theradavist.com/uploads/2023/10/Screen-Shot-2023-10-30-at-11.10.57-AM.png?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/Screen-Shot-2023-10-30-at-11.10.57-AM.png?w=1920&amp;quality=75 1920w, https://media.theradavist.com/uploads/2023/10/Screen-Shot-2023-10-30-at-11.10.57-AM.png?resize=1024,573&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Screen-Shot-2023-10-30-at-11.10.57-AM.png?resize=768,430&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Screen-Shot-2023-10-30-at-11.10.57-AM.png?resize=1800,1007&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/Screen-Shot-2023-10-30-at-11.10.57-AM.png?resize=1335,747&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Screen-Shot-2023-10-30-at-11.10.57-AM.png?resize=700,392&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/Screen-Shot-2023-10-30-at-11.10.57-AM.png?resize=1536,859&amp;quality=75 1536w\" /></p>\n<p>I talked to Dale McMullan, R&amp;D Manager at Nukeproof, and he told me about an eye-opening ride he went on several years ago with Nukeproof’s six-foot-six marketing manager, Rob Sherratt. “Our team, we’re all mediums. And then Rob came along, and I was riding beside him, and we went into a steep incline, and I was like “woah.’” At Sherratt’s saddle height, he was cantilevered way over the rear wheel and deepening his sag well over 40%. “I remember thinking at that point that there’s something that we’ve missed,” said McMullan.</p>\n<p>But they didn’t simply steepen their seat-tube angles. Nukeproof started looking at how seat-tube angle and frame size interact, both on their own frames and their competitors. The massive spreadsheet McMullan screenshared with me reflected a scientific approach to figuring out what these angles really meant. And if you really think about it, when we talk about “seat-tube angle,” we’re not even talking about an “angle.” We’re talking about a <em>distance</em>.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/SA-04.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/SA-04.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/SA-04.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/SA-04.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/SA-04.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/SA-04.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/SA-04.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/SA-04.jpg?resize=1536,1024&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/SA-12.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/SA-12.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/SA-12.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/SA-12.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/SA-12.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/SA-12.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/SA-12.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/SA-12.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>“We originally called it ‘bum reach,’” McMullan says with an Irish accent thick enough to regularly confuse my transcription software. It’s the horizontal distance from the bottom bracket to saddle-center at rider height. Sort of the opposite of what we just think of as “reach” which is bottom-bracket to head tube. In Nukeproof’s original research, they found that “bum reach” (which they eventually decided to call “saddle offset”) would jump wildly throughout frame sizes. At sag, Sherratt’s saddle offset was 80mm further back than McMullen’s.</p>\n<p>If they were comparing traditional hardtails, the difference should be more like 50mm. It doesn’t sound like much, but when you consider that slamming your saddle forward or backward to the max lines barely gets you 10mm either way, being 30mm too far back is a big deal. So, for the past few years, Nukeproof frames haven’t used seat-tube angle in the design phase. Instead, they look at what they want the saddle offset to be at each size. Whatever effective seat-tube angle results is what they put on their geometry chart. Alongside saddle offset and the saddle height at which it is measured.</p>\n<p><img loading=\"lazy\" width=\"1534\" height=\"1036\" src=\"https://media.theradavist.com/uploads/2023/10/Screenshot-2023-10-26-at-4.17.08-PM.png?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/Screenshot-2023-10-26-at-4.17.08-PM.png?w=1534&amp;quality=75 1534w, https://media.theradavist.com/uploads/2023/10/Screenshot-2023-10-26-at-4.17.08-PM.png?resize=1024,692&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/Screenshot-2023-10-26-at-4.17.08-PM.png?resize=768,519&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/Screenshot-2023-10-26-at-4.17.08-PM.png?resize=1335,902&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/Screenshot-2023-10-26-at-4.17.08-PM.png?resize=700,473&amp;quality=75 700w\" /></p>\n<p>Santa Cruz recently called attention to their own focus on a similar measurement they cheekily call “butt reach.” Although they’re not (yet) publishing it on their geometry charts, the effect on seat-tube angles is similar to Nukeproof’s, where numbers get steeper as size increases. And they’re not the only ones. In fact, back when I was writing this Dust-Up under its previous pro-steepness title, I talked to a couple of the brands who also use steeper angles on larger frame sizes. Neither were on their own mission to shake up how we read our geo charts like Canyon or Nukeproof, but they had interesting things to say.</p>\n<p>Colin Hughes, Engineering Manager at Ibis, might say I’m looking at this a little backwards. “From what I was hearing around the office, it was obvious that the taller riders loved [steep seat-tube angles], but the reaction was more mixed from the shorter riders,” Hughes told me. “That’s when I started measuring horizontal distances from the seat, but I was actually measuring distance to the rear axle, not the bottom bracket.” Hughes calls this number “outrigger,” and it has become a factor not just in how they approach seat-tube angles, but also chainstay length. Though he’s not campaigning to have it added to the Ibis geo chart, it plays a big role in frame design, and reflects a whole-bike approach to seat-tube angle that takes suspension and weight distribution into account.</p>\n<p><img loading=\"lazy\" width=\"1737\" height=\"1028\" src=\"https://media.theradavist.com/uploads/2023/10/SA-09.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/SA-09.jpg?w=1737&amp;quality=75 1737w, https://media.theradavist.com/uploads/2023/10/SA-09.jpg?resize=1024,606&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/SA-09.jpg?resize=768,455&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/SA-09.jpg?resize=1335,790&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/SA-09.jpg?resize=700,414&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/SA-09.jpg?resize=1536,909&amp;quality=75 1536w\" /></p>\n<p>That’s also the cornerstone of Norco’s approach to seat angles. Although Design and Engineering Manager, David Cox, made no mention of any horizontal measurement, either behind the curtain or in front of it, Norco shares Ibis’ whole-bike approach to seat-tube angles. “If you have a bike where the kinematics are rather supportive in the midstroke, you can run a taller front end,” Cox illustrates. “And if you’re running a taller front end, you’d probably run a slacker seat-tube angle, otherwise your fit would feel quite short.” Whenever I tried to pull Cox into disclosing a formula for how Norco defines their seat-tube angles, he would explain why it’s just not that simple. There’s just no number that can tell you how a bike is going to ride.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/10/SA-01.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/10/SA-01.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/10/SA-01.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/10/SA-01.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/10/SA-01.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/10/SA-01.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/10/SA-01.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/10/SA-01.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>That last sentence was not a way for me to sidestep my duty as the writer of a Dust-Up column to take a stand on the issues. That’s easy. Geometry charts should list the effective seat tube angles at three saddle heights: Maximum extension with an OEM saddle and post, minimum extension with an OEM saddle and post, and at the average suitable extension for the median-height rider of each frame size’s recommended height range. Brands should also list what each saddle height is from BB center in millimeters, and should keep an eye on each other’s charts to make an effort to standardize how these lines are worded.</p>\n<p>But honestly, I think that’d be for the holdouts who will always want to express this measurement with an angle. Personally, I’d like to see a move to saddle offset. It’s the number used by pro bike fitters. The ones I talked to call it “saddle setback,” but it’s the same thing. I’m not saying it’s perfect. Like, it wouldn’t make it any easier to account for sag or trail incline or variations in suspension travel. You’d still have to take those into account, but that’s true when analyzing any geometry number. What it would do is encourage riders of different heights and different proportions to be intentional about finding the number that works for them. Though, I’ll probably end up complaining that saddle offsets are too long.</p>\n<p><em>If you’re new to this series, welcome to <a href=\"https://theradavist.com/tag/the-dust-up/\" target=\"_blank\">The Dust-Up,</a> a semi-regular platform for Radavist editors and contributors to make bold, sometimes controversial claims about cycling. A way to challenge long-held assumptions that deserve a second look. Sometimes they will be global issues with important far-reaching consequences; other times, they will shed light on little nerdy corners of our world that don’t get enough attention.</em></p>\n<p>The post <a href=\"https://theradavist.com/measuring-mtb-seat-tube-angles/\">The Dust-Up: We Need A Better Way to Measure MTB Seat-Tube Angle</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"Travis Engel","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"295542f02f8261fa837a32bf33c71cff94b9743bfc3d3849a6b26f13aefecca0","category":"Cycling"}