{"title":"Trends in body mass index for people with and without HIV: Pooled analysis of nationally-representative health surveys from 10 countries and 173,800 adults in Africa","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003640","date":1726581600000,"content":"<p>by Rodrigo M. Carrillo-Larco, Caroline A. Bulstra, Jennifer Manne-Goehler, Mark J. Siedner, Leslie C. M. Johnson, Vincent C. Marconi, Michael H. Chung, Willem Daniel Francois Venter, Erica Kocher, Samanta Lalla-Edward, Nomathemba C. Chandiwana, Jacob K. Kariuki, Mohammed K. Ali</p>\r\n\r\nIt remains unclear if and how body mass index (BMI) levels have changed over time in HIV endemic regions. We described trends in mean BMI and prevalence of overweight between 2003–2019 in 10 countries in Africa including people living with (PLWH) and without (PLWoH) HIV. We pooled Demographic and Health Surveys (DHS) from countries where ≥2 surveys &gt;4 years apart were available with height/weight measurements and HIV tests. HIV status was ascertained with a finger-prick dried blood spot (DBS) specimen tested in a laboratory. The DBS is taken as part of the regular DHS procedures. We summarized age and socioeconomic status standardized sex-specific mean BMI (kg/m<sup>2</sup>) and prevalence of overweight (BMI ≥25 kg/m<sup>2</sup>) by HIV status. We fitted country-level meta-regressions to ascertain if changes in ART coverage were correlated with changes in BMI. Before 2011, women LWH (22.9 [95% CI: 22.2–23.6]) and LWoH (22.6 [95% CI: 22.3–22.8]) had similar mean BMI. Over time, mean BMI increased more in women LWH (+0.8 [95% CI: 0.7–0.8] BMI units) than LWoH (+0.2 [95% CI: 0.2–0.3]). Before 2013, the mean BMI was similar between men LWH (21.1 (95% CI: 20.3–21.9)) and LWoH (20.8 (95% CI: 20.6–21.1)). Over time, mean BMI increased more in men LWoH (+0.3 [95% CI: 0.3–0.3]) than LWH (+0.1 [95% CI: 0.1–0.1]). The same profile was observed for prevalence of overweight. ART coverage was not strongly associated with BMI changes. Mean BMI and prevalence of overweight were similar in PLWH and PLWoH, yet in some cases the estimates for PWLH were on track to catch up with those for PLWoH. BMI monitoring programs are warranted in PLWH to address the rising BMI trends.","author":"Rodrigo M. Carrillo-Larco","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"296777bd4eca095608a8cce010935f18c96a0ad21b0ba92f6e9e0a5313e56ed7","category":"Environment"}