{"title":"Motional และ Hyundai เปิดตัวแท็กซี่ไฟฟ้าไร้คนขับ IONIQ 5 robotaxi ขับอัตโนมัติระดับ 4","link":"https://www.blognone.com/node/124519","date":1630416421000,"content":"<div><div><div><p>Motional บริษัทพัฒนารถยนต์ไร้คนขับที่เป็นการร่วมทุนกับ Hyundai จากเกาหลีใต้และ Aptiv ผู้ผลิตชิ้นส่วนรถยนต์จากไอร์แลนด์ ประกาศเปิดตัวรถแท็กซี่ไฟฟ้า IONIQ 5 robotaxi ที่เคลมว่าสามารถขับอัตโนมัติได้ถึงระดับ 4 ตามมาตรฐาน SAE</p>\n<p>IONIQ 5 robotaxi ถูกพัฒนาโดยมีพื้นฐานมาจากรถยนต์ไฟฟ้า Hyundai IONIQ 5 ที่เปิดตัวในปีนี้ แต่เพิ่มเซ็นเซอร์ต่างๆ ไปกว่า 30 ตัว ทั้งกล้อง, เรดาร์ และ Lidar เพื่อให้รถมองเห็นได้รอบคัน 360 องศา และตรวจจับวัตถุต่างๆ ได้จากระยะไกล ผนวกกับระบบขับขี่อัตโนมัติที่พัฒนาโดย Motional เอง ใช้ machine learning ที่ระบุว่าเทรนจากข้อมูลของโลกจริงจำนวนหลายสิบปี</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/649661352dc9ae5e49c180a23e2b94e4.png\" /></p>\n<p>ทีมงาน Motional ระบุว่ารถแท็กซี่ IONIQ 5 robotaxi มีระบบป้องกันความผิดพลาดสองชั้นในทุกฟีเจอร์ เช่นการเร่ง, เลี้ยว, เบรค เพื่อความปลอดภัย และหากรถตกอยู่ในสถานการณ์ที่ขับต่อเองไม่ได้ เช่นน้ำท่วมหรือมีการก่อสร้างบนถนน เจ้าหน้าที่ของ Motional จะเข้าควบคุมรถได้จากระยะไกลผ่านระบบ Remote Vehicle Assistance</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/cfa5219774765674705d142e3a9918b9.png\" /></p>\n<p>นอกจากนี้ Motional ยังเป็นพาร์ทเนอร์กับ Lyft โดยตั้งเป้าเริ่มให้บริการแท็กซี่ไร้คนขับผ่าน Lyft ในปี 2023 และจะโชว์รถคันจริงในงาน IAA Mobility ที่มิวนิคในเดือนกันยายนนี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6fb08d1d7865423e3b65f07aee24e9a9.jpeg\" /></p>\n<p>Motional เป็นบริษัทหน้าใหม่ เพิ่งก่อตั้งขึ้นเมื่อเดือนมีนาคม 2020 นี่เอง แต่ทีมงานอยู่ในวงการมานาน โดยเริ่มต้นจากการก่อตั้ง nuTonomy สตาร์ทอัพด้านซอฟต์แวร์รถยนต์ไร้คนขับที่แยกออกจากมหาวิทยาลัย MIT ในปี 2013 ส่วนอีกทีมงานก่อตั้ง Ottomatika จากมหาวิทยาลัย Carnegie Mellon ที่พัฒนาซอฟต์แวร์รถไร้คนขับเช่นกัน และผ่านการควบรวมกิจการโดย Aptiv ผู้ผลิตชิ้นส่วนรถยนต์จากไอร์แลนด์ให้ทั้งสองบริษัทเข้ามาอยู่ใต้บริษัทแม่เดียวกัน พร้อมตั้งเป็นทีมพัฒนารถไร้คนขับ ก่อนจะร่วมทุนกับ Hyundai และกลายมาเป็น Motional เมื่อปีที่แล้ว</p>\n<p>SAE (Society of Automotive Engineers) เป็นหน่วยงานที่กำหนดมาตรฐานต่างๆ ในวงการรถยนต์ โดยมาตรฐานของรถยนต์ไร้คนขับที่ยึดถือกันในปัจจุบันก็กำหนดโดย SAE แบ่งออกเป็น 6 ระดับ ตั้งแต่ 0 ถึง 5 ซึ่ง IONIQ 5 robotaxi เคลมว่าอยู่ในระดับ 4 หมายถึงสามารถขับอัตโนมัติได้เต็มรูปแบบโดยไม่ต้องการให้มนุษย์เข้ามาควบคุมรถเมื่อสิ่งแวดล้อมและสถานการณ์เข้าเงื่อนไขที่กำหนดไว้ ส่วนระดับ 5 คือขับอัตโนมัติได้เต็มรูปแบบในทุกสถานการณ์</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/50c21b6ca9914e6005aa4630a06639de.png\" /><em>ภาพโดย <a href=\"https://www.sae.org/blog/sae-j3016-update\">SAE</a></em></p>\n<p>ที่มา - <a href=\"https://motional.com/news/motional-and-hyundai-motor-group-unveil-the-ioniq-5-robotaxi-motional-s-next-generation-robotaxi\">Motional</a><br />\n<em>ภาพรถทั้งหมดโดย Motional/Hyundai</em></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/motional\">Motional</a></div><div><a href=\"/topics/hyundai\">Hyundai</a></div><div><a href=\"/topics/self-driving-car\">Self-Driving Car</a></div><div><a href=\"/topics/lyft\">Lyft</a></div><div><a href=\"/topics/transportation\">Transportation</a></div><div><a href=\"/topics/electric-car\">Electric Car</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"29697a718a6c87959c84bad058269d3be5de20c9083965b389e9d6a677375f18","category":"Thai"}