{"title":"Getting the shot: Vingegaard holds onto yellow","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/getting-the-shot-vingegaard-holds-onto-yellow","date":1688935103000,"content":"\n      <p>Sometimes a picture only takes seconds to prepare. But sometimes it can take days, weeks and even months. Today’s image falls in the latter category.</p>\n<div></div>\n<p>Ever since I <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-lighthouse\">visited the Puy de Dôme</a> with Rouleur magazine editor Ed Pickering in late April, I knew exactly where I wanted to stand when stage nine of this year’s <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal\">Tour de France</a> arrived. When photographing a climb as iconic as the Puy de Dôme it is important to try to convey at least some aspect of what makes it unique. In the case of the Puy de Dome there is the tower of the weather station and the impressive view across this part of central France overlooking other volcanoes. But after visiting the summit twice in less than a day, I understood that it would be difficult to find a spot where the cyclists could be seen in the same frame.</p>\n<p>During our visit, I noticed the impressive final pitch of the climb that the riders would crest just meters before the finish and I knew that would be my shot.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/agony-and-ecstasy-on-puy-de-dome\"><strong><em>Read more: Agony and ecstasy on Puy de Dôme</em></strong></a></p>\n<p>For weeks, I reached out to ASO press officer Fabrice Tiano, because I knew the logistical situation for the Tour photographers was uncertain as there was very limited space on the summit. It had taken the Tour 35 years to return because the site is a protected national landmark, and they were clearly very cautious when it came to access this year.</p>\n<p>Arriving at the Tour we were told that, as long as we arrived by 14:00 we could get a special train reserved for the press to the summit. Leaving my hotel in Limoges straight after breakfast, I skipped the start of stage nine and drove to the foot of the climb. But when I arrived, a security guard told me that I would not be able to get on the train as my name was not on a special list circulated after stage eight, because well, I was simply not on the proper mailing list.</p>\n<p>Needless to say, panic struck, as I have simply waited for years for the Tour de return to Puy de Dôme. But the security guard was making no exception. Fortunately I was not the only photographer that did not receive the email, and Fabrice’s assistant Christophe finally managed to get authorisation directly from the Puy de Dôme sight director. When the train came, I was on it.</p>\n<p>It was great riding back to the top and the weather was considerably better than when Ed and I visited.</p>\n<p>Arriving, I soon understood that the finish line had actually been pushed back several dozen meters, and shooting from the line would simply be too far away, so I sought out a position from the barriers close to where I stood in April.</p>\n<p>What impressed me most about this spot was the complete blanket of uninterrupted sky behind this stretch of road, and I could well-imagine on of the race leader grimacing as his head and body came into view. Finally finding the right angle, I positioned myself and began what would be a nearly five-hour wait.</p>\n<p>I chatted with several photographer friends as many were still considering their options. I was also interviewed on local French radio, who was curious why we had arrived so early.</p>\n<p>The radio commentator was also curious if I remembered the iconic photograph of Jacques Anquetil and Raymond Poulidor locked into their fierce battle in the 1964 Tour. Fortunately for him, I had studied the photograph and that stage just the day before.</p>\n<p>There was so much hype regarding the return to the Puy de Dôme this year, and one reason was the rivalry between Jonas Vingegaard and Tadej Pogačar, and the potetional for a showdown similar to that of 1964.</p>\n<p>Following the race on the big screen by the finish, I could see that the two were locked in a fierce battle shortly after attacking the final 4km road that leads to the summit. No, they were not locked together side-by-side like Poulidor and Anquetil, but neither rider appeared capable of gaining a real advantage.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg09_pogacar02_tdf_2023.jpg?v=1688934982\" alt /></p>\n<p>Finally Pogačar attacked just inside the final kilometre. He actually attacked in almost the same spot as Poulidor, when he finally managed to drop Anquetil. For several hundred meters, Pogačar struggled to gain a clear advantage, until suddenly he did.</p>\n<p>With the Tour helicopter coming into sight, I knew that Pogačar would soon follow. I focused my camera down the roadway to get my first glimpse of Pogačar when he crested the final pitch. When he finally did, his head was down as he concentrated on supplying his last efforts. At first he appeared in the center of the road, but he was unable to hold his line and moved towards the barriers.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg09_vingegaard00_tdf_2023.jpg?v=1688935016\" alt /></p>\n<p>Vingegaard was next, only seconds behind. He had clearly been bettered by Pogacar, but was still riding strongly over the final climb.</p>\n<p>I shot him first as he climbed towards me, and then managed to get a quick profile as he passed underneath the weather station.</p>\n<p>I continued shooting as a long string of riders streamed by, but I knew that one of these frames would be my shot of the day.</p>\n<p>Editing them, I liked my first shots of Pogačar cresting the climb, but was frustrated that I never managed to catch him looking ahead towards the line.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg09_vingegaard04_tdf_2023.jpg?v=1688935035\" alt /></p>\n<p>From a formal perspective I was hoping that Vingegaard would be more centered in the road, but he was looking ahead and I got a better sense of the sheer physical effort. Then there was his yellow jersey that just jumped out from the background. Sure, he had lost today’s battle, but he was still winning the war in this year’s Tour de France. And for me, this image better captured at least one of the stories of today's much-awaited stage.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"296f2c9e0450b895b2990158e1e891b824e60bfcedca5fb8ea369e687155f633","category":"Cycling"}