{"title":"The morning after and the day before: GC contenders on brink of a crucial Giro mountain test after bruising opening","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/gc-contenders-on-brink-of-a-crucial-giro-ditalia-mountain-test-after-bruising-opening","date":1683830557000,"content":"\n      <p>For much of stage six of the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, the peloton skirted around Mount Vesuvius, its cloud-capped summit overshadowing the race like a physical reminder of the mountains awaiting the riders on Friday.</p>\n<div></div>\n<p>As the race avoided that particular mountain - instead summiting two smaller climbs and navigating the twisting, undulating roads along the Amalfi Coast – the breakaway fought the sprint teams for the stage victory and lost out in the final 200 metres as Mads Pedersen eventually took the win.</p>\n<p>But the overall race simmered underneath the race for the stage win, as Geraint Thomas and Primož Roglič both suffered mechanicals in the closing kilometres, rounding a stressful opening week for the GC favourites, almost all of whom have been affected by crashes.</p>\n<p>A battered and bruised peloton lined up at the start in Napoli, after Wednesday’s stage was marred by a series of crashes on wet roads. Miraculously, somehow, there were no overnight abandons as a result of those incidents but the effects of crashes can linger for days, even after avoiding serious injury.</p>\n<p><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2023-stage-seven-preview-an-unrelenting-summit-finish-to-gran-sasso\"><em>Read more: Giro d'Italia 2023 stage seven preview - an unrelenting summit finish to Gran Sasso</em></a></strong></p>\n<p>A different sort of drama animated the last kilometres today. First, Roglič suffered a mechanical with 15 kilometres remaining on the bumpy roads on the outskirts of Napoli, and television cameras picked out a hole in his lycra shorts, suggesting that he had crashed again at some point in the day. Nonetheless, he re-joined the back of the peloton shortly afterwards, having been piloted by his teammates through the convoy.</p>\n<p>Almost as soon as Roglič had recouped his losses, Thomas suffered a mechanical and embarked on an even more frantic chase, weaving through riders who had begun dropping out the back of the peloton as the pace accelerated, but he too managed to avoid losing time.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-08655.jpg?v=1683830418\" alt=\"Geraint Thomas\" /></p>\n<p><em>Geraint Thomas suffered a poorly timed mechanical on stage six, but made it back to the peloton safely (Zac Williams/SWPix)</em></p>\n<p>Already in this opening week, little hints have been dropped along the roadside, indicating each GC favourite’s form and chances of winning the maglia rosa.</p>\n<p>With all the clarity that comes after one stage of a Grand Tour, the race seemed as good as settled after the opening day’s time trial when Remco Evenepoel obliterated all the competition to take the maglia rosa at the first opportunity, gaining time and eroding his rivals’ morale.</p>\n<p>Three weeks is a long time in bike racing, the other pre-race favourites were quick to say afterwards. Indeed, it seems that even a week is a long time in a bike race. Since that opening day, the young Belgian found himself <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/cracking-on-category-two-climbs-should-alarm-bells-be-ringing-for-evenepoel-and-soudal-quick-step-at-the-giro-d-italia\">unexpectedly isolated</a> on stage four under pressure from Ineos Grenadiers, perhaps hinting at frailties within his team. Maybe even more significantly, he crashed twice yesterday, first when a stray dog strayed into his path and again in the last three kilometres on the run-in to Salerno. He suffered a hematoma on his right side that will take a few days to alleviate and pain at the base of his spine, Soudal - Quick-Step doctor Toon Cruyt said in a Twitter video on Wednesday.</p>\n<p>Despite all this, Evenepoel remains the best placed of all the GC contenders, sitting second overall with a 32 second buffer over his closest likely contender João Almeida in fourth. The rest of the GC favourites are lined up behind him going into tomorrow’s crucial stage: Roglič is in fifth, 12 seconds behind Almeida with Thomas another 14 seconds back in sixth on the same time as Aleksandr Vlasov. Thomas’ teammate Tao Geoghegan Hart, meanwhile, is in ninth, another four seconds back. The 2020 Giro winner had recorded an impressive time trial on stage one but he was caught behind a crash the following day, costing him 19 seconds.</p>\n<p>With these still relatively small time gaps, the chinks in Evenepoel’s armour are already prompting aggressive racing. On the Valico di Chiunzi on stage six – an 8.2km long climb with an average gradient of 6.3% – Ineos-Grenadiers moved to the front to lift the pace, perhaps in an effort to fatigue riders still recovering from yesterday’s crashes, and showing that they are prepared to use every inch of road to challenge Evenepoel and Roglič.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-09214.jpg?v=1683744502\" alt=\"Remco Evenepoel\" /></p>\n<p><em>Evenepoel was blighted by crashes in the rain on Wednesday (Zac Williams/SWPix)</em></p>\n<p>Tomorrow, there will be more opportunities for the GC battle to ignite. Although the final part of the stage is technically split into two categorised climbs, there is virtually no respite in between them, making for an almost 45km long drag up to the finish at Gran Sasso which marks the first time the race passes above 2,000 metres.</p>\n<p>It is the Gran Sasso’s length rather than its gradients that makes it such a fearsome climb, and so it is likely to favour climbers who can maintain a high pace for a long period of time rather than those with a punchier style. Naturally, this makes GC contenders such as Evenepoel, Roglič, Vlasov and Thomas the favourites for the stage, as well as Thibaut Pinot who is already in the king of mountains jersey.</p>\n<p>However, it is often said that two days after a crash is when their effects are at their most acute and how Evenepoel copes with this will likely shape the GC race as it heads to its first pivotal summit finish.</p>\n<p><em>Cover image by RCS Sport</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2975f39b31b45d33b5bfd85f5bb55dda5efa674f7c768b90ba6943c06707cde5","category":"Cycling"}