{"title":"Low-Temperature Coating of Si Oxide by Aerosol Assisted CVD","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.286/7720399?rss=1","date":1721779200000,"content":"<span>Chemical vapor deposition (CVD) is a relatively mature technique involving chemical reactions of gaseous reactants that occur near a heated surface, leading to the formation of powders or films. A significant drawback of CVD includes the necessity of sophisticated reactors coupled with ultrahigh vacuum systems and plasma generators; the above tends to increase the cost of fabrication and operation. However, other CVD variants, such as aerosol-assisted chemical vapor deposition (AACVD), do not use the above systems, providing cheap alternatives for applications where production cost is an issue [<a href=\"#ozae044.286-B1\">1</a>]. For AACVD processing, an aerosol is generated from a solution of precursors dissolved in a solvent via an ultrasonic humidifier. The carrier gas transports the precursor mist to a reactor, where a heated substrate is located, and solvent aerosol droplets undergo evaporation; meanwhile, precursor droplets can react, forming a thin film [<a href=\"#ozae044.286-B2\">2</a>]. SiO<sub>2</sub> films have been used as an interlayer dielectric and a final passivation layer in VLSI circuits [<a href=\"#ozae044.286-B3\">3</a>]. Despite the advantages of the AACVD technique for synthesizing oxide compounds, there are few References in the literature for Si base oxide composite layers preparation by this technique. As is generally known, the nebulization of tetraethyl orthosilicate (TEOS) as Si precursor using the AACVD technique does not allow the formation of layers on flat substrates in temperature ranges (∼450°C) for some organometallic sources and salts. The present work describes a method to deposit a silicon-based precursor such as TEOS, employing the AACVD method on flat substrates at lower temperatures between 100 and 125°C. A TEOS (base-catalyzed) solution was prepared by combining two solutions: a) TEOS/Ethanol (EtOH) called the alkoxide solution and b) an aqueous solution formed by Water/EtOH/Ammonium Hydroxide/Ammonium Fluoride named catalyst solution. The resulting mixture usually is left to form a gel. To reduce the length of polymer chains and increase the deposit window, some additional EtOH was added to the mixture. Filtered compressed air was employed as a carrier gas to transport the mist to the substrate, composed of a stainless-steel plate (SS-304 or SS-316) and kept at a temperature of 100 to 125°C.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"29875b4b8d369d7ba638697e94ad8d07d3d71675fc3f0a8dfa00201a1b6a40ab","category":"Environment"}