{"title":"A Non-isothermal Curing Kinetic Studies of Novolac Type Phenol-Formaldehyde Resin for 3D Printing of Sustainable Building Design","link":"https://www.preprints.org/manuscript/202403.1631/v1","date":1711517119000,"content":"Novolac phenol-formaldehyde resins have gained extensive commercial utilization across diverse applications due to their exceptional mechanical, thermal, and chemical resistance properties. In this investigation, we successfully synthesized a traditional novolac, and a biobased novolac phenol-formaldehyde resin by partially substituting phenol with a bio-oil obtained from the organic phase resulting from the fast pyrolysis of pinewood biomass. Despite extensive investigations into the curing behavior of novolac resins crosslinked with hexamethylenetetramine (HMTA) through numerous model-fitting cure kinetic studies, a comprehensive model for predicting the crosslinking of bio-based phenol-formaldehyde resins in the presence of HMTA has not yet been studied. The primary objective of this research was to compare and apply several commonly used kinetic models to predict the degree of curing and cure rate of the synthesized resins, using DSC dynamic measurements. Our results demonstrated that the autocatalytic model exhibited excellent fitting for the traditional novolac resin and HMTA mixture, while the Kamal model showed better fitting with the experimental data obtained for the bio-based phenol-formaldehyde resin and HMTA system. In addition, the results evidenced a significant drop in the curing temperature by partially replacing phenol with bio-oil. Additionally, the results revealed a notable reduction in curing temperature when phenol was partially substituted with bio-oil. This substitution not only offers environmental benefits but also promotes energy efficiency and enhances production safety. The data collected in this study is pivotal for our subsequent research endeavors, which aim to develop environmentally sustainable materials optimized for use in 3D printing manufacturing processes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"298e3eecb0693db32a9b6f08141fe2f8f9c8c81dc0b3262ebe3abe5316c99c1d","category":"Interdisciplinary"}