{"title":"Five Features Rumored for the AirPods Pro 3","link":"https://www.macrumors.com/guide/airpods-pro-3/","date":1702681643000,"content":"Apple is working on an updated version of the <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a>, and the new earbuds are expected to see a launch sometime around 2025. There are several exciting new features that are rumored for the ‌AirPods Pro‌ 3, which we've rounded up here.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/airpods-pro-2-purple.jpg\" width=\"2500\" height=\"1406\" />\r<br />\n<h2>Refreshed Design</h2>\r<br />\nAccording to <a href=\"https://www.macrumors.com/2023/10/25/airpods-lineup-overhaul-2024/\"><em>Bloomberg</em>'s Mark Gurman</a>, the ‌AirPods Pro‌ 3 will get a design overhaul. Exactly what will be changing remains a mystery, but Apple is expected to update both the earbuds and the case to accommodate new features that are planned.\r<br />\n\r<br />\n<h2>Better Audio Quality</h2>\r<br />\nApple tends to boost audio quality with each new iteration of the AirPods, and rumors suggest that the ‌AirPods Pro‌ 3 will see audio improvements. We could also get further improvements to Active Noise Cancellation, and with Apple's focus on the Vision Pro headset, audio quality will be more important than ever.\r<br />\n\r<br />\nThe current USB-C version of the ‌AirPods Pro‌ 2 are designed to pair with the Vision Pro and offer lossless audio, so further feature additions for the Vision Pro and subsequent headsets are a good bet.\r<br />\n\r<br />\n<h2>Updated Chip</h2>\r<br />\nThe ‌AirPods Pro‌ 2 use the H2 chip, and the next-generation version of the ‌AirPods Pro‌ are expected to get an even faster chip, which Apple could call the H3 if it sticks with that naming scheme.\r<br />\n\r<br />\nThe current H2 chip powers everything from Active Noise Cancellation to Hey <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a>, fast switching, and Adaptive EQ, so the H-series chips are key to AirPods functionality. The H3 chip's processing power could be important for health-related features rumored for the ‌AirPods Pro‌.\r<br />\n\r<br />\n<h2>Hearing Health Improvements</h2>\r<br />\nThere are a number of hearing health features that Apple is working on for the AirPods lineup. In the future, a built-in hearing test could play tones and sounds to test how well a person can hear, giving users easy access to hearing health feedback. Apple is already testing this kind of functionality in the hearing study conducted through the Research app. \r<br />\n\r<br />\nIf the AirPods find a hearing issue, Apple could instruct the user to visit a doctor for further help.\r<br />\n\r<br />\nGurman says that Apple is also working on features that would let the AirPods further boost hearing, perhaps in an effort to make them available in lieu of a hearing aid. The ‌AirPods Pro‌ already support features like Conversation Boost to cut out background noise while focusing on speech, and relaxed hearing aid purchase guidelines that no longer require a prescription will make it easier for Apple to position the AirPods as a hearing aid alternative.\r<br />\n\r<br />\n<h2>Body Temperature Monitoring</h2>\r<br />\nApple has been testing a temperature sensor embedded in the AirPods, and this is likely a feature that would come first to the ‌AirPods Pro‌ if it ends up being implemented.\r<br />\n\r<br />\nTemperature measurements from inside the ear are more accurate than temperature measurements from the wrist.\r<br />\n\r<br />\nApple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> has been saying for years that Apple will add <a href=\"https://www.macrumors.com/2021/05/17/airpods-health-tracking-features/\">more health features</a> to the AirPods, and Apple has patented AirPods with <a href=\"https://www.macrumors.com/2016/11/15/apple-patent-airpods-biometric-sensors/\">biometric sensors</a> for monitoring heart rate, temperature, perspiration level, and more.\r<br />\n\r<br />\n<h2>Release Date</h2>\r<br />\nCurrent rumors suggest that Apple will introduce an updated version of the ‌AirPods Pro‌ in 2025. Apple often times AirPods launch dates to <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> events, so if the company remains on track for a 2025 launch, we could perhaps see the new earbuds debut sometime around September 2025.<br />This article, \"<a href=\"https://www.macrumors.com/guide/airpods-pro-3/\">Five Features Rumored for the AirPods Pro 3</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/five-features-rumored-for-the-airpods-pro-3.2413857/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2990007dbd62497d6b1acfc0ef92c22afd26d7d281b064c15d202a143ffbcc20","category":"Apple"}