{"title":"A landscape evaluation of caffeine citrate availability and use in newborn care across five low- and middle-income countries","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002486","date":1722261600000,"content":"<p>by Osayame A. Ekhaguere, Olufunke Bolaji, Helen M. Nabwera, Andrew Storey, Nicholas Embleton, Stephen Allen, Zelalem Demeke, Olufunke Fasawe, Betty Wariari, Mansharan Seth, Lutfiyya Khan, Herma Hema Magge, Oluwaseun Aladesanmi</p>\r\n\r\nApnoea of prematurity (AOP) is a common complication among preterm infants (&lt; 37 weeks gestation), globally. However, access to caffeine citrate (CC) that is a proven safe and effective treatment in high-income countries is largely unavailable in low- and-middle income countries, where most preterm infants are born. Therefore, the overall aim of this study was to describe the demand, policies, and supply factors affecting the availability and clinical use of CC in LMICs. A mixed methods approach was used to collect data from diverse settings in LMICs including Ethiopia, Kenya, Nigeria, South Africa, and India. Qualitative semi-structured interviews and focus group discussions were conducted with 107 different health care providers, and 21 policymakers and other stakeholders from industry. Additional data was collected using standard questionnaires. A thematic framework approach was used to analyze the qualitative data and descriptive statistics were used to summarize the quantitative data. The findings indicate that there is variation in in-country policies on the use of CC in the prevention and treatment of AOP and its availability across the LMICs. As a result, the knowledge and experience of using CC also varied with clinicians in Ethiopia having no experience of using it while those in India have greater knowledge and experience of using it. This, in turn, influenced the demand, and our findings show that only 29% of eligible preterm infants are receiving CC in these countries. There is an urgent need to address the multilevel barriers to accessing CC for managing AOP in Africa. These include cost, lack of national policies, and, therefore, lack of demand stemming from its clinical equivalency with aminophylline. Practical ways to reduce the cost of CC in LMICs could potentially increase its availability and use.","author":"Osayame A. Ekhaguere","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"29910871db36e2e38a862c653c5ae63ac396c8c0b776945a0133930a4a965bba","category":"Environment"}