{"title":"Incidence and predictors of tuberculosis among HIV-infected children after initiation of antiretroviral therapy in Ethiopia: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306651","date":1720188000000,"content":"<p>by Amare Kassaw, Worku Necho Asferie, Molla Azmeraw, Demewoz Kefale, Gashaw Kerebih, Gebrehiwot Berie Mekonnen, Fikadie Dagnew Baye, Shegaw Zeleke, Biruk Beletew, Solomon Demis Kebede, Tigabu Munye Aytenew, Lakachew Yismaw Bazezew, Muluken Chanie Agimas</p>\r\nBackground <p>Globally, Tuberculosis (TB) is the main cause of morbidity and mortality among infectious disease. TB and Human Immune Virus (HIV) are the two deadly pandemics which interconnected each other tragically, and jeopardize the lives of children; particularly in Sub-Saharan Africa. Therefore, this review was aimed to determine the aggregated national pooled incidence of tuberculosis among HIV- infected children and its predictors in Ethiopia.</p> Methods <p>An electronic search engine (HINARI, PubMed, Scopus, web of science), Google scholar and free Google databases were searched to find eligible studies. Quality of the studies was checked using the Joanna Briggs Institute (JBI) quality assessment checklists for cohort studies. Heterogeneity between studies was evaluated using Cochrane Q-test and the I<sup>2</sup> statistics.</p> Result <p>This review revealed that the pooled national incidence of tuberculosis among children with HIV after initiation of ART was 3.63% (95% CI: 2.726–4.532) per 100-person-years observations. Being Anemic, poor and fair ART adherence, advanced WHO clinical staging, missing of cotrimoxazole and isoniazid preventing therapy, low CD4 cell count, and undernutrition were significant predictors of tuberculosis incidence.</p> Conclusion <p>The study result indicated that the incidence of TB among HIV- infected children is still high. Therefore, parents/guardians should strictly follow and adjust nutritional status of their children to boost immunity, prevent undernutrition and opportunistic infections. Cotrimoxazole and isoniazid preventive therapy need to continually provide for HIV- infected children for the sake of enhancing CD4/immune cells, reduce viral load, and prevent from advanced disease stages. Furthermore, clinicians and parents strictly follow ART adherence.</p>","author":"Amare Kassaw","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"29a3e2addaec143c8929fa285da1f1868c0d939f82db378f609db0144c864186","category":"Interdisciplinary"}