{"title":"Mathieu van der Poel is thinking about racing the UCI Gravel World Championships","link":"https://cyclingtips.com/2021/12/mathieu-van-der-poel-is-thinking-about-racing-the-uci-gravel-world-championships/","date":1638829087000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/mvdp1-650x433.jpg\" /></div><h2>Mathieu van der Poel is thinking about racing the UCI Gravel World Championships</h2><p>\n</p><p>As if the versatile Mathieu van der Poel (Alpecin-Fenix) didn’t already have enough to keep himself busy, the road, cyclocross, and mountain bike racer has said that he might be interested in giving the Gravel World Championships a go, too.</p>\n\n\n\n<p>The UCI confirmed in September of this year that it is <a href=\"https://cyclingtips.com/2021/09/the-uci-will-run-a-gravel-world-series-and-gravel-world-championships-in-2022/\" target=\"_blank\">creating a Gravel World Series of races and World Championship event</a> for the 2022 season.</p>\n\n\n\n<p>Asked during an interview with <a href=\"https://www.youtube.com/watch?v=EZJQLe953uQ\" target=\"_blank\">GCN</a> whether he was considering making an appearance at the World Championships, Van der Poel answered simply but without hesitation: “Yes.”</p>\n\n\n\n<p>Van der Poel, 26, has been a top contender across three disciplines in recent years. His diverse career palmares includes four world cyclocross titles, numerous WorldTour wins on the road, including a Monument victory at the 2020 Tour of Flanders, and multiple UCI mountain bike World Cup wins.</p>\n\n\n\n<p>His versatility and all-around ability might seem to make him an obvious favorite were he to roll up to the start line at the Gravel World Championships, but Van der Poel doesn’t actually have all that much experience in the discipline.</p>\n\n\n\n<p>As he pointed out in the interview, “I’ve never actually done a gravel race.”</p>\n\n\n\n<p>We’ll see if that changes in 2022.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/mathieu-van-der-poel-is-thinking-about-racing-the-uci-gravel-world-championships/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"29a4968a5b6e5016d36e40787bf1554370ad43814c072933bbc8677afeaa2fb4","category":"Cycling"}