{"title":"Battlefield 2042 beta impressions: Strong ideas buried in a buggy mess","link":"https://arstechnica.com/?p=1802723","date":1634083684000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul>\n          <li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Battlefield-2042-Open-Beta_20211009231745-980x551.jpg\" /></div>\n        <p>\n          <em>Battlefield 2042</em>'s beta had all the frantic action you'd expect, when it was working.                      [credit:\n                        <a href=\"https://www.dice.se/\">DICE</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul>\n  \n\n<p>When DICE announced <em>Battlefield 2042</em> would be delayed <a href=\"https://arstechnica.com/gaming/2021/09/battlefield-2042-joins-recent-game-delay-frenzy-moves-to-november/\">from this month to November</a>, it joined a long line of other studios pushing back game launches due to pandemic-related development challenges. But after spending several hours recently with <em>2042</em>'s open beta on PlayStation 5, I wonder if holding this multiplayer-only sequel back by a matter of weeks will be enough time to fix the glaring issues present in its prerelease build.</p>\n\n<p>Multiple developers at the studio have <a href=\"https://twitter.com/PartWelsh/status/1445455591988613126?s=20\">addressed this</a>, claiming the beta is already outdated by three months and that a lot of the laundry list of technical hitches and bugs that players discovered have been fixed since. In a <a href=\"https://www.reddit.com/r/battlefield2042/comments/q2hn7p/is_it_an_unpopular_opinion_that_im_enjoying_the/hflo1ak/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Reddit post</a>, producer Ben Walke said DICE made the decision to \"cap\" progress on the beta early so the team could focus its resources on improving the game's launch build rather than pulling people away to polish up something only meant for a simpler prerelease representation of the real thing. <em>But</em>.</p>\n<p>Boy oh boy, this prerelease had problems—and my own experience lines up with recent rumblings about how that timeline may not <a href=\"https://gamingintel.com/battlefield-2042s-troubled-development-and-identity-crisis/\">be entirely accurate</a>. Regardless, with just the pandemic realities of working from home alone (which DICE pointed to when it announced <em>2042'</em>s delay in the first place) the developer may still have its hands full making sure the game is polished and, uh, actually working by its November 19 launch date.</p></div><p><a href=\"https://arstechnica.com/?p=1802723#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1802723&amp;comments=1\">Comments</a></p>","author":"Steve Haske","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"29aec16f5a95ff7af6230d20905421e8af1ae303b7732e6504e8cee2908cf51a","category":"Tech"}