{"title":"Study of a New Novel HVOAF Coating Based on a New Multicomponent Al80Mg10Si5Cu5 Alloy","link":"https://www.preprints.org/manuscript/202408.0587/v1","date":1723098822000,"content":"This paper presents and demonstrates the development of a new lightweight coating for aluminium alloy using a novel multicomponent alloy based on the AlSiMgCu system. This coating was applied using a newly designed approach that combined High-Velocity Oxy-Fuel (HVOF) and Plasma Spraying processes. This hybrid technique enables the deposition of coatings with enhanced performance characteristics. The microstructure was studied using optical microscopy (OM) and scanning electron with energy dispersive X-ray spectroscopy (SEM+EDS) microscopy, revealing good adhesion and compaction between the multicomponent coating and the A6061 substrate with 50 to 150 µm thickness. Vickers indentations were performed on the substrate and the new coating material, revealing a 50% improvement in the material's hardness compared to the casted alloy. Additionally, electrical conductivity measurements showed approximative x3.3 times values compared to the alloy in as-cast condition due to high solidification rates altering the morphology of the phases. Corrosion tests demonstrated a lower corrosion rate compared to other multicomponent aluminium alloys and similar to thermal treated A6061 alloy. Finally, tribological results obtained using ball on disc (BOD) test and laser scanning confocal microscopy, confirmed that the new multicomponent coating exhibited reductions in both friction coefficient and wear rate by more than 20% and 50%, respectively. This study demonstrates that using multi-component aluminium coatings could lead to developing of new automotive parts with enhanced properties for corrosion resistance, electrical conductivity, and wear conditions. Optimizing the thermal spraying parameters could further enhance the coating, achieving greater and more homogeneous thicknesses and yielding even higher performance properties.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"29af8891d45d32eff22709c703542b23e1c60b357782fc0a056f48e1198bf42d","category":"Interdisciplinary"}