{"title":"Large-scale culturing of the subpolar foraminifera Globigerina bulloides reveals tolerance to a large range of environmental parameters associated to different life-strategies and an extended lifespan","link":"https://academic.oup.com/plankt/article/46/4/403/7689322?rss=1","date":1717718400000,"content":"<span><div>Abstract</div>The subtropical to subpolar planktic foraminifera <span>Globigerina bulloides</span> is a calcifying marine protist, and one of the dominant foraminiferal species of the Nordic Seas. Previously, the relative abundance and shell geochemistry of fossil <span>G. bulloides</span> have been studied for palaeoceanographic reconstructions. There is however a lack of biological observations on the species and a poor understanding of its ecological tolerances, especially for high latitude genotypes. Here, we present observations from the first extensive culturing of <span>G. bulloides</span> under subpolar conditions, including the first low temperature (6–13°C) and variable salinity (30–38) experiments. Carbonate chemistry (pH and [CO<sub>3</sub><sup>2−</sup>]) was also manipulated. Experimental conditions were chosen to reflect a range of plausible past and future scenarios for the Nordic Seas. We found <span>G. bulloides</span> to be tolerant of environmental conditions well outside their optimal range (&lt;10°C, salinity &lt;33, pH &lt;8). Observed life span was up to three months, which was attributed to a microalgal diet. Two alternative life strategies were employed, whereby individuals either experienced rapid growth and death, or a prolonged lifespan with minimal growth and death via slow decay. We posit this could help explain differences in geochemical signals recorded from different size fractions of fossil specimens used for palaeoceanographic reconstructions.</span>","author":"","siteTitle":"Journal of Plankton Research Current Issue","siteHash":"76dddc2a9ba5dfb3490083b30b542d64431810a1f59aa42d49b14d3439ebc9c8","entryHash":"29b9ae8c570aed210fa795d0f02534419b81d4977ce7eec3462f9afd4ec4c6df","category":"Environment"}