{"title":"Exploring the potential of selenium nanoparticles and fabricated selenium nanoparticles @vitamin C nanocomposite in mitigating nicotine-induced testicular toxicity in rats","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae154/7796858?rss=1","date":1727654400000,"content":"<span><div>Abstract</div><div>Background</div>The tobacco epidemic signifies a major public health threat. Nicotine (NIC), a major active constituent in tobacco, impedes male fertility and semen quality. This work is implemented to explore the potential of selenium nanoparticles (SeNPs) and the newly fabricated SeNPs @vitamin C (SeNPs@VITC) nanocomposite in mitigating testicular toxicity induced by NIC.<div>Materials and methods</div>The six groups of 48 adult Wistar rats were designed as follows: the control group injected intraperitoneally with normal saline, the SeNPs group treated orally with 2 mg/kg of SeNPs, the SeNPs@VITC nanocomposite group treated orally with 2 mg/kg of SeNPs@VITC nanocomposite, the NIC group injected intraperitoneally with 1.25 mL/kg of NIC, the NIC+ SeNPs group received SeNPs plus NIC, and the NIC+ SeNPs@VITC nanocomposite group received SeNPs@VITC nanocomposite plus NIC. Treatments were administered over a 28-day period.<div>Results</div>NIC treatment significantly caused poor sperm quality, decreased serum testosterone, increased follicle-stimulating hormone (FSH), luteinizing hormone (LH) concentrations, reduced hemoglobin levels, leukocytosis, disrupted testicular oxidant/antioxidant balance, and disorganized testicular structure. The construction of the novel SeNPs@VITC nanocomposite, compared to NIC plus SeNPs alone, demonstrated a more potent ameliorative effect on NIC-induced reproductive toxicity in adult rats. The SeNPs@VITC nanocomposite significantly increased sperm count, reduced the percentage of sperm head abnormalities, lowered both serum FSH and LH concentrations, and improved the hemoglobin response.<div>Conclusions</div>Both SeNPs and SeNPs@VITC nanocomposite alleviated the testicular toxicity induced by NIC, but the SeNPs@VITC nanocomposite exhibited superior efficacy. The SeNPs@VITC nanocomposite could be employed to advance enhanced therapeutic strategies for addressing male infertility.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"29bbccc77339a4b7b293446910d35379c67d742450cabc0db5377853af7f4623","category":"Environment"}