{"title":"โนนไทยทีม","link":"https://markpeak.net/%e0%b9%82%e0%b8%99%e0%b8%99%e0%b9%84%e0%b8%97%e0%b8%a2%e0%b8%97%e0%b8%b5%e0%b8%a1/","date":1622421648000,"content":"<p>ช่วงหลังเห็นสติ๊กเกอร์ “โนนไทยทีม” อยู่ท้ายรถส่งของจำนวนมาก</p>\n<p>ในฐานะคนโคราช ย่อมรู้จักอำเภอโนนไทย และพอเข้าใจได้ว่าคนจากอำเภอโนนไทยคงชวนๆ กันมาทำอาชีพขับรถส่งของกันเยอะ และรวมกลุ่มกันเป็นชุมชนโดยใช้ชื่อว่า “โนนไทยทีม”</p>\n<p>แต่คนโนนไทยมีเยอะขนาดนั้นเลยหรือ</p>\n<p>เมื่อวันก่อนได้คำตอบ เพราะมีรถมาส่งของที่บ้านพอดี เจอสติ๊กเกอร์เลยสอบถามพี่คนขับ ได้ความว่า<a href=\"https://www.facebook.com/groups/150438258741911/\">โนนไทยทีมเป็นกลุ่มใน Facebook</a> แต่ไม่ได้จำกัดเฉพาะคนโนนไทยเพียงอย่างเดียว ใครก็สมัครเข้าร่วมกลุ่มได้ (ขณะที่เขียนมีสมาชิกประมาณ 1.3 แสนคน ไม่ได้หาข้อมูลละเอียดแต่น่าจะเป็นชุมชนที่ใหญ่ที่สุด)</p>\n<p>ส่วนสติ๊กเกอร์นั้นเป็นการทำแจกจ่ายกันระหว่างสมาชิกในกลุ่ม และแปะไว้ท้ายรถเพื่อแสดงความเป็นชุมชน และหากไปส่งของที่ไหน เกิดปัญหา เกิดอุบัติเหตุ สมาชิกคนอื่นในกลุ่มผ่านมาก็จะมีธรรมเนียมจอดรถแวะมาสอบถาม ช่วยเหลือกันทันที</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/05/โนนไทยทีม.png\" /></p>\n<p>นอกจากโนนไทยทีมแล้ว ยังมีกรุ๊ปอื่นๆ อีกมาก อย่างที่พี่คนขับยกตัวอย่างมาให้ฟังคือ กล้วยไข่ซิ่ง เป็นทีมที่เริ่มจากคนเพชรบุรี แต่ก็เปิดกว้างให้ทุกคนเข้าร่วมด้วยเช่นกัน</p>\n<p>ช่วงหลังๆ ด้วยหน้าที่การงาน ได้รู้จักกับชุมชนคนส่งอาหาร delivery จำนวนมาก คิดว่าแพทเทิร์นคงคล้ายๆ กันคือเป็นการรวมกลุ่มกันของเพื่อนร่วมวิชาชีพ เพื่อแลกเปลี่ยนข้อมูลกันในเชิงการงาน และหาเพื่อนพูดคุยคลายเหงา (ระหว่างคนร่วมวิชาชีพ) อย่างไม่เป็นทางการ แต่ยังไม่ไปไกลถึงขั้นรวมกลุ่มเพื่อต่อรองหรือจัดตั้งเป็นองค์กรจริงจัง</p>\n<p>ฟังก์ชันของมันคงคล้ายกับบางส่วนของ guild หรือสมาคมอาชีพในอดีต เพียงแต่ด้วยพลังของอินเทอร์เน็ตและโซเชียล ทำให้ข้อจำกัดเรื่องพรมแดนหรือพื้นที่กายภาพหายไป (guild สมัยก่อนคงจำกัดด้วยเขตเมืองเท่านั้น) เราจึงเห็น guild ที่มีขนาดใหญ่ระดับแสนๆ คนได้ไม่ยากนัก</p>\n<p>นอกจากการใช้กรุ๊ป Facebook ที่ติดตามได้ง่ายแล้ว โซเชียลอีกอันที่ได้รับความนิยมสูงคือกรุ๊ปไลน์ และ LINE OpenChat ที่ค้นหาและติดตามได้ยากกว่ามากด้วย</p>\n<p>เท่าที่เคยอ่านกรุ๊ปเหล่านี้มาก็มีประเด็นน่าสนใจในเรื่อง self-organization หลายอย่าง การจัดการกันเองระหว่างชุมชน ดราม่าระหว่างชุมชนด้วยกันเอง การแยกตัวไปตั้งกรุ๊ปใหม่ ฯลฯ ซึ่งหลายอย่างก็เป็นของใหม่ในบริบทยุคไซเบอร์ ที่น่าศึกษากันลงลึกต่อไป</p>The post <a href=\"https://markpeak.net/%e0%b9%82%e0%b8%99%e0%b8%99%e0%b9%84%e0%b8%97%e0%b8%a2%e0%b8%97%e0%b8%b5%e0%b8%a1/\">โนนไทยทีม</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"29cb41945d7fa06661b2eeabcf76ea236d8f2b6d730b8f4529482df3d573c4dd","category":"Thai"}