{"title":"Ford’s bonkers new electric Supervan 4 is racing Pikes Peak this Sunday","link":"https://arstechnica.com/?p=1949515","date":1687452155000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/LC1_1501-800x533.jpeg\" alt=\"The Ford Supervan 4\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/LC1_1501-scaled.jpeg\">Enlarge</a> <span>/</span> This bewinged creation is the Ford Supervan 4.2. It looks (a bit) like the Ford E-Transit but goes much, much faster. (credit: Ford)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>When Ford <a href=\"https://arstechnica.com/cars/2022/01/weve-driven-fords-other-electric-workhorse-the-2022-e-transit/\">let Ars drive its new electric E-Transit van in early 2022</a>, I probably annoyed the heck out of the engineers and executives by repeatedly suggesting they make a Supervan version. While I don't think for a minute that my bugging them had any effect, the company did just that, building a souped-up version of its electric commercial vehicle with almost 2,000 hp (1,400 kW) and aerodynamic appendages that would not look out of place on a <a href=\"https://en.wikipedia.org/wiki/Fokker_Dr.I\">Fokker Triplane</a>. And this weekend, it's sending Supervan 4 to one of the hardest races in the world—the Pikes Peak International Hill Climb.</p>\n<h2>Supervan?</h2>\n<p>Ford's Transit van occupies roughly the same place in the European and British psyche as the pickup truck in the US. It's the default tradesperson's vehicle, available in various configurations and beloved by everyone from plumbers and builders to tour bands.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/LC3_3561-scaled.jpeg\"><img alt=\"Supervan 4.2's interior is quite unlike the production E-Transit. I don't think this one has a driver monitoring program that beeps at you if you accelerate too quickly, for one thing.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/LC3_3561-980x653.jpeg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/LC3_3561-scaled.jpeg\">Supervan 4.2's interior is quite unlike the production E-Transit. I don't think this one has a driver monitoring program that beeps at you if you accelerate too quickly, for one thing.</a> (credit: Ford)</p></div>\n<p>In 1970 or 1971, some bright spark at Ford UK had an idea to promote the Transit's image. <a href=\"https://silodrome.com/ford-supervan/\">A Transit body shell was mated to the chassis of a GT40 race car</a>, complete with 400 hp (298 kW) V8 engine. The Supervan was born, and it made its debut at a 1971 race meeting at Brands Hatch, just outside of London. Its performance was unlike any Transit van at the time, if a little pedestrian 52 years later—a zero to 60 mph time of seven seconds. For comparison, the current electric E-Transit is 0.6 seconds quicker off the line.</p></div><p><a href=\"https://arstechnica.com/?p=1949515#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1949515&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"29cd9e31c28830fb1e1cdb01a31cda7966744998faa232b4efd7a46c233dfac0","category":"Tech"}