{"title":"No fairytale for Mark Cavendish","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/no-fairytale-for-mark-cavendish","date":1688839109000,"content":"\n      <p><span>Road racing is the most transformative and transcendental sport in the world, but it also specialises in those moments of weightlessness that come at the very arc of a tall parabola. The Tour career of Mark Cavendish lies out there in La France Profonde, on the D85 running through La Chapelle Verlaine, south-west of Limoges. There will never be a 35th stage win. The Manx Missile has finally come to earth.</span></p>\n<div></div>\n<p><span>The <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, which has given so much to Mark Cavendish, denied him in the end the epic possibility of moving ahead of Eddy Merckx, who shares with him the all-time record of 34 stage victories. Cavendish has faced down and left behind generations of the best sprinters in the world: Bennati, Freire, Hushovd, Farrar, Petacchi, Greipel, Kittel, Sagan and more, but in the end, an innocuous-looking prang in the middle of nowhere on a quiet Saturday will be the full stop on his Tour story. Finality is supposed to be more dramatic than this.</span></p>\n<p><span>The moment itself was banal: a low-speed crash at 63.5km to go caused by contact between two or more riders; movement causing movement causing movement, rippling outwards and backwards down the bunch. The peloton expands and contracts as it moves forward, especially at slow speeds, as if it is breathing in and out. The riders operate a regulatory system composed of hundreds and thousands of individual decisions taken for the good of both themselves and those around them. And with luck and good judgement, everybody stays upright.</span></p>\n<p><span>Two or three riders went down at the back, and the only rider to stay down was Cavendish. He was obviously in pain. Lawson Craddock and Pello Bilbao bickered briefly as they untangled their bikes, then pedalled off, without a backward glance. Cavendish lay on the floor and held his helmet, and he might still have been in denial about what had happened, because he tried to sit up. Lay back down again. At that moment he knew for certain, even as commentators speculated that he might be fine, four photographers, a videographer and a TV camera operator gathered around him like moths to a flame, and the television pictures cut to an aerial shot of a piece of field art reading, “Long live Périgord geese.” Cavendish lay back down, and stayed down until one of the Tour doctors came and helped him to a sitting position.</span></p>\n<p><span>The Tour went through the motions, which felt somehow disrespectful of the moment, but what everybody learns sooner or later about cycling is that the Tour doesn’t care. The peloton sped on ahead, one rider smaller, always looking forward, never back. Sébastien Piquet, the voice of the Tour’s race radio, dryly recited the information he’d been given, stripping it down to the essentials, no indication beyond his name and number that the greatest sprinter the sport has ever seen had dramatically crashed out of the race. “Confirmé l’abandon,” he said, in clipped tones. “Abandon du cent quatre-vingt onze. Abandon du cent quatre-vingt onze. Mark Cavendish. Astana.”</span></p>\n<br />\n<p><span>*     *     *</span></p>\n<br />\n<p><span>I was there in Châteauroux in 2008 for Cavendish’s first Tour stage win, and I was hoping that he would win a 35th stage before the end of this Tour. Not because I particularly know him, like him or get on well with him, but because there’s such an epic dimension to his career and personality, and there is always a story. His first few years in the Tour were a story. His successful 2016 Tour was a story. 2021 was even more of a story. A 35th win would have been a hell of a story. Sometimes riders win stages and I wonder what I’m going to write about; this has never been the case with Cavendish.</span></p>\n<p><span>He’s really quite unusual, because I used to think that there was no way he could keep up the intensity, chippiness, ambition and inclination to charge head-first at life that he had in his early and mid-20s, but he still does. Cycling eventually wears riders down, but I don’t think it did so with Cavendish, even if by making his final acts in the Tour de France a slipping chain in a finishing sprint and a broken collarbone in a banal crash, it’s doing its best.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_1435_1024x1024.jpg?v=1688839018\" alt />I’ve spent a little time around him and had quite a few good interviews, because when he’s in a good mood there’s no-one better at explaining cycling, or conveying the visceral physicality of the sport, or saying bitchy stuff about Peter Sagan. Even when he’s in a bad mood, the interviews are revealing and newsworthy; it’s just that they’re also quite intimidating, and you’d better have done your research. I remember spending time at his team hotel before the 2010 Clásica de Almería, and he was a ball of energy, always talking, caffeinating the air around him with swear words and minor complaints about whatever was not going quite right at that moment.</span></p>\n<p><span>You always expect the careers of great riders like Mark Cavendish to be given a Viking burial. It should have been mounted on a long-ship with the trophies, medals and jerseys, set on fire and launched to sail over the horizon to Valhalla. Instead it was put into an ambulance and waited to be driven to the nearest hospital, back into the real world. Cavendish sat in the ambulance, looking stunned, the collective denial of the cycling world reflected in the fact that he still had all the accoutrements of the racing cyclist still intact: earpiece still taped to his ear, helmet still on. There was sweat and dirt on his face; the Cavendish death stare was being refracted through watery eyes and tears not yet shed.</span></p>\n<p><span>Somebody pushed the ambulance door closed, the reassuring thunk of the latch definitively ending the Tour career of the greatest sprinter there has ever been.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"29cf3a5c80cefd40309a1fccd1fa975a17455d1c04243f56dd9841245381717a","category":"Cycling"}