{"title":"Adsorptive elimination of methylene blue dye from aqueous solution by chitosan‐nSiO2 nanocomposite: Adsorption and desorption study, scale‐up design, statistical, and genetic algorithm modeling","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14282?af=R","date":1709812904000,"content":"<h2>Abstract</h2>\n<p>Heavy metals and organic dyes in water in concentrations exceeding the tolerable limit are unsafe for aquatic life and humans. Chitosan nanocomposites show a potential adsorption capacity to organic dyes. The present study encompasses the preparation of chitosan-<i>n</i>SiO<sub>2</sub> nanocomposites (CSNC) with different weight ratios of chitosan to <i>n</i>SiO<sub>2</sub> and its application in the methylene blue (MB) dye adsorption. The nanocomposites were characterized with the help of SEM, BET, FTIR, XRD, and TGA. The adsorption experimentation was executed in batch mode under varying experimental conditions. Several isotherm and kinetic models were analyzed with the experimental data, and thermodynamic conditions required for adsorption were also determined. Maximum Langmuir adsorption capacities (<i>q</i>\n<sub>L</sub>) of the adsorbents for MB varied in the range of 21.32–31.34 mg g<sup>−1</sup>. The pseudo-second-order model was the best-fitted kinetic model concerning all three adsorbents. The statistical modeling using multiple polynomial regression (MPR) for CWS CSNC1-1 and CSNC2-1 yielded the equations with <i>R-square</i> ranging from 0.984 to 0.996. For GA modeling, it is more than 0.999. So, the efficient employment of statistical modeling, and genetic algorithms has also been achieved.</p>","author":"Samanwita Bhattacharya, \nNirjhar Bar, \nBaisali Rajbansi, \nSudip Kumar Das","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"29d3870cdb97f0562acc11d67b0524b2b1038ed39474a4e710bb901238c68244","category":"Environment"}