{"title":"Embryonic and early larval development of Florida pompano, Trachinotus carolinus","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13077?af=R","date":1719900489000,"content":"<h2>Abstract</h2>\n<p>The Florida pompano, <i>Trachinotus carolinus</i>, is an ideal species for commercial aquaculture because of its rapid growth, tolerance to a range of environmental parameters, and high demand in the seafood market. This study detailed embryonic and early larval development of this species. Florida pompano followed similar developmental sequences to those observed in other marine teleosts, and embryos hatched between 22 and 28 h post-fertilization. Significant brain lobe differentiation occurred prior to hatching. Pectoral fins were functional within 1-day post-hatch (dph). Substantial eye development occurred within 3 dph, indicating visual acuity prior to the onset of exogenous live feeding. Intestinal segments were differentiated by 3 dph, and rotifers were seen in the digestive tract by 4 dph. Digestive functions were limited through the first 7 dph because of the absence of functional gastric glands and gastric mucous cells in the rudimentary stomach, lipid vacuoles in the anterior intestines, and the persistence of acidophilic supranuclear vesicles in the posterior intestines. Within 7 dph, the pharyngeal arches differentiated, and hematopoietic tissue and mesonephric tubules were visible in the larval kidney. Their rapid larval development and organogenesis are additional factors that make Florida pompano an ideal species for aquaculture production and should encourage continued efforts toward commercialization.</p>","author":"Ashley N. Morgan, \nSusan B. Fogelson, \nPaul S. Wills, \nTracy Mincer, \nSahar Mejri, \nAnnie Page","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"29d80962461d754a6b2d3779de6e06bf8e301ba50c5726c934831366adab1736","category":"Environment"}