{"title":"Joint optimization of headway and number of stops for bilateral bus rapid transit","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300286","date":1710338400000,"content":"<p>by Rongrong Guo, Francisco Antunes, Jin Zhang, Jingcai Yu, Wenquan Li</p>\r\n\r\nThe bilateral Bus Rapid Transit (BRT) system is a kind of BRT system in which the stops are located in the middle of the transit lane. By simultaneously serving transit lines in opposite directions, it is particularly designed to save space resources and enhance service quality. To improve the operational efficiency of the bilateral BRT, this paper optimizes the operational performance of bilateral BRT with elastic demand. The objective is to minimize the generalized time cost per passenger of the system by jointly optimizing the headway and number of stops of bilateral BRT. The cost includes the agency operating and user travel. The optimal design model is formulated as a mixed-integer program and solved using a fuzzy analytic hierarchy process (FAHP) and a genetic algorithm (GA). We conduct a case study and sensitivity analysis to show the effectiveness and reliability of the proposed approach. We conclude that the optimized minimum generalized cost per passenger is lower than the actual case for all demand levels, especially at off-peak hours, by about 22.5%. In addition, we find that the weights of agency and user costs have the most significant impact on headway, whereas the influence of walking, vehicle speed, and route length is minimal. In contrast, the optimal number of BRT stops is mostly influenced by the route length, and walking speed has essentially no effect on the optimal number of stops. Finally, we find that the generalized cost per passenger at peak hours is 10% to 15% smaller than at off-peak hours in various scenarios.","author":"Rongrong Guo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"29ec07fb920753946edc1d82ee5d04c870fa99e252bad5fbee8dac08b6269e3f","category":"Interdisciplinary"}