{"title":"Safety and Immunogenicity of the Nonavalent Human Papillomavirus Vaccine in Spanish Women Living with HIV","link":"https://www.preprints.org/manuscript/202406.0386/v1","date":1717721304000,"content":"Background: The objectives were to evaluate: the safety and immunogenicity of nonavalent human papillomavirus (nHPV) vaccine in adult Spanish women living with HIV (WLHIV); the prevalence of anal and cervical dysplasia and nHPV vaccine genotypes in anus and cervix; and risk factors for high-risk HPV (HR-HPV) infection in anal mucosa. Methods In this single-center, open-arm, non-randomized clinical trial, nHPV vaccine was administered at 0, 2, and 6 months to WLHIV enrolled between February 2020 and November 2023, measuring vaccine antibody titers pre-vaccination and at 2, 6, and 7 months after the first dose. Cervical and anal cytology and HPV PCR genotyping studies were performed. Women with abnormal cytology and/or anal or cervical HPV infection at baseline underwent high-resolution anoscopy and/or colposcopy. Results: 122 participants were included with mean age of 49.6 years: 52.5% smoked; 10.7% had anal-genital condylomatosis; 38.5% infection by HR-HPV in anus and 25.4% in cervix, most frequently HPV-16; 19.1% had AIN1 and 3.1% CIN1 and CIN2. Vaccine administration did not modify viral-immunological status (CD4 [809±226.8 cells/uL vs. 792.35 ±349.95; p=0.357]) or plasma HIV load (3.38±4.41 vs. 1.62±2.55 cop/uL [log]; p=0.125). Anti-HPV antibodies ([IQR: 0-0] vs. 7.63 nm [IQR: 3.46-19.7]; p=0.0001) and seroconversion rate (8.2% vs. 96.7% [p=0.0001]) were increased at 7 versus 0 months. There were no severe vaccine-related adverse reactions; injection-site pain was reported by around half of participants. HR-HPV infection in anus was solely associated with concomitant cervix infection (HR 5.027; 95% CI: 1.009-25.042). Conclusions: nHPV vaccine in adult WLHIV is immunogenic and safe.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"29eeab9f451db47a5141de6c278ac7c4c15be491a6f335d29a1243b5fff5a998","category":"Interdisciplinary"}