{"title":"Details From the Newly Unredacted Antitrust Complaint Against Google","link":"https://twitter.com/fasterthanlime/status/1452066487913664512","date":1635283309000,"content":"\n<p>This Twitter thread from @fasterthanlime has a bunch of scathing highlights from <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.564903/gov.uscourts.nysd.564903.152.0_1.pdf\">the full 173-page PDF of the filing</a>.</p>\n\n<p>A few nuggets. Re: false claims about AMP performance (p. 90):</p>\n\n<blockquote>\n  <p>After crippling AMP’s compatibility with header bidding, Google\nwent to market falsely telling publishers that adopting AMP would\nenhance page load times. But Google employees knew that AMP only\nimproves the “median of performance” and AMP pages can actually\nload slower than other publisher speed optimization techniques. In\nother words, the ostensible benefits of faster load times for a\nGoogle-cached AMP version of a webpage were not 90 true for\npublishers that designed their web pages for speed. Some\npublishers did not adopt AMP because they knew their pages\nactually loaded faster than AMP pages.</p>\n\n<p>The speed benefits Google marketed were also at least partly a\nresult of Google’s throttling. Google throttles the load time of\nnon-AMP ads by giving them artificial one-second delays in order\nto give Google AMP a “nice comparative boost.” Throttling non-AMP\nads slows down header bidding, which Google then uses to denigrate\nheader bidding for being too slow. “Header Bidding can often\nincrease latency of web pages and create security flaws when\nexecuted incorrectly,” Google falsely claimed. Internally, Google\nemployees grappled with “how to [publicly] justify [Google] making\nsomething slower.”</p>\n</blockquote>\n\n<p>You can’t justify it.</p>\n\n<p>On using Chrome, the browser, as a workaround for tracking users across the entire web, by conflating logging into Chrome with logging into Google’s own web properties (p. 95):</p>\n\n<blockquote>\n  <p>To get publishers to give Google exclusive access over their ad\ninventory, Google set publishers up for a lose/lose scenario.\nFirst, Google started to leverage its ownership of the largest web\nbrowser, Chrome, to track and target publishers’ audiences in\norder to sell Google’s advertising inventory. To make this happen,\nGoogle first introduced the ability for users to log into the\nChrome browser. Then, Google began to steer users into doing this\nby using deceptive and coercive tactics. For example, Google\nstarted to automatically log users into Chrome if they logged into\nany Google service (e.g., Gmail or YouTube). In this way, Google\ntook the users that choose not to log into Chrome and logged them\nin anyways. If a user tried to log out of Chrome in response,\nGoogle punished them by kicking them out of a Google product they\nwere in the process of using (e.g., Gmail or YouTube). On top\nthis, through another deceptive pattern, Google got these users to\ngive the Chrome browser permission to track them across the open\nweb and on independent publisher sites like The Dallas Morning\nNews. These users also had to give Google permission to use this\nnew Chrome tracking data to sell Google’s own ad space, permitting\nGoogle to use Chrome to circumvent reliance on cookie-tracking\ntechnology. The effect of this practice is to rob publishers of\nthe exclusive use of their audience data (e.g., data on what users\nread on The Dallas Morning News), thereby depreciating the value\nof publishers’ ad space and benefitting ad sales on Google’s\nproperties (e.g., YouTube).</p>\n</blockquote>\n\n<p><a href=\"https://daringfireball.net/linked/2021/10/26/photoshop-web\">My post earlier today about Photoshop for the web</a> going into public beta exemplifies the aspects of Google’s expansive vision for Chrome’s technical capabilities that make many web developers love Chrome and dislike Safari.</p>\n\n<p>The details in this antitrust filing exemplify everything that is wrong — deeply contrary to the intended open nature of the web — about Google controlling the most popular web browser in the world.</p>\n\n<p><strong>See also:</strong> <a href=\"https://twitter.com/PatrickMcGee_/status/1451619916994396164\">This lengthy thread from Financial Times reporter Patrick McGee</a>. E.g., one of Google’s own employees compared Google owning the dominant ad bidding exchange as akin to “if Goldman or Citibank owned the NYSE”.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/10/26/google-antitrust-complaint\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"2a03a090a7d1e488fba85e04520394bfe8b2a14f18f498b33a7e8ea62520c662","category":"Tech"}