{"title":"Pokémon GO Creator Niantic's New 'Peridot' Augmented Reality Pet Game Now Available","link":"https://www.macrumors.com/2023/05/08/niantic-peridot-augmented-reality-game-launches/","date":1683569033000,"content":"\"Peridot,\" the latest game from augmented reality company Niantic, is now available for download from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. A Tamagotchi-style game, Peridot allows users to choose a virtual pet to raise.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/04/peridot-niantic.jpg\" alt width=\"1024\" height=\"512\" />\r<br />\nAs with Niantic's other games, Peridot is an augmented reality title that encourages players to take their pets for walks in the real world. During walks, users can collect items, discover new places, and capture photos.\r<br />\n\r<br />\nThe game syncs with the Health app to allow players to earn walking distance even when the app is closed, and the augmented reality interface is quick and responsive, letting users tap a spot on the screen to direct their pet.\r<br />\n\r<br />\nThe Peridot or \"Dot\" is raised from birth, and players can pet, feed, and play with their Dots to help them grow. In addition to exploring places in the real world and uncovering items, there is a breeding mechanic that can unlock new Peridot archetypes. Raising a Peridot into an adult and leveling up unlocks new character traits that can be used for future pets.\r<br />\n\r<br />\nDots are modeled after existing animals and mythological creatures like cheetahs, dragons, unicorns, and more, with \"infinite possibilities of Peridot archetypes\" available.\r<br />\n\r<br />\nNiantic <a href=\"https://www.macrumors.com/2022/04/14/niantic-peridot-augmented-reality-game/\">first announced Peridot</a> in April 2022, so it has been in development for over a year. The official launch date is May 9, but the game is available for download as of today. [<a href=\"https://apps.apple.com/app/peridot/id6445801028\">Direct Link</a>]<br />This article, \"<a href=\"https://www.macrumors.com/2023/05/08/niantic-peridot-augmented-reality-game-launches/\">Pokémon GO Creator Niantic's New 'Peridot' Augmented Reality Pet Game Now Available</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/pokémon-go-creator-niantics-new-peridot-augmented-reality-pet-game-now-available.2389002/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2a20dbeaca7c451d1441cdc0cf635762b330873de5fb92265220eaeb6b6ee39e","category":"Apple"}