{"title":"The ecology of giant kelp colonization and its implications for kelp forest restoration","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13487?af=R","date":1722107124000,"content":"<h2>Abstract</h2>\n<p>The success and cost-effectiveness of kelp forest restoration hinges on understanding the colonization ecology of kelps, particularly with respect to dispersal potential, recruitment success, and subsequent establishment. To gain needed insight into these processes we examined spatial patterns and temporal trajectories of the colonization of a large artificial reef by the giant kelp <i>Macrocystis pyrifera</i>. The 151 ha artificial reef complex was constructed in three phases over 21 years, enabling dispersal, recruitment, and subsequent establishment to be examined for a wide range of environmental conditions, dispersal distances, and source population sizes. Natural colonization of all phases of the artificial reef by giant kelp was rapid (within 1 year) and extended across the entire 7-km-long reef complex. Colonization density declined with distance from the nearest source population, but only during the first phase when the distance from the nearest source population was ≤3.5 km. Despite this decline, recruitment on artificial reef modules farthest from the source population was sufficient to produce dense stands of kelp within a couple of years. Experimental outplanting of the artificial reef with laboratory-reared kelp embryos was largely successful but proved unnecessary, as the standing biomass of kelp resulting from natural recruitment exceeded that observed on nearby natural reefs within 2–3 years of artificial reef construction for all three phases. Such high potential for natural colonization following disturbance has important implications for kelp forest restoration efforts that employ costly and logistically difficult methods to mimic this process by active seeding and transplanting.</p>","author":"Daniel C. Reed, \nStephen C. Schroeter, \nDavid Huang, \nDenise Weisman, \nKathryn M. Beheshti, \nRachel S. Smith","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"2a22443f00a446e2a155d41278fc6a41787950d980f887316ff78b6f8a1009e0","category":"Environment"}