{"title":"Sold Secure bike lock ratings explained | Bronze, Silver, Gold and Diamond locks compared","link":"https://www.bikeradar.com/advice/buyers-guides/sold-secure-bike-lock-ratings-explained/","date":1627639731000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/23_SoldSecure_lock_ratings_explained-6dca41c.jpg?quality=45&amp;resize=620,413\" />                                            <p>If you’re looking for the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-lock/\" target=\"_blank\">best bike lock</a> for you, you’ll probably have noticed most will have a Sold Secure rating.</p>\n<p>There are now four levels of Sold Secure rating for bike locks: Gold, Silver and Bronze were joined in 2020 by Diamond-level security.</p>\n<p>But what is Sold Secure and what do the ratings mean?</p>\n<h2>What does Sold Secure do?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Sold Secure independently tests locks and other security devices.</span></figcaption><span> <i>OnGuard</i></span></div>\n<p>Set up in 1992 by two police forces, Sold Secure is an independent company that’s now owned by the UK’s Master Locksmiths Association and based in a lab in Rugby.</p>\n<p>It charges the devices’ makers to perform independent tests on locks and other security devices for houses and vehicles as well as for bicycles.</p>\n<p>Testing of bike locks isn’t compulsory and Sold Secure could fail a device – it doesn’t have to give it a rating – but having a rating is a good indication that the device has been independently assessed for its level of security, and has been tested consistently with other locks for just how much protection it will give you.</p>\n<p>A lock maker will want to display its ratings on its packaging because it gives you assurance of the level of security you can expect from a product.</p>\n<h2>Sold Secure ratings explained</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Sold Secure independently tests locks for their security level.</span></figcaption><span> <i>OnGuard</i></span></div>\n<p>Sold Secure is, understandably, not especially specific about the level of security each of its ratings provides – which can totally depend on factors Sold Secure is unable to assess, such as where the bike is locked up, how easy the lock is for a thief to get at with tools and what the bike has been locked to.</p>\n<p>But it tests a very wide range of cycle locks and uses a consistent barrage of tests and the same tools for each.</p>\n<p>Sold Secure also works with police forces and <a href=\"https://www.bikeradar.com/advice/buyers-guides/compare-best-bicycle-insurance/\">insurance companies</a> to identify what tools thieves are currently using and how they are working and then updates its testing in response.</p>\n<p>Tests assess a lock’s resistance to attacks from – among other things – drilling, cutting, levering and lock picking. It also measures how long a lock will withstand an attack.</p>\n<h3>Sold Secure Diamond</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Diamond-rated locks give the greatest level of protection.</span></figcaption><span> <i>OnGuard</i></span></div>\n<p>If you buy a bike lock rated Sold Secure Diamond, you can expect it to have the highest level of security available and resistance to prolonged attacks.</p>\n<p>There are currently around 80 bike locks rated Sold Secure Diamond. They’re a good bet for high-value bikes and ebikes, which are likely to be left in high-risk environments, such as publicly accessible bike racks.</p>\n<h3>Sold Secure Gold</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Sold Secure Gold-rated products are a good choice for longer-term storage.</span></figcaption><span> <i>OnGuard</i></span></div>\n<p>Sold Secure Gold level protection is also a good bet for high-risk areas and offers good protection from a wide range of potential attacks carried out over durations of around five minutes.</p>\n<p>A Gold-rated product is a sensible choice for bikes likely to be locked up for significant periods of time in public areas.</p>\n<h3>Sold Secure Silver</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Silver-rated locks balance cost and security.</span></figcaption><span> <i>OnGuard</i></span></div>\n<p>Engineering a high level of protection into locks is expensive. Silver-rated products look to balance security with cost, so you’ll get a little less protection from the determined thief, but pay significantly less for your lock.</p>\n<h3>Sold Secure Bronze</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Bronze-rated locks tend to be chunky cable locks.</span></figcaption><span> <i>OnGuard</i></span></div>\n<p>Sold Secure Bronze-rated products typically include lighter weight, less robust products, such as cable locks.</p>\n<p>They’ll immobilise your bike and stop an opportunist thief from walking away with it, but won’t withstand a determined attack from an experienced bike thief.</p>\n<p>They’re a good option for the cafe stop or other quick stops in high-traffic areas where you can expect to be able to keep an eye on your bike, but not for long periods, quieter areas or for overnight use in public spaces.</p>\n<h2>Tips for locking your bike</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Locking your bike correctly in a high-visibility area is the best deterrent of all.</span></figcaption><span> <i>OnGuard</i></span></div>\n<p>We have a dedicated guide on <a href=\"https://www.bikeradar.com/advice/skills/how-to-lock-a-bike/\" target=\"_blank\">how to lock a bike</a> but will cover the essential information here.</p>\n<p>In summary, though, lock your bike through its frame to something immovable and make sure it can’t be lifted off the object you’ve chosen.</p>\n<p>Fit the lock off the ground so it’s harder to apply leverage to it and try to fit it tightly around the bike with the lock barrel positioned so that it’s hard to access.</p>\n<p>Make sure that you’ve locked both wheels to the frame too – it’s easy for a thief to remove your wheels from your locked frame and walk off with them.</p>\n<p>For extra protection, use one lock on the frame and rear wheel and secure to an anchor, and a second lock to secure the front wheel and the frame.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Make sure you lock both your wheels and frame.</span></figcaption><span> <i>OnGuard</i></span></div>\n<p>Often bike locks are sold as a combined D-lock and a cable lock, which loops through it. It’s worth bearing in mind that the Sold Secure rating applies to the stronger D-lock and not to the cable.</p>\n<p>It’s also worth noting that theft from sheds, garages and back gardens is common. It’s a good idea to <a href=\"https://www.bikeradar.com/features/improve-your-bike-shed-security-whatever-your-budget/\">improve your shed security</a> by fitting a high-security anchor and locking up your bike when it’s at home and not in use.</p>\n<p>Sold Secure also tests and rates ground anchors as well as locks for buildings, so you can make sure that you’ve got the right level of immobilisation for your bike when it’s at home, too.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"2a2747f453f52f22d60f1d2e718f315f20578de28b5112b96956347edc8b50a1","category":"Cycling"}