{"title":"Fabrication of three‐dimensional micropatterned hydrophobic surfaces by fused filament fabrication printing technology","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400003?af=R","date":1717052400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/27d15d67-82a4-4175-8f80-a13b387495f2/appl202400003-gra-0001-m.png\" alt=\"Fabrication of three-dimensional micropatterned hydrophobic surfaces by fused filament fabrication printing technology\" /><p>Three-dimensional micropatterned textures of pillars were obtained by fused filament fabrication printing technology using pure polymers and composite filaments. A significant increase of water contact angle values up to 50% was obtained in all micropatterned samples with respect to flat surfaces.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>In recent years, the interest in structured hydrophobic surfaces has considerably grown, finding applications in many industrial fields, including aerospace, automotive, and biomedical. Three-dimensional (3D) printing technology is a simple, rapid, and economic process to fabricate structured surfaces based on neat polymers and composite materials, allowing working with a wide variety of plastic materials. The manufactured surfaces show a roughness depending on the printing design and the printing resolution: this characteristic is ideal to achieve superhydrophobic properties. Furthermore, patterned surface structures can be printed by fused filament fabrication (FFF), so increasing the hydrophobic character of the samples; indeed, micro- and nanosurface structures are required to make a hydrophobic surface. In this study, 3D micropatterned textures of pillars were printed by FFF using polylactide (PLA) and polypropylene (PP) as polymer filaments and PLA/carbon nanotubes (PLA/CNTs) and PP/carbon fibers (PP/CF) as composite filaments. Morphologies of printed specimens were analyzed by optical microscopy and scanning electron microscopy. Good correspondence was found between pillar dimensions and edge-edge pillars distance of computer aided design (CAD) and composites 3D-printed samples. Their wettability was evaluated by static contact angle (CA) measurements. Results clearly show a significant increase of water CA values up to 50% in all micropatterned samples with respect to flat surfaces. This improvement was achieved by surface microstructuring without the use of nanoparticles and/or chemical treatment.</p>","author":"Sergio Galvagno, \nLoredana Tammaro, \nSabrina Portofino, \nFausta Loffredo, \nAnna De Girolamo Del Mauro, \nFulvia Villani, \nGiuseppe Pandolfi, \nPierpaolo Iovane, \nPaolo Tassini, \nCarmela Borriello","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"2a286911913a472c85087840b1ee47bf134195b047db7d76397e8e9fa3ceb4c6","category":"Environment"}