{"title":"Vertebrates can be more important pollinators than invertebrates on islands: the case of Malva (=Lavatera) arborea L.","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae010/7617000?rss=1","date":1709251200000,"content":"<span><div>Abstract</div><span>Premise of the study:</span> On islands, flowering plants tend to be more generalist in their pollination needs, as insects (the main pollinators of flowering plants) are underrepresented in these ecosystems compared to the mainland. In addition, some vertebrate species that are typically insectivorous or granivorous on the mainland are forced to broaden their diet and consume other resources such as nectar or pollen on the islands. The shrub <span>Malva arborea</span>, with its large and colourful flowers, attracts different groups of potential pollinators. This study aimed to compare the effectiveness of vertebrates versus insects in an insular population of <span>M. arborea</span> and to investigate its reproductive system. <span>Methods:</span> For three groups of taxa (insects, birds and lizards), we assessed the two components of pollination effectiveness: (i) the quantitative component (i.e. number of visits and number of flowers contacted) through direct observations of flowers; and (ii) the qualitative component (fruit and seed set, number and size of seeds and proportion of seedling emergence) through pollinator exclusion experiments. <span>Key results:</span> Vertebrates (birds and lizards) were quantitatively the most effective pollinators, followed by insects. However, when all three groups visited the flowers, fruit and seed set were higher than when any of them were excluded. We also found that <span>M. arborea</span> has hermaphrodite flowers and is able to reproduce by autogamy, although less efficiently than when pollinated by animals. <span>Conclusions:</span> Both vertebrates and insects play an important role in the reproduction of <span>M. arborea</span>. Although the plant does not need pollinators to produce seeds, its reproductive success increases when all pollinators are allowed to visit the flowers. Besides providing new information on <span>M. arborea,</span> these findings may help to better understand the role of different pollinator groups in the reproduction of other plant species, especially on islands where the co-occurrence of vertebrate and invertebrate pollination in the same plant species is usual.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"2a29ab333d1087b0ad23fa8d1e438e2e6f72e13e108ff4d522bb4ff248518594","category":"Environment"}