{"title":"The Mac Turns 40: Read Apple's Announcement From 1984","link":"https://www.macrumors.com/2024/01/23/apple-macintosh-turns-40/","date":1706027499000,"content":"January 24 marks the 40th anniversary of Steve Jobs unveiling the Macintosh, the first successful mass-marketed computer with a graphical user interface.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/Classic-Mac-40-Years-Old-Feature-1.jpg\" width=\"2250\" height=\"1265\" />\r<br />\nThe original Macintosh popularized the computer mouse, allowing users to control an on-screen pointer. This point-and-click method of computer navigation was still a novel concept to most people at the time, as personal computers in this era typically had text-based command-line interfaces controlled with a keyboard.\r<br />\n\r<br />\nAn excerpt from <a href=\"https://web.stanford.edu/dept/SUL/sites/mac/primary/docs/pr1.html\">Apple's press release</a> in 1984:<blockquote>Users tell Macintosh what to do simply by moving a \"mouse\" — a small pointing device — to select among functions listed in menus and represented by pictorial symbols on the screen. Users are no longer forced to memorize the numerous and confusing keyboard commands of conventional computers. The result is radical ease of use and a significant reduction in learning time. In effect, the Macintosh is a desk-top appliance offering users increased utility and creativity with simplicity.</blockquote>Apple said the Macintosh typically took \"only a few hours to learn,\" and it touted what are now basic computer features, such as a desktop with icons, the ability to use multiple programs in windows, drop-down menus, and copy and paste. \r<br />\n\r<br />\nA quote from Jobs in Apple's press release:<blockquote>Macintosh easily fits on a desk, both in terms of its style of operation and its physical design. It takes up about the same amount of desk space as a piece of paper. With Macintosh, the computer is an aid to spontaneity and originality, not an obstacle. It allows ideas and relationships to be viewed in new ways. Macintosh enhances not just productivity, but also creativity.</blockquote>Pricing for the original Macintosh started at $2,495, equivalent to over $7,000 today. Key specs and features included an 8 MHz processor, 128 KB of RAM, a 400 KB floppy disk drive for storage, and serial ports for connecting a printer and other accessories.\r<br />\n\r<br />\nApple's full press release for the Macintosh can be found <a href=\"https://web.stanford.edu/dept/SUL/sites/mac/primary/docs/pr1.html\">on Stanford University's website</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/macintosh/\">Macintosh</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/23/apple-macintosh-turns-40/\">The Mac Turns 40: Read Apple's Announcement From 1984</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/the-mac-turns-40-read-apples-announcement-from-1984.2417209/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2a4096ab4343c0cae7f7188d2847c7bcc78e180c50504f99ba3668c7757a5a93","category":"Apple"}