{"title":"Out of shape: Ocean acidification simplifies coral reef architecture and reshuffles fish assemblages","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2656.14127?af=R","date":1719462931000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/89c82f51-bc42-4682-93c5-834ae7bddabc/jane14127-toc-0001-m.png\" alt=\"Out of shape: Ocean acidification simplifies coral reef architecture and reshuffles fish assemblages\" />\n<p>Many small-bodied reef fish are strongly associated with structurally complex corals. However, under acidified conditions, massive corals often outcompete branching corals, leading to reef ‘flattening’. As ocean acidification increases globally, we show that resultant simplification of coral structural complexity may act as an important mediator of future reef fish communities.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nClimate change stressors are progressively simplifying biogenic habitats in the terrestrial and marine realms, and consequently altering the structure of associated species communities.\n\nHere, we used a volcanic CO<sub>2</sub> seep in Papua New Guinea to test in situ if altered reef architecture due to ocean acidification reshuffles associated fish assemblages.\n\nWe observed replacement of branching corals by massive corals at the seep, with simplified coral architectural complexity driving abundance declines between 60% and 86% for an assemblage of damselfishes associated with branching corals. An experimental test of habitat preference for a focal species indicated that acidification does not directly affect habitat selection behaviour, with changes in habitat structural complexity consequently appearing to be the stronger driver of assemblage reshuffling. Habitat health affected anti-predator behaviour, with <i>P. moluccensis</i> becoming less bold on dead branching corals relative to live branching corals, irrespective of ocean acidification.\n\nWe conclude that coral reef fish assemblages are likely to be more sensitive to changes in habitat structure induced by increasing <i>p</i>CO<sub>2</sub> than any direct effects on behaviour, indicating that changes in coral architecture and live cover may act as important mediators of reef fish community structures in a future ocean.\n</p>","author":"Jamie Priest, \nCamilo M. Ferreira, \nPhilip L. Munday, \nAmelia Roberts, \nRiccardo Rodolfo‐Metalpa, \nJodie L. Rummer, \nCelia Schunter, \nTimothy Ravasi, \nIvan Nagelkerken","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"2a466dd24d83a796925d28b0bb738cbb938c56c4ef2440a5caea5587c081ac5c","category":"Environment"}