{"title":"VMware Fusion for M1 Macs Now Available as Private Tech Preview","link":"https://www.macrumors.com/2021/09/09/vmware-fusion-for-m1-macs-private-tech-preview/","date":1631199118000,"content":"VMware Fusion is now available as a private tech preview for M1 Macs, with users able to request access <a href=\"https://vmw.re/fusion-tp-request\">through an online form</a>. A public tech preview will follow in around two weeks, according to <a href=\"https://twitter.com/mikeroySoft/status/1435710030389547012\">a tweet from VMware Fusion manager Michael Roy</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/VMWare-Apple-Silicon-Feature.jpg\" />\r\n<br />\r\nVMware Fusion for M1 Macs will be quite limited in scope, with a focus on virtualizing Arm-based Linux distributions. VMware Fusion will not officially support Windows 10 on M1 Macs at launch, as Microsoft has yet to offer licensing for the Arm version of Windows 10. In a tweet, Roy said Windows 10 should still run when selecting the \"other\" operating system type, but VMware will not be shipping drivers or VMware Tools.\r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>Just so we're clear... our intentional decision to not fully support Windows is _entirely_ driven by the fact you can't actually run Windows on ARM on a Mac and still be in compliance with their EULA.<br /><br />We also ship components as open source, and that takes more time.</p>— Michael Roy (@mikeroySoft) <a href=\"https://twitter.com/mikeroySoft/status/1436020270175690769?ref_src=twsrc%5Etfw\">September 9, 2021</a></blockquote> </div>\r\n<br />\r\nVMware Fusion will also not be able to virtualize Intel-based Windows or Linux distributions, while support for virtualizing macOS is not ready yet. In a <a href=\"https://blogs.vmware.com/teamfusion/2021/04/fusion-on-apple-silicon-progress-update.html\">blog post last April</a>, Roy said \"there isn't exactly much business value relative to the engineering effort that is required\" to support Intel-based operating systems on M1 Macs, adding that VMware is \"laser focused on making Arm Linux VMs on Apple silicon a delight to use.\"\r\n<br />\r\n\r\n<br />\r\nMicrosoft does not yet offer a retail version of Arm-based Windows, but a preview version is <a href=\"https://www.microsoft.com/en-us/software-download/windowsinsiderpreviewARM64\">available to Windows Insider program members</a>. Earlier this year, VMware competitor Parallels boasted about the <a href=\"https://www.macrumors.com/2021/04/14/parallels-desktop-native-m1-support/\">ability to run the Arm-based Windows preview on an M1 Mac</a> with Parallels Desktop 16.5, but fine print notes that customers are responsible for making sure they are compliant with an operating system's licensing agreement.\r\n<br />\r\n\r\n<br />\r\nNo timeframe has been provided for the public release of VMware Fusion for M1 Macs, and pricing and upgrade options remain to be seen.<div>Tag: <a href=\"https://www.macrumors.com/guide/vmware/\">VMware</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/09/vmware-fusion-for-m1-macs-private-tech-preview/\">VMware Fusion for M1 Macs Now Available as Private Tech Preview</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/vmware-fusion-for-m1-macs-now-available-as-private-tech-preview.2310183/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=oQAjKLjD9Xg:soW3VF_9Iyk:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=oQAjKLjD9Xg:soW3VF_9Iyk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/oQAjKLjD9Xg\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2a4fec4d989e787ad784027a3165e3e663a1fb31139e256899184fe098f5ffc7","category":"Apple"}