{"title":"Chitosan/Perlite System as a Microbial Carrier in Anaerobic Digestion of Food Waste: Characteristics and Impact of the Additive Materials","link":"https://www.preprints.org/manuscript/202406.0813/v1","date":1718187559000,"content":"The article aims to present the results of research on anaerobic digestion (AD) of waste wafers (WF - control) and co-substrate system - waste wafers and cheese (WFC - control), combined \nwith digested sewage sludge. The aim of the study was to evaluate the physicochemical parameters of the chitosan/perlite (Ch/P; 3:1) carrier material and to verify its effect on the directions of change of the bacterial microbiome, removal kinetics of organic matter and AD process efficiency. The experiment was conducted in a laboratory, in a periodical mode of operation of bioreactors, under mesophilic conditions. The results of analyses of morphological-dispersive, spectroscopic, adsorption, thermal and microbiological properties confirmed that the tested carrier material can be an excellent option to implement in biotechnological processes, especially in anaerobic digestion. The microstructural properties of the carrier were influenced by both components: perlite determined the development of the specific surface area, while chitosan shaped the porosity of the system. The thermal properties were determined by the less heat-resistant component, present in a threefold higher weight proportion, i.e. chitosan. The evaluation of quantitative and qualitative changes in the genetic diversity of bacterial communities, carried out using Next Generation Sequencing (NGS), showed that the material has a modifying effect on the bacterial microbiome. Amount of bacteria from phyla Actinobacteria, Bacteroidetes, Campilobacterota, Chloroflexi, Euryarchaeota, Planctomycetes, and Proteobacteria decreased while Firmicutes, Synergistetes, and Thermotogae increased during the course of the experiment. The shapes of the FT-IR spectra indicated a dependence of the degradation rate on both the presence of the carrier and the cosubstrate system. Monitoring of the course of AD was carried out by measuring key parameters for the stability of the process: pH, VFA and VFA/TA ratio (volatile fatty acids/total alkalinity). As a result, an increase in the volume of biogas/methane produced, under the influence of the carrier, was recorded for WF-control by 12.05% and for WFC-control by 19.16%. The volume of methane for the WF-control increased from 351.72 m3 Mg-1 VS to 411.14 m3 Mg-1 VS, while for the cosubstrate sample it increased from 476.84 m3 Mg-1 VS to 518.08 m3 Mg-1 VS, confirming the validity of combining the respective cosubstrate with microbial carrier in anaerobic bioreactor.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2a5891686ec527d2ddce45662f5aa91ae82df77076b341cafa411b813630dd31","category":"Interdisciplinary"}