{"title":"Functional diversity of snake locomotor behaviors: A review of the biological literature for bioinspiration","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15109?af=R","date":1710223255000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/1dfb4157-5336-43cf-bbb2-a97cb686b6ff/nyas15109-gra-0001-m.png\" alt=\"Functional diversity of snake locomotor behaviors: A review of the biological literature for bioinspiration\" /><p>Snakes inhabit nearly every imaginable terrestrial environment, moving with ease under many conditions that would thwart other animals. Several facets of their functional diversity could have applications for bioinspired design. Here, we review snake locomotor behavior with a focus on biomechanics and environmental context, and then discuss the musculoskeletal and skin features that enable their high proficiency in so many locomotor modes.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Organismal solutions to natural challenges can spark creative engineering applications. However, most engineers are not experts in organismal biology, creating a potential barrier to maximally effective bioinspired design. In this review, we aim to reduce that barrier with respect to a group of organisms that hold particular promise for a variety of applications: snakes. Representing &gt;10% of tetrapod vertebrates, snakes inhabit nearly every imaginable terrestrial environment, moving with ease under many conditions that would thwart other animals. To do so, they employ over a dozen different types of locomotion (perhaps well over). Lacking limbs, they have evolved axial musculoskeletal features that enable their vast functional diversity, which can vary across species. Different species also have various skin features that provide numerous functional benefits, including frictional anisotropy or isotropy (as their locomotor habits demand), waterproofing, dirt shedding, antimicrobial properties, structural colors, and wear resistance. Snakes clearly have much to offer to the fields of robotics and materials science. We aim for this review to increase knowledge of snake functional diversity by facilitating access to the relevant literature.</p>","author":"Jessica L. Tingle, \nKelsey L. Garner, \nHenry C. Astley","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"2a5ae640398b81102e3e15aa1d36ac65fd291cba96fe07f43ef654c211897480","category":"Environment"}