{"title":"Experiences of children’s self-wetting (including urinary incontinence) in Cox’s Bazar’s Rohingya refugee camps, Bangladesh","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002362","date":1709820000000,"content":"<p>by Mahbub-Ul Alam, Sudipta Das Gupta, Claire Rosato-Scott, Dewan Muhammad Shoaib, Asmaul Husna Ritu, Rifat Nowshin, Md Assaduzzaman Rahat, Nowshad Akram, Joanne Rose, Barbara E. Evans, Dani J. Barrington</p>\r\n\r\nSelf-wetting is the leakage of urine, either due to the medical condition of urinary incontinence (UI), or because a person does not want to, or cannot, access a toileting facility in time. This study explored the attitudes towards self-wetting and experiences of children (aged five to 11), their caregivers, community leaders and humanitarian practitioners in the Rohingya refugee camps in Cox’s Bazar, Bangladesh. We particularly focused on how water, sanitation and hygiene (WASH) and protection interventions might assist in improving these experiences. We purposively selected participants from two camps where our partner organisation works. We conducted Key Informant Interviews (KIIs) with community leaders and camp officials, Story Book (SB) sessions with Rohingya children and in-depth Interviews (IDIs) with caregivers of children who participated in the SB sessions, as well as surveying communal toilets. Self-wetting by children was common and resulted in them feeling embarrassed, upset and uncomfortable, and frightened to use the toilet at night; many children also indicated that they would be punished by their caregivers for self-wetting. Key informants indicated that caregivers have difficulty handling children’s self-wetting due to a limited amount of clothing, pillows, and blankets, and difficulty cleaning these items. It was evident that the available toilets are often not appropriate and/or accessible for children. Children in the Rohingya camps appear to self-wet due to both the medical condition of UI and because the sanitation facilities are inappropriate. They are teased by their peers and punished by their caregivers. Although WASH and protection practitioners are unable to drastically alter camp conditions or treat UI, the lives of children who self-wet in these camps could likely be improved by increasing awareness on self-wetting to decrease stigma and ease the concerns of caregivers, increasing the number of child-friendly toilets and increasing the provision of continence management materials.","author":"Mahbub-Ul Alam","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"2a62c944cf5625a3947cb2524e3eab56d1c6bd096b6976a6cbf17f577cc21d8f","category":"Environment"}