{"title":"Toward an ecologically realistic experimental system to investigate the multigenerational effects of ocean warming and acidification on benthic invertebrates","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10630?af=R","date":1721201331000,"content":"<h2>Abstract</h2>\n<p>Human activities over the past 150 yr have led to significant carbon dioxide (CO<sub>2</sub>) emissions, causing global warming and ocean acidification. Surface ocean temperature has risen by 0.93°C since 1850, with projections of an additional +1.42°C to 3.47°C by 2080–2099. Ocean acidification, driven by CO<sub>2</sub> absorption, has already lowered seawater pH by 0.1 units, affecting calcifying organisms, including shelled mollusks. Long-term multigenerational studies on mollusk responses to both ocean acidification and warming, under realistic environmental conditions, are scarce. To address this knowledge gap, two mobile experimental units that can be deployed at the vicinity of shellfish farming areas were developed within the framework of the CocoriCO<sub>2</sub> project. The experimental systems were designed to manipulate temperature and pH as offsets from ambient conditions. The experimental units have shown their effectiveness in terms of controlling and maintaining pH and temperature to assess the multigenerational effects of ocean warming and acidification on benthic invertebrates. Finally, the developed experimental systems can be modified easily to provide an educated assessment of the impact of other relevant environmental changes such as deoxygenation and changes in salinity.</p>","author":"Frédéric Gazeau, \nPierre Urrutti, \nAlexandre Dousset, \nNicolas Brodu, \nMarion Richard, \nRémi Villeneuve, \nÉric Pruvost, \nSteeve Comeau, \nHugo Koechlin, \nFabrice Pernet","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"2a6406963bd1afbc91830f96d738d5a6aea71305933fc9339960cecb984eefdd","category":"Environment"}