{"title":"Cell wall integrity modulates HOOKLESS1 and PHYTOCHROME INTERACTING FACTOR4 expression controlling apical hook formation","link":"https://academic.oup.com/plphys/article/196/2/1562/7709393?rss=1","date":1720396800000,"content":"<span><div>Abstract</div>Formation of the apical hook in etiolated dicot seedlings results from differential growth in the hypocotyl apex and is tightly controlled by environmental cues and hormones, among which auxin and gibberellins (GAs) play an important role. Cell expansion is tightly regulated by the cell wall, but whether and how feedback from this structure contributes to hook development are still unclear. Here, we show that etiolated seedlings of the Arabidopsis (<span>Arabidopsis thaliana</span>) <span>quasimodo2-1</span> (<span>qua2</span>) mutant, defective in pectin biosynthesis, display severe defects in apical hook formation and maintenance, accompanied by loss of asymmetric auxin maxima and differential cell expansion. Moreover, <span>qua2</span> seedlings show reduced expression of <span>HOOKLESS1</span> (<span>HLS1</span>) and <span>PHYTOCHROME INTERACTING FACTOR4</span> (<span>PIF4</span>), which are positive regulators of hook formation. Treatment of wild-type seedlings with the cellulose inhibitor isoxaben (isx) also prevents hook development and represses <span>HLS1</span> and <span>PIF4</span> expression. Exogenous GAs, loss of DELLA proteins, or <span>HLS1</span> overexpression partially restore hook development in <span>qua2</span> and isx-treated seedlings. Interestingly, increased agar concentration in the medium restores, both in <span>qua2</span> and isx-treated seedlings, hook formation, asymmetric auxin maxima, and <span>PIF4</span> and <span>HLS1</span> expression. Analyses of plants expressing a Förster resonance energy transfer-based GA sensor indicate that isx reduces accumulation of GAs in the apical hook region in a turgor-dependent manner. Lack of the cell wall integrity sensor THESEUS 1, which modulates turgor loss point, restores hook formation in <span>qua2</span> and isx-treated seedlings. We propose that turgor-dependent signals link changes in cell wall integrity to the PIF4-HLS1 signaling module to control differential cell elongation during hook formation.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"2a6bc2a805bf0d315f86517f4e4561ef8a254ed38b02604180cdf14079a8cf7d","category":"Environment"}