{"title":"[ลือ] iPhone SE4 คาดใช้ดีไซน์เดียวกับ iPhone 14 เพิ่ม Action Button และ USB-C","link":"https://www.blognone.com/node/135973","date":1695889597000,"content":"<div><div><div><p>ข่าวลือนี้มาจากเว็บไซต์ MracRumors ที่นำเสนอข่าวลือข่าวหลุดของสินค้า Apple เป็นประจำ คราวนี้ถึงคิวของ iPhone SE4 ที่จะเปลี่ยนทั้งดีไซน์ และ ฮาร์ดแวร์ หลังจากที่ใช้ดีไซน์ของ iPhone 8 มาถึง 2 รุ่น</p>\n<p>‌iPhone SE‌ 4 เป็นที่รู้จักภายในชื่อโค้ดเนม Ghost คาดว่าจะได้รับการออกแบบใหม่ที่โดยใช้ iPhone 14 เป็นพื้นฐาน แต่จะมีการเปลี่ยนแปลง 2 อย่าง ได้แก่ Action Button และพอร์ต USB-C</p>\n<p>สำหรับด้านหลังของ ‌iPhone SE‌4 จะมีกล้องตัวเดียวที่มีแฟลชจัดเรียงในลักษณะคล้ายกับ ‌iPhone SE‌ รุ่นที่ 3 ซึ่งคาดว่าจะใช้เซนเซอร์ความละเอียด 48MP อย่างไรก็ตาม การออกแบบของโมดูลกล้องยังไม่ชัดเจนว่าจะออกมาเป็นแบบใด แต่ Apple แบ่งการดีไซน์กล้องหลังออกเป็น 2 ประเภทได้แก่</p>\n<ul>\n<li>กล้อง และแฟลชรวมอยู่ในก้อนเดียวกันในรูปทรงสี่เหลี่ยมผืนผ้า</li>\n<li>มีเฉพาะวงแหวนกล้องที่นูนขึ้นมาจากพื้นผิวหลังเครื่อง</li>\n</ul>\n<p>สำหรับ‌หน้าจอ iPhone SE‌ 4 อาจได้จอ OLED แบบเดียวกับ ‌iPhone 14‌ โดยจะไม่มีปุ่ม Home และ Touch ID แต่จะมี Face ID มาให้แทน เพราะมีการอ้างอิงหลายครั้งถึง Pearl ซึ่งเป็นชื่อรหัสภายในของ Apple สำหรับ Face ID‌ และฮาร์ดแวร์ที่เกี่ยวข้อง ซึ่งถูกพบว่าเกี่ยวข้องกับ ‌iPhone SE‌ รุ่นที่ 4</p>\n<p>ส่วนโมเด็ม 5G รอบนี้ Apple อาจจะใช้ชิปตัวเอง มีชื่อรหัสว่า Sinope และใช้ใน iPhone SE‌4 เพื่อทดสอบฮาร์ดแวร์ใหม่ ซึ่งเดิมทีโมเด็มใหม่นี้ Apple ตั้งใจจะเปิดตัวพร้อมกับกลุ่มผลิตภัณฑ์ iPhone 16 แต่ทาง <a href=\"https://www.blognone.com/node/135676\">Qualcomm เพิ่งออกแถลงการณ์ระบุว่าบริษัทจะจัดหาโมเด็มสมาร์ทโฟนให้กับ Apple จนถึงปี 2026</a></p>\n<p>ข้อมูลที่นำเสนอนี้เป็นเพียงข้อมูลเบื้องต้นก่อนการผลิต ‌iPhone SE‌ รุ่นที่ 4 ที่ยังอยู่ในช่วงเริ่มต้นของกระบวนการพัฒนา และมีการเปลี่ยนแปลงได้เสมอ ซึ่งข้อมูลนี้อาจไม่สอดคล้องกับตัวสินค้าเมื่อเปิดตัวก็เป็นได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b2ebf96188a66fb4ab09d84fce0c2eca.png\" /></p>\n<p>ที่มา - <a href=\"https://www.macrumors.com/2023/09/27/iphone-se-4-details/\">MacRumors</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/iphone-se\">iPhone SE</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/iphone\">iPhone</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2a6bf50b62a4c639c1e5f95fc4378cf609d672884dbe833d5602ebfcb50b1542","category":"Thai"}