{"title":"Production networks and resilience: How dense production networks shield economies in financial crisis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302012","date":1713362400000,"content":"<p>by Petre Caraiani, Alina Mihaela Dima, Cristian Păun, Tănase Stamule, Madalina Vanesa Vargas</p>\r\n\r\nThe research delves into the underexplored area of how production network structures influence the severity of economic downturns, particularly during the last financial crisis. Utilizing the RSTAN database from the OECD, we meticulously derived critical measures from the input-output matrices for 61 economies. Our methodology entailed a panel analysis spanning from 2008 to 2010, which is a period marked by significant recessionary pressures. This analysis aimed to correlate economic performance with various production network metrics, taking into account control factors such as interest rates and the prevalence of service sectors. The findings reveal a noteworthy positive correlation between the density of production networks and economic resilience during the crisis, which remained consistent across multiple model specifications. Conversely, as anticipated, higher interest rates were linked to poorer economic performance, highlighting the critical interplay between monetary policy and economic outcomes during periods of financial instability. Given these insights, we propose a policy recommendation emphasizing the strategic enhancement of production network density as a potential buffer against economic downturns. This approach suggests that policymakers should consider the structural aspects of production networks in designing economic stability and growth strategies, thus potentially mitigating the impacts of future financial crises.","author":"Petre Caraiani","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2a6cc8a0396dfe8ae3e808e177886f206b763b58cb11e2c7e03fe08697ba6411","category":"Interdisciplinary"}