{"title":"Growth enhancement, metabolic profile improvement, and DXR and TPS2 gene expression changes in Thymus vulgaris L. by cyanobacterial inoculation","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13404?af=R","date":1709727840000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>In recent decades cyanobacterial species have attracted research attention as potential sources of new biostimulants. In this study, the biostimulant effects of five cyanobacterial suspensions on the growth and essential oil composition of <i>Thymus vulgaris</i> L. were evaluated. The expression of key genes involved in the biosynthesis of thymol and carvacrol, such as <i>DXR</i> and <i>TPS2</i>, were investigated.</p>\n<h2>RESULTS</h2>\n<p>A pot culture experiment revealed that cyanobacterial application significantly improved <i>T. vulgaris</i> L. growth indices, including plant height, dry and fresh weight, leaf and flower number, leaf area, and photosynthetic pigment content. Total phenol and flavonoid content in inoculated plants also showed a significant increase compared with the control. <i>Anabaena torulosa</i> ISB213 inoculation significantly increased root and shoot biomass by about 65.38% and 92.98% compared with the control, respectively. <i>Nostoc calcicola</i> ISB215 inoculation resulted in the highest amount of essential oil accumulation (18.08 ± 0.62) in <i>T. vulgaris</i> leaves, by about 72.19% compared with the control (10.5 ± 0.50%). Interestingly, the amount of limonene in the <i>Nostoc ellipsosporum</i> ISB217 treatment (1.67%) increased significantly compared with the control and other treatments. The highest expression rates of <i>DXR</i> and <i>TPS2</i> genes were observed in the treatment of <i>N. ellipsosporum</i> ISB217, with 5.92-fold and 5.22-fold increases over the control, respectively.</p>\n<h2>CONCLUSION</h2>\n<p>This research revealed the potential of the cyanobacteria that were studied as promising biostimulants to increase the production of biomass and secondary metabolites of <i>T. vulgaris</i> L., which could be a suitable alternative to chemical fertilizers. © 2024 Society of Chemical Industry.</p>","author":"Nasim Rasuli, \nHossein Riahi, \nZeinab Shariatmadari, \nMajid Ghorbani Nohooji, \nAli Dehestani, \nPooyan MehrabanJoubani","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"2a7aa64433dac688049e8425c7b02cf9b754e412f542d9c5df64fa91f57ddb7c","category":"Environment"}