{"title":"Structural and rheological characterization of water‐soluble and alkaline‐soluble fibers from hulless barley","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13182?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Highland hulless barley has garnered attention as a promising economic product and a potential healthy food ingredient. The present study aimed to comprehensively investigate the molecular structure of extractable fibers obtained from a specific highland hulless barley. Water-soluble fiber (WSF) and alkaline-soluble fiber (ASF) were extracted using enzymatic digestion and an alkaline method, respectively. The purified fibers underwent a thorough investigation for their structural characterization.</p>\n<h2>RESULTS</h2>\n<p>The monosaccharide composition revealed that WSF primarily consisted of glucose (91.7%), whereas ASF was composed of arabinose (54.5%) and xylose (45.5%), indicating the presence of an arabinoxylan molecule with an A/X ratio of 1.2. The refined structural information was further confirmed through methylation, <sup>1</sup>H NMR and Fourier-transform infrared spectroscopy analyses. WSF fiber exclusively exhibited α-anomeric patterns, suggesting it was an α-glucan. It has a low molecular weight of 5 kDa, as determined by gel permeation chromatography. Conversely, ASF was identified as a heavily branched arabinoxylan with 41.55% of ‘→2,3,4)-Xyl<i>p</i>-(1→’ linkages. ASF and WSF exhibited notable differences in their morphology, water absorption capabilities and rheological properties.</p>\n<h2>CONCLUSION</h2>\n<p>Based on these findings, molecular models of WSF and ASF were proposed. The deep characterization of these fiber structures provides valuable insights into their physicochemical and functional properties, thereby unlocking their potential applications in the food industry. © 2023 Society of Chemical Industry.</p>","author":"Yuting Xu, \nXiaoning Liu, \nMengting Ma, \nMingming Wang, \nWeifeng Hua, \nTianming Yao, \nZhongquan Sui","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"2a8083107fd4c62667ac458b5dc8e195f2cfdd25fefa3379959334aa58550a39","category":"Environment"}