{"title":"Tissue Distribution and Nutritional Regulation of Four Cholesterol Transport‐Related Genes in Tiger Puffer (Takifugu rubripes)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/5615712?af=R","date":1706774400000,"content":"<p>This study characterized four cholesterol transport-related genes, namely, <i>lcat</i>, <i>acat1</i>, <i>acat2</i>, and <i>mttp</i>, in juvenile tiger puffer in terms of tissue distribution (eye, heart, brain, skin, liver, spleen, muscle, and intestine) and nutritional regulation. Three feeding trials were conducted: (i) using diets with different cholesterol levels (0.11%, 0.65%, 1.10%, 2.32%, and 4.59% of dry matter); (ii) using diets with different lipid levels (8.05%, 12.02%, and 16.36% of dry matter); and (iii) a 1-month starvation experiment with different sampling times (Days 1, 4, 9, 16, and 31). The <i>lcat</i>, <i>acat1</i>, and <i>acat2</i> were the most abundantly expressed in the liver, while <i>mttp</i> was the most abundantly expressed in the intestine. The <i>lcat</i> had a medium expression level in the muscle and skin but the lowest expression level in the spleen and intestine. The <i>acat1</i> and <i>acat2</i> had similar tissue distribution patterns, except that <i>acat2</i> had a lower expression level in the heart but a higher level in the intestine than <i>acat1</i>. The <i>mttp</i> had medium expression levels in the liver and spleen but had the lowest level in the eye and skin. Different dietary cholesterol levels did not significantly affect the expression of these cholesterol transport genes in the liver and intestine, except that higher cholesterol levels (1.10%–4.59%) significantly downregulated the <i>acat2</i> expression in the liver. Dietary lipid levels also had a mild influence on the hepatic expression of these genes, except that the diet with 12.02% lipid resulted in significantly higher <i>acat1</i> expression than the one with 16.36% lipid. The starvation time significantly affected the hepatic expression of these genes. Long-term starvation (16 and 31 days) generally upregulated the hepatic gene expression of <i>lcat</i>, <i>acat1</i>, and <i>mttp</i> but generally downregulated that of <i>acat2</i>. This study provided preliminary knowledge about the tissue distribution and nutritional regulation of cholesterol transport-related genes in marine teleost.</p>","author":"Haiyan Xiong, \nZiling Song, \nYanjiao Zhang, \nXiaoxue Meng, \nZhangbin Liao, \nQiang Ma, \nYuliang Wei, \nMengqing Liang, \nHouguo Xu, \nUmit Acar","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"2a88fe89e71fa931b8ae47c4f9e6b40ed459c6e8f2a3a2c5f0ba50aea48bbfec","category":"Environment"}