{"title":"Mysteriously rapid rise in Legionnaires’ disease incidence correlates with declining atmospheric sulfur dioxide","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae085/7624911?rss=1","date":1710201600000,"content":"<span><div>Abstract</div>Legionnaires’ disease (LD) is a severe form of pneumonia (∼10–25% fatality rate) caused by inhalation of aerosols containing <span>Legionella</span>, a pathogenic gram-negative bacteria. These bacteria can grow, spread, and aerosolize through building water systems. A recent dramatic increase in LD incidence has been observed globally, with a 9-fold increase in the United States from 2000 to 2018, and with disproportionately higher burden for socioeconomically vulnerable subgroups. Despite the focus of decades of research since the infamous 1976 outbreak, substantial knowledge gaps remain with regard to source of exposure and the reason(s) for the dramatic increase in LD incidence. Here, we rule out factors indicated in literature to contribute to its long-term increases and identify a hitherto unexplored explanatory factor. We also provide an epidemiological demonstration that the occurrence of LD is linked with exposure to cooling towers (CTs). Our results suggest that declining sulfur dioxide air pollution, which has many well-established health benefits, results in reduced acidity of aerosols emitted from CTs, which may prolong the survival duration of <span>Legionella</span> in contaminated CT droplets and contribute to the increase in LD incidence. Mechanistically associating decreasing aerosol acidity with this respiratory disease has implications for better understanding its transmission, predicting future risks, and informed design of preventive and interventional strategies that consider the complex impacts of continued sulfur dioxide changes.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"2aa380d69295225392243f4a46d463b9e28791e9123018d69339bf01dfd7c27a","category":"Interdisciplinary"}