{"title":"PSVIII-20 Identification of functional INDELS responsible for alternative splicing in acute stress responders grazing sheep exposed to gastrointestinal nematode infection","link":"https://academic.oup.com/jas/article/102/Supplement_3/595/7757689?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Gastrointestinal nematodes (GINs) are a major constraint to the sheep industry. Infected animals can develop clinical signs, like anemia, hypoproteinemia, diarrhea, and in extreme cases death. The misuse of anthelmintics to treat infected animals has led to the development of GIN resistance making necessary the integration of different approaches to reduce the impact of GINs on the sheep industry. The application of transcriptomics using RNA-Sequencing technology to better understand the underlying genetic mechanisms of resistance to GIN can help accelerate the genetic gain. This study aimed to identify insertion and deletions (INDELs) responsible for alternative splicing in Rideau x Dorset crossbred sheep with different immune profiles under natural exposure to gastrointestinal nematodes using RNA-Sequencing. High (H) and medium (M) acute stress responders with the highest and lowest worm burden, after natural exposure to GIN, were selected for liver RNA extraction (H; n = 5 and M; n = 6). In addition, GIN-unexposed lambs (U; n = 4) were used as immunological controls. Quality control analyses were performed on fastq files using the CLC Bio Genomics workbench software including the guanine-cytosine (GC) content, ambiguous base content, Phred score, base coverage, nucleotide contributions, and over-represented sequence parameters. Pair-end sequence reads were aligned to the annotated Oar_rambouillet_v.2.0 ovine reference genome. After that, variant discovery analysis and functional consequence analysis were performed using CLC Bio Genomics workbench software to identify INDELs leading to amino acid changes and splice site events (SSEs). Genes associated with the list of INDELs leading to SSE were recovered from Ensembl BioMart. Unique INDELs with SSEs for H, M, and U groups (162, 244, and 161, respectively) and shared (372) among groups were identified. Among them, 4 INDELS with SSE uniquely identified in the M group were located within the NLRC5, SIGLEC1, CFD, and STAT6 genes related to the immune system. Significant enriched metabolic pathways (FDR&lt; 0.05) were identified using the list of genes with INDELs that led to SSEs unique for each group and shared among groups using Reactome. Metabolic pathways related to the immune system response such as cross-presentation of soluble exogenous antigens (endosomes) and NIK noncanonical NF-kB signaling pathways were identified in the M group. These results can help to better understand the mechanisms responsible for the immune response of sheep to GIN.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2ab4fa1d63f2914b5978de7ac9e6d9967bceb3060c948c891c8006514418f44d","category":"Environment"}