{"title":"Diverse Orbital‐Scale Variations of Precipitation Oxygen Isotopes in the Northern Hemisphere Mid‐Latitudes: A Comparative Study Between East Asia and North America","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024PA004914?af=R","date":1721190249000,"content":"<h2>Abstract</h2>\n<p>The oxygen isotope (δ<sup>18</sup>O) records of paleo-precipitation contain abundant information on past climate changes. Nevertheless, at the orbital scale, our current understanding about the characteristics and mechanisms of precipitation oxygen isotope (δ<sup>18</sup>O<sub>p</sub>) variations in the Northern Hemisphere (NH) mid-latitudes remains limited due to the lack of abundant long-term geological records. In this study, based on a 300-ka transient simulation involving stable isotope fractionation processes, we systematically analyzed the characteristics of the orbital-scale δ<sup>18</sup>O<sub>p</sub> variations and their potential mechanisms, especially in two representative regions: mid-latitude East Asia (MEA) and mid-latitude North America (MNA) located in the Eastern and Western Hemispheres respectively. Our findings reveal that the MEA δ<sup>18</sup>O<sub>p</sub> is dominated by a 23-ka cycle, ultimately driven by the precession-induced insolation variation; while the MNA δ<sup>18</sup>O<sub>p</sub> primarily exhibits a 100-ka glacial-interglacial cycle and is eventually governed by the ice volume forcing. The δ<sup>18</sup>O<sub>p</sub> changes in these two regions not only present diverse dominant cycles and forcing factors, but also involve distinct physical processes. In MEA, water vapor transport by the westerly circulation during the rainy season (May–August) is the key process linking the April–July boreal insolation with the annual/rainy-season δ<sup>18</sup>O<sub>p</sub> variations. In contrast, the annual δ<sup>18</sup>O<sub>p</sub> changes in MNA mainly depend on the water vapor transport processes triggered by the expansion and retreat of the North American ice sheet, albeit with certain influence of the temperature effect as well. These results suggest that the dominant periodicities and forcing mechanisms of the orbital-scale δ<sup>18</sup>O<sub>p</sub> variations across the NH mid-latitudes are complex and varied.</p>","author":"Yuanyuan Li, \nXiaodong Liu, \nXiaoxun Xie, \nZhi‐Yong Yin","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"2ab9e3bca45abbca517cdbf08dab9b1cb4204663d2d9888f28237d52b0ac50c7","category":"Environment"}