{"title":"Quantitative Electron Microscopy of Zeolites Using Aberration Corrected (S)TEM and Machine Learning","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.179/7719508?rss=1","date":1721779200000,"content":"<span>Due to their porous frameworks, zeolites can function as molecular sieves and have a number of industrial applications. The presence of intergrowth defects between different zeolite topologies can strongly affect their material properties [<a href=\"#ozae044.179-B1\">1</a>]. For instance, both ZSM-5 and the ZSM-5/ZSM-11 intergrowth can be used to catalyze the production of ethylbenzene, <span>via</span> the alkylation of benzene. It has been shown that the ZSM-5/ZSM-11 intergrowth is the superior catalyst of these two, with higher alkylation and catalytic stability compared to pure ZSM-5, which deactivates much faster [<a href=\"#ozae044.179-B2\">2</a>]. This is attributed to the active sites of the ZSM-5/ZSM-11 intergrowth being more resistant to poisoning by impurities in the reaction mixture. It has also been shown that in the single catalytic reduction of NOx, the AlPO-18/chabazite intergrowth exhibited greater NOx and N<sub>2</sub>O selectivity as a catalyst than pure chabazite when aged, which was attributed to superior hydrothermal stability [<a href=\"#ozae044.179-B3\">3</a>]. ZSM-5 and ZSM-11 correspond to structure codes MFI and to MEL, whereas AlPO-18 and chabazite correspond to structure codes AEI and CHA. Moving forward, this paper will use these codes when referring to the relevant zeolites. These examples illustrate how the presence of intergrowth defects affect the material properties of zeolites, which in turn impacts industrial catalytic applications. The ability to quantify how zeolite material properties are affected by intergrowth defects, by measuring relevant statistical data in intergrowth structures, may lead to new insights that influence the development of improved and higher-performance catalysts. Examples of such statistical data may include zeolite pore sizing distributions, the location and extent of different types of zeolite active sites and data that leads to the complete characterization of three-dimensional intergrowth structures.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"2abcda876d1efeb9bd8519e8b9c7801652f6af4c0704016df50a7fbf575789df","category":"Environment"}