{"title":"The electric Ford Mustang Mach-E GT finally lives up to its famous name","link":"https://arstechnica.com/?p=1802692","date":1633946434000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Ford-Mustang-Mach-E-GT-1-800x600.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Ford-Mustang-Mach-E-GT-1.jpg\">Enlarge</a> <span>/</span> Cyber Orange Metallic paint is one of the colors exclusive to the Mustang Mach-E GT. You'll also notice new styling at the front. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Ford provided flights to San Francisco and a night in a hotel so we could drive the Mustang Mach-E GT and Mustang Mach-E GT Performance Edition. Ars does not accept paid editorial content.</aside>\n<p>SAUSALITO, Calif.—In the grand scheme of things, the names that automakers give their cars aren't really important. And yet, almost two years after <a href=\"https://arstechnica.com/cars/2019/11/heres-everything-we-know-about-the-electric-ford-mustang-mach-e/\">it was first revealed</a>, some people are still upset that Ford decided to call its new electric crossover the Mustang Mach-E. It probably didn't help that Ford focused its attention on the longer-range Mach-E at first rather than a car that would live up to the image of the Mustang as the people's sports car.</p>\n<p>I'm not entirely unsympathetic to that argument. <a href=\"https://arstechnica.com/cars/2021/02/ford-mustang-mach-e-review-the-peoples-pony-goes-electric/\">When we tested a Mach-E in February</a>, I found it a competent electric vehicle, but it wasn't much fun. Using the Mustang name to take advantage of brand recognition is all well and good, but only if it doesn't dilute that name past any point of meaning. A Mustang is a wild horse, after all.</p>\n<p>Well, Ford has rectified that with the arrival of the $59,900 Mustang Mach-E GT. The concept is similar to the first Mustang GT back in 1965. More power, better tires, and seats that hold you in place, plus some styling tweaks—just don't crash it leaving <em>Coffee and Cars</em>.</p></div><p><a href=\"https://arstechnica.com/?p=1802692#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1802692&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2abcff42ff73973ab1484ca4237eadfb1c67b34f092ff5025d73f3c56f92108f","category":"Tech"}