{"title":"Investigation of dietary exogenous protease and humic substance on growth, disease resistance to Flavobacterium covae and immune responses in juvenile channel catfish (Ictalurus punctatus)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13835?af=R","date":1689577200000,"content":"<h2>Abstract</h2>\n<p>Many bacterial pathogens impact the US catfish industry, and disease control can be challenging for producers. Columnaris disease in channel catfish, <i>Ictalurus punctatus</i>, is primarily caused by <i>Flavobacterium covae</i> (formerly <i>F. columnare</i>). Immunostimulants may enhance nonspecific immune responses and offer an alternative to antibiotic treatments in catfish. Furthermore, dietary protein sources and inclusions are also essential to fish health and nutrition and may enhance overall fish performance in pond culture. The current project evaluated two immunostimulants: a protease complex (PC) and a humic substance (HS) derived from a reed-sedge peat product. A 60-day trial examined the effects of five diets on growth performance, immune response and resistance to experimental <i>F. covae</i> infection in channel catfish. Diets included a high-quality fishmeal diet (32%; CF32), a high-protein soy-based diet (32%; C32), a low-protein soy-based diet (28%; C28; predominately used in industry), a low-protein soy diet supplemented with C28 + PC at 175 g metric ton<sup>−1</sup> and C28 + HS in a low-protein diet at 23 g metric ton<sup>−1</sup>. Following feeding for 60 d, juvenile channel catfish were sampled for growth performance and baseline health indicators (<i>n</i> = 3; body mucus, blood for sera, kidney and spleen). A subset of fish was then subjected to an immersion-based in vivo challenge trial with <i>F. covae</i> (ALG-00-530; 10<sup>6</sup> CFU mL<sup>−1</sup> exposure). At 60d post-initiation, there were no dietary differences in the relative growth rate (<i>p</i> = .063) or thermal growth coefficient (<i>p</i> = .055), but the 32% diets generally appeared to perform best. Post-challenge, the C32 group's mortality was higher than the C28 + PC (<i>p =</i> .006) and C28 + HS diets (<i>p =</i> .005). Although not significant, the C28 and CF32 groups also demonstrated higher mortality compared to both PC and HS diets. Sera lysozyme concentration was found to increase following pathogen challenge (<i>p</i> &lt; .001) and in comparison with mock-challenged catfish (<i>p</i> &lt; .001). Elevated expression levels of proinflammatory cytokines (<i>il-1β</i>, <i>il-8</i>, <i>tnf-α</i> and <i>tgf-β</i>) were observed at trial midpoint and post-infection when compared to 60d. The C28 treatment was found to have lower <i>tnf-α</i> expression than the C28 + PC (<i>p</i> = .042) and C28 + HS (<i>p</i> = .042) groups following exposure to <i>F. covae</i>. These challenge data suggest that the immunostimulants (PC and HS) in plant-based protein may be beneficial in protecting against <i>F. covae</i> when offered in low-protein channel catfish diets.</p>","author":"Abdulmalik A. Oladipupo, \nAnita M. Kelly, \nD. Allen Davis, \nTimothy J. Bruce","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"2ac308529923da9da730f8a65f53d59084630b09dce6a15a7b91c4819c432209","category":"Environment"}