{"title":"ProtonMail ยอมรับ ส่งข้อมูลผู้ใช้ให้รัฐบาลสวิตเซอร์แลนด์ ตามอำนาจกฎหมายสวิส","link":"https://www.blognone.com/node/124611","date":1630948680000,"content":"<div><div><div><p>ในบรรดาบริการอีเมลฟรีนั้น ProtonMail เป็นบริการที่ชูจุดเด่นของการคุ้มครองความเป็นส่วนตัวขั้นสูงสุด ด้วยการเข้ารหัสอีเมลทั้งหมด พร้อมยืนยันว่าไม่เก็บข้อมูลใดๆ ของผู้ใช้</p>\n<p>แต่สัปดาห์ที่ผ่านมากลับมีข่าวว่า ProtonMail ส่งข้อมูลผู้ใช้รายหนึ่งให้ทางการสวิตเซอร์แลนด์ (<a href=\"https://www.blognone.com/node/56662\">ProtonMail ตั้งอยู่ในสวิตเซอร์แลนด์</a>) ซึ่งถูกตำรวจฝรั่งเศสจับกุมในข้อหาอาชญากรรม ส่งผลให้เกิดคำถามต่อนโยบายของ ProtonMail</p>\n<p>ล่าสุด Andy Yen ซีอีโอบริษัทออกมายอมรับและชี้แจงเรื่องนี้ เขาระบุว่าการเข้ารหัสของ ProtonMail ไม่ได้ถูกเจาะ และ ProtonMail เป็นฝ่ายส่งข้อมูลของผู้ใช้รายนี้ให้ทางการสวิตเซอร์แลนด์เอง เพราะบริษัทอยู่ภายใต้กฎหมายสวิตเซอร์แลนด์ ที่สามารถบังคับให้บริษัทเก็บข้อมูลผู้ใช้บางคนเพื่อการสอบสวนคดีได้</p>\n<p>ProtonMail ยืนยันว่าไม่เก็บข้อมูลผู้ใช้เป็นค่าเริ่มต้น แต่เก็บต่อเมื่อได้รับคำสั่งทางกฎหมายเท่านั้น และจะทำต่อเมื่อคำสั่งนั้นเป็นไปตามมาตรฐานกฎหมายสวิตเซอร์แลนด์ ที่ผู้ต้องสงสัยเองจะได้รับแจ้งว่าทางการได้รับข้อมูลไปแล้ว และหากบริษัทมีทางโต้แย้งคำสั่งได้ก็จะพยายามโต้แย้ง ที่ผ่านมาบริษัทเคยโต้แย้งคำสั่งทางกฎหมายมากกว่า 700 คำสั่งในปี 2020 แม้บางคำสั่งก็โต้แย้งไม่สำเร็จ ซึ่งในกรณีนี้บริษัทพบว่าไม่สามารถต่อสู้ในทางกฎหมายได้</p>\n<p>นอกจากนี้ กฎหมายสวิตเซอร์แลนด์สำหรับบริการอีเมลต่างจาก VPN ทำให้<a href=\"https://www.blognone.com/node/93364\">บริการ ProtonVPN</a> ไม่มีกฎหมายที่สั่งให้เก็บข้อมูลผู้ใช้ได้แบบเดียวกับอีเมล</p>\n<p>ที่มา - <a href=\"https://protonmail.com/blog/climate-activist-arrest/\">ProtonMail</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/26ffd62d5c539239c3f9c8e5278c3f96.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/protonmail\">ProtonMail</a></div><div><a href=\"/topics/privacy\">Privacy</a></div><div><a href=\"/topics/e-mail\">E-mail</a></div><div><a href=\"/topics/switzerland\">Switzerland</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2ac962712abce32d84f696551163e116166087a37fbb88724e834241c236f22b","category":"Thai"}