{"title":"Appropriate Use of Antibiotics in Acute Pancreatitis: A Scoping Review","link":"https://www.preprints.org/manuscript/202408.1669/v1","date":1724405972000,"content":"Background. While selective use of antibiotics for infected pancreatic necrosis (IPN) in acute pan-creatitis (AP) is recommended, studies indicate a high rate of inadequate treatment.\nMethods. A search of PubMed, Scopus, and Cochrane databases was conducted, focusing on primary research and meta-analyses. Data were categorized based on core concepts, and a narra-tive synthesis was performed.\nResults. The searches yielded 1016 publications. After assessing 203 full texts and additional sources, 80 studies were included. The answers obtained were: (1) Preventive treatment does not decrease the incidence of IPN or mortality. Given the risks of bacteria resistance and fungal infec-tions, antibiotics should be reserved for highly suspected or confirmed IPN; (2) The diagnosis of IPN not always require microbiological samples, as clinical suspicion or CT signs can suffice. Early di-agnosis and treatment may be improved by using biomarkers such as procalcitonin and novel mi-crobiological methods; (3) When indicated, early initiation of antibiotics of IPN is a key determinant in reducing mortality; (4) Antibiotics with good penetration into pancreatic tissue covering Gram-negative and Gram-positive bacteria should be used. Routine antifungal therapy is not recommended; (5) The step-up approach, including antibiotics, is the standard for IPN manage-ment; (6) Antibiotic duration should be kept to a minimum and should be based on the quality of source control and patient condition.\nConclusions. Early antibiotic therapy is essential for the treatment of IPN, but prophylactic anti-biotics are not recommended in AP. High-quality RCTs are required to better understand the role of antibiotics and antifungals in AP management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2acf2b575a14b27c050141f83079eb67eb9732fbd94c2d159ddebb1db6b1d5ba","category":"Interdisciplinary"}