{"title":"Has the “Tully monster” mystery finally been solved after 75 years?","link":"https://arstechnica.com/?p=1932561","date":1682444298000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/tully3CROP-800x496.jpg\" alt=\"Tullimonstrum gregarium (\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/tully3CROP.jpg\">Enlarge</a> <span>/</span> Fossil of <em>Tullimonstrum gregarium</em> (\"Tully's common monster\"). Its discovery in the 1950s sparked a long-running scientific debate as to whether the creature should be classed as a vertebrate or invertebrate. (credit: <a href=\"https://creativecommons.org/licenses/by-sa/3.0/\">Ghedoghedo/CC BY-SA 3.0</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The state fossil of Illinois is a strange creature with stalked eyes and a long nose-like appendage with teeth, dubbed the \"<a href=\"https://en.wikipedia.org/wiki/Tullimonstrum\">Tully monster</a>.\" Specimens typically measure just 15 centimeters (about 6 inches), but the tiny creatures sparked a major decadeslong scientific debate over whether they should be classed as vertebrates or invertebrates. That mystery may now have been solved, according to a team of Japanese scientists who claim their 3D scans of a generous sampling of fossils rule out the vertebrate hypothesis. They described their findings in a <a href=\"https://onlinelibrary.wiley.com/doi/10.1111/pala.12646\">recent paper</a> published in the journal Nature.</p>\n<p>The fossil gets its name (<em>Tullimonstrum gregarium</em>, or \"Tully's common monster\") from Francis Tully, an amateur fossil collector who discovered the specimen in 1955 while scouring the Mazon Creek fossil beds in Illinois—the only site where Tully monster fossils have been found. He had never seen anything like this \"torpedo\"-shaped fossil and brought it to paleontologists at the Field Museum of Natural History in Chicago for identification. But the paleontologists there couldn't figure out how to classify it.</p>\n<p>While it might resemble a slug at first glance, Tully monster fossils have several unique features, most notably an elongated, flexible proboscis (long nose with teeth) and outward-protruding eyes on stalks, similar to those of a hammerhead shark. Tully has been compared to <a href=\"https://en.wikipedia.org/wiki/Gastropoda\">gastropods</a> (slugs and snails), <a href=\"https://en.wikipedia.org/wiki/Conodont\">conodonts</a> (an extinct group of jawless vertebrates), <a href=\"https://en.wikipedia.org/wiki/Polychaete\">polychaetes</a> (segmented marine worms), <a href=\"https://en.wikipedia.org/wiki/Nemertea\">nemerteans</a> (ribbon worms), and <a href=\"https://en.wikipedia.org/wiki/Nectocaris\">nectocarids</a> (a squid-like Cambrian organism) in the ensuing decades. If it was a vertebrate, then the Tully monster would fill a critical gap in evolutionary history, connecting jawless fish (such as lampreys and hagfish) to jawed fish.</p></div><p><a href=\"https://arstechnica.com/?p=1932561#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1932561&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2ad03ee3be39ac028c419fc65659ab5c8fed20f704e5ca71cba84ef4878c1027","category":"Tech"}