{"title":"Tips for commuting with kids – how to get your children cycling to school","link":"https://www.bikeradar.com/features/routes-and-rides/handy-tips-for-commuting-with-kids/","date":1617291000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2017/06/GettyImages-1168548976-8aa7216.jpg?quality=45&amp;resize=620,413\" />                                            <p>For many people, the school run is part and parcel of the daily commute, so how do you manage cycling to work when you add kids in the mix?</p>\n<p>We spoke to lots of different parents with children of all ages to get their wise words and advice on how to manage the school run and the work commute by bike.</p>\n<p>They shared their hard-won words of wisdom and experience about the bikes, products and kit they use, the lessons they’ve learned and their top tips for making it an efficient, but most of all fun, part of the day.</p>\n<p>After all, it means more time with your children and more time on your bike. What’s not to love?</p>\n<h2>Commuting with kids – advice from other parents</h2>\n<p>Getting kids ready for nursery, playgroup or school can be tricky enough in the mornings, particularly when you also have to get yourself ready for work.</p>\n<p>Clothes, breakfasts, packed lunches – adding <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-kids-bike-helmets-a-buyers-guide/\" target=\"_blank\">kid’s helmets</a>, jackets and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-kids-bikes-a-buyers-guide/\" target=\"_blank\">bikes</a> to the list can seem daunting, and time-consuming.</p>\n<p>Jennifer Purcell has regularly commuted by bike, taking her two children to school before heading to work herself. She says the benefits have been compelling and easily outweigh the logistical issues.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Fresh air, exercise, and more time spent together… what’s not to like?</span></figcaption><span> <i>Jennifer Purcell</i></span></div>\n<p>Back in 2017, she told us that: “It’s such a good start to the day, even if things have been frantic getting ready, and we’ve not left on time, we then all get to blow the cobwebs out and enjoy the ride down to school.</p>\n<p>“The kids are also learning road etiquette and also how to behave on shared paths. It can be a bit terrifying when we hit the small road section, but Ryder is so proud whenever we negotiate the trickier junctions. Burning off that bit of energy in the morning also means we are more focused when we get into school and work. It’s the best start to the day, for sure.”</p>\n<p>We also spoke to Jane Ewins, who was clearly passionate about family cycling, and told us that there are several ‘stages’ to a family’s bike commute progression.</p>\n<p>“The joy of getting back on your bike using a single infant seat when your first child is born; when your <a href=\"https://www.bikeradar.com/advice/skills/how-to-teach-a-kid-to-ride-using-a-balance-bike/\" target=\"_blank\">toddler’s balance bike</a> changes from being a toy to a viable mode of transport but a challenge to blend with an adult riding too; second child comes along and suddenly you find yourself out and about with a baby strapped to you and a child riding like a racer on the footpaths.</p>\n<p>“After a few more years both kids can ride with confidence but the older one is faster and the younger one races to keep up and this is when ‘<a href=\"https://www.bikeradar.com/advice/buyers-guides/whats-the-best-bike-for-commuting/\" target=\"_blank\">commuter riding</a>‘ really started for us.”</p>\n<h2>Cycling games</h2>\n<p>Rachel Fleming shared that her husband regularly commuted with their two children, who were aged five and three when we spoke with her in 2017, on a Helios tandem bike with a Yepp Maxi bike seat.</p>\n<p>“He drops one at nursery, one at school and then carries on to work. Top tip: dress for the weather, with <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-cyclists/\" target=\"_blank\">good quality waterproof jackets</a>, and Merino balaclavas for under helmets in winter, because dry happy children make for a happy commute.</p>\n<p>“My husband also tries to involve them and they chat about which way they will turn and gets them to do signals, or if they have time in the morning he’ll let them choose the route, or allow them to play Pokemon Go on the way.”</p>\n<p>For kids that are feeling reluctant, making the commute a game is a great way of engaging them and getting them involved, a technique that Purcell has used regularly.</p>\n<p>“Each day when we set out, the juniors decide what we’re going to play,” she told us. “Monday we could be Power Rangers, Tuesday we’ll be Hiccup and Astrid flying our dragons down the hill, Wednesday we’ll be superheroes racing to stop the baddies from destroying the school, Thursday could be a <a href=\"https://www.bikeradar.com/events/tour-de-france/\" target=\"_blank\">Tour de France</a> stage and Friday could simply be an ‘eye spy’ day. On the way home, we can chat about our days, sharing the good and the bad.”</p>\n<p>The website <a href=\"http://www.cyclesprog.co.uk/family-cycling-advice/carry-on-cycling-when-mum/\" target=\"_blank\">Cycle Sprog</a> has a wealth of advice on products that will make your family commute more efficient and comfortable, and is well worth a read.</p>\n<p>Purcell also recommended the <a href=\"https://www.facebook.com/groups/641173915998956/\" target=\"_blank\">Family Cycling UK</a> group on Facebook, and we’re sure there are plenty of others out there where you’ll be able to get advice and recommendations.</p>\n<h2>Cycling to school – how to choose a safe route</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Planning your route with apps such as Komoot can take out a lot of uncertainty.</span></figcaption><span> <i>Rugile Kaladyte / Komoot</i></span></div>\n<p>Choosing a good, safe route is an important consideration for many parents considering commuting with their children, and although organisations like <a href=\"http://www.sustrans.org.uk\" target=\"_blank\">Sustrans</a> in the UK have journey planners that will suggest quiet routes and even traffic-free paths, for a lot of parents the lack of a safe route is a serious barrier.</p>\n<p>However, with some preparation and planning, there are ways of managing this for the majority of potential bike-commuting families.</p>\n<p>Ewins’ approach has been to ride a fixed route every day. “[We] really learnt the details of the whole route. Youngest and slowest rides first, and we limit instructions and directions shouted from behind, and limit ‘advice’ given by older riders to younger riders.”</p>\n<p>Sarah Richer Dorman, who has also commuted with her children, added that “the trick is always to have them in front of you, and to try out routes until they’re familiar with them. And don’t try this unless you know they will listen and respond to you!”</p>\n<p>Don’t forget to leave extra time because managing the bikes and equipment of two, three or more cyclists is time-consuming, but also try not to worry too much about being on time. It might help to talk to your workplace to arrange some flexibility on days you will be doing the commute with kids by bike.</p>\n<p>However, “don’t fret if you’re late. It happens,” says Purcell. “The joy of riding in is that you have that exercise, fresh air, and conversation time together. If it’s all fraught then it’s not fun for anyone.”</p>\n<h2>Recommended kit and equipment for commuting with children</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> With kids of different ages, a mixture of kit can work well like this cargo bike, child seat and tag-along combo</span></figcaption><span> <i>Jennifer Purcell</i></span></div>\n<p>There’s more and more product on the market than ever before for parents who want to cycle with their kids. From bike-mounted child seats to tow-along trailers to cargo bikes, there are setups to suit commutes of every kind and children of every age.</p>\n<p>Here’s what a few of the parents we asked have used, and it’s very common to use more than one method to suit the different ages and sizes of children.</p>\n<h3>Child seats</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> All aboard!</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>These can be fitted either on the rear of a bike on a specially mounted rear rack, on the frame in front of the main rider between the handlebar and the saddle, or right on the front of the bike. The most popular seats are the rear ones.</p>\n<p>To fit these, you’ll usually need a bike that has eyelets incorporated into the frame to attach the supports. Often, these child seats will have the option to attach pannier bags below, so you can store jackets, schoolbags and packed lunches here while you ride.</p>\n<p>Ollie Craig is one parent that used this method, doing the school run on a hybrid City bike with a bike seat until his daughter was five and then cycling with her once she progressed to her scooter or bike (on the pavement and canal path).</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Tandem</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> If you’re really dedicated, a tandem could work.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>A tandem? For riding with kids? Yes, actually. They were a surprisingly popular choice among the parents we spoke to, and Jennifer Purcell regularly uses one for commuting that’s fitted with two child seats, or a child seat and a tag-along. Sounds like a juggernaut!</p>\n<h3>Tag-along or tow-alongs</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Tag-alongs are a great solution.</span></figcaption><span> <i>Halfords</i></span></div>\n<p>Tag-alongs are devices that allow you to tow a child’s bike behind you, usually attaching at the front of the smaller bike with a long metal pole to the seatstay of the adult bike.</p>\n<p>The advantages here are that the child will get some exercise and pedal (if they want to – they might end up letting you do all the work) and gets used to being on their own bike.</p>\n<p>The disadvantages include having to continue to ride on with it once you’ve dropped the child at school, unless there is somewhere to park the bike and tag-along device.</p>\n<p>Rona Wightman was a fan of this method, and they are increasingly popular because they suit a wide variety of ages: “I had a child seat and then an Isla Rowntree trailer bike [aka tag-along]. The tagger lasted to age ten.”</p>\n<p>Her setup included a front rack with panniers while using the child seat, and then rear panniers with the trailer bike, which came with its own rack.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Trailer</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Trailers are an ideal option for carting about kids.</span></figcaption><span> <i>Jonny Ashelford / Immediate Media</i></span></div>\n<p>Trailers and self-contained seats for children and are designed to be towed along behind a bike – they’re great for babies, toddlers and younger kids.</p>\n<p>Designed to be lightweight, the child is strapped in – a little like a pushchair – and has a nice view to look at while you ride along.</p>\n<p>If you’ve got a rough commute or want to go cross-country, you can find trailers that are robust enough to handle a little off-roading.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Cargo bike</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> In terms of sheer load-lugging capacity, it’s hard to beat a dedicated cargo bike.</span></figcaption><span> <i>Tern</i></span></div>\n<p>Increasingly popular, particularly in Europe, cargo bikes are great for carrying all sorts. They can be bulky and not the most nimble, so while they are great for carrying one or two children plus bags, they may not be best suited to hilly commutes or for those with limited storage space.</p>\n<p>Some have a large storage box at the front or rear, others are designed to carry loads elsewhere on the frame.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Riding as a group</h3>\n<p>If your children are old enough <a href=\"https://www.bikeradar.com/advice/skills/how-to-teach-a-child-to-cycle-in-30-minutes/\" target=\"_blank\">to cycle</a> and/or your route is quiet and safe enough, you can of course set off on your own individual bikes. There are loads of benefits here, including children experiencing independence and responsibility.</p>\n<p>Ideally, you’ll need to be able to keep the bikes at school with the kids so you can ride home together afterwards. The downside here is that there’s no option to give anyone a lift if they are feeling too tired to ride… unless you ride a bike with a child seat just in case.</p>\n<p>There are myriad combinations of bike plus accessories, so it’s worth reading up on what would work for you, your family and your commute.</p>\n<section><div>\n        <h2>Top tips for commuting with kids</h2>\n<p>After many trips, smiles, tears and the occasional unexpected downpour, here are the pearls of wisdom and hard-won experience that the parents we spoke to have to share:</p>\n<ul><li>Work out the best formation of bike plus accessories for you</li>\n<li>Always bring <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-cyclists/\">rain jackets</a>, even if it’s not forecast</li>\n<li>Use the commute to chat with each other</li>\n<li>Play games as you go! Whether it’s role-playing or I Spy, games make the commute more fun and it becomes quality time spent with your family</li>\n<li>Plan a route that you’re comfortable riding with kids. Many people prefer to avoid busy roads and opt for greenways and segregated cycle paths</li>\n<li>Make sure you’ve got the hang of mounting and dismounting a bike with a child seat before heading out and go for a few practice rides to get a feel for how your setup handles</li>\n<li>When they first start school, they’ll be very tired by the end of the week, so seats or tag-alongs are a good idea to avoid dealing with grumpy kids</li>\n<li>Leave an outfit at work with something to freshen up – such as wet wipes and some deodorant – if you don’t have access to showers or are short on time</li>\n</ul><p>\n\n    </p></div>\n    </section>","author":"Aoife Glass","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"2ad061e63d31c84247a92409c375e6aa98545351de8ed7f9318507f35823035c","category":"Cycling"}