{"title":"Top Stories: iPhone 15 Pro Design Leak, iOS 16.4 Coming Soon, and More","link":"https://www.macrumors.com/2023/03/25/top-stories-iphone-15-pro-design-leak/","date":1679749200000,"content":"We're still almost six months away from the official unveiling of the iPhone 15 lineup, but it seems like every day we're learning more about what to expect from the next-generation models. Notably, this week gave us our clearest look yet at what appear to be some changes for the volume and mute control hardware.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/top-stories-25mar2023.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\niOS 16.4 and associated releases are also right around the corner with some new features and hints of updated earphones coming from Apple and Beats. Meanwhile, we're continuing to hear about Apple's plans to expand its home audio product portfolio, so be sure to read on for all the details on these stories and more!\r<br />\n\r<br />\n<h2>iPhone 15 Pro Leak Reveals Single Volume Button and Mute Button</h2>\r<br />\nWe've been hearing for a while now that the <a href=\"https://www.macrumors.com/2022/10/28/kuo-iphone-15-pro-models-solid-state-buttons/\">iPhone 15 Pro and Pro Max will be equipped with solid-state buttons</a> that do not physically move. Instead, the buttons will provide haptic feedback from Taptic Engines when pressed, similar to the Home button introduced with the iPhone 7 and the Force Touch trackpad on modern MacBooks.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/iPhone-15-Pro-Buttons-CAD-Leak.jpg\" alt width=\"1600\" height=\"895\" />\r<br />\nNow, a leaked CAD image has revealed that <a href=\"https://www.macrumors.com/2023/03/20/iphone-15-volume-mute-buttons-cad/\">iPhone 15 Pro models will apparently have a single, elongated volume button</a> for turning the volume up or down based on where it is pressed. The image also shows that a small button will replace the mute switch that has existed on every iPhone model sine 2007 for turning the ringer on and off.\r<br />\n\r<br />\n<h2>AirPods Pro With USB-C Charging Case to Launch Later This Year</h2>\r<br />\nIn the iOS 16.4 Release Candidate made available to developers and public beta testers this week, there are <a href=\"https://www.macrumors.com/2023/03/21/ios-16-4-airpods-reference/\">hidden references to what appears to be next-generation AirPods</a> and a new charging case.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/09/airpods-pro-2.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nAccording to analyst Ming-Chi Kuo, these are <a href=\"https://www.macrumors.com/2023/03/24/airpods-pro-2-usb-c-later-this-year/\">likely to be AirPods Pro 2 with a USB-C charging case</a> rather than the current Lightning port. Apple is reportedly also <a href=\"https://www.macrumors.com/2023/03/24/apple-not-planning-usb-c-version-of-airpods-3/\">not planning to release USB-C versions of AirPods 2 or 3</a>, suggesting their transition to USB-C will need to wait until a more substantial AirPods 4 upgrade is ready.\r<br />\n\r<br />\niOS 16.4 also includes <a href=\"https://www.macrumors.com/2023/03/21/beats-studio-buds-plus/\">references to unreleased Beats Studio Buds+ earbuds</a>, which could be a new and improved version of the regular Studio Buds.\r<br />\n\r<br />\n<h2>iOS 16.4 Adds Voice Isolation for Cellular Phone Calls</h2>\r<br />\nAnother new feature coming with iOS 16.4 is <a href=\"https://www.macrumors.com/2023/03/21/ios-16-4-voice-isolation-phone-calls/\">voice isolation for cellular phone calls</a>. Apple says this option blocks out ambient noise around you so that your voice sounds clearer on the call.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/01/iOS-16.4-Feature-Blue.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nVoice isolation was already available for Wi-Fi calls in apps like FaceTime and WhatsApp on devices running iOS 15 or macOS Monterey or later, and now the feature is available for regular phone calls over a cellular network.\r<br />\n\r<br />\n<h2>HomePod With a Screen Delayed Until Next Year at Earliest</h2>\r<br />\nApple is rumored to be developing a new HomePod model with a built-in screen to compete with the likes of Google's Nest Hub and Amazon's Echo Show, but the company has <a href=\"https://www.macrumors.com/2023/03/20/homepod-with-screen-delayed-next-year/\">reportedly paused the project until next year at the earliest</a> due to cost-cutting measures.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2022/01/HomePod-With-Screen.jpg\" alt width=\"1920\" height=\"1080\" /><em>Mockup of a HomePod with display</em></div>\r<br />\nApple <a href=\"https://www.macrumors.com/2023/01/18/apple-announces-new-homepod/\">relaunched the full-sized HomePod</a> earlier this year after discontinuing the smart speaker in 2021, and it continues to sell the HomePod mini as a smaller option.\r<br />\n\r<br />\n<h2>iPhone 15 Pro Rumor Recap: 10 New Features and Changes</h2>\r<br />\nWhile the iPhone 15 series is still around six months away from launching, there have already been plenty of rumors about both the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">regular</a> and <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\"> model lineups.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/iPhone-15-Pro-Roundup-Mock-Feature-Perspective.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nMany new features and changes have been rumored for the iPhone 15 Pro models in particular. This week, we recapped <a href=\"https://www.macrumors.com/2023/03/23/iphone-15-pro-rumor-recap/\">10 new features and changes rumored for the Pro models</a> that are not expected to be available on the standard iPhone 15 and iPhone 15 Plus models.\r<br />\n\r<br />\n<h3>MacRumors Newsletter</h3>\r<br />\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r<br />\n\r<br />\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/mar-23-2023\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/25/top-stories-iphone-15-pro-design-leak/\">Top Stories: iPhone 15 Pro Design Leak, iOS 16.4 Coming Soon, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-iphone-15-pro-design-leak-ios-16-4-coming-soon-and-more.2384748/\">Discuss this article</a> in our forums<br /><br /></a>","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2ad123a812a6e589bc3ad77a9f4ca9dd5d1ee79d421bf243d256dcadc399deff","category":"Apple"}