{"title":"KBTG Techtopia: Across The AI Verse งานมหกรรมเทคโนโลยีเตรียมรับความเปลี่ยนแปลง 10 ปีข้างหน้า ที่จะมากกว่า 50 ปีที่ผ่านมา","link":"https://www.blognone.com/node/135609","date":1694077200000,"content":"<div><div><div><p>เมื่อวันที่ 1-2 กันยายนที่ผ่านมา KASIKORN Business-Technology Group หรือ KBTG ได้จัดงานมหกรรมเทคโนโลยี KBTG Techtopia ที่รวมทั้งการนำเสนอเทคโนโลนีผ่านนิทรรศการ, การบรรยายหลายสิบรายการจากผู้บรรยายกว่า 35 คน, และการทำเวิร์คชอปแบบลงมือทำจริงภายในงาน นับเป็นการเปิดตัวงานมหกรรมเทคโนโลยีของ KBTG ที่เตรียมพาวงการเทคโนโลยีของไทยรับมือความเปลี่ยนแปลงในอนาคตต่อไป</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/52591ac4c1fb7b9941f2894aa2b66a17.jpg\" /></p>\n<p>นอกจากงานบรรยายต่างๆ แล้ว ในงานยังมีการแสดงผลงานด้านปัญญาประดิษฐ์ต่างๆ โดยเฉพาะจาก KBTG Labs ที่แสดงให้เห็นว่า KBTG กำลังนำปัญญาประดิษฐ์มาใช้งานได้อย่างไรในอนาคต เช่น ระบบ machine learning ที่ช่วยประเมินราคาที่ดินได้อย่างรวดเร็วและอธิบายได้ว่าตัดสินใจเทียบเคียงกับที่ดินผืนใดจึงให้ราคานั้นๆ ออกมา, ระบบสำรวจพฤติกรรมลูกค้าในพื้นที่ให้บริการเช่น สาขาของธนาคาร ที่สามารถดูสถิติการใช้งานพื้นที่ต่างๆ ของสาขาได้โดยไม่ต้องตรวจจับตัวตนของผู้ใช้, ระบบซัพพอร์ตและแนะนำลูกค้าที่ใช้ปัญญาประดิษฐ์ให้คำตอบต่างๆ แก่ลูกค้าได้ทันที</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/79d655de96b7a6f36c8f806a9f15c5f9.jpg\" /></p>\n<p>การแลกเปลี่ยนหลายส่วนผู้บรรยายแลกเปลี่ยนกันถึงประสบการณ์การสร้างเทคโนโลยีปัญญาประดิษฐ์ ในอุตสาหกรรมต่างๆ เช่น การเงินหรือการเกษตรที่มีแนวทางแตกต่างกันไป มีการถกกันถึงความเป็นไปได้ในการระดมทุนเพื่อสร้างธุรกิจจากความเปลี่ยนแปลงเช่นนี้ว่า VC ต่างๆ มองหาธุรกิจแบบใดเพื่อลงทุนกันอยู่ หรือจุดที่ควรระมัดระวังด้านจริยธรรมกับโลกปัญญาประดิษฐ์นั้นมีประเด็นอะไรที่ต้องให้ความสำคัญ</p>\n<h2>10 ปีข้างหน้าที่กำลังก้าวไปมากกว่า 50 ปีที่ผ่านมา</h2>\n<p>กระทิง เรืองโรจน์ พูนผล บรรยายถึง State of M.A.D. (Machine Learning, Artificial Intelligence, Data) ว่าโลกของปัญญาประดิษฐ์ในปีนี้กำลังสร้างความเป็นไปได้ใหม่ๆ อย่างที่ไม่เคยมีมาก่อน คนจำนวนมากสามารถทำงานแบบกราฟิกดีไซน์เนอร์, นักดนตรี, หรือนักออกแบบตกแต่งภายใน (Interior Designer) ได้โดยอาศัยปัญญาประดิษฐ์เป็นตัวช่วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/11e87e5ed24fcfb2735a5652d6d45c16.jpg\" /></p>\n<p>การบรรยายยังทำนายว่าปัญญาประดิษฐ์จะขยายความสามารถของคนรุ่นต่อไปอย่างกว้างขวาง คนรุ่นต่อไปจะสามารถทำสิ่งต่างๆ ที่คนรุ่นนี้ไม่เคยทำได้ด้วยตัวเอง ไม่ว่าจะเป็นการออกแบบยานอวกาศ, การถอดรหัสพันธุกรรม, หรือทำตามความฝันต่างๆ ที่เคยรุ่นก่อนหน้าไม่เคยทำได้ และตอนนี้ปัญญาประดิษฐ์ก็สร้างโอกาสใหม่ๆ ที่ KBTG ทำงานร่วมกับ Andrew Ng หนึ่งในผู้บุกเบิกวงการ Deep Learning ในการสร้างกองทุนที่จะสนับสนุนเกิดบริษัทปัญญาประดิษฐ์ที่จะช่วยแก้ปัญหาของอุตสาหกรรมต่างๆ ด้วยปัญญาประดิษฐ์ คุณกระทิงเชื่อว่าเราน่าจะได้เห็นสตาร์ตอัพปัญญาประดิษฐ์ขึ้นสู่ระดับยูนิคอร์น (มูลค่าเกิน 1,000 ล้านดอลลาร์สหรัฐฯ) ที่มีพนักงานเพียงระดับ 10 คนเท่านั้น และบริษัทระดับยูนิคอร์นอาจจะมีจำนวนหลักร้อย</p>\n<p>ความเปลี่ยนแปลงที่รุนแรงนี้เป็นเพราะปัญญาประดิษฐ์เปิดทางโอกาสใหม่ๆ และแก้ปัญหาปัญหาได้จริงในหลายปัญหา ทั้งการศึกษา, การแพทย์, รวมถึงปัญหา Aging Society ที่ปัญญาประดิษฐ์กำลังเข้ามาเปิดทางให้แพทย์สามารถดูแลคนไข้ได้ทั่วถึงยิ่งขึ้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/49022d9f78dce6762a960fb67f8cf002.jpg\" /></p>\n<p>KBTG เป็นหนึ่งในบริษัทที่บุกเบิก M.A.D. ทั้งสามด้านเพื่อนำไปใช้งานในธุรกิจจริง machine learning เพื่อการแนะนำบริการและโปรโมชั่น, การวิจัย AI เพื่อแนะนำผู้ใช้, การใช้ข้อมูลที่ใช้งานทุกส่วนขององค์กรขณะเดียวกันก็ต้องปกป้องข้อมูลส่วนบุคคลของผู้ใช้และความปลอดภัยในการใช้งาน</p>\n<p>งาน KBTG Techtopia เป็นการเชิญชวนคนในวงการมาจินตนาการร่วมกันถึงความเป็นไปได้ คนในวงการจะมาเจอกันและร่วมกันสร้างสิ่งใหม่ๆ ในโลกที่จะก้าวไปข้างหน้าอย่างรวดเร็วในสิบปีข้างหน้าที่จะเปลี่ยนแปลงมากกว่า 50 ที่ผ่านมาเสียอีก</p>\n<h2>โลกที่อยู่ร่วมกับ AI ได้อย่างมีความสุข</h2>\n<p>การบรรยายหนึ่งที่น่าสนใจในงานครั้งนี้ คือการบรรยายของ Rosalind Picard ผู้อำนวยการกลุ่มวิจัย Affective Computing Research จาก Director of Affective Computing Research บรรยายถึงโลกในอนาคตที่น่าอยู่ขึ้นด้วยปัญญาประดิษฐ์ ที่ทุกวันนี้เริ่มมีการใช้งานมากขึ้น และกำลังมีการวิจัยเทคโนโลยีใหม่ๆ เพิ่มเติม</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c4f285ff682c3f3e048b40d6d40ff344.jpg\" /></p>\n<p>Picard เล่าถึงงานวิจัยพัฒนา Smartwatch ที่สามารถตรวจจับอาการชักของผู้ป่วยโรคลมชัก ที่สามารถช่วยเหลือได้โดยง่ายหากมีคนไปพบผู้ป่วยขณะชักและกระตุ้นจากภายนอก เพียงแค่เรียกหรือเขย่าตัว ในการใช้งานปัญญาประดิษฐ์ทางการแพทย์ก็มีความท้าทายหลายอย่าง ทั้งความแม่นยำที่นักวิจัยต้องระมัดระวังผลผิดพลาดทั้ง False Negative ที่ระบบไม่เตือนเมื่อเกิดเหตุ หรือ False Positive ที่ระบบเตือนทั้งที่ไม่มีความผิดปกติอะไร การใช้งานทางการแพทย์ยังต้องการคำอธิบายได้ว่าทำไมระบบถึงวินิจฉัยต่างกันในแต่ละครั้ง และระบบเหล่านี้ก็มักต้องการข้อมูลจากแพทย์เพื่อให้ได้บรรทัดฐานชัดเจนว่าระบบที่ทำขึ้นดีเพียงใด</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/01eece1d884ebdea82647a25f7006787.jpg\" /></p>\n<p>อีกตัวอย่างของความท้าทายในการใช้งานปัญญาประดิษฐ์ คือการสร้างปัญญาทางอารมณ์ (Emotionally Intelligence) ให้กับปัญญาประดิษฐ์ จากทุกวันนี้ที่บอตต่างๆ มักแสดงอารมณ์เป็นทางบวก ร่าเริง หรือมีความสุขเสมอ แต่ในการทำงานจริง เมื่อปัญญาประดิษฐ์พบกับผู้ใช้ที่กำลังเศร้าโศกหรือโกรธก็ต้องเรียนรู้ที่จะตอบสนองอย่างเหมาะสม ปัญญาประดิษฐ์ทุกวันนี้เริ่มอ่านหน้าตาของมนุษย์ได้ว่าเป็นอารมณ์แบบใด ความท้าทายในอนาคตคือการทำให้ปัญญาประดิษฐ์เข้าใจถึงบริบทรวมของการสนทนาและเข้าใจได้ว่าจุดใดเป็นจุดสำคัญ</p>\n<p>Picard ย้ำว่าปัญญาประดิษฐ์ไม่ได้พัฒนาตัวเองไปเรื่อยๆ เหมือนในภาพยนตร์ แต่ในความเป็นจริงแล้วมีมนุษย์เป็นผู้พัฒนาและใส่คุณค่าต่างๆ ลงไปให้กับมัน และมนุษย์เราเป็นผู้เลือกว่าจะสร้างปัญญาประดิษฐ์ในอนาคตอย่างไร เราสามารถสร้างปัญญาประดิษฐ์เพื่อช่วยขยายความสามารถของมนุษย์ไปได้ ตลอดจนช่วยมนุษย์ทั้งด้านร่างกายและจิตใจ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1e3d5ceb5ebd238067fd8c71afe16956.jpg\" /></p>\n<h2>สิ่งที่ได้จาก KBTG Techtopia: Across The AI Verse ไม่ใช่แค่การบรรยาย แต่เป็นการแลกเปลี่ยน</h2>\n<p>ผมเดินอยู่ในงาน KBTG Techtopia หลายชั่วโมงทั้งการฟังบรรยาย, การถกกันระหว่างผู้บรรยายในเวทีต่างๆ, และการพูดคุยกับนักวิจัยที่มาจัดแสดงผลงานในงาน พบ KBTG Techtopia ประสบความสำเร็จในการเป็นเวทีแลกเปลี่ยนไอเดียและความเป็นไปได้ต่างๆ ในโลกอนาคตที่กำลังจะเกิดขึ้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/173366f5a35e9fdefa668e9faba11c94.jpg\" /></p>\n<p>ผู้ที่มาร่วมงานนั้นมีหลากหลายตั้งแต่นักเรียนนักศึกษาที่มาร่วมงานเพราะอยากสัมผัสเทคโนโลยีต่างๆ เป็นครั้งแรกๆ ผ่านการทำ workshop ในงาน หรือจะเป็นการพูดคุยกับนักวิจัยที่มากประสบการณ์ และเล่าให้ฟังถึงแนวคิดในการสร้างงานต่างๆ ออกมา ข้อจำกัดทั้งในเชิงเทคโนโลยี, ข้อบังคับต่างๆ, หรือทรัพยากรที่ต้องใช้งาน ตลอดจนถึงการฟังความเห็นของผู้ร่วมงานว่าคิดอย่างไรกับการนำเสนอแต่ละส่วน</p>\n<p>การแลกเปลี่ยนเหล่านี้ทำให้การไปร่วมงานที่สำนักงาน KBTG นั้นทรงคุณค่ากว่าการฟังบรรยายผ่านระบบออนไลน์เหมือนที่ผ่านๆ มาในช่วง COVID-19 และหวังว่าจะได้เห็นงานเช่นนี้อีกในโอกาสต่อๆ ไป</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/kbtg\">KBTG</a></div><div><a href=\"/topics/techtopia\">Techtopia</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2ae0704547b18699dd865cbf60967f3b5bd056726c3d87a92a8bf41e5532970a","category":"Thai"}