{"title":"Does internationalization improve environmental disclosure willingness and quality? The moderating role of green investors","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307638","date":1726063200000,"content":"<p>by Juan He, Shuang Yang</p>\r\n\r\nEnvironmental issues have gradually become a key concern for society. The public has been paying increasing attention to corporate environmental disclosure and performance. With the “go global” trend, more and more enterprises are looking to overseas markets for new technologies and resources. Multinational enterprises (MNEs) are facing more challenges than domestic enterprises. To remain competitive and sustainable, enterprises from developing countries need to gain a foothold in developed countries. We explore how MNEs’ internationalization impacts environmental disclosure, specifically focusing on the role of green investors as stakeholders. We draw evidence from Chinese-listed MNEs, with a total of 4,709 panel data observations. For the main analysis, we use a fixed effect model. The findings suggest that a higher level of internationalization can improve both the willingness and quality of environmental disclosure for MNEs, and this relationship is further strengthened by green investors. A heterogeneity analysis reveals that the positive effect of internationalization on environmental disclosure is mainly present in state-owned enterprises (SOEs) and developed host countries. We find that external pressure from host countries motivates MNEs to increase environmental disclosure willingness and quality. This study provides valuable insights for MNEs from emerging economies on how to achieve legitimacy and a positive reputation in overseas markets through environmental disclosure strategies. This study proposes the importance of green investors on environmental disclosure issues from a stakeholder perspective and provides new theoretical insights for environmental policy reform in developing countries such as China.","author":"Juan He","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2ae27727f5bf8ec81b60d344c270b2da46493a6f5db7b4acd343530559afbedf","category":"Interdisciplinary"}