{"title":"116 In-situ degradability of hemp (Cannabis sativa L.) plant components in cattle","link":"https://academic.oup.com/jas/article/102/Supplement_1/96/7618004?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>The 2014 and 2018 Farm Bills defined hemp (Cannabis sativa L.) as an agricultural commodity and removed it from the controlled substances list, developing a pathway for commercialization and increasing interest in cultivating hemp in the United States. Demand for therapeutic, cannabinoid-based hemp products is increasing, and, as not all of the plant components are utilized for these products, there will likely be significant quantities of hemp by-products created. As these by-products are cellulosic, they may be marketed as livestock feed, especially for ruminant animals. There have been limited studies into hemp as cattle feed. Accordingly, the objective of this study was to determine the in-situ degradability of different hemp components in beef cattle. We conducted an in-situ trial with three ruminally cannulated steers (IACUC #8497) and 16 unique hemp samples: leaves, flower, stalk, or whole plant cultivated with four different seed inoculants. Samples were incubated in the rumen for 0, 4, 6, 12, 24, 48, and 72 h and replicated across each steer. After samples were removed, they were rinsed and analyzed for partial dry matter (DM), DM, organic matter (OM), and crude protein (CP). Solubility fractions [immediately soluble (IS), potentially soluble (PS), and not soluble (NS)], rate of degradation (k<sub>d</sub>), and rumen degradability was determined for OM and CP. Rate of passage (k<sub>p</sub>) was set at 4.7%. As there were not differences across seed inoculant method, data were combined across plant components. For OM, the NS fraction was greatest for hemp stalks (12%) and least for leaves (7%). The PS fraction ranged 72-75% across plant components with the least value for stalks and greatest for leaves. Of the PS fraction, ruminal OM degradability was least for stalks (51%) and greatest for leaves (72%). For CP, the NS fraction of hemp stalks (16%) was greater than other fractions, which ranged from 6-8%. The PS fraction was approximately 76% for both whole plant and leaves, a vast majority of which (71-73%) was degradable, indicating these plant components provide a good source of rumen degradable protein. The IS fraction was greatest (20%) for hemp flower. Although hemp flower may be easily digested by ruminants, it does not have practical value because this plant component competes in the human market as the flower contains a high percentage of cannabinoids which have therapeutic properties. Ultimately, our data indicate that hemp leaves have nutritional and practical value as feed for beef cattle and that hemp stalks would likely not be well-utilized as a forage source. Before hemp can be integrated into the beef cattle industry as feed, additional research is required to determine the effects of feeding hemp on animal performance and evaluate uptake and retention of cannabinoids in body tissues.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2aecf746f2d019c4369a02c6646002a0b5e0c08e1f7db6c5f47ecdcb23c06fef","category":"Environment"}