{"title":"A tale of two islands: tectonic and orbital controls on marine terrace reoccupation, Channel Islands National Park, California, USA","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3581?af=R","date":1707372847000,"content":"<h2>Abstract</h2>\n<p>In areas of low uplift rate on the Pacific Coast of North America, reoccupation of emergent marine terraces by later high sea-stands has been hypothesised to explain the existence of thermally anomalous fauna (mixtures of warm and cool species) of last interglacial age. If uplift rates have been low for much of the Quaternary, it follows that higher (older) terraces should also show evidence of reoccupation. Strontium isotope analyses of fossils from a high-elevation marine terrace on Anacapa Island, California, yield ages ranging from ~2.4–2.3 Ma to ~1.4–1.5 Ma. These results indicate that terrace reoccupation and fossil mixing on Anacapa Island could have taken place over several interglacial periods in the early Pleistocene. Terrace reoccupation over this time period is likely a function of both a low uplift rate and the timing of orbital forcing of glacial–interglacial cycles. Climate change in the early Pleistocene was modulated by the 41 ka obliquity cycle, and glacial–interglacial cycles were much shorter than later in the Pleistocene. Nearby San Miguel Island also has evidence of terrace reoccupation, with Sr isotope ages of shells from several high-elevation terraces ranging from ~1.21–1.25 Ma to ~0.43–0.50 Ma. However, the frequency of terrace reoccupation was lower than on Anacapa Island. The uplift rate of San Miguel Island is higher than that of Anacapa Island and terraces formed when glacial–interglacial cycles were longer. The frequency of marine terrace reoccupation is controlled by the rate of tectonic uplift and the timing of orbital forcing of sea level change during glacial–interglacial cycles.</p>","author":"Daniel R. Muhs, \nLindsey T. Groves, \nKathleen R. Simmons, \nR. Randall Schumann, \nStephen B. DeVogel","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"2aed139ae247fee7573308c35e1abcf9449db2f2401ceb0b4c9482da917911e0","category":"Environment"}