{"title":"How to get service on an Apple laptop battery","link":"https://www.macworld.com/article/353052/how-to-get-service-on-an-apple-laptop-battery-that-wont-charge-near-its-original-capacity.html","date":1629277200000,"content":"<div>\n<section><div></div></section><p>The lithium-ion battery in your Mac laptop will lose its ability to charge to its maximum factory-made capacity over time. But you don’t have to take it lying down. Depending on the level remaining, you might be able to get a free replacement from Apple.</p>\n\n\n\n<p>Lithium-ion batteries transformed laptops and mobile devices. They allowed for a greater density of stored energy compared to earlier generations of nickel-metal hydride batteries. This newer material loses charge much more gradually when not plugged in and not in use. And they shed the “memory effect,” which required careful charging to avoid permanently reducing the capacity of your battery. Modern Li-ion batteries can be shaped to fit into any space, further increasing device run time.</p>\n\n\n\n<p>But, like all components that carry electricity, they do age. A Li-ion battery has a specific maximum safe charge that’s built in by design. (In fact, it’s below the actual maximum, as there’s a safety margin built in to avoid overcharging the battery.) As you recharge the battery over and over again, its maximum capacity reduces.</p>\n\n\n\n<div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/mac911-system-info-charge.png?w=654\" /><figcaption>Apple’s System Information utility provides basic battery information.</figcaption></figure></div></div>\n\n\n\n<p>Charging to what Apple calls 100 percent adds more wear and ages the battery faster. However, Apple added features in iOS, iPadOS, and macOS in recent years to charge more intelligently, often to just 80 percent, depending on your usage pattern. This reduces wear and extends battery life. (See “<a href=\"https://www.macworld.com/article/234348/dont-keep-your-mac-laptop-charged-to-100-percent-all-the-time-heres-why.html\">Why you don’t need to keep your MacBook charged to 100 percent</a>.”)</p>\n\n\n\n<p>Under the included one-year hardware warranty, Apple guarantees <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/batteries/service-and-recycling/&amp;subid1=1-1-353052-1-0-0\">your battery will charge past 80 percent for up to 1,000 cycles</a>. A cycle isn’t just whenever you plug your battery in but represents the equivalent of a full discharge. So if you plug in and charge from 0 to 50 percent and later from 50 to 100 percent, that adds up to a single cycle. It’s more or less impossible to go through 1,000 cycles in one year because there’s not enough time to exhaust a laptop’s battery and recharge it.</p>\n\n\n\n<p>If you purchase what Apple now calls <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/support/products/mac/&amp;xcust=1-1-353052-1-0-0&amp;sref=https://www.macworld.com/feed\">AppleCare+ for Mac</a>, you can have your battery replaced whenever it falls below 80 percent capacity. This replacement is available during the initial three-year coverage that’s generally available and any additional period you renew for, if available. (Some warranty terms and the possibility of renewing AppleCare+ after three years vary outside the U.S., so check your local Apple site.)</p>\n\n\n\n<p>In both cases, Apple should never give you a hassle under these terms as the 80 percent number is something macOS reports precisely. (Apple offers similar guarantees and warranty service for any iPhone, iPad, iPod, or Watch under the initial warranty or AppleCare+.)</p>\n\n\n\n<div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/image.png?w=894\" /><figcaption>Battery Monitor’s capacity log tracked the decline of the first battery from the point I marked as A to B; then its replacement, from C to D. At that point, I traded it in.</figcaption></figure></div></div>\n\n\n\n<p>If you fall outside a warranty period, Apple has a set fee for battery replacement. In the U.S., it’s $129 or $199 (plus tax), depending on the model. Because Apple provides such good warranty service, I nearly always purchase AppleCare+ for my laptops. I’ve found it pays for itself, as the battery nearly always drops below 80 percent in the first three years, <em>and</em> another problem—like a worn-out keyboard—also occurs in year two or three that would otherwise have cost a bundle out of pocket to repair.</p>\n\n\n\n<p>The figures below illustrate that the M1 MacBook Air I put into service in December 2020 has already dropped to 92 percent of capacity after just 63 charge cycles. (Yes, I’ve had it plugged in a lot in 2021.) On that trajectory, it’s likely to drop below 80 percent by the start of its third year, if not sooner. Premature capacity drop like this, in my experience, often indicates accelerated decline to come.</p>\n\n\n\n<p>Apple doesn’t publish the precise number you need to understand your battery’s maximum charge, but you can find out where it stands relative to maximum capacity. Hold down the Option key and choosing <em> &gt; System Information</em>, click Power in the left-hand sidebar, and then look for the lines that show Cycle Count and Maximum Capacity.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/mac911-battery-monitor-main.png?w=1200\" /><figcaption>Battery Monitor provides a dashboard of charging and capacity information that can be helpful when off power and charging, as well as monitoring wear over time.</figcaption></figure></div>\n\n\n\n<p>You might like more technical details about your battery, including finding out the battery’s actual shipped capacity (measured in milli-ampere hours, or mAh), or want to track its changes over time. For that, you can turn to one of two third-party utilities:</p>\n\n\n\n<div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/mac911-coconut-battery-main.png?w=520\" /><figcaption>Coconut Battery’s free flavor provides all the details you need to figure out the state of your battery.</figcaption></figure></div></div>\n\n\n\n<ul><li><strong>Battery Monitor:</strong> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bresink.com/osx/BatteryMonitor.html&amp;xcust=1-1-353052-1-0-0&amp;sref=https://www.macworld.com/feed\">This $4.99 utility</a>, available <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/battery-monitor/id413678017?mt=12&amp;xcust=1-1-353052-1-0-0&amp;sref=https://www.macworld.com/feed\">from the Mac App Store</a>, provides great insight into your battery condition and current charging. It also logs information when launched and over time. Because I’ve migrated across multiple laptops, you can see where my 12-inch MacBook Battery dropped in capacity and was replaced under warranty. (Make sure and follow the App Store link: there are similarly named apps trading on its popularity.)</li><li><strong>Coconut Battery:</strong> A free version of <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.coconut-flavour.com/coconutbattery/&amp;xcust=1-1-353052-1-0-0&amp;sref=https://www.macworld.com/feed\">Coconut Battery</a> may provide all you need for checking the basics. A $9.99 Plus upgrade adds more technical and troubleshooting features.</li></ul><p><em>This Mac 911 article is in response to a question submitted by Macworld reader Abantika.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2af128e09b23fcd32a0323c9a9e945c1a84b053941b9b57a1cc17ffeec4cda6f","category":"Apple"}