{"title":"This refurb Apple Watch Ultra with a one-year warranty is $179 off","link":"https://www.macworld.com/article/1805819/this-refurb-apple-watch-ultra-with-a-one-year-warranty-is-179-off.html","date":1683046198000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The Apple Watch Ultra is already a pretty good value for $799 with a 49mm display, 36 hours of battery life, and cellular networking, but we understand if you’d rather wait for a sale. And today’s is pretty great: <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.ebay.com/itm/165868496837&amp;xcust=1-1-1805819-1-0-0&amp;sref=https://www.macworld.com/feed\">eBay Refurbished is selling a refurbished Apple Watch Ultra in “excellent” condition for $620</a>, a savings of $179 on the MSRP, and the best price we’ve ever seen.</p>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/1364168/apple-watch-ultra-review.html\">Apple Watch Ultra</a> is the newest model and features a 49mm display and a rugged titanium design with a raised shelf for the Digital Crown and an extra Action button on the left side. It also has precision dual-frequency GPS, MIL-STD 810H shock resistance, and 100m water resistance for diving. You also get 36-hour battery life and an 86-decibel siren to attract attention if you get stranded. All that plus all of the features in the Apple Watch Series 8, including temperature sensing and Crash Detection.</p>\n\n\n\n<p>If you’re concerned about buying a refurbished watch, the seller, which has 99.9% positive feedback with more than 128,000 ratings, says it “looks like new at first glance” and is backed by a one-year Allstate warranty. It’s also covered by eBay’s refurbished guarantee, which promises “like-new condition with no visible wear” and “extensive testing to make sure it meets the highest standards per condition.”</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2b00ca002eb27e4614868da6f8aa1f12d3d0acfd3944732aab94474b98ae11f7","category":"Apple"}