{"title":"iOS 16 superguide: Everything you need to know about the latest version","link":"https://www.macworld.com/article/631448/ios-16-features-compatibility-how-to-update.html","date":1694111394000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>While we are all anticipating the arrival of iOS 17 later in 2023, Apple is still making improvements to, and fixing problems with, iOS 16. </p>\n\n\n\n<p>Apple’s iOS 16 has been available to be installed on iPhones since September 12, 2022, but while tons of new features arrived in September, and even more in the months that followed, there is still more to come as Apple continues to work on iOS 16.</p>\n\n\n\n<p>In this article, we’ll tell you everything you need to know about iOS 16 and how it’s going to affect your iPhone and iPad experience if you haven’t updated yet. We’ll evaluate the features and design changes, and detail any issues and flaws people are encountering with the software.  </p>\n\n\n\n<p>We’ll also let you know what the latest version of iOS 16 is and what new features it brought. And we’ll reveal what features will be coming in the next update to iOS 16, which is currently being tested by Apple, developers and public beta testers. </p>\n\n\n\n<p>Want to know what’s coming in iOS 17, read our <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17 guide</a>. You may also like to read: <a href=\"https://www.macworld.com/article/1944314/ios-17-small-changes-features-notes-spotlight-medication-timers.html\">iOS 17 features didn’t make the WWDC keynote</a> and <a href=\"https://www.macworld.com/article/1940357/ios-17-features-live-voicemail-autocorrect-contact-posters-standby.html\">iOS 17 features that make us want to upgrade</a>. </p>\n\n\n\n<p><em><strong>Updated September 7, 2023:</strong></em> Apple has released <a href=\"https://www.macworld.com/article/2059345/ios-16-6-1-update-your-iphone-now.html\">iOS 16.6.1</a>. There are no major new features in this release, but there are two important security updates.  </p>\n\n\n\n<h2>iOS 16: Latest version </h2>\n\n\n\n<p>Over a month after iOS 16.6, on September 7, Apple release <a href=\"https://www.macworld.com/article/2059345/ios-16-6-1-update-your-iphone-now.html\">iOS 16.6.1</a> to address two important security vulnerabilities, both of which have been actively exploited.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1923832/ios-16-6-beta-features-release-date.html\">iOS 16.6</a> arrived on July 24 and is a maintenance release that contains important bug fixes and several security updates, including fixes for multiple Kernal and Webkit issues. Apple admitted that it was aware that two of the security issues may have already been actively exploited in the wild (although one of these was addressed in 16.5.1). </p>\n\n\n\n<p>iOS 16.6 beta also contained code to enable iMessage Contact Key Verification. This security measure verifies the authenticity of iMessage users and is aimed at those with high-security demands (like those targeted by state-sponsored digital threats). It’s not yet known if this new function made it into the full version. </p>\n\n\n\n<p>Apple updated iOS 16 on June 21 with security fixes. Apple described as <a href=\"https://www.macworld.com/article/1963538/ios-ipados-16-5-1-security-updates-lightning-usb3-camera-adapter-fix.html\">iOS 16.5.1</a> “important security fixes and is recommended for all users. It also fixes an issue that prevents charging with the Lightning to USB 3 Camera Adapter.” </p>\n\n\n\n<p>Apple released <a href=\"https://www.macworld.com/article/1674501/ios-16-5-features-sports-news-siri-install.html\"><strong>iOS 16.5</strong></a> on May 18, iOS 16.5 includes the following new features: </p>\n\n\n\n<ul>\n<li>A new ‘multi-view’ sports feature for the TV App, which gains a new Sports tab at the bottom of the screen.</li>\n\n\n\n<li>Siri will be able to start screen recording, you just need to say: “Hey Siri, start [or stop] a screen recording.”</li>\n\n\n\n<li>A new Pride Celebration wallpaper for the Lock Screen to honor the LGBTQ+ community and culture.</li>\n\n\n\n<li>A new Sports tab in Apple News as well as a My Sports score and schedule cards linking to information about specific games.</li>\n\n\n\n<li>Fix for issue where Spotlight may become unresponsive.</li>\n\n\n\n<li>Fix for issue where Podcasts in CarPlay may not load content.</li>\n\n\n\n<li>Fixes for issue where Screen Time settings may reset or not sync across all devices.</li>\n</ul>\n\n\n\n<p>iOS 16.5 includes <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT213757&amp;xcust=1-1-631448-1-0-0&amp;sref=https://www.macworld.com/feed\">40 security updates</a> across all aspects of the system, from the Weather app to the cellular modem. Additionally, the update fixes three WebKit flaws that have been actively exploited, two of which <a href=\"https://www.macworld.com/article/1922298/ios-macos-rapid-security-response-webkit-flaw-safari-zero-day.html\">were fixed</a> in the iOS 16.4.1(a) Rapid Security Response update earlier in May.</p>\n\n\n\n<p>Apple issued the <a href=\"https://www.macworld.com/article/1804313/ios-16-4-1-macos-13-3-1-rapid-security-response.html\">Rapid Security Response</a> update for iOS 16.4.1 on 2 May. This was the first time Apple had used the Rapid Security Response system on a regular public release, the ability to release these RSRs means Apple can patch security vulnerabilities quickly, rather than waiting for a larger version release that can take weeks to test. The patch was for iOS 16.4.1 (and iPadOS 16.4.1 and macOS 13.3.1). Apple stated that: “This Rapid Security Response provides important security fixes and is recommended for all users.” The update requires the iPhone to shut down and restart and is about 85.2MB. If you have installed this update it will show on your iPhone as <strong>iOS 16.4.1 (a).</strong></p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1780577/ios-16-4-1-bug-fixes-security-updates.html\">iOS 16.4.1</a> arrived on April 7, it brought a number of bug and security fixes including: </p>\n\n\n\n<ul>\n<li>Pushing hands emoji does not show skin tone variations.</li>\n\n\n\n<li>Siri does not respond in some cases.</li>\n\n\n\n<li>Fixes for two security flaws that allowed for arbitrary code execution. </li>\n\n\n\n<li>It is hoped that the 16.4.1 update fixes the Weather app issue. </li>\n</ul>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1481562/ios-16-4-release-features-emoji-install.html\">iOS 16.4</a> arrived on March 27 and included the following: </p>\n\n\n\n<ul>\n<li>Apple Music Classical support: Apple Music Classical is now available as an app (downloadable from the App Store). You’ll need an Apple Music subscription to use it though.  </li>\n\n\n\n<li>Home update: a Home architecture update briefly arrived in iOS 16.2 before Apple <a href=\"https://www.macworld.com/article/1442447/ios-16-2-upgrade-to-new-home-architecture-pulled.html\">pulled it</a> after sharing issues. The functionality is back in iOS 16.4 and should make the Home architecture “faster and more reliable”. </li>\n\n\n\n<li>New emoji: iOS 16.4 brings with it a bunch of new emoji including a shaking face (to indicate “no”), left and right pushing hands, several new animals (moose, goose, jellyfish), extra food items, new musical instruments and new heart colors.</li>\n\n\n\n<li>Support for web push notifications: Web apps saved to the Home screen will be able to receive live updates (if users grant permission). </li>\n\n\n\n<li>Changes for Beta testers: Testers can go to Settings &gt; General &gt; Software Updates and choose whether to have no beta updates, Developer Beta updates (if applicable), or Public Beta updates.  In addition, to prevent testers from loading beta versions through third-party sites and profiles, Apple will require an Apple ID enrolled in the beta program. This can be a second Apple ID used only for beta access. </li>\n\n\n\n<li>Update to the Podcasts app: An improved Up Next queue and features like episode filtering and the ability to browse by season. </li>\n\n\n\n<li>5G: Standalone support for U.S. T-Mobile users to enable faster speeds where possible. </li>\n\n\n\n<li>Widgets: New Wallet widget to easily track orders. </li>\n\n\n\n<li>Books page turning animation: The corner of the page will fold up to represent page turning–this is a feature that was removed from Apple Books in iOS 16.</li>\n\n\n\n<li>Mastadon support: You will be able to see automatic previews of Mastadon links in Messages.</li>\n\n\n\n<li>Security updates and fixes: iOS 16.4 includes more than 30 security updates. </li>\n</ul>\n\n\n\n<p>For more information read: <a href=\"https://www.macworld.com/article/1660169/ios-16-4-new-features-upgrade-home-architecture-emoji-web-app.html\">Why you will want to update to iOS 16.4.</a></p>\n\n\n\n<p>Before iOS 16.4 <a href=\"https://www.macworld.com/article/1511396/ios-16-3-1-bug-fixes-security-updates.html\">iOS 16.3.1</a> arrived on February 13 and brought bug fixes and critical security updates. The update also improves Crash Detection on iPhone 14, Siri requests for Find My, and iCloud settings. (There is also an iPadOS 16.3.1 update for iPads). </p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1477114/ios-16-3-features-advanced-data-protection-homepod-security.html\">iOS 16.3</a> arrived on January 23, 2023. It’s notable features include support for security keys for Apple IDs and the expansion of Advanced Data Protection to users outside the U.S. It also adds support for the new 2nd-generation HomePod. It also included <a href=\"https://www.macworld.com/article/1473487/16-3-iphone-horizontal-lines-security-updates-screen-time.html\">bug fixes</a> and security updates. </p>\n\n\n\n<p>iOS 16.3 included: </p>\n\n\n\n<ul>\n<li>Emergency SOS calls now require holding the side button with the up or down volume button and then releasing in order to prevent inadvertent emergency calls</li>\n\n\n\n<li>Fixes an issue in Freeform where some drawing strokes created with Apple Pencil or your finger may not appear on shared boards</li>\n\n\n\n<li>Addresses an issue where the wallpaper may appear black on the Lock Screen</li>\n\n\n\n<li>Fixes an issue where the Home Lock Screen widget does not accurately display the Home app status</li>\n\n\n\n<li>Addresses an issue where Siri may not respond properly to music requests</li>\n\n\n\n<li>Resolves issues where Siri requests in CarPlay may not be understood correctly</li>\n\n\n\n<li>Addresses an issue where the wallpaper may appear black on the Lock Screen</li>\n\n\n\n<li>Fixes an issue where the Home Lock Screen widget does not accurately display the Home app status</li>\n\n\n\n<li>Addresses an issue where Siri may not respond properly to music requests</li>\n\n\n\n<li>Resolves issues where Siri requests in CarPlay may not be understood correctly</li>\n\n\n\n<li>Security fixes, including a serious Kernel bug that could allow an app to “execute arbitrary code with kernel privileges” and a Screen Time flaw</li>\n\n\n\n<li>Support for <a href=\"https://www.macworld.com/article/1476747/homepod-2nd-gen-audio-siri-feaures-sensors.html\">HomePod (2nd gen)</a>.</li>\n\n\n\n<li>Black Unity Apple Watch face.</li>\n\n\n\n<li>Advanced Data Protection for all users worldwide, even though the release notes do not mention it.</li>\n\n\n\n<li>Physical security keys for Apple ID: You will be able to secure your Apple ID with a FIDO-certified physical key and it will replace two-factor authentication for ‌Apple ID‌ logins</li>\n</ul>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1361626/ios-16-2-features-release-data-protection-apple-music-sing.html\">iOS 16.2</a> arrived on December 13. Along with the temporary Home update, iOS 16.2 brought a new karaoke feature to Apple Music, improved the always-on display on iPhone 14 Pro, and introduced the Freeform app. </p>\n\n\n\n<p>iOS 16.2 included:</p>\n\n\n\n<ul>\n<li>Apple Music Sing: A new Karaoke experience built into Apple Music. Read more about <a href=\"https://www.macworld.com/article/1427242/apple-music-sing.html\">Apple Music Sing</a>.</li>\n\n\n\n<li>The new Freeform digital whiteboarding app: This will let users collaborate with friends, family, and coworkers on a digital whiteboard sharing sketches, notes, files, web links, documents, photos, video, and audio.</li>\n\n\n\n<li>New always-on display options for iPhone 14 Pro: Two new toggles are available in Settings &gt; Display &amp; Brightness &gt; Always On Display. One can disable the wallpaper when the always-on display is active, the other disables notifications. You can also see Sleep widget data, medications widget data, and live scores from your favorite teams on your lock screen and in Dynamic Island (iPhone 14 Pro and Pro Max only)</li>\n\n\n\n<li>A <a href=\"https://www.macworld.com/article/1375559/ios-16-custom-accessibility-mode-home-screen-interface.html\">major home screen layout change</a> thanks to a new Custom Accessibility Mode: This will provide a more streamlined iPhone experience with customizable features for users with accessibility needs.</li>\n\n\n\n<li>Game Center gained support for SharePlay for game playing in a FaceTime call.</li>\n\n\n\n<li>Advanced Data Protection for iCloud: iCloud Backup, Notes, Photos, and more are protected using end-to-end encryption. You are also able to Turn Off Hide IP Address setting enables iCloud Private Relay users to temporarily disable the service for a specific site in Safari.</li>\n\n\n\n<li>Participant Cursors in Notes so you see live indicators as others make updates in a shared note.</li>\n\n\n\n<li>Older notifications are visible by default: instead of having to swipe up to see old notifications.</li>\n\n\n\n<li>More frequent Live Activities updates.</li>\n\n\n\n<li>Improved search in Messages – find photos based on their content, like a dog, car, person, or text.</li>\n\n\n\n<li>Crash Detection optimizations (iPhone 14 and iPhone 14 Pro)</li>\n\n\n\n<li><a href=\"https://www.macworld.com/article/1377200/apple-to-limit-airdrop-everyone-setting-to-10-minutes.html\">10-minute AirDrop limit</a>: iOS 16.2 limits the “everyone” setting for AirDrop permissions to 10 minutes at a time.</li>\n\n\n\n<li>On the day of the iOS 16.2 release, Satellite SOS arrived in the U.K. and other locations.</li>\n</ul>\n\n\n\n<p>iPadOS users also gain Stage Manager external display support in iPadOS 16.2. External display support for iPads that have the M1 or M2 chip will allow iPad users to hook their tablet up to a secondary display using Stage Manager.</p>\n\n\n\n<p>Prior to iOS 16.2, Apple released <a href=\"https://www.macworld.com/article/1419152/ios-16-1-2-crash-detection-carrier-upgrades-security.html\">iOS 16.1.2</a>, this update included improved crash detection, carrier upgrades and security updates. It came out on November 30. <a href=\"https://www.macworld.com/article/1375998/ios-ipad-16-1-1-bug-fixes-security-updates.html\">iOS 16.1.1</a> included bug fixes and security updates.  About a month after iOS 16.0 arrived, <a href=\"https://www.macworld.com/article/1064548/ios-ipados-16-1-features-release-download-install.html\">iOS 16.1 </a>became available to download on October 24. iOS 16.1 includes several new features and fixes.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1348444/ios-16-0-3-iphone-14-camera-carplay-mailjack.html\">iOS 16.0.3</a> arrived on October 11. The previous iOS 16 update came on September 22. <a href=\"https://www.macworld.com/article/1073336/ios-16-0-2-iphone-14-camera-shake-copy-paste.html\">iOS 16.0.2</a> included a fix for a <a href=\"https://www.macworld.com/article/1070221/iphone-14-pro-camera-shake-bug-tiktok-instagram-snapchat.html\">camera shaking problem</a> iPhone 14 Pro and Pro Max users had been experiencing, and<strong> </strong>iOS 16.0.1<strong> </strong>addressed <a href=\"https://www.macworld.com/article/1069541/iphone-14-ios-16-0-1-activation-issues.html\">an issue with activation and migration</a> during setup.</p>\n\n\n\n<p>Should you update to iOS 16 now? <a href=\"https://www.macworld.com/article/919850/ios-16-update-now-or-wait.html\">We have a guide</a> to help you answer that question. You may also like to read: <a href=\"https://www.macworld.com/article/1433006/ios-16-lock-screen-icloud-home-weather-medications.html\">If you’ve updated to iOS 16.2, do these five things right now</a>.</p>\n\n\n\n<p>Plus, we also have a list of <a href=\"https://www.macworld.com/article/1659017/ios-versions-list.html\">every version of iOS</a> where you can see the latest versions and how long Apple supports iOS for. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/How-to-change-lock-screen-notification-style-iOS-16.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPhone displaying notifications in list-style like that of iOS 15\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/How-to-change-lock-screen-notification-style-iOS-16.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/09/How-to-change-lock-screen-notification-style-iOS-16.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/09/How-to-change-lock-screen-notification-style-iOS-16.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/09/How-to-change-lock-screen-notification-style-iOS-16.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/09/How-to-change-lock-screen-notification-style-iOS-16.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/09/How-to-change-lock-screen-notification-style-iOS-16.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/09/How-to-change-lock-screen-notification-style-iOS-16.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Lewis Painter / Foundry</p></div>\n\n\n\n<h2>Next iOS update release date</h2>\n\n\n\n<p>Apple released iOS 16.4 on March 27, 2023. Apple is now working on testing <a href=\"https://www.macworld.com/article/1674501/ios-16-5-beta-features-release-install.html\">iOS 16.5</a>, with the final version likely to arrive on iPhones in May. We don’t expect much in the way of new features as Apple is likely to be starting to focus on the development of iOS 17. </p>\n\n\n\n<h2>iOS 16: Latest beta version </h2>\n\n\n\n<p>iOS 16.6 was made available for iPhones on July 24. It is unlikely that there will be any major updates to iOS 16 now that Apple is focused on the beta program for iOS 17, however, if there are further security issues the company will again update iOS 16. </p>\n\n\n\n<p>If you want to test the beta of iOS 17, you can register for Apple’s <a href=\"https://www.macworld.com/article/671198/how-to-install-ios-beta.html\">Beta Software Program</a>.</p>\n\n\n\n<h2>New features in iOS 16.6</h2>\n\n\n\n<p><strong>iMessage Contact Key Verification:</strong> The iOS 16.6 betas contain code to enable iMessage Contact Key Verification. This <a href=\"https://www.macworld.com/article/1428568/imessage-security-key-advanced-data-protection-icloud.html\">security measure</a> verifies the authenticity of iMessage users and is aimed at those with high-security demands (like those targeted by state-sponsored digital threats).</p>\n\n\n\n<p>See <a href=\"https://www.macworld.com/article/671198/how-to-install-ios-beta.html\">how to get the iOS beta</a>.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/11/ios-16-custom-accessiblity-mode.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS 16 custom accessibility mode\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/11/ios-16-custom-accessiblity-mode.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2022/11/ios-16-custom-accessiblity-mode.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/11/ios-16-custom-accessiblity-mode.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/11/ios-16-custom-accessiblity-mode.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/11/ios-16-custom-accessiblity-mode.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/11/ios-16-custom-accessiblity-mode.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2022/11/ios-16-custom-accessiblity-mode.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/11/ios-16-custom-accessiblity-mode.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /></figure><p>9to5Mac</p></div>\n\n\n\n<h2>iOS 16: Bugs and problems, known and fixed issues</h2>\n\n\n\n<p>Since the release of iOS 16 the following issues have been highlighted: </p>\n\n\n\n<ul>\n<li>An iOS 16 Mail bug was able to cause an endless loop of app crashes and lock users out of their Mail account. VPN Tracker found that an email from an address with double quotes (“”@macworld.com for example) will cause Mail on iOS 16 to repeatedly crash. <strong>FIXED in iOS 16.0.3</strong></li>\n\n\n\n<li>There were also reports from iPhone 14 users that the <a href=\"https://www.macworld.com/article/1070884/iphone-14-pro-slow-opening-camera-app.html\">Camera app can be slow to open</a>. <strong>FIXED IN iOS 16.0.3</strong></li>\n\n\n\n<li>Some users had a problem where incoming calls and app notifications were not displayed. <strong>FIXED IN iOS 16.0.3</strong></li>\n\n\n\n<li>There was an early issue with low microphone volume in CarPlay. <strong>FIXED IN iOS 16.0.3</strong></li>\n\n\n\n<li>Some users experienced an issue with excessive “copy and paste” alerts when moving text and images between apps. <strong>FIXED IN iOS 16.0.2</strong></li>\n\n\n\n<li>An <a href=\"https://www.macworld.com/article/1070221/iphone-14-pro-camera-shake-bug-tiktok-instagram-snapchat.html\">issue affecting the iPhone 14 Pro camera</a> caused the optical image stabilization sensor to fail to focus properly. <strong>FIXED IN iOS 16.0.2</strong></li>\n\n\n\n<li>A lot of users experienced problems connecting to Wi-Fi. In our experience, a reboot of the iPhone generally enabled it to connect to Wi-Fi again so that the update could be installed. Otherwise, it is possible to install an update over a cellular connection. Any further issues with Wi-Fi might be because settings have changed so check if your iPhone is set to connect automatically to your WiFi network for example, more ideas here: <a href=\"https://www.macworld.com/article/674925/how-to-stop-iphone-dropping-wi-fi-connection.html\">How to stop an iPhone dropping Wi-Fi connection</a>.  <strong>FIXED IN iOS 16.1.1</strong></li>\n\n\n\n<li>Some notes won’t sync with iCloud after updates are made. <strong>FIXED IN iOS 16.2</strong></li>\n\n\n\n<li>As is often the case with a new operating system update, some users have complained of battery drain and other common issues, these issues are usually short-lived and relate to the re-indexing of data.</li>\n\n\n\n<li>Towards the end of September 2022, Apple published a support document that turning on the new iPhone keyboard vibration feature could cost battery life. Apple says, “Turning on keyboard haptics might affect the battery life of your iPhone.”</li>\n\n\n\n<li>In December iPhone users started to complain that they were <a href=\"https://www.macworld.com/article/1443097/iphone-14-horizontal-lines-software-update.html\">seeing horizontal lines when their iPhone 14 Pro Max turns on</a>. Apple has reportedly said the issue relates to software, not hardware. <strong><strong>FIXED IN </strong>iOS 16.3.</strong></li>\n\n\n\n<li>Issue where the wallpaper may appear black on the Lock Screen. <strong><strong>FIXED IN </strong>iOS 16.3</strong>.</li>\n\n\n\n<li>Freeform strokes not appearing on shared boards. <strong><strong>FIXED IN </strong>iOS 16.3</strong>.</li>\n\n\n\n<li>Issue where the Home Lock Screen widget does not accurately display Home app status. <strong><strong>FIXED IN </strong>iOS 16.3</strong>.</li>\n\n\n\n<li>Issue where Siri may not respond properly to music requests. <strong><strong>FIXED IN </strong>iOS 16.3</strong>.</li>\n\n\n\n<li>Issues where Siri requests in CarPlay may not be understood correctly. <strong><strong>FIXED IN </strong>iOS 16.3</strong>.</li>\n\n\n\n<li><a href=\"https://www.macworld.com/article/1519040/ios-16-3-macos-13-2-security-update-crash-reporter-foundation-code-root.html\">Messages and Photos bugs</a> that could leave iOS vulnerable. <strong>FIXED IN iOS 16.3.</strong></li>\n\n\n\n<li>People have been experiencing <a href=\"https://www.macworld.com/article/1682239/weather-app-ios-ongoing-system-issues.html\">issues with the Weather app</a>. Apple has acknowledged the issue, with Apple Support stating on Twitter on April 4 that it is “currently working on a solution for the Weather app outage and will post an update online.” Believed to be <strong>FIXED IN iOS 16.4.1</strong> (or <a href=\"https://www.macworld.com/article/1682239/weather-app-ios-ongoing-system-issues.html\">separate to that update</a>). </li>\n\n\n\n<li>Issue where Spotlight may become unresponsive. <strong>FIXED IN iOS 16.5.</strong> </li>\n\n\n\n<li>Issue where Podcasts in CarPlay may not load content. <strong>FIXED IN iOS 16.5.</strong> </li>\n\n\n\n<li>Issue where Screen Time settings may reset or not sync across all devices. <strong>FIXED IN iOS 16.5.</strong></li>\n\n\n\n<li>Various security flaws.<strong>  <strong>FIXED IN iOS 16.5.</strong></strong></li>\n</ul>\n\n\n\n<h2>iOS 16: How to get the latest version</h2>\n\n\n\n<p>Read this to find out how to install iOS 16 or an update to the operating system: <a href=\"https://www.macworld.com/article/670944/how-to-update-ios-on-your-iphone.html\">How to update iOS on your iPhone</a>. The short version is:</p>\n\n\n\n<ol>\n<li>Open Settings.</li>\n\n\n\n<li>Tap <em>General</em>.</li>\n\n\n\n<li>Tap <em>Software Update</em>.</li>\n\n\n\n<li>You’ll see the update available there, follow the prompts to install it.</li>\n</ol>\n\n\n\n<p>If you <em>don’t</em> want to update straight away read: <a href=\"https://www.macworld.com/article/672135/how-to-stop-an-iphone-from-asking-to-update-ios.html\">How to stop your iPhone from automatically updating to iOS 16</a>.</p>\n\n\n\n<p>When you visit the Software Update page on your iPhone you might see that <a href=\"https://www.macworld.com/article/1065584/ios-15-7-security-updates.html\">iOS 15.7 is there to install </a>and wonder where iOS 16 is. If you want iOS 16 you don’t need to install IOS 15.7 first, you can scroll down below the information about iOS 15.7 and tap on upgrade to iOS 16. </p>\n\n\n\n<p>You don’t have to install iOS 15.7, you can jump straight to iOS 16.</p>\n\n\n\n<p>It’s often the case that the initial new version of iOS is soon followed by a “point update” so you can expect to see iOS 16.0.1 in a week or so to clean up some bugs and prepare for the new iPhone 14. We also expect 16.1 to arrive in October when the iPad receives its update.</p>\n\n\n\n<h2>iOS 16: Compatibility</h2>\n\n\n\n<p>Which Apple devices can install iOS 16? Any from the past five years: anyone with an <a href=\"https://www.macworld.com/article/782233/ios-compatibility-iphone-8-7-6s.html\">iPhone 8 or later</a> will be able to run iOS 16. With the iPad, iOS 16 is compatible with all Pad Pro models,  iPad Air (3rd generation and later), iPad (5th generation and later), iPad mini (5th generation and later).</p>\n\n\n\n<p>That’s the headline but bear in mind that older devices <a href=\"https://www.macworld.com/article/805172/16-beta-features-compatability.html\">may not get the full iOS 16 experience</a> or <a href=\"https://www.macworld.com/article/784171/macos-13-ipados-16-apple-silicon-features.html\">every feature in iPadOS 16</a>. Apple warns, for example, that the new Live Captions accessibility feature is available on iPhone 11 and later, while Door Detection and People Detection require the LiDAR scanner on the iPhone 12 Pro and later.</p>\n\n\n\n<p>This is a big change from last year. At WWDC 2021, Apple announced that iOS 15 would run on very old models, such as the iPhone 6s (2015) and first-generation SE (2016). They’ve both dropped off the supported list, and the iPhone 7 is gone too. If you’ve got one of these iPhones, it may be <a href=\"https://www.macworld.com/article/670458/iphone-buying-guide.html\">time to upgrade</a>.</p>\n\n\n\n<h2>iOS 16: Features</h2>\n\n\n\n<p>iOS 16 is a substantial upgrade. It doesn’t change everything about your iPhone, but it’s filled with fun new features, like these <a href=\"https://www.macworld.com/article/793321/ios-16-best-features-lock-screen-messages-keyboard.html\">Five incredible iOS 16 features that will change the way you use your iPhone</a>. Read on to find out more about the new features that will make your old iPhone feel fresh if you install it:</p>\n\n\n\n<h3>Features that arrived in iOS 16.4 </h3>\n\n\n\n<ul>\n<li>Apple Music Classical support.</li>\n\n\n\n<li>A Home architecture update.</li>\n\n\n\n<li>New emoji.</li>\n\n\n\n<li>Support for web push notifications.</li>\n\n\n\n<li>Changes for Beta testers.</li>\n\n\n\n<li>Update to the Podcasts app.</li>\n\n\n\n<li>New Wallet widget.</li>\n\n\n\n<li>Books page turning animation.</li>\n\n\n\n<li>Mastadon support.</li>\n</ul>\n\n\n\n<h3>Features that arrived in iOS 16.3 </h3>\n\n\n\n<p>iOS 16.2 arrived in February 2023 and brought: </p>\n\n\n\n<ul>\n<li>Change to Emergency SOS calls to prevent accidental emergency calls. </li>\n\n\n\n<li>HomePod support for <a href=\"https://www.macworld.com/article/1476747/homepod-2nd-gen-audio-siri-feaures-sensors.html\">HomePod (2nd gen)</a>.</li>\n\n\n\n<li>Black Unity Apple Watch face.</li>\n\n\n\n<li>Advanced Data Protection for all users worldwide.</li>\n\n\n\n<li>Ability to secure your Apple ID with a FIDO-certified physical key and it will replace two-factor authentication for ‌Apple ID‌ logins</li>\n</ul>\n\n\n\n<h3>Features that arrived in iOS 16.2</h3>\n\n\n\n<p>iOS 16.2 arrived in December 2022 and brought:</p>\n\n\n\n<ul>\n<li>Apple Music Sing</li>\n\n\n\n<li>Freeform – new whiteboarding and collaboration app </li>\n\n\n\n<li>Game Cente<strong>r</strong> support for SharePlay, which will let you start playing a game right away while in a FaceTime call.</li>\n</ul>\n\n\n\n<h3>Features that arrived in iOS 16.1</h3>\n\n\n\n<p>These are the new features that arrived with the first major update to iOS 16. </p>\n\n\n\n<p><strong>iCloud Shared Photo Library</strong></p>\n\n\n\n<p>Apple has added a new way for family members and friends to share photos with each other called Shared Photo Library. It lets you and five people set up an album that you call control, with automated updates and sharing notifications. Learn more about<a href=\"https://www.macworld.com/article/1359156/how-to-set-up-icloud-shared-photo-library-iphone-ipad-mac.html\"> how to set up a Shared Photo Library </a>in our how-to article.</p>\n\n\n\n<p><strong>Live Activities</strong></p>\n\n\n\n<p>Live Activities is a new way of following sports games, Uber journey progress, workouts, and so on from the Lock Screen. You can think of them as notifications that persist and are dynamically updated by their associated apps. There are already <a href=\"https://www.macworld.com/article/1360554/ios-16-1-live-activities-dynamic-island-apps.html\">numerous supported apps</a>.</p>\n\n\n\n<p><strong>Wallet</strong></p>\n\n\n\n<p>The Wallet already had in-app ID verification: a handy option if you don’t want to share personal details with someone, but do need to prove to them that you are over 21, for example. In 16.1 Wallet gained the ability to share digital keys via Messages, Mail, or WhatsApp.</p>\n\n\n\n<p><strong>Matter support</strong></p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://csa-iot.org/all-solutions/matter/&amp;xcust=1-1-631448-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Matter</a> is a new and sorely needed smart-home compatibility standard covering Apple Home, Alexa, and Google Home, among others, and support for Matter is one of the changes coming to Apple’s Home app in iOS 16. There is still work to be done by manufacturers to get everything coordinated, but all devices support the new standard as of iOS 16.1.</p>\n\n\n\n<p><strong>Clean Energy Charging</strong></p>\n\n\n\n<p>On launch day, Apple announced a new feature called <a href=\"https://www.macworld.com/article/1065566/ios-16-clean-energy-charging.html\">Clean Energy Charging</a> that “aims to decrease the carbon footprint of the iPhone by optimizing charging times for when the grid is using cleaner energy sources.” You can find the toggle to turn it on in the <em>Battery Health &amp; Charging</em> settings.</p>\n\n\n\n<h3>Features that arrived in iOS 16</h3>\n\n\n\n<p><strong>Lock Screen</strong></p>\n\n\n\n<p>In iOS 16 Lock Screen is customizable (changing colors and fonts, for example) and upgradable with widgets for keeping an eye on the weather, your Activity rings, or whatever other information you need easy access to. And, rather like the faces on the Apple Watch, it will be possible to create multiple Lock Screens, each with its own wallpaper and widgets, and easily switch between them. See: <a href=\"https://www.macworld.com/article/786981/how-to-customize-lock-screen-ios-16.html\">All the ways you can customize your Lock Screen in iOS 16</a>. We also look at <a href=\"https://www.macworld.com/article/821238/ios-16-how-to-change-lock-screen-notifications.html\">how to keep your Lock Screen clean without missing a notification</a>. New customization options arrived in iOS 16.1 so can now choose to customize the Home screen and Lock screen separately. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Lock-Screen-customization.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS 16 Lock Screen customization options\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Lock-Screen-customization.jpg?quality=50&amp;strip=all 1800w, https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Lock-Screen-customization.jpg?resize=300%2C183&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Lock-Screen-customization.jpg?resize=768%2C469&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Lock-Screen-customization.jpg?resize=1200%2C733&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Lock-Screen-customization.jpg?resize=1536%2C939&amp;quality=50&amp;strip=all 1536w\" width=\"1200\" height=\"733\" /></figure><p>Apple</p></div>\n\n\n\n<p><strong>Battery percentage indicator</strong></p>\n\n\n\n<p>This might seem trivial, but a lot of iPhone users were deeply annoyed when the handy battery percentage indicator disappeared from the top of their device’s screen in 2017. (The notch on the iPhone X was the culprit, of course.) Those users will be pleased to hear that it’s the battery percentage indicator is coming back in iOS 16, albeit on certain devices only. Initially, the iPhone 11, iPhone XR, and the iPhone 12 mini and 13 mini don’t get this feature, but Apple addressed this in an update. We discuss <a href=\"https://www.macworld.com/article/672843/show-battery-percentage-iphone.html\">how to show battery percentage in your iPhone status bar</a> separately.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/08/ios16-battery-status-side-by-side.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS 16 battery status side by side\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/08/ios16-battery-status-side-by-side.jpg?quality=50&amp;strip=all 2832w, https://b2c-contenthub.com/wp-content/uploads/2022/08/ios16-battery-status-side-by-side.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/08/ios16-battery-status-side-by-side.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/08/ios16-battery-status-side-by-side.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/08/ios16-battery-status-side-by-side.jpg?resize=1536%2C1025&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/08/ios16-battery-status-side-by-side.jpg?resize=2048%2C1366&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2022/08/ios16-battery-status-side-by-side.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/08/ios16-battery-status-side-by-side.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /></figure><p>IDG</p></div>\n\n\n\n<p><strong>Notifications</strong></p>\n\n\n\n<p>The way these appear has been tweaked: they now roll in from the bottom of the screen, which seems like a more logical way to present them.</p>\n\n\n\n<p><strong>Focus</strong></p>\n\n\n\n<p>Your choice of Lock Screen, widgets, and Notification settings can now be tied to Focus modes. Apple suggests “a data-rich Lock Screen while you’re using the Work Focus or a photo Lock Screen while you’re using the Personal Focus.” By swiping to a particular Lock Screen, you can trigger the related Focus mode.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Focus-Lock-Screen.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS 16: Link Focus to a Lock Screen\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Focus-Lock-Screen.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Focus-Lock-Screen.jpg?resize=300%2C196&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Focus-Lock-Screen.jpg?resize=768%2C502&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Focus-Lock-Screen.jpg?resize=1200%2C785&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Focus-Lock-Screen.jpg?resize=1536%2C1004&amp;quality=50&amp;strip=all 1536w\" width=\"1200\" height=\"785\" /></figure><p>Apple</p></div>\n\n\n\n<p>There are also now Focus Filters: If you’re in a work Focus mode, for example, you might choose to see only the Safari tabs that relate to a project you’re working on, or filter out irrelevant messages in Messages and Mail.</p>\n\n\n\n<p><strong>Dictation</strong> </p>\n\n\n\n<p>Dictation improvements mean that dictation should be better than ever. We explain <a href=\"https://www.macworld.com/article/820571/how-to-ios-16-dictation-siri.html\">how to use the new dictation features in iOS 16</a> separately.</p>\n\n\n\n<p>Improved Dictation supports using your voice and keyboard together to enter and edit text. You’ll be able to automatically add commas, periods, and question marks as you dictate and add emoji with your voice.</p>\n\n\n\n<p><strong>Audio support</strong></p>\n\n\n\n<p>AirPods (3rd generation), AirPods Pro (1st and 2nd generation) and AirPods Max will gain a new Personalized Spatial Audio feature that uses the TrueDepth camera on iPhone to create a personal profile for Spatial Audio that delivers a more precise and immersive listening experience. </p>\n\n\n\n<p><strong>Haptic keyboard </strong></p>\n\n\n\n<p>In iOS 16 iPhone keyboards will provide haptic feedback while you type. Keyboard haptics will use the Taptic Engine to produce a little “tick” feeling when you touch a key on the keyboard. To find out how to use the feature read: <a href=\"https://www.macworld.com/article/784240/how-to-ios-16-keyboard-haptics-toggle-settings.html\">How to enable keyboard haptic feedback in iOS 16.</a> Also read: <a href=\"https://www.macworld.com/article/784240/ios-16-how-to-haptic-feedback-keyboard.html\">iOS 16’s haptic keyboard is the best feature you haven’t found yet</a>.</p>\n\n\n\n<p><strong>Live Text and Visual Look Up</strong></p>\n\n\n\n<p>Live Text now applies to video as well as still images. Pause a video and the text will become ‘live’ for copying or translating. Apple says Live Text is going to provide quicker access to translation and currency-conversion tools, too.</p>\n\n\n\n<p>The related <a href=\"https://www.macworld.com/article/351513/ios-15-how-to-search-inside-your-photos-using-visual-look-up.html\">Visual Look Up</a> feature–which was introduced in iOS 15 and uses AI to identify plants, animals, and landmarks in your photos–also gets an update. For a start, it can now recognize birds, insects, and statues as well. But separately, it can use that same AI to detect the edges of pictured objects and enable you to tap and hold to lift them out of a photo and into other apps such as Messages. Spot a cute dog in a photo? Snip it out and pop it in an iMessage so others can enjoy it too. See: <a href=\"https://www.macworld.com/article/790950/how-to-remove-subject-from-an-image-ios-16.html\">How to instantly lift the subject out of nearly any image</a>.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Visual-Look-Up-dog.jpg?quality=50&amp;strip=all\" alt=\"Visual Look Up in iOS 16: Drag image into Messages\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Visual-Look-Up-dog.jpg?quality=50&amp;strip=all 1070w, https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Visual-Look-Up-dog.jpg?resize=300%2C191&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/06/iOS-16-Visual-Look-Up-dog.jpg?resize=768%2C489&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"652\" /></figure><p>Apple</p></div>\n\n\n\n<p><strong>Siri</strong> </p>\n\n\n\n<p>A new Easy Shortcuts setup makes it possible to run shortcuts with Siri as soon as you download an app with no upfront setup. You’ll can also send messages without Siri asking you to confirm before sending. </p>\n\n\n\n<p>A new ability to ask “Hey Siri, what can I do here?” helps users discover Siri’s capabilities in iOS and apps. And you can end calls by saying: “Hey Siri, hang up.”</p>\n\n\n\n<p><strong>Search</strong></p>\n\n\n\n<p>Search on the Home Screen will enable Spotlight to be accessed directly from the bottom of the Home Screen, making it easy to open apps, find contacts, or get information from the web.</p>\n\n\n\n<p>However, some people find the Home Screen Search button distracting, so we have this tutorial: <a href=\"https://www.macworld.com/article/1068350/ios-16-how-to-remove-the-search-button-from-your-iphones-home-screen.html\">How to remove the search button from your iPhone’s home screen</a>.</p>\n\n\n\n<p><strong>Changes to apps</strong> </p>\n\n\n\n<p>As usual, a number of changes will be coming to the included Apple apps, including: </p>\n\n\n\n<p><strong>Messages</strong></p>\n\n\n\n<p>There are three big changes in Messages. You can 1) edit, 2) unsend messages after they’re sent, and 3) mark any thread as Unread. Less momentously, there are lots of new visual elements for customizing your Memoji, including new hairstyles and headgear, nose shapes, and poses. Read  <a href=\"https://www.macworld.com/article/793097/ios-16-how-to-edit-unsend-imessages-iphone.html\">How to edit and unsend text messages on your iPhone</a>. </p>\n\n\n\n<p>iOS 16.2 added improved search in Messages for finding photos based on their content, like a dog, car, person, or text.</p>\n\n\n\n<p><strong>Mail</strong></p>\n\n\n\n<p>New tools include scheduled sends and, very briefly, the ability to recall sent messages. Mail should detect and warn users of forgotten attachments, and there are new Remind Later and Follow Up features for nudging the user when either they or a recipient hasn’t responded to an email. See: <a href=\"https://www.macworld.com/article/793097/how-edit-unsend-messages-iphone.html\">How to edit and unsend messages on iPhone</a>. We also cover <a href=\"https://www.macworld.com/article/809897/how-to-macos-ventura-undo-send-schedule-email.html\">how to edit and unsend emails on Mac</a>. </p>\n\n\n\n<p><strong>Maps</strong> </p>\n\n\n\n<p>New multi-stop routing supports adding up to fifteen stops along your driving route in Maps. It is also possible to see low balances and replenish Transit Cards when you add transit cards to Wallet, all without leaving Maps. And transit fares show you how much your journey will cost in the San Francisco Bay Area, London, New York, and San Diego.</p>\n\n\n\n<p><strong>Safari</strong></p>\n\n\n\n<p>In Safari, Shared <a href=\"https://www.macworld.com/article/349519/safari-15-macos-12-monterey-big-sur-tab-bar-groups-design-sidebar-how-to.html\">Tab Groups</a> let you share a set of tabs with others and see the Tab Group update instantly as you work together. Tab Group start pages can be customized with different background images and favorites for each Tab Group. Pinned tabs in Tab Groups enable you to pin frequently visited websites for each Tab Group. </p>\n\n\n\n<p>Safari web page translation will add translation for web pages in Turkish, Thai, Vietnamese, Polish, Indonesian, and Dutch.</p>\n\n\n\n<p><strong>FaceTime</strong></p>\n\n\n\n<p>Handoff in FaceTime allows you to move FaceTime calls seamlessly from your iPhone to your iPad or Mac, and vice versa.</p>\n\n\n\n<p><strong>Memoji</strong> </p>\n\n\n\n<p>Memoji gets more sticker poses, hairstyles, headwear, noses, and lip colors.</p>\n\n\n\n<p><strong>Quick Note</strong> </p>\n\n\n\n<p>Quick Note adds support for taking a note in any app on your iPhone and adding links to create context and easily find content.</p>\n\n\n\n<p><strong>Home</strong> </p>\n\n\n\n<p>A redesigned Home app arrived in iOS 16.2, it is easier to navigate, organize, view, and control your smart home accessories. The Home tab will integrate all your accessories, rooms, and scenes into a single tab for a whole-house view, allowing you to see your entire home at a glance. There will be categories for lights, climate, security, speakers and TVs, and water let you quickly access all the relevant accessories organized by room, and displays more detailed status information. And a new camera view displays up to four cameras front and center in the Home tab, scroll to see any additional camera views in your home. </p>\n\n\n\n<p><strong>Photos</strong> </p>\n\n\n\n<p>Duplicate detection in Photos identifies duplicate photos so you can quickly clean up your library.</p>\n\n\n\n<p>Plus the Foreground blur for portrait photos in Camera will blur objects in the foreground for a more realistic-looking depth-of-field effect (iPhone 13, iPhone 13 Pro, and iPhone 13 Pro Max).</p>\n\n\n\n<p><strong>Translate</strong> </p>\n\n\n\n<p>You’ll can now translate text around you using the camera in the Translate app.</p>\n\n\n\n<p><strong>Reminders</strong> </p>\n\n\n\n<p>Pinned lists help you quickly navigate to your favorite lists.</p>\n\n\n\n<p><strong>Apple Pay</strong></p>\n\n\n\n<p>Apple announced two new ventures here: Apple Pay Later (a method of paying in four equal payments over six weeks, available initially in the US only) and Apple Pay Order Tracking (which provides receipts and order tracking information in Wallet for purchases made using Apple Pay).</p>\n\n\n\n<p><strong>Health</strong> </p>\n\n\n\n<p>A new medications feature helps you track and manage your medications, vitamins, and supplements by creating a list, custom schedules and reminders, and then viewing logging over time</p>\n\n\n\n<p>You’ll be able to add medications using your iPhone camera (iPhone XS, iPhone XR, and later). Interaction alerts will inform you if there is a critical interaction when you add a new medication. </p>\n\n\n\n<p>Cycle deviation notifications alert you if your logged menstrual cycles show a pattern of infrequent periods, irregular periods, prolonged periods, or persistent spotting. </p>\n\n\n\n<p>You’ll be able to share information with loved ones – and they’ll be able to easily and securely share their health data with you. </p>\n\n\n\n<p><strong>News</strong></p>\n\n\n\n<p>My Sports enables you to easily follow your favorite teams and leagues and watch highlights right in the News app. Favorites will give you easy access to the channels and topics you read the most at the top of your Today feed. There is also a visually updated home page that will be easier to navigate, with topic feeds for local news locales, sports teams, and leagues. </p>\n\n\n\n<h2>Security features<strong> </strong></h2>\n\n\n\n<p>As usual there are a number of changes that Apple is making to improve security and privacy, including:</p>\n\n\n\n<p><strong>Passkey</strong></p>\n\n\n\n<p>Passkeys offers support for an easier and safer sign‑in method to replace passwords.</p>\n\n\n\n<p>Passkey syncing through iCloud Keychain makes your passkeys available across all your Apple devices while keeping them end-to-end encrypted.</p>\n\n\n\n<p><strong>Family Sharing</strong> </p>\n\n\n\n<p>There is an improved child account setup to make it easier to create an account for a child with the right parental controls, including age‑appropriate media restrictions. </p>\n\n\n\n<p>You’ll be able to use Quick Start to easily set up a new iOS or iPadOS device for your child with your selected parental controls in place.</p>\n\n\n\n<p>Screen Time requests in Messages will make it even easier to approve or decline requests from your child.</p>\n\n\n\n<p>Plus Family Checklist will give you tips and suggestions like updating a child’s parental control settings, turning on location sharing, or just reminding you to share your iCloud+ subscription with everyone.</p>\n\n\n\n<p><strong>Safety Check</strong></p>\n\n\n\n<p>This important privacy feature, designed to aid those experiencing domestic violence or similar issues, lets you monitor who you’ve granted access to your permissions, and revoke them easily. It can be used to reset system app privacy permissions, and to restrict Messages and FaceTime to the device you’re currently using.</p>\n\n\n\n<p>Emergency reset lets users quickly take action to reset access across all people and apps, including disabling location sharing via Find My, resetting privacy permissions for apps, and more. </p>\n\n\n\n<p><strong>Accessibility</strong></p>\n\n\n\n<p>Door detection will locate a door, reads signs and symbols around it, and gives users instructions for how to open the door (iPhone 12 Pro and iPhone 13 Pro). </p>\n\n\n\n<p>Apple Watch mirroring will provide full control of the Apple Watch from iPhone and supports the use of Switch Control, Voice Control, or any other assistive features on the iPhone to get the most out of an Apple Watch.</p>\n\n\n\n<p>Live Captions (beta) automatically converts audio into text for users who are Deaf or hard of hearing to follow along more easily with calls and media content (iPhone 11 and later).</p>\n\n\n\n<p>Buddy controller helps users with cognitive disabilities get support from a caregiver or friend while playing a game, by combining inputs from multiple game controllers into one.</p>\n\n\n\n<p>VoiceOver will be available in over 20 new languages and locales, including Bangla (India), Bulgarian, Catalan, Ukrainian, and Vietnamese.</p>\n\n\n\n<p>Voice Control spelling mode gives you the option to dictate names, addresses, or other custom spellings. </p>\n\n\n\n<p><strong>Miscellaneous changes and new features</strong></p>\n\n\n\n<p>These are the highlights of iOS 16’s new features set, but there are far more small tweaks that you’ll gradually discover after installing the OS in the fall. Some will only slightly massage your day-to-day experience, while others will hold hidden significance. </p>\n\n\n\n<p>A change in the way firmware information is presented, for example may <a href=\"https://www.macworld.com/article/830170/updating-your-airpods-might-be-about-to-get-a-lot-easier.html\">allow manual AirPods updates</a> for the first time. Another new feature is the ability to verify your device and account in the background, without any <a href=\"https://www.macworld.com/article/792421/new-ios-16-feature-will-let-iphone-users-bypass-annoying-captchas.html\">need to deal with CAPTCHAs</a>.</p>\n\n\n\n<p>For more updates along these lines, we’ve rounded up the <a href=\"https://www.macworld.com/article/782950/ios-16-little-details-small-features.html\">smaller features and changes</a> that will make a big difference in how you use your iPhone.</p>\n\n\n\n<p>If you’d like a broader exploration of the new capabilities coming to your iPhone this year, read our guide to the <a href=\"https://www.macworld.com/article/769466/ios-16-top-features-lock-screen-notifications-dictation-message-photos.html\">top new iOS 16 features</a>, and our thoughts on <a href=\"https://www.macworld.com/article/793321/ios-16-features-use-every-day.html\">the iOS 16 features you’ll actually use</a>. </p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2b0cf7303a55069d74d98359f92183c5a1422df7c80f3b125e92da5b541fda0e","category":"Apple"}