{"title":"Apple ออกรายงาน ระบุผู้ใช้ iOS ต้องโหลดแอปผ่าน App Store เท่านั้น ก็เพื่อความปลอดภัยในการใช้งาน","link":"https://www.blognone.com/node/123355","date":1624450847000,"content":"<div><div><div><p>แอปเปิลออกเอกสารรายงาน ซึ่งเป็นส่วนหนึ่งของการชี้แจงต่อหน่วยงานกำกับดูแลในสหรัฐ อังกฤษ และยุโรป จากประเด็นการผูกขาดทางการค้าในแพลตฟอร์มบนมือถือ ซึ่งแอปเปิลไม่เปิดให้ผู้ใช้งานลงแอปจากแหล่งภายนอกได้เอง หากไม่ผ่าน App Store ที่เป็นระบบของแอปเปิลเอง</p>\n<p>คำอธิบายของแอปเปิลอาจไม่มีประเด็นใหม่หากติดตามเรื่องนี้มาตลอด โดยแอปเปิลย้ำว่าการให้ผู้ใช้งานโหลดแอปจากแหล่งภายนอกได้เอง เป็นการลดความปลอดภัยของ iOS เพิ่มความเสี่ยงในการใช้งาน โดยยกตัวอย่างเช่น เด็กสามารถดาวน์โหลดเกมที่พ่อแม่ไม่สามารถควบคุมผ่าน Parental Control ได้, แอปอาจเข้ามาล็อกโฟลเดอร์ภาพถ่ายได้, แอปอาจเก็บข้อมูลเบื้องหลังโดยผู้ใช้งานไม่รู้ตัวได้ เป็นต้น</p>\n<p>เมื่อเทียบข้อจำกัดนี้กับคอมพิวเตอร์ แอปเปิลบอกว่าแพลตฟอร์มมือถือมีความแตกต่าง เนื่องจาก iPhone ถูกใช้งานและเก็บข้อมูลสำคัญมากกว่า เช่น การเงินธนาคาร ข้อมูลสุขภาพ รวมถึงรูปถ่ายส่วนตัว ฉะนั้นการป้องกันการถูกโจมตีจึงต้องมีการควบคุมที่มากกว่า</p>\n<p>ด้านข้อมูลจากฝ่ายแย้งในประเด็นนี้บอกว่า แอปเปิลสามารถเปิดให้ดาวน์โหลดแอปภายนอกมาลงเองได้ โดยไม่มีผลกระทบต่อความปลอดภัย เรื่องทั้งหมดเกี่ยวกับผลประโยชน์ใน App Store มากกว่า</p>\n<p><a href=\"https://www.apple.com/privacy/docs/Building_a_Trusted_Ecosystem_for_Millions_of_Apps.pdf\">สามารถอ่านเอกสารดังกล่าวได้ที่นี่</a></p>\n<p>ที่มา: <a href=\"https://www.theguardian.com/technology/2021/jun/23/letting-users-bypass-app-store-would-be-security-risk-says-apple\">The Guardian</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e054398dae4e1cf68d8837492587a49e.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/app-store\">App Store</a></div><div><a href=\"/topics/apple\">Apple</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2b0f895d48837c77656a46648b048fa8015f8f673bdf166922c98afe56aa29d1","category":"Thai"}