{"title":"Jonas Vingegaard: The revelation of this year’s Tour de France","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/jonas-vingegaard-the-revelation-of-this-year-s-tour-de-france","date":1626449022000,"content":"\n      <p><span>“In theory, Jonas can be a Grand Tour contender himself. He also has a good time trial. But he needs time for his development. In that regard nothing is better than riding a Grand Tour with Steven and with Primoz, supporting them and also learning from them.”</span></p>\n<p><span>These were the words of Jumbo–Visma sports director Grischa Niermann back when the team announced that Jonas Vingegaard would complete their Tour de France line-up in 2021. In hindsight, after the three weeks of racing we’ve watched, Niermann’s comments seem laughable. But he can’t be blamed for underestimating the talent of Vingegaard, it would be fair to say that much of the cycling community did the same.</span></p>\n<div></div>\n<p><span>The Danish rider is in his first ever Tour. His best result in a stage race is 2nd in Itzulia Basque Country earlier this season, to his teammate Primoz Roglic. At such a young age, and with very little experience, it was a fair assumption that Vingegaard would play the role of a strong domestique in the Tour de France, supporting his more accomplished colleagues. He was coming to the Tour de France to learn, but it’s become clear that this is a rider who can learn very quickly.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-breakout-riders-of-the-tour-de-france\">Related: The Breakout Riders of the 2021 Tour de France</a></em></strong></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210715TDF0028-A.S.O._Charly_Lopez_1024x1024.jpg?v=1626443026\" /></span></p>\n<p><span>As a country without high mountains, it’s rare for riders like Vingegaard to come from Denmark — more commonly producing athletes with the talent for sprints or punchy classics. Vingegaard, though, was born to climb. At 60kg, he was made for the peaks, and is on track to give the Danes their best result in the Tour since Bjarne Riis won in 1996.</span></p>\n<p><span>Jumbo–Visma came into the race with full ambitions to support Primoz Roglic to a GC win. After last year’s heartbreak when Pogacar snatched the yellow jersey on the penultimate stage, this year’s Tour was about vengeance. It was about redemption for Roglic. But plans were dashed when the Slovenian had multiple crashes in the early days of the race: he lost time to all his major competitors and fell rapidly down the GC.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tadej-tommorow-always\">Related: Tadej Pogacar – from Slovenian village unicyclist to Tour de France Champion</a></em></strong></p>\n<p><span>It looked like it would be Wout van Aert who could save the day for Jumbo, he was second in GC at this point and Sepp Kuss seemed to be on duty to help the Belgian. Vingegaard also crashed and had to chase back on alone, still not taken seriously as a strong contender for the overall. In press releases, the team made it clear that Vingegaard would not be their leader: “In the future we will set higher goals for Jonas in the Tour de France, but that will not be for this year,” they wrote. Roglic’s multiple injuries eventually led him to retire after Stage 8. This was the second blow to the Dutch outfit who’d already lost super-domestique Robert Gesink on Stage 3.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210714TDF1055-A.S.O._Pauline_Ballet_1024x1024.jpg?v=1626443050\" />It took Vingegaard’s ride in the second alpine stage of the race to get his deserved recognition. He finished alongside Pogacar and catapulted himself to 4th in the GC, asserting himself as a true contender for the podium in Paris. Since then, Vingegaard has gone from strength to strength. </span></p>\n<p><span>While his teammate, Van Aert, made headlines with his solo victory on the Ventoux stage, the young Danish prodigy moved up to third overall, even distancing the yellow jersey over the second summit of Ventoux, the only rider to have been able to do this in the Tour so far this year. He then made his way safely through the first stage of the Pyrenees, all of this was without the usual tactics we might expect to see from riders challenging the general classification. His teammate, Sep Kuss, for example, went for the Stage 15 win, on the toughest mountain finish of the race so far. It worked out in the end, but it was a risky strategy, if Vingegaard had a tough day and needed to be paced back to the group, he didn't have all his teammates around him.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/mont-ventoux-fear-and-the-mountain\">Related: Mont Ventoux, fear and the mountain</a></em></strong></p>\n<p><span>It seems like it has taken Vingegaard’s outstanding performances in the latter stages of this year’s Tour for him to get the treatment of a GC leader. You can’t help but wonder: if he’d had the full support of his team from the start of this race, would he be any closer to Tadej Pogacar in Paris? He proved himself able to ride with the Slovenian in the mountains, and finished only 27 seconds behind him in the first ITT of the race.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1327509030_1024x1024.jpg?v=1626443078\" /></span></p>\n<p><span>“I started the Tour in the service of Primoz, but I had not dared to dream this,” Vingegaard said after yesterday’s brutal Pyrenean stage. </span><a href=\"https://www.dr.dk/sporten/cykling/video-fisk-og-bjerge-danmarks-naeste-bjergrytter-kommer-fra-thy#!/\" target=\"_blank\"><span>Working part-time in a fish factory</span></a><span> only a couple of years ago, it’s fair to say that no one could have imagined his meteoric rise to the top. In a sport where mental fortitude can often be as important as physical strength, his ability to handle the pressure of his first Tour de France, and the fearlessness he’s shown in his riding presents Vingegaard as a future yellow jersey winner. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-column-is-it-time-to-ditch-the-white-jersey\">Related: Is it time to ditch the white jersey?</a></em></strong></p>\n<p><span>He looks to have the ability to hold onto his second place on GC in tomorrow’s individual time trial. The Dane finished over one minute ahead of Carapaz in the first ITT of the race, and tomorrow's course is over a similar parcour.</span></p>\n<p><span>Vingegaard’s success could well be classed as the most exciting story in the GC battle at this year’s Tour de France. Pogacar’s wins have been impressive, but after a few mountain stages we came to expect them. This 24-year-old from Denmark, though: he’s making his Tour debut, he came in purely as a helper, yet he’s overcome all obstacles to announce himself as one of the most promising riders of this generation. </span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2b15308ed8c8b5ba0a934be8f74c908fa9d64b05a0086a393c8c4f316ea6ebe6","category":"Cycling"}