{"title":"162 The role of functional amino acids in optimizing nutrition and health","link":"https://academic.oup.com/jas/article/102/Supplement_3/126/7757322?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The ability of a diet or an individual protein-containing ingredient to satisfy the indispensable amino acid (IAA) requirements of an individual is a reflection of protein quality. In human nutrition, the concept of PQ is well recognized and widely applied to facilitate guidance on the extensive range of food items we consume. In the pet food industry, the concept of PQ is gaining recognition as a way in which to identify ideal candidate ingredients for diet formulation and our laboratory has recently completed a large data base of PQ estimates of typical ingredients used in the pet food industry to compliment the emerging PQ ingredient data. Our laboratory has also used more advanced methodologies, specifically the IAAO technique, to measure the dietary Phe, Trp, Met, Thr, and Lys requirements for adult dogs of small, medium and large breed dogs. The role of AA beyond support of protein turnover (adults) or protein deposition (growth) is being explored, such as the role of certain AA in behavior, immune function and inflammation. For example, the ratio of tryptophan to the large neutral amino acids of 0.75:1.0 in contrast to 0.46:1.0 resulted in better indices of gut health and may reduce agonistic behaviors both of which are underpinned by improved serotonergic status. The role of the sulfur AA in the development of dilated cardiomyopathy further highlights the role of IAA as sources for secondary metabolites, such as taurine and glutathione in supporting animal health. Indeed, many AA are becoming referred to as functional AA and the requirement of these AA may differ in healthy and challenged animals and deserve attention in dog and cat nutrition as well. Overall, the pattern of AA that defines the requirement of healthy dogs and cats, may not be the pattern that would support the animal under challenging conditions. Research into supporting different physiological challenges and how these may affect amino acid requirements is warranted.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2b1508e0065ea3aeeaef4ea9ff89bf331e29021710bcc6576963447dd9a1d351","category":"Environment"}