{"title":"Applications and Directions for Electrically Driven Ultrafast Electron Microscopy","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.708/7719609?rss=1","date":1721779200000,"content":"<span>Ultrafast electron microscopy (UEM) has become one of the most powerful techniques for elucidating time-resolved structural dynamics on the nanometer-picosecond spatiotemporal scales. Classically, the pump and probe have been derived from ultrafast laser pulses, analogous to time-resolved spectroscopy. Laser-driven excitation has spurred discoveries including temperature dependent phase transitions and thermal transfer mechanisms such as phonon propagation. Recently, electronic methods including RF cavity sweeping and DC chopping have produced electron pulses that are approaching the imaging capabilities of a continuous electron beam [<a href=\"#ozae044.708-B1\">1-5</a>]. At Brookhaven National Laboratory, we have developed and optimized an RF pulser that can be tuned to create a variety of pulsed electron beams at different frequencies and pulse durations to enable visualization of numerous physics phenomena. Additionally, AC and RF induced dynamics have been realized by replacing lasers with electronic systems. However, differences in the techniques are accompanied by previously unknown complications such as holder efficiency, timing parameters along with the need for novel controls. Here, I will discuss technological and application-based advancements in electrically driven UEM and how our microscope can probe various materials dynamics at different frequency regimes while utilizing a wide variety of excitation sources. I will also discuss some materials physics such as the excitation of spin-waves in permalloy thin films and surface acoustic wave propagation from interdigitated transducer device structures.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"2b1759fe904bca10db38136c14a6445b8cdd8bce239f3999fa70495eb920c6f4","category":"Environment"}