{"title":"Rachel Jary's five things to look forward to at Rouleur Live 2023","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/rachel-jarys-five-things-to-look-forward-to-at-rouleur-live-2023","date":1696257871000,"content":"\n      <p><span>It’s that time of year again. The racing is coming to a stop for the season and this gives way for multiple things. Firstly, raging rumours about WorldTour transfers – and in the case of 2023, team mergers – and secondly (much more fun) it’s a time for professional riders to let their hair down and do something other than racing their bikes for a living. Every year, Rouleur Live is the perfect place for this – it’s one big party in central London with the best brands and some of the most famous riders in the sport. Always the first weekend in November, and always a weekend to remember.</span></p>\n<div></div>\n<p><span>For the last few months, the team at Rouleur have been beavering away in the background putting together a star studded line-up for the 2023 edition of Rouleur Live. From TikTok stars, to Queens of Hell, to the biggest thinkers in the bunch, to the snazziest bike tech on the market and more, here’s what I’m most looking forward to at <a href=\"https://www.rouleur.cc/pages/rouleur-live\">Rouleur Live 2023</a>.</span></p>\n<h3>How do you conquer Hell?</h3>\n<p><span>Every year, Paris-Roubaix is my favourite race to cover as a cycling journalist. There’s just nothing quite like the feeling of being in the famed velodrome as the crowd erupts and a rider takes a historic victory. As the winner manically celebrates and I muscle my way into a press scrum to try and get my recorder to pick up a few words of their interview, the adrenaline buzz hits like no other race in the season. When a Paris-Roubaix Femmes was run for the first time in 2021 and Lizzie Deignan took a solo win in her first season back after having her daughter, the feeling of adrenaline in the velodrome was laced with emotion about what that victory meant. It was a win for people everywhere who have been told that something is too hard for them. Deignan proved that women can, and will, conquer the cobbles.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_6094_a8c951d4-1ed2-45cd-bfa5-29d013b5ab8f_1024x1024.jpg?v=1695980997\" /><em><span>Image: Peter Stuart</span></em></span></p>\n<p><span>A year later, Elisa Longo Borghini’s solo win was another that has gone down in the history of women’s cycling. The Italian rider did the unexpected by securing a second win for Lidl-Trek (then Trek-Segafredo), for the second year in a row and the photos of her crossing the finish line in the Italian tricolour will long be etched in my memory. This year, Alison Jackson’s sprint from the breakaway that no one thought ever had a chance of making it to the finish was breathtakingly exciting. Jackson passionately belting the Canadian national anthem on the podium was the icing on the cake.</span></p>\n<p><span>To have Deignan, Longo-Borghini and Jackson all on stage together at Rouleur Live 2023 is something that’s never been done before and it will undoubtedly be a fascinating conversation. It’s three women at the very top of the sport, who won Roubaix in three very different ways, in three very different conditions – dust, mud, rain and heat – and they will all give very different perspectives on the race. Ever wondered how to win Paris-Roubaix? These are the people who will be able to tell you.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/pages/rouleur-live\" target=\"_blank\">Buy tickets for Rouleur Live 2023</a></em></strong></p>\n<h3>The world according to G</h3>\n<p><span>What’s occurring, G? I, like the majority of the cycling world, have been taken by Geraint Thomas and Luke Rowe’s candid honesty on their podcast this season – it’s a rare eye-opener to what really goes on the professional peloton. When the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> went south for Thomas this year and he struggled through despite his general classification hopes being out of the window, his stories and anecdotes on the podcast were a true representation of the hardships of the sport. Thomas is one of the few current riders who treats fans to real insights into how he feels about his season, and I have no doubt he’ll bring some hot takes and good answers to his interview at Rouleur Live on Saturday.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-SWpix-Giro-3042-_1_1024x1024.jpg?v=1695981071\" /><em><span>Image: Zac Williams/SWpix</span></em></span></p>\n<p><span>I’m interested to hear Thomas’ thoughts on the changing peloton in recent seasons – we’ve gone from Team Sky/Ineos dominance in the Grand Tours to Jumbo-Visma taking a clean sweep of all three in 2023. What does this mean for the Ineos Grenadiers, and for the future of the sport in general? Where does Thomas see his career going after this season? Did his success at the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia</a> change anything. Has he got another Grand Tour in him, or is it time to wind down and head towards retirement? There’s a lot of questions to pose to the Welshman, and his openness on his podcast tells me that it will be a revealing and engaging chat in London.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/pages/rouleur-live\" target=\"_blank\">Buy tickets for Rouleur Live 2023</a></em></strong></p>\n<h3>Learning TikTok from the best</h3>\n<p><span>A part of Gen Z, I have been successfully pulled into the weird and wonderful world of TikTok in recent years. From videos on the best way to clean your house, to animals doing funny things, to fashion inspiration and dancing trends, I’m guilty of getting deep into a doom scrolling hole on the app some evenings. One person who clearly shares this – sometimes unhealthy – obsession is Paris-Roubaix Femmes winner Alison Jackson. Her dances with the Paris-Roubaix cobblestone trophy finally bridged the gap between my two obsessions: cycling and TikTok, and I’m hoping Jackson is open to teaching me, and the audience at Rouleur Live, how she’s harnessed the power of the latest social media phenomenon to build herself an even bigger audience.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_0593-_1_1024x1024.jpg?v=1695981106\" /><em>Image: Alex Whitehead/SWpix</em></span></p>\n<h3>A deep thinker in the peloton</h3>\n<p><span>If you haven’t seen </span><i><span>that</span></i><span> Matej Mohorič interview after his Stage 19 win at this year's Tour de France, go and watch it – and make sure you have some tissues handy. Mohorič outlined the hardships of being a professional cyclist, discussing the sacrifices riders have to make regularly to stay at the top of the sport in terms of spending time with their families and friends. He talked about imposter syndrome and the internal conflict he felt when he’d worked with Kasper Asgreen throughout the stage in the breakaway to stay away, but then outsprinted him at the line. Mohorič’s words made for one of the most interesting and profound post-race interviews ever, and only highlighted the complexity of his character.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-01065_1024x1024.jpg?v=1695981215\" /></span></p>\n<p><span>Mohorič will be on stage at Rouleur Live 2023, talking about the circumstances that led up to his Tour de France stage win and why it meant so much, as well as delving deeper into what he revealed in that famous interview. The Slovenian rider has long been one of the most exciting riders in the peloton, known for his dropper post use in Milan-Sanremo and wild bike handling skills. I’m hoping I can get some descending tips from Mohorič while he’s there, too…</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/pages/rouleur-live\" target=\"_blank\">Buy tickets for Rouleur Live 2023</a></em></strong></p>\n<h3>Getting my geek on</h3>\n<p><span>Aside from the talks from professional riders on stage, Rouleur Live is also about getting to see some of the most impressive bike tech of the modern era. Each year, the best brands come to exhibit their most famous and unique products, and there’s nothing better than wandering around the show and seeing what you can spot.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/van-der-Poel-Canyon01_tdf_2023-_1_1024x1024.jpg?v=1695997686\" /><em><span>Image: James Startt</span></em></span></p>\n<p><span>There’s no doubt that the likes of Cervélo and Canyon will be bringing some race-winning bikes – both have an abundance of options with Grand Tour, World Championship and Olympic wins to their name. The same can be said for the likes of Pinarello and Colnago, both brands who make some stunning, race-winning bikes to drool over. There’s independent clothing brands like Angry Pablo on show, as well as nutrition brands like Maurten and Styrkr, helmets and glasses from Kask and Koo, tyres from Pirelli and everything indoor training from Wahoo, not to mention some stunning custom bike builds and much more. The Rouleur Live showroom is a bike nerd’s heaven.</span></p>\n<p><em><span>Cover image: Alex Whitehead/SWpix</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2b1e6299bc5d0aca6baa78f1b603ae90f52cf4578e6f9acc4eaa23498c35a278","category":"Cycling"}