{"title":"2021 Philly Bike Expo: Engin Cycles Process Frame Fixture – Drew Guldalian & Jarrod Bunk","link":"https://theradavist.com/2021/12/engin-cycles-process-frame-fixture/","date":1639327521000,"content":"<p><em>Philly local, Drew Guldalian of Engin Cycles, is renowned for his titanium bicycle fabrication (recall his beautiful <a href=\"https://theradavist.com/2019/12/philly-bike-expo-engin-cycles-gilded-ti-hardtail/\" target=\"_blank\">Gilded Ti Hardtail</a> from the 2019 Philly Bike Expo) and machining precision componentry like <a href=\"https://engincycles.com/products\" target=\"_blank\">CNC stems and seat collars</a>. Drew also produces various framebuilding tools like the <a href=\"https://engincycles.com/all-products/engin-cycles-wheel-tool\" target=\"_blank\">Engin Wheel Tool</a> and the <a href=\"https://engincycles.com/process-frame-fixture\" target=\"_blank\">Process Frame Fixture</a>. <a href=\"https://www.instagram.com/hopecyclery/\" target=\"_blank\">Jarrod Bunk</a> connected with Drew at this year’s <a href=\"https://theradavist.com/?s=philly+bike+expo+2021\" target=\"_blank\">Philly Bike Expo</a> to photograph the frame fixture Drew had on display at the show. Continue reading below for Drew’s take on how nearly one-hundred years of combined framebuilding expertise culminated in the development of the Process Frame Fixture, along with Jarrod’s always-detailed imagery.</em><span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/PBE-2021-ENGIN-4.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The “Process Fixture” has a rich history. It was originally designed by the legend Bill Grove of <a href=\"https://theradavist.com/2018/10/grove-gathering-grove-innovations-assault-team-bike-jarrod-bunk/\" target=\"_blank\">Grove Innovations</a> out of State College, PA. He did it about 12+ years ago after going to a NAHBS and seeing the products available. He felt the industry needed a better product and set out to make a no compromise fixture. He did not have the ability to make the fixture so it was made by job shops. This proved to be a real issue and was in the end the reason the project never really got off the ground. He tried a few times to get it going but in the end it never made it to the finish line. The few that did make it out into the world went through Rody Walters shop <a href=\"https://www.groovycycleworks.com/\" target=\"_blank\">Groovy Cycles</a>. Rody is a longtime friend of Bill’s and helped get the fixtures to the end users.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/PBE-2021-ENGIN-19.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/12/PBE-2021-ENGIN-12.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>At the start of the pandemic I was at home trying to come up with a way that I could get the fixture I had in my mind out of my brain and onto a computer screen. In turn I decided to contact Bill and see if he minded if I used a bunch of his ideas because I really liked what he did but knew it needed to be modernized for where the bicycle has gone in the last few years. He agreed to hand off the design and it started what has been an insane journey. Even with all the work Bill did this project was a huge undertaking. What we added to the fixture was not only features but also made it capable of longer front centers, slacker angles, longer forks and wider bottom brackets. The end result is the combination of essentially seventy-five years worth of collective builders’ ideas.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/PBE-2021-ENGIN-10.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/12/PBE-2021-ENGIN-9.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/12/PBE-2021-ENGIN-11.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The entire fixture is made here in Philadelphia. The only thing we outsource is the dummy axles because they are already made by <a href=\"https://www.paragonmachineworks.com/\" target=\"_blank\">Paragon Machine Works</a>. No other fixture on the market verifies the geometry the way this one does. It confirms that the print is matched on the fixture and can be repeated to 0.01mm. All the measurements including the degrees on angles are measured with a 6″ digital caliper. The accuracy of the caliper is the accuracy of repeatability.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/PBE-2021-ENGIN-17.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The fixture rotates on a gimbal that is as much of an amazing piece of engineering as the fixture itself. It is counterweighted for ease of movement, rotates on leather friction washers that are adjustable and has locks to ensure a preferred position can not move no matter how much weight is applied.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/PBE-2021-ENGIN-7.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/12/PBE-2021-ENGIN-6.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The fixture is made from cast aluminum jig plate and comes complete. There are no options except all the options. The only thing that can be skipped is the plumbing for Argon (which is not shown in the images). The price for the fixture is $9500 which again includes everything except the bench or pedestal to mount it to. The rolling stand shown is not included.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/PBE-2021-ENGIN-15.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The name of the fixture is based on a somewhat joke I had with <a href=\"https://theradavist.com/tag/bruce-gordon/\" target=\"_blank\">Bruce Gordon</a>. We joked often after having a conversation that it is “all about the process”. He even made me pins that said “all about the process”. I ended up using the name “Process” for all the tools I make including The Process Fixture.</p>\n<p>See more at <a href=\"https://engincycles.com/\" target=\"_blank\">Engin Cycles website</a> and on <a href=\"https://www.instagram.com/engincycles/\" target=\"_blank\">Instagram</a>.</p>\n<p>The post <a href=\"https://theradavist.com/2021/12/engin-cycles-process-frame-fixture/\">2021 Philly Bike Expo: Engin Cycles Process Frame Fixture</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"Josh Weinberg","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"2b1f4f2001a22a1ef0a5506d69e5532d8425f4ecfded01b0bf9027d2a5f47b06","category":"Cycling"}