{"title":"Evaluating camera‐based methods for estimating badger (Meles meles) density: Implications for wildlife management","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12378?af=R","date":1725331242000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d347ec0e-1d66-4115-9bba-cab2dd1efbac/eso312378-toc-0001-m.png\" alt=\"Evaluating camera-based methods for estimating badger (Meles meles) density: Implications for wildlife management\" />\n<p>Estimating the density of unmarked animals using camera-based methods within a badger vaccination framework. We highlight practical considerations, implications for animal management and the importance of accounting for the reactions of animals to camera traps.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAccurate and precise assessment of population density plays a critical role in effective wildlife management, but reliable estimates are often difficult to obtain. Camera traps have emerged as valuable noninvasive tools for studying elusive species, offering cost-effective solutions for both marked and unmarked populations.\n\nWe evaluated the consistency of badger (<i>Meles meles</i>) density estimates obtained from the random encounter model (REM) and camera trap distance sampling (CT-DS) with independent estimates from spatial mark-resight (SMR) models and quantified the bias in CT-DS arising from animals reacting to camera traps. Six camera trap surveys were conducted in Cornwall, UK, in 2019 and 2021, and data were used to estimate badger density using the REM and CT-DS. Four sites were included in a badger vaccination research project, providing an opportunity to mark badgers with uniquely identifiable fur clips to facilitate resighting within a SMR framework.\n\nWe found consistency in the density estimates across all methods, but results had wide confidence intervals. Density estimates derived from CT-DS tended to be higher than those from the REM and were sensitive to the exclusion of reactive sequences, resulting in a twofold decrease in the estimated density in one case. The REM tended to be the most precise method; however, where badger density was low, precision was low using all methods.\n\nPractical implication: our findings suggest animal density can be assessed from camera traps in the absence of individual identification; however, it is important to account for reactive behaviours, especially where such behaviour is prevalent. In these circumstances, we recommend utilising the REM which offers a clear methodology for addressing bias arising from reactive sequences. In addition, we emphasise the need for improved precision to ensure the effectiveness of these methods in the context of wildlife management. We offer practical considerations to facilitate the broader application of these methods, drawing upon the example of disease control through badger vaccination.\n</p>","author":"Verity Miles, \nRosie Woodroffe, \nChristl A. Donnelly, \nPeter N. M. Brotherton, \nCally Ham, \nKelly Astley, \nJoana Aurélio, \nMarcus Rowcliffe","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"2b226fc936d23147d892722e965bcd7076de8505b6520bd221a7ca17e3207d7f","category":"Environment"}