{"title":"รถยนต์ของ Tesla เป็นรถที่ถูกขโมยน้อยที่สุดในสหรัฐฯ เพราะมี GPS ระบุตำแหน่งรถ","link":"https://www.blognone.com/node/136466","date":1698648933000,"content":"<div><div><div><p>รถยนต์ของ Tesla ถูกจัดอันดับให้เป็นรถยนต์ที่ถูกขโมยน้อยที่สุดในสหรัฐอเมริกา เนื่องจากมีการติดตามด้วย GPS เป็นคุณสมบัติมาตรฐานของรถทุกคัน จึงทำให้เมื่อเกิดเหตุรถ Tesla ถูกขโมย รถยนต์ดังกล่าวจะถูกตามพบเจอได้อย่างรวดเร็ว</p>\n<p>ข้อมูลนี้มาจาก Highway Loss Data Institute องค์กรไม่แสวงหากำไร ซึ่งได้รับการสนับสนุนจากอุตสาหกรรมประกันภัยในสหรัฐอเมริกา ซึ่งเผยรายงานความสูญเสียจากการโจรกรรมรถยนต์ทั้งหมดครอบคลุมรถยนต์มากกว่า 40 ล้านคัน พร้อมการเคลมการโจรกรรม 18,000 ครั้ง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/72e26f381ba69c7028aa1c6d8409e96d.png\" /></p>\n<p>จากรายงานแสดงให้เห็นว่ารถยนต์ของ Tesla เป็นรถยนต์ที่ถูกขโมยน้อยที่สุด ซึ่งมี Tesla Model 3 และ Model Y ติด 2 อันดับแรกของรถยนต์ที่ถูกขโมยน้อยที่สุด ส่วนรถรุ่นอื่น ๆ ของ Tesla ก็ติดอันดับต้น ๆ ของรายงานเช่นกัน โดยสถาบันประกันภัยเพื่อความปลอดภัยทางหลวง (Insurance Institute for Highway Safety หรือ IIHS) ได้ระบุว่ารถยนต์ Model 3 และ Model Y ของ Tesla มีค่าเฉลี่ยในการเรียกร้องค่าสินไหมทดแทนจากการโจรกรรมรถยนต์อยู่เพียง 3% เท่านั้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/19b5c0a88d7b89e1d360bf7218ab23bd.png\" /></p>\n<p>แม้ว่าการขโมยรถยนต์ Tesla ในสหรัฐฯ นั้นมีน้อย แต่ในยุโรปกลับมีโจรที่สามารถขโมยรถยนต์ Tesla ได้หลายครั้งจาก Relay Attack (การรบกวนสัญญาณของกุญแจรถกับตัวรถ และหลอกรถยนต์ให้คิดว่ากุญแจอยู่ใกล้กับตัวรถ)</p>\n<p>เพื่อตอบโต้ Relay Attack ทาง Tesla จึงเพิ่มตัวการรักษาความปลอดภัยอีกชั้นหนึ่งใน Key Fob ผ่านการปรับปรุงการเข้ารหัส และเพิ่มฟีเจอร์ PIN to Drive มาเป็นอีกทางเลือก ซึ่งช่วยลดโอกาสที่รถ Tesla จะถูกขโมยได้อย่างมาก</p>\n<p>นอกจากฟีเจอร์ PIN to Drive แล้ว ผู้ขับขี่ยังสามารถพกคีย์การ์ด Tesla ไว้ในที่ใส่บัตร RFID (Radio Frequency Identification หรือ การระบุเอกลักษณ์ด้วยคลื่นวิทยุ) เพื่อป้องกันการโจมตีได้ แต่จะใช้บัตรนี้ไม่ได้หากผู้ขับขี่ใช้โทรศัพท์มือถือเป็นกุญแจอยู่ก่อนแล้ว</p>\n<p>ที่มา - <a href=\"https://electrek.co/2023/10/23/tesla-tops-list-least-stolen-vehicles-standard-gps-tracking/\">electrek</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tesla\">Tesla</a></div><div><a href=\"/topics/automobile\">Automobile</a></div><div><a href=\"/topics/ev-car\">EV car</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2b25fb06480a9ace3908aff5889e995bf6fea8eff568ca0137e8103bd8319560","category":"Thai"}