{"title":"Biochemical Composition of Tubers of New Russian Potato Cultivars Depending on Growing and Storage Conditions","link":"https://www.preprints.org/manuscript/202403.1085/v1","date":1710839851000,"content":"Fourteen Russian potato cultivars (cvs.) grown for three years in field plots of VIR (Northwestern region of the Russian Federation) were evaluated for productivity and a number of biochemical parameters of tubers. The 12 parameters that have been evaluated in tubers annually one month after harvesting and after cold storage (at 2 - 4°C) include the content of dry matter, starch, protein, ascorbic acid, carotenoids and β-carotene, anthocyanins, total sugars and monosaccharides (reducing sugars), phenolic compounds, as well as total acidity, and antioxidant activity. The cultivars differed significantly in productivity and biochemical composition of tubers. Dry matter content ranged from 16.40% in cv. ʻKumachʼ to 27.28% in ʻNayadaʼ, starch content ranged from 8.96 % in cvs. ʻFioletovyjʼ, ʻKumachʼ to 20.08% in ‘Sokur’, the total sugar content reached 2.46% in cv. ʻSiverskij’ whereas ‘Sokur’ has the smallest content of reducing sugars in post-harvest tubers. Protein content ranged from 1.02% to 2.77% with the highest accumulation in cv. ʻSokurʼ. Content of ascorbic acid (vitamin C) ranged from 6.3 mg/100 g FW in ʻKrasa Meŝeryʼ to 26.6 mg/100 g FW in cv. ʻKrasavchikʼ. Carotenoids content ranged from 0.157 mg/100 g FW in cv. ‘Nayada’ to 0.645 mg/100 g FW in cv. ʻGrandʼ. Content of anthocyanins in potato ranged from 1.04 mg/100g FW (not colored tubers of cv. ʻKrasa Meŝeryʼ) to 283.04 mg/100g FW (colored tubers of cv. ʻFioletovyiʼ). The nutritional value of tubers (content of dry matter, sugars, starch and protein) was determined to a greater extent (38-49%) by varietal characteristics, rather than by meteorological conditions in vegetation period. The content of vitamin C, carotenoids, protein and anthocyanins varied depending on the year. The highest content of dry matter, starch and carotenoids was noted in tubers harvested in 2019, marked by low temperatures and precipitation deficit in growing season. The conditions of 2020 with low temperatures and excess precipitation were the most favorable for anthocyanin’s accumulation in potato tubers while not for other biochemical parameters. Of the cultivars, ʻSokurʼ had the highest content of dry matter, protein and starch. Cv. ʻFioletovyiʼ had small starch content and high level of anthocyanins. Cv. ʻPlamyaʼ can be recommended for potato products manufacturing due to dry matter content above 20% and reducing sugars content 0.24%..","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2b26306f7b98b1e652d46bcb662b5922141f360f9cd884f087259225d4b7a0b2","category":"Interdisciplinary"}