{"title":"Fossil pollen resolves origin of the South African Proteaceae as transcontinental not transoceanic","link":"https://academic.oup.com/aob/article/133/5-6/649/7131425?rss=1","date":1681948800000,"content":"<span><div>Abstract</div><div>Background and Aims</div>The prevailing view from the areocladogenesis of molecular phylogenies is that the iconic South African Cape Proteaceae (subfamily Proteoideae) arrived from Australia across the Indian Ocean during the Late Cretaceous (100–65 million years ago, Ma). Since fossil pollen indicates that the family probably arose in North-West Africa during the Early Cretaceous, an alternative view is that it migrated to the Cape from North-West-Central Africa. The plan therefore was to collate fossil pollen records throughout Africa to determine if they are consistent with an African (para-autochthonous) origin for the Cape Proteaceae, and to seek further support from other palaeo-disciplines.<div>Methods</div>We used palynology (identity, date and location of records), molecular phylogeny and chronogram preparation, biogeography of plate tectonics, and palaeo-atmospheric and ocean circulation models.<div>Key Results</div>Our collation of the rich assemblage of Proteaceae palynomorphs stretching back to 107 Ma (<span>Triorites africaensis</span>) in North-West Africa showed its progressive overland migration to the Cape by 75–65 Ma. No key palynomorphs recorded in Australia–Antarctica have morphological affinities with African fossils but specific clade assignment of the pre-Miocene records is not currently possible. The Cape Proteaceae encompass three molecular-based clades (tribes) whose most recent apparent ancestors are sisters to those in Australia. However, our chronogram shows that the major <span>Adenanthos</span>/<span>Leucadendron</span>-related clade, originating 54–34 Ma, would have ‘arrived’ too late as species with Proteaceae affinities were already present ~20 million years earlier. The <span>Franklandia</span>/<span>Protea</span>-related clade arose 118–81 Ma so its distinctive pollen should have been the foundation for the scores of palynomorphs recorded at 100–80 Ma, but it was not. Also, the prevailing winds and ocean currents trended away from South Africa rather than towards, as the ‘out-of-Australia’ hypothesis requires. Based on the evidence assembled here, we list three points favouring an Australian origin and nine against; four points favouring an Antarctic origin and seven against; and nine points favouring a North-West-Central African origin and three against.<div>Conclusions</div>We conclude that a gradual migration of the Proteaceae from North-West-Central Africa southeast→south→southwest to the Cape and its surroundings occurred via adaptation and speciation during the period 95–70 Ma. We caution that incorrect conclusions may be drawn from literal interpretations of molecular phylogenies that neglect the fossil record and do not recognize the possible confounding effects of selection under matched environments leading to parallel evolution and extinction of <span>bona fide</span> sister clades.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"2b2b20f06867c0b5c0e41ea2ba2f784c777a83b7a0f924cc98811f132d4e8027","category":"Environment"}