{"title":"Tracer Velocity Versus Bedload Velocity: Derivation of the Unsteady Virtual Bedload Velocity From Decelerating Tracers","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR034823?af=R","date":1724414383000,"content":"<h2>Abstract</h2>\n<p>During rest periods, bedload tracers can be buried, while transport can move them to locations with different bed shear stresses or a different riverbed composition. This affects the mobility of the tracers compared to that of the bedload at the location where the tracers were seeded and has so far limited the explanatory power of field tracer studies on the virtual bedload velocity. This paper proposes a method to assess both the unsteady virtual tracer velocity and the unsteady virtual bedload velocity from field tracer studies. First, the virtual bedload velocity was conceptualized as the velocity of a relay run and contrasted with the velocity of the decelerating runs of bedload tracers. Then, a regression method for deriving the unsteady virtual velocity of bedload tracers was extended to account for tracer slowdown by including a corresponding function of the distance traveled. Finally, data from 65 bedload tracers in the Upper Drava River with very-high-frequency (VHF) transmitters were used for method testing. By linking the measured tracer mobility to the hydraulics and bed surface grain size near the seeding location, it was possible to determine the unsteady bedload velocity function as the unsteady tracer velocity function at a travel distance of zero. The tracer travels exhibited increasing slowdown effects with increasing tracer grain size, probably due to the dominant role of advection effects at the study site. The derivation of the bedload velocity ensures comparability to laboratory results and between tracer studies.</p>","author":"M. Klösch, \nS. Pessenlehner, \nP. Gmeiner, \nH. Habersack","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"2b2bde3d4c333f8b4387cc41f60638eb11e854ee5656dce92d596de1810ed8e8","category":"Environment"}