{"title":"Enhanced Multi-Scale Attention-Driven 3D Human Reconstruction from Single Image","link":"https://www.preprints.org/manuscript/202409.0871/v1","date":1726043663000,"content":"Due to the inherent limitations of a single viewpoint, reconstructing 3D human meshes 1 from a single image has long been a challenging task. While deep learning networks enable us to 2 approximate the shape of unseen sides, capturing the texture details of the non-visible side remains 3 difficult with just one image. Traditional methods utilize Generative Adversarial Networks (GANs) 4 to predict the normal maps of the non-visible side, thereby inferring detailed textures and wrinkles 5 on the model’s surface. However, we have identified challenges with existing normal prediction 6 networks when dealing with complex scenes, such as a lack of focus on local features and insufficient 7 modeling of spatial relationships.To address these challenges, we introduce EMAR—Enhanced 8 Multi-scale Attention-driven Single Image 3D Human Reconstruction. This approach incorporates 9 a novel Enhanced Multi-Scale Attention (EMSA) mechanism, which excels at capturing intricate 10 features and global relationships in complex scenes. EMSA surpasses traditional single-scale attention 11 mechanisms by adaptively adjusting the weights between features, enabling the network to more 12 effectively leverage information across various scales.Furthermore, we have improved the feature 13 fusion method to better integrate representations from different scales. This enhanced feature fusion 14 allows the network to more comprehensively understand both fine details and global structures 15 within the image. Finally, we have designed a hybrid loss function tailored to the introduced attention 16 mechanism and feature fusion method, optimizing the network’s training process and enhancing the 17 quality of reconstruction results.Our network demonstrates significant improvements in performance 18 for 3D human model reconstruction. Experimental results show that our method exhibits greater 19 robustness to challenging poses compared to traditional single-scale approaches.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2b32e7d18e4101b5c6e03949445874231175588dcf903ff443d9f608d5a99674","category":"Interdisciplinary"}