{"title":"Google Maps Gains Immersive View for Routes and Other AI Features","link":"https://www.macrumors.com/2023/10/27/google-maps-immersive-view-for-routes/","date":1698407929000,"content":"Google Maps is getting a new Immersive View for routes that uses artificial intelligence, Street View, and aerial images to preview every step of a journey ahead of time.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/google-maps-immersive-view-routes.jpg\" width=\"3024\" height=\"1964\" />\r<br />\nWhen users get directions for driving, walking, or cycling, Google Maps now offers a \"multidimensional experience\" that can be used to preview bike lanes, sidewalks, intersections, and parking along the route, <a href=\"https://blog.google/products/maps/google-maps-october-2023-update/\">according to Google</a>. \r<br />\n\r<br />\nA time slider can be used to see air quality information and how the route looks as the weather changes throughout the day, while AI and historical driving trends simulate how many cars might be on the road at a given time. \r<br />\n\r<br />\nImmersive View for routes is rolling out in Amsterdam, Barcelona, Dublin, Florence, Las Vegas, London, Los Angeles, Miami, New York, Paris, San Francisco, San Jose, Seattle, Tokyo and Venice on Android and iOS.\r<br />\n\r<br />\nIn addition to Immersive View for routes, Search with Live View is being replaced with Lens in Maps, which uses AI and augmented reality to help users orient themselves in a new neighborhood. \r<br />\n\r<br />\nTapping the Lens icon in the search bar and lifting your phone now gives you AR-delivered information about nearby ATMs, transit stations, restaurants, coffee shops, and stores. Google says Lens in Maps is rolling out to more than 50 new cities including A​​ustin, Las Vegas, Rome, São Paulo and Taipei.\r<br />\n\r<br />\nElsewhere, the navigation map is getting updated colors, more realistic buildings, and improved highway lane details. These updates start rolling out in the coming months in 12 countries, including the U.S., Canada, France and Germany. \r<br />\n\r<br />\nMeanwhile, the U.S. is also set to get information about high-occupancy vehicle (HOV) lanes along a route, and in Europe, AI-powered speed limit information is expanding to 20 countries. Both features start rolling out on Android, iOS, and for cars with Google Built-in in the coming months.\r<br />\n\r<br />\nLastly, Google says EV drivers on Android and iOS will now see even more helpful charging station information, including whether a charger is compatible with their vehicle and whether the available chargers are fast, medium, or slow. This also includes the ability to see when a charger was last used so you know it's not a broken charger. These updates start rolling out globally on iOS and Android this week wherever EV charging station information is available. <div>Tag: <a href=\"https://www.macrumors.com/guide/google-maps/\">Google Maps</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/27/google-maps-immersive-view-for-routes/\">Google Maps Gains Immersive View for Routes and Other AI Features</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/google-maps-gains-immersive-view-for-routes-and-other-ai-features.2408860/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2b3f22c7077b09563885ebd480db676d3435e99eb780c0ea8630cd752b9a1fa3","category":"Apple"}