{"title":"Apple to Make Space for Larger Batteries in iPhones, iPads, and MacBooks By Adopting Slimmer Peripheral Chips","link":"https://www.macrumors.com/2021/08/02/apple-larger-battires-in-devices-smaller-chips/","date":1627895549000,"content":"For future iPhones, iPads, and MacBooks, Apple plans to use smaller internal components in an effort to increase the size of the device's battery, according to <em><a href=\"https://www.digitimes.com/news/a20210802PD208.html\">DigiTimes</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/11/ifixit-iphone12-mini.jpeg\" /><div><em>Image Credit: iFixit</em></div>\r\n<br />\r\nSpecifically, Apple plans to \"significantly increase the adoption\" of IPDs or integrated passive devices for the peripheral chips in its products. These news chips will be slimmer in size and allow for higher performance while also taking up less internal space inside a device, allowing for larger batteries.\r\n<br />\r\n<blockquote>Apple is expected to significantly increase the adoption of IPD (integrated passive devices) for new iPhones and other iOS products, providing robust business opportunities for manufacturing partners TSMC and Amkor, according to industry sources.\r\n<br />\r\n\r\n<br />\r\nPeripheral chips for iPhones, iPad and MacBook series are going slimmer with higher performance to allow more space for larger-capacity battery solutions for the devices, with the demand for IPDs to grow sharply in line with the trend, the sources said.</blockquote>The report doesn't note when specifically these new smaller chips will debut, but it does note that Apple has approved TSMC's 6th-generation process to mass-produce IPDs for new iPhones and iPads. \r\n<br />\r\n\r\n<br />\r\nAlleged battery capacities of the upcoming <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> lineup, <a href=\"https://www.macrumors.com/2021/06/01/iphone-13-larger-battery-capacities/\">leaked earlier this year</a>, signaled that the upcoming iPhones will feature larger batteries. Schematics previously seen by <em>MacRumors</em> also revealed that the <a href=\"https://www.macrumors.com/2021/05/10/iphone-13-models-larger-camera-bumps/\">new iPhones will be thicker</a>, making room for the larger batteries. \r\n<br />\r\n\r\n<br />\r\nAlthough the 2021 iPhones aren't mentioned in today's report, it's reasonable to assume that new IPD chips, coupled with an increase in thickness, provide Apple with the freedom to increase battery size thanks to free internal space. The new larger batteries are rumored to be put to good use thanks to <a href=\"https://www.macrumors.com/2021/04/16/ltpo-120hz-display-iphone-13-pro-models/\">more advanced displays in the upcoming high-end iPhones</a>. <div>Tag: <a href=\"https://www.macrumors.com/guide/digitimes/\">digitimes</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/02/apple-larger-battires-in-devices-smaller-chips/\">Apple to Make Space for Larger Batteries in iPhones, iPads, and MacBooks By Adopting Slimmer Peripheral Chips</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-to-make-space-for-larger-batteries-in-iphones-ipads-and-macbooks-by-adopting-slimmer-peripheral-chips.2306240/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=58SUw0hX8tY:16jAus-fAno:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=58SUw0hX8tY:16jAus-fAno:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/58SUw0hX8tY\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2b4329999509473e74f31c5c6ec4b84e959ed62dcba33a51148e2c7c619dd9b6","category":"Apple"}