{"title":"New – Amazon EC2 M2 Pro Mac Instances Built on Apple Silicon M2 Pro Mac Mini Computers","link":"https://aws.amazon.com/blogs/aws/new-amazon-ec2-m2-pro-mac-instances-built-on-apple-silicon-m2-pro-mac-mini-computers/","date":1695156529000,"content":"<p>Today, we are announcing the general availability of <strong>Amazon EC2 M2 Pro Mac instances</strong>. These instances deliver up to 35 percent faster performance over the existing M1 Mac instances when building and testing applications for Apple platforms.</p> \n<p>New EC2 M2 Pro Mac instances are powered by <a href=\"https://www.apple.com/mac-mini/\">Apple M2 Pro Mac Mini computers</a> featuring 12 core CPU, 19 core GPU, 32 GiB of memory, and 16 core Apple Neural Engine and uniquely enabled by the <a href=\"https://aws.amazon.com/ec2/nitro\">AWS Nitro System</a> through high-speed Thunderbolt connections, offering these Mac mini computers as fully integrated and managed compute instances with up to 10 Gbps of <a href=\"https://aws.amazon.com/vpc/\">Amazon VPC</a> network bandwidth and up to 8 Gbps of <a href=\"https://aws.amazon.com/ebs/\">Amazon EBS</a> storage bandwidth. EC2 M2 Pro Mac instances support macOS Ventura (version 13.2 or later) as AMIs.</p> \n<p><strong><u>A Story of EC2 Mac Instances</u></strong><br /> When Jeff Barr first <a href=\"https://aws.amazon.com/blogs/aws/new-use-mac-instances-to-build-test-macos-ios-ipados-tvos-and-watchos-apps/\">introduced Amazon EC2 Mac Instances</a> in 2020, customers were surprised to be able to run macOS on Amazon EC2 to build, test, package, and sign applications developed with <a href=\"https://developer.apple.com/xcode/\">Xcode</a> applications for the Apple platform, including macOS, iOS, iPadOS, tvOS, and watchOS.</p> \n<p>In <a href=\"https://youtu.be/AaYNwOh90Pg?t=2149\">his keynote</a> in AWS re:Invent 2020, Peter DeSantis revealed the secret to build EC2 Mac instances powered by the AWS Nitro System, which makes it possible to offer Apple Mac mini computers as fully integrated and managed compute instances with Amazon VPC networking and Amazon EBS storage, just like any other EC2 instances.</p> \n<blockquote>\n <p>“We did not need to make any changes to the Mac hardware. We simply connected a Nitro controller via the Mac’s Thunderbolt connection. When you launch a Mac instance, your <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-mac-instances.html#ec2-macos-images\">Mac-compatible Amazon Machine Image</a> (AMI) runs directly on the Mac Mini, with no hypervisor. The Nitro controller sets up the instance and provides secure access to the network and any storage attached. And that Mac Mini can now natively use any AWS service.”</p>\n</blockquote> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/09/08/2023-09-ec2-mac2-m2pro-1-1.jpg\" alt width=\"2014\" height=\"1229\" /></p> \n<p>In July 2022, we <a href=\"https://aws.amazon.com/blogs/aws/new-amazon-ec2-m1-mac-instances/\">introduced Amazon EC2 M1 Mac Instances</a> built around the Apple-designed M1 System on Chip (SoC). Developers building for iPhone, iPad, Apple Watch, and Apple TV applications can choose either x86-based EC2 Mac instances or Arm-based EC2 M1 instances. If you want to re-architect your apps to natively support Macs with Apple Silicon using EC2 M1 instances, you can build and test your apps to deliver up to 60 percent better price performance over the EC2 Mac instances for iPhone and Mac app build workloads with all the benefits of AWS.</p> \n<p><a href=\"https://aws.amazon.com/ec2/instance-types/mac/customers/\">Many customers</a> take advantage of EC2 Mac instances to deliver a complete <a href=\"https://aws.amazon.com/blogs/devops/building-and-testing-ios-and-ipados-apps-with-aws-devops-and-mobile-services/\">end-to-end build pipeline on macOS</a> on AWS. With EC2 Mac instances, they can scale their iOS build fleet; easily use custom macOS environments with AMIs; and debug any build or test failures with fully reproducible macOS environments.</p> \n<p>Customers have reported up to 4x reduction in build times, up to 3x increase in parallel builds, up to 80 percent reduction in machine-related build failures, and up to 50 percent reduction in fleet size. They can continue to prioritize their time on innovating products and features while reducing the tedious effort required to manage on-premises macOS infrastructure.</p> \n<p>To accelerate this innovation, EC2 Mac instances recently began to support <a href=\"https://aws.amazon.com/about-aws/whats-new/2023/02/amazon-ec2-mac-instances-root-volumes-quick-instance-restoration/\">replacing root volumes</a> on a running EC2 Mac instance, enabling you to restore the root volume of an EC2 Mac instance to its initial launch state or to a specific snapshot, without requiring you to stop or terminate the instance.</p> \n<p>You can also use <a href=\"https://aws.amazon.com/about-aws/whats-new/2023/03/amazon-ec2-m1-mac-instances-system-updates-mac-versions/\">in-place operating system updates</a> from within the guest environment on EC2 M1 Mac instances to a specific or latest macOS version, including the <a href=\"https://aws.amazon.com/about-aws/whats-new/2023/05/amazon-ec2-m1-mac-instances-beta-macos-versions/\">beta version</a>, by registering your instances with the Apple Developer Program. Developers can now integrate the latest macOS features into their applications and test existing applications for compatibility before public macOS releases.</p> \n<p><strong><u>Getting Started with EC2 M2 Pro Instances</u></strong><br /> As with other EC2 Mac instances, EC2 M2 Pro Mac instances also support Dedicated Host tenancy with a minimum host allocation duration of 24 hours to align with macOS licensing.</p> \n<p>To get started, you should allocate a Mac-dedicated host, a physical server fully dedicated for your own use in your AWS account. After the host is allocated, you can launch, stop, and start your own macOS environment as one instance on that host for one dedicated host.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/09/08/2023-09-ec2-mac2-m2pro-2.jpg\" alt width=\"1747\" height=\"1306\" /></p> \n<p>After the host is allocated, you can start an EC2 Mac instance on it. The procedure is no different from starting any EC2 instance type. Choose your macOS AMI version and select the <code>mac2-m2pro.metal</code> instance type in the <strong>Application and OS Images</strong> section.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/09/08/2023-09-ec2-mac2-m2pro-3.jpg\" alt width=\"2334\" height=\"1897\" /></p> \n<p>In the <strong>Advanced details</strong> section, select <strong>Dedicated host</strong> in <strong>Tenancy</strong> and a dedicated host you just created in <strong>Tenancy host ID</strong>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/09/08/2023-09-ec2-mac2-m2pro-4.jpg\" alt width=\"1645\" height=\"554\" /></p> \n<p>When you use EC2 Mac instances for the first time, you can use SSH to connect to the newly launched instance as usual or <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-mac-instances.html#mac-instance-vnc\">enable Apple Remote Desktop and start a VNC session</a> to the EC2 instance. To learn more, see <a href=\"https://community.aws/tutorials/ec2-mac/01-start-an-ec2-mac-instance\">Sebastien’s series of articles</a> to launch and connect your Mac instance.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/09/08/2023-09-ec2-mac2-m2pro-5.jpg\" alt width=\"1698\" height=\"1374\" /></p> \n<p>When you no longer need the Mac dedicated host, you can terminate your running Mac instance and release the underlying host. Note again that after being allocated, a Mac dedicated host can only be released after 24 hours to align with Apple’s macOS licensing.</p> \n<p><strong><u>Now Available</u></strong><br /> Amazon EC2 M2 Pro Mac instances are available in the US West (Oregon) and US East (Ohio) AWS Regions, with additional regions coming soon.</p> \n<p>To learn more or get started, see <a href=\"https://aws.amazon.com/ec2/instance-types/mac/\">Amazon EC2 Mac Instances </a>or visit the <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-mac-instances.html\">EC2 Mac documentation</a>.  You can send feedback to <a href=\"https://repost.aws/tags/TAO-wqN9fYRoyrpdULLa5y7g/amazon-ec-2\">AWS re:Post for EC2</a> or through your usual AWS Support contacts.</p> \n<p>— <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"2b4b4dd051ef0578dff9878b09d2dd16153b90f4b4f11c91794d89f28f7b19f0","category":"Tech"}