{"title":"Interaction Between Climate Change Scenarios and Biological Invasion Reveals Complex Cascading Effects in Freshwater Ecosystems","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17540?af=R","date":1729587261000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/505353f9-8a4e-4be7-bf80-ad87c56afeed/gcb17540-toc-0001-m.png\" alt=\"Interaction Between Climate Change Scenarios and Biological Invasion Reveals Complex Cascading Effects in Freshwater Ecosystems\" />\n<p>Our study showed through an experimental approach that efforts to reduce climate change can help preserve natural conditions in freshwater ecosystems. However, the cooccurrence of extreme climate change and invasive species creates complex cascade interactions across different organisms. These interactions can disrupt freshwater productivity balance and detritus processes. This highlights the importance of addressing both climate change and biological invasions to effectively protect and preserve freshwater ecosystems.</p>\n<br />\n<h2>ABSTRACT</h2>\n<p>Climate change often facilitates biological invasions, leading to potential interactive impacts of these global drivers on freshwater ecosystems. Although climatic mitigation efforts may reduce the magnitude of these interactive impacts, we are still missing experimental evidence for such effects under multiple climate change scenarios within a multi-trophic framework. To address this knowledge gap, we experimentally compared the independent and interactive effects of two climate change scenarios (mitigation and business-as-usual) and biological invasion on the biomass of major freshwater trophic groups (phytoplankton, zooplankton, periphyton, macroinvertebrates, and a native macrophyte) and the decomposition rate of allochthonous material. Among the independent effects, we found that the business-as-usual climate treatment resulted in lower native macrophyte biomass and higher periphyton biomass compared to the climatic baseline and mitigation treatments. This indicates the potential of climate change to alter the relative dominance of different freshwater producers and demonstrates that climate mitigation efforts can counteract these effects. Biological invasion alone increased the biomass of chironomids, a dominant macroinvertebrate group in tropical freshwater ecosystems, demonstrating a compensatory effect on climate change. Climate change and biological invasion interactively reduced the decomposition rate of allochthonous detritus, likely mediated by the feeding preference of abundant chironomids for periphytic algae associated with the presence of non-native macrophytes. We concluded that (i) climatic mitigation can maintain climate baseline conditions in freshwater ecosystems, and (ii) the interactive effects between future climate scenarios and biological invasion are related to complex cascading interactions among trophic groups on ecosystem processes.</p>","author":"Tauany Rodrigues, \nPavel Kratina, \nRayanne B. Setubal, \nJoseph L. S. Ferro, \nDouglas Hideki Abe, \nLuiza O. Costa, \nClarice Casa Nova, \nVinicius F. Farjalla, \nAliny P. F. Pires","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"2b4f5ff874bb27de94885623cb5e992eaff272863e0589d4564aba322e8640bc","category":"Environment"}