{"title":"Applying the COM-B behaviour model to understand factors which impact 15–16 year old students’ ability to protect themselves against acquirement of Human Papilloma virus (HPV) in Northern Ireland, UK","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003100","date":1713362400000,"content":"<p>by Terri Flood, Ciara M. Hughes, Iseult Wilson, Marian McLaughlin</p>\r\n\r\nHigh-risk strains of Human Papillomavirus (HPV) can lead to the development of a number of cancers including cervical, vulvar, penile, anal and oropharyngeal. HPV vaccination programmes offer the HPV vaccine to males and females 12–13 years old in schools throughout the UK. However, knowledge of HPV remains low in post-primary schools. The aim of this study is to capture 15–16 year old students’ perceptions regarding the current provision of HPV education, and whether providing HPV education to 15–16 year olds could influence their intention to be vaccinated and/or future sexual health decisions related to HPV. Between 5<sup>th</sup> November 2021 and 6<sup>th</sup> May 2022, seven focus groups were conducted with 34 students in post-primary schools in Northern Ireland, United Kingdom. The data was analysed using the COM-B behaviour model to explore the perceived facilitators and barriers impacting students’ ability to protect themselves from acquirement of HPV. Students perceived their knowledge of HPV to be poor and supported the addition of comprehensive mandatory HPV education at 15–16 years old when many of them were becoming sexually active. They identified barriers including lack of parental education, school ethos and religion and insufficient education regarding their legal rights to self-consent to HPV vaccination. Students felt that removal of these barriers would lead to safer sexual practices, increased awareness of the importance of HPV screening and increased HPV vaccination uptake. The recommendations provided by students need to be supported by the Education Authority in conjunction with the Department of Health in order to be successfully implemented into the post-primary school curriculum.","author":"Terri Flood","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"2b59c72daab6162dd7e66c59de41fb7c7f09b85aec2490cfd5648b030a5140c1","category":"Environment"}