{"title":"Prevalence, Characteristics, and Awareness of Chronic Kidney Disease in Croatia. The EH-UH 2 Study","link":"https://www.preprints.org/manuscript/202408.2081/v1","date":1724849152000,"content":"Background. National surveys reported on variable prevalence of chronic kidney disease (CKD) due to differences in characteristics of population, design, equations used to estimate glomerular filtration rate (eGFR) and definitions. The EH-UH 2 survey is the first study evaluating CKD prevalence, characteristics and awareness in Croatia. Methods. This was a cross-sectional nationwide observational study designed to assess the prevalence and cardio-kidney-metabolic risk factors in Croatia which included 1765 randomly selected subjects. We estimated the prevalence of CKD by means of albumin-to-creatinine ratio (ACR) and eGFR (CKD EPI equation). Comorbidities, anthropometric and social factors related to the prevalence of CKD were analyzed, and CV risk profile was evaluated. Results. The weighted prevalence of CKD (any stage), CKD stage ≥ G3A A2, and CKD defined only as eGFR &lt; 60 ml/min/1.73 m2 were estimated at 17.1%, 9.8% and 7.9%, respectively. The prevalence was higher in men than in women (11.8% vs. 7.9%; p 30 mg/g was 15.1%. Older age, male gender, diabetes, ePWV, and uric acid were independently associated with CKD prevalence. The awareness of CKD of 9.5%. Unaware were older with lower income, less educated, having more frequently diabetes, hypertension (less frequently controlled) and milder renal impairment. Conclusion. In Croatia, the estimated prevalence of CKD is high, being more frequently presented in men than in women. CKD patients have unfavorable CV risk profile. The awareness of CKD is very low reflecting poor health literacy in general population but also in health care workers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2b68510f7f2a3caf951470aa77aca3e25097aecfa4428a2cf1713467219b2353","category":"Interdisciplinary"}