{"title":"Intestinal microbiome profiles in broiler chickens raised without antibiotics exhibit altered microbiome dynamics relative to conventionally raised chickens","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301110","date":1712152800000,"content":"<p>by Seyed Hossien Kairmi, Khaled Abdelaziz, Heidi Spahany, Jake Astill, David Trott, Blake Wang, Alice Wang, John Parkinson, Shayan Sharif</p>\r\n\r\nThe present study was undertaken to profile and compare the cecal microbial communities in conventionally (CONV) grown and raised without antibiotics (RWA) broiler chickens. Three hundred chickens were collected from five CONV and five RWA chicken farms on days 10, 24, and 35 of age. Microbial genomic DNA was extracted from cecal contents, and the V4-V5 hypervariable regions of the 16S rRNA gene were amplified and sequenced. Analysis of 16S rRNA sequence data indicated significant differences in the cecal microbial diversity and composition between CONV and RWA chickens on days 10, 24, and 35 days of age. On days 10 and 24, CONV chickens had higher richness and diversity of the cecal microbiome relative to RWA chickens. However, on day 35, this pattern reversed such that RWA chickens had higher richness and diversity of the cecal microbiome than the CONV groups. On days 10 and 24, the microbiomes of both CONV and RWA chickens were dominated by members of the phylum Firmicutes. On day 35, while Firmicutes remained dominant in the RWA chickens, the microbiome of CONV chickens exhibited am abundance of Bacteroidetes. The cecal microbiome of CONV chickens was enriched with the genus <i>Faecalibacterium</i>, <i>Pseudoflavonifractor</i>, unclassified <i>Clostridium_IV</i>, <i>Bacteroides</i>, <i>Alistipes</i>, and <i>Butyricimonas</i>, whereas the cecal microbiome of RWA chickens was enriched with genus <i>Anaerofilum</i>, <i>Butyricicoccu</i>, <i>Clostridium_XlVb</i> and unclassified <i>Lachnospiraceae</i>. Overall, the cecal microbiome richness, diversity, and composition were greatly influenced by the management program applied in these farms. These findings provide a foundation for further research on tailoring feed formulation or developing a consortium to modify the gut microbiome composition of RWA chickens.","author":"Seyed Hossien Kairmi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2b6b706fb9de8ae5c4351afc2b9f390dd717afba38889466a435696a531f4d55","category":"Interdisciplinary"}