{"title":"Apple Staff Complain About Plans for Return to Office Work in Letter to Tim Cook","link":"https://www.macrumors.com/2021/06/05/apple-staff-complain-about-plans-for-office-work/","date":1622880708000,"content":"A large group of Apple employees are opposing the company's plans to require <a href=\"https://www.macrumors.com/2021/06/02/apple-employees-returning-to-work/\">three days of in-person work a week from September</a>, according to a internal letter seen by <a href=\"https://www.theverge.com/2021/6/4/22491629/apple-employees-push-back-return-office-internal-letter-tim-cook?scrolla=5eb6d68b7fedc32c19ef33b4\"><em>The Verge</em></a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/03/appleparkempty.jpg\" />\r\n<br />\r\nIn the detailed letter sent yesterday afternoon, addressed to CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> and the company's executive leadership, the Apple employees said that they want a more flexible approach where those who want to work remotely are able to do so.\r\n<br />\r\n\r\n<br />\r\n<blockquote>Without the inclusivity that flexibility brings, many of us feel we have to choose between either a combination of our families, our well-being, and being empowered to do our best work, or being a part of Apple. This is a decision none of us take lightly, and a decision many would prefer not to have to make. </blockquote>\r\n<br />\r\n\r\n<br />\r\nEarlier this week, ‌Tim Cook‌ <a href=\"https://www.macrumors.com/2021/06/02/apple-employees-returning-to-work/\">sent a note to Apple employees</a> explaining that they will need to return to the office for at least three days a week starting in September. Teams that require in-person work will return to the office for four to five days a week, but most employees will still be able to have two days of remote work. Employees will also be able to work entirely remotely for up to two weeks every year, but the remote work requests will need to be approved by managers.\r\n<br />\r\n\r\n<br />\r\n<blockquote>Over the last year we often felt not just unheard, but at times actively ignored. Messages like, 'we know many of you are eager to reconnect in person with your colleagues back in the office,' with no messaging acknowledging that there are directly contradictory feelings amongst us feels dismissive and invalidating. Not only do many of us already feel well-connected with our colleagues worldwide, but better connected now than ever. We've come to look forward to working as we are now, without the daily need to return to the office. It feels like there is a disconnect between how the executive team thinks about remote / location-flexible work and the lived experiences of many of Apple's employees.</blockquote>\r\n<br />\r\n\r\n<br />\r\nThe new remote working policy is a distinctive easing compare to the company's previous working from home policy, but some Apple staff believe that the new plan does not go far enough and is \"not sufficient in addressing many of our needs.\"\r\n<br />\r\n\r\n<br />\r\nBenefits of more flexible work highlighted by the employees included diversity and inclusion in retention and hiring, tearing down previously-existing communication barriers, better work-life balance, better integration of existing remote workers, and reduced spread of pathogens.\r\n<br />\r\n\r\n<br />\r\n<blockquote>We ask for your support in enabling those who want to work remotely / in location-flexible ways to continue to do so, letting everyone figure out which work setup works best for them, their team, and their role — be it in one of our offices, from home, or a hybrid solution. We are living proof that there is no one-size-fits-all policy for people. For Inclusion and Diversity to work, we have to recognize how different we all are, and with those differences, come different needs and different ways to thrive. We feel that Apple has both the responsibility to recognize these differences, as well as the capability to fully embrace them. </blockquote>\r\n<br />\r\n\r\n<br />\r\nThe letter reportedly began in an Apple Slack channel for \"remote work advocates\" with around 2,800 members. As many as 80 employees are said to have been involved in writing and editing the note.\r\n<br />\r\n\r\n<br />\r\nThe letter summarised its formal requests as follows:\r\n<br />\r\n\r\n<br />\r\n<blockquote><ul>\r\n<br />\r\n<li>We are formally requesting that Apple considers remote and location-flexible work decisions to be as autonomous for a team to decide as are hiring decisions.</li>\r\n<br />\r\n<li>We are formally requesting a company-wide recurring short survey with a clearly structured and transparent communication / feedback process at the company-wide level, organization-wide level, and team-wide level, covering topics listed below.</li>\r\n<br />\r\n<li>We are formally requesting a question about employee churn due to remote work be added to exit interviews.</li>\r\n<br />\r\n<li>We are formally requesting a transparent, clear plan of action to accommodate disabilities via onsite, offsite, remote, hybrid, or otherwise location-flexible work.</li>\r\n<br />\r\n<li>We are formally requesting insight into the environmental impact of returning to onsite in-person work, and how permanent remote-and-location-flexibility could offset that impact.</li>\r\n<br />\r\n</ul></blockquote>\r\n<br />\r\n\r\n<br />\r\nSee <a href=\"https://www.theverge.com/2021/6/4/22491629/apple-employees-push-back-return-office-internal-letter-tim-cook?scrolla=5eb6d68b7fedc32c19ef33b4\">the full letter at <em>The Verge</em></a> for more information.<div>Tag: <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/05/apple-staff-complain-about-plans-for-office-work/\">Apple Staff Complain About Plans for Return to Office Work in Letter to Tim Cook</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-staff-complain-about-plans-for-return-to-office-work-in-letter-to-tim-cook.2299278/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=6iUWeuY_lZc:kRQMuMNBSkE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=6iUWeuY_lZc:kRQMuMNBSkE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/6iUWeuY_lZc\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2b712d451156adb3087c9a17cade6618440218ac5e136a8d8c744b393b1a45d2","category":"Apple"}