{"title":"Integrated vegetation management within electrical transmission landscapes promotes floral resource and flower-visiting insect diversity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308263","date":1724248800000,"content":"<p>by Chase B. Kimmel, Ivone de Bem Oliveira, Joshua W. Campbell, Emily Khazan, Jonathan S. Bremer, Kristin Rossetti, Matthew Standridge, Tyler J. Shaw, Samm Epstein, Alexandra Tsalickis, Jaret C. Daniels</p>\r\n\r\nElectrical transmission rights-of-way are ubiquitous and critical infrastructure across the landscape. Active vegetation management of these rights-of-way, a necessity to deliver electricity more safely, maintains these landscape features as stages of early successional habitat, a rarity in many regions, making these areas viable movement corridors for many taxa. The goals of this study were to (i) evaluate the effects of different electrical transmission landscape management practices on flowering plant and flower-visiting insect diversity parameters and (ii) generate conservation management inferences for these landscapes. In this study we tested the impact of three vegetation management levels across 18 electrical transmission sites. We evaluated the effects of treatment on bloom abundance and species richness as well as flower-visiting insect abundance and family richness. We identified 76541 flowers/inflorescences across 456 transects, including 188 species in 56 plant families. Additionally, we obtained data on 11361 flower-visitoring insects representing 33 families from 2376 pan trap sets. High vegetation management favored the reduction of coarse woody debris in the sites and harbored the highest level of abundance and richness of both floral resources and flower-visiting insects. We discuss that we can align social and ecological values of rights-of-way, ensuring their sustainability by applying regular and targeted integrated vegetation management. Thus, we can use rights-of-way landscapes not only as an effective management strategy for the delivery of essential human services, but also to provide conservation benefits for wild pollinators.","author":"Chase B. Kimmel","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2b720edbf978383bfd0d35d14753f4244afd7f96dd88fdd05c2a2445138ec392","category":"Interdisciplinary"}