{"title":"Misbehavior in Robotaxis","link":"https://sfstandard.com/2023/08/11/san-francisco-robotaxi-cruise-debauchery/","date":1691793107000,"content":"\n<p>Liz Lindqwister, writing for The San Francisco Standard:</p>\n\n<blockquote>\n  <p>Ever thought about getting down and dirty in a robotaxi? Want to\nlight up a cig or a joint on the drive home from the club? You’re\nnot alone.</p>\n\n<p>As autonomous vehicles become increasingly popular in San\nFrancisco, some riders are wondering just how far they can push\nthe vehicles’ limits — especially with no front-seat driver or\nchaperone to discourage them from questionable behavior.</p>\n\n<p>For some, that’s a welcome invitation to test the autonomous\nvehicles’ limits. Megan, a woman in her 20s, took her first\nrobotaxi ride on a recent late-night excursion. It was also her\nfirst time having sex in a driverless vehicle. The Standard is not\nproviding exact dates of the riders’ debauchery to protect their\nprivacy but has verified the rides took place through\ndocumentation. Names have been changed because of the riders’\nprivacy concerns.</p>\n</blockquote>\n\n<p>Setting aside questions regarding their driving ability, autonomous taxis will prove to be an interesting behavioral playground. How clean will they remain? What’s to keep people from smoking, littering, pissing, puking, and, yes, screwing inside? If 95 percent of passengers can behave as they would in a human-driven taxi or ride share, but the other 5 don’t, they could turn putrid quickly. Like I wrote last night, you need to design for how people <em>do</em> behave, not how they <em>should</em>.</p>\n\n<p>These robotaxis are all equipped with cameras, and the paying passenger is known through their account with the service, but the more you surveil their behavior while riding, the more you encroach on their privacy.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/11/misbehavior-in-robotaxis\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"2b775a563d33bca3a69f3275a940543c5fbb5ca5173b33ad425e5e3cf89993e3","category":"Tech"}