{"title":"Emerging Trends in Sustainable Digital Transformation Strategies Across Higher Education Institutions: A Systematic Review","link":"https://www.preprints.org/manuscript/202408.1741/v1","date":1724426249000,"content":"The technological revolution has contributed significantly to environmental and social issues worldwide. In higher education institutions, there is a theoretical gap in systematic reviews on the integration of digital transformation into sustainability. This systematic review of the literature aims to address this gap by exploring how digital transformation improves sustainability in higher education institutions, identifying emerging trends and best practices for effective strategies. Using the PRISMA guidelines, the study conducted a comprehensive search in the Scopus database, producing 1,686 publications from 2019 to 2024. The findings reveal a widespread awareness of digital technology integration but highlight a lack of consensus on sustainable integration strategies. Furthermore, the results demonstrate that educational achievements can be enhanced through tools and methodologies that align with the Sustainable Development Goals of the United Nations. The analysis identifies three primary domains: sustainability capabilities enabled by digital transformation, innovative sustainable approaches, and the conceptualisation of sustainability in higher education. The incorporation of digital tools, such as AI chatbots, institutions foster innovation and achieves sustainability objectives, thus transforming teaching and learning approaches. This review contributes significantly to understanding the role of digital transformation in promoting a sustainable and digitally enabled future in higher education.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2b7c472e5c084c530dbf997678e3b15b21c11b9d72c9f9a8ed337b415b120234","category":"Interdisciplinary"}