{"title":"The Role of Wnt10b/&beta;-Catenin Signaling Pathway in Hair Follicle Development in Different Ages of Rex Rabbits","link":"https://www.preprints.org/manuscript/202405.1912/v1","date":1716964396000,"content":"In the present study, we aimed to observed hair follicle development and describe Wnt10b/β-catenin signaling pathways related to hair follicle development in different ages of Rex rabbits. Six Rex rabbits (3 male and 3 female) of 15, 30, 60, 90, 120 and 150 days of age were selected and skin samples were collected for hair follicle development and Wnt/β-catenin signaling pathway genes expresion detection. The results showed that the the values for body weight, coat length, skin thickness, skin area, and skin weight of Rex rabbits were increased significantly with age (p &amp;lt; 0.05). The total hair follicle density, secondary hair follicle density and the ratio of the secondary hair follicle density to the primary hair follicle density in 120 days of Rex rabbits was higher than that in the other ages (p &amp;lt; 0.05), and the major hair follicles were in the growing period at 15 days and 30 days of age, some of them had already entered the degeneration period at 60 days of age, and most of them entered the degeneration period at 90 days of age, the presence of quiescent hair follicles and the enlargement of primary hair follicles were also observed. At 120 and 150 days of age, the back hair follicles entered the growing period, and the secondary hair follicles had obvious differentiation. Furthermore, the expression of the Wnt10b, CTNNB1, adenomatosis polyposis protein (APC), Disheveled 2 (DVL2), glycogen synthase kinase 3β（GSK-3β）, Lymphoid enhancer-binding factor 1 (LEF1), dickkopf-1 (DKK1) and transforming growth factor beta 1 (TGFβ-1) genes in the skin tissue of Rex rabbits at different age was significantly differences (p &amp;lt; 0.05), and the expression of the Wnt10b, CTNNB1, DVL2, GSK-3β, and TGFβ-1 genes at 90 days was higher than that in the other days, the expression of the LEF1 and DKK1 genes at 60 days was higher than that in the other days. As western blotting indicated, the β-catenin protein phosphorylation (P-CTNNB1) levels in the skin tissue of Rex rabbits shows the trend of first increasing, then decreasing and then increasing, 60 days, 120 days and 150 days significantly higher than 15 days, 30 days or 90 days (p &amp;lt; 0.05). With the increasing of ages, the GSK-3β protein phosphorylation (P-GSK-3β) levels in the skin tissue of Rex rabbits were increasing, and maximum at 120 days of age (p &amp;lt; 0.05). These results show that ages could influence on the fur quality and hair follicle traits of Rex rabbits, and Wnt10b/β-catenin signaling pathways is involved in the biological process of periodic hair follicle development in Rex rabbits. Considering the rule of fur growth, the slaughter age of Rex rabbits should not be earlier than 120 days.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2b80c9718dfc9dc49b4e26a5d7649482e29b61b966cc8413b6f25a017e4a1d08","category":"Interdisciplinary"}