{"title":"Better than holograms: 3D-animated starships can be viewed from any angle","link":"https://arstechnica.com/?p=1763689","date":1620848712000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Inspired by the displays of science fiction like the holodeck from <em>Star Trek</em> and the Princess Leia projector from <em>Star Wars</em>, a BYU electrical and computer engineering team is working to develop screenless volumetric display technologies. </p></div>\n<p>Scientists at Brigham Young University (BYU) have created tiny 3D animations out of light. The animations pay homage to <a href=\"https://arstechnica.com/tag/star-trek/\">Star Trek</a> and <a href=\"https://arstechnica.com/tag/star-wars/\">Star Wars</a> with tiny versions of the USS <em>Enterprise</em> and a Klingon battle cruiser launching photon torpedoes, as well as miniature green and red light sabers with actual luminous beams. The animations are part of the scientists' ongoing \"<a href=\"https://www.smalleyholography.org/about-leia\">Princess Leia project</a>\"—so dubbed because it was partly inspired by the iconic moment in <em>Star Wars Episode IV: A New Hope</em> when R2D2 projects a recorded 3D image of Leia delivering a message to Obi-Wan Kenobi. The researchers described the latest advances on their so-called screenless volumetric display technologies in <a href=\"https://www.nature.com/articles/s41598-021-86495-6\">a recent paper published</a> in the journal Scientific Reports.</p>\n<p>\"What you're seeing in the scenes we create is real; there is nothing computer generated about them,\" <a href=\"https://news.byu.edu/byu-hologram-experts-can-now-create-real-life-images-that-move-in-the-air\">said co-author Dan Smalley,</a> a professor of electrical engineering at BYU. \"This is not like the movies, where the lightsabers or the photon torpedoes never really existed in physical space. These are real, and if you look at them from any angle, you will see them existing in that space.\"</p>\n<p>The technology making this science fiction a potential reality is known as an optical trap display (OTD). These are not holograms; they're volumetric images, as they can be viewed from any angle as they seem to float in the air. A holographic display scatters light across a 2D surface, and microscopic interference patterns make the light look as if it is coming from objects in front of, or behind, the display surface. So with holograms, one must be looking at that surface to see the 3D image. In contrast, a volumetric display consists of scattering surfaces distributed throughout the same 3D space occupied by the resulting 3D image. That means when you look at the image, you are also viewing the scattered light.</p></div><p><a href=\"https://arstechnica.com/?p=1763689#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763689&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2b82233110dbfa2853f5489a281736cc9258339fb1e26a1d9d224b12e59814d9","category":"Tech"}