{"title":"The ecological and biodiversity conservation values of farm dams: A systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303504","date":1715608800000,"content":"<p>by Michelle Littlefair, Ben C. Scheele, Martin Westgate, David Lindenmayer</p>\r\n\r\nBiodiversity is in rapid decline globally with agriculture being one of the leading causes. Within agricultural landscapes, some features provide a benefit to biodiversity that is disproportionate to their spatial area. An interesting example is artificial ponds–or farm dams–which can support a large variety of taxa. Here, we present a global review of farm dam research related to biodiversity conservation objectives to provide an overview of the topics, key research insights, and the characteristics of current research. We used a three-stage process to screen literature and identified 104 relevant papers across 27 countries encompassing studies of 13 different taxa. Most of the studies were short-term (less than 5 years) with small sample sizes (less than 20 sites). Of the 104 papers, 88 were focussed primarily on ecological outcomes, such as species richness or abundance, and 15 on primary production outcomes, such as crop and livestock yield, despite addressing or measuring ecological metrics. Only one study measured both ecological and primary production outcomes. Studies frequently examined how the features of dams (79 studies) and attributes of the surrounding landscape (47 studies) impact particular species and communities. Terrestrial mammals (1 study) were under-represented in the literature with macrophytes (28 studies), macroinvertebrates (26 studies), and amphibians (19 studies) receiving the most attention. Our results reveal a growing trend towards recognizing farm dams as habitats for various taxa, including amphibians, beetles, dragonflies, and other macroinvertebrates within agricultural environments. Significant knowledge gaps exist in understanding how dam age, invasive species, and effective management practices impact the biodiversity conservation values of farm dams. Future research should emphasize enhancing biodiversity by collaborating with landholders to increase habitat through strategic vegetation planning, minimizing runoff and nutrient inflow, and restricting stock access.","author":"Michelle Littlefair","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2b8e44fd60783542f4e3891ee2fe70f59182d0f676af0239ba35b67b448bb4fa","category":"Interdisciplinary"}