{"title":"An octopus’s stripes can act as a unique ID","link":"https://arstechnica.com/?p=1934242","date":1682536223000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-1333882870-800x563.jpg\" alt=\"image of an octopus with brown and white stripes\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-1333882870.jpg\">Enlarge</a> <span>/</span> The wunderpus, one of the two species of octopus that we can now identify through the unique pattern of their stripes. (credit: <a href=\"https://delivery.gettyimages.com/downloads/1333882870?k=20&amp;e=8UVSHbG8O4TJrXCH_z89GOyIsNtVgkwBep4D262fIYa7lB3esclmeGtZuR_mLUF1B4sc-Z8p4mY5TH2os4YPBUu3rsbIvwh9n-f9SxQQ5Ko=\">Divelvanov</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Octopuses and other camouflaging cephalopods may be the literal embodiment of “now you see me, now you don’t.” Using both rapid color <em>and </em>texture changes, octopuses can blend into nearly every environment by mimicking things like fish on the sea floor or plants swaying with the waves. A cephalopod’s seamless camouflage makes it tricky for researchers to identify, track, and monitor these creatures in the wild, which has limited our ability to study them.</p>\n<p>This may change for some species, thanks to <a href=\"https://www.eurekalert.org/news-releases/984865\">new research</a> from the University of California, Berkeley, published in <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0265292\">PLOS ONE.</a> The UC Berkeley researchers studying the lesser Pacific striped octopus (also called the zebra octopus, <a href=\"http://www.dolenlab.org/octopuschierchiae\"><em>Octopus chierchiae</em></a>)<em>, </em>found that the animals’ striping patterns seemed to be individualized, similar to our fingerprint patterns. As this small cephalopod has previously been recommended as a new model organism for future studies, having these octopus “fingerprints” could help to solidify <em>O. chierchiae’s </em>place as the poster child for cephalopod research.</p>\n<h2>Cultivating laboratory octopuses</h2>\n<p>Studying octopuses in a <a href=\"https://www.euroscientist.com/the-science-and-ethics-of-turning-octopuses-into-lab-rats/\">laboratory</a> is not for the faint-hearted. Most species usually live for one to three years and produce only one clutch of eggs during that time, making it difficult to track any sort of genetic lineage. Their intelligence and impish behavior make it tricky to keep them in an artificial habitat. Octopuses are predatory creatures, so they require the mental stimulation of hunting, along with special diets to maintain their well-being. Previous studies have shown that caged octopuses will cannibalize each other without proper nourishment.</p></div><p><a href=\"https://arstechnica.com/?p=1934242#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1934242&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2b90322f05e8a9814987100671a48ca923d4d860ef7897a51b8e19b937971422","category":"Tech"}