{"title":"High-risk fertility behaviors and associated factors among married reproductive-age women in sub-Saharan Africa: A multilevel mixed-effect analysis of nationally representative data from 35 countries","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003446","date":1726236000000,"content":"<p>by Kusse Urmale Mare, Setognal Birara Aychiluhm, Getahun Fentaw Mulaw, Kebede Gemeda Sabo, Mekuriyaw Gashaw Asmare, Betel Zelalem Wubshet, Tsion Mulat Tebeje, Beminate Lemma Seifu</p>\r\nBackground <p>Although high-risk fertility behaviors are linked with poor maternal and child health outcomes, their prevalence remains higher in resource-limited countries and varies significantly by context. Evidence on the recent estimates of these fertility risks at the sub-Saharan Africa level is limited. Therefore, this study aimed to examine the pooled prevalence of high-risk fertility behaviors and associated factors among married women in this region.</p> Methods <p>Data from DHS of 35 sub-Saharan African countries were used and a weighted sample of 243,657 married reproductive-age women were included in the analysis. A multilevel binary logistic regression models were fitted and the final model was selected based on the log-likelihood and deviance values. A p-value less than 0.05 and an adjusted odds ratio with a corresponding 95% confidence interval were used to identify the factors associated with high-risk fertility behaviors.</p> Results <p>The pooled prevalence of high-risk fertility behaviors among women in sub-Saharan Africa was 77.7% [95% CI = 77.6%-77.9], where 43.1% [95% CI: 42.9%-43.3%], and 31.4% [95% CI = 31.2%-31.6%] had a single risk and combination of two or three fertility risks, respectively. The highest level of single-risk fertility pattern was observed in Burundi (53.4%) and Chad had the highest prevalence of both at least one (89.9%) and multiple (53.6%) fertility risks. Early and polygamous marriages, low maternal and husband education, poor wealth index, unmet need for contraception, couple’s fertility discordance, rural residence, high community-level early marriage practice, and low community-level women empowerment were associated with risky fertility behaviors.</p> Conclusions <p>More than three-quarters of married women in SSA were engaged in high-risk fertility behaviors, with significant variations across the included countries. Therefore, addressing the modifiable risk factors like improving access to need-based contraceptive methods and empowering couples through education for a better understanding of their reproductive health with particular attention to rural settings are important in reducing these fertility risks. The results also suggest the need to strengthen the policies regulating the prohibition of early and polygamous marriages.</p>","author":"Kusse Urmale Mare","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"2b9193d796f8a969cdc3ff01fc4ac00317de1747c1934d6b1e51c72d75637ca8","category":"Environment"}