{"title":"Effect of SARS-CoV-2 S protein on the proteolytic cleavage of the epithelial Na<sup>+</sup> channel ENaC","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302436","date":1714053600000,"content":"<p>by Germán Ricardo Magaña-Ávila, Erika Moreno, Consuelo Plata, Héctor Carbajal-Contreras, Adrian Rafael Murillo-de-Ozores, Kevin García-Ávila, Norma Vázquez, Maria Syed, Jan Wysocki, Daniel Batlle, Gerardo Gamba, María Castañeda-Bueno</p>\r\n\r\nSevere cases of COVID-19 are characterized by development of acute respiratory distress syndrome (ARDS). Water accumulation in the lungs is thought to occur as consequence of an exaggerated inflammatory response. A possible mechanism could involve decreased activity of the epithelial Na<sup>+</sup> channel, ENaC, expressed in type II pneumocytes. Reduced transepithelial Na<sup>+</sup> reabsorption could contribute to lung edema due to reduced alveolar fluid clearance. This hypothesis is based on the observation of the presence of a novel furin cleavage site in the S protein of SARS-CoV-2 that is identical to the furin cleavage site present in the alpha subunit of ENaC. Proteolytic processing of αENaC by furin-like proteases is essential for channel activity. Thus, competition between S protein and αENaC for furin-mediated cleavage in SARS-CoV-2-infected cells may negatively affect channel activity. Here we present experimental evidence showing that coexpression of the S protein with ENaC in a cellular model reduces channel activity. In addition, we show that bidirectional competition for cleavage by furin-like proteases occurs between 〈ENaC and S protein. In transgenic mice sensitive to lethal SARS-CoV-2, however, a significant decrease in gamma ENaC expression was not observed by immunostaining of lungs infected as shown by SARS-CoV2 nucleoprotein staining.","author":"Germán Ricardo Magaña-Ávila","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2b94b499e3a55c41ce35daffa275614be0062c6a12fa678703b13f19f8ad64ec","category":"Interdisciplinary"}