{"title":"Gallery: Inside the fastest ever Paris-Roubaix","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/gallery-inside-the-fastest-ever-paris-roubaix","date":1681073604000,"content":"\n      <p>They call it the Hell of the North, and every year <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a> merits its moniker, producing a bicycle race unmatched in drama. This year’s race promises to go down in the annals of the sport, as Dutchman Mathieu van der Poel seemingly <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-king-of-the-classics-clinical-van-der-poel-joins-the-greats-with-paris-roubaix-triumph\">surfed through a race filled with chaos</a> and ever-changing chances to win his second Monument of the season.</p>\n<p>Rolling out of the start in Compiegne the racing promised to be fast. Countless riders made their bid to get into the early breakaway and even before the first cobblestone sector in Troisvilles, crashes and mechanicals only increased with the tension.</p>\n<p>Perhaps in an effort to put the chaos behind them, the Jumbo-Visma team went on the attack before the mythic Arenberg Forest. Seemingly the race was over for all but a few. Pre-race favorites like, Mads Pedersen and Van der Poel were quick to follow along with other hopefuls like former winner John Degenkolb, Italy’s Filippo Ganna, Switzerland’s Stefan Küng, as well as Van der Poel’s teammate Jasper Philipsen, an unexpected guest and a true threat as he was the fastest sprinter in the bunch.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/its-very-sad-and-disappointing-jumbo-visma-react-to-the-cruelty-of-paris-roubaix\"><strong><em>Read more: ‘It's very sad and disappointing’- Cruel Paris-Roubaix leaves Jumbo-Visma rueing missed opportunity</em></strong></a></p>\n<p>Behind, it was simply game over, as the peloton would never seen them again.</p>\n<p>As the group approached Roubaix no one could seemingly gain the upper hand.</p>\n<p>The Carrefour de l’Arbre is often considered the last occasion for a rider to break free. It is the race’s last five-star cobble sector, stretching out for over two kilometers with some of the worst cobbles in the race. And once again Le Carrefour did not disappoint.</p>\n<p>Degenkolb crashed. Van Aert attacked. Van der Poel chased. Then Van Aert flatted. It could not happen at a worse moment. But that is Paris-Roubaix, a race where chance and circumstance are always on centre stage. Van der Poel, having the ride of his life, simply launched, authoring a huge solo effort that would put the finishing on touches on a monumental masterpiece.</p>\n<p>Only a year ago, Van der Poel was one of the day's biggest losers, but today he was simply untouchable. What a difference a year makes.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/01sagan_bus01_paris-roubaix_2023.jpg?v=1681072473\" alt /></p>\n<p>Peter Sagan, winner in 2018, readies for his final Paris-Roubaix. Unfortunately for the Slovak, he would be forced out of the race after crashing on an early cobble sector.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/02philipsen_start01_paris-roubaix_2023.jpg?v=1681072508\" alt /></p>\n<p>Jasper Philipsen readies for the race. The Belgian sprinter turned out to be one of the big stars of the day, eventually finishing second behind his teammate Mathieu van der Poel.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/03peloton_troisvilles_paris-roubaix_2023.jpg?v=1681072537\" alt /></p>\n\n<p><span>The peloton rounds the corner of the opening sector of cobbles outside of Troisvilles.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/04van_der_poel_troisvilles_paris-roubaix_2023.jpg?v=1681072564\" alt /></span></p>\n\n<p><span>As soon as the race hit the cobbles Mathieu van der Poel could be seen at the front.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/05fans02_paris-roubaix_2023.jpg?v=1681072605\" alt /></span></p>\n\n<p><span><em>Les geants du nord</em>, oversize folk statues, make up part of the scenery so unique to Paris-Roubaix.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/06van_aert_van_der_poel_arenberg__paris-roubaix_2023.jpg?v=1681072748\" alt /></span></p>\n\n<p><span>Van Aert leads van der Poel and Degenkolb through the mythic Arenberg forest.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/07flat_tire_arenberg__paris-roubaix_2023.jpg?v=1681072775\" alt /></span></p>\n\n<p><span>Paris-Roubaix is never won in the Arenberg Forest, but it is often lost. This Bingoal rider is just one of its latest victims.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/08pedersen_van_der_poel_warlaing_a_brillon__paris-roubaix_2023.jpg?v=1681072820\" alt /></span></p>\n\n<p><span>2019 world champion Mads Pedersen leads Van der Poel over the Warlaing a Brillon sector of cobbles.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/09degenkolb_kung_van_der_poel_auchy-les-orchies_paris-roubaix_2023.jpg?v=1681072849\" alt /></span></p>\n\n<p><span>Stefan Küng and John Degenkolb lead the race over the Auchy-en-Orchies sector.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/10van_der_poel01_paris-roubaix_2023.jpg?v=1681072891\" alt /></span></p>\n\n<p><span>Van der Poel launches on the Carrefour de l’Arbre.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/11van_der_poel_carrefour_de_l_arbre_paris-roubaix_2023.jpg?v=1681072933\" alt /></span></p>\n\n<p><span>The fans that packed the roads would be the only ones left in the race to see van der Poel as his opponents all struggled behind.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/12ganna_carrefour_de_l_arbre_paris-roubaix_2023.jpg?v=1681072961\" alt /></span></p>\n\n<p><span>World Hour Record holder Filippo Ganna led the chase behind Van der Poel in the Carrefour de l’Arbre.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/13van_der_poel_shower02_paris-roubaix_2023.jpg?v=1681073014\" alt /></span></p>\n\n<p><span>Inside the historic Roubaix velodrome Van der Poel savors victory along with his teammate Jasper Philipsen, who along with Van Aert is a lap down.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/14lampaert_finish02_paris-roubaix_2023.jpg?v=1681073130\" alt /></span></p>\n\n<p><span>On the infield after the race, Belgian Yves Lampaert reflects on the disastrous performance of his Soudal - Quick-Step team. The team that dominated the cobbled Classics for more than 20 years has only been a shadow of itself this year.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/15van_der_poel_podium_paris-roubaix_2023.jpg?v=1681073193\" alt /></span></p>\n\n<p><span>Philipsen, Van der Poel and Van Aert do podium honors.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/16degenkolb_showers_paris-roubaix_2023.jpg?v=1681073229\" alt /></span></p>\n\n<p><span>In the Roubaix showers, John Degenkolb puts another Roubaix behind him, not to mention a fair amount of frustration. The veteran German was having the race of his his life until his crash in the Carrefour de l’Arbre.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/17van_der_poel_press_conference_paris-roubaix_2023.jpg?v=1681073265\" alt /></span></p>\n\n<p><span>Mathieu van der Poel reflects on his most recent masterpiece during the post-race press conference. And after becoming only the fourth rider in history to have won Milan-Sanremo and Paris-Roubaix in the same year, he can be more than satisfied with his classics campaign.</span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2b9acc2845ed3014bacc5e4a62cfb16c5637acb342236697b15cbb0ae59b50d7","category":"Cycling"}