{"title":"พนักงานหญิง 6 คน ฟ้อง Tesla ข้อหาปล่อยให้มีการล่วงละเมิดทางเพศในที่ทำงาน","link":"https://www.blognone.com/node/126367","date":1639732191000,"content":"<div><div><div><p>พนักงานหญิง 6 คน ยื่นเรื่องฟ้อง Tesla กับศาลแคลิฟอร์เนียแยกกันคนละคดี แต่ประเด็นโดยร่วมคือข้อหาปล่อยปละละเลยให้มีการล่วงละเมิดทางเพศในโรงงานที่เมืองฟรีมอนต์ รัฐแคลิฟอร์เนีย และในโรงงานอื่น โดยพนักงานหญิงเหล่านี้ระบุว่า ถูกคุกคามด้วยการวิจารณ์ที่ไม่เหมาะสม การแซว (catcalling) การสัมผัสที่ไม่เหมาะสม และพฤติกรรมเหยียดเพศ</p>\n<p>หนึ่งในพนักงานหญิงที่ยื่นฟ้อง ชื่อ Eden Mederos ให้สัมภาษณ์กับ The Washington Post เพิ่มเติมว่าการที่ Elon Musk ชอบโพสต์หรือทำอะไรที่ดูสองแง่สองง่าม เช่นการพูดถึงการตั้งชื่อรุ่นรถ Tesla ว่านำมาร่วมเป็นคำว่า “S3XY” รวมถึงมุก “69” และ “420” มีส่วนส่งเสริมวัฒนธรรมล่วงละเมิดทางเพศในสำนักงาน และยิ่งทำให้พนักงานชายคนอื่นเล่นมุกสองแง่สองง่ามในที่ทำงานมากขึ้น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/636a454c2a0aee91f1be6f58aa9c724d.jpg\" /></p>\n<p>ส่วน Alize Brown ที่เริ่มงานกับ Tesla ตอนอายุ 21 หลังเพิ่งคลอดลูกได้ไม่นาน ก็ระบุว่าการทำงานในโรงงานที่ฟรีมอนต์เหมือนเป็นฝันร้าย พนักงานชายชอบแซวคราบนมแม่บนหน้าอกของเธอ แซวว่าเธอเป็น “แม่วัว” แซวก้นของเธอ และอื่นๆ จนเธอต้องใส่เสื้อผ้าหลวมๆ เพื่อเลี่ยงการโดนล้อ และยังกระทบต่อสภาพจิตใจของเธอในปัจจุบัน แม้เธอจะถูกไล่ออกจากบริษัทแล้วก็ตาม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fe82ba0ba4fdeead5d98c176ad2efcdb.jpg\" /><em>ภาพโรงงาน Tesla ที่ฟรีมอนต์</em></p>\n<p>นี่ไม่ใช่ครั้งแรกที่ Tesla ถูกฟ้องในประเด็นนี้ เพราะเมื่อเดือนก่อน Jessica Barraza ก็<a href=\"https://www.washingtonpost.com/technology/2021/11/19/tesla-sexual-harassment/\">ยื่นฟ้อง Tesla</a> ในประเด็นล่วงละเมิดทางเพศในสำนักงานเช่นกัน ส่วน Tesla เอง มีหนังสือสัญญาให้พนักงานหลายส่วนเซ็นยอมรับในการห้ามฟ้องศาลหากเกิดปัญหาในที่ทำงาน แต่ให้ใช้เป็นการไกล่เกลี่ยแทน ซึ่งทนายความบางส่วนที่ทำคดีล่วงละเมิดทางเพศให้พนักงาน พยายามโต้แย้งว่าสัญญาเหล่านี้บังคับใช้ไม่ได้</p>\n<p>The Washington Post ติดต่อไปสอบถามกับทาง Tesla ในเรื่องนี้โดยตรงแล้ว โดยยังไม่ได้คำตอบใดๆ อย่างเป็นทางการ</p>\n<p>ที่มา - <a href=\"https://www.washingtonpost.com/technology/2021/12/14/tesla-sexual-harassment/\">The Washington Post</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tesla-motors\">Tesla Motors</a></div><div><a href=\"/topics/elon-musk\">Elon Musk</a></div><div><a href=\"/topics/lawsuits\">Lawsuits</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2ba2ff8099cca4e599e74362db7ec473a89e051a363fad2695e3788a368a6497","category":"Thai"}