{"title":"Apple's Past Sideloading Plans, Ecosystem Lock-in Strategy, and More Revealed in Internal Documents","link":"https://www.macrumors.com/2021/08/20/apple-sideloading-plans-ecosystem-lock-in-revealed/","date":1629470145000,"content":"Documents highlighted by <a href=\"https://www.theverge.com/22611236/epic-v-apple-emails-project-liberty-app-store-schiller-sweeney-cook-jobs\"><em>The Verge</em></a> and disclosed as part of the Apple vs. <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> trial have revealed that Apple discussed plans for sideloading apps, sought to lock users into its ecosystem using gift cards, attempted to tackle chaos in the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> review process, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/aapl-logo-banner.jpg\" />\r\n<br />\r\nSeveral of the internal documents related to internal discussions around the possibility of sideloading <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> apps outside of the ‌App Store‌. Some of these discussions may have gone further than expected, since in 2008, software chief Scott Forstall asked Steve Jobs what text should appear to iOS users when they want to open a sideloaded app. Jobs agreed to the following alert: \"Are you sure you want to open the application 'Monkey Ball' from the developer 'Sega'?\"\r\n<br />\r\n\r\n<br />\r\nIn October 2010, Jobs declared at a corporate strategy presentation that a key company aim would be to use the cloud to \"tie all of our products together, so we further lock customers into our ecosystem.\"\r\n<br />\r\n\r\n<br />\r\nIn 2013, Apple's senior vice president of software and services, <a href=\"https://www.macrumors.com/guide/eddy-cue/\">Eddy Cue</a>, lauded the potential of bundling iTunes gift cards with new Apple devices instead of putting them on sale to lock customers further into the company's ecosystem and dissuade them from switching to a different brand. He also raged at the Apple Retail team for its disinterest in selling iTunes Store gift cards.<blockquote>Who's going to buy a Samsung phone if they have apps, movies, etc already purchased? They now need to spend hundreds more to get to where they are today.\r\n<br />\r\n\r\n<br />\r\nOn a related note, our apple stores (online and retail) are the only distributors around the world that decreased year over year in iTunes card sales. We are starting to make progress again with retail but it is always an uphill battle. Our teams just don't get the ecosystem. We (Val and team) just heard from Jennifer that iTunes cards are not a priority for her. This is ridiculous. Who leaves Apple products once they've bought apps, music, movies, etc!\r\n<br />\r\n\r\n<br />\r\n[...]\r\n<br />\r\n\r\n<br />\r\n...In the meantime, Samsung is discounting and giving crap away everywhere...\r\n<br />\r\n\r\n<br />\r\nSamsung is now pushing Google Play cards with placement right below the phones -\r\n<br />\r\n\r\n<br />\r\nWe haven't been putting our cards with our product displays (at 3rd parties) since the iPod. They have to be at a different location. We should have gift cards on the tables like we do in Apple retail. We should also consider having them pegged on all end cap of hardware.</blockquote>\r\n<br />\r\n\r\n<br />\r\nIn 2012, Cue demanded to ‌App Store‌ head Matt Fischer that Shazam would not be featured on the ‌App Store‌:<blockquote>No promotion... we are not going to promote something that puts it's goal as replacing our music player unless it is significantly better than our player and this is not.</blockquote>\r\n<br />\r\n\r\n<br />\r\nApple went on to acquire Shazam in 2018. In 2016, Apple's Elizabeth Lee said that \"Although they may be our best and the brightest apps, Matt feels extremely strong about not featuring our competitors on the ‌App Store‌,\" when asked why the company does not want to highlight apps from Google and Amazon. The email thread suggested that this was standard ‌App Store‌ practice, with some competing apps being seen \"through a slightly different lens than most.\"\r\n<br />\r\n\r\n<br />\r\nIn 2015, Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> addressed the issue of the <a href=\"https://www.macrumors.com/guide/mac-app-store/\">Mac App Store</a>'s lack of traction, putting it down to a lack of gaming and productivity apps: \"I think the lack of gaming (along with the lack of native productivity apps) are the main reason the ‌Mac App Store‌ is dormant.\" Apple marketing chief <a href=\"https://www.macrumors.com/guide/phil-schiller/\">Phil Schiller</a> answered:<blockquote>We and the major game developers have tried high-end gaming on the Mac... but have failed to generate any sizable business in that genre.\r\n<br />\r\n\r\n<br />\r\n[...]\r\n<br />\r\n\r\n<br />\r\nOn the native productivity app front it starts and ends with Microsoft and Adobe. Neither is on the store because they don't have to be. They can be on the Mac and distribute to users without sharing the revenue with us, following our rules on app engineering and business models, or go through any app review process.</blockquote>\r\n<br />\r\n\r\n<br />\r\nMany of the disclosed documents showed how Apple executives responded to repeated failings in the ‌App Store‌ review process. In February 2012, Schiller ranted:<blockquote>What the hell is this???\r\n<br />\r\n\r\n<br />\r\nRemember our talking about finding bad apps with low ratings?\r\n<br />\r\n\r\n<br />\r\nRemember our talk about becoming the \"Nordstroms\" of stores in quality of service?\r\n<br />\r\n\r\n<br />\r\nHow does an obvious rip off of the super popular Temple Run, with no screen shots, garbage marketing text, and almost all 1-star ratings become the #1 free app on the store?\r\n<br />\r\n\r\n<br />\r\nCan anyone see a rip off of a top selling game? Any anyone see an app that is cheating the system?\r\n<br />\r\n\r\n<br />\r\nIs no one reviewing these apps? Is no one minding the store?\r\n<br />\r\n\r\n<br />\r\nThis is insane!!!</blockquote>\r\n<br />\r\n\r\n<br />\r\nIn 2015, Schiller asked the ‌App Store‌ team to \"PLEASE develop a system to automatically find low rated apps and purge them!!\"\r\n<br />\r\n\r\n<br />\r\nIn February 2019, a scam app that purported to be able to measure blood pressure using the ‌iPhone‌'s camera and a fingertip reached the top ‌App Store‌ rankings for medical apps. Later that year, apps that claimed to be able to measure a user's heart rate through <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a> also came under internal scrutiny after being accepted on the ‌App Store‌ during the review process.\r\n<br />\r\n\r\n<br />\r\nApple's Tom Reyburn seemingly admitted that \"LinkedIn has been rejected for using the same language on their subscription call to action button that Apple uses in our own apps.\" \"It's not right, but apparently it is what it is,\" Apple's senior director of developer relations Shaan Pruden replied. Reyburn added, \"Amazon is also complaining about this. We need to have one set of rules that all apps follow whether they are from Apple or third-party developers.\"\r\n<br />\r\n\r\n<br />\r\nApple also realized that it had erroneously allowed two separate games that featured school shootings on the ‌App Store‌, seven months after they were approved. Discussions put the error down to the fact that \"it took a total of 32 seconds to review both apps.\" In a similar case, Schiller questioned how a game about shooting protestors was accepted during the review process.\r\n<br />\r\n\r\n<br />\r\nSeparately, the documents show that in 2011, Schiller suggested that Apple could \"ratchet down from 70/30 to 75/25 or even 80/20 if we can maintain a $1B a year run rate,\" in terms of ‌App Store‌ commissions, since the 30 percent commission rate would \"not last forever.\"\r\n<br />\r\n\r\n<br />\r\nHe also proposed a scheme called \"Jump Start\" in June 2018, which would have given half of Apple's 30 percent commission back to developers in their first year to spend on iAd advertising. This idea appears to be a precursor to the ‌App Store‌ Small Business Program.\r\n<br />\r\n\r\n<br />\r\nIn February of 2020, Apple's head of fraud, Eric Freidman, said that Apple was \"the greatest platform for distributing child porn.\" He added that \"we have chosen to not know in enough places where we really cannot say.\" It is not clear if these discussions were related to Apple's recently announced <a href=\"https://www.macrumors.com/2021/08/05/apple-new-child-safety-features/\">child safety features</a>.\r\n<br />\r\n\r\n<br />\r\nOther interesting findings and tidbits from the internal document disclosures showed that Apple seemingly offered Netflix a discounted 15 percent in-app purchase commission, much like its arrangement with Amazon Prime Video, instead of its usual 30 percent rate, Schiller said that in terms of \"threat level,\" the Amazon Appstore posed a \"very high\" threat to Apple, and in the second quarter of 2016, the ‌App Store‌ grew to be worth more than the Mac and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> to the company.\r\n<br />\r\n\r\n<br />\r\nTo read the full documents or for more highlights, <a href=\"https://www.theverge.com/22611236/epic-v-apple-emails-project-liberty-app-store-schiller-sweeney-cook-jobs\">see the original article</a>.<div>Tags: <a href=\"https://www.macrumors.com/guide/eddy-cue/\">Eddy Cue</a>, <a href=\"https://www.macrumors.com/guide/steve-jobs/\">Steve Jobs</a>, <a href=\"https://www.macrumors.com/guide/phil-schiller/\">Phil Schiller</a>, <a href=\"https://www.macrumors.com/guide/scott-forstall/\">Scott Forstall</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/20/apple-sideloading-plans-ecosystem-lock-in-revealed/\">Apple's Past Sideloading Plans, Ecosystem Lock-in Strategy, and More Revealed in Internal Documents</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-past-sideloading-plans-ecosystem-lock-in-strategy-and-more-revealed-in-internal-documents.2308143/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=lbS7bnb7xJI:AV-_Zr8Eccc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=lbS7bnb7xJI:AV-_Zr8Eccc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/lbS7bnb7xJI\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2ba43312931b6acf7f482e8672137ce17e175ee3500c6bad07e6ff6ec8f32e96","category":"Apple"}