{"title":"Enhancing the Properties of Liquid Crystal Polymers and Elastomers with Nano Magnetic Particles","link":"https://www.preprints.org/manuscript/202408.2040/v1","date":1724834055000,"content":"Side-chain liquid crystal polymers have been mixed with ferromagnetic particles, and the for-mation of a monodomain in magnetic fields studied.  At relatively low concentrations, the presence of ferroparticles substantially speeds up the rate of formation of a monodomain with the magnetic field and at a given concentration of ferrofluid that rate is independent of the magnetic field strength. In this way, rapid formation of a monodomain is possible at magnetic field strengths far lower than required for the liquid crystal polymer alone. This is anticipated to very helpful in the fabrication of devices based on monodomain liquid crystal elastomers. Wide angle x-ray scattering has been used to monitor the formation of the monodomain and small angle x-ray scattering can give some indication of the ferroparticle behaviour. A model is developed to explain the behaviour. The alignment properties of the ferroparticles is related to their ability to form chains under the influence of very low magnetic fields; these chains are of relatively low stability and may become disrupted after long times, high magnetic fields, or high concentrations.  In general, the best results for alignment were at volume fractions below 1%, and under these con-ditions there is the potential for producing monodomain samples with improved properties; in particular shape changes with temperature are significantly larger as a result of improved backbone orientation.  Experiments involving monodomain formation and director realignment suggest that the presence of ferroparticles results in a modification in the mechanism for alignment development driven by the organisation of the polymer backbone as a consequence of the con-straints offered by the morphology of the chains of ferroparticles.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2ba51519617d32bd8ed54336ae4e0b4de394f4120b0697ef12dbaaa3334819ac","category":"Interdisciplinary"}