{"title":"GOP’s Big Tech plan ignores consumers, targets “censorship” of Republicans instead","link":"https://arstechnica.com/?p=1778874","date":1625773094000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/getty-gop-elephant-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/getty-gop-elephant.jpg\">Enlarge</a> <span>/</span> The Republican Party elephant symbol at the Conservative Political Action Conference in National Harbor, Maryland, on Friday, Feb. 28, 2020. (credit: <a href=\"https://www.gettyimages.com/collections/bloomberg\">Getty Images | Bloomberg</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Congressional Republicans released an antitrust plan for Big Tech yesterday with an <a href=\"https://twitter.com/JudiciaryGOP/status/1412781372599570437/photo/1\">announcement</a> that made it clear their focus is not on boosting competition or reducing harms to online consumers but on alleged \"censorship\" of conservatives.</p>\n<p>\"Big Tech is out to get conservatives\" is the first sentence in the \"<a href=\"https://republicans-judiciary.house.gov/wp-content/uploads/2021/07/2021-07-06-The-House-Judiciary-Republican-Agenda-for-Taking-on-Big-Tech.pdf\">House Judiciary Republican Agenda for Taking on Big Tech</a>.\" The \"conservative response\" to tech-industry problems \"will speed up and strengthen antitrust enforcement, hold Big Tech accountable for its censorship, and increase transparency around Big Tech's decisions,\" the opening paragraph continues. The word \"competition\" never appears in the two-page plan. A separate <a href=\"https://www.republicanleader.gov/framework-to-stop-the-bias-and-check-big-tech/\">plan</a> previously released by House GOP Leader Kevin McCarthy (R-Calif.) does mention competition, but McCarthy's plan also focuses mostly on supposed bias against conservatives.</p>\n<p>The House Judiciary Republicans' plan was released as former President <a href=\"https://arstechnica.com/tech-policy/2021/07/trump-sues-twitter-facebook-and-youtube-in-preposterous-bid-for-reinstatement/\">Donald Trump sued Twitter, Facebook, and Google subsidiary YouTube</a> for banning him, claiming that all three companies are guilty of \"impermissible censorship\" that violates \"the First Amendment right to free speech.\" Trump's lawsuit has been widely mocked by legal experts and is almost certain to be defeated because the First Amendment does not require private companies to host speech and because Section 230 of the Communications Decency Act gives online platforms immunity from lawsuits over how they moderate user-submitted content.</p></div><p><a href=\"https://arstechnica.com/?p=1778874#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1778874&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2ba87a9306f19b466c269cb2c4a85952acdbc392c2cc5790d330cbefa6d2d2e7","category":"Tech"}