{"title":"Biochar alleviated the toxic effects of microplastics‐contaminated geocarposphere soil on peanut (Arachis hypogaea L.) pod development: roles of pod nutrient metabolism and geocarposphere microbial modulation","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13191?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The accumulation of microplastics in agricultural soil poses a threat to the sustainability of agriculture, impacting crop growth and soil health. Due to the geocarpy feature of peanut, geocarposphere soil environment is critical to pod development and its nutritional quality. While the effects of microplastics in the rhizosphere have been studied, their impact on peanut pod in the geocarposphere remains unknown. Biochar has emerged as a potential soil agent with the ability to remediate soil contamination. However, the mechanisms of biochar in mitigating the toxic effects of microplastics-contaminated geocarposphere soil on peanut pod development remain largely unexplored.</p>\n<h2>RESULTS</h2>\n<p>We evaluated the peanut pod performance and microbiome when facing microplastics contamination and biochar amendment in geocarposphere soil. The results showed that microplastics present in geocarposphere soil could directly enter the peanut pod, cause pod developmental disorder and exert adverse effects on nutritional quality. Aberrant expression of key genes associated with amino acid metabolism, lipid synthesis, and auxin and ethylene signaling pathways were the underlying molecular mechanisms of microplastics-induced peanut pod developmental inhibition. However, these expression abnormalities could be reversed by biochar application. In addition, peanut geocarposphere microbiome results showed that biochar application could restore the diversity of microbial communities inhibited by microplastics contamination and promote the relative abundance of bacteria correlated with pathogen resistance and nitrogen cycle of geocarposphere soil, further promoting peanut pod development.</p>\n<h2>CONCLUSION</h2>\n<p>This study demonstrated that biochar application is an effective strategy to mitigate the toxic effects of microplastics-contaminated geocarposphere soil on pod development and nutritional quality. © 2023 Society of Chemical Industry.</p>","author":"Liyu Yang, \nHaiyan Liang, \nQi Wu, \nPu Shen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"2ba9fc45f85fefc251dac89c47eabdd1325bd89a5571fd7a94ed2bbbe7ec4ab5","category":"Environment"}