{"title":"The phylogeny and diversification of the western Eurasian Phaedusinae (Gastropoda: Stylommatophora: Clausiliidae)","link":"https://academic.oup.com/zoolinnean/article/doi/10.1093/zoolinnean/zlae103/7747376?rss=1","date":1725235200000,"content":"<span><div>Abstract</div>The little-known western Eurasian taxa of the Phaedusinae (land snail family Clausiliidae) are Tertiary relicts, which are widely separated geographically from the rest of the subfamily occurring in eastern Eurasia. In order to elucidate the phylogenetic relationships of this group, we carried out molecular analyses with 11 of the 16 genera using nuclear gene sequences. Our results revealed that within the subfamily, <span>Nothoserrulina</span> and <span>Pamphylica</span>, together with <span>Caspiophaedusa</span>, <span>Dobatia</span>, <span>Pravispira</span>, and <span>Serrulina</span>, belong to a clade that is sister to that of all east Eurasian Phaedusinae except <span>Synprosphyma</span>. In contrast, <span>Graecophaedusa</span>, <span>Laeviphaedusa</span>, <span>Pontophaedusella</span>, and <span>Serrulinella</span>, together with <span>Pontophaedusa</span>, belong to paraphyletic lineages diverging between the branching point of these clades and that of the most basal <span>Synprosphyma</span> lineage. <span>Laeviphaedusa</span> and <span>Pontophaedusella</span> represent the earliest western Eurasian lineages, estimated to date back to the Eocene–Oligocene boundary. Comparison of our phylogeny to morphological traits of the genera identified clade-specific character states of the shells and the reproductive organs. Based on fossil records and on palaeogeographical and palaeofloristic data, we also propose a model for the geographical origin and radiation of this subfamily in Eurasia.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"2bb152fb7795c5e266832c271cdc57c270371491e1be2e55d36d4e83be9cb90a","category":"Environment"}