{"title":"Assessing genotype–environment interactions in Atlantic salmon reared in freshwater loch and recirculating systems","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13751?af=R","date":1723186800000,"content":"<h2>Abstract</h2>\n<p>The interest in recirculating aquaculture systems (RAS) is growing due to their benefits such as increased productivity, better control over animal care, reduced environmental effects, and less water consumption. However, in some regions of the world, traditional aquaculture methods remain prevalent, and selective breeding has often been designed for performance within these systems. Therefore, it is important to evaluate how current fish populations fare in RAS to guide future breeding choices. In a commercial setting, we explore the genetic structure of growth characteristics, measure genotype–environment interactions (GxE) in salmon smolts, and examine genetic markers related to growth in freshwater lochs and RAS. Young salmon were raised together until they reached the parr stage, after which they were divided equally between freshwater net-pens and RAS. After an 8-week period, we sampled fish from each environment and genotyped them. Our findings revealed that fish reared in RAS were generally smaller in weight and length but exhibited a higher condition factor and uniformity. We found a notably smaller component of unexplained variance in the RAS, leading to higher heritability estimates. We observed a low GxE effect for length and condition factor, but significant re-ranking for whole-body weight, as well as noticeable differences in trait associations across environments. Specifically, a segment of chromosome 22 was found to be linked with the condition factor in the RAS population only. Results suggests that if the use of RAS continues to expand, the efficiency of existing commercial populations may not reach its full potential unless breeding programs specific to RAS are implemented.</p>","author":"Mette J. Tollervey, \nMichaël Bekaert, \nAgustín Barría González, \nSaif Agha, \nRoss D. Houston, \nAndrea Doeschl‐Wilson, \nAshie Norris, \nHerve Migaud, \nAlejandro P. Gutierrez","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"2bb5761f1344d137dbb1c46a715fe554e45c1bc2badb39bdfce545e9b1b28b41","category":"Environment"}