{"title":"The Universal Vital Assessment (UVA) score at 6 hours post-resuscitation predicts mortality in hospitalized adults with severe sepsis in Mbarara, Uganda","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003797","date":1729605600000,"content":"<p>by Megan Null, Mark Conaway, Riley Hazard, Louisa Edwards, Kabanda Taseera, Rose Muhindo, Sam Olum, Amir Abdallah Mbonde, Christopher C. Moore</p>\r\n\r\nSepsis is the leading cause of global death with the highest burden found in sub-Saharan Africa (sSA). The Universal Vital Assessment (UVA) score is a validated resource-appropriate clinical tool to identify hospitalized patients in sSA who are at risk of in-hospital mortality. Whether a decrease in the UVA score over 6 hours of resuscitation from sepsis is associated with improved outcomes is unknown. We aimed to determine (1) the association between 6-hour UVA score and in-hospital mortality, and (2) if a decrease in UVA score from admission to 6 hours was associated with improved in-hospital mortality. We analyzed data from participants with severe sepsis aged ≥14 years enrolled at the Mbarara Regional Referral Hospital in Uganda from October 2014 through May 2015. Among 197 participants, the median (interquartile range) age was 34 (27–47) years, 99 (50%) were female and 116 (59%) were living with HIV. At 6 hours, of the 65 participants in the high-risk group, 28 (43%) died compared to 28 (30%) of 94 in the medium-risk group (odds ratio [OR] 0.56, 95% confidence interval [CI] 0.29,1.08, p = 0.086) and 3 (9%) of 33 in the low-risk group (OR 0.13, 95% CI 0.03, 0.42, p = 0.002). In a univariate analysis of the 85 participants who improved their UVA risk group at 6 hours, 20 (23%) died compared to 39 (36%) of 107 participants who did not improve (OR 0.54, 95% CI 0.27–1.06, p = 0.055). In the multivariable analysis, the UVA score at 6 hours (adjusted OR [aOR] 1.26, 95%CI 1.10–1.45, p&lt;0.001) was associated with in-hospital mortality. When adjusted for age and sex, improvement in the UVA risk group over 6 hours was associated with a non-statistically significant 43% decrease in odds of mortality (aOR 0.57, 95%CI 0.29–1.07, p = 0.08). Targeting a decrease in UVA score over 6 hours from admission may be a useful clinical endpoint for sepsis resuscitation in sSA, but this would need to be proven in a clinical trial.","author":"Megan Null","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"2bbad5feb8ccc04c9d9726026ed4c8fb1e9933336a3c63144c056459f0851874","category":"Environment"}