{"title":"Predicting Mutual Fund Stress Levels Utilizing Sebi&rsquo;s Stress Test Parameters in MidCap and SmallCap Funds Using Deep Learning Models","link":"https://www.preprints.org/manuscript/202410.0639/v1","date":1728469229000,"content":"AbstractThe Association of Mutual Funds of India (AMFI) under the direction of the Securities and Exchange Board of India (SEBI) provided open access to various risk parameters with respect to MidCap and SmallCap funds on its website in February, 2024. This disclosure of month wise cross-sectional data depicting stress-test and liquidity analysis was hailed as a milestone as it provided a glimpse into inherent risk of mutual funds. The AMFI dataset consisted of 14 variables including stress test results, ownership concentration on both liability &amp; asset sides, standard deviation on portfolio’s returns, portfolio beta, trailing 12-month PE ratio, portfolio turnover etc. Among these, the primary variable identified in grading mutual fund is the stress test parameter, expressed as number of days required to liquidate 50% and 25% of the portfolio respectively on a pro-rata basis under stress condition. A higher number of days to liquidate the portfolio under stress conditions represented higher risk for the investor. The objective of our paper is to test various neural network models which can help in predicting stress levels with the highest accuracy and specificity in MidCap and SmallCap mutual funds based on AMFI’s 14 parameters as predictors.Our study utilizes AMFI datasets available for MidCap and SmallCap mutual funds from February 2024 (inception period) to May 2024. To operationalize the analysis, the derived response variable was binned to represent high and low risk based on the time required for pro-rata liquidation of the portfolio. The study employed feed-forward neural networks, with the logistic regression as the step function, to model the relationships. Results suggest that the simpler neural network models with one hidden layer and two to three nodes show higher accuracy and specificity.  Analysis also shows that more complex architectures do not always guarantee better performance as these models might suffer from higher bias. By leveraging advanced computational techniques, this study contributes to the ongoing discourse surrounding risk management and decision-making in the realm of mutual fund investments.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2bbcc48333c2aac81baf3ba5e8db71af94e908f6e4808d972f81d510ca841fc4","category":"Interdisciplinary"}