{"title":"Chemical modification, structure elucidation and antifungal mechanism studies of a peptide extracted from garlic (Allium sativum L.)","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13633?af=R","date":1718015972000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Garlic is a promising source of antimicrobial peptide separation, and chemical modification is an effective method for activity improvement. The present study aimed to improve the antifungal activity of a peptide extracted from garlic. Chemical modifications were conducted, and the structure–activity relationship and antifungal mechanism were investigated.</p>\n<h2>RESULTS</h2>\n<p>The results indicated that the cationic charge induced by Lys residue at the <i>N-</i>terminal was important for the antimicrobial activity, and the modified sequence exhibited significant antifungal activity with low mammalian toxicity and a low tendency of drug resistance (<i>p</i> &lt; 0.05). The structure–activity relationship analysis revealed that the modified active peptide had a predominant α-helical structure and an inner cyclic correlation. Transcriptomic analysis showed that peptide KMLKKLFR (Lys-Met-Leu-Lys-Lyse-Leu-Phe-Arg) affected the rRNA processing and carbon metabolism process of <i>Candida albicans</i>. In addition, the membrane potential study indicated a non-membrane destruction mechanism, and molecular docking analysis and a DNA interaction assay suggested promising inner targets.</p>\n<h2>CONCLUSION</h2>\n<p>The results of the present study indicate that chemical modification by amino acid substitution was effective for antimicrobial activity improvement. The present study would benefit future antimicrobial peptide development and suggests that garlic is a great source of antibacterial peptides and peptide template separations for coping with antibiotic resistance. © 2024 Society of Chemical Industry.</p>","author":"Shuqin Li, \nJunyu Liu, \nTingting Zhang, \nJingyang Lu, \nMingyue Li, \nMin Zhang, \nHaixia Chen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"2bbf2c960daeee5c4eacab562c874d487cf06d6b5b157752867cd22f5fe2b7c5","category":"Environment"}