{"title":"Predictors of medical staff’s knowledge, attitudes and behavior of dysphagia assessment: A cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301770","date":1712325600000,"content":"<p>by Juanhui Chen, Wenqiu Ye, Xingyun Zheng, Wenna Wu, Yuebao Chen, Yinjuan Chen</p>\r\nPurpose <p>This study aimed to explore the predictors of medical staff’s Knowledge, Attitudes and Behavior of dysphagia assessment, to provide reference suggestions for constructing the training program and improving the rate of dysphagia assessment.</p> Methods <p>This study was a cross-sectional study. A total of 353 nurses and doctors from four provinces (Guangdong, Hunan, Guangxi, and Shaanxi) who were selected by convenience sampling and invited to complete the questionnaire through WeChat, DingTalk, and Tencent instant messenger from May 23 to 31, 2022. A self-reported questionnaire was used to assess participants’ Knowledge, Attitude and Behavior regarding dysphagia assessment. Participants’ sociodemographic, training, and nursing experience were measured using the general information sheet and analyzed as potential predictors of medical staff’s Knowledge, Attitudes and Behavior of dysphagia assessment. A multiple linear regression model was used to identify the predictors.</p> Results <p>The mean scores for Knowledge, Attitudes and Behavior of dysphagia assessments were (15.3±2.7), (35.9±4.9) and (41.4±14.4) respectively. Knowledge and Behavior of medical staff were medium, and attitude was positive. Multiple linear regression results indicated that experience in nursing patients with dysphagia, related training for dysphagia, working years in the field of dysphagia related diseases, specialized training (geriatric, swallowing and rehabilitation) and department (Neurology, Rehabilitation, Geriatrics) were significant predictors of Behavior, accounting for 31.5% of the variance. Working years in the field of dysphagia related diseases, department (Neurology, Rehabilitation, Geriatrics) and title were significant predictors of medical staff’s knowledge, accounting for 7.8% of variance. Education, experience in nursing patients with dysphagia, department (Neurology, Rehabilitation, Geriatrics) and related training for dysphagia were significant predictors of medical staff’s attitude, accounting for 12.9% of variance.</p> Conclusions <p>The study findings implied that nursing experience, training, and work for patients with swallowing disorders could have positive effects on the Knowledge, Attitudes and Behavior of medical staff regarding dysphagia assessment. Hospital administrators should provide relevant resources, such as videos of dysphagia assessment, training centers for the assessment of dysphagia, and swallowing specialist nurses.</p>","author":"Juanhui Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2bc25235945ff16677f80e12859abd8c08fbf2b37177eb577e7ea1da21754e27","category":"Interdisciplinary"}