{"title":"In Vitro Human Liver Model for Toxicity Assessment with Clinical and Preclinical Instrumentation","link":"https://www.preprints.org/manuscript/202404.0291/v1","date":1712133430000,"content":"Analysing the human body by direct observation can lead to misinterpretation of underlying trends, whereas in vitro organ models facilitate their understanding. Likewise, in vitro organ models serve as valuable tools for assessing the toxicity of compounds. However, none of the existing models had the features we considered critical for toxicity assessment, so we developed an in vitro liver model for toxicity assessment. We used four different types of primary liver cells: Hepatic sinusoidal endothelial cells, hepatic stellate cells, Kupffer cells and hepatocytes. We cultured them in different combinations of composition and volume of cell medium, hepatocyte proportion of total cells, and addition of extracellular matrix. We added rifampicin, ibuprofen and 5-fluorouracil to this model and observed the microanatomy and physiology changes for a week with preclinical and clinical instruments. Among the different model configurations, we selected the feature combination of the in vitro model that had similar biomarker values to those measured by the clinical instruments used in clinical diagnostics. When we exposed the selected model configuration to rifampicin, ibuprofen and 5-fluorouracil, the viability of Kupffer cells and liver sinusoidal endothelial cells was significantly lower than in the untreated samples. In contrast, we observed negligible viability of hepatocytes compared to the untreated samples. We have built an in vitro liver model that resembles the liver microenvironment and we have analysed it with clinical instrumentation to facilitate the data translation. In this sense, we have established that Kupffer and LSEC cells are suitable candidates for the search for clinical diagnostic markers of liver function.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2bcb23078c9d72e9def520779360a8295d5cdb6f2e9d59de719bdd372340f2bf","category":"Interdisciplinary"}