{"title":"Serum metallomics reveals insights into the associations of elements with the progression of preleukemic diseases toward acute leukemia†","link":"https://academic.oup.com/biomethods/article/doi/10.1093/biomethods/bpad027/7335835?rss=1","date":1698796800000,"content":"<span><div>Abstract</div>Acute leukemia (AL) is a critical neoplasm of white blood cells with two main subtypes: acute lymphoblastic leukemia (ALL) and acute myeloid leukemia (AML). This study is focused on understanding the association of the preleukemic disease aplastic anemia (APA) with ALL and AML at metallomic level, using healthy subjects as a control. In this study, a validated and efficient inductively coupled plasma-mass spectrometry/MS-based workflow was employed to profile a total of 13 metallomic features. The study encompassed 41 patients with AML, 62 patients with ALL, 46 patients with APA, and 55 age-matched healthy controls. The metallomic features consisted of eight essential elements (Ca, Co, Cu, Fe, Mg, Mn, Se, and Zn) and five non-essential/toxic elements (Ag, Cd, Cr, Ni, and Pb). Six out of the 13 elements were found to be substantially different (P &lt; .05) using absolute concentrations between serum samples of AL (ALL and AML) and preleukemia (APA) patients in comparison with healthy subjects. Elements including magnesium, calcium, iron, copper, and zinc were upregulated and only one element (chromium) was downregulated in serum samples of disease when compared with healthy subjects. Through the utilization of both univariate tests and multivariate classification modeling, it was determined that chromium exhibited a progressive behavior among the studied elements. Specifically, chromium displayed a sequential upregulation from healthy individuals to preleukemic disease (APA), and ultimately in patients diagnosed with ALL. Overall, metallomic-based biomarkers may have the utility to predict the association of APA with ALL.</span>","author":"","siteTitle":"Biology Methods and Protocols Current Issue","siteHash":"69c994dba77628d461517adf354c299799d03c68fbf0494d0a5619d40a95f351","entryHash":"2bcf154d93547fd6f61af142ec0eb06f2002931d148565fea30ceeb772bb1c76","category":"Environment"}