{"title":"106 Advancing precision livestock management in the dairy industry: An early exploration of individual cow tracking using YOLOv5-Based computer vision","link":"https://academic.oup.com/jas/article/102/Supplement_1/98/7617927?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Precision livestock management in the dairy industry holds promise for addressing the ability of future livestock producers to accurately track multiple health factors related to animal welfare and milk production. While there are significant challenges with integrating sensors into the dairy, a key challenge lies in accurately tracking individual cows across multiple sensors, allowing data correlation with health and milk records. The emergence of artificial intelligence and other innovative technologies provides a unique opportunity for livestock producers. The objective of this study is to examine the ability of computer-based vision using YOLOv5 to automatically detect and identify individual animals housed in a group setting. The study was conducted at the Joe Bearden Dairy Research Center, where lactating cows (seven Holstein-Friesian, three Jersey) were housed within a single pen of a freestall with sand bedding. Animals were managed in accordance with the standard operating procedure of the dairy. Video was captured in 4k resolution via a four camera closed caption media recording system. Cameras were placed at an angle in each corner of the pen providing multiple perspectives of each animal throughout the study. Initial training video data for the algorithm were generated through manual annotation from a single viewpoint for proof of concept. The video capture was segmented into a total of 3,241 frames, with a total of 84 frames manually annotated using open-source software and utilized for training data spanning 75 epochs. Eight images were used for validation. Transfer learning was applied using pretrained weights for the YOLOv5s model. The trained model achieved high precision (0.97) and recall (0.96) during validation. Notably, the F1-Confidence curve showcases a good F1 score of 0.96 at a confidence interval of 0.69. In conclusion, this preliminary work sets the stage for effective sensing and individual cow tracking, with far-reaching implications for dairy farming precision and productivity. While the trained model exhibited strong performance within the confines of its training data, challenges arise when presented with previously unseen angles of the animals, leading to potential identification errors. Moreover, the presence of sand beds occasionally obstructs clear views of the animals, introducing additional uncertainties. To address these challenges and enhance the robustness of the model, future work should incorporate images captured from additional camera viewpoints, ensuring a more comprehensive and reliable identification system for precision animal management in the dairy industry.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2bcf971faccf7b94e14190d6a4a861e32ae4155c1ca7e23932890d7d476a2f79","category":"Environment"}