{"title":"Hands-On With the New Transparent Nothing Phone (2)","link":"https://www.macrumors.com/2023/07/11/nothing-phone-2-hands-on/","date":1689089400000,"content":"Nothing today announced the launch of the Nothing Phone (2), the second-generation followup to the original Nothing Phone that came out last year. Like the Nothing Phone, the 6.7-inch Nothing Phone (2) features a unique transparent design with LED highlights that Nothing calls a Glyph Interface.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThere are additional LED segments in the Glyph for improved customizability, with light and sound sequences able to be assigned to contacts or used for ringtones. The LEDs are also able to function as a progress tracker for ride or delivery services, plus they can alert users to notifications. Design wise, the Phone (2) has a thinner midframe and a pillowed glass back that Nothing says makes it more ergonomic.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/nothing-phone-1.jpg\" alt width=\"2000\" height=\"1456\" />\r<br />\nThe Phone (2) runs the Android-based Nothing OS, and the new version can be used in a monochrome colorway with no app labels. Key features can be accessed through widgets without the need to open an app, and the operating system supports custom grid designs, widget sizes, and color themes.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/nothing-phone-2.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nAs for the camera, the Phone (2) includes a 32-megapixel front-facing camera and a dual rear camera system with two 50-megapixel sensors. The device is powered by a Snapdragon 8+ Gen 1 chip and it is equipped with a 4700mAh battery.\r<br />\n\r<br />\nThe Nothing Phone (2) is launching in the United States as well as other countries, and this marks the first time that a Nothing device has been available in the U.S. It can be preordered in the United States, UK, and Europe today, with pricing starting at $599 for 8GB RAM and 128GB storage.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/nothing-phone-3.jpg\" alt width=\"2000\" height=\"1335\" />\r<br />\nGeneral availability will begin on July 17, and U.S. customers in New York can attend an event on July 13 to be among the first in the world to purchase the Phone (2).<br />This article, \"<a href=\"https://www.macrumors.com/2023/07/11/nothing-phone-2-hands-on/\">Hands-On With the New Transparent Nothing Phone (2)</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/hands-on-with-the-new-transparent-nothing-phone-2.2395615/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2bd17d79d1890fbca8e5fc7fc249e3f93834da80a3e0bcdeb50c34d1554ff391","category":"Apple"}