{"title":"iOS 17.4 Features: What's New in iOS 17.4","link":"https://www.macrumors.com/guide/ios-17-4-features/","date":1709677716000,"content":"Apple today released the iOS 17.4 update that brings some major changes to the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> (and the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>) in Europe. Many of the biggest changes in iOS 17.4 are limited to people in the European Union, but there new additions in the update that are available worldwide.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/iOS-17.4-Feature-Blue.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nIn this article, we've rounded up everything new in iOS 17.4.\r<br />\n\r<br />\n<h2>EU Changes</h2>\r<br />\nApple is changing the way the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> and apps operate in the European Union in order to comply with the Digital Markets Act. These changes are included in iOS 17.4, but are limited to countries that are in the European Union.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/iOS-App-Store-General-Feature-Black.jpg\" width=\"2250\" height=\"1266\" />\r<br />\n\r<br />\n<h3>Alternative App Stores and New App Store Terms (EU)</h3>\r<br />\nApp developers in the EU can opt to offer alternative app stores or install their apps through alternative stores, and Apple has a whole new fee structure that goes along with this change. There's a new business structure that developers can opt in to, which applies to both apps distributed in the ‌App Store‌ and apps that are distributed through alternative means.\r<br />\n\r<br />\nApp developers using the new system will need to pay a standard fee of 0.50 euros per user per year, with the first million installs offered for free. Apps distributed through alternative app stores will have no commission. Apps distributed through the ‌App Store‌ will pay a reduced 17 percent commission, or 10 percent for those in the small business program or for user subscriptions older than a year.\r<br />\n\r<br />\nDevelopers can choose not to opt in to the new system and can use the existing system with the same 15/30 percent commission that's available elsewhere in the world. Apple has a fee calculator to help developers determine what they'll pay with the existing setup, with the new setup, with the new setup using alternative app stores, and with the new setup using the ‌App Store‌.\r<br />\n\r<br />\nUsers are able to set their preferred alternative app store as the default app store on their device if desired. EU users will see an option for this in the Settings app.\r<br />\n\r<br />\nThere are a huge number of behind-the-scene changes that are enabling this feature in the EU, with updates to all kinds of system messaging. Users in the EU will, for example, get a pop up warning when an app from an alternative app store contains malware, and there are new screens for verifying the information from an alternative app.\r<br />\n\r<br />\nA Screen Time setting will allow parents to decide whether their children's devices are able to install apps from alternative app marketplaces.\r<br />\n\r<br />\n<h3>Alternative Payment Options (EU)</h3>\r<br />\nApple is also allowing apps to use alternative payment options in their apps, and there is no longer a requirement to use in-app purchase. Developers who distribute apps through the ‌App Store‌ and use an alternative payment option will see a three percent discount in their ‌App Store‌ fees.\r<br />\n\r<br />\nDevelopers who distribute through alternative apps and also use an alternative payment option will pay Apple no fees beyond the set 0.50 euro fee per user.\r<br />\n\r<br />\nWith alternative payments, purchases for digital goods and services can be made directly in an app or a developer can choose to link to their website to have a user make a payment. Apple is requiring developers to use a known, secure payment provider.\r<br />\n\r<br />\n<h3>Third-Party Browser Updates (EU)</h3>\r<br />\nAfter updating to iOS 17.4, EU users that open Safari will see a pop up that allows them to choose a new default browser option from a list of the most popular browsers on iOS.\r<br />\n\r<br />\nApple is also allowing alternative browser engines, and will not limit browsers like Chrome to the WebKit engine.\r<br />\n\r<br />\n<h3>NFC Access (EEA)</h3>\r<br />\nThird-party payment apps and banks have access to the NFC chip in the ‌iPhone‌ in iOS 17.4, and can offer contactless payments directly on the ‌iPhone‌ without using <a href=\"https://www.macrumors.com/roundup/apple-pay/\">Apple Pay</a> or the Wallet app in the European Economic Area. Users can set a default contactless payment provider that activates at tap-to-pay terminals or when the Side button on the ‌iPhone‌ is pressed twice.\r<br />\n\r<br />\nThe option for setting a default contactless payment provider is available in the Settings app in the European Economic Area, and this section will also provide details on all apps that have requested and been granted contactless payment access.\r<br />\n\r<br />\nEEA users can also change the default Wallet app on the ‌iPhone‌.\r<br />\n\r<br />\n<h3>Web Apps (EU)</h3>\r<br />\nApple initially <a href=\"https://www.macrumors.com/2024/02/08/ios-17-4-nerfs-web-apps-in-the-eu/\">restricted the functionality</a> of Progressive Web Apps (PWAs) in the European Union in iOS 17.4, but after a negative response from EU users, Apple walked the decision back.\r<br />\n\r<br />\n<a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a> Web Apps will no longer be disabled, <a href=\"https://www.macrumors.com/2024/03/01/apple-walks-back-decision-to-disable-eu-web-apps/\">but WebKit is required</a>. Web apps added to the ‌iPhone‌ from a browser that does not support WebKit will not work.\r<br />\n\r<br />\n<h2>Gaming App Changes (Worldwide)</h2>\r<br />\nStreaming game apps are now allowed on the ‌App Store‌ worldwide, which means services like Xbox Cloud Gaming and Nvidia GeForce NOW can be offered as standalone ‌iPhone‌ and ‌iPad‌ apps.\r<br />\n\r<br />\nApple previously only allowed cloud gaming services to be offered via the web, but dedicated apps that let users stream games from servers are now permitted.\r<br />\n\r<br />\nMini games, chatbots, and plug-ins are also now able to use the in-app purchase system.\r<br />\n\r<br />\n<h2>New Emoji</h2>\r<br />\niOS 17.4 introduces new emoji characters that include lime, an edible brown mushroom, a phoenix, a broken chain, shaking head vertically (as in a \"yes\" nod), and shaking head horizontally (a \"no\" head shake).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/iOS-17.4-New-Emoji-Feature-2.5.jpg\" width=\"1920\" height=\"1077\" />\r<br />\nThere are also 18 people and body emojis that now have the option to face in either direction.\r<br />\n\r<br />\nThese emoji are part of the Unicode 15.1 update that was <a href=\"https://www.macrumors.com/2023/09/19/ios-17-future-emoji/\">approved in September 2023</a>.\r<br />\n\r<br />\n<h2>Messaging with Siri</h2>\r<br />\nThe Automatically Send Messages setting under <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> &amp; Search has been renamed \"Messaging with ‌Siri‌,\" and there is an option to set ‌Siri‌ to read incoming messages in a specific language like Spanish, French, German, Chinese, and many more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/ios-17-4-messaging-with-siri.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThe change does not update the primary language that ‌Siri‌ listens in and responds to, but is limited to message playback.\r<br />\n\r<br />\n<h2>Podcasts and Music</h2>\r<br />\nThe \"Listen Now\" tabs in the <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> and Podcasts apps have been renamed to \"Home.\"\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/apple-music-home.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nPodcasts also uses the ‌Apple Music‌ Now Playing bar when collapsed.\r<br />\n\r<br />\n<h2>Podcast Transcripts</h2>\r<br />\nThe Podcasts app now offers transcripts, similar to how lyrics work in the ‌Apple Music‌ app. You can follow along with an episode as the text is highlighted in sync with the audio.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/podcast-app-transcript.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nPodcast transcripts are available in English, Spanish, French and German, and the transcripts support searching for a specific word or phrase.\r<br />\n\r<br />\n<h2>Music Recognition</h2>\r<br />\nSongs that have been identified with music recognition can be added to ‌Apple Music‌ Playlists, the ‌Apple Music‌ Library, and ‌Apple Music‌ Classical.\r<br />\n\r<br />\n<h2>New iMessage Security Protocol</h2>\r<br />\nWith iOS 17.4 and iPadOS 17.4 Apple is introducing a \"state-of-the-art\" <a href=\"https://www.macrumors.com/2024/02/21/apple-announces-imessage-security-upgrade/\">post-quantum cryptographic protocol</a> for iMessage called PQ3.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/07/General-Apps-Messages.jpg\" width=\"2500\" height=\"1407\" />\r<br />\nPQ3 protects against \"Harvest Now, Decrypt Later\" attacks where a malicious actor collects encrypted data with the hope of decrypting it with a quantum computer at some point in the future. Quantum computers are expected to eventually be able to make large-scale calculations that would allow them to decrypt content secured with traditional encryption methods, but that won't be possible with PQ3.\r<br />\n\r<br />\n<h2>iPhone 15 Battery Health</h2>\r<br />\nApple in iOS 17.4 <a href=\"https://www.macrumors.com/2024/02/20/ios-17-4-iphone-15-battery/\">changed the Battery interface</a> in the Settings app on <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> models. These devices now show Battery Health with a readout such as \"Normal,\" for a quick at-a-glance way to see the status of the ‌iPhone‌'s battery.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/ios-17-4-battery-health-optimization-iphone-15.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nTapping into the battery health readout shows the battery cycle count, manufacture date, and first use will be listed. This information was previously hidden in the General &gt; About section of the Settings app.\r<br />\n\r<br />\nApple also updated the support information for the battery, as the company retested and found that the ‌iPhone 15‌ battery can maintain 80 percent of its original capacity <a href=\"https://www.macrumors.com/2024/02/20/apple-raises-iphone-15-advertised-battery-lifespan/\">at 1,000 complete charge cycles</a>.\r<br />\n\r<br />\n<h2>Stolen Device Protection</h2>\r<br />\nIn the Stolen Device Protection section of the Settings app, there is now an option to require a security delay always or only when away from familiar locations.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/ios-17-4-stolen-device-protection.jpg\" width=\"2000\" height=\"1125\" />\r<br />\n\r<br />\nApple says that this feature is designed to give users the option for increased security in all locations.\r<br />\n\r<br />\n<h2>Stopwatch Live Activity</h2>\r<br />\niOS 17.4 adds a Live Activity function for the Stopwatch feature on the ‌iPhone‌. When activated through the Clock app, the Stopwatch now shows up in the <a href=\"https://www.macrumors.com/guide/dynamic-island/\">Dynamic Island</a> and on the Lock Screen.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/ios-17-4-stopwatch.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThere are controls for pausing the Stopwatch, clearing it, and starting a new lap.\r<br />\n\r<br />\n<h2>Call Identification</h2>\r<br />\nCall identification in iOS 17.4 displays Apple-verified business names, logos, and department names when the information is available.\r<br />\n\r<br />\n<h2>Messages for Business</h2>\r<br />\nWith Messages for Business, businesses can provide opt-in information for order statuses, flight notifications, fraud alerts, and other transactions.\r<br />\n\r<br />\n<h2>Apple TV App</h2>\r<br />\nThe \"How to Watch\" section in the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> app that shows where a movie or TV show can be viewed now has a list interface rather than a card interface.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/ios-17-4-how-to-watch.jpg\" width=\"2000\" height=\"1125\" />\r<br />\n<h2>App Store</h2>\r<br />\nThe ‌App Store‌'s Purchase feature now shows account-wide purchase history for an <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a>. It includes TV and movie purchases, music purchases, subscriptions, and app purchases, and it is the same interface that is available when accessing the purchase information for any ‌Apple ID‌.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/app-store-purchase-history-ios-17-4.jpg\" width=\"5289\" height=\"2975\" />\r<br />\nApps are still listed, but under a new \"Apps\" section.\r<br />\n\r<br />\n<h2>Clock Widget</h2>\r<br />\nThere's a new City Digital Clock widget that can be added to the ‌Home Screen‌ or Lock Screen.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/ios-17-4-city-digital.jpg\" width=\"5344\" height=\"3006\" />\r<br />\n\r<br />\n<h2>Apple Cash Virtual Card Numbers</h2>\r<br />\nIn the Wallet app, Apple Cash users can generate a virtual card number to make purchases when ‌Apple Pay‌ is not an option.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/apple-cash-virtual-card-number.jpg\" width=\"1920\" height=\"1080\" />\r<br />\n\r<br />\n<h2>Real-Time Apple Card, Apple Savings, and Apple Cash Budget App Integration</h2>\r<br />\nApple in iOS 17.4 is giving third-party budget apps <a href=\"https://www.macrumors.com/2024/03/05/apple-card-ios-17-4-budget-apps/\">real-time information</a> on <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a>, Apple Cash, and Apple Savings accounts transactions for up-to-the-minute budget reporting.\r<br />\n\r<br />\n<h2>Hand Gesture Reactions in Video Apps</h2>\r<br />\nWith iOS 17.4, there's a new API for developers that can be used to turn off hand gesture reactions in video calls. <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> added a gesture reactions that are enabled by default in all video calling apps, leading to awkwardness when moving the hands in certain ways during serious calls.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/ios-17-facetime-effects.jpg\" width=\"1920\" height=\"1070\" />\r<br />\nOnline therapists and other professionals have had to add disclaimers about the feature, as there was no way to turn it off on the provider's end. Following iOS 17.4 and <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">macOS Sonoma</a>, developers can turn off the fireworks, confetti, and other options in their apps. Users were already able to turn off reactions on their iPhones, iPads, and Macs in the Settings app.\r<br />\n\r<br />\n<h2>Hey Siri</h2>\r<br />\nWith iOS 17.4, the option to say ‌Siri‌ instead of Hey ‌Siri‌ is now available for French, German, and Spanish speakers.\r<br />\n\r<br />\n<h2>CarPlay Instrument Cluster Update</h2>\r<br />\nIn supported <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a> vehicles, there's now an <a href=\"https://www.macrumors.com/guide/apple-maps/\">Apple Maps</a> option to show information about upcoming turn-by-turn maneuvers in the instrument cluster. ‌CarPlay‌ users will be able to swap the display type between the main and instrument cluster by tapping on the map configuration button located in the upper right of the main Maps screen.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/volvo-s60-drivers-apple-maps.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe option is available in vehicles that support the dual-screen ‌Apple Maps‌ ‌CarPlay‌ experience.\r<br />\n\r<br />\n<h2>Next-Generation CarPlay Support</h2>\r<br />\nNext-generation ‌CarPlay‌ is set to launch in the U.S. later in 2024, and code in iOS 17.4 references eight new ‌CarPlay‌ apps.\r<br />\n<ul>\r<br />\n <li><strong>Car Camera:</strong> This app will display the vehicle's rear-view camera feed.</li>\r<br />\n <li><strong>Charge:</strong> For electric vehicles, this app will display battery level, charging status, time remaining until the battery is fully charged, and more.</li>\r<br />\n <li><strong>Climate:</strong> This app will provide access to a vehicle's climate controls within ‌CarPlay‌, allowing you to adjust the temperature of the A/C or heating system, fan speed, heated seats, heated steering wheel, and more.</li>\r<br />\n <li><strong>Closures:</strong> This app will display if any of the vehicle's doors are opened, and it might also display vehicle warning symbols.</li>\r<br />\n <li><strong>Media:</strong> This app will provide access to FM and AM radio station controls within ‌CarPlay‌, along with other media options like SiriusXM. It is unclear if SiriusXM will offer satellite connectivity, or remain limited to internet streaming. Users will be able to select from a list of music genres, such as Top 40 and Rock.</li>\r<br />\n <li><strong>Tire Pressure:</strong> This app will display air pressure for each of the vehicle's tires, and provide low pressure, high pressure, and flat tire warnings.</li>\r<br />\n <li><strong>Trips:</strong> This app will provide a variety of driving-related data, including the vehicle's average speed, fuel efficiency or energy efficiency, the total time elapsed and distance traveled on a trip, and more.</li>\r<br />\n</ul>\r<br />\nAn image in iOS 17.4 beta suggests that ‌CarPlay‌ will also likely display a \"Goodbye\" screen after the driver shuts off the vehicle.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/Next-Generation-CarPlay-Goodbye.jpg\" width=\"1374\" height=\"484\" />\r<br />\n\r<br />\n<h2>Bug Fixes</h2>\r<br />\nThere are two bug fixes in iOS 17.4. The update addresses an issue that could cause contact images in <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> to be blank, and it fixes a Dual SIM problem that could cause the number used in a group message to change from primary to secondary.\r<br />\n\r<br />\n<h2>Security Updates</h2>\r<br />\niOS 17.4 and iPadOS 17.4 fix several vulnerabilities, including two that may have been actively exploited to gain access to user devices.\r<br />\n\r<br />\nApple patched an RTKit vulnerability and a WebKit vulnerability that it <a href=\"https://www.macrumors.com/2024/03/05/ios-17-4-vulnerability-fix/\">says may have been exploited</a>, so it is a good idea to update right away.\r<br />\n\r<br />\n<h2>Read More</h2>\r<br />\nFor details on all of the features that are included in the ‌iOS 17‌ update, we <a href=\"https://www.macrumors.com/roundup/ios-17/\">have a dedicated roundup</a>.<br />This article, \"<a href=\"https://www.macrumors.com/guide/ios-17-4-features/\">iOS 17.4 Features: What's New in iOS 17.4</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-4-features-whats-new-in-ios-17-4.2421157/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2bd6af15a254a954b90ac0c337bfeec48ce43301a3e3ae85d5c28ff8dfaa595f","category":"Apple"}