{"title":"Exploration of Choroidal Thinning Located Temporally to the Fovea: A Pilot Study","link":"https://www.preprints.org/manuscript/202407.0995/v1","date":1720745888000,"content":"Background/Objectives: Posterior staphyloma (PS) is a hallmark of pathological myopia  \n corresponding to a circumscribed outpouching of the eyeball with choroidal thinning and inward  \n scleral deformation at its edges. Its pathogenesis is still unclear, thus constituting a research priority \n as the prevalence of myopia is increasing worldwide. Recently, it has been suggested that the optic   \n nerve sheaths or oblique muscles are potential promoters of PS through the traction or compression \n effect that they apply to the eye wall. The inferior oblique muscle (IOM) inserts 1-2 mm from the \n macula. The projection of its insertion is accessible by Optical Coherence Tomography (OCT). \n Before launching prospective studies, we sought to detect any choroidal thinning (ChT) in the \n temporal vicinity of the macula and to measure the distance between it and the fovea (FT-distance). \n Methods: This retrospective cross-sectional pilot study included 120 eyes. Using Spectralis-OCT, \n the area centered by the Bruch’s membrane opening-fovea axis was analyzed for ChT and FT-\n distance. Results: Of the 112 defined eyes, 70% (78 eyes) had ChT. Pachymetry was significantly \n thinner (p = 0.018) in eyes with than without ChT. The mean FT-distance was 3601.9 ± 93.6µm. \n Conclusion: The location of ChT coincided with the insertion distance of the IOM, suggesting a link between them. The association between the presence of ChT and thinner pachymetry suggests reduced scleral resistance as thinner pachymetry is related to thinner sclera. Our results support a possible involvement of the IOM in the pathogenesis of certain PS, warranting further investigation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2bdc8dca1cbafcbce76724d326eaca2bcb563c87ca9cec6109d9cc27dd859bd4","category":"Interdisciplinary"}