{"title":"Transcriptomic signatures of WNT-driven pathways and granulosa cell-oocyte interactions during primordial follicle activation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311978","date":1729692000000,"content":"<p>by Hinako M. Takase, Tappei Mishina, Tetsutaro Hayashi, Mika Yoshimura, Mariko Kuse, Itoshi Nikaido, Tomoya S. Kitajima</p>\r\n\r\nPrimordial follicle activation (PFA) is a pivotal event in female reproductive biology, coordinating the transition from quiescent to growing follicles. This study employed comprehensive single-cell RNA sequencing to gain insights into the detailed regulatory mechanisms governing the synchronized dormancy and activation between granulosa cells (GCs) and oocytes with the progression of the PFA process. <i>Wntless</i> (<i>Wls</i>) conditional knockout (cKO) mice served as a unique model, suppressing the transition from pre-GCs to GCs, and disrupting somatic cell-derived WNT signaling in the ovary. Our data revealed immediate transcriptomic changes in GCs post-PFA in <i>Wls</i> cKO mice, leading to a divergent trajectory, while oocytes exhibited modest transcriptomic alterations. Subpopulation analysis identified the molecular pathways affected by WNT signaling on GC maturation, along with specific gene signatures linked to dormant and activated oocytes. Despite minimal evidence of continuous up-regulation of dormancy-related genes in oocytes, the loss of WNT signaling in (pre-)GCs impacted gene expression in oocytes even before PFA, subsequently influencing them globally. The infertility observed in <i>Wls</i> cKO mice was attributed to compromised GC-oocyte molecular crosstalk and the microenvironment for oocytes. Our study highlights the pivotal role of the WNT-signaling pathway and its molecular signature, emphasizing the importance of intercellular crosstalk between (pre-)GCs and oocytes in orchestrating folliculogenesis.","author":"Hinako M. Takase","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2be2c7c7f2b534922ab023c8d9588a379c4175cb5ae526573d5352aa614b31f9","category":"Interdisciplinary"}