{"title":"The structure of plant-herbivore interactions in urban savanna fragments reveals an unexpected high specialization and dependency on plant and insect attributes","link":"http://link.springer.com/10.1007/s11252-024-01599-x","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>Urbanization profoundly alters natural landscapes, leading to changes in species assemblages and ecological interactions. Despite increasing interest in understanding the effects of urbanization on species interactions, there is still a gap in knowledge regarding the structure of plant-herbivore networks in urban environments. Previous studies have indicated that anthropogenic impacts can alter the topology of plant-herbivore networks, making them more generalized in disturbed environments. Here, we investigate the topology of a plant-herbivore network in urban fragments of neotropical savanna in Brazil. As specialist species (i.e., those with few interactions) tend to be more sensitive to urbanization than generalist species (i.e., those with many interactions), we hypothesized that the urban savanna network would exhibit low specialization and modularity but high nestedness. We also tested if different attributes of insects (abundance, feeding guild, developmental stage, and taxon) and plants (abundance, height, and coverage) affect the diversity of their interactions at the species level. Contrary to our expectations, the network exhibited higher specialization and modularity than expected by null models, indicating urban environments may foster levels of specialization comparable to observed in previous studies for wild savannas. Regarding the species-level descriptors, we found that different characteristics of insect and plant species affect the diversity and specialization of their interactions. Our results showed that adult insects have higher degree and centrality in shaping the network, possibly attributed to their increased mobility and capacity to link various segments of the network. Similarly, chewing insects and thrips (Thysanoptera), known for their generalist interactions with plants, had higher number of interactions and were central within the network. Furthermore, larger plant species had a higher degree and greater betweenness centrality, while plant species with greater cover had lower specialization compared to herbs. This indicates that plant species with greater structural complexity accumulate more generalized interactions. Our results also show that more abundant species, both insects and plants, had a higher number of interactions and greater centrality in the network. Our study provides insights into the structure of plant-herbivore networks in urban savanna fragments, contributing to our understanding of species interactions in urban environments and their response to anthropogenic pressures.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"2be38492a0cd132bbcc626dba72b65538e762aa5fe9e98c2fa9b5896a79921a2","category":"Environment"}