{"title":"Preview: What you need to know about stage 19 of the Vuelta a España","link":"https://cyclingtips.com/2021/09/preview-what-you-need-to-know-about-stage-19-of-the-vuelta/","date":1630626315000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2021-vuelta-profile-stage19-650x275.jpeg\" /></div><h2>Preview: What you need to know about stage 19 of the Vuelta a España</h2><p>\n</p><p><strong>Date: </strong>Friday September 3<br /><strong>Start: </strong>Tapia<br /><strong>Finish: </strong>Montforte de Lemos<br /><strong>Distance: </strong>191.2 km</p>\n\n\n\n<p>A lumpy, mid-mountain stage that seems like a great day for the breakaway after the brutality of the previous stage. Then again, it could also be a bunch sprint of some form, depending on which sprinters are still in the race, and if the peloton feels inclined to keep the break on a tight leash. There are three early climbs but nothing of note after that.</p>\n\n\n\n<p><strong>Who’s it for: </strong>Possibly the breakaway, possibly a reduced bunch.</p>\n\n\n\n<p><strong>Dane Cash’s picks: </strong>The profile may not look all that crazy, but stage 19 will be one of the toughest stages to predict in this Vuelta because it’s just so hard to say whether it will come down to a break, a big sprint, or a very reduced sprint. And even if a break does go the distance, will there be any notable fast finishers in the group?</p>\n\n\n\n<p>Given the chances of that specific outcome, riders like Matteo Trentin, Magnus Cort, and Michael Matthews are the favorites – particularly Cort, given his showing so far in this Vuelta. That said, this stage could just as easily go to a solo rider making a well-timed attack. That puts someone like Tom Pidcock into the mix, but it’d be no surprise to see a second-division rider who has never won a WorldTour race get the victory. Or maybe Fabio Jakobsen holds on and wins a sprint. We’ll see!</p>\n\n\n\n<figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/2021-vuelta-profile-stage19.jpeg\" /></figure>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/stage19.jpeg\" /></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/09/preview-what-you-need-to-know-about-stage-19-of-the-vuelta/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"2bedfeb6f37607a62b66a8d04fe8830104a7c677b79483e6606e9ab3dd5fc029","category":"Cycling"}