{"title":"Several supplementary concepts for applied category-theoretical states over an extended Petri net using an example relating to genetic coding: Toward an abstract algebraic formulation of molecular/genetic biology","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302710","date":1717768800000,"content":"<p>by Jitsuki Sawamura, Shigeru Morishita, Jun Ishigooka</p>\r\n\r\nAbstract algebraic concepts such as category are considered cornerstones on which logical consistency relies in any sophisticated study of natural phenomena. However, to the best of our knowledge, in molecular/genetic biology, their application is still severely limited because they capture neither the dynamics nor provide a visual form. The Petri net (PN) has often been used to illustrate visually parallel, asynchronous dynamic events in small data systems. A prototypal hybrid model combining both category theory and extended PNs may instead be indispensable for that purpose. This hybrid model incorporates 1) token-like elements of a group, 2) object-like places of a category, 3) square poles (rather than pentagon poles) that enable unique identifications of single-strand DNA sequences from the shape of its polygonal line, 4) creation/annihilation morphisms that generate/erase tokens, 5) Cartesian products ‘Z<sub>5</sub>×Z<sub>2</sub>×…’ that enable conversions between DNA and RNA sequences, 6) somatic recombinations (VDJ recombinations) for antibodies displayed concretely in category-theoretic form, 7) ‘identity protein Δ’ translated from a triplet of identity bases ‘EEE’ as an advanced concept from our previous display of the canonical central dogma, 8) illustrations of an incidence-matrix-like matrix A that includes operators as coordinates, and 9) basic topics concerning the canonical central dogma being displayed concretely using concepts of conventional category theory such as ‘adjoint’, ‘adjoint functor’, ‘natural transformation’, ‘Yoneda’s lemma’ and ‘Kan extension’. These ideas provide more advanced tools that expand our previous model concerning nucleic-acid-base sequences. Despite the nascent nature of our methodology, our hybrid model has potential in a variety of applications, illustrated using molecular/genetic sequences, in particular providing a simple dynamic/visual representation. With further improvements, this approach may prove effective in reducing the need for large data-storing systems.","author":"Jitsuki Sawamura","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2beea8f7fde1550eaaa75d5ce46ee29d880ae222161d1ea16062e7860d5aa6ce","category":"Interdisciplinary"}