{"title":"Apple ‘looking at’ adding Apple Pay support for cryptocurrency","link":"https://www.macworld.com/article/551151/apple-pay-cryptocurrency-bitcoin-ethereum.html","date":1636551815000,"content":"<div>\n<section><div></div></section><p>As one of the biggest and most influential companies in the world, Apple is usually on board with the latest tech trends. But when it comes to cryptocurrency, the company is taking its time.</p>\n\n\n\n<p>During an interview as part of <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.nytimes.com/live/2021/11/09/business/dealbook-summit#tim-cook-cryptocurrency-apple&amp;xcust=1-1-551151-1-0-0&amp;sref=https://www.macworld.com/feed\">The New York Times’ DealBook Online Summit</a>, Tim Cook offered his thoughts on the digital currency currently <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.coinbase.com/price/bitcoin&amp;xcust=1-1-551151-1-0-0&amp;sref=https://www.macworld.com/feed\">valued at over $60,000</a> per Bitcoin. For one, he’s an investor. He said cryptocurrency is “interesting” and thinks “it’s reasonable to own it as part of a diversified portfolio.”</p>\n\n\n\n<figure><div>\n\n</div></figure><p>However, speaking as a CEO, he said Apple is “looking at” incorporating cryptocurrencies into Apple Pay but doesn’t have “immediate plans” to support the payment. Additionally, he “(isn’t) planning in the immediate future to take crypto for our products as a mean of tender.”</p>\n\n\n\n<p>Adding cryptocurrency as a form of payment withing Apple Pay would be a big move for Apple. While there is some cryptocurrency support Apple Pay, it works through third-party credit cards such as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/coinbase-trade-btc-eth-shib/id886427730&amp;xcust=1-1-551151-1-0-0&amp;sref=https://www.macworld.com/feed\">Coinbase</a>, which converts all cryptocurrency to U.S. dollars first. You can also download third-party apps to buy Bitcoin, Ethereum, or other popular currencies. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.paypal.com/us/digital-wallet/manage-money/crypto&amp;xcust=1-1-551151-1-0-0&amp;sref=https://www.macworld.com/feed\">PayPal</a> also lets users buy one of four types of cryptocurrency in its app.</p>\n\n\n\n<p>However, those solutions are more workarounds than integrations, and are not quite the same as allowing users to buy things with Bitcoin in Apple Pay. Bitcoin or Ethereum support would let users select their crypto account as an option like their Apple Card or other credit card to pay for things at places that accept the digital currency. </p>\n\n\n\n<p>However, Cook definitely left the door open for support. He said cryptocurrency is one of the “things that we are definitely looking at” for Apple Pay and was coy when pressed for specifics. When asked “Like what?” following his comment, Cook laughingly said, “Like I wouldn’t have anything to announce today.”</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2bf0678a9c109c5eb1d2abfa31bf8e7e1078586a18be4ecc5d7f021123c81372","category":"Apple"}