{"title":"Prevalence, Management, and Outcomes of Atrial Fibrillation in Paediatric Patients: Insights from a Tertiary Cardiology Centre","link":"https://www.preprints.org/manuscript/202408.1276/v1","date":1724123591000,"content":"Background: Atrial fibrillation (AF) is increasingly recognised in paediatric patients and presents unique management challenges. We aimed to investigate the prevalence, management strategies, and outcomes of AF in this population. \n\nMethods: This retrospective analysis was conducted at a tertiary paediatric cardiology centre, including patients aged ≤18 years who were diagnosed with AF between January 2015 and December 2023. Demographic details, clinical manifestations, treatments, and outcomes were also analysed. Patients with documented AF episodes were in-cluded. Descriptive statistics were used to assess the treatment efficacy, recurrence, and complications. \n\nResults: The study included 36 patients (mean age, 15 years; 58% male). Of these, 52.8% had acquired heart disease, 16.7% had congenital anomalies, and 16.7% had lone AF. The initial treatment involved electrical cardioversion (53.3%) and pharmacological conversion with amiodarone (46.7%). Over 80% of the patients received rhythm control therapy, and 63.9% were placed on oral anticoagulation, primarily for rheumatic and congenital heart diseases. The success rate of rhythm control was 50% with an AF recurrence rate of 3.8%. Ischaemic stroke was the most common complication (n=3) occurring in patients with underlying heart disease. \n\nConclusion: AF in paediatric patients is predominantly associated with rheumatic and congenital heart diseases, although a notable proportion of patients present with lone AF. Despite the high intervention and antiarrhythmic therapy rates, neurological complications, particularly in those with underlying heart disease, remain a significant concern. These findings highlight the need for further com-prehensive studies to understand better the aetiology, risk factors, and management of paediatric AF.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2bf6032aea4a4f596d2a8a5a6894984a57e22f73781ab08688ba076163912d1d","category":"Interdisciplinary"}