{"title":"Reuters ร่วมมือ Canon สาธิตการยืนยันภาพข่าวจริง เซ็นลายเซ็นทันทีที่บันทึกภาพ ส่งข้อมูลขึ้นบล็อคเชน","link":"https://www.blognone.com/node/135601","date":1694021144000,"content":"<div><div><div><p>สำนักข่าว Reuters ร่วมมือกับ Canon ผู้ผลิตกล้อง ภายใต้กลุ่ม Content Authenticity Initiative (CAI) ที่ส่งเสริมความน่าเชื่อถือของภาพข่าว สาธิตระบบยืนยันภาพถ่ายว่าถ่ายโดยไม่มีการดัดแปลงจริง</p>\n<p>ทาง Canon ใส่กุญแจลับประจำกล้องเข้าไปให้เซ็นลายเซ็นยืนยันภาพ, ตำแหน่ง GPS, และข้อมูล metadata อื่นๆ หลังจากนั้นส่งข้อมูลไปยังฐานข้อมูลของ Reuters พร้อมกับลงทะเบียนการสร้างไฟล์ในบล็อกเชน Filecoin และ Storj</p>\n<p>เมื่อสำนักข่าวได้ภาพมาแล้ว กระบวนการแก้ไขต่างๆ จะถูกบันทึกลงฐานข้อมูลภายในของ Reuters เอง แต่ค่าแฮชยืนยันกระบวนการแก้ไขทั้งหมดจะถูกบันทึกลงบล็อคเชนภายนอก คือ Hedera และเมื่อผู้อ่านข่าวเห็นภาพก็จะสามารถนำภาพไปตรวจสอบได้ว่ามาจาก Reuters จริงหรือไม่</p>\n<p>ระบบนี้ยังมีจุดอ่อนอยู่ คือกระบวนการคำนวณลายเซ็นดิจิทัลนั้นใช้เวลานาน การถ่ายภาพในพื้นที่ข่าวเช่นสงครามในยูเครนนั้นต้องการความเร็ว ขณะที่แก้ไขภาพนั้นทำให้ภาพขาดความเชื่อมโยงกับภาพที่ถ่ายมา ตอนนี้มีทางเพิ่มเติมคือใช้ซอฟต์แวร์ของ FotoWare ไปรันที่ระบบของลูกค้าที่ซื้อภาพไป ทำให้แก้ไขภาพโดยแน่ใจได้ว่าไม่ใช่การดัดแปลงจนผิดจากข้อเท็จจริง</p>\n<p>แนวทางการยืนยันข้อมูลเช่นนี้อาศัยฐานข้อมูลที่ตรวจสอบได้ที่เปิดต่อสาธารณะเพื่อให้คนทั่วไปนำข้อมูลไปตรวจสอบได้ แม้ว่าการใช้งานบล็อคเชนจะได้รับความนิยมสูง เช่น OpenTimestamps ที่ยืนยันการสร้างไฟล์นั้นใช้บล็อคเชนของ Bitcoin เป็นตัวยืนยันเวลา แต่ที่ผ่านมาก็มีคนใช้ฐานข้อมูล Merkel Tree อื่นๆ ทำงานคล้ายกัน เช่น<a href=\"https://docs.planet.ink/data/seal\">โครงการ Seal</a> อาศัยการสร้างโดเมนและขอใบรับรองเข้ารหัสจาก Let’s Encrypt ซึ่งรายการสร้างใบรับรองจะถูกบันทึกเข้าฐานข้อมูล Certification Transparency Log เช่นกัน</p>\n<p>ที่มา - <a href=\"https://www.reutersagency.com/authenticity-poc\">Reuters</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/df0b4540aa48f538e834195ff93dc964.png\" /></p>\n<p>ภาพโดย <a href=\"https://contentauthenticity.org/how-it-works\">Content Authenticity Initiative (CAI)</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/reuters\">Reuters</a></div><div><a href=\"/topics/blockchain\">Blockchain</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2bfa42ec96ae012e83022978090b5802161ea7bfa776d54b5fdabd2346da9183","category":"Thai"}