{"title":"The association of HIV-related stigma and psychosocial factors and HIV treatment outcomes among people living with HIV in the Volta region of Ghana: A mixed-methods study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002994","date":1709215200000,"content":"<p>by Jerry John Nutor, Akua O. Gyamerah, Henry Ofori Duah, David Ayangba Asakitogum, Rachel G. A. Thompson, Robert Kaba Alhassan, Alison Hamilton</p>\r\n\r\nStigma and discrimination have been identified as significant barriers to HIV treatment among people living with HIV (PLWH). HIV stigma affects decision to seek HIV testing and early treatment. Evidence shows that HIV stigma undermines antiretroviral therapy (ART) adherence by affecting the psychological process such as adjusting and coping with social support. In Ghana, stigma toward PLWH occurs in many ways including rejection by their communities and family members, ostracism, and refusal to engage in social interactions such as eating, sharing a bed, or shaking hands. Therefore. we examined PLWH’s experiences with different forms of HIV-related stigma and the impact on HIV treatment outcome in the Volta region of Ghana. We employed a convergent mixed-method approach consisting of a survey with 181 PLWH, four focus group discussions with 24 survey respondents, and in-depth interviews with six providers. We performed independent samples t-test, ANOVA, and chi-square test to test associations in bivariate analysis and analyzed qualitative data using thematic analysis. In all, 49% of survey respondents reported experiencing high internalized stigma, which was associated with high social support and depression (p&lt;0.001). In qualitative interviews, anticipated stigma was the most salient concern of PLWH, followed by internalized and enacted stigma, which all negatively impacted HIV treatment and care. Stigma was experienced on multiple levels and affected psychosocial and treatment outcomes. Findings suggest urgent need for HIV-stigma reduction intervention among PLWH and their family, providers, and community members.","author":"Jerry John Nutor","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"2bfd3e9186662ecbeb14595a3ddd0437693f955152b4e05a7ebc4562de05a819","category":"Environment"}