{"title":"The effects of school-based hygiene intervention programme: Systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308390","date":1728396000000,"content":"<p>by Sophia Rasheeqa Ismail, Ranina Radzi, Puteri Sofia Nadira Megat Kamaruddin, Ezarul Faradianna Lokman, Han Yin Lim, Nusaibah Abdul Rahim, Hui Yin Yow, Daarshini Arumugam, Alex Ngu, Annie Ching Yi Low, Eng Hwa Wong, Sapna Patil, Priya Madhavan, Ruslin Bin Nordin, Esther van der Werf, Nai Ming Lai</p>\r\n\r\nChildren are susceptible to infections due to frequent participation in school group activities and their often-suboptimal hygiene practices. Frequent infections in children affect school attendance, academic performances, and general health. The effectiveness of school-based hygiene-related intervention programmes need to be informed by updated high-quality synthesised evidence. In this systematic review, we searched PubMed and Cochrane CENTRAL for randomised and non-randomised interventional studies that evaluated school-based hygiene-related interventions. We assessed risk-of-bias (Cochrane risk-of-bias 2 tool), performed random-effect meta-analysis (RevMan 5.4) and rated certainty-of-evidence (GRADE). Thirty-nine trials (41 reports), published from 2011 to 2024 from 22 countries were included. Twenty-three studies contributed data for meta-analysis. All school-based interventions were compared with standard curriculum and demonstrated very low to low certainty-of-evidence due to study methodological limitations and imprecision. Hand-body hygiene interventions may improve knowledge, attitudes and practices (SMD 2.30, 95%CI 1.17 to 3.44, 6 studies, 7301 participants), increase handwashing practices (RR 1.75, 95%CI 1.41 to 2.17, 5 studies, 5479 participants), and reduce infection-related absenteeism (RR 0.74, 95%CI 0.66 to 0.83, 5 studies, 1017852 observations). Genital hygiene interventions may improve attitude (SMD 6.53, 95%CI 2.40 to 10.66, 2 studies, 2644 participants) and practices (RR 2.44, 95%CI 1.28 to 4.68, 1 study, 1201 participants). However, intervention effects on oral hygiene appeared mixed, with worsening of the oral hygiene score (SMD 3.12, 95%CI 1.87 to 4.37, 2 studies, 652 participants) but improved dental hygiene (SMD -0.33, 95%CI -0.53 to -0.13, 3 studies, 4824 participants) and dental caries scores (SMD -0.34, 95%CI -0.52 to -0.16, 4 studies, 2352 participants). Limited evidence suggests that interventions targeting hand-body and genital hygiene practices may improve knowledge, practices, and infection-related absenteeism. However, the effects on oral hygiene intervention appeared mixed. Future research should strengthen randomisation and intervention documentation, and evaluate hygiene-related behaviour, academic performances and health outcomes.","author":"Sophia Rasheeqa Ismail","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2bfe1192ad0cdb4397265143f1806c4e1702b55c0a5d10bd2f46608db5e80b94","category":"Interdisciplinary"}