{"title":"Influence of differing levels of concentrate on circulating cytokine concentrations in beef heifers","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae089/7686465?rss=1","date":1717286400000,"content":"<span><div>Abstract</div>Components of the immune system (e.g., cytokines and chemokines) can influence reproductive efficiency. Characterizing the influence nutrition has on shifts in circulating cytokine concentrations will allow for a better understanding of reproductive efficiency in beef cattle. This study aimed to determine the effect of diet composition on circulating cytokine concentrations of beef heifers. Using a 3 × 3 Latin square design, pubertal <span>Bos taurus</span>-influenced rumen-cannulated heifers (<span>n</span> = 15) were fed a diet based on different concentrate percentages. The treatment period consisted of 28-d feeding periods with a washout interval of 21 d. Treatment groups were fed 100% grass hay (high forage; HF), 60% grass hay with 40% corn-based concentrate (intermediate; INT), and 25% grass hay with 75% corn-based concentrate (high grain; HG). Heifers were offered 2% of their body weight in feed daily. Blood was collected on days 0 and 28 of the treatment period for cytokine analysis. Plasma cytokine concentrations were quantified using RayBiotech Quantibody Bovine Cytokine Array Q1 kit according to manufacturer instructions. Concentrations of interferon gamma-induced protein 10 (IP10) linearly decreased with an increased concentrate diet (<span>P</span> = 0.037). Concentrations of IP10 differed for heifers consuming HF diet vs. HG diet (3,069.52 vs. 1,001.84 ± 669.01 pg/mL, respectively) and heifers consuming INT diet vs. HG diet (2,886.77 vs. 1,001.84 ± 669.01 pg/mL, respectively); however, there were no significant differences in IP10 concentrations between HF and INT heifers. There was a tendency for interleukin-1 family member 5 (IL1F5) concentrations to be lower for heifers consuming the HG diet compared to INT diet (<span>P</span> = 0.08). Results suggest that heifers consuming a high-concentrate diet have lower concentrations of IP10 and IL1F5. Additional research is necessary to better understand the dietary influence on the immune system in developing heifers.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"2c0079554711fde335900fa1d133116887a6ac99e9000923e3d5d1b82ff8a0a8","category":"Environment"}