{"title":"PSX-11 Behavior of Kentucky beef producers towards controlling internal parasites","link":"https://academic.oup.com/jas/article/102/Supplement_3/603/7757859?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Internal parasites can reduce production efficiency in livestock grazing systems. Increased concern has been expressed regarding the potential loss of efficacy of available products currently available to livestock managers to control internal parasites. A survey was conducted during the spring of 2023 of Kentucky beef producers participating in a Fecal Egg Count Reduction Test (FECRT) study to gain insight related to their behavior toward managing internal parasites. A total of 70 individuals completed or partially completed the survey instrument. Similar numbers of operations had a single calving season of either spring (35.8%) or fall (37.3%) with these being more prominent than having both spring and fall calving seasons or a year-round calving season. When asked if they had ever performed a FECRT within their herd previously, 96.9% of respondents indicated they had not. Administering an anthelmintic twice annually was reported most often at 69.2%, while 16.9% indicated once per year and more than twice annually being reported by only 6.2%. Sixty percent of beef cattle managers indicated that they rotated products. When asked about the frequency of product rotation, 33.9% indicated they rotated products at each application while 25.8% switched products annually with another 21% never switching products. It is unclear as to why these two questions yielded slightly different outcomes. As all anthelmintics dosage is based on body weight (BW), determination of dosage was asked. More than 75% estimated BW for dosage while 15.4% used a scale to set the dosage for each animal and 7.7% used a scale to obtain an average BW to set the dosage for all animals. Route of administration of product most frequently utilized was pour-on at 66.3% either alone or in combination with another product. Oral drench (17.5%) and injectable (13.8%) were the next most common routes of administration with a single report of product being provided in the feed. This information provides Extension educators with insight regarding beef cattle managers’ behaviors towards anthelmintic use and aid in developing educational programs focused on controlling internal parasites.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2c019b6955e0b3fa00ff2f2b9d04c7751c889baf34f0184da61508ddd1b3676a","category":"Environment"}