{"title":"Multiscale Processes Drive Formation of Logjam Habitats and Use by Juvenile Chinook Salmon Across a Boreal Stream Network in Alaska","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4387?af=R","date":1728546338000,"content":"<h2>ABSTRACT</h2>\n<p>Boreal forest streams are characterized by large volumes of instream wood, yet the relationship between logjams and Pacific salmon productivity remains underqualified. We located logjams (<i>n</i> = 427) within the distribution of Chinook salmon (<i>Oncorhynchus tshawytscha</i>) in the Chena River, Alaska (Yukon River tributary) and measured dimensions, classified formative process, and snorkel-sampled a subset (<i>n</i> = 189) of logjams to detect and count juvenile salmon relative to multiscale variables and a dam. Logjam size increased downstream, whereas logjam density and large wood recruits declined (upstream = 6 logjams/km, 33 recruits/km; downstream = 0.3 logjams/km, 6 recruits/km), particularly below a dam that reduced downstream wood transport and log-trapping locations (i.e., bars). Juvenile salmon occupied 68% of logjams; mid-network logjams had the highest densities (mean = 0.85 fish/m<sup>2</sup>). We modeled juvenile salmon counts with logjam-, stream reach-, and neighborhood-scale (&gt; 1 km) predictors. Covariates that best predicted juvenile salmon densities included bankfull flow and stream power at reach scales in addition to growth potential, spawning habitat quality, and logjam area within 1 km of the focal logjam at neighborhood-scales. Multiscale perspectives that link landscape characteristics, wood dynamics, and instream modifications with juvenile salmon production will be important to facilitate conservation and management of boreal streams.</p>","author":"Charles N. Cathcart, \nJeffrey A. Falke, \nJimmy Fox, \nRobert Henszey, \nKatherine Lininger","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"2c08cc0c633dc01c273294dc90ae2907db435f793ef8d76ab6b4062557f8af28","category":"Environment"}