{"title":"It’s the battle of the alien symbiotes in Venom: Let There Be Carnage trailer","link":"https://arstechnica.com/?p=1763740","date":1620672512000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Tom Hardy returns to the big screen as the lethal protector Venom, taking on Woody Harrelson's villainous Cletus Kasady/Carnage, in Sony's forthcoming film <em>Venom: Let There Be Carnage</em>. </p></div>\n<p>Tom Hardy (<em>Mad Max: Fury Road</em>) returns as intrepid reporter Eddie Brock, infected with a parasitic alien symbiote that gives him super powers, in <a href=\"https://en.wikipedia.org/wiki/Venom:_Let_There_Be_Carnage\"><em>Venom: There Will be Carnage.</em></a> Directed by motion-capture icon Andy Serkis, it's the sequel to 2018's box-office smash, <a href=\"https://arstechnica.com/gaming/2018/10/venom-film-review-stupid-but-still-good-enough-to-bite-your-head-off/\"><em>Venom</em></a>. After being delayed for nearly a year due to the ongoing pandemic, Sony just dropped the official trailer, in which Brock/Venom must battle serial killer Cletus Kasady (Woody Harrelson, <em>Zombieland</em>), infected with another alien symbiote dubbed Carnage.</p>\n<p>(<strong>Some spoilers for first film below.)</strong></p>\n<p>A Venom film was in development at New Line Cinema back in 1997, although the project didn't really get off the ground until Sony acquired the rights to the character, as well as Spider-Man. Sony initially planned for <a href=\"https://en.wikipedia.org/wiki/Venom_(Marvel_Comics_character)\">Venom</a> and Spider-Man to inhabit a shared universe, given their history in the comics. (Spider-Man was Venom's first host, before moving on to Brock, and the character gradually evolved from villain to more of an antihero.) The disappointing box office performance of 2014's <em><a href=\"https://en.wikipedia.org/wiki/The_Amazing_Spider-Man_2\">The Amazing Spider-Man 2</a></em> changed those plans, and <em>Venom</em> was re-conceived as a standalone film, with Tom Hardy signing on as the star and <em>Zombieland</em> director Ruben Fleischer agreeing to direct.</p></div><p><a href=\"https://arstechnica.com/?p=1763740#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763740&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2c08261383d9af38281f1f29a3f63fe8aed200c2d1c23e0541dac5e3de0756dd","category":"Tech"}