{"title":"Apple Vision Pro Onboarding Videos Unearthed in visionOS Beta 6","link":"https://www.macrumors.com/2023/11/15/apple-vision-pro-onboarding-videos-visionos-beta-6/","date":1700046598000,"content":"Apple on Tuesday seeded a sixth beta of <a href=\"https://www.macrumors.com/roundup/visionos/\">visionOS</a>, the software designed to run on the Vision Pro headset, and it includes two new tutorial videos shown to the user during the setup process.   \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/apple-vision-pro-eye.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nThe first 36-second onboarding video, shared by <a href=\"https://x.com/M1Astra/status/1724506943425757367?s=20\">@M1Astra</a>, is called \"Input Training\" and demonstrates how the user interacts with ‌visionOS‌ by looking at UI elements and selecting them using a double-tap gesture. The narrator says the following:\r<br />\n<blockquote>Your eyes and hands are how you navigate Apple Vision Pro. You browse the system by looking, and it responds to your eyes. Simply look at an element and tap your fingers together to select it. It's like a click on your Mac. To scroll, pinch your fingers together, and gently flick. You can keep your hands where they're comfortable, such as resting on your lap.</blockquote><div><blockquote><p>New onboarding video added in visionOS beta 6!<br /><br />\"Input Training\" <a href=\"https://t.co/ThKGBL4FbA\">pic.twitter.com/ThKGBL4FbA</a></p>— M1 (@M1Astra) <a href=\"https://twitter.com/M1Astra/status/1724506943425757367?ref_src=twsrc%5Etfw\">November 14, 2023</a></blockquote> </div>\r<br />\nWith the <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> headset, the built-in cameras create a customized \"Persona\" that resembles the user, and this Persona is used in video chat apps like <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>. In a second, 50-second video also shared by <a href=\"https://x.com/M1Astra/status/1724539857752519028?s=20\">@M1Astra</a>, \"Persona Enrollment,\" Apple demonstrates how Personas are set up by using the EyeSight display to guide the user: \r<br />\n<blockquote>To set up your Persona, you'll remove Apple Vision Pro to capture your appearance. Take your time getting ready, and ensure nothing is covering your face. To start capturing, hold Apple Vision Pro at eye level. Keep your arms and shoulders relaxed. Then, follow the instructions. \r<br />\n\r<br />\nTurn your head to the right, to the left, and tilt up, and down. Then you'll capture your facial expressions. Smile with your mouth closed, smile showing your teeth, raise your eyebrows, and close your eyes. When you're done, put Apple Vision Pro back on to see your Persona.</blockquote><div><blockquote><p>New video tutorial showing Persona Enrollment for Apple Vision Pro added in visionOS beta 6!<br /><br />The enrollment uses the EyeSight display to guide the user. <a href=\"https://t.co/cGfsdTuIaY\">pic.twitter.com/cGfsdTuIaY</a></p>— M1 (@M1Astra) <a href=\"https://twitter.com/M1Astra/status/1724539857752519028?ref_src=twsrc%5Etfw\">November 14, 2023</a></blockquote> </div>\r<br />\nAs we <a href=\"https://www.macrumors.com/2023/10/05/apple-vision-pro-persona-glasses/\">previously reported</a>, the 3D capture process requires users to remove anything that covers the face, such as glasses. There does not appear to be any kind of secondary scanning mechanism to separately capture a user's glasses, and instead, Apple will allow users to \"Select Eyewear\" from a variety of options.\r<br />\n\r<br />\nPersonas are one aspect of ‌‌visionOS‌‌ that Apple is working on perfecting before the launch of the Vision Pro headset. In September, Apple <a href=\"https://www.macrumors.com/2023/09/14/apple-vision-pro-developer-survey/\">began surveying developers</a> who have the Vision Pro about their Personas, soliciting opinions on facial expressions, appearance matching, and more.\r<br />\n\r<br />\nThe Vision Pro headset is set to launch in early 2024 in the United States, and it will be priced at $3,500. The headset will likely be <a href=\"https://www.macrumors.com/2023/07/07/apple-vision-pro-launch-uk-canada-end-of-2024/\">released in the UK and Canada later the same year</a>.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a>, <a href=\"https://www.macrumors.com/roundup/visionos/\">visionOS</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/15/apple-vision-pro-onboarding-videos-visionos-beta-6/\">Apple Vision Pro Onboarding Videos Unearthed in visionOS Beta 6</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-onboarding-videos-unearthed-in-visionos-beta-6.2411019/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2c12462ce08f99ece77894a474e690b2b4d225419d6942680aaf7e0509f29e88","category":"Apple"}