{"title":"The racing debut of the Monte Zoncolan","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-racing-debut-of-the-monte-zoncolan","date":1622123604000,"content":"\n      <p>Last weekend, the Zoncolan was featured for a seventh time in Giro d’Italia history — albeit over the ‘easier’ side of the imposing Carnic Alpine mountain. But, of course, there is no easy way up the Zoncolan, which is why the climb garners so much intrigue and excitement.</p>\n<p><span>The last time the men’s race saw the climb was in 2018 when Chris Froome, elbows akimbo, went on the attack to hold off a pink-jersey-wearing Simon Yates and take the stage victory that would later set him up to win overall. Two months later, in stage nine of the Giro Rosa, Annemiek van Vleuten — already leading the race — attacked Ashleigh Moolman Pasio to take the day and secure her hold on the maglia rosa. Van Vleuten eventually won the race overall by a margin of more than four minutes. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide\">Related – Women's WorldTour calendar 2021</a></strong></em></p>\n<p><span>The Giro Rosa has come up against criticism for not providing adequate coverage of what is now the longest and most challenging women’s stage race on the calendar (indeed, the race was demoted from Women’s WorldTour status last year for failing to adhere to the mandatory 45 minutes of live coverage). Fortunately, in 2018, the broadcaster PMG provided a livestream of the action. And there was plenty of it: storms and rain added to the drama early on in the race before the peloton reached the climb and Moolman Pasio attacked, taking van Vleuten with her. </span></p>\n<p><span>That year, van Vleuten was on her usual supreme form, eventually taking the win by 40 seconds and adding another minute to increase her hold on GC to 3:35 over Moolman Pasio. Two months later she went on to win the Boels Ladies Tour and the World Championships ITT. </span></p>\n<div></div>\n<p><span>However, while that stage in 2018 was the first time the Giro Rosa has tackled the harder Ovaro side of the mountain, it was not, in fact, the first time that the race had visited the slopes of the Zoncolan. 21 years before, in 1997 — when women’s stage racing was at its peak — stage 10 of the Giro d’Italia Femminile saw the peloton ascend the climb’s limestone slopes — a full six years before the men would first race up it in 2003.</span></p>\n<p><span>The women took on the very same side we saw last Saturday, one that is supposedly more forgiving yet still averages 9% over 13km with the final 3km never dipping below 11%.  On that day, the stage was won solo by 23-year-old Italian rider Fabiana Luperini on her way to taking her third consecutive Giro Rosa title out of her eventual record tally of five.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Fabiana_Luperini_1996-2_1024x1024.jpg?v=1622122598\" /></span></p>\n\n<p><em><span>Fabiana Luperini in the Giro Rosa leader's jersey in 1997 (Photo: OffSide/ L'Equipe)</span></em></p>\n<p><span>Like van Vleuten, Luperini was a dominant force in women’s racing at the time. For every Giro Rosa win, she also took the overall at the Grande Boucle Féminine Internationale (the now-defunct women’s Tour de France equivalent) in the same season. The Grande Boucle was usually between 12 and 13 stages long and included some of the hardest parcours in the sport. In fact, the Zoncolan wouldn’t have been such a shock to the system for Luperini and her colleagues — who were accustomed to such long climbs in both races at the time — as it might have been for some of the riders in 2018. </span></p>\n<p><span>Luperini had stiff competition, too, including Lithuanian rider Edita Pucinskaite who would later go on to win the world title in 1999 and Canadian Linda Jackson who had won the Tour de l'Aude Cycliste Féminin earlier that year and then took second at the Giro Rosa. </span></p>\n<p><span>Like the 1997 race before it, the 2018 Giro Rosa route was one of the most challenging in recent years. As well as the Zoncolan, the race featured an individual time trial up a 15km climb as well as a further two summit finishes over the 10-days. The long mountain passes and challenging, climber’s parcours brought the Giro Rosa closer to mirroring the gritty racing that characterises the Giro d’Italia. </span></p>\n<p><span>The 2021 Giro Rosa route has yet to be revealed, but a return to the type of parcours seen in the heyday of 80s and 90s stage racing would be a welcome step for fans and riders. Given the collective strength of the current women’s peloton, watching the top tier riders duke it out at another Giro Rosa finish on the mighty Monte Zoncolan would fulfil the mythical climb’s promise of drama. </span></p>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2c146299d3a4f049f90d312e415b5c19a54ea3cbaa4e6769dfdd9328178f9eac","category":"Cycling"}