{"title":"The Mac event is over but the ‘Scary’ releases will keep coming in November","link":"https://www.macworld.com/article/2118919/apple-november-2023-releases-m3-macs-ios-macos-apple-tv.html","date":1698837300000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>After a fairly sedate October, November promises to be a pretty exciting month for Apple releases. First, we’re getting new Macs based on the <a href=\"https://www.macworld.com/article/2120691/m3-m3-pro-and-m3-max-specs-features-cpu-gpu.html\">M3 processor line</a>. But even if you’re not in the market for a new Mac, the iOS 17.2 and macOS Sonoma 14.2 updates should land in November and bring several welcome improvements and features. And as always, there’s also more content coming from Apple TV+ and Apple Arcade. Here’s what we expect from Apple in November.</p>\n\n\n\n<h2>New hardware</h2>\n\n\n\n<p>On October 30, Apple held an event to announce its <a href=\"https://www.macworld.com/article/2120984/macbook-pro-lineup-with-m3-pro-max-processors-memory-specs.html\">M3 chip line</a> and the first products to be upgraded with them: the <a href=\"https://www.macworld.com/article/2120984/macbook-pro-lineup-with-m3-pro-max-processors-memory-specs.html\">14-inch and 16-inch MacBook Pro</a> and <a href=\"https://www.macworld.com/article/1484743/24-inch-imac-release-date-specs-m2-m3-processor-price.html\">iMac</a>.</p>\n\n\n\n<p><strong>14-inch MacBook Pro:</strong> Now available with a base M3 starting at $1,599 and a new Space Black color (only available if you get an M3 Pro or M3 Max, unfortunately). They’re on sale now and most configurations start shipping on November 7.</p>\n\n\n\n<p><strong>16-inch MacBook Pro:</strong> You can’t get a base M3 in the 16-inch MacBook Pro, only M3 Pro and M3 Max. Prices start at $2,499, available for preorder now with most configurations shipping on November 7. Some M3 Max models will ship starting a few days later.</p>\n\n\n\n<p><strong>iMac: </strong>The 24-inch iMac has been languishing with an M1 for ages, but finally gets an M3 upgrade. It starts at $1,299 and ships starting November 7.</p>\n\n\n\n<h2>Rumored new hardware</h2>\n\n\n\n<p>We didn’t expect any updates to the Mac Studio or Mac Pro, as the M3 Ultra has not yet been announced (it will likely come in the spring or summer of 2024). Oddly, the Mac mini didn’t get its M3 upgrade yet either.</p>\n\n\n\n<p>Apple is likely done releasing new products in 2023, but you never know if a minor iPad mini or iPad Air makes an appearance.</p>\n\n\n\n<h2>Apps and software updates</h2>\n\n\n\n<p>While iOS 17.1 and macOS 14.1 delivered some nice polish and a bunch of bug fixes, the next release will deliver more new features. The <a href=\"https://www.macworld.com/article/2117707/ios-17-2-beta-is-out-now-and-includes-the-journal-app.html\">iOS 17.2</a> and <a href=\"https://www.macworld.com/article/2117732/apple-releases-macos-sonoma-14-2-beta.html\">macOS 14.2</a> betas are out now, with a release expected in November.</p>\n\n\n\n<p><strong>iOS 17.2:</strong> Adds the Journal app, collaborative playlists in Apple Music, a new Favorite Songs playlist in Apple Music, the ability to map Translate to the Action button on iPhone 15 Pro, new Weather and Clock widgets, and more.</p>\n\n\n\n<p>‌<strong>tvOS 17.2:</strong> The TV app gets a sidebar for categories, similar to the interface for lots of other streaming apps.</p>\n\n\n\n<p><strong>iPadOS 17.2:</strong> You get the same new features as iOS, except of course for the Action button (which no iPad has).</p>\n\n\n\n<p><strong>macOS 14.2:</strong> This will bring iMessage Contact Verification and the Apple Music features, but the Journal app won’t be available on Mac yet.</p>\n\n\n\n<h2>Services</h2>\n\n\n\n<h3>Apple TV+</h3>\n\n\n\n<p>Here are the shows, series, and movies we expect to release on Apple TV+ in TK. If you want to know what’s coming later, check our <a href=\"https://www.macworld.com/article/340717/apple-tv-plus-upcoming-shows-future-moves-series-release-dates-film-television.html\">full guide to upcoming Apple TV+ content</a>.</p>\n\n\n\n<p><strong>The Buccaneers:</strong> An eight-episode period drama about a group of fun-loving young American girls who explode into the tightly corseted London season of the 1870s, kicking off a culture clash. Sent to secure husbands and titles, the buccaneers’ hearts are set on much more than that, and saying “I do” is just the beginning… <strong>November 8</strong></p>\n\n\n\n<p><strong>For all Mankind (season 4): </strong>Rocketing into the new millennium in the eight years since season three, Happy Valley has rapidly expanded its footprint on Mars by turning former foes into partners. Now 2003, the focus of the space program has turned to the capture and mining of extremely valuable, mineral-rich asteroids that could change the future of both Earth and Mars. <strong>November 10</strong></p>\n\n\n\n<p><strong>Monarch: Legacy of Monsters:</strong> A live-action series in partnership with production company Legendary, taking place in the Monsterverse. Following the thunderous battle between Godzilla and the Titans that leveled San Francisco and the shocking new reality that monsters are real, the series explores one family’s journey to uncover its buried secrets and a legacy linking them to the secret organization known as Monarch. <strong>November 17</strong></p>\n\n\n\n<p><strong>The Velveteen Rabbitt:</strong> Based on the treasured, classic children’s book by Margery Williams, “The Velveteen Rabbit” celebrates the magic of unconditional love. When 7-year-old William receives a new favorite toy for Christmas, he discovers a lifelong friend and unlocks a world of magic. <strong>November 22</strong></p>\n\n\n\n<p><strong>Hannah Waddingham: Home for Christmas:</strong> Ring in the holidays with Emmy-winning star Hannah Waddingham as she welcomes special guests for a musical extravaganza at the London Coliseum. <strong>November 22</strong></p>\n\n\n\n<p><strong>Slow Horses (season 3):</strong> In season three, a romantic liaison in Istanbul threatens to expose a buried MI5 secret in London. When Jackson Lamb and his team of misfits are dragged into the fight, they find themselves caught in a conspiracy that threatens the future not just of Slough House but of MI5 itself. <strong>November 29</strong></p>\n\n\n\n<p>It’s also possible that Apple will release Martin Scorcese’s <strong>Killers of the Flower Moon</strong> on Apple TV+ sometime this month following its short stint in theaters.</p>\n\n\n\n<h3>Apple Arcade</h3>\n\n\n\n<p>Apple releases new games to Apple Arcade on Fridays, but not every Friday is marked by a new game or significant update. Check our <a href=\"https://www.macworld.com/article/232599/apple-arcade-faq-list-of-games-price-compatibility-coming-soon.html\">Apple Arcade FAQ</a> for a full list of Apple Arcade games and more details on the service. Some games are released with no forewarning, but you’ll often see several projects listed in the Coming Soon section.</p>\n\n\n\n<p>The games for November are not yet listed in the Coming Soon section, but we’ll update this as soon as they are.</p>\n\nApple Inc, iOS, Mac, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2c189781577bf9aeb10f6fb3a871ce132c4e250d9cb6869f796131bb176664de","category":"Apple"}