{"title":"Why the iPhones 15 Pro Feel So Much Lighter","link":"https://leancrew.com/all-this/2023/09/iphone-15-pro-facts-and-estimates/","date":1694892694000,"content":"\n<p>Dr. Drang:</p>\n\n<blockquote>\n  <p>Finally, we come to Jason Snell’s surprise at how light the 15 Pro\nseemed when he played with it in the hands-on area. He mentioned\nthis not only in his <a href=\"https://www.macworld.com/article/2065050/iphone-15-pro-apple-watch-series-9-ultra-2-hands-on.html\">Macworld article</a>, but also in <a href=\"https://www.relay.fm/upgrade/476\">the\npost-keynote episode of Upgrade</a>. You wouldn’t expect a\nchange from 206 g for the 14 Pro to 187 g for the 15 Pro would be\nthat noticeable, but Greg Joswiak mentioned it in the keynote and\nJason confirmed it. How can that be?</p>\n\n<p>One answer is that people are just more sensitive than we give\nthem credit for being. A 9–10% drop in weight may seem like a\nsmall amount to our brains but a large amount to our hands. But\nbecause it allowed me to do some simple calculations, I decided to\nlook into another possibility.</p>\n\n<p>Your ability to manipulate a phone is based primarily on its mass,\nbut also on its <a href=\"https://en.wikipedia.org/wiki/Moment_of_inertia\">moment of inertia</a>. And since the reduction\nin mass when switching from stainless steel to titanium is\noccurring almost entirely at the perimeter of the phone, the\nmoment of inertia should be reduced more than if the mass were\nreduced uniformly.</p>\n</blockquote>\n\n<p>Drang, of course, shows his work. There’s no doubt in my mind that there’s something to this: the new iPhones Pro feel even lighter than the weight reduction alone would suggest.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/09/16/iphone-15-pro-moment-of-inertia\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"2c193e31fa8da2cf7398bd2f0a1383afe297ebe39f70a16f8bc7d63fd60df5c6","category":"Tech"}