{"title":"ตรวจสุขภาพความปลอดภัยระบบไอทีด้วย Microsoft Defender for Cloud","link":"https://www.blognone.com/node/133155","date":1680147000000,"content":"<div><div><div><p>ภัยไซเบอร์ทุกวันนี้คนร้ายสามารถหาจุดที่อ่อนแอที่สุดแล้วโจมตีไม่ว่าส่วนที่อ่อนแอนั้นจะเป็นส่วนที่เล็กน้อยเพียงใดก็ตาม แต่โครงสร้างไอทีที่ใหญ่ขึ้นเรื่อยๆ ในทุกวันนี้ องค์กรมักใช้คลาวด์จากผู้ให้บริการหลายราย รวมถึงมีเซิร์ฟเวอร์อยู่ในศูนย์ข้อมูลขององค์กรเอง การดูแลว่าระบบใดมีความผิดพลาดในจุดใด เช่น การเปิดพอร์ตเกินความจำเป็น หรือมีการคอนฟิกที่ผิดหลักความปลอดภัยบางประการกลายเป็นเรื่องยากที่จะดูแลได้ทั่วถึง เซิร์ฟเวอร์สักตัวอาจจะคอนฟิกผิดพลาด ไม่ทำตามหลักความปลอดภัยที่ดี หรือใช้ซอฟต์แวร์เก่าจนเกิดความเสี่ยงกับระบบโดยรวม โครงสร้างไอทีขององค์กรเองกระจายตัวมากขึ้น ทั้งที่อยู่บนคลาวด์หลายราย เช่น Microsoft Azure, AWS, GCP หรือคลาวด์ผู้ให้บริการคลาวด์ในประเทศอย่าง AIS Cloud X ตลอดจนคลาวด์ภายในขององค์กรเอง</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/ILTVZ6N.jpg\" /></p>\n<p>ช่องโหว่หรือการโจมตีอาจจะเกิดได้หลายทาง ตั้งแต่การคอนฟิกผิดพลาด เผลอเปิดสตอเรจออกอินเทอร์เน็ตโดยไม่ตั้งใจ หรือจะเป็นการใช้งานโดยขาดการบำรุงรักษา ทำให้มีซอฟต์แวร์ที่มีช่องโหว่อยู่ในระบบ</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/2Jppg6H.png\" /></p>\n<p><strong>Microsoft Defender for Cloud</strong> <strong>บริการดูแลความปลอดภัยไอทีครบวงจร</strong></p>\n<p>Microsoft Defender for Cloud เป็นแพลตฟอร์มดูแลความปลอดภัยระบบไอทีบนคลาวด์ที่ครอบคลุมตลอดอายุการใช้งานของบริการไอทีในองค์กร โดยแบ่งออกเป็นบริการ 3 ส่วน  ได้แก่</p>\n<ul>\n<li>DevSecOps: ดูแลการพัฒนา ตั้งแต่ระดับโค้ด และ pipeline ในการพัฒนาซอฟต์แวร์</li>\n<li>cloud security posture management (CSPM): ดูแลโครงสร้างและแนะนำถึงแนวทางการป้องกันการโจมตีที่อาจจะเกิดขึ้นในอนาคต</li>\n<li>cloud workload protection platform (CWPP): ระบบดูแลความปลอดภัยของ workload เฉพาะทาง  เช่น  เซิร์ฟเวอร์, คอนเทนเนอร์, สตอเรจ, และฐานข้อมูล</li>\n</ul>\n<p>สำหรับฝ่ายไอทีที่ต้องดูแลระบบขนาดใหญ่และซับซ้อน รวมถึงการดูแลให้ผ่านมาตรฐานความปลอดภัยต่างๆ แล้ว CSPM จะเป็นเครื่องมือที่ช่วยดูแลให้ระบบไอทีมีความแข็งแกร่งขึ้นได้อย่างเป็นระบบ</p>\n<p><strong>ดูแลโครงสร้างไอทีให้ปลอดภัยอย่างต่อเนื่องและทั่วถึง</strong></p>\n<p>การใช้งานคลาวด์นั้นลดภาระการดูแลให้องค์กรได้มากเนื่องจากความรับผิดชอบด้านความปลอดภัยหลายส่วนนั้นผู้ให้บริการคลาวด์รับผิดชอบแทนที่องค์กรให้ อย่างไรก็ดีองค์กรผู้ใช้โครงสร้างบนคลาวด์เองก็ยังมีความรับผิดชอบของตัวเองอยู่ ผู้ให้บริการคลาวด์ไม่สามารถเข้ามาแก้ไขหากผู้ใช้ยืนยันใช้ซอฟต์แวร์ที่ไม่อัพเดต หรือเปิดบริการที่ไม่ได้เข้ารหัสอย่าง FTP เมื่อคอนฟิกแล้ว คลาวด์ทุกรายก็จะให้บริการตามที่ผู้ใช้ต้องการแม้จะมีความเสี่ยง หลายครั้งฝ่ายไอทีอาจจะดูแลระบบเป็นอย่างดีแต่แอปพลิเคชันใหม่อาจจะมีส่วนที่ไม่ปลอดภัย มีการเปิดพอร์ตอันตรายโดยไม่มีใครรู้ตัวจนเวลาผ่านไปนาน</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/JeS2z2n.png\" /></p>\n<p>Defender CSPM เข้ามาช่วยแนะนำการใช้งาน ดูแลโครงสร้างทั้งระบบเพื่อให้ฝ่ายไอทีมองเห็นว่าสุขภาพระบบไอทีโดยรวมเป็นอย่างไร  มีข้อบกพร่องส่วนใดต้องรีบเข้าไปจัดการแก้ไข โดยทั่วไปแล้วหากองค์กรมีระบบไอทีขนาดใหญ่ มีเซิร์ฟเวอร์นับร้อยหรือนับพันเครื่อง ผู้ดูแลอาจจะเจอปัญหาที่สแกนความปลอดภัยออกมาแล้วเจอรายงานปัญหาเล็กๆ น้อยๆ จนเต็มไปหมด ไม่สามารถจัดลำดับควาามสำคัญได้อย่างเหมาะสม</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/uvV2L5A.png\" /></p>\n<p>CSPM แจ้งปัญหาและความสำคัญให้กับผู้ใช้ด้วยระบบให้คะแนน หรือ Secure Score ที่เรียงตามลำดับความสำคัญของการปรับปรุงความปลอดภัยแบบต่างๆ ไมโครซอฟท์จะแสดงคำแนะนำให้ทำอะไรบ้างเพื่อแก้ไขความเสี่ยงแต่ละข้อ และความเสี่ยงของแต่ละข้อนั้นกระทบกับทรัพยากรใดในระบบไอทีขององค์กรบ้าง โดยฟีเจอร์ Secure Score นี้อยู่ในแพ็กเกจเบื้องต้นที่ใช้งานได้โดยไม่มีค่าใช้จ่าย</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/lEdLOoF.png\" /></p>\n<p>สำหรับองค์กรที่ต้องการดูแลความเสี่ยงต่างๆ มากขึ้น ไมโครซอฟท์ยังมีฟีเจอร์ Regulatory Compliance ช่วยจัดคำแนะนำการแก้ไขความเสี่ยงต่างๆ เข้ากับมาตรฐานความปลอดภัยที่ได้รับความเชื่อถือสูงๆ เช่น SOC TSP, PCI DSS ตลอดจนมาตรฐานอื่นๆ อีกนับสิบรายการ ทำให้องค์กรที่กำลังต้องการปรับปรุงระบบไอทีให้ผ่านมาตรฐานเหล่านี้ สามารถดูจุดที่ยังไม่เป็นไปตามมาตรฐานและแก้ไขตามคำแนะนำได้ทันท่วงที</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/hm8nOxi.png\" /></p>\n<p>การวิเคราะห์เส้นทางการโจมตีที่มีความเสี่ยงสูง ทำให้ผู้ดูแลระบบสามารถโฟกัสกับการแก้ปัญหาส่วนที่มีความเสี่ยงสูงได้อย่างแม่นยำ เช่น เซิร์ฟเวอร์ที่มีสิทธิระดับสูง หรือระบบฐานข้อมูลที่มีข้อมูลสำคัญกลับเปิดรับการเชื่อมต่อจากอินเทอร์เน็ตโดยตรง ฟีเจอร์ Attack path analysis ของ CSPM ก็สามารถวิเคราะห์ความเสี่ยงเหล่านี้ออกมาให้ผู้ดูแลเห็นภาพได้ทันที</p>\n<p><strong>ดูแลครบทุกคลาวด์และในศูนย์ข้อมูล</strong></p>\n<p>บริการตรวจสอบความปลอดภัยในคลาวด์เองไม่ใช่เรื่องใหม่นัก ผู้ให้บริการรายใหญ่มักมีบริการแบบเดียวกันเพื่อช่วยให้ลูกค้าสามารถใช้งานคลาวด์ได้อย่างปลอดภัยยิ่งๆ ขึ้น แต่บริการ Microsoft Defender for Cloud นั้นขยายขอบเขตออกไปด้วยการรองรับการดูแลความปลอดภัย ได้บน AWS, GCP, และระบบต่างๆ บนศูนย์ข้อมูลขององค์กรเองผ่านทาง Azure Arc</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/WdyEWkf.png\" /></p>\n<p>โดยการทำงานของ Microsoft Defender for Cloud ถือเป็นส่วนหนึ่งของการทำ Security Operations ที่สามารถทำงานได้ครบทั้งระบบไอที หน้าจอ dashboard เดียวสามารถมองเห็นสุขภาพโดยรวมของโครงสร้างทั้งหมด</p>\n<p><strong>AIS Business</strong> <strong>ที่ปรึกษาที่วางใจได้สำหรับผู้สนใจ</strong> <strong>Microsoft Defender for Cloud</strong></p>\n<p>AIS Business เป็นผู้ให้บริการไอทีที่ทำงานร่วมกับไมโครซอฟท์อย่างใกล้ชิด ทั้งการให้บริการตั้งแต่การจัดซื้อบริการของ Microsoft Azure ผ่านทาง AIS Business เพื่อให้องค์กรสามาถจัดการภาษีและบัญชีได้ง่ายขึ้น  ย้ายระบบไอทีขึ้นมาอยู่กับ AIS Cloud X ที่ทำงานร่วมกับบริการต่างๆ ของ Azure ได้ใกล้เคียงกับการใช้งานบนคลาวด์เต็มรูปแบบแต่ข้อมูลยังอยู่ในประเทศ หรือจะเป็นการให้คำปรึกษาช่วยเหลือองค์กรที่ต้องการนำ Microsoft Defender for Cloud มาดูแลความปลอดภัยของระบบไอทีโดยรวมทั้งองค์กร</p>\n<p>AIS Business พร้อมให้บริการ Microsoft Azure สนใจปรึกษา หรือศึกษาข้อมูลเพิ่มเติม ได้ที่  <a href=\"https://business.ais.co.th/solution/microsoftazure.html\">https://business.ais.co.th/solution/microsoftazure.html</a></p>\n<p>AIS Business พร้อมเป็นพันธมิตรดิจิทัล ที่มั่นใจได้ เพื่อพัฒนาธุรกิจและสังคมไทย<br />\n\"Your Trusted Smart Digital Partner\"<br />\nเติบโต อุ่นใจ ไปด้วยกัน<br />\nปรึกษาและวางแผนพัฒนาเทคโนโลยี เพื่อรองรับการทำงานและต่อยอดธุรกิจได้ที่<br />\nEmail: business@ais.co.th<br />\nWebsite: <a href=\"https://business.ais.co.th/\">https://business.ais.co.th</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ais-business\">AIS Business</a></div><div><a href=\"/topics/ais\">AIS</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2c22c56ce0b6c0ab5a35e16306450b2948fc5ea0ece4c48be355592d93a24aba","category":"Thai"}