{"title":"Not That Kind of ‘Open’","link":"https://fedipact.online/","date":1687213653000,"content":"\n<p>The Anti-Meta Fedi Pact:</p>\n\n<blockquote>\n  <p>“i am an instance admin/mod on the fediverse. by signing this\npact, i hereby agree to block any instances owned by meta should\nthey pop up on the fediverse. project92 is a real and serious\nthreat to the health and longevity of fedi and must be fought back\nagainst at every possible opportunity”</p>\n</blockquote>\n\n<p><a href=\"https://bsky.app/profile/gruber.foo/post/3jw4o5d45v22a\">Yours truly, on Bluesky a month ago</a> (which, ironically, is not yet open itself, so <a href=\"https://skeeet.xyz/profile/gruber.foo/post/3jw4o5d45v22a\">here’s an open preview</a>):</p>\n\n<blockquote>\n  <p>Masto zealots: We’re open, federate with us!</p>\n\n<p>Instagram: Great, we’re building a new thing to join you.</p>\n\n<p>Masto zealots: Not that kind of open!</p>\n</blockquote>\n\n<p>It should go without saying that I’m <a href=\"https://daringfireball.net/search/facebook+criminal+enterprise\">no fan of Meta/Facebook</a>. But the idea that administrators of Mastodon/Fediverse instances should pledge to preemptively block Facebook’s imminent Twitter-like ActivityPub service (<a href=\"https://www.theverge.com/2023/6/8/23754304/instagram-meta-twitter-competitor-threads-activitypub\">purportedly named Threads</a>) strikes me as petty and deliberately insular. I don’t like Facebook, the company, and I’ve never seen the appeal of Facebook, the product (a.k.a. “the blue app”). But there are literally <em>billions</em> of good people who use their services. Why cut them off from the open ActivityPub social world? Large swaths of Mastodon seem to relish the fact that it’s confusing how to get started, and that this confusion is keeping Mastodon small.</p>\n\n<p>The whole point of ActivityPub as an open protocol is to turn Twitter/Instagram-like social networking into something more akin to email: truly open. If Facebook were on the cusp of launching a Gmail-like email service, would you preemptively declare that your email server would block them? To me that’s what this “Anti-Meta Fedi Pact” <a href=\"https://g33ks.coffee/@tiesselune/110569596742983089\">is arguing for</a>.</p>\n\n<p>Maybe I’m wrong! I certainly don’t think the “<em>let’s pledge to block Facebook before their Fediverse thing even starts</em>” people are nuts. But to me this feels like convicting Facebook of a <a href=\"https://en.wikipedia.org/wiki/Pre-crime\">pre-crime</a>. Is the goal of the Fediverse to be anti-corporate/anti-commercial, or to be pro-openness? I think openness is the answer. Others clearly disagree.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/19/not-that-kind-of-open\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"2c250c0415bcd8f92a841af6c8f5ac6b7ca3a0909494a9c27be98c779a573ad9","category":"Tech"}