{"title":"Efficiency of freeze‐ and spray‐dried microbial preparation as active dried starter culture in kombucha fermentation","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13697?af=R","date":1719237015000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Kombucha is a widely consumed fermented beverage produced by fermenting sweet tea with a symbiotic culture of bacteria and yeast (SCOBY). The dynamic nature of microbial communities in SCOBY may pose challenges to production scale-up due to unpredictable variations in microbial composition. Using identified starter strains is a novel strategy to control microorganism composition, thereby ensuring uniform fermentation quality across diverse batches. However, challenges persist in the cultivation and maintenance of these microbial strains. This study examined the potential of microencapsulated kombucha fermentation starter cultures, specifically <i>Komagataeibacter saccharivorans</i>, <i>Levilactobacillus brevis</i> and <i>Saccharomyces cerevisiae</i>, through spray-drying and freeze-drying.</p>\n<h2>RESULTS</h2>\n<p>Maltodextrin and gum arabic–maltodextrin were employed as carrier agents. Our results revealed that both spray-dried and freeze-dried samples adhered to physicochemical criteria, with low moisture content (2.18–7.75%) and relatively high solubility (65.75–87.03%) which are appropriate for food application. Freeze-drying demonstrated greater effectiveness in preserving bacterial strain viability (88.30–90.21%) compared to spray drying (74.92–78.66%). Additionally, the freeze-dried starter strains demonstrated similar efficacy in facilitating kombucha fermentation, compared to the SCOBY group. The observations included pH reduction, acetic acid production, <i>α</i>-amylase inhibition and elevated total polyphenol and flavonoid content. Moreover, the biological activity, including antioxidant potential and <i>in vitro</i> tyrosinase inhibition activity, was enhanced in the same pattern. The freeze-dried strains exhibited consistent kombucha fermentation capabilities over a three-month preservation, regardless of storage temperature at 30 or 4 °C.</p>\n<h2>CONCLUSION</h2>\n<p>These findings highlight the suitability of freeze-dried starter cultures for kombucha production, enable microbial composition control, mitigate contamination risks and ensure consistent product quality. © 2024 Society of Chemical Industry.</p>","author":"Thach Phan Van, \nQuoc‐Duy Nguyen, \nNhu‐Ngoc Nguyen, \nAnh Duy Do","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"2c2578a9dafd0e0ae8bea2c933094f75448748bb0f5ade1b3215810966467d38","category":"Environment"}