{"title":"Feasibility and preliminary effects of a mindfulness-based physical exercise (MBPE) program for community-dwelling older people with sarcopenia: A protocol for a parallel, two-armed pilot randomised controlled trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302235","date":1713448800000,"content":"<p>by Meng-Li Li, Patrick Pui-Kin Kor, Zhi-Ying Zhang, Justina Yat-Wa Liu</p>\r\nIntroduction <p>Physical exercise (PE) is essential for alleviating the symptoms of sarcopenia. Low motivation is a major barrier to PE. Mindfulness-based intervention (MBI) has the potential to improve motivation. However, few studies have used a mindfulness-based PE (MBPE) intervention among older people with sarcopenia.</p> Objectives <p>To assess the feasibility, acceptability and preliminary effects of the MBPE program among community-dwelling older people with sarcopenia.</p> Methods and analysis <p>A two-arm pilot randomised controlled trial will be conducted to assess the feasibility, acceptability and preliminary effects of an MBPE program among community-dwelling older people with sarcopenia. A total of 60 participants will be randomised into the intervention group, receiving the MBPE intervention twice a week over 12 weeks, or the control group, receiving health education with the same duration, number of sessions and frequency as the intervention group. Each session of the MBPE program will last about 60 min, including 5-10- min introduction, 20-min MBI, 30-min PE and 5-10-min sharing and discussion. The primary outcomes will be the feasibility (i.e., the time spent recruiting participants, the eligibility rate and the recruitment rate) and acceptability (i.e., the attendance rate, completion rate and attrition rate) of the MBPE program. The secondary outcomes will be the preliminary effects of the MBPE program on symptoms of sarcopenia, motivation for PE, psychological well-being, mindfulness level, physical activity level and quality of life. Individual interviews will be conducted to identify the strengths, limitations and therapeutic components of the intervention. The quantitative data will be analysed by generalised estimating equations. The qualitative data will be analysed by Braun and Clarke’s thematic approach.</p> Conclusion <p>The findings of this study will be able to provide evidence for the health professionals in adopting MBPE as a supportive intervention for the older adults with sarcopenia and the groundworks for the researchers in developing non-pharmacological intervention for older adults. The positive effects could facilitate healthy ageing and relief the burden of the medical system, especially in the countries facing the ageing population.</p> Trial registration number <p>NCT05982067; ClinicalTrials.gov.</p>","author":"Meng-Li Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2c294a8114f621ec374ff02190ca2d3016f85718934cc6f9c7c2a6c84b4cfea1","category":"Interdisciplinary"}