{"title":"Full-Size Function Keys Expected to Feature on New MacBook Pro Models","link":"https://www.macrumors.com/2021/10/18/full-size-function-keys-return-new-macbook-pro/","date":1634548446000,"content":"Apple's new 14-inch and 16-inch MacBook Pro models will feature a redesigned row of function keys that replaces the Touch Bar, and each modifier key will have the same width and height as the alphanumeric keys on the rest of the keyboard, according to rumors and leaked schematics seen by <em>MacRumors</em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/touch-id-magic-keyboard-for-imac-e1634547211386.jpg\" /><div><em>Full-size function keys and <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a> button on <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a> Magic Keyboard</em></div>\r\n<br />\r\nIt's been a hectic few days for the Apple rumor mill, which has seen <a href=\"https://www.macrumors.com/2021/10/15/new-macbook-pro-could-have-a-notch/\">multiple</a> last-minute <a href=\"https://www.macrumors.com/2021/10/16/macbook-pro-notch-alleged-photo/\">MacBook Pro leaks</a> concerning a <a href=\"https://www.macrumors.com/2021/10/17/apple-patent-notch-design-macbook-pro/\">possible notch</a> on the <a href=\"https://www.macrumors.com/2021/10/17/macbook-pro-notch-schematics/\">top</a> of the <a href=\"https://www.macrumors.com/2021/10/17/apple-notch-design-obscured-marketing-materials/\">display</a>. We don't yet know whether the notch rumor will turn out to be true, but what we do have high confidence in, and what may have thus far been overlooked by some, is the layout of the redesigned keyboard.\r\n<br />\r\n\r\n<br />\r\nBefore Apple introduced the Touch Bar in October 2016, the MacBook Pro featured a narrow row of function keys that individually had a smaller profile than the alphanumeric keys. However, in lieu of a Touch Bar, the new MacBook Pro models are expected to have a full-size complementary row of function keys, similar to Apple's Magic Keyboard that comes with the 24-inch ‌iMac‌.\r\n<br />\r\n\r\n<br />\r\nThe first suggestion that function keys would return to the MacBook Pro came from reliable analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> in January, when he <a href=\"https://www.macrumors.com/2021/01/15/new-macbook-pro-models-magsafe-ports/\">reported</a> that Apple was working on two new MacBook Pro models featuring significant design changes. Since then, <em>Bloomberg</em>'s Mark Gurman has consistently stopped short of saying that the Touch Bar will be removed this year. Instead, Gurman states that Apple has \"<a href=\"https://www.macrumors.com/2021/01/15/macbook-pro-better-displays-faster-magsafe-charging/\">tested</a>\" versions of the MacBook Pro without the Touch Bar, implying that it may choose to remove it. Given the accumulation of evidence since,  summarized below, we're almost certain the OLED touchscreen strip above the keyboard will not be returning. \r\n<br />\r\n\r\n<br />\r\nThe first real evidence of the change appeared in April, when schematics of an unreleased MacBook Pro were <a href=\"https://www.macrumors.com/2021/04/21/apple-supplier-ransomware-attack/\">stolen</a> from Taiwanese Apple supplier Quanta Computer by the ransomware group known as REvil. Despite demanding payment in exchange for keeping the information private, some of the schematics still leaked on the dark web, and subsequently corroborated the lack of Touch Bar, the return of an HDMI port, SD card slot, and <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a>, and in hindsight, potentially a <a href=\"https://www.macrumors.com/2021/10/17/macbook-pro-notch-schematics/\">notched display</a>. \r\n<br />\r\n\r\n<br />\r\nThe schematics showed a full keyboard layout, including a top row of function keys and a ‌Touch ID‌ button, all individually diagrammed to the same width as the alphanumeric keys, and as a result of the larger keyboard area, a smaller trackpad below it. \r\n<br />\r\n\r\n<br />\r\nOne month after the REvil leak, the new keyboard layout was also <a href=\"https://www.macrumors.com/2021/05/11/images-reveal-colorful-new-macbook-air-design/\">seen in renders</a>, supposedly based on leaked images, of Apple's next <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>, courtesy of <a href=\"https://www.macrumors.com/guide/jon-prosser/\">Jon Prosser</a>. As in the stolen schematics, the larger function keys were shown to have forced the entire keyboard down, thereby reducing the size of the trackpad.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/prosser-macbook-air-keyboard.jpg\" /><div><em>Render of rumored new ‌MacBook Air‌ by <a href=\"https://twitter.com/RendersbyIan\">RendersByIan</a></em></div>\r\n<br />\r\nThe most recent rumor about the new MacBook Pro keyboard is that the area surrounding the keys is black, rather than just the keys themselves, in what is \"probably the biggest visual change on the keyboard since the Unibody redesigns over a decade ago,\" according to details <a href=\"https://www.macrumors.com/2021/10/15/new-macbook-pro-could-have-a-notch/\">leaked by a Weibo account</a> last week.\r\n<br />\r\n\r\n<br />\r\nThe Touch Bar has been a divisive feature among users, with some decrying the lack of physical controls for functions such as volume or brightness. Apple already made a slight concession when it re-introduced a physical Escape key on the latest 13-inch and 16-inch MacBook Pro models, after users complained about the virtual Escape key on the Touch Bar from previous models.\r\n<br />\r\n\r\n<br />\r\nThe return of function keys, in full-size implementation, appear to be just one indication that, after some perceived missteps in recent years, Apple is all-in on making the MacBook Pro a true professional's machine once again. We'll know for sure in a few hours. \r\n<br />\r\n\r\n<br />\r\nThe new MacBook Pro models are widely expected to be announced later today, Monday, 18 October at Apple's \"Unleashed\" event. Apple will live stream the event <a href=\"https://www.apple.com/apple-events/\">on its website</a> and on YouTube. For those unable to watch, MacRumors will have live coverage of the event both on MacRumors.com and through our <a href=\"https://twitter.com/macrumorslive?lang=en\">MacRumorsLive Twitter account</a>. Be sure to stay tuned.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/macbook-pro-13/\">MacBook Pro 13\"</a>, <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">MacBook Pro 16\"</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/touch-bar/\">Touch Bar</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_13\">13\" MacBook Pro (Don't Buy)</a>, <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_16\">16\" MacBook Pro (Don't Buy)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macbook-pro.90\">MacBook Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/18/full-size-function-keys-return-new-macbook-pro/\">Full-Size Function Keys Expected to Feature on New MacBook Pro Models</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/full-size-function-keys-expected-to-feature-on-new-macbook-pro-models.2317460/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=QWqXHAizKAw:9npZ_y24hjU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=QWqXHAizKAw:9npZ_y24hjU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/QWqXHAizKAw\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2c2ad63395f4f95c80547e0067de66acf59b3885b794699ba9eebd538c86617c","category":"Apple"}