{"title":"Rapid positive response of young trees growth to warming reverses nitrogen loss from subtropical soil","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14526?af=R","date":1715144986000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/27a762ef-cf19-4107-9452-f9701b6e6067/fec14526-toc-0001-m.png\" alt=\"Rapid positive response of young trees growth to warming reverses nitrogen loss from subtropical soil\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/02/young-tree-growth-rapidly-adapts-to-climate-warming-and-helps-reduce-warming-induced-soil-nitrogen-loss-in-subtropical-plantations/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nGlobal warming is widely expected to alter nitrogen (N) cycling in terrestrial ecosystems by accelerating N transformations in soils. However, it is unclear how warming will affect plant–soil N cycling in subtropical ecosystems.\n\nHere, we measured the N transformations including net ammoniation, nitrification, nitrous oxide emissions and nitrate in soil solution throughout the plant–soil continuum with 2 years of experimental soil warming (+5°C) in a young subtropical Chinese fir mesocosm. Seasonal variations of soil and plant (foliage and root) N concentrations and isotopes (δ<sup>15</sup>N), foliar water use efficiency and arbuscular mycorrhizal colonization rate were measured.\n\nSoil warming significantly increased net ammonization and nitrification of the soil, together with the transient positive response observed in inorganic N of the soil. Warming increased nitrate N fluxes in soil solution and nitrous oxide emissions in the first year but not in the second year, suggesting N losses through leaching and gaseous in the initial period of warming. Warming primarily induced enrichment of <sup>15</sup>N in foliage relative to the soil, which was attributed to the trade-offs of persistent increases in plant N uptake caused by enhanced tree growth and a decrease in N losses with continuous warming. Furthermore, young trees' growth and N uptake capacity can rapidly acclimate to climate warming as a result of warming-induced increases in arbuscular mycorrhizal colonization and foliar water use efficiency.\n\nOur findings highlight that warming accelerates the plant–soil N cycle and promotes young trees' growth and N uptake, which in turn reduces soil N lost from this subtropical ecosystem. Therefore, our study suggests that the competition for N between plants and microbes governs whether subtropical forests are opened or closed N cycle systems under climate warming. We predict that subtropical young forests can still maintain their high productivity because young trees can maintain their N uptake capacity and adequate soil N supply in facing future climate warming.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/02/young-tree-growth-rapidly-adapts-to-climate-warming-and-helps-reduce-warming-induced-soil-nitrogen-loss-in-subtropical-plantations/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>摘要</h2>\n<p>\n\n人们普遍认为，全球变暖会通过加速土壤中氮的转化来改变陆地生态系统中氮循环过程。然而，目前尚不清楚气候变暖将如何影响亚热带生态系统中植物—土壤之间氮循环。\n\n在2年土壤增温(+5°C)条件下，我们测量了亚热带杉木幼树微宇宙实验平台中氮的转化过程，包括净氨化、硝化、氧化亚氮排放和土壤溶液中的硝态氮含量等；测定了土壤和植物(叶和根)氮浓度和氮同位素(δ<sup>15</sup>N)、杉木叶片水分利用效率和根系丛枝菌根侵染率的季节变化。\n\n结果发现:土壤升温显著增加了土壤净氨化和硝化作用，土壤无机氮呈短期迅速增加。增温在第一年增加了土壤溶液中硝态氮的通量和氧化亚氮的排放，但在第二年没有增加，表明增温初期通过淋溶和气态损失氮。增温主要导致叶片中<sup>15</sup>N相对于土壤的富集，这是由于树木生长增强导致植物氮吸收持续增加和持续增温导致氮损失减少的权衡。此外，由于气候变暖导致丛枝菌根侵染率和叶面水分利用效率的增加，幼树的生长和氮吸收能力可以迅速适应气候变暖。\n\n我们的研究结果强调，变暖加速了植物—土壤氮循环，促进了幼树的生长和氮的吸收，从而减少了亚热带生态系统中土壤氮的流失。因此，我们的研究表明，气候变暖下植物和微生物对氮的竞争决定了亚热带森林是开放还是保守的氮循环系统。我们预测，在未来气候变暖的情况下，亚热带幼林仍能保持较高的生产力，因为变暖背景下幼树能够维持较强的氮吸收能力和土壤充足的氮供应。\n</p>","author":"Maokui Lyu, \nShidong Chen, \nQiufang Zhang, \nZhijie Yang, \nJinsheng Xie, \nChao Wang, \nXiaohong Wang, \nXiaofei Liu, \nDecheng Xiong, \nChao Xu, \nWeisheng Lin, \nGuangshui Chen, \nYuehmin Chen, \nYusheng Yang","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"2c399a75fece5b5a2314973af17cee6dce025126bf9ec3478ebca252c266e375","category":"Environment"}