{"title":"How to increase your average cycling speed: 16 tips to ride faster","link":"https://www.bikeradar.com/advice/fitness-and-training/average-speed-cycling/","date":1620666028000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/How-to-improve-your-average-speed-4-ec96ab1.jpg?quality=90&amp;resize=620,413\" />                                            <p>Average speed is a key number for cyclists – it’s easy to understand and to use as a benchmark for your performance on the bike.</p>\n<p>There are, however, lots of variables that affect your average speed, so comparing one rider’s speed to the next, or even your own speed from one day to another, isn’t always accurate.</p>\n<p>Still, going faster on the bike is something many of us want to achieve, so what can you do to improve your average speed on the bike?</p>\n<p>When the great Italian cyclist Fausto Coppi was asked how to become a champion, it’s said he answered “pedal, pedal”.</p>\n<p>The Campionissimo’s advice from the 1950s still holds good, with pro riders putting in tens of thousands of kilometres a year on their bikes, but there are other things you can do to improve your average speed. We’ll run through them.</p>\n<h2>What is a good average speed?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Tour de France riders consistently hit an average speed of 25mph/40kph and above, but what about the rest of us?</span></figcaption><span> <i>Alex Broadway / SWPix.com</i></span></div>\n<p>Let’s start with a question that many riders often have. What is a good average speed? As always, it depends on a lot of things.</p>\n<p>That includes the bike you’re riding. You’ll typically go faster on a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bike</a> with drop handlebars and skinny tyres than on a flat-bar <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hybrid-bikes/\">hybrid bike</a> with chunky tyres or a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">mountain bike</a> designed for riding off-road.</p>\n<p>Where you ride matters too, because hillier terrain will often bring your average speed down, as will <a href=\"https://www.bikeradar.com/features/how-to-ride-into-a-headwind/\">riding into a headwind</a> and wet weather or tricky conditions.</p>\n<p>Even how smooth the tarmac is can make a difference – pros used to racing in continental Europe have been known to complain about how much slower the tar-and-gravel UK roads are when they ride the Tour of Britain.</p>\n<p>Crucial though is your level of fitness. A beginner might struggle to keep up an average speed of 10mph/16kph over an hour or two on a road bike. Ride consistently and get fitter, and you should be able to maintain a mileage per hour in the mid-teens (around 15.5mph/25kph) over several hours – Strava reckons that’s the average speed for rides logged.</p>\n<p>To hit an average speed of 20mph/32kph, you’ll probably have had to put in lots of systematic training. Since it takes eight times as much effort to overcome air resistance at 20mph as it does at 10mph, that’s a big increase in power output.</p>\n<p>The winner of the <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> consistently averages 25mph/40kph riding more than 2,000 miles/3,500km over three weeks, although he does have help – read on to see why riding in a group matters.</p>\n<h2>BikeRadar’s tips to improve your average speed</h2>\n<h3>1. Pedal more</h3>\n<p>An easy starter for 10, this one. But it’s a fact that more experienced cyclists pedal more of the time than beginners. That’s partly down to fitness, but also being able to read the road ahead and feeling confident on the bike. And that’s largely thanks to getting out and riding more – Coppi wasn’t wrong.</p>\n<p>Knowing when to pedal is important too. There’s no point in hammering up to a red traffic light then having to stop, put a foot down, then start again, when a better-timed approach would see you ride through with less effort.</p>\n<h3>2. Brake less</h3>\n<p>Another obvious one. Again, it’s down to experience and reading the road ahead. Riding faster downhill will come with practice and increased confidence. We’ve got advice on <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-descend-safely-on-a-road-bike/\">how to descend safely on a road bike</a>.</p>\n<p>On an undulating road, a faster descent will give you more momentum to get you part way up the next uphill too. Gauge it right and you might make it to the top of the next ridge without needing to drop to your small chainring, and without too much of a drop in speed. Starting a climb from a low speed will be harder and slower.</p>\n<p>Learning how to take corners faster will increase your average speed too. Again, it’s down to practice, but also taking steps to improve your technique, how you steer through the bend and how to use the drops to lower your centre of gravity. Read our advice on <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-corner-with-confidence/\">how to corner with confidence</a>.</p>\n<h3>3. Ride in a group</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Drafting another rider – or riding with a group – is a sure-fire way to improve your average speed.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Riding in a group can be a sure-fire way to improve your average speed.</p>\n<p>If you’re with other riders, there’s the incentive to keep up, so that even if you’re starting to flag you’ll hang in and keep going. Likewise, if you’re feeling fresh you can set the pace and help your fellow riders to keep going faster.</p>\n<p>The main benefit of riding in a group, however, is the drafting effect. Tucked in behind, it’s estimated that a rider can save up to 40 per cent of the effort required to ride up front. <a href=\"https://www.bikeradar.com/features/how-to-perfect-your-drafting/\">Drafting effectively</a> and safely takes practice, so again more miles will make you better.</p>\n<p>Drafting is why, if you watch a road race, the riders further back are often freewheeling even when those at the front of a pack are obviously putting in a lot of effort. And that’s part of the reason why the winners of the Tour de France can keep up such a high pace.</p>\n<p>It’s also why sprinters have a lead-out train – they’ll spend a lot of the time riding behind their teammates, conserving their energy for the crucial final dash to the line.</p>\n<p>Clubs are a great way to find fellow cyclists to ride with. Most will organise group rides of different speeds, so you can pick one that you can keep up with and move up to a faster group as your speed and experience increase.</p>\n<p>If you’re new to cycling in a bunch, we’ve got advice on <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-in-a-group/\">how to ride in a group</a>.</p>\n<h3>4. Work on your cadence</h3>\n<p>It’s not just about pedalling more, pedalling faster can help you ride faster too. There’s less strain on your muscles and, once you get efficient at it, pedalling faster should be less tiring. <a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">Cadence</a>, if you’re not familiar, is just the number of times you turn the pedals per minute.</p>\n<p>There’s no ‘perfect’ cadence but trained amateur riders typically ride at around 80 to 90rpm, while some pro riders may ride with a cadence approaching 100rpm. Chris Froome will famously pedal at around this number, even when riding to an uphill finish.</p>\n<p>It’s also about developing “souplesse” – a smooth, efficient riding style that puts down power through more of the pedal stroke, not just when pushing down.</p>\n<h3>5. Get more aero</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Get aero to reduce the amount of wind resistance you have to overcome.</span></figcaption><span> <i>Robert Smith / Immediate Media</i></span></div>\n<p>Getting more aero is a major factor in riding faster. Around three-quarters of drag comes from you, not your bike, so that doesn’t mean you have to spend a fortune on a new aero bike or deep-section wheels.</p>\n<p>Wind resistance rather than friction takes over as the dominant factor slowing you down once you get above 10mph/16kph, so even at lower speeds it’s important.</p>\n<p>The main thing you can do to improve your aerodynamic performance is to reduce your frontal profile. In simple terms, that means getting down more over the handlebar, riding in the drops and possibly <a href=\"https://www.bikeradar.com/advice/workshop/how-to-adjust-your-handlebar-height/\">lowering the stem</a>, if you can do that and stay comfortable on the bike.</p>\n<p>If you’re not comfortable in a more aggressive position, dropping the bar might not be such a good idea, though. Top coaches find that triathletes and time trialists can be slower overall if they’re too low and can’t hold an aero position consistently.</p>\n<p>Even the <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-faster-without-pedaling-harder/\">position of your arms</a> can make a difference: research has shown that arms at a right angle on the top of the bar are almost as aero as riding in the drops.</p>\n<h3>6. Use your bike’s gears more efficiently</h3>\n<p>Poor use of gears can also sap speed. If you find yourself spinning before you change up a gear, or grinding a low gear as you hit a climb, you’ll be using more effort than if you’ve got your gear right for the terrain.</p>\n<p>So learning <a href=\"https://www.bikeradar.com/news/the-complete-guide-to-bicycle-gears-bicycle-transmissions-explained/\">how to use your bike’s gears</a>, reading the road ahead and preparing for what’s up front can help you ride faster.</p>\n<p>Cross-chaining, where you run the large chainring with the largest cassette sprocket or the smallest to smallest, is less efficient than riding in a gear near the middle of your cassette.</p>\n<h3>7. Keep track</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Use a bike computer to keep track of your training data.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>On a longer ride, it’s easy to drop off the pace, while if you’ve just climbed a hill it’s tempting to ease off a bit until you feel recovered.</p>\n<p>A cycling computer will help you keep an eye on your current and average speeds and see if they’re beginning to drop.</p>\n<p>Just having the number displayed can subconsciously encourage you to up your tempo and features such as Garmin’s Courses will tell you if you’re riding a particular route slower or faster than normal.</p>\n<p><a href=\"https://www.bikeradar.com/features/routes-and-rides/strava-tips-20-of-the-best/\">Strava</a> is also a great way to see how you’re doing against your own past performance and against others. You can choose a particular segment and use that to benchmark your fitness.</p>\n<p>The Strava Live feature, compatible with some <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">GPS bike computers</a>, will also give you an indication of how fast you’re riding a particular segment, compared to your previous best time and the KOM/QOM.</p>\n<h3>8. Train indoors</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> If you’re short on time, riding indoors is a great way to train efficiently.</span></figcaption><span> <i>pixdeluxe / Getty Images</i></span></div>\n<p>A good way to work on your cadence, fitness and speed outdoors, is to get on a turbo trainer and ride indoors.</p>\n<p>There are many <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-cycling-benefits/\">benefits to indoor cycling</a>. For a start, it’s a more controlled environment than riding out on the road, so you can train more effectively without worrying about the weather, traffic or terrain.</p>\n<p>If you use a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a>, you can also use power to track your training, while these days there’s a wide range of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">indoor training apps</a>, such as <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a>, to provide motivation and workouts to follow, which brings us on to…</p>\n<h3>9. Try intervals</h3>\n<p>While you’re on your turbo, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">interval training</a> is a great way to increase your fitness, particularly if you’re short on time.</p>\n<p>You can ride intervals on the road too, but make sure you choose a safe place and stay alert to other road users.</p>\n<h3>10. Ride off-road</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Riding off-road is a great way to improve your skills.</span></figcaption><span> <i>Ian Linton / Immediate Media</i></span></div>\n<p>If you’re a road cyclist, riding off-road can improve your pedalling efficiency and technique. Stomp on the pedals on a muddy or gravelly climb and you’ll go nowhere, but put the power down smoothly and you’ll keep going.</p>\n<p>Off-road riding improves your balance and bike handling skills, and the efforts tend to be more punchy than road riding, which can improve your fitness in a similar way to intervals.</p>\n<p>Top mountain bike riders have been shown to be the most efficient pedallers out there and many road pros came from an MTB background. Rising road stars Mathieu van der Poel and Wout van Aert also have lots of off-road experience, both being multiple cyclocross world champions.</p>\n<h3>11. Practice climbs</h3>\n<p>Many people struggle on climbs and that can make a big dent in your average speed.</p>\n<p>Hill repetitions are a good way to <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-faster-climbing/\">get better at climbing</a>. Choose a hill that will take you a few minutes to climb and try climbing it, staying seated as much as possible. Take a break at the top if necessary, ride to the bottom and repeat for a few more turns, until you’ve had enough.</p>\n<p>Keep practising and you’ll find your hill-climbing strength and speed increase, and you need less recovery time once you reach the top of an uphill stretch.</p>\n<h3>12. Ride a tailwind home</h3>\n<p>It’s obvious but a tailwind can make an amazing difference to how easy riding feels. That’s particularly true if you’re getting towards the end of a ride and are feeling a bit tired. A couple of hours battling a stiff headwind can feel really demoralising when you’re low on energy and trying to get home.</p>\n<p>It’s worth checking the weather forecast on a breezy day and planning where to ride, so that you ride out into a headwind while you’re fresh and pick up a following wind on the way back.</p>\n<h3>13. Get your feeding down</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Stay hydrated and well-fed to avoid bonking on a ride.</span></figcaption><span> <i>Tara Moore / Getty Images</i></span></div>\n<p>Keeping <a href=\"https://www.bikeradar.com/advice/nutrition/12-cycling-nutrition-truths-analysed/\">properly fed and watered</a> when riding is important. At worst, you can suffer from the dreaded <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-avoid-bonking-on-a-bike-ride/\">bonk</a>, where you completely run out of energy and slow to a crawl. But even a two per cent loss of body water has been shown to reduce your efficiency, so it’s important to stay hydrated.</p>\n<p>The rule is to eat and drink little and often to keep up your energy and fluid levels. And on a longer ride, it might be more effective to stop for a proper break at a cafe or shop, or to fill your bottles at a tap, than to keep going as your energy and hydration levels dip.</p>\n<h3>14. Upgrade your tyres</h3>\n<p>We’ve predominantly focused on free (or low-cost) ways to improve your average speed, but there are smaller changes to your equipment that can make a significant difference.</p>\n<p>Faster tyres are surprisingly effective and cost-efficient; the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">best road bike tyres</a> will ride significantly quicker than cheaper alternatives. Some brands cut costs on tyres when speccing a build so switching to faster rubber can be an easy way to upgrade your road bike.</p>\n<p>Many of the latest bikes will come with <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless-ready</a> wheels and tyres. Running tubeless has been shown to be <a href=\"https://www.bikeradar.com/features/tubeless-tyres-pro-peloton/\">more efficient</a> than using tubes, due to the elimination of the friction between the <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tube</a> and the tyre casing. Latex tubes are more efficient than the standard butyl variety if you can’t run tubeless.</p>\n<p>Tyre pressure is important too, so it’s important to keep them correctly inflated.</p>\n<h3>15. Go Lycra</h3>\n<p><a href=\"https://www.bikeradar.com/features/tunnel-testing-clothing-pearl-izumis-ongoing-aero-design/\">Aero clothing</a> is a factor too. Close-fitting Lycra clothing won’t flap in the wind like baggy kit, which can act like a sail and slow you down.</p>\n<p>Cycle clothing brands increasingly emphasise the aero benefits of their pricier pieces, but even with entry-level kit there are gains to be had. You’ll be more comfortable too, with technical kit offering better heat and sweat management.</p>\n<p>At the marginal gains end of the performance spectrum, clothing can make a significant difference. Time trialists will wear a skinsuit to cut through the wind, while the best riders will test its effect on drag in a wind tunnel.</p>\n<p>Other kit such as an aero helmet and shoe covers may reduce your drag without spending a fortune, while <a href=\"https://www.bikeradar.com/news/rule-28-aero-socks/\">aero socks</a> are even a thing.</p>\n<h3>16. Maintain your bike</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Keep your chain clean to improve the efficiency of your drivetrain.</span></figcaption><span> <i>David Caudery/Immediate Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/features/clean-your-bike-in-7-simple-steps/\">Cleaning your bike</a> may not be a particularly fun job, but it can make a real difference to your efficiency.</p>\n<p>A <a href=\"https://www.bikeradar.com/advice/workshop/how-to-clean-a-bike-chain/\">clean chain</a> with the <a href=\"https://www.bikeradar.com/advice/buyers-guides/chain-lubes/\">right chain lube</a> will have less friction than one caked in grime. A rubbing brake or kinked rim will slow you down, while worn brake pads will be less effective, so you’ll need to slow down more gradually, again lowering your speed.</p>\n<p>So keep everything well maintained and you should find a bonus dose of free speed on your rides.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"2c4a5fd2b159cba6ddb1b3fb34cc920553ca5ee6d45dc2f430a865cc4ce9ac74","category":"Cycling"}