{"title":"PSIV-A-5 Effect of roughage inclusion in limit-fed cow rations on behavior, cow hygiene, and manure scores","link":"https://academic.oup.com/jas/article/102/Supplement_2/355/7664907?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective was to determine the effects of roughage inclusion in isocaloric total mixed rations (TMR) fed to drylot housed cow-calf pairs on behavior, manure score, and hygiene score. Spring-born Simmental x Angus cows (n = 72) and their calves were stratified by calf age, sex, and body weight (BW) and assigned to 12 pens with 6 pairs to pen. Pens were randomly assigned to one of two treatments: moderate roughage inclusion (40%) TMR targeting DMI of 1.7% of BW (LimitTMR) or high roughage inclusion (60%) TMR targeting DMI of 2.1% of BW (BulkyTMR). Concrete bunks (4.7 m; 0.8 m/cow). Cow-calf pairs were housed in concrete dry lots with open-front buildings. Buildings were bedded with straw once a week. Cow and calf behavior (standing, lying, at bunk, and eating bedding) was observed hourly from 1 h before feeding until 6 h post-feeding. Behavior assessments were done on 2 consecutive days (before new bedding and after new bedding) each week for 5 wk. Hygiene and manure scoring was conducted on d 40 and 75 by 2 trained evaluators. Hygiene was scored on a 1-4 scale; 1 – no manure, 4 confluent plaque of manure. Cow hygiene was evaluated on the lower leg, udder, and upper leg and flank. Manure from each pen was scored on a 1-5 scale; 1 – very liquid consistency, 5 – firm fecal balls. Data were analyzed using the MIXED procedure of SAS 9.4. On day prior to new bedding, there was a treatment × time interaction (<span>P</span> &lt; 0.01) for cows at bunk. More cows on BulkyTMR were at the bunk at h 2, 3, 4, and 5 post-feeding. On day after new bedding, there was also a treatment × time interaction (<span>P</span> &lt; 0.01) for cows at bunk. More cows on LimitTMR were at the bunk before feeding; however, more cows on BulkyTMR were at bunk at h 2 and 3 post-feeding. On both evaluation days there was a treatment × time interaction (<span>P</span> ≤ 0.05) for calves at bunk. More calves on BulkyTMR were at the bunk at h 1 and 2 post-feeding. Cows fed the LimitTMR had dirtier (<span>P</span> ≤ 0.02) lower leg (1.5 vs 1.2) and upper leg/flank (1.4 vs 1.1) hygiene scores on d 40 than cows fed the BulkyTMR; however, there were no treatment differences (<span>P</span> ≥ 0.31) on d 75. There were no treatment differences (<span>P</span> ≥ 0.26) for manure scores on d 40 or d 75. In conclusion, a bulkier TMR with more roughage inclusion resulted in more time at the bunk for cows and calves and cleaner hygiene scores for cows, but roughage inclusion did not affect manure scores.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2c558160c86fba1f52d7c9430ed09518afdbf420af4fcc3b81781a213cce31ab","category":"Environment"}