{"title":"53 Relationship of Angus yearling bull pulmonary arterial pressure estimates with birth weight, gestation length and growth traits","link":"https://academic.oup.com/jas/article/102/Supplement_3/85/7757148?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Pulmonary arterial pressure (PAP), determines the susceptibility to High Altitude Disease (HAD) of an animal, which causes pulmonary hypertension due to hypoxia. Cattle that reside in elevations greater than 1,500 m are more susceptible to HAD. PAP measures the resistance of blood flow through the lungs and can be used as an indicator of the susceptibility of an animal to HAD. It is estimated that 1.5 million head of cattle are raised in high altitude environments (above 1,500 m) and HAD accounts for 3 to 5% of calf death loss yearly. The objectives of this study were to model the relationship of PAP estimates with birth weight, gestation length and growth traits of developing bulls. PAP estimates were collected from Angus yearling bulls ranging in age from 12 to 18-mo of age from a Montana-based Angus operation (&gt; 1,600 m elevation, 5,400 yearlings/18-mo-old bulls from 2016 – 2023). We hypothesized that the relationship between PAP and performance traits could be described with linear or asymptotic models. We used Akaike’s Information Criterion adjusted for small sample sizes (AICc) to evaluate support for competing models reflecting hypotheses about the effects of bull age at time of testing and performance traits. Models containing an asymptotic relationship between PAP and all measured variables were the best supported from the candidate model sets. Bull age at time of PAP testing was not supported in model selection for any of the performance traits measured. PAP was greater for bulls with greater birth weight (<span>P</span> &lt; 0.01; β = 2.86 ± 0.81; R<sup>2</sup><sub>marginal</sub> = 0.25 %; R<sup>2</sup><sub>conditional</sub> = 0.77 %). PAP was greater for bulls that had greater gestation lengths (<span>P</span> &lt; 0.01; β = 33.74 ± 11.25; R<sup>2</sup><sub>marginal</sub> = 1.40 %; R<sup>2</sup><sub>conditional</sub> = 27.37 %). There were no observed relationships between bull PAP and weaning weight (<span>P</span> = 0.26). PAP was less for bulls that had greater yearling weights (<span>P</span> = 0.04; β = -2.16 ± 1.05; R<sup>2</sup><sub>marginal</sub> = 0.09 %; R<sup>2</sup><sub>conditional</sub> = 0.65 %). In addition, PAP was less for bulls that had greater weaning to yearling gains (<span>P</span> = 0.02; β = -1.21 ± 0.54; R<sup>2</sup><sub>marginal</sub> = 0.12 %; R<sup>2</sup><sub>conditional</sub> = 0.79 %). In summary, PAP was related to birth weight, gestation length, yearling weight, and growth between weaning and yearling; however, these relationships explain very little of the variation of PAP estimates.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2c56467eb5afb3883fa538c39a700103bcd5283e964f940d0c09676c303c13a5","category":"Environment"}