{"title":"Estimates of Effective Number of Breeders Identify Drivers of Decline in Mid‐Atlantic Brook Trout Populations","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13769?af=R","date":1727754267000,"content":"<h2>ABSTRACT</h2>\n<p>Brook Trout (<i>Salvelinus fontinalis</i>) populations have experienced marked declines throughout their native range and are presently threatened due to isolation in small habitat fragments, land use changes, and climate change. The existence of numerous, spatially distinct populations poses substantial challenges for monitoring population status (e.g., abundance, recruitment, or occupancy). Genetic monitoring with estimates of effective number of breeders (<i>N</i>\n<sub>b</sub>) provides a potentially powerful metric to complement existing population monitoring, assessment, and prioritization. We estimated <i>N</i>\n<sub>b</sub> for 71 Brook Trout habitat units in mid-Atlantic region of the United States and obtained a mean <i>N</i>\n<sub>b</sub> of 73.2 (range 6.90–493). Our modeling approach tested whether <i>N</i>\n<sub>b</sub> estimates were sensitive to differences in habitat size, presence of non-native salmonids, base flow index, temperature, acidic precipitation, and indices of anthropogenic disturbance. We found significant support for three of our hypotheses including the positive influences of available habitat and base flow index and negative effect of temperature. Our results are consistent with presently observed and predicted future impacts of climate change on populations of this cold-water fish. Importantly, these findings support the use of <i>N</i>\n<sub>b</sub> in population assessments as an index of relative population status.</p>","author":"Zachary L. Robinson, \nJason A. Coombs, \nMark Hudy, \nKeith H. Nislow, \nAndrew R. Whiteley","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"2c5b8624e36a89f4026d98788abba262b6b758a42db7be115decbb10ce0595d5","category":"Environment"}