{"title":"Hydraulic analysis for assessing environmental flow selection and ecological model formulation","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2681?af=R","date":1720681200000,"content":"<h2>Abstract</h2>\n<p>Ecosystem management depends on transforming qualitative observations (e.g., slow-moving shallow conditions provide nursery refugia for silvery minnow larvae) into management actions to increase habitat quantity or improve habitat quality. To be effective, decision metrics that are developed for management objectives should be validated with field observations. Model assumptions, precision and parameter importance can be refined by comparing the fidelity of selected parameters computed as habitat quality metrics and the correlation of these metrics to real-world observations. Validated environmental metrics are more credible for management and can be compatible with ecosystem monitoring and project design processes. In this study, streamflow monitoring data and hydraulic modelling are used to quantify fish habitat extent for 15 years of spring runoff. The spring runoff event coincides with larval maturation to a free-swimming juvenile phase for the silvery minnow, a critical period in Rio Grande habitat management. Different methods to estimate habitat availability (i.e., hydrology statistics, inundation extents based on hydraulic modelling and areal habitat availability based on different formulations of a habitat suitability index curve) were used to test the efficacy of different metrics relative to species population monitoring. This analysis finds that flow–ecology relationships based on hydraulic modelling or hydrology statistics are both effective and highly correlated to larval production. The investigation shows how seasonal hydrologic characterization and hydraulic discretization have varying levels of correlation with seasonal fish production. This study demonstrates how hydraulic modelling data and hydrologic characterization of riverine environments can be used to validate or develop conceptual ecological models.</p>","author":"Aubrey Harris, \nMichael Porter, \nS. Kyle McKay, \nAnjali Mulchandani, \nMark Stone","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"2c5eaf229593d5bb69275846450a161ac0862a11d969326f5e9e1095b68ae6ca","category":"Environment"}