{"title":"Take a Video Tour of Hans Rey’s Favorite Italian Trails (and Cafes!)","link":"https://bikerumor.com/hans-rey-umbria-video/","date":1683745200000,"content":"<p>When Hans “No Way” Rey started considering retirement in the late ’90s, he turned his gaze to the Italian countryside. Thinking he’d enjoy the quiet life of an Italian vintner, Rey nestled into his newly-bought villa with gratitude. But it wasn’t long before the <a href=\"https://theloamwolf.com/2022/09/20/ride-and-interview-hans-rey-living-legend/\" target=\"_blank\">trials/freeride legend</a> started exploring the trails around his house. Within a few years, he sold his villa and once again <a href=\"https://bikerumor.com/gritty-in-mexico-hans-rey/\" target=\"_blank\">traveled the world on a mountain bike</a>. </p>\n\n\n\n<p>These days Rey lives in California with his wife. But a video from SHIMANO finds the famed rider returning to Umbria for a two-wheeled reminiscence of his time there. </p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>It’s an interesting little piece — Rey channels Anthony Bourdain as he guides viewers from singletrack to hilltop cities and everything in between. He even stops for a hearty-looking tray of Italian meats along the way. Yes, you’ll get the obligatory pitch for <a href=\"https://mtb.shimano.com/us/products/e-mtb/ep8/\" target=\"_blank\">SHIMANO’s EP8 eBike drive system</a> — the sponsors always get their due — but mostly, it feels like palling around with a charismatic friend as he shows you his favorite spots to ride and gnosh. </p>\n\n\n\n<p>There’s nothing in the vid too stoketastic. That’s not really the point, though the fifty-something can still get after it when he wants to. But it’s cool to scope out singletrack in a new spot, particularly if that spot looks like it arrived wholesale from an Italian Renaissance painting. And if your idea of a good outing entails mid-day salami and post-ride local wine, you just might find yourself eyeing flights to Umbria….</p>\n\n\n\n<p><em><a href=\"https://mtb.shimano.com/us/products/e-mtb/ep8/\" target=\"_blank\">mtb.shimano.com</a></em></p>\n<p>The post <a href=\"https://bikerumor.com/hans-rey-umbria-video/\">Take a Video Tour of Hans Rey’s Favorite Italian Trails (and Cafes!)</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Andrew Marshall","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"2c6600ba91412058d55015282a67080332191c37ee83256d9231ccd0786b2d59","category":"Cycling"}