{"title":"Assessing Mid-rotation Loblolly Pine and Competing Vegetation Responses to Post-thin Fertilization and Herbicide Application in the Southeastern United States","link":"https://academic.oup.com/jof/article/122/1/54/7252866?rss=1","date":1693180800000,"content":"<span><div>Abstract</div>Mid-rotation silvicultural treatments (MRT) are commonly applied to loblolly pine (<span>Pinus taeda</span> L.) plantations in the southeastern United States to improve pine productivity. Competing vegetation is often present in operational plantations and limits site resource availability. The benefits of MRT for pine productivity are well known, but competing vegetation growth has not been extensively studied. Pine and competing vegetation growth within two regions of the southeastern United States was monitored for 8 years following a one-time post-thin application of either fertilization (224 kg ha<sup>-1</sup> of nitrogen plus 28 kg ha<sup>-1</sup> phosphorus), chemical herbicide (0.8 oz glyphosate and 0.8 oz triclopyr L<sup>-1</sup> of water) or their combination. Fertilization significantly increased pine volume growth in the Lower Coastal Plain (LCP, 2.67-4.01 m<sup>3</sup>ha<sup>-1</sup>yr<sup>-1</sup>) and the Upper Coastal Plain/ Piedmont (UCPIE, 0.20-3.72 m<sup>3</sup>ha<sup>-1</sup>yr<sup>-1</sup>). Chemical herbicide application in both the LCP (0.34-4.87 m<sup>3</sup> ha<sup>-1</sup>yr<sup>-1</sup>) and UCPIE (0.89-1.97 m<sup>3</sup> ha<sup>-1</sup>yr<sup>-1</sup>) also significantly increased pine volume. Chemical herbicide application, individually and combined, did not result in significant decreases in herbaceous vegetation, but reduced woody vegetation by up to -2.40 m<sup>3</sup> ha<sup>-1</sup>yr<sup>-1</sup> in the LCP and -5.67 m<sup>3</sup> ha<sup>-1</sup>yr<sup>-1</sup> in the UCPIE. Consequently, we suggest that competing vegetation response should be considered within site-specific management plans aimed at maximizing pine productivity.</span>","author":"","siteTitle":"Journal of Forestry Current Issue","siteHash":"f325018648ab04fba35e6e1191e9c9d953f9458bd233a7a41545c2e465328e3b","entryHash":"2c6c1523a6c9b2aebd493c512d720d40bb06f05521b92952148ce6bcfee80a85","category":"Environment"}