{"title":"นักเขียนโวย ถูกสวมรอยใช้ชื่อผู้เขียนบนหนังสือที่สร้างจาก AI บน Amazon","link":"https://www.blognone.com/node/135198","date":1691571216000,"content":"<div><div><div><p><a href=\"https://www.blognone.com/node/134616\">ก่อนหน้านี้มีนักเขียนได้ออกมาร้องเรียนว่า รายการหนังสือยอดนิยมบน Kindle Unlimited ของ Amazon</a> ส่วนใหญ่เต็มไปด้วยหนังสือที่สร้างจาก AI เพื่อหวังสร้างกำไร ล่าสุด Jane Friedman นักเขียนได้ออกมาทวีตบน X ว่าเธอถูกสวมรอยใช้ชื่อเป็นผู้เขียนบนหนังสือที่สร้างจาก AI แต่เมื่อแจ้งกับทาง Amazon กลับถูกปฏิเสธคำร้องขอเนื่องจากเหตุผลที่ว่าเธอไม่ได้มีการจดลิขสิทธิ์ชื่อตัวเองไว้</p>\n<p>Jane Friedman ทวีตว่า ตอนนี้มีหนังสือประมาณครึ่งโหลที่ขายใน Amazon มีชื่อของเธออยู่ ซึ่งเธอไม่ได้เขียนหรือเผยแพร่เลย หนังสือเหล่านั้นถูกคนสร้างขึ้นมาโดยใช้ AI และเธอยังกล่าวเสริมว่า นี่คือปัญหาใหญ่สำหรับวงการหนังสือ</p>\n<blockquote><p>As of today, there are about half a dozen books being sold on Amazon, with my name on them, that I did not write or publish. Some huckster generated them using AI. This promises to be a serious problem for the book publishing world. <a href=\"https://t.co/YXcMlJeTMV\">https://t.co/YXcMlJeTMV</a></p>\n<p>— Jane Friedman (@JaneFriedman) <a href=\"https://twitter.com/JaneFriedman/status/1688534372197011457?ref_src=twsrc%5Etfw\">August 7, 2023</a></p></blockquote>\n<p>ต่อมาเธอได้ส่งรายงานถึง Amazon ว่าหนังสือเหล่านี้ใช้ชื่อของเธอโดยไม่ได้รับอนุญาต สิ่งที่ Amazon ตอบกลับมาเป็นการขอหมายเลขเครื่องหมายการค้าชื่อของเธอเอง และเธอได้ตอบกลับไปว่าไม่มีการจดทะเบียนเครื่องหมายการค้าชื่อของเธอ สุดท้ายสิ่งที่ Amazon ทำคือ การจบเรื่องนี้และบอกว่าหนังสือจะไม่ถูกลบออกจากเว็บไซต์ เหตุผลส่วนหนึ่งเป็นเพราะว่า เธอไม่ได้มีการถือครองเครื่องหมายการค้าชื่อของเธอเอง</p>\n<p>The Authors Guild สมาคมนักประพันธ์แห่งสหรัฐได้ออกมาทวีตสนับสนุน Jane Friedman เนื่องจากเธอเป็นหนึ่งในสมาชิกของสมาคมนี้ว่าจะดำเนินการเรื่องนี้กับทาง Amazon</p>\n<blockquote><p><a href=\"https://twitter.com/JaneFriedman?ref_src=twsrc%5Etfw\">@JaneFriedman</a> As a member of the Authors Guild, we can advocate on your behalf and are reaching out to senior management immediately to let them know that these works are an attempt to trade off your brand and must be removed as infringements of the Lanham Act.</p>\n<p>— The Authors Guild (@AuthorsGuild) <a href=\"https://twitter.com/AuthorsGuild/status/1688675924579962880?ref_src=twsrc%5Etfw\">August 7, 2023</a></p></blockquote>\n<p>Jane Friedman ยังเรียกร้องให้ Amazon และ Goodreads สร้างวิธียืนยันตัวตนผู้เขียน หรือให้ผู้เขียนสามารถป้องกันตัวเองเมื่อถูกสวมรอยใช้ชื่อบนหนังสือที่ตนไม่ได้เขียนเองได้ เธอยังบอกอีกว่าให้ทำตอนนี้และทำอย่างรวดเร็ว</p>\n<p>ซึ่งในตอนนี้หนังสือที่สร้างจาก AI ขึ้นสถานะหมดสต๊อกชั่วคราวและหน้าเว็บที่ขึ้นชื่อผู้เขียนก็ไม่ได้แสดงชื่อของเธอแล้ว</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/39e7f3bfb27a95a5b365776302def6c8.png\" /></p>\n<p>ที่มา: <a href=\"https://decrypt.co/151674/amazon-refuses-authors-request-to-remove-fake-books-written-with-ai\">Decrypt</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2c833a45e35e75529f445bc0c5e5822b33c57a4159454bc66147068c4f9e029c","category":"Thai"}