{"title":"PSII-13 Analysis of variation characteristics within genes associated with temperament traits in horses","link":"https://academic.oup.com/jas/article/102/Supplement_3/623/7757587?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Temperament traits in horses are key characteristics evaluated in assessing riding horses. The aim of this study is to explore the polymorphism of genetic variants associated with temperament traits using Jeju crossbred horses (a cross between Jeju horses and Thoroughbreds). To investigate the genetic characteristics of temperament in horses, analysis was conducted on 12 variants within 9 genes associated with temperament. Temperament traits were evaluated in 46 Jeju crossbred horses using a temperament test (assessing gentleness, patience, aggressiveness, sensitivity and friendliness) and a contact test (involving objects such as handkerchief, umbrella, plastic bag, air spray and whistle). The temperament test involved observers evaluating the behavior of the horses, while the contact test scored the reactions and movement distances of the horses when exposed to objects or sounds. Genetic variant analysis was performed using pyrosequencing. The association between genetic variants and temperament evaluation was analyzed using t-Tests and ANOVA tests to determine significance. Three variants (DDC rs394771481, GNAT3 rs395660537 and NLN rs1148100304) were found to be genetically fixed, while most variants, except for two (DRD5 rs68544696, ESR1 rs69463001), exhibited major allele frequencies of 0.8~0.9 (Table). Through association analysis between temperament traits and genetic variants, it was confirmed that the COMT(rs3431120406) variant was significantly associated with Aggressiveness, Friendliness, and Whistle responses. Additionally, significant differences in Whistle evaluation scores were observed based on genotypes in DRD5(rs68544698) and ESR1(rs69463001). This study suggests that genetic variations associated with temperament traits could serve as a theoretical foundation for evaluating temperament characteristics using Jeju crossbred horses.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2c8be0dd994a08630d694b818c38cb92fb79c0af122776d58cc73bbe7ab62d97","category":"Environment"}