{"title":"This startup has an intriguing concept for EV battery swaps","link":"https://arstechnica.com/?p=1746803","date":1614803883000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Ample-74-2-980x654.jpg\" alt=\"\"></div>\n        <p>\n          A startup called Ample has developed a new modular battery and quick-swap station, and it just deployed the first five in the Bay Area.                      [credit:\n                        <a href=\"https://ample.com/\">Ample</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>On Wednesday morning in San Francisco, a startup called Ample launched its new electric vehicle battery-swap technology. The company has designed an extremely small footprint for its swap stations, which only occupy as much ground as a couple standard parking spaces and don't need much in the way of electrical infrastructure. So instead of building one big location able to handle hundreds of cars a day, Ample's plan is to build numerous small stations, which can be deployed quickly. The first five of these are now operational in the Bay Area, servicing a fleet of Uber EVs equipped with Ample's modular battery system.</p>\n<h2>Faster than fast charging</h2>\n<p>Rightly or wrongly, charging times and <a href=\"https://arstechnica.com/cars/2021/03/biden-pushes-ev-chargers-as-six-utilities-plan-a-unified-network/\">charging infrastructure</a> are probably the biggest stumbling blocks to widespread electric vehicle adoption. Since the creation of the first gas station in 1905, society has become accustomed to rapidly refueling with liquid hydrocarbons. As a result, no one minds if their <a href=\"https://arstechnica.com/cars/2016/02/getting-to-know-the-ff-a-ferrari-you-can-drive-every-day/\">V12-powered grand tourer</a> can't make it 200 miles before stopping, since they know they'll only be stationary for a few minutes.</p>\n<p>Battery EVs, on the other hand, need to be sold with as much battery as can be crammed underneath the cabin, and even the fastest-charging BEVs currently on sale <a href=\"https://arstechnica.com/cars/2019/09/the-porsche-taycan-every-bit-as-good-as-a-200000-porsche-should-be/\">still take more than 20 minutes to charge back to 80 percent</a>—and even then only with <a href=\"https://arstechnica.com/cars/2019/05/inside-electrify-americas-plan-to-simplify-electric-car-charging/\">350 kW fast chargers</a> that are still <a href=\"https://arstechnica.com/cars/2020/07/gm-teams-up-with-evgo-to-deploy-more-than-2700-new-dc-fast-chargers/\">relatively uncommon</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1746803#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1746803&comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2c911d4f883c9d750239684ac16cae023f2f21c452ac9713ed52d0b0a7d199e4","category":"Tech"}