{"title":"Project IDX ของกูเกิล เพิ่มฟีเจอร์ Gemini ช่วยเขียนโค้ดตามสั่ง","link":"https://www.blognone.com/node/138261","date":1708307133000,"content":"<div><div><div><p>กูเกิลมี<a href=\"https://www.blognone.com/node/135182\">เครื่องมือ IDE ผ่านเบราว์เซอร์ชื่อ IDX เปิดตัวมาตั้งแต่กลางปี 2023</a> รากฐานของมันคือ VS Code เวอร์ชันรันผ่านเบราว์เซอร์ แล้วเพิ่มฟีเจอร์การใช้ AI ช่วยเขียนโค้ดเข้ามา ลักษณะเดียวกับ GitHub Copilot</p>\n<p>ในช่วงแรก โมเดล AI ที่ช่วยเขียนโค้ดยังเป็น <a href=\"https://www.blognone.com/node/133775\">Codey ที่พัฒนาต่อจากโมเดลภาษา PaLM 2</a> แต่เมื่อ<a href=\"https://www.blognone.com/node/138116\">กูเกิลอัพเกรดโมเดลเป็น Gemini</a> เรียบร้อยแล้ว ทำให้ IDX เปลี่ยนมาใช้ Gemini ตามมาด้วย</p>\n<p>ฟีเจอร์ AI ช่วยเขียนโค้ดของ IDX มีตั้งแต่ inline AI assistant คือช่วยแก้หรือเติมโค้ดลงในบรรทัดที่กำลังเขียนโดยตรง, การมีแชทบ็อทช่วยถามตอบเรื่องโค้ด, และการให้ AI ช่วยเขียนคอมเมนต์หรืออธิบายโค้ดในจุดที่ต้องการ</p>\n<p>ตัวอย่างฟีเจอร์ inline AI assistant ที่กูเกิลนำมาโชว์คือการสั่งให้เขียนโค้ดจัดการ endpoint ที่เชื่อมต่อกับ Firebase โดยระบุให้ขอ ID token และตั้งค่า UID ให้เรียบร้อย ซึ่ง Gemini ก็จะสร้างโค้ดชุดนี้มาให้เลย, ตัวอย่างอื่นคือการสั่งให้ refactor โค้ด หรือเขียน unit test ของฟังก์ชันที่ต้องการ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ef7d6ec7fd53eb1c891ce16c85bdd764.png\" /></p>\n<p>นอกจากการฝังฟีเจอร์ Gemini ลงในตัว IDX แล้ว กูเกิลยังเพิ่มฟีเจอร์ฝั่ง IDX ในการเขียนโค้ดเชื่อมต่อกับ Gemini API บนเซิร์ฟเวอร์ด้วย โดยมีเทมเพลตของ Gemini API ที่ใช้บ่อยๆ เช่น สรุปรีวิวของผู้ใช้, แปลภาษา, เขียนคำบรรยายภาพ ฯลฯ มาให้เสร็จสรรพ</p>\n<p>แน่นอนว่านี่คือผลิตภัณฑ์ของกูเกิล อ่านเจอแต่สิ่งดีๆ แล้วชีวิตย่อมไม่ได้มาง่ายๆ เพราะตอนนี้ IDX ยังเปิดให้ใช้งานแบบจำกัด อ่านเอาฟินแล้วลงทะเบียน waitlist กันไปต่อเหมือนเดิม</p>\n<p>ที่มา - <a href=\"https://developers.googleblog.com/2024/02/build-with-gemini-in-project-idx.html\">Google Developers</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/idx\">IDX</a></div><div><a href=\"/topics/gemini\">Gemini</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/development\">Development</a></div><div><a href=\"/topics/ide\">IDE</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2c96bb7a58c5db03ed91580cdd281528b9a9e0dd7c3a34672d260020897b56d4","category":"Thai"}