{"title":"Impact of marine debris on coral reef ecosystem of Palk Bay, Indian Ocean","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4160?af=R","date":1715156114000,"content":"<h2>Abstract</h2>\n<p>\nCoral reef ecosystems are highly sensitive to pollution from marine debris, especially if the regions are noted for tourism and fishing. Palk Bay on the south east coast of India is a famous tourist and fishing region, where the marine debris accumulation poses a great threat to the coastal ecosystem.\nIn this study during 2018–2020, the marine debris distribution and their interactions with coral reefs of Palk Bay were monitored from five stations. Derelict fishing gears (DFGs), including ropes (51 ± 2%) and fishing lines (43 ± 2.5%), were the dominant debris forms recorded.\nAmong the reef-forming corals, <i>Acropora</i> sp. colonies experienced maximum physical injury and mortality from DFG entanglement. Plastic materials and anchors caused considerable physical damage and tissue loss in <i>Porites</i> sp, without any mortality.\nManual debris removal as a potential debris management method was assessed by regularly removing the accumulated debris from the test reef locations of all five stations, whereas the control reef locations were left undisturbed. Test reef locations showed a significant increase in live coral cover and coral recruit density in 2020, against that in 2018, compared with the control locations. Continuous accumulation and interaction of marine debris with the coral colonies of control reef locations resulted in significant reduction of live coral cover and coral recruit density at the control reef locations.\nThis study illustrates the impact of unsustainable fishing and other anthropogenic activities such as tourism and waste disposal on coral reef ecosystems like Palk Bay. The findings of this study demonstrates that manual removal of debris is an important strategy for marine debris management in coral reef ecosystem. Considering the importance of coral reefs in the livelihood of the coastal communities, it is important to tackle the marine debris issue through regular debris removal with stakeholder participation, awareness campaigns and strict legal and management measures.\n</p>","author":"Ranith Rajamohanan Pillai, \nSenthilnathan Lakshmanan, \nMachendiranathan Mayakrishnan, \nGrinson George, \nNandini Menon","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"2c9d05937ba7888e43b249c816031d2d1ec92996ac68536beab72365f99d813b","category":"Environment"}