{"title":"Comparative transcriptomic and metabolomics analysis of modified atmosphere responses in Tribolium castaneum (Coleoptera: Tenebrionidae)","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae015/7630387?rss=1","date":1710547200000,"content":"<span><div>Abstract</div>Modified atmosphere is effective in controlling <span>Tribolium castaneum</span> Herbst, but it has adaptations. Comprehending the potential mechanism of resistance to <span>T. castaneum</span> in a modified atmosphere will help advance related management methods. This study conducted a comparative transcriptomic and metabolomic analysis to understand the physiological mechanism of <span>T. castaneum</span> in adapting to CO<sub>2</sub> stress. Results showed that there were a large number of differentially expressed genes (DEGs) in <span>T. castaneum</span> treated with different concentrations of CO<sub>2</sub>. Gene ontology (GO) analysis revealed significant enrichment of DEGs mainly in binding, catalytic activity, cell, membrane, membrane part, protein-containing complex, biological regulation, and cellular and metabolic process. Kyoto Encyclopedia of Genes and Genomes analysis showed that different treatments had different effects on the metabolic pathways of <span>T. castaneum</span>. DEGs induced by 25% CO<sub>2</sub> were involved in arginine and proline metabolism, and 50% air + 50% CO<sub>2</sub> treatment affected most kinds of metabolic pathways, mainly the signal transduction pathway, including PI3K-Akt signaling pathway, AMPK signaling pathway, neurotrophin signaling pathway, insulin signaling pathway, and thyroid hormone signaling. Ribosome and DNA replication were enriched under high CO<sub>2</sub> stress (75% and 95%). The metabolomics revealed that different concentrations of CO<sub>2</sub> treatments might inhibit the growth of <span>T. castaneum</span> through acidosis, or they may adapt to anoxic conditions through histamine and N-acetylhistamine. Multiple analyses have shown significant changes in histamine and N-acetylhistamine levels, as well as their associated genes, with increasing CO<sub>2</sub> concentration. In conclusion, this study comprehensively revealed the molecular mechanism of <span>T. castaneum</span> responding to CO<sub>2</sub> stress and provided the basis for an effectively modified atmosphere in the <span>T. castaneum</span>.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"2c9f8cd968f170dde44ed6f57cf6aaa6c53c99bb844e97d33ad1dae583c5017a","category":"Environment"}