{"title":"An uncertainty‐based evaluation of sulphuric compounds transport in reservoirs considering sensitivity analysis","link":"https://onlinelibrary.wiley.com/doi/10.1111/wej.12953?af=R","date":1727923417000,"content":"<h2>Abstract</h2>\n<p>Deepwater bodies such as dam reservoirs are among the most prominent water resources that supply societies' water demand. Hence, water quality in these resources requires continuous and meticulous monitoring. This study evaluated the water quality of Changuleh Dam, a dam under construction in western Iran, using the CE-QUAL-W2 model to predict fluctuations in sulphate (SO<sub>4</sub>\n<sup>2−</sup>) and hydrogen sulphide (H<sub>2</sub>S) concentrations. A sensitivity analysis was conducted to assess the dependence of model outputs on input variables. Additionally, an uncertainty analysis was performed using MATLAB to address the inherent uncertainties of the input variables through an ARIMA (2, 2, 1) time series model and Monte Carlo simulations. The results indicated a high sulphate concentration averaging 955.6 mg/l, considerably exceeding the drinking water standard of 400 mg/l, identifying the reservoir as a sulphate-rich water resource. Seasonal fluctuations of H<sub>2</sub>S concentrations were also observed in the reservoir's anaerobic bed sediments, peaking at 87 mg/l. The sensitivity analysis showed that nitrate and total dissolved solids (TDS) varied more noticeably than dissolved oxygen (DO) at different depths, with the greatest variation at 50 m. This study highlights the critical need for continuous and meticulous monitoring of water quality in dam reservoirs to meet water supply standards.</p>","author":"Fatemeh Gholizadeh, \nAmin Zeynolabedin, \nMassoud Behboudian","siteTitle":"Wiley: Water and Environment Journal: Table of Contents","siteHash":"b8106c59269b0bf6595ebcba72d4376e8b07e3df9f0e7d2a7b1cfbc109aa602a","entryHash":"2ca2c168e0d072adb55b2fdc2915c7fc8cd577d85604f9f5c27d48fd24e38201","category":"Environment"}