{"title":"Comparison between nano-Hydroxyapatite/ Beta-Tricalcium Phosphate Composite and Autogenous Bone Graft in Bone Regeneration Applications: Biochemical Mechanisms and Morphological Analysis","link":"https://www.preprints.org/manuscript/202410.1932/v1","date":1729782179000,"content":"It was assumed that only autogenous bone had appropriate osteoconductive and osteoindutive properties for bone regeneration, but this assumption has been challenged. Many studies have shown that synthetic biomaterials must be considered as the best choice for bone guided regeneration.  The objective of this work is to compare the performances of nano-hydroxyapatite/β-Tricalcium phosphate (n-HA/β-TCP) composite and autogenous bone graft in bone regeneration applications. Th composite was characterized by scanning electron microscopy (SEM) and used as an allograft in bone defects made in adult Wistar rats. The bone defects in the dorsal cranium were grafted with autogenous bone on one side and the n-HA/β-TCP composite on the other. Histomorphometry evaluation by different staining methods (Goldner trichrome, PAS, Sirius red) and TRAP histochemistry were performed. The immunohistomorphometries to OPN, Cathepsin-K, TRAP, Acid phosphatase, VEGF, NFκ-β, MMP-2, MMP-9, and TGF-β were carried out. The RT-PCR method to RANK-L, Osteocalcine, Alcaline Phosphatase, Osterix, and Runx2 were conducted as well. The results showed that all morphometric evaluations on the different staining methods, histochemistry and immunohistochemistry, VEGF and NFκ-β, were higher on the n-HA/β-TCP composite group than in the autogenous bone graft group. The RT-PCR markers were higher in the autogenous bone group than on the n-HA/β-TCP composite group. The n-HA/β-TCP composite exhibited enhanced cell-matrix interactions in bone remodeling, higher adhesion, proliferation, and differentiation, and increased vascularization. These results suggests that the n-HA/β-TCP composite induces faster bone formation than autogenous bone.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2ca74128a8f4908ff659039eadc9b37e207ee938ddeb740caebe9b3dcfbb52ae","category":"Interdisciplinary"}