{"title":"WhatsApp Says It Would Leave UK If Government Tried to Weaken Encryption","link":"https://www.macrumors.com/2023/03/09/whatsapp-exit-uk-encryption-weakened/","date":1678376438000,"content":"WhatsApp would exit the U.K. market rather than be in thrall to the government's proposed Online Safety Bill if it undermined the app's end-to-end encryption, the platform's chief has said (via <em><a href=\"https://www.bbc.co.uk/news/technology-64863448\">BBC News</a></em>).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/03/Whatsapp-Feature.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nEnd-to-end encryption ensures that only the user and the person they are communicating with can read or listen to what is sent, and nobody in between, not even Meta/Facebook, can gain access to this content. However, the government, and some child-protection charities, argue that such encryption hinders efforts to combat the growing problem of online child abuse.\r<br />\n\r<br />\nUnder the bill, the government could force WhatsApp to apply content moderation policies that are impossible to implement without removing end-to-end encryption. If WhatsApp refused to do so, it could face fines of up to 4 percent of its parent company Meta's annual turnover.\r<br />\n\r<br />\nBut speaking during a U.K. visit in which he will meet legislators to discuss the government's internet regulation, Meta's head of WhatsApp, Will Cathcart, said it would refuse to comply if asked to weaken its encryption, since it would do so for all users.\r<br />\n<blockquote>\"Our users all around the world want security - 98% of our users are outside the U.K., they do not want us to lower the security of the product,\" he said, adding that the app would rather accept being blocked in the U.K. \"We've recently been blocked in Iran, for example. We've never seen a liberal democracy do that.\"</blockquote>Encrypted messaging app Signal's president Meredith Whittaker also recently said it \"would absolutely, 100% walk\" and halt its service in the U.K. if the bill required it to scan messages.\r<br />\n\r<br />\nAsked if he would go as far as Signal, Cathcart told the <em>BBC</em>: \"We won't lower the security of WhatsApp. We have never done that - and we have accepted being blocked in other parts of the world.\" \r<br />\n\r<br />\n\"When a liberal democracy says, 'Is it OK to scan everyone's private communication for illegal content?' that emboldens countries around the world that have very different definitions of illegal content to propose the same thing,\" Cathcart said.\r<br />\n\r<br />\nWhatsApp is the most popular messaging platform in the U.K., used by more than seven in 10 adults who are online, according to communication regulator Ofcom.\r<br />\n\r<br />\nThe U.K. government's <a href=\"https://bills.parliament.uk/bills/3137\">Online Safety Bill</a> is expected to return to parliament this summer.<div>Tags: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a>, <a href=\"https://www.macrumors.com/guide/encryption/\">Encryption</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/09/whatsapp-exit-uk-encryption-weakened/\">WhatsApp Says It Would Leave UK If Government Tried to Weaken Encryption</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whatsapp-says-it-would-leave-uk-if-government-tried-to-weaken-encryption.2383230/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2ca790dabc2aeb02941124ea5a02f26993eb2fd18cff0bb32d16ef","category":"Apple"}