{"title":"Assessment of the divergent influence of natural and non-seasonal hydrological fluctuations on functional traits and niche characteristics of plant guilds along the Xiangxi River, China","link":"https://www.preprints.org/manuscript/202406.1634/v1","date":1719222058000,"content":"The reservoir water level fluctuation zones (RWLFZs) and the natural riparian zones (NRZs) are two riparian ecosystems with the dramatically opposite hydrological rhythms which notably influence the plant guilds. However, little is known about the discrepancy of functional traits and niche characteristics of plant guilds in the RWLFZ and NRZ under different flooding rhythms. Here the RWLFZs (degraded riparian zones) and NRZs were chosen in the Xiangxi River Basin of the Three Gorges Reservoir (TGR) to investigate the variation in plant community structure, the spatial patterns of diversity, key functional traits and niche characteristics of dominant plant populations. The results showed that a total of 78 vascular plant species were identified in the riparian zones of Xiangxi River Basin. Most of the dominant species were annual herbs in the two riparian ecosystems and the percentage of annual dominant species increased from 65.79% in the NRZ to 67.34% in the RWLFZ. Compared with the NRZ, the specific leaf area, vegetation coverage and the aboveground biomass in the RWLFZ significantly increased by 74%, 27% and 19.6% respectively, while the water use efficiency of the RWLFZ decreased by 59.6% and there was no significant difference in the net photosynthetic rate between them, which showed that annuals in the RWLFZ adopt the R adaptation strategy with fast-growing, short lifespan and quickly acquiring and investing resources by altering leaf morphology such as expanding leaf area. The Simpson dominance index of RWLFZ was significantly higher than that of NRZ. Thus counter-seasonally hydrological alterations had the significant effects on functional traits of dominant species in the RWFLZ. Moreover, the highly adaptable and widely distributed species with larger niche breadths and high important values usually had a higher niche overlap value in the RWLFZ than in the NRZ, which showed that the competition in the plant community after experiencing anti-seasonal flooding was much more intraspecific than interspecific and would facilitate the expansion of species niches. And the distribution of the plant community was mainly driven by elevation (flooding depth), flooding duration and TK in the WLFZs. Our findings imply that the species with large niche breadths and high important values should be prioritized in ecological restoration efforts in the newly formed hydro-fluctuation zone of the TGR.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2cad44bbd5899094b53b721b54fd9464f9fd98564169cb1ef2ab21962c34165c","category":"Interdisciplinary"}