{"title":"Apple teases WWDC announcements by inviting VR outlets","link":"https://www.macworld.com/article/1929455/apple-teases-wwdc-announcements-inviting-vr-outlets.html","date":1684931423000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Officially Apple hasn’t told us what it will be announcing at <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC 2023</a> on June 5, but there are clues if you know where to look. The latest and most blatant of these is the fact that a number of XR (or ‘extended reality’) publications have been invited to the keynote for the first time.</p>\n\n\n\n<p>On Tuesday, the industry news site <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.roadtovr.com/apple-invites-xr-media-outlets-wwdc-keynote/amp/&amp;xcust=1-1-1929455-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Road To VR</a> revealed that it had been invited to attend Apple’s summer event in person, and that fellow XR site <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.uploadvr.com/uploadvr-attending-apple-wwdc-keynote-event/&amp;xcust=1-1-1929455-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">UploadVR</a> had too. Neither site has gone to WWDC previously, and the former notes that “Apple has historically not invited XR media to its events, let alone commented in any way on its XR R&amp;D.”</p>\n\n\n\n<p>XR encompasses three categories of technology: virtual reality, augmented reality, and mixed reality, which covers hybrid devices that deliver both the previous types. Apple’s rumored <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Reality Pro headset</a> is expected to sit in the third category, with a Digital Crown-style dial to switch seamlessly between VR and AR.</p>\n\n\n\n<p>Reality Pro has reportedly been in development hell for years, and multiple times it has been expected to launch imminently only to hit a delay at the last moment. Most recently, the headset was widely expected to be the central attraction at Apple’s spring 2023 event; the fact that it wasn’t ready in time may explain why the company decided not to have a spring event at all.</p>\n\n\n\n<p>(Incidentally, if Apple’s design team had their way, the headset wouldn’t be launching before 2024 at the earliest. They are understood to have told Tim Cook that the technology wasn’t ready yet, but he <a href=\"https://www.macworld.com/article/1655723/ar-vr-headset-2023-launch-design-team-tim-cook.html\">overruled them</a>.)</p>\n\n\n\n<p>But now, surely, the time has come. The <a href=\"https://www.macworld.com/article/1918145/apple-trademarks-xros-logo-reality-pro-headset-launch.html\">trademarks</a> have been registered, the XR reporters are booking their flights, and the project’s <a href=\"https://www.macworld.com/article/1925364/apple-reality-headset-team.html\">key players</a> are rehearsing their lines. This isn’t a drill. It’s actually happening, people.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2cb11a1a2d7216b640f81df754244be0e51ed82ace14d570faab14451ebea2fe","category":"Apple"}