{"title":"Apple Releases iOS 17.2 With Journal App and More","link":"https://www.macrumors.com/2023/12/11/apple-releases-ios-17-2-and-ipados-17-2/","date":1702317684000,"content":"Apple today released iOS 17.2 and iPadOS 17.2, the second major updates to the <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> and <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a> operating systems that came out in September. The new software comes over a month after Apple released iOS 17.1 and iPadOS 17.1, updates that brought new AirDrop, StandBy, and <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> features.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/New-iOS-17.2-Features.jpg\" width=\"2500\" height=\"1406\" />\r<br />\niOS 17.2 and iPadOS 17.2 can be downloaded on eligible iPhones and iPads over-the-air by going to Settings &gt; General &gt; Software Update. Apple has also released an iOS 16.7.3 update for those who are unable to update to ‌iOS 17‌.\r<br />\n\r<br />\nThe iOS 17.2 update includes the new Journal app, which is designed to allow iOS users to record key moments in their lives. The Journal app includes journaling suggestions, scheduled notifications, and options for adding photos, locations, and more.\r<br />\n\r<br />\nFor the <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> models, iOS 17.2 adds a Translate option for the Action Button, which activates the Translate app for conversing with someone in another language. There's also now an option to record spatial video that will be viewable on the <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> headset in 3D.\r<br />\n\r<br />\nIn the Messages app, there's a catch-up arrow for jumping to the first unread message in a conversation, and an option to add stickers to chat bubbles through the tapback menu. There are new Weather and Clock widgets, support for accessing <a href=\"https://www.apple.com/newsroom/2023/12/siri-can-now-help-users-access-and-log-their-health-app-data/\">Health data through Siri</a>, a Favorite Songs playlist in ‌Apple Music‌, and more.\r<br />\n\r<br />\nApple's full release notes for the update are below.<blockquote>This update introduces Journal, an all-new way to reflect on life's moments and preserve your memories. This release also includes Action button and Camera enhancements, as well as other features, bug fixes, and security updates for your iPhone.\r<br />\n\r<br />\nJournal\r<br />\n- Journal is a new app that lets you write about the small moments and big events in your life so you can practice gratitude and improve your wellbeing\r<br />\n- Journaling suggestions make it easy to remember your experiences by intelligently grouping your outings, photos, workouts, and more into moments you can add to your journal\r<br />\n- Filters let you quickly find bookmarked entries or show entries with attachments so you can revisit and reflect on key moments in your life\r<br />\n- Scheduled notifications help you keep a consistent journaling practice by reminding you to write on the days and time you choose\r<br />\n- Option to lock your journal using Touch ID or Face ID\r<br />\niCloud sync keeps your journal entries safe and encrypted on iCloud\r<br />\n\r<br />\nAction Button\r<br />\n- Translate option for the Action button on iPhone 15 Pro and iPhone 15 Pro Max to quickly translate phrases or have a conversation with someone in another language\r<br />\n\r<br />\nCamera\r<br />\n- Spatial video lets you capture video on iPhone 15 Pro and iPhone 15 Pro Max so you can relive your memories in three dimensions on Apple Vision Pro\r<br />\n- Improved Telephoto camera focusing speed when capturing small faraway objects on iPhone 15 Pro and iPhone 15 Pro Max\r<br />\n\r<br />\nMessages\r<br />\n- Catch-up arrow lets you easily jump to your first unread message in a conversation by tapping the arrow visible in the top-right corner\r<br />\n- Add sticker option in the context menu lets you add a sticker directly to a bubble\r<br />\n- Memoji updates include the ability to adjust the body shape of any Memoji\r<br />\n- Contact Key Verification provides automatic alerts and Contact Verification Codes to help verify people facing extraordinary digital threats are messaging only with the people they intend\r<br />\n\r<br />\nWeather\r<br />\n- Precipitation amounts help you stay on top of rain and snow conditions for a given day over the next 10 days\r<br />\n- New widgets let you choose from next-hour precipitation, daily forecast, sunrise and sunset times, and current conditions such as Air Quality, Feels Like, and wind speed\r<br />\n- Wind map snapshot helps you quickly assess wind patterns and access the animated wind map overlay to prepare for forecasted wind conditions for the next 24 hours\r<br />\n- Interactive moon calendar lets you easily visualize the phase of the moon on any day for the next month\r<br />\n\r<br />\nThis update also includes the following improvements and bug fixes:\r<br />\n- Siri support for privately accessing and logging Health app data using your voice\r<br />\n- AirDrop improvements including expanded contact sharing options and the ability to share boarding passes, movie tickets, and other eligible passes by bringing two iPhones together\r<br />\n- Favorite Songs Playlist in Apple Music lets you quickly get back to the songs you mark as favorites\r<br />\n- Use Listening History in Apple Music can be disabled in a Focus so music you listen to does not appear in Recently Played or influence your recommendations\r<br />\n- A new Digital Clock Widget lets you quickly catch a glimpse of the time on your Home Screen and while in StandBy\r<br />\n- Enhanced AutoFill identifies fields in PDFs and other forms enabling you to populate them with information such as names and addresses from your contacts\r<br />\n- New keyboard layouts provide support for 8 Sámi languages\r<br />\n- Sensitive Content Warning for stickers in Messages prevents you from being unexpectedly shown a sticker containing nudity\r<br />\n- Qi2 charger support for all iPhone 13 models and iPhone 14 models\r<br />\n- Fixes an issue that may prevent wireless charging in certain vehicles\r<br />\n\r<br />\nSome features may not be available for all regions or on all Apple devices. For information on the security content of Apple software updates, please visit this website:\r<br />\nhttps://support.apple.com/kb/HT201222</blockquote>\r<br />\nFollowing iOS 17.2, most of the features that Apple first announced for ‌iOS 17‌ in June are now available.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/11/apple-releases-ios-17-2-and-ipados-17-2/\">Apple Releases iOS 17.2 With Journal App and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-ios-17-2-with-journal-app-and-more.2413388/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2cb81651dd9d84c64a886673531bf0c3e9f217903559a498bbe519678de525b5","category":"Apple"}