{"title":"Modeling Shiga toxin-induced human renal-specific microvascular injury","link":"https://academic.oup.com/ib/article/doi/10.1093/intbio/zyae001/7585571?rss=1","date":1705968000000,"content":"<span><div>Abstract</div>Shiga toxin (Stx) causes significant renal microvascular injury and kidney failure in the pediatric population, and an effective targeted therapy has yet to be demonstrated. Here we established a human kidney microvascular endothelial cell line for the study of Stx mediated injuries with respect to their morphologic, phenotypic, and transcriptional changes, and modeled Stx induced thrombotic microangiopathy (TMA) in flow-mediated 3D microvessels. Distinct from other endothelial cell lines, both isolated primary and immortalized human kidney microvascular endothelial cells demonstrate robust cell-surface expression of the Stx receptor Gb3, and concomitant dose-dependent toxicity to Stx, with significant contributions from caspase-dependent cell death. Use of a glucosylceramide synthase inhibitor (GCSi) to target disruption of the synthetic pathway of Gb3 resulted in remarkable protection of kidney microvascular cells from Stx injury, shown in both cellular morphologies, caspase activation and transcriptional analysis from RNA sequencing. Importantly, these findings are recapitulated in 3D engineered kidney microvessels under flow. Moreover, whole blood perfusion through Stx-treated microvessels led to marked platelet binding on the vessel wall, which was significantly reduced with the treatment of GCSi. These results validate the feasibility and utility of a bioengineered <span>ex vivo</span> human microvascular model under flow to recapitulate relevant blood-endothelial interactions in STEC-HUS. The profound protection afforded by GCSi demonstrates a preclinical opportunity for investigation in human tissue approximating physiologic conditions. Moreover, this work provides a broad foundation for novel investigation into TMA injury pathogenesis and treatment.<div><strong>Insight Box:</strong> Shiga toxin (Stx) causes endothelial injury that results in significant morbidity and mortality in the pediatric population, with no effective targeted therapy. This paper utilizes human kidney microvascular cells to examine Stx mediated cell death in both 2D culture and flow-mediated 3D microvessels, with injured microvessels also developing marked platelet binding and thrombi formation when perfused with blood, consistent with the clinical picture of HUS. This injury is abrogated with a small molecule inhibitor targeting the synthetic pathway of the Shiga toxin receptor. Our findings shed light onto Stx-induced vascular injuries and pave a way for broad investigation into thrombotic microangiopathies.</div></span>","author":"","siteTitle":"Integrative Biology Current Issue","siteHash":"08ec31a93e0a3f830088f3051f0870206dac7048d685312e4717ea0a4882ca75","entryHash":"2cb9ba349c8b02c9ba851f195afe902c7f99e6ef64126d7e1754c13e927ec69e","category":"Environment"}