{"title":"77 Differences in carcass quality and meat quality between cattle of different breed types","link":"https://academic.oup.com/jas/article/102/Supplement_3/222/7757342?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Crossbreeding cattle in the beef industry is a common practice to improve production and increase profitability. Introducing <span>Bos indicus</span> (BI) genetics into cattle herds is one potential method to improve production, as they are able to withstand higher temperatures, are better adapted to nutritional stress, and consume less water than <span>Bos taurus</span> (BT) cattle. However, introduction of BI genetics is known to decrease both carcass and meat quality compared with those from BT cattle. As such, the objective of this study was to determine how crossbreeding commercial Angus cows with Santa Gertrudis bulls to incorporate BI genetics impacts carcass and meat quality of the resultant offspring. This study utilized 38 steers of two different breeds: Angus (AN; n = 29; 100% BT) or Santa Gertrudis influenced (SG; n = 9; 19% BI, 81% BT). All steers were fed the same typical ration and harvested at a commercial facility once industry average body weight and backfat standards were met. Hot carcass weight (HCW), ribeye area (REA), yield grade (YG), and marbling scores were collected at harvest. Individual loins were collected for meat quality analysis. Meat quality data were collected after 14 d of wet aging at 4˚C. Meat color data was collected on d 0, 3, and 7. Statistical analysis was done using the MIXED procedure of SAS to assess the main effect of breed. Color analysis was conducted with day as a repeated measure. Least squares means were separated using Tukey-Kramer adjustments. Angus cattle had an increased (<span>P</span> = 0.009) REA and tended to have a reduced (<span>P</span> = 0.06) YG than SG cattle. However, no differences (<span>P</span> ≥ 0.13) between breeds were observed in HCW or marbling score. Additionally, no differences (<span>P</span> ≥ 0.08) were observed in meat quality (pH, drip loss, cook loss, Warner-Bratzler Shear Force, or Texture Profile Analysis) between breeds. There was not a day x breed (<span>P</span> &gt; 0.65) or breed (<span>P</span> ≥ 0.57) effect for L*, a*, or b* color values. Day affected (<span>P</span> = 0.008) L*, a*, and b*, such that a* and b* both increased on d 3, then decreased on d 7, while L* increased on d 3 and remained consistent until d 7. These results are promising as they indicate there may not be differences in carcass quality and meat quality when utilizing this method to introduce BI genetics into a traditional BT production system. As such, this could be a useful tool in managing production systems in our beef herds. However, future research with a larger sample size will be necessary to gain more conclusive results.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2cc4422d9a51da810428493a763952e346a9fb8a431a505a41f3b2b5054c5b5b","category":"Environment"}