{"title":"The phosphatidylethanolamine-binding proteins OsMFT1 and OsMFT2 regulate seed dormancy in rice","link":"https://academic.oup.com/plcell/article/36/9/3857/7718470?rss=1","date":1721692800000,"content":"<span><div>Abstract</div>Seed dormancy is crucial for optimal plant life-cycle timing. However, domestication has largely diminished seed dormancy in modern cereal cultivars, leading to challenges such as preharvest sprouting (PHS) and subsequent declines in yield and quality. Therefore, it is imperative to unravel the molecular mechanisms governing seed dormancy for the development of PHS-resistant varieties. In this study, we screened a mutant of <span>BASIC HELIX-LOOP-HELIX TRANSCRIPTION FACTOR4</span> (<span>OsbHLH004</span>) with decreased seed dormancy and revealed that OsbHLH004 directly regulates the expression of <span>9-CIS-EPOXYCAROTENOID DIOXYGENASE3</span> (<span>OsNCED3</span>) and <span>GIBBERELLIN 2-OXIDASE6</span> (<span>OsGA2ox6</span>) in rice (<span>Oryza sativa</span>). Additionally, we determined that two phosphatidylethanolamine-binding proteins, MOTHER OF FT AND TFL1 and 2 (OsMFT1 and OsMFT2; hereafter OsMFT1/2) interact with OsbHLH004 and Ideal Plant Architecture 1 (IPA1) to regulate their binding capacities on <span>OsNCED3</span> and <span>OsGA2ox6</span>, thereby promoting seed dormancy. Intriguingly, FT-INTERACTING PROTEIN1 (OsFTIP1) interacts with OsMFT1/2 and affects their nucleocytoplasmic translocation into the nucleus, where OsMFT1/2–OsbHLH004 and OsMFT1/2–IPA1 antagonistically modulate the expression of <span>OsNCED3</span> and <span>OsGA2ox6</span>. Our findings reveal that OsFTIP1-mediated inhibition of nuclear translocation of OsMFT1/2 and the dynamic transcriptional modulation of <span>OsNCED3</span> and <span>OsGA2ox6</span> by OsMFT1/2–OsbHLH004 and OsMFT1/2–IPA1 complexes in seed dormancy in rice.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"2cc8bf3744259341bafe75f92cd51080e5529a2f5a8ab7e5a1579cae638acc2b","category":"Environment"}