{"title":"Deep recognition of rice disease images: how many training samples do we really need?","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13636?af=R","date":1718439308000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>With the rapid development of deep learning, the recognition of rice disease images using deep neural networks has become a hot research topic. However, most previous studies only focus on the modification of deep learning models, while lacking research to systematically and scientifically explore the impact of different data sizes on the image recognition task for rice diseases. In this study, a functional model was developed to predict the relationship between the size of dataset and the accuracy rate of model recognition.</p>\n<h2>RESULTS</h2>\n<p>Training VGG16 deep learning models with different quantities of images of rice blast-diseased leaves and healthy rice leaves, it was found that the test accuracy of the resulting models could be well fitted with an exponential model (<i>A</i> = 0.9965 − <i>e</i>\n<sup>(−0.0603×I50−1.6693)</sup>). Experimental results showed that with an increase of image quantity, the recognition accuracy of deep learning models would show a rapid increase at first. Yet when the image quantity increases beyond a certain threshold, the accuracy of image classification would not improve much, and the marginal benefit would be reduced. This trend remained similar when the composition of the dataset was changed, no matter whether (i) the disease class was changed, (ii) the number of classes was increased or (iii) the image data were augmented.</p>\n<h2>CONCLUSIONS</h2>\n<p>This study provided a scientific basis for the impact of data size on the accuracy of rice disease image recognition, and may also serve as a reference for researchers for database construction. © 2024 Society of Chemical Industry.</p>","author":"Huiru Zhou, \nDong Huang, \nBo Ming Wu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"2ccb93d6070644756f24ad262b5201895514a9d5c0812fec2750d19fcddb9bdb","category":"Environment"}