{"title":"The Impact of a Structured Physical Exercise Program after Bariatric Surgery (RYGB) on PROMs &ndash; Health-Related Quality of Life (SarQoL) &ndash; in Patients with Preoperative Obesity and Sarcopenia","link":"https://www.preprints.org/manuscript/202408.2171/v1","date":1724980842000,"content":"(1) Background: Sarcopenia, a condition characterized by a decrease in muscle mass and strength, is very common in patients with obesity and can be aggravated by bariatric surgery, potentially compromising the clinical results of surgery. There is increasing interest in pa-tient-reported outcome measures (PROMs) to assess results in other health variables that may be especially important for individual patients. The role of exercise in enhancing health-related quality of life (HRQoL) after surgery remains underexplored. This study investigated the impact of exercise on HRQoL in bariatric sarcopenic patients via the Sarcopenia Quality of Life (SarQoL) questionnaire. (2) Method: Candidates for surgery took part in the EXPOBAR program and were randomized into experimental and control groups. The intervention lasted 16 weeks, starting one month after surgery, and included combined aerobic and resistance exercise. Outcomes, including body composition and physical fitness parameters, were measured before and after the intervention. All participants underwent gastric bypass surgery (RYGB). (3) Results: The baseline characteristics of the participants were not significantly different between the two groups. All patients met the criteria for moderate/severe obesity and the EASO/ESPEN criteria for sarcopenia, namely, reduced muscle strength assessed by grip strength and reduced muscle mass assessed by the ASMM score/weight. After completing the study protocol, patients in both groups had increased HRQoL, but the increase was significantly greater in the intervention group than in the control group. (4) Conclusion: Our findings suggest that exercise plays a crucial role in improving both physical and psychological well-being in postbariatric patients, highlighting the need to integrate structured exercise programs in post-surgery care. This study was prospectively registered at Clinicaltrials.gov (NCT03497546).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2cd0182eefca3826202cd83aa3306e475be0e149f91d80040ef4cffe907815aa","category":"Interdisciplinary"}