{"title":"Natural magnetite as an effective and long-lasting catalyst for CWPO of azole pesticides in a continuous up-flow fixed-bed reactor","link":"http://link.springer.com/10.1007/s11356-024-33065-8","date":1712102400000,"content":"<h3>Abstract</h3>\n                  <p>The global occurrence of micropollutants in water bodies has raised concerns about potential negative effects on aquatic ecosystems and human health. EU regulations to mitigate such widespread pollution have already been implemented and are expected to become increasingly stringent in the next few years. Catalytic wet peroxide oxidation (CWPO) has proved to be a promising alternative for micropollutant removal from water, but most studies were performed in batch mode, often involving complex, expensive, and hardly recoverable catalysts, that are prone to deactivation. This work aims to demonstrate the feasibility of a fixed-bed reactor (FBR) packed with natural magnetite powder for the removal of a representative mixture of azole pesticides, recently listed in the EU Watch Lists. The performance of the system was evaluated by analyzing the impact of H<sub>2</sub>O<sub>2</sub> dose (3.6–13.4 mg L<sup>−1</sup>), magnetite load (2–8 g), inlet flow rate (0.25–1 mL min<sup>−1</sup>), and initial micropollutant concentration (100–1000 µg L<sup>−1</sup>) over 300 h of continuous operation. Azole pesticide conversion values above 80% were achieved under selected operating conditions (<em>W</em><sub>Fe3O4</sub> = 8 g, [H<sub>2</sub>O<sub>2</sub>]<sub>0</sub> = 6.7 mg L<sup>−1</sup>, flow rate = 0.5 mL min<sup>−1</sup>, pH<sub>0</sub> = 5, <em>T</em> = 25 °C). Notably, the catalytic system showed a high stability upon 500 h in operation, with limited iron leaching (&lt; 0.1 mg L<sup>−1</sup>). As a proof of concept, the feasibility of the system was confirmed using a real wastewater treatment plant (WWTP) effluent spiked with the mixture of azole pesticides. These results represent a clear advance for the application of CWPO as a tertiary treatment in WWTPs and open the door for the scale-up of FBR packed with natural magnetite.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"2ce36c11debd79fc9a624119f2def451469e668fa327906ac7c441900d4fda8d","category":"Environment"}