{"title":"Spiders are much smarter than you think","link":"https://arstechnica.com/?p=1808930","date":1635592555000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-120464542-2-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-120464542-2.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/portrait-of-jumping-spider-royalty-free-image/120464542?adppopup=true\">xbn83 / Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>People tend to associate intelligence with brain size. And as a general guideline, this makes sense: more brain cells, more mental capabilities. Humans, and many of the other animals we’ve come to think of as unusually bright, such as chimpanzees and dolphins, all have large brains. And it’s long been assumed that the smallest brains simply don’t have the capacity to support complex mental processes. But what if they do?</p>\n<p>The vast majority of Earth’s animal species are rather small, and a vanishingly small portion of them have been studied at all, much less by cognition researchers. But the profile of one group of diminutive animals is rapidly rising as scientists discover surprisingly sophisticated behaviors among them.</p>\n<p>“There is this general idea that probably spiders are too small, that you need some kind of a critical mass of brain tissue to be able to perform complex behaviors,” says arachnologist and evolutionary biologist Dimitar Dimitrov of the University Museum of Bergen in Norway. “But I think spiders are one case where this general idea is challenged. Some small things are actually capable of doing very complex stuff.”</p></div><p><a href=\"https://arstechnica.com/?p=1808930#p3\">Read 28 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1808930&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2cefe487dcfec190c60b2c06e9f768e66cd595059de5b46436cab1946fb19965","category":"Tech"}