{"title":"Hot water mobilizes the metabolism of energy, soluble sugar, cell wall, and phenolics to cope with chilling injury in postharvest snap beans","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13662?af=R","date":1718960073000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Snap beans (<i>Phaseoulus vulgaris</i> L.) are very sensitive to low temperature during postharvest storage. Pitting, rusting, and water-soaked patches are typical chilling injury (CI) symptoms of snap beans. The appearance of these symptoms reduces the storage quality of snap beans. The energy, soluble carbohydrates, cell wall, and phenolic metabolisms of refrigerated snap beans and their relationship to CI treated with 35 °C hot water (HW) were investigated.</p>\n<h2>RESULTS</h2>\n<p>HW treatment reduced CI index and electrolyte leakage and increased the contents of soluble solids, titratable acidity, and chlorophyll. HW treatment maintained higher activities of proton ATPase, calcium ATPase, and cytochrome <i>c</i> oxidase, which resulted in the accumulation of more adenosine triphosphate, adenosine diphosphate, and energy charge. The accumulation of soluble sugar induced by HW treatment was correlated with the stimulation of sucrose phosphate synthase and sucrose synthase. The prevention effect of HW treatment on the degradation of cell wall components was related to the inhibition of pectin methylesterase and cellulase. HW-induced phenol accumulation is associated with an increase in shikimate dehydrogenase, phenylalanine ammonia lyase, cinnamate-4-hydroxylase, and 4-coumarine-coenzyme A ligase, as well as a decrease in polyphenol oxidase.</p>\n<h2>CONCLUSION</h2>\n<p>The alleviating effect of HW on CI is due to its regulation of energy, soluble sugar, cell wall, and phenolic metabolism. Therefore, HW treatment may be an effective means to reduce CI of snap beans. © 2024 Society of Chemical Industry.</p>","author":"Na Lv, \nHaoyan Zhang, \nHongtao Zhou, \nCaiping Wang, \nChangjie Guo, \nLiyan Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"2d005d31a5b460e96beffd319e430c49bd1318e4bf3e56827caa73a1e1d77956","category":"Environment"}