{"title":"Non-gas giant has 73 times Earth’s mass, bewildering its discoverers","link":"https://arstechnica.com/?p=1964288","date":1693410948000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/image-8-800x450.jpeg\" alt=\"Artist's conception of a massive planet near a star.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/image-8.jpeg\">Enlarge</a> (credit: <a href=\"https://exoplanets.nasa.gov/news/1714/discovery-alert-massive-planet-is-a-hulk-among-super-earths/\">NASA/JPL-Caltech</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Scientists have been working on models of planet formation since before we knew exoplanets existed. Originally guided by the properties of the planets in our Solar System, these models turned out to be remarkably good at also accounting for exoplanets without an equivalent in our Solar System, like super Earths and hot Neptunes. Add in the ability of planets to move around thanks to gravitational interactions, and the properties of exoplanets could usually be accounted for.</p>\n<p>Today, a large international team of researchers is announcing the discovery of something our models can't explain. It's roughly Neptune's size but four times more massive. Its density—well above that of iron—is compatible with either the entire planet being almost entirely solid or it having an ocean deep enough to drown entire planets. While the people who discovered it offer a couple of theories for its formation, neither is especially likely.</p>\n<h2>A freakish outlier</h2>\n<p>The study of the new planet started as many now do: It was identified as an object of interest by the Transiting Exoplanet Survey Satellite (TOI, for TESS Object of Interest). TOI-1853 is a star somewhat smaller than our Sun, with about 0.8 times its mass. And there were clear indications of a planet near the star, now called TOI-1853 b. The planet orbits quite close to its host star, completing a full orbit in 1.24 days.</p></div><p><a href=\"https://arstechnica.com/?p=1964288#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1964288&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2d0223a0ec87fff05704fd6eacaaa292d1ca31f32ff901b865e5f72f4493afe6","category":"Tech"}