{"title":"Shifts in plant‐invertebrate interactions between wild and ex situ conservation populations of a critically endangered tree","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14639?af=R","date":1717565101000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d7b0ba71-a617-4a7a-802a-e28f312fae48/jpe14639-toc-0001-m.png\" alt=\"Shifts in plant-invertebrate interactions between wild and ex situ conservation populations of a critically endangered tree\" />\n<p>Our results suggested that both herbivory and pollination of <i>Sinojackia huangmeiensis</i> changed in ex situ populations, with complete or partial changes in herbivores, leaf herbivory rate, pollinators, pollinator visiting frequency and fruit set in the two distant ex situ populations. This work provides a unique empirical study of shifts in both antagonistic and mutualistic biotic interactions between wild and ex situ populations. We emphasized that it is essential to integrate herbivore and pollinator management in future ex situ conservation of plant species.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nEx situ conservation is an effective approach to prevent the extinction of endangered species. Biotic interactions (e.g. herbivory and pollination) are critical to ex situ conservation success, including plant establishment, survival and reproduction. However, shifts in biotic interactions between wild and ex situ populations are still poorly understood.\n\nWe compared herbivory and pollination characteristics between the only wild population (WP) and three ex situ populations (LP, local population, nearby WP; NP, north population, ca. 850 km; and SP, south population, ca. 750 km) of a critically endangered tree species (<i>Sinojackia huangmeiensis</i>) to explore the latitudinal changes in plant-invertebrate interactions.\n\nLarvae of the Limacodidae family were the dominant herbivores in WP, LP and NP, while the only herbivore observed in SP was snail. Compared to WP, the leaf herbivory rate was unchanged in LP but decreased in NP and SP. Leaf defence traits (total phenols, tannins, leaf thickness and leaf dry matter content) increased or remained unchanged in the three ex situ populations. A pollinator (<i>Apis cerana</i>) of <i>S. huangmeiensis</i> was present in the four populations. NP and SP lacked some pollinators that were found in both WP and LP, but they shared one pollinator that was not observed in WP and LP. The pollinator visiting frequency increased in SP, while it did not change significantly in LP and NP.\n\n<i>Synthesis and applications</i>. Our results suggested that both herbivory and pollination of <i>Sinojackia huangmeiensis</i> changed in ex situ populations, with complete or partial changes in herbivores, leaf herbivory rate, pollinators, pollinator visiting frequency and fruit set in the two distant ex situ populations. This work provides a unique empirical study of shifts in both antagonistic and mutualistic biotic interactions between wild and ex situ populations. We emphasized that it is essential to integrate herbivore and pollinator management in future ex situ conservation of plant species.\n</p>\n<h2>摘要</h2>\n<p>\n\n迁地保护是防止濒危物种灭绝的有效手段之一。生物互作(如虫食和传粉)对迁地保护的成功(如定植、存活和繁殖)至关重要。然而，生物互作在迁地保护种群与野生种群间的变化尚未得到充分的研究。\n\n为了探索植物-动物互作在迁地和野生种群间的变化，我们比较了一种极度濒危树种(黄梅秤锤树<i>Sinojackia huangmeiensis</i>)的虫食和传粉特征在该物种唯一的野生种群和三个迁地保护种群(近地迁地种群(即邻近野生种群的迁地种群)、北方迁地种群和南方迁地种群)间的差异。\n\n野生种群、近地迁地种群和北方迁地种群的主要植食动物是 刺蛾科幼虫，而在南方迁地种群中观测到的唯一植食动物是蜗牛。与野生种群相比，近地迁地种群的叶片虫食率无显著变化，而北方和南方迁地种群的叶片虫食率均显著降低；叶片防御性状(总酚含量、丹宁含量、叶片厚度和叶片干物质含量)在三个迁地种群中显著升高或者无显著变化。只有一种传粉昆虫(中华蜜蜂<i>Apis cerana</i>)同时出现在四个种群中。北方和南方迁地种群缺失了部分在野生种群和近地迁地种群中均出现的传粉者，但是在北方和南方迁地种群中记录到一种在野生种群和近地迁地种群中均未出现的传粉昆虫。与野生种群相比，昆虫访花频率在南方迁地种群显著升高，但是在近地和北方迁地种群中无显著变化。\n\n我们的结果表明，与野生种群相比，虫食和传粉特征在北方和南方迁地种群中均有所变化，包括植食动物种类、叶片虫食率、传粉昆虫种类、访花频率和坐果率等。本研究的独特之处在于为拮抗和互利生物互作均在迁地种群和野生种群间发生变化提供实证。我们强调在未来的植物迁地保护中有必要整合虫食和传粉管理。\n</p>","author":"Shitong Wang, \nShuaishuai Song, \nJikun Liu, \nJiehua Li, \nMingxi Jiang, \nXinzeng Wei","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"2d137b80074736170c042125847bd4fdb60c07020ab8da15b62b98a10992b2bf","category":"Environment"}