{"title":"Christine O'Connell: riding to fund the future of secondary breast cancer research","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/funding-the-future-one-more-citys-christine-oconnell","date":1697123443000,"content":"\n      <p><span>Christine O’Connell is a cycling enthusiast. She trains six days a week, has a cycling coach, and travels around the world exploring and meeting new people on two wheels. But cycling is not just a hobby that she enjoys, it has a much greater meaning to her. </span></p>\n<div></div>\n<div></div>\n<p><span>“It’s my lifeline. I love it. It gives me a way to test myself other than a scan or a blood test. It is just a way to escape,” she told<em> Rouleur</em>. </span></p>\n<p>O’Connell was first diagnosed with breast cancer in 2013 and underwent treatment which saw her in remission. As a celebration, O’Connell and three of her friends cycled from London to Paris self-supported, marking the start of her campaign One More City, which raises money to fund PhD students studying secondary breast cancer. However, the following year, as she prepared for the campaign's second edition cycle, she had a seizure riding in London, uncovering a brain tumour and a secondary breast cancer diagnosis. Five years had passed since her original diagnosis in 2013, and it is commonly thought that if you are free from cancer for five years, it is unlikely it’ll come back – a fact O’Connell herself believed, too. </p>\n<p>“Breast cancer, everyone thinks, is this pink fluffy disease that is really easy to cure, and it is not a nice thing to hear that actually for 20 to 30% of cases, it’s just not curable,” she said firmly. But despite 31 women dying everyday in the UK from secondary breast cancer, it is still not understood. </p>\n<p><span>“With breast cancer, 80% of cases are curable because it doesn’t go beyond that,” she added. “But in secondary cases, it actually goes beyond the breast, and that is when it becomes terminal. Unfortunately, they can’t cure that today as they can’t work out how to control it.”</span></p>\n<p><span>Treatment for secondary cancer isn’t the same for primary. O’Connell noted that with primary cancer, people will often have surgery, chemotherapy, radiotherapy and then treatment is finished and you can leave it behind you. But with secondary, treatment is needed for life. When diagnosed with secondary cancer in 2018, the NHS had just approved a new drug that targeted a particular protein to help slow the spread of cancer. O’Connell is now in her 71st cycle and takes this pill everyday to slow down the spread of her cancer, but it will never cure it. She also has a blood test every month, scans every three months, and sees an oncologist regularly. For her, it is a never ending cycle. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/2022_Annual_Ride_Credit__One_More_City-2.jpg?v=1697118845\" /></span><em><span>For many of the riders, this is their longest ever ride</span></em></p>\n<p><span>This is where One More City’s ethos – the journey will never end – originates, and each year, O’Connell is joined by other cyclists as they ride from one city to another. “We are always progressing towards the next city,” she said. “There are always kilometres to do, more climbs to conquer and more challenges to face. Akin to any living with cancer, especially secondary cancer, for whom the challenge is never over.” </span></p>\n<p><span>It started in 2017 when they rode from Rapha’s London Clubhouse to Paris, then the following year Paris to Amsterdam, then Amsterdam to Strasbourg. Covid-19 curtailed the city-hopping route in 2020 and 2021, but did not stop O’Connell and One More City from continuing their campaign as they completed a 750km loop from London and back, and then rode from Reading the Penzance the following year. 2022 saw them pick the route back up in Strasbourg as they headed for Munich, and then this October, O’Connell and 36 other riders cycled from Munich to Venice. </span></p>\n<p><span>“The first thing to say about this year’s cycle is that it didn’t rain,” she said. “When we cycled from Paris to Amsterdam, it was like we were riding through a monsoon! But this year it was perfectly sunny. I mean, I did have everything from my summer kit to my full winter kit, mudguards, lights, just in case. </span></p>\n<p>“But, wow, was this year beautiful. We left Rapha Munich and cycled through the Bavarian countryside, crossed the border into Austria and then we did a 55km climb one day, literally from the hotel door, and headed to Venice. It was amazing. And it was also our biggest ride yet with 36 riders.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/2022_Annual_Ride_Credit__One_More_City_5.jpg?v=1697118867\" /><em>The design for one of the One More City jerseys is a print of a breast cancer cells</em></p>\n<p>Rapha has been a vital part of One More City from the very beginning when O’Connell, a Rapha Cycling Club member, approached Rapha’s founder Simon Mottram about her idea of a continuous journey. “He wouldn’t let me leave his office until we came up for a name for it,” she laughed. “Rapha has also done our One More City kit for the past five years, and two years ago, they produced a commercial collection, so we had caps, musettes, jerseys and socks, and that raised £60,000 through people buying the kit.” </p>\n<p><span>The money raised through Rapha as well as the annual rides goes towards funding PhD students who are researching secondary breast cancer. When O’Connell founded One More City, she wanted to fund students rather than lab equipment. “It’s actually funding someone’s future,” she said. “You can see exactly where the money is going, and hopefully you are funding someone’s future as a scientific talent as well, not just funding something that may be obsolete in a few years time.” </span></p>\n<p><span>So far, One More City has raised enough money for two students to be funded, with one coming to the end of her research. The second student, Hwei Minn, starts this month as a full-time PhD student at the Institute of Cancer Research (ICR). Both students' research is around a new drug that is targeting a breast cancer called triple negative which is very hard to treat and has very low survival statistics. </span></p>\n<p><span>“Being funded by One More City is a reminder about the purpose of my research and the </span><span>reason I am training to become a cancer biologist: to improve and extend the lives of those </span><span>with cancer,” said Minn ahead of her PhD starting this month. </span></p>\n<p><span>The campaign is already supporting vital research in an effort to understand and help those with secondary breast cancer and is now also close to securing funding for a third student to join ICR. O'Connell will also begin campaigning for a fourth student next year. By supporting students who are researching in nearby universities or institutions, One More City is able to hear firsthand how the research is progressing.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/2022_Annual_Ride_Credit__One_More_City.jpg?v=1697118918\" /></span><em><span>This year was One More City's biggest ride</span></em></p>\n<p><span>“The students give us regular updates, they attend our events, they speak to our riders and are panellists for our events. They explain more about secondary cancer, because I don’t think it is very well understood and that is why I think it is so hard to treat. It’s been really amazing having those connections to the students,” O’Connell said. </span></p>\n<p><span>The One More City campaign has inspired many around the world and O’Connell is heading to San Francisco to participate in the One More City ride there, which will be funding research at a local university. O’Connell is also in talks with someone from Australia who is looking to set up the same model down under, again researching secondary breast cancer. </span></p>\n<p>The One More City ride will see its eighth edition next year, and while the finishing destination has not been decided yet, O’Connell is excited thinking about where they can end up. Despite her ongoing treatment and the fact that she will never have a cure for her cancer, she remains passionate about paving the way for people in the future who may find themselves in her position, giving them hope that they can beat the diagnosis with the funding and hard work she and those around her are putting in today. </p>\n<p>She added: \"I'm in a really sh*tty situation. But if I can do something positive around this, it gives me a bit more control and a purpose.\" </p>\n<p><a href=\"https://www.justgiving.com/campaign/onemorecity\" target=\"_blank\"><em>Support Christine O'Connell and One More City</em></a></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2d1d4e2f92ea9e10ad1c6e6fa7c8f583a921671a3d593f163de5ed167dd1e1d0","category":"Cycling"}