{"title":"Development and Characterization of a Microemulsion Con-taining a Cannabidiol Oil and a Hydrophilic Extract from Sambucus ebulus for Topical Administration","link":"https://www.preprints.org/manuscript/202404.1772/v1","date":1714143616000,"content":"Cannabidiol (CBD) is a safe and non-psychotropic phytocannabinoid with a wide range of potential therapeutic antiinflamatory and antioxidant activity. Due to its lipophilicity, it is normally available dissolved in oily phases. The main aim of this work was to develop and characterize a new formulation of a microemulsion with a potential anti-inflammatory and antioxidant action for topical treatment of inflammatory skin disorders. The micro-emulsion system was obtained from a 20% CBD oil as hydrophobic phase, Labrasol/Plurol Oleique (1:1) as surfactant and cosurfactant (S/CoS) respectively and an aqueous vegetal extract obtained from S. ebulus L. ripe fruits, with a potential anti-oxidant and anti-inflammatory activity, as water phase. A pseudo-ternary phase diagram was elaborated, selecting an optimal proportion of 62% (S/CoS), 27% CBD oil and 11% water and, after testing its reproducibility, the aqueous phases were replaced by the vegetal hydrophilic extract. The defined systems were characterized in terms of conductivity, droplet size by laser scattering, compatibility of components by differential scanning calorimetry and rheological properties using a rotational rheometer. The designed microemulsion showed good stability and a slight pseudo-plastic behavior. The release properties of CBD from the oil phase and caffeic acid from the water phase of the microemulsion were studied by in vitro diffusion experiments using flow-through diffusion cells in comparison to a CBD oil and a microemulsion only with CBD as active substance. It was evidenced that the inclusion of the original oil in microemulsions did not provoke a significant modification of the release of CBD, incorporating the possibility of including hydrophilic active compounds in the formulation, stablishing an interesting strategy for the development of future formulations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2d366377516f6cb7ddfa6d72d6c1e280b472d35c9117790fa603c3bad657ff90","category":"Interdisciplinary"}