{"title":"Coinfection of channel catfish (Ictalurus punctatus) with virulent Aeromonas hydrophila and Flavobacterium covae exacerbates mortality","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13912?af=R","date":1705050912000,"content":"<h2>Abstract</h2>\n<p><i>Flavobacterium covae</i> and virulent <i>Aeromonas hydrophila</i> are prevalent bacterial pathogens within the US catfish industry that can cause high mortality in production ponds. An assessment of in vivo bacterial coinfection with virulent <i>A. hydrophila</i> (ML09-119) and <i>F. covae</i> (ALG-00-530) was conducted in juvenile channel catfish (<i>Ictalurus punctatus</i>). Catfish were divided into seven treatments: (1) mock control; (2) and (3) high and low doses of virulent <i>A. hydrophila</i>; (4) and (5) high and low doses of <i>F. covae</i>; (6) and (7) simultaneous challenge with high and low doses of virulent <i>A. hydrophila</i> and <i>F. covae</i>. In addition to the mortality assessment, anterior kidney and spleen were collected to evaluate immune gene expression, as well as quantify bacterial load by qPCR. At 96 h post-challenge (hpc), the high dose of virulent <i>A. hydrophila</i> infection (immersed in 2.3 × 10<sup>7</sup> CFU mL<sup>−1</sup>) resulted in cumulative percent mortality (CPM) of 28.3 ± 9.5%, while the high dose of <i>F. covae</i> (immersed in 5.2 × 10<sup>6</sup> CFU mL<sup>−1</sup>) yielded CPM of 23.3 ± 12.9%. When these pathogens were delivered in combination, CPM significantly increased for both the high- (98.3 ± 1.36%) and low-dose combinations (76.7 ± 17.05%) (<i>p</i> &lt; .001). Lysozyme activity was found to be different at 24 and 48 hpc, with the high-dose vAh group demonstrating greater levels than unexposed control fish at each time point. Three proinflammatory cytokines (<i>tnfα</i>, <i>il8</i>, <i>il1b</i>) demonstrated increased expression levels at 48 hpc. These results demonstrate the additive effects on mortality when these two pathogens are combined. The synthesis of these mortality and health metrics advances our understanding of coinfections of these two important catfish pathogens and will aid fish health diagnosticians and channel catfish producers in developing therapeutants and prevention methods to control bacterial coinfections.</p>","author":"Allison L. Wise, \nBenjamin R. LaFrentz, \nAnita M. Kelly, \nMark R. Liles, \nMatt J. Griffin, \nBenjamin H. Beck, \nTimothy J. Bruce","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"2d3fd2d3f093623a9ecee556d5faed9937aba7a417202a6bda24322d667ccd34","category":"Environment"}