{"title":"ABA and Melatonin: Players on the Same Field?","link":"https://www.preprints.org/manuscript/202410.1525/v1","date":1729505138000,"content":"In plants, melatonin (MT) and abscisic acid (ABA) are conventionally treated as molecules mitigating stress responses. To understand the mechanisms of ABA–MT interplay, we examined the effects of ABA and MT treatment in loss-of-function ABA and MT mutants exposed to high light (HL) stress. ABA constantly suppressed ASMT encoding N-acetylserotonin methyltransferase in the context of differential responses of other MT biosynthesis genes in both wild type (WT) and mutants. However, this response was absent in the mutant with the disrupted ABI4. Given that the ASMT promoter region contains several potential ABI4-binding elements, these data suggest that ASMT can be a potential target gene for ABI4. A role for ABI4 in the interactions between ABA and MT is supported by the finding that ABI4 is constitutively derepressed in the MT signaling mutants cand2 and gpa1, which exhibited elevated steady state levels of ABI4 transcripts and were not regulated by either stress or melatonin. In addition, the abi4 mutant showed increased modulations in the expression of the MT catabolic genes M2H and M3H in response to ABA treatment inferring that this transcription factor is a negative regulator of ABA-dependent changes in MT content. Furthermore, all tested mutants with impaired ABA synthesis or signaling displayed elevated steady state MT levels compared to WT, while MT treatment contributed to downregulation of key ABA synthesis and signaling genes. Collectively, our results suggest that ABA and melatonin act antagonistically modulating the expression of ABA and MT signaling and metabolism genes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2d4643af6151ec79b91b6c51315a98d6250171fbdaba1f885199e6036ec91e20","category":"Interdisciplinary"}