{"title":"Top 5 2022 gravel bike trends","link":"https://www.bikeradar.com/news/2022-gravel-bike-trends/","date":1632393009000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/08/SRAM-RockShox-XPLR-4-03085f7.jpg?quality=90&amp;resize=620,413\" />                                            <p>\n</p><p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">Gravel bike</a> tech continues to evolve, with the likes of suspension forks and aero tech making an appearance at opposite ends of the riding spectrum.</p>\n<p>Here, we take a look at the state of the gravel tech market today and go over our top five gravel trends for 2022.</p>\n<h2>1. Gravel suspension</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The introduction of RockShox’ Rudy gravel suspension fork marks a significant entry from a mainstream brand into the world of gravel suspension.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>We’re going to start our list with two simple words that, on their own, are fairly innocent. But, when combined together and put in front of the eyes of the cycling public, can create a whirlwind of discussion and controversy in the comments… gravel suspension!</p>\n<p>Yes, more and more gravel bikes are now coming with proper suspension, which in many people’s not-totally-unjustified view, turns them into mountain bikes.</p>\n<p>While the issue is a little more nuanced and subtle than that, they do kind of have a point… but we digress.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> While elegant on paper, the Pinarello K8-S suspension hasn’t made its way from road to gravel bikes… yet.</span></figcaption><span> <i>Ben Delaney / Immediate Media</i></span></div>\n<p>In recent years, there has been a steady stream of products aimed at providing more comfort for drop-bar bikes on rough roads. Some have stuck around – the <a href=\"https://www.bikeradar.com/news/2021-cannondale-topstone/\" target=\"_blank\">Cannondale Lefty Oliver fork</a> and <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/specialized-diverge-comp-carbon-review/\" target=\"_blank\">Specialized Future Shock</a> are two key examples – <a href=\"https://www.bikeradar.com/news/pinarello-dogma-k8-s-rear-suspension-road-bike-released/\" target=\"_blank\">while others have not</a>.</p>\n<p>2022 will see the gravel suspension game turn up another notch with RockShox officially entering the arena with its Rudy fork and Reverb gravel dropper post, as well as a host of other components.</p>\n<ul><li><a href=\"https://www.bikeradar.com/news/sram-rockshox-zipp-xplr/\" target=\"_blank\">SRAM and RockShox launch gravel drivetrain, suspension fork and dropper post</a></li>\n</ul><p>Now, these aren’t just slimmed down mountain bike parts repurposed for the gravel market – they are designed specifically for gravel bikes, which results in more practical differences than you might imagine.</p>\n<p>What do you think? Does adding suspension just make a gravel bike a mountain bike? Let us know what you think in the comments.</p>\n<h2>2. Aero gravel race bikes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Áspero is one of a growing number of aero-influenced gravel race bikes.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Gravel riding means a lot of different things to a lot of different people. As per our last point, some people like their gravel bikes to be super capable on the trails, while others may want to attach loads of bags to theirs and ride a long way.</p>\n<p>Some even like to ride them as fast as they can with groups of other people, in a genre we believe is called… gravel racing?</p>\n<p>Jokes aside, as gravel has become ever more popular, so has its race scene, with races such as <a href=\"https://www.bikeradar.com/features/pro-bike/unbound-2021-bikes/\" target=\"_blank\">Unbound</a> now drawing pros from around the world, as well as scores of amateurs looking for a serious challenge.</p>\n<p>Bikes like the recently released <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/cervelo-aspero-force-etap-axs-first-ride-review/\" target=\"_blank\">Cervélo Áspero</a> are just the sort of machine you could see winning Unbound.</p>\n<p>Although, with a price tag of £8,000 for the cheapest option and no luggage mounts to speak of, these bikes really are focused on the most dedicated gravel riders.</p>\n<h2>3. Tyre clearances just keep getting wider</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Some modern gravel bikes have oodles of tyre clearance.</span></figcaption><span> <i>Fairlight</i></span></div>\n<p>While our next trend definitely applies to gravel bikes, it could also apply to the whole of cycling – tyre clearances just keep getting wider.</p>\n<p>We’ve been banging this drum for a long, long time, but hopefully, by now many people realise the benefits of wider rubber.</p>\n<p>They can add extra comfort, reduce the chances of punctures and, in some cases, <a href=\"https://www.bikeradar.com/advice/buyers-guides/are-wider-tyres-faster/\">roll faster than narrower tyres</a>.</p>\n<p>Gravel is no exception to this trend, with tyre clearances on some gravel bikes matching those of the mountain bikes of a few short years ago.</p>\n<p>While most racers seem to have settled on the 40mm-ish mark for most events, it’s good to know gravel bikes have the versatility built in that will let them tackle gnarlier terrain.</p>\n<p>Looking for the best gravel tyres on the market? Check out our test of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-tyres/\" target=\"_blank\">best gravel tyres</a> on the market.</p>\n<h2>4. Gravel specific clothing</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Yes, gravel-specific shoes are a thing.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>We can feel your eyes rolling a full 360 in your head – gravel clothing?! Who on earth is this for and how does it differ from road kit?</p>\n<p>While gravel-specific clothing does sometimes feel like it has been designed for the sheer sake of having something new to talk about, there are some trends in this part of the market that we aren’t in the least bit mad about.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> More casual than typical road kit, lighter and less baggy than most mountain bike clothing, gravel kit is designed for looking fabulous on relaxed riding adventures.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>Gravel kit from the likes of Morvelo Overland, Rapha and Pedaled prioritise comfort, practicality and a casual cut over all-out performance.</p>\n<p>We’ve even seen gravel-specific shoes, with the likes of <a href=\"https://www.bikeradar.com/reviews/shoes/road-bike-shoes/shimano-rx8-shoes-review/\" target=\"_blank\">Shimano’s RX8</a> and the <a href=\"https://www.bikeradar.com/reviews/shoes/rapha-explore-powerweave-shoe-review/\" target=\"_blank\">Rapha Explore</a> giving up little in terms of performance compared to their road or mountain bike counterparts, all while improving walkability.</p>\n<p>Generally speaking, the kit is also a lot less lairy than go-fast road kit, which helps if you don’t want to stand out as a cyclist when you’re off the bike.</p>\n<p>While there’s nothing wrong with smashing about at a zillion watts with your head down, it’s good to see brands acknowledging this isn’t what everyone wants out of cycling.</p>\n<p>Of course, there’s also nothing wrong with riding in the clothes you already have – some of which we bet looks a lot like gravel kit – so, before you give that bank card a little tickle, consider whether what you have might just be fine. You never know, it might even start a whole new trend among the gravel fashionistas!</p>\n<h2>5. Gravel gets a shot of electricity</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Electronic integration is coming to gravel bikes and there is nothing we can do about it.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>Electronic gravel groupsets have been around for a while, with Shimano releasing a Di2 version of GRX when it launched a few years ago.</p>\n<p>SRAM’s all-new XPLR groupset is also only available in an eTap wireless electronic configuration.</p>\n<p>But electronic integration is moving beyond drivetrains alone.</p>\n<p>SRAM is the leader here with its Reverb AXS XPLR dropper post and <a href=\"https://www.bikeradar.com/reviews/maintenance/tools-kits-and-boxes/pressure-gauge/quarq-tyrewiz-tyre-pressure-monitor-review/\" target=\"_blank\">Quarq TyreWiz</a> pressure sensors working together with its drivetrains to create a full electronic ecosystem. Add in the potential for integration with ebike motors and you’ve got the makings of a shred-ready Tron bike.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> GRX Di2 has been around since the groupset first launched. Will we see Shimano complement it with an electronic dropper post? Time will tell.</span></figcaption><span> <i>George Scott / Immediate Media</i></span></div>\n<p>Looking elsewhere, there has long been a rumour that Shimano is working on an electronic dropper post, with a few patents for the system floating around online.</p>\n<p>It seems like, as with road bikes, electronic tech on gravel bikes is here to stay, and we’re only likely to see more of it in the years to come.</p>\n<p>Whether or not this is a good thing for riders is up to you, but so long as affordable and easily maintainable options still exist, we’ll always delight in seeing brands push the envelope of cycling tech.</p>","author":"Joe Norledge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"2d523a67d14337d5a183eb6385bcfca4bcb40a0c2da8c21b30be9aabfafbadcb","category":"Cycling"}