{"title":"Lidar reveals hundreds of long-lost Maya and Olmec ceremonial centers","link":"https://arstechnica.com/?p=1808992","date":1635595838000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/02/01-lidar-maya-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/02/01-lidar-maya.jpg\">Enlarge</a> (credit: <a href=\"https://www.21cf.com/\">21st Century Fox</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>An airborne lidar survey recently revealed hundreds of long-lost Maya and Olmec ceremonial sites in southern Mexico. The 32,800-square-mile area was surveyed by the Mexican Instituto Nacional de Estadistica y Geografia, which made the data public. When University of Arizona archaeologist Takeshi Inomata and his colleagues examined the area, which spans the Olmec heartland along the Bay of Campeche and the western Maya Lowlands just north of the Guatemalan border, they identified the outlines of 478 ceremonial sites that had been mostly hidden beneath vegetation or were simply too large to recognize from the ground.</p>\n<p>“It was unthinkable to study an area this large until a few years ago,” said Inomata. “Publicly available lidar is transforming archaeology.”</p>\n<p>Over the last several years, lidar surveys have revealed <a href=\"https://arstechnica.com/science/2018/02/lasers-shed-some-light-on-the-maya-snake-kingdom/\">tens of thousands of irrigation channels, causeways, and fortresses across Maya territory</a>, which now spans the borders of Mexico, Guatemala, and Belize. Infrared beams can penetrate dense foliage to measure the height of the ground, which often reveals features like long-abandoned canals or plazas. The results have shown that Maya civilization was more extensive, and more densely populated, than we previously realized.</p></div><p><a href=\"https://arstechnica.com/?p=1808992#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1808992&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2d704aaa4b2e0ed54b9e7ba31a14c442231c8f7911a0b53d25108587778a0c85","category":"Tech"}