{"title":"Relationship Between Emotional Intelligence with Teaching Ability in the Faculty Members of Medical sciences","link":"https://www.preprints.org/manuscript/202404.1403/v1","date":1713831149000,"content":"Improving the capabilities of faculty members, including competencies of emotional intelligence in professors, can play a major role in various education levels of success and achievement, adjustment, and mental health in students, and is a fundamental solution to the promotion of higher education quality. For accurate examination of the issue, the present study aimed to determine the association between basic science professors' emotional intelligence and the ability to teach at the School of Medicine of Iran University of Medical Sciences. The present descriptive-analytical study was conducted at the School of Medicine of Iran University of Medical Sciences by census sampling of faculty members of the basic sciences. We included 98 faculty members in the study. The research tools included Dr. Haghani's \"Emotional Intelligence in Teaching\" questionnaire and Dr. Akbari's \"Teaching Ability\" questionnaire. We analyzed data through descriptive statistics and analytical tests, including Spearman's correlation test, Pearson test, t-test, and two-way analysis of variance. The mean score of faculty members' emotional intelligence was 111.51±9.3 equal to 89.93±7.5 percent, and the median score of total teaching ability of the questionnaire was 101.89±8.59 equal to 87.84±7.4 percent. There was a positive correlation between faculty members' emotional intelligence and teaching ability. (p= 0.0001, r= 0.71). The faculty members' emotional intelligence can be a determinant in their teaching ability. Their emotional intelligence was evaluated as good and there was a positive relationship between emotional intelligence and teaching ability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2d71f877426b6270aeca510a2756880ae0f4884e84af672360697473e27b94cb","category":"Interdisciplinary"}