{"title":"สาเหตุที่ Apple ยังทำชิปโมเด็มเองไม่ได้ - เพราะยากกว่าชิป iPhone หรือ Mac มาก","link":"https://www.blognone.com/node/135893","date":1695512949000,"content":"<div><div><div><p>จากข่าวก่อนหน้าที่ Qualcomm ประกาศ<a href=\"https://www.blognone.com/node/135676\">ต่อสัญญา</a>จัดส่งชิปโมเด็ม 5G ให้กับแอปเปิลต่อไปอีก 3 ปี ทำให้ความพยายามของแอปเปิลที่จะยกเลิกการพึ่งพาชิปโมเด็มของ Qualcomm ยังไม่เกิดขึ้นในระยะเวลาอันใกล้นี้ แม้จะมีข่าวว่าแอปเปิล<a href=\"https://www.blognone.com/node/120084\">ตั้งทีมพัฒนา</a>ชิปโมเด็มภายในมาหลายปี</p>\n<p>The Wall Street Journal มีรายงานพิเศษถึงปัญหาภายในของแอปเปิล ที่ทำให้การพัฒนาชิปโมเด็มขึ้นเองยังไม่สำเร็จ ซึ่งตามแผนงานแรกต้องการนำมาใช้กับ iPhone รุ่นปีนี้หรือปีหน้า แต่ผลทดสอบเมื่อปลายปีที่แล้วพบว่านอกจากความเร็วรับส่งจะไม่ดี ชิปยังร้อนมากด้วย แผงวงจรที่ต้องใช้ก็มีขนาดใหญ่เกินไป กินพื้นที่ครึ่งหนึ่งของ iPhone ทำให้ยังไม่สามารถนำมาใช้ได้ แหล่งข่าวบอกว่าผลลัพธ์ที่ได้นั้นแอปเปิลยังห่างจากชิปล่าสุดของ Qualcomm ถึง 3 ปี</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/caa6c2f3dac854c7f8a34d8839573311.jpg\" alt /></p>\n<p>แรงผลักดันของแอปเปิลให้พัฒนาชิปโมเด็มมีสองเรื่อง เรื่องแรกคือต้องการต่อยอดความสำเร็จจากการพัฒนาชิปใช้เองใน iPhone ทำให้บริษัทมีจุดเด่นทั้งประสิทธิภาพเฉพาะตัว และต้นทุนที่ถูกลงในระยะยาว เรื่องที่สองก็คือปัญหาการฟ้องร้องกับ Qualcomm ที่เริ่มมาตั้งแต่<a href=\"https://www.blognone.com/node/89403\">ปี 2017</a> ในประเด็นผูกขาดชิปโมเด็ม แต่แอปเปิลตัดสินใจยอมความ<a href=\"https://www.blognone.com/node/109219\">ในปี 2019</a> เพราะชิปที่มีไม่เพียงพอในการผลิต จึงต้องการสั่งซื้อชิปจาก Qualcomm ด้วย เรื่องที่เกิดขึ้นจึงทำให้แอปเปิลก็ต้องการลดการพึ่งพา Qualcomm ให้ได้ในระยะยาว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/30399e258a75146789cdcbc91c12b037.jpg\" alt /></p>\n<p>แผนการพัฒนาชิปโมเด็มภายในแอปเปิลเริ่มมาตั้งแต่ปี 2018 มีโค้ดเนมของโครงการภายในว่า Sinope โดยโครงการนี้ดูแลโดย Tim Cook ซีอีโอ และ Johny Srouji หัวหน้าฝ่ายเทคโนโลยีฮาร์ดแวร์ ที่ดูแลโครงการพัฒนาชิปตั้งแต่ iPhone จนถึง Mac</p>\n<p>ความจริงจังของแอปเปิลมีทั้ง การพยายามดึงตัววิศวกรจาก Qualcomm โดยลงทุนตั้งสำนักงานวิจัยที่เมืองซานดิเอโก ซึ่งเป็นที่ตั้งของ Qualcomm, <a href=\"https://www.blognone.com/node/111040\">ซื้อกิจการ</a>ชิปโมเด็มจากอินเทลในปี 2019 ตั้งเป้าหมายเวลานั้นว่าชิปโมเด็มแรกจะใช้กับ iPhone ปี 2023</p>\n<p>อดีตผู้บริหาร Qualcomm ให้ความเห็นว่า การพัฒนาชิปโมเด็มสำหรับรับส่งข้อมูลกับเครือข่ายโทรศัพท์มือถือนั้น ซับซ้อนกว่าการทำชิปประมวลผลที่ติดต่อเฉพาะในอุปกรณ์มาก เพราะต้องรองรับการทำงานของคลื่นตามมาตรฐานแต่ละประเทศทั่วโลก แค่รองรับ 5G รุ่นล่าสุดนั้นไม่เพียงพอ แต่ต้องรองรับถอยไปจนถึง 2G 3G 4G สำหรับบางประเทศ สิ่งที่กินเวลามากคือกระบวนการทดสอบ ที่ต้องทำกับเครือข่ายมือถือแต่ละแห่ง ไทม์ไลน์ที่แอปเปิลวางไว้จึงแทบจะเป็นไปไม่ได้เลย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/62d235b7c4bf4cd4f8938f9b0c29768e.jpg\" /></p>\n<p>ถึงแม้ทุกอย่างจะไม่เป็นตามแผน แต่รายงานก็ยืนยันว่าแอปเปิลยังคงเดินหน้าพัฒนาชิปโมเด็มใช้เองให้สำเร็จ เพราะเป้าหมายหลักก็คือต้องเลิกพึ่งพา Qualcomm ให้ได้นั่นเอง</p>\n<p>ที่มา: <a href=\"https://www.wsj.com/tech/apple-iphone-modem-chip-failure-6fe33d19\">The Wall Street Journal</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/qualcomm\">Qualcomm</a></div><div><a href=\"/topics/modem\">Modem</a></div><div><a href=\"/topics/5g\">5G</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2d73fd2e1922c7846e7a1a01d2c312a9b2980ae8a177527ead5e6cbf7ac94f54","category":"Thai"}