{"title":"The effects of HIV and oncogenic human papillomavirus on the tumor immune microenvironment of penile squamous cell carcinoma","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300729","date":1714572000000,"content":"<p>by Chibamba Mumba, Zoran Muhimbe, Victor Mapulanga, Musonda Kawimbe, Keagan Mutale, Anglin Hamasuku, Jane Musumali, Nicholas K. Mwale, Owen Ngalamika</p>\r\n\r\nPenile squamous cell carcinoma (PSCC) occurs more frequently in some developing countries compared to developed countries. Infection with HIV and/or high-risk human papillomavirus (hrHPV) are risk factors for penile cancer development. The tumor microenvironment of PSCC may predict prognosis and may inform on the best targets for immunotherapy. We evaluated the immune microenvironment of penile tumors histologically, and determined whether and/or how HIV and/or hrHPV infections affect this tumor microenvironment. We conducted a prospective analytical cross-sectional study in which penile cancer tumors from 35 patients presenting at the University Teaching Hospital in Lusaka, Zambia were histologically staged and assessed for presence of tumor infiltrating immune cells and expression of immune checkpoints. Immunohistochemistry was used to evaluate immune checkpoints and infiltrating immune cells, while multiplex real-time polymerase chain reaction was used for hrHPV genotyping. The median age of all participants was 55 years. About 24% had advanced histological stage, 83% were HIV<sup>+</sup>, and 63% had hrHPV detected in their tumors using multiplex real-time polymerase chain reaction. PDL1 expression was significantly higher in HIV<sup>-</sup> participants than HIV<sup>+</sup> participants (p = 0.02). Tumors with multiple hrHPV infections had a significantly higher number of cells expressing TIM3 than those with one hrHPV (p = 0.04). High grade tumors had a significantly higher infiltrate of FoxP3<sup>+</sup> cells (p = 0.02), CD68<sup>+</sup> cells (p = 0.01), CD163<sup>+</sup> cells (p = 0.01), LAG3<sup>+</sup> cells (p = 0.01), PD1<sup>+</sup> cells (p = 0.01) and TIM3<sup>+</sup> cells (p = 0.03) when compared with low grade tumours. There was significant moderate to strong positive correlation of cells expressing PD1 and LAG3 (⍴ = 0.69; p = 0.0001), PD1 and TIM3 (⍴ = 0.49; p = 0.017) and TIM3 and LAG3 PDL1 (⍴ = 0.61; p = 0.001). In conclusion, the tumor microenvironment of penile squamous cell carcinoma seems to be affected by both HIV and HPV infections. TIM3 appears to be a potential therapeutic target in PSCC patients with hrHPV infections.","author":"Chibamba Mumba","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2d768c0122824dc362777f157d61882eb5fb19c92c3964873d9a7df341971d88","category":"Interdisciplinary"}