{"title":"150 Development of a leaky gut model: Meta-analysis of plasma and fecal markers of leaky gut","link":"https://academic.oup.com/jas/article/102/Supplement_2/118/7664995?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Intestinal integrity can be compromised in livestock and poultry species during stress events, including off-feed events. To develop a leaky gut model, weanling barrows 26 to 28 d old [n = 307; Duroc terminal line Fast genetics, initial body weight (BW) = 5.90 ± 0.47 kg), were used in a total of 6 randomized complete block experiments at the NutriQuest modeling center (Fergus Falls, MN). All trials included positive control (PC) and negative control (NC) treatments. The other treatments evaluated (n = 8) were various strains and levels of direct-fed microbial (DFM) products. With the exception of PC, all treatments had complete 24-h feed restriction (FR) approximately 18 d after arrival. Pigs assigned to PC had ad libitum access to feed. Pigs were housed 3 pigs per pen in 1 of 30 pens, and all pigs were fed a common high-quality basal diet. For 3 trials, pigs received Excede (Zoetis; Parsipanny, NJ) IM upon arrival and were provided gentamycin via water for 3 d post-arrival. For 3 trials, no prophylactic antibiotics were administered. Eighteen days post-arrival, fecal and plasma samples were collected from all pigs and feed was removed from FR pens. After 24 h, plasma and fecal samples were collected from all pigs, and one-half of the pigs per trial were harvested for tissue collection. Four days after FR, samples were collected similarly, and the remaining pigs were harvested. Plasma samples were analyzed for LPS binding protein concentrations (LBP), and fecal samples were analyzed for myeloperoxidase (MPO) concentrations. Data from the PC (n = 90) and NC (n = 92) treatments only were analyzed as Individual Participant Data meta-analysis using PROC MIXED of SAS. Data from all pigs (n = 307) were analyzed using PROC REG of SAS with forward step-wise selection to determine relationships between response variables. Plasma LBP concentrations did not differ between PC and NC 24 h after FR (<span>P</span> = 0.14). However, change in LBP concentrations and the ratio of LBP immediately before and after FR, differed between PC and NC (<span>P</span> &lt; 0.001). For NC, LBP concentrations decreased, and for PC, LBP concentrations increased (Table 1). There was no effect of treatment on fecal MPO concentrations. Using the broader dataset (n = 307), variables that were predictive of plasma LBP concentrations immediately following FR were trial (<span>P</span> &lt; 0.001), treatment (<span>P</span> &lt; 0.001), and fecal MPO concentrations (<span>P</span> &lt; 0.05). Variables that were predictive of change in LBP concentrations before and after FR were trial (<span>P</span> &lt; 0.001), treatment (<span>P</span> &lt; 0.001), and initial BW (<span>P</span> &lt; 0.01). These data, taken with data presented in a companion abstract on ileal tight junction gene expression, suggest that plasma LBP concentrations immediately following a FR event are a useful marker of leaky gut. Fecal MPO concentrations do not consistently respond to FR.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2d799fb32334308a6cae5251604c49bcfab2dd74ed1a95051d5565056ae1c257","category":"Environment"}