{"title":"Clinical study of ultrasound-guided minimally invasive catheterization combined with compound cortex phellodendri fluid in the treatment of lactational breast abscess","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308548","date":1726495200000,"content":"<p>by Na Wang, Lili Gong, Chunmei Ye</p>\r\nObjective <p>To retrospectively analyze the clinical practicability and value of ultrasound-guided minimally invasive catheterization combined with compound Phellodendron Phellodendri liquid in the treatment of breast abscess during lactation.</p> Methods <p>139 patients with lactational breast abscess discharged from our hospital from January 2021 to November 2023 were selected. We divided them into groups according to treatment methods, analyzed whether there were statistical differences in observation indexes among groups and the risk factors affecting breastfeeding rate and treatment satisfaction.</p> Results <p>We found that numerical rating scale(NRS) score and incidence of breast fistula in group A were significantly lower than other, the continuous decrease of postoperative drainage in group A was higher than other, there were significant differences among groups (p&lt;0.001). Univariate analysis showed that recovery time, drainage tube placement time, postoperative redness and swelling regression time, scar length, and VAS score of six groups were statistically significant (p&lt;0.001). We found that the overall satisfaction and the rate of continued breastfeeding in group A (96.2%) were higher than other, the differences were statistically significant(p&lt;0.05). Logistic regression analysis revealed that the significant risk factors influencing treatment satisfaction included the time of drainage tube placement, postoperative redness and swelling regression time, treatment group, surgical method, NRS score on the first day after operation, postoperative drainage volume, healing time, scar length, flushing drugs, and VAS score. Postoperative redness and swelling regression time, treatment group, operation method and VAS score are all risk factors that influence the outcome of breastfeeding.</p> Conclusion <p>Ultrasound-guided minimally invasive catheterization combined with compound cortex phellodendri fluid in the treatment of breast abscess during lactation can not only reduce the pain caused by dressing change, but also offer numerous advantages, including shorter healing time, beautiful appearance, lower incidence of breast fistula, high satisfaction and high rate of continued breastfeeding.</p>","author":"Na Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2d84a633db69864f687b4868afd8206b03f0ef368a5e15c9102ed517175a41d5","category":"Interdisciplinary"}