{"title":"Paleozoic orogenic gold mineralization from metamorphism of volcanic sequences in the North Qinling terrane (central China): Insights from the Yindongpo gold deposit in the Tongbai area","link":"http://link.springer.com/10.1007/s00126-024-01265-4","date":1727740800000,"content":"<h3>Abstract</h3>\n                    <p>Phanerozoic orogenic gold deposits worldwide are commonly considered to be formed from metamorphic devolatilization of marine carbonaceous sedimentary rocks. Here we show that the Yindongpo gold deposit from the Qinling orogen (central China) is genetically associated with the metamorphism of volcanic rocks during the late Paleozoic orogeny, which involved the closure of the Shangdan ocean. Gold mineralization at Yindongpo is hosted in lower Paleozoic metavolcanic-sedimentary sequences and occurs mainly as lenticular to stratiform ore bodies that formed in three paragenetic stages represented by quartz-ankerite-pyrite (stage I), quartz-carbonate-sulfide (stage II) and quartz-calcite assemblages (stage III), respectively. Rutile grains coexisting with auriferous pyrite from stage II yield U–Pb ages of 395 ± 9 to 400 ± 13 Ma (2σ). Fluid inclusions in quartz of stages I and II are dominated by CO<sub>2</sub>-rich (~ 10 mol%) aqueous fluids with low salinities (&lt; 4.9 wt% NaCl equivalent) and total homogenization temperatures ranging from 241 to 352 ºC, whereas the values for H<sub>2</sub>O-rich inclusions of stage III are 0.2 to 2.6 wt% NaCl equivalent and 151 to 164 °C. Based on secondary ion mass spectrometry analysis of oxygen isotopes of quartz (Qz-1 to Qz-4), the calculated δ<sup>18</sup>O<sub>fluid</sub> values for the quartz-forming fluids are 1.3 to 7.0‰ in stage I, –3.1 to 6.6‰ in stage II, and –9.6 to –3.7‰ in stage III. These data indicate a metamorphic origin of ore fluids that underwent Rayleigh fractionation and incursion of meteoric water. The large variation in <sup>40</sup>Ar<sup>*</sup>/<sup>4</sup>He ratios (1.7–30.0), caused by accumulation of radiogenic Ar<sup>*</sup> and He loss within some pyrite samples, can be ascribed to regional metamorphism and deformation. Ore sulfides have sulfur (δ<sup>34</sup>S<sub>V-CDT</sub> = –2.1 to 3.3‰) and lead (<sup>206</sup>Pb/<sup>204</sup>Pb = 17.008–17.152, <sup>207</sup>Pb/<sup>204</sup>Pb = 15.402–15.493, and <sup>208</sup>Pb/<sup>204</sup>Pb = 38.254–38.564) isotopic compositions that are consistent with those of pyrite in the metavolcanic host rocks. Results presented here suggest that the ore fluids and, by inference, gold of the Yindongpo deposit were derived primarily from the volcanic sequences during regional metamorphism and deformation in response to the Early Devonian Qinling collisional orogeny. The Yindongpo deposit represents the first recognized Paleozoic orogenic gold deposit in the Qinling orogen, and thus has important implications for regional metallogeny and gold exploration.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"2da7cd027ec0e1e079cbd067af6047b2ee43efe32f0df264af514a092b714fd1","category":"Environment"}