{"title":"How Web Development Tools Are Helping Users Keep Pace With Rapid Change","link":"https://smashingmagazine.com/2021/09/web-development-tools-users-keep-pace-rapid-change/","date":1632216600000,"content":"<p>Several years ago, I wrote about website builders for a living. Yes, that’s a thing. Back then there seemed to be a gulf between drag-and-drop tools and full-blown web development. Today, it’s heartening to see the likes of Wix adding more code-heavy options to their repertoire. </p>\n<p>Judging by <a href=\"https://www.wix.com/velo/web-dev-report-21?utm_campaign=sm_rwd_article1\">Velo by Wix’s report</a>, I’m not alone in feeling that way.</p>\n<p><strong>The Covid-19 pandemic has forced much of the world online</strong>. Billions of people have been working, dating, and doom scrolling on the web more than ever before. To meet this change, businesses have been beefing up their online offering. Demand for web developers and development tools is higher than ever. </p>\n<p>The team at <a href=\"https://www.wix.com/velo?utm_campaign=sm_rwd_velo\">Velo</a> by Wix — which offers a full-stack Rapid Web Development platform — wanted to examine <strong>what this mass digital migration means for the industry</strong>. What web development platforms are being used? Who are they being used by, and why?</p>\n<p>To answer those questions, Velo has conducted a survey of 1,200 developers and the resulting <a href=\"https://www.wix.com/velo/web-dev-report-21?utm_campaign=sm_rwd_article2\">Rapid Web Development Report</a> is pretty fascinating. In the space between drag-and-drop website builders and from-the-ground-up development, there’s an awful lot of demand, and not always for the reasons you might expect.</p>\nWhat Are Rapid Web Development Platforms?\n<p>Before getting into the meat and potatoes of the <a href=\"https://www.wix.com/velo/web-dev-report-21?utm_campaign=sm_rwd_article3\">report</a>, we should be clear on how Velo defines <strong>R</strong>apid <strong>W</strong>eb <strong>D</strong>evelopment (RWD). In the broadest sense, it means using builders or tools that streamline the development process. </p>\n<p>We all recognize the spectrum these things sit on, even if we haven’t put a name to it. From no- and low-code platforms like Wix and Weebly to techier visual tools like, well, Velo by Wix, they’re what we use when we want or need to quickly build sites and web apps — <strong>without coding everything from scratch</strong>.</p>\n<p>Convenience and accessibility have long been the selling points of Rapid Web Development platforms. They handle many of the foundational aspects of sites so developers (or business owners, bloggers or activists) can focus instead on the functionality of their project. </p>\n<p>They provide ready-made or <strong>built-in solutions</strong> for many aspects of the site. These include:</p>\n<ul>\n<li>Infrastructure</li>\n<li>Databases</li>\n<li>Content management</li>\n<li>Design</li>\n<li>Servers</li>\n<li>Security and privacy</li>\n<li>Deployment</li>\n<li>Maintenance</li>\n<li>Business solutions</li>\n<li>Search engine optimization</li>\n</ul>\n<p>In short, they take care of the foundations while still giving control. Each of the aspects listed above could be full-time jobs on their own (at <em>Smashing Magazine</em> we’ve published enough articles on them to know), so the value of assistive tools is undeniable.</p>\nKey Findings\n<p>Let’s cover the key points before getting into the nitty-gritty. The report uses data from 1,200 respondents, 60% of whom describe themselves as entrepreneurs or freelancers. Together with agencies, these make up the majority of RWD users.</p>\n<p>Those surveyed typically use Rapid Web Development platforms to support and grow their businesses, with speed, flexibility, and cost-effectiveness being their main appeals — especially in the Covid-19 era. Convenience trumps technical capabilities. The real value of such tools is <strong>how they can facilitate the running of businesses</strong>.</p>\n<h3>The Times They Are A-Changin’</h3>\n<p>Such a sharp focus on business makes sense given what’s gone on in the last 18 months. To call the Covid-19 a time of upheaval would be an understatement. Even the ever-changing web has been shaken up.  </p>\n<p>Of those surveyed, 42% said the pandemic has been a time of large or extreme change. There has been something of mass migration to e-commerce, with <strong>businesses having to move online</strong> to meet the demand. </p>\n<p>Few businesses can afford to take months building bespoke web presences. The streamlined, out-of-the-box convenience and scalability of Rapid Web Development platforms have always made commercial sites a natural fit. This bears out in the report, with more than 80% of respondents saying RWD tools helped their businesses during the pandemic. </p>\n<h3>No Time To Waste</h3>\n<p>When it comes to the whys, 61% of respondents said they use Rapid Web Development platforms because they \"improve efficiency.\" That and \"productivity\" were the two most popular choices.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/290317e6-45e0-482c-b651-a0cafa24c78c/1-web-development-tools-users-keep-pace-rapid-change.png\" /></p>\n<h4>Why Use Rapid Web Development Platforms?</h4>\n<p>You also get a sense of how varied the use cases really are. While 56% of respondents said they use one RWD platform, the other 44% use multiple. Different builders have always had different strengths (<em>Squarespace</em> for design, <em>Shopify</em> for online shops, and so on), but it’s still interesting to see so many people seek efficiency and yet still find themselves using multiple platforms.</p>\n<h3>E-Commerce Thrives</h3>\n<p>In keeping with the march online, 44% of respondents said they use Rapid Web Development platforms to build e-commerce sites. This was the most common answer by far. <strong>Cost-effectiveness was the deciding factor</strong> for 64% of that subset. When people want to sell online, they want to get set up quickly and affordably. Add hospitality and restaurants into the mix and you have a hefty portion of the Rapid Web Development user base.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6d428f18-c6ea-4b75-afe0-e4642b73dc72/2-web-development-tools-users-keep-pace-rapid-change.png\" /></p>\n<h4>What Markets Are RWDs Used For?</h4>\n<p>That said, it’s clearly not all about the money. The second most common usage of Rapid Web Development was <strong>blogging</strong> and <strong>media</strong>, closely followed by <strong>tech</strong>. Having an online presence is invaluable across countless sectors, and website builders remain a popular way of achieving that.</p>\n<h3>Buckling Frameworks</h3>\n<p>A particularly insightful part of the report examines how Rapid Web Development platforms fit within the wider frameworks ecosystem. Gone are the days where website builders are only used by those who can’t code. Their convenience and flexibility make them viable options for just about everyone.</p>\n<p>The most used framework among those surveyed was <a href=\"https://www.smashingmagazine.com/category/react\">React</a>, with just under two-thirds saying they were familiar with it. <a href=\"https://www.smashingmagazine.com/category/angular\">Angular</a> was second with 33.6% and <a href=\"https://www.smashingmagazine.com/category/vue\">Vue</a> third with 30.9%. Technical know-how is solid.</p>\n<p>Despite that familiarity, frameworks are mainly used because they’re familiar, not necessarily because they’re loved. Only 25% of respondents said they use the frameworks they use because <strong>they like the product</strong>. Not a number totally out of the blue, but pretty damning all the same.</p>\n<p>The appeal of web development tools takes on another dimension with this in mind. When faced with a one-off project like, say, a portfolio website, why would someone use a framework they don’t even like? Maybe they’d rather rustle something up with a builder in half the time.</p>\n<h3>Cost A Major Factor</h3>\n<p>Not everyone has the resources to hire a development team out of the gate. It’s a major investment of not only money, but time, too. When all is said and done, offsetting that cost is the main appeal of Rapid Web Development platforms. </p>\n<p>When asked why they use them, the top three reasons from respondents were:</p>\n<table>\n  <thead>\n    <tr>\n      <th>Percentage</th>\n      <th>Reason</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>64%</td>\n      <td>“It’s more cost effective.”</td>\n    </tr>\n    <tr>\n      <td>61%</td>\n      <td>“Keeps pace with customer needs.”</td>\n    </tr>\n    <tr>\n      <td>46%</td>\n      <td>“Gives leg up on competition.”</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>That one-two of being affordable and up to date is far ahead of any other factors. Even if those issues aren’t quite removed, they’re much more manageable.</p>\n<p>Meanwhile, openness was something users didn’t care much about when it came to RWD tools. <strong>There is a time and place</strong> for open-source code and total technical control, and it ain’t business websites in a pandemic. </p>\nTools In The Toolbox\n<p>There is no one right way to do web development. The overarching sense one gets from the <a href=\"https://www.wix.com/velo/web-dev-report-21?utm_campaign=sm_rwd_article1\">Rapid Web Development Report</a> is that <strong>a greater variety of tools</strong> ensures we can each build websites and applications in ways that are right for us.</p>\n<p>As the report itself summarises, users “aren’t committed to one specific technology, but to practicality.” Each platform is a tool in our web development toolbox. Sometimes only a React app from scratch will do. Other times, however, assistive technology is the only way to get the results you're looking for, by the deadline you need to meet.</p>\n<p>This has rung especially true during the pandemic, with <strong>countless businesses moving online</strong> and turning to Rapid Web Development tools to help them keep up with seemingly relentless change.</p>\n<p>Would-be web developers sit on a spectrum all the way from total beginners to full-stack experts, and everything in between. It’s reassuring to see tools reflecting that reality and helping people get online.</p>\n<ul>\n<li><a href=\"https://www.wix.com/velo/web-dev-report-21?utm_campaign=sm_rwd_article4\"><em>Read the full Rapid Web Development report →</em></a> </li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"2db7bed2fe004419d6c5851c3368d4bdcdb415231dbd9e17eb561d4172ffef81","category":"Tech"}