{"title":"Nano-Engineering Halide Perovskites: Towards Energy Harvesting, Nano-Plasmon Sensing and Photoflexoelectric Potential Applications","link":"https://www.preprints.org/manuscript/202409.1650/v1","date":1727071742000,"content":"Halide perovskite are known by their (1) organic inorganic hybrid and (2) inorganic halide perovskite. Having this in mind, monolithic perovskite/silicon tandem solar cell has already demonstrated extraordinarily high performance in the field of photovoltaic with current efficiency of 29.15%, breaking the efficiency limit for silicon solar cell. Currently, halide perovskites become successful not only in photovoltaic but also in many other related potential optoelectronic applications. Because of this reason, the origin of their multifunctional properties, remarkable energy harvesting and emitting efficiency and the corresponding potential applications in various optoelectronic devices become controversial issues and hot topics of academic research this time. In this review, nano-engineering strategies, microscopic origins and mechanisms are reviewed well to make clarity on what the origin of multifunctional properties such as tunability, ferroelasticity, piezoelectricity, pyroelectricity and thermoelectric properties of halide perovskites. Moreover, the coexistence of multiple properties makes halide provskites possible for synergistic applications and multifunctional perspectives such as emerging energy harvesting, conversion technologies, nano-plasmonic sensing and electromechanical applications, which are now open for the scientific community for further detail investigations. To successfully explore this field, advanced nanometer scale domain characterization tools are highly relevant to understand the microscopic origin of these electrical properties; aid the commercial enterprises and the research institutions. Not only the microscopic origin but also identifying factors and issues affecting the successful understanding and presence or absence of these electrical parameters should be primary task in this review. Finally, the big challenges for operation of halide perovskites owing to temperature, moisture, light, air, etc. induced material degradation and device deteriorations as well as lattice instability, nano scale defects, surface and bulk defects should be considered while dealing with these future research topics.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2db757e933c948d4dd485e58ab1fc53b44686374783c1e5f78c7412fba26fbff","category":"Interdisciplinary"}