{"title":"The radiation of nodulated Chamaecrista species from the rainforest into more diverse habitats has been accompanied by a reduction in growth form and a shift from fixation threads to symbiosomes","link":"https://academic.oup.com/jxb/article/75/11/3643/7635477?rss=1","date":1711411200000,"content":"<span><div>Abstract</div>All non-Mimosoid nodulated genera in the legume subfamily <span>Caesalpinioideae</span> confine their rhizobial symbionts within cell wall-bound ‘fixation threads’ (FTs). The exception is the large genus <span>Chamaecrista</span> in which shrubs and subshrubs house their rhizobial bacteroids more intimately within symbiosomes, whereas large trees have FTs. This study aimed to unravel the evolutionary relationships between <span>Chamaecrista</span> growth habit, habitat, nodule bacteroid type, and rhizobial genotype. The growth habit, bacteroid anatomy, and rhizobial symbionts of 30 nodulated <span>Chamaecrista</span> species native to different biomes in the Brazilian state of Bahia, a major centre of diversity for the genus, was plotted onto an ITS-<span>trnL-F</span>-derived phylogeny of <span>Chamaecrista</span>. The bacteroids from most of the <span>Chamaecrista</span> species examined were enclosed in symbiosomes (SYM-type nodules), but those in arborescent species in the section <span>Apoucouita</span>, at the base of the genus, were enclosed in cell wall material containing homogalacturonan (HG) and cellulose (FT-type nodules). Most symbionts were <span>Bradyrhizobium</span> genotypes grouped according to the growth habits of their hosts, but the tree, <span>C. eitenorum</span>, was nodulated by <span>Paraburkholderia</span>. <span>Chamaecrista</span> has a range of growth habits that allow it to occupy several different biomes and to co-evolve with a wide range of (mainly) bradyrhizobial symbionts. FTs represent a less intimate symbiosis linked with nodulation losses, so the evolution of SYM-type nodules by most <span>Chamaecrista</span> species may have (i) aided the genus-wide retention of nodulation, and (ii) assisted in its rapid speciation and radiation out of the rainforest into more diverse and challenging habitats.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"2dbf5f35e18f8b84507dfca1b15a2a33cae1c4a4108570dc75e251bc6d1622eb","category":"Environment"}