{"title":"Intratumoral Microbes in Oral Squamous Cell Carcinoma: Focus on Treponema denticola, Lactobacillus casei, and Candida albicans","link":"https://www.preprints.org/manuscript/202408.1912/v1","date":1724749921000,"content":"Aim:\nIn this study, we aimed to explore the oral bacteria and fungi that can help discern oral squamous cell carcinoma (OSCC) and investigate the correlations between multiple key pathogens.\nMethods:\nTwelve participants (8 females and 4 males; mean age, 54.33 ± 20.65 years) were prospectively recruited into three groups: Group 1: healthy control, Group 2: patients with stomatitis, and Group 3: patients with OSCC, with 4 individuals in each group. Unstimulated whole saliva samples from these participants were analyzed using real-time PCR to assess the presence and abundance of 14 major oral bacterial species and Candida albicans.\nResults:\nThe analysis revealed significant differences for certain microorganisms, namely Treponema denticola (T. denticola), Lactobacillus casei (L. casei), and Candida albicans. T. denticola was most abundant in the OSCC group (5,358,692.95 ± 3,540,767.33), compared to the stomatitis (123,355.54 ± 197,490.86) and healthy control (9,999.21 ± 11,998.40) groups. L. casei was undetectable in the healthy control group, but was significantly more abundant in the stomatitis group (1,653.94 ± 2,981.98) and even higher in the OSCC group (21,336.95 ± 9,258.79) (p = 0.001). A similar trend was observed for C. albicans, with DNA copy numbers rising from the healthy control (464.29 ± 716.76) to the stomatitis (1,861.30 ± 1,206.15) to the OSCC group (9,347.98 ± 5,128.54) (p = 0.006). The amount of T. denticola was positively correlated with L. casei (r=0.890, p","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2dd85304980f0bd48a41bb1c25ccbffbe106c581f5d76ece995f5dee1870a4a7","category":"Interdisciplinary"}