{"title":"3D Bioprinting of Alginate-Based Hydrogels to Investigate Osteogenic Differentiation of hBMSCS In Vitro","link":"https://www.preprints.org/manuscript/202408.0693/v1","date":1723428427000,"content":"Three-dimensional (3D) models with improved biomimicry are essential to reduce animal experimentation and drive innovation in tissue engineering. In the current study, we investigate the use of alginate-based materials as polymeric inks for 3D bioprinting of osteogenic models using human bone marrow stem/stromal cells (hBMSCs). A composite bioink incorporating alginate, nano-hydroxyapatite (nHA), type I collagen (Col) and hBMSCs was developed and for extrusion-based printing. Rheological tests perfomed on crosslinked hydrogels confirm the formation of solid-like structures consistently indicating a higher storage modulus compared to the loss modulus. The swelling behaviour analysis showed that the addition of Col and nHA into an alginate matrix can enhance the swelling rate of the resulting composite hydrogels, which maximizes cell proliferation within the structure. The LIVE/DEAD assay outcomes demonstrate that the inclusion of nHA and Col did not detrimentally affect the viability of hBMSCs over seven days post-printing. PrestoBlueTM revealed a higher hBMSCs viability in the alginate-nHA-Col hydrogel compared to the remaining groups. Gene expression analysis revealed that alginate-nHA-col bioink favoured a higher expression of osteogenic markers, including secreted phosphoprotein-1 (SPP1) and collagen type 1 alpha 2 chain (COL1A2), in hBMSCs after 14 days, indicating the pro-osteogenic differentiation potential of the hydrogel. This study demonstrates that the incorporation of nHA and Col into alginate enhances osteogenic potential and provides a bioprinted model to systematically study osteogenesis and the early stages of tissue maturation in vitro.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2ddb17a32fed188415c9d7512c94a8054b7ecd81afae63c8214955ee9c9ecd0e","category":"Interdisciplinary"}