{"title":"Preview: Women’s WorldTour racing continues with Trofeo Alfredo Binda","link":"https://cyclingtips.com/2021/03/preview-womens-worldtour-racing-continues-with-trofeo-alfredo-binda/","date":1616108122000,"content":"<p>The Women&#8217;s WorldTour continues on Sunday, March 21st with Trofeo Alfredo Binda. Organizers were forced to cancel the 2020 edition outright due to the coronavirus pandemic, but the Italian one-day-race is back on this season, much to the joy of the women&#8217;s peloton.</p>\n\n\n\n<p>In years past Trofeo Alfredo Binda has finished in a small bunch sprint, a late-race breakaway, and a solo attack. It&#8217;s one of those races that is really hard to predict or pinpoint what kind of category it falls into, due to a number of factors.</p>\n\n\n\n<p>Trofeo Alfredo Binda does not have the status of Strade Bianche or the Ronde van Vlaanderen and some of the big stars of the sport opt to sit the race out. As a result domestiques and second-tier riders target the Italian-one day as their chance to shine. Up-and-coming riders have also achieved some of their most memorable results at Trofeo Alfredo Binda. </p>\n\n\n\n<p>In a regular season Trofeo Alfredo Binda coincides with a weird lull in the calendar. In between Strade Bianche and Trofeo Alfredo Binda is usually Ronde van Drenthe. After Trofeo Alfredo Binda are the Belgian one-days De Panne, Gent-Wevelgem, and Flanders. For some reason, this order of races means that the Italian race usually feels a little calmer than some of the other one-day events. Perhaps after some Dutch cross-winds and before some Belgian cobbles the peloton just wants to catch its breath. </p>\n\n\n\n<p>This is not to say Trofeo Alfredo Binda isn&#8217;t raced hard and fast. The last two editions of the race have been a season highlight for 2018 and 2019. In fact, Kasia Niewiadoma&#8217;s win in 2018 remains one of the most exciting bike races of all time.</p>\n\n\n\n<figure class=\"wp-block-embed\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"2018 UCI Women&#039;s WorldTour – Trofeo Alfredo Binda – Highlights\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/7e2nrhZv98A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<h2>The course</h2>\n\n\n\n<p>The 141.8 km course navigates one large loop followed by four small loops, all the while climbing and descending the winding Italian roads around Cittiglio. Before setting off on the large loop the peloton does a little warm-up lap to tackle their first queen of the mountains sprint only 18 km into the race.</p>\n\n\n\n<p>After leaving Cittiglio the riders head toward Grantola where they will then climb towards Cunardo. Since this climb is early in the day and only 3.9 km in length it doesn&#8217;t tend to break the peloton apart, but it could be a nasty start to the day for some of the more sprinty riders. Once they&#8217;ve passed through Cunardo they continue to climb before traversing the top of the mountain and descending back towards Cittiglio. </p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/Planimetria-e-Altimetria-ELITE-scaled-2-1340x1899.jpg\" alt=\"\" class=\"wp-image-502996\" width=\"1127\" height=\"1597\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/Planimetria-e-Altimetria-ELITE-scaled-2-1340x1899.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/Planimetria-e-Altimetria-ELITE-scaled-2-650x921.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/Planimetria-e-Altimetria-ELITE-scaled-2-190x269.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/Planimetria-e-Altimetria-ELITE-scaled-2-1080x1531.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/Planimetria-e-Altimetria-ELITE-scaled-2-11x16.jpg 11w, https://cyclingtips.com/wp-content/uploads/2021/03/Planimetria-e-Altimetria-ELITE-2.jpg 1806w\" sizes=\"(max-width: 1127px) 100vw, 1127px\" /><figcaption>Courtesy of <a href=\"https://www.cyclingsportpromotion.com/eventi/trofeo-binda/percorso/\" target=\"_blank\" rel=\"noreferrer noopener\">Cycling Sport Promotion</a>.</figcaption></figure>\n\n\n\n<p>The four final small laps are where the race will be determined. With the 800-metre, 7% climb from Cittiglio to Casalzuigno and the 3.9 km, 4% climb from Cuveglio to Orino, the final four laps are all up and down. These final circuits favour a strong climber or an aggressive rider who is willing to lose. </p>\n\n\n\n<p>Whether it&#8217;s a small group or a large one that comes into the finale together, whoever makes it around the sharp right-hand turn with 300 meters to go has the upper hand as it&#8217;s a false-flat uphill drag from there to the finish. </p>\n\n\n\n<h2>The contenders </h2>\n\n\n\n<p>What is interesting about Trofeo Alfredo Binda is that it has come down to a small bunch sprint. Looking at the profile it&#8217;s easy to assume a climber or rouleur would win the race. In 2017 Coryn Rivera won out of a reduced peloton. </p>\n\n\n\n<p>Judging by how the races have played out in the last year, and especially how Strade Bianche and Omloop Het Nieuwsblad went down, it&#8217;s safe to say this will be a stunning edition of Trofeo Alfredo Binda. The peloton right now is flying. Riders are laying it all on the line, making the racing the most exciting it has ever been. This aggressive style coupled with the course in Italy will reduce the peloton significantly headed into the final loops. </p>\n\n\n\n<p>Teams will need to be smart to take on SD Worx who have proved in the opening races to have the numbers to survive the first half and dominate the second. Being too aggressive could burn energy before the final climbs of the day. Basically, someone with legs, brains, and a strong team will walk away victorious on Sunday.</p>\n\n\n\n<p>Finally, the official startlist has not yet been released, so it&#8217;s unclear if Lotte Kopecky (Liv) will be in Italy or not. If she is, she is one to watch. It&#8217;s possible she is staying in Belgium to focus on the next round of WorldTour races on home soil. Also, Annamiek van Vleuten (Movistar) has opted out of racing Trofeo Alfredo Binda. It&#8217;s a very interesting decision from the European champion, who has not dominated the early races like she did the last couple of years.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"861\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032487-035-1340x861.jpg\" alt=\"\" class=\"wp-image-503045\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032487-035-1340x861.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032487-035-650x417.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032487-035-190x122.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032487-035-1080x694.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032487-035-16x10.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032487-035.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Elisa Longo Borghini during stage 4 of the Giro d’Italia Internazionale Femminile 2020.</figcaption></figure>\n\n\n\n<h3>Elisa Longo Borghini (Trek-Segafredo)</h3>\n\n\n\n<p>Elisa Longo Borghini has been incredibly strong this season already. What she was missing at Strade Bianche was teammates around her. Her usual partner-in-crime Lizzie Deignan, who was sick for Strade Bianche, is back on the startlist for Trofeo Alfredo Binda. For Longo Borghini, having just one teammate there in the finale could be the difference between runner-up and the top step. Someone who can help draw out some of the SD Worx riders, or cover their attacks, depending on how the race plays out.</p>\n\n\n\n<p>Aggressive racing is Longo Borghini&#8217;s bread and butter. She won Trofeo Alfredo Binda solo in 2013 by 1 minute 44 seconds. The more the race is raced full-gas on Sunday, the better for Longo Borghini.</p>\n\n\n\n<p>Also on the start line for Trek-Segafredo is the American national champion Ruth Winder. Winder hasn&#8217;t yet raced in 2021, but the course does suit her. If Winder makes it to the final few climbs her presence will make a huge difference for her teammates. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032828-021-1340x893.jpg\" alt=\"\" class=\"wp-image-503046\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032828-021-1340x893.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032828-021-650x433.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032828-021-190x127.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032828-021-1080x720.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032828-021-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032828-021.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Marianne Vos pictured during Team Jumbo-Visma 2021 winter training camp in Altea, Spain.</figcaption></figure>\n\n\n\n<h3>Marianne Vos (Jumbo &#8211; Visma)</h3>\n\n\n\n<p>Marianne Vos has won Trofeo Alfredo Binda four times. In 2019 she beat Amanda Spratt and Cecilie Uttrup Ludwig in a reduced bunch sprint. In 2009 she won from a break of two, while in 2010 she outsprinted nine others to take the win. Her fourth victory was in 2012 when she won solo by 34 seconds. </p>\n\n\n\n<p>In 2021 Vos has only taken part in two road races, after dedicating the early months of the year to cyclocross. At Strade Bianche she was aggressive, following a few late-race moves, and ended up placing seventh. More recently, Vos was third at GP Oetingen behind Elisa Balsamo (Valcar &#8211; Travel &amp; Service) and Jolien d&#8217;Hoore (SD Worx). </p>\n\n\n\n<p>The course at Trofeo Alfredo Binda is great for Vos, the climbs can eliminate any of the strong sprinters, and Vos can outsprint all of the climbers. Her team has also been strong so far this season, especially in the last couple of races. Anna Henderson and Riejanne Markus will be assets for Vos not only on Sunday but for the rest of the season. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"878\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00029283-010-1340x878.jpg\" alt=\"\" class=\"wp-image-503075\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00029283-010-1340x878.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00029283-010-650x426.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00029283-010-190x124.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00029283-010-1080x708.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00029283-010-16x10.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00029283-010.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Kasia Niewiadoma winning Trofeo Alfredo Binda in 2018.</figcaption></figure>\n\n\n\n<h3>Kasia Niewiadoma and Hannah Barnes (Canyon-SRAM)</h3>\n\n\n\n<p>Kasia Niewiadoma&#8217;s victory in 2018 was a work of beauty. After jumping in a late-race move Niewiadoma soloed to victory in horrendous weather. That year the race had been aggressive for much of the day, and if 2021 is the same, Niewiadoma knows exactly how to manipulate the race to her advantage. Factor in how angry the Polish rider was feeling after Strade Bianche, a race she was targeting, and she will have an extra boost on Sunday. She is hungry for a victory, and there is no reason she can&#8217;t steal the day in Italy. </p>\n\n\n\n<p>Niewiadoma&#8217;s teammate Hannah Barnes is another favourite. Barnes has been strong in 2021, especially at Omloop Het Nieuwsblad where she finished fifth. If it comes down to a small bunch sprint, keep an eye on the former British national champion.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_StradeBianche_2021-0554-1340x893.jpg\" alt=\"\" class=\"wp-image-503057\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_StradeBianche_2021-0554-1340x893.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_StradeBianche_2021-0554-650x433.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_StradeBianche_2021-0554-190x127.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_StradeBianche_2021-0554-1080x720.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_StradeBianche_2021-0554-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_StradeBianche_2021-0554.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Demi Vollering and Ellen Van Dijk on the white roads of Tuscany in the recent Strade Bianche.</figcaption></figure>\n\n\n\n<h3>Demi Vollering (SD Worx)</h3>\n\n\n\n<p>Based on how SD Worx has ridden so far this season this entire list could just be the roster the team is sending to Trofeo Alfredo Binda. They&#8217;ve won five races already this year with five different riders, the most recent being Jolien d&#8217;Hoore at Danilith Nokere Nokerse. </p>\n\n\n\n<p>Demi Vollering was instrumental in Anna van der Breggen&#8217;s victory at Omloop Het Nieuwsblad. She also played a pivotal role at Strade Bianche, won by Chantal van den Broek-Blaak. Now, it&#8217;s her turn to go for it. The course is great for her if she can get away from the likes of Vos and Barnes. Based on how she rode at Omloop Het Nieuwsblad, she can get away. Especially if she has a bunch of teammates supporting her. </p>\n\n\n\n<p>It would be Vollering&#8217;s first WorldTour win, a result that Vollering has been knocking on the door of for a year.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"892\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032375-022-1340x892.jpg\" alt=\"\" class=\"wp-image-503055\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032375-022-1340x892.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032375-022-650x433.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032375-022-190x126.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032375-022-1080x719.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032375-022-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032375-022.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Uttrup Ludwig winning the 2020 Giro dell’ Emilia.</figcaption></figure>\n\n\n\n<h3>Cecilie Uttrup Ludwig (FDJ Nouvelle Aquitaine Futuroscope)</h3>\n\n\n\n<p>Cecilie Uttrup Ludwig has been third at Trofeo Alfredo Binda twice, in 2019 and 2017. Both years it was a reduced bunch sprint, won by a strong sprinter. Uttrup Ludwig has been <a href=\"https://cyclingtips.com/2021/03/cecilie-uttrup-ludwig-if-i-had-the-recipe-to-happiness-i-would-get-rich/\" target=\"_blank\" rel=\"noreferrer noopener\">so close to winning a big race</a>; she&#8217;s been consistently amongst the action for the last three years. Trofeo Alfredo Binda has everything the Danish rider likes in a race. Some climbing, some great opportunities for action, and a fast finish. </p>\n\n\n\n<p>Alongside Uttrup Ludwig will be Marta Cavalli, who had a stellar performance at Strade Bianche. The young Italian rider has made a huge impact on the depth of FDJ Nouvelle Aquitaine Futuroscope, offering Uttrup Ludwig a buddy in the final stages of the races that she was missing last year. Sunday could be the day it all comes together for Uttrup Ludwig, with the help of Cavalli. And if it comes down to a reduced bunch, who doesn&#8217;t want to see Cavalli give Vos a run for her money? </p>\n\n\n\n<h2>The coverage </h2>\n\n\n\n<p>Roughly 90 minutes of coverage will be available starting at 2:30 CET on GCN+ and Eurosport. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00030804-014-1340x893.jpg\" alt=\"\" class=\"wp-image-503078\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00030804-014-1340x893.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00030804-014-650x433.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00030804-014-190x127.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00030804-014-1080x720.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00030804-014-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00030804-014.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>The 2019 Trofeo Alfredo Binda podium: Amanda Spratt, Marianne Vos, and Cecilie Uttrup Ludwig.</figcaption></figure>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/preview-womens-worldtour-racing-continues-with-trofeo-alfredo-binda/\">Preview: Women&#8217;s WorldTour racing continues with Trofeo Alfredo Binda</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"2de1fe8022327c48cc300fc50b98a8c035d99439b26ec0ef3d6e022d0e3c091e","category":"Cycling"}