{"title":"Two months in, Windows 11 is still a work in progress","link":"https://arstechnica.com/?p=1816639","date":1638217761000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Screen-Shot-2021-08-30-at-11.34.41-PM-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Screen-Shot-2021-08-30-at-11.34.41-PM.jpg\">Enlarge</a> <span>/</span> A PC running Windows 11. (credit: Microsoft)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>When we reviewed Windows 11 nearly two months ago, it was obvious that <a href=\"https://arstechnica.com/gadgets/2021/10/windows-11-the-ars-technica-review/8/#h4\">some areas of the operating system were still under construction</a>. Many of the built-in apps were still in need of updates, and a handful of features that had been promised back at Windows 11's unveiling in June were still either in preview or missing entirely.</p>\n<p>Windows 11 now has two months of updates under its belt. Many of those have focused on fixing the OS's early problems, but others have slowly added features to bring it closer to what Microsoft originally announced. We've covered many of those updates as they've been released. But if you're still on the fence about upgrading and you haven't been following closely, we've put together a quick list of bug fixes and features that have come out since Windows 11 was launched, things Microsoft has been testing since early October, and a few things that we still haven't seen.</p>\n<h2>Available to the public</h2>\n\n<p>The initial release of Windows 11 was build number 22000.194 (you can see this number by running \"winver\" from the Run box or the Start menu's search bar). As of the November 2021 update, build number 22000.348, the following things have been added, tweaked, or fixed:</p></div><p><a href=\"https://arstechnica.com/?p=1816639#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1816639&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2de75999e9af36a9f11b2e75de12108a407f23528c7b39ca2ed6cc991573f05f","category":"Tech"}