{"title":"Pelvic rotation correction combined with Schroth exercises for pelvic and spinal deformities in mild adolescent idiopathic scoliosis: A randomized controlled trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307955","date":1722348000000,"content":"<p>by Yafei Zhang, Tingting Chai, Hao Weng, Yang Liu</p>\r\nIntroduction <p>Individualized treatment of spinal deformity is needed for adolescent idiopathic scoliosis (AIS), and the integration of pelvic rotation correction based on proprioceptive neuromuscular facilitation (PNF) into regular physiotherapy may be a promising approach. However, few high-quality studies have investigated its effects. This study aimed to evaluate the efficacy of pelvic rotation correction combined with Schroth exercises in the treatment of mild AIS.</p> Methods <p>This was a randomized controlled trial. Forty-two AIS patients were randomly divided into experimental and control groups. Both groups underwent 20 therapeutic sessions over 24 weeks. All patients (n = 42) performed Schroth exercises at each session. In addition, the experimental group (n = 21) also participated in a pelvic rotation correction program based on PNF at each session. The primary outcome was the concave/convex ratio of hipbone widths, and the secondary outcomes included the Cobb angle, trunk rotation angle, self-perception, apical vertebral translation, and apical vertebral rotation. Patients were evaluated before and after 24 weeks of intervention.</p> Results <p>There was a significant between-group difference in the change from baseline between the experimental and control groups for the following parameters: concave/convex ratio 2.89% (95% confidence interval [CI], 1.58 to 4.20, <i>P</i>&lt;0.001), trunk rotation angle −1.26° (95% CI, −2.20 to −0.32; <i>P</i> = 0.01), and apical vertebral rotation improved by at least one class from baseline in 3 patients (14.3%) in the control group and 9 patients (42.9%) in the experimental group (<i>P</i> = 0.04). While Cobb angle −1.60° (95% CI, −7.75 to 0.54; <i>P</i> = 0.14), self-image 0.149 (95% CI, 0.001 to 0.297; <i>P</i> = 0.049), apical vertebral translation −0.58 mm (95% CI, −3.83 to 2.67; <i>P</i> = 0.72), and pelvic obliquity 0.10° (95% CI, −0.21 to 0.41; <i>P</i> = 0.52) did not differ significantly.</p> Conclusions <p>Pelvic rotation correction combined with Schroth exercises more effectively improved pelvic axial rotation and other spinal deformities, including trunk rotation and apical vertebral rotation, than Schroth exercises alone in the treatment of mild AIS.</p>","author":"Yafei Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2decc78dc05ebfdb4134f5db8391c31585da0427ca702902420a4692b78d087d","category":"Interdisciplinary"}