{"title":"Electroacupuncture versus exercise in patients with knee osteoarthritis: Study protocol for a randomized controlled trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305105","date":1718114400000,"content":"<p>by Xue-Zhou Wang, Rui-Kang Wang, Qiang Liu, Guang-Xia Shi, Bao-Hong Mi, Cun-Zhi Liu, Jian-Feng Tu, Jian-Hao Lin</p>\r\nPurpose <p>Knee osteoarthritis (KOA) is a common disorder among middle and older individuals. Electroacupuncture and exercise are present as two popular physical therapies for the management of KOA, and both were demonstrated to produce considerable results. However, the clinical decision-making process between these therapeutic interventions remains challenging due to the limited evidence of distinctions in their respective effects. This study aims to evaluate the clinical effect and cost effectiveness of electroacupuncture versus exercise in patients with KOA.</p> Study design and methods <p>This is a randomized controlled trial in which 196 symptomatic KOA patients will be randomly assigned 1:1 either to the electroacupuncture group (n = 98) and the exercise group (n = 98). Patients in the electroacupuncture group will receive acupuncture with electric stimulation 3 times a week for 8 weeks, whereas patients in the exercise group will receive neuromuscular training twice a week for 8 weeks. Education concerning KOA management will be provided in both therapies. Co-primary outcomes include changes in numerical rating scale (NRS) and Knee injury and Osteoarthritis Outcome Score (KOOS) Activities of Daily Living (ADL) subscale from baseline at week 8. Secondary outcomes include KOOS Pain subscale, KOOS knee-related Quality of Life (QOL) subscale, Short Form 6 Dimensions (SF-6D), five-level EuroQol five-dimensional questionnaire (EQ-5D-5L), Credibility/ Expectancy Questionnaire, Patient’s global assessment (PGA), 30-second Chair Stand Test (30s-CST), 40m (4*10m) Fast Paced Walk Test (40m FPWT), and Daily Physical Activity level (DPA).</p> Discussion <p>The results of this study will provide evidence regarding differences between these 2 physical therapies in multiple aspects and will provide specific guidance for the development of treatments based on the needs of individual patients.</p> Trial registration <p>ChiCTR2300070376.</p>","author":"Xue-Zhou Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2dee8a4650e373f8faa882c06d772a7f4d0368a5724b7b19c3046197e17e383b","category":"Interdisciplinary"}