{"title":"Synergistic Antifungal Effect and In Vivo Toxicity of the Monoterpene Isoespintanol Obtained from Oxandra xylopioides Diels","link":"https://www.preprints.org/manuscript/202408.1516/v1","date":1724233194000,"content":"Infections due to Candida spp., they are a threat to global health, with high rates of morbidity and mortality due to their drug resistance, especially in immunocompromised people. Thus, the search for new alternatives is urgent today. In recent years, combined therapy with compounds of natural origin has been proposed as an alternative. Considering the biological potential of isoespintanol (ISO) and continuing with its study, the objective of this research was to assess the effect of ISO in combination with the antifungals, fluconazole (FLZ), amphotericin B (AFB) and caspofungin (CASP), against clinical isolates of C. tropicalis and evaluate the cytotoxic effect of this compound in the acute phase (days 0 and 14) and chronic phase (days 0, 14, 28, 42, 56, 70 and 84), in female mice (Mus musculus) of the Balb/c lineage. The results show that ISO can potentiate the effect of FLZ, AFB and CASP, showing synergism with these antifungals. Evaluation of the mice by direct vision showed no behavioral changes or variation in weight during treatment; furthermore, the analysis of the cytokines IFN-γ and TNF in plasma, peritoneal cavity lavage (PCL) and bronchoalveolar lavage (BAL) indicated that there was no inflammation process and histopathological studies of lung, liver and kidney showed no signs of toxicity caused by ISO; this was consistent with the analysis of oxaloacetic transaminases (GOT) and pyruvic transaminases (GPT), which remained in the standard range. These findings indicate that ISO does not have a cytotoxic effect at the doses evaluated. Our results place ISO as a monoterpene of interest in the search for compounds with pharmacological potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2e0367639d23906155a30219adaaa5f6f2291f6ff1a04d2451f198f43d177757","category":"Interdisciplinary"}