{"title":"Seasonality of zooplankton active flux in subtropical waters","link":"https://onlinelibrary.wiley.com/doi/10.1002/lno.12689?af=R","date":1727173455000,"content":"<h2>Abstract</h2>\n<p>The biological carbon pump (BCP) is the mechanism by which the ocean transports organic matter below the mixed layer, exporting or sequestering it for years to millennia. Physical transport of dissolved and particulate organic carbon, the sinking of particles, and the carbon transported by diel and seasonal vertical migrants are the three main mechanisms of the BCP. In the study of active flux, seasonality is almost unknown and changes in ocean productivity during the annual cycle could promote differences in this transport. Here, we show the results of a cruise performed during spring in the Canary Current System, where we studied zooplankton active flux in two transects from the coastal zone off Northwest Africa toward the ocean. We measured biomass and the enzymatic activity of the electron transfer system (ETS) as a proxy for respiration in the water column down to a depth of 900 m. Compared with a previous survey during fall, we found higher values of specific ETS activity in the mesopelagic zone, promoting a higher active flux. Our results showed that the seasonality of active flux is driven not only by differences in biomass but also by differences in respiration rates in the mesopelagic zone, mainly due to differences in zooplankton body size. A review of the zooplankton active flux values around the Canary Islands showed a fourfold increase during spring compared with other seasons. This small window of higher flux should be considered in models of active carbon export in the ocean.</p>","author":"Santiago Hernández‐León, \nAiram Sarmiento‐Lezcano, \nMaría Couret, \nLaia Armengol, \nIone Medina‐Suárez, \nEffrosyni Fatira, \nVíctor Tuset, \nAbdallahi Limam, \nAntonio Sánchez Díez, \nJavier Díaz‐Pérez, \nJosé María Landeira","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"2e10dfcd6c8d20b2372fd033211febb17e6848ccb11f541b86e509e5cfeaae45","category":"Environment"}