{"title":"Effects of Religious Fasting on Markers of Oxidative Status in Vitamin D Deficient and Overweight Orthodox Nuns versus Implementation of Time-Restricted Eating in Lay Women from Central and Northern Greece","link":"https://www.preprints.org/manuscript/202408.1910/v1","date":1724752352000,"content":"Introduction: Mediterranean diet has been widely suggested to exert significant beneficial effects on endothelial oxidative status and cardiometabolic health. Greek Orthodox monasteries, due to their specific nutritionaland sartorial habits, comprise a population which strictly adheres to nutritional patterns with restricted eating and a plant-based subset of the Mediterranean diet, often accompanied by profound hypovitaminosis D. Time –restricted eating is also adopted from a large part of general lay Greek population for health promoting reasons, without restrictions on animal product consumption, as imposed by Orthodox religious fasting. However, comparative eﬀects of these nutritional patterns on oxidative stress markers remain scarce. Aim: The present study attempted to evaluate the effects of Christian Orthodox fasting (COF) in a group of vitamin D –deficient and overweight Orthodox nuns from Central and Northern Greece, compared to the implementation of TRE, 16:8 dietary regimen in a cohort of adult women from the general population from the same region, with regard to markers of endothelial oxidative status. Methods:A group of 50 women from two Orthodox monasteries in Northern Greece and one group of 50 healthy lay women were included. During enrollment a detailed recording of dietary habits was performed, along with a scientific registry of demographic and anthropometric characteristics (via bioimpedance).Orthodox nuns followed a typical Orthodox fasting regimen[daily feeding window (8 am–4 pm)] whereas lay women followed a TRE 16:8 regimen with the same feeding time-window with recommendation to follow a low-fat diet, without characteristics of the Mediterranean diet. We included a complete biochemical analysis, as well as calciotropic proﬁles [Calcium-Ca, Albumin, Parathyroid hormone-PTH, 25-hydroxyvitamin D- 25(OH)D] as well as and markers of TAC (trichloroacetic acid), (glutathione) GSH and thiobarbituric acid reactive substances (TBARS) concentrations, as markers of oxidative status. Results: All groups were comparable at baseline for calcium, PTH and 25(OH)D concentrations, with no signiﬁcant diﬀerences between groups. Orthodox nuns manifested a lower median GSH compared to controls (6.0 vs. 7.2, p 0.04) and a higher median TAC (0.92 vs. 0.77, p","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2e1008e224017cfd327f82fb2813e1ab38e4fc26d083075b2d563b25260ab83d","category":"Interdisciplinary"}