{"title":"Scientists recreated classic origin-of-life experiment and made a new discovery","link":"https://arstechnica.com/?p=1807727","date":1635447599000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/millerTOP-800x534.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/millerTOP.jpg\">Enlarge</a> <span>/</span> Stanley Miller with the original laboratory equipment used in the 1952 Miller-Urey Experiment, which gave credence to the idea that organic molecules could have been created by the conditions of the early Earth's atmosphere.  (credit:  Roger Ressmeyer/Corbis/VCG/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In 1952, a University of Chicago chemist named <a href=\"https://en.wikipedia.org/wiki/Stanley_Miller\" target=\"_blank\">Stanley Miller</a> and his adviser, <a href=\"https://en.wikipedia.org/wiki/Harold_Urey\" target=\"_blank\">Harold Urey,</a> conducted <a href=\"https://en.wikipedia.org/wiki/Miller%E2%80%93Urey_experiment\" target=\"_blank\">a famous experiment</a>. Their results, published the following year, provided the first evidence that the complex organic molecules necessary for the emergence of life (<a href=\"https://en.wikipedia.org/wiki/Abiogenesis\" target=\"_blank\">abiogenesis</a>) could be formed using simpler inorganic precursors, essentially founding the field of prebiotic chemistry. Now a team of Spanish and Italian scientists has recreated that seminal experiment and discovered a contributing factor that Miller and Urey missed. According to <a href=\"https://www.nature.com/articles/s41598-021-00235-4\" target=\"_blank\">a new paper</a> published in the journal Scientific Reports, minerals in the borosilicate glass used to make the tubes and flasks for the experiment speed up the rate at which organic molecules form.</p>\n<p>In 1924 and 1929, respectively, Alexander Oparin and J.B.S. Haldane had hypothesized that the conditions on our primitive Earth would have favored the kind of chemical reactions that could synthesize complex organic molecules from simple inorganic precursors—sometimes known as the \"<a href=\"https://en.wikipedia.org/wiki/Primordial_soup\" target=\"_blank\">primordial soup</a>\" hypothesis. Amino acids formed first, becoming the building blocks that, when combined, made more complex polymers.</p>\n<p>Miller set up an apparatus to test that hypothesis by simulating what scientists at the time believed Earth's original atmosphere might have been. He sealed methane, ammonia, and hydrogen inside a sterile 5-liter borosilicate glass flask, connected to a second 500-ml flask half-filled with water. Then Miller heated the water, producing vapor, which in turn passed into the larger flask filled with chemicals, creating a mini-primordial atmosphere. There were also continuous electric sparks firing between two electrodes to simulate lighting. Then the \"atmosphere\" was cooled down, causing the vapor to condense back into water. The water trickled down into a trap at the bottom of the apparatus.</p></div><p><a href=\"https://arstechnica.com/?p=1807727#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1807727&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2e140ba17c71331428ab1493d3cfdc08b662eb49faa0900edc7258f182e55156","category":"Tech"}