{"title":"Symptomatology and IgG Levels Before and After SARS-CoV-2 Omicron Breakthrough Infections in Vaccinated Individuals","link":"https://www.preprints.org/manuscript/202404.1728/v1","date":1714283282000,"content":"Abstract: (1) Background: After the COVID-19 pandemic, there is increasing concern regarding the immunity of population to SARS-CoV-2 variants, particularly the Omi-cron variant and its sub-lineages. (2) Methods: The study involved analyzing the im-mune response and symptomatology of 27 vaccinated individuals who were subse-quently infected by Omicron sub-lineages. Blood samples were collected for serological analysis, including the detection of IgG antibodies reactive to the Nucleocapsid (N) and Spike (S) antigens of SARS-CoV-2. Additionally, participants were interviewed to assess the intensity of symptoms during the infection. (3) Results: Despite the high levels of anti-Spike IgG observed after vaccination, all participants were infected by Omicron sub-lineages. The most common symptoms reported by participants were fever or chills, sore throat, and cough. Surprisingly, the levels of anti-Spike IgG found prior to infection did not correlate with symptom severity post-infection. However, it was observed that high post-infection anti-Nucleocapsid IgG levels correlates with mild symptoms during the course of the disease, suggesting a potential role for anti-N antibodies in disease resolution. (4) Conclusions: The high levels of IgG anti-Spike resulting from vaccination may not provide complete protection against infection by the Omicron variant. Addi-tionally, our data suggest that anti-Nucleocapsid IgG titers are negatively correlated with the intensity of the symptoms during mild infections. These findings underscore the importance of ongoing surveillance of viral variants and continuous adaptation of vaccination strategies to ensure efficacy against SARS-CoV-2 variants.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2e31e8723e6ce5e86704d4160a397170c05f6c16605150da2697b147057fa00a","category":"Interdisciplinary"}