{"title":"286 Impact of feeding strategies on bodyweight and body condition in mature AI boars","link":"https://academic.oup.com/jas/article/102/Supplement_2/230/7664742?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this experiment was to determine how varying feeding strategies for boars impacts body weight (BW), backfat depth, loin muscle depth, Knauer caliper measurements, flank to flank tape measurement, body condition score (BCS), and scrotal width and length. This experiment was conducted over two 9-wk periods. Boars were weighed and measurements were taken every 3 wk during the study. Boars (n = 28; Acuity and Topig Norvsin) from two age groups (9 and 15 mo) and two genetic lines (maternal and terminal) were used during this experiment. Boars were blocked by breed and age and randomly allocated to receive one of the three feed intake (FI) levels of a corn-soybean meal-based diet (met NRC 2012 nutrient requirements) using the NRC (2012) maintenance equation [ME for maintenance = (100*kg BW<sup>0.75</sup>) + 15 kcal for sperm production]. Treatments were: HIGH (150% of maintenance, n = 9), MAIN (100% of maintenance, n = 10), LOW (80% of maintenance, n = 9) for the first 9-wk period. During the second 9-wk period remaining HIGH and LOW boars were crossed-over to opposite treatments (HIGH-LOW, n = 9; LOW-HIGH, n = 7) and maintenance remained unchanged (MAIN-MAIN, n = 8). Data were analyzed using PROC MIXED in SAS 9.4. Boar was the experimental unit with main effects of feed intake and age, and week serving as a repeated measure. Significance was determined at <span>P</span> &lt; 0.05 and a trend at 0.05 &lt; <span>P</span> ≤ 0.10. Three-way interactions of FI*Age*Week were observed during the first 9-wk period. Young boars fed HIGH had a greater increase in BW (<span>P</span> = 0.002), caliper (<span>P</span> = 0.011), backfat depth (<span>P</span> = 0.003), BCS (<span>P</span> = 0.003), and scrotal width (<span>P</span> = 0.004) than old boars fed HIGH and young boars fed LOW had a greater reduction in these variables then old LOW boars. Boars fed LOW for the first 9-wk period had reduced scrotal length (<span>P</span> = 0.004), greater reduction in BW change (<span>P</span> &lt; 0.001), and reduced tape change (<span>P</span> = 0.021) compared with HIGH and MAIN fed boars. Two-way interactions for the second 9-wk period were observed. HIGH-LOW fed boars had decreased BW (FI*Week; <span>P</span> &lt; 0.001), tape (FI*Week; <span>P</span> = 0.019), caliper (FI*Week; <span>P</span> = 0.012), BCS (FI*Week; <span>P</span> &lt; 0.001), and scrotal width (FI*Week; <span>P</span> = 0.047) while LOW-HIGH boars had increased measurements for these variables over time. Additional two-way interactions during the second 9-wk period included Tape (FI*Age; <span>P</span> = 0.046) and BCS (FI*Age; <span>P</span> = 0.028). Overall young boars had more adverse reactions to the varying feeding strategies than old boars, this included larger changes in BW and composition measures. Young and old boars fed MAIN level lost BW and condition indicating the equation for maintenance energy requirement is not accurate for modern genetics working boars. Future research is needed with varying ages and feed intakes in the boar stud to better understand the impacts of growth, development, and maintenance energy for the modern AI boar.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2e3b449ba66654f99da004865144e5ec8ac90fe9a498e464e4f1c74fc739ae8f","category":"Environment"}