{"title":"Drivers of success in global health outcomes: A content analysis of Exemplar studies","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003000","date":1715263200000,"content":"<p>by Nadia Akseer, David E. Phillips, on behalf of the Exemplars in Global Health Partner Network </p>\r\n\r\nApplying a positive outlier lens is one effective approach for generating evidence to inform global health policy, program, and funding decisions. Exemplars in Global Health (EGH) is a program that studies positive outlier countries that have made extraordinary progress in health outcomes (despite limited resources) and disseminates their successes through multiple types of outputs. To date, EGH has studied, or is studying, 14 global health topics in 28 countries. This paper aims to identify findings, summarized as themes and sub-themes, that appear among all completed EGH studies. We developed a conceptual framework and used a content analysis approach to identify the top thematic areas that appear as drivers for programmatic success across EGH studies that were completed between June 2020-May 2023. The EGH studies (N = 31) spanned six topics including under-five child mortality (n = 6), childhood stunting (n = 5), community health workers (CHW) (n = 4), vaccine delivery (n = 3), COVID-19 response (n = 6), and newborn and maternal mortality reduction (n = 7) across 19 countries in sub-Saharan Africa, Latin America, South and Central Asia, and the Caribbean regions. Top drivers of success were defined as those critical or catalytic in achieving the intended outcome. Eight key drivers were identified: (1) efficient data collection and use for decision-making, (2) strong political commitment and health leadership, (3) effective stakeholder coordination, (4) a local, connected, and capacitated workforce, (5) intentional women’s empowerment and engagement, (6) effective adoption and implementation of national policies, (7) effective and sustainable financing, and (8) equitable, efficient outreach and targeting. These cross-cutting drivers span a broad range of development outcomes, sectors, and populations, and indicate a need to effectively integrate people, systems, and sectors to improve global health outcomes. Findings from this study aim to support peer learning among countries and support evidence-based decision-making for funders, policymakers, and other key stakeholders.","author":"Nadia Akseer","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"2e48f4f4cd8e6e64ed79d4bec17f7ca49cbf513dc6138ab267c101ae77642f19","category":"Environment"}