{"title":"Blue Origin hires advisory firm linked to messy JEDI contract process","link":"https://arstechnica.com/?p=1790956","date":1630501338000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-672158636-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-672158636.jpg\">Enlarge</a> <span>/</span> US Defense Secretary James Mattis gestures to senior advisor Sally Donnelly as they arrive by helicopter in the Afghan capital of Kabul on April 24, 2017. (credit: JONATHAN ERNST/AFP via Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>After losing out on a multibillion dollar NASA contract for a lunar lander to SpaceX in April, Blue Origin has hired a high-profile strategic advisory firm named Pallas Advisors. These high-profile advisors have helped the company as it has gone on to protest the contract loss and eventually sue the space agency.</p>\n<p>The founding partners of the Washington, DC-based advisory firm, Sally Donnelly and Tony DeMartino, are well-known to Jeff Bezos, the founder of both Amazon and Blue Origin. Both Donnelly and DeMartino previously worked as consultants to Amazon before taking jobs at the Department of Defense in 2017, during the Trump administration. There, they gained some unwelcome public notoriety.</p>\n<p>At the Pentagon, Donnelly served as a senior advisor to Secretary of Defense Jim Mattis, and DeMartino worked as his deputy chief of staff. During their time in government service, both Donnelly and DeMartino became embroiled in the controversy surrounding the US Department of Defense award to Microsoft for the $10 billion Joint Enterprise Defense Infrastructure, or JEDI contract, for military cloud computing services.</p></div><p><a href=\"https://arstechnica.com/?p=1790956#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1790956&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2e4e9f6019eb492bf03bf2de91a68d74acbebaf7df790fb86f8c225e65174a07","category":"Tech"}