{"title":"PSI-26 Effects of particle size and enzyme supplementation on the energy value of field peas fed to growing pigs","link":"https://academic.oup.com/jas/article/102/Supplement_3/693/7757573?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>An experiment was conducted to determine if particle size and enzyme supplementation affects the digestible energy (DE), metabolizable energy (ME), and net energy (NE) contents in field peas fed to growing pigs. Male weaned pigs [n = 30; TN70 × TN Tempo; body weight (BW) = 16.5 ± 0.4 kg] were assigned to 1 of 5 dietary treatments: 4 consisting of 50% peas and a corn-soybean meal basal diet. The experiment was carried out as a completely randomized design with treatments arranged in a 2 × 2 factorial design, based on two particle sizes (500μm, 700μm) and two levels of carbohydrase supplementation (0 g/mt, 1,000 g/mt) to give 6 replicates per treatment. Diets were formulated to meet or exceed NRC (2012) requirements. The study was carried out in 3 consecutive periods, each consisting of 15 d; the first 10 d were for adaptation, followed by 5 d of total fecal and urine collection (marker to marker procedure) to calculate DE and ME of diets. The energy content of peas was determined using the difference method. Data were analyzed using the MIXED procedure of SAS. The model included the particle size, enzyme supplementation, and their interaction as a fixed effect. The period was included as a random effect. Least squares means for each treatment were adjusted using Tukey post-hoc test. Dry matter (DM), acid detergent fiber, neutral detergent fiber, gross energy, starch, ash, crude protein, and ether extract contents were analyzed to allow for the prediction of NE content of peas. There were no interactions between particle size and enzyme supplementation on dietary energy values. Also, no main effects of particle size and enzyme supplementation were observed. The average DE, ME, and predicted NE contents for peas were determined to be 3,848, 3,735, and 2,691 kcal/kg DM, respectively. In conclusion, enzyme supplementation and particle size did not influence the DE, ME, and NE contents of the peas.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2e5c5bab44a614ad8a71352caad6df7a7f5c8dfd81cf525bec2746beac143448","category":"Environment"}