{"title":"Combined metabolomic and NIRS analyses reveal biochemical and metabolite changes in goat milk kefir under different fermentation times","link":"https://www.preprints.org/manuscript/202406.0780/v1","date":1718186310000,"content":"Dairy products are an important source of protein and other nutrients in the Mediterranean diet. In these countries the most common source of milk for producing dairies are cow, goat, sheep and buffalo. Andalusia is traditionally the largest producer of goat milk in Spain. Kefir is a fermented product made from bacteria and yeasts which has health benefits beyond its nutritional properties. There is a lack of knowledge about the molecular mechanisms and metabolites that bring about these benefits. In this work, the combination of analytical techniques (GC-FID, UHPLC-MS-QToF, GC-QqQ-MS, and GC-ToF-MS) resulted in the detection of 105 metabolites in kefir produced with goat milk from two different thermal treatments (raw and pasteurized) fermented at four times (12, 24, 36, and 48 h, using 0 h as control). Of these, 27 metabolites differed between kefir produced with raw and pasteurized milk. These changes could be possibly caused by the effect of pasteurization on the microbial population in the starting milk. Some interesting molecules were identified, as shikimic acid, dehydroabietic acid, GABA and tyramine that could be related to antibacterial properties, enhance of immune system and arterial pressure. Moreover, a viability assay of the NIRS technique was performed to evaluate its use on monitoring the fermentation and classification of samples, which had resulted in a 90 % of correct classified samples according to their fermentation time. This study represents the most comprehensive metabolomic analysis of goat milk kefir so far, revealing the intricate changes in metabolites during fermentation and the impact of milk treatment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2e61b5102b7d4411fb245f9a932536ef231057a4e57952a85ef1071b8fab8065","category":"Interdisciplinary"}