{"title":"PSLBI-13 Characterizing the seminal microbiota in mature rams managed on divergent planes of nutrition, and in their male offspring","link":"https://academic.oup.com/jas/article/102/Supplement_3/651/7757746?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Increasing evidence suggests that the bovine semen harbors commensal microbiota, and it may be important in male fertility. However, much is unknown regarding the seminal microbiota, its evolution and factors shaping this community in sheep. The objective of this study was to evaluate whether managing the rams on divergent planes of nutrition can influence the seminal microbiota in mature rams and their male offspring. For this, Rambouillet rams (n = 24; 1.5 to 4 yr old) were randomly assigned to one of three groups: 1) a positive plane of nutrition [target 12% gain in their initial body weight (BW; POS, n = 8); 2) a maintenance [maintain the initial BW (MNT, n = 8)]; and 3) a negative [target a 12% reduction in BW (NEG; n = 8)] plane of nutrition over 84 d. The rams were individually housed and fed a common diet, and feed allocations were adjusted weekly. Following the 84-d feeding period, these rams were used to breed 240 mature Rambouillet ewes (1:10 ram:ewe ratio) over 28 d of breeding. After lambing, the male lambs were maintained on a similar diet for 124 d. Semen samples from the mature rams (F0 generation) were collected on d 28, 56, and 84, and semen samples from offspring rams (F1 generation) were collected at 330 d of age via electroejaculation. Genomic DNA was extracted from semen samples and the seminal microbiota characterized using 16S rRNA gene (V3-V4) sequencing. Several environmental and negative extraction controls were also sequenced to assess potential contaminants in these samples. Overall community structure of the seminal microbiota in F0 rams was not affected by the divergent planes of nutrition (PERMANOVA: <span>P</span> ≥ 0.05) or by sampling time (<span>P</span> &gt; 0.05). Microbial richness (observed ASVs) was also not different (<span>P</span> &gt; 0.05) between the three groups of F0 rams at any of the sampling time points; however, microbial diversity (<span>P</span> &lt; 0.05) in the F0 rams was influenced by sire dietary treatment. Microbial community structure, richness and diversity did not differ among the POS, MNT and NEG F1 generation rams (<span>P</span> &gt; 0.05). Actinobacteriota, Firmicutes, Bacteroidota, Proteobacteria and Fusobacteriota were the most abundant phyla. Only Bacteroidota abundance was significantly (<span>P</span> &lt; 0.05) different between three F0 groups, with POS rams had greater (18.6%) of this phylum on d 28 as compared with MNT (2.1%) and NEG (5.1%). The predominant genera identified included <span>Fastidiosipila</span>, <span>Corynebacterium</span>, <span>Trueperella</span>, <span>Arthrobacter</span>, <span>Dietzia</span>, <span>Bifidobacterium</span>, <span>Streptobacillus</span>, <span>Ornithinimicrobium</span>, and <span>Porphyromonas</span>, and their relative abundance was not affected (<span>P</span> &gt; 0.05) by the dietary treatment in F0 rams. Overall, rams managed on positive and negative planes of nutrition harbored similar seminal microbiota to control rams, and divergent nutrition also had no effect on the offspring ram seminal microbiota.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2e7e2b77d664bfbc926fe4c5a3cd2dd0eec9d6bac41d1e7c1357641742acdc09","category":"Environment"}