{"title":"299 Building and maintaining an engaged undergraduate equine research team","link":"https://academic.oup.com/jas/article/102/Supplement_2/19/7664846?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>An objective of the equine science program at Penn State is to provide the training and knowledge students need to solve problems in their lives and careers. The Equine Research Team at Penn State (PSERT) is a novel approach to meeting this objective, inspired by Dr. Max Kleiber’s “Tracer Team”, a group of faculty and graduate students that successfully studied kinetics of phosphorus and calcium metabolism in dairy cows at the University of California, Davis in the 1950s and 60s. The team allows us to address several objectives that are not easily approached using more traditional teaching environments found in the classroom or laboratory. These include 1) satisfying the demand for research experience from a large number of students, who come to research with an enormous range of ability and enthusiasm, 2) providing the hand on practice utilizing the scientific method to solve problems in the equine industry, 3) building a sense of personal responsibility and simultaneously cooperation by approaching research as a team, 4) creating an environment of academic and creative achievement outside the traditional grading system, and 5) blurring the lines that traditionally separate academic and social life at a university to create an environment much closer to what students will experience as graduates. In spring 2008, 10 undergraduate students sought formal research experience opportunities in the area of equine science. Students were organized into a team that met biweekly. Project leaders registered for independent study course credits and conducted 3 research studies in yr 1, while the rest of the team participated as volunteers. Fourteen years later, the team is still an important student organization with between 40 to 60 members on an annual basis. Over the years, the team has traveled to universities and important equine industry locations throughout the United States. Members have conceived, conducted, analyzed and presented research studies on a wide range of topics within the sphere of equine science. The team has two faculty advisors, an executive committee analogous to most student organizations, a group of research project leaders, and approximately 60 dues paying student members. The biweekly meeting is organized and led by the executive committee and generally contains the following components: update of activities, seminar provided by an outside speaker from industry or academia who has expertise in the area of equine research, presentation by one of the research project leaders, and group discussion of the project, planning of future research projects. This Equine Research Team has been and continues to be a model that can be utilized by others to successfully facilitate undergraduate student engagement in research.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2e8d56c51ad9e48e23262fa2470c9a341e431aad07f55e9e142931842ed3f8b3","category":"Environment"}