{"title":"Dental Students’ Awareness Regarding Implementation of Digital Dentistry in Prosthodontics - A Questionnaire-Based Study","link":"https://www.preprints.org/manuscript/202410.1191/v1","date":1728986681000,"content":"Computer-aided design/computer-aided manufacturing (CAD-CAM) technology is growing in significance for prosthodontic treatment due to its impact on clinical performance and patient outcomes. It has been integrated into dental education to allow students to experience digital workflows. Despite these advancements, many dental students still lack sufficient knowledge of CAD-CAM technologies. A cross-sectional survey was conducted at the College of Dentistry, Imam Abdulrahman Bin Faisal University. Based on previous studies, a validated questionnaire was distributed to undergraduate dental students and interns. The questionnaire assessed their knowledge and attitudes toward CAD-CAM technology in prosthetic dentistry. The responses were analyzed using descriptive statistics, and a chi-square test was used to study the association between knowledge and practice and the study year level. A total of 170 students participated in the study, with a mean age of 22.2 (±2.5) years. The proportion of female participants was 65.9%, and 34.1% for males. Knowledge varied across academic levels, with 4th- and 5th-year students demonstrating greater theoretical knowledge, while 6th-year students and interns showed more practical experience. Only three of the 18 knowledge-related questions received a correct response rate above 70%. Most participants (86%) reported acquiring knowledge from undergraduate courses, and 88% expressed interest in further training. CAD-CAM technology was most commonly practiced for fixed prostheses, and intraoral scanning was the most frequently used digital workflow. The study highlights the need to improve CAD-CAM education. While lower-level students displayed solid theoretical knowledge, advanced students benefitted from more practical exposure. Increasing hands-on experience and access to digital equipment is essential for preparing students to meet the demands of modern digitalized dentistry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2e915ce1e06b167569e38b11576463f5eb69c6daf5acf470259ac6b6d309f6ae","category":"Interdisciplinary"}