{"title":"Emerging Contaminants Related to Brazilian Aquaculture","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12967?af=R","date":1727864127000,"content":"<h2>ABSTRACT</h2>\n<p>Research efforts around the world have focused on identifying the occurrence of emerging contaminants in aquaculture areas. In the Brazilian context, studies have aimed to identify emerging contaminants in water used for this activity. This systematic review covered studies published without a specific time frame with the following criteria: research conducted in aquaculture areas or with species and cultured water in Brazil and analysis of emerging contaminants. Out of the 42 studies identified, 132 emerging contaminants were observed. The Southeast and South regions accounted for most of these studies, with limited research conducted in the North and Northeast regions. Tilapia was the most studied species, followed by mollusks. In toxicity tests, animals showed several effects, such as decreased oxygen consumption and swimming patterns, histopathological changes, inhibition of sperm production, cardiac edema, spinal deformity, and antimicrobial resistance. In conclusion, advancements in research on emerging contaminants in Brazilian aquaculture are needed as the number of existing studies is lower compared to global numbers. Few studies have focused on analyzing cultivation sites to identify the contaminants present and their sources. Also noteworthy is the scarcity of work in the Northern region of Brazil and on native species. Characterizing these environments in terms of the types of contaminants and main sources of contamination is essential to finding ways to mitigate ecological and human health risks, as well as developing specific legislation for these contaminants because they are currently not part of routine monitoring programs and are therefore not regulated, especially in aquaculture environments.</p>","author":"Juliana Barros da Mota, \nThiago de Alencar Neves, \nDaniel Pereira da Costa, \nMaria Clara Vieira Martins Starling, \nCamila Costa de Amorim, \nKleber Campos Miranda‐Filho","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"2e92050584615ae47cd17e33d7260ecb96a4c1dab3d8e373ead4bacad9811b78","category":"Environment"}