{"title":"How to pan and zoom Continuity Camera in macOS","link":"https://www.macworld.com/article/2158264/how-to-pan-zoom-continuity-camera-macos.html","date":1703149200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>One of the previous advantages of third-party virtual camera apps (like Camo from Reincubate) over a built-in or add-on webcam used with your Mac is that they let you use an iPhone as a webcam for FaceTime, Zoom, and other videoconferencing apps. Apple changed that equation by adding <a href=\"https://www.macworld.com/article/817000/how-to-continuity-camera-iphone-webcam-for-your-mac.html\">Continuity Camera</a>, which lets your iPhone appear as another video input to any app on your Mac.</p>\n\n\n\n<p>But there was still a virtual camera advantage: Continuity Camera showed you framed in the view of your phone’s Ultra Wide camera or followed you around with Center Stage. But you couldn’t get the advantage of a place between those options: zooming in or out and panning within the frame.</p>\n\n\n\n<p>Apple added that feature quietly in a way that’s hard to discover in macOS Sonoma. Sonoma raised the profile of the video menu from Ventura and previous macOS releases. Before Sonoma, you used a combination of options in the Control Center, in a simplified video app, and in individual apps to control Continuity Camera features, like Center Stage, Portrait, and Studio Light, as well as microphone modes.</p>\n\n\n\n<p>In Sonoma, all those features are centralized in the video menu. (FaceTime still offers access to camera options in the self-view in macOS, too.) With any app open that accepts video input, like FaceTime or Zoom, the video menu appears. Choose the menu and you see a video preview. Now, hover over the preview. A dial-like indicator with two buttons labeled among the following:</p>\n\n\n\n<ul>\n<li>0.5 for Ultra Wide</li>\n\n\n\n<li>1 for Main</li>\n\n\n\n<li>2 for Telephoto on most iPhones that have this third lens</li>\n\n\n\n<li>3 for Telephoto on the iPhone 15 Pro</li>\n\n\n\n<li>5 for Telephoto on the iPhone 15 Pro Max</li>\n</ul>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/mac911-zoom-sonoma-sbs.png?w=1200\" alt=\"macOS Facetime zoom\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/mac911-zoom-sonoma-sbs.png?quality=50&amp;strip=all 1255w, https://b2c-contenthub.com/wp-content/uploads/2023/11/mac911-zoom-sonoma-sbs.png?resize=300%2C227&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/11/mac911-zoom-sonoma-sbs.png?resize=768%2C581&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/11/mac911-zoom-sonoma-sbs.png?resize=1200%2C908&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"908\" /><figcaption><p>At left, 0.5x is selected and 1 is shown as the next increment; at right, 2x is selected and 1 is similarly shown as the next increment. (Video preview removed for clarity.)</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>You can tap the button to jump to a lens and magnification or drag to move through smaller increments. An x appears after the number to indicate it’s the selected camera zoom factor.</p>\n\n\n\n<p>Within the preview, you can drag to pan to move the area shown within the larger frame. Click Recenter to center the frame within the camera’s full field of view.</p>\n\n\n\n<p>This pan-and-zoom feature only works when Center Stage is disabled. If you are using Desk View, you are limited to Main to Telephoto range, as the Ultra Wide camera is in use for Desk View.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Kevin.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2e945912ef9716d27dd7b8c021b67d108b66fc0cab56d964a90dd5cbfa199583","category":"Apple"}