{"title":"Life Cycle Assessments in Renewable Energy: Solar and Wind Perspectives","link":"https://www.preprints.org/manuscript/202405.0148/v1","date":1714728133000,"content":"The growing urgency for sustainable energy solutions necessitates a deeper understanding of the environmental impacts of renewable technologies. This article aims to synthesize and analyze Life Cycle Assessments (LCA) in this domain, providing a comprehensive perspective. We systematically categorize 2,923 articles into four communities: (1) Photovoltaic systems, (2) Wind energy systems, (3) Materials for auxiliary industry of photovoltaic and wind systems, and (4) Solar thermal systems. A comparative analysis is conducted to identify methodological consistencies and disparities across these communities. The findings reveal diverse methodological approaches and a range of environmental impacts, highlighting the complexities in assessing renewable energy systems. The article underscores the significance of material selection in photovoltaic and wind systems, providing a critical overview of the current state of LCA research in renewable energy and stressing the need for standardized methodologies. It also identifies gaps in recent research, offering insights for future studies focused on integrating environmental, economic, and social considerations in renewable energy assessments.As a case study, an LCA was used to evaluate two energy supply methods for a sensor network: one connected to the public grid and another powered by a photovoltaic panel. The off-grid system, while more environmentally friendly by reducing reliance on non-renewable energy sources, posed challenges due to the high environmental impact of battery production and disposal. Integrating environmental assessments provides a robust framework for making informed decisions on sustainable technologies. The findings are critical for projects that balance technological needs with sustainability goals.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2e99af426321ea4f50d31c191225116428499f6a75d9f927651cf1c5502d7819","category":"Interdisciplinary"}