{"title":"How to find and insert special characters in macOS","link":"https://www.macworld.com/article/232439/how-to-find-and-insert-special-characters-in-macos.html","date":1690183800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Unicode is a massive, sprawling effort that pairs a number to every unique character in a language, every punctuation mark, every math symbol, and much more. And nearly all of it is available within macOS but not always easy to find.</p>\n\n\n\n<p>If you are trying to type unique characters such as the Euro sign or a pound sign see this separate story: <a href=\"https://www.macworld.com/article/671016/how-type-at-euro-hash-special-characters-mac.html\">How to type Æ, €, #, @, © and more special characters on a Mac</a>.</p>\n\n\n\n<p>There’s a semi-hidden way to access special symbol sets in Unicode, and a somewhat obscure method of searching for specific symbols across all of macOS’s included Unicode characters.</p>\n\n\n\n<p>First:</p>\n\n\n\n<ul>\n<li><b>In macOS 12 Monterey or earlier:</b> Go to <i> &gt; System Preferences &gt; Keyboard</i> and make sure that “Show keyboard and emoji viewers in menu bar” is checked.</li>\n\n\n\n<li><b>In macOS 13 Ventura or later:</b>: Go to <i> &gt; System Settings &gt; Keyboard</i>, click Edit next to Input Sources (under Text Input), and enable “Show Input menu in menu bar.”</li>\n</ul>\n\n\n\n<p>Now, in the menu bar, click the tiny palette that has a command (⌘) key in it and select <em>Show Emoji &amp; Symbols</em>. The Character Viewer that appears shows emoji by default, and with an input cursor in any app or form field that lets you type in text, you can double-click emoji to insert them or drag them into a document.</p>\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/article/2019/02/mac911-character-viewer-settings-100787718-large.jpg?auto=webp&amp;quality=85,70\" alt=\"mac911 character viewer settings\" loading=\"lazy\" /><figcaption><p>The Character Viewer lets you add sets to select from.</p></figcaption></figure></div>\n\n\n\n\n<p>But that’s not the semi-hidden part. Click the gear icon (Monterey or earlier) or More … icon (Ventura or later) in the upper left and choose <em>Customize List</em> and expand the <em>Symbols</em> section. You can now check boxes next to any commonly used Unicode sets you might want to use in documents or email. This can be handy for dingbats (typographic frills and pre-emoji symbols), universal signs (like for plastics and recycling), or currency symbols.</p>\n\n\n\n<p>The obscure part of this process offers even more options once you understand how to access them. You might notice a Search field in the upper-right corner of the Character Viewer. It’s not immediately obvious what you can search for. The viewer lets you match against characters you type, but also against any part of any name of a Unicode entity.</p>\n\n\n\n<p>For instance, type “recycling” and you’ll see all the recycling symbols; type “heart,” and the viewer matches all the emoji hearts, dingbat hearts, and hearts in playing card symbols. (You can also find all variants of h, e, a, r, and t across the written form of different languages.)</p>\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/article/2019/02/mac911-character-viewer-search-heart-100787717-large.jpg?auto=webp&amp;quality=85,70\" alt=\"mac911 character viewer search heart\" loading=\"lazy\" /><figcaption><p>Search for heart, and Character Viewer matches all items for which “heart” is part of the name.</p></figcaption></figure></div>\n\n\n\n\n<p>This can be particularly useful if you’re trying to find something slightly obscure or elegant, like a one-half ½ mark (search on “half”), and don’t want to scroll through the endless Unicode set.</p>\n\n\n\n<p>Note: If you’re sending files or email to other people who aren’t using a Mac or iOS, some of the symbols may not appear depending on the configuration of their system: they need a font installed that includes the special characters, or they may see what user-interface and type people call “tofu:” an unfilled upright rectangle that indicates no character in the font is available to display the symbol.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently along with answers and links to columns: \n<a href=\"https://www.macworld.com/article/228117/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to \n<a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a> including screen captures as appropriate, and whether you want your full name used. Every question won’t be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nMac, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2ea2bf0c20e2cd5020ac626e17b608cfa3b414e5e1933e15ce1265a36536acea","category":"Apple"}