{"title":"Apple’s Own Announcement of Their Lawsuit Against NSO Group","link":"https://www.apple.com/newsroom/2021/11/apple-sues-nso-group-to-curb-the-abuse-of-state-sponsored-spyware/","date":1637713527000,"content":"\n<p>Apple Newsroom:</p>\n\n<blockquote>\n  <p>Apple’s legal complaint provides new information on NSO Group’s\nFORCEDENTRY, an exploit for a now-patched vulnerability previously\nused to break into a victim’s Apple device and install the latest\nversion of NSO Group’s spyware product, Pegasus. The exploit was\noriginally identified by the Citizen Lab, a research group at the\nUniversity of Toronto. [...]</p>\n\n<p>NSO Group and its clients devote the immense resources and\ncapabilities of nation-states to conduct highly targeted\ncyberattacks, allowing them to access the microphone, camera, and\nother sensitive data on Apple and Android devices. To deliver\nFORCEDENTRY to Apple devices, attackers created Apple IDs to send\nmalicious data to a victim’s device — allowing NSO Group or its\nclients to deliver and install Pegasus spyware without a victim’s\nknowledge. Though misused to deliver FORCEDENTRY, Apple servers\nwere not hacked or compromised in the attacks.</p>\n</blockquote>\n\n<p>A couple of things are interesting about this. First, Apple repeatedly refers to the “FORCEDENTRY” exploit by name. This is not PR bullshit — they’re talking about a very specific exploit. Second, they refer to Android as their compatriot, not their competitor. There’s a time and place for Apple to brag about iOS being more secure than Android, but this isn’t it. The message here: “This isn’t just about us, NSO Group is after everyone.”</p>\n\n<p>Lastly, the phrase “the immense resources and capabilities of nation-states”. This is Apple hammering home the fact that deliberate backdoors would be exploited. They’re up against countries with, effectively, infinite money and resources to find and exploit <em>accidental</em> vulnerabilities. If there were deliberate backdoors, the game would be over before it started.</p>\n\n<blockquote>\n  <p>Apple commends groups like the Citizen Lab and Amnesty Tech for\ntheir groundbreaking work to identify cybersurveillance abuses and\nhelp protect victims. To further strengthen efforts like these,\nApple will be contributing $10 million, as well as any damages\nfrom the lawsuit, to organizations pursuing cybersurveillance\nresearch and advocacy.</p>\n</blockquote>\n\n<p>The New York Times story on this mentioned that Apple would be donating any damages from the lawsuit, if they win. It’s a nice touch that they’re donating $10 million no matter what happens in court. Citizen Lab and Amnesty Tech did crackerjack work exposing this exploit.</p>\n\n<blockquote>\n  <p>Apple is notifying the small number of users that it discovered\nmay have been targeted by FORCEDENTRY. Any time Apple discovers\nactivity consistent with a state-sponsored spyware attack, Apple\nwill notify the affected users in accordance with industry best\npractices.</p>\n</blockquote>\n\n<p>Interesting!</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/11/23/apple-newsroom-nso-group-lawsuit\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"2ec2cccc9efc0c27af904edbaf284969b68b4e39aeb0d7b3b7f2a7bbacbb5946","category":"Tech"}