{"title":"Apple’s child safety features: Outrage grows over on-device photo scanning","link":"https://www.macworld.com/article/352875/apple-ios-15-csam-scanning-icloud-photos-messages-siri-search-faq.html","date":1628852400000,"content":"<div>\n<section><div></div></section><p>Apple <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/child-safety/#footnote-1&amp;subid1=1-1-352875-1-0-0\">announced last week</a> that it will begin scanning all photos uploaded to iCloud for potential child sexual abuse material (CSAM). It’s come under a great deal of scrutiny and generated some outrage, including from Apple employees. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reuters.com/technology/exclusive-apples-child-protection-features-spark-concern-within-its-own-ranks-2021-08-12/&amp;xcust=1-1-352875-1-0-0&amp;sref=https://www.macworld.com/feed\">A Reuters report</a> said that hundreds of messages have flooded Apple’s Slack channels with worries over the new system. Here’s what you need to know about the <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/child-safety/pdf/Expanded_Protections_for_Children_Frequently_Asked_Questions.pdf&amp;subid1=1-1-352875-1-0-0\">new technology</a> before it rolls out later this year.</p>\n\n\n\n<figure><div>\n\n</div></figure><h2>What are the technologies Apple is rolling out? </h2>\n\n\n\n<p>Apple will be rolling out new anti-CSAM features in three areas: Messages, iCloud Photos, and Siri and Search. Here’s how each of them will be implemented, according to Apple.</p>\n\n\n\n<p><strong>Messages:</strong> The Messages app will use on-device machine learning to warn children and parents about sensitive content.</p>\n\n\n\n<p><strong>iCloud Photos: </strong>Before an image is stored in iCloud Photos, an on-device matching process is performed for that image against the known CSAM hashes.</p>\n\n\n\n<p><strong>Siri and Search:</strong> Siri and Search will provide additional resources to help children and parents stay safe online and get help with unsafe situations.</p>\n\n\n\n<h2>When will the system arrive?</h2>\n\n\n\n<p>Apple says the Messages and Siri and Search features will arrive in iOS 15, iPadOS 15, and macOS Monterey. To be clear, Apple doesn’t say the technologies will arrive when iOS 15 lands, so it could come in a follow-up update. The iCloud Photos scanning doesn’t have a specific date for release but will presumably arrive later this year as well.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/apple-OS-family.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The new CSAM detection tools will arrive with the new OSes later this year.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Does this mean Apple will be able to see my photos?</h2>\n\n\n\n<p>Not exactly. Here’s how Apple explains the technology: Instead of scanning images in the cloud, the system performs on-device matching using a database of known CSAM image hashes provided by the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.missingkids.org/HOME&amp;xcust=1-1-352875-1-0-0&amp;sref=https://www.macworld.com/feed\">National Center for Missing and Exploited Children</a> (NCMEC) and other child safety organizations. Apple further transforms this database into an unreadable set of hashes that is securely stored on users’ devices.</p>\n\n\n\n<h2>But Apple is scanning photos on my device, right?</h2>\n\n\n\n<p>It is. However, Apple says the system does not work for users who have iCloud Photos disabled. It is not yet clear if that scanning is only performed on images uploaded to iCloud Photos, or all images are scanned and compared but the <em>results</em> of the scan (a hash match or not) are only sent along with the photo when it’s uploaded to iCloud Photos.</p>\n\n\n\n<h2>What happens if the system detects CSAM images?</h2>\n\n\n\n<p>Since the system only works with CSAM image hashes provided by NCMEC, it will only report photos that are known CSAM in iCloud Photos. If it does detect CSAM, Apple will then conduct a human review before deciding whether to make a report to NCMEC. Apple says there is no automated reporting to law enforcement, though it will report any instances to the appropriate authorities.</p>\n\n\n\n<h2>Could the system mistake an actual photo of my child as CSAM?</h2>\n\n\n\n<p>It’s very unlikely. Apple says the likelihood that the system would incorrectly flag any given account is less than one in one trillion per year. And if it does happen, an human review would catch it before it escalated to the authorities. There is an appeals process in place for anyone who feels their account was flagged and disabled in error.</p>\n\n\n\n<h2>Can I opt out of the iCloud Photos CSAM scanning?</h2>\n\n\n\n<p>No, but you can disable iCloud Photos to prevent the feature from working. It is unclear if doing so would turn off Apple’s on-device scanning of photos, but the results of those scans (matching a hash or not) are only sent when the image is uploaded to iCloud Photos. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/apple-csam-messages.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<h2>Is Apple scanning all of my photos in Messages too?</h2>\n\n\n\n<p>Not exactly. Apple’s safety measures in Messages are designed to protect children and are only available for child accounts set up as families in iCloud.</p>\n\n\n\n<h2>So how does it work?</h2>\n\n\n\n<p>Communication safety in Messages is a completely different technology than CSAM scanning for iCloud Photos. Rather than using image hashes to compare against known images of child sexual abuse, it analyzes images sent or received by Messages using a machine learning algorithm for <em>any</em> sexually explicit content. Images are <em>not</em> shared with Apple or any other agency, including NCMEC. It is a system that parents can enable on child accounts to give them (and the child) a warning if they’re about to receive  or send sexually explicit material.</p>\n\n\n\n<h2>Can parents opt-out?</h2>\n\n\n\n<p>Parents need to specifically enable the new Messages image scanning feature on the accounts they have set up for their children, and it can be turned off at any time.</p>\n\n\n\n<h2>Will iMessages still end-to-end encrypted?</h2>\n\n\n\n<p>Yes. Apple says communication safety in Messages doesn’t change the privacy features baked into messages, and Apple never gains access to communications. Furthermore, none of the communications, image evaluation, interventions, or notifications are available to Apple. </p>\n\n\n\n<h2>What happens if a sexually explicit image is discovered?</h2>\n\n\n\n<p>When the parent has this feature enabled for their child’s account and the child sends or receives sexually explicit images, the photo will be blurred and the child will be warned, presented with resources, and reassured it is okay if they do not want to view or send the photo. For accounts of children age 12 and under, parents can set up parental notifications that will be sent if the child confirms and sends or views an image that has been determined to be sexually explicit.</p>\n\n\n\n<h2>What’s new in Siri and Search?</h2>\n\n\n\n<p>Apple is enhancing Siri and Search to help people find resources for reporting CSAM and expanding guidance in Siri and Search by providing additional resources to help children and parents stay safe online and get help with unsafe situations. Apple is also updating Siri and Search to intervene when users perform searches for queries related to CSAM. Apple says the interventions will include explaining to users that interest in this topic is harmful and problematic and provide resources from partners to get help with this issue.</p>\n\n\n\n<h2>Can the CSAM system be used to scan for other image types?</h2>\n\n\n\n<p>Apple says the system is only designed to scan for CSAM images. However, Apple could <em>theoretically</em> augment the hash list to look for known images related to other things, such as LGBTQ+ content.</p>\n\n\n\n<h2>What if a government forces Apple to scan for other images?</h2>\n\n\n\n<p>Apple says it will refuse such demands. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/apple-csam-hash.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<h2>Do other companies scan for CSAM images?</h2>\n\n\n\n<p>Yes, most cloud services, including Dropbox, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://protectingchildren.google/intl/en/&amp;xcust=1-1-352875-1-0-0&amp;sref=https://www.macworld.com/feed\">Google</a>, and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.microsoft.com/en-us/photodna&amp;xcust=1-1-352875-1-0-0&amp;sref=https://www.macworld.com/feed\">Microsoft</a>, as well as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.facebook.com/safety/onlinechildprotection&amp;xcust=1-1-352875-1-0-0&amp;sref=https://www.macworld.com/feed\">Facebook</a> also have systems in place to detect CSAM images. These all operate by decrypting your images in the cloud to scan them.</p>\n\n\n\n<h2>So why are people upset?</h2>\n\n\n\n<p>While most people agree that Apple’s system is appropriately limited in scope, experts, watchdogs, and privacy advocates are concerned about the <em>potential</em> for abuse. For example, Edward Snowden, who exposed global surveillance programs by the NSA and is living in exile, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/Snowden/status/1423469854347169798?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1423469854347169798%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fthenextweb.com%2Fnews%2Fapple-csam-scanning-experts-concerns-analysi&amp;xcust=1-1-352875-1-0-0&amp;sref=https://www.macworld.com/feed\">tweeted</a> “No matter how well-intentioned, Apple is rolling out mass surveillance to the entire world with this. Make no mistake: if they can scan for kiddie porn today, they can scan for anything tomorrow.” Additionally, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/EFF/status/1423377779043627009&amp;xcust=1-1-352875-1-0-0&amp;sref=https://www.macworld.com/feed\">the Electronic Frontier Foundation criticized the system</a> and Matthew Green, a cryptography professor at Johns Hopkins, explained the potential for misuse with the system Apple is using.</p>\n\n\n\n<figure><div>\n<blockquote><p>A number of people pointed out that these scanning technologies are effectively (somewhat limited) mass surveillance tools. Not dissimilar to the tools that repressive regimes have deployed — just turned to different purposes.</p>— Matthew Green (@matthew_d_green) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/matthew_d_green/status/1423093801699135488?ref_src=twsrc%5Etfw&amp;xcust=1-1-352875-1-0-0&amp;sref=https://www.macworld.com/feed\">August 5, 2021</a></blockquote></div></figure><p>People are also concerned that Apple is sacrificing the privacy built into the iPhone by using the device to scan for CSAM images. While many other services scan for CSAM images, Apple’s system is unique in that it uses on-device matching rather than images uploaded to the cloud.</p>\n\n\n\n<h2>Could Apple be blocked from implementing its CSAM detection system?</h2>\n\n\n\n<p>It’s hard to say, but it’s likely that there will be legal battles both before and after the new technologies are implemented. </p>\n\n\n\n<figure><div>\n\n</div></figure>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2ec561df20d5a1ba33b6ca291351fbfe7d4c99af683ceb6716d6d6aca696c0b6","category":"Apple"}