{"title":"Wi-Fi 7’s theoretical speeds make your Internet connection seem even more sad","link":"https://arstechnica.com/?p=1994345","date":1704746876000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-1366078470-1-800x450.jpg\" alt=\"Wi-Fi turning over from 6 to 7 in blocks\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-1366078470-1-scaled.jpg\">Enlarge</a> <span>/</span> The tilt of the numerical right-most block may not accurately reflect the degree to which we, collectively, are upgraded to Wi-Fi 7 at this stage. (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Wi-Fi 7 devices can now be certified by the Wi-Fi Alliance. The new standard can provide higher throughput, linked wireless bands for better stability, and reduced latency. It also can make people who skipped over Wi-Fi 6E feel like they made the smart move.</p>\n<p>Wi-Fi 7 has already existed as a thing that expensive, new routers claimed to offer, but now it's <a href=\"https://www.wi-fi.org/news-events/newsroom/wi-fi-alliance-introduces-wi-fi-certified-7\">a certification they can claim</a>. Wi-Fi 7 devices can use 320 MHz of channel bandwidth, compared to the typical 160 MHz used by Wi-Fi 5, 6, and 6E gear. The new standard is the first to offer Multi-Link Operation, which can bond a connection across 2.4, 5, and 6 GHz connections, offering greater speed and more reliable connections when moving in and out of range of various bands.</p>\n<div><img alt=\"Intel's explainer for what Wi-Fi 7 means, compared to prior generations.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/intel_wifi7.jpeg\" /><p>Intel's explainer for what Wi-Fi 7 means, compared to prior generations. (credit: Intel)</p></div>\n<p>As Intel puts it <a href=\"https://www.intel.com/content/www/us/en/products/docs/wireless/wi-fi-7.html#\">in its explainer</a>, earlier Wi-Fi channels were like moving vans that could \"only take one highway at a time and choose alternate routes if they run into traffic. However, Wi-Fi 7 semi-trucks will simultaneously operate across two highways to get more boxes to the destination more quickly.\"</p></div><p><a href=\"https://arstechnica.com/?p=1994345#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1994345&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2ec86c86733aae53126a9d73d7257d77a7df25fccf3e9dfd5484e04d7b18d79d","category":"Tech"}