{"title":"Mitchell's New Role at HashiCorp","link":"https://www.hashicorp.com/blog/mitchell-s-new-role-at-hashicorp","date":1626987600000,"content":"<p>Today, I have some exciting news that I wanted to share with the broader HashiCorp community: I am transitioning into a new role as a full-time individual contributor and off of the HashiCorp executive team.</p>\n<p>I founded HashiCorp in 2012 and served as CEO until 2016, and then became one of our CTOs until today. After nearly 10 years of learning and growing as an executive, I'm ready and excited to step back into a full-time engineering position and look forward to making a meaningful impactful with this new role. This change has been years in planning and is now possible thanks to HashiCorp’s maturity and the excellent leadership team we now have in place.</p>\n<p>I feel the best way to explain more details about this change is to simply share the email I wrote to our employees, so I’ve included that below. I look forward to continuing to talk with you all as part of our community as I pursue my new role.</p>\n<p>Here’s my email to our employees:</p>\n<p>Hi everyone,</p>\n<p>Beginning today, I'll be transitioning into a new role here at HashiCorp as an individual contributor focused on engineering. This is something I'm very excited about and that the executive team and I have planned for a long time. I'd like to take the opportunity in this email to fill in the background about this change and describe what this means for me and the company going forward.</p>\n<p>Ever since founding HashiCorp, I've felt it's important to build a company where I'm not required for day-to-day operations and where other leaders can step in at the right phase. I believe this is necessary for a company to be resilient and long-lasting. This mindset could be seen as early as 2016 when Armon [Dadgar] and I proactively sought out a CEO to succeed us and lead the company forward. In our search we found Dave [McJannet] and he was, and continues to be, the right leader for the next phases of the company. At that time, I stepped into a new role as CTO, one that has been better suited to me for the last few years.</p>\n<p>There are also personal elements to this decision. I founded HashiCorp as an engineer passionate about infrastructure tooling. But as a founder, my role at times has had to expand well beyond and away from that. That's the price of being a founder: you do whatever is necessary of you, even if there are parts of the role that don’t particularly motivate you. And over the course of nearly a decade building HashiCorp into a multi-billion dollar company, I've continuously reaffirmed that I'm still an engineer at heart and I'm ready to more officially get back to focusing on that.</p>\n<p>HashiCorp is once again at a place where I feel the company and I are ready for me to step into a new role. The HashiCorp leadership team is strong and I trust them completely. The business is healthy and I have complete optimism about the future.</p>\n<p>In my new role, I will be an individual contributor either on specific product teams or exploring other ideas within HashiCorp. I will continue to participate with leadership in certain big-picture planning such as major product plans, messaging for HashiConf keynotes, and other strategic decisions. I'll continue to be a full-time HashiCorp employee. However, as I step into this role, I will officially no longer be a member of the executive team and will therefore no longer have access to executive meetings, plans, or decisions.</p>\n<p>Coinciding with my role change, I am also stepping down from the HashiCorp board. While we've decided to match the timing, I'd like to stress that this was a decision we made years ago and is not related at all to my changing role. As a startup matures into a later stage, it is expected for the board to have more independent members and it is typical for only one founder to be on a late-stage board alongside the CEO. I fully trust Armon and Dave to represent the employees, myself included.</p>\n<p>While I will no longer be on the executive team or board, I will remain a passionate and active HashiCorp employee and engineering leader. I'm very excited to be able to dedicate more of my time towards product and engineering challenges and to spend more of my day-to-day time working directly alongside members in those organizations. My experience, voice, and expertise remain fully available to everyone in the company.</p>\n<p>I'm incredibly proud that as an executive, I helped HashiCorp grow from nothing to nearly 1,500 employees with a valuation of over $5 billion. Looking forward, the company has a huge opportunity, and I'm excited to continue working with you all to build and grow the company and make an impact in my new role.</p>\n<p>Best,\n<br />\nMitchell</p>","author":"Mitchell Hashimoto","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"2edcd86623320b907b7d52475029de58f78600ee6692ca5f227ff128f61f3c8a","category":"Tech"}