{"title":"Don’t call it a mountain bike: 2022 BMC URS LT gravel bike gets front suspension","link":"https://www.cyclist.co.uk/news/10128/2022-bmc-urs-lt-gravel-bike","date":1632501412000,"content":"<span>\n      <span><a href=\"/authors/matthew-loveridge\">Matthew Loveridge</a></span>\n  </span><div>  \n  <div>      <div><span>25 Sep 2021</span></div>    </div></div><p>\nSwiss brand launches ‘fully micro-suspended’ gravel bike with SRAM eTap AXS mullet gearing</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/09/bmc-urs-lt-1_copy.jpg?itok=F-VvPAGQ\" />  </div>\n<div>\n      <p> Arriving hot on the heels of the gravel-adjacent <a href=\"/news/10114/2022-bmc-roadmachine-x\" target=\"_blank\">Roadmachine X</a>, the 2022 BMC URS LT is a pure gravel bike with coil-sprung front suspension and a squishy elastomer at the rear. The URS LT – LT stands for ‘long travel’ – features a full-carbon frameset and will come in a choice of 1× SRAM eTap AXS mullet builds, where road shifters are matched to Eagle AXS mountain bike rear derailleurs and cassettes.</p>\n<p>The SRAM Rival eTap AXS-based build will cost €5,999 while the Force model is €7,999. Both are available to buy immediately, with UK pricing to be confirmed.</p>\n<h2>2022 BMC URS LT: ‘Fully micro-suspended’</h2>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/09/bmc-urs-lt-riding_copy.jpg?itok=bEZYk3pP\" />  </div>\n</div>\n<p>With 20mm of coil-sprung suspension built into the steerer, and 10mm of rear wheel travel courtesy of an elastomer at the rear, BMC describes the URS LT as ‘fully micro-suspended’, rather than full-suspension.</p>\n<p>The fork arrangement is strongly reminiscent of Cannondale’s Headshok system, with the visible part of the suspension sitting below the headtube.</p>\n<p>The coil shock comes from suspension specialist Hiride and offers 20mm of travel, with a hydraulic damper to keep things under control. BMC is offering three different spring weights to accommodate a range of rider weights and riding styles.</p>\n<p>The back end features the same ‘softail’-style system employed on the original URS, with an elastomer interrupting the dropped seatstays to offer a claimed 10mm of rear wheel travel.</p>\n<p>With top tube mounts for a bag or other accessories, built-in protection on the fork dropouts, downtube and chainstays, dropper compatibility, support for dynamo lights, and clearance for 700×45mm tyres, the URS LT is designed to be a full-fledged gravel and adventure machine, one that edges dangerously close to cross-country mountain bike territory, but doesn’t succumb to flat bars.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/09/bmc-urs-lt-shock.jpg?itok=DolAmVa3\" />  </div>\n</div>\n<p>It looks set to take on the likes of the <a href=\"/specialized/2957/specialized-s-works-diverge-review\" target=\"_blank\">Specialized Diverge</a> – which uses the Future Shock steerer-based suspension system and also offers 20mm of front travel – and joins a small but fast-growing list of gravel bikes with bouncy bits.</p>\n<p>The geometry is progressive too, with some of the longest reach figures we’ve seen in this segment, matched to correspondingly short stems. A medium bike, for example, has 415mm of reach and a 70mm stem, which should contribute to easier going manners on the trail compared to more road bike-esque designs. </p>\n<p>It’s notable that despite the recent launch of SRAM’s gravel-specific XPLR components, BMC has gone even more off-road with the gearing, with huge 10-52 mountain bike cassettes and 38-tooth chainrings on both standard builds. Incidentally, the frame supports 1× only, unlike the Roadmachine X.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/10116/bianchi-matta-s9-the-stunning-italian-titanium-bike-youve-never-heard-of\">Bianchi Matta S9: The stunning Italian titanium bike you've never heard of</a></div>      <div><a href=\"/in-depth/1015/paris-roubaix-all-you-need-to-know\">Paris-Roubaix 2021: Route, start list and all you need to know</a></div>    </div></div><h2>BMC URS LT pricing and specs</h2>\n<h3>BMC URS LT One</h3>\n<ul>\n<li><strong>Groupset:</strong> SRAM Force 1 AXS / SRAM X01 Eagle AXS</li>\n<li><strong>Wheels:</strong> CRD-400 carbon tubeless</li>\n<li><strong>Price:</strong> €7,999</li>\n</ul>\n<h3>BMC URS LT Two</h3>\n<ul>\n<li><strong>Groupset:</strong> SRAM Rival eTap AXS / SRAM GX Eagle AXS</li>\n<li><strong>Wheels:</strong> DT Swiss G1800 aluminium</li>\n<li><strong>Price:</strong> €5,999</li>\n</ul>\n  </div>\n<div>  \n  <div>      <div><a href=\"/cyclocross-gravel-and-adventure\">Cyclocross, gravel and adventure</a></div>    </div></div>","author":"MLoveridge","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"2eebfa7495b10bc47f66a02da9443db724e45b61b6f2c669671599b07d098057","category":"Cycling"}