{"title":"Lotus’s กับการนำ Salesforce เข้ามาปรับธุรกิจเพื่อเข้าสู่ยุคของการใช้ข้อมูลตอบความต้องการลูกค้า","link":"https://www.blognone.com/node/135239","date":1691756314000,"content":"<div><div><div><p>องค์กรในทุกวันนี้ล้วนมีประสบการณ์ต้องปรับเปลี่ยนเข้าโลกดิจิทัลกันอย่างมากในช่วง 10 ปีที่ผ่านมา โดยเฉพาะในช่วง COVID ที่การนำธุรกิจเข้าสู่โลกดิจิทัลเป็นเรื่องจำเป็น แต่องค์กรหนึ่งที่อาจจะต้องปรับตัวมาเป็นพิเศษกว่าธุรกิจอื่น ๆ จากหลายปัจจัย คือ Lotus’s ที่นอกจากจะต้องปรับตัวเพื่อรับมือกับ COVID แล้ว ยังเป็นช่วงเวลาใกล้เคียงกับการเข้าไปเป็นส่วนหนึ่งของเครือเจริญโภคภัณฑ์ ที่ซื้อกิจการ Tesco Lotus จากกลุ่ม Tesco เมื่อปลายปี 2020 ซึ่งหมายถึงการย้ายระบบไอทีทั้งหมดภายในเวลาที่กำหนด</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/hXvMhqV.jpg\" /></p>\n<p>วิภาคส์ ตระการรังสี รองผู้อำนวยการฝ่ายพัฒนาระบบซอฟต์แวร์และนวัตกรรม โลตัส เล่าถึงระบบเดิมของ Lotus’s ว่าระบบซอฟต์แวร์ภายในนั้นมีความซับซ้อนและมีระบบภายในจำนวนมาก เริ่มตั้งแต่ระบบจัดหาสินค้ามาจำหน่าย, ระบบจัดการการขนส่งสินค้า, ไปจนถึงการทำการตลาด ระบบเดิมของที่ Lotus’s ใช้งานมานั้นเน้นความปลอดภัยเป็นสำคัญ และฟีเจอร์ต่างๆ ไม่มากนักเมื่อเทียบกับระบบในท้องตลาดทำให้ปรับตัวตามธุรกิจลำบากในบางครั้ง การที่ CP Group เข้าไปซื้อกิจการ Lotus’s ทำให้ต้องย้ายระบบออกทั้งหมดโดยแต่ละระบบมีเงื่อนไขเวลาต่างกันไป แต่ทีมงานก็ต้องรับผิดชอบให้การย้ายระบบนี้กระทบต่อธุรกิจน้อยที่สุด</p>\n<p>กระบวนการย้ายระบบเริ่มจาก export ข้อมูลออกจากระบบเดิมเข้ามายังระบบใหม่ขึ้นมารองรับเพื่อให้ทำงานได้ต่อเนื่อง โดยจังหวะที่ย้ายข้อมูลออกมาก็ต้องมีการทำความสะอาดข้อมูล (data cleansing) เพื่อให้ข้อมูลมีความถูกต้องเชื่อถือได้ และระบบเดิมจะมีข้อมูลหลายแหล่ง การย้ายระบบครั้งนี้จึงถือโอกาสรวมข้อมูลเข้าด้วยกันเพื่อให้ทุกระบบเห็นภาพเดียวกัน (single source of truth)</p>\n<p>Lotus’s เลือกใช้ Salesforce โดยมีแนวคิดว่าต้องการระบบสำเร็จรูปพร้อมใช้เพื่อความเร็วในการย้ายระบบ โดยเลือกจากการพัฒนาระบบเดิมที่ผ่านมาและแผนการพัฒนาระบบต่อไปในอนาคต อีกจุดหนึ่งที่ทีมงานของ Lotus’s ตัดสินใจเลือก Salesforce เพราะต้องการ ecosystem ที่รายล้อมระบบของ Salesforce และมีบริการต่างๆ ที่ทำงานร่วมกับ Salesforce ได้จำนวนมาก</p>\n<p>ขณะเดียวกับการย้ายระบบนี้ก็ต้องเตรียมพร้อมสำหรับการรองรับธุรกิจในอนาคต โดยทีมงานตัดสินใจเลือก Salesforce แทบครบทั้งชุด ตั้งแต่ Salesforce CRM, <a href=\"https://www.salesforce.com/ap/products/marketing-cloud/customer-data-platform/\">Salesforce Marketing Cloud</a>, Salesforce Data Cloud โดยฟีเจอร์ของ Salesforce ทำให้ทาง Lotus’s สามารถใช้ฟีเจอร์ระดับชั้นนำในตลาด สร้างแคมเปญที่ถูกใจลูกค้าได้ดียิ่งขึ้น โดยการใช้ Salesforce ทั้งระบบทำให้ทีมมาร์เก็ตติ้งเห็นข้อมูลบนแพลตฟอร์มได้ครบถ้วน การรวมข้อมูลบน Salesforce Data Cloud ทำให้ฐานข้อมูลลูกค้าของ Lotus’s มีขนาดเล็กลง ลดข้อมูลที่ซ้ำซ้อนออกไปและรู้จักลูกค้าแต่ละคนดีขึ้น การสร้างแคมเปญต่างๆ สามารถวัดผลความสำเร็จได้อย่างชัดเจนว่าแต่ละแคมเปญตอบโจทย์ลูกค้าหรือไม่ ไม่ต้องลองผิดลองถูกเหมือนเดิม นับว่าเป็นส่วนหนึ่งของการทำ Digital Transformation ที่ทำให้การทำธุรกิจอยู่บนข้อเท็จจริงที่วัดผลได้ มีข้อมูลรองรับ</p>\n<p>ระหว่างการย้ายระบบออกจากระบบเดิมของ Tesco ก็เป็นช่วงเดียวกับที่ต้องอิมพลีเมนต์แพลตฟอร์มใหม่เพื่อรองรับการซื้อสินค้าออนไลน์ในช่วง COVID ทาง Lotus’s ปรับปรุงการส่งสินค้าที่ซื้อผ่านช่องทางออนไลน์จากเดิมส่งจากร้านเพียง 8 ร้านเท่านั้น กลายเป็นร้านค้ากว่า 2,000 ร้านทำให้สามารถส่งสินค้าได้เร็วขึ้น ลูกค้าสามารถติดต่อกับพนักงานเมื่อเกิดปัญหาได้ง่ายเพราะเป็นการติดต่อสาขาใกล้ที่พัก ขณะเดียวกันก็ต้องเพิ่มจำนวนสินค้าที่รองรับการสั่งซื้อออนไลน์ให้ใกล้เคียงกับหน้าร้านที่สุดเท่าที่เป็นไปได้</p>\n<p>ระบบหนึ่งที่ Lotus’s ใช้งานปรับปรุงระบบภายในคือ MuleSoft ที่เข้ามาช่วยเชื่อมระบบของ Salesforce เข้ากับระบบต่างๆ ได้อย่างรวดเร็ว สามารถเชื่อมต่อกับระบบต่างๆ ในตลาดได้ครบถ้วนทำให้การเชื่อมระบบของ Lotus’s เข้าด้วยกันทำได้เร็วขึ้น ในอนาคตแม้จะมีซอฟต์แวร์ใหม่ๆ เพิ่มเข้ามาก็ยังสามารถเชื่อมระบบเข้ากับระบบต่างๆ ของ Lotus’s ได้ในเวลาอันรวดเร็ว ทุกวันนี้ระบบจำนวนมากภายใน Lotus’s เชื่อมเข้าหากันผ่านทาง MuleSoft โดยเฉพาะระบบฝั่งออนไลน์ที่ต้องการอัพเดตจำนวนสินค้าในสต็อกในระดับเกือบเรียลไทม์เพื่อลดปัญหาลูกค้าสั่งสินค้าแต่ไม่มีสินค้าในสต็อก</p>\n<p>วิภาคส์เน้นถึงความได้เปรียบของการใช้ซอฟต์แวร์สำเร็จรูปที่มีการใช้งานในตลาดอย่าง Salesforce ว่าช่วยให้ Lotus’s ปรับตัวโดยใช้เวลาน้อยลง มีพาร์ตเนอร์ที่มีความเชี่ยวชาญพร้อมช่วยอิมพลีเมนต์ระบบได้อย่างมีประสิทธิภาพ และมี ecosystem ที่ช่วยเสริมฟีเจอร์ต่างๆ ที่ Lotus’s ต้องการสร้างความได้เปรียบทางธุรกิจอย่างต่อเนื่อง</p>\n<p>สามารถศึกษาเพิ่มเติมได้ที่<br />\n<a href=\"https://www.salesforce.com/ap/resources/customer-stories/cp-lotus/\">https://www.salesforce.com/ap/resources/customer-stories/cp-lotus/</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/salesforce\">Salesforce</a></div></div></div>","author":"blognone","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2efb29dcf8a2eac32b18438c593058428e9b1cce6b93dfd036a747b7e74b9057","category":"Thai"}