{"title":"Adaptive shell-morphological differences and differential fitness in two morphospecies of Lanistes (Gastropoda: Ampullariidae) from the northern region of the Malawi Basin","link":"https://academic.oup.com/evolinnean/article/doi/10.1093/evolinnean/kzae010/7738179?rss=1","date":1724198400000,"content":"<span><div>Abstract</div>Environment–phenotype correlations are a central pattern of adaptive radiations, but such correlations and the expected associated reciprocal differences in fitness of divergent phenotypes in their respective niches are rarely demonstrated. Ecophenotypic plasticity may result in environment–phenotype correlations too, however, so that certain observed morphological differences, even in adaptive radiations, may result from plasticity instead of differential adaptation. Here, we examine the nature of observed morphological differences in two morphospecies of <span>Lanistes</span> gastropods from the northern region of the Malawi Basin that are part of an ongoing adaptive radiation. We subjected experimental populations of each of these two morphospecies, i.e. <span>L.</span> sp. (<span>solidus</span>-like), which occupies intralacustrine habitats with comparatively stable environmental conditions, and <span>L.</span> sp. (<span>ovum</span>-like), which occurs in satellite waterbodies with fluctuating environmental conditions, to a common garden experiment in the laboratory. Our experimental conditions approximated those of stable, intralacustrine habitats. We monitored fecundity and subjected wild-caught parents and intraspecific <span>F</span><sub><span>1</span></sub> offspring to semilandmark geometric morphometrics. <span>L.</span> sp. (<span>solidus</span>-like) exhibited higher fecundity than <span>L.</span> sp. (<span>ovum</span>-like). Whereas wild-caught parents of both morphospecies had similar shell sizes, 9-month-old <span>F</span><sub><span>1</span></sub> offspring of <span>L.</span> sp. (<span>solidus</span>-like) were significantly smaller than those of <span>L.</span> sp. (<span>ovum</span>-like), indicating slower growth. Substantial shell-morphological differences were observed between the two morphospecies in the wild-caught parents as well as in <span>F</span><sub><span>1</span></sub> offspring, indicating that shell-morphological differences are genetically inherited. Our results also indicate differential fitness but fully reciprocal transplant experiments would be required to demonstrate local adaptation.</span>","author":"","siteTitle":"Evolutionary Journal of the Linnean Society Current Issue","siteHash":"3a6bf3189332aa8d860b0369d5aa2ac065f7385b7c3f4543469ad2a55950d26a","entryHash":"2efdd42a057dc769d6b59ad064714e902e45ac1100c9fb83b17ac3277c5bc56f","category":"Environment"}