{"title":"ฟีเจอร์ Live Translate บน Pixel 6 แปลแคปชั่นสด แปลข้อความ และใช้กล้องแปลภาพแบบออฟไลน์ได้","link":"https://www.blognone.com/node/124860","date":1632220254000,"content":"<div><div><div><p>XDA Developers ทำการทดสอบฟีเจอร์การแปลสดที่ Google ยังไม่เปิดตัว ในมือถือซีรีส์ Google Pixel 6 ต่อยอดจากฟีเจอร์ Live Caption โดยเป็นการ<a href=\"https://www.blognone.com/node/124035\">ใช้ชิป Tensor</a> แปลภาษาทันทีจากแหล่งต่างๆ ทั้งแอป Message, Live Caption และกล้องถ่ายภาพ</p>\n<p>XDA Developers เห็นฟีเจอร์นี้จากแหล่งข่าวไม่เปิดเผยตัวตน ผู้ได้ลองใช้ Pixel 6 Pro ก่อนวางจำหน่าย พบว่าภายในโทรศัพท์มีแอป Android System Intelligence ที่รวมฟีเจอร์ใหม่ไว้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/01a0c0eac44e2319b667a75416c5327e.png\" /></p>\n<p>XDA Developers ยังพบว่านอกจากแปลแคปชั่นสดแล้ว Live Translate จะสามารถแปลข้อความในแอป Messaging แปลภาพจากกล้องในสไตล์ Google Lens (แต่ยังไม่แน่ชัดว่าจะเพิ่มมาในแอป Camera เลยหรือเปล่า) และแปลภาษาพูดแบบใน Google Pixel Buds ได้อีกด้วย โดยผู้ใช้อาจต้องโหลดแพ็กเกจภาษาต่างๆ เพิ่ม ก่อนใช้งานได้แบบออฟไลน์</p>\n<p>ส่วนการแปลแคปชั่นแบบสด ผู้ใช้จะต้องเปิดใช้งาน Live Caption ก่อน ซึ่งใน Android 12 บน Pixel 6 Pro จะแยกไปอยู่ในหมวดตั้งค่า “Languages &amp; translation” และหากดูจากการตั้งค่าแบบใหม่แล้ว Live Caption น่าจะรองรับภาษาเพิ่มเติม เช่น ฝรั่งเศส, เยอรมัน, อิตาลี, ญี่ปุ่น, โปรตุเกส, และสเปน<br />\n<img src=\"https://www.blognone.com/sites/default/files/externals/ef6a9427e4251f67b5c7bd7328589829.png\" /></p>\n<p>Live Translate น่าจะเป็นอีกฟีเจอร์ที่โชว์พลังการทำงานของชิป Tensor ในด้านการประมวลผลแมชชีนเลิร์นนิ่งในเครื่องได้แบบทันที ส่วนประสิทธิภาพเมื่อใช้งานจริงจะเป็นอย่างไร คงต้องติดตามหลัง Google Pixle 6 เปิดตัว ช่วงฤดูใบไม้ร่วง หรือเดือนกันยายน-พฤศจิกายนนี้</p>\n<p>ที่มา - <a href=\"https://www.xda-developers.com/google-pixel-6-live-translate-screenshots/\">XDA Developers</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-pixel-6\">Google Pixel 6</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/translation\">Translation</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2eff9d73ab7340ac0153ee328b64aee94cd142c915b130b5d75561ae8460d1d8","category":"Thai"}