{"title":"WTB’s new gravel tyres, a pocket workshop from Wolf Tooth, slip-ons from Chrome and GripGrab’s new oversocks","link":"https://www.bikeradar.com/features/first-look-friday/first-look-friday-wtb-vulpine-gravel-tyres/","date":1637917202000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/FLF-26th-November-2021-39e8644.jpg?quality=45&amp;resize=620,413\" />                                            <p>What’s even more exciting than <a href=\"https://www.bikeradar.com/news/black-friday-bike-deals/\">Black Friday</a>? First Look Friday of course! Who wants to bag an extra 8 per cent off a TV when you could instead tuck into another edition of BikeRadar’s weekly round-up of the latest and greatest cycling tech?</p>\n<p>A smart tool from Wolf Tooth and some Chrome slip-ons that blend form and function are among the tasty morsels in the buffet today, but before we sink our teeth into this week’s line-up, let’s look at what else has gone live on BikeRadar over the past seven days.</p>\n<p>We’ve gone big on bike reviews in particular, with tests of the <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/3t-exploro-racemax-boost-review/\">3t Exploro RaceMax Boost</a>, <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/orbea-orca-aero-m10iltd-review/\">Orbea Orca Aero M10iLTD</a>, <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/vitus-zenium-crs-ultegra-di2-review/\">Vitus Zenium CRS Ultegra Di2</a> and <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/colnago-v3-rival-axs-review/\">Colnago V3 Rival AXS</a>.</p>\n<p>Technical editor-in-chief Robin Weaver has kept the chill at bay testing a selection of long-sleeve mountain bike jerseys, with the <a href=\"https://www.bikeradar.com/reviews/clothing/jerseys/altura-esker-trail-long-sleeve-jersey-review/\">Altura Esker Trail</a>, <a href=\"https://www.bikeradar.com/reviews/clothing/jerseys/endura-singletrack-fleece-jersey-review/\">Endura Singletrack Fleece</a>, <a href=\"https://www.bikeradar.com/reviews/clothing/jerseys/madison-zenith-thermal-jersey-review/\">Madison Zenith Thermal jersey</a>, <a href=\"https://www.bikeradar.com/reviews/clothing/jerseys/rapha-trail-windblock-jersey-review/\">Rapha Trail Windblock</a> and <a href=\"https://www.bikeradar.com/reviews/clothing/jerseys/scott-trail-storm-shirt-review\">Scott Trail Storm</a> all being put through their paces on his local test loops.</p>\n<p>Given how chilly the weather has suddenly got, though, if you think a long-sleeve jersey just isn’t going to cut it on the trails right now, be sure to check out our guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-mountain-biking/\">best mountain bike jackets of 2021</a>.</p>\n<p>Temporarily reduced electronics may receive much of the attention today, but cycling kit is similarly affected by the Black Friday phenomenon. We’ve got all the best deals covered on our up-to-the-minute <a href=\"https://www.bikeradar.com/news/black-friday-bike-deals/\">Black Friday</a> page, so do stop by if you are on the hunt for a bargain.</p>\n<h2>GripGrab Flandrien Waterproof Knitted Road oversocks</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> GripGrab’s updated Flandrien oversocks promise protection against the elements with an understated design.</span></figcaption><span> <i>Sam Challis / Immediate Media</i></span></div>\n<p>I’m a fan of oversocks for a number of reasons. First, I often find full-blown overshoes to be too fiddly: who wants to get out of breath and frustrated before you even start riding? Slipping on what is essentially a bulked-up sock is a far more pleasant experience.</p>\n<p>They also suit the type of riding I tend to do: short, sharp blasts on local roads, where the ingress of the damp and cold only needs to be delayed rather than indefinitely blocked out, because I’ll be home before I get uncomfortable.</p>\n<p>In that regard, GripGrab’s new Flandrien Waterproof Knitted Road shoe covers fit the bill perfectly. GripGrab has kept the user-friendliness and insulation of a traditional <i>Belgian bootie, </i>but has added a water-resistant membrane to make sure they shrug off showers and puddle splashes.</p>\n<p>The design is pleasingly understated, so should work well with whatever kit they are worn alongside, and the undersides of the covers have sections of plastic reinforcement to improve their resistance to wear and tear.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A reinforced toe should bump up the oversocks’ durability.</span></figcaption><span> <i>Sam Challis / Immediate Media</i></span></div>\n<p>BikeRadar’s deputy editor, Jack Luke, tested the previous generation of these overshoes last year. While he absolutely adored how warm, waterproof and close-fitting they were, he did manage to wear out the area around the toe quite quickly. The changes seen on these new overshoes should hopefully address some of those problems.</p>\n<ul><li><strong>GripGrab Flandrien Waterproof Knitted Road oversocks: </strong>£64.95 / €69.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Chrome Dima 3.0 Slip-On shoes</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Chrome says the Dima 3.0s are robust and practical.</span></figcaption><span> <i>Sam Challis / Immediate</i></span></div>\n<p>Chrome’s new Dima 3.0 Slip-On shoes look fairly simple in design, but don’t let that fool you. They pack in a deceptively large number of features in an attempt to create the ideal shoe for both on- and off-bike activity.</p>\n<p>Working from the top down, the upper is made from a nylon weave that Chrome says is durable, water-repellent and quick-drying, and the toe is reinforced further with a rubber bumper.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The upper is made from tough nylon and uses a rubber toe bumper.</span></figcaption><span> <i>Sam Challis / Immediate Media</i></span></div>\n<p>Hiding underneath the insole is a PowerPlate nylon shank that is in there to stiffen the rear portion of the shoe. Chrome says this should facilitate more efficient pedalling. The PowerPlate doesn’t extend along the full length of the shoe though, leaving the front to flex freely so the shoes remain comfortable to walk in.</p>\n<p>Speaking of walking, the Dima 3.0’s Panaracer vulcanised no-slip rubber outsole should all but guarantee the user will stay firmly planted whatever terrain they choose to traverse.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A sole made from Panaracer rubber should be grippy and durable.</span></figcaption><span> <i>Sam Challis / Immediate Media</i></span></div>\n<ul><li><strong>Chrome Dima 3.0 Slip-On shoes:</strong> £95 / €105 / $95 / AUS $175</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n\n<h2>WTB Vulpine tyres</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Vulpine name is back in WTB’s line-up.</span></figcaption><span> <i>Sam Challis / Immediate Media</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/news/wtb-vulpine/\">Vulpine</a> name recently re-entered WTB’s tyre range. The name was originally attributed to a <a href=\"https://www.bikeradar.com/reviews/components/tyres/mountain-bike-tyres/wtb-vulpine-2-1in-29er-tyre-review/\">mountain bike semi-slick</a> favoured by cross-country racers, and the apple hasn’t fallen too far from the tree in its latest incarnation.</p>\n<p>WTB still positions the Vulpine as a go-fast tyre, but the brand has now shifted the Vulpine’s use-case to gravel riding.</p>\n<p>The latest Vulpine comes in a 36mm nominal width and uses a low-profile, closely-spaced tread to facilitate high speeds over less technical gravel terrain.</p>\n<p>The overall tread structure mimics the rounded profile of a high-volume road tyre, with a high central spine giving way to closely-spaced rows of knobs that taper down towards the side wall.</p>\n<p>WTB says in contrast to more squared-off tyres with prominent shoulder knobs, this should promote confident cornering on a range of riding surfaces.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Closely-packed centre tread and sculpted shoulder knobs should let the Vulpines roll fast and corner well.</span></figcaption><span> <i>Sam Challis / Immediate Media</i></span></div>\n<p>Given that the Vulpine’s 36mm stated width is on the narrow side for a full-blown gravel bike, we’d be inclined to say the tyres’ <i>raison d’etre</i> is to maximise the riding potential of the latest generation of big-clearance ‘all-road’ bikes, which makes it a neat addition to WTB’s range.</p>\n<ul><li><strong>WTB Vulpine 60tpi version:</strong> £44.99 / $65.95</li>\n<li><strong>WTB Vulpine SG2 120tpi version:</strong> $74.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n\n<h2>Wolf Tooth 8-Bit Kit One</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The 8-Bit Kit One is pretty neat when packed down.</span></figcaption><span> <i>Sam Challis / Immediate Media</i></span></div>\n<p>Wolf Tooth affords its ‘8-Bit’ designation to individual tools that are ingenious in their own right, but can also combine to form what is essentially a super tool.</p>\n<p>That super tool is the 8-Bit Kit One, and it looks to have the capability to get you back up and rolling no matter what mechanical issue befalls you out on the road.</p>\n<p>The 8-Bit Kit One is made up of Wolf Tooth’s 8-Bit pack pliers, 8-Bit tyre lever and 8-Bit chainbreaker and utility knife. They fix together via magnets and machined pins to form a neat system that weighs 172g.</p>\n<p>It is compact enough to fit in a decent-sized saddlebag or sit unobtrusively in a jersey pocket, yet boasts 22 different functions.</p>\n<p>They range from the basic, such as tightening up hex bolts and removing tyres, up to more specialist actions such as straightening dented metal rims and cleaning sealant from valve cores.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Kit One opens out into a veritable toolbox.</span></figcaption><span> <i>Sam Challis / Immediate Media</i></span></div>\n<p>All the 8-Bit tools are available to buy individually, but if bought together the user stands to save £23, essentially getting the 8-Bit tyre lever tool for free. Considering the 8-Bit Kit One has most of the functionality of a full-scale workshop, that sounds like a pretty sweet deal.</p>\n<ul><li><strong>Wolf Tooth 8-Bit Kit One:</strong> £150 / $129</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>","author":"Sam Challis","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"2f020b19a7024a1909d78852579abf203b5dae0803eb8c7d5e4c26eb78e1f9e9","category":"Cycling"}