{"title":"Qingzhuan dark tea polysaccharides‐zinc alleviates dextran sodium sulfate‐induced ulcerative colitis","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13597?af=R","date":1716548722000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Qingzhuan dark tea polysaccharides (QDTP) have been complexed with Zinc (Zn) to form the Qingzhuan dark tea polysaccharides-Zinc (QDTP-Zn) complex. The present study investigated the protective effects of QDTP-Zn on ulcerative colitis (UC) in mice. The UC mouse model was induced using dextran sodium sulfate (DSS), followed by oral administration of QDTP-Zn (0.2 and 0.4 g kg<sup>−1</sup> day<sup>−1</sup>).</p>\n<h2>RESULTS</h2>\n<p>QDTP-Zn demonstrated alleviation of UC symptoms in mice, as evidenced by a decrease in disease activity index scores. QDTP-Zn also regulated colon tissue injury by upregulating ZO-1 and occludin protein expression, at the same time as downregulating tumor necrosis factor-α and interleukin-6β levels. Furthermore, QDTP-Zn induced significant alterations in the abundance of bacteroidetes and firmicutes and notably increased levels of short-chain fatty acids (SCFAs), particularly acetic acid, propionic acid, and butyric acid.</p>\n<h2>CONCLUSION</h2>\n<p>In summary, QDTP-Zn exhibits therapeutic potential in alleviating enteritis by fortifying the colonic mucosal barrier, mitigating inflammation and modulating intestinal microbiota and SCFAs levels. Thus, QDTP-Zn holds promise as a functional food for both the prevention and treatment of UC. © 2024 Society of Chemical Industry.</p>","author":"Min Zheng, \nChen Xie, \nDan Ye, \nYong Chen, \nZiyao Wang, \nLe Wang, \nFang Xiong, \nSheng Zhang, \nQiang He, \nHui Wu, \nZhinong Wu, \nHongfu Zhou, \nLing Li, \nJun Xing, \nXiaolei Miao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"2f03ddf3e4a0a8fe49078c50cfa053956407caed5b7fa9b3d3d5fcf9314c51ad","category":"Environment"}