{"title":"Health inequalities at the intersection of multiple social determinants among under five children residing Nairobi urban slums: An application of multilevel analysis of individual heterogeneity and discriminatory accuracy (MAIHDA)","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002931","date":1709215200000,"content":"<p>by Eliud Kibuchi, Ivy Chumo, Caroline Kabaria, Helen Elsey, Penelope Phillips-Howard, Noemia Teixeira de Siqueira-Filha, Lana Whittaker, Alastair H. Leyland, Blessing Mberu, Linsay Gray</p>\r\n\r\nIn this analysis we examine through an intersectionality lens how key social determinants of health (SDOH) are associated with health conditions among under-five children (&lt;5y) residing in Nairobi slums, Kenya. We used cross-sectional data collected from Nairobi slums between June and November 2012 to explore how multiple interactions of SDoH shape health inequalities in slums. We applied multilevel analysis of individual heterogeneity and discriminatory accuracy (MAIHDA) approach. We constructed intersectional strata for each health condition from combinations of significant SDoH obtained using univariate analyses. We then estimated the intersectional effects of health condition in a series of MAIHDA logistic regression models distinguishing between additive and interaction effects. We quantified discriminatory accuracy (DA) of the intersectional strata by means of the variance partitioning coefficient (VPC) and the area under the receiver operating characteristic curve (AUC-ROC). The total participants were 2,199 &lt;5y, with 120 records (5.5%) dropped because health conditions were recorded as “not applicable”. The main outcome variables were three health conditions: 1) whether a child had diarrhea or not, 2) whether a child had fever or not, and 3) whether a child had cough or not in the previous two weeks. We found non-significant intersectional effects for each health condition. The head of household ethnic group was significantly associated with each health condition. We found good DA for diarrhea (VPC = 9.0%, AUC-ROC = 76.6%) an indication of large intersectional effects. However, fever (VPC = 1.9%, AUC-ROC = 66.3%) and cough (VPC = 0.5%, AUC-ROC = 61.8%) had weak DA indicating existence of small intersectional effects. Our study shows pathways for SDoH that affect diarrhea, cough, and fever for &lt;5y living in slums are multiplicative and shared. The findings show that &lt;5y from Luo and Luhya ethnic groups, recent migrants (less than 2 years), and households experiencing CHE are more likely to face worse health outcomes. We recommend relevant stakeholders to develop strategies aimed at identifying these groups for targeted proportionate universalism based on the level of their need.","author":"Eliud Kibuchi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"2f0d49416d35f4c3a06c2cef385175311b96b8ca6a68ee094c805ec324e0510b","category":"Environment"}