{"title":"Unveiling Shadows: Investigating women’s experience of intimate partner violence in Ghana through the lens of the 2022 Demographic and Health Survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309564","date":1724940000000,"content":"<p>by Kwamena Sekyi Dickson, Castro Ayebeng, Joshua Okyere</p>\r\nIntroduction <p>Intimate partner violence (IPV) is a significant public health issue, predominantly among women in sub-Saharan Africa, including Ghana. Existing evidence indicates high rates of IPV perpetration and its associated adverse health outcomes. Despite previous studies, reliance on old data underscores the need for current, nationally representative data to inform policy-making and interventions. Therefore, this study utilizes the 2022 Ghana Demographic and Health Survey (GDHS) to examine IPV experiences and associated factors, aiming to provide updated insights for effective IPV mitigation strategies in Ghana.</p> Methods <p>This is a cross-sectional study of a weighted sample of 3,741 women between the ages of 15–49 years old from the 2022 GDHS. Binary logistic regression analysis was used in predicting the outcome.</p> Results <p>The study found that 36.4 percent of women in Ghana had experienced some form of IPV, primarily emotional violence (31.5%), physical violence (17.3%), and sexual violence (7.6%). Women with higher levels of education had a significantly reduced risk of 60% of experiencing some form of IPV than those with no formal education. Partner domineering behaviours, such as women whose partners often get jealous for seeing them talk with other men [adjusted OR:1.76, 95%CI:1.25,2.48], accusing them of unfaithfulness [adjusted OR:2.59, 95%CI:1.03,2.46], not permitting them to meet female friends [adjusted OR:1.1.59, 95%CI:1.03,2.46], and limiting their contact with family [adjusted OR:5.75, 95%CI:2.27,13.42], were more likely to experience at least one form of IPV. Similarly, women who justified or endorsed wife beating had a higher likelihood [aOR = 1.57, 95%CI = 1.22,2.02] of experiencing at least one form of IPV than those who did not endorse such behaviour.</p> Conclusion <p>Identifying educational attainment, partner dominance, and violence endorsement as IPV predictors underscore targeted interventions. Promoting women’s education bolsters empowerment and IPV prevention. Addressing dominance through education, counselling, and legal frameworks is crucial for fostering safer relationships and challenging violence normalization.</p>","author":"Kwamena Sekyi Dickson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2f13dee11bd54853ee26088db6caf2f34c7219824f124ec78e0dac3c06f3098e","category":"Interdisciplinary"}