{"title":"Effect of Different Slow‐Release Urea on the Production Performance, Rumen Fermentation and Blood Parameter of Angus Heifer","link":"https://www.preprints.org/manuscript/202406.1431/v1","date":1718890015000,"content":"This study investigated the effect of replacing part of the dietary soybean meal with either polymer-coated urea or gelatinized starch urea on the performance, nutrient digestibility, blood biochemical indexes, ruminal fermentation and rumen microflora of Angus heifers. The urea release profiles of two kinds of slow-release urea were evaluated in vitro and indicated a superior nitrogen retention with the polymer-coated urea. 210 purebred Angus cattle (BW = 314.26 kg) were divided into three groups: no urea group (CON), polymer-coated urea group (PCU), gelatinized starch urea group (GSU), 20g/kg polymer-coated urea or 25g/kg gelatinized starch urea was used to replace part of soybean meal in the concentrate feed respectively according to the principle of iso-metabolic energy and iso-nitrogenous. During the whole experiment, the ADG of PCU group was higher than both the GSU group and the CON group. The feed-weight ratio of the PCU group was significantly lower than both the GSU group and the CON group during the 90-day feeding period. The ADF apparent digestibility in the PCU group was significantly higher than that of the CON group, and extremely significantly higher than that of the GSU group. On the 86th day, the ALB content in the PCU group was significantly higher than that in the CON group. The contents of acetic acid and butyric acid, total volatile fatty acid and propionic acid were significantly higher in the PCU group than in the CON group. Bacterial diversity analysis found that the abundance of Firmicutes was higher in the PCU group than that in the GSU group and the CON group at the phylum level, and inverse result was observed in Bacteroidetes. The abundance of Paraprevotella was higher in the PCU group, whereas higher abundance of Prevotella was found in the GSU group at the genus level. These results indicate that both polymer-coated urea and gelatinized starch urea can replace part of soybean meal in the diet, and the amount of substitution in this trial had no diverse effect on the performance of Angus heifers, and the effect and economic benefits brought by polymer-coated urea were better than gelatinized starch urea.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2f141eaa23a8833e84061f4bc03c17c7e5d302b978dfcaf5a2d41990d2f41633","category":"Interdisciplinary"}