{"title":"Relative Burden of Neglected Tropical Diseases Among School-Age Children in Rural and Urban Slum Settings in Eastern Ethiopia","link":"https://www.preprints.org/manuscript/202410.1719/v1","date":1729593080000,"content":"Abstract\nIntroduction: Despite the determination to succeed in eliminating neglected tropical diseases, these have been increasing within certain endemicities, particularly in depriving region. \nObjective: This study aimed to assess the relative burden of neglected tropical diseases in rural and urban slum settings in Eastern Ethiopia. \nMethods: A comparative cross-sectional study was conducted from February 25 to April 30, 2024 with a multistage random sampling technique used. A survey tool with the integration of the spectrum was employed. Data were entered using Epi-Data version 3.1 and analyzed using STATA 16. Descriptive statistics and multivariable logistic regression analysis was used to identify the risk factors and the level for statistical significance was declared at p-value &lt; 0.05 with 95 % CI.\nResult: The response rate was 93 % and the mean age of house heads was 31.6 (Range; 18. 63) with 5.7 average family size. The overall prevalence of NTDs among study participants was 22.6 % (95% CI; 20.2, 25.2); urban slum it was 15 % (95% CI; 12.2, 18.4) while it was 29.8 % (95% CI; 26, 33.9) in rural. Though there is no statistically significant difference, the relative prevalence of NTDs in rural to urban was two. The multivariable analysis provided that the risk factors associated with NTDs were government employment (AOR: 12.5 (1.17, 132.4)), good income (AOR: 0.13 (.03, 0.57)), Child playing with soil (AOR: 5.8 (1.52, 22.0)); child hand washing at critical times ( AOR: 11.2 (1.7, 74.9)),  presence of flies in the child faces (AOR: 20.3 (4.7,   88.6)) and type of drinking water sources (AOR: 0.11 (0.02,   0.73)).\nConclusion: the burden of NTDs was moderate in the study area dominated by STH, Trachoma, and scabies. Socio economic and WASH factors were found to be associated with NTDs. Collaborated efforts among stakeholders are crucial to prevent and control NTDs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2f17d2c2171a84e3d1cc14f8a243f9ce33c52c80e0551d166840302fcad61417","category":"Interdisciplinary"}