{"title":"Efficient Quality Control of Peptide Pools","link":"https://www.preprints.org/manuscript/202404.0992/v1","date":1713185789000,"content":"Abstract: Peptide pools composed of short amino acid sequences have proven to be versatile tools in various research areas and clinical applications. They are powerful tools for epitope mapping, immunotherapy, and vaccine development. Their importance lies in their ability to map complex protein structures, enabling a comprehensive understanding of immune responses and facilitating the identification of potential therapeutic agents. The application of peptide pools also extends to the field of personalized medicine, offering tailored solutions for diseases such as cancer and infectious diseases. Peptide pools are complex mixtures of immunostimulatory antigens primarily intended for T-cell stimulation. They are commercially available in many different compositions and variants. However, unlike other reagents that consist of only one or a few compounds, peptide pools are highly complex products with limited stability. This makes their quality control a major challenge. Quantitative peptide analysis usually requires sophisticated methods, in most cases isotope-labeled standards and reference materials. None of these are routinely available for these products. Synthesis and purification of all labeled peptides might be required. Usually, this approach would be prohibitively laborious and expensive. Therefore, an approach is needed to provide a practical and feasible method for quality control of peptide pools. With insufficient quality control, the use of such products could lead to incorrect experimental results, which would worsen the well-known reproducibility crisis in the biomedical sciences. Here we propose the use of ultra-high performance liquid chromatography (UHPLC) with two detectors, a standard UV detector (at 214 nm) for quantitative analysis and a high-resolution mass spectrometer (HRMS) for identity confirmation. To be cost-efficient and fast, quantification and identification are performed in one chromatographic run. An optimized protocol is shown, and different peak integration methods are compared and discussed. This work was performed using a peptide pool known as CEF, which consists of 32 peptides derived from cytomegalovirus (CMV), Epstein-Barr virus (EBV) and influenza virus, ranging from 8 to 12 amino acids in length.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2f2f966564b5c73e55d87dd034ee6e1315f970ed5552bf8cf86ea3ac25cdb91f","category":"Interdisciplinary"}