{"title":"Causal association of menstrual reproductive factors on the risk of osteoarthritis: A univariate and multivariate Mendelian randomization study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307958","date":1725026400000,"content":"<p>by Xinzhe Tan, Yifang Mei, Yihao Zhou, Zhichao Liao, Pengqi Zhang, Yichang Liu, Yixiao Han, Dongyan Wang</p>\r\nObjective <p>Several observational studies have revealed a potential relationship between menstrual reproductive factors (MRF) and osteoarthritis (OA). However, the precise causal relationship remains elusive. This study performed Mendelian randomization (MR) to provide deeper insights into this relationship.</p> Methods <p>Utilizing summary statistics of genome-wide association studies (GWAS), we conducted univariate MR to estimate 2 menstrual factors (Age at menarche, AAM; Age at menopause, AMP) and 5 reproductive factors (Age at first live birth, AFB; Age at last live birth, ALB; Number of live births, NLB; Age first had sexual intercourse, AFSI; Age started oral contraceptive pill, ASOC) on OA (overall OA, OOA; knee OA, KOA and hip OA, HOA). The sample size of MRF ranged from 123846 to 406457, and the OA sample size range from 393873 to 484598. Inverse variance weighted (IVW) method was used as the primary MR analysis methods, and MR Egger, weighted median was performed as supplements. Sensitivity analysis was employed to test for heterogeneity and horizontal pleiotropy. Finally, multivariable MR was utilized to adjust for the influence of BMI on OA.</p> Results <p>After conducting multiple tests (<i>P</i>&lt;0.0023) and adjusting for BMI, MR analysis indicated that a lower AFB will increase the risk of OOA (odds ratio [OR] = 0.97, 95% confidence interval [CI]: 0.95–0.99, P = 3.39×10<sup>−4</sup>) and KOA (OR = 0.60, 95% CI: 0.47–0.78, <i>P</i> = 1.07×10<sup>−4</sup>). ALB (OR = 0.61, 95% CI: 0.45–0.84, <i>P</i> = 2.06×10<sup>−3</sup>) and Age AFSI (OR = 0.66, 95% CI: 0.53–0.82, <i>P</i> = 2.42×10<sup>−4</sup>) were negatively associated with KOA. In addition, our results showed that earlier AMP adversely affected HOA (OR = 1.12, 95% CI: 1.01–1.23, <i>P</i> = 0.033), and earlier ASOC promote the development of OOA (OR = 0.97, 95% CI: 0.95–1.00, <i>P</i> = 0.032) and KOA (OR = 0.58, 95% CI: 0.40–0.84, <i>P</i> = 4.49×10<sup>−3</sup>). ALB (OR = 0.98, 95% CI: 0.96–1.00, <i>P</i> = 0.030) and AFSI (OR = 0.98, 95% CI: 0.97–0.99, <i>P</i> = 2.66×10<sup>−3</sup>) also showed a negative association with OOA but they all did not pass multiple tests. The effects of AAM and NLB on OA were insignificant after BMI correction.</p> Conclusion <p>This research Certificates that Early AFB promotes the development of OOA, meanwhile early AFB, ALB, and AFSI are also risk factors of KOA. Reproductive factors, especially those related to birth, may have the greatest impact on KOA. It provides guidance for promoting women’s appropriate age fertility and strengthening perinatal care.</p>","author":"Xinzhe Tan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2f3f2174f5df64cbfc21d1e224df948ba9e8a850482d33bd1c36fb5c82fc0eda","category":"Interdisciplinary"}