{"title":"Light-responsive transcription factors VvHYH and VvGATA24 mediate wax terpenoid biosynthesis in Vitis vinifera","link":"https://academic.oup.com/plphys/article/196/2/1546/7709390?rss=1","date":1720396800000,"content":"<span><div>Abstract</div>The cuticular wax that covers the surfaces of plants is the first barrier against environmental stresses and increasingly accumulates with light exposure. However, the molecular basis of light-responsive wax biosynthesis remains elusive. In grape (<span>Vitis vinifera</span>), light exposure resulted in higher wax terpenoid content and lower decay and abscission rates than controls kept in darkness. Assay for transposase-accessible chromatin with high-throughput sequencing and RNA-seq data were integrated to draw the chromatin accessibility and <span>cis</span>-elements regulatory map to identify the potential action sites. Terpenoid synthase 12 (<span>VvTPS12</span>) and 3-hydroxy-3-methylglutaryl-CoA reductase 2 (<span>VvHMGR2</span>) were identified as grape wax biosynthesis targets, while VvHYH and VvGATA24 were identified as terpenoid biosynthesis activators, as more abundant wax crystals and higher wax terpenoid content were observed in transiently overexpressed grape berries and <span>Nicotiana benthamiana</span> leaves. The interaction between VvHYH and the open chromatin of <span>VvTPS12</span> was confirmed qualitatively using a dual luciferase assay and quantitatively using surface plasma resonance, with an equilibrium dissociation constant of 2.81 n<span>m</span> identified via the latter approach. Molecular docking simulation implied the structural nature of this interaction, indicating that 24 amino acid residues of VvHYH, including Arg<sup>106A</sup>, could bind to the <span>VvTPS12</span> G-box <span>cis</span>-element. VvGATA24 directly bound to the open chromatin of <span>VvHMGR2</span>, with an equilibrium dissociation constant of 8.59 n<span>m</span>. Twelve amino acid residues of VvGATA24, including Pro<sup>218B</sup>, interacted with the <span>VvHMGR2</span> GATA-box <span>cis</span>-element. Our work characterizes the mechanism underlying light-mediated wax terpenoid biosynthesis and provides gene targets for future molecular breeding.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"2f43f5bfafadddead1da06ee72dd6b0d15dae0efd4cf7ff52e521ff15a3f798a","category":"Environment"}