{"title":"Current out of pocket care costs among HIV and hypertension co-morbid patients in urban and peri-urban Uganda","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003423","date":1727272800000,"content":"<p>by Drew B. Cameron, Lillian C. Morrell, Faith Kagoya, John Baptist Kiggundu, Brian Hutchinson, Robert Twine, Jeremy I. Schwartz, Martin Muddu, Gerald Mutungi, James Kayima, Anne R. Katahoire, Chris T. Longenecker, Rachel Nugent, David Contreras Loya, Fred C. Semitala</p>\r\nBackground <p>Despite improvements to the cascade of HIV care in East Africa, access to care for non-communicable disease co-morbidities like hypertension (HTN) remains a persistent problem. The integration of care for these conditions presents an opportunity to achieve efficiencies in delivery as well as decrease overall costs for patients. This study aims to build evidence on the burden of current out-of-pocket costs of care among HIV-HTN co-morbid patients.</p> Methods <p>We administered a pre-tested, cross-sectional, out-of-pocket cost survey to 94 co-morbid patients receiving HIV care from 10 clinics in the Wakiso and Kampala districts of Uganda from June to November 2021. The survey assessed socio-demographic characteristics, direct medical costs (e.g., medications, consultations), indirect costs (e.g., transport, food, caregiving), and economic costs (i.e., foregone income) associated with seeking HIV and HTN care, as well as possible predictors of monthly care costs. Patients were sampled both during a government-imposed nation-wide full COVID-19 lockdown (n = 30) and after it was partially lifted (n = 64).</p> Results <p>Median HIV care costs constitute between 2.7 and 4.0% of median monthly household income, while HTN care costs are between 7.1 to 7.9%. For just under half of our sample, the median monthly cost of HTN care is more than 10% of household income, and more than a quarter of patients report borrowing money or selling assets to cover costs. We observe uniformly lower reported costs of care for both conditions under full COVID-19 lockdown, suggesting that access to care was limited. The main predictors of monthly HIV and HTN care costs varied by disease and costing perspective.</p> Conclusions <p>Patient out of pocket costs of care for HIV and HTN were substantial, but significantly lower during the 2021 full COVID-19 lockdown in Uganda. New strategies such as service integration need to be explored to reduce these costs.</p>","author":"Drew B. Cameron","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"2f473ab42a32796157c463af4daf07fb30bb1ed5deca0971e9347e0cc3f36a54","category":"Environment"}