{"title":"AFTEA Framework for Supporting Dynamic Autonomous Driving Situation","link":"https://www.preprints.org/manuscript/202408.0126/v1","date":1722563384000,"content":"The accelerated development of AI technology has brought about revolutionary changes in various fields of society. Recently, it has been emphasized that Fairness, Accountability, Transparency, Ethics (Explainability) (FATE) should be considered to support the reliability and validity of AI-based decision-making. However, in the case of autonomous driving technology, which is directly related to human life and requires real-time adaptation and response to various changes and risks in the real world, environmental adaptability must be considered in a more comprehensive and converged manner. In order to derive definitive evidence for each object in a convergent autonomous driving environment, it is necessary to transparently collect and provide various types of road environment information for driving objects and driving assistance, and to construct driving technology that is adaptable to various situations by considering all uncertainties in the real-time changing driving environment.This allows unbiased and fair results based on flexible contextual understanding, even in situations that do not conform to rules and patterns, by considering the convergent interactions and dynamic situations of various objects that are possible in a real-time road environment. The transparent, environmentally adaptive, and fairness-based outcomes provide the basis for the decision-making process and support clear interpretation and explainability of decisions. All of these processes enable autonomous vehicles to draw reliable conclusions and take responsibility for their decisions in autonomous driving situations. Therefore, this paper proposes an Adaptability, Fairness, Transparency, Explainability and Accountability (AFTEA) Framework to build a stable and reliable autonomous driving environment in dynamic situations. This paper explains the definition, role, and necessity of AFTEA in artificial intelligence technology and highlights its value when applied and integrated into autonomous driving technology. The AFTEA framework with environmental adaptability will support the establishment of a sustainable autonomous driving environment in dynamic environments, and aims to provide a direction for establishing a stable and reliable AI system that adapts to various real-world scenarios.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2f4f8814c64cd6cdf9158ca65e690020072539297219da289446938a693b9aa8","category":"Interdisciplinary"}