{"title":"Review On Construction Firms Performance Assessment Methods, Using Qualitative Content Analysis","link":"https://www.preprints.org/manuscript/202407.2303/v1","date":1722471404000,"content":"A corporate head office for large construction firms, holds more of a staffing role and facilitates, controls and manages subsidiaries. According to studies, little awareness of how to manage affairs, the unfavorable business environment, the lack of necessary rules and the structure of capital, form the most critical management areas to be thoughtful of. In dynamic systems, complex subject, refers to a problem in which the number of factors and relations in between are very high and sometimes unknown. In managing large construction firms, a similar situation prevails. Controlling and evaluating organization and management based on the correct information is something that is difficult to accomplish. This research seeks to provide a comprehensive review on construction firms performance measurements methods by using qualitative methods and necessary software tools. For this purpose, a summary is made of studies on areas such as construction companies, performance assessment solutions and content analysis methods. Then, considering the research gap, the research methodology will be developed, which will provide the optimal result for gathering different assessment methods suitable for construction firms in study. This article offers a step-by-step description of how qualitative data analysis software can be used for quantifying data and decision making. As illustrated in this research, using Nvivo shows how software tools can facilitate analytical flexibility and how they can enhance effectiveness of the qualitative research process. The article, aside from proposing the optimum performance assessment method for companies in study, concludes that while qualitative data analysis software will not do the analysis for the researcher, it can make the analytical process more flexible, transparent and ultimately more trustworthy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2f553571b5fa83d07bd1a5f732ee1835682a3e10366478927fc066e2e72583f1","category":"Interdisciplinary"}