{"title":"Three ways to add an iCloud.com address, even if you already have one","link":"https://www.macworld.com/article/232677/three-ways-to-add-an-icloud-com-address-even-if-you-already-have-one.html","date":1679302800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple gives icloud.com email addresses away at no cost, but it’s not always obvious how to obtain one by itself or add one to an existing Apple ID account, or how to get additional addresses if you already have one at icloud.com.</p>\n\n\n\n<p>But there are three paths, which vary by what you already have and what you want.</p>\n\n\n\n<ul><li><p>If you have an Apple ID without an associated icloud.com address, you can add one (via iOS or macOS).</p></li><li><p>If you have an icloud.com address already, you can add aliases (via iCloud.com).</p></li><li><p>If you want a separate icloud.com address for email that isn’t an alias, you can create one by creating an Apple ID account (via macOS).</p></li></ul>\n\n\n\n<h2>Add an icloud.com address to an Apple ID</h2>\n\n\n\n<p>While iCloud seems like it’s integral to an Apple ID, Apple still keeps the two distinct: an Apple ID doesn’t have to have an associated iCloud address, but all iCloud addresses must be associated with an Apple ID. If you haven’t used icloud.com for email yet, you might have an Apple ID that uses a non-Apple email address for its account name.</p>\n\n\n\n<p>To add an icloud.com address to such an account, you must use either iOS or macOS; you can’t add the address via the Apple ID site (or via icloud.com).</p>\n\n\n\n<ul><li>In iOS, go to <em>Settings</em> &gt; <em>account name</em> &gt; <em>iCloud</em>, tap <em>Mail</em> and turn it on, and then follow the instructions that appear.</li><li>With macOS 10.14 Mojave or earlier, go to  &gt; <em>System Preferences</em> &gt; <em>iCloud</em> and check the box next to <em>Mail</em>. MacOS prompts you to create an address.</li><li>With macOS 10.15 Catalina through 12 Monterey, go to  &gt; <em>System Preferences</em> &gt; <em>Apple ID</em>, click <em>iCloud</em> in the left-hand navigation list, and check the box next to <em>Mail</em>. MacOS prompts you to create an address.</li><li>With macOS 13 Ventura, go to  &gt; <em>System Settings</em> &gt; <em>account name</em> &gt; <em>iCloud</em> &gt; <em>iCloud Mail</em> and click <em>Turn On</em>. Follow the instructions that appear.</li></ul>\n\n\n\n<p>This new iCloud address becomes associated with your Apple ID account, and can be used for email and to log into iCloud.com for other services.</p>\n\n\n\n<h2>Add icloud.com aliases</h2>\n\n\n\n<p>Apple doesn’t exactly hide this feature, but it’s not that easy to find, either:</p>\n\n\n\n<ol><li>Log into iCloud.com.</li><li>Click the apps grid in the upper-right corner (it looks like a grid of small squares) and click the Mail icon.</li><li>Click the gear icon at the upper-left corner of the screen and select <em>Preferences</em>.</li><li>Click the <em>Accounts</em> button.</li><li>Click <em>Add an Alias</em>.</li><li>Click <em>Add</em> and then click <em>Done</em>.</li></ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/mac911-add-mail-alias-bordered.png\" alt srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/mac911-add-mail-alias-bordered.png?quality=50&amp;strip=all 956w, https://b2c-contenthub.com/wp-content/uploads/2023/03/mac911-add-mail-alias-bordered.png?resize=300%2C256&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/mac911-add-mail-alias-bordered.png?resize=768%2C656&amp;quality=50&amp;strip=all 768w\" width=\"956\" height=\"816\" /><figcaption>iCloud.com lets you add additional icloud.com addresses to your account as aliases that receive email just like your main account.</figcaption></figure></div>\n\n\n\n<p>You can add up to three aliases, all of which receive email just as if they were the main address on your account. (I wrote a Mac 911 column on <a href=\"https://www.macworld.com/article/232645/how-to-retain-an-apple-id-while-switching-your-icloud-email-address.html\">how to use an alias to filter incoming email</a>, especially if you’re receiving too much spam or unwanted email at your primary iCloud address.)</p>\n\n\n\n<h2>Create a new Apple ID to get an icloud.com address</h2>\n\n\n\n<p>You can create an Apple ID that uses as its login name an icloud.com address that you pick without switching to this new Apple ID for any other purpose.</p>\n\n\n\n<p>You can only carry this out sensibly via macOS. You can’t use iOS without logging out of your current iCloud account, which requires a lot of hassle with synced data. And it’s not available at all as an option at iCloud.com or the Apple ID site.</p>\n\n\n\n<p>First, enable fast user switching:</p>\n\n\n\n<ul><li>In macOS Monterey and earlier, go to  <em>&gt; System Preferences &gt; Users &amp; Groups</em>. Click the lock icon in the lower-left corner and enter your administrative password or use Touch ID. In Login Options, check “Show fast user switching menu.”</li><li>In macOS Ventura, go to  <em>&gt; System Settings &gt; Control Center</em> and choose <em>Full Name</em>, <em>Account Name</em>, or <em>Icon</em> from the <em>Show in Menu Bar</em> menu. You can also enable <em>Show in Control Center</em>.</li></ul>\n\n\n\n<p>Now, create a new macOS account:</p>\n\n\n\n<ol><li>Go to  <em>&gt; System Preferences/Settings &gt; Users &amp; Groups</em>.</li><li>Click the + (plus) sign below the account list in Monterey or earlier or click <em>Add Account</em> in Ventura.</li><li>Create a macOS account that you will then use to create a new Apple ID.</li><li>Select the fast-user switching menu at the upper-right corner of your macOS screen and pick the newly created account.</li><li>Skip the step during the account completion process to use or create an Apple ID.</li><li>When the account finishes initial setup, go to  &gt; <em>System Preferences/Settings</em> &gt; <em>Internet Accounts</em>.</li><li>Click the iCloud logo or iCloud text.</li><li>Click <em>Create Apple ID</em> at the sign-in prompt.</li><li>You may be prompted to enter your birthdate; provide it and click <em>Next. (Apple doesn’t validate it’s</em> your birthday, they just want you to be 18 or over to create an unlimited account and for future verification purposes.)</li><li>Click the text link “Get a free iCloud email address.”</li><li>The Email Address field changes to an empty field and “@icloud.com”. You can now enter the address you want. (MacOS will warn you if it’s not available.) Enter your name and pick a password.</li><li>Click <em>Next</em> and provide the confirmation data Apple requires to finish creating the account.</li><li>Log out of this new account (<em> &gt; Log Out</em> account name). </li><li>You can optionally disable fast-user switching.</li></ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/mac911-add-free-icloud-account-bordered.png\" alt srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/mac911-add-free-icloud-account-bordered.png?quality=50&amp;strip=all 984w, https://b2c-contenthub.com/wp-content/uploads/2023/03/mac911-add-free-icloud-account-bordered.png?resize=300%2C279&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/mac911-add-free-icloud-account-bordered.png?resize=768%2C713&amp;quality=50&amp;strip=all 768w\" width=\"984\" height=\"914\" /><figcaption>You can create a new Apple ID in macOS and opt to also create an associated new icloud.com address.</figcaption></figure></div>\n\n\n\n<p>Now, in Mail for macOS or iOS, or in third-party email clients, you can enter your new Apple ID account information to access the associated icloud.com email address, even while using a different Apple ID account for iCloud syncing. (If you enabled two-factor authentication, you’ll need to create an app-specific password for each mail client with which you use the email account.)</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently along with answers and links to columns: \n<a href=\"https://www.macworld.com/article/228117/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to \n<a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a> including screen captures as appropriate, and whether you want your full name used. Every question won’t be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\niCloud, Internet</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2f62d0effa4b6db7477aaf7253facdaeeacef92047a6324123b3b20f3952043b","category":"Apple"}