{"title":"Factors associated with the enrollment of commercial medical insurance in China: Results from China General Social Survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303997","date":1716472800000,"content":"<p>by Songyue Xue, Wu Zeng, Xiaocong Yang, Jianguo Li, Lei Zhu, Guanyang Zou</p>\r\nBackground <p>The Chinese government has been promoting commercial medical insurance (CMI) in recent decades as it plays an increasingly important role in addressing disease burden, health inequities, and other healthcare challenges. However, compared with developed countries, the CMI is still less fledged with low coverage.</p> Objective <p>This study aims to explore the factors associated with enrollment in CMI, with regards to explicit characteristics (including sociodemographic characteristics and family economic status), latent characteristics (including social security status), and the global incentive compatibility index (including health status), to inform the design of CMI to improve its coverage in China.</p> Methods <p>Based on the principal-agent model, we summarized and classified the factors associated with the enrollment in CMI, and then analyzed the data generated from the Chinese General Social Survey in 2015,2018 and 2021 respectively. A comparison of factors regarding sociodemographic characteristics, family economic status, social security status, and health status was conducted between individuals enrolled and unenrolled in CMI using Mann-Whitney U test and Chi-square test. Binary logistic regression analysis was used to explore factors influencing the enrollment status of CMI.</p> Results <p>Of all individuals, the proportion of enrolled individuals shows an increasing trend year by year, with 8.7%,11.8% and 14.1% enrolled in CMI in 2015,2018 and 2021, respectively. The binary regression analysis further suggested that the factors associated with the enrollment in CMI were consistent in 2015,2018 and 2021.We found that individuals divorced, obese, who had a higher level of education, had non-agricultural household registration, perceived themselves as the upper social status, conducted daily exercise, had more family houses, had a car, had investment activities, or did not have basic health insurance were more likely to be enrolled in CMI.</p> Conclusions <p>We identified multidimensional factors associated with the enrollment of CMI, which help inform the government and insurance industry to improve the coverage of CMI.</p>","author":"Songyue Xue","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2f64a3f6a763b98ef8e84749c21f60de894f720cb14f6600cdb5bacac9e4b065","category":"Interdisciplinary"}