{"title":"The antioxidant betulinic acid enhances porcine oocyte maturation through Nrf2/Keap1 signaling pathway modulation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311819","date":1728568800000,"content":"<p>by Min Ju Kim, Hyo-Gu Kang, Se-Been Jeon, Ji Hyeon Yun, Pil-Soo Jeong, Bo-Woong Sim, Sun-Uk Kim, Seong-Keun Cho, Bong-Seok Song</p>\r\n\r\nDuring <i>in vitro</i> maturation, excess levels of reactive oxygen species (ROS) are a major cause of developmental defects in embryos. Betulinic acid (BA) is a naturally produced antioxidant in white birch bark. Recent studies have shown that BA exhibits antioxidant properties in various cells through the activation of antioxidant genes. Therefore, we investigated the effect of BA treatment on porcine oocytes and its underlying mechanism during oocyte maturation. Treatment with 0.1 μM BA significantly increased the proportion of MII oocytes compared with controls, and BA-treated oocytes had significantly higher development rates, trophectoderm cell numbers, and cell survival rates than controls. These results demonstrate that BA treatment improved the developmental competence of oocytes. Following BA treatment, oocytes exhibited reduced ROS levels and elevated glutathione (GSH) levels, accompanied by the enhanced expression of antioxidant genes, compared with control oocytes. To evaluate the antioxidant effects of BA, oocytes were exposed to H<sub>2</sub>O<sub>2</sub>, a potent ROS activator. Impaired nuclear maturation, ROS levels, and GSH levels induced in oocytes by H<sub>2</sub>O<sub>2</sub> exposure was restored by BA treatment. As these antioxidant genes are regulated by the Nrf2/Keap1 signaling pathway, which is involved in antioxidant responses, we applied the Nrf2 inhibitor brusatol to investigate the effects of BA on this pathway. The negative effects of brusatol on meiotic maturation and oocyte quality, including levels of ROS, GSH, and antioxidant-related gene expression, were mitigated by BA treatment. Our results suggested that BA plays an effective role as an antioxidant in porcine oocyte maturation through adjusting the Nrf2/Keap1 signaling pathway. This finding provides valuable insights into the mechanisms governing oocyte maturation and embryonic development.","author":"Min Ju Kim","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2f768ed45c85158aa3851fffde43a1382a863d55d68f0b94657f4c6a2307a1e4","category":"Interdisciplinary"}