{"title":"Discrimination ability of central visual field testing using stimulus size I, II, and III and relationship between VF findings and macular ganglion cell thickness in chiasmal compression","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300103","date":1709906400000,"content":"<p>by Arthur Andrade do Nascimento Rocha, Thais de Souza Andrade Benassi, Luiz Guilherme Marchesi Mello, Rony Carlos Preti, Leandro C. Zacharias, Leonardo P. Cunha, Mário L. R. Monteiro</p>\r\nPurpose <p>To compare the relationship between macular ganglion cell layer (mGCL) thickness and 10–2 visual field (VF) sensitivity using different stimulus sizes in patients with temporal hemianopia from chiasmal compression.</p> Methods <p>A cross-sectional study was conducted involving 30 eyes from 25 patients with temporal VF loss on 24–2 SITA standard automated perimetry due to previous chiasmal compression and 30 healthy eyes (23 controls). Optical coherence tomography (OCT) of the macular area and 10–2 VF testing using Goldmann stimulus size I (GI), II (GII), and III (GIII) were performed in the Octopus 900 perimeter. For the sake of analysis, mGCL thickness and VF data were segregated into four quadrants (two temporal and two nasal) and two halves (temporal and nasal) centered on the fovea, in order to evaluate separately both the severely affected nasal hemi-retina corresponding to the temporal VF sectors and the subclinically affected temporal hemi-retina corresponding to the nasal VF sectors. Data from patients and controls were compared using generalized estimated equations. The discrimination ability of GI, GII, and GIII was evaluated, as was the correlation between mGCL and 10–2 VF sensitivity using GI, GII, and GIII.</p> Results <p>All mGCL parameters in the nasal and temporal halves of the retina were significantly reduced in patients compared to controls. 10–2 VF test sensitivity using GI, GII, and GIII was significantly lower in patients than in controls (p≤0.008) for all parameters, except the three nasal divisions when using GI (p = 0.41, 0.07 and 0.18) Significant correlations were found between temporal VF sectors (all stimulus sizes) and the corresponding nasal mGCL measurements, with similar discrimination ability. Significant correlations were also observed between all three nasal VF divisions and the corresponding temporal mGCL thickness when using stimulus sizes I and II, but not stimulus size III.</p> Conclusions <p>On 10–2 VF testing, GII outperformed GI and GIII with regard to discrimination ability and structure-function correlation with mGCL thickness in the subclinically affected nasal part of the VF in patients with chiasmal compression. Our findings suggest that the use of GII can enhance the diagnostic power of 10–2 VF testing in early cases of chiasmal compression, although further studies are necessary to support this conclusion.</p>","author":"Arthur Andrade do Nascimento Rocha","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2f7721868ee39643d3e3f047ba8392e80d5954f79eff4166d55d7e409e178377","category":"Interdisciplinary"}