{"title":"Numerical and Experimental Determination of Selected Parameters of the Liquid Flat-Plate Solar Collector under Outdoor Conditions","link":"https://www.preprints.org/manuscript/202405.0983/v1","date":1715761613000,"content":"The paper presents a proposal for an in-house mathematical model of a liquid flat-plate solar collector. The proposed model is a one-dimensional distributed parameter model enabling simulations of the collector operation under arbitrarily variable boundary conditions. The model is based on the solution of energy balance equations for all components of the collector. The formulated differential equations are solved iteratively using an implicit difference scheme. In order to obtain a stable numerical solution, it is necessary to use appropriate steps of the time and spatial division. These were found by comparing the results obtained from the model with the results of the analytical solution available in the literature for the transient state, which constitutes the novelty of the present study. The accuracy of the results obtained from the model was verified experimentally by comparing the measured and the calculated history of the fluid temperature at the outlet of the collector. The calculation of the collector time constant is proposed in the paper as an example of the model practical application. The results of the time constant calculation were compared with the values obtained experimentally on the test stand. This is another novelty of the presented research. The analysed collector instantaneous efficiency was then calculated for selected outdoor conditions. The presented mathematical model can also be used to verify the correctness of the collector operation. Comparing, on an ongoing basis, the measured and the calculated values of the fluid temperature at the collector outlet, conclusions can be drawn about the process of solar glass fouling or glycol gelling. The model's simplicity and the low computational demands enable such comparisons in an online mode.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2f7a4b575f800905964b3617e52a5511c92199569549675c719a13d1ac5ca8ff","category":"Interdisciplinary"}