{"title":"Loss of Mitochondrial Tusc2/Fus1 Triggers a Brain Proinflammatory Microenvironment and Early Spatial Memory Impairment","link":"https://www.preprints.org/manuscript/202405.0349/v1","date":1715062665000,"content":"Brain pathological changes impair cognition early in disease etiology. There is an urgent need for understanding aging-linked mechanisms of early memory loss to develop therapeutic strategies and prevent the development of cognitive impairment. Tusc2, also named Fus1, is a mitochondrial-resident protein regulating Ca2+ fluxes to and from mitochondria impacting overall health. We reported that Tusc2-/- female mice develop chronic inflammation and age prematurely, causing age- and gender-dependent spatial memory deficits at 5 m.o. Therefore, we investigated Tusc2-dependent mechanisms of memory impairment in mice, comparing changes in resident and brain-infiltrating immune cells. Interestingly, Tusc2-/- female mice demonstrated proinflammatory increase in astrocytes, IFN-γ expression in CD4+T cells and Granzyme-B in CD8+T cells. We also found fewer FOXP3+ T-regulatory cells and Ly49G+ NK and Ly49G+ NKT cells in female Tusc2-/- brain, suggesting a weakened anti-inflammatory response. Moreover, Tusc2-/- hippocampi exhibited Tusc2- and sex-specific protein changes associated with brain plasticity, including mTOR activation, and Calbindin and CamKII dysregulation affecting intracellular Ca2+ dynamics. Overall, data suggest that dysregulation of Ca2+-dependent processes and proinflammatory brain microenvironment heighten in Tusc2-/- mice could underlie cognitive impairment. Thus, strategies to modulate the brain’s Tusc2-, Ca2+, and mitochondria-dependent pathways should be explored to improve cognitive health.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2f83511e2d89b79648c1b4f53a4e2fc1663c730ed3e567ac4fdae8c0ce1d6b8f","category":"Interdisciplinary"}