{"title":"Association of dietary total antioxidant capacity with general and abdominal obesity in type 2 diabetes mellitus patients","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306038","date":1719410400000,"content":"<p>by Najia El Frakchi, Khaoula El Kinany, Marwa El Baldi, Younes Saoud, Karima El Rhazi</p>\r\nBackground <p>The dual existence of Type 2 Diabetes Mellitus (T2DM) and obesity within a single individual may describe a combined adverse health effects, including impaired quality of life and increased risk for cardiovascular diseases (CVDs). Oxidative stress is a contributing factor to the pathogenesis of obesity. Meanwhile, dietary antioxidants may improve the antioxidant defense system and thereby decrease oxidative injury. Dietary total antioxidant capacity (TAC) is usually used to investigate the potential health effects of dietary antioxidant intake on several oxidative stress induced chronic diseases. This study aimed to examine the association of dietary TAC with obesity-related features in T2DM patients.</p> Methods <p>The present study included 254 type 2 diabetes outpatients with a mean (SD) age of 54.52 (7.21) years and mean (SD) diabetes duration of 8.2 (6.4) years. Data on dietary intake was assessed using a validated food frequency questionnaire. Dietary TAC was estimated by ferric reducing antioxidant potential (FRAP) method. Anthropometric, clinical and lifestyle characteristics were all collected.</p> Results <p>In linear regression analyses, dietary antioxidant capacity was inversely associated with body mass index (β = −0,231; 95% CI, −0,419 to −0,042), waist circumference (β = −0,427; 95% CI, −0,849 to −0,006) and fat mass percentage (β = −0,328; 95% CI, −0,545 to −0,112) independently of the assessed confounding variables. Interestingly, dietary TAC showed positive and significant associations with vitamin A, vitamin C, β-carotene, magnesium, folic acid and iron intakes, after adjusting for age and daily energy intake.</p> Conclusions <p>Higher intake of dietary TAC was in association with lower indices of general and central obesity in T2DM patients. Therefore, dietary recommendations for counteracting obesity in patients with T2DM should take into account a high dietary TAC.</p>","author":"Najia El Frakchi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2f84fbad0947b358e2e440d2ff9e79f795add862a02b91f2c161d98175b108e2","category":"Interdisciplinary"}