{"title":"The PLETHORA Homolog in Marchantia polymorpha is Essential for Meristem Maintenance, Developmental Progression, and Redox Homeostasis","link":"https://academic.oup.com/pcp/article/65/8/1231/7675872?rss=1","date":1715904000000,"content":"<span><div>Abstract</div>To adapt to a terrestrial habitat, the ancestors of land plants must have made several morphological and physiological modifications, such as a meristem allowing for three-dimensional growth, rhizoids for water and nutrient uptake, air pore complexes or stomata that permit air exchange, and a defense system to cope with oxidative stress that occurs frequently in a terrestrial habitat. To understand how the meristem was determined during land plant evolution, we characterized the function of the closest <span>PLETHORA</span> homolog in the liverwort <span>Marchantia polymorpha</span>, which we named Mp<span>PLT</span>. Through a transgenic approach, we showed that Mp<span>PLT</span> is expressed not only in the stem cells at the apical notch but also in the proliferation zone of the meristem, as well as in cells that form the air-pore complex and rhizoids. Using the CRISPR method we then created mutants for Mp<span>PLT</span> and found that the mutants are not only defective in meristem maintenance but also compromised in air-pore complex and rhizoid development. Strikingly, at later developmental stages, numerous gemma-like structures were formed in Mp<span>plt</span> mutants, suggesting developmental arrest. Further experiments indicated that Mp<span>PLT</span> promotes plant growth by regulating Mp<span>WOX</span>, which shared a similar expression pattern to Mp<span>PLT</span>, and genes involved in auxin and cytokinin signaling pathways. Through transcriptome analyses, we found that Mp<span>PLT</span> also has a role in redox homeostasis and that this role is essential for plant growth. Taken together, these results suggest that Mp<span>PLT</span> has a crucial role in liverwort growth and development and hence may have played a crucial role in early land plant evolution.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"2f876c7ecd81398115d6a74cd433ddfb06f6b96fa8c222807b99761ad46de8e5","category":"Environment"}