{"title":"Setapp Will Be One of iPhone's First Alternative App Marketplaces in EU","link":"https://www.macrumors.com/2024/02/29/setapp-alternative/","date":1709228024000,"content":"MacPaw today <a href=\"https://macpaw.com/news/setapp-ios-beta-announcement\">announced</a> that <a href=\"https://setapp.com\">Setapp</a> will be available as an alternative app marketplace on the iPhone in the EU starting in April. Those wanting access to the beta version can <a href=\"https://setapp.com/join-waitlist\">join a waitlist</a>, and developers interested in the platform can apply <a href=\"https://setapp.com/for-ios-developers\">on this page</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/Setapp-iOS.jpg\" width=\"1600\" height=\"900\" />\r<br />\nAlternative app marketplaces are <a href=\"https://www.macrumors.com/2024/02/19/iphone-changes-coming-to-eu-users/\">among the several changes</a> that Apple is implementing in the EU with iOS 17.4, in order to comply with the Digital Markets Act.\r<br />\n\r<br />\nOn the Mac, Setapp is a popular subscription-based service that provides users with access to a curated collection of dozens of popular apps for $9.99 per month. This includes apps like Ulysses, iStat Menus, Spark Mail, Unite, Yoink, and more. Starting with iOS 17.4 and later, Setapp will be available directly on the iPhone in the EU.\r<br />\n\r<br />\nMacPaw said the Setapp Mobile beta will offer a \"carefully selected assortment of apps\":<blockquote>• <strong>Productivity and Business Tools:</strong> Boost your efficiency with tools for managing your schedule, staying on track, personalizing your internet experience, and much more.\r<br />\n\r<br />\n• <strong>Creative and Design Software:</strong> Unlock your creative potential with intuitive tools designed for photo animation, document creation, and more.\r<br />\n\r<br />\n• <strong>Lifestyle and Productivity:</strong> Improve your daily routines with apps that help you build better habits, stay updated with the latest news, and efficiently manage your notes and ideas.\r<br />\n\r<br />\n• <strong>Utility Apps:</strong> Make everyday tasks easier with applications that enable you to share files effortlessly, monitor your spending, and streamline your idea organization process.\r<br />\n\r<br />\n• <strong>Specialized Professional Tools:</strong> Engage with advanced applications tailored for detailed document searches, comprehensive database management, and more.</blockquote>MacPaw is one of the first companies to announce plans to offer an alternative app marketplace on the iPhone in the EU, <a href=\"https://www.macrumors.com/2024/02/16/epic-games-store-ios-eu/\">along with Epic Games</a>. Setapp subscribers on the Mac can already access a collection of iOS apps with a QR code system, and the alternative app marketplace will offer a more streamlined experience. \r<br />\n\r<br />\nApple is expected to release iOS 17.4 <a href=\"https://www.macrumors.com/2024/02/23/ios-17-4-release-date/\">on or before March 6</a>, the deadline for complying with the Digital Markets Act. For additional details about the changes coming to the App Store and more in the EU, <a href=\"https://www.macrumors.com/2024/02/19/iphone-changes-coming-to-eu-users/\">read our previous coverage</a>. The changes do not apply outside of the EU, nor do they apply to iPadOS in any country.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/setapp/\">Setapp</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/29/setapp-alternative/\">Setapp Will Be One of iPhone's First Alternative App Marketplaces in EU</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/setapp-will-be-one-of-iphones-first-alternative-app-marketplaces-in-eu.2420747/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2f8ba5cd566b0f92e63134a8c8902e15fd355c4d322e40f3e6ff1accd2e2938f","category":"Apple"}