{"title":"The Role of Anthropogenic Forcings on Historical Sea‐Level Change in the Indo‐Pacific Warm Pool Region","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003684?af=R","date":1709201639000,"content":"<h2>Abstract</h2>\n<p>Detecting and attributing sea-level rise over different spatiotemporal scales is essential for low-lying and highly populated coastal regions. Using the Detection and Attribution Model Intercomparison Project (DAMIP) from the Coupled Model Intercomparison Project Phase 6, we evaluate the role of anthropogenic forcing in sea-level change in the historical (1950–2014) period in the Indo-Pacific warm pool region. We use three models that have at least 10 ensemble members, corresponding to different DAMIP simulations. We determined the changes in regional sea level from both natural and anthropogenic forcings. Our results demonstrate: (a) the emergence of an anthropogenic footprint on regional sterodynamic sea-level change has a large spatiotemporal diversity over the Indo-Pacific warm pool region with the earliest emergence in the western Indian Ocean; (b) a significant rise in dynamic sea level (DSL) (up to 25 mm) and thermosteric (up to 40 mm) sea level over the western Indian Ocean due to greenhouse gas forcing; (c) a positive Indian Ocean Dipole-like pattern in the DSL changes over the tropical Indian Ocean; (d) a significant increase in the halosteric contribution to sea-level rise in the Indo-Pacific warm pool region, and (e) a pronounced rise of manometric sea level (up to 20 mm) over shallow oceans and coastal regions in recent decades. These results provide a comprehensive spatiotemporal analysis of the attribution of anthropogenic factors to sea-level changes in the Indo-Pacific warm pool region.</p>","author":"Dhrubajyoti Samanta, \nVedant Vairagi, \nKristin Richter, \nElaine L. McDonagh, \nKristopher B. Karnauskas, \nNathalie F. Goodkin, \nLock Yue Chew, \nBenjamin P. Horton","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"2f92d1a696ad58df6f1816a94dcffb992b5066a7832e3a266c224be903bf3505","category":"Environment"}