{"title":"Neeva, Upstart Search Engine, Shuts Down","link":"https://neeva.com/blog/may-announcement","date":1684796880000,"content":"\n<p>Sridhar Ramaswamy and Vivek Raghunathan, writing on the Neeva blog:</p>\n\n<blockquote>\n  <p>In early 2022, the upcoming impact of generative AI and LLMs\nbecame clear to us. We embarked on an ambitious effort to\nseamlessly blend LLMs into our search stack. We rallied the Neeva\nteam around the vision to create an answer engine. We are proud of\nbeing the first search engine to provide cited, real-time AI\nanswers to a majority of queries early this year.</p>\n\n<p>But throughout this journey, we’ve discovered that it is one thing\nto build a search engine, and an entirely different thing to\nconvince regular users of the need to switch to a better choice.\nFrom the unnecessary friction required to change default search\nsettings, to the challenges in helping people understand the\ndifference between a search engine and a browser, acquiring users\nhas been really hard. Contrary to popular belief, convincing users\nto pay for a better experience was actually a less difficult\nproblem compared to getting them to try a new search engine in the\nfirst place.</p>\n</blockquote>\n\n<p>I tried Neeva, briefly, but it never stuck for me. Part of the problem, even if you’re open to trying new search engines — clearly a big <em>if</em> — is that there’s a bit of a renaissance at the moment in new search engines. I’d been using <a href=\"https://duckduckgo.com/\">DuckDuckGo</a> as my default for years, but about six months ago I switched to <a href=\"https://kagi.com/\">Kagi</a>, and so far I haven’t looked back. I pay $10/month for Kagi. A paid search engine! Good search results and absolutely zero clutter from ads or paid placement. They’ve also got a <a href=\"https://labs.kagi.com/fastgpt\">GPT-backed search</a> that includes up-to-date results and works very fast.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/22/neeva-shuts-down\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"2f935e56cffc7a663ec0ed58c908e0b5a12a19ffde1b3701b77bc683b08a994e","category":"Tech"}