{"title":"Upgrading of Pyrolysis Bio-Oil by Catalytic Hydrodeoygenation, a Review Focused on Catalysts, Model Molecules, Deactivation and Reaction Routes","link":"https://www.preprints.org/manuscript/202407.1495/v1","date":1721303127000,"content":"Biomass can be converted into energy/fuel by different techniques, such as pyrolysis, gasification, and others. In the case of pyrolysis, biomass can be converted into a crude bio-oil around 50-75% yield. However, the direct use of this crude bio-oil is impractical due to its high content of oxygenated compounds, which provide inferior properties compared to those of fossil-derived bio-oil, such as petroleum. Consequently, bio-oil needs to be upgraded by physical processes (filtration, emulsification, among others) and/or chemical processes (esterification, cracking, HDO, among others). In contrast, HDO can effectively increase the calorific value and improve the acidity and viscosity of bio-oils through reaction pathways such as cracking, decarbonylation, decarboxylation, hydrocracking, hydrodeoxygenation and hydrogenation where catalysts play a crucial role. This article first focuses on the general aspects of biomass, subsequent bio-oil production, its properties, and the various methods of upgrading pyrolytic bio-oil to improve its calorific value, pH, viscosity, degree of deoxygenation (DOD), and other attributes. Secondly, particular emphasis is placed on the process of converting model molecules and bio-oil via HDO using catalysts based on nickel and nickel combined with other active elements. Through these phases, readers can gain a deeper understanding of the HDO process and the reaction mechanisms involved. Finally, the different equipment used to obtain an improved HDO product from bio-oil is discussed, providing valuable insights for the practical application of this reaction in pyrolysis bio-oil production.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2f96083272f53f4805e1dbfc0601815c490b9eeb12ec467d685f9560e7ca6adb","category":"Interdisciplinary"}