{"title":"What every cyclist wants for Christmas","link":"https://www.cyclist.co.uk/sponsored/10219/what-every-cyclist-wants-for-christmas","date":1635328047000,"content":"<span>\n      <span><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div>  \n  <div>      <div><span>29 Oct 2021</span></div>    </div></div><p>\nMake sure your Christmas is filled with two-wheeled festivity with these 16 stocking filler recommendations</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/10/16_cyclist_christmas_gift_guide_livall.jpg?itok=h083AwDO\" />  </div>\n<div>\n      <p> Christmas is fast approaching, so now is as good a time as any to start thinking about what to get the cyclist in the family (or start thinking about your own festive wishlist).</p>\n<p>We're here to help, with 16 suggestions to help pick the perfect present, from the latest cutting-edge smart helmets to coffee subscriptions, premium apparel, repair kits and more.</p>\n<p>Take a look at our Christmas gift selection below – we're sure you'll find some inspiration.</p>\n<h2>Varia Radar RTL515</h2>\n<p><strong>£169.99, <a href=\"https://buy.garmin.com/en-GB/GB/p/698001/pn/010-02377-00\" target=\"_blank\">garmin.com</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/01_cyclist_christmas_gift_guide_varia_radar_rtl515.jpg?itok=UiLaqHvw\" />  </div>\n</div>\n<p>The Varia RTL515 is a rearview radar that pairs with your Garmin Edge GPS computer to up your road presence and offer riders warning alerts when vehicles are approaching. As well as syncing with a compatible head unit, you can also use the Varia app to turn your smartphone into the RTL515’s primary or backup display. Plus, owners of a Garmin wearable can easily download a widget to pair it up with the device.</p>\n<h2>Bearhug support sleeves</h2>\n<p><strong>£35.99, <a href=\"https://getabearhug.com/products/calf-sleeves-pair\" target=\"_blank\">getabearhug.com</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/02_cyclist_christmas_gift_guide_bearhug_spoort_sleeves.jpg?itok=7it8-9_E\" />  </div>\n</div>\n<p>These calf sleeves are made from bamboo using Bearhugs’s unique composition. Tailormade for weary calf muscles and shin splints, the compression and increased blood flow helps reduce recovery and rehabilitation periods and increase performance whilst on the bike. The soft bamboo material is filled with microgaps, making it breathable and comfortable to wear for long periods of time. You can bag yourself a 20% discount on these by using the code ‘Cyclist’ at checkout.</p>\n<h2>Dog and Hat coffee subscription</h2>\n<p><strong>From £17, <a href=\"http://www.dogandhat.co.uk/\" target=\"_blank\">dogandhat.co.uk</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/03_cyclist_christmas_gift_guide_dog_and_hat.jpg?itok=3ZSBrKu4\" />  </div>\n</div>\n<p>Get the coffee connoisseur in your life stocked up with a subscription from award-winning multi-roaster Dog and Hat. They ship coffee from different roasters across the world, in both whole bean or ground depending on preference. Only recycled paper and packing material are used, and all bags can be returned for recycling. What’s more, Dog and Hat is certified by the Speciality Coffee Association so this is top quality stuff. Prices start at £17 for two bags or you can give a three-month gift for £55. Get a subscription today and £5 off using the code ‘Cyclist‘.</p>\n<h2>Sena M1 bike helmet</h2>\n<p><strong>£169, <a href=\"https://www.sena.com/product/m1\" target=\"_blank\">sena.com</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/04_cyclist_christmas_gift_guide_sena.jpg?itok=XBL3ezqt\" />  </div>\n</div>\n<p>Sena’s M1 allows hands-free communication thanks to the four-way Bluetooth intercom, enabling communication between four riders within a range of up to a half mile. Other features include an LED taillight to aid rider road visibility, while a sun visor will keep glare at bay. In terms of design, numerous vents enable airflow and an adjustable chin strap couples with the spin-lock adjuster to comfortably fit the helmet on the rider’s head.</p>\n<h2>CORKY bike mirror</h2>\n<p><strong>£24.99, <a href=\"https://thebeam-europe.com/collections/frontpage/products/corky\" target=\"_blank\">thebeam-europe.com</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/05_cyclist_christmas_gift_guide_corky.jpg?itok=rdpqMqOV\" />  </div>\n</div>\n<p>The CORKY is a rearview mirror that fits easily to your drop bars, increasing the field of vision while allowing you to keep your eyes on the road ahead. It has 360-degree adjustability, offers distortion-free viewing and, at just 16g, it’s incredible light and designed to minimise air resistance when flipped open. It attaches solidly to your bike, so you don’t have to worry about movement or vibration on bumpy roads. A CORKY in your Santa sack will mean constant glances over your shoulder while cycling will be a thing of the past. Choose between road and city bike versions.</p>\n<h2>Hyll apparel</h2>\n<p><strong>Prices vary, <a href=\"https://www.hyllcycling.com/\" target=\"_blank\">hyllcycling.com</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/06_cyclist_christmas_gift_guide_hyll.jpg?itok=-Ju1ks-G\" />  </div>\n</div>\n<p>Hyll is a new UK-based boutique brand offering unique, premium apparel at an affordable price. Collections include jerseys (£85), bib shorts (£90) and arm warmers (£20), with patterns inspired by the hills of the Lakes, Peaks and South Downs. Jerseys feature low profile sleeves, full-length zip and comfortable neckline, while bib shorts have wide shoulder straps designed for comfort. Use the code ‘CyclistXmas20’ at checkout for a discount and follow @hyllcycling on Instagram for future offers.</p>\n<h2>Rehook PLUS repair kit</h2>\n<p><strong>£59.99, <a href=\"https://rehook.bike/products/rehook-emergency-bike-repair-kit\" target=\"_blank\">rehook.bike</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/08_cyclist_christmas_gift_guide_rehook.jpg?itok=PEgitn32\" />  </div>\n</div>\n<p>Tackle any roadside cycling issues with the new Rehook PLUS repair kit. This emergency tool set includes the Rehook PLUS multi-tool, a Rehook AIR bike pump, puncture repair kit and an extra tyre lever. Each item is precision engineered to be as lightweight and compact as possible, and the complete set is housed in a sleek, stylishly presented case. It’s an ideal Christmas present and perfect if a quick fix is needed to get back on your bike.</p>\n<h2>Edge 530</h2>\n<p><strong>From £259.99, <a href=\"https://buy.garmin.com/en-GB/GB/p/621224/pn/010-02060-01\" target=\"_blank\">garmin.com</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/07_cyclist_christmas_gift_guide_edge_530.jpg?itok=jz61iIMA\" />  </div>\n</div>\n<p>The perfect partner for the Varia RTL515, the Garmin Edge 530 is a cutting-edge GPS computer that gives you everything from performance insights to advanced mapping capabilities. It’s lightweight, compact (with a 2.6in screen) and durable in all weather conditions. The Edge 530 will give you insights on your VO2 max, recovery, nutrition, hydration and more. The integrated Garmin Cycle Map also lets you ride like a local by picking the routes most travelled by fellow cyclists.</p>\n<h2>Muc-Off cleaning products</h2>\n<p><strong>Prices vary, <a href=\"https://muc-off.com/\" target=\"_blank\">muc-off.com</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/09_cyclist_christmas_gift_guide_muc_off.jpg?itok=Ns1sXoGd\" />  </div>\n</div>\n<p>Treat the rider in your life to a Christmas bike clean with Muc-Off. There’s a whole host of great products, from cleaners to lubricants, tubeless set-ups and riding apparel. These award-winning products will help bring any bike back to its best, in both looks and performance. There’s free UK shipping on orders over £25 and if you spend more than £30 you’ll get a free Muc-Off face mask.</p>\n<h2>Lazer Blade+ MIPS Helmet</h2>\n<p><strong>£109.99, <a href=\"http://www.freewheel.co.uk/\" target=\"_blank\">freewheel.co.uk</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/10_cyclist_christmas_gift_guide_lazer_blade.jpg?itok=iMEt0HFi\" />  </div>\n</div>\n<p>The Blade+ helmet mixes striking looks and high performance, with 22 vents and a low weight (230g) for optimum comfort while cycling. The helmet’s MIPS, or Multi-directional Impact Protection System, replicates the way the human brain protects itself with a low-friction layer between the outer shell and the liner. This added safety element will help reduce rotational forces in the event of impact – and it’s all been tested out by Lazer at top universities in Sweden.</p>\n<h2>Tissot PRX Powermatic 80</h2>\n<p><strong>£565, <a href=\"http://www.tissotwatches.com/\" target=\"_blank\">tissotwatches.com</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/11_cyclist_christmas_gift_guide_tissot.jpg?itok=sIa9K_pB\" />  </div>\n</div>\n<p>A slim, sleek timepiece that has a dash of ‘70s style about it, the PRX Powermatic 80 from Tissot will look great on your wrist as you’re navigating your latest ride. It delivers reliability and precision thanks to the innovative Nivachron hairspring, and it’s powered by the person who wears it. Your wrist movement keeps the mechanism running, and with 80 hours of power reserve it can keep telling the time even if it’s not worn for three days. A watch this good is never going to be off your wrist for long, though.</p>\n<h2>Madison isoler Merino three-season sock</h2>\n<p><strong>£9.99, <a href=\"http://www.freewheel.co.uk/\" target=\"_blank\">freewheel.co.uk</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/12_cyclist_christmas_gift_guide_madison.jpg?itok=yAIqW0aJ\" />  </div>\n</div>\n<p>It wouldn’t be Christmas without a new pair of socks. This Merino wool offering is the ideal accessory for mild-weather riding, retaining its thermal properties even when wet to help better regulate foot temperature. It also features a terry fabric insert in the toe, heel and sole for added warmth, plus a Merino and polyester blend in the toe and heel for durability. It’s available in 11 different patterns and four sizes so you’ll be able to find the right look and fit</p>\n<h2>Pearl iZUMi Attack Thermal jersey</h2>\n<p><strong>£89.99, <a href=\"http://www.freewheel.co.uk/\">freewheel.co.uk</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/13_cyclist_christmas_gift_guide_pearl.jpg?itok=cqHRDpXG\" />  </div>\n</div>\n<p>Great for cool weather rides, the Attack Thermal is designed with comfort in mind thanks to a lightweight fleece fabric that insulates and gives more stretch. You can also slip this under another cycling jacket to get through training rides in the real freezing depths of winter. Three rear pockets can store your ride essentials, while a zip-up side pocket is the best place to keep your smartphone. The Attack Thermal also comes in three colours and four sizes going from small to extra large.</p>\n<h2>Shimano S-Phyre RC902 shoes</h2>\n<p><strong>£319.99, <a href=\"http://www.freewheel.co.uk/\" target=\"_blank\">freewheel.co.uk</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/14_cyclist_christmas_gift_guide_shimano.jpg?itok=4LEhYiqa\" />  </div>\n</div>\n<p>Shimano’s latest top-of-the-range shoes make a great Christmas gift for cycling enthusiasts. They come with a striking lightweight design and 360-degree ‘surround upper’ providing enhanced instep rigidity for a true glove-like fit. Expect these to deliver when it comes to performance, too. Its stiff carbon sole, excellent heel retention and ventilation, and adjustability for fit and cleat placement makes it one of the most appealing cycling shoes around.</p>\n<h2>See.Sense BEAM+F</h2>\n<p><strong>£179.99, <a href=\"https://seesense.cc/products/see-sense-beam-plus_front-light\" target=\"_blank\">seesense.cc</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/15_cyclist_christmas_gift_guide_seesense.jpg?itok=BAc3kuWL\" />  </div>\n</div>\n<p>The BEAM+ is a powerful, 1,500 lumens front light that cleverly adapts its brightness to your surroundings. Its sensor technology can react to road junctions, roundabouts and traffic, adjusting its light level to suit your cycling situation. It can last for 30 hours in adaptive (flashing and solid light) and 2 hours in solid light mode before you’ll need to recharge the battery. By connecting to the See.Sense app, you can get crash and theft alerts, ride stats, light customisation and more. Use the code ‘Cyclist’ at checkout for a 10% discount.</p>\n<h2>LIVALL EVO21 helmet</h2>\n<p><strong>£99.99, <a href=\"https://livall.co.uk/product/livall-evo21/\" target=\"_blank\">livall.co.uk</a></strong></p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/16_cyclist_christmas_gift_guide_livall.jpg?itok=8zq-moYn\" />  </div>\n</div>\n<p>A durable smart helmet that’s built for commuters and cycling enthusiasts, the LIVALL EVO21 is equipped with next-generation technology for connectivity on the go. The EVO 21 features smart LED lights, warning lights activated by acceleration sensors, fall detection and SOS text alerts to your emergency contacts. Its adjustable fit makes it suitable for a variety of head shapes and sizes, and there’s also full compatibility with Strava, iHealth and Siri through the LIVALL app.<a href=\"https://livall.co.uk/product/livall-evo21/\" target=\"_blank\"></a> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/bikes\">Bikes</a></div>    </div></div>","author":"SimonR","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"2f9aa7be55a46c5926d26a84ee999cf9f6d5064ef7c40571ec1c1ec954ac08e7","category":"Cycling"}