{"title":"Leveraging Perspective Transformation For Enhanced Pothole Detection in Autonomous Vehicles","link":"https://www.preprints.org/manuscript/202408.0525/v1","date":1723047084000,"content":"Road conditions, often degraded by insufficient maintenance or adverse weather, significantly contribute to accidents, exacerbated by the limited human reaction time to sudden hazards like potholes. Early detection of distant potholes is crucial for timely corrective actions, such as reducing speed or avoiding obstacles, to mitigate vehicle damage and accidents. This paper introduces a novel approach that utilizes perspective transformation to enhance pothole detection at different distances, focusing particularly on distant potholes. Perspective transformation improves the visibility and clarity of potholes by virtually bringing them closer and enlarging their features, which is particularly beneficial given the fixed-size input requirement of object detection networks, typically smaller than the raw image resolutions captured by cameras. Our method automatically identifies the region of interest (ROI)—the road area—and calculates the corner points to generate a perspective transformation matrix. This matrix is applied to all images and corresponding bounding box labels, enhancing the representation of potholes in the dataset. This approach significantly boosts detection performance when used with YOLOv5-small, achieving a 45.7\\% improvement in average precision (AP) at IoU thresholds of 0.5 to 0.95 for a single class, and notable improvements of 30.3\\%, 78.6\\%, and 278\\% for near, medium, and far pothole classes, respectively, after categorizing them based on their distance. This work is the first to employ perspective transformation specifically for enhancing the detection of distant potholes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2f9b4e1e0f4ff97dc5a3f50ad8ecf9429edbe17fdf4c101c6d48ed2c5f20aa8b","category":"Interdisciplinary"}