{"title":"Here’s a look at Lucid’s next luxury EV, the Gravity SUV","link":"https://arstechnica.com/?p=1934121","date":1682427601000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/Gravity-Testing_Front-800x450.jpg\" alt=\"A Lucid Gravity SUV in a concealing wrap, testing on the road\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/Gravity-Testing_Front-scaled.jpg\">Enlarge</a> <span>/</span> After showing us how it could redefine the electric luxury sedan, Lucid turned its attention to the SUV. (credit: Lucid)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The luxurious Lucid Air might be expensive, <a href=\"https://arstechnica.com/cars/2023/02/the-lucid-air-grand-touring-is-a-startups-take-on-a-great-luxury-ev/\">but it is rather good</a>. But one model alone is not enough to sustain a car company, particularly when that model is a sedan, a form factor now rather less in vogue than it once was. Lucid's next model will be something entirely more in fashion. It's an SUV called the Lucid Gravity, and Lucid sent over a couple of shots of its newest electric vehicle testing on public roads.</p>\n<p>\"I am excited to see the Gravity SUV moving forward so quickly in its development, as it builds upon everything this company has achieved thus far and drives further advancements of our in-house technology to create a luxury electric SUV like none other,\" said Lucid CEO Peter Rawlinson. \"The Lucid Air redefined the sedan category, and as our technology continues to evolve and lead the market, we are in a place where the Gravity is positioned to change the world of SUVs.\"</p>\n<p>Concrete details about the Lucid Gravity are hard to come by right now. Lucid says that it will be a comfortable seven-seater with good driving dynamics and more range than any other electric SUV on sale currently.</p></div><p><a href=\"https://arstechnica.com/?p=1934121#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1934121&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2f9bf95f0aa635dccd93d69460c74914fb9806e6157200622f5810d82f2dd5e5","category":"Tech"}