{"title":"A Comparative Morphological Study on the Characteristics of Egg Envelopes of Three Cultrinae Fishes (Cyprinidae, Teleostei) in Korea","link":"https://www.preprints.org/manuscript/202404.1929/v1","date":1714397334000,"content":"Three species of subfamily Cultrinae currently live in Korea, but Erythroculter erythropterus has been introduced into the Nakdonggang River and has taken over the habitat, reducing the habitat of Culter brevicauda. Only the endangered species C. brevicauda still lives in the Yeongsangang River, and it is necessary to be careful not to introduce E. erythropterus in the future. And Hemiculter eigenmanni is also found throughout the country. In order to effectively manage and conserve the species in its various habitats and against invasions, this study was initiated. The ultrastructure of the egg envelopes of three species of Cultrinae— E. erythropterus, C. brevicauda, and H. eigenmanni, inhabiting the Geumgang and Yeongsangang Rivers were observed. It was found that the zona radiata of the egg envelopes of all three species were divided into two layers–an outer and inner layer, with the outer surface having a non-structural form. This form is characteristic of fishes with muddy, stagnant habitats or spawning grounds. The number of pore canals on the surface of the egg envelopes was 83 for E. erythropterus, 75 for C. brevicauda, and 58 for H. eigenmanni per 10 ㎛2, and the thickness was 7.89±0.34 ㎛, 12.27±0.46 ㎛, and 7.42±0.24 ㎛, respectively. The shape of the micropyle demonstrated a funnel shape narrowing toward the inner diameter in all three species, and the size of the inner diameter was 6.62±0.29 (6.09~7.10) ㎛ in E. erythropterus, 4.19±0.39 (3.39~4.58) ㎛in C. brevicauda, and 3.98±0.46 (3.47~4.93) ㎛in H. eigenmanni. The differences between species were identified in the number of pore canals, thickness, and micropyle inner diameter of egg envelopes, which were species-specific. Our study revealed a morphological mechanism in the egg envelope that prevents the formation of interspecific hybrids, and these features can be taxonomic traits that clarify species names. It also provided useful data for the production (breeding) of the second generation in aquaculture.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2f9ddbd8dd88b47267d3e0150a34d551df2a14d76b7029695d675d30b59bfcf2","category":"Interdisciplinary"}