{"title":"Strategies to Enhance Diagnostic Capabilities for the New Drug-Resistant Tuberculosis (DR-TB) Drugs","link":"https://www.preprints.org/manuscript/202410.1500/v1","date":1729253819000,"content":"The global burden of drug-resistant tuberculosis (DR-TB) continues to challenge healthcare systems worldwide. There is a critical need to tackle DR-TB by enhancing diagnostics and drug susceptibility testing (DST) capabilities, particularly for emerging DR-TB drugs. This endeavor is crucial to optimize the efficacy of new therapeutic regimens and prevent the resistance and overuse of these invaluable weapons. Despite this urgency, there remains a lack of comprehensive review on public health measures aimed at improving the diagnostics and DST capabilities. In this review, we outline strategies to enhance the capabilities especially tailored to address the challenges posed by resistance to new DR-TB drugs. We discuss the current landscape of DR-TB drugs, existing diagnostic and susceptibility testing methods, notable gaps and challenges in these methods, and explore strategies for ensuring fair access to DST while narrowing these disparities. The strategies include public health interventions aimed at strengthening laboratory infrastructure, workforce training, and quality assurance programs, technology transfer initiatives, involving drug developers in the DST development, establishing national or regional referral hubs, fostering collaboration and resources pooling with other infection control efforts, extending testing access in underserved areas through public-private partnerships, advocating for lowering costs or loans at low-interest, remote technical support, and implementing mandatory molecular surveillance monitoring. This review underscores the urgent need to enhance DST capacities for new DR-TB drugs and identifies opportunities for innovation and improvement. Assessing the extent of the global health impact of these measures is crucial to ensure their effectiveness in combating DR-TB.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2fa7fcb9bd46adb5216c672fd81edc8a4192e5b3d91fcab8b994e889bdd91d44","category":"Interdisciplinary"}