{"title":"With new Macs on the way, here’s what to expect from Apple’s M3 chip","link":"https://www.macworld.com/article/1953800/apple-m3-cpu-gpu-speed-performance.html","date":1689676200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>With the introduction of the M2 Ultra, bringing us <a href=\"https://www.macworld.com/article/1948425/mac-studio-m2-max-review.html\">Mac Studio updates</a> and the <a href=\"https://www.macworld.com/article/1952628/first-m2-ultra-mac-pro-benchmarks.html\">Mac Pro</a> with it, Apple has completed its transition away from Intel and wrapped up the M2 family of processors.</p>\n\n\n\n<p>Now, all eyes are looking ahead to M3. Reports say that <a href=\"https://www.macworld.com/article/1949101/m3-version-15-inch-macbook-air-already-in-works.html\">Apple is already testing new laptops with the M3</a> and the first possibly <a href=\"https://www.macworld.com/article/1996129/m3-imac-macbook-air-pro-launch-2023-fall-event.html\">arriving later this year</a>. We don’t know much about the M3 yet, except that it will likely be made using TSMC’s 3nm manufacturing process. </p>\n\n\n\n<p>If we want to have some idea of what to expect with the M3, we can look at the evolution of M-series processors and how they relate to the A-series used in iPhones and iPads. Nobody really knows what the M3 will bring until Apple tells us, but we can use the past to help predict the future.</p>\n\n\n\n<p><em><strong>Updated 07/18/23:</strong> A spreadsheet error caused some inaccurate Geekbench numbers. Those have been fixed.</em></p>\n\n\n\n<h2>How the M3 relates to the A16</h2>\n\n\n\n<p>When we <a href=\"https://www.macworld.com/article/614713/m2-chip-cpu-gpu-speed-performance.html\">estimated the performance of the M2 processor</a> early last year, we based our assumptions on a simple concept: just as the M1 is essentially a big A14 with a few tweaks, the M2 would be a big A15. If you look at the performance difference between the A15 and A14, you can estimate the performance gap between the M2 and M1.</p>\n\n\n\n<p>That turned out pretty well–our predictions weren’t far off. We believe the M3 will be based on the same architectural updates found in the A16, only again with more cores and a few other adjustments. Is it fair to say the M3 will have the same performance gap over the M2 as the A16 has over the A15? That’s probably an oversimplification, but it’s the best place to start for any discussion of a processor that’s still at least a couple of months away.</p>\n\n\n\n<h2>TSMC’s 3nm process</h2>\n\n\n\n<p>All the rumors so far say that the M3 will be a 3nm chip, manufactured by Apple’s partner TSMC. That’s one reason why we might not see an M3-based product this year, in fact. TSMC’s 3nm process is still a nascent process with a comparatively small production capacity, and Apple is using it all just for the A17 in iPhones this fall. Those bigger (and lower-volume) M-series chips need to wait for TSMC’s manufacturing capacity to increase and that might not happen until 2024.</p>\n\n\n\n<p>But regardless of timing, this shift in manufacturing does put a small wrinkle in our performance estimates. The A14, A15, A16, M1, and M2 were all made on various versions of TSMC’s 5nm process. The jump to 3nm is a pretty big deal–it brings far greater density and should allow for either faster clock speeds, lower power, or perhaps a little of both.</p>\n\n\n\n<p>The greater density means Apple will have the space for more cores, more cache, or other features to make the M3 a bigger leap from the A16’s design than the M2 was to the A15. </p>\n\n\n\n<h2>M3: CPU performance estimates</h2>\n\n\n\n<p>Let’s start by taking a look at the evolution of single-core CPU performance for recent A-series chips. We’re looking at a gain of about 9-10% in Geekbench 6.1, year over year. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-single.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"M3 Preview A series CPU performance\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-single.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-single.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-single.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-single.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /></figure><p>Foundry</p></div>\n\n\n\n<p>Improvements in multi-core performance have been higher, in the 15-20 percent range each year, even though all three chips have the same core count: two high-performance cores and four high-efficiency cores. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-multi.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"M3 preview multi-core A series\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-multi.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-multi.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-multi.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-multi.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /></figure><p>Foundry</p></div>\n\n\n\n<p>How is this going to translate into M3 performance? We start with the M2 scores and then add the same performance difference we saw between the A15 (upon which the M2 is based) and A16 (upon which the M3 may be based). And this is what we find…</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/M3-preview-GB61-M3est-single2.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Geekbench 6.1 estimate preview\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/M3-preview-GB61-M3est-single2.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/07/M3-preview-GB61-M3est-single2.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/M3-preview-GB61-M3est-single2.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/M3-preview-GB61-M3est-single2.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /></figure><p>Foundry</p></div>\n\n\n\n<p>A single-core score of around 2900 or so would put the M3 in the same league as Intel’s 13th-generation (Raptor Lake) CPUs. The fastest Intel and AMD desktop CPUs today score around 3,000 or just a bit less, and the highest-performing chip for thin-and-light laptops are in the 2,500-2,600 range. Intel and AMD have made big improvements since the M1 shocked the processor industry with its performance and efficiency, and Apple will need to deliver a surprisingly big performance leap in single-core performance with M3 to stay ahead. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/M3-preview-GB61-M3est-multi2.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Geekbench M3 mutli-core estimate\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/M3-preview-GB61-M3est-multi2.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/07/M3-preview-GB61-M3est-multi2.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/M3-preview-GB61-M3est-multi2.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/M3-preview-GB61-M3est-multi2.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /></figure><p>Foundry</p></div>\n\n\n\n<p>A multi-core Geekbench score of over 11,000 for the M3 assumes that Apple delivers the same multi-core performance boost it did with the A16, but does <em>not</em> assume an increase in core count over the M2. The same goes for the M3 Max score of over 16,000. While those are good scores, the best desktop CPUs from Intel and AMD currently score around 20,000. </p>\n\n\n\n<p>The 16,000 score is in line with the best Intel/AMD laptop chips today, and 11,000 is only competitive if you look at very power-constrained competitors. </p>\n\n\n\n<p>However, <a href=\"https://www.macworld.com/article/1916549/apple-silicon-m3-pro-max-processor-mac-sales.html\">Bloomberg’s Mark Gurman reported</a> that a version of the M3 Pro in testing now has 12 cores: six high-performance and six high-efficiency. Every M2 has four efficiency scores, so it could be that Apple is adding a couple of efficiency cores to at least the M3 Pro/Max and perhaps the entire M3 line. Should that happen, you might see multi-core performance go up by 1,000 points or so.</p>\n\n\n\n<p>By the time M3 products hit the market, Intel and AMD are expected to have new-generation processors available that will raise the performance and efficiency bar even further. When it comes to multi-core performance, the M3 generation would have to make larger-than-expected improvements in order to outpace the advances Intel and AMD are making.</p>\n\n\n\n<h2>M3 and M3 Max GPU performance estimates</h2>\n\n\n\n<p>When predicting GPU performance, things change a little. Apple added GPU cores to the M2 and looks likely to do the same with the M3 generation. The M2 took the max GPU cores from eight to 10, the M2 Pro from 16 to 19, and the M2 Max from 32 to 38. (The M2 Ultra is two M2 Max chips stitched together.)</p>\n\n\n\n<p>That Mark Gurman leak said that base-model M3 Pro had 18 GPU cores, an increase of two cores over the base-model M2 Pro; the fully equipped M3 Pro may therefore have 20-24. From that we can infer the M3 would have 10-12, and the M3 Max 40-48 GPU cores.</p>\n\n\n\n<p>Here’s what GPU Compute performance in Geekbench 6 looks like on Apple’s A-series chips.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-metal.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"M3 preview A series metal\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-metal.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-metal.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-metal.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-Ax-metal.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /></figure><p>Foundry</p></div>\n\n\n\n<p>What’s that going to do to GPU performance? Our estimation takes the leap from A15 to A16 and applies that to the M series.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-M3est-metal-1.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"M3 preview Compute Metal perf\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-M3est-metal-1.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-M3est-metal-1.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-M3est-metal-1.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-GB61-M3est-metal-1.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /></figure><p>Foundry</p></div>\n\n\n\n<p>For GPU compute performance using the Metal API, that means scores approaching 45,000 for the M3 and over 155,000 for the M3 Max. These are respectable figures, but <em>far</em> behind the best graphics cards over on the PC side, which score between 250-300k on the OpenCL version of this benchmark. The best Radeon cards used with Intel-based Macs score over 200,000. You can add about 10 percent to those scores if Apple increases the core count as expected.</p>\n\n\n\n<p>Of course, none of those will fit in a laptop. Squeezing as much GPU performance as you can into a single system-on-chip with shared memory is Apple’s game now, and that means great power and thermal performance. The fastest scores are going to be dominated by power-hungry desktop parts that can devote hundreds of watts each to the CPU and GPU, and that’s now exclusively the domain of Windows and Linux PCs.</p>\n\n\n\n<p>The speed at which a GPU can run computational algorithms is one thing, but what really gets people excited is 3D graphics performance for high-end games. Graphics performance improved a lot going from the A14 to A15 thanks to the addition of a fifth GPU core, but the A16 still managed to squeeze out more than 12 percent more performance while keeping the same core count thanks largely to the use of faster memory.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-3dmark-Ax.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"M3 preview 3DMark A series\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-3dmark-Ax.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-3dmark-Ax.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-3dmark-Ax.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-3dmark-Ax.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /></figure><p>Foundry</p></div>\n\n\n\n<p>The M series keeps adding cores and is expected to add them again. Our estimate shows a respectable boost in performance, but again, this doesn’t come anywhere close to power-hungry graphics cards. Even if you add 10 percent to our estimates for additional cores.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-3dmark-M3est.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"M3 preview 3DMark\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-3dmark-M3est.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-3dmark-M3est.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-3dmark-M3est.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/M3-preview-3dmark-M3est.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /></figure><p>Foundry</p></div>\n\n\n\n<p>A score of 28,000 for the M3 Max puts it in the same ballpark as a GeForce RTX 3070. Impressive for a big system-on-chip that can go into a laptop, but handily outclassed by the best desktop GPUs today by a wide margin.</p>\n\n\n\n<h2>Apple might yet surprise us</h2>\n\n\n\n<p>Of course, our performance assumptions take a look at the leap from the A15 to A16 and assume the same leap from M2 to M3. But if all the rumors are true, the M3 will jump to a new 3nm manufacturing process, which can potentially allow for a big increase in transistor count. The safe bet is that the M3 will be to the M2 exactly what the A16 was to the A15, but I’m hoping for more.</p>\n\n\n\n<p>This could manifest in lots of ways: more cores, more cache, or even fundamental design changes to increase throughput. The rumors of a couple of extra efficiency cores are reasonable, but there would be room for one or two more high-performance cores. Or, the high-performance cores may not follow the architecture of the A16 at all–maybe Apple had time to incorporate the next design, the one likely to appear in the A17.</p>\n\n\n\n<p>The GPU architecture is getting a little old and didn’t really change in the A16 generation. Perhaps M3 will have an entirely new GPU core design? Is it too much to hope for ray-tracing acceleration?</p>\n\n\n\n<p>And of course, AI and machine learning are super important to Apple. An upgraded Neural Engine is not at all out of the question.</p>\n\n\n\n<p>I complained that the <a href=\"https://www.macworld.com/article/1073243/a16-processor-cpu-gpu-lpddr5-memory-performance.html\">A16 was essentially an A15+</a>, a chip with little more to show for it than ramped-up clock speeds and faster memory. It has been speculated that the original A16 design was more divergent from A15 and was intended to be a 3nm chip. But TSMC’s process wasn’t ready in time to make tens of millions of iPhones last fall, so we got a tuned-up A15 instead. But with M3 possibly coming much later, perhaps it will utilize some of the design changes and enhancements originally intended for A16 that never made it.</p>\n\n\n\n<p>When the M1 was released, the entire CPU industry was set back on its heels. By the time the M3 is released, that will be over three years in the past, and both Intel and AMD have had time to make adjustments, pushing performance and efficiency to new heights. If Apple is going to continue to impress with its performance and efficiency, the M3 is going to have to deliver more than the same performance leap we found in the M2. It will need to be more than the A15-to-A16 transition transferred to laptop and desktop chips. The jump to a 3nm process affords Apple the opportunity to do a lot more to separate the M3 from its predecessor than it did with the 5nm A16, and to protect its reputation, it has to.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2fafb3f4f7a4463373b3a73717629bbc502e5788014946f33af9a8bc2fdbc7c6","category":"Apple"}