{"title":"PSVI-9 Effect of botanical extracts in diets with nutritional or pharmacological levels of copper and zinc on growth performance and fecal dry matter in nursery pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/324/7664969?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>A total of 340 barrows (DNA 200 × 400, initially 6.1 kg) were used in a 38-d growth study to determine the effect of botanical extracts of capsicum oleoresin, clove essential oil, and garlic essential oil (CCG; Fytera Start, Selko, Indianapolis, IN) in diets with or without pharmacological levels of Zn and Cu on growth performance and fecal dry matter (DM) of nursery pigs. Pigs were weaned at 21 d of age, randomly allotted to pens based on initial body weight (BW), and allotted to 1 of 4 dietary treatments in a CRD with 5 pigs/pen and 17 pens/treatment. Diets were fed in three phases from d 0 to 10, d 10 to 21, and d 21 to 38 and treatments were arranged in a 2 × 2 factorial with main effects of CCG (none or 100 mg/kg) and nutritional or pharmacological levels of Zn and Cu. Zinc levels were 110 or 3,000, 2,000, and 110 mg/kg of Zn (ZnO) in phase 1, 2, and 3, respectively, and Cu levels were 16.5 or 250 mg/kg of Cu (CuSO<sub>4</sub>). On d 0, there was an unintentional minor main effect of CCG (<span>P</span> = 0.008) on BW. As a result, d 0 BW was used as a covariate for all other growth performance responses. From d 0 to 21 and d 0 to 38, there was a CCG × Zn/Cu interaction for average daily gain (ADG) and average daily feed intake (ADFI; <span>P</span> &lt; 0.05; Table) where CCG numerically increased ADG and ADFI in pigs not fed pharmacological levels of Zn/Cu; but reduced ADG and ADFI when pigs were fed pharmacological levels of Zn/Cu. Overall gain to feed ratio (G:F) tended to increase (<span>P</span> &lt; 0.10) in pigs fed diets with pharmacological levels of Zn/Cu. For fecal dry matter, there was a Zn/Cu × day interaction (<span>P</span> = 0.001) in which there was no difference in fecal DM on d 10 (<span>P</span> &gt; 0.10), but pigs fed pharmacological levels of Zn/Cu had decreased fecal DM (<span>P</span> &lt; 0.001) on d 21. Fecal DM was increased (<span>P</span> &lt; 0.001) on d 10 compared with d 21. In summary, feeding pharmacological levels of Zn and Cu resulted in increased ADG and ADFI. CCG numerically increased ADG and ADFI in pigs fed nutritional levels of Zn/Cu and numerically decreased ADG and ADFI in pigs fed pharmacological levels of Zn/Cu. There was no impact of CCG or Zn and Cu level on fecal DM on d 10. However, feeding pharmacological levels of Zn and Cu resulted in decreased fecal DM at d 21.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2fb25499b710ac743ca0aa142e156c120637dd68818e774635929acc6a2065a3","category":"Environment"}