{"title":"Built Environment, Natural Environment, and Mental Health","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024GH001047?af=R","date":1719039600000,"content":"<h2>Abstract</h2>\n<p>Mental health disorders have become a global problem, garnering considerable attention. However, the root causes of deteriorating mental health remain poorly understood, with existing literature predominantly concentrating on socioeconomic conditions and psychological factors. This study uses multi-linear and geographically weighted regressions (GWR) to examine the associations between built and natural environmental attributes and the prevalence of depression in US counties. The findings reveal that job sprawl and land mixed use are highly correlated with a lower risk of depression. Additionally, the presence of green spaces, especially in urban area, is associated with improved mental health. Conversely, higher concentrations of air pollutants, such as PM<sub>2.5</sub> and CO, along with increased precipitation, are linked to elevated depression rates. When considering spatial correlation through GWR, the impact of population density and social capital on mental health displays substantial spatial heterogeneity. Further analysis, focused on two high depression risk clustering regions (northwestern and southeastern counties), reveals nuanced determinants. In northwestern counties, depression rates are more influenced by factors like precipitation and socioeconomic conditions, including unemployment and income segregation. In southeastern counties, population demographic characteristics, particularly racial composition, are associated with high depression prevalence, followed by built environment factors. Interestingly, job growth and crime rates only emerge as significant factors in the context of high depression risks in southeastern counties. This study underscores the robust linkages and spatial variations between built and natural environments and mental health, emphasizing the need for effective depression treatment to incorporate these multifaceted factors.</p>","author":"Yehua Dennis Wei, \nYu Wang, \nDavid S. Curtis, \nSungeun Shin, \nMing Wen","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"2fb975467306d378032eb72e73d3b9d51aae03fdecbc46e5ed0e7581a765b002","category":"Environment"}