{"title":"Daily Telescope: A simple shot of the Milky Way high above France and Spain","link":"https://arstechnica.com/?p=1992504","date":1703163657000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/MilkyWayPyrenees-800x533.jpg\" alt=\"The Milky Way Galaxy above the Pyrenees, right on the French and Spanish border.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/MilkyWayPyrenees-scaled.jpg\">Enlarge</a> <span>/</span> The Milky Way Galaxy above the Pyrenees, right on the French and Spanish border. (credit:  bulbs_01_frizzle)</p>  </figure>\n\n\n\n\n      <p><em>Welcome to the <a href=\"https://arstechnica.com/tag/daily-telescope/\">Daily Telescope</a>. There is a little too much darkness in this world and not enough light, a little too much pseudoscience and not enough science. We'll let other publications offer you a daily horoscope. At Ars Technica, we're going to take a different route, finding inspiration from very real images of a universe that is filled with stars and wonder.</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p>Good morning. It's December 21, and today's image showcases our very own Milky Way Galaxy above the Pyrenees mountain range, which separates Spain from the rest of Europe.</p>\n<p>It was sent in by a reader who captured it while hiking through the mountains and in their words bivvying—a new word for \"minimalist camping\" that I learned about five minutes ago. I'm jealous. Hiking through the Pyrenees and gazing at the stars at night sounds like a wonderful dream. The photographer told me they are no great astrophotographer, but that the skies were so dark and brilliant that even this single exposure photo taken with a Fuji X100 APS camera looks stunning.</p></div><p><a href=\"https://arstechnica.com/?p=1992504#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1992504&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2fc047b84458b46f0f64fddfb4034bbb4959cf3ba54150a12d20a715b7cfe268","category":"Tech"}