{"title":"BIG enhances Arg/N-degron pathway-mediated protein degradation to regulate Arabidopsis hypoxia responses and suberin deposition","link":"https://academic.oup.com/plcell/article/36/9/3177/7644967?rss=1","date":1712880000000,"content":"<span><div>Abstract</div>BIG/DARK OVEREXPRESSION OF CAB1/TRANSPORT INHIBITOR RESPONSE3 is a 0.5 MDa protein associated with multiple functions in Arabidopsis (<span>Arabidopsis thaliana</span>) signaling and development. However, the biochemical functions of BIG are unknown. We investigated a role for BIG in the Arg/N-degron pathways, in which substrate protein fate is influenced by the N-terminal residue. We crossed a <span>big</span> loss-of-function allele to 2 N-degron pathway E3 ligase mutants, <span>proteolysis6</span> (<span>prt6</span>) and <span>prt1</span>, and examined the stability of protein substrates. Stability of model substrates was enhanced in <span>prt6-1 big-2</span> and <span>prt1-1 big-2</span> relative to the respective single mutants, and the abundance of the PRT6 physiological substrates, HYPOXIA-RESPONSIVE ERF2 (HRE2) and VERNALIZATION2 (VRN2), was similarly increased in <span>prt6 big</span> double mutants. Hypoxia marker expression was enhanced in <span>prt6 big</span> double mutants; this constitutive response required arginyl transferase activity and RAP-type Group VII ethylene response factor (ERFVII) transcription factors. Transcriptomic analysis of roots not only demonstrated increased expression of multiple hypoxia-responsive genes in the double mutant relative to <span>prt6</span>, but also revealed other roles for PRT6 and BIG, including regulation of suberin deposition through both ERFVII-dependent and independent mechanisms, respectively. Our results show that BIG acts together with PRT6 to regulate the hypoxia-response and broader processes in Arabidopsis.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"2fc2e51314688e5ff06da2c282efcbc4635689c104f62c1480ae1d6152c8aa58","category":"Environment"}