{"title":"Prevalence of pulmonary tuberculosis among casual labourers working in selected road construction sites in central Uganda","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304719","date":1717768800000,"content":"<p>by Ivan Ahimbisibwe, Cathbert Tumusiime, Laban Muteebwa, Ezekiel Mupere, Irene Andia Biraro</p>\r\nIntroduction <p>Workers with occupational exposure to respirable silica dust, such as casual labourers at road construction sites (RCSs), are known to be at high risk of developing pulmonary tuberculosis (TB). There is limited literature about the burden of PTB among this subpopulation with high occupational exposure to silica dust at road construction sites. We aimed to determine the prevalence of PTB among casual labourers working at road construction sites in central Uganda.</p> Methods <p>We enrolled 297 participants via consecutive sampling in a cross-sectional study between September 1<sup>st</sup> and September 30<sup>th</sup>, 2022, at four road construction sites in four districts in central Uganda. A structured questionnaire was administered, and the PTB patients were identified by using GeneXpert and/or computer-aided detection for TB (CAD4TB). The data were analysed with STATA version 17.0. Descriptive statistics adjusted for clustering were used to summarize the data, and the relationships between PTB and independent variables were assessed by using a mixed effects modified Poisson regression model to estimate the adjusted prevalence ratios.</p> Results <p>Most participants were males (95.6% [284/297]), and the median age was 29 years (interquartile range [IQR]: 25–33). The prevalence of PTB among casual labourers was 2.4% (95% CI: 1.9, 2.8). Not being vaccinated with BCG (3.45, 95% CI: 1.02, 11.61), alcohol use (2.70, 95% CI: 1.52, 4.80) and staying in shared rooms (8.13, 95% CI: 4.37, 15.12) were positively associated with having PTB.</p> Conclusion <p>There is a high prevalence of PTB among casual labourers working at road construction sites in central Uganda. Individuals who had never been vaccinated with BCG, alcohol users and those staying in shared rooms were at an increased risk of having PTB. We recommend routine screening of casual labourers at road construction sites to optimize active TB case finding.</p>","author":"Ivan Ahimbisibwe","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2fd49bc2ffcc97a1400bb07ad4e92483e1fb6849a8503fe200e4e22aed32a3ed","category":"Interdisciplinary"}