{"title":"La Flèche Wallonne 2021 Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/la-fleche-wallonne-2021-preview","date":1618508675000,"content":"\n      <p><span>The heart of the Ardennes Classics takes place this year on 21st April. The strongest puncher wins La Flèche Wallonne, no questions asked.</span></p>\n<div></div>\n<p><span>This is due to the searing climb that defines the race — the Mur de Huy. 1.2km with an average gradient of 10.1% and featuring much steeper pitches, it's a real <span>hellhole.</span></span></p>\n<p><span>It comes as no surprise, then, that a select few riders have dominated the race over the last decade. Alejandro Valverde and Julian Alaphilippe won every edition between 2014 and 2019. The Spaniard claimed victory four years in a row from 2014 to 2017, before Julian Alaphilppe won in 2018 and 2019.</span></p>\n<p><span>That streak means Valverde holds the record for the most wins with an astonishing five to his name, after his other victory in 2006.</span></p>\n<p><span><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related – The 2021 Men's WorldTour Calendar<br /></a></em></strong></span><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related – Giro d'Italia 2021 Preview</a></em></strong></p>\n<p><span>Both Valverde and Alaphilippe were absent last year after a reshuffling of the calendar, allowing Marc Hirschi to break the trend. Hirschi was up against the likes of Mike Woods and <span>Benoît </span>Cosnefroy, but the Swiss outlasted the rest on the Mur de Huy.</span></p>\n<h4><b>Route</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/download_8c0606b6-9535-4d43-a8a9-2406d5e40a11_1024x1024.png?v=1618492854\" /></b></p>\n<p><em>La Flèche Wallonne 2021 (via La Flamme Rouge)</em></p>\n<p>At 192.5km, La Fleche isn’t the longest classic on the calendar. The steep pitches are what provide the main difficulty here.</p>\n<p><span>The first half of the race will see the riders travel west from Charleroi towards Liege. A breakaway will form in this section of the race as some teams look for TV time or a tactical advantage which can be used later on.</span></p>\n<p><span>After the first 120km comes the final circuit, which will be ridden three times. The main attraction here is the aforementioned Mur de Huy (1.2km @ 10.1%), though the Côte d’Ereffe (2.1km @ 5.5%) and the <span>Côte du Chemin des Gueuses (1km @ 5.5%)</span> are far from easy.</span></p>\n<p><span>In all likelihood, the first lap or two will be ridden at tempo to ensure the breakaway doesn't have a chance at stealing the show, whereas we could see some attacks go off in the final lap before the Mur de Huy. However, such is the difficulty of the Mur de Huy, the race winner will likely be sat in the main bunch conserving their legs for the final kilometre.</span></p>\n<h4><b>Contenders</b></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_582901_cycle-12_1024x1024.jpg?v=1618491520\" /><em><span>Marc Hirschi winning last year (Image credit: Presse Sports / Offside)</span></em></p>\n<p><span>We will start with last year’s winner, Marc Hirschi. The Swiss made the controversial, shocking and intrepid move to Team UAE-Emirates after a hugely successful season with Sunweb. He added a Bronze medal at the World Championships and a runner-up spot at LBL to his wins at La Flèche and the Tour de France. He is yet to reach those heights with UAE after his season was delayed due to injury and wasn't entirely on top of his game at the Amstel Gold Race. If Hirschi is on form he again will be among the leading contenders, the question is <em>if</em>.</span></p>\n<p><span>Next, let's focus on the duo that have dominated this race as of late. La Flèche was unequivocally built for Julian Alaphilippe. The Frenchman’s form here reads: 2-2-1-1. Never worse than second and first on his two most recent starts, Alaphilippe remains the man to beat, despite looking lacklustre at the Amstel Gold Race as he finished sixth. <span>La Flèche suits him more though, and</span> Deceuninck-Quick Step will ride entirely for the World Champion with the likes of <span>Mikkel Frølich Honoré</span> and the ever-impressive Mauri Vansevenant in their squad.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_583900_cycli-42_1024x1024.jpg?v=1618495088\" /><em><span>Julian Alaphilippe (Image credit: Presse Sports / Offside)</span></em></span></p>\n<p><span>The record holder. Alejandro Valverde is an intriguing case this season. After displaying some signs of his age, for which he cannot be blamed, the Spaniard seems to be back to some of his best form. He achieved top-3s at both the Volta Catalunya and the Itzulia Basque Country Tour and also won the Gran Premio Miguel Indurain. This result stands out as the parcours are not overly dissimilar to that of La Flèche. It would require one of Valverde’s most spectacular performances in his illustrious career, but the Spaniard claiming his sixth win here is not entirely out of the question.</span></p>\n<p><span>Next, last year’s Tour de France 1-2. Tadej Pogacar and Primoz Roglic are both better known for their stage-racing accomplishments, but they are also some of the best riders in the world on the hilly classics. Pogacar may have been disappointed with his 9th place here last season, though his form in 2021 has been absolutely stellar. Will UAE ride for Pogacar, Hirschi or even both?</span></p>\n<p><span>Primoz Roglic hasn’t ridden a typical Ardennes season before, always choosing to focus on stage races. However, he will make his La Flèche Wallonne debut this season. He continued his dominance in 2021 by winning the Itzulia Basque Country Tour and three stages at Paris-Nice. He was ever-present at the Amstel Gold Race this season too until he suffered a mechanical in the final kilometres. One of the strongest punchers in the peloton, it will be fascinating to see how he fares against the likes of Julian Alaphilippe on the Mur de Huy.</span></p>\n<p><span>Sticking on the subject of the Itzulia Basque Country Tour, David Gaudu deserves a mention here. Gaudu was the single rider able to follow Roglic throughout the final stage, where Roglic handed him the stage win. There will be no handouts on offer here, but Gaudu has also performed well in the Ardennes before — he was sixth at Liege-Bastogne-Liege in 2019.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00033036-093_1024x1024.jpg?v=1618495349\" /></span><em><span>Tom Pidcock (Image credit: VK/PN/Cor Vos/SWpix)</span></em></p>\n<p><span>Tom Pidcock of the INEOS Grenadiers claimed his first win last week at Brabantse Pijl. It wasn't any ordinary win either, he defeated Wout Van Aert and Matteo Trentin in a sprint after escaping the rest of the breakaway earlier on. The race features short hills too, although none are as testing as the Mur de Huy. <span>He followed that with a superb performance at the Amstel Gold Race, where he lost the sprint to Wout Van Aert in one of the closest finishes in recent memory. The finish at La Flèche is very different, n</span>onetheless, Pidcock's recent results place him among the frontrunners here. The INEOS Grenadiers will arrive with one of the best squads in the field too, with Adam Yates, <span>Michał Kwiatkowski</span>, Richard Carapaz and Tao Geoghegan Hart also present.</span></p>\n<h4><b>Prediction</b></h4>\n<p>It's difficult to bet against Julian Alaphilippe here considering his form at La Flèche, but that is exactly what we are going to do. We are backing Alejandro Valverde to claim a masterful sixth win at <span>La Flèche Wallonne. To win, he needs to defeat some of the most talented opposition he has come across throughout his time in the peloton, but the Spaniard has been superb in recent months.</span></p>\n<h4><strong>How to Watch the Race</strong></h4>\n<p>The race will be shown live on Eurosport and GCN+ for UK viewers from 13:15 BST on Wednesday 21st April.</p>\n<p><em><span>Cover image: Presse Sports / Offside</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2fd617be0a4df378f12a1bffda1237222c6f2fde8cef9782a5f7f19a0631e881","category":"Cycling"}