{"title":"Donna Noble is back and ready for a fight in trailer for Doctor Who specials","link":"https://arstechnica.com/?p=1970740","date":1695659347000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p><em>Doctor Who</em> returns with three specials starring David Tennant as the Fourteenth Doctor, reunited with Donna Noble (Catherine Tate). </p></div>\n<p><em>Doctor Who</em> marks its 60th anniversary this year with three specials featuring David Tennant as the <a href=\"https://en.wikipedia.org/wiki/Fourteenth_Doctor\">Fourteenth Doctor</a>, with the first slated to air in November. The latest trailer shows the good Doctor reunited with his former companion Donna Noble (Catherine Tate) and facing off against two classic adversaries from the Whovian archives: an alien race called the Meeps and a celestial being known as The Toymaker, played by Neil Patrick Harris.</p>\n<p><strong>(Spoilers below for prior seasons of <em>Doctor Who</em>.)</strong></p>\n<p>When the BBC announced that Ncuti Gatwa would succeed <a href=\"https://arstechnica.com/gaming/2018/12/doctor-who-wraps-a-solid-season-with-its-first-female-time-lord/\">Jodie Whittaker's Thirteenth Doctor</a> as the new incarnation of <em>Doctor Who</em>, fans naturally expected Gatwa to make his first appearance in the traditional regeneration sequence. Instead, in the 2022 special \"<a href=\"https://en.wikipedia.org/wiki/The_Power_of_the_Doctor\">The Power of the Doctor</a>,\" Whittaker's <a href=\"https://en.wikipedia.org/wiki/Thirteenth_Doctor\">Doctor regenerated</a> into an incarnation bearing a striking similarity to the Tenth Doctor—both played by Tennant. It was a savvy marketing move, given the enormous popularity of Tennant's Doctor. With showrunner Chris Chibnall stepping down and Russell T. Davies re-assuming the reins for the show's 60th anniversary, what better time to revisit that character, along with my personal favorite of the companions, Donna Noble?</p></div><p><a href=\"https://arstechnica.com/?p=1970740#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1970740&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2fdc393eba9a1bc606ae791827125d248676e810343f4ea0a4614f454385d5d4","category":"Tech"}