{"title":"A latent class analysis of international change and continuity in adolescent health and wellbeing: A repeat cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305124","date":1718114400000,"content":"<p>by Abigail K. Stevely, Laura A. Gray, Hannah Fairbrother, Laura Fenton, Madeleine Henney, Inge Kersbergen, John Holmes</p>\r\nBackground <p>Since the early 2000s, there have been marked trends in adolescent health and wellbeing indicators across Europe, North America and Australia. In particular, there have been substantial declines in youth drinking. We know little about how these trends are underpinned by co-occurring indicators within individuals. This paper aims to analyse change over time in how indicators cluster within individuals and differences in these patterns between five countries with different trends in youth drinking.</p> Methods <p>We analysed four waves of repeat cross-sectional survey data from 15-year-olds in England (n = 5942), Italy (n = 5234), the Netherlands (n = 5408), Hungary (n = 5274), and Finland (n = 7446), which were included in the Health Behaviours in School-aged Children (HBSC) study between 2001/02 and 2013/14. We defined clusters of individuals using multigroup latent class analyses which accounts for change over time. The class indicators included health behaviours, attitudes, wellbeing and relationships. We modelled associations between class membership, sex, and family affluence over time.</p> Results <p>We identified four classes in all countries: <i>Overall unhealthy</i>, <i>Overall healthy</i>, <i>Moderately healthy</i> and <i>Substance abstainers with behaviour risk indicators</i>. The proportion of adolescents in the <i>Overall unhealthy</i> class declined between 2001/02 and 2013/14 by between 22.8 percentage points (pp) in England and 3.2pp in Italy. The extent to which indicators of health and wellbeing changed as linked clusters differed across countries, but changes in alcohol consumption, smoking, drug use and sexual activity were typically concurrent. Adolescents with low family affluence were more likely to be in the <i>Overall unhealthy</i> class in all years.</p> Conclusions <p>Improvements in indicators of adolescent health and well-being are due mainly to concurrent declines in drinking, smoking, sexual activity, and cannabis use, but these declines are not consistently associated with improvements in other domains. They have also not led to reductions in inequalities in indicators of health and well-being.</p>","author":"Abigail K. Stevely","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2fe3fa1f01a9351354f6bf769dc17e3b914c6313cfddde46fc18c84513b33eda","category":"Interdisciplinary"}