{"title":"The 2024 Chevrolet Blazer first drive: GM’s EV platform goes mainstream","link":"https://arstechnica.com/?p=1990455","date":1702476041000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/2024-Chevrolet-Blazer-EV-1-800x600.jpg\" alt=\"A red Chevrolet Blazer EV pokes out of a driveway\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/2024-Chevrolet-Blazer-EV-1-scaled.jpg\">Enlarge</a> <span>/</span> The new Chevrolet Blazer EV is the latest electric vehicle to use General Motors' Ultium battery platform. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Chevrolet provided flights from Washington to San Diego and accommodation so we could drive the new Blazer EV. Ars does not accept paid editorial content.</aside>\n<p>DEL MAR, Calif.—Americans love midsize SUVs—American automotive product planners, at any rate. These SUVs have supplanted sedans and station wagons as the family-mobile of choice, offering all the advantages of a hatchback with a lofty driving position. Now there's a new one in town, an all-electric version of the Chevrolet Blazer. It's not an EV conversion of the existing Blazer but a new model built on the same dedicated platform as the <a href=\"https://arstechnica.com/cars/2022/06/not-your-grandpas-ride-the-2023-cadillac-lyriq-tested/\">Cadillac Lyriq</a>. After a few hours driving the new Blazer EV around the outskirts of San Diego, here's what we've learned.</p>\n<p>In time, the Blazer EV will be available in three trims (LT, RS, and SS) and in front-, rear-, and all-wheel drive configurations. But for now, Chevy is starting with the Blazer EV RS, available with either a single motor driving the rear wheels and a larger-capacity battery or an all-wheel drive variant with a smaller-capacity battery pack.</p>\n<p>Chevy arranged for us to drive the $57,200 Blazer EV RS RWD first, so let's start there. It uses a 102 kWh battery pack to achieve an EPA range of 324 miles (521 km), sending that energy to a 340 hp (254 kW), 325 lb-ft (440 Nm) permanent magnet electric motor.</p></div><p><a href=\"https://arstechnica.com/?p=1990455#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1990455&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2fe443a55c9e4171e635219fee7bf9efd534f660361004e597f2b5ca0e48fa9f","category":"Tech"}