{"title":"PSLBI-19 Utilization of infrared thermography as a non-invasive method for assessing short-term heat stress in Florida Cracker sheep","link":"https://academic.oup.com/jas/article/102/Supplement_3/637/7757653?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Florida Cracker sheep is a wool sheep breed that was developed under natural selection in Florida, US for more than 5 centuries. The objective of this study was to utilize infrared thermography as a non-invasive method for assessing heat stress in this breed. A total of 14 ewes were allocated to heat stress (HT, n = 7) or cooling (CTL, n = 7) conditions for 6 wk during the summer season. Treatment groups were grouped in concrete floor pens with similar dimensions and characteristics. The HT pen was exposed to regular ambient temperatures and had access to shelter, feed, and freshwater ad libitum. For the cooling pen, an evaporative cooling fan was used. Data for ambient temperature and relative humidity of HT and CTL pens were recorded on a weekly basis to estimate the temperature humidity index (THI). Rectal temperature and infrared images were taken every week with the help of a veterinary thermometer and a handheld portable infrared thermal camera, respectively. For IRT, images of the eye area, forehead, legs (left and right) and flanks (left and right) were taken. A mixed model with repeated measures was used. Fixed effects included treatment (HT or CTL), week (1 to 6), and the treatment x week interaction. Animal was fitted as a random effect and the baseline data were used as a covariate. The THI for the HT group ranged from 81.3 to 89.5. For the CTL group, the THI ranged from 73.5 to 75.6. No significant changes were observed for rectal temperature in the experimental groups. For IRT, significant differences were observed for the forehead, the eye area, and the flanks. In conclusion, IRT can be utilized as a non-invasive method to evaluate short-term heat stress in Florida Cracker sheep.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2ff20ee4cf90512d435019261d59f5a83d7ab9d9302be649ea183a4760f1b620","category":"Environment"}