{"title":"Modeling individual growth reveals decreasing gray whale body length and correlations with ocean climate indices at multiple scales","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17366?af=R","date":1717743600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/36c460da-ac06-45e8-b9ae-d0285010aa3e/gcb17366-toc-0001-m.png\" alt=\"Modeling individual growth reveals decreasing gray whale body length and correlations with ocean climate indices at multiple scales\" />\n<p>We investigated the trend in the body size of gray whales using a distinct foraging ground along the NE Pacific coast and tested its association with two climatic indices at multiple scales. We detected a strong decline in maximum length, which started around the year 2000 and has been stronger in females. We found that this decline was correlated with a decadal index of ocean climate oscillation and, at smaller scales, the balance between productivity and nutrient retention. Our results contribute to the mounting evidence that marine predator body size is shrinking in association with climate changes.</p>\n<br />\n<h2>Abstract</h2>\n<p>Changes in body size have been documented across taxa in response to human activities and climate change. Body size influences many aspects of an individual's physiology, behavior, and ecology, ultimately affecting life history performance and resilience to stressors. In this study, we developed an analytical approach to model individual growth patterns using aerial imagery collected via drones, which can be used to investigate shifts in body size in a population and the associated drivers. We applied the method to a large morphological dataset of gray whales (<i>Eschrichtius robustus</i>) using a distinct foraging ground along the NE Pacific coast, and found that the asymptotic length of these whales has declined since around the year 2000 at an average rate of 0.05–0.12 m/y. The decline has been stronger in females, which are estimated to be now comparable in size to males, minimizing sexual dimorphism. We show that the decline in asymptotic length is correlated with two oceanographic metrics acting as proxies of habitat quality at different scales: the mean Pacific Decadal Oscillation index, and the mean ratio between upwelling intensity in a season and the number of relaxation events. These results suggest that the decline in gray whale body size may represent a plastic response to changing environmental conditions. Decreasing body size could have cascading effects on the population's demography, ability to adjust to environmental changes, and ecological influence on the structure of their community. This finding adds to the mounting evidence that body size is shrinking in several marine populations in association with climate change and other anthropogenic stressors. Our modeling approach is broadly applicable across multiple systems where morphological data on megafauna are collected using drones.</p>","author":"Enrico Pirotta, \nK. C. Bierlich, \nLeslie New, \nLisa Hildebrand, \nClara N. Bird, \nAlejandro Fernandez Ajó, \nLeigh G. Torres","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"2ff47d03bf123a073d9b8d21881247f1c4b8156d0aa6002e8618f6751783448b","category":"Environment"}