{"title":"Effects of supplemental methionine sources in finishing pig diets on growth performance, carcass characteristics, cutting yields, and meat quality","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae088/7682507?rss=1","date":1716768000000,"content":"<span><div>Abstract</div>Supplemental methionine (Met) is widely used within the swine industry; however, data are limited regarding the effect of Met sources on carcass cutability and meat quality. The objective was to determine the effects of L-Met (LM, 99%), DL-Met (DLM, 99%), or calcium salt of DL-Met hydroxyl analog (MHA, 84%) in finishing pig diets on carcass characteristics and meat quality. At 9 weeks of age, pigs (<span>N</span> = 240) were allocated to 60 single-sex pens for a four-phase finishing trial that lasted 104 d. Pigs were fed a common grower diet until day 56 where pens were randomly allotted to one of the three experimental diets. For the remaining 7 wk of the finisher phase, pigs (BW = 79.9 ± 0.80 kg) were fed diets containing LM, DLM, or MHA, with the supplemental Met source providing 25% of standardized ileal digestible (SID) Met + cysteine (Cys) requirement based on 65% bioefficacy for MHA in comparison with LM or DLM. One pig per pen was slaughtered at the study conclusion (on day 104), and the left sides of carcasses were fabricated into subprimal cuts to determine carcass-cutting yields. Loin quality including proximate composition and shear force were measured. Hot carcass weight was not different (<span>P </span>= 0.34) between treatments (LM 104.5 kg; DLM 103.0 kg; MHA 101.5 kg), moreover, loin eye area was not different (<span>P </span>= 0.98) between treatments (LM 52.65 cm²; DLM 52.49 cm²; MHA 52.81 cm²). Boneless carcass-cutting yield was not different (<span>P </span>= 0.56) between treatments (LM 54.97 kg; DLM 54.82 kg; MHA 54.52 kg). Loin pH was not different (<span>P </span>= 0.24) between treatments (LM 5.45; DLM 5.48; MHA 5.45). However, drip loss tended to be reduced (<span>P </span>= 0.11) by the DLM treatment (5.58%) compared with LM (7.03%) and MHA (6.68%) treatments. Shear force was not different (<span>P </span>= 0.85) between treatments (LM 3.03 kg; DLM 3.06 kg; MHA 3.10 kg). However, cook loss tended to be reduced (<span>P </span>= 0.06) by the DLM treatment (16.20%) compared with LM (18.18%) and MHA (18.50%) treatments. These data suggest that only minimal differences in carcass cutability and meat quality can be attributed to Met source in finishing pig diets when using 65% bioefficacy for MHA relative to L-Met or DL-Met.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"2ff52fd96f81a8517dcd332784c412f5224be1868c9df5aa9b0b41a4be2b5c59","category":"Environment"}