{"title":"A systematic review of the Iberian springsnail subgenus Alzoniella (Navarriella) (Caenogastropoda: Hydrobiidae), with the description of a new potentially relict subfamily","link":"https://academic.oup.com/zoolinnean/article/doi/10.1093/zoolinnean/zlad185/7492221?rss=1","date":1703203200000,"content":"<span><div>Abstract</div>The threatened springsnail subgenus <span>Alzoniella</span> (<span>Navarriella</span>) in the Iberian Peninsula has been suggested to be an old and relict lineage of the family Hydrobiidae. The subgenus is represented by two morphological species, both endemic to the Pyrenees and their southern foothills. We conducted phylogenetic analyses based on mitochondrial and nuclear gene fragments of topotypes and other populations, four molecular species delimitation methods, and morphological examinations to clarify the uncertain systematic position of the subgenus within the family, assess its species diversity, and understand the population genetic structure of the two geographically restricted species. Our phylogenetic results revealed that <span>Alzoniella</span> (<span>Navarriella</span>) is distantly related to all other species of <span>Alzoniella</span>, even belonging to an independent subfamily-level clade, for which we introduce the new genus <span>Navarriella</span> and the new subfamily Navarriellinae subfam. nov. Molecular methods and geometric morphometric analysis of shell shape identified a single species in the new genus. The significant phylogenetic distance from other hydrobiid taxa, narrow distribution, and limited gene flow among its populations (estimated from mitochondrial cytochrome <span>c</span> oxidase subunit I sequences) highlight <span>Navarriella</span> as an isolated lineage within the family that requires urgent conservation attention. Furthermore, our results cast a new light on the northern Iberian Mountains as a dispersal barrier for ancient spring lineages.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"2ff6b28cc262dd44bcd561ef165dfce73158b1cecc7f9a89efc9091a7fcbb7b6","category":"Environment"}