{"title":"Reindustrialization","link":"https://markpeak.net/reindustrialization/","date":1636086707000,"content":"<p>วันก่อนเจอมิตรสหายท่านหนึ่ง ทักว่าให้ไปดูนโยบายอุตสาหกรรมของประธานาธิบดี Macron ของฝรั่งเศสที่เพิ่งประกาศออกมา เลยลองไปตามอ่านดู พบว่าน่าสนใจจริงๆ</p>\n<p>เมื่อวันที่ 12 ตุลาคม Macron ประกาศนโยบายชื่อ France 2030 เป็นแผนการลงทุนขนาด 30,000 ล้านยูโร ในอุตสาหกรรม 10 สาขา</p>\n<p>ในแง่หนึ่งมันเป็นการประกาศนโยบายเพื่อหาเสียงเลือกตั้ง (ฝรั่งเศสจะเลือกตั้งประธานาธิบดีเดือนเมษายน 2022) แต่ในอีกแง่หนึ่ง มันก็สะท้อนมุมมองทางเศรษฐกิจ นโยบายของรัฐด้วยเช่นกัน</p>\n<p>ขณะที่โลกกำลังพูดถึง soft power หรืออุตสาหกรรมใหม่ๆ ที่เป็น disruption แต่ Macron กลับพาเราหวนคืนสู่ “อุตสาหกรรมหนัก” อีกครั้ง</p>\n<p>คลิปข่าวสรุปภาษาอังกฤษ</p>\n<p></p>\n<p>คลิปเต็ม (ภาษาฝรั่งเศส)</p>\n<p></p>\n<p>เนื่องจากผมอ่านภาษาฝรั่งเศสไม่ออก ได้แต่อ่านข่าวฉบับภาษาอังกฤษ แต่สื่อหลายเจ้า (<a href=\"https://www.france24.com/en/live-news/20211012-macron-announces-30-billion-euro-plan-to-re-industrialise-france\">France24</a>, <a href=\"https://www.ft.com/content/5da38637-292f-4c2f-ae48-8e0c74b6014c\">FT</a>) ใช้คำเดียวกันว่า “reindustrialization” กลับมาลงทุนในอุตสาหกรรมอีกครั้ง หลังจากห่างหายกันไปนาน โดยมีเป้าหมายเพื่อการเติบโตทางเศรษฐกิจ และลดการพึ่งพาซัพพลายเชนต่างชาติ</p>\n<blockquote><p>Macron said France had taken key decisions “15-20 years later than some of our European neighbours” and now needed “to become a nation of innovation and research again”.</p>\n<p>The spending was to address “a kind of growth deficit” for France brought on by insufficient investment in the past</p></blockquote>\n<p>คำว่าอุตสาหกรรมอาจดูไม่เซ็กซี่แล้ว ในยุคดิจิทัล หรือภาคบริการเติบโต แต่ก็ปฏิเสธไม่ได้ว่า อุตสาหกรรมยังเป็นกลจักรสำคัญของเศรษฐกิจโลกอยู่เสมอ</p>\n<p>คำว่าอุตสาหกรรมเป็นคำที่มีความหมายกว้างในตัวของมันเอง (ความหมายกว้างมากคือ ไม่ใช่เกษตร ไม่ใช่ภาคบริการ) ครอบคลุมไปตั้งแต่อุตสาหกรรมแบบเก่าอย่างทำเหมืองหรือต่อเรือ แต่ reindustrialization ในมุมมองของฝรั่งเศส ซึ่งเป็นชาติอุตสาหกรรมสำคัญชาติหนึ่งของโลก (ผู้ให้กำเนิด Airbus หรือ Peugeot) มองเห็นอะไร (เปิดมาข้อแรก พี่ก็ทำนิวเคลียร์เลย)</p>\n<p>แผนการของ Macron มีทั้งหมด 10 ข้อ ครอบคลุม 6 เซกเตอร์ (ฉบับแปลอังกฤษ คัดมาจาก<a href=\"https://www.businessfrance.fr/discover-france-news-presentation-of-the-france-2030-plan\">เว็บไซต์ Business France ของรัฐบาลฝรั่งเศส</a> มีละเอียดกว่านี้ใน<a href=\"https://www.elysee.fr/emmanuel-macron/2021/10/12/presentation-du-plan-france-2030\">เว็บของรัฐบาล แต่เป็นภาษาฝรั่งเศส</a>)</p>\n<blockquote><p><strong><u>€8 billion for the energy sector:</u></strong></p>\n<p><strong>➜</strong><strong> Objective 1: </strong>To help develop innovative, small-scale nuclear reactors, with better waste management.</p>\n<p><strong>➜</strong><strong> Objective 2: </strong>To become the leader in green hydrogen. In 2030, France will have at least two gigafactories of electrolyzers, mass producing hydrogen and all useful associated technologies.</p>\n<p><strong>➜</strong><strong> Objective 3: </strong>To decarbonize France’s industry by reducing greenhouse gas emissions by 35% compared with 2015.</p>\n<p><strong><u>€4 billion for future transport:</u></strong></p>\n<p><strong>➜</strong><strong> Objective 4: </strong>To produce nearly two million electric and hybrid vehicles.</p>\n<p><strong>➜</strong><strong> Objective 5: </strong>To produce the first low-carbon aircraft.</p>\n<p><strong><u>€2 billion for the food sector</u></strong></p>\n<p><strong>➜</strong><strong> Objective 6: </strong>To invest in a healthy, sustainable and traceable diet.</p>\n<p><strong><u>€3 billion for the health sector</u></strong></p>\n<p><strong>➜</strong><strong> Objective 7: </strong>To produce 20 biopharmaceuticals against cancer and chronic diseases, including those related to age, and to create the medical devices of tomorrow.</p>\n<p><strong><u>Investing in the culture field</u></strong></p>\n<p><strong>➜</strong><strong> Objective 8: </strong>To place France once again at the head of cultural and creative content production. Three strategic regions have been identified: the Mediterranean Arc, Ile de France (Paris region) and the Nord. They will be the three great factories of the French Touch.</p>\n<p><strong><u>€2 billion for space and sea beds:</u></strong></p>\n<p><strong>➜</strong><strong> Objective 9: </strong>To play our role in new space adventures.</p>\n<p><strong>➜</strong><strong> Objective 10: </strong>To invest in the field of sea beds.</p></blockquote>\n<p>5 ข้อแรกของ Macron เป็นเรื่องอุตสาหกรรมพลังงานและคมนาคม (อุตสาหกรรมหนักล้วนๆ) มีตั้งแต่พลังงานนิวเคลียร์ ไฮโดรเจน รถยนต์ไฟฟ้า และการผลิตเครื่องบิน เพียงแต่หันมาเน้นเรื่องพลังงานสะอาด ลดการใช้พลังงานฟอสซิล ลดการปล่อยคาร์บอน</p>\n<p>2 ข้อถัดมาเป็นเรื่องสุขภาพ นั่นคืออาหารและการแพทย์ ประเด็นน่าสนจะอยู่ที่เรื่องการแพทย์ โดย Macron ระบุว่าในวิกฤต COVID บริษัทยาฝรั่งเศสกลับไม่สามารถพัฒนาวัคซีนออกมาได้เลย มันต้องมีปัญหาแล้วล่ะ ต้องกลับมาลงทุนจริงจังในเซกเตอร์นี้</p>\n<p>ข้อที่ 8 เป็นเรื่อง soft power ทั้งเรื่องวัฒนธรรม การท่องเที่ยว (ใช้วิธีคิดแบบ region โฟกัสตามภูมิภาค) และพ่วงด้วย 2 ข้อสุดท้ายคือการสำรวจพื้นที่ใหม่ๆ ทั้งอวกาศ (พูดชัดเลยว่าอยากมีแบบ SpaceX) และทะเลลึก (เขายกตัวอย่างเรื่องการขุดแร่ในทะเล)</p>\n<p>นอกจากนี้ Macron ยังพูดถึง 5 ปัจจัยพื้นฐานที่ต้องมีสำหรับแผนการลงทุนอุตสาหกรรม ได้แก่</p>\n<ol>\n<li>Material – วัสดุพื้นฐาน ตั้งแต่ไม้ เหล็ก แร่หายาก</li>\n<li>Component – ชิ้นส่วนอิเล็กทรอนิกส์ ที่มีปัญหาเรื่องซัพพลายเชน แถมยุโรปผลิตได้แค่ 10% ของโลก</li>\n<li>Digital Technology</li>\n<li>Talent – การลงทุนในคน</li>\n<li>Capital – แหล่งเงินทุน รวมถึงมาตรการภาษีเพื่อจูงใจให้ลงทุน</li>\n</ol>\n<p>ช่วงหลังเราเห็นผู้นำชาติตะวันตกหลายชาติ เริ่มออกมาพูดเรื่องแผนการลงทุนโครงสร้างพื้นฐาน อุตสาหกรรมกันเยอะขึ้นเรื่อยๆ ที่เคยเขียนถึงไว้คือ <a href=\"https://markpeak.net/uk-new-deal/\">UK New Deal ของ Boris Johnson</a> และ <a href=\"https://www.the101.world/biden-american-jobs-plan/\">Build Back Better ของ Joe Biden</a></p>The post <a href=\"https://markpeak.net/reindustrialization/\">Reindustrialization</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"2ff6eb498f32930d8f7c77e42628cf6f50834661ce195f0e7d91f77ee74ab594","category":"Thai"}