{"title":"Supplementation with carnosine, a food‐derived bioactive dipeptide, alleviates dexamethasone‐induced oxidative stress and bone impairment via the NRF2 signaling pathway","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13899?af=R","date":1726651715000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Carnosine, a natural bioactive dipeptide derived from meat muscle, possesses strong antioxidant properties. Dexamethasone, widely employed for treating various inflammatory diseases, raises concerns regarding its detrimental effects on bone health. This study aimed to investigate the protective effects of carnosine against dexamethasone-induced oxidative stress and bone impairment, along with its underlying mechanisms, utilizing chick embryos and a zebrafish model <i>in vivo</i>, as well as MC3T3-E1 cells <i>in vitro</i>.</p>\n<h2>RESULTS</h2>\n<p>Our findings revealed that carnosine effectively mitigated bone injury in dexamethasone-exposed chick embryos, accompanied by reduced oxidative stress. Further investigation demonstrated that carnosine alleviated impaired osteoblastic differentiation in MC3T3-E1 cells and zebrafish by suppressing the excessive production of reactive oxygen species (ROS) and enhancing the activity of antioxidant enzymes such as superoxide dismutase (SOD) and glutathione peroxidase (GPX). Moreover, mechanistic studies elucidated that carnosine promoted the expression and nuclear translocation of nuclear factor erythroid 2-related factor 2 (NRF2), thereby facilitating the transcription of its downstream antioxidant response elements, including heme oxyense-1 (HO-1), glutamate cysteine ligase modifier (GCLM), and glutamate cysteine ligase catalytic (GCLC) to counteract dexamethasone-induced oxidative stress.</p>\n<h2>CONCLUSION</h2>\n<p>Overall, this study underscores the potential therapeutic efficacy of carnosine in mitigating oxidative stress and bone damage induced by dexamethasone exposure, shedding light on its underlying mechanism of action by activating the NRF2 signaling pathway. © 2024 Society of Chemical Industry.</p>","author":"Xi‐you Li, \nXiao‐yuan Gu, \nXiao‐min Li, \nJian‐gang Yan, \nXin‐liang Mao, \nQin Yu, \nYu‐lan Du, \nHiroshi Kurihara, \nChang‐Yu Yan, \nWei‐xi Li","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"2ff928af49d9e0bcca93f7260677f49c3054e3226587b6bb503cd41259c142bf","category":"Environment"}