{"title":"Quantifying the impact of urbanization on wet deposition over Xiong'an New Area in northern China","link":"https://onlinelibrary.wiley.com/doi/10.1111/wej.12919?af=R","date":1714620392000,"content":"<h2>Abstract</h2>\n<p>Xiong'an New Area (XNA) in China is undergoing rapid urbanization due to economic development and population growth. However, the urbanization process can significantly impact the local environment. This study applied a combined method of Weather Research and Forecasting (WRF) and empirical calculations to quantitatively identify changes in precipitation and wet deposition over XNA and its internal lake, Baiyangdian (BYD), during the summer months of June to September. Five different urbanization scenarios were established by varying the WRF subsurface conditions. By comparing these scenarios with historical observations, it was found that WRF simulations could effectively reproduce the precipitation and temperature changes in the region. This study examined how different levels of urbanization affect precipitation and estimated changes in PM<sub>2.5</sub> wet deposition. The study's results indicate that as urbanization increases, it leads to an increase in precipitation and wet deposition in the XNA region. Using the relatively low urbanization level in 1980 as a benchmark for comparison, it was observed that when XNA becomes fully urbanized, the increase in precipitation and wet deposition in the region exceeds 7%. The BYD Lake can have a moderating effect on the environment, absorbing more than 50% of the local precipitation and PM<sub>2.5</sub> wet deposition with less than 25% of its area, compared to the XNA interval of the statistics, while the increase in wet deposition in the BYD Lake area is more than 4% after full urbanization in XNA. The findings also emphasize the importance of the need to balance economic growth and environmental protection in urban planning and development.</p>","author":"Wei Wang, \nMin Wan, \nMing Li, \nCiren Mima, \nTao Wang, \nHaozhong Zhong","siteTitle":"Wiley: Water and Environment Journal: Table of Contents","siteHash":"b8106c59269b0bf6595ebcba72d4376e8b07e3df9f0e7d2a7b1cfbc109aa602a","entryHash":"30096da29e29a738d5ab25e62cb8b086aad6d88ec0cd0496b11540332695509c","category":"Environment"}