{"title":"ไมโครซอฟท์คุย เกมบน xCloud รองรับทัชมากกว่า 100 เกมแล้ว เล่นบนมือถือได้สบาย","link":"https://www.blognone.com/node/125449","date":1635152309000,"content":"<div><div><div><p>ประเด็นหนึ่งที่น่าสนใจในวงการเกมมิ่งยุครันบนคลาวด์คือ ไมโครซอฟท์นำเกมพีซี-คอนโซล Xbox มารันบน xCloud เพื่อให้สมาร์ทโฟนและแท็บเล็ตเล่นเกมเดียวกันได้ แต่เกมที่ออกแบบมาสำหรับคอนโซลต้องใช้คอนโทรลเลอร์ ในขณะที่ผู้ใช้สมาร์ทโฟนใช้วิธีแตะสัมผัสบนจอ ไม่อย่างนั้นจำเป็นต้องซื้ออุปกรณ์เสริมเพิ่ม</p>\n<p>ทางออกของไมโครซอฟท์คือร่วมกับค่ายเกม ทยอยปรับแก้วิธีการควบคุมเกมให้รองรับจอสัมผัสด้วย และตอนนี้ไมโครซอฟท์ประกาศว่ามีเกมบน xCloud มากกว่า 100 เกมแล้วที่รองรับจอสัมผัส (<a href=\"https://www.xbox.com/en-gb/xbox-game-pass/games?ocid=XGP_TouchControls_ema_rmc_xbo_Oct_2021\">รายชื่อบนเว็บไมโครซอฟท์</a>) ตัวอย่างเกมเด่นที่รองรับทัชได้แก่ Scarlet Nexus, Gears Tactics, Dragon Quest XI, Hades, Psychonauts ทั้งสองภาค เป็นต้น</p>\n<p>ถึงแม้เกมจำนวนกว่า 100 เกมยังถือเป็นสัดส่วนที่ไม่เยอะนักในคลังเกมทั้งหมดของ Xbox ที่สะสมมาตั้งแต่ Xbox รุ่นแรก (แล้วนำมาเล่นบน Xbox รุ่นปัจจุบันได้แบบ Backward Compatibility) แต่การปรับเกมดังๆ ในอดีตให้รองรับทัช ก็น่าจะเป็นจุดแข็งสำคัญอีกอย่างที่ทำให้ไมโครซอฟท์ได้เปรียบคู่แข่งด้านคลาวด์เกมมิ่งรายอื่นๆ อย่าง Stadia หรือ Amazon Luna ที่ยังมีเกมจำนวนน้อยกว่า</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c7f2210312eb9edb20c7c2572311a955.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.gamesradar.com/xbox-now-offers-more-than-100-games-with-touch-controls-including-hades-and-psychonauts-2\">GamesRadar</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/xcloud\">xCloud</a></div><div><a href=\"/topics/xbox\">Xbox</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/cloud-gaming\">Cloud Gaming</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"300e7abc51d53466550ee609f88bc3f8fc3959abb7cadf6d023197b63d8bb2f5","category":"Thai"}