{"title":"Apple hasn’t given up on a folding iPhone–but it’s still a long way off","link":"https://www.macworld.com/article/2229833/folding-iphone-ipad-development-release-years-away.html","date":1707396807000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The next major redesign to the iPhone may be a couple of years away, and it could involve an iPhone that folds, according to a report on Wednesday by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theinformation.com/articles/apple-develops-a-foldable-clamshell-iphone&amp;xcust=1-1-2229833-1-0-0&amp;sref=https://www.macworld.com/feed\">The Information</a>‘s Wayne Ma (subscription required).</p>\n\n\n\n<p>Citing a person with “direct knowledge of the situation,” Ma reports that Apple is working on prototypes of two folding iPhones, though the devices are in the early stages of development. While Apple has investigated component manufacturing for the phones, the report states that the folding iPhone is not slated for production for this year or next, so if Apple were to proceed with such a device, the earliest it could ship is 2026.</p>\n\n\n\n<p>However, Apple has major obstacles to overcome. There are the “technical challenges” of production, as well as developing “compelling features” besides the mere ability to fold. The company thinks a design with an outside-facing display on a closed iPhone is the way to go, but this makes the phone prone to damage. Also, Apple wants to make the folding iPhone “as thin as current iPhone models.”</p>\n\n\n\n<p>Ma reports that Apple has been researching foldable devices for a decade and engineers demonstrated a foldable 7-inch iPhone in 2018. But the folding iPhone project was put aside to focus on a folding iPad, which the company continues to work on–the challenge continues to be the folding hinge itself. Current folding Android devices don’t fold flat, which is Apple’s preference, but that creates a visible crease with the display, which Apple is trying to eliminate. Last week, The Elec reported that a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.thelec.kr/news/articleView.html?idxno=25724&amp;xcust=1-1-2229833-1-0-0&amp;sref=https://www.macworld.com/feed\">folding iPad mini could ship in 2026 or 2027</a>.</p>\n\n\n\n<p>Folding Android phones have been around since 2018, and they’ve become more popular in recent years as the technology has improved. They have some design compromises, such as folding with a hinge gap, issues with a visible crease in the display, and extra thickness when folded. However, these compromises have become less pronounced over time, to a point now where it’s become more acceptable to customers, resulting in a growing market.</p>\n\n\n\n<p>A recent <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://medium.com/@mingchikuo/2024-iphone-shipments-likely-to-decline-significantly-by-about-15-yoy-due-to-structural-challenges-1cedb3ea3b85&amp;xcust=1-1-2229833-1-0-0&amp;sref=https://www.macworld.com/feed\">report by analyst Ming-Chi Kuo</a> stated that the iPhone’s recent sales decline in China is due to an “increasing preference for foldable phones among high-end users as their first choice for phone replacement.” So, Apple needs to release a folding iPhone to stay relevant in China, a market that is vital to Apple’s bottom line. But based on this and other reports, nothing is likely to arrive for several years.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"301ea047be8a99dae281b12fcda560dc462aa32431e79cd81f4ec1763cee65a3","category":"Apple"}