{"title":"Does Gmail want to be instant messaging? New UI experiment says “yes”","link":"https://arstechnica.com/?p=1982556","date":1699559516000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/7.jpg\" /></div>\n          <p>\n            Gmail's reply bar. A very strange interface for email.                          [credit:\n                              <a href=\"https://www.androidpolice.com/gmail-android-new-quick-reply-ui-test/\">Android Police</a>\n                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Does Gmail want to be an instant messaging client? Last month the popular webmail app shipped an <a href=\"https://arstechnica.com/gadgets/2023/10/gmail-unleashes-email-emoji-reactions-onto-an-unsuspecting-world/\">emoji reactions bar</a> in the mobile app, where a single tap would send a new email with your emoji response. Now, a wild new UI experiment spotted by <a href=\"https://www.androidpolice.com/gmail-android-new-quick-reply-ui-test/\">Android Police</a> goes another step further: a quick reply bar that looks just like instant messaging input.</p>\n<p>Rather than the usual input block you get for writing paragraphs of overly formal text, this new Gmail experiment has a one-line input bar at the bottom for replies. A drop down just above it lets you pick from the usual \"reply,\" \"reply all,\" or \"Forward\" options. Besides that you get an attachment and send button. An \"expand\" button will presumably launch the usual compose interface.</p>\n<p>So far this seems to be an extremely rare test that only one person has gotten, so it's not necessarily going to roll out to everyone. Given the recent emoji launch, though, Gmail certainly seems jealous of its instant-messaging cousins.</p></div><p><a href=\"https://arstechnica.com/?p=1982556\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1982556&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"30235392ce731f8856f340d4b30774ba25d43ee88cb5a5580fe271712fbfa109","category":"Tech"}