{"title":"A mixed-method analysis of provider adherence to integrated antenatal care guideline in BEmONC and Non BEmONC primary health center: An Indonesian case","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309454","date":1724767200000,"content":"<p>by Suryani Yuliyanti, Adi Utarini, Laksono Trisnantoro</p>\r\n\r\nProvider adherence to the integrated antenatal care (ANC) procedure is an important indicator of high-quality ANC. The procedure is intended to avoid missed opportunities to detect the risk of abnormalities in pregnancy. This study aims to assess the provider’s adherence to integrated ANC in Basic Emergency Obstetric and Newborn Care (BEmONC) and non-BEmONC Primary Health Center (PHC). This study employed an explanatory sequential mixed-method design. The quantitative phase reviewed 149 medical records of pregnant women in the four PHCs in Semarang from January until February 2020. The findings were used to describe the provider’s adherence to the integrated ANC and lead to the contributing factors which should be explored in the qualitative phase. The study involved four in-depth interviews with midwife coordinators in four PHCs. The Mann-Whitney and Chi-square test was employed to analyse the quantitative data, while the thematic analysis was undertaken on the qualitative data. The provider’s adherence to the guideline did not differ between BEmONC and non-BEmONC PHC. The general physical examination of the patients (18.81%) and dentist visits (84.6%) were not done in either BEmONC or non-BEmONC PHC. Incomplete laboratory tests were haemoglobin (28.2%) and urine protein (38.9%). The barriers to adherence to the integrated ANC guideline were related to an imbalance of resources, role and responsibility issues among doctors and midwives, and policy issues. This study found low BEmONC nor non-BEmONC PHC adherence to the integrated ANC guideline. A Periodic evaluation of the implementation of integrated ANC to ensure its high-quality implementation in Indonesia is needed.","author":"Suryani Yuliyanti","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3035c36109c544faa3bc95851dc6d2fbe6ddece13000302075c55cb4c1149526","category":"Interdisciplinary"}