{"title":"Suppression of SMXL4 and SMXL5 confers enhanced thermotolerance through promoting HSFA2 transcription in Arabidopsis","link":"https://academic.oup.com/plcell/article/36/10/4557/7727728?rss=1","date":1722816000000,"content":"<span><div>Abstract</div>Identifying the essential factors and underlying mechanisms regulating plant heat stress (HS) responses is crucial for mitigating the threat posed by HS on plant growth, development, distribution, and productivity. In this study, we found that the Arabidopsis (<span>Arabidopsis thaliana</span>) <span>super-killer2</span> (<span>ski2</span>) <span>dicer-like4</span> (<span>dcl4</span>) mutant, characterized by RNA processing defects and the accumulation of abundant 22-nt small interfering RNAs derived from protein-coding transcripts, displayed significantly increased expression levels of HS-responsive genes and enhanced thermotolerance. These traits primarily resulted from the suppression of <span>SMAX1-LIKE4</span> (<span>SMXL4</span>) and <span>SMXL5</span>, which encode 2 putative transcriptional regulators that belong to the SMXL protein family. While <span>smxl4</span> and <span>smxl5</span> single mutants were similar to wild type, the <span>smxl4 smxl5</span> double mutant displayed substantially heightened seedling thermotolerance. Further investigation demonstrated that SMXL4 and SMXL5 repressed the transcription of <span>HEAT-SHOCK TRANSCRIPTION FACTOR A2</span> (<span>HSFA2</span>), encoding a master regulator of thermotolerance, independently of ethylene-response factor–associated amphiphilic repression motifs. Moreover, SMXL4 and SMXL5 interacted with HSFA1d and HSFA1e, central regulators sensing and transducing HS stimuli, and antagonistically affected their transactivation activity. In addition, HSFA2 directly bound to the <span>SMXL4</span> and <span>SMXL5</span> promoters, inducing their expression during recovery from HS. Collectively, our findings elucidate the role of the SMXL4/SMXL5–HSFA2 regulatory module in orchestrating plant thermotolerance under HS.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"303c7ac3358255291aea82166af8def1c0427b6f2c110a7317581385ca7ec0d2","category":"Environment"}