{"title":"Mineral magnetism and palaeoenvironment recorded in loess in southern England","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3620?af=R","date":1713782903000,"content":"<h2>ABSTRACT</h2>\n<p>Extensive research has focused on the loess deposits in southern England, aiming to unravel their stratigraphic and palaeoenvironmental significance. However, no systematic mineral magnetic study on these deposits has yet been undertaken. Here we address this by investigating the magnetic mineral composition and alignment of loess at two sites in southern England, Lowland Point (LP) on the Lizard Peninsula of Cornwall, and Pegwell Bay (PB) in eastern Kent on the Isle of Thanet. A set of rock magnetic analyses was conducted to understand mineral magnetism within the studied sections. In addition, the primary depositional origin of the magnetic fabrics as well as their overprinting caused by various possible post-depositional processes were examined through anisotropy of magnetic susceptibility (AMS). The magnetic mineral composition is similar at both sites, derived from both sedimentary (aeolian) and post-depositional processes. The AMS results show magnetic foliation that varies between the two sites, aligning with the bedding plane, indicating deposition from gravitational dust fall at the PB site, and a stronger wind transport energy at the LP site. Although the magnetic lineation of bulk AMS is relatively weak, there is a noticeable tendency towards alignment in most samples, with flow directions from the SE indicated at both sections if a strong wind is assumed at LP, although with a possible SW direction if a weaker wind is assumed. These observations may imply the preservation of palaeowind directions during dust transport, with a substantial southerly component, which contradicts previous assertions of dominant northerly or northeasterly winds. Indeed, a possible dominant southeasterly wind direction between 25 and 18 ka would suggest a limited influence of katabatic, westerly or polar northeasterly winds during dust transport, and rather may imply the effect of low-pressure systems passing through the English Channel during that period.</p>","author":"Dominika Niezabitowska, \nThomas Stevens, \nBalázs Bradák, \nMartin Chadima, \nYunus Baykal, \nDaniele Sechi, \nRamona Schneider","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"304a9dee4d339768fe9db3f1e1143c37fdac45869a14bd1c76b99853bf290607","category":"Environment"}