{"title":"Forecasting potential invaders to prevent future biological invasions worldwide","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17399?af=R","date":1721026800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/51f4cafe-a028-4f2a-a123-e745f33f5f1a/gcb17399-toc-0001-m.png\" alt=\"Forecasting potential invaders to prevent future biological invasions worldwide\" />\n<p>We developed a reliable, robust and defensible tool that can identify attributes of invading alien species and predict which species worldwide, with no prior history of invasion, have the potential to become invasive. Showcasing our tool on amphibians and reptiles worldwide, we found 160 species are likely to be unintentionally transported and introduced, and 57 have a high risk of establishing alien populations. Our tool is an invaluable addition to the suite of decision-support tools for preventing future biological invasions worldwide.</p>\n<br />\n<h2>Abstract</h2>\n<p>The ever-increasing and expanding globalisation of trade and transport underpins the escalating global problem of biological invasions. Developing biosecurity infrastructures is crucial to anticipate and prevent the transport and introduction of invasive alien species. Still, robust and defensible forecasts of potential invaders are rare, especially for species without known invasion history. Here, we aim to support decision-making by developing a quantitative invasion risk assessment tool based on invasion syndromes (i.e., generalising typical attributes of invasive alien species). We implemented a workflow based on ‘Multiple Imputation with Chain Equation’ to estimate invasion syndromes from imputed datasets of species' life-history and ecological traits and macroecological patterns. Importantly, our models disentangle the factors explaining (i) transport and introduction and (ii) establishment. We showcase our tool by modelling the invasion syndromes of 466 amphibians and reptile species with invasion history. Then, we project these models to amphibians and reptiles worldwide (16,236 species [c.76% global coverage]) to identify species with a risk of being unintentionally transported and introduced, and risk of establishing alien populations. Our invasion syndrome models showed high predictive accuracy with a good balance between specificity and generality. Unintentionally transported and introduced species tend to be common and thrive well in human-disturbed habitats. In contrast, those with established alien populations tend to be large-sized, are habitat generalists, thrive well in human-disturbed habitats, and have large native geographic ranges. We forecast that 160 amphibians and reptiles without known invasion history could be unintentionally transported and introduced in the future. Among them, 57 species have a high risk of establishing alien populations. Our reliable, reproducible, transferable, statistically robust and scientifically defensible quantitative invasion risk assessment tool is a significant new addition to the suite of decision-support tools needed for developing a future-proof preventative biosecurity globally.</p>","author":"Arman N. Pili, \nBoris Leroy, \nJohn G. Measey, \nJules E. Farquhar, \nAdam Toomes, \nPhillip Cassey, \nSebastian Chekunov, \nMatthias Grenié, \nDylan van Winkel, \nLisa Maria, \nMae Lowe L. Diesmos, \nArvin C. Diesmos, \nDamaris Zurell, \nFranck Courchamp, \nDavid G. Chapple","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"3052669bfe2f43483f9f15f29be6888bd8264cadf4186266aa26cba6869eb30c","category":"Environment"}