{"title":"Improvement in inpatient discharge planning for patients with alcohol use disorder with the implementation of a team-based multidisciplinary workflow","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306066","date":1719324000000,"content":"<p>by Parinaz Abiri, Il Seok Daniel Jeong, Amber Verdell, Shivani Shah, Rana Entabi, Hoanglong Nguyen</p>\r\nBackground <p>Alcohol use disorder (AUD) is a major economic and healthcare burden in the United States. While there is evidence-based medication-assisted treatment (MAT) for AUD, few physicians implement these therapies on a regular basis.</p> Objective <p>To determine the impact of a pharmacy-guided AUD discharge planning workflow on the rate of MAT prescriptions and inpatient readmissions.</p> Methods <p>This was a single-centered pre-and-post intervention study over a 6-month period, with a 90-day pre-intervention period and a 90-day post-intervention period. The study included all patients over the age of 18 years admitted to a medicine or surgery floor bed who presented with alcohol withdrawal at any point during their hospital course. The intervention involved a pharmacy workflow, in which a list of patients admitted with alcohol withdrawal was automatically generated and referred to pharmacists, who then provided recommendations to the primary physician regarding prescriptions for naltrexone, acamprosate, and/or gabapentin. The patients were then contacted within 30 days after discharge for post-hospitalization follow-up. Our outcome measures were change in prescription rate of MATs, change in total and alcohol-related 90-day readmission rates, and change in total and alcohol-related 90-day emergency department (ED) visit rates.</p> Results <p>The pre-intervention period consisted of 49 patients and the post-intervention period consisted of 41 patients. Our workflow demonstrated a 195% increase in the prescription rate of MATs at discharge (p &lt; 0.001), 61% reduction in 90-day total readmission rate (p &lt; 0.05), 40% reduction in 90-day total ED visit rate (p = 0.09), 92% reduction in 90-day alcohol-related readmission rate (p &lt; 0.05), and 88% reduction in 90-day alcohol-related ED visit rate (p &lt; 0.05).</p> Conclusions <p>Our intervention demonstrated that a pharmacy-based AUD discharge planning workflow has the potential to reduce inpatient readmissions and ED visits for patients with AUD, thus demonstrating improved patient outcomes with the potential to reduce healthcare costs.</p>","author":"Parinaz Abiri","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"30584b53bd718c600cda960e9023f5e1f1c0b1849800494f0c6a3b0996858700","category":"Interdisciplinary"}