{"title":"Twitch quickly reverses policy that “went too far” allowing nudity","link":"https://arstechnica.com/?p=1991225","date":1702669379000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1246869332-800x534.jpg\" alt=\"Twitch quickly reverses policy that “went too far” allowing nudity\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1246869332.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/in-this-photo-illustration-a-twitch-logo-seen-displayed-on-news-photo/1246869332\">SOPA Images / Contributor | LightRocket</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div>\n<p>Just two days after updating its policy to allow for more nudity, Twitch has announced that it's immediately \"rolling back the artistic nudity changes.\"</p>\n</div>\n<div>\n<p>\"Moving forward, depictions of real or fictional nudity won’t be allowed on Twitch, regardless of the medium,\" Twitch CEO Dan Clancy wrote in a <a href=\"https://safety.twitch.tv/s/article/Sexual-Content-Policy-Update?language=en_US\">blog post on Friday</a>.</p>\n</div>\n<div>\n<p>Clancy explained the decision to reverse course, writing that the policy was updated in response to user requests that Twitch \"allow the thriving artist community on Twitch to utilize the human form in their art.\"</p>\n</div>\n<div>\n<p>However, soon after the policy was changed, Clancy said that an unquantified number of streamers \"created content that was in violation of our new policy.\" Twitch also received complaints about other uploaded content \"that was allowed under the updated policy\" but sparked concerns that Twitch shared.</p>\n</div>\n<div>\n<p>\"Upon reflection, we have decided that we went too far with this change,\" Clancy wrote. \"Digital depictions of nudity present a unique challenge—AI can be used to create realistic images, and it can be hard to distinguish between digital art and photography.\"</p>\n</div>\n<div>\n<p>Clancy confirmed that there are currently no other changes to the sexual content policy recently announced that briefly allowed more nudity after years of banning mostly female-presenting streamers who were penalized for violating sexual content policies that Twitch now admits were too confusing.</p>\n</div>\n<div>\n<p>In one prominent example, just two days before the policy change, Twitch banned OnlyFans model Morgpie for posting \"topless\" streams. Although Morgpie's videos were shot to imply nudity, they \"never actually showed content that explicitly violated Twitch’s sexual content policies,\" TechCrunch<span> </span><a href=\"https://techcrunch.com/2023/12/13/twitchs-new-nudity-policy-allows-illustrated-nipples-but-not-human-underboob-sexual-content-update/\">reported</a>. To critics, Twitch's rationale for banning Morgpie remains unclear.</p>\n</div>\n<div>\n<p>In a<span> </span><a href=\"https://safety.twitch.tv/s/article/Updating-our-Approach-to-Sexual-Content-and-Content-Classification-Labels\">blog post on Wednesday</a>, Twitch Chief Customer Trust Officer Angela Hession wrote that Twitch \"received consistent feedback from streamers that our current policies around sexual content are confusing and that it can be difficult to know how their content will be interpreted based on these policies.\"</p>\n</div>\n<div>\n<p>Hession confirmed that Twitch's policy prohibiting \"content that ‘deliberately highlighted breasts, buttocks or pelvic region,’ even when fully clothed\" was confusing.</p>\n</div>\n<div>\n<p>\"Streamers found it difficult to determine what was prohibited and what was allowed and often evaluating whether or not a stream violated this portion of the policy was subjective,\" Hession wrote.</p>\n</div>\n<div>\n<p>Combined with another policy that restricted \"sexually suggestive\" content, Twitch's former policy was found to be \"overly punitive\" and \"resulted in female-presenting streamers being disproportionately penalized,\" Hession wrote.</p>\n</div>\n<div>\n<p>In an effort to eliminate confusion, Twitch announced that it had consolidated two separate policies that addressed sexual content under Twitch's community guidelines into one single<span> </span><a href=\"https://safety.twitch.tv/s/article/Community-Guidelines?language=en_US#20SexualContent\">sexual content policy</a>. That policy \"specifies the types of sexual content that are prohibited on Twitch\" and clarifies enforcement.</p>\n</div>\n<div>\n<p>Another key part of the policy overhaul, Twitch has also begun allowing some sexual content that was previously restricted, so long as appropriate Content Classification<span> </span><a href=\"https://safety.twitch.tv/s/article/Content-Classification-Guidelines?language=en_US\">Labels</a><span> </span>(CCLs) indicating sexual themes are applied.</p>\n</div>\n<div>\n<p>Now, labeled content is allowed that features \"body writing on female-presenting breasts and/or buttocks regardless of gender\" and \"erotic dances that involve disrobing or disrobing gestures, such as strip teases.\"</p>\n</div>\n<div>\n<p>These labels will ensure that content is not removed but also prevent mature content from being promoted on the homepage, Hession wrote, ensuring that no Twitch user ever encounters inappropriate content that they do not wish to see. The only exceptions will be made for streams labeled as including mature-rated games and profanity, which will still appear in the main feed on the homepage. Streams with sexual themes label will, however, still be recommended in the left bar of the homepage, where a thumbnail isn't displayed.</p>\n</div>\n<div>\n<p>\"We believe that accurate content labeling is key to helping viewers get the experience they expect, and now that we can enable appropriate labeling of sexual content using CCLs we believe that some of the restrictions in our former policies are no longer required,\" Hession wrote. \"In addition to providing clarity, these updates will also reduce the risk of inconsistent enforcement and bring our policy more in line with other social media services.\"</p>\n</div>\n<div>\n<p>Failing to label sexual content can result in penalties, like warnings, but not suspensions, Hession wrote. Twitch will automatically apply labels to sexual content missing labels, and any repeated failure to label content could result in a label \"temporarily locked onto the stream.\"</p>\n</div>\n<div>\n<p>In addition to real and fictional nudity, some other sexual content is still prohibited, including pornographic content, youth nudity, \"fictionalized sexual acts or masturbation,\" and \"simulated sexual activity or erotic roleplay with other players in online games.\" Uploading such prohibited content can result in content removals or account suspensions. A complete overview of what's still banned can be found<span> </span><a>here</a>.</p>\n</div>\n<div>\n<p>Clancy wrote that Twitch is now \"in the process of pushing out updates\" to its community guidelines that reflect the latest changes to the sexual content policy.</p>\n</div>\n<div>\n<p>\"While I wish we would have predicted this outcome, part of our job is to make adjustments that serve the community,\" Clancy wrote. \"I apologize for the confusion that this update has caused.\"</p>\n<p><em>This story was updated on December 15 to reflect changes to Twitch's policy.</em></p>\n</div>\n\n</div><p><a href=\"https://arstechnica.com/?p=1991225\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1991225&amp;comments=1\">Comments</a></p>","author":"Ashley Belanger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"30614dd5360523600b2698063056a2899467bbcde2472e45e4f54fc6668c6f79","category":"Tech"}