{"title":"Effect of telomere shortening on disease progression in patients with inflammatory bowel disease: A systematic review and meta-analysis protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311662","date":1729087200000,"content":"<p>by Yifan Zhang, Ze Ma, Liang Kang, Liu Yang</p>\r\nIntroduction <p>Inflammatory bowel disease (IBD) remains a major public health challenge worldwide. In recent years, it has been discovered that a link between telomere shortening and disease progression in IBD patients has been present. However, there is controversy as to whether telomere shortening precipitates disease progression or disease progression causes telomere shortening. There is also a shortage of systematic reviews and data synthesis to explain the association between telomere shortening and disease progression in individuals with IBD. We aimed to systematically review the association between telomere shortening and disease advancement in individuals with IBD to inform future studies.</p> Methods and analysis <p>We will undertake a thorough search of the electronic database from the beginning until December 31, 2023. We will search the databases: MEDLINE/PubMed, Embase, Web of Science, China National Knowledge Infrastructure (CNKI), VIP, Wanfang Database (Wanfang), CMB, Cochrane Library, Cochran Clinical Trials Registry, and the World Health Organization International Clinical Trials Registry Platform. Two reviewers will assess the discovered citations for eligibility based on the title and abstract before proceeding to the full-text and data extraction phases. These reviewers will debate and settle any conflicts that arise during the inclusion process; a third reviewer will settle any issues that remain. The validated data extraction form will be used to collect data for eligible research. The included studies will undergo a quality and bias check and will proceed meta-analysis.</p> Discussion <p>This systematic review and meta-analysis will reveal a positive correlation between illness progression and telomere shortening in individuals with IBD, perhaps demonstrating three causal links between them. This study will conduct the first systematic review and meta-analysis examining the correlation between telomere shortening and illness advancement in individuals with IBD. Exploring the connection between these two situations can enhance the comprehension of the development and advancement of IBD.</p> Systematic review registration <p>PROSPERO registration number: CRD42024501171.</p>","author":"Yifan Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"306219a213a5324e1a7cb5b593df10a0e0523da6755bd96bf78e2aede26b0fa6","category":"Interdisciplinary"}