{"title":"The top 5 cobbled climbs in Flanders","link":"https://www.cyclist.co.uk/in-depth/10188/best-cobbled-climbs-flanders","date":1634137360000,"content":"<span>\n      <span><a href=\"/authors/joe-robinson\">Joe Robinson</a></span>\n  </span><div>  \n  <div>      <div><span>18 Oct 2021</span></div>    </div></div><p>\nCyclist's guide to the five best cobbled bergs in Flanders </p>\n<div>\n      <p> The Flanders region of Belgium is a true heartland in the sport of cycling thanks to its mythical cobbled climbs. Dotted around a region known as the Flemish Ardennes, these are short and steep, and they provide the backdrop for some of the most exciting races in the cycling calendar including the <a href=\"https://www.cyclist.co.uk/tags/tour-of-flanders\">Tour of Flanders</a>, Omloop Het Nieuwsblad and Gent-Wevelgem.</p>\n<p>There are those that are household names such as the <a href=\"https://www.cyclist.co.uk/in-depth/6149/classic-climbs-koppenberg\">Koppenberg</a> and <a href=\"https://www.cyclist.co.uk/in-depth/7786/classic-climb-muur-van-geraardsbergen\">Muur van Geraardsbergen</a>, made infamous by the legendary battles that have taken place on their slopes. And then there are those that are slightly less well known, yet in no way easier, such as Ten Bosse and the Boigneberg, </p>\n<p>There are so many great climbs to choose from, but <em>Cyclist</em> has done the hard work for you. Watch the video for a run-down of our top five or read on below for a summary.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2022: Everything you need to know</a></div>      <div><a href=\"/tour-de-france/10192/tour-de-france-femmes-route-live-tv-guide-startlist-stage-by-stage\">Tour de France Femmes 2022: Everything you need to know </a></div>      <div><a href=\"/in-depth/10203/tour-de-france-femmes-2022-analysis\">The 2022 Tour de France Femmes: A week of brutal climbs and gravel beckons</a></div>      <div><a href=\"/news/10190/tour-de-france-femmes-route-revealed\">2022 Tour de France Femmes route revealed: 1,029km of racing from Paris to Belles-Filles</a></div>      <div><a href=\"/in-depth/79/marcel-kittel-interview\">Marcel Kittel interview</a></div>    </div></div><p>\nTo reach our final selection, our criteria focused on the climb's importance in the world of cycling, how hard it is, how scenic it is and whether it's enjoyable to ride (if climbing can ever be considered 'enjoyable').</p>\n<p>Obviously, we fully expect you'll wholeheartedly disagree with our selection. With that in mind, we want you to leave a comment under our video with the climbs you would have liked to see included.</p>\n<p>If you fancy not only taking on these five climbs but 59 of the best climbs Flanders has to offer, you should consider the <a href=\"https://www.cyclinginflanders.cc/flandrien-challenge#!\" target=\"_blank\">Flandrien Challenge</a> – 59 climbs, 72 hours and if it's not on Strava, it didn't happen. This is genuinely one of the toughest yet rewarding cycling challenges out there. </p>\n<h2>The top five cobbles climbs in Flanders</h2>\n<h2>1. Koppenberg (0.69km. Average gradient: 11.1%. Max gradient: 21%)</h2>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2019/04/classic_climbs_koppenberg_04.jpg\" />  </div>\n</div>\n<p>The Catalina Wine Mixer of Flemish cobbled climbs, the Koppenberg stands alone for sheer brutality of cobblestones and toughness of gradient.</p>\n<p>Although too far from the finish line to ever impact the result at the Tour of Flanders, its 21% maximum gradient coupled with its irregular cobbles have made the Koppenberg the most feared climb in the region.</p>\n<p><strong>Climbing tip:</strong> Stay seated! As soon as your stand up, you're guaranteed to lose traction on your back wheel which will result in your putting a foot down. </p>\n<p><em>For more on this Flemish legend, read <a href=\"https://www.cyclist.co.uk/in-depth/6149/classic-climbs-koppenberg\" target=\"_blank\">Henry Catchpole's Classic Climb feature on the Koppenberg</a>.</em></p>\n<h2>2. Muur van Geraardsbergen (0.91km, Average gradient: 6.8%. Max gradient: 20.2%)</h2>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/02/muur_classic_climb_12.jpg\" />  </div>\n</div>\n<p>The Muur van Geraardsbergen/Kapelmuur/Muur is a place of pilgramage for cycling fans from around the world. With its chapel at the summit, this climb provided the theatre where countless Tours of Flanders were decided throughout the 1970s, 1980s, 1990s and 2000s.</p>\n<p>Now positioned 95km from the finish of Flanders, it's no longer decisive in the race, but it's no less important to the cycling culture in the region.</p>\n<p><strong>Climbing tip: </strong>Whisper it but the Muur's bark is worse than its bite. Once you pass the café, you can afford to open the taps and go full gas to the summit!</p>\n<p><em>For more Muur, read <a href=\"https://www.cyclist.co.uk/in-depth/7786/classic-climb-muur-van-geraardsbergen\" target=\"_blank\">Henry Catchpole's Classic Climb feature on the Muur van Geraardsbergen</a>.</em></p>\n<h2>3. Paterberg (0.35km. Average gradient: 11.7%. Max gradient: 20.3%)</h2>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/10/dji_0228.jpg\" />  </div>\n</div>\n<p>The final climb in the Tour of Flanders men's and women's races, the Paterberg is short at 350m but is often the straw that breaks the camel's back after a long day in the saddle. </p>\n<p>With fresh legs, the Paterberg is eminently doable for almost all amateurs if you manage your effort over the steep pitch that comes after 200m. </p>\n<p><strong>Climbing tip: </strong>While the pros can do it, chances are you will not have the skill to ride in the Paterberg's narrow gutter. You're probably best sticking to the crown of the road.</p>\n<h2>4. Kemmelberg Ossuaire/Belvedère (0.73km/0.55km. Average gradient: 9.6%/9.2%. Max gradient: 23%/20%)</h2>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/10/dsc07937.jpg\" />  </div>\n</div>\n<p>Two for the price of one, the Kemmelberg can be climbed from both ends: Oussaire and Belvedère. Both break the 20% gradient barrier and both average 9%. Both sides are reguarly used as the centrepiece for the Gent-Wevelgem semi-classic and provide final launchpads for rouleurs and classics specialists hoping to drop sprinters.</p>\n<p>Situated in West Flanders, it is also worth noting that the Kemmelberg is some distance from the rest of Flanders' classic cobbled climbs.</p>\n<p><strong>Climbing tip: </strong>The Oussaire side is harder than the Belvedère side so we advise tackling it first, to get it out of the way.</p>\n<h2>5. Taaienberg (0.53km. Average gradient: 6.3%. Max gradient: 14.8%)</h2>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/10/screenshot_2021-10-18_at_12.38.02.png\" />  </div>\n</div>\n<p>Tom Boonen used an attack on Taaienberg to win four of his five E3 Harelbeke titles which has led to the climb affectionately being known as the 'Boonenberg'. The three-time Tour of Flanders winner also often used this same climb to launch his first attacks at the Monument race too.</p>\n<p>We love Tommekke, so we love this climb too.</p>\n<p><strong>Climbing tip: </strong>The Taaienberg flattens out towards the summit which allows you to click back into the big ring and up the pace – if you've got the legs. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/destinations\">Destinations</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"306318fda572ed2ff90b01fb018cb0fe560ea262bcce0c609aac7bfa22b0f8e0","category":"Cycling"}