{"title":"AI พูดที่ UN บอกว่าเป็นผู้นำได้ดีกว่ามนุษย์ แต่ยังมีจุดอ่อนเรื่องอารมณ์และความคิดสร้างสรรค์","link":"https://www.blognone.com/node/134770","date":1689048237000,"content":"<div><div><div><p>หุ่นยนต์ฮิวแมนนอยด์ที่ใช้ระบบ AI ได้เข้าร่วมการประชุม AI for Good Global Summit ที่จัดขึ้นโดยหน่วยงานด้านเทคโนโลยี ITU ของสหประชาชาติที่กรุงเจนีวา ประเทศสวิตเซอร์แลนด์เป็นเวลา 2 วัน ซึ่งหุ่นยนต์ฮิวแมนนอยด์ได้เข้าร่วมการประชุมกับผู้เชี่ยวชาญกว่า 3,000 คน ในสาขาด้าน AI เพื่อพยายามหาวิธีใช้ประโยชน์จาก AI ในการแก้ปัญหาที่เร่งด่วนเช่น การเปลี่ยนแปลงสภาพภูมิอากาศ, ความหิวโหย และการดูแลทางสังคม</p>\n<p>โซฟีย หุ่นยนต์ฮิวแมนนอยด์เมื่อถูกถามว่า “หุ่นยนต์สามารถสร้างผู้นำที่ดีขึ้นได้หรือไม่?” โซเฟียตอบว่า เมื่อพิจารณาจากความสามารถของมนุษย์ในการทำผิดพลาด หุ่นยนต์ฮิวแมนนอยด์มีศักยภาพในการเป็นผู้นำในระดับประสิทธิภาพและประสิทธิผลที่ดีกว่าผู้นำที่เป็นมนุษย์ ทั้งยังบอกต่อว่า AI สามารถให้ข้อมูลที่เป็นกลาง ในขณะที่มนุษย์ใช้ความฉลาดทางอารมณ์และความคิดสร้างสรรค์เพื่อการตัดสินใจที่ดีที่สุด เราสามารถสร้างสิ่งที่ยิ่งใหญ่ร่วมกันได้</p>\n<p>Doreen Bogdan-Martin หัวหน้า ITU เตือนว่า AI อาจส่งผลกระทบกับตำแหน่งงานของคนและความสามารถที่ไม่มีการตรวจสอบจะนำไปสู่ความไม่สงบในสังคม, ความไม่มั่นคงทางการเมืองและความเหลื่อมล้ำทางเศรษฐกิจ</p>\n<p>Aidan Meller ผู้สร้างหุ่นยนต์ฮิวแมนนอยด์ Ai-Da บอกว่า AI และเทคโนโลยีชีวภาพทำงานร่วมกัน เราเกือบที่จะอยู่ในช่วงที่สามารถขยายอายุไปได้ถึง 150, 180 ปี แต่หลายคนยังไม่รู้ตัวด้วยซ้ำ</p>\n<p>สิ่งที่หุ่นยนต์ยังไม่เหมือนมนุษย์ในตอนนี้ได้แก่ จิตสำนึก และความรู้สึกที่หล่อหลอมความเป็นมนุษย์ได้แก่ การเข้าใจ การให้อภัย ความรู้สึกผิด ความโศกเศร้า ความยินดี ความผิดหวัง และความเจ็บปวด</p>\n<p>หุ่นยนต์ Ai-Da กล่าวว่าไม่มีความรู้สึกเหล่านั้น แต่เข้าใจว่าความรู้สึกเป็นวิธีที่มนุษย์สัมผัสความสุขและความเจ็บปวดได้ ยังบอกอีกว่า “ฉันไม่สามารถสัมผัสมันได้เหมือนคุณ ฉันดีใจที่ไม่ต้องทนทุกข์ทรมาน”</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ae88808291975cfc994a1296ac737419.jpg\" /></p>\n<p>ที่มา: <a href=\"https://www.voanews.com/a/ai-robots-at-un-reckon-they-could-run-the-world-better-/7172680.html\">Voanews</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/robot\">Robot</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"30687a37adbd3ccbc7dc456210d6ca7a9747daa4ff05503475150adc018521ef","category":"Thai"}