{"title":"Complex insoluble dietary fiber alleviates obesity and liver steatosis, and modulates the gut microbiota in C57BL/6J mice fed a high‐fat diet","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13380?af=R","date":1709036130000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Obesity has been demonstrated as a risk factor that seriously affects health. Insoluble dietary fiber (IDF), as a major component of dietary fiber, has positive effects on obesity, inflammation and diabetes.</p>\n<h2>RESULTS</h2>\n<p>In this study, complex IDF was prepared using 50% enoki mushroom IDF, 40% carrot IDF, and 10% oat IDF. The effects and potential mechanism of complex IDF on obesity were investigated in C57BL/6 mice fed a high-fat diet. The results showed that feeding diets containing 5% complex IDF for 8 weeks significantly reduced mouse body weight, epididymal lipid index, and ectopic fat deposition, and improved mouse liver lipotoxicity (reduced serum levels of alanine aminotransferase, aspartate aminotransferase, and alkaline phosphatase), fatty liver, and short-chain fatty acid composition. High-throughput sequencing of 16S rRNA and analysis of fecal metabolomics showed that the intervention with complex IDF reversed the high-fat-diet-induced dysbiosis of gut microbiota, which is associated with obesity and intestinal inflammation, and affected metabolic pathways, such as primary bile acid biosynthesis, related to fat digestion and absorption.</p>\n<h2>CONCLUSION</h2>\n<p>Composite IDF intervention can effectively inhibit high-fat-diet-induced obesity and related symptoms and affect the gut microbiota and related metabolic pathways in obesity. Complex IDF has potential value in the prevention of obesity and metabolic syndrome. © 2024 Society of Chemical Industry.</p>","author":"Zurui Liu, \nJuan Dai, \nRuijia Liu, \nZiyi Shen, \nAi Huang, \nYuKun Huang, \nLijun Wang, \nPengfei Chen, \nZheng Zhou, \nHang Xiao, \nXianggui Chen, \nXiao Yang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"306906f7e86a652033fb68e32d685d618b79a5c0f895de8645be5ec241fb64f2","category":"Environment"}