{"title":"France OKs iPhone 12 update to lower radiation levels, but not in French-controlled territories","link":"https://www.macworld.com/article/2087307/iphone-12-update-france-radiation-levels.html","date":1698347940000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p><em><strong>Editor’s note:</strong> Updated on 10/26/23 with information about the ban not being lifted in French territories.</em> <em>This article originally posted on 9/26/23.</em></p>\n\n\n\n<p>Customers in France who exclaimed, <em>“Sacré bleu!</em>” when they heard that Apple would not be allowed to sell the iPhone 12 in the country due to radiation levels can now sigh in relief. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reuters.com/technology/french-authorities-approve-apples-software-update-its-iphone-12-2023-09-29/&amp;xcust=1-1-2087307-1-0-0&amp;sref=https://www.macworld.com/feed\">France has lifted the embargo</a> in the mainland after approving a software update issued by Apple, according to Reuters. The ban, however, remains in French territories.</p>\n\n\n\n<p>Earlier this month, the Agence Nationale des Fréquence (ANFR) claimed that the <a href=\"https://www.macworld.com/article/2067698/france-stop-selling-iphone-12-radio-frequency-radiation.html\">iPhone 12 emitted too much radio frequency radiation</a>, based on the agency’s tests. The ANFR ordered Apple to stop selling the phone and even went so far as to send its agents to Apple Stores to make sure they were no longer on the shelves.</p>\n\n\n\n<p>Apple disputed the test results, citing certified compliance by multiple international bodies as well as third-party lab results. The actual legal limit of radio frequency radiation emissions is much lower than what scientists believe is dangerous, so users are safe. The ANFR’s test differs from other regulatory organizations, and the group has pulled 42 devices from the market, with the iPhone 12 being the first iPhone to be pulled.</p>\n\n\n\n<p>Apple developed a software fix to address the ANFR’s concerns. “This is related to a specific testing protocol used by French regulators and not a safety concern,” the company said in a statement to Reuters. Other countries in the European Union cited interest in Apple distributing the update throughout the EU, despite the fact that the iPhone 12 had passed regulations in those countries. It is unclear if Apple plans to release the update beyond France.</p>\n\n\n\n<p>The French territories that have not lifted the ban are Guadeloupe, Guyana, Martinique, Mayotte, Reunion, and Saint-Martin. Other French territories have legal considerations that affect whether the iPhone 12 is banned or not, according to an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.anfr.fr/liste-actualites/actualite/reprise-de-la-commercialisation-de-liphone-12-en-france-metropolitaine-a-la-suite-dun-depassement-de-la-valeur-limite-reglementaire-de-debit-dabsorption-specifique-das&amp;xcust=1-1-2087307-1-0-0&amp;sref=https://www.macworld.com/feed\">ANFR press release</a>.</p>\n\n\n\n<p>The iPhone 12 is a three-year-old phone and was taken off the market worldwide when Apple unveiled the iPhone 15 lineup on September 12. The only way to get an iPhone 12 from Apple is through the Certified Refurbished store online, or through third-party retailers.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"306f65eba4d1ca8971afd331bc17a842853bfc6585ee0a15e044567149990569","category":"Apple"}