{"title":"The Youngest and Oldest Riders at the Tour de France","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-youngest-and-oldest-riders-at-the-tour-de-france","date":1624961173000,"content":"\n      <p>It was 1904 when Henri Cornet won the Tour de France aged just 19. Since then, the ages of winners have seemed to converge on a median age of around 28. But, things seem to have been changing...</p>\n<p>With young winners like <a href=\"https://www.rouleur.cc/es/blogs/the-rouleur-journal/tadej-tommorow-always\">Tadej Pogacar</a> and Egan Bernal, you could be excused for seeing a trend for a newer, younger Tour de France.</p>\n<p>Yet, older riders have also been faring well at the Grand Boucle in recent years. So what does the real breakdown of riders by age look like? How young is too young, and how old is too old?</p>\n<div></div>\n<h4><b>Oldest Riders at the 2021 Tour de France</b></h4>\n<p><span>You can never have too much experience, right?</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b><i></i></b></a><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1271953160-min_1024x1024.jpg?v=1624875357\" />Image credit: Benoit Tessier - Pool/Getty Images</span></i></p>\n<p><span></span><span>One rider that would certainly agree with that statement is Alejandro Valverde. The Movistar man started his fourteenth Tour de France at 41 years old this year. And the end is not in sight for Valverde, yet. Valverde has supposedly flirted with the idea of retirement for a few years, but has opened the door to continuing into the 2022 season.</span></p>\n<p><span>Speaking to </span><a href=\"https://www.eurosport.es/ciclismo/alejandro-valverde-continuidad-el-larguero-entrevista-retirada_sto8390003/story.shtml\" target=\"_blank\"><span>Eurosport</span></a><span>, Valverde said, “I don’t know if this will be my last Tour, </span><span>but I am more clear that I think that it will not be my last season.</span><span>” We can enjoy ‘Bala’ in the peloton for a little while longer, still.<br /></span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b><i>Tour de France 2021 Guide</i></b></a></p>\n<p><span>Valverde could become the oldest rider to wins a stage at the Tour de France this year. The oldest ever Tour de France stage winner was Pino Cerami, who won stage 9 of the 1963 Tour de France aged 41 years and 65 days. On stage three of the 2021 edition, Valverde will be the exact age that Cerami was when he won in Pau in 1963. So if he win a stage in the remainder of the race, he'll go down in the record books as the oldest rider to even win a stage at the Tour.</span></p>\n<p><span>Philippe Gilbert, Andre Greipel and Cyril Lemoine and the only other riders that started the Tour de France aged 38 or more. However, Lemoine has already been forced to abandon after he was caught up in a crash on stage one. </span></p>\n<ol>\n<li>\n<p><span>Alejandro Valverde - 41 years and 62 days</span></p>\n</li>\n<li>\n<p><span>Philippe Gilbert - 38 years and 357 days</span></p>\n</li>\n<li>\n<p><span>André Greipel - 38 years and 346 days</span></p>\n</li>\n<li>\n<p><span>Cyril Lemoine - 38 years and 116 days</span></p>\n</li>\n<li>\n<p><span>Dries Devenyns - 37 years and 340 days</span></p>\n</li>\n</ol>\n<h4><b>Youngest Riders at the 2021 Tour de France</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032908-006_1600x_bae0da0e-f069-4135-87f7-e4135de25d6e_1024x1024.jpg?v=1624875303\" />Image credit: Alex Whitehead / CorVos / SWPix</span></i></p>\n<p><span>Starting the Tour aged just 22 years and 14 days, the youngest rider at the 2021 Tour is Bahrain Victorious' Fred Wright. This isn’t Wright’s first Grand Tour, however. He entered La Vuelta <span>España </span>last season and wasn’t anonymous. </span></p>\n<p><span>Wright sprinted to fourth place on stage 15, which required climbing skills early in the stage to stay at the front of the race, as well as a strong punch at the end of the stage. His performance that day sums up Wright’s skillset well. He is a quick finisher who can climb capably. In his first Tour de France, Wright is more likely to act as a domestique throughout, either helping his GC leaders or assisting Sonny Colbrelli in the sprint finishes. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/this-is-a-really-cool-job-bahrain-victorious-fred-wright-on-his-first-grand-tour\"><b><i>Related - ”This is a Really Cool Job” Bahrain Victorious’ Fred Wright on his first Grand Tour</i></b></a></p>\n<p><span>Maxime Chevalier of B&amp;B Hotels is only one month Wright’s senior and is the second youngest rider at the Tour this year. This is the Frenchman’s second Tour de France after he made his debut last season. Chevalier, who joined the breakaway on stage three, could be a GC rider of the future and is a talented climber.</span></p>\n<p><span>UAE Team Emirates have two of the five youngest riders at the race this year. One is the superb time-trialist Mikkel Bjerg, and the other is some guy called Tadej Pogačar — heard of him?</span></p>\n<p><span>Other notable youngsters at the 2021 Tour are Marc Hirschi, Brandon McNulty and the current leader of the king of the mountain’s classification, Ide Schelling, who are all under the age of 24.</span></p>\n<ol>\n<li><span>Fred Wright - 22 years and 14 days</span></li>\n<li><span>Maxime Chevalier - 22 years and 42 days</span></li>\n<li><span>Mark Donovan - 22 years and 85 days</span></li>\n<li><span>Mikkel Bjerg - 22 years and 236 days</span></li>\n<li><span>Tadej Pogačar - 22 years and 279 days</span></li>\n</ol>\n<p><span>The youngest ever stage winner at the Tour de France was Fabio Battesini, who was just 19 years and 134 days old when he won a stage at the 1931 Tour de France.</span></p>\n<p><i><span>Cover image: </span></i><i><span>A.S.O./Pauline Ballet</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"30774517e5ba5ade4d293e0b662f9c921e7fa6e90087cee4acc6097a3d0e6721","category":"Cycling"}