{"title":"Exploring the Potential of Using High-Performance Rubberized Concrete in Column Jacketing","link":"https://www.preprints.org/manuscript/202405.1760/v1","date":1716870699000,"content":"In recent years, extensive research has focused on investigating rubberized concrete as a structural material due to its enhanced properties, including increased ductility, improved energy dissipation, and higher damping ratios. Additionally, rubberized concrete contributes to sustainable development by recycling non-biodegradable waste and reducing the use of natural aggregates in concrete mixtures. However, its performance in retrofitting existing structures remains unclear and requires thorough investigation before it can be widely implemented in construction activities. The main objective of this research is to evaluate the seismic performance of reinforced concrete buildings strengthened with rubberized concrete jackets under severe earthquake excitations. To achieve this, laboratory tests were conducted to assess the properties of high-performance, self-compacting rubberized concrete mixes with various rubber content levels. Additionally, finite element models of reinforced concrete retrofitted with these mixes were analyzed using nonlinear response history analysis to compare their performance against control models. The results of this experimental work indicate a significant reduction in the mechanical properties of rubberized concrete. However, there is a considerable improvement in the damping ratio, which enhances the energy dissipation capacity of the structures. This improvement contributes to an increase in damping energy and a reduction in hysteretic energy, suggesting that rubberized concrete jackets can enhance the seismic resilience of reinforced concrete buildings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3092633335e9ff07dee0af0b056355b4cd3c9b3117d8addab55cbf07395f6e90","category":"Interdisciplinary"}