{"title":"Participant perspectives on incentives for TB preventative therapy adherence and reduced alcohol use: A qualitative study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002472","date":1713967200000,"content":"<p>by Ayesha Appa, Amanda P. Miller, Robin Fatch, Allen Kekibiina, Brian Beesiga, Julian Adong, Nneka Emenyonu, Kara Marson, Monica Getahun, Moses Kamya, Winnie Muyindike, Michael McDonell, Harsha Thirumurthy, Judith A. Hahn, Gabriel Chamie, Carol S. Camlin</p>\r\n\r\nEconomic incentives to promote health behavior change are highly efficacious for substance use disorders as well as increased medication adherence. Knowledge about participants’ experiences with and perceptions of incentives is needed to understand their mechanisms of action and optimize future incentive-based interventions. The Drinkers’ Intervention to Prevent Tuberculosis (DIPT) trial enrolled people with HIV (PWH) in Uganda with latent tuberculosis and unhealthy alcohol use in a 2x2 factorial trial that incentivized recent alcohol abstinence and isoniazid (INH) adherence on monthly urine testing while on INH preventive therapy. We interviewed 32 DIPT study participants across trial arms to explore their perspectives on this intervention. Participants described 1) satisfaction with incentives of sufficient size that allowed them to purchase items that improved their quality of life, 2) multiple ways in which incentives were motivating, from gamification of “winning” through support of pre-existing desire to improve health to suggesting variable effects of extrinsic and intrinsic motivation, and 3) finding value in learning results of increased clinical monitoring. To build effective incentive programs to support both reduced substance use and increased antimicrobial adherence, we recommend carefully selecting incentive magnitude as well as harnessing both intrinsic motivation to improve health and extrinsic reward of target behavior. In addition to these participant-described strengths, incorporating results of clinical monitoring related to the incentive program that provide participants more information about their health may also contribute to health-related empowerment.","author":"Ayesha Appa","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"30967782f532b894e2cff90782b9e7c82987d91055d71c2c8ab3c48e908315f3","category":"Environment"}