{"title":"There might be a very long wait until the next new Mac arrives","link":"https://www.macworld.com/article/1966309/imac-macbook-air-pro-mac-mini-m3-2024.html","date":1688040100000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>June was a very good month for the Mac. Not only did we get to see the <a href=\"https://www.macworld.com/article/1670742/macos-14-release-date-features-compatibility-beta.html\">next version of macOS in Sonoma</a>, but we also got a new <a href=\"https://www.macworld.com/article/1948603/15-inch-macbook-air-m2-review.html\">15-inch MacBook Air that’ll be a hit</a>, a <a href=\"https://www.macworld.com/article/1948425/mac-studio-m2-max-review.html\">Mac Studio update</a>, the M2 Ultra chip, and to top it all off, we finally got a <a href=\"https://www.macworld.com/article/347010/new-mac-pro-2023.html\">new Apple silicon Mac Pro</a>.</p>\n\n\n\n<p>That’s a whole lot of Mac goodness, which is great because they might need to hold us over for a while. Based on projected chip production schedules and the current state of the Mac lineup, it’s very possible that the only Mac news we’re going to get between now and the first few months of 2024 is the release of macOS Sonoma.</p>\n\n\n\n<p>That means no more Mac hardware, likely for the next six to eight months and possible even longer. But there’s a lot to look forward to, a change that could start another great wave of Mac releases.</p>\n\n\n\n<h2>The M3 cometh</h2>\n\n\n\n<p>Apple’s Ultra chip in its M-series is the company’s top-of-the-line processor, and the latest Ultra was just released as the M2 Ultra in the Mac Studio and Mac Pro. The <a href=\"https://www.macworld.com/article/783678/m2-vs-m1-chip-performance-graphics-ram.html\">M2</a> lineup is now set as Apple isn’t expected to release an M2 chip better than the Ultra.</p>\n\n\n\n<p>The next generation of M-series chips starts with the M3, and reports have said that the <a href=\"https://www.macworld.com/article/1801647/apple-silicon-transition-mac-mini-pro-studio-imac.html#:~:text=VIEW%20DEAL-,Waiting%20for%20M3,-Rumor%20has%20it\">M3 could have a big impact on the Mac</a>. The M3 will be made using the 3-nanometer manufacturing process, which is a change from the current enhanced 5nm process used with the M2 series and the standard 5nm process in the <a href=\"https://www.macworld.com/article/676321/m1-pro-max-ultra-guide.html\">M1</a>. The 3nm process allows for a higher transistor density in the chip and that means a boost in performance and efficiency.</p>\n\n\n\n<p>In 2020, we were all blown away by the speed increases that we saw when Apple first released the M1 in the <a href=\"https://www.macworld.com/article/234819/macbook-air-m1-review-an-absolutely-stunning-debut-for-apple-silicon-in-a-mac.html\">13-inch MacBook Air</a>, <a href=\"https://www.macworld.com/article/234838/13-inch-macbook-pro-m1-review-amazing-breakthroughs-in-processing-and-battery-performance.html\">13-inch MacBook Pro</a>, and <a href=\"https://www.macworld.com/article/234842/m1-mac-mini-review-the-mac-with-the-best-ever-bang-for-your-buck.html\">Mac mini</a>. In some benchmarks, we saw improvements between 50 and 90 percent over the Intel processors they replaced. And on the laptops, the battery life improved not just by several minutes, but by several hours.</p>\n\n\n\n<p>We almost certainly won’t see performance boosts that are as big as they were in 2020, but they could be more than the 25 percent we often see in generational turns. It can also mean better power efficiency, which means even better battery life.</p>\n\n\n\n<h2>How long do we have to wait?</h2>\n\n\n\n<p>TSMC, the company that manufactures Apple’s chips, reportedly was <a href=\"https://www.macworld.com/article/1807369/m3-processor-mac-ipad-pro-2024-release.html\">unable to meet Apple’s production demands for the M3</a> and won’t be able to provide it until 2024. Production priority goes to the <a href=\"https://www.macworld.com/article/1532925/a17-bionic-preview-benchmarks-cpu-gpu-ram.html\">A17 Bionic</a>, which is rumored to be Apple’s very first 3nm chip and will be used in the <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15 Pro</a> this fall. With that in mind, plus some <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-06-25/apple-2023-and-2024-road-map-iphone-15-m3-macs-ipad-air-vision-pro-headset-ljbftjwx&amp;xcust=1-1-1966309-1-0-0&amp;sref=https://www.macworld.com/feed\">recent reporting by Bloomberg’s Mark Gurman</a>, we can figure out when Apple will release the M3 series of Macs.</p>\n\n\n<div><figure><img src=\"https://images.techadvisor.com/cmsdata/features/3675946/apple_imac_m1_24inch_10.jpg?quality=50&amp;strip=all\" alt=\"iMac\" loading=\"lazy\" /><figcaption><p>The 24-inch iMac is more than two years old but it’s not expected to get an update until the M3 processor arrives.</p></figcaption></figure><p>Dominik Tomaszewski / Foundry</p></div>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/347534/24-inch-imac-review-apple-design-display-colors-storage-upgradability-price.html\">current iMac</a> is one of two Macs that still have the M1, and it will be nearly three years old by the first quarter of 2024. It’s overdue for an update. According to Gurman, Apple is <a href=\"https://www.macworld.com/article/1966933/imac-larger-than-30-inches-development-launch-specs.html\">planning to do more than just update the iMac with an M3</a>. Apple is working on an iMac with a screen larger than 30 inches–other specs for this machine aren’t provided. If Apple updates the 24-inch iMac with an M3, the company could use an M3 Pro in the larger model and call it the new iMac Pro. Gurman says Apple will update the iMac lineup in late 2023 or early 2024 with an M3 chip, thus making it the only Mac to skip the M2 entirely.</p>\n\n\n\n<p>The MacBook Air could get updated in early 2024, as well. The <a href=\"https://www.macworld.com/article/807892/m2-macbook-air-review.html\">13-inch model</a> will be nearly two years old by then, and while the 15-inch model was just released, it’s not unheard of for Apple to upgrade a Mac less than a year after its launch. Apple will want to put its marketing emphasis on the extended battery life of the M3. Apple also currently offers a $999 M1 MacBook Air, but since it fills the role as the sub-$1,000 model in the Mac lineup it’ll either remain or be replaced with the M2 model, which currently costs $1,099.</p>\n\n\n\n<p>Then there’s the 13-inch MacBook Pro. We assumed it would go away now that the 15-inch MacBook Pro is here, but Gurman reports that Apple has an M3 upgrade in the works. If Apple does decide to go through with this laptop, it will likely ship at the same this as the M3 MacBook Air.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-MacMini-M2-2023_review_5.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple MacMini M2 2023 on desk\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-MacMini-M2-2023_review_5.jpg?quality=50&amp;strip=all 2000w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-MacMini-M2-2023_review_5.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-MacMini-M2-2023_review_5.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-MacMini-M2-2023_review_5.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-MacMini-M2-2023_review_5.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-MacMini-M2-2023_review_5.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-MacMini-M2-2023_review_5.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>The Mac mini only recently got its M2 update, so it’s unlikely to get another refresh until 2024 at the earliest.</p></figcaption></figure><p>Dominik Tomaszewski / Foundry</p></div>\n\n\n\n<p>When it comes to figuring out what Apple will do with its remaining M2 Macs, a little more guesswork is involved, especially with the <a href=\"https://www.macworld.com/article/1478350/m1-vs-m2-mac-mini-design-processor-ports-connectivity.html\">M2 Mac mini</a>, which was released last year. It would seem appropriate to upgrade it to the M3 in the early part of 2024, but then there’s the <a href=\"https://www.macworld.com/article/1480091/mac-mini-m2-pro-review.html\">M2 Pro Mac mini</a> that Apple released this past January. An M3 Pro won’t be ready until the second half of 2024, so Apple could wait to upgrade both Mac mini models until then–desktop Macs don’t sell as much as laptops do, so Apple would be fine with holding off the M2 Mac mini upgrade. Gurman doesn’t mention the Mac mini in his most recent newsletter, which could indicate that it won’t be updated soon.</p>\n\n\n\n<p>After the M3 is introduced, we’ll fall into the upgrade cycle again, with M3 Pro/Max updates to the 14- and 16-inch MacBook Pro following in the second half of 2024. Perhaps the Mac Studio update to the M3 Max and Ultra and an M3 Ultra Mac Pro update won’t happen until early 2025. </p>\n\n\n\n<p>Whatever Apple does, we’re in for a lull before another wave of Mac developments. So if you’re sitting there in the latter part of this year, toddling around with macOS Sonoma and wondering what’s the deal with Mac hardware, just remember that good times are ahead.</p>\n\nMac, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"309ac05e48a5819dbe6b9f320310d50d6d7ba580b90b6ac1d69d67f92d83dd79","category":"Apple"}