{"title":"Multilevel predictors of anaemia among pregnant women in Ghana: New evidence from the 2019 Ghana Malaria Indicator Survey","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003673","date":1725544800000,"content":"<p>by Desmond Klu, Frank Kyei-Arthur, Margaret Appiah, Michael Larbi Odame</p>\r\n\r\nAnaemia in pregnant women is a major public health concern. A number of multilevel factors have been attributed as contributors to anaemia in pregnancy. The purpose of this study was to examine the multilevel factors predicting anaemia among pregnant women in Ghana. Data for this study were obtained from the 2019 Ghana Malaria Indicator Survey (GMIS) conducted between September 25 and November 24, 2019 in all regions in Ghana. The weighted sample comprised 353 pregnant women aged 15–49 years. Data were analysed with SPSS version 25 using descriptive statistics, Pearson’s chi-square test and binary logistic regression modelling. In this study, the outcome variable was anaemia status among pregnant women, while the predictor variables included individual, household, community, and health system level factors. The overall prevalence of anaemia among pregnant women was 28.7%. Of these, 14.5% had mild anaemia, and 13.2% and 1.1% had moderate and severe anaemia, respectively. The results indicate that a higher probability of anaemia in pregnancy is likely to be found among pregnant women less than 35 years (15–24 years, aOR = 3.31; C.I: 1.13–9.73) (25–34 years, aOR = 2.49; C.I:1.06–5.84). A higher likelihood of anaemia was found among pregnant women who did not take SP drug (aOR = 3.70; C.I:1.20–11.43) and also among household heads aged 30–39 years (aOR = 4.51; C.I:1.09–18.71). However, a lower odd of being anaemic was found among pregnant women who had attained secondary or higher education (aOR = 0.19; C.I:0.05–0.76), women in the richest households (aOR = 0.02; C.I:0.00–0.42) and those accessing unimproved drinking water (aOR = 0.37; C.I:0.14–0.95). Furthermore, pregnant women with health insurance coverage had lower probability (aOR = 0.24; C.I: 0.06–0.94) of being anaemic. The results highlight the importance of varying factors at different levels in understanding the prevalence of anaemia among pregnant women. Understanding these factors will play a major contributor to developing strategies and programmes aimed at addressing anaemia among pregnant women.","author":"Desmond Klu","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"309af2a7dbe2c43e0617242f42da05835ea2f987ef0cf92f21e1e01038b3f4bf","category":"Environment"}