{"title":"513 Genomic landscape of adaptation in dairy cattle under selection in different environmental conditions","link":"https://academic.oup.com/jas/article/102/Supplement_3/148/7757398?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Unique genetic patterns in the genome of individuals who have experienced a selection process are called selection signatures. These signatures can identify genomic regions with phenotypic effects. In the case of dairy cattle, the Holstein breed was intensively selected to maximize productivity in temperate environments. In contrast, zebu cattle are better adapted to tropical and subtropical environments but with decreased productivity. The dairy Gir cattle is the most important dairy zebu in Brazil for its adaptation to the tropical environment. This study aimed to identify selection signatures between Holstein and Dairy Gir. Samples of 42 sires from the National Dairy Gir Breeding Program in Brazil underwent whole-genome sequencing (WGS), were aligned to the ARS_UCD1.2 bovine reference genome and processed according to the 1000 Bull genome project (1KBull) pipeline. WGS data from 307 Holstein animals from Canada and the United States from the 1KBull (Run 9) were used. Phasing was performed using Beagle, and selection signatures between populations were investigated using the extended haplotype homozygosity (XP-EHH) test with windows of 50 Kb containing ≥ 5 SNPs in the “rehh” R package. The top and bottom 0.5% extreme windows were considered potential selection signatures. Subsequently, a functional enrichment analysis (<span>P</span>-value &lt; 0.05) of genes overlapping the selection signatures was performed. For the Holstein population, 153 selection signatures were detected, harboring 160 genes. Terms related to ovarian steroidogenesis, cardiovascular system, lipid absorption, sulfur, fatty acid, and lipid metabolism were enriched. Disruptions in sulfur metabolism were previously observed in cows with clinical mastitis in Holstein. Fatty acid and lipid metabolism are related to negative energy balance, which increases lipid mobilization, leading to loss of body condition and greater concentrations of non-esterified fatty acids in circulation. This may further affect fertility due to the excess accumulation of lipids in the oocytes and endometrium, mainly because the postpartum uterus is remodelling. The intensive selection for milk production in Holstein is negatively associated with reproduction. The potential link between disruptions in lipid metabolism with inflammation and reproductive health may ultimately lead to an increase in days open. For the Dairy Gir population, 198 selection signatures flanking 220 genes were detected. Unlike the Holstein population, the genes under selection pressure in the Gir population were predominantly enriched to cell differentiation and organization, amine and amino acid metabolism, and protein metabolism, digestion, and absorption. Exposure to heat stress may cause ruminal epithelium damage, affecting DNA replication and amino acid metabolism. Amino and fatty acids are important for directing energy production to promote damaged tissue repair. Thus, these regions are candidates for playing an important role in heat tolerance. In conclusion, different genetic regions under selection pressure between populations were identified, indicating breed-specific adaptations and mechanisms underlying milk production, metabolic disorders, and reproduction.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"309d20d0e7b1753c26174aa589896144e1deaceeb784637755ebff00c2983642","category":"Environment"}