{"title":"Brave Buys a Search Engine, Promises No Tracking, No Profiling","link":"https://www.theregister.com/2021/03/03/brave_buys_a_search_engine/","date":1614881811000,"content":"\n<p>Thomas Claburn, writing for The Register:</p>\n\n<blockquote>\n  <p>Brave intends to make Tailcat the foundation of its own search\nservice, <a href=\"https://brave.com/search/\">Brave Search</a>. The company hopes that its more than 25\nmillion monthly active Brave customers will, after an initial\nperiod of testing and courtship, choose to make Brave Search their\ndefault search engine and will use it alongside other parts of its\nprivacy-oriented portfolio, which also includes Brave Ads, news\nreader Brave Today, Brave Firewall+VPN, and video conferencing\nsystem Brave Together.</p>\n\n<p>Brave Search, the company insists, will respect people’s privacy\nby not tracking or profiling those using the service. And it may\neven offer a way to end the debate about search engine bias by\nturning search result output over to a community-run filtering\nsystem called Goggles.</p>\n\n<p>The service will, eventually, be available as a paid option — for\nthose who want to pay for search results without ads — though its\nmore common incarnation is likely to be ad-supported, in\nconjunction with Brave Ads. The latter offers participants the\noption to receive 70 per cent of the payment made by the\nadvertiser in a cryptocurrency called BAT (Brave Attention Token).</p>\n</blockquote>\n\n<p>When, if ever, will popular browsers start defaulting to search engines other than Google? That’s the question.</p>\n\n<p>And for Apple in particular, it’s a question of an enormous sum of money. The exact figure Google pays Apple in traffic acquisition costs as a result of it being the default search engine in Safari (which in turn is the default browser on iOS and the Mac) is a tightly held secret. But Goldman Sachs analyst Rod Hall <a href=\"https://daringfireball.net/linked/2020/12/14/safari-ecosia-default-search\">estimated the figure at $9.5 billion for 2018 and $12 billion for 2019</a>.</p>\n\n<p>Putting aside the question of whether any non-Google search engine provides good enough search results to replace Google as Safari’s default — a huge question! — if Apple were to make such a move in the name of privacy, it almost certainly come as a multi-billion dollar annual hit to the company’s Services revenue.</p>\n\n<p>Apple’s total Services revenue for FY2020 <a href=\"https://sixcolors.com/post/2021/01/q1-2021-financial-results-apples-latest-record-holiday-quarter/\">was about $54 billion</a>. Would they take a $10 billion hit to that in the name of privacy? (Perhaps more interesting to flip the question around: If they care so deeply about privacy as a human right, why haven’t they already?)</p>\n\n<div>\n<a  title=\"Permanent link to ‘Brave Buys a Search Engine, Promises No Tracking, No Profiling’\"  href=\"https://daringfireball.net/linked/2021/03/04/brave-search\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"30a572d80e3f14b0f5608a142b07c0e0462112a093fd3cb5cf9358d965fb88d0","category":"Tech"}