{"title":"Source: Apple to Announce New Products This Week","link":"https://www.macrumors.com/2024/03/03/source-apple-product-announcements-this-week/","date":1709494732000,"content":"Apple plans to announce new products with press releases on its website this week, a proven source familiar with the matter told <em>MacRumors</em>. While the exact products that Apple plans to announce have not been disclosed, there are rumors about new iPads, Macs, and accessories. Apple is also <a href=\"https://www.macrumors.com/2024/02/27/apple-working-on-beats-solo-4-headphones/\">preparing new Beats Solo 4 headphones</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Apple-Logo-Spotlight.jpg\" width=\"1600\" height=\"900\" />\r<br />\n<em>Bloomberg</em>'s Mark Gurman today reiterated that Apple is planning new iPad Pro, iPad Air, and MacBook Air models, along with new Magic Keyboard and Apple Pencil accessories for select iPads. Gurman believes that <a href=\"https://www.macrumors.com/2024/03/03/no-apple-event-for-new-ipads-macs-gurman/\">Apple is not planning to hold a traditional event</a> to unveil these products, and instead plans to announce them \"on its website\" and with a \"series of online videos and marketing campaigns\" at some point in March or April.\r<br />\n\r<br />\nThe following announcements are expected in this March-April window:<ul><li>Two new iPad Pro models with the M3 chip, OLED displays, a thinner enclosure, a landscape-oriented front camera, a redesigned rear camera bump and other design tweaks, and possibly MagSafe wireless charging</li>\r<br />\n<li>Two new iPad Air models with the M2 chip, including a first-ever 12.9-inch model</li>\r<br />\n<li>A new Magic Keyboard for the iPad Pro with a larger trackpad, a partially-aluminum enclosure, and other design tweaks</li>\r<br />\n<li>At least one new Apple Pencil</li>\r<br />\n<li>New 13-inch and 15-inch MacBook Air models with the M3 chip, and the laptops will likely gain support for Wi-Fi 6E and Bluetooth 5.3</li>\r<br />\n<li>A new color option for the iPhone 15 and iPhone 15 Plus has not been definitively rumored, but it is likely based on precedent</li>\r<br />\n<li>New color options for iPhone cases and Apple Watch bands</li></ul>There have also been rumors about <a href=\"https://www.macrumors.com/2023/01/18/apple-tv-faster-chip-2024-launch/\">a new Apple TV</a> and a <a href=\"https://www.macrumors.com/2023/03/10/homepod-with-7-inch-display-to-launch-in-2024/\">HomePod with a screen</a> launching in the first half of 2024, but it is unclear if these products are ready. There are also <a href=\"https://www.macrumors.com/2024/03/03/iphone-se-4-design-revealed-in-cad-renders/\">alleged CADs for a fourth-generation iPhone SE</a>, but it is likewise unclear if that device is imminent, as 2025 has been a more widely rumored timeframe.\r<br />\n\r<br />\nIf this information from our previously-accurate source proves to be correct, keep an eye on the Apple Newsroom page for announcements this week.<br />This article, \"<a href=\"https://www.macrumors.com/2024/03/03/source-apple-product-announcements-this-week/\">Source: Apple to Announce New Products This Week</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/source-apple-to-announce-new-products-this-week.2420954/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"30a687e72eb9bef96514a7efb350f961b12453aae4fdefabccf89f8bd9c258e1","category":"Apple"}