{"title":"Reflections on augmented reality codes for teaching fundamental defensive techniques to boxing beginners","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301728","date":1712844000000,"content":"<p>by Ahmed Hassan Rakha</p>\r\n\r\nAR technology allows users to interact with virtual objects in real-world settings. Immersive AR experiences can enhance creativity and possibilities. Learners can explore real-life situations in a safe, controlled environment, understand abstract concepts and solve problems. This study investigates whether AR-codes affect boxing beginners’ performance in some fundamental defensive techniques. An experimental and control group were created to implement a quasi-experimental design. By using the ASSURE instructional design model, AR technology was incorporated into the educational program and delivered in flipped classroom method to the experimental group. Comparatively, the control group is taught a program using a teacher’s command style. A post-measurement of defensive boxing skills was conducted for both groups. Participants were 60 boxing beginners aged 12 to 14 who had enrolled in Port Fouad Sports Club’s 2023/2024 training season in Port Said, Egypt. Randomly, participants were divided into control and experimental groups. They were homogenized and equivalent in terms of age, height, weight, IQ, physical fitness, and skill level. According to the study results, the experimental group performed better in post-measurements than the control group. The AR Codes technology had a large effect size on the learning of boxing defensive skills under study. Consequently, it is necessary to use AR Codes technology as an educational resource to enhance the learning process, integrate it with active learning strategies, and use it to teach defensive boxing skills and apply them to offensive and counterattack skills, thereby improving the learning process.","author":"Ahmed Hassan Rakha","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"30a6541473adaf35710b71dda857fa5377cc698c0703bc5deddae3d4edee9834","category":"Interdisciplinary"}