{"title":"Interacting effects of sand, slugs and jute drive community composition in direct‐seeded urban wildflower meadows","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2664.14782?af=R","date":1726305646000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/47436cf8-35c4-412e-9667-2e2a48225c26/jpe14782-toc-0001-m.png\" alt=\"Interacting effects of sand, slugs and jute drive community composition in direct-seeded urban wildflower meadows\" />\n<p>Using low-nutrient substrates to cap and bury the weed seed bank, irrigation and direct seeding, we demonstrate it is possible to return plants from threatened grassy ecosystems to urban sites, creating a dense and species-rich native understorey within 1 year whilst reducing labour requirements during meadow establishment.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nWildflower meadows support biodiversity in urban environments, whilst providing low-maintenance, amenity landscapes. By moving from international plant palettes to those that include species from threatened plant communities in meadows, we can reintroduce native species to urban landscapes and help achieve conservation objectives. Adapting horticultural techniques from Europe, we determined if such approaches could support the germination and establishment of grasses and wildflowers from critically endangered plant communities in Melbourne, Australia.\n\nWorking in an urban park, we sowed seed of 27 species on soil capped with two depths of sand (10 and 80 mm) and site soil without sand to determine the impact of sand on weed emergence, slug grazing and growth of sown species. We quantified weed biomass and the time spent weeding unsown species from the emerging meadow. We also tested if covering the sites with a jute mesh enhanced sown species establishment.\n\nTwelve months after sowing, the percentage cover of sown species did not differ significantly among treatments. However, the cover of forb species was greater on plots without jute, whereas the cover of grasses was greater on plots with jute. Forb density and species richness were highest on 80 mm sand treatments without jute and lowest on 80 mm sand with jute. We attribute this to greater competition from grasses and higher slug abundance in the presence of jute, leading to the loss of forb species that are more palatable to slugs. Greater sand depths significantly reduced the time to weed and the biomass of weed species removed from the emerging meadow.\n\n<i>Synthesis and applications</i>. Using low-nutrient substrates to cap and bury the weed seed bank, irrigation and direct seeding, we demonstrate it is possible to return plants from threatened grassy ecosystems to urban sites, creating a dense and species-rich native understorey within 1 year whilst reducing labour requirements during meadow establishment.\n</p>","author":"Katherine Horsfall, \nStephen J. Livesley, \nJohn Delpratt, \nMegan J. Hirst, \nNicholas S. G. Williams","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"30ac2f1950df99e04d777cd9c6678cc77e15043a845b62a16fb79e6b95640c3c","category":"Environment"}