{"title":"A temperature‐controlled, circular maintenance system for studying growth and development of pelagic tunicates (salps)","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10605?af=R","date":1715404866000,"content":"<h2>Abstract</h2>\n<p>Salps have attracted attention as zooplankton organisms that may be able to expand their habitat range and increase their ecological importance in the face of ongoing global warming. Due to their gelatinous nature, unique feeding strategy, and reproductive ecology such changes could have profound impacts on regional marine ecosystems. While their role in the regional carbon cycle is receiving attention, our knowledge of their physiology and life cycle is still limited. This knowledge gap is mainly due to their fragile gelatinous nature, which makes it difficult to capture and maintain intact specimen in the laboratory. We present here a modified kreisel tank system that has been tested onboard a research vessel with the Southern Ocean salp <i>Salpa thompsoni</i> and at a research station with <i>Salpa fusiformis</i> and <i>Thalia democratica</i> from the Mediterranean Sea. Successful maintenance over days to weeks allowed us to obtain relative growth and developmental rates comparable to in situ field samples of <i>S. thompsoni</i> and <i>S. fusiformis</i>, and provided insights into previously unknown features of their life cycle (e.g., testes development). Our results show that traditional methods of estimating growth, such as cohort analysis, may lead to a general overestimation of growth rates and neglect individual strategies (e.g., shrinkage), which can affect the results and conclusions drawn from population dynamic models. By providing a starting point for the successful maintenance of different species, comparable experiments on the physiology of salps is made possible. This will contribute to refining model parameters and improving the reliability of the predictions.</p>","author":"Svenja J. Müller, \nWiebke Wessels, \nSara Driscoll, \nEvgeny A. Pakhomov, \nLutz Auerswald, \nKatharina Michael, \nBettina Meyer","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"30aea65ae7c28b5b2f899d8db05ffa57c7651b2d1f837344c30adb42fde4ffa6","category":"Environment"}