{"title":"Adaptive radiation despite conserved modularity patterns in San Salvador Island Cyprinodon pupfishes and their hybrids","link":"https://academic.oup.com/evolinnean/article/doi/10.1093/evolinnean/kzae013/7728993?rss=1","date":1722988800000,"content":"<span><div>Abstract</div>Adaptive radiations are striking examples of rapid speciation along ecological lines. In adaptive radiations, fast rates of lineage diversification often pair with rapid rates of morphological diversification. Such diversification has often been documented through the lens of ecological drivers, overlooking the intrinsic structural constraints that may also have a key role in configuring patterns of trait diversification. Covariation within and between traits has been hypothesized to govern the axes of trait evolution, either by increasing the degree of covariation between traits (i.e. integration), which promotes morphological coordination, or by strengthening the degree of covariation within traits (i.e. modularity), which allows organisms to explore novel trait combinations and different regions of morphospace. Here, we study the modularity of the skull within an adaptive radiation of pupfishes that is endemic to San Salvador Island, Bahamas. This radiation exhibits divergent craniofacial morphologies, including generalist, snail-eating specialist, and scale-eating specialist species. We assessed morphological disparity, integration strength, and modularity patterns across the sympatric San Salvador Island pupfish radiation, lab-reared hybrids, and closely related outgroup species. Our findings revealed an unexpected uniformity in the pattern of modularity across diverse species, supporting a five-module functional hypothesis comprising the oral jaw, pharyngeal jaw, neurocranium, hyoid apparatus, and hyomandibula. Despite this conserved modularity pattern, all species exhibited weak but significantly varying strengths of overall between-module integration and significant disparity across all cranial regions. Our results suggest rapid morphological diversification can occur even with conserved patterns of modularity. We propose that broadscale patterns of modularity are more conserved while between-module associations are more evolvable between species.</span>","author":"","siteTitle":"Evolutionary Journal of the Linnean Society Current Issue","siteHash":"3a6bf3189332aa8d860b0369d5aa2ac065f7385b7c3f4543469ad2a55950d26a","entryHash":"30b7bf2d0e07a941b46c92c9ac2ab24b16828af536dd5b4e7fd191cd3f2e7e99","category":"Environment"}