{"title":"Gurman: New iPad Pros in April","link":"https://www.bloomberg.com/news/articles/2021-03-17/apple-nears-launch-of-new-ipads-after-stay-at-home-sales-boost","date":1616089040000,"content":"\n<p>Mark Gurman:</p>\n\n<blockquote>\n  <p>The company is planning a refresh to its iPad Pro line, adding a\nbetter processor and improved cameras, the people said. The new\nmodels will look similar to the current iPad Pros and come in the\nsame 11-inch and 12.9-inch screen sizes. The devices will have an\nupdated processor that is on par with the faster M1 chip in the\nlatest MacBook Air, MacBook Pro and Mac mini. Apple designs these\nprocessors itself and typically has them made by Taiwan\nSemiconductor Manufacturing Co.</p>\n</blockquote>\n\n<p>It’s worth remembering that Apple never shipped A13-based iPad Pros. They went from <a href=\"https://daringfireball.net/2020/03/the_2020_ipad_pros\">the A12X in November 2018</a> to <a href=\"https://daringfireball.net/2020/03/the_2020_ipad_pros\">an A12Z speed bump one year ago</a> — and the difference between the A12X and A12Z is just one extra GPU core (from 7 to 8). I suspect the new chip in the new iPad Pros will be called the A14X, not the M-something. But performance-wise they should be very close. The names are just marketing, and “M” means Mac.</p>\n\n<blockquote>\n  <p>Apple is also looking to include a Mini-LED screen with at least\nthe larger model, which would be brighter and have improved\ncontrast ratios.</p>\n</blockquote>\n\n<p>They’re getting announced in two weeks but Apple is “looking to include Mini-LED”. They’d better make a decision soon.</p>\n\n<blockquote>\n  <p>In testing, the new iPad Pros have used a Thunderbolt connector,\nthe same port on the latest Macs with custom Apple processors. The\nport doesn’t require new chargers, but it would enable\nconnectivity with additional external monitors, hard drives and\nother peripherals. It’s also faster at syncing data than the USB-C\ntechnology used in the current models.</p>\n</blockquote>\n\n<p>Sounds like this is USB 4, <a href=\"https://www.engadget.com/2019-03-04-usb4-thunderbolt-3-40gbps.html\">which incorporates Thunderbolt 3</a>. </p>\n\n<div>\n<a  title=\"Permanent link to ‘Gurman: New iPad Pros in April’\"  href=\"https://daringfireball.net/linked/2021/03/18/gurman\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"30ba25a6ae488662c8c7c060d18516dbef89c71d684e4ed95bd1e17e773bbfd9","category":"Tech"}