{"title":"Phylogeographic Analysis to Understand the Origin, Speciation and Biogeographic Expansion of the Invasive Asian Hornet, Vespa velutina","link":"https://www.preprints.org/manuscript/202409.0162/v1","date":1725349816000,"content":"The Asian hornet, Vespa velutina, is an invasive species that has not only expanded its range in Asia but also invaded European countries, incurring significant costs on the local honey and bee industry. This phylogeographic study aims to trace the evolutionary trajectory of V. velutina and its close relatives, aiming to identify features that characterize an invasive species. The last successful invasion of Vespa velutina into France occurred in 2002.40, and into South Korea in 2002.77, estimated by fitting a logistic equation to the number of observations over time. The instantaneous rate of increase is 1.3667 for V. velutina in France and 0.2812 in South Korea, consistent with the interpretation of little competition in France and strong competition from local hornet species in South Korea. The invasive potential of two sister lineages can be compared by their distribution area when proper statistical adjustments are made to account for differences in sample size. V. velutina has a greater invasive potential than its sister lineage. The ancestor of V. velutina split into two lineages, one found in Indonesia/Malaysia and the other colonizing the Asian continent. The second lineage split into a sedentary clade inhabiting Pakistan and India, and an invasive lineage colonizing much of Southeast Asia. This latter lineage gave rise to subspecies V. v. nigrithorax that invaded France, South Korea, and Japan. My software PGT, which generates geophylogenies and computes geographic areas for individual taxa, is useful for understanding biogeography in general and invasive species in particular. I discussed the conceptual formulation of an index of invasiveness for comparison between sister lineages.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"30bab665e7ae9844e208e2ba53f49b13d3386743df01db661cdcb165d32bc792","category":"Interdisciplinary"}