{"title":"Electron Microscopy of Au Islands on the ZnO-TiO2 Heterojunction to Enhance the Photocatalytic Hydrogen Production","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.535/7719816?rss=1","date":1721779200000,"content":"<span>In this investigation, gold is loaded on the ZnO-TiO<sub>2</sub> heterojunction in order to increase its photocatalytic hydrogen production. Here the electron microscopy techniques are included in order to show the size and distribution of the expected Au islands. The development of renewable energy via photocatalytic hydrogen production is considered a promising technology and different semiconducting materials have been investigated for this purpose. TiO2 is non toxic, has a has a low cost and good physicochemical properties but fast recombination of photoinduced electron hole pairs [<a href=\"#ozae044.535-B1\">1</a>] Thus it is normally coupled with other semiconductors, in this case ZnO. For the heterojunction TiO<sub>2</sub>-ZnO, it has been shown that the electrochemical and photoelectrochemical characterization that an optimal content of surface states at the interface between the two oxides which increases the separation of the charge carriers [<a href=\"#ozae044.535-B2\">2</a>]. Other studies have also shown that the photocatalytic production of hydrogen is improved e.g. a ZnO/TiO<sub>2</sub> composite containing 30 wt% of ZnO exhibits the highest hydrogen production due to its high surface area and a decrease in the photoinduced charge recombination [<a href=\"#ozae044.535-B3\">3</a>]. On the other hand, metallic nanoparticles (Pd, Pt, Au) have also been deposited on TiO<sub>2</sub> to improve the hydrogen photocatalytic production. They become electron traps that increase the separation of photoinduced electron-hole pairs and improve the charge transfer process due to the creation of surface energy states that favor hydrogen production [<a href=\"#ozae044.535-B4\">4</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"30bf6b8a14e7c5dec2b89285afeffa467215c5bb94a9bfcbc3b46de25d891123","category":"Environment"}