{"title":"Apple Releases macOS Monterey With AirPlay to Mac, Live Text, Safari Updates, Shortcuts App and More","link":"https://www.macrumors.com/2021/10/25/apple-releases-macos-monterey/","date":1635181440000,"content":"Apple <a href=\"https://www.apple.com/newsroom/2021/10/macos-monterey-is-now-available/\">today released</a> macOS 12 Monterey, the newest version of the operating system designed to run on the Mac. <a href=\"https://www.macrumors.com/roundup/macos-12/\">macOS Monterey</a> comes after months of beta testing and feature refinements.\r\n<br />\r\n\r\n<br />\r\n<div></div><div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r\n<br />\r\nThe new ‌‌macOS Monterey‌ update can be downloaded on all eligible Macs using the Software Update section of System Preferences, and it can also be found in the <a href=\"https://www.macrumors.com/guide/mac-app-store/\">Mac App Store</a>. Like all Mac updates, ‌‌macOS Monterey‌‌ is a free download. For those who don't want to upgrade to ‌macOS Monterey‌, there's also a <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">macOS Big Sur</a> 11.6.1 update available, which Apple says includes security fixes. \r\n<br />\r\n\r\n<br />\r\n‌macOS Monterey‌ adds quite a few features that have already been introduced on iOS devices with <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a> and <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a>. <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a> has gained spatial audio support and voice isolation to cut down on background noise, and in the future, it will work with the SharePlay feature for screen sharing and watching tv and movies with friends and family over ‌FaceTime‌.\r\n<br />\r\n\r\n<br />\r\nMessages supports Shared With You, and Tab Groups in Safari allow tabs to be organized together and accessed across devices. There were Safari design changes to the tab interface, but right before Monterey was released, Apple reversed the changes. The \"Compact\" Monterey look can be enabled for those who prefer it.\r\n<br />\r\n\r\n<br />\r\nThere's a new <a href=\"https://www.macrumors.com/guide/airplay/\">AirPlay</a> to Mac option and a feature for using the Mac as a speaker for multi-room audio, and Focus mode helps you keep on task by cutting down on distractions. The Shortcuts app that's available on iOS devices has expanded to the Mac, and Apple added new features to Notes, including a Quick Note option that activates a note when you mouse over a section of the screen.\r\n<br />\r\n\r\n<br />\r\nWith Live Text, Macs can detect text in any image and it becomes interactive, so you can copy, paste, and translate text from photos. Visual Lookup in the <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a> app uses machine learning to provide details on animals, art, landmarks, plants, and more that you've photographed.\r\n<br />\r\n\r\n<br />\r\n<a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> Private Relay, a feature available to all paid ‌iCloud‌ users, hides your browsing habits and IP address from third parties. There's a Hide My Email feature for keeping your email address private, and you can use your own personal domains with ‌iCloud‌.\r\n<br />\r\n\r\n<br />\r\nMail Privacy Protection prevents emails from using tracking pixels to monitor your activity, and on <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> Macs, <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> and <a href=\"https://www.macrumors.com/roundup/airpods-max/\">AirPods Max</a> now offer spatial audio support. Apple's full release notes for ‌macOS Monterey‌ are below:<blockquote><strong>FaceTime</strong>\r\n<br />\r\n- Spatial audio makes voices sound like they come from the direction of a speaker on the screen in a Group FaceTime call\r\n<br />\r\n- Voice Isolation blocks background noises so your voice is crystal clear\r\n<br />\r\n- Wide Spectrum brings every sound in your space into the call\r\n<br />\r\n- Portrait mode puts the focus on you by blurring your background on Mac computers with the M1 chip\r\n<br />\r\n- Grid view displays people in same-size tiles and highlights the active speaker\r\n<br />\r\n- FaceTime links for inviting friends to calls on Apple, Android, or Windows devices\r\n<br />\r\n\r\n<br />\r\n<strong>Messages</strong>\r\n<br />\r\n- Shared with You displays content shared over Messages in your Mac apps\r\n<br />\r\n- New Shared with You section in Photos, Safari, News, Podcasts, and the TV app\r\n<br />\r\n- Multiple photos display as collages or stacks in Messages\r\n<br />\r\n\r\n<br />\r\n<strong>Safari</strong>\r\n<br />\r\n- Tab Groups help you save and organize your tabs and sync across devices\r\n<br />\r\n- Intelligent Tracking Prevention prevents trackers from viewing your IP address\r\n<br />\r\n- Compact tab bar option lets you see more of the webpage on your screen\r\n<br />\r\n\r\n<br />\r\n<strong>Focus</strong>\r\n<br />\r\n- Focus lets you automatically filter out notifications based on what you're doing\r\n<br />\r\n- Options to customize a Focus for activities like work, gaming, reading, and more\r\n<br />\r\n- Focus sets across all Apple devices\r\n<br />\r\n- Status lets your contacts know that your notifications are silenced\r\n<br />\r\n\r\n<br />\r\n<strong>Quick Note &amp; Notes</strong>\r\n<br />\r\n- Quick Note lets you take notes on any app or website, and easily revisit them later\r\n<br />\r\n- Tags help you quickly categorize your notes by topic and make them easy to find\r\n<br />\r\n- Mentions enable you to notify others of important updates in shared notes\r\n<br />\r\n- Activity view displays who made recent changes in a shared note\r\n<br />\r\n\r\n<br />\r\n<strong>AirPlay to Mac</strong>\r\n<br />\r\n- AirPlay to Mac lets you share content from iPhone or iPad straight to your Mac\r\n<br />\r\n- AirPlay speaker support for playing music through your Mac sound system\r\n<br />\r\n\r\n<br />\r\n<strong>Live Text</strong>\r\n<br />\r\n- Live Text makes text interactive in photos across the system\r\n<br />\r\n- Support for copying, translating, and looking up text that appears in photos\r\n<br />\r\n- Visual Look Up helps you learn about art, landmarks, and other objects in photos\r\n<br />\r\n\r\n<br />\r\n<strong>Shortcuts</strong>\r\n<br />\r\n- New app helps you automate everyday tasks, helping you accomplish them faster\r\n<br />\r\n- Gallery with pre-built shortcuts that you can add and run throughout the system\r\n<br />\r\n- Shortcuts editor helps you design custom shortcuts for your specific workflows\r\n<br />\r\n- Support for automatically converting Automator workflows into shortcuts\r\n<br />\r\n\r\n<br />\r\n<strong>Maps</strong>\r\n<br />\r\n- Interactive 3D globe with enhanced details for mountains, oceans, and more on Mac computers with the M1 chip\r\n<br />\r\n- Detailed city maps display elevation, trees, buildings, landmarks, and more on Mac computers with the M1 chip\r\n<br />\r\n\r\n<br />\r\n<strong>Privacy</strong>\r\n<br />\r\n- Mail Privacy Protection helps prevent senders from tracking your Mail activity\r\n<br />\r\n- Recording indicator in Control Center for apps that are accessing your mic\r\n<br />\r\n\r\n<br />\r\n<strong>iCloud+</strong>\r\n<br />\r\n- iCloud Private Relay (beta) helps prevent companies from creating a detailed profile of your browsing activity in Safari\r\n<br />\r\n- Hide My Email creates unique, random email addresses that forward to your inbox</blockquote>Later this year, ‌macOS Monterey‌ will gain support for Universal Control, an addition that was not ready for release at launch. With Universal Control, users can use a single keyboard and mouse across multiple Macs and iPads. SharePlay, the feature that allows users to share their screens over ‌FaceTime‌ and watch movies and TV together, is also coming in a later ‌macOS Monterey‌ update.\r\n<br />\r\n\r\n<br />\r\nTo give a better overview of all of the new features that Apple has brought to the Mac with ‌macOS Monterey‌, we have a <a href=\"https://www.macrumors.com/roundup/macos-12/\">dedicated macOS Monterey roundup</a> that's available.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macos-12/\">macOS Monterey</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macos-monterey.234\">macOS Monterey</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/25/apple-releases-macos-monterey/\">Apple Releases macOS Monterey With AirPlay to Mac, Live Text, Safari Updates, Shortcuts App and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-macos-monterey-with-airplay-to-mac-live-text-safari-updates-shortcuts-app-and-more.2319205/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=k7Ihbxhf0Hc:3qEAbIcFq8c:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=k7Ihbxhf0Hc:3qEAbIcFq8c:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/k7Ihbxhf0Hc\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"30c42d605c0f05ad57ffda7abb5f740f47260f852624bb27be6993ad9e43af3a","category":"Apple"}