{"title":"The Relationships of Serum Vitamin D Concentration with Linear Speed and Change of Direction (COD) Performance in Soccer Players","link":"https://www.preprints.org/manuscript/202406.0521/v1","date":1717994289000,"content":"The appropriate concentration of vitamin D in the athlete’s body is  essential for its proper functioning, especially in terms of muscular  health, by enhancing recovery   and oxygen consumption. Soccer players are required to perform frequent sprints and change of directions  during training and competition. The aim of the present study was to establish whether the level of vitamin D (measured by 25-hydroxyvitamin D concentrations- 25(OH)D) in  blood serum has any influence on speed (s) and change of direction (COD, s) performance. Material and methods: Twenty male soccer players from the  top league   in Poland participated in the study.  All subjects' were evaluated for the serum concentration of 25(OH)D  at the beginning of the preseason. . The linear sprint test  was performed at  5m and 30m and  COD   (time and deficit), was evaluated  at 30m   at the beginning and after 6 weeks of preparatory period. Results: The results revealed that 50% of soccer players had an insufficient level or a deficit of 25(OH)D (≤ 30 ng/ml), with 20% having a significant deficiency of  30 ng/ml).There were no statistically significant correlations between the training effect for the variables ∆5m (before - after) and ∆30m (before - after). Statistically significant positive correlations were found between the training effect for the variables ∆COD (before - after) (R=0.62/p=0.003) and ∆deficit (before-after) (R=0.47/p=0.039). With a higher concentration of vitamin D in the blood, the training effect for COD and the deficit increased, which was visible in the faster performance of the COD test. No statistically significant differences were found for the mean values of the variables ∆5m (before - after) and ∆30m (before - after) in the group of subjects whose 25(OH)D  concentration was 30mg /ml. Significant differences were noticed for the variables ∆COD (m=0.60 [s]) and ∆deficit (m=0.56[s]) in the group of subjects whose 25(OH)D  concentration was 30mg /ml. The training effect was significantly higher for the group of subjects whose 25(OH)D  concentration was above 30 mg/ml, which was observed  by the faster performance of the COD test  in this group of subjects. Conclusions: The  serum concentration of vitamin D  affects training adaptations of   muscles. A lower concentration of Vitamin D  seems to have a detrimental effect  on the  change of direction performance. Soccer players whose blood serum 25(OH)D  concentrations  were &gt;30mg/ml achieved better results in the applied fitness tests.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"30c4a38aa488ead04c5bf7eefb55494b8147abef6c04dc7084936ac0c8ecec94","category":"Interdisciplinary"}