{"title":"Strade Bianche: Everything you need to know","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know","date":1708936200000,"content":"\n      <p><b>Date:</b><span> Saturday March 2, 2024 <br /></span><b>Start: </b><span>Siena, Tuscany<br /></span><b>Finish:</b><span> Siena, Tuscany<br /></span><b>Total distance:</b><span> 215km (men’s) and 137km (women’s)<br /></span><b>Defending champions</b><span>: Tom Pidcock (Ineos Grenadiers) and Demi Vollering (SD Worx)</span></p>\n<p><span>Strade Bianche gained prestige quickly when the men's race began in 2007, attracting some of the world’s best cyclists to the white roads of Tuscany. In 2017, the one-day race was awarded UCI WorldTour status and has now become a must-do Classics race in many of the pro's calendars. </span></p>\n<p>Strade Bianche translates to “white roads” and this is a defining feature of the race, with one-third of the overall route being gravel. The route is split into sections, with 15 sections raced on the dirt roads of Tuscany. Testing the rider's bike handling and climbing abilities, the route does not just feature white roads but also steep climbs and winding descents over 215 kilometres. </p>\n<div></div>\n<div></div>\n<p>Fabian Cancellara holds the record for most wins, having conquered Strade Bianche three times in a row, winning in 2008, 2012, and 2016. The only other rider who has come close to Cancellara’s record is Polish rider Michał Kwiatkowski, who has won the race twice in 2014 and 2017. Other champions include Philippe Gilbert, Zdeněk Štybar, Tiesj Benoot, Julian Alaphilippe, Wout van Aert, Mathieu van der Poel, Tadej Pogačar and most recently, Tom Pidcock.</p>\n<p>Riders who have won the race three times have the honour of having a section of gravel named after them. As Cancellara is the only rider in the history of the race to achieve this feat, section eight, an 11.5km long section in Monte Sante Marie, is named after him.</p>\n<p>Pidcock won the race last year after a powerful attack, which saw him solo all the way to the finish line. The British rider will be back to defend his title for the second year running but will be up against former winner Tadej Pogačar, as well as Matej Mohorič, Ben Healy, and Christophe Laporte.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/10piccock02_strade_bianche_2023_41bbc1ad-197e-4d5c-b667-097dfa9c6653.jpg?v=1704377812\" /><em>Image: James Startt</em></p>\n<h3><b>Strade Bianche men’s teams: </b></h3>\n<ul>\n<li><span>Alpecin-Deceuninck</span></li>\n<li><span>Arkea-B&amp;B Hotels</span></li>\n<li><span>Astana Qazaqstan</span></li>\n<li><span>Bahrain-Victorious </span></li>\n<li><span>Bora-Hansgrohe</span></li>\n<li><span>Cofidis</span></li>\n<li><span>Decathlon AG2R La Mondiale </span></li>\n<li><span>EF Education-EasyPost</span></li>\n<li><span>Groupama-FDJ</span></li>\n<li><span>Ineos Grenadiers</span></li>\n<li><span>Intermarché-Wanty</span></li>\n<li><span>Lidl-Trek</span></li>\n<li><span>Movistar</span></li>\n<li><span>Soudal–Quick-Step</span></li>\n<li><span>DSM-Firmenich PostNL</span></li>\n<li><span>Jayco Alula</span></li>\n<li><span>Visma-Lease a Bike</span></li>\n<li><span>UAE Team Emirates </span></li>\n<li><span>Israel-Premier Tech</span></li>\n<li><span>Lotto Dstny </span></li>\n<li><span>Uno-X Mobility</span></li>\n<li><span>Corratec-Vini Fantini </span></li>\n<li><span>Q36.5 Pro Cycling</span></li>\n<li><span>Team Polti Kometa</span></li>\n<li><span>Tudor Pro Cycling</span></li>\n</ul>\n<h3><strong>Strade Bianche men's route: </strong></h3>\n<p><span>This year’s edition of the race is the longest in its history, having increased from 184km to 215km, as well as one of the hardest with the inclusion of four more gravel sections for the peloton to tackle. That takes the overall amount of gravel sections to 15 instead of 11, a total of 71.5km. The majority of the race – 175km to be exact – remains unchanged from its previous editions and features many of the white roads we’ve come to expect in this race, including Bagnaia, Lucignano d’Asso, S.Martino in Grania, and Monte Sante Marie. In previous editions, Le Tolfe was the final stretch of unpaved road before the riders headed to the finish line in Siena, however, this year’s race features a 30km circuit loop with some old and new gravel sections. </span></p>\n<p>Making its first-ever appearance in the race is Strada del Castagno, a 1.3km stretch, before Montechiaro, which is a 3.3km stretch that featured in the race in 2007. The circuit ends in Vico d’Arbia, where the riders face Colle Pinzuto and Le Tolfe again before the famous finish up the punishing Via Santa Caterina climb to the finish line in Piazza del Campo.</p>\n<ul></ul>\n<h3><span><strong></strong></span></h3>\n<h3><b>Strade Bianche Donne: </b></h3>\n<p><span>Following the success of the men’s race, the women's peloton first raced the Strade Bianche Donne in 2015, on the same day as the men. Since then, it has become one of the Women’s WorldTour must-do races, and having this Classics title on your palmarès is a monumental achievement, meaning it attracts a stellar line-up of female cyclists to the start line. </span></p>\n<p>While it is shorter in distance than the men’s race at 137km, the race is no easier and still contains 12 sections of gravel and a number of brutal climbs, including the 16% climb to the finish line along Via Santa Caterina. </p>\n<p>British rider Lizzie Deignan<span> (née Armitstead) </span>won the inaugural Strade Bianche Donne in 2016 while wearing the rainbow stripes as the women's world champion. The following year, Elisa Longo Borghini won the race, becoming the first-ever Italian to win the Strade Bianche in both the men’s and women’s races. Adding themselves onto the winning list since has been Anna van der Breggen, Annemiek van Vleuten, Chantel van den Broek-Blaak, Lotte Kopecky, and last year, Demi Vollering. </p>\n<p>The now-retired Movistar rider Van Vleuten is the only rider to win the race twice in 2019 and in 2020. However, Longo Borghini, Deignan, Kopecky and Vollering are all capable of levelling themselves with Van Vleuten and will most likely be looking to make this statement in this year’s edition.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_1254_df40aa4e-c07f-4427-be71-309cba8314a3.jpg?v=1704377770\" /><em>Image: SWPix.com</em></p>\n<h3><b>Strade Bianche Donne teams: </b></h3>\n<ul>\n<li><span>AG Insurance–Soudal</span></li>\n<li><span>Canyon//SRAM</span></li>\n<li><span>Ceratizit-WNT Pro Cycling </span></li>\n<li><span>FDJ-SUEZ</span></li>\n<li><span>Fenix-Deceuninck</span></li>\n<li><span>Human Powered Health</span></li>\n<li><span>Lidl-Trek</span></li>\n<li><span>Liv-Jayco-Alula</span></li>\n<li><span>Movistar</span></li>\n<li><span>DSM-Fermenich PostNL </span></li>\n<li><span>SD Worx</span></li>\n<li><span>Visma-Lease a Bike</span></li>\n<li><span>UAE Team ADQ</span></li>\n<li><span>Uno-X Mobility</span></li>\n<li><span>Cofidis</span></li>\n<li><span>Tashkent City Women Professional Cycling</span></li>\n<li><span>Aromitalia 3T Vaiano</span></li>\n<li><span>Bepink-Bongioanni </span></li>\n<li><span>BTC City Ljubljana Zhiraf Amedo</span></li>\n<li><span>EF Education-Cannondale</span></li>\n<li><span>Isolmant-Premac-Vittoria</span></li>\n<li><span>Laboral Kutxa-Fundacion Euskadi</span></li>\n<li><span>Mendelspeck GE-Man</span></li>\n<li><span>Top Girls Fassa Bortolo</span></li>\n</ul>\n<h3><strong>Strade Bianche women's route: </strong></h3>\n<p><span>The women’s race starts in Siena and heads south towards the Tuscan countryside. The 2.1 kilometre-long Vidritta is the women’s first gravel section out of a total of 12 sections, which totals 40.4km of the entire race. The route shares the same white roads as the men’s route, including Bagnaia, La Piana, S.Martino in Grania and Monteaperti. The course is not only defined by its famous white roads, but also its twisting and undulating course, with some climbs boasting double-digit gradients and technical descents. </span></p>\n<p>As the riders reach Vico d’Arbia, they will also tackle the 30km circuit, which features Strada del Castagno, Montechiara, and then a second run on Colle Pinzuto and Le Tolfe before the grand finale up the Via Santa Caterina climb to the finish line in Piazza del Campo.</p>\n<ul></ul>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"30cc9f3d8924543e97bf8d85ae4df0496ddb247a1697180dd731ffcf0cbfa888","category":"Cycling"}