{"title":"Cycasin derivative: a potential embryotoxic component of Atractylodes macrocephala rhizome for limb malformation","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae057/7645335?rss=1","date":1712966400000,"content":"<span><div>Abstract</div><div>Objective</div>The rhizome of <span>Atractylodes macrocephala</span> Koidz. (Asteraceae), called <span>Atractylodes macrocephala</span> rhizome (AMR) and known by its traditional name Bai Zhu, is a prominent Chinese herbal medicine employed for preventing miscarriage. However, our previous study revealed that high dosages of AMR administered during pregnancy could cause embryotoxicity but the specific embryotoxic components and their underlying mechanisms remain unclear. This study aimed to screen and identify the potential embryotoxic components of AMR.<div>Methods</div>The AMR extracts and sub-fractions were analyzed by thin layer chromatography and subsequently screened by in vitro mouse limb bud micromass and mouse whole embryo culture bioassays. The embryotoxic fractions from AMR were further evaluated in vivo using a pregnant mouse model. The structures of the potential embryotoxic components were analyzed using matrix-assisted laser desorption/ionization tandem time-of-flight mass spectrometry (MALDI-TOF/TOF-MS).<div>Results</div>In vitro and in vivo bioassays revealed that AMR glycoside-enriched sub-fractions (AMR-A-IIa and AMR-A-IIb) exhibited potential embryotoxicity. These sub-fractions, when administered to pregnant animals, increased the incidence of stillbirth and congenital limb malformations. MS spectrometry analysis identified cycasin derivatives in both sub-fractions, suggesting their possible role in the observed limb malformations. However, further experiments are necessary to validate this hypothesis and to elucidate the underlying mechanisms.<div>Conclusions</div>Our study provides significant scientific evidence on the pharmacotoxicity of AMR, which is important for the safe clinical application of commonly used Chinese herbal medicines during pregnancy.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"30d20504edd854a6418e2d6b65c607073449e9699a19c451c3f9fcd5db3fa3b1","category":"Environment"}