{"title":"Leveraging wastewater surveillance to actively monitor Covid‐19 community dynamics in rural areas with reduced reliance on clinical testing","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400012?af=R","date":1709638170000,"content":"<h2>ABSTRACT</h2>\n<p>The prevalence of COVID-19 in the community has become more difficult to gauge utilizing clinical testing due to a decrease in reported test results stemming from the availability of at-home test kits and a reduction in the number of cases seeking medical treatment. The purpose of this study was to examine the trend of diminishing correlation between reported clinical cases of COVID-19 and wastewater-based surveillance epidemiological data as home testing became available in the Eastern Upper Peninsula of Michigan. Wastewater grab samples were collected weekly from 16 regional locations from June 2021-December 2022. Samples were analyzed for SARS-CoV-2 N1 and N2 viral particles using reverse transcriptase digital droplet polymerase chain reaction (RT ddPCR). N1 and N2 gene copies were correlated with clinical cases. The t-test was used to determine correlation deterioration point. Clinical cases post-deterioration were calculated for high-correlated pre-deterioration locations using linear regression. Correlation between the wastewater-based surveillance of SARS-CoV-2 and reported clinical cases deteriorated after February 1, 2022. This corresponds with the timeframe in which commercially available at-home test kits became available in the United States. The increase in at-home testing for SARS-CoV-2 likely contributed to the decrease in reported clinical positive tests in early 2022, providing an unrealistic picture of the presence of Covid-19 in the community. As measures to reduce exposure such as personal masking, clinical testing, social isolating, and quarantining continue to decline, wastewater surveillance for the presence of SARS-CoV-2 may be the best method for public health professionals to remain aware of virus dynamics in localized regions. Time-series modeling adds another layer of information when clinical data is unobtainable or underreported.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Michelle M. Jarvie, \nThu N.T. Nguyen, \nBenjamin Southwell, \nDerek Wright","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"30d6a89f9fd87e730fb122680f769895d7f85d955bd5d9c3e0bc82b87487d9c3","category":"Environment"}