{"title":"Andrew and Lee dissect The Wheel of Time’s television premiere","link":"https://arstechnica.com/?p=1814073","date":1637344883000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-main-party-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-main-party.jpg\">Enlarge</a> <span>/</span> Our lead characters, from L-R: Nynaeve, Mat, Lan, Moiraine, Egwene, Perrin, and Rand. (credit: Amazon Studios)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Andrew Cunningham and Lee Hutchinson have spent decades of their lives with Robert Jordan and Brandon Sanderson's <em>Wheel of Time</em> books, and they're bringing that knowledge to bear as they <a href=\"https://arstechnica.com/gaming/2021/11/ars-is-reviewing-amazons-the-wheel-of-time-series/\">recap each episode</a> of Amazon's new <em>WoT</em> TV series. These recaps won't cover every element of every episode, but they will contain major spoilers for the show and the book series. If you want to stay unspoiled and haven't read the books, these recaps aren't for you.</p>\n<p>New episodes of <em>The Wheel of Time</em> will be posted to Amazon Prime subscribers every Friday.</p>\n<div>\n<p><strong>Andrew</strong>: I thought it would be best to start this first one off by establishing our Book Reading Cred.</p>\n<p>A friend gifted me a paperback copy of <a href=\"https://bookshop.org/books/the-eye-of-the-world-book-one-of-the-wheel-of-time-9781250832375/9781250251466\"><em>The Eye of the World</em></a> in what must have been mid-2003, which I have pinpointed so precisely because I know that <em>Crossroads of Twilight</em> had come out but that it hadn't yet come out in paperback. So I burned through them all once or twice in high school, and then re-read the whole series again sometime in the mid-Sanderson era, and then did my last full-series re-read in 2019 after I talked about <em>EotW</em> on <a href=\"https://overduepodcast.com/episodes/2018/11/26/ep-330-the-wheel-of-time-eye-of-the-world-by-robert-jordan\">my book podcast</a>.</p>\n</div>\n<div><strong>Lee</strong>: Way back in 1997, when dinosaurs roamed the earth, a coworker at the friendly neighborhood <a href=\"https://arstechnica.com/gadgets/2013/01/how-i-launched-3-consoles-and-found-true-love-at-babbages-store-no-9/\">Babbage’s</a> suggested I try this fantasy series she’d been hooked on called “<em>The Wheel of Time</em>.” She loaned me her copy of <em>Eye of the World</em>, and then yeah, same thing—it was like falling into a mad vortex of dizzying addiction. The latest book at the time was the just-released <em>Crown of Swords</em>, book seven, and I blazed through the series in just a few months. There have been several re-reads since then, every time a new book landed (even the mess that was <em>Crossroads of Twilight</em>), but at this point it’s been probably a couple of years since I picked one up. However, I’ve got my wife to fill in the gaps for me—I infected her with <em>WoT</em> as I was infected, as is tradition, and she is if anything even more excited about the show than I am.</div>\n<div><strong>Andrew</strong>: My wife, sadly, had too many antibodies to catch <em>Wheel of Time</em> fever. Maybe from reading so much Tolkien? And like, I get it. It can be a hard series to sell to a skeptic. The conversation always goes something like \"well, it's <em>fourteen</em> gigantic books, and the first one especially is mostly a <em>Lord of the Rings</em> pastiche, and it spends a lot of time in this \"men be like this/women be like this\" space that hasn't aged especially well...\"</div>\n<div><strong>Lee</strong>: Half-hating the characters in <em>WoT</em> is a huge core part of the fandom! Maybe we can get her into it after the show!</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-emonds-field.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-emonds-field-980x612.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-emonds-field.jpg\">The world of <em>Wheel of Time</em> is lovingly (and expensively) recreated. </a> (credit: Amazon Studios)</p></div>\n<div>\n<p><strong>Andrew</strong>: I mean, I saw <em>A Knight's Tale</em> in her \"watch it again\" Netflix queue, so I know she's watched sillier stuff.</p>\n<p>All of that being said! When these books are good they are still really engaging. <em>Song of Ice and Fire</em>/<em>Game of Thrones</em> comparisons are going to be inevitable throughout this project, so I will just break that seal now—those books and that series sort of revel in their blood-soaked nihilism, but Robert Jordan and Brandon Sanderson loved all their characters and very, very rarely deployed \"surprise major character death\" or \"gratuitous sexual assault\" as a driver of narrative.</p>\n</div>\n<div><strong>Lee</strong>: That’s a good way to put it. I’ve always thought of <em>WoT</em> vs. <em>GoT</em> as kind of like a <em>Star Trek</em> vs. <em>Star Wars</em> pairing—<em>WoT</em> is the <em>Excelsior</em>, all smug and superior and ready to smack you with that transwarp drive. <em>GoT</em> is the <em>Millennium Falcon</em>—dirty, loud, with some swearing, but it’s got it where it counts. Where WoT is all graceful lines, flowing slow motion dresses, stark and shining Whitecloaks, and a camera that can never hold still, <em>GoT</em> is dirt, mud, filth, and then you sh— yourself when you die. (Aes Sedai, on the other hand, clearly do not poop at all.) The differences aren’t just thematic, though there’s lots of that—the two shows visually are very, very different experiences.</div>\n<div><strong>Andrew</strong>: OK, let's jump into these first three episodes. Which all, collectively, have kind of a \"sweaty TV pilot\" feel to me. There's a lot to say about what they are and are not doing well individually, but as a group they are all doing a ton of heavy lifting—they have to establish a whole bunch of pro- and antagonists and start building their personalities and story arcs. They visit a few locations and talk about a bunch more of them. We either meet or hear about, by my count, three completely distinct subcultures (the Whitecloaks, the Tinkers, and the Aiel). It's all a bit dizzying, and some of the introductions work better than others.</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-eamon-valda.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-eamon-valda-980x653.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-eamon-valda.jpg\">Abdul Salis' turn as the slimy Whitecloak Questioner Eamon Valda is a highlight of the early episodes.</a> (credit: Amazon Studios)</p></div>\n<div>\n<p><strong>Lee</strong>: It’s a <em>hard</em> ask for a TV writer to get us into this story—you don’t have the luxury a book author has where you can just go ahead and take a thousand pages to do whatever. And <em>Eye of the World</em> is one of the biggest meals to get through in the whole saga. Folks who are coming into this show expecting to see their favorite scenes echoed back at them onscreen are going to have to realign their expectations, because as you say, we’ve got so much we’ve got to get into. What we see of the Whitecloaks is excellent, and Eamon Valda (Abdul Salis) is gratifyingly unctuous. We speed through the Tinker encounter without the aid of a major supporting character—I suppose we’ll get to that in detail, but something to be aware of is that a lot of swizzling has been done to shape the narrative for TV. If you’re still angry that Thom Bombadil didn’t show up on screen to sing you songs or that you never got to see the Scouring of the Shire, you might take issue with <em>WoT</em>’s streamlining for TV.</p>\n<p>(Speaking of characters named \"Thom,\" Thom Merrilin has an absolutely electrifying introduction—though, sadly, the character lacks giant, white twirly mustaches. We'll probably have more to say about Thom in a future piece.)</p>\n<p>You’re an excellent book reviewer—folks, <a href=\"https://overduepodcast.com/\">check out Andrew’s podcast</a>!—and I’d love to hear your take. What is the right way for a monstrous book-to-TV adaptation to slim down? How do you balance the need to tell that story with the need to be a coherent, functional, standalone adaptation?</p>\n</div>\n<div>\n<p><strong>Andrew</strong>: Seconded on the Whitecloak introduction. It would be very, very easy to make them dour and joyless pricks, since as a group they are typically the most interested in imposing their rigid idea of what \"goodness\" is onto characters who we already know to be fundamentally \"good.\" Making the most prominent Whitecloak—and our introduction to the organization writ large—a slimy, horny sadist who murders Aes Sedai with a smile is one of the strongest moments we get here.</p>\n<p>And that's sort of what you need to do, right? TV shows especially rely on this kind of shorthand, the ability to tell us what we need to know about a person or a group of people with a combination of visual cues and one or two characters. Obviously, some of a book's depth and complexity can be introduced later, once audiences have gotten a bit more comfortable. But in the early going in a show like this it's all about combining performances and visuals to create memorable first impressions. The Whitecloak sequences are great at this. The scenes where Moiraine or Lan stand and monologue at the rest of the characters for multiple minutes, less so.</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-lan-moiraine.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-lan-moiraine-980x653.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-lan-moiraine.jpg\">Lan (Daniel Henney) and Moiraine (Rosamund Pike) don't exactly match the characters' descriptions in the books, but the performances are spot-on.</a> (credit: Amazon Studios)</p></div>\n<div>\n<p><strong>Lee</strong>: Moiraine is kind of the primary driver of plot for this batch of episodes, too, and Rosamund Pike has to carry a lot on her blue-draped shoulders. She gets to kick off the story—without any Age of Legends prologue to speak of—and she sets the world’s stage for us. I swear I don’t want to make this an extended book-versus-movie thing, but it is worth commenting that even in the first few minutes, the show updates the books’ canon a bit—in the world of the <em>Wheel of Time</em>, souls are reborn again and again after they die, spun out by the Wheel in new bodies. And in the show, a man can be reborn as a woman, or a woman as a man—something that was not in the books (Aran’gar and Osan’gar notwithstanding—though folks who have never read the books don’t need to worry about the reference).</p>\n<p>Moiraine is hunting, as we’re told, for the Dragon Reborn—the reincarnation of the man who, thousands of years ago, “broke the world” and ushered in an age of chaos and darkness. Though the first Dragon was a man, the current Dragon Reborn could be anyone of a certain age. There are long-term plot implications here, and a bunch of the first season is concerned with leading the audience on about precisely who this Dragon is. All Moiraine knows is that it’s almost certainly one of our five main characters—the rougeish Mat, red-haired Rand, brooding Perrin, pensive Egwene, or Nynaeve, the village Wisdom (think half doctor, half person who punches you in the face for disturbing the peace).</p>\n</div>\n<div>\n<p><strong>Andrew</strong>: If there's one \"well actually\" moment I will entertain as a book reader, it's the revelation that Egwene or Nynaeve could be the Dragon Reborn. On the one hand, I really appreciate a lot of what the show is doing to add nuance to the books' dated and rigid gender roles. Two Rivers women in the books are intelligent and resilient, but they're also a bunch of arm-crossing braid-tugging foot-tapping scolds. Two Rivers women in the show, from the glimpse we see, maintain that same sense of community but also get to drink and party and have sex. Rand and Egwene are <em>doing sex to each other</em>. And explicitly putting Egwene and Nynaeve on even narrative footing with Rand, Mat, and Perrin serves to emphasize how central they will be to the rest of the story moving forward.</p>\n<p>On the other hand, the split between the male and female halves of the One Power is foundational to pretty much everything in the entire series (gender is strictly binary in Randland, though the show seems open to experimenting with this and I hope that it does). The Dragon Reborn is in danger, and Moiraine needs to find him, specifically because he is a man who will channel the corrupted male half of the One Power, dooming him to eventual madness. The last time the Dragon Reborn went mad, he snapped the world in half like a fresh Oreo. Even among people who believe he will save the world, there's a belief that he must be tightly controlled. This is, again, pretty foundational stuff. And I'm still not sure how the decision to mess with that is going to play out long-term.</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-nynaeve.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-nynaeve-980x653.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-nynaeve.jpg\">Nynaeve al'Meara (Zoë Robins) is a character the show gets a handle on pretty quickly.</a> (credit: Amazon Studios)</p></div>\n<div><strong>Lee</strong>: I agree—and there are some things in later episodes that really make me wonder how the One Power works in this adaptation. Though if we’re calling out changes, the one that stuck out to me was the fact that instead of making all three of The Boys (Mat, Perrin, and Rand) inept with The Ladies, Perrin (Marcus Rutherford) starts out married! He’s got a wife! And she’s not a wasting wallflower or nagging angry person—she’s an all-business blacksmith lady, who seems like she knows how to work the forge even better than Perrin does.</div>\n<div><strong>Andrew</strong>: A wife who the show tragically almost instantaneously murders so that Perrin can suffer from a Deep and Abiding Sadness. It's one of the show's cheapest shots, and it was my least favorite thing in all three of these episodes by kind of a lot!</div>\n<div>\n<p><strong>Lee</strong>: Yeah, they <a href=\"https://tvtropes.org/pmwiki/pmwiki.php/Main/StuffedIntoTheFridge\">stuff her into the fridge</a> <em>immediately</em>.</p>\n<p>Discussing this without trying to race through it to look at the narrative consequences is difficult—almost as difficult as adapting this series in the first place. And without spoiling things for non-book readers, Perrin’s choice about whether to “take up the axe” or “take up the hammer” makes up the majority of his character arc, and this is a difficult thing to see the consequences of. At first, I thought I was going to hate it—but the more I think about it, the more interesting it becomes. It’s fascinating to see these characters I’ve lived with in my head for 20+ years suddenly doing something new. I think I like it.</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-rand-perrin-mat.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-rand-perrin-mat-980x653.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-rand-perrin-mat.jpg\">Rand, Perrin, and Mat (Josha Stradowski, Marcus Rutherford, and Barney Harris) enjoying a rare moment of peace.</a> (credit: Amazon Studios)</p></div>\n<div>\n<p><strong>Andrew</strong>: That feeling of, \"Ooh, I am excited to see how they change this!\" is the healthiest attitude for a book reader to have going in, I think. The first season of <em>Game of Thrones</em> was a very straightforward, true-to-the-book adaptation of <em>A Game of Thrones</em>. The sheer length of <em>WoT</em> and how the scope and focus of the books change as they move forward meant that was always going to be a lot harder to do for <em>Eye of the World</em>. Honestly, for me, the fact that this show is happening at all is so wildly improbable that I am planning to just enjoy the ride. But that's a kind of trust that the creative teams behind these adaptations can easily lose, as David Benioff and D.B. Weiss did by the time <em>Game of Thrones</em> had slogged through to its last seasons.</p>\n<p>Zooming in a bit: what characters are working for you in these first three episodes? Who seems to have a handle on the character and who doesn’t? I have thoughts but I want to hear yours first.</p>\n</div>\n<div><strong>Lee</strong>: Let me start real quick with with our Main Five—Rand, Mat, Perrin, Nynaeve, and Egwene. They’re all perfectly adequate, though Nynaeve (Zoë Robins) and Mat (Barney Harris) are probably given the most to do. Everyone except Rand (Josha Stradowski) has some nice character-building moments (though I expect the community to be divided as hell by Perrin’s wife, and seeing Mat’s cheerful horse-trading dad turned into an alcoholic domestic abuser stings a bit). The “which one is the Dragon!?” misdirection is strong—so strong that a major interaction between Rand and his father Tam is cut entirely out of the first episode. (I’m sure the whole “you’re not really my son” bit will show up later, but its absence is jarring.)</div>\n<div><strong>Andrew</strong>: There are definitely crumbs here vis a vis Rand’s origins (“no one has red hair in the Two Rivers” is expressed at least once that I saw) but yeah one benefit of not being in Rand’s head for 95% of the story is that he can blend in with the rest of them a little more.</div>\n<div>\n<p><strong>Lee</strong>: On the Aes Sedai side, the ones we meet in the first few episodes are excellent—Moiraine is Moiraine, and I’d have to dig to find a real complaint about the way the character is portrayed. (The only critical thing I can think of is that Pike is maybe a little tall for the role, and that’s minor criticism indeed.) Lan (Daniel Henney) doesn’t really match my mental picture of “Brooding Conan-looking Man Mountain,” but he’s got a nimbleness and a careful, deliberate grace that I’m really enjoying. And he’s definitely got a face of planes and angles.</p>\n<p>How about you?</p>\n</div>\n<div><strong>Andrew</strong>: Yeah, he did not match up with Lan physically in my head, but the distance he maintains from all the non-Moiraine characters and the way he and Pike interact sold me on the performance. I think another early standout is Nynaeve, whose arc is tweaked for the show (she’s carried off by and escapes from Trollocs during the initial attack on Emond's Field and catches up with the rest of the party from there, rather than following of her own volition), but in ways that are consistent with her character in the books. She’s a bit older and more capable than the other Two Rivers-ians (??), she’s driven by anger but also by her compassion. She’s doing a good job.</div>\n<div><strong>Lee</strong>: She is definitely less of a sullen rage-filled harridan in the show—I don’t think she’s thumped anyone with a stick even once. So far.</div>\n<div>\n<p><strong>Andrew</strong>: There's time!</p>\n<p>The characters who have changed more are the ones who struggle more. Madeleine Madden, who plays Egwene, isn’t doing anything <em>wrong</em>, but she hasn’t left much of an impression yet. And Harris is just coming across as flat and unlikeable as Mat. Some of that might be the show’s fault! Because as you mentioned, show-Mat is substantially more unsavory and less Han Solo-ian than book-Mat. But I do wonder if the onscreen struggles contributed at all to his <a href=\"https://deadline.com/2021/09/the-wheel-of-time-donal-finn-to-play-mat-cauthon-in-recasting-on-amazon-series-as-barney-harris-not-returning-for-season-2-1234840887/\">recasting for season two</a>.</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-mat-fain.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-mat-fain-980x653.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-mat-fain.jpg\">Mat and Padan Fain (Johann Myers), who appears in the first episode but hasn't (yet) reappeared.</a> (credit: Amazon Studios)</p></div>\n<div><strong>Lee</strong>: Yeah—too early to tell, but that would definitely follow from what we’ve seen so far. There’s certainly lots for him to do, since we get to Shadar Logoth relatively quickly and it’s the second big setpiece after Emond’s Field, and from the dagger springs a big chunk of Mat’s character arc for the first few books.</div>\n<div><strong>Andrew</strong>: To my memory we don’t actually get a PoV chapter from Mat until book <em>three</em>, so it’s also possible that if you were just reading <em>EotW</em> to research the role there would not be a whole lot to go on there.</div>\n<div><a name=\"page-2\"></a></div>\n<div><strong>Lee</strong>: Let’s address the giant gauzy elephant in the room: weaving the One Power. I am eager to hear another long-time book reader’s take on how it’s represented in the show—and we get to see a whoooooole lot of weaving when Moiraine throws down against the Trollocs on Winternight. Does it work for you?</div>\n<div><strong>Andrew</strong>: So… the One Power. Sometimes the show is using it to build up a cool set-piece, I suppose? The bit where Moiraine is pulling bricks out of a building to throw at Trollocs is cool, even though maybe she could have caused less property damage by picking up regular rocks off the ground. And then other times you’re just kind of watching people whisper and move their hands. (That said I do think the title sequence does some visually neat things with the whole “weaving” theme. It ain’t the <em>Game of Thrones</em> title sequence, but that’s maybe an unfairly high bar to set.)</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-one-power.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-one-power-980x551.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-one-power.jpg\">The wispy bits of light signal that someone is channeling the One Power.</a> (credit: Amazon Studios)</p></div>\n<div>\n<p><strong>Lee</strong>: I <em>love</em> the title sequence. I haven’t fast forwarded through it yet, which is unusual for me.</p>\n<p>I’d always imagined the weaves as being different colors for each element, too—though at least so far, we haven’t really gotten a solid Aes Sedai-to-Novice level explanation of the different facets of the power and how the elements work. But I do like the way they’re shown on screen—and I’m also glad that the production has chosen to go with “subtle hand movements” for weaving, instead of crazy flailing. Robert Jordan’s prose is, to my recollection, a little ambiguous on exactly what kind of motions are employed, and I was a little worried that we’d get Aes Sedai looking like they were going all <em>Flashdance</em> as they did their thing.</p>\n</div>\n<div><strong>Andrew</strong>: There’s a bit of variation between Aes Sedai on the hand movement question in the books—some people can only throw fireballs by making physical throwing motions because that’s how they learned to do it. Which, as someone who is continually persecuted for my two-finger typing style, I understand.</div>\n<div>\n<p><strong>Lee:</strong> Indeed! And Eamon Valda seems to have capitalized on that with his whole “cutting off Aes Sedai hands” fetish. It’s not in the books, but man, it’s creepy and it works for me.</p>\n<p>I have one big reservation about what we see of the One Power—but I’ll hold that reservation until after we get a little more Logain screen time under our belts. I might be misreading things, but the show <em>might</em> be going to swerve in a very different direction here from the books when it comes to how gender and channeling works. Maybe. (Now you have to imagine me giving you my very best Aes Sedai cool knowing stare.)</p>\n</div>\n<div><strong>Andrew</strong>: We just haven’t met that many channelers yet, but yes, one Big Question that the Dragon Reborn misdirect raises is: what else has changed about the world and the magic system that makes it even <em>possible</em> for a woman to be the Dragon Reborn?</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-egwene-rand.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-egwene-rand-980x653.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/wot-egwene-rand.jpg\">Rand and Egwene (Madeleine Madden) having a heart-to-heart.</a> (credit: Amazon Studios)</p></div>\n<div>\n<p><strong>Lee</strong>: Exactly so. There's what I think might be a clue in the later episodes—we’ll get there!</p>\n<p>We’re getting pretty long here and I don’t think we’ve either of us really said if we <em>enjoy</em> it so far. I mean, I’m going to keep watching no matter what, because I’m a hopelessly devoted <em>WoT</em> sucker and also because I signed up to go on this journey with you for work so I’m getting paid, but I actually <em>am</em> enjoying it—in spite of the changes, which the neckbeard in me wants to keep calling out. The show is definitely taking a bold tack with how things are moving, striking out in a direction that is aslant from the books. And that’s okay!</p>\n</div>\n<div>\n<p><strong>Andrew</strong>: Yeah I think I mentioned this before but the route this thing took from book to screen was just so improbable that at the moment I am just enjoying that it exists at all. And I spend a lot of time thinking about and analyzing adaptations and why things get changed the way they do, so on a sort of detached academic level I am having a lot of fun with that.</p>\n<p>Jeff Bezos allegedly summoned this (and the upcoming <em>LotR</em> series, which I assume one or both of us will also be writing up) with <a href=\"https://www.gq.com/story/inside-amazons-wheel-of-time\">a demand for his own <em>Game of Thrones</em></a> (I imagine him screaming and stomping his feet like Veruca Salt demanding a goose that lays golden eggs). So far, I don’t think this is that. I find it hard to put myself in the head of a non-book-reader for this, but so far it’s a bit lore-dumpy and too many of the characters have yet to come into focus.</p>\n<p>But! I think there is a lot of <em>potential</em> here. And I’m really glad that, at a bare minimum, it has been given the runway of a second season to find its feet.</p>\n</div>\n<div><strong>Lee</strong>: That takes the pressure off—and also means we can watch this stuff without worrying about falling in love and then having that love taken away. (Good thing this show isn’t on Fox.)</div>\n<div><strong>Andrew</strong>: The network TV version of <em>Wheel of Time</em> is not something I want to see.</div>\n<div>\n<p><strong>Lee</strong>: This has been fun—and if you folks in the audience have enjoyed it, then good news: we’ll be back next week doing another one of these! Now that we’ve got this giant three-episode chunk out of the way, with all its necessary table-setting, we’ll likely be focusing next time on more episode specifics. There are definitely some interesting things ahead—especially if you’re amenable to allowing the adaptation to take its own path to get to the story’s eventual destination.</p>\n<p>May you always find water and shade, Andrew!</p>\n</div>\n<div><strong>Andrew</strong>: The Wheel weaves as the Wheel wills.</div>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/Wheel-icon-e1637336031883.jpg\" /><p>(credit: <a href=\"https://wot.fandom.com/wiki/Category:Chapter_art\">WoT Wiki</a>)</p></div>\n\n</div><p><a href=\"https://arstechnica.com/?p=1814073\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1814073&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"30deaeedfa995c9d102a513d965522a30c4ccbadb8fd11a4c085881c6f906a7c","category":"Tech"}