{"title":"Monitoring emerging pathogens using negative nucleic acid test results from endemic pathogens in pig populations: Application to porcine enteric coronaviruses","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306532","date":1720188000000,"content":"<p>by Ana Paula Serafini Poeta Silva, Guilherme Arruda Cezar, Edison Sousa Magalhães, Kinath Rupasinghe, Srijita Chandra, Gustavo S. Silva, Marcelo Almeida, Bret Crim, Eric Burrough, Phillip Gauger, Christopher Siepker, Marta Mainenti, Michael Zeller, Rodger G. Main, Mary Thurn, Paulo Fioravante, Cesar Corzo, Albert Rovira, Hemant Naikare, Rob McGaughey, Franco Matias Ferreyra, Jamie Retallick, Jordan Gebhardt, Angela Pillatzki, Jon Greseth, Darren Kersey, Travis Clement, Jane Christopher-Hennings, Melanie Prarat, Ashley Johnson, Dennis Summers, Craig Bowen, Kenitra Hendrix, Joseph Boyle, Daniel Correia Lima Linhares, Giovani Trevisan</p>\r\n\r\nThis study evaluated the use of endemic enteric coronaviruses polymerase chain reaction (PCR)-negative testing results as an alternative approach to detect the emergence of animal health threats with similar clinical diseases presentation. This retrospective study, conducted in the United States, used PCR-negative testing results from porcine samples tested at six veterinary diagnostic laboratories. As a proof of concept, the database was first searched for transmissible gastroenteritis virus (TGEV) negative submissions between January 1<sup>st</sup>, 2010, through April 29<sup>th</sup>, 2013, when the first porcine epidemic diarrhea virus (PEDV) case was diagnosed. Secondly, TGEV- and PEDV-negative submissions were used to detect the porcine delta coronavirus (PDCoV) emergence in 2014. Lastly, encountered best detection algorithms were implemented to prospectively monitor the 2023 enteric coronavirus-negative submissions. Time series (weekly TGEV-negative counts) and Seasonal Autoregressive-Integrated Moving-Average (SARIMA) were used to control for outliers, trends, and seasonality. The SARIMA’s fitted and residuals were then subjected to anomaly detection algorithms (EARS, EWMA, CUSUM, Farrington) to identify alarms, defined as weeks of higher TGEV-negativity than what was predicted by models preceding the PEDV emergence. The best-performing detection algorithms had the lowest false alarms (number of alarms detected during the baseline) and highest time to detect (number of weeks between the first alarm and PEDV emergence). The best-performing detection algorithms were CUSUM, EWMA, and Farrington flexible using SARIMA fitted values, having a lower false alarm rate and identified alarms 4 to 17 weeks before PEDV and PDCoV emergences. No alarms were identified in the 2023 enteric negative testing results. The negative-based monitoring system functioned in the case of PEDV propagating epidemic and in the presence of a concurrent propagating epidemic with the PDCoV emergence. It demonstrated its applicability as an additional tool for diagnostic data monitoring of emergent pathogens having similar clinical disease as the monitored endemic pathogens.","author":"Ana Paula Serafini Poeta Silva","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"30e5688856aa2584f5205cf19815b4795743514acc226e4f83725653052d1726","category":"Interdisciplinary"}