{"title":"Analysis of the Spatial-Temporal Characteristics of Vegetation Cover Changes in the Loess Plateau from 1982 to 2022","link":"https://www.preprints.org/manuscript/202410.1870/v1","date":1729757523000,"content":"The Loess Plateau is one of the most severely affected regions by soil erosion in the world, with a fragile ecological environment. Vegetation plays a key role in the region's ecological restoration and protection. Most existing studies focus on the trends of vegetation cover change, while fewer studies investigate the driving factors or only conduct quantitative analyses. This study uses the Geodetector (Geographic Detector Model) to assess the impact of natural and human factors such as temperature, precipitation, soil type, and land use on vegetation growth, revealing the characteristics and driving mechanisms of vegetation cover changes on the Loess Plateau from 1982 to 2022. It also quantitatively calculates the influence of different factors. The findings indicate that vegetation cover on the Loess Plateau has generally risen from 1982 to 2022, but there was a noticeable difference around 2000. The annual mean slope of vegetation cover from 1982 to 2000 was 0.00129, which increased to 0.01075 from 2000 to 2022. The Geodetector indicates that the factors with the greatest impact on vegetation cover in the Loess Plateau are temperature, precipitation, soil type, and land use, and the interaction between these factors has a greater effect on vegetation cover than any single factor alone. This study identifies the ideal ranges or types for vegetation growth on the Loess Plateau over four time periods, offering a scientific basis for soil restoration and soil and water conservation efforts in the area.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"30e5e8c405e0c4d8ddc4e118185d09104b77cd7b286fb9685129f0cd0f5c19ec","category":"Interdisciplinary"}