{"title":"The Frozen Trail to Thorong-La – Ryan Wilson","link":"https://theradavist.com/2021/04/the-frozen-trail-to-thorong-la/?utm_source=rss&utm_medium=rss&utm_campaign=the-frozen-trail-to-thorong-la","date":1618228847000,"content":"<p><em>(note: this story took place before the pandemic)</em></p>\n<p>The Annapurna circuit has been around as an established trekking route for over 40 years, but parts have existed for trade between the Tibetan plateau and the Manang and Muktinath valleys for far longer. Today it’s one of the most famous places to hike in the world, and one of Nepal’s primary tourist draws. Over the last decade or so it has become famous for the herds of backpackers and yaks that often fill the trail during the peak seasons (spring and fall), and slowly the trail is being replaced by roads to make it easier to bring supplies to these tourist-filled villages.<span></span></p>\n<p>Navigating through trail traffic isn’t exactly my idea of a great time, so despite being aware of the stunning scenery that the Annapurna Circuit had to offer, I wasn’t sure that I’d ever be that compelled to do it. It wasn’t until reading about folks making the trip in early winter that the idea started to become appealing. After leaving Central Asia, we ended up with a perfect window of time in December to give it a shot when, yes, it would be absolutely freezing, and there’s always the chance of snow despite the winters here being fairly dry, but the quiet trail would make it all worth it… in theory.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-16.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>One of the things that makes this trail unique is that there really is no need to haul a tent, cooking equipment, or even food beyond a few snacks for the day. A sleeping bag is still crucial for the cold nights, but tea houses and villages are dotted along the route that offer up beds to sleep for the night, a hot meal, and some basic supplies. If you’re lucky they’ll even have a nice heater in the common area to warm up after a day on the trail.</p>\n<p>We’d be leaving from the tourist hub city of Pokhara and since we’d eventually return to the same place at the end of the loop, we were able to trim down our setups quite a bit, leaving any unnecessary items behind. Being able to camp and cook wherever we want and get far away from things like hotels and wifi is great, but having a bike with 20+ pounds trimmed off of it compared to the usual setup is pretty darn nice sometimes too, so I’ll take it while I can get it!</p>\n<p>While the vast majority of the people who walk the route do so counter-clockwise, we decided to go clockwise. This would have us climbing comfortably on mixed-surface roads all the way to the village of Muktinath at 3,800 meters, and would give us the longer and more rideable single-track section of the trail as a descent…. Again, in theory. The downside would be that the relentlessly steep push to the summit on this side of the pass, combined with the lack of teahouses to stay in would make the summit day a fairly grueling one.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-13.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The first couple of days along the route started not too dissimilar from our time riding in the rolling mid-hills from Kathmandu, but eventually, the terrain began to grow around us. The glaciated peaks of the Himalayan mountains started to peek out from behind the surrounding hills and eventually became an omnipresent companion in our ascent toward the mighty Thorong-La.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/03/RyanWilson_Annapurna-82.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>While we were still at around 2,750 meters (~9,000 feet) below the top of the pass that we’d have to reach to complete the circuit, the predictably unpredictable high mountain weather struck in the village of Jomsom with a full day of snowfall. No doubt this would throw a wrench in our plans as the bitter-cold nights meant this snow would be very slow to melt, and would likely be covering most of the trail for months. By this point, we’d heard plenty of stories about the tragedy in 2014 where a blizzard took the lives of at least 43 people on this trail, so we weren’t going to throw ourselves into a bad situation, but we weren’t ready to give up just yet, so we decided to wait it out in Jomsom and reassess the conditions later.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/03/RyanWilson_Annapurna-83.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>A few days and helpings of Dal Bhat later, the road up to the final town on our side of the pass became rideable, so we continued to push in that direction, crossing our fingers that we’d soon begin to hear that people are crossing the pass again. On our second day in Muktinath, the first group of hikers came down from the pass since the storm looking absolutely wrecked, telling stories about whiteout conditions and breaking trail through knee-deep snow. The next day, a few more freshly battered faces arrived and the stories of brutal winds and breaking trail were more of the same.</p>\n<p>In the coming days, the winds were forecast to die down a bit, so we decided to plan our crossing attempt around the best window of weather, hoping that a few more groups of hikers would pass and pack the snow down on the trail a bit, making it a little easier to haul the bikes. <span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-43.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>With the pedals off our bikes and crampons on our shoes, we set off to attempt the final 2,000-meter icy push to the summit in three stages. First, we headed up to the final teahouse at 4,100 meters, pushing our bikes up an extra couple hundred meters before stashing them and returning down to the teahouse for the night. The next day we hiked up to the bikes again, this time pushing them up beyond 5,000 meters before stashing them again and hiking back down for another night in the teahouse. This method gave us a chance to more gradually acclimatize, which is another tricky element when doing this route clockwise.</p>\n<p>On the final morning, we woke up hours before the crack of dawn and painfully removed ourselves from the warmth of our sleeping bags. The temperature was in the -15 to -20ºC range in the tea house so we scarfed down our noodle stirfry breakfast as fast as humanly possible… an un-winnable race against time before they’d inevitably be ice cold mere moments after coming off of the steaming pan.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-49.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-44.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We hit the trail and made good time marching our way back up to where we stashed our bikes the previous evening. With the sun still hidden behind the mountain, there’d be no time or desire to stop so we had all of the motivation we needed to keep moving. When you stop, you freeze. Thankfully, the power of the sun at these altitudes is strong, so once the sun hit us after a couple of hours on the trail, the temps quickly climbed and the feeling was restored to our extremities.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-50.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We finally made it to the 5,416-meter (17,769 ft) summit on a perfect-weather day and took a moment to celebrate reaching the highest altitude any of us had been, which seemed to be in serious doubt just a few days prior. <span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/03/RyanWilson_Annapurna-91.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Still, we knew it wouldn’t be easy-street from here just because we made it the route’s high-point. The other side down to Manang is known to get far more snow than the side we climbed, so it would still take some careful navigating of slick slopes before we’d be cruising on dry land again.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-61.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The scenery along our multi-day descent was undoubtedly some of the most spectacular in the world. 8,000-meter peaks and dramatic valleys dominate the landscape. The constant onslaught of swing bridges offer 360-degree views at dizzying heights. While the snowy conditions meant we didn’t exactly get the ripping Himalayan single-track descent we dreamt of, we did get a few hints of it on our way toward Manang to re-join the road.</p>\n<p>The valley narrowed as we dropped in altitude and slowly the patches of icy road became less and less frequent. Soon the road was chiseled from the side of a cliff, and waterfalls were pouring from the sky. <span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-67.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-68.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The temperatures were rising with every meter we dropped and the villages were slowly returning toward the brightly colored hues that had become so familiar.</p>\n<p>After reaching Pokhara and bidding farewell to Fotis, Chrissa and I decided to head further down toward the jungle to take our chances at seeing some Nepali wildlife in Chitwan National Park for a few days. It doesn’t take long here, within a few minute’s walk from town you can spot wild rhinos and crocodiles relaxing by the river. Some rhinos even lethargically stroll straight through the town’s streets daily, seemingly oblivious to the strange human behavior that surrounds them. We snapped photos while they casually grazed on the grass and dogs barked at their heels.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-74.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/02/RyanWilson_Annapurna-78.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>While these majestic beasts seem quite apathetic toward interactions in town, we witnessed their wild side first-hand one day as we decided to take the long way from our hotel to a cafe in the center of town. It started as an innocent stroll along the river that separates the town from the National Park. We’d taken this same trail numerous times before, and while you’re always cautiously aware of the <em>potential</em> for wild tigers, elephants, leopards, and rhino roaming these areas, it’s so close to the town and so frequently used by tourists and locals that it still feels quite unlikely to see anything too crazy.</p>\n<p>We approached the bank of the river and suddenly heard a strange noise that sounded a bit like an elephant on the other side of the river, back in the jungle. This was just outside of an elephant sanctuary and we had seen these (ethically dubious) elephant “tours” coming through here previously where groups of tourists ride on the backs of trained elephants with a guide, so we didn’t think much of it initially. <span> </span></p>\n<p>Eventually, these noises began to sound more violent, and the trees started swaying back and forth like something out of Jurassic Park. Before we could even understand what was happening, two giant rhinos came raging out of the jungle in a battle between the two for territorial supremacy. After seeing these animals walking through the town so casually, it was shocking to see the speed that they could move at when they’re motivated (Google tells me 55 km/h).  We immediately started to back away when suddenly one of the rhinos changed course and sprinted into the river, heading straight — the fuck — for us.</p>\n<p>Our startled retreat turned to something of a panicked sprint. At first, we went straight in the opposite direction toward the more densely covered jungle trail, hoping they’d stay out in the open area that surrounds the river, but as it became clear that the rhinos were following us into the bush we turned toward a different trail to sprint across an open field toward the Elephant sanctuary, which was just within sight, but still felt so far away.</p>\n<p>I can unequivocally say that I’ve never felt slower in my life than at this exact moment. After a few dozen strides or so I snuck a single glance behind me to see one rhino charging straight toward us just a handful of meters back, with the other rhino right on its tail. There were a couple of hairy moments where I didn’t have particularly high hopes for how this might play out, but just before they would have caught up to us they turned hard-right and dashed back to the river where one of the male rhinos eventually conceded bloody defeat at the hands (err.. horn) of the other.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/03/RyanWilson_Annapurna-81.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We stumbled toward the Elephant sanctuary with our hearts racing a mile a minute to see a small crowd of tourists and locals had formed to see what the commotion was all about. One local jungle guide who had seen the tail end of our “situation” play out explained that the rhino who was losing its battle for dominance, likely tried to get near us as a distraction technique to get the other rhino off of its back.</p>\n<p>We were just thankful they spared us.</p>\n<p>If I’m honest, we had our fair share of qualms with our time in Nepal. From the hazy, dust-filled air in the mid-hills, to the many signs of the Annapurna region being overly exploited by mass tourism. While Nepal isn’t without its fair share of downsides as a bike touring destination (bring a serious granny gear!), I can’t imagine there are many places on earth where you can go from riding single-track amongst 8,000-meter glacial giants to being chased by wild rhinos in a matter of days. <span> </span></p>\n<p> </p>\n<p></p>","author":"Ryan Wilson","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"30e78a182acf4bd1d0e60fdac5f35de2de111c06689212100318d7777114660d","category":"Cycling"}