{"title":"Doubly Fed Induction Machine Models for Integration into Grid Management Software for Improved Post Fault Response Calculation Accuracy","link":"https://www.preprints.org/manuscript/202409.1746/v1","date":1727088302000,"content":"With the escalating proliferation of wind power plants, the imperative focus on system robustness and stability intensifies. Doubly fed induction machines (DFIMs) are extensively employed as generating units in land-based wind power plants due to their performance advantages. While the stator windings of DFIMs are directly connected to the power system, the three-phase rotor windings are connected via power converters, rendering these units highly vulnerable to voltage disturbances. During faults, voltage drops at the stator terminals lead to elevated voltages and currents on the rotor side due to electromagnetic coupling between stator and rotor, potentially damaging rotor insulation and costly power electronics. Historically, to safeguard equipment, wind power plants employing distributed energy resources such as DFIMs were disconnected from the grid during faults—an unsatisfactory solution given the burgeoning number of these installations. Consequently, grid operators and IEEE standard 2800 mandate fault ride-through or low voltage ride-through capabilities to maintain supply adequacy during recovery from disturbances and voltage fluctuations. This paper provides an overview of diverse techniques devised to enable fault ride-through for DFIMs. Additionally, it scrutinizes existing approaches in modeling DFIM behavior during faults and introduces an approach tailored specifically for DFIMs, detailing its comparative advantages and limitations vis-à-vis established models. A conclusion about the necessity for more precise models in comparison to the existing ones is provided.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"30ebdfed79f26bbb65268eac94fd4dc00b19684813f3bafde0beb350368a6b6e","category":"Interdisciplinary"}