{"title":"320 Ninety-nine years of accomplishment by Canadian Animal Scientists","link":"https://academic.oup.com/jas/article/102/Supplement_3/175/7757277?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The earliest ancestor of the Canadian Journal of Animal Science traces back to the Western Canada Society of Agronomy which was established in 1918. The Western Canada Society of Animal Production was formed in 1925 and the Eastern Society was established in 1926. These were the first vestiges of the Canadian Society of Animal Production which arose as result of the amalgamation of the chapters in 1951. The Agricultural Institute of Canada established the journal “Scientific Agriculture” in 1921, which was renamed the Canadian Journal of Agricultural Science in 1953. In 1957, the journal was split into plant, soil and animal sections and the Canadian Journal of Animal Science (CJAS) became the official publication of the Canadian Society of Animal Science (CSAS). Selecting the top Canadian animal scientists over the last 99 yr is no easy task and is marked with biases and subjectivity. Time is a major consideration, as in general contributions become less visible with time, even though they may have formed the foundation of future advances. Expectations of society members has also evolved over time, with a focus on the establishment of animal husbandry practices and Canada’s livestock population from the 1920s to the 1960s, refinement in nutrition and animal breeding practices in the 1960s to the 1980s, developments in molecular biology and genomics in 1980s to the 2000s and in precision animal production, animal welfare and environmental sustainability from the 2000s to the present day. To identify the top scientists in Canada, the editors-in chief of CJAS sent out letters to every federal and university animal science department in Canada to nominate four individuals whose contributions were felt to be particularly noteworthy. This exercise clearly demonstrated that Canadian Animal Scientists have made significant contributions in all fields at a global level of recognition. This presentation will introduce you to a few of these individuals. There is no doubt that the contribution of all Canadian animal scientists has had a major role in the development and success of the Canadian livestock industry.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"30ee73dbe4a86cd61b3d19152111d09546e60b6751394ac50f967e63852070c3","category":"Environment"}