{"title":"Questionable Rumor Claims iOS 17 Features Redesigned Maps Lock Screen","link":"https://www.macrumors.com/2023/05/08/ios-17-maps-lock-screen-interface/","date":1683559713000,"content":"iOS 17 will introduce a new iPhone experience for Apple Maps that integrates detailed turn-by-turn directions to the Lock Screen without taking over the display, claims a leaker with alleged insider information.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/ios-17-lock-screen-analyst941.jpg\" alt width=\"4096\" height=\"3186\" /><div><em>Concept render shared by Analyst941</em></div>\r<br />\nCurrently in iOS 16, when real-time Maps directions are active and the iPhone is locked, the Maps app takes over the screen and all other Lock Screen elements are hidden. According to <a href=\"https://twitter.com/analyst941/status/1655486926047019008?s=20\">Twitter account Analyst941</a>, this will change in iOS 17, with Maps directions including live visual map data taking over a portion of the Lock Screen, but with app notifications and the Camera and Flashlight buttons remaining at the base of the display.\r<br />\n\r<br />\nThe leaker claims that app notifications will still be accessible by swiping up on the screen, while the physical act of unlocking the iPhone will remain a seamless transition. According to Analyst941, the new Maps Lock Screen interface will be coming to \"all iPhones.\"  \r<br />\n\r<br />\nThis is the first time we have heard about specific changes to Maps for iOS 17, and the leaker has made several other claims about iOS 17 that have yet to be corroborated. This rumor, and <a href=\"https://www.macrumors.com/guide/analyst941/\">others like it</a>, should therefore be taken with a grain of salt. \r<br />\n\r<br />\n<em>Bloomberg</em>'s Mark Gurman has <a href=\"https://twitter.com/markgurman/status/1648381316302360576\">expressed doubt</a> about Analyst941's claims and believes that some of the information is inaccurate. We'll know more about their accuracy in just under a month when Apple unveils ‌iOS 17‌, watchOS 10, and other updates at the June 5 WWDC keynote.<div>Tags: <a href=\"https://www.macrumors.com/guide/apple-maps/\">Apple Maps</a>, <a href=\"https://www.macrumors.com/guide/analyst941/\">Analyst941</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/08/ios-17-maps-lock-screen-interface/\">Questionable Rumor Claims iOS 17 Features Redesigned Maps Lock Screen</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/questionable-rumor-claims-ios-17-features-redesigned-maps-lock-screen.2388985/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"30f2b187f42a0d209aa901913bc01b4a19ce794d56c9b3ce20c689a601259b9c","category":"Apple"}