{"title":"Survey Finds Both Offensive, Defensive Drivers for Multi-Cloud","link":"https://www.hashicorp.com/blog/hashicorp-state-of-cloud-strategy-survey-offensive-defensive-drivers-multi-cloud","date":1629302400000,"content":"<p>In an unlikely bit of synchronicity, the fate of two recent government cloud computing contracts seemed to reinforce the findings of the <a href=\"https://www.hashicorp.com/state-of-the-cloud\">HashiCorp State of Cloud Strategy report that we released last week</a> — all pointing to some monumental shifts in what kinds of computing environments are now considered de facto standards.</p>\n<h2><a href=\"#forcing-their-own-hand-toward-multi-cloud\">»</a><a></a>Forcing Their Own Hand Toward Multi-Cloud</h2>\n<p>First, <a href=\"https://www.cnbc.com/2021/07/06/pentagon-cancels-10-billion-jedi-cloud-contract.html\">the Pentagon canceled</a> the $10 billion JEDI (Joint Enterprise Defense Infrastructure) contract, which had been hotly contested by AWS and Microsoft Azure, to modernize the Department of Defense’s IT operations by moving them to the cloud. The contract would have moved the DoD to the cloud of whichever vendor won the bid. That was Microsoft originally, but Amazon sued, claiming bias against Jeff Bezos. Last month the Pentagon canceled JEDI altogether, instead planning to open a new multi-vendor cloud computing contract that both companies would likely get a piece of, essentially announcing that the DoD would be moving forward with a multi-cloud environment.</p>\n<p>Perhaps sensing the winds were shifting, <a href=\"https://www.cnbc.com/2021/08/12/microsoft-challenges-nsa-cloud-contract-reportedly-awarded-to-amazon.html\">Microsoft filed a protest</a> over a separate $10 billion contract, this one codenamed “WildandStormy,” which had been previously awarded to Amazon to modernize the National Security Administration’s classified data storage. If this and other government megadeals play out in a similar way, the days of immense winner-take-all cloud contracts — and the homogeneous, single-cloud environments that would likely come with them — could become a thing of the past. Multi-cloud, with all of its pros and cons, would be not merely an option, but the day-to-day reality for these parts of the federal government.</p>\n<h2><a href=\"#enterprises-agree-multi-cloud-is-here\">»</a><a></a>Enterprises Agree: Multi-Cloud Is Here</h2>\n<p>This trend isn’t so shocking, especially when combined with what we heard in HashiCorp’s inaugural <a href=\"https://www.hashicorp.com/state-of-the-cloud\">State of Cloud Strategy Survey</a>. Most of the more than 3,200 respondents were from enterprises (only 8% came from the public sector), and an overwhelming 76% of them currently employ a multi-cloud architecture (more than one cloud, public or private). In two years, almost 9 in 10 say they will do so. And while you might think HashiCorp survey respondents (who came from our HashiCorp opt-in database) are more cutting edge than most enterprise IT users, the survey actually reached a pretty <a href=\"https://www.hashicorp.com/state-of-the-cloud#methodology\">broad cross-section</a>.</p>\n<h2><a href=\"#what-s-driving-multi-cloud\">»</a><a></a>What’s Driving Multi-Cloud?</h2>\n<p>Unlike the agencies mentioned above, enterprises are not being driven by multi-billion dollar government contract negotiations to make their multi-cloud decisions. So, what <em>is</em> driving them? Our survey pointed to several things. One was indeed to avoid single cloud vendor lock-in (30% of respondents). But this seems like a defensive move and one that doesn’t take into account what is best for the applications that you’re trying to support with your cloud infrastructure.</p>\n<p>HashiCorp Co-Founder and CTO <a href=\"https://thenewstack.io/the-4-definitions-of-multicloud-part-1-data-portability/\">Armon Dadgar has talked</a> about how the reasons for choosing multi-cloud are wide-ranging and diverse, just like its use cases. For example, if it’s portability companies are looking for, you have to take the various types of portability you’re looking for into account, ranging from portability of data to workloads to traffic to the portability of workflows themselves.</p>\n<p>The top reason in our survey, though, was <a href=\"https://www.hashicorp.com/state-of-the-cloud#multi-cloud-brings-multiple-benefits,-led-by-digital-transformation\">digital transformation</a> (picked by 34%), and the rest of the reasons splintered across the spectrum. There are definitely several choices that show defensive concerns (cost reduction at 28% and operational efficiency at 19%), but many demonstrate a drive to improve and accelerate. Respondents said they were looking for a way to enable scaling (25%), to use emerging technologies (19%), and to deliver value to the business (19%). Probably the most telling, however, is that “we had no choice” was one of the least selected responses (5%). Multi-cloud is not something our respondents fall into. They’ve chosen it.</p><img src=\"https://www.datocms-assets.com/2885/1629236478-top-drivers.png\" /><h2><a href=\"#what-s-holding-back-cloud-efforts\">»</a><a></a>What’s Holding Back Cloud Efforts?</h2>\n<p><a href=\"https://www.hashicorp.com/state-of-the-cloud#cost,-skills-shortages,-workflow-issues-among-top-cloud-challenges\">Costs, security, and the lack of in-house skills put a damper on all of this enthusiasm</a>. Lack of skills was a top-three cloud inhibitor (selected by 41%), but rockets to the top of the list (selected by 57%) when we asked about the biggest issues for putting multi-cloud into actual operation. (This is one reason we at HashiCorp offer <a href=\"https://cloud.hashicorp.com\">HashiCorp-managed versions of our products</a>, provide extensive <a href=\"https://learn.hashicorp.com\">free product education on our Learn site</a>, and work closely with <a href=\"https://www.hashicorp.com/partners/find-a-partner?type=integrators\">system integrators worldwide</a> to help with customer implementation and ongoing operations.)</p><img src=\"https://www.datocms-assets.com/2885/1629236474-top-challenges.png\" /><p>Different industries have historically had diverse issues with their IT focus, and this was borne out by the survey, too. Respondents from entertainment and media, telecommunications, and software or services organizations put cost at the top of their list of cloud inhibitors. Public sector and consumer goods and retail were most worried about their lack of skills (which means that whoever wins any of the government contracts mentioned earlier is going to need to provide a corresponding truckload of implementation and training services). Financial services and healthcare/biotech pointed to security, as you might expect. Each one of these top cloud concerns was a pretty overwhelming choice, by the way, selected by 50-60% of the respondents from those industries.</p><img src=\"https://www.datocms-assets.com/2885/1629236482-top-inhibitors.png\" /><h2><a href=\"#this-year-s-wildcard-the-covid-19-pandemic\">»</a><a></a>This Year’s Wildcard: the COVID-19 Pandemic</h2>\n<p>The past year has had an added wrinkle: complexities from the COVID-19 pandemic. And <a href=\"https://www.hashicorp.com/state-of-the-cloud#cloud-is-not-just-a-pandemic-response\">the impact of COVID on cloud adoption has definitely been complicated and nuanced</a>. Knowing it was going to be top of mind, we asked about it specifically and our survey revealed several notable effects.</p>\n<p>The pandemic was cited as a multi-cloud driver by just 7% of respondents, yet more than half said COVID had accelerated their cloud or multi-cloud adoption. The implication is that the pandemic isn’t the core reason for the move to cloud, but it often pushed things forward. However, 46% of respondents said COVID didn’t impact their cloud efforts, perhaps again suggesting that cloud wasn’t solely a pandemic response — those plans were already underway.</p>\n<p>COVID seems to have sped up cloud efforts much more for the larger organizations. High COVID-19 impacts — shifting planned cloud efforts forward by 2 years or more — were more than twice as common in large enterprises (14%) than in small businesses (5%). Only 32% of large enterprises said COVID-19 did not impact their digital transformation timelines, compared to well over half of small businesses (58%).</p>\n<p>Specifically, COVID is accelerating two technology areas the most: infrastructure as code (noted by 49% of respondents) and container orchestration (41%). All other technology areas were mentioned by a third or less of the respondents: compliance and governance (33%), network infrastructure automation (33%), and self-service infrastructure (32%). More generally, 39% of respondents said COVID did cause them to use more open source software.</p>\n<h2><a href=\"#multi-cloud-benefits-are-showing\">»</a><a></a>Multi-Cloud Benefits Are Showing</h2>\n<p>As an industry, we will be picking apart the impact of COVID for a long time to come, but the broader trend seems to hold regardless of how strong of an impact the pandemic has had: multi-cloud is real. It’s being considered, it’s being adopted, and it’s delivering. More than half of the respondents in our survey (53%) said multi-cloud is helping them achieve their business goals (and only 18% said it wasn’t). And when you look at company size, it’s even more positive for large organizations (5,000 employees and up):  64% of these respondents claimed the move to multi-cloud helped them hit their goals.</p>\n<p>We consider all of these findings to be a compelling snapshot of what’s going on right now, and are very interested to hear industry feedback and commentary about the results. Plus, we plan to run this survey annually, which should enable us to track shifts over time. Take a look at<a href=\"https://www.hashicorp.com/state-of-the-cloud\"> the whole survey</a> for insights into everything from <a href=\"https://www.hashicorp.com/state-of-the-cloud#multi-cloud-is-tightly-connected-to-other-modern-technology-initiatives\">the technologies connected to multi-cloud</a> to <a href=\"https://www.hashicorp.com/state-of-the-cloud#infrastructure-automation-tools-are-critical-for-almost-everyone\">the critical role of infrastructure automation tools</a>.</p>","author":"Jay Fry","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"30fa0c0d0ebe37b0415b69881b31a3db74966201b49e5241850f6422bcf28a52","category":"Tech"}