{"title":"After being demoted and forced to retire, mRNA researcher wins Nobel","link":"https://arstechnica.com/?p=1972598","date":1696273569000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/GettyImages-1701994937-800x533.jpeg\" alt=\"Katalin Karikó and Drew Weissman.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/GettyImages-1701994937-scaled.jpeg\">Enlarge</a> <span>/</span> Katalin Karikó and Drew Weissman. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/katalin-karik%C3%B3-and-drew-weissman-speak-during-a-press-news-photo/1702016517\">Mark Makela / Stringer</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Biochemist Katalin Karikó and immunologist Drew Weissman won the Nobel Prize in Physiology or Medicine Monday for their foundational research showing that chemical modifications to the molecular building blocks of messenger RNA (mRNA) could enable its use for therapeutics and vaccines—a realization crucial to the rapid development of the life-saving mRNA COVID-19 vaccines during the deadly pandemic.</p>\n<p>The pair's prize-winning and tenacious work on different types of RNA culminated in <a href=\"https://www.cell.com/immunity/fulltext/S1074-7613(05)00211-6\">a 2005 breakthrough study</a> showing that chemical modifications of mRNA bases (nucleosides)—adenine (A), cytosine (C), uracil (U), and guanine (G)—could keep them from igniting innate immune responses and inflammation reactions, which had foiled previous efforts to use mRNA for therapeutics.</p>\n<p>In our cells, mRNA is an intermediate molecule, a single-stranded copy of coding from the genes in our DNA blueprints that is then translated into functional proteins. (DNA uses bases A, C, G, and thymine (T), which is structurally similar to RNA's U.) The mRNA is copied (aka transcribed) from DNA in a cell's nucleus and then moves to the cytoplasm for its code-deciphering translation into proteins. Thus, mRNA is critical for protein production and is more accessible than DNA—features that made it an appealing target for developing therapeutics.</p></div><p><a href=\"https://arstechnica.com/?p=1972598#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1972598&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"30fab6f54509c0a94f2228f57a158ee60454ffc8bbba10957cfe8f84ac7588fe","category":"Tech"}