{"title":"Relative efficiency of hunting methods during an incomplete Sitka black‐tailed deer eradication on Haida Gwaii, Canada","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12312?af=R","date":1708934400000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/bcbc47b4-1d36-46a9-9c69-d531dfa686e2/eso312312-toc-0001-m.png\" alt=\"Relative efficiency of hunting methods during an incomplete Sitka black-tailed deer eradication on Haida Gwaii, Canada\" />\n<p>The Llgaay gwii sdiihlda eradication project was initiated to halt and reverse biodiversity loss on six islands on Haida Gwaii and was an incomplete eradication attempt. Hierarchical Bayesian integrated removal models estimated hunting method efficiency and found that boat hunting was the most efficient method used at higher densities (2–30 deer/km<sup>2</sup>) and indicator dog hunting was most efficient at lower densities. The effort required to attain 90% versus 100% completion of the eradication varied by method; for hunting with indicator dogs the last 10% of the deer would require 14% of the total effort while for helicopter hunting it would take 75% of the total effort.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nInvasive species are reducing global biodiversity. The Llgaay gwii sdiihlda—Restoring Balance project was initiated to halt and reverse biodiversity loss on six islands on Haida Gwaii, Canada through the eradication of invasive Sitka Black-tailed deer (<i>Odocoileus hemionus sitkensis</i>).\n\nInvasive deer were killed using various hunting methods including bait station, boat, aerial and indicator dog hunting as well as a combination of bailing dogs with boat and aerial hunting. Cost was quantified in terms of helicopter hunting hours ($1965 CAD/hr at the time of the study) to facilitate comparisons. Efficiency was quantified as the expected number of deer per helicopter hour.\n\nHierarchical Bayesian integrated removal models were used to estimate the change in efficiency of the various hunting methods with deer density based on a power function. The models used the number of scent trail detections by dogs at the end of the study to help parameterise the population density.\n\nAt densities between 2 and 30 deer/km<sup>2</sup>, boat hunting was estimated as the most efficient method while at lower densities indicator dog hunting was most efficient.\n\nThe eradication was incomplete. The estimated cost to completion using indicator dog hunting for each island was 43 helicopter hours (~$84,000) on Ramsay Island (95% CI = 19–128), 3.9 helicopter hours on Murchison Island (95% CI = 0.56–18) and no additional hours on House (95% CI = 0–1.6) though the selected method would likely have been indicator dogs with combined hunting due to the variable terrain.\n\nLessons learned: DNA connectivity analysis can be used to determine project durability, pilot studies to confirm method efficiency in local context will increase the chances of success, local knowledge improves efficiency of hunting methods, population and efficiency estimates should be updated throughout operations to allow adaptive management, eradications on ungulates can include pauses to facilitate adaptive management, the level of certainty for determining eradication completion should be determined in advance of operations with explicit trade-offs identified for managers.\n</p>","author":"Robyn L. Irvine, \nJoseph L. Thorley","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"31028361f1e453f1cd8ed1fa2245ee78d6e7914f4ab3d7b66ad24598b6735087","category":"Environment"}