{"title":"A week with a Ford F-150 Lightning: This truck is too big for city life","link":"https://arstechnica.com/?p=1993852","date":1704469567000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/2023-Ford-F-150-Lightning-3-800x467.jpg\" alt=\"A week with a Ford F-150 Lightning: This truck is too big for city life\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/2023-Ford-F-150-Lightning-3-scaled.jpg\">Enlarge</a> (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>I seem to be thinking a lot about Ford's electric pickup truck, the F-150 Lightning. Earlier this week, we got the news of <a href=\"https://arstechnica.com/cars/2024/01/ford-kills-some-f-150-lightning-trims-raises-prices-on-others/\">price cuts and price increases</a>. Before that, there was <a href=\"https://arstechnica.com/cars/2023/12/ford-will-cut-f-150-lightning-production-in-half-in-light-of-weaker-demand/\">a pending cut to planned production output</a>. Taken as it is, it's just the all-electric version of America's favorite pickup—and arguably the best version unless you need to pull something on the end of a trailer hitch.</p>\n<p>But the Lightning doesn't exist in a vacuum. Depending on who you talk to, it's a clever attempt to get Americans to go electric, <a href=\"https://arstechnica.com/cars/2022/05/the-most-important-ev-of-the-decade-we-drive-the-f-150-lightning/\">an utterly familiar wrapper on a slab of new technology</a> that, yes, still requires the owner to adjust their mindset a bit from the gasoline-powered way of thinking. To others, <a href=\"https://arstechnica.com/cars/2023/11/car-dealers-say-they-cant-sell-evs-tell-biden-to-slow-their-rollout/\">it's a white elephant, one that costs too much and languishes on dealership forecourts</a>, proof positive that electrification is a thing other countries might bother with, but forget that here at home, cowboy.</p>\n<p>I've never found life to be quite that simple, and neither is the Lightning. Here in Washington, DC, the vehicle remains a rare sight—the only time I've seen one in the wild, it belonged to the DC government's fleet of vehicles (its job was inspecting abandoned vehicles). Out west, it's much more common to see electric F-150s on the road, and last year, Ford sold about 40,000 Lightnings, despite halting production for a fire and then again to retool part of the line.</p></div><p><a href=\"https://arstechnica.com/?p=1993852#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1993852&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"310591eb2f6be57aa63e2bb0202630db0ec95baad27a1613417cd8e26d4dd76f","category":"Tech"}