{"title":"What is the Role Local Antimicrobial Protection for One-Stage Revision for Peri-Prosthetic Hip Infection ?","link":"https://www.preprints.org/manuscript/202407.0880/v1","date":1720612860000,"content":"Antibiotic-loaded bone cement has been traditionally advocated as a key step for the success of one-stage hip revision surgery, while cementless techniques have been recently proposed with and without the use of local antibacterials as an equally successful alternative. Aim of this review is to investigate the effective role of local antimicrobial protection for one-stage cemented and cementless hip revision surgery. Twelve studies reporting the results of cemented single-stage procedure at a minimum two years follow-up were reviewed. When pooling together the data, no infection recurrence was observed on average in 83.3% of the patients (range 75.0% to 100%). Only two papers, both from the same French group, included patients treated without the use of antibiotic-loaded bone cement, with an average infection control of 95.9% in a total of 195 patients. This figure appears better that the 80.7% infection control obtained by pooling together all the remaining studies. Concerning cementless one-stage revision, a total of 17 studies, reporting on 521 patients, showed an average 90.0% (range 56.8% to 100%) no infection recurrence, at a minimum two years follow-up. Eight papers reported the outcomes of cementless implants without any local antibacterial protection and nine more described four different techniques for local antimicrobial implant protection. No comparative study investigated cementless revision with or without local antibacterial protection. Pooled data showed an average infection control of 86.7%, without the application of local antibacterials, compared to 90.1% to 100% with local antimicrobial protection, depending on the technology used. However, due to the relatively low number of patients treated with each local antimicrobial protection, no statistical difference could be found, either considering local antibacterial strategies alone or pooled together. No side effect had been reported by any local antibacterial technique. This review points out that local antibacterial protection for one-stage hip revision surgery, although safe and largely performed in the clinical setting, appears still to rely mainly on experts’ opinion and on observational series with no prospective or comparative trial, hence no definitive conclusion can be drawn concerning its effective role in one-stage hip revision surgery.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"311e13968a1dddd4e193d6423a88c5f8c197d11a00d66319d1b46f327d5bd93e","category":"Interdisciplinary"}