{"title":"α<sub>v</sub>β<sub>3</sub> integrin-targeted magnetic resonance imaging in a pancreatic cancer mouse model using RGD-modified liposomes encapsulated with Fe-deferoxamine","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310984","date":1727186400000,"content":"<p>by Mitsuyoshi Yoshimoto, Takuya Hayakawa, Masayuki Yamaguchi, Sadaaki Kimura, Hirofumi Fujii</p>\r\n\r\nMagnetic resonance (MR) imaging is a powerful imaging modality for obtaining anatomical information with high spatial and temporal resolution. In the drug delivery system (DDS) framework, nanoparticles such as liposomes are potential candidates for MR imaging. We validated that RGD peptides are possible targeting molecules for pancreatic cancer with α<sub>v</sub>β<sub>3</sub> integrin expression. This study aimed to evaluate RGD-modified liposomes loaded with ferrioxamine B for pancreatic cancer imaging. We synthesized four types of RGD-modified liposomes encapsulated with ferrioxamine B (SH-, H-, M-, and L-RGD-liposomes). The binding affinity of RGD-modified liposomes was evaluated in a competitive inhibition study using <sup>125</sup>I-echistatin. To investigate the pharmacokinetics of RGD-modified liposomes, a biodistribution study using RGD-liposomes labeled with <sup>111</sup>In was carried out in a human pancreatic cancer PANC-1 xenograft mouse model. Finally, MR was performed using ferrioxamine-B-loaded liposomes. RGD-liposomes inhibited the binding of <sup>125</sup>I-echistatin to RGD. The biodistribution study revealed that <sup>111</sup>In-RGD-liposomes accumulated significantly in the liver and spleen. Among the <sup>111</sup>In-RGD-liposomes, <sup>111</sup>In-H-RGD-liposomes showed the highest tumor-to-normal tissue ratio. In the MR study, H-RGD-liposomes loaded with ferrioxamine B showed higher tumor-to-muscle signal ratios than RKG-liposomes loaded with ferrioxamine B (control). We successfully synthesized RGD-liposomes that can target α<sub>v</sub>β<sub>3</sub> integrin.","author":"Mitsuyoshi Yoshimoto","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"311e0398a90003d97c5c756309360eef5dd024da2b54e577fcaf33ad9301e643","category":"Interdisciplinary"}