{"title":"Apple Planning to Launch Vision Pro by February","link":"https://www.macrumors.com/2023/12/20/vision-pro-february-launch/","date":1703104204000,"content":"Apple wants to launch the Vision Pro by February and is ramping up production to meet that release date goal, according to <em><a href=\"https://www.bloomberg.com/news/articles/2023-12-20/when-will-apple-vision-pro-be-available-company-is-aiming-for-february\">Bloomberg</a></em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-Vision-Pro-with-battery-Feature-Orange.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nProduction has been \"running at full speed\" for the last several weeks to ensure the Vision Pro is ready by the end of January, with a retail launch planned for February. Apple introduced the Vision Pro back in June, and at the time, the company said it would be released in early 2024.\r<br />\n\r<br />\nSince then, release timeline rumors have varied, with initial rumors suggesting March and later rumors pointing to January.\r<br />\n\r<br />\nSales of the Vision Pro will be limited to the United States to begin with, and it sounds like customers will need to purchase in a retail store or pick up an online order in store. Apple wants to ensure that customers have the right headband size and Light Seal for an appropriate fit. Without a tight fit that blocks out all ambient light, content won't look right, and without the right headband size, the device could feel too heavy. Some customers will also need custom Zeiss prescription lenses, so Apple plans to do headset assembly in its retail locations.\r<br />\n\r<br />\nApple is preparing to display and demonstrate the Vision Pro in some of its retail stores. Locations will need to have headsets on hand and all of the accessories, including the different-sized headbands and Light Seals. Apple is sending employees from each of its retail stores to Cupertino to learn how to prepare the device for customers.\r<br />\n\r<br />\nAccording to Gurman, employees will learn how the Vision Pro functions, what features to point out in conversations with potential buyers, and how to attach the headband, Light Seal, and prescription lenses. It is a delicate process because employees will need to learn how to put a device on a person's head and fit the right Light Seal on the face. There will be an app able to scan a customer's face to determine the proper headband and Light Seal, but the app's recommendation will have to be confirmed by an employee.\r<br />\n\r<br />\nApple is not expected to hold another Vision Pro event when the device launches, due to the limited U.S. release, the $3,500 price tag of the device, and the limited supply that Apple has available. If demand for the Vision Pro is high, it could be months before Apple is able to manufacture enough units.\r<br />\n\r<br />\nWhile Apple is planning for a February launch, Gurman warns that production issues or other problems could lead to a delay.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/20/vision-pro-february-launch/\">Apple Planning to Launch Vision Pro by February</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-planning-to-launch-vision-pro-by-february.2414285/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3121e9f200381fd6e5b3048a0ba42cd3bb1e243f4af263d41eb913a13f1bfb43","category":"Apple"}