{"title":"Company that plans to bring back the mammoth takes a key step","link":"https://arstechnica.com/?p=2008289","date":1709747970000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/image-1-800x800.jpeg\" alt=\"Large collection of cells with a red outline and white nucleus.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/image-1.jpeg\">Enlarge</a> <span>/</span> Elephant stem cells turned out to be a hassle to generate. (credit: Colossal.)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A company called Colossal plans to pioneer the de-extinction business, taking species that have died within the past few thousand years and restoring them through the use of DNA editing and stem cells. It's grabbed headlines recently by announcing some compelling targets: <a href=\"https://arstechnica.com/science/2022/08/de-extinction-company-sets-its-next-first-target-the-thylacine/\">the thylacine</a>, an extinct marsupial predator, and an icon of human carelessness, <a href=\"https://arstechnica.com/science/2023/01/the-next-de-extinction-target-the-dodo/\">the dodo</a>. But the company was formed to tackle an even more audacious target: the mammoth, which hasn't roamed the Northern Hemisphere for thousands of years.</p>\n<p>Obviously, there are a host of ethical and conservation issues that would need to be worked out before Colossal's plans go forward. But there are some major practical hurdles as well, most of them the product of the distinct and extremely slow reproductive biology of the mammoth's closest living relatives, the elephants. At least one of those has now been cleared, as the company is announcing the production of the first elephant stem cells. The process turned out to be extremely difficult, suggesting that the company still has a long road ahead of it.</p>\n<h2>Lots of hurdles</h2>\n<p>Colossal's basic road map for de-extinction is pretty straightforward. We have already obtained the genomes of a number of species that have gone extinct recently, as well as those of their closest living relatives. By comparing the two, we can identify key genetic differences that make the extinct species distinct. We can then edit those differences into stem cells obtained from the living species and use that species as a surrogate for embryos produced from these stem cells. This will have to be done using stem cells from a number of individuals to ensure that the resulting population has sufficient genetic diversity to be stable.</p></div><p><a href=\"https://arstechnica.com/?p=2008289#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2008289&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"31258c8aff982d1d59919dbb33c03647c2e5784cfc9b7eb6b08f523050bc960f","category":"Tech"}