{"title":"Apple releases second macOS Ventura 13.4 beta release candidate","link":"https://www.macworld.com/article/1674563/macos-ventura-13-4-beta-features-release-how-to-install.html","date":1683854377000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple has started the countdown to the next version of macOS Ventura with the release of the second <a href=\"https://www.macworld.com/article/678251/macos-13-ventura-features-compatibility-download-install.html\">macOS Ventura</a> 13.4 release candidate. As always, this beta has initially been released to developers, with a public beta to follow. It should arrive on Macs next week.</p>\n\n\n\n<div><div>\n<h2>macOS Ventura 13.4: Release notes</h2>\n\n\n\n<p>The macOS Ventura 13.4 release will include the usual bug fixes and security updates, as well as the following features and tweaks:</p>\n\n\n\n<ul><li>Sports feed in the sidebar of Apple News gives easy access to stories, scores, standings, and more, for the teams and leagues you follow</li><li>My Sports score and schedule cards in Apple News take you directly to game pages where you can find additional details about specific games</li><li>Resolves an issue where Auto Unlock with Apple Watch does not log you into your Mac</li><li>Fixes a Bluetooth issue where keyboards connect slowly to Mac after restarting</li><li>Addresses a VoiceOver issue with navigating to landmarks on webpages</li><li>Fixes an issue where Screen Time settings may reset or not sync across all devices</li></ul>\n</div></div>\n\n\n\n<h2>macOS Ventura 13.4 RC: Other fixes</h2>\n\n\n\n<p>It’s not known if there are other fixes in 13.4 that are not included in the release notes. Also, Apple has not released the security notes. A <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/classicii_mrmac/status/1656009009827045383&amp;xcust=1-1-1674563-1-0-0&amp;sref=https://www.macworld.com/feed\">tweet</a> by a macOS engineer who goes by Mr. Macintosh said that the Network Content Filter problem that was in the earlier 13.4 betas has been fixed.</p>\n\n\n\n<h2>How to install the macOS Ventura 13.4 public beta</h2>\n\n\n\n<p>While Apple changed the beta process in iPhones and Macs to rely solely on Apple IDs, you still need to install a new profile on your Mac. As always, we recommend against running betas on your main machine for work since there could be bugs that cause serious issues.</p>\n\n\n\n<ol><li>Click Sign Up on the Apple Beta page and register with your Apple ID.</li><li>Log in to the Beta Software Program.</li><li>Click <em>Enroll your Mac</em>. (If you signed up for a previous version’s beta last year you may need to uninstall the profile for that and then re-enroll for the new one.)</li><li>Go to beta.apple.com/profile on your Mac.</li><li>Download and install the Beta Access Utility.</li><li>Head over to Software Update in System Settings to install the update. </li><li>Restart your Mac</li></ol>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3126de6635571ab78868aad90f77675327c93282d55c053a058e0e2dd0b67359","category":"Apple"}