{"title":"Colorful quantum dots snag 2023 Nobel Prize in Chemistry","link":"https://arstechnica.com/?p=1973096","date":1696455211000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/dots4-800x533.jpg\" alt=\"Vials of Quantum dots with gradually stepping emission from violet to deep red\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/dots4.jpg\">Enlarge</a> <span>/</span> Vials of quantum dots with gradually stepping emission from violet to deep red. (credit: <a href=\"https://creativecommons.org/licenses/by-sa/3.0/\">Antipoff/CC BY-SA 3.0</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Once thought impossible to make, quantum dots have become a common component in computer monitors, TV screens, and LED lamps, among other uses. Three of the scientists who pioneered these colorful nanocrystals—Moungi G. Bawendi, Louis E. Brus, and Alexei I. Ekimov—<a href=\"https://www.kva.se/en/news/the-nobel-prize-in-chemistry-2023/\">have been awarded</a> the 2023 Nobel Prize in Chemistry by the Royal Swedish Academy of Sciences <em>“</em>for the <a href=\"https://www.kva.se/app/uploads/2023/10/popkeen23vb7yg4dp0s.pdf\">discovery and synthesis</a> of quantum dots.” The news had already leaked in the Swedish news media—a rare occurrence—when Johan Aqvist, chair of the Academy's Nobel committee for chemistry, made the official announcement, complete with five flasks containing quantum dots of many colors lined up before him as a visual aid.</p>\n<p>A <a href=\"https://arstechnica.com/science/2021/02/a-curious-observers-guide-to-quantum-mechanics-pt-5-catching-a-wave/3/\">quantum dot</a> is a small semiconducting bead with a few tens of atoms in diameter. Billions could fit on the head of a pin, and the smaller you can make them, the better. At those small scales, quantum effects kick in and give the dots superior electrical and optical properties. They glow brightly when zapped with light, and the color of that light is determined by the size of the quantum dots. Bigger dots emit redder light; smaller dots emit bluer light. So, you can tailor quantum dots to specific frequencies of light just by changing their size.</p>\n<p>Physicists had thought since the 1930s that particles at the nanoscale would behave differently. That's because, according to quantum mechanics, there is much less space for electrons when particles are that small, squeezing electrons together so tightly that material properties can change dramatically. Scientists succeeded in making nanoscale-thin films on top of bulk materials in the 1970s that had size-dependent optical properties, in keeping with those earlier predictions. But making those films required ultra-high vacuum conditions and temperatures near absolute zero, so nobody expected them to have much practical use.</p></div><p><a href=\"https://arstechnica.com/?p=1973096#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1973096&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"312d4016b35995af05989dbc804efca4d9e400de2ed1b57fa737eeb8278ed74c","category":"Tech"}