{"title":"Moving restoration ecology forward with combinatorial approaches","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17361?af=R","date":1717224244000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6f3f5e33-89b3-43dd-965d-e6cb608238d9/gcb17361-toc-0001-m.png\" alt=\"Moving restoration ecology forward with combinatorial approaches\" />\n<p>Our current planetary crises compel us to try out new approaches to restoring ecosystems that have been damaged by various factors of global change. We here propose a new way to move restoration forward by using random combinations of management practices to explore if a greater number of such practices can achieve greater restoration success. If widely adopted, this framework could uncover new combinations of interventions that can be broadly used in restoration practice.</p>\n<br />\n<h2>Abstract</h2>\n<p>Our current planetary crisis, including multiple jointly acting factors of global change, moves the need for effective ecosystem restoration center stage and compels us to explore unusual options. We here propose exploring combinatorial approaches to restoration practices: management practices are drawn at random and combined from a locally relevant pool of possible management interventions, thus creating an experimental gradient in the number of interventions. This will move the current degree of interventions to higher dimensionality, opening new opportunities for unlocking unknown synergistic effects. Thus, the high dimensionality of global change (multiple jointly acting factors) would be more effectively countered by similar high-dimensionality in solutions. In this concept, regional restoration hubs play an important role as guardians of locally relevant information and sites of experimental exploration. Data collected from such studies could feed into a global database, which could be used to learn about general principles of combined restoration practices, helping to refine future experiments. Such combinatorial approaches to exploring restoration intervention options may be our best hope yet to achieve decisive progress in ecological restoration at the timescale needed to mitigate and reverse the most severe losses caused by global environmental change.</p>","author":"Matthias C. Rillig, \nAnika Lehmann, \nRebecca Rongstock, \nHuiying Li, \nJames Harris","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"312de468ebc50655064f1effec3af3ee359ebf3412bfc12ab3cfd94173a94dce","category":"Environment"}