{"title":"Horse for the Course: Riding the new West Kernow Way bikepacking route on an e-gravel bike","link":"https://www.bikeradar.com/features/routes-and-rides/west-kernow-way/","date":1630661916000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/West-Kernow-Way-bikepacking22-d942b12.jpg?quality=45&amp;resize=620,413\" />                                            <p>Invited down to deepest, darkest Cornwall by CyclingUK to test out its new bikepacking route in July, there was a bit of a surprise in store when I hopped off the train in Penzance, clutching my helmet, greasy pedals and bikepacking bags, ready to receive the bike I’d be riding.</p>\n<p>If you’d have told me I’d spend three days merrily <a href=\"https://www.bikeradar.com/features/routes-and-rides/heres-what-you-need-for-a-bikepacking-adventure/\">bikepacking</a> my way around the tip of Cornwall on an e-gravel bike a few years ago, I’d have probably spat out my flat white in surprise. Electric gravel bikes… whatever next?! Turns out, they’re a lot more fun than I’d expected.</p>\n<p>As the latest in a series of off-road <a href=\"https://www.bikeradar.com/features/routes-and-rides/bikepacking-routes/\">bikepacking routes</a> from charity CyclingUK, this figure-of-eight ride from Penzance really packs a punch. It has a remarkably different feel to the King Alfred’s Way, the popular route launched by Cycling UK in 2020, which covers 224 miles in the south of England.</p>\n<p>The West Kernow Way features much more remote riding and is much further from home for most, starting in far-flung Cornwall at the end of the line of South West England’s major train artery.</p>\n<section><div>\n        <h3>Katherine’s West Kernow Way e-bikepacking recce</h3>\n<p><strong>The horse:</strong> <a href=\"https://www.bikeradar.com/reviews/bikes/electric-bikes/specialized-turbo-creo-sl-review/\">Specialized Turbo Creo SL Expert EVO</a>, box-fresh, loaded up with Ortlieb’s 15-litre handlebar pack and 11-litre seat pack <a href=\"https://www.bikeradar.com/advice/buyers-guides/bikepacking-bags/\">bikepacking bags</a>.</p>\n<p><strong>The course:</strong> The brand new West Kernow Way bikepacking route, established by Cycling UK, the creators of the popular King Alfred’s Way. A circular 143 miles (230 kilometres) of Land’s End and the Lizard Peninsula’s finest coastal singletrack, rural byways and quiet lanes. Starting from Penzance, we’d cover 46 miles on day one, 43 miles on day two and 45 miles on day three.</p>\n<p><strong>The goal:</strong> To recce the full West Kernow Way over three days, tackling some of the region’s famously cruel inclines while enjoying some of the finest wild swim spots and local delicacies along the way.</p>\n<p>\n\n    </p></div>\n    </section><h2>What’s this West Kernow Way then?</h2>\n<p>The 143-mile route is part of the EU-funded EXPERIENCE project, aiming to develop sustainable year-round tourism in Cornwall. Spring and autumn come highly recommended for testing out this challenge, when you can enjoy the changing seasons without clashing with the peak summer rush.</p>\n<p>The good old <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bike</a> vs <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">mountain bike</a> debate will undoubtedly rage on for this route. While the trail mostly takes in smoother gravel tracks and roads more suitable for a drop-bar machine, the steeper inclines will certainly be made easier with the <a href=\"https://www.bikeradar.com/advice/buyers-guides/mountain-bike-groupsets-everything-you-need-to-know/\">wide-ranging gears of a mountain bike</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The West Kernow Way is a 143mi/230km bikepacking route in Cornwall.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>As the first group to ride the full West Kernow Way route, we were also tasked with taking the photos for the guidebook, which in itself can be a time-consuming process.</p>\n<p>To tackle the brutal inclines and help us squeeze both the riding and photography into our three-day trip, our guides at Pannier arranged a suite of Specialized Turbo Creo SL EVO e-gravel bikes for us.</p>\n<p>Anyone who’s ever ridden in Cornwall will verify just how steep the terrain can be, with coastal villages nestled into rocky coves like tiny crabs clinging to rockpool edges. With every thrilling descent to another valley, you know that there’s a wall of tarmac or rocky cliff path awaiting you on the other side.</p>\n<p></p>\n<h2>Enter stage left, the Specialized Turbo Creo SL Expert EVO</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The horse: Specialized’s Turbo Creo SL Expert EVO e-gravel bike.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>That’s a bit of a mouthful, isn’t it? Broken down, it’s Specialized’s electric (Turbo) drop-bar (Creo) gravel (EVO) bike with the Specialized lightweight motor (SL), at ‘Expert’ build spec: i.e. <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-grx-di2-review/\">Shimano GRX Di2</a> and <a href=\"https://www.bikeradar.com/news/roval-rapide-c38/\">Roval C38 wheels</a>, with Specialized Pathfinder Pro tyres. Phew.</p>\n<p>The most impressive thing about the bike is the total weight. Without pedals, it comes in at around 14kg, including the 320Wh integrated battery and SL 1.1 motor. Sure, it feels a little heavier than a standard bike and the chunkier bottom bracket area doesn’t hide the fact that this is an ebike, but in the context of bikepacking, by the time you’ve loaded up with bags and gear, it’s really not so noticeable.</p>\n<p>Crucially, if you were to run out of battery in the middle of nowhere, it’s not so heavy that it’d be an insurmountable struggle to ride.</p>\n<h2>The electric nitty gritty</h2>\n<p>So what’s it like to ride? After a few dodgy hill manoeuvres, I soon got the hang of the electric control panel on the top tube, with a single button to turn on the motor and switch between the three assistance modes: eco, trail and turbo. This panel also shows you how much battery you have left with a series of ten LED bars.</p>\n<p>By the time we’d got to Mousehole I was whizzing up the steep harbourside road, giggling and waving madly at the entertained locals tending their quaint cottage-front gardens.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Specialized’s Mission Control app allows you to customise the battery and motor setup.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>You can also customise the motor and battery output through Specialized’s Mission Control app: for example, setting the percentage of power for each of the modes, where you can dial down the powerful turbo setting as I did for the rockier off-road climbs.</p>\n<p>There’s also the neat Smart Control feature where you can set your ride distance, duration or elevation to automatically adjust the motor and battery to make sure you have enough power to get you round your whole ride.</p>\n<p>In reality, I was fairly conservative with the use of the electric assistance, leaving it switched off a lot of the time until I could see a ramp of tarmac or trail up ahead, where I’d suddenly find myself jabbing hurriedly down on the top tube to power it up ready to hit the climb.</p>\n<p>Shift down a few gears at the same time and hey presto! You’re spinning up a grim 25 per cent gradient with a perfectly dry brow as if you’d just nipped out to the corner shop to fetch the daily paper.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> There’s no shortage of cafes on the route, if you do need to top-up an ebike battery.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>I’d usually be cynical about the ‘not wanting to get sweaty’ ebiker brigade, but seriously, it makes a real difference on terrain like this, not least with a fully-loaded bike.</p>\n<p>I’ve done more than my fair share of bikepacking rides and usually in Cornwall, with such tough hills, I’d end up pretty soggy by the top, only to then catch a chill on the rapid descent over the other side, and repeat.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The route consistently rises and falls along the Cornish coast, giving the Creo’s motor a regular workout on climbs and allowing Katherine to let rip on descents.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>Here, having a bit of help on the really hard bits meant I got round the ride without overly straining my legs (and lungs) on the most savage inclines, while being a bit more comfortable too – especially when it came to stopping to explore the many gorgeous coastal towns and tempting pasty shops…</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The route includes Porthleven, the most southerly port in Great Britain.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>I’d burned through my ten bars of battery by the end of our second day, where we were overnighting at the YHA in Coverack. Thankfully, there was a plug socket in the bike storage room, so with the stashed charger it was easy to top up the battery overnight.</p>\n<p>We’d camped on the first night so this had been the first opportunity to recharge, although I’m sure if you got really desperate you could ask a friendly cafe owner along the route for a top-up while you enjoyed some lunch.</p>\n<h2>Built for bikepacking?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Blue skies and smiles as far as the eye can see.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>Despite my praise so far, the Turbo Creo SL EVO has a way to go before it reaches supreme bikepacking steed status, but it still proved to be a valuable tool for this particular job.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-geometry-explained/\">road-esque geometry</a> and addition of a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">dropper post</a> didn’t seem to add up, so I’d ditch the extra weight and complication of the dropper for starters because it only seemed to interfere with luggage.</p>\n<p>That said, if you wanted to shift some luggage to the front of the bike, it should be fairly straightforward to add some bosses down the fork legs for cages and bags, like on the <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/specialized-diverge-comp-carbon-review/\">Diverge gravel bike</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Turbo Creo is fairly conservative as far as the latest gravel bikes are concerned and has its limitations as a bikepacking machine.</span></figcaption><span></span></div>\n<p>At 5ft4in (165cm), I did struggle a little for clearance on this size medium: both over the front with the large Ortlieb handlebar pack and the Future Shock 2.0 stem, and I opted for the smaller Ortlieb seat pack for better clearance over the back too.</p>\n<p>Having some extra storage options on the fork for folk of my size and shorter would be a real advantage here.</p>\n<p>Tyres play a fundamental role in how well any bike rides, but especially when it comes to heading off-road. The Turbo Creo SL EVO is shod with 38mm-wide Specialized Pathfinder Pro tyres – while they roll smoothly on the road and are pretty decent over drier gravel tracks, they do really struggle when you hit anything slicker.</p>\n<p>As more seasoned bikepackers will know, being comfortable on the bike over multiple days is really key, and one way to improve this is to run lower <a href=\"https://www.bikeradar.com/advice/workshop/road-bike-tyre-pressure/\">tyre pressures</a> for a little suspension. Wider tyres are key here, though the Turbo Creo is limited in frame clearance, topping out at a maximum of 42mm.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> No bikepacking trip would be complete without a bit of hike-a-bike, right?</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>Although the bike was equipped with the Specialized Future Shock 2.0 stem with adjustable travel for extra comfort over rougher terrain, I effectively locked this out for the duration of the trip due to the lack of clearance between my bar bag and front tyre.</p>\n<p>There was also a hike-a-bike section from the beach at Kennack Sands up to the road on the footpath. To tackle this grassy 25 per cent slope with a loaded bike, the Walk Assist feature from Specialized’s e-MTB range would be really handy.</p>\n<h2>A future in e-bikepacking?</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/West-Kernow-Way-bikepacking15-c3d2927.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The West Kernow Way provides plenty of opportunity to fuel-up on Cornish delicacies, from pasties…</span>\n    </figcaption><span>\n                    <i>Jordan Gibbons</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/West-Kernow-Way-bikepacking29-90dc446.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>…to freshly-caught mussels…</span>\n    </figcaption><span>\n                    <i>Jordan Gibbons</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/West-Kernow-Way-bikepacking13-df462e3.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>…and local tea loaf.</span>\n    </figcaption><span>\n                    <i>Jordan Gibbons</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nIn addition to the three days of glorious scenery, pasties and mussels, having some e-assistance for the stabby hills of Cornwall did really help make the trip less testing and more enjoyable.\n<p>I’ve no doubt that I’d be able to get around the course without it, although it would have certainly taken longer and been much more exhausting… I probably wouldn’t have been much company around the dinner table!</p>\n<p>I was most impressed by how light the Specialized Turbo Creo SL EVO was. It handled just like a standard gravel bike on the flat or descents, but gave you some extra oomph on the ups.</p>\n<p>Sure, if you were heading somewhere really remote then you’d have to be more careful to plan exactly where you’d be able to recharge, but for a place like Cornwall, there’s a B&amp;B or cafe around every corner.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Katherine strapped a setup of Ortlieb bikepacking bikes to the Specialized Turbo Creo SL Expert EVO.</span></figcaption><span></span></div>\n<p>What I haven’t mentioned yet is the price: at £7,500 for this mid-range model, it’s certainly not a small investment.</p>\n<p>If it were me, I’d want to wait for a few improvements to make the bike more gravel-centric, including wider tyre clearance and more mounts, plus I’d immediately switch out the dropper.</p>\n<p>Having said that, if you’re keen to ride more mixed terrain routes and enjoy the occasional bikepacking trip with some added oomph, it’s one to consider – if you have £7,500 down the back of the sofa.</p>\n<h2>Ready to take on the West Kernow Way?</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/West-Kernow-Way-bikepacking17-24d5119.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The route offers jaw-dropping scenery at every turn.</span>\n    </figcaption><span>\n                    <i>Jordan Gibbons</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/West-Kernow-Way-bikepacking18-a526ebf.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Take your pick from Cornwall’s gorgeous beaches.</span>\n    </figcaption><span>\n                    <i>Jordan Gibbons</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nYou don’t need a £7k ebike to tackle the UK’s freshest bikepacking route, but having tackled that wall of tarmac leading out of Cadgwith, the relentless ramp out of Coverack and the steep, rocky gravel singletrack up from the Cot Valley, a wide-ranging gear setup is absolutely crucial.\n<p>Although the blend of quiet lanes and off-road bridleways and byways wasn’t particularly technical, it was pretty rocky in places, so I’d recommend wider tyres of 40mm plus, with a <a href=\"https://www.bikeradar.com/features/how-to-set-up-road-tubeless-tyres/\">tubeless setup</a> preferably.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Relics of Cornwall’s industrial past are dotted along the route.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>If you enjoy learning about history then you’re in for a real treat: from relics of Cornwall’s prosperous industrial past as you ride past the ruins of tin mines and tall stone chimneys both on the north coast and further inland near Redruth, to the ancient granite monument of Men-an-Tol, thought to date back some 3,500 years to the Bronze Age.</p>\n<p>Foodies will delight too, because there are so many delectable local delicacies to enjoy along the way; fresh seafood in Porthcurno, locally produced ice cream in St Just and opportunities to take afternoon tea in nearly every settlement you pass through!</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Here’s a tip for nature lovers: take a set of binoculars.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>For nature lovers like me, this tip of Cornwall is a real spectacle, with many species found here that you just don’t see elsewhere in the UK.</p>\n<p>The bursting, vibrant hedges and cliff-top meadows were bristling with new flowers and succulents that were new to me, including beautiful wild orchids.</p>\n<p>Packing binoculars in a stem bag was a good shout too, not only for the seabirds and many raptors we saw along the route, but also to nosey at the harbour across the bay at St Michael’s Mount or watch the sailing boats out at sea.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> And to finish? A drip in Penzance’s Jubilee Pool.</span></figcaption><span> <i>Jordan Gibbons</i></span></div>\n<p>The one thing that you absolutely must pack? Your swimmers, of course! I can think of no better way to end a long day on the bike than treating the muscles to a reviving sea swim.</p>\n<p>For the ultimate way to conclude the West Kernow Way, book in for a swim at Jubilee Pool – a gorgeous Art Deco seawater lido with geothermally-heated water – when you return to Penzance. Your weary legs will thank you for it!</p>","author":"Katherine Moore","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"312f85bf5bc949f8923bbaececc9c8e5701307cc5ecd3e90706633683cd19f20","category":"Cycling"}