{"title":"Financial resources, access to care, and quality of care mediate racial disparities in statin usage for secondary prevention","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311724","date":1728396000000,"content":"<p>by Christopher Wong, Lyndonna Marrast, Rehana Rasul, Ratnam Srivastava, Jeffrey Kuvin, Robert Roswell, Joseph Conigliaro, Eun Ji Kim</p>\r\nBackground <p>There are disparities in statin therapy for the secondary prevention of atherosclerotic cardiovascular disease (ASCVD). The role of structural racism in this disparity has not been examined.</p> Methods <p>This is a cross-sectional study of participants with ASCVD in the Medical Expenditure Panel Survey from 2014–2017. Mediation analysis is utilized to estimate the direct effect of race and indirect effect of financial resources, access to care, and quality of care on statin usage.</p> Results <p>The proportion of participants using statins by race/ethnicity were 58.5% for non-Hispanic Whites, 45% for Hispanics, 48.6% for Blacks, 61.6% for Asians, and 46.8% for Others. Statin usage was lower for Hispanics (OR = 0.79, 95% confidence interval [0.65–0.96]) and Blacks (OR = 0.80 [0.66–0.95]) compared to Whites. Hispanic, Black, and Other participants with the same financial resources, access to care, and quality of care as White participants did not have significantly different statin usage compared to White participants (Hispanic: OR = 0.98 [0.79–1.13]; Black (OR = 0.88 [0.76–1.06], Other: OR 0.76, 95% CI [0.56–1.15]). Hispanic, Black, and Other participants had significantly lower statin usage than subjects of the same race but with financial resources, access to care, and quality of care observed in White subjects (Hispanic: OR = 0.83 [0.83–0.92]; Black: OR = 0.91[0.88–0.94]; Other: OR = 0.92 [0.87–0.98]).</p> Discussion <p>The indirect effect of race and ethnicity on statin therapy are significant but the direct effect of race and ethnicity on statin therapy are insignificant among Blacks and Hispanics compared to non-Hispanic Whites. This suggests that racial disparities in statin therapy are mediated through inequitably distributed resources, suggestive of the impact of structural racism.</p>","author":"Christopher Wong","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"312f2418bdab727ba0796e74881786086ef4f4f12a11434efc0d2f965d0f5a4c","category":"Interdisciplinary"}