{"title":"Exploring novel North Water Polynya ecosystems under climate change","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000490","date":1729778400000,"content":"<p>by Elizabeth R. Gillie, Andrea Bryndum-Buchholz, Stephen G. Willis, Tyler D. Eddy</p>\r\n\r\nClimate change is rapidly reshaping species distributions in the Arctic, which could profoundly impact ecosystem structure and function. While considerable effort has focused on projecting future species distributions, assessing the impacts of range-shifting species on recipient communities and subsequent disruptions to food webs remains largely unstudied. Here, we address this gap by combining species distribution models and ecosystem models to explore the emergence of novel ecosystems in the North Water Polynya. The North Water Polynya is an open-water area between Greenland and Canada, surrounded by sea ice and one of the world’s most productive ocean ecosystems. Using existing literature and projections from species distribution models of four marine species, we develop six plausible future ecosystem scenarios for the North Water Polynya. These scenarios include changing biomass of primary producers, changing biomass and size structure of copepods, shifting abundances of forage fish species, and the establishment of killer whales. We find that the biomass of higher trophic levels show pronounced decreases in response to the decrease in pelagic primary producers, with polar bear biomass halving compared to present conditions. Changes in the copepod size structure has the largest impact on the entire ecosystem compared to the other novel ecosystem scenarios, suggesting a strong reliance of higher trophic levels on large, lipid-rich copepods. We further show that increasing capelin with a simultaneous decrease in Arctic cod biomass causes large decreases in the biomass of marine mammals such as polar bear, beluga and ringed seal. Finally, we show the establishment of killer whales as a key novel predator could have cascading top-down effects on the North Water Polynya ecosystem. The framework presented here provides an approach for exploring the emergence of novel ecosystems and highlights how climate change could disrupt a high Arctic ecosystem.","author":"Elizabeth R. Gillie","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"313040f414a9ed5c728d831f525b38e80693f717869e505d45e493dd649c524b","category":"Environment"}