{"title":"Apple Watch Ultra 2 vs Garmin Epix Pro: The NYC Test Gauntlet","link":"https://www.dcrainmaker.com/2024/01/apple-garmin-gauntlet.html","date":1704919631000,"content":"<p></p>\n<p>It’s that time again – for another New York City GPS accuracy test. Just like the <a href=\"https://www.dcrainmaker.com/2023/12/getting-christmas-edition.html\">annual Christmas Tree by cargo bike tradition</a>, so is the NYC GPS accuracy test posts. Albeit, this time I’ve got an interesting double-date test. Still, it’s one of the hardest places in the world for GPS to do its job properly – yet, because I can r<a href=\"https://www.dcrainmaker.com/2018/09/new-york-city-gps-running-accuracy-test-rabbit-hole.html\">un it year after year</a>, we can see how technology and models advance. In case you’re interested, here <a href=\"https://www.dcrainmaker.com/2022/10/apple-watch-ultra-vs-new-york-city-gps-accuracy-test.html\">was the test there of the Apple Watch Ultra 1 vs Garmin Epix (not Pro)</a>.</p>\n<p>In any case, this time around on one wrist/side we’ve got the dual-frequency/multi-band Apple Watch Ultra 2 and Garmin Epix Pro. Whereas on the other side we’ve got the non-multi-band Apple Watch Series 9 and Garmin Venu 3. Both of these sets are priced in roughly the same ballpark, and target many of the same consumers (especially as Apple continues to expand their endurance sports features/support).</p>\n<p>For now, I’ve got the video above, complete with all sorts of little entertaining nostalgic things I run past, like memories of my <a href=\"https://www.dcrainmaker.com/2011/07/time-capsule-trip-report-flying.html\">Concorde trip</a>, and <a href=\"https://www.dcrainmaker.com/2010/07/new-york-triathlon-2010-race-report.html\">New York City Triathlon</a> from years ago. But, if you want to look at the actual GPS data set in the DCR Analyzer, <a href=\"https://analyze.dcrainmaker.com/#/public/81fbd705-62f2-4f36-52ba-67d074f39511\">you’ll find it here too</a>.</p>\n<p>Thanks for watching!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"31319fe0933efd12f5c523c86a2c39020f11c835ac53e3be52c5323e519af5fa","category":"Cycling"}