{"title":"ประสบการณ์เรียกช่างท่อประปา ซ่อมด่วนตอนกลางคืนของ HomePro","link":"https://markpeak.net/homepro-emergency-fix/","date":1619511509000,"content":"<p>แชร์ประสบการณ์เรียกช่าง Home Pro ซ่อมท่อประปาฉุกเฉินตอนกลางคืน เผื่อเป็นประโยชน์กับคนอื่นๆ ที่เจอปัญหาเดียวกัน</p>\n<p>เรื่องมีอยู่ว่า ช่วงประมาณทุ่มกว่าๆ ไปกวาดน้ำในห้องน้ำหลังอาบน้ำ แล้วหมุนตัวไปโดนท่อของก๊อกล้างพื้นที่ติดกับผนังกระเบื้อง หักออกมาตามอย่างในภาพ น้ำพุ่งกระจายทันที</p>\n<p>การที่เป็นท่อติดผนัง ทำให้ไม่มีวาล์วน้ำแยกเฉพาะเหมือนท่อน้ำอื่นๆ จึงต้องแก้ปัญหาเฉพาะหน้าด้วยการวิ่งไปปิดวาล์วน้ำนอกบ้านให้น้ำหยุดไหลก่อน แต่ก็ตามมาด้วยปัญหาว่าน้ำทั้งบ้านไม่ไหล จนกว่าจะอุดท่อนี้สำเร็จ</p>\n<p>ภารกิจในคืนนั้นจึงเป็นการตามหาช่างประปาในเวลาค่ำคืน เพื่อความรวบรัด ขอสรุปประสบการณ์ตามหาช่างประปาดังนี้</p>\n<ul>\n<li>ช่างประปาเจ้าประจำแถวบ้านที่ใช้บริการกันมานาน –&gt; โทรไม่ติด เลขหมายที่ท่านเรียกไม่มีสัญญาณตอบรับ ซึ่งเป็นพฤติกรรมปกติของพี่แกที่จะติดต่อไม่ได้เป็นระยะ</li>\n<li>แพลตฟอร์มเรียกช่างออนไลน์ –&gt; ลองดูหลายเจ้า เช่น Fixzy, 24Fix พบว่าไม่รับงานด่วน งานฉุกเฉิน และ call center ปิดตามเวลาทำการ</li>\n<li>หาช่างประปา + ชื่อย่าน บน Google –&gt; เจอเป็นสิบๆ เจ้า ลองโทรไป 3-4 สายในเวลาประมาณ 2 ทุ่ม ไม่มีใครรับสักคน และไม่มีใครโทรกลับมาด้วย</li>\n</ul>\n<p>ผลเลยมาลงเอยที่บริการเรียกช่าง HomePro ครับ ต้องออกตัวก่อนว่า ได้ยินชื่อเสียงในทางลบของช่าง HomePro มานาน (เช่น <a href=\"https://pantip.com/topic/30929152\">กระทู้นี้</a> หรือจากเพื่อนฝูงเล่าให้ฟัง) แต่ ณ จุดนั้นไม่มีทางเลือกอื่นแล้ว เพื่อให้มีน้ำใช้จึงต้องลองดู</p>\n<p>หมายเหตุ: จากการลองค้นข้อมูลดู พบว่า HomePro ไม่มีข้อมูลนี้บนหน้าเว็บ (หรือว่ามีแต่ทำห่วย search ไม่เจอก็ไม่ทราบได้) แต่<a href=\"https://www.facebook.com/Homeservicebyhomepro/\">มีเพจ Facebook นะ ใช้ชื่อว่า Home Service</a> แต่ก็คงไม่ค่อยมีใครเรียกชื่อนี้</p>\n<p>เริ่มจากโทรไปยัง HomePro สาขาใกล้บ้าน ว่ามีช่างซ่อมด่วนให้บริการหรือไม่ ได้คำตอบว่าให้โทรเข้าเบอร์กลาง 1284 แทน แล้วกดเลือกบริการชื่อ Home Service ที่เป็นเรียกช่างซ่อมถึงบ้าน</p>\n<p>call center คุยดีคุยรู้เรื่อง แจ้งเงื่อนไขว่าบริการซ่อมด่วน ซ่อมฉุกเฉินคือ</p>\n<ul>\n<li>รับงาน 24 ชม.</li>\n<li>ช่างจะเข้าถึงหน้างานภายใน 2 ชั่วโมง</li>\n<li>เป็นการซ่อมชั่วคราว เช่น ให้ลูกค้ามีน้ำใช้ไปก่อน แล้วค่อยหาช่างมาซ่อมถาวรทีหลัง</li>\n<li>ค่าบริการ 1,700 บาท หากเป็นสมาชิก HomePro ลดเหลือ 1,500 บาท</li>\n<li>ไม่รวมค่าอะไหล่หรือชิ้นส่วน ถ้าจำเป็นต้องใช้งาน</li>\n</ul>\n<p>ณ ตอนนั้นไม่มีอะไรจะเสียแล้ว เลยเรียกใช้บริการ ขั้นถัดมา call center จะให้เราเพิ่มบัญชี LINE @Homeservicebyhomepro เพื่อสื่อสาร ส่งรูปหน้างานให้ประเมินความเสียหาย และจ่ายเงินล่วงหน้าผ่าน QR Code ได้เลย</p>\n<p>จ่ายเงินเรียบร้อยก็รอครับ ตามเงื่อนไข SLA ว่าช่างจะเข้าหน้างานภายใน 2 ชม. รอไปประมาณชั่วโมงกว่าๆ ช่างก็โทรมาสอบถามข้อมูลเพิ่มเติมอีกเล็กน้อย ว่าท่อเป็นชนิดไหนยังไง แล้วก็รอไปอีกสักพักใหญ่ๆ ช่างก็มาจอดรถที่หน้าบ้าน ใช้เวลารอประมาณเกือบ 2 ชม. พอดี</p>\n<p>ช่างแต่งตัวด้วยยูนิฟอร์มสีส้ม มีตรา HomePro ชัดเจน อย่างแรกที่ทำคือมาถ่ายรูปเลขที่บ้านเราก่อน 555 เพื่อยืนยันกลับไปยัง HomePro ว่ามาถึงหน้างานแล้ว (ช่างบอกว่า งาน HomePro จะถ่ายรูปเยอะหน่อยนะครับ) แล้วก็เริ่มลงมือซ่อมทันที</p>\n<p>ผลลัพธ์คือช่างสามารถแก้ปัญหาได้ โดยแงะท่อที่หักคาด้านในให้ แล้วขอเปลี่ยนเป็นข้อต่อทองเหลืองให้แทน (เสียค่าอะไหล่เพิ่ม 100 บาท) สักประมาณ 4 ทุ่มกว่าๆ ก็เสร็จงานเรียบร้อย เราก็กลับมามีน้ำใช้เหมือนเดิม</p>\n<p>ช่างเล่าว่า ในพื้นที่ กทม. มีช่างประจำอยู่ 2 คน คอยรับงาน โดยสแตนด์บายอยู่ที่บ้าน ส่วนใหญ่แล้วงานซ่อมฉุกเฉินเป็นช่วงหัวค่ำ ก่อนเที่ยงคืน ถ้าเป็นหลังเที่ยงคืนไปแล้วก็ไม่ค่อยมีงาน</p>\n<p>ประสบการณ์การใช้ช่าง HomePro ซ่อมท่อรอบนี้คือ ดีกว่าที่คิด กระบวนการ workflow ออกแบบมาดี ตัว call center คุยดี ติดต่อง่าย แชทไปแล้วตอบ เสร็จงานแล้วก็มีโทรมาสอบถามความพึงพอใจของงานซ่อมด้วย ในขณะตัวของช่างก็สามารถแก้ปัญหาได้ตามที่ต้องการ (ซึ่งปัญหาของแต่ละคนก็แตกต่างกันไปแหละนะ)</p>\n<p>ภาพรวมคือ บริการช่างซ่อมด่วน HomePro เป็นตัวอย่างที่ดีของการเรียกบริการจากบริษัทใหญ่ ที่มีการควบคุมคุณภาพได้ค่อนข้างดี สรุปว่าประทับใจ และถ้ามีคนรู้จักเจอปัญหาแบบนี้ก็คงแนะนำให้เรียกใช้งาน ในเชิงธุรกิจคือว่า HomePro ตีโจทย์แตก (ซ่อมด่วนยังไงมันก็ต้องซ่อมให้จบ) และ execution ดี</p>\n<p>หมายเหตุ: เขียนบล็อกนี้เพื่อมาแนะนำคนอื่นๆ ที่มีปัญหาแบบเดียวกัน และไม่ได้เงินจาก HomePro แต่อย่างใด (มีแต่เสียเงิน) ระหว่างเช็คข้อมูลเพื่อเขียน ก็พบว่า LINE Home Service by HomePro นั้นเอารูปท่อของตูไปใช้แบบไม่ขอด้วย เอ้า! มาขอดีๆ ก็ให้นะแบบนี้</p>\n<p>อัพเดต: ทางทีม HomePro โทรมาขอโทษสำหรับการนำภาพไปใช้งานโดยไม่ขออนุญาต เรียบร้อยแล้วครับ</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/04/homepro.jpg\" /></p>The post <a href=\"https://markpeak.net/homepro-emergency-fix/\">ประสบการณ์เรียกช่างท่อประปา ซ่อมด่วนตอนกลางคืนของ HomePro</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"31380d9a5a533d47c882dd3d9aeb2f3c078d4ea20b0d1f408ab26156b8b7c8f5","category":"Thai"}