{"title":"Neurocognitive profile in HIV subjects on INSTI-regimen- one year follow up: Is there room for optimism?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306278","date":1719410400000,"content":"<p>by Nina Brkić-Jovanović, Mina Karaman, Vanja Andrić, Daniela Marić, Snežana Brkić, Vojislava Bugarski-Ignjatović</p>\r\n\r\nThe introduction of antiretroviral therapy (ART) has successfully changed the clinical course of people with HIV, leading to a significant decline in the incidence of HIV-related neurocognitive disorders. Integrase strand transferase inhibitors (INSTI) are recommended and preferred first-line ART for the treatment of HIV-1 infection in ART-naïve subjects. This type of therapy regimen is expected to have higher CNS penetration, which may bring more cognitive stability or even make significant cognitive improvement in people with HIV. The study aimed to follow up on neurocognitive performance in HIV subjects on two types of INSTI therapy regimens at two-time points, one year apart. The study sample consisted of 61 ART naïve male participants, of which 32 were prescribed raltegravir (RAL) and 29 dolutegravir (DTG). There was no significant difference between subsamples according to the main sociodemographic (age, education level) and clinical characteristics (duration of therapy, nadir CD4 cells level, CD4 cells count, CD8 cells, CD4/CD8 ratio). For neurocognitive assessment, six measures were used: general cognitive ability (MoCA test), verbal fluency (total sum score for phonemic and category fluency), verbal working memory (digit span forward), cognitive capacity (digit span backwards), sustained attention (Color Trail Test 1), and divided attention (Color Trail Test 2). In both therapy groups (RAL and DTG), there was no significant decrease in neurocognitive achievement on all used measures over a one-year follow-up in both therapy groups. A statistically significant interactive effect of time and type of therapy was found on the measure of divided attention—DTG group showed slight improvement, whereas RAL group showed slight decrease in performance. During the one-year follow-up of persons on INSTI-based regimen, no significant changes in cognitive achievement were recorded, which suggests that the existing therapy can have a potentially positive effect on the maintenance of neurocognitive achievement.","author":"Nina Brkić-Jovanović","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"314879115a74d61e96fce879cd9d5d3c72d2f3c16de70eb149424a0834368fa2","category":"Interdisciplinary"}