{"title":"How Different Industries Deal with Cloud and Multi-Cloud","link":"https://www.hashicorp.com/blog/how-different-industries-deal-with-cloud-and-multi-cloud","date":1631043000000,"content":"<p>According to the inaugural <a href=\"https://www.hashicorp.com/state-of-the-cloud\">HashiCorp State of Cloud Strategy Survey,</a> multi-cloud has become the de facto standard operations model for IT organizations of all sizes, and every industry. According to the survey’s 3,200+ respondents — practitioners and decision makers from the HashiCorp opt-in contact database — the need for digital transformation is driving organizations to invest significant resources in multi-cloud deployments, and those investments are already paying off. Notably, the similarities in the core journey and cloud transformation needs of organizations hold true regardless of industry. For example, staffing and skills shortfalls are consistently one of the biggest challenges impacting organizations' cloud programs.</p>\n<p>That said, every industry deals with the cloud in its own way. For example:</p>\n<ul>\n<li>Telcos and software and services companies, which often have more experience in the cloud, claim the most multi-cloud success, while industries newer to digital transformation, like the public sector, have yet to realize the same level of benefits.</li>\n<li>While staffing and skills deficiencies are a universal concern, some industries are much more concerned with security, while others are apprehensive about increasing costs.</li>\n<li>While multi-cloud spread is relatively consistent across industries, unique business-based dynamics appear when looking at the retail, public sector, and healthcare spaces.</li>\n<li>Cloud budgets vary widely across different industry sectors. Respondents in telcos and finance are betting big, while software companies and the public sector are spending more conservatively.</li>\n<li>Surprisingly, COVID-19 had a relatively restrained effect on respondents from telcos and retail/consumer goods companies.</li>\n<li>While all industries expressed the importance of cloud-based automation tools to their cloud programs, which types of solutions matter most varied considerably by industry.</li>\n</ul>\n<h2><a href=\"#telcos-and-software-companies-enjoy-the-most-multi-cloud-success\">»</a><a></a>Telcos and Software Companies Enjoy the Most Multi-Cloud Success</h2>\n<p>While respondents from all industries agree that the move to multi-cloud is important, they aren’t all feeling the same benefits to their bottom line. Telcos (64%) and software companies (57%) stated they reaped more multi-cloud success, while the public sector struggled — just 39% said multi-cloud had advanced their business goals. Organizations in the public sector have historically been later to transition to the cloud, let alone multi-cloud. In addition, they were often strategically focused on single cloud solutions, a trend that may be abating after the <a href=\"https://www.cnbc.com/2021/07/06/pentagon-cancels-10-billion-jedi-cloud-contract.html\">cancelation of the JEDI cloud contract</a> and new RFPs seeking to contract with multiple cloud providers. Look to next year’s State of Cloud Strategy Survey to help understand if this lack of perceived impact is due to the nature of the public sector’s needs, or simply the early stage of historical priorities of its digital transformation.</p>\n<h2><a href=\"#cost-is-the-top-cloud-concern-for-telcos-software-and-media-companies\">»</a><a></a>Cost Is the Top Cloud Concern for Telcos, Software, and Media Companies</h2>\n<p>While staffing and skills issues are a top-level cloud inhibitor across all industry sectors, the unique challenges and dynamics of particular industries determine their biggest cloud challenges. For financial services organizations, not surprisingly, security is a huge concern (59%), followed by regulatory requirements (48%), while cost was a lesser factor than in other industries (41%). In the public sector and retail/consumer goods, on the other hand, it’s all about the lack of in-house skills (53% for the public sector, 51% for retail/consumer) and cost (50% for public sector, 47% for consumer/retail). Perhaps counter to its more free-spending reputation, respondents in the entertainment industry were the most concerned by cost issues, with 60% citing it as a top-three cloud inhibitor.</p><img src=\"https://www.datocms-assets.com/2885/1631041325-top-inhibitors-by-industry-edited.png\" /><p>The stage of cloud adoption also impacts the challenges organizations face. The software sector, for example, was an early cloud adopter, so it should be no surprise that fewer respondents from this industry view skills and staffing issues as a top problem. Industries new to the space and not traditionally tech savvy, such as the public sector, are experiencing this skills gap much more acutely.</p>\n<h2><a href=\"#unique-industry-dynamics-may-affect-cloud-provider-choices\">»</a><a></a>Unique Industry Dynamics May Affect Cloud Provider Choices</h2>\n<p>Not surprisingly, respondents used Amazon Web Services (AWS), the industry leader in cloud, much more frequently than they did other cloud platforms. However, AWS is less dominant in the retail and consumer goods space, perhaps because of competitive concerns with Amazon in general. Respondents from that industry use non-AWS clouds at a higher rate than other segments and 18% say they would never use AWS.</p>\n<p>Interestingly, respondents from the healthcare (40%) and public sectors (48%) were significantly less likely to use Google Cloud than were respondents in other industries.</p>\n<p>Finally, avoiding vendor lock-in was a driving force around the decision to go multi-cloud for a high percentage of telco (36%) and consumer goods/retail (34%) respondents. Conversely, healthcare and media/entertainment organizations were the least likely to list vendor lock-in as a multi-cloud driver, and were also the most likely to use AWS.</p>\n<h2><a href=\"#telco-and-finance-orgs-lead-cloud-investment\">»</a><a></a>Telco and Finance Orgs Lead Cloud Investment</h2>\n<p>Looked at by industry, telcos are the biggest spenders, with 27% budgeting more than $10 million. Financial institutions run a close second at 21%. That makes sense, since telcos and finance companies tend to be large, well-capitalized organizations deeply familiar with massive infrastructure investments. Software companies, on the other hand, are relatively constrained, with 33% budgeting less than $100,000 on their multi-cloud initiatives. That may not be as surprising as it sounds, though, as the industry includes many small startups with limited resources.</p>\n<p>We also see smaller cloud budgets in the public sector, with 25% spending less than $100K a year and 68% spending $2 million or less. As cloud becomes a bigger part of their investment and new programs continue to spin up, we expect cloud budgets to grow in larger sectors of the government, but for smaller government agencies, cloud spending may continue to lag other sectors.</p>\n<p>In addition to differences in cloud budgets, we also found significant fluctuation between budgeted and actual cloud spend. Overspending on cloud was most noted in telcos (49%) and financial firms (46%), while software companies (35%) and the public sector (36%) reported the least overspending. Companies budgeting $2 million to $10 million were the most likely to overspend (46%), while only 27% of companies budgeting less than $100,000 overspent. Surprisingly, cloud spending alignment did not vary much with company size. It is hard to tell if these fluctuations from projected budgets are just blips as organizations get a better understanding of cloud costs, or if they will have to work harder to manage spend in the future.</p>\n<h2><a href=\"#many-telcos-and-retailers-shrugged-off-covid-19\">»</a><a></a>Many Telcos and Retailers Shrugged off COVID-19</h2>\n<p>We can’t talk about 2020 without addressing the impact the COVID-19 pandemic had on cloud plans. Not surprisingly, COVID impacted particular industries in very different ways. More respondents in healthcare (25%), consumer/retail (23%), entertainment/media (19%), and the public sector (20%) reported that COVID accelerated their initiatives by two years or more. On the other hand, 33% of telcos and 41% of consumer/retail companies reported <em>no</em> COVID impact on their cloud efforts.</p>\n<p>It appears that organizations that were further along in their cloud initiatives were less affected, whereas sudden pandemic-fueled transitions to remote work, the creation of digital portals, and needs for remote data access and sharing may have pushed more hesitant industries to finally go all in on the cloud.</p>\n<h2><a href=\"#infrastructure-automation-tools-are-extremely-important\">»</a><a></a>Infrastructure Automation Tools Are “Extremely Important”</h2>\n<p>Finally, let’s take a closer look at the specific cloud-based technology needs of particular industries.</p>\n<p>Survey respondents overwhelmingly agree that the right tools are critical for managing multi-cloud environments and address a variety of challenges for every component of their cloud efforts, including provisioning, networking, security, and application deployment, as shown here:</p><img src=\"https://www.datocms-assets.com/2885/1631041285-infra-automation-importance-edited.png\" /><p>While the cloud vendors offer their own infrastructure management tools, they typically cover only that provider’s environment — forcing multi-cloud shops to master multiple different workflows or find cloud-agnostic, unified workflow solutions. Perhaps that’s why 94% of respondents say infrastructure automation tools are “important” or “extremely important” for organizations to overcome challenges and operationalize their multi-cloud environments, while only 1% say infrastructure automation tools are “not important.”</p>\n<p>Looking at this by industry, provisioning tools are most used by consumer/retail companies (80%) and least used in the public sector (68%). For networking tools, software/services firms are the most avid users (61%) while the public sector lags here too (47%). Security tools are most heavily used in the financial industry (56%), while again, the public sector trails with just 41% usage. Finally, entertainment/media companies and financial services firms lead the pack with 73% using application deployment tools, compared to just 58% in the public sector.</p>\n<p>Going forward, we expect to see significant growth in the public sector’s interest in infrastructure automation tools. Between the shift to more multi-cloud deployments, <a href=\"https://www.whitehouse.gov/briefing-room/presidential-actions/2021/05/12/executive-order-on-improving-the-nations-cybersecurity/\">executive orders</a> increasing the priority of zero trust security, and greater experience with cloud technologies, cloud automation tools seem likely to become a greater priority for many public sector organizations. This could help them to better balance the need to accelerate their digital transformation while compensating for the resource and skills gaps present in their organizations.</p>\n<h2><a href=\"#conclusion\">»</a><a></a>Conclusion</h2>\n<p>While survey respondents from different industries expressed varied needs, business goals, competitive dynamics, and budgets, they share the conviction that multi-cloud is the future. Interestingly, the one key area that determines the status of their multi-cloud initiatives seems to be how long their industry has been focused on digital transformation.</p>\n<p>Telcos and software firms that got in on the ground floor of cloud adoption are seeing more benefits, investing in larger programs, and expanding the stack of solutions they use to support it. Conversely, industries that were initially resistant to the cloud — the public sector and healthcare, for example — appear to lag behind their peers in other markets. As a result, they may still be dealing with many of the challenges that cloud automation tools can help alleviate.</p>\n<p>For more insights into how companies are transitioning to the cloud and multi-cloud environments, check out the full <a href=\"https://www.hashicorp.com/state-of-the-cloud\">HashiCorp State of Cloud Strategy Survey</a>. And <a href=\"https://www.hashicorp.com/blog/tags/hashicorp-survey-reports\">read more survey analysis</a> in the HashiCorp blog.</p>","author":"Tom O’Connell","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"3153a3a41431d82eaf5d9c4787f5d6774b2ff32247968dc523315d2714fe8bd0","category":"Tech"}