{"title":"Fitness consequences of variation in social group size are not population‐specific but are associated with access to food in the communally breeding rodent, Octodon degus","link":"https://onlinelibrary.wiley.com/doi/10.1111/eth.13491?af=R","date":1718625340000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/357a05d7-0c8d-4e9f-8be5-fa045af06d54/eth13491-toc-0001-m.png\" alt=\"Fitness consequences of variation in social group size are not population-specific but are associated with access to food in the communally breeding rodent, Octodon degus\" />\n<p>In one of two degu (<i>Octodon degus</i>) populations, individuals in intermediate-sized social with access to abundant food, but not individuals in groups with access to poor food resources, produced the most offspring per capita. These patterns were observed in two of the 3 years of study. These results imply that the benefits of group-living are associated with optimal group sizes, but only in certain contexts.</p>\n<br />\n<h2>Abstract</h2>\n<p>Studies that concurrently investigate the functional benefits of group living in multiple populations of the same species are rare. Over a 3-year period (2014–2016), we examined two ecologically contrasting populations to test multiple hypotheses for the adaptive significance of group living in the communally breeding rodent <i>Octodon degus</i>. We quantified the size of social units (number of adults, number of adult females), edible vegetation at burrow systems, and per capita offspring weaned (PCOW) in each population. Contrary to expectations, we did not observe population-specific associations between group size and edible vegetation or PCOW nor universal benefits of group living. In one population, PCOW increased in mid-sized groups with more edible vegetation. However, this trend was not consistent across years. Notably, we observed a complete reproductive failure in one population during the first year of study, one that was characterized by low rainfall and no detectable edible vegetation. This result is important because reproductive failure occurred regardless of group size, suggesting that communal living may not buffer degus against the harshest of environmental conditions. Examining how social organization shapes individual reproductive success under extreme variation in food availability is an important step towards understanding how populations will respond to a changing climate.</p>","author":"Loren D. Hayes, \nMadeline K. Strom, \nCecilia León, \nJuan Ramírez‐Estrada, \nSara Grillo, \nCuilan L. Gao, \nRodrigo A. Vásquez, \nLuis A. Ebensperger","siteTitle":"Wiley: Ethology: Table of Contents","siteHash":"7a94182f50d5fe321f60efa1a57eebe5c3e6a74d1fa25ba04a906a999025c0b6","entryHash":"3157981517e0afde16d3f1d67ad7dae742132e4c02fb49eb90f2e92dc3caebc7","category":"Environment"}