{"title":"Feasibility of Emergency Flood Traffic Road Damage Assessment by Integrating Remote Sensing Images and Social Media Information","link":"https://www.preprints.org/manuscript/202408.1232/v1","date":1724034807000,"content":"In the context of global climate change, the frequency of sudden natural disasters is increasing. Assessing traffic road damage post-disaster is crucial for emergency decision-making and disaster management. Traditional ground observation methods for evaluating traffic road damage are limited by the timeliness and coverage of data updates. Relying solely on these methods does not adequately support rapid assessment and emergency management during extreme natural disasters. Social media, a major source of big data, can effectively address these limitations by providing more timely and comprehensive disaster information. Motivated by this, we utilized multi-source heterogeneous data to assess the damage to traffic roads under extreme conditions and established a new framework for evaluating traffic roads in cities prone to flood disasters caused by rainstorms. The approach involves several steps: First, extracting the surface area affected by precipitation using a threshold method constrained by confidence intervals derived from microwave remote sensing images; Second, collecting disaster information from the Sina Weibo platform, where social media information is screened and cleaned. A quantification table for road traffic loss assessment was defined, and a social media disaster information classification model combining text convolutional neural networks and attention mechanisms was proposed (TextCNN-Attention Disaster Classification); Finally, matching traffic road information on social media with basic geographic data, visualizing the classification of traffic road disaster risk levels, and completing the assessment of traffic road disaster levels based on multi-source heterogeneous data. Using the \"7.20\" rainstorm event in Henan Province as an example, this study categorizes the disaster impact on traffic roads into five levels: particularly severe, severe, moderate, mild, and affected, as interpreted from remote sensing images. The evaluation framework for flood disaster traffic roads based on multi-source heterogeneous data provides important data support and methodological support for enhancing disaster management capabilities and systems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"31590c47059df481100d0f2d4c017c173cf6146096db78c32a4c24f3c4e916ee","category":"Interdisciplinary"}