{"title":"External Scaffold for Strengthening the Pulmonary Autograft in the Ross Procedure","link":"https://www.preprints.org/manuscript/202409.1765/v1","date":1727146657000,"content":"Despite offering several potential benefits over standard prosthetic aortic valve replacement, the use of the pulmonary autograft has been limited to date, due to concerns over the risk of pulmonary autograft expansion and the need for reintervention. Several techniques using materials with biomimetic potential have been developed to reduce this complication. The incidence, risk factors and pathophysiology of pulmonary autograft dilatation are discussed in this article. This seminar will provide an overview of the techniques of external pulmonary autograft support and their advantages and limitations. It also considers future directions for further investigation and future clinical applications of external pulmonary autograft support. Dilatation of the autograft is more likely to occur in patients with aortic regurgitation and a dilated aortic annulus. External scaffolding may prevent autograft stretching and expansion in these specific cases. However, from a biomimetic point of view, any permanent scaffold potentially restricts the movement of the autograft root. This reduces some of the benefits associated with the use of autologous tissue, which is the priority of the Ross procedure. To address this issue, several  bioresorbable matrix could be used to support the root during its initial adaptive phase. Control of blood pressure with aggressive therapy is the first line to avoid this problem in the first year after pulmonary autograft implantation, together with support of the annular and sino-tubular junction in some selected cases. This is the best way to maintain stable autograft root dimensions while preserving root dynamics. However, to determine the efficacy of this combined external support and best medical management, it is important to perform regular imaging and clinical follow-up.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"31648b435249a36d2f0af7c9f541baab9c1194a9c0605625f05b6fece586d583","category":"Interdisciplinary"}