{"title":"Harvest of transboundary grey wolves from Yellowstone National Park is largely additive","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14720?af=R","date":1721713157000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/587a6b8b-e3be-43e4-b808-12cbe81ea0a8/jpe14720-toc-0001-m.png\" alt=\"Harvest of transboundary grey wolves from Yellowstone National Park is largely additive\" />\n<p>High rates of additive harvest mortality of wolves could negatively impact wolf survival in YNP. Harvest mortality of transboundary wolves is additive possibly due to source-sink dynamics of uneven spatial susceptibility of wolves to harvest mortality across protected area borders, as well as effects of harvest on complex social dynamics of wolves in YNP. Transboundary management of large carnivores is challenging, yet cooperation between agencies is vital for wolf management in and around YNP. Our results support the use of small quota zones surrounding protected areas, that minimize transboundary mortality impacts on large carnivores living primarily inside protected areas.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLarge carnivores are globally threatened due to habitat fragmentation and loss, prey depletion and human exploitation. Human exploitation includes both legal and illegal hunting and trapping. Protected areas can create refugia from hunting and trapping; however, hunting can still threaten wide-ranging large carnivores when they leave these areas. Large carnivore reintroductions to protected areas are often motivated to restore ecological processes, including wolf reintroduction to Yellowstone National Park (YNP). Determining if harvest is compensatory or additive is essential for informed conservation strategies, as it influences the overall impact on wolf populations and their ecosystems.\n\nIf harvest was compensatory, then increasing harvest pressure outside YNP should not decrease overall survival for transboundary wolves. Alternatively, if increasing harvest was additive, then increasing harvest pressure outside YNP should decrease overall survival for transboundary wolves. We tested the effects of variable harvest pressure following delisting on the survival of YNP grey wolves (<i>Canis lupus</i>) from 1995 to 2022. We defined three harvest levels: no harvest, harvest with limited quotas and unlimited harvest. We used Cox-proportional hazards models and cumulative incidence functions to estimate survival rates, factors affecting survival and cause-specific mortality between these three harvest periods to test predictions of the additive mortality hypothesis.\n\nMost harvested wolves that primarily lived in YNP were killed adjacent to the park border. Cox-proportional hazards models revealed that mortality was highest during years of unlimited harvest during winter outside YNP. Cause-specific mortality analyses showed that natural mortality from other wolves and harvest were the two leading causes of death, but that harvest mortality had additive effects on wolf mortality. Wolf survival decreased with increased harvest mortality, while natural mortality remained relatively unchanged.\n\n<i>Synthesis and applications</i>. High rates of additive harvest mortality of wolves could negatively impact wolf survival in YNP. Harvest mortality of transboundary wolves is additive possibly due to source-sink dynamics of uneven spatial susceptibility of wolves to harvest mortality across protected area borders, as well as effects of harvest on complex social dynamics of wolves in YNP. Transboundary management of large carnivores is challenging, yet cooperation between agencies is vital for wolf management in and around YNP. Our results support the use of small quota zones surrounding protected areas, that minimize transboundary mortality impacts on large carnivores living primarily inside protected areas.\n</p>","author":"Brenna Cassidy, \nDouglas W. Smith, \nKira Cassidy, \nDaniel Stahler, \nMark Hebblewhite","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"317b8b39614b89a77cee41f131c47653ade1c3cbe5a69ac288836972d0293ef5","category":"Environment"}