{"title":"[ลือ] สาเหตุ iPad Air เพิ่ม 2 ขนาดจอ เพื่อให้คนซื้อตัดสินใจง่ายขึ้น - คาด MacBook Air M3 มาต้นปีหน้า","link":"https://www.blognone.com/node/137177","date":1702253647000,"content":"<div><div><div><p>Mark Gurman รายงานข้อมูลในจดหมายข่าว Power On ประจำสัปดาห์ โดยเขาให้รายละเอียดเพิ่มเติมจาก<a href=\"https://www.blognone.com/node/137116\">รายงานก่อนหน้านี้</a> เกี่ยวกับ iPad Air ที่รุ่นใหม่เปิดตัวต้นปีหน้าคาดว่าเดือนมีนาคม จะทำออกมาเป็น 2 ขนาดหน้าจอครั้งแรกคือ 10.9 นิ้ว และ 12.9 นิ้ว รวมถึง MacBook Air M3 ก็จะออกมาในช่วงเวลาเดียวกัน</p>\n<p>Gurman บอกว่าปัจจุบันแอปเปิลมี iPad ขายอยู่ทั้งหมด 5 รุ่นคือ iPad Pro, iPad Air, iPad 10th Gen, iPad 9th Gen และ iPad mini ซึ่งแต่ละรุ่นตอนเปิดตัวมีเป้าหมายเจาะกลุ่มที่แตกต่างกัน ปัญหาคือความต่างของแต่ละรุ่นนั้น บางครั้งเล็กน้อยจนทำให้ตัดสินใจยากว่าควรซื้อรุ่นไหน</p>\n<p>แอปเปิลแก้ปัญหานี้ไปแล้วใน MacBook โดยแบ่งเป็น MacBook Pro เป็นรุ่นบน มีสองขนาดจอ และ MacBook Air เป็นรุ่น entry มีสองขนาดจอคู่กันแต่เล็กกว่าเล็กน้อย โดยแอปเปิลจะใช้วิธีการนี้สำหรับ iPad Pro กับ iPad Air ด้วย จึงเลือกทำสองขนาดหน้าจอ iPad Pro เทียบแล้วจอใหญ่กว่า iPad Air รวมทั้งทำสเป็กที่แตกต่างกันซึ่งน่าจะช่วยให้คนซื้อตัดสินใจได้ง่ายขึ้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b3076a37db07c8df59d67cdd0956c287.jpg\" /></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/23aee1429c147073bd5191905cc2946c.png\" /><em>iPad รุ่นทั้งหมดที่ขายอยู่ตอนนี้</em></p>\n<p>อย่างไรก็ตาม iPad รุ่นอื่นก็ยังมีขายต่อไป แต่จะทำตลาดเจาะกลุ่มเฉพาะชัดเจนแยกจาก iPad Pro และ iPad Air โดย iPad รุ่น entry ต้องมีต่อไปเพื่อเจาะตลาดการศึกษา ไม่ให้ Chromebook เข้ามาชิงพื้นที่ และ iPad mini มีฐานลูกค้าชัดเจนจึงต้องทำขายด้วยเช่นกัน ทั้งนี้เมื่อแอปเปิลเปิดตัว iPad 11th Gen ก็จะเลิกขาย iPad 9th Gen และทำให้สามารถตัด Apple Pencil รุ่นแรกได้ ก็จะช่วยลดความสับสนของ Apple Pencil ไปหนึ่งอย่างด้วย</p>\n<p>สุดท้าย Gurman อัพเดตเรื่อง MacBook Air M3 ซึ่งคาดว่าจะเปิดตัวพร้อมกับ iPad ในเดือนมีนาคม เขาเชื่อว่าการนำเสนอจะเจาะกลุ่มคนใช้ MacBook Air M1 และ MacBook Air ซีพียูอินเทลเป็นหลักให้มาอัพเกรด คล้ายกับตอนเปิดตัว MacBook Pro ที่ใช้วิธีการนี้ เนื่องจากกลุ่ม M2 ยังพอใจกับประสิทธิภาพใช้งาน</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/newsletters/2023-12-10/apple-aapl-to-fix-confusing-ipad-lineup-with-new-ipad-pro-mid-tier-ipad-air-lpzjekw4\">Bloomberg</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/rumors\">Rumors</a></div><div><a href=\"/topics/ipad-air\">iPad Air</a></div><div><a href=\"/topics/ipad-pro\">iPad Pro</a></div><div><a href=\"/topics/ipad\">iPad</a></div><div><a href=\"/topics/ipad-mini\">iPad mini</a></div><div><a href=\"/topics/macbook-air\">Macbook Air</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"318c592d88be89f458738bc205bd172f1d379051757602ee86473b34c7064d33","category":"Thai"}