{"title":"How free-ranging Indian Flying Fox (Pteropus medius) forage in urban areas? A study from Kolkata, India","link":"https://academic.oup.com/jue/article/doi/10.1093/jue/juae007/7640028?rss=1","date":1712102400000,"content":"<span><div>Abstract</div>Foraging behaviour plays a significant role in the fitness of animals and is influenced by habitat quality. Habitat change due to rapid urbanization often results in altered behaviour and resource use patterns in animals thriving in such changed habitats. Bats play a crucial role as tree pollinators, seed dispersers and forest regenerators. Particularly in urban areas they are among the few pollinators that help regenerating the urban green spaces. Therefore, it is crucial to understand their foraging patterns in these human-dominated landscapes. Loss and degradation of roost and foraging resources threatens the survival of many bat species, including Indian Flying Foxes (IFF). Still, very few studies have been carried out on their feeding behaviour and ecology. Hence, we carried out this study to (i) identify the foraging sites of IFF, (ii) find out the urban land cover features influencing their foraging site selection and (iii) to identify the foraging trees used by them in urban areas. IFFs were observed to forage on 16 species of trees belonging to 10 families in four different sites in urban areas, of which <span>Ficus</span> species are most important. Amongst various urban land covers, the area of tree cover in the foraging sites were found to significantly influence the number of foraging IFFs. Our findings strongly advocate for the protection of the trees preferred by IFFs along with overall urban tree canopy covers, as these are essential resources for the survival of bats, as well as many other species in urban areas.</span>","author":"","siteTitle":"Journal of Urban Ecology Current Issue","siteHash":"b2629340d80db12a388ca36fcbfe9116474ee0004e4144e67708fd2b8d69c975","entryHash":"319553037d8a4d6f9e0c8493def5213595825e93366d23b3f88912bd7a3aa678","category":"Environment"}