{"title":"Superlattice Symmetries Reveal Electronic Topological Transition in CaC6 with Pressure","link":"https://www.preprints.org/manuscript/202405.1514/v1","date":1716460371000,"content":"The electronic properties of calcium intercalated graphite (CaC6) as a function of pressure are revisited using density functional theory (DFT). The electronic band structures of CaC6, like many other layered superconducting materials, display cosine-shaped bands at or near the Fermi level (FL). Such bands encompass bonding/antibonding information with a strong connection to superconducting properties. Using an hexagonal cell representation for CaC6, construction of a double supercell in the c-direction effects six-folding in reciprocal space of the full cosine function, explicitly revealing the bonding/antibonding relationship divide at the cosine midpoint. Similarly, folding of the Fermi surface (FS) reveals physical phenomena relevant to electronic topological transitions (ETT) with application of pressure. For CaC6, the peak value for the superconducting transition temperature, Tc, occurs at about 7.5 GPa, near to the observed pressure of the calculated ETT. At this pressure, the radius of the nearly spherical Ca 4s-orbital FS coincides with three times the distance from the G centre point to the Brillouin zone (BZ) boundary of the 2c supercell (which is equal to half the identically defined distance for the primitive rhombohedral BZ). In addition, the ETT coincides with alignment of the non-bonding (inflection) point of the cosine band (the point at which the sign of the cosine amplitude modulation is reversed) with the FL. At other calculated pressure conditions, the Ca 4s-orbital FS undergoes topological changes that correspond and can be correlated to experimentally determined changes in Tc. The ETT is a key mechanism that circumscribes the known significant drop in Tc for CaC6 as a function of increasing pressure.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"31b8ee5d8cfe8867fb74f402c1a743c0829a4043fefd3445e257b1173c5f2f82","category":"Interdisciplinary"}