{"title":"“Vulture bees” evolved a taste for flesh—and their microbiomes reflect that","link":"https://arstechnica.com/?p=1815234","date":1637703985000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/vulturebee1CROP-800x531.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/vulturebee1CROP.jpg\">Enlarge</a> <span>/</span> University of California, Riverside scientists suspended fresh pieces of raw chicken from branches to attract carrion-feeding \"vulture bees\" in Costa Rica. (credit: Quinn McFrederick/UCR)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Ask a random person to picture a bee, and they'll likely conjure up the familiar black-and-yellow striped creature buzzing from flower to flower collecting pollen to bring back to the hive. But a more unusual group of bees can be found \"slicing chunks of meat from carcasses in tropical rainforests,\" according to the authors of <a href=\"https://journals.asm.org/doi/10.1128/mBio.02317-21\">a new paper</a> published in the journal mBio. As a result, these bees have gut microbiomes that are markedly different from their fellow buzzers, with populations more common to carrion-loving hyenas and vultures. So they are commonly known as \"vulture bees\" (or \"carrion bees\").</p>\n<p>According to the authors—entomologists who hail from the University of California, Riverside (UCR), the University of Massachusetts, Amherst, Columbia University, and the American Museum of Natural History—most bees are essentially \"wasps that switched to a vegetarian lifestyle.\" But there are two recorded examples of bumblebees feeding on carrion dating back to 1758 and 1837, and some species are known to occasionally feed on carrion in addition to foraging for nectar and pollen. (They are considered \"facultatively necrophages,\" as opposed to vulture bees, which are deemed \"obligate necrophages\" because they only eat meat.)</p>\n<p>An entomologist named Filippo Silvestri identified the first \"vulture bee\" in 1902 while analyzing a group of pinned specimens, although nobody called it that since they didn't know at the time that this species fed on carrion. Silvestri dubbed it <em>Trigona hypogea</em>, and he also described their nests as being used for honey and pollen, although later researchers noted a surprising absence of pollen. Rather, biochemical analysis revealed the presence of secretions similar to those fed to queen bees in the nests of honeybees.</p></div><p><a href=\"https://arstechnica.com/?p=1815234#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1815234&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"31ba89bbf5c8bb368776f81e6f92d58b53550896ffc993790336466f48654d73","category":"Tech"}