{"title":"Perched Hydrologic Systems of the Monahans and the Kermit Dune Fields, Northern Chihuahuan Desert West Texas, USA","link":"https://www.preprints.org/manuscript/202408.1732/v1","date":1724413516000,"content":"This study highlights the importance of quantifying groundwater resources for the Monahans and Kermit dune fields in the northern Chihuahua Desert, West Texas USA as potential contributors to the regional Pecos Valley Aquifer (PVA). Sedimentary architecture models of these dune fields show perched aquifers with water tables 1-10m below the surface and southwestward groundwater flow sub-parallel to a Pleistocene/Pliocene aquitard. Sinkhole-like features into the top of the aquitard are infilled with the thickest occurrences of aeolian sand. Groundwater recharge occurs from the enhanced capture of precipitation on mostly bare active dunes where infiltration rates &gt;250mm/hr. The deuterium and oxygen isotopic ratios for groundwater from the Kermit and Monahans dune fields show pronounced evaporative isotopic depletion and less isotopic variability than corresponding rainfall, particularly for deuterium values. Groundwater from a shallow central well in the Kermit dune field yielded contemporary 14C activity (Fm =1.02), indicating contributions from recent precipitation. In contrast, more evolved 14C values at the western margin (FM=0.84) and at 30m below the surface (FM=0.76), similar to proximal Fm values from the PVA (0.89-0.82), may indicate dissolution of older (&amp;gt; 100 ka) DIC from buried playa-lake sediments and carbonate-soils with groundwater flux to the southwest, and less direct atmospheric influence. The perched aquifers of the Monahans and Kermit dune fields contain water volumes &gt; 0.1 km3 and may contribute up to 9% of the total annual recharge to the PVA.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"31bcf1de6d3fff0635a702a7ca387b94dfa66c548b23c391675fb2fae8c06f1d","category":"Interdisciplinary"}