{"title":"Touch Bar Fully Discontinued on New MacBooks After Seven Years","link":"https://www.macrumors.com/2023/10/31/touch-bar-discontinued/","date":1698759818000,"content":"Just over seven years after it was introduced, the Touch Bar has now been fully discontinued on all new MacBooks sold by Apple, marking the end of an era for a hardware feature that was loved by some users and derided by others.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/07/Touch-Bar-13-Inch-MacBook-Pro.jpg\" width=\"1364\" height=\"769\" />\r<br />\nThe first MacBook Pro models with the Touch Bar were released in October 2016, as part of a controversial redesign that also included a defective butterfly keyboard and the removal of many ports, including an SD card slot, HDMI, and MagSafe. Physical function and Esc keys were also removed in favor of the Touch Bar.\r<br />\n\r<br />\nApple initially <a href=\"https://www.apple.com/newsroom/2016/10/apple-unveils-groundbreaking-new-macbook-pro/\">described</a> the Touch Bar as a \"revolutionary\" and \"breakthrough\" interface, but it was clearly not popular enough to stick around.\r<br />\n\r<br />\nIt was a slow death for the Touch Bar:<ul><li>In 2019, Apple released the first 16-inch MacBook Pro with a physical Esc key, but the Touch Bar lived on in place of physical function keys.</li>\r<br />\n<li>In 2021, Apple removed the Touch Bar from higher-end MacBook Pro models, switching back to full-size physical function keys.</li>\r<br />\n<li>This week, Apple <a href=\"https://www.macrumors.com/2023/10/30/apple-discontinues-13-inch-macbook-pro/\">discontinued the 13-inch MacBook Pro</a>, the final model with a Touch Bar.</li></ul>For now, the Touch Bar can still be found on some <a href=\"https://www.apple.com/shop/refurbished/mac/13-inch-macbook-pro\">refurbished models</a> sold by Apple.\r<br />\n\r<br />\nIt's possible that the Touch Bar could return at some point in the future, especially if the 13-inch MacBook Pro is ever re-released as a lower-cost model, but at this point there is no firm evidence to suggest this will happen.<div>Tag: <a href=\"https://www.macrumors.com/guide/touch-bar/\">Touch Bar</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/31/touch-bar-discontinued/\">Touch Bar Fully Discontinued on New MacBooks After Seven Years</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/touch-bar-fully-discontinued-on-new-macbooks-after-seven-years.2409371/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"31c3bbd104592b7ff2428e4ff95e2d8f11cda840009d77d3f2102c2ddf508d49","category":"Apple"}