{"title":"Spy Shot: Wireless MTB Brakes?","link":"https://bikerumor.com/spy-shot-wireless-mtb-disc-brakes/","date":1702238724000,"content":"<p><img width=\"2500\" height=\"1668\" src=\"https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted.jpg\" alt=\"Spy shot of unidentified brake system\" loading=\"lazy\" srcset=\"https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted.jpg 2500w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-297x198.jpg 297w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-800x533.jpg 800w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-120x80.jpg 120w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-768x512.jpg 768w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-1536x1025.jpg 1536w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-2048x1366.jpg 2048w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-720x480.jpg 720w\" /></p>\n<p>Bicycle spy shots are kind of like photos of Bigfoot sometimes. It <em>looks</em> like something might be there, but the photo is blurry and dark making you question what you’re really seeing. But with some editing in Lightroom, sometimes more detail comes to light. </p>\n\n\n\n<p>This photo was sent to us by a reader (thanks Ben!) who states, “I was out riding in the Forest of Dean [during the] weekend with my mates, and spotted a guy riding with some strange-ass brakes. I couldn’t see cables running up to the bar. I tried to get a quick photo, but this was all I could manage.”</p>\n\n\n\n<p><em><strong>Update Below</strong></em></p>\n\n\n\n<figure><a href=\"https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-1.jpg\"><img loading=\"lazy\" width=\"800\" height=\"1070\" src=\"https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-1-800x1070.jpg\" alt=\"unknown brake system (possibly wireless) spotted\" srcset=\"https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-1-800x1070.jpg 800w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-1-224x300.jpg 224w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-1-90x120.jpg 90w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-1-768x1027.jpg 768w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-1-1149x1536.jpg 1149w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-1-1532x2048.jpg 1532w, https://bikerumor.com/wp-content/uploads/2023/12/Possible-wireless-mountian-bike-disc-brake-spotted-1.jpg 1870w\" /></a><figcaption>Ben’s photo, brightened in Lightroom</figcaption></figure>\n\n\n\n<h2>Is this a wireless mountain bike disc brake?</h2>\n\n\n\n<p>Due to the angle of the photograph, there’s no way of saying for sure, but Ben claims that he couldn’t see any hoses or wires from the brake to the bar. It’s possible the bike was running internal cables at the bar through the stem, but then we’d expect to see the front brake hose exit from the bottom of the crown. </p>\n\n\n\n<p>That’s a pretty massive device mounted around the area of the front brake, which indicates it’s more than just a brake caliper. </p>\n\n\n\n<h2>If it’s not a wireless brake system, what is it?</h2>\n\n\n\n<p>From the photo, it appears that there is a light on the device indicating that it has some sort of electronics inside. Outside of a wireless brake system, this could be a few things: like an ABS brake system or a data acquisition system monitoring the performance of the brake. Both of these devices would still need a brake hose to the lever, so unless the hose is just hidden by the angle of the photo, it still seems possible that it <em>is</em> some sort of wireless system. </p>\n\n\n\n<h2>Could it happen?</h2>\n\n\n\n<p>We’ve heard rumors over the past few years that suggest wireless brakes aren’t completely out of the question. While our feelings on the matter are mixed, what we’re seeing in this photo leads us to believe they’re still a ways off. Here’s why:</p>\n\n\n\n<p>The device is big and would require not just electronics and a pump, but also a battery, all of which add weight. Considering the brakes are always at the furthest end of the unsprung mass, that extra weight could negatively affect suspension performance as well. It also seems like it’s putting some critically important gear in a highly vulnerable spot.</p>\n\n\n\n<h2>Why Though?</h2>\n\n\n\n<p>Say this is a wireless MTB disc brake system – why would anyone want that? We can already hear the chants of a ‘solution in search of a problem,’ but there may be some real benefits to a wireless brake system. Without the need for a continuous hydraulic system from the lever to the caliper, brake levers would no longer need to be hydraulic themselves. Instead, you could simply have an electronic button at the lever or a similar brake lever shape that actuated a button. This seems like it could benefit the adaptive bike community for riders who can’t use a traditional brake lever.</p>\n\n\n\n<p>In terms of ebike use, if there were small wires leading to the system that would eliminate the need for batteries at the brake calipers which should make the system lighter. That would also open the potential for integration of ABS systems as well. </p>\n\n\n\n<p>There’s also the aesthetics of having a cable or hose-free setup at the handlebar. Currently, it seems like that would be a tradeoff between a much more cluttered area by the caliper, but it would mean the absence of cables and hoses without having to route anything through the headset. </p>\n\n\n\n<p><em>Thanks to Ben for the tip!</em></p>\n\n\n\n<h2>Update: It is wireless!</h2>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>That didn’t take long: thanks to the tip by Frederic in the comments, we see that this is a wireless brake system. The video from GMBN above was just released 10 hours ago, and features the work of Blake Samson!</p>\n<p>The post <a href=\"https://bikerumor.com/spy-shot-wireless-mtb-disc-brakes/\">Spy Shot: Wireless MTB Brakes?</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Zach Overholt","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"31c7ee165b620ce16c7c0353a2e9ee4ac88006d0485cb3498411790758df373f","category":"Cycling"}