{"title":"Apple Highlights iPhone Feature That Lets You Preserve Your Own Voice","link":"https://www.macrumors.com/2023/11/30/apple-ad-for-personal-voice-feature/","date":1701358090000,"content":"Apple today shared a <a href=\"https://www.youtube.com/watch?v=ra9I0HScTDw\">heartwarming ad</a> for its new <a href=\"https://www.macrumors.com/2023/06/05/ios-17-personal-voice/\">Personal Voice accessibility feature</a>, available on the iPhone, iPad, and Mac.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Personal-Voice-iPhone-Feature.jpeg\" width=\"1600\" height=\"900\" />\r<br />\nIntroduced with iOS 17, iPadOS 17, and macOS Sonoma, Personal Voice allows those at risk of losing their ability to speak to create a synthesized voice that sounds similar to their actual voice, so they can continue to communicate with others.\r<br />\n\r<br />\nPersonal Voice integrates with another accessibility feature called Live Speech, which lets users type what they want to say to have it be spoken aloud during in-person conversations, phone calls, and FaceTime video calls.\r<br />\n\r<br />\nIn the two-minute video, called \"The Lost Voice,\" <a href=\"https://www.apple.com/newsroom/2023/11/a-disability-advocate-preserves-his-voice-with-iphone/\">physician and disability advocate Tristram Ingham</a> uses Personal Voice and Live Speech to read aloud a bedtime story to a young girl.\r<br />\n\r<br />\n<div></div>\r<br />\nTo create a Personal Voice, users read aloud a randomized set of text prompts until 15 minutes of audio has been recorded. The feature can be found in the Settings app under Accessibility → Personal Voice, and it is currently available for English only. Apple says the feature uses on-device machine learning for privacy and security.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-ads/\">Apple Ads</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/30/apple-ad-for-personal-voice-feature/\">Apple Highlights iPhone Feature That Lets You Preserve Your Own Voice</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-highlights-iphone-feature-that-lets-you-preserve-your-own-voice.2412472/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"31d10c81aee13040960a7a3d1ba772b1af4403c9e71f40d2b64d6b6f8a899286","category":"Apple"}