{"title":"FloodNet: Low‐Cost Ultrasonic Sensors for Real‐Time Measurement of Hyperlocal, Street‐Level Floods in New York City","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036806?af=R","date":1715087724000,"content":"<h2>Abstract</h2>\n<p>Flooding is one of the most dangerous and costly natural hazards, and has a large impact on infrastructure, mobility, public health, and safety. Despite the disruptive impacts of flooding and predictions of increased flooding due to climate change, municipalities have little quantitative data available on the occurrence, frequency, or extent of urban floods. To address this, we have been designing, building, and deploying low-cost, ultrasonic sensors to systematically collect data on the presence, depth, and duration of street-level floods in New York City (NYC), through a project called FloodNet. FloodNet is a partnership between academic researchers and NYC municipal agencies, working in consultation with residents and community organizations. FloodNet sensors are designed to be compact, rugged, low-cost, and deployed in a manner that is independent of existing power and network infrastructure. These requirements were implemented to allow deployment of a hyperlocal, city-wide sensor network, given that urban floods often occur in a distributed manner due to local variations in land development, population density, sewer design, and topology. Thus far, 87 FloodNet sensors have been installed across the five boroughs of NYC. These sensors have recorded flood events caused by high tides, stormwater runoff, storm surge, and extreme precipitation events, illustrating the feasibility of collecting data that can be used by multiple stakeholders for flood resiliency planning and emergency response.</p>","author":"Charlie Mydlarz, \nPraneeth Sai Venkat Challagonda, \nBea Steers, \nJeremy Rucker, \nTega Brain, \nBrett Branco, \nHannah E. Burnett, \nAmanpreet Kaur, \nRebecca Fischman, \nKathryn Graziano, \nKendra Krueger, \nElizabeth Hénaff, \nVéronëque Ignace, \nErika Jozwiak, \nJatin Palchuri, \nPolly Pierone, \nPaul Rothman, \nRicardo Toledo‐Crow, \nAndrea I. Silverman","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"31d212fb64b5c1d189f62ad87cb841038c7b1a03b2af7c44bf5f9f506a72ccfa","category":"Environment"}