{"title":"Harnessing Soil Diversity: Innovative Strategies for Potato Blight Management in Central-Eastern Poland","link":"https://www.preprints.org/manuscript/202405.1735/v1","date":1716800526000,"content":"Faced with increasing climate challenges, this pioneering study introduces groundbreaking approaches to ensure the resilience of potato crops in east-central Poland. Our research aimed to develop an innovative, cost-effective system tailored to the diverse local conditions of this region. Conducted between 2018 and 2020, the study analyzed integrated and organic production systems across different soil types and potato varieties. The experiment was conducted using a randomized block design with three replications in two locations. Integrated practices, enhanced by mineral fertilization and chemical protection, notably delayed the onset of late blight by 16 days and extended the critical infection period by 17% compared to their organic counterparts. Remarkably, the integrated systems resulted in a 49% increase in total production and a 52% increase in commercial yields, demonstrating their effectiveness in enhancing crop resilience. Different potato varieties exhibit varied responses to cultivation systems, influencing both yield and disease resistance. Further investigation into these varietal responses can help optimize cultivation practices, leading to improved efficiency and sustainability in potato farming. Location and soil conditions have a significant impact on potato yield and the spread of potato blight. Further research into specific soil properties and the adaptation of varieties to local conditions can contribute to increased productivity and stability in potato production. This study not only paves the way towards sustainable agriculture but also highlights the crucial role of soil diversity in shaping resilient farming practices.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"31d4583651b81b4b8596a7d7397bc7797dc1be2dda6310f3878942ef96a7a738","category":"Interdisciplinary"}