{"title":"A protocol for the longitudinal investigation of cancer related fatigue in head and neck cancer with an emphasis on the role of physical activity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308400","date":1723644000000,"content":"<p>by Prahalad Narasimhan, Andrew R. Levy, Simon N. Rogers, Andrew G. Schache, Joanne M. Patterson, Nefyn H. Williams, Rachel C. Brooker, Adrian W. Midgley</p>\r\nBackground and aim <p>Cancer related fatigue significantly impairs the ability to undertake sustained physical activity across the domains of daily living, work and recreation. The purpose of this study is to monitor cancer related fatigue and the factors affected or caused by it for 12 months in head and neck cancer patients following their diagnosis. Their perceptions of how fatigue might affect their activity levels in addition to identifying avenues to improve engagement with physical activity will be also explored.</p> Methods <p>A single centre longitudinal mixed-methods study will be conducted. Forty head and neck cancer patients will be recruited over 6 months following the confirmation of their treatment plan, after which fatigue and physical activity will be assessed at four time points over 12 months. Additionally, other factors which influence fatigue such as body composition, blood counts, systemic inflammation levels, haemoglobin concentration, thyroid function, sleep quality, cardiorespiratory fitness and upper and lower extremity strength will be measured to understand how the multifactorial problem of fatigue may evolve over time and influence physical activity levels. Semi-structured interviews will be conducted after treatment completion and at end of twelve months which will analyse the participants fatigue experiences, understand how their perceived fatigue may have impacted physical activity and report the factors which may improve engagement with physical activity during cancer. Quantitative data will be analysed and reported using standard descriptive statistics and post-hoc pairwise comparisons. The changes in outcome measures across time will be analysed using the MIXED procedure in SPSS software. Statistical significance will be accepted at p&lt;0.05. Qualitative data will be analysed using the Interpretative Phenomenological Approach using the NVivo software.</p> Discussion <p>The results from this study may help inform the planning and delivery of appropriately timed interventions for the management of cancer related fatigue.</p>","author":"Prahalad Narasimhan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"31d59f50bd48a6a39189d913383de9a67d6706a36e285c336747b99c13efb779","category":"Interdisciplinary"}