{"title":"Variation and Variability in Skeletal Ossification of the Gray Short-tailed Opossum, Monodelphis domestica","link":"https://academic.oup.com/iob/article/doi/10.1093/iob/obae024/7705602?rss=1","date":1719964800000,"content":"<span><div>Synopsis</div>By reconstructing and comparing the sequence of ontogenetic (embryonic development and post‐natal growth) events across species, developmental biologists have gained unique insights into the key processes underlying the evolution of modern lineages and their extinct relatives. However, despite the importance of intraspecific variation to evolutionary transformation and lineage divergence, variation in the sequence of developmental events is seldom acknowledged. Thus, how much variation or variability should be expected during ontogeny remains poorly understood and it is an open question to what extent it impacts interspecific comparisons of developmental patterns. To address this crucial question, we studied the skeletal development of the important biomedical and developmental model organism, <span>Monodelphis domestica</span>. We investigated cranial, forelimb, and hindlimb elements using ontogenetic sequence analysis (OSA) to quantify and assess the full range of variation and variability in the sequence of ossification. Our study documented that previously unrecognized variation exists during <span>M. domestica</span> ontogeny—with over 5000 sequences for the full 92 event analysis. Further, OSA revealed unexpectedly high variability (i.e., the propensity to express variation) in the sequence of ossification for the skull and across the entire skeleton. Reconstructed modal sequences were generally in agreement with previously recognized patterns, including earlier ossification of the facial skeleton and a slight offset between forelimb and hindlimb development. However, the full range of variation shows that the majority of specimens in our analysis followed developmental trajectories distinct from those recovered by prior studies. This level of variation is quite remarkable and demonstrates the importance of assessing intraspecific ontogenetic variation. By quantifying sequence polymorphism and studying how developmental variation and variability differ among species, we can clarify more precisely how developmental patterns differ among species and gain insights into how ontogeny itself evolves.</span>","author":"","siteTitle":"Integrative Organismal Biology Current Issue","siteHash":"ad96bcf7a80ab7e3a1a88c34298d761f9695964c0badbbef4e1166baa6580fcc","entryHash":"31d745287f48824496c96847f18d0fa5b43b5ee3795edd3b23b82379192a4be8","category":"Environment"}