{"title":"Fitbit may alienate iPhone users with its first ‘premium’ Wear smartwatch","link":"https://www.macworld.com/article/354042/fitbit-google-premium-smartwatch-apple-watch.html","date":1629972000000,"content":"<div>\n<section><div></div></section><p>During the <a href=\"https://www.pcworld.com/article/3630908/fitbits-charge-5-reveal-hints-at-the-future-of-android-wear.html\">introduction of its new Charge 5 fitness tracker</a>, Fitbit stole a bit of its own thunder with a pretty big revelation: A smartwatch based on Google’s Wear OS is on the way.</p>\n\n\n\n<p>Now that Google owns Fitbit, that isn’t too much of a surprise. However, CEO James Park’s phrasing was particularly interesting: “We’ll be building premium smartwatches based on Wear OS that combine the best of Fitbit’s health and wellness expertise with Google’s ambient computing capabilities.”</p>\n\n\n\n<p>That sounds like a perfect pairing. While Fitbit devices are still very popular with iOS users, they’re not really all that smart—and certainly not as smart as an Apple Watch. Even the Charge 5 is basically another in a long line of Fitbit trackers that do many things well but <a href=\"https://www.macworld.com/article/230491/fitbit-ionic-review.html\">doesn’t really deliver a full smartwatch experience</a>. So the prospect of a Google smartwatch with Fitbit stylings and fitness tracking could be the first Fitbit watch that’s actually as smart as an Apple Watch.</p>\n\n\n\n<p>For all intents and purposes, Fitbit has never made a true premium smartwatch to challenge the Apple Watch. The <a href=\"https://www.macworld.com/article/233247/fitbit-versa-2-review.html\">Versa</a> and <a href=\"https://www.macworld.com/article/234626/fitbit-sense-hands-on-first-impressions-sensors-design-apple-watch.html\">Sense</a> are technically categorized as smartwatches—they are watches with some smarts—but they hardly offer the array of capabilities that the Apple Watch does. You can’t type texts or emails, get real-time alerts, get turn-by-turn directions, or untether from your phone. A Wear OS watch will change that and finally elevate a Fitbit device to the level of the Apple and Galaxy watches.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/fitbit-charge-5-device.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The Fitbit Charge 5 is a good tracker but a far cry from a full-featured smartwatch.</p></figcaption></figure><p>Fitbit</p></div>\n\n\n\n<p>What they do offer is an alternative to the Apple Watch. Apple’s iconic smartwatch may be the most popular wearable by a wide margin, but there are still millions of iPhone users that want something different. Whether it’s the size, shape, price, or battery life, Fitbit’s family of devices have surprising appeal among Apple fans.</p>\n\n\n\n<p>Except iPhone users might not be allowed in. With the third generation of Wear OS, Google is locking its system up tighter and that could mean the Fitbit’s first true Apple Watch competitor doesn’t work with iPhones. </p>\n\n\n\n<h2>Wear OS vs watchOS</h2>\n\n\n\n<p>Just a few weeks ago, Google and Samsung showed off <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blog.google/products/wear-os/wear-io21/&amp;xcust=1-1-354042-1-0-0&amp;sref=https://www.macworld.com/feed\">Wear OS Powered by Samsung</a> on the Galaxy Watch 4. It’s a major change for Wear OS, not just visually, but also conceptually. Previous iterations of Wear OS were uniform across all devices—which is a large part of why Samsung broke off with its own Tizen OS—but now Google will allow device makers to tailor versions of Wear OS 3 for specific experiences. Wear OS will now be as flexible as Android, which opens the door for someone to make an iPhone/Apple Watch-like experience on Android.</p>\n\n\n\n<p>That’s where Google comes in. We’ve been hearing rumors of a Pixel Watch for year and this could finally be that device: a smartwatch that has a Pixel-inspired interface and tight integration with Google’s ecosystem. That would be unlike anything we’ve seen so far from Fitbit or Google, and a watch with Google’s smarts and Fitbit’s stylings and sensors sounds like something that could pose a serious threat to Apple’s dominance.</p>\n\n\n\n<p>Even before Fitbit’s Wear smartwatch arrives, Google has already begun to set up Wear OS as a direct competitor to watchOS. While all previous Galaxy watches were compatible with iOS, the <a href=\"https://www.macworld.com/article/353115/sorry-iphone-users-you-cant-buy-the-newest-samsung-galaxy-watch.html\">Galaxy Watch 4 only works with Android phones</a>. That might not mattter to most iPhone users, but I know more than a few Apple fans who opted to buy a Galaxy Watch due to its design and battery life. If a Fitbit Wear OS watch follows the same path, many iPhone users are going to be forced to make a difficult choice between their phone and their watch.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/fitbit-charge-5.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>If the Fitbit-Google watch is Android only, it could shut out a lot of iPhone users.</p></figcaption></figure><p>Fitbit</p></div>\n\n\n\n<p>Even if Fitbit was to continue making lower-end trackers that integrate with the Fitbit app on iOS, if the latest flagship devices don’t fully work with the iPhone, it’s going to hurt Fitbit way more than Apple. People may be content to buy a tracker with some smarts, but those same users are not going to pay hundreds of dollars for half of a smartwatch. If Wear OS support cuts off iOS from future Fitbit devices, those users are going to have to choose between their iPhone and Fitbit tracker, and most of them will likely switch to a new Apple Watch rather than an Android phone.</p>\n\n\n\n<p>A premium Fitbit smartwatch running Wear OS is definitely an intriguing notion. An Android watch with a Pixel interface, Fitbit fitness smarts, and Google AI on board is what Android users have been waiting years to get, but it might have the reverse effect on iOS users.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"31db3868ecec512c145c0cb71185b503bee1211ff715809e779fbafd0c20e229","category":"Apple"}