{"title":"แอปเปิลลดค่าคอมมิชชั่นจ่ายในแอปให้เว็บข่าว 15% แต่ต้องเข้าร่วม Apple News","link":"https://www.blognone.com/node/124450","date":1630030798000,"content":"<div><div><div><p>แอปเปิลเปิดแคมเปญ News Partner Program คือโครงการให้เว็บข่าว สำนักข่าวเข้าร่วมเพื่อสร้างเนื้อหาบน Apple News ให้คนอ่านผ่าน Apple News Format โดยแอปเปิลระบุว่าจะลดค่าคอมมิชชันการจ่ายในแอปให้ผู้ที่เข้าร่วม 15%</p>\n<p>ปกติแล้ว ค่าคอมมิชชันพื้นฐานของแอปเปิลอยู่ที่ 30% ในปีแรก และลดเหลือ 15% ในปีที่สอง แต่ในแคมเปญนี้ลดให้ 15% ตั้งแต่แรกที่เข้าร่วมเลย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/55e4b8a6dfcceb5da5d9bf120be14ae4.jpg\" /></p>\n<p>เงื่อนไขในการเข้าร่วมคือ เว็บข่าวก่อตั้งใน ออสเตรเลีย แคนาดา สหรัฐอเมริกา และสหราชอาณาจักร และเสนอข่าวในฟอร์แมต Apple News Format หรือ  JavaScript Object Notation (JSON) ใช้ในการสร้างบทความที่เหมาะกับ Mac และ iPhone  หรือถ้าไม่ใช้ก็ต้องแชร์เนื้อหาผ่านฟีด RSS, สำนักข่าวมีแอปเปิดใช้งานบน App Store และใช้งานระบบจ่ายในแอปของแอปเปิล (in-app purchase), ยอมรับข้อตกลงของ Apple Developer Program License Agreement</p>\n<p>ในช่วงนี้แอปเปิลกำลังโดนเพ่งเล็งกรณีบังคับเก็บค่าคอมมิชชันแอปภายนอก สหรัฐฯและเกาหลีเริ่มเสนอกฎหมายเพื่อควบคุมแพลตฟอร์มแล้ว และก่อนหน้านี้มีประเด็นด้วยว่า The New York Times ออกจากโครงการ News Partner Program เพราะตัวแพลตฟอร์มไม่เอื้อให้สำนักข่าวมี engagement กับคนอ่านได้โดยตรง</p>\n<p>ที่มา - <a href=\"https://techcrunch.com/2021/08/26/apple-lowers-commissions-on-in-app-purchases-for-news-publishers-who-participate-in-apple-news/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+Techcrunch+%28TechCrunch%29\">TechCrunch</a>, <a href=\"https://www.apple.com/newsroom/2021/08/apple-introduces-the-news-partner-program/\">แอปเปิล</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/apple-news\">Apple News</a></div><div><a href=\"/topics/news\">News</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"31dcf77f814aa9299d94d29d65bc3e8e04377327c589c06b51401c4778749a7b","category":"Thai"}