{"title":"มหาวิทยาลัยสหรัฐฯ หลายแห่งปิดบริการตรวจจับงานที่เขียนด้วย AI ระบุยังไม่แม่นพอ กลายเป็นกล่าวหานักศึกษาอย่างผิดๆ","link":"https://www.blognone.com/node/135911","date":1695617261000,"content":"<div><div><div><p>สำนักข่าว Bloomberg รายงานถึงมหาวิทยาลัยหลายแห่งในสหรัฐฯ เริ่มปิดฟีเจอร์ตรวจจับงานเขียนที่เขียนด้วย AI ของบริการ Turnitin ที่ปกติใช้ตรวจจับการลอกงาน แต่เมื่อทาง Turnitin เปิดฟีเจอร์ตรวจจับการเขียนด้วย AI กลับให้ผลที่ผิดพลาดสูงจนอาจจะกระทบกับนักศึกษาที่ถูกกล่าวหาได้</p>\n<p>มหาวิทยาลัย Vanderbilt วิจารณ์ Turnitin ว่าเปิดฟีเจอร์นี้ให้มหาวิทยาลัยเองโดยแจ้งล่วงหน้าเพียงไม่ถึงวัน และยังอ้างว่ามีอัตราการผิดพลาดแบบ false positive (จับว่าใช้ AI เขียนแม้เขียนเอง) เพียง 1% แต่กลับไม่ได้บอกกระบวนการทำงานภายใน เมื่อใช้งานจริงก็พบว่ามีความผิดพลาดจำนวนมาก และระบบมักจับว่างานเขียนที่เขียนโดยนักศึกษาที่ไม่ได้ใช้ภาษาอังกฤษเป็นภาษาหลักเป็นงานที่เขียนโดย AI มากกว่าปกติ</p>\n<p>ทางด้าน Turnitin ระบุว่าระบบตรวจจับนี้เป็นเพียงแนวทางช่วยเหลือผู้สอนเท่านั้น ไม่ได้กล่าวหานักศึกษาโดยตรง และตอนนี้สถาบันต่างๆ ที่เป็นลูกค้าของ Turnitin ก็ยังเปิดฟีเจอร์นี้ไว้ถึง 98%</p>\n<p>ก่อนหน้านี้ OpenAI เคยพยายามออกระบบตรวจจับงานเขียนที่เขียนด้วยปัญญาประดิษฐ์เช่นกัน <a href=\"https://www.blognone.com/node/135657\">แต่ก็พบว่าไม่แม่นยำพอ</a> บางครั้งงานเขียนที่ดังๆ เช่น บทประพันธ์ของ Shakespears ก็ยังถูกจับว่าเขียนด้วยปัญญาประดิษฐ์ และต่อให้ปัญญาระบบจนจับได้แม่นพอ ตัวนักศึกษาเองก็อาจจะปรับแก้บทความจนหลุดการตรวจจับได้อยู่ดี</p>\n<p>ที่มา - <a href=\"https://www.bloomberg.com/news/newsletters/2023-09-21/universities-rethink-using-ai-writing-detectors-to-vet-students-work\">Bloomberg</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1e82a6cf1ea2f582592f4a3eeae5c82e.jpg\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/llm\">LLM</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/education\">Education</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"31dd5168f08c729e6fc404211bd62929ca47dceb22c4c28afbdaafacb403ef2a","category":"Thai"}