{"title":"Are we really getting mad at the iPhone 14 already?","link":"https://www.macworld.com/article/545423/macalope-iphone-14-rumors-anger.html","date":1634642100000,"content":"<div>\n<section><div></div></section><p>You won’t believe this. The Macalope was in the mall yesterday and they already have the hating-on-the-iPhone-14 decorations up.</p>\n\n\n\n<p>Yes, from the guy who brought you such hits as <a href=\"https://www.macworld.com/article/230007/fake-news-bad-rumors-on-the-iphone-8.html\">“These rumors about the 2017 iPhone rumors will really anger you”</a>, <a href=\"https://www.macworld.com/article/231654/on-repeat-the-same-complaints-about-unshipped-iphones.html\">“These rumors about the 2018 iPhone will really anger you”</a>, <a href=\"https://www.macworld.com/article/232936/making-mountains-out-of-camera-bumps-how-apple-ruined-the-2019-iphones.html\">“These rumors about the 2019 iPhone will really anger you”</a> and… well, you see where this is going.</p>\n\n\n\n<p>So, you will be unsurprised to learn that, writing for the Forbes contributor network and home of the “Restore <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/The_Fantastic_Four_(unreleased_film)&amp;xcust=1-1-545423-1-0-0&amp;sref=https://www.macworld.com/feed\">the Corman Universe</a>” movement, Gordon Kelly is back to tell us <em>already</em> what we’re going to hate about the 2022 iPhones.</p>\n\n\n\n<p>Do not adjust your screens, dear readers, you read that right. <em>Next</em> year’s iPhones. If you would like to adjust your screens such that you are no longer about to read this nonsense, the horny one will understand.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.forbes.com/sites/gordonkelly/2021/10/09/apple-iphone-14-pro-max-new-design-upgrade-iphone-13-pro-max/amp/&amp;xcust=1-1-545423-1-0-0&amp;sref=https://www.macworld.com/feed\">“New Apple Leak Reveals First iPhone 14 Bad News”</a> (Tip o’ the antlers to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/Tayster/status/1447051817607569415&amp;xcust=1-1-545423-1-0-0&amp;sref=https://www.macworld.com/feed\">Tay</a>.)</p>\n\n\n\n<p>First! There will surely be much more. A veritable deluge of bad news. Surely this phone no one will see for a year is doomed. Just as all iPhones before it. Before they went on to sell extremely well.</p>\n\n\n\n<p>So, what is the thing that you will hate so much about next year’s iPhone? Well, you might want to sit down. Or lie down. In a sensory-deprivation tank. Because, according to rumors…</p>\n\n\n\n<blockquote><p>…the iPhone 14 is “unlikely” to completely replace the notch with a punch-hole cutout and just make it smaller instead.</p></blockquote>\n\n\n\n<p>Now, the Macalope knows your blood is probably boiling right now. Look down. You are squeezing the life out of a stuffed Caillou doll. It’s unrelated to this, you just hate that sanctimonious little Canadian nuisance. But, still, you’re a shook-up bottle of Rage soda.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>Hey, the Macalope hears you. You’re all about, uh, punch-hole cutouts instead of smaller notches. That’s literally what it says on your t-shirt! “I’m all about punch-hold cutouts instead of smaller notches!” Such a weird shirt. And the Macalope has some bad news for you about the new MacBook Pros.</p>\n\n\n\n<p>Alas, this is not the end of the horrible, very bad news about this phone we all already want to throw into the river. And not the good river, the <em>bad</em> river.</p>\n\n\n\n<blockquote><p>…the much hyped return of Touch ID via an in-display sensor will not be happening with the iPhone 14 either.</p></blockquote>\n\n\n\n<p>AS IF WE DIDN’T ALREADY HATE THIS AS-YET ANNOUNCED OR EVEN CONSTRUCTED PHONE WITH THE RED-HOT INTENSITY OF 10,000 PRODUCT RED SUNS.</p>\n\n\n\n<p>Now, the Macalope will use the power of clairvoyance to predict some of the other things you will hate about the iPhone 14. First of all, it will be supply constrained, even though it is a phone everyone is angry about and hates. Somehow Apple will still not be able to make enough of them to supply demand. Second, after a huge number of inexplicable sales (probably to the “Apple faithful”) Apple will cut orders, something it <a href=\"https://www.macworld.com/article/229390/groundhog-year-iphone-production-cuts-are-brand-new-every-year.html\">hasn’t</a> done <a href=\"https://www.macworld.com/article/232098/earlier-every-year-iphone-production-cut-rumors.html\">ever</a> on a phone, thus proving how much people hate it. Third, something about the camera bump.</p>\n\n\n\n<p>Okay, not so much “clairvoyance” as years of experience. Still.</p>\n\n\n\n<p>Saying what the iPhone 14 won’t have tells us nothing about what it will have. And what it will have is what will determine its level of success.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"31e5b76b8104d30b0cf172f1ecd9c583a9ec76cc20a5809bfc44631f93b4841c","category":"Apple"}