{"title":"Quinoa snack elaborated with Lactiplantibacillus plantarum CRL 1964 sourdough increases the mineral bioavailability in mice","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13815?af=R","date":1723465796000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Consumption of pseudocereal-based foods decreased in phytate concentration can provide better nutrition concerning mineral bioavailability. This study aimed to evaluate the mineral bioavailability of quinoa sourdough-based snacks in a murine model. The mice were divided into five groups. One group was fed with basal snacks; three control groups received quinoa-based snacks made from non-fermented dough, dough without inoculum, and chemically acidified dough; and the test group (GF) received quinoa snacks elaborated from sourdough fermented by a phytase-positive strain, <i>Lactiplantibacillus plantarum</i> CRL 1964. Food intake, body weight, and mineral concentration in blood and organs (liver, kidney, and femur) were determined.</p>\n<h2>RESULTS</h2>\n<p>Food consumption increased during the feeding period and had the highest (16.2–24.5%) consumption in the GF group. Body weight also increased during the 6-weeks of trial. The GF group showed higher (6.0–10.2%) body weight compared with the other groups from the fifth week. The concentrations of iron, zinc, calcium, magnesium, and phosphorus in blood, iron and phosphorus in the liver, manganese and magnesium in the kidney, and calcium and phosphorus in the femur increased significantly (1.1–2.7-fold) in the GF group compared to the control groups.</p>\n<h2>CONCLUSION</h2>\n<p>The diet that includes quinoa snacks elaborated with sourdough fermented by phytase-positive strain <i>L. plantarum</i> CRL 1964 increased the concentrations of minerals in the blood, liver, kidney, and femur of mice, counteracting the antinutritional effects of phytate. This study demonstrates that the diminution in phytate content and the consequent biofortification in minerals are a suitable tool for producing novel foods. © 2024 Society of Chemical Industry.</p>","author":"Sergio H. Sandez Penidez, \nAlejandra De Moreno De Le Blanc, \nCarla L. Gerez, \nGraciela C. Rollán","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"31f22601e201b5fe3d4854c460cfd9a04b76f9fc3f6da6bf0ba54f641805c693","category":"Environment"}