{"title":"Prognostication in Epilepsy with Integrated Analysis of Blood Parameters and Clinical Data","link":"https://www.preprints.org/manuscript/202408.1948/v1","date":1724776519000,"content":"Background/Objectives: Determining the outcome of epilepsy is crucial for making proactive and timely treatment decisions, as well as for counseling patients. Recent research efforts have focused on using various imaging techniques and EEG for prognostication; however, there is insufficient evidence regarding the role of blood parameters. Our study aimed to investigate the additional prognostic value of routine blood parameters in predicting epilepsy outcomes. Methods: We analyzed data from 1,782 patients who underwent routine blood tests within 90 days of their first visit and had a minimum follow-up duration of three years. The etiological types were structural (35.1%), genetic (14.2%), immune (4.7%), infectious (2.9%), and unknown (42.6%). The outcome was defined as the presence of seizures in the last year. Results: Initially, a multivariate analysis was conducted based on clinical variables, MRI, and EEG data. This analysis revealed that sex, age of onset, epileptiform discharge, structural etiology, and the number of antiseizure medications were related to the outcome, with an area under curve (AUC) of 0.708. Among the blood parameters, fibrinogen, bilirubin, uric acid, and aPTT were significant, with AUCs of 0.602, 0.597, 0.455, and 0.549, respectively. Including these blood parameters in the analysis slightly improved the AUC to 0.713. Conclusions: Some blood parameters were found to be related to the final outcome, potentially paving the way to understanding the mechanisms of epileptogenesis and drug resistance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"31f34a3c443b71ea9a98de6aa1d95342aed34ece311cce6dc544b48b542fc7b1","category":"Interdisciplinary"}