{"title":"Vault integrations with Intel, Pure Storage, Red Hat, and more continue to strengthen customer security","link":"https://www.hashicorp.com/blog/vault-integrations-with-intel-pure-storage-red-hat-and-more-continue-to-strengthe","date":1700499600000,"content":"<p>HashiCorp’s approach to identity-based security provides a solid foundation for companies to safely migrate and secure infrastructure, applications, and data as they move to multi-cloud environments. These new Vault partner integrations extend the HashiCorp ecosystem into new security use cases.</p>\n<img src=\"https://www.datocms-assets.com/2885/1700264260-vault_fy24_q3.png\" alt=\"vault\" /><h2>HCP Vault Secrets</h2>\n\n<p><a href=\"https://developer.hashicorp.com/vault/tutorials/hcp-vault-secrets-get-started/hcp-vault-secrets-introduction\">HCP Vault Secrets</a> centralizes secrets lifecycle management into one place, so users can eliminate context switching between multiple secrets management applications. HCP Vault Secrets is now generally available and has an exciting new feature, secrets sync. Secrets sync provides the capability for HCP Vault Secrets users to sync their app secrets with various cloud providers, developer tools, and CI systems. We are proud to highlight two integrations for secrets sync:</p>\n\n<h3>GitHub</h3>\n\n<p>GitHub is a complete AI-powered developer platform to build, scale, and deliver secure software. Currently, secrets in GitHub Actions do not have secret versioning, which can cause an influx of secret sprawl for users. GitHub stores secrets on a per-repository basis, which sometimes results in duplicate secrets created across multiple repositories. Now, by centrally managing secrets in HCP Vault Secrets and enabling the new <a href=\"https://developer.hashicorp.com/hcp/docs/vault-secrets/integrations/github-actions\">GitHub Actions</a> app, developers can automatically synchronize application secrets to GitHub for use in other Actions as part of their CI/CD workflows.</p>\n\n<h3>Vercel</h3>\n\n<p>Vercel, a platform for frontend developers, provides a frontend cloud that gives developers frameworks, workflows, and infrastructure to build a faster, more personalized web. The new Vercel <a href=\"https://developer.hashicorp.com/hcp/docs/vault-secrets/integrations/vercel\">integration</a> with HCP Vault Secrets via secrets sync allows users to automatically synchronize application secrets to a Vercel Project so developers no longer need to manually create and manage secrets themselves.</p>\n\n<h2>Vault Enterprise</h2>\n\n<p>For enterprises with special security, compliance, and unique operational requirements, Vault Enterprise delivers self-managed functionality to customers. We’re pleased to announce two new Vault Enterprise integrations. </p>\n\n<h3>Intel</h3>\n\n<p>Intel, a world leader in the design and manufacturing of essential technologies that power the cloud, delivered a new integration between <a href=\"https://www.hashicorp.com/partners/tech/intel-corporation#vault\">Intel Trusted Domain Extensions (Intel TDX)</a> and Vault. This new integration deploys Vault to a trust domain that ensures any secrets called from Vault are protected while in use.</p>\n\n<h3>Pure Storage</h3>\n\n<p>Pure Storage strengthens customers' data storage and organization through enhanced monitoring, analyzing, and threat response. The new<a href=\"https://www.hashicorp.com/partners/tech/pure-storage#vault\"> Pure Storage FlashArray KMIP integration</a> now supports HashiCorp Vault Enterprise external key manager for encryption of customer array data utilizing the KMIP protocol. In addition, the Pure Storage Rapid Data Locking (RDL) feature of this integration further secures array data by not relying on a local, physical module for key storage.</p>\n\n<h2>Vault Community</h2>\n\n<p>Vault simplifies cloud security automation on fully managed infrastructure. Get started for free with these 6 community integrations for basic secrets management.</p>\n\n<h3>BuddyWorks</h3>\n\n<p>BuddyWorks offers web-based and self-hosted continuous integration and continuous delivery (CI/CD) software for developers that can be used to build, test, and deploy websites and applications with code from GitHub, Bitbucket, and GitLab. Developers utilizing the Buddy platform can now <a href=\"https://www.hashicorp.com/partners/tech/buddy#all\">connect to Vault</a> to consume secrets managed by Vault in their CI/CD pipelines, no longer needing to store them in Buddy.</p>\n\n<h3>Couchbase</h3>\n\n<p>Couchbase Capella (Couchbase’s cloud-based DBaaS product) fuses the agility and performance of a NoSQL database and the strengths of an RDBMS while extending those capabilities to IoT devices with mobile syncing app services. The <a href=\"https://github.com/couchbasecloud/vault-plugin-database-couchbasecapella\">new Vault database plugin for Couchbase Capella</a> enables dynamic secrets management for services that need access to Couchbase Capella.</p>\n\n<h3>JetBrains</h3>\n\n<p>JetBrains is a global software company specializing in the creation of intelligent, productivity-enhancing tools for software developers and teams. JetBrains has developed a Vault integration with both its <a href=\"https://github.com/JetBrains/teamcity-hashicorp-vault-plugin\">CI/CD platform TeamCity</a> for dynamic secrets creation at build starts and its <a href=\"https://blog.jetbrains.com/space/2022/02/10/introducing-support-for-vault-secrets-in-space-automation/\">code collaboration platform Space </a>that will connect to a customer-managed instance of Vault for on-the-fly credentials, reducing secrets sprawl, in Space Automation scripts.</p>\n\n<h3>OpsMx Inc</h3>\n\n<p>OpsMx continuous delivery solutions automate CD pipelines using the power of Spinnaker and Argo plus deep integrations with more than 70 CI/CD tools. The <a href=\"https://docs.opsmx.com/additional-resources/previous-releases/isd-3.12/codelabs/how-to-integrate-vault-with-spinnaker\">OpsMx platform can now employ Vault</a> to provide secrets for dynamic Kubernetes accounts in customers’ automated Spinnaker deployment pipelines, removing the need to continually redeploy Clouddriver when each new account is created.</p>\n\n<h3>Red Hat</h3>\n\n<p>Red Hat is an enterprise software company with an open source development model based on Linux. While developers can consume secrets directly from Kubernetes Secrets, the new <a href=\"https://catalog.redhat.com/software/containers/hashicorp/vault-secrets-operator/64dd558c892694d397c4bb06?architecture=amd64&amp;image=6532bccbd61c7d58472bf3e9&amp;container-tabs=overview\">Vault Secrets Operator for Red Hat OpenShift</a> fills the gap left by Kubernetes, which does not provide secrets management. Developers no longer have to make their Kubernetes apps Vault-aware. The new operator consolidates brokering, secrets management (including dynamic secrets), rotation, and security policy compliance in one platform.</p>\n\n<h2>Join the Vault Integration Program</h2>\n\n<p>To learn more about the Vault Integration Program and to apply to become a validated partner. Please visit our <a href=\"https://www.hashicorp.com/partners/become-a-partner#technology\">Become a Partner page</a> or join us at <a href=\"https://reinvent.awsevents.com/\">AWS re:Invent in Las Vegas</a>, November 27 - December 1, 2023.</p>\n","author":"Nicole Bahr","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"31f36c0c29e994206f86e5a3409233e4fa771d59e22b933ef4124614dfc1bdaa","category":"Tech"}