{"title":"Novel high‐throughput oxygen saturation measurements for quantifying the physiological performance of macroalgal early life stages","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13489?af=R","date":1722952763000,"content":"<h2>Abstract</h2>\n<p>Understanding how macroalgal forests will respond to environmental change is critical for predicting future impacts on coastal ecosystems. Although measures of adult macroalgae physiological responses to environmental stress are advancing, measures of early life-stage physiology are rare, in part due to the methodological difficulties associated with their small size. Here we tested a novel, high-throughput method (rate of oxygen consumption and production; V̇O2$$ \\dot{V}{\\mathrm{O}}_2 $$) via a sensor dish reader microplate system to rapidly measure physiological rates of the early life stages of three habitat-forming macroalgae, the kelp <i>Ecklonia radiata</i> and the fucoids <i>Hormosira banksii</i> and <i>Phyllospora comosa</i>. We measured the rate of O<sub>2</sub> consumption (respiration) and O<sub>2</sub> production (net primary production) to then calculate gross primary production (GPP) under temperatures representing their natural thermal range. The V̇O2$$ \\dot{V}{\\mathrm{O}}_2 $$ microplate system was suitable for rapidly measuring physiological rates over a temperature gradient to establish thermal performance curves for all species. The V̇O2$$ \\dot{V}{\\mathrm{O}}_2 $$ microplate system proved efficient for measures of early life stages of macroalgae ranging in size from approximately 50 μm up to 150 mm. This method has the potential for measuring responses of early life stages across a range of environmental factors, species, populations, and developmental stages, vastly increasing the speed, precision, and efficacy of macroalgal physiological measures under future ocean change scenarios.</p>","author":"R. J. Veenhof, \nM. A. Coleman, \nC. Champion, \nS. A. Dworjanyn, \nR. Venhuizen, \nL. Kearns, \nE. M. Marzinelli, \nA. K. Pettersen","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"31f96ea62f20b0dee5726cf74bd8c3919d07e36c71bcbb1ab4a13afab7c6f192","category":"Environment"}