{"title":"Abscisic acid root-to-shoot translocation by transporter AtABCG25 mediates stomatal movements in Arabidopsis","link":"https://academic.oup.com/plphys/article/195/1/671/7606715?rss=1","date":1707696000000,"content":"<span><div>Abstract</div>The phytohormone abscisic acid (ABA) plays a central role in regulating stomatal movements under drought conditions. The root-derived peptide CLAVATA3/EMBRYO SURROUNDING REGION-RELATED 25 (CLE25) moves from the root to shoot for activating ABA biosynthesis under drought conditions. However, the root-to-shoot translocation of root-derived ABA and its regulation of stomatal movements in the shoot remain to be clarified. Here, we reveal that the ABA transporter ATP-binding cassette subfamily G member 25 (AtABCG25) mediates root-to-shoot translocation of ABA and ABA-glucosyl ester (ABA-GE) in Arabidopsis (<span>Arabidopsis thaliana</span>). Isotope-labeled ABA tracer experiments and hormone quantification in xylem sap showed that the root-to-shoot translocation of ABA and ABA-GE was substantially impaired in the <span>atabcg25</span> mutant under nondrought and drought conditions. However, the contents of ABA and ABA-GE in the leaves were lower in the <span>atabcg25</span> mutant than in the wild type (WT) under nondrought but similar under drought conditions. Consistently, the stomatal closure was suppressed in the <span>atabcg25</span> mutant under nondrought but not under drought conditions. The transporter activity assays showed that AtABCG25 directly exported ABA and ABA-GE in planta and in yeast (<span>Saccharomyces cerevisiae</span>) cells. Thus, we proposed a working model in which root-derived ABA transported by AtABCG25 via xylem mediates stomatal movements in the shoot under nondrought conditions but might exhibit little effect on stomatal movements under drought conditions. These findings extend the functions of AtABCG25 and provide insights into the long-distance translocation of ABA and its role in stomatal movements.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"321e351a1de30a7deae2e84c4c694316cf85adb827dc9d9f0a6115c4362ecf5b","category":"Environment"}