{"title":"KLRG1-expressing CD8+ T cells are exhausted and polyfunctional in patients with chronic hepatitis B","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303945","date":1716386400000,"content":"<p>by Li Wang, Fangli Liao, Liping Yang, Linshan Jiang, Liang Duan, Bo Wang, Di Mu, Juan Chen, Ying Huang, Qin Hu, Weixian Chen</p>\r\n\r\nKiller cell lectin-like receptor G1 (KLRG1) has traditionally been regarded as an inhibitory receptor of T cell exhaustion in chronic infection and inflammation. However, its exact role in hepatitis B virus (HBV) infection remains elusive. CD8+ T cells from 190 patients with chronic hepatitis B were analyzed ex vivo for checkpoint and apoptosis markers, transcription factors, cytokines and subtypes in 190 patients with chronic hepatitis B. KLRG1+ and KLRG1− CD8+ T cells were sorted for transcriptome analysis. The impact of the KLRG1-E-cadherin pathway on the suppression of HBV replication mediated by virus-specific T cells was validated in vitro. As expected, HBV-specific CD8+ T cells expressed higher levels of KLRG1 and showed an exhausted molecular phenotype and function. However, despite being enriched for the inhibitory molecules, thymocyte selection-associated high mobility group box protein (TOX), eomesodermin (EOMES), and Helios, CD8+ T cells expressing KLRG1 produced significant levels of tumour necrosis factor (TNF)-α, interferon (IFN)-γ, perforin, and granzyme B, demonstrating not exhausted but active function. Consistent with the in vitro phenotypic assay results, RNA sequencing (RNA-seq) data showed that signature effector T cell and exhausted T cell genes were enriched in KLRG1+ CD8+ T cells. Furthermore, in vitro testing confirmed that KLRG1−E-cadherin binding inhibits the antiviral efficacy of HBV-specific CD8+ T cells. Based on these findings, we concluded that KLRG1+ CD8+ T cells are not only a terminally exhausted subgroup but also exhibit functional diversity, despite inhibitory signs in HBV infection.","author":"Li Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"321f17fb038eb2e6504e161316b9b85cd7efaf3144350b578dd44da676ff32fd","category":"Interdisciplinary"}