{"title":"Canonical and noncanonical roles of Hop1 are crucial for meiotic prophase in the fungus <i>Sordaria macrospora</i>","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002705","date":1719842400000,"content":"<p>by Emeline Dubois, Stéphanie Boisnard, Henri-Marc Bourbon, Kenza Yefsah, Karine Budin, Robert Debuchy, Liangran Zhang, Nancy Kleckner, Denise Zickler, Eric Espagne</p>\r\n\r\nWe show here that in the fungus <i>Sordaria macrospora</i>, the meiosis-specific HORMA-domain protein Hop1 is not essential for the basic early events of chromosome axis development, recombination initiation, or recombination-mediated homolog coalignment/pairing. In striking contrast, Hop1 plays a critical role at the leptotene/zygotene transition which is defined by transition from pairing to synaptonemal complex (SC) formation. During this transition, Hop1 is required for maintenance of normal axis structure, formation of SC from telomere to telomere, and development of recombination foci. These <i>hop1Δ</i> mutant defects are DSB dependent and require Sme4/Zip1-mediated progression of the interhomolog interaction program, potentially via a pre-SC role. The same phenotype occurs not only in <i>hop1Δ</i> but also in absence of the cohesin Rec8 and in <i>spo76-1</i>, a non-null mutant of cohesin-associated Spo76/Pds5. Thus, Hop1 and cohesins collaborate at this crucial step of meiotic prophase. In addition, analysis of 4 non-null mutants that lack this transition defect reveals that Hop1 also plays important roles in modulation of axis length, homolog-axis juxtaposition, interlock resolution, and spreading of the crossover interference signal. Finally, unexpected variations in crossover density point to the existence of effects that both enhance and limit crossover formation. Links to previously described roles of the protein in other organisms are discussed.","author":"Emeline Dubois","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"32260173a234fd90f8f19bb5e209614535e48c35dfb64e229c941b2ce22a0ee1","category":"Environment"}