{"title":"Clinical Significance of Whole-Body Computed Tomography Scans in Pediatric Out-of-Hospital Cardiac Arrest Patients Without Prehospital Return of Spontaneous Circulation","link":"https://www.preprints.org/manuscript/202409.0557/v1","date":1725634392000,"content":"Background: Whole-body computed tomography (WBCT) is commonly employed for primary screening in pediatric patients experiencing out-of-hospital cardiac arrest (OHCA) without prehospital return of spontaneous circulation (ROSC). This study aimed to evaluate the cause of OHCA on WBCT and compare WBCT findings between ROSC and non-ROSC groups in non-traumatic pediatric OHCA cases in an emergency department (ED) setting. Methods: A retrospective analysis was conducted on 27 pediatric patients (mean age: 32.4 months; median age: 10 months) who experienced non-traumatic OHCA without prehospital ROSC and were transported to our tertiary care hospital between January 2013 and December 2023. WBCT scans were performed to investigate the cause of OHCA, with recorded findings in the head, chest, abdomen, and subcutaneous tissues. Results: In all cases, the direct causes of OHCA were undetermined, and WBCT identified no fatal findings. Statistical comparisons of CT findings between the ROSC and non-ROSC groups revealed significant differences. The non-ROSC group had a higher incidence of brain swelling, loss of cerebral gray-white matter differentiation, symmetrical lung consolidation/ground-glass opacity, cardiomegaly, hyperdense aortic walls, narrowed aorta, gas in the mediastinum, and hepatomegaly compared to the ROSC group. Conclusions: Although WBCT did not provide the direct cause of OHCA, it clarified several indicative findings for non-ROSC. These imaging findings could support clinical decision-making, offering objective criteria for discontinuing resuscitation in pediatric OHCA cases where prehospital ROSC is absent.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3226b765d9d0725ba0063596f94fb1d5f70a40fce27f9bea5b67f29d7923e610","category":"Interdisciplinary"}