{"title":"Patchiness of plankton communities at fronts explained by Lagrangian history of upwelled water parcels","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12654?af=R","date":1723460145000,"content":"<h2>Abstract</h2>\n<p>The transport of plankton by highly dynamic (sub)mesoscale currents—often associated with fronts and eddies—shapes the structure of plankton communities on the same time scales as biotic processes, such as growth and predation (days–weeks). The resulting biophysical couplings generate heterogeneities in their finescale distributions (1–10 km), or “patchiness.” Here, we test the hypothesis that cross-frontal plankton patchiness at a front found 200–250 km offshore in the California Current System was influenced by wind-driven upwelling conditions upstream of the front. We show that in situ Eulerian measurements (cross-frontal transects) can be interpreted in a Lagrangian framework by using satellite-derived current velocities to trace water parcels backward in time to their coastal origins. We find that the majority of the water parcels sampled at this front originated along the central California coast during different episodic wind-driven upwelling pulses and followed various trajectories before converging temporarily at the front. In response to nutrient injections at the coast, plankton communities transformed during their journeys from the coast to the sampling zone, with a succession of phytoplankton and zooplankton blooms. The cross-frontal sampling captured the convergence of these distinct water parcels at different points in their biological histories, which resulted in the observed spatial patchiness. Our results suggest that identifying the processes controlling frontal plankton communities requires understanding them in the context of their spatial and temporal histories. In particular, Lagrangian approaches should be more widely applied to understand critical ecological patterns in highly dynamic systems.</p>","author":"Shailja Gangrade, \nInès Mangolte","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"3237e4e3a9b8ebfae154e552146e71ce81dbd9ca08c833d34253274901047761","category":"Environment"}