{"title":"Now you can have a ChatGPT-style chat on your Apple Watch","link":"https://www.macworld.com/article/1661898/apple-watch-petey-app-chatgpt-siri.html","date":1679042551000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple fans who would like to enjoy the fruits of artificial intelligence while away from their Macs and iPhones now have a wrist-mounted option, with the launch of an AI app for the Apple Watch called Petey.</p>\n\n\n\n<p>The app, which costs $4.99 <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/petey-ai-assistant/id6446047813&amp;xcust=1-1-1661898-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">in the U.S.</a> and £3.99 <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/gb/app/petey-ai-assistant/id6446047813&amp;xcust=1-1-1661898-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">in the U.K.</a> and was previously known as watchGPT (which makes a difference when you try to find it in alphabetical lists–it comes under W, not P), answers users’ questions and generates text in response to prompts. It’s currently rated as 3.1 out of 5 on the U.S. App Store, with some cautiously positive reviews.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/Petey-Apple-Watch-app.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Petey Apple Watch app\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/Petey-Apple-Watch-app.jpg?quality=50&amp;strip=all 1233w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Petey-Apple-Watch-app.jpg?resize=300%2C122&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Petey-Apple-Watch-app.jpg?resize=768%2C313&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Petey-Apple-Watch-app.jpg?resize=1200%2C489&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"489\" /></figure><p>Foundry</p></div>\n\n\n\n<p>In our tests the app was fast and produced interesting and plausible results, albeit with the usual limitations and peculiarities readers will probably be familiar with from similar applications on other platforms. Asked to write a summary of Margaret Thatcher’s career in the style of a comedian, for example, it almost instantly came up with this less than hilarious offering:</p>\n\n\n\n<p>“Ah yes, Margaret Thatcher, the Iron Lady of British politics. She was the Prime Minister of the UK from 1979 to 1990 and boy did she get things done! She privatized just about everything, took on the trade unions like it was a game of whack-a-mole, and led her country through the Falklands War. Love her or hate her, you can’t deny she left her mark on history. Though some might say her biggest legacy was her hair, because let’s be real, that thing was immovable.”</p>\n\n\n\n<p>I was more impressed by Petey’s attempt at a Valentine’s Day poem in the style of Philip Larkin, although the rhyme scheme fails to convince:</p>\n\n\n\n<p>Love again: wryly ruthless, big with balm,<br />Intenser, colder at the core,<br />When kisses freeze and faces calm<br />In glassy-eyed surprise, before<br />A new emotion sets the psalm<br />Of loving all once more.</p>\n\n\n\n<p>No gifts, no cards, no fancy meal,<br />Just solid gold, unerring trust,<br />A steadfast love that nought can steal,<br />For it is this that makes us just.<br />A bond so deep it makes us feel<br />That we’re never really lost.</p>\n\n\n\n<p>The app’s developers hope, perhaps, that Petey can replace the often-unreliable Siri as Watch owners’ digital assistant, and to this end offers a complication for the app on most watch faces. This means you can access it with just a tap like Siri. Crucially, you can input prompts using voice, but as some reviewers note, it’s a shame this isn’t the default; this means a second tap is required before you can start speaking. (In fact you have to tap a third time to confirm you’ve finished speaking; it can’t deduce this from silence, which isn’t terribly smart.)</p>\n\n\n\n<p>It’s assumed that Apple is itself working on an AI, which may one day roll out on the Apple Watch, but despite <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://uk.pcmag.com/why-axis/127904/apple-acquires-more-ai-startups-than-any-other-tech-company&amp;xcust=1-1-1661898-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">“leading the AI arms race”</a> in terms of acquisitions as of three years ago, the company is publically lagging behind its competitors in this regard. As we reported last month, those hoping for a ChatGPT competitor at WWDC 2023 will <a href=\"https://www.macworld.com/article/1517769/apple-ai-summit-chatgpt-bing-bard-competitor.html\">probably be disappointed</a>.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3243ef3fd20e1ffdf0cd173e631362b92dc29cb70b314b7ddf71519b4600dbcb","category":"Apple"}