{"title":"Sustainable Consensus Algorithms Applied to Blockchain: A Systematic Literature Review","link":"https://www.preprints.org/manuscript/202409.1048/v1","date":1726220321000,"content":"In recent years, consensus algorithms have gained significant importance in the context of blockchain networks. These algorithms play a crucial role in allowing network participants to reach agreements on the state of the Blockchain without needing a central authority. The present study focuses on carrying out a systematic mapping of these consensus algorithms to explore in detail their use, benefits, and challenges in the context of blockchain networks. Understanding consensus algorithms is essential to appreciating how blockchain networks achieve the reliability and integrity of their distributed ledgers. These algorithms allow network nodes to reach agreement on the validity of transactions and the creation of new blocks on the Blockchain. In this sense, consensus algorithms are the engine that drives trust in these decentralized networks. Numerous authors have contributed to the development and understanding of consensus algorithms in the context of blockchain networks. For example, Satoshi Nakamoto's (2008) original paper on Bitcoin introduced proof-of-work (PoW) as a method of achieving consensus on the network. This revolutionary concept paved the way for numerous cryptocurrencies and blockchain systems. Despite advances in this field, significant challenges remain: centralization, fair token distribution, scalability, and sustainability. The energy consumption of blockchain networks, particularly those using algorithms such as Proof of Work, Proof of Stake, Delegated Proof of Stake, Proof of Authority, and hybrid algorithms (Proof of Work/Proof of Stake), has raised concerns about their environmental impact, motivating the scientific and technological community to investigate more sustainable alternatives that promise to reduce energy consumption and contribute to climate change mitigation. Furthermore, interoperability between different blockchains and security in specific environments, such as IoT, are areas that still require significant research attention. This systematic mapping not only seeks to shed light on the current state of consensus algorithms in blockchain, but also their impact on sustainability, identifying those algorithms that, in addition to guaranteeing integrity and security, minimize the environmental footprint, promoting a more efficient use of energy resources, being a relevant approach in a context in which the adoption of sustainable technologies has become a global priority. Understanding and improving these algorithms are critical to unlocking the full potential of blockchain technology in a variety of applications and industry sectors.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3246a1e0367d64fc4eab6834dfd71125f8a694c0ac38d21646424220da2b7e31","category":"Interdisciplinary"}