{"title":"Machine learning-driven assessment of biochemical qualities in tomato and mandarin using RGB and hyperspectral sensors as nondestructive technologies","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308826","date":1724680800000,"content":"<p>by Adel H. Elmetwalli, Asaad Derbala, Ibtisam Mohammed Alsudays, Eman A. Al-Shahari, Mahmoud Elhosary, Salah Elsayed, Laila A. Al-Shuraym, Farahat S. Moghanm, Osama Elsherbiny</p>\r\n\r\nEstimation of fruit quality parameters are usually based on destructive techniques which are tedious, costly and unreliable when dealing with huge amounts of fruits. Alternatively, non–destructive techniques such as image processing and spectral reflectance would be useful in rapid detection of fruit quality parameters. This research study aimed to assess the potential of image processing, spectral reflectance indices (SRIs), and machine learning models such as decision tree (DT) and random forest (RF) to qualitatively estimate characteristics of mandarin and tomato fruits at different ripening stages. Quality parameters such as chlorophyll a (Chl a), chlorophyll b (Chl b), total soluble solids (TSS), titratable acidity (TA), TSS/TA, carotenoids (car), lycopene and firmness were measured. The results showed that Red-Blue-Green (RGB) indices and newly developed SRIs demonstrated high efficiency for quantifying different fruit properties. For example, the R<sup>2</sup> of the relationships between all RGB indices (RGBI) and measured parameters varied between 0.62 and 0.96 for mandarin and varied between 0.29 and 0.90 for tomato. The RGBI such as visible atmospheric resistant index (VARI) and normalized red (Rn) presented the highest R<sup>2</sup> = 0.96 with car of mandarin fruits. While excess red vegetation index (ExR) presented the highest R<sup>2</sup> = 0.84 with car of tomato fruits. The SRIs such as RSI <sub>710</sub>,<sub>600</sub>, and R<sub>730</sub>,<sub>650</sub> showed the greatest R<sup>2</sup> values with respect to Chl a (R<sup>2</sup> = 0.80) for mandarin fruits while the GI had the greatest R<sup>2</sup> with Chl a (R<sup>2</sup> = 0.68) for tomato fruits. Combining RGB and SRIs with DT and RF models would be a robust strategy for estimating eight observed variables associated with reasonable accuracy. Regarding mandarin fruits, in the task of predicting Chl a, the DT-2HV model delivered exceptional results, registering an R<sup>2</sup> of 0.993 with an RMSE of 0.149 for the training set, and an R<sup>2</sup> of 0.991 with an RMSE of 0.114 for the validation set. As well as for tomato fruits, the DT-5HV model demonstrated exemplary performance in the Chl a prediction, achieving an R<sup>2</sup> of 0.905 and an RMSE of 0.077 for the training dataset, and an R<sup>2</sup> of 0.785 with an RMSE of 0.077 for the validation dataset. The overall outcomes showed that the RGB, newly SRIs as well as DT and RF based RGBI, and SRIs could be used to evaluate the measured parameters of mandarin and tomato fruits.","author":"Adel H. Elmetwalli","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3254c10e95e6735b6d5c84c327a57856d5661fa31bdc07a844fe287469716fe8","category":"Interdisciplinary"}