{"title":"Healthcare workers’ perspectives on diabetic foot complications among type 2 diabetes mellitus patients in Fiji","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307972","date":1727100000000,"content":"<p>by Suliana Saverio, Masoud Mohammadnezhad, Filimone Raikanikoda</p>\r\nIntroduction <p>Diabetic Foot Complications (DFCs) are a growing cause of morbidity and mortality with less than one third of physicians able to discern the signs of diabetes related peripheral neuropathy. DFCs and resultant amputations account for a considerable proportion of surgeries in Fiji, with very limited literature available to verify the factors that influence these alarming figures. This study aimed to explore Health Care Workers’ (HCWs) perspectives on diabetic foot complications and challenges of foot care management in Fiji.</p> Method <p>An exploratory descriptive qualitative design was used among HCWs at the Sigatoka Sub Divisional Hospital (SDH), Fiji in 2021. HCWs at the SDH were required to have a minimum work experience of at least six months in public health. All participants who met the inclusion criteria were selected through purposive sampling. Data was collected using a focus group discussion guide composed of semi-structured open-ended questions to guide the Focus Group Discussions (FGDs). Focus discussions were audio recorded and transcribed with thematic analysis applied to derive the themes and sub-themes outlined in the study.</p> Results <p>Twenty HCWs participated in four FGDs with four major themes identified. The first theme was HCWs’ perceptions and practice of foot care which revealed that all participants had adequate diabetic foot care knowledge. The second theme was factors affecting foot care which was mainly focused on identified barriers such as inadequate patient foot care knowledge, the lack of resources such as manpower, and health system challenges like the COVID-19 pandemic. The third theme is creating awareness among patients and HCWs to improve foot care practices. The fourth theme is strengthening foot care practices at the different levels of health care that is aimed at optimizing diabetic foot outcomes.</p> Conclusion <p>Various foot care barriers namely patient factors and the lack of resources is a concern depicted in this study. There is a need to address health system barriers and enforce diabetic foot education, screening and care for patients and the community.</p>","author":"Suliana Saverio","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"32565afc41e6f96af88754fc47e4ed9871225cbb312992d3acb4361a535ffa7c","category":"Interdisciplinary"}