{"title":"Susceptibility of Mangifera indica (Sapindales: Anacardiaceae) cultivars to fruit flies (Diptera: Tephritidae) in 2 agroecological zones of Cameroon","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae027/7630385?rss=1","date":1710547200000,"content":"<span><div>Abstract</div>The Sudano-Sahelian and the high Guinea savannahs agroecological zones of Cameroon are suitable for the full development of tree crops, including mango. Unfortunately, fresh fruits exported to local and international markets are frequently rejected due to the presence of fruit fly larvae (Diptera: Tephritidae), resulting in drastic income losses and overuse of chemical control products. To promote sustainable management strategies, a 2-yr study (2020–2021) was conducted in 4 and 3 mixed orchards, respectively. Attacked mangoes showing signs of fruit fly damage were collected and taken to the laboratory to rear and identify fruit flies. Repeated grafting and agroclimatic differences were responsible for dissimilarities between the 2 zones, with 18 and 16 cultivars, respectively. From 2,857 attacked mangoes, 26,707 fruit flies belonging to 4 species were identified: <span>Bactrocera dorsalis</span>, <span>Ceratitis cosyra</span>, <span>Ceratitis fasciventris</span>, and <span>Ceratitis anonae.</span> Climate change was the factor determining the distribution of the 2 most important mango fruit flies: <span>B. dorsalis</span> was a wetland species (dominance/occurrence &gt; 70%), while <span>C. cosyra</span> was a dry-land species (dominance/occurrence &gt; 75%). Both species were responsible for high levels of infestations. <span>Bactrocera dorsalis</span> preferred 3 mango cultivars, namely Palmer and Smith in Zone 1, and Ifack 1 in Zone 2 (infestation &gt; 20 individuals/100 g of mango). The host-plant spectrum of <span>C. cosyra</span> was modified by alternative host plants. Both <span>C. fasciventris</span> and <span>C. anonae</span> were rare. Findings from this study could guide researchers in the development of monitoring tools for fruit fly populations and, subsequently, in reducing the damage they cause to mangoes.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"32569c96ddbc14be883fdd8d5b8abcc8d6be1619fc3b831a0b9d064a2b675d3f","category":"Environment"}