{"title":"The Composition of Earth's Lower Mantle","link":"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-031621-075657?TRACK=RSS","date":1721692800000,"content":"<div><p>Determining the composition of Earth's lower mantle, which constitutes almost half of its total volume, has been a central goal in the Earth sciences for more than a century given the constraints it places on Earth's origin and evolution. However, whether the major element chemistry of the lower mantle, in the form of, e.g., Mg/Si ratio, is similar to or different from the upper mantle remains debated. Here we use a multidisciplinary approach to address the question of the composition of Earth's lower mantle and, in turn, that of bulk silicate Earth (crust and mantle) by considering the evidence provided by geochemistry, geophysics, mineral physics, and geodynamics. Geochemical and geodynamical evidence largely agrees, indicating a lower-mantle molar Mg/Si of ≥1.12 (≥1.15 for bulk silicate Earth), consistent with the rock record and accumulating evidence for whole-mantle stirring. However, mineral physics–informed profiles of seismic properties, based on a lower mantle made of bridgmanite and ferropericlase, point to Mg/Si ∼ 0.9–1.0 when compared with radial seismic reference models. This highlights the importance of considering the presence of additional minerals (e.g., calcium-perovskite and stishovite) and possibly suggests a lower mantle varying compositionally with depth. In closing, we discuss how we can improve our understanding of lower-mantle and bulk silicate Earth composition, including its impact on the light element budget of the core.\n</p><ul>\n<li><span>▪ \n</span>The chemical composition of Earth's lower mantle is indispensable for understanding its origin and evolution.\n</li>\n<li><span>▪ \n</span>Earth's lower-mantle composition is reviewed from an integrated mineral physics, geophysical, geochemical, and geodynamical perspective.\n</li>\n<li><span>▪ \n</span>A lower-mantle molar Mg/Si of ≥1.12 is favored but not unique.\n</li>\n<li><span>▪ \n</span>New experiments investigating compositional effects of bridgmanite and ferropericlase elasticity are needed to further our insight.\n</li>\n</ul><p></p></div>","author":"Motohiko Murakami, Amir Khan, Paolo A. Sossi, Maxim D. Ballmer and Pinku Saha","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"325cb2a18baad95fec171bf1b87919ee35b50fccc4a621112955d53db03433c9","category":"Environment"}