{"title":"Apple Supplier Rockley Photonics Unveils Health Tracking Tech Likely to Come to Apple Watch","link":"https://www.macrumors.com/2021/07/14/apple-supplier-unveils-health-tracking-tech/","date":1626266403000,"content":"Rockley Photonics, an Apple supplier, has today unveiled an advanced digital sensor system that is likely to come to the Apple Watch to enable a wide range of new health tracking features.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/RPS-Wristband-Reverse-Side.jpg\" />\r\n<br />\r\nThe company today revealed a full-stack, \"clinic-on-the-wrist\" digital health sensor system, enabling wearable devices to monitor multiple biomarkers, including core body temperature, blood pressure, body hydration, alcohol, lactate, and glucose trends, and more.\r\n<br />\r\n\r\n<br />\r\nThe technology uses a miniaturized chip solution with optical sensors that provide continuous, non-invasive monitoring of various biomarkers, in an attempt to overcome many of the challenges associated with wearable health monitoring and avoid the need for invasive sensors that must perforate the skin. \r\n<br />\r\n\r\n<br />\r\nMany wearables use green LEDs to monitor heart rate, but Rockley's sensor uses infrared spectrophotometers that can detect and monitor a much wider range of biomarkers to dramatically increase the functionality of wearable devices. The sensor generates lasers to non-invasively probe beneath the skin to analyze blood, interstitial fluids, and layers of the dermis for specific constituents and physical phenomena.\r\n<br />\r\n\r\n<br />\r\nRockley is initially launching its full-stack sensing solution as a wristband that contains the sensor module and communicates with an app and it will be used in a number of human studies in the coming months, but the company suggested that its sensor module and associated reference designs, including hardware and application firmware, will be available for other consumer products.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2014/09/series6leds.jpg\" />\r\n<br />\r\nEarlier this year, it was revealed that Apple is <a href=\"https://www.macrumors.com/2021/05/03/apple-watch-blood-pressure-glucose-alcohol/\">the largest customer of Rockley Photonics</a>. The company's filings said that Apple accounted for the majority of its revenue over the last two years and that it has an ongoing \"supply and development agreement\" with the company, under which it expects to continue to heavily rely on Apple for most of its revenue.\r\n<br />\r\n\r\n<br />\r\nGiven the growth of Rockley Photonics and the scale of Apple's partnership with the company, it seems to be highly likely that the company's health sensor technology will be coming to the Apple Watch sooner rather than later, providing the technology lives up to expectations. Rockley has previously said that its sensors could be in consumer smartwatches and other electronics as soon as next year, which could align with the launch of Apple Watch Series 8 models.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/rockley-photonics/\">Rockley Photonics</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Caution)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/14/apple-supplier-unveils-health-tracking-tech/\">Apple Supplier Rockley Photonics Unveils Health Tracking Tech Likely to Come to Apple Watch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-supplier-rockley-photonics-unveils-health-tracking-tech-likely-to-come-to-apple-watch.2304215/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wo9XSXEjbno:rwZgvuf8mNs:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wo9XSXEjbno:rwZgvuf8mNs:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/wo9XSXEjbno\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"326497eac2761ee4b19b92aed6e4f3034ea73d1a83457a50ac7e1ffe657ca57b","category":"Apple"}