{"title":"164 Impact of varying dietary inclusion of modified distiller’s grains plus solubles weekly compared with constant inclusion on feedlot cattle performance and carcass characteristics","link":"https://academic.oup.com/jas/article/102/Supplement_2/208/7664715?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The use of distiller’s grains in feedlot diets was abundant due to supply and price, but the availability to feedlots and greater prices of distiller’s grains has led to reduced inclusion and more variation in supply, and thus, inclusion within the feeding period for cattle. The hypothesis was that varying inclusion of modified wet distiller’s grains plus solubles (MDGS) in the diet would negatively impact cattle performance due to changing dietary starch concentration and risk of acidosis. One solution to help with ruminal acidosis concerns with variable MDGS inclusion would be increasing roughage inclusion. Therefore, our objective was to evaluate if varying the inclusion of MDGS at normal and 2X normal roughage inclusion influences performance of finishing cattle. In this study, crossbred steers (n = 576) with an initial body weight (BW) = 379 kg (SD= 11 kg) were evaluated for performance and carcass traits over the 143 d on study. Two inclusions of grass hay (6% and 12%) and three treatments related to MDGS (no inclusion, constant inclusion at 25% MDGS, and varying inclusion between 15 and 35% MDGS) were tested in a 2 × 3 factorial. Variable inclusion was accomplished by randomly selecting inclusions of 15, 20, 25, 30, or 35% each week with inclusion averaging 25% over the entire feeding period. There was no interaction between grass hay inclusion and MDGS inclusion (<span>P</span> ≥ 0.67) for performance data except a tendency (<span>P</span> = 0.09) for a gain to feed (G:F) interaction. In treatments fed 12% hay, G:F increased for cattle fed either MDGS inclusion (25% constant or varying inclusion) compared with 0% MDGS. In cattle fed 6% hay, G:F was similar between 0, 25 constant or variable 25% MDGS treatments. There was not an interaction due to a different response of variable versus constant inclusion of MDGS when more hay was included, as hypothesized. The 25% constant MDGS and 25% variable MDGS treatments did not differ (<span>P</span> ≥ 0.22) in average daily gain (ADG), hot carcass weight, or G:F. There was a tendency for cattle fed varying inclusion of MDGS to eat less (<span>P</span> = 0.10), but this difference was small (0.1 kg/d). In general, cattle fed MDGS (constant or varying) had greater dry matter intake and ADG, with greater fatness and marbling compared with cattle fed without MDGS (<span>P</span> ≤ 0.01). As for the degree of liver abscess severity, there was no interaction between treatments. Our results show that although varying supply of MDGS in diets is not recommended or desired, if it occurs and inclusions vary from 15 to 35%, these weekly adjustments did not negatively affect gain or feed efficiency in this study.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3272ad2fe00fe8c62cdd6cd3750cbd7852dd4fc6f32b2fd04111812ecda9ec0b","category":"Environment"}