{"title":"Aperiodic Tiling for Enhancing Security in Wireless Sensor Networks","link":"https://www.preprints.org/manuscript/202408.1495/v1","date":1724201223000,"content":"This paper investigates the impact of network topologies on the security of wireless sensor networks (WSNs). We propose the use of Spectre Monotile aperiodic tiling for sensor deployment, demonstrating its superior security compared to regular deterministic topologies. Additionally, we introduce a novel Intrusion Effort Index to quantify network resilience against clone attacks. By implementing a smart random walk to simulate the scenario of malicious cloned nodes attempting to reach the central access point of a network, we take into consideration the worst-case scenario for a network as it is being attacked. Given all network topologies use the same intrusion detection system and security protocols, we discover the topology of a network will also play a role and provide an additional layer of security depending on how it is designed. Similar to a fog-of-war, the sensor positions play a vital role in how an intruder assesses a network. By tiling a plane non-periodically, an absence of regularity in the structure is produced, which obfuscates an intruder attempting to predict the next sensor position, due to a varying number of adjacent neighboring nodes each time it reaches a new node. After 10,000 rounds of simulation emulating different scenarios of malicious nodes compromising the network, we averaged the results to find total detections, total hops, and percentage of times the base station was reached. Our simulation results show that aperiodic tiling has the best security resilience and robustness compared to other flat network topologies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"327769e2b45cdcd1e2acd19292044067fbc994d24061a4c04edbac556056df5e","category":"Interdisciplinary"}