{"title":"A flawless Cygnus launch brings eras to a close","link":"https://arstechnica.com/?p=1958346","date":1691005574000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Screen-Shot-2023-08-02-at-11.33.14-AM-1-800x463.png\" alt=\"Image of a rocket leaving its launch pad at night.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Screen-Shot-2023-08-02-at-11.33.14-AM-1.png\">Enlarge</a> (credit: NASA)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>WALLOPS ISLAND, Va.—I had been told that rocket launches are a physical experience, that the carefully controlled explosions that send payloads to space create waves of sound intense enough to be felt from over a mile away. But my first <a href=\"https://arstechnica.com/science/2023/01/rocket-labs-first-us-launch-big-for-the-company-and-the-site/\">close-up experience</a> with a launch involved the relatively small Electron rocket, and that left me wondering about whether these reports might be a bit exaggerated.</p>\n<p>Tuesday's launch of an Antares rocket from Wallops Island made it clear there was no exaggeration. The two RD-181 engines that sent a Cygnus capsule toward a rendezvous with the International Space Station (more on those below) created a crackling noise that was at once both high-pitched and deep enough that you could feel their vibrations in your chest. The metal bleachers set up for the press rattled in sympathy.</p>\n<p>But all that violence came as part of a completely routine launch. While there was a small delay—just long enough to allow <a href=\"https://youtu.be/K0PQdwLySAQ?t=2027\">an instant of worry</a>—between the countdown hitting zero and flames appearing, the rocket performed exactly as expected, putting Cygnus on course for an ISS rendezvous on Friday.</p></div><p><a href=\"https://arstechnica.com/?p=1958346#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1958346&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"327a100e3bc99e4e3f70cf61d3022cd8a995e679b0b24046ba275e431afb0f92","category":"Tech"}