{"title":"Impact of growth implants and low-level tannin supplementation on enteric emissions and nitrogen excretion in grazing steers","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae115/7724709?rss=1","date":1722384000000,"content":"<span><div>Abstract</div>The primary objective of this experiment was to evaluate the effects of a growth-hormone implant (Revalor-G, Merck Animal Health., Rahway, NJ, USA) and tannin supplementation (Silvafeed BX, Silva Team, San Michele Mondovi CN, Italy) on enteric methane (CH<sub>4</sub>) emissions and estimated nitrogen (N) excretion in grazing steers. Steers (<span>n</span> = 20; initial body weight [IBW] = 343 ± 14 kg) were acclimated to use a portable automated head-chamber system (AHCS) to measure CH<sub>4</sub> and a SmartFeed Pro automated feeder for dietary supplementation (C-Lock Inc., Rapid City, SD, USA). After the training period, steers were randomly assigned to a 2 × 2 factorial arrangements of treatments, with 2 levels of growth-hormone implants, no-implant (NO-IMP) or implanted (IMP), and 2 levels of tannin supplementation, no tannin supplementation (NO-TAN) or tannin supplementation (TAN). This created 4 treatment groups: (1) NO-TAN and NO-IMP, (2) TAN and NO-IMP, (3) IMP and NO-TAN, and (4) TAN and IMP. Tannin was offered daily at 0.30% dry matter intake (DMI) through 0.5 kg/hd/d sweetfeed supplement (Sweetfeed Mix, AgFinity., Eaton, CO, USA) with a targeted tannin intake at 48 g/hd/d. No (<span>P</span> ≥ 0.05) implant × tannin interaction was detected for any dependent variable, so only the main effects of implant (NO-IMP vs. IMP) and tannin supplementation (NO-TAN vs. TAN) are discussed. Implant status did not affect (<span>P</span> ≥ 0.56) final body weight (FBW) or average daily gain (ADG) during the 90 d grazing period. There was no effect (<span>P</span> ≥ 0.15) of growth implant on CH<sub>4</sub> production or emission intensity (EI; g CH<sub>4</sub>/kg gain). Additionally, IMP steers tended (<span>P</span> ≤ 0.08) to have less CH<sub>4</sub> yield (MY; g CH<sub>4</sub>/g DMI) and higher blood urea nitrogen (BUN) than NO-IMP steers. Tannin supplementation did not impact (<span>P</span> ≥ 0.26) FBW or ADG. However, NO-TAN steers tended (<span>P</span> = 0.06) to have a greater total DMI than steers supplemented with tannin. No effect (<span>P</span> ≥ 0.22) of tannin supplementation was observed for CH<sub>4</sub> production and EI. Nitrogen utilization as measured through BUN, urine N, fecal N, or fecal P was similar (<span>P</span> ≥ 0.12) between TAN and NO-TAN animals. The findings indicate that low-level dietary supplementation to reduce enteric emissions is difficult in grazing systems due to inconsistent animal intake and that growth implants could be used as a strategy to improve growth performance and reduce EI of steers grazing improved pasture.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"3281c075a03b60c28020ba8e5d4f082411a4214ad22aaba4c4f29717ad3950f7","category":"Environment"}