{"title":"MacRumors Giveaway: Win an iPhone 14 Pro From GRID Studio","link":"https://www.macrumors.com/2023/08/11/macrumors-giveaway-grid-studio-august-2023/","date":1691769609000,"content":"For this week's giveaway, we've teamed up with GRID Studio to offer <em>MacRumors</em> readers a chance to win a 256GB <a href=\"https://www.macrumors.com/roundup/iphone-14-pro/\">iPhone 14 Pro</a>. GRID Studio is a company that purchases old, discarded Apple electronics, tears them apart, and turns them into works of art for Apple fans.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/Grid-iPhone-2G.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nEach of GRID's art pieces includes a deconstructed Apple device with the components displayed underneath a glass frame. Labels make it clear what each part of the device was used for, and interesting and relevant historical facts and details are also added for context.\r<br />\n\r<br />\nA vintage Apple device with all of its components artfully arranged makes great decor for an office space, living room, or workshop, and the simple style blends in with a range of decorating styles. GRID Studio has a range of different options, with prices that start at $40 and go up based on the complexity of the piece.\r<br />\n\r<br />\nThe GRID 1 is one of GRID Studio's most popular options, as it showcases the first <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> that Apple ever made. Available for $400, the GRID 1 showcases the internal components that Apple used for the original ‌iPhone‌. Each component is separated and labeled, so you can see the entire makeup of the ‌iPhone‌ at a glance.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/grid-studio-grid-1.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nThe ‌iPhone‌'s shell is positioned next to the power button, headphone socket, speaker, logic board, ear piece, and other components. Note that GRID doesn't include the original batteries from the device because of the risk of fire, but replicas are available.\r<br />\n\r<br />\nAnother iconic device is featured in <a href=\"https://gridstudio.cc/products/framed-iphone-4\">the GRID 4</a>, which is at its lowest price ever thanks to GRID Studio's back to school sale. Available for $99, the GRID 4 showcases Apple's ‌iPhone‌ 4, the first major ‌iPhone‌ redesign that Apple came out with. The GRID 4 features the iconic squared frame that the ‌iPhone‌ 4 is known for, complete with the poorly located antenna bands that spurred one of the biggest Apple \"gates,\" antennagate.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/Grid-iPhone-4.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nGRID Studio doesn't just tear down iPhones. If you're an iPod fan, there's the <a href=\"https://gridstudio.cc/products/grid%C2%AE-ipod-classic-3rd-generation\">$400 GRID iPod Classic</a>, featuring the third-generation iPod that Apple released in 2003. The \"iPod 3G\" had the classic white color and the wheel design that made the iPod lineup famous. It's a true piece of history because Apple stopped selling iPods altogether in 2022.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/Grid-iPod-3rd-Gen.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nFor <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> fans, GRID has a <a href=\"https://gridstudio.cc/products/grid%C2%AE-mini1\">deconstructed 2012 iPad mini</a> available for $220. Featuring the first <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a> that Apple made. The ‌iPad mini‌ was popular due to its small 7.9-inch size compared to the prior 9.7-inch iPads that Apple made available.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/Grid-iPad-mini.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nAlong with Apple devices, <a href=\"https://gridstudio.cc/collections/all\">GRID Studio sells</a> deconstructed Android phones, disassembled Nintendo devices, and art featuring consoles from Sony and Microsoft. GRID Studio is hosting a back to school sale this week, and through August 17, the GRID 4 is available for $99. All other devices can be bought at a 15 percent discount using the code \"M15.\"\r<br />\n\r<br />\nWe have a (fully assembled) 256GB ‌iPhone 14 Pro‌ for one lucky <em>MacRumors</em> reader. To enter to win, use the widget below and enter an email address. Email addresses will be used solely for contact purposes to reach the winner(s) and send the prize(s). You can earn additional entries by subscribing to our <a href=\"https://my.leadpages.net/leadbox/145ef7173f72a2%3A104a9fa76b46dc/5754903989321728/\">weekly newsletter</a>, subscribing to our <a href=\"https://www.youtube.com/user/macrumors\">YouTube channel</a>, following us on <a href=\"https://twitter.com/macrumors\">Twitter</a>, following us on <a href=\"https://www.instagram.com/macrumors/\">Instagram</a>, or visiting the <em>MacRumors</em> <a href=\"https://www.facebook.com/MacRumors\">Facebook page</a>.\r<br />\n\r<br />\nDue to the complexities of international laws regarding giveaways, only <strong>U.S. residents who are 18 years or older, UK residents who are 18 years or older, and Canadian residents (excluding Quebec) who have reached the age of majority in their province or territory are eligible to enter</strong>. All federal, state, provincial, and/or local taxes, fees, and surcharges are the sole responsibility of the prize winner. To offer feedback or get more information on the giveaway restrictions, please refer to <a href=\"http://forums.macrumors.com/threads/macrumors-giveaways-why-are-they-only-open-to-u-s-residents.1918337/\">our Site Feedback section</a>, as that is where discussion of the rules will be redirected.\r<br />\n\r<br />\n<div><a href=\"https://gleam.io/jBJjW/grid-studio-giveaway\">GRID Studio Giveaway</a>\r<br />\n</div>The contest will run from today (August 11) at 9:00 a.m. Pacific Time through 9:00 a.m. Pacific Time on August 18. The winner will be chosen randomly on or shortly after August 18 and will be contacted by email. The winner will have 48 hours to respond and provide a shipping address before a new winner is chosen.<div>Tag: <a href=\"https://www.macrumors.com/guide/giveaway/\">Giveaway</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/11/macrumors-giveaway-grid-studio-august-2023/\">MacRumors Giveaway: Win an iPhone 14 Pro From GRID Studio</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/macrumors-giveaway-win-an-iphone-14-pro-from-grid-studio.2398372/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"32856710b159bba285cf3600699541eacc66e123955162cc7da086ffec194d12","category":"Apple"}