{"title":"Announcing Amazon EC2 Capacity Blocks for ML to reserve GPU capacity for your machine learning workloads","link":"https://aws.amazon.com/blogs/aws/announcing-amazon-ec2-capacity-blocks-for-ml-to-reserve-gpu-capacity-for-your-machine-learning-workloads/","date":1698793358000,"content":"<p>Recent advancements in <a href=\"https://aws.amazon.com/machine-learning/\">machine learning</a> (ML) have unlocked opportunities for customers across organizations of all sizes and industries to reinvent new products and transform their businesses. However, the growth in demand for GPU capacity to train, fine-tune, experiment, and inference these ML models has outpaced industry-wide supply, making GPUs a scarce resource. Access to GPU capacity is an obstacle for customers whose capacity needs fluctuate depending on the research and development phase they’re in.</p> \n<p>Today, we are announcing <a href=\"https://aws.amazon.com/ec2\">Amazon Elastic Compute Cloud (Amazon EC2)</a> <a href=\"https://aws.amazon.com/ec2/capacityblocks\">Capacity Blocks for ML</a>, a new Amazon EC2 usage model that further democratizes ML by making it easy to access GPU instances to train and deploy ML and <a href=\"https://aws.amazon.com/generative-ai/\">generative AI</a> models. With EC2 Capacity Blocks, you can reserve hundreds of GPUs collocated in <a href=\"https://aws.amazon.com/ec2/ultraclusters/\">EC2 UltraClusters</a> designed for high-performance ML workloads, using <a href=\"https://aws.amazon.com/hpc/efa/\">Elastic Fabric Adapter (EFA)</a> networking in a peta-bit scale non-blocking network, to deliver the best network performance available in Amazon EC2.</p> \n<p>This is an innovative new way to schedule GPU instances where you can reserve the number of instances you need for a future date for just the amount of time you require. EC2 Capacity Blocks are currently available for <a href=\"https://aws.amazon.com/blogs/aws/new-amazon-ec2-p5-instances-powered-by-nvidia-h100-tensor-core-gpus-for-accelerating-generative-ai-and-hpc-applications/\">Amazon EC2 P5 instances</a> powered by NVIDIA H100 Tensor Core GPUs in the AWS US East (Ohio) Region. With EC2 Capacity Blocks, you can reserve GPU instances in just a few clicks and plan your ML development with confidence. EC2 Capacity Blocks make it easy for anyone to predictably access EC2 P5 instances that offer the highest performance in EC2 for ML training.</p> \n<p>EC2 Capacity Block reservations work similarly to hotel room reservations. With a hotel reservation, you specify the date and duration you want your room for and the size of beds you’d like─a queen bed or king bed, for example. Likewise, with EC2 Capacity Block reservations, you select the date and duration you <span>require GPU instances and the size of the reservation (the number of instances)</span>. On your EC2 Capacity Block start date, you’ll be able to access your purchased EC2 Capacity Block and launch your P5 instances. At the end of the EC2 Capacity Block duration, any instances still running will be terminated.</p> \n<p>You can use EC2 Capacity Blocks when you need capacity assurance to train or fine-tune ML models, run experiments, or plan for future surges in demand for ML applications. Alternatively, you can continue using <a href=\"https://docs.aws.amazon.com/en_us/AWSEC2/latest/UserGuide/ec2-capacity-reservations.html\">On-Demand Capacity Reservations</a> for all other workload types that require compute capacity assurance, such as business-critical applications, regulatory requirements, or disaster recovery.</p> \n<p><strong><u>Getting started with Amazon EC2 Capacity Blocks for ML</u></strong><br /> To reserve your EC2 Capacity Blocks, choose <strong>Capacity Reservations</strong> on the <a href=\"https://us-east-2.console.aws.amazon.com/ec2/home?region=us-east-2#CapacityReservations:\">Amazon EC2 console</a> in the US East (Ohio) Region. You can see two capacity reservation options. Select <strong>Purchase Capacity Blocks for ML</strong> and then <strong>Get started</strong> to start looking for an EC2 Capacity Block.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/31/2023-ec2-capacity-blocks-shot.jpg\" width=\"955\" height=\"492\" /></p> \n<p>Choose your total capacity and specify how long you need the EC2 Capacity Block. You can reserve an EC2 Capacity Block in the following sizes: 1, 2, 4, 8, 16, 32, or 64 <code>p5.48xlarge</code> instances. The total number of days that you can reserve EC2 Capacity Blocks is 1– 14 days in 1-day increments. EC2 Capacity Blocks can be purchased up to 8 weeks in advance.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/29/2023-ec2-capacity-blocks-2.jpg\" width=\"2050\" height=\"2212\" /></p> \n<p>EC2 Capacity Block prices are dynamic and depend on total available supply and demand at the time you purchase the EC2 Capacity Block. You can adjust the size, duration, or date range in your specifications to search for other EC2 Capacity Block options. When you select <strong>Find Capacity Blocks</strong>, AWS returns the lowest-priced offering available that meets your specifications in the date range you have specified. At this point, you will be shown the price for the EC2 Capacity Block.</p> \n<p>After reviewing EC2 Capacity Blocks details, tags, and total price information, choose <strong>Purchase</strong>. The total price of an EC2 Capacity Block is charged up front, and the price does not change after purchase. The payment will be billed to your account within 12 hours after you purchase the EC2 Capacity Blocks.</p> \n<p>All EC2 Capacity Blocks reservations start at 11:30 AM Coordinated Universal Time (UTC). EC2 Capacity Blocks can’t be modified or canceled after purchase.</p> \n<p>You can also use <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (AWS CLI)</a> and <a href=\"http://docs.aws.amazon.com/AWSJavaScriptSDK/latest/AWS/EC2.html\">AWS SDKs</a> to purchase EC2 Capacity Blocks. Use the <code>describe-capacity-block-offerings</code> API to provide your cluster requirements and discover an available EC2 Capacity Block for purchase.</p> \n<pre><code>$ aws ec2 describe-capacity-block-offerings \\\n          --instance-type p5.48xlarge \\\n          --instance-count 4 \\\n          --start-date-range 2023-10-30T00:00:00Z \\\n          --end-date-range 2023-11-01T00:00:00Z \\\n          –-capacity-duration 48</code></pre> \n<p>After you find an available EC2 Capacity Block with the <code>CapacityBlockOfferingId</code> and capacity information from the preceding command, you can use <code>purchase-capacity-block-reservation</code> API to purchase it.</p> \n<pre><code>$ aws ec2 purchase-capacity-block-reservation \\\n          --capacity-block-offering-id cbr-0123456789abcdefg \\\n          –-instance-platform Linux/UNIX</code></pre> \n<p>For more information about new EC2 Capacity Blocks APIs, see the <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/APIReference/OperationList-query-ec2.html\">Amazon EC2 API documentation</a>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/29/2023-ec2-capacity-blocks-3.jpg\" width=\"2201\" height=\"1500\" /></p> \n<p>Your EC2 Capacity Block has now been scheduled successfully. On the scheduled start date, your EC2 Capacity Block will become active. To use an active EC2 Capacity Block on your starting date, choose the capacity reservation ID for your EC2 Capacity Block. You can see a breakdown of your purchased Capacity Blocks, which shows how the capacity is currently being utilized in the <strong>Capacity details</strong> section.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/29/2023-ec2-capacity-blocks-4.jpg\" width=\"1928\" height=\"1332\" /></p> \n<p>To launch instances into your active EC2 Capacity Block, choose <strong>Launch instances</strong> and follow the normal process of launching EC2 instances and running your ML workloads.</p> \n<p>In the <strong>Advanced details</strong> section, choose <strong>Capacity Blocks</strong> as the purchase option and select the capacity reservation ID of the EC2 Capacity Block you’re trying to target.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/29/2023-ec2-capacity-blocks-5.jpg\" width=\"1632\" height=\"960\" /></p> \n<p>As your EC2 Capacity Block end time approaches, Amazon EC2 will emit an event through <a href=\"https://aws.amazon.com/eventbridge/\">Amazon EventBridge</a>, letting you know your reservation is ending soon so you can checkpoint your workload. Any instances running in the EC2 Capacity Block go into a shutting-down state 30 minutes before your reservation ends. The amount you were charged for your EC2 Capacity Block does not include this time period. When your EC2 Capacity Block expires, any instances still running will be terminated.</p> \n<p><strong><u>Now available</u></strong><br /> <a href=\"https://aws.amazon.com/ec2/capacityblocks\">Amazon EC2 Capacity Blocks</a> are now available for <code>p5.48xlarge</code> instances in the AWS US East (Ohio) Region. You can view the price of an EC2 Capacity Block before you reserve it, and the total price of an EC2 Capacity Block is charged up-front at the time of purchase. For more information, see the <a href=\"https://aws.amazon.com/ec2/pricing/\">EC2 Capacity Blocks pricing</a> page.</p> \n<p>To learn more, see the <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-capacity-reservations.html\">EC2 Capacity Blocks documentation</a> and send feedback to <a href=\"https://repost.aws/tags/TAO-wqN9fYRoyrpdULLa5y7g/amazon-ec-2\">AWS re:Post for EC2</a> or through your usual AWS Support contacts.</p> \n<p>— <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"328581df99478612a59b57599957ad2016a7dec9d59d4cf66bb17a1855c90f21","category":"Tech"}