{"title":"“I found out about Zika virus after she was born.” Women’s experiences of risk communication during the Zika virus epidemic in Brazil, Colombia, and Puerto Rico","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002808","date":1718200800000,"content":"<p>by María Consuelo Miranda Montoya, Claudia Hormiga Sánchez, Ester Paiva Souto, Edna Acosta Pérez, Gustavo Corrêa Matta, Marcela Daza, Gabriela Lopes Gama, Camila Pimentel, Marcela Mercado, Angélica María Amado Niño, Luz Marina Leegstra, Elena Marbán Castro, Olivia C. Manders, Lauren Maxwell</p>\r\n\r\nProviding accurate, evidence-based information to women with Zika infection during pregnancy was problematic because of the high degree of uncertainty in the diagnosis of the infection and the associated risk. The 2015–17 Zika virus epidemic overwhelmingly affected women in countries with limited access to safe abortion. Understanding women’s perspectives on risk communication during pregnancy in the context of an emerging pathogen can help inform risk communication in response to future outbreaks that affect fetal or child development. We conducted a cross-sectional qualitative interview study with 73 women from 7 locations in Brazil, Colombia, and Puerto Rico to understand women’s experiences of Zika virus (ZIKV) test and outcome-related communication during the ZIKV pandemic. We used thematic analysis to analyze the in-depth interviews. Participants in Brazil and Colombia reported that the healthcare system’s lack of preparation and organization in communicating ZIKV test results and associated adverse outcomes led to their feeling abandoned and alone in confronting the challenges of a ZIKV-affected pregnancy. In contrast, participants in Puerto Rico reported that the regular testing schedules and clear, well-planned communication between the care team and between providers and pregnant women helped them to feel they could prepare for a ZIKV-affected pregnancy. Communication of the risk associated with an emerging pathogen suspected to affect pregnancy and developmental outcomes is a fraught issue. Public health authorities and healthcare providers should work together in the interpandemic period to understand families’ preferences for risk communication during pregnancy in the presence of uncertainty and develop a community-informed plan for risk communication.","author":"María Consuelo Miranda Montoya","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"328e9a5c9b34c92aceb8156965e8126fc8410284d8cda5d880006e8c99b361c3","category":"Environment"}