{"title":"Gears Technica: Favorite coffee-making setups from the Ars Technica staff","link":"https://arstechnica.com/?p=1966533","date":1694198733000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/kevin_coffee4-scaled.jpg\" /><p>(credit: Kevin Purdy)</p></div>\n<p>If you're like our staff, you'll understand that good cup of brewed coffee is a requirement every morning. Whether it's a simple French-pressed brew or an espresso-based drink with complex flavors and aromas, coffee has not only provided the fuel to get the Ars Technica stuff through our daily tasks but it's become a ritual that helps us start the day anew and grounds us—pun intended—amid the chaos of the world.</p>\n<p>We asked the Ars staff to show off their coffee-making setups and tips below—they range from low to high tech, from hand-cranked grinders to automatic machines and all points in between, but all these methods have one thing in common: They make awesome coffee.</p>\n<h2>John Timmer's setup: Flavorful French press method</h2>\n    <div>\n        <div>\n            <div>\n                <div>\n                    <div>\n                                                <h3>Buy The John Timmer French Press setup                                                </h3>\n                        <div>\n                                                            <ul>\n                                        \n                                    <li>\n                                        <a href=\"https://amzn.to/3PsNEAm\" target=\"_blank\">$20 Bodum at Amazon</a>\n                                    </li>\n                                        \n                                    <li>\n                                        <a href=\"https://amzn.to/481nHiR\" target=\"_blank\">$21 KitchenAid grinder at Amazon</a>\n                                    </li>\n                                                                    </ul>\n                                                    </div>\n                    </div>\n                </div>\n                            </div>\n        </div>\n        <div>\n            <div>(Ars Technica may earn compensation for sales from links on this post through <a href=\"/affiliate-link-policy/\">affiliate programs</a>.)</div>\n        </div>\n    </div>\n\n<p>What I want from coffee-making equipment is purely a function of what I'm looking for from coffee. And that is as much flavor as you can possibly extract from beans that are roasted so dark that they risk absorbing all light and becoming a black hole. I want a thin sheen of random organic molecules floating on top of an explosion of bitter, complex flavors.</p></div><p><a href=\"https://arstechnica.com/?p=1966533#p3\">Read 31 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1966533&amp;comments=1\">Comments</a></p>","author":"Chuong Nguyen","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"32912513d53b75e9c154c88509936f0600b5eff2bdc3114f091fa0e49e14697c","category":"Tech"}