{"title":"Avian hatching failure rates did not increase during the last century, although species of high conservation concern appear particularly susceptible to factors leading to reproductive failure","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duae018/7754265?rss=1","date":1715731200000,"content":"<span><div>Abstract</div>Increasing levels of global environmental change may have negative impacts on fertility and embryo viability in animals that could explain a recently reported increase in hatching failure in bird eggs across the globe. Here we test this relationship again by analyzing a dataset containing almost twice as many species and covering a longer time period than earlier works (<span>n</span> = 431 species during the period 1906–2022). We also tested for effects of Red List status and global population size. We found that hatching failure rates in a combined group of bird species currently classified as threatened (IUCN Red List categories Critically Endangered, Endangered and Vulnerable) or Near Threatened, peaked in the late 1970s to early 1980s and thereafter declined. A similar trend also existed in species with relatively small global populations. In contrast, no temporal trends were found in species in the Least Concern category, or in species with large global populations. Moreover, hatching failure rates declined significantly with increasing global population sizes. The temporal peak of hatching failure rates in threatened and Near Threatened species corresponds with the peak in environmental levels of the insecticide DDT. While this could suggest that environmental pollution caused the temporal trends in hatching failure rates, effects of inbreeding in small and threatened populations sampled more frequently during this period could not be excluded. Although we found no evidence suggesting that the rates of hatching failure in bird eggs are increasing, the current study supports previous works showing that species of high conservation concern appear to be more susceptible to factors leading to reproductive failure than other species.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"329f1e7b1f5a0f4973c3180f4522a7f108468aed6ffc440bd21ea50a440ce97f","category":"Environment"}