{"title":"Bubble Formation in Magma","link":"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-031621-080308?TRACK=RSS","date":1685491200000,"content":"<div><p>Volcanic eruptions are driven by bubbles that form when volatile species exsolve from magma. The conditions under which bubbles form depend mainly on magma composition, volatile concentration, presence of crystals, and magma decompression rate. These are all predicated on the mechanism by which volatiles exsolve from the melt to form bubbles. We critically review the known or inferred mechanisms of bubble formation in magmas: homogeneous nucleation, heterogeneous nucleation on crystal surfaces, and spontaneous phase separation (spinodal decomposition). We propose a general approach for calculating bubble nucleation rates as the sum of the contributions from homogeneous and heterogeneous nucleation, suggesting that nucleation may not be limited to a single mechanism prior to eruption. We identify three major challenges in which further experimental, analytical, and theoretical work is required to permit the development of a general model for bubble formation under natural eruption conditions.\n</p><ul>\n<li><span>▪ \n</span>We review the mechanisms of bubble formation in magma and summarize the conditions under which the various mechanisms are understood to operate.\n</li>\n<li><span>▪ \n</span>Bubble formation mechanisms may evolve throughout magma ascent as conditions change such that bubbles may form simultaneously and sequentially via more than one mechanism.\n</li>\n<li><span>▪ \n</span>Contributions from both homogeneous nucleation and heterogeneous nucleation on multiphase crystal phases can be captured via a single equation.\n</li>\n<li><span>▪ \n</span>Future work should focus on constraining macroscopic surface tension, characterizing the microphysics, and developing a general framework for modeling bubble formation, via all mechanisms, over natural magma ascent pathways.\n</li>\n</ul><p></p></div>","author":"James E. Gardner, Fabian B. Wadsworth, Tamara L. Carley, Edward W. Llewellin, Halim Kusumaatmaja and Dork Sahagian","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"32a467627318031f7b48a9a228ca99af16c3f5497299ef7f36cd7a6cca485b5a","category":"Environment"}