{"title":"Sepp Kuss may have to wait on Grand Tour leadership, but that’s OK with him","link":"https://cyclingtips.com/2021/08/sepp-kuss-may-have-to-wait-on-grand-tour-leadership-but-thats-ok-with-him/","date":1628708713000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/s_kuss-650x433.jpg\" /></div><h2>Sepp Kuss may have to wait on Grand Tour leadership, but that's OK with him</h2><p>\n</p><p>One month removed from taking his first Tour de France stage win, Sepp Kuss is gearing up for his second Grand Tour of the year. Earlier this season, it was looking like Kuss and his teammate Steven Kruijswijk might have a chance to lead the Jumbo-Visma team at the Vuelta a España, but when two-time defending champ Primož Roglič abandoned this year’s Tour, circumstances changed a bit. </p>\n\n\n\n<p>Roglič is the obvious candidate to lead the team in Spain, but Kuss doesn’t seem to mind a change in plans. As he told CyclingTips this week, the initial expectation was that he would “go in with a leadership role, but if we’re being realistic, it’s not like I would go there and expect to fight for the podium or something. It’s possible, but it’s hard to go there and build a team around myself or somebody and say, ‘This is the result we’re going for.'”</p>\n\n\n\n<p>Instead, Roglič’s presence in the race will likely draw attention away from Kuss, which could be a boon in and of itself.</p>\n\n\n\n<p>“With Primož, it’s more or less the same for me because I can still try to do my best result but there’s maybe even less pressure because he’s the big leader,” Kuss told CyclingTips. “He’s won it twice already, and if I can help him, then that also means it’s a good race for me as well. In the end, not much changes, and I think it’s an even better situation.”</p>\n\n\n\n<p>Kuss, 26, is in the midst of his fourth season at Jumbo-Visma, and his time at the team has seen him steadily progress each year. In his first season in yellow and black, he dominated the Tour of Utah with three stage wins and the overall title. In his second, he took his first Grand Tour stage win at the Vuelta. In his third, he climbed to victory on the final stage of the Critérium du Dauphiné and notched his first-ever GC top 10 in a WorldTour race.</p>\n\n\n\n<p>He took perhaps his flashiest step forward yet last month, when he ascended to victory on stage 15 of the Tour de France, a day that climbed to the highest point in the race before finishing in Andorra, the place Kuss calls home when he is in Europe.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033301-089-1340x913.jpg\" /><figcaption>Sepp Kuss wins stage 15 of the Tour de France.</figcaption></figure>\n\n\n\n<p>Inevitably, Kuss’s emergence has brought him to the foreground for American fans. His Tour stage win was the first for an American rider in more than a decade. In that time, the US domestic road racing scene has suffered a serious downturn, while the promising Americans that have reached the WorldTour ranks have not quite developed into big stars with consistent success the way many had hoped. Then again, those high hopes probably played a role in those disappointments – expectations have weighed heavily on the shoulders of American up-and-comers for years.</p>\n\n\n\n<p>A Tour stage win has boosted Kuss’s visibility ever higher, but he doesn’t seem too stressed by that yet. His gradual climb to the upper echelons of the sport has probably been a factor in that.</p>\n\n\n\n<p>“I haven’t shown all of what it takes to win a Tour de France or something yet, so I think that maybe eases the pressure a bit because I can still have good results but sometimes, I’m not really a GC guy, so maybe that helps a bit,” he said.</p>\n\n\n\n<p>The stress of living so far from home has been another obstacle for many non-Europeans trying to make it in a sport where so many of the major races are contested on European soil, but Kuss seems to have settled into life in Andorra nicely. The Colorado native says that “more and more, it’s easier to live in Europe” these days as an American pro, and that he is “really comfortable” spending so much time across the Atlantic.</p>\n\n\n\n<p>With that in mind, it was easy for him to get in a bit of recovery time after his Tour campaign with a second Grand Tour looming.</p>\n\n\n\n<p>“It’s a nice time of the year, just to enjoy riding. I spent a bit of time with my girlfriend and her family near Barcelona just to unwind a little bit, try and get a little suntan, and then just been up in the mountains doing some training, some nice riding,” he said. “I think just getting in a good mental place too is always nice before doing another Grand Tour.”</p>\n\n\n\n<p>That recovery will come in particularly handy with an especially difficult Vuelta parcours on tap. The race will waste little time throwing challenges at the GC hopefuls.</p>\n\n\n\n<p>“It looks really hard,” Kuss said of the race route. “The first week, there’s already a tough summit finish on the third stage, and then a lot of days in the high plains where it could be windy, so that’s going to be some stressful days, days where you can lose a lot. And then a lot of tough mountain stages in the Extremadura area in the middle, and then in Asturias in the end for the really big climbs.”</p>\n\n\n\n<p>Those big climbs will put Kuss and his Jumbo-Visma teammates to the test, particularly if a powerhouse Ineos Grenadiers team is still able to leverage its full strength into the third week of the race. Then again, the climbs will also be an opportunity for Kuss – who excels when the road goes up and doesn’t mind thinner air – to put his talents on display, whatever that might look like.</p>\n\n\n\n<p>“I think, tactically, it’s always better to have more guys as high on the GC as possible. For Steven and I, just to be up there,” Kuss said. “But the main focus is on Primož and for me that’s fine because I can be a bit more relaxed that way.”</p>\n\n\n\n<p>Looking further into the future term, Kuss says he remains intrigued by the prospect of focusing on his own GC chances in Grand Tours, but he also acknowledges that he has to get better in a variety of ways. As such, he’s working on shoring up the aspects of his skillset that need improvement, while not stressing too much about hitting any particular benchmarks. It’s a plan that’s worked out pretty well so far. He already has a pair of Grand Tour stage wins to his name and is already getting considered for Grand Tour leadership on one of the best teams in the world.</p>\n\n\n\n<p>“It’s definitely something I want to try for and I think always in training, I’m working on my weaknesses and just being more well-rounded,” he said. “I think that’s what you need. You can’t just be a climber anymore, you have to be able to do everything to do well in the Grand Tours. That’s something I work on. And I think if it’s meant to be, it’ll come naturally just through working on it. And if it doesn’t, that’s fine too. But for sure, it’s worth a shot to improve.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/sepp-kuss-may-have-to-wait-on-grand-tour-leadership-but-thats-ok-with-him/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"32aab1d8e3109d3e31cd97744cad82ef33069743a7813e06ca85f17145650c1a","category":"Cycling"}