{"title":"Multiparameter immunoprofiling for the diagnosis and differentiation of progressive versus nonprogressive nontuberculous mycobacterial lung disease–A pilot study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301659","date":1713535200000,"content":"<p>by Paige K. Marty, Balaji Pathakumari, Thomas M. Cox, Virginia P. Van Keulen, Courtney L. Erskine, Maleeha Shah, Mounika Vadiyala, Pedro Arias-Sanchez, Snigdha Karnakoti, Kelly M. Pennington, Elitza S. Theel, Cecilia S. Lindestam Arlehamn, Tobias Peikert, Patricio Escalante</p>\r\n\r\nClinical prediction of nontuberculous mycobacteria lung disease (NTM-LD) progression remains challenging. We aimed to evaluate antigen-specific immunoprofiling utilizing flow cytometry (FC) of activation-induced markers (AIM) and IFN-γ enzyme-linked immune absorbent spot assay (ELISpot) accurately identifies patients with NTM-LD, and differentiate those with progressive from nonprogressive NTM-LD. A Prospective, single-center, and laboratory technician-blinded pilot study was conducted to evaluate the FC and ELISpot based immunoprofiling in patients with NTM-LD (n = 18) and controls (n = 22). Among 18 NTM-LD patients, 10 NTM-LD patients were classified into nonprogressive, and 8 as progressive NTM-LD based on clinical and radiological features. Peripheral blood mononuclear cells were collected from patients with NTM-LD and control subjects with negative QuantiFERON results. After stimulation with purified protein derivative (PPD), mycobacteria-specific peptide pools (MTB300, RD1-peptides), and control antigens, we performed IFN-γ ELISpot and FC AIM assays to access their diagnostic accuracies by receiver operating curve (ROC) analysis across study groups. Patients with NTM-LD had significantly higher percentage of CD4<sup>+</sup>/CD8<sup>+</sup> T-cells co-expressing CD25<sup>+</sup>CD134<sup>+</sup> in response to PPD stimulation, differentiating between NTM-LD and controls. Among patients with NTM-LD, there was a significant difference in CD25<sup>+</sup>CD134<sup>+</sup> co-expression in MTB300-stimulated CD8<sup>+</sup> T-cells (p &lt;0.05; AUC-ROC = 0.831; Sensitivity = 75% [95% CI: 34.9–96.8]; Specificity = 90% [95% CI: 55.5–99.7]) between progressors and nonprogressors. Significant differences in the ratios of antigen-specific IFN-γ ELISpot responses were also seen for RD1-nil/PPD-nil and RD1-nil/anti-CD3-nil between patients with nonprogressive vs. progressive NTM-LD. Our results suggest that multiparameter immunoprofiling can accurately identify patients with NTM-LD and may identify patients at risk of disease progression. A larger longitudinal study is needed to further evaluate this novel immunoprofiling approach.","author":"Paige K. Marty","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"32b1407591a2db9e9ed9a78e49041cc0d5f7cd8a96129ab075dd901282dfa701","category":"Interdisciplinary"}