{"title":"Anxiety and depression symptoms among a sample of Khartoum civilians during the 2023 Sudan armed conflict: A cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307648","date":1721916000000,"content":"<p>by Ahmed Balla M. Ahmed, Ahmed A. Yeddi, Salma S. Alrawa, Esraa S. A. Alfadul</p>\r\nBackground <p>Mental health during armed conflicts is of paramount importance, as such situations often lead to increased risks of anxiety and depression symptoms among civilians. The military conflict between the Sudanese army and Rapid Support Forces, which began on April 15, 2023, is currently ongoing mainly in Khartoum State. Despite the significant impact of the conflict on the region, there is a lack of data regarding the mental health status of the residents. The aim of this study is to assess anxiety and depression symptoms among residents of Khartoum State during the first months of the 2023 military conflict.</p> Method <p>We conducted a cross-sectional study among residents of Khartoum State between May 27 and June 19 using an online questionnaire. We used standardized screening questionnaires, namely the Generalized Anxiety Disorder (GAD-7) for anxiety and the Patient Health Questionnaire (PHQ-9) for depression. Multiple logistic regression was used to identify sociodemographic factors that are associated with anxiety and depression symptoms.</p> Results <p>Out of the 393 participants in the study, 70% had symptoms suggestive of depression and 57.3% suffered from anxiety symptoms. Both anxiety and depression were associated with being female (p &lt; 0.001). Being married was a predictor of anxiety (p = 0.028) but not depression (p = 0.3). Other predictors were not significant (p &gt; 0.05).</p> Conclusion <p>High levels of anxiety and depression symptoms were prevalent among Khartoum residents during the conflict, with females and married individuals at higher risk. Immediate medical assessment is essential for identifying cases and providing support. Mental health services should be integrated into emergency response efforts, particularly focusing on vulnerable groups. Future research should address study limitations and explore coping strategies for anxiety and depression in Sudanese adults.</p>","author":"Ahmed Balla M. Ahmed","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"32bcd9086f65128ef91d186e1d15e7d0c66b95adae18747dc98e9770480cf7ff","category":"Interdisciplinary"}