{"title":"Informed consent in cancer clinical care: Perspectives of healthcare professionals on information disclosure at a tertiary institution in Uganda","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301586","date":1712239200000,"content":"<p>by Rebecca Kampi, Clement Okello, Joseph Ochieng, Erisa Sabakaki Mwaka</p>\r\nIntroduction <p>While there have been several studies examining the understanding and quality of informed consent in clinical trials of cancer therapies, there is limited empirical research on health practitioners’ experiences on the informed consent process in cancer care, especially from low resource settings. This study explored health professionals’ perspectives on information disclosure during the consenting process in cancer care.</p> Methods <p>A qualitative descriptive approach was used to collect data. Face to face interviews were conducted with 10 purposively selected healthcare professionals who were actively involved in soliciting informed consent at a cancer treatment centre in Uganda. A thematic approach was used to interpret the results.</p> Results <p>There were five key themes, and these included information disclosure to patients; assessment of patients’ cancer awareness, treatment preferences and expectations; informed consent practices; barriers to optimal informed consent and information disclosure; and recommendations for improving the consenting process. All respondents appreciated the value of disclosing accurate information to patients to facilitate informed decision making. However, the informed consent process was deemed sub-optimal. Respondents asserted that patients should be the psychological wellbeing of patients should be protected by mentally preparing them before disclosing potentially distressing information. All healthcare professionals were appreciative of the central role the family plays in the consenting process.</p> Conclusion <p>Overall, informed consent practices were not ideal because of the several challenges. Inadequate time is devoted to information disclosure and patient education; there is lack of privacy; and informed consent documentation is poor. There is a need for significant improvement in informed consent practices and healthcare professional-patient communication.</p>","author":"Rebecca Kampi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"32c080eeeb85ee36e82f536c9f5830a5ee93c6fa168da90635310c9ffe9d5c9d","category":"Interdisciplinary"}