{"title":"A circumpolar study unveils a positive non‐linear effect of temperature on arctic arthropod availability that may reduce the risk of warming‐induced trophic mismatch for breeding shorebirds","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17356?af=R","date":1717916400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1f837ba7-67e9-4cbf-ae2d-4334f1809ac4/gcb17356-toc-0001-m.png\" alt=\"A circumpolar study unveils a positive non-linear effect of temperature on arctic arthropod availability that may reduce the risk of warming-induced trophic mismatch for breeding shorebirds\" />\n<p>Arctic migratory birds heavily rely on seasonal arthropods for food. As temperatures rise, arthropod growth and activity change, potentially causing birds to become desynchronized with their food. Studying 19 sites across a wide temperature range from Subarctic to High Arctic, we found that warmer temperatures led to earlier and increased arthropod peaks. However, this increase in biomass was only significant within certain temperature ranges. Prolonged exposure to elevated temperatures could therefore improve food access for some Arctic birds, potentially reducing the risk of a mismatch with their prey.</p>\n<br />\n<h2>Abstract</h2>\n<p>Seasonally abundant arthropods are a crucial food source for many migratory birds that breed in the Arctic. In cold environments, the growth and emergence of arthropods are particularly tied to temperature. Thus, the phenology of arthropods is anticipated to undergo a rapid change in response to a warming climate, potentially leading to a trophic mismatch between migratory insectivorous birds and their prey. Using data from 19 sites spanning a wide temperature gradient from the Subarctic to the High Arctic, we investigated the effects of temperature on the phenology and biomass of arthropods available to shorebirds during their short breeding season at high latitudes. We hypothesized that prolonged exposure to warmer summer temperatures would generate earlier peaks in arthropod biomass, as well as higher peak and seasonal biomass. Across the temperature gradient encompassed by our study sites (&gt;10°C in average summer temperatures), we found a 3-day shift in average peak date for every increment of 80 cumulative thawing degree-days. Interestingly, we found a linear relationship between temperature and arthropod biomass only below temperature thresholds. Higher temperatures were associated with higher peak and seasonal biomass below 106 and 177 cumulative thawing degree-days, respectively, between June 5 and July 15. Beyond these thresholds, no relationship was observed between temperature and arthropod biomass. Our results suggest that prolonged exposure to elevated temperatures can positively influence prey availability for some arctic birds. This positive effect could, in part, stem from changes in arthropod assemblages and may reduce the risk of trophic mismatch.</p>","author":"Aurélie Chagnon‐Lafortune, \nÉliane Duchesne, \nPierre Legagneux, \nLaura McKinnon, \nJeroen Reneerkens, \nNicolas Casajus, \nKenneth F. Abraham, \nÉlise Bolduc, \nGlen S. Brown, \nStephen C. Brown, \nH. River Gates, \nOlivier Gilg, \nMarie‐Andrée Giroux, \nKirsty Gurney, \nSteve Kendall, \nEunbi Kwon, \nRichard B. Lanctot, \nDavid B. Lank, \nNicolas Lecomte, \nMaria Leung, \nJoseph R. Liebezeit, \nR. I. Guy Morrison, \nErica Nol, \nDavid C. Payer, \nDonald Reid, \nDaniel Ruthrauff, \nSarah T. Saalfeld, \nBrett K. Sandercock, \nPaul A. Smith, \nNiels Martin Schmidt, \nIngrid Tulp, \nDavid H. Ward, \nToke T. Høye, \nDominique Berteaux, \nJoël Bêty","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"32c1c1287f272d9eab572d56542b82486e0ced2d2477fce06b3cc55ec15dc865","category":"Environment"}