{"title":"Targeting of oxidized Macrophage Migration Inhibitory Factor (oxMIF) with antibody ON104 attenuates the severity of glomerulonephritis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311837","date":1728309600000,"content":"<p>by Maroua Ferhat, Julia Mayer, Lyndon H. Costa, Maria Prendecki, Alejandro A. Puchol Tarazona, Alexander Schinagl, Randolf J. Kerschbaumer, Frederick W. K. Tam, Christine Landlinger, Michael Thiele</p>\r\n\r\nThe oxidized form of Macrophage Migration Inhibitory Factor (oxMIF) has been identified as the disease-related isoform of MIF, exerting pathological functions in inflamed tissue. In this study, we aimed to explore the <i>in vivo</i> effects of the neutralizing anti-oxMIF antibody ON104 in a rat model of crescentic glomerulonephritis (CGN), to better understand its disease modifying activities. WKY rats received a single intravenous injection of a rabbit nephrotoxic serum (NTS), targeting rat glomerular basement membrane to induce CGN. On day 4 and day 6, ON104 was given intraperitoneally (<i>i</i>.<i>p</i>.) and on day 8 urine, blood and kidney tissue were collected. ON104 substantially attenuated the severity of CGN demonstrated by reduced proteinuria, hematuria, as well as lower levels of kidney injury molecule (KIM)-1. ON104 treatment preserved the glomerular morphology and suppressed crescent formation, a hallmark of the disease. On the cellular level, oxMIF neutralization by ON104 strongly reduced the number of macrophages and neutrophils within the inflamed kidneys. <i>In vitro</i>, we identified human neutrophils, but not monocytes, as main producers of oxMIF among total peripheral cells. The present study demonstrates that oxMIF is a pertinent therapeutic target in a model of CGN which mechanistically resembles human immune mediated CGN. In this model, neutralization of oxMIF by ON104 leads to an improvement in both urinary abnormalities and histological pathological characteristics of the disease. ON104, thus has the potential to become a novel disease-modifying drug for the treatment of glomerulonephritis and other inflammatory kidney diseases.","author":"Maroua Ferhat","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"32c46c88de1717cc52a943288cfa0e47f29f53f0adce6ffb9220d0382b3c7f00","category":"Interdisciplinary"}