{"title":"Systematic review and narrative synthesis of the experiences of individuals with chronic pain participating in digital pain management interventions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306455","date":1720447200000,"content":"<p>by Justin Damian Russell Strain, Lindsay Welch, Euan Sadler</p>\r\nBackground <p>The use of digital pain management interventions has grown since the Covid 19 pandemic. The aim of this study was to systematically review and synthesise evidence from qualitative studies regarding the experiences of individuals with chronic pain participating in digital pain management interventions in primary care and community settings.</p> Methods <p>Fourteen databases were searched, as well as citation tracking and hand-searching reference lists of included articles. The latest search was completed by 07/07/2023. Qualitative studies of patient and carer perspectives of digital pain management interventions for adults aged 18 and over with non-malignant chronic pain were included. All studies were appraised for quality using the Critical Appraisal Skills Programme Qualitative Checklist. A narrative synthesis approach was used to synthesise the findings. Normalisation Process Theory was used to understand how individuals with chronic pain make sense of digital pain management interventions and incorporate knowledge, skills and strategies learnt into their day-to-day lives.</p> Results <p>Eleven studies, encompassing both digital applications for use on smartphones/ mobile devices and user-directed online modular programmes, were included in the synthesis. Three main themes and related subthemes were identified from the included studies: 1) Making sense of the digital intervention (Subthemes: Tailoring to user’s needs; Human contact and support; Accessibility of the digital intervention; Personal and environmental factors affecting engagement with digital interventions); 2) Initiating and Maintaining Behaviour Change (Subthemes: Planning activity; Being active); and 3) Personal Growth (Subthemes: Gaining understanding and skills; Gaining and acting on feedback; Negotiating a new relationship with pain).</p> Conclusion <p>Recommendations. The key recommendations from our findings are that digital pain management interventions should provide:Limitations of the review. To reduce bias, it would have been preferable for more than one author to independently fully analyse each paper and to identify themes and sub-themes. Instead, the identified themes and sub-themes were discussed with two other authors in the team (ES, LW) to reach a consensus view on final themes and sub-themes. One author (JS) received a Research Internship and Research Initiation Award funded by NIHR Applied Research Collaboration (ARC) Wessex (https://www.arc-wx.nihr.ac.uk/) and NHS England (https://www.england.nhs.uk/). The protocol for this review was registered with the National Institute of Health Research (NIHR) PROSPERO international database for registering systematic reviews (PROSPERO Registration Number CRD42021257768).</p>","author":"Justin Damian Russell Strain","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"32ce8593fbdd07e0fbffe8ec53174b1502faae6b0a453abae5aef6e72cf6610c","category":"Interdisciplinary"}