{"title":"Epidemiology of acute kidney injury in the clinical emergency: A prospective cohort study at a high-complexity public university hospital in São Paulo, Brazil","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309949","date":1725544800000,"content":"<p>by Flávia Barros de Azevedo, Farid Samaan, Dirce Maria Trevisan Zanetta, Luis Yu, Irineu Tadeu Velasco, Emmanuel de Almeida Burdmann</p>\r\nIntroduction <p>Southern Hemisphere countries have been underrepresented in epidemiological studies on acute kidney injury (AKI). The objectives of this study were to determine the frequency, risk factors, and outcomes of AKI in adult hospitalized patients from the emergency department of a public high-complexity teaching hospital in the city of São Paulo, Brazil.</p> Methods <p>Observational and prospective study. AKI was defined by the KDIGO guidelines (Kidney Disease: Improving Global Outcomes) using only serum creatinine.</p> Results <p>Among the 731 patients studied (age: median 61 years, IQR 47–72 years; 55% male), 48% had hypertension and 28% had diabetes as comorbidities. The frequency of AKI was 52.1% (25.9% community-based AKI [C-AKI] and 26.3% hospital-acquired AKI [H-AKI]). Dehydration, hypotension, and edema were found in 29%, 15%, and 15% of participants, respectively, at hospital admission. The in-hospital and 12-month mortality rates of patients with vs. without AKI were 25.2% vs. 11.1% (p&lt;0.001) and 36.7% vs. 12.9% (p&lt;0.001), respectively. The independent risk factors for C-AKI were chronic kidney disease (CKD), chronic liver disease, age, and hospitalization for cardiovascular disease. Those for H-AKI were CKD, heart failure as comorbidities, hypotension, and edema at hospital admission. H-AKI was an independent risk factor for death in the hospital, but not at 12 months. C-AKI was not a risk factor for death.</p> Conclusions <p>AKI occurred in more than half of the admissions to the clinical emergency department of the hospital and was equally distributed between C-AKI and H-AKI. Many patients had correctable risk factors for AKI, such as dehydration and arterial hypotension (44%) at admission. The only independent risk factor for both C-AKI and H-AKI was CKD as comorbidity.</p>","author":"Flávia Barros de Azevedo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"32d670c00f8e26f27e143ca09164822f4ecda4cb414b26800d628f559e0f8169","category":"Interdisciplinary"}