{"title":"Apple Adds Push Notification Data to Law Enforcement Guidelines","link":"https://www.macrumors.com/2023/12/07/apple-updates-law-enforcement-guidelines/","date":1701945131000,"content":"Apple has updated its <a href=\"https://www.apple.com/legal/privacy/law-enforcement-guidelines-us.pdf\">Legal Process Guidelines</a> to reflect the company's legal obligation to comply with law enforcement requests for Apple ID information associated with its push notification service. The change follows yesterday's revelation that governments are actively using smartphone notification data as a <a href=\"https://www.macrumors.com/2023/12/06/apple-governments-surveil-push-notifications/\">user surveillance tool</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/appleprivacyad-cleaned.jpg\" width=\"1600\" height=\"872\" />\r<br />\nIn the section titled \"Information Available from Apple,\" Apple has appended an alphabetical list with the subsection \"AA. Apple Push Notification Service (APNs),\" which reads:\r<br />\n<blockquote>When users allow an application they have installed to receive push notifications, an Apple Push Notification Service (APNs) token is generated and registered to that developer and device. Some apps may have multiple APNs tokens for one account on one device to differentiate between messages and multi-media.\r<br />\n\r<br />\nThe Apple ID associated with a registered APNs token may be obtained with a subpoena or greater legal process.</blockquote>Apple and Google have been forced by governments at home and abroad to provide users' data from notifications they get on their devices, US Senator Ron Wyden revealed on Wednesday in a letter to the Justice Department, drawing attention to a new smartphone privacy concern.\r<br />\n\r<br />\nThe Justice Department declined to comment on the letter, but Apple and Google confirmed that they have been subject to the requests. The companies explained that they had been prohibited from sharing information about how governments monitored push notifications until Wyden's letter had been made public and given them the legal opening they needed.\r<br />\n\r<br />\nWith push notifications enabled, Apple and Google create a small bit of data, known as a token, that links the user's device to the account information they've given the companies, such as their name and email address.\r<br />\n\r<br />\nA <em>Reuters</em> source familiar with the matter confirmed that both foreign and U.S. government agencies have been asking Apple and Google for user information related to push notifications. The data is said to have been used to attempt to tie anonymous users of messaging apps to specific Apple or Google accounts.\r<br />\n\r<br />\n<a href=\"https://www.washingtonpost.com/technology/2023/12/06/push-notifications-surveillance-apple-google/\"><em>The Washington Post</em></a> said on Wednesday it had found more than two dozen search warrant applications and other documents in court records related to federal requests for push notification data. Though many were redacted, nine of the documents pertained to the federal hunt for U.S. Capitol rioters on January 6, 2021.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-privacy/\">Apple Privacy</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/07/apple-updates-law-enforcement-guidelines/\">Apple Adds Push Notification Data to Law Enforcement Guidelines</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-adds-push-notification-data-to-law-enforcement-guidelines.2413049/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"32d6ba8b34b27415bc61f0771c50c388e57923348370dbc80def24075ca0e734","category":"Apple"}