{"title":"PSI-7 Hourly flushing rates and temperature trends for electronically controlled grouped floor cooling pads trends during the summer heat stress in a boar stud","link":"https://academic.oup.com/jas/article/102/Supplement_2/351/7664935?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of the study was to evaluate the flushing management trends of the electronically controlled grouped floor cooling pads (ECP) during the summer heat stress in a boar stud at Scottsville, Kentucky. Four groups of 5 ECPs connected to each other were placed in 15 boar crates (2.06 x 0.66 m) in a 350 head evaporative cooled, tunnel ventilated barn. One set of ECP (Zone 1) had temperature sensors placed on the 5<sup>th</sup> pad which triggers flushing of 4.25 L cold water (over 80 sec interval) when sensors reached 27°C. The other two sets of ECP (Zones 2 and 5) had temperature sensors on the first pad and flushing the same cold-water volume when sensors reached 24°C (based on the first pad averaging 3°C lower temperature than the last pad) or every 4 min, whichever occurred first. Cold water for Zone 1 and 2 came from cooling tank 1 (Mean = 17.35°C) while Zone 5 cold water came from cooling tank 2 (Mean = 15.7°C). The water in both tanks was cooled using a 2 HP Hydro Frost Chiller. Daily ECP temperatures (PT), ECP flushing rate (FR), barn temperature (BT) barn relative humidity (RH) barn dewpoint (DP) and cooling tank temperature (TT) were collected every 10 min for the ECP variables and 30 mins for the environmental variables. Boars experienced varying natural summer heat stress (temperature and corresponding relative humidity and dewpoint: Mean = 25.3°C, 87.2%, 23.2°C; high: 29.0°C, 84.5%, 26.1°C), July 29, 2023. A mixed model was used for statistical analysis in SAS including fixed effects of zone and hour. FR and PT readings were affected by the zone, hour of day and all two- and three-way interactions (<span>P</span> &lt; 0.001). All of the zones flushed more frequently late morning to afternoon (Mean: 64.6%) from 1100 to 1600 h and gradually the FR decreased in the evening (1900 h onwards). Zone 1 flushed more frequently (47.7%) than the 2 other zones (Zone 2 = 39.9%, Zone 5 = 33%). Zone 1 ECP temperature averaged 26.7°C (hourly mean range 26.1°C to 27.3°C). Zone 2 ECP temperatures averaged 22.1°C (hourly mean range 19.7°C to 24.1°C). Zone 5 ECP temperature patterns averaged 20.7°C (hourly mean range 19.1°C to 22.4). Zone 1 flushed less frequently (30.3%) at between 2100 to 0400 h. The following day and PT stayed cooler (Mean = 26.7°C) compared with the PT during the middle of the day (27.1°C).The set temperature (27°C; 24°C) or set time every 4 min kept the temperature of the ECP at desirable temperature, below 27°C for the last boar pad or below 24°C for the first of 5 pads (with approximate 3°C difference between the first and last of the of the 5 pads).</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"32d91f3ad458f195a61375af450c98e22b14f92c16aeb009b5c973a881d2e281","category":"Environment"}