{"title":"Phil Spencer ประธาน Xbox ได้ลอง Steam Deck แล้ว ระบุเล่นเกมคล่องมือ, xCloud ใช้ได้ดี","link":"https://www.blognone.com/node/124240","date":1629086811000,"content":"<div><div><div><p>ดูเหมือนว่า Valve จะส่ง Steam Deck รุ่นก่อนวางจำหน่าย พร้อมกระเป๋าใส่เครื่องให้ Phil Spencer ประธาน Xbox ได้ลองใช้งาน หลัง Phil Spencer ออกมาทวิตว่า เขาได้ลองเล่นเกมบน Steam Deck มาประมาณเกือบหนึ่งสัปดาห์แล้ว และพบว่าการควบคุมในเกมอย่าง Halo และ Age of Empires III ทำได้ดี และ xCloud บริการสตรีมมิ่งเกมของ Xbox Game Pass ก็ทำงานได้ดีเช่นกัน</p>\n<p>การที่ Halo เล่นได้ดีนั้นไม่น่าแปลกใจเท่าไร เพราะก็เป็นเกมยิงมุมมองบุคคลที่หนึ่งที่ถูกออกแบบเพื่อให้เล่นบนเครื่องคอนโซลเช่น Xbox ได้ แต่การที่เกม Age of Empire ซึ่งเป็นเกมวางแผนที่ต้องใช้เมาส์ควบคุมเป็นหลักเล่นได้ดีเช่นกัน แปลว่าการควบคุมผ่านจอสัมผัสและทัชแพดของ Steam Deck น่าจะใช้งานแทนเม้าส์ได้ดีพอสมควร ส่วนการเล่นเกมบน xCloud ได้นั้นไม่น่าแปลกใจ เพราะ Steam Deck จริงๆ ก็คือพีซีที่ใช้ลินุกซ์เครื่องหนึ่งนั่นเอง</p>\n<p>อีกจุดที่น่าสนใจในทวิตนี้คือการ Phil Spencer เข้าไปคุยกับ Valve ถึงออฟฟิศ หาก Valve สามารถสร้างพันธมิตรที่แข็งแกร่งร่วมกับ Microsoft/Xbox เพื่อรองรับทั้ง Xbox Game Pass ที่มีเกมฟรีมากมาย และทำให้ Steam Deck เล่น xCloud ได้อย่างไม่มีสะดุด ในที่สุดแล้ว Steam Deck น่าจะกลายมาเป็นอุปกรณ์เล่นเกมที่น่ากลัวไม่น้อย</p>\n<p>ที่มา - <a href=\"https://twitter.com/XboxP3/status/1426324572626845697\">Twitter: Phil Spencer</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/81a1ff7446b80a8111309ceb49d29e2f.jpg\" /><em>ภาพ Steam Deck พร้อมกระเป๋า ของ Phil Spencer</em></p>\n<blockquote><p>Was <a href=\"https://twitter.com/valvesoftware?ref_src=twsrc%5Etfw\">@valvesoftware</a> this week talking w/ Scott, Erik, Gabe about Steam Deck. After having mine most of the week I can say it's a really nice device. Games with me on the go, screen size, controls all great. Playing Halo and Age feels good, xCloud works well. Congrats SD team. <a href=\"https://t.co/q4hWBvkk85\">pic.twitter.com/q4hWBvkk85</a></p>\n<p>— Phil Spencer (@XboxP3) <a href=\"https://twitter.com/XboxP3/status/1426324572626845697?ref_src=twsrc%5Etfw\">August 13, 2021</a></p></blockquote>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/steam-deck\">Steam Deck</a></div><div><a href=\"/topics/valve\">Valve</a></div><div><a href=\"/topics/xcloud\">xCloud</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"32dd9ba89ea0c6214f13bac605a748b600f05c16f58c31246887d414bb6fefd1","category":"Thai"}