{"title":"MacRumors Giveaway: Win a Flight Bag Leather Briefcase and Accessories From Saddleback Leather Co.","link":"https://www.macrumors.com/2021/10/01/macrumors-giveaway-saddleback-leather-bag/","date":1633111200000,"content":"We've teamed up with Saddleback Leather Co. to offer <em>MacRumors</em> readers a chance to win a prize pack that includes a <a href=\"https://saddlebackleather.com/flight-bag-leather-briefcase/\">Flight Bag Leather Briefcase</a>, a <a href=\"https://saddlebackleather.com/leather-airpod-pro-case/\">Leather AirPods Pro Case</a>, a <a href=\"https://saddlebackleather.com/leather-airtag-case-a-k-a-the-double-loop/\">Double Loop AirTag Holder</a>, and a <a href=\"https://saddlebackleather.com/Leather-AirTag-Keychain-Case-a-k-a-The-Sleeve/\">Square Sleeve AirTag Holder</a>, all made from a rich, dark coffee brown leather.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/saddleback-leather-bag-1.jpg\" />\r\n<br />\r\nThe <a href=\"https://saddlebackleather.com/flight-bag-leather-briefcase/\">Flight Bag Leather Briefcase</a> is Saddleback's most popular product, and it's no surprise -- this is an attractive, heavy duty bag that's laden with pockets and able to hold all of your Apple gear. Saddleback Leather Co. calls the Flight Bag the strongest and most durable leather briefcase in the world, and to back that up, it comes with a 100-year warranty.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/saddleback-leather-bag-4.jpg\" />\r\n<br />\r\nPriced at $589, the Flight Bag is made from a thick full-grain leather that's super tough and able to hold up to wear and tear. Inside, there's a pigskin lining that's even stronger than leather, and it's all stitched up with marine grade UV resistant thread.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/saddleback-leather-bag-3.jpg\" />\r\n<br />\r\nThere are no breakable parts like magnets or zippers, with Saddleback Leather using durable 316 stainless steel buckles and rivets instead. Stress points are reinforced, and each bag is built with the largest leather pieces possible for fewer seams. Saddleback offers the Flight Bag in Tobacco, Dark Coffee Brown, Chestnut, and Black.\r\n<br />\r\n\r\n<br />\r\nThe Flight Bag is designed to open at the top and stay open so you can access what's inside with ease, and there's a dedicated laptop compartment that's sized to fit all of Apple's tablets and notebook options. A main pouch holds documents, books, and other necessary gear, and there are two front pockets to hold smaller accessories. A slot at the back adds extra storage, and the bag can be carried with the build-in handles or an included strap.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/saddleback-leather-2.jpg\" />\r\n<br />\r\nAlong with leather bags, Saddleback Leather Co. makes a whole range of other accessories. The $34 <a href=\"https://saddlebackleather.com/leather-airpod-pro-case/\">Leather AirPods Pro Case</a>, for example, is a little mini pouch that houses the <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> and offers a carabiner to attach them to a bag or a backpack. There's a simple peg closing mechanism, and the case itself is made from a full grain leather that matches Saddleback's bags.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/saddleback-leather-airpods-pro.jpg\" />\r\n<br />\r\nSaddleback also makes several AirTag holder options. The $19 <a href=\"https://saddlebackleather.com/leather-airtag-case-a-k-a-the-double-loop/\">Double Loop</a>, as the name suggests, has a two-loop design that's perfect for attaching to dog collars, backpack shoulder straps, belts, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/saddleback-leather-airtag-double-loop.jpg\" />\r\n<br />\r\nThe $19 <a href=\"https://saddlebackleather.com/Leather-AirTag-Keychain-Case-a-k-a-The-Sleeve/\">square-shaped Sleeve</a> AirTag holder is designed to attach to keys, backpacks, bags, and more, and both AirTag holder options come in the same matching leather as Saddleback's bags for a cohesive look for all of your accessories.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/saddleback-leather-airtag-square.jpg\" />\r\n<br />\r\nWe have a prize pack that includes a Flight Bag Leather Briefcase, a Leather ‌AirPods Pro‌ Case, a Double Loop AirTag Holder, and a Square Sleeve AirTag Holder for one lucky <em>MacRumors</em> reader. To enter to win, use the Gleam.io widget below and enter an email address. Email addresses will be used solely for contact purposes to reach the winners and send the prizes. You can earn additional entries by subscribing to our <a href=\"https://my.leadpages.net/leadbox/145ef7173f72a2%3A104a9fa76b46dc/5754903989321728/\">weekly newsletter</a>, subscribing to our <a href=\"https://www.youtube.com/user/macrumors\">YouTube channel</a>, following us on <a href=\"https://twitter.com/macrumors\">Twitter</a>, following us on <a href=\"https://www.instagram.com/macrumors/\">Instagram</a>, or visiting the <em>MacRumors</em> <a href=\"https://www.facebook.com/MacRumors\">Facebook page</a>.\r\n<br />\r\n\r\n<br />\r\nDue to the complexities of international laws regarding giveaways, only <strong>U.S. residents who are 18 years or older and Canadian residents (excluding Quebec) who have reached the age of majority in their province or territory are eligible to enter</strong>. To offer feedback or get more information on the <a href=\"https://www.macrumors.com/guide/giveaway/\">giveaway</a> restrictions, please refer to <a href=\"http://forums.macrumors.com/threads/macrumors-giveaways-why-are-they-only-open-to-u-s-residents.1918337/\">our Site Feedback section</a>, as that is where discussion of the rules will be redirected.\r\n<br />\r\n\r\n<br />\r\n<div><a href=\"https://gleam.io/8SPp8/saddleback-leather-co-giveaway\">Saddleback Leather Co. Giveaway</a></div>The contest will run from today (October 1) at 11:00 a.m. Pacific Time through 11:00 a.m. Pacific Time on October 8. The winner will be chosen randomly on October 8 and will be contacted by email. The winner will have 48 hours to respond and provide a shipping address before a new winner is chosen.<div>Tag: <a href=\"https://www.macrumors.com/guide/giveaway/\">giveaway</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/01/macrumors-giveaway-saddleback-leather-bag/\">MacRumors Giveaway: Win a Flight Bag Leather Briefcase and Accessories From Saddleback Leather Co.</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/macrumors-giveaway-win-a-flight-bag-leather-briefcase-and-accessories-from-saddleback-leather-co.2314866/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=M46UsfIjM4M:wsN_nw5GpO0:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=M46UsfIjM4M:wsN_nw5GpO0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/M46UsfIjM4M\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"32dfb8c3ff419021c3464e594c51e94084de7e4ab43b0b9464e56129f79b6d37","category":"Apple"}