{"title":"The Apple Watch Series 7 will have a new design, report says","link":"https://arstechnica.com/?p=1773206","date":1623700473000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/Apple-Watch-Series-6-Review-1-800x534-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/Apple-Watch-Series-6-Review-1-800x534.jpg\">Enlarge</a> <span>/</span> The Apple Watch Series 6, which the new model discussed here would probably replace. (credit: <a href=\"https://arstechnica.com/gadgets/2020/09/apple-watch-series-6-review-still-the-best-smartwatch-but-tracking-is-lacking/\">Corey Gaskin</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Like clockwork, Apple has released a new Apple Watch around the same time every year since the device was first introduced in 2015. So no one should be surprised that a new Apple Watch is due later this year. But a report from Bloomberg's Mark Gurman and Debby Wu goes into much more detail than just \"the Watch is coming soon.\"</p>\n<p>Citing \"people with knowledge of the plans,\" Gurman and Wu say the new smartwatch will \"likely\" be called the Apple Watch Series 7. No surprise there, either.</p>\n<p>More surprising: Their sources say the new Apple Watch is likely to be just a bit thicker than the current model. Additionally, Apple is exploring reducing the screen bezels and introducing \"a new lamination technique that brings the display closer to the front cover.\" The Watch is also said to have the same ultra-wideband technology found in AirTags and recent iPhones, which will be used for things like unlocking doors.</p></div><p><a href=\"https://arstechnica.com/?p=1773206#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1773206&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"32e0a22f2aa9dc045e65f292a110deebcbd29b6a97e18431c224ff058217a3e4","category":"Tech"}