{"title":"The Fin‐Improving Effects of Fucosylated Chondroitin Sulfate from Green and Purple Apostichopus japonicus on Caudal Fin Regeneration of Zebrafish Larvae","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/9258423?af=R","date":1676102400000,"content":"<p>This study investigated the capability for fin regeneration in zebrafish larvae with the mechanism of FCS isolated from green and purple sea cucumbers <i>Apostichopus japonicus</i> (G-FCS and P-FCS). HPGPC determined that mean molecular weight of purified G-FCS and P-FCS is 19.5 and 18.8 kDa, and the FT-IR spectrum displayed similar characteristic absorption peaks. AFM images presented that G-FCS was shown as a spherical polysaccharide, while P-FCS molecules exhibited elongated chains. For the regeneration examination, FCS increased the regrowth area of the larval fin at 48 hours postamputation with enhanced locomotor behaviors, and the transcription levels of regeneration-related genes (<i>Wnt10a</i>, <i>msx1b</i>, <i>fgf20a</i>, <i>bmp2a</i>, <i>bmp4</i>, and <i>igf2b</i>) were upregulated. Moreover, FCS promoted the mRNA expression of inflammatory factors (<i>iNOS</i>, <i>TNF-α</i>, <i>IL-6</i>, <i>IL-10</i>, and <i>IFN-γ</i>) and TLR/NF-<i>κ</i>B pathway-related genes (<i>TLR3</i>, <i>TLR4a</i>, <i>NF-κb</i>, and <i>MyD88</i>). The Western blot analyses of TNF-<i>α</i> and IL-1<i>β</i> supported that FCS enhanced immune response. ELISA results indicated that FCSs increased the contents of NO, CAT, SOD, and G6PD. Summarily, the present results suggested that FCS was a potential regeneration enhancer by elevating immunomodulatory and antioxidative processes in zebrafish.</p>","author":"Tingting Hou, \nZaizhao Wang, \nKui Tang, \nShuai Zhang, \nShilin Liu, \nJialiang Liu, \nXiaoteng Fan, \nXiaolin Liu, \nUmit Acar","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"32e60e40ea377c3d1cd1a4aa5a6a5604577de8d2567cf7468f93086524d1a3ed","category":"Environment"}