{"title":"Valuing Combinations of Flexible Planning, Design, and Operations in Water Supply Infrastructure","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036048?af=R","date":1711019991000,"content":"<h2>Abstract</h2>\n<p>Uncertainty arising from climate change poses a central challenge to the long-term performance of many engineered water systems. Water supply infrastructure projects can leverage different types of flexibility, in planning, design, or operations, to adapt infrastructure systems in response to climate change over time. Both flexible planning and design enable future capacity expansion if-and-when needed, with flexible design proactively incorporating physical design changes that enable retrofits. All three forms of flexibility have not previously been analyzed together to explicitly assess their relative value in mitigating cost and water supply reliability risk. In this paper, we propose a new framework to evaluate combinations of flexible planning, design, and operations. We develop a nested stochastic dynamic optimization approach that jointly optimizes dam development and operating policies under dynamic climate uncertainty. We demonstrate this approach on a reservoir project near Mombasa, Kenya. Our results find that flexible operations have the greatest potential to reduce costs. Flexible design and flexible planning can amplify the value of flexible operations under higher discounting scenarios and when initial infrastructure capacities are undersized. This approach provides insight on the climate change and techno-economic conditions under which flexible planning, design, and operations can be best leveraged individually or in combination to reduce climate change uncertainty risks in water supply infrastructure projects.</p>","author":"Keani Willebrand, \nMarta Zaniolo, \nJennifer Skerker, \nSarah Fletcher","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"32f9d9914e287762adc6a855a7ff12b4888673a39afaf918744ba4cf94ae6dae","category":"Environment"}