{"title":"Netflix Considering Move into Gaming With Apple Arcade-Style Bundle","link":"https://www.macrumors.com/2021/05/25/netflix-could-offer-apple-arcade-style-service/","date":1621936138000,"content":"Netflix is mulling an expansion into online gaming that could end up being similar to Apple's digital subscription offering, <a href=\"https://www.macrumors.com/guide/apple-arcade/\">Apple Arcade</a>, according to multiple reports.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/Netflix-16x9.jpg\" />\r\n<br />\r\nNews of the plans began trickling out on Friday when <em><a href=\"https://www.theinformation.com/articles/netflix-seeks-executive-to-expand-game-efforts\">The Information</a></em> reported that Netflix had approached veteran game industry executives about joining the company.\r\n<br />\r\n<blockquote>Netflix is looking to hire an executive to oversee an expansion into videogames, a sign it is stepping up its efforts to grow beyond traditional filmed entertainment, according to people familiar with the situation.\r\n<br />\r\n\r\n<br />\r\n[...]\r\n<br />\r\n\r\n<br />\r\nOne option the company has discussed is offering a bundle of games similar to Apple's online subscription offering, ‌Apple Arcade‌, one of the people said.</blockquote>The planned hire, since <a href=\"https://www.reuters.com/technology/netflix-looking-hire-executive-gaming-expansion-information-2021-05-21/\">corroborated</a> by <em>Reuters</em>' sources, signifies part of a wider push into gaming that is said to have been prompted by a desire to find new ways to attract subscribers after the company's slowed growth in the U.S. market. \r\n<br />\r\n\r\n<br />\r\nAccording to <em>The Information</em>, Netflix's plans are still \"very much in flux,\" although it has reportedly decided not to include ads in the games, which suggests an upcoming service that would be offered to subscribers as an extra bundle.\r\n<br />\r\n\r\n<br />\r\nSince the initial report, an <em><a href=\"https://www.axios.com/netflix-gaming-expansion-cde0f3ae-15de-4378-b2b8-fd0aaf0e91f6.html\">Axios</a></em> source has said to think of the service as \"a smaller ‌Apple Arcade‌\" bundle that would consist of a mix of licensed Netflix intellectual property and original work commissioned from independent studios.\r\n<br />\r\n\r\n<br />\r\nThe move follows previous dips into gaming by the company, such as its ill-fated partnership with Telltale Games to create a game based on \"Stranger Things,\" which was never released, and its choose-your-adventure style film \"Black Mirror: Bandersnatch,\" which proved a hit. \r\n<br />\r\n\r\n<br />\r\nNetflix already offers several shows based on popular video games, such as \"The Witcher\" and \"Resident Evil,\" so it could be looking at leveraging this lucrative IP and offering new titles that could even produce spin-off shows further down the line.\r\n<br />\r\n\r\n<br />\r\nAsked from comment on the latest reports, Netflix didn't deny the planned gaming exec hire and told <em>Axios</em> and <em>The Information</em> that it's \"excited to do more with interactive entertainment.\"\r\n<br />\r\n\r\n<br />\r\nWhatever the outcome, Netflix's gaming service is said to be some way off, with <em>Axios</em>' sources suggesting a possible launch in 2022, although plans are subject to change. \r\n<br />\r\n\r\n<br />\r\nAs if to underline the fluid nature of the plans, <em>The Information</em> reported that Netflix hasn't ruled out other potential approaches, including the possibility of making games in-house or getting the games to run on smart TVs.<div>Tags: <a href=\"https://www.macrumors.com/guide/netflix/\">Netflix</a>, <a href=\"https://www.macrumors.com/guide/apple-arcade/\">Apple Arcade</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/25/netflix-could-offer-apple-arcade-style-service/\">Netflix Considering Move into Gaming With Apple Arcade-Style Bundle</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/netflix-considering-move-into-gaming-with-apple-arcade-style-bundle.2297717/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=JtQCXsFlwSk:9G9pdAUa4CQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=JtQCXsFlwSk:9G9pdAUa4CQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/JtQCXsFlwSk\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"32fa85ab94f1852e301734b773a8f2d44e1c2c2d8e6d0d6947a2d95d135c4af2","category":"Apple"}