{"title":"421 An evaluation of Spanish-speaking animal caretakers attitudes towards piglet euthanasia in a large commercial swine production system in Southwestern U.S","link":"https://academic.oup.com/jas/article/102/Supplement_3/15/7757129?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Humane euthanasia techniques in the swine industry have long been a consideration among veterinarians and animal caretakers. The use of mechanical blunt force trauma (MBFT) with a non-penetrating captive bolt (NPCB) gun has become a novel means of humanely euthanizing suckling pigs. MBFT is intended to deliver a percussive blow on the frontal bone and is known to consistently generate immediate insensibility upon application. MBFT is reported to cause abrupt, tonic movements post-application. The tonic movements can be graphically challenging and distressful to animal caretakers leading to aversion to this method of euthanasia. These negative outcomes in combination with the lack of caretaker preparation/training utilizing MBFT can influence the ability of the caretaker to make timely euthanasia decisions, which can negatively impact pig welfare. Animal caretakers have reported emotional and mental limitations when performing MBFT euthanasia on-farm. Insufficient work has been done to understand how MBFT euthanasia and training programs can impact the perspective of animal caretakers on this method of euthanasia, particularly in the Spanish-speaking workforce. The present study explores a recent transition in a large vertically integrated swine production system in the United States from carbon dioxide (CO2) gas euthanasia to MBFT as the primary method of euthanasia in suckling piglets. The objective of this study was to identify the mental, emotional, and practical challenges of Spanish-speaking caretakers who participated in a formal training on conducting euthanasia using MBFT. A total of 257 animal caretakers participated in the survey. Logistic regression showed that knowledge of the Common Swine Industry Audit (CSIA) increased the likelihood of immediate euthanasia (3.09 times, <span>P</span> &lt; 0.003) and acceptance of euthanizing animals meeting criteria (3.17 times, <span>P</span> &lt; 0.008). Prior employment in meat processing (4.53 times, <span>P</span> &lt; 0.003) and the poultry/egg industry (4.06 times, <span>P</span> &lt; 0.028) increased the likelihood of performing euthanasia for piglets that met criteria. Males were more likely than females to feel comfortable with performing euthanasia (2.01 times, <span>P</span> &lt; 0.017). Previous experience in sow farms correlated with a preference for others identifying sick or injured piglets (2.01 times, <span>P</span> &lt; 0.024) and reluctance to euthanize (3.40 times, <span>P</span> &lt; 0.003). A Mann-Whitney U Test compared beliefs on CO2 (Group A; GA) vs. MBFT (Group B; GB) euthanasia. GA (n = 159) unanimously preferred CO2, differing significantly from Group B (n = 98; U = 5,841.50, <span>P</span> &lt;.001). Similarly, respondents aware of the CSIA (GA, n = 193) differed significantly from those unaware (GB, n = 64) in their approach to identifying and euthanizing piglets (U = 4,621.00, <span>P</span> &lt;.001). This study identifies the mental, emotional, and practical challenges faced by Spanish-speaking caretakers transitioning to MBFT euthanasia, highlighting the significance of training/support programs in enhancing welfare practices.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"32fb60c0d473f67948fb583e6fab77a30dc72bb7e062ff9ada2fdcb5d521b0e2","category":"Environment"}