{"title":"Multidecadal changes in coastal benthic species composition and ecosystem functioning occur independently of temperature‐driven community shifts","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17482?af=R","date":1724758471000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b029edf4-fb09-47d2-a152-c2e153c44504/gcb17482-toc-0001-m.png\" alt=\"Multidecadal changes in coastal benthic species composition and ecosystem functioning occur independently of temperature-driven community shifts\" />\n<p>Notably, increasing temperatures cause a reorganisation of species and their traits. Here, we study warming-related shifts by analysing a macroinvertebrate benthic dataset spanning 32 years. Our results highlight minimal changes in biodiversity metrics but significant positive trends in ecological functioning, specifically how species influence ecosystem properties via their traits. Yet, these trends are independent of temperature shifts since there was only a weak increase in the thermal preferences at the community level. While warming takes precedence in climate change studies, other direct factors that structure communities might be overlooked.</p>\n<br />\n<h2>Abstract</h2>\n<p>Rising global temperatures are often identified as the key driver impacting ecosystems and the services they provide by affecting biodiversity structure and function. A disproportionate amount of our understanding of biodiversity and function is from short-term experimental studies and static values of biodiversity indices, lacking the ability to monitor long-term trends and capture community dynamics. Here, we analyse a biennial dataset spanning 32 years of macroinvertebrate benthic communities and their functional response to increasing temperatures. We monitored changes in species' thermal affinities to examine warming-related shifts by selecting their mid-point global temperature distribution range and linking them to species' traits. We employed a novel weighted metric using Biological Trait Analysis (BTA) to gain better insights into the ecological potential of each species by incorporating species abundance and body size and selecting a subset of traits that represent five ecosystem functions: bioturbation activity, sediment stability, nutrient recycling and higher and lower trophic production. Using biodiversity indices (richness, Simpson's diversity and vulnerability) and functional indices (richness, Rao's Q and redundancy), the community structure showed no significant change over time with a narrow range of variation. However, we show shifts in species composition with warming and increases in the abundance of individuals, which altered ecosystem functioning positively and/or non-linearly. Yet, when higher taxonomic groupings than species were excluded from the analysis, there was only a weak increase in the measured change in community-weighted average thermal affinities, suggesting changes in ecosystem functions over time occur independently of temperature increase-related shifts in community composition. Other environmental factors driving species composition and abundance may be more important in these subtidal macrobenthic communities. This challenges the prevailing emphasis on temperature as the primary driver of ecological response to climate change and emphasises the necessity for a comprehensive understanding of the temporal dynamics of complex systems.</p>","author":"Phoebe Armitage, \nMichael T. Burrows, \nJames E. V. Rimmer, \nAndrew J. Blight, \nDavid M. Paterson","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"33002bb6dfb1be116a80961e66070d0ba4fe0b7619c1098b48a92262cdf559d8","category":"Environment"}