{"title":"‘This one hurts’ - A bitterly disappointed Team dsm-firmenich","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/this-one-hurts-a-bitterly-disappointed-team-dsm-firmenich","date":1690582276000,"content":"\n      <p><span>The mood outside the Team dsm-firmenich bus after stage six of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> was sombre. No rider spoke, and the only sound was the whir of turbo trainers as they warmed down in the small slithers of shade offered up by the shadow of the trees nearby. They rode statically in a long line, not facing one another, each with devastated looks on their faces and seemingly deeply lost in their own thoughts, beads of sweat still visible from the labours of the day.</span></p>\n<div></div>\n<p><span>Pfeiffer Georgi’s white national champion’s kit was stained with salt marks and muddied from the dust, a physical reminder of the effort it had taken to get here, painful proof of how much work she had put in over the past three hours of racing. The look on her face was a reflection of the fact that to her, to her entire team, that work culminated in nothing of note whatsoever.</span></p>\n<p><span>For some teams, a podium finish in a stage of the Tour de France Femmes would have been enough to be happy, but for DSM, winning is everything. Charlotte Kool crossed the line second on stage six behind Emma Norsgaard of Movistar who <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/this-one-hurts-a-bitterly-disappointed-team-dsm-firmenich\">stayed clear from the breakaway</a> of the day, and the sense of heartbreak in the team was so raw that even the boldest of journalists approached the riders tentatively. </span></p>\n<p><span>“This is actually a nightmare,” Kool said after the stage. “Winning the sprint so close to catching the breakaway is an absolute nightmare. I think the chase was pretty good, a lot of teams helped but those riding in front were strong today. Pfeiffer [Georgi] did amazing positioning and I had everything under control but what does it matter? It’s second.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1576572475_1024x1024.jpg?v=1690582233\" alt /><em><span>Image: Getty/Tim de Waele</span></em></span></p>\n<p><span>When Lorena Wiebes, Kool’s main rival in the sprints, abandoned the Tour de France Femmes on stage five, it was a loss for the race, but an undeniable opening for the Team dsm rider to get the biggest win of her career. That stage, however, ended up being one for the general classification riders and Kool was unable to get over the punchy climbs with the front group. Today was her next chance at the victory she wholeheartedly believed she had the ability to secure. Coming so close to the win made second place a bitter pill to swallow for the entire team.</span></p>\n<p><span>As I approached Georgi under the canopy sticking out of the dismal Team dsm-firmenich bus, she awoke from her own thoughts, and begrudgingly answered my questions. “It’s pretty disappointing, we’ve been chasing the stage win all week, we had a bit of a problem with the radio to hear the time gaps today and in the end it was too late,” she said. \"It was really not what we wanted as Charlotte is in great form and has shown she can get over the climbs to sprint. This one hurts.”</span></p>\n<p><span>As the final lead-out rider for Kool for the past season, the 22-year-old seems to feel the loss of victories almost as fervently as the sprinter herself. Georgi sees the crash that occurred in the final kilometre of stage six as a key obstacle to not catching Norsgaard from the breakaway today. “We saw on VeloViewer already that it was pretty technical and we got the mechanics to drive the last 6km to give us a bit more information. It was just unlucky that there was a crash on that corner,” she explained. “I was just behind it and we were taking it at speed and they just hit the barriers.”</span></p>\n<p><span>As the conversation concludes – I’m sure much to Georgi’s relief – she talks about the opportunities that the young Team dsm squad has with Juliette Labous in the mountains and the time trial on the final two stages of the Tour de France Femmes. While the British riders’s ability to remain focused on the next goals as she still processes the blow of the stage she’s just finished is impressive, both her and Kool’s answers make it clear that this loss is going to take some time for the team to get over.</span></p>\n<p><em><span>Cover image: ASO/Thomas Maheux</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3300cdc9be642a733a079f77d5c8ae74e72146c986fc513a7941049315962cde","category":"Cycling"}