{"title":"Vuelta a España 2023 stage four preview - the first opportunity for the sprinters","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2023-stage-four-preview","date":1693238371000,"content":"\n      <p><b>Distance:</b> 185km<b><br /></b><b>Start location: </b>Andorra la Vella. <b><br /></b><b>Finish location: </b>Tarragona<b><br /></b><b>Start time:</b> 13:20 CEST<b><br /></b><b>Finish time (approx): </b>17:30 CEST</p>\n<p>Having climbed to of the nation’s summits at the end of stage three, the peloton will only ride a single kilometre in Andorra before crossing the border back into Spain; but then again there isn’t much more to explore of the microstate that, with a land area of only 468km squared, is the smallest sovereign state on mainland Europe save for Vatican City, Monaco, San Marino and Liechtenstein. It’s an oddity in Europe, existing as a co-principality shared between the French head of state and Spanish bishop of Urgell ever since 1278, and only became a parliamentary democracy as recently as 1993. And, as a tax haven that attracts millions of tourists every year with its ski resorts and duty-free shopping, it’s very wealthy, which the riders will have noticed ascending and descending the well-maintained roads yesterday. </p>\n<p>The border might be crossed, but the language the riders hear their names being encouraged in from the roadside will remain the same, as the rest of stage four transverses southwards through the Catalan-speaking region of Spain. They’ll eventually end up back on the Mediterranean coast for a finish in the port city of Tarragona, the second biggest city in Catalonia after Barcelona, known for its Roman ruins including an Amphitheatre, Roman Circus and Praetorium Tower. In the outskirts the riders will also pass through Valls, a small city which was the origin of the tradition ‘Castells’, festivals in which large, elaborate structures of dozens of people clambering atop each other are erected to assemble the biggest ‘human tower’. This may look a world away from what the cyclists racing in the peloton are doing, but require similar levels of synchronicity and cohesion that the sprinters’ teams preparing their lead out trains as they approach the finish in Tarragona.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_four.png?v=1691573404\" alt /></p>\n<p><i>Stage four profile sourced via the Vuelta website</i></p>\n<p>The sprinters’ teams should expect to be called into action, as a bunch finish is the most likely outcome. That was the case the last time the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> visited Tarragona in 2017 when Matteo Trentin came out on top on what was also the fourth stage of that edition, and that also featured the same climb, Alto de Belltall. On that occasion the shallow 3.7% gradients of the 9.3km was not deemed hard enough by anyone in the peloton to make an attack, while the day’s break splintered on it, before being caught well in time before the finish.</p>\n<p>Yet this stage might play out differently due to the addition of the category three Coll de Lilla, tackled immediately after the riders are done descending the former climb. It’s steeper, with a gradient of 5.2% over 4.9km, and is crested with just 30km still to ride, which will make the race more difficult to control for the sprinters’ teams. Plenty of stage-hunters will now have lost enough time on GC to be free to escape up the road, and if a quality enough breakaway group can be established either at the start of the day or on these climbs, they stand a decent chance of surviving.</p>\n<h3>Contenders</h3>\n<p>There are only a handful of fast finishes for the sprinters of this Grand Tour, so those looking for stage wins will need to make the most of this opportunity. However, if those with a fast finish are looking to take the stage, they need to make sure no opportunistic riders make a break for it on the climbs towards the end of the stage. <br /><br />Australian rider <strong>Kaden Groves</strong> (Alpecin-Deceuninck) will be a front-runner for this stage. He’s one of the best sprinters on this year’s start list and an excellent climber, so the two category three climbs in the lead-up to the finish will be easy for him to handle. He came second in stage two behind Andreas Kron, who took the stage, so he will be keen to secure a stage victory in these flatter stages. <br /><br />But his main rival will be <strong>Bryan Coquard</strong> (Cofidis), another rider boasting a fast finish. The Frenchman had a strong Tour de France last month, giving him extra confidence to go for stage wins in this Vuelta. He doesn’t have as strong legs in the mountains as Groves, but if he and his team can keep with Alpecin until the end, then Coquard could take the victory. <br /><br />UAE Team Emirates could choose to send <strong>Juan Sebastián Molano</strong> to victory. He is the team’s best bet if it comes down to a bunch sprint, and we recently saw him take a stage win in the opening of the Vuelta a Burgos in a similar fashion, where he pipped Movistar rider <strong>Iván García Cortina</strong> to take the win. Cortina will be hoping to beat the UAE Team Emirates rider this time round, especially with the stakes being even higher. <br /><br />After Team DSM-Firmenich took the team time trial in stage one, they’ll be hoping to celebrate victory once again. <strong>Alberto Dainese</strong> could be a rider with the potential to take this stage for the Dutch team. He won a stage in the Giro d’Italia earlier this season, beating pure-sprinter Jonathan Milan to victory. He perhaps lacks the climbing abilities that some of his rivals boast, but if he can be delivered to the front at the right time, he’ll be one to watch. <br /><br />Other riders who could be in contention for this stage are <strong>Marijn van den Berg</strong> (EF Education-EasyPost), <strong>Milan Menten</strong> (Lotto Dtsny),<strong> </strong>or<strong> Edward Theuns</strong> (Lidl-Trek).</p>\n<h3>Prediction</h3>\n<p>We think <strong>Kaden Groves</strong> will take the win for Alpecin-Deceuninck. </p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3304d175fb884d910808994483a6897666ee03d4dc4c1df985ceb67a8015c487","category":"Cycling"}