{"title":"Itzulia Basque Country 2023 preview - route, predictions, and contenders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/itzulia-basque-country-2023-preview-route-predictions-and-contenders","date":1680460794000,"content":"\n      \n<p>Starting the day after the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a> and finishing the day before <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a>, the 15th leg of the 2023 WorldTour takes place in another of cycling’s most cherished heartlands: the Basque Country.</p>\n<p>With the Grand Départ of this year’s <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> set to be hosted by the Basque Country, the region will be given special attention this year in the cycling world. Cycling fans here are among the most passionate in the sport, and are a comfortingly familiar sight on the roadside, wearing the orange colour associated with the region, and brandishing the distinctive Ikurriña flag. Their home race, Itzulia Basque Country (formerly known as the Tour of the Basque Country), is an event with great heritage dating back to 1924, and has its own unique local identity, perhaps best epitomised by the traditional <em>txapela</em> beret that's awarded to the overall winner.</p>\n<p><span>Whereas the Classics of Flanders are characterised by cobblestones and bergs, the terrain of the Basque Country poses an altogether different challenge. The most distinguishing features are the climbs, which come thick and fast in the densely hilly region, which offers barely a moment of respite throughout the whole week with its constantly undulating terrain. We’re a bit too far west for the really big Pyrenean summits, but the sheer number of hills make Itzulia Basque Country one of the most testing stage races of the season. </span></p>\n<h3><span>Route</span></h3>\n<p><span>For the 62nd edition of Itzulia Basque Country, the organisers have mixed things up with some changes to the usual formula. There isn’t a single mountain top finish, with the race’s trademark climb of Alto de Arrate left out, and the usual time trial has also been dropped from the program. Still, the inescapable hills and rolling roads of the landscape means the race looks set to favour, as usual, the climbers and puncheurs. </span></p>\n<p><span>Bunch sprints tend to be a rarity at this race due to the terrain, and if there is to be one this year, then the opening stage finishing in Labastida looks like the most likely. It will be far from straightforward, however: the roads undulate constantly throughout the day, even if there is only one official climb, and much of the final two kilometres are readily uphill, making it a tough ask for the pure sprinters.</span></p>\n<p><span>The following stage to Leitza is, at 194km, the longest of the race, and includes a lengthy 11.1km climb to Arkiskil towards the finish, although the gentleness of the gradient (averaging 3%) and downhill stretch to the finish will limit its impact.</span></p>\n<p><span>Stage three is where the GC race is likely to really take off. The final 15km of this hilly stage is especially brutal, with four short climbs crammed into them in quick succession, each one featuring double-digit ramps. The riders may only climb for one kilometre to the finish in </span><span>Villabona, but its average gradient of 9.4%, with a stretch of 26%(!) near the top, ensures there will be significant time gaps between the GC favourites.</span></p>\n<p><span>The major climb towards the end of stage four, La Asturiana, may not be as steep, with only one section exceeding 10%, but it’s still long (7.4km) and tough enough (6.3% average) to cause gaps, and encourage attacks from anyone who fancies their chances of maintaining them during the 15km descent to the finish in Santurtzi. </span></p>\n<p><span>Given the lack of any mountain top finishes, the terrain of the penultimate stage to Etxano could prove deceive. The riders will gain over 3,000 metres of elevation throughout the constantly undulating terrain, and the race could split into pieces at any moment during its four classified climbs and countless unclassified rises — especially during the last 15km, which, in a similar manner to the finish of stage three, features three successive steep ramps.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/13stg07_peloton_gaudu_paris-nice_2023_f4f0e55c-137c-40a0-949b-8db90b96c645.jpg?v=1680460681\" alt=\"David Gaudu Paris-Nice\" /></span></p>\n<p><em>David Gaudu could be in line for a first stage race overall win at Itzulia Basque Country (James Startt)</em></p>\n<p><span>The final stage, however, is a more conventional GC day, with a series of longer, higher climbs. Having not faced anything ranked higher than category two prior to this stage, today three category one climbs are on the menu. But all of them occur inside the first 111km of this 138km long stage, making this another unpredictable day that will require thoughtful tactics about when best to make a move. </span></p>\n<h3><span>Contenders</span></h3>\n<p><span>With neither Tadej Pogačar (UAE Team Emirates), Primož Roglič (Jumbo-Visma) or Remco Evenepoel (Soudal - Quick-Step) taking part, Itzulia Basque Country provides a chance for all the riders who have kept missing out to them to win a first WorldTour title of the season.</span></p>\n<p>Jonas Vingegaard (Jumbo-Visma) and David Gaudu (Groupama-FDJ) were the best of the rest behind a rampaging Pogačar at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice\">Paris-Nice</a>, and the form guide therefore points to them. As Tour de France champion, Vingegaard is the biggest name at the race and will be seen as the man to beat, and also has a good record at this race having placed second here in 2021. But Gaudu was stronger than him at Paris-Nice (placing second with Vingegaard in third), and has a great chance of winning it he can carry that form into the Basque Country.</p>\n<p><span>Mikel Landa </span><span>is another rider to have been denied by Pogačar this year, finishing second to him at Ruta del Sol, and will line-up alongside fellow Basque </span><span>Pello Bilbao</span><span> for Bahrain-Victorious. As local riders they’ll be motivated to do well, especially as both have previously made the top five overall here but never won.</span></p>\n<p><span>Bora-Hansgrohe are another strong team with </span><span>Sergio Higuita</span><span> and </span><span>Emanuel Buchmann</span><span>, as are EF Education-EasyPost with </span><span>Richard Carapaz</span><span>, </span><span>Rigoberto Urán</span><span> and </span><span>Esteban Chaves</span><span>, though all these riders been short of their best form so far this season. UAE Team Emirates, meanwhile, will hope for more team cohesion between </span><span>Brandon McNulty </span><span>and </span><span>Marc Soler </span><span>after the latter’s unsavoury scenes with João Almeida at Volta a Catalunya </span></p>\n<p>At least on paper, Ineos Grenadiers boast the strongest line-up, but there are doubts too about their riders’ form. Egan Bernal is still on the long road back to recovery and has yet to complete a race this season, Carlos Rodríguez is racing for the first time since crashing out of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a>, and a 25th-place finish at Paris-Nice for Daniel Martínez was a long way off the form that saw the Colombian win Itzulia Basque Country 12 months ago.</p>\n<p>In much better form is Simon Yates (BikeExchange-Jayco), who was fourth at Paris-Nice and second at the Tour Down Under, while Enric Mas has looked sharper following sixth and fifth place finishes respectively at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico\">Tirreno-Adriatico</a> and Ruta del Sol, and will have a Movistar team built entirely around him. </p>\n<p><span>Volta a la Comunitat winner </span><span>Rui Costa </span><span>(Intermarché-Circus-Wanty) has also started the season on fire, indicating that he might be capable of rolling back the years and challenging for the GC once again, while his fellow veteran </span><span>Ion Izagirre </span><span>(Cofidis) can never be discounted at this race having finished on the podium in four of the last six editions.  </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-04871.jpg?v=1680460557\" alt=\"Marc Hirschi\" /></span></p>\n<p><em>Marc Hirschi is one of a host of puncheurs that will be looking for stage victories in the Basque Country (Zac Williams/SWPix)</em></p>\n<p><span>As for stage hunters, </span><span>Ethan Hayter </span><span>(Ineos Grenadiers), </span><span>Quinten Hermans</span><span> (Alpecin-Deceuninck), </span><span>Ide Schelling</span><span> (Bora-Hansgrohe), </span><span>Andrea Vendrame</span><span> (AG2R Citroën) </span><span>Alex Aranburu</span><span> (Movistar), </span><span>Andrea Bagioli </span><span>(Soudal - Quick-Step) and </span><span>Marc Hirschi</span><span> (UAE Team Emirates) all have enough of an uphill punch and finishing kick to be in contention </span></p>\n<h3><span>Predictions</span></h3>\n<p><span>The absence of the stars of the season so far makes Itzulia Basque Country a real opportunity for other riders to make a statement, and it’s one that Jonas Vingegaard will be eager to make having lost to Pogačar so thoroughly at Paris-Nice.</span></p>\n<p><span>But that same race revealed a </span><span>David Gaudu </span><span>who has reached a new level, and one that suggests the 26-year-old is ready to at last really blossom and come of age. With no time trial and terrain that should suit his punchy attributes, we’re predicting the Frenchman to achieve a belated first ever stage race overall victory. </span></p>\n<p><em>Cover image by James Startt</em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3316c6de6299bc99037ebad36d8db83bf2725790adce7286420e8060222db8e7","category":"Cycling"}