{"title":"A Method for Optimizing Production Layers Regroup Based on Genetic Algorithm","link":"https://www.preprints.org/manuscript/202408.0698/v1","date":1723189478000,"content":"As waterflooding multi-layer reservoirs get into the high-water-cut stage, inter-layer conflicts become increasingly serious, leading to a worsening development effect over time. Production layers regroup is an effective approach for resolving inter-layer conflicts and improving waterflooding efficiency. At the current stage, there are limitations for most of the methods of production layers regroup. This article proposes a smart method for optimizing the layer regroup plan based on genetic algorithm. Comprehensively considering various factors that affect the regroup of layers, based on the combination principle of \"smaller intra-group variance and larger inter-group variance of each influencing factor are expected \", genetic algorithm is used to calculate the fitness value of the initial combination schemes, the advantageous schemes with higher fitness values are selected as the basis of the next generation. Then crossover and mutation operations are performed to those advantageous schemes to generate new schemes. Through continuous selection and evolution, until the global optimal solution with the highest fitness value is found, the optimal combination scheme is determined. Comparative analysis with numerical simulation results demonstrates the reliability of this intelligent method, with an increased oil recovery of 4.34% for the sample reservoir. Unlike selecting a preferable plan from a limited number of predefined combination schemes, this method is an automatic optimization to solve the optimal solution of the problem. It improves both efficiency and accuracy as compared to conventional reservoir engineering methods, numerical simulation methods and most of the mathematical methods, thus could provide effective guidance for EOR strategies of waterflooding reservoirs in high-water-cut stage.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"331e725e9e23c08295432f2117bb69ab5999eeb8d155b287b382f5c4ed8f73b9","category":"Interdisciplinary"}