{"title":"More Than $10 Billion Deposited in Apple Card Savings Accounts","link":"https://www.macrumors.com/2023/08/02/apple-card-savings-10-billion-in-deposits/","date":1690999617000,"content":"<a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a> holders have deposited more than $10 billion in ‌Apple Card‌ Savings accounts that are provided by Goldman Sachs, Apple <a href=\"https://www.apple.com/newsroom/2023/08/apple-cards-savings-account-by-goldman-sachs-sees-over-10-billion-usd-in-deposits/\">announced today</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/apple-card-savings-account-16x9.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThe Savings accounts first launched in April, so that milestone comes at the four month mark. Apple says that 97 percent of Savings customers have opted into having their ‌Apple Card‌ Daily Cash automatically deposited into the account, which offers a 4.15 APY.\r<br />\n<blockquote>\"With each of the financial products we've introduced, we've sought to reinvent the category with our users' financial health in mind. That was our goal with the launch of Apple Card four years ago, and it remained our guiding principle with the launch of Savings,\" said Jennifer Bailey, Apple's vice president of Apple Pay and Apple Wallet. \"With no fees, no minimum deposits, and no minimum balance requirements, Savings provides an easy way for users to save money every day, and we're thrilled to see the excellent reception from customers both new and existing.\"</blockquote>\r<br />\nIn a statement, Goldman Sachs Head of Enterprise Partnerships said that the company is \"very pleased\" with the Savings account success.\r<br />\n\r<br />\n‌Apple Card‌ continues to be limited to <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users in the United States, which means the Apple Savings account is only available in the U.S. Apple's announcement comes amid reports that its relationship with Goldman Sachs is on the rocks. Goldman Sachs is allegedly looking to <a href=\"https://www.macrumors.com/2023/07/25/apple-goldman-sachs-apple-card-issues/\">get out of its partnership with Apple</a> as it aims to exit the consumer banking business.\r<br />\n\r<br />\nApple and Goldman Sachs have worked together on the ‌Apple Card‌ since 2019, but Goldman Sachs wants to abandon the deal because it is not making enough money and it has had trouble dealing with customer service issues. The Savings account in particular soured the relationship between the two companies because early customers <a href=\"https://www.macrumors.com/2023/06/01/apple-savings-money-withdrawal-issues/\">saw long wait times</a> when attempting to withdraw money.\r<br />\n\r<br />\nGoldman Sachs is said to be aiming to have American Express or another company take over its deal with Apple, but the terms are not favorable because the ‌Apple Card‌ lacks fees, and other companies do not find the deal appealing.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/02/apple-card-savings-10-billion-in-deposits/\">More Than $10 Billion Deposited in Apple Card Savings Accounts</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/more-than-10-billion-deposited-in-apple-card-savings-accounts.2397591/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"33209385392f16095e87d069e78d9696d8deaadfde656ae2bcee1e2c509cccad","category":"Apple"}