{"title":"Decoupled cycling of particulate cadmium and phosphorus in the subtropical Northwest Pacific","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12635?af=R","date":1723180159000,"content":"<h2>Abstract</h2>\n<p>We examined the spatial variation in size-fractionated (0.8–51 and &gt; 51 <i>μ</i>m) particulate cadmium (Cd) and phosphorus (P) based on a large dataset collected during a GEOTRACES Section cruise (GP09) in the North Pacific Subtropical Gyre (NPSG) to better understand the interrelationship between Cd and P biogeochemical cycles. Concentrations of particulate Cd (0.06–2.15 pmol L<sup>−1</sup>) and P (0.33–10.19 nmol L<sup>−1</sup>) showed an initial increase with depth followed by a decrease, and were among the lowest observed in the global ocean. Bulk particulate Cd : P ratios in the euphotic zone, indicative of phytoplankton Cd assimilation, showed strong geographic variability averaging 0.05 ± 0.02 within the NPSG interior vs. 0.14 ± 0.04 pmol nmol<sup>−1</sup> at the southern boundary. Cadmium to P remineralization ratio in the mesopelagic zone had a roughly similar stoichiometry as what was produced in the euphotic zone, being ~ 0.05 ± 0.01 in the NPSG interior vs. 0.21 ± 0.04 pmol nmol<sup>−1</sup> at the southern boundary. Cd–P decoupling was reflected in the elements' vertical distribution, showing unsynchronized changes through the water column, consistent with Cd–P differential remineralization resulting from multiple Cd and P pools. The Cd–P relationship also differed between small and large particles, suggesting differences in Cd assimilation among phytoplankton assemblages as well as particle dynamic processes. Our results highlight complex processes fractionating Cd from P in the oligotrophic ocean and complicate the use of Cd as a palaeo-phosphate proxy.</p>","author":"Kan Zhang, \nKuanbo Zhou, \nYihua Cai, \nZhongwei Yuan, \nYaojin Chen, \nFeipeng Xu, \nXin Liu, \nZhimian Cao, \nMinhan Dai","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"3323b4d561a47eb4c8ba26b4e8a8d2f51e39a94e5fe634286022a48bf578ad6e","category":"Environment"}