{"title":"Supreme Court considers limits on White House contacts with social media","link":"https://arstechnica.com/?p=1970846","date":1695663637000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/getty-supreme-court-800x451.jpg\" alt=\"The United States Supreme Court building seen during daytime.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/getty-supreme-court.jpg\">Enlarge</a> <span>/</span> The Supreme Court. (credit: Getty Images | Douglas Rissing)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Supreme Court on Friday extended a stay of a lower-court order that would limit the Biden administration's contacts with social media firms, giving justices a few more days to consider whether to block the ruling entirely. The court could rule by the middle of this week on the Biden administration motion in a case in which the states of Missouri and Louisiana allege that speech related to COVID-19 and other topics was illegally suppressed at the behest of government officials.</p>\n<p>A stay issued September 14 was scheduled to expire on Friday, but Justice Samuel Alito <a href=\"https://www.scotusblog.com/wp-content/uploads/2023/09/23A243-Order-2.pdf\">ordered</a> that it be extended until Wednesday, September 27, at 11:59 pm ET. Alito is the justice assigned to the 5th Circuit, the circuit in which an appeals court ruled that the White House and FBI likely violated the First Amendment by coercing social media platforms into moderating content and changing their moderation policies.</p>\n<p>The 5th Circuit appeals court ruling wasn't a total loss for the Biden administration. Appeals court judges <a href=\"https://arstechnica.com/tech-policy/2023/09/order-limiting-biden-admin-contacts-with-social-networks-is-mostly-overturned/\">threw out</a> the majority of a district judge's preliminary injunction that ordered the Biden administration to halt a wide range of communications with social media companies.</p></div><p><a href=\"https://arstechnica.com/?p=1970846#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1970846&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3332a23c5fa5987b22098dd30b297042a7c3ae64315d8d9594f7e69ba8bae5ab","category":"Tech"}