{"title":"Cav is back: What can we expect from his Tour de France?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/mark-cavendish-is-back-at-the-tour-de-france-so-what-can-we-expect-from-the-manxman","date":1624552666000,"content":"\n      <p><span>Surprise and excitement radiated through the cycling community when it was announced that Mark Cavendish would return to the Tour de France this year, filling in for defending Green jersey winner Sam Bennett, who is suffering from injury. After Patrick Lefevere’s comments about Cavendish not wanting to ride the Tour on his current salary, the decision to put him in </span><span>Deceuninck</span> Quick-Step’s Tour selection was even more unexpected. Apparently to Cavendish himself as well as the rest of us. </p>\n<div></div> \n<p><span>“I’d be lying if I said it wasn’t a surprise,” he explained in the Quick-Step press conference yesterday. He went on to talk about how he’d ensured he was in good condition regardless, preparing for the Tour just in case he had a late call up.</span></p>\n<p><span>“Basically we’re professionals, we’ve got a job to do. There's 30 guys who ride bikes for this team, the Tour de France and the Classics are the biggest objectives of the year and it’s up to the whole team to be able to step in at any moment and do what’s right,” he said.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Related: Tour de France 2021 Preview</a></em></strong></p>\n<p><span>A 30-time stage winner in the Tour, in most teams, Cavendish’s selection for the race would be a given. However, the troubles he’s had in recent seasons with Epstein-Barr virus have made his form questionable at times, making his comeback, and selection for Quick-Step even more formidable. “It’s already more than a dream to be here, not just to be at the Tour but to be here with </span><span>Deceuninck</span> Quick-Step,” he explained. “80% of the peloton dreams to get a start at the Tour with this team.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-119755424_aac8f5ee-03a3-4522-bc18-07d4b9edec44_1024x1024.jpg?v=1624523852\" /></p>\n<p><em><span>Photo: Getty Images</span></em></p>\n<p><span>Looking back at his long history with the race, Mark Cavendish has never entered the Tour like he is going to this year: as an underdog who isn’t necessarily expected to win, and that could make all the difference for the sprinter.</span></p>\n<p><span>“It’s not like I’m coming here as with previous teams when I’m left to my own devices and have to try and shoulder the pressure, I don’t have to do that here at all,” Cavendish said. He’s joined by World Champion Julian Alaphilippe and Tour of Flanders winner Kasper Asgreen. These riders have palmares that match Cavendish’s, and ambitions of their own to fulfil. This could be exactly what the Manxman needs to add to his list of stage wins: the tension and stress he’s felt in previous years taken down just a notch.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-manx-missile-relaunched-why-cycling-needed-a-cav-win\">Related: The Manx Missile Relaunched: why cycling needed another Cav win</a></em></strong></p>\n<p><span>Old interviews with a younger Mark Cavendish, with his brawly demeanour and sometimes spiky responses to journalists, might lead to the belief that he's a rider who loves the spotlight, and would flourish in a team where the entire focus is on him. It’s not like that in Quick-Step, though, and this seems to be working. In the Baloise Belgium Tour, Cavendish took a victory against the likes of Tim Merlier, Caleb Ewan, Nacer Bouhanni and Pascal Ackermann: a world-class sprinting field.</span></p>\n\n<p><span>Results like this prove that the Manxman is thriving in the Belgian team. Not being number one perhaps gives him more to fight for, more to prove and more motivation. “I don’t think anyone’s expecting so much of me, so I can’t fall from such a great height,” Cavendish said, discussing his ambitions for this year’s Tour.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1232266139_c5d2f1fa-631e-42ef-8917-11568ca0d3a2_1024x1024.jpg?v=1624524061\" /></span></p>\n<p><em><span>Photo: Getty Images</span></em></p>\n<p>This laid-back approach might be exactly what he needs to win on the French roads once more. He’s quick to dampen any questions about equalling Eddy Merckx’s record for the most number of stage wins and vehemently denies that he’s even thinking about it. However, it really does seem like that elusive number of 34 stage wins is within touching distance for Mark Cavendish, and if there’s any team that will help him reach it before he retires, it’s the Wolfpack.</p>\n<p><span>Following his impressive win in Belgium, he explained that he’d never had a chance to be led out by Michael Mørkøv who normally goes to races with Sam Bennett. Cavendish praises the Danish rider’s talent for leadouts: “I’ve only done two races with him but he just gets the job done. He always studies the race, the course and the positioning, he’s just a professional,” he explains. Mørkøv’s wheel will be the one which Cavendish follows around France this year, and it looks like a perfect pairing, especially with the trust the Manx rider clearly has in his colleague.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-manx-missile-relaunched-why-cycling-needed-a-cav-win\">Related: Tour de France Teams 2021</a></em></strong></p>\n<p><span>Perhaps Cavendish won’t win a stage this year, it’s entirely possible that his form won’t show up and things will go wrong for him. In truth, when we think back to those tearful race days at the end of last year, when he was questioning if his career would continue — a ride in the Quick-Step team at the Tour de France is a win in itself.</span></p>\n<p><span>But, if the legs do show up, and Cavendish is carrying that superb form he showed on the Flemish roads a few weeks ago, we predict that he could potentially be coming home with multiple victories, and maybe even spend a few days in Green. It’s a tall order, but if there’s one thing we’ve learnt from this season, it’s that Mark Cavendish can never be counted out.</span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"33331b5953735e858b8d9b6d5815acd4f7aa38a21970adb11a176d950ec367e8","category":"Cycling"}