{"title":"Type 2 diabetes severity in the workforce: An occupational sector analysis using German claims data","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309725","date":1727445600000,"content":"<p>by Batoul Safieddine, Julia Grasshoff, Stefanie Sperlich, Jelena Epping, Siegfried Geyer, Johannes Beller</p>\r\nBackground <p>Individuals of working age spend a significant amount of time at the workplace making it an important context for disease prevention and management. The temporal development and prevalence of T2D have been shown to differ in the working population based on gender, age group and occupational sector regardless of socioeconomic status. Given potential differences in risk factors associated with different work environments, this study aims to define vulnerable occupational groups by examining T2D severity and its trends in working men and women with T2D of two age groups and among nine occupational sectors.</p> Methods <p>The study is based on claims data of the statutory health insurance provider AOKN. The study population consisted of all insured working individuals with T2D. T2D severity was measured using the adapted diabetes complications severity index—complication count (DCSI-CC). Mean DCSI-CC scores were calculated over four time periods between 2012 and 2019 for men and women of the age groups 18–45 and 46+ years and among nine occupational sectors. Trends of DCSI-CC were investigated using ordinal logistic regression analyses to examine the effect of time-period on the odds of having higher DCSI scores.</p> Results <p>Overall, there was a significant rise in T2D severity over time in working men and women of the older age group. Moreover, the study displayed occupational sector differences in T2D severity and its trends. Over all, working men of all sectors had higher DCSI-CC scores compared to working women. Individuals working in the sector “Transport, logistics, protection and security” and “Construction, architecture, measuring and building technology” had higher T2D severity, while those working in the “Health sector, social work, teaching &amp; education” had relatively lower T2D severity. There was a gender-specific significant increase over time in T2D severity in the above-mentioned occupational sectors.</p> Conclusion <p>The study displayed gender, age group and occupational sector differences in T2D severity and its trends. Working individuals could thus benefit from personalized prevention interventions that consider occupational contexts. As a next step, examining T2D trends and severity in specific occupations within the vulnerable occupational sectors is needed.</p>","author":"Batoul Safieddine","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3333cf1c75a1579ec17f609c76d692957993fed0fce65d3a67ec48a5efc73759","category":"Interdisciplinary"}