{"title":"Relevance of Mediterranean diet as a nutritional strategy in diminishing COVID-19 risk: A systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301564","date":1724248800000,"content":"<p>by Ceria Halim, Miranda Howen, Athirah Amirah Nabilah binti Fitrisubroto, Timotius Pratama, Indah Ramadhani Harahap, Lacman Jaya Ganesh, Andre Marolop Pangihutan Siahaan</p>\r\nBackground <p>Mediterranean Diet has been reported to possess immunomodulatory and anti-inflammatory properties. These properties are closely associated with the immunopathogenesis of COVID-19.</p> Objective <p>The present systematic review aimed to determine the association between Mediterranean Diet and COVID-19, COVID-19 symptoms, and COVID-19 severity.</p> Methods <p>The protocol for this systematic review was registered in International Prospective Register of Systematic Reviews (PROSPERO) with identification number CRD42023451794. The literature search was conducted through Pubmed, Proquest, and Google Scholar on August 2023. The inclusion criteria were studies with a population of human subjects, reported the association between Mediterranean diet adherence with risk of COVID-19 infection, COVID-19 symptoms, or COVID-19 severity, and full text must be available in English. The exclusion criteria were reviews, editorials, letters, replies, systematic reviews, meta-analyses, studies on animals, and duplicates. Risk of bias in included studies was assessed using Newcastle Ottawa Scale (NOS). Data was synthesized narratively. Each study was compared and a structured summary was developed.</p> Results <p>After selection process, 6 articles were included, with a sample size of 55,489 patients. All studies were observational studies and assessed Mediterranean diet adherence using food frequency questionnaires (FFQ), with scoring system varied between each study. Four studies found a significant correlation between increased adherence to Mediterranean Diet and reduced COVID-19 risk, while one study indicated non-significant association. One study reported a significant association between higher adherence to Mediterranean Diet and COVID-19 symptoms, but three studies reported non-significant association. One study found that individuals with higher adherence to Mediterranean Diet had reduced likelihood of developing severe COVID-19, however, two studies yielded inconclusive findings.</p> Limitations <p>All studies used self-administrated food frequency questionnaires (FFQs), which were prone to biased responses, such as recall and estimation bias.</p> Discussion <p>Lower trends of odds ratios (ORs) were consistently observed in higher Mediterranean diet adherence. In every outcome of the included studies, ORs ranged between 0.06–0.992, however, differing levels of significance were reported in each outcome.</p> Conclusion <p>Overall analyses suggest that high adherence to Mediterranean Diet is a protective factor against COVID-19, with unclear benefits against COVID-19 symptoms and severity.</p>","author":"Ceria Halim","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"33335ccb02e92e4927712fce1d8d5dc10f3b926108b150508be51866d90927fd","category":"Interdisciplinary"}