{"title":"iPhone 15 Pro's Thinner Bezels and Manufacturing Issue: What to Know","link":"https://www.macrumors.com/2023/07/28/iphone-15-pros-thinner-bezels-issue/","date":1690564857000,"content":"Apple's upcoming iPhone 15 Pro and iPhone 15 Pro Max are rumored to feature thinner bezels around the display compared to the current models, but this change has reportedly led to a manufacturing issue ahead of the devices launching.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/unbox-therapy-15-pro-max-bezels.jpg\" alt width=\"2788\" height=\"1486\" /><div><em>iPhone 15 Pro Max replica (left) vs. iPhone 14 Pro Max (right)</em></div>\r<br />\nBelow, we recap what has been reported about the manufacturing issue and what impact it might have on the iPhone 15 Pro launch later this year.\r<br />\n\r<br />\n<h2>Thinner Bezels</h2>\r<br />\nMultiple leakers have shared <a href=\"https://www.macrumors.com/2023/03/05/iphone-15-pro-front-glass-leak/\">images and videos</a> of alleged front glass panels for the iPhone 15 Pro models, and these panels appear to have considerably thinner bezels around the display compared to iPhone 14 Pro models. The bezels are expected to have a <a href=\"https://www.macrumors.com/2023/01/21/iphone-15-pro-ultra-thin-curved-bezels/\">slightly curved design</a>, and the Pro Max model could have the <a href=\"https://www.macrumors.com/2023/03/17/iphone-15-pro-max-thinnest-bezels-ever/\">thinnest bezels on any smartphone ever</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/iPhone-15-Pro-Front-Glass-Panel-Leak.jpg\" alt width=\"1600\" height=\"900\" /><div><em>iPhone 14 Pro front glass (left) vs. alleged iPhone 15 Pro front glass (right) via Bilibili</em></div>\r<br />\nYouTube channel Unbox Therapy provided a <a href=\"https://www.macrumors.com/2023/05/08/iphone-15-pro-max-ultra-thin-bezels/\">side-by-side comparison</a> of the bezels on an unofficial iPhone 15 Pro Max dummy model and the iPhone 14 Pro Max.\r<br />\n\r<br />\nWhile most rumors have claimed only the Pro models will have a bezel reduction this year, a previously-accurate leaker known as Ice Universe <a href=\"https://twitter.com/UniverseIce/status/1680196595231645697\">shared an image</a> showing that the iPhone 15 and iPhone 15 Plus might have slightly thinner bezels as well.\r<br />\n\r<br />\n<h2>Manufacturing Issue</h2>\r<br />\nLast week, <em>The Information</em>'s Wayne Ma reported that Apple suppliers were facing challenges assembling iPhone 15 Pro and iPhone 15 Pro Max displays with thinner bezels, and he said the issue <a href=\"https://www.macrumors.com/2023/07/20/iphone-15-pro-display-manufacturing-issues/\">could lead to a supply shortage</a> when the devices launch in September. He said the issue was more pronounced with the Pro Max model.\r<br />\n\r<br />\n<em>Bloomberg</em>'s Debby Wu and Takashi Mochizuki <a href=\"https://www.bloomberg.com/news/articles/2023-07-24/apple-aims-to-keep-iphone-shipments-steady-despite-2023-turmoil\">subsequently reported</a> there was a \"minor hiccup\" with the displays, but said the issue should be fixed \"within a week or two\" and \"will not have a noticeable impact on overall production.\"\r<br />\n\r<br />\nDisplay Supply Chain Consultants CEO Ross Young said iPhone 15 Pro display shipments are <a href=\"https://twitter.com/DSCCRoss/status/1683571154538352641\">now \"ramping\"</a> as the technical issues are overcome, further increasing the likelihood that Apple will not delay the launch of the iPhone 15 Pro models. At worst, it seems that shipping estimates on launch day may slip quicker than they would have otherwise.\r<br />\n\r<br />\n<h2>Other Features</h2>\r<br />\nBeyond thinner bezels, the iPhone 15 Pro models are rumored to feature a USB-C port, titanium frame, customizable Action button, faster A17 Bionic chip, camera improvements, Wi-Fi 6E support, increased RAM, an upgraded Ultra Wideband chip, and more. These new features coupled with inflationary pressures <a href=\"https://www.macrumors.com/2023/07/24/apple-price-hike-iphone-15-pro-models/\">may lead to price increases</a> for the devices.\r<br />\n\r<br />\nFor additional details, read our in-depth <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro roundup</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/28/iphone-15-pros-thinner-bezels-issue/\">iPhone 15 Pro's Thinner Bezels and Manufacturing Issue: What to Know</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-pros-thinner-bezels-and-manufacturing-issue-what-to-know.2397164/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3348e33796e2a121bcdb6bbf4b59f70996863506e3b272cf60d15ec14135737e","category":"Apple"}