{"title":"Modeling Indium Extraction, Supply, Price, Use and Recycling 1930–2200 Using the WORLD7 Model: Implication for the Imaginaries of Sustainable Europe 2050","link":"http://link.springer.com/10.1007/s11053-023-10296-z","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>The increasing need for indium in photovoltaic technologies is set to exceed available supply. Current estimates suggest only 25% of global solar cell demand for indium can be met, posing a significant challenge for the energy transition. Using the WORLD7 model, this study evaluated the sustainability of indium production and overall market supply. The model considers both mass balance and the dynamic interplay of supply–demand in determining indium prices. It is estimated that a total of 312,000 tons of indium can be extracted. However, the primary hindrance to supply is the availability of extraction opportunities and the necessary infrastructure. Unless we improve production capacity, indium may face shortages, hindering the advancement of pivotal technologies. A concern observed is the insufficient rate of indium recycling. Boosting this could greatly alleviate supply pressures. Projections indicate that indium production will reach its peak between 2025 and 2030, while the peak for photovoltaic solar panels due to indium shortages is anticipated around 2090, with an installed capacity of 1200 GW. Thus, the growth of photovoltaic capacity may lag behind actual demand. For a sustainable future, understanding the role of essential metals like indium is crucial. The European Environment Agency (EEA) introduced four “imaginaries” depicting visions of a sustainable Europe by 2050 (SE2050), each representing a unique future set within specific parameters. Currently, Europe is heavily dependent on imports for tech metals and has limited recycling capabilities, putting it at a disadvantage in a global context. To achieve sustainability, there is a need for improved infrastructure for extraction, recycling, and conservation of metals such as indium. These resources are crucial for realizing Europe’s 2050 sustainability objectives. Furthermore, understanding the role of these metals in wider overarching strategies is vital for envisioning a sustainable European Union by 2050, as depicted in the Imaginaries.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"334a3a4aec401efaab9a472f3ec3b7145b234296567d0931dfa1d01ab844c460","category":"Environment"}