{"title":"Self-regulated analgesia in males but not females is mediated by endogenous opioids","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae453/7821498?rss=1","date":1728864000000,"content":"<span><div>Abstract</div>Converging lines of preclinical and clinical research indicate that females, in stark contrast to males, display an increased prevalence of chronic pain. Females also demonstrate weaker analgesic efficacy in response to opioid therapies when compared with males. These sex-specific differences may be driven by dimorphic endogenous opioidergic responses. In rodent models, analgesia exhibited in males but not females was reversed by inhibiting endogenous opioidergic reception. In humans, the sex-specific endogenous system(s) supporting the direct attenuation of evoked pain has not been identified. To determine whether opioidergic blockade reverses self-regulated analgesia in males as compared to females, the present study combined two operationally analogous clinical trials (<span>n</span> = 98; 51 females and 47 males). In a double-blinded, counterbalanced study involving healthy (<span>n</span> = 39) and chronic low back pain (<span>n</span> = 59) populations, a high-dose naloxone (μ-, κ-, δ-opioid antagonist) vs. placebo-saline cross-over design (15 mg/kg bolus +0.1 mg/kg/h) tested the hypothesis that endogenous opioids mediate analgesia in males but not females. An 11-point visual analog scale (VAS) (0 = no pain; 10 = worst pain imaginable) evaluated pain ratings in response to noxious heat stimulation (49 °C; calf). After baseline pain testing, participants were randomized to a validated four-session mindfulness meditation or sham mindfulness meditation training intervention. Participants practiced their respective meditation during noxious heat, intravenous high-dose naloxone, and placebo saline, respectively. In males and females, meditation significantly lowered evoked pain during saline infusion. Intravenous naloxone inhibited analgesia in males, but pain relief was well preserved in females. The present findings indicate that endogenous opioids mediate self-regulated analgesia in males but not females and underscore the need to establish sex-specific pain therapeutics.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"334def8c95e68830e62ace0e950a239426ccf4a09d17bb45692246015fbf7612","category":"Interdisciplinary"}