{"title":"Knowledge and perception about the welfare and mistreatment of dogs in Brazil","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302317","date":1713535200000,"content":"<p>by Gabriela Ferreira Siano, Camila Stefanie Fonseca de Oliveira, Felipe Gaia de Sousa, Suzane Lilian Beier, Adriane Pimenta da Costa-Val</p>\r\n\r\nAnimal welfare encompasses the overall well-being of an animal, spanning both its physical and mental health, assessable through potential measurements. It stands in contrast to mistreatment, which involves actions, direct or indirect, that endanger an animal’s well-being. This study sought to appraise the factors influencing the Brazilian population’s understanding of dog welfare and mistreatment. The survey questions were adapted from the Animal Welfare Examination Protocol, utilized by veterinarians to evaluate suspected passive abuse cases in dogs. Out of 1377 responses, 1353 were valid and analyzed. Among the 19 assessed indicators, 15 demonstrated an adequate response rate surpassing 90% of all 1353 responses. However, for three questions related to comfort, a smaller yet notable percentage of responses were only minimally adequate. Moreover, in one question within the comfort assessment, 186 participants (13.74%) provided inadequate responses. This implies that these people could potentially subject animals to a state of low Animal Welfare. Lack of knowledge emerged as a potential root of passive abuse, specifically negligence. In the assessment of nutritional indicators, water supply and quality received unanimous adequate responses. In evaluating comfort perceptions, significant associations were noted between gender, dog ownership, family income, and responses regarding resting surface. Regarding health indicators, the majority responded appropriately. Female gender and dog ownership correlated with providing the appropriate response, while not owning a dog was associated with minimally adequate responses. In the context of comfort indicators, \"Hitting the Dog\" also demonstrated an association with gender, with females tending towards appropriate responses. Given the lack of significant correlation between educational levels and the most suitable responses, it underscores the urgency of implementing environmental education programs in schools with a focus on animal protection.","author":"Gabriela Ferreira Siano","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3351c7052e16b8fe8d9d5d104964d609dc6b280b15c67054079edef31cd4a336","category":"Interdisciplinary"}