{"title":"Enhancing Inclusivity: A Holistic Approach to Psychomotor Development and Adapted Football Programs for Children with Intellectual Disabilities","link":"https://www.preprints.org/manuscript/202403.0620/v1","date":1710159719000,"content":"This study examines the effectiveness of a comprehensive psychomotor development program combined with adapted football training for adolescents diagnosed with intellectual disabilities in Romania. Twelve participants, with a mean age of 17.42 years underwent a carefully designed intervention program spanning 36 weeks. The program aimed to enhance fundamental movement skills, integrate these skills into specialized football training, and culminate in a Unified 7-a-side Football Match. Results indicate significant improvements in psychomotor skills, including static and dynamic balance, pulse processing speed, and identified stimuli. Moreover, the intervention positively impacted social interaction among participants. Statistical analysis, employing Pearson Correlation Analysis and Paired Samples t-Test (One-Sample), compared assessments. Results revealed significant differences between pre- and post-intervention measurements, providing robust evidence of the program's efficacy. The positive correlations between physical parameters and social interaction highlight the interconnectedness between physical fitness and social engagement. Our findings suggest that improvements in physical abilities may contribute to increased social interaction among children with intellectual disabilities, underscoring the holistic nature of our intervention, which addresses multiple dimensions of development simultaneously. The findings underscore the holistic benefits of integrating psychomotor development and adapted football programs for adolescents with intellectual disabilities, emphasizing the importance of promoting inclusive physical activities for their overall well-being.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"33596b35f4c3476ee196744170b10fec4b79c8744d2e8f2b96e612047650fb98","category":"Interdisciplinary"}