{"title":"In Situ TEM for Uncovering Electro-Chemo-Mechanical Failures of Li Anode and Ceramic Solid-State Electrolytes in Li-Metal Batteries","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.866/7720190?rss=1","date":1721779200000,"content":"<span>The push towards higher energy density and safer lithium-metal batteries has spotlighted the critical challenges posed by the electro-chemo-mechanical failures at the interfaces of Li anodes and ceramic solid-state electrolytes. In this study, we leverage in-situ Transmission Electron Microscopy (TEM) to elucidate the underlying mechanisms of these failures, providing insights into the critical interplay of electrochemical processes and mechanical stresses during battery operation. By directly observing the morphological evolution of the Li anode and the ceramic electrolyte interface under operational conditions, we identify key phenomena such as Li filamental growth and cavitation, Li-electrolyte reactive wetting, and interface de-cohesion [<a href=\"#ozae044.866-B1\">1</a>]. Our findings reveal that the electro-chemo-mechanical stability of this interface is critically dependent on the mechanical properties of solid-electrolyte interphase (SEI), the Li-solid-state electrolyte reactivity, and the homogeneity of Li deposition. Furthermore, we demonstrate how certain hierarchical modifications to the ceramic electrolytes can significantly enhance interface stability, mitigate failure modes, and extend the lifespan of Li-metal batteries. This study not only advances our understanding of the failure mechanisms in Li-metal batteries but also highlights the potential of in-situ TEM techniques as a powerful tool for designing more reliable and efficient energy storage systems [<a href=\"#ozae044.866-B2\">2</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"335bf40abc3cb305fe20e77cd4d7a2cb3531d4687f854b6bb720ac53902eeb82","category":"Environment"}