{"title":"Current vaccines are enough to fight omicron, but massive wave is coming fast","link":"https://arstechnica.com/?p=1821067","date":1639610981000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1356651138-800x534.jpeg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1356651138.jpeg\">Enlarge</a> <span>/</span> Dr. Anthony Fauci, Chief Medical Advisor to the President, during the daily press briefing at the White House on December 1, 2021, in Washington, DC.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/dr-anthony-fauci-director-of-the-national-institute-of-news-photo/1356651138?adppopup=true\">Getty | Anna Moneymaker</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Though booster doses of current vaccines can foil the ultra-transmissible omicron coronavirus variant, a towering wave of omicron cases may peak in the US as soon as January, officials warn.</p>\n<p>Scientists are still racing to fully understand the variant, which first gained international attention in late November. But a few things are becoming increasingly clear: The variant spreads stunningly fast, and it can largely circumvent protection from two vaccine doses. However, people who have received a third vaccine dose are well-protected against severe disease.</p>\n<p>In a White House press briefing Wednesday, top infectious disease expert Anthony Fauci reviewed the early laboratory and real-world data on vaccine effectiveness. Numerous laboratory studies have all shown that levels of neutralizing antibodies from two doses of a vaccine are significantly lower against omicron—potentially so low that they do not protect against the variant. But studies looking at neutralizing antibodies after a third dose consistently find a substantial increase in protection. One study found a <a href=\"https://www.medrxiv.org/content/10.1101/2021.12.12.21267646v1\">38-fold rise in the level of neutralizing antibodies against omicron</a> after a third dose of an mRNA vaccine.</p></div><p><a href=\"https://arstechnica.com/?p=1821067#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1821067&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"335c6e49c19bbe1e7b2c7c377e877e688fecaaab98d98eeff2d0acf53d3e989d","category":"Tech"}