{"title":"491 Processing and stomach pH influenced in vitro gastric protein solubilization kinetics in sunflower meal","link":"https://academic.oup.com/jas/article/102/Supplement_3/163/7757082?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The study aimed to evaluate the effect of processing and pH on gastric protein solubilization kinetics in sunflower meal (SFM) products using porcine digestion simulation model. The SFM samples were derived from diverse processing approaches: 1) dehulled-cold pressed (SFM_CP), 2) dehulled-solvent-extracted (SFM_SE), and 3) application of electrostatic separation technology on SFM_SE to generate high crude protein (CP) version (SFM_SEP). Soybean meal (SBM) was included for reference comparison (Table 1). Considering the complex factors influencing retention time, gastric pH, and pepsin secretion, the study employed multiple sampling times, and pH levels. A total of 500 mg CP equivalent of each sample (in triplicates) was mixed with 25 mL of 0.1 M phosphate buffer (pH 6.0) and 2 mL of pepsin (27 mg/mL). The pH was adjusted to either 1.5, 2.5, 3.5 or 4.5 using 1 M HCl and placed in incubator shaker (200 rpm) at 39°C. Samples were taken at 0, 30, 60, and 90 min, snap-frozen in liquid nitrogen, stored frozen, later thawed at 4°C, centrifuged (15,000 × g for 10 min) and supernatants analyzed for CP. The data were analyzed using Proc GLIMIXX in SAS while Gompertz equation was used to describe the gastric protein solubilization kinetics. The model included the fixed effects of protein source or processing, stomach pH and their interaction on the gastric CP solubility at 90 min and gastric protein solubility kinetics (A-maximum solubilized CP, Wo- initial CP solubility, Ku- solubilization rate, Ti- time to inflection). The analyzed CP SBM, SFM_CP, SFM_SE, and SFM_SEP, were 514.4, 524.4, 393.5, and 484.2 g/kg DM, respectively. Gastric CP solubility increased with lower pH and longer incubation time (<span>P</span> &lt; 0.05), which corresponded well with the optimum pH of pepsin activity around 2. Compared with SFM, SBM had the least (<span>P</span> &lt; 0.05) gastric CP solubility at pH 4.5 and 3.5, and the least predicted maximum gastric CP solubility (A) at pH 4.5, 3.5 and 2.5 (<span>P</span> &lt; 0.05; Table 2). SFM_CP showed the greatest predicted initial gastric CP solubility at 0 h (Wo) and A (<span>P</span> &lt; 0.05). Electrostatic fractionation of SFM_SE (SFM_SEP) enhanced gastric CP solubility at pH 3.5 and 2.5 and reduced the solubility time to inflection point (Ti; <span>P</span> &lt; 0.05). In conclusion, data indicated that cold pressing SFM increased gastric CP solubility relative to solvent extraction. However, electrostatic fractionation of SFM_SE improved protein gastric solubility. While SBM remains a standard, incorporating the studied sunflower meals with their fast CP digestion kinetics in feed formulation could improve protein utilization in young animals with high stomach pH. In vivo studies, particularly on ileal amino acid digestibility, are crucial to validate these findings.Sunflower meal tables_FMN.pdf</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3362e627603498ce71858c928e7c890dc322ff4084d154d6b59a0619a2cd16b0","category":"Environment"}