{"title":"More zombie-brand Motorola smartwatches are launching soon","link":"https://arstechnica.com/?p=1807575","date":1635272762000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/53-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/53.jpg\">Enlarge</a> </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Somehow, Motorola smartwatches are still happening, though they won't be from Motorola Mobility's current owner, Lenovo. There's a long and complicated story about how a company you've never heard of is manufacturing \"Motorola\" smartwatches, but as <a href=\"https://www.androidpolice.com/theres-a-new-motorola-smartwatch-coming-in-early-2022-but-bigger-questions-remain/\">Android Police</a> has been tracking, the group, called CE Brands, is indeed planning to release three new watches soon.</p>\n<p>Ever since Motorola stopped being an independent company in 2011 and sold itself to Google, the \"Motorola\" brand has been fragmented across the electronics landscape. The brand is so abused today the word \"Motorola\" is truly <a href=\"https://arstechnica.com/gadgets/2018/10/palm-rises-from-the-dead-as-a-zombie-brand-launches-tiny-smartphone/\">a zombie brand</a> that means basically nothing in terms of a device's lineage. It could represent a product from three different companies.</p>\n<p>In the run-up to the Google sale, Motorola Inc. split into two companies, Motorola Mobility, for consumer electronics like smartphones and watches, and Motorola Solutions, for things like first-responder radios and other critical communication tools. Google bought Moto Mobility for $12 billion, then sold the cable modem business to Arris and started making Motorola smartphones. Google threw in the towel on Motorola in 2014 and sold the division to Lenovo, but one well-received product line that landed just before and after the transition was the <a href=\"https://arstechnica.com/gadgets/2014/09/moto-360-review-beautiful-outside-ugly-inside/\">Moto 360</a> smartwatch, which, with <a href=\"https://arstechnica.com/gadgets/2015/09/the-second-generaiton-moto-360-a-beautiful-compact-design-without-much-new-tech/\">two generations</a>, brought a stylish round design to early Android Wear devices.</p></div><p><a href=\"https://arstechnica.com/?p=1807575#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1807575&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3366f7fe46df655d5c68246a55195993bc378da9c3ab8f7329ba7a543409a356","category":"Tech"}