{"title":"Associations between people experiencing homelessness (PEH) and neurodegenerative disorders (NDDs): A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312117","date":1729605600000,"content":"<p>by Pengfei Fu, Vijay Mago, Rebecca Schiff, Bonnie Krysowaty</p>\r\nBackground <p>Homelessness represents a widespread social issue globally, yet the risk of neurodegenerative diseases (NDDs) associated with people experiencing homelessness (PEH) has not received sufficient attention. Therefore, this study aimed to explore the risk of NDDs among PEH and its variation across countries and regions through meta-analysis and systematic review.</p> Methods <p>Searching from databases such as PubMed and Web of Science, relevant research articles on PEH and NDDs were identified. After multiple screening, eight articles were selected for meta-analysis. Statistical methods and models were used to evaluate the association between PEH and NDDs, stratified by disease type and country.</p> Results <p>We found that PEH had a 51% higher risk of NDDs (OR = 1.51 (95% CI: 1.21, 1.89)) compared with those with stable housing. Specifically, PEH had a significantly higher risk of developing multiple sclerosis (OR = 4.64 (95% CI: 1.96, 10.98)). Alzheimer’s disease and related dementias (ADRD) (OR = 1.93 (95% CI: 1.34, 2.77)), dementia (OR = 1.69 (95% CI: 1.26, 2.27)), and cognitive impairment (OR = 1.07 (95% CI: 0.98, 1.16)) were all at higher risk. Furthermore, country and regional differences were observed, with countries such as Iran (OR = 4.64 (95% CI: 1.96, 10.98)), the Netherlands (OR = 2.14 (95% CI: 1.23, 3.73)), the United States (OR = 1.66 (95% CI: 1.25, 2.22)), and Canada (OR = 1.06 (95% CI: 1.01, 1.10)) showing a higher risk of NDDs among the PEH.</p> Conclusions <p>The study emphasizes the significant NDD risks among PEH, providing novel perspectives on this issue and shedding light on national disparities influenced by variations in healthcare systems and social environments. This will be beneficial for academia and government to prioritize the health of PEH with NDDs, aiming to mitigate disease incidence and economic burdens while preserving social stability and upholding basic human rights.</p>","author":"Pengfei Fu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"33674673bfcb850b6ff065fa3b24a87c02e7fc38e4f04fa452b91f2cf9cd5aa7","category":"Interdisciplinary"}