{"title":"Microsoft Considered Selling Bing to Apple in 2020","link":"https://www.macrumors.com/2023/09/28/microsoft-bing-acquisition-talks/","date":1695938775000,"content":"Back in 2020, Microsoft considered selling its Bing search engine to Apple, reports <em><a href=\"https://www.bloomberg.com/news/articles/2023-09-28/microsoft-discussed-selling-bing-to-apple-as-google-replacement\">Bloomberg</a></em>. Had the acquisition happened, Bing would have replaced Google as the default search engine on Apple devices.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/microsoft-bing-chatgpt.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nMicrosoft executives met up with Apple services chief <a href=\"https://www.macrumors.com/guide/eddy-cue/\">Eddy Cue</a> to discuss a potential deal, but the talks were just exploratory and did not progress. According to <em>Bloomberg</em>, Apple did not move forward with a deal because of the money that it earns from Google and because it was concerned that Bing could not compete with Google in \"quality and capabilities.\"\r<br />\n\r<br />\nGoogle's search engine has long been the default search engine on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and Mac, and Google pays Apple billions of dollars per year for the privilege. Google and Apple last inked a deal in 2021, facilitated by Cue, and as of 2020, Apple was collecting $4 billion and $7 billion annually from Google. The Apple/Google deal has been under scrutiny this week due to the antitrust trial between Google and the U.S Department of Justice, with the DoJ pointing toward Google's dominance on Apple devices as evidence that Google has a search engine monopoly.\r<br />\n\r<br />\n‌Eddy Cue‌ this week <a href=\"https://www.macrumors.com/2023/09/26/apple-on-why-google-is-default-on-iphone/\">had to testify in the trial</a>, and he explained why Google is the ‌iPhone‌'s default search engine. \"We make Google be the default search engine because we've always thought it was the best,\" Cue said. He went on to say that Apple has not gone with another search engine provider because there is no \"valid alternative.\"\r<br />\n\r<br />\nWhile Google is the default search engine on Apple devices, users can choose to swap to Yahoo, Bing, DuckDuckGo, or Ecosia as an alternative. Bing has recently become a more popular search engine option thanks to Microsoft's partnership with OpenAI and the integration of chatbot technology.<div>Tags: <a href=\"https://www.macrumors.com/guide/google/\">Google</a>, <a href=\"https://www.macrumors.com/guide/microsoft/\">Microsoft</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/28/microsoft-bing-acquisition-talks/\">Microsoft Considered Selling Bing to Apple in 2020</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/microsoft-considered-selling-bing-to-apple-in-2020.2405372/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"336a48b292076d8614041460419293e63b9b2aebf2ce5081013084fc32802bc4","category":"Apple"}