{"title":"The End of Publications","link":"https://markpeak.net/the-end-of-publications/","date":1617069122000,"content":"<p>ข่าวไอทีที่น่าสนใจในรอบสัปดาห์ที่แล้วคือ <a href=\"https://ev.medium.com/medium-editorial-team-update-8679bcb9fe81\">Medium ประกาศปลดทีมสร้างคอนเทนต์ของตัวเอง</a> โดยเสนอจ้างออก (ให้เงินเดือน 5 เดือน) เพราะต้องการเปลี่ยนแนวทางจากสร้างคอนเทนต์เองด้วย มาเป็นแพลตฟอร์มอย่างเดียว แล้วให้นักเขียนอิสระเป็นตัวดึงดูดคนอ่านให้มาเป็นสมาชิกแทน</p>\n<p>เหตุผลก็ตรงไปตรงมาคือ คอนเทนต์จาก editorial ทำเงินได้ไม่คุ้มนัก (เพราะต้องจ้างคนเยอะ มีภาระเงินเดือนต่อเนื่อง) ย้ายมาเป็นการจ่ายส่วนแบ่ง % จาก subscription ให้กับนักเขียนอิสระ ที่ไม่ต้องจ่ายเงินเดือนดีกว่า</p>\n<blockquote><p>What’s worked less well is where we’ve followed the traditional editorial playbook — specifically, commissioning stories from professional writers into publications with broad mandates.</p></blockquote>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://ev.medium.com/medium-editorial-team-update-8679bcb9fe81\">\n\t\t\t\t\t<img src=\"https://markpeak.net/wp-content/plugins/content-cards/skins/default/content-cards-placeholder.png\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://ev.medium.com/medium-editorial-team-update-8679bcb9fe81\">\n\t\t\tMedium\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://ev.medium.com/medium-editorial-team-update-8679bcb9fe81\">\n\t\t\t\t\t</a>\n\t</div>\n\t<div>\n\t\t\t\tMedium\t</div>\n</div>\n<p>มีบทเสริมโดย The Verge ที่ออกมาแฉปัญหาการบริหารภายใน Medium ด้วย แต่ในแง่โครงสร้างของโมเดลธุรกิจ คงไม่มีอะไรต่างกันมากนัก</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.theverge.com/2021/3/24/22349175/medium-layoffs-union-evan-williams-blogger-twitter-subscription\">\n\t\t\t\t\t<img src=\"https://cdn.vox-cdn.com/thumbor/z7UZIBgIBcEwrI8x-nn4O2ywo-Q=/0x148:2050x1221/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22394404/VRG_ILLO_4488_001.jpg\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.theverge.com/2021/3/24/22349175/medium-layoffs-union-evan-williams-blogger-twitter-subscription\">\n\t\t\tThe mess at Medium\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.theverge.com/2021/3/24/22349175/medium-layoffs-union-evan-williams-blogger-twitter-subscription\">\n\t\t\t<p>Behind the dysfunctional company famous for its routine mistreatment of writers</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://cdn.vox-cdn.com/uploads/chorus_asset/file/21956592/favicon-96x96.0.0.ico\" />\t\tThe Verge\t</div>\n</div>\n<p>ในฐานะคนทำสื่อ ก็ติดตามความเคลื่อนไหวของแวดวงสื่อต่างประเทศมาโดยตลอด และเห็นแนวโน้มชัดเจนว่า โมเดลการหารายได้ที่อิงกับโฆษณา (advertising-based) เริ่มไปได้ยากขึ้น กลายเป็นโมเดลที่ผู้สร้างคอนเทนต์กับผู้เสพคอนเทนต์มีความสัมพันธ์กันโดยตรง (direct-to-consumer) จ่ายเงินกันเองโดยตรง ไม่ว่าจะอยู่ในรูปการเป็นสมาชิก (subscription) หรือการบริจาคเงิน (donation) ก็ตาม</p>\n<p>ความเคลื่อนไหวของแพลตฟอร์มสื่อหลายหัว จึงไปในทิศทางนี้ ไม่ว่าจะเป็น</p>\n<ul>\n<li><strong>Text-based</strong> ในรูปของ Medium (กรณีล่าสุดนี้) และ Substack (newsletter)</li>\n<li><strong>Video-based</strong> เช่น Membership ของ YouTube หรือ Subscription ของ Twitch (subscription)</li>\n<li><strong>Audio-based</strong> พวก paid podcast ทั้งหลาย</li>\n</ul>\n<p>สิ่งที่น่าสนใจคือ ในประกาศเปลี่ยนทิศทางของ Medium ตัวซีอีโอคือ Ev Williams ได้เขียนแสดงความเห็นเอาไว้ว่า ในมุมมองของเขาพบว่า “บทบาทของสื่อที่มีหัว” (publications) ได้ลดลงไปอย่างมากในโลกยุคนี้ เพราะมันย้ายไปอยู่ที่ “ตัวบุคคล” มากขึ้นแทน</p>\n<blockquote><p>I think a significant factor is that <strong>the role of publications</strong> — in the world, not just on Medium — <strong>has decreased in the modern era.</strong> I don’t mean the role of professional editorial, but the idea of an imprimatur that establishes credibility or trust. Trust is more important than ever and well-established editorial brands still have meaning. <strong>But today, credibility and affinity are primarily built by people — individual voices — rather than brands. </strong></p></blockquote>\n<p>ส่วนหนึ่งคงเป็นเพราะ ระบบ publications แบบเดิมนั้นผูกกับการจัดจำหน่าย (distribution) อย่างแนบแน่น</p>\n<p>ตัวของ publications เองเกิดจากการประกอบกันของ editorial (การคัดสรร/แก้ไขปรับแต่งงานเขียนโดยทีม บ.ก. กลาง) ผนวกกับ brand/trust ความน่าเชื่อถือต่อการคัดสรร/แก้ไขนั้นๆ</p>\n<p>ตัวอย่างเช่น เราย่อมให้ความเชื่อมั่นว่า ข่าวที่ BBC เลือกมา (โดยส่วนใหญ่) มีความน่าเชื่อถือสูง แม้เราไม่รู้ว่าใครเป็นคนเขียน ใครเป็น บ.ก. ก็ตาม</p>\n<p>แต่ระบบ publications อาจเหมาะกับสื่อบางประเภท เช่น ข่าวที่เป็น hard news update เท่านั้น พอเป็นคอนเทนต์ประเภทอื่น เช่น บันเทิง หรือ ความเห็น (opinion) เรามีความจำเป็นต้องพึ่งพา publications น้อยลง</p>\n<p>คอลัมนิสต์ชื่อดังไม่จำเป็นต้องเขียนคอลัมน์ลง publications ชื่อดังอีกต่อไป เพราะสื่อยุคปัจจุบันทำให้คนเสพคอนเทนต์ตามหาคอลัมนิสต์เหล่านี้เจอ (ผ่าน search/social/recommendation/distribution channels อื่นๆ) และเข้ามาเสพคอนเทนต์โดยตรงได้เลย</p>\n<p>ความสัมพันธ์ของผู้เสพคอนเทนต์ (audience) กับผู้สร้างคอนเทนต์ (creator) จึงกลายเป็นความสัมพันธ์โดยตรง แล้วอิงอยู่บนช่องทาง (distribution) ที่สร้างโดยแพลตฟอร์ม (platform) ที่ใช้อัลกอริทึมในการเชื่อมโยงผู้สร้าง/ผู้เสพเข้าด้วยกัน แทนการใช้ human editorial อย่างที่ publication ทำ</p>\n<p>พูดง่ายๆ คือ platform กำลังมาแทนที่ publications รูปแบบของ “ตัวกลาง” มันเปลี่ยนไปจากเดิม</p>\n<p>platform ที่มีฐานผู้ใช้งานมากๆ (เช่น YouTube, Facebook, Twitch) จึงมีอำนาจต่อรองสูง เพราะมีฐานผู้ใช้ในมือ แต่ถ้ารูปแบบของคอนเทนต์ไม่ได้เป็น mass ขนาดนั้น (เช่น paid newsletter หรือ paid podcast) ก็ต้องหา premium niche ที่มีกำลังจ่ายมาสนับสนุน</p>\n<p>Medium มีสถานะเป็นทั้งสองอย่างคือ platform ที่เปิดให้ใครเข้ามาเขียนก็ได้ (และเลือกจะ “ทำเงิน” ได้จากส่วนแบ่ง % ค่า subscription) และมี publication ของตัวเองจำนวนหนึ่ง เพื่อเป็นคอนเทนต์คุณภาพสูง ดึงดูดให้คนเข้ามาอ่าน Medium มากๆ และกลายมาเป็นสมาชิกแบบจ่ายเงินของ Medium</p>\n<p>สิ่งที่ Medium ทำคือ ลดงบประมาณด้าน publication ลง (ยังไม่ถึงกับเลิก 100% แต่ดูทรงแล้วก็คงไม่รอด) และจะหันไปมุ่งที่นักเขียนอิสระอย่างเดียว</p>\n<blockquote><p>Redirecting editorial resources to finding and supporting independent writers, who were publishing on Medium outside of our pubs.</p>\n<p>For the foreseeable future, we will focus that talent on supporting independent voices on our platform.</p></blockquote>\n<p>ในภาพรวมแล้วก็ค่อนข้างเห็นด้วยกับทิศทางนี้ ว่า publication ลดความสำคัญลง แม้ยังไม่ตายทีเดียว เพราะเรายังต้องการสื่อที่มีหัวใหญ่ๆ แบบ BBC, New York Times, Bloomberg, Financial Times, Nikkei ฯลฯ อยู่</p>\n<p>แต่ในด้านที่เป็น lifestyle, taste, opinion หรือเรื่องที่ต้องอาศัยความเชี่ยวชาญเฉพาะด้านสูง อิงกับคาแรกเตอร์ส่วนบุคคลมาก ความสำคัญของ publications ก็ลดลงไปจากเดิมมากจริงๆ</p>The post <a href=\"https://markpeak.net/the-end-of-publications/\">The End of Publications</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"336da9408dc923de4ee4231c9adb1c716b1e6e512a9f66c5f29ac53a4ab3dcd7","category":"Thai"}