{"title":"1D Pac-Man is the best game I’ve played in 2024 (so far)","link":"https://arstechnica.com/?p=1993804","date":1704409871000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/paku2-1-800x299.png\" alt=\"I didn't write this story just to share that high score in the corner, but I won't say it had &lt;em&gt;nothing&lt;/em&gt; to do with the choice.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/paku2-1.png\">Enlarge</a> <span>/</span> I didn't write this story just to share that high score in the corner, but I won't say it had <em>nothing</em> to do with the choice. (credit: <a href=\"https://abagames.github.io/crisp-game-lib-11-games/?pakupaku\">ABA Games</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>When looking back at the short history of video game design, the '90s and '00s transition from primarily 2D games to primarily 3D games is rightly seen as one of the biggest revolutions in the industry. But my discovery this week of the <a href=\"https://abagames.github.io/crisp-game-lib-11-games/?pakupaku\">one-dimensional, <em>Pac-Man</em>-inspired <em>Paku Paku</em></a> makes me wish that the game industry had some sort of pre-history where clever 1D games like this were the norm. It also makes me wish I had been quicker to discover more of the work of <a href=\"https://www.asahi-net.or.jp/~cs8k-cyu/index.html\">extremely prolific and clever game designer Kenta Cho</a>, who made the game.</p>\n<p>In <em>Paku Paku</em>, <em>Pac-Man</em>'s 2D maze of 240 dots has been replaced with 16 dots arranged in a single line. Your six-pixel tall dot-muncher (the graphics are 2D, even as the gameplay uses only one dimension) is forced to forever travel either left or right along this line, trying to eat all the dots while avoiding a single red ghost (who moves just a bit faster than the player). To do this, the player can use a single power pellet (which makes the ghost edible for a short while) or the screen-wrapping tunnels on either side of the line (which the ghost can't use).</p>\n<p></p></div><p><a href=\"https://arstechnica.com/?p=1993804#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1993804&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3377589be3416f96a2db43a48c8d89bad119c98d09ff509bcd9b0c8cb0ebfab5","category":"Tech"}