{"title":"CAM evolution is associated with gene family expansion in an explosive bromeliad radiation","link":"https://academic.oup.com/plcell/article/36/10/4109/7658667?rss=1","date":1714435200000,"content":"<span><div>Abstract</div>The subgenus <span>Tillandsia</span> (Bromeliaceae) belongs to one of the fastest radiating clades in the plant kingdom and is characterized by the repeated evolution of Crassulacean acid metabolism (CAM). Despite its complex genetic basis, this water-conserving trait has evolved independently across many plant families and is regarded as a key innovation trait and driver of ecological diversification in Bromeliaceae. By producing high-quality genome assemblies of a <span>Tillandsia</span> species pair displaying divergent photosynthetic phenotypes, and combining genome-wide investigations of synteny, transposable element (TE) dynamics, sequence evolution, gene family evolution, and temporal differential expression, we were able to pinpoint the genomic drivers of CAM evolution in <span>Tillandsia</span>. Several large-scale rearrangements associated with karyotype changes between the 2 genomes and a highly dynamic TE landscape shaped the genomes of <span>Tillandsia</span>. However, our analyses show that rewiring of photosynthetic metabolism is mainly obtained through regulatory evolution rather than coding sequence evolution, as CAM-related genes are differentially expressed across a 24-h cycle between the 2 species but are not candidates of positive selection. Gene orthology analyses reveal that CAM-related gene families manifesting differential expression underwent accelerated gene family expansion in the constitutive CAM species, further supporting the view of gene family evolution as a driver of CAM evolution.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"3381e71fecacc3423a3bc277f121946f4ac56879d49c862cfccf2f4a158440e6","category":"Environment"}