{"title":"Deltopectoral Flap in Head and Neck Reconstruction","link":"https://www.preprints.org/manuscript/202409.0260/v1","date":1725386533000,"content":"Background and Objectives: The deltopectoral (DP) flap represents a reconstructive option for head and neck. It is a fasciocutaneous flap raised from the anterior chest wall below the clavicle. Its role partially declined with the arise of free flaps. However, it still remains a valid option in patients that could not undergo a reconstruction with free flaps. The aim of this retrospective study was to evaluate the role of the DP flap in head and neck reconstruction, with a focus on surgical outcomes and complications. Materials and Methods: Thirty-one patients who underwent head and neck reconstruction with DP flap were included in the study. The delayed technique was not used in any procedure to harvest the flap beyond the deltopectoral groove. The patients’ characteristics, the recipient site, the closure of the donor site and the flap-related complications were recorded. Results: The median time to autonomization of DP flap was 23 days. Post-operative complications were observed in 10 subjects (32.3%). A partial necrosis was seen in 5 patients (16.1%), while a complete necrosis developed only in one case (3.2%). The diabetes mellitus was the only parameter associated to post-operative complications. In particular, the percentage of necrosis in subjects with or without diabetes was 66.7% and 8.0%, respectively. Conclusions: The DP has a wide range of applications in head and neck reconstruction and a low complication rate can be observed. The delayed technique does not necessarily need to be applied, and the flap can be extended beyond the deltopectoral groove when necessary. However, patients with diabetes mellitus have a higher risk of postoperative necrosis of the distal portion of the flap.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"338b6efb89feddceaf60fcb774fa89820a192bf963179327c254156dcf3d1b51","category":"Interdisciplinary"}