{"title":"Tech Tidbits: COROS Adds Full Maps to Vertix 1 & APEX PRO, Peloton’s New Guide Hardware","link":"https://www.dcrainmaker.com/2021/11/tech-tidbits-coros-adds-full-maps-to-vertix-1-apex-pro-pelotons-new-guide-hardware.html","date":1636542520000,"content":"<p>Despite venturing into the typical vacancy of November (from a product release standpoint), there’s a few things still trickling in, though in this case one was pre-announced (COROS), and one is about hardware for next year. Still, they’re worth a quick mention – albeit for different reasons.</p>\n<h3><span>COROS Adds Full Maps To Older Watches:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/COROS-Vertix1-APEX-Pro-Maps.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/COROS-Vertix1-APEX-Pro-Maps_thumb.png\" /></a></p>\n<p>Back in August when COROS announced the Vertix 2 (with both topo and landscape maps), it noted that topo (only) maps would be coming to the Vertix 1 and APEX Pro “later this year”. Well, later this year has arrived, and COROS has under-promised and over-delivered: Users aren’t just getting the topo maps, they’re getting the full maps (both topo and landscape). That’s a pretty big step up.</p>\n<p>And atop that, they’re adding Galileo support to both those watches as well, increasing your GNSS options. Galileo also comes to <a href=\"https://www.dcrainmaker.com/2020/09/coros-pace-2-in-depth-review-multisport-running-power.html\">the PACE 2</a>.</p>\n<p>For the maps, they’re opening up a beta program this week, with the first 1,000 people getting access starting Nov 11th, then they’ll do full production release on Nov 22nd (unless anything comes up that needs to delay that, they said). For the Vertix 1 and APEX Pro, you’ll download the maps from <a href=\"https://coros.com/maps/\">COROS’s maps site</a>. Basically, you’ve got a menu to choose which maps you want and then you download the files and stick them on your watch.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/MapRegion.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/MapRegion_thumb.png\" /></a></p>\n<p>Both of these watches have 4GB of space on them, so you won’t be able to download the entire universe.  For example, all of Europe is about 3.5GB, so it’ll squeak on there. You just choose what you want, and then download the file.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/MapDownload.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/MapDownload_thumb.png\" /></a></p>\n<p>The times estimated above aren’t for the initial download, but for transferring it to your watch over the USB connection. The initial download for that European map set using my reasonably quick internet was 5 minutes.</p>\n<p>In terms of capabilities here, all of the COROS watches that have maps (Vertix 2, and now Vertix 1 and APEX Pro), the maps serve more as ‘backgrounds’ that routes float atop. By that I mean you can’t re-route on these maps, or route with these maps. Instead, routes sent to your watch are followed breadcrumb style, with this being more like an image that sits behind it.  It’s a great middle-ground for COROS on the road to full routing capability. And it’s certainly useful as I outlined in my <a href=\"https://www.dcrainmaker.com/2021/08/coros-vertix-2-in-depth-review.html\">Vertix 2 review</a>.</p>\n<p>With <a href=\"https://www.dcrainmaker.com/2021/10/coros-rolls-out-strava-routes-sync.html\">COROS adding Strava Routes support last month</a>, that helps as well. Though I’d still like to see them streamline the actual sync to watch process a bit more. Right now it’s limited to only 10 routes on your watch, and also requires some double-confirmations.</p>\n<p>Still, the fact that COROS is adding this to watches announced over 2 years ago is huge, and continues to show their stance of adding features to older watches that have the hardware to do it. Obviously, that required planning. You’re not seeing these maps added to the <a href=\"https://www.dcrainmaker.com/2020/09/coros-pace-2-in-depth-review-multisport-running-power.html\">Pace series watches</a> (or the <a href=\"https://www.dcrainmaker.com/2019/02/coros-apex-multisport-gps-review.html\">original APEX</a>), because those apparently lack the storage required for the maps.</p>\n<p>We’ve never seen any other player in this space add maps down the road to an older device just for giggles. Of course, nobody else puts 4GB of extra space in their hardware for giggles. Albeit, <a href=\"https://www.dcrainmaker.com/2021/04/garmin-forerunner-745-review-update-8-months-later.html\">Garmin’s Forerunner 745</a> does have that exact 4GB of space (used for music), yet lacks maps that its more expensive siblings have…hmm.</p>\n<h3><span>Peloton’s New Guide &amp; Heart Rate Sensor:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/Peloton-Guide.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/Peloton-Guide_thumb.jpg\" /></a></p>\n<p>Next up there’s the long-rumored Peloton Guide. This camera system connects to your TV and then tracks your movements for various strength training moves. This includes the ability to compare your form for a given moment to that of the instructor using some sort of overlay (this part is a bit fuzzy). The system can be controlled via voice during workouts, and then after workouts can turn off the mic via a physical switch, and the camera via a physical cover. Notably that the voice control though is only initially in US/UK/Canada, with other markets “to come”.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/Peloton_Guide-Usage.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/Peloton_Guide-Usage_thumb.jpg\" /></a></p>\n<p>The Peloton Guide will also come with the just announced new Peloton Heart Rate Band. There’s even less information on this, other than that it’s basically an arm-band akin to a <a href=\"https://www.dcrainmaker.com/2018/01/scosches-rhythm-24-optical-hr-sensor.html\">Scosche optical HR sensor</a>, which shows zone information using 5 LEDs. You can see it here on the arm:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/Peloton_Guide-Usage-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/Peloton_Guide-Usage_thumb-1.jpg\" /></a></p>\n<p>The pricing for the Guide is “$495USD/$645CAD/£450GBP/$750AUD/€495 EUR”, with availability for the US and Canada in “early 2022”, and the “UK, Australia, and Germany in 2022”. The heart rate band will be available separately in “early 2022”, and will cost $89USD. A membership is required to use the hardware – either the Guide membership or a Digital App Membership ($12.99/month). Or, if you’ve got a full access Peloton membership for your existing Peloton Bike/Treadmill, then it’s included.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/PelotonGuideUsage.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/PelotonGuideUsage_thumb.jpg\" /></a></p>\n<p>The camera system won’t come with any weights. Undoubtedly Peloton will probably offer a set that works best with their classes and the camera system, so we’ll have to see how that ends up looking once folks can actually order it. Peloton currently has plenty of weight options in their store, though nothing tailored yet for the Guide (in terms of a specific collection like you have for Tread).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/PelotonWeights.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/PelotonWeights_thumb.png\" /></a></p>\n<p>Stepping back to Guide overall, the pricing probably works here. But focusing on that would sorta miss the point of why people get Peloton: It’s to control their time and avoid going to the gym. Comparison could be made to the gym, but realistically, that line of thinking has long been shattered with not just Peloton, but Peloton’s competitors in their space. As with anything in life, people value their time, and time commuting to a gym is lost time in your life. Thus, folks are paying to avoid that lost time.</p>\n<p>Further, for plenty of people, the gym is intimidating or at best, an unknown. Again, this aims to address that. And again, this market area is well proven by Tonal (from $2,700), Mirror ($1,495), and others. Whether or not it’s a fad probably remains to be seen. But Peloton is at a fraction of the price, albeit with differing functionality.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/PeltonWeights.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/PeltonWeights_thumb.jpg\" /></a></p>\n<p>But if we look at the trend here, it’s towards having more equipment at home and better instruction/detail than you’d get at a gym by yourself (sans-class). In most cases, the monthly cost will be less than a standard gym membership – though the upfront cost could vary from a ROI standpoint.</p>\n<p>Of course, none of this new hardware is available today. Instead, it comes next year. Undoubtedly, Peloton’s purpose in announcing it now is to stave off having people buy Tonal &amp; Mirror equipment over the holidays. For hardcore Peloton users, they’ll easily defer their purchases till they can see what Peloton offers. No different than any other company doing a preemptive announce to kill their competitors’ holiday sales.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/Pelotoncameracover.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/Pelotoncameracover_thumb.jpg\" /></a></p>\n<p>As for me reviewing it? We’ll see. As you all know, the gym isn’t really my jam. It’s just not something I personally find super exciting, though The Girl does. She built out a gym here at the DCR Cave which she uses multiple times a week. And, she keeps trying her best to convince me to use it more than twice a year for one-off product testing. I’ve personally preferred a circuit-style gym scenario with others in the class and a shared instructor. Perhaps I’ll find some common ground here I like.</p>\n<p>Meanwhile, on the heart rate sensor – I’ll definitely look forward to testing that, as that’s most certainly in my wheelhouse.</p>\n<p>With that, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"3392db30bc73eec1bda5aa1173d26d2c7508986efba7df50c11b4ba4536b7c98","category":"Cycling"}