{"title":"Effects of Habitat and Fruit Scent on the Interactions between Short-tailed Fruit Bats and Piper Plants","link":"https://academic.oup.com/iob/article/doi/10.1093/iob/obae028/7723705?rss=1","date":1722211200000,"content":"<span><div>Synopsis</div><span>Piper</span> is a mega-diverse genus of pioneer plants that contributes to the maintenance and regeneration of tropical forests. In the Neotropics, <span>Carollia</span> bats use olfaction to forage for <span>Piper</span> fruit and are a main disperser of <span>Piper</span> seeds via consumption and subsequent defecation during flight. In return, <span>Piper</span> fruits provide essential nutrients for <span>Carollia</span> year-round. There is evidence that the types and diversity of <span>Piper</span> frugivores are influenced by the primary habitat type of different <span>Piper</span> species (forest and gap), with forest <span>Piper</span> depending more on bats for seed dispersal; however, this pattern has not been tested broadly. We aimed to characterize and compare the interactions between <span>Carollia</span> and <span>Piper</span> across forested and gap habitats, and further investigate whether differences in fruit traits relevant to bat foraging (i.e., scent) could underlie differences in <span>Carollia-Piper</span> interactions. We collected nightly acoustic ultrasonic recordings and 24 h camera trap data in La Selva, Costa Rica across 12 species of <span>Piper</span> (six forest, six gap) and integrated this information with data on <span>Carollia</span> diet and <span>Piper</span> fruit scent. Merging biomonitoring modalities allowed us to characterize ecological interactions in a hierarchical manner: from general activity and presence of bats, to visitations and inspections of plants, to acquisition and consumption of fruits. We found significant differences in <span>Carollia-Piper</span> interactions between forested and gap habitats; however, the type of biomonitoring modality (camera trap, acoustics, diet) influenced our ability to detect these differences. Forest <span>Piper</span> were exclusively visited by bats, whereas gap <span>Piper</span> had a more diverse suite of frugivores; the annual diet of <span>Carollia</span>, however, is dominated by gap <span>Piper</span> since these plants produce fruit year-round. We found evidence that fruit scent composition significantly differs between forest and gap <span>Piper</span>, which highlights the possibility that bats could be using chemical cues to differentially forage for gap vs. forest <span>Piper</span>. By integrating studies of <span>Piper</span> fruit scent, plant visitation patterns, and <span>Carollia</span> diet composition, we paint a clearer picture of the ecological interactions between <span>Piper</span> and <span>Carollia</span>, and plant-animal mutualisms more generally.</span>","author":"","siteTitle":"Integrative Organismal Biology Current Issue","siteHash":"ad96bcf7a80ab7e3a1a88c34298d761f9695964c0badbbef4e1166baa6580fcc","entryHash":"339b9bc7eda7d46ba699f0905e42e9d9a669b5203f0ee91e784aa165f65e9a68","category":"Environment"}