{"title":"Potential for Concentrated Microalgae as Replacement Diets for Juvenile Green‐Lipped Mussels, Perna canaliculus","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/9841172?af=R","date":1676966400000,"content":"<p>The nursery culture of bivalves typically relies on the feeding of costly live microalgae, while the use of natural sources of phytoplankton for feed is uncertain due to their variable quality and abundance. Replacement diets have been applied in bivalve nursery culture to replace live microalgae with varying success. This study investigated the potential use of two concentrated microalgal diets at a range of levels of substitution with live microalgae. Shellfish Diet 1800® (called SD) and LPB™ Frozen Shellfish Diet® (called LPB) were fed to juvenile green-lipped mussels (<i>Perna canaliculus</i>) at five levels of substitution for live microalgae (i.e., 0, 25, 50, 75, and 100%) for 27 days. The mortality of mussels fed with 100% LPB replacement was significantly higher than the mortality of mussels fed at the lower levels of replacement, i.e., 0 and 25%. The overall final size of spat tended to decrease with the increasing level replacement of live microalgae. Proximate analysis (i.e., crude ash-free dry weight, crude protein, crude lipid, and carbohydrate) showed that only the proportion of carbohydrate content of spat was influenced by feeding treatments, with the mean total carbohydrate content of mussels tending to decrease with increasing levels of replacement of live microalgae. The results indicate that both concentrated microalgal feeds (SD and LPB) are effective at replacing live microalgae by up to 50% without compromising the survival and nutritional profile (AFDW, protein, lipid, and carbohydrate content) of juvenile green-lipped mussels and are therefore a useful resource for improving the efficiency of production.</p>","author":"Supono Supono, \nMaria Mugica, \nStefan Spreitzenbarth, \nAndrew Jeffs, \nLiqiao Chen","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"33a7d022ac1ce0c858fd1dd55b116b2c46d05d00bcfbfd28e8804647ea76dca9","category":"Environment"}