{"title":"Feasibility, acceptability, and safety of a novel device for self-collecting capillary blood samples in clinical trials in the context of the pandemic and beyond","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304155","date":1716991200000,"content":"<p>by Harika Dasari, Anna Smyrnova, Jing Leng, Francine M. Ducharme</p>\r\nBackground <p>Home blood self-collection devices can enable remote monitoring, but their implementation requires validation. Our objectives were to explore (i) the impact of sampling sites and topical analgesia on capillary blood volume and pain perception and (ii) the safety, acceptability, and failure of capillary self-collection among adults and children using the Tasso-SST device.</p> Methods <p>We conducted a two-phase study. The <i>investigational phase</i> consisted of two on-site cross-sectional studies in healthy adult participants (≥ 12 years) and children (1–17 years) with their accompanying parent. Adults received 4 capillary samplings, where puncture sites and topical analgesia were randomized in a factorial design, and a venipuncture; children (and one parent) had one capillary sampling. The two co-primary outcomes were blood volume and pain. The <i>implementation phase</i> was conducted in two multicentre trials in participants choosing remote visits; blood volume, collection failure, adverse events, and satisfaction were documented.</p> Results <p>In the <i>investigational phase</i>, 90 participants and 9 children with 7 parents were enrolled; 15 adults and 2 preschoolers participated in the <i>implementation phase</i>. In the adult investigational study, the device collected a median (25%, 75%) of 450 (250, 550) μl of blood with no significant difference between the puncture site, topical analgesia, and its interaction. Using topical analgesia reduced pain perception by 0.61 (95% CI: 0.97, 0.24; <i>P</i> &lt;0.01) points on the 11-point scale; the pain reduction varied by puncture site, with the lower back showing the most significant decrease. Overall, combining all studies and phases, the median volume collected was 425 (250, 500) μl, and the device failure rate was 4.4%; minor adverse effects were reported in 8.9% of the participants, all were willing to use the device again.</p> Conclusion <p>Capillary blood self-collection, yielding slightly less than 500 μl, proves to be a safe and relatively painless method for adults and children, with high satisfaction and low failure rates. The puncture site and topical analgesia do not affect blood volume, but topical analgesia on the lower back could reduce pain.</p>","author":"Harika Dasari","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"33a9f19e1490e70da06b8d2780955f3918e7219cb77ae4839963bcf34b41d1ee","category":"Interdisciplinary"}