{"title":"Characterization, Expression, and Ligand Binding of LGP2 and MDA5 in Largemouth Black Bass Micropterus salmoides (Lacepède, 1802)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/1222592?af=R","date":1686812400000,"content":"<p>Melanoma differentiation-associated gene 5 (MDA5) and the laboratory of genetics and physiology 2 (LGP2) are family members of retinoic acid-inducible gene I (RIG-I)-like receptors (RLRs), which play important roles in the immune response against pathogens invasion. In the present study, MDA5 and LGP2 genes were identified in largemouth bass (<i>Micropterus salmoides</i>), a fish species with a great economic value. The two proteins contained similar conserved domains and motifs as their counterparts of other vertebrates, including the DExDc domain (the DEAD/DEAH box helicases domain), HELICc domain (helicases superfamily domain), and regulatory domain (RD). Real-time qPCR revealed that the two genes were constitutively expressed in tissues of healthy fish and could be induced in the spleen by polyinosinic and polycytidylic acid (polyI:C) challenge <i>in vivo</i>. Also, selective pressure analysis revealed that the negative selection had roles in the evolutions of the two genes. Furthermore, the dsRNA binding mechanism of msLGP2 and msMDA5 were analyzed by the molecular docking strategy. The amino acids of msLGP2 involved in dsRNA binding were V604, N663, L682, and L684, which were located in the regulatory domain (RD) of msLGP2. The amino acids of msMDA5 involved in dsRNA binding were G429, H434, L842, and L845, which were located in the DExDc domain and the RD domain of msMDA5. These results indicated that fish LGP2 and MDA5 might share similar functions and ligand binding mechanism as their mammalian counterparts.</p>","author":"Xiangyu Pi, \nYang Xu, \nYiwen Cao, \nQihuan Zhang, \nZisheng Wang, \nZhitao Qi, \nMohamed Abdelsalam","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"33b3356dd9471115f288385f6e3371fb219d40c47b7070b68c156eb0b864a7e5","category":"Environment"}