{"title":"Apple Asks All U.S. Employees to Share Vaccination Status, Still No Mandate","link":"https://www.macrumors.com/2021/09/01/apple-asks-employees-for-vaccine-status/","date":1630517007000,"content":"Apple this week began asking all of its employees in the United States to provide details on their vaccination status, reports <em><a href=\"https://www.bloomberg.com/news/articles/2021-09-01/apple-asks-all-u-s-employees-to-report-vaccination-status\">Bloomberg</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2018/04/apple-park-416-security.jpg\" />\r\n<br />\r\nEmployees have been asked to voluntarily share whether they have been vaccinated by mid-September, and this applies to both employees working in an office and those working remotely. In a memo, Apple said that its focus is keeping \"team members, their friends and families, and our entire community healthy,\" but also mentioned creating a safe work environment.<blockquote>\"It is possible your vaccination status may be used in an identifiable manner, along with other information about your general work environment such as your building location, if we determine or, if it is required that, this information is necessary in order to ensure a healthy and safe work environment.\"</blockquote>Apple plans to use the responses to inform COVID-19 response efforts and protocols, and according to <em>Bloomberg</em>, the company had already asked for data from employees in California, Washington, and New Jersey in order to comply with local regulations. Vaccine data is being kept confidential with information aggregated and not shared with managers, but that could change in the future.\r\n<br />\r\n\r\n<br />\r\nTech companies like Google and Facebook have mandated vaccines for their employees, but Apple has not done so. Last week, after the Pfizer vaccine received FDA approval, Apple began <a href=\"https://www.macrumors.com/2021/08/27/apple-expands-employee-vaccination-efforts/\">pushing its employees</a> to get vaccinated.\r\n<br />\r\n\r\n<br />\r\nApple has launched an internal web page to encourage vaccines, in addition to sending out memos and holding internal talks as part of a vaccination campaign. Apple is offering vouchers to get employees vaccinated through Walgreens, and it is offering on-site vaccinations in the San Francisco Bay Area and Austin. Paid time off is available for vaccine appointments, as is paid sick leave for those who experience side effects.\r\n<br />\r\n\r\n<br />\r\nThese requests come as Apple is trying to determine when employees will be able to return to in-person work. Apple originally planned to have employees come into the office three days a week starting in September, but due to the delta variant, that has been pushed back until <a href=\"https://www.macrumors.com/2021/08/20/apple-delays-return-to-office-until-january/\">at least January 2022</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/covid-19-coronavirus/\">COVID-19 Coronavirus</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/01/apple-asks-employees-for-vaccine-status/\">Apple Asks All U.S. Employees to Share Vaccination Status, Still No Mandate</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-asks-all-u-s-employees-to-share-vaccination-status-still-no-mandate.2309447/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=7o3WEFEGUTg:JDt68fKntUI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=7o3WEFEGUTg:JDt68fKntUI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/7o3WEFEGUTg\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"33c050a085103158fdc0a8b1ba21a670d1cdac35ebe7536ad6e4e31eb2cd2bc1","category":"Apple"}