{"title":"Ephedrine attenuates LPS-induced M1 polarization of alveolar macrophages via the PKM2-mediated glycolysis","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae166/7816902?rss=1","date":1728518400000,"content":"<span><div>Abstract</div><div>Background</div>Asthma is one of chronic inflammatory lung diseases in world. The important role of macrophage polarization and glycolysis in lung inflammation has attracted considerable attention. Ephedrine (EP) is a compound isolated from Ephedra and plays a regulatory role in inflammatory response, but its role in asthma and mechanism involved are not clear. Therefore, the purpose of this study was to investigate the molecular mechanism and effect of EP on lipopolysaccharide (LPS)-induced alveolar macrophage polarization and glycolysis.<div>Methods</div>We investigated the expression of Tnf-a, Nos2, Il10, and Arg1 using RT-PCR, as well as PKM2 and LDHA protein expression with Western blot. A CCK-8 assay was performed to determine the viability of the cells. The extracellular acidification rate (ECAR), ATP and lactate level were detected using commercial kits.<div>Results</div>The results revealed that EP alleviated LPS-induced NR8383 cell glycolysis and M1 polarization. Further studies found that EP enhanced the effect of 2-DG on NR8383 cell glycolysis and M1 polarization. More importantly, PKM2 inhibitor alleviated LPS-induced NR8383 cell glycolysis and M1 polarization. In addition, EP alleviated LPS-induced NR8383 cell glycolysis and M1 polarization by targeting PKM2.<div>Conclusion</div>It is suggested that EP alleviates LPS-induced glycolysis and M1 polarization in NR8383 cells by regulating PKM2, thereby alleviating lung injury, suggesting the involvment of alveolar macrophage polarization and glycolysis in the role of EP in asthma.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"33c18c2c12f764f01d16db82a1fb2fd844f63f3afef225550f2d2f4e8692075a","category":"Environment"}