{"title":"DEFB119 stratifies dysbiosis with distorted networks in the seminal microbiome associated with male infertility","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae419/7762133?rss=1","date":1726704000000,"content":"<span><div>Abstract</div>Infertility is associated with the alteration of the seminal microbiome. However, the onset of dysbiosis remains controversial and the involvement of host factors remains elusive. This study investigates the alterations of the seminal microbiome in male infertility and examines the association and function of DEFB119, a reproductive-tract-specific host antimicrobial peptide, on the seminal microbiome and male fertility. While we observed comparable genera, diversity and evenness of bacterial communities, a marked decrease in the modularity of the metacommunities was observed in patients with abnormal spermiogram (<span>n</span> = 57) as compared to the control (<span>n</span> = 30). A marked elevation of DEFB119 was observed in a subpopulation of male infertile patients (<span>n</span> = 5). Elevated seminal DEFB119 was associated with a decrease in the observed genera, diversity and evenness of bacterial communities, and further distortion of the metacommunities. Mediation analysis suggests the involvement of elevated DEFB119 and dysbiosis of the seminal microbiome in mediating the abnormalities in the spermiogram. Functional experiments showed that recombinant DEFB119 significantly decrease the progressive motility of sperm in patients with abnormal spermiogram. Moreover, DEFB119 demonstrated species-specific antimicrobial activity against common seminal and nonseminal species. Our work identifies an important host factor that mediates the host–microbiome interaction and stratifies the seminal microbiome associated with male infertility. These results may lead to a new diagnostic method for male infertility and regimens for formulating the microbiome in the reproductive tract and other organ systems.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"33ccdb28de20c31b526e7fb6f6c0ed4f1749fd29095021180c140c2e7e923add","category":"Interdisciplinary"}