{"title":"Enhancing Liver Transplant Outcomes Through Liver Precooling to Mitigate Inflammatory Response and Protect Mitochondrial Function","link":"https://www.preprints.org/manuscript/202405.1357/v1","date":1716275638000,"content":"Transplanted organs experience several episodes of ischemia and Ischemia-reperfusion. The graft injury resulting from ischemia-reperfusion (IRI) remains a significant obstacle to the successful survival of transplanted grafts. Temperature plays an important role in cellular metabolic rates since biochemical reactions are highly temperature dependent. Therefore, ischemia-triggered degradative reactions could be mitigated by lowering temperature. Whether a local hypothermia on liver before blockage of blood flow protects liver grafts against IRI has not been investigated. In this study, we applied local hypothermia to mouse donor livers for a specific duration before stopping blood flow to liver lobes, a procedure called \"liver precooling.\" Mouse donor liver temperature in control groups was controlled at 37ºC. Subsequently, the liver donors were preserved in cold University of Wisconsin solution for various durations followed by orthotopic liver transplantation. Liver graft injury, function and inflammation were assessed at 1- and 2-days post-transplantation. Liver precooling exhibited a significant improvement in graft function, revealing more than a 47% decrease in plasma aspartate transaminase (AST) and alanine aminotransferase (ALT) levels, coupled with a remarkable reduction of approximately 50% in liver graft histological damage compared to the control group. The protective effects of liver precooling were associated with the preservation of mitochondrial function, substantial reduction in hepatocyte cell death, and a significantly attenuated inflammatory response. A retrospective analysis of patient data revealed a close correlation between hypothermia and enhanced liver graft function. Taken together, reduction of the cellular metabolism and enzymatic activity to a minimum level before ischemia protects against IRI during transplantation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"33cc3f43f7445a8fcc898f76402f896ea0cadc9b8ff9305aabc01fc3e9dd451f","category":"Interdisciplinary"}