{"title":"Climate Change Action for Cyclists Part II: What We As Cyclists Can Do  – kait boyle","link":"https://theradavist.com/2021/03/climate-change-action-for-cyclists-part-ii-what-we-as-cyclists-can-do/?utm_source=rss&utm_medium=rss&utm_campaign=climate-change-action-for-cyclists-part-ii-what-we-as-cyclists-can-do","date":1616685040000,"content":"<p><i>This is the second of a two-part series on how human-caused climate change is affecting the cycling experience, why we as cyclists should care about those impacts, and what we can do as individuals and as a community to combat those impacts. Part I of this series connected cyclists to a few examples of the realities of climate change, and Part II here outlines what changes we as cyclists and the cycling community can make to improve the future of our pursuit in a changing climate. </i><b><i>If you only have 5 minutes, jump to the end of this article to read the action items toolbox to quickly learn more about what you can do to make a difference&#8230;</i></b><span id=\"more-207687\"></span></p>\n<p><img loading=\"lazy\" width=\"1400\" height=\"933\" class=\"alignnone size-medium wp-image-207693\" src=\"https://media.theradavist.com/uploads/2021/03/Refsnider-AZtank.jpg?fit=1024,9999&amp;quality=75\" alt=\"\" srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider-AZtank.jpg?w=1400&amp;quality=75 1400w, https://media.theradavist.com/uploads/2021/03/Refsnider-AZtank.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2021/03/Refsnider-AZtank.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2021/03/Refsnider-AZtank.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2021/03/Refsnider-AZtank.jpg?resize=700,467&amp;quality=75 700w\" sizes=\"(max-width: 1400px) 100vw, 1400px\" /></p>\n<p>Our mountain bike and dirt cycling lifestyles are threatened by climate change, and these threats are not going away on their own. In order to prevent catastrophic change to our planet, and our lifestyles, experts have identified a global average of 2°C of warming, and ideally 1.5°C, as a threshold we’d best not exceed. Fortunately, there are realistic pathways to achieve this. These pathways require drastically slashing our greenhouse gas emissions by 45% by 2030 and achieving carbon neutrality by 2050. These goals may seem intangible &#8211; but like any biking goal, with some actionable steps and mini-goals, we can achieve the dream of keeping biking as we know and love it alive.<span class=\"Apple-converted-space\"> </span></p>\n<p>We, as cyclists, can be a part of the solution rather than a part of the problem. How do we go about this? <a href=\"https://protectourwinters.org/\"><span class=\"s1\">Protect Our Winters</span></a>, a nonprofit organization that is dedicated to activating recreationalists toward climate advocacy, identifies three pillars for changing the trajectory of climate change and achieving carbon neutrality: (1) political will, (2) technology and financial incentives, and (3) cultural change. While there are many solutions related to these three pillars, I’ll address the solutions <i>most directly </i>related to cycling. The pillars of climate solutions are used as a framework for the remainder of this article but in practice, each one overlaps and is interconnected with the other two.<span class=\"Apple-converted-space\"> </span></p>\n<p><img loading=\"lazy\" width=\"1400\" height=\"934\" class=\"alignnone size-medium wp-image-207690\" src=\"https://media.theradavist.com/uploads/2021/03/Refsnider-MonValleySmoke.jpg?fit=1024,9999&amp;quality=75\" alt=\"\" srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider-MonValleySmoke.jpg?w=1400&amp;quality=75 1400w, https://media.theradavist.com/uploads/2021/03/Refsnider-MonValleySmoke.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2021/03/Refsnider-MonValleySmoke.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2021/03/Refsnider-MonValleySmoke.jpg?resize=1335,891&amp;quality=75 1335w, https://media.theradavist.com/uploads/2021/03/Refsnider-MonValleySmoke.jpg?resize=700,467&amp;quality=75 700w\" sizes=\"(max-width: 1400px) 100vw, 1400px\" /></p>\n<ol class=\"ol1\">\n<li class=\"li3\">Political Will.<span class=\"Apple-converted-space\"> </span></li>\n</ol>\n<p>Just a month into office in mid-February 2021, the Biden Administration was already assertively moving forward with enacting a climate plan. By means of an executive order, the U.S. rejoined the Paris Climate Accord on January 20th, 2021. In doing so, the United States is agreeing to make strides towards carbon neutrality by 2050 with the goal of limiting global warming to 2°C. He has nominated officials to his administration with climate at the top of their to-do lists, and Biden is implementing plans to conserve 30% of America’s lands by 2030, canceling permits for the Keystone XL pipeline, and pausing oil and gas leasing on public lands. Drilling on public lands is currently responsible for 20-25% of the United State’s carbon emissions, and methane leaking from oil and gas wells is one of the three top sources for greenhouse gasses in the U.S. This is particularly alarming since atmospheric methane has over 50 times the heat-trapping power of carbon dioxide, and thus shuttering the oil and gas drilling on public lands will have a <i>significant </i>impact on reducing methane emissions. <span class=\"Apple-converted-space\"> </span></p>\n<p>Many see divesting from oil and gas extraction on public lands is an immediate win for mountain bikers &#8211; it directly addresses one quarter of our carbon emissions while improving our experiences on the landscapes the majority of our trails traverse. Remember, it was just a year ago that<a href=\"https://www.outsideonline.com/2409683/slickrock-utah-saved-drilling\"><span class=\"s1\"> outcry from the recreation community</span></a> saved Moab’s famed Slickrock Trail area from oil and gas leasing.<span class=\"Apple-converted-space\"> </span></p>\n<p>While the Biden Administration&#8217;s actions are signaling the intention to tackle climate change from the top, it will require the support of Congress and state and local governments to enact such a dedicated agenda. As a cyclist, you can help make gains in policies crafted for reducing emissions by encouraging your representatives at both the national and local levels to support climate policies. And of course, during future elections, use your vote to promote climate action.<span class=\"Apple-converted-space\"> </span></p>\n<p><img loading=\"lazy\" width=\"1400\" height=\"934\" class=\"alignnone size-medium wp-image-207691\" src=\"https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-26.jpg?fit=1024,9999&amp;quality=75\" alt=\"\" srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-26.jpg?w=1400&amp;quality=75 1400w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-26.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-26.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-26.jpg?resize=1335,891&amp;quality=75 1335w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-26.jpg?resize=700,467&amp;quality=75 700w\" sizes=\"(max-width: 1400px) 100vw, 1400px\" /></p>\n<p><strong>Technological Solutions &amp; Financial Incentives.</strong></p>\n<p>The single largest carbon emission source from the U.S. is from combustion engine vehicles, including our own vehicles and how much we travel. The Biden Administration will impose fuel economy standards for cars and drive policies towards technological solutions to reduce emissions from combustion engines. Within the auto industry General Motors just announced their commitment to phase out <i>all</i> gas and diesel engines (replacing them with electric vehicles) by 2035. If you’re not in a place to invest in an electric vehicle, you can use your voice and advocate for public transportation to be converted to electric vehicles.<span class=\"Apple-converted-space\"> </span></p>\n<p>For mountain-bike-driven economies, Tony Ferlisi, the former Executive Director of Mountain Bike the Tetons, dreams of seeing mountain bike towns investing in electric public transit to shuttle cyclists from town to trailheads. Many ski resort towns offer a public transportation option to go to and from ski areas, so it is logical that mountain bike destinations can implement the same service with technology that is reducing the carbon footprint of cyclists getting to trailheads. With this service, Tony explains, cyclists can take public transportation to a destination and access trails without needing to rent a car or drive their car once they arrive. This obviously won’t work everywhere, but it can for popular riding destinations.</p>\n<p>Beyond travel, the cycling industry and community can take steps to decrease the carbon footprint of the products that support cyclists and cycling. Ferlisi encourages cyclists as consumers to do their research about what companies are actively working to reduce their carbon footprint in production. As the consumer, <i>you</i> can advocate for your favorite brands to step up their game in achieving carbon neutrality through production and you can support policies that will incentivize brands to do so. Patagonia and Pearl Izumi are both examples of U.S.-based brands that are actively seeking creative ways to manufacture clothing more sustainably. Patagonia takes it a step further by imposing a 1% “Earth Tax” on itself which the company donates to environmental nonprofits and offers the resale of recycled and repaired clothing through their Worn Wear program. The take-away &#8211; when choosing a product to purchase, we often weigh the design, weight, reviews, color, price, and function. Moving forward, I encourage us all to seek out purchases from companies that are working to reduce waste, support production with green energy, and produce locally whenever possible.</p>\n<p>Ferlisi adds, <i>“</i>As mountain bikers, we&#8217;re consumers, and our sport is consumer dependent. Yeah, we can get mountain bikers to trails without cars, but we also need to change how we consume. Mountain bikers need to be more responsible consumers. Do your research before buying the bike, helmet, shoes; go on their website to see what they&#8217;re doing to be more responsible producers. Let’s get more out of our gear before buying the flashy new thing.”<span class=\"Apple-converted-space\"> </span></p>\n<p><img loading=\"lazy\" width=\"1400\" height=\"933\" class=\"alignnone size-medium wp-image-207692\" src=\"https://media.theradavist.com/uploads/2021/03/Refsnider-OZ-fire.jpg?fit=1024,9999&amp;quality=75\" alt=\"\" srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider-OZ-fire.jpg?w=1400&amp;quality=75 1400w, https://media.theradavist.com/uploads/2021/03/Refsnider-OZ-fire.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2021/03/Refsnider-OZ-fire.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2021/03/Refsnider-OZ-fire.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2021/03/Refsnider-OZ-fire.jpg?resize=700,467&amp;quality=75 700w\" sizes=\"(max-width: 1400px) 100vw, 1400px\" /></p>\n<p>Although technologies to travel and consume with less impact are important, there are also steps that must be taken to sustain the landscape that are being impacted by an irreversibly changing climate. The Arizona Trail Association (ATA) is approaching technological solutions to climate change through the lens of land management and stewardship. Matt Nelson, the Executive Director of the ATA is witnessing the impacts of a hotter, drier climate in Arizona already. The Arizona Trail (AZT) is a technical and challenging through-hike or -ride in part due to the scarcity of water in the desert landscape. Matt is witnessing water sources drying up, posing an increased threat to both wildlife and trail users.<span class=\"Apple-converted-space\"> </span></p>\n<p>Understanding that the long-term sustainability of the AZT relies on people’s ability to experience it safely, Nelson has initiated an innovative solution to addressing drying water sources: rainwater collectors. “It features a steel apron that catches rainwater and stores the precious resource within a 1,500-gallon tank that is protected on all sides by steel panels. A spigot with an automatic shutoff valve allows trail users to fill their bottles. Once the tank is full, an overflow pipe fills a steel water trough nearby for the benefit of wildlife. The entire unit is fenced to keep livestock out, and posted signs inform trail users that the water must be filtered before consumption,” explains Nelson. Furthermore, Nelson has watched the duration of<span class=\"Apple-converted-space\">  </span>Arizona’s “volatile” wildfire season expand beyond the once-typical May-to-August span. Wildfires and subsequent trail closures are now becoming a major issue between March and October, so the ATA is supportive of selective thinning and prescribed burning to decrease the proclivity of the landscape to combustion and trail destruction. But Nelson adds that “the U.S. Forest Service doesn’t have the resources to manage forest health projects. It needs massive public involvement to work &#8211; we need to see the public more involved in public lands.”<span class=\"Apple-converted-space\"> </span></p>\n<p>So although there are viable technological solutions to managing the lands we ride on, they can’t and shouldn’t be solely in the hands of the land management agencies. We recreate on land stolen from Native people who have been sustainably stewarding the landscape for thousands of years. As we consider ways to manage forests, sustain water sources, and treat the landscape as a living organism, Nelson highlights the potential for success by returning management and co-management of the lands to Native people: <i>“</i>If traditional North American Native land management practices are accepted on some level I think that we could see some really positive results.”<span class=\"Apple-converted-space\"> </span></p>\n<p><span class=\"s2\">When one considers that currently 80% of Earth’s biodiversity is supported and nurtured by Indigenous people on just 20% of the world’s land surface, it should be obvious that advocating for Indigenous rights and leadership in land management is an incredibly powerful tool for stewarding the landscape. The recent confirmation of Deb Haaland as Interior Secretary, making her the first Native Cabinet Secretary in U.S. history, could be a big step in that direction. </span>Co-management of forests and wildfire between state, federal, and Tribal leaders offers the future of the Western landscape a glimmer of hope. Indigenous groups have been practicing ceremonial and traditional burning to mitigate extreme wildfires and cultivate desired plants for harvesting and attracting game. After 200 years during which traditional burning has been banned, allowing tribes to return to their ancestral lands to practice controlled burning is an opportunity for co-management of forests. ⁠The Karuk and Yurok tribes in northern California have already partnered with the Forest Service to manage lands for traditional purposes concurrently with wildfire management. Let’s vocally support more collaborations like this to support the future health of landscapes and public lands. ⁠</p>\n<p><img loading=\"lazy\" width=\"1400\" height=\"933\" class=\"alignnone size-medium wp-image-207688\" src=\"https://media.theradavist.com/uploads/2021/03/Refsnider_ColoradoTrailFire-7.jpg?fit=1024,9999&amp;quality=75\" alt=\"\" srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider_ColoradoTrailFire-7.jpg?w=1400&amp;quality=75 1400w, https://media.theradavist.com/uploads/2021/03/Refsnider_ColoradoTrailFire-7.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2021/03/Refsnider_ColoradoTrailFire-7.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2021/03/Refsnider_ColoradoTrailFire-7.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2021/03/Refsnider_ColoradoTrailFire-7.jpg?resize=700,467&amp;quality=75 700w\" sizes=\"(max-width: 1400px) 100vw, 1400px\" /></p>\n<p><strong>Cultural Change.<span class=\"Apple-converted-space\"> </span></strong></p>\n<p>Political will occurs through how you vote and use your voice to advocate. Technological and financial solutions are related to policies and how you invest your money. Finally, cultural change is an opportunity for us to evaluate and shift our own behaviors. Behaviors are actions inspired by commonly accepted standards and values. It is proven that if we continue pursuing mountain biking like business as usual, our business (mountain biking) experience will decline from the impacts of climate change. Thus, we have a great opportunity to shift some of our behaviors to mitigate our impacts on the climate. That shift will be most powerful if individual action demands collective action as a community and our standards as cyclists shift. This section will examine some of the most significant ways we as cyclists can change our behaviors to support climate change.</p>\n<p>So, yes, there are political and technological solutions that <i>will </i>drive reducing carbon emissions from transportation. But that won’t happen immediately, and we as cyclists have the ability to make immediate change <i>aboard our bikes</i>. Bikes have the potential to be a powerful alternative to fossil fuel-powered vehicles, but “one less car” is a misleading claim if the bike is largely transported to where it is ridden. Integrating more time riding from home, riding locally, or spending more time in one place rather than making multiple longer trips to ride are all ways to truly attain “one less car.” Yes, riding a mountain bike on paved roads is not why most of us ride, and for many it may not be safe to do so. But for many I know personally, sometimes on dirt can be substituted for riding to and from trailheads, or even one ride per week or month could be on roads from home rather than commuting to a place to ride.<span class=\"Apple-converted-space\"> </span></p>\n<p>Bikepacking also offers an incredible opportunity for recreating in a true “one less car” ethos. For your next bikepacking trip, consider riding from home, taking public transportation to start a route, and riding from the bus or train station. Nelson agrees that traveling to a trail and spending days, weeks, or months moving under human power has a more positive impact than most car-based road trips. Ferlisi adds that “there is a bright future in some places for e-MTBs. The shuttle culture is one way to have a significant impact; if you permit e-bikes on those trails, there are more folks who are riding up Old Pass Road [instead of driving] and then riding the trails. And when e-bikes are permitted on pathways, there are fewer folks commuting by car.”<span class=\"Apple-converted-space\"> </span></p>\n<p>Other ways to consider the power we have as cyclists to reduce our emissions from driving is to commute to work or the grocery store by bike. Bikepacking bags or a simple rack system can carry a surprising amount of food or gear, and this shift in routine not only reduces the miles driven by car but also doubles as a workout. Although e-bikes have their own notable footprint from batteries, it is arguable that commuting by e-bike is a better alternative to driving a fossil fuel-powered vehicle.<span class=\"Apple-converted-space\"> </span></p>\n<p>From my own experience, I know that it’s easy to narrate excuses for not commuting by bike, but ultimately there are creative solutions around all of my excuses. I can choose to take a longer, quieter route to bypass the dangerous roads. I can pre-pack my gear and prepare my bike the night before to reduce the transition time. I can store a change of clothes at work or carry it with me. I can outfit my bike with the luggage to carry my stuff. I can plan my time to integrate a pleasant, no-rush commute that doubles as my workout. And I can remind myself that I don’t need to commute by bike every day (if you can, great!), but even one day per week adds up.<span class=\"Apple-converted-space\"> </span></p>\n<p>Riding to trails to minimize drive time is unfortunately not realistic for people living in many population centers. But one thing the Covid-19 pandemic has illuminated is the immense value of trails close to home. Programs such as IMBA’s Trails Accelerator Grants bring trails closer to communities across the country, and as mountain bikers, we can advocate for these projects to both increase access to biking while also improving our impact on climate by reducing the need for commuting farther distances by car to ride a bike. Trails closer to home also increases opportunities to recreate locally and take fewer longer trips. If you have trails in your local area, consider taking fewer weekend trips away from home and creating new-to-you routes or organizing a group ride that starts and ends in town.</p>\n<p><img loading=\"lazy\" width=\"1400\" height=\"934\" class=\"alignnone size-medium wp-image-207695\" src=\"https://media.theradavist.com/uploads/2021/03/WarmSprings_Refsnider_reduced-1.jpg?fit=1024,9999&amp;quality=75\" alt=\"\" srcset=\"https://media.theradavist.com/uploads/2021/03/WarmSprings_Refsnider_reduced-1.jpg?w=1400&amp;quality=75 1400w, https://media.theradavist.com/uploads/2021/03/WarmSprings_Refsnider_reduced-1.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2021/03/WarmSprings_Refsnider_reduced-1.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2021/03/WarmSprings_Refsnider_reduced-1.jpg?resize=1335,891&amp;quality=75 1335w, https://media.theradavist.com/uploads/2021/03/WarmSprings_Refsnider_reduced-1.jpg?resize=700,467&amp;quality=75 700w\" sizes=\"(max-width: 1400px) 100vw, 1400px\" /></p>\n<p><strong>Summarizing &#8211; it’s up to us.</strong></p>\n<p>On mountain bike culture, Nelson points out that “ultimately, it’s peoples’ connection to the land. Be a little bit more involved. What you think is yours to ride on and these lands that you&#8217;re used to going out and enjoying may not be. They might be closed, burned, sold &#8211; all these things are possible. What we need is more people who are connected to the landscape to be stewards. Increase our consciousness around stewardship and engagement. We&#8217;ll actualize our responsibility to care for the places we love. We’re in a critical time. I think all of us need to make sacrifices. We need to look at the landscape as an organism, not something to be harvested or mined or ridden on but like an interconnected organism that we’re a part of, and if something is hurt or bruised, we need to reduce the stress on that.”</p>\n<p>At the heart of the greatest crisis facing the planet, we as cyclists have the power to make a difference. We’re skilled at identifying a goal, making a plan, and getting results. We know how beautiful the world is and what the landscape offers us. We feel it, breathe it, smell it, hear it, and taste it on every ride. Yes, political action will make the single largest impact on driving a climate agenda toward enaction. But political action goes beyond showing up at a presidential election every four years. Political action is showing up at <i>all</i> the elections, being involved in local government, writing or calling your elected officials at all levels, and engaging on this topic with friends, family, and community.<span class=\"Apple-converted-space\"> </span></p>\n<p>How you support technological solutions comes down to where you chose to spend your money, how you use your vote, how you pressure policymakers and industries (including the cycling industry) to invest in climate solutions and reduce our collective impact as cyclists and inhabitants on Earth.<span class=\"Apple-converted-space\"> </span></p>\n<p>Culture is hard to change, but individual action matters in driving cultural change. We are social creatures who respond to social cues and pressure. Let’s encourage leaders in the cycling community &#8211; the media, athletes, influencers, and brands &#8211; to lead by example. What if there was a monthly commute-by-bike day? Strava crown for riding from home? Recognition for shuttling without fossil fuels? If patched, repaired gear is as celebrated as #newbikeday? I think cyclists and runners have the potential to adjust their cultural norms to be among the most climate-sensitive user groups in the world; we as cyclists just have some adjustments to make. How you opt to make a difference is your choice, but fortunately, there is something for everyone: you can use your voice, your writing, your social media, your texting, your wallet, your conversing, your engineering, and problem solving, or your body. In that way, our actions will be the strongest collectively, and this article serves to beg us all to do <i>something</i> for the experience that we all hold dear &#8211; riding a bike in the places that we love.<span class=\"Apple-converted-space\"> </span></p>\n<p><img loading=\"lazy\" width=\"1400\" height=\"934\" class=\"alignnone size-medium wp-image-207689\" src=\"https://media.theradavist.com/uploads/2021/03/Refsnider_AZTwatercatchment.jpg?fit=1024,9999&amp;quality=75\" alt=\"\" srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider_AZTwatercatchment.jpg?w=1400&amp;quality=75 1400w, https://media.theradavist.com/uploads/2021/03/Refsnider_AZTwatercatchment.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2021/03/Refsnider_AZTwatercatchment.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2021/03/Refsnider_AZTwatercatchment.jpg?resize=1335,891&amp;quality=75 1335w, https://media.theradavist.com/uploads/2021/03/Refsnider_AZTwatercatchment.jpg?resize=700,467&amp;quality=75 700w\" sizes=\"(max-width: 1400px) 100vw, 1400px\" /></p>\n<p><strong>The Cyclists Climate Change Action Toolbox:</strong></p>\n<p><em>Call/write your elected officials. <a href=\"https://www.usa.gov/elected-officials\"><span class=\"s1\">Here’s how</span></a>. Encourage them to support climate action:<br />\n</em><span class=\"Apple-converted-space\"><br />\n-Stop oil and gas drilling on public lands to reduce methane leaks.<span class=\"Apple-converted-space\"> </span><br />\n-Enact policy to drastically cut emissions from combustion engine cars and support electric vehicle technologies.<span class=\"Apple-converted-space\"> </span><br />\n&#8211;<span class=\"s2\"><a href=\"https://www.outdooralliance.org/blog/2020/1/30/a-climate-initiative-the-outdoor-community-needs-to-get-behind\"><span class=\"s1\">Support the 30&#215;30 resolution</span></a>.<span class=\"Apple-converted-space\"> </span></span><br />\n-Get involved and stay involved with climate politics and organizations. <a href=\"https://www.outdooralliance.org/sign-up\"><span class=\"s1\">Outdoor Alliance</span></a> and <a href=\"https://protectourwinters.org/take-action/\"><span class=\"s1\">Protect Our Winters</span></a> are recreation-minded climate conservation groups that will keep you updated and share important calls to action.<span class=\"Apple-converted-space\"> </span><br />\n-Discover the size of <i>your</i> carbon footprint <a href=\"https://protectourwinters.org/cost-of-carbon/\"><span class=\"s1\">here</span></a> or <a href=\"https://www.nature.org/en-us/get-involved/how-to-help/carbon-footprint-calculator/\"><span class=\"s1\">here</span></a>.<span class=\"Apple-converted-space\"> </span><br />\n-Ride from home, a little more.<span class=\"Apple-converted-space\"> </span><br />\n-Stay longer when you travel and travel less.<span class=\"Apple-converted-space\"> </span><br />\n-Commute by bike [a little more].<span class=\"Apple-converted-space\"> </span><br />\n-Buy locally and/or from brands who source sustainably made products and technologies<br />\n-Use an electric or fuel-efficient vehicle.<span class=\"Apple-converted-space\"> </span><br />\n-Buy used bikes and gear and replace equipment only when you need to.<span class=\"Apple-converted-space\"> </span><br />\n-Encourage land managers to collaborate with Indigenous communities.<br />\n-Bikepack from home or use public transportation.<span class=\"Apple-converted-space\"> </span><br />\n-Share your climate action choices.<span class=\"Apple-converted-space\"> </span><br />\n-Talk about climate change and action. Avoid debating. Simply engage people and ask open-ended questions. Ask, “<i>How is climate change impacting you</i>?”<br />\n-Get involved with public lands &#8211; join a trail advocacy organization and participate in trail stewardship.<span class=\"Apple-converted-space\"> </span><br />\n-Join trail building projects close to your home.<span class=\"Apple-converted-space\"> </span><br />\n-Initiate electric public transit project to service trailheads.<span class=\"Apple-converted-space\"> </span><br />\n-Initiate cultural change within cycling!<span class=\"Apple-converted-space\"> </span><br />\n&#8211;<a href=\"https://climate.nasa.gov/evidence/\"><span class=\"s1\">Learn more </span></a>about climate change.<span class=\"Apple-converted-space\"> </span></span></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"33e0b72ceef7723f95bb838ef48bcc319ba6f8a04070fc1fb0f21cf6e4f30e59","category":"Cycling"}