{"title":"Strade Bianche Donne 2023 - predictions and contenders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-donne-2023-predictions-and-contenders","date":1677832200000,"content":"\n      <p><span>The star names of the Women’s WorldTour are set to be on the start line of the seventh Strade Bianche Donne this weekend, with the likes of Annemiek van Vleuten (Movistar), Lotte Kopecky, Demi Vollering (both SD Worx)</span><span> and Kasia Niewiadoma (Canyon//SRAM) all set to battle it out to take the title. </span></p>\n<p><span>The race will start in Siena and take on the dusty white roads of Tuscany as the peloton races over the 136km route. The route is made up of eight gravel sections and six climbs, including the traditional 16% climb up to the finish line at the Piazza del Campo in Siena. </span></p>\n<p><span>Kopecky won the 2022 edition of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/men-s-strade-bianche-2023-predictions-and-contenders\">Strade Bianche</a> Donne, beating Movistar's Van Vleuten in the final sprint to the finish line. In the previous edition in 2021, <span>Chantal Van den Broek-Blaak attacked with 2km to go and crossed the line first with Italian rider Elisa Longo Borghini just seven seconds behind her. </span></span></p>\n<p>Defending champion Kopecky will be back again this year in hopes of winning the Classic for a second year running, but with a number of former champions on the start line, it'll be a close fought edition.</p>\n<p>Here are our key contenders and predictions for the Strade Bianche Donne 2023.</p>\n<h3>Lotte Kopecky </h3>\n<p>Team SD Worx will have multiple cards to play at Strade Bianche this year with their roster of strong riders, but one key rider who will be looking to race hard is the 2022 Strade Bianche champion Lotte Kopecky. Having only raced it once before in 2021, last year she stormed to victory ahead of world champion Van Vleuten in just her second attempt. </p>\n<p>Opening her racing season at Omloop Het Nieuwsblad last weekend, Kopecky and her team signalled their strength as she won following an impressive solo attack, closely followed by her teammate and sprinting sensation Lorena Wiebes in second. As a result, Kopecky will be going into this weekend's race with supreme confidence. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1380216975.jpg?v=1677762407\" alt=\"Lotte Kopecky at the 2022 STRADE BIANCHE Donne \" /></p>\n<h3>Demi Vollering</h3>\n<p>Kopecky is not the only rider from the SD Worx team who could potentially win this year's race, with Demi Vollering on the start line too. While she placed outside of the top 10 in last year's edition, she'll no doubt be eyeing a major Classics victory already this year to rectify a string of second and third places in 2022, and Strade Bianche could be an ideal opportunity.</p>\n<p>Last year, Brabantse Pijl was her only trip to top of the podium, with second places at Amstel Gold and Omloop Het Nieuwsblad compounded by third places at Flèche Wallonne and Liège-Bastogne-Liège.</p>\n<p>A career best of sixth placed at Strade Bianche belies the Dutchwoman's obvious talent in the Classics, and with such a strong team around her she may have her best chance yet to win here.</p>\n<p> </p>\n<h3><b>Kasia Niewiadoma </b></h3>\n<p><span>Kasia Niewiadoma has been a constant in the women’s WorldTour, and is always on the list of top contenders for pretty much all the Classics. But despite her attempts to be on top of the podium, the Polish rider always seems to just miss out. It was the same story for her last year when she finished fourth at the 2022 edition of Strade Bianche. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1469531091.jpg?v=1677762284\" alt=\"Kasia Niewiadoma racing at the 2023 Omloop Het Nieuwsblad\" />She opened her season last week in Belgium at Omloop Het Nieuwsblad but failed to finish inside the top 10. Despite her team Canyon//SRAM failing to make a statement last weekend, Strade Bianche is a key race for Niewiadoma and one she hopes to eventually win, if things can go to plan. When the Polish rider<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/kasia-niewiadoma-canyon-sram-will-race-differently-to-win-2023\"> spoke to <em>Rouleur</em> back in November 2022</a>, she explained she had the most to prove when it came to Strade Bianche, having previously finished second three times before. With her eyes firmly on the prize, Saturday's race is her main goal for 2023.</span></p>\n<p>Having shown such high levels of consistency over her professional cycling career and with the likes of Elise Chabbey and Tiffany Cromwell by her side, perhaps this year could be the year for Niewiadoma to finally reach that top step. </p>\n<h3><b>Annemiek van Vleuten </b></h3>\n<p><span>Annemiek van Vleuten remains the woman to beat in the women’s peloton, dominating the season last year at the age of 39. She hasn't quite started the 2023 season off on the best foot, with an untimely flat tyre before the decisive Muur van Geraardsbergen last weekend at Omloop and a rocky opening race in Spain at the Setmana Valenciana Fèmines, where she finished fourth. </span></p>\n<p><span>Before her unfortunate mechanical last weekend at Omloop however, Movistar looked to be performing well as a team in the run up to the Muur and if Van Vleuten hadn’t punctured, it could have been a much closer battle between Movistar and SD Worx for the win. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1380235853.jpg?v=1677761948\" alt=\"Annemiek Van Vleuten at Strade Bianche Donne 2022\" /><span>The Dutch rider will be looking to make her mark on the 2023 season, her last as professional, and having previously won Strade Bianche before in 2020 and 2019, Van Vleuten will have the experience of taking on the course and the experience of how to handle the gravel sections. However, with others on the start line holding similar experience</span>, she’ll have to bring back some of her scintillating 2022 form if she is to challenge her rivals. </span></p>\n<h3>Ashleigh Moolman-Pasio</h3>\n<p>The South African rider has had a strong start to 2023, already taking a stage win  ahead of Van Vleuten at the Volta Comunitat Valenciana Fémines. Moolman-Pasio came third in last year's Strade Bianche behind Kopecky and Van Vleuten and has finished inside the top 10 several times since 2015. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1467336715.jpg?v=1677763964\" alt />The AG Insurance-Soudal Quick-Step rider intended to retire at the end of the last year's season but instead decided to take on another year as a professional rider, perhaps giving her a renewed sense of confidence to keep pushing during these races. What will also bolster her confidence is the freedom she now has at her new team compared to when she was riding for her former team SD Worx.</p>\n<h3><b>Other contenders</b></h3>\n<p>Team UAE ADQ could be in with a chance with <strong>Silvia Persico</strong> on their roster of riders taking part in this year's race. Her season so far has started well and has included the Women's UAE Tour, where she placed third overall in the general classification. Persico also came third during stage three of the UAE Tour, which ended on the gruelling Jebel Hafeet climb. </p>\n<p>Another Movistar rider who could be in contention if Van Vleuten finds herself in trouble could be <strong>Liane Lippert</strong>. She has had a steady start to the season so far taking part in several races and demonstrated her potential when she launched a powerful attack on the Bosberg last week. If she can stay at the front of the race in the lead-up to the final climb, this is where she could really shine. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1469522427.jpg?v=1677776238\" alt />Trek-Segafredo rider <strong>Amanda Spratt</strong> may also be one to watch at this year's Strade Bianche as she has had a few top 10 finishes for this race. She already has a number of races under her belt this season including the women's Tour Down Under where won the mountains classification. </p>\n<p>Having just missed out on a podium finish in the last two years by coming fifth in 2022 and 2021, <strong>Cecile Uttrup Ludwig</strong> may be knocking on the door for a Strade Bianche win this year. So far she has raced well this season finishing 20th at Omloop Het Nieuwsblad and 10th in the general classification at the Volta Comunitat Valenciana Fèmines. Could it finally be a podium finish for the FDJ-Suez rider? </p>\n<h3><b>Strade Bianche Donne 2023 prediction</b></h3>\n<p>We're backing Kasia Niewiadoma to finally win Strade Bianche Donne in 2023. With a fire alight in her belly and her eyes firmly on the prize, we think her and her team will be be bringing their A-game to the race in the hopes of delivering a result.</p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"33e9215c1527991b2b6ffea4c23e73710b6eb42b6c83c1c5fe784d5b0abf7ddd","category":"Cycling"}