{"title":"Development and validation of a practical score to predict 3-year distant metastatic free survival in nasopharyngeal carcinoma incorporating the number of lymph node regions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309436","date":1724767200000,"content":"<p>by Thitiporn Jaruthien, Chawalit Lertbutsayanukul, Nutchawan Jittapiromsak, Aniwat Sriyook, Prapasri Kulalert, Pichaya Tantiyavarong, Sarin Kitpanit, Danita Kannarunimit, Chakkapong Chakkabat, Anussara Prayongrat</p>\r\nIntroduction <p>The improvement in diagnosis and treatment for nasopharyngeal carcinoma (NPC) has shifted the pattern of failure toward distant metastasis. This study aimed to develop a simplified prognostic scoring model to predict distant metastatic free survival (DMFS) for NPC patients.</p> Materials and methods <p>Patients with non-metastatic NPC were identified from a retrospective cohort diagnosed between 2010 and 2018. Flexible parametric survival analysis was used to identify potential predictors for DMFS and establish a scoring model. The prognostic accuracy between the 8<sup>th</sup> AJCC system and the scoring model was compared using Harrell’s C-index.</p> Results <p>Of the total 393 patients, the median follow-up time was 85 months. The 3-year DMFS rate was 83.3%. Gender, T-stage, pre-EBV (cut-off 2300 copies/ml), and the number of metastatic lymph node regions were identified as independent risk factors for distant metastasis and were included in the final scoring model. Our established model achieved a high C-index in predicting DMFS (0.79) and was well-calibrated. The score divided patients into two categories: low-risk (score 0–4) and high-risk (score 5–7), corresponding with the predicted 3-year DMFS of 96% and 64.5%, respectively.</p> Conclusions <p>A feasible and applicative prognostic score was established and validated to discriminate NPC patients into low- and high-risk groups.</p>","author":"Thitiporn Jaruthien","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"33f930a434e5b979ec1150f55aae6ad7e036ed826c25dc997431d56072f2555f","category":"Interdisciplinary"}