{"title":"Alder expansion stimulates nitrogen oxide (NOx) emissions from southern Eurasian permafrost peatlands","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17368?af=R","date":1717761826000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/7faf387b-3ba5-46ee-8cfb-2bc4968d8951/gcb17368-toc-0001-m.png\" alt=\"Alder expansion stimulates nitrogen oxide (NOx) emissions from southern Eurasian permafrost peatlands\" />\n<p>This study conducts the first in situ measurements of nitrogen oxide (NO<sub>x</sub>) fluxes in the southern Eurasian permafrost region over 2 years and uncovers that peatlands are unexpectedly significant NO<sub>x</sub> sources with the tremendous spatial variability within sub meter scales caused by the hummock-hollow microtopography. Alder expansion greatly stimulates NO<sub>x</sub> emissions from the peatlands and accelerates permafrost degradation.</p>\n<br />\n<h2>Abstract</h2>\n<p>Nitrogen oxides (NO<sub>x</sub>) play an important role for atmospheric chemistry and radiative forcing. However, NO<sub>x</sub> emissions from the vast northern circumpolar permafrost regions have not been studied in situ due to limitations of measurement techniques. Our goals were to validate the offline analytical technique, and based on this, to widely quantify in situ NO<sub>x</sub> emissions from peatlands in the southern Eurasian permafrost region. To this end, we conducted a comparison of online and offline flux measurements in 2018 and 2019 using the synthetic air flushing, steady-state opaque chamber method. With differences in annual average and cumulative fluxes less than 0.1 μg N m<sup>−2</sup> h<sup>−1</sup> and 0.01 kg N ha<sup>−1</sup> year<sup>−1</sup>, the online and offline fluxes were in good agreement, demonstrating the feasibility of conducting offline measurements in remote regions without power supply. The flux measurements over 2 years showed obvious NO<sub>x</sub> emissions of 0.05–0.14 and 0.13–0.30 kg N ha<sup>−1</sup> year<sup>−1</sup> in the hollow and hummock microtopography of permafrost peatlands, respectively. The rapid expansion of alder (<i>Alnus sibirica</i>) in the peatlands induced by permafrost degradation significantly increased soil mineral N contents and NO<sub>x</sub> emissions depending on the age of alder (0.64–1.74 and 1.44–2.20 kg N ha<sup>−1</sup> year<sup>−1</sup> from the alder forests with tree ages of 1–10 years and 11–20 years, respectively). Alder expansion also intensively altered the thermal state of permafrost including the sharp increases of soil temperatures during the non-growing season from October to April and active layer thickness. This study provides the first in situ evidences of NO<sub>x</sub> emissions from the northern circumpolar permafrost regions and uncovers the well-documented expansion of alders can substantially stimulate NO<sub>x</sub> emissions and thus, significantly affect air quality, radiative forcing, and ecosystem productivity in the pristine regions.</p>","author":"Chunyan Liu, \nHongyu Yue, \nWei Zhang, \nZhisheng Yao, \nYuepeng Pan, \nXianwei Wang, \nChangchun Song, \nKlaus Butterbach‐Bahl, \nMichael Dannenmann","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"34006c941b60c979eac5f9bd2420048d1686d4f169949e4ef7f06070dc30e567","category":"Environment"}