{"title":"Differences in need for and access to eye health services between older people with and without disability: A cross-sectional survey in four districts of northern Uganda","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003645","date":1725976800000,"content":"<p>by Emma Jolley, Calum Davey, Stevens Bechange, Gladys Atto, Denis Erima, Ambrose Otim, Juliet Sentongo, Anthony Wani, Tesfaye Adera, Moses Kasadhakawo, Hannah Kuper</p>\r\n\r\nEye health and disability are both common among older people, and it is important to understand how disability relates to visual health status and access to services. While people with disabilities face barriers to accessing health services, few studies have measured participants’ functional status in domains other than vision and little evidence exists on how disability impacts eye health services access. This paper describes how visual impairment and access to eye health services differ between people aged 50 years and above with and without disability in Karamoja, Uganda, and explores the factors driving that difference. This was a cross-sectional survey among individuals aged 50 years and above. A standardised eye health survey was conducted, with additional questions on personal and health characteristics. Ophthalmologists conducted a vision examination, and recorded participants’ self-reported functional difficulties using the Washington Group Short Set Enhanced. Descriptive analyses were conducted using Stata, and multivariate models constructed to explore relationships. 21.7% of respondents self-reported some sort of functional difficulty. Twenty-five percent of individuals with a non-visual functional difficulty are also blind, and a further 29% experience a lower level of VI. In a multivariate model, blindness was associated with self-reported difficulties seeing, but not any other type of difficulty. Blindness was also associated with age, not being married, and living in a smaller household. Access to cataract surgery was associated with non-visual functional difficulties, male gender, and having a regular household income. This study confirms that in the study area, disability and visual impairment are common among people aged 50 years and above, access to eye health services is low, and self-reported functional difficulties are not associated with lower access to services.","author":"Emma Jolley","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"340699f2621b1e6c26cbfbd3188b103f2182f05f0c39c1d1537beb48761c7e4a","category":"Environment"}