{"title":"Tree species richness suppresses red imported fire ant invasion in a subtropical plantation forest","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2664.14786?af=R","date":1727173476000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/bc024bb5-1b9d-4f9d-97b8-1346e3456a73/jpe14786-toc-0001-m.png\" alt=\"Tree species richness suppresses red imported fire ant invasion in a subtropical plantation forest\" />\n<p>Our findings demonstrate that the ecological resistance to RIFA invasion is influenced by tree species richness in a complex manner; specifically, the relative strengths of the effects of tree species characteristics, native competitors and environmental conditions are likely to impact the power of ecological resistance. This highlights the importance of cross-trophic interactions underlying the resistance of complex ecosystems to alien species invasion; therefore, maintaining diverse tree communities in controlled systems (e.g. suburban and urban green spaces) should be viewed as a potential strategy for controlling RIFA invasion.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe ecological resistance to the invasion of alien species has been extensively researched at the within-trophic level; however, the effect of cross-trophic interactions remains largely unknown. The red imported fire ant (RIFA, <i>Solenopsis invicta</i>) is a globally invasive species, and a cross-trophic interaction study between RIFAs and plants may provide a more comprehensive understanding and management of its invasion.\n\nWe hypothesized that the diversity of trees, which are the primary producers supporting terrestrial ecosystems, could suppress the invasion of omnivorous RIFAs by regulating food resources (e.g. plants and arthropods) and the microenvironment (e.g. soil microclimate) as well as enhancing competition with other carnivorous ants. To test this hypothesis, we investigated RIFA abundance and mound numbers across tree species richness gradients in a subtropical plantation forest.\n\nUsing structural equation models, we discovered that tree species richness had contrasting effects on RIFA abundance and mound numbers. RIFA abundance directly decreased with higher tree species richness because of the dilution effect (i.e. lower abundance of preferred tree species). In contrast, RIFA mound numbers indirectly increased with tree species richness via an increase in arthropod abundance (excluding ants) (i.e. more ample food resources for RIFA). Moreover, warmer soil temperatures decreased RIFA abundance, whereas other carnivorous ant species richness and abundance negatively affected RIFA abundance and mound numbers.\n\n<i>Synthesis and applications</i>: Our findings demonstrate that the ecological resistance to RIFA invasion is influenced by tree species richness in a complex manner; specifically, the relative strengths of the effects of tree species characteristics, native competitors and environmental conditions are likely to impact the power of ecological resistance. This highlights the importance of cross-trophic interactions underlying the resistance of complex ecosystems to alien species invasion; therefore, maintaining diverse tree communities in controlled systems (e.g. suburban and urban green spaces) should be viewed as a potential strategy for controlling RIFA invasion.\n</p>","author":"Pengyang Wang, \nDonghao Wu, \nYongjia Wang, \nZhiqiang Shen, \nBuhang Li, \nZufei Shu, \nChengjin Chu","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"34126620b67bd4e344dc2ae1fc9d0b72fd393705eaa4ff635d7f0602c42e01de","category":"Environment"}