{"title":"Habitat fragmentation increases genetic distance between fruit bat subpopulations","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13261?af=R","date":1710315846000,"content":"<h2>Abstract</h2>\n<p>Livingstone's fruit bat (<i>Pteropus livingstonii</i>) is among the most threatened bats worldwide. As the species is an important pollinator and seed disperser of Comoros plants with a crucial role in forest regeneration, it is critical to understand how human-induced habitat disturbance impacts genetic structure at fine spatial scales in order to define conservation strategies. In this study, we assessed the level of genetic structure between eight colonies of the species and found that this was strong genetic structures between roosts that can be explained by isolation due both to distance and habitat fragmentation. Mitigation measures should aim to restore population connectivity.</p>\n<h2>Résumé</h2>\n<p>La chauve-souris frugivore de Livingstone (<i>Pteropus livingstonii</i>) est l’une des chauves-souris les plus menacées au monde. L’espèce étant un important pollinisateur et disperseur de graines des plantes des Comores et jouant un rôle crucial dans la régénération des forêts, la compréhension de l’impact des perturbations de l’habitat induites par l’homme sur la structure génétique à des échelles spatiales fines est essentielle pour définir des stratégies de conservation. Dans cette étude, le niveau de structure génétique de huit colonies de l’espèce a été évalué et nous avons constaté qu’il existait une forte structure génétique entre les perchoirs, pouvant s’expliquer par l’isolement dû à la fois à la distance et à la fragmentation de l’habitat. Les mesures visant à atténuer les effets de la pollution devraient avoir pour objectif de rétablir la connectivité entre les populations.</p>","author":"Mohamed Thani Ibouroi, \nVéronique Arnal, \nClaudine Montgelard, \nAurélien Besnard","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"341dbbb238ccfe04e04172ad345458a4632be520a96a7d6aad2bd23f0a85fc31","category":"Environment"}