{"title":"8 tips for road riding in the dark | How to ride confidently and safely at night","link":"https://www.bikeradar.com/advice/skills/cycling-at-night/","date":1699459200000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/10/Cycling-at-night-1b27408.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/10/Cycling-at-night-1b27408.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2020/10/Cycling-at-night-1b27408.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2020/10/Cycling-at-night-1b27408.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2020/10/Cycling-at-night-1b27408.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2020/10/Cycling-at-night-1b27408.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2020/10/Cycling-at-night-1b27408.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2020/10/Cycling-at-night-1b27408.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Tips for road riding in the dark\" title=\"Tips for road riding in the dark\" />                                            <p>If you’re cycling at night, whether on lit roads in town, unlit roads or off-road, it’s important to be properly prepared.</p>\n<p>There are obvious steps to take, such as fitting bike lights, but there are other ways in which you can make riding at night safer and more comfortable.</p>\n<p>We asked Matt Woodcock, training manager at Cycling UK, and Chris Bennett, head of behaviour change and engagement at Sustrans, for their advice on how to ride safely at night.</p>\n<p>And, if you’re a mountain biker, we’ve got <a href=\"https://www.bikeradar.com/features/routes-and-rides/6-tips-for-trail-night-riding/\">tips for trail riding at night</a> too.</p>\n<h2>1. Use appropriate lights</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Exposure Race Mk17 front light for mountain bikes\" title=\"Exposure Race Mk17 front light - 05\" />\n\n</div><div><figcaption><span><i></i> If riding on unlit lanes, you’ll need a front light powerful enough to illuminate the road.</span></figcaption><span> <i>David Caudery / Our Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/features/bike-light-laws-in-the-uk-what-you-need-to-know/\">Bike light laws in the UK</a> state you must run a front white light and a rear red light between sunset and sunrise.</p>\n<p>The lights you need for <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-to-work-guide/\">cycling to work</a> in town are very different from those you need to ride on unlit country lanes or off-road.</p>\n<p>If there’s decent street lighting on your route, your light only needs to ensure you are seen by other road users. On dark roads or pitch-black trails, the lights have to illuminate the road or trail ahead of you.</p>\n<p>“If you’re riding along unlit country lanes, you’ll need a different lighting setup to riding in an urban setting – or you may need to have a mix of lights if you’re riding through both environments,” says Woodcock.</p>\n<div></div>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Blackburn Dayblazer 125 rear light for road bikes\" title=\"Blackburn Dayblazer 125 rear light - 05\" />\n\n</div><div><figcaption><span><i></i> No matter where you’re riding, you’ll need a rear light.</span></figcaption><span> <i>Oscar Huckle / Our Media</i></span></div>\n<p>Whereas a lower-power blinky might work as a front light in town, you’ll need a much more powerful front light for a mountain bike ride or country lane.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-lights-for-road-cycling/\">best bike lights for road cycling and commuting</a> start at about 400 lumens and generally top out at around 800 lumens. You’ll want a more powerful light for off-road riding. In all cases, you should have a red rear light. You could also consider a <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-rearview-radars\">rearview radar light</a> to alert you to vehicles approaching from behind.</p>\n<p>If your budget can’t stretch that far or the roads you will be riding on are streetlit and you just want to be seen by cars, a pair of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/cheap-bike-lights/\">best budget bike lights</a> might work for you.</p>\n<p>Research shows that using a mix of <a href=\"https://www.bikeradar.com/advice/buyers-guides/flashing-bike-lights/\">steady and flashing bike lights</a> is usually the best option if you want to maximise visibility. The flashing light can help make sure you’re noticed in crowded urban settings and the steady light won’t distort other road users’ depth perception.</p>\n<p>Off-road, a <a href=\"https://www.bikeradar.com/advice/buyers-guides/6-of-the-best-helmet-lights/\">helmet light</a> will light up turns and hazards better than a bar-mounted one because it points where you want to go, rather than where the bike is heading, and is mounted higher up. But keep it lightweight – a heavy one will be uncomfortable and may shift your helmet around as you move.</p>\n\n<h2>2. Ride where you can be seen</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Bike light laws in the UK\" title=\"Bike light laws in the UK\" />\n\n</div><div><figcaption><span><i></i> Don’t hug the gutter when riding at night.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Upping your visibility on the roads at night isn’t just a question of lighting yourself up. In general, drivers are looking ahead, so you want to make sure you’re in their field of vision.</p>\n<p>That means riding a little way out into the road – around 70cm to 1m. That way, you should also avoid the worst of the obstacles at the side of the carriageway, such as potholes and drain covers.</p>\n<p>“When cycling at night, ride in the right position to be seen clearly. Make your intentions known to others earlier than you would in daylight,” says Cycling UK’s Woodcock.</p>\n<h2>3. Add reflectives</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Apidura Packable Visibility Vest rear\" title=\"Apidura Packable Visibility Vest rear\" />\n\n</div><div><figcaption><span><i></i> Reflective detailing on your clothing can help boost visibility on the road at night.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>“The other legal requirement is to have a white reflector (front), red reflector (rear) and pedal reflectors,” Woodcock points out.</p>\n<p>“Studies have shown that having reflectors on your pedals, or ankles, will help you stand out more because other road users notice the elliptical movement of the pedal strokes,” he continues.</p>\n<p>Bennett suggests you go beyond this to up your visibility. “On top of the legal requirement to have a front white light, a rear red light, plus reflectors at night, you should ensure that you’re seen from side-on,” he says.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Fit some reflectors – many bike shops will sell their spare ones to you at a knock-down price.\" title=\"winterize_bike_3a-1466095306395-1reu9kpdxe2ak-5cd7d66\" />\n\n</div><div><figcaption><span><i></i> Reflectors shouldn’t be overlooked.</span></figcaption><span> <i>Neil Godwin / Immediate Media Ltd</i></span></div>\n<p>That’s something to consider when buying bike lights – do they offer any side visibility? Reflective detailing on key parts of your kit, or on a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-backpack/\">cycling backpack</a> if you’re commuting, can also help.</p>\n<p>“Reflective gear has been shown to be seen better than hi-vis wear at night,” adds Woodcock. “Having reflective piping on your clothing, especially your gloves, will help others see you and your hand signals.”</p>\n<h2>4. Don’t dazzle oncoming vehicles</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Ravemen PR1200 front light for road cycling in action\" title=\"Ravemen PR1200 01\" />\n\n</div><div><figcaption><span><i></i> Lights with shaped beams won’t dazzle oncoming road users.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Some high-powered front lights have brighter beams than car headlights. “Be aware of the dazzle some powerful lights can cause to others, so ensure that you direct your beam of light down to the road surface to avoid blinding drivers,” says Woodcock.</p>\n<p>Some road-specific lights – such as those that comply with <a href=\"https://www.bikeradar.com/advice/buyers-guides/stvzo-bike-lights/\">Germany’s StVZO light regulations</a> – have a beam pattern shaped to avoid dazzling other road users.</p>\n<p>If you’ve got an off-road-ready front light, it’s a good idea to dial down its brightness or switch to a flashing mode if you have to ride on the tarmac for a while. That will conserve your battery, too.</p>\n<h2>5. Have back-up lights</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Bontrager Flare RT on Bontrager NCS mudguard\" title=\"Bontrager Flare RT on Bontrager NCS mudguard\" />\n\n</div><div><figcaption><span><i></i> Running two lights enables you to have one steady and one flashing. It also gives you a back-up option should your main light fail.</span></figcaption><span> <i>Oli Woodman / Immediate Media</i></span></div>\n<p>Make sure you’ve fully charged your lights before heading off at night and select a light mode that should give you the burn time to comfortably complete your journey. Remember, claimed run times from manufacturers aren’t always accurate.</p>\n<p>As we’ve already covered, it’s useful to have a second front and rear light, so you can run both on a lower power setting than your main lights to up battery life. That way, you won’t be left in the dark if one does stop working.</p>\n<p>Once your eyes become accustomed to the dark, it should be possible to dim your lights on less tricky terrain or where there’s street lighting, saving the brightest settings for technical trail stretches or unlit roads.</p>\n<p>If you’re planning to do a lot of night riding, it might be worthwhile investing in a dynamo front wheel and light set, so you’re independent of battery power. A modern <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-dynamos/\">dynamo lighting system</a> is very efficient and adds minimal drag.</p>\n<h2>6. Ride with caution</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Ribble Hybrid AL Leisure\" title=\"Ribble Hybrid AL Leisure\" />\n\n</div>\n    <div>\n    <span>\n                    <i>Rebecca Leach / Our Media</i>\n            </span>\n</div>\n<p>Familiar roads or paths will look different at night.</p>\n<p>“Keep an eye out for hazards, such as slippery leaves, and where possible stick to riding on familiar road routes or else opt for better-lit paths,” says Bennett. It’s easier to hit unseen obstacles at night too.</p>\n<p>Even if you know the route you’re riding, it will look very different at night. So don’t plan to take on anything too ambitious and don’t try to thrash it.</p>\n<p>If you’re riding with others, leave enough space between you and the rider in front so that your light won’t cast their shadow ahead of them, making it difficult for them to see their way. Also, if you’re riding in a group, avoid dazzling the rider behind you with an overpowered rear light.</p>\n<h2>7. Wrap up</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Oscar Huckle wearing Castelli Gabba 2 jacket\" title=\"Castelli Gabba 2 jacket\" />\n\n</div><div><figcaption><span><i></i> Wrap up when riding in winter – and be prepared for the temperature to drop at night.</span></figcaption><span> <i>Dave Caudery / Our Media </i></span></div>\n<p>You don’t need us to tell you that it’s likely to be colder at night, but make sure you’re properly prepared for the conditions. If you’re planning to ride regularly through the colder months, investing in decent <a href=\"https://www.bikeradar.com/features/best-winter-cycling-clothing-a-buyers-guide/\">winter cycling kit</a> will make all the difference.</p>\n<p>Even on a summer night, it can get chilly, but a ride at close to 0°C in winter can be a very unpleasant affair if you don’t have the right kit. Swapping to full-finger <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-cycling-gloves/\">winter gloves</a>, tights and thicker socks will help keep your extremities warmer.</p>\n<p>Mist or fog will chill you too, so it’s worth having water-resistant outer layers, even if you don’t expect rain. If rain is forecast, a quality <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-cyclists/\">waterproof jacket</a> is essential.</p>\n<h2>8. Let someone know where you’re going</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Gore Endure Pants pocket\" title=\"Gore Endure Pants pocket\" />\n\n</div><div><figcaption><span><i></i> It’s always worth taking your phone out with you, in case you should need help.</span></figcaption><span> <i>Andy Lloyd / OurMedia</i></span></div>\n<p>Let someone know where you plan to ride and how long you expect to be out for, particularly if you’re heading off-road.</p>\n<p>There are far fewer people out at night to spot you if you have a mechanical or are injured, especially if you’re venturing off the beaten path.</p>\n<p>You’ll also cool down quickly at night if you aren’t moving – another reason to wrap up or carry an extra layer in the event of an unexpected stop.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"341fe27630cb7a2257308c623afd8d9f99df820440be504b166c1096d7f00322","category":"Cycling"}