{"title":"Why Bahrain Victorious revealed, and then destroyed, its new Tour de France kit","link":"https://cyclingtips.com/2021/06/why-bahrain-victorious-revealed-and-then-destroyed-its-new-tour-de-france-kit/","date":1624633108000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/CORVOS_00033250-039-650x402.jpg\" /></div><h2>Why Bahrain Victorious revealed, and then destroyed, its new Tour de France kit</h2><p>\n</p><p>In October 2018, the secretive artist Banksy <a href=\"https://www.smithsonianmag.com/smart-news/watch-14-million-bansky-painting-shred-itself-soon-it-sold-180970486/\">made global headlines when one of his artworks</a>, sold at a London auction for US$1.4 million, began shredding itself the second the gavel went down.</p>\n\n\n\n<p>In a strange parallel, cycling seems to have just had its own Banksy moment. </p>\n\n\n\n<p>But rather than one of the peloton’s edgier teams being behind the stunt, there was an unlikely perpetrator: Bahrain Victorious. At the <a href=\"https://cyclingtips.com/tag/tour-de-france/\">Tour de France</a> team presentation on Thursday, its team members wore a special one-off jersey – which was then destroyed, never to be seen again. </p>\n\n\n\n<p>Why? That’s a short question with a somewhat longer answer, involving diabetes, obesity and NFTs. </p>\n\n\n\n<h2>Cryptowhat?</h2>\n\n\n\n<p>Cryptocurrency and cycling are having a bit of a moment. From team sponsorships to limited edition kits to non-fungible tokens of bicycles, it has been … a lot to come to terms with.  </p>\n\n\n\n<p><a href=\"https://cyclingtips.com/2021/05/colnagos-latest-release-is-ultra-lightweight-limited-to-one/\">Colnago was the first cab off the rank</a> with a non-fungible token (NFT) representation of the company’s flagship C64 road bike. </p>\n\n\n\n<p>The good: it was <em>easily</em> the lightest frame the company had ever produced. The bad: it didn’t actually exist – other than on servers somewhere – and was <a href=\"https://cyclingtips.com/2021/05/nft-of-colnago-c64-sells-for-2300-more-than-actual-colnago-c64/\">sold for $2,300 more than an actual Colnago C64</a>. </p>\n\n\n\n<p>Even then, its buyer, ‘MTD-01’ didn’t actually own the thing itself. They just exchanged 3.2 wETH tokens (a cryptocurrency) for the <em>rights</em> to a freely available 3D rendering of a bike. </p>\n\n\n\n<figure><img /><figcaption>Yep.</figcaption></figure>\n\n\n\n<p>Is your head hurting yet? Don’t worry – I think that’s normal.</p>\n\n\n\n<p>Things went deeper down the rabbit hole on Thursday, in the real coastal city of Brest in the real continent of Europe, at the teams presentation at the <a href=\"http://www.cyclingtips.com/tag/tour-de-france\">Tour de France</a>. </p>\n\n\n\n<p>The ceremony itself is a weird kind of a purgatory, suspended in the ‘almost here’ and the ‘not quite yet’ of the world’s biggest bike race, but there were some things this year that made it a little more interesting than it might normally have been.</p>\n\n\n\n<p>First up, there were interesting new sponsors. The artist formerly known as Qhubeka-Assos <a href=\"https://cyclingtips.com/2021/06/qhubeka-assos-becomes-qhubeka-nexthash-with-lengthy-new-sponsorship-deal/\">announced a new kit and a five-year partnership</a> with the crypto-trading company NextHash, a mysterious entity with a limited digital trail about which I’m sure there are many more words to be written.</p>\n\n\n\n<figure><img /><figcaption>Team Qhubeka-NextHash has a new sponsor and a new kit to go with it.</figcaption></figure>\n\n\n\n<p>No matter. </p>\n\n\n\n<p>Bahrain Victorious had its own new kit too. It certainly looked better than the team’s standard kit – which <a href=\"https://cyclingtips.com/2021/02/mens-worldtour-kits-of-2021-the-good-the-bad-and-the-ugly/\">critical media</a> have unkindly described as a ‘cursed hellscape of a bicycle jersey’. </p>\n\n\n\n<p>Apart from being conspicuously less hideous, though, Bahrain Victorious’ new white and blue outfit had a couple of extra tricks up its sleeve. </p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Do go on…</h2>\n\n\n\n<p>For one: it was a kit with a cause. The kit, designed by Bahrain Victorious’ sponsor Alé, had the purpose of bringing attention to obesity and diabetes. </p>\n\n\n\n<p>These two afflictions, which are widespread globally but apparently especially prominent in Bahrain and surrounding countries, are intertwined: obesity causes 85% of diabetes cases, and 463 million people globally suffer from diabetes. The tie-in to cycling is that exercise can help reduce obesity, and in turn diabetes. As the kit says on the back: ‘Every pedal stroke is a victory’. </p>\n\n\n\n<figure><img /></figure>\n\n\n\n<p>For two: there’s a charity angle. </p>\n\n\n\n<p>The jersey could, of course, have been sold as a limited edition thing with money donated to charity. That’s not the way that Bahrain Victorious and Alé decided to play it, though. </p>\n\n\n\n<h2>Ah, so this is where the NFT thing comes in?</h2>\n\n\n\n<p>You got it! Here’s what Alé and Bahrain Victorious had to say for themselves:</p>\n\n\n\n<blockquote><p>“Along with the increasing uptake and growing market of cryptocurrencies, NFTs have also seen an increase as a new way of collecting exclusive digital art. They are the baseball cards of tomorrow. Both [Team Bahrain Victorious] and Alé saw this as the perfect platform for the ‘Maillot Disruptif’ because it not only communicates with a younger market, one who are potentially more at risk of Diabetes and Obesity, but also because it gives the owner a unique connection with both cycling and [the team].”</p></blockquote>\n\n\n\n<p>Immediately after the presentation, the actual physical jerseys were destroyed, “never to be seen again”, and one was minted as crypto art. The digital representation of a real jersey that was briefly wrapped around some cyclists but now doesn’t exist anymore is <a href=\"https://opensea.io/assets/0x495f947276749ce646f68ac8c248420045cb7b5e/112708733670090958449898150299802679774262445710390552024515111332618788929537/\">up for auction</a>, with proceeds going to the Royal Humanitarian Foundation. </p>\n\n\n\n<p>Did the Bahrain Victorious NFT play pan out? We’ll find out on 5th July, when the auction ends. For now, the current 0.01 wETH bid is below reserve, and at current exchange rates is worth US$18.56. </p>\n\n\n\n<p>You may note that figure is in real money that exists in the real world, which could be put toward, say, a real jersey or a Royal Humanitarian Foundation donation. But that would be missing the point, I suppose. </p>\n\n\n\n<p>The digital representation of briefly-corporeal cycling jerseys are the baseball cards of tomorrow. </p>\n\n\n\n<p>Good? Good. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/why-bahrain-victorious-revealed-and-then-destroyed-its-new-tour-de-france-kit/\">Read More</a>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3424720b3417650aa4707d187a7e6587f931fba729fe970b2f0ab4d18e5fee8e","category":"Cycling"}