{"title":"Nitrogen cycling process and application in different prawn culture modes","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12912?af=R","date":1712661369000,"content":"<h2>Abstract</h2>\n<p>Nitrogenous waste is a global concern in aquatic ecosystems. In the shrimp farming system, feeding is the main input of nitrogen, which leads to the accumulation of nitrogenous waste, such as ammonia, nitrite, and nitrate. Nitrogen cycling is crucial for nitrogenous waste removal and for the stability of the aquaculture system. Under the action of different functional microorganisms, a variety of nitrogen cycling pathways can be used for the transformation and removal of nitrogenous waste. Understanding the complexity of the nitrogen cycle is necessary for improving the aquaculture environment. This review examines the many components and mechanisms involved in the nitrogen cycle in shrimp farming system, including nitrification, denitrification, anammox, heterotrophic assimilation, and autotrophic assimilation. Because of the difference in aquaculture characteristics, nitrogen cycling pathways in different shrimp culture modes are diverse. The current application of the nitrogen cycle in shrimp farming system, including the outdoor pond mode and indoor industrialized mode, was presented in combination with the requirements for dissolved oxygen (DO), organic matter, carbon–nitrogen ratio, light, and other environmental factors. Overall, nitrification, heterotrophic assimilation, autotrophic assimilation, and heterotrophic denitrification are the main nitrogen cycle processes in the shrimp culture system. According to the characteristics of aquaculture modes and microorganisms, utilizing different nitrogen cycle processes can enhance the efficiency of the nitrogen cycle, facilitate the elimination of nitrogenous waste, optimize the aquaculture water environment, and improve overall aquaculture benefits.</p>","author":"Zhao Chen, \nJian Li, \nQianqian Zhai, \nZhiqiang Chang, \nJitao Li","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"3428e55c8d4d1e386f950afe8bdf856c3b3cf4cfbd718817f0bd5ff94816347a","category":"Environment"}