{"title":"AI can see you: Machiavellianism and extraversion are reflected in eye-movements","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308631","date":1724853600000,"content":"<p>by Elina Tsigeman, Viktoria Zemliak, Maxim Likhanov, Kostas A. Papageorgiou, Yulia Kovas</p>\r\nIntroduction <p>Recent studies showed an association between personality traits and individual patterns of visual behaviour in laboratory and other settings. The current study extends previous research by measuring multiple personality traits in natural settings; and by comparing accuracy of prediction of multiple machine learning algorithms.</p> Methods <p>Adolescent participants (N = 35) completed personality questionnaires (Big Five Inventory and Short Dark Triad Questionnaire) and visited an interactive museum while their eye movements were recorded with head-mounted eye tracking. To predict personality traits the eye-movement data was analysed using eight machine-learning methods: Random Forest, Adaboost, Naive Bayes, Support Vector Machine, Logistic Regression, k Nearest Neighbours, Decision Tree and a three-layer Perceptron.</p> Results and discussion <p>Extracted eye movement features introduced to machine learning algorithms predicted personality traits with above 33% chance accuracy (34%–48%). This result is comparable to previous ecologically valid studies, but lower than in laboratory-based research. Better prediction was achieved for Machiavellianism and Extraversion compared to other traits (10 and 9 predictions above the chance level by different algorithms from different parts of the recording). Conscientiousness, Narcissism and Psychopathy were not reliably predicted from eye movements. These differences in predictability across traits might be explained by differential activation of different traits in different situations, such as new vs. familiar, exciting vs. boring, and complex vs. simple settings. In turn, different machine learning approaches seem to be better at capturing specific gaze patterns (e.g. saccades), associated with specific traits evoked by the situation. Further research is needed to gain better insights into trait-situation-algorithm interactions.</p>","author":"Elina Tsigeman","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"342d2f2eaab7c275dfb42b56295a3c0ee7eafd9bdcc7fc36e16474a14d2a4278","category":"Interdisciplinary"}