{"title":"The iPhone 16 Pro Max may finally get a super-zoom camera","link":"https://www.macworld.com/article/1999006/iphone-16-pro-max-super-telephoto-periscope-lens-camera-optical-zoom.html","date":1689698991000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>We still have several months to wait until the reveal of the iPhone 15 lineup (likely coming this September), in which we expect the iPhone 15 Pro Max to include the first “periscope” telephoto lens. It’s expected to enable roughly 6x optical zoom, a huge increase over the current 3X zoom. </p>\n\n\n\n<p>But the rumors about <em>next year’s</em> iPhone 16 have already started, and the latest says that the iPhone 16 Pro Max will get an even longer, “super-telephoto” camera. The rumor comes from Weibo user <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://weibo.com/6048569942/NahcI2vtn#comment&amp;xcust=1-1-1999006-1-0-0&amp;sref=https://www.macworld.com/feed\">Digital Chat Station</a>, which has divulged some accurate Apple details in the past. Of course, the phone is still more than a year away, so even accurate information about plans at this stage could change before manufacturing begins. Remember the <a href=\"https://www.macworld.com/article/1811252/iphone-15-supplier-solid-state-buttons-cancelled.html\">iPhone 15 button saga</a>?</p>\n\n\n\n<p>The current iPhone 14 Pro Max and iPhone 14 Pro have a 24mm wide camera and a 77mm telephoto camera, for a 3x zoom. This year’s iPhone 15 Pro Max (but not the iPhone 15 Pro) is expected to have a 6x zoom periscope lens, which would be in the 150mm range. Typically, “ultra” or “super” telephoto lenses in photography refer to those with a focal length of 300mm or more, so we’re looking at a roughly 12x zoom. By comparison, the Galaxy S23 Ultra has 10X optical zoom and 100X digital zoom.</p>\n\n\n\n<p>We previously reported on a rumor that the <a href=\"https://www.macworld.com/article/1934783/why-apple-finally-making-bigger-iphones-next-year.html\">periscope lens would come to the iPhone 16 Pro</a> after one year of being exclusive to the Pro Max model. At that time we also reported of a new slightly larger 1/1.14-inch image sensor, which this latest rumor corroborates (or at least repeats).</p>\n\n\n\n<p>In other words, next year’s iPhone will have a somewhat better camera than this year’s iPhone. Unbelievable, right?</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"342fc858cd6c1b6061737a72b99f1cd0e371bd8fc50e32cddeaa3879b6b55cc4","category":"Apple"}