{"title":"A Systematic Review of Secretome-Based Therapies for Alzheimer's Disease: Bridging the Preclinical and Clinical Gap","link":"https://www.preprints.org/manuscript/202406.0273/v1","date":1717585000000,"content":"Background: Alzheimer's Disease (AD) is a progressive neurodegenerative disorder with a rapidly increasing prevalence. Current therapeutic options primarily manage symptoms, not modifying the disease. Secretome-based therapies have emerged as a promising avenue for AD treatment in targeting multiple pathways and promoting neuroprotection and regeneration. This systematic review evaluated the preclinical and clinical evidences for secretome-based therapies in AD.Methods: A systematic search was conducted across Scopus, PubMed, ScienceDirect, and Cochrane Library. The SYRCLE risk of bias (RoB) tool was used for preclinical studies and Cochrane RoB 2.0 for clinical studies. We performed qualitative analysis of study results.Results: Included 21 in vivo studies and 2 clinical trials revealed promising outcomes of treatments involving secretomes, exosomes, and extracellular vesicles from different cell sources. The therapies could reduce amyloid plaque load, reactive gliosis, and enhance neuronal density. These findings suggested the treatments reveal mechanism of action in neuroprotection, neuroregeneration, and inflammation modulation, which are critical in AD pathology. Ongoing trials also supported the safety and efficacy of the treatment strategies. However, translational medical study faces several challenges regarding large-scale production, optimization of protocols, and understanding biomarkers. The heterogeneity in secretome-based therapies administration have complicated the comparison of study outcomes and the translation of preclinical findings into clinical settings. Deeper understanding of the secretome's mechanisms of action, optimal dosing, and delivery methods are needed to maximize therapeutic outcomes.Conclusion: Despite secretome-based therapies hold significant promise for AD treatment, addressing the identified gaps and limitations is crucial for advancing these therapies from preclinical research to clinical practice.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"343040174d3284bf0ecf9713c0475bb259679295d25d64fa936e3edd66e25347","category":"Interdisciplinary"}