{"title":"PSII-6 Tick infestation and its implications on health and welfare of cattle under pastoral system in Nigeria","link":"https://academic.oup.com/jas/article/102/Supplement_3/431/7757025?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The pastoral system is a predominant form of cattle production in Nigeria, characterized by extensive grazing on communal lands. However, this system is challenged by various factors, including tick infestation, which significantly affects cattle health and welfare hence this investigation which aims to provide an in-depth understanding of tick infestation in the context of Nigerian pastoral systems, emphasizing its impact on cattle health and welfare. The country harbors a diverse array of tick species that affect cattle. These ticks belong to different genera, including <span>Rhipicephalus</span>, <span>Amblyomma</span>, and <span>Hyalomma</span>, among others. Each species has unique characteristics, life cycles, and host preferences, contributing to the complexity of tick infestation dynamics in pastoral settings. Tick infestation has numerous detrimental effects on cattle health. The direct effects include blood loss, anemia, skin damage due to feeding, and the transmission of pathogens that cause diseases such as anaplasmosis, babesiosis, and theileriosis. Indirectly, tick infestation can lead to reduced productivity, weight loss, and increased susceptibility to other diseases. The welfare of cattle in Nigerian pastoral systems is significantly impacted by tick infestation. Infested cattle often exhibit signs of distress, including restlessness, reduced grazing activity, and altered behavior. Furthermore, the discomfort caused by tick bites can lead to chronic stress, compromising the overall welfare of the animals. Effective tick control is crucial for mitigating the impact of infestation on cattle health and welfare. Strategies such as acaricide application, pasture management, genetic selection for tick resistance cattle, and vaccination against tick-borne diseases are commonly used. Tick infestation presents a significant challenge to cattle production under the pastoral system in Nigeria. It not only impacts cattle health but also compromises their welfare. Addressing the issue of tick infestation requires a multifaceted approach that integrates effective control strategies with sustainable management practices. Further research is needed to develop tailored interventions that account for the unique characteristics of Nigerian pastoral systems, ultimately ensuring the well-being and productivity of cattle in these settings.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3438f52211e81bbaa5ab9033a35df9644bdee0cc3c1e26eb4ae16c5228d8bd08","category":"Environment"}