{"title":"Hyundai Ioniq 6 tops list of fastest-charging EVs; Chevy Bolt ranks last","link":"https://arstechnica.com/?p=1987446","date":1701360704000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/GettyImages-1182290682-800x533.jpg\" alt=\"Symbol for a charging ststion for electric vehicles on tarmac\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/GettyImages-1182290682-scaled.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Despite the fact that most of us generally drive short distances when we get in our cars, the time it takes to <a href=\"https://arstechnica.com/cars/2022/07/the-ars-technica-guide-to-electric-vehicle-charging/\">fast-charge an electric vehicle</a> remains of paramount importance to potential EV buyers. It's hard to blame them—for more than a century, motorists have come to expect short refueling stops, and until someone actually lives with an EV for a while, it can be hard to make that paradigm shift. And of course, not everyone has the ability to slow-charge an EV at home or at work, your author included.</p>\n<p>So with that in mind, the consumer advice publication Edmunds <a href=\"https://www.edmunds.com/car-news/electric-car-charging.html\">decided to test a whole bunch of EVs</a> to find out which one adds the most miles of range in the fewest minutes possible.</p>\n<p>Working with the automotive consultancy P3, Edmunds tested 43 different EVs, running down their batteries on its EV range-testing route to calculate the car's efficiency, then fast-charged them from 10 to 80 percent, measuring peak and average charging power and calculating charging losses in the process. Edmunds says it did this because automakers are inconsistent in advertising fast-charging times—some list charge times from 10 to 80 percent, while others simply say their cars can add 100 miles (160 km) of range in a given time.</p></div><p><a href=\"https://arstechnica.com/?p=1987446#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1987446&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"343c9dc4d33610718a46511a1493a9d8776dc2d6bcb7ffe41576bd0e08fd1650","category":"Tech"}