{"title":"Enhanced IGF‐IIRα Expression Exacerbates Lipopolysaccharide‐Induced Cardiac Inflammation, Hypertrophy, and Apoptosis Through Calcineurin Activation","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24385?af=R","date":1723031126000,"content":"<h2>ABSTRACT</h2>\n<p>Cardiovascular disease is one of the leading causes of death worldwide and has a high prevalence. Insulin-like growth factor-II receptor α (IGF-IIRα) acts as a stress-inducible negative regulator. This study focused on the substantial impact of heightened expression of IGF-IIRα in cardiac myoblasts and its association with the exacerbation of cardiac dysfunction. Using lipopolysaccharide (LPS)-induced H9c2 cardiac myoblasts as a model for sepsis, we aimed to elucidate the molecular interactions between IGF-IIRα and LPS in exacerbating cardiac injury. Our findings demonstrated a synergistic induction of cardiac inflammation and hypertrophy by LPS stimulation and IGF-IIRα overexpression, leading to decreased cell survival. Excessive calcineurin activity, triggered by this combined condition, was identified as a key factor exacerbating the negative effects on cell survival. Cellular changes such as cell enlargement, disrupted actin filaments, and upregulation of hypertrophy-related and inflammation-related proteins contributed to the overall hypertrophic and inflammatory responses. Overexpression of IGF-IIRα also exacerbated apoptosis induced by LPS in H9c2 cardiac myoblasts. Inhibiting calcineurin in LPS-treated H9c2 cardiac myoblasts with IGF-IIRα overexpression effectively reversed the detrimental effects, reducing cell damage and mitigating apoptosis-related cardiac mechanisms. Our study suggests that under sepsis-like conditions in the heart with IGF-IIRα overexpression, hyperactivation of calcineurin worsens cardiac damage. Suppressing IGF-IIRα and calcineurin expression could be a potential intervention to alleviate the impact of the illness and improve cardiac function.</p>","author":"Khwanchit Boonha, \nWei‐Wen Kuo, \nBruce Chi‐Kang Tsai, \nDennis Jine‐Yuan Hsieh, \nKuan‐Ho Lin, \nShang‐Yeh Lu, \nChia‐Hua Kuo, \nLiang‐Yo Yang, \nChih‐Yang Huang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"343f6d40f7a62278631a8c8a34d5d9e3f40637bdfd6f726a120ed320743426ff","category":"Environment"}