{"title":"C-Reactive Protein Levels Can Predict Post-Operative Pancreatic Fistula (POPF) Formation After Pancreatic Resections","link":"https://www.preprints.org/manuscript/202409.2361/v1","date":1727675230000,"content":"Background: Post-operative pancreatic fistula (POPF) is a common complication associated with pancreatic resections. Early identification of this adverse event could avoid otherwise prolonged hospital stay due to clinical management and treatment of symptoms created by POPF. This retrospective study investigated the prevalence of pancreatic fistula among patients who underwent oncological pancreatic resection between August 2018 and December 2023 at Bnai-Zion Medical Center. Elevated C-reactive protein levels have been utilized as an early postoperative marker indicating the presence of inflammation due to tissue injury complication. Objective: The aim of the current study was to evaluate the prediction potential of elevated C-reactive protein levels in detecting the risk for infection created by pancreatic fistula. Methods: Demographic and clinical data was collected from medical records files of ninety-four pancreatic cancer patients’ cohort who were subjected to resection. Results: A significant increase in C-reactive protein levels was found on day three following surgery at the group of forty-six patients having developed pancreatic fistula compared to patients without pancreatic fistula (p=0.002). There was no statistical difference among the groups in any demographic characteristics (such as age, gender, BMI, smoking status, etc.) and any other clinical features (e.g. serum albumin levels, chemotherapy protocol, surgical technique, hospitalization time, lymph node involvement). Conclusions: The results of the study suggest that C-reactive protein could serve as an early biomarker for pancreatic fistula formation in patients undergoing pancreatic resection for cancer.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"34425f12883c4a37fe50ea3f72fe7cc40b06561d274a1121d6b952f89a79cbf2","category":"Interdisciplinary"}