{"title":"Airbnb ไตรมาสล่าสุดยังเติบโตสูง ตลาดเอเชียแปซิฟิกกลับมาสูงกว่าก่อนเกิดโควิด 19 แล้ว","link":"https://www.blognone.com/node/136528","date":1698886545000,"content":"<div><div><div><p>Airbnb รายงานผลการดำเนินงานของไตรมาสที่ 3 ปี 2023 มีการจองจำนวนคืนและกิจกรรมบนแพลตฟอร์มรวม 113.2 ล้านครั้ง เพิ่มขึ้น 14% เทียบกับช่วงเดียวกันในปีก่อน และเพิ่มขึ้น 32% ถ้าเทียบกับปี 2019 ก่อนเกิดโควิด มูลค่ารวมของการจองคิดเป็น 1.83 หมื่นล้านดอลลาร์ เพิ่มขึ้น 17% เทียบกับปีก่อน และเพิ่มขึ้น 89% เมื่อเทียบกับก่อนโควิด รายได้รวมอยู่ที่ 3,397 ล้านดอลลาร์ ส่วนกำไรสุทธิอยู่ที่ 4,374 ล้านดอลลาร์ เนื่องจากมีรายการพิเศษครั้งเดียวจากประโยชน์ทางภาษี หากไม่มีรายการกำไรสุทธิอยู่ที่ 1,679 ล้านดอลลาร์</p>\n<p>Airbnb บอกว่าการเติบโตเกิดขึ้นในทุกภูมิภาค ส่วนของเอเชียแปซิฟิกตอนนี้กลับมาสู่ระดับช่วงก่อนเกิดโควิดระบาดแล้ว นักท่องเที่ยวเดินทางออกจากจีนเพิ่มขึ้น 100% ตลาดไต้หวัน ฟิลิปปินส์ ไทย ฮ่องกง อินโดนีเซีย ล้วนเติบโตมากกว่า 30% จำนวนห้องพักมีเพิ่มขึ้นเกือบแตะ 1 ล้านรายการแล้ว</p>\n<p>มีตัวเลขน่าสนใจของ Airbnb บอกว่าหลังช่วงโควิดราคาห้องพักโรงแรมนั้นปรับเพิ่มสูงกว่า 10% เฉลี่ยอยู่ที่ 153 ดอลลาร์ต่อคืน สำหรับห้องพัก 1 เตียง แต่บน Airbnb ด้วยการปรับฟีเจอร์ต่าง ๆ เพื่อช่วยเหลือโฮสต์ ทำให้ราคาเฉลี่ยตอนนี้อยู่ที่ 120 ดอลลาร์ เพิ่มขึ้นเพียง 1% เท่านั้น</p>\n<p>ในช่วงแถลงผลประกอบการกับนักวิเคราะห์ Dave Stephenson ซีเอฟโอ Airbnb กล่าวถึงแนวโน้มการท่องเที่ยวในไตรมาส 4 ว่าเห็นแนวโน้มที่ผันผวนมากขึ้น เป็นผลจากสภาพเศรษฐกิจและความขัดแย้งภูมิรัฐศาสตร์ ซึ่งเกิดขึ้นในทุกภูมิภาคไม่ได้จำกัดเฉพาะบางพื้นที่ แต่ตอนนี้ยังเร็วเกินไปที่จะให้ข้อมูลว่ามีผลกระทบมากแค่ไหน</p>\n<p>ที่มา: <a href=\"https://news.airbnb.com/airbnb-q3-2023-financial-results/\">Airbnb</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/82040e9a10b4833a0e8becaedfec0ed2.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/airbnb\">Airbnb</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div><div><a href=\"/topics/travel\">Travel</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"34429f739d6865059f4e794b36f110f9def0328f604b74c71b37cbb0e619a1a2","category":"Thai"}