{"title":"Nintendo throws rare bone to modern EU gamers via N64 60 Hz toggle","link":"https://arstechnica.com/?p=1803032","date":1633977365000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/n64-logo-crt-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/n64-logo-crt.jpg\">Enlarge</a> <span>/</span> We're well past the days of CRT TVs by default, and Nintendo Europe's latest welcome update acknowledges this. (credit: Aurich Lawson | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Monday, Nintendo of Europe announced a very region-specific—and era-specific—tweak for its <a href=\"https://arstechnica.com/gaming/2021/09/nintendo-direct-highlights-n64-online-in-october-super-mario-2022-film-cast/\">upcoming collection of N64 games on Switch</a>: an option to switch between the video standards PAL and NTSC. While <a href=\"https://twitter.com/NintendoEurope/status/1447552226830991361\">the announcement</a> may sound ho-hum to outsiders, anyone in Europe with a vested interest in classic gaming will appreciate what the toggle affords.</p>\n<p>The issue boils down to differences between NTSC and PAL, the leading video broadcast standards on CRT TVs during Nintendo's '80s and '90s heyday. North American and Japanese TV sets were configured for NTSC, which has a refresh rate standard of 60 Hz, while PAL sets dominated Europe with a slightly higher pixel resolution and a lower refresh rate standard of 50 Hz.</p>\n<p>Should you merely watch TV series or films on both NTSC and PAL sets, the difference between each is noticeable yet mild. But for much of the '80s and '90s, many TV video games, especially the ones made by the largely Japanese console industry, suffered in PAL because they were coded specifically for NTSC standards. In order to port them to PAL, developers generally didn't go back and reconfigure all of the timings, especially in the case of early 3D games. Instead, their internal clock speeds were often slowed down to 83.3 percent to match European TV refresh rates. This meant both slower gameplay than originally coded and slower playback of music and sound effects. (These also often shipped with NTSC's pixel maximums in mind in such a way that they were squished to fit on PAL displays, as opposed to being optimized for them.)</p></div><p><a href=\"https://arstechnica.com/?p=1803032#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1803032&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3454fa28c24d56aa520075da2c3158123334218bc02874af538cb24c674f6ba4","category":"Tech"}