{"title":"Salicylic acid modulates secondary metabolism and enhanced colchicine accumulation in long yellow daylily (Hemerocallis citrina)","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae029/7709817?rss=1","date":1716249600000,"content":"<span><div>Abstract</div>Abstract. Salicylic acid (SA) is an essential phytoregulator that is widely used to promote the synthesis of high-value nutraceuticals in plants. However, its application in daylily, an ornamental plant highly valued in traditional Chinese medicine, has not been reported. Herein, we investigated the exogenous SA-induced physiological, transcriptional and biochemical changes in long yellow daylily (LYD). We found that 2 mg/L foliar SA treatment significantly improved LYD plant growth and yield. Transcriptome sequencing and differentially expressed genes (DEGs) analysis revealed that the phenylpropanoid biosynthesis, isoquinoline alkaloid biosynthesis, sulfur metabolism, plant hormone signal transduction and tyrosine metabolism were significantly induced in SA-treated leaves. Many transcription factors and antioxidant system-related DEGs were induced under the SA treatment. Biochemical analyses showed that the leaf contents of soluble sugar, soluble protein (Cpr), ascorbic acid (AsA) and colchicine were significantly increased by 15.15% (from 30.16 ± 1.301 to 34.73 ± 0.861 mg/g), 19.54% (from 60.3 ± 2.227 to 72.08 ± 1.617 mg/g), 30.45% (from 190.1 ± 4.56 to 247.98 ± 11.652 μg/g) and 73.05% (from 3.08 ± 0.157 to 5.33 ± 0.462 μg/g), respectively, under the SA treatment. Furthermore, we identified 15 potential candidate genes for enhancing the growth, production and phytochemical content of LYD. Our results provide support for the bioaccumulation of colchicine in yellow daylily and valuable resources for biotechnological-assisted production of this important nutraceutical in <span>Hemerocallis spp</span>.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"3456f9539fa3b28cd86770e7f72b450e9d04e742072140f57119d847e0d922f6","category":"Environment"}