{"title":"All-new aluminium Orbea Rise H eMTB gets more battery power, costs less","link":"https://www.bikeradar.com/news/2022-orbea-rise-h/","date":1638457222000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/12/2022-Orbea-Rise-H-electric-mountain-bike-8-b59bcda.jpg?quality=45&amp;resize=620,413\" />                                            <p>Orbea’s Rise H is the latest addition to the Spanish brand’s ultra-lightweight electric mountain bike range called <a href=\"https://www.bikeradar.com/news/orbea-rise-e-mtb/\">the Rise</a>, which was launched in 2020.</p>\n<p>The 2022 Rise H is claimed by Orbea to be the lightest aluminium ebike currently on sale, weighing just 19kg for the Fox 34-clad H10. The two other models in the Rise H range both weigh a claimed 20kg.</p>\n<p>In the three-model range, the lowest-specced H30 costs £4,599 / $5,299 / €4,999, while the H10 retails for £6,099 / $7,299 / €6,799.</p>\n<p>This newest addition, given the H moniker (to mean ‘Hydro’) because it’s made from hydroformed aluminium, gets a lightweight, energy-dense 540Wh battery, up from 360Wh on the carbon fibre Rise M.</p>\n<p>With more watt-hours, the larger battery is said to provide enough power to the 60Nm torque Rider Synergy (RS) <a href=\"https://www.bikeradar.com/news/shimano-du-ep800-motor/\">Shimano EP8 motor</a> for 5.5 hours of riding, with 3,500m of climbing from a single charge when in Eco mode.</p>\n<p>Its geometry figures, wheel size (29in), suspension travel (140mm) and kinematics remain unchanged from the existing Rise M bike.</p>\n<h2>2022 Orbea Rise H frame and suspension</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The aluminium down tube doesn’t have a door or window in it. To remove the battery from the bike, the motor would first have to be taken off.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>The all-new Rise H’s aluminium tubes have been hydroformed to give them their shape and create an impressive strength-to-weight ratio.</p>\n<p>Excluding the battery and motor, the frame is claimed to weigh a meagre 3,400g (size medium), only 100g more than <a href=\"https://www.bikeradar.com/news/2022-orbea-occam/\">Orbea’s Occam</a> alloy frame in the same size.</p>\n<p>Its tubes are double- and triple-butted to provide strength in the necessary areas, while not adding too much weight where it’s not needed.</p>\n<p>Each of the frame’s welds is highly polished, too. The smoothing of the welds gives it a clean aesthetic, but is also claimed to contribute to an increase in fatigue resistance, hopefully extending the lifespan of the bike.</p>\n<p>Orbea says the Rise H has a system weight limit (the total weight of the rider and kit) of 130kg. Unlike other manufacturers’ system weight claims, this figure doesn’t include the bike’s weight.</p>\n<p>Another outcome of the weld polishing is the aluminium version looks almost identical to the carbon one. During the press event, Orbea said that while riding the prototype aluminium bikes people didn’t notice they weren’t carbon.</p>\n<h4>Progressive rear end</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> Its suspension design is shared across the Orbea range.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>The four-bar suspension design, with 140mm of rear-wheel travel, uses Orbea’s concentric rear-axle pivot that is similar to <a href=\"https://www.bikeradar.com/news/2022-trek-rail/\">Trek’s ABP</a> or Dave Weagle’s Split Pivot system used on <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/devinci-spartan-hp-gx-12s-review/\">Devinci bikes</a>, among others.</p>\n<p>It has the same travel as the Rise carbon and shares that model’s progressivity.</p>\n<p>Calculated using the graph in the press material, the Rise is roughly 21 per cent progressive. This figure should mean the bike has a poppy feel with a positively supportive mid-stroke and good bottom-out resistance.</p>\n<h2>2022 Orbea Rise H motor and battery</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Shimano’s EP8 RS motor has 60Nm of torque.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>Like the carbon Rise, the Rise H is fitted with Shimano’s 2.6kg EP8 RS motor. The RS denotes ‘Ride Synergy’ and is Orbea’s language for the ethos behind its lightweight ebike.</p>\n<p>The EP8 RS motor, co-developed with Shimano, has a different control system to the standard version and, according to Orbea, is claimed to be more efficient, have less drag and feel more natural to ride.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Shimano co-developed the EP8 RS motor with Orbea.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>This version of the motor has 60Nm of maximum torque (down from 85Nm on the standard EP8) and provides the most assistance in the 75-95rpm pedal cadence range. Additionally, the harder you pedal, the more assistance the motor delivers.</p>\n<p>This, Orbea claims, is when the motor operates most efficiently, and passes on those savings to the rider with increased battery life.</p>\n<h4>Rise H does away with battery anxiety</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> Orbea’s 540Wh battery is claimed to have the highest energy density in the cycling industry.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>These changes mean the Rise H offers 1.5 times the range of a regular ebike with the same battery capacity.</p>\n<p>The 540Wh battery (up from 360Wh on the carbon fibre Rise M) that’s claimed to weigh 2.7kg has enough juice in it to power a 5.5-hour ride with 3,500m of ascending in Eco mode, or 1,600m of climbing over 2.5 hours in Boost.</p>\n<p>The battery is made from 21,700 cells, and Orbea claims it’s the most energy-dense battery in the cycling industry. The battery, Orbea says, retains 80 per cent of its capacity after 500 charge cycles, 60 per cent more than an 18,650-cell battery.</p>\n<p>Like the carbon model, the Rise H is also compatible with a 1.4kg, 252Wh range extender, upping the total potential number of watt-hours to 792.</p>\n<p>This makes the Rise H’s potential range good for 5,000m of ascending over eight hours of riding, and should mean ebike range anxiety is put to bed for good.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The bar controller is familiar, but the in-line mode and battery display – designed to save weight – is a less common sight on eMTBs.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>Fitted to the Rise is either Shimano’s EW-EN100 – an in-line LED battery and mode display fitted alongside the controller-to-battery cable – or the SC-E7000, a more traditional-looking display attached to the handlebar. Both are designed to increase weight savings.</p>\n<p>Thanks to the RS Interface Garmin IQ app, additional ride information is available on compatible devices such as the <a href=\"https://www.bikeradar.com/reviews/training/gps-computers/garmin-edge-830-gps-computer-review/\">Garmin Edge 830</a> or <a href=\"https://www.bikeradar.com/news/garmin-fenix-6-range/\">Fenix 6</a>.</p>\n<h4>Compatibility fails</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> Unfortunately, the new connectors mean the Rise H’s range extender isn’t compatible with the Rise M’s version, and vice versa.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>While the range extender sounds incredible, and probably offers the most ride time of any electrically assisted bike out there, Orbea has dropped the ball slightly.</p>\n<p>The 252Wh extender battery designed for the Rise H isn’t compatible with the current carbon fibre Rise M, and neither is the Rise M’s range extender compatible with the all-new Rise H. It’s a shame Orbea wasn’t able to find a solution for cross-compatibility.</p>\n<p>Orbea explains the lack of inter-compatibility is down to the new fast charger (4 amps for the main battery and 2 amps for the range extender), and new connectors and charging port on the side of the bike.</p>\n<h4>On-bike charging only</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Orbea’s main battery connector supports 4-amp fast charging.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>While the battery is concealed in the down tube like most other ebikes on the market, the Rise’s down tube doesn’t feature a door or window to speed up battery removal. Instead, to access the battery the motor needs to be removed from the bike.</p>\n<p>This means charging the battery can only be done via the bike’s charging port, which could be an issue for some owners.</p>\n<h2>2022 Orbea Rise H geometry</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Rise H has true trail bike geometry.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>The Rise H’s geometry is identical to its carbon fibre stablemate, including compatibility with 140mm or 150mm travel forks. Swapping fork travel changes the head angle and seat tube angle by 0.5 degrees.</p>\n<p>All four sizes in the range – from small to extra-large – have 445mm chainstay lengths, 66 to 66.5-degree head tube angles, 76.5 to 77-degree seat tube angles and a 336mm bottom-bracket height. The reach figures range from 425mm for the small up to 500mm for the extra-large.</p>\n<div>\n                <table><caption>2022 Orbea Rise H electric mountain bike geometry</caption>\n                <colgroup><col></col><col></col><col></col><col></col><col></col></colgroup><thead><tr><th>﻿Size</th><th>Small</th><th>Medium</th><th>Large</th><th>Extra-large</th></tr></thead><tbody><tr><td>Seat tube length (mm)</td><td>381</td><td>419</td><td>457</td><td>508</td>        </tr><tr><td>Top tube length (mm)</td><td>565</td><td>592</td><td>619</td><td>649</td>        </tr><tr><td>Head tube length (mm)</td><td>95</td><td>105</td><td>120</td><td>140</td>        </tr><tr><td>Chainstay length (mm)</td><td>445</td><td>445</td><td>445</td><td>445</td>        </tr><tr><td>Bottom bracket height (mm)</td><td>336</td><td>336</td><td>336</td><td>336</td>        </tr><tr><td>Wheelbase (mm)</td><td>1180</td><td>1205</td><td>1229</td><td>1255</td>        </tr><tr><td>Head ange (degrees) (140mm/150mm fork)</td><td>66/65.5</td><td>66/65.5</td><td>66/65.5</td><td>66/65.5</td>        </tr><tr><td>Seat tube angle (degrees) (140mm/150mm fork)</td><td>77/76.5</td><td>77/76.5</td><td>77/76.5</td><td>77/76.5</td>        </tr><tr><td>Standover height (mm)</td><td>710</td><td>736</td><td>766</td><td>776</td>        </tr><tr><td>Reach (mm)</td><td>425</td><td>450</td><td>474</td><td>500</td>        </tr></tbody></table></div>\n\n<p>The Rise’s geometry is decidedly trail-oriented and sits comfortably in the central ground between extreme and conservative.</p>\n<p>There will be many riders screaming out for a bike of this nature to have more aggressive geometry figures, and maybe Orbea has a bike like this in the works.</p>\n<p>At the moment, though, the Rise H and Rise M are designed for trail riding, rather than hardcore enduro descents.</p>\n<h2>2022 Orbea Rise H models, specifications and prices</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Orbea claims the Rise H10 weighs 19kg, while the H15 and H30 weigh 20kg.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>With a claimed weight of 19kg (size medium), the top-of-the-line Rise H10 is only 1.5kg heavier than the equivalently specced Rise M10.</p>\n<p>Prices start at £4,599 / $5,299 / €4,999 for the Rise H30 and lift to £6,099 / $7,299 / €6,799 for the Rise H10.</p>\n<p>The Rise H10’s spec is focused on saving weight where possible. Up-front is <a href=\"https://www.bikeradar.com/news/2022-fox-34-fork/\">Fox’s Factory 34 fork</a>, with a lightweight Float Factory DPS rear shock. It has a mostly <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-mountain/shimano-deore-xt-m8100-review/\">Deore XT M8100</a> drivetrain (bar the <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-deore-m6100-groupset-review/\">Deore M6100</a> chain) and XT two-piston brakes.</p>\n<p>In a further bid to keep weight down, it is specced with a Maxxis Dissector EXO casing front tyre, and a Rekon EXO+ rear. This model also has the EW-EN100 in-line display, rather than a dedicated bar-mounted unit.</p>\n<p>A burlier stock model is available in H15 guise. This has <a href=\"https://www.bikeradar.com/reviews/components/forks/suspension-forks/2021-fox-36-factory-grip2-fork-review/\">Fox’s Performance 36 fork</a> and <a href=\"https://www.bikeradar.com/news/2022-fox-float-x-dhx-shocks/\">Float X Performance rear shock</a>, which are beefier dampers than the 34 and Float DPS. Tyres remain the same as the H10, but this model has uprated four-piston Deore M6100 brakes and an XT M8100, <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-mountain/shimano-slx-m7100-groupset-review/\">SLX M7100</a> and Deore M6100 drivetrain mix. This model is claimed to weigh 20kg.</p>\n<p>The H30 represents increased value for money. It’s fitted with a Marzocchi Bomber Z2 fork and Float DPS Performance shock, and an SLX/Deore drivetrain build. Once again, though, tyres remain the same. Like the H15, the H30 is also claimed to weigh 20kg.</p>\n<h4>MyO for the Rise H</h4>\n<p>MyO, Orbea’s deep consumer customisation, is available on the new Rise H. Options include fork and shock upgrades, brake swaps, and tyre and seatpost alterations. Each upgrade has an associated cost, but the spec on the three stock models looks pretty good, so it remains to be seen how popular the MyO scheme will be for the Rise H.</p>\n<h2>How does the Rise H compare to other super-light electric mountain bikes?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The S-Works model weighs a claimed 16.9kg in size small or 17.3kg in large.</span></figcaption><span> <i>Etienne Schoeman</i></span></div>\n<p>The lightweight ebike market isn’t overflowing with competition, yet.</p>\n<p>The best-known models are both from Specialized. The <a href=\"https://www.bikeradar.com/reviews/bikes/electric-bikes/specialized-turbo-levo-sl-review/\">Turbo Levo SL</a> – essentially an electrified version of the brand’s <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/2021-specialized-stumpjumper-expert-review/\">Stumpjumper</a> – stands out as a bit of a pioneer in this category.</p>\n<p>Specialized took the idea of adding electrical assistance to a lightweight 150mm trail bike package in a bid to enhance the ride, rather than weigh it down with a heavy motor and battery. When we tested the Levo SL Expert back in 2020, we claimed it “handled like a conventional trail bike.”</p>\n<p>We found the XL-sized version of the SL Expert weighed a meagre 18kg, although this model was built from carbon fibre rather than the aluminium frame seen on the Rise H.</p>\n<p>The Levo SL’s 320Wh battery can last for about 3.5 hours in its maximum assistance mode, slightly longer than the Rise H is claimed to run for.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Specialized Kenevo SL is based on the Enduro and has an almost identical silhouette, despite the inclusion of a motor and battery.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<p>Specialized’s <a href=\"https://www.bikeradar.com/news/specialized-2022-kenevo-sl/\">Kenevo SL</a> takes the handling and suspension from its ever-popular <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/specialized-enduro-comp-review/\">Enduro</a> and adds a lightweight motor and battery. This, we know after extensive testing, decreases the amount of effort it takes to get to the top of the trail without sacrificing its ride feel on the way down.</p>\n<p><a href=\"https://www.bikeradar.com/reviews/bikes/electric-bikes/lapierre-ezesty-am-ltd-ultimate-review/\">Lapierre’s eZesty AM</a> is another bike in this SL category, and is fitted with the modular <a href=\"https://www.bikeradar.com/news/fazua-evation-motor-update/\">Fazua motor</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Electric mountain bikes can be a total hoot in the hills.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>This system essentially gives you two bikes in one, where removing the battery and drive unit – a quick and easy process – lightens the bike by 2.8kg from an already respectable 18.5kg (size large).</p>\n<p>The Fazua system has a 250Wh battery, quite a bit less than the Levo SL or Rise H, but as I found out when I tested the <a href=\"https://www.bikeradar.com/reviews/bikes/electric-bikes/kinesis-rise-pro-review/\">Kinesis Rise</a>, it’s still good for 600m of climbing in mixed-mode usage.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Fazua Evation motor is removable.</span></figcaption><span> <i>Ian Linton / Immediate Media</i></span></div>\n<p>When pitted against the competition, the Orbea Rise H’s balance of weight and range is an appealing proposition, but is it light enough when compared to full-fat ebikes to warrant the step down in motor torque?</p>\n<p>The money-no-object <a href=\"https://www.bikeradar.com/reviews/bikes/electric-bikes/specialized-s-works-turbo-levo-review/\">Specialized S-Works Turbo Levo</a> I tested recently tipped the scales at 22.36kg, making its size-large weight figure a meagre tyre upgrade away from the Orbea Rise H15 and H30 models.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Turbo Levo is a good-looking bike.</span></figcaption><span> <i>Ian Linton / Immediate Media</i></span></div>\n<p>Although the S-Works costs double, does having a 90Nm motor and a 700Wh battery, along with a much more capable (no matter the terrain type) spec, make the 2.36kg weight penalty worth it? Arguably, I’d rather take the additional heft for the extra climbing and descending performance, although I’m sure many people out there would disagree.</p>\n<h3>2022 Orbea Rise H10</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> 2022 Orbea Rise H10.</span></figcaption><span> <i>Orbea</i></span></div>\n<ul><li><strong>Frame: </strong>Orbea Rise H, 140mm travel, 29in wheels</li>\n<li><strong>Motor / battery: </strong>Shimano EP8 RS / Orbea RS 540Wh</li>\n<li><strong>Fork: </strong>Fox 34 Float Factory FIT4 3-Pos Adjust EVOL, 140mm travel</li>\n<li><strong>Shock: </strong>Fox Float DPS Factory 3-Pos Adjust EVOL, 210x55mm</li>\n<li><strong>Drivetrain: </strong>Shimano XT M8100</li>\n<li><strong>Brakes: </strong>Shimano XT M810, 203mm front, 180mm rear rotors</li>\n<li><strong>Wheels / tyres: </strong>Race Face Turbine R30 / Maxxis Dissector 3C MaxxTerra EXO 29×2.4in (f), Maxxis Rekon 3C MaxxTerra EXO+ 29×2.4in</li>\n<li><strong>Bar / stem: </strong>Race Face Next R / Race Face Aeffect R</li>\n<li><strong>Seatpost / saddle: </strong>OC MC20 dropper / Fizik Taiga S-alloy</li>\n<li><strong>Claimed weight:</strong> 19kg (size medium)</li>\n<li><strong>Price: </strong>£6,099 / $7,299 / €6,799</li>\n</ul><h3>2022 Orbea Rise H15</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> 2022 Orbea Rise H15.</span></figcaption><span> <i>Orbea</i></span></div>\n<ul><li><strong>Frame: </strong>Orbea Rise H, 140mm travel, 29in wheels</li>\n<li><strong>Motor / battery: </strong>Shimano EP8 RS / Orbea RS 540Wh</li>\n<li><strong>Fork: </strong>Fox 36 Float Performance GRIP 3-Pos, 150mm travel</li>\n<li><strong>Shock: </strong>Fox Float X Performance 2-Pos EVOL, 210x55mm</li>\n<li><strong>Drivetrain: </strong>Shimano XT M8100/SLX M7100</li>\n<li><strong>Brakes:</strong> Shimano Deore M6100, 203mm front, 180mm rear rotors</li>\n<li><strong>Wheels / tyres: </strong>Race Face AR30 / Maxxis Dissector 3C MaxxTerra EXO 29×2.4in (f), Maxxis Rekon 3C MaxxTerra EXO+ 29×2.4in</li>\n<li><strong>Bar / stem: </strong>Race Face Aeffect 35 / Race Face Aeffect R</li>\n<li><strong>Seatpost / saddle: </strong>OC MC20 dropper / Fizik Taiga S-alloy</li>\n<li><strong>Claimed weight:</strong> 20kg (size medium)</li>\n<li><strong>Price: </strong>£5,199 / $6,299 / €5,799</li>\n</ul><h3>2022 Orbea Rise H30</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> 2022 Orbea Rise H30.</span></figcaption><span> <i>Orbea</i></span></div>\n<ul><li><strong>Frame: </strong>Orbea Rise H, 140mm travel, 29in wheels</li>\n<li><strong>Motor / battery: </strong>Shimano EP8 RS / Orbea RS 540Wh</li>\n<li><strong>Fork: </strong>Marzocchi Bomber Z2, 140mm travel</li>\n<li><strong>Shock: </strong>Fox Float DPS Performance 3-Pos EVOL, 210x55mm</li>\n<li><strong>Drivetrain: </strong>Shimano SLX M7100/Deore M6100</li>\n<li><strong>Brakes: </strong>Shimano MT410, 203mm front, 180mm rear rotors</li>\n<li><strong>Wheels / tyres: </strong>Race Face AR30 / Maxxis Dissector 3C MaxxTerra EXO 29×2.4in (f), Maxxis Rekon 3C MaxxTerra EXO+ 29×2.4in</li>\n<li><strong>Bar / stem: </strong>OC1 / OC1</li>\n<li><strong>Seatpost / saddle: </strong>OC MC20 dropper / Fizik Taiga S-alloy</li>\n<li><strong>Claimed weight:</strong> 20kg (size medium)</li>\n<li><strong>Price: </strong>£4,599 / $5,299 / €4,999</li>\n</ul>","author":"Alex Evans","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"346512f74fed7e367b62e2db6fd070d0b0489de75dc8c5e98fc092ec1313a185","category":"Cycling"}