{"title":"Surface and Mineral Changes of Primary Enamel After Laser Diode Irradiation and Application of Remineralization Agents: A Comparative In Vitro Study","link":"https://www.preprints.org/manuscript/202408.1585/v1","date":1724288090000,"content":"Aim: The purpose of this study is to evaluate the remineralization potential of primary teeth enamel after being exposed to different laser diode therapy. Methods: Ninety-six vestibular primary teeth enamel samples were divided into eight groups (n=12) with varying treatments: control (G1), CPP-ACP-fluoride varnish (G2), diode lasers at 980 nm (G3), 808 nm (G4), 450 nm (G5), 980 nm + CPP-ACP-fluoride varnish (G6), 808 nm + CPP-ACP-fluoride varnish (G7), and 450 nm + CPP-ACP-fluoride varnish (G8). Each sample was assessed using DIAGNOdent® at baseline, post-treatment, and post-pH cycle re-mineralization. SEM imaging was performed before and after treatment and following the pH cycle. Results: The results indicated that the 980 nm and 808 nm diode lasers, both alone and in combination with CPP-ACP-fluoride varnish, either maintained or increased the calcium (Ca) weight percentage (Wt%) in the enamel. The 980 nm diode laser combined with CPP-ACP-fluoride varnish (G6) showed a significant increase in Ca Wt%, suggesting a strong remineralization effect. Similarly, the 808 nm diode laser alone (G4) also promoted a substantial increase in Ca Wt%. In contrast, the 450 nm diode laser, whether applied alone or in combination with CPP-ACP-fluoride varnish, resulted in a lower Ca Wt% and an increase in phosphorus (P) Wt%. Most groups, except for the CPP-ACP-fluoride varnish alone (G2), demonstrated an increase in P Wt%, indicating a complex interaction between laser therapy and enamel remineralization. Conclusions: The combined use of laser therapy with CPP-ACP-fluoride varnish significantly enhanced the remineralization of temporary teeth enamel. The 980 nm diode laser + CPP-ACP-fluoride varnish showed the most pronounced improvement in remineralization, while the 808 nm diode laser alone also effectively increased calcium solubility. These findings suggest that higher wavelength diode lasers, particularly when combined with remineralizing agents, can effectively enhance the mineral content of primary teeth and promote enamel remineralization.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"347a566df4d4db46b56c1aafaacceb34a71909005d420b7477e3e4693e3a87c7","category":"Interdisciplinary"}