{"title":"Evaluating the Accuracy of the Reverse Engineering Process of Worn Non-Standard Spur Gears Using Conventional Techniques and Measuring Instruments&mdash;Pilot Studies","link":"https://www.preprints.org/manuscript/202404.1787/v1","date":1714154650000,"content":"The authors undertook pilot studies to assess the accuracy of the reverse engineering process of worn nonstandard spur gears (non-standardized modulus value, unusual profile/pressure angle, high or low teeth), using conventional techniques and measuring instruments. Eight gears were tested, the module of which ranges from 1.020 to 4.98 mm and the number of teeth from 13 to 42. The key parameter, the basic pitch, was selected to estimate the accuracy of the process. The goal is to determine the value of the profile angle. Eleven models were proposed to estimate the nominal tolerance field, using various types of random data distribution. The tested gears were made in IT grade: 6, 7, 8 and 9 according to DIN 3961. Vernier disc micrometers with various measurement ranges were used for research. It has been shown that the nominal module does not have to be treated as a random variable in the population. EIG (Equation of Identity) was developed, allowing conversion of any gear with specific values of geometric parameters into an identical gear with alternative values of these parameters. The directions and degrees of shifts of the estimated tolerance fields relative to the nominal field were determined. The most effective estimating model was selected in the context of the percentage filling of the nominal tolerance field, taking into account the symmetric Student-Fisher distribution with a confidence level of 60%. Further directions of the research activities were described.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"34803fed0c80fcd6508b7220eb07c5fc59f8d839ec1929352590a6a9046b7389","category":"Interdisciplinary"}