{"title":"Instagram Plans to Take on TikTok With Full-Screen Video Content","link":"https://www.macrumors.com/2021/07/01/instagram-plans-fullscreen-video/","date":1625132921000,"content":"Instagram will start hosting full-screen videos as part of a major shakeup of the social platform, as the Facebook-owned company seeks to make itself more relevant in an era dominated by TikTok and YouTube.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/Instagram-Feature-1.jpg\" />\r\n<br />\r\nThat's the major take-home from a video shared on Wednesday by Adam Mosseri, the head of Instagram. In the video posted to his Instagram and <a href=\"https://twitter.com/mosseri/status/1410297743285829632?s=20\">Twitter account</a>, Mosseri said that the social platform no longer wants to be thought of as the \"square photo-sharing app,\" and will instead lean more into entertainment and video.\r\n<br />\r\n\r\n<br />\r\nInstagram is no stranger to video content, previously offered through things like IGTV, Reels, and Stories, but Mosseri said Instagram would be \"embracing video more broadly\" going forward, starting with \"full screen, immersive, entertaining, mobile-first video,\" which sounds a lot like TikTok, whose popularity Mosseri concedes is something Instagram wants to emulate.\r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>Changes are coming to video on Instagram 📺<br /><br />At Instagram we’re always trying to build new features that help you get the most out of your experience. Right now we’re focused on four key areas: Creators, Video, Shopping and Messaging. <a href=\"https://t.co/ezFp4hfDpf\">pic.twitter.com/ezFp4hfDpf</a></p>— Adam Mosseri 😷 (@mosseri) <a href=\"https://twitter.com/mosseri/status/1410297743285829632?ref_src=twsrc%5Etfw\">June 30, 2021</a></blockquote> </div>\r\n<br />\r\nInstagram will also start testing recommendations over the next couple of months, showing users in their Feed what they may not be following yet. (The platform actually began testing in this department just this week, with the introduction of topics, which users can opt to see more or less of.)\r\n<br />\r\n\r\n<br />\r\nUsers should expect plenty of experimentation in this area \"over the coming months,\" said Mosseri, and Instagram intends to be more public about what it's doing and why in the increasingly competitive social media space.<div>Tag: <a href=\"https://www.macrumors.com/guide/instagram/\">Instagram</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/01/instagram-plans-fullscreen-video/\">Instagram Plans to Take on TikTok With Full-Screen Video Content</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/instagram-plans-to-take-on-tiktok-with-full-screen-video-content.2302905/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=QQH-HiRv2YM:_XZCovfewlg:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=QQH-HiRv2YM:_XZCovfewlg:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/QQH-HiRv2YM\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"34878614b6105d15b53767c945725093af2da0c85b621e5283385284fe2b3149","category":"Apple"}