{"title":"IDC คาดการณ์การส่งมอบสมาร์ตโฟนจะลดลง ในปี 2023 เนื่องจากเงินเฟ้อ ตลาดไทยไตรมาสแรกหดตัวหนัก","link":"https://www.blognone.com/node/134114","date":1685595826000,"content":"<div><div><div><p>บริษัทวิจัย IDC ได้คาดการณ์ว่าการส่งมอบสมาร์ตโฟนทั่วโลกจะลดลงเนื่องจากภาพรวมเศรษฐกิจที่อ่อนลงและเงินเฟ้อ โดยคาดว่าจะลดลงถึง 3.2% จากก่อนหน้านี้เดือนกุมภาพันธ์คาดว่าจะมีการลดลง 1.1% ในปี 2023 สำหรับประเทศไทย ทาง IDC ก็มีรายงานเฉพาะออกมาว่าไตรมาสแรกของปีนี้ตลาดหดตัวลงถึง 25.7% เหลือ 3.45 ล้านเครื่อง</p>\n<p>สภาพตลาดของไทย โทรศัพท์รุ่นเริ่มต้น ราคาต่ำกว่า 7,000 บาทหดตัวหนักที่สุด เหลือส่วนแบ่งเพียง 51% จากเดิมเคยอยู่ที่ 60% ของตลาดรวม ขณะที่โทรศัพท์มือกลุ่มพรีเมี่ยมราคาเกิน 30,000 บาทกินส่วนแบ่งตลาดรวม 19% แล้วจากเดิมที่มีเพียง 11% โดยเฉลี่ยราคาโทรศัพท์เพิ่มขึ้น 26%</p>\n<p>ในปัจจุบันการส่งมอบสมาร์ตโฟนทั้งหมดคาดว่าอยู่ที่ 1.17 พันล้านหน่วยในปีนี้ ถึงแม้ว่าการส่งมอบสมาร์ตโฟนจะลดลงในปีนี้ แต่ IDC ยังคาดว่าจะมีการฟื้นตัวของตลาดสมาร์ตโฟนปี 2024 โดยมีการเติบโต 6% เมื่อเทียบเป็นรายปี แต่ความต้องการของผู้บริโภคยังคงฟื้นตัวช้ากว่าที่คาดไว้ในทุกภูมิภาค</p>\n<p>Nabila Popal ผู้อำนวยการฝ่ายวิจัยจาก IDC บอกว่า “หากปี 2022 เป็นปีของสินค้าคงเหลือมากเกินไป ปี 2023 ก็เป็นปีแห่งความระมัดระวัง” ในขณะที่ทุกแบรนด์สมาร์ตโฟนอยากให้มีสินค้าพร้อมขายเมื่อตลาดฟื้นตัว แต่ก็ไม่สามารถเสี่ยงมีสินค้าคงเหลือนานเกินไปได้ สิ่งนี้บ่งบอกว่าแบรนด์สมาร์ตโฟนที่สามารถรับความเสี่ยงในเวลาที่เหมาะสม อาจจะทำให้ได้รับผลตอบแทนที่ดีจากการเพิ่มส่วนแบ่งตลาดได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/4d6d499b364bcd0807651248d22f6f4a.png\" /><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0b2c9106df438d54edc032963dd61257.png\" /></p>\n<p>ที่มา: <a href=\"https://www.cnet.com/tech/mobile/smartphone-shipments-are-forecast-to-decline-in-2023-thanks-to-inflation/\">CNET</a>, <a href=\"https://www.idc.com/getdoc.jsp?containerId=prAP50747323\">IDC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/idc\">IDC</a></div><div><a href=\"/topics/smartphone\">Smartphone</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"34874f58b761d7bbfae54b0570b88a36da0bf609b3007d3baf66b231412ee4c5","category":"Thai"}