{"title":"How to bypass confirmation when using Siri to compose messages","link":"https://www.macworld.com/article/2004045/how-to-bypass-siri-confirmation.html","date":1692262800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Siri makes it a breeze to dictate a message to someone. Say, “Message <em>person</em>,” and Siri asks what you’d like to tell them. When your dictation is complete, Siri reads back the body of the message and then asks if you’d like to send it, as well as displaying a Send button in some Focus states.</p>\n\n\n\n<p>However, you can streamline the process. Go to <em>Settings</em> &gt; <em>Siri &amp; Search</em> &gt; <em>Automatically Send Messages</em> and enable <em>Automatically Send Messages</em>. This streamlines the process of sending messages—but you can send up sending some howlers, depending on how perfectly Siri transcribed what you said. When enabled, you can then choose separately whether to send automatically when using either connected headphones or CarPlay. (Unfortunately, you can’t disable automatic sending via Siri on your phone and just enable it for CarPlay or headphones.)</p>\n\n\n\n<p>Your recipients will see the label “Sent with Siri,” whether sent immediately or after listening to it read back to you, which can help them understand why you told them you were “on your weight” instead of “on your way.”</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/mac911-siri-automatically-send-messages-bordered.png\" alt=\"Siri automatically Send Messages setting \" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/mac911-siri-automatically-send-messages-bordered.png?quality=50&amp;strip=all 1183w, https://b2c-contenthub.com/wp-content/uploads/2023/07/mac911-siri-automatically-send-messages-bordered.png?resize=300%2C246&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/mac911-siri-automatically-send-messages-bordered.png?resize=768%2C630&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"840\" /><figcaption><p>You can opt to send messages automatically when dictated directly via the mic on your iPhone and optionally via headphones or CarPlay.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"348d3c8792d89f2edce1f0a3eb2ad3e0808c60141307f1889c2e822e3ea61342","category":"Apple"}