{"title":"Nest Characteristics and Nest Site Selection of Giant Babax in Lhasa","link":"https://www.preprints.org/manuscript/202404.0814/v1","date":1712890253000,"content":"The Giant Babax, an endemic bird in China and a nationally protected wildlife species of Class Ⅱ, is primarily distributed in southern and southeastern Tibet. To investigate the factors influencing nesting site selection, this study conducted research on nest characteristics and nesting site preferences at four sample sites around Lhasa from March to October 2023y, using systematic search methods, tracking methods, and sampling methods. The research findings are as follows: (1) The average nest depth was (7.70±1.47)cm, nest height was (19.58±2.97)cm, inner diameter was (10.64±1.73)cm, outer diameter was (24.65±4.8)cm, average weight was (162.3±13.5)g, and average nest spacing within the plot was 396.93m. (2) The nests of Giant Babax were predominantly found on vegetation such as Salix longistamina (38%), Hippophae gyantsensis (20%), Rosa sericea Lindl. (14%), and Populus szechuanica Schneid(11%). They showed a preference for artificial secondary forests as nesting sites. (3) Giant Babax exhibited a preference for habitats with robust trees that had high canopies while being distant from houses and roads, but close to water sources; moreover, the canopy of the nesting tree played a crucial role in their choice of nesting sites. (4) The reproductive success rate reached 76%, with key factors affecting it being the canopy coverage of the nesting tree and the number of helpers. These research results provide fundamental data support for population conservation efforts and ecological resource management strategies concerning the Giant Babax.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"348fe7bc46e3f28267a7618dd071058cea39c88edeb9a3c3eeea3fdc672acc32","category":"Interdisciplinary"}