{"title":"41 Social and institutional trust: A comparison between non-associated and associated producers in Southeast Brazil","link":"https://academic.oup.com/jas/article/102/Supplement_1/4/7617921?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>The social and institutional trust between two groups of dairy producers in the State of Sao Paulo, Brazil was evaluated. The entity used in this comparison was the Rural Producers Association (RPA), in which two groups were formed: a) RPA members (AG); and b) RPA non-members (NAG). The questionnaire developed used model questions from the World Values Survey. Among a total of 38 producer-members of the RPA, 22 (58%) responded to the questionnaire. For the non-member producers, 44 were identified, while 39 (89%) responded to the questionnaire. To assess social trust, the following question was asked: \"Generally speaking, would you say that people can be trusted or that we need to be very careful when dealing with people?\". In AG, 81.8% of the producers responded that we need to be very careful when dealing with other people, and among the NAG producers, 87.2% also agreed with such a statement. Despite the lack of social trust in AG, 77.1% of the members fully or partially trust their association. To assess levels of trust in national institutions by producers, a question was asked as follows: \"To what extent do you trust the institutions listed below?\". For more than 50% of the NAG group, none of the institutions presented deserved full trust, reinforcing the lack of trust, as indicated in the previous question. For those in the NAG group that chose the option \"I trust completely\", the institutions opted were as follows: religious (46.2%), research institutions (43.6%), public universities (38.5%), and rural extension services (33.3%); while those opted as “I do not trust\" were represented by political parties (82.1%), the municipal government (64.1%), and the national congress (61.5%). In the AG group, the institutions with the greatest levels of trust were the rural extension services (54.5%) and the RPA (54.5%), religious institutions (40.9%), public universities (40.9%), and research institutes 36.4%. Moreover, the institutions least trusted were political parties (63.6%), national congress (63.6%), municipal government (36.4%), and land organizations (36.4%). None of the producer groups were officially affiliated with political parties. An open-ended question was asked as follows: \"What do you think about the current situation of the association, cooperative, or dairy in which you participate or commercialize milk with?\" In the AG, 81.75% see RPA positively, and 18.25% believe that the association was in a bad situation and could even end. In the NAG, 59% of the producers commercialize milk in some type of organization (other than the RPA); in which among these, 43.47% have a negative image of such an organization in general. It is suggestive that regardless of the RPA participation, producers interviewed lack social trust. Future analysis is warranted to involve a multi-location and a broader population sampling.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"348f0d5c69716fb3bc94ed70631b689819a1f3371430371234f7c556f9b33721","category":"Environment"}