{"title":"An investigation into patterns of Alcohol drinking in Scotland after the introduction of minimum unit pricing","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308218","date":1722520800000,"content":"<p>by Duyen Thuy Nguyen, Michael Donnelly, Minh Van Hoang, Ciaran O’Neill</p>\r\nBackground <p>In 2018, Scotland became the second country to implement minimum unit pricing (MUP) for all types of alcoholic beverages. The aim of this study was to examine the effect of the policy.</p> Method <p>Three national household-level surveys were used: Scottish Health Surveys (2008–2021), Health Surveys in England (2011–2019), and Northern Ireland Continuous Household Survey (2011–2015). First, a generalized ordered logistic model examined patterns of drinking solely in Scotland from 2008–2021 covering current drinking, drinking categories and the weekly consumption (in alcohol units). Secondly, difference-in-difference (DID) analysis was employed to examine changes in “social drinking” behaviours in Scotland after the announcement in 2012 (2011–2015, Northern Ireland and England as comparators) and after the adoption of the policy in 2018 (England as a comparator, with two timeframes 2016–2019 and 2013–2019).</p> Results <p>Overall, drinking in Scotland began to decline prior to 2012 and dropped further with the enactment of MUP in 2018. In response to MUP, the likelihood of abstention increased along with a slight decrease in the prevalence of heavy drinking. The overall amount of drinking fell by about 8% after 2012 and 12% after 2018 (as compared to 2008–2011 level), with a significant decline seen in moderate drinkers but not of those who drank at hazardous or harmful levels. The DID analyses confirmed the reduction in current drinking in Scotland starting since 2012 and continued post-MUP in 2018.</p> Conclusion <p>This study points to the impact of MUP in Scotland with a potential role for ‘policy signalling’ by the Scottish Government’s with a multiple-buy discount ban and MUP’s announcement since 2011–2012. Indications of impact include a clear decline in alcohol consumption levels and a small but noteworthy change in prevalence of overall drinking and heavy drinking.</p>","author":"Duyen Thuy Nguyen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"349854ccc3021f8c2c103191308f409a59403e81ed3066b5a2687cbc48bc66c6","category":"Interdisciplinary"}