{"title":"Gastrointestinal digestion of olive leaf waste from olive mill production chain in a simulator of the gastrointestinal tract","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13576?af=R","date":1715767713000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Currently, olive leaves are considered waste, although their high phenolic content makes them a source of antioxidants that could be used directly. The aim of this work was to study the behavior of phenolic compounds contained in olive leaf from the olive mill production chain during their gastrointestinal digestion.</p>\n<h2>RESULTS</h2>\n<p>Phenolic compounds in the gastric digestion analyzed by high-performance liquid chromatography–diode array detection–mass spectrometry increased by 58% to 314.5% compared to the meal, while in the intestinal stage they ranged from 1.87 to 9.04 times higher. An increase of between 187% and 903% in bioaccessibility of phenolic compounds in the intestinal phase was observed, except for verbascoside. Furthermore, such compounds were fully bioavailable, except for apigenin-7-<i>O</i>-glucoside, which showed a bioavailability of 56%.</p>\n<h2>CONCLUSION</h2>\n<p>The current study showed that the concentration of oleuropein, apigegin-7-<i>O</i>-glucoside, hydroxytyrosol hexoside and hydroxytyrosol contained in olive leaf continued to be extracted during the gastrointestinal digestion process. Furthermore, the results obtained with respect to their bioaccessibility and bioavailability suggest a good disposition to pass into the bloodstream where they could exert beneficial effects. Therefore, these results are promising for olive leaf becoming a consumable by-product that could be directly ingested through a simple infusion. © 2024 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"María Esther Martínez‐Navarro, \nJorge Escobar‐Talavera, \nCristina Cebrián‐Tarancón, \nSilvia Llorens, \nGonzalo L Alonso, \nM. Rosario Salinas","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"34982d0b93e867974ef78f29a7081cd61b886e4c2a0fe1ab88aa297d83584c37","category":"Environment"}