{"title":"A First Timer’s Take on Sea Otter – Dominique Powers","link":"https://theradavist.com/2021/10/a-first-timers-take-on-sea-otter/?utm_source=rss&utm_medium=rss&utm_campaign=a-first-timers-take-on-sea-otter","date":1634817602000,"content":"<p>There’s dust, cold, chaos, and bikes.  Bikes everywhere. Almost more bike tracks than footprints in the thick dirt of the Laguna Seca Raceway paddock, where rows of tents and more flags than the eye can count have taken over for the weekend – this is The Sea Otter Classic.  It’s my first time not only to Sea Otter but to a bike expo- having gotten seriously into cycling during the quarantine this first wave of events post- pandemic is also my first wave of cycling events- period. I did my first bike race two months prior, and while there was an expo there it nowhere near compares to this ocean of logos.  Being a photographer in the cycling world this weekend is a chance to connect with clients I haven’t seen in a while, touch base with connections I have prior only talked to through emails and DM’s, and hug the bejeezus out of the rad gravel ladies I photographed for ‘<a href=\"https://theradavist.com/2021/09/the-leaders-of-gravel-dominique-powers-medium-format-portraits/\" target=\"_blank\">The Leaders of Gravel</a>’, a series here on The Radavist.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/20211010_SeaOtter_Layout-4-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>It’s not long before I see a familiar face, and before I know it the day is over. Filled with oo’s and ahh’s over new tech and snazzy bikes, I even got to name the tarantula Betty who has residence under Specialized’s new Crux, who I check on every morning to see if she moves. There are so many people to say hello to, brands to inquire about, fangirl over, and new friends to make. All of this chaos happening upon the backdrop of road races whizzing by on the racetrack, and XC Slalom riders kicking up backlit dust on the hill behind the track.  Not only are races almost constantly occurring, but there are group rides galore! Clearly, I partake in one with ice cream at the end but am still impressed by the opportunity for event-goers to interact with the sport in so many different ways- whether racing, doing a group ride, or simply demo-ing a new e-bike.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/20211010_SeaOtter_Layout-6-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The magical part of the weekend for me is the connections I am able to make over the course of my three days spent in this chaotic flag-land.  Like Giancarlo who I photograph winning a road race Friday morning, and later meet in person at the <a href=\"https://www.wahoofitness.com/\" target=\"_blank\">Wahoo</a> tent where he is working.  Or Chris at <a href=\"https://www.adidas.com/us/five_ten\" target=\"_blank\">5.10</a> who I get to nerd out about rock climbing with (my years-long prior passion before cycling took over my life).  Or Cassie and the badass ladies at <a href=\"https://wild-rye.com/\" target=\"_blank\">Wild Rye</a> who are a breath of fresh air and florals amidst the POW POW BIKES BIKES BIKES imagery and energy coming from so many other tents. I feel like I walked away from this weekend with so much enthusiasm for the people I met and the stories I want to continue to tell through images. I loved bikes going into this weekend and am even more in love with the community surrounding them coming out of it.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/20211010_SeaOtter_Layout-10-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I’m going to end this with an ode to the morning bun at <a href=\"https://www.captainandstoker.com/\" target=\"_blank\">Captain + Stoker</a> that I started every day with – thank you Tyler for the best coffee &amp; pastries around.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/20211010_SeaOtter_Layout-5-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Morning bun, oh morning bun,</p>\n<p>Soft yet crisp your flaky outsides give way</p>\n<p>to the softest buttery layers, I can’t even dream of.</p>\n<p>Yet wait, what flavor overcomes?</p>\n<p>Tis bright sunny citrus lifting my tongue</p>\n<p>to sing praises of the day…</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"3499d47afd112ea561e0839cc15ff69f850e9466fd253ac58367bf48cea63b6c","category":"Cycling"}