{"title":"เป็นสตรีมเมอร์มันเหนื่อย Twitch จ่ายเงินให้สตรีมเมอร์มากขึ้น แต่เกินครึ่งยังกระจุกอยู่กับสตรีมเมอร์แค่ 1%","link":"https://www.blognone.com/node/125230","date":1634035886000,"content":"<div><div><div><p>หลังมีข้อมูลหลุดมาจาก <a href=\"https://www.blognone.com/node/125139\">Twitch</a> กว่า 100GB ซึ่งในนั้นมีข้อมูลรายได้ของเหล่าสตรีมเมอร์ด้วย โดยเป็นข้อมูลตั้งแต่เดือนกรกฎาคมปี 2019 จนถึงเดือนกันยายน ปี 2021</p>\n<p>เว็บไซต์ The Wall Street Journal (WSJ) ได้นำข้อมูลเหล่านี้มาวิเคราะห์ พบว่า Twitch จ่ายเงินรวมให้สตรีมเมอร์ไปแล้วถึง 889 ล้านดอลลาร์ ตั้งแต่เดือนมกราคมถึงกันยายนของปี 2021 เทียบกับ 517 ล้านในช่วงเดียวกันเมื่อปี 2020</p>\n<p>ข้อมูลรายจ่ายแต่ละเดือนพบว่า Twitch จ่ายเงินให้สตรีมเมอร์เพิ่มขึ้นมากในช่วงสองปีนี้ โดยเริ่มพุ่งสูงช่วงการระบาดของไวรัส COVID-19 จาก 37.02 ล้านดอลลาร์ในเดือนกุมภาพันธ์ 2020 เป็น 91.62 ล้านดอลลาร์ ในเดือนธันวาคม 2020 และหลังจากนั้นก็จ่ายเงินให้สตรีมเมอร์ตั้งแต่ 88-110 ล้านดอลลาร์ต่อเดือนจนถึงเดือนกันยายน 2021</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/feb2babbe20937a22e6413719d8e5128.png\" /></p>\n<p>ข้อมูลแสดงให้เห็นว่าเงินที่ Twitch จ่ายให้สตรีมเมอร์กว่า 896,261 บัญชี รวม 889 ล้านดอลลาร์ในปีนี้ กระจุกตัวอยู่กับสตรีมเมอร์เพียง 1% ถึง 529 ล้านดอลลาร์  โดยอยู่กับสตรีมเมอร์ที่ทำรายได้สูงสุด 100 ลำดับแรก รวม 82 ล้านดอลลาร์ อีก 900 ลำดับถัดมาอีก 138 ล้านดอลลาร์ และที่เหลือที่เหลือใน 1% อีก 302 ล้านดอลลาร์</p>\n<p>WSJ ระบุว่าผู้ได้รับรายได้สูงสุดในปีนี้ได้เงินไปแล้วกว่า 5 ล้านดอลลาร์ ส่วนสตรีมเมอร์กว่า 3 ใน 4 ที่มีรายได้ของปีนี้ ทำรายได้รวมไม่ถึง 120 ดอลลาร์ และกว่าครึ่งไม่ถึง 28 ดอลลาร์ (Twitch จะให้ถอนเงินได้เมื่อรายได้ถึง 100 ดอลลาร์) ถือว่าสตรีมเมอร์ทั่วไปยังห่างไกลคำว่ารวยอยู่มาก เมื่อเทียบกับรายได้เฉลี่ยต่อครัวเรือนรายปีของสหรัฐฯ ที่อยู่ที่ 67,521 ดอลลาร์ แต่สตรีมเมอร์ระดับท็อปๆ ก็ทำเงินได้ไม่น้อย</p>\n<p>อย่างไรก็ตาม หากเทรนด์นี้ขยับขึ้นไปเรื่อยๆ มีความเป็นไปได้ว่ารายได้ของสตรีมเมอร์ทั่วไปอาจเพิ่มขึ้นได้เช่นกัน และสตรีมเมอร์ทั่วไปส่วนใหญ่สตรีมเกมเป็นอาชีพเสริมเท่านั้น การนำไปเทียบกับรายได้ครัวเรือนเฉลี่ยอาจไม่แสดงภาพรวมทั้งหมดได้ดีนัก</p>\n<p>ที่มา - <a href=\"https://www.wsj.com/articles/twitch-streamer-earnings-increase-for-top-gamers-data-from-hack-shows-11633802185?mod=tech_lead_pos10\">WSJ</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/twitch\">Twitch</a></div><div><a href=\"/topics/game-streaming\">Game Streaming</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"34a3c34aeaeec9e15e56e2aae46f67bf40fbb3c5fa404adc35e2762867c77aad","category":"Thai"}