{"title":"Absence of AQP4 Prolongs the Presence of a CD11c+ Microglial Population during Postnatal Corpus Callosum Development","link":"https://www.preprints.org/manuscript/202407.0280/v1","date":1719967802000,"content":"Aquaporin-4 (AQP4) expression is associated with development of congenital hydrocephalus due to its structural role in the ependymal membrane. Gene expression analysis of periaqueductal tissue in AQP4-knockout (KO) mice at 11 days of age (P11) showed modification in ependymal cell adhesion and ciliary protein expression that could alter cerebrospinal fluid homeostasis. A microglial subpopulation of CD11c+ cells were overexpressed in the periaqueductal tissue of mice that did not develop hydrocephalus, suggesting a possible protective effect. Here, we verified the location of this CD11c+ expression in the corpus callosum (CC) and cerebellum of AQP4-KO mice and analysed its time course. Immunofluorescence labelling of the CD11c protein in the CC and cerebellum of WT and KO animals at P3, P5, P7 and P11 confirmed an expanded presence of these cells in both tissues of the KO animal; CD11c+ cells appeared at P3 and reached a peak at P11, whereas in the WT animal they appeared at P5, reached their peak at P7 and were undetectable by P11. The gene expression analysis in the CC samples at P11 confirmed the presence of CD11c+ microglial cells in this tissue. Among the more than 4000 overexpressed genes, Spp1 stood out with the highest differential gene expression (600), with other genes such as Gpnmb, Itgax, Cd68 and Atp6v0d2 also identified as overexpressed. Therefore, CD11c+ cells appear to be necessary for normal corpus callosum development during postnatal life, and absence of AQP4 prolonged its expression in this tissue.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"34a6cfb93f7b3a3fc9861098c265df978d5283b7f8378c9393a1f6a7a4ab98f2","category":"Interdisciplinary"}