{"title":"When Labor Turns to Love: Build Your Own Bike With LaFraise Cycles – Sam Rice","link":"https://theradavist.com/lafraise-cycles-frame-building/","date":1704369628000,"content":"<p><em>As part of their European tour this summer, Sam Rice and Bec Norman stopped off in Roubaix, France to spend a few days with<a href=\"https://www.instagram.com/lafraisecycles/\" target=\"_blank\"> Andreas Behrens</a> of <a href=\"https://www.lafraisecycles.com/home\" target=\"_blank\">LaFraise Cycles</a>. On the dawn of his 200th student, they share a shop visit that draws on Andreas’s mesmerizing past and his present-day mission to share the craft of framebuilding with people around the world.<span></span></em></p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-15.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-15.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-15.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-15.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-15.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-15.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-15.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-15.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>The smell of machine oil, rust and wet wood lingers in the air. Half-built bike frames cling to old heating pipes above the cold concrete floor. It’s damp and dark and industrial. At the back of the room an old pot-belly stove stands proudly, warning of winters past where freezing machinists and cold metal collided. But as the spring sun breaks above the clouds and pours through the full-length factory windows, the old forge bursts with life.</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-13.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-13.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-13.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-13.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-13.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-13.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-13.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-13.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Brazing torches flicker and flame. A mix of oxygen and acetylene gases create bright green flames that resemble lightsabers glowing in the dark. In the middle of the room, Ludovic’s frame is upturned in the jig, bottom bracket junction skyward, tubes bathed in flux. Andreas demonstrates the next sequence, then passes the torch to his student, Ludovic, and watches as he begins building heat in the tube set. Andreas circles the action. Hands-on, but not overpowering, he occasionally steps in to help find the perfect angle, but by now Ludovic is confident with the torch and flows bronze around his BB junction with skill.</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-17.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-17.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-17.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-17.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-17.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-17.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-17.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-17.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>We’ve joined the action on the penultimate day of the five-day framebuilding course at LaFraise Cycles. Marine and Ludovic are this month’s students. Originally hailing from Lyon, they put their lives on hold for a week and traveled 700 km to Roubaix, seeking to learn the steely art of bicycle alchemy. “For us, the bike is more than just a means of transport. It represents self-expression, culture and identity,” Ludovic tells me as he begins unclamping his frame from the jig. “So when we decided to design our own bikes this year, we wanted more than just a transaction with a framebuilder. We wanted to understand what it means to build a bike by hand, and how it feels to ride something you’ve created yourself.” He pauses for a moment, looks down at his dry, swarf-sprinkled hands and says, “It’s a hell of a lot of work, but worth every second!”</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-7.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-7.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-7.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-7.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-7.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-7.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-7.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-7.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Ludovic and Marine are building a pair of filet-brazed, brakeless fixies this week. Their builds feature a mix of skinny Columbus Zona and SL tubing, a beautiful lugged fork and Bear Component track drop-outs. Designed in relationship with Andreas in the weeks before the course started, the inspiration for their bikes is rooted in the raw simplicity of fixie culture itself. From the omission of brakes to their decision to leave the frames unpainted, their bikes epitomize the utilitarian, punk-fixie culture they love and live by.</p>\n<h3>Measure. Miter. Braze</h3>\n<p>Marine stands in the middle of the workshop. Bathed by the skylight above, her Thrasher hoodie and thick clad shirt dance with the changing clouds. A rod of bronze in one hand, a brazing torch in the other. She looks over to Andreas. “Remember, just let the heat do the work,” he says reassuringly as she heats the rear dropouts and begins joining the final tubes in her rear triangle. I don’t think she breathes the whole time she’s brazing. Locked into focus, time stands still. And in that moment, the past four days of theory, practice, patience and hard work wash over her. I watch as newly acquired knowledge transforms into tangible skills and as she lays the final brass, she lets out a smile that stretches from ear to ear.</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-32.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-32.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-32.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-32.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-32.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-32.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-32.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-32.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>It’s hard to believe that a week ago, Marine worked as a nurse and Ludovic as an interior designer in Lyon. But now they’re both on the cusp of leaving LaFraise with a frame and fork built entirely by their own hands. “In the six years I’ve been teaching at LaFraise, I’ve been lucky enough to share the craft with 200 students from over 15 countries and with a diverse mix of backgrounds,” Andreas tells me as we enter the breakout space, eager for lunch. “My youngest student was an 18-year-old high schooler. The oldest, a 67-year-old retired policeman. But no matter the student’s background, age or experience, the thing that unites them is a desire to create something tangible and unique with their own hands. An object that starts life as a pile of metal tubes, but by the end of the week, is transformed into a bicycle that’s ready to ride and enjoy for decades to come.”</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-4.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-4.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-4.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-4.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-4.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-4.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-4.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-4.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>An old calor gas heater flickers to life just beside us. It’s raining outside and, amongst the patter of water on the window panes, the five of us huddle around the dining table. Andreas has made a huge bowl of vegetable pasta, Ludovic has brought fresh bread from the local boulangerie, and Marine shares great chunks of delicious soft cheese from Lyon. Conversation, food and thoughts flow freely as we all get comfortable, warm, and full. Then Bec turns to Andreas and asks, “Why do you choose to teach people how to build their own bikes, as opposed to just selling them a custom bike, built by you?” Andreas takes a sip of his water, smiles at Bec warmly and says, “At one point in time, there were framebuilders in almost every city in France. They served their local community by building handmade bikes so people could travel, commute to work and explore their region. So what I’m trying to achieve with the school—in a small way—is a renaissance of that time. I want to inspire a new generation of framebuilders to pick up the torch, because if we don’t share the knowledge and joy of building hand-made bikes, the only real loser is the craft itself.”</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-33.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-33.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-33.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-33.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-33.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-33.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-33.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-33.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>From Tech to Teaching: Meet Andreas</h3>\n<p>The rain has stopped now and Andreas is eager to show us Roubaix by bike. We leave the workshop and pedal toward the beautiful Parc Barbieux. Cars pass us closely as our chests puff and legs fire into action. We meet a long gravel path along the river and settle into conversation about Andrea’s childhood and how he came to love bikes.</p>\n<p>“I was born and raised in Magdeburg, East Germany in 1973.” Andreas tells us as he maneuvers to avoid the wet puddles. “At that time, East Germany was under the control of communist Soviet Union, so cars were nigh on impossible to find.” He continues, “so my relationship with bicycles was born more out of utilitarian need than anything else. The bike was how I traveled to school everyday, arrived at sports matches and carried groceries across town for my family.” As we pedal further together, I reflect on my own childhood: filled with cars and buses and planes and trains. Transport taken for granted. Freedom taken for granted. How was this less than 50 years ago? It feels almost surreal.</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-20.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-20.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-20.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-20.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-20.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-20.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-20.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-20.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>“Then in November 1989, the Berlin Wall fell, bringing freedom to East Germany. While many leaped at the chance to drive or fly, I set out from Magdeburg by bike: cycle touring through Germany, Hungary and Italy, until I ended up in Morocco.” He explains as he splashes through the puddles now without a care in the world. But it wasn’t just Europe that was open to Andreas post 1989. International borders and far-flung countries that he’d dreamt of as a kid were all accessible too. “When I graduated university with a degree in business administration, I knew I wanted to travel more. So I built up some experience at various tech companies during the .com boom, then moved to Asia, where I ended up working at TripAdvisor,” Andreas tells me as we continue along the riverside gravel.</p>\n<p>Amongst the bright lights, packed streets and booming cycling culture of Tokyo and Singapore, Andreas rediscovered his passion for classic French Randoneurs. “Perfectly restored, timeless and classic: the characteristic horizontal top tube, fenders and luggage racks reminded me of the bikes I rode back in East Germany as a kid.” He explains as a gentle smile drifts across his face. “Then by chance, I read an article in the newspaper about a Singaporean guy who had enrolled at the United Bicycle Institute (UBI) in Oregon and learned to build bikes. I was so inspired by his story—and at the same time seeking a big change in my life—that I enrolled in the course the next year, built my first frame and completely fell in love with the craft.”</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-16.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-16.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-16.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-16.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-16.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-16.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-16.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-16.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Buoyed by his newfound passion for framebuilding, Andreas quit his job at TripAdvisor, moved to France to be close to his family, and in 2015 launched LaFraise Cycles. “In my first year I built 15 frames. It was a time of pure experimentation, learning and, of course, many mistakes.” We pull over to park a bench and sit for a moment, watching the river gently roll past as we talk more. “But the framebuilding school came later as a, kind of, happy accident, honestly. I had only been building bikes myself for 18 months, when a guy called Jean-Philippe (JP) reached out to see if I’d teach him how to build a light randonneur frame with disc brakes.” He smiles and shakes his head, clearly remembering those conversations with a mix of fondness and frustration. ”At first I was reluctant. But JP was very persuasive and passionate about the project, so eventually I caved and a few days later, he walked out of the workshop as the first student to build a bike at LaFraise Cycles.”</p>\n<p>In a matter of weeks, the news of a brand new framebuilding school in Roubaix had spread like wildfire throughout the French cycling community and press. Enquiries for the school came in thick and fast and soon enough, Andreas was inundated with bookings for a course that didn’t really exist yet. “At first I was slightly nervous about the demand, but at the same time completely in awe of the community’s desire to learn about building bikes. So, alongside the bespoke frames I was building, I decided to develop my own framebuilding curriculum, dubbed ‘build your own bike in five days’ and launched it to the public officially in 2017.” Six years later, under the moniker of La Fraise Cycles, Andreas has now shared his workshop, knowledge and passion with 200 students from around the globe.</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-41.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-41.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-41.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-41.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-41.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-41.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-41.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-41.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>But his impact on the craft doesn’t stop when people leave the course. After training at LaFraise, one of Andreas’ first students, set up his own bike-building business, <a href=\"https://www.instagram.com/cycles_savarino/\" target=\"_blank\">Savarino Cycles,</a> and in 2019 participated in the <a href=\"https://www.associationartisansducycle.com/concours-2022-francais\" target=\"_blank\">Concours de Machine</a>. Two former students are now full-time framebuilders for <a href=\"https://www.cyfac.fr/\" target=\"_blank\">Cyfac</a>, others have created their own brands like <a href=\"https://www.epsilon-bikes.com/\" target=\"_blank\">Epsilon Bikes</a>, <a href=\"https://www.cycles-soca.fr/\" target=\"_blank\">Cycles Soca</a> and most recently <a href=\"https://buteocycles.fr/\" target=\"_blank\">Buteo Cycles</a>. And another student has recently been selected to participate in the <a href=\"https://www.victoire-cycles.com/en/\" target=\"_blank\">Victoire</a> organized apprenticeship programme, which is the first of its kind in Europe.</p>\n<p>For Andreas, every new builder represents a step forward for the craft. As he says, “there’s enough space for multiple builders in France and across the world. We shouldn’t be fearful of competition, we should embrace it. Framebuilders are better when we’re helping each other, teaching each other and sharing the knowledge.”</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-25.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-25.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-25.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-25.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-25.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-25.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-25.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-25.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Passing the torch to a new generation</h3>\n<p>It’s 5:00 pm on Friday afternoon now and the final hours of the course are quickly approaching. Marine and Ludovic are silent. Immersed entirely in the final precious moments of filing, sanding and finessing. As I watch them meticulously inspect every filet and polish every blemish, I think about the journey they’ve been on this week. A journey that’s taken them from bike enthusiasts to bike builders in just five days.</p>\n<p>Tonight they’re leaving the workshop with their completed framesets. Bikes they’ve put their blood, sweat and tears into creating. But they’re also leaving the course with much more than just an object, more than just a bunch of metal tubes glued together. They’re leaving with a brand new set of skills, a personal appreciation for framebuilding, and a bucket load of confidence to continue learning.</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/LaFraise-22.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/LaFraise-22.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/LaFraise-22.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/LaFraise-22.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/LaFraise-22.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/LaFraise-22.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/LaFraise-22.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/LaFraise-22.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p><em>Interested in building your own frame and fork with Andreas? Well, he’s currently running monthly courses and can accommodate English, French and German speaking students.  Learn more <a href=\"https://www.lafraisecycles.com/framebuildingcourse\" target=\"_blank\">here</a> about the process, costs and available dates. But don’t wait around, I’m sure the limited spaces he has each year will book up fast!</em></p>\n<p><em>A huge thank you to Andreas, for inviting us into your world and for letting us crash at your apartment! And to Marine and Ludovic for sharing your course, passion, and cheese! We can’t wait to see those brake-less fixies in the wild.</em></p>\n<p>The post <a href=\"https://theradavist.com/lafraise-cycles-frame-building/\">When Labor Turns to Love: Build Your Own Bike With LaFraise Cycles</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"34adea678999bbbd98f0d82c8ff60a11d97ab64c62feca3adf86cd30d4791853","category":"Cycling"}