{"title":"Insights on the distribution, catch and release and public sentiment towards recreational angling of mahseers—A study of YouTube videos from India","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4176?af=R","date":1716869363000,"content":"<h2>Abstract</h2>\n<p>\nMasheers are a group of large-bodied freshwater fishes popularly known as the ‘Tiger of Rivers’. Their size and fighting power make them one of the most popular game fishes and a dream catch of many recreational anglers in the Indiansubcontinent.\nThe present study explored the recreational angling (RA) videos of five mahseer species (<i>Tor khudree</i> [Deccan mahseer], <i>Tor putitora</i> [golden mahseer], <i>Tor remadevii</i> [humpback mahseer], <i>Tor mosal</i> [mosal mahseer] and <i>Neolissochilus hexagonolepis</i> [chocolate mahseer]) recorded from India and uploaded on the social media platform YouTube from January 2010 to October 2022. We did not come across any RA videos of <i>T. mosal</i> and <i>T. remadevii</i>; hence, further analyses were carried out on the remaining three focal species.\nNo seasonality was observed in the frequency of RA videos uploaded on YouTube, and <i>T. khudree</i> attracted the highest number of views per video. Catch and release, an ethical RA practice, was noticeably low in the case of <i>N. hexagonolepis</i>. The length of catch was found to be positively associated with the social engagement received by the RA videos of all three mahseer species.\nAngler- and angling-related remarks and words associated with positive emotions (trust, joy and anticipation) dominated the comments received by the angling videos. The results are discussed in light of the trending discourses on developing social media data as a complementary tool for monitoring and managing RA and conserving fish.\n</p>","author":"Prantik Das, \nVilakkathala Vijayan Binoy","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"34c1467dbe38532b7d8689cd08ba83e8b6c2b73a25659b14a91389fbab66cc30","category":"Environment"}