{"title":"Impact of the COVID-19 Pandemic on Inpatient Antibiotic and Antifungal Drug Prescribing Volumes in Germany","link":"https://www.preprints.org/manuscript/202408.0736/v1","date":1723463852000,"content":"Background: Previous studies have found variable impact of the coronavirus disease 2019 (COVID-19) pandem-ic on the consumption of antimicrobial drugs in human medicine, with trends in several European countries differing between community and inpatient prescribing. \nAim: This study analysed changes in the volumes and use density of antibacterial and antifungal drugs dis-pensed in acute care hospitals in Germany between 2019 and 2022.\nMethods: Surveillance data for the four years available from 279 hospitals, among them 272 for antifungals, were expressed as the total volumes of daily doses or as use density (daily doses per 100 patient/occupied bed days) per year and analysed descriptively, using recommended hospital-adapted daily dose definitions (RDD) and (as sensitivity analysis) WHO/ATC-defined daily dose definitions (DDD). Hospitals were stratified according to size (number of beds) and university affiliation, and location (East, West, South).\nResults: There were significant decreases both in the total number of patient days and antibacterial drug vol-umes in 2020 through 2022 compared with 2019. The relative changes between 2019 and 2020, 2021 and 2022 were -12.8%, -13.5%, and -13.3% for patient days, and -9.7%, -11.0%, and -10.1% for antibacterial RDD, respec-tively. Broad-spectrum betalactams, notably piperacillin-tazobactam and carbapenems, increased in volume unlike most other drug classes. The resulting antibacterial drug use density was slightly but significantly increas-ing with pooled means (and medians) of 43.3 (40.0) RDD/100 in 2019 compared to 44.8 (41.7), 44.5 (40.80), and 44.9 (41.7) RDD/100 in the years 2020 through 2022, respectively. Antifungal drug volumes and use density increased after 2019 and peaked 2021 (differences between 2019 and 2021 for total volumes +6.4%, and for pooled mean use density values +22.9%, respectively). These trends were similar in the different hospital strata and comparable when DDD instead of RDD were used. \nConclusions: Similar to what has been observed in a majority of European countries the total volume of antibac-terial drug use in German acute care hospitals decreased with the pandemic without a rebound phenomenon in 2022. In association with restricted hospital capacities and presumably more immunocompromised general medi-cine patients, however, inpatient prescribing of (primarily broad-spectrum) antibacterials and of antifungal drugs increased.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"34c1ad1003faaa1bbfef331bf7e180cd2c9333d3d9e85a1c2cee0dfa2bd31c55","category":"Interdisciplinary"}