{"title":"Explore before you restore: Incorporating complex systems thinking in ecosystem restoration","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14614?af=R","date":1711342860000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/702bd401-fe83-49b9-8122-ba06b4f58e3a/jpe14614-toc-0001-m.png\" alt=\"Explore before you restore: Incorporating complex systems thinking in ecosystem restoration\" />\n<p>By illustrating how key Complex Systems Science (CSS) concepts linked to non-linear threshold behaviour can impact restoration outcomes through influencing recovery trajectories, our framework Explore Before You Restore demonstrates the need to incorporate Complex Systems thinking in ecosystem restoration. We argue that inclusion of CSS assessment into restoration project cycles, and more broadly, into international restoration guidelines, may significantly improve restoration outcomes.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe global movement for ecosystem restoration has gained momentum in response to the Bonn Challenge (2010) and the UN Decade on Ecosystem Restoration (UNDER, 2021–2030). While several science-based guidelines exist to aid in achieving successful restoration outcomes, significant variation remains in the outcomes of restoration projects. Some of this disparity can be attributed to unexpected responses of ecosystem components to planned interventions.\n\nGiven the complex nature of ecosystems, we propose that concepts from Complex Systems Science (CSS) that are linked to non-linearity, such as regime shifts, ecological resilience and ecological feedbacks, should be employed to help explain this variation in restoration outcomes from an ecological perspective.\n\nOur framework, Explore Before You Restore, illustrates how these concepts impact restoration outcomes by influencing degradation and recovery trajectories. Additionally, we propose incorporating CSS concepts into the typical restoration project cycle through a CSS assessment phase and suggest that the need for such assessment is explicitly included in the guidelines to improve restoration outcomes.\n\nTo facilitate this inclusion and make it workable by practitioners, we describe indicators and methods available for restoration teams to answer key questions that should make up such CSS assessment. In doing so, we identify key outstanding science and policy tasks that are needed to further operationalize CSS assessment in restoration.\n\n<i>Synthesis and applications</i>. By illustrating how key Complex Systems Science (CSS) concepts linked to non-linear threshold behaviour can impact restoration outcomes through influencing recovery trajectories, our framework Explore Before You Restore demonstrates the need to incorporate Complex Systems thinking in ecosystem restoration. We argue that inclusion of CSS assessment into restoration project cycles, and more broadly, into international restoration guidelines, may significantly improve restoration outcomes.\n</p>\n<h2>Abstracto</h2>\n<p>\n\nEl movimiento global para la restauración de ecosistemas ha cobrado impulso en respuesta al Desafío de Bonn (2010) y el Decenio de las Naciones Unidas sobre la Restauración de Ecosistemas (UNDER, 2021–2030). Aunque existen varias pautas con base científica para ayudar a lograr resultados satisfactorios en la restauración ecológica, sigue habiendo una variación significativa en los resultados de los proyectos de restauración. Parte de esta disparidad puede atribuirse a respuestas inesperadas de los componentes del ecosistema a las intervenciones hechas/realizadas.\n\nDada la naturaleza compleja de los ecosistemas, proponemos que se empleen conceptos de la Teoría de los Sistemas Complejos (TSC) que enfatizan la no-linealidad, como por ejemplo, los cambios de régimen, la resiliencia ecológica y las retroalimentaciones ecológicas, para ayudar a explicar la variación en los resultados de la restauración desde una perspectiva ecológica.\n\nNuestro marco teórico, Explora Antes de Restaurar, ilustra cómo estos conceptos influyen en las trayectorias de degradación y recuperación ecológicas. Proponemos incorporar los conceptos de la TSC en el ciclo típico de planificación, ejecución y adaptación de los proyectos para mejorar los resultados de la restauración ecológica.\n\nPara facilitar esta inclusión y hacerla útil y viable para los profesionales y ejecutores de proyectos de restauración, describimos los indicadores y métodos disponibles para que los equipos de restauración respondan a las preguntas clave que deberían formar parte de dicha evaluación de la TSC. Al hacerlo, identificamos las principales tareas científicas y políticas pendientes que son necesarias para operacionalizar aún más la evaluación de la TSC en la restauración.\n\n<i>Síntesis y aplicaciones</i>. Nuestro marco teórico Explora Antes de Restaurar demuestra la necesidad de incorporar el pensamiento de la Teoría de Sistemas Complejos en la restauración de ecosistemas. La inclusión de la evaluación de la TSC en los ciclos de elaboración y ejecución de proyectos de restauración, y de manera más amplia, en las pautas internacionales de restauración, podría mejorar significativamente los resultados de la restauración ecológica.\n</p>\n<h2>Abstrato</h2>\n<p>\n\nO movimento global para a restauração de ecossistemas ganhou força em resposta ao Desafio de Bonn (2010) e à Década da ONU para a Restauração de Ecossistemas (UNDER, 2021–2030). Embora existam várias diretrizes baseadas na ciência para auxiliar na obtenção de resultados bem-sucedidos na restauração, ainda existe uma variação significativa nos resultados de projetos de restauração. Parte dessa disparidade pode ser atribuída a respostas inesperadas de componentes do ecossistema às intervenções planejadas.\n\nDada a natureza complexa dos ecossistemas, propomos que conceitos da Ciência de Sistemas Complexos (CSS) vinculados à não linearidade, como mudanças de regime, resiliência ecológica e <i>feedbacks</i> ecológicos, devam ser utilizados para ajudar a explicar essa variação nos resultados da restauração do ponto de vista ecológico.\n\nNossa proposta e modelo, Explore Antes de Restaurar, ilustra como esses conceitos impactam os resultados da restauração, influenciando as trajetórias de degradação e recuperação. Além disso, propomos a incorporação de conceitos de CSS no ciclo típico de projetos de restauração por meio de uma fase de avaliação de CSS, e sugerimos que a necessidade dessa avaliação seja explicitamente incluída nas diretrizes para melhorar os resultados da restauração.\n\nPara facilitar essa inclusão e torná-la viável para os profissionais da área, descrevemos indicadores e métodos disponíveis para equipes de restauração responderem a perguntas-chave que devem compor essa avaliação de CSS. Ao fazer isso, identificamos tarefas científicas e políticas essenciais que são necessárias para operacionalizar ainda mais a avaliação de CSS na restauração.\n\n<i>Síntese e aplicações</i>. Ao ilustrar como conceitos-chave de CSS vinculados ao comportamento não linear podem impactar os resultados da restauração ao influenciar trajetórias de recuperação, nossa proposta de modelo Explore Antes de Restaurar demonstra a necessidade de incorporar uma mentalidade de Sistemas Complexos na restauração de ecossistemas. Argumentamos que a inclusão da avaliação de CSS nos ciclos de projetos de restauração e, de forma mais ampla, nas diretrizes internacionais de restauração, pode melhorar significativamente os resultados da restauração.\n</p>\n<h2>Abstrakt</h2>\n<p>\n\nDie weltweite Bewegung zur Wiederherstellung von Ökosystemen hat an Dynamik gewonnen als Reaktion auf die Bonner Herausforderung (2010) und das UN-Jahrzehnt für die Wiederherstellung von Ökosystemen (UNDER, 2021–2030). Obwohl mehrere wissenschaftsbasierte Leitlinien existieren, um erfolgreiche Wiederherstellungsergebnisse zu erzielen, bleibt eine erhebliche Variation in den Ergebnissen von Wiederherstellungsprojekten bestehen. Ein Teil dieser Diskrepanz kann auf unerwartete Reaktionen der Ökosystemkomponenten auf geplante Interventionen zurückgeführt werden.\n\nAngesichts der komplexen Natur von Ökosystemen schlagen wir vor, Konzepte aus der Komplexen Systemwissenschaft (CSS), die mit Nichtlinearität verbunden sind, wie Regimewechsel, ökologische Resilienz und ökologische Rückkopplungen, einzusetzen, um diese Variation in den Ergebnissen der Wiederherstellung aus ökologischer Sicht zu erklären.\n\nUnser Rahmen, ‘Erkunden Sie bevor Sie wiederherstellen’, veranschaulicht, wie diese Konzepte die Ergebnisse der Wiederherstellung beeinflussen, indem sie Degradations- und Erholungstrajektorien beeinflussen. Darüber hinaus schlagen wir vor, CSS-Konzepte in den typischen Wiederherstellungsprojektzyklus durch eine CSS-Bewertungsphase zu integrieren, und schlagen vor, dass die Notwendigkeit einer solchen Bewertung explizit in die Leitlinien aufgenommen wird, um die Wiederherstellungsergebnisse zu verbessern.\n\nUm diese Integration zu erleichtern und für Praktiker umsetzbar zu machen, beschreiben wir Indikatoren und Methoden, die für Restaurationsteams verfügbar sind, um Schlüsselfragen zu beantworten, die diese CSS-Bewertung ausmachen sollten. Auf diese Weise ermitteln wir ausstehende hervorragende wissenschaftliche und politische Aufgaben die erforderlich sind um die CSS-Bewertung in der Wiederherstellung weiter zu operationalisieren.\n\n<i>Synthese und Anwendungen</i>. Indem wir veranschaulichen, wie sich CSS-Schlüsselkonzepte die mit nichtlinearem Schwellenverhalten verbunden sind auf die Wiederherstellungsergebnisse auswirken können durch Beeinflussung von Erholungstrajektorien, verdeutlicht unser Rahmen „Erkunden Sie bevor Sie wiederherstellen“ die Notwendigkeit einer Integration des komplexen Systemdenkens in die Ökosystem-Restaurierung. Wir argumentieren, dass die Einbeziehung der CSS-Bewertung in die Zyklen des Restaurierungsprojekts, im weiteren Sinne in internationale Restaurationsrichtlinien, die Wiederherstellungsergebnisse signifikant verbessern kann.\n</p>\n<h2>Abstrait</h2>\n<p>\n\nLe mouvement mondial pour la restauration des écosystèmes a pris de l'ampleur grâce au Défi de Bonn (2010) et à la Décennie des Nations Unies pour la Restauration des Écosystèmes (UNDER, 2021–2030). Bien qu'il existe plusieurs directives basées sur des approches scientifiques pour des projets de restauration réussis, une variation significative persiste dans les résultats des projets de restauration, qui s'explique en partie par des réponses inattendues des composants de l'écosystème aux interventions planifiées.\n\nCompte tenu de la nature complexe des écosystèmes, nous proposons que des concepts de la Science des Systèmes Complexes (CSS) liés à la non-linéarité, tels que les changements de régime, la résilience écologique et les rétroactions écologiques, soient utilisés pour aider à expliquer cette variation dans les résultats de restauration d'un point de vue écologique.\n\nNotre cadre, Explore Before You Restore, illustre comment ces concepts impactent les résultats de restauration en influençant les trajectoires de dégradation et de récupération. De plus, nous proposons d'incorporer les concepts de CSS dans le cycle typique des projets de restauration par le biais d'une phase d'évaluation de CSS, et suggérons d'inclure spécifiquement cette évaluation de CSS dans les directives internationales.\n\nPour faciliter cette inclusion et la rendre praticable pour les professionnels, nous décrivons des indicateurs et des méthodes disponibles pour les équipes de terrain, sur base de réponses à de questions clés qui devraient constituer une telle évaluation de CSS. Ce faisant, nous identifions des tâches scientifiques et politiques clés qui sont nécessaires pour opérationnaliser davantage l'évaluation de CSS en restauration.\n\n<i>Synthèse et applications</i>. En illustrant comment des concepts clés de CSS liés au comportement non linéaire peuvent influencer les résultats de restauration en influençant les trajectoires de récupération, notre cadre Explore Before You Restore montre la nécessité d'incorporer la pensée des Systèmes Complexes dans la restauration des écosystèmes. Nous soutenons que l'inclusion de l'évaluation de CSS dans les cycles de projets de restauration, et plus largement, dans les directives internationales de restauration, pourrait améliorer significativement les résultats de restauration à venir?\n</p>\n<h2>خلاصة</h2>\n<p>\n\n2010 (2010 اكتسبت الحركة العالمية لإعادة تأهيل وإصلاح النظم البيئية اهتماماً متزايداً وذلك رداً على تحدي بونBonn Challenge) والعقد الأممي لعادة تأهيل النظم البيئية (UNDER, 2021–2030). على الرغم من وجود العديد من الإرشادات القائمة على الأدلة العلمية للمساعدة في تحقيق نتائج استصلاح ناجحة، لا تزال هناك تباينات كبيرة في نتائج مشاريع الإصلاح. يمكن إرجاع بعض هذه الفروق إلى استجابات غير متوقعة لمكونات النظام البيئي للتدخلات المخطط لها.\n\nنظراً للطبيعة المعقدة للنظم البيئية، نقترح أن يتم استخدام مفاهيم من علم الأنظمة المعقدة (CSS) المرتبطة بعدم الخطية، مثل التحولات النظامية، والمرونة البيئية، والتغذية الراجعة البيئية، للمساعدة في تفسير هذا التباين في نتائج الاصلاح من منظور بيئي.\n\nيوضح إطار عملنا، استكشف قبل أن تستصلح (Explore Before You Restore)، كيف تؤثر هذه المفاهيم على نتائج الاصلاح من خلال التأثير على مسارات التدهور والتعافي. بالإضافة إلى ذلك، نقترح دمج مفاهيم CSS في دورة مشروع الإصلاح النموذجية من خلال مرحلة تقييم CSS، ونقترح أن يتم إدراج الحاجة إلى مثل هذا التقييم بوضوح في الإرشادات لتحسين نتائج التأهيل والإصلاح.\n\nلتسهيل هذا الإدراج وجعله قابلاً للتطبيق من قبل ممارسي إعادة تأهيل النظم البيئية، نصف هنا المؤشرات والأساليب المتاحة لفرق إعادة التأهيل التي يمكنها الإجابة على الأسئلة الرئيسية التي تشكل جزءاً من تقييم CSS. من خلال القيام بذلك، نحدد المهام العلمية والسياسية الرئيسية التي تحتاج إلى مزيد من التنفيذ لتقييم CSS في الإصلاح.\n\nالتطبيقات: من خلال توضيح كيف يمكن لمفاهيم CSS الرئيسية المرتبطة بسلوك العتبة الغير خطية أن تؤثر على نتائج التأهيل والإصلاح البيئي من خلال التأثير على مسارات التعافي، يظهر إطار عملنا، Explore Before You Restore، الحاجة إلى دمج التفكير بمبدأ الأنطمة المعقدة Complex Systems في اصلاح النظم البيئية. نحن نؤمن أن إدراج تقييم CSS ضمن دورات مشاريع التأهيل والإصلاح قد يحسن بشكل كبير نتائج الإصلاح.\n</p>","author":"S. L. Maes, \nM. P. Perring, \nR. Cohen, \nF. K. Akinnifesi, \nA. Bargués‐Tobella, \nJ.‐F. Bastin, \nM. Bauters, \nP. N. Bernardino, \nP. H. S. Brancalion, \nJ. M. Bullock, \nD. Ellison, \nA. Fayolle, \nT. Fremout, \nG. D. Gann, \nH. Hishe, \nM. Holmgren, \nU. Ilstedt, \nG. Mahy, \nC. Messier, \nC. L. Parr, \nC. M. Ryan, \nM. Sacande, \nM. Sankaran, \nM. S. Scheffer, \nK. N. Suding, \nK. Van Meerbeek, \nH. Verbeeck, \nB. J. P. Verbist, \nK. Verheyen, \nL. A. Winowiecki, \nB. Muys","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"34c52526f4f13e97d20b82d95787eda7930cb55a4ccb729df3a57972d2667b18","category":"Environment"}