{"title":"In the Drops: Santini Vega Multi jacket, Assos gilet, Pactimo thermal jersey, sugarcane bottle and foam rolling","link":"https://www.cyclist.co.uk/in-depth/10307/assos-dyora-rs-spring-fall-gilet","date":1639046065000,"content":"<span>\n      <span><a href=\"/authors/emma-cole\">Emma Cole</a></span>\n  </span><div>  \n  <div>      <div><span>10 Dec 2021</span></div>    </div></div><p>\nAll the winter warmers in our weekly gear roundup</p>\n<div>\n      <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/article_main_image/public/2021/12/assos_spring_fall_gilet_1.jpg?itok=JW60WWhg\" />  </div>\n<div>\n      <p> Another week closer to the holidays and I for one am gearing up for some Michael Bublé and mulled wine.</p>\n<p>Ok, I've already had some mulled wine but when is it appropriate to blast Michael Bublé and celebrate him coming out of hibernation? My neighbours will soon find out.</p>\n<p>It's been a festive week here at <em>Cyclist</em> as we had our Christmas lunch yesterday. Fear not, this edition of <em><a href=\"https://www.cyclist.co.uk/tags/in-the-drops\" target=\"_blank\">In the Drops</a></em> doesn't feature the highlights reel from that.</p>\n<p>Moving on from the festivities, this week we covered the launch of the <a href=\"https://www.cyclist.co.uk/news/10306/canyon-grail-2022-ultimate-disc-young-hero\">2022 Canyon Grail and the brand's junior racing bike </a>and Joe Robinson reviewed the lightest gravel bike in the world, the <a href=\"https://www.cyclist.co.uk/reviews/10193/specialized-s-works-crux-review\">Specialized S-Works Crux</a>.</p>\n<p>We put together the ultimate guide on <a href=\"https://www.cyclist.co.uk/buying-guides/9118/indoor-cycling-kit-what-to-wear-on-the-turbo\">what to wear on the turbo</a> and got all the answers on <a href=\"https://www.cyclist.co.uk/tutorials/9120/how-to-get-on-zwift-without-a-smart-turbo-trainer\">using Zwift without a smart turbo trainer</a>.</p>\n<p>We also have debuted our guide to <a href=\"https://www.cyclist.co.uk/in-depth/10287/what-is-a-freehub\">road and gravel freehubs</a> and answered that burning question: <a href=\"https://www.cyclist.co.uk/in-depth/10270/what-is-a-gravel-bike\">what <em>is</em> a gravel bike</a>?<a href=\"https://www.cyclist.co.uk/in-depth/10270/what-is-a-gravel-bike\"></a></p>\n<p>For the history lovers amongst us, we have a beautiful feature about <a href=\"https://www.cyclist.co.uk/in-depth/10079/tour-de-france-history-the-last-tour-before-the-great-war\">the last Tour before the First World War</a>.</p>\n<p>Now it's time to buckle up for this week's go-to winter warmers (mulled wine optional).</p>\n<h2>Santini Vega Multi Jacket</h2>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/santini_multi_vega_front.png?itok=WnrddnGQ\" />  </div>\n</div>\n<p>On my radar this week is the Santini Vega Multi Jacket, a winter outfit staple.</p>\n<p>I recently wore the Vega Multi on a cold, wet and windy trip around the New Forest and found it performed time and time again.</p>\n<p>Made from Polartec fabric, the Vega Multi is claimed to be waterproof up to 5m and has a microporous membrane which makes it breathable.</p>\n<p>It rained on my trip but this jacket kept me nice and dry. I took great pleasure in just watching the droplets wobble off my sleeves as I ripped up some gnarly trails (interpret as you will…).</p>\n<p>The material is soft and lightweight and feels great against skin.</p>\n<p>The jacket also has silicone grippers which keep it neatly in place when riding.</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/vega-multi-women-s-rain-jacket_3.jpeg?itok=VNxnaST0\" />  </div>\n</div>\n<p>The three rear pockets are decent sized and there is a little zip pocket for valuables.</p>\n<p>I like to bring jam sandwiches on my long rides, and I can confirm the rear pockets are perfectly sized for them.</p>\n<p>There is also a whopping great reflective strip down the back of the jacket for visibility and, to my relief, the jacket washes well.</p>\n<p>Interestingly, the men's version is £10 more expensive…</p>\n<ul>\n<li><strong>Read the <a href=\"https://www.cyclist.co.uk/reviews/10265/santini-vega-multi-jacket-review\">full review of the Santini Vega Multi jacket</a></strong></li>\n<li><strong>Buy the men’s Santini Vega Multi jacket <a href=\"https://www.santinisms.co.uk/jackets-c36/santini-vega-multi-mens-jacket-p546#attribute%5B4%5D=19\">from Santini for £239</a></strong></li>\n<li><strong>Buy the women’s Santini Vega Multi jacket <a href=\"https://www.santinisms.co.uk/jackets-c40/santini-vega-multi-womens-jacket-p555#attribute%5B4%5D=19\">from Santini for £229</a></strong></li>\n</ul>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/10221/what-is-dotwatching\">Dotwatching: What is it and why do people do it? </a></div>      <div><a href=\"/in-depth/10218/ulrich-bartholmoes-cyclist\">From IT to ultra cycling, the extraordinary rise of Ulrich Bartholmoes</a></div>      <div><a href=\"/in-depth/4130/race-across-europe-riding-the-transcontinental\">Race across Europe: Riding the Transcontinental</a></div>    </div></div><h2>Assos Dyora RS Spring Fall gilet</h2>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/12/assos_spring_fall_gilet_1.jpg?itok=0evKavmH\" />  </div>\n</div>\n<p>Assos is known for its premium gear and this softshell gilet does not disappoint.</p>\n<p>It is an absolute rocket in terms of performance and comfort.</p>\n<p>Windproof and water repellent, the Assos Dyora RS Spring Fall gilet keeps your core toasty and the double zip lets you keep all the goodness in, or let it out as necessary.</p>\n<p>The fit is aero which isn't too restricting on a gentle jaunt, but definitely makes me go faster when I'm pushing hard on the pedals.</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/12/assos_spring_fall_gilet_3.jpg?itok=RXB_dNW7\" />  </div>\n</div>\n<p>I should add, this is a no-frills gilet – aka raw cut hems and no pockets.</p>\n<p>But that is, in many ways, what makes this a great piece of kit.</p>\n<p>It gets the job done with zero fuss.</p>\n<ul>\n<li><strong>Buy the Assos Dyora RS Spring Fall gilet <a href=\"https://www.wiggle.co.uk/assos-dyora-rs-springfall-aero-cycling-gilet\">from Assos for £200</a></strong></li>\n<li><strong>Buy the Assos Equipe RS Spring Fall filet <a href=\"https://www.assos.com/gb/equipe-rs-spring-fall-aero-gilet-92191.html\">from Assos for £200 (men’s version)</a></strong></li>\n<li><strong>Read our reviews of the <a href=\"https://www.cyclist.co.uk/reviews/10227/assos-dyora-rs-spring-fall-bib-shorts-s9-review\">Assos Dyora RS Spring Fall bib shorts S9 </a>and <a href=\"https://www.cyclist.co.uk/reviews/10162/assos-dyora-rs-spring-fall-jacket-review\">Assos Dyora RS Spring Fall jacket</a></strong></li>\n</ul>\n<h2>Pactimo Alpine Thermal LS jersey</h2>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/12/pactimo_thermal_jersey.jpg?itok=15LVYZeT\" />  </div>\n</div>\n<p>Designed for cold weather, the Pactimo alpine thermal LS jersey is a real winter warmer.</p>\n<p>Made from stretchy fabric with a soft fleecing lining, the jersey is comfortable and cosy.</p>\n<p>The brand says the jersey performs well between 4-18 degrees centigrade but I would also say it could be used in colder conditions with the right layering approach.</p>\n<p>I wore it in the snow with the aforementioned gilet and jacket over the top and it worked wonders.</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/12/pactimo_thermal_jersey_1.jpg?itok=PMsZuVMq\" />  </div>\n</div>\n<p>Like most, the jersey has three rear pockets and a handy zip pocket too.</p>\n<p>Pactimo calls the middle pocket a 'dump pocket', as it's much larger than the others and ideal for when you need to quickly take off a layer (or for extra-large jam sandwiches).</p>\n<p>The jersey's collar is tall which keeps the elements out, and there's reflective detailing on the forearms, rear pockets and on either side of the full length YKK locking zip, which is a neat touch.</p>\n<p>The jersey also comes in a range of colours to suit everyone's tastes and both versions are the same price.</p>\n<ul>\n<li><strong>Buy the men’s Pactimo Alpine Thermal LS jersey <a href=\"https://www.pactimo.co.uk/collections/mens-road-cycling-mtb-jerseys/products/2020-alpine-thermal-cycling-jersey-mens\">from Pactimo for £114</a></strong></li>\n<li><strong>Buy the women’s Pactimo Alpine Thermal LS jersey <a href=\"https://www.pactimo.co.uk/collections/womens-jersey-the-essentials/products/alpine-thermal-cycling-jersey-womens\">from Pactimo for £114</a></strong></li>\n</ul>\n<h2>Universal Colours Biodegradable bottle</h2>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/12/universal_colours_sugarcane_waterbottle.jpeg?itok=aUZFXCXC\" />  </div>\n</div>\n<p>Brands which are leading the charge in a more sustainable cycling industry usually catch my eye, especially those championing circularity.</p>\n<p>This Universal Colours bottle is innovative in its circular approach.</p>\n<p>Made from 100% taste-free biodegradable polyethylene and constructed using sugarcane, this Universal Colours bottle can be wholly recycled.</p>\n<p>At the correct temperature in a landfill or under leaves and soil in a forest, the bio-batch additive activates, and the bottle decomposes into water, humus (dark, organic material which will become part of the soil – not a delicious chickpea dip) and gas.</p>\n<p>The brand says the composting process takes 1-5 years, compared to 450 years for a traditional plastic bottle, and the bottle becomes part of the natural world again, with no nasty chemicals leaking out.</p>\n<p>If it works, this is a brilliantly biodegradable bottle.</p>\n<ul>\n<li><strong>Buy the Universal Colours Biodegradable Bottle <a href=\"https://www.sigmasports.com/item/Universal-Colours/Biodegradable-Bottle-500ml/UHHU\">from Sigma Sports for £10</a></strong></li>\n</ul>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/10221/what-is-dotwatching\">Dotwatching: What is it and why do people do it? </a></div>      <div><a href=\"/in-depth/10218/ulrich-bartholmoes-cyclist\">From IT to ultra cycling, the extraordinary rise of Ulrich Bartholmoes</a></div>      <div><a href=\"/in-depth/4130/race-across-europe-riding-the-transcontinental\">Race across Europe: Riding the Transcontinental</a></div>    </div></div><h2>What we're into this week: Foam rollers and massage guns<a href=\"https://www.sigmasports.com/item/Universal-Colours/Biodegradable-Bottle-500ml/UHHU\"></a></h2>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/12/img_7447.jpg?itok=zPYzIRDy\" />  </div>\n</div>\n<p>With the dark nights lingering, I am ramping up my post workout recovery which means spending quality time close to the floor with a foam roller or a massage gun, and a lot of grimacing.</p>\n<p>I find the best time for this grimacing ceremony is in front of the telly.</p>\n<p>Currently the whole 'let's watch this Christmas film for the umpteenth time' phase is the perfect excuse to get up close and personal with the carpet.</p>\n<p>I find foam rolling relieves muscle tightness and soreness, and I like to think it makes me more flexible.</p>\n<p>My masterful orange roller might not look like much but let me assure you it is an excellent piece of kit.</p>\n<p>It has a relatively squidgy outer layer (compared to the rock-hard ones I have also tried) which allows for a reasonable amount of give when rolling.</p>\n<p>I picked it up from <a href=\"https://www.tkmaxx.com/uk/en/women/activewear/sports+fitness-accessories/pink-foam-roller/p/02129796\" target=\"_blank\">TK Maxx</a> years ago and it cost a mere £15, but nowadays you can get a whole variety of foam rollers in every price range.</p>\n<p>For advice on making yourself grimace check out our <a href=\"https://www.cyclist.co.uk/tutorials/7174/how-using-a-foam-roller-can-make-you-quicker-on-the-bike\">guide to using a foam roller</a>.</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/12/img_7449.jpg?itok=gpPa0M19\" />  </div>\n</div>\n<p>Onto the massage gun, a slightly more technical piece of kit and certainly more of an investment.</p>\n<p>Massage guns are quite controversial in that they can do more harm than good but when correctly used, a massage gun is a true delight, and a lot cheaper than a regular professional massage.</p>\n<p>This beauty pictured is from <a href=\"https://www.amazon.co.uk/gp/product/B08GM6L8F3/\">Amazon</a>. I bought it last year, and it's worked seamlessly since.</p>\n<p>The number of different interchageable heads it came with was quite something and these can be used at different intensities to hit the spot just so.</p>\n<p>There are now a huge range of massage guns on offer, read our <a href=\"https://www.cyclist.co.uk/reviews/6971/myomaster-myopro-massage-gun-review\">MyoMaster MyoPro massage gun review</a> for a more detailed run down.</p>\n<p>Wiggle have a good range and are currently offering discounts on some foam rollers and massage guns so <a href=\"https://www.wiggle.co.uk/foam-rollers\">head here if you're in the market for one</a>.</p>\n<p>Happy grimacing! </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"ecole","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"34ca40d7212952d45d16ee951697d22ff09ae40f9be1229484b05023ca6b108d","category":"Cycling"}