{"title":"PSIV-9 Pedigree tracing to determine the origin of the golden coat phenotype within the Golden American Saddlebred horse","link":"https://academic.oup.com/jas/article/102/Supplement_3/549/7757612?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>With the incorporation of the Golden American Saddlebred Horse Association (GASHA) into the American Saddlebred Horse Association (ASHA), breeding specifically for coat color within the breed registry became less of an emphasis for horse breeders. Nevertheless, historical documentation of the horses making up the foundation of the GASHA through the application of pedigree tracing holds value in understanding the origin of the breed and its coat color. This can be of value to horse breeders targeting a specific coat color as the study of coat colors is a relatively new field of research within equine science. Thus, the objective of this study was to document the historical origins of the GASHA through pedigree tracing to determine the influence of the dilution genes that produce the golden coat phenotype. A random sample of 550 horses was obtained from the Official Directory of GASHA. Using the All-Breed Data Base, sampled horses were entered and examined for pedigrees suitable for analysis of color inheritance, and of these, 507 were found to have extended pedigrees with documented coat colors that were used for this study. Results determined that 43% of traced pedigrees carried the champagne gene, 36.1% carried the cream gene, and 20% had pedigrees that were non-informative as these pedigrees went to unknown ancestors or were found to be incorrect as to ancestry. Another 0.9% were determined to be obligate carriers for the cream gene; as the pedigrees presented conflict concerning color designation so that accurate conclusion of coat color phenotype associated with the cream dilution gene could not be verified. Of the 507, all traced back to 6 foundation mares and most of the breed traced back to 2 of these mares; with one mare, Maud, being a champagne mutation and the other, Allens Queen, a cream mutation (Table 1). In conclusion, through pedigree tracing the GASHA origins were documented giving an understanding as to the genetic contributions for today’s GASHA golden coat color. Further, these results will give breeders more input on how they might select for certain coat color phenotypes.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"34de2657aebc371b39e69f0f09220c7c03c208f1e2ecbaca5374db07b1746291","category":"Environment"}