{"title":"Salsa Cycles’ chaise lounge is back in gravel’s living room","link":"https://www.cyclingtips.com/2023/03/salsa-cycles-chaise-lounge-is-back-in-gravels-living-room/","date":1680027172000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/03/IMG-0982.jpg?width=1200\" alt=\"Salsa Cycles' chaise lounge is back in gravel's living room\" /></figure><p>It’s a common retirement story — close up the business, take some time to travel, get bored, and then … go back to work. It’s no different when you’re a chaise lounge, actually, especially one with as illustrious a short career as <a href=\"https://www.velonews.com/tag/salsa-cycles/\">Salsa Cycles’</a> chaise, a staple of the brand’s on-course activations at gravel races in 2018-19.</p>\n<p>For two years, Salsa’s Chase the Chaise was a highlight of races like<a href=\"https://www.velonews.com/tag/the-mid-south/\"> the Mid South</a> and <a href=\"https://cdn.velonews.com/tag/unbound-gravel/\">Unbound Gravel</a>. The piece of fancy furniture in the middle of nowhere brought levity when times were tough, drawing riders from the dark depths of their minds after 90 or 190 miles into the frame of a picture that they’d then have for their social media scrapbook.</p>\n<p>Sadly then, news of the chaise’s retirement after 2019 got lost in the tornado of the coronavirus pandemic. When gravel racing resumed in late 2021 and 2022 people were so excited to be back that the chaise seemed to be both gone and forgotten.</p>\n<p>However, at the Mid South earlier this month, the chaise, reupholstered in cheeky cheetah print, reappeared. Where had it been? Why had it disappeared? Was it back for good? For most people, the answers didn’t matter, only the iconic photo did.</p>\n<blockquote>\n<div> <a href=\"https://www.instagram.com/p/CqJEdk3prP0/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <p></p>\n<div>\n<div></div>\n<div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div></div>\n<div></div>\n<div>\n<div>View this post on Instagram</div>\n</div>\n<div></div>\n<div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<p></p></a><p></p>\n<p><a href=\"https://www.instagram.com/p/CqJEdk3prP0/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Salsa Cycles (@salsacycles)</a></p>\n</div>\n</blockquote>\n<p></p>\n<h2>The chaise’s heyday</h2>\n<p>I wanted to know, however, so I called up Mike Reimer, Salsa’s associate marketing manager.<span> Reimer has been with QBP, Salsa Cycle’s parent company for nearly 27 years and roughly 17 of those have been spent working with the bike brand. The story of the chaise segues from Salsa’s deep roots in gravel.</span></p>\n<p>Salsa’s imprint in gravel is inarguable; in 2008, the brand debuted <a href=\"https://www.velonews.com/gear/gravel-gear/salsa-warbird-why-r-and-other-gear-tested-at-the-mid-south/\">the Warbird</a>, considered by some to be the first purpose-built gravel bike. Reimer says that, from that point forward, his small team has always had gravel on the brain. He and his colleagues were riding and racing events like the Almanzo 100 and Trans Iowa way back in the day.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2020/07/Warbird-Mud-South.jpg?width=730\" alt width=\"2200\" height=\"1238\" /><figcaption><span>The Salsa Warbird at the muddy 2020 Mid South</span> (Photo: Brad Kaminski)</figcaption></figure>\n<p>In 2017, Reimer gathered his team for a brainstorming session.</p>\n<p><span>“I was marketing manager at the time,” he says, “and I scheduled a brainstorm for our small marketing team, maybe 4-5 of us. It was like, ‘bring your ideas about gravel, mountain bike, fat, and let’s just see what we find.’ I brought the idea of shooting portraits of participants at gravel events. That’s literally as deep as that idea was and as deep as it got.”</span></p>\n<p>A year later at a similar type of meeting, Reimer brought up the idea again, but this time it had more legs — literally. He suggested using a piece of furniture as a prop for the photos. Kelly McWilliams, Salsa’s creative director at the time, jumped on board and soon everyone in the room was running with it.</p>\n<p><span>“Kelly said ‘it can’t just be any piece of furniture. It can’t be a beat up LazyBoy or couch, something that you’d really see on the side of the road,'” Reimer says. “It had to be something no one would expect, like a chaise lounge. </span></p>\n<p><span>“The meeting was gangbusters, a perfect convergence of ideas. Our copywriter Mark Sirek started spouting off a bunch of copy, calling it the ‘gravel living room.'”</span></p>\n<p>The chaise debuted at the Mid South — then called the Land Run 100 — in Stillwater, Oklahoma in March 2018, and was an instant success. That year, Salsa brought the furniture, which included a bedazzled floor lamp, to five gravel events, and in 2019, they tacked on a few more.</p>\n<p>From a marketing standpoint, the activation — which included the free portraits that Reimer had originally argued for, as well as a Chase the Chaise patch — was successful. Reimer says that “tens of thousands of people” have downloaded their chaise photos from the Salsa website over the years. There have already been nearly 1,000 downloads from this year’s Mid South.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2023/03/Salsa_ChaiseAtHome_Retirement_SantaMonicaPier-e1680019545833-720x405.jpg?width=720\" alt width=\"720\" height=\"405\" /><figcaption><span>The chaise on retirement tour at the Santa Monica pier</span> (Photo: Mike Reimer/Salsa Cycles)</figcaption></figure>\n<p>However, carting a chaise lounge and a handful of staff around the country all summer, plus paying for events to allow said furniture and people out on course, turned out to be incredibly resource-intensive for the small brand. In fact, it was during the 2019 season that Salsa’s marketing team decided to retire the chaise for 2020.</p>\n<p>Meanwhile, Reimer started taking retirement photos of the chaise at tourist spots across the country. There was a retirement party back at work in Minnesota. When the pandemic hit, the marketing team came up with the idea of the ‘Chaise at Home;’ people could download the retirement photos of the chaise and use them as their Zoom or Hangouts backgrounds.</p>\n<p>Before the Mid South this year, the chaise’s last public appearance was at Sea Otter last April, where it quietly hung out at the Salsa booth, clad in retiree-casual Hawaiian shirt upholstery.</p>\n<h2>‘The essence of gravel’</h2>\n<p>So why bring the chaise back into the workplace?</p>\n<p>Reimer says it wasn’t part of some forward-thinking strategic plan. In fact, he thinks that Sally Turner and Bobby Wintle of the Mid South might have suggested it in their pre-race meeting with Salsa (the brand is the title bike sponsor of the Mid South).</p>\n<p><span>“I still love the thing, people like it, it speaks to the essence of gravel,” Reimer says. “Community and everybody being welcome. In my opinion, that’s at the heart of gravel racing.”</span></p>\n<p>Nevertheless, if the chaise could speak, it might comment on how the heart of gravel racing is evolving.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2023/03/landrun100_001-scaled-e1680022402472-720x480.jpg?width=720\" alt width=\"720\" height=\"480\" /><figcaption>(Photo: Mike Reimer/Salsa Cycles)</figcaption></figure>\n<p>When Chase the Chaise debuted at the 2018 Mid South, Reimer was dumbstruck when the race leaders — Mat Stephens and Michael van den Ham — stopped to have their photo taken.</p>\n<p><span>“We could hear these two guys — ‘are we gonna do it? Yeah, let’s make it quick.’ They come zipping in and out within five seconds. The first year, every race leader stopped at all of the five races.”</span></p>\n<p><span>At the 2019 Mid South, the race leaders again paused to ham it up in front of the camera. When I asked Ted King, who was riding at the front with eventual winner Payson McElveen and third-place finisher Andrew Dillman, for his chaise photo, he said there was no question that the three were going to stop for a photo. </span></p>\n<p><span> “We had the race wrapped up and I told Payson and Drew that it was mandatory to stop,” King said.</span></p>\n<p>At this year’s Mid South, no one in the front group of eight riders stopped for a photo. In fact, Reimer says, the second group also “blasted through.”</p>\n<p><span>“Even of the 50-mile race, only a handful of the front 50 riders stopped,” he says. “It’s definitely indicative of at least, on the front end, a more serious vibe. The game has changed. The racing has become too important at the front. People are making their careers off of this.”</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2020/07/kiwi-e1680025356748.jpg?width=730\" alt=\"dirty kanza\" width=\"2400\" height=\"1600\" /><figcaption><span>Bennie Black chased the chaise all the way from New Zealand to Kansas in 2019. </span></figcaption></figure>\n<p>For those who aren’t, however, the chaise is a welcome reminder of gravel’s carefree spirit, and people are thrilled to hop off their bikes and take a seat. That’s why Reimer hopes that “<span>even if it’s two or three events in a year,” he has the marketing budget — and the support behind it — to keep the chaise out of retirement in the future. </span></p>\n<p>For now, the only other confirmed stop for the chaise this year is at Barry Roubaix in Michigan in a few weeks. And even if the pointy end passes by, Reimer knows that he and his photographer will bear witness to hundreds of people overjoyed to see the piece of fancy furniture in the middle of nowhere that they thought had gone away forever.</p>\n<p><span>“They were so surprised and thankful [at Mid South.]” he says. “‘I can’t believe this! I never got to do this and I didn’t think I’d get to.’ </span><span>It’s been really humbling.”</span></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>","author":"Betsy Welch","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"34e48042d9a65997936d16ee50fe49aa0728b4a580ab8e2abb52c69efd9b8986","category":"Cycling"}