{"title":"Investigation of physical properties of microalgae‐pectin‐based bio‐composite with addition of pine needle for environmental application","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14463?af=R","date":1722242306000,"content":"<h2>Abstract</h2>\n<p>Polymers and biopolymers have gained significance due to their applicability and use in industry reducing the negative impact of polymers based on petroleum. A possible solution for the conventional polymer's biodegradability is bio-composites, which contain natural fibers or aggregates such as microalgae. Hence, microalgae biomass has a promising application to address the biodegradability issue of conventional polymers. In this study, <i>Chlorella vulgaris</i> biomass was mixed with pectin for control samples with glycerol as plasticizer. The mixture microalgae-pectin-glycerol, and the addition of pine needles was used to evaluate the tensile strength and compression of the bio-composite. This bio-composite showed a higher Young's modulus of 95.66 MPa for blend C2 and a higher strength with 20% of pectin concentration in the mixture. Additionally, the pine needle addition did not have a low effect between the compression results. On the other hand, analysis on elasticity showed that the full recovery of the bio-composite happened after 10 min in all the blends. Also, the bio-composite showed a slow release of nitrogen and phosphorous after 5 days of water addition, indicating an effective slow release for blend B for both nutrients. Water uptake capacity and loss of soluble material was studied using pullulan, chitosan, and cetyltrimethylammonium bromide additives. These cationic surfactants demonstrated their potential for reduction of water solubility of the bio-composite.</p>","author":"Carlos Munoz‐Cupa, \nKristine Lee, \nAnuradha Krishnan, \nAmarjeet Bassi","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"34e686abb8741159471b174f6113f89c2a3be87c22c4d63c7bab9af1cf82ad05","category":"Environment"}