{"title":"The effect of external flow on 3D orientation of a microscopic sessile suspension feeder, Vorticella convallaria","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15170?af=R","date":1718953200000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/e4a1f923-f09a-43d1-9984-a9c4b418e02e/nyas15170-gra-0001-m.png\" alt=\"The effect of external flow on 3D orientation of a microscopic sessile suspension feeder, Vorticella convallaria\" />\n<p><i>Vorticella</i> are microscopic sessile suspension feeders that live attached to substrates in aquatic environments. They feed using a self-generated feeding current. Their feeding rate depends on an individual's orientation relative to the substrate and ambient flow. We exposed individuals to varying flow speeds and recorded their 3D orientation. We found that <i>Vorticella</i> orientations were progressively tilted downstream as flow speeds increased, but individuals were still able to actively reorient. Calculated theoretical feeding rates decreased as flow speed increased.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p><i>Vorticella convallaria</i> are microscopic sessile suspension feeders that live attached to substrates in aquatic environments. They feed using a self-generated current and help maintain the health of aquatic ecosystems and wastewater treatment facilities by consuming bacteria and detritus. Their environmental impact is mediated by their feeding rate. In ambient flow, feeding rates are highly dependent on an individual's orientation relative to the substrate and the flow. Here, we investigate how this orientation is impacted by flow speed. Furthermore, we examined whether individuals actively avoid orientations unfavorable for feeding. We exposed individuals to unidirectional laminar flow at shear rates of 0, 0.5, 1.0, and 1.5 s<sup>−1</sup>, and recorded their 3D orientation using a custom biplanar microscope. We determined that <i>V. convallaria</i> orientation became progressively tilted downstream as the shear rate increased, but individuals were still able to actively reorient. Additionally, at higher shear rates, individuals spent a larger fraction of their time in orientations with reduced feeding rates. Our shear rates correspond to freestream flows on the scale of mm s<sup>−1</sup> to cm s<sup>−1</sup> in natural environments.</p>","author":"Tia Böttger, \nBrett Klaassen van Oorschot, \nRachel E. Pepper","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"34e7897352a31f7b374aac08cbcaf72da9634192884e1086d5e97e414e576c95","category":"Environment"}