{"title":"Feasibility, acceptability, and effects of a web-delivered behavioral parent training intervention for rural parents of children with autism spectrum disorder: A protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307273","date":1724767200000,"content":"<p>by Samantha Ault, Kayla Herbell, Nathan Helsabeck, Kevin Stephenson, Susan M. Breitenstein, Laureen M. Smith</p>\r\n\r\nCaregivers of children with autism spectrum disorder (ASD) often report higher levels of stress and mental health issues. Support services and parent training programs may help buffer the effects of caring for a child with ASD. However, due to the national lack of trained ASD providers and disparity of ASD support resources available in rural areas, caregivers often go without support. A possible solution to reach caregivers in rural areas is web-based interventions. This paper describes an ongoing pilot study examining the feasibility, acceptability, and preliminary effects on caregiver well-being and disruptive child behaviors for a web-based parent training program (Attend Behavior) for caregivers of young children (ages 2–11 years old) with autism spectrum disorder (ASD) living in rural areas (trial registration NCT05554198). The intervention is available on the internet as well as a downloadable app for mobile phones. Participants will be invited to use the intervention program for 12-weeks. Prior to using the program, participants will be asked to take a baseline survey assessing depressive symptoms (PROMIS Depression Short Form-6a), caregiver stress (Parenting Stress Index-Short Form), child disruptive behaviors (Home Situations Questionnaire-ASD and Aberrant Behavior Checklist). After 12-weeks, participants will be asked to complete a post-intervention survey with the same measurement scales plus questions regarding intervention acceptability, appropriateness, and feasibility (Acceptability of Intervention, Intervention Appropriateness Measure, and the Feasibility of Intervention Measure). Participants are also invited to partake in a brief 1:1 interview with a study team member to give further feedback regarding the intervention. Study retention and participant app usage data will be examined. Information generated from this pilot study will be used to inform a future larger scale randomized control trial of Attend Behavior.","author":"Samantha Ault","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"34f9683a87d14e191c8c4d073e7816b237db59cd7951b50925f4677472c7b42d","category":"Interdisciplinary"}