{"title":"Feral pig (Sus scrofa) disturbance facilitates establishment of resource‐acquisitive species in Hawaiian forest understories","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14490?af=R","date":1709702006000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d9bd3112-5ddb-4591-9f05-3bcaa55ccf23/fec14490-toc-0001-m.png\" alt=\"Feral pig (Sus scrofa) disturbance facilitates establishment of resource-acquisitive species in Hawaiian forest understories\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2023/12/07/feral-pig-disturbance-aids-the-spread-of-non-native-species-with-rapid-resource-use-strategies/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nInvasive mammals exert pervasive effects on vegetation communities in island systems through several pathways, including by introducing novel disturbances. In Hawai‘i, feral pigs pose a particular threat to endemic species that evolved in the absence of native ungulates. The effects of pig soil disturbance on understory vegetation are contingent on the distribution and density of disturbed patches and subsequent species responses influenced by traits conferring growth and reproductive strategies. However, little is known about how these traits influence native- non-native species turnover in response to pig disturbance, or how such disturbances affect trait-mediated responses to other environmental variables.\n\nHere we quantify the effects of leaf traits and dispersal attributes on species responses to pig soil disturbance at two spatial scales—0.5 m<sup>2</sup>\n<i>patches</i> embedded along 20 m transects within <i>sites</i>—across a gradient of pig density in a Hawaiian montane wet forest using Bayesian mixed models.\n\nNative and non-native species demonstrated divergent responses, with increasing presence and abundance of non-native species in the understory as soil disturbance within patches and sites increased. Dominant patterns in measured traits tracked the leaf economic spectrum (LES), with non-native species tending toward resource-acquisitive traits. Species with resource-acquisitive traits, regardless of identity, were favoured with disturbance and responded positively to light availability in disturbed sites. Models showed species primarily dispersed by wind were more prevalent in disturbed patches and sites than those dispersed by endozoochory, while seed mass had no effect.\n\nOur results suggest pig activity influences community composition and favours non-native species establishment, and these effects are mediated in part by traits conferring rapid resource acquisition. We also show that the extent of disturbance at the site-scale is relevant for the influence of leaf architecture on understory responses to light availability, demonstrating how the effects of disturbance are scale-dependent and can influence species sorting along independent environmental gradients.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2023/12/07/feral-pig-disturbance-aids-the-spread-of-non-native-species-with-rapid-resource-use-strategies/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Michael Peyton, \nMauriel Rodriguez Curras, \nSara Hotchkiss","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"3502f01ac3989445a0c68a232febca75d8854eb943a07a397565c8c93ee00d0f","category":"Environment"}