{"title":"Rapha founder Simon Mottram to step down as CEO","link":"https://cyclingtips.com/2021/11/rapha-founder-simon-mottram-to-step-down-as-ceo/","date":1637637070000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/Mottram-650x406.jpg\" /></div><h2>Rapha founder Simon Mottram to step down as CEO</h2><p>\n</p><p>Simon Mottram – the founder and longtime figurehead of British cycling clothing brand Rapha – is stepping down as CEO at the end of this year. Mottram had been in the role for 17 years, ever since he founded the company in London in 2004.</p>\n\n\n\n<p>In an email to industry members Mottram said that he would stand down at the end of 2021, but would “remain very close to the brand. I will continue to serve on the Rapha Board of Directors and will continue [to] play a role as founder.</p>\n\n\n\n<p>“I am convinced that it is the right time for me to step down and for Rapha to have a new CEO with the skills and experience to take advantage of the huge opportunity Rapha faces,” Mottram wrote. </p>\n\n\n\n<p>William Kim, a Korean American with extensive experience at the intersection of tech and fashion, will replace Mottram from the start of 2022. Kim is a former CEO of British fashion brand AllSaints, and has held roles at Gucci, Burberry, and Abercrombie &amp; Fitch. Most recently, he was the executive vice president of global retail and digital commerce at Samsung Mobile, leading the tech giant’s global direct-to-consumer arm. </p>\n\n\n\n<p>Kim is, Mottram wrote, “equally as passionate as I am about the Rapha brand and our opportunity to inspire the world to live life by bike.”</p>\n\n\n\n<p>Under Mottram’s leadership, Rapha grew from a niche concern into an icon of the cycling industry, setting a template for fashion-forward cycling clothing and forging a path for other brands to follow. In the process, the brand’s technological prowess has expanded in scope from retro-chic merino wool jerseys to cutting-edge kit.</p>\n\n\n\n<p>Since first coming on board as an apparel sponsor of Team Sky in 2013, Rapha has maintained a prominent presence in the WorldTour. It is the current sponsor of EF Education-Nippo on the men’s side, while Canyon-SRAM has long flown the flag in the women’s WorldTour (although that partnership concludes this year). </p>\n\n\n\n<p>A number of inflection points for the brand have also taken place during Mottram’s tenure. In 2017, Rapha was sold to RZC Investments  – a firm owned by Steuart and Tom Walton, heirs to the Walmart fortune – which preceded a lean stretch in the brand’s history. Since 2019, however, the brand’s financial stability has been bolstered, allowing expansion into new areas including an in-house footwear range and, as of 2021, mountain bike apparel. The brand has also released roadmaps to guide the industry, and produced influential content via print publications, EF’s Gone Racing YouTube series and the team’s “alternative calendar”.  </p>\n\n\n\n<p>Although no longer serving as CEO, Mottram – who was such a major creative and marketing beacon for Rapha – seems likely to retain some influence behind the scenes of the brand he built. “Just as importantly,” Mottram wrote, “I will continue to ride my bike with the same passion that led me to establish Rapha in the first place, as I worked to give cycling the inspiring and visionary force that it so richly deserved.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/11/rapha-founder-simon-mottram-to-step-down-as-ceo/\">Read More</a>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"350779feeeb86120ef413a5c334e1c7b8b3e7926beeddbb9861ff404582fef69","category":"Cycling"}