{"title":"Evaluation of ATP bioluminescence for rapid determination of cleanliness of livestock trailers after a commercial wash","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae052/7641153?rss=1","date":1712275200000,"content":"<span><div>Abstract</div>Pathogens such as porcine epidemic diarrhea virus (PEDV), porcine reproductive and respiratory syndrome (PRRSV), and <span>E. coli</span> are known to spread by contaminated vehicles and equipment. Pork producers have adopted trailer wash policies where each trailer is washed, disinfected, and dried before it can return to a farm. Cleanliness of livestock trailers after washing is determined by visual inspection rather than any objective method. Adenosine triphosphate (ATP) bioluminescence is used in many industries to provide real-time feedback on surface cleanliness through the detection of ATP from organic sources. That same technology may provide trailer wash facilities a way of objectively characterizing a livestock trailer’s suitability to return to a farm after washing. Two ATP luminometers (3M Clean-Trace and Neogen AccuPoint) were used to estimate the correlation between ATP bioluminescence readings and aerobic bacterial plate counts (APCs) from sampled surfaces and to determine locations within a livestock trailer that can accurately estimate surface cleanliness. Five locations in livestock trailers were evaluated. Those locations included the nose access door (NAD), back door flush gate, rear side access door (RSAD), belly flush gate (BFG), and belly side access door (BSAD). There was a positive log–log association between the two luminometers (<span>r</span> = 0.59, <span>P</span> &lt; 0.01). Every log unit increase in one unit, resulted in a 0.42 log increase (<span>P</span> &lt; 0.01) in the other unit. ATP can come from bacteria, yeasts, molds, and manure. There was a poor association (<span>r</span> ≥ 0.10, <span>P</span> ≥ 0.02) between APCs and the ATP luminometers. Still, an increase in relative light units (RLUs) resulted in a corresponding increase in colony-forming units. The greatest area of surface contamination measured by APC was the NAD. RLUs were also greater in the NAD compared to the RSAD, the BFG, and the BSAD (<span>P</span> ≤ 0.01). Because APCs and luminometer RLUs provided similar outcomes, statistical process control charts were developed to determine control limits for RLUs. This provides real-time feedback to trailer wash workers in determining cleanliness outcomes for livestock trailers. These data suggest that ATP bioluminescence can be a reliable method to monitor cleaning effectiveness in livestock trailers. Bioluminescence is a monitoring tool that should be used in conjunction with microbial methods to monitor procedures for cleaning and disinfection.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"350b0af1916a488ec19b6e392d7f3941136470b197d6607dd7ed2280fcf32e3b","category":"Environment"}