{"title":"A triple triumph: Tadej Pogačar solos to Il Lombardia victory for a third year running","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/three-times-a-charm-tadej-pogacar-solos-to-il-lombardia-victory-for-a-third-year-running","date":1696703401000,"content":"\n      It was billed as a three-way <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/showdown-in-lombardy-how-pogacar-roglic-and-evenepoel-compare-head-to-head\">showdown between the mighty trio of Tadej Pogačar, Primož Roglič and Remco Evenepoel</a>, but it turned out to be a one-man show. Pogačar once again blew everyone away in Lombardy, attacking 31km from the finish and riding solo all the way to the finish for victory. He made his race-winning attack on a descent rather than via his usual uphill acceleration, but the outcome was the same as it usually is when the Slovenian attacks, in that he won and won by a comfortable margin of 52 seconds. <br />\n<div></div>\n<div></div>\n<p><br />The result sees plenty of records being set and history made, as it so often does when Pogačar wins a race. He joins Italian legends Fausto Coppi and Alfredo Binda as one of only three riders to win a hat-trick of successive <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/il-lombardia-2023-preview-route-contenders-and-prediction\">Il Lombardia</a> titles and rises to joint-third in the all-time list of most wins here alongside the likes of Gino Bartali, Sean Kelly and Damiano Cunego. He also becomes only the 22nd rider to have won five Monuments in his career and is the first rider since Hennie Kuiper in 1981 to win Il Lombardia and the Tour of Flanders in the same season. <br /><br />It might seem inevitable in hindsight that Pogačar would triumph again, but both before and during the race, the outcome seemed far more open. The presence of the other two major stars and the strength of the field in general, meant that Pogačar was, for once, not the overwhelming favourite to take the victory, as reflected by which teams took it upon themselves to set the pace in the peloton. His UAE Team Emirates riders were nowhere to be seen for most of the day, with Roglič’s Jumbo-Visma and even Richard Carapaz’s EF Education-EasyPost instead taking the responsibility of doing so. Soudal–Quick-Step had a brief spell at the front during the third climb of the day, Berbenno (somewhat confusingly, seeing as they didn’t move to the front again after). <br /><br />All the while, UAE Team Emirates sat back and waited. And they reaped the rewards for this patience when the decisive phase of the race came. The team, at last, made their move on the penultimate and hardest climb of the day, Passo di Ganda and their lack of any earlier work meant they still had multiple domestiques available to call upon to set the pace. First, Diego Ulissi and Rafał Majka set the pace on the lower slopes of the climb, and then Adam Yates unleashed an attack to force the others to chase. Then, when everyone was softened up, both from his attacks and some long turns at the front, Pogačar started attacking himself, and upon eventually getting a gap, he still had Yates in the group behind to mark moves and sap at his rivals’ morales. Had the team been obliged to do more work earlier on in the race, it’s possible Yates would have been required for pace-setting earlier and, therefore, not fresh enough to have stayed in the chasing group. And you can’t help but think that one of the reasons the chasing group behind Pogačar could not get organised was the presence of Yates sandbagging at the back.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1722461113.jpg?v=1696703198\" /><br />Despite the margin of victory and distance of the attack, this wasn’t one of Pogačar’s superhuman rides. He didn’t actually manage to get a gap on the climb, with Aleksandr Vlasov (Bora-Hansgrohe) managing to follow his attack on it, and each of Primož Roglič, Simon Yates (Jayco-Alula) and Andrea Bagioli (Soudal–Quick-Step) bridging up to him before the top. Instead, it was an opportunistic move on the descent, and the complacency of his rivals to not follow him, that saw him slip away for good. <br /><br />Once he got the desired gap, and as it grew and grew on the descent until it was up to around half a minute, victory seemed inevitable. There was a time that you’d almost always back the group with numbers over a sole leader making such an early attack, especially with a long flat section between the bottom of the descent and the finish. But for whatever reason (perhaps something to do with power metres and the fact they allow solo riders to judge the optimum pace to go at without slipping into the red?), successful long-range solo attacks have become more and more common in recent years. All of this year’s Monuments, plus the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uci-road-world-championship-2023-route-all-you-need-to-know-about-the-routes-for-the-men-s-and-womens-races\">World Championships</a> road race, have been won this way, including Pogačar’s triumph at the Tour of Flanders, and more often than not, when a rider of Pogačar’s calibre frees himself from the rest of the field, there’s no catching him.<br /><br />Curiously, though, this is the first of Pogačar’s three Il Lombardia titles that he has won solo. Last year, he was unable to rid himself of Enric Mas (Movistar), having to overcome him at the finish in a two-up sprint. While the year before, he had to defeat Fausto Masnada (Soudal–Quick-Step) in similar circumstances. In the latter, the descent of the Passo di Granda was where (contrary to what happened today) Pogačar actually lost ground, as Masnada managed to chase up to his wheel after the Slovenian had dropped everyone on the climb. If that day suggested a possible weakness on the downhills in his intimidating armoury, today categorically refuted it. It seems Pogačar simply doesn’t have any weaknesses. The only thing that can prevent him from winning on days like this are acts of God, and even that might not be enough — he even overcame a bout of cramp in the finale.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1722483803.jpg?v=1696703217\" /><br />The most significant case of ill fortune on the day fell to Evenepoel, who crashed heavily in the early stages of the race. It certainly seems likely that the injuries sustained in that crash were the reason he was dropped out of contention on Passo di Ganda. It was the reverse of what happened in April when a crash for Pogačar paved the way for Evenepoel to take a comfortable victory, and so we will have to wait still for a much-anticipated showdown between the two of them at their best. <br /><br />As for Roglič, what initially seemed to be steady, calm racing on the Passo di Granda, when he didn’t immediately follow the attacks, but rode his own tempo to the top, might ultimately have been a lack of legs when he was dropped by the other chasers on the small final hill, Colle Aperto. But he’ll also bemoan the tactical mistake of letting Pogačar slip clear on the descent, seeing that he was the rider to let the wheel go and allow him to have his initial gap. It’s hard enough to defeat Pogačar in any circumstances — you really can’t afford to give him a free head start.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"350c041613df7c867f806f31d040c96fbd7c5993697db7016777934da2942376","category":"Cycling"}