{"title":"Exploring the Microbial Mosaic: Insights into Composition, Diversity, and Environmental Drivers in the Pearl River Estuary Sediments","link":"https://www.preprints.org/manuscript/202405.0478/v1","date":1715150806000,"content":"River estuaries are dynamic and complex ecosystems influenced by various natural processes, including climatic fluctuations and anthropogenic activities. The Pearl River estuary (PRE), one of the largest in China, receives significant land-based pollutants due to its proximity to densely populated areas and urban development. This study aimed to characterize the composition, diversity, and distribution patterns of sediment microbial communities (Bacteria, Archaea, and Eukaryotes) and investigated the connection with environmental parameters within the PRE and adjacent shelf. Physicochemical conditions, such as oxygen levels, nitrogen compounds, and carbon content, were analyzed. The study found that the microbial community structure was mainly influenced by site location and core depth, which together explained approximately 67% of the variation in each kingdom. Sites and core depths varied in sediment properties such as organic matter content and redox conditions, leading to distinct microbial groups associated with specific chemical properties of the sediment, notably C/N ratio and NH4+ concentration. Despite these differences, certain dominant taxonomic groups were consistently present across all sites: Gammaproteobacteria in Bacteria; Bathyarchaeia, Nitrososphaeria, and Thermoplasmata in Archaea; and SAR in Eukaryota. The community diversity index was the highest in the bacteria kingdom, while the lowest values were observed at site P03 across the three kingdoms and were significantly different from all other sites. Overall, this study underscores the critical role of microbial communities in shaping biogeochemical processes in estuarine environments and their sensitivity to environmental changes, providing valuable information for managing and preserving the health of estuaries and coastal ecosystems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"35117f2e005a5aaad80129057569624cd61ca0a7e7cc398e06ea695a826edeb7","category":"Interdisciplinary"}