{"title":"Growth performance, feed utilization, and resistance to acute crowding of post‐metamorphic stage black sea bass Centropristis striata reared at high stocking densities in a pilot recirculating nursery","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13017?af=R","date":1707993399000,"content":"<h2>Abstract</h2>\n<p>A reliable and cost-effective source of fingerlings is essential for the successful commercial aquaculture of black sea bass. This study aimed to determine the effects of nursery tank stocking densities on the growth performance, feed efficiency, survival, tolerance to shipping, and biochemical quality of juvenile black sea bass. In two experiments, different stocking densities were compared for black sea bass at different stages of development. In Experiment 1, intermediate stage juveniles (1.27 g mean wt) were stocked at densities of 4.5 and 6.5 fish per liter of tank volume. Growth performance and biochemical quality were similar between the two density treatments. In Experiment 2, early post-metamorphic stage juveniles (mean wt. = 0.524 g) were compared using the same stocking densities. While the fish reared at 4.5 fish/L were slightly larger, there were no significant differences in growth performance or biochemical quality between the density treatments. After both experiments, the fingerlings from each density treatment showed high survival rates under acute crowding and simulated shipping conditions. The study demonstrates that high NT densities of 4.5 and 6.5 fish/L did not negatively impact the growth performance and quality of black sea bass fingerlings, providing transport-ready fingerlings in a relatively short period.</p>","author":"Patrick M. Carroll, \nWade O. Watanabe, \nMd Shah Alam","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"3512c1c833567adf65fbc689fa970c12c852d535e6ee230cca12d0be710d8869","category":"Environment"}