{"title":"Rocket Report: Japan launches Moon mission; Ariane 6 fires up in Kourou","link":"https://arstechnica.com/?p=1966391","date":1694170838000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/GettyImages-1649545966-800x651.jpg\" alt=\"A Japanese H-IIA rocket lifts off from the Tanegashima Space Center with an X-ray astronomy satellite and a robotic Moon lander.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/GettyImages-1649545966.jpg\">Enlarge</a> <span>/</span> A Japanese H-IIA rocket lifts off from the Tanegashima Space Center with an X-ray astronomy satellite and a robotic Moon lander. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/rocket-carrying-a-small-lunar-surface-probe-and-other-news-photo/1649545966?adppopup=true\">Photo by STR/JIJI Press/AFP via Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 6.10 of the Rocket Report! A Japanese spacecraft has joined the international flock of missions traveling to the Moon this year, but you'll need to practice patience on this one. It will take about four months for Japan's small lander to get into lunar orbit, then more weeks to align with the mission's target landing site. We're crossing our fingers this lander will see the same success as India's Chandrayaan 3 mission.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets, as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>India launches its first solar research satellite</strong>. Less than two weeks after landing its first mission on the Moon, India <a href=\"https://www.isro.gov.in/Aditya_L1-MissionDetails.html\">launched a solar observatory on September 2</a> toward an orbit nearly a million miles (1.5 million kilometers) from Earth around the L1 Lagrange point. This mission, named Aditya-L1, lifted off on India's workhorse Polar Satellite Launch Vehicle and entered orbit around the Earth, where the spacecraft is expected to perform five maneuvers to escape Earth's gravity and head to its distant observation post.</p></div><p><a href=\"https://arstechnica.com/?p=1966391#p3\">Read 26 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1966391&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"35170fddbff005db542841fecbbfb39cd2283af6378b9f5c69711bf8030af449","category":"Tech"}