{"title":"Global plant responses to intensified fire regimes","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13858?af=R","date":1715831026000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Global change factors, such as warming, heatwaves, droughts and land-use changes, are intensifying fire regimes (defined here as increasing frequency or severity of fires) in many ecosystems worldwide. A large body of local-scale research has shown that such intensified fire regimes can greatly impact on ecosystem structure and function through altering plant communities. Here, we aim to find general patterns of plant responses to intensified fire regimes across climates, habitats and fire regimes at the global scale.</p>\n<h2>Location</h2>\n<p>Worldwide.</p>\n<h2>Time period</h2>\n<p>Studies published 1962–2023.</p>\n<h2>Major taxa studied</h2>\n<p>Woody plants, herbs and bryophytes.</p>\n<h2>Methods</h2>\n<p>We carried out a global systematic review and meta-analysis of the response of plant abundance, diversity and fitness to increased fire frequency or severity. To assess the context dependency of those responses, we tested the effect of the following variables: fire regime component (fire frequency or severity), time since the last fire, fire type (wildfire or prescribed fire), historical fire regime type (surface or crown fire), plant life form (woody plant, herb or bryophyte), habitat type and climate.</p>\n<h2>Results</h2>\n<p>Intensified fire regimes reduced overall plant abundance (Hedges' <i>d</i> = −0.24), diversity (<i>d</i> = −0.27), and fitness (<i>d</i> = −0.69). Generally, adverse effects of intensified fire regimes on plants were stronger due to increased severity than frequency, in wildfires compared to prescribed fires, and at shorter times since fire. Adverse effects were also stronger for woody plants than for herbs, and in conifer and mixed forests than in open ecosystems (e.g. grasslands and shrublands).</p>\n<h2>Main conclusions</h2>\n<p>Intensified fire regimes can substantially alter plant communities in many ecosystems worldwide. Plant responses are influenced by the specific fire regime component that is changing and by the biotic and abiotic conditions.</p>","author":"Roger Grau‐Andrés, \nBruno Moreira, \nJuli G. Pausas","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"35230850895d0f440786b9571f24699e0f244e8349c2768de1a7abf7a0103fe2","category":"Environment"}