{"title":"Alleged iOS 17 Wallet and Health App Redesigns Shown Off in Mockups","link":"https://www.macrumors.com/2023/04/28/ios-17-health-wallet-app-mockups/","date":1682726791000,"content":"The Wallet and Health apps are rumored to be getting updates in <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, and leaker <a href=\"https://twitter.com/analyst941\">@analyst941</a> today shared some mockups that allegedly represent the design changes that we can expect to see.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/ios-17-wallet.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nIn the <a href=\"https://twitter.com/analyst941/status/1652082138622066690\">Wallet app mockup</a>, there's a navigation bar at the bottom that separates the different functions available in the app. Cards, Cash, Keys, IDs, and Orders are listed categories. Note that this is a mockup, so the \"ID's\" spelling is likely an oversight. There's also a \"Passes &amp; More\" tab, and the leaker claims there are other features coming as well.\r<br />\n\r<br />\nUsers will reportedly be able to swipe down to access a search interface to find a specific card or pass, and there's a \"Transactions\" button. Compared to the current Wallet app design, this would be a functional improvement because it would make finding certain features like specific passes and order details simpler. It would not be a surprise to see a design like this given the many functions the Wallet app now serves in addition to storing credit and debit cards.\r<br />\n\r<br />\nAs for the Health app, <a href=\"https://twitter.com/analyst941/status/1652091759550234624\">Analyst941 claims</a> that the \"Favorites\" section under \"Summary\" will see a redesign with a card-style interface. Each card will have \"visual data\" that includes \"colored graphs,\" \"tables,\" and other information. Since the Summary tab in the Health app also includes Trends and Highlights, it is not clear how the card design for Favorites would work with those sections.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/ios-17-health-app.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nAnalyst941 <a href=\"https://www.macrumors.com/2022/08/31/iphone-14-pro-camera-cutout-indicators/\">leaked accurate information</a> about the <a href=\"https://www.macrumors.com/roundup/iphone-14-pro/\">iPhone 14 Pro</a>'s <a href=\"https://www.macrumors.com/guide/dynamic-island/\">Dynamic Island</a> ahead of its launch last year, but this leaker does not have a long-term track record as of yet and the information shared should be viewed with some skepticism in light of that.\r<br />\n\r<br />\nAnalyst941 has shared a number of rumors about features coming in ‌iOS 17‌ in recent weeks, suggesting that there's a \"special\" version of ‌iOS 17‌ in the works <a href=\"https://www.macrumors.com/2023/04/27/ipados-17-for-larger-ipads-14-1-model/\">for a 14.1-inch iPad</a> and that iPads will get <a href=\"https://www.macrumors.com/2023/04/26/ipad-lock-screen-customizations-ipados17/\">iPhone-style Lock Screen customization</a>, plus they have <a href=\"https://www.macrumors.com/2023/04/12/ios-17-rumored-features/\">mentioned vague changes</a> coming to Search, the ‌Dynamic Island‌, Control Center, and more. They have also made claims about a new <a href=\"https://www.macrumors.com/2023/04/18/watchos-10-new-home-screen-layout-rumor/\">watchOS 10 Home Screen layout</a> and have said that in the future, the Apple Watch will be able to <a href=\"https://www.macrumors.com/2023/04/27/apple-watch-pairing-multiple-apple-devices/\">pair with multiple devices</a>, including the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> and Mac.\r<br />\n\r<br />\nIt's worth noting that <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> has <a href=\"https://twitter.com/markgurman/status/1648381316302360576\">expressed doubt</a> about Analyst941's claims and believes that some of the information is inaccurate. We'll know more about Analyst941's accuracy in just over a month when Apple unveils ‌iOS 17‌, <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a>, and other updates at the June 5 WWDC keynote.\r<br />\n\r<br />\nRegardless of whether these mockups are accurate, there are other reliable rumors suggesting updates for the Health and Wallet apps. On the <em>MacRumors</em> podcast, Gurman confirmed that Apple is working on <a href=\"https://www.macrumors.com/2023/04/21/ios-17-wallet-find-my-improvements-macos-14-minor-update/\">updates to the Wallet app</a>, and he also recently said that Apple is working on new features for the Health app such as an expansion to the ‌iPad‌ and a <a href=\"https://www.macrumors.com/2023/04/25/ios-17-health-app-updates/\">mood tracking feature</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/wallet/\">Wallet</a>, <a href=\"https://www.macrumors.com/guide/health/\">Health</a>, <a href=\"https://www.macrumors.com/guide/analyst941/\">Analyst941</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/28/ios-17-health-wallet-app-mockups/\">Alleged iOS 17 Wallet and Health App Redesigns Shown Off in Mockups</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/alleged-ios-17-wallet-and-health-app-redesigns-shown-off-in-mockups.2388116/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3534edb542d1e8b3c89e7667de8df4654ee2c0bd7c5661e32564580fdd596826","category":"Apple"}