{"title":"Past, Present, and Future of Service Quality in Marketing","link":"https://www.preprints.org/manuscript/202410.1113/v1","date":1728978246000,"content":"Service quality has been one of the most significant concepts in marketing literature over the last two decades, empirically linked with customer satisfaction and long-term sustainability for businesses. The purpose of this paper is to provide an extensive review of the evolution of marketing-related articles in service quality and development. The review synthesis has shown that the Grönroos and SERVQUAL were some of the earliest service quality models to broaden intangibles within services and homogenise user experience outcomes between industries. Service quality research has evolved with technological evolution and digitalisation, which has changed customer experience parameters and created new dimensions. New-age digital trends dictate high-quality services based on personalisation, customisation habits, and the advent of artificial intelligence (AI) and machine learning. Customer preferences and loyalty have more to do with sustainability and ethical con-siderations. The service quality concept implications include the drivers of value co-creation and which emerging technologies could inform how services are delivered to customers. The review also highlights some challenges and opportunities for service quality research, including new frontiers that consider the interaction between humans and machines and social infrastructure and physical environment contexts in which services are delivered. To address the issue of the lack of an integrated perspective, this study utilises findings from the literature, particularly those emphasising human-AI interactions. The study's implication is to give a more complete theoretical framework of service quality and to combine findings from different points of view. This will give practitioners more leverage to implement service-level strategies in changing market conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"35432ab6c7ca48a84fdf9cb818067a1a3f44135658b9e0f854412411d51b8a77","category":"Interdisciplinary"}