{"title":"Get your first look at the OnePlus V Fold, thanks to render leaks","link":"https://arstechnica.com/?p=1949222","date":1687374876000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/15-1-800x450.jpg\" alt=\"The OnePlus V Fold is in the style of a Samsung Foldable.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/15-1.jpg\">Enlarge</a> <span>/</span> The OnePlus V Fold is in the style of a Samsung Foldable. (credit: OnLeaks x Smartprix)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>OnePlus is gearing up to release a foldable smartphone, and the reliable leaker, Steve Hemmerstoffer (aka OnLeaks), has given us our first look at the \"OnePlus V Fold\" at <a href=\"https://www.smartprix.com/bytes/oneplus-fold/\">Smartprix</a>. As always, this isn't an official image but a render produced by OnLeaks. Usually, these are based on CAD files that need to float around for accessory makers.</p>\n<p>OnePlus is a subsidiary of BBK, and the previous vague expectation was that OnePlus would end up shipping a rebrand of an existing BBK foldable, like the Oppo Find N2. OnLeaks' render looks nothing like the <a href=\"https://arstechnica.com/gadgets/2023/06/oppo-find-n2-review-beautiful-hardware-that-android-just-cant-deal-with/\">nearly square Find N2</a>, though. This device is more in line with the Samsung Galaxy Fold, a foldable in the mold of \"two normal smartphone screens next to each other.\" Smartprix didn't publish exact dimensions, but it looks like a very slim device.</p>\n<p>The rear camera bump is a big circle, just like <a href=\"https://arstechnica.com/gadgets/2023/02/oneplus-11-comes-to-the-us-with-killer-699-price-tag/\">other recent</a> OnePlus phones. It has three cameras on the back, one of which is an optical-zoom periscope lens. The phone makes the curious decision to not put the LED flash in the camera bump, instead sticking it all the way in the upper-left corner of the phone. Isn't the purpose of a camera bump to make room for all that extra bulky camera hardware? I wonder if anything else is in that camera bump.</p></div><p><a href=\"https://arstechnica.com/?p=1949222#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1949222&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"354412d5ea2d0ecde91729e9b9d3f1882ad1e9bc028107884ca6f35358787786","category":"Tech"}