{"title":"Anthropogenic stressors and rocky shore communities along Atlantic Patagonia: The need of including coastal biodiversity in marine protected areas planning","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4228?af=R","date":1722495600000,"content":"<h2>Abstract</h2>\n<p>\nThe conservation of marine ecosystems depends on the establishment and functioning of marine protected areas (MPAs). These areas are not exempt from the effects generated by a variety of anthropogenic stressors. Coastal biodiversity can provide key information of MPAs health; however, it is not usually considered in MPAs planning process, particularly in the Southwestern Atlantic.\nIn this work, we provide an analysis and discussion of the anthropogenic stressors and the rocky intertidal biodiversity parameters occurring along 10 latitudinal degrees within the major MPAs of the continental Patagonia (Argentina). Specifically, we studied the intensity of 10 social, economic and environmental marine-related anthropogenic stressors and characterized the intertidal biodiversity (biomass, density and size of scorched mussels and its associated communities) in the mid intertidal rocky shore.\nWe found that most of the anthropogenic stressors studied had some level of intensity at all MPAs in Patagonia. In addition, each MPA has unique biodiversity assemblages. Total anthropogenic stress was not directly correlated with the mussel bed parameters or the richness of the associated fauna. Artisanal fisheries, tourism, invasive species and trampling were found to have the highest intensity on the MPAs. Moreover, a negative relation between artisanal fisheries, tourism and invasive species and the biomass and size of mussels was found, along with a negative relation between tourism and density. Furthermore, three MPAs registered the greatest anthropogenic pressure.\nOur study evidence that although Argentina has significantly advanced in the creation of MPAs in the last decades, the objectives for the conservation of the ecosystems are still narrow. Our results highlight that globally, MPAs need to include the perspective of coastal intertidal biodiversity and their stressors in their management strategies. By doing this, it will contribute to have a more holistic approach and thus it will improve MPAs conservation efforts.\n</p>","author":"María M. Mendez, \nEvangelina Schwindt","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"355984669807429b280aeafcf7dedd7b57f743c463a1c604a3056fdaeeffd4c8","category":"Environment"}