{"title":"Google Fi takes the sting off the Pixel Fold price tag with $700 off","link":"https://arstechnica.com/?p=1938716","date":1683837478000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/14-1-980x668.jpg\" alt /></div>\n          <p>\n            This lineup, from left to right, shows the Pixel 7 Pro, Pixel 7, Pixel 7a, and then the Pixel Fold. It's very short and very wide.                           [credit:\n                              Google                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>So far, the Pixel Fold looks like <a href=\"https://arstechnica.com/gadgets/2023/05/google-pixel-fold-the-thinnest-foldable-with-the-biggest-battery-in-the-us/\">an impressive</a> first foldable from Google but, wow, is it expensive. It would be nice to knock at least a few dollars off that sky-high $1,799 price tag. You can actually do that <a href=\"https://fi.google.com/about/phones/pixel-fold\">at Google Fi</a> where, with a two-year service commitment, you can get $700 off a Pixel Fold. That could go up to $1,000 off if you trade in an eligible phone.</p>\n<p>There aren't too many catches to this deal. <a href=\"https://fi.google.com/about/promo-terms/?id=Cf_80IW--gUA\">Google says</a> you have to activate your new Pixel Fold on Fi within 30 days, keep your account active for 24 months, and it's open to new and existing Fi customers in the US. You'll still have to pay the $1,799 upfront or take the $75 a month (plus service) payment plan, and you'll eventually get that $700 back as 24 monthly service credits of $29.17. The offer expires \"July 4, 2023, at 11:59 PM PDT or while supplies last.\"</p>\n<p>If you weren't plugged in yesterday, the Fold was officially announced as a real-life product after about three years of rumors. Google is not necessarily known for cutting-edge hardware, but the Fold looks great. In the US market, it can claim the titles of \"thinnest foldable\" <em>and</em> \"biggest foldable battery\" which is a neat trick. Google's push into foldables also hopefully contains some Android and Google app software work, but we'll have to investigate that when the phone finally launches on June 27.</p></div><p><a href=\"https://arstechnica.com/?p=1938716#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1938716&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"355cbed509fafe1ba7d6b78fd889729b8ddde53021791d4561f96d35409d86d8","category":"Tech"}