{"title":"iCloud.com gets interface updates and new features for Photos, Mail, and more","link":"https://www.macworld.com/article/2086055/icloud-updates-new-features-september-2023.html","date":1695939042000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple has unveiled updates and new features to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.icloud.com/&amp;xcust=1-1-2086055-1-0-0&amp;sref=https://www.macworld.com/feed\">iCloud.com</a>, the web portal for the company’s set of tools for storage, apps, and device syncing. The new features come after Apple recently made available new iCloud+ storage tiers of 6TB ($29.99 monthly) and 12TB ($59.99 monthly).</p>\n\n\n\n<p>The updates and new features are tied to the release of <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17</a>, <a href=\"https://www.macworld.com/article/1794980/ipados-17-release-date-features-compatibility-beta.html\">iPadOS 17</a>, and <a href=\"https://www.macworld.com/article/1670742/macos-14-release-date-features-compatibility-beta.html\">macOS Sonoma</a>. Here is Apple’s list, which is shown on iCloud.com.</p>\n\n\n\n<div><div>\n<h2>General</h2>\n\n\n\n<ul>\n<li><strong>Customize What You See in Tiles: </strong>Choose a specific folder for Notes, a mailbox for Mail, display just your favorite Photos, and more. You can also configure your homepage to show multiple layouts of the same tile so you can see more content from your favorite apps. Access layout options in the menu in the lower-left corner of a tile.</li>\n\n\n\n<li><strong>Quick Actions From Tiles:</strong> Mark reminders as complete, flag an email, see a preview of a file in Drive, and more. Perform actions from tiles by hovering on content and selecting to reveal quick actions. If you’re on a touch device, swipe to the left.</li>\n\n\n\n<li><strong>Browser Notifications:</strong> Get notified of new email or event invitations and updates with browser notifications on a PC for Mail and Calendar. You can configure browser notifications in iCloud Settings on the web.</li>\n\n\n\n<li><strong>Updated Design:</strong> New design and layouts across Calendar, Contacts, Reminders, Drive, and more.</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<h2>iCloud Mail</h2>\n\n\n\n<ul>\n<li><strong>Attach from iCloud: </strong>Attach photos and files to email messages directly from iCloud.</li>\n\n\n\n<li><strong>Undo Send:</strong> Easily unsend an email message that you just sent before it reaches the recipient’s inbox.</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<h2>iCloud Calendar</h2>\n\n\n\n<ul>\n<li><strong>Calendar Identity Control: </strong>Control the email address others see in event invitations and even use your Custom Email Domain to unite your Calendar and Mail identities. Manage it all from iCloud Calendar settings.</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<h2>iCloud Drive</h2>\n\n\n\n<ul>\n<li><strong>List View: </strong>Switch between viewing your files as icons or in as a list with the toggle in the upper left corner.</li>\n\n\n\n<li><strong>Preview Your Files:</strong> Press the Space bar after selecting a file or photo to get a quick preview before opening or downloading it. You can also access quick view through the options menu.</li>\n\n\n\n<li><strong>Access File Options:</strong> Easily access actions like renaming a file or downloading a copy through the options menu.</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<h2>iCloud Photos</h2>\n\n\n\n<ul>\n<li><strong>Memories: </strong>See your Memories and play them in a full-screen view by clicking on the memory.</li>\n\n\n\n<li><strong>Slideshow:</strong> To view your selection in a slideshow, select Play Slideshow from the menu in the upper right corner.</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<h2>Notes</h2>\n\n\n\n<ul>\n<li><strong>Linked Notes: </strong>Create links to other notes by typing &gt;&gt; or Command + K as a shortcut to add links while writing in your note.</li>\n\n\n\n<li><strong>Shared Folders: </strong>Collaborate with others on an entire folder of notes.</li>\n\n\n\n<li><strong>Enhanced Search:</strong> Use suggested search to refine your search against categories like shared notes, checklists, tags and more.</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<h2>Reminders</h2>\n\n\n\n<ul>\n<li><strong>Customize Your Reminders: </strong>Add dates, locations, flags, and more using the edit details button.</li>\n</ul>\n</div></div>\n\n\n\n<h2>What are iCloud and iCloud+?</h2>\n\n\n\n<p>iCloud comes with every Apple device and it essentially allows users to store and access information and data online. The services that are involved include Mail, Photos, Calendar, Contacts, Notes, Reminders, and Find My. Users also have access to web-based versions of Pages, Numbers, and Keynote. The new features mentioned above involve the web-based versions of these services, available at iCloud.com. <a href=\"https://www.macworld.com/article/672569/how-to-use-icloud.html\">Learn more about iCloud</a>.</p>\n\n\n\n<p>iCloud+ is a fee-based service that adds privacy features and storage options that increase the amount over the free 5GB that is included with iCloud. <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2086055-1-0-0&amp;u=https://www.apple.com/icloud/\">iCloud+ plans</a> start at $0.99 per month for 50GB. iCloud+ is also included in the <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2086055-1-0-0&amp;u=https://www.apple.com/apple-one/\">Apple One</a> packages that bundle Apple subscription programs such as Apple Music, Apple TV+, and more.</p>\n\niCloud</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3564afdb76112c4f67d401d5419faeeb91d9c465b5041e15cc28a5efc1e7a303","category":"Apple"}