{"title":"Kasia Niewiadoma: Annemiek van Vleuten isn’t as strong as we would expect","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/kasia-niewiadoma-annemiek-van-vleuten-isn-t-as-strong-as-we-would-expect","date":1690465714000,"content":"\n      <p><span>Stage four of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes </a>saw the general classification battle explode for the first time in the race. With defending Tour champion Annemiek van Vleuten attacking in the final 30 kilometres of the race and SD Worx’s Demi Vollering chasing her down in a fierce attempt to not concede any time on the GC, it was the first time in this year’s Tour de France Femmes that it felt like we were watching a real, vintage Tour stage. There were the attacks for the stage win from the breakaway at the very front of the race, and those gunning for the yellow jersey were scrapping for seconds behind. It provided riveting viewing for those of us watching at home, but ended up being an eye-opening experience for those in the race, too.</span></p>\n<div></div>\n<p><span>One rider who is expected to be a key protagonist in this year’s Tour is Kasia Niewiadoma, who finished in third place in 2022 after a consistent and measured ride throughout the entire race. Niewiadoma is now in her tenth year as a professional rider and has raced through various iterations of the women’s peloton, each with different dominating riders at the helm. From the like of Marianne Vos to Anna van der Breggen, Niewiadoma has faced – and beaten – them all over the years. This means that the Polish rider is well-versed in the dynamics of women’s stage racing, with the experience to be able to spot when a rider is feeling good and when they are a little off the mark.</span></p>\n<p><span>Speaking after the end of stage four, Niewiadoma told <em>Rouleur</em> that last year’s Tour winner, Annemiek van Vleuten, didn’t look as sharp as she has done in years previous. “The moment we hit the final, it was so so hard, it was like being back in Belgium doing Classics,” the Canyon//SRAM rider said about the end of the stage. “It was all out or nothing. Gambling in some ways. It was definitely interesting to see how strong Demi [Vollering] is, she’s very strong. Annemiek, maybe less than what we would expect. It’s going to be interesting in the upcoming days.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230725TDFFAZ1031-A.S.O._Charly_Lopez_1024x1024.jpg?v=1690465670\" alt=\"Kasia Niewiadoma at the 2023 Tour de France Femmes\" /></div>\n\n<p><span><em>Image: ASO/Charly Lopez</em></span></p>\n<p><span>Following the discord surrounding SD Worx’s tactics during the stage, whereby they ended up sending yellow jersey rider Lotte Kopecky up the road with the aim of her eventually dropping back to help Demi Vollering on the climbs, Niewiadoma added she was confused by the Dutch team’s strategy. </span></p>\n<p><span>“I feel like sometimes SD Worx wants to send people up the road so that they don’t have to chase anything, they want others to bring them to the break. The most interesting part was when Lotte was in the front and Demi was chasing sometimes, I didn't get that part,” Niewiadoma explained.</span></p>\n<p><span>As for her own performance, the 28-year-old was frustrated about how she approached the finale of the stage, missing out on victory after poor positioning in the run-in to the finish. “I didn’t know what I should be doing, because I didn’t want to be isolated and I was hoping that with Ricarda [Bauernfeind] we would be together past a certain point and play off each other’s attacks, but I was with a group with two SD Worx and Movistar had girls too,” Niewiadoma explained. “I was waiting for my moment in the final to go all out from the bottom. In the end I felt empty though, everyone’s legs were not fresh, everyone was messed up, I wanted to make my mark there but I lost some distance in the corner and was too far back from the girls which puts you in a mindset like oh shit, can I make it back?”</span></p>\n<p><span>Niewiadoma added that she is looking forward to the rest of the race for more chances to race aggressively and try her own chances at a stage victory, as well as gain time on the general classification. While she admits that stage four gave her an idea of the form of the likes of Van Vleuten, she also is keen to add that she knows better than to count out the Dutch rider.</span></p>\n<p><span>“To be honest, with Annemiek, I prefer not to say too much, as last year she was losing time on every stage and then when she went on the penultimate stage nobody could follow,” Niewiadoma says. “With her, it’s like, she might be getting better everyday and also her style is longer climbs, today was more punchy. My main takeaway from today is that there are a lot of girls on an equal level. Maybe the girls who are first and second on GC will be ahead, but the battle for third to sixth is going to be close.”</span></p>\n<p><em><span>Cover image: Getty/Tim de Waele</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"356e3efe475539baafbdc2b28b52a3fec3c070e6a0aaced267a2cc53d7d50017","category":"Cycling"}