{"title":"Relativity Space printed its Terran 1 rocket’s second stage in a few weeks","link":"https://arstechnica.com/?p=1751844","date":1616594549000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Dev-2-MDC-800x448.jpg\" alt=\"Relativity Space tests a development version of its Terran 1 second stage at Stennis Space Center.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Dev-2-MDC.jpg\" class=\"enlarge-link\" data-height=\"1922\" data-width=\"3430\">Enlarge</a> <span class=\"sep\">/</span> Relativity Space tests a development version of its Terran 1 second stage at Stennis Space Center. (credit: Relativity Space)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>When Relativity Space was founded with the audacious idea of using 3D printing to manufacture pretty much the entirety of a small rocket, the premise sounded revolutionary. But if the company could pull it off, Relativity would have the potential to upend traditional rocket manufacturing, which in many respects remains a hands-on job.</p>\n<p>There remain very real questions about whether or not this approach is ultimately feasible. The acid test will come when Relativity attempts to reach orbit. Nevertheless, the company's 3D printing technology does seem to be working. Two recent milestones in the development of the company's Terran 1 rocket, in fact, suggest the tech is working really well.</p>\n<h2>Second stage print</h2>\n<p>In an interview, Relativity CEO Tim Ellis said the company recently printed the second stage that will be used on the inaugural flight of the Terran 1 rocket, which is presently scheduled to take place before the end of 2021. The stage was printed at a rate of about 1 linear foot per day, so in printer time it took about three weeks in total to produce the 20-foot tall second stage.</p></div><p><a href=\"https://arstechnica.com/?p=1751844#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1751844&comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3576c42bc73698ca8e4f6ee654051c0c54c5ab167a7aef1e1a397fd9e418c784","category":"Tech"}