{"title":"Rainfall partitioning characteristics by two sand‐binding shrubs and their impact on shallow soil moisture replenishment in the Northwestern desert steppe of China","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2652?af=R","date":1716392991000,"content":"<h2>Abstract</h2>\n<p>Rainfall partitioning by the vegetation canopy into stemflow (SF) and throughfall (TF) plays a crucial role in soil infiltration and the local water balance. This study aims to quantify the differences in SF and TF between two sand-binding shrubs, <i>Caragana liouana</i> and <i>Salix psammophila</i>, in the desert steppe, clarify the effects of biotic and abiotic factors on them using the boosted regression trees (BRT) model, and compare soil moisture replenishment during the growing seasons of 2021 and 2022. Under identical rainfall conditions, the canopies of <i>C. liouana</i> and <i>S. psammophila</i> can lead to differences in rainfall partitioning. The SF percentage ranged from 0 to 23.70% for <i>C. liouana</i> and from 0% to 3.3% for <i>S. psammophila</i>, respectively, while the TF percentage ranged from 42.12% to 90.07% for <i>C. liouana</i> and from 52.39% to 94.87% for <i>S. psammophila</i>. The funnelling ratio for <i>C. liouana</i> (69.59) is 1.19 times higher than for <i>S. psammophila</i> (58.36). Rainfall amount is the primary variable affecting rainfall partitioning. The average soil moisture replenishment and soil moisture conversion efficiency under the <i>C. liouana</i> canopy are 11.02 mm and 58.39%, respectively, which are significantly higher than those for <i>S. psammophila</i> (4.84 mm and 24.33%, respectively). These findings suggest that <i>C. liouana</i>, with its relatively higher SF and soil moisture conversion capability compared to <i>S. psammophila</i>, plays a significant ecohydrological role in water-limited ecosystems. This study provides a reference for species selection and ecological management in vegetation restoration efforts in desert steppes and similar regions.</p>","author":"Xiaoying Chen, \nLin Chen, \nXinguo Yang, \nMinlan Li, \nDian Yu, \nNaiping Song","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"3581b05a981afcd5190c913ae9a3e7fab70a0a9a58e724d216da26031fcef20a","category":"Environment"}