{"title":"Abiotic stress responses in melon (Cucumis melo): Emerging underlying molecular mechanisms and biotechnological advances to cope with the issue","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12919?af=R","date":1718088249000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/5d3cf48a-68c6-4815-932c-cbca1a1b91b5/aab12919-toc-0001-m.png\" alt=\"Abiotic stress responses in melon (Cucumis melo): Emerging underlying molecular mechanisms and biotechnological advances to cope with the issue\" />\n<p>Abiotic stress conditions negatively impact the growth and production of melons. Based on the current genetic and molecular data, melon breeding and genetic engineering can be approached to improve the abiotic stress tolerance in this plant species. In addition to these, other biotechnology-based methods as well as the application of various exogenous supplements have been shown to play a significant role in ameliorating melon stress tolerance.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Melon (<i>Cucumis melo</i>), a member of the Cucurbitaceae family, is consumed worldwide. In melon cultivation, abiotic stress has been found to negatively affect crop growth and productivity. Various biotechnological approaches can be used to ameliorate stress tolerance. Previous studies have investigated the effects of major abiotic stress conditions (e.g., drought, salt, cold and heat) on melon growth and development at the phenotypic and physiological levels, and are pivotal to understand the molecular mechanisms underlying abiotic stress responses in melons. This review aims at systematically reviewing current efforts to understand the abiotic stress biology in melon plants. In addition, we discuss several approaches (e.g., fertilization, breeding, genetic engineering) that have been examined to improve melon growth and production under stressful conditions.</p>","author":"Phuong Dong Tran Nguyen, \nThuan Duc Lao, \nThuy Ai Huyen Le, \nNguyen Hoai Nguyen","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"3586163dab4b0ab5a4b3191539065ec82eb72858fb5dda76713e65309c88f545","category":"Environment"}