{"title":"Valorization of pyrolytic plastic-derived char for adsorption of wastewater contaminants: a kinetic and thermodynamic investigation","link":"http://link.springer.com/10.1007/s13762-024-05467-1","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>The sustainable management of plastic waste is one of the challenges of our time due to the high percentage of landfilling. One of the strategies is its thermal treatment via pyrolysis, but it is associated with the production of a char, necessitating a proper valorization pathway. In this work, we investigated for the first time the use as adsorbent of a real plastic-derived char obtained as such from a pyrolysis pilot plant. This is a novel approach with respect to literature, where the char is typically obtained as desired product. The adsorbent was characterized via several techniques, and methylene blue was chosen as representative contaminant of wastewater. The inorganic component (80 wt.%) was mainly associated with the presence of rod-like structures, rich in Si, while the organic fraction showed the occurrence of aromatic components. Under the thermodynamic point of view, Langmuir isotherm effectively fitted the experimental data (<em>R</em><sup>2</sup> = 0.98), while the kinetic results were well described by a pseudo-second-order law (<em>R</em><sup>2</sup> &gt; 0.99). The negative Gibbs free energy highlighted that the adsorption process was spontaneous, and the enthalpy change (∆<em>H</em><sup>0</sup> = 7.18 kJ/mol) revealed the endothermic nature of the process, in a range characteristic of physisorption phenomena. Overall, this study highlights that a low-value char, derived from a real plastic waste, can be a promising valuable alternative to expensive adsorbents thanks to its adsorption capacity of 5.8 mg/g without prior activation treatments, hence being a starting point for the development of a holistic approach in plastic waste management.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"358829c356ef1f44b1f998456bbab51790ef80839836aa885a25778e64f0f7ae","category":"Environment"}