{"title":"Neuralink เปิดรับอาสามัครมนุษย์คนแรกฝังอุปกรณ์ในสมอง","link":"https://www.blognone.com/node/135876","date":1695357294000,"content":"<div><div><div><p><a href=\"https://neuralink.com/blog/first-clinical-trial-open-for-recruitment/\">Neuralink กำลังรับสมัครอาสาสมัครมนุษย์คนแรก</a> สำหรับทดลองฝังอุปกรณ์ทดลองลงไปในสมอง บริษัทได้ประกาศว่าคณะกรรมการพิจารณาจริยธรรมการวิจัยในมนุษย์และโรงพยาบาล (ไม่เปิดเผยชื่อ) ได้อนุมัติให้การทดลองนี้รับอาสาสมัครเข้าร่วม</p>\n<p>ทางบริษัทมีเป้าหมายการรับอาสาสมัครที่เป็นอัมพาตครึ่งซีกจากไขสันหลังหรือ ALS (amyotrophic lateral sclerosis) ซึ่งอาสาสมัครจะได้รับการฝังอุปกรณ์เชื่อมต่อระหว่างสมองและคอมพิวเตอร์แบบไร้สาย มีชื่อว่า N1 จะถูกฝังผ่านการผ่าตัดเข้าไปในสมองโดยหุ่นยนต์ผ่านตัดของบริษัท R1</p>\n<p>อุปกรณ์การปลูกถ่ายมีอิเล็กโทรด 1,024 กระจายอยู่ในเส้นใย 64 เส้น ที่บางกว่าเส้นผมมนุษย์, ส่วนขั้วไฟฟ้าจะทำหน้าที่บันทึกกิจกรรมประสาทที่เกี่ยวกับการเคลื่อนไหว และจะถูกถอดรหัสคลื่นสัญญาณเหล่านี้ออกมา</p>\n<p>บริษัทกล่าวว่าเป้าหมายการฝัง N1 เพื่อให้ผู้เข้าร่วมทดลองสามารถควบคุมเคอร์เซอร์ด้วยความคิด ซึ่งการทดลองนี้จะประเมินความปลอดภัยเป็นหลักและได้เห็นประสิทธิภาพอีกด้วย จากรายงานของ Ars Technica การทดลองคลินิกนี้ยังไม่ปรากฏในฐานข้อมูลกลางของรัฐบาลสำหรับการทดลองคลินิก (clinicaltrails.gov) และยังไม่แน่ชัดว่า Neuralink จะรับอาสาสมัครกี่คน</p>\n<p>ก่อนหน้านี้ Neuralink  มีประเด็นเรื่องการขออนุญาตจากองค์การอาหารและยาของสหรัฐ  Food and Drung Administration (FDA)  ซึ่งได้ถูกปฏิเสธคำขอไปเนื่องจาก ความปลอดภัยของอุปกรณ์แบตเตอรี่ลิเธียม, ความเป็นไปได้ในการย้ายอุปกรณ์และความไม่แน่นอนว่าอุปกรณ์จะสามารถถอดออกโดยไม่ทำลายเนื้อเยื่อสมองของมนุษย์ได้หรือไม่</p>\n<p><a href=\"https://www.blognone.com/node/134029\">แต่ในเดือนพฤษภาคม Neuralink ประกาศว่าได้รับไฟเขียวจาก FDA</a> ให้เริ่มการทดลองในมนุษย์ ซึ่งการทดลองนี้เรียกว่าการศึกษา PRIME โดยจะใช้เวลากว่า 6 ปีจึงจะสำเร็จ โดยผู้เข้าร่วมจะได้รับการประเมินถึง 9 ครั้ง ใน 18 เดือน หลังจากนั้นจะเป็นการติดตามผลระยะยาว รวมไปถึงมีการนัดตรวจ 20 ครั้ง ในระยะเวลา 5 ปี</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/949f5e5379bdfc70d7435ea47f659c00.png\" /></p>\n<p>ที่มา: <a href=\"https://arstechnica.com/health/2023/09/musks-neuralink-seeks-volunteers-for-brain-implants-whos-in/\">Ars Technica</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/neuralink\">Neuralink</a></div><div><a href=\"/topics/elon-musk\">Elon Musk</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"358b6ad84423519ba5ba76d281374eed9f64d9091597b2d711810e9185088e86","category":"Thai"}