{"title":"A cold spot and a stellar burp led to strange dimming of Betelgeuse","link":"https://arstechnica.com/?p=1773745","date":1623855636000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Thanks to a new study conducted with ESO telescopes, we now know that Betelgeuse's dip in brightness was the result of a \"dusty veil\" that formed from material that emerged from the star. Credit: ESO/L. Calçada. </p></div>\n<p>In December 2019, astronomers noticed a strange, dramatic dimming in the light from <a href=\"https://en.wikipedia.org/wiki/Betelgeuse\">Betelgeuse</a>, a bright red star in the Orion constellation. They puzzled over the phenomenon and wondered whether it was a sign the star was about to go supernova. Several months later, they had narrowed the most likely explanations to two: a short-lived cold patch on the star's southern surface (akin to a sun spot), or a clump of dust making the star seem dimmer to observers on Earth. We now have our answer, according to <a href=\"https://www.nature.com/articles/s41586-021-03546-8)%20(https://doi.org/10.1038/s41586-021-03546-8\">a new paper</a> published in the journal Nature. Dust is the <a href=\"https://www.eso.org/public/news/eso2109/\">primary culprit</a>, but it is linked to the brief emergence of a cold spot.</p>\n<p>As Ars' John Timmer <a href=\"https://arstechnica.com/science/2020/08/astronomers-kill-all-the-fun-blame-dust-for-betelgeuses-dimming/\">reported last year</a>, Betelgeuse is one of the closest massive stars to Earth, about 700 light years away. It's an old star that has reached the stage where it glows a dull red and expands, with the hot core only having a tenuous gravitational grip on its outer layers. The star has something akin to a heartbeat, albeit an extremely slow and irregular one. Over time, the star cycles through periods when its surface expands and then contracts.</p>\n<p>One of these cycles is fairly regular, taking a bit over five years to complete. Layered on that is a shorter, more irregular cycle that takes anywhere from under a year to 1.5 years to complete. While they're easy to track with ground-based telescopes, these shifts don't cause the sort of radical changes in the star's light that would account for the changes seen during the dimming event. </p></div><p><a href=\"https://arstechnica.com/?p=1773745#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1773745&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3593df09c5b87eef13f811f970941e9d97fcafd5000860d09bfe1ed7de633d3b","category":"Tech"}