{"title":"Thermal-Electrical-Mechanical Coupled Finite Element Models For Battery Electric Vehicle","link":"https://www.preprints.org/manuscript/202407.0697/v1","date":1720501225000,"content":"The safety of lithium-ion batteries is critical to the safety of battery electric vehicles (BEVs). The purpose of this work is to develop a method to predict battery thermal runaway in full electric vehicle crash simulation. The thermal-electrical-mechanical coupled finite element analysis is used to model an individual lithium-ion battery cell, a battery module, a battery pack, and a battery electric vehicle with 24 battery modules in a live circuit connection. The lithium-ion battery is modeled using a representative approach, with each battery internal component individually modeled to represent its geometric shape and realistic thermal, mechanical, and electrical properties. A resistance heating solver and Randles circuit model built with generalized voltage source are used to simulate the battery electrical behavior. The thermal simulation of the battery accounts for the heat capacity and thermal conductivity of various cell component materials, as well as heat conduction, radiation, and convection at their interfaces. The mechanical property of battery cell and battery module models is validated using spherical punch tests. The electrical property of the battery cell and battery module models is verified against CircuitLab simulation in an external short circuit test. The simulation result of battery module’s internal resistance agrees with the experimental data and the literature value. The multi-physics coupling phenomenon is demonstrated with a cylindrical compression simulation on the battery module. The multi-physics BEV model with 24 live battery modules is used to simulate the external short-circuit test and the side pole impact test. The simulations run time is less than 24 hours. The results demonstrated the feasibility of using representative battery model and multi-physics analysis to predict battery thermal runaway in full electric vehicle crash analysis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3594413cfb019973ef12030a8816ded07ec2f6ebd302ef98bc6e89482bfe0204","category":"Interdisciplinary"}