{"title":"รีวิว Sapiens ฉบับการ์ตูน","link":"https://markpeak.net/sapiens-a-graphic-history/","date":1627197929000,"content":"<p>ชื่ออย่างเป็นทางการของหนังสือเล่มนี้คือ <strong>Sapiens: A Graphic History</strong> ภาษาไทยคือ <strong>“เซเปียนส์ ประวัติศาสตร์ฉบับกราฟิก”</strong> แต่เชื่อเถอะว่าไม่มีใครเรียกแบบนี้สักเท่าไร ทุกคนน่าจะเข้าใจว่ามันคือ “เซเปียนส์ ฉบับการ์ตูน” กันหมด</p>\n<p><a href=\"https://www.ynharari.com/book/graphicnovelsapiens/\">Sapiens: A Graphic History</a> เป็นการนำหนังสือ Sapiens อันโด่งดังของ Yuval Noah Harari มาทำเป็นการ์ตูน โดยเครดิตการเขียนเรื่องเป็นชื่อของ Harari เอง ร่วมกับ David Vandermeulen ที่มีชื่อเป็นนักเขียนร่วม และวาดภาพโดย Daniel Casanave ลองไปค้นข้อมูลดูแล้วเป็นนักวาดการ์ตูนเด็กชาวฝรั่งเศส ที่งานตีพิมพ์ส่วนใหญ่เป็นภาษาฝรั่งเศส</p>\n<p>ฉบับแปลภาษาไทยตีพิมพ์โดย หนังสือพิมพ์ยิปซี ผู้แปลคือ ดร.นำชัย ชีววิวรรธน์ ซึ่งเคยแปลหนังสือวิทยาศาสตร์มาแล้วหลายเล่มมาก (เช่น กำเนิดสปีชีส์) ราคาปก 395 บาท</p>\n<p></p>\n<p>เนื่องจากผมไม่ได้อ่าน Sapiens ฉบับเต็ม (ด้วยเหตุผลว่าขี้เกียจ อ่านแต่<a href=\"https://anontawong.com/2016/12/11/sapiens-1/\">ฉบับสรุปย่อของคุณ Anontawong</a>) เลยไม่สามารถเปรียบเทียบได้ว่า เหมือนหรือต่างจากฉบับหนังสืออย่างไร</p>\n<p>แต่ที่บอกได้แน่ๆ คือมันยังไม่จบเพราะเป็น Vol. 1 เท่านั้น (กำเนิดมนุษยชาติ The Birth of Humankind) โดย Vol. 2 ฉบับภาษาอังกฤษ (<a href=\"https://www.amazon.com/Sapiens-Graphic-History-Pillars-Civilization/dp/0063212234/\">Pillar of Civilization</a>) มีกำหนดขายเดือนตุลาคม 2021 ซึ่งคงต้องรอกันอีกพอสมควรถึงจะมีฉบับแปลไทยตามออกมา</p>\n<p>เท่าที่เข้าใจคือ Sapiens ฉบับกราฟิกไม่ได้เรียงบทตามฉบับหนังสือตรงๆ แต่บทสุดท้ายใน Vol. 1 ชื่อ “ฆาตกรต่อเนื่องข้ามทวีป” เทียบได้กับ <a href=\"https://anontawong.com/2016/12/25/sapiens-3/\">บทที่ 3</a> ของฉบับหนังสือเท่านั้น (หนังสือมี 20 บท!) เลยไม่แน่ใจเหมือนกันว่า ฉบับกราฟิกจะมีทั้งหมดกี่เล่ม</p>\n<p>ไม่ว่าจะมีกี่เล่ม แต่ตอนนี้ฉบับแปลภาษาไทยที่วางขายมีแค่เล่มเดียว เราก็อ่านแค่เล่มเดียวไปก่อน</p>\n<p>อ่านจบแล้วสรุปได้ว่า ดีแต่เหนื่อย!</p>\n<p></p>\n<p>ข้อดีคือ เป็นการแปลงหนังสือ non-fiction มาเป็นการ์ตูนที่มีบทสนทนา conversation ได้น่าสนใจดี โดยตัวละครในเรื่องคือตัว Yuval เองและผองเพื่อนที่ผลัดกันมาเล่าเรื่อง ชี้ประเด็นต่างๆ ร่วมกับตัวละครในโลกยุคโบราณ (เช่น มนุษย์เซเปียนส์ยุคหินที่มีชื่อชัดเจน) มีการ characterize สิ่งนามธรรมบางอย่างให้กลายมาเป็นตัวการ์ตูนให้เข้าใจง่ายขึ้น (เช่น Doctor Fiction)</p>\n<p>ดูตัวอย่างคาแรกเตอร์ได้จากในคลิป</p>\n<p></p>\n<p>ส่วนที่ว่าเหนื่อยคือ ถึงแม้แปลงเป็นการ์ตูนแล้วตัวหนังสือก็ยังเยอะอยู่ เพราะมาจากหนังสือ non-fiction ที่ค่อนข้างหนักอยู่แล้ว การอ่านต้องใช้พลังงานพอสมควรกว่าจะจบแต่ละบท (แถมหนังสือค่อนข้างยาวคือ 245 หน้า)</p>\n<p>งานด้านภาพ เป็นสไตล์การ์ตูนเด็กฝรั่ง อ่านง่ายสบายตา แต่สไตล์ก็ต่างจากมังงะญี่ปุ่นหรือคอมิกส์อเมริกันอยู่พอสมควร (ภาพตัวอย่างดูได้จากคลิป) งานแปลฝีมือระดับ อ.นำชัย ไม่มีปัญหาใดๆ อ่านเข้าใจ เคลียร์ ไม่มีจุดที่งงหรือกำกวม</p>\n<p>ใครที่อยากอ่าน Sapiens แต่ยังขี้เกียจอยู่แบบผม จะอ่านเวอร์ชันการ์ตูนแทน ก็น่าเป็นทางเลือกที่ดีในการเข้าถึงเนื้อหาได้สะดวกขึ้น ส่วนใครที่อ่าน Sapiens ฉบับเต็มแล้วจะซื้อเก็บอีกเวอร์ชัน ก็ไม่ผิดหวัง หนังสือทำดี แปลดี คุณภาพการพิมพ์ดี</p>\n<p>ทั้งนี้ ถึงแม้ภาพลักษณ์มันคือ หนังสือเซเปียนส์ฉบับการ์ตูน แต่ก็ไม่เหมาะกับเด็กเล็กๆ มากนัก ในแง่ความยากของเนื้อหา คิดว่าสักประมาณเด็ก ม.ต้น ขึ้นไปน่าจะพออ่านได้เข้าใจเกือบหมดแล้ว</p>The post <a href=\"https://markpeak.net/sapiens-a-graphic-history/\">รีวิว Sapiens ฉบับการ์ตูน</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"35957062d6e4e007881af3ee712b8e02a01f4e23a24a7f44ed04500f7de06dfc","category":"Thai"}