{"title":"Analysis of changes in the occurrence of ice phenomena in upland and mountain rivers of Poland","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307842","date":1722002400000,"content":"<p>by Krzysztof Kochanek, Agnieszka Rutkowska, Katarzyna Baran-Gurgul, Iwona Kuptel-Markiewicz, Dorota Mirosław-Świątek, Mateusz Grygoruk</p>\r\n\r\nThe ice phenomena are an inherent component of rivers in temperate, continental, and polar climate zones. Evident progress in global warming leads to a decrease in snow cover on land and ice phenomena in water bodies, disrupting the stability of the hydrological cycle and aquatic ecosystems. Although common observations indicate the disappearance of ice phenomena in rivers over recent decades, detailed quantitative research is lacking in many regions, especially in the temperate zone. In this paper, ice phenomena were analyzed on the rivers of southern Poland, located in the upland and mountain areas of the country, as no such studies have been conducted so far. The temporal changes in the annual number of days with ice (NDI) phenomena were studied in locations where ice phenomena were observed every year for at least 30 years between 1951 and 2021. Using straightforward but commonly accepted procedures, such as the Mann-Kendall test, statistically significant decreasing trends in the annual NDI were revealed for the majority of gauging stations. The Theil-Sen (TS) slope mean values were -1.66 (ranging from -3.72 to -0.56), -1.41 (from -3.22 to -0.29), and -1.33 (from -2.85 to -0.29) for the datasets representing the periods 1992–2020, 1987–2020, and 1982–2020, respectively. The results for the annual NDI were additionally presented within the context of meteorological characteristics such as annual and winter (Nov-Apr) air temperature, precipitation, and water temperature. Correlation and regression analyses revealed that the main factor triggering the decrease in NDI is the increase in the average winter air temperature. An increase in temperature by 1°C results in a decrease in NDI by up to twenty days. If these negative trends continue, ice phenomena may disappear completely from southern Polish rivers within few decades.","author":"Krzysztof Kochanek","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"35a0f449bee1c399c3aa79d21bd099863fa51ddc810957e726b5bc52348e90a4","category":"Interdisciplinary"}