{"title":"Extracting the winter wheat using the decision tree based on time series dual-polarization SAR feature and NDVI","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302882","date":1715176800000,"content":"<p>by Huiyang Zhang, Zhiyong Wang, Zhenjin Li, Xiaotong Liu, Kai Wang, Shichang Sun, Silong Cheng, Zhenhai Gao</p>\r\n\r\nWinter wheat is one of the most important crops in the world. It is great significance to obtain the planting area of winter wheat timely and accurately for formulating agricultural policies. Due to the limited resolution of single SAR data and the susceptibility of single optical data to weather conditions, it is difficult to accurately obtain the planting area of winter wheat using only SAR or optical data. To solve the problem of low accuracy of winter wheat extraction only using optical or SAR images, a decision tree classification method combining time series SAR backscattering feature and NDVI (Normalized Difference Vegetation Index) was constructed in this paper. By synergy using of SAR and optical data can compensate for their respective shortcomings. First, winter wheat was distinguished from other vegetation by NDVI at the maturity stage, and then it was extracted by SAR backscattering feature. This approach facilitates the semi-automated extraction of winter wheat. Taking Yucheng City of Shandong Province as study area, 9 Sentinel-1 images and one Sentinel-2 image were taken as the data sources, and the spatial distribution of winter wheat in 2022 was obtained. The results indicate that the overall accuracy (OA) and kappa coefficient (Kappa) of the proposed method are 96.10% and 0.94, respectively. Compared with the supervised classification of multi-temporal composite pseudocolor image and single Sentinel-2 image using Support Vector Machine (SVM) classifier, the OA are improved by 10.69% and 5.66%, respectively. Compared with using only SAR feature for decision tree classification, the producer accuracy (PA) and user accuracy (UA) for extracting the winter wheat are improved by 3.08% and 8.25%, respectively. The method proposed in this paper is rapid and accurate, and provide a new technical method for extracting winter wheat.","author":"Huiyang Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"35a2273e8fd0dccc889efb71657445b67325e6396e85587e645e35cc785778c6","category":"Interdisciplinary"}