{"title":"Vingegaard and Van Aert celebrate ‘a perfect day’ for Team Jumbo-Visma","link":"https://cyclingtips.com/2021/07/vingegaard-and-van-aert-celebrate-a-perfect-day-for-team-jumbo-visma/","date":1626033309000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033301-170-650x433.jpg\" /></div><h2>Vingegaard and Van Aert celebrate ‘a perfect day’ for Team Jumbo-Visma</h2><p>\n</p><p>Team Jumbo-Visma enjoyed a perfect day on stage 15 of the Tour de France, with Sepp Kuss storming to <a href=\"https://cyclingtips.com/2021/07/sepp-kuss-wins-stage-15-of-the-tour-de-france/\">stage victory</a> in Andorra and Jonas Vingegaard up to third overall.</p>\n\n\n\n<p>“Sepp always sacrifices himself for the team, now it’s finally his turn,” said Wout van Aert, who was also active in the breakaway. “In that way – just like Wednesday with the stage over Mont Ventoux – it’s a perfect day for us.”</p>\n\n\n\n<p>With Steven Kruijswijk joining his teammates in the 32-man breakaway, Vingegaard was left with only classics specialist Mike Teunissen to support him in the peloton. The team’s perhaps unusual approach was a source of much confusion during the stage, but the ball was in their court the whole time.</p>\n\n\n\n<p>“We wanted to send several riders into the early break,” said Vingegaard, who is ‘looking after’ the white jersey of best young rider for race leader Tadej Pogačar. “That way my teammates could drop back if I really got into trouble. Today went really perfectly. Sepp won the stage and Wout van Aert and Steven Kruijswijk dropped off at the right time.”</p>\n\n\n\n<p>A rider better known for his prowess on flatter terrain, Teunissen lasted well into the Port d’Envalira, the highest mountain pass of the Tour, before handing over to Vingegaard. The 24-year-old Dane was later able to test his rivals on the Col de Beixalis, the final Cat 1 climb which had served as a launchpad for Kuss’s earlier attack.</p>\n\n\n\n<p>“I was never in trouble,” Vingegaard said. “This is a really great day for our team. I’m so happy for Sepp. He’s a really great guy. I know he lives in Andorra so it’s really great that he’s winning here.”</p>\n\n\n\n<p><a href=\"https://cyclingtips.com/2021/07/wout-van-aert-wins-stage-11-of-the-tour-de-france/\">Stage 11 winner</a> Van Aert was awarded the Prix de la Combativité after the stage having been one of the most active riders of the day. Not only had the Belgian champion climbed with the very best in the breakaway, but he was also able to guide Vingegaard on the descent of the Port d’Envalira and set a high pace into Andorra la Vella.</p>\n\n\n\n<p>“It was important that we had good communication because we also had Jonas [Vingegaard] in the group with the yellow jersey,” Van Aert explained. “If he needed support, someone had to go back to him.”</p>\n\n\n\n<p>Van Aert used the turn of pace honed in bunch sprints to his advantage at the top of each climb, racking up enough points to put him 10 away from the polkadot jersey of Wout Poels (Bahrain-Victorious). The chance to wear a classification leader’s jersey at the Tour de France is an enticing prospect, but Van Aert says he won’t put everything on the line for mountain points.</p>\n\n\n\n<p>“I accidentally ended up in a good position at the start, thanks to those double points on the Ventoux,” said Van Aert, whose phenomenal ride on stage 11 saw him earn 43 points. “But the problem is that there are also two stages with summit finishes, each with double points.</p>\n\n\n\n<p>“Even the men who move heaven and earth for that polka dot jersey can still lose everything. That’s kind of the weird system in the Tour. That is why I am not going to turn myself completely inside out for it.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033301-140-1340x893.jpg\" /><figcaption>Wout van Aert (Jumbo-Visma) in the breakaway on stage 15 of the Tour de France.</figcaption></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/07/vingegaard-and-van-aert-celebrate-a-perfect-day-for-team-jumbo-visma/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"35a3f095a75c365fce1b44221e764adc8f9c2aaa8f3ae3975381d3ab5edf5280","category":"Cycling"}