{"title":"Samsung's Studio Display Rival Launching in South Korea Next Week for Equivalent of $1,300","link":"https://www.macrumors.com/2023/06/26/samsung-viewfinity-s9-launching-in-korea/","date":1687814268000,"content":"Samsung today <a href=\"https://news.samsung.com/kr/%ec%82%bc%ec%84%b1%ec%a0%84%ec%9e%90-%ea%b7%b8%eb%9e%98%ed%94%bd-%eb%94%94%ec%9e%90%ec%9d%b8%ec%9a%a9-5k-%ec%b4%88%ea%b3%a0%ed%95%b4%ec%83%81%eb%8f%84-%eb%aa%a8%eb%8b%88%ed%84%b0-%eb%b7%b0%ed%94%bc\">announced</a> that its ViewFinity S9 external monitor is now available to pre-order in South Korea, and will launch in the country on July 3. The monitor is priced at 1.7 million won, which is equivalent to approximately $1,300 USD. Samsung has yet to reveal pricing or availability details for the U.S. market.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/01/samsung-viewfinity-s9.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nUnveiled <a href=\"https://www.macrumors.com/2023/01/02/ces-2023-samsung-monitors/\">at CES 2023</a> in January, the ViewFinity S9 has similar specs as Apple's Studio Display, including the same 27-inch size, 5K resolution, 60Hz refresh rate, 600 nits peak brightness, support for one billion colors, and support for 99% of the DCI-P3 color space. The monitor's metal stand and slim bezels also resemble the Studio Display.\r<br />\n\r<br />\nThe back of the ViewFinity S9 is equipped with a Thunderbolt 4 port that can provide up to 90W of pass-through charging to a computer, which is enough power to charge any MacBook. The monitor also has three USB-C ports and a Mini DisplayPort.\r<br />\n\r<br />\nIf the ViewFinity S9 ends up being priced around $1,300 in the U.S., that would be around $300 cheaper than the Studio Display, which starts at $1,599. However, the ViewFinity S9 offers a matte finish and a height-adjustable stand as standard features, whereas the Studio Display costs $2,299 when configured with these options, so the savings could potentially be up to $1,000. Samsung's monitor also comes with an attached 4K webcam that offers higher-resolution video than the Studio Display's built-in webcam.\r<br />\n\r<br />\n<div></div>\r<br />\nThe monitor has a \"Smart Calibration\" feature that allows it to be calibrated with the SmartThings app. Users can point a compatible iPhone or Galaxy smartphone's camera at the center of the ViewFinity S9 screen to calibrate the monitor.\r<br />\n\r<br />\nSamsung uploaded a <a href=\"https://www.youtube.com/watch?v=Jv6lwUSoEo0\">ViewFinity S9 introduction video</a> in English on its YouTube channel on Sunday, so U.S. availability may be around the corner. The monitor will provide much-needed competition to the Studio Display, as there are very few 27-inch 5K displays on the market that offer an ideal Retina-quality experience for macOS. The monitor also offers far better value for customers willing to look past the Apple logo.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/displays/\">Apple Pro Display XDR</a>, <a href=\"https://www.macrumors.com/roundup/studio-display/\">Apple Studio Display</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/samsung/\">Samsung</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/mac-accessories.77\">Mac Accessories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/26/samsung-viewfinity-s9-launching-in-korea/\">Samsung's Studio Display Rival Launching in South Korea Next Week for Equivalent of $1,300</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/samsungs-studio-display-rival-launching-in-south-korea-next-week-for-equivalent-of-1-300.2394259/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"35adaf27284a33418e2b494192f6a673d9a5b331e1e66782255fbe578121e77e","category":"Apple"}