{"title":"Combination of ethyl acetate fraction from <i>Calotropis gigantea</i> stem bark and sorafenib induces apoptosis in HepG2 cells","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300051","date":1711375200000,"content":"<p>by Pattaraporn Chaisupasakul, Dumrongsak Pekthong, Apirath Wangteeraprasert, Worasak Kaewkong, Julintorn Somran, Naphat Kaewpaeng, Supawadee Parhira, Piyarat Srisawang</p>\r\n\r\nThe cytotoxicity of the ethyl acetate fraction of the <i>Calotropis gigantea</i> (L.) Dryand. (<i>C</i>. <i>gigantea</i>) stem bark extract (CGEtOAc) has been demonstrated in many types of cancers. This study examined the improved cancer therapeutic activity of sorafenib when combined with CGEtOAc in HepG2 cells. The cell viability and cell migration assays were applied in HepG2 cells treated with varying concentrations of CGEtOAc, sorafenib, and their combination. Flow cytometry was used to determine apoptosis, which corresponded with a decline in mitochondrial membrane potential and activation of DNA fragmentation. Reactive oxygen species (ROS) levels were assessed in combination with the expression of the phosphatidylinositol-3-kinase (PI3K)/ protein kinase B (Akt)/ mammalian target of rapamycin (mTOR) pathway, which was suggested for association with ROS-induced apoptosis. Combining CGEtOAc at 400 μg/mL with sorafenib at 4 μM, which were their respective half-IC<sub>50</sub> concentrations, significantly inhibited HepG2 viability upon 24 h of exposure in comparison with the vehicle and each single treatment. Consequently, CGEtOAc when combined with sorafenib significantly diminished HepG2 migration and induced apoptosis through a mitochondrial-correlation mechanism. ROS production was speculated to be the primary mechanism of stimulating apoptosis in HepG2 cells after exposure to a combination of CGEtOAc and sorafenib, in association with PI3K/Akt/mTOR pathway suppression. Our results present valuable knowledge to support the development of anticancer regimens derived from the CGEtOAc with the chemotherapeutic agent sorafenib, both of which were administered at half-IC<sub>50</sub>, which may minimize the toxic implications of cancer treatments while improving the therapeutic effectiveness toward future medical applications.","author":"Pattaraporn Chaisupasakul","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"35af99c4b96c0974c2488dccdbe04806525dfd4fbba3cca2ce70fb43eb39f532","category":"Interdisciplinary"}