{"title":"Drought Propagation and Recovery Behaviors Across 407 Australian Catchments","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004190?af=R","date":1713362047000,"content":"<h2>Abstract</h2>\n<p>A reliable understanding of linkages between meteorological, hydrological and agricultural droughts (MD, HD, and AD respectively) is crucial to building resilience and planning for future climate changes. Despite Australia being prone to severe droughts, lagtimes of propagation (and recovery), from meteorological to hydrological and agricultural droughts across its large hydroclimatic regions, are poorly understood. Therefore, we investigate the characteristics of drought propagation and recovery time lags for droughts of four timescales and a combination of drought onset and cessation criteria in 407 unregulated catchments within six major precipitation zones across the country. We find that the propagation and recovery lags depend on climatic conditions, drought criteria and timescales. The median of catchment average propagation times from MD to HD across Australia varied from 0.8 to 1.7 months for 1-month timescales, increasing to 2.2–5.0 months for 12-month timescales. The corresponding recovery lagtimes were 1.3–3.7 and 1.7–7.0 months respectively. Similarly, the median of catchment average propagation times from MD to AD ranged from 0.8 to 1.9 months for 1-month timescales, increasing to 0.6–5.0 months for 12-month. The corresponding recovery lagtimes were 0.7–2.8 and 0.3–8.7 months respectively. For droughts of smaller timescales, propagation and recovery lags are linearly correlated with recovery lagtimes consistently greater than propagation times. However, as the timescale increases, these relationships weaken suggesting effects of other catchment attributes (e.g., groundwater contributions) on lag relationships.</p>","author":"Santosh K. Aryal, \nHongxing Zheng, \nYongqiang Zhang, \nM. A. Faiz","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"35bac2a264a436a095c890a84b21e5c0c8172477601b5c09c0c970c36352cc34","category":"Environment"}