{"title":"Menstrual gains: Drops-Le Col p/b Tempur's rider wellness programme","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/menstrual-gains-drops-le-col-p-b-tempurs-rider-wellness-programme","date":1620998480000,"content":"\n      <p><span>Within elite sport, athletes can too often be viewed as disposable and transient assets during their careers with very little thought f</span>or their long-term health — from themselves or their teams and coaches. In women’s cycling, the work to ensure that female athletes’ rights are protected is being done by groups such as The Cyclists’ Alliance, and while many teams are now understanding the value in a holistic approach to rider wellbeing, it is still rare to see, particularly at the Continental level. </p>\n<p><span>All of that makes Drops-Le Col s/b Tempur’s newly-introduced rider wellness programme an even more impressive feat as a Continental squad. Particularly given that, within it, the team have chosen to focus on a facet of wellbeing that is too often overlooked: the menstrual cycle. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/nikki-brammeier-on-reds\">Related – \"Power to weight matters, but not at the cost of our health\": Nikki Brammeier on RED-s</a></strong></em></p>\n<p><span>The team’s programme covers myriad aspects of overall health and wellbeing, from sleep to mental health and even blood profiling. The approach is athlete-first and subscribes to the adage that happy riders are fast ones. “This is something that I've thought about for a couple of years,” says manager Tom Varney. “We probably should have done it a bit sooner. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/RhodePhoto_RondeVanVlaanderen_2021-08685_1024x1024.jpg?v=1620746667\" /></div>\n<p><em><span>Photo credit: Rhode Photo.</span></em></p>\n<p><span>“We're looking at how we can tailor training around certain phases of the cycle,” he explains. “Where they might be lacking in one week from where they're not the other week. This also links to the mental health side of things as well, they might do one training session on one Tuesday and feel great. And then the next week, they do the same session and not feel so great. So we're looking at trying to minimise the symptoms and really empower the riders to understand their own cycles and their own completely natural physiology.”</span></p>\n<p><span>Of course, the concept of measuring the minutiae of a rider’s day-to-day life and channelling it into performance is not a new one within the sport. Women’s teams, however, with smaller budgets and less formulaic racing have only just started to buy in (team buses are still a relatively new addition). Tracking the menstrual cycle, though, is about far more than just wringing out as much in the way of performance as possible — it’s a measure of a rider’s overall health. </span></p>\n<p><span>The UCI does not require Continental teams to employ a team doctor, but Drops-Le Col s/b Tempur have enlisted the expertise of Dr. Claire Rose, who is also a retired rider. “One of the things that we're seeing repeatedly in the media, not just in cycling, but across a lot of sports is something called RED-s or ‘Relative Energy Deficiency Syndrome'.” says Dr. Rose. “If you don't fuel properly, that can then lead to the loss of your menstrual cycle.” </span></p>\n<p><span>In the short-term, this might not seem like a problem to a rider or their team, but it can lead to “a whole host of other long term problems\",</span><span> </span>says Rose. </p>\n<p><span>“</span>Problems with fertility, problems with poor bone density. As a cyclist, you're more likely to crash and actually break something, in runners you see stress fractures. And alongside that, poor mental health and other long-term problems.” </p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/RhodePhoto_GentWevelgem_2021-02411_1024x1024.jpg?v=1620746713\" /></div>\n\n<p><span><em>Photo credit: Rhode Photo</em></span></p>\n<h4><strong>Bridging the gap</strong></h4>\n<p><span>As the manager of a women’s team and new father to a daughter, Varney has made the effort to educate himself on the subject. “I just want to normalise talking about periods, they're completely normal things,” he says. “I personally want to learn. I want the best for the riders and we want them to be as healthy as possible.”</span></p>\n<p><span>In order to work with riders to both monitor and harness their menstrual cycles in their racing careers, Drops-Le Col s/b Tempur have teamed up with bio-analytics company, Orreco. The company has worked closely with a number of elite athletes — including Chelsea Women’s Football team — to tailor their training to their menstrual cycle using their FitrWoman and FitrCoach apps which have been developed as part of Orreco’s Female Athlete Program. </span></p>\n<p><span>Sports scientist Esther Goldsmith, who works with the programme, explained the function of the apps: “A lot of our education sessions will go into educating the athletes themselves, but also their support staff, so that they can work together, and that's where FitrCoach and FitrWoman come in,” she explains. </span></p>\n<p><span>The athletes download FitrWoman — a free and widely-available app developed by Orreco. “They log their specific symptoms and menstrual cycle data, and that feeds into FitrCoach,” says Goldsmith. “The coaches get a code that the athletes then put into their FitrWoman app, and the coaches can then see the data of all of their athletes so they could work out where each athlete is in their own individual cycle.” </span></p>\n<p><span>Varney has already started to integrate the data into the team’s approach to the season, “We can see which phase the riders are in and advise them on their training, or particularly around their race schedule.”</span></p>\n<p><span>He cites an example where a rider approached him and expressed that they would be on their period during a race and would therefore not be able to do well. For Varney, though, there was no question of dampening her ambitions.</span></p>\n<p><span> “How can we make it easier?\" Varney asks. \"Or how can we still have her race and do well and do her job in the race while being on her period? Her period shouldn't stop her competing, it shouldn't stop her doing what she wants to do and what we would like her to do.”</span></p>\n<p><span>All of this harnessing of personal data might sound dystopian, or like an invasion of privacy, but many of the riders are already using this technology. “It's interesting talking to the girls,” says Rose. “A lot of them already have apps to track their periods, they track a lot of this kind of data already. I guess it's just being able to help them actually use it.” </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/RhodePhoto_RondeVanVlaanderen_2021-8582_1024x1024.jpg?v=1620746745\" /></div>\n<p><span><em>Photo credit: Rhode Photo.</em></span></p>\n<p><span>That’s where Orreco comes in with their insights from years of developing the app, although — as with many areas of women’s health —  research in the field is still decidedly lacking. “Sometimes scientifically it's a frustrating area to work in, because the research isn't quite there in all aspects,” says Goldsmith. “And whilst the research is increasing and improving, a lot of what we do has to be inferred from other areas of research. Our work with Chelsea [footbal team] has really enabled us to see exactly what does work, and also to experience what female athletes respond to.” </span></p>\n<p><span>Rose is equally frustrated by the gender data gap, “There's still a lot of this that we just don't have huge amounts of data on as a whole in terms of the sports industry and medical industry. And a lot of it is very individual and has to be personalised as well,” she says. </span></p>\n<p><span>Although Orreco has a wealth of data from working with male athletes through the years, Goldsmith affirms that FitrWoman has been developed exclusively by and for women. \"Our bread and butter is you can't just apply everything that you've done with men to females,” she says.  </span></p>\n<p><span>Aside from tracking the menstrual cycle, the </span><span>FitrCoach and FitrWoman</span> apps provide guidance and education around what type of training might be better suited to different parts of the cycle, as well as suggestions around nutrition. In a sport that is mired in an obsession with weight, nutrition and energy intake, these are vital metrics to track in the quest for healthier riders.  </p>\n<p><span>“I think there is an unhealthy obsession with 'the only way to get quicker is by losing weight.' I think that is a mindset just in cycling in general — whether it's male or female cycling — that needs to change,” says Varney. </span></p>\n<h4><strong>Monitoring RED-s</strong></h4>\n<p><span>Through the apps, a coach or team can be made aware of one of the major RED-s symptoms, loss of a period, (although it is dependent on an athlete being honest about their cycle). “One of the features that we've found coaches have really responded well to in terms of FitrCoach is that it flags when an athlete hasn't logged a period when they should have done, which obviously is a sign of RED-s and energy deficiency,” says Goldsmith. “So hopefully, the coaches can address that as soon as any potential issues arise. Historically there has been this belief that if you train hard, then it's okay not to have a period and we totally want to change that.”</span></p>\n<p><span>Knowing the signs of RED-s and being able to address the condition are very different matters, however. When Rose has seen riders <span>outside of the team </span>who have lost their period due to RED-s, “The biggest thing that I've found, and probably the biggest barrier in it all, is that they then don't have the knowledge to know what to do about it if they're not menstruating, or they've had periods and now they're not having  periods.” says Rose. “Nutrition and nutritional input has been a big one and that's where hopefully through Orreco we get some really good education around that.”</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\"><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Sponsored_newsletter_LeCol_wmns_1024x1024.jpg?v=1620991063\" /></span></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\"><em><strong>Sign up to our women's newsletter</strong></em></a></p>\n<p><span>The Fitr team have had direct experience of working with a female mountain biker suffering from RED-s. “She's come on leaps and bounds and regained her menstrual cycle and that's been really great to see and experience,” says Goldsmith. “So it can be done, but it's not always addressed. </span></p>\n<p><span>\"So hopefully, Drops-Le Col are paving the way for other female cycling teams or female cyclists to prove that it can be done. It's really great that they're taking that initiative and as an all-female cycling team it's really progressive of them and it's great to work with them.”</span></p>\n<p><span>Varney and Rose were keen to stress that the overall aim is to protect the riders’ health above and beyond their cycling careers. “Ultimately, if we were ever worried about a rider putting their immediate or long term health at risk that would be an immediate conversation with Tom and Bob to stop them from doing that, and making sure that they were medically and appropriately managed,” says Rose.  “Thankfully, we haven't been in that position, which is reassuring.”</span></p>\n<p><span>Improved performance is still a goal for the riders and the team, however they are realistic about the speed with which they might see results. “A lot of the benefits will come — we're hoping — after three or six months, so towards the middle or the end of summer, and we're still improving the way we're doing it,” says Varney. </span></p>\n<p><span>“Ultimately, all of that leads to improved performance. And I think that's a big thing,” adds Rose. “For me, a lot of this is about the long term gains that we can make, and a lot of it is around education. So really educating riders about just making sure that health is one of their priorities through being an athlete, and that they don't have to sacrifice their health to be an elite athlete.”</span></p>\n<p><span>The success of this programme might come through wins or podiums, but above all else it will be measured by whether Drops-Le Col s/b Tempur have a team of happy and healthy riders who are protecting their physical and mental health while competing at the highest level. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"35bdc9d9c8a6bc347ba40c4d7d59e2927acade8b23dee62d16c32c05b3c85c91","category":"Cycling"}