{"title":"Joss Lowden has the Hour, but how long for?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/hype-for-the-hour","date":1633618438000,"content":"\n      <p><span>When Rouleur spoke to Joss Lowden before her record attempt she was recovering from the World Championships — where she placed eighth in the time trial —  and trying to relax before the event. The 33-year-old was feeling nervous and disclosed that she was also affected by the unexpected arrival of her period. “Of course I'm tired and I can feel the effects of a whole week of World Championship racing. But hopefully I've got the form that will see me through Thursday,” she said at the time. </span></p>\n<div></div>\n<p><span>As it transpired, her reservations about her ability to pull it off were not necessary and, after a weekend of World Championships racing and before racing the 6-day Women’s Tour, the Drops-Le Col rider claimed the new Hour Record by 400m with a distance of 48.405km.</span></p>\n<p><span>“I’m relieved,” she said afterwards. “I think I’d made it a bit dramatic really, worrying and getting nervous with a lot of self-doubt, and actually it wasn’t that bad. I knew the record split I could do comfortably, it was just trusting in that.” In fact, Lowden managed to shave time off her lap splits towards the end of the attempt, going from 18.7 seconds to 18. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/desire-journal/le-col-x-mclaren-project-aero-how-much-difference-does-aero-cycling-clothing-make\">Related: Le Col x McLaren Project Aero – how much difference does aero clothing make?</a></em></strong></p>\n<p><span>“Maybe I’ll look back and say I should have tried harder, but looking back at the preparations, riding the World Championships and the fact there’s the Women’s Tour next week, I rode it the way I wanted to ride it and I can’t be unhappy with how it went,” she said afterwards. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Joss_Lowden_Hour_Record-7_1024x1024.jpg?v=1633615646\" /></span></p>\n<p><span>Lowden benefitted from the support of her team and sponsors like <a href=\"https://lecol.cc/products/womens-le-col-x-mclaren-project-aero-long-sleeve-front-zip-skinsuit?variant=39326664130623&amp;_kx=\">Le Col</a>, as well as her aerodynamicist partner, “Absolutely every element of my bike, the equipment I'm riding, the skinsuit from Le Col, everything has been really, really thought out,” she said the week of the attempt. </span></p>\n<p><span>For Lowden, the physiological challenge and the science behind the record were as compelling as the possibility of the title itself. “Because it's not something that you do very often, a full gas hour effort. What does that actually achieve? What's actually happening inside your body with something like that? So it's interesting,” she said. “I just think it's quite a cool challenge to do both on the aero equipment side, and we've partly done it because physiologically it's such a weird sort of effort. It's just really interesting.” </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/menstrual-gains-drops-le-col-p-b-tempurs-rider-wellness-programme\">Related: Menstrual gains – Drops Le Col p/b Tempur's rider wellness programme</a></em></strong></p>\n<p><span>Lowden’s motive for attempting the record was not an entirely intrinsic endeavour. In June, she told Rouleur:  “One of the reasons why I'm doing it is because I think it's really good for women's sport to do something that is so big on the men's side, but doesn't have a big track record of women attempting it. I hope that by me doing it, it will just rally up some interest and get other women doing it.” <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Joss_Lowden_Hour_Record-4_1024x1024.jpg?v=1633615670\" /></span></p>\n<p><span>Lowden was just the eighth female rider to attempt the record — since a 2014 UCI rule change regarding the type of bikes that can be used — compared with 23 men. “I can understand why,” she said in the same conversation. “Because I think there are barriers to actually being able to get on and do it. I don't know why there's just not been that crossover,” she said. “I think there's loads of really incredible riders out there that can do it really well.”</span></p>\n<p><span>After the extensive preparation and effort that went into the record, Lowden will no doubt hope to retain it for a while at least, but she is hoping for the record to gain traction on the women’s side.  </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/womens-2021-world-championship-time-trial-debrief\">Related: Women's World Time Trial Championships 2021 Debrief </a></em></strong></p>\n<p><span>Like most things in the sport, the disparity is down to funding and resources. “It's expensive, which is why I want there to be something positive that comes out of it for the sport, or for women's cycling,” Lowden said. “Because the the amount of effort and cash involved in putting something like that on, I mean, I would like to be going to Mexico to Aguascalientes or to go to Cochabamba in Bolivia to go and do it and do it at altitude because when you run the numbers, the difference in how far you can go is really quite huge. And so I would like to be doing that. But it's just not feasible at the moment. I mean, partly because of Covid and travel and cost and logistics also.” </span></p>\n<p><span>With the publicity of her attempt and a number of emerging time trial talents in the women’s peloton, it seems only a matter of time before she has a pretender. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"35c2b3d0b28aefd3120d7abc82279ab76551847d297e8e948efcd8fa693c19e0","category":"Cycling"}