{"title":"Federighi blasts iPhone sideloading as a ‘gold rush for the malware industry’","link":"https://www.macworld.com/article/549882/federighi-apple-iphone-sideloading-web-summit.html","date":1636037035000,"content":"<div>\n<section><div></div></section><p>It’s no secret that Apple isn’t a fan of sideloading. Amid several regulatory battles over Apple’s locked-down App Store-centric system, the company has defended the iPhone’s security as an advantage rather than a detriment.</p>\n\n\n\n<p>At Web Summit 2021 in Lisbon, Portugal on Wednesday, Apple VP of software engineering Craig Federighi used his time to defend the iPhone against sideloading. Framing around a defense against the proposed <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://ec.europa.eu/info/strategy/priorities-2019-2024/europe-fit-digital-age/digital-markets-act-ensuring-fair-and-open-digital-markets_en&amp;xcust=1-1-549882-1-0-0&amp;sref=https://www.macworld.com/feed\">Digital Markets Act legislation</a>, which would give developers “new opportunities to compete and innovate in the online platform environment without having to comply with unfair terms and conditions limiting their development,” a.k.a. force Apple to allow sideloading.</p>\n\n\n\n<figure><div>\n\n</div></figure><p>Federighi started his talk by defending the iPhone’s security. While he admitted that there’s “no such thing as a perfect security system,” he quickly blasted sideloading as “the single biggest reason” why other platforms have more malware. In a nutshell, he said, “Sideloading undermines security and puts data at risk.”</p>\n\n\n\n<p>He described the iPhone’s closed system as a “consumer choice of a more secure platform,” and painted a grim view of a world where the sideloading is allowed on the iPhone:</p>\n\n\n\n<blockquote><p>“In this world, some of your neighbors are suffering repeated break-ins but your home has kept you safe. But then … your town requires you to build an always unlocked side door on the ground floor….It would open up a pandora’s box of unreviewed, malware-ridden software.”</p></blockquote>\n\n\n\n<p>Federighi also defended Apple’s stance against people who suggest sideloading is a choice. “Even if you have no intention of sideloading, people are routinely coerced or tricked into doing it,” he said. “Even if you never sideload, your iPhone and data are less safe in a world where Apple is forced to allow it.”</p>\n\n\n\n<p>He praised the DMA and European regulation as a whole, but had no nice words to say about the effort to force Apple to allow non-App Store apps on the iPhone: “Sideloading is a cybercriminal’s best friend, and requiring it on the iPhone would be a gold rush for the malware industry.”</p>\n\n\n\n<p>However, Federighi didn’t address the Mac in the 10-minute presentation, despite Apple having always allowed sideloading and implementing numerous safeguards to protect against malware.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"35c9774e690fdef922ee2e74826e3048596661ecaf6c6c474bced757c5502503","category":"Apple"}