{"title":"An Approach to Assessing the Impact of Hurricane Matthew on Meiofaunal Communities in Sandy Beach Environments","link":"https://onlinelibrary.wiley.com/doi/10.1111/maec.12831?af=R","date":1723458308000,"content":"<h2>ABSTRACT</h2>\n<p>Hurricanes are natural periodic events that disrupt marine ecosystems along their path, altering the distribution and abundance of organisms. In October 2016, Hurricane Matthew struck the Santa Marta region (Colombia) and impacted its coastal zone, yet there have been insufficient studies to measure its effects. The aim of this study was to assess the impact of Hurricane Matthew on the meiofaunal community in the region. To achieve this, sediment samples were collected from the intertidal zone of three beaches 5 days after the hurricane had passed. The results were compared with previous data collected in October 2014, on the abundance and diversity of taxonomic groups of intertidal meiofauna, as well as physicochemical variables such as granulometry, organic matter in sediments, salinity, and water temperature. Following Hurricane Matthew, the physicochemical variables showed changes due to the effect of the cyclonic surge in the coastal zone. The average organism abundance not only experienced a decline in both abundance and richness but also underwent changes in composition. Nematoda, originally the fourth most abundant group in 2014, became the most dominant taxon post-hurricane. Conversely, the relative abundance of Copepoda decreased. The total number of recorded taxa was 13, which is close to the 15 previously reported. The ANOSIM and PERMANOVA tests confirmed differences in the meiofaunal community before and after Hurricane Matthew, with Tardigrada, Cnidaria, Ostracoda and Mollusca, being the main groups that contributed the most to the dissimilarity between periods. The environmental variables of organic matter and temperature best explained the structure of the meiofaunal community after the natural phenomenon. This study highlights the importance of meiofauna as a monitoring tool for beaches and the effects of environmental disturbances such as hurricanes, which are expected to become more common in coastal areas due to climate change.</p>","author":"Daniel Giraldo, \nAna Milena Lagos, \nSigmer Y. Quiroga, \nM. Victoria Leon, \nAngie Colorado","siteTitle":"Wiley: Marine Ecology: Table of Contents","siteHash":"9aeeb02fb4d0869ca2d9b47a9c219a8693576fd84433bf6b8b40db990539dbf7","entryHash":"35cd4f2f3ec529f56785d5063a7cd033d6cdcb90a3c4648f7f983b003976be6a","category":"Environment"}