{"title":"Challenges, Economics, and Sustainability of Sheep and Goat Farming in Drylands","link":"https://www.preprints.org/manuscript/202403.1478/v1","date":1711361971000,"content":"This study finds that in northern Jordan, breeder indicators present challenges to the sustainability and growth of sheep and goat farming, while economic indicators suggest a combination of financial stability alongside hurdles related to profitability and resource ownership. Breeder age plays a role in the management of livestock herds, due to factors such as experience, resources, or adherence to traditional practices. Experience significantly affects breeders' decisions on male insemination replacements, likely due to skill. Crop cultivation influences breeders' returns by reducing feeding costs, while strategic lamb sales management boosts individual animal profitability. Winter raises animal mortality due to cold stress. Other animals in herds increase kid mortality by spreading diseases. Breeder experience significantly affects lamb survival, stressing its role in care. Increasing sheep proportion enhances lamb production and reduces lamb mortality while managing rams and selling lambs positively affects herd health and productivity. A larger goat herd proportion positively correlates with kids sold but inversely with breeding males and overall kids, implying trade-offs affecting herd productivity and mortality rates. Sheep herds (92.5%) show slightly better reproductive success than goats (90.6%), implying superior long-term viability. Flock excels in birth, survival, and sales, but low sheep and lamb%. Improvement is needed for sustainability, and the potential is high. Goat breeding shines in birth, sales, and overall success, but needs attention to kid survival and other sustainability issues. In conclusion, despite challenges, there are promising opportunities to enhance sheep and goat farming in Jordan. Effective management, informed by breeders' experience and economics, is crucial. Empowering small-scale herders and implementing targeted interventions like winter mortality solutions and selective breeding is vital for sustainable growth.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"35cedef79513cce8e34eb44bc041e874813a0ee4062cd66652663adc547b41d1","category":"Interdisciplinary"}