{"title":"How useful should our Apple devices be when we’re not using them?","link":"https://www.macworld.com/article/1977489/apple-devices-useful-when-not-using-them.html","date":1688985000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Welcome to our weekly Apple Breakfast column, which includes all the Apple news you missed last week in a handy bite-sized roundup. We call it Apple Breakfast because we think it goes great with a Monday morning cup of coffee or tea, but it’s cool if you want to give it a read during lunch or dinner hours too.</p>\n\n\n\n<h2>The fine line between informed and overwhelmed</h2>\n\n\n\n<p>Seasoned Cupertino watchers have noticed an unexpected strategy over the past few years: Apple has been trying to persuade us to use its devices <em>less</em>. </p>\n\n\n\n<p>Admittedly, the original Do Not Disturb mode was added to iOS as long ago as 2012, but in recent years it’s been expanded into an entire suite of Focus modes. Covering Driving, Sleep, Work, and Fitness, with the potential to add more of your own, these offer users the ability to focus on a single activity and instruct the iPhone to refrain from interrupting that activity with the Morse Code staccato of notifications that punctuate the rest of our lives. Screen Time, meanwhile, allows us to monitor our device use and set limits on content and app usage in order to bring this down, or make it more conducive to our mental health.</p>\n\n\n\n<p>It’s a counterintuitive strategy, but makes a sort of sense when you reflect on Apple’s reliance on our goodwill. A healthy and happy customer is more likely to associate their device with positive feelings, and consequently more likely to buy another one in the future. And the deluge of digital interruptions that is so much a part of smartphone ownership in 2023 really isn’t good either for our ability to get work done (or to sleep well, or to drive safely, and so on) or to keep on an even emotional keel. </p>\n\n\n\n<p>Of course, the company wouldn’t be happy if we bought its products and then put them away in a drawer; it is now a services company as well as a hardware seller and needs us to be spending money in the App Store, watching TV+ shows, and taking part in Fitness+ workouts. But there’s a balance to be struck, and Apple’s business model is not dependent on its customers staying up all night doom-scrolling through Twitter or chasing the dopamine hit of Facebook engagement.</p>\n\n\n\n<p>This does of course raise the question of what we should be doing with our Apple products when studiously refusing to engage with them, and the Apple Watch offers a glimpse of one possible future. The <a href=\"https://www.macworld.com/article/1942507/watchos-10-features-interface-smart-stack-apps-health-fitness.html\">watchOS 10 update</a> announced this summer is a change of direction for the device, reflecting a fundamental shift away from apps and towards widgets and bite-sized information. Because smartwatches are always with you but have small screens, they are the perfect use case for a device that informs without trying to engage. It makes sense for them to offer little snippets of information that can be accessed at a glance, without trying to hook you into significant interaction.</p>\n\n\n\n<p>Would it be so very radical to suggest that this is a sound principle for the way we interact with <em>all</em> digital devices? The precise balance between information and engagement will vary according to format, but there are limits to healthy engagement with even something as large-screened as a Mac. Naturally, we interact with the Mac for long periods, but when the working day is over, we want it to leave us alone. At which point it seems ideal for the previously high-engagement product to switch roles and become a purveyor of informational snippets–something that Apple appears to be exploring at the moment. In certain contexts, a Mac in the traditional sense is no longer required, and its owner would get more value from a smart display showing widgets, photo slideshows, and smart-home controls.</p>\n\n\n\n<p>It’s hard to say whether this vision of a healthy and balanced tech future will ever come to pass. Apple might not need us to be hyper-engaged with our devices in order to be good customers, but there are plenty of other companies that do, and it seems unlikely that app makers and advertisers, and social networks will be satisfied with our attention for just eight hours a day. But it’s a fight worth waging, and I hope Apple continues to lead the way.</p>\n\n\n\n<h2>Have your say</h2>\n\n\n\n<p>Lots of interesting responses to my complaints about <a href=\"https://www.macworld.com/article/1967034/apple-vision-pro-strap-upsell.html\">Apple’s upselling</a> in the last column: thanks to all who emailed me their thoughts.</p>\n\n\n\n<p>Longtime reader Michael Long felt that Apple was being unfairly maligned for behavior that is commonplace elsewhere. “As near as I can tell,” he pointed out, “Apple is only now doing what every other phone manufacturer already did: Produce a flagship phone with the latest and greatest processor, and introduce a second-tier, less expensive phone using last year’s processor. Google Pixel and Samsung and others do this regularly.”</p>\n\n\n\n<p>Kurt R. Todoroff, meanwhile, cited Apple’s iCloud pricing strategy–offering just 5GB per customer for free–as evidence of its short-sightedness and greed. “We, the old loyal ones, are the foundation for Apple’s rebirth, and for that enviable profit,” he wrote. “The granite of our loyalty contains severely growing cracks, as we experience increasing software defects with each new operating system release, and as Apple continues its ancient, self-defeating (self-destructive?) ‘premium pricing’ paradigm.”</p>\n\n\n\n<p>John Leibovitz felt that the company’s storage pricing was outrageous, asking $400 for a 1TB spec bump that could be sourced elsewhere for $50 if only home upgrading was allowed. “What seems to be happening is that Apple is ‘hanging on’ to older component specs for longer,” he argued. “How many years has 256GB been the minimum Mac mini spec?”</p>\n\n\n\n<p>But Humberto Munoz, finally, was more sanguine about the situation. “The end for any company is to sell more stuff and grow profits,” he wrote. “The fact that you, I and the rest don’t <em>like</em> to spend more money to buy Apple’s stuff doesn’t change the fact that we keep doing it.”</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3811721/apple_breakfast_logo.jpg?quality=50&amp;strip=all\" alt=\"Apple Breakfast logo\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>Reviews corner</h2>\n\n\n\n<ul>\n<li><a href=\"https://www.macworld.com/article/1981024/photoshop-generative-fill-ai-hands-on-limitations-results.html\">Photoshop’s Generative Fill AI</a> tested on a Mac: Equal parts amazing and unreal.</li>\n\n\n\n<li><a href=\"https://www.macworld.com/article/1978555/sonnet-echo-20-thunderbolt-4-superdock-review.html\">Sonnet Echo 20 Thunderbolt 4 SuperDock review</a>: An abundance of ports to connect devices at top speed.</li>\n</ul>\n\n\n\n<h2>Trending: Top stories</h2>\n\n\n\n<p>Jason Snell reveals <a href=\"https://www.macworld.com/article/1978828/5-vision-pro-features-apple-doesnt-want-to-talk-about.html\">5 Vision Pro features</a> Apple <strong>doesn’t want to talk about</strong>.</p>\n\n\n\n<p>And here are <a href=\"https://www.macworld.com/article/1923515/apple-watch-hidden-features-photos-unlock-games-messages-battery.html\">10 things you didn’t know you could do</a> with an <strong>Apple Watch</strong>.</p>\n\n\n\n<p>Got a <strong>Meta Quest Pro</strong>? You can <a href=\"https://www.macworld.com/article/1983173/got-a-quest-pro-you-can-try-out-the-apple-vision-pro-ui.html\">try out the Apple Vision Pro UI</a>.</p>\n\n\n\n<p>Apple’s <strong>$3 trillion market cap</strong> is nice and all, but <a href=\"https://www.macworld.com/article/1978814/aapl-3-trillion-dollars-apple-pay-goldman-sacks.html\">does it really matter</a>?</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1968238/the-iphone-15-is-almost-here-heres-why-you-should-spring-for-a-pro-model.html\">Jason Cross explains</a> why you should spring for an <strong>iPhone 15 Pro</strong> this year.</p>\n\n\n\n<p>Apple is taking its <strong>Fortnite fight</strong> all the way <a href=\"https://www.macworld.com/article/1980758/apple-epic-games-antitrust-appeal-supreme-court.html\">to the Supreme Court</a>.</p>\n\n\n\n<h2>The rumor mill</h2>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/1980005/iphone-15-plus-pro-max-battery-capacity-rumor.html\">iPhone 15’s best feature</a> might be <strong>how long it lasts</strong>.</p>\n\n\n\n<p>The Apple Watch Ultra’s <strong>next-gen microLED screen</strong> <a href=\"https://www.macworld.com/article/1982361/microled-apple-watch-ultra-manufacturing-problems.html\">might not launch until 2026</a>.</p>\n\n\n\n<p>The <strong>next generation of AirPods</strong> will focus on <a href=\"https://www.macworld.com/article/1978329/new-airpods-details-major-leak.html\">high-end health and hearing features</a>.</p>\n\n\n\n<h2>Software updates, bugs, and problems</h2>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/1981167/firefox-115-update-macos-mojave-high-sierra-sierra-support-esr.html\">latest Firefox update</a> drops support for several <strong>recent macOS versions</strong>.</p>\n\n\n\n<p>Last year’s <strong>13-inch MacBook Air</strong> now <a href=\"https://www.macworld.com/article/1979234/13-inch-macbook-air-now-supports-bluetooth-5-3.html\">supports Bluetooth 5.3</a>, Apple says.</p>\n\n\n\n<p>You should watch out for <strong>unexpected NFC Tag alerts</strong> on your iPhone. <a href=\"https://www.macworld.com/article/1942788/unexpected-nfc-tag-alerts-iphone.html\">Here’s why.</a></p>\n\n\n\n<p>And with that, we’re done for this week’s Apple Breakfast. If you’d like to get regular roundups, sign up for <a href=\"https://www.macworld.com/newsletters/signup\">our newsletters</a>. You can also follow us <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/macworld&amp;xcust=1-1-1977489-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">on Twitter</a> or <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.facebook.com/Macworld/&amp;xcust=1-1-1977489-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">on Facebook</a> for discussion of breaking Apple news stories. See you next Monday, and stay Appley.<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://jadserve.postrelease.com/trk?ntv_at=390&amp;ntv_ui=3fcb594a-c1bb-4130-ad33-b4c3bc89a5f9&amp;ntv_a=ziUIAAW9bAMGoRA&amp;ntv_fl=uLwwHH-3iMjp33A8JDFpToF4fcvUdW4kl5HhKUmyMfD5uf-kpjsAJcZW_lfkOZigEFy174IOWQioZUNkMvN5MhkmkEEq6vr4MEgo93aYl8tKBqprmwslSyV9bY9t0KxDOuqpBb9FFnV5GkhAJDDdB3EXF2DoP3obEVgq0x1Z8ckP0_yCabDhSsr_9f3-zoIFUWFWmTfiBE6GzyueWhjM1Dy9glNPSKyhdkIYFNHCBDAkn0YU9GwFyqcsGWgSD9De7IQfADxW99iAN-tQfguSyey0LxKC14qT7QotFoVLA7JMJMsZl862UoMPm7hffCjaA4gbw6I5aEKgbL34OJcc2i6xgYV3cbGVVw-xUFYsBDp31sYgLIWSAp8cuEBF1KVzecIanuMGCgkhvAzy-65ibAvr9Iv1qBaotIftBiXxtx4vtnJkqRqRq2_iYw8clEgVuDbWEbleSPPOV9gzoTMKct3IfTwRcLi25jiukDMTkX0WwflUsWfmw-WWgql1qmmpat1GPFErgw5g-7uTxp_D9fZo2NLcRMEQVojW0hG-pCjgDqdCpBUnNh7cvUZwP5344OBQ5jqbMnyRIq82MyKNOqbV7SSy6OXHagJiqVutHgsFQaCdBEa3sl6uFzURdb2uxiRkB9drkjeyvWnpMlVlHS63DcUYNr-hTtaJQLz3OK5JnUksmtYX9tKsZKw6zCeS0jyM8bQWKG833yN5XVtep1XXVnQ-OkZ6l6u9KyIm0WqoR3jy29n3Ay_JcMdkanK16CQW1uRD_hs5KdCRoytNtnmxPGCrO-JwKUhk01zy9FEgAl8sKdZq1FP0E_SehptZj_DS8mIyBfjAr1RoT1YgfKFPDWuKWyAo7eGcdFtaOcKtzzMuSzgGGGxwoHrMBe0s4fIc5YQ5EP8GQF7chTLGjoeskDkFDDYBl1dI2Hk3rwBivY9-ts8Pe2nivrPwnf3LiMCROKvxnA91EuElz8sjBexgtE8YvAQ4hs671Hz1huAcZqLYv9-NfKYSnC4VgPZZ&amp;ord=2065604428&amp;ntv_ht=DAZRZAA&amp;ntv_r=http://www.nativo.com/adchoices?utm_medium=adchoicesicon&amp;utm_source=macworld.com&amp;xcust=1-1-1805321-1-0-0&amp;sref=https://www.macworld.com/article/1805321/imac-colors-design-weirdness-wwdc.html\" target=\"_blank\"></a></p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"35d3c75d7c43e4c7fca26ae21c65ff84a5216b47551aeaaa898be8ffb2c60c8e","category":"Apple"}