{"title":"Potential exposure of honey bees to neonicotinoid seed treatments in US rice","link":"https://academic.oup.com/ee/article/53/4/716/7697233?rss=1","date":1719014400000,"content":"<span><div>Abstract</div>Neonicotinoid insecticide seed treatments are commonly used in rice (<span>Oryza sativa</span>) production to control rice water weevil (<span>Lisorhoptrus oryzophilus</span>). With the use of neonicotinoid seed treatments, there is potential that honey bees (<span>Apis mellifera</span>) could be exposed to neonicotinoids through translocation to the pollen. Studies were conducted in 2015 and 2016 to determine the level of neonicotinoids present in flag leaves, pollen, and grain of rice. Thiamethoxam was applied as a seed treatment and foliar prior to flooding. Clothianidin was applied as a seed treatment and as a foliar at a preflood and postflood timing. Subsamples of flag leaves, pollen, and grain were analyzed for positive neonicotinoid detections and abundance. Thiamethoxam was detected in 8.9% of samples and clothianidin was detected in 1.4% of samples. For both thiamethoxam and clothianidin, more positive samples were observed in flag leaf samples than in pollen or grain. An average of 4.30 ng/g of thiamethoxam was detected in flag leaves from seed-applied thiamethoxam. An average of 1.25 ng/g of clothianidin was found in flag leaves from a preflood application of clothianidin. A survey of honey bees present in rice fields was conducted in Mississippi and Arkansas to determine the abundance of honey bees present in rice fields based on the time of day. Honey bee densities were low in rice, with less than 5% and 3% positive detections observed in Mississippi and Arkansas, respectively. More positive detections and higher densities of honey bees were observed for mid-day sampling than for morning or evening sampling.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"35d920d911029800485b62f86e7b0013f69cfa05fdcedd5c5e28a9b43d298d0d","category":"Environment"}