{"title":"Apple's Trade Secret Battle With Masimo Over Pulse Oximetry Technology Ends in Mistrial","link":"https://www.macrumors.com/2023/05/01/apple-masimo-trade-secret-lawsuit-mistrial/","date":1682983536000,"content":"The latest legal dispute between Apple and pulse oximetry company Masimo today ended in a mistrial, reports <em><a href=\"https://www.bloomberg.com/news/articles/2023-05-01/apple-masimo-judge-declares-mistrial-in-trade-secret-theft-fight\">Bloomberg</a></em>. The jury overseeing the case was not able to come to a final decision in its deliberations, causing U.S. district judge James Selna to declare a mistrial.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/apple-watch-ultra-purple.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nSix jurors wanted to decide in favor of Apple, but one juror held strong for Masimo, leading to an impasse. <a href=\"https://www.bloomberg.com/news/articles/2023-05-01/apple-is-one-juror-shy-of-defeating-trade-secret-theft-case\">Earlier this afternoon</a>, the jurors sent the judge a note asking what to do because the juror voting in favor of Masimo would not change her position.\r<br />\n\r<br />\nThe judge initially planned to send the jurors home for the night with deliberations to continue on Tuesday, but after they insisted they would not be able to come to a consensus, he opted to call it.\r<br />\n\r<br />\nApple and Masimo have been in court <a href=\"https://www.macrumors.com/2023/04/18/apple-masimo-legal-battle/\">over the last few weeks</a> to determine whether Apple <a href=\"https://www.macrumors.com/2020/01/09/apple-masimo-apple-watch-lawsuit/\">illegally poached Masimo employees</a> and stole trade secrets when developing the Apple Watch. Masimo was seeking over $1.8 billion in damages and co-ownership of five Apple pulse oximetry patents that Masimo said used its technology.\r<br />\n\r<br />\nApple in July 2013 hired Chief Medical Officer Michael O'Reilly and then in 2014, it hired Cercacor Chief Technical Officer Marcelo Lamego (Cercacor is a Masimo spinoff company). Masimo claims that the two former employees inappropriately shared Masimo's intellectual property when they developed the Apple Watch, which Apple denies.\r<br />\n\r<br />\nDuring the trial, Masimo attempted to demonstrate that Apple Watch development was floundering prior to the hiring of the two Masimo employees, pointing to a 2013 email where now-retired Apple executive Bob Mansfield called the Apple Watch \"a mess\" and said the sensor would \"fail\" on its \"current path.\"\r<br />\n\r<br />\nApple maintained that no Masimo IP was used in its work on the Apple Watch, and further, that what Masimo claims are \"trade secrets\" are ideas \"long known and used by multiple companies.\" Apple said that Masimo targeted it because Masimo saw the success of Apple Watch and wanted to make its own smart watch. Masimo did indeed come out with an <a href=\"https://www.masimopersonalhealth.com/products/masimo-w1\">Apple Watch-like wearable</a> in late 2022 after decades of focus on large medical devices for healthcare.\r<br />\n\r<br />\nIn a statement to <em>MacRumors</em>, Apple said that it plans to ask the court to dismiss the trade secret allegations. For context, five of Masimo's claims against Apple were thrown out during the trial, reducing Masimo's self-calculated award. <blockquote>\"We thank the jury for their careful consideration in this case. We deeply respect intellectual property and innovation and do not take or use confidential information from other companies. We are pleased that the court correctly rejected half of the plaintiffs’ trade secret allegations, and will now ask the court to dismiss the remaining claims.\"</blockquote>\r<br />\n\r<br />\nMasimo said that it plans to continue pursuing the trade theft case.<blockquote>\"While we are disappointed that the jury was unable to reach a verdict, we intend to retry the case and continue to pursue legal redress against Apple. As we begin that process, the United States Trade Commission is scheduled in the coming months to decide whether to ban the importation of certain models of the Apple Watch, following a ruling last year by an Administrative Law Judge that Apple infringed one of Masimo’s patents for pulse oximetry.\"</blockquote>Masimo previously sued Apple for patent infringement, but the U.S. Patent and Trademark Office ended up invalidating all but two of the patents. The United States International Trade Commission in January said that Apple had <a href=\"https://www.macrumors.com/2023/01/11/apple-watch-masimo-patent-infringement/\">infringed on a Masimo patent</a>, a case that is still ongoing.<div>Tags: <a href=\"https://www.macrumors.com/guide/patent-lawsuits/\">Patent Lawsuits</a>, <a href=\"https://www.macrumors.com/guide/masimo/\">Masimo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/01/apple-masimo-trade-secret-lawsuit-mistrial/\">Apple's Trade Secret Battle With Masimo Over Pulse Oximetry Technology Ends in Mistrial</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-trade-secret-battle-with-masimo-over-pulse-oximetry-technology-ends-in-mistrial.2388371/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"35dcd41bb8de1f5cf13638621bd907664159923945b97009eecb1586b281c273","category":"Apple"}