{"title":"Revisiting the Global Methane Cycle Through Expert Opinion","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004234?af=R","date":1719042553000,"content":"<h2>Abstract</h2>\n<p>An accurate quantification of global methane sources and sinks is imperative for assessing realistic pathways to mitigate climate change. A key challenge of quantifying the Global Methane Budget (Saunois et al., 2020, <a target=\"_blank\" href=\"https://doi.org/10.5194/essd-12-1561-2020\">https://doi.org/10.5194/essd-12-1561-2020</a>) is the lack of consistency in uncertainties between sectors. Here we provide a new perspective on bottom-up (BU) and top-down (TD) methane uncertainties by using an expert opinion analysis based on a questionnaire conducted in 2021. Expectedly, experts rank highest uncertainty and lowest confidence levels in the Global Methane Budget related to natural sources in BU budgets. Here, we further reveal specific uncertainty types and introduce a ranking system for uncertainties in each sector. We find that natural source uncertainty is related particularly to driver data uncertainty in freshwater, vegetation, and coastal/ocean sources, as well as parameter uncertainty in wetland models. Reducing uncertainties, most notably in aquatic and wetland sources will help balance future BU and TD global methane budgets. We suggest a new methane source partitioning over gradients of human disturbance and demonstrate that 76.3% (75.8%–79.4%) or 561 (443–700) Tg CH<sub>4</sub> yr<sup>−1</sup> of global emissions can be attributed to moderately impacted, man-made, artificial, or fully anthropogenic sources and 23.7% (20.6%–24.2%) or 174 (115–223) Tg CH<sub>4</sub> yr<sup>−1</sup> to natural and low impacted methane sources. Finally, we identify current research gaps and provide a plan of action to reduce current uncertainties in the Global Methane Budget.</p>","author":"Judith A. Rosentreter, \nLewis Alcott, \nTaylor Maavara, \nXin Sun, \nYong Zhou, \nNoah J. Planavsky, \nPeter A. Raymond","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"35e66847dfd559d8d12cd5595a015808af6a6ada3ace14f089f5e5268e1db82b","category":"Environment"}