{"title":"Application of Artificial Neural Networks for Optimizing Enhanced Heavy Oil Recovery in the Niger-Delta","link":"https://www.preprints.org/manuscript/202410.0535/v1","date":1728374173000,"content":"The decline of conventional oil reserves in Nigeria's Niger Delta region necessitates the exploration of alternative heavy oil recovery methods, particularly given that heavy oil constitutes nearly 20% of the region's estimated crude oil reserves. This study investigates the optimization of enhanced heavy oil recovery through the application of Artificial Neural Networks (ANN) and innovative hot chemical flooding techniques. The experimental phase involved the development of a novel chemical mix comprising dissolved liquid soap, scent leaf extract, bitter leaf extract, palm frond ash, xanthan gum, dry gin, and a unique alkali-surfactant mixture (DG + DPFA). These chemicals were tested at varying injection temperatures, and their respective recovery efficiencies were evaluated. \nFor the ANN model development, key reservoir and operational parameters—porosity, permeability, oil specific gravity, and injection temperature—were utilized as input layers, with three hidden layers and one output layer representing the recovery efficiency. The ANN model successfully correlated the input parameters to recovery efficiencies, providing a robust prediction framework for enhanced heavy oil recovery. Software simulations conducted in parallel with the experimental work offered insights into future recovery potential and anticipated water cut profiles. Furthermore, the study presented mathematical correlations for each chemical flooding process, linking the input variables to recovery efficiency. \n The integration of ANN modelling and experimental validation establishes a comprehensive methodology for optimizing heavy oil recovery in the Niger Delta, suggesting that upstream companies should consider adopting hot chemical flooding strategies to enhance production rates and economic returns. These findings underscore the importance of leveraging advanced technologies and local resources to address the challenges of heavy oil recovery in declining conventional reservoirs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"35e75da494f36daea1f196ed5013069e52b4567a81fb734de87e9c40b34e8c40","category":"Interdisciplinary"}