{"title":"Choose Korean in AWS Support as Your Preferred Language","link":"https://aws.amazon.com/blogs/aws/choose-chinese-and-korean-in-aws-support-as-your-preferred-language/","date":1682366554000,"content":"<p>Today, we are announcing the general availability of <a href=\"https://aws.amazon.com/premiumsupport/\">AWS Support</a> in <strong>Korean</strong> as your preferred language, in addition to English, Japanese, and Chinese.</p> \n<p>As the number of customers speaking Korean grows, AWS Support is invested in providing the best support experience possible. You can now communicate with AWS Support engineers and agents in Korean when you create a support case at the <a href=\"https://support.console.aws.amazon.com/support/home\">AWS Support Center</a>.</p> \n<p>Now all customers can receive account and billing support in Korean by email, phone, and live chat at no additional cost during the supported hours. Per your <a href=\"https://aws.amazon.com/premiumsupport/plans/\">Support plan</a>, customers subscribed to Enterprise, Enterprise On-Ramp, or Business Support plans can receive personalized technical support 24 hours a day and 7 days a week in Korean. Customers subscribed to the Developer Support plan can receive technical support during business hours generally defined as 9:00 AM to 6:00 PM in the customer country as set in <a href=\"https://console.aws.amazon.com/billing/home#/account\">My Account console</a>, excluding holidays and weekends. These times may vary in countries with multiple time zones.</p> \n<p>We also added the localized user interface of the AWS Support Center in Korean, in addition to Japanese and Chinese. AWS Support Center will be displayed in the language you select from the dropdown of available languages in <a href=\"https://console.aws.amazon.com/settings/home?#/localization/edit\">Unified Settings</a> of your AWS Account.</p> \n<p>Here is a new AWS Support Center page in Korean:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/24/2023-aws-support-in-chinese-korean-1-1.jpg\" alt width=\"2472\" height=\"1506\" /></p> \n<p>You can also access customer service, AWS documentation, technical papers, and support forums in Korean.</p> \n<p><strong><u>Getting Started with Your Supported Language in AWS Support</u></strong><br /> To get started with AWS Support in your supported language, <a href=\"https://support.console.aws.amazon.com/support/home#/case/create\">create a Support case</a> in AWS Support Center. In the final step in creating a Support case, you can choose a supported language, such as English, Chinese (中文), Korean (한국어), or Japanese (日本語) as your <strong>Preferred contact language</strong>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/11/2023-aws-support-in-chinese-korean-3.jpg\" alt width=\"2225\" height=\"1264\" /></p> \n<p>When you choose Korean, the customized contact options will be shown by your support plan.</p> \n<p>For example, in the case of Basic Support plan customers, you can choose <strong>Web</strong> to get support via email, <strong>Phone</strong>, or <strong>Live Chat</strong> when available. AWS customers with account and billing inquiries can receive support in Korean from our customer service representatives with proficiency in Korean at no additional cost during business hours defined as 09:00 AM to 06:00 PM Korean Standard Time (GMT+9), excluding holidays and weekends.</p> \n<p>If you get technical support per your <a href=\"https://aws.amazon.com/premiumsupport/plans/\">Support plan</a>, you may choose <strong>Web</strong>, <strong>Phone,</strong> or <strong>Live Chat</strong> depending on your Support plan to get in touch with support staff with proficiency in Korean, in addition to English, Japanese, and Chinese.</p> \n<p>Here is a screen in Korean to get technical support in the Enterprise Support plan:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/20/2023-aws-support-in-chinese-korean-5-2.jpg\" alt width=\"2176\" height=\"1404\" /></p> \n<p>When you create a support case in your preferred language, the case will be routed to support staff with proficiency in the language indicated in your preferred language selection. To learn more, see <a href=\"https://docs.aws.amazon.com/awssupport/latest/user/getting-started.html\">Getting started with AWS Support</a> in the AWS documentation.</p> \n<p><strong><u>Now Available</u></strong><br /> AWS Support in Korean is now available today, in addition to English, Japanese, and Chinese. Give it a try, learn more about <a href=\"https://aws.amazon.com/premiumsupport/\">AWS Support</a>, and send feedback to your usual AWS Support contacts.</p> \n<p>– <a href=\"https://twitter.com/channyun\">Channy</a></p> \n<p> </p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"35e87271d25fa57c10826f951a03d21db75355df9f8328a2e766b63978810805","category":"Tech"}