{"title":"Community science can inform invasive species management: Melaleuca (Myrtaceae) in South Africa","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12391?af=R","date":1729048745000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/8f10559b-9825-4d6a-ae6e-2d5cd55e8436/eso312391-toc-0001-m.png\" alt=\"Community science can inform invasive species management: Melaleuca (Myrtaceae) in South Africa\" />\n<p>Community science initiatives are proving to be game changers for detecting and managing biological invasions. By leveraging the extensive, real-time data provided by community scientists on iNaturalist, we assessed the distribution and invasion ecology of the widely cultivated genus <i>Melaleuca</i> L. (Myrtaceae) in South Africa. After verifying, filtering, and applying criteria to increase reliability, we confirmed over 2800 records of 26 <i>Melaleuca</i> species in South Africa—32% of which were wild-growing (naturalised). iNaturalist data provided new insights on five <i>Melaleuca</i> species that were not previously known to be naturalised in South Africa. These findings underline the value of community science for identifying and tracking invasive species early before they cause widespread harm.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nCommunity science initiatives are revolutionising our ability to detect and respond to biological invasions. Non-native trees and shrubs are among the world's most damaging invasive species and community science data can be used to inform protocols for managing these invasions.\n\nThis study explores the utility of iNaturalist in informing management practices for the widely cultivated and naturalised genus <i>Melaleuca</i> L. (Myrtaceae; here including the genus <i>Callistemon</i>) in South Africa. We applied data from iNaturalist to assess the distribution and invasion ecology of <i>Melaleuca</i> species in South Africa.\n\nMelaleucas, first recorded in South Africa in 1882, have been widely used as garden ornamentals and street trees in the country for over 50 years. Naturalisation of melaleucas in South Africa was first reported in 1998 and the first records of naturalisation/invasiveness for other species are accumulating rapidly. Data on all <i>Melaleuca</i> species in South Africa were downloaded from iNaturalist and analysed using Geographic Information System software.\n\nIn September 2023, iNaturalist had 3221 records of melaleucas across the country. After checking and filtering, and applying criteria to increase reliability, 2815 records remained, with confirmed identifications of 26 species. These species were recorded in a total of 138 quarter-degree cells (QDCs) in South Africa (7% of the country); Research Grade (RG, wild-growing) records occurred in 21 QDCs, records of cultivated plants in 75 QDCs, and 42 QDCs had records of both cultivated and wild-growing plants. An Invasiveness Index was calculated for each species in the country, provinces, and municipalities, to show which species are already invasive or have substantial invasion debt. Thirty-two percent of the filtered records were RG (naturalised). The municipality with the highest number of records is the City of Cape Town, with 43% RG records.\n\niNaturalist provided useful information on the occurrence of five <i>Melaleuca</i> species for which no information was available before this study was undertaken. Case studies of invaded habitats highlight that melaleucas have the potential to alter ecosystems incurring substantial control costs.\n\n<i>Practical implications</i>: Our study highlights the value of community science data in the detection, monitoring, and management of invasive plant species.\n</p>","author":"Luke J. Potgieter, \nMichele B. ter Huurne, \nDavid M. Richardson","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"35ec945a64603642e2b75f65c7bd48661ad40dad9802cd48512e293290123aff","category":"Environment"}