{"title":"Enhancing functionality and bioactivity of walnut protein through limited enzyme digestion","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13666?af=R","date":1718873898000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Walnut protein (WP) is recognized as a valuable plant protein. However, the poor solubility and functional properties limit its application in the food industry. It is a great requirement to improve the physicochemical properties of WP.</p>\n<h2>RESULTS</h2>\n<p>Following a 90 min restricted enzymatic hydrolysis period, the solubility of WP significantly increased from 3.24% to 54.54%, with the majority of WP hydrolysates (WPHs) possessing a molecular weight exceeding 50 kDa. Circular dichroism spectra showed that post-hydrolysis, the structure of the protein became more flexible, while the hydrolysis time did not significantly alter the protein's secondary structure. After hydrolysis, WP's surface hydrophobicity significantly increased from 2279 to 6100. Furthermore, WPHs exhibited a strong capacity for icariin loading and micelle formation with critical micelle concentration values of 0.71, 0.99 and 1.09 mg mL<sup>−1</sup>, respectively. Moreover, similar immuno-enhancement activities were observed in WPHs. After exposure to WPHs, the pinocytosis of RAW264.7 macrophages was significantly improved. WPH treatment also increased the production of nitric oxide, interleukin-6 (IL-6) and tumor necrosis factor-<i>α</i> (TNF-<i>α</i>) in macrophages. Up-regulation of mRNA expressions of <i>IL-6</i>, inducible nitric oxide synthase (<i>iNOS</i>) and <i>TNF-α</i> was observed in a dose-dependent manner.</p>\n<h2>CONCLUSION</h2>\n<p>The enhancement of functionality and bioactivity in WP can be achieved through the application of limited enzyme digestion with trypsin. This process effectively augments the nutritional value and utility of the protein, making it a valuable component in various dietary applications. © 2024 Society of Chemical Industry.</p>","author":"Jinping Wang, \nHuimin Bi, \nXuesong Zhou, \nBao Yang, \nLingrong Wen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"35f92a6ada3f007fe92c5a4c3c8608c0800b617bdb565615ac047820aaf4820c","category":"Environment"}