{"title":"Comparative transcriptomics elucidates the cellular responses of an aeroterrestrial zygnematophyte to UV radiation","link":"https://academic.oup.com/jxb/article/75/11/3624/7633995?rss=1","date":1711152000000,"content":"<span><div>Abstract</div>The zygnematophytes are the closest relatives of land plants and comprise several lineages that adapted to a life on land. Species of the genus <span>Serritaenia</span> form colorful, mucilaginous capsules, which surround the cells and block harmful solar radiation, one of the major terrestrial stressors. In eukaryotic algae, this ‘sunscreen mucilage’ represents a unique photoprotective strategy, whose induction and chemical background are unknown. We generated a <span>de novo</span> transcriptome of <span>Serritaenia testaceovaginata</span> and studied its gene regulation under moderate UV radiation (UVR) that triggers sunscreen mucilage under experimental conditions. UVR induced the repair of DNA and the photosynthetic apparatus as well as the synthesis of aromatic specialized metabolites. Specifically, we observed pronounced expressional changes in the production of aromatic amino acids, phenylpropanoid biosynthesis genes, potential cross-membrane transporters of phenolics, and extracellular, oxidative enzymes. Interestingly, the most up-regulated enzyme was a secreted class III peroxidase, whose embryophyte homologs are involved in apoplastic lignin formation. Overall, our findings reveal a conserved, plant-like UVR perception system (UVR8 and downstream factors) in zygnematophyte algae and point to a polyphenolic origin of the sunscreen pigment of <span>Serritaenia</span>, whose synthesis might be extracellular and oxidative, resembling that of plant lignins.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"35f9abda9759bf229dac76bf824ef0c556f9163c27b9a5ec450a164dda25f35c","category":"Environment"}