{"title":"Team bike check: Q36.5 Pro Cycling’s Scott Foil","link":"https://www.cyclingtips.com/2023/04/team-bike-check-q36-5-pro-cyclings-scott-foil/","date":1681750919000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/P1044034.jpg?width=1200\" alt=\"Team bike check: Q36.5 Pro Cycling's Scott Foil\" /></figure><p>Team Q36.5 Pro Cycling are, on the surface, the new kids on the block in the pro cycling world, a squad that only got their UCI team racing licence back in December 2022. But, scratch the surface and you’ll come across a few familiar names that have brought the team to life, the main guy being a certain <a href=\"http://cyclingtips.com/tag/Doug-Ryder\" target=\"_blank\">Doug Ryder</a>.</p>\n<p>Doug, if you’re familiar with team management, is the gentleman who from 2007 through 2021 ran the Qhubeka project, a team that started out life with MTN as a main sponsor, morphed through its many incarnations, including Dimension Data, NTT, and unfortunately finished with a highly questionable sponsor of NextHash. The team folded in 2021.</p>\n<p><strong>Also read: <a href=\"https://www.cyclingtips.com/2023/04/paris-roubaix-tech-pit-walk-the-bikes-and-the-gear/\" target=\"_blank\">Paris-Roubaix: Tech pit walk, the bikes and the gear</a></strong></p>\n<p>However, after a season out, Doug and help have risen from the ashes again with the Q36.5 Pro Cycling Team — a Swiss-registered ProTeam squad with some stand-out names looking to prove a point. Oh and of course, there’s also a certain Mr Vincenzo Nibali who has come on as the technical advisor. Not a bad job to land as your first gig after retirement.</p>\n<p>While walking the <a href=\"http://cyclingtips.com/tag/2023-paris-roubaix\" target=\"_blank\">Paris-Roubaix</a> pits, I got a few moments with Team mechanic Rayan Taylor. Ryan kindly took a few moments to run me through what the team were using for the Hell of the North and what they would be using throughout the 2023 season. We also touch on how complex a mechanic’s job is when a team comes together only a few weeks before the start of the season.</p>\n<p><strong>Also read: </strong><a href=\"https://www.cyclingtips.com/2023/04/paris-roubaix-tech-what-tire-pressure-did-the-pros-run/\" target=\"_blank\">Paris-Roubaix tech: What tire pressure did the pros run?</a></p>\n<p>The bikes for 2023 come from <a href=\"http://cyclingtips.com/tag/Scott\" target=\"_blank\">Scott</a>, a bike brand that certainly helps to keep things Swiss. In addition, groupsets are from SRAM and wheels from SRAM’s sister brand Zipp; it all makes for a nice package not just to take on the cobbles of Roubaix but also any surface that the racing season will throw at them in their first year.</p>\n<div></div>\n<p> </p>","author":"Dave Everett","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"360559867ada6472ccfd3441895884a9b9cd55c2e5fb803a92fc8b99c48dce07","category":"Cycling"}