{"title":"Southern pine beetle (Coleoptera: Curculionidae) and its associated insect community: similarities and key differences between northeastern and southeastern pine forests","link":"https://academic.oup.com/ee/article/53/1/143/7457359?rss=1","date":1701388800000,"content":"<span><div>Abstract</div>We examine consequences of climate-induced range expansion on community composition and diversity within trees attacked by the southern pine beetle (<span>Dendroctonus frontalis</span> Zimmermann). At the northernmost limit of the southern pine beetle range where populations have persisted for multiple years (currently Long Island, NY), we collected and reared bark samples and placed emergence traps on southern pine beetle-attacked pitch pine, <span>Pinus rigida</span> Mill. (Pinales: Pinaceae). From these samples, we quantified southern pine beetle gallery length and emergence as well as the diversity and abundance of all associated insects including known and suspected competitors, predators, and parasitoids. We compared our results to that of historic sampling data (1975–1997) in the core of southern pine beetle’s range in the southern United States. Key community members were present in both the northern and southern regions; composition and relative abundances differed markedly. A key predator, the clerid beetle <span>Thanasimus dubius</span> (Fabricius) (Coleoptera: Cleridae), was present in similar densities in both regions. Southern pine beetle infested a greater proportion of the length of the tree bole in the North. This increased tree utilization may be a consequence of a lack of resource competition by <span>Ips</span> De Geer (Coleoptera: Curculionidae) engraver beetles, which we found only in very low abundance in the northern sites. We discuss the implications of these results in the context of southern pine beetle range expansion. Continued study of the southern pine beetle community and temporal southern pine beetle dynamics in the North will add to our current knowledge base and aid preservation of rare and ecologically valuable pine barrens of New England.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"3607dde80c71440846c6891f9d278416722a7b77e138329032bb227dd5da65ee","category":"Environment"}