{"title":"The Specific Legislation Governing Secondary Research on Biological Samples Invalidates the Accusations of Ethical Fraud Levelled against the IHU-MI","link":"https://www.preprints.org/manuscript/202407.1858/v1","date":1721750707000,"content":"Background   Compliance with research ethics legislation is crucial for protecting people's rights in clinical trials. Researchers can alert publishers when they have concerns about possible non-compliance with this legislation by other authors, and this opportunity for independent scrutiny is important. Nevertheless, some alerts may turn out to be unfounded due to a misunderstanding of the legislation.   Methods   We present the analysis of the article by F. Franck et al., « Raising concerns on questionable ethics approvals - a case study of 456 trials from the Institut Hospitalo-Universitaire Méditerranée Infection», in which the authors explain having sent numerous emails to different publishers to express their concerns about potential ethical breaches in publications from a single French institution. We analyzed in detail the 248 studies that the authors present as suspects. We have also studied the texts of French law.   Results   Our detailed analysis of these 248 studies discovered that only 8 of them report research involving humans. All the others are secondary research on existing biological samples. In France, as in many other countries, secondary research on biological samples does not involve human subjects.    Conclusions   Assessing the ethical conformity of scientific publications must be based on a precise knowledge of the legislation and a rigorous analysis of these publications. When researchers who alert publishers confuse research involving the human person with research not involving the human person, the publishers are in danger of being misled by these unfounded alerts. This can have deleterious consequences.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"360724f0105dcc00211b304b1e65c953aad5fa6576af65be0105c9cf07dec981","category":"Interdisciplinary"}