{"title":"Higher intensity exercise after encoding is more conducive to episodic memory retention than lower intensity exercise: A field study in endurance runners","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308373","date":1726236000000,"content":"<p>by Roger Makepeace, Michael Craig</p>\r\n\r\nAn acute bout of exercise in the moments after learning benefits the retention of new memories. This finding can be explained, at least partly, through a consolidation account: exercise provides a physiological state that is conducive to the early stabilisation of labile new memories, which supports their retention and subsequent retrieval. The modification of consolidation through non-invasive exercise interventions offers great applied potential. However, it remains poorly understood whether effects of exercise translate from the laboratory to naturalistic settings and whether the intensity of exercise determines the effect in memory. To this end, adult endurance runners were recruited as participants and completed two study sessions spaced two weeks apart. In each session, participants were presented with a list of words and asked to recall them on three occasions: (i) immediately following their presentation, (ii) after a 30-minute retention interval, and (iii) after 24 hours. Crucially, the 30-minute retention interval comprised our experimental manipulation: higher intensity exercise (running) in the first session and lower intensity exercise (walking) in the second, both completed in a naturalistic setting around participants’ existing physical activity training programmes. Exertion was recorded through heart rate and rate of perceived exertion data. Alertness, mood, and arousal ratings were also collected before and after the 30-minute retention interval. Immediate memory for the two wordlists was matched, but participants retained significantly more words after 30 minutes and 24 hours when encoding was followed by higher than lower intensity exercise. Exertion data revealed that participants experienced vigorous and light exercise in the higher and lower intensity conditions, respectively. Significant improvements in alertness, mood, and arousal were observed following both exercise conditions, but especially in the higher intensity condition. These outcomes reveal that experiencing higher intensity physical activity in the field is conducive to declarative memory retention, possibly because it encourages consolidation.","author":"Roger Makepeace","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"360d1356b5d1504e6d57de127290b44ed43fd0672d68bca60cdfd71f383b54b8","category":"Interdisciplinary"}