{"title":"3 features that could transform tomorrow’s Apple devices","link":"https://www.macworld.com/article/351198/3-features-that-could-enhance-future-apple-products.html","date":1626688800000,"content":"\n<div>\n<section><div></div></section><p>To paraphrase the immortal words of <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/watch?v=L_jWHffIx5E&amp;xcust=1-1-351198-0-0-0&amp;sref=https://www.macworld.com/feed\">Smash Mouth</a>, the tech starts coming and it don’t stop coming. Every year seems to bring a new set of Apple devices, replete with a host of features, some of which seemed practically impossible previously. But such is the way of progress! It marches ever forward.</p>\n\n\n\n<p>The difficulty, as always, is in figuring out exactly which technological advances will find their way into future products. More often than not, these novel approaches are expensive or impractical, especially if you’re shoving them into something as small as a smartphone or a watch.</p>\n\n\n\n<p>But sometimes you can trace the trajectory of these developments to see just how they might end up in an Apple device—and perhaps even get an idea of when.</p>\n\n\n\n<h2>There will be blood glucose</h2>\n\n\n\n<p>Rumors of a blood glucose sensor being added to the Apple Watch have seemingly circulated ever since the device was first released in 2015. But it’s never materialized, probably due to a number of factors, most notably the lack of a reliable non-invasive way to get a reading. Traditionally, blood glucose measurements have relied upon sensors that check a drop of blood, usually drawn from the fingertip.</p>\n\n\n\n<p>Enter Rockley Photonics, a company that specializes in optical technologies. Last week, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://rockleyphotonics.com/rockley-unveils-end-to-end-digital-health-monitoring-solution/&amp;xcust=1-1-351198-0-0-0&amp;sref=https://www.macworld.com/feed\">the company announced that it had developed a wearable device</a> to measure a bunch of different health metrics, including glucose trends, using an infrared spectrophotometer. (Akin to the way the Apple Watch and other devices shine light and then take measurements, this version uses not a green LED, but infrared.)</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/rockley-photonics-wristband.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Rockley Photonics—which happens to have Apple as a customer—has developed a wristband that can, among other things, detect blood glucose levels.</p></figcaption></figure><p>Rockley Photonics</p></div>\n\n\n\n<p>Moreover, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.telegraph.co.uk/technology/2021/05/01/apple-watch-could-add-blood-sugar-alcohol-readings-deal-uk-tech/&amp;xcust=1-1-351198-0-0-0&amp;sref=https://www.macworld.com/feed\">a report in <em>The Telegraph</em> earlier this year</a> revealed that Rockley Photonics’s largest customer was, in fact, Apple. That’s no surprise: the company tends to invest deeply when it finds someone working on an area that it cares about, and health technology is definitely at the forefront of its interests these days.</p>\n\n\n\n<p>But those close ties suggest that, should Rockley’s device prove accurate and reliable, this sensor technology might well find its way into a device such as the Apple Watch at some point in the future—even if it’s not something to expect in the near term.</p>\n\n\n\n<h2>Up periscope</h2>\n\n\n\n<p>Cameras have been one of the driving features of smartphones over the past decade, with companies like Apple, Samsung, and Google all racing to provide the best photography experiences. While that’s often—if you’ll excuse the expression—focused on improving picture quality, color, and resolution, one area has proved particularly challenging: zoom.</p>\n\n\n\n<p>Most smartphone cameras are wide-angle lenses, great for capturing your average snapshot, but not ideal for far-off subjects. To combat this, smartphone makers have used a combination of digital zoom (basically just zooming in on an image in software) and additional optical lenses (such as the 2x telephoto lens on Apple’s iPhone 12 Pro series). But increasing zoom distance is challenging, since it generally requires increasing the physical distance between lenses—hard to do when your smartphone is only a hair over 7mm thick.</p>\n\n\n\n<p>But <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&amp;Sect2=HITOFF&amp;d=PALL&amp;p=1&amp;u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&amp;r=1&amp;f=G&amp;l=50&amp;s1=11,061,213.PN.&amp;OS=PN/11,061,213&amp;RS=PN/11,061,213&amp;xcust=1-1-351198-0-0-0&amp;sref=https://www.macworld.com/feed\">a recent Apple patent</a> for a “folded camera” shows one possible way to solve this problem. As with a submarine periscope, this setup uses a prism or mirror to reflect the image 90 degrees, allowing smartphone to embed its lenses and sensors across the larger width or height of the phone, rather than being bound by the device’s thickness. Apple’s not the first to attempt this: Huawei, for example, has used a periscope lens to provide up to 10x zoom on at least one of its phones.</p>\n\n\n\n<p>Improving zoom would be a tangible benefit to Apple’s cameras, and would almost certainly spur sales of iPhones—if and when the company decides to ship products using it, which rumors suggest could be as early as next year.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/huawei-p30-pro-cameras.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>An Apple patent filing revealed that the company is working on a periscope lens, like the one found in the Huawei P30 Pro.</p></figcaption></figure><p>Huawei</p></div>\n\n\n\n<h2>Land down under</h2>\n\n\n\n<p>Speaking of periscopes and submarines, Apple’s worked hard to make its phones water resistant since the iPhone 7. And though that’s great in the case of accidental drops or dunks, it doesn’t help you much if you actually want to <em>take</em> your iPhone underwater. If you’ve ever tried to use your smartphone’s touchscreen in the rain or after spilling some water on it, you’ve probably noticed that it doesn’t work very well.</p>\n\n\n\n<p>But that’s not to say that Apple hasn’t investigated the issue. The company’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.patentlyapple.com/patently-apple/2021/07/the-race-is-on-both-apple-and-samsung-are-working-on-delivering-future-smartphones-with-an-underwater-mode.html&amp;xcust=1-1-351198-0-0-0&amp;sref=https://www.macworld.com/feed\">received a number of patents</a> related to developing an “underwater mode” that would allow people to take pictures and shoot video while submerged. This might seem like a niche pursuit, but it’s certainly one that’s not hard to imagine Apple playing up in a commercial or a tech demo. (Can we make Phil Schiller dive into a pool and take some pictures?)</p>\n\n\n\n<p>While there aren’t any current circulating rumors suggesting that the underwater mode is likely to happen anytime soon, it’s hard to count these things out, given how close to the (scuba) vest the company likes to play these things. So I guess you could…hold your breath?</p>\n</div>","author":"Dan Moren","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"361569e91e95ad0e61cf69e9693ac584f551eee0d315953ed913ad19a9449ff2","category":"Apple"}