{"title":"Factors associated with 90-day mortality in Vietnamese stroke patients: Prospective findings compared with explainable machine learning, multicenter study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310522","date":1726840800000,"content":"<p>by Ton Duy Mai, Dung Tien Nguyen, Cuong Chi Tran, Hai Quang Duong, Hoa Ngoc Nguyen, Duc Phuc Dang, Hai Bui Hoang, Hong-Khoi Vo, Tho Quang Pham, Hoa Thi Truong, Minh Cong Tran, Phuong Viet Dao</p>\r\n\r\nThe prevalence and predictors of mortality following an ischemic stroke or intracerebral hemorrhage have not been well established among patients in Vietnam. 2885 consecutive diagnosed patients with ischemic stroke and intracerebral hemorrhage at ten stroke centres across Vietnam were involved in this prospective study. Posthoc analyses were performed in 2209 subjects (age was 65.4 ± 13.7 years, with 61.4% being male) to explore the clinical characteristics and prognostic factors associated with 90-day mortality following treatment. An explainable machine learning model using extreme gradient boosting and SHapley Additive exPlanations revealed the correlation between original clinical research and advanced machine learning methods in stroke care. In the 90 days following treatment, the mortality rate for ischemic stroke was 8.2%, while for intracerebral hemorrhage, it was higher at 20.5%. Atrial fibrillation was an elevated risk of 90-day mortality in the ischemic stroke patient (OR 3.09; 95% CI 1.90–5.02, p&lt;0.001). Among patients with intracerebral hemorrhage, there was no statistical significance in those with hypertension compared to their counterparts without hypertension (OR 0.65, 95% CI 0.41–1.03, p &gt; 0.05). The baseline NIHSS score was a significant predictor of 90-day mortality in both patient groups. The machine learning model can predict a 0.91 accuracy prediction of death rate after 90 days. Age and NIHSS score were in the top high risks with other features, such as consciousness, heart rate, and white blood cells. Stroke severity, as measured by the NIHSS, was identified as a predictor of mortality at discharge and the 90-day mark in both patient groups.","author":"Ton Duy Mai","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"361640d32ff1c429451619f185f56a9b3a050a4191675b11549da5dd6642295d","category":"Interdisciplinary"}