{"title":"Spawn and development of the olivid gastropod Olivancillaria carcellesi from north Patagonia, Argentina","link":"https://onlinelibrary.wiley.com/doi/10.1111/ivb.12420?af=R","date":1710504013000,"content":"<h2>Abstract</h2>\n<p><i>Olivancillaria carcellesi</i> occurs in shallow sandy shores from north Patagonia, in intertidal and subtidal sandy bottoms. Females of <i>O. carcellesi</i> exhibited a remarkable specificity for spawning on the shells of living males and females, indiscriminately, of the buccinanopsid <i>Buccinastrum deforme</i>, measuring 26.9 ± 4.7 mm in shell length. The egg capsule was semispherical and attached to <i>B. deforme</i> shells by a small elliptical and wide base. The capsule was translucid when spawned, with a thick and semirigid wall and a hatching aperture of 1.8 ± 0.1 mm (n = 111) in diameter. Each egg capsule contained a single egg that measured 1367 ± 34 μm (n = 5) in diameter before cleavage. The embryo developed a small bilobed velum and an operculum, which were both lost before hatching as a crawling juvenile of 1762 ± 47 μm (n = 28) in shell length. As in other species in the genus, the eggs of <i>O. carcellesi</i> are among the largest in the caenogastropods with direct development. The time from oviposition to hatching is estimated to be approximately 6 months.</p>\n<h2>Resumen</h2>\n<p><i>Olivancillaria carcellesi</i> se encuentra en costas someras del norte de Patagonia, en fondos arenosos intermareales y submareales. Las hembras de <i>O. carcellesi</i> exhiben una llamativa especificidad de ovipostura sobre las conchas de machos y hembras vivos, indiscriminadamente, del buccinanopsido <i>Buccinastrum deforme</i>, midiendo entre 26.9 ± 4.7 mm de largo de concha. La ovicápsula semiesférica se encontró adherida a las conchas de <i>B. deforme</i> por una pequeña base elíptica y ancha. La cápsula era traslúcida al momento de la oviposición, con una pared gruesa y rígida y una apertura de eclosión de 1.8 ± 0.1 mm (n = 111) de diámetro. Cada ovicápsula contenía un único huevo que midió 1,367 ± 33 μm (n = 5) de diámetro antes del clivaje. El embrión desarrolló un pequeño velo bilobulado y un opérculo, que desaparecieron antes de la eclosión como un juvenil reptante de 1762 ± 47 μm (n = 28) de largo de concha. Como sucede en otras especies del género, los huevos de <i>O. carcellesi</i> se encuentran entre los mas grandes dentro de los caenogastrópodos de desarrollo directo. El tiempo desde la oviposición hasta la eclosión fue estimado aproximadamente en 6 meses.</p>","author":"Soledad Zabala, \nValeria Teso, \nPablo E. Penchaszadeh, \nAndrés Averbuj","siteTitle":"Wiley: Invertebrate Biology: Table of Contents","siteHash":"288dc5c0698e157be6008116ed4a15ccbcde55ff21b19d813cd3a3ab63550757","entryHash":"3619c8f2462e03791dbee78f9009a1981abe57f127cfce1813426d99592d80a2","category":"Environment"}