{"title":"Your iPhone, iPad, and Mac just got a first-of-its-kind security update","link":"https://www.macworld.com/article/1804313/ios-16-4-1-macos-13-3-1-rapid-security-response.html","date":1683028342000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple has just used its new Rapid Security Response system for the first time in a regular public release—all prior RSR patches were for iOS/macOS beta testing purposes.</p>\n\n\n\n<p>The patch comes as an update for those running iOS or iPadOS 16.4.1 or macOS 13.3.1. There are no release notes for this update, Apple only provides the boilerplate description: “This Rapid Security Response provides important security fixes and is recommended for all users.” The update is 85.2MB compared with nearly 2GB for iOS 16.4.1.</p>\n\n\n\n<p>As Apple describes, the new Rapid Security Response system will let it patch security vulnerabilities without needing to wait for larger version releases that take weeks to test:</p>\n\n\n\n<blockquote><p>Rapid Security Responses are a new type of software release for iPhone, iPad, and Mac. They deliver important security improvements between software updates — for example, improvements to the Safari web browser, the WebKit framework stack, or other critical system libraries. They may also be used to mitigate some security issues more quickly, such as issues that might have been exploited or reported to exist “in the wild.”</p><p>New Rapid Security Responses are delivered only for the latest version of iOS, iPadOS and macOS — beginning with iOS 16.4.1, iPadOS 16.4.1, and macOS 13.3.1.</p></blockquote>\n\n\n\n<p>At this time, Apple’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT201222&amp;xcust=1-1-1804313-1-0-0&amp;sref=https://www.macworld.com/feed\">Security Updates page</a> does not yet list the specific fixes of this RSR. We’ll update this story as more details about the update are made available, though it’s possible Apple won’t divulge the patches until iOS 16.5 arrives. It’s not clear if Apple will be moving away from security fixes that are tied to point updates or if these RSR updates are for quicker emergency-style fixes.</p>\n\n\n\n<p>If you want to make sure you receive these updates, go to Settings (System Settings on macOS) &gt; <em>General</em> &gt; <em>Software Updates</em> &gt; <em>Automatic Updates</em> and make sure you have “Security Responses &amp; System Files” enabled. They are reportedly being <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/aaronp613/status/1653098576929513491?s=61&amp;t=7huFBfu5cwo1Iwpdjkr8pg&amp;xcust=1-1-1804313-1-0-0&amp;sref=https://www.macworld.com/feed\">rolled out over a couple of days</a>, so your device might not receive the update immediately or there may be issues installing it. These fixes will eventually be included in the next iOS/iPadOS/macOS release, but that can take a while and leave your device vulnerable in the meantime.</p>\n\n\n\n<p>This new system was meant as a way for Apple to update critical system components quickly without updating all of iOS, which can include updates to built-in apps and requires a lot more testing before release. </p>\n\niOS, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"361def8f1f57f8b3dfd32d1e6b68789eee6914725061bd3862c691e741012607","category":"Apple"}