{"title":"114 Effects of greater levels of soy protein and methionine on periparturient health of sows","link":"https://academic.oup.com/jas/article/102/Supplement_2/181/7664806?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Sow prolificacy in the U.S. continues to trend greater, as does sow mortality. Replacement of soy protein (SBM) in sow diets with corn and purified amino acids (AA), may impact the health of highly prolific sows. In 2015, Denmark increased recommendations for SID methionine (MET) to SID lysine (LYS), MET:LYS to 32%, NRC (2012) recommend 27%. The primary objective of this research was to evaluate SBM and MET at greater levels for their effects on markers of health in the peripartum and lactation periods. A total of 38 parity 1 to 3 females (PIC 1050) were utilized with a starting body weight (BW) of 223.4kg ± 13.0 SD. On d 85 of gestation, sows were allocated by BW and parity to one of four treatments: 1 - 30% SBM (30% of diet), 36% MET:LYS; 2 - 15% SBM, 36% MET:LYS; 3 - 30% SBM, 27% MET:LYS; 4 - 15% SBM, 27% MET:LYS. Sows were fed dietary treatments 28 d pre-farrow, according to BW, and ad libitum throughout lactation. Body condition by caliper (BCS), BW, and backfat (BF) were measured on d 0, 21, 2 d post-farrow, and weaning. Sows were assigned a farrowing ease score of 1 to 4 (1-easy to 4-difficult) based on duration, restless activity, savaging, and assistance required. Continuous glucose monitors (CGM) were placed on a subset of sows (n = 12) on d 113 of gestation through 3 d post-farrow. Data were analyzed using the GLM procedure in SAS with sow serving as the experimental unit. A planned t-test was performed on CGM glucose data. Two sows were removed during lactation. The combined effect of 30% SBM and 36% MET:LYS produced an average lactation BW loss of 0.3 kg, while the 15% SBM and 27% MET:LYS treatment, diets similar to NRC, lost an average of 18.1kg. Sows fed the 30% SBM diets had less lactation BW loss than 15% SBM (Table 1; <span>P</span> &lt; 0.10). Sows fed 36% MET:LYS lost less BW than those fed 27% MET:LYS (<span>P</span> &lt; 0.05). The 36% MET:LYS group also lost less backfat during lactation and had lower pre- and post-farrow body temperatures than 27% MET:LYS (<span>P</span> &lt; 0.01 and <span>P</span> &lt; 0.05, respectively). While no differences in blood glucose were observed, in sows with CGM, greater levels of SBM decreased interstitial glucose concentrations (<span>P</span> = 0.055). In conclusion, greater inclusion of SBM and increasing the MET:LYS ratio in sow diets may improve periparturient changes in body condition and health outcomes.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3621ca4c21fd7303ea29697baef30fe793470b7a9586596118a1f11c54e914c5","category":"Environment"}