{"title":"PSLBII-3 Influence of iron supplementation on insulin and glucose dynamics in horses","link":"https://academic.oup.com/jas/article/102/Supplement_3/658/7757878?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Iron is an essential micromineral involved in various physiological functions such as oxygen transport. The National Research Council’s Nutrient Requirements of Horses has iron requirements set at 400 mg iron daily for a 500 kg horse at maintenance; however, a survey found that Thoroughbreds consumed well over the daily requirement at 3,900 mg of iron from hay and grain alone. Additionally, a previous study has found a correlation between hyperinsulinemia and increased ferritin, an indicator of iron body stores. Therefore, the objective of the present study was to determine the effects of iron supplementation on body iron stores as well as insulin and glucose dynamics. It was hypothesized that iron supplementation would influence body iron stores and insulin and glucose responses. Mixed-breed geldings [n = 12; 558.9 ± 74.4 kg body weight (BW)] were housed individually for the study. Horses were fed 2% of their BW in grass hay and an iron-free vitamin mineral supplement, consuming an average of 600 mg of iron daily for the first 28 d (Hay Phase). Horses were then assigned to continue on the hay diet (CTRL; n = 4) or an iron-supplemented diet (IRON; n = 8), in which an oral iron supplement was given daily in the form of ferrous sulfate, with IRON horses consuming an average of 4,000 mg of iron daily for 28 d (Supplement Phase). Oral sugar tests (OSTs) were performed at the beginning of the study as well as the end of each phase, using a 0.45 mL/kg of BW Karo Light Syrup dose to determine insulin response, with jugular venous samples taken prior to the dose and 60 min after. All statistical analysis was performed in GraphPadPrism Version 10.2.0 (GraphPad Software, Boston, MA), using analysis of variance for repeated measures and correlation analysis. All OSTs throughout the study had a significant time effect (<span>P</span> &lt; 0.05) for both insulin and glucose. There was a time X treatment trend (<span>P</span> = 0.1) for insulin during the Supplement Phase and when using multiple comparisons, insulin response was significantly greater (<span>P</span> &lt; 0.0007) at 0 versus 60 min in IRON horses. Although there was no correlation found between 60-min insulin and ferritin concentrations in both IRON and CTRL horses, mean ± SD insulin and ferritin in the IRON group were 23.6 ± 10 uU/mL and 570 ± 195.8 ng/mL, respectively, while in the CTRL group these were 12.7 ± 2.9 uU/mL and 453 ± 31.1 ng/mL, respectively. In conclusion, iron supplementation with an inorganic form at 10 times the daily requirement appears to result in increased insulin responses as well as body iron stores. Further research needs to determine if feeds naturally enriched in iron impact glucose metabolism.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3624dd93f31719e5a37b755f572dd6d210ed5e7b9a7529d64df61b84817b5e8d","category":"Environment"}