{"title":"Mark Cavendish delays retirement to race for one more year in 2024","link":"https://www.cyclist.co.uk/news/mark-cavendish-retirement-delay","date":1696417688000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/news/mark-cavendish-retirement-delay\">Mark Cavendish delays retirement to race for one more year in 2024</a></p>\n\n<p><a href=\"https://www.cyclist.co.uk/tags/mark-cavendish\" target=\"_blank\">Mark Cavendish</a> is back. Despite <a href=\"https://www.cyclist.co.uk/news/mark-cavendish-retirement\" target=\"_blank\">announcing his retirement</a> from professional cycling in May, the 38-year-old has signed a one-year contract extension with his Astana Qazaqstan team.</p>\n\n\n\n<p>The greatest sprinter of all time, Cavendish shares the <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\" target=\"_blank\">Tour de France</a> stage win record of 34 with Eddy Merckx. He was a whisker away from breaking the record on Stage 7 this year but had a gear issue while leading the sprint. The following day he crashed out of the race with a broken collarbone.</p>\n\n\n\n<p>Speaking about his postponed retirement, Cavendish said, ‘I was looking forward to not having to get up and train every day and not to be away from home for such a long time. I love cycling, I love racing, however I was happy with that decision.</p>\n\n\n\n<p>‘Obviously crashing out of the Tour de France was not the finish of my career that I hoped for. It is what it is. Alexander Vinokourov said to me after my crash, “Why don’t you do another year?” and my first reaction was not to change my decision. I was at peace with it.</p>\n\n\n\n<p>‘Then, I discussed it with my family, my kids and I got their answer: “You should carry on.”’</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/reviews/mark-cavendish-never-enough-netflix-documentary-review\">‘Mark Cavendish: Never Enough’ Netflix documentary review</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/tour-de-france-2023-week-1\">Tour de France Rest Day Recap: Jonas Vingegaard in yellow as Tadej Pogačar makes gains, Mark Cavendish crashes out of final Tour, Puy de Dôme returns after 35 years</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/gallery-the-day-mark-cavendish-equalled-eddy-merckxs-tour-stage-win-record\">Gallery: The day Mark Cavendish equalled Eddy Merckx’s Tour stage win record</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>Team manager Vinokourov said, ‘For the next year we are preparing thoroughly, seriously reviewing the squad, strengthening the sprint direction, making personnel changes. It won’t be easy to better the record he shares with Eddy Merckx, it would be a historic achievement, but we have a chance, and we have to use it.’</p>\n\n\n\n<p>One of the most successful cyclists to ever grace the road, Cavendish has won Milan-San Remo, Scheldeprijs, Kuurne-Brussels-Kuurne, the points classification in all three Grand Tours and the Road Race World Championships to name a few. It’s not only the numerous victories that Cavendish is championed for: in 2017 he was diagnosed with <a href=\"https://www.cyclist.co.uk/news/epstein-barr-virus-keeps-mark-cavendish-from-riding-hell-miss-the-tour-of-britain\" target=\"_blank\">the Epstein-Barr virus</a> and depression – which he opened up about in his Netflix documentary <em><a href=\"https://www.cyclist.co.uk/reviews/mark-cavendish-never-enough-netflix-documentary-review\" target=\"_blank\">Mark Cavendish: Never Enough</a></em> – and his comeback from the lowest of lows to win at the Tour once again was a story for the ages.</p>\n\n\n\n<p>The 2024 Tour de France begins in Florence, Italy and will not finish on the Champs-Élysées as Paris is hosting the Olympics, instead it will finish in a Nice time-trial, so he’s going to have to get his business done early if he is to break the record.</p>\n\n\n\n<p>35, anyone?</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/news/mark-cavendish-retirement-delay\">Mark Cavendish delays retirement to race for one more year in 2024</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Robyn Davidson &#124; Editorial Assistant","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"3634bc03a7c2f1d81f938632559b98c7525b0f44adf23cfb7d2abd578a00e715","category":"Cycling"}