{"title":"กฎของที่นี่คือไม่มีกฎ! ก.ล.ต. สหรัฐฯ แจ้งความอดีตวิศวกร Netflix 3 ราย ฐานใช้ข้อมูลการเงินซื้อขายหุ้นล่วงหน้า","link":"https://www.blognone.com/node/124308","date":1629357576000,"content":"<div><div><div><p>ก.ล.ต. สหรัฐฯ (SEC) แจ้งความ Sung Mo Jun, Ayden Lee, และ Jae Hyeon Bae อดีตพนักงานของ Netflix พร้อมกับผู้ใกล้ชิด Jun อีกสองคนฐานใช้ข้อมูลภายในของบริษัทเพื่อซื้อขายหุ้นก่อนเปิดเผยข้อมูลต่อสาธารณะ (insider trading) โดยระบุว่าบุคคลทั้ง 5 ทำกำไรได้ 3 ล้านดอลลาร์จากการใช้ข้อมูลภายในเหล่านี้</p>\n<p>คำฟ้องของ SEC ระบุว่าตัวการของเรื่องนี้คือ Jun ที่ใช้ข้อมูลตัวเลขสมาชิกของ Netflix มาซื้อขายหุ้น ตัวเขาเองเป็นพนักงาน Netflix ระหว่างปี 2016 ถึง 2017 และใช้ข้อมูลนี้เพื่อซื้อขายหุ้นโดยแจ้งข้อมูลนี้ให้กับพี่ชายและเพื่อนของพี่ชายด้วย หลังจาก Jun ออกจาก Netflix ไปแล้วก็ยังขอข้อมูลจากพนักงาน Netflix อีกสองรายต่อไป</p>\n<p>SEC ตรวจพบการใช้ข้อมูลภายในครั้งนี้จากการวิเคราะห์ข้อมูลการซื้อขายย้อนหลังเพื่อค้นหานักลงทุนที่ประสบความสำเร็จผิดปกติ</p>\n<p>Netflix เป็นบริษัทที่มีแนวทางเปิดเผยข้อมูลการเงินภายในให้กับพนักงานในบริษัทเป็นวงกว้าง หนังสือ No Rules Rules หรือชื่อหนังสือแปลไทยว่า \"NETFLIX กฎที่นี่คือไม่มีกฎ\" บรรยายถึงแนวทางการเปิดเผยข้อมูลภายในว่าบริษัทถือว่าทุกคนเป็นผู้ใหญ่ที่ต้องรับผิดชอบการกระทำของตัวเอง แม้บริษัทจะเปิดเผยข้อมูลผลประกอบการให้พนักงานรับรู้ก่อนเปิดเผยให้นักลงทุนนานหลายสัปดาห์แต่ก็เตือนพนักงานว่าอย่าใช้ข้อมูลเหล่านี้ไปซื้อขายหุ้นไม่เช่นนั้นจะต้องติดคุก ตัว Reed Hastings เองก็ระบุคาดการณ์ไว้ในหนังสือว่าสักวันจะมีคนนำข้อมูลนั้นไปใช้ แต่บริษัทก็จะยึดแนวทางแสดงความโปร่งใสในบริษัทต่อไป</p>\n<p>ที่มา - <a href=\"https://www.sec.gov/news/press-release/2021-158\">SEC</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f210e91c168d742c00c7a7ea8fc1f6be.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/sec\">SEC</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"364196ebe151b03ff1573aa8e977796f4107bb018a413e0efaef5b1b192f6876","category":"Thai"}