{"title":"How to be a bike racer in the U.S., as illustrated by Lance Haidet","link":"https://www.cyclingtips.com/2023/04/how-to-be-a-bike-racer-in-the-u-s-as-illustrated-by-lance-haidet/","date":1680791483000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/image_6487327-1-scaled-e1680731459597.jpg?width=1200\" alt=\"How to be a bike racer in the U.S., as illustrated by Lance Haidet\" /></figure><p>In many ways, Lance Haidet’s story is <em>the story </em>of modern American bike racing.</p>\n<p>From his almost accidental entree into the sport — burnout/overuse injury from a different sport, coupled with the realization that he was pretty good at riding bikes<em> — </em>to dabbling in multiple disciplines to try and see which one stuck, Haidet is just now coming into his own as an elite rider. And can you guess what discipline he sees the most opportunity in right now?</p>\n<p>Gravel. Or rather, endurance off-road.</p>\n<p>But, Haidet has also been with L39ION of Los Angeles since 2020, which makes him one of the rare trade team-supported athletes among the privateer set in gravel. It makes sense though, because Haidet nabbed U23 national championships on the road and in ‘cross after doing his due diligence on teams like Aevolo and Raleigh-Clement.</p>\n<p>While someone who wanted to finish college (Haidet recently graduated from Cal Poly with a degree in mechanical engineering) <em>and</em> race bikes professionally without being pinned to one discipline may have once seemed like a pipe dream reserved for a lucky few, Haidet’s career path is now aspirational.</p>\n<p>In fact, in the US, Haidet’s way is quite possibly the most realistic way to be a professional bike racer.</p>\n<p>I recently spoke to Haidet on the phone to learn more about his particular journey into the sport, why he’s shifting his focus to the Life Time Grand Prix this year, and what he thinks about being a professional ‘cyclist’ (vs. a professional ‘cross, MTB, gravel, or road racer).</p>\n<p><strong><em>CyclingTips:</em> OK, so is this a ‘been bike racing since childhood’ type of story or a ‘found bike racing after another sport’ type of story? </strong></p>\n<p><strong>Lance Haidet: </strong><span>Growing up in Bend [Oregon], I was a full-on soccer player. I also rode dirt bikes, did motocross stuff, and snowboarded. Once I got into middle school I realized I was good at endurance sports, so I was running a lot, XC and track. I started doing XC skiing in the winter, but I was continuing to play soccer, that was my focus at the time. I was on the ‘going to college to play soccer route,’ doing club stuff and Olympics development academy. </span></p>\n<p><span>My dad Sean was the guy that was like, ‘let’s get you out on a mountain bike. The riding here in Bend is awesome and it will help with the endurance aspects of what you’re doing. Then, when I was early in high school, a couple things drew me toward the bike. First, I started having some weird overuse injuries from playing soccer and was having a hard time training and running. The bike was a way I could train without it hurting. I started spending more time mountain biking. Also, that was when ‘cross nationals and the USGP were in Bend. So, growing up being a mountain biker and soccer player, I was like, ‘I wanna try this out.’ </span></p>\n<p><span>In 201o, ‘cross nationals was in Portland and someone loaned me a cross bike to use. I ended up fourth or fifth in my age group and it was like, ‘damn I could be kinda good at this, considering I didn’t train at all and made it happen.’</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/image_6483441.jpg?width=730\" alt=\"lance haidet\" width=\"1280\" height=\"853\" /><figcaption><span>Haidet goes gravel</span> (Photo: Taylor Chase)</figcaption></figure>\n<p><strong>CT: So, was that the end of your soccer career? </strong></p>\n<p><strong>LH:</strong> I played soccer ’til the end of my sophomore year, the injuries were continuing to nag. It was maybe a little bit of burnout, too, I’d played since I was seven. I still loved soccer, but the bike was awesome.<strong> <span>It played into my fitness, and I was having a blast doing it and soon enough I was motivated enough to ride a bike that the time conflict of soccer practice and travel was getting in the way of that. </span></strong></p>\n<p><span>Living in Bend and playing club soccer forever, I was making the trip over to Portland every weekend for a tournament. Quickly those trips to Portland became about bike racing rather than soccer. It was ‘cross in fall and winter and XC mountain biking in spring and summer. </span></p>\n<p><strong>CT:</strong> <strong>And somewhere along the line, you started racing on the road, right? You don’t become the U23 road national champ out of nowhere. </strong></p>\n<p><strong>LH: </strong><span>After a couple years of local racing in Oregon, I started hopping into some road racing to train for ‘cross and mountain biking to get more miles in my legs and learn the tactics of being a bike racer. One year, I was racing the Mt. Hood Classic cat 3 race against a lot of the guys from the Bear Development Team. At the time it was small and a road program for the most part. I linked up with them and got a guest ride spot for the Cascade Classic. I did well there and next thing you know I was racing for them and traveling down to California to race on the road. It was a big transition. </span></p>\n<p><span>From that point on, I was still very much focused on ‘cross in fall and winter but spring summer really transitioned to the road. I spent both years as a junior with Bear. I was good, never any huge results but very solid. Most of my focus and bigger results were on the ‘cross bike. Bear was supporting me with that. Then, as a second year junior, I got picked up by Raleigh-Clement. Jamie Driscoll, Kerry Werner, Caroline Mani — it was a big pro team at that time. Thanks to Don Kellogg, that was where my heart and soul was at and still is. </span></p>\n<p><span>Then through all of that, doing well in ‘cross and road, I was lucky enough to meet with Mike Creed as a first year u23, right when Aevolo was starting. I was super stoked to sign a contract with Aevolo as first year u23 and raced with them for my entire u23 career while continuing to do ‘cross and also going to school to be a mechanical engineer. </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/image_6483441-3-1-scaled-e1680731531449-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>Haidet races the road</span> (Photo: Kit Karzen)</figcaption></figure>\n<p><strong>CT: When did you hook up with L39ION? </strong></p>\n<p><span><strong>LH: </strong>Through my last year as a u23, I got to race with the national team and do Tour de l’Avenir and road world champs in Harrogate, but I was trying to figure out the next steps. At that point I was still very much in school. It was like, ‘am I gonna go try to find a road team to race for in Europe?’ There aren’t a lot of options in the US for road racing spots. I for sure wanted to keep racing ‘cross, but a couple road programs I was talking with were like, ‘we don’t really want you to race cross.’</span></p>\n<p><span>Through my good buddy and roommate Chris Blevins I was introduced to Justin Williams. We got on a call, and I was an athlete for L39ION within 35 minutes. So it all worked out. That was the very end of 2019, and I was racing ‘cross, getting prepped for nationals. </span></p>\n<p><strong>CT: Did you have to sell him on the fact that you didn’t want to just race road?</strong></p>\n<p><span><strong>LH: </strong>There was no real convincing I had to do. He knew what was up. He did ask, ‘I know you race a lot of ‘cross, what’s your feeling about it?’ I told him that’s where my heart is and I love it. Road racing is awesome as well, and I’d love to keep doing both, and he said well we’ll support you doing that. </span></p>\n<p><span>I was really stoked. I was super proud of what the team was doing and the momentum they had. And I was trying to figure out what I was doing and I was like, ‘this could be perfect.’ Now four years later we’re still together. </span></p>\n<p><strong>CT: You’re somewhat rare in the American off-road scene, being on a pro road team. I imagine that comes with its fair share of challenges?</strong></p>\n<p><strong>LH: </strong>It has its positives and negatives. As a racer who does enjoy racing multiple disciplines, being on a team that has a large presence at crit and road events, that’s amazing and there’s a lot of support there.</p>\n<p><span>I enjoy racing gravel and it’s awesome, and the [team] partners think it’s great as well. Through those partners I get amazing support. Sometimes I have to piece it together a little bit, but I’m always amazed at how willing and able to help out the partners are. </span></p>\n<p><span>I would say the challenging part for me is balancing the demands of what the team needs from me. This year they’re giving me the reigns to dictate my schedule a little more. Last year was challenging. They wanted me to race a lot on the road and I was also in the Grand Prix. Trying to balance all that with my last few quarters in school, I was a little all over the place. I felt like I was able to do well but was never quite … present and motivated or felt in control of the situation. </span></p>\n<p><span>So again, in talking with Justin and really laying out how I felt last year and the challenges and what I wanted to do this year and continuing to do the Grand Prix, he was super supportive and like, ‘hey we have a really good road squad and you’re a very helpful part of that but not necessarily like we’re gonna be screwed without you. We want you to focus on doing the GP and trying to focus on doing the best you can to win some of these big races. Help when you can with the road races, get some good speedwork, but we want you to really pursue your goals.’ Which is amazing, it could have been, ‘we need you to do this or you don’t have a contract. I’m definitely very grateful. </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/image_6483441-2-1-scaled-e1680731636754-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>Haidet races MTBs</span> (Photo: Kit Karzen)</figcaption></figure>\n<p><strong>CT: So, what are those goals? </strong></p>\n<p><strong>LH: </strong><span>It bums me out a lot, but ‘cross isn’t what it was 10 years ago when I was getting into it. As a professional, it’s challenging to make a living being a ‘cross racer. Most of the industry partners and momentum in American cycling right now is on the gravel side. The good thing is, I enjoy that as well. I’m definitely very focused on doing well in the Grand Prix and the gravel races this year. In the past, I’ve always felt a little restricted by school in one, my ability to put in a lot of miles each week, and two, I was always the one who flies into Kansas City the day before Unbound and send it just because I had school and midterms — it’s always on finals week. This year, finally having a little more time to prep and really focus on these events I’m hoping it will allow me to really do well.</span></p>\n<p><strong>CT: Do you still plan to race ‘cross? </strong></p>\n<p><span><strong>LH: </strong>Now with the Grand Prix going late into the season, it’s gonna be a challenge to make the transition to ‘cross. I still plan to, but I think with only one World Cup in the US this year, I’ll have to skip a lot of the early season. I really want to make a run at ‘cross nationals this year, which is in mid-December.</span></p>\n<p><span>The plan is to do the gravel season through mid October, then take a couple weeks to recover in late October, then November start ramping things back up with all eyes set on nationals. I wouldn’t say it’s the most ideal amount of time to turn the diesel engine into a high revving cyclocross engine, but I’m hoping that a lot of the base and work I do to get sharp for the later season gravel races will at least transfer.</span></p>\n<p><span>Then, I’m aiming toward world champs in late January/early February.</span></p>\n<p><strong>CT: Outside of ‘cross, I saw your name a lot, pretty high in the results of some major races. What races were particularly memorable and why? </strong></p>\n<p><span><strong>LH: </strong>BWR San Diego. Also Sea Otter, Unbound, and Leadville. Each one of those races, I started really well and found myself in the very select front group. Those were all events where all the big guys were and I was right there with them. Even though I was training 12-14 hours a week and going to school, I was right there with them. Granted from hour five I’d start cracking a bit or make a stupid mistake like flat or take a digger but, it was those races where I was like, ‘I belong here and I can do this.’</span></p>\n<p><span>This year, I’ve been on the podium twice and was sixth at BWR AZ after cramping a bit after fighting for fourth. I’m gonna give it everything this year to be on the podium and win one of these things. </span></p>\n<p><span><strong>CT: To me, you epitomize this notion of being a professional ‘cyclist’ vs a professional ‘cross, MTB, gravel, or road racer. What do you think about that? Is being well-rounded the only way to make a living as a bike racer in the US right now? </strong></span></p>\n<p><span><strong>LH: </strong>I would say it’s definitely an American thing. The European tradition is very much defined, even though you have Wout, Mathieu, and Pidcock doing it all. But you don’t see Nino [Schurter] hopping in to a lot of other disciplines or a lot of the road guys hopping into ‘cross or mountain biking a lot of the time. But here in the US you aren’t a professional bike racer unless you’re doing all these races and hopping across multiple disciplines. </span></p>\n<p><span>I think there’s definitely positives and negatives to that. I think one, racing a lot of disciplines you really get to see all the different aspects of cultures within cycling in America which I think is super cool. The downside is that, from the athlete standpoint it’s really challenging to be really good and really focused on a lot of different disciplines.</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/image_6483441-4-1340x1070.jpg?width=730\" alt=\"lance haidet\" width=\"1340\" height=\"1070\" /><figcaption><span>Haidet is a bike racer</span> (Photo: Bill Schieken)</figcaption></figure>\n<p><span>Because my background was in riding mountain bikes and dirt bikes as a little kid, I feel like it’s fairly natural for me. If I was a pure roadie growing up and now it was like, I have to perform on a mountain bike, that would be very challenging. So my background is important in that way. </span></p>\n<p><span>In terms of training, for sure there’s a challenge in being well-prepared for a nine hour Unbound day and racing something like Sea Otter or Chequamegon that’s short and punchy. </span><span>It really takes a lot of focus and planning throughout the year and being pretty diligent with my coach and my strength trainer. </span></p>\n<p><span>It’s good fun. The aspect of being a traditional professional bike racer where you’re a robot riding your bike on the road, putting in tons of miles every day, this type of racing doesn’t feel really dynamic and exciting. Just for me, that aspect of it is what keeps me motivated and wanting more because there’s always room for improvement in each one of those disciplines.</span></p>\n<p><span>Look at the week between Sea Otter and BWR — we’re racing BWR California Sunday, then there’s team camp Monday, Tuesday, and Wednesday, then to Sea Otter on Thursday. </span></p>\n<p><span>Gravel bike Sunday, road bike Monday, Tues, Weds, hop on the mountain bike Thursday, race Saturday, there you go. It’s an exciting life.</span></p>\n<p> </p>\n<p> </p>\n<p> </p>","author":"Betsy Welch","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"36551406437c5c460eff7f587e1454568c8caba5ae28bfb64cf967b04f56cf70","category":"Cycling"}