{"title":"Nonlinear Lateral Stability of 4-Axle Freight Car with the Y25 Bogies and the Measures to Improve Its Faults","link":"https://www.preprints.org/manuscript/202404.1140/v1","date":1713341547000,"content":"The article presents investigations of rail vehicle bogie of Y25 type. The Y25 bogie family is one of the most commonly used freight car bogie designs. In addition to several significant advantages characterising this design, it also has several disadvantages observed since the beginning of more than fifty years of operation in several types of cargo vehicles. One of these defects observed in real systems is \"unsatisfactory running stability\", particularly at long straight tracks. The article used commercial engineering software VI-Rail to create a model of the gondola car (type 412W Eaos) with two Y25 bogies. The car model was tested empty and loaded (maximum permissible load). Motion along straight and curved tracks with different radii values was analysed. The vehicle velocity was changed from a few m/s to the maximum values for which stable solutions of the model existed. For each route, a non-linear critical velocity was determined, defining the maximum operating velocity of the modelled car. The model solutions were recorded, while just one was selected to present the results - the first wheelset lateral displacement ylw. The opinion about the \"imperfect running quality\" in curved tracks was confirmed. The possible appearance of self-exciting wheelset vibrations in the modelled car's operating velocity range in the laden state was also observed. The research results on the impact of the bogie suspension parameters change on the vehicle model stability are presented. The crucial parameter in the bogie suspension was indicated. Reducing its value by several percent about the nominal value increases the critical velocity of the car to values higher than the maximum operating velocity of the modelled vehicle.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3655ae611016827e1b05952573716e289111ddc05de6b88206573b808e382960","category":"Interdisciplinary"}