{"title":"Apple Support App Now Offers More Info on Nearby Locations","link":"https://www.macrumors.com/2023/08/21/apple-support-app-nearby-locations/","date":1692640415000,"content":"Apple today updated its Apple Support app to be more useful to customers who are looking to get help from a nearby Apple retail location or authorized repair shop.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/apple-support-app-update.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nWhen searching for a store using the \"Locations\" feature in the app, there's now a Good to Know section and a Store Hours section, both of which are new.\r<br />\n\r<br />\nIn Good to Know, Apple lists information like accessibility options and whether a store location offers product recycling. The Store Hours shows the upcoming hours for each location on a specific date basis. Rather than just listing Monday-Sunday hours, Apple has a list for the upcoming dates, which gives up-to-date information should store hours change for an event or environmental issue.\r<br />\n\r<br />\nApple's notes for the update:<blockquote>Added helpful information about nearby locations, including store hours, accessibility details, and specialty services available\r<br />\n\r<br />\nPerformance enhancements and bug fixes</blockquote>The Apple Support app is designed to allow customers to search for help with their products, get service for issues, and check <a href=\"https://www.macrumors.com/guide/applecare/\">AppleCare</a>+ status. Apple has been working to improve the app over the last several years, and there are sections for help with specific devices and services, as well as options to track service requests and get help in person.\r<br />\n\r<br />\nThe Apple Support app can be downloaded from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> for free. [<a href=\"https://apps.apple.com/us/app/-/id1130498044\">Direct Link</a>]<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-support/\">Apple Support</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/21/apple-support-app-nearby-locations/\">Apple Support App Now Offers More Info on Nearby Locations</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-support-app-now-offers-more-info-on-nearby-locations.2399235/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3659933bca4d29dafbd28b5b5c3cbe264f0abf86631f181b2a0040236adabe69","category":"Apple"}