{"title":"18F-FDG PET/CT in LV-GCA during Active and Inactive Disease Stages Is Associated with the Metabolic Profile, but Not the Macrophage-Related Cytokines: Results of an Integrated Analysis","link":"https://www.preprints.org/manuscript/202406.1940/v1","date":1719479780000,"content":"Abstract: Giant Cell Arteritis (GCA) is an autoimmune/autoinflammatory disease affecting large vessels in patients over 50 years old. The disease presents as an acute inflammatory response with two phenotypes, cranial-GCA and Large Vessel Vasculitis (LV)-GCA, involving the thoracic aor-ta and its branches. 18F-fluorodeoxyglucose positron emission tomography-computed tomogra-phy (18F-FDG PET-CT) is among the imaging techniques contributing to diagnosis of patients with systemic disease. However, its association with soluble inflammatory markers is still elu-sive. This proof-of-concept study aims to identify novel soluble serum biomarkers in PET/CT pos-itive patients with LV-GCA and associate them with active (0 months) and inactive disease (6 months following treatment), in sequential samples. The Most-Disease-Segment Target-to-Background Ratio (TBRMDS) was calculated for 9 LV-GCA patients, while 12 cranial-GCA and 7 Polymyalgia Rheumatica patients with negative initial PET/CT served as disease controls. Serum macrophage-related cytokines were evaluated by Cytometric Bead Array (CBA). Finally, previously published NMR-metabolomics data acquired at the same blood sampling were associated with PET/CT findings. TBRMDS was significantly increased in active versus inactive disease (3.45 vs. 2.55, p=0.008). The analysis identified 6 serum metabolites, as more sensitive to change from the active to inactive state. Among them, choline levels were exclusively altered in the LV-GCA group, but not the disease controls. Cytokine levels were not associated with PET/CT activity. Combining with CRP, ESR, and TBRMDS a composite index was generated to depict well the differences between active and inactive systemic LV-GCA (25.45 vs 11.45, p=0.0039). These preliminary results could pave the way for more extensive studies integrating serum metabolomic parameters with PET/CT imaging data to extract sensitive composite disease indexes useful for the everyday clinical practice.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"365c19818706cb3ed1c9f2465baf95d434ebc0521b1b6ee784f2b6288dc3f058","category":"Interdisciplinary"}