{"title":"Population attributable fractions of cancer mortality related to indoor air pollution, animal contact, and water source as environmental risk factors: Findings from the Golestan Cohort Study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304828","date":1718028000000,"content":"<p>by Negar Rezaei, Maryam Sharafkhah, Yalda Farahmand, Sadaf G. Sepanlou, Sahar Dalvand, Hossein Poustchi, Alireza Sajadi, Sahar Masoudi, Gholamreza Roshandel, Masoud Khoshnia, Layli Eslami, Mahboube Akhlaghi, Alireza Delavari</p>\r\nBackground <p>Environmental risk factors are significant contributors to cancer mortality, which are neglected.</p> Purpose <p>This study aimed to estimate the population attributable fraction of cancer mortality due to the environmental risk factors.</p> Methods <p>Golestan cohort study is a population-base cohort on 50045 participants between 40–75 with about 18 years of follow up. We detected 2,196 cancer mortality and applied a multiple Cox model to compute the hazard ratio of environmental risk factor on all cancer and cancer-specific mortality. The population attributable fraction was calculated, accordingly.</p> Results <p>Biomass fuels for cooking, as an indoor air pollution, increased the risk of colorectal, esophageal, gastric cancer, and all-cancer mortality by 84%, 66%, 37%, and 17% respectively. Using gas for cooking, particularly in rural areas, could save 6% [Population Attributable Fraction: 6.36(95%CI: 1.82, 10.70)] of esophageal cancer, 3% [Population Attributable Fraction: 3.43 (0, 7.33)] of gastric cancer, and 6% [Population Attributable Fraction: 6.25 (1.76, 13.63)] of colorectal cancer mortality. Using a healthy tap water source could save 5% [Population Attributable Fraction:5.50(0, 10.93)] of esophageal cancer mortality, particularly in rural areas. There was no significant association between indoor air pollution for heating purposes and animal contact with cancer mortality.</p> Conclusion <p>Considering the results of this study, eliminating solid fuel for most daily usage, among the population with specific cancer types, is required to successfully reduce cancer related mortality. Adopting appropriate strategies and interventions by policymakers such as educating the population, allocating resources for improving the healthy environment of the community, and cancer screening policies among susceptible populations could reduce cancer related mortalities.</p>","author":"Negar Rezaei","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"366bea8c24d293f4ae14b8fc1eee757ed046a7fddc8007817c9cc0a0126fc628","category":"Interdisciplinary"}