{"title":"Differences in risky sexual behaviors and HIV prevalence between men who have sex with men and transgender women in the Midwest Brazil","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003061","date":1715004000000,"content":"<p>by Gabriela Alves Cesar, Bárbara Vieira do Lago, Tayana Serpa Ortiz Tanaka, Priscila Brunini Zanini, Larissa Melo Bandeira, Marco Antonio Moreira Puga, Fernanda Rodas Pires Fernandes, Clarice Souza Pinto, Lisie Souza Castro, Lívia Garcia Bertolacci-Rocha, Carlos Eurico dos Santos Fernandes, Grazielli Rocha de Rezende, Ana Rita Coimbra Motta-Castro</p>\r\n\r\nMen who have sex with men (MSM) and transgender women (TW) are disproportionally affected by HIV infection. This cross-sectional study evaluated the HIV-1/2 prevalence, risk factors and HIV molecular features of MSM and TW from Midwest Brazil. Four hundred and thirty participants (278 MSM and 152 TW) from Mato Grosso do Sul, Brazil, were interviewed and tested for HIV-1/2 infection between November 2011 and September 2013. Participants who were assigned male at birth, older than 18 years old and self-declared as MSM or TW were recruited from LGBT+ associations, as well as public (parks, square, streets, etc) and private [nightclubs, saunas, brothels, etc] places. The prevalence of HIV-1 was 14.4% (9.0% among MSM and 24% among TW; p&lt;0.001). The factor independently associated with HIV-1 infection among MSM was being 30 years-old or older. Among TW, having suffered sexual coercion, lifetime syphilis infection and hepatitis C virus exposure were associated with HIV-1 infection. Phylogenetic analyses classified 65% sequences as subtype B and 35% as possible recombinants. All but one recombinant sample were from TW individuals. High HIV-1 prevalences were observed in both groups, highlighting the urgent need to devise specific HIV interventions targeting these key populations. Notably, TWs are more vulnerable to HIV infection, which was associated with sexual violence and co-infection with other STIs. With regard to MSM, being 30 years old or older was significanty associated to HIV, reinforcing the idea that MSM are less exposed [or exposed later] to STIs than TWs, although MSM are clearly more vulnerable than the general population.","author":"Gabriela Alves Cesar","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"366dcd0412e022648c5a9e7e4dc04c032635304972b25d0a3f00c6c4a912cdd2","category":"Environment"}