{"title":"iPhone 15 Pro Solid-State Button Sensitivity Can Be Customized to Cater for Cases and Gloves","link":"https://www.macrumors.com/2023/03/31/iphone-15-pro-solid-state-button-sensitivity/","date":1680244562000,"content":"iPhone 15 Pro and iPhone 15 Pro Max users will be able to customize the sensitivity of the solid-state buttons on their device, thanks to a new sensitivity toggle in Settings. That's according to details provided by a hitherto reliable source that <a href=\"https://forums.macrumors.com/threads/capacitive-buttons-on-iphone-15-pro-models-use-a-new-micro-processor-to-manage-button-presses-and-enhanced-find-my-support-while-the-phone-is-off.2385131/post-32067217\">shared additional details on the <em>MacRumors</em> forums</a>. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/iPhone-15-Pro-Multi-Purpose-button-Mute-Switch-Feature-Green-2.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nEarlier this week, the same anonymous tipster revealed that the iPhone 15 Pro models will use a <a href=\"https://www.macrumors.com/2023/03/29/iphone-15-pro-low-energy-microprocessor/\">new ultra-low energy chip</a> allowing the new volume, power, and \"Action\" solid-state buttons to remain functional when the handset is powered off or out of battery. \r<br />\n\r<br />\nSome iPhone users immediately raised concerns about how the new capacitive buttons will work properly when a case is fitted or when gloves are worn. In response, the tipster has revealed that iOS 17 will include a new toggle in Settings that will enable users to customize the sensitivity of the buttons to accommodate these different usage scenarios.\r<br />\n\r<br />\niPhone case makers typically receive design details about Apple's upcoming models ahead of launch that allows them to make tweaks for button positioning and other external changes. Combined with the new sensitivity setting, this should avoid any potential issues with the peculiarities of the new capacitive buttons, which will detect presses, holds, and respond to various levels of pressure via the use of a new Force Touch-style mechanism and Taptic Engine feedback.\r<br />\n\r<br />\nIn line with previous rumors, solid-state capacitive buttons are expected to be exclusive to the iPhone 15 Pro models, with the standard iPhone 15 models retaining the same traditional button mechanism as on the iPhone 14 series. The iPhone 15 Pro is also gaining a new <a href=\"https://www.macrumors.com/2023/03/29/iphone-15-pro-action-button-rumor/\">customizable Action button</a> in lieu of the mute switch, with a unified volume button replacing the separate up/down volume buttons. \r<br />\n\r<br />\nThe iPhone 15 series is expected to be announced in September, as per Apple's typical iPhone launch timeframe. For everything else we know about the new iPhone 15 series, check out our dedicated roundups using the links below.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a>, <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/31/iphone-15-pro-solid-state-button-sensitivity/\">iPhone 15 Pro Solid-State Button Sensitivity Can Be Customized to Cater for Cases and Gloves</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-pro-solid-state-button-sensitivity-can-be-customized-to-cater-for-cases-and-gloves.2385419/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3673d3c2707a46677aef196d3cb13bf4b121886b74d442bdd37da3f541e6d524","category":"Apple"}