{"title":"Spatial‐Temporal Differentiation of Supra‐ and Sub‐Permafrost Groundwater Contributions to River Runoff in the Eurasian Arctic and Qinghai‐Tibet Plateau Permafrost Regions","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035913?af=R","date":1710486000000,"content":"<h2>Abstract</h2>\n<p>Supra- and sub-permafrost groundwater are the two main components of groundwater in permafrost regions. However, due to the lack of groundwater observational data, the spatial-temporal differentiation of these groundwater components in permafrost basins remains unclear. Based on flow data from 17 hydrological stations in five permafrost rivers within the Eurasian Arctic and Qinghai-Tibet Plateau permafrost regions, this study tries to determine the proportion of supra- and sub-permafrost groundwater through the corresponding relationship between baseflow separation and baseflow index. The results showed that the annual average contribution of supra- and sub-permafrost groundwater in river runoff to total streamflow in the Yangtze River source basin was 36.81% and 14.56%, respectively. Correspondingly, the Yellow River source basin was 36.58% and 24.46%, the Ob River basin was 37.05% and 26.83%, the Yenisei River basin was 28.80% and 36.56%, and the Lena River basin was 39.13% and 9.54%. Over the past 50–80 years, the ratio of sub-permafrost groundwater discharge to river runoff and the flux of sub-permafrost groundwater have shown an increasing trend in all study basins, which was significantly affected by air temperature and permafrost area. Relative contribution of supra-permafrost groundwater exhibits a significant positive correlation with precipitation and permafrost area. Air temperature has both positive and negative effects on supra-permafrost groundwater discharge, leading to a rising or falling trend of supra-permafrost groundwater discharge. In the future, it is necessary to further explore the complex effects of groundwater discharge variations on streamflow in permafrost regions under climate warming.</p>","author":"Zhiwei Wang, \nShouqin Sun, \nGenxu Wang, \nChunlin Song","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"36839b946e8e727e9b1b8bf0745b6414babe4fb2dfa60dd7fe24fc6f7864bf69","category":"Environment"}