{"title":"Impact Evaluation of NO and SO2 Reduction by Biochar Characteristics","link":"https://www.preprints.org/manuscript/202408.0586/v1","date":1723099715000,"content":"Biochar has a carbon-based porous structure that is advantageous for adsorbing air pollutants. The pore structure of biochar ranges from several tens to hundreds of m²/g depending on the production temperature. We compared the pore characteristics of biochar with its NOx and SOx adsorption performances to evaluate its adsorbing potential. Biochar was produced from cypress biomass via slow pyrolysis in a fixed-bed reactor and CO2 partial gasification. Slow pyrolysis experiments at 500–700°C were conducted to produce biochar, followed by yield, proximate, elemental, and surface area analyses. CO2 partial gasification activated the biochar produced by slow pyrolysis at the same temperature, and similar analyses were performed. NO and SO2 adsorption experiments were conducted separately and together for biochar produced under each condition. Biochar produced at 600°C showed the highest specific surface area. CO2 partial gasification increased the surface area at each temperature, reaching 680.3 m²/g at 700°C. In single adsorption experiments, N2 carbonized biochar showed NO and SO2 adsorption efficiencies of 84–90% and 88.2–91.4%, respectively, with similar trends in simultaneous adsorption experiments. CO2 activated biochar exhibited higher adsorption efficiencies due to its increased surface area, with NO and SO2 adsorption at 89.8–93.9% and 92–98.9%, respectively. Biochar activated at 700°C simultaneously adsorbed approximately 99% NO and SO2. The NO adsorption efficiency increased with increasing surface area of the small pores, whereas the SO2 adsorption efficiency improved with the development of both small and large pores.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3688550e96fc8174397da01459cf9026342ab6095f18e59c7822db07a87c025c","category":"Interdisciplinary"}