{"title":"Apple ‘Still Investigating’ Unpatched and Public iPhone Vulnerabilities Originally Reported in March","link":"https://www.vice.com/en/article/g5gan4/apple-still-investigating-unpatched-and-public-iphone-vulnerabilities","date":1632944445000,"content":"\n<p>Lorenzo Franceschi-Bicchierai, reporting for Motherboard:</p>\n\n<blockquote>\n  <p>On Thursday, <a href=\"https://www.vice.com/en/article/k78dpx/researcher-publishes-source-code-for-three-unpatched-iphone-exploits\">a security researcher published details of three\niPhone vulnerabilities</a> that are unpatched as of today. The\nsecurity researcher, whose name is Denis Tokarev, said he decided\nto publish the bugs’ details as well as the source code that makes\nit extremely easy to reproduce and exploit them, because he was\ntired of waiting and felt like Apple ignored him.</p>\n\n<p>Tokarev reported the vulnerabilities to Apple between March 10 and\nApril 29, but the last time he heard back from Apple about the\nthree vulnerabilities was August 6, August 12, and August 25,\nrespectively. Then the researcher said he told Apple on September\n13 he would publish details of the bugs unless he heard back.</p>\n\n<p>It was only after he went public with details about the unpatched\nbugs that Apple reached out, according to Tokarev, who shared\nApple’s email with Motherboard.</p>\n\n<p>“We saw your blog post regarding this issue and your other\nreports. We apologize for the delay in responding to you,” an\nApple employee wrote. “We want to let you know that we are still\ninvestigating these issues and how we can address them to protect\ncustomers. Thank you again for taking the time to report these\nissues to us, we appreciate your assistance. Please let us know if\nyou have any questions.”</p>\n</blockquote>\n\n<p><a href=\"https://habr.com/en/post/580272/\">Tokarev, in his follow-up post</a>:</p>\n\n<blockquote>\n  <p>Indeed, I do have questions.</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/09/29/tokarev-apple-bug-bounties\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"3690944efce5f55009f7abee4a659d077b4ee1ab4ff619510a49a4a0b020163c","category":"Tech"}