{"title":"Correlates of susceptibility to waterpipe tobacco smoking in young adults","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307058","date":1721138400000,"content":"<p>by Mahmood A. Alalwan, Lauren Long, Elise M. Stevens, Brittney Keller-Hamilton, Andrea C. Villanti, Glenn Leshner, Theodore L. Wagener, Darren Mays</p>\r\nIntroduction <p>Many US young adults are susceptible to waterpipe (i.e., hookah) tobacco smoking (WTS) initiation, but research on factors associated with WTS susceptibility is limited. We examined sociodemographic, other tobacco and substance use, and attitudes and perceptions correlates of WTS susceptibility among young adults.</p> Methods <p>Baseline data from a randomized trial testing WTS risk messages was collected in US young adults aged 18 to 30 years who never used waterpipe tobacco but were susceptible to WTS (n = 294). Extent of susceptibility to WTS was defined using the average score of a valid scale with higher scores indicating higher susceptibility. Correlates were sociodemographics, other tobacco and substance use, and attitudes and perceptions. Multiple linear regression models identified correlates of greater WTS susceptibility.</p> Results <p>Participants averaged 25 (SD 3.2) years of age, 60% were male, 22% were Black non-Hispanic, 47% completed some college education, and 66% were employed. Our models consistently showed that more positive attitudes toward WTS (<i>β</i> = -0.08, <i>p</i>&lt;0.01), lower perceived addictiveness relative to cigarettes (<i>β</i> = -0.09, <i>p</i> = 0.04), and greater perceived social acceptability of WTS (<i>β</i> = 0.05, <i>p</i>&lt;0.01) were positively correlated with WTS susceptibility. Additionally, young adults who smoked cigarillos (<i>β</i> = 0.53, <i>p</i>&lt;0.01), used cannabis (<i>β</i> = 0.14, <i>p</i> = 0.02), and Black non-Hispanic versus White non-Hispanic young adults (<i>β</i> = 0.18, <i>p</i> = 0.03) also had higher WTS susceptibility.</p> Conclusions <p>Findings suggest that WTS prevention efforts require multicomponent interventions including targeting subpopulations at greater risk based on race/ethnicity and other tobacco and substance use. These interventions should consider attitudes and social acceptability of WTS as modifiable targets to maximize public health benefits.</p>","author":"Mahmood A. Alalwan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3691d21e1996a5d125804f9d760fba3eb220106a99ce696c9ada04a3b8bae75a","category":"Interdisciplinary"}