{"title":"Synthesis and characterization of new nanocomposite Cu6W18O70⊂CuFe2O4 as an efficient nanocatalyst for oxidative desulfurization of real and model gasoline","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300079?af=R","date":1717657200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6f846db7-a0e8-4427-b994-0463bb253ec2/appl202300079-gra-0001-m.png\" alt=\"Synthesis and characterization of new nanocomposite Cu6W18O70⊂CuFe2O4 as an efficient nanocatalyst for oxidative desulfurization of real and model gasoline\" /><p>In this work, a high-performance nanocomposite (Cu<sub>6</sub>W<sub>18</sub>O<sub>70</sub>⊂CuFe<sub>2</sub>O<sub>4</sub>) was synthesized and employed as a nanocatalyst in the oxidative desulfurization (ODS) process. The catalytic activity of the nanocatalyst was investigated in the ODS of model/real fuel in the presence of acetic acid/hydrogen peroxide (volume ratio of 1:2). The results indicated that mercaptan removal percentages and total sulfur content in real gasoline were up to 95%. Moreover, the heterogeneous catalyst was successfully isolated and recovered over five successive runs.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The primary objective of this investigation was to develop a new nanocatalyst that could produce materials with a lower sulfur content, thereby reducing its environmental harm. To achieve this, the researchers used the sol-gel method to synthesize a heterogeneous nanocatalyst by attaching sandwich-type polyoxotungstate [(CuW<sub>9</sub>O<sub>34</sub>)<sub>2</sub>Cu<sub>4</sub>(H<sub>2</sub>O)<sub>2</sub>\n<sup>−10</sup>] (denoted as Cu<sub>6</sub>W<sub>18</sub>O<sub>70</sub>) clusters on the surface of copper ferrite nanoparticles (CuFe<sub>2</sub>O<sub>4</sub> NPs). To characterize the nanocatalyst, several analysis techniques were employed, including Fourier transform infrared spectroscopy, ultraviolet-visible, powder X-ray diffraction, and scanning electron microscope. The oxidative desulfurization of hazardous sulfur-containing real and model fuel oils was effectively catalyzed by the Cu<sub>6</sub>W<sub>18</sub>O<sub>70</sub>⊂CuFe<sub>2</sub>O<sub>4</sub> nanocatalyst. According to the experimental findings, the best efficiencies in oxidation reaction were achieved in 1 h contracting time at 35°C, which was as high as 95%. The Cu<sub>6</sub>W<sub>18</sub>O<sub>70</sub>⊂CuFe<sub>2</sub>O<sub>4</sub> nanocatalyst exhibited impressive removal rates (%) on dibenzothiophene (C<sub>12</sub>H<sub>8</sub>S), benzothiophene (C<sub>8</sub>H<sub>6</sub>S), and thiophene (C<sub>4</sub>H<sub>4</sub>S) of model fuels, with figures reaching 97%, 96% and, 96% respectively. Furthermore, multiple recycling of the uniform nanocatalyst can be achieved effortlessly through filtration, without experiencing any notable decline in activity. Therefore, the authors suggest that this study will pave the way for the widely used mentioned nanocatalyst in the practical and workable organization of petroleum fractions.</p>","author":"Mohammad A. Rezvani, \nAli Bakhtiyari, \nAlireza Imani","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"3698ebaf09a609503e7ad1881e374c10c10d2d8c5b65629a86c567f2e6ee0719","category":"Environment"}