{"title":"Traffic Intensity as a Factor Influencing Microplastic and Tire Wear Particle Pollution in Snow Accumulated on Urban Roads","link":"https://www.preprints.org/manuscript/202409.1594/v1","date":1726825730000,"content":"Communication pathways are an underestimated source of synthetic particles in the environment. This study investigated the impact of traffic volume on microplastics (MPs) and tire wear particles (TWPs) pollution in road snow. An examination was conducted in a medium-sized city situated in northeastern Poland, known for being one of the cleanest regions in the country. MPs and TWPs were found at all 53 sites, regardless of the intensity of traffic. The average concentration for all samples was 354.72 pcs/L. Statistically significant differences were found between the average values of particles concentration on low, medium, and heavy traffic roads amounted 62.32 pcs/L, 335.97 pcs/L and 792.76 pcs/L respectively. Within all three studied groups of roads, MPs and TWPs with the smallest size, ranging from 50 to 200 μm, were prevalent.  In all studied groups of roads, 4 analyzed shapes of particles were found, with irregular fragments being the most abundant form (89.23%). The most frequently recorded color among the collected samples was black (99.85%), and the least frequently recorded was blue, constituting only 0.01%. This study suggests that snow cover on the roads may act like temporary storage of pollutants during winter in the temperate climate zone and after thaw can significantly increase the concentration of MPs and TWPs in surface waters.  Possible measures to decrease the release of MPs and TWPs into the environment in the city may include reducing traffic volume and speed, implementing street sweeping, utilizing filtration chambers, and installing stormwater bioretention systems or settling ponds.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"36a05485224422b82af1819e72e0512e121c83d35649fcddceb5bf4a2d92d985","category":"Interdisciplinary"}