{"title":"Web Design Done Well: The Ordinary Made Extraordinary (Part 1)","link":"https://smashingmagazine.com/2021/04/web-design-done-well-part1/","date":1619100000000,"content":"<p>Great ideas in web design come so thick and fast that it can be easy to miss them if you’re not careful. This series is a small antidote to that, piecing together splashes of inspiration that caught our eye. Whether it’s a mind-bending new feature or simply an old trick delivered with new elegance, they share the quality of making us think a little differently.</p>\n<p>I recently wrote a piece lauding <a href=\"https://www.smashingmagazine.com/2021/02/saul-bass-teach-web-design/\">the work of Saul Bass in the world of web design</a>. One of his great gifts was making even the tiniest details beautiful. It is in that same spirit we kick off this series by honing in on website trends and features we’ve grown accustomed to being dull. As you’ll see, they needn’t be. The trick is often in the execution. Just about anything can be beautiful. Why aim for anything less?</p>\n<h3>Glasgow International’s Pages Within Pages</h3>\n<p>We’re used to plenty of scrolling these days, but <a href=\"https://glasgowinternational.org/\">the Glasgow International festival website</a> has found a simple, clever way to scratch that itch while keeping pages short:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/139771eb-a769-4458-a850-4f9685ce1351/5-websites-inspiring-us-to-think-differently-part-1.png\" /></p>\n<p>On mobile, the same three sections form one big column. It’s a savvy solution to the mobile/desktop relationship, and a pretty stylish one too. (Shout out to the ‘Support’ button, which starts spinning when you hover on it.)</p>\n<p>The CSS behind this is suitably simple. The three sections sit inside a flex container, with all three sharing the values of <code>overflow-y: auto;</code> and <code>height: 100vh;</code> so that they always fit the desktop viewport. The really nice touch here is using <code>scrollbar-width: auto;</code> to remove the sidebar. Because the columns take up the whole screen you intuitively work out the way the page works as soon as you move your mouse.</p>\n<h3>Kenta Toshikura’s Dimension-Bending Portfolio</h3>\n<p>A recent site of the week on Awwwards, this <a href=\"https://kentatoshikura.com/\">portfolio website by Japanese frontend developer Kenta Toshikura</a> is simply breathtaking:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/02172e03-5137-4cb0-bcf9-f68b816aa350/7-websites-inspiring-us-to-think-differently-part-1.png\" /></p>\n<p>If in doubt, the tendency is to lean towards flat, modular arrangements, but maybe we should be <strong>thinking in three dimensions</strong> a little more often. This is a fantastic example of lateral thinking transforming what could easily have been a column of boxes into something truly memorable. </p>\n<p>We may not all be equipped to do something quite this fancy (I’m certainly not) but it’s well worth remembering that web pages aren’t blank canvases so much as they are windows into alternate dimensions.  </p>\n<h3>Stripe Documentation Is The Teacher We All Want</h3>\n<p>Documentation is all too often one of the first casualties of the Web’s mile-a-minute pace. It needn’t be. I have no qualms calling <a href=\"https://stripe.com/docs\">Stripe</a>’s documentation beautiful:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f04af1cd-b23b-40fd-9072-d7d12494f4ab/3-websites-inspiring-us-to-think-differently-part-1.png\" /></p>\n<p>I’m sure most of us have ground through enough bad documentation to appreciate the effort put into this approach. Clear, hierarchical navigation for the content, bite-sized step-by-step-copy, and of course the code snippets. Dynamic previews of code across multiple platforms and languages is above and beyond, but then why shouldn’t it be? </p>\n<p>There are few things more valuable — and more elusive — than quality learning resources. Stripe shows there is <strong>a world of possibilities</strong> online beyond the standard words on a page. I’ve shared this before (and I’ll share it again) but <a href=\"https://www.writethedocs.org/guide/\">Write the Doc’s documentation guide</a> is a smashing resource for presenting informative content in useful, dynamic ways. </p>\n<h3>Max Böck’s Technicolor Dream</h3>\n<p>There is an awful lot to like about <a href=\"https://mxb.dev/\">Max Böck’s personal website</a>, but for the purposes of this piece, I’m honing in on color schemes. Most websites have one color scheme.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3c47b3c5-01d4-4701-a031-a5446332ce79/4-websites-inspiring-us-to-think-differently-part-1.png\" /></p>\n<p>Light and dark is the new normal, but as Böck himself writes in <a href=\"https://mxb.dev/blog/color-theme-switcher/\">his blog post about the theme switcher</a>, only Siths deal in absolutes. Through the magic CSS custom properties the site switches between <strong>color schemes</strong> seamlessly. For a full breakdown of how it works I heartily recommend reading the full post linked above. And for further reading on custom properties <em>Smashing</em> has plenty too:</p>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2020/08/application-color-schemes-css-custom-properties/\">How To Configure Application Color Schemes With CSS Custom Properties</a>” by Artur Basak</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2018/05/css-custom-properties-strategy-guide/\">A Strategy Guide To CSS Custom Properties</a>” by Michael Riethmuller</li>\n</ul>\n<p>The themes are named after <em>Mario Kart 64</em> tracks, if you were wondering. Except Hacker News. That’s named after <a href=\"https://news.ycombinator.com/\">Hacker News</a>, with the marvellous touch of adding ‘considered harmful’ to the end of every single Böck blog post title.</p>\n<p>It’s a fun twist on the traditional light/dark dichotomy, and also speaks to just <strong>how fluid sites can be nowadays</strong>. The same groundwork could allow you to adjust color schemes depending on where people are visiting the site from, for example. </p>\n<h3>Overpass Sells Sales</h3>\n<p>Sales isn’t exactly a sector that screams innovation, but credit where credit is due. <a href=\"https://www.overpass.com/\">Overpass</a>’s carousels bounce and shrink and expand so smoothly that it almost feels like you’re interacting with something tactile, like a rubber band.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9f74fb9f-1313-4362-984e-def1c2e5bfa6/2-websites-inspiring-us-to-think-differently-part-1.png\" /></p>\n<p>Here, both the <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/touch-action\"><code>touch-action</code></a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/translate3d(\"><code>translate3d()</code></a>) CSS functions are used to great effect, making the cards container something that can be effectively dragged around the screen. In the event of the container being grabbed, all cards use <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/scale(\"><code>scale(0.95)</code></a>) to recede ever so slightly until the user lets go. It gives the carousel a lovely sense of depth and lightness.</p>\n<p>The audio clips are a nice touch. <strong>Multimedia integration</strong> has been a running theme in these examples. Always lay the accessibility groundwork, but be bold. At this stage the only real limits are those of our imaginations. </p>\n<h3>E-Commerce Meets Long Form Storytelling On Mammut</h3>\n<p>From Steve Jobs to Seth Godin, it is often said <strong>marketing is a storytelling game</strong>. This is something that a lot of e-commerce websites seem to have forgotten, each serving up page after page of glossy products floating in front of perfect white backgrounds. You can almost hear the sucking sound of conversion funnels trying to draw you in.</p>\n<p>It’s refreshing then to see a company like <a href=\"https://eiger-extreme.mammut.com/en\">Mammut going all in on storytelling</a> to sell its hiking products. Their long-form expedition articles are as immersive as the finest <em>New York Times</em> feature, with audio clips, maps, and, naturally, stunning photography. Mammut gear features heavily, of course, but it’s done in a way that’s tasteful. More importantly than that, it’s <em>authentic</em>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e11d26fc-d5e8-4df1-a442-a76d0ddcd240/6-websites-inspiring-us-to-think-differently-part-1.png\" /></p>\n<p>Although there is some super slick styling going on here that’s not why I’ve included it. In a way it’s incredible just how impersonal much of the Web feels these days, with e-commerce being a particularly egregious offender.</p>\n<p>This is the kind of thing people would share even if they had no interest in buying mountaineering gear. It’s superb content. Instagram influencer posts look like child’s play compared to this. Do those prompts to shop take you to the aforementioned squeaky clean e-commerce checkout? Naturally. But, by God do they earn it. Not everyone has the resources for something this cutting edge, but it shows that <strong>e-commerce doesn’t have to be sterile and lifeless</strong>.  </p>\n<h3>Axeptio Makes Its Cookies Palatable</h3>\n<p>You can’t swing a cat without hitting a disclaimer pop-up these days. It’s bizarre, then, that so many of them are so ugly. More often than not, they feel tacked on and graceless. Now, to be fair, that’s because they are tacked on and graceless, but some genuinely are just there to Improve Your Browsing Experience™.</p>\n<p>Instead of treating its <strong>cookie pop-up</strong> like a bad odour, web consent solution provider <a href=\"https://www.axeptio.eu/en/home\">Axeptio</a> walks the walk by making them look stylish, and even rather charming. With <a href=\"https://www.smashingmagazine.com/2021/03/state-gdpr-2021-cookie-consent-designers-developers/\">GDPR</a> (and <a href=\"https://www.smashingmagazine.com/2020/02/ethical-design-handbook-prerelease/\">basic decency</a>) to think about, it’s essential to weave ethical design into a website’s fabric.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/dbe14307-f3a2-4188-a14b-a54872b6b031/1-websites-inspiring-us-to-think-differently-part-1.png\" /></p>\n<p>A lovely touch is that it doesn’t actually pop up until users start moving around the site. Why bother people if they’re not even interested in the content? Notice as well that they’ve dropped the <strong>boilerplate cookie</strong> lingo in favor of something more conversational.</p>\n<p>Granted, this may not make the mundane ‘extraordinary’ exactly, but it does <strong>make it a whole lot classier</strong>. It’s a small touch, but one which makes an excellent first impression. Without even touching my mouse, I already have a sense of Axeptio’s attention to detail and commitment to quality. A blocky ‘We care about your privacy’ pop-up would have given a very different impression. </p>\n<p>As far as cookies and pop-ups are necessary, we may as well own them. The same applies to other unsexy staples of the modern web. Do legal consent forms, email signups, and privacy pages have to be ugly and evasive, or do we just <strong>need to think a little differently</strong>? Share your thoughts below!</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"36a397275c17de35ede4c0cbb60340b71229c11a011724b222718a01b7565797","category":"Tech"}