{"title":"Influence of perch provision during rearing on activity and musculoskeletal health of pullets","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307114","date":1721052000000,"content":"<p>by Mallory G. Anderson, Alexa M. Johnson, Cerano Harrison, Jeryl Jones, Ahmed Ali</p>\r\n\r\nPrior research suggests exercise during pullet rearing can mitigate lay-phase bone fractures by strengthening muscles, enhancing balance, and increasing bone mass. This study aimed to confirm that Hy-Line brown pullets with multi-tier perches show increased activity and improved musculoskeletal health. Pullets (n = 810) were randomly allocated to housing systems, either with multi-tier perches (P; n = 15 pens) or without (NP; n = 15 pens), spanning from 0–17 weeks of age. At 5, 11, and 17 weeks, individual birds were meticulously monitored for activity using accelerometers over three consecutive days (n = 90 randomly selected birds/week). At 11 and 17 weeks, 60 birds underwent euthanasia and computed tomography (CT) scans to ascertain tibiotarsal bone mineral density and cross-sectional area measurements. Post-CT scanning, birds were dissected for muscle size, tibiotarsal breaking strength, and tibiotarsal ash percentage measurements. Additionally, serum concentrations of bone-specific alkaline phosphatase and procollagen type 1 N-terminal propeptide were assessed as markers of bone formation (n = 90 birds/week). Pullet group P exhibited heightened vertical activity (P&lt;0.05), with no discernible differences in overall activity (P&gt;0.05) during weeks 5, 11, and 17 compared to group NP. Tibiotarsal bones of P pullets demonstrated superior total and cortical bone mineral density at week 11, alongside increased cortical bone cross-sectional areas and heightened total and cortical bone mineral densities at week 17 (P&lt;0.05) compared to NP pullets. At week 11, P pullets displayed larger leg muscles, including triceps, pectoralis major and minor, and leg muscles at week 17 (P&lt;0.05) compared to NP pullets. Notably, at both weeks, P pullets’ tibiae exhibited greater breaking strengths, higher ash percentages, and elevated concentrations of bone-specific alkaline phosphatase and procollagen type 1 N-terminal propeptide compared to NP pullets (P&lt;0.05). The study findings underscore the benefits of providing multi-tier perches for pullets, serving as a valuable tool for enhancing bird activity and musculoskeletal health preceding the lay phase.","author":"Mallory G. Anderson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"36a4adfc9d74a835b27ecfb1b6a6dbeeaa1146331d2cc28757ff8ecf725c5f18","category":"Interdisciplinary"}