{"title":"25th Anniversary of the iMac","link":"https://www.newsweek.com/steve-jobs-unveils-imac-169734","date":1692218922000,"content":"\n<p>Steven Levy, in a 1998 profile for Newsweek that holds up startlingly well:</p>\n\n<blockquote>\n  <p>“Look at that!” says Steve Jobs as he pulls his Mercedes into a\nparking space. He’s pointing at a new Volkswagen Beetle, and as\nsoon as he parks, he dashes over, circling the shiny black Bug,\ntaking the measure of a well-publicized update of once great\nproduct design. “They got it right,” he concludes.</p>\n\n<p>Last Wednesday Jobs himself received a more thunderous thumbs-up\nat the announcement of Apple Computer’s successor to its own\nhall-of-fame classic, the original Macintosh: a machine designed\nfor consumers dubbed the iMac (only Apple would dare to lowercase\nthe “I” in Internet). The crowd in Cupertino, Calif.’s Flint\nCenter — site of the historic Mac launch 14 years ago — largely\nconsisted of Apple employees. But due to an industrial-strength\ncone of silence shrouding the new product, few had been aware of\nits existence. So after a morale-boosting slide show documenting\nthe company’s new profits, and a demonstration of the speed of its\nsleek new laptops, the crowd went bonkers when interim CEO Jobs,\nin a rare appearance in a business suit, literally unveiled a\npiece of hardware that blends sci-fi shimmer with the kitsch\nwhimsy of a cocktail umbrella. As distinctively curvy as the\nBeetle, dressed in retro-geeky, translucent plastic, the iMac (due\nto ship in August) is not only the coolest-looking computer\nintroduced in years, but a chest-thumping statement that Silicon\nValley’s original dream company is no longer somnambulant.</p>\n</blockquote>\n\n<p>That first iMac shipped 25 years ago this week. No amount of praise heaped upon it is sufficient. It reestablished the Mac platform, and paved the way for <em>everything</em> the entire company has since accomplished. (The Macintosh platform was younger then (14) than the iPhone is today (16), an observation that I find rather upsetting.)</p>\n\n<p>This line from Larry Ellison, then an Apple board member, at the invitation of Jobs, defines Apple as much as it does Jobs personally:</p>\n\n<blockquote>\n  <p>Yes, his demeanor can be alarmingly frank — he can sometimes\nglance at an employee’s hard-won accomplishment and sneer, “This\nis a ‘D’.” But critics who focus on the brutality of his\nassessments miss the point: Jobs’s verbal boot camp can catalyze\npreviously untapped greatness. “There’s too much emphasis on this\nstyle issue,” says Larry Ellison. “Steve is obsessed with quality,\nand that can make him uncompromising, but he gets results.”</p>\n</blockquote>\n\n<p>As Jobs himself would <a href=\"https://daringfireball.net/linked/2009/03/20/design-is-how-it-works\">soon say</a>, “Design is how it works.” The original iMac exemplifies that. Yes, everyone noticed first what it <em>looked</em> like. But it was an insanely great computer.</p>\n\n<p><strong>See Also:</strong> <a href=\"https://www.theverge.com/23808948/imac-twenty-five-visual-history-apple-design-models\">Umar Shakir’s copiously illustrated retrospective for The Verge of every major iMac design</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/16/imac-25th-anniversary\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"36a44af3bd26050c3c404344049e0735c19727d0039bfcbe047b8580228b117e","category":"Tech"}