{"title":"Understanding groundwater mineralization controls and the implications on its quality (Southwestern Ghana): insights from hydrochemistry, multivariate statistics, and multi-linear regression models","link":"http://link.springer.com/10.1007/s11600-023-01271-6","date":1727740800000,"content":"<h3>Abstract</h3>\n                    <p>In Southwestern Ghana, groundwater is highly needed for several uses, including drinking, domestic, agricultural, and socioeconomic activities. Groundwater mineralization is usually controlled by natural processes and anthropogenic activities. The mineralization processes and other latent processes can render groundwater unsuitable for human usage. Thus, there is a need for continuous assessment of groundwater. This study aimed to assess the controls of groundwater mineralization in 105 sample stations within the Southwest of Ghana using pollution indexing, hydrochemical, multivariate statistical, and multiple linear regression (MLR) modeling. The tests for physicochemical characteristics followed standard methods. The ionic concentrations of the samples were within acceptable limits, except for nitrate in some locations. The hydrochemical analyses revealed that the water types predominated in the order of Ca–HCO<sub>3</sub> &gt; Mg–HCO<sub>3</sub> &gt; Ca–Cl &gt; Mg–Cl &gt; Na–HCO<sub>3</sub> &gt; Na–Cl. It was also indicated from selected proxies, discriminant diagrams, and multivariate statistical analyses that silicate mineral dissolution and evaporation–crystallization processes are the main controls of the mineralization in the research area. Also, the mineralization processes were noted to be facilitated by the deep and long residence time of groundwater within aquifers. The extent of contamination and suitability of the groundwater for human consumption were evaluated using percentage of pollution index (PPI) and groundwater pollution index (GPI). Their results suggest that 75% of the samples were highly–very highly polluted. The MLR models excellently predicted the relationships between the groundwater quality parameters. They also indicated that the PPI and GPI were mostly influenced by Ca<sup>2+</sup>, Cl<sup>−</sup>, HCO<sub>3</sub><sup>−</sup>, F<sup>−</sup>, and HCO<sub>3</sub><sup>−</sup> concentrations.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"36a5f2a14f1157cb871d498f51c1dfb8d6e2feef1cacddea7e0b010fa469bf5f","category":"Environment"}