{"title":"iPhones have been exposing your unique MAC despite Apple’s promises otherwise","link":"https://arstechnica.com/?p=1979099","date":1698356884000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/private-wi-fi-address-700x674.jpg\" alt=\"Private Wi-Fi address setting on an iPhone.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/private-wi-fi-address.jpg\">Enlarge</a> <span>/</span> Private Wi-Fi address setting on an iPhone. (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Three years ago, Apple introduced a privacy-enhancing feature that hid the Wi-Fi address of iPhones and iPads when they joined a network. On Wednesday, the world learned that the feature has never worked as advertised. Despite promises that this never-changing address would be hidden and replaced with a private one that was unique to each SSID, Apple devices have continued to display the real one, which in turn got broadcast to every other connected device on the network.</p>\n<p>The problem is that a Wi-Fi media access control address—typically called a m<span><span>edia access control</span></span> address or simply a MAC—can be used to track individuals from network to network, in much the way a license plate number can be used to track a vehicle as it moves around a city. Case in point: In 2013, a researcher unveiled a proof-of-concept device that logged the MAC of all devices it came into contact with. The idea was to distribute lots of them throughout a neighborhood or city and build a profile of iPhone users, including the social media sites they visited and the many locations they visited each day.</p>\n<p>In the decade since, HTTPS-encrypted communications have become standard, so the ability of people on the same network to monitor other people's traffic is generally not feasible. Still, a permanent MAC provides plenty of trackability, even now.</p></div><p><a href=\"https://arstechnica.com/?p=1979099#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1979099&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"36a67e3b6c356d0c8d06eb107a112aa058e0b66433943a70f1eeffcbbdaeebae","category":"Tech"}