{"title":"Discover Building without Limits at AWS Developer Innovation Day","link":"https://aws.amazon.com/blogs/aws/discover-building-without-limits-at-aws-developer-innovation-day/","date":1681930506000,"content":"<p>We hope you can join us on Wednesday, April 26, for a free-to-attend online event, <a href=\"https://pages.awscloud.com/GLOBAL-event-LS-aws-developer-innovation-day-2023-reg-event.html\" target=\"_blank\">AWS Developer Innovation Day</a>. AWS will stream the event simultaneously across multiple platforms, including <a href=\"https://www.linkedin.com/company/amazon-web-services/\" target=\"_blank\">LinkedIn Live</a>, <a href=\"https://twitter.com/AWSonAir\" target=\"_blank\">Twitter</a>, <a href=\"https://www.youtube.com/c/AWSEventsChannel/featured\" target=\"_blank\">YouTube</a>, and <a href=\"http://twitch.tv/awsonair\" target=\"_blank\">Twitch</a>.</p> \n<p>Developer Innovation Day is a brand-new event designed specifically for developers and development teams. In the event, sessions throughout the day will show how you can improve productivity and collaboration, provide a first look at new product updates, and go deep on AWS tools for development and delivery. Topics to be addressed include how you can speed up web and mobile application development and how you can build and deliver faster by taking advantage of modern infrastructure, DevOps, and generative AI-enabled tools.</p> \n<p>We’ll be starting the day with a keynote from <a href=\"https://www.linkedin.com/in/adamseligman/\" target=\"_blank\">Adam Seligman</a>, Vice President of Developer Experience at AWS. And, to wrap up the event, there are closing sessions from <a href=\"https://www.linkedin.com/in/wernervogels/\" target=\"_blank\">Dr. Werner Vogels</a>, CTO at Amazon, <a href=\"https://www.linkedin.com/in/harrymower/\" target=\"_blank\">Harry Mower</a>, Director, AWS Code Suite, and <a href=\"https://www.linkedin.com/in/dseven/\" target=\"_blank\">Doug Seven</a>, Director of Software Development, Amazon CodeWhisperer. A panel of experts will join Werner to discuss the latest trends in generative AI and what it all means for developers. Harry and Doug will discuss trends in developer and team productivity. Of course, no event would be complete without our own <a href=\"https://www.linkedin.com/in/jeffbarr/\" target=\"_blank\">Jeff Barr</a>, VP of AWS Evangelism, who’ll be sharing a “Best practices and key takeaways” session with a recap of key stories, announcements, and moments from the day!</p> \n<p>AWS staff will present the technical breakout sessions during the day, and AWS Heroes and Community Builders will also be involved, presenting community spotlights, which are an excellent chance to get involved with the global AWS community. During and after the event there’s also a chance to sign up for an <a href=\"https://aws-amplify.github.io/\">AWS Amplify</a> hackathon that will be held in May and also an <a href=\"https://codecatalyst.aws/explore\">Amazon CodeCatalyst</a> immersion day. Other fun events are also in the works—watch the event details page for more information.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/13/DevInnovationDayBanner.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/13/DevInnovationDayBanner.png\" alt=\"AWS Developer Innovation Day Event Banner\" width=\"653\" height=\"292\" /></a></p> \n<p>There’s no up-front registration required to join AWS Developer Innovation Day, which, I’ll remind you, is also free to attend. Simply <a href=\"https://pages.awscloud.com/GLOBAL-event-LS-aws-developer-innovation-day-2023-reg-event.html\" target=\"_blank\">head on over to the event page</a> and select <strong>Add to calendar</strong>. I’m excited to be joined by colleagues from the AWS on Air team to host the event, and we all hope you’ll choose to join in the fun and learning opportunities at this brand-new event!</p>","author":"Steve Roberts","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"36ae5ec5b49babd8a8890d445fee0d0746391ebe2fb12c71a2ead480b6206148","category":"Tech"}