{"title":"Inclusion of persons living with disabilities in a district-wide sanitation programme: A cross-sectional study in rural Malawi","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003005","date":1724940000000,"content":"<p>by Katherine Davies, Mindy Panulo, Clara MacLeod, Jane Wilbur, Tracy Morse, Kondwani Chidziwisano, Robert Dreibelbis</p>\r\n\r\nCommunity-led total sanitation (CLTS) is embraced as a key strategy to achieve universal sanitation coverage (Sustainable Development Goal 6.2). Although inclusion is identified as a predictor of CLTS success, people living with disabilities are often excluded from community sanitation programmes and there is limited research exploring CLTS participation amongst people living with disabilities. This study aims to explore the extent to which people living with disabilities participated in a CLTS intervention delivered in rural Malawi using standard approaches. This cross-sectional study was conducted in the Chiradzulu district of Malawi. A household questionnaire was administered to collect information about CLTS participation. Multivariable logistic regression was performed to compare participation in different CLTS activities between households with (n = 80) and without a member with a disability (n = 167), and between household members with (n = 55) and without a disability (n = 226). No difference in CLTS participation was observed at the household-level, but there were marked differences in CLTS participation between household members with and without a disability. Household members without a disability felt they could give more input in triggering activities (OR = 3.72, 95%CI 1.18–11.73), and reported higher participation in the transect walk (OR = 4.03, 95%CI 1.45–11.18), community action planning (OR = 2.89, 95%CI 1.36–6.13), and follow-up visits (OR = 3.37, 95%CI 1.78–6.40) compared to household members with disabilities. There was no difference in the likelihood of being invited to triggering (OR = 0.98, 95%CI 0.41–2.36), attending triggering (OR = 2.09, 95%CI 0.98–4.46), or participating in community mapping (OR = 2.38, 95%CI 0.71–7.98) between household members with and without a disability. This study revealed intra-household inequalities in CLTS participation. To improve participation in CLTS interventions, facilitators should be trained on action steps to make CLTS more inclusive. Further research could include an in-depth analysis of predictors of CLTS participation amongst people living with disabilities, including disability types, severity and age.","author":"Katherine Davies","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"36b8851817af4ff3ebf7db2ef3d6892b7f42e12cf60bf5339b08c32142d52d13","category":"Environment"}