{"title":"Philippe Gilbert will not race the Tour of Flanders: Daily News","link":"https://cyclingtips.com/2021/03/philippe-gilbert-will-not-race-the-tour-of-flanders-daily-news/","date":1617057544000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>As we get into the week, the cycling headlines include news that Philippe Gilbert has decided to skip the Tour of Flanders and the UCI has referred the Nacer Bouhanni sprint incident to its Disciplinary Commission.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Philippe Gilbert will not race the Tour of Flanders</h3>\n\n\n\n<p><strong>Lotto-Soudal</strong> announced on Monday that <strong>Philippe Gilbert</strong> will not be in attendance at the <strong>Tour of Flanders</strong> this weekend. The team said that the 38-year-old Belgian, who won the race in 2017, &#8220;will take a period of necessary rest, both physically and mentally,&#8221; and while he aims to be back for the Ardennes Classics, nothing is set in stone at this point.</p>\n\n\n\n<p>“We decided with the team that I would take a period of rest now because it is not going well at all,&#8221; Gilbert said. “It’s been a few weeks now that things haven’t been going well. We took the time to analyze everything there was to discuss and we came to the conclusion that it is a lack of mental and physical freshness.</p>\n\n\n\n<p>I think it is due to all the work I did after my crash at the Tour de France last year. I am still human. I put in a lot of work, without any decent rest really, because during the weeks off the bike, I was working hard with the physiotherapist or other specialists. At the time, I’ve had a bad diagnosis of the knee. We didn’t really realize how serious that second crash was. In the end, it was much more serious than we initially thought. Maybe I should have stopped my 2020 season at that point.”</p>\n\n\n\n<p>Gilbert noted that he was not noticing improvement in his form after the first few races of the season, and said, &#8220;When you find yourself in this stage, the only way to let your body work naturally, is to give it some rest.&#8221;</p>\n\n\n\n<h3>UCI refers Bouhanni sprint incident to Disciplinary Commission</h3>\n\n\n\n<p>After <strong>Nacer Bouhanni</strong> was disqualified for driving <strong>Jake Stewart</strong> into the barriers on Sunday at the <strong>Cholet-Pays de la Loire</strong>, the UCI said <a href=\"https://cyclingtips.com/2021/03/uci-refers-bouhannis-sprint-shove-to-disciplinary-commission-for-additional-punishment/\" target=\"_blank\" rel=\"noreferrer noopener\">on Monday</a> that it has &#8220;decided to refer the incident to its Disciplinary Commission and demand the imposition of sanctions that are appropriate to the seriousness of this action.&#8221;</p>\n\n\n\n<p>Bouhanni, for his part, addressed the incident in a statement released by Arkéa-Samsic.</p>\n\n\n\n<p>“I admit my mistake in changing my trajectory, but there was nothing intentional,” Bouhanni said via a statement released by his Arkea-Samsic team.</p>\n\n\n\n<p>“I want to say that I’m sorry for Jake Stewart. The sprint went like this: I saw Elia Viviani launch, and I wanted to take his draft. I admit that my mistake was to change course to go take his wheel. I didn’t see Jake Stewart at that moment. When we made contact with each other, I found myself unbalanced and I caught myself as best I could so as not to fall. I just wanted to take the slipstream because the wind was coming from the front, right side, in any case it wasn’t intentional.”</p>\n\n\n\n<h3>Ronan Mc Laughlin sets a new Everesting record</h3>\n\n\n\n<p>CyclingTips tech writer <strong>Ronan Mc Laughlin</strong> has <a href=\"https://cyclingtips.com/2021/03/ronan-mc-laughlin-has-smashed-the-everesting-record-in-6-hours-40-minutes/\" target=\"_blank\" rel=\"noreferrer noopener\">retaken</a> the <strong>Everesting</strong> world record.</p>\n\n\n\n<p>Mc Laughlin climbed 8,848 meters in a time of 6:40:54, breaking the previous record held by <strong>Sean Gardner</strong> by nearly 20 minutes. He completed his effort at Mamore Gap in Donegal, Ireland, the same place where he set a prior record of 7:04:41 back in July of 2020 before that mark was bested by Gardner. The 810-meter section of the road he used has an average gradient of 14.2%, and he had to complete just under 76 laps to hit the vertical gain of Mt. Everest (he did 78 laps just to be safe).</p>\n\n\n\n<p>Geographic data systems company Integrated Informatics independently verified the elevation of the climb and Hells 500, the organization that manages Everesting (and which is run by CyclingTips Membership Manager Andy van Bergen), has officially verified Mc Laughlin&#8217;s record.</p>\n\n\n\n<p>Stay tuned for some video coverage of the achievement, coming soon …</p>\n\n\n\n<h3>Tour of Norway postponed</h3>\n\n\n\n<p>Organizers of the <strong>Tour of Norway</strong> announced on Monday the &#8220;the current situation regarding COVID-19 and the prognoses for May in Norway has led us to postpone the race.&#8221;</p>\n\n\n\n<p>The ProSeries stage race had been scheduled to run from May 21 to May 24. Organizers said that they plan to &#8220;explore alternative dates at the end of August or early September.&#8221;</p>\n\n\n\n<h2>In case you missed it &#8230;</h2>\n\n\n\n<ul><li>As Abby Mickey writes, <strong>Marianne Vos</strong> showed the <a href=\"https://cyclingtips.com/2021/03/sometimes-patience-wins-bike-races-and-vos-knows-how-to-wait/\" target=\"_blank\" rel=\"noreferrer noopener\">value of patience</a> at <strong>Gent-Wevelgem</strong> on Sunday.</li><li>In his <a href=\"https://cyclingtips.com/2021/03/my-first-race-jake-stewart-the-next-sprint-superstar/\" target=\"_blank\" rel=\"noreferrer noopener\">latest video</a>, Dave Everett catches up with <strong>Jake Stewart</strong>, who looks to have a very bright future ahead.</li></ul>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/philippe-gilbert-will-not-race-the-tour-of-flanders-daily-news/\">Philippe Gilbert will not race the Tour of Flanders: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"36b9b4f1cfbc161599647f0623fc244c9750e2c74148ade30154cdc454b8a71b","category":"Cycling"}