{"title":"Apple libera la versión candidata de iOS 16.6, pero no hay ninguna función nueva","link":"https://www.macworld.com/article/1924683/ios-16-6.html","date":1689755753000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Justo un día después del lanzamiento de iOS 16.5 y unas dos semanas antes de que llegara la esperada primera beta de iOS 17 en junio, Apple inició el proceso de versiones beta de iOS 16.6, la que debería ser la última versión de iOS 16.</p>\n\n\n\n<p>La primera versión beta de iOS 16.6 para desarrolladores llegó el pasado 19 de mayo, mientras que la versión pública correspondiente llegó tres días después. Ahora, Apple ha lanzado la quinta beta para desarrolladores y la pública debería llegar pronto.</p>\n\n\n\n<p>No esperes que esta nueva versión traiga muchas novedades. iOS 16 ya es un producto muy completo, prácticamente todo lo completo que podría ser, y todo el mundo está ya pendiente de las betas de <a href=\"https://www.macworld.com/article/1530492/ios-17-2.html\">iOS 17</a>, que la compañía anunció en la <a href=\"https://www.macworld.com/article/1664474/wwdc-2023-2.html\">WWDC</a>.</p>\n\n\n\n<p>Aun así, y como ocurrió con <a href=\"https://www.macworld.com/article/1798913/version-candidata-ios-16-5.html\">iOS 16.5</a>, las grandes novedades de iOS 16.6 llegan en forma de pequeños ajustes y mejoras de usabilidad, así como en parches de seguridad.</p>\n\n\n\n<h2>Nuevas funciones de iOS 16.6</h2>\n\n\n\n<p>Como decíamos, no esperes muchas funciones nuevas en iOS 16.6, pues todas las miradas están puestas sobre iOS 17.</p>\n\n\n\n<ul>\n<li><strong>Verificación de llave de contacto en iMessage:</strong> Aunque todavía no ha llegado a los usuarios, las betas de iOS 16.6 contienen un código que podría activar este tipo de verificación. Esta medida de seguridad mejorada fue anunciada el año pasado para verificar la autenticidad de usuarios de iMessage.</li>\n</ul>\n\n\n\n<h2>Cómo instalar la beta pública de iOS 16.6</h2>\n\n\n\n<p>Si quieres ser de los primeros o las primeras en probar iOS 16.6, puedes probar la versión beta pública. El proceso para <a href=\"https://www.macworld.com/article/1452600/instalar-ios-beta.html\">instalar una beta</a> cambió con iOS 16.4 y así es cómo debe hacerse ahora:</p>\n\n\n\n<ol>\n<li>Haz clic en ‘Sign In’ (‘Registrarse’) en la <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/sp/betaprogram/&amp;xcust=1-1-1924683-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">página Beta de Apple</a> y regístrate con tu ID de Apple.</li>\n\n\n\n<li>Inicia sesión en el Programa de Software Beta.</li>\n\n\n\n<li>Haz clic en ‘Inscribe tu dispositivo iOS’.</li>\n\n\n\n<li>Abre la aplicación de ‘Ajustes’, pulsa ‘General’ y, a continuación, ‘Actualización de software’.</li>\n\n\n\n<li>En la sección ‘Actualizaciones beta’, selecciona la beta pública de iOS que quieras instalar.</li>\n</ol>\n\n\n\n<p>Después de registrarte, puede que la opción de beta tarde unos instantes en aparecer en la sección ‘Actualización de software’.</p>\n\n\n\n<h2>Cómo instalar iOS 16.6 beta para desarrolladores</h2>\n\n\n\n<p>Necesitarás estar registrado como desarrollador de Apple, es decir, unirte al <a href=\"https://www.macworld.com/article/1457585/apple-beta-software-program-o-como-ser-el-primero-en-probar-software-de-apple.html\">Programa de Desarrolladores</a> de Apple que cuesta 99 dólares al año.</p>\n\n\n\n<ol>\n<li>Regístrate al Programa de Desarrolladores de Apple en <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/&amp;xcust=1-1-1798913-1-0-0&amp;sref=https://www.macworld.com/article/1798913/version-candidata-ios-16-5.html\" target=\"_blank\">developer.apple.com</a>.</li>\n\n\n\n<li>Abre los ‘Ajustes’, pulsa ‘General’ y, a continuación, ‘Actualización de software’.</li>\n\n\n\n<li>En la sección ‘Actualizaciones beta’, selecciona la beta para desarrolladores de iOS que quieras instalar.</li>\n</ol>\n\n\n\n<p>Los desarrolladores registrados pueden optar por conseguir la beta pública seleccionando la beta pública de iOS en la sección ‘Actualización de software’. Después de registrarte como desarrollador, la opción puede tardar un poco en aparecer en ‘Actualizaciones de software’.</p>\n\n\n\n<p>Algunos desarrolladores tienen un ID de Apple registrado que es diferente del ID de Apple asociado a su cuenta y datos personales de Apple.</p>\n\n\n\n<p>Para utilizar un Apple ID diferente al que se utiliza en el resto de iOS, abre ‘Ajustes’ &gt; ‘General’ &gt; ‘Actualización de software’ &gt; ‘Actualizaciones beta’ y selecciona el ID de Apple en la parte inferior de la pantalla.</p>\n\n\n\n<h2>Riesgos y precauciones</h2>\n\n\n\n<p>Ten en cuenta, en primer lugar, que las betas son versiones de prueba de <em>software</em> de Apple que llegarán en un futuro. Por definición, están inacabadas y, aunque deberían incluir la mayoría o todas las características del producto final, habrá diferencias estéticas y algunos fallos y problemas por solucionar.</p>\n\n\n\n<p>Esos posibles fallos y problemas son la razón por la que Apple dedica tiempo en hacer pruebas beta de iOS para que los desarrolladores y desarrolladoras puedan detectarlos antes de su lanzamiento final.</p>\n\n\n\n<p>En otras palabras, no esperes una experiencia de usuario perfecta. No esperes que las aplicaciones existentes (incluidas aquellas que sueles usar a menudo), funcionen perfectamente con la nueva versión.</p>\n\n\n\n<p>En casos extremos, es posible que el dispositivo quede bloqueado por culpa de la versión beta y no pueda utilizarse hasta que llegue la siguiente beta que, con suerte, solucione el problema.</p>\n\n\n\n<p>Tampoco es inusual que el <em>software</em> de las primeras versiones beta haga un consumo excesivo de la batería.</p>\n\n\n\n<p>Cuanto más nos acerquemos al lanzamiento final y a la versión de iOS, más pulidas y completas serán las betas.</p>\n\n\n\n<p>La contrapartida, por supuesto, es que quedará menos tiempo para el lanzamiento oficial, así que no ganarás tanto instalando una beta.</p>\n\n\n\n<p>Suponiendo que decidas seguir adelante, debemos insistir en la importancia de hacer una <a href=\"https://www.macworld.com/article/1451424/estas-son-las-4-formas-de-hacer-copia-de-seguridad-de-tu-iphone-o-ipad.html\">copia de seguridad de tu iPhone</a> antes de instalar una beta de iOS, o mejor aún, utilizar un dispositivo secundario en lugar de tu iPhone principal.</p>\n\n\n\n<p><em>Artículo original publicado en la edición en inglés de <a href=\"https://www.macworld.com/article/1923832/ios-16-6-beta-features-release-date.html\" target=\"_blank\">Macworld.com</a>.</em></p>\n\niOS, iPhone, Personal Software</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"36c3556645ca0c58917d6994b34ddc692f4e72986e7c5087e9dc48f0a9c25b70","category":"Apple"}