{"title":"The Bike that Tipped Us Over the Edge: August Bicycles’ Balance Bike – August Bicycles","link":"https://theradavist.com/2021/07/the-bike-that-tipped-us-over-the-edge-august-bicycles-balance-bike/?utm_source=rss&utm_medium=rss&utm_campaign=the-bike-that-tipped-us-over-the-edge-august-bicycles-balance-bike","date":1626275891000,"content":"<p>I can’t say that the possibility of a custom balance bike persuaded me personally to have a kid (let’s give hormones that honour), but having been together many years, I feel confident stating that it was in the pro column for Gavin. As I sat on the sofa, snacks resting precariously on my growing stomach, Gavin would wax lyrical about ideas he had for the small person’s first balance bike, with me nodding sagely but honestly, not listening. There were screengrabs, blackboard diagrams and long waffling trains of thought. Then, parts started arriving at the workshop and not for <a href=\"http://www.augustbicycles.cc\">August Bicycles</a> customers.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/954AE327-689A-4FD7-8561-E85ECCFC7BFB.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>It all started quite sensibly, with a mature conversation about how we definitely wouldn’t be those parents that spoil their kids. Did I know we were lying to ourselves? Of course. We were so in love with our daughter before she had even arrived that we were definitely going to spoil her, like all parents do with their bubbas. But as soon as we jokingly, then seriously, talked about baby carbon rims, I knew we were in deep. And yet, little did I know how far (literally) this balance bike would end up going.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/28390BD7-6601-4670-894F-C613C99B426A.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/07/A6AD284B-E410-461F-B66D-879B22C7B9F3.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I’ll come to the build spec and all the nitty gritty in a sec, but I don’t think I’m spoiling anything if I reveal that the frame, forks and bar/stem combo all got packaged up and sent to LA for a very special paint job from Nico Sclater, AKA <a href=\"https://www.instagram.com/ornamentalconifer/\">Ornamental Conifer</a>. I can feel your collective eye-roll already and yes, we know it’s beyond stupid to have a brilliant artist paint a balance bike, given the certainty of damage, but we couldn’t help ourselves. It was for her, after all.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3064.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Powdercoat would have been far more sensible, but Nico is a friend and was due to join the parent crew too, so we held our breath to see if he would be willing to create something for us and thankfully, he said yes. Actually, he said “hells yes”, maybe because we had no desire to steer the design at all, or more likely, because he was going to be a fellow rad girl-dad and was already turning into a big softie (we love you dude!). Either way, that’s why, when it arrived back with us, there was a brief moment of “there’s no way she can ride this, look at it, it’s amazing!”, followed by “nope, it’s perfect for her and she needs to get to the track on it, stat!”.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3063.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3062.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>From start to finish, the bike was a couple of years in the making, being fit in around our customer work, a new baby, losing a beloved parent and not to mention the fact that Nico is a busy guy, being the <a href=\"https://www.raceservice.la/project-ornamental-conifer\">Artist-in-Residence at Race Service</a>. We know to never rush a painter, so no nudging or prodding came from us and the Christmas we were all quietly aiming for came and went, but no bother. The bike made for a very happy second birthday present this year, plus the small one had already mastered her stand-in bike and was ready to rip on something more up to the task. Which brings us nicely to the spec I know you are all still waiting for.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3065.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3067.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I tried to instill a strict mandate with Gavin that the balance bike couldn’t be ridiculously over the top. Had I known just what a rite of passage it is for a framebuilder to build their kids’ the most insane frames going, I would have kept my mouth shut and saved myself the lengthy Instagram-based education that duly followed. Inevitably, I just let Gavin do what he does best and away he went, locking himself in the workshop after baby bedtime and beavering away. I’m pretty sure all his years as a jigs and fixtures engineer came in handy when teeny tooling became necessary.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/3B148FAF-FE1F-435E-BB73-55CCE9E43908.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The build is full 4130 chromoly, with a BMX-style fully integrated headset, all machined in-house. It has a  one-piece handlebar, stem, upper headset cap and steerer, with all the headset preloading and clamping done at the fork crown, to keep all potential sharp pieces out of reach of soft baby knees etc. The bars were angle-cut and tig welded before being filed smooth, to give a few degrees of back sweep. You know, for all those long days in the saddle at the pump track and pre-school audax rides. I joke, but my future as a mum-spectator is set in stone and that’s a-ok with me.</p>\n<p>The rear stays and forks have been crafted from Deda blades, but because they were cut down so much for the 12” wheels, Gavin shortened them in a specific way, to keep the taper intact. The cowled drop-outs were made from scratch from an old pair of BMX handlebars that we had kicking about and some plate chromoly. By making them handlebar-size, Gavin could tuck all the axle bolts inside and cap them off with rubber handlebar plugs. This takes the potential for injury away and, importantly for those of us with parquet at home, when the bike gets dropped, it won’t leave a gouge in the floor.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3060.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3061.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>It was fillet-brazed and filed, with one of our stainless headtube badges silver soldered on as a finishing touch and there’s no frame number. It has our standard laser cut number plate on the underside, as all our frames do, but it has ‘BUB’ stamped there instead. All the bolts throughout have been machined to have the writing removed, as per Gavin’s customer bikes and he added one of his stainless logo braze-ons on the back of the rear drop-out, in a nod to his bigger designs too.</p>\n<p>Gavin tried to keep the whole look clean and simple, in keeping with the design of his big people bikes, plus, he wanted to avoid the pitfall of building a standard frame and just slinging the most expensive parts possible on it. Speaking of which.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3059.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Components-wise, we may have been a little indulgent, though not as much as we could have been. The wheels were hand-built by Gavin, of course, as that’s how he got started in the industry. Brompton-spaced straight-pull hubs have been laced into 12” UD carbon rims using straight-pull Sapim Leader spokes and brass nipples. Both wheels are shod with Vans x <a href=\"https://cultcrew.com\">Cult</a> waffle sole rubber tyres, to match the household’s footwear of choice (no pressure Vans, but we could really use a sponsorship deal). I did get my way here, in that we went with the plain black tyres, not the lairy camo options Gavin had been trying to get me excited about. I know, I’m so boring, but he now concedes I was right, just not in public.</p>\n<p>As we are a vegan household, we chose <a href=\"https://www.newbaums.com\">Neubaum’s cotton bar tape</a> for the handlebars. The seat post is a <a href=\"https://www.primobmx.com\">Primo</a> pivotal and the saddle, well that was a nightmare. Who knew that putting a regular seat on a balance bike would annoy Gavin so much? Not me, until he spent weeks sourcing something suitably small enough to not “annoy his eyes”. He eventually found a mini BMX race seat and the world breathed a sigh of relief. We are going to have a bash at recovering it with something more fun, but that’s a job for another day, when Bub isn’t out razzing and won’t notice I’ve pinched her seat.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3056.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The picture of the raw finished bike has been our most liked ever on <a href=\"http://www.instagram.com/augustbicycles\">Instagram</a>, with plenty of people asking if we planned to leave it unpainted, but for us, that didn’t feel like the right move. If Bub’s artwork around the house is anything to go by, she likes a bit of colour (especially on white walls and black kitchen cabinets) and after trying to think of some cool schemes and designs, we jokingly wondered if Nico would be willing to paint a bike, which turned into a very serious hope that he would.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3055.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>If you’re not familiar with his work, Nico’s art can be found on race cars, formula one helmets and album covers. Moreover, it usually centres around a pertinent phrase or one-liner, in this case, “Never Perfect, Always Awesome”. We love that he chose such a bang-on phrase for not only a kid, but also a handmade item and no, those are not decals. The chrome-effect lettering is all paint and our minds were blown when we saw it. So much so, I almost wished we were vloggers, just so my choke-laugh-cry of excitement could have been part of a naff YouTube unboxing video. On top of a spackled camo effect, the lettering looks incredible and if anyone is looking for a sign to give an artist carte blanche, this is it. We couldn’t be more stoked and it feels so personal that Nico chose this scheme and phrase just for our daughter, adding her initial on the seat tube too. As it happens, we are building a balance bike for Nico’s daughter right now, so that’s definitely going to be another one with an incredible paint scheme.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/IMG-3046.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>As the partner of a framebuilder and a writer, I read a lot of bike-related articles and I always rush to the end to see if the new owner loved the finished product and in this case, there is no doubt. Our daughter became immediately obsessed with her new bike and has barely let it out of her clammy grip since we gave it to her. She turned two at the beginning of May and has already mastered our local pump track, doing laps on her own quite happily and always looking for an inside racing line (taking after her ex-Team GB dad). When it’s time to leave the track, we have tantrums and garbled cries of “bike, bike”. So it’s safe to say that it’s a hit but who knows for how long, because I’d be lying if I said that Gavin isn’t already designing her first pedal bicycle, as I type.</p>\n<p>But he can scheme all he likes, because if I can persuade him, there might be a second rider for this one anyway…</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"36c9aac343f565a5e77bf9baddd2f0765ca6544741a88703341905961854c90f","category":"Cycling"}