{"title":"Integrating spatiotemporal hydrological connectivity into conservation planning to protect temporary rivers","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4139?af=R","date":1711350000000,"content":"<h2>Abstract</h2>\n<p>\nTemporary rivers (TRs) have been largely overlooked in conservation assessments. Because TRs are such dynamic ecosystems, spatial and temporal aspects of their hydrology and ecology need to be taken into account when designing conservation plans.\nThe aim of this paper is to propose a set of recommendations that could be useful for managers to do this, using seasonal diatom and macroinvertebrate data from north-eastern Spain as a case study. Beta diversity was partitioned into local and species contributions to beta diversity (LCBD and SCBD). Additionally, priority conservation sites covering the spatial distribution of all species were identified using Marxan and the selection frequency (MSF) of the sites served as a measure of the relative irreplaceability of each site.\nUsing both approaches (beta diversity and Marxan), the effects of changing spatiotemporal connectivity and habitat heterogeneity on the selection and prioritization of sites to be conserved were assessed.\nIt was found that LCBD and MSF ranged widely both in space and time. However, LCBD and MSF were weakly related. Marxan adequately represented all taxa by selecting a few sites, while LCBD selected communities with higher differentiation but not necessarily those with rare species. In addition, SCBDs assigned low values to rare taxa, thus care must be taken when using this index for conservation planning.\nSpatiotemporal connectivity and local habitat heterogeneity played a critical role at the regional and local scales, driving site prioritization.\nOverall, we recommend: 1) monitoring multiple hydrological phases to encompass the different community types and capturing total diversity; 2) using Marxan and LCBD in combination, to benefit from their complementary insights; and 3) integrating spatiotemporal isolation and habitat heterogeneity into conservation plans, since they are the main drivers of community variation over space and time in TRs.\n</p>","author":"José María Fernández‐Calero, \nDavid Cunillera‐Montcusí, \nVirgilio Hermoso, \nGuillermo Quevedo‐Ortiz, \nPau Fortuño, \nRaúl Acosta, \nJoan Gomà, \nNúria Cid, \nDolors Vinyoles, \nAlbert Ruhí, \nMiguel Cañedo‐Argüelles, \nNúria Bonada","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"36cb535e99f09749ef7c29b076163428314cb68652bd694769b532c1e4dba690","category":"Environment"}