{"title":"Jumbo Visma: Redefining what a Grand Tour team is","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/redefining-what-a-grand-tour-team-is","date":1693508720000,"content":"\n      <p>For all, cycling is a team sport, a collective effort designed to ensure one man or woman takes the prize on offer. But it’s still a sport that disproportionately, though understandably, lauds and celebrates its individual champions even more.</p>\n<p>The jersey wearers, the stage winners, and the ones who get to spray the champagne on the podium are the ones we eulogise and honour. The teammates, the selfless domestiques, are acknowledged, but we mostly gloss over the cliché lines from the winners who insist that their success wouldn’t have been possible without the contribution of their colleagues.</p>\n<div></div>\n<p>But with Jumbo-Visma, a team who have been redefining what it means to be a Grand Tour team for a few years, it’s hard to ignore the role of every single one of their riders. While Team Sky had their regimented train to propel them to Tour de France, Giro d’Italia and <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> victories, Jumbo-Visma have their collection of superstars all playing various roles, all moving around the race at different periods, and all disrupting and affecting the dynamics from various angles.</p>\n<p>At the 2022 Tour de France, we witnessed exceptional tactics on the Col du Granon stage that dethroned Tadej Pogačar. This year, they’ve won the Giro, retained their Tour title, and on stage six of the Vuelta a España, they took a big step forward in their quest to complete an unprecedented Grand Tour grand slam. </p>\n<p>What unfolded on the roads from the Mediterranean coast into the mountains of Teruel was an exhibition, a first-class demonstration of guile, tactics, understanding and execution. A huge 40-plus man break went up the road, and within it were four Jumbo riders: Sepp Kuss, Dylan van Baarle, Jan Tratnik and Attila Valter. “It wasn’t exactly like the plan, but we believed we could do something that could make a difference in the GC,” the team’s DS Merijn Zeeman said.</p>\n<p>Soudal–Quick-Step, the leaders with Remco Evenepoel, couldn’t bring such a huge group back, and they were left hoping that their numerical advantage in the peloton would work in their favour when they turned onto the final climb. But it didn’t go anything like that.</p>\n<p><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230831VUE02016-UNIPUBLIC___SPRINT_CYCLING_AGENCY.jpg?v=1693508500\" />Up the nasty climb of Javalambre, Kuss - the universally-liked, smiling, polite, bilingual, best climber in the world - attacked in the closing stages and held on for a memorable victory, his personal memento from riding three consecutive Grand Tours. Behind him, his leaders, Primož Roglič and Jonas Vingegaard, attacked their GC colleagues and put time into every single one of them.</p>\n<p>It wasn’t as much as it could have been - and looked like it was going to be at one point - but Juan Ayuso was seven seconds behind, Enric Mas 24, and, crucially, Evenepoel was 32 seconds back; Vingegaard is now just five seconds shy of Evenepoel.</p>\n<p>In red now, though, is Groupama-FDJ’s Lenny Martinez, who – aged 20 – is the race’s youngest rider and will be getting prepared for the French press officially anointing him as the man who can finally end their Tour de France hoodoo.</p>\n<p>All of the hype will be blown out of proportion, but Martinez should now be considered a genuine player in the GC battle. So, too, should Kuss. Eight seconds adrift of the Frenchman, Jumbo’s sublime tactics on stage six have swelled their two-pronged attack to a three-pronged one. What’s more, they have the luxury of not being in the lead and, therefore, not having to take responsibility of the race.</p>\n<p>It’s a dream scenario, one conjured up spontaneously on the roads of Valencia, but one that actually derives from years of developing into the pre-eminent Grand Tour team of their generation. They may not be everyone’s favourites – sport rarely does love its dominators – but they are modern cycling’s greatest, most complete and most destructive team. And when they combine as they did on stage six, it’s joyous to watch. Chapeau, Jumbo-Visma.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"36cd208a77be88154d83b5c0b2a5272ca468b0ac5298d9bf4fa6f439966a0036","category":"Cycling"}