{"title":"Molecular identification of Hymenopteran insects collected by using Malaise traps from Hazarganji Chiltan National Park Quetta, Pakistan","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300903","date":1712757600000,"content":"<p>by Abid Hussain, Asmatullah Kakar, Mahrukh Naseem, Kashif Kamran, Zafar Ullah, Shehla Shehla, Muhammad Kashif Obaid, Nazeer Ahmed, Qaiser Khan, Iram Liaqat</p>\r\n\r\nThe order Hymenoptera holds great significance for humans, particularly in tropical and subtropical regions, due to its role as a pollinator of wild and cultivated flowering plants, parasites of destructive insects and honey producers. Despite this importance, limited attention has been given to the genetic diversity and molecular identification of Hymenopteran insects in most protected areas. This study provides insights into the first DNA barcode of Hymenopteran insects collected from Hazarganji Chiltan National Park (HCNP) and contributes to the global reference library of DNA barcodes. A total of 784 insect specimens were collected using Malaise traps, out of which 538 (68.62%) specimens were morphologically identified as Hymenopteran insects. The highest abundance of species of Hymenoptera (133/538, 24.72%) was observed during August and least in November (16/538, 2.97%). Genomic DNA extraction was performed individually from 90/538 (16.73%) morphologically identified specimens using the standard phenol-chloroform method, which were subjected separately to the PCR for their molecular confirmation via the amplification of cytochrome c oxidase subunit 1 (<i>cox1</i>) gene. The BLAST analyses of obtained sequences showed 91.64% to 100% identities with related sequences and clustered phylogenetically with their corresponding sequences that were reported from Australia, Bulgaria, Canada, Finland, Germany, India, Israel, and Pakistan. Additionally, total of 13 barcode index numbers (BINs) were assigned by Barcode of Life Data Systems (BOLD), out of which 12 were un-unique and one was unique (BOLD: AEU1239) which was assigned for <i>Anthidium punctatum</i>. This indicates the potential geographical variation of Hymenopteran population in HCNP. Further comprehensive studies are needed to molecularly confirm the existing insect species in HCNP and evaluate their impacts on the environment, both as beneficial (for example, pollination, honey producers and natural enemies) and detrimental (for example, venomous stings, crop damage, and pathogens transmission).","author":"Abid Hussain","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"36d1756ef8f6dac9761816216676e687c5279282cf521f0bbd0b71b826e91085","category":"Interdisciplinary"}