{"title":"Sequential Sampling of the Gastrointestinal Tract to Characterize the Entire Digestive Microbiome in Japanese Subjects","link":"https://www.preprints.org/manuscript/202406.1695/v1","date":1719229830000,"content":"The gastrointestinal (GI) tract harbors trillions of microorganisms known to influence human health and disease, and next-generation sequencing (NGS) now enables the in-depth analysis of their diversity and functions. Although a significant amount of research has been conducted on the GI microbiome, comprehensive metagenomic datasets covering the entire tract are scarce due to cost and technical challenges. Despite the widespread use of fecal samples, integrated datasets encompassing the entire digestive process, beginning at the mouth and ending with feces, are lacking. With this study, we aimed to fill this gap by analyzing the complete metagenome of the GI tract, providing insights into the dynamics of the microbiota and potential therapeutic avenues. In this study, we delved into the complex world of the GI microbiota, which we examined in five healthy Japanese subjects. While samples from the whole GI flora and fecal samples provided sufficient bacteria, samples obtained from the stomach and duodenum posed a challenge. Using a principal coordinate analysis (PCoA), clear clustering patterns were identified; these revealed significant diversity in the duodenum. Although this study was limited by its small sample size, the flora in the overall GI tract showed unwavering consistency, while the duodenum exhibited unprecedented phylogenetic diversity. A visual heat map illustrates the discrepancy in abundance, with Fusobacteria and Bacilli dominating the upper GI tract and Clostridia and Bacterioidia dominating the fecal samples. Negativicutes and Actinobacteria were found throughout the digestive tract. This study demonstrates that it is possible to continuously collect microbiome samples throughout the human digestive tract. These findings not only shed light on the complexity of GI microbiota but also provide a basis for future research.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"36d60c2e1e8bfd5750f73eb4ce572a65861d0b20f56f8d4c96e0a4c6777d32cd","category":"Interdisciplinary"}