{"title":"Low-frequency constrained seismic impedance inversion combining large kernel attention and long short-term memory","link":"http://link.springer.com/10.1007/s11600-024-01298-3","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>In the seismic impedance inversion, the low-frequency information reflects the general trend of the impedance curve. Without low-frequency information, inversion results cannot accurately reflect stratigraphic changes. Seismic data are also spatially correlated, while the conventional inversion methods do not consider the spatial correlation of geological structures, which may lead to poor lateral continuity of the inversion results. To alleviate these problems, we propose a low-frequency constrained seismic impedance inversion method combining large kernel attention (LKA) and long short-term memory (LSTM). Our network structure is divided into an inversion module and a low-frequency feature extraction module. In the inversion module, we integrate LKA and LSTM into the network, which can improve the lateral continuity of the inversion results. The low-frequency feature extraction module constrains the entire network structure and extracts more refined low-frequency features. To demonstrate the reliability of the proposed method, we applied it to the SEAM model. Experiments show that our method has the best lateral continuity and accuracy, with mean squared error and Coefficient of Determination (<span>\n                      \n                      <span>\\(R^{2}\\)</span>\n                      \n                    </span>) of 0.0485 and 0.9164, respectively, as well as strong noise immunity. This method also achieves favorable inversion results on the Volve field seismic data.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"36e1c05ada7f67d10979f3d244d2046f085012e2b9cd18a9998965a1c90846f3","category":"Environment"}