{"title":"First-line infertility treatment in normal or subnormal sperm: Interest of a simplified pre-IMSI test","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307080","date":1721052000000,"content":"<p>by Julien Sigala, Sophie Poirey, Julien Robert, Olivier Pouget, Thibault Mura, Stephanie Huberlant, Nathalie Rougier</p>\r\nBackground <p>In the field of male infertility, when sperm is normal/subnormal, a few “add-on” routine tests can complete the basic semen examination.</p> Objectives <p>The aim of this study was to develop and evaluate a faster, simplified motile sperm organelle morphology examination (MSOME) technique for selected infertile patients with apparently normal/subnormal sperm and, in their background: failure of two or three intrauterine insemination (IUI) cycles, repeatedly fragmented embryos, embryonic development to blastocyst-stage failures, repeated miscarriages, a long period of infertility or 2 or more IVF attempts without pregnancy.Our test results were correlated with IUI, conventional <i>in vitro</i> fertilization (IVF), intracytoplasmic sperm injection (ICSI) and intracytoplasmic morphologically selected sperm injection (IMSI) outcomes.</p> Materials and methods <p>We validated an adapted version of the MSOME analysis called the pre-IMSI test (PIT), based on vacuole evaluation alone. 248 infertile patients from our assisted reproductive technology (ART) Center were retrospectively selected and split into three PIT score subgroups (patients with ≤8% (score I), 9 to 15% (score II) and ≥16% normal spermatozoa (score III)) based on the correlation between PIT results and each ART technique outcome. The choice of one or another of these ART techniques had been made according to the usual clinico-biological criteria.</p> Results <p>Clinical outcomes for each of the three PIT subgroups were compared individually for the different ART techniques. For ICSI, the effect of the PIT score subgroup was significant for clinical pregnancies (p = 0.0054) and presented a trend for live births (p = 0.0614). Miscarriage rates of IVF attempts were statistically different depending on the PIT score (p = 0.0348). Furthermore, the odds ratios of clinical pregnancy rates were significantly different according to PIT score subgroup when comparing ICSI <i>vs</i>. IMSI or IVF <i>vs</i>. ICSI attempts.</p> Discussion <p>IMSI appears to be recommended when sperm belongs to PIT score I, ICSI when it belongs to PIT score II and IVF or IUI when sperm is of PIT score III quality in selected infertile couples. The lack of statistical power in these PIT subgroups means that we must remain cautious in interpreting results.</p> Conclusion <p>Our results support the interest of this simplified test for certain couples with normal/subnormal sperm to help choose the most efficient ART technique, even as first-line treatment.</p>","author":"Julien Sigala","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"36e88c32fcb37a5408022600d9afd4a1435caf5b8e543604b1954931ff2c2f06","category":"Interdisciplinary"}