{"title":"205 Detection of anemic sheep using ocular conjunctiva images and deep learning technology","link":"https://academic.oup.com/jas/article/102/Supplement_2/1/7664791?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>In sheep, severe anemia often results from gastrointestinal nematodes infections, commonly caused by <span>Haemonchus contortus</span>, a blood-sucking nematode. The objective of the study was to develop a model to predict packed cell volume (PCV) in sheep through ocular conjunctiva images as a real-time anemia diagnosis approach. We collected 3,291 ocular conjunctiva images from 392 sheep on three different farms using an iPhone 8 (12-megapixel). To identify the region of interest in the images (ocular conjunctiva), we annotated 480 images using the Segment Anything Model (SAM). Subsequently, we employed an image segmentation algorithm based on U-net, utilizing the original images and annotations obtained from SAM. We then cropped the segmented images to retain only the region containing the ocular conjunctiva. These cropped and segmented images were used as input data, with PCV as the target variable, in both classification and regression models, while exploring three different deep neural network (DNN) architectures: VGG19, Inception v3, and Xception. We set a threshold of 27% (anemic &lt; 27%, non-anemic ≥ 27%) to convert PCV into a binary variable for classification models. The dataset was split in train, validation and test sets using random by sheep strategy to perform the analysis of the segmentation and prediction models. The segmentation was tested using intersection over union (IoU) as an evaluation metric. To assess and compare predictive quality in the test set, we calculated accuracy, precision, recall, and F<sub>1</sub> score for classification models, and R<sup>2</sup> for regression models. The U-net segmentation model demonstrated good localization accuracy and reliable segmentation ability, with an average IoU of 0.93, 0.84 and 0.68 in the train, validation and test set, respectively. VGG19 outperformed the other models in classifying individuals as anemic or non-anemic, achieving an F<sub>1</sub> score of 0.60, indicating its moderate ability to distinguish between these two classes. For regression, Xception provided the best performance with an R<sup>2</sup> of 0.29, suggesting that 29% of the variance in PCV can be explained by the model’s predictions. This innovative approach not only expands the possibilities for integrated high-throughput phenotyping through computer vision but also aids in identifying anemic animals. The results suggest that using ocular conjunctiva images and DNN technology can contribute to support farm-level management decisions, and potentially reduce economic losses due to parasitic infections like <span>H. contortus</span>. Furthermore, this approach reduces the cost of blood tests for anemia identification while allowing for real-time anemia diagnosis.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"36ef109207a94fcec1a741b084763c0df4cfccbcaf60809482658548c37bd3cc","category":"Environment"}