{"title":"NASA ให้ทุนบริษัทพัฒนาสถานีอวกาศเอกชน 3 แห่งใช้แทน ISS, Blue Origin ได้งานแล้ว","link":"https://www.blognone.com/node/126158","date":1638762042000,"content":"<div><div><div><p>NASA เซ็นสัญญากับบริษัทอเมริกัน 3 แห่งคือ Blue Origin, Nanoracks, Northrop Grumman ออกแบบสถานีอวกาศในอนาคต ที่จะใช้แทนสถานีอวกาศนานาชาติ</p>\n<p>สถานีอวกาศนานาชาติ (International Space Station หรือ ISS) ถูกยิงขึ้นวงโคจรโลกมาตั้งแต่ปี 1998 และมีอายุการใช้งานไปจนถึงปี 2030 เป็นอย่างน้อย</p>\n<p>NASA ระบุว่าตอนนี้ได้เวลาเตรียมสถานีอวกาศใหม่ๆ ในระดับวงโคจรต่ำ (low-Earth orbit) มาทดแทน ISS โดยแนวทางของ NASA คือกระตุ้นให้บริษัทเอกชนสร้างสถานีอวกาศเชิงพาณิชย์ขึ้นมารองรับลูกค้าทั้งรัฐบาลและเอกชน ผ่านการให้ทุนสนับสนุนในครั้งนี้ มูลค่ารวม 415.6 ล้านดอลลาร์</p>\n<p>เมื่อเดือนตุลาคม <a href=\"https://www.blognone.com/node/125490\">Blue Origin เปิดตัวสถานีอวกาศ Orbital Reef</a> มาก่อนแล้ว ส่วนบริษัทอื่นคือ Nanoracks มีสถานีอวกาศชื่อ Starlab พัฒนาร่วมกับ Voyager Space และ Lockheed Martin มีกำหนดยิงขึ้นวงโคจรในปี 2027 และ Northrop Grumman มีโครงการดีไซน์สถานีอวกาศของตัวเองเช่นกัน</p>\n<p>ภาพดีไซน์สถานีอวกาศของ Northrop Grumman</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9fb08555f2af90f56d72f1e158e746d3.jpg\" /></p>\n<p>ภาพดีไซน์สถานีอวกาศ Starlab ของ Nanoracks</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2a0c583c7cc52196f9d7552eda4cd2b5.jpg\" /></p>\n<p>การให้ทุนของ NASA แบ่งออกเป็น 2 เฟส โดยเฟสแรกเป็นการดีไซน์สถานีอวกาศ เสร็จสิ้นในปี 2025 ส่วนเฟสที่สองจะรับรองนักบินอวกาศของ NASA ให้สามารถใช้งานสถานีอวกาศเอกชนเหล่านี้ได้ และเป้าหมายสุดท้ายคือ NASA จะซื้อบริการใช้สถานีอวกาศของเอกชน</p>\n<p>ที่มา - <a href>NASA</a> via <a href=\"https://www.theregister.com/2021/12/03/nasa_space_station/\">The Register</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/nasa\">NASA</a></div><div><a href=\"/topics/blue-origin\">Blue Origin</a></div><div><a href=\"/topics/space\">Space</a></div><div><a href=\"/topics/iss\">ISS</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"370e27e617e29ae6eec469b764d8a64b7668a07daa4ad59023b6b320ddb7b919","category":"Thai"}