{"title":"Numerical and Performance Analysis of R290 Heat Pump Driven Air Conditioning System for Heating and Cooling","link":"https://www.preprints.org/manuscript/202407.1885/v1","date":1721822534000,"content":"As the demand of heating and air conditioning is increasing day by day due to getting a comfortable life, for that reason, the market for heat pump and air conditioning systems or both, is seeing a steady increase in low global warming potential. All researchers on heat pump and air conditioning systems are searching for environmentally friendly refrigerants. However, a significant number of contemporary refrigerants (HCFCs) have the potential to cause global warming and ozone depletion, such as those found in heat pump air conditioning systems. Using more environmentally friendly refrigerants, including hydrocarbon and blend refrigerant mixtures, is one way to lower GWP and Ozone depletion potential. This study examines the performance of several alternative refrigerants, including R32, R134A, R410A, R22, and R290. In order to examine the performance of R290, theoretical and simulation results are compared on various refrigerants while taking into account a number of performance parameters, including the refrigerant energy efficiency ratio, mass flow rate, coefficient of performance, cooling capacity, and compressor work for one ton of refrigeration (1TR) air conditioners. One player with a very low GWP is R290. However, the only drawback is that it can catch fire and is hazardous to use in split-type commercial heat pump air conditioning applications. The environmental and thermo physical properties of HC-290 are significantly better than those of other materials, according to theoretical and simulation studies utilizing Cool Pack software, hence it is a viable replacement.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3712151a1cdab0948150d58748e0d643740ae107453344f28fb6626ca504dd9c","category":"Interdisciplinary"}