{"title":"AeroCoach analysis | Tour de France stage 20 time trial tech and performance predictions","link":"https://www.bikeradar.com/features/2021-tour-de-france-stage-20-predictions/","date":1626450316000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/GettyImages-1326317992-d2297ca.jpg?quality=45&amp;resize=620,413\" />                                            <p>The 2021 <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> looks to be all but wrapped up, with Tadej Pogačar having fended off all attacks and beaten the best of the rest on all terrains.</p>\n<p>A time trial at the Tour de France is always a prestigious event, though, especially with a stage victory up for grabs. The purest test of brains and brawn in road cycling, we can expect to see the sport’s fastest riders out in full force.</p>\n<p>Having seen the performance of Pogačar in this year’s race, and especially in <a href=\"https://www.bikeradar.com/features/2021-tour-de-france-stage-five-predictions/\" target=\"_blank\">the time trial on stage five</a>, we wouldn’t expect to see any change in the top step of the <a href=\"https://www.bikeradar.com/features/tour-de-france-jargon-buster/#:~:text=kite-,General%20classification,the%20fabled%20yellow%20jersey,-Grand\">general classification</a> (barring any incidents, like a serious crash), but further down the list there may well be significant movement.</p>\n<p>Outside of the GC battle, we can also look forward to the time-trial specialists turning huge gears and motoring along at speeds mere mortals can only dream of.</p>\n<p>Ahead of stage 20, we asked cycling aerodynamics expert, performance consultant and friend of BikeRadar, Dr Xavier Disley, to analyse the course, where tech could present an advantage and the riders to watch on the day.</p>\n\n<hr /><p>Stage 20 of the 2021 Tour de France is another pre-Champs-Élysées <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-your-best-ever-time-trial/\" target=\"_blank\">time trial</a> to finalise the general classification and give riders a chance to move up after some punishing mountain stages.</p>\n<p>It is a point-to-point 30.8km TT starting in Libourne and finishing in Saint-Émilion, with less challenging gradients than stage five’s time trial, but still with a technical central section and some fast descents.</p>\n<h2>The situation</h2>\n<p>There have only been three leaders of the Tour de France in 2021, and each have been worthy wearers of the <a href=\"https://www.bikeradar.com/features/tour-de-france-jersey-colours/\" target=\"_blank\">maillot jaune</a>.</p>\n<p><a href=\"https://www.bikeradar.com/features/pro-bike/julian-alaphilippe-specialized-s-works-tarmac-disc-2019-tour-de-france/\" target=\"_blank\">Julian Alaphilippe</a> – no stranger to wearing non-team jerseys – Pogačar, the winner of last year’s Tour and, of course, <a href=\"https://www.bikeradar.com/news/mathieu-van-der-poel-yellow-canyon-aeroad-cfr/\" target=\"_blank\">Mathieu van der Poel</a>.</p>\n<p>We have to go back to 2014 and Vincenzo Nibali’s victory for the last time a Tour saw only three maillots jaunes – usually we see four or five different riders throughout the length of the race.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Vingegaard currently sits in second place behind Pogačar.</span></figcaption><span> <i>Christophe Ena - Pool / Getty Images</i></span></div>\n<p>As expected, Tadej Pogačar leads the general classification, with Jonas Vingegaard currently sat in second place, six seconds ahead of Richard Carapaz in third.</p>\n<p>Vingegaard – even given his inexperience in grand tours (a 46th place finish at the 2020 Vuelta a España is his only grand tour result) – has performed admirably in the final week.</p>\n<p>Normally the reserve of the older riders with a few grand tours in their legs, he has been on the attack to try and shake Pogačar on more than one occasion.</p>\n<p>Carapaz has attempted to alternately split the group with his team, as well as sandbag when a selection has been made, but to no avail.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Pogačar has dominated this year’s race, including the stage five time trial.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>Pogačar’s stranglehold on the race is absolute at this year’s Tour and nothing short of a mishap is going to remove him from a second Tour victory.</p>\n<p>Further back down the GC we have Ben O’Connor a further 2 minutes and 30 seconds back in fourth.</p>\n<p>Wilco Kelderman is in fifth, 32 seconds down on O’Connor at 8 minutes and 18 seconds.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Uran has had a tough few days leading into the final stages of the race.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>The biggest loser in recent days has been Rigoberto Uran, dropping down the standings, and out of contention for a podium spot after losing nearly nine minutes on stage 18.</p>\n<p>Will the time trial cause a change in the podium as it currently stands? It’s unlikely, but stranger things have happened, so a closer look at the stage will determine what’s possible.</p>\n<h2>2021 Tour de France stage 20 time trial preview</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Stage 20 takes in 30.8km from Libourne to Saint Émilion.</span></figcaption><span> <i>ASO</i></span></div>\n<p>Starting in Libourne, stage 20 takes a few twists and turns for the first 8km before settling into the road to Lussac.</p>\n<p>There is a slight drag to start but with a gradient of less than one per cent, it won’t trouble any of the riders – not even those just wishing to make the time cut. The first time check at Pomerol at 7.5km won’t reveal too much.</p>\n<p>After 15km, the race approaches Lussac, and the start of a 6km section to Montagne, which will give the riders an opportunity to gain time if they’re feeling good (but also lose time if their legs are shot).</p>\n<p>Going too hard on this section will affect the remaining 10km of the race, and the second time check at Montagne will be much more illuminating as to who will fight for the win on this stage.</p>\n<p>The distance between time check one and time check two is 12.5km. This section will take the riders around 15 minutes to complete and a difference of just 10 watts here is worth a full 10 seconds.</p>\n<p>Bearing in mind Carapaz and Vingegaard are currently only separated by six seconds, and O’Connor and Kelderman 32 seconds, small differences will start to add up.</p>\n<p>From the second time check to the finish, it will be fast and non-technical, with a drag to the finish aided by a high-entry speed.</p>\n<p>This section will take less than 13 minutes with speeds of well over 50kph. At such high speed, aerodynamics play a major part, with a five per cent decrease in aerodynamic drag saving 12 seconds.</p>\n<p>Overall, the stage will take around 35 minutes, with average speeds in excess of 52kph for the top riders. Temperatures are forecast to be in the mid-to-high 20s (ºCelcius), so that won’t be an issue for riders worried about overheating or being too cold, making it ideal time trialling temperature.</p>\n<h2>How much of a difference could tech actually make in the stage 20 time trial?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A full aero setup with no concessions to weight is the fastest setup for this course.</span></figcaption><span> <i>Michael Steele / Getty Images</i></span></div>\n<p>Much like stage five, this is not a mountainous time trial like we’ve seen in some stage races this year – for example the Tour of Switzerland or, indeed, the final time trial of the Tour in 2020, where bike swaps abounded and kit selection was agonised over (and no consensus was reached!) between the different teams.</p>\n<p>Full aero equipment, with no concessions made to weight, will be the fastest option for this stage.</p>\n<p>A decrease in mass of 1kg will only be worth a handful of seconds in total, and not worth it at all if the lighter components or bike you are using are less aerodynamic or increase rolling resistance (which is nearly always the case).</p>\n<p>To put that into context, 1kg of mass savings is the equivalent of a 0.3 per cent change in total aerodynamic drag, which is a relatively small adjustment to the overall aerodynamic drag of the bike and rider.</p>\n<p>In the real world, this could be something as simple as a badly placed cable on the bike, or a GPS head unit that is sat too high.</p>\n<p>For comparison, swapping a standard front wheel to a more aerodynamic one could add up to a one to two per cent change in overall aerodynamic drag.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Unless it is designed to integrate with the bike (as seen on this Canyon Speedmax), riders should ditch their water bottle.</span></figcaption><span> <i>Michael Steele / Getty Images</i></span></div>\n<p>Losing the water bottle is a must for riders looking to save every last watt in this short TT, unless it’s specifically designed to integrate with the bike.</p>\n<p>Overall, a change in aero drag of five per cent (making a series of poor aero choices such as incorrect wheels, round bottle etc.) is worth around 32 seconds. I</p>\n<p>f you’ve been paying attention, you will note this is the exact difference between Kelderman and O’Connor on GC.</p>\n<h2>So what’s going to happen? Who will win the stage 20 time trial?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Vingegaard would have to put in a superhuman effort to overturn Pogačar’s lead.</span></figcaption><span> <i>Ena - Pool/Getty Images</i></span></div>\n<p>To overturn his five minute and 45-second deficit, Vingegaard would have to ride (all things being equal) at a power output 271w higher than Pogačar, at an average speed of more than 63kph.</p>\n<p>This isn’t going to happen, nor should we expect Pogačar to lose the battle between the GC contenders on the day, having put in a monster performance on stage five to win overall and cement his tilt at the maillot jaune.</p>\n<p>Vingegaard has performed exceptionally well in time trials this year, taking third in the opening stage of the Itzulia Basque Country and seventh in the tough stage four time trial at the Criterium du Dauphine.</p>\n<p>He also took third in the Tour’s first time trial on stage five, ahead of time trial specialists like Wout Van Aert, Kasper Asgreen and Mattia Cattaneo, and every other GC contender apart from Pogačar.</p>\n<p>As on stage five, then, Carapaz will likely lose more time to Vingegaard, but will keep his third place.</p>\n<p>Kelderman, O’Connor and Carapaz have all performed similarly in time trials this year and were all within seconds of each other on stage five.</p>\n<p>It’s possible O’Connor might extend his lead over Kelderman given the course profile. However, fatigue over the previous days and recovery from stage 19 are always unknown until you roll down the start ramp.</p>\n<p>Outside of the GC contenders, we have the true time trial specialists. Asgreen and Cattaneo, along with Switzerland’s Stefan Kung and Stefan Bissegger will be aiming for a good result.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Max Walscheid could put in a (literally) big performance on the day.</span></figcaption><span> <i>Michael Steele / Getty Images</i></span></div>\n<p>Other powerful rouleurs like <a href=\"https://www.bikeradar.com/features/tallest-pro-cyclist/#:~:text=trick-,Who%20are%20the%20tallest,1.99m,-Michael\">Max Walscheid</a>, who performed well in the final time trial at this year’s Giro d’Italia, and Nils Politt – who’ll surely have motivation for another good result after his win in stage 12 – could also do well.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Van Aert could feasibly take the win on the day.</span></figcaption><span> <i>Ena - Pool / Getty Images</i></span></div>\n<p>Van Aert hasn’t gone easy in a time trial yet and, in preparation for the <a href=\"https://bikeradar.com/events/tokyo-2020\">Tokyo Olympics</a>, has one last shot at a time trial win before the games start in just over a week’s time.</p>\n<p>Given his excellent form (van Aert also won the <a href=\"https://www.bikeradar.com/features/pro-bike/aero-vs-lightweight-mont-ventoux/\" target=\"_blank\">Ventoux stage</a> earlier in the race), he will be a hot favorite for this slightly flatter time trial, along with Kung and Pogačar.</p>","author":"Dr Xavier Disley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"372c07b881d482f66a44a253b2178f4ce91c0da1d848bc745fd614a30cf568ea","category":"Cycling"}