{"title":"Phil Spencer ยืนยันตลาดพีซีสำคัญเท่าคอนโซล ยอดขายเกมพีซีแตะ 1 พันล้านดอลลาร์ปีนี้","link":"https://www.blognone.com/node/134311","date":1686620551000,"content":"<div><div><div><p>Phil Spencer หัวหน้าธุรกิจเกมของไมโครซอฟท์ ให้สัมภาษณ์ถึงแนวทางการออกเกมบนพีซีพร้อมกับบน Xbox ตั้งแต่วันแรก ซึ่งเป็นยุทธศาสตร์ที่ไมโครซอฟท์เน้นมากในช่วงหลัง และแตกต่างจาก<a href=\"https://www.blognone.com/node/134010\">โซนี่ที่ประกาศตัวชัดว่าจะออกเกมพีซีหลังจาก PlayStation ประมาณ 2-3 ปี</a></p>\n<p>Spencer ยืนยันว่าไม่ได้มองพีซีเป็นช่องทางทำเงินเพิ่มเติม แต่มองว่าเป็นตลาดหลักอีกอัน (we don’t look at the PC audience as a window, right, it’s a market) เป็นแพลตฟอร์มที่ไมโครซอฟท์ต้องวางขายเกมตั้งแต่แรก ไม่ใช่นำเกมเก่ามาขายตอนหลัง</p>\n<p>Spencer ยังระบุว่ายอดขายเกมพีซีของไมโครซอฟท์ดีขึ้นเรื่อยๆ และจะทำรายได้รวมทั้งปีได้เกิน 1 พันล้านดอลลาร์ในปีนี้ ส่วนยอดสมาชิก PC Game Pass เติบโตขึ้นกว่า 100% เทียบกับปีที่แล้ว ฐานผู้เล่นเกมไมโครซอฟท์บนพีซีทั้งหมดเติบโตขึ้นเกือบ 50%</p>\n<p>อย่างไรก็ตาม Spencer ยอมรับว่าไมโครซอฟท์สามารถพัฒนาประสบการณ์เล่นเกมพีซีให้ดีขึ้นกว่านี้ได้ แอพ Xbox บนพีซีต้องดีกว่านี้อีก</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e9d91d293e9776d6a40824a63e323e26.jpg\" /></p>\n<p>ก่อนหน้านี้ไม่นาน Spencer ให้สัมภาษณ์กับรายการพ็อดคาสต์ Kinda Funny Games Xcast ยอมรับว่าตลาดคอนโซลแข่งขันสูงมาก ไมโครซอฟท์อยู่อันดับสามในตลาด ไม่สามารถเอาชนะโซนี่หรือนินเทนโดได้ตรงๆ ในแง่ยอดขายคอนโซล และการสร้างเกมดีๆ เพียงอย่างเดียวไม่เพียงพอต่อการเอาชนะคู่แข่งได้ ต่อให้ Starfield ได้รีวิว 11 เต็ม 10 ก็ไม่ทำให้คนขาย PS5 มาซื้อ Xbox แต่อย่างใด</p>\n<p>Spencer ยังชี้ว่าตลาดคอนโซลทุกวันนี้ใช้ระบบคลังเกมดิจิทัลที่ส่งต่อกันเจนต่อเจนได้ ผู้เล่นสะสมคลังเกมของตัวเองทำให้ย้ายค่ายได้ยาก และไมโครซอฟท์ทำพลาดไปตอนเจน Xbox One ซึ่งเป็นจุดเริ่มต้นของเกมดิจิทัล ทำให้คลังเกมของไมโครซอฟท์ด้อยกว่าคู่แข่งอยู่มาก</p>\n<p>ที่มา - <a href=\"https://www.videogameschronicle.com/news/xbox-says-pc-audience-isnt-a-window-its-a-market-that-deserves-our-games-day-1/\">VGC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/xbox\">Xbox</a></div><div><a href=\"/topics/phil-spencer\">Phil Spencer</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"372e5fc571f7e5ae8a40329c49cc9950586bb2ab4fe7b0ea8a7132aec85b75bc","category":"Thai"}