{"title":"wcm.04.2024.480.486","link":"https://www.watconman.org/wcm-04-2024-480-486/","date":1729138884000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>ENVIRONMENTAL IMPACT OF WASTEWATER TREATMENT PLANT USING LIFE-CYCLE ASSESSMENT– CASE STUDY IN JORDAN</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Shorouq Bani Ata, Ahmad Jamrah, Tharaa M. Al -Zghoul</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.04.2024.480.486\">10.26480/wcm.04.2024.480.486</a></em></span></p>\n<h3>Abstract</h3>\n<div><img src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />Al-Samra Wastewater Treatment Plants (WWTPs) play a vital role in Jordan in treating wastewater to preserve the ecosystem and public health. A life cycle assessment (LCA) approach is employed to assess the ecological impact of Al-Samra WWTP through the years 2021 and 2022. This research aims to employ LCA for the Al-Samra operational phase and quantify the key potential environmental impacts associated with its operation and Gate-to-Grave boundary using the OpenLCA software tool and the Recipe 2016 midpoint (H) method. The LCA results reveal that the Al-Samra WWTP in 2021 had the most significant impact when compared to the year 2022 in categories of global warming, ionizing radiation, land use, ozone formation-human health, ozone formation-terrestrial ecosystems, and stratospheric ozone depletion, while in 2022 Al-Samra WWTP had the highest impact assessment results compared to the year 2021 in other categories like fine particulate matter formation, fossil resource scarcity, mineral resource scarcity, terrestrial acidification, and water consumption. The main contributors to environmental impact are inlet load and flow in the operation phase, which relies on electricity as the energy source and contributes significantly to the overall environmental impact. Based on these potential results, the research highlights the importance of implementing sustainable practices to reduce the ecological effects of WWTPs.</div>\n<h3>Keywords</h3>\n<p><span>Life cycle assessment (LCA), wastewater treatment plants (WWTPs), Al-Samra wastewater treatment plant, case study, openLCA.</span></p>\n<h3><strong>1. INTRODUCTION</strong></h3>\n<div>\n<p>Countries worldwide are experiencing increasing global water stress due to a lack of water supply and deteriorating quality because of the exponential increase in the world’s population, industrialization, and agricultural activities (Kamble et al., 2018; Al-Zghoul et al., 2023). Therefore, taking the proper actions, such as treating wastewater produced by daily activity and reusing it, will aid in resolving the issues of water scarcity and declining river and ocean water quality (Jabr et al., 2019; Jamrah et al., 2023). Wastewater treatment plants (WWTPs) are designed to reduce the amount of contaminants in wastewater before it is released into the environment (Gallego-Schmid and Tarpani, 2019; Allami et al., 2023). One significant issue in emerging nations is the need for more WWTPs. However, WWTPs are one of the primary sources of greenhouse gases (GHGs) emissions, which helps increase global warming by releasing CO2, N2O, and CH4 into the atmosphere (Nguyen et al., 2019; Gallego-Schmid and Tarpani, 2019). According to estimates, 5% of the world’s GHGs emissions come from WWTPs (Nghiem et al., 2017).</p>\n<p>Jordan, as one of the poorest countries in the world in terms of availability of fresh water, faces great challenges in preserving groundwater sources from excessive depletion, and ensuring a fair distribution of water between different sectors (Hamaideh et al., 2024). With apparent effects on cities, businesses, social systems, agriculture, and food security, it is becoming more vulnerable to climate change (Gallego-Schmid and Tarpani, 2019). Even though Jordan’s GHGs emissions are relatively low globally, it is one of the countries where the effects of climate change are starting to be seen (Ministry of Environment, 2022). Due to the severe water scarcity that Jordan suffers from, it has become necessary to adopt a sustainable management approach to these limited resources to address these challenges (Nguyen et al., 2019; Alazaiza et al., 2024). This requires taking comprehensive measures at the policy and legislative levels, investing in water harvesting, treatment and recycling technologies, and enhancing community awareness of the importance of rationalizing water consumption. It became Jordan’s environmental protection law requiring facilities to conduct an environmental impact assessment (EIA) study to identify environmental gaps and work to improve them (Ministry of Environment, 2022).</p>\n<p>Before constructing WWTPs and to ensure that they comply with a certain design and operation that will not hurt the environment, studies like life cycle assessment (LCA) are essential. LCA examines how an item or system affects the environment and quantifies the possible lifetime impacts of WWTPs during its extraction, manufacture, distribution, use, and disposal of raw materials (Curan, 2005). The LCA method entails identifying and analyzing various environmental impacts, including using primary resources, GHGs emissions, waste production, depletion of resources, and pollution of the air, water, and soil (Curan, 2005). While WWTPs provide direct environmental benefits, but they also have negative impacts because of their high energy requirements for operating the treatment facilities and infrastructure (Rashid et al., 2023). When evaluating WWTPs, it is important to consider not just the environmental impacts, but also compliance with the technology costs and regulatory requirements involved (Rashid et al., 2023). Other key factors include the regional/global environmental impacts, socioeconomic conditions, and location (Rashid et al., 2023). To assess these various factors, LCA tools are frequently used, with software options such as Umberto, Gabi, OpenLCA, Semipro, and others (Iswara et al., 2020). These LCA approaches provide a more comprehensive analysis to inform decision-making around WWTPs.</p>\n<p>One well-known and user-friendly software program that enables LCA is OpenLCA (Kiemel et al., 2022; Allami et al., 2023). A key advantage of OpenLCA is that it allows users to work with a variety of LCA databases, which experts endorse for the software’s usability and the breadth of its underlying data (Delre et al., 2019). The application of LCA methodology can be particularly valuable in the optimization of operational parameters for WWTPs. By evaluating the full life cycle impacts, LCA can help WWTPs meet the requirements outlined in the ISO 14040 standard and inform optimal decision-making (Aleisa and Al-Mutiri, 2022). This holistic approach ensures that all relevant environmental impacts, such as GHGs emissions, energy use, and material inputs and outputs, are quantified and compared across different WWTP configurations (Kyung et al., 2015; Larrey-Lassalle et al., 2017). Overall, the LCA framework facilitated by tools like OpenLCA enables a thorough and systematic evaluation of the environmental performance of complex systems like WWTPs. This information can then be leveraged to drive continuous improvement and more sustainable outcomes.</p>\n<p>Research in the wastewater sector using the LCA approach is limited worldwide; in the Middle East, it is minimal, and in Jordan, for example, LCA is not a legal requirement in EIA. Many countries, especially in the Middle East, may need more funding, technical capabilities, and access to accurate data, which can hinder the adoption. The Research will contribute to increasing the global adoption of the LCA approach in WWTP projects, including those in the Middle East, raising the bar for sustainability in environmental assessment procedures and directing improvements and ideas for ecological management. However, despite the significant influence LCA can have on decision-making related to sustainable development goals (SDGs) and environmental conservation, the application of LCA to full-scale WWTPs operational and design alternatives remains limited. WWTPs can be designed based on a variety of social, economic, and technical factors, and these design choices can greatly impact the potential strategies for performance improvement. This research presents a case study from Jordan to serve as a model for environmental impact studies that employ the life cycle approach for other WWTPs and how to quantify and analyse the contribution. The goal of this study was to conduct an LCA using the OpenLCA software for Al-Samra WWTP’s as a case study by finding potential environmental impacts. Finding Al-Samra WWTP’s potential environmental impacts utilizing LCA for the operational phase can provide a baseline reference for the Samra Plant’s ecological performance to make it possible to compare it later with any potential environmental benefits or drawbacks during the operational and demolition phases.</p>\n<p><strong>2. MATERIALS AND METHODS</strong></p>\n<p><strong>2.1 The Case-Study WWTP</strong></p>\n<p>One of Jordan’s largest wastewater treatment facilities in terms of size is the Al-Samra WWTP, so it selection as a case study and its utilization of cutting-edge technology to guarantee the most excellent purification rates (Jabr et al., 2019). Al-Samra WWTP is in Jordan, inside the Al Hashimiya area in the governorate of Al-Zarqa, thirteen kilometers north of Zarqa and thirty-six kilometers, roughly to the Capital of Jordan, Amman. AL-Samra WWTP is designed to treat domestic wastewater discharged from the Zarqa river basin, including the three most populous cities in the nation: Amman, Russeifa, and Zarqa. Additionally, the facility generates treated water that can be used for irrigation, essential for sustaining agricultural activity in the area (Abu-Shams and Rabadi, 2003). Figure 1 illustrates the study area’s location.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"763\" height=\"568\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/F1-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/F1-1.jpg 763w, https://www.watconman.org/wp-content/uploads/2024/10/F1-1-300x223.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The building of the Al-Samra plant was completed in 2008. Al-Samra WWTP is a public-private partnership (PPP) that uses the build-operate-transfer (BOT) approach to finance the construction and upkeep of a public project. It is essential to Jordan’s social, environmental, and economic growth because it is the country’s first BOT project (Abu-Shams and Rabadi, 2003). Under the same BOT concept as in 2010, the Al-Samra plant’s capacity will be enhanced by approximately 40% to accommodate growing wastewater flows predicted in the Amman and Zarqa areas for the horizon of 2025. Now, the project involves expanding the Al-Samra WWTP, which will be based on the same process. This will involve building the operations and adding structures and machinery that the plant now utilizes (Hanjra et al., 2015).</p>\n<p><strong>2.2 Goal and Scope Definition</strong></p>\n<p>The first stage of the LCA analysis establishes the goal and scope of the assessment. LCA was implemented to find the potential environmental impacts of the Al-Samra WWTP operational phase based on the data for the years 2021 and 2022. About the scope, Samra WWTP was divided into three subsystems as follows: Sub1, “preliminary and primary treatment,” Sub2, “secondary and tertiary treatment,” and Sub3, “sludge treatment.”</p>\n<p><strong>2.3 Functional Unit (FU) </strong></p>\n<p>The FU gives a reference point from which the process inputs and outputs can be standardized (Zhu et al., 2013). The FU here is the flow rate. At the WWTP inflow point, it is defined as one cubic meter of wastewater.</p>\n<p><strong>2.4 System Boundary </strong></p>\n<p>The defining of the system border plays a vital role in determining which processes will be included in the system or excluded from it. Gate-to-Grave approach was adopted. Figure 2 shows the system boundary designed to apply the LCA Study for Al-Samra WWTP, considering the subsystems.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"763\" height=\"539\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/F2-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/F2-1.jpg 763w, https://www.watconman.org/wp-content/uploads/2024/10/F2-1-300x212.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>2.5 Life Cycle Inventory (LCI) </strong></p>\n<p>This step involves gathering and defining a system’s inputs and outputs. An inventory analysis analyzes the energy and resources used and the environmental emissions related to every process in the system (Guinée et al., 2011). The inventory data for Samra WWTP for 2021 and 2022 inputs was collected primarily from MWI and Samra WWTP reports. In addition, the possible outputs were taken from OpenLCA software databases. The primary resources used in a WWTP process are shown in Table 1.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"713\" height=\"614\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/T1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/T1.jpg 713w, https://www.watconman.org/wp-content/uploads/2024/10/T1-300x258.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>2.6 Life Cycle Impact Assessment (LCIA) </strong></p>\n<p>The third stage of an LCA is the life cycle impact assessment (LCIA). To better comprehend the extent and significance of the outcome, elementary flows from the LCI study are transformed here into their possible impact on the environment. Category impact, classification, and characterization are required phases in an LCIA, according to the ISO 14040 series. Several methods, including CML 2001, cumulative energy demand, Eco indicator 99, ecological footprint, ecological scarcity 1997 and 2006, ecosystem damage potential (EDP), EPS 2000, IMP ACT 2002+, IPCC 2001, Recipe midpoint and endpoint approach, TRACI, and USEtox, have been developed by environmental research centres to calculate the results of impact assessments.</p>\n<p><strong>2.7 Recipe 2016 Midpoint Method </strong></p>\n<p>Recipe 2016 Midpoint is the impact assessment method used in this research per the objective to find the potential environmental impact according to the inventory data for Al-Samra WWTP in years 2021 and 2022, such as global warming, ionizing radiation, land use, ozone formation-human health, ozone formation-terrestrial ecosystems, and stratospheric ozone depletion, fine particulate matter formation, fossil resource scarcity, mineral resource scarcity, terrestrial acidification, and water consumption. For carrying out life cycle evaluations and applying the Recipe method, openLCA 2.0 is a popular software program.</p>\n<p><strong>2.8 OpenLCA 2.0.0 Modelling Tool </strong></p>\n<p>The tool used in this research is OpenLCA 2.0.0 software with the Recipe 2016 midpoint (H) method that aimed to understand the potential environmental effects of the Al-Samra WWTP process in 2021 and 2022. OpenLCA is free software for LCA and sustainability evaluation. Since 2006, Green Delta has been working on its development (Ciroth, 2007). It is free to use and requires no license because it is open-source software.</p>\n<p>The software is excellent for use with sensitive data due to its open-source nature. The software has the following components: product systems are networks of processes, product systems are compared in projects; processes are a set of interconnected activities that convert inputs into outputs; flows are the movement of goods, materials, or energy throughout a product system’s many processes; the indicators and parameters are LCIA techniques for environmental impact assessment. Global parameters apply to the entire database and social LCA indicators. The background information includes flow characteristics, unit types, currencies, sources, actors, and locations (Ciroth, 2007).</p>\n<p><strong>2.9 Interpretation</strong></p>\n<p>Interpretation presents inferences from the data, such as the critical effect causes and potential mitigation strategies (Ahmed, 2011). Inventory analysis outcomes are assessed. The last step in the LCA approach checks sensitivity analysis; it is possible to evaluate the effect of uncertainty on the outcomes of an LCA by utilizing Monte Carlo simulation in OpenLCA. It considers the uncertainty distributions defined in the parameters, fluxes, and characterization factors. The simulation, by selecting values at random from the specified uncertainty distributions based on the sampled distributions, produces several LCA computation iterations, each with a different set of input values.</p>\n<p><strong>3. RESULTS</strong></p>\n<p><strong>3.1 Impact Analysis Results of Al-Samra WWTP </strong></p>\n<p>The ecological implications of the processes are measured during the impact analysis phase. Typically, this phase involves classification and characterization steps. In the classification step, the environmental effects are divided into groups according to their impact, such as water consumption, climate change, human toxicity, etc. The consequences are categorized according to their type and possible environmental effects. During the characterization step of each impact category, the environmental impacts are measured and expressed in a standard unit in this stage. This makes it simpler to compare and aggregate the effects across several categories. According to data inventory in 2021 and 2022, Samra WWTP impact assessment results for subsystems based on the Recipe 2016 midpoint, which finds the potential environmental impact according to 11 categories as presented in Tables 2 and 3 below.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1018\" height=\"309\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/T2.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/T2.jpg 1018w, https://www.watconman.org/wp-content/uploads/2024/10/T2-300x91.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/T2-768x233.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>As shown in Table 2, in 2021 subsystem 1 had the most significant impact in each of the following categories: fine particulate matter formation, fossil resource scarcity, global warming, ionizing radiation, land use, mineral resource scarcity, stratospheric ozone depletion, terrestrial acidification, and water consumption this is due to the primary treatment stage aims to remove suspended solids from the wastewater, and these solids can include organic matter, debris, and other pollutants also the diesel consumption to operate pumps and other equipment used in subsystem 1 led to a higher environmental impact where the primary stage requires the use of natural resources more than other stages in WWTP, such as water, land, and raw materials. Exploiting these resources unsustainably may lead to potential environmental impact and increased greenhouse gas emissions. Also, Table 2 shows that subsystem 2 significantly impacts the category’s ozone formation- human health and ozone formation-terrestrial ecosystems. It can come back to using some chemicals and electricity in subsystem 2, which can contribute to air pollution and negative impacts on health.<br />\n‏</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1013\" height=\"307\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/T3.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/T3.jpg 1013w, https://www.watconman.org/wp-content/uploads/2024/10/T3-300x91.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/T3-768x233.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>As shown in Table 3, in the year 2022, subsystem 1 has the most significant impact on all categories due to the flow rate in the year 2022 entering the Al-Samra WWTP being higher than the flowrate in the year 2021, and this led to the use of natural resources than other stages in WWTP, such as water, land, and raw materials. Exploiting these resources unsustainably may lead to potential environmental impact and increased greenhouse gas emissions.<br />\nFigure 3 shows the results for potential environmental impact according to data gathering in 2021. The maximum result sub1 and sub2 for each indicator is set to 100%, and the outcomes of the remaining options are presented in proportion to this result.</p>\n<p>‏</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"654\" height=\"382\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/F3-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/F3-1.jpg 654w, https://www.watconman.org/wp-content/uploads/2024/10/F3-1-300x175.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The results for potential environmental impact according to data gathering in 2022. The maximum result sub1 for each indicator is set to 100%, and the outcomes of the remaining options are presented in proportion to this result shown in Figure 4.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"689\" height=\"398\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/F4-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/F4-1.jpg 689w, https://www.watconman.org/wp-content/uploads/2024/10/F4-1-300x173.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Further analysis showed that in 2021 Al-Samra WWTP had the most significant impact assessment results when compared to the year 2022. Al-Samra WWTP in 2021 had the most impact in categories of global warming, ionizing radiation, land use, ozone formation-human health, ozone formation-terrestrial ecosystems, and stratospheric ozone depletion as shown in Table 4. In addition, Al- Samra WWTP in 2022 had the highest impact assessment results compared to 2021 in other categories like fine particulate matter formation, fossil resource scarcity, mineral resource scarcity, terrestrial acidification, and water consumption as shown in Table 4.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1014\" height=\"388\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/T4.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/T4.jpg 1014w, https://www.watconman.org/wp-content/uploads/2024/10/T4-300x115.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/10/T4-768x294.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>3.2 Top Contributors to Impact Categories </strong></p>\n<p>In the impact assessment step in the life cycle. Finding hotspots is essential to comprehending the main places that might be improved to lessen environmental effects. This section comprehensively analyses the main contributors affecting Al-Samra WWTP in 2021 and 2022, as shown in Figure 5 to Figure 10.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"491\" height=\"618\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/F56.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/F56.jpg 491w, https://www.watconman.org/wp-content/uploads/2024/10/F56-238x300.jpg 238w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"510\" height=\"617\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/F78.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/F78.jpg 510w, https://www.watconman.org/wp-content/uploads/2024/10/F78-248x300.jpg 248w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"499\" height=\"617\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/F910.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/F910.jpg 499w, https://www.watconman.org/wp-content/uploads/2024/10/F910-243x300.jpg 243w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>According to Figures (5-10), the main contributors in subsystems during the 2021 and 2022 data inventory are as follows: Subsystem (1): Inflow WW Capacity, Subsystem (2): Electricity Consumption, and Subsystem (3): Inlet Load.</p>\n<p>Increased energy use, chemical use, and sludge production are consequences of high inlet loads for WWTPs, and they all adversely affect the environment. As their content increases, more energy and resources are needed to remove pollutants and organic materials from the incoming load. Also, many operations, such as sludge treatment, mixing, aeration, and pumping, require electricity. There may be varying environmental effects depending on whether the energy used to generate electricity comes from renewable or fossil fuels.</p>\n<p>The rate at which wastewater enters the treatment facility impacts efficiency and energy usage. Increased energy use for pumping and aeration procedures at higher flow rates results in higher electricity consumption. Moreover, excessive flow rates can overwhelm the treatment systems, decreasing efficiency and posing environmental contamination risks.</p>\n<p><strong>4. CONCLUSIONS AND RECOMMENDATIONS </strong></p>\n<p>In conclusion, this research has achieved its goal of conducting LCA on Al-Samra WWTP located in Jordan for the operational phase through the years 2021 and 2022 and solved the challenge of measuring impacts by quantifying its potential environmental effects using the OpenLCA software tool and the Recipe 2016 midpoint H method.</p>\n<p>Impact analysis results showed that the Al-Samra WWTP in 2021 had the most significant impact assessment results when compared to the year 2022 in categories of global warming, ionizing radiation, land use, ozone formation-human health, ozone formation-terrestrial ecosystems, and stratospheric ozone depletion. In addition, Al-Samra WWTP in 2022 had the highest impact assessment results compared to 2021 in other categories like fine particulate matter formation, fossil resource scarcity, mineral resource scarcity, terrestrial acidification, and water consumption.</p>\n<p>Among the primary flows, the inlet flow (m3/year), electricity consumption (kwh/year), and inlet load (kg/year) are the main contributors to environmental impact for the Al-Samra operational phase in the years 2021 and 2022.</p>\n<p>In summary, this research offers insightful information into the potential environmental impact of Al-Samra WWTP in Jordan. The findings highlight the necessity of conducting an environmental assessment using the life cycle to comprehend the environmental impact and develop additional strategies to adapt or mitigate their environmental impact in sustainable ways.</p>\n<p><strong>RECOMMENDATIONS</strong></p>\n<p>The following recommendations highlight essential factors to consider for ensuring comprehensive LCA, supporting informed decision-making, and implementing sustainable management practices for WWTP. These recommendations are based on the detailed analysis carried out in this research. Following are a few recommendations for future works based on the current research:</p>\n<p>• It is highly recommended to conduct an environmental impact assessment using the life cycle for WWTPs during the following phases: construction, operation, and demolition, but the need to focus on stages of the system boundary selected for the study and the LCI gathered because the correctness of the results utilizing LCA depends on them.</p>\n<p>• LCA is an iterative process. Use the results from the LCA to drive sustainable changes and put a mitigation plan. LCA is not legally required in most countries like EIA studies, but we find that LCA results can aid compliance with environmental norms and regulations. Stakeholder participation is also encouraged at every stage of the life cycle.</p>\n<p>• Conducting an energy audit in the WWTP to locate potential savings opportunities and considering renewable energy sources like solar to minimize the plant’s ecological footprint.</p>\n<p>• Increase the use of treated wastewater inside WWTP for non-potable purposes like the irrigation of fields, recreational areas, and green spaces. Implement a comprehensive water reuse program to lessen the demand for freshwater resources and ease the strain on water supplies.</p>\n<p>• Additional research may yield valuable perspectives regarding the possible benefits of centralized and decentralized systems concerning energy usage, emissions, and resource retrieval.</p>\n<p>• The LCA approach does not always consider human behaviours, and there are numerous methods to slice data and information to achieve the intended result; we still need to improve it and further research.</p>\n<p>• Further, based on the results of this research. Add social and economic aspects to the WWTP LCA framework. This may entail evaluating various technologies and operational approaches for societal acceptability, economic viability, and cost-effectiveness.</p>\n<p><strong>REFERENCES</strong></p>\n<p>Abu-Shams, I., and Rabadi, A., 2003. Commercialization and public-private partnership in Jordan. International Journal of Water Resources Development, 19(2), Pp. 159-172.<br />\n‏<br />\nAhmed, M. T., 2011. Life cycle analysis in wastewater: a sustainability perspective. Waste water treatment and reuse in the mediterranean region, Pp. 125-154.<br />\n‏<br />\nAlazaiza, M. Y., Alzghoul, T. M., Al Maskari, T., Amr, S. A., and Nassani, D. E., 2024. Analyzing the Evolution of Research on Student Awareness of Solid Waste Management in Higher Education Institutions: A Bibliometric Perspective. Sustainability, 16(13), Pp. 5422.</p>\n<p>Aleisa, E., and Al-Mutiri, A., 2022. Life Cycle Assessment for Tertiary Wastewater Treatment and Reuse versus Seawater Desalination. In IOP Conference Series: Earth and Environmental Science, Vol. 1026, No. 1, Pp. 012001. IOP Publishing.<br />\n‏<br />\nAllami, D. M., Sorour, M. T., Moustafa, M., Elreedy, A., and Fayed, M., 2023. Life cycle assessment of a domestic wastewater treatment plant simulated with alternative operational designs. Sustainability, 15(11), Pp. 9033.<br />\n‏<br />\nAllami, D. M., Sorour, M. T., Moustafa, M., Elreedy, A., and Fayed, M., 2023. Life cycle assessment of a domestic wastewater treatment plant simulated with alternative operational designs. Sustainability, 15(11), Pp. 9033.<br />\n‏<br />\nAl-Zghoul, T.M., Al-Qodah, Z., and Al-Jamrah, A., 2023. Performance, modeling, and cost analysis of chemical coagulation-assisted solar powered electrocoagulation treatment system for pharmaceutical wastewater. Water, 15(5), Pp. 980.<br />\n‏<br />\nCiroth, A., 2007. ICT for environment in life cycle applications openLCA—A new open source software for life cycle assessment. The international journal of life cycle assessment, 12, Pp. 209-210.<br />\n‏<br />\nCuran, M. A., 2005. What is the LCA? United States Environmental Protection Agency, National Risk Management Research Laboratory.</p>\n<p>Delre, A., ten Hoeve, M., and Scheutz, C., 2019. Site-specific carbon footprints of Scandinavian wastewater treatment plants, using the life cycle assessment approach. Journal of cleaner production, 211, Pp. 1001-1014.<br />\n‏<br />\nGallego-Schmid, A., and Tarpani, R.R.Z., 2019. Life cycle assessment of wastewater treatment in developing countries: a review. Water research, 153, Pp. 63-79.<br />\n‏<br />\nGuinée, J. B., Heijungs, R., Huppes, G., Zamagni, A., Masoni, P., Buonamici, R., Rydberg, T., 2011. Life cycle assessment: past, present, and future.<br />\n‏<br />\nHamaideh, A., Al-Zghoul, T., Dababseh, N., and Jamrah, A., 2024. Enhancing Water Management in Jordan: A Fresh Tomato Water Footprint Analysis. Jordan Journal of Agricultural Sciences.<br />\n‏<br />\nHanjra, M. A., Drechsel, P., Mateo-Sagasta, J., Otoo, M., and Hernández-Sancho, F., 2015. Assessing the finance and economics of resource recovery and reuse solutions across scales. Wastewater: Economic asset in an urbanizing world, Pp. 113-136.<br />\n‏<br />\nIswara, A. P., Farahdiba, A. U., Nadhifatin, E. N., Pirade, F., Andhikaputra, G., Muflihah, I., and Boedisantoso, R., 2020. A comparative study of life cycle impact assessment using different software programs. In IOP conference series: earth and environmental science, Vol. 506, No. 1, Pp. 012002. IOP Publishing.<br />\n‏<br />\nJabr, G., Saidan, M., and Al-Hmoud, N., 2019. Phosphorus recovery by struvite formation from Al Samra municipal wastewater treatment plant in Jordan. Desalination and Water Treatment, 146, Pp. 315-325.<br />\n‏<br />\nJamrah, A., Al-Zghoul, T.M., and Darwish, M.M., 2023. A comprehensive review of combined processes for olive mill wastewater treatments. Case Studies in Chemical and Environmental Engineering, 100493.<br />\n‏<br />\nKamble, S.J., Singh, A., and Kharat, M.G., 2018. Life cycle analysis and sustainability assessment of advanced wastewater treatment technologies. World Journal of Science, Technology and Sustainable Development, 15(2), Pp. 169–185.</p>\n<p>Kiemel, S., Rietdorf, C., Schutzbach, M., and Miehe, R., 2022. How to Simplify Life Cycle Assessment for Industrial Applications—A Comprehensive Review. Sustainability 2022, 14, Pp. 15704.<br />\n‏<br />\nKyung, D., Kim, M., Chang, J., and Lee, W., 2015. Estimation of greenhouse gas emissions from a hybrid wastewater treatment plant. Journal of Cleaner Production, 95, Pp. 117-123.</p>\n<p>Larrey-Lassalle, P., Catel, L., Roux, P., Rosenbaum, R. K., Lopez-Ferber, M., Junqua, G., and Loiseau, E., 2017. An innovative implementation of LCA within the EIA procedure: Lessons learned from two Wastewater Treatment Plant case studies. Environmental Impact Assessment Review, 63, Pp. 95-106.<br />\n‏<br />\nMinistry of Environment (MOENV). 2022. National climate change policy of the Hashemite Kingdom of Jordan 2022-2050.<br />\nNghiem, L. D., Koch, K., Bolzonella, D., and Drewes, J. E., 2017. Full scale co-digestion of wastewater sludge and food waste: Bottlenecks and possibilities. Renewable and Sustainable Energy Reviews, 72, Pp. 354-362.<br />\n‏<br />\nNguyen, T.K.L., Ngo, H.H., Guo, W., Chang, S.W., Nguyen, D.D., Nghiem, L.D., Liu, Y., Ni, B., and Hai, F.I., 2019. Insight into greenhouse gases emissions from the two popular treatment technologies in municipal wastewater treatment processes. Science of the Total Environment, 671, Pp. 1302-1313.‏</p>\n<p>Rashid, S. S., Harun, S. N., Hanafiah, M. M., Razman, K. K., Liu, Y. Q., and Tholibon, D. A., 2023. Life cycle assessment and its application in wastewater treatment: a brief overview. Processes, 11(1), Pp. 208.<br />\n‏<br />\nZhu, L., Liu, B., Wang, F., and Bi, J., 2013. Raising discharge standards leads to environmental problem shifting in China. Water science and technology, 68(12), Pp. 2605-2612.‏</p>\n<p>‏</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>480-486</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>4</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8909\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/4wcm2024/4wcm2024-480-486.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"Natasha","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"37358bacf7cf2d12418349a7eb81d5c5adb17ac1f74b96b7f9550eb65e5edd97","category":"Environment"}