{"title":"Isotope Hydrograph Separation Reveals Rainfall on the Glaciers Will Enhance Ice Meltwater Discharge to the Himalayan Rivers","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR034528?af=R","date":1717214848000,"content":"<h2>Abstract</h2>\n<p>The Indian Summer Monsoon (ISM) and meltwater from the Himalayan are the two most important sources of water in the Indian subcontinent. However, the impact of ISM on Himalayan glaciers and subsequent stream hydrology remains largely unknown. To provide new insight into the impact of rainfall on glacial hydrology, here we present hydro-meteorological and time-series observations of meltwater stable water isotope compositions from the snout of the Chorabari glacier in the Upper Ganga Basin, Central Himalayas across the ablation season corresponding to 2019. We observe that rainfall events (&gt;2 mm d<sup>−1</sup>) on the glacier enhance discharge driven by ice meltwater in River Mandakini. Energy balance calculations reveal that one of the drivers behind enhanced ice meltwater contribution could be rain-induced melting of the glacier where rainfall on the ice surface melts the glacier producing up to 13% of the total discharge at the glacier snout. Further, rainfall on glacier surface have other control on glacial processes—for example, snow metamorphism, ice flow dynamics such as short-term acceleration in ice speed flow, and reorganization of the englacial and subglacial drainage network—that are poorly studied and needs further investigation. We conclude rainfall events on the glacier have a complex control on mountain hydrology. This study, therefore, provides an interpretative framework that calls for additional assessments of the direct and indirect impact of rainfall in glacial hydrology.</p>","author":"Nita Roy, \nIndra S. Sen, \nSoumita Boral, \nTanuj Shukla, \nVinoj Velu","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"3745357c9f51f94279325346de3dbb9fb5d3e0fdf93a0bd733f2e39e4b892b8d","category":"Environment"}