{"title":"Apple Discontinues the Last macOS Install DVDs","link":"https://www.macrumors.com/2023/11/15/apple-discontinues-the-last-macos-install-cds/","date":1700058269000,"content":"Apple has officially ceased the sale of its last optical disc installers for older operating systems including OS X Lion 10.7 and Mountain Lion 10.8. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/os-x-mountain-lion-disc-page.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe change was spotted by <a href=\"https://twitter.com/ClassicII_MrMac/status/1724458867696795856\">@ClassicII_MrMac</a> on X, formerly Twitter. The era of Apple's optical discs began to wane with the introduction of OS X Lion in July 2011, which was the first version of macOS to be available exclusively through the <a href=\"https://www.macrumors.com/guide/mac-app-store/\">Mac App Store</a>. OS X Lion introduced several features like Mission Control, Launchpad, full-screen apps, and significant improvements to Mail and other core apps.\r<br />\n\r<br />\nDue to customer demand, Apple briefly reverted to offering physical installation media for Lion and Mountain Lion, primarily to accommodate users with limited internet access or older machines without access to the ‌Mac App Store‌. Mountain Lion, released in July 2012, followed suit with a focus on digital distribution, introducing features like the Notification Center, <a href=\"https://www.macrumors.com/guide/airplay/\">AirPlay</a> mirroring, and the Messages app. The first version of macOS to completely forego a physical release was OS X Mavericks (version 10.9), released in October 2013, and the digital update process remains similar to this day.\r<br />\n\r<br />\nWhile the physical install discs are now no more, Apple continues to offer <a href=\"https://support.apple.com/kb/DL2077?locale=en_GB\">OS X Lion</a> and <a href=\"https://support.apple.com/kb/DL2076?locale=en_GB\">OS X Mountain Lion</a> as free digital downloads for those who still need them.<br />This article, \"<a href=\"https://www.macrumors.com/2023/11/15/apple-discontinues-the-last-macos-install-cds/\">Apple Discontinues the Last macOS Install DVDs</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-discontinues-the-last-macos-install-dvds.2411034/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3745b06f919cf96656b69f94b4930769b0711169f02a5ca67bdbe5b9ad801b69","category":"Apple"}