{"title":"Alex Dowsett is finally giving the Hour Record another crack","link":"https://www.cyclist.co.uk/news/10185/alex-dowsett-hour-record","date":1634032125000,"content":"<span>\n      <span><a href=\"/authors/joe-robinson\">Joe Robinson</a></span>\n  </span><div>  \n  <div>      <div><span>12 Oct 2021</span></div>    </div></div><p>\nThe 33-year-old will tackle Victor Campenaerts's 55.089km record on November 3rd</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/10/alexdowsett_dressing_01.jpg?itok=0rpoGFIX\" />  </div>\n<div>\n      <p> Alex Dowsett has decided it is about time he got around to attemping a new Hour Record. The former record holder will attempt to break Victor Campenaerts's 55.089km benchmark on Wednesday 3rd November at altitude at the Aguascalientes Velodrome in Mexico.</p>\n<p>The 33-year-old Israel Start-Up Nation rider had planned to retarget the record – which he only held for 36 days in 2015 after being bettered by Bradley Wiggins – in December 2020 at the Manchester Velodrome however his <a href=\"/news/8942/alex-dowsett-forced-to-postpone-hour-record-attempt-after-covid-19-positive\">plans were curtailed when he was unfortunately struck down with Covid-19</a>.</p>\n<p>Now no longer struggling with the virus, Dowsett can finally get around to reattempting the Hour, six years on from his previous effort.</p>\n<p>'When I took the record in 2015, we rode enough to break the record but I knew I had more in the tank at the end, which was frustrating given the work put in by everyone,' said Dowsett.</p>\n<p>'Last year’s attempt was derailed when I contracted Covid-19 but the same reasons for wanting to do it are all still there. I want to see what I’m capable of and it’s an event I just really love and feel privileged to have the opportunity to take on again.'</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/buying-guides/677/gifts-for-cyclists\">Best gifts for cyclists: presents for the cyclist in your life</a></div>      <div><a href=\"/buying-guides/1938/buyers-guide-winter-riding-essentials\">Buyer's guide: Essential gear for winter cycling</a></div>      <div><a href=\"/buying-guides/4343/best-road-bike\">Best road bikes: the best bikes on the market from £729 to over £10,000</a></div>    </div></div><p>\nFor his attempt, Dowsett will be heading to the Aguascalientes Velodrome in Mexico. At 1,887m above sea level, the high altitude arena is where Belgian Campenaerts set the current record in April 2019.</p>\n<p>In November 2020, on the eve of his axed attempt, <a href=\"/in-depth/8994/cyclist-magazine-podcast-episode-16-alex-dowsett-and-how-covid-stole-his-hour-record\">Dowsett told <em>Cyclist </em>he did not 'think the gains are as big as people say' riding at altitude</a> and that the disadvantage of oxygen deficit could outweigh the benefits of low air pressure. </p>\n<p>However, due to the Manchester Velodrome being unavailable, Dowsett now seems willing to take the risk of riding at altitude in Mexico </p>\n<p>'It’s a shame we weren’t able to use Manchester as the location to take on the attempt once more, Dowsett added.</p>\n<p>'We considered UK tracks but given the magnitude of the distance I need to cover within the hour, we started to look around Europe to find the fastest and thought if the attempt was going to be held abroad then it might as well be at the fastest track in the world which is Aguascalientes.</p>\n<p>'I live at altitude for a big chunk of the year so I know what to expect, which is a good – or bad – thing! It was encouraging to see Ashton Lambie break the four-minute barrier for 4km recently under the same roof.'</p>\n<p>Dowsett's attempt will be live streamed – most likely by the UCI via its YouTube channel and probably by GCN – and will be in aid of the <a href=\"/in-depth/7476/the-worlds-only-pro-athlete-with-haemophilia-alex-dowsett-profile\">Essexman's haemophilia charity, Little Bleeders</a>.</p>\n<p>Earlier this month, <a href=\"/news/10155/dan-bigham-british-hour-record\">Dan Bigham took the British Hour Record title</a> with a distance of <span>54.723km, 1.7km further than Dowsett's ride back in 2015. </span></p>\n<p>Just days before, <a href=\"/news/10151/joss-lowden-breaks-hour-record\" target=\"_blank\">Joss Lowden set a new women's Hour Record</a> of 48.405km. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"375f9c649fd2a95274b1a7de6ce7897b3290a8f61123a85fb15384eda571acb2","category":"Cycling"}