{"title":"Top Stories: Apple Card Savings Account Launches, 15-Inch MacBook Air Rumors, and More","link":"https://www.macrumors.com/2023/04/22/top-stories-apple-card-savings-launch/","date":1682168400000,"content":"With roughly six weeks to go until WWDC, rumors are continuing to fly about what we might see at the event. <em>Bloomberg</em>'s Mark Gurman joined us on this week's episode of The MacRumors Show to give us his take on things, but there's still lots up in the air.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/top-stories-22apr2023.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThis week also saw the launch of the savings account companion to Apple Card and the promised smoke and carbon monoxide alarm sound recognition feature for HomePod, while Tim Cook was surprised by one user's vintage Mac as Apple opened its first two retail stores in India, so read on for all the details on these stories and more!\r<br />\n\r<br />\n<h2>Apple Card Savings Account Launches With Over 4% Interest Rate</h2>\r<br />\nSix months after being announced, the <a href=\"https://www.macrumors.com/2023/04/17/apple-card-savings-account-launching-today/\">Apple Card's savings account is now available in the United States</a>. With a competitive 4.15% APY, the account allows Apple Card users to earn interest on their Daily Cash cashback and money deposited from a linked bank account.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/apple-card-savings-account-16x9.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThe savings account is offered by Goldman Sachs and can be completely managed in the Wallet app on the iPhone. The account has no fees and no minimum balance requirement.\r<br />\n\r<br />\n<h2>15-Inch MacBook Air to Offer Two M2 Chip Options, No M2 Pro Configuration</h2>\r<br />\nThe long-rumored <a href=\"https://www.macrumors.com/2023/04/20/kuo-15-inch-macbook-air-two-m2-chip-options/\">15-inch MacBook Air will be equipped with the M2 chip</a>, according to the latest info shared by analyst Ming-Chi Kuo.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/06/MacBook-Air-Multiple-Sizes-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThe first Macs with the M3 chip are likely still months away. Kuo said Apple's next-generation <a href=\"https://www.macrumors.com/2023/04/20/kuo-m3-chip-second-half-of-2023/\">M3 chip will enter mass production in the second half of 2023</a>, slightly ahead of higher-end M3 Pro and M3 Max chips destined for the next 14-inch and 16-inch MacBook Pro models.\r<br />\n\r<br />\n<h2>The MacRumors Show: Mark Gurman Talks WWDC 2023, Apple Headset, and New Macs</h2>\r<br />\n<em>Bloomberg</em>'s Mark Gurman joined us on <a href=\"https://www.macrumors.com/2023/04/21/the-macrumors-show-mark-gurman-talks-wwdc-2023/\">this week's episode of The MacRumors Show</a> to talk through all of the latest rumors about the software updates and new hardware expected to be previewed at this year's WWDC, which starts on June 5.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/The-MacRumors-Show-Mark-Gurman-15_-MBA-and-watchOS-10-alt.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nNew information revealed by Gurman during the episode included word that the <a href=\"https://www.macrumors.com/2023/04/21/no-apple-silicon-mac-pro-wwdc/\">Apple silicon Mac Pro won't be debuting at WWDC</a> and that iOS 17 will include <a href=\"https://www.macrumors.com/2023/04/21/ios-17-wallet-find-my-improvements-macos-14-minor-update/\">improvements for the Wallet app and Find My</a>.\r<br />\n\r<br />\n<h2>watchOS 10 Described as Apple Watch's Biggest Software Update Since 2015</h2>\r<br />\nwatchOS 10 <a href=\"https://www.macrumors.com/2023/04/16/watchos-10-major-update-gurman/\">will be the Apple Watch's biggest software update</a> since the initial version of the operating system was released in 2015, according to Mark Gurman. Apple is expected to announce watchOS 10 at WWDC in June.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/watchOS-16x9.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nGurman expects watchOS 10 to include an updated interface, with an anonymous leaker <a href=\"https://www.macrumors.com/2023/04/18/watchos-10-new-home-screen-layout-rumor/\">claiming that the Home Screen will be redesigned</a>, though Gurman says he does not expect the core design of the platform to change.\r<br />\n\r<br />\n<h2>HomePod Can Now Alert You If Your Smoke Alarm Goes Off</h2>\r<br />\nAs promised earlier this year, Apple has now expanded the Sound Recognition feature on the second-generation HomePod and the HomePod mini to be <a href=\"https://www.macrumors.com/2023/04/18/homepod-alert-smoke-alarm/\">able to detect smoke and carbon monoxide alarm sounds</a> and send a notification to the user's iPhone.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/01/HomePod-2-and-Mini-feature-1.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nSound Recognition was first introduced on the iPhone in 2020 and can detect a wide variety of sounds, including a doorbell, a baby crying, a car horn, a door knock, and others.\r<br />\n\r<br />\n<h2>Watch Tim Cook's Reaction as Fan Brings Vintage Macintosh to Apple Store Opening</h2>\r<br />\nApple opened its first two retail stores in India this week, and CEO Tim Cook was in attendance to celebrate. At the new store in Mumbai, <a href=\"https://www.macrumors.com/2023/04/19/tim-cook-surprise-mac-india-store/\">Cook was very surprised when a customer showed up carrying a vintage Macintosh SE</a> from the 1980s.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/cook-mac-surprise-india-visit.jpg\" alt width=\"1200\" height=\"675\" />\r<br />\nCook has been touring India this week, meeting with the country's Prime Minister Narendra Modi and many other prominent local figures during his trip.\r<br />\n\r<br />\n<h3>MacRumors Newsletter</h3>\r<br />\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r<br />\n\r<br />\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/apr-20-2023\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/22/top-stories-apple-card-savings-launch/\">Top Stories: Apple Card Savings Account Launches, 15-Inch MacBook Air Rumors, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-apple-card-savings-account-launches-15-inch-macbook-air-rumors-and-more.2387489/\">Discuss this article</a> in our forums<br /><br />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"376515e2480a760f11b621c5a8ad51532ffd534f20624229e2b73f181d98d6cc","category":"Apple"}