{"title":"Samsung's New Galaxy Tab S9 Ultra vs. iPad Pro","link":"https://www.macrumors.com/2023/08/11/samsung-galaxy-tab-s9-ultra/","date":1691786569000,"content":"Samsung <a href=\"https://www.macrumors.com/2023/07/26/samsung-new-galaxy-z-foldable-smartphones/\">in July introduced</a> its latest tablet offering, the 14.6-inch Galaxy Tab S9 Ultra. This is Samsung's best and biggest tablet to date, so we thought we'd see how it compares to the 12.9-inch <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nAt 14.6 inches, The Tab S9 Ultra is notably bigger than the ‌iPad Pro‌, and it has an impressive OLED display with deep blacks and rich colors. Apple is using mini-LED for the latest ‌iPad Pro‌ and there are rumors that it will transition to OLED, but Apple hasn't made it there yet.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/galaxy-tab-s9-2.jpg\" alt width=\"3840\" height=\"2160\" />\r<br />\nThere's an under-display fingerprint sensor that is supplemented by facial recognition (Samsung's facial recognition still can't compare to <a href=\"https://www.macrumors.com/guide/mask-face-id/\">Face ID</a>), and a horizontal front camera so you can use the front-facing camera in landscape orientation, unlike with the ‌iPad Pro‌. There's no <a href=\"https://www.macrumors.com/guide/apple-pencil/\">Apple Pencil</a>, but Samsung's tablets use the S-Pen, which is feature rich and comparable to ‌Apple Pencil‌ (plus it's included in the price). Latency is about the same, and there's a convenient charging spot for it at the back of the tablet.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/galaxy-tab-s9-6.jpg\" alt width=\"3840\" height=\"2160\" />\r<br />\nThe battery lasts for about eight hours and for storage, it supports a microSD card, which is not true of any Apple products. It's IP68 water and dust resistant, which is a higher ingress rating than the iPads.\r<br />\n\r<br />\nThere are some notable annoyances, such as the $350 keyboard cover that's heavy, can't be used on a lap, and has a jittery, hard-to-use trackpad. The speakers are not as good as the speakers in the ‌iPad Pro‌, and overall, Android on a tablet doesn't have the smoothness or usability of iPadOS on an <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>.\r<br />\n\r<br />\nWhat do you think of the Galaxy Tab S9 Ultra? Let us know in the comments below.<div>Tag: <a href=\"https://www.macrumors.com/guide/samsung/\">Samsung</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/11/samsung-galaxy-tab-s9-ultra/\">Samsung's New Galaxy Tab S9 Ultra vs. iPad Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/samsungs-new-galaxy-tab-s9-ultra-vs-ipad-pro.2398402/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"376744b722125997d2d456b957a091186053020646830b04e90dbb69324005ad","category":"Apple"}