{"title":"Hydroxycinnamaldehyde-derived benzofuran components in lignins","link":"https://academic.oup.com/plphys/article/194/3/1370/7286298?rss=1","date":1695945600000,"content":"<span><div>Abstract</div>Lignin is an abundant polymer in plant secondary cell walls. Prototypical lignins derive from the polymerization of monolignols (hydroxycinnamyl alcohols), mainly coniferyl and sinapyl alcohol, via combinatorial radical coupling reactions and primarily via the endwise coupling of a monomer with the phenolic end of the growing polymer. Hydroxycinnamaldehyde units have long been recognized as minor components of lignins. In plants deficient in cinnamyl alcohol dehydrogenase, the last enzyme in the monolignol biosynthesis pathway that reduces hydroxycinnamaldehydes to monolignols, chain-incorporated aldehyde unit levels are elevated. The nature and relative levels of aldehyde components in lignins can be determined from their distinct and dispersed correlations in 2D <sup>1</sup>H–<sup>13</sup>C-correlated nuclear magnetic resonance (NMR) spectra. We recently became aware of aldehyde NMR peaks, well resolved from others, that had been overlooked. NMR of isolated low-molecular-weight oligomers from biomimetic radical coupling reactions involving coniferaldehyde revealed that the correlation peaks belonged to hydroxycinnamaldehyde-derived benzofuran moieties. Coniferaldehyde 8-5-coupling initially produces the expected phenylcoumaran structures, but the derived phenolic radicals undergo preferential disproportionation rather than radical coupling to extend the growing polymer. As a result, the hydroxycinnamaldehyde-derived phenylcoumaran units are difficult to detect in lignins, but the benzofurans are now readily observed by their distinct and dispersed correlations in the aldehyde region of NMR spectra from any lignin or monolignol dehydrogenation polymer. Hydroxycinnamaldehydes that are coupled to coniferaldehyde can be distinguished from those coupled with a generic guaiacyl end-unit. These benzofuran peaks may now be annotated and reported and their structural ramifications further studied.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"376c45d96f71addcf571b0b05cf5486402b05588a0384d2917bea4f74e05476d","category":"Environment"}