{"title":"Collective Memory and Memory-Making within the Mapungubwe and Makgabeng Heritage Landscapes: Indigenous Voices Amongst the Sotho- and Venda- Speaking Groups of Southern Africa","link":"https://www.preprints.org/manuscript/202403.0850/v1","date":1710425540000,"content":"This paper explores indigenous perspectives on the understanding and management of cultural heritage within the Mapungubwe and Makgabeng Cultural landscapes in South Africa. State-based management system paid little attention to indigeneity resulting in contested interpretation of the archaeological past. This by-passing of indigenous input is a product of colonial and apartheid policies that glorified Western practices at the expense of black African heritage stakeholders. World heritage mechanisms are also skewed in favor of modern practice which is overly designed to be sensitive to tangible aspects of the past than the intangible elements that make up much of indigenous African heritage. We used the archaeology of Mapungubwe and Makgabeng Cultural landscapes as a test case for the impact of indigenous voices on heritage, but the results have wider applicability. We employed semi-structured interviews and focus group discussions to gather qualitative data that we calibrated with our lived experiences as products of Tsonga-speakers from this broader landscape. The results expose that indigenous people use physical manifestation of sites, ethnographic inquiry, names, oral history, spirit mediums, landscape memory, genealogy, and praise poetry to identify, interpret, evaluate, and manage their cultural heritage. Additionally, indigenous perspectives which rely on collective memory, ritual practices, and indigenous knowledge systems have huge potential for enriching our understanding of the archaeological heritage. We propose a more inclusive archaeology and heritage management practice that involve indigenous groups in the identification, interpretation, grading, and presentation of the African past.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3771535030b39831dcb915c30de4f9181210b0e14b379cebc252b724e85245a2","category":"Interdisciplinary"}