{"title":"Development and Characterization of Paclitaxel-Loaded Li-pid-Coated Mesoporous Silica Nanoparticles for pH-Responsive Tumor-Targeted Drug Delivery","link":"https://www.preprints.org/manuscript/202409.1314/v1","date":1726566020000,"content":"Nanoparticle carriers can selectively deliver the drug cargo to tumor cells, thus having the ability to pre-vent early drug release, reduce non-specific cell binding, and prolong in vivo drug retention. We con-structed paclitaxel (PTX)-loaded lipid-shell mesoporous silica nanoparticles (LMSNs) for targeted an-ti-cancer drug delivery. The physical properties of PTX-LMSNs were analyzed by scanning electron mi-croscopy (SEM) and transmission electron microscopy (TEM). The drug loading (DL%) and entrapment efficiency (EE%) of PTX-LMSNs were measured by high performance liquid chromatography (HPLC). In vitro drug release test, in vivo imaging, tissue distribution and pharmacokinetics of PTX-LMSNs were also evaluated. The SEM examination showed that MSNs were sphere, whereas TEM showed that they were rich in fine pores. The uniform core-shell structure of PTX-LMSNs was also verified by TEM. The DL capacity of PTX-LMSN was as high as 21.75%, and PTX was released from the nanoparticles in vitro in a pH-dependent manner. The cumulative amount of free PTX increased at lower pH, which is conducive to selective drug release from LMSNs in the acidic tumor tissues. In vivo imaging showed prolonged reten-tion of PTX-LMSNs, which is beneficial to their therapeutic efficacy. In addition, PTX-LMSNs were primarily concentrated in the liver. Pharmacokinetic experiments showed that the half-life of PTX-LMSNs was 23.21% longer and 79.24% higher than that of Taxol. Together, LMSNs are a highly promising antineoplastic drug carrier system.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3778d79595b649d43f1f616d24395cab7d592174e14d3f8d3dc3f0fc119b68b6","category":"Interdisciplinary"}