{"title":"Exoskeletal Trade-off between Claws and Carapace in Deep-sea Hydrothermal Vent Decapod Crustaceans","link":"https://academic.oup.com/icb/article/64/1/80/7643837?rss=1","date":1712707200000,"content":"<span><div>Synopsis</div>Limitations on energetic resources create evolutionary trade-offs, prompting us to investigate if investment in claw strength remains consistent across crustaceans living in diverse habitats. Decapod crustaceans living in deep-sea hydrothermal vents are ideal for this study due to their extreme environment. In this study, we investigated whether decapods (blind crab <span>Austinograea</span> sp. and the squat lobster <span>Munidopsis lauensis</span>) living in deep-sea hydrothermal vents prioritize investing in strong claws compared to the carapace, like coastal decapods. We analyzed exoskeleton morphology, mechanical properties, structures, and elemental composition in both the carapace and claws of four Decapoda species (two each from Brachyura and Anomura infraorders) in vent and coastal habitats. Coastal decapods had ∼4–9 times more teeth on their claw cutting edge than the vent species. Further, only the coastal species exhibited higher firmness in their claws than in their carapaces. Each infraorder controlled exoskeletal hardness differently: Brachyura changed the stacking height of the Bouligand structure, while Anomura regulated magnesium content in the exoskeleton. The vent decapods may prioritize strengthening their carapace over developing robust claws, allocating resources to adapt to the harsh conditions of deep-sea hydrothermal vents. This choice might enhance their survival in the extreme environment, where carapace strength is crucial for protecting internal organs from environmental factors, rather than relying on the powerful claws seen in coastal decapods for a competitive advantage.</span>","author":"","siteTitle":"Integrative and Comparative Biology Current Issue","siteHash":"715dd1b0fb4f45600bceadb227e9b7fdf8bd9d1d7a2fd3d5e0399d2c1f410646","entryHash":"3782ec8aeb255635aeb7674255d52fd5a06e2d83692dfeca8e2a8834c6f713d0","category":"Environment"}