{"title":"Evolutionary lability of food caching behaviour in mammals","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2656.14093?af=R","date":1719984809000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/29bbf9bc-3385-4445-98cb-17af4b002577/jane14093-toc-0001-m.png\" alt=\"Evolutionary lability of food caching behaviour in mammals\" />\n<p>Food hoarding provides animals access to resources during periods of scarcity. We explored the evolution of food hoarding behaviour by integrating hoarding behaviour data for nearly 40% of mammals representing two subclasses and five orders, and a nearly quarter century data set on caching behaviour on Mt. Graham red squirrels. Using phylogenetic comparative methods, we found that food caching strategies—whether one stores food in a single larder or scatters food about—are extremely flexible, with many species transitioning between larderhoarding and scatterhoarding numerous times independently. (A) Ancestral state reconstruction indicated that the first mammals (shrew-like Morganucodon from the late Triassic 237 million years ago) likely larderhoarded food, akin to modern-day shrews that have similar lifestyles in analogous forested habitats. (B) We found brain size (EQ) was larger in scatterhoarders due to larger hippocampal volumes for increased spatial memory. Climatic factors (latitude, temperature and seasonality) and population density were also important factors that recurringly influenced food hoarding, with colder temperatures, more seasonal environments and higher population densities being associated with larderhoarding. When we zoomed in on Mt. Graham red squirrels, we found that squirrels tended to invest less in their larderhoards in years when population density was low, implicating competition for food and pilferage as important mechanisms. Our results are consistent with previous smaller scale studies on food caching and indicate the evolutionary patterns of mammalian food caching are broadly generalizable. Applying our results to conservation could prove useful as changes in population density or climate may select for different food caching strategies and thus can inform management of threatened and endangered species and their habitats.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nFood hoarding provides animals access to resources during periods of scarcity. Studies on mammalian caching indicate associations with brain size, seasonality and diet but are biased to a subset of rodents. Whether the behaviour is generalizable at other taxonomic scales and/or is influenced by other ecological factors is less understood. Population density may influence food caching due to food competition or pilferage, but this remains untested in a comparative framework.\n\nUsing phylogenetic analyses, we assessed the role of morphology (body and brain size), climate, diet breadth and population density on food caching behaviour evolution at multiple taxonomic scales. We also used a long-term dataset on caching behaviour of red squirrels (<i>Tamiasciurus fremonti</i>) to test key factors (climate and population density) on hoarding intensity.\n\nConsistent with previous smaller scale studies, we found the mammalian ancestral state for food caching was larderhoarding, and scatterhoarding was derived. Caching strategy was strongly associated with brain size, population density and climate. Mammals with larger brains and hippocampal volumes were more likely to scatterhoard, and species living at higher population densities and in colder climates were more likely to larderhoard.\n\nFiner-scale analyses within families, sub-families and tribes indicated that the behaviour is evolutionary labile. Brain size in family Sciuridae and tribe Marmotini was larger in scatterhoarders, but not in other tribes. Scatterhoarding in tribe Marmotini was more likely in species with lower population densities while scatterhoarding in tribe Sciurini was associated with warmer climates. Red squirrel larderhoarding intensity was positively related to population density but not climate, implicating food competition or pilferage as an important mechanism mediating caching behaviour.\n\nOur results are consistent with previous smaller-scale studies on food caching and indicate the evolutionary patterns of mammalian food caching are broadly generalizable. Given the lability of caching behaviour as evidenced by the variability of our results at finer phylogenetic scales, comparative analyses must consider taxonomic scale.\n\nApplying our results to conservation could prove useful as changes in population density or climate may select for different food caching strategies and thus can inform management of threatened and endangered species and their habitats.\n</p>","author":"Sean M. Mahoney, \nBret Pasch","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"37886610e79c2e04d2f3e1a5308815600221d28809b5d424e6071019dedda08b","category":"Environment"}