{"title":"MicroRNA Profiling of PRELI-Modulated Exosomes and Effects on Hepatic Cancer Stem Cells","link":"https://www.preprints.org/manuscript/202410.0062/v1","date":1727937160000,"content":"Background/Objectives: The increasing incidence and mortality rates of liver cancer have heightened the demand for the development of effective anticancer drugs with minimal side effects. In this study, the roles of exosomes derived from liver cancer stem cells (LCSCs) with PRELI (Protein of Relevant Evolutionary and Lymphoid Interest) modulation, and their miRNAs were investigated to explore the therapeutic for liver cancer. The purpose of this study is to identify a more effective and less toxic anticancer agent beyond the well-known Notch, p51, and Hippo signaling pathways, and to specifically propose the potential of PRELI-induced exosomes as an anticancer therapeutic candidate. Methods: Various techniques, such as miRNA profiling, flow cytometry, western blotting, and immunocytochemistry, were used to evaluate the effects of ex-osomes under PRELI up- and downregulation. Results: PRELI upregulation altered expression levels of miRNAs, including hsa-miR-378a-3p (involved in stem-like properties), hsa-miR-25-3p (contributing to cell proliferation), and hsa-miR-423-3p (driving invasiveness). Exosomes with downregulated PRELI inhibited AKT/mTORC1 signaling, while this signaling pathway was ac-tivated in LCSCs transfected with the candidate miRNAs. Under PRELI up-regulation, exosomes showed increased surface marker expression, promoting cancer progression. Conclusions: The modulation of PRELI in LCSCs affects miRNA expression significantly, revealing candidate miRNA targets for liver cancer treatment. Exosomes with PRELI down-regulation show potential as a novel therapeutic strategy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"37895a66ce2af002ea5160f24443d3cd0a700d6fb053aeae308c2cfaa8ebdba7","category":"Interdisciplinary"}