{"title":"U.S. Secretary of State Says China Let Coronavirus Get ‘Out of Hand’","link":"https://www.nbcnews.com/politics/meet-the-press/blinken-china-s-early-failure-covid-cooperation-helped-speed-pandemic-n1263749","date":1618262201000,"content":"\n<p>U.S. Secretary of State Antony Blinken, in an interview on Meet the Press:</p>\n\n<blockquote>\n  <p>“I think China knows that in the early stages of Covid, it didn’t\ndo what it needed to do, which was to, in real time, give access\nto international experts, in real time to share information, in\nreal time to provide real transparency.</p>\n\n<p>“One result of that failure is that the virus got out of hand\nfaster and with, I think, much more egregious results than it\nmight otherwise.”</p>\n</blockquote>\n\n<p>In other China-COVID news, their vaccines are apparently — by their own admission — not highly effective, yet are being distributed around the world in huge quantities. <a href=\"https://www.washingtonpost.com/world/asia_pacific/china-vaccine-efficacy-not-high-gao/2021/04/11/dafe3ab6-9a8f-11eb-8f0a-3384cf4fb399_story.html\">The Washington Post</a>:</p>\n\n<blockquote>\n  <p>The head of the Chinese Center for Disease Control and Prevention\nconceded that the efficacy of Chinese coronavirus vaccines is “not\nhigh” and that they may require improvements, marking a rare\nadmission from a government that has staked its international\ncredibility on its doses.</p>\n\n<p>The comments on Saturday from George Gao come after the government\nhas already distributed <a href=\"https://www.washingtonpost.com/world/2021/02/16/coronavirus-peru-china-vaccine-sinopharm-sinovac/?itid=lk_inline_manual_4\">hundreds of millions of doses to other\ncountries</a>, even though the rollout has been dogged by questions\nover why Chinese pharmaceutical firms have not released detailed\n<a href=\"https://www.washingtonpost.com/world/asia_pacific/china-coronavirus-singapore-data/2021/03/23/7a0582ca-8afc-11eb-a33e-da28941cb9ac_story.html\">clinical trial data about the vaccines’ efficacy</a>.</p>\n\n<p>China has struck deals to supply many of its allies and economic\npartners in the developing world and boasted that world leaders — including in Indonesia, Pakistan and the United Arab Emirates — have taken the shots.</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/04/12/blinken-china-out-of-hand\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"378b39e69516faae4ea4896a4fa96fe0e9a7fbb5ab51942e38ac5d8fe394f1c2","category":"Tech"}