{"title":"Succeeding in Difficult Conversations: Evaluating Motivational Interviewing Teaching Techniques Through the Lens of Vaccine Hesitancy","link":"https://www.preprints.org/manuscript/202408.0666/v1","date":1723198220000,"content":"Background: Vaccine hesitancy, identified by the World Health Organization as a top ten global health threat, presents a significant barrier to public health efforts, exacerbated by the politicization of vaccines during the COVID-19 pandemic.1 Motivational interviewing (MI) has been shown to be effective in addressing difficult topics, including vaccine hesitancy, emphasizing the need for its integration into medical education.2  Objective: This study explores ways to enhance the medical student curriculum on MI, specifically targeting the management of conversations with vaccine-hesitant patients. These authors seek to evaluate the impact of different teaching approaches on the efficacy of MI training within clinical education.  Methods: A blinded study design was implemented, comparing two groups of medical students trained using distinct MI teaching methods: Learning Through Experience (LTE) and Traditional Teaching (TT). The LTE group engaged with a Vaccine Hesitant Standardized Patient (VHSP) before and after an instructional module on the use of MI to combat vaccine hesitancy. In contrast, the TT group interacted with a control Standardized Patient (SP) before the same module and then with the VHSP. Any medical student above the age of 18 was eligible for this study. All students in a vaccine elective at RVUCOM on the Colorado and Utah campuses were enrolled, as well as student volunteers. We excluded any students who opted out of the study. The effectiveness of each method was assessed through confidence and performance scores derived from participant self-evaluations and standardized patient feedback, respectively.  Results: Participants in the TT group demonstrated superior mastery of MI skills as taught in the didactic session based on statistically significant findings across more tested variables. The LTE group exhibited enhanced ability in practical applications with standardized patients based on statistically significant findings. Both groups showed  increased confidence in MI techniques, with the LTE group reporting greater confidence in vaccine knowledge and MI abilities. That said, the LTE method did not drastically outperform the TT approach in overall efficacy.  Conclusions: The study indicates that while traditional TT training effectively imparts MI skills, the LTE approach may offer benefits in applying these skills in clinical scenarios. These findings suggest the potential for integrating multiple teaching methods into the medical curriculum to better prepare students for engaging with vaccine-hesitant patients. Further research is needed to explore the long-term effects of these teaching strategies on student performance and patient outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"37902b436f93b9b7998cdff959ef01f62a2696947638cb910e615a2fa2131008","category":"Interdisciplinary"}