{"title":"This white dwarf star has two “faces”","link":"https://arstechnica.com/?p=1954615","date":1689876720000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<figure>\n    <div>\n            </div>\n    </figure>\n<p>Astronomers have discovered an unusual blue-tinted white dwarf star with two distinct \"faces\": one side is hydrogen and the other side is helium, according to a <a href=\"https://www.nature.com/articles/s41586-023-06171-9\">new paper</a> published in the journal Nature. Naturally, they nicknamed the star <a href=\"https://en.wikipedia.org/wiki/Janus\">Janus</a>, after the two-faced Roman god of duality and transition.</p>\n<p>As <a href=\"https://arstechnica.com/science/2022/04/meet-the-micronova-astronomers-discovered-new-type-of-stellar-explosion/\">previously reported</a>, a white dwarf is essentially the burnt-out core of a dead star. One of the first white dwarf stars discovered, dubbed <a href=\"https://en.wikipedia.org/wiki/40_Eridani\">40 Eridani B</a>, had a density over 25,000 times that of the Sun, packed into a much smaller volume (roughly the size of Earth)—an observational deduction that astronomers initially deemed impossible. A second white dwarf, Sirius B (orbiting the star <a href=\"https://en.wikipedia.org/wiki/Sirius\">Sirius</a>), was discovered soon after and appeared incredibly dense (about 200,000 times as dense as Earth).</p>\n<p>That extreme density arises from the unusual mechanism behind the star's internal pressure to keep it from collapsing under the force of gravity. Regular stars rely on energy released via nuclear fusion, but fusion has stopped in white dwarfs. So gravity has compacted all the star's matter inward so tightly that its electrons are smashed together, forming \"<a href=\"https://en.wikipedia.org/wiki/Degenerate_matter#Degenerate_gases\">electron-degenerate matter</a>.\" This happens because of quantum mechanics, notably the <a href=\"https://en.wikipedia.org/wiki/Pauli_exclusion_principle\">Pauli exclusion principle</a>, which holds that only two electrons can be in the same energy level. Normal gases don't violate this principle because there's sufficient space between electrons to keep all the energy levels in the atoms from filling up. But in a degenerate gas, the electrons <em>do</em> fill up all the energy levels, and this results in an outward-pressing force to halt the star's collapse.</p></div><p><a href=\"https://arstechnica.com/?p=1954615#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1954615&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3792558ec5ce978d508384c706cabf242d50745467e68cefaa2c60d9d20aec6a","category":"Tech"}