{"title":"Hydrological changes in a plain basin in central Argentina following expansion of rainfed agriculture and climate change","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2679?af=R","date":1716974637000,"content":"<h2>Abstract</h2>\n<p>The characterization of long-term streamflow in regions undergoing climatic change and agricultural expansion is relevant for achieving sustainable development goals and for assessing the vulnerability of water-dependent populations and agricultural activities. The objective of this work was to characterize the temporal patterns of water yield in the plain basin of the Carcarañá River (33,063 km<sup>2</sup>), located in central Argentina and to analyse its relationship with a fast expansion of rainfed cultivation and climate change. The streamflow data for the period 1980–2020 were analysed in conjunction with climatic data (rainfall, reference evapotranspiration), satellite data (NDVI) and cropping statistics (sown area of summer crops) data. The annual water yield averaged ~10% of the rainfall and showed a clear upward trend throughout the study period, both in absolute terms and relative to rainfall (i.e., runoff coefficient), which was not explained by rainfall or reference evapotranspiration temporal patterns. Conversely, we found that the trend in water yield was positively associated with the agricultural area (<i>p</i> &lt; 0.05), which more than doubled during the study period (from 29% to 66%). Likewise, the mean NDVI of the basin, a proxy for primary productivity and vegetation transpiration, has decreased steadily over the last 20 years (<i>p</i> &lt; 0.05). The separation between base flow and quick flow suggested that both flows increased during the analysed period (<i>p</i> &lt; 0.05), though the latter would have been more relevant in explaining the trend observed in total flow. Taken together, our results suggest that agricultural expansion, rather than climate change, is the dominant factor explaining the hydrological changes observed in the study basin. Understanding the key role of land use in shaping the hydrology of a landscape is critical to developing policies and practices for more efficient and sustainable use of environmental resources.</p>","author":"Guerra Juan Carlos, \nNosetto Marcelo Daniel","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"379765b5b0b26a66b24c5275d29a77cc2bfa49b082118007f376a6b9cdd06604","category":"Environment"}