{"title":"Adsorption and Sensing Properties of Ni Modified InSe Monolayer Towards Toxic Gases: A DFT Study","link":"https://www.preprints.org/manuscript/202409.1679/v1","date":1727084757000,"content":"The emission of toxic gases from industrial production have intensified issues related to atmospheric pollution and human health. Consequently, the effective real-time monitoring and removal of these harmful industrial gases have emerged as significant challenges. In this work, the density functional theory (DFT) method was utilized to examine the adsorption behaviors and electrical characteristics of Ni-decorated InSe (Ni-InSe) monolayer when interacting with twelve gases (CO, NO, NO2, NH3, SO2, H2S, H2O, CO2, CH4, H2, O2 and N2). A comparative assessment of adsorption strength and sensing properties was performed through analyses of electronic structure, work function and recovery time. The results show that Ni doping enhances the electrical conductivity of the InSe monolayer and improves the adsorption capabilities for six toxic gases (CO, NO, NO2, NH3, SO2, H2S). Furthermore, the adsorption of these gases on the Ni-InSe surface is characterized as chemisorption, as indicated by the analysis of adsorption energy, density of states, and charge density difference. Additionally, the adsorption of CO, NO, NO2, and SO2 results in significant alterations to the bandgap of Ni-InSe, with changes of 18.65%, 11.37%, 10.62%, and –31.77%, respectively, underscoring its exceptional sensitivity. Moreover, the Ni-InSe monolayer exhibit moderate recovery times of 3.24 s and 22.72 s at 298 K for the SO2 and H2S, respectively. Consequently, the Ni-InSe is regarded as a promising gas sensor for detecting SO2 and H2S at room temperature. This research establishes a foundation for developing Ni-InSe based gas sensor in detecting and mitigating harmful gas emissions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"379b42950dc274282ce10c351303be43868f17cb4679f2d9ced4d951140d857c","category":"Interdisciplinary"}