{"title":"Perceived self-efficacy to teach comprehensive abortion care among nursing and midwifery faculty in higher learning institutions in Rwanda: A mixed method study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300542","date":1710770400000,"content":"<p>by Aimable Nkurunziza, Michael Habtu, Madeleine Mukeshimana, Tamrat Endale, Yvonne Delphine Nsaba Uwera, Reverien Rutayisire, Justine Bagirisano, Jean Bosco Henri Hitayezu, Marie Laetitia Bazakare Ishimwe, Jean De Dieu Uwimana</p>\r\nIntroduction <p>Comprehensive abortion care is an emerging intervention being integrated into nursing and midwifery curricula. Yet, no studies have been conducted in Rwanda to determine whether faculty perceive themselves as capable of teaching comprehensive abortion care. This study aims to evaluate the perceived self-efficacy to teach comprehensive abortion care among nursing and midwifery faculty in higher learning institutions in Rwanda.</p> Materials and methods <p>The University of Rwanda College of Medicine and Health Sciences Institutional Review Board approved this study (UR-CMHS-IRB No 335/CMHSIRB/2022). In quantitative, a self-administered questionnaire was administered to 98 study participants. Data were entered into Statistical Package for the Social Sciences (SPSS) version 26 and analyzed using Chi-square test with a p-value of 0.05 set as the significance level. In the qualitative part, an interview guide was developed based on quantitative data to understand comprehensive abortion care teaching fully. Data were collected from four focus group discussions with eight participants in each group, entered in Dedoose, and analyzed thematically.</p> Results <p>Among the 98 study participants who were invited to participate in this study, only 85 filled out the questionnaires. This translates into 86.7% of the response rate. More than half 58.8% had adequate self-efficacy in teaching comprehensive abortion care. A Chi-square test has revealed that being a male, being a midwife, and having more years of working experience in nursing education were significantly associated with self-efficacy in teaching comprehensive abortion care (p value &lt;0.05). In the qualitative phase, 32 study participants participated in four focus group discussions and four themes were identified: a) variability in confidence levels to teach comprehensive abortion care; b) readiness about teaching comprehensive abortion care; c) facilitators of teaching comprehensive abortion care; and d) contextual challenges to teach comprehensive abortion care.</p> Conclusions <p>The findings revealed that faculty’s self-efficacy in teaching comprehensive abortion care was not adequate. Personal and religious beliefs and institutional barriers were also reported to hinder self-efficacy in teaching comprehensive abortion care. Therefore, intensive comprehensive abortion care training for nursing and midwifery faculty in higher learning institutions should be provided, including values clarification and attitude transformation training for attitudes and beliefs. It is also critical for higher learning institutions to develop strategies for overcoming the challenges faculty face when teaching comprehensive abortion care.</p>","author":"Aimable Nkurunziza","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"379cb6e305d3d6e1c61da8ec2f74c91a572645ae2fc26ff662dcd53f2b84f849","category":"Interdisciplinary"}