{"title":"Wahoo Adds Native Stryd Support for RIVAL Watch, Outlines Future Plans","link":"https://www.dcrainmaker.com/2021/11/native-support-outlines.html","date":1638278164000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/11/Wahoo-Stryd-Integration.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/Wahoo-Stryd-Integration_thumb.jpg\" /></a></p>\n<p>Its been one year since the <a href=\"https://www.dcrainmaker.com/2020/11/wahoo-rival-multisport-gps-watch-review.html\">Wahoo RIVAL GPS watch was launched</a>, and in that time Wahoo has added a number of features. From track mode to structured workouts, music control to race distance snapping, find my phone and <a href=\"https://www.dcrainmaker.com/2021/08/tech-tidbit-wahoo-rival-chirps-happy-birthday-to-you.html\">even singing happy birthday to you</a> on your birthday. They’ve roughly added a small pile of features every 2-3 months. Some bigger ticket items, and some smaller items. Of course, this was known at launch. At the time Wahoo themselves pretty much admitted it was more about the future than it was the present, saying “We’re launching a business, a product category, we’re not launching a product”.</p>\n<p>Today, they’re adding another smattering of features – the main one being native Stryd running power meter support within RIVAL, allowing you to pair directly to the Stryd sensor and get the full slate of details directly on the watch without 3rd party apps. This includes not just regular metrics like running power, but also the breakout metrics like “air power” (how much power is required to overcome the current wind), and form power.</p>\n<p>Beyond what’s here today, they’ve sketched out (like, napkin-style), the future of RIVAL for the next while. Admittedly the details are a bit slim, and the timelines non-existent, but as grandmothers everywhere always say: It’s the thought that counts.</p>\n<p>With that, let’s dive into it.</p>\n<h3><span>Stryd Power Meter Support:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/P1033636.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/P1033636_thumb.jpg\" /></a></p>\n<p>Now, the first minor nitpicker’s item to get out of the way is that, technically speaking, Wahoo has long supported the Stryd sensor using the regular power broadcast. I even showed it in my <a href=\"https://www.dcrainmaker.com/2020/11/wahoo-rival-multisport-gps-watch-review.html\">Wahoo RIVAL launch in-depth review a year ago</a>. However, that was at best a kinda-works solution. Whereas now, it’s a fully clean and integrated solution. Charts, data fields, sensor naming, all that shows up properly.</p>\n<p>So, to get started you’ll simply shake/whack/tap/pat/thunk/whatever your running shoe with the Stryd sensor on it. That’ll wake it up, and then go into the Wahoo app or Wahoo RIVAL watch to the sensors menu, and select to find a sensor to pair:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image001-6.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image001_thumb-6.png\" /></a></p>\n<p>You’ll see ‘Footpod’ listed. It doesn’t show ‘Stryd’ here (I’d suggest that’d be a nice touch), but will once you’re done. Once you accept the pairing, Wahoo immediately asks if you want to add power data fields. Behind the scenes, it also renames it Stryd.</p>\n<p>With that, it’s time to add some of our own data fields. At launch, there’s a boatload of running fields to choose from, with all sorts of time variations. This is, as usual, where Wahoo is at its best: Making it silly easy to customize these fields from your phone, rather than playing Tetris on your watch trying to set up complex data screens.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image0016-4.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image0016_thumb-4.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image0018-5.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image0018_thumb-5.png\" /></a></p>\n<p>I set up a few data pages, including one for basic power tracking, and one for more advanced data metrics like air power. Here are all of the run-power specific metrics it supports:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00110-4.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00110_thumb-4.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00112-4.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00112_thumb-4.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00114-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00114_thumb-2.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00118-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00118_thumb-2.png\" /></a></p>\n<p>With that all set, off on a run I went. As I ran I could easily toggle through my data pages, and the sensor didn’t exhibit any dropouts or other quirks. It lit up the data fields the second I started walking (despite having paired it four days prior). And of course, while running, showed me appropriate data. In this first one, I just went with a simple 5-second rolling average, alongside my lap average. So this would be ideal for interval training.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_4036.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_4036_thumb.jpg\" /></a></p>\n<p>Next, I’ve got a 3-second rolling average, along with my distance and time:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_4040.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_4040_thumb.jpg\" /></a></p>\n<p>And then finally I did one with Air Power and Form Power. Air Power shows the power required to overcome air resistance. On a normally windy day around these parts, this would be quite a bit higher. But somehow this run managed to be basically calm and windless. Of course, it’s windy as I write this. Albeit, it’s gusting to 50KPH and just on the border of rain and snow outside, so…I’m going to use the data from last week thank you very much.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_4038.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_4038_thumb.jpg\" /></a></p>\n<p>For the most part, at this juncture, the experience wasn’t terribly unlike other watches that support Stryd. You run harder, the wattage goes up, you run easier and/or more efficiently and the wattage goes down. This isn’t really rocket science at the end-user level. The data field options though on the RIVAL far surpass any other company in this space in terms of the configuration of running power data.</p>\n<p>However, after the run is a bit less ideal. For example, the on-watch run summary screen doesn’t show any running power metrics at all.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_4051.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_4051_thumb.jpg\" /></a></p>\n<p>The good news is that disappointment is short-lived. Within the Wahoo app, then you see all the data within the run history shown right there. This includes your power chart, power zones, power curve, and per lap power data. Basically, Wahoo just owned everyone in this camp.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_4069.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_4069_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00120-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00120_thumb-2.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00122-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00122_thumb-2.png\" /></a></p>\n<p>In fact, now’s a good time to mention you can connect your Stryd account to your Wahoo account, which means it should get your runs afterwards. This does not, unfortunately as it says below, retroactively pull in your older Wahoo data. So if you forget to link this to your account like me, until after your run, you’re out of luck. But that’s a minor thing.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/Wahoo-Stryd-Integration.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/Wahoo-Stryd-Integration_thumb.png\" /></a></p>\n<p>In fact, after you do the above, you’ll see a new ‘Running Power Zones’ option within the Wahoo app, indicating that was done correctly, and that it automatically pulls the data in from Stryd.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/11/WahooStryd-720x1558.png\" /></p>\n<p>In any event, back on the Wahoo side, all this data is properly transmitted to 3rd party platforms, and shows up in the .FIT file too. For example, here it is on TrainingPeaks with power data:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/TrainingPeaks.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/TrainingPeaks_thumb.png\" /></a></p>\n<p>And here it is in the <a href=\"https://www.dcrainmaker.com/analyzer\">DCR Analyzer</a>, showing me the recorded advanced metrics within the .FIT file itself, meaning that any app can use and take advantage of this data (just as the case with Garmin and COROS. With Suunto and Polar, they only support the base power data being written to the fields). And further, Garmin doesn’t support writing the power to the native power data field, so 3rd party apps have to know to support the custom data fields, versus ‘just working’ with the native power field as COROS/Suunto/Polar do.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/FitFileScreenshot-2021-11-30-132943.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/FitFileScreenshot-2021-11-30-132943_thumb.png\" /></a></p>\n<p>I like it when companies support standards and do it right.</p>\n<p>Now before we get into some comparisons, it’s worthwhile noting that Wahoo has some fancier color data fields planned for down the road. They’ll ideally look like the below screenshots I was sent, once implemented.</p>\n\n<a href=\"https://www.dcrainmaker.com/2021/11/native-support-outlines.html/1-1-2\"><img src=\"https://media.dcrainmaker.com/images/2021/11/1-1-1-200x132.png\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/11/native-support-outlines.html/3-1-2\"><img src=\"https://media.dcrainmaker.com/images/2021/11/3-1-1-200x132.png\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/11/native-support-outlines.html/4-1-2\"><img src=\"https://media.dcrainmaker.com/images/2021/11/4-1-1-200x132.png\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/11/native-support-outlines.html/5-1-2\"><img src=\"https://media.dcrainmaker.com/images/2021/11/5-1-1-200x132.png\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/11/native-support-outlines.html/6-3\"><img src=\"https://media.dcrainmaker.com/images/2021/11/6-1-200x132.png\" /></a>\n\n<p>So while they aren’t here today, they look good for down the road.</p>\n<h3><span>How’s it compare?</span></h3>\n<p>So finally, how does this differ from what other companies do? Well, that gets complex really quick, but the much shorter version is that it puts them in the game. However, the game is a funny and complex thing.</p>\n<p>From a Stryd and running power standpoint, there are many nuances. For example, the list of questions includes:</p>\n<p>A) Does the sensor require a 3rd party app, or does it pair natively? Answer: Pairs Natively.<br />\nB) Does the watch properly save and store all the data fields transmitted from the sensor? Answers: Yes.<br />\nC) Can you create running power meter zones (e.g. like heart rate zones)? Yes<br />\nD) Are those running power zones different than cycling power zones? Yes<br />\nE) Can you create structured workouts with running power targets (e.g. set a target of 350w for 5 minutes within a structured file)? Yes, I was able to do so with TrainingPeaks.</p>\n<p>As I said, it can get messy quickly.</p>\n<p>Take Garmin for example. They actually don’t support running power natively at all. Like literally, it’s “No” to all those questions above. Instead, they’ve offloaded that to Garmin Connect IQ, for both their own running power and Stryd’s. From a consumer standpoint, that kinda works, but also is kinda messy. You don’t get clean and native integration of running power data like you could or would with cycling power. It’s literally this second-class citizen in every possible way. So on paper, it’s “No” for everything above for Garmin, but in the real world, it’s mostly ‘Yes’, if you use the Stryd data field/apps.</p>\n<p>Whereas if you look at COROS, it’s very much a first-class citizen. Sure, there are some quirks, but both COROS’s own running power metrics and Stryd’s integration with it are very strong. Polar and Suunto sorta sit in a different camp in that with Polar you can create power zone targeted workouts (Suunto doesn’t support any structured workouts), and both write the data to the power data field. But neither writes or shows any of the advanced data from the Stryd sensor (like Air Power), instead, you have to sync your pod to the Stryd app, which combines that data with the watch data and gives you the full picture.</p>\n<p>So yes, you eventually arrive at your destination, but it’s just not nice and tidy like it is with the RIVAL. None of the other watches show this level of detail directly in the smartphone app, as Wahoo does.</p>\n<p>However, one gap that Wahoo has is that it lacks the structured workout sync from Stryd to Wahoo, and given that Stryd now has a paid subscription service wrapped around that, that is sorta a wrinkle in this pickle. Or maybe it’s just a pickle. Or a wrinkle. Look, I don’t know – it’s just missing.</p>\n<h3><span>Other New Planned Features:</span></h3>\n<p>Next, we’ve got a few new features that have been added. To be honest, I’m not entirely sure if this statistics tab is 100% new, since it’s been in my Wahoo RIVAL beta app for so long I forgot it’s new. But, I’ll trust them that like NBC says, if you haven’t seen it, it’s new to you. Here’s a prettier-looking set of screenshots from Wahoo than my data. It shows you summary (vs goal) data over the past week, including steps, workout time, running time, cycling, swimming, strength, calories, odometer, and time in zone breakouts.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image002.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image002_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image004.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image004_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image006.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image006_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00124-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00124_thumb-1.png\" /></a></p>\n<p>Now in addition to the next bits, remember Wahoo is also adding the colorized data fields for Stryd, as I showed/mentioned earlier. That’s coming “this fall”, which, by my calculations is less than three weeks away from ending. Wahoo confirmed last night that my advanced calendaring calculation is accurate. So, sounds like another update is due in pretty quickly.</p>\n<p>Ok, so let’s stop talking about running power and talk about all the other things that Wahoo is adding or planning to add. This list was kinda just tossed at the end of the press release, literally, the last two paragraphs stating:</p>\n<blockquote><p>“With additional planned software updates, RIVAL users will be able to see average resting heart rate, heart rate variability, and other health tracking data in the Statistics Tab.</p>\n<p>Wahoo is looking forward to continuing to add more features into RIVAL as it enters its second year, with the goal of making it the most feature-rich sport watch available at its price point. Other updates planned include Android music control, drill/kick mode for pool swimming, breadcrumb navigation, sleep tracking, and updated user interfaces.”</p></blockquote>\n<p>So, keeping in mind that there are dates for approximately 0% of these features, here’s what’s being added, distilled down version:</p>\n<p>– Adding resting heart rate<br />\n– Adding heart rate variability data<br />\n– Adding some other unknown health tracking data<br />\n– Adding Android Music Control (they already have iOS music control)<br />\n– Adding swimming drill/kick mode in the pool<br />\n– Adding breadcrumb navigation (aka routing/course support, which they lack today)<br />\n– Refreshing the user interface</p>\n<p>It’s good to see Wahoo continuing to add updates here, and I’m hoping this will be the start of a higher update cadence going into 2022.</p>\n<p>If we look at the running power features, they follow a somewhat predictable trend for Wahoo: They’re rarely first with new features (no matter the segment), but, when they do add them, they tend to do so far better than anyone else. These features usually have what is clearly an abundant amount of thought and precision in them, and end up being fantastically simple to use, while also being comprehensive. And that’s certainly true here too.</p>\n<p>The challenge for Wahoo is how to balance perfectionism with practicality and progress. In roughly the timeframe Wahoo has spent adding an impressively perfect running power implementation, COROS did a perfectly fine running power implementation while also adding in like 20-40 other features to new and old watches, and released a new watch. And Garmin’s done the same quantity of new features on existing watches too. I don’t have an answer for Wahoo there, but I think it’s something they have to consider balancing. Perfection is sometimes the enemy of progress.</p>\n<p>With that, thanks for reading!</p>\n<div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase. These posts generally take a lot of time to put together, so if you're shopping for the Wahoo RIVAL GPS Watch or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n\r\n\r\n<div><a href=\"https://www.amazon.com/Wahoo-Fitness-Running-Multisport-Smartwatch/dp/B08W3RYLPW?keywords=Wahoo+Rival&amp;qid=1637887402&amp;sr=8-1-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyMDNGWVJUNTY1UVQ2JmVuY3J5cHRlZElkPUEwNzU3NDY2M01KTlpEWjFaRlBOQiZlbmNyeXB0ZWRBZElkPUEwMDQ4NTYxM0VINU9DMkZJUUlMQyZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3051fe441b0d364457b73a2fe895cef7&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2020/11/Wahoo-RivalProductImageV2-720x539.jpg\" /></a><div><h4><a href=\"https://www.dcrainmaker.com/2020/11/wahoo-rival-multisport-gps-watch-review.html\" target=\"_blank\">Wahoo RIVAL GPS Watch</a></h4><div><a target=\"_blank\" href=\"https://www.amazon.com/Wahoo-Fitness-Running-Multisport-Smartwatch/dp/B08W3RYLPW?keywords=Wahoo+Rival&amp;qid=1637887402&amp;sr=8-1-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyMDNGWVJUNTY1UVQ2JmVuY3J5cHRlZElkPUEwNzU3NDY2M01KTlpEWjFaRlBOQiZlbmNyeXB0ZWRBZElkPUEwMDQ4NTYxM0VINU9DMkZJUUlMQyZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3051fe441b0d364457b73a2fe895cef7&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$380</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2Fwahoo-fitness-elemnt-rival-gps-watch\"><span>Backcountry</span> <span>$330</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2Fwahoo-fitness-elemnt-rival-gps-watch\"><span>Competitive Cyclist</span> <span>$330</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F191284%2Fwahoo-fitness-elemnt-rival\"><span>REI</span> <span>$330</span></a> <a target=\"_blank\" href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fwahoo-elemnt-rival-multi-sport-gps-watch\"><span>Wiggle</span> <span>378 €</span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p></div>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"37a0a455f5e268316ca5b1395b6057b3b7d0f2d7be874d7a293bcd46661c29c0","category":"Cycling"}