{"title":"Early administration of norepinephrine in sepsis: Multicenter randomized clinical trial (EA-NE-S-TUN) study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307407","date":1721311200000,"content":"<p>by Ahlem Trifi, Sami Abdellatif, Asma Mehdi, Linda Messaoud, Eya Seghir, Nacef Mrad, Jalila Ben Khelil, Khaoula Ben Ismail, Takwa Merhaben, Hana Fradj, Amel Mokline, Amen Allah Messaadi, Hyem Khiari, Yasmin Garbaa, Nabiha Borsali Falfoul, Emna Ennouri, Radhouane Toumi, Mohamed Boussarsar, Oussama Jaoued, Souhail Atrous, Hassen Ben Ghezala, Nozha Brahmi, Insaf Trabelsi, Hatem Ghadhoune, Sabrine Bradaii, Mabrouk Bahloul, Rania Ammar, Fatma Medhioub Kaaniche</p>\r\n\r\nOne of the most important components of sepsis management is hemodynamic restoration. If the target mean arterial pressure (MAP) is not obtained, the first recommendation is for volume expansion, and the second is for norepinephrine (NE). We describe the methodology of a randomized multicenter trial aiming to assess the hypothesis that low-dose NE given early in adult patients with sepsis will provide better control of shock within 6 hours from therapy starting compared to standard care. This trial includes ICU septic patients in whom MAP decrease below 65 mmHg to be randomized into 2 groups: early NE-group versus standard care-group. The patient’s attending clinician will determine how much volume expansion is necessary to meet the target of a MAP &gt; 65 mm Hg. If this target not achieved, after at least 30 ml/kg and guided by the available indices of fluid responsiveness, NE will be used in a usual way. The latter must follow a consensual schedule elaborated by the investigating centers. Parameters to be taken at inclusion and at H6 are: lactates, cardiac ultrasound parameters (stroke volume (SV), cardiac output (CO), E/E’ ratio), and P/F ratio. MAP and diuresis are recorded hourly. Our primary outcome is the shock control defined as a composite criterion (MAP &gt; 65 mm Hg for 2 consecutive measurements and urinary output &gt; 0.5 ml/kg/h for 2 consecutive hours) within 6 hours. Secondary outcomes: Decrease in serum lactate&gt; 10% from baseline within 6 hours, the received fluid volume within 6 hours, variation of CO and E/E’, and 28 days-Mortality. The study is ongoing and aims to include at least 100 patients per arm. This study is likely to contribute to support the indication of early initiation of NE with the aim to restrict fluid intake in septic patients. (ClinicalTrials.gov ID: NCT05836272).","author":"Ahlem Trifi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"37a34ca558d19f43cc2f1d78320590ba0912096d08619c8c9d56f5448279ee9d","category":"Interdisciplinary"}