{"title":"Are violence, harmful alcohol/substance use and poor mental health associated with increased genital inflammation?: A longitudinal cohort study with HIV-negative female sex workers in Nairobi, Kenya","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003592","date":1724767200000,"content":"<p>by Tara S. Beattie, James Pollock, Rhoda Kabuti, Tanya Abramsky, Mary Kung’u, Hellen Babu, The Maisha Fiti Study Champions , Sanja Huibner, Suji Udayakumar, Chrispo Nyamweya, Monica Okumu, Anne Mahero, Alicja Beksinska, Mamtuti Panneh, Pauline Ngurukiri, Erastus Irungu, Wendy Adhiambo, Peter Muthoga, Janet Seeley, Helen Weiss, Rupert Kaul, Joshua Kimani</p>\r\n\r\nViolence, alcohol use, substance use and poor mental health have been linked with increased HIV acquisition risk, and genital inflammation enhances HIV susceptibility. We examined whether past 6 month experience of these exposures was associated with increased genital inflammation, thereby providing a biological link between these exposures and HIV acquisition risk. The Maisha Fiti study was a longitudinal mixed-methods study of female sex workers in Nairobi, Kenya. Behavioural-biological surveys were conducted at baseline (June-December 2019) and endline (June 2020-March 2021). Analyses were restricted to HIV-negative women (n = 746). Women with raised levels of at least 5 of 9 genital inflammatory cytokines were defined as having genital inflammation. Multivariable logistic regression models were used to estimate (i) baseline associations between genital inflammation and violence, harmful alcohol/substance use, and poor mental health, and (ii) longitudinal associations between these exposures at different survey rounds, and genital inflammation at follow-up. Inflammation data was available for 711 of 746 (95.3%) women at baseline; 351 (50.1%) had genital inflammation, as did 247 (46.7%) at follow-up. At baseline, 67.8% of women had experienced physical and/or sexual violence in the past 6 months, 33.9% had harmful alcohol use, 26.4% had harmful substance use, 25.5% had moderate/severe depression/anxiety, and 13.9% had post-traumatic stress disorder. In adjusted analyses, there was no evidence that these exposures were associated cross-sectionally or longitudinally with genital inflammation. We report no associations between past 6 month experience of violence, harmful alcohol/substance use, or poor mental health, and immune parameters previously associated with HIV risk. This suggests that the well-described epidemiological associations between these exposures and HIV acquisition do not appear to be mediated by genital immune changes, or that any such changes are relatively short-lived. High prevalences of these exposures suggest an urgent need for sex-worker specific violence, alcohol/substance use and mental health interventions.","author":"Tara S. Beattie","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"37a944a45a40b175758f9583afd444237674ee33f3aa0c23dbeb26498d8dc878","category":"Environment"}