{"title":"Conflicting Changes of Vegetation Greenness Interannual Variability on Half of the Global Vegetated Surface","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004119?af=R","date":1714114800000,"content":"<h2>Abstract</h2>\n<p>Changes in the interannual variability (IAV) of vegetation greenness and carbon sequestration are key indicators of the stability and climate sensitivities of terrestrial ecosystems. Recent studies have examined the changes in the vegetation IAV using atmospheric CO<sub>2</sub> observations and dynamic global vegetation models (DGVMs), however, reported different and even contradictory IAV trends. Here, we investigate the changes in the IAV of vegetation greenness, quantified as coefficient of variability (CV), over the past few decades based on multiple satellite remote sensing products and DGVMs. Our results suggested that, on half of the global vegetated surface (mostly in the tropics), the CV trends detected by different satellite remote sensing products are conflicting. We found that 22.20% and 28.20% of the global vegetated surface (mostly in the non-tropical land surface) show significant positive and negative CV trends (<i>p</i> ≤ 0.1), respectively. Regions with higher air temperature and greater aridity tend to have increasing CV trends, whereas greater vegetation greening trend and higher nitrogen deposition lead to smaller CV trends. DGVMs generally cannot capture the CV trends obtained from satellite remote sensing products, while the inconsistency among satellite remote sensing products is likely caused by their process algorithms rather than the sensors utilized. Our study closely examines the changes in the IAV of global vegetation greenness, and highlights substantial uncertainty when using satellite remote sensing to study the response of terrestrial ecosystems to climate change.</p>","author":"Jiaqi Tian, \nXiangzhong Luo","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"37b4260f707c35a2a888a95e7349fcbb8a86203790c6cc73b72e3ac297a44a9e","category":"Environment"}