{"title":"Konami ปลด Antoine Griezmann จากพรีเซนเตอร์ Yu-Gi-Oh! เพราะคลิปเหยียดคนญี่ปุ่น","link":"https://www.blognone.com/node/123616","date":1625720515000,"content":"<div><div><div><p>Konami ประกาศปลด Antoine Griezmann นักฟุตบอลทีมชาติฝรั่งเศส จากการเป็นพรีเซนเตอร์เกมและอนิเม Yu-Gi-Oh! เนื่องจากคลิปวิดีโอเหยียดเชื้อชาติคนญี่ปุ่น</p>\n<p>ในรอบสัปดาห์ที่ผ่านมา มีคลิปวิดีโอเก่าปี 2019 ที่สโมสรฟุตบอล Barcelona ไปทัวร์ญี่ปุ่น โดย Ousmane Dembele เพื่อนร่วมทีมของ Griezmann เรียกพนักงานโรงแรมชาวญี่ปุ่นมาช่วยตั้งค่าทีวีในห้องให้ เพราะพวกเขาต้องการเล่นเกม PES (ซึ่งก็เป็นเกมของ Konami) ในคลิปมีเสียงพูดของ Dembele เป็นภาษาฝรั่งเศส ล้อเลียนพนักงานว่า \"หน้าตาน่าเกลียด\" และถามว่า \"ประเทศญี่ปุ่นมีเทคโนโลยีก้าวหน้าจริงหรือ\" ในขณะที่ Griezmann ร่วมหัวเราะไปกับ Dembele ด้วย</p>\n<p>คลิปนี้กลายเป็นประเด็นใหญ่ในญี่ปุ่น โดยซีอีโอของ Rakuten บริษัทญี่ปุ่นที่เป็นสปอนเซอร์ของสโมสร Barcelona ต้องออกมาเรียกร้องให้สโมสรขอโทษอย่างเป็นทางการ</p>\n<p>ถึงแม้ว่า Griezmann ไม่ได้พูดอะไรในคลิปโดยตรง และเสียงวิจารณ์ส่วนใหญ่พุ่งไปที่ Dembele แต่การที่ Konami มีความสัมพันธ์ทางธุรกิจกับ Griezmann ผ่านแบรนด์ Yu-Gi-Oh! ทำให้บริษัทประกาศยกเลิกสัญญากับตัว Griezmann แล้ว และขอให้สโมสร Barcelona ที่อยู่ในเกมฟุตบอล PES ออกมาอธิบายด้วยเช่นกัน</p>\n<p>ที่มา - <a href=\"https://www.konami.com/games/corporate/en/news/release/20210707/\">Konami</a>, <a href=\"https://kotaku.com/konami-fires-soccer-star-after-racism-controversy-1847248826/\">Kotaku</a></p>\n<p>ภาพ Antoine Griezmann ตอนโปรโมท Yu-Gi-Oh!</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1a9da78822cd2e33f8da5fc33e78a591.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/konami\">Konami</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/racism\">Racism</a></div><div><a href=\"/topics/football\">Football</a></div><div><a href=\"/topics/yu-gi-oh\">Yu-Gi-Oh!</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"37b932094b847394a5b6afec12f4d05fe551f2549de1495fc5db0148c240a4da","category":"Thai"}