{"title":"Nanoleaf's New 'Elements' Line Features Wood-Like Smart Lighting Panels","link":"https://www.macrumors.com/2021/06/03/nanoleaf-elements-smart-lighting-panels/","date":1622741424000,"content":"Nanoleaf, known for its range of smart lighting panels, today announced the launch of the <a href=\"https://nanoleaf.me/en-US/\">Elements Wood Look Hexagons</a>. The Nanoleaf Elements are a new lighting product designed to offer a more natural lighting experience in the home with modular wood-styled panels that glow with shades of white light.\r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\nNanoleaf's standard lighting panels, which are available in Hexagon and Triangle shapes, are made from a white plastic material and are designed to change colors, with users able to select from millions of color options. The Elements Wood Look Hexagons have a wood grain-like texture, which may appeal to those who do not like the plastic look of the standard panels when they're not activated.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/nanoleaf-elements-main.jpg\" />\r\n<br />\r\nWhen turned off, the Nanoleaf Elements look like decorative wood panels on the wall, and when on, various shades of yellow and white light can be used to add ambient lighting to a room. The Nanoleaf Elements do not get as bright as standard Nanoleaf Hexagons and can be set to temperatures ranging from 1500K to 4000K. Nanoleaf has designed the panels to glow from the back for a double-lit effect that enhances the lighting effects.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/nanoleaf-elements-night-time.jpg\" />\r\n<br />\r\nThe neutral wood-like color is meant to better fit into home decor than the standard panels. The Nanoleaf Elements are unique because there are LEDs in in the corners of each panel that can be controlled separately, a feature that Nanoleaf says adds organic motions able to better resemble embers in a fireplace, fireflies, clouds, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/nanoleaf-elements-disabled.jpg\" />\r\n<br />\r\nWhen creating a scene in the updated Nanoleaf app, you can paint each Hexagon corner with light in different temperatures for a unique look that's not possible with other Nanoleaf panels. Nanoleaf has created 11 preset lighting scenes for the Nanoleaf Elements, and if you use scenes created for standard panels, they'll be converted into shades of white lighting using Nanoleaf-designed mapping technology.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/nanoleaf-elements-app.jpg\" />\r\n<br />\r\nIn addition to a offering a unique wood-style finish and lighting features, the Nanoleaf Elements include all of the classic Nanoleaf functions like Rhythm Music Sync, Schedule options, Touch capabilities that turn the color of the panels when you tap them, and Circadian Lightning that changes over the course of the day. Panels are controlled through the Nanoleaf app and are also HomeKit-compatible, so <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> integration is available.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/nanoleaf-elements-touch.jpg\" />\r\n<br />\r\nNanoleaf Elements Smarter Kits include seven light panels for $299.99, and there are expansion packs that include three additional panels for $99.99. Nanoleaf Elements are <a href=\"https://nanoleaf.me/en-US/\">available from the Nanoleaf store</a> as of today, and will be coming to Apple stores later this year.<div>Tag: <a href=\"https://www.macrumors.com/guide/nanoleaf/\">Nanoleaf</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/03/nanoleaf-elements-smart-lighting-panels/\">Nanoleaf's New 'Elements' Line Features Wood-Like Smart Lighting Panels</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/nanoleafs-new-elements-line-features-wood-like-smart-lighting-panels.2299085/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=dk3sYS9YqNo:vqxR07GwCZA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=dk3sYS9YqNo:vqxR07GwCZA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/dk3sYS9YqNo\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"37c0c704d92443788f06e799ef16bff65d5ded85a2170089b7bf896977061ddb","category":"Apple"}