{"title":"Video: Browsing the Web on Apple Watch With µBrowser","link":"https://www.macrumors.com/2021/12/10/micro-browser-apple-watch/","date":1639165646000,"content":"If you've ever wanted to have a web browser on your wrist, there's now an app for that. µBrowser is an app designed to let you enter a web address or execute a search with DuckDuckGo so you can view websites on Apple Watch.\r\n<br />\r\n\r\n<br />\r\n<div></div><div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r\n<br />\r\nAvailable for $0.99 <a href=\"https://apps.apple.com/us/app/%C2%B5browser/id1590622755\">from the App Store</a>, µBrowser offers a lightweight browsing experience that's useful if you have no other device on you but want to look something up quickly. In addition to visiting a specific URL or searching the web, you can also see your last visited pages or save pages to your favorites. You can use the companion app on <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> to manage your bookmarks.\r\n<br />\r\n\r\n<br />\r\nThe app is only able to offer a limited browsing experience on the wrist. The developer warns that there are limitations with Javascript and large webpages, and logins most likely will not work. There is also no back button.\r\n<br />\r\n\r\n<br />\r\nNote that the Apple Watch <em>does</em> have a built-in browsing experience, but only in apps like Messages where someone has sent you a link. You can tap on that link and browse a webpage, but you can't enter a URL or search for a page like you can in µBrowser.\r\n<br />\r\n\r\n<br />\r\nµBrowser is not the most practical app because most people probably aren't going to want to browse the web on the tiny Apple Watch display, but it's an interesting utility to have in a pinch.<br />This article, \"<a href=\"https://www.macrumors.com/2021/12/10/micro-browser-apple-watch/\">Video: Browsing the Web on Apple Watch With µBrowser</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/video-browsing-the-web-on-apple-watch-with-µbrowser.2326994/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=MCuncuxMSAM:MVB9WRBrGqE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=MCuncuxMSAM:MVB9WRBrGqE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"37c58ff4833c9c257dc1b211c281e359a4b4462ac36cc112412d7b34ec91f782","category":"Apple"}