{"title":"Electron Microscopy of a gC3N4(p)/AgCl Heterojunction","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.600/7719866?rss=1","date":1721779200000,"content":"<span>These materials are developed to remove pollutants in water by means of a photocatalytic process. The UV or visible photogeneration of electron-hole pairs in a semiconductor material (photocatalyst) is used to promote the chemical redox reactions to degrade or modify the pollutants [<a href=\"#ozae044.600-B1\">1</a>, <a href=\"#ozae044.600-B2\">2</a>]. It is of high importance to develop photocatalysts of low cost, green method of synthesis, high stability and good activity under UV light or preferably visible light which normally involves a low band gap value. Graphitic carbon nitride (g-C<sub>3</sub>N<sub>4</sub>) is an attractive material due to its band gap value (2.7 eV), band positions, and the capacity to absorb radiation with a wavelength smaller than 450 nm [<a href=\"#ozae044.600-B3\">3</a>]. Additionally, g-C<sub>3</sub>N<sub>4</sub> has a low cost and can be produced by ecofriendly methods [<a href=\"#ozae044.600-B4\">4</a>]. However g-C<sub>3</sub>N<sub>4</sub> has some disadvantages such as a slow transfer rate of the charge carriers, fast recombination rate of photo-generated electrons and holes, scant active sites, insufficient visible light absorption performance and low specific surface area [<a href=\"#ozae044.600-B5\">5</a>]. A nanosheet morphology improves the photocatalytic performance of this material but one of the most efficient techniques to improve the efficiency of g-C<sub>3</sub>N<sub>4</sub> is to form heterojunctions with other semiconductor materials then the separation and migration of the photogenerated charges is promoted [<a href=\"#ozae044.600-B6\">6</a>]. The use of g-C<sub>3</sub>N<sub>4</sub> heterojunctions is normally limited to a particular reaction (oxidation or reduction). Nevertheless in the case of contaminated water bodies, there are both organic and inorganic components. Thus this research is aimed to develop a heterojuction with g-C<sub>3</sub>N<sub>4</sub> and AgCl for the simultaneous photocatalytical removal of Cr (VI) and an organic dye like methylene blue (MB) in water with the use of visible light as the source of irradiation.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"37c784b7d9e70accbc3318cf3fa83b57188bc86f7ef344702a2cc06e5650be1b","category":"Environment"}