{"title":"Exploring the Suppressing Ability of T. procumbens (L.) on Malaysian weedy rice (Oryza sativa)","link":"https://www.preprints.org/manuscript/202410.1278/v1","date":1729076599000,"content":"Heavy infestations of weedy rice can reduce rice yields and affect farmers' incomes. So far, the control of weedy rice is still unsolved and depends more on the use of herbicides, which can harm the environment and human health. The phenomenon of allelopathy can be used to develop a new strategy to control weedy rice that does not depend on the use of herbicides. The objective of this study was to evaluate the allelopathic ability of T. procumbens against the growth of weedy rice with different morphological characteristics. Although morphologically different, seedling growth of all weedy rice was found to be inhibited by the presence of leaf leaching and root exudates of T. procumbens, as determined by sandwich and plant box methods. GC-MS analysis identified 21 allelochemicals present in the leaves of T. procumbens, mainly consisting of various fatty acids such as hexadecanoic acid. Further investigation revealed that the aqueous extract of T. procumbens at higher concentration (100%) reduced the germination rate of weed variants WR3 and WR7 by 24% and 19%, respectively. Seedling growth of the weedy variants was inhibited with increasing concentration of leaf extract, with radicle growth of both WR3 and WR7 reduced by 100% and 98%, respectively, at the highest concentration. The leaf debris incorporated into the soil similarly inhibited the growth of the seedlings and the chlorophyll content of the weedy rice. However, the cultivar MR220 CL2 showed lower sensitivity to T. procumbens, and its total chlorophyll content increased with increasing concentration of leaf debris. Our study revealed that T. procumbens is suitable as a bio-herbicide for future sustainable control of weedy rice, especially in the granaries of MR220 CL2","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"37cb7ecbb77a346e2bd62d5e0db639d4ea07cbc37ac1cfaf9f82cef82e480134","category":"Interdisciplinary"}