{"title":"NAADISASYA: An Ayurinformatic Study on Alzheimer&rsquo;s and Parkinson&rsquo;s Diseases","link":"https://www.preprints.org/manuscript/202410.1378/v1","date":1729232921000,"content":"Alzheimer's disease (AD) and Parkinson's disease (PD) are the most prevalent and irreversible neurological disorders that primarily affect the aged population. These conditions lead to disability and mortality as there is currently no medication for a complete cure. Existing drugs only provide symptomatic relief of the disease. Inhibition of Acetylcholinesterase (AChE) and Butyrylcholinesterase (BuChE) will reduce the hydroxylation of Acetylcholine, a molecule possessing a significant role in the neurotransmission pathways and is accounted as a remedial objective for the treatment of AD and PD. This study aimed to identify potent lead molecules from plants that could inhibit AChE and BuChE. We employed molecular docking, molecular dynamic simulation, and MMPBSA approaches to screen and evaluate potential compounds. The docking results were analysed based on binding affinity and hydrogen bond interactions at the active-site residues of the targets. From the analysis, four phytocompounds - Tricetin, Luteolin, Withasomniferol C, and Withanolide were identified as potential hits. These compounds demonstrated strong binding affinities of -8.49, -9.85, -25.26, and -24.1 kcal/mol, respectively. The significant binding affinity suggests that these compounds may effectively inhibit the activity of AChE and BuChE, potentially leading to therapeutic benefits for AD and PD. However, further in-vitro analysis is recommended to validate the activity of these compounds. In-vitro experiments will provide a better understanding of their efficacy, safety, and potential as drug candidates for treating AD and PD.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"37cc266e216b3c9b78853d419cde0591a6d1e08e8976b8843498de486fcf256e","category":"Interdisciplinary"}