{"title":"Prediction of potential targets and toxicological insights of Astragalus in liver cancer based on network pharmacology: Integrating systems biology, drug interaction networks, and toxicological perspectives","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24189?af=R","date":1710315301000,"content":"<h2>Abstract</h2>\n<p>This study investigates Astragalus's efficacy as a novel therapeutic option for primary liver cancer (PLC), capitalizing on its anti-inflammatory and antiviral effects. We utilized network pharmacology to unveil Astragalus's potential targets against PLC, revealing significant gene expression alterations in treated samples—20 genes were up-regulated, and 20 were down-regulated compared to controls. Our analysis extended to single-cell resolution, where we processed scRNA-seq data to discern 15 unique cell clusters within the immune, malignant, and stromal compartments through advanced algorithms like UMAP and tSNE. To delve deeper into the functional implications of these gene expression changes, we conducted comprehensive gene ontology and Kyoto Encyclopedia of Genes and Genomes pathway enrichment analyses, alongside Gene Set Variation Analysis, to elucidate the biological processes and pathways involved. Further, we constructed protein–protein interaction networks to visualize the intricate molecular interplay, highlighting the down-regulation of MT1E in PLC cells, a finding corroborated by quantitative polymerase chain reaction. Molecular docking studies affirmed the potent interaction between Astragalus's active compounds and MT proteins, underscoring a targeted therapeutic mechanism. Our investigation also encompassed a detailed cellular landscape analysis, identifying nine cell subgroups related to MT1 expression and specifying five cell subsets through the SingleR package. Advanced trajectory and cell–cell interaction analyses offered deeper insights into the dynamics of MT1-associated cellular subpopulations. This comprehensive methodology not only underpins Astragalus's promising role in PLC treatment but also advances our understanding of its molecular and cellular mechanisms, paving the way for targeted therapeutic strategies.</p>","author":"Minjun Zou, \nZhiye Zheng, \nZhikai Xiahou, \nJianwei Cao","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"37ce5e9b79037a64f410d2d7f945815ab22af88bf79795adad6a2b5f5262f4a0","category":"Environment"}