{"title":"Sustainability-by-Constraints: the COVID-19 Crisis","link":"https://www.preprints.org/manuscript/202405.0848/v1","date":1715603388000,"content":"Healthcare crises occur occasionally are very disruptive and resource consuming. The Covid-19 pandemic provided an example of inefficient wasteful resource management that would be unsustainable in the long term. This paper presents a framework for sustainable crisis management that will be applicable for future crises. The methodology is also applicable to other pandemics, wars, multi-casualty natural disasters, industrial disasters, etc. Attention focuses on rapid crisis resolution such as lockdowns. Despite unprecedented investments in healthcare, lack of capacity and timeliness are still problems affecting every country, even the wealthier ones. During the Covid19 pandemic, some healthcare systems around the world have collapsed. For example, Brazil, Spain, Italy, and more. This is due to the lack of a clear methodology for handling such crises. This paper presents a resource-based methodology to cope with healthcare crises considering three scenarios: “Peace”, “War” and “Tsunami”. The paper outlines a methodology for identifying the system bottlenecks for coping with the crisis in each scenario by using established simple tools. These tools assure significant resource frugality that will enhance sustainability. The paper also analyses where the system constraint should be and prescribes how to prepare for such scenarios. A large medical center case study demonstrates our approach. During “peace” times, evolutionary strategies should be used exclusively. During “war” times, a hybrid – evolutionary/disruptive (revolutionary) strategy. During the “Tsunami” scenario, one should rely only on the disruptive (revolutionary) strategy. This methodology can be extended to other scenarios and other lines of research.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"37cebe1a69bf1d40bc5fa50f2d397832a49362630113958c6f9d293cd56d2e00","category":"Interdisciplinary"}