{"title":"Effects of indoor plants on CO<sub>2</sub> concentration, indoor air temperature and relative humidity in office buildings","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305956","date":1721224800000,"content":"<p>by Junzhiwei Jiang, Peter Irga, Robert Coe, Philip Gibbons</p>\r\n\r\nThis experimental study investigates the influence of indoor plants on three aspects of air quality in office spaces: relative humidity, indoor air temperature, and carbon dioxide concentration. Employing a Latin square design, we rotated three different treatments across three offices over six time periods. These treatments included a control (no plants), a low-volume treatment (five plants), and a high-volume treatment (eighteen plants) of <i>Nephrolepis exaltata</i> (Boston fern). Air quality parameters were continuously monitored at five-minute intervals using Trace Gas Analyzers. Generalised linear mixed modelling (GLMM) was employed to examine the effect of each treatment on relative humidity, indoor air temperature and CO<sub>2</sub> concentration. We observed a significant positive correlation between the number of indoor plants and relative humidity levels. In offices without any plants, the median relative humidity was 29.1%. This increased to 38.9% in offices with 5 plants and further to 49.2% in offices with 18 plants. However, we did not find significant associations between the number of indoor plants and indoor air temperature or corrected CO<sub>2</sub> concentration. Our research provides support for the use of indoor plants to increase relative humidity, which can have health benefits in dry climates, but does not provide support for using indoor plants to regulate indoor air temperatures or CO<sub>2</sub> concentration in office environments.","author":"Junzhiwei Jiang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"37d65f0df36207e74f0b131ca6807c231e3806b5c63c7b463be98f47cab51f66","category":"Interdisciplinary"}