{"title":"Linkage between spatiotemporal distribution of environmental DNA and phenological activity in an amphidromous fish, ayu Plecoglossus altivelis altivelis, in a river located in its northernmost distributional area","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15687?af=R","date":1708310997000,"content":"<h2>Abstract</h2>\n<p>Environmental DNA (eDNA) is a promising tool for the continuous monitoring of fish ecology and diversity. However, its potential for describing the phenological activity of fish has rarely been examined. This study aimed to elucidate a linkage between the spatiotemporal distribution of eDNA and the phenology of an amphidromous fish, ayu <i>Plecoglossus altivelis altivelis</i>, in a river in Hokkaido, Japan, which is its northernmost distributional area. A significant positive correlation between eDNA concentration and catch per unit effort of <i>P. a. altivelis</i> in the river confirmed the use of eDNA as a surrogate for the abundance of <i>P. a. altivelis</i>. eDNA of <i>P. a. altivelis</i> was first detected in late April on a sandy beach adjacent to the river mouth. Subsequent to its first detection at the lowest site in the river in early May, eDNA spread throughout the river, indicating the upstream migration of <i>P. a. altivelis</i>. Spawning activity was also represented by a rapid increase in eDNA concentration and its surge at night in the lowest reaches of the river during September and October. These results suggest that upstream migration and spawning primarily commenced when the water temperature reached 10°C and decreased below 20°C, respectively. This observation is consistent with the behavioral responses observed in <i>P. a. altivelis</i> populations from other regions of Japan. Consequently, this study demonstrated that eDNA distribution was closely linked to the phenological activity of <i>P. a. altivelis</i> and that eDNA is a powerful tool for studying the phenology of migratory fishes.</p>","author":"Takuma Yonago, \nTatsuya Kawakami, \nAkihide Kasai","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"37da4af69c73a3e1be87157f7ca759e3fecc638b3eb42bd3cdef25d6fc2535c0","category":"Environment"}