{"title":"Water and landscape management for 3,000 years in a mid-mountain area: evolution of the Gourgon mires complex (Massif Central, France) under anthropogenic and climate forcing","link":"http://link.springer.com/10.1007/s00334-023-00959-5","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>\n                              In order to better understand the long-term management of water resource and its relationship with peatlands in mid-mountain areas, a research project was conducted in the mire complex of Gourgon, in the Forez Mountains (Eastern Massif Central, France). The peat growth response to global and local changes was reconstructed based (1) on the radiocarbon dating of basal peat layers, (2) on the study of macrofossils and (3) on palynological analyses of key peat cores. This palaeoecological approach provided new answers to understand the development of the uplands and to fill the gaps between archaeological sites. Three major steps were identified during the last 3,000 years: (i) cultivation and pastoral activities from the Iron Age to the Roman Times; (ii) afforestation and predominant grazing during Late Antiquity and the Early Middle Ages; and (iii) major forest clearing motivated by cultivation needs (winter crops including rye – <em>Secale cereale</em>) during the Middle Ages. Comparison of lithological and palaeoecological data with topographical data and regional archaeological information highlighted that the anthropogenic diversion of streams, created to supply high-altitude farms, reduced the water flow in the valley and favoured the accumulation of peat for centuries. Thus, human activities were involved in the development of mire-valley ecosystems. This response of peatland ecosystems to human activities fits with a wider pattern of anthropogenically-induced peatlands in Central France. It underlines the importance of multidisciplinary and retrospective scientific studies in understanding the mechanisms of wetland evolution in the long-term.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"37e97be1907bbee95a9491d2a2ad73cce553f7dfc5308785d539a8b1ea121491","category":"Environment"}