{"title":"Insectivorous birds and bats outperform ants in the top‐down regulation of arthropods across strata of a Japanese temperate forest","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14146?af=R","date":1721815576000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/f883e699-966d-4d0d-840a-477f58e67c2c/jane14146-toc-0001-m.png\" alt=\"Insectivorous birds and bats outperform ants in the top-down regulation of arthropods across strata of a Japanese temperate forest\" />\n<p>Our study is the first to experimentally investigate the independent and combined impacts of bats, birds and ants on arthropod densities and subsequent herbivory damage across the canopy and understorey temperate forest layers. We found no vertical gradient in top-down control importance in the forest.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nBirds, bats and ants are recognised as significant arthropod predators. However, empirical studies reveal inconsistent trends in their relative roles in top-down control across strata. Here, we describe the differences between forest strata in the separate effects of birds, bats and ants on arthropod densities and their cascading effects on plant damage.\n\nWe implemented a factorial design to exclude vertebrates and ants in both the canopy and understorey. Additionally, we separately excluded birds and bats from the understorey using diurnal and nocturnal exclosures. At the end of the experiments, we collected all arthropods and assessed herbivory damage.\n\nArthropods responded similarly to predator exclusion across forest strata, with a density increase of 81% on trees without vertebrates and 53% without both vertebrates and ants. Additionally, bird exclusion alone led to an 89% increase in arthropod density, while bat exclusion resulted in a 63% increase. Herbivory increased by 42% when vertebrates were excluded and by 35% when both vertebrates and ants were excluded. Bird exclusion alone increased herbivory damage by 28%, while the exclusion of bats showed a detectable but non-significant increase (by 22%). In contrast, ant exclusion had no significant effect on arthropod density or herbivory damage across strata.\n\nOur results reveal that the effects of birds and bats on arthropod density and herbivory damage are similar between the forest canopy and understorey in this temperate forest. In addition, ants were not found to be significant predators in our system. Furthermore, birds, bats and ants appeared to exhibit antagonistic relationships in influencing arthropod density. These findings highlight, unprecedentedly, the equal importance of birds and bats in maintaining ecological balance across different strata of a temperate forest.\n</p>","author":"Elise Sivault, \nJan Kollross, \nLeonardo Re Jorge, \nSam Finnie, \nDavid Diez‐Méndez, \nSara Fernandez Garzon, \nHeveakore Maraia, \nJan Lenc, \nMartin Libra, \nMasashi Murakami, \nTatsuro Nakaji, \nMasahiro Nakamura, \nRachakonda Sreekar, \nLegi Sam, \nTomokazu Abe, \nMatthias Weiss, \nKaterina Sam","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"37f4accc31226f780e1c443cef616668b9bd5638acdb89c8b6b02a3e5182c864","category":"Environment"}