{"title":"Halide brings the best iPhone 13 Pro feature to older iPhones for $1 a month","link":"https://www.macworld.com/article/541878/iphone-13-macro-mode-halide-camera-app.html","date":1633605300000,"content":"<div>\n<section><div></div></section><p>While the 3x telephoto camera, 120Hz ProMotion display, and incredible battery life are all great reasons to buy the <a href=\"https://www.macworld.com/article/450981/iphone-13-pro-review.html\">iPhone 13 Pro</a>, the biggest upgrade over every other iPhone is a much smaller feature: macro mode. But if you don’t want to spend hundreds of dollars to get it, the latest update to the Halide Mark II camera app will mimic it for a buck a month.</p>\n\n\n\n<p>With version 2.5, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/halide/id885697368&amp;xcust=1-1-541878-1-0-0&amp;sref=https://www.macworld.com/feed\">available in the App Store now</a>, Halide has introduced a new Macro Mode for all iPhones coupled with an upscaler on iPhones a Neural processor (iPhone 8 and later). As the developer explains it: Macro Mode is helped by our new technology called Neural Macro. Halide’s Macro Mode does a few clever things to help you get the best Macro shot: first, it checks which one of your cameras can focus the closest. Then, it gives you ultra-precise focus control to get your teeny-tiny subject perfectly sharp. Finally, once taken, Neural Macro gets to work: a powerful AI-based detail enhancement process gets even more detail out of your processed image.</p>\n\n\n\n<figure><div><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/iphone-13-macro-rotated.jpg?quality=50&amp;strip=all\" /><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/halide-macro.jpeg?quality=50&amp;strip=all\" /></div><figcaption>The iPhone 13 Pro (left) produced a better macro photo of this apple, but the Halide app with the iPhone 13 wasn’t far behind.</figcaption></figure><p>Taking a macro shot isn’t as easy as the iPhone 13 Pro’s automatic switching. You need to tap the AF button, then the flower icon. The app will automatically select the camera with the closest focus distance, which might require repositioning, and you can’t get as close as you can with the iPhone 13 Pro. You can, however, adjust the focus depth with a slider. The photos I took weren’t as detailed as the macro shots taken with the iPhone 13 Pro Max, but they were a bit more color accurate and overall quite impressive, especially when compared to photos taken without macro mode turned on.</p>\n\n\n\n<p>It’s not quite as sharp as macro mode on the iPhone 13 Pro, but it’s quite good. As you can see in the samples I took, it does an excellent job of capturing detail at distances where the iPhone would normally snap blurry, out-of-focus shots. I tried numerous times to get a shot of this AirPod Pro earbud in focus at close range, but it wasn’t able to lock in on such a small target. Other objects fared slightly better, but they still came out soft and blurry.</p>\n\n\n\n<figure><div><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/halide-no-macro-airpod-rotated.jpg?quality=50&amp;strip=all\" /><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/halide-macro-airpod.jpeg?quality=50&amp;strip=all\" /></div><figcaption>Macro mode in the Halide app might not be as crisp as it is on the iPhone 13 Pro, but it’s light years ahead of what the iPhone 13 would normally snap.</figcaption></figure><p>The Halide app is free to download, but you’ll need to subscribe if you want to continue using beyond the 7-day trial. It costs $3 a month, $12 a year, or $50 for a lifetime subscription.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"37f769cc7feef558546d427fd2e85b3d0f1b47ddbf07fe6e526b011ffcd7a2f4","category":"Apple"}