{"title":"Rohan Dennis will reportedly join Jumbo-Visma in 2022","link":"https://cyclingtips.com/2021/06/rohan-dennis-will-reportedly-join-jumbo-visma-in-2022/","date":1623956822000,"content":"<div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/dennis-650x433.jpg\" /></div>\n<p>After two seasons with the Ineos Grenadiers, Rohan Dennis will reportedly be on the move this coming offseason. According to <a href=\"https://www.wielerflits.nl/nieuws/tweevoudig-wereldkampioen-tijdrijden-rohan-dennis-naar-jumbo-visma/\" target=\"_blank\">Wielerflits</a>, the 31-year-old Australian already has a deal in place to head to Jumbo-Visma in 2022.</p>\n\n\n\n<p>Dennis, 31, joined the Ineos organization at the start of 2020 after a tumultuous single season at Bahrain-Merida. Having spent several seasons prior to that with BMC, Dennis signed a two-year deal to join the Bahrain team at the start of 2019, but he did not ride out the length of that contract. Dennis left the 2019 Tour de France on stage 12, the day before an individual time trial where he was a favorite, and never raced in Bahrain kit again after the team terminated his contract later that year.</p>\n\n\n\n<p>He did, however, power to his second career individual time trial world title at the Yorkshire Road World Championships that same season, and then he signed on to join Ineos. His 2020 campaign saw him come close to a few big wins, and in 2021, he has found himself atop the podium again, winning the stage 2 time trial at the Volta a Catalunya and the prologue of the Tour de Romandie.</p>\n\n\n\n<p>As the official transfer window does not open until August, confirmation of a potential transfer won’t be expected for some time, but according to Wielerflits, Dennis has decided to join Jumbo-Visma after receiving an extension offer from the Ineos Grenadiers as well as an offer from UAE-Team Emriates.</p>\n\n\n\n<p>Wielerflits points out that sport director Allan Pieper, who worked with Dennis at BMC, is now at Jumbo-Visma. The Dutch WorldTour team is reportedly interested in bringing on Dennis not only for his TT prowess, but also for his ability to play a key support role in the Grand Tours.</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/06/rohan-dennis-will-reportedly-join-jumbo-visma-in-2022/\">Rohan Dennis will reportedly join Jumbo-Visma in 2022</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"37fa2286b524f7bb4ba6d6d3a498de6757d4cd15d11fbba65409a8b3edc02f10","category":"Cycling"}