{"title":"Combined treatment with amitraz and thymol to manage Varroa destructor mites (Acari: Varroidae) in Apis mellifera honey bee colonies (Hymenoptera: Apidae)","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae022/7683865?rss=1","date":1716854400000,"content":"<span><div>Abstract</div>The parasitic mite <span>Varroa destructor</span> (Anderson and Trueman) is one of the greatest stressors of <span>Apis mellifera</span> (L.) honey bee colonies. When <span>Varroa</span> infestations reach damaging levels during fall, rapid control is necessary to minimize damage to colonies. We performed a field trial in the US Southeast to determine if a combination of registered treatments (Apivar, amitraz-based; and Apiguard, thymol-based) could provide rapid and effective control of <span>Varroa</span>. We compared colonies that received this combination treatment against colonies that received amitraz-based positive control treatments: (i) Apivar alone; or (ii) amitraz emulsifiable concentrate (“amitraz EC”). While not registered, amitraz EC is used by beekeepers in the United States in part because it is thought to control <span>Varroa</span> more rapidly and effectively than registered products. Based on measurements of <span>Varroa</span> infestation rates of colonies after 21 days of treatment, we found that the combination treatment controlled <span>Varroa</span> nearly as rapidly as the amitraz EC treatment: this or other combinations could be useful for <span>Varroa</span> management. At the end of the 42-day trial, colonies in the amitraz EC group had higher bee populations than those in the Apivar group, which suggests that rapid control helps reduce <span>Varroa</span> damage. Colonies in the combination group had lower bee populations than those in the amitraz EC group, which indicates that the combination treatment needs to be optimized to avoid damage to colonies.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"37fcb2bb04a520cb00a88cab910494981b1f3514918cb67b722734348d4d13f6","category":"Environment"}