{"title":"A retrospective study of tuberculosis prevalence and associated factors among HIV-positive key populations in Nigeria","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003461","date":1720792800000,"content":"<p>by Bartholomew Ochonye, Olaniyi Felix Sanni, Godwin Emmanuel, Paul Umoh, Abiye Kalaiwo, Roger Abang, Paul Amechi, Mark Ahkigbe, Shakirat Akinpelumi, Olugbemi Motilewa</p>\r\n\r\nHIV is a major risk factor for active Tuberculosis (TB.) This raises patients’ risk of original infection, reinfection, and TB reactivation. Providing healthcare to KPLHIV in developing countries requires TB prevalence research. This study aims to determine the prevalence of TB and HIV co-infection and associated factors among KPLHIV. This is a retrospective cross-sectional study among KP’s living with HIV enrolled on care in One Stop Shop (OSS) of Heartland Alliance Ltd/GTE across six states in Nigeria. Data were analysed using IBM SPSS version 25.0. Secondary data analysis of client’s records from the RADET files of the KPCARE 1 project from 6 states was conducted. Means with standard deviations were computed for continuous variables like age, and frequency tables were generated for categorical variables. Chi-square tests and t-tests were used for the bivariate analysis of variables. All tests were done at a 5% level of statistical significance (p = 0.05).TB prevalence was 19.1% among KP’s living with HIV, with variations observed in age groups, geographic locations, target populations, marital status, educational backgrounds, clinical characteristics, and antiretroviral therapy (ART) history. KPs aged 51 and above exhibited the highest TB prevalence (21.0%), while those aged below 20 years had the lowest (18.2%). Jigawa KPs recorded the highest TB prevalence (38.4%), and Niger had the least (13.3%). TB was more prevalent among People who inject drugs (20.3%), divorced (32.3%), and those who attained Qur’anic education (29.7%). KPs who had to restart ART exhibited the highest TB prevalence (22.0%), whereas those who experienced Interruption in treatment (IIT) reported the lowest at 10.0%. Immune-suppressed KPs (CD4 counts &lt; 200 cells/m<sup>3</sup>) had a higher TB prevalence of 26.6%. TB prevalence among KPs living with HIV varies greatly, underlining the need for targeted treatments, especially for high-risk categories, to improve HIV treatment outcomes and reduce TB prevalence.","author":"Bartholomew Ochonye","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"3807ee784f301a6096d09943e89adff8255bce3f2f77f656dd39f1a49217b746","category":"Environment"}