{"title":"Hugging Face, the GitHub of AI, hosted code that backdoored user devices","link":"https://arstechnica.com/?p=2007291","date":1709316149000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/exploit-800x534.jpg\" alt=\"Photograph depicts a security scanner extracting virus from a string of binary code. Hand with the word &quot;exploit&quot;\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/exploit.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Code uploaded to AI developer platform Hugging Face covertly installed backdoors and other types of malware on end-user machines, researchers from security firm JFrog said Thursday in a report that’s a likely harbinger of what’s to come.</p>\n<p>In all, JFrog researchers said, they found roughly 100 submissions that performed hidden and unwanted actions when they were downloaded and loaded onto an end-user device. Most of the flagged machine learning models—all of which went undetected by Hugging Face—appeared to be benign proofs of concept uploaded by researchers or curious users. JFrog researchers said in an email that 10 of them were “truly malicious” in that they performed actions that actually compromised the users’ security when loaded.</p>\n<h2>Full control of user devices</h2>\n<p>One model drew particular concern because it opened a reverse shell that gave a remote device on the Internet full control of the end user’s device. When JFrog researchers loaded the model into a lab machine, the submission indeed loaded a reverse shell but took no further action.</p></div><p><a href=\"https://arstechnica.com/?p=2007291#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2007291&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"381595ea989f568781ab051104738428c19e7ad3728ed4409c0ed821117ca756","category":"Tech"}