{"title":"Social determinants of child abuse: Evidence from seven countries in sub-Saharan Africa","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305778","date":1721224800000,"content":"<p>by Kwamena Sekyi Dickson, Edward Kwabena Ameyaw, Kenneth Setorwu Adde, Jones Arkoh Paintsil, Sanni Yaya</p>\r\nBackground <p>Child abuse is a dominant public health concern that permeates race, varied social contexts and culture. Child abuse comprises any act of omission or commission perpetrated by a child’s parent, caregiver, or other adult leading to harm, potential for, or any threat of harm to a child (below age 18), either intentional or unintentional. This subject has usually been explored by focusing on men. This study investigated the prevalence and social correlates of child abuse across seven countries in sub-Saharan Africa.</p> Methods and materials <p>Data was obtained from Demographic and Health Surveys (DHS) conducted in seven countries in sub-Saharan Africa between 2013 and 2020. The outcome variable employed for this study was acts of child abuse (including shouting, striking, and slapping). Descriptive and inferential analyses were carried out. The descriptive analysis focused on the bivariate analysis between the country variable and the outcome variables. Multivariate analysis was, however, utilized to determine the relationship between the outcome variables and the respondents’ explanatory variables, using a binary logistic regression model. The adjusted odds ratios for each variable were calculated using a 95% confidence range.</p> Results <p>The proportion of women shouting at children was 72 percent. This ranged from 49.2 percent in Chad to 84.2 percent in Benin. The proportion of women striking children was 52.5 percent and this ranged from 37.1 percent in Chad to 63.8 percent in Benin. The odds of women striking their children was higher for those with children aged 10–14 (aOR = 1.18, CI = 1.03, 1.34), women with primary education (aOR = 1.25, CI = 1.17, 1.33), cohabiting women (aOR = 1.17, CI = 1.10, 1.25) and women who had experienced intimate partner violence (aOR = 1.06, CI = 1.00, 1.12). The odds of women shouting at their children was higher for those aged 30–34 years (aOR = 1.31, CI = 1.11, 1.55) and for working women (aOR = 1.43, 1.33, 1.56). The odds of women slapping their children was higher for those who justify wife-beating (aOR = 1.10, CI = 1.03, 1.16) and for women with richest wealth status (aOR = 1.25, CI = 1.17, 1.33).</p> Conclusions <p>The findings show that it is imperative for the governments of the countries studied, especially those with high prevalence like Benin, to consider parent-friendly and culturally acceptable non-formal educational initiatives that will dissuade parents and guardians from abusing children. Possibly, legal reforms that sanction harsher punishments to perpetrators of child abuse may help make child abuse less attractive to parents and guardians.</p>","author":"Kwamena Sekyi Dickson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"381edc37664cdf1a3dd272ea3cfeb50e56d00d7e69a02d91eedb71f213257bbf","category":"Interdisciplinary"}