{"title":"The Specific and Total CO2 Emission Activity of Wood-Decaying Fungi and their Response to Increase in Temperature","link":"https://www.preprints.org/manuscript/202405.2066/v1","date":1717071745000,"content":"CO2 emission activity of xylotrophic fungi response to an increase in temperature in the range of 10-30 °C on the example of pure dikaryotic cultures of Fomes fomentarius s. str., F. inzengae, Fomitopsis betulina, F. pinicola, Phellinus igniarius was analyzed. Emission activity was assessed by the difference in CO2 concentration in 0.5-liter exposure chambers with Petri dishes with mycelium growing on agar at the beginning of exposure and an hour later using a Gasmet DX-4030 FTIR spectrometer (Gasmet Technologies Oy, Finland), error measurements ±50 ppm. Specific (μg CO2/cm2/h) and total (μg CO2/h) emission activity and its relationship with temperature and size (area) of the mycelium were assessed. It has been shown that in the range of 10-30 °C, the specific and total CO2 emission activity of the mycelium is closely and positively related to temperature. Specific emission, which is an indicator of the respiratory activity of the mycelium, does not depend on its size; its only driver is temperature, the relationship with which is linear: an increase in temperature by 10 °C causes an increase in the specific emission activity of the mycelium by 1.7 times. The total CO2 emission activity, which is an indicator of the total amount of CO2 emitted, is directly proportional to the specific emission activity and the size of the mycelium. In the range of 10-30 °C, an increase in temperature causes an almost equal increase in both the specific emission activity of the mycelium (Q10 1.7) and its growth (Q10 1.5) and causes an exponential increase in the total emission of CO2. This must be taken into account when predicting CO2 emissions from woody debris under climate change, as it could potentially contribute to accelerating climate change.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3822ed3797d873bf2bc409c86ee4c96bebad16993430a8a0379e253b7322446f","category":"Interdisciplinary"}