{"title":"Molecular dissection of the pseudokinase ZED1 expands effector recognition to the tomato immune receptor ZAR1","link":"https://academic.oup.com/plphys/article/196/1/651/7674203?rss=1","date":1715731200000,"content":"<span><div>Abstract</div>The highly conserved angiosperm immune receptor HOPZ-ACTIVATED RESISTANCE 1 (ZAR1) is a bacterial pathogen recognition hub that mediates resistance by guarding host kinases for modification by pathogen effectors. The pseudokinase HOPZ-ETI DEFICIENT 1 (ZED1) is the only known ZAR1-guarded protein that interacts directly with a pathogen effector, HopZ1a, from the bacterial pathogen <span>Pseudomonas syringae</span>, making it a promising system for rational design of effector recognition for plant immunity. Here, we conducted an in-depth molecular analysis of ZED1. We generated a library of 164 random ZED1 mutants and identified 50 mutants that could not recognize the effector HopZ1a when transiently expressed in <span>Nicotiana benthamiana</span>. Based on our random mutants, we generated a library of 27 point mutants and found evidence of minor functional divergence between Arabidopsis (<span>Arabidopsis thaliana</span>) and <span>N. benthamiana</span> ZAR1 orthologs. We leveraged our point mutant library to identify regions in ZED1 critical for ZAR1 and HopZ1a interactions and identified two likely ZED1-HopZ1a binding conformations. We explored ZED1 nucleotide and cation binding activity and showed that ZED1 is a catalytically dead pseudokinase, functioning solely as an allosteric regulator upon effector recognition. We used our library of ZED1 point mutants to identify the ZED1 activation loop regions as the most likely cause of interspecies ZAR1-ZED1 incompatibility. Finally, we identified a mutation that abolished ZAR1-ZED1 interspecies incompatibility while retaining the ability to mediate HopZ1a recognition, which enabled recognition of HopZ1a through tomato (<span>Solanum lycopersicum</span>) ZAR1. This provides an example of expanded effector recognition through a ZAR1 ortholog from a non-model species.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"38264d486eca6167f806b134856f280e78b7d2240bf7234c1fff9710a3753575","category":"Environment"}