{"title":"3D Numerical Modeling for Investigating Structural Controls on Orogenic Gold Mineralization, Sanshandao Gold Belt, Eastern China","link":"http://link.springer.com/10.1007/s11053-024-10353-1","date":1722470400000,"content":"<h3>Abstract</h3>\n                    <p>Hydrothermal disseminated gold mineralization in the Sanshandao gold belt, Jiaodong Peninsula, China, is closely associated with regional NE–NNE fault zones. To investigate the structural controls on this mineralization, we conducted 3D numerical modeling of coupled heat transport, tectonic deformation, and fluid flow, of which two sets of models, designed simple models and actual models, were involved. The simple models were used to examine how general fault geometries (fault bend length, fault bend angle, and fault dip) influenced dilation (positive volume strain) and fluid flow and further influenced hydrothermal mineralization. In contrast, actual modeling was carried out to further understand the structural controls and mineralization localization in a specific geological condition at Sanshandao. Following this, numerical simulation experiments with variable paleo-stresses on these two models were carried out in FLAC<sup>3D</sup> platform. The simulation results of the simple models showed that long fault bend lengths, large absolute fault bend angles, and large changes in fault dip were more likely to promote dilation in the fault zone. The dilation zones are related to the small intersection angle of maximum principal stress and fault dip. The simulation results of the actual model illustrate that the gold mineralization distribution at Sanshandao was controlled by the coupling of fault strike–dip bends. Specifically, the discontinuous mineralization in the vertical direction was caused by local fluid focusing due to fault dip changes, particularly where the bend length was long. In addition, the oblique orientation of ore shooting depended on the variable strain orientations relative to the fault, which appeared to be fault strike variations. The results further determined the NNW–SSE-directed compression as the paleo-stress regime at Sanshandao during the ore-forming period. Our data also illustrated the deep fluid flow pathways in the Sanshandao gold belt and the Xinli S–SSE deep and the Sanshandao and Beibuhaiyu E–NE deep areas deserve to be the focus of the next gold exploration.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"3826117c9c9e66b415c2dd9a9a9f2f40eb43bc129c8d7a3308feb07efcc6de83","category":"Environment"}