{"title":"61 Effects of botanical composition on grazing system management, forage quality, forage availability, and ewe performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/203/7664788?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective was to compare the effects of two forage mixtures utilized in a rotational grazing system on ewe performance, forage quality, and forage availability. Dorset-Suffolk crossbred ewes [n = 48; body weight (BW) = 187 ± 20 kg] were stratified by BW, body condition score (BCS), and age, then allotted to six groups. Groups were randomly assigned to one of two treatments: forage mixture 1 (FM1; 47% orchard grass, 30% white clover, 14% brome grass, and 9% ryegrass) and forage mixture 2 (FM2; 44% ryegrass, 33% white clover, and 23% red clover). There were 18 paddocks (30.5 m x 22 m) for each treatment, each group was rotated between one of six paddocks; the rotation of each group was determined by the reduction of forage height to approximately 10 cm. Ewe BW and BCS were collected on d 0, 14, and 28. Forage heights were measured using meter sticks upon the groups entering and exiting each paddock. Forage heights were used to calculate forage availability, and the difference between pre-grazing and post-grazing forage availability was assumed to be forage disappearance. Five pre-grazing forage samples from each paddock were clipped at 10 cm using the forage square (0.0625 m²) to determine fiber content. Data were analyzed using the GLM procedure of SAS 9.4. No effects on ewe BW or BCS were observed (<span>P</span> = 0.4134) between treatments. Ewes grazing FM2 spent more time grazing each paddock (<span>P</span> &lt; 0.01) compared with ewes grazing FM1. Pre-grazing forage ground cover (<span>P</span> &lt; 0.01) was greater in FM2 compared with FM1; however, grazed forage mass disappearance was not different (<span>P</span> = 0.44) between treatments. The NDF and ADF values were greater for FM1 than FM2 (<span>P</span> &lt; 0.01 and <span>P</span> = 0.02, respectively) indicating that more forage is needed to meet ewe energy requirements. Results suggest that neither forage mixture had a significant impact on ewe BW or BCS; however, ewes grazing FM2 maintained themselves on a smaller land area during growing season, making it a more feasible option for rotational grazing management.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"382ce1395b8e7b0fa3a4cdc2305b3f4ef7d7a473280fa127bb20aab24c1be30f","category":"Environment"}