{"title":"ลาก่อน SEO กูเกิลเปิดตัวฟีเจอร์ Generative AI ช่วยตอบคำถามใต้ช่องค้นหาโดยตรง","link":"https://www.blognone.com/node/133790","date":1683779551000,"content":"<div><div><div><p>กูเกิลประกาศฟีเจอร์ทดลอง (experimental) ให้ Google Search เพิ่ม Generative AI ช่วยตอบคำถามของผู้ใช้งาน โดยแทบไม่ต้องกดเข้าไปดูลิงก์ในรายการค้นหาเลย</p>\n<p>พื้นที่แสดงผลของ Generative AI อยู่ใต้กล่องค้นหาและเหนือลิงก์แรก แถมแสดงผลเกือบเต็มหน้าจอ (ลาก่อนชาว SEO) โดยกูเกิลจะแสดงสีพื้นหลังสีอื่นที่ไม่ใช่สีขาว เพื่อให้เห็นความแตกต่างของพื้นที่แสดงผล Generative AI</p>\n<p>สิ่งที่ AI เข้ามาช่วยตอบคำถามมีทั้งการสรุปประเด็น นำเสนอลิงก์ข้อมูลเพิ่มเติม และอาจหยิบเอาวิดีโอที่เกี่ยวข้องมาแสดงผล ให้เข้ากับยุคสมัยแห่งวิดีโอสั้นแนวตั้งด้วย (ดูคลิปประกอบ) หากผู้ใช้ต้องการข้อมูลเพิ่มเติมสามารถกดปุ่ม Ask a follow up เพื่อสนทนากับบ็อตต่อเนื่องได้ โดยบ็อตจะเข้าใจสิ่งที่เราค้นหามาก่อนด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/649440e256f5acd02f95d5abd6c375a9.png\" /></p>\n<p>กูเกิลยังบอกว่าฟีเจอร์ Generative AI ยังเข้าใจข้อมูลสินค้าจำนวน 3.5 หมื่นล้านรายการจาก Google Shopping Graph ทำให้บ็อตเข้าใจข้อมูลสินค้าและช่วยคัดเลือกสินค้าที่เราต้องการมาแนะนำได้ด้วย</p>\n<p>ส่วนในแง่ประเด็นว่าทราฟฟิกคนเข้าเว็บจะหายไปไหม กูเกิลยืนยันว่าการแสดงลิงก์จะยังคงอยู่ต่อไป และการแสดงโฆษณาในหน้าผลการค้นหา (search ads) ยังมีอยู่เช่นกัน</p>\n<p>ฟีเจอร์นี้มีชื่ออย่างเป็นทางการว่า Search Generative Experience (SGE) ยังมีสถานะเป็นการทดลองในระบบ Search Labs (ทั้งบนเดสก์ท็อปและแอพบนมือถือ) ผู้ใช้ต้องเปิดใช้งานเอง และยังจำกัดเฉพาะในสหรัฐอเมริกาเท่านั้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b651a9ad29de946e31fc709d6ebee20a.png\" /></p>\n<p>ฟีเจอร์นี้ของ Google Search น่าจะเป็น<a href=\"https://www.blognone.com/node/133453\">เรื่องเดียวกับโครงการ Magi ที่มีข่าวหลุดมาก่อนหน้านี้</a> ว่ากูเกิลกำลังพัฒนาลูกผสม search/chat อยู่ ซึ่งต่างจากแนวทางของ Bing ที่ยังแยกส่วน search/chat จากกันอย่างชัดเจน</p>\n<p>ที่มา - <a href=\"https://blog.google/products/search/generative-ai-search/\">Google</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-search\">Google Search</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"382de417cdac64a1cfeafa7992d51421c826cc84ad96d4023b33f905a5c273fc","category":"Thai"}