{"title":"Lessons in cognition: A review of maze designs and procedures used to measure spatial learning in fish","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15918?af=R","date":1726205022000,"content":"<h2>Abstract</h2>\n<p>The use of different mazes to assess spatial learning has become more common in fish behavior studies in recent decades. This increase in fish cognition research has opened the door to numerous possibilities for exciting and diverse questions, such as identifying ecological drivers of spatial cognition and understanding the role individual variation plays in navigational abilities. There are many different types of mazes, each with its own specific considerations, making it challenging to determine exactly which spatial test is the most relevant and appropriate for a particular experiment. Many spatial mazes, such as the T-maze and Y-maze, have been successfully adapted from rodent studies, particularly with respect to zebrafish, a widely accepted non-mammalian model in biomedical studies. Standardization across studies is increasing with these easily accessible maze designs, validating them for use in fish; however, variations in design (e.g., length of arms and scale) and procedure still exist, and the impact of these variations on results is largely unknown. The efforts to standardize mazes outside zebrafish work are also more limited. Other mazes have been developed specifically for use on fish, with design modifications varying widely, making it difficult to draw comparisons. In this review, we have highlighted the many design and procedural elements that should be considered for the acquisition of reliable behavioral data, with the goal of drawing readers' attention to aspects of experimentation that are often not given the careful consideration that they deserve. We then argue that additional focused research and reporting is needed to produce more reliable methods in spatial learning research across a broader range of subjects.</p>","author":"Amelia Munson, \nCairsty DePasquale","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"3832a2868855c87c95275a52a680cf2ed76bb0f2516cbae9c4f1777a435bacd2","category":"Environment"}