{"title":"Simon Yates storms to the lead at the Tour of the Alps: Daily News","link":"https://cyclingtips.com/2021/04/simon-yates-storms-to-the-lead-at-the-tour-of-the-alps-daily-news/","date":1618964038000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>Tuesday saw the climbers come to the fore at the Tour of the Alps. Meanwhile, Tom Dumoulin has reportedly been added to the list of riders eligible for a pre-Olympic COVID-19 vaccination, while reports have linked Jai Hindley to a potential move to Trek-Segafredo.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br />News Editor</em></p>\n\n\n\n<h2>What’s news?</h2>\n\n\n\n<h3>Yates storms to victory on stage 2 of the Tour of the Alps</h3>\n\n\n\n<p><strong>Simon Yates</strong> took an emphatic victory on stage 2 of the <strong>Tour of the Alps</strong> on Tuesday, putting his pre-Giro d’Italia form on display with the Italian Grand Tour rapidly approaching.</p>\n\n\n\n<p>The challenging stage from Innsbruck to Feichten im Kaunertal came down to a battle on the Piller Sattel climb, where Yates hung with a dwindling lead group before putting in a big surge with around 3 km left to climb and a little under 30 km left in the stage.</p>\n\n\n\n<p><strong>Pavel Sivakov</strong>, <strong>Nairo Quintana</strong>, and <strong>Hugh Carthy</strong> followed the move initially but they faded as Yates pressed on and went over the top of the climb solo. He stayed clear through the ensuing descent and the gradual climb to the finish, taking the win 41 seconds ahead of Sivakov, with <strong>Dan Martin</strong> in third on the day, 58 seconds back.</p>\n\n\n\n<p>Yates now leads the general classification with a 45-second gap over Sivakov.</p>\n\n\n\n<h3>Dumoulin on list of riders eligible for pre-Olympic COVID-19 vaccine</h3>\n\n\n\n<p><a href=\"https://www.wielerflits.nl/nieuws/tom-dumoulin-op-vaccinatielijst-nocnsf/\" target=\"_blank\">Wielerflits</a> reports that <strong>Tom Dumoulin</strong>, who announced on January 22 that he would be taking a break from racing, is <a href=\"https://cyclingtips.com/2021/04/tom-dumoulin-is-one-of-seven-cyclists-on-the-netherlands-olympic-vaccination-list/\" target=\"_blank\">on the the list</a> of seven riders eligible for a COVID-19 vaccine ahead of the <strong>Tokyo Olympics</strong>. The Dutch Olympic Committee and the Dutch Sports Federation will start vaccinations on April 26.</p>\n\n\n\n<p>Official selections for the Dutch Olympic team have not yet been made, but Dumoulin’s presence on the list of riders who could receive vaccines suggests he could potentially return to competition for the Tokyo Games.</p>\n\n\n\n<h3>4 Jours de Dunkerque cancelled</h3>\n\n\n\n<p>The <strong>4 Jours de Dunkerque</strong> has been cancelled due to coronavirus, organizers announced on Tuesday.</p>\n\n\n\n<p>The news marks the second straight year that the French stage race, which was set to run from May 4 to 9 (yes, that’s six days) has been called off.</p>\n\n\n\n<h3>Hindley could reportedly be headed to Trek-Segafredo</h3>\n\n\n\n<p>According to <a href=\"https://www.nieuwsblad.be/cnt/dmf20210420_95007372\" target=\"_blank\">Het Nieuwsblad</a>, <strong>Jai Hindley</strong> could be headed to <strong>Trek-Segafredo</strong> next season. Het Nieuwsblad reports that the 24-year-old Australian will not re-sign with the <strong>DSM</strong> organization (formerly Sunweb), with whom he has ridden since 2018.</p>\n\n\n\n<p>Instead, he could be on his way to Trek-Segafredo to ride as a leader for the Grand Tours. Hindley rode to second overall ta the <strong>Giro d’Italia</strong> last year.</p>\n\n\n\n<h2>Coming up …</h2>\n\n\n\n<p>Some of the biggest names in the men’s and women’s pelotons will take on the Mur de Huy on Wednesday at La Flèche Wallonne. Anna van der Breggen and Marc Hirschi are the defending champions, and plenty of other stars will be hoping to beat them to the top of the punchy climb in Belgium’s Wallonia region. Meanwhile, the Tour of the Alps will continue with a stage 3 that will feature more challenging climbs and potential GC action.</p>\n\n\n\n<h2>In case you missed it …</h2>\n\n\n\n<ul><li>Iain Treloar takes <a href=\"https://cyclingtips.com/2021/04/making-sense-of-the-controversial-photo-finish-at-amstel-gold/\" target=\"_blank\">a closer look</a> at the <strong>Amstel Gold Race</strong> finish and at how bike race finishes work generally.</li><li><strong>Silca’s</strong> pre-waxed diamond-polished chains save <a href=\"https://cyclingtips.com/2021/04/silcas-pre-waxed-diamond-polished-chains/\" target=\"_blank\">even more watts</a>.</li><li>For a fourth year, <strong>Panaracer</strong> is offering a single run of <strong>Gravel King</strong> <a href=\"https://cyclingtips.com/2021/04/panaracer-announces-limited-edition-pink-and-blue-gravel-king-tyres/\" target=\"_blank\">color options</a>.</li><li><strong>Zipp</strong> merges <a href=\"https://cyclingtips.com/2021/04/zipp-new-353-nsw-wheelset/\" target=\"_blank\">two wheelsets into one</a> with the new <strong>353 NSW</strong>.</li><li>Dave Rome <a href=\"https://cyclingtips.com/2021/04/cervelo-aspero-5-gravel-bike-review/\" target=\"_blank\">reviews</a> the <strong>Cervelo Aspero 5</strong>.</li></ul>\n<p>The post <a href=\"https://cyclingtips.com/2021/04/simon-yates-storms-to-the-lead-at-the-tour-of-the-alps-daily-news/\">Simon Yates storms to the lead at the Tour of the Alps: Daily News</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3835be1d80c6e1d145f1fdcad828d2836cb88a69e04d7c028781ed11f24b0d80","category":"Cycling"}