{"title":"KCTD proteins regulate morphine dependence via heterologous sensitization of adenylyl cyclase 1 in mice","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002716","date":1721052000000,"content":"<p>by Zhong Ding, Chunsheng Zhang, Huicui Yang, Jiaojiao Chen, Zhiruo Sun, Xuechu Zhen</p>\r\n\r\nHeterologous sensitization of adenylyl cyclase (AC) results in elevated cAMP signaling transduction that contributes to drug dependence. Inhibiting cullin3-RING ligases by blocking the neddylation of cullin3 abolishes heterologous sensitization, however, the modulating mechanism remains uncharted. Here, we report an essential role of the potassium channel tetramerization domain (KCTD) protein 2, 5, and 17, especially the dominant isoform KCTD5 in regulating heterologous sensitization of AC1 and morphine dependence via working with cullin3 and the cullin-associated and neddylation-dissociated 1 (CAND1) protein. In cellular models, we observed enhanced association of KCTD5 with Gβ and cullin3, along with elevated dissociation of Gβ from AC1 as well as of CAND1 from cullin3 in heterologous sensitization of AC1. Given binding of CAND1 inhibits the neddylation of cullin3, we further elucidated that the enhanced interaction of KCTD5 with both Gβ and cullin3 promoted the dissociation of CAND1 from cullin3, attenuated the inhibitory effect of CAND1 on cullin3 neddylation, ultimately resulted in heterologous sensitization of AC1. The paraventricular thalamic nucleus (PVT) plays an important role in mediating morphine dependence. Through pharmacological and biochemical approaches, we then demonstrated that KCTD5/cullin3 regulates morphine dependence via modulating heterologous sensitization of AC, likely AC1 in PVT in mice. In summary, the present study revealed the underlying mechanism of heterologous sensitization of AC1 mediated by cullin3 and discovered the role of KCTD proteins in regulating morphine dependence in mice.","author":"Zhong Ding","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"383715b179f7f6f78c52e81b4e6b6029998ecdf7eb7a1678e5ace67f895ddf2d","category":"Environment"}