{"title":"แพตช์เดียวไม่พอ Log4j ออกเวอร์ชั่น 2.16.0 หลังพบแพตช์เดิมปิดช่องโหว่ไม่หมด","link":"https://www.blognone.com/node/126315","date":1639507221000,"content":"<div><div><div><p>หลังจากช่องโหว่รันโค้ดใน Log4j <a href=\"https://www.blognone.com/node/126300\">สร้างผลกระทบไปทั่วโลก</a> วันนี้ทางโครงการก็ออกแพตช์มาอีกครั้ง เพื่อเสริมความปลอดภัยอีกระดับ โดยปิดการทำงานโมดูล JNDI ที่เป็นต้นเหตุของการโหลดโค้ดเข้ามารันเป็นค่าเริ่มต้น เนื่องจากพบช่องโหว่ CVE-2021-45046 ที่ยังโจมตีได้อยู่</p>\n<p>ช่องโหว่ CVE-2021-45046 ที่พบเพิ่มเติมมีความรุนแรงน้อยกว่าช่องโหว่เดิมมาก (CVSS 3.7 คะแนน ความร้ายแรงระดับปานกลาง) โดยกระทบกับระบบที่คอนฟิกบางรูปแบบที่ต่างไปจากค่าเริ่มต้น และผลกระทบจากการโจมตีจะทำให้ระบบแครช กลายเป็นการโจมตีแบบ denial of service (DOS) เท่านั้น แต่จุดสำคัญคือการ formatMsgNoLookups ในเวอร์ชั่นก่อนหน้านี้ไม่สามารถปิดช่องโหว่นี้ได้</p>\n<p>ช่องโหว่เดิมที่พบสัปดาห์ที่ผ่านมาคือ CVE-2021-44228 หรือเรียกชื่อเล่นว่า log4shell นั้นกระทบเป็นวงกว้าง และแม้แต่ระบบภายในที่รันโดยไม่ได้รับข้อมูลจากอินเทอร์เน็ตโดยตรงก็อาจจะถูกโจมตีได้ ทาง <a href=\"https://www.govcert.ch/blog/zero-day-exploit-targeting-popular-java-library-log4j/\">CERT ของสวิสเซอร์แลนด์</a>แนะนำให้แพตช์ระบบที่ให้บริการผ่านอินเทอร์เน็ต (internet facing) โดยทันที ขณะที่ระบบภายในควรแพตช์โดยเร็ว</p>\n<p>ใน Log4j เวอร์ชั่น 2.16.0 นี้ฟีเจอร์ JNDI ยังคงใช้งานได้ต่อไป แต่ผู้ที่ต้องการใช้งานจะต้องเปิดตัวเลือก <code>log4j2.enableJndi</code> ด้วยตัวเอง</p>\n<p>ที่มา - <a href=\"https://lists.apache.org/thread/83y7dx5xvn3h5290q1twn16tltolv88f\">Apache</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3d60d8e354e07bfe12f10fe6930f4703.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/log4j\">Log4j</a></div><div><a href=\"/topics/security\">Security</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"383a9ab42c3e06b8d55d5b92a7283ec9422d13309b5903215de28aae4df13733","category":"Thai"}