{"title":"Dynamics of alongshore current in the Taiwan Strait: A perspective on the southward Kuroshio branch in winter","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12625?af=R","date":1723833029000,"content":"<h2>Abstract</h2>\n<p>In winter, the Kuroshio Current intrudes onto the continental shelf in the East China Sea with a cyclonic branch occasionally veering northeast of the Taiwan Strait. The dynamic process and mechanism by which the southward Kuroshio branch enters the Taiwan Strait is investigated using a numerical model. Decomposition of the flow field and sea surface height (SSH) using the empirical orthogonal function (EOF) isolates the first mode of the southward flow and the east-westward SSH slope, showing that the time series is closely related to wind strength. The southward Kuroshio branch is mainly controlled by geostrophic and Ekman effects. When northeasterly winds are weak, the elevated SSH on the eastern side, caused by the Kuroshio, generates a northward geostrophic current. This northward current overwhelms the Ekman current and triggers the Taiwan Warm Current. Conversely, when northeasterly winds are strong, an elevated SSH on the western side generates a southward geostrophic current. A theoretical equation is devised, which accounts for Ekman layer depth related to wind strength and geostrophic adjustments by the Ekman effect. This equation explains why the Kuroshio branch flows into the northern Taiwan Strait and why there is a counter-wind current (i.e., Taiwan Warm Current) during winter. Furthermore, we propose a novel perspective that suggests the alongshore current and cross-shore sea level in the Taiwan Strait are determined by the wind-driven current and geostrophic adjustment, which are generated by the competition or cooperation between the wind and the alongshore pressure gradient caused by the Kuroshio.</p>","author":"Xiaolong Zong, \nZhong Sheng, \nShuwen Zhang, \nAijun Wang, \nFangjing Deng, \nQiang Wang, \nZhaoyun Chen","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"383c7f150d54c283aca856344fd199909555e2ca9903f6247ac112eb0ed7d2dd","category":"Environment"}