{"title":"กลับมาตามคำเรียกร้อง กรุงไทยเปิดขายพันธบัตรออมทรัพย์ รุ่นยิ่งออมยิ่งได้  บนวอลเล็ต สบม. ผ่านแอปฯ เป๋าตัง ลงทะเบียนซื้อผ่านวอลเล็ตได้แล้ววันนี้","link":"https://www.blognone.com/node/123569","date":1625449843000,"content":"<div><div><div><p>ใครที่กำลังมองหาช่องทางลงทุนปลอดภัย ได้ดอกเบี้ยสูงกว่าเงินฝากประจำ และสามารถลงทุนได้ง่ายผ่านช่องทางดิจิทัล วันนี้กลับมาตามคำเรียกร้องแล้วสำหรับพันธบัตรออมทรัพย์จากธนาคารกรุงไทย รุ่นยิ่งออมยิ่งได้ เป็นการเปิดขายพันธบัตรครั้งที่ 4 หลังการเปิดขาย ครั้งแรกได้รับการตอบรับล้นหลาม ขายหมดภายในไม่กี่นาที</p>\n<p>พันธบัตรฯ รุ่นยิ่งออมยิ่งได้ จะเริ่มเปิดขายอย่างเป็นทางการในวันที่ 5 กรกฎาคม 2564 เวลา 8.30 น. ถึง 23 กรกฎาคม 2564 เวลา 15.00 น. และเพื่อไม่ให้เป็นการพลาดโอกาสสำคัญ นักลงทุนสามารถลงทะเบียนใช้งาน วอลเล็ต สบม. บนแอปพลิเคชั่นเป๋าตังได้แล้ววันนี้</p>\n<p>ก่อนจะเข้าเรื่องช่องทางลงทะเบียนจับจองซื้อพันธบัตร เรามาดูความโดดเด่นของ พันธบัตรยิ่งออมยิ่งได้ กันก่อน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6d24de1c572cfd5b746ea59847369b25.jpeg\" /></p>\n<h3>พันธบัตรออมทรัพย์ รุ่นยิ่งออมยิ่งได้ ให้ดอกเบี้ย ทุก 3 เดือน</h3>\n<p>เนื่องด้วยนโยบายของกระทรวงการคลังในการนําเทคโนโลยี Blockchain มาใช้เพื่อยกระดับหน่วยงานรัฐ ธนาคารกรุงไทยจึงพัฒนาช่องทางการซื้อขายพันธบัตรด้วยวอลเล็ต สบม. บนแอปพลิเคชั่นเป๋าตัง โดยวอลเล็ต สบม. นี้ออกแบบการซื้อขายให้เป็นแบบรวมศูนย์ ซื้อขายแล้วมีผลทันที เมื่อซื้อขายพันธบัตรแล้ว ข้อมูลการถือครองจะแสดงให้เห็นในวอลเล็ตทันที ไม่ต้องรอ 15 วันเหมือนที่ผ่านมา</p>\n<p>พันธบัตรออมทรัพย์ ยิ่งออมยิ่งได้ วงเงินจำหน่าย 10,000 ล้านบาท เปิดขายขั้นต่ำที่ 100 บาท ลงทุนสูงสุดไม่เกิน 10 ล้านบาท เปิดโอกาสให้เข้าถึงการลงทุนได้อย่างเท่าเทียม ให้ดอกเบี้ยสูงสุด 2.2% ต่อปี นับเป็นการลงทุนที่คุ้มค่ากว่าการฝากเงินไว้ในธนาคารเฉยๆ ที่สำคัญคือ ให้ดอกเบี้ยไปใช้เลยทุก 3 เดือน ปีละ 4 งวด ถือเป็นครั้งแรกของวงการพันธบัตรไทยเลยก็ว่าได้</p>\n<h3>ช่องทางลงทะเบียน</h3>\n<p>เริ่มจากดาวน์โหลดแอป เป๋าตัง<br />\n<img src=\"https://www.blognone.com/sites/default/files/externals/24be023b320fd8fb6ab3f7c5095dc0f6.png\" /></p>\n<p>ทำการลงทะเบียนแอปเป๋าตังด้วยการถ่ายรูปบัตรประชาชนและสแกนใบหน้าเพื่อยืนยันตัวตน<br />\n<img src=\"https://www.blognone.com/sites/default/files/externals/3838e5f2fea90104e7dba7d2cae7d17d.png\" /></p>\n<p>ทำการลงทะเบียนวอลเล็ตโดย เลือกเมนูวอลเล็ต สบม. แล้วถ่ายรูปบัตรประชาชน ยืนยันตัวตนด้วยใบหน้า และกรอกข้อมูลตามกฎหมายการลงทุน<br />\n<img src=\"https://www.blognone.com/sites/default/files/externals/1d220897cf638c5a3e8ece434a7caba4.png\" /></p>\n<p>เมื่อลงทะเบียนวอลเล็ตเรียบร้อยแล้ว สามารถเติมเงินเข้าวอลเล็ตได้ทันที เติมได้ทั้งจากธนาคารกรุงไทยเองและธนาคารอื่นๆ<br />\n<img src=\"https://www.blognone.com/sites/default/files/externals/7680734443359fa5665febd2ee8613ee.png\" /></p>\n<p>ในการซื้อพันธบัตร เข้าที่เมนู วอลเล็ต สบม. เลือกซื้อ/ขาย พันธบัตร กรอกจำนวนเงิน สั่งซื้อพร้อมรับสลิปดิจิทัลได้ทันที<br />\n<img src=\"https://www.blognone.com/sites/default/files/externals/24908b431fd6d396f37ad542139a5335.png\" /></p>\n<h3>สรุป</h3>\n<p>พันธบัตรออมทรัพย์ ยิ่งออมยิ่งได้ ถือเป็นอีกทางเลือกการลงทุนที่เหมาะสำหรับผู้เริ่มลงทุนครั้งแรก โดยเฉพาะคนยุคนี้ที่ชินกับการทำธุรกรรมบนมือถือแล้ว เพราะลงทุนได้เพียงหลักร้อย นอกจากนี้ยังมีความเสี่ยงต่ำ เนื่องจากเป็นพันธบัตรรัฐบาล</p>\n<p>สรุปช่องทางลงทะเบียนและซื้อพันธบัตรออมทรัพย์ ยิ่งออมยิ่งได้ กันอีกครั้ง เปิดขายอย่างเป็นทางการแล้วในวันที่ 5 กรกฎาคม 2564 เวลา 8.30 น.</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/4082aeb8e4c16fa0378976be544990fb.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ktb\">KTB</a></div><div><a href=\"/topics/invesment\">Invesment</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"384010b67aa85af18b8b069243ea7ff35ec7c31547c4e4b097058ae7e274cee2","category":"Thai"}