{"title":"macOS Monterey: How to create a bootable installer drive","link":"https://www.macworld.com/article/548920/how-to-macos-monterey-bootable-installer-drive.html","date":1635897891000,"content":"<div>\n<section><div></div></section><p>Apple has a new version of macOS called Monterey that you’ll find in the Software Update pane in System Preferences. However, if you want to update the old-fashioned way, we’ll show you what you need to create a bootable macOS Monterey installation drive. (Editor’s note: These instructions are for the officially released version of macOS Monterey, not a beta. It was performed on a Mac running macOS 11 Big Sur.)</p>\n\n\n\n<h2>Get an external drive and maybe an adapter</h2>\n\n\n\n<p>The macOS Monterey installer software is over 12GB, so you need a USB external drive that can hold that much data. The drive can be a thumb drive, hard drive, or SSD.</p>\n\n\n\n<p>If you have a 2015 or newer Mac laptop that has Thunderbolt/USB-C ports, you may need Apple’s $19 <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/MJ1M2AM/A/usb-c-to-usb-adapter&amp;subid1=1-1-234409-1-0-0&amp;subId3=xid:fr1635221774971idf&amp;subid1=1-1-548920-1-0-0\">USB to USB-C adapter</a>. This will allow you to connect a storage device that uses a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/USB#Standard_connectors&amp;xcust=1-1-234409-1-0-0%7Cxid:fr1635221774971gai&amp;sref=https://www.macworld.com/article/234409/how-to-create-a-bootable-macos-big-sur-installer-drive.html\">USB type-A</a> connector. If you don’t have an external drive and you have a USB-C Mac laptop, you could buy the SanDisk Ultra USB Type-C Flash Drive, which has a USB-C connector. You can get model number <a href=\"https://www.amazon.com/dp/product/B081DFPN3T?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">SDCZ460-032G-G46</a> for $9 on Amazon.</p>\n\n\n\n<p>You need to erase the drive and format it to Mac OS Extended (Journaled). You can do this in the Mac’s Disk Utility app, which is in the Utilities folder inside Applications. </p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/disk-utility-reformat.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Use Disk Utility to format your USB flash drive.</figcaption></figure></div>\n\n\n\n<h2>Get the macOS Monterey installer software</h2>\n\n\n\n<p>Monterey is available through Apple’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/macos-monterey/id1576738294&amp;xcust=1-1-548920-1-0-0&amp;sref=https://www.macworld.com/feed\">App Store</a>. Click on the <em>Get</em> button on the upper right, and the Software Update system preference will open. Click the <em>Download</em> button. The download may take a while.</p>\n\n\n\n<p>But after the download is complete and the installer launches, do <em><strong>not</strong></em> click the <em>Continue</em> button. Quit the installer by pressing Command-Q. Then go to your Applications folder and you should find an “Install macOS Monterey” app. You need to have the app there to make the bootable drive.</p>\n\n\n\n<h2>Use the Terminal to make a bootable macOS Big Sur installer drive</h2>\n\n\n\n<p>1. Connect the external drive to your Mac. In these instructions, I use <code>Untitled</code> as the name of the external drive. If your drive is named something else, you need to change <code>Untitled</code> to the name of your drive.</p>\n\n\n\n<p>2. Launch Terminal. It’s in the Applications &gt; Utilities folder.</p>\n\n\n\n<p>3. Select and copy the following:</p>\n\n\n\n<p><code>sudo /Applications/Install\\ macOS\\ Monterey.app/Contents/Resources/createinstallmedia --volume /Volumes/<em>Untitled</em></code></p>\n\n\n\n<p>4. Go back to Terminal and paste the copied code at the prompt. Remember to change <code>Untitled</code> to the name of your drive. Press <em>Return</em>.</p>\n\n\n\n<p>5. Terminal may ask for your password. Enter it and press <em>Return</em>.</p>\n\n\n\n<p>6. Terminal will warn you that your external drive needs to be erased. To proceed, type Y at the prompt and press <em>Return</em>.</p>\n\n\n\n<p>7. An alert may appear asking for permission for Terminal to access a removable drive. Click <em>OK</em>.</p>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/terminal-confirmation.png\" /></figure></div><p>Apple</p></div>\n\n\n\n<p>8. You’ll see that Terminal erases your drive and then copies the installer file to your drive. This will take a few minutes.</p>\n\n\n\n<p>7. After copying, Terminal is done. You should see Terminal display a message saying your drive is ready for use.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/terminal-make-monterey-usb.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<h2>How to boot from the installer drive</h2>\n\n\n\n<p>1. With the external drive plugged in:</p>\n\n\n\n<ul><li>Intel Mac: Restart/power up the Mac and hold down the option key on the keyboard during the boot process.</li><li>Apple silicon Mac: Restart/power up the Mac and hold down the Mac’s power button during the boot process.</li></ul><p>2. The Startup Manager should appear. Select your external drive. It should appear as “Install macOS Monterey.”</p>\n\n\n\n<p>3. The Mac will boot into Recovery mode and the installer will launch automatically. You can Continue one with the installation from here. If you want to erase the drive first, quit the installer and run Disk Utility from the Recovery menu. You can then erase the drive, and then go back to the Recovery menu and install macOS Monterey.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/macos-monterey-installation.jpg?quality=50&amp;strip=all\" /></figure><p>Apple</p></div>\n\n\n\n<h2>If your Mac won’t boot from the installer</h2>\n\n\n\n<p>Macs with a T2 security chip (Intel Macs made since 2018) may not let you boot from the macOS Monterey installer. (Here’s a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT208862&amp;xcust=1-1-548920-1-0-0&amp;sref=https://www.macworld.com/feed\">list of Macs with T2</a>.) To fix this, there’s a setting in the Security Startup Utility that needs to be adjusted. Here’s how to do it.</p>\n\n\n\n<p>1. Boot into Recovery mode by pressing Command+R while you turn on the Mac.</p>\n\n\n\n<p>2. A list of users will appear. You need to select an account that you know the password for.</p>\n\n\n\n<p>3. When the Mac is done booting, select the <em>Utilities</em> menu, and then select <em>Startup Security Utility</em>.</p>\n\n\n\n<p>4. You may be asked to authenticate. Enter <em>macOS Password</em>, then choose an administrator account and enter the password.</p>\n\n\n\n<p>5. After the app launches, look for the External Boot section at the bottom of the window and select, “Allow booting from external media.”</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/macos-security-startup-utility.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>6. Quit the app and restart the Mac. You can try to boot from the installer drive as detailed in the instructions above.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3845dee437400674fe8af246232079a7cf48d1931910818fbbc7358dab8d07fb","category":"Apple"}