{"title":"AIS เปิดตัว LearnDi แพลตฟอร์ม EdTech รีสกิลคนทั่วไปและคนในองค์กร ในราคาเข้าถึงได้","link":"https://www.blognone.com/node/122015","date":1617359943000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>AIS เปิดตัว LearnDi แพลตฟอร์ม EdTech ซึ่งต่อยอดมาจาก AIS Academy แพลตฟอร์มเข้าถึงความรู้สำหรับคนในองค์กร โดยแยกออกมาเป็นแพลตฟอร์มเรียนทักษะใหม่ เปิดให้คนทั่วไปเข้าถึงได้ รวมหลักสูตร 250 หลักสูตร ในสาขาต่างๆ เช่น เทคโนโลยีพื้นฐาน เทคโนโลยีขั้นสูง ภาษา ไฟแนนซ์ มาร์เก็ตติ้ง เฮลท์แคร์ เป็นต้น</p>\n<p>AIS ร่วมมือกับ Invent, SEAC, Humanica, Conicle, NEO Academy by CMMU, Beyond Training, Doctor A to Z ในการจัดตั้ง LearnDi เป็นบริษัทแยก และเป็นความร่วมมือทั้งการพัฒนาระบบและแพลตฟอร์ม ด้านเนื้อหา และเป็นพาร์ทเนอร์ทางธุรกิจ โมเดลรายได้ของ LearnDi คือ ผู้เรียนจ่ายเงินเรียนประมาณ 2,000 บาท สามารถเข้าเรียนคอร์สต่างๆ ได้แบบบุฟเฟ่ต์ทั้งปี นอกจากนี้ยังมีธุรกิจแบบ B2B ที่ลูกค้าองค์กรณ์มาใช้แพลตฟอร์ม LearnDi เพื่อพัฒนาทักษะคนในองค์กรได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8d9df93a47beb710773acbdcf94796e8.jpg\" ></p>\n<p>ฟีเจอร์ของ LearnDi คือผู้เรียนสามารถทำแบบสอบถามเพื่อให้ระบบช่วยแนะนำคอร์สเรียนให้ เพื่อดูว่าผู้เรียนมีจุดแข็งและจุดอ่อนอย่างไร ในการทำแบบประเมินนี้ทาง AIS ได้ร่วมมือกับ คณะจิตวิทยา จุฬาลงกรณ์มหาวิทยาลัย นอกจากนี้ยังสามารถตั้งปฏิทินการเรียนของตัวเองได้, มีแดชบอร์ดสรุปผลการเรียนและมีแบดจ์ดิจิทัลหรือ E-Certificate เมื่อเรียนจบ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ae3379bf2367ae87b776117c51737da6.jpg\" ></p>\n<p>นางสาวกานติมา เลอเลิศยุติธรรม หัวหน้าคณะผู้บริหารทรัพยากรบุคคล กลุ่มบริษัท AIS ระบุว่า ที่ผ่านมาในองค์กร AIS มีโครงการสอนทักษะใหม่ๆ แก่คนในองค์กรอยู่แล้วในชื่อ AIS Academy เข้าถึงคนในองค์กร 13,000 คน เทรนด์การเรียนรู้ในปัจจุบัน มองว่าการที่องค์กรมาบอกว่าพนักงานต้องทำอะไร หรือต้องเรียนรู้อะไรใหม่เพิ่มจะหายไป แต่พนักงานจะไขว่คว้าหาความรู้เอง ซึ่ง EdTech จะช่วยสร้างความเข้มแข็งให้คนไทยในช่วงโควิด และดิสรัปชั่น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b63a047965a58cf47e34bad0decc10f4.jpg\" ></p>\n<p>สุนทร เด่นธรรม ประธานเจ้าหน้าที่บริหาร Humanica ผู้ให้บริการงานทรัพยากรบุคคล เล่าที่มาของการจับมือกับ AIS ว่า ปกติแล้วทางบริษัทเชี่ยวชาญเรื่องกฎหมาย ภาษี กฎแรงงาน ประกันสังคม สวัสดิการ และได้เริ่มเรื่องการพัฒนา Talent เป็นจุดเริ่มต้นของความร่วมมือกับ Conicle สตาร์ทอัพทำแพลตฟอร์มเลิร์นนิ่งสำหรับคนในองค์กร นำบริการของ Conicle เชื่อมเข้ากับ Humanica ล่าสุด หลังจากนั้นก็ได้มาร่วมมือกับ AIS เพื่อมาพัฒนาเป็นแพลตฟอร์ม LearnDi</p>\n<p>ที่มา - งานแถลงข่าว</p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/ais\">AIS</a></div><div class=\"field-item odd\"><a href=\"/topics/edtech\">EdTech</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"38482394d0d7f144f332b1a43f8c7ed40157f93f32e4ec228fad0ddd38396866","category":"Thai"}