{"title":"Apple Vision Pro ZEISS Lens Inserts to Start at $99","link":"https://www.macrumors.com/2024/01/08/vision-pro-lens-inserts-to-start-at-99/","date":1704724075000,"content":"In its <a href=\"https://www.macrumors.com/2024/01/08/apple-announces-february-2-vision-pro-launch/\">announcement</a> of the launch date for its Vision Pro headset earlier today, Apple revealed that the optional optical inserts will begin at $99.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/apple-vision-pro-lenses.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nBecause of the way the headset fits against the face, it does not accommodate glasses, but Apple has a solution for those who need reading or prescription lenses. Apple is partnering with ZEISS to offer optical inserts that can be customized to each person's vision requirements. \r<br />\n\r<br />\nApple will offer two versions of the ZEISS Optical Inserts at different price points. \"ZEISS Optical Inserts — Readers\" will be available for $99, while \"ZEISS Optical Inserts — Prescription\" will be available for $149. The inserts will attach to the Vision Pro lenses magnetically, allowing for precise viewing and eye tracking.\r<br />\n\r<br />\nGlasses wearers will need a valid prescription to get the inserts, and not all prescriptions will be supported, so there will be some limitations that might prevent some people from using the headset.\r<br />\n\r<br />\nThe inserts are the only optional purchase directly for the Vision Pro headset that Apple has announced so far. The <a href=\"https://www.macrumors.com/2024/01/08/vision-pro-ships-with-dual-loop-band/\">Vision Pro headset comes with</a> a Solo Knit Band, a Dual Loop Band, a Light Seal, two Light Seal Cushions, a cover for the front of the device, a polishing cloth, battery unit, USB-C charging cable, and USB-C power adapter. \r<br />\n\r<br />\nPre-orders of the Vision Pro start on Friday, January 19 and the device goes on sale in the United States on Friday, February 2.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/08/vision-pro-lens-inserts-to-start-at-99/\">Apple Vision Pro ZEISS Lens Inserts to Start at $99</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-zeiss-lens-inserts-to-start-at-99.2415758/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"385d0cdc83e818d7e5460000b42a77817edee21cde1c5cf2f4ac5d56ea02c5f1","category":"Apple"}