{"title":"Parametric Optimization of Inductor Design for Heating Metallic Materials","link":"https://www.preprints.org/manuscript/202410.1813/v1","date":1729752319000,"content":"This paper presents the experimental characterization and numerical optimization of the parametric design of inductors used for the induction heating process of metallic samples. Here, the variation of the geometric parameters of the inductor (the distance between the coil and the material, as well as the number of turns and separation between them), was analyzed. In addition, changes in the power input values of the heating system variables were also investigated; and finally, the heating time of the materials was taken into consideration. For the multi-objective numerical optimization process, a full factorial 2K experimental design was devised. Afterward, from preliminary experiments, a response surface was performed, from which the optimal candidates for the heating process were obtained. In the experiments, a methodology was designed for the acquisition and processing of heating data on ASTM E8 tensile test specimens. The main objective of this paper is to determine both the geometric parameters of the coil as well as the power input values of the circuit, which allow for generating uniform heating in the specimens. The objectives of the optimization process are to maximize the heating temperature minimizing the consumption of electrical current in the induction circuit. The data generated in the heating of the specimens were acquired using a Fluke® TI10 thermographic camera, while a BK Precision® regulated power supply was used for the induction circuit. The parameters obtained in the optimization process for the optimal candidates were corroborated through experimental tests. The paper shows the initial (non-optimal) and final (optimal) results obtained from the experimental tests. The heating station created with the optimal coil will be used for mechanical characterization tests on metallic materials at temperatures above room temperature.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"385e6f844fa55f54ae1ef83f93c43c1bd8645d3cf8927922914924491d8239fc","category":"Interdisciplinary"}