{"title":"Haven or hell? A perspective on the ecology of offshore oil and gas platforms","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000104","date":1713448800000,"content":"<p>by Irene S. Fortune, Alethea S. Madgett, Ann Scarborough Bull, Natalie Hicks, Milton S. Love, David M. Paterson</p>\r\n\r\nOffshore oil and gas platforms (OGP) have been installed worldwide and initially with limited consideration given to the nature of their positive or negative long-term interactions with the natural marine habitats. However, as OGP reach the end of their useful life, with many being decommissioned and removed, it is timely to review the growing evidence of the association of marine biota with OGP to provide a summary and synthesis for policy makers and to give insight to decisions in increasingly crowded marine spatial plans. In the last decade, there has been rapid increase in studies concerning the ecological role of OGP. This research reveals strong contextual difference between platforms in different geographical regions, but all OGP add to local biodiversity particularly where hard substrata are introduced to areas dominated by depositional (mud and sand) habitats. This includes the attraction and increased productivity of fish, sessile invertebrates, and algae while also affecting change in the benthic habitats beneath platforms. There also evidence of the OGP changing local hydrodynamics conditions with effects on phytoplankton and local scour. In terms of the biota associated with OGP, water depth is a major driver of community type across systems. This study emphasises that while knowledge of OGP communities and species has improved, there are still significant knowledge gaps that may prevent the most environmentally beneficial decisions being made around decommissioning. There are few studies following the effect of decommissioning (topping, toppling, or removal) on the ecology of the systems as they change with time (longitudinal research) for the decommissioning event. There is also a need for more studies comparing the biodiversity and functionality of OGP system to artificial and natural reefs and habitats to better understand the ecological cost-benefit of decommissioning scenarios. Finally, commercial data is often unavailable and even when available, surveys are often conducted using varied methodology that prevents comparative analysis. By imposing/agreeing standards and sharing data around the ecological cost-benefit of decommissioning strategies, improve policy guidance concerning OGP planning, and management might emerge.","author":"Irene S. Fortune","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"38603d31a2fb06140d3c4cf486e1b9c61e251dddb67497dfc6f7c86a9342c80e","category":"Environment"}