{"title":"469 Reducing crude protein levels with amino acid supplementation in the finishing diets of heavy Duroc sire line pigs: Effects on carcass and meat traits in males and females","link":"https://academic.oup.com/jas/article/102/Supplement_3/411/7757065?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Nutrition represents 70% of pig production costs, particularly protein; therefore, decreasing protein costs is of capital importance. Reducing crude protein (CP) contents to levels below recommended whilst supplementing with amino acids (AAs) is an interesting strategy to reduce costs without decreasing production performances. It has been conducted essentially in lean genotypes during the growth stage. Few studies address heavy genotypes or sex differences during the finishing period. Our objective is to study carcass and meat (loin) traits of heavy [Duroc X (Landrace X Large-White)] male and female pigs during the finishing stage under a 2% CP reduction with crystalline AA supplementation, hypothesizing that both sexes will be affected equally. In total, 60 males and 60 females, 9 wk old animals were used and allotted in split-sex pens (6 pigs/pen) with water and dry feed ad libitum. At 15 wk of age, when pigs weighed an average of 68 kg, two isoenergetic diets with different CP levels were provided (145 and 125 g CP/kg, control and low-CP) during the last 42 d of fattening. In the low-CP diet, crystalline AAs were added. On last day of the trial, animals weighed 116.5 kg on average and were slaughtered. Hot carcass weights and yields, ham fat thickness, lean meat percentage and boar taint by human nose scoring were determined. Loin samples (one per pen) were used to determine thawing losses, pH, color, Texture Profile Analysis (TPA: hardness, cohesiveness, springiness) and chemical composition (moisture, ash, protein, collagen, fat, and saturated fat). Data were analyzed using the simple least squares models that included dietary treatment and sex and their interaction as fixed effects with the pen as the experimental unit. Carcass weights were greater in control males than in females (91.2 vs 85.7 kg; <span>P</span> &lt; 0.05). No effect of sex or diet was detected on carcass yields, lean contents or ham subcutaneous fat thickness. There was a great impact of sex for loin subcutaneous fat thickness, with males having 7 to 8% greater values in both dietary treatments (<span>P</span> = 0.011). Low-CP females had a greater percentage of carcasses of greater lean content compared with the three other groups (<span>P</span> &lt; 0.05). Boar taint, carcass pH, color traits, chemical analysis and TPA did not differ across diets. A strong dietary influence was noticeable with animals of both sexes in the Low-CP diets having greater fat and saturated fat contents than animals in the control groups (<span>P</span> = 0.02). In conclusion, the 20g/kg CP reduction supplemented with AAs can efficiently be used in heavy Duroc sire line genotype during the finishing phase without leading to major impairments in carcass or meat traits, regardless of sex.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"386b00109748b2340cfaa897cf154213e35ec95401e1b345d96f4d58e47fe528","category":"Environment"}