{"title":"Exploring the Neuropsychiatric Impact of Corticosteroids: A Review of Mental Health Outcomes","link":"https://www.preprints.org/manuscript/202410.0291/v1","date":1728021883000,"content":"Corticosteroids are extensively used in medicine for their powerful anti-inflammatory and immunosuppressive effects. However, their psychiatric side effects—such as mood disturbances, anxiety, and psychosis—are significant yet often underappreciated. This review provides a comprehensive exploration of corticosteroid-induced psychiatric disorders, with a focus on their underlying mechanisms and clinical implications. We examine how corticosteroids influence the Hypothalamic-Pituitary-Adrenal (HPA) axis, leading to dysregulation of stress responses and alterations in neurotransmitter levels, particularly dopamine, serotonin, and glutamate. These changes are linked to structural abnormalities in key brain areas such as the hippocampus and amygdala, which are implicated in mood and anxiety disorders, psychosis, and conditions like post-traumatic stress disorder (PTSD) and eating disorders. This review highlights the need for healthcare providers to be vigilant in recognizing and managing corticosteroid-induced psychiatric symptoms, especially in vulnerable populations with pre-existing mental health conditions. The complex relationship between corticosteroid type, dose, duration, and mental health outcomes is explored, emphasizing the importance of personalized treatment approaches to mitigate psychiatric risks. Given the widespread use of corticosteroids, there is an urgent need for more focused research on their psychiatric side effects. This review underscores the importance of patient education and careful monitoring to ensure optimal therapeutic outcomes while minimizing mental health risks associated with corticosteroid therapy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3873f8979b52230704fd6e586be00838e121a1e4245162000a04dc3ff2673307","category":"Interdisciplinary"}