{"title":"10 things you didn’t know you could do with an Apple Watch","link":"https://www.macworld.com/article/1923515/apple-watch-hidden-features-photos-unlock-games-messages-battery.html","date":1688725800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When Apple unveiled its <a href=\"https://www.macworld.com/article/225426/apple-watch-review-beautiful-form-frustrating-function.html\">first-ever smartwatch</a> back in 2014, it’s fair to say that the world wasn’t exactly sure what it was for… and neither was Apple. In those early days, along with the fitness elements which would remain an enduring part of the product’s appeal, the company talked enthusiastically about sharing taps, sketches, and heartbeats with friends, which would not. It took time for users and third-party developers to teach Apple what they wanted from a smartwatch, and for the company to take that on board.</p>\n\n\n\n<p>Today, the Apple Watch is a mature and versatile product. It’s so versatile, indeed, that you may not be aware of some of its most useful capabilities. In this article, we’re going to catch you up.</p>\n\n\n\n<h2>Take better iPhone photos</h2>\n\n\n\n<p>This was a superb piece of lateral thinking. There have always been situations where it’s difficult or impossible to trigger a camera because it needs to be out of reach, or out of sight, of the person taking the picture: when you’re trying to photograph the ports around the back of your Mac, for example, or when setting up a formal group photo that everyone wants to be in. Timers used to be the main solution, but often resulted in a mad scramble to place the camera correctly and get back in time before the time ran out. But the Apple Watch offers something better.</p>\n\n\n\n<p>Open the Camera Remote app on your watch, and it will simultaneously open the Camera app on the paired iPhone. Whatever the iPhone’s camera can see, you can now see on your watch; you can switch between the front and rear cameras (and toggle some other settings) using the options button at the bottom right. Once you’re happy, hit the three-second timer button, look up and smile, and enjoy your perfect photo.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Camera-Remote-Apple-Watch.jpg?quality=50&amp;strip=all\" alt=\"Camera Remote on the Apple Watch\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Camera-Remote-Apple-Watch.jpg?quality=50&amp;strip=all 792w, https://b2c-contenthub.com/wp-content/uploads/2023/05/Camera-Remote-Apple-Watch.jpg?resize=300%2C183&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/Camera-Remote-Apple-Watch.jpg?resize=768%2C469&amp;quality=50&amp;strip=all 768w\" width=\"792\" height=\"484\" /><figcaption>You can turn off the three-second timer using the options menu on the right, but it gives you time to compose yourself.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Unlock other Apple devices</h2>\n\n\n\n<p>An Apple Watch, once you’ve unlocked it with a single passcode input, remains unlocked as long as it stays on your wrist. It can thus act as a handy digital key that’s on you at all times, unlocking your Mac and iPhone by proximity alone.</p>\n\n\n\n<p>On iPhone, open the Settings app and go to<em> Face ID &amp; Passcode</em> (or <em>Touch ID &amp; Passcode</em> on older devices), then scroll down and tap the toggle under <em>Unlock With Apple Watch</em>. On Mac, open System Settings and go to <em>Touch ID &amp; Password</em> and click the toggle next to your Apple Watch.</p>\n\n\n\n<h2>Play games</h2>\n\n\n\n<p>As small as the Apple Watch’s screen may be, it can still support some fun games; they just need to be designed with that limitation in mind. You need to be selective. We’d recommend <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/app/deep-golf/id1550448393&amp;xcust=1-1-1923515-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Deep Golf</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/app/lifeline/id982354972&amp;xcust=1-1-1923515-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Lifeline</a>, both of which make perfect sense in this format, but there are some more excellent suggestions <a href=\"https://www.macworld.com/article/225459/the-first-10-apple-watch-games-you-should-play.html\">here</a>.</p>\n\n\n\n<h2>Talk to ChatGPT</h2>\n\n\n\n<p>You probably have your own thoughts on the ethics of AI, but it’s hard to deny that ChatGPT is fun to play with. Thanks to the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/app/petey-ai-assistant/id6446047813&amp;xcust=1-1-1923515-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Petey app</a>, you can now have those conversations on Apple Watch. Tap the ‘Ask me Anything’ button then type in a query (or better still, use the dictation button and save your tapping finger) and you’ll soon hear what our future AI overlord thinks of the matter. There’s even a complication, which means Petey is never more than a tap away.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Petey-Apple-Watch-app.jpg?quality=50&amp;strip=all\" alt=\"Petey Apple Watch app\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Petey-Apple-Watch-app.jpg?quality=50&amp;strip=all 792w, https://b2c-contenthub.com/wp-content/uploads/2023/05/Petey-Apple-Watch-app.jpg?resize=300%2C183&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/Petey-Apple-Watch-app.jpg?resize=768%2C469&amp;quality=50&amp;strip=all 768w\" width=\"792\" height=\"484\" /><figcaption>Petey can handle life’s most serious questions.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Control navigation with air gestures</h2>\n\n\n\n<p>The standard control method for Apple Watch involves having the device on one wrist, and then tapping the screen and pressing and rotating the buttons and dials with the other hand. But there are situations where you need to control the watch with the same hand it’s on. And this is possible, thanks to AssistiveTouch, one of Apple’s handy accessibility features.</p>\n\n\n\n<p>Open the Watch app on the paired iPhone. (Alternatively, you can set the feature up in the Apple Watch’s own Settings app, but I found this fiddly.) In the My Watch tab, select <em>Accessibility</em>, then scroll down until you see <em>AssistiveTouch</em>. Tap this, then tap the toggle at the top of the next screen to turn it on.</p>\n\n\n\n<p>By default, doing a pinch gesture with the watch-bearing hand will take you forwards in menus, while double-pinching (pinching twice, rather than pinching once with two fingers) will take you back; clenching your fist will act as a tap, while double-clenching will open a menu of actions, which takes a little getting used to. In fact, the whole thing has a learning curve, but practice makes perfect, and you can change the actions tied to each gesture.</p>\n\n\n\n<h2>Tell the time without looking</h2>\n\n\n\n<p>If for whatever reason you are unable to look at your Apple Watch but you’d still like to know the time, Speak Time is the lesser-known feature for you. To set it up, open the Settings app on the watch and go to Clock, scroll down until you see Speak Time, then tap to turn it on. (Again, this can also be done in the Watch app on a paired iPhone; again, go to Clock then hit Speak Time.) Now you need only hold two fingers on the watch face for a second or so and it will tell you the time out loud.</p>\n\n\n\n<p>Conversely, if you’d like to know the time silently without looking at the screen, consider Taptic Time. (You can turn this on in the Watch app by going to <em>Clock</em> &gt; <em>Taptic Time</em>, or following a similar route in the Apple Watch’s Settings app.) There are various options but I find the Digits format easiest: this would for example give one long tap, followed by four short taps, followed by three long taps, followed by six short taps, to give you the time 14:36.</p>\n\n\n\n<h2>Quickly reply to messages</h2>\n\n\n\n<p>The Apple Watch probably doesn’t seem like the optimal device for writing out messages, but watchOS has been cleverly designed to help. Tap a notification of an incoming message (or open the Messages app on your Apple Watch and tap a message there) and you’ll see the option to reply. This is easier than it sounds.</p>\n\n\n\n<p>The easiest method is to select one of the pre-written replies, such as yes, no, and “Can I call you later?” One tap and the canned reply is winging its way to the recipient: easy. And if these replies seem too limited, write some of your own by opening the Watch app on your paired iPhone and going to Messages &gt; Default Replies.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Watch-message-reply.jpg?quality=50&amp;strip=all\" alt=\"Reply to messages on Apple Watch\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Watch-message-reply.jpg?quality=50&amp;strip=all 792w, https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Watch-message-reply.jpg?resize=300%2C183&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Watch-message-reply.jpg?resize=768%2C469&amp;quality=50&amp;strip=all 768w\" width=\"792\" height=\"484\" /><figcaption>By default the Messages app offers context-sensitive Smart Replies, but you can turn this off in the settings.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>If you’d rather be spontaneous, you can type out a reply on your wrist in the onscreen keyboard, but we’d recommend that you instead swipe up and select the Scribble keyboard instead: this has you scrawl a letter at a time using the entire screen, which is much easier than hitting tiny keys. Or best of all, tap the dictation button and speak your thoughts out loud.</p>\n\n\n\n<h2>Make your battery last much longer</h2>\n\n\n\n<p>Hardly anyone seems to know that the Apple Watch now has a Low Power mode–perhaps because it already had a Power Reserve mode, which was far more drastic and made the watch basically unusable. But Low Power, finally <a href=\"https://www.macworld.com/article/782575/watchos9-features-release-how-to-install.html\">added in watchOS 9</a> in 2022, is much closer to the equivalent iPhone feature, simply cutting back on features and settings to eke out a little more battery life.</p>\n\n\n\n<p>To turn on Low Power mode, open Control Center by swiping up from the clock face, then tap the battery percentage. Just below the Battery Remaining figure, you’ll see a toggle labeled Low Power Mode. (Note that in <a href=\"https://www.macworld.com/article/1792869/watchos-10-release-date-new-features.html\">watchOS 10</a>, Control Center is instead accessed by pressing the side button.)</p>\n\n\n\n<h2>Preserve your privacy</h2>\n\n\n\n<p>The always-on screen offered on the Series 5 onwards has many good qualities, but you might be worried that it means personal data may be visible to other people. Fortunately, you can adjust the settings so that sensitive complications and notifications only appear when your wrist is raised.</p>\n\n\n\n<p>Let’s start with complications, which could display personal data such as calendar appointments or health information. Open the Watch app on your paired iPhone. From the My Watch tab, go to Display &amp; Brightness &gt; Always On &gt; Show Complications Data. From here you can pick and choose which complications are allowed to display their data when the always-on screen is in dimmed mode.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Watch-Complication-Data-always-on-display.jpg?quality=50&amp;strip=all\" alt=\"Apple Watch Show Complication Data menu\" width=\"416\" height=\"900\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Watch-Complication-Data-always-on-display.jpg?quality=50&amp;strip=all 554w, https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Watch-Complication-Data-always-on-display.jpg?resize=139%2C300&amp;quality=50&amp;strip=all 139w\" /><figcaption>Think carefully about information that could be embarrassing if seen publicly.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Similarly, if you go to Display &amp; Brightness &gt; Always On &gt; Show Notifications you can fine-tune the notifications which appear in dimmed mode, and which are only allowed to reveal their information when you’ve raised your wrist.</p>\n\n\n\n<h2>Get discreet directions</h2>\n\n\n\n<p>When you’re lost in a new city, the last thing you want to do is advertise the fact that you’re a tourist (or indeed the fact that you’ve got an expensive smartwatch on your wrist and an expensive smartphone in your pocket). For this reason, it’s desirable to have Maps advise you of turnings in a way that’s discreet and doesn’t require that you look at the screen of your Apple Watch or iPhone.</p>\n\n\n\n<p>While you’re still somewhere safe, open Maps on your iPhone and select a destination and the type of directions you want. Start the journey, and make sure you turn off the sound alerts by tapping the mute/unmute button on the right-hand side. Tuck the iPhone away in a pocket.</p>\n\n\n\n<p>Now, as you walk along, the Apple Watch will alert you to left turns by giving you three sets of two short buzzes and signal right turns with a rapid and even series of 10 to 12 haptic taps. (You don’t need to count them, it’s the rhythm that gives it away.) When you reach your destination you get a long vibration.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"387bf6e6a07b4c17546edfafb2210239e581da19009379f24802b9dda39c0b55","category":"Apple"}