{"title":"Scientists 3D print a robotic hand with human-like bones and tendons","link":"https://arstechnica.com/?p=1984959","date":1700312400000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/image-2-800x400.jpeg\" alt=\"Image of a robotic hand made from light colored plastics grasping both a pen and a bottle in separate images.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/image-2-scaled.jpeg\">Enlarge</a> <span>/</span> The 3D-printed hand made via the new method. (credit: <a href=\"https://ethz.ch/en/news-and-events/eth-news/news/2023/11/printed-robots-with-bones-ligaments-and-tendons.html\">ETH Zurich/Thomas Buchner</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Have you ever wondered why robots are unable to walk and move their bodies as fluidly as we do? Some <a href=\"https://arstechnica.com/gadgets/2023/01/boston-dynamics-atlas-robot-grows-a-set-of-hands-attempts-construction-work/\">robots can run, jump, or dance</a> with greater efficiency than humans, but their body movements also seem mechanical. The reason for this lies in the bones they lack.</p>\n<p>Unlike humans and animals, robots do not have real bones or the flexible tissues that connect them; they have artificial links and joints made of materials like carbon fiber and metal tubes. According to Robert Katzschmann, a professor of robotics at ETH Zurich, these internal structures allow a robot to make movements, grab objects, and maintain different postures. However, since links and joints are made up of hard materials, robot bodies are not as flexible, agile, and soft as human bodies. This is what makes their body movements so stiff.</p>\n<p>But they may not need to stay stiff for long. A team of researchers from the Swiss Federal Institute of Technology (ETH) Zurich and US-based startup Inkbit have figured out a way to 3D print the world’s first robotic hand with an internal structure composed of human-like bones, ligaments, and tendons. What makes the hand even more special is that it was printed using an entirely new 3D inkjet deposition method called vision-controlled jetting (VCJ).</p></div><p><a href=\"https://arstechnica.com/?p=1984959#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1984959&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3880b7df57cfe4f29abad4a245150fc3c13c1b631c3b41511ca9a8919bc3f938","category":"Tech"}