{"title":"The Bay Crits are set to return in January 2022","link":"https://cyclingtips.com/2021/12/the-bay-crits-are-set-to-return-in-january-2022/","date":1639448100000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/IMG_6734-650x381.jpeg\" /></div><h2>The Bay Crits are set to return in January 2022</h2><p>\n</p><p>After a one-year hiatus due to <a href=\"https://cyclingtips.com/2020/12/bay-crits-cancelled-for-2021/\" target=\"_blank\">COVID-related travel restrictions</a>, the Lexus of Blackburn Bay Crits are set to return in January 2022.</p>\n\n\n\n<p>Normally a three- or four-day event, the 2022 Bay Crits will comprise two days of racing –  Saturday January 8 and Sunday January 9 – with both due to be held in Geelong’s Eastern Gardens.</p>\n\n\n\n<p>Both days will take place on the same course, with Saturday’s races following the course in a clockwise direction, and Sunday’s heading counterclockwise.</p>\n\n\n\n<div>\n<div>\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Eastern-Gardens-Clockwise.png\" /></figure>\n</div>\n\n\n\n<div>\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Eastern-Gardens-Anticlockwise.png\" /></figure>\n</div>\n</div>\n\n\n\n<p>“It will be a great race and both courses offer different challenges,” said race director John Trevorrow. “That hill [in the clockwise direction] is a ripper.</p>\n\n\n\n<p>“It’s just wonderful to be able to get the event back in front of the people after the crazy and challenging two years we have all had to endure with COVID.”</p>\n\n\n\n<p>Despite not being a UCI-classified event, the Bay Crits has long attracted many of Australia’s best riders, and indeed many top international riders. Past winners include Caleb Ewan, Robbie McEwen, and Chloe Hosking.</p>\n\n\n\n<p>Aussie stars Grace Brown (BikeExchange) and Luke Plapp (Ineos Grenadiers) will headline the 2022 edition, but it’s not clear what the field will look like come January. </p>\n\n\n\n<p>Australian travel restrictions have eased in the 12 months since the cancelled 2021 Bay Crits, but international travel to and from Australia still isn’t without its difficulties. It remains to be seen whether the 2022 Bay Crits will feature many (or any) international riders.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/©AvellinoM-baycrits-9-1340x894.jpg\" /><figcaption>Brown and Plapp at the launch of the 2022 Bay Crits in Geelong on Tuesday.</figcaption></figure>\n\n\n\n<p>The return of the Bay Crits is welcome news for an Australian summer of racing gutted by COVID in the past couple years. The 2022 editions of the Santos Tour Down Under, Cadel Evans Great Ocean Road Race, Race Torquay, and Jayco Herald Sun Tour have all been scuppered by COVID, just as they were in 2021. </p>\n\n\n\n<p>The 2022 Australian summer of cycling calendar now includes the Bay Crits (January 8-9), the Australian Road Nationals (January 12-16) and the Santos Festival of Cycling (January 23-29) – a domestic-level replacement for the Tour Down Under, now in its second year.</p>\n\n\n\n<p>Bay Crits organisers are hopeful that, following 2022’s slimmed-down return, the event will “be back in full in 2023”.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/the-bay-crits-are-set-to-return-in-january-2022/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"388066fcd635ab72bbc97ff89792b588d14cd4a66269204e19e5b717f1b329f7","category":"Cycling"}