{"title":"Effects of multi‐walled carbon nanotubes and halloysite nanotubes on plasma lipid profiles and autophagic lipolysis pathways in mouse aortas and hearts","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24352?af=R","date":1718023804000,"content":"<h2>Abstract</h2>\n<p>Multi-walled carbon nanotubes (MWCNTs) and halloysite nanotubes (HNTs) are widely used tubular-structured nanomaterials (NMs), but their cardiovascular effects are not clear. This study compared the effects of MWCNTs and HNTs on lipid profiles in mouse plasma and gene expression profiles in aortas and hearts. Mice were intravenously injected with 50 μg NMs, once a day, for 5 days. Then, the plasma was collected for lipidomics analysis, and aortas and hearts were collected for RNA-sequencing analysis. While MWCNTs or HNTs did not induce obvious pathological changes in aortas or hearts, the lipid profiles in mouse plasma were altered. Further analysis revealed that MWCNTs more effectively upregulated sphingolipids and sterol lipids, whereas HNTs more effectively upregulated glycerophospholipids and fatty acyls. Consistently, RNA-sequencing data indicated that MWCNTs and HNTs altered signaling pathways related with lipid synthesis and metabolism, as well as those related with endoplasmic reticulum, lysosomes and autophagy, more significantly in aortas than in hearts. We further verified the changes of proteins involved in autophagic lipolysis, that MWCNTs were more effectively to suppress the autophagic biomarker LC3, whereas HNTs were more effectively to affect lipid metabolism proteins. These results may provide novel understanding about the influences of MWCNTs and HNTs on lipid profiles and lipid signaling pathways in cardiovascular systems. Importantly, previous studies considered HNTs as biocompatible materials, but the results from this study suggested that both MWCNTs and HNTs were capable to affect lipid profiles and autophagic lipolysis pathways in cardiovascular systems, although their exact influences were different.</p>","author":"Yujia Cheng, \nYimin Zhang, \nCanyang Wang, \nWeichao Zhao, \nChaobo Huang, \nZelin Zhang, \nLiping Sheng, \nFengmei Song, \nYi Cao","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"3881aa22fd9bea9ce9d1c19a626ac3d12746c88359dae829b3141e4de3a18607","category":"Environment"}