{"title":"The distribution and habitat characterization of the East Asian finless porpoise (Neophocaena asiaeorientalis sunameri) in coastal waters off Qingdao, China: Implications for management and conservation","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4202?af=R","date":1720079123000,"content":"<h2>Abstract</h2>\n<p>\nThe East Asian finless porpoise (<i>Neophocaena asiaeorientalis sunameri</i>) distributes in coastal waters across the western Pacific Ocean, ranging from the Taiwan Strait to northern China, Korea and Japan. Limited baseline data are available for this threatened species, including the coastal region of Qingdao, China, hindering the implementation of conservation management.\nThe Oceanographic characteristics were derived from on-board measurements and satellite remote sensing, including depth, slope, sea surface temperature (SST), salinity and chlorophyll a (Chla) concentration. Kernel density estimation (KDE) was utilized to determine the extent of occurrence and core distribution of East Asian finless porpoises.\nThe surveys covered an area of 4532 km<sup>2</sup>, encompassing 7314 km of transect lines. The 95% KDE and 50% KDE for East Asian finless porpoises within the study site included 1987 and 297 km<sup>2</sup>, respectively. The 50% KDE revealed Laoshan Bay as the core distribution zone. Significant relationships were identified between distribution probability and three oceanographic variables: salinity, Chla concentration and distance to shore.\nIn this study, the Aoshan Bay Marine Park, which was designed with no prior knowledge of East Asian finless porpoise, shows partial overlap with the core distribution for this species. This demonstrates that MPAs (marine protected areas) that are not explicitly designated for marine mammals may not comprehensively address all their specific requirements, but the existence and conservation endeavours associated with the MPAs can still yield substantial positive outcomes for these species. 5. This study provides the inaugural comprehensive baseline data on the population distribution and habitat characteristics of the East Asian finless porpoise. It underscores the necessity for a robust data collection protocol spanning China, Japan and Korea to address the critical shortfall in baseline data and enhance conservation efforts.\n</p>","author":"Yongtao Li, \nZhaolong Cheng, \nTao Zuo, \nMingxiang Niu, \nRuisheng Chen, \nJun Wang","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"388aee8840f64036c419a13c46f9553385ce57aa55249c3e64590feb3a7b9f94","category":"Environment"}