{"title":"Too much focus on your health might be bad for your health: Reddit user’s communication style predicts their Long COVID likelihood","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308340","date":1722952800000,"content":"<p>by Ludovica Segneri, Nandor Babina, Teresa Hammerschmidt, Andrea Fronzetti Colladon, Peter A. Gloor</p>\r\n\r\nLong Covid is a chronic disease that affects more than 65 million people worldwide, characterized by a wide range of persistent symptoms following a Covid-19 infection. Previous studies have investigated potential risk factors contributing to elevated vulnerability to Long Covid. However, research on the social traits associated with affected patients is scarce. This study introduces an innovative methodological approach that allows us to extract valuable insights directly from patients’ voices. By analyzing written texts shared on social media platforms, we aim to collect information on the psychological aspects of people who report experiencing Long Covid. In particular, we collect texts of patients they wrote BEFORE they were afflicted with Long Covid. We examined the differences in communication style, sentiment, language complexity, and psychological factors of natural language use among the profiles of 6.107 Reddit users, distinguishing between those who claim they have never contracted Covid -19, those who claim to have had it, and those who claim to have experienced Long Covid symptoms. Our findings reveal that people in the Long Covid group frequently discussed health-related topics before the pandemic, indicating a greater focus on health-related concerns. Furthermore, they exhibited a more limited network of connections, lower linguistic complexity, and a greater propensity to employ emotionally charged expressions than the other groups. Using social media data, we can provide a unique opportunity to explore potential risk factors associated with Long Covid, starting from the patient’s perspective.","author":"Ludovica Segneri","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"388a20aaa3d18e5238bd4f2c63f71b380a296ceff0eb9e4cb4d7dba10da63a35","category":"Interdisciplinary"}