{"title":"Former British Cycling Doctor Richard Freeman Issued 4 Year Ban for Anti-Doping Violations","link":"https://bikerumor.com/former-british-cycling-doctor-richard-freeman-issued-4-year-ban-for-anti-doping-violations/","date":1692110334000,"content":"<p><img width=\"1600\" height=\"1066\" src=\"https://bikerumor.com/wp-content/uploads/2023/08/uk-anti-doping-ban-richard-freeman-from-sport-4-years-rule-violations.jpg\" alt=\"ukad ban richard freeman from sport 4 years anti-doping rule violations\" srcset=\"https://bikerumor.com/wp-content/uploads/2023/08/uk-anti-doping-ban-richard-freeman-from-sport-4-years-rule-violations.jpg 1600w, https://bikerumor.com/wp-content/uploads/2023/08/uk-anti-doping-ban-richard-freeman-from-sport-4-years-rule-violations-297x198.jpg 297w, https://bikerumor.com/wp-content/uploads/2023/08/uk-anti-doping-ban-richard-freeman-from-sport-4-years-rule-violations-800x533.jpg 800w, https://bikerumor.com/wp-content/uploads/2023/08/uk-anti-doping-ban-richard-freeman-from-sport-4-years-rule-violations-120x80.jpg 120w, https://bikerumor.com/wp-content/uploads/2023/08/uk-anti-doping-ban-richard-freeman-from-sport-4-years-rule-violations-768x512.jpg 768w, https://bikerumor.com/wp-content/uploads/2023/08/uk-anti-doping-ban-richard-freeman-from-sport-4-years-rule-violations-1536x1023.jpg 1536w, https://bikerumor.com/wp-content/uploads/2023/08/uk-anti-doping-ban-richard-freeman-from-sport-4-years-rule-violations-720x480.jpg 720w\" /></p>\n<p>UK Anti-Doping (UKAD), an executive non-departmental public body sponsored by the Department for Culture, Media, and Sport, has <a href=\"https://www.ukad.org.uk/news/former-british-cycling-and-team-sky-doctor-richard-freeman-receives-ban-sport-anti-doping-rule\" target=\"_blank\">today confirmed</a> that former British Cycling and Team Sky doctor Richard Freeman has been banned from all sport for four years. The ban comes after the independent National Anti-Doping Panel found he committed the Anti-Doping Rule Violations of ‘Possession of a Prohibited Substance’ and (on two distinct occasions) ‘Tampering’.</p>\n\n\n\n<p>Freeman was British Cycling’s doctor during the 2012 London Olympic Games and the 2016 Rio de Janeiro Olympic Games. As reported by the <a href=\"https://www.bbc.co.uk/sport/cycling/56459664\" target=\"_blank\">BBC</a>, he was struck off the medical register in 2021 when he was found guilty of ordering the <a href=\"https://www.ukad.org.uk/athletes/whats-banned-sport-prohibited-list\" target=\"_blank\">banned anabolic steroid, testosterone</a>.</p>\n\n\n\n<p>In addition to the General Medical Council considering him no longer fit to practice, UK Anti-Doping has now banned him from all sport for four years, backdated to the 22nd December, 2020. You can <a href=\"https://www.ukad.org.uk/news/former-british-cycling-and-team-sky-doctor-richard-freeman-receives-ban-sport-anti-doping-rule\" target=\"_blank\">read more about Freeman’s wrongdoing on the UKAD website</a>, including Freeman’s defense that the package containing the banned substance was for a ‘non-rider’ member of the British Cycling staff.</p>\n\n\n\n<p>British Cycling has today issued a statement distancing itself from Richard Freeman and his Anti-Doping Rule Violations.</p>\n\n\n\n<p><strong><em>Press Release from British Cycling</em></strong></p>\n\n\n\n<p>Following today’s announcement by UK Anti-Doping regarding the case of Richard Freeman, British Cycling Chair Frank Slevin has issued the following statement.</p>\n\n\n\n<p><em>“We note today’s verdict from the National Anti-Doping Panel and thank them for the time and consideration put into reaching their decision.</em></p>\n\n\n\n<p><em>Throughout this case we have reiterated our belief that it is in public interest and best interests of our sport that all matters are heard and thoroughly examined by the relevant authorities. As such, we have made every effort to support both UK Anti-Doping and the General Medical Council in their respective investigations, and will continue to do so on any matters arising in the future.</em></p>\n\n\n\n<p><em>We have stated previously that Richard Freeman’s conduct during his employment by British Cycling bore no resemblance to the high ethical and professional standards which we, our members and our partners rightly expect.</em></p>\n\n\n\n<p><em>We also acknowledge that many will be understandably frustrated, as we are ourselves, that some matters arising from this case and others remain uncertain. We once again want to take this opportunity to urge individuals with relevant information to share that with UK Anti-Doping.</em></p>\n\n\n\n<p><em>In the years since Freeman was suspended from his employment by British Cycling, we have made great progress in strengthening our provision of medical services to riders competing for the Great Britain Cycling Team. Being granted Care Quality Commission status in October 2020 – making us one of the first professional sport medical facilities to achieve the status – is testament to the progress we have made.</em></p>\n\n\n\n<p><em>Ensuring that British Cycling remains at the forefront of our sector in this area will continue to be a key priority for us, and under the leadership of our Chief Medical Officer, Dr Nigel Jones, I am incredibly proud of the support we are providing both to our funded riders and wider sport.”</em></p>\n\n\n\n<p><em><a href=\"https://www.ukad.org.uk/\" target=\"_blank\">ukad.org.uk</a></em></p>\n<p>The post <a href=\"https://bikerumor.com/former-british-cycling-doctor-richard-freeman-issued-4-year-ban-for-anti-doping-violations/\">Former British Cycling Doctor Richard Freeman Issued 4 Year Ban for Anti-Doping Violations</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Jessie-May Morgan","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"3895f51acee46391e1104631bd714292c9b4c8d9cbef02adc7b86b59f33f7d74","category":"Cycling"}