{"title":"WhatsApp, Other Messaging Apps Sign Open Letter Urging UK Government to Rethink 'Surveillance' Bill","link":"https://www.macrumors.com/2023/04/18/whatsapp-signal-open-letter-uk-government/","date":1681815211000,"content":"WhatsApp, Signal, and other messaging services have <a href=\"https://blog.whatsapp.com/an-open-letter\">penned an open letter</a> to the British government appealing for it to urgently rethink the Online Safety Bill (OSB), a piece of legislation that would allow regulators to ask the platforms to monitor users in order to identify child abuse images.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/03/Whatsapp-Feature.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nUnder the bill, the government could force chat services to apply content moderation policies such as client-side scanning that are impossible to implement without circumventing end-to-end encryption, which ensures that only the user and the person they are communicating with can read or listen to what is sent. \r<br />\n<blockquote>\"Around the world, businesses, individuals and governments face persistent threats from online fraud, scams and data theft,\" reads the letter. \"Malicious actors and hostile states routinely challenge the security of our critical infrastructure. End-to-end encryption is one of the strongest possible defenses against these threats, and as vital institutions become ever more dependent on internet technologies to conduct core operations, the stakes have never been higher.\r<br />\n\r<br />\nAs currently drafted, the Bill could break end-to-end encryption, opening the door to routine, general and indiscriminate surveillance of personal messages of friends, family members, employees, executives, journalists, human rights activists and even politicians themselves, which would fundamentally undermine everyone's ability to communicate securely.\r<br />\n\r<br />\nThe Bill provides no explicit protection for encryption, and if implemented as written, could empower OFCOM to try to force the proactive scanning of private messages on end-to-end encrypted communication services - nullifying the purpose of end-to-end encryption as a result and compromising the privacy of all users.\r<br />\n\r<br />\nIn short, the Bill poses an unprecedented threat to the privacy, safety and security of every U.K. citizen and the people with whom they communicate around the world, while emboldening hostile governments who may seek to draft copy-cat laws.</blockquote>The open letter is signed by Element chief executive Matthew Hodgson, Oxen Privacy Tech Foundation and Session director Alex Linton, Signal president Meredith Whittaker, Threema chief executive Martin Blatter, Viber chief executive Ofir Eyal, head of WhatsApp Will Cathcart, and Wire chief technical officer Alan Duric.\r<br />\n\r<br />\nLast year, Apple <a href=\"https://www.macrumors.com/2022/12/07/apple-abandons-icloud-csam-detection/\">abandoned similar controversial plans</a> to detect known Child Sexual Abuse Material (CSAM) stored in <a href=\"https://www.macrumors.com/guide/icloud-photo-library/\">iCloud Photos</a>. Apple planned to report <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> accounts with known CSAM image hashes to the National Center for Missing and Exploited Children (NCMEC), a non-profit organization that works in collaboration with U.S. law enforcement agencies.\r<br />\n\r<br />\nThe plans were criticized by a wide range of individuals and organizations, and Apple ultimately dropped the proposal. \"Children can be protected without companies combing through personal data,\" said Apple at the time. \"We will continue working with governments, child advocates, and other companies to help protect young people, preserve their right to privacy, and make the internet a safer place for children and for us all.\r<br />\n\r<br />\nUnder the U.K. bill, if a messaging service refused to apply the content moderation policies, it could face fines of up to 4 percent of its annual turnover. WhatsApp, Signal, and Proton have already stated that they would halt their encrypted services in the U.K. and pull out of the market if the bill required them to scan user content.\r<br />\n\r<br />\nThe U.K. government's <a href=\"https://bills.parliament.uk/bills/3137\">Online Safety Bill</a> is expected to return to parliament this summer.<div>Tags: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a>, <a href=\"https://www.macrumors.com/guide/united-kingdom/\">United Kingdom</a>, <a href=\"https://www.macrumors.com/guide/encryption/\">Encryption</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/18/whatsapp-signal-open-letter-uk-government/\">WhatsApp, Other Messaging Apps Sign Open Letter Urging UK Government to Rethink 'Surveillance' Bill</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whatsapp-other-messaging-apps-sign-open-letter-urging-uk-government-to-rethink-surveillance-bill.2387105/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"38a085a0c3a81144bf790ae26cc118678468588cab74a568f681485e7998a117","category":"Apple"}