{"title":"Framing uncertainty in water policy discourse: insights from Arizona’s Project ADD Water","link":"http://link.springer.com/10.1007/s13412-023-00868-z","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Water resource managers contend with and leverage uncertainty in complex decision-making processes. Uncertainty has passive characteristics (context and type), but it is also actively deployed and leveraged by stakeholders via framing and discourse. These passive and active elements of uncertainty interact with each other to shape discourse, which has direct consequences for policy, especially when uncertainty is invoked to delay action in addressing pressing environmental challenges. We explore the interactions of active and passive elements of uncertainty management in a water management decision-making process in the water-limited US state of Arizona. Project ADD Water was intended to engage stakeholders in dialogue about securing water resources under existing state water management policy. Understanding how uncertainty influenced Project ADD Water has only become more important as water management under prolonged drought becomes increasingly complex in Arizona and other similar sites. In the Project ADD Water deliberations, we found examples of both disruptive and productive efforts to frame different types of uncertainty, and we use illustrative examples to explore their relevance to the policy-making process. In addition to our analysis of how stakeholders engage with uncertainty through this process, we also contribute a codebook for holistically examining uncertainty in natural resource decision-making processes beyond ADD Water and materials to structure workshops with stakeholders centered on exploring uncertainty. Our contributions strengthen our understanding of how stakeholders deploy uncertainty in decision-making processes and offer a pathway to facilitate discussions about uncertainty with stakeholders.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"38a2379223a62cc5e65fb9b2814cac8bd4503a66ac9462957dd7bece4ee5b261","category":"Environment"}