{"title":"Near-Surface Dispersion and Current Observations by Dye, Drifter, and HF Radar in Coastal Water","link":"https://www.preprints.org/manuscript/202404.0642/v1","date":1712656273000,"content":"This study explores the near-surface dispersion mechanisms of contaminants in coastal waters, leveraging a comprehensive method that includes using dye and drifters as tracers, coupled with diverse observational platforms like drones, satellites, in-situ sampling, and HF radar. The aim is to deepen our understanding of surface currents' impact on contaminant dispersion, thereby improving predictive models for environmental incident management, including pollutant releases. Rhodamine WT dye, chosen for its significant fluorescent properties and detectability, along with drifter data, allowed us to investigate the dynamics of near-surface physical phenomena such as the Ekman current, Stokes drift, and wind-driven currents. Our research emphasizes the importance of integrating scalar tracers and Lagrangian markers in experimental designs, revealing differential dispersion behaviors due to near-surface vertical shear caused by the Ekman current and Stokes drift. The elongation direction of the dye patch aligns with the Ekman current direction during slow current conditions. Analytical calculations of vertical shear, based on the Ekman current and Stokes drift, closely matched those derived from tracer observations. Over a 7-hour experiment, the vertical diffusivity of near-surface water was observed at 2×10-4 m2/s, and the horizontal eddy diffusivity of the dye patch and drifters reached the order of 1 m2/s and at a 1000m length scale. Particle tracking models demonstrate that while HF radar currents can effectively predict the trajectories of tracers near the surface, incorporating near-surface currents, including Ekman current, Stokes drift, and windage, is essential for a more accurate prediction of the fate of surface floats.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"38a337b4fe2f8f877befafbd34db021fbe340ebfd177b98ae357d44b85e5a8f4","category":"Interdisciplinary"}