{"title":"197 Hepatic mRNA expression of innate and adaptive immune genes in beef steers with divergent residual body weight gain","link":"https://academic.oup.com/jas/article/102/Supplement_3/343/7757071?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Immune function has a pivotal role in dictating the overall health and productivity of cattle. In a proficient immune system, the liver assumes an integral function in detoxification and metabolic processes and contributes substantially to overall production and immunity. In this study, we evaluated the hepatic mRNA expression of genes involved in innate and adaptive immunity in crossbred beef steers with positive or negative residual body weight (BW) gain (RADG). Positive-RADG beef steers (n = 8; RADG = 0.76 kg/d) and negative-RADG beef steers (n = 8; RADG = -0.64 kg/d) were identified from a group of 108 growing crossbred beef steers (average BW = 286 ± 380kg) after a 56-d performance testing period. At the end of the 56-d period, liver tissue samples were collected from the beef steers for RNA extraction and cDNA synthesis. The mRNA expression of 84 genes involved in innate and adaptive immunity were analyzed using pathway-focused PCR-based arrays. The mRNA expression of genes with false discovery rate-adjusted <span>P</span>-values (FDR) ≤ 0.05 and absolute fold change (FC) ≥ 1.2 were determined to be differentially expressed. Out of the 84 genes analyzed, four genes [interleukin (IL)-2, MYD88, CD-80, NFkB-1] were differentially expressed and were all upregulated in positive compared with negative-RADG beef steers. Gene ontology pathway enrichment analysis of the differentially expressed genes revealed that pathways related to positive regulation of IL-17 production, cellular response to lipopolysaccharide, and positive regulation of lymphocyte activation were enriched in the positive-RADG steers (<span>P</span> ≤ 0.05). In conclusion, our study revealed that positive-RADG beef steers had increased expression of genes and pathways involved in pathogen recognition and initiation of responses to effectively fight off infections while mitigating excess inflammatory reactions compared with negative-RADG steers, which might explain, in part, the improved feed efficiency of these beef animals</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"38a8731f86582f59218abebeee10ca4048de3273d8ea1bd04c5f4175b9240cac","category":"Environment"}