{"title":"Tour of Britain 2021: more route details announced including TTT and summit finish in Wales","link":"https://www.cyclist.co.uk/news/9906/tour-of-britain-2021-more-route-details-announced-including-ttt-and-summit-finish-in-wales","date":1626795399000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>21 Jul 2021</span></div>    </div></div><p>\nMore start and finish towns and stage routes have now been revealed with highlights in Wales on Stages 3 and 4. Photo: SWPix</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/07/2019_tour_of_britain_champion_mathieu_van_der_poel.jpg?itok=Z3ZQ-g01\" />  </div>\n<div>\n      <p> New details have been released for the 2021 <a href=\"/tags/tour-of-britain\" target=\"_blank\">Tour of Britain</a> including the routes for its two Welsh stages, with one a team <a href=\"/tags/time-trial\">time-trial</a> and the other a summit finish.</p>\n<p>Having been cancelled in 2020 due to the pandemic, the race returns on Sunday 5th September nearly two years after <a href=\"/tags/mathieu-van-der-poel\" target=\"_blank\">Mathieu van der Poel</a> took the overall title.</p>\n<p>In that period the Dutchman has gone on to win another race or two and now the Tour of Britain is back and the route promises fireworks.</p>\n<p>With the opening two stages in the south west of England already announced, the routes for the most of the other days of the eight-stage race have now been revealed.</p>\n<p>Wales will host the next two days, with Stage 3 a team time-trial in Carmarthenshire – only the second ever TTT at the race – and Stage 4's 215km Queen Stage heading through Snowdonia National Park before a summit finish at Great Orme.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/07/tob2021_s4_profile_02.jpg?itok=I1sv4wx-\" />  </div>\n</div>\n<p>Stage 5 is still yet to be announced, though it will be an anti-clockwise route through Cheshire and finish in Warrington. </p>\n<p>A coast to coast follows with Stage 6 heading from Carlisle to Gateshead over 3,000m of climbing including Harside in the Lake District and Killhope Cross and Burtree Fell in the North Pennines.</p>\n<p>Although the final two stages in Scotland had already been announced, the routes have now been released with some tough climbs included in both, setting the stage for a grandstand finish for the GC.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/2104/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\">Vuelta a Espana 2021: Route, start list, live TV guide and all we know so far</a></div>      <div><a href=\"/news/913/tour-of-britain-route-riders-live-tv-guide-all-you-need-to-know\">Tour of Britain 2021: Route, teams and all you need to know</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 116: on sale now!</a></div>    </div></div><p>\nRace director Mick Bennett said, 'This year's Tour of Britain route is truly spectacular, covering a greater geographical area than we've ever done before while also ticking off several things we've wanted to do for a long time.</p>\n<p>'Be it visiting Cornwall and Aberdeenshire, hosting stage finishes on the summit of Great Orme and in the shadow of the Angel of the North, reintroducing a team time-trial and visiting noteworthy history host venues new and old, I have a feeling that this year's race will be one for the ages.'</p>\n<p>For more information, visit <a href=\"https://www.tourofbritain.co.uk/\" target=\"_blank\">tourofbritain.co.uk</a> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"38b6ff233b076b99e84213bdc09b505079d47706daaf6292bdc021fdb4305ce3","category":"Cycling"}