{"title":"Top Stories: M3 Macs Launch, iOS 17.1.1 Released, and More","link":"https://www.macrumors.com/2023/11/11/top-stories-m3-mac-launch/","date":1699711200000,"content":"Following Apple's \"Scary Fast\" event on October 30, the new M3-based MacBook Pro and iMac models have officially launched, so media and everyday users alike have been sharing their thoughts on what's almost certainly the last of Apple's new hardware for 2023.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/top-stories-11nov2023.jpg\" width=\"1600\" height=\"900\" />\r<br />\nWhile hardware may be wrapping up for the year, Apple's still hard at work on software updates with a number of bug-fix releases this week plus a new round of betas for more significant updates we're expecting to see released before the end of the year. Black Friday deals are also starting to get underway several weeks ahead of the big day, so be sure to read on below for all of this week's top stories!\r<br />\n\r<br />\n<h2>New MacBook Pro Reviews: Scary Fast, But M3 Pro Chip Has a Catch</h2>\r<br />\nThe new 14-inch and 16-inch MacBook Pro models with M3, M3 Pro, and M3 Max chips began arriving to customers and launched in stores this week, and the <a href=\"https://www.macrumors.com/review/m3-macbook-pro/\">first reviews of the laptops have been shared</a>. We also <a href=\"https://www.macrumors.com/2023/11/07/m3-macbook-pro-hands-on/\">shared our own hands-on video of the new MacBook Pro</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/M3-MacBook-Pro-Unboxing-Thumb-3.1.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nThe new iMac with the M3 chip is also now available, and we <a href=\"https://www.macrumors.com/review/m3-imac/\">rounded up reviews</a> of the all-in-one desktop computer.\r<br />\n\r<br />\n<h2>Apple Says There Won't Be a 27-Inch iMac With Apple Silicon</h2>\r<br />\nApple discontinued both the Intel-based 27-inch iMac and iMac Pro over the past two years, and it has yet to launch a larger-screen iMac with an Apple silicon chip as a replacement, leaving the 24-inch iMac as its only all-in-one desktop computer.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/iMac-Pro-2022-27-and-24-iMac.jpg\" width=\"1626\" height=\"914\" />\r<br />\nApple this week confirmed that it has <a href=\"https://www.macrumors.com/2023/11/06/no-27-inch-with-apple-silicon/\">no plans to release a new version of the 27-inch iMac with Apple silicon</a>, but that does not explicitly rule out the <a href=\"https://www.macrumors.com/2023/10/23/new-32-inch-imac-pro-expected-2024-or-2025/\">rumored 32-inch iMac Pro</a>.\r<br />\n\r<br />\n<h2>Apple Releases iOS 17.1.1 With Bug Fixes for BMW Wireless Charging and Weather Widget</h2>\r<br />\nApple this week <a href=\"https://www.macrumors.com/2023/11/07/apple-releases-ios-17-1-1/\">released a minor iOS 17.1.1 update for the iPhone with a pair of bug fixes</a>. Specifically, the update resolves a <a href=\"https://www.macrumors.com/2023/10/25/apple-to-fix-iphone-15-bmw-charging-issue/\">BMW wireless charging issue</a> affecting the iPhone 15 lineup, and it addresses a bug related to the Weather widget displaying snow.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/iOS-17.1.1-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe update is available for the iPhone XS and newer, and it can be installed in the Settings app by tapping on General → Software Update.\r<br />\n\r<br />\n<h2>Apple Releases watchOS 10.1.1 With Fix for Apple Watch Battery Drain Bug</h2>\r<br />\nAlongside iOS 17.1.1, Apple also <a href=\"https://www.macrumors.com/2023/11/07/apple-releases-watchos-10-1-1/\">released a minor watchOS 10.1.1 update for the Apple Watch</a>. The update resolves an issue causing excessive battery drain on a variety of Apple Watch models that had been updated to watchOS 10.1.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/watchOS-10-Launch-Feature.jpg\" width=\"2560\" height=\"1440\" />\r<br />\nApple had <a href=\"https://www.macrumors.com/2023/11/04/watchos-update-to-fix-battery-drain-issue/\">acknowledged the battery drain issue in an internal memo</a> obtained by <em>MacRumors</em>, and it has now delivered on its promise to make a fix available.\r<br />\n\r<br />\n<h2>iOS 17.2 Will Add These 10 New Features to Your iPhone</h2>\r<br />\niOS 17.2 remains in beta testing, and while we <a href=\"https://www.macrumors.com/2023/11/08/ios-17-2-features-list/\">published an overview of ten features coming in the update</a> based on the first beta, the <a href=\"https://www.macrumors.com/2023/11/09/apple-seeds-ios-17-2-beta-2-to-developers/\">second beta released late this week</a> added even more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/10-New-Features-With-iOS-17.2-Feature-3.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nNew features in the second iOS 17.2 beta include the ability to <a href=\"https://www.macrumors.com/2023/11/09/ios-17-2-spatial-video-recording/\">record spatial video on iPhone 15 Pro models</a> for viewing on Vision Pro and an <a href=\"https://www.macrumors.com/2023/11/09/ios-17-2-expands-sensitive-content-warnings/\">expansion of the optional Sensitive Content Warning feature</a> to include Contact Posters, stickers in the Messages app, and more.\r<br />\n\r<br />\n<h2>Apple Silicon Buyer's Guide: Which Chip Should You Choose?</h2>\r<br />\nChoosing a new Mac often involves consideration of the many Apple silicon chips now on offer, so <a href=\"https://www.macrumors.com/guide/apple-silicon-buyers-guide/\">our comprehensive guide covers their generations, variations, and performance benchmarks</a> to help you decide which is best for you.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/Mac-Chip-Comparison-Buyers-Guide-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nOur guide includes Apple's latest M3, M3 Pro, and M3 Max chips announced for the 14-inch MacBook Pro, 16-inch MacBook Pro, and 24-inch iMac last month.\r<br />\n\r<br />\n<h2>The Best Early Black Friday Apple Deals</h2>\r<br />\n<a href=\"https://www.macrumors.com/roundup/black-friday/\">Black Friday</a> is still two weeks away, but the holiday shopping season is already ramping up with tons of solid deals on Apple products and more. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/best-early-black-friday-deals.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nWe're <a href=\"https://www.macrumors.com/2023/11/02/best-early-black-friday-apple-deals/\">keeping track of the best deals</a>, regularly updating our coverage to reflect the rapidly changing deal situation, and we've got dedicated deal guides for Apple's major product categories linked in there for closer looks.\r<br />\n\r<br />\n<h3>MacRumors Newsletter</h3>\r<br />\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r<br />\n\r<br />\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/nov-9-2023\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/11/top-stories-m3-mac-launch/\">Top Stories: M3 Macs Launch, iOS 17.1.1 Released, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-m3-macs-launch-ios-17-1-1-released-and-more.2410665/\">Discuss this article</a> in our forums<br /><br />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"38b6069e7fc81555ff5d86a587d93f34310a257ae2f3e86ef7dd79bf7c839782","category":"Apple"}