{"title":"Stakeholder Driven Sensor Deployments to Characterize Chronic Coastal Flooding in Key West Florida","link":"https://onlinelibrary.wiley.com/doi/10.1029/2023EF003631?af=R","date":1719665047000,"content":"<h2>Abstract</h2>\n<p>A changing climate and growing coastal populations exacerbate the outcomes of environmental hazards. Large-scale flooding and acute disasters have been extensively studied through historic and current data. Chronic coastal flooding is less well understood and poses a substantial threat to future coastal populations. This paper presents a novel technique to record chronic coastal flooding using inexpensive accelerometers. This technique was tested in Key West, FL, USA using storm drains to deploy HOBO pendant G data loggers. The accuracy and feasibility of the method was tested through four deployments performed by a team of local stakeholders and researchers between July 2019–November 2021 resulting in 22 sensors successfully recording data, with 15 of these sensors recording flooding. Sensors captured an average of 13.58 inundation events, an average of 12.07% of the deployment time. Measured flooding events coincided with local National Oceanic and Atmospheric Administration (NOAA) water level measurements of high tides. Multiple efforts to predict coastal flooding were compared. Sensors recorded flooding even when NOAA water levels did not exceed the elevation or flooding thresholds set by the National Weather Service (NWS), indicating that NOAA water levels alone were not sufficient in predicting flooding. Access to an effective and inexpensive sensor, such as the one tested here, for measuring flood events can increase opportunities to measure chronic flood hazards and assess local vulnerabilities with stakeholder participation. The ease of use and successful recording of loggers can give communities an increased capacity to make data-informed decisions surrounding sea level rise adaptation.</p>","author":"K. L. O’Donnell, \nT. Tomiczek, \nA. Higgins, \nS. Munoz, \nS. Scyphers","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"38b8559cae47d4f0789e38a01995640a0c288f7a7bc4e8c1cb62da1c5ea2440f","category":"Environment"}