{"title":"Comparative Analysis of Shikonin and Alkannin Acyltransferases Reveals Their Functional Conservation in Boraginaceae","link":"https://academic.oup.com/pcp/article/65/3/362/7511979?rss=1","date":1702252800000,"content":"<span><div>Abstract</div>Shikonin and its enantiomer, alkannin, are bioactive naphthoquinones produced in several plants of the family Boraginaceae. The structures of these acylated derivatives, which have various short-chain acyl moieties, differ among plant species. The acylation of shikonin and alkannin in <span>Lithospermum erythrorhizon</span> was previously reported to be catalyzed by two enantioselective BAHD acyltransferases, shikonin O-acyltransferase (LeSAT1) and alkannin O-acyltransferase (LeAAT1). However, the mechanisms by which various shikonin and alkannin derivatives are produced in Boraginaceae plants remain to be determined. In the present study, evaluation of six Boraginaceae plants identified 23 homologs of LeSAT1 and LeAAT1, with 15 of these enzymes found to catalyze the acylation of shikonin or alkannin, utilizing acetyl-CoA, isobutyryl-CoA or isovaleryl-CoA as an acyl donor. Analyses of substrate specificities of these enzymes for both acyl donors and acyl acceptors and determination of their subcellular localization using <span>Nicotiana benthamiana</span> revealed a distinct functional differentiation of BAHD acyltransferases in Boraginaceae plants. Gene expression of these acyltransferases correlated with the enantiomeric ratio of produced shikonin/alkannin derivatives in <span>L. erythrorhizon</span> and <span>Echium plantagineum.</span> These enzymes showed conserved substrate specificities for acyl donors among plant species, indicating that the diversity in acyl moieties of shikonin/alkannin derivatives involved factors other than the differentiation of acyltransferases. These findings provide insight into the chemical diversification and evolutionary processes of shikonin/alkannin derivatives.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"38c30c3a919ca5ad7993cec9b318da8736880bb0243a77cff2a180b14939d814","category":"Environment"}