{"title":"สเปน จักรวรรดิที่พระอาทิตย์ไม่เคยตกดิน","link":"https://markpeak.net/spain-golden-age-history/","date":1698820045000,"content":"<p>เรื่องมีอยู่ว่า ซื้อ<a href=\"https://www.gypsygroup.net/product/792/%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C%E0%B9%80%E0%B8%A1%E0%B9%87%E0%B8%81%E0%B8%8B%E0%B8%B4%E0%B9%82%E0%B8%81-%E0%B8%89%E0%B8%9A%E0%B8%B1%E0%B8%9A%E0%B8%9B%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B8%9B%E0%B8%A3%E0%B8%B8%E0%B8%87%E0%B9%83%E0%B8%AB%E0%B8%A1%E0%B9%88-%E0%B8%9B%E0%B8%81%E0%B9%81%E0%B8%82%E0%B9%87%E0%B8%87-2\">หนังสือประวัติศาสตร์เม็กซิโก</a>มาอ่าน แล้วอ่านไม่รู้เรื่อง เพราะไม่รู้บริบททางประวัติศาสตร์สเปน เจ้าอาณานิคมในตอนนั้น เลยดองเอาไว้ยาวนาน</p>\n<p>มีมิตรสหายแนะนำเล่มนี้มา “<a href=\"https://www.gypsygroup.net/product/1203/%E0%B8%AA%E0%B9%80%E0%B8%9B%E0%B8%99-%E0%B8%88%E0%B8%B1%E0%B8%81%E0%B8%A3%E0%B8%A7%E0%B8%A3%E0%B8%A3%E0%B8%94%E0%B8%B4%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%9E%E0%B8%A3%E0%B8%B0%E0%B8%AD%E0%B8%B2%E0%B8%97%E0%B8%B4%E0%B8%95%E0%B8%A2%E0%B9%8C%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B9%80%E0%B8%84%E0%B8%A2%E0%B8%95%E0%B8%81%E0%B8%94%E0%B8%B4%E0%B8%99-spain-the-empire-on-which-the-sun-never-set-%E0%B8%9B%E0%B8%81%E0%B9%81%E0%B8%82%E0%B9%87%E0%B8%87-2\">สเปน จักรวรรดิที่พระอาทิตย์ไม่เคยตกดิน</a>” ของสำนักพิมพ์ยิปซี เขียนโดย อ. นุชธิดา ราศีวิสุทธิ์ จากคณะศิลปศาสตร์ ธรรมศาสตร์ ซึ่งพี่โหน่งบอกว่าเป็นผู้นำแห่ง Iberian Studies ในประเทศไทย</p>\n<p>หนังสือหนาเลย 430 หน้า ทยอยอ่านมาเรื่อยๆ จนจบ เลยอยากมาเขียนรีวิวสักหน่อยว่า ดีมาก ละเอียดมาก</p>\n<p>หนังสือเล่มนี้จับความยุคทองของสเปน (<a href=\"https://en.wikipedia.org/wiki/Spanish_Golden_Age\">Spanish Golden Age</a> หรือ Siglo de Oro) ช่วงปี 1474-1598 ผ่านกษัตริย์ 3 รัชกาล ได้แก่</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Isabella_I_of_Castile\">Isabella I of Castile</a> และ <a href=\"https://en.wikipedia.org/wiki/Ferdinand_II_of_Aragon\">Ferdinand II of Aragon</a> ที่แต่งงานกัน แล้วรวมชาติสเปน คาสติลกับอารากอนเข้าด้วยกัน ขับไล่อาณาจักรมัวร์ทางใต้ และค้นพบโลกใหม่ อเมริกา</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Charles_V,_Holy_Roman_Emperor\">Charles I</a> ผู้รวมยุโรปเข้าด้วยกันจากเครือญาติฝั่งปู่-ย่า-ตา-ยาย ครองทั้งสเปน เนเธอร์แลนด์ ออสเตรีย โรมันอันศักดิ์สิทธิ์ และบางแคว้นของฝรั่งเศส-อิตาลี</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Philip_II_of_Spain\">Philip II</a> เจ้าของชื่อที่นำไปตั้งเป็นประเทศฟิลิปปินส์ กษัตริย์นักบริหารที่ยืนอยู่บนจุดสูงสุดของสเปนยุคทอง คู่แค้นของ Elizabeth I แห่งอังกฤษ และจุดเริ่มต้นของ “ขาลง” ของสเปน</li>\n</ul>\n<p>จุดเด่นของหนังสือเล่มนี้คือการวิเคราะห์อย่างละเอียด ทั้งปัจจัยเรื่องการเมือง เศรษฐกิจ ศาสนา สังคม ของสเปน ว่าขึ้นสู่ยุคทองและร่วงหล่นจากยุคทองอย่างรวดเร็วได้อย่างไร ทำไมมหาอำนาจระดับสเปนที่ครองดินแดนทั่วโลก มีความมั่งคั่งจากเหมืองในอเมริกาใต้มหาศาล ถึงเสื่อมอิทธิพลลงอย่างรวดเร็ว และกลายเป็นประเทศอื่นในยุโรปขึ้นมาเรืองอำนาจแทน</p>\n<p>คำตอบคือ อาณาจักรสเปนขยายตัวเร็วเกินไป เริ่มต้นจากการรวมอาณาจักรย่อยๆ บนคาบสมุทรไอบีเรีย ทะยานขึ้นสู่มหาอำนาจที่มีดินแดนทั้งในยุโรป (เนเธอร์แลนด์ ออสเตรีย โรมันอันศักดิ์สิทธิ์ อิตาลี) และดินแดนในโลกใหม่ (อเมริกา ฟิลิปปินส์) ในเวลาอันรวดเร็ว แต่ในอีกทางก็ต้องเผชิญกับสงครามกับมหาอำนาจอื่นๆ ในละแวกใกล้เคียงกัน ทั้งกับฝรั่งเศส (เพื่อนสนิท) ออตโตมัน และปัญหาสงครามในเนเธอร์แลนด์ที่กลายเป็นหล่มฉุดสเปนให้ลงเหวด้วย</p>\n<p>หนังสือเล่มนี้อาจไม่ได้กล่าวถึงประวัติศาสตร์สเปนจนจบ เพราะจับความแค่ 3 รัชสมัย แต่อ่านจบแล้วเข้าใจประวัติศาสตร์สเปนเพิ่มขึ้นอีกมาก และเตรียมตัวกลับไปอ่านเล่มเม็กซิโกต่อ</p>The post <a href=\"https://markpeak.net/spain-golden-age-history/\">สเปน จักรวรรดิที่พระอาทิตย์ไม่เคยตกดิน</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"38c84db8ba71e0a482950378cd7976b9096acb2a51c88369dd0531b8e63d0bfc","category":"Thai"}