{"title":"Comparing psychological versus pharmacological treatment in emotional disorders: A network analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301675","date":1712152800000,"content":"<p>by Francisco Jurado-González, Francisco García-Torres, Alba Contreras, Roger Muñoz-Navarro, César González-Blanch, Leonardo Adrián Medrano, Paloma Ruiz-Rodríguez, Eliana M. Moreno, Carolina Pérez-Dueñas, Antonio Cano-Vindel, Juan A. Moriana</p>\r\n\r\nTransdiagnostic group cognitive behavioural therapy (TD-GCBT) is more effective in improving symptoms and severity of emotional disorders (EDs) than treatment as usual (TAU; usually pharmacological treatment). However, there is little research that has examined the effects of these treatments on specific symptoms. This study used Network Intervention Analysis (NIA) to investigate the direct and differential effects of TD-GCBT + TAU and TAU on specific symptoms of anxiety and depression. Data are from a multicentre randomised clinical trial (<i>N</i> = 1061) comparing TD-GCBT + TAU versus TAU alone for EDs. The networks included items from the PHQ-9 (depression) and GAD-7 (anxiety) questionnaire and mixed graphical models were estimated at pre-treatment, post-treatment and 3-, 6- and 12-month follow-up. Results revealed that TD-GCBT + TAU was associated with direct effects, mainly on several anxiety symptoms and depressed mood after treatment. New direct effects on other depressive symptoms emerged during the follow-up period promoted by TD-GCBT compared to TAU. Our results suggest that the improvement of anxiety symptoms after treatment might precipitate a wave of changes that favour a decrease in depressive symptomatology. NIA is a methodology that can provide fine-grained insight into the likely pathways through which treatments exert their effects.","author":"Francisco Jurado-González","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"38d0000e7d20805c7028f2506ece28db120b0fd38529da30fe8423a7b4a3832f","category":"Interdisciplinary"}