{"title":"Chitosan‐coated soybean protein isolate/lecithin nanoparticles for enhancing the stability and bioaccessibility of phytosterol","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13307?af=R","date":1712732400000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Phytosterols (PS) have various beneficial effects on human health, especially the property of reducing blood cholesterol. However, the low solubility and bioaccessibility of PS have greatly limited their application in functional food ingredients.</p>\n<h2>RESULTS</h2>\n<p>To improve the bioaccessibility and stability of PS, chitosan-coated PS nanoparticles (CS-PNP) were successfully prepared by self-assembly. The properties of CS-PNP, including size, zeta potential, encapsulation efficiency (EE) and loading amount (LA) were characterised. The optimisation of CS concentration (0.4 mg mL<sup>−1</sup>) and pH (3.5) resulted in the formation of CS-PNP with an EE of over 90% and a particle size of 187.7 nm. Due to the special properties of CS chitosan, the interaction between CS and soybean protein isolate (SPI)/lecithin (SL) led to the formation of a soluble complex. CS-PNP exhibited good stability to temperature variations but was more sensitive to salt ions. During <i>in vitro</i> digestion, CS efficiently maintained the stability of nanoparticles against the hydrolysis of SPI by pepsin under acidic conditions. However, these nanoparticles tended to aggregate in a neutral intestinal environment. After 3 h of <i>in vitro</i> digestion, the bioaccessibility of PS increased from 18.2% of free PS to 63.5% of CS-PNP.</p>\n<h2>CONCLUSION</h2>\n<p>Overall, these results highlight the potential of chitosan-coated nanoparticles as effective carriers for the oral administration of PS. This multilayer construction may serve as a promising for applications in food products as delivery vehicles for nutraceuticals. © 2024 Society of Chemical Industry.</p>","author":"Ming Cheng, \nYe Tao, \nChunwei Wang, \nAo Li","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"38e8ba56c182feed73a615b20cde323ce70847b5f74388de709c3c60c4d58e1b","category":"Environment"}