{"title":"Beyond individual responsibility: Exploring lay understandings of the contribution of environments on personal trajectories of obesity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302927","date":1715176800000,"content":"<p>by Nestor Serrano-Fuentes, Anne Rogers, Mari Carmen Portillo</p>\r\nIntroduction <p>Reversing the upward trajectory of obesity requires responding by including the multiple influences on weight control. Research has focused on individual behaviours, overlooking the environments where individuals spend their lives and shape lifestyles. Thus, there is a need for lay understandings of the impact of environments as a cause and solution to obesity. This research aimed to understand the influence of environments on the adoption of health practices in adults with obesity and to identify lay strategies with which to address environmental barriers to behaviour change.</p> Methods <p>Nineteen adults with a history of obesity living in the United Kingdom were interviewed through video conferencing between May 2020 and March 2021. Semi-structured interviews and socio-demographic questionnaires were used, and data analysed through hermeneutic phenomenology informed reflexive thematic analysis.</p> Results <p>Three main themes were created: living with convenience and normalcy: the increased accessibility of unhealthy food, people interacting with digital media for positive practice change, and the need to prioritise prevention in schools, the National Health Service and the food industry.</p> Conclusions <p>The food environment was the major barrier, while interactions with social media was the most important opportunity to adopt healthy practices. The National Health Service was considered an obesogenic environment, something relevant since it has been traditionally recognised as an obesity management system. The perceptions from individuals with a history of obesity provide new suggestions on the influence of previously overlooked environments to design more adequate and effective interventions and policies that consider, more than in the past, the environments where people spend their lives.</p>","author":"Nestor Serrano-Fuentes","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"38ef04e6a15f78b04ff75a4f876092d0bc5cf8bafe1567851dfe66c7ff934f9a","category":"Interdisciplinary"}