{"title":"Seasonal resource selection of an arboreal habitat specialist in a human-dominated landscape: A case study using red panda","link":"https://academic.oup.com/cz/article/69/1/1/6537534?rss=1","date":1645833600000,"content":"<span><div>Abstract</div>Human-dominated landscapes provide heterogeneous wildlife habitat. Conservation of habitat specialists, like red pandas <span>Ailurus fulgens</span>, inhabiting such landscapes is challenging. Therefore, information on resource use across spatial and temporal scales could enable informed-decision making with better conservation outcomes. We aimed to examine the effect of geo-physical, vegetation, and disturbance variables on fine-scale habitat selection of red pandas in one such landscape. We equipped 10 red pandas with GPS collars in eastern Nepal in 2019 and monitored them for 1 year. Our analysis was based on a generalized-linear-mixed model. We found the combined effect of geo-physical, vegetation, and disturbance variables resulted in differences in resource selection of red pandas and that the degree of response to these variables varied across seasons. Human disturbances, especially road and cattle herding activities, affected habitat utilization throughout the year whereas other variables were important only during restricted periods. For instance, geo-physical variables were influential in the premating and cub-rearing seasons while vegetation variables were important in all seasons other than premating. Red pandas selected steeper slopes with high solar insolation in the premating season while they occupied elevated areas and preferred specific aspects in the cub-rearing season. Furthermore, the utilized areas had tall bamboo in the birthing and cub-rearing seasons while they also preferred diverse tree species and high shrub cover in the latter. Our study demonstrates the significance of season-specific management, suggests the importance of specific types of vegetation during biologically crucial periods, and emphasizes the necessity to minimize disturbances throughout the year.</span>","author":"","siteTitle":"Current Zoology Current Issue","siteHash":"e7197aa0e79464a44186f16a81d9758c42b85acdd06820e73429ff264fcd9f66","entryHash":"38f0215b138f8ada2503a98188fbfa924f41867e608337af3b93b9599e8b82f0","category":"Environment"}