{"title":"Microsoft network breached through password-spraying by Russian-state hackers","link":"https://arstechnica.com/?p=1997633","date":1705714903000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/06/microsoft-800x534.jpeg\" alt=\"Microsoft network breached through password-spraying by Russian-state hackers\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/06/microsoft.jpeg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Russia-state hackers exploited a weak password to compromise Microsoft’s corporate network and accessed emails and documents that belonged to senior executives and employees working in security and legal teams, Microsoft said late Friday.</p>\n<p>The attack, which Microsoft attributed to a Kremlin-backed hacking group it tracks as Midnight Blizzard, is at least the second time in as many years that failures to follow basic security hygiene has resulted in a breach that has the potential to harm customers. One paragraph in <a href=\"link\">Friday’s disclosure</a>, filed with the Securities and Exchange Commission, was gobsmacking:</p>\n<blockquote><p>Beginning in late November 2023, the threat actor used a password spray attack to compromise a legacy non-production test tenant account and gain a foothold, and then used the account’s permissions to access a very small percentage of Microsoft corporate email accounts, including members of our senior leadership team and employees in our cybersecurity, legal, and other functions, and exfiltrated some emails and attached documents. The investigation indicates they were initially targeting email accounts for information related to Midnight Blizzard itself. We are in the process of notifying employees whose email was accessed.</p></blockquote>\n<p>Microsoft didn’t detect the breach until January 12, exactly a week before Friday’s disclosure. Microsoft's account raises the prospect that the Russian hackers had uninterrupted access to the accounts for as long as two months.</p></div><p><a href=\"https://arstechnica.com/?p=1997633#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1997633&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"38f12c0e9a02d0e90c19d5f197f26c2d94c0f19ee026846e4b7d95b52a79fa17","category":"Tech"}