{"title":"Is the Sublingual Artery a Reliable Alternative for Intraoral Anastomoses in Head and Neck Free Flap Reconstruction? Anatomical Basis and Preliminary Results","link":"https://www.preprints.org/manuscript/202407.0032/v1","date":1719826174000,"content":"Background/Objectives: Head and neck free flap reconstructions are often required to treat tumors or extensive post-traumatic jaw defects. The facial artery is the standard receiving vessel for intraoral microvascular anastomoses. However, its use is associated with several disadvantages, such as lesions of buccal nerve branches or the parotid duct and variability in course and diameter. This study aims to investigate whether sublingual artery branches can be considered an alternative intraoral supply vessel to the facial artery to avoid these drawbacks. Methods: 12 formalin-fixed cadaveric heads with 24 sides were dissected. The sublingual artery's origin, course, branching pattern, and distribution were examined. In addition, the diameters of the branches of the sublingual artery were assessed to identify potential supply vessels for anastomoses. Results: In ten of the 24 cases (41.7 %), the sublingual artery originated from the lingual artery and nine cases (37.5 %) from the facial artery. The main trunk of the sublingual artery was present in the floor of the mouth in all cases (100 %) with a diameter of ≥ 0.9 mm in vitro (1 mm in vivo). In 15 of the 24 half heads (62.5 %), branches of the sublingual artery with ≥ 0.9 mm were identified in this space. Conclusions: The large diameter of the sublingual artery on the floor of the mandible suggests that this vessel or its branches could be considered alternative pedicles for intraoral anastomoses in mandibular microvascular free flap grafts.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"38f6c1d0d3eb661dc51704befde851f8234210d4badb64f6ddce49dbec1a2dfb","category":"Interdisciplinary"}