{"title":"Nanoleaf Debuts HomeKit-Compatible Downlights, GU10 Bulbs and Lamps","link":"https://www.macrumors.com/2023/10/12/nanoleaf-downlights-lamps/","date":1697150230000,"content":"Lighting company <a href=\"https://nanoleaf.me/en-US/\">Nanoleaf</a> today announced the launch of new Essentials lights that are aimed at replacing some of the standard bulbs that are installed in ceilings, plus it is introducing a new series of products in partnership with Umbra.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/nanoleaf-downlight.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThe <a href=\"https://nanoleaf.me/en-US/products/essentials/bulbs/?category=GU10&amp;standard=matter&amp;size=3\">Essentials Matter GU10</a> and the Essentials Matter Recessed Downlight are compatible with smart home platforms that support Matter, which includes <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a>. The lights can be added to a ‌HomeKit‌ setup as long as a Matter hub like the <a href=\"https://www.macrumors.com/roundup/homepod-mini/\">HomePod mini</a> is available. The Essentials lights are also Thread enabled and will integrate with other Thread products for improved connectivity.\r<br />\n\r<br />\nNanoleaf's Recessed Downlights are four inches in size and can replace standard downlights that you may have in your home, while the GU10 bulbs can replace light fixtures that use that bulb style. Like all Nanoleaf Essential lights, the Downlights and GU10 bulbs support 16 million colors as well as a range of different white temperatures.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/nanoleaf-gu10.jpg\" alt width=\"3988\" height=\"2243\" />\r<br />\nThe lights can be controlled through the Nanoleaf app or through the Home app when added to ‌HomeKit‌, and can be activated through automations to have lights turn on at specific times or work in tandem with other smart home devices. Multiple bulbs can be grouped together so you can change the lighting in entire rooms at one time.\r<br />\n\r<br />\nNanoleaf today also announced that it is partnering with Umbra on two new Smart Lamps that are compatible with Matter. The Cono Portable Lamp and the Cup Lamp have unique designs created by Umbra with lighting technology supplied by Nanoleaf. The Cono and Cup Lamps work like other Nanoleaf lights, supporting millions of colors and working with scenes, automations, and more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/cono-lamp-nanoleaf.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThe Cono Portable Lamp has a built-in battery that lasts for up to five hours so it can be taken from room to room, while the Cup Lamp is a desktop lamp with a USB charging port and a cup base that is able to hold desk accessories.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/nanoleaf-cup-lamp.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThree of the GU10 bulbs <a href=\"https://nanoleaf.me/en-US/products/essentials/bulbs/?category=GU10&amp;standard=matter&amp;size=3\">can be preordered</a> for $50, while the downlights are <a href=\"https://nanoleaf.me/en-US/products/ceiling-lights/downlight/?size=each\">priced at $35 each</a>. The <a href=\"https://nanoleaf.me/en-US/products/smarter-partners/umbra-lamps/?category=cono-lamp&amp;color=grey\">Cono Portable Lamp</a> is available for preorder now and is priced at $95, and the $130 Cup Lamp will be available in early 2024.<div>Tag: <a href=\"https://www.macrumors.com/guide/nanoleaf/\">Nanoleaf</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/12/nanoleaf-downlights-lamps/\">Nanoleaf Debuts HomeKit-Compatible Downlights, GU10 Bulbs and Lamps</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/nanoleaf-debuts-homekit-compatible-downlights-gu10-bulbs-and-lamps.2407378/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"38ff743f4ca99070366b277f7bab62d35e03d62dfc556e258bb4e3ca08c11e0a","category":"Apple"}