{"title":"COROS Expands Targeted Recall of APEX GPS Watches: An Explainer","link":"https://www.dcrainmaker.com/2021/10/coros-expands-targeted-recall-of-apex-gps-watches-an-explainer.html","date":1634136743000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/10/COROS-APEX-46mm.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/10/COROS-APEX-46mm_thumb.jpg\" /></a></p>\n<p>Back in August COROS started issuing more widespread recall notices for “select” <a href=\"https://www.dcrainmaker.com/2019/02/coros-apex-multisport-gps-review.html\">COROS APEX 46mm watches</a>. Though, as each week went by, the recall seemed to expand further and further. COROS stated that certain watches have sent back data to COROS indicating they need to be replaced. COROS is replacing those units free of charge, or allowing users to upgrade to other COROS watches by paying the price difference. Seeing frequent messaging about this, I figured I’d dive into what’s going on, and the reasoning behind it. As always, I’m fascinated by not just new features of watches, but how companies handle when things go wrong (like last <a href=\"https://www.dcrainmaker.com/2021/10/the-fascinating-reason-why-the-garmin-fr945-fenix-6-no-longer-shows-pool-temperature.html\">week’s Garmin altimeter failure post</a>).</p>\n<p>In messages to users, COROS has told them in an e-mail:</p>\n<blockquote><p>“If you received the recall email this means that your watch sent a “flag” to our system, indicating that there may be a possible hardware failure in the future. For that reason, we wanted to proactively reach out and replace the watch to avoid that scenario. You just need to fill out that form in the email and you’re good to go!”</p></blockquote>\n<p>Now while most users started getting messages in August, and it seems to have ticked up in the last few weeks. This isn’t the first COROS APEX call.  COROS initially did some super-targeted recalls back in May for these watches, with the handful of messages then a bit more dire than more recent ones. Here’s the May messaging:</p>\n<blockquote><p>“We would like to immediately recall your defective unit for further investigation and expedite the replacement process to reduce the impact on your daily use and training.</p>\n<p>For safety concerns, please refrain from using the defective unit immediately. In addition, please discharge the battery by starting a GPS workout and let the watch power off on its own.”</p></blockquote>\n<p>The more recent messaging is less<em> ‘world-is-gonna-end’</em> dire, and more<em> ‘please just get this done for your own sake’</em>. <a href=\"https://www.facebook.com/groups/corosofficial/posts/1392864764418192/?comment_id=1392871451084190&amp;__cft__[0]=AZVmJPlGLBsBssrr3aawo-P8OA51lafJHWMTM9QRFubLcxpjnoefx0MBAbw_pCXrnCr4HMZhih9HRAh7Z7X-h20dKXLcxfOApWzrUpkhZYZqKgZ3-vKxCAD-erwiMH_C7VtqrFVbjD9AcGM_7gcyU9gFyN6eJfchkPINjjE_JdffIg&amp;__tn__=R]-R\">COROS’s CEO Lewis Wu noted at the time</a>:</p>\n<blockquote><p>“We’ve identified a small batch of old APEX watches which were manufactured in 2019, that may have a battery failure. We would like to recall all of them for further investigation, and will replace with a new one for those being impacted.”</p></blockquote>\n<p>Noticing the differences between the messages, I checked with COROS’s CEO Lewis Wu, and he explained the May (also targeted) recall versus the more recent ones:</p>\n<blockquote><p>“They are related but not identical. In May there was a confirmed defective batch which may have stopped working at any time, but now recalling the devices is a proactive approach for us to avoid potentially defective units from batches where we have seen a higher than acceptable rate of warranty claims. Many of the users who received the recall notices reported no issue on their watches, but eventually they were even happier about our solution.</p></blockquote>\n<p>He went onto note that at this point, their goal is essentially replacing out those 2019 production units in the order they were manufactured, since it’s timed more to the production date than dying tomorrow:</p>\n<blockquote><p>“Due to the hardware design of those old units, there might be hardware failures such as faster battery drain, can’t be turned on, etc. after being used for a certain period of time (like 20 months or older). For that reason, we wanted to proactively reach out and replace the watches to avoid that scenario, ensuring users do not have a non-functional watch before an important race or mountain adventure. There is a flagging system set up internally and we reached out to a select number of APEX 46mm owners batch by batch, giving them the option to receive a recall replacement or upgrade to another model.</p></blockquote>\n<p>In other words – rather than recalling everything in one go, this ensures they have stock on-hand to replace the defective units prior to the units encountering that issue – while ultimately getting through the backlog. And thus explaining why the recalls are going out in waves.</p>\n<h3><span>Replacement Logistics:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/COROS-APEX-46mm-Box.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/10/COROS-APEX-46mm-Box_thumb.jpg\" /></a></p>\n<p>In terms of logistics, COROS will is doing US users differently than the rest of the world. For US users, they’ll fill out a form to get their remaining personal details. After that, users are issued a gift card for the COROS site, which allows them to ‘purchase’ a replacement COROS APEX 46mm, or, to buy-up to any other watch at the retail price difference. The unit will then ship to the user.</p>\n<p>The company says 14 days after the user receives the gift card, COROS is deactivating the old unit, caused it be ‘locked’, making it non-usable. COROS won’t be receiving the locked units back, but rather is suggesting folks find their local electronic recycling drop-off point for proper disposal. In other words, there’s no value left in those units for COROS, and thus it’ll cost more to ship them back than is worth it.</p>\n<p>For non-US users, they fill out roughly the same form, except choose which color replacement unit they want (or if they want to upgrade). But that COROS is handling that manually, rather than just issuing gift cards for the store. This is likely to ensure that users aren’t hit with VAT/import taxes on a replacement unit (in theory, a replacement unit doesn’t trigger a tax in most countries, but in in reality – it’s always a lottery with what customs officers in any given country decide to do on any given shipment).</p>\n<p>I thought the locking bit was somewhat interesting. It’s a relatively good way to ensure that watches aren’t being re-sold after the fact. I’m not aware of any of the other endurance sports watch makers having similar functionality. Certainly most companies can block serial numbers from being activated, but to lock out an older watch is more tricky. Though with COROS’s case, the app is 100% required for configuration and setup, whereas a Garmin watch could technically be activated/setup in the middle of the ocean on a raft, without any connectivity.</p>\n<p>Interestingly though, this isn’t the first time COROS has leveraged their locking capability. A <a href=\"https://www.facebook.com/groups/corosofficial/posts/1466179707086697/?__cft__[0]=AZX1_FUdnrcEoza7O_Mw1chcoxvjBj5y8kQZRioXv7MG5u0j5MQ3DCjYZ2sj1fkkzN52UYy4FAvu1QtoIhxQWwO1I1dt5ZkreCsmTvExfUyPVZgOXB_13BG1f_PSfflQBJhfdChFLNrq-a9x-5p85ik-&amp;__tn__=%2CO%2CP-R\">user had their Amazon-purchased watch locked</a> in September, after the company had a shipment of watches to a retailer go missing. Thus it does appear that COROS could use this for other stolen goods – something I’d love to see happen in the bike computer realm (where stealing of bike computers on bikes in triathlon transition areas is more common).</p>\n<p>In any case, here’s the recall message in full, as sent to some number of APEX users:</p>\n<blockquote><p>“Good afternoon!</p>\n<p>We are sending this message as a first notice that your COROS APEX 46mm has been included in a mandatory recall.<br />\nIn order to effectively process the replacement or upgrade of your recalled APEX 46mm watch please visit the correct COROS Recall Support pages linked below, in accordance with your country of residence. Full instructions and details regarding the recall procedure are included on these pages.</p>\n<p>US Customers  – <a href=\"https://support.coros.com/hc/en-us/articles/4405300683284\">https://support.coros.com/hc/en-us/articles/4405300683284</a><br />\nCustomers Outside of the US – <a href=\"https://support.coros.com/hc/en-us/articles/4406260623636\">https://support.coros.com/hc/en-us/articles/4406260623636</a></p>\n<p>Both sites will include key information about the recall that you may refer to in clarifying any questions and please make sure to fill out the form on the bottom of the Support page. You can also reference our Recall and Upgrade FAQ page or contact <a>support@coros.com</a> for further information.</p>\n<p>Recall and Upgrade FAQ’s – <a href=\"https://support.coros.com/hc/en-us/articles/4406113650068\">https://support.coros.com/hc/en-us/articles/4406113650068</a></p>\n<p>Additionally, you’re more than welcome to continue using your current watch until the replacement arrives, as we are aware that a significant portion of COROS users are currently within training blocks or have races coming up who can’t afford to miss out on a recording their data!</p>\n<p>We are sorry for the inconvenience but hope that you can understand this is an effort by our entire team to continue Exploring Perfection as we work to improve COROS every day. We greatly value every COROS user’s feedback as well, so please do not hesitate to reach out with any questions/comments/concerns and thanks for being a part of the COROS community!”</p></blockquote>\n<p>The messages are all signed by specific names/members of COROS’s support team, depending on who exactly sent it. Which, is about the only criticism I’ve seen from most people in the forums – they aren’t sure if these messages are legit, or a phishing attempt. Which as a former IT dude, means society is finally making steps towards being skeptical of unsolicited e-mails with links asking for personal info. Woot! 🙂</p>\n<p>But, I could see how perhaps also integrating the notice directly into the COROS app would make sense, especially given the ability to lock the watch and ties to the specific known broken unit ID’s (which is tied to your app).</p>\n<p>Still, that minor quibble aside, it appears COROS is doing a good job handling this recall. And also I suspect, rate-limiting the recalls of the units so that they have enough stock on-hand to replace users watches, rather than sit in a queue forever. After all, the issuing of recall notices seems to have stretched on some 5 months now. Given the current world availability environment, this seems like the best way to handle it.</p>\n<p>With that, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"3902e2a8a6d54a496d30da04ce6942378278ca5bc1b16124f8841e3e7b8365a5","category":"Cycling"}