{"title":"Contribution of the Type III Secretion System (T3SS2) of Vibrio parahaemolyticus in Mitochondrial Stress and Cell Death in Human Intestinal Cells","link":"https://www.preprints.org/manuscript/202403.0887/v1","date":1710489351000,"content":"Vibrio parahaemolyticus is an important human pathogen that is currently the leading cause of shellfish-borne gastroenteritis in the world. Particularly, the pandemic strain has the capacity to induce cytotoxicity and enterotoxicity through its Type 3 Secretion System (T3SS2) that leads to massive cell death. However, the specific mechanism by which T3SS2 induces cell death remain unclear and the contribution in mitochondrial stress is not fully understood. In this work, we evaluated the contribution of T3SS2 of V. parahaemolyticus to generate mitochondrial stress and cell death during infection in human intestinal HT-29 cells. To evaluate this, infection assays were carried out to evaluate mitochondrial transition pore opening, mitochondrial fragmentation, ATP quantification, and cell viability during infection. Our results showed that the Δvscn1 (T3SS2+) mutant strain contributes to generating the sustained opening of the mitochondrial transition pore. Furthermore, it generates perturbations in the ATP production in infected cells, leading to a significant decrease in cell viability and loss of membrane integrity. Our results suggest that T3SS2 from V. parahaemolyticus plays a role in generating mitochondrial stress and cell death in human intestinal HT-29 cells. It is important to highlight that this study represents the first report indicating the involvement of T3SS2 from V. parahaemolyticus in generating mitochondrial stress, its impact on the mitochondrial pore, and its effect on ATP production in human cells.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3909d1b6154211d8a3dbb4b89728a2c06cf9ae6f93674a529e51cce09bf3e42a","category":"Interdisciplinary"}