{"title":"PSII-3 Effect of environmental enrichment on pig average daily feed intake and average daily gain in the early nursery phase","link":"https://academic.oup.com/jas/article/102/Supplement_3/437/7757019?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Transition from the sow to nursery is a stressful time for pigs and commonly leads to negative impacts on pig health, welfare, and lifetime performance. The objective of this study was to determine if the addition of a biologically relevant enrichment device affected average daily gain (ADG) and average daily feed intake (ADFI) during the first 2 wk of nursery. A total of 160 mixed-sex pigs (Camborough 1050 X 337, PIC), 19 to 24 d of age [body weight (BW) = 5.77 SD 0.97 kg], were randomly allocated to pens at the Iowa State University Swine Nutrition Farm. Each pen contained 10 pigs (~0.29 m<sup>2</sup>/pig). Each pen was randomly assigned to one of two treatments: 1) enrichment device with no attractant (positive treatment; n = 8), or 2) no enrichment device (negative treatment; n = 8). Each positive treatment pen had two enrichment devices, consisting of one cotton rope and two biscuits, suspended from the feeder at pig height. The biscuits were replaced daily at about 0800 h throughout wk 1 in nursery (d 0 to d 6). In wk 2 (d 7 to d 13) no pens had an enrichment device. Each pen was equipped with a 4-hole, dry self-feeder measuring 0.61 m long and two affixed nipple drinkers. The feeder was weighed daily, and the pigs weighed weekly. Changes in daily feeder weight and weekly pig BW were used to calculate average daily feed intake (ADFI) and average daily gain (ADG). Pen was the experimental unit. Data were analyzed using the PROC Mixed procedure of SAS. The model included treatment, week, and treatment by week interaction. A <span>P</span>-value of ≤ 0.05 was considered significantly different. There was an observed difference in ADFI and ADG between wk (<span>P</span> ≤ 0.001, Table 1). However, there were no observed differences in ADFI or ADG for treatment (<span>P</span> ≤ 0.79) or treatment by week interaction (<span>P</span> ≤ 0.93). In conclusion, the addition of this biologically relevant enrichment did not improve or impair ADFI and ADG during the first 2 wk of the nursery phase.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"390c373a4bccc0c071bc7ee65365b5678706fbc4ac2784fdc472fcd8855a8bf2","category":"Environment"}