{"title":"Trans-Atlantic joint venture aims to build new “international” space station","link":"https://arstechnica.com/?p=1958766","date":1691107236000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/voyagerstarlab-800x450.jpg\" alt=\"Artist's illustration of the planned Starlab space station.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/voyagerstarlab.jpg\">Enlarge</a> <span>/</span> Artist's illustration of the planned Starlab space station. (credit: <a href=\"https://voyagerspace.canto.com/v/MLKB1RON61/album/LIVR8?display=curatedView&amp;viewIndex=0\">Voyager Space</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Voyager Space, one of several US companies formulating concepts for new commercial space stations, has established a joint venture with Airbus to co-develop an Earth-orbiting research outpost called Starlab.</p>\n<p>The companies announced the joint venture Wednesday, saying they plan to field a successor to the International Space Station. \"The US-led joint venture will bring together world-class leaders in the space domain, while further uniting American and European interests in space exploration,\" the two companies said in a joint statement.</p>\n<p>Voyager has been managing the development of a privately owned space station called Starlab for several years. The Starlab station concept was <a href=\"https://arstechnica.com/science/2021/12/nasa-sets-sail-into-a-promising-but-perilous-future-of-private-space-stations/\">one of three selected by NASA for funding in 2021</a>, alongside projects from separate industry teams led by Blue Origin and Northrop Grumman. Voyager's proposal took home the largest NASA funding award—$160 million—to go toward design and engineering work for the Starlab station through a cost-sharing public-private partnership arrangement.</p></div><p><a href=\"https://arstechnica.com/?p=1958766#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1958766&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3914a2040f021e3bcf5bccb872c84bc3d38885583d1ac21cd451d6d856a59a19","category":"Tech"}