{"title":"Best mountain bikes under £1,000 in 2021 | Top-rated bikes for mountain biking on a budget","link":"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bikes-under-1000-2/","date":1629298800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2019/12/Calibre-Bossnut-01-0af6d0c.jpg?quality=90&amp;resize=620,413\" />                                            <p>Few of us are lucky enough to be able to splash a grand on our first bike. Instead, this tends to be the price range for people who’ve already spent some time on a mountain bike and have decided they want something a little more serious to take their riding to the next level.</p>\n<p>While budget is still a priority, the bikes in this price bracket are a little more trail-focused. So you can expect to find suspension that’s a little more heavy-duty and equipment that’s a little better at handling the rigours of off-road riding.</p>\n<p>This price range is dominated by hardtails, but you can get a good full suspension bike if you’re prepared to spend close to the £1,000 mark, and it’s not unheard of to see some full-sus bikes under £1,000 among the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-trail-bikes/\">best trail mountain bikes</a>.</p>\n<p>Hardtails tend to be lighter and easier to maintain, but the benefit of having both front and rear suspension is that it’ll give you more confidence and traction on steep descents.</p>\n<p>The industry also seems to have settled in terms of <a href=\"https://www.bikeradar.com/mtb/mountain-bike-wheel-sizes-26in-650b-and-29in-explained/\">wheel size</a>, meaning the majority of bikes at this price will now use <a href=\"https://www.bikeradar.com/features/what-is-650b/\">27.5in / 650b wheels</a>.</p>\n<p>At this price point, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">dropper posts</a> are becoming more common, introducing extra versatility to a bike and consequently opening up a far wider range of riding.</p>\n<p>Hydraulic disc brakes are also almost standard at this price. We’d nearly go as far as to say avoid bikes that don’t have them because they offer better and more confidence-inspiring performance than cable brakes.</p>\n<p>A good tip is to look for a bike at this price point that uses the Boost <a href=\"https://www.bikeradar.com/features/mtb-axle-standards/\">mountain bike axle standard</a>. Upgrading wheels is an easy way to improve the performance of a bike and this standard will open up a whole plethora of lighter and stronger mountain bike wheels to you.</p>\n<p>Every machine here can be happily pushed into service at any trail centre, most types of cross-country race and any sort of general off-road exploration.</p>\n<p>No matter which bike you choose in this price bracket, it is going to help get more out of you and your riding – which, after all, is why we ride a bike.</p>\n<section><div>\n        <h2>Best mountain bikes for £1,000, as rated by our expert testers</h2>\n<ul><li><strong><strong>Boardman MHT 8.9:</strong></strong> £1,000</li>\n<li><strong>Calibre Bossnut (2020): </strong>£1,100</li>\n<li><strong>Calibre Line 29:</strong> £905</li>\n<li><strong>Voodoo Bizango Carbon:</strong> £1,000</li>\n<li><strong>Cannondale Trail SE 4:</strong> £900</li>\n<li><strong>Carrera Titan X:</strong> £850</li>\n<li><strong>Jamis Dakar A2:</strong> £1,095</li>\n<li><strong>Vitus Sentier 29:</strong> £850</li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Boardman MHT 8.9</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>5.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> We dubbed Boardman’s MHT 8.9 an instant classic when it arrived earlier this year.</span></figcaption><span> <i>Russell Burton</i></span></div>\n<ul><li>£1,000 as tested</li>\n<li>A ride that punches far beyond what the price would suggest</li>\n<li>Great kit makes the most of the sorted frame</li>\n<li>Versatile frame means it can switch to commuting duties</li>\n</ul><p>If you’ve got £1,000 to spend on a quick trail hardtail then this absolutely has to be on your shortlist because its ride is capable of outclassing nearly everything else in its category.</p>\n<p>As a rework of Boardman’s fast trail 29er, the MHT is more evolution than revolution. It’s blisteringly fast, with a lot of that pace coming directly from the Boardman’s lack of overall weight. Pop it on the scales and you’d see it actually comes in at around 2kg lighter than most similarly priced bikes.</p>\n<p>Its understated alloy frame is paired with a very capable RockShox Reba RL fork, while a sorted Shimano SLX 1x drivetrain with 46t crawler cog should see you up the steepest of inclines.</p>\n<p>The MHT can even lend itself to commuting duties thanks to its rack mounts, low overall weight and hardwearing tyres.</p>\n<p>It’s a different proposition from the full-suspension bikes you’ll find in this list, but if you like going quickly and don’t suffer from a bad back then it could be the smarter choice.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/boardman-mht-8-9-review/\">Read our full review of the Boardman MHT 8.9</a></li>\n</ul><div>\n    <h5>Latest deals for the Boardman MHT 8.9</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Calibre Bossnut (2020)</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>5.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n<div>\n    <img /></div><div><figcaption><span><i></i> While not revolutionary, the geometry is on the money for an easy-riding trail bike.</span></figcaption><span> <i>Laurence Crossman-Emms</i></span></div>\n</div>\n<ul><li>£1,100 as tested</li>\n<li>Amazing component choices</li>\n<li>A sorted trail bike straight out of the box</li>\n<li>Still the best full-suspension bike for £1,100 (£1,500 without a Go Outdoors card, which is £5)</li>\n</ul><p>Okay, so this bike is technically £100 over budget (after you’ve bought the discount card from Go Outdoors) but it’s such an incredible bike for the money it would be a shame not to try and stretch that little further beyond the £1,000 budget to get your hands on it.</p>\n<p>The 2020 version of the Bossnut has 130mm of travel, two bottle cage bosses under the down tube, external cable routing and a port for an internally-hosed dropper post on the seat tube.</p>\n<p>The geometry is on the money for a trail bike, too. The size large has 460mm reach, a 66-degree head angle (1-degree slacker than the outgoing bike) and a 74.5-degree seat tube angle.</p>\n<p>The 130mm travel is damped by a RockShox Monarch R air-spring rear shock that’s paired with a 130mm travel RockShox Recon RL fork.</p>\n<p>Elsewhere you get SRAM’s 12-speed SX Eagle drivetrain and SRAM Level T brakes. There are also WTB branded rims and tyres.</p>\n<p>The kit on this bike is amazingly sorted for the cash, and the places where Calibre has saved money will give you a clear path to upgrade this into an even better machine.</p>\n<p>Out on the trail, the Bossnut left us wondering whether, for the money, any other bikes can even compete. Granted, it’s not perfect, but it’s about as close as you’ll find for the cash.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/2020-calibre-bossnut-review/\">Read our full Calibre Bossnut review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Calibre Line 29</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Calibre has made a name for itself as the brand to beat when it comes to affordable bikes in the UK.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<ul><li>£905 as tested</li>\n<li>Stable geometry inspires confidence on tough terrain</li>\n<li>Great spec list includes a dropper post</li>\n<li>Short seat tube might not be suitable for tallest riders</li>\n</ul><p>Building on Calibre’s fantastic success thanks to its top-value and high-performing <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/calibre-rake-review/\">Rake</a>, <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/calibre-line-10-review/\">Line 10</a>, <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/2020-calibre-bossnut-review/\">Bossnut</a> and <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/calibre-sentry-first-ride-review/\">Sentry</a> models, the Line 29 takes the brand’s well-known formula for success and applies modern, progressive geometry to the mix.</p>\n<p>Unsurprisingly, the utilitarian but highly functional frame is loaded with fantastic kit including SRAM’s NX 11-speed drivetrain, Guide T brakes and a 122m travel dropper post from KS. It’s also specced with RockShox’ Recon RL fork with Motion Control damper.</p>\n<p>On the trail, the great geometry combines with the generous spec to form a bike that feels confident and composed on techy descents, riding predictably and demonstrating that a circa £900 bike needn’t be ridden conservatively.</p>\n<p>A few spec changes, such as the tyres, and the Line 29 will be just as handy riding XC as it is on the descents. For the money, it’s a truly impressive performer.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/calibre-line-29-review/\">Read our full review of the Calibre Line 29</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Voodoo Bizango Carbon</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> With a carbon frame and solid spec, you’d be forgiven for thinking the Bizango was twice the price.</span></figcaption><span> <i>Andy Lloyd</i></span></div>\n<ul><li>£1,000 as tested</li>\n<li>Superb XC performance and good weight for the price</li>\n<li>Modern geometry makes it trail-capable</li>\n<li>Good choice of top components</li>\n</ul><p>The carbon-framed Bizango looks like a much more expensive rig thanks to its internally routed cables, modern geometry and sleek, uninterrupted lines. It’s 1x specific – so no front mech – and this helps improve its stiffness.</p>\n<p>The great-looking frame is specced with top-choice parts, too. Shimano’s MT-400 brakes, SRAM’s 12-speed XS Eagle drivetrain and a RockShox Judy fork combine to propel the Bizango beyond cross-country-only rides.</p>\n<p>It gives more expensive XC bikes a run for their money and leaves its rider with few excuses for not keeping up.</p>\n<p>The geometry helps it descend confidently but the carbon frame lacks comfort when riding. Although, for the price, there’s very little that rivals the Bizango Carbon.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/voodoo-bizango-carbon-review/\">Read our full Voodoo Bizango Carbon review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Cannondale Trail SE 4</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Cannondale Trail SE4 has sleek looks.</span></figcaption><span> <i>Ian Linton / Immediate Media</i></span></div>\n<ul><li>£900 as tested</li>\n<li>Potential to upgrade</li>\n<li>Smooth climbing and descending</li>\n<li>Shimano Deore groupset</li>\n</ul><p>Designed for low-impact trials, the Cannondale Trail SE 4 still has potential for bigger things thanks to Boost spacing and dropper post compatibility.</p>\n<p>The Boost spacing means you can upgrade the wheels down the line and the tapered head tube makes the Trail SE 4 compatible with lots of forks.</p>\n<p>But built as it is, the bike still delivers a smooth ride. Part of the smoothness results from the dropped seatstays, but the coil-sprung Suntour front fork also feels supple.</p>\n<p>The bike has an XC-inspired geometry. It is fairly low and aggressive when seated, but you feel much more upright out of the saddle. It takes a lot for the front wheel to lose traction on ascents and downhill it’s easy to control.</p>\n<p>Shimano Deore gives the bike a good range of gears and the Shimano Alivio brakes do a good job of helping this bike achieve its easy ride feel.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/cannondale-trail-se-4-review/\">Read our full Cannondale Trail SE 4 review </a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Carrera Titan X</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Titan X has great suspension and parts for the price, but dated geometry holds it back.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<ul><li>£850 as tested</li>\n<li>Better equipped than virtually anything else at this price</li>\n<li>Rear suspension is good for the money</li>\n<li>Offers a genuine advantage over hardtails on rough terrain.</li>\n</ul><p>When Halfords originally developed this bike, the goal was to make a full-suspension mountain bike with a 12-speed drivetrain and a dropper post for under a grand.</p>\n<p>Needless to say, we were left scratching our heads as to how the brand would do it. Even more astonishingly then, it not only achieved that goal, but for £850.</p>\n<p>How exactly has Halfords achieved it? Well, it’s certainly not the most refined-looking package, but this doesn’t affect performance on the trail, so we think that’s one compromise worth making.</p>\n<p>The geometry might not be as progressive as pricier options, but it’s by no means a throwback and it impresses on both climbs and descents.</p>\n<p>The dropper post is a big performance gain too, and while the handling over technical terrain isn’t the best available, there’s no getting past how good the kit is on this bike for the price.</p>\n<p>Our only major concern is that the three-size range won’t accommodate the smallest or tallest riders out there. But for people around the middle of the curve, this won’t be an issue.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/carrera-titan-x-review/\" target=\"_blank\">Read our full review of the Carrera Titan X</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Jamis Dakar A2</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Jamis Dakar is slightly dated but still shines on the trail.</span></figcaption><span> <i>Oli Woodman / Russell Burton</i></span></div>\n</div>\n<ul><li>£1,095 as tested</li>\n<li>Well-equipped build</li>\n<li>Impressively controlled suspension</li>\n<li>Nicely finished but slightly dated frame</li>\n</ul><p>Another top value bike is the Jamis Dakar A2. It wasn’t quite capable of dethroning the Calibre Bossnut from its top spot but it sure came close.</p>\n<p>Like the Bossnut, the Dakar comes with an enviable spec for the money, but we were a little disappointed to see a QR fork.</p>\n<p>We praised the Dakar for its controlled suspension, well-balanced handling and top component choices. We were also very impressed with the finish of the frame with its triple-butted tubes, tapered head-tube and internal cable routing.</p>\n<p>Although progressive for a budget bike, the geometry on the Jamis (and indeed the Calibre) is conservative in terms of reach, and for some people that can be a bit of a sticking point.</p>\n<p>All things considered, this is still a really good way to spend £1,000 on a mountain bike.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/jamis-dakar-a2-review/\">Read our full review of the Jamis Dakar A2</a></li>\n</ul><div>\n    <h5>Latest deals for the Jamis Dakar A2</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Vitus Sentier 29</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> By combining well-chosen parts with well-balanced geometry, Vitus has created a fun and versatile bike in the Sentier.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<ul><li>£850 as tested</li>\n<li>Great-performing, well-chosen spec for the price</li>\n<li>Good geometry and plenty of space make the bike comfortable on a wide range of terrain</li>\n<li>The fork might need upgrading as your abilities improve</li>\n</ul><p>Although the frame is fairly basic and doesn’t have full-length outer gear cable routing – the inner gear cable is exposed under the top tube and seatstay — it does have internal dropper post cable routing for future upgrades.</p>\n<p>With a 10-speed Shimano Deore drivetrain that uses a SunRace cassette, Tektro brakes and WTB <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless-ready</a> wheels wrapped in Schwalbe tyres, it’s easy to forgive the Sentier for its lack of dropper post.</p>\n<p>The X-Fusion RC32 fork performs okay once it’s into its travel but struggles with off-the-top suppleness. However, the headline 13.26kg weight makes this one of the lightest bikes in the sub-£1,000 category.</p>\n<p>The geometry isn’t as progressive as <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/calibre-line-29-review/\">Calibre’s Line 29</a> but still looks pretty good for a trail bike and the ride confirms this with snappy handling making it fun to take sharp turns or just ride mellower trails.</p>\n<p>Going for a slightly larger size than recommended should improve handling if you’re looking to shred, but the Sentier is better-suited to tamer trails.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/vitus-sentier-29-review/\">Read our full Vitus Sentier 29 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Also consider…</h2>\n<h3>Specialized Fuse 27.5</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>3.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Fuse frame, with its smooth welds and rich paintwork, looks sleek and reassuringly expensive up close.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<ul><li>£999 as tested</li>\n<li>Comfortable and confident on rough terrain</li>\n<li>Plus-size tyres and a dropper post included</li>\n<li>XL bike feels cramped</li>\n</ul><p>Our tester found the Specialized Fuse hardtail to be a comfortable bike to ride. The plus size tyres offer plenty of grip and the 1x drivetrain and dropper post perform well.</p>\n<p>Even though our tester struggled with the sizing on the XL bike being too small for his 192cm height, this issue is likely to be less pronounced for people who aren’t as tall.</p>\n<p>If that’s you and you have your heart set on a bike from the <em>Big S</em>, the Fuse 27.5 is worth a look.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/specialized-fuse-27-5-review/\">Read our full Specialized Fuse 27.5 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<section><div>\n        <h2>Have you found what you’re looking for? </h2>\n<p>If £1,000 is a bit too much money, <a href=\"https://www.bikeradar.com/features/the-best-mountain-bikes-under-750/\">the best mountain bikes under £750</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-best-mountain-bikes-under-500/\">the best mountain bikes under £500</a> still offer great performance and are ideal if you’re just starting out or buying for someone who is.</p>\n<p>Otherwise, if this list has whetted your appetite and you think you could stretch your budget a little further, check out our list of <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-best-mountain-bikes-under-2000/\">the best mountain bikes under £2,000</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bikes-under-3000/\">the best mountain bikes under £3,000</a>. </p>\n<p>Still need a bit more info to help you decide? Make sure to check out our guide on <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">how to choose the right mountain bike for you</a>, with tips on what to look for in a mountain bike from suspension and gears to different types of riding.  </p>\n<p>\n\n    </p></div>\n    </section>","author":"Alex Evans","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"3915d957b4eeaf2465c4cb54da6eb53f90e1c576217448b987b7ba33bf1c8409","category":"Cycling"}