{"title":"Comparison between Ultrasonographic-Guided Temporal and Coronoid Approaches for Trigeminal Nerve Block in Dogs: A Cadaveric Study","link":"https://www.preprints.org/manuscript/202405.0557/v1","date":1715238967000,"content":"The trigeminal nerve is responsible for innervating the periorbita. Ultrasound-guided trigeminal block is employed in humans for trigeminal neuralgia or periorbital surgery. There are no studies evaluating this block in dogs. This study aims to evaluate and compare two approaches (coronoid and temporal) of the trigeminal nerve block. We hypothesized superior staining with the coronoid approach. Thirteen dog heads were used. After a preliminary anatomical study, two ultrasound-guided injections per head (right and left, coronoid and temporal approach, randomly assigned), with an injectate volume of 0.15 mL cm-1 of cranial length were performed (iodate contrast and tissue dye mixture). The ultrasound probe was placed over the temporal region, visualizing the pterygopalatine fossa. For the temporal approach, the needle was advanced from the medial aspect of the temporal region in a dorsoventral direction. For the coronoid approach, it was advanced ventral to the zygomatic arch in a lateromedial direction. CT scans and dissections were conducted to assess and compare the position of the needle, spread of injectate, and nerve staining. No significant differences were found. Both approaches demonstrated effective interfascial distribution of injectate, with some minimal intracranial spread. Although the coronoid approach did not yield superior staining as hypothesized, it presents a viable alternative to the temporal approach. Studies in live animals are warranted to evaluate clinical efficacy and safety.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3916c5a3c75eb6f745c581d5f353faa234d834a5e169d1ae6a6823c9e50c9c22","category":"Interdisciplinary"}