{"title":"Apple backtracks, reinstates Epic Games’ iOS developer account in Europe","link":"https://arstechnica.com/?p=2008964","date":1709923909000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/fortnite-rainbow-crossroads-800x450.jpg\" alt=\"Artist's conception of Epic Games celebrating their impending return to iOS in Europe.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/fortnite-rainbow-crossroads.jpg\">Enlarge</a> <span>/</span> Artist's conception of Epic Games celebrating their impending return to iOS in Europe. (credit: Epic Games)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Apple has agreed to reinstate Epic Game's Swedish iOS developer account just days after Epic publicized Apple's decision to rescind that account. The move once again paves the way for Epic's plans to release a sideloadable version of the Epic Games Store and <em>Fortnite</em> on iOS devices in Europe.</p>\n<p>\"Following conversations with Epic, they have committed to follow the rules, including our DMA policies,\" Apple said in a statement provided to Ars Technica. \"As a result, Epic Sweden AB has been permitted to re-sign the developer agreement and accepted into the Apple Developer Program.\"</p>\n<p>Apple's new statement is in stark contrast to its position earlier this week when it cited \"Epic’s egregious breach of its contractual obligations to Apple\" as a reason why it couldn't trust Epic's commitments to stand by any new developer agreement. In correspondence with Epic shared by the <em>Fortnite</em> maker Wednesday, Apple executive Phil Schiller put an even finer point on it:</p></div><p><a href=\"https://arstechnica.com/?p=2008964#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2008964&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"39181d73831c3baa1dfc2579ad31aa8f9625840717d05e5a7c2860e4974c8f5c","category":"Tech"}