{"title":"Isolation and Characterization of a Bacteriophage with Potential for the Control of Multidrug-Resistant Salmonella Strains Encoding Virulence Factors Associated with the Promotion of Precancerous Lesions","link":"https://www.preprints.org/manuscript/202409.1483/v1","date":1726735270000,"content":"Antimicrobial-resistant bacteria represent a serious threat to public health. Among these bacteria, Salmonella is of high priority because of its morbidity levels and its ability to induce different types of cancer. Aim: This study aimed to identify Salmonella strains encoding genes linked to the promotion of precancerous lesions and to isolate a bacteriophage to evaluating its preclinical potential against these bacteria. Methodology: An epidemiological approach based on wastewater analysis was employed to isolate Salmonella strains and detect genes associated with the induction of precancerous lesions. Antimicrobial susceptibility was assessed by disk diffusion method. A bacteriophage was isolated via the double agar technique, and its morphological characteristics, stability, host range, replication dynamics and ability to control Salmonella under different conditions were evaluated. The bacteriophage genome was sequenced and analyzed using bioinformatics tools. Results: Thirty-seven Salmonella strains were isolated, 17 of which contained the five genes associated with precancerous lesions induction. These strains exhibited resistance to multiple antimicrobials, including fluoroquinolones. A bacteriophage from the Au-tographiviridae family with lytic activity against 21 bacterial strains was isolated. This phage ex-hibited a 20 min replication cycle, releasing 52 ± 3 virions per infected cell. It demonstrated sta-bility and efficacy in reducing Salmonella concentration in simulated gastrointestinal conditions, and its genome lacked genes that represent a biosafety risk. Conclusion: This bacteriophage shows promising preclinical potential as a biotherapeutic agent against Salmonella.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"392120b5ede72205d6f328757d5b5745da0f61fa2fe3b6921ccf795e14480792","category":"Interdisciplinary"}