{"title":"Why a bigger screen could be a giant misstep for the iPad Pro","link":"https://www.macworld.com/article/349797/why-a-bigger-screen-could-be-a-giant-misstep-for-the-ipad-pro.html","date":1624913074000,"content":"\n<div>\n<section><div></div></section><p>Mark Gurman knows his stuff when it comes to Apple rumors. AppleTrack, which monitors analysts’ hits and misses, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://appletrack.com/mark-gurman/&amp;xcust=1-1-349797-0-0-0&amp;sref=https://www.macworld.com/feed\">currently rates him as 89.1 percent accurate</a>, so his recent claim that <a href=\"https://www.macworld.com/article/349742/ipad-pro-14-inch-16-inch-rumors.html\">Apple is working on a giant iPad</a> is probably sound. </p>\n\n\n\n<p>It’s worth stressing, however, that just because Cupertino’s engineers are working on something doesn’t mean it will actually ship. (<a href=\"https://www.macworld.com/article/230469/apple-airpower-features-specs-price-faq.html\">See AirPower</a><a href=\"https://www.macworld.co.uk/news/airpower-release-date-3664127/%5d.\" target=\"_blank\">.</a>) And even if it does launch, that doesn’t mean it was a good idea. (<a href=\"https://www.macworld.co.uk/review/magic-mouse-2-review-3628178/\">See Magic Mouse.</a>)</p>\n\n\n\n<p>It would certainly be bold for Apple to smash the 12.9-inch ceiling it has historically placed on its iPad screens. That form factor made its debut in 2015 on <a href=\"https://www.macworld.com/article/226878/ipad-pro-review-why-the-best-ipad-yet-wont-work-for-everyone.html\">the very first iPad Pro model</a> and has remained the same ever since, even as <a href=\"https://www.macworld.co.uk/review/xs-max-3684563/\">iPhones</a> and <a href=\"https://www.macworld.com/article/234771/ipad-air-2020-review.html\">mid-size iPads</a> have steadily increased in size. The home button disappeared, bezels got smaller, but the flagship iPad Pro has kept its screen exactly the same size, choosing instead to make its chassis smaller, as if to say there aren’t any benefits to be had from going any bigger. </p>\n\n\n\n<p>And having used every possible size of iPad, I wonder if maybe there aren’t.</p>\n\n\n\n<h2>What is an iPad for?</h2>\n\n\n\n<p>The iPad is a successful product because it caters brilliantly to a specific but universal use case: picking up a portable device from a side table that’s big enough to comfortably consume digital content (games, Netflix, the web, etc.) with the bare minimum of friction. </p>\n\n\n\n<p>Of course, a device that caters to numerous use cases can be successful too, as we’ve seen with the iPhone, but trying to be all things to all users is a gamble with larger-format devices. And Apple would tell us that the iPad is much more than a “sit back” media consumption device and that it can replace the laptop as a work device. I agree: it is, and it can. In some industries, in fact, the replacement process has somewhat happened already, such as logistics and hospitality where mobile work requires relatively light tasks away from a desk that somewhat mimics the iPad’s leisure uses.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-smart-connector.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>A larger iPad Pro would need to be docked nearly all of the time.</figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>But the iPad’s core role of sofa companion is the one that brings home the bacon, and the further Apple has drifted from the iPad described above, the fewer units it’s sold. The 12.9-inch iPad Pro is a case in point: a minority-interest niche product that’s too powerful and expensive to waste on digital dabbling, and too big and too precious to carry around casually.</p>\n\n\n\n<p>If the current Pro models are a compromise too far for most customers, imagine what would happen if Apple bumped them up to 14 inches or even 16 inches. It would be turning the iPad into something else entirely. Yes, this would create a device that—we would assume—is superb for digital illustration and photo editing, and other creative work. But Apple would be ratcheting up the price tag even higher, and making it far less portable, and far more likely to be confined to a workspace.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-IPad-Air-compare.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The iPad Air is arguably better than the 12.9-inch iPad Pro at most of the things people use a tablet to do.</figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>While that would succeed in finally separating the iPad Pro from the rest of the models, it would do so at a cost. Apple would be fundamentally undermining the core concept of the iPad Pro—that it’s more portable and flexible than a Mac—and creating a product most people wouldn’t need or want. </p>\n\n\n\n<h2>The versatility trap</h2>\n\n\n\n<p>One of the key planks of <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2021-06-27/big-ipads-apple-car-changes-amazon-ar-glasses-inside-big-tech-labs&amp;xcust=1-1-349797-0-0-0&amp;sref=https://www.macworld.com/feed\">Gurman’s argument in favor of an oversized iPad</a> is versatility: he wants a device that can be both laptop and tablet. The 12.9-inch iPad Pro should be able to do that, but Gurman argues the current screen “is far too small for someone accustomed to a 16-inch MacBook Pro.” But would a bigger iPad Pro be able to handle both of these jobs? And if so, how well?</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-front.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The iPad Pro’s interface hasn’t changed all the much, even after iPadOS 15 introduces the App Library.</p></figcaption></figure><p>Dominik Tomaszewski/IDG</p></div>\n\n\n\n<p>First, the iPadOS interface and ecosystem aren’t as conducive to digital productivity as macOS. Gurman admits this, saying Apple “needs to allow Mac apps and Mac-like multitasking with more flexible arrangements of app windows,” but Apple hasn’t yet shown a willingness to evolve iPadOS beyond what it is. Plus, a vastly expensive 16-inch tablet wouldn’t be as convenient for media consumption as the 10.9-inch iPad Air. Consequently, we take a device that does one thing very well and turn it into a device that does two things less well. </p>\n\n\n\n<p>Convergence is going to happen, and in 10 years’ time, I can’t imagine that many people will own a smartphone and a tablet, and a laptop. But to get to that point, Apple’s engineers are going to have to find a way to gain the advantages of the new form without losing the advantages of the old one. Maybe that will come through folding screens, better accessories, or improvements to iPadOS. </p>\n\n\n\n<p>But until we get there, a giant iPad would be a giant mistake that risks undermining what makes the iPad so great to begin with. </p>\n</div>","author":"David Price","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3923a0cdf405f522d6acd17c536c302d314b0ec90f2325ab81556589e14993aa","category":"Apple"}