{"title":"Beginner’s guide to indoor cycling: all you need to get started","link":"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/","date":1698071400000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beginners-guide-to-indoor-training-6e379d1.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beginners-guide-to-indoor-training-6e379d1.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beginners-guide-to-indoor-training-6e379d1.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beginners-guide-to-indoor-training-6e379d1.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beginners-guide-to-indoor-training-6e379d1.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beginners-guide-to-indoor-training-6e379d1.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beginners-guide-to-indoor-training-6e379d1.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beginners-guide-to-indoor-training-6e379d1.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beginners-guide-to-indoor-training-6e379d1.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/08/Beginners-guide-to-indoor-training-6e379d1.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Beginner's guide to indoor training\" title=\"Beginner's guide to indoor training\" />                                            <p>While we all agree that cycling outdoors is wonderful, it’s not always possible to get outside. Indoor training gives you the chance to turn the pedals and top up your fitness when it’s difficult to head out.</p>\n<p>There are a variety of reasons to consider indoor cycling and <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-cycling-benefits/\">numerous benefits</a>: it’s convenient, time-efficient, not weather-dependent and you won’t end up with a <a href=\"https://www.bikeradar.com/features/clean-your-bike-in-7-simple-steps/\">dirty bike</a>. Plus, you can do targeted workouts to improve your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/5-ways-to-improve-your-cycling-endurance/\">endurance</a>, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/average-speed-cycling\">speed</a>, cardiovascular fitness, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/vo2-max\">VO2 max</a> and more without the distractions of traffic or inclement weather.</p>\n<p>If you’re new to the world of indoor cycling, you can be faced with a dazzling array of pricey equipment and accessories. However, it’s perfectly possible to get an <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-zwift-setups-for-every-rider/\">indoor training setup</a> without breaking the bank.</p>\n<p>As a general rule, the more you spend, the quieter and more realistic your trainer setup will be. Step into the world of smart trainers and you’ll get accurate power measurement, plus features such as <a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">cadence</a> sensors and adjustable resistance to simulate climbing or target specific <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zones</a>.</p>\n<p>Our guide to indoor cycling will take you through everything you need to get started. Once you’ve got going, our <a href=\"https://www.bikeradar.com/advice/fitness-and-training/top-5-indoor-training-tips/\">top five indoor training tips</a> will help you progress further.</p>\n<h2>Choose your preferred type of trainer</h2>\n<p>Indoor trainers fall into three broad categories – basic ‘turbo’ trainers, smart trainers and smart bikes (also known as static bikes, or <a href=\"https://www.bikeradar.com/advice/buyers-guides/indoor-bikes/\">indoor bikes</a>).</p>\n<p>Here, we outline the differences between the three common types of trainer and between wheel-on and direct-drive trainers.</p>\n<h3>Turbo trainer</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Tacx Boost turbo trainer\" title=\"Tacx Boost turbo trainer\" />\n\n</div><div><figcaption><span><i></i> Your rear wheel stays on to ride cheaper turbo trainers.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Turbo trainers are the most common type of indoor trainer.</p>\n<p>They range in price, features and complexity, from <a href=\"https://www.bikeradar.com/news/cheap-smart-trainers/\">simple budget choices</a> to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">best smart trainers</a> (more below) with all the bells and whistles.</p>\n<p>All turbo trainers require a bike to work.</p>\n<p>Almost all turbo trainers are wheel-on. This means the bike fits onto the trainer with a skewer through the rear axle. The rear wheel then rests against a drum, which spins when you start to pedal.</p>\n<p>This drum is connected to a resistance unit. Unlike a smart trainer, the amount of resistance this provides is controlled manually by the rider.</p>\n<p>Unless you’ve got a <a href=\"https://www.bikeradar.com/features/best-power-meters-9-tested/\">power meter</a> on your bike, using your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/power-vs-heart-rate/\">heart rate zones</a> will be the most affordable and accessible route to training with data on a standard turbo trainer.</p>\n<p>A wheel-on trainer can wear down a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">grippy racing tyre</a>, so you may want to consider using harder-compound <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-road-bike-tyres/\">winter bike tyres</a> or purchasing a trainer-specific tyre and popping that on a spare back wheel instead. Direct-drive turbo trainers <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/lemond-fitness-revolution-trainer-review/\">do exist</a> but they are exceptionally rare.</p>\n<h3>Smart trainer</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Hub\" title=\"Zwift Hub\" />\n\n</div><div><figcaption><span><i></i> Smart trainers provide a more interactive riding experience.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<div></div>\n<p>Smart trainers automatically increase and decrease the resistance to simulate changes in gradient or to give you a harder, more immersive workout.</p>\n<p>It’s this functionality that enables <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">indoor cycling apps</a> such as <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\" target=\"_blank\">Zwift</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/rgt-cycling-guide/\" target=\"_blank\">RGT Cycling</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/rouvy-everything-you-need-to-know/\">Rouvy</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/wahoo-systm-guide/\">Wahoo SYSTM t</a>o recreate the elevation profile (and other dynamic riding elements) of virtual courses or races.</p>\n<p>You can either change gear yourself or use <a href=\"https://www.bikeradar.com/advice/fitness-and-training/erg-mode/\">ERG mode</a>, which holds you to a determined level of power output.</p>\n<p>This is ideal when targeting specific power or heart rate <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zones</a> if you pair your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-choose-a-heart-rate-monitor/\">heart rate monitor</a> with the smart trainer. If you’re serious about indoor training, a smart trainer is well worth the investment.</p>\n<p>Smart trainers are available in wheel-on (as found with most turbo trainers) or direct-drive styles.</p>\n<p>Direct-drive smart trainers have a cassette attached to the trainer and replace your rear wheel. The trainer will feature a cassette with a skewer through the rear dropouts/thru-axle mounting the bike to the trainer.</p>\n<p>The advantage here is not having to worry about wearing out your rear tyre: you can just pop your wheel back in when you want to take your bike for a ride outside. Direct-drive smart trainers are often quieter and offer a more realistic ride feel when pedalling.</p>\n<p>Direct-drive smart trainers are generally more expensive than wheel-on trainers.</p>\n<h3>Rollers</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Simon Bromley riding on rollers\" title=\"Simon Bromley riding on rollers\" />\n\n</div><div><figcaption><span><i></i> Once you relax, you will quickly ease into riding on rollers.</span></figcaption><span> <i>BikeRadar / Immediate Media</i></span></div>\n<p>Rollers consist of two parabolic free-spinning cylinders on which the bike stands. When you start pedalling, the cylinders rotate to simulate the ground moving beneath your wheels.</p>\n<p>Since there is nothing holding the bike upright other than momentum from pedalling, they give a more natural-feeling ride.</p>\n<p>This is both an advantage and disadvantage: it’s great for improving <a href=\"https://www.bikeradar.com/advice/fitness-and-training/banish-back-pain-with-these-10-simple-exercises-anyone-can-try/\">core strength</a> and balance, but can be tricky to get started.</p>\n<p>If you don’t know <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-on-rollers/\">how to ride on rollers</a> you should try it the first few times near something you can hold on to.</p>\n<p>Rollers are also compact and relatively easy to pack away, useful if you’re short on space at home.</p>\n<h3>Indoor bike</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Kickr Bike\" title=\"Wahoo Kickr Bike\" />\n\n</div><div><figcaption><span><i></i> A smart bike requires a big budget and plenty of space.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>If you want to splurge on your setup, you can buy a high-tech <a href=\"https://www.bikeradar.com/advice/buyers-guides/indoor-bikes/\">smart bike</a> that’s designed solely for indoor cycle training.</p>\n<p>These aren’t your regular gym or spin-class bikes, they will usually offer the ability to monitor your power output, measure your pedal stroke, cadence and heart rate, automatically control resistance, and much more.</p>\n<p>They are the most expensive option for indoor training but, arguably, offer the most convenient solution.</p>\n<h2>Find the right training space</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Man riding a smart trainer\" title=\"Best smart trainer 2022\" />\n\n</div><div><figcaption><span><i></i> Your indoor training setup determines how enjoyable and effective your turbo sessions are.</span></figcaption><span> <i>BikeRadar / Immediate Media</i></span></div>\n<p>Once you’ve settled on a trainer, you need to find somewhere to put it.</p>\n<p>Some people go all-out, turning their garage into a ‘<a href=\"https://www.bikeradar.com/advice/fitness-and-training/tips-for-building-the-ideal-indoor-training-space/\">pain cave</a>’ dedicated to hours of indoor cycling.</p>\n<p>However, if you’re just getting started, you don’t need to go quite that far.</p>\n<p>You’ll need an area, ideally inside or at least sheltered, in which you can set up your bike and trainer, plus a little shelf or table at the front.</p>\n<p>You ideally want sufficient space such that you can leave your smart trainer set up to make hopping on for a quick session more efficient.</p>\n<p>Bear in mind that the equipment is fairly heavy and that you are likely to sweat a fair bit, so a wipe-clean floor is preferable to a carpeted area.</p>\n<p>If you only have a carpeted area, put down a mat first to protect it.</p>\n<p>If you’re planning on using rollers rather than a turbo trainer (more on each below) then unless you are already skilled in getting started on them, you may prefer to set up near a surface you can hold on to or in a door frame.</p>\n<p>The other thing to consider is noise. Indoor trainers, especially cheaper models, can be quite noisy machines and you’ll be standing up and powering along on it while you’re training.</p>\n<p>If you live in a shared house, you may want to keep it away from quieter spaces, or find a relatively well sound-proofed room to do your workout.</p>\n<h2>Get the right indoor training accessories</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Simon von Bromley riding a time trial bike indoors on a smart trainer\" title=\"20220103_SB_5DSR_MG_4974\" />\n\n</div><div><figcaption><span><i></i> A fan is a must for indoor training.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>As our guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/turbo-trainer-accessories/\">best turbo trainer accessories</a> explains, indoor cycling is hot, thirsty work and you are likely to sweat buckets. Make sure you have a bottle (or two) of water in easy reach so you can drink as you train.</p>\n<p>During longer or intense workouts, or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-racing/\">Zwift racing</a>, you may need to take on fuel. Consider keeping <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-energy-bars/\">energy bars,</a> <a href=\"https://www.bikeradar.com/advice/nutrition/best-energy-gels-for-cycling/\">energy gels</a> and/or an <a href=\"https://www.bikeradar.com/advice/nutrition/best-energy-drinks-for-cycling/\">energy drink </a>to hand.</p>\n<div></div>\n<p>Once you’ve got a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-water-bottles/\">water bottle</a> sorted, the second most important accessory is a fan. Because there’s no wind to keep you cool like the great outdoors, you’ll generate an unsustainable amount of excess heat while working hard indoors, even on a cold day.</p>\n<p>A fan helps your body use its natural mechanisms to keep you from overheating and is, in our opinion, an essential piece of kit for indoor cycling.</p>\n<p>Otherwise, you can buy mats to place under your trainer, which offer a few benefits: a mat keeps the setup stable and prevents it moving about on a slippy floor. It’ll protect the floor and stop it getting soaked too. It will also help reduce vibrations and noise, especially if you have wooden floors.</p>\n<p>If you don’t have a trainer mat, consider putting an old towel underneath the bike and trainer instead.</p>\n<p>Keep another towel on the handlebar to catch drips and wipe that hard-earned sweat from your brow (and neck, and chest, and back…). You can even buy a special sheet that fits over your bars and top tube to catch those errant drips before they hit your bike’s paintwork.</p>\n<p>If you’ve decided to follow an online workout or use a virtual cycling app, you’ll need to have a screen or laptop set up in front of you, so may need a table or mount.</p>\n<p>You might also find a set of speakers or headphones are necessary to hear what’s going on, particularly if your trainer is loud.</p>\n<h2>Find a workout</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Workout of the Week\" title=\"Zwift Workout of the Week\" />\n\n</div><div><figcaption><span><i></i> Indoor training apps have huge workout libraries.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>While you can hop on and spin away while listening to music, <a href=\"https://www.bikeradar.com/features/16-of-the-best-cycling-movies-about-roadies/\">watching your favourite cycling film</a> or tuning into a TV show, you’ll get a much more efficient and targeted workout if you follow a structured training session.</p>\n<p>We’ve got guides to the best <a href=\"https://www.bikeradar.com/advice/fitness-and-training/60-minute-turbo-training-sessions/\">60-minute turbo trainer workouts</a> and <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">HIIT (High-Intensity Interval Training) sessions</a>.</p>\n<p>Still, while there are undoubtedly <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-cycling-benefits/\">benefits to cycling indoors</a>, it can feel like a chore – particularly if slogging it out during a tough training session. Handily, there are a few different things you can try to make it a bit more… fun.</p>\n<p>We’ve already mentioned virtual cycling apps such as Zwift, but this is where they really come into their own. An interactive training app can help provide the motivation and structure you need to thrive.</p>\n<p>With a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-zwift-setups-for-every-rider/\">Zwift setup</a>, you can simply free-ride around the virtual worlds, or do intervals from <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-workouts-training-plans-zwift/\">Zwift’s library of structured workouts and training plans</a>.</p>\n<p>Zwift is also becoming increasingly popular with professional athletes, so you may spot the odd cycling star spinning past you.</p>\n<p>Platforms such as <a href=\"https://www.bikeradar.com/reviews/training/training-software/trainerroad-training-software-review/\">TrainerRoad</a> are focused solely on training. Therefore, if you’re not interested in the gamified aspects of an app such as Zwift and just want to get in a hard workout, one of these two might be more suited to your tastes.</p>\n<h2>Do a fitness test, then repeat</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Aero versus climbing wheels\" title=\"Aero versus climbing wheels - 07\" />\n\n</div><div><figcaption><span><i></i> A fitness test can be done indoors or on the road.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>We’re not going to lie, this is going to hurt.</p>\n<p>A baseline fitness test is, however, very useful for establishing your power or heart rate zones so you know what to aim for when training.</p>\n<p>It’s also a good marker to check your fitness progression against, and update your training accordingly to ensure you’re getting the most out of your time on the bike.</p>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">Functional Threshold Power (FTP)</a> – or, in other words, how hard you can ride for an hour – is the figure riders normally measure during a fitness test. However, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/critical-power/\">critical power</a> is a more than viable alternative.</p>\n<p>Fortunately, you don’t need to ride full-gas for 60 minutes to determine your FTP. Virtual training apps offer a range of condensed tests. By <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-take-ftp-test-zwift/\">taking an FTP test on Zwift</a>, you can establish a baseline in no time at all.</p>\n<p>It will still hurt, though.</p>\n<h2>Decide how often and how much you want to train</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"An athlete's training schedule in TrainerRoad's adaptive training feature\" title=\"TrainerRoad adaptive training\" />\n\n</div><div><figcaption><span><i></i> A training plan doesn’t have to be rigid to keep you committed.</span></figcaption><span> <i>TrainerRoad</i></span></div>\n<p>In order to <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-plan-your-winter-training/\">plan your winter training</a>, think about the timing and regularity of your sessions.</p>\n<p>The time of day when you work out is largely going to be determined by what fits in with your lifestyle and preferences.</p>\n<p>Some people find they work out better in the morning, others in the evening. If you’ve got other commitments such as work, family, socialising, hobbies and so on, it may be a case of fitting in a session when you can.</p>\n<p>On the other hand, establishing a set routine can maintain your motivation.</p>\n<p>That’s not always possible, though, so the first thing worth noting is that anything you do is better than nothing – 30 minutes three or four times a week is worth more than a rare two-hour session.</p>\n<p>A good baseline to aim for is three 30 to 40-minute focused sessions a week, with some longer rides outside on the weekend or your days off work.</p>\n<p>Most of all, pace yourself, particularly if you are just getting started. You don’t want to go full bore and tire yourself out – <a href=\"https://www.bikeradar.com/advice/fitness-and-training/overtraining-syndrome/\">overtraining</a> is still very much a risk, even if you’re training indoors.</p>\n<p>It’s better to start at a sustainable level and keep it going, then up the duration or frequency of training when you feel you can handle more.</p>","author":"Jack Luke","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"392349f7ba9d557342ea084df229bf46ee0fed0c85f3f0c071c14ae81aa0b16b","category":"Cycling"}