{"title":"watchOS Update Coming Soon With Fix for Apple Watch Battery Drain","link":"https://www.macrumors.com/2023/11/04/watchos-update-to-fix-battery-drain-issue/","date":1699130197000,"content":"Apple is preparing a fix for an issue causing some Apple Watches to experience excessive battery drain after being updated to <a href=\"https://www.macrumors.com/2023/10/25/apple-releases-watchos-10-1/\">watchOS 10.1</a>, the company said today in an internal memo shared with Apple Authorized Service Providers.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/watchOS-16x9.jpeg\" width=\"1600\" height=\"900\" />\r<br />\nIn the memo, which <em>MacRumors</em> obtained from multiple sources, Apple said the issue will be fixed in a watchOS update that is \"coming soon.\" Apple did not provide any additional details in the memo, so it is unclear what the underlying cause of the issue is, how many customers are affected, and if every Apple Watch model is impacted.\r<br />\n\r<br />\nThere have been complaints about this issue from customers across the <a href=\"https://forums.macrumors.com/threads/apple-releases-watchos-10-1-with-double-tap-namedrop-and-more.2408650/post-32666614\">MacRumors Forums</a>, <a href=\"https://discussions.apple.com/thread/255241541\">Apple Support Community</a>, <a href=\"https://www.reddit.com/r/watchos/comments/17gpob9/101_battery_drain/\">Reddit</a>, and <a href=\"https://twitter.com/Martin_J_Cooper/status/1720728159681704166\">X</a> since watchOS 10.1 was released in late October. The issue seems to affect a variety of Apple Watches, ranging from older models like the Apple Watch Series 5 to the latest Apple Watch Ultra 2.\r<br />\n\r<br />\n\"WatchOS 10.1 is killing the battery on my Apple Watch,\" wrote customer Martin Cooper on X. \"100% to 50% in less than 60 mins.\"\r<br />\n\r<br />\nApple's developer release notes for iOS 17.1 <a href=\"https://developer.apple.com/documentation/ios-ipados-release-notes/ios-ipados-17_1-release-notes#Power\">said</a> that update fixed an issue where \"increased power consumption might occur\" when an Apple Watch running watchOS 10.1 is paired with an iPhone running iOS 17, but evidently the Apple Watch battery drain issue has not been completely fixed, so a watchOS update will be necessary.\r<br />\n\r<br />\n<em>MacRumors</em> recently reported that Apple is <a href=\"https://www.macrumors.com/2023/11/02/ios-17-1-1-is-coming/\">preparing to release iOS 17.1.1</a> for the iPhone, and it is likely that the Apple Watch battery drain issue will be fixed in a watchOS 10.1.1 update. However, it is possible that the fix might not arrive until watchOS 10.2, which is currently in beta testing and is expected to be released in December.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 9</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Buy Now)</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/04/watchos-update-to-fix-battery-drain-issue/\">watchOS Update Coming Soon With Fix for Apple Watch Battery Drain</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/watchos-update-coming-soon-with-fix-for-apple-watch-battery-drain.2409877/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3924202c7c22be67eee3e6270b3638e325e9754711ee090dd92beb9a1d3a5c42","category":"Apple"}