{"title":"Spatiotemporal Characteristics of Rainfall over Different Terrain Features in the Middle Reaches of the Yangtze River Basin during the Warm Seasons of 2016–20","link":"http://link.springer.com/10.1007/s00376-023-3034-5","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>Based on hourly rain gauge data during May–September of 2016–20, we analyze the spatiotemporal distributions of total rainfall (TR) and short-duration heavy rainfall (SDHR; hourly rainfall ⩾ 20 mm) and their diurnal variations over the middle reaches of the Yangtze River basin. For all three types of terrain (i.e., mountain, foothill, and plain), the amount of TR and SDHR both maximize in June/July, and the contribution of SDHR to TR (CST) peaks in August (amount: 23%; frequency: 1.74%). Foothill rainfall is characterized by a high TR amount and a high CST (in amount); mountain rainfall is characterized by a high TR frequency but a small CST (in amount); and plain rainfall shows a low TR amount and frequency, but a high CST (in amount). Overall, stations with high TR (amount and frequency) are mainly located over the mountains and in the foothills, while those with high SDHR (amount and frequency) are mainly concentrated in the foothills and plains close to mountainous areas. For all three types of terrain, the diurnal variations of both TR and SDHR exhibit a double peak (weak early morning and strong late afternoon) and a phase shift from the early-morning peak to the late-afternoon peak from May to August. Around the late-afternoon peak, the amount of TR and SDHR in the foothills is larger than over the mountains and plains. The TR intensity in the foothills increases significantly from midnight to afternoon, suggesting that thermal instability may play an important role in this process.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"39257d1b18ad206abcce061336f49f1f5ec7571a321f049f4a3c9ca51ffa451b","category":"Environment"}