{"title":"WWDC 2023: Selling the future and buying time","link":"https://www.macworld.com/article/1934150/wwdc-2023-expectations.html","date":1685442600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>WWDC 2023 is just around the corner and it’s time for the annual exercise where we figuratively handcuff our wrists to our ankles and attempt to pull off an interpretive dance meant to indicate what we think Apple will announce. This is not an exhaustive list, even if it’s a little exhausting how much we’ve talked about some of this already.</p>\n\n\n\n<h2>What to expect</h2>\n\n\n\n<p>WWDC is, of course, always going to have a preview of the upcoming operating systems. You’ll get a preview of the new versions of macOS, iOS, iPadOS, and at least a tired admission that tvOS continues to be an operating system in their lineup.</p>\n\n\n\n<p>The bulk of the time will likely be spent on the much-anticipated headset. Just a few weeks ago <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://daringfireball.net/2023/05/bajarin_wwdc_headset&amp;xcust=1-1-1934150-1-0-0&amp;sref=https://www.macworld.com/feed\">some were speculating</a> whether or not Apple would actually announce the headset at a separate event. Since then, however, Apple has apparently <a href=\"https://www.macworld.com/article/1929455/apple-teases-wwdc-announcements-inviting-vr-outlets.html\">invited XR media outlets to WWDC</a>, which seems like a bit of a tell that the company might be announcing something XR media outlets would be interested in at the event, so expect a headset. You don’t invite reporters from <em>Hog Quarterly</em> to your county fair unless you have some big hog news.</p>\n\n\n\n<p>“Betty Sue Lumpkin has done it again!” [image of giant hog]</p>\n\n\n\n<p>So, while the headset will surely not be released until months later and Apple may not even announce pricing at WWDC, it will demo the device and make its pitch for developing for it.</p>\n\n\n\n<h2>What you might expect</h2>\n\n\n\n<p>A larger MacBook Air is, well, in the air and if it doesn’t get announced later today after this column is released, then it will surely make an appearance at WWDC. The Macalope feels the 11-inch MacBook Air is one of the best Macs ever released but as with smartphones these days it’s go big or go home so Apple is going to add a 15-inch model to the lineup. Are two inches worth 10 minutes in a crowded keynote? Maybe not. It’s perfectly possible the 15-inch MacBook Air is just a press release after the event. It’ll be a nice device for many people, but it’s not as big a deal as Betty Sue’s latest porcine oeuvre.</p>\n\n\n\n<p>What about a Mac Pro?</p>\n\n\n\n<p>No, really, the Macalope is asking. He has no idea. It does seem like Apple will at some point ship a new Mac Pro with Apple silicon, but at this point, we’ve been waiting so long it’s like that extra dipping sauce you asked for at Buffalo Wild Wings an hour ago. Where is it? Is it coming? It doesn’t even matter at this point. You’re not even hungry anymore. You just need closure.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Macalope\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /></figure><p>IDG</p></div>\n\n\n\n<p>Truth be told, the Macalope has never been to a Buffalo Wild Wings. It could be buffet style for all he knows. Or they could just throw all the wings into a huge trough for people to eat out of and the sauces are shot out of fire hoses. Don’t know.</p>\n\n\n\n<p>Likewise, he doesn’t know if a Mac Pro is coming to WWDC.</p>\n\n\n\n<h2>What not to expect</h2>\n\n\n\n<p>Much, if any, mention of AI is probably not going to happen, despite the fact that Apple has repeatedly been warned that it is drastically falling behind in automated ways to pass users information that is absolute baloney. It’s sad that Apple is okay knowing there are people out there thinking that <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://mastodon.social/@jamesthomson/110424746391100061&amp;xcust=1-1-1934150-1-0-0&amp;sref=https://www.macworld.com/feed\">human beings usually have five fingers on each hand</a>, but that’s clearly the company’s decision and we just have to live with it.</p>\n\n\n\n<p>It is antler-bangingly maddening that we repeatedly have to suffer these bouts of groupthink that suggest that Apple is “behind” on technologies that are either not well thought out, not ready for prime time, or both. In any number of instances–from netbooks to tablet computers to smartwatches–Apple declined to rush in with a half-baked concept and then crushed it with the MacBook Air, iPad, and Apple Watch.</p>\n\n\n\n<p>Smart speakers are another, if different, example. For years we heard how the Amazon Echo was a huge hit for Amazon and Apple was nowhere in the smart speaker market. Come to find out that Amazon’s hit is actually a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://arstechnica.com/gadgets/2022/11/amazon-alexa-is-a-colossal-failure-on-pace-to-lose-10-billion-this-year/&amp;xcust=1-1-1934150-1-0-0&amp;sref=https://www.macworld.com/feed\">“colossal failure”</a> that cost the company $3 billion in the first quarter of 2022 alone. Apparently, people don’t want to subscribe to Maruchen ramen via voice. Who knew? The HomePod certainly isn’t a huge hit, but at least Apple’s investment in the line isn’t losing billions of dollars every year.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1928362\">Like Jason Snell</a>, the Macalope thinks Apple’s got time to get a compelling AI story together before we see it made public. This is more likely to be at next year’s WWDC than this year’s and that’s okay.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3925cde5fb9418f6aae0c3d64117337a18036c25dfaafda9093dd44c4bc242e9","category":"Apple"}