{"title":"How natural resources and technological advancements affect environmental quality: Evidence from load capacity factor in N‐11 nations","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12442?af=R","date":1711766349000,"content":"<h2>Abstract</h2>\n<p>The pressing issues of global climate change and environmental degradation necessitate the development of novel sustainable growth models by humanity. The efficacy of growth policy is strongly contingent upon the fundamental principles of productivity, such as efficient resource management. This study contributes to the investigation of the influence of natural resources (NRs) and several indices measuring productive capacity index (CI) on the environment of developing N-11 countries (Bangladesh, Egypt, Indonesia, Iran, Mexico, Nigeria, the Philippines, South Korea, Pakistan, Turkey, and Vietnam) during 2000–2022. The research employed the cross-sectional Autoregressive Distributed Lag (CS-ARDL) model to examine the relationship between the variables. The empirical evidence indicates that there is a positive relationship between CI, technical innovation (TEC), NR, and gross domestic product (GDP) with the load capacity factor (LCF). Evidently, the sub-indicators of CI present diverse results. The enhancement of productive CI in human capital, information, and communication technology (ICT), structural change, and governance has been found to foster ecological sustainability. Conversely, the domains of transport, private sector development, and energy utilization have been observed to contribute to the reduction of environmental pollution. This study posits that enhancing operational efficiencies and productive CI is associated with improved ecological outcomes.</p>","author":"Yaping Guo, \nIbrahim Alnafrah, \nXinmeng Hou, \nReem A. Almenweer, \nUsman Mehmood","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"392b8593b1abf0302a117a8c43bbf2461fb2fb6a98d0f0cc1bdd9eb78a4df87f","category":"Environment"}