{"title":"Xylooligosaccharides from lignocellulosic biomass and their applications as nutraceuticals: a review on their production, purification, and characterization","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13523?af=R","date":1714205285000,"content":"<h2>Abstract</h2>\n<p>Xylooligosaccharides (XOS) are considered a potent source of prebiotics for humans. The global prebiotic market is expanding in size, was valued at USD 6.05 billion in 2021, and is expected to grow at a 14.9% compound annual growth rate between 2022 and 2030, indicating a huge demand. These XOS are non-digestible pentose sugar oligomers comprising mainly xylose. Xylose is naturally present in the lignocellulosic biomass (LCB), fruits and vegetables. Apart from the prebiotic effect, these XOS have been reported to reduce blood cholesterol, possess antioxidant effects, increase calcium absorption, reduce colon cancer risk, and benefit diabetic patients. The primary use of XOS is reported in the feed industry followed by health, medical use, food and drinks. LCB mainly contains glucan, xylan and lignin. After glucan, xylan is the second-highest available sugar on the globe composed of xylose. Therefore, the xylan fraction of LCB has great significance in producing food, feed and energy. Glucan has been exploited for the commercial production of ethanol, xylitol, furfural, hydroxymethyl furfural and glucose. As of now, xylan has limited applications. Therefore, xylan can be exploited to convert to XOS. The production of XOS from LCB fraction not only helps to produce these at a very low price, but also helps in the reduction of greenhouse gases. Its use in food and drinks is increasing as it can be derived from the abundantly and cheaply available LCB. The article provides a review on the production, purification and characterization of XOS in view of their use as nutraceuticals. © 2024 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Ravindra Kumar, \nGeir Næss, \nMette Sørensen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"3931c6bb613de22b7df7a817138e7f9e69765c8c75f06a29fb8065548973ab16","category":"Environment"}