{"title":"Sea butterflies in a pickle: reliable biomarkers and seasonal sensitivity of Limacina retroversa to ocean acidification in the Gulf of Maine","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae040/7696952?rss=1","date":1718928000000,"content":"<span><div>Abstract</div>The passive dissolution of anthropogenically produced CO<sub>2</sub> into the ocean system is reducing ocean pH and changing a suite of chemical equilibria, with negative consequences for some marine organisms, in particular those that bear calcium carbonate shells. Although our monitoring of these chemical changes has improved, we have not developed effective tools to translate observations, which are typically of the pH and carbonate saturation state, into ecologically relevant predictions of biological risks. One potential solution is to develop bioindicators: biological variables with a clear relationship to environmental risk factors that can be used for assessment and management. Thecosomatous pteropods are a group of pelagic shelled marine gastropods, whose biological responses to CO<sub>2</sub> have been suggested as potential bioindicators of ocean acidification owing to their sensitivity to acidification in both the laboratory and the natural environment. Using five CO<sub>2</sub> exposure experiments, occurring across four seasons and running for up to 15 days, we describe a consistent relationship between saturation state, shell transparency and duration of exposure, as well as identify a suite of genes that could be used for biological monitoring with further study. We clarify variations in thecosome responses due to seasonality, resolving prior uncertainties and demonstrating the range of their phenotypic plasticity. These biomarkers of acidification stress can be implemented into ecosystem models and monitoring programmes in regions where pteropods are found, whilst the approach will serve as an example for other regions on how to bridge the gap between point-based chemical monitoring and biologically relevant assessments of ecosystem health.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"3934e2d7657102a628a97303551bd805e7a461d97094ca911905ffe38a44cd74","category":"Environment"}