{"title":"Gizmodo Editor-in-Chief Dan Ackerman Sues Apple, Alleging ‘Tetris’ Movie Ripped Off His Book","link":"https://www.reuters.com/legal/litigation/apples-tetris-movie-ripped-off-tech-writers-book-lawsuit-says-2023-08-08/","date":1691695760000,"content":"\n<p>Blake Brittain, reporting for Reuters:</p>\n\n<blockquote>\n  <p>Dan Ackerman, editor in chief of the tech-news website Gizmodo,\nfiled a lawsuit in Manhattan federal court on Monday accusing\nApple, the Tetris Company and others of adapting his book about\nthe landmark video game Tetris into a feature film without his\npermission. <a href=\"https://fingfx.thomsonreuters.com/gfx/legaldocs/mopajkzbgva/APPLE%20TETRIS%20LAWSUIT%20complaint.pdf\">Ackerman said</a> he sent his book <em>The Tetris Effect</em>\nin 2016 to the Tetris Company, which allegedly copied it for the\nmovie and threatened to sue him if he pursued his own film or\ntelevision spinoffs.</p>\n</blockquote>\n\n<p><a href=\"https://fingfx.thomsonreuters.com/gfx/legaldocs/mopajkzbgva/APPLE%20TETRIS%20LAWSUIT%20complaint.pdf\">Reuters is hosting a copy of Ackerman’s complaint</a>, which begins:</p>\n\n<blockquote>\n  <p>The movie entitled “Tetris” demonstrated the confiscation of Dan\nAckerman’s original work and creation of his book “The Tetris\nEffect.”</p>\n\n<p>Plaintiff Ackerman’s book took a unique approach to writing about\nthe real history of Tetris, as it not only applied the historical\nrecord, but also layered his own original research and ingenuity\nto create a compelling narrative non-fiction book in the style of\na Cold War spy thriller.</p>\n\n<p>Mr. Ackerman’s literary masterpiece, unlike other articles and\nwritings, dispelled of the emphasis on the actual gameplay and\nfans, and instead concentrated on the surrounding narrative,\naction sequences, and adversarial relationship between the\nplayers.</p>\n\n<p>This was the identical approach Defendants adopted for the Tetris\nFilm, without notable material distinction, but often resonating\nthe exact same feel, tone, approach, and scenes as the book\nintroduced several years prior.</p>\n</blockquote>\n\n<p>I have watched the movie (<a href=\"https://boxd.it/44pyML\">enjoyable, but flawed</a>) and not read Ackerman’s book, so I’m in no position to judge whether the movie is a rip-off of the book.</p>\n\n<p>I do find it a bit curious that there’s no coverage of this lawsuit, <a href=\"https://gizmodo.com/search?blogId=4&amp;q=tetris&amp;timestamp=1691693511271\">at least yet</a>, at Gizmodo itself, <a href=\"https://twitter.com/search?q=tetris%20(from%3Adanackerman)&amp;f=live\">nor from Ackerman</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/10/ackerman-apple-tetris-lawsuit\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"393a556a3a2258423ec23f1f76e5deb4fbb43ea3d6679e7366da55348ca87c10","category":"Tech"}