{"title":"Estimation of pulmonary vascular resistance for Glenn physiology","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307890","date":1722002400000,"content":"<p>by Sebastian Laudenschlager, Samuel Schofield, Nicolas Drysdale, Matthew Stone, Jennifer Romanowicz, Benjamin Frank, Michael DiMaria, Vitaly O. Kheyfets, Mehdi Hedjazi-Moghari</p>\r\n\r\nChildren with single ventricle heart disease typically require a series of three operations, (1) Norwood, (2) Glenn, and (3) Fontan, which ultimately results in complete separation of the pulmonary and systemic circuits to improve pulmonary/systemic circulation. In the last stage, the Fontan operation, the inferior vena cava (IVC) is connected to the pulmonary arteries (PAs), allowing the remainder of deoxygenated blood to passively flow to the pulmonary circuit. It is hypothesized that optimizing the Fontan anatomy would lead to decreased power loss and more balanced hepatic flow distribution. One approach to optimizing the geometry is to create a patient-specific digital twin to simulate various configurations of the Fontan conduit, which requires a computational model of the proximal PA anatomy and resistance, as well as the distal Pulmonary Vascular Resistance (PVR), at the Glenn stage. To that end, an optimization pipeline was developed using 3D computational fluid dynamics (CFD) and 0D lumped parameter (LP) simulations to iteratively refine the PVR of each lung by minimizing the simulated flow and pressure error relative to patients’ cardiac magnetic resonance (CMR) and catheterization (CATH) data. While the PVR can also be estimated directly by computing the ratio of pressure gradients and flow from CATH and CMR data, the computational approach can separately identify the different components of PVR along the Glenn pathway, allowing for a more detailed depiction of the Glenn vasculature. Results indicate good correlation between the optimized PVR of the CFD and LP models (n = 16), with an intraclass correlation coefficient (ICC) of 0.998 (p = 0.976) and 0.991 (p = 0.943) for the left and right lung, respectively. Furthermore, compared to CMR flow and CATH pressure data, the optimized PVR estimates result in mean outlet flow and pressure errors of less than 5%. The optimized PVR estimates also agree well with the computed PVR estimates from CATH pressure and CMR flow for both lungs, yielding a mean difference of less than 4%.","author":"Sebastian Laudenschlager","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"39433536648a9f68410776278de27f88f0e11a953eb8bf9b2f266f6867622552","category":"Interdisciplinary"}