{"title":"Deficiency of Inducible Costimulator (ICOS) during Chronic Infection with Toxoplasma gondii Upregulates CD28-Dependent Cytotoxicity of CD8+ T Cells and Their Effector Function against Tissue Cysts of the Parasite","link":"https://www.preprints.org/manuscript/202409.1892/v1","date":1727167531000,"content":"We recently identified that cerebral mRNA expression for inducible costimulator (ICOS) and its ligans, ICOSL, both significantly increases during elimination of Toxoplasma gondii cysts from the brains of infected mice by perforin-mediated cytotoxic activity of CD8+ T cells. In the present study, we examined the role of ICOS in activating the effector activity of CD8+ T cells in response to the cysts in infected mice. Following adoptive transfer of splenic CD8+ T cells from chronically infected ICOS-deficient (ICOS-/-) and wild-type (WT) mice to infected SCID mice, fewer CD8+ T cells were detected in the brains of the recipients of ICOS-/- than WT CD8+ T cells. However, such lower numbers of ICOS-/- CD8+ T cells, which migrated into the brains of the recipients, eliminated T. gondii cysts more efficiently than WT CD8+ T cells did. Consistently, the ICOS-/- CD8+ T cells secreted greater amounts of granzyme B in response to T. gondii antigens in vitro than did WT CD8+T cells. We identified that ICOS-/- CD8+ T cells express significantly greater levels of CD28 on their surface than WT CD8+ T cells, and relative expression levels of CD28 mRNA in ratios to CD8b mRNA levels in the brains of the recipients of those CD8+ T cells strongly correlated with their relative expression levels of mRNA for T-bet transcription factor and perforin. Furthermore, blocking of CD28 signaling by a combination of anti-CD80 and anti-CD86 antibodies abolished the increased cytotoxic activity of the ICOS-/- CD8+ T cells in vitro. The present study uncovered notable compensatory interactions between ICOS and CD28 to secure the cytotoxic effector activity of CD8+ T cells against a microbial infection in a murine model of chronic infection with T. gondii.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"39450dcc7b0ec048d29c0d1aaf046fefed2fb062c10c9593fa175c8a2286ca47","category":"Interdisciplinary"}