{"title":"Mysterious rock depicted in 15th-century painting is most likely a Stone Age tool","link":"https://arstechnica.com/?p=1977219","date":1697750930000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/diptych1-800x568.jpg\" alt=\"Detail from left panel of the &lt;em&gt;Melun Diptych&lt;/em&gt; (circa 1455) by medieval French painter and miniaturist Jean Fouquet. The strangely shaped rock in the lower right hand corner is most likely a Stone Age handaxe, a recent analysis concluded.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/diptych1.jpg\">Enlarge</a> <span>/</span> Detail from left panel of the <em>Melun Diptych</em> (circa 1455) by medieval French painter and miniaturist Jean Fouquet. The strangely shaped rock in the lower right hand corner is most likely a Stone Age handaxe, a recent analysis concluded. (credit: Public domain)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Around 1455, a medieval French painter and miniaturist named <a href=\"https://en.wikipedia.org/wiki/Jean_Fouquet\">Jean Fouquet</a> painted a small <a href=\"https://en.wikipedia.org/wiki/Diptych\">diptych</a> with two panels, one of which depicts <a href=\"https://en.wikipedia.org/wiki/Saint_Stephen\">St. Stephen</a> holding a strangely shaped stone—usually interpreted as a symbol of the saint's martyrdom by stoning. A new analysis by researchers from Dartmouth University and the University of Cambridge has concluded that the stone depicted in the so-called <a href=\"https://en.wikipedia.org/wiki/Melun_Diptych\"><em>Melun Diptych</em></a> is most likely a prehistoric stone hand axe, according to a <a href=\"https://www.cambridge.org/core/journals/cambridge-archaeological-journal/article/acheulean-handaxes-in-medieval-france-an-earlier-modern-social-history-for-palaeolithic-bifaces/14EF16E3BBAAE1A14CEA98BB3997C6C3\">recent paper</a> published in the Cambridge Archaeological Journal.</p>\n<p>Originally housed in the Collegiate Church of Notre-Dame in <a href=\"https://en.wikipedia.org/wiki/Melun\">Melun</a> in Northwest France, the diptych is painted in oil. The left panel depicts <a href=\"https://en.wikipedia.org/wiki/%C3%89tienne_Chevalier\">Etienne Chevalier</a>, who served as treasurer to <a href=\"https://en.wikipedia.org/wiki/Charles_VII_of_France\">King Charles VII</a>, clad in a crimson robe while kneeling in prayer. The figure to his right is St. Stephen, Chevalier's patron saint, in dark blue robes, holding a book in his left hand with the mysterious jagged rock resting on it, while his right arm drapes across Chevalier's shoulder. The right panel depicts the Madonna breastfeeding the Christ Child, possibly a portrait of the king's mistress <a href=\"https://en.wikipedia.org/wiki/Agn%C3%A8s_Sorel\">Agnes Sorel</a>, or possibly the king's wife, Catherine Bude.</p>\n<p>The two panels were once connected by a hinge, with a small medallion believed to be a mini-portrait of Fouquet as a kind of signature (he otherwise never signed his work). By 1775, the Collegiate Church was in dire need of funds for a restoration and sold the diptych, breaking it apart. The left panel is now housed at the Staatliche Museen in Berlin, while the right panel belongs to the Royal Museum of Fine Arts in Antwerp, Belgium. As for the medallion, it's now part of the Louvre's collection in Paris.</p></div><p><a href=\"https://arstechnica.com/?p=1977219#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1977219&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3945bc0bebdda625917e2bba80ac889350f83ec80543abd4905b027257ae86c8","category":"Tech"}