{"title":"Samsung punishes Galaxy Fold 3 modders by disabling their cameras","link":"https://arstechnica.com/?p=1789371","date":1629826410000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Galaxy-Z-Fold3-5g-11-scaled-1-800x566.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Galaxy-Z-Fold3-5g-11-scaled-1.jpg\">Enlarge</a> <span>/</span> The Galaxy Fold 3. Nice cameras! It would be a shame if anything happened to them... (credit: Samsung)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>If you try to mod your Samsung phone, Samsung will disable the camera?!</p>\n<p>That's the report coming out of <a href=\"https://www.xda-developers.com/samsung-galaxy-z-fold-3-unlock-bootloader-broken-camera/\">XDA Developers</a> this morning. During the confirmation process to unlock the bootloader of the spiffy new <a href=\"https://arstechnica.com/gadgets/2021/08/samsung-foldables-lineup-is-official-1799-for-the-fold-3-999-for-flip-3/\">Galaxy Z Fold 3</a>, XDA user <a href=\"https://forum.xda-developers.com/t/unlocking-bootloader-will-disable-the-camera.4321957/post-85505605\">白い熊</a> found that a surprising new message popped up on the phone. \"Unlocking the bootloader to install custom operating system software. Doing so will cause the cameras to be disabled and may cause your phone or apps to stop working correctly,\" the message said.</p>\n<p>Part of the functionality of a \"bootloader\" on an Android phone is to verify that the OS is signed by the company that manufactured the phone, ensuring the software hasn't been tampered with. Some payment apps (and games concerned with cheaters, oddly) demand that this security check is in place in order to work. Unlocking the bootloader disables this security check, allowing the phone to boot with an OS compiled by a third party. The Android community has built up a whole world of custom ROMs, so you can wipe out the default software and install whatever you want on your phone, just like on a PC.</p></div><p><a href=\"https://arstechnica.com/?p=1789371#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1789371&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3946556f362117e03821bc47121689a7966552593266e9ff24634f01ee7008a3","category":"Tech"}