{"title":"Green Roof Substrate Microbes: Stress-Tolerant Communities Characterized by the Aeromicrobiome?","link":"https://www.preprints.org/manuscript/202403.1784/v1","date":1711632324000,"content":"Extensive green roofs provide for many ecosystem services in urban environments. The efficacy of these services is influenced by the substrate characteristics and vegetational composition. Despite their key role in plant performance and productivity, or their contribution to nitrogen fixation or carbon sequestration, green roof microbial communities have received little attention so far. Here, we investigated whether microbial communities in extensive green roof substrates contain a core community, as well as whether they are affected by green roof plant diversity. Eleven green roofs, planted either with a mixture of grasses, wildflowers and succulents (Sedum spp.), or solely species of Sedum, were seasonally sampled to investigate prokaryotic and fungal communities via metabarcoding. Although Sedum-herbs-grasses roofs contained more plant species, we observed no discriminant microbial communities between both roof types, likely due to sharing the same substrate textures and the vegetational layers that became more similar throughout time. Examining key microbial taxa revealed that most taxa are also dominant phylotypes in soils across different biomes. Many bacterial core taxa are capable of nitrogen fixation and most fungal key taxa are stress-tolerant saprotrophs, endophytes, or both. Microbial community composition further revealed high similarities with aerial samples taken in urban environments. Considering the extreme edaphic conditions that periodically arise in green roof substrates, further investigation is warranted to determine the extent to which the dynamic and intriguing microbial communities are influenced by the aeromicrobiome.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"394994f8f2b6600507be9bfd438eb42127b386d595a063384609a073ec6f6b8f","category":"Interdisciplinary"}