{"title":"A Comparative Study of Indentation Size Effect Models for Different Materials","link":"https://www.preprints.org/manuscript/202404.0630/v1","date":1712741657000,"content":"Although researchers have proposed various indentation size effect (ISE) models, these models often involve different form and number of parameters that can make our wonder which is the best in existed ISE models. Three types of ISE test data, namely, normal ISE, reverse ISE and transition of normal to reverse ISE, are used to evaluate the sixteen ISE models. The comparatively study indicates that H-J, N-G-Fs, N-G-H, N-G-A and N-G-Qs models can accurately predict the normal ISE. The reason for this is that the friction stress that is not related to dislocation activities or the indentation size effect of plastic zone has been introduced into these models. Therefore, these two factors should be considered in future ISE models. The sixteen ISE models are originally proposed to describe the normal ISE of different materials. However, to our surprise, some of these models are able to capture the reverse ISE and the transition of normal to reverse ISE of different materials. The determination coefficients (DC) of the sixteen ISE models are also determined for different materials. For reverse ISE, the highest DC value for NiCSi, TC4 and PED Ni are given by the EXP, N-G-Fs and N-G-A models, respectively. For the transition of normal to reverse ISE, the N-G-YC, N-G-Fs, and N-G-H models produce the maximum DC for ZrO2, Cu and Y2O3-ZrO2, respectively. Moreover, the mean DC of the N-G-Fs model is the maximum among the sixteen ISE models, followed by the N-G-H model, but they cannot accurately predict the reverse ISE. Therefore, the N-G-Fs and N-G-H models should be further modified to accurately predict the reverse ISE.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"394e46ffd512dc0169a27a721b1fb3d43c267b1b17f28908325dc1fba0609a03","category":"Interdisciplinary"}