{"title":"How to measure a bike frame","link":"https://www.cyclist.co.uk/tutorials/how-to-measure-a-bike-frame","date":1708617766000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/tutorials/how-to-measure-a-bike-frame\">How to measure a bike frame</a></p>\n\n<p>It should all be so simple, yet sometimes it seems like the cycling industry is deliberately trying to make it hard. Finding the right size bike <em>can</em> be straightforward, but can just as easily be a massive pain. A lot of this comes down to the fact that not all bike manufacturers measure or label their frame sizes in the same way.</p>\n\n\n\n<p>So although you think it might be as simple as working out the frame size you need and then finding a model that matches, there will still be a few variables to dial down first.</p>\n\n\n\n<p>With <a href=\"https://www.cyclist.co.uk/buying-guides/best-road-bike\" target=\"_blank\">road bikes</a>, this is particularly important. While mountain bikes and hybrids are less likely to be uncomfortable if only loosely matched to the size of their rider, the largely static position of a rider on a road bike means it’s crucial to get a good fit.</p>\n\n\n\n<p>This starts with knowing what size you need and then identifying a bike that matches those numbers.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/bike-fit-20\">How bike-fit has changed: Phil Burt interview</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/buying-guides/best-road-bike\">Best road bikes: Best bikes from under £1,000 to over £10,000</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/man-vs-machine-inside-contemporary-bike-fitting\">Man vs machine: Inside contemporary bike fitting</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/how-does-frame-geometry-affect-a-bike\">How does frame geometry affect a bike?</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>How to find the right size bike – the quick answer</h2>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2016/05/02132032/tape_measure-970x647.jpg\" /></figure>\n\n\n\n<p>Google the manufacturer’s website, find the chart that suggests what frame size you’ll need for your height, and buy the one it suggests. Nice and easy! And if you fall within the middle of the size range, you’re likely to get a good fit.</p>\n\n\n\n<p>However, if you find yourself closer to the boundary between sizes, you’ll need to decide whether to size up or down. Generally, our preference would be to size down, as a frame that’s slightly too small creates fewer problems than one that’s too large.</p>\n\n\n\n<p>Still want to dive in a bit further? Then read on…</p>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/02214013/bikesetc_geometry_roundel-970x848.jpg\" /></figure></div>\n\n\n<h2>Seat tube length (ST)</h2>\n\n\n\n<p>As the most common measurement used to describe a bike, the seat tube length is often the headline size. This is partly because the seat tube of a bicycle is pretty easy to measure and its length will affect most of the other measurements too.</p>\n\n\n\n<p>First, find the centre of the crank where it joins the bottom bracket. Next, measure a line following the seat tube upwards to where the collar sits. This is the ‘actual’ length of the seat tube.</p>\n\n\n\n<p>Sometimes the seat tube is not measured in its entirety, but rather ‘centre to centre’. This measurement is the length of the seat tube from the centre of the crank to the middle of where the top tube meets the seat tube.</p>\n\n\n\n<p>Both these measurements will roughly describe the size of the bike. However, compact frame designs can have a short seat tube and still suit larger riders, because the length of the seat tube and the top tube are not always proportional. You’ll sometimes see a ‘virtual seat tube’ quoted on manufacturers’ sites, which is how long the seat tube would be if the top tube were horizontal rather than sloping.</p>\n\n\n\n<h2>Top tube length (TT)</h2>\n\n\n\n<p>Generally, if given as a number, frame sizes in catalogues describe the length of the seat tube. However, the length of the top tube, which affects how far you’ll have to reach forward to grab the handlebar, actually has a more dramatic effect on how the bike fits. This distance is known as the reach. If you buy a bike that’s too large there’s only so much you can do to adjust its reach. However, if you buy a bike that’s slightly too small, you can normally just pop the seat up a bit.</p>\n\n\n\n<ul>\n<li><strong>Read the <a href=\"https://www.cyclist.co.uk/tutorials/how-to-change-your-saddle-height\" target=\"_blank\">Cyclist guide to calculating your saddle height</a></strong></li>\n</ul>\n\n\n\n<p>While determining the saddle height you need is easy, working out the reach is more difficult. Reach is also important as not everyone’s legs and torso are in perfect proportion. So while some frame-sizing guides recommend measuring the inseam of your trousers, you might actually be better off measuring the length of your shirt.</p>\n\n\n\n<p>To find out the position that works for you, you’re going to need to try out some bikes or engage the services of a bike-fitter.</p>\n\n\n\n<ul>\n<li><strong>Read the <a href=\"https://www.cyclist.co.uk/in-depth/cyclist-guide-to-bike-fitting\" target=\"_blank\">Cyclist guide to bike-fitting</a></strong></li>\n</ul>\n\n\n\n<h2>Top tube length</h2>\n\n\n\n<p>Let’s assume you know the dimensions of the bike you’re aiming for. The distance to the handlebars is determined mostly by the length of the top tube. However, on modern bikes, not all top tubes are horizontal. This means they can sometimes be measured by their horizontal length, not the length of the tube, which might differ to a greater or lesser degree depending by the angle of the top tube.</p>\n\n\n\n<p>This measurement is commonly described as ‘virtual’ or ‘effective’, and imagines a perfectly horizontal line running from the seat tube or post to the centre of the head tube.</p>\n\n\n\n<p>This is the more crucial number for working out if the bike will fit you. If your previous bike had a 54cm ‘effective’ or ‘virtual’ top tube, then you’re likely to fit on another bike with a top tube of the same horizontal length.</p>\n\n\n\n<h3>How to measure effective or virtual top tube length</h3>\n\n\n\n<p>To measure the effective top tube of your bike you’ll need to stand it up straight on a level surface. Then take a long straight rule and a spirit level. Ensuring the rule is level, measure from the centre of the head tube, where the fork passes through it, back towards the middle of the seatpost. This is the effective top tube length.</p>\n\n\n\n<h2>The effect of head tube length</h2>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/02214016/bike_fit_variables_head_angle-970x581.jpg\" /></figure>\n\n\n\n<p>Tangentially related to how well you’ll fit on a bike is the length of the head tube. This is simply the length of the front part of the frame that the fork fits through. Although this increases or decreases with frame size, its other function is to dictate the ‘personality’ of the bike.</p>\n\n\n\n<p>Even if it is otherwise similar in size, a bike with a shorter head tube will be more aggressive, forcing the rider into a lower, head-down position and requiring more flexibility in their back and shoulders. Generally, endurance bikes have longer head tubes for a more upright rider position, while race bikes have shorter ones for a lower and more aerodynamic profile.</p>\n\n\n\n<p>Now, while it’s simple to measure a head tube, the number and type of spacers above the frame, plus the length of the fork and size of the tyres can all distort how this number manifests itself when considered as part of the complete bike. It’s another example of how just because two numbers on a chart are the same, their effect on the final position of the rider may not always be identical.</p>\n\n\n\n<h2>Why is this all so tricky?</h2>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2016/09/02135613/bike_fitting06-738x970.jpg\" /></figure></div>\n\n\n<p>As you can tell, things are starting to get complicated, and we haven’t even got onto bottom bracket drop or head and seat tube angles yet. Basically, the geometry of a bicycle frame is made up of a lot of numbers, some real and some virtual. These numbers all float around, and only make sense if understood in relation to a fixed point, which as the only bit that can’t be adjusted is the centre of the bottom bracket.</p>\n\n\n\n<p>Adding to the difficulty is the fact that frames are both designed and measured differently. Take a standard frame with a normal seatpost collar that protrudes an inch or so above the top tube. How would you describe the length of its seat tube versus a bike with a flush integrated seat post clamp? The position of the saddle will end up in the same place, but the tubes of the frame will be significantly different in length.</p>\n\n\n\n<p>Some companies also choose to measure frames in willfully obscure ways, for instance measuring from the back of the head tube rather than the centre. With frame sizing needing to be accurate to within a centimetre or so, you can see how it’s easy to get turned around.</p>\n\n\n\n<h2>Stack and reach to the rescue</h2>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/02214021/bike_fit_variables_stack_and_reach-970x501.jpg\" /></figure>\n\n\n\n<p>Let us present a simpler solution. Stack and reach simplifies frame geometry down to just two measurements that focus on what matters most in bike fit. Describing the position of the front end, stack is the vertical height between the bottom bracket centre and the top centre of the head tube. Reach is the horizontal distance between the same points.</p>\n\n\n\n<p>Their benefit is twofold: firstly, they allow a bike fitter to accurately match your measurements to an ideal bike setup irrespective of any stated frame size. Secondly, they allow precise comparison between bikes. The latter makes stack and reach a valuable tool if you’re in the market for a new bike and want to compare the fit of, say, a Specialized Roubaix with that of a Specialized Tarmac.</p>\n\n\n\n<p>For argument’s sake, let’s compare the size 56cm for these two bikes. The Tarmac has a given stack of 565mm and a reach of 395mm. The Roubaix has a 605mm stack and a 389mm reach.</p>\n\n\n\n<p>Thus the Roubaix’s front end position is 40mm taller vertically and 6mm shorter horizontally. That means (assuming equivalent bars and stems) the Tarmac has the more aggressive riding position, which may sway your choice of bike depending on your riding preferences.</p>\n\n\n\n<p>Yet even this system isn’t without issues. The main failing of stack and reach is that it only describes what is happening in front of the bottom bracket. If two frames have the same measured reach but one has a slacker seat tube angle this will put the seat further back, which in turn creates additional reach, which isn’t taken into account. Plus, spacers and bar and stem design will also alter how high and how far away that bars are.</p>\n\n\n\n<p>That said, unless your bike has a particularly unusual design, stack and reach make it pretty easy to compare the essential qualities of any two bikes. Now adopted by most makers, the stack and reach values will normally be listed among the values in the geometry table.</p>\n\n\n\n<h2>How to measure stack and reach</h2>\n\n\n\n<p>If you want to work out the stack and reach of your existing bike or measure a new one to compare it, you’ll again need a long rule and a spirit level, plus a plumb-line. A second pair of hands will also help.</p>\n\n\n\n<p>With your bike standing fully upright, set the front of the rule against the top centre of the head tube and run it back so it’s level against the seatpost. Once you’ve checked this is perfectly flat with the spirit level, take the plumb line and hang it from the rule. You want it to fall directly against the centre of the bottom bracket. Once you hit the spot, the distance shown on the rule between the head tube and position of the plumb line will be the reach.</p>\n\n\n\n<p>The stack is the vertical distance between the bottom bracket and the top of the head tube. Assuming your first setup was level and correct, measure from the rule down the string of the plumb line to the centre of the bottom bracket. This length will be your stack.</p>\n\n\n\n<p>While trying to keep everything in position, a few blobs of blu-tac can be helpful. Given that two centimetres or so can be the difference between frame sizes, measure a few times to ensure accuracy.</p>\n\n\n\n<p>The alternative is to push your bike’s front wheel against a wall and measure the horizontal distance from the wall to the top centre of the head tube. Do the same to the centre of the bottom bracket and subtract A from B. You can do the same for stack, by measuring the vertical height of the top of the head tube and the centre of the bottom bracket from the ground. </p>\n\n\n\n<h2>Other measurements</h2>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/02214013/bikesetc_geometry_roundel-970x848.jpg\" /></figure></div>\n\n\n<h3>Wheelbase (WB)</h3>\n\n\n\n<p>The wheelbase is the distance between the centre of both wheels. Growing or shrinking with the overall size of the bike, all other things being equal, a longer wheelbase makes for more stability, while a shorter wheelbase makes for quicker turning. To find this number, simply measure between the axles of both wheels. Ensure the front wheel is straight relative to the frame, as otherwise this will throw out the measurement.</p>\n\n\n\n<p>Read the <a href=\"https://www.cyclist.co.uk/in-depth/what-is-a-bikes-wheelbase\" target=\"_blank\">Cyclist guide Bike fit variables: wheelbase</a></p>\n\n\n\n<h3>Chainstay length (C)</h3>\n\n\n\n<p>As with wheelbase, bikes with shorter chainstays tend to turn quicker, and might potentially be stiffer. To measure this distance, simply measure from the axle of the rear wheel to the centre of the bottom bracket.</p>\n\n\n\n<h3>Front centre</h3>\n\n\n\n<p>This is the distance between the centre of the bottom bracket and the axle of the front wheel as measured in a straight line. Not hugely useful, it will, however, suggest how much toe overlap a frame might have and it also affects its stability.</p>\n\n\n\n<h3>Bottom bracket height</h3>\n\n\n\n<p>All other measurements follow from the location of the bottom bracket. Unsurprisingly then, its height has a big effect on how the bike handles. A high bottom bracket will have a knock-on effect on the rider, raising their centre of gravity. However, while a low bottom bracket will be more stable, if it’s too low you’ll risk grounding the pedals while riding around corners. To measure the height of yours, stand the bike upright and measure from the ground up to the centre of the crankset.</p>\n\n\n\n<h3>Bottom bracket drop (BB)</h3>\n\n\n\n<p>The height of the bottom bracket relative to the floor can be affected by the size of your tyres. A more useful measurement is the bottom bracket drop. This describes the position of the bottom bracket relative to the bike’s axles. To calculate this, measure from the centre of either axle to the ground. Subtract your bottom bracket height from this number. The remainder is the bottom bracket drop, which describes how low the bottom bracket sits under the axles.</p>\n\n\n\n<p><em>Read the <a href=\"https://www.cyclist.co.uk/in-depth/how-does-frame-geometry-affect-a-bike\" target=\"_blank\">Cyclist guide on how geometry affects a bike’s fit and handling</a></em>.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/tutorials/how-to-measure-a-bike-frame\">How to measure a bike frame</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"jackew","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"3951612c7809a3b343a1f12311a6f58b178361d48fba3f6054b572889dd60950","category":"Cycling"}