{"title":"Could the aroma of spices produce a cross‐modal enhancement of food saltiness and contribute to reducing salt intake?","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13270?af=R","date":1712732400000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>As a result of its correlation with cardiovascular diseases, salt intake must be reduced. According to multi-sensory integration, aroma plays an important role in saltiness enhancement; this could enable a food's salt content to be reduced without losing acceptance. We therefore studied the effect of three spices, <i>Curcuma longa</i>, <i>Laurus nobilis</i> L. and <i>Petroselinum crispum</i> L., on saltiness enhancement through sensory tests on consumers. This was followed by olfactometric analysis with the aim of relating the effect to the spices’ aromatic composition.</p>\n<h2>RESULTS</h2>\n<p>According to the odour-induced salty taste enhancement (OISE) mean values, bay leaf and turmeric had the highest effect on saltiness enhancement, at a similar level to dry-cured ham aroma, wherwas parsley had a significantly lower OISE value. Only one odour-active compound (OAC), eugenol, showed a direct correlation with the spices' OISE values. Turmeric primarily had OACs with sweet aroma, whereas bay leaf had more OACs belonging to the spicy-aroma category.</p>\n<h2>CONCLUSION</h2>\n<p>The three spices, turmeric, bay leaf and parsley, investigated in the present study appear to enhance the salty taste of mashed potato with a low salt content. The results suggest that an interaction effect among OACs with different aromatic ranges may exist. Therefore, when the global OAC modified frequency value, grouped according to aroma range, was considered, the sweet range appears to counteract the effect of the spicy aroma on saltiness. © 2024 Society of Chemical Industry.</p>","author":"M. Pilar Segura‐Borrego, \nCristina Ubeda, \nOlga Pastor, \nRaquel M. Callejón, \nM. Lourdes Morales","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"3952b7e56f186ead8571711d42be229d14006cce7b85ef7d464c6097ce8240d2","category":"Environment"}