{"title":"A global index to track the health of tropical rainforests","link":"https://arstechnica.com/?p=1783679","date":1627496304000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-666689843-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-666689843.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/aerial-of-tropical-rainforest-hawaii-royalty-free-image/666689843?adppopup=true\">Howard Kingsnorth / Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>We’ve known for decades that tropical rainforests are special. They’re nearly unrivaled in biodiversity, and research has shown that they absorb more carbon dioxide than any other ecosystem. A <a href=\"https://advances.sciencemag.org/content/7/27/eabe9829\">recent study</a> showed that the tropics sequester four times as much carbon dioxide as temperate and boreal ecosystems combined—and several studies have estimated that all terrestrial ecosystems combined sequester as much as 30 percent of the total carbon dioxide in the atmosphere each year.</p>\n<p>We’ve also known for decades that these ecosystems are at risk of vanishing. As much as <a href=\"https://advances.sciencemag.org/content/7/10/eabe1603.full\">20 percent</a> of tropical rainforests have been cleared in the last 30 years, with an additional 10 percent lost to degradation. Beyond these direct threats, forests worldwide, and especially rainforests, are experiencing severe losses due to climate change—notably higher temperatures and drought.</p>\n<p>Until now, there haven’t been means to systematically keep tabs on the health of these critical ecosystems. But a <a href=\"https://www.cell.com/one-earth/fulltext/S2590-3322(21)00344-4\">collaboration</a> of nearly 50 institutions has recently developed a comprehensive index to measure the health and vulnerability of all tropical rainforests around the world. The result is a potential warning system that allows scientists and policymakers to monitor and prioritize which forests are at the highest risk of irreversible damage and loss.</p></div><p><a href=\"https://arstechnica.com/?p=1783679#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1783679&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3953c0998fcd05d12a104b355906adb4aabb6e26d72ce743ae42e0192bb72f9a","category":"Tech"}