{"title":"Don’t miss Ars Frontiers 2023: Top minds talk AI, mRNA, and TikTok bans","link":"https://arstechnica.com/?p=1937010","date":1683720019000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/04/ars-frontiers-launch-report-800x450.jpg\" alt=\"Don’t miss Ars Frontiers 2023: Top minds talk AI, mRNA, and TikTok bans\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/04/ars-frontiers-launch-report.jpg\">Enlarge</a> (credit: Aurich Lawson)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Ars Technica is pleased to announce the return of <a href=\"https://frontiers.arstechnica.com/\">Ars Frontiers,</a> our single-day event that explores tech's most vexing and fascinating issues. This year's event will be held on May 22, and everyone is invited! Attendance this year is virtual, so we'll be streaming all six sessions over the course of three and a half hours.</p>\n<p>Readers who stop by the front page every day already know that Ars is a leader in bringing smart people together to talk about important topics—whether that means interviewing experts about current events or watching our highly skilled readers dissect an issue in the comments. In that same spirit of fostering brilliant discussions, this year we've curated a list of topics that explore the modern interconnectedness of innovation, with panels led by our subject matter authorities like Eric Berger and Dr. Beth Mole. All sessions will be streamed live on the Ars YouTube channel.</p>\n<h2>The main event</h2>\n<p>Ars Frontiers 2023 will feature six virtual sessions on May 22, starting at approximately 13:30 US Eastern Daylight Time (UTC-4:00). Ars Technica Editor-in-Chief Ken Fisher and I will host the event from our studio in Manhattan. Each session will run about 30 minutes, which will include some time at the end for audience questions. Here's the line-up! (Session order might change between now and when the event happens.)</p></div><p><a href=\"https://arstechnica.com/?p=1937010#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1937010&amp;comments=1\">Comments</a></p>","author":"Lee Hutchinson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3953cb8445476a464d24525d953757cdbb9db7a964407dba0b04412718bc0e34","category":"Tech"}