{"title":"ART coverage and viral suppression among female sex workers living with HIV in eThekwini, South Africa: Baseline findings from the Siyaphambili study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002783","date":1716386400000,"content":"<p>by Carly A. Comins, Stefan Baral, Mfezi Mcingana, Lily Shipp, Deliwe Rene Phetlhu, Katherine Young, Vijayanand Guddera, Harry Hausler, Sheree Schwartz</p>\r\n\r\nIn South Africa &gt;60% of female sex workers (FSW) are living with HIV, the majority of whom are not virally suppressed. Identifying multi-level determinants of viral suppression is central to developing implementation strategies to promote retention in HIV care and viral suppression among FSW with unmet treatment needs. Adult cisgender FSW living with HIV for ≥6 months, conducting sex work as their primary source of income, and residing in Durban (South Africa) were enrolled into the Siyaphambili Study, a sequential multiple assignment randomized trial. Baseline viral load and CD4 were assessed, and an interviewer-administered survey was conducted, capturing socio-demographic, reproductive and sexual history and behaviors, vulnerabilities, substance use, mental health, and stigma. We assessed baseline determinants of viral suppression (&lt;50 copies/mL) using bivariate and multivariable robust poisson regression, considering associations across the individual, network, environmental and macrostructural levels. From June 2018 –March 2020, 1,644 women were screened, with 1,391 eligible FSW living with HIV enrolled. The analyses were conducted among the 1,373 participants with baseline data. Overall, 65% (889/1,373) of participants were reported to be on antiretroviral therapy and 38% (520/1,373) were virally suppressed. In the multivariable model, FSW who experienced a lack of housing in the prior six months were less likely to be virally suppressed (aPR: 0.72, 95%CI 0.56–0.91), while older FSW (aPR: 1.46 95%CI: 1.16–1.83 for 30–39 years old vs. 18–29 years old; aPR: 2.15 95%CI: 1.64–2.80 for 40+ years vs. 18–29 years old) and FSW reporting hormonal or long-acting contraception use were more likely to be virally suppressed (aPR: 1.19 95% CI: 1.00–1.43). We found vulnerability to be high among FSW living with HIV in South Africa and identified individual and structural determinants associated with viral suppression. Taken together these results suggest optimizing HIV treatment outcomes necessitates supporting younger sex workers and addressing housing instability.\r\nTrial registration: NCT03500172.","author":"Carly A. Comins","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"3954a01ecb2666b455607dc9255bc1b62648be1db6419babea360903bb991438","category":"Environment"}