{"title":"Teens with “digital bazookas” are winning the ransomware war, researcher laments","link":"https://arstechnica.com/?p=1983601","date":1699973854000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/07/GettyImages-597257986-800x560.jpg\" alt=\"A ransom note is plastered across a laptop monitor.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/07/GettyImages-597257986.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/editorial-images\">Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>What do Boeing, an Australian shipping company, the world’s largest bank, and one of the world’s biggest law firms have in common? All four have suffered cybersecurity breaches, most likely at the hands of teenage hackers, after failing to patch a critical vulnerability that security experts have warned of for more than a month, according to a <a href=\"https://doublepulsar.com/lockbit-ransomware-group-assemble-strike-team-to-breach-banks-law-firms-and-governments-4220580bfcee\">post</a> published Monday.</p>\n<p>Besides the US jetliner manufacturer, the victims include DP World, the Australian branch of the Dubai-based logistics company DP World; Industrial and Commercial Bank of China; and Allen &amp; Overy, a multinational law firm, according to Kevin Beaumont, an independent security researcher with one of the most comprehensive views of the cybersecurity landscape. All four companies have confirmed succumbing to security incidents in recent days, and China’s ICBC has <a href=\"https://www.reuters.com/technology/cybersecurity/icbc-paid-ransom-after-hack-that-disrupted-markets-cybercriminals-say-2023-11-13/\">reportedly</a> paid an undisclosed ransom in exchange for encryption keys to data that has been unavailable ever since.</p>\n<p>Citing data allowing the tracking of ransomware operators and people familiar with the breaches, Beaumont said the four companies are among 10 victims he’s aware of currently being extorted by LockBit, among the world’s most prolific and damaging ransomware crime syndicates. All four of the companies, Beaumont said, were users of a networking product known as Citrix Netscaler and hadn’t patched against a critical vulnerability despite a patch being available since October 10.</p></div><p><a href=\"https://arstechnica.com/?p=1983601#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1983601&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3957b7a7b4b24e5cbd0a220303fd80243a0bbf94c8f958eeab0d7313d1ef9be2","category":"Tech"}