{"title":"Hands-On With the 24-Inch M3 iMac","link":"https://www.macrumors.com/2023/11/27/m3-imac-review/","date":1701108934000,"content":"Apple in October refreshed the <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a> and MacBook Pro, introducing the first M3 chips with 3-nanometer processors. We've already checked out the <a href=\"https://www.macrumors.com/2023/11/07/m3-macbook-pro-hands-on/\">MacBook Pro with M3 Pro</a> and the <a href=\"https://www.macrumors.com/2023/11/13/m3-max-macbook-pro-hands-on/\">MacBook Pro with M3 Max</a>, so we thought we'd wrap up our M3 review series with the ‌iMac‌.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nIf you have an <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> ‌iMac‌, you're not going to notice any physical differences between the old model and the new model with the M3 chip, because Apple didn't make any updates to the design or the color offerings.\r<br />\n\r<br />\nEverything is the exact same, with the thin design, 24-inch Retina display, six-speaker sound system, and a selection of seven two-tone color options.\r<br />\n\r<br />\nWhat's different is the internals, and the jump from ‌M1‌ to M3 is a major update in terms of CPU and GPU speeds. Built on the 3-nanometer process, the M3 chip has some major GPU improvements thanks to Dynamic Caching, hardware-accelerated ray tracing, and mesh shading.\r<br />\n\r<br />\nThe M3 chip is 2.5x faster than the ‌M1‌ chip when it comes to GPU performance, and it's better than before for gaming, 3D rendering, video editing, and similar tasks. As for the CPU, the performance cores are up to 30 percent faster than the performance cores in the ‌M1‌, while the efficiency cores are up to 50 percent faster than the ‌M1‌ efficiency cores. In Geekbench benchmarks, the M3 comes in at around 20 percent faster overall.\r<br />\n\r<br />\nDepending on what you're doing, there is a notable difference between the ‌M1‌ and M3 in real-world performance and it's great to have an update for a machine that was one of the oldest in Apple's lineup. If you need a desktop Mac for day-to-day tasks, you're not going to be disappointed with the M3 ‌iMac‌.\r<br />\n\r<br />\nIf you're holding out for a larger ‌iMac‌ with Apple silicon, Apple doesn't think you should wait. The company confirmed there are no plans <a href=\"https://www.macrumors.com/2023/11/06/no-27-inch-with-apple-silicon/\">for another 27-inch iMac</a>, and Apple recommends that customers who need a bigger and better desktop computer turn to the <a href=\"https://www.macrumors.com/roundup/mac-studio/\">Mac Studio</a> and the Studio Display.\r<br />\n\r<br />\nThat said, there are rumors that Apple is working on an ‌iMac‌ that has a display somewhere around 30 inches, but it's not yet clear when that model might be coming out, and it seems to be at least a year or two away.\r<br />\n\r<br />\nWhat do you think of the M3 ‌iMac‌? Let us know in the comments below.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iMac\">iMac (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/imac.91\">iMac</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/27/m3-imac-review/\">Hands-On With the 24-Inch M3 iMac</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/hands-on-with-the-24-inch-m3-imac.2412154/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"395d4b6a064cfafc3369d03e367d0d84a270074029750fe0c596a94e1370862f","category":"Apple"}