{"title":"Diffusion properties of buoyant particle cluster in open channel flow with emergent rigid vegetation","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2628?af=R","date":1713494518000,"content":"<h2>Abstract</h2>\n<p>Convection and diffusion processes of buoyant organisms are of great significance to ecological restoration or the restoration of the riparian and wetland system. Advection–diffusion models have been widely applied to describe the transport of particles through vegetation, assuming that the particle transport is driven by the mean flow, but few studies have been conducted on the diffusion process while considering the retention time. The authors conducted flume experiments of four runs with different vegetative densities and extracted and analysed the longitudinal moving and lateral oscillation trajectories of buoyant particles. The trapping and releasing mechanisms of buoyant particles due to capillary force were explored, and a dimensionless parameter is defined to reflect the effect of the physical properties of stems and particles on the retention time. The retention time of trapping events due to the capillary force between particles and the stem has been proven to follow a three-parameter double exponential distribution, the duration time of both short and long retention events increases with the bulk flow velocity, and the proportion of long trapping events decreases with the increasing bulk flow velocity. The diffusion coefficient of buoyant particles is validated independently from the vegetative densities, increases with the flow velocity, and is approximately 100 times that of the solute in the flow through emergent vegetation under similar condition.</p>","author":"Liu Xiaoguang, \nZeng Yuhong, \nWang Jiasheng","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"395f135f96122220dca246b70d9f98e8756640bcb967affbad89625af6ecd6bf","category":"Environment"}