{"title":"Modified Liu Parameter in Scaling Options of the Multiple Regression Model with Multicollinearity Problem","link":"https://www.preprints.org/manuscript/202407.0067/v1","date":1719838955000,"content":"The statistical technique, the multiple regression model, is employed to analyze the relationship between the dependent variable and several independent variables. The multicollinearity problem is one of the assumptions in the multiple regression model that occurred in the relationship among independent variables. The ordinal least square is the standard method to evaluate parameters in the regression model, but the multicollinearity problem affects the unstable estimator. The Liu regression is proposed to approximate the Liu estimators based on the Liu parameter to overcome multicollinearity. For this paper, we have proposed the modified Liu parameter to estimate the biasing parameter in scaling options to compare the ordinal least square estimator with two modified Liu parameters and six standard Liu parameters. The performance of the modified Liu parameter is considered with the generating independent variables from the multivariate normal distribution in the Toeplitz correlation pattern as the multicollinearity data, where the dependent variable is obtained from the independent variable multiplied with a coefficient of regression and with the error from the normal distribution. The mean absolute percentage error is computed as an evaluation criterion of estimation. For application, the Hepatitis C patients dataset is a real dataset to investigate the benefit of the modified Liu parameter. Through the simulation and real dataset, it can be seen from the results that the modified Liu parameter outperforms the other Liu parameters and the ordinal least square estimator. It can recommend the user for estimating parameters by using the modified Liu parameter when the independent variable exits the multicollinearity problem.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"396bde2084232bbd168e22a0ffa760f57702eaf11dee49d15a4abd62ab3fa2ac","category":"Interdisciplinary"}