{"title":"An unclosed loop: Perspectives of community engagement in infectious disease clinical trials in sub-Saharan Africa","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308128","date":1722607200000,"content":"<p>by Carmen Späth, Bey-Marrié Schmidt</p>\r\nBackground <p>Community engagement (CE) is pertinent to ethically and scientifically rigorous infectious disease clinical trials in sub-Saharan Africa (SSA). However, there are critiques that CE is not properly embedded in research processes and that there is uncertainty about <i>what</i> CE entails. The aim of this study was to gain an understanding of CE in infectious disease clinical trials in SSA, specifically factors affecting CE and existing strategies for engaging with communities.</p> Methods <p>Semi-structured telephone interviews were conducted with 20 community and clinical trial (CT) stakeholders who worked in SSA. The audio-recorded interviews were transcribed verbatim and analysed inductively using thematic analysis.</p> Results <p>Themes are as follows: <i>1) Communities are abandoned research-entities</i>—a disconnect between scientific teams and communities was observed and knowledge translation was not prioritised at the community-level. <i>2</i>) <i>Us and them</i>: <i>community engagement teams vs investigators</i>—CE teams expressed that researchers did not account for CE processes and often did not involve CE staff in their planning, and felt that their roles were not valued. <i>3) Ethical considerations</i>: <i>concerns and gaps—</i>there were concerns that procedures were not standardised and that ethics processes were not adhered to. <i>4) Opportunities for improved CE practices</i>—training needs were expressed, including for standardised practices, ethics, and for developing a holistic understanding of collaborating with communities.</p> Conclusion <p>CE role players require intensive training to ensure ethical CE and that communities are treated with dignity. This includes 1) using collaborative strategies involving research and CE staff, 2) protocol-adherence that recognises CE as pertinent, 3) viewing communities as complex and building relationships that are sustainable, and 4) ensuring that knowledge translation is considered at a community-level. Further research is necessary to investigate potential training programmes that integrate these elements.</p>","author":"Carmen Späth","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"39813e6254a953c8275b5226bca9ad0a96ef96c28bad86052659f85c6c0445e6","category":"Interdisciplinary"}