{"title":"Standards-based audit to improve quality of maternal and newborn care—A stepped-wedge cluster randomised trial in Malawi","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310896","date":1727704800000,"content":"<p>by Sarah Ann White, Florence Mgawadere, Somasundari Gopalakrishnan, Nynke van den Broek</p>\r\nBackground <p>Audit is a quality improvement approach used in maternal and newborn health. Our objective was to introduce the practice of standards-based audit at healthcare facility level, and to examine if this would improve quality of care assessed by compliance with standards developed and agreed with healthcare providers. Our focus was on emergency obstetric and newborn care (EmONC).</p> Methods <p>A multidimensional incomplete stepped-wedge cluster randomised trial with 8 steps was conducted in 44 healthcare facilities in Malawi. A total of 25 standards of care were developed. At each healthcare facility one (health centres) or two (hospitals) standards were audited per cycle with two consecutive audit cycles conducted. Each cycle consisted of five steps: (i) select standard to be audited, (ii) measure compliance with standard (measurement 1), (iii) review findings and identify what changes are required to increase compliance (iv) implement changes, (v) re-measure compliance (measurement 2). Each compliance measurement assessed 25 women. Multilevel mixed effects logistic regression models were used to analyse data for all standards.</p> Results <p>The crude overall compliance rate rose from 45% in the control phase (measurement 1) to 63% in the intervention phase (measurement 2) (from 51.6% to70.6% at Basic and from 34.5% to 50.8% at Comprehensive EmONC healthcare facilities. When adjusted for standard, facility type, month, and healthcare facility by month, the adjusted OR (95% CI) was 2.80 (1.65, 4.76). Actions taken to improve compliance with standards included improving staff performance of clinical duties and general conduct through re-orientation and staff meetings as well as improved supervision, and, ensuring basic equipment and consumables were available on site (thermometers, rapid diagnostic tests, partograph).</p> Conclusion <p>The introduction of standards-based audit helped healthcare providers identify problems with service provision, which when addressed, resulted in a measurable and significant improvement in quality of care.</p> Trial registration <p>ISRCTN registration number: 59931298.</p>","author":"Sarah Ann White","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3986ea07f8e3336db80a78efdae48f5b62a38d2c83a5a60b4dc7a4a4aef76d67","category":"Interdisciplinary"}