{"title":"What do we know about zooplankton occurrence and distribution in Neotropical streams? A systematic review of published studies in Brazil","link":"http://link.springer.com/10.1007/s10750-024-05485-7","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Studies on zooplankton in lakes, ponds, and rivers have always received more attention, while zooplankton from streams remains understudied worldwide. Therefore, the role of zooplankton in neotropical stream functioning is still poorly understood. In order to remedy this situation, we aimed to answer the following questions: (1) How many papers have been published on the zooplankton from Brazilian streams? (2) In which hydrographic regions were these studies conducted? (3) Are there specific patterns of zooplankton species occurrence in neotropical streams? (4) What are the main types of studies and what are the main environmental factors influencing zooplankton in streams? In order to answer these questions, we performed a systematic review of indexed scientific papers. We indeed observed a paucity of studies on zooplankton in Brazilian streams. But despite the low number of studies (24), many species (276 taxa) were reported from seven Brazilian hydrographic regions. The species composition showed great variability within the hydrographic regions and fourteen environmental variables (physical, chemical, and spatial), which can represent environmental filters and influence dispersion processes, were related to zooplankton occurrences. These bibliographic data helped to clarify patterns in species composition and community structure of zooplankton in these streams. More studies are needed to further investigate the role of zooplankton in neotropical streams, which can help to develop conservation strategies.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"398808c46697f01f2c7c83930741f7cfba0365d0a3992baf66ae7698ea260a0b","category":"Environment"}