{"title":"Petrophysical and Mechanical Properties of the Piromafo Stone Used in the Built Heritage of Apulia (SE Italy): A Comprehensive Laboratory Study","link":"https://www.preprints.org/manuscript/202406.0669/v1","date":1718093832000,"content":"Many historic buildings and monuments on the Salento Peninsula (Apulia, southern Italy) were built from locally quarried Miocene calcarenites belonging to the Pietra Leccese Formation (Late Burdigalian-early Messinian). The main facies consists of a homogeneous and porous biomicrite, pale yellow in color and fine- to medium-grained, very rich in planktonic Foraminifera and massive or thick-bedded in outcrop.\nAdditionally, there are other facies among which Piromafo stands out for its aesthetic appearance, which is enhanced by its greenish-brown or greenish-grey colors. Its physical characteristics, in terms of thermal properties mainly due to the mineral content and fabric, make it a good refractory and insulation material. Piromafo occurs in the upper part of the Pietra Leccese Fm. and is repre-sented by a fine- to medium-grained glauconitic and phosphatic biomicrite with macrofossils, es-pecially Bivalves and Gastropods. \nDespite its important historical use as building and ornamental material, especially in the Roman and Baroque architecture, a research gap exists in the scientific literature describing the properties of the stone and their correlation. Therefore, the aim of this paper is to present a wide range of properties useful to explain the in-situ behavior and damage susceptibility of the stone in monu-ments and buildings, but also for selecting preservation treatments and strategies. \nThus, an overall assessment of the main petrophysical and mechanical properties especially for restoration/conservation purposes was performed using both standard and unconventional tech-niques. Starting from rock fabric inspection, particular attention was given to the relationship be-tween pore-size distribution and, hydraulic and thermal properties of the material. Unconfined compressive strength, flexural strength and indirect tensile strength were also estimated.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"398c9b90860a99178963e4ae1bc6627211d4fcf8b60e49337b3dec61050f6c54","category":"Interdisciplinary"}