{"title":"Tour de France 2021 Stage 3 Preview - The Sprinter's First Chance","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-stage-3-preview-the-sprinters-first-chance-to-dance","date":1624811400000,"content":"\n      <p><span>Stage 3 of the Tour de France will bring excitement for pure sprinters who have been so far forced to wait for their first clear opportunity at a stage win. The opening weekend has been dominated by the punchers and the GC favourites have been forced to be on their game from kilometre zero. However, stage three arrives and with it, the first genuine chance for the pure sprinters to shine.</span></p>\n<p><span>Mathieu van der Poel claimed the yellow jersey on the <span>Mûr-de-Bretagne</span> with an emotional victory. The Dutchman showed mindfulness to attack on the first ascent where he gained an eight seconds time bonus. Then, he attacked away from the rest and no one could respond, placing Van der Poel into the yellow jersey. An emotional victory, which was dedicated to his late Grandfather Raymond Poulidor.</span></p>\n<div></div>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b><i>Tour de France 2021 Guide</i></b></a></p>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_PROFILS_ETAPES_SANS_RAVITO_ETP03_1024x1024.jpg?v=1624718492\" />Tour de France Stage 3 profile</span></i></p>\n<p><span>The mini ‘Tour de Brittany’ continues over the opening stages of the Tour de France. Stage 3 begins in Lorient before finishing in Pontivy. For the first time this year, the total climbing metres over the stage dips under 2,000 meters, meaning the pure sprinters look likely to fight it out.</span></p>\n<p><span>The two king of the mountain’s sprints occur at kilometre 90 and 148 which means there are two points available across the stage. These could be crucial, however. Van der Poel leads the classification but is tied on points with Ide Schelling, whilst Frenchman Anthony Perez is tracking them closely on three points. Perez and Schelling had a ferocious battle from the breakaway on stage two, and we could be treated to a similar spectacle here.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-standings\" target=\"_blank\"><em><strong>Tour de France Standings</strong></em></a></p>\n<p><span>The only intermediate sprint takes place in La Fourchette at kilometre 117. We witnessed Mark Cavendish and Caleb Ewan sprint for the stage two intermediate sprint and they could do the same here. However, it is Julian Alaphilippe that enters the stage in the lead of the points classification.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-standings\" target=\"_blank\"><em><strong></strong></em></a><span>The stage finish is not straightforward. With 20 kilometres to go, the road will rise and rolling terrain will characterise the next 13 kilometres. There are no hills steep or long enough to be categorised, but the constant rises and falls in gradient could encourage some to attack, though the tempo will be high.</span></p>\n<p><span>With 7 kilometres left, the road will drop and the riders will descend towards Pontivy. The sprinters’ teams will battle aggressively for the front of the peloton here. The road only flattens with around three kilometres left. The final few thousand metres aren’t complex with a couple of roundabouts the only obstacles. The road is very straight until the final few hundred metres, where it kinks slightly to the left, which could make timing the sprint a little more difficult.</span></p>\n<h4><b>Contenders</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210626TDF1044-A.S.O._Pauline_Ballet-min_1024x1024.jpg?v=1624721296\" /></b></p>\n<p><em>Image credit: <span>A.S.O./Pauline Ballet</span></em></p>\n<p><b>Caleb Ewan</b><span> started the season attempting to win a stage at all three Grand Tours. He has one ticked off the list already after he won stages 5 and 7 of the Giro d’Italia. Again, Ewan demonstrated that when he is at his best, he leads the elite tier of sprinters. The Australian now has eleven Grand Tour stage wins on his </span><i><span>palmeres, </span></i><span>and you wouldn’t bet against him adding to that at the Tour de France with Tosh Van der Sande, Jasper De Buyst and Roger Kluge all to play key roles in his leadout train.</span></p>\n<p><span>Deceuninck-Quick Step won the green jersey with Sam Bennett last year, though the Irishman has not made it to the startline this season after he was ruled out with a knee injury. However, that has provided the opportunity for</span><b> Mark Cavendish</b><span> to make a remarkable return to the Tour de France. Cavendish boasts an incredible 30 stage victories at the Tour which places him second on the all-time list only behind Eddy Merckx. The ‘Manx Missile’ isn’t here just to make up the numbers. He won four stages at the Tour of Turkey earlier this season and more recently he won stage 5 of the Baloise Belgium Tour ahead of top opposition. Could Cav cap his comeback with a stage win in Pontivy?</span></p>\n<p><b>Tim Merlier</b><span> was one of the riders beaten by Cavendish that day, but the Alpecin-Fenix rider is one of the fastest in the world. He won his first Grand Tour stage at the Giro d’Italia earlier this season and showed no signs of fear despite riding a Grand Tour for the first time. He starts with a sensational sprint team too. </span><b>Mathieu van der Poel</b><span> and </span><b>Jasper Philipsen</b><span> are also capable of sprinting, but they are more likely to work for Merlier, even though Van der Poel holds the yellow jersey.</span></p>\n<p><b>Arnaud Démare </b><span>has become one of the most consistent sprinters in cycling which he demonstrated by winning four stages at the Giro d’Italia last season. The Frenchman has turned his focus to the Tour de France this season, and without Thibaut Pinot in their lineup, Groupama-FDJ could place more focus on helping Démare. </span><b>Jacopo Guarnieri</b><span> will play a crucial role in his leadout.</span></p>\n<p><span>Before the Tour de France departed from Brest,</span><b> Peter Sagan</b><span> said, “I’ll first think of winning some stages and then take the green jersey.” Stage 3 will be another crucial day for Sagan if he is to reach both of his goals. If he cannot win the stage, he will look to pick up as many points as possible in the green jersey classification.</span></p>\n<p><span>It’s almost impossible to discuss the contenders for any of the stages at the Tour de France this year without mentioning </span><b>Wout Van Aert.</b><span> The Belgian champion won two mass-sprints last year and must be considered as one of the primary favourites for all flat stages this season. Jumbo-Visma possess the strength in depth to protect </span><span>Primož Roglič without the assistance of Van Aert, so he should be given the freedom to chase stage victory. </span></p>\n<p>Other riders with an outside chance include <strong>Sonny Colbrelli</strong>, <strong>Nacer Bouhanni</strong> and <strong>Bryan Coquard</strong>.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-stage-4-preview-sprint-showdown-in-fougeres\"><em><strong>Tour de France Stage 4 preview</strong></em></a></p>\n<h4><b>Prediction</b></h4>\n<p><span>Caleb Ewan started the Giro d’Italia in disappointing fashion earlier this season when he was out of position and unable to compete on stage two in Novara. Lotto Soudal won’t make the same mistake again, and on the first real chance for the pure sprinters, Caleb Ewan will show why he is one of, if not the best sprinter in the world. Caleb Ewan is our pick to win stage three of the Tour de France.</span></p>\n<p><em><span>Cover image: <span>Michael Steele / Getty Images</span></span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"398f2bf094c13adf154e7507869c77c800ac7238ef4e153f969daea649906139","category":"Cycling"}