{"title":"“Everything was much more dynamic”: Temporality of health system responses to Covid-19 in Colombia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311023","date":1727359200000,"content":"<p>by Simon Turner, Dennys Paola Fernandez</p>\r\n\r\nThis paper examines the role of temporality in the negotiation of unplanned adaptive tasks that were part of the health system response to the Covid-19 pandemic in Colombia. While research has been carried out on the temporal aspects of emergency preparedness, we argue that there is an empirical gap concerning how health care organizations responded with temporal urgency to Covid-19. The dataset (118 interviews) from which a subset of interviews were analysed for this paper was collected during the first wave of the pandemic in Colombia in 2020. Interviewees included representatives of national and regional governments, public hospitals and private clinic managers, clinicians, including physicians and nurses, laboratory directors, and academics. Narratives of two tasks are presented: reconfiguring clinical laboratories to expand the testing capacity for Covid-19 and increasing intensive care unit capacity for patients hospitalized with Covid-19. Through thematic analysis of the navigation of these tasks, the concept of “temporal shifts”, which signifies how organizations use time as a resource (analogous experiences, future projections) to negotiate unplanned service changes, is developed. This study highlights how powerful stakeholders deploy past and future projections to influence others´ perceptions in the negotiation of temporal shifts: a type of change that differs from the incremental and planned types described in previous organizational literature on temporality. This shift was initiated by rapid task delegation via organizational hierarchy, but accomplished through pressured, improvised actions at the operational level. The policy and practice implications we suggest relate to addressing social and organizational effects, including consequences for stakeholder engagement and staff wellbeing, generated by organizational leaders making decisions under “time stress”.","author":"Simon Turner","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3995a076ed7d6a359991eb69017e086af18760a925be11b3ef9fc256cbfeb18b","category":"Interdisciplinary"}