{"title":"Daily Telescope: Hubble images a dazzling star cluster 158,000 light-years away","link":"https://arstechnica.com/?p=1989628","date":1702299629000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Cluster_in_the_Cloud_pillars-800x544.jpg\" alt=\"This striking image shows the densely packed globular cluster known as NGC 2210, which is situated in the Large Magellanic Cloud.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Cluster_in_the_Cloud_pillars.jpg\">Enlarge</a> <span>/</span> This striking image shows the densely packed globular cluster known as NGC 2210, which is situated in the Large Magellanic Cloud. (credit:  ESA/Hubble &amp; NASA, A. Sarajedini, F. Niederhofer)</p>  </figure>\n\n\n\n\n      <p><em>Welcome to the <a href=\"https://arstechnica.com/tag/daily-telescope/\">Daily Telescope</a>. There is a little too much darkness in this world and not enough light, a little too much pseudoscience and not enough science. We'll let other publications offer you a daily horoscope. At Ars Technica, we're going to take a different route, finding inspiration from very real images of a universe that is filled with stars and wonder.</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p>Good morning. It's December 11, and today's photograph takes us to the Large Magellanic Cloud, which is one of the very nearest galaxies to our own and lies about 158,000 light-years away.</p>\n<p>This Hubble Space Telescope image showcases a brilliant globular cluster within the Large Magellanic Cloud. Such clusters are tightly bound and gravitationally stable, meaning millions of stars persist in a (relatively) tightly confined space for billions of years. This makes them an attractive target for astronomers seeking to study older stars.</p></div><p><a href=\"https://arstechnica.com/?p=1989628#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1989628&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"399a786f47c9452a59a53086da25211e56b0780d4c292b0634e9c15207f6a6a4","category":"Tech"}