{"title":"Apple Launches SF Symbols 5 With 700+ New Icons for Developers to Use in Apps","link":"https://www.macrumors.com/2023/10/05/sf-symbols-5/","date":1696530330000,"content":"Apple today introduced SF Symbols 5, a new version of the library of iconography that it provides to developers for use in apps. The icons have been created to integrate with San Francisco, the system font that Apple uses for its devices.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/sf-symbols-5.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThere are more than 5,000 symbols in total, with SF Symbols 5 adding 700 characters. Some of the new symbols in the update include game controller buttons, weather conditions, additional currencies, and automotive indicators. The symbols are available in apps running <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a>, <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">macOS Sonoma</a>, tvOS 17, and <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a>.\r<br />\n\r<br />\nThe update also introduces symbol animations with behaviors like bounce, scale, and pulse defining how symbols and their layers move. Apple says that the animated effects bring \"bring vitality to interfaces and provide feedback to user input while communicating changes in status and ongoing activity.\" To support animations, symbols have been redrawn and optimized for motion.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/sf-symbols-5-new-additions.jpg\" alt width=\"1632\" height=\"982\" />\r<br />\nApple included improved tools for developers who want to create custom symbols, including a library of enclosure shapes, badges, and slashes, along with updated annotation tools. A new inspector allows for animation previews for system symbols and custom symbols.\r<br />\n\r<br />\nDevelopers are able to use Apple's SF Symbols wherever there are interface icons, including navigation bars, toolbars, tab bars, and context menus.\r<br />\n\r<br />\nSF Symbols 5 can be <a href=\"https://developer.apple.com/sf-symbols/\">downloaded from Apple's developer site</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2023/10/05/sf-symbols-5/\">Apple Launches SF Symbols 5 With 700+ New Icons for Developers to Use in Apps</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-launches-sf-symbols-5-with-700-new-icons-for-developers-to-use-in-apps.2406472/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"39a0afafd6345824d29dcb70da7ac79e84ca2d6dbe2da3b6b48968178ee5cfce","category":"Apple"}