{"title":"Netflix Increases Streaming Quality of 'Basic With Ads' Plan to 1080p","link":"https://www.macrumors.com/2023/04/19/netflix-basic-ads-plan-1080p-resolution-bump/","date":1681896224000,"content":"Netflix is upgrading its nascent ad-supported plan to support higher quality streaming than the current maximum 720p resolution, the company has announced.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/Netflix-Smaller-4.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nNetflix launched its \"Basic With Ads\" plan in November for $6.99 per month in the United States, but the tier was immediately criticized for its limited video streaming resolution. \r<br />\n\r<br />\nThat criticism was only heightened the following month when Disney+ launched its rival ad-supported plan, \"Disney+ Basic,\" which for $7.99 per month lets users stream in Full HD, HDR10, 4K Ultra HD, Dolby Vision, and Expanded Aspect Ratio with IMAX Enhanced.\r<br />\n\r<br />\nIn its <a href=\"https://s22.q4cdn.com/959853165/files/doc_financials/2023/q1/Final-Q1-23-Shareholder-Letter.pdf\">Q1 2023 earnings report</a> released on Tuesday, Netflix said that it would be increasing the video quality of its Basic With Ads tier to 1080p at no extra cost to subscribers. Additionally, it said it would increase the number of simultaneous streams from one to two.\r<br />\n\r<br />\nNetflix said that customers in Canada and Spain would see the 1080p resolution and provision for additional streams immediately, with the upgrades to roll out to all markets by the end of the month. The more affordable tier is also available in the U.K., the U.S., Australia, Brazil, France, Germany, Italy, Japan, and South Korea.\r<br />\n\r<br />\nNetflix revealed in its earnings report that its Basic with Ads plan already brings in more revenue than its Standard plan, which costs $15.49 per month and offers HD quality streaming. The company also announced that it is shutting down its mailed DVD delivery service, which was Netflix's main revenue generator when it began nearly 25 years ago.<div>Tag: <a href=\"https://www.macrumors.com/guide/netflix/\">Netflix</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/19/netflix-basic-ads-plan-1080p-resolution-bump/\">Netflix Increases Streaming Quality of 'Basic With Ads' Plan to 1080p</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/netflix-increases-streaming-quality-of-basic-with-ads-plan-to-1080p.2387202/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"39b6069ad67d15c7d9ea6615670035e230a4a72ac7a90489106c141d839cdac2","category":"Apple"}