{"title":"Determinants of aggregate anthropometric failure among children under-five years in Ethiopia: Application of multilevel mixed-effects negative binomial regression modeling","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003305","date":1717509600000,"content":"<p>by Biniyam Sahiledengle, Lillian Mwanri</p>\r\n\r\nUndernutrition significantly contributes to failure to thrive in children under five, with those experiencing multiple forms of malnutrition facing the highest risks of morbidity and mortality. Conventional markers such as stunting, wasting, and underweight have received much attention but are insufficient to identify multiple types of malnutrition, prompting the development of the Composite Index of Anthropometric Failure (CIAF) and the Composite Index of Severe Anthropometric Failure (CISAF) as an aggregate indicators. This study aimed to identify factors associated with CIAF and CISAF among Ethiopian children aged 0–59 months using data from the 2019 Ethiopia Mini Demographic and Health Survey. The study included a weighted sample of 5,259 children and used multilevel mixed-effects negative binomial regression modeling to identify determinants of CIAF and CISAF. The result showed higher incidence-rate ratio (IRR) of CIAF in male children (adjusted IRR = 1.27; 95% CI = 1.13–1.42), children aged 12–24 months (aIRR = 2.01, 95%CI: 1.63–2.48), and 24–59 months (aIRR = 2.36, 95%CI: 1.91–2.92), those from households with multiple under-five children (aIRR = 1.16, 95%CI: 1.01–1.33), poorer households (aIRR = 1.48; 95%CI: 1.02–2.15), and those who lived in houses with an earthen floor (aIRR = 1.37, 95%CI: 1.03–1.82). Similarly, the factors positively associated with CISAF among children aged 0–59 months were male children (aIRR = 1.47, 95% CI = 1.21–1.79), age group 6–11 months (aIRR = 2.30, 95%CI: 1.40–3.78), age group 12–24 months (aIRR = 3.76, 95%CI: 2.40–5.88), age group 25–59 months (aIRR = 4.23, 95%CI: 2.79–6.39), children from households living with two and more under-five children (aIRR = 1.27, 95%CI:1.01–1.59), and children from poorer households (aIRR = 1.93, 95% CI = 1.02–3.67). Children were more likely to suffer from multiple anthropometric failures if they were: aged 6–23 months, aged 24–59 months, male sex, living in households with multiple under-five children, and living in households with poor environments. These findings underscore the need to employ a wide range of strategies to effectively intervene in multiple anthropometric failures in under-five children.","author":"Biniyam Sahiledengle","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"39c41fd553d824492d39661b4702a2ff992d954c7200136d10742a659bd731c4","category":"Environment"}