{"title":"One-instrument, objective microsatellite instability analysis using high-resolution melt","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302274","date":1714053600000,"content":"<p>by Kamilla Kolding Bendixen, Sofie Forsberg-Pho, Giulia Dazio, Emeli Elisabeth Hansen, Sarah Kronborg Eriksen, Samantha Epistolio, Elisabetta Merlo, Renzo Boldorini, Tiziana Venesio, Alessandra Movilia, Cecilia Caprera, Eva Christensen Arnspang, Michael Børgesen, Ulf Bech Christensen, Milo Frattini, Rasmus Koefoed Petersen</p>\r\n\r\nIn recent years, immune checkpoint inhibitors have proved immense clinical progression in the treatment of certain cancers. The efficacy of immune checkpoint inhibitors is correlated with mismatch repair system deficiency and is exceptionally administered based exclusively on this biological mechanism independent of the cancer type. The promising effect of immune checkpoint inhibitors has left an increasing demand for analytical tools evaluating the mismatch repair status. The analysis of microsatellite instability (MSI), reflecting an indirect but objective manner the inactivation of the mismatch repair system, plays several roles in clinical practice and, therefore, its evaluation is of high relevance. Analysis of MSI by PCR followed by fragment analysis on capillary electrophoresis remains the gold standard method for detection of a deficient mismatch repair system and thereby treatment with immune checkpoint inhibitors. Novel technologies have been applied and concepts such as tumor mutation burden have been introduced. However, to date, most of these technologies require high costs or the need of matched non-tumor tissue as internal comparator. In this study, we present a novel, one-instrument, fast, and objective method for the detection of MSI (MicroSight® MSI 1-step HRM Analysis), which does not depend on the use of matched non-tumor tissue. The assay analyzes five well-described mononucleotide microsatellite sequences by real-time PCR followed by high-resolution melt and evaluates microsatellite length variations via PCR product melting profiles. The assay was evaluated using two different patient cohorts and evaluation included several DNA extraction methodologies, two different PCR platforms, and an inter-laboratory ring study. The MicroSight® MSI assay showed a high repeatability regardless of DNA extraction method and PCR platform, and a 100% agreement of the MSI status with PCR fragment analysis methods applied as clinical comparator.","author":"Kamilla Kolding Bendixen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"39c8eb3a9a7d79f70a2fd37de32f9b13f7763d65fa8621124f08c053e350fade","category":"Interdisciplinary"}