{"title":"55 Establishing grain-based modified protocols for re-feeding malnourished horses","link":"https://academic.oup.com/jas/article/102/Supplement_3/214/7757079?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Increased feed costs, forage availability, and the increasing number of malnourished horses present major challenges to the equine industry. The goal of this project was to test an adapted refeeding protocol using Bermuda hay and two commercial grain products in severely malnourished horses. So, an 8-wk study from January to March 2023 was conducted to evaluate the effects of Total Equine in the refeeding of 10 emaciated horses. Horses were previously destined for slaughter and purchased from an auction with an average body condition score (BCS) of 2.01 (S.D. ± 0.69), then quarantined for 30 d before starting the study following recommended biosecurity protocols. During quarantine, horses were evaluated by a veterinarian and received treatment as needed, vaccinations, deworming, and mares were pregnancy checked. All horses were provided with ad libitum Bermuda hay and water. Upon completion of the quarantine period, horses were blocked into two groups based on age, BCS, pregnancy status, and gender and randomly assigned to a diet. The Control (Ctrl) diet consisted of a commercial grain diet recommended and used by five local West Texas horse rescue groups and the Treatment (Trt) diet consisted of Total Equine. Both diets included ad libitum access to water and Bermuda hay (TDN 56.5) offered twice daily in port-a-grazer tubs to control waste and the amount was adjusted daily to maintain a 3% refusal rate. Grain was offered at a rate of 0.005% BW + 227 kg per the manufacturer’s suggestion, divided into 2 equal feedings with amounts adjusted weekly. Individual horses were weighed weekly using an electronic scale and BCS was evaluated at wk 0, 4, and 8. All horses were allowed a 1-h turnout in a dry-pen per day for 6 d each week. Blood samples were collected at wk 0, 4, and 8 for analysis. Health parameters were measured weekly throughout the study. Samples (grain, hay, hay orts) were collected twice weekly for DM, NDF, ADF, EE, CP, and Ash analysis. Data was analyzed using Proc Mixed in SAS. Overall, there was no significant difference between DMI by diet (Ctrl 8.74 kg/d and Trt 9.44 kg/d). However, a tendency for increased ADG (<span>P</span> = 0.06) for the Trt diet (Ctrl 0.20 kg/d &amp; Trt 1.34 kg/d) was noted. Efficiency calculated as (ADG/DMI) was significantly improved (<span>P</span> = 0.04) indicating an improvement in the efficiency of BW gain for the Trt diet compared with the Ctrl. Improved BW gain and efficiency of gain are of interest when rehabilitating malnourished horses. The establishment of accessible modified feeding protocols may improve efficiency and reduce the cost involved in the rehabilitation of malnourished horses and would be a step forward for the equine industry.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"39ca675c7b690b6851f836c2279c6dfab457e252975f3a9e5e20498f3ed1fa66","category":"Environment"}