{"title":"Status and influential factors of health literacy in patients with ischemic stroke: A cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307928","date":1722261600000,"content":"<p>by Weixiu Ouyang, Rui Wang, Yueyue He, Yuqing Song, Linqi Mo, Ling Feng</p>\r\nAim <p>The purpose of this study was to investigate the health literacy level and influencing factors of patients with ischemic stroke.</p> Design <p>A cross-sectional study was conducted.</p> Methods <p>We used convenient sampling to recruit potential participants. Patients with ischemic stroke who were hospitalized in the Department of Neurology, West China Hospital, Sichuan University in China from January 2022 to May 2023 were selected as subjects to complete the questionnaire survey. We used the National Institute of Health Stroke Scale to assess the neurological impairment of patients and the Health Literacy Scale for Chronic Patients to assess the health literacy level of patients.</p> Results <p>The overall health literacy level of ischemic stroke patients was high (99.13 ± 10.15). Age, education level, per capita monthly family income, living situations and National Institutes of Health Stroke Scale score were independent risk factors affecting the health literacy level of patients with ischemic stroke. Patients with a higher education level (<i>β</i> = 0.151, <i>P</i> = 0.006) and higher per capita monthly family income (<i>β</i> = 0.179, <i>P</i> = 0.001) had higher levels of health literacy. Patients who lived with their spouses (<i>β</i> = -0.117, <i>P</i> = 0.012) had higher health literacy. Patients at an older age (<i>β</i> = -0.151, <i>P</i> = 0.001) and patients with higher NIHSS scores (<i>β</i> = -0.450, <i>P</i> = 0.001) had lower health literacy levels.</p> Conclusions <p>Age, education level, family per capita monthly income, living situations and National Institute of Health Stroke Scale score were related to the health literacy level of patients with ischemic stroke. According to these associated factors, targeted health education should be developed to improve the health literacy of patients and health outcomes.</p>","author":"Weixiu Ouyang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"39d4b8b6c1a3e5bd1e3b14088e844626bfb00d0a7a38a369fa7dcf689f2ff6c9","category":"Interdisciplinary"}