{"title":"Solar powered POC lid, downcountry Schwalbe tyres and crazy light S-Works shoes","link":"https://www.bikeradar.com/features/first-look-friday/schwalbe-wicked-will-tyres/","date":1623992452000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/FotoJet-390ee31.jpg?quality=45&amp;resize=620,413\" />                                            <p>With the sun blaring through the windows, it’s an opportune time for my wrist to have suffered a hairline fracture, so I hope you’re enjoying riding more than I’m able to right now. Thanks, though, to the NHS for sorting me out with a wrist support, so I’m just about able to wobble around a few blues without wreaking havoc on my nervous system!</p>\n<p>However, I’ve still managed to bring you a few of my favourite things this week on BikeRadar, such as the latest update to my <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/lauf-true-grit-race-axs-long-term-review/\">long-term Lauf True Grit review</a> and, following literally years of testing, dubbing my pair of <a href=\"https://www.bikeradar.com/features/shimano-me7-shoes/\">Shimano ME7 shoes my High-Mileage Hero</a>.</p>\n<p>Continuing the gravel theme, Robyn also updated her long-term <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/canyon-grail-al-6-wmn-long-term-review/\">review of the Canyon Grail</a>, and we saw <a href=\"https://www.bikeradar.com/news/hed-emporia-gc3-performance-wheelset/\">new gravel wheels from HED</a>.</p>\n<p>In the podcast world, Warren spoke to <a href=\"https://www.bikeradar.com/features/bikeradar-meets-cervelo-aspero-5/\">Cérvelo’s director of product management</a>, Maria Benson, about the new Áspero 5, award-winning Caledonia 5 and what’s next for its legendary race bikes.</p>\n<p>But, the biggest news of the week has to be Matthew and Jack’s scoop – and exclusive pictures – of (what we believe to be) the new <a href=\"https://www.bikeradar.com/features/shimano-dura-ace-r9200/\">Shimano Dura Ace 12-speed groupset</a>. Boom!</p>\n<h2>POC Omne Eternal</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Like a POC Omne, but with added fancy tech.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>POC has taken the helmet light concept and gone one further, with a fully automatic system that needs pretty much no user input.</p>\n<p>A helmet light traditionally needs two things: a battery and a switch. POC seems to have circumnavigated both of those by using some pretty nifty materials and some interesting tech.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Powerfoyle solar cells are said to collect more energy than the light gives out.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>Between the three bridges on the top of the helmet is a ‘Powerfoyle’ material. It’s like a solar cell, in that it converts light to electricity, but this particular material is sensitive enough to be able to convert even indoor light into electricity for the light.</p>\n<p>This means it is pretty much always able to be charged, whether inside or out, summer or winter.</p>\n<p>The other fancy feature is that the lid is able to turn itself on and off automatically by sensing when you’ve got the helmet on. This means you’re never going to be out riding having forgotten to turn your light on, or not.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Always on, the rear light should boost safety.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>POC says that you should get around 10 hours of ‘burn’ time, but if you’re riding outside the helmet ‘absorbs’ about twice as much energy as it uses, in typical slightly cloudy weather. As such, it would take a fairly chunky night-ride to wear it out.</p>\n<p>POC does recommend storing it in light for at least an hour a day, though, to keep the system in optimal condition.</p>\n<p>As you may be able to tell, the Omne Eternal is based around POC’s Omne ‘standard’ lid, with all the bells and whistles that entails.</p>\n<ul><li>€250 – International pricing TBC</li>\n<li>Buy direct from <a href=\"https://www.pocsports.com/\" target=\"_blank\">pocsports.com</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Schwalbe Wicked Will</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The new Wicked Will.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>What happens when you mix XC speed with trail bike versatility? You get a downcountry bike.</p>\n<p>What happens when you mix (Schwalbe’s) XC tyres with trail tyres? You get the Wicked Will.</p>\n<p>Yes, this is a tyre for your downcountry bike, or, as we see it, a versatile option for your fast-rolling trail or gnarly XC bike.</p>\n<p>Basically, it’s a tyre that’s good for a range of trail situations, erring on the slightly lighter, slightly faster side of things.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Semi-ramped knobs help rolling resistance and cornering grip.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>Schwalbe has taken its burlier tread designs (think Nobby Nic) and lowered the knob height to levels seen on the likes of a Racing Ralph, to give that in-between mix of grip and speed.</p>\n<p>The central knobs are ‘semi-ramped’ which means there’s a gap in the middle of the knob that isn’t ramped. This, says Schwalbe, means you get the rolling speed benefits of a ramped knob while boosting cornering grip.</p>\n<p>Schwalbe will be offering the Wicked Will in a range of sizes and carcasses from 2.25 to 2.6in wide, in Super Race to Super Trail carcasses, and all in its SpeedGrip compound.</p>\n<p>Oh, and you’ll be able to choose from standard and skinwall (or ‘Transparent’) sidewalls. The 29×2.4in Super Race I have here comes in at a respectable 816g in the lighter Transparent sidewall.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> All you need to know about the tyre’s construction in one easy-to-read sidewall transfer.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>Want to get hold of some? Well, sadly you’ll be waiting until the first quarter of 2022. At which point, we’ll bring you confirmed pricing.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Garmin Charge Power Pack</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> This handy pack will help you ride well past sunset.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>Strictly speaking, this isn’t new – sorry. But it’s new to me so I thought it was worth bringing along to the show and tell.</p>\n<p>I rather like long rides, and since discovering that navigating roads and trails is a ton easier with a GPS, my trusty Garmin 830 has been pressed into some rather long action over the past 18 months.</p>\n<p>While 95 per cent of my rides haven’t stretched the life of my Garmin’s battery, there have been a couple of rides where I’ve been scraping the proverbial battery barrel.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> It’ll be a long old ride before this set-up runs out of juice.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>Those times are no more, though, because the Charge Power Pack seamlessly adds 3,100 mAh of lithium battery capacity, boosting my potential ride time to around 24 hours. Now that’s a damn long ride, but well within the realms of what I’ve done in the past and, potentially future.</p>\n<p>I did need a new Garmin mount for my bike, requiring the Flush Out Front mount with it’s removable centre plate. This is because the Charge Power Pack comes with a pair of locking levers that basically sandwich the battery and your Garmin around the mount. Then, through the magic of physics, electrons are passed* from the battery to the computer via the brass connectors on each unit.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The five brass dots transfer electricity from the battery to the underside of the unit – no cables needed.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>The Charge Power Pack might be niche in its application, but is worth considering if you’re a long-range rider, I reckon. It’ll add just shy of 150g to your bike.</p>\n<p>*Clearly my understanding of electronics is limited! Comment below to teach me how it really works.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<p> </p>\n<h2>Specialized S-Works Exos EVO</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Not many grams of XC race shoe.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>While getting these posh photos taken, our snapper Russell Burton queried why one would want ‘lightweight’ mountain bike shoes. Then he picked them up.</p>\n<p>They’re stupendously light, 516g for the pair, which pits them against some of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-cycling-shoes/\">best road bike shoes</a> around. And yet they have toe protection and a tread on the bottom to help grip the dirt when you inevitably have to get off and run up a muddy slope.</p>\n<p>How has Specialized done this? Well, its FACT Carbon sole no doubt helps keep things svelte, but it’s the Dyneema upper that’s the star of the show.</p>\n<p>It’s very thin and almost crinkly (though doesn’t make a crinkly noise when you manipulate it around). Lessons have clearly been learned from the <a href=\"https://www.bikeradar.com/news/specialized-claims-99g-s-works-exos-99-is-lightest-production-shoe-ever-made/\">Specialized S-Works Exos 99 shoe</a> (which comes in at an unbelievable 99g per foot!)</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Specialized-Exos-BOA-6b1ada7.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>A single Boa dial secures the shoe.</span>\n    </figcaption><span>\n                    <i>Russell Burton / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Specialized-Exos-inside-3e159d7.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Specialized’s Body Geometry aims to keep knee and hip alignment optimised.</span>\n    </figcaption><span>\n                    <i>Russell Burton / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Specialized-Exos-heel-9064454.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>This heel tab is needed to get the shoe on.</span>\n    </figcaption><span>\n                    <i>Russell Burton / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nThe front half of the top of the shoe gets a slightly thicker feeling material and the heel tab at the back is vital for pulling the shoe on because with such a thin, flexible material, the upper can collapse under a misplaced ankle.\n<p>Still, this is the cost of getting what has to be one of the lightest mountain bike shoes right now.</p>\n<p>Oh, cost, did you say? Yeah, £400 / $425 / €499.90</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>","author":"Tom Marvin","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"39d5b3e00674adebb9714d828145896f9e7fec86b75f91feadd5aa20af1849ca","category":"Cycling"}