{"title":"PSV-13 The influence of diet type on beef cattle performance and meat quality characteristics","link":"https://academic.oup.com/jas/article/102/Supplement_2/337/7665063?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to determine what additive effect hormonal implants and inclusion of beta-agonists in the diet have on carcass quality in yearling beef steers. Hereford-cross steers [n = 21; initial body weight (BW) = 450 ± 15 kg] were assigned to one of three drylot pens based on initial BW and sire so that each pen had an equal starting BW and sires were equally represented in each pen. Each drylot pen was assigned to one of three treatments: receiving a hormonal implant (IMP), consuming a beta-agonist (BAG), or receiving both of the previous treatments (AND). All steers were fed a mixed ration consisting of 30.0% rye silage, 28.0% DDGS, 30.0% rolled corn, 10.5% soybean meal, and 1.5% mineral supplement [22.0% CP, 2.90 Mcal ME/kg dry matter (DM)]. Animals were fed daily at 0700 and 1700 h and weighed weekly at 0630 h. For the duration of the trial, animals were housed in drylot pens with ad libitum access to feed and water and had shade structures in each pen. Following a 15-d adaptation period, feed intake was recorded for 45 d. Body weight gain for each treatment group were 1.26, 1.28, and 1.48 kg/d for IMP, BAG, and AND, respectively. Animals on the AND treatment were significantly more feed efficient than the IMP treatment with F:G ratios of 5.9 kg/kg gain and 6.8 kg/kg gain, respectively. After the intake portion of the study was completed, an animal from each pen was slaughtered and evaluated for carcass quality. Hot carcass weights for diets IMP, BAG, and AND were 347.4, 352.9, and 394.8 kg, respectively. Data were analyzed as a completely random design in SAS v9.4. There was not a significant difference between the IMP treatment and the AND treatment based on assessment from Warner-Bratzler shear force, carcass yield, marbling score, and sensory assessment (<span>P</span> &gt; 0.05); however, the BAG treatment had less marbling than the other two treatments. It was concluded that the additive effect of using both a hormonal implant and a beta-agonist can improve feed intake and feedlot performance without detrimental effects on carcass quality.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"39db87ccee4d1e10297a76b41f88b320b698f14328fe6e4d1cb4e07316458609","category":"Environment"}