{"title":"Cuttlefish camouflage gets complicated","link":"https://arstechnica.com/?p=1950273","date":1687964401000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/cuttleTOP-800x533.jpg\" alt=\"close-up of a cuttlefish head\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/cuttleTOP.jpg\">Enlarge</a> <span>/</span> This cuttlefish can change its skin pattern to blend in with different background environments. (credit: Stephan Junek, Max Planck Institute for Brain Research)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It's well known that cuttlefish and several other cephalopods can rapidly shift the colors in their skin thanks to that skin's unique structure. But according to a new paper published in the journal Nature, the process by which cuttlefish generate those camouflage patterns is significantly more complex than scientists previously thought.</p>\n<p>“Prior research suggested that cuttlefish only had a limited selection of pattern components that they would use to achieve the best match against the environment,\" <a href=\"https://www.oist.jp/node/39735\">said co-author Sam Reiter</a> of the Okinawa Institute of Science and Technology (OIST). \"But our latest research has shown that their camouflaging response is much more complicated and flexible—we just hadn’t been able to detect it, as previous approaches were not as detailed or quantitative.” Their quantitative approach combined high-resolution video with machine learning to investigate not just camouflage patterns but the related process of \"blanching\" in response to threats.</p>\n<p>Cuttlefish and their fellow cephalopods are fascinating creatures. For instance, a <a href=\"http://dx.doi.org/10.1098/rspb.2020.3161\">2021 study</a> showed that cuttlefish can <a href=\"https://arstechnica.com/science/2021/03/cuttlefish-can-pass-the-marshmallow-test/\">delay gratification</a>. Specifically, they could pass a cephalopod version of the famous <a href=\"https://en.wikipedia.org/wiki/Stanford_marshmallow_experiment\">Stanford marshmallow test</a>: waiting a bit for their preferred prey rather than settling right away for a less desirable prey. Cuttlefish also performed better in a subsequent learning test—the first time such a link between self-control and intelligence has been found in a non-mammalian species. Cuttlefish also seem to exhibit a <a href=\"https://royalsocietypublishing.org/doi/10.1098/rspb.2021.1052\">form of episodic memory</a>, but unlike humans, their capability doesn't decrease as they age. </p></div><p><a href=\"https://arstechnica.com/?p=1950273#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1950273&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"39e36d42531721468395204d365a58edc58ce292146ddeaa860bb99e5c1f263a","category":"Tech"}