{"title":"How Apple Vision Pro Works With the Mac","link":"https://www.macrumors.com/2023/06/06/apple-vision-pro-mac/","date":1686088583000,"content":"Apple Vision Pro is a standalone hardware device that has its own processors and does not require a connection to a Mac or an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> to operate, but it is able to interface with other Apple devices. With the Mac, for example, the Vision Pro can serve as a Mac display.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/apple-vision-pro-mac.jpg\" alt width=\"1200\" height=\"675\" />\r<br />\nApple says that there's a Mac Virtual Display feature that works wirelessly with the Mac. You can bring your Mac's display into Vision Pro and \"place it anywhere in space.\" You can see each of your Mac apps individually, arranging them in a way that works for you. \r<br />\n\r<br />\nAccording to Apple, the Vision Pro is meant to serve as a \"private, portable 4K display\" when used with a Mac. Connecting is as simple as looking at a compatible Mac while wearing the Apple Vision headset. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/apple-vision-pro-mac-desktop.jpg\" alt width=\"1200\" height=\"666\" />\r<br />\nYou can connect Mac accessories to the Vision Pro, including the Magic Keyboard and the Magic Trackpad for input purposes. Attaching Bluetooth accessories allows for a typical Mac workflow to continue to be used, with the display replaced by Vision Pro.\r<br />\n\r<br />\nVision Pro is set to launch in early 2024, so we won't know more about how it functions as an actual Mac display replacement until closer to that date. The headset is priced starting at $3,499.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">AR/VR Headset</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/06/apple-vision-pro-mac/\">How Apple Vision Pro Works With the Mac</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/how-apple-vision-pro-works-with-the-mac.2391967/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"39e47824fe38bc212f3cef570b4437a521598540ee45cbb59e0ac8d2cfa70aad","category":"Apple"}