{"title":"Real-Time Document Collaboration System Using Orchestrated Containers","link":"https://www.preprints.org/manuscript/202408.1228/v1","date":1724034417000,"content":"In modern times, technology has become more than just a tool; it is a vital component of our lives, driving society and humanity towards new horizons, better living standards, and solu-tions for complex, global challenges. This article explores the world of dependable systems, specifically focusing on system design, software solutions, and architectural decisions that fa-cilitate collaborative work. It aims to dive into the intricacies of designing robust and effective document collaboration software. Throughout this paper, readers will gain insights into the proposed design process, enabling them to understand, learn from, and critically evaluate the examined methodologies and outcomes. Like everything else in the software technology field, there are multiple solutions to any given problem, and this work is no exception to this rule.\nThe objective of this study is to provide a detailed architectural overview of the microservices pattern in an orchestrated cloud environment based on independent containers. To examine the pros and cons of such a system, the paper will detail how a real-time document collaboration system can benefit from such an architecture regarding availability, elasticity, scaling, and disaster recovery. \nMoreover, the paper will analyze how cloud-native technologies can be used to create a scalable platform solution, capable of handling traffic, dynamic resource storage, asynchronous com-munication, and application scaling. The intricate nature of this system renders this paper a valuable resource for prospective investigations within the domain of dependable systems, cloud computing, and distributed systems.\nThis paper not only showcases the design and implementation process but also sets a founda-tion for future research and innovation in dependable systems, collaborative technologies, sustainable solutions, and distributed system architecture.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"39f14d623722e06ab95930f051ef08e5c68d215ca9ab68a1100089dc0fab800f","category":"Interdisciplinary"}