{"title":"Exploring the Potential Influence of Human Gut Microbiota on Gut Resistome: A Systematic Review","link":"https://www.preprints.org/manuscript/202407.1742/v1","date":1721712320000,"content":"Antibiotic resistance is a global health problem. The human gut microbiome is implicated in the dynamics of antibiotic resistance acquisition and transmission, with the gut microbiota thought to play a crucial role. This study aimed to determine the potential influence of human gut bacteria microbiota on the gut resistome and the relationship between gut background microbiota and Escherichia coli resistome. The PRISMA (Preferred Reporting Items for Systematic Reviews and Meta-Analyses) guidelines was used to systematically review studies that characterised gut microbiota and resistome using metagenomic analysis and/or those that reported gut E. coli resistome in healthy individuals. Changes in the diversity and abundance of bacterial gut microbiota and the resistome across different groups and the microbiota composition of the gut harbouring antibiotic-resistant E. coli were summarised. Findings suggest that lower bacterial microbiota diversity is likely associated with an increased abundance of the overall gut resistome. Age-related differences were observed, with younger infants exhibiting lower microbiota diversity and higher ARG abundance compared to older infants and adults. Studies that reported correlation revealed positive correlations between the compositional relative abundance of Proteobacteria and ARGs abundance, mainly driven by members within the Enterobacteriaceae family, particularly E. coli. This study also revealed that human gut microbiome studies that investigate gut resistome using metagenomic sequencing approaches in apparently healthy individuals are at least uncommon.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"39ff686bae8613464443b3fdc98ad1578ad4670986dd0aca98ee68bb20c9d4d4","category":"Interdisciplinary"}