{"title":"Todos los productos de Apple que llegarán este mes de agosto","link":"https://www.macworld.com/article/2021651/lanzamientos-apple-agosto-2023.html","date":1691407611000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple no suele lanzar nuevo <em>hardware</em> en el mes de agosto. Hace unos años, la última actualización del iMac de 27″ basado en Intel sí que llegó en agosto, pero fue una extraña excepción a la regla. La empresa se espera a septiembre para lanzar nuevos iPhones y Apple Watches, además de actualizaciones del sistema operativo principales para todos sus productos.</p>\n\n\n\n<p>La empresa está demasiado ocupada preparándose para ese gran septiembre como para sacar novedades en agosto. Si no estaba listo para ser lanzado durante la WWDC de junio, el producto no llegará hasta otoño.</p>\n\n\n\n<p>Si bien no se espera la llegada de nuevo <em>hardware</em> en agosto, las novedades de <em>software</em> empiezan a ponerse interesantes ahora que las últimas versiones beta de los próximos grandes sistemas operativos empiezan a estar más completas y pulidas.</p>\n\n\n\n<p>Y, por supuesto, hay nuevos estrenos en Apple TV+ y Apple Arcade.</p>\n\n\n\n<p>Esto es todo lo que se espera en el mundo de Apple en agosto de 2023. Para todo lo demás que está por venir, no te pierdas nuestro artículo sobre las <a href=\"https://www.macworld.com/article/1452826/predicciones-rumores-apple.html\">predicciones de Apple en 2023 y 2024</a>.</p>\n\n\n\n<h2>¿Qué productos de hardware de Apple llegarán en agosto de 2023?</h2>\n\n\n\n<p>En agosto, no se espera la llegada de ningún <em>hardware</em> nuevo. No hay que descartar que llegue algo nuevo, pero las informaciones sugieren que no se anunciará nada hasta el evento del iPhone, en la segunda semana de septiembre.</p>\n\n\n\n<p>Septiembre será un gran mes: debería llegar toda la gama <a href=\"https://www.macworld.com/article/1474232/iphone-15-2.html\">iPhone 15</a>, el <a href=\"https://www.macworld.com/article/1668093/apple-watch-series-9-todo-lo-que-esperamos-ver-este-2023.html\">Apple Watch Series 9</a>, e quizás incluso un <a href=\"https://www.macworld.com/article/1458700/ipad-mini-7.html\">nuevo iPad mini</a> o unos AirPods con USB-C.</p>\n\n\n\n<p>Eso sí, este mes de agosto podrían llegar las invitaciones para el evento del iPhone 15, siempre dependiendo de lo temprano que sea el evento en septiembre. Los últimos rumores apuntan a que el evento será el miércoles 13 de septiembre, lo que significa que las invitaciones podrían salir el 30 o 31 de agosto. </p>\n\n\n\n<h2>¿Qué software de Apple llegará en agosto de 2023?</h2>\n\n\n\n<p>A finales de julio, Apple lanzó <a href=\"https://www.macworld.com/article/1924683/ios-16-6.html\">iOS 16.6</a> con una enorme lista de actualizaciones de seguridad, pero sin nuevas funciones. Este julio, no llegó la iOS 16.7 beta, por lo que esto puede significar que iOS 16.6 podría haber sido el último lanzamiento de iOS 16.</p>\n\n\n\n<p>De este modo, Apple podría estar centrando todos sus esfuerzos en el lanzamiento de <a href=\"https://www.macworld.com/article/1530492/ios-17-2.html\">iOS 17</a> en otoño, junto con <a href=\"https://www.macworld.com/article/1674028/ipados-17.html\">iPadOS 17</a>, tvOS 17, una actualización de HomePod, <a href=\"https://www.macworld.com/article/1676280/watchos-10.html\">watchOS 10</a> y <a href=\"https://www.macworld.com/article/1675513/macos-14-apple.html\">macOS Sonoma</a>.</p>\n\n\n\n<p>Las betas públicas ya están aquí y deberían actualizarse un par de veces a lo largo del mes de agosto (las betas para desarrolladores quizás con más frecuencia).</p>\n\n\n\n<p><strong>Beta de iOS 17:</strong> La primera beta pública de iOS 17 llegó el 12 de julio, pero esa fue la única beta pública en llegar el mes pesado. Cabe esperar que se liberen más betas para desarrolladores y un par más de versiones beta públicas en agosto, con quizá alguna versión beta más en septiembre antes de que llegue la versión final de iOS 17.</p>\n\n\n\n<p>Las principales características incluyen el modo StandBy, el Buzón de voz en vivo, los mensajes de vídeo de FaceTime, varias funciones de Mensajes nuevas, <em>widgets</em> interactivos, mejoras en AirDrop, grandes mejoras en Siri y el dictado, y mucho más.</p>\n\n\n\n<p><strong>Beta de iPadOS 17:</strong> La mayoría de las nuevas funcionalidades de iOS 17 llegan también a iPadOS 17, aunque destaca que no lo haga el modo StandBy.</p>\n\n\n\n<p><strong>Beta de macOS Sonoma:</strong> El nuevo macOS recibe <em>widgets</em> interactivos en el escritorio (incluidos <em>widgets</em> del iPhone cercano), nuevas funciones de Safari, funciones de videoconferencia y el Game Mode para mejorar el rendimiento de los juegos.</p>\n\n\n\n<p><strong>Beta de watchOS 10:</strong> La próxima actualización de watchOS representa un cambio importante en la interfaz de usuario del Apple Watch, con aplicaciones rediseñadas, un énfasis en los <em>widgets</em> y un nuevo Grupo Inteligente cargado con fragmentos relevantes de información a lo largo del día.</p>\n\n\n\n<p><strong>Beta de tvOS 17:</strong> La característica clave de tvOS 17 es FaceTime en la gran pantalla del televisor, utilizando el iPhone (con iOS 17) como cámara y micrófono gracias a la Cámara de continuidad.</p>\n\n\n\n<h2>¿Qué novedades llegan en los servicios de Apple en agosto de 2023?</h2>\n\n\n\n<p>Otras novedades que sí podemos afirmar con rotundidad son aquellas que llegan en dos de los servicios de Apple: <a href=\"https://www.macworld.com/article/1457451/que-series-y-peliculas-llegaran-a-apple-tv-en-2023.html\">Apple TV+</a> y <a href=\"https://www.macworld.com/article/1451570/los-mejores-juegos-en-apple-arcade.html\">Apple Arcade</a>.</p>\n\n\n\n<h3>Apple TV+</h3>\n\n\n\n<p><strong><em><a href=\"https://www.macworld.com/article/1457935/physical-apple-tv-plus.html\">Physical</a></em> (temporada 3, 2 de agosto):</strong> Llega la tercera y última temporada de esta comedia/drama sobre un ama de casa que inicia un negocio de <em>fitness</em> en casa en los años ochenta, y que la lleva a un viaje de empoderamiento.</p>\n\n\n\n<p><strong><em>Strange Planet</em> (estreno, 9 de agosto):</strong> Serie de animación basada en el cómic y las novelas gráficas de Nathan Pyle. El cómic presenta a alienígenas que viven de forma parecida a la nuestra, pero que se refieren a nuestras actividades cotidianas con una verborrea inusual y a veces científica (como llamar a un abrazo “encierro de extremidades”).</p>\n\n\n\n<p><strong><strong><em>Snoopy Presents: One-of-a-Kind Marcie</em> (episodio especial, 18 de agosto)</strong>:</strong> Este especial de Peanuts sigue a Marcie, una introvertida que adora su soledad pero que también disfruta ayudando a sus amigos.</p>\n\n\n\n<p><strong><em>Invasión</em> (23 de agosto, temporada 2):</strong> Una arrolladora serie dramática de ciencia ficción que sigue una invasión alienígena a través de diferentes perspectivas en todo el mundo.</p>\n\n\n\n<p><strong><em>Wanted: The Escape of Carlos Ghosn</em> (docuserie, 25 de agosto)</strong>: Miniserie documental de cuatro capítulos inspirada en el libro <em>Boundless</em>, <em>Wanted</em> cuenta la historia Carlos Ghosn, consejero delegado de la industria automovilística convertido en fugitivo.</p>\n\n\n\n<h3>Apple Arcade</h3>\n\n\n\n<p>Apple suele estrenar nuevos juegos de Apple Arcade los viernes. Aunque no siempre es así, cada semana de este mes de agosto estará marcado por la llegada de un nuevo videojuego:</p>\n\n\n\n<ul>\n<li><strong><em>Nekograms+</em> </strong>(8 de agosto)</li>\n\n\n\n<li><strong><em>Kingdoms: Merge &amp; Build</em> </strong>(18 de agosto)</li>\n\n\n\n<li><strong>finity. </strong>(25 de agosto)</li>\n\n\n\n<li><strong><em>Samba de Amigo: Party-To-Go</em> </strong>(29 de agosto)</li>\n</ul>\n\nApple Inc, Apple Watch, iOS, iPad, iPhone, Mac, MacBook, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3a01af7b23a72c7887af18f9ce42307ea7acf1235b70afb93aea401c79a1740e","category":"Apple"}