{"title":"รมว. DES ระบุการพิจารณาข่าวทำให้หวาดกลัวเป็นดุลยพินิจของเจ้าหน้าที่, การนำเสนอต้องไม่ใช่มุมลบอย่างเดียว","link":"https://www.blognone.com/node/123971","date":1627619099000,"content":"<div><div><div><p>หลังจากที่<a href=\"https://www.blognone.com/node/123964\">ประยุทธ์ออกคำสั่งตัดอินเทอร์เน็ตผู้เสนอข่าว ที่อาจทำให้ประชาชนเกิดความหวาดกลัวจนกระทบความมั่นคง</a>ไป วันนี้ รมว. DES ให้สัมภาษณ์ระบุว่าการตีความว่าข่าวใดที่เข้าข่ายทำให้หวาดกลัวต้องดูที่เจตนา โดยดุลยพินิจเป็นของเจ้าหน้าที่กระทรวง DES กสทช. และเจ้าหน้าที่ตำรวจ และการเสนอข่าวแม้จะเป็นความจริงแต่ถ้าเป็นการเสนอข่าวที่ไม่ครบถ้วนที่อาจก่อให้เกิดความเสียหายต่อความเชื่อมั่นก็อาจเข้าข่ายดังกล่าวได้</p>\n<p>เมื่อเช้าวันนี้ นายชัยวุฒิ ธนาคมานุสรณ์ รัฐมนตรีว่าการกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม (DES) ให้สัมภาษณ์ในรายการเจาะลึกทั่วไทย Inside Thailand ว่าด้วยคำสั่งตาม พรก. ฉุกเฉินฯ โดยระบุว่าข้อ 1 ตามคำสั่งดังกล่าวจะดูจากเจตนาเป็นหลักและผลกระทบที่เกิดขึ้น ครอบคลุมทั้งสื่อมวลชนและบุคคลทั่วไปที่ใช้อินเทอร์เน็ตในการสื่อข่าว แม้จะเป็นเรื่องจริง แต่ถ้าเป็นการเสนอ \"ในมุมที่เป็นลบอย่างเดียว มุมบวกไม่ได้ออกมา ทำให้คนเข้าใจผิด\" ก็เข้าข่ายผิดข้อดังกล่าว</p>\n<p>ต่อข้อคำถามเรื่องการแสดงความไม่เห็นด้วยต่อการทำงานของรัฐบาล (call-out) นั้น รมว. ตอบว่าน่าจะเป็นการแสดงออกทางการเมือง ไม่เข้าข่ายตามคำสั่งดังกล่าว โดยยกตัวอย่างคลิปวีดิโอของดาราต่างๆ ระบุว่ายังไม่เห็นใครถูกดำเนินคดี</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b2bfa8cd8fecd7a5239a3ef2e58b84d9.jpg\" /></p>\n<p>ภาพจาก <a href=\"https://www.facebook.com/prmdes.official/photos/a.329293557505717/1240856459682751/\">Facebook กระทรวง DES</a></p>\n<p>เมื่อถามถึงการเสนอภาพผู้ป่วยผู้เสียชีวิตที่ประสบเหตุริมถนน รมว. ตอบว่าต้องดูที่เจตนา ถ้าเจตนาบริสุทธิ์ ไม่ได้คิดที่จะ discredit ก็ไม่น่ามีปัญหา แต่ถ้าเป็นการ \"แกล้งมาถ่ายแล้วเอามาโพสต์\" ถือเป็นผิด กระนั้นจะถือว่าทำให้หวาดกลัวหรือไม่ก็ต้องดูเจตนา ไม่อาจจะตอบได้ทันที</p>\n<p>ว่าด้วยการเสนอความเห็นทางวิชาการนั้น รมว. กล่าวว่าแม้จะเป็นความเห็นจริง แต่ถ้าเป็นความเห็นคนเดียวแล้วนำมาออกข่าว ทำให้คนไม่กล้ามาฉีด \"มีข้อมูลอื่นอีกเยอะ แล้วไม่เอามาพูด\" ก็ถือว่าเจตนา discredit เพื่อหวังผลทางการเมือง ควรจะให้ข้อมูลครบถ้วน</p>\n<p>เมื่อถูกถามเรื่องดุลยพินิจในการพิจารณานั้น รมว. ตอบว่าโดยหลักการเป็นอำนาจของเจ้าหน้าที่กระทรวง DES กสทช. และเจ้าหน้าที่ตำรวจ โดยก่อนหน้าก็มีการทำงานร่วมกันตามอำนาจใน พรบ. ว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ในการปิดกั้น website อยู่แล้ว การออกคำสั่งดังกล่าวเพื่อให้สามารถใช้อำนาจของ กสทช. ทำให้กระบวนการดังกล่าวเร็วขึ้นจากเดิมที่ต้องอาศัยกระบวนการทางศาลซึ่งต้องใช้เวลาประมาณ 1-2 สัปดาห์ อาจไม่ทันการที่ข้อมูลอาจเผยแพร่อย่างกว้างขวางในไม่กี่ชั่วโมง</p>\n<p>เมื่อถูกถามว่าเจตนาว่าจะรบกับสื่อ ประชาชน หรือใครนั้น รมว. กล่าวว่าเจตนาไม่อยากก่อปัญหากับสื่อมวลชน เพราะไม่ใช่ปัญหาหากเสนออย่างมีจริยธรรม โดยเน้นคำว่าอินเทอร์เน็ตในประกาศ \"ก็คือสื่อออนไลน์ สื่อเทียม คนที่ไม่ใช่สื่อแต่ทำตัวเสมือน คนเหล่านี้เค้าไม่มีจรรยาบรรณไม่มีมาตรฐานเหมือนพี่ผู้(ประกาศ)ข่าว และก็มีเจตนาแอบแฝงทางการเมืองด้วย บางทีก็เจตนาแอบแฝงทางธุรกิจ ซึ่งสิ่งต่างๆ เหล่านี้คือสิ่งที่เราต้องเข้าไปกำกับดูแล\"</p>\n<p>ตอนท้ายของการสัมภาษณ์ เมื่อพิธีกรถามถึงการแถลงของ รมว. หลังการประชุมแก้ไขปัญหา Fake news ที่กล่าวว่าจะมีมาตรการทางปกครองและทางภาษีจัดการ \"พวกปั่นข่าว Fake news\" นั้น จะมีการตรวจสอบภาษีย้อนหลังของคนที่จะถูกดำเนินการหรือไม่นั้น รมว. กล่าวว่า platform ที่จดทะเบียนอยู่ต่างประเทศไม่ได้เสียภาษีให้ประเทศไทยอยู่แล้ว จะใช้เรื่องนี้เป็นตัวขับเคลื่อนในการแก้ไขปัญหาทางภาษี ทั้งนี้ไม่ได้ตอบถึงการดำเนินการตรวจสอบเป็นรายบุคคลโดยชัดแจ้งแต่อย่างใด</p>\n<p><strong>ที่มา</strong>: <a href=\"https://youtu.be/p5Bc5GalZNA?t=1257\">รายการเจาะลึกทั่วไทย Inside Thailand (ตั้งแต่เวลา 08:19 - 08:33 น.)</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/thailand\">Thailand</a></div><div><a href=\"/topics/mict\">MICT</a></div><div><a href=\"/topics/law\">Law</a></div></div></div>","author":"itpcc","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3a034f5d8aed2948cb5caf62bf112e9aa5941790b69887021e2b3e33edbcbdb6","category":"Thai"}