{"title":"Apple pushes iOS 14.4.1 with important Safari security updates","link":"https://www.macworld.com/article/3610737/apple-pushes-ios-14-4-1-with-important-safari-security-updates.html#tk.rss_all","date":1615229700000,"content":"<article>\n\t<section class=\"page\">\n<p>While we’re still anxiously waiting <a href=\"https://www.macworld.com/article/3605528/ios-14-5-features-release-date-beta-how-to-install.html\">iOS 14.5</a> to land, Apple hasn’t stopped working on smaller updates to the iPhone and iPad.</p><p>On Monday, Apple pushed iOS 14.4.1 to all compatible devices, bringing with it important security updates. The release notes are very technical, but it appears to target a specific vulnerability that poses a risk to the Webkit rendering engine used by Safari (and third party browsers). Here are <a href=\"https://support.apple.com/en-us/HT212221\" rel=\"nofollow\">the security release notes</a>:</p><ul>\n<li><strong>Available for:</strong> iPhone 6s and later, iPad Air 2 and later, iPad mini 4 and later, and iPod touch (7th generation)</li>\n<li><strong>Impact:</strong> Processing maliciously crafted web content may lead to arbitrary code execution</li>\n<li><strong>Description:</strong> A memory corruption issue was addressed with improved validation.</li>\n<li><strong>CVE-2021-1844:</strong> Clément Lecigne of Google’s Threat Analysis Group, Alison Huffman of Microsoft Browser Vulnerability Research</li>\n</ul>\n<p>“Arbitrary code execution” is just about the three worst words in web security, so you should probably grab this update soon.</p><p class=\"jumpTag\"><a href=\"/article/3610737/apple-pushes-ios-14-4-1-with-important-safari-security-updates.html#jump\">To read this article in full, please click here</a></p></section></article>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3a0787f00d1481df259c47d8235906b7962cdbc79f499c22ffdffcecf755ce6f","category":"Apple"}