{"title":"Another Former Apple Employee Charged With Stealing Car Secrets for China","link":"https://www.macrumors.com/2023/05/16/apple-car-china-trade-secret-theft/","date":1684260104000,"content":"Former Apple employee Weibao Wang was today officially charged with theft of trade secrets for stealing critical <a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a> information and relaying it to China, reports <em><a href=\"https://www.cnbc.com/2023/05/16/doj-charges-former-apple-engineer-with-theft-of-autonomous-car-tech-for-china.html\">CNBC</a></em>. In an indictment [<a href=\"https://fm.cnbc.com/applications/cnbc.com/resources/editorialfiles/2023/05/16/apple-engineer-indictment.pdf\">PDF</a>] shared by the United States Department of Justice, Wang has been charged with six counts of trade secret theft for secretly accessing ‌Apple Car‌ data between 2016 and 2018.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/12/Apple-car-wheel-icon-feature-blue.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nWang was on the Annotation Team during his time at Apple, working on algorithms to accelerate the process of annotating real-world objects. Because of his role, he was granted \"broad access\" to databases that included information for the project. The information that he had access to was limited to just a few thousand of Apple's more than 135,000 full time employees.\r<br />\n\r<br />\nWang signed confidentiality and Intellectual Property Agreements before being granted access to Apple's databases, plus he attended secrecy training that covered the consequences of stealing data. Nevertheless, in 2016, he downloaded Apple's \"entire autonomy source code,\" and stole additional autonomous systems and hardware information shortly before resigning from his position at Apple in 2018.\r<br />\n\r<br />\nWhen he resigned, Wang did not tell Apple where he planned to go, but it turned out he had accepted a position at the U.S. subsidiary of a Chinese company developing autonomous driving technology. Apple in May 2018 reviewed data access logs and found that Wang accessed sensitive details right before he left, which is when the company involved the Department of Justice.\r<br />\n\r<br />\nIn June, the DoJ searched Wang's residence, at which point he purchased a one-way plane ticket from San Francisco, California to Guangzhou, China. After he made it to China, the extent of the theft was uncovered. There is a warrant for Wang's arrest, and if extradited and convicted, he will face up to 60 years in prison.\r<br />\n\r<br />\nWang is one of three Apple employees accused of attempting to steal ‌Apple Car‌ information for China. Last year, former <a href=\"https://www.macrumors.com/2022/08/22/apple-engineer-pleads-guilty-apple-car-trade-secrets/\">Apple employee Xiaolang Zhang</a> pled guilty to theft of trade secrets as part of a plea bargain. Zhang also attempted to flee the country, but he was caught. A third accused employee, Jizhong Chen, has pled not guilty.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/16/apple-car-china-trade-secret-theft/\">Another Former Apple Employee Charged With Stealing Car Secrets for China</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/another-former-apple-employee-charged-with-stealing-car-secrets-for-china.2389705/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3a0e85e46fcc0eb4bf3edc8c262b90274c8d0a985c74664e29c2a17b5c76ba50","category":"Apple"}