{"title":"Recent tree diversity increase in NE Iberian forests following intense management release: A task for animal‐dispersed and drought‐tolerant species","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14609?af=R","date":1708523228000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/7cf84c8c-c953-464e-9234-79c97c143bb3/jpe14609-toc-0001-m.png\" alt=\"Recent tree diversity increase in NE Iberian forests following intense management release: A task for animal-dispersed and drought-tolerant species\" />\n<p>The main drivers influencing the passive increase in tree species diversity suggest a primary role of diminishing forest exploitation in this recovery process, fine-tuned by climatic changes. This ecological scenario has particularly favoured animal-dispersed tree species with higher drought tolerance, which mostly led the diversity increase. A higher presence of such highly mobile and drought-tolerant species can be crucial to increase functional diversity and, ultimately, increase forest resilience under future scenarios of greater aridity. In light of these results, management strategies should continue fostering the restoration of diversity in once intensively exploited forests while ensuring the maintenance of the already gained tree species diversity.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nUnder increasing human-related threats to forests, many studies suggest that increasing tree species diversity may boost forest resilience by enhancing the range of species' responses to disturbances. However, it remains unclear whether passive or active forest management strategies should be applied to increase tree diversity. This issue would benefit from investigating which management and environmental factors, together with species' functional traits, influence temporal changes in tree species diversity.\n\nWe explored the influence of the bioclimatic region, land-use history, forest cover, protection, management, forest structure and changes in temperature and precipitation, to explain tree species diversity changes in NE Iberian forests, by comparing 3141 plots from the Spanish National Forest Inventory sampled between 1989 and 2016. Moreover, we assessed which species' functional traits (dispersal habit, drought and shade tolerance) were most relevant for diversity changes.\n\nAfter 27 years, tree species richness and diversity moderately increased in the tree and regeneration layers. This trend occurred mostly in long-established, non-recently managed forests and in those with a lower initial basal area. Increasing temperature had negative effects for diversity increase in the tree layer but positive for the regeneration compartment, while decreasing precipitation showed the opposite effects.\n\nTree species with higher drought tolerance, and especially those animal-dispersed ones arriving from the regional pool, mostly contributed to the local diversity increase. This pattern occurred in all forest types, although the taxonomic array of species varied.\n\n<i>Synthesis and applications.</i> The main drivers influencing the passive increase in tree species diversity suggest a primary role of diminishing forest exploitation in this recovery process, fine-tuned by climatic changes. This ecological scenario has particularly favoured animal-dispersed tree species with higher drought tolerance, which mostly led the diversity increase. A higher presence of such highly mobile and drought-tolerant species can be crucial to increase functional diversity and, ultimately, increase forest resilience under future scenarios of greater aridity. In light of these results, management strategies should continue fostering the restoration of diversity in once intensively exploited forests while ensuring the maintenance of the already gained tree species diversity.\n</p>\n<h2>Resumen</h2>\n<p>\n\nAnte las crecientes amenazas derivadas de las acciones humanas a las que se enfrentan los bosques, numerosos estudios sugieren que una mayor diversidad de especies arbóreas podría aumentar la resiliencia de los bosques al mejorar la variedad de respuestas frente a perturbaciones. Sin embargo, existe una incertidumbre respecto a qué estrategias de manejo forestal (i.e. pasivo o activo) se deben aplicar para aumentar la diversidad arbórea. Es por ello que resulta de interés investigar los factores ambientales y de gestión, junto con los rasgos funcionales de las especies, que influyen en los cambios temporales de la diversidad de especies arbóreas.\n\nExploramos la influencia de la región bioclimática, la historia de uso del suelo, la cubierta forestal, la protección, la gestión, la estructura forestal y los cambios de temperatura y precipitación, para explicar los cambios en la diversidad de especies arbóreas en los bosques del NE Ibérico, comparando 3141 parcelas del Inventario Forestal Nacional muestreado entre 1989 y 2016. Además, evaluamos qué rasgos funcionales de las especies (hábito de dispersión, tolerancia a la sequía y a la sombra) son más relevantes para los cambios de diversidad.\n\nPasados 27 años, se ha observado un aumento moderado de las especies arbóreas tanto en el estrato arbóreo como en el regenerado. Esta tendencia se produjo principalmente en aquellos bosques más antiguos, no gestionados recientemente y en aquellos con un área basal inicial más baja. El aumento de la temperatura tuvo efectos negativos para el aumento de la diversidad en el estrato arbóreo, aunque positivos para el regenerado, mientras que la disminución de la precipitación mostró los efectos opuestos.\n\nLas especies arbóreas con mayor tolerancia a la sequía, y especialmente aquellas dispersadas por animales que provienen del acervo regional, contribuyeron en gran medida al aumento de la diversidad local. Este patrón ocurrió en todos los tipos de bosque, aunque la identidad taxonómica de las especies varió.\n\n<i>Síntesis y aplicaciones</i>. Los principales factores que influyen en el aumento pasivo de la diversidad de especies arbóreas sugieren un papel primordial de la disminución de la explotación forestal en el proceso de recuperación, moderado por los cambios en las condiciones climáticas. Este escenario ecológico ha favorecido particularmente a las especies arbóreas dispersadas por animales y que presentan mayor tolerancia a la sequía, y éstas son en gran medida, las que condujeron al aumento de la diversidad. Por tanto, una mayor presencia de especies altamente móviles y tolerantes a la sequía puede ser crucial para aumentar la diversidad funcional y, en última instancia, aumentar la resiliencia de los bosques bajo futuros escenarios de mayor aridez. A la vista de estos resultados, las estrategias de gestión deberían seguir fomentando la restauración de la diversidad en los bosques que una vez fueron intensamente explotados, garantizando al mismo tiempo el mantenimiento de la diversidad de especies arbóreas ya presente.\n</p>","author":"Miriam Selwyn, \nJoan Pino, \nJosep Maria Espelta","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"3a153ad0672e9452158bfff05c7f1fddb758fb227f169ff8bd5c351667d7d722","category":"Environment"}