{"title":"Leveraging relationships between species abundances to improve predictions and inform conservation","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14670?af=R","date":1719985341000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/02d3d140-cc5a-4d38-b192-8a8074b5e2da/jpe14670-toc-0001-m.png\" alt=\"Leveraging relationships between species abundances to improve predictions and inform conservation\" />\n<p>We present guidelines for using conditional prediction, which can help understand relationships between species abundances, improve predictions and inform conservation in a variety of contexts.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nMany management and conservation contexts can benefit from understanding relationships between species abundances, which can be used to improve predictions of species occurrence and abundance.\n\nWe present conditional prediction as a tool to capture information about species abundances via residual covariance between species. From a fitted joint species distribution model, this framework produces a species coefficient matrix that contains relationships between species abundances. The species coefficients allow co-observed species to be treated as a second set of predictors supplementing covariates in the model to improve prediction. We use simulations to demonstrate the potential benefits and limitations of conditional prediction across data types and species covariance before applying conditional prediction to two management contexts with real data.\n\nSimulations demonstrate that conditional prediction provides the largest benefits to continuous data and when there is residual covariance between many species.\n\nIn our first application, we show that conditioning on other species improves in-sample and out-of-sample predictions of fish and invertebrate species, including Atlantic cod. In our second application, we show that the species coefficient matrix can be used to identify bird species at risk of nest parasitism by Brown-headed Cowbirds.\n\n<i>Synthesis and applications</i>. We present guidelines for using conditional prediction, which can help understand relationships between species abundances, improve predictions and inform conservation in a variety of contexts.\n</p>","author":"C. Lane Scher, \nSarah M. Roberts, \nKevin P. Krause, \nJames S. Clark","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"3a1bdb376c14de829263fa3ebbc5b764d4160d17370098f6c1154e407c599c55","category":"Environment"}