{"title":"สิงคโปร์ชี้วัคซีน Sinovac ไม่มีข้อมูลการป้องกันเชื้อสาย Delta, คนฉีดไม่ได้สิทธิ์เข้างานรวมตัวโดยไม่ต้องตรวจ COVID-19","link":"https://www.blognone.com/node/123504","date":1625029797000,"content":"<div><div><div><p>กระทรวงสาธารณสุขสิงคโปร์ประกาศว่าผู้ที่เลือกฉีดวัคซีน Sinovac จะไม่ได้สิทธิ์เข้าร่วมงานต่างๆ โดยไม่ต้องตรวจ COVID-19 ล่วงหน้า หรือ <a href=\"https://www.moh.gov.sg/covid-19/pet\">pre-event testing (PET)</a> เหมือนกับผู้ที่รับวัคซีน Pfizer หรือ Moderna และหลังจากนี้คลีนิกที่รับฉีดวัคซีน Sinovac จะต้องแจ้งผู้รับวัคซีนว่าสิทธิ์ต่างๆ จะไม่เท่ากับผู้รับวัคซีนตามโครงการหลักของรัฐบาล</p>\n<p>สิงคโปร์อนุญาตให้มีการจัดงานรวมตัวไม่เกิน 250 คน ได้แก่ งานแสดงสินค้า, คอนเสิร์ต, การรวมตัวทางศาสนา, โรงภาพยนตร์, และการแข่งขันกีฬา หากงานมีผู้เข้าร่วมเกิน 50 คนจะต้องตรวจผู้ร่วมงานก่อนเข้างานทุกคน โดยกระทรวงสาธารณสุขสิงคโปร์สนับสนุนให้ตรวจแบบ rapid test เนื่องจากได้ผลภายใน 30 นาที และหลังจากได้ผลตรวจแล้วจะเข้าร่วมงานรวมตัวได้ 24 ชั่วโมง หากมีงานนานกว่านั้นจะต้องกลับไปตรวจซ้ำ เงื่อนไขเช่นนี้ทำให้ผู้เข้าร่วมงานค่อนข้างยุ่งยาก แต่ผู้ป่วย COVID-19 ที่หายแล้วจะได้รับยกเว้น PET เป็นเวลา 270 วัน และผู้ได้รับวัคซีน Pfizer หรือ Moderna ครบสองเข็มแล้วสองสัปดาห์ก็ได้รับยกเว้นเช่นกัน</p>\n<p>เหตุผลของการจำกัดสิทธิ์เช่นนี้เรื่องจากตอนนี้ยังไม่มีข้อมูลว่าวัคซีน Sinovac สามารถป้องกัน COVID-19 ในเชื้อสายพันธุ์เดลต้าได้มากน้อยเพียงใด</p>\n<p>สิงคโปร์อนุญาตให้ใช้งาน Sinovac ได้หลัง WHO รับรองให้ใช้งานแบบฉุกเฉิน แต่ไม่รวมเอาเข้าโครงการวัคซีนแห่งชาติ <a href=\"https://www.blognone.com/node/122982\">ทำให้ผู้ที่ต้องการฉีดต้องจ่ายค่าฉีดเอง</a></p>\n<p>ที่มา - <a href=\"https://www.straitstimes.com/singapore/recipients-of-sinovac-covid-19-vaccine-not-exempted-from-pre-event-testing-moh\">Strait Times</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1a32927930eb36226fb1624f9a36fbb6.jpg\" /></p>\n<p>ภาพโดย <a href=\"https://pixabay.com/illustrations/virus-microscope-infection-illness-1812092/\">qimono</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/covid-19\">COVID-19</a></div><div><a href=\"/topics/singapore\">Singapore</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3a1fc18ed315e9c13186009925d93b0558f1ea410be9a85a396c32622bcbaafe","category":"Thai"}