{"title":"Cervical cancer screening outcomes for HIV-positive women in the Lubombo and Manzini regions of Eswatini—Prevalence and predictors of a positive visual inspection with acetic acid (VIA) screen","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002760","date":1713276000000,"content":"<p>by Rufaro Mapaona, Victor Williams, Normusa Musarapasi, Sharon Kibwana, Thokozani Maseko, Rhinos Chekenyere, Sidumo Gumbo, Phetsile Mdluli, Hugben Byarugaba, Dileepa Galagedera, Arnold Mafukidze, Alejandra Hurtado-de-Mendoza, Prajakta Adsul, Pido Bongomin, Christopher Loffredo, Xolisile Dlamini, Deus Bazira, Sylvia Ojoo, Samson Haumba</p>\r\n\r\nThis study aimed to describe the prevalence and predictors of a positive VIA (visual inspection with acetic acid) cervical cancer screening test in women living with human immunodeficiency virus (HIV). We retrospectively analysed data from women aged ≥15 who accessed VIA screening from health facilities in the Lubombo and Manzini regions of Eswatini. Sociodemographic and clinical data from October 2020 to June 2023 were extracted from the client management information system (CMIS). VIA screening outcome was categorised into negative, positive, or suspicious. A logistic regression model estimated the adjusted odds ratio (AOR) of the predictors of a positive VIA screen at p&lt;0.05 with 95% confidence intervals. Of 23,657 participants, 60.8% (n = 14,397) were from the Manzini region. The mean age was 33.3 years (standard deviation 7.0), and 33% (n = 7,714) were first-time screens. The prevalence of a positive VIA was 2.6% (95% CI: 2.2%, 3.0%): 2.8% (95% CI: 2.2%, 3.5%) in Lubombo and 2.4% (95% CI: 2.0%, 2.9%) in Manzini (p = 0.096). Screening at mission-owned (AOR 1.40; p = 0.001), NGO-owned (AOR 3.08; p&lt;0.001) and industrial/workplace-owned health facilities (AOR 2.37; p = 0.044) were associated with increased odds of a positive VIA compared to government-owned health facilities. Compared to those aged 25–34, the odds of a positive VIA increased by 1.26 for those in the 35–44 age group (AOR 1.26; p = 0.017). Predictors with lower odds for a positive VIA test were: being on anti-retroviral therapy (ART) for 5–9 years (AOR 0.76; p = 0.004) and ≥10 years (AOR 0.66; p = 0.002) compared to &lt;5 years; and having an undetectable viral load (AOR 0.39; p&lt;0.001) compared to unsuppressed. Longer duration on ART and an undetectable viral load reduced the odds, while middle-aged women and screening at non-public health facilities increased the odds of a positive VIA screen.","author":"Rufaro Mapaona","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"3a2ca893a521d437e37059775330c01adeb39e7821da719206243dfcfc712371","category":"Environment"}