{"title":"PSX-18 Long term implanting of finished Angus Hereford steers: examining the relationship between feed and water efficiency","link":"https://academic.oup.com/jas/article/102/Supplement_3/752/7757634?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Herein, we investigate the effects of a long-term release trenbolone acetate and estradiol implant (200 mg and 40 mg respectively, Revalor-XS; Merck Animal Health; Summit, NJ) on implanted [IMP; n = 9, body weight (BW) = 473.13 kg ± 25.22] and non-implanted (NIMP; n = 9, BW = 481.13 kg ± 21.78) finished Angus Hereford steers fed a single diet three times daily (0600, 1100, 1600 h). The objectives were to identify water and feed efficiency parameters and mechanisms of IMP and NIMP steers. Parameters evaluated included daily dry matter intake (DMI), freshwater intake (FWI), average daily gain (ADG), animal water units (AWU), drinking behavior, feed conversion (FC), feed conversion ratio (FCR), water conversion (WC), water conversion ratio (WCR), residual growth rate (RGR), and Kleiber index (KI). Linear mixed models were fitted to analyze the data under assumption of a completely randomized design, and variable relationships examined through partial correlation networks and principal component analysis. Implanted animals were more feed efficient than NIMP for FC (<span>P</span> &lt; 0.001; SEM = 0.00), FCR (<span>P</span> &lt; 0.001; SEM = 0.29), RGR (<span>P</span> &lt; 0.001; SEM = 0.0.02), and KI (<span>P</span> &lt; 0.001; SEM = 0.00). When evaluating water efficiency, IMP animals had less WCR (<span>P</span> &lt; 0.001; SEM = 1.54) and greater WC (<span>P</span> &lt; 0.001; SEM = 0.001). No differences were observed on marbling and carcass grades, but carcass weight, final BW, and rib eye area were greater for IMP groups (<span>P</span> &lt; 0.001, <span>P</span> &lt; 0.001, <span>P</span> = 0.004, respectively). For IMP, multivariate variable contribution (values &gt; 10) appeared to associate FWI on the first and second eigenvectors with DMI, FC, and FCR. For NIMP, FWI was associated with WC, WCR, and AWU. The FWI of Implanted animals was associated with AWU, WCR, while NIMP was associated with AWU. Feed conversion ratio and DMI had the greatest node strength for the IMP animals, whereas for NIMP, KI was the only node with strength greater than 2. Our results indicate that feed and water efficiencies may share mechanistic pathways. We present a simple metric that accurately remains relevant in evaluating water requirements for both IMP and NIMP steers as AWU. We show how relationship strength is related to gain and efficiency for IMP animals, whereas metabolic activity, potentially in relation to body composition changes, drives the variation and relationships for NIMP animals.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3a36c461997ea5ba897a1efe1498be9c62663a3a192b4e6db1c2333702aa5afd","category":"Environment"}