{"title":"Facebook Messenger Apple Watch App to Be Discontinued By End of May, Says Meta","link":"https://www.macrumors.com/2023/05/11/facebook-messenger-apple-watch-discontinued/","date":1683822021000,"content":"Facebook Messenger's Apple Watch app will be discontinued at the end of this month, according to Meta, ending the ability for users to reply to messages on the service from their wrist.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/02/facebook-messenger-icon-new.jpg\" alt width=\"1200\" height=\"630\" />\r<br />\nPosts <a href=\"https://twitter.com/M_anda_M/status/1656017246286749697?s=20\">shared on social media</a> carried a screenshot of a notification sent to a handful of users in recent days informing them that Messenger won't be available as an Apple Watch app after May 31, but that users would continue to get Messenger notifications on their watch. \r<br />\n\r<br />\nNot all users of the app received the notification, but when asked for clarification by <em><a href=\"https://www.reviewgeek.com/152972/facebook-messenger-to-leave-apple-watch-this-month/\">Reviewgeek</a></em>, a Meta spokesperson gave the following statement: \r<br />\n<blockquote>\"People can still receive Messenger notifications on their Apple Watch when paired, but starting at the end of May they will no longer be able to respond from their watch. But they can continue using Messenger on their iPhone, desktop and the web.”</blockquote>Meta did not give a reason for its decision to sunset its Messenger app for Apple Watch, which was introduced in 2015. The app allowed users to send voice clips, likes, stickers, and more without having to open the corresponding smartphone app. \r<br />\n\r<br />\nSome users on Facebook suggested it could be because allowing users to respond to messages on their wrist reduced the amount of screen time spent in Messenger on their smartphone. But the app joins a long line of other third-party services that have pulled watchOS development over the last few years, either due to perceived redundancy or lack of user uptake. Other notable Apple Watch apps that have been discontinued include Twitter, Instagram, Target, Trello, Slack, Hulu, and Uber.\r<br />\n\r<br />\n<div><blockquote><p>NOT HAPPY <a href=\"https://twitter.com/Apple?ref_src=twsrc%5Etfw\">@Apple</a> <a href=\"https://twitter.com/messenger?ref_src=twsrc%5Etfw\">@messenger</a> <a href=\"https://twitter.com/hashtag/applewatch?src=hash&amp;ref_src=twsrc%5Etfw\">#applewatch</a> <a href=\"https://twitter.com/hashtag/wtf?src=hash&amp;ref_src=twsrc%5Etfw\">#wtf</a> <a href=\"https://t.co/B81aK6EUf3\">pic.twitter.com/B81aK6EUf3</a></p>— Amanda Nova (@M_anda_M) <a href=\"https://twitter.com/M_anda_M/status/1656017246286749697?ref_src=twsrc%5Etfw\">May 9, 2023</a></blockquote> </div>\r<br />\nApple over time has gradually shifted away from promoting the Apple Watch as a home for apps, with the company focusing on fitness and health features as the primary functionality. Recent rumors suggest Apple intends to make <a href=\"https://www.macrumors.com/2023/04/16/watchos-10-major-update-gurman/\">interactive widgets</a> a big part of its <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a> redesign, which has been interpreted as proof that dedicated apps have not proved popular enough.\r<br />\n\r<br />\n<em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> <a href=\"https://www.macrumors.com/2023/04/30/gurman-widgets-to-be-central-part-watchos-10/\">believes</a> that the move is an admission that an iPhone-like app experience \"doesn't always make sense on a watch\" since \"Apple Watch apps have barely caught on.\" However, due to being a radical departure from the app-centric experience existing Apple Watch users are used to, Apple may make the new widget-based interface optional.\r<br />\n\r<br />\nThe changes are part of what Gurman claims will be one of the Apple Watch's <a href=\"https://www.macrumors.com/2023/04/16/watchos-10-major-update-gurman/\">biggest software updates</a> since its introduction and the most significant change to the Apple Watch this year, as only minor hardware updates are expected to be unveiled later this year.<div>Tags: <a href=\"https://www.macrumors.com/guide/facebook-messenger/\">Facebook Messenger</a>, <a href=\"https://www.macrumors.com/guide/meta/\">Meta</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/11/facebook-messenger-apple-watch-discontinued/\">Facebook Messenger Apple Watch App to Be Discontinued By End of May, Says Meta</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/facebook-messenger-apple-watch-app-to-be-discontinued-by-end-of-may-says-meta.2389277/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3a3948694c6d6fac02d23d8eceed114fd8556660f1c1b558db9855f717f88b4f","category":"Apple"}