{"title":"Silicon-, Silica- and, Silicate-Toothpastes for Remineralization and Repair of Teeth: A Scoping Review","link":"https://www.preprints.org/manuscript/202408.1436/v1","date":1724154130000,"content":"The purpose of this scoping review was to identify gaps in the literature and summarize findings from studies examining the use of silicon-, silica-, and silicate-based toothpastes for the remineralization and repair of mineralized tooth tissues. A 10-year literature search was conducted using PubMed and Scopus, adhering to PRISMA 2020 guidelines. A total of 331 studies were initially identified, with 56 full-text review articles. After selecting the manuscripts, 27 studies were qualitatively analyzed by four reviewers, focusing on the results of both in vivo and in vitro methods. The findings suggest that toothpastes containing silicon, silica, and silicate demonstrate promising results for remineralization and enamel repair, with evidence of mineral layer formation and/or deep enamel surface remineralization under various conditions. Additionally, the use of these toothpastes can lead to the obliteration of dentinal tubules within a few days. The results collectively support the efficacy of these toothpastes in enamel repair. Most of the clinical studies focused on dentine hypersensitivity, followed by white spot lesions. In conclusion, silicon-, silica-, and silicate-based toothpastes (bioactive-Si-toothpastes) can be considered effective based mostly on laboratory studies. There remains a need for more in vivo research studies on enamel and dentin mineral repair. Existing studies provide strong evidence that these technologies can reduce dentin hypersensitivity and promote enamel-dentin repair.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3a48a12543d187d6bb9400293e5b4bc6511fd916d4ff4bb7403184bd1ac53119","category":"Interdisciplinary"}