{"title":"Rare quasicrystal found in trinitite formed during 1945 Trinity Test","link":"https://arstechnica.com/?p=1765764","date":1621372202000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/quasiTOP-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/quasiTOP.jpg\">Enlarge</a> <span>/</span> The red trinitite sample which contained the quasicrystal. It was formed in the aftermath of the first nuclear detonation in 1945: the famous Trinity Test at the Alamorgordo Bombing Range in New Mexico. (credit: Luca Bindi and Paul J. Steinhardt)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The detonation of the first atomic bomb during the 1945 <a href=\"https://en.wikipedia.org/wiki/Trinity_(nuclear_test)\">Trinity Test</a> produced temperatures and pressures so extreme that the surrounding sand fused into a glassy material called trinitite. Physicists have now discovered a rare material known as a quasicrystal in one of the trinitite samples. According to <a href=\"https://www.pnas.org/cgi/doi/10.1073/pnas.2101350118\">a new paper</a> published in the Proceedings of the National Academy of Sciences, that makes it the oldest <a href=\"https://www.merriam-webster.com/dictionary/anthropogenic\">anthropogenic</a> quasicrystal yet known.</p>\n<p>The <a href=\"https://nautil.us/blog/the-unlikely-rocks-found-in-mosques-siberia--outer-space\">very definition of a crystal</a> assumes a precisely symmetrical ordering of atoms in periodic patterns that repeat over and over in a 3D lattice. The patterns look the same no matter which direction you look at them, but quasicrystals are different. They clearly follow mathematical rules, but each cell has a slightly different configuration of cells nearby, rather than repeating in an identical pattern. It's that unique structure that gives quasicrystals their unusual properties.</p>\n<p>Think about tiling a bathroom floor. The tiles can only be in certain symmetrical shapes (triangles, squares, or hexagons), otherwise you won't be able to fit them together without leaving gaps or having some of the tiles overlap. Pentagons, icosahedrons, and similar shapes with different symmetries that never precisely repeat just won’t work—except in the case of quasicrystals, where nature decided they <em>could</em> work. The trick is to fill the gaps with other kinds of atomic shapes to create the unlikely aperiodic structure.</p></div><p><a href=\"https://arstechnica.com/?p=1765764#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1765764&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3a4bb4aa101a418ca3ee6294a77e8a7905c4786dae25055c73b12b7cee136500","category":"Tech"}