{"title":"‘Google’s Messaging Mess: A Timeline’","link":"https://www.theverge.com/2021/6/21/22538240/google-chat-allo-hangouts-talk-messaging-mess-timeline","date":1624922368000,"content":"\n<p>Chaim Gartenberg, writing for The Verge:</p>\n\n<blockquote>\n  <p>Within that mess of product names are two core issues: Google’s\napparent love of launching new services and its inability to\ncombine products under one umbrella.</p>\n\n<p>Competitors like WhatsApp demonstrate what the opposite approach\ncould be: a chat service tied to a user’s phone number that allows\nfor video and voice, all from one app. Or there’s Apple’s iPhone\napproach, which ties email addresses and phone numbers to two\nservices: iMessage for text and FaceTime for audio and video.</p>\n\n<p>Google keeps falling into the same cycle, though, one that has\nrepeated itself throughout the years. It’ll build out new\nservices, integrating them into more areas of its product lineup,\nthen try to wipe the slate clean, launch new services that\n(eventually) replace the old set, and start the cycle anew.</p>\n</blockquote>\n\n<p>Eye-opening to see it all laid out on a timeline like this. My first thought was that this exemplified my argument the other day <a href=\"https://daringfireball.net/2021/06/pichai_wakabayashi\">about Google’s lack of institutional focus</a>. But it sort of works against my argument that Sundar Pichai is shepherding Google in a more focused direction — a bunch of these false steps in messaging were under his leadership.</p>\n\n<p>It really is quite a comparison to email, where <a href=\"https://en.wikipedia.org/wiki/History_of_Gmail\">Gmail was announced in 2004</a> — while Google was still a nascent company — and they haven’t wavered since.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/06/28/gartenberg-google-messaging-mess\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"3a54237002ef9199f38a9ea120934b325dfe1c386ac82f753185171a6cffd16f","category":"Tech"}