{"title":"LG เตรียมวางขาย LG QNED ทีวีเทคโนโลยี mini LED รุ่นแรกของบริษัท ภายในเดือนกรกฎาคมนี้","link":"https://www.blognone.com/node/123571","date":1625455841000,"content":"<div><div><div><p>LG เตรียมวางจำหน่ายทีวี LG QNED เทคโนโลยีพิกเซลแบบ Quantum Dot NanoCell ให้สีสดขึ้นของ LG ผสานกับไฟ backlight แบบ mini LED เทคโนโลยีลดขนาดไฟ LED ลง เพื่อให้แบ่งโซนลดแสง (local dimming) ได้ดีขึ้น และให้สีดำสนิทกว่า LED ทั่วไป แม้ยังไม่ดำสนิทเท่า OLED แต่ก็ปลอดภัยจากปัญหาพิกเซลค้างหรือ burn-in ของ OLED เช่นกัน</p>\n<p>ราคา LG QNED ยังแรงพอสมควร รุ่น 4K รหัส QNED90 ขนาด 65 นิ้ว ขายในราคา 1,999 ดอลลาร์, รุ่น 75 นิ้ว ที่ 2,999 ดอลลาร์ และ รุ่น 86 นิ้ว ที่ราคา 3,999 ดอลลาร์</p>\n<p>ส่วนรุ่น 8K รหัส QNED95 และ QNED99 ขนาด 65 นิ้ว อยู่ที่ 3,499 ดอลลาร์ 75 นิ้ว อยู่ที่ 4,799 และ รุ่น 86 นิ้ว ราคาพุ่งไปถึง 6,499 ดอลลาร์ แต่รุ่นสูงสุดนี้จะมีไฟ mini LED ถึง 30,000 ดวง แบ่งเป็นโซน local dimming ถึง 2,500 โซน</p>\n<p>ทุกรุ่นจะมีพอร์ต HDMI 2.1 รองรับคอนเทนต์ 4K 120fps (มี variable refresh rate หรือ VRR เฉพาะรุ่น 4K) รองรับมาตรฐานภาพ HDR10, HLG และ Dolby Vision รองรับมาตรฐานเสียง Dolby Atmos และรัน webOS 6.0</p>\n<p>LG ยังไม่ระบุวันวางจำหน่ายที่แน่นอนของ LG QNED ในแต่ละประเทศ ระบุไว้แค่วางจำหน่ายในทวีปอเมริกาเหนือภายในเดือนกรกฎาคมนี้ และจะวางจำหน่ายในภูมิภาคอื่นตามมาในอีก 2-3 สัปดาห์</p>\n<p>ที่มา - <a href=\"http://www.lgnewsroom.com/2021/06/now-rolling-out-worldwide-lg-qned-mini-led-tv-sets-new-standard-for-lcd-picture-quality/\">LG</a> via <a href=\"https://arstechnica.com/gadgets/2021/06/not-just-oled-lg-is-about-to-release-its-first-mini-led-tvs/\">ArsTechnica</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a80e4bb13f09fbbe135e6f86a1649f9d.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/lg\">LG</a></div><div><a href=\"/topics/television\">Television</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3a67d75118bed528974eb2b3e0dae3601729a549f5cbd627381bd62cf3595485","category":"Thai"}