{"title":"How Slime can help keep you riding through summer","link":"https://www.bikeradar.com/advertising-feature/slime-riding-through-summer/","date":1625828400000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/Kid_BikeTire_Cutaway-36d7f89.jpg?quality=45&amp;resize=620,413\" />                                            <p>Summer is a great time to be out and about on your bike, enjoying the countryside in all its splendour. The warm weather, along with dry roads and trails mean <a href=\"https://www.bikeradar.com/advice/buyers-guides/how-to-dress-for-summer-cycling/\">you can dress light</a> and don’t have to worry about getting cold or wet.</p>\n<p>The last thing you want to worry about though is <a href=\"https://www.bikeradar.com/advice/workshop/how-to-fix-a-puncture-video/\">getting a puncture</a> and having to stop to sort it out.</p>\n<p>You’re normally less likely to get a puncture in the summer months when there’s typically less loose debris around, but they can still happen, and stopping in the heat can be uncomfortable.</p>\n<p>Fortunately, there’s plenty you can do to <a href=\"https://www.bikeradar.com/advice/skills/how-to-prevent-punctures/\">avoid getting a puncture in the first place</a>. Sealant is also a good way to protect your bike’s tyres from flats, sealing a cut before it turns into a puncture, and <a href=\"https://www.awin1.com/cread.php?id=489797&amp;clickref=bikeradar-0&amp;awinmid=1857&amp;p=https%3A%2F%2Fwww.wiggle.co.uk%2Fcycle%2Fwheels-tyres-and-tubes%3Fea%3D4294789779\" target=\"_blank\">Slime</a> makes a range of products that work for different tyre setups.</p>\n<h2>Use Slime inner tubes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Slime-filled tubes are available in all common inner tube sizes.</span></figcaption><span> <i>Slime</i></span></div>\n<p>Slime’s inner tubes are designed to be extra-strong to help prevent flats. Slime-filled tubes are available in all popular <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tube sizes</a>; from 20in right up to 29in tubes for <a href=\"https://www.bikeradar.com/features/best-mountain-bike-wheels/\">mountain bike wheels</a> and 700c tubes for <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">road bike tyres</a>. They also come in a variety of widths, with Presta or Schrader valves.</p>\n<p>They all contain Slime’s liquid sealant, which spreads out as you ride and coats the inside of the tube.</p>\n<p>If you run over a thorn or other sharp object and get a cut, the air pressure in the tube will force the sealant into the hole to seal the leak. Particles in the sealant then help to fill the hole, while the sealant liquid will set to help create a durable seal.</p>\n<p>Slime’s formula is designed to plug a hole without significant loss of air pressure while you continue riding, and you may not even notice that you’ve had a puncture.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Sealant will often seal your tyres without you even noticing.</span></figcaption><span> <i>Slime</i></span></div>\n<p>Slime says that its sealant will seal holes up to 3mm across and the sealant shouldn’t need a top-up for up to two years. It’s designed to be stable in hot and cold conditions, and it’s non-toxic too. If you do get a cut that’s too big for the sealant to fill, you can patch up the tube or swap it for another.</p>\n<p>Slime sealant will also deal with slow punctures, so you’re less likely to come back to a flat tyre the next time you want to take your bike out for a ride.</p>\n<h2>Add sealant to your own tubes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Adding sealant to your existing tubes can help prevent punctures.</span></figcaption><span> <i>Slime</i></span></div>\n<p>You don’t have to swap from your current inner tubes to reap the benefits of Slime’s sealant; you can also add Slime Tube Sealant to your own tubes instead.</p>\n<p>You’ll need inner tubes with removable valve cores and the tool to unscrew them – there’s one built into the cap of Slime’s sealant bottles that works with Schrader and Presta valves.</p>\n<p>All Schrader valves have a core that can be unscrewed from the valve using a tool that slots into the valve and meshes with the core. Not all Presta valves have removable cores, but if yours does, the tool will grip it and screw it out.</p>\n<p>You can also use a pair of pliers but be careful not to damage the threads – it’s a good idea to wrap the core in some rubber or fabric before trying to unscrew it.</p>\n<p>Once you’ve removed the core, you can squirt Slime sealant into the inner tube using the hose that comes with the sealant bottle.</p>\n<p>How much sealant you need depends on the tyre’s size, but Slime recommends between 90ml and 120ml per tyre. Slime’s sealant is water-soluble, so it’s easy to clean up any surplus or spills.</p>\n<p>Now just refit the core, <a href=\"https://www.bikeradar.com/features/how-to-inflate-a-bicycle-tyre-everything-you-need-to-know-about-pumps-valves-pressure-and-more/\">pump up your tyres</a> and you’re good to go. Once again, Slime says you get protection for up to two years but it’s easy to repeat the process and top up your sealant if you need to.</p>\n<p>Between Slime’s pre-filled inner tubes and Slime Tube Sealant, there’s an option to keep your tyres inflated and ensure you enjoy your ride without having to stop to fix a flat.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"3a764d2f4d648b0289403179924dfc76ec5b962fc78df80086ba22e39c0ebe78","category":"Cycling"}