{"title":"Epithelial development of the urinary collecting system in the human embryo","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301778","date":1712757600000,"content":"<p>by Marie Ange Saizonou, Haruka Kitazawa, Toru Kanahashi, Shigehito Yamada, Tetsuya Takakuwa</p>\r\n\r\nThe urinary collecting system (UCS) consists of organized ducts that collect urine from the nephrons and transport it to the ureter and bladder. Understanding the histogenesis of the UCS is critical. Thirty human embryos between the Carnegie stages (CS) 18 and 23 were selected from the Congenital Anomaly Research Center, Kyoto, Japan. Epithelia of the UCS, ureter, and bladder of each sample were randomly selected. Histological findings of the epithelia were analyzed according to the following criteria: type of epithelium, presence or absence of glycogen, percentage of migrated nuclei, percentage of cells in mitosis, and the surrounding mesenchyme. A thickened epithelium lining a narrow luminal cavity was observed in the pre-expanded pelvic specimens at CS18-CS23. At CS23, after pelvic expansion, the UCS showed a thin epithelium with a large luminal cavity mainly located on the early branches, whereas the epithelium covering the subsequent branches had medium thickness. Histological characteristics differed depending on the UCS part and sample stage. The degree of differentiation was evaluated, revealing that in CS18-CS23 pre-expanded pelvis specimens, the undifferentiated epithelium was found in the zeroth to third/fifth generation, whereas at CS23, after pelvic expansion, a differentiated epithelium covered the UCS zeroth to seventh generation. In a comparison of the urothelial epithelium between the UCS, ureter, and bladder, we found that urinary tract differentiation may be initiated in the bladder, followed by the ureter, UCS zeroth to seventh generations, and finally, UCS eighth to end generations. An understanding of the histogenesis of embryonic stage UCS can aid in the clinical management of congenital urinary tract defects and other diseases.","author":"Marie Ange Saizonou","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3a834e25d2cf76a0ff634009c1fecd979c5f2bf0d0c0d04be425cceae8fcea40","category":"Interdisciplinary"}