{"title":"Digital Car Key and Ultra Wideband Groups Team Up for Future Apple Car Keys Improvements","link":"https://www.macrumors.com/2023/11/16/digital-car-key-ultra-wideband-improvements/","date":1700163464000,"content":"The way vehicles take advantage of new connectivity standards could be improving in the near future, leading to updates on how smartphones like the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> control cars.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/01/bmw-car-key-photo.jpg\" width=\"1200\" height=\"600\" />\r<br />\nThis month, the Car Connectivity Consortium (CCC) and the FiRa Consortium that oversees the development of the Ultra-wideband (UWB) standard, <a href=\"https://carconnectivity.org/car-connectivity-consortium-and-fira-consortium-partner-on-uwb-technology-used-in-the-ccc-digital-key/\">announced a partnership</a> for the future development of UWB features used for the CCC Digital Key function.\r<br />\n\r<br />\nApple is a member of both the CCC and FiRa. The CCC's Digital Key specification has been adopted by Apple for its <a href=\"https://www.macrumors.com/guide/carkey/\">Car Keys</a> feature that allows the ‌iPhone‌ and the Apple Watch to unlock compatible vehicles over NFC. Select BMW, Kia, Hyundai, Mercedes, and Genesis vehicles <a href=\"https://www.apple.com/ios/carplay/available-models/\">work with Car Keys</a>, but Apple undoubtedly wants to expand adoption.\r<br />\n\r<br />\nThe CCC and FiRa Consortiums will work together to \"develop and maintain\" the UWB technology specifications used for the Digital Key standard that serves as the basis for ‌Car Keys‌ on Apple devices. Apple engineer Jinjing Jiang will oversee the joint effort.\r<br />\n\r<br />\nThe partnership is expected to encourage broader adoption of UWB technology use in vehicles. As of now, UWB is used for the Digital Key standard to relay how close a user is to their vehicle, allowing a smartphone or wearable to be used for vehicle access or to start the car when at the appropriate range.\r<br />\n\r<br />\nApple uses UWB for the ‌iPhone‌, Apple Watch, and AirTag. UWB enables more precise location awareness and it powers features like Precision Finding for the AirTag.\r<br />\n\r<br />\nAlong with Apple, CCC members include most vehicle manufacturers like Ford, BMW, GM, Honda, Volkswagen, Mercedes-Benz, and more, while FiRa members include Apple, Google, Qualcomm, Cisco, Samsung, NXP, and more.<br />This article, \"<a href=\"https://www.macrumors.com/2023/11/16/digital-car-key-ultra-wideband-improvements/\">Digital Car Key and Ultra Wideband Groups Team Up for Future Apple Car Keys Improvements</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/digital-car-key-and-ultra-wideband-groups-team-up-for-future-apple-car-keys-improvements.2411182/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3a882b45237d4cd49a7a63d6bff2385eff862ad84278ea574e61d4af21649b9d","category":"Apple"}