{"title":"Apple Watch Sales Ban Pause Formally Opposed by ITC","link":"https://www.macrumors.com/2024/01/10/itc-opposes-apple-watch-sales-ban-pause/","date":1704923625000,"content":"In mid-December, Apple <a href=\"https://www.macrumors.com/2023/12/21/apple-watch-removed-from-online-store/\">briefly paused sales</a> of the Apple Watch Series 9 and Apple Watch Ultra 2 in the U.S. due to a patent dispute with medical tech company Masimo related to blood oxygen sensing. Apple then appealed the decision in court and was granted a temporary stay, so the ban was paused and <a href=\"https://www.macrumors.com/2023/12/28/apple-watch-series-9-ultra-2-online/\">sales have resumed</a> for now.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/09/apple-watch-series-6-blood-oxygen-monitoring-1.jpg\" width=\"1600\" height=\"897\" />\r<br />\nToday, the U.S. International Trade Commission (ITC) formally opposed Apple's motion for the ban to be paused for the duration of its appeal, according to a document filed with the U.S. Court of Appeals for the Federal Circuit.\r<br />\n\r<br />\n\"Apple presents a weak and unconvincing case to invoke the extraordinary remedy of a stay pending appeal,\" ITC lawyers said in their response, viewed by <em>MacRumors</em>. \"Its arguments amount to little more than an indisputably adjudicated infringer requesting permission to continue infringing the asserted patents.\"\r<br />\n\r<br />\nMasimo has accused Apple of <a href=\"https://www.macrumors.com/2023/04/18/apple-masimo-legal-battle/\">stealing trade secrets and poaching employees</a> to develop the blood oxygen sensing feature that debuted on the Apple Watch Series 6 in 2020. As a result, the <a href=\"https://www.macrumors.com/2023/10/27/us-trade-tribunal-apple-watch-ban-masimo/\">ITC banned sales</a> of Apple Watch models offering the feature, and this ruling resulted in the Series 9, Ultra 2, and some refurbished Series 7 and Series 8 models being unavailable last month briefly until the ban was paused. Apple had already discontinued the Series 6, and the Apple Watch SE was unaffected since it does not offer blood oxygen sensing.\r<br />\n\r<br />\nThe court is still accepting \"replies in support\" until January 15, so the Apple Watch should remain available until later this week at a minimum.\r<br />\n\r<br />\nApple is reportedly <a href=\"https://www.macrumors.com/2023/12/18/apple-watch-import-ban-software-fix/\">working on software changes</a> to address the alleged patent infringement, but Masimo believes that the Apple Watch's hardware design will have to change to become compliant. Last month, Masimo said it was <a href=\"https://www.macrumors.com/2023/12/19/masimo-ceo-on-apple-watch-ban/\">open to settlement talks</a>, but Apple had reportedly not expressed any interest at the time.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 9</a>, <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra 2</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/masimo/\">Masimo</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#Apple_Watch_Ultra\">Apple Watch Ultra (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/10/itc-opposes-apple-watch-sales-ban-pause/\">Apple Watch Sales Ban Pause Formally Opposed by ITC</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-watch-sales-ban-pause-formally-opposed-by-itc.2416020/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3a88d8ae595a1ab45f4a5cf01cf8fc9faa0ce350c4508b67d467b4db03f0d60c","category":"Apple"}