{"title":"97 Influence of cashew nutshell extract (CNSE) on enteric methane emission, feeding behavior, and nutrients digestibility in beef steers receiving a finishing diet","link":"https://academic.oup.com/jas/article/102/Supplement_3/325/7757182?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Feedlots have a crucial role in meeting the increasing global demand for meat. Despite ongoing efforts to improve feed efficiency in finishing diets, cattle in feedlots may experience methane (CH<sub>4</sub>) losses ranging from 2 to 12% of dietary gross energy (GE). Identifying strategies to mitigate energy losses in finishing diets is imperative for ensuring the sustainability of beef production. Anacardic acid, contained in the cashew nutshell extract (CNSE) has shown promising results in reducing CH<sub>4</sub> emissions in forage-based diets; however, its impact on high-grain diets remains to be analyzed. Therefore, this study aimed to evaluate CNSE addition (5 gּ steer<sup>-1</sup>ּ d<sup>-1</sup>) in a finishing diet (85:15% grain: forage) on in vivo enteric CH<sub>4</sub> emissions, apparent total tract digestibility, and feeding behavior. It was hypothesized that CNSE addition to a finishing diet would reduce enteric CH<sub>4</sub> emissions without reducing feed intake or nutrient digestibility. To this aim, Angus crossbred steers (n = 16; 599 ± 40 kg) were used in a crossover design with two periods of 56 d each. Steers were adapted (14 d) to the finishing diet and assigned to receive CNSE or no additive (CON). The diet was offered twice daily as a total mixed ration (TMR) in the feedbunk, while CNSE was independently delivered through the Super SmartFeed system (C-Lock, Inc, Rapid City, SD) using ground corn gluten feed as a carrier. In vivo CH<sub>4</sub> emissions, apparent total tract digestibility of nutrients, and feeding behavior were analyzed. Data were recorded during 35 d after the adaptation, followed by 7 d of washout, and analyzed as a crossover design using the MIXED procedure of SAS. Compared with CON, the addition of CNSE increased meal duration (<span>P</span> = 0.03), bunk visit duration (<span>P</span> &lt; 0.01), and dry matter intake (DMI) of TMR (<span>P</span> = 0.03) by 25, 23, and 7%, respectively. Dry matter digestibility was increased (<span>P</span> = 0.02) by CNSE addition. Steers receiving CNSE, had a reduction in enteric CH<sub>4</sub> emission rate (g/d; <span>P</span> &lt; 0.001), yield (g/kg of DMI; <span>P</span> &lt; 0.001), and intensity (g/kg of average daily gain; <span>P</span> &lt; 0.01) in 29, 32, and 39% respectively. The loss of dietary GE as CH<sub>4</sub> was reduced in CNSE (3.2 vs. 4.7%) compared with CON (<span>P</span> &lt; 0.01). This study showed that CNSE at the evaluated inclusion rate, reduced CH<sub>4</sub> yield and emission intensity by more than 31% in beef steers receiving a finishing diet. Moreover, given that CNSE addition promoted a longer feed bunk occupancy and a greater TMR intake, it could be suggested that the observed CH<sub>4</sub> mitigation may be linked to shifts in ruminal fermentation rather than changes in DMI.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3a911db8889b87627b0e1c89a8e0724485e0f700ea94449412bac5491b822f5d","category":"Environment"}