{"title":"Okta เผยรายละเอียดการโดนแฮ็ก เริ่มจากพนักงานโดนแฮ็กบัญชีส่วนตัว ลามมาระบบภายใน","link":"https://www.blognone.com/node/136610","date":1699324931000,"content":"<div><div><div><p>Okta เผยรายละเอียดของ<a href=\"https://www.blognone.com/node/136335\">การโดนแฮ็กระบบ</a> <a href=\"https://www.blognone.com/node/136368\">เมื่อปลายเดือนตุลาคม 2023 ที่ผ่านมา</a> หลังการสอบสวนเชิงลึกเสร็จสิ้นแล้ว</p>\n<p>David Bradbury ประธานเจ้าหน้าที่ฝ่ายความมั่นคง (Chief Security Officer) เป็นผู้แถลงผ่านบล็อกของบริษัท เล่าถึงสาเหตุว่าเกิดจากพนักงานรายหนึ่งใช้โน้ตบุ๊กของบริษัท ล็อกอินบัญชี Google ส่วนตัวบน Chrome และเก็บรหัสผ่านต่างๆ ไว้ใน Chrome ทำให้โดนแฮ็กเอารหัสผ่านจากจุดนั้น ลามมายังบัญชีภายในของบริษัทต่อในภายหลัง</p>\n<p>Okta บอกว่าได้รับแจ้งพฤติกรรมผิดปกติจากลูกค้า 3 รายคือ 1Password, BeyondTrust และลูกค้าอีกรายที่ไม่ระบุชื่อ ทำให้ทีม Okta เข้ามาสอบสวนว่าเกิดอะไรขึ้น บริษัทได้รับแจ้งพฤติกรรมน่าสงสัยครั้งแรกในวันที่ 29 กันยายน และค้นพบบัญชีที่โดนแฮ็กวันที่ 16 ตุลาคม (นานเกือบ 3 สัปดาห์) หลังจากนั้นจึงดำเนินมาตรการยกเลิก token เก่าที่ใช้ในเซสชันล็อกอิน และแจ้งเตือนให้ลูกค้าทราบ</p>\n<p>Okta ระบุว่ามีลูกค้าจำนวน 134 องค์กรที่ได้รับผลกระทบ มีลูกค้าตกเป็นเป้าโจมตี โดนขโมย token เข้าเซสชันอย่างน้อย 5 รายคือ 3 รายข้างต้น บวกกับ Cloudflare และบริษัทอีกแห่งที่ไม่ระบุชื่อ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/95866070b99e0855986dc9fc6f600d27.jpg\" /></p>\n<p>เว็บไซต์ Ars Technica วิจารณ์ Okta ว่าการที่พนักงานโดนแฮ็กบัญชีส่วนตัวเป็นเรื่องที่พบเจอได้ทั่วไป แต่การที่พนักงานโดนแฮ็กแล้วลุกลามมายังระบบภายในของบริษัท แปลว่ามาตรการภายในของ Okta เองต่างหากที่เป็นปัญหา พนักงานไม่ควรได้สิทธิใช้งานบัญชีส่วนตัวในบริษัทความปลอดภัยแบบ Okta ด้วยซ้ำ และมีคำถามตามมาอีกมากมายว่าทำไมแฮ็กเกอร์ถึงสามารถล็อกอินบัญชีพนักงาน Okta โดยใช้เพียงแค่รหัสผ่านที่ถูกขโมย ไม่ติดขั้นตอน MFA ที่ควรต้องมีเป็นมาตรฐาน, ไม่มี access control จำกัดสิทธิของบัญชีพนักงาน, ระบบมอนิเตอร์ของ Okta เองตรวจจับไม่ได้เลย ต้องรอคนอื่นแจ้งมา ฯลฯ แปลว่าระบบภายในของ Okta หละหลวมมาก</p>\n<p>ที่มา - <a href=\"https://sec.okta.com/harfiles\">Okta</a>, <a href=\"https://arstechnica.com/information-technology/2023/11/no-okta-senior-management-not-an-errant-employee-caused-you-to-get-hacked/\">Ars Technica</a>, ภาพจาก <a href=\"https://www.okta.com/blog/2018/01/okta-certifications-in-the-top-tier-of-highest-paying-it-certifications-globally/\">Okta</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/okta\">Okta</a></div><div><a href=\"/topics/security\">Security</a></div><div><a href=\"/topics/hacking\">Hacking</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3a94c58cb2a7186ce130c4e19bfb58c9c0df447ac7c2354d222b6dec683607ec","category":"Thai"}