{"title":"Apple CEO Tim Cook 'Secretly' Signed $275 Billion Deal With China in 2016","link":"https://www.macrumors.com/2021/12/07/apple-ceo-tim-cook-secret-deal-with-china/","date":1638888551000,"content":"Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> \"secretly\" signed an agreement worth more than $275 billion with Chinese officials, promising that Apple would help to develop China's economy and technological capabilities, <em>The Information</em> reports.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2017/03/1x-1.jpg\" />\r\n<br />\r\nIn an extensive <a href=\"https://www.theinformation.com/articles/facing-hostile-chinese-authorities-apple-ceo-signed-275-billion-deal-with-them\">paywalled report</a> based on interviews and purported internal Apple documents, <em>The Information</em> revealed that ‌Tim Cook‌ personally forged a five-year agreement with the Chinese government during a series of in-person visits to the country in 2016. The need to push for a closer alliance with the Chinese government reportedly came from a number of Apple executives who were concerned about bad publicity in China and the company's poor relationship with Chinese officials, who believed that Apple was not contributing enough to the local economy.\r\n<br />\r\n\r\n<br />\r\nAlleged internal documents show that Cook \"personally lobbied officials\" in China over threats made against <a href=\"https://www.macrumors.com/roundup/apple-pay/\">Apple Pay</a>, <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a>, and the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. Cook set out to use a \"memorandum of understanding\" between Apple and a powerful Chinese government agency called the National Development and Reform Commission to formally agree to a number of concessions in return for regulatory exemptions. The 1,250-word agreement was written by Apple's government affairs team in China and stewarded by Cook as he met with Chinese officials.\r\n<br />\r\n\r\n<br />\r\nIn May 2016, Cook announced that Apple would be investing <a href=\"https://www.macrumors.com/2016/05/12/apple-invests-1billion-didi-chuxing/\">$1 billion in the Chinese ride-hailing startup Didi Chuxing</a> in a pointed attempt to mollify authorities, the report added. Shortly after, Cook, Apple Chief Operating Officer Jeff Williams, and government affairs head Lisa Jackson met with senior government officials in Zhongnanhai, the central headquarters of the Communist Party of China.\r\n<br />\r\n\r\n<br />\r\nCook's negotiations led to the successful signing of the multibillion-dollar agreement, quashing a number of regulatory actions against the company with exemptions and enabling access to the Chinese market, in return for significant investments, business deals, and worker training in the country. \r\n<br />\r\n\r\n<br />\r\nThe agreement included a pledge from Apple to help Chinese manufacturers develop \"the most advanced manufacturing technologies,\" \"support the training of high-quality Chinese talents,\" use more components from Chinese suppliers, sign deals with Chinese software firms, collaborate with research in Chinese universities, and directly invest in Chinese tech companies, as well as assistance with around a dozen Chinese government causes. If there were no objections from either side, the deal would be automatically be extended for an additional year until May 2022, according to the agreement.\r\n<br />\r\n\r\n<br />\r\nApple vowed to invest \"many billions of dollars more\" than its current expenditure in China, including on new retail stores, research and development facilities, and renewable energy projects. Other internal documents reportedly showed that Apple's pledge amounted to more than $275 billion in spending over a period of five years.\r\n<br />\r\n\r\n<br />\r\n<em>The Information</em> suggests that Apple is heavily reliant on Cook for international negotiations and speculates that it could face difficulties dealing with government affairs when Cook stands down as the company's CEO.\r\n<br />\r\n\r\n<br />\r\nFor more information, see <em>The Information</em>'s <a href=\"https://www.theinformation.com/articles/facing-hostile-chinese-authorities-apple-ceo-signed-275-billion-deal-with-them\">full report</a>.<div>Tags: <a href=\"https://www.macrumors.com/guide/china/\">China</a>, <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/12/07/apple-ceo-tim-cook-secret-deal-with-china/\">Apple CEO Tim Cook 'Secretly' Signed $275 Billion Deal With China in 2016</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-ceo-tim-cook-secretly-signed-275-billion-deal-with-china-in-2016.2326558/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Ajn9tKW2fyk:V6Yedcy5w4I:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Ajn9tKW2fyk:V6Yedcy5w4I:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3a9738ee44fadffbe031be537343db543d59008978b917cb4e4a1e9dca4f29d4","category":"Apple"}