{"title":"Early developmental carry‐over effects on exploratory behaviour and DNA methylation in wild great tits (Parus major)","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13664?af=R","date":1710388207000,"content":"<h2>Abstract</h2>\n<p>Adverse, postnatal conditions experienced during development are known to induce lingering effects on morphology, behaviour, reproduction and survival. Despite the importance of early developmental stress for shaping the adult phenotype, it is largely unknown which molecular mechanisms allow for the induction and maintenance of such phenotypic effects once the early environmental conditions are released. Here we aimed to investigate whether lasting early developmental phenotypic changes are associated with post-developmental DNA methylation changes. We used a cross-foster and brood size experiment in great tit (<i>Parus major</i>) nestlings, which induced post-fledging effects on biometric measures and exploratory behaviour, a validated personality trait. We investigated whether these post-fledging effects are associated with DNA methylation levels of CpG sites in erythrocyte DNA. Individuals raised in enlarged broods caught up on their developmental delay after reaching independence and became more explorative as days since fledging passed, while the exploratory scores of individuals that were raised in reduced broods remained stable. Although we previously found that brood enlargement hardly affected the pre-fledging methylation levels, we found 420 CpG sites that were differentially methylated between fledged individuals that were raised in small versus large sized broods. A considerable number of the affected CpG sites were located in or near genes involved in metabolism, growth, behaviour and cognition. Since the biological functions of these genes line up with the observed post-fledging phenotypic effects of brood size, our results suggest that DNA methylation provides organisms the opportunity to modulate their condition once the environmental conditions allow it. In conclusion, this study shows that nutritional stress imposed by enlarged brood size during early development associates with variation in DNA methylation later in life. We propose that treatment-associated DNA methylation differences may arise in relation to pre- or post-fledging phenotypic changes, rather than that they are directly induced by the environment during early development.</p>","author":"Bernice Sepers, \nKoen J. F. Verhoeven, \nKees van Oers","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"3aa2d563ba6c3de5f1c638c1c0d53774b802555630efa453183d155e485ec6a7","category":"Environment"}