{"title":"The clinical features and operation experience of multilobar involved congenital lung malformation: A retrospective cohort study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312592","date":1729778400000,"content":"<p>by Kaisheng Cheng, Miao Yuan, Gang Yang, Taozhen He, Dengke Luo, Chenyu Liu, Zongyu Wang, Jiayin Yang, Chang Xu</p>\r\nBackground <p>Congenital lung malformation (CLM) is usually characterized by single-lobe involvement and multilobe involvement is uncommon. There is a lack of experience in the clinical features and surgical treatment of unilateral multilobar CLM. Therefore, this study aims to summarize the clinical characteristics and evaluate the safety and feasibility of thoracoscopic lung sparing resection in the treatment of unilateral multilobar CLM.</p> Methods <p>A retrospective study was conducted on 34 patients with unilateral multilobar CLM, and 34 unilobar patients were randomly selected as the control group in West China Hospital of Sichuan University from 2014.1 to 2021.1. Clinical, operation and follow-up outcomes were compared between the two groups.</p> Results <p>Twelve (35.2%) patients developed preoperative symptoms in the multilobar group more than 4(11.7%) the unilobar group (p = 0.02), the main preoperative symptom was infection; The multilobar group and unilobar group showed significant differences in mean intraoperative blood loss (13.3 mL vs. 7.5 mL; p = 0.02) and mean surgical time (95.6 min vs. 47.5 min; p = 0.037). The median length of postoperative hospital stay and the median chest tube placement time in the multilobar group were significantly longer (5 d vs.3 d, p = 0.045; 2 d vs.1 d, p = 0.031). There were one (2.9%) patient in unilobar group and 4(11.7%) patients in multilobar group developed complications postoperatively, which is no significant differences between the two groups(p = 0.16). No complications such as thoracic deformity, mediastinal deviation, scoliosis or recurrence were observed in either group at follow-up.</p> Conclusions <p>Unilateral multilobar CLM cases are more susceptible to develop symptoms than unilobar cases. Thoracoscopic lung sparing resection in the treatment of unilateral multilobar CLM has high safety and can effectively avoid serious complications of unilateral multiple lobectomy or pneumonectomy.</p>","author":"Kaisheng Cheng","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3aa6141eccc02d9bbda27d6e9c8eaa1ed9efa3380bdd4899f724b484f0c33520","category":"Interdisciplinary"}