{"title":"Blue Origin’s powerful BE-4 engine is more than four years late—here’s why","link":"https://arstechnica.com/?p=1785176","date":1628185823000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/BlueOrigin_BE4_hotfire-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/BlueOrigin_BE4_hotfire.jpg\">Enlarge</a> <span>/</span> Image of a BE-4 rocket engine on a test stand in West Texas. (credit: Blue Origin)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>After more than four years of frustrating delays, Blue Origin is finally making significant progress toward completing development of its powerful BE-4 rocket engine. At present, engineers and technicians with the company are assembling the first two flight engines at <a href=\"https://arstechnica.com/science/2016/03/behind-the-curtain-ars-goes-inside-blue-origins-secretive-rocket-factory/\">Blue Origin's main factory in Kent, Washington</a>.</p>\n<p>The company aspires to deliver these two flight engines to United Launch Alliance before the end of this year, although that increasingly appears to be a \"stretch\" goal. Delivery may slip into early 2022. And in order to make this deadline, Blue Origin plans to take the somewhat risky step of shipping the engines to its customer before completing full qualification testing.</p>\n<p>This delivery has been a long time coming. United Launch Alliance, or ULA, first agreed to buy the engines from Blue Origin back in 2014. It was a bold bet by ULA, a blueblood in space launch, on a new entrant to the market. But with the BE-4 engine, Blue Origin founder Jeff Bezos was promising a relatively low-cost, high performing engine with a power output comparable to a Space Shuttle main engine. At the time of this initial agreement, Blue Origin said the BE-4 would be \"ready for flight\" <a href=\"https://twitter.com/blueorigin/status/606815241368772608?s=11\">by 2017</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1785176#p3\">Read 25 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1785176&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3aa7f53d4d4a460c5d755851ba708b960a01b6c483e27b64ba00a1315e8826db","category":"Tech"}