{"title":"The biological controls of soil carbon accumulation following wildfire and harvest in boreal forests: A review","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17276?af=R","date":1714398826000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/04f32d3e-0956-430d-b677-7688cc3a1156/gcb17276-toc-0001-m.png\" alt=\"The biological controls of soil carbon accumulation following wildfire and harvest in boreal forests: A review\" />\n<p>Boreal forests have vast quantities of carbon in their soils. These forests are frequently subjected to wildfire or harvesting activities, which can cause soil carbon losses. We review the wide range of biological mechanisms that can control soil carbon stock recoveries following these disturbance. While some of these influences are well known, for example plant production and quality of litter inputs, our review identified many frontiers that remain relatively unexplored, such as root production, traits of root associated fungi, or respiration from soil decomposers.</p>\n<br />\n<h2>Abstract</h2>\n<p>Boreal forests are frequently subjected to disturbances, including wildfire and clear-cutting. While these disturbances can cause soil carbon (C) losses, the long-term accumulation dynamics of soil C stocks during subsequent stand development is controlled by biological processes related to the balance of net primary production (NPP) and outputs via heterotrophic respiration and leaching, many of which remain poorly understood. We review the biological processes suggested to influence soil C accumulation in boreal forests. Our review indicates that median C accumulation rates following wildfire and clear-cutting are similar (0.15 and 0.20 Mg ha<sup>−1</sup> year<sup>−1</sup>, respectively), however, variation between studies is extremely high. Further, while many individual studies show linear increases in soil C stocks through time after disturbance, there are indications that C stock recovery is fastest early to mid-succession (e.g. 15–80 years) and then slows as forests mature (e.g. &gt;100 years). We indicate that the rapid build-up of soil C in younger stands appears not only driven by higher plant production, but also by a high rate of mycorrhizal hyphal production, and mycorrhizal suppression of saprotrophs. As stands mature, the balance between reductions in plant and mycorrhizal production, increasing plant litter recalcitrance, and ectomycorrhizal decomposers and saprotrophs have been highlighted as key controls on soil C accumulation rates. While some of these controls appear well understood (e.g. temporal patterns in NPP, changes in aboveground litter quality), many others remain research frontiers. Notably, very little data exists describing and comparing successional patterns of root production, mycorrhizal functional traits, mycorrhizal-saprotroph interactions, or C outputs via heterotrophic respiration and dissolved organic C following different disturbances. We argue that these less frequently described controls require attention, as they will be key not only for understanding ecosystem C balances, but also for representing these dynamics more accurately in soil organic C and Earth system models.</p>","author":"Michael J. Gundale, \nE. Petter Axelsson, \nVincent Buness, \nTimon Callebaut, \nThomas H. DeLuca, \nStefan F. Hupperts, \nTheresa S. Ibáñez, \nDaniel B. Metcalfe, \nMarie‐Charlotte Nilsson, \nMatthias Peichl, \nClydecia M. Spitzer, \nZsofia R. Stangl, \nJoachim Strengbom, \nMaja K. Sundqvist, \nDavid A. Wardle, \nBjörn D. Lindahl","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"3aa9ec4e0fcfaf8030e71a5f279c0703031ed3a186295cd80b5bfe672976cbcc","category":"Environment"}