{"title":"Assessing the potential economic effects of mesopelagic fisheries as a novel source of fishmeal","link":"https://onlinelibrary.wiley.com/doi/10.1111/nrm.12398?af=R","date":1723546237000,"content":"<h2>Abstract</h2>\n<p>The continuous growth of the aquaculture industry implies increased demand for efficient sources of aquafeed, such as fishmeal. Pelagic fish are a desirable source of fishmeal due to their high nutritional content. Nevertheless, several pelagic stocks that have been exploited extensively for fishmeal production face ecological limits due to commercial exploitation, and the aquaculture industry is now seeking novel, efficient, and sustainable sources of aquafeed. The mesopelagic zone, an ecosystem with many scientific uncertainties, is being considered as a potential source for fishmeal, largely owing to the abundance of mesopelagic fish and their robust nutritional profile. However, both the ecological and economic viability of commercial exploitation of mesopelagic fish are not yet well understood. To understand the conditions that would make such an endeavor economically viable in the context of global fishmeal production systems, we use a bioeconomic model that assesses the economic consequences of including mesopelagic fish as a fishmeal source. Through simulations, we assess the economic implications of this hypothetical mesopelagic fishery on major pelagic fishmeal production systems. The mesopelagic fishery can be economically profitable for harvesters, and its addition to global fishmeal production reduces fishmeal market price, thus making it more accessible to aquaculture farmers and less profitable for pelagic fishers. While this may reduce fishing pressure on pelagic forage-fish stocks, the implications of commercial exploitation of mesopelagic on key ecosystem services remain a concern.</p>","author":"Rohan Gowda Thanh Quang, \nMelina Kourantidou, \nDi Jin","siteTitle":"Wiley: Natural Resource Modeling: Table of Contents","siteHash":"3719477483f67b16afdbb60e07461dbbb5827188dd5d72806069fb36caa95c59","entryHash":"3ab3a363118727aa32b841a5460a2e53fe49fea39f59fabb9e2083cb7be3f556","category":"Environment"}