{"title":"Assessing the Pathogenicity of Berkeleyomyces rouxiae and Fusarium oxysporum f. sp. vasinfectum on Cotton (Gossypium hirsutum) Using a Rapid and Robust Seedling Screening Method","link":"https://www.preprints.org/manuscript/202409.1114/v1","date":1726296562000,"content":"Cotton (Gossypium spp.) is the most important fibre crop worldwide. Black root rot and Fusarium wilt are two major diseases of cotton caused by soil-borne Berkeleyomyces rouxiae and Fusarium oxysporum f. sp. vasinfectum (Fov), respectively. Phenotyping plant symptoms caused by soil-borne pathogens has always been a challenge. To increase the uniformity of infection, we adapted a seedling screening method that directly uses liquid cultures to inoculate the plant roots and the soil. Four isolates each of B. rouxiae and Fov were collected from cotton fields in Australia and were characterised for virulence on cotton under controlled plant growth conditions. While the identity of all four B. rouxiae isolates were confirmed by multi-loci sequencing, only two of them were found to be pathogenic on cotton, suggesting variability in the ability of isolates of this species to cause disease. The four Fov isolates were phylogenetically clustered together with the other Australian Fov isolates and displayed both external and internal symptoms characteristic of Fusarium wilt on cotton plants. Furthermore, the isolates appeared to induce varied levels of plant disease severity indicating differences in their virulence on cotton. To contrast the virulence of the Fov isolates, four putatively non-pathogenic Fusarium oxysporum (Fo) isolates collected from cotton seedlings exhibiting atypical wilt symptoms were assessed for their ability to colonise cotton host. Despite the absence of Secreted In Xylem genes (SIX6, SIX11, SIX13 and SIX14) characteristic of Fov, all four Fo isolates retained the ability to colonise cotton and induce wilt symptoms. This suggests that slightly virulent strains of Fo may contribute to the overall occurrence of Fusarium wilt in cotton fields. Findings from this study will allow better distinction to be made between plant pathogens and endophytes and allow fungal effectors underpinning pathogenicity to be explored.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3ac8112ed6571ab3e4261be1e8f7f1a901ed81731484d86cb8dbb30973d5c73d","category":"Interdisciplinary"}