{"title":"Effects of different wall‐breaking methods on the nutrient release of Ganoderma lucidum spore powder in vitro digestion","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13490?af=R","date":1711620245000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>The hard double-walled structure of Ganoderma lucidum spore powder (GLSP) is difficult for the human body to be digested, so it is very important to break the wall of GLSP.</p>\n<h2>Results</h2>\n<p>In this study, the wall of GLSP was broken by mechanical milling at room temperature (MM-R) and ultra-fine grinding at low temperature (UFG-L), respectively. Compared with MM-R, UFG-L can better retain the sporangium powder's morphological and structural integrity. During the <i>in vitro</i> digestion, compared with unbroken GLSP, the release amounts of polysaccharides and triterpenes from broken GLSP were significantly increased, and the release amounts increased with the increase of specific surface area. The bioaccessibility of polysaccharide and triterpene from unbroken GLSP after the intestinal stage were 29.52% and 5.37%, respectively. The bioaccessibility of polysaccharides and triterpene from broken GLSP by MM-R after the intestinal phase were 39.73%–72.45% and 16.44%–24.97%, while those by UFG-L were 44.53%–104.18% and 12.96%–32.90%, respectively.</p>\n<h2>Conclusion</h2>\n<p>In conclusion, the active ingredients of broken GLSP showed better digestion and absorption abilities than unbroken GLSP. Moreover, the specific surface area of GLSP by UFG-L was lower than that of MM-R, and the bioaccessibility of GLSP by UFG-L was higher than that of MM-R.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Yaoyao Qi, \nShun Zhong, \nFeng Pan, \nJunfu Zhou, \nZhiyu Wang, \nZeyuan Deng, \nHongyan Li","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"3aca1fbe79c677050f060fdb8d3f2e964dc70ab9335e2ac77f1a461673dc8056","category":"Environment"}