{"title":"Princeton CarbonWorks spins off new Tactic Racing range of high-end hubs","link":"https://cyclingtips.com/2021/12/princeton-carbonworks-spins-off-new-tactic-racing-range-of-high-end-hubs/","date":1639645814000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Tactic-Racing-hubs-1-650x366.jpg\" /></div><h2>Princeton CarbonWorks spins off new Tactic Racing range of high-end hubs</h2><p>\n</p><p>The current parts shortage hasn’t just created headaches for end consumers; it’s also created bottlenecks for OEM manufacturers that rely on third-party suppliers to complete builds. Case in point are wheel brands that use off-the-shelf hubs from brands like DT Swiss. </p>\n\n\n\n<p>One of those brands is Princeton CarbonWorks, which has historically used standard hub models from DT Swiss, Chris King, Industry Nine, Tune, White Industries, and Carbon Ti — partially as a way to provide customers with more choice, but also to spread out vulnerability to shortages. Princeton CarbonWorks has continued to grow, however, and that pace of growth has apparently now exceeded available supply. As a result, Princeton CarbonWorks has been developing its own range of hubs — Tactic Racing — which will not only anchor its own wheelsets, but will also be offered aftermarket.</p>\n\n\n\n<p>“The story is this: we wanted better hubs, and better availability,” explained Princeton CarbonWorks CEO and co-founder (and Tactic Racing founder) Harrison Macris. “DT180s are <a href=\"https://en.wikipedia.org/wiki/Unobtainium\" target=\"_blank\">unobtainium</a>, and most other hub suppliers are just flat-out and unable to support our growth at PCW.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Tactic-Racing-hubs-2-1340x754.jpg\" /><figcaption>The exploded view of the rear hub reveals the relatively minimalist design.</figcaption></figure>\n\n\n\n<p>The specs for the new Tactic Racing hubs are certainly enticing. </p>\n\n\n\n<p>Manufactured in Germany, the claimed weight for a pair of Tactic Racing disc-brake hubs is astoundingly low at just 215 g (151 g rear, 64 g front) — about 65 g lighter than the equivalent DT Swiss 180. Part of this is due to the simplified “ConicalFace Gear” driver mechanism in the rear hub, which features a sliding ratchet ring on the inboard side, a corresponding ratchet face that’s machined directly into the aluminum freehub body on the other, and an 8° engagement speed.</p>\n\n\n\n<p>According to Tactic’s marketing materials, ConicalFace Gear “rapidly engages and disengages the freewheel over a larger contact area than any other freewheel mechanism on the market. The design ensures that the mating components are always concentrically aligned which drastically extends component lifetime.” </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Tactic-Racing-hubs-3-1340x754.jpg\" /><figcaption>The ConicalFace Gear driver mechanism sounds silly, but it’s essentially a distilled version of the Star Ratchet freehub design that DT Swiss has used (successfully) for ages.</figcaption></figure>\n\n\n\n<p>Despite all that tooth contact surface area, the hubs supposedly aren’t all that annoying, either.</p>\n\n\n\n<p>“They were a little loud initially (the team even mentioned it), but we have added a very light oil to the engagement which has quieted it down considerably,” Macris explained.</p>\n\n\n\n<p>The ConicalFace Gear driver design is borrowed from <a href=\"https://www.pinkbike.com/news/roundup-five-exciting-products-from-small-european-manufacturers-december-2021.html\" target=\"_blank\">Nonplus Components</a> (they’re apparently “sister companies”), but the hub shells are specifically designed for road use with downsized aluminum shells and straight-pull spoke flanges, and the whole thing rotates on tungsten disulfide-coated ABEC 7 hybrid ceramic cartridge bearings. Despite the low weight and the all-aluminum driver construction, there’s no maximum rider weight limit attached to these.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Tactic-Racing-hubs-5-1340x754.jpg\" /><figcaption>The array of shallow pockets may shave a smidgeon of weight, but it more likely acts as a small reservoir for lubricant.</figcaption></figure>\n\n\n\n<p>“My goal was not to save money in any way, shape, or form,” said Macris. “My goal was to make the best hub in the world, for Ineos and others, that was stiffer, lighter, and better, and to have control over the manufacturing so we wouldn’t be faced with outrageous lead times.</p>\n\n\n\n<p>“These are stiffer due to primarily using a mountain bike freehub as a starting point, using larger bearings than typical ‘ultralight’ hub options, optimized flange widths, and having a larger engagement surface area. For reference, the team was having some stiffness issues with Tune and Carbon Ti hubs because the very light Tune hubs use a multi-piece design, and the Carbon Ti hub flange geometry makes the rear tensions kind of wonky between driveside and non-driveside. So we aimed to rectify all these things based on feedback from pro riders and wheelbuilding experience here at PCW.”</p>\n\n\n\n<p>Naturally, Princeton CarbonWorks will feature the hubs as an option for its own wheels (existing hub options from other brands will carry on), but Tactic Racing is very much striving to be a standalone premium hub brand, so they’ll also be sold on their own for home and professional wheel builders, and other wheel brands. The new Tactic Racing hubs will be available immediately with a retail price of US$1,350 / AU$1,850 / £1,000 / €1,150 per set. Shimano 11/12 or SRAM XDR freehub bodies will be offered to start, with Campagnolo ones following a couple of months later.</p>\n\n\n\n<p>Are they as good as they say? Maybe, but hopefully we can find out firsthand soon. </p>\n\n\n\n<p>More information can be found at <a href=\"https://www.tacticracing.com/\" target=\"_blank\">www.tacticracing.com</a>.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Tactic-Racing-hubs-4-1340x754.jpg\" /><figcaption>The sliding ratchet ring is backed by a single coil spring. Note that both of the main driver bits are made of aluminum.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Tactic-Racing-hubs-6-1340x754.jpg\" /><figcaption>These certainly are rather serious-looking with their battleship-grey anodized finish. Maybe some brighter colors will be offered later?</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Tactic-Racing-hubs-7-1340x754.jpg\" /><figcaption>The claimed weights for the new Tactic Racing hubs are truly feathery.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Tactic-Racing-hubs-8-1340x754.jpg\" /><figcaption>The hubs are only made for use with straight-pull spokes, at least for now.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Tactic-Racing-hubs-9-1340x754.jpg\" /><figcaption>Seriously, the machining work on the hubs looks quite impressive.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Tactic-Racing-hubs-10-1340x754.jpg\" /><figcaption>Shimano 11/12 and SRAM XDR freehub bodies will be available at launch, and Campagnolo ones will follow in a couple of months.</figcaption></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/12/princeton-carbonworks-spins-off-new-tactic-racing-range-of-high-end-hubs/\">Read More</a>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3acc3c2d642edfa8623b39986e6c93858c0f8d36c95ee1690601cad959eb199c","category":"Cycling"}