{"title":"Prevalence of anemia and its associated factors among school-going adolescent girls in schools of Dhankuta municipality, Nepal","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003684","date":1726581600000,"content":"<p>by Milan Ghimire, Sheetal Bhandari, Manish Rajbanshi</p>\r\n\r\nAdolescent girls are more vulnerable to anemia, especially in low and middle-income countries like Nepal. It is due to early marriage and pregnancy, rapid physical growth, low body weight, economic disparities, heavy menstrual bleeding, and inadequate iron diet. This study aimed to determine the prevalence of anemia and its associated factors among school-going adolescent girls. A cross-sectional study was conducted among 405 adolescent girls using a stratified random sampling technique from both public and private schools. A statistical analysis was performed using IBM Statistical Package for Social Sciences (SPSS) version 25 software. The frequencies, percentages, mean, and standard deviation were used to describe the characteristics of the participants. Binary logistic regression was performed for multivariable analysis. All the tests were performed at a 95% Confidence Interval (CI) and p-value of &lt;0.05. The mean (± SD) age of the participants was 14.2 ± 1.2 years. The majority of the participants (64.7%) were from government schools. Around 18% (95% CI: 13.8, 21.2) of the participants were anemic in the study. Poor knowledge of anemia (AOR = 3.3, CI: 1.0, 11.1), incomplete iron and folic acid intake (AOR = 26.8, CI: 8.3, 86.4), and absence of dietary diversity (AOR = 2.5, CI: 1.1, 9.2) were significantly associated with the higher prevalence of anemia among the adolescent girls. To reduce the risk of anemia among adolescent girls, a comprehensive strategy involving a school health intervention package on anemia, IFA supplements, and deworming program should be promoted. Besides, community-focused awareness programs should be strengthened to increase dietary diversity and improve awareness of anemia in the community.","author":"Milan Ghimire","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"3ae82fc9a5b186f7464880e2b3dffbe9663d084514a08a3678250eaf7c07da63","category":"Environment"}