{"title":"Selective extinction and habitat nestedness are the main drivers of lizard nestedness in the Zhoushan Archipelago","link":"https://academic.oup.com/cz/article/70/2/244/6961758?rss=1","date":1672099200000,"content":"<span><div>Abstract</div>Nested subset pattern (nestedness) is an important part of the theoretical framework of island biogeography and community ecology. However, most previous studies often used nestedness metrics or randomization algorithms that are vulnerable to type I error. In this study, we investigated the nestedness of lizard assemblages on 37 islands in the Zhoushan Archipelago, China. We used the line-transect method to survey species occurrence, abundance, and habitat types of lizards on 37 islands during 2 breeding seasons in 2021 and 2022. We applied the nested metric WNODF and the conservative <span>rc</span> null model to control for type I error and quantify the significance of nestedness. Spearman rank correlations were used to evaluate the role of 4 habitat variables (island area, 2 isolation indices, and habitat diversity) and 4 ecological traits (body size, geographic range size, clutch size, and minimum area requirement) in generating nestedness. The results of WNODF analyses showed that lizard assemblages were significantly nested. The habitat-by-site matrix estimated by the program NODF was also significantly nested, supporting the habitat nestedness hypothesis. The nestedness of lizard assemblages were significantly correlated with island area, habitat diversity, clutch size, and minimum area requirement. Overall, our results suggest that selective extinction and habitat nestedness were the main drivers of lizard nestedness in our system. In contrast, the nestedness of lizard assemblages was not due to passive sampling or selective colonization. To maximize the number of species preserved, our results indicate that we should protect both large islands with diverse habitats and species with large area requirement and clutch size.</span>","author":"","siteTitle":"Current Zoology Current Issue","siteHash":"e7197aa0e79464a44186f16a81d9758c42b85acdd06820e73429ff264fcd9f66","entryHash":"3afc925cb6840dabac210eee8f9b35a11a752042daa9ae4b748806b60bde9ab1","category":"Environment"}