{"title":"Apple acquires Primephonic classical music streaming service to improve Apple Music","link":"https://www.macworld.com/article/354463/apple-aquires-primephonic-classical-music-streaming-service.html","date":1630348206000,"content":"<div>\n<section><div></div></section><p>Apple on Monday announced that it has acquired Primephonic, a streaming media startup with a focus on classical music. In a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/08/apple-acquires-classical-music-streaming-service-primephonic/&amp;xcust=1-1-354463-1-0-0&amp;sref=https://www.macworld.com/feed\">press release</a>, Apple says that users will be able to access Primephonic playlists and exclusive audio content, and that a “dedicated experience with the best features of Primephonic” will eventually be available.</p>\n\n\n\n<p>Digital music can be challenging to manage on streaming services—the metadata system for music files was created with popular music in mind. Apple made some improvements years ago when Apple Music was called iTunes, but it still was frustrating for classical music listeners. With the Primephonic acquisition, Apple says it can provide a better experience, with the ability to search by composer and repertoire, as well as “detailed displays of classical music metadata, plus new features and benefits.”</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/primephonic.jpg?quality=50&amp;strip=all\" /><figcaption><p>Primephonic started three years ago to bring a better streaming experience for classical music fans.</p></figcaption></figure><p>Primephonic</p></div>\n\n\n\n<p>A note on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.primephonic.com/&amp;xcust=1-1-354463-1-0-0&amp;sref=https://www.macworld.com/feed\">Primephonic </a>website seems to indicate that the three-year-old company saw the acquisition as necessary for it to achieve its goals. “As a classical-only startup, we can not [sic] reach the majority of global classical listeners, especially those that listen to many other music genres as well,” said the company. “We therefore concluded that in order to achieve our mission, we need to partner with a leading streaming service that encompasses all music genres and also shares our love for classical music.”</p>\n\n\n\n<p>Primephonic users can continue to use the service for free until it is shut down on September 7, and they can get six months of Apple Music for free. Apple will release a dedicated app for classical music next year that will have features that Primephonic are familiar with, plus “more added features.” </p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3b17280dc48342848ee818760ed7418f9064c27929542866d9aaa10420c7d087","category":"Apple"}