{"title":"Steve Jobs Asked Dell to Pre-Install Mac OS on PCs and Pay Hundreds of Millions in Royalties","link":"https://www.macrumors.com/2021/10/07/steve-jobs-dell-pre-install-mac-os-pcs/","date":1633644994000,"content":"The 10 year anniversary of Steve Jobs death took place <a href=\"https://www.macrumors.com/2021/10/05/apple-10th-anniversary-steve-jobs-death/\">earlier this week</a>, sparking tech leaders to share their stories of Apple's former CEO.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/cnet-michael-dell-steve-jobs.jpg\" />\r\n<br />\r\nDell CEO Michael Dell spoke to <em><a href=\"https://www.cnet.com/tech/computing/the-steve-jobs-deal-with-dell-that-could-have-changed-apple-and-tech-history/\">CNET</a></em>, reminiscing about the time that Steve Jobs aimed to get Dell to license Mac OS to run on Intel-based PCs and how that might have changed the PC industry.\r\n<br />\r\n\r\n<br />\r\nAs the story goes, Jobs first approached Dell about a partnership after being ousted from Apple and establishing NeXT. Jobs wanted Dell to use the NeXT operating system on Dell PCs, and he claimed that it was better than Windows.\r\n<br />\r\n\r\n<br />\r\nDell told Jobs that it wasn't going to happen because there were no applications for it and \"zero customer interest.\"\r\n<br />\r\n\r\n<br />\r\nAfter Jobs rejoined Apple, he once again attempted a software licensing deal, trying to get Dell to license Mac OS. At the time, Jobs pushed Dell by telling him PC buyers could choose between Apple's software or Microsoft Windows.<blockquote>\"He said, look at this - we've got this Dell desktop and it's running Mac OS,\" Dell tells me. \"Why don't you license the Mac OS?\"</blockquote>Dell thought it was a good idea and wanted to pay Jobs a licensing fee for every PC sold with Mac OS, but Jobs was worried about PC sales cannibalizing Mac sales because PCs were cheaper. Jobs instead wanted Dell to load Mac OS alongside Windows on every PC, which would have cost Dell hundreds of millions in royalties.<blockquote>Dell smiles when he tells the story. \"The royalty he was talking about would amount to hundreds of millions of dollars, and the math just didn't work, because most of our customers, especially larger business customers, didn't really want the Mac operating system,\" he writes. \"Steve's proposal would have been interesting if it was just us saying, \"OK, we'll pay you every time we use the Mac OS\" - but to pay him for every time we didn't use it ... well, nice try, Steve!\"</blockquote>The royalty cost dissuaded Dell from the deal, as did the lack of a guarantee that Dell would continue to have access to Mac OS years in the future. Dell customers could be out of luck as the software evolved, with no way for Dell to offer support.\r\n<br />\r\n\r\n<br />\r\nDell said that had that deal gone through, \"It could have changed the trajectory for Windows and Mac OS on PCs.\" In a 2005 interview, Dell said that if Apple \"opened the Mac OS to others\" Dell would be happy to offer it to customers, but that did not happen and Apple kept Mac OS exclusive to Macs.\r\n<br />\r\n\r\n<br />\r\nThough a software deal was never reached, Dell said that he remained friends with Jobs over the years despite various arguments. Dell one time was asked what he'd do to fix Apple if he was CEO, and he said \"I'd shut the company down and give money back to shareholders,\" which angered Jobs.\r\n<br />\r\n\r\n<br />\r\nJobs ultimately used the quote from Dell to motivate his team, which Dell respected. \"I probably would've done much the same thing if I was in his position,\" Dell told <em>CNET</em>. \"When the company you started is fighting for its life, you do whatever it takes.\"\r\n<br />\r\n\r\n<br />\r\nMichael Dell's story about Mac OS X is featured in his newly published memoir, \"<a href=\"https://www.amazon.com/Play-Nice-But-Win-Journey-ebook/dp/B08VWFW56N\">Play Nice But Win</a>,\" which also features stories of how he met Jobs, his infatuation with the Apple II, and how he developed a friendship with Jobs.<div>Tag: <a href=\"https://www.macrumors.com/guide/dell/\">Dell</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/07/steve-jobs-dell-pre-install-mac-os-pcs/\">Steve Jobs Asked Dell to Pre-Install Mac OS on PCs and Pay Hundreds of Millions in Royalties</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/steve-jobs-asked-dell-to-pre-install-mac-os-on-pcs-and-pay-hundreds-of-millions-in-royalties.2315900/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=R2XpdU6HhCg:jt3Hle6zrxE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=R2XpdU6HhCg:jt3Hle6zrxE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/R2XpdU6HhCg\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3b1e14f0811dca4b2d8965e47789f148112671b0c44da979dcbf1deb6542aa1f","category":"Apple"}