{"title":"Effect of Starvation on the Serum Physiology, Transcriptome and Intestinal Microbiota of Juvenile Largemouth Bass (Micropterus salmoides)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/8961174?af=R","date":1726131971000,"content":"<p>Starvation is common in fish, particularly during the juvenile period, and is typically caused by environmental changes. However, the molecular mechanisms of juvenile <i>Micropterus salmoides</i> in response to starvation are still poorly understood. We elucidated changes in the serum physiology, transcriptome, and intestinal microbiome of <i>M. salmoides</i> after 14 days of starvation. Body weight and serum concentrations of glucose, cholesterol, triglycerides, and alkaline phosphatase significantly decreased during the starvation period. However, serum concentrations of aspartate transaminase and alanine transaminase were significantly elevated. Transcriptome analysis of liver tissues from commonly fed fish and starved fish revealed 1069 differentially expressed genes (DEGs), of which 211 were up-regulated. In total, 586 DEGs were identified in the intestinal tissues, of which 166 were up-regulated and 420 were down-regulated. KEGG analysis revealed that starvation affected multiple pathways, particularly those related to energy, metabolism and immunity. Starvation limited fatty acid biosynthesis and elongation in the liver, down-regulated immunity-related genes in the intestine and promoted fatty acid degradation. The 16S rDNA analysis revealed that starvation altered intestinal microbiota homeostasis and increased intestinal Shannon diversity. Two opposite patterns of dominant genera emerged in commonly fed fish (most abundant genus is <i>Mycoplasma</i>) and in starved fish (most abundant genus is <i>Cetobacterium</i>). Starvation also increased the abundance of pathogens, including <i>Plesiomonas</i> and <i>Aeromonas</i>. Our study will provide the theoretical basis for assessing the starvation levels and nutritional status of juvenile fish and guidance for further studies on starvation in the context of fish physiology and health.</p>","author":"Huan Wang, \nHuaxing Zhou, \nHe Jiang, \nYuting Hu, \nTong Li, \nGuoqing Duan, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"3b33667dd6bad5aae4ff54087044285a499941ccf25bc7acea40f0e458683123","category":"Environment"}