{"title":"How your iPhone uses private tracking to enhance Maps, Photos, and more","link":"https://www.macworld.com/article/348526/how-to-use-the-iphones-tracking-to-give-you-better-information.html","date":1623920400000,"content":"\n<div>\n<section><div></div></section><p>Apple wants an iPhone and iPad to anticipate your needs, particularly for information, and suggest or promote ideas and information before you even know you wanted it. One method is via Significant Locations, a feature in iOS and iPadOS I’ve discovered few people even know exists.</p>\n\n\n\n<div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/06/mac911-significant-location.png?w=808\" /><figcaption>Significant Locations captures places you’ve been iOS and iPadOS thinks are useful for providing other kinds of information.</figcaption></figure></div></div>\n\n\n\n<p>As you move around with either device, the places you dwell are tracked. That includes your home and work, as well as restaurants you may frequent, other people’s houses, medical offices, and the like. These are called Significant Locations, and you can find the list buried deeply at <em>Settings &gt; Privacy &gt; Location Services &gt; System Services &gt; Significant Locations</em> under My Places and History.</p>\n\n\n\n<p>But before you fret, Apple doesn’t collect and use that information centrally. (I mean, they’re not Google.) Apple says it keeps the information only on your devices and uses end-to-end encryption (as it does with Messages, iCloud Keychain, and several other services) to sync these locations across your devices.</p>\n\n\n\n<p>Apple’s disclosure says Significant Locations are used to provide better cues and results in Maps (predictive traffic routing), Calendar (recurring appointment suggestions), Photos (Memories), and for other purposes.</p>\n\n\n\n<p>Apple said recently, too, that Significant Locations are used to alert you if there’s an AirTag location tracker traveling with you from place to place: when you arrive at a Significant Location, you receive an alert about the tracker and can try to figure out what’s going on. (You’re also alerted at the end of the day if you don’t hit any Significant Location or your Home, which is also defined in the Me card in Contacts, by days’ end.)</p>\n\n\n\n<p>If you dislike your device tracking places you go to frequently, you can switch the Significant Locations option off, and it won’t degrade your general experience.</p>\n\n\n\n<p>You can also swipe left on any location and tap Delete to remove it, or wipe the whole set of locations by tapping Clear History and confirming.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a> including screen captures as appropriate, and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3b409e67116eba98d2db0f63887ce4a314bab2f8aea60a26fd8a6191d814b39e","category":"Apple"}