{"title":"Home Screen web apps are not going away after all","link":"https://www.macworld.com/article/2238869/ios-17-4-home-screen-web-apps-digital-markets-act-eu.html","date":1709322967000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p><em><strong>Update 03/01/24:</strong> Apple has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/support/dma-and-apps-in-the-eu&amp;xcust=1-1-2238869-1-0-0&amp;sref=https://www.macworld.com/feed\">updated its developer site</a> to say that it has changed its mind, and will not remove the ability to have progressive web apps on the home screen after all. “Developers and users who may have been impacted by the removal of Home Screen web apps in the beta release of iOS in the EU can expect the return of the existing functionality for Home Screen web apps with the availability of iOS 17.4 in early March.” </em></p>\n\n\n\n<p><em>Our original story on the removal of this functionality follows…</em></p>\n\n\n\n<p>Back in iOS 14, Apple released a new feature to let users turn any website into an app by adding it to their home screen with a few taps. Then in iOS 17, it supercharged the feature by allowing those shortcuts to send notifications and show unread badges just like a real app. Unfortunately, If you live in the European Union, Apple is about to turn that off.</p>\n\n\n\n<p>As part of the <a href=\"https://www.macworld.com/article/2218208/ios-17-4-beta-eu-app-store-changes-features-install.html\">iOS 17.4 beta</a> that brings major changes to the App Store on the iPhone, Apple <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/support/dma-and-apps-in-the-eu#dev-qaa:~:text=To%20comply%20with%20the%20Digital%20Markets%20Act%2C&amp;xcust=1-1-2238869-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">has also announced </a>that users will no longer have access to Home Screen web apps. Of course, users will still be able to create bookmarks to their favorite sites within Safari, but Apple is removing the one-tap convenience of a dynamic home page icon. As Apple explains:</p>\n\n\n\n<blockquote>\n<p>Malicious web apps could read data from other web apps and recapture their permissions to gain access to a user’s camera, microphone or location without a user’s consent. Browsers also could install web apps on the system without a user’s awareness and consent. Addressing the complex security and privacy concerns associated with web apps using alternative browser engines would require building an entirely new integration architecture that does not currently exist in iOS and was not practical to undertake given the other demands of the DMA and the very low user adoption of Home Screen web apps. And so, to comply with the DMA’s requirements, we had to remove the Home Screen web apps feature in the EU.</p>\n</blockquote>\n\n\n\n<p>Basically, Apple doesn’t want to waste time on securing Home Screen web apps for third-party browsers and app stores since most people don’t use them. Web apps could be a way to avoid Apple’s fees and restrictions so it’s easier for Apple to just dump the feature.</p>\n\n\n\n<p>iOS 17.4 includes numerous App Store changes effective only in the EU, including alternative app stores and payments, third-party browser engines, and access to NFC for mobile payment systems. It also introduces some 600 new APIs, but unfortunately, progressive web apps aren’t among them. </p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3b43e7431c3e26bd25a2a805efad3c65f48cc775c4695087b8ea1e45c04e97a8","category":"Apple"}