{"title":"Google pushes emergency Chrome for Mac update to fix actively exploited flaw","link":"https://www.macworld.com/article/1789494/google-chrome-mac-zero-day-update.html","date":1681821907000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>After Apple issued <a href=\"https://www.macworld.com/article/1717319/ios-16-4-1-macos-13-3-1updates-bug-fixes-weather-home-handoff.html\">a string of security patches</a> to fix a critical WebKit vulnerability in Safari on the Mac, Google has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://chromereleases.googleblog.com/2023/04/stable-channel-update-for-desktop_14.html&amp;xcust=1-1-1789494-1-0-0&amp;sref=https://www.macworld.com/feed\">released an emergency security update</a> for its own Chrome browser to patch a vulnerability that has been exploited in the wild.</p>\n\n\n\n<p>Google has labeled the vulnerability as high risk and urges all users to update to version v112.0.5615.121. The update, which arrived on April 14, includes two security fixes, one of which is divulged as a type confusion bug in V8 discovered by Google’s Threat Analysis Group on April 11. Google says it is aware that the vulnerability has been exploited in the wild but declined to provide specific details.</p>\n\n\n\n<p>As usual, Google is restricting access to specific information about the flaw until “a majority of users are updated with a fix.” The second flaw isn’t divulged but Google reports that “ongoing internal security work was responsible for a wide range of fixes.”</p>\n\n\n\n<p>This is the first patch of 2023 that fixes a zero-day. In 2022, Google pushed nine <a href=\"https://www.macworld.com/article/1717319/ios-16-4-1-macos-13-3-1updates-bug-fixes-weather-home-handoff.html\">Chrome emergency</a> updates to fix zero-day flaws for Chrome and had already released three by mid-April. </p>\n\n\n\n<p>To update Chrome, click on the <em>Chrome</em> menu, then <em>About Chrome</em>. Check the version number to see if it’s been updated to v112.0.5615.121. If not, click Download and Install, and follow the prompts.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3b4b494e91b1d2d2121ba07da53395a468086e9403c5270afde8606837773d4e","category":"Apple"}