{"title":"Correlation between dysbiosis of vaginal microecology and endometriosis: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306780","date":1720447200000,"content":"<p>by Xuemei Qing, Min Xie, Ping Liu, Ou Feng, Hong Leng, Hongying Guo, Yong Zhang, Ying Ma, Wenxin Zheng</p>\r\nBackground <p>Endometriosis, a complex gynecological condition, involves inflammation and immune dysregulation. The vaginal microbiota, characterized by its diversity, is an integral part of the vaginal microecology—interacting with vaginal anatomy, the endocrine system, and local mucosal immunity. Imbalances in this microecology are known to precipitate various inflammatory diseases. Despite extensive research, the connection between vaginal microbiota dysbiosis and endometriosis remains a subject of debate. Our study assesses the association between vaginal microecology dysbiosis and endometriosis.</p> Methods <p>We systematically searched major electronic databases in English, including Embase, PubMed, The Cochrane Library, MEDLINE (Ovid), BIOSIS (Ovid), China National Knowledge Infrastructure (CNKI), and Wanfang, up to August 15, 2023. Selected articles underwent screening based on predefined inclusion and exclusion criteria. Normal vaginal microecology was defined as a negative Amsel/Spiegel test or Nugent score of 0–3, or <i>Lactobacillus</i> predominance determined by 16S rRNA gene amplification sequencing. Deviations from this norm were classified as dysbiosis, further categorized into bacterial vaginosis (BV) and intermediate BV. Data analysis utilized Revman 5.4, with effect sizes presented as Odds Ratios (OR) and 95% Confidence Intervals (CI).</p> Results <p>Out of 1081 articles, eight met the inclusion criteria. Utilizing fixed-effect models due to low heterogeneity, the analysis revealed a positive association between dysbiosis and endometriosis (OR = 1.17, 95% CI 0.81–1.70; I<sup>2</sup> = 0%), but showed a slight negative association between normal vaginal microecology with endometriosis (OR = 0.90, 95% CI 0.55–1.46; I<sup>2</sup> = 29%). However, the association was not significant. Subgroup and sensitivity analyses corroborated the stability of these associations.</p> Conclusion <p>A positive correlation exists between vaginal microecology dysbiosis and endometriosis, notably with intermediate BV. However, the mechanisms underpinning this relationship remain elusive, highlighting the need for further research to overcome limitations.</p> Trial registration <p>Registration number: CRD42023445163.</p>","author":"Xuemei Qing","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3b5c9d3456956ac0f81a822495ea4276924731ebefe06e3d938250399e32ef22","category":"Interdisciplinary"}