{"title":"Soak in the suspense - Catch Milan-San Remo live and uninterrupted","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/soak-in-the-suspense-catch-milan-san-remo-live-and-uninterrupted","date":1678980979000,"content":"\n      \n<p><span><em>This is a promotional feature with<span> </span><a href=\"https://welcome.globalcyclingnetwork.com/spring?utm_medium=endemic&amp;utm_source=rouleur&amp;utm_campaign=spring\" target=\"_blank\">GCN+</a></em></span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GCN_-Logos_RED__GCN-Plus-Black_100-thin_100x100.jpg?v=1657272884\" /></span></p>\n<p><span>There is no race on the planet that beats <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2023-everything-you-need-to-know\">Milan-San Remo</a> for suspense.</span></p>\n<p><span>There is no race on the planet other than Milan-San Remo where sprinters, rouleurs, climbers and the unfancied all think that they have a shot of winning.</span></p>\n<p><span>There is no race on the planet that fatigues riders like </span><i><span>La Classicissima di primavera</span></i><span> does.</span></p>\n<p><a href=\"https://welcome.globalcyclingnetwork.com/spring?utm_medium=endemic&amp;utm_source=rouleur&amp;utm_campaign=spring\" target=\"_blank\"><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Spring-Endemic-970x250.jpg?v=1677259760\" alt /></span></a></p>\n<p><span>There is simply no race like Milan-San Remo. It’s back. This Saturday. Rejoice. Spring is here, and a day of anticipation, seven hours of expectation, 90 minutes of nervousness, 15 minutes of nail-biting viewing, and 10 seconds of crowning glory is upon us. And GCN+ will show every kilometre live and uninterrupted. Saturday: sorted.</span></p>\n<p><span>Who will win? Only a fool would bet against Tadej Pogačar, he of seven wins in 13 race days this season.</span></p>\n<p><span>But then you’d be mad to write off Wout van Aert, winner in 2020. He is, after all, the most complete bike rider on earth. Just don’t say that in front of Mathieu van der Poel who is also competing and is fixated on bettering his third-place from 12 months ago.</span></p>\n<p><span>Then there's the lesser-mentioned contenders, including last year's Gent-Wevelgem winner Biniam Girmay, and former world champion Mads Pedersen.</span></p>\n<p><span>We’ve not even mentioned the defending Matej Mohorič. How could we forget him? It was at this very race 12 months ago that the Slovenian deployed a dropper post, sent the cycling world into a frenzy, avoided death by genius descending and god watching over him, and etched himself into cycling folklore with a daring pre-planned move that may never be bettered, certainly not repeated. </span></p>\n<p><span>Whilst we’re waiting for the action to heat up, it’s the perfect excuse to head through GCN+’s back catalogue of races and watch a repeat of the 2022 edition. How many times will you rewind Mohorič’s daredevil descent? Three? Five? A dozen times? While there, you may as well catch up on the highlights of the recent Tirreno-Adriatico because one man who excelled there with two stage wins is also at Milan-San Remo: Jasper Philipsen.</span></p>\n<p><span>Ah, yes, the sprinters. There’s a whole heap of fastmen taking to the startline: Caleb Ewan, twice a podium finisher; former winner Arnaud Démare; and you can’t discount Michael Matthews, Sam Bennett and Christophe Laporte, either. Click on GCN+ and scan the full shortlist to be fully abreast of who is there. It’s an A* cast.</span></p>\n<p><span>The beauty of Milan-San Remo is that we just don’t know what’s going to happen. We have no idea. GCN+’s expert panel of informed commentators and expert pundits, however, will guide you through the race from start to finish, explaining who’s looking good, and who’s card should be marked.</span></p>\n<p><span>At 294km, the length is absurd. But that’s what </span><i><span>makes</span></i><span> Milan-San Remo. It’s a war of attrition. It grinds down the riders into a fatigued mess. By the time the race gets to the Cipressa with 27km to go, many sprinters will be too beaten from seven hours in the saddle to cope with the punches of aggression from the climbers. They won’t be alone: most of the puncheurs and the mountain goats will feel just as exhausted.</span></p>\n<p><span>Someone will try their luck on the Cipressa. More than one, in fact. Will they hold on? Probably not. It’ll all be back together for the Poggio and fireworks will ignite and explode. Mohorič will no doubt press his dropper post into action; Pogačar, his compatriot, will attack before the summit.</span></p>\n<p><span>The finish into Via Roma, a glorious boulevard with cycling history coursing through it, will either be a cat-and-mouse chase or a bunch sprint. The drama will remain until the last pedal stroke. It’s the most contested race of the year, and GCN+ has it all.</span></p>\n<p><span>A marathon event, however, is not easy to watch: life gets in the way. No bother. GCN+ allows you to watch the race on whatever smart device you have, while you can pause, rewind and catch up at your convenience. There’s no excuse not to watch, is what we’re basically saying.</span></p>\n<p><span>One thing is for certain in this most captivating of bike races: we’ll want to see the winning move again, the attack or the sprint that earned someone the first Monument of the year. GCN+’s World of Cycling show will have all the best moments and on-the-money punditry and analysis, while tailored highlight packages will also be on the GCN+ app. </span></p>\n<p><span>While we reflect on what is guaranteed to be another spectacular March Saturday in Italy, don’t forget that the GCN+ app has a deep archive of exclusive cycling films, featuring everything from record-breaking pursuits to epic adventures. It’s not just epic road racing that you get with a subscription fee the cost of an inner tube.</span></p>\n<p><span>Tune it, soak it all up: GCN+ has you covered for the most unpredictably gripping bike race on the planet.</span></p>\n\n<p><span><em><span>You can catch all of Milan-San Remo and the other upcoming Classics by <strong><a href=\"https://welcome.globalcyclingnetwork.com/spring?utm_medium=endemic&amp;utm_source=rouleur&amp;utm_campaign=spring\" target=\"_blank\">subscribing to GCN+ here.</a> </strong>(Territory Restrictions May Apply).</span></em></span></p>\n<p><a href=\"https://welcome.globalcyclingnetwork.com/spring?utm_medium=endemic&amp;utm_source=rouleur&amp;utm_campaign=spring\" target=\"_blank\"><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Spring-Endemic-970x250.jpg?v=1677259760\" alt /></span></a></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3b5e10514776d560f5a330d31ee1ca74d4cc5a6e01fbe8eeeaf64a4acfc0080c","category":"Cycling"}