{"title":"Supported employment interventions with people who have severe mental illness: Systematic mixed-methods umbrella review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304527","date":1717596000000,"content":"<p>by Emi Patmisari, Yunong Huang, Mark Orr, Sumathi Govindasamy, Emily Hielscher, Helen McLaren</p>\r\nBackground/Aims <p>Primary and review studies show that supported employment interventions showed promise in assisting people with severe mental illness (SMI) in achieving successful employment and health-related outcomes. This umbrella review synthesises evidence from across review studies on supported employment interventions for individuals with SMI, to identify key findings and implementation challenges in relation to five key outcomes: (1) employment, (2) quality of life, (3) social functioning, (4) clinical/service utilisation, and (5) economic outcomes.</p> Methods <p>A systematic search of eleven databases and registers (CINAHL, Cochrane, EmCare, JBI EBP, ProQuest, PsycINFO, PubMed, Scopus, and Web of Science, and Prospero and Campbell) was conducted to identify meta-analyses and systematic reviews on supported employment interventions for individuals with SMI, peer reviewed and published in English. Quality assessment and data extraction were performed using standardised Joanna Briggs Institute (JBI) tools. A mixed-methods synthesis approach was employed to integrate both quantitative and qualitative evidence.</p> Results <p>The synthesis of 26 review studies primarily focused on the Individual Placement and Support (IPS) model among various supported employment interventions. Overall, combining supported employment with targeted interventions such as neurocognitive therapy and job-related social skill training showed a positive effect on employment (including job retention) and non-employment outcomes (e.g., health, quality of life, social functioning) relative to standard forms of supported employment for people with SMI. Contextual factors (intervention fidelity, settings, systemic barriers) were important considerations for intervention implementation and effectiveness.</p> Discussion <p>Significant overlap of primary studies across 26 review studies exposed considerable variations in interpretation and conclusions drawn by authors, raising questions about their reliability. High volume of overlap reporting from the USA on IPS interventions in review studies is likely to have biased perceptions of effectiveness. There is no one-size-fits-all solution for supporting individuals with SMI in obtaining and maintaining employment. Tailoring strategies based on individual needs and circumstances appears crucial to address the complexity of mental health recovery. We propose creating centralised registries or databases to monitor primary studies included in reviews, thus avoiding redundancy.</p> Other <p>This umbrella study was registered with PROSPERO (No. CRD42023431191).</p>","author":"Emi Patmisari","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3b71f7874a324d95ffc3ec0145fdfdc6c0a5a06ad0ce17fcd3702685d56f5452","category":"Interdisciplinary"}