{"title":"Bose QuietComfort 45 Headphones Leaked Ahead of Impending Launch","link":"https://www.macrumors.com/2021/08/18/bose-quiet-comfort-45-headphones-leaked/","date":1629276899000,"content":"Bose appears to be near to releasing a successor to its popular QuietComfort 35 active noise-canceling headphones. Based on leaked photos and details obtained by <em><a href=\"https://winfuture.de/news,124669.html\">WinFuture</a></em>, the company's upcoming QuietComfort 45 headphones look set to retain the QC35's signature overall design, with some welcome changes that bring it up-to-date. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/Bose-QuietComfort-45-QC-45-1629200873-0-12.jpg\" />\r\n<br />\r\nLaunched in 2016, the QC35s (<a href=\"https://www.macrumors.com/review/bose-quietcomfort-35-headphones/\">reviewed here</a>) still come with a micro-USB port, and this is the most notable change in the QC45s, which sport USB-C. Meanwhile, the same physical buttons for controlling noise canceling, volume, and your voice assistant of choice are in evidence, and the headphones fold up in the same way.\r\n<br />\r\n\r\n<br />\r\nOtherwise, the housing for the headband and cups make use of the same synthetic leather and glass-filled nylon to ensure the headphones remain \"shockingly light\" and durable,  according to Bose. Expect similar pad comfort levels, too.\r\n<br />\r\n\r\n<br />\r\nThe QC45s feature an Aware Mode for allowing external sounds to be heard (think Transparency Mode in <a href=\"https://www.macrumors.com/guide/airpods/\">AirPods</a>), the same TriPort acoustic architecture, and support for tuning audio to Bose's volume-adaptive Active EQ. \r\n<br />\r\n\r\n<br />\r\nBattery life is said to be 24 hours of continuous playback – up from 20 hours in the QC35s – and the inclusion of USB-C brings with it a 15-minute Quick Charge capability that provides 2.5 hours of listening time. Multipoint pairing to two devices at the same time is supported, and the 3.5-millimeter jack is staying put for longer wired listening.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/bose-qc45.jpg\" />\r\n<br />\r\nAs for the quality of the active noise-canceling, <em>WinFuture</em> doesn't have any information, but expect Bose to go all out for the latest version of its flagship model, given competing headphones like Sony's WH-1000MX4 offer equal if not better noise cancelation than the QC35s.\r\n<br />\r\n\r\n<br />\r\nThe QuietComfort 45 headphones are expected to be officially announced soon with a retail price of $329.<div>Tag: <a href=\"https://www.macrumors.com/guide/bose/\">Bose</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/18/bose-quiet-comfort-45-headphones-leaked/\">Bose QuietComfort 45 Headphones Leaked Ahead of Impending Launch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/bose-quietcomfort-45-headphones-leaked-ahead-of-impending-launch.2307896/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=1nJzz0ikxFk:Xip1vfxv1F8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=1nJzz0ikxFk:Xip1vfxv1F8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/1nJzz0ikxFk\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3b786864412961a8a2ae08011fd86c7b1a45e139178616a2677e0a3604987b84","category":"Apple"}