{"title":"Fostering inclusive science media: Insights from examining the relationship between women’s identities and their anticipated engagement with <i>Deep Look</i> YouTube science videos","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308558","date":1723212000000,"content":"<p>by Jocelyn Steinke, Christine Gilbert, Kelsi Opat, Asheley R. Landrum</p>\r\n\r\nAs science media content creators strive for inclusivity in communication design and promotion, they must consider the influence of audiences’ identities on their engagement with science media. A gender gap in viewership or \"missing audience\" has been identified for women viewers for educational science content on digital media; one such example of this is <i>Deep Look</i>, a science video series from KQED public media and PBS Digital Studios distributed on YouTube. This study used a mixed method design (1) to examine women’s preferences for <i>Deep Look</i> YouTube video promotions (i.e., episode titles and thumbnail images—the images that act as a preview for the video) to best inform future design of promotional content for these videos to attract more women viewers, and (2) to explore how women’s preferences for science content are linked to their social identities, science identity, and science curiosity. Findings indicated that women’s preferences for promotions for <i>Deep Look</i> YouTube science and nature videos followed expected trends with most women preferring images perceived as visually attractive and colorful more than images perceived as disgusting or gross. However, these preferences were conditional on science curiosity and science identity. Findings indicated that to boost women’s engagement with YouTube science and nature videos, content creators may find it useful to consider how science curious various women audiences are, how strongly women viewers identify with being a science person, and how their most salient social identities motivate engagement.","author":"Jocelyn Steinke","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3b858dd50d8cae89792221dcc35c3a1ca418e68f4c4573921b661b4d683156f6","category":"Interdisciplinary"}