{"title":"'There's no doubt I'm stronger, but I'm not getting the same results' - Romain Bardet on age, retirement and Tour de France dreams","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/theres-no-doubt-im-stronger-but-im-not-getting-the-same-results-romain-bardet-on-age-retirement-and-tour-de-france-dreams","date":1679299204000,"content":"\n      <p>In many ways it is hard to believe that French rider Romain Bardet is now one of the peloton’s veterans. After all, for years it seemed, Bardet was one of his country’s eternal hopefuls. After finishing second at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> in 2016 and third in 2016, some even saw him as a potential Tour winner – the first Frenchman since Bernard Hinault back in 1985. <span>But now at 32, not even Bardet sees Tour victory as a real possibility, yet he remains as motivated as ever.</span></p>\n<div></div>\n<p>“It’s funny, 32 is not that old, but I am starting to be seen that way,” Bardet told <em>Rouleur</em> while at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice\">Paris-Nice</a>. “It’s really just about people’s perception. A couple of years ago we wouldn’t even talk about age at 32, but there is such a big wave of young riders that suddenly 32 seems rather old. And it is true, this is my 10th Paris-Nice. Time passes and I am aware of that.”</p>\n<p><span>Bardet, who came into his own at the height of Team Sky’s dominance, admits his chances of winning the Tour were always slim at best. But with today’s generation led by Tadej Pogačar and Jonas Vingegaard, he sees his chances as nearly obsolete. </span></p>\n<p><span>“Before we had Sky, who was really superior to the rest of us, so winning the Tour would always have been a surprise. It was always going to be difficult. But it was always a pleasure to compete with them and finish on the podium. Today though it is even more difficult. The generation of young riders is just so strong.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/bardet_depart_Ardeche_classic_2023.jpg?v=1678871419\" alt /></span><span>Bardet insists, however, that he has lost no strength. “To be honest, I am even stronger. My numbers are better than ever. I am able to train harder. There is no doubt I am stronger, but I’m not getting the same results.”</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-heartwarming-story-of-how-romain-bardet-s-old-bike-is-carrying-the-hopes-of-oman-s-national-champion-the-disciplined-one\"><strong><em>Read more: The heartwarming story of how Romain Bardet's old bike is carrying the hopes of Oman's national champion</em></strong></a></p>\n<p><span>In some ways Romain Bardet needs to learn from, well, Romain Bardet. After all, in his prime, Bardet never won bike races on sheer strength alone. Instead, he earned a reputation as an unpredictable rider, willing to take chances and go on the attack. And it was his aggressive style that allowed him to turn the tables on the 2016 Tour de France. </span></p>\n<p><span>Starting stage 19, Bardet was sitting in fifth place, but he surprised his opponents when he went on the attack in the rain and soloed to victory in Saint-Gervais, a move that catapulted him into second place, and his first podium in the Tour.</span></p>\n<p><span>“I’ve always been a rider of circumstance,” says Bardet. “Sure, I am still capable of finishing on the podium, but all the circumstances have to come together perfectly.”</span><span> </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/bardet01_classic_2023.jpg?v=1678871458\" alt /></span><span>At this year’s Paris-Nice, Bardet rode consistently, and was constantly near the front. But he was clearly in the second tier of favorites behind the Tadej Pogačar, David Gaudu and Vingegaard, who dominated the race. </span></p>\n<p><span>“I have to race with more opportunism,” Bardet analysed. “At this point in my career, I have nothing left to prove. I still love training and racing, and actually I am enjoying it more now. I feel more relaxed, liberated.”</span></p>\n<p><span>Such peace of mind perhaps comes from age, but in Bardet’s case, fatherhood plays an additional role and he regularly posts images hanging out with Agnus, his three-year-old son. </span><span> </span></p>\n<p><span>“A child is sort of a mirror for you and puts everything in perspective. Being a father gives me confidence but also a certain distance.”</span></p>\n<p><span>Bardet also knows that his prime years are now limited. As he watches contemporaries like Thibaut Pinot, Peter Sagan and Rohan Dennis all announce clear dates for their own retirement, Bardet also considers the end. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/bardet01_Drome_Classic_2023.jpg?v=1678871508\" alt /></span><span>“I know the point will come. I’m not there yet, but I don’t see myself racing until I’m 38. But I’ll know.”</span><span> </span></p>\n<p>For the moment though, his own retirement remains an abstraction, and he is firmly focused on the current season. Bardet hopes to race with renewed confidence in this year’s Tour. Unlike the past three years, Bardet will not participate in the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia</a>. Instead he will focus firstly on the Tour, which will start in the Spanish Basque Country and include the most mountainous opening week in memory. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tricky-mountains-and-a-long-time-trial-will-we-finally-see-a-nail-biting-gc-finish-at-the-2024-tour-de-france\"><em><strong>Read more: Tricky mountains and a hilly time trial - will we finally get a nail-biting GC finish at the 2024 Tour de France? </strong></em></a></p>\n<p><span>“The route is super exciting,” Bardet recently told the French sports daily <em>L’Equipe</em>. “The physiognomy is unique. It’s the hardest first week of a Grand Tour that has ever existed I think.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/alaphilippe_bardet_classic_2023.jpg?v=1678871481\" alt /></span><span>In terms of his own ambition in the Tour, Bardet does not cite concrete goals but simply says, “I want to have a complete Tour, one where I felt that I gave everything.”</span></p>\n<p><span>Interestingly, when observing the current crop of champions, it is not the stage race riders that impress him the most, but Classics specialist Mathieu van der Poel. “I’m just a huge fan,” he says. “I love the way Mathieu races. He is a total cyclist, a cyclist’s cyclist, and he is true to himself. He can give 200% one day and be totally empty the next and it doesn’t matter. He just gives everything he’s got, and I love that.”</span></p>\n<p><span>Bardet promises to come to this year’s Tour prepared to give everything. And if he does, we may just see the real Romain Bardet. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3b906baabb8885b80640b0e8612fa32dbf4226e607e33af4ed58653347515943","category":"Cycling"}