{"title":"Assessing the Impact of Nutrient Levels (N:P Ratios) and Temperature, on Algal Growth in an Urban Lake through Monitoring","link":"https://www.preprints.org/manuscript/202407.0317/v1","date":1719989302000,"content":"AbstractLarge numbers of urban lakes are facing issues related to cyanobacteria, commonly known as blue-green algae, resulting in significant threats to humans and animal health due to their production of microtoxins and Anatoxin-A. These toxins induce acute effects including gastrointestinal distress, and respiratory problems, underscoring the need to protect urban lakes to safeguard community health and ecosystem well-being. A comprehensive monitoring program is a critical step to address cyanobacteria-related issues. Monitoring results of dissolved phosphorous, nitrates(N), Total Kjeldahl Nitrogen (TKN), total phosphorous (TP), TSS, and Escherichia coli (E. coli) concentrations, are used to understand the importance of different pathways events during dry conditions (no prior rainfall) and wet events (rainfall during or proceeding monitoring events) plus a microbial source tracking procedure, to understand impacts on growth characteristics of cyanobacteria and microtoxins.  The Mann-Kendall Trend Test is used to characterize trends of various parameters (using transitions of ‘wet’ and ‘dry’ to the Lake and within the Lake), to identify the impact of various management strategies and/or the impact of various sources from overland land uses for a) wet events to the Lake, b) dry events to the Lake, c) wet events in the Lake, and d) dry events within the Lake.  Microbial source tracking methods are used along the shoreline of Fairy Lake to interpret elevated levels of fecal pollution and E. coli bacteria in water samples, aiding in the identification of pollution sources. Blue-green algae have been observed at least once each year from 2018 to 2023. Microtoxins and Anatoxin-A were present in nine samples with a maximum of 1.72 mg/L and 0.02 mg/L, respectively. Frequent beach closures have occurred every year, raising public concerns regarding both ecological and recreational aspects for Fairy Lake.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3b9057c99420be0afbdd2cc0c2dbf676ca8c5185a295c38fe4b8850b1a705e20","category":"Interdisciplinary"}