{"title":"Clinical and Technical Validation of OncoIndx&reg; Assay &ndash; A Comprehensive Genome Profiling Assay for Pan-Cancer Investigations","link":"https://www.preprints.org/manuscript/202408.0098/v1","date":1722781684000,"content":"Comprehensive next-generation sequencing (NGS) assays enable identification of clinically relevant mutations, enhancing the capability for targeted therapeutic interventions. In addition, genomic alterations driving the oncogenic roadmap and lead to resistance mechanisms are reshaping precision oncology. We report, workflow, informatics validation of OncoIndx NGS platform – a comprehensive genomic profiling (CGP)-base assay for pan-cancer investigation. We evaluated the concordance between the OncoIndx® test findings and clinically established hotspot findings using SeraSeq reference standards. OncoIndx is a hybridization capture-based NGS assay for targeted deep sequencing of all exons and selected introns of 1080 cancer related genes. We show the outcome in the form of -tier I and tier II single nucleotide variants (SNVs), copy number alterations (CNAs), and specific gene rearrangements (fusion). OncoIndx® also enables tumor mutational burden (TMB), microsatellite instability (MSI), homologous recombination deficiency (HRD), and genomic loss of heterozygosity (gLOH). We show maximum clinical sensitivity of 98% and a positive predictive value (PPV) of 100% for the clinically actionable genomic variants detected by the assay. In addition, we demonstrate analytical validation with performance of the assay, limit of detection (LoD), precision, and orthogonal concordance for various types of SVs, CNAs, genomic rearrangements, and complex biomarkers like TMB, MSI, and HRD. The assay offers reliable genomic predictions with high precision detection of actionable variants, validated by established reference standards.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3b95400dae261fe9d1b3f056eb46aef682e34e84447a3477228baa2184908a0e","category":"Interdisciplinary"}