{"title":"Mark Gurman Recaps His Reporting on Apple’s Upcoming XR Headset","link":"https://www.bloomberg.com/news/features/2023-05-18/apple-s-mixed-reality-headset-may-define-tim-cook-s-legacy","date":1684468330000,"content":"\n<p>Mark Gurman, reporting for Bloomberg:<sup>*</sup></p>\n\n<blockquote>\n  <p>Other key figures in Apple’s top ranks, such as Craig Federighi,\nsenior vice president for software engineering, have also kept\ntheir distance and seemed wary of the headset, according to people\nfamiliar with the project. Johny Srouji, Apple’s senior vice\npresident for hardware technologies, has privately been a skeptic,\nlikening it to a science project. Internally he’s warned that\nbuilding the high-performing chips needed for the device could\ndistract from new iPhone chips, which would probably drive more\nrevenue.</p>\n</blockquote>\n\n<p>That’s some legitimately juicy gossip. But I’m not sure how Federighi, the head of all software at Apple, could keep any distance at all from Apple’s first major new software platform since the iPhone.</p>\n\n<blockquote>\n  <p>Srouji’s group did end up developing some of Apple’s most advanced\nchips to date for the headset, while <a href=\"https://www.bloomberg.com/news/newsletters/2022-07-03/apple-aapl-iphone-apple-watch-take-a-back-seat-to-the-mac-in-chip-upgrades-l55d87p9\">iPhone speed gains have\nindeed slowed</a> in recent years.</p>\n</blockquote>\n\n<p>Well of course Srouji’s group developed advanced chips for the headset. Where else would the chips come from? “*Well Tim, Johny is skeptical about this project, so I guess we’ll commission all the custom silicon designs from Qualcomm.”</p>\n\n<p>And comparing benchmark results for <a href=\"https://browser.geekbench.com/ios-benchmarks/\">iPhones</a> vs. <a href=\"https://browser.geekbench.com/android-benchmarks/\">Android phones</a>, I’d love to know what speed gains have slowed. It seems like nonsense to me. If anything, Apple’s A-series chips are further ahead of the competition than ever in both raw performance and performance-per-watt.</p>\n\n<blockquote>\n  <p>In an attempt to keep headset wearers engaged with the real\nworld, the device will have an outward-facing display showing\ntheir eye movements and facial expressions. Apple regards this\nfeature as a key differentiator from enclosed VR headsets. One\nperson familiar with the device says the exterior screens allow\npeople to interact with a headset wearer without feeling as if\nthey’re talking to a robot.</p>\n</blockquote>\n\n<p>I’ll buy this front-facing display rumor <a href=\"https://daringfireball.net/misc/2023/05/cylon.gif\">if there’s a Cylon mode</a>.</p>\n\n<p>Otherwise I’ll stick with <a href=\"https://daringfireball.net/2023/01/if_a_tree_that_was_never_announced_falls_in_a_forest_does_it_make_a_sound\">my previous understanding</a> that this is an internal joke that has been taken as real; that it would look <a href=\"https://www.pinterest.com/pin/299770918930142474/\">goofy</a>, not humane; and that even if it didn’t look goofy, <a href=\"https://daringfireball.net/linked/2023/02/03/report-it-all\">it would make no sense</a> to add the financial cost of an outward-facing display to an already-expensive device, and even less sense to incur the battery-life drain of powering that external display on an already-battery-life-constrained device.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/18/gurman-headset-recap\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"3b99169aefb2034c8cb9ff86a32699a61cc2e7b7aeb9b9d9aed947c334788f21","category":"Tech"}