{"title":"Impact of ADA Guidelines and Medication Shortage on GLP-1 Receptor Agonists Prescribing Trends in the UK: A Time-Series Analysis with Country-Specific Insights","link":"https://www.preprints.org/manuscript/202409.1023/v1","date":1726148899000,"content":"Background: Several GLP-1 receptor agonists (GLP-1 RAs) are used to treat type 2 diabetes (T2DM). Their cardio- and renal protective effects and substantial weight loss have been evident and progressively expanded their role in the American Diabetes Association (ADA) guidelines, which are endorsed by the European Association for the Study of Diabetes (EASD). The increased demand leads to a global shortage. Methods: We utilized a repeated cross-sectional design, drawing data from national prescribing databases, to analyze six GLP-1 RAs: Dulaglutide, Enatide, Liraglutide, Lisenatide, Semaglutide, and Tirzepatide. AutoRegressive Integrated Moving Average (ARIMA) models with exogenous variables were applied to assess trends over time and regions. Results: The prescription rates significantly differ between regions. Wales shows the highest prescribing for most GLP-1 RAs. The ARIMA models indicated a significant increase in their prescribing after ADA guidelines 2022 (e.g., Dulaglutide: Post-ADA effect of 15.22, 95% CI: [12.97, 17.47]). Following GLP-1 RAs shortages in July 2023, the prescribing rates, particularly for Semaglutide, increased (Shortage effect: 74.36, 95% CI: [71.92, 76.80]). Model diagnostics, including the Akaike Information Criterion (AIC) and Durbin-Watson statistics, confirmed the robustness of these trends. Conclusion: Informed decisions should be made by considering prescribing trends before and after important events such as the issuing of new guidelines or safety alerts.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3ba75595228b5a1b33d35e6394be903184a931fcd72f8b8390b56be16e2be7f9","category":"Interdisciplinary"}