{"title":"Study on the regularities of flow‐sediment transport and sedimentation in the lower Yellow River","link":"https://onlinelibrary.wiley.com/doi/10.1002/rvr2.91?af=R","date":1721358636000,"content":"<h2>Abstract</h2>\n<p>The training effectiveness of the lower Yellow River (LYR) depends on the understanding of the regularity of flow-sediment transport and riverbed sedimentation. The measured data of daily flow discharge and sediment transport rate at the five hydrological stations (Xiaolangdi [Xld], Huayuankou [Hyk], Gaocun [Gc], Aishan [As], and Lijin [Lj]) in the LYR during the period from 1960 to 2017 are used to investigate the regularity of flow-sediment transport and sedimentation in the LYR. The Xld station is used as the inlet control station, and the LYR is divided into four segments using four other stations, and the whole year is divided into three periods, namely, the dry season, the flood period, and the nonflood period of the wet season. On this basis, the relationships between the sediment transport rates at the four stations (Hyk, Gc, As, and Lj) and the rates at their respective closest upstream stations are analyzed in each of the three periods. According to the incoming sediment coefficient of the Xld station, the flow and sediment processes in the three periods are classified, and the refined equations for the relationship between the sediment transport rates at the downstream station and its upstream station are established. The results show that the calculated amount and process of erosion and deposition in each period and each segment of the LYR using the equations are in good agreement with the measured values. The relationship equations established in this study can conveniently predict the amount of erosion and deposition in different periods and different segments of the LYR in the future, which is of great significance to the rapid decision of the impact of the construction and operation of hydraulic projects in the upper and middle reaches of the Yellow River on the sedimentation in the LYR.</p>","author":"Zhao Zheng, \nQingchao Guo, \nAnjun Deng, \nDangwei Wang","siteTitle":"Wiley: River: Table of Contents","siteHash":"0b74d58d2572beb2996093d38ec1aeffad4d7646e8152f056f56cbe7cdd98b36","entryHash":"3baa9462c3bfe0640ec2ca274c647f2c441464bb4d87de94c1331df27dccec7c","category":"Environment"}