{"title":"PSVII-17 The effects of gamma-aminobutyric acid on growth performance, antioxidant capacity, rumen fermentation, and diarrhea in newborn calves before weaning","link":"https://academic.oup.com/jas/article/102/Supplement_3/620/7757576?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>As antibiotic feed additives are being prohibited, alternative growth promoters that do not use antibiotics must be identified and developed for the livestock industry, notably for young animals like newborn calves. Gamma-aminobutyric acid (GABA) is a significant inhibitory neurotransmitter in the mammalian central nervous system that reduces blood pressure, stimulates feed intake, and enhances antioxidant capability. While GABA has been used as a feed additive for adult cows, little research has been conducted on GABA supplementation in calves. In this study, we examined GABA effects on the growth performance, antioxidant capacity, rumen fermentation, and diarrhea incidences in newborn calves. We randomized calves (n = 90) into five GABA-administered groups: 0 mg/d (G0), 25 mg/d (G25), 50 mg/d (G50), 100 mg/d (G100), or 200 mg/d (G200) were administered to animals from 11 and 75-d of age. Feed intake was recorded daily. Calves were individually fed twice a day (0600 h and 1400 h) and weaned at 75-d of age. Rumen fluid, serum, and fecal scores were collected at 11, 28, 42, 60, and 75-d of age. GABA addition (50 mg/d and 200 mg/d) numerically reduced diarrhea incidences in 11–28- and 11–75-d-old animals. GABA also had positive effects on average daily gain (ADG) and body height. The ADG in the 100 mg/d group was significantly higher than in controls (<span>P</span> = 0.004). GABA also increased butyrate concentrations and decreased methane (CH<sub>4</sub>) levels. In conclusion, GABA addition benefited newborn calves in terms of growth performance and diarrhea prevention. The optimal supplementation level was G100 (100 mg/d).</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3bbf436f09cb132158fcd41cdce784c253702e94227b1145b1cfe518ee2b4168","category":"Environment"}