{"title":"Cyclist Doorstep Rides, No2: Editor Pete's ride around North London and Hertfordshire","link":"https://www.cyclist.co.uk/in-depth/9469/cyclist-doorstep-rides-no2-editor-petes-ride-around-north-london-and-hertfordshire","date":1617886784000,"content":"<span>\n      <span><a href=\"/authors/pete-muir\">Pete Muir</a></span>\n  </span><div>  \n  <div>      <div><span>9 Apr 2021</span></div>    </div></div><p>\nThere is plenty of good riding to be had in North London and Hertfordshire, and it's probably closer to your front door than you might think</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/04/screenshot_2021-04-09_at_09.35.29.png?itok=fcPde_uH\" />  </div>\n<div>\n      <p> <strong>Over an eight-week period, <em>Cyclist</em> and <em>komoot</em> are sharing some of their favourite rides and routes that are accessible from the doorstep. This time it's <em>Cyclist</em> editor Pete Muir's turn</strong></p>\n<p>London is a city of 9.5 million people, and at any one time it seems like most of them are driving around in cars just a little bit too fast. It’s not really the best place to be a cyclist, but even here it is possible to find quiet roads, country lanes and even the occasional testing climb.</p>\n<p>This ride starts in north London and heads north, out past the M25, and performs a droopy figure of eight through Hertfordshire, skirting the towns of Welwyn Garden City and Stevenage and doing its best to avoid any major roads.</p>\n<p>Fortunately the A1(M) motorway sucks most of the traffic away from the area, meaning that many of the lanes remain blissfully car-free, and the amount of time spent on A-roads can be counted in seconds.</p>\n<p>As this is my route, the official starting point is my front door, although you are welcome to skip that bit unless you’re looking for a ride partner, in which case give me a buzz. I’m usually free.</p>\n<div>\n<div>\n<div>\n<div>\n<div>\n          </div>\n</div>\n</div>\n</div>\n</div>\n<p>Instead make your initial target the short, steep climb up to Alexandra Palace, the one-time Victorian ‘People’s Palace’, former home of the BBC and now popular darts venue. It’s a great place to stop and look back over the London skyline, noting how small St Paul’s Cathedral looks compared to the towering glass edifices of the City.</p>\n<p>From here it’s basically a dash to get out of the urban jungle, which means about 14km of dodging potholes and delivery vans through such salubrious areas as Bounds Green, Southgate and Cockfosters. Eventually you cross over the M25 and emerge in Potters Bar, gateway to Hertfordshire.</p>\n<p>Suddenly everything changes. The houses get quainter and spaced further apart. Farms start to appear. The pubs look like the kind of places you would consider whiling away a sunny afternoon in the beer garden.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/04/screenshot_2021-04-09_at_09.35.38.png\" />  </div>\n</div>\n<p>A trio of punchy climbs – favourite test pieces of local bike clubs – takes you through pretty villages such as Little Berkhamsted and Letty Green. Then it’s on through woods strewn with bluebells in spring, and fields rich with wheat in the summer. Despite still being within easy commuting distance of central London, expect to see people riding horses and ruddy-faced men driving tractors.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/9435/cyclist-doorstep-rides-no1-digital-editor-joes-ride-around-kent\">Cyclist Doorstep Rides, No1: Digital editor Joe's ride around Kent</a></div>    </div></div><p>\nThe turning point comes at Cromer, just to the northeast of Stevenage, after about 55km. The route now wiggles its way south through Ardeley, Haultwick, and even takes in a short stretch of gravel through leafy Sacombe Park, which cunningly avoids having to ride any distance on the busy A602.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/04/pete-muir-doorstop-3_1.jpg?itok=r9TLAYex\" />  </div>\n</div>\n<p>Skimming through lanes to the north of Hertford, you eventually reappear in Potters Bar, albeit via a different route from the one you arrived by. The roar of cars on the M25 welcomes you back to the Capital, and then it’s a tour of all the Barnets – Chipping, High, New, Friern – before returning to the warm embrace of the North Circular ring road.</p>\n<p>After 112km, a final leg-tester up to Muswell Hill ensures that every last ounce of energy is used up. And then it’s everyone back to mine for coffee and cake.</p>\n<h3>The route powered by komoot</h3>\n  </div>\n<div>  \n  <div>      <div><a href=\"/destinations\">Destinations</a></div>    </div></div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"3bc14035664593df14188d8b66645202a4063dc4a59bb145a68c5c115521ee97","category":"Cycling"}