{"title":"Vegetation restoration in the coarse‐textured soil area is more conducive to the accumulation of Fe‐associated C","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14749?af=R","date":1722587688000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/9815a120-fd47-4b35-9c78-eab37e0b125f/jpe14749-toc-0001-m.png\" alt=\"Vegetation restoration in the coarse-textured soil area is more conducive to the accumulation of Fe-associated C\" />\n<p>Vegetation and soil type strongly regulated the effects of vegetation restoration on soil Fe-associated C. Forestlands may be the optimum vegetation type to provide soil C sequestration benefits, effectively increasing soil C pool and maximising Fe-associated C content. This study has addressed the knowledge gap regarding the effects of vegetation restoration on soil Fe-associated C and provides scientific basis for a better understanding of the soil C cycle and developing scientific vegetation restoration measures.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nVegetation restoration has an important effect on soil carbon (C) pool dynamics. Highly stable iron (Fe)-associated C is an important component of the soil C pool and it plays a crucial role in the soil C cycle. However, a knowledge gap remains regarding the existence of Fe-associated C variation during vegetation restoration.\n\nHerein, 0–60 cm soil samples of cropland, grassland, shrubland and forestland from three soil types (loam, loess and sandy soils) were collected to explore the response of Fe-associated C to vegetation restoration.\n\nThe results showed that soil Fe-associated C proportion in the study area ranged from 2.2% to 26.3%. Surface soil (0–20 cm) Fe-associated C content in loess and sandy soils increased following vegetation restoration, but decreased in loam soil. The accumulation efficiency of soil Fe-associated C during vegetation restoration was higher in coarser soils. Moreover, the Fe-associated C content and proportion of forestland with a higher soil organic matter (SOM) pool were the highest among the land use types.\n\nVegetation restoration affects soil Fe-associated C in two different ways: (1) increasing the SOM and dissolved organic C and improving the efficiency of C and Fe binding to promote the accumulation of Fe-associated C; (2) decreasing the total soil Fe content, reducing the trivalent iron (Fe(III)) to bivalent iron (Fe(II)) and breaking the binding of C and Fe to decrease soil Fe-associated C content, and these two different ways were found in all three soil types. Additionally, higher SOM accumulation efficiency and less root destruction caused by vegetation restoration in coarse soils resulted in a higher Fe-associated C accumulation efficiency.\n\n<i>Synthesis and applications</i>. Vegetation and soil type strongly regulated the effects of vegetation restoration on soil Fe-associated C. Forestlands may be the optimum vegetation type to provide soil C sequestration benefits, effectively increasing soil C pool and maximising Fe-associated C content. This study has addressed the knowledge gap regarding the effects of vegetation restoration on soil Fe-associated C and provides scientific basis for a better understanding of the soil C cycle and developing scientific vegetation restoration measures.\n</p>","author":"Lingbo Dong, \nJiajia Li, \nDefu Wang, \nSu Wang, \nWeifang Hu, \nJianzhao Wu, \nYang Liao, \nZhijing Yu, \nXi Wang, \nJinyuan Yu, \nJiwei Li, \nZhouping Shangguan, \nLei Deng","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"3bc73536b989393cb68fae97e73915b1209e9d2385ac3676280f71f87c21cb62","category":"Environment"}