{"title":"The roles of seagrass litter decomposition in determining blue carbon sink capacity","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12563?af=R","date":1716913718000,"content":"<h2>Abstract</h2>\n<p>Seagrass litter is a crucial autochthonous source of sediment organic carbon (C<sub>org</sub>) that contributes to C<sub>org</sub> storage in coastal ecosystems. However, our understanding of seagrass litter decomposition effects on sediment C<sub>org</sub> sequestration and the factors influencing the capacity for autochthonous carbon sequestration remains limited. We investigated <i>Zostera marina</i> litter decomposition dynamics in eelgrass meadows along the Korean coast by monitoring changes in the remaining litter mass and autochthonous C<sub>org</sub> during the decomposition process. We used a double-component exponential decay models to characterize the decomposition dynamics and estimate the autochthonous C<sub>org</sub> remaining. We also identified potential factors affecting litter decay and C<sub>org</sub> accumulation in sediments by examining site-specific physicochemical properties. Our findings revealed that double-component models effectively characterized litter decomposition dynamics and indicated greater preservation of litter-derived slowly degrading C<sub>org</sub> in sediments. The reduced decomposition of litter materials owing to low oxygen availability in the muddy sediments led to greater retention of litter mass and litter-derived C<sub>org</sub> in sediments. The anoxic conditions of below-ground litterbags, compared with above-ground litterbags, could be alleviated by the oxygen transport through fresh <i>Z. marina</i> roots, thereby potentially stimulating the microbial decomposition of <i>Z. marina</i> below-ground litter materials at these sites. Our findings highlight the importance of understanding litter decomposition dynamics to accurately assess the carbon sink capacity of seagrass meadows, and demonstrate that physicochemical properties can influence seagrass litter decomposition.</p>","author":"Zhaxi Suonan, \nSeung Hyeon Kim, \nShidong Yue, \nEunhye Jo, \nFei Zhang, \nHyegwang Kim, \nLe‐Zheng Qin, \nJaeho Cha, \nYi Zhou, \nKun‐Seop Lee","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"3bce7698300f8f7c6a88b3e5b04b01202cbb141b7adff1973891d29ddc0971ad","category":"Environment"}