{"title":"Association between body mass index and atopic dermatitis among adolescents: Findings from a national cross-sectional study in Korea","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307140","date":1721397600000,"content":"<p>by Jae Hyeok Lim, Yun Seo Jang, Dan Bi Kim, Suk-Yong Jang, Eun-Cheol Park</p>\r\nBackground <p>The association between atopic dermatitis and childhood overweight and obesity has been studied extensively, but the results are inconclusive; most studies have focused on body mass index as a measure of obesity, with few investigating the relationship with underweight. Therefore, this study aimed to investigate the association between body mass index levels and atopic dermatitis in Korean adolescents.</p> Methods <p>3-year (2019–2021) of Korea Youth Risk Behavior Web-based Survey were used. Body mass index was used to measure obesity and a recent diagnosis within the past year was used as the criterion for atopic dermatitis. Multiple logistic regression analyses were performed to explore the associations. The odds ratios (ORs) and 95% confidence intervals (CIs) were calculated.</p> Results <p>A total of 144,183 adolescents aged 12–18 years were included in this study (74,704 males and 69,479 females). Over the past year, 5.4% of males and 7.3% of females were diagnosed with atopic dermatitis in the study population. Adolescents with normal weight (males [OR: 1.19, CI: 1.02–1.38]; females [OR: 1.26, CI: 1.10–1.43]) and overweight (males [OR: 1.37, CI: 1.16–1.61]; females [OR: 1.37, CI: 1.19–1.58]) were more likely to develop atopic dermatitis than underweight.</p> Conclusion <p>Increased degree of obesity may contribute to the development of atopic dermatitis. The normal-weight and obese adolescents had higher likelihood of developing atopic dermatitis compared with the underweight adolescents.</p>","author":"Jae Hyeok Lim","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3bd12c55c11e30c675cc3ba952d783f6fa64aa0fc6b48c53c993393023563117","category":"Interdisciplinary"}