{"title":"First Assessment of Prebiotics, Probiotics, and Synbiotics Affecting Survival, Growth, and Gene Expression of European Eel (Anguilla anguilla) Larvae","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/1260967?af=R","date":1677225600000,"content":"<p>European eel, <i>Anguilla anguilla</i>, larval culture faces a bottleneck during the transition to exogenous feeding. To stimulate gut-priming, in the present study, prebiotics (AgriMOS, mannan-oligosaccharides, and <i>β</i>-(1,3 and 1,6)-poly-D-glucose), probiotics (Bactocell, <i>Pediococcus acidilactici</i>), and synbiotics (AgriMOS + Bactocell) were administered to European eel larvae during the endogenous prefeeding stage. Eel larvae were reared in 2 L incubators with an initial stocking density of ∼200 larvae/L. Each treatment (pre-, pro-, synbiotics, and control), represented by 3 replicated incubators, was connected to a separate recirculating aquaculture system. The gut-priming agents were introduced directly into the rearing water. Results revealed increased mortality when larvae were introduced to synbiotics and impaired growth in connection to probiotics and synbiotics. Larvae receiving prebiotics showed similar survival and growth to larvae reared without gut-priming agents. The immune gene expression revealed a lag phase between maternally inherited protection (<i>c3, igm, and il10</i>) and the gradual buildup of the larvae’s own immune system (<i>il1β, irf7)</i>. The lack of treatment-related immune (<i>c3, igm, il10, il1β</i>, and <i>irf7</i>) and stress/repair (<i>hsp70, hsp90</i>) responses revealed an immature immuno-readiness. Digestion (<i>try, ctra, ctrb, tgl,</i> and <i>amyl</i>), food intake (<i>cck</i>), and appetite (<i>ghrl</i>)-related genes were expressed at basal levels already on 4 days post-hatch, which combined with phenotypic plasticity of the appetite-regulating ghrelin (<i>ghrl</i>), indicated a prospective adaptive capability towards earlier maturation of the larval digestive capacity. Overall, we contemplate that the application of gut-priming agents in water has merit; however, as no beneficial effect was observed, we conclude that the regimen applied is not recommendable in the present form and needs to be customized for future eel larval culture. As such, water management strategies and rearing options need to be further explored to establish prefeeding and feeding regimens, targeting optimized culture conditions, and the production of healthy eel offspring.</p>","author":"Sebastian N. Politis, \nElisa Benini, \nJoanna J. Miest, \nSofia Engrola, \nSune R. Sørensen, \nElisavet Syropoulou, \nIan A. E. Butts, \nJonna Tomkiewicz, \nHamed Ghafarifarsani","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"3bd1fd1aa964898d5b69b537f6c6d77dc92515a32020782cc79f24552c2d3cf1","category":"Environment"}