{"title":"Reddit Users Revolt","link":"https://www.reddit.com/r/iphone/comments/145yx97/update_in_less_than_24_hours_riphone_will_be/","date":1686417550000,"content":"\n<p>The moderators of the popular r/iPhone are taking it private:</p>\n\n<blockquote>\n  <p>Q: <em>What does making r/iPhone private mean, in this case?</em></p>\n\n<p>A: Taking r/iPhone private means that no-one, except moderators\n   and approved submitters, can see the subreddit’s front page.\n   When attempting to access the subreddit, you will be met with a\n   blank screen stating “r/iPhone has been set to private by its\n   subreddit moderators.”</p>\n\n<p>Q: <em>What does indefinite mean in this case?</em></p>\n\n<p>A: Originally, the protest was planned to be 48 hours. However,\n   after a shambolic AMA held by Reddit’s CEO, it has become clear\n   to us that Reddit doesn’t intend to act in good faith. When the\n   CEO is willing to lie and spread libellous claims about another\n   third-party developer, and then try double down by vilifying\n   them, again, in an AMA, despite being proven as a liar by the\n   developer through audio recordings, that’s when we knew what we\n   were up against. Therefore, the subreddit will be privatised\n   until such time as a reasonable resolution is proposed.</p>\n</blockquote>\n\n<p><a href=\"https://www.reddit.com/r/videos/comments/145vns0/the_future_of_rvideos/\">The moderators at r/Videos are doing the same</a>:</p>\n\n<blockquote>\n  <p>Q: <em>Won’t Reddit just remove you as moderators and reopen the\n   subreddit?</em></p>\n\n<p>A: This is a distinct possibility, Reddit has made it clear that\n   the “health” of their site is more important to them. We as a\n   team are prepared for this, none of us want to continue to\n   volunteer for a company that disrespects the people who helped\n   build it into the front page of the internet.</p>\n\n<p>Q: <em>An indefinite lockdown? I thought this was only supposed to be\n   for 48 hours?</em></p>\n\n<p>A: Originally it was our intention to spread awareness of these\n   issues, but over the past week it has become clear that Reddit\n   doesn’t intend to act in good faith, and our role in the\n   protest became clear. The owners of Reddit have taken their\n   users, community developers, and their moderator teams for\n   granted and used them to build up a multimillion dollar company\n   which is now focused not on the community, but on how many\n   commas they can get out of Silicon Valley investors.</p>\n</blockquote>\n\n<p>For posterity: screen captures of the <a href=\"https://daringfireball.net/misc/2023/06/r-iphone-boycott.pdf\">r/iPhone</a> and <a href=\"https://daringfireball.net/misc/2023/06/r-videos-boycott.pdf\">r/Videos</a> threads.</p>\n\n<p>**Update: <a href=\"https://reddark.untone.uk/\">Live-updated list of subreddits going dark or read-only on Monday</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/10/reddit-users-revolt\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"3bd5533a36aba75e780c92f8b88516101749ade2ae298933e8af1f49d942c6aa","category":"Tech"}