{"title":"Predation risk elicits a negative relationship between boldness and growth in Helisoma snails","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae063/7730583?rss=1","date":1723161600000,"content":"<span><div>Abstract</div>The relationship between risk-prone behavior and growth is central to tradeoff models that explain the existence and maintenance of among-individual variation in behavior (i.e. animal personality). These models posit positive relationships between among-individual variation in risk-prone behaviors and growth, yet how the strength and direction of such relationships depend on ecological conditions is unclear. We tested how different levels of predation risk from crayfish (<span>Faxonius limosus</span>) mediate the association between among-individual variation in snail (<span>Helisoma trivolvis</span>) boldness (emergence time) and growth in shell size. We found that crayfish predation risk reduced snail growth but that the effect of snail boldness on individual growth was context-dependent—snail boldness was unrelated to growth in the absence of risk and under high risk, but shy snails grew faster than bold snails under low predation risk. Other traits (snail size, body condition, and intrinsic growth rate measured under ad libitum food conditions) failed to explain snail growth variation under any risk level. Though opposite to the prediction of tradeoff models, enhanced growth of shy snails could function as a predator defense mechanism that protects their prospects for future reproduction consistent with the underlying premise of tradeoff models. Thus, our results highlight the importance of accounting for ecological conditions in understanding behavior–life history associations.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"3bd9b54b0e7ebbe5157cab37f6e1cb1cf88c9f4435df91b8d6c8dff245df1e7a","category":"Environment"}