{"title":"Thin lines between native and invasive aquatic plants are common, posing challenges for response efforts","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14752?af=R","date":1722843542000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d88677c9-a477-4484-82b7-4ae552c9545c/jpe14752-toc-0001-m.png\" alt=\"Thin lines between native and invasive aquatic plants are common, posing challenges for response efforts\" />\n<p>Thin lines separating native from invasive aquatic plants pose challenges for response efforts. For resource managers, the prevalence of cryptic invasions requires dedicated, robust approaches to surveillance. For outreach, finer distinctions between native and invasive necessitate nuanced approaches to communication and education. And when control is needed, it should be implemented cautiously to minimize nontarget impacts to close native relatives, but thoroughly enough to prevent native relatives being displaced by competition and/or introgression.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLines separating native and invasive plant species can be thin due to close relatedness, obscured by cryptic invasions, or breached by hybridization. Past work suggests these phenomena are especially prevalent in aquatic systems. This could arise from strong filters imposed by aquatic environments magnifying the importance of ‘preadaptation’—non-native species succeeding where closely related native species occur due to shared traits. If so, there should be stronger signals of preadaptation in aquatic than terrestrial plant invasions, with implications for management.\n\nI tested for stronger influence of preadaptation in aquatic than terrestrial invasions by comparing relatedness of invasive and native species in aquatic versus terrestrial flora of the Midwestern USA using herbarium records and taxonomic and phylogenetic analyses. I predicted that aquatic species would constitute an evolutionarily distinct subset of plants; aquatic invaders would be more closely related, taxonomically and phylogenetically, to native aquatic plants than terrestrial invaders are to their native counterparts; and aquatic invaders from the Midwest's primary donor region (the Palearctic) would be more closely related to Midwestern species than are Palearctic aquatic plants that are not invasive in the Midwest.\n\nFindings supported the evolutionary legacy of adaptation to aquatic environments being reflected in thin lines separating invasive and native aquatic plants. Aquatic species constituted an evolutionarily distinct subset of plants, and invasive aquatic plants were more closely related to native aquatic plants (taxonomically and phylogenetically) than terrestrial invaders were to terrestrial native species.\n\nAdditionally, aquatic plants of the Palearctic that are invasive in the Midwest were more closely related to Midwestern natives (phylogenetically, but not taxonomically) than were their non-invasive counterparts, reinforcing the role of preadaptation.\n\n<i>Synthesis and applications</i>: Thin lines separating native from invasive aquatic plants pose challenges for response efforts. For resource managers, the prevalence of cryptic invasions requires dedicated, robust approaches to surveillance. For outreach, finer distinctions between native and invasive necessitate nuanced approaches to communication and education. And when control is needed, it should be implemented cautiously to minimize nontarget impacts to close native relatives, but thoroughly enough to prevent native relatives being displaced by competition and/or introgression.\n</p>","author":"Daniel J. Larkin","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"3bdae6bdd3424640ff06e309fea2b9ef7d5aa34d6f9184f9ba22e7e2c9c1e512","category":"Environment"}