{"title":"Knowledge and attitude towards mpox: Systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308478","date":1723212000000,"content":"<p>by Darwin A. León-Figueroa, Joshuan J. Barboza, Abdelmonem Siddiq, Ranjit Sah, Mario J. Valladares-Garrido, Alfonso J. Rodriguez-Morales</p>\r\nBackground <p>The increase in mpox incidence underscores the crucial need to understand and effectively address prevention, early detection, and agile response to this disease. Therefore, the present study aims to determine the knowledge and attitude towards mpox.</p> Methods <p>A systematic review and comprehensive literature meta-analysis were conducted using prominent databases such as PubMed, Scopus, Web of Science, Embase, and ScienceDirect, with an updated search until June 25, 2023. The quality of the included observational studies was assessed using the Joanna Briggs Institute’s Statistical Meta-Analysis Review Instrument. The collected data were recorded in a Microsoft Excel spreadsheet, and analyses were conducted using R software version 4.2.3. Additionally, Cochran’s Q statistics were applied to assess the heterogeneity of the included studies.</p> Results <p>A total of 299 articles were retrieved from 5 databases. This study included 27 cross-sectional articles with a total sample of 22,327 participants, of which 57.13% were women. The studies were conducted in 15 countries through an online survey. All studies had a moderate level of quality. The combined prevalence of a good level of knowledge about mpox was 33% (95% CI: 22%-45%; 22,327 participants; 27 studies; I<sup>2</sup> = 100%), and the combined prevalence of a positive attitude towards mpox was 40% (95% CI: 19%-62%; 2,979 participants; 6 studies; I<sup>2</sup> = 99%). Additionally, as a secondary outcome, the combined prevalence of the intention to vaccinate against mpox was 58% (95% CI: 37%-78%; 2,932 participants; 7 studies; I<sup>2</sup> = 99%).</p> Conclusion <p>Good knowledge and a positive attitude towards mpox were found to be low. The findings of this study highlight the need to identify gaps and focus on implementing educational programs on mpox.</p> Terms used <p>Joanna Briggs Institute Meta-Analysis of Statistics Assessment and Review Instrument (JBI-MAStARI), Prospective International Registry of Systematic Reviews (PROSPERO), and Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA)</p>","author":"Darwin A. León-Figueroa","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3be0d8c9b8e857aecefb450eff05132f3116321d4f97a822dc3b45f91193378d","category":"Interdisciplinary"}