{"title":"The armor of armored fish started out as part of the nervous system","link":"https://arstechnica.com/?p=1954753","date":1689704780000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-522709030-800x341.jpg\" alt=\"Image of a long fish with three rows of spikes down its side.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-522709030-scaled.jpg\">Enlarge</a> <span>/</span> The cells that go on to form the armor on the flanks of the sturgeon start out as part of the nervous system. (credit: <a href=\"https://www.gettyimages.com/detail/photo/day-old-atlantic-sturgeon-royalty-free-image/522709030?phrase=sturgeon&amp;adppopup=true\">Jay Fleming</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Our skeleton is kind of strange. Most of it forms from the same tissue that makes things like our muscle and connective tissue. The exception is a big chunk of our face, like the jaws and nasal passages. Those come from a tissue that migrates out of the developing nervous system.</p>\n<p>Having two different sources of the same tissue is unusual; I can't personally think of a second example of that happening in vertebrates. So it raises questions about why the system evolved in the first place. Now, researchers have provided a hint as to how this might have come about. It turns out that in early branches of the fish family tree, like the sturgeon, the neural crest forms the bony armor that covers them, suggesting an ancient role in bone formation that goes back to the <a href=\"https://en.wikipedia.org/wiki/Dunkleosteus\">armored fish of the Devonian</a>.</p>\n<h2>Doing it all</h2>\n<p>The tissue at the center of the new work is called the neural crest. As its name implies, it starts off at the very top of the developing spinal cord and hindbrain. Shortly after the developing nervous system closes off into a tube, the neural crest cells leave it behind. Some of them retain their neural identity and go on to form most of the body's sensory nerves, as well as the nerves that manage the digestive system.</p></div><p><a href=\"https://arstechnica.com/?p=1954753#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1954753&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3be4a5e1287dddd15c6c8491e5ae62e196d95376568eeb0476e7b33af337d94f","category":"Tech"}