{"title":"Quality of Life and Symptom Burden in Non-Small Cell Lung Cancer Patients Receiving Second-Line Chemotherapy Compared with Immunotherapy","link":"https://www.preprints.org/manuscript/202409.1856/v1","date":1727256993000,"content":"Background and Objectives: The burdened symptomatology accompanying advanced non-small cell lung cancer (NSCLC) is associated with poor prognosis and lower quality of life (QoL). Although both chemotherapy and immunotherapy increase survival, they are still associated with reduced functionality due to their toxicity. This study aimed to estimate the QoL and symptom burden of NSCLC patients receiving second-line chemotherapy compared to patients receiving second-line immunotherapy. Materials and Methods: This comparative, prospective study, conducted from January 2020 to December 2021, included 111 NSCLC patients who were divided into two groups: 61 patients receiving second-line chemotherapy and 50 patients receiving second-line immunotherapy. Patients QoL and symptom burden were estimated using the European Organisation for Research and Treatment of Cancer Quality of Life Questionnaire Core 30 (EORTC QLQ C-30) (value range 0 - 100) from treatment cycle 1 to 6. Results: The QoL (mean score &gt; 50) and functionality dimensions (mean score &gt; 50) were moderate to good in both treatment groups, while the symptoms burden did not appear to be a serious problem (mean score &lt; 50). From cycle 3 to cycle 5, the QoL was significantly better in the immunotherapy group. From cycle 3, role and social functioning scores were higher in the immunotherapy group, while emotional and cognitive functioning were higher from cycle 2 (p &lt; 0.05). The chemotherapy group experienced higher levels of nausea/vomiting, constipation and financial difficulties in all cycles (p &lt; 0.05). Fatigue and appetite loss were significantly greater from cycle 2 and insomnia was significantly greater from cycle 3. On the contrary, the immunotherapy group experienced higher levels of diarrhea in cycles 5 and 6 (p &lt; 0.05). Conclusions: Although both therapy groups did not report significantly impaired QoL and severe symptoms, it seems that QoL improved in the immunotherapy group, which reported less symptom burden compared to the chemotherapy group.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3be6908f7991a843df318f35bb837b0cad3deea385decd0b429087ac200ccfda","category":"Interdisciplinary"}