{"title":"Phytoplankton primary productivity: A dual‐incubation approach for direct comparison of photosystem II photosynthetic flux (JVPII) and 14C‐fixation experiments","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10635?af=R","date":1720788212000,"content":"<h2>Abstract</h2>\n<p>Singe-turnover active chlorophyll <i>a</i> fluorometry (STAF) can be used to assess phytoplankton photosynthetic rates in terms of the photosystem II photochemical flux (JV<sub>PII</sub>, <i>μ</i>mol e<sup>−</sup> m<sup>−3</sup> s<sup>−1</sup>) instantaneously, autonomously, and at high resolution. While JV<sub>PII</sub> provides an upper limit to rates of phytoplankton primary productivity in units of carbon fixation, the conversion between these two rates is variable, limiting our ability to utilize high-resolution JV<sub>PII</sub> data to monitor phytoplankton primary productivity. Simultaneous measurements of JV<sub>PII</sub> and <sup>14</sup>C-fixation help in understanding the factors controlling the variable ratio between the two rates. However, to date, methodological inconsistencies, including differences in incubation lengths and light quality, have greatly inhibited practical assessment of such electron to carbon ratios (Φ<sub>e,C</sub>, mol e<sup>−</sup> mol C<sup>−1</sup>). We here present data from a range of dual-incubation experiments in northeast Atlantic waters during which JV<sub>PII</sub> and <sup>14</sup>C-fixation were measured simultaneously on the same sample. Time-course experiments show how Φ<sub>e,C</sub> increases with incubation length, likely reflecting the transition from gross to net <sup>14</sup>C-fixation. Dual-incubation experiments conducted under different light levels show a tendency for increased Φ<sub>e,C</sub> under (super-)saturating light. Finally, data from a diurnal experiment demonstrate how Φ<sub>e,C</sub> increases over the course of a day, due to downregulation of <sup>14</sup>C-fixation. We provide a detailed description of our methodological approach, including a critical discussion of improvements to the calculation of JV<sub>PII</sub> implemented in the LabSTAF instrument used for active fluorescence measurements and the limitations of the well-established <sup>14</sup>C-fixation approach.</p>","author":"Nina Schuback, \nKevin Oxborough, \nMary Burkitt‐Gray, \nPatricia López‐García, \nMatthew D. Patey, \nEmily Hammermeister, \nAlan Wright, \nC. Mark Moore","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"3be65388545fee894a764bbf9d85ea48427ef3447f6dd77de8c5bfd57d819a62","category":"Environment"}