{"title":"Identification of water transitions using a combination of moisture sorption characteristics and dielectric properties of different parts of jasmine rice (Oryza sativa)","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13669?af=R","date":1720085754000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>In this work, water transition points (first transition: monolayer–multilayer water; and second transition: multilayer–free and solvent water) of different parts of jasmine rice including white rice, brown rice and bran were identified through the integration of sorption isotherm and dielectric properties data. Desorption isotherm data were fitted to four established models to select the optimal model for describing the sorption behaviors. Then, dielectric properties such as dielectric constant (<i>ε</i>′) and dielectric loss factor (<i>ε</i>″) were measured across various moisture content levels within the frequency range of 200–20 000 MHz.</p>\n<h2>RESULTS</h2>\n<p>A type III isotherm was observed for all samples and the Peleg model was the best fit with the experimental data. Monolayer moisture content of the samples, estimated using the GAB model, ranged from 3.25% to 4.17% dry basis. For dielectric properties, frequency and moisture dependencies were evident for all sample types. Moreover, the sorption isotherm models effectively described the relationship between water activity (<i>a</i>\n<sub>w</sub>) and dielectric properties as reflected by their goodness of fit, and their strong correlation through principal component analysis and Pearson's correlation results.</p>\n<h2>CONCLUSION</h2>\n<p>The first water transition occurs at <i>a</i>\n<sub>w</sub> values of 0.11, 0.12, and 0.22, while the second transition appears at <i>a</i>\n<sub>w</sub> values of 0.9, 0.9 and 0.75–0.85 for white rice, brown rice and bran, respectively. This knowledge will be useful for food processors, providing insights into the optimization of food processing and storage conditions to extend food products' shelf life. © 2024 Society of Chemical Industry.</p>","author":"Pitiwat Changbandit, \nSamran Santalunai, \nChanchai Thongsopa, \nTraiphop Phahom","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"3be833d487be7bd9e18eb69783cedbf8e914bc845089dcc313e6c83a56f5e690","category":"Environment"}