{"title":"Granularity of model input data impacts estimates of carbon storage in soils","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000363","date":1729778400000,"content":"<p>by Serge Wiltshire, Patrick J. Clemins, Brian Beckage</p>\r\n\r\nThe exchange of carbon between the soil and the atmosphere is an important factor in climate change. Soil organic carbon (SOC) storage is sensitive to land management, soil properties, and climatic conditions, and these data serve as key inputs to computer models projecting SOC change. Farmland has been identified as a sink for atmospheric carbon, and we have previously estimated the potential for SOC sequestration in agricultural soils in Vermont, USA using the Rothamsted Carbon Model. However, fine spatial-scale (high granularity) input data are not always available, which can limit the skill of SOC projections. For example, climate projections are often only available at scales of 10s to 100s of km<sup>2</sup>. To overcome this, we use a climate projection dataset downscaled to &lt;1 km<sup>2</sup> (∼18,000 cells). We compare SOC from runs forced by high granularity input data to runs forced by aggregated data averaged over the 11,690 km<sup>2</sup> study region. We spin up and run the model individually for each cell in the fine-scale runs and for the region in the aggregated runs factorially over three agricultural land uses and four Global Climate Models. We find that the aggregated runs systematically over-predict SOC compared to the fine-scale runs, with a mean difference of 7.2 tonnes C per hectare and a mean absolute error of 9.1% at the end of the 77 year simulation (2022–2099). We find large spatial variance in SOC across cells, reflecting variability in climate as well as other environmental drivers. We conclude that future research should focus on developing more high-granularity input datasets for SOC modeling, and we also reflect on the significant computational resources required to conduct fine-scale simulations.","author":"Serge Wiltshire","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"3beb958057f40d941554789a346e9dddb3cdb303b7ef6af4b2ae9ec4690e1a05","category":"Environment"}