{"title":"A Comparative Assessment of Drinking Water Preferences among University Students in Qatar: A Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202404.1861/v1","date":1714379125000,"content":"In recent years there has been a clear increase in bottled water consumption, globally which translates to significant health and environmental concerns. This cross-sectional study aims to understand the attitude and preferences of university students in Qatar towards use of bottled and tap water for drinking purposes using an online survey questionnaire. The number of students who responded to the online survey was 14% of the entire student population within the university (n = 688). Overall, majority of the students reported plastic bottled water as the main source of drinking water they preferred to use on campus (n=468; 68.02%), with a higher proportion of females (72.08%) preferring the use of plastic bottled water. Out of the 468 students who preferred plastic bottled water, safety was the most important factor (43.80%) followed by convenience (16.88%) and taste (15.60%). Cost (15.17%), personal/family habits (5.13%), Environmental concerns (2.14%) and minerals (1.28%) were found to be the least important factors. Among the 45 students who preferred tap water over plastic bottled water, cost (46.67%) was the dominant factor followed by convenience (20.00%) and environmental concerns and safety (13.33% each), taste (4.44%), and personal/family habits (2.22%). This study recommends campaigns to focus on attitude and behavior change and not solely emphasize knowledge; 71.7% believed that plastic water bottles are more harmful to the environment, yet the greater majority still resorted to this source. There is an immediate need to further educate students through environmental and health literacy programs on water consumption and quality. Enabling the population to understand the positive and negative aspects of their choices, may be an effective remedy to ensuring a healthy population and healthy environment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3beff40b994e3e5e304dad526958a4c4430b2a6d1a924a628eb9abbfffb119d3","category":"Interdisciplinary"}