{"title":"Impact of Soil Moisture Dynamics and Precipitation Pattern on UK Urban Pluvial Flood Hazards Under Climate Change","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004073?af=R","date":1714374000000,"content":"<h2>Abstract</h2>\n<p>The diversity of flood-generating mechanisms superimposed on catchment physiographic features with non-stationary meteorological drivers makes future flood hazard assessment a grand challenge. To date, many studies have examined patterns in rainfall and streamflow, but far fewer have investigated trends in the other drivers of flooding. The complex transfer function between precipitation and flooding makes it potentially misleading to simply look at the change in rainfall to express the hazard. Furthermore, there are very few studies that have directly used output from km-scale climate models in flood modeling. Coarse resolution climate data sets may not credibly resolve local climate and weather extremes. Changes in rainfall distribution and antecedent moisture over extended time periods due to climate change have so far been ignored when assessing urban pluvial flood risk. In this paper, an urban flood hazard assessment framework using the latest 2.2 km resolution UK Climate Projections Local is proposed. Global warming induced changes in pluvial flood risks under RCP8.5 are projected, focusing on the impact of changing precipitation patterns and soil moisture dynamics on flood generation. Results indicate a strong increase in the frequency of occurrence of extreme floods, and the resultant future (2060–2080) annual flood volume is expected to increase up to 52.6% relative to 1980–2000 over a major UK urban region, and these patterns are likely to hold more generally elsewhere in the UK. Shifts to a later occurrence of extreme flooding is identified under global warming. Previous studies that have neglected soil moisture dynamics are unlikely to give accurate flood estimates.</p>","author":"Youtong Rong, \nPaul Bates, \nJeffrey Neal, \nLeanne Archer, \nSimbi Hatchard, \nElizabeth Kendon","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"3bf40d84ab77b2ae5b1ed4d728946889a3ac036a8b7748be4f1cfebe2616afbf","category":"Environment"}