{"title":"Google says it can’t fix Pixel Watches, please just buy a new one","link":"https://arstechnica.com/?p=1968511","date":1694796471000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/10/18-800x546.jpg\" alt=\"The Pixel Watch. It's a round little pebble. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/10/18.jpg\">Enlarge</a> <span>/</span> The Pixel Watch. It's a round little pebble.  (credit: Ron Amadeo)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google makes a big deal out of its partnership with iFixit and the availability of replacement parts for its products, but one Google product that doesn't seem fixable is the Pixel Watch. After spotting <a href=\"https://www.reddit.com/r/PixelWatch/comments/10q3i5j/any_repairs_possible/\">some posts</a> from <a href=\"https://support.google.com/googlepixelwatch/thread/221719013/pixel-watch-cracked-screen?hl=en\">Pixel Watch users</a> seeking a remedy after cracking the glass and coming up with no clear answers, The Verge got Google to confirm that, even 11 months after launch, there is no repair plan right now. Google can't fix your watch. There are no parts.</p>\n<p>A Google spokesperson told The Verge \"At this moment, we don’t have any repair option for the Google Pixel Watch. If your watch is damaged, you can contact the Google Pixel Watch Customer Support Team to check your replacement options.\"</p>\n<p>Damage like a cracked display isn't covered under any kind of warranty, so buying a new device is the only official option. And with no parts stream to power the unofficial repair industry, the only way to actually fix a Pixel Watch would be to destroy another one. That's a repair model that can work for very popular devices where there are many devices to salvage, but with Pixel Watches being a rarely sold item, you'll be hard-pressed to find any spare parts. That's a shame because iFixit's <a href=\"https://arstechnica.com/gadgets/2022/10/pixel-watch-teardown-shows-off-ugly-insides-gives-strong-first-gen-vibes/\">repair analysis</a> found a device that wasn't all that hard to take apart, and it wouldn't be difficult to replace the screen if you could get one.</p></div><p><a href=\"https://arstechnica.com/?p=1968511#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1968511&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3bfb66a67eacbbbd8d4dd716abdd8c9de79987a5c5befc0ae576aab114973bf4","category":"Tech"}