{"title":"Production and Characterization of biochar produced from Slow Pyrolysis of Teff-Husk","link":"https://www.preprints.org/manuscript/202403.0673/v1","date":1710227281000,"content":"In the drive towards environmental restoration and sustainable energy solutions, effective utilization and management of agricultural crop residues are vital to mitigate greenhouse gas (GHG) emissions and waste accumulation. Converting biogenic wastes into biofuels and bioproducts has the potential to tackle the energy crisis and contribute to environmental remediation. In this investigation, teff husk, primarily generated in Ethiopia during teff production within the agro-industrial sector, is used as the feedstock for the slow pyrolysis process. In Ethiopia, it is estimated that over 1.75 million tons of teff husk are generated annually, with a significant portion being incinerated in the fields, resulting in substantial environmental pollution. This study focuses on assessing teff husk as a potential material for slow pyrolysis, a crucial stage in biochar production, to tap into its biochar-producing potential. To determine the composition of the biomass, the teff-husk was initially analyzed by thermogravimetry. The significant presence of fixed carbon indicates that teff husk is a viable candidate for pyrolytic conversion into biochar particles. The process of slow pyrolysis took place at three varied temperatures—specifically, at 400, 450, and 500 °C. Process parameters of slow pyrolysis such as reaction time, temperature, and heating rate were enhanced to obtain maximum biochar yields. The highest biochar yield of 43.4 wt% was recorded at optimized reaction time, temperature, and heating rate of 120 min, 400 °C, and 4.2 °C/min, respectively. Furthermore, biochar's physicochemical, SEM-EDX, FTIR, and TGA characterization were performed. The thermal stability and carbon content of biochar were found to rise at higher temperatures. Unlike fuel recovery, the results suggest that teff-husk can be used as a feedstock for biochar production.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3bfde323bae5fea07f5ad86aeca2bd1eff7dc1210af7132762d420eb72f8fbb1","category":"Interdisciplinary"}