{"title":"iOS 15: How to set up and use Focus on your iPhone","link":"https://www.macworld.com/article/350446/how-to-ios-15-set-up-customize-focus-modes-iphone.html","date":1625766683000,"content":"\n<div>\n<section><div></div></section><p>Do Not Disturb is one of the best and most useful features of the iPhone. When it’s enabled, notifications are delivered silently, calls and texts don’t make your phone ring, and so on. You can turn it on temporarily through Control Center or set a scheduled DND time (like when you sleep at night).</p>\n\n\n\n<p>But what if DND was more flexible, allowing you to choose which apps are silenced and which are not? What if you could have multiple DND states for different times and activities? With iOS 15, iPadOS 15, macOS Monterey, and watchOS 8, that’s exactly what Apple is doing with the new Focus feature. It takes Do Not Disturb to the next level, and even syncs between all your Apple devices.</p>\n\n\n\n<p>Here’s everything you need to know to get started using Focus, so you can get more done with fewer attention-seeking interruptions from your devices.</p>\n\n\n\n<h2>Setting up Focus</h2>\n\n\n\n<p>Before you start using Focus modes, you have to set them up. That means—you guessed it—a trip to the Settings app.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-focus-setup.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Setting up a Focus is straightforward, though a little time consuming.</figcaption></figure><p>IDG</p></div>\n\n\n\n<ol><li>Open Settings.</li><li>Tap <em>Focus</em>. You may see existing Focus modes like Do Not Disturb or Sleep.</li><li>Tap the plus sign in the upper right to add a new Focus mode, or tap <em>Set U</em>p under one of the listed modes like Work or Personal.</li><li>If you’re creating a new Focus, you’ll get a screen of suggestions (Fitness, Gaming, etc.) or the ability to set a custom Focus with its own name and icon.</li><li>The next screen will ask you which of your contacts you want to allow notifications from. Choose as many or as few as you want.</li><li>Then you’ll be asked which apps you want to receive notifications from. All the others will still deliver their notifications, but they’ll go straight to the notification shade without any sounds or banners.</li><li>Finally, you’ll be asked whether you wish to allow “Time-sensitive notifications” or not. Some apps have special notifications that should be acted on right away, and this will let those through even if the app is silenced.</li></ol><p>And that’s all there is to it. You’ll see a summary of your choices and can change what you want. Set up more or fewer Focus modes as you see fit, or tap <em>Delete Focus</em> on the summary screen if you think you no longer need it.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-focus-setup2.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The key to setting up each Focus is choosing which people and apps from which you want to accept notifcations.</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Customizing Home and Lock screens</h2>\n\n\n\n<p>You can do more than just select which people and apps you want to silence in a Focus mode—you can set up entire custom Home and Lock screens. These aren’t <em>completely</em> new, with custom icon placement and such, but rather a set of Home and Lock screen options.</p>\n\n\n\n<ol><li>In Settings &gt; <em>Focus</em>, tap on the Focus mode for which you want to adjust the Home and Lock screen settings.</li><li>Tap <em>Home Screen</em> to be presented with two options: <em>Hide Notification Badges</em> and <em>Custom Pages</em>.</li><li>Tap <em>Lock Screen</em> to choose whether you want to dim the lock screen and to hide or show notifications on it.</li></ol><p>Notification Badges are the little red numbers on Home screen icons. Hiding those could help reduce the desire to check in on an app when you don’t really need to. </p>\n\n\n\n<p>In iOS 14, we got the ability to <a href=\"https://www.macworld.com/article/234405/how-to-use-the-app-library-in-ios-14.html\">hide entire Home Screen pages</a> (since all your app are always in the App Library). Custom Pages gives you the ability to show only the pages you wish when that Focus mode is active, hiding all the others.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-focus-homescreen.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>You can select individual home screens to show in each Focus mode, and choose to dim the lock screen.</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Turning on Focus manually</h2>\n\n\n\n<p>There are several ways to enable your Focus modes, the most basic of which is just to turn it on or off manually.</p>\n\n\n\n<ol><li>Open Control Center (swipe down from the upper-right edge of your iPhone, or up from the bottom of an iPhone SE or any model with a home button).</li><li>Tap Focus. There’s a crescent moon icon on the button—if you tap that directly, you’ll enable Do Not Disturb.</li><li>Select the Focus mode you wish to enable or tap the “…” on any mode to enable it for one hour, until the evening/morning, or until you leave that location.</li></ol><p>The time-limited and location based focus options are especially handy. You could have a focus mode made for the gym, and set it to stay enabled until you leave that location, for example.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-focus-manual.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>You can enable focus modes manually from Control Center.</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Turning on Focus automatically</h2>\n\n\n\n<p>Enabling Focus from Control Center is fine, but the whole point here is to reduce distractions without you having to <em>remember</em> to do it. Fortunately, Apple provides two ways to turn on your Focus modes automatically.</p>\n\n\n\n<p>Smart activation is the fully automatic option. It uses queues like time of day, app usage, and location to enable Focus modes when it thinks you need them. For example, if you have a Work location set in your own contact card, the Work Focus might enable when you’re at that location during normal work hours. All this intelligent processing happens on your device, so it may take some time for your iPhone to correctly learn your habits. In other words, it should get more accurate over time.</p>\n\n\n\n<ol><li>Open Settings.</li><li>Select the Focus mode you wish to automate.</li><li>Tap <em>Smart Activation</em> and flip the toggle on.</li></ol><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-focus-smart.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Setting your Focus modes to activate automatically is a good idea.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>You can also set a specific automation to define exactly when you want the Focus mode to turn on. Just above the Smart Activation option is a <em>+ Add</em> button. Tap that to add a time range (including days of the week), location, or pick an app. You can set your Fitness Focus mode to enable while you’re at the gym, for example. Or a Gaming Focus mode when you’re playing your favorite game. You can even add multiple triggers of the same type to make sure your bases are covered. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-focus-automatic.jpeg?quality=50&amp;strip=all\" /><figcaption>You can set multiple triggers for a single Focus mode.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>It may take 10 or 15 minutes to set up and customize a Focus mode, but the effort will be worth it. The reduced distractions will get back all that time and more, and you’ll finally start to feel like you are the master of your iPhone instead of a thrall to its endless string of chirps and vibrations to grab your attention.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3c004953ac68faf046ce684a058f74ad3208e55b50b3467278e186772e21415b","category":"Apple"}