{"title":"175 Impact of common dietary strategies on piglet growth and scouring with an enterotoxigenic Escherichia coli F18 challenge","link":"https://academic.oup.com/jas/article/102/Supplement_2/127/7665075?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>This experiment evaluated the impact of various dietary treatments on the growth and scouring of piglets post-wean and following an enterotoxigenic <span>Escherichia coli</span> F18 infection (ETEC). A total of 240 pigs (PIC 337 x 1050, Genus, Henderson, TN) were randomly assigned to 40 mixed-sex pens (6 pigs/pen) for a 6-wk experiment. At arrival, all pigs were genotyped for fucosyltransferase (FUT1). Pens were assigned to five dietary treatments: NC (standard nursery diet without Zinc or carbadox, 22.31% CP, 1.46 SID Lys in Period 1); PC (NC + 3,750 ppm zinc oxide and carbadox); LCP (NC with low crude protein, 19.5% CP, 1.3% SID Lys in Period 1); FIB (NC with 8% wheat middlings); and Zinc (NC + 3,750 zinc oxide). Pig body weight (BW), feed disappearance, and feed conversion were evaluated for four periods: d 0-7, 7-14, 14-21, and 21-42. Scour scores were recorded daily for the first 28 d of the experiment to calculate weekly percentage of days scouring (scouring percentage). Pigs received a common diet from d 21-42. All pigs were orally inoculated with a field strain of ETEC on d 14 of the experiment. Blood was collected (8 mL) from one ETEC susceptible pig per pen on d 14 and 17, with a separate susceptible pig collected on d 20. These two pigs were euthanized on d 17 and 20, respectively, for tissue collection. Fecal swabs from susceptible pigs were collected on d 14, 16, 18, and 20 to measure ETEC shedding. Blood samples were analyzed for inflammatory markers, and villi: crypt within the ileum were measured. Data were analyzed using mixed model methods (SAS 9.4, Cary, NC) with pen as the experimental unit. Fixed effects of dietary strategy, experimental period, and the interaction were included for growth performance and scouring percentage. While overall growth performance was not significantly impacted by treatment, scouring percentage was impacted by treatment, period, and treatment x period interaction (<span>P</span> &lt; 0.01). In the first week post-weaning (d 0-7), NC had the greatest scouring percentage (50%), while PC and LCP had the least (21.4%, <span>P</span> = &lt; 0.01). For d 7-14, NC had the greatest scouring percentage (33.9%), while PC (<span>P</span> &lt; 0.01%) and Zinc (14.3%) had the leastt. Post ETEC inoculation (d 14-21), fiber had the greatest scouring percentage (<span>P</span> &lt; 0.01, 28.6%), with PC (5.4%) and Zinc (8.9%) having the least, and LCP (16.1%) and NC (21.4%) being intermediate. Interestingly, 1 wk post-ETEC inoculation, LCP had the greatest scouring percentage (30.4%), with PC (5.4%), NC (7.1%), and fiber (3.6%) having the least. Although LCP treatments initially reduced scours after weaning, they exhibited a delayed scouring response to ETEC infection compared with FIB, with an elevated scouring percentage persisting up to d 21-28.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3c023782de769f8d1ec88e822228f4cf06549780bc435934005eef3990155a8e","category":"Environment"}