{"title":"Terrestrial support of wetland food webs via a dissolved inorganic carbon pathway","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12712?af=R","date":1728319470000,"content":"<h2>Abstract</h2>\n<p>Studies of terrestrial support of aquatic food webs have focused primarily on terrestrial organic matter (t-OM) directly used by animal and microbial consumers. However, dissolved inorganic carbon (DIC) released from t-OM might also support aquatic primary producers, a key resource for zooplankton and upper trophic levels. Using 2-yr <sup>13</sup>C measurements of algae, zooplankton, terrestrial detritus, sediments, dissolved and particulate organic matter from six seasonal wetlands, we found that in January when algal concentration was low, zooplankton used t-OM directly or heterotrophic microbes that decompose t-OM, but in March and May zooplankton was mainly supported by algae as their basal resources, and the algae used DIC derived from the mineralization and methanogenesis of t-OM, suggesting the DIC pathway of terrestrial support of aquatic food webs. The decomposition of abundant t-OM from both bed sediments and water column caused high concentrations of DIC. Despite uptake by algae, about half of DIC produced in January and March ended up as emissions to the atmosphere in the form of CO<sub>2</sub>. This finding revealed the dual roles of t-OM in maintaining the productivity and stability of aquatic food webs and in contributing to global carbon emissions. This duality poses challenges for simultaneously mitigating carbon emissions and conserving biological communities in seasonal wetlands. Finally, wide seasonal differences in δ<sup>13</sup>C in DIC (−12.4‰ to 6.7‰) were observed, mainly driven by air–water CO<sub>2</sub> exchange and photosynthesis, suggesting that <sup>13</sup>C may be a powerful tool to investigate carbon cycling in shallow, temporary freshwater ecosystems that are widespread but understudied.</p>","author":"Junna Wang, \nJohn R. Durand, \nSharon P. Lawler, \nPin‐Yuan Chen, \nXiaoli Dong","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"3c183b39c8d69a875ef613be02c3da0ae7516bda2a69bba03eb1fa24a3dc6b92","category":"Environment"}