{"title":"Production of Poly(3-Hydroxybutyrate-Co-3-Hydroxyvalerate) by Bacillus megaterium LVN01 Using Biogas Digestate","link":"https://www.preprints.org/manuscript/202403.1448/v1","date":1711351219000,"content":"The Bacillus megaterium LVN01 species native to Colombia has demonstrated the ability to metabolize different co-products or industrial waste (such as fique juice, cane molasses, residual glycerol) and accumulate polyhydroxybutyrate (PHB), giving it potential in the bioplastics industry. In this research, the potential of liquid digestate as a carbon source for the production of PHA in fermentation processes with this bacterial strain was evaluated. Favorably, it was found that B. megaterium utilizes the nutrients from this residual substrate to multiply appropriately and efficiently synthesize poly(hydroxybutyrate-co-hydroxyvalerate) (PHBV). Bench scale aerobic batch fermentation, under the operational conditions of this research [Volume: 3L; Temperature: 30.8°C; Agitation: 400 rpm; pH: 7.0 ± 0.2; Disolved Oxygen: 100% saturation; Antifoam 10% (v/v)], generated maximum values of DCW (0.56 g cell L-1) at 60 h, while the maximum PHB yield (360 mg PHB L-1) occurred at 16 h, which is very favorable for sustainable degradable bioplastics production. Additionally, GC-MS and NMR analyses confirmed that the PHBV copolymer synthesized by B. megaterium is made up of the monomers 3-hydroxybutyrate (3HB) and 3-hydroxyvalerate (3HV). Furthermore, the thermal properties determined by TGA (Tonset=283.1 ºC, Tendset= 296.98 ºC. Td =290.114 °C) and DSC (Tm= ºC155.7 °C, ΔHf= 19.80 J g-1, Xcr = 18.17%), indicate that it is a thermally stable biopolymer with low percentages of crystallinity, providing flexibility that facilitates molding, adaptation, and application in various industrial sectors.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3c1d2d5bb2dda1f9bef2d88dcd70e9d402b4037a71d7aed95fdf69a3cced3a47","category":"Interdisciplinary"}