{"title":"Biohydrogen generation from distillery effluent using baffled up‐flow microbial electrolysis cell","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11119?af=R","date":1726797803000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/9789a4de-1152-432f-b0cb-9b883940766b/wer11119-toc-0001-m.png\" alt=\"Biohydrogen generation from distillery effluent using baffled up-flow microbial electrolysis cell\" />\n<p>In this study, the baffled up-flow microbial electrolysis cell (UPMEC) featured a baffleplate that enhanced performance over conventional system. The flow rate and bufferconcentration revealed a maximum biohydrogen production of 0.6837 ± 0.02 mmol/L and COD reduction of 49 ± 1.0% at 150 mM of buffer concentration. In additions, the peak current density of 1,335.94 mA/m<sup>2</sup> was achieved at 150 cm<sup>2</sup> electrode area used. The results indicated the baffle UPMEC's effectiveness in optimizing hydrogen production and treatment efficiency.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Microbial electrolysis cell (MEC) is gaining importance not only for effectively treating wastewater but also for producing hydrogen. The up-flow microbial electrolysis cell (UPMEC) is an innovative approach to enhance the efficiency, and substrate degradation. In this study, a baffled UPMEC with an anode divided into three regions by inserting the baffle (sieve) plates at varying distances from the cathode was designed. The effect of process parameters, such as flow rate (10, 15, and 20 mL/min), electrode area (50, 100, and 150 cm<sup>2</sup>), and catholyte buffer concentration (50, 100, and 150 mM) were investigated using distillery wastewater as substrate. The experimental results showed a maximum of 0.6837 ± 0.02 mmol/L biohydrogen at 150 mM buffer, with 49 ± 1.0% COD reduction using an electrode of area 150 cm<sup>2</sup>. The maximum current density was 1335.94 mA/m<sup>2</sup> for the flow rate of 15 mL/min and surface area of 150 cm<sup>2</sup>. The results showed that at optimized flow rate and buffer concentration, maximum hydrogen production and effective treatment of wastewater were achieved in the baffled UPMEC.</p>\n<h2>Practitioner Points</h2>\n<p>\nBiohydrogen production from distillery wastewater was investigated in a baffled UPMEC.\nFlowrate, concentration and electrode areas significantly influenced the hydrogen production.\nMaximum hydrogen (0.6837±0.02mmol/L.day) production and COD reduction (49±1.0%) was achieved at 15 mL/min.\nHighest CHR of 95.37±1.9 % and OHR of 4.6±0.09 % was observed at 150 mM buffer concentration.\n</p>","author":"Jayachitra Murugaiyan, \nAnantharaman Narayanan, \nSamsudeen Naina Mohamed","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"3c1e9d6ece47017d3c83e2b21f19e6b1c6c73baf5ea496d24e305d9fcedfbb79","category":"Environment"}