{"title":"Koen de Kort has three fingers amputated after off-road vehicle incident","link":"https://cyclingtips.com/2021/06/koen-de-kort-has-three-fingers-amputated-after-off-road-vehicle-incident/","date":1624560481000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/dekort-650x433.jpg\" /></div><h2>Koen de Kort has three fingers amputated after off-road vehicle incident</h2><p>\n</p><p>Koen de Kort underwent the amputation of three fingers following a serious incident on Thursday, Trek-Segafredo said.</p>\n\n\n\n<p>The 38-year-old Dutchman, who lives in Andorra, was “involved in an accident in the Pyreenes area” while driving off-road on Thursday morning, suffering a serious right hand injury. He was then taken by helicopter to the Parc Tauli hospital in Sabadell, in the Catalonia region of Spain.</p>\n\n\n\n<p>De Kort then spent over three hours in surgery, where doctors amputated three fingers.</p>\n\n\n\n<p>“Unfortunately, Koen has lost the third, fourth, and fifth finger of his right hand. The amputation has been total removal,” Trek-Segafredo physician Manuel Rodrìguez Alonso said in a statement.</p>\n\n\n\n<p>“Dr. Jorge Serrano, who operated on him and to whom we must thank for his work, told me that from the first findings the functionality of the hand will be maintained thanks to the thumb and index finger. The latter also suffered a considerable damage but, thanks to the efforts of the doctors, was saved from amputation.</p>\n\n\n\n<p>“Because of considerable dirt around the wounds, the risk of infection has not been ruled out, but the most appropriate antibiotic therapy is being administered. Obviously, Koen will remain in the hospital for the next few days.”</p>\n\n\n\n<p>According to the team’s statement, Rodríguez Alonso has been in contact with De Kort before and after the operation, and the Dutch veteran is “in good condition physically and mentally.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/koen-de-kort-has-three-fingers-amputated-after-off-road-vehicle-incident/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3c1f5a82037aeb6ee78f2d11650085ad132a1fde746fdc945f7e3229597a737a","category":"Cycling"}