{"title":"lncRNA NORAD alleviates dysfunction of renal proximal tubular epithelial cells during the sepsis‐associated acute kidney injury by modulating the miR‐155‐5p‐PDK1 axis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24130?af=R","date":1709533726000,"content":"<h2>Abstract</h2>\n<p>The sepsis-associated acute kidney injury (Sa-AKI) is closely related to high mortality rates worldwide. Injury to the renal proximal tubular epithelial cells (RPTECs), caused by pathological conditions, is a major cause of acute kidney injury (AKI). The lncRNA NORAD has been reported to be positively associated with kidney cancers. However, the biological roles and underlying mechanisms of NORAD in RPTECs during AKI are still unclear. In this study, we found that NORAD was significantly downregulated in RPTECs from AKI tissues. Overexpression of NORAD alleviated RPTECs injury induced by lipopolysaccharide (LPS). Additionally, glucose metabolism was significantly impaired during AKI, and LPS treatment inhibited glucose metabolism in RPTECs. We demonstrated that NORAD rescued the LPS-induced inhibition of glucose metabolism in RPTECs. Furthermore, miRNA-155-5p was significantly upregulated in RPTECs from AKI. Through bioinformatics analysis, RNA pull-down, RNA IP, and luciferase assays, we showed that NORAD directly associated with miR-155-5p to downregulate its expression. Moreover, overexpression of miR-155-5p inhibited glucose metabolism by directly targeting the 3′UTR of the glucose metabolism enzyme, pyruvate dehydrogenase kinase 1 (PDK1). Finally, rescue experiments validated that NORAD's protective effect on RPTECs injury was mediated through modulation of the miR-155-5p-PDK1-glucose metabolism pathway. In summary, these results reveal that lncRNA NORAD can alleviate RPTECs dysfunction by targeting the miR-155-5p-PDK1 axis, suggesting that NORAD has the potential to contribute to the development of therapeutic approaches against Sa-AKI.</p>","author":"Hulin Lu, \nYan Chen, \nYong Yang, \nMin Ding, \nFengping Qiu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"3c20df788efb4b18d342357d8839c612ca01748a7aec92dbbe619e15341aa3f5","category":"Environment"}