{"title":"Meta Debuts $500 Quest 3 as Apple Prepares to Launch $3,500 Vision Pro Headset Next Year","link":"https://www.macrumors.com/2023/09/27/meta-quest-3/","date":1695855960000,"content":"Facebook parent company Meta <a href=\"https://www.meta.com/quest/quest-3\">today announced</a> the upcoming launch of the $500 Meta Quest 3, its newest mixed reality headset that goes up against the much more expensive Vision Pro that Apple plans to launch next year.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/meta-quest-3.jpg\" alt width=\"1385\" height=\"779\" />\r<br />\nMeta claims that the Quest 3 was redesigned from the inside out, and it features \"4K+ Infinite Display resolution\" thanks to two displays with a 2064x2208 resolution per eye and an \"experimental\" 120Hz refresh rate. Comparatively, Apple's headset uses 4K micro-OLED displays and provide a total of 23 million pixels.\r<br />\n\r<br />\nThe Quest 3 is equipped with 3D spatial audio and a 40 percent louder volume range than the Quest 2. Meta is using Qualcomm's Snapdragon XR2 Gen 2 chip for the headset, and it offers double the GPU processing power of the Meta Quest 2. Meta says with the new chip, the Quest 3 supports \"fast-action gaming, seamless full-color, and high-resolution passthrough.\"\r<br />\n\r<br />\nTwo RGB cameras with 10x better resolution than the Quest 2 provide a view of the surrounding area, and virtual objects are able to be manipulated in your physical space. This is the augmented reality part of the headset, and it mirrors what's possible with the Vision Pro.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/meta-quest-3-controllers.jpg\" alt width=\"1758\" height=\"989\" />\r<br />\nThe Meta Quest 3 weighs in at 515 grams, which is over a pound, and it is slightly heavier than the Quest 2. There is, however, a slimmer optic profile thanks to new pancake lenses, so Meta says the headset is more comfortable to wear. There is a soft adjustable strap that holds it on the head, and the facial interface can be adjusted to improve comfort and field of view. There is 110 degree horizontal field of view and a 96 degree vertical field of view for extended peripheral vision, plus sharpness in the center field of view has been increased by 25 percent. Unlike Apple's headset, there is no eye tracking or iris scanning.\r<br />\n\r<br />\nFor input, the Meta Quest 3 uses two Touch Plus Controllers that serve as a \"natural extension\" of the hands and offer tactile haptic feedback. Meta is using computer vision and machine learning sensors to follow hand gestures, and there are a series of cameras that enable controller-free navigation, which is similar to what's possible with the Vision Pro headset.\r<br />\n\r<br />\nThe Meta Quest 3 lasts for up to 2.2 hours per charge on average, and it does not include an external battery pack. The <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> also lasts for two hours when connected to its external battery, but it can run all day when hooked up to a power source.\r<br />\n\r<br />\nOther features include 8GB RAM, Wi-Fi 6E, an LED that lets people nearby know when cameras are in use, and support for connecting to a PC with the Meta Quest Link Cable and Air Link.\r<br />\n\r<br />\nThe Meta Quest 3 is priced at $499.99 for 128GB of storage or $649.99 for 512GB of storage and can be pre-ordered from the <a href=\"https://www.meta.com/quest/quest-3\">Meta website</a>, <a href=\"https://howl.me/ckGhrU7nxKN\">Best Buy</a>, and other retailers starting today. Orders are set to start arriving in October.<div>Tags: <a href=\"https://www.macrumors.com/guide/facebook/\">Facebook</a>, <a href=\"https://www.macrumors.com/guide/meta/\">Meta</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/27/meta-quest-3/\">Meta Debuts $500 Quest 3 as Apple Prepares to Launch $3,500 Vision Pro Headset Next Year</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/meta-debuts-500-quest-3-as-apple-prepares-to-launch-3-500-vision-pro-headset-next-year.2405179/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3c24586c0440f15bfba5a775f52ed3bc3074e6329c2d8fb0157ca6ee89e38d95","category":"Apple"}