{"title":"Real World Safety and Outcome of First Line Pembrolizumab Monotherapy for Metastatic NSCLC with PDL-1 Expression &ge; 50%: A National Italian Multicentric Cohort (&ldquo;PEMBROREAL&rdquo; Study)","link":"https://www.preprints.org/manuscript/202404.1044/v1","date":1713269192000,"content":"Results from the phase III Keynote-024 clinical trial have established Pembrolizumab monotherapy as the first-line standard of care for patients with metastatic NSCLC who have PD-L1 expression ≥ 50%, EGFR and ALK wild-type. However, given the differences between patients treated in routine clinical practice and within a clinical trial, real-world data are needed to confirm the treatment benefit in standard practice. Given the lack of data on large cohorts of patients with long follow-up, we designed a retrospective observational study of patients with NSCLC who were treated with Pembrolizumab, starting from its reimbursement eligibility until December 2020. The primary endpoints were to assess PFS and OS using the Kaplan-Meier method, treatment response and safety. We followed 880 patients (median follow-up: 35.1 months) until February 2022. Median PFS and OS were 8.6 months (95% CI: 7.6-10.0) and 25.5 months (95% CI: 21.8-31.6), respectively. We also found that ECOG PS, PD-L1 expression and smoking habit were prognostic factors for PFS, while age, sex, ECOG PS, smoking habit and histology had an impact on OS. Multivariable analysis confirms prognostic role of PD-L1 for PFS and ECOG for both PFS and OS. 39.9% of patients reported an adverse event, but only 6.3% of patients discontinued therapy due to toxicity. Our results suggest a long-term benefit of Pembrolizumab in the first-line setting as well as a safety profile consistent with the results of Keynote-042. Many collected variables appear to influence clinical outcome, but results from these exploratory unadjusted analyses should be interpreted with caution.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3c27c8ff62a90dd8eaca96ec7a6f5236ac800591259869600692ada9d5b176f9","category":"Interdisciplinary"}