{"title":"Molecular characterization and demographic insights into soybean bud borer (Lepidoptera: Tortricidae) in Brazil","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae019/7624479?rss=1","date":1709856000000,"content":"<span><div>Abstract</div>The soybean bud borer, a soybean pest in Brazil, was initially identified as <span>Crocidosema aporema</span> (Walsingham 1914) (Lepidoptera: Tortricidae). Outbreaks of this species have recently increased, but identification of this pest remains uncertain, and the historical factors associated with its geographic distribution in Brazil are little known. Here, we conducted a species characterization and phylogeographic analysis based on molecular and morphological evidence. Ninety individuals of bud-borers Lepidoptera were collected in different regions of Brazil. We sequenced COI and COII mitochondrial genes and examined wing patterns and male genital morphology. DNA barcoding approach revealed that 10 individuals were <span>Argyrotaenia sphaleropa</span> (Meyrick 1909) (Lepidoptera: Tortricidae) and 80 were a species of the genus <span>Crocidosema</span> Zeller. The morphology of the adult genitalia and wings proved to be insufficient to confirm the identification of Brazilian individuals as <span>C. aporema</span>, a species originally described from a high-elevation site in Costa Rica. Furthermore, the genetic distance between putative <span>C. aporema</span> specimens from Brazil and Costa Rica (ranging from 5.2% to 6.4%) supports the hypothesis that the Brazilian specimens are not referable to <span>C. aporema.</span> Our analysis revealed a single genetic strain (i.e., species) with low genetic diversity on soybean crops. We found no indication that the genetic structure was related to geographic distance among populations or edaphoclimatic regions. The population expansion of the soybean bud borer coincides with the increase in the area of soybean production in Brazil, suggesting that expanded soybean farming has allowed a significant increase in the effective population size of this pest.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"3c352d7b98f28958db541d22dd792d431c2550b460f245734fa37ff16762d80c","category":"Environment"}