{"title":"In-hospital versus after-discharge complete revascularization in patients with ST segment elevation myocardial infarction and multivessel disease. REVIVA-ST trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303284","date":1715695200000,"content":"<p>by Eva Rumiz, Ernesto Valero, Carmen Fernandez, Juan Vicente Vilar, Mauricio Pellicer, Andres Cubillos, Alberto Berenguer, Lorenzo Facila, Joan Vaño, Julio Nuñez</p>\r\nIntroduction <p>Complete revascularization (CR) in patients with ST-segment elevation myocardial infarction (STEMI) and multivessel disease (MVD), is associated with a reduction in major adverse cardiovascular events (MACE). However, there is uncertainty about whether nonculprit-lesion revascularization should be performed, during index hospitalization or delayed, especially regarding health care resources utilization. In this study, we aimed to evaluate the impact of in-hospital nonculprit-lesion revascularization vs. delayed (after discharge) revascularization on the length of index hospitalization.</p> Methods <p>In this single-center study, we randomly assigned patients with STEMI and MVD who underwent successful culprit-lesion PCI to a strategy of either CR during in-hospital admission or a delayed CR after discharge. The first primary endpoint was the length of hospital stay. The second endpoint was the composite of cardiovascular death, myocardial infarction or ischemia-driven revascularization at 12 months (MACE).</p> Results <p>From January 2018 to December 2022, we enrolled 258 patients (131 allocated to CR during in-hospital admission and 127 to an after-discharge CR). We found a significant reduction in the length of hospital stay in those assigned to after-discharge CR strategy [4 days (3–5) versus 7 days (5–9); p = 0.001]. At 12-month of follow-up, no differences were found in the occurrence of MACE, 7 (5.34%) patients in in-hospital CR and 4 (3.15%) in after-discharge CR strategy; (hazard ratio, 0.59; 95% confidence interval, 0.17 to 2.02; p = 0.397).</p> Conclusions <p>In STEMI patients with MVD, an after-discharge CR strategy reduces the length of index hospitalization without an increased risk of MACE after 12 months of follow-up.</p> Trial registration <p>ClinicalTrials.gov number: NCT04743154.</p>","author":"Eva Rumiz","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3c42399c92279fc7d5774330ccd4801db5d73c0f2380071f22c36be4017fea09","category":"Interdisciplinary"}