{"title":"ผลการสืบสวนเผย อัลกอริทึม Instagram มีส่วนสนับสนุนกลุ่มคนใคร่เด็ก","link":"https://www.blognone.com/node/134243","date":1686224123000,"content":"<div><div><div><p>จาก<a href=\"https://www.wsj.com/articles/instagram-vast-pedophile-network-4ab7189\">การสืบสวนร่วมกันโดย The Wall Street Journal</a> และนักวิชาการที่ Stanford University และ University of Massachusetts Amherst พบว่าระบบแนะนำบัญชีของ Instagram มีส่วนช่วยโปรโมทให้เครือข่ายกลุ่มคนใคร่เด็ก (pedophile) ด้วยการเชื่อมโยงคนที่ชอบคอนเทนต์ลักษณะนี้ ให้ไปเจอกับกลุ่มผู้ขายคอนเทนต์</p>\n<p>บัญชีลักษณะนี้ จะโฆษณาโดยใช้แฮชแท็กที่เข้าข่ายการขายเนื้อหาให้กับกลุ่มคนใคร่เด็กชัดเจน เช่น <em>#pedowhore</em>, <em>#preteensex</em> และ <em>#pedobait</em> ซึ่งแฮชแท็กเหล่านี้จะกลายเป็นแหล่งช็อปปิ้งให้กับทั้งผู้ซื้อหรือคนกลาง  โดยมีทั้งรูปแบบวิดีโอและภาพ รวมถึงคอนเทนต์ประเภททำร้ายตนเอง และมีเพศสัมพันธ์กับสัตว์</p>\n<p>ด้วยอัลกอริทึมของ Instagram ที่จะแนะนำคอนเทนต์ลักษณะที่ผู้ใช้ชอบมาให้เรื่อยๆ นักวิจัยที่ทดลองสร้างแอคเคาท์ที่สนใจคอนเทนต์ข้างต้น ก็ได้รับ recommendation ไม่ว่าจะโปรไฟล์หรือคอนเทนต์มากมายจาก Instagram</p>\n<p>และยิ่งเมื่อเทียบกับแพลตฟอร์มอื่น ก็พบว่ามีจำนวนบัญชีที่มีคอนเทนต์ลักษณะเดียวกันน้อยกว่า โดยใน Twitter แม้ว่าจะมีผู้ใช้น้อยกว่า Instagram ถึง 1 ใน 3 แต่พบเพียง 128 บัญชีที่เข้าข่าย ขณะที่ TikTok คอนเทนต์แนวนี้แทบไม่แพร่หลายเลย</p>\n<p>ด้าน Meta หลังเห็นรายงานนี้ของ WSJ ก็เปิดเผยว่าได้ตั้งหน่วยงานภายในเพื่อจัดการปัญหานี้แล้ว พร้อมยืนยันว่าจะหาทางป้องกันกลุ่มคนที่มีพฤติกรรมลักษณะนี้</p>\n<p>นอกจากปัญหาอัลกอริทึมของ Instagram แล้ว ทีมสืบสวนยังพบว่าเมื่อยื่นคำร้องให้ทีม Instagram ตรวจสอบ คำร้องมักจะถูกเพิกเฉยหรือปฏิเสธอยู่บ่อยครั้ง</p>\n<p>ที่มา: <a href=\"https://www.theverge.com/2023/6/7/23752192/instagrams-recommendation-algorithms-promote-pedophile-networks-investigation\">The Verge</a></p>\n<p><img alt=\"alt=&quot;IG&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/b3e3fe3a4e5b8d88d741c44ba248132e.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/instagram\">Instagram</a></div><div><a href=\"/topics/algorithm\">Algorithm</a></div><div><a href=\"/topics/meta\">Meta</a></div></div></div>","author":"Methasit Tubtim","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3c45ac570a435d321e6eef0f48c928b8f944fd9a7ccc11f4f374acff933aadef","category":"Thai"}