{"title":"PSVI-15 Assessing the implications of a silymarin-enriched diet on the performance and blood absorption rate of broiler and laying hen","link":"https://academic.oup.com/jas/article/102/Supplement_2/328/7664763?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>This experiment was executed to assess the impacts of silymarin on different aspects of broiler and laying hen, including growth, digestibility, excreta score, footpad lesion score, tibia ash, meat quality, and blood absorption rate. In Experiment 1: 1-d-old Ross 308 broilers (mixed sex; n = 576) were arbitrarily assigned with an average body weight of 42 ± 0.3 g for a 32-d trial. The broilers were sorted into eight repetition pens with 18 birds per pen and four research treatments (basal diet as the control and basal diet included 0.02, 0.04, and 0.06% micelle silymarin). Experiment 2: 61-wk-old Hy-line brown laying hens (n = 16) were divided into 2 treatment groups (TRT1, basal diet + powdered silymarin 4%; TRT2, basal diet + micelle silymarin 4%), with 8 numbers per repetition. Feeding broilers with a graded dose of micelle silymarin (MS) increased body weight gain linearly during d 1–9, 9–21, 21–32, and overall (<span>P</span> = 0.021, 0.011, 0.019, and 0.002, respectively). Furthermore, there was a linear increase in feed intake (<span>P</span> = 0.017) during d 1–9, and the enhancement of dry matter utilization (linear, <span>P</span> = 0.011) was exhibited as the amount of MS inclusion in the diet increased. Tibia ash content enhanced linearly (<span>P</span> = 0.038), and meat quality traits also revealed a linear improvement in breast muscle color (yellowness) (<span>P</span> = 0.045) and linear decrease (<span>P</span> = 0.004) in pH level with the increasing levels of MS in the broiler diet. Nonetheless, both the excreta score and the footpad lesion score showed no significant alteration (<span>P</span> &gt; 0.05). Moreover, a greater absorption rate of silymarin was observed in the blood of laying hens 2 h (<span>P</span> &lt; 0.0001) and 4 h (<span>P</span> &lt; 0.0001) after feeding with micelle-type silymarin as compared with powdered-type silymarin. Briefly, MS can be a favorable supplement for poultry production as it can increase the growth, digestibility, toe ash, and meat quality of broilers and the blood absorption rate of laying hens.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3c47a40e94af260fd30f19c10668b06780fee501b1fa8c55b14c4040571f8137","category":"Environment"}