{"title":"The 2021 Audi SQ5 Sportback: Cool looks, but it drinks too much","link":"https://arstechnica.com/?p=1785553","date":1628335822000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/2021-Audi-SQ5-Sportback-1-980x735.jpg\" /></div>\n        <p>\n          Audi knows that some of its customers will pay a bit more for a stylish fastback derivative of many of its models. And the latest one to get that treatment is the Q5 Sportback SUV, seen here in sporty SQ5 form.                      [credit:\n                        Jonathan Gitlin                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>When I reviewed the Audi Q7 SUV a few years ago, I said <a href=\"https://arstechnica.com/cars/2016/10/camping-trips-and-family-vacations-we-put-the-2017-audi-q7-to-the-test/\">it felt like Darth Vader's staff car</a>. That makes this Audi SQ5 Sportback a pretty good contender to be Kylo Ren's ride—younger, more athletic, and looking to make a statement. The two cars share the same weakness, too. Not so much a thirst for power as just a thirst, and one that just makes you realize how much better the car would be with an electric powertrain instead.</p>\n<p>That Audi would apply the Sportback treatment to the <a href=\"https://arstechnica.com/cars/2017/05/2018-audi-sq5-a-danger-to-sports-sedans-or-window-dressing-over-good-bones/\">Q5 SUV</a> was a foregone conclusion; the company knows well that some of its customers will trade that final ounce of practicality in favor of a sloping fastback. In this case, taking a hatchet to the hatchback SQ5 adds a $4,200 premium; the SQ5 Sportback starts at $56,100.</p>\n<p>That money buys a good-looking SUV. BMW arguably started the trend of fastback SUVs with the original X6 in 2008, and the trend has taken hold to the point where even Porsche will charge you more for a slightly less capacious but <a href=\"https://arstechnica.com/cars/2020/09/this-porsche-plug-in-suv-is-a-pricey-dayglo-antidepressant-on-wheels/\">more elegant rear end on a Cayenne</a>. In this case, I think Marc Lichte's team at Audi has put in one of their best efforts yet. The SQ5 is not a big SUV to begin with, and the cutaway fastback visually shrinks the car even more. Against a sea of regular-shape SUVs and crossovers, the SQ5 Sportback stands out as handsome.</p></div><p><a href=\"https://arstechnica.com/?p=1785553#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1785553&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3c5080e45a3feb0aa04d8c1f814b26bf03be374e41b290ec322404cfbf1d687c","category":"Tech"}