{"title":"Oprah and Prince Harry's Mental Health Docuseries Debuts May 21 on Apple TV+","link":"https://www.macrumors.com/2021/05/10/oprah-prince-harry-apple-tv-series-may-21/","date":1620652444000,"content":"Apple today <a href=\"https://www.apple.com/tv-pr/news/2021/05/oprah-winfrey-and-prince-harry-to-premiere-the-me-you-cant-see-a-documentary-series-exploring-mental-health-and-emotional-well-being-on-may-21-on-apple-tv/\">announced</a> that \"The Me You Can't See,\" a mental health documentary series from Oprah Winfrey and Prince Harry, will premiere May 21 on Apple TV+.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/051021_The_Me_You_Cant_See_Series_big_image_post.jpg.large_2x.jpg\" />\r\n<br />\r\nIn the series, Apple says Oprah Winfrey and Prince Harry host honest discussions about mental health and emotional well-being with singers, athletes, and other guests, while opening up about their own mental health journeys and struggles.<blockquote>Featuring high-profile guests, alongside a wide range of people from across the globe living with the challenges of mental health issues and addressing their emotional well-being, the series transcends culture, age, gender and socioeconomic status to destigmatize a highly misunderstood subject and give hope to viewers who learn that they are not alone. The producers partnered with 14 accredited and respected experts and organizations from around the world to help shed light on different pathways to treatment.</blockquote>Participants in the series include Lady Gaga, Glenn Close, San Antonio Spurs player DeMar DeRozan, Phoenix Suns player Langston Galloway, mental health advocate and speaker Zak Williams, Olympic boxer Virginia \"Ginny\" Fuchs, celebrity chef Rashad Armstead, and more, according to Apple.\r\n<br />\r\n\r\n<br />\r\n\"Now more than ever, there is an immediate need to replace the shame surrounding mental health with wisdom, compassion and honesty,\" said Oprah Winfrey. \"Our series aims to spark that global conversation.\"\r\n<br />\r\n\r\n<br />\r\n\"We are born into different lives, brought up in different environments, and as a result are exposed to different experiences. But our shared experience is that we are all human,\" said Prince Harry, The Duke of Sussex. \"The majority of us carry some form of unresolved trauma, loss or grief, which feels – and is – very personal. Yet the last year has shown us that we are all in this together, and my hope is that this series will show there is power in vulnerability, connection in empathy, and strength in honesty.\"<div>Tags: <a href=\"https://www.macrumors.com/guide/apple-tv-shows/\">Apple TV Shows</a>, <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV Plus</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/10/oprah-prince-harry-apple-tv-series-may-21/\">Oprah and Prince Harry's Mental Health Docuseries Debuts May 21 on Apple TV+</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/oprah-and-prince-harrys-mental-health-docuseries-debuts-may-21-on-apple-tv.2295559/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=IbHFPuAtB7k:UplQ1DtJPPE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=IbHFPuAtB7k:UplQ1DtJPPE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/IbHFPuAtB7k\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3c51bb01cf76efdd3ec336026bea2230aadd2eea21c73662370ff637d8f45b92","category":"Apple"}