{"title":"Niklaus Wirth: ‘A Plea for Lean Software’","link":"https://liam-on-linux.dreamwidth.org/88032.html","date":1705031585000,"content":"\n<p>From an essay Niklaus Wirth published in IEEE’s “Computer” magazine in 1995 (<a href=\"https://github.com/sysprv/demo-corporate-documentation-public/blob/master/Niklaus%20Wirth%20-%20A%20Plea%20for%20Lean%20Software.pdf\">original PDF</a>), some lessons learned in the development of Wirth’s Oberon system:</p>\n\n<blockquote>\n  <ul>\n<li><p>The belief that complex systems require armies of designers and \nprogrammers is wrong. A system that is not understood in its \nentirety, or at least to significant degree of detail by a \nsingle individual, should probably not be built. </p></li>\n<li><p>Communication problems grow as the size of the design team \ngrows. Whether they are obvious or not, when communication \nproblems predominate, the team and the project are both in deep \ntrouble. </p></li>\n<li><p>Reducing complexity and size must be the goal in every step — in system specification, design, and in detailed programming. A \nprogrammer’s competence should be judged by the ability to find \nsimple solutions, certainly not by productivity measured in \n“number of lines ejected per day.” Prolific programmers \ncontribute to certain disaster. </p></li>\n<li><p>Programs should be written and polished until they acquire \npublication quality. It is infinitely more demanding to design a \npublishable program than one that “runs.” Programs should be \nwritten for human readers as well as for computers. If this \nnotion contradicts certain vested interests in the commercial \nworld, it should at least find no resistance in academia. </p></li>\n</ul>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/11/wirth-plea-for-lean-software\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"3c5a032d56091dfdf0830020a63d1d210669c3456a9b00ab6d8707f1c90e0e67","category":"Tech"}