{"title":"Apple Announces WWDC 2023 Event Taking Place June 5 to 9","link":"https://www.macrumors.com/2023/03/29/apple-announces-wwdc-2023/","date":1680109123000,"content":"Apple <a href=\"https://www.apple.com/newsroom/2023/03/apples-worldwide-developers-conference-returns-june-5/\">today announced</a> that its 34th annual <a href=\"https://developer.apple.com/wwdc23/\">Worldwide Developers Conference</a> will take place from Monday, June 5 to Friday, June 9. Like WWDC 2020, 2021, and 2022, <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC 2023</a> will be an online event for the most part, and it will be open to all developers at no cost. \r<br />\n\r<br />\n<div></div><div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nApple will provide online sessions and labs, which will allow developers to learn about the new features and software that will be announced at WWDC. There will also be a traditional <a href=\"https://developer.apple.com/wwdc23/swift-student-challenge/\">Swift Student Challenge</a>, with Apple accepting applications through April 19. \r<br />\n\r<br />\nWhile ‌WWDC 2023‌ will once again be held online, Apple is planning an <a href=\"https://developer.apple.com/wwdc23/special-event/\">all-day special event</a> for select developers and students, which will take place at June 5 at the <a href=\"https://www.macrumors.com/guide/apple-park/\">Apple Park</a> campus. Attendees will be able to watch the keynote and State of the Union videos, meet some Apple employees, and attend the Apple Design Awards. Apple held a similar in-person event last year.\r<br />\n\r<br />\nCurrent Apple Developer Program members, Apple Entrepreneur Camp alumni, prior Swift Student Challenge winners, and current Apple Developer Enterprise Program members can <a href=\"https://developer.apple.com/wwdc23/special-event/\">submit a request to attend</a> the ‌Apple Park‌ event. Apple plans to select attendees by random lottery, with notifications set to go out by April 5 at 6:00 p.m. \r<br />\n\r<br />\nApple will hold a keynote event on Monday, June 5 to show off <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, iPadOS 17, tvOS 17, watchOS 10, and macOS 14, plus there could be new hardware announcements. This year's event is expected to focus on <a href=\"https://www.macrumors.com/roundup/ar-vr/\">the AR/VR headset</a> that Apple has in development, and we could also see the <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a> and a 15-inch <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>.\r<br />\n\r<br />\nPrior to 2020, WWDC was an in-person event that was held at the McEnery Convention Center in San Jose, but even with the COVID-19 pandemic restrictions lifted, Apple is choosing an online-focused event. The online format allows more developers to get the WWDC experience as there are no attendance limitations. \r<br />\n\r<br />\nApple plans to provide developers with additional information in advance of ‌WWDC 2023‌ through email, the Apple Developer app, and the <a href=\"https://developer.apple.com/wwdc23/\">Apple Developer website</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC 2023</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/29/apple-announces-wwdc-2023/\">Apple Announces WWDC 2023 Event Taking Place June 5 to 9</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-announces-wwdc-2023-event-taking-place-june-5-to-9.2385254/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3c5c304b3c1c7a6ce12cbb1db84cb17587e5aea53b04b6fbeead7dbacad7b8fa","category":"Apple"}