{"title":"Google sued over fatal Google Maps error after man drove off broken bridge","link":"https://arstechnica.com/?p=1970129","date":1695316635000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/bridge-to-nowhere.jpg\" alt=\"A collapsed bridge on a small road without any lights or barriers to protect drivers.\" />\n      <p>The collapsed bridge that Philip Paxson drove off of. (credit: Saltz Mongeluzzi Bendesky)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google is being sued by a widow who says her husband drowned in September 2022 after Google Maps directed him over a collapsed bridge in Hickory, North Carolina.</p>\n<p>Google failed to correct its map service despite warnings about the broken bridge two years before the accident, according to the <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/google-maps-lawsuit.pdf\">lawsuit</a> filed Tuesday by Alicia Paxson in Wake County Superior Court. Philip Paxson \"died tragically while driving home from his daughter's ninth birthday party, when he drove off of an unmarked, unbarricaded collapsed bridge in Hickory, North Carolina while following GPS directions,\" the complaint said.</p>\n<p>The Snow Creek Bridge reportedly collapsed in 2013 and wasn't repaired. Barricades were typically in place but \"were removed after being vandalized and were missing at the time of Paxson's wreck,\" <a href=\"https://www.charlotteobserver.com/news/state/north-carolina/article266795196.html\">according to The Charlotte Observer</a>. The lawsuit has five defendants, including Google and its owner Alphabet.</p></div><p><a href=\"https://arstechnica.com/?p=1970129#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1970129&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3c5e39363a4514f64a9970c2f88cd3e1ef7670acb12405a3193b6becdde7cd82","category":"Tech"}