{"title":"Characterization of the Virulency of Vibrio spp. in Giant Tiger Shrimp (Penaeus monodon) from Peninsular Malaysia","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/7259748?af=R","date":1701244800000,"content":"<p>Nowadays, bacterial diseases caused by <i>Vibrio</i> spp. pose a significant obstacle to aquaculture growth, affecting socioeconomic development. The presence of pathogenic <i>Vibrio</i> spp. are gaining attention due to widespread mortality in fish and shellfish worldwide. This study investigates the distribution of virulence genes and their pathogenicity by experimentally infecting a healthy group of cultured shrimp, specifically <i>Penaeus monodon</i>. A total of 225 <i>Vibrio</i> spp. isolated from 210 cultured shrimp from various geographical regions in Peninsular Malaysia were examined, resulting in 13 <i>Vibrio</i> spp. being identified and characterized. According to virulence gene assessment, only eight of the 11 virulence genes were detected in the isolates, including <i>chiA</i> (89%), <i>flaC</i> (74%), <i>tlh</i> (72%), <i>toxR</i> (70%), <i>luxR</i> (40%), <i>pirA</i> (11%), <i>pirB</i> (11%), and <i>hlyA</i> (0.4%). Other virulence genes, such as <i>tdh</i>, <i>trh</i>, and <i>ctxA</i>, were not found in any of the isolates (0%). Then, three <i>Vibrio</i> isolates, including <i>V. parahaemolyticus</i> S12-3, <i>V. campbellii</i> S10-4, and <i>V. rotiferianus</i> S24-4, were selected for pathogenicity test based on highest number of virulence genes in each species. These species were subjected to immersion challenge test against postlarvae (PL) <i>P. monodon</i> approximately PL-20 with three different concentrations of 1 × 10<sup>6</sup>, 1 × 10<sup>7</sup>, and 1 × 10<sup>8</sup> CFU/mL. The <i>V. parahaemolyticus</i> S12-3 was determined to have lethal concentration 50 (LC<sub>50</sub>) 1 × 10<sup>5</sup> CFU/mL after 168 hr of exposure. The immersion challenge test resulted in a pale hepatopancreas and empty guts in <i>P. monodon</i>. Histopathological examination showed sloughing of epithelial cells in the hepatopancreatic tubule, hemocytic infiltration, massive vacuolation, and loss of hepatopancreatic tubule structure. Overall, the study demonstrated the virulence and pathogenicity of <i>V. parahaemolyticus</i> S12-3 toward <i>P. monodon</i>, which could be associated with its virulence properties. Furthermore, the current findings will be useful in developing microbiological risk assessments for shrimp farming and aquaculture management.</p>","author":"Wan Omar Haifa-Haryani, \nMohamad Azzam-Sayuti, \nMd. Ali Amatul-Samahah, \nYong Kit Chin, \nMohd Zamri-Saad, \nSalleh Annas, \nI. Natrah, \nMohammad Noor Azmai Amal, \nMd Yasin Ina-Salwany, \nWing-Keong Ng","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"3c5f803e5a76232495814edb0fb922331c93575f7667b118ab58d09249e61096","category":"Environment"}