{"title":"Influence of varieties of hemp, Cannabis sativa (Rosales: Cannabaceae), and fertilization rates on damage caused by corn earworm, Helicoverpa zea (Lepidoptera: Noctuidae)","link":"https://academic.oup.com/ee/article/53/1/26/7222529?rss=1","date":1689033600000,"content":"<span><div>Abstract</div>Industrial hemp, <span>Cannabis sativa</span> L., production has been negatively impacted by larvae of corn earworm, <span>Helicoverpa zea</span> (Boddie), which feed on developing inflorescences. Adult <span>H. zea</span> oviposit on hemp once flowers develop, and late-instar larvae can cause serious loss to both quality and yield. A 2-year study to assess the influence of hemp variety and fertilization practices on damage caused by <span>H. zea</span> was conducted. Differences in damage ratings among varieties were observed in both years; however, the rate of nitrogen applied did not influence biomass yield or damage rating. These results indicate that increasing nitrogen fertility may not be an effective means of cultural control for mitigating damage from <span>H. zea</span>. Floral maturity was very influential on damage caused by <span>H. zea</span> as late-maturing varieties had much less floral injury than those which matured early in outdoor field trials. Some cannabinoids were also correlated to damage rating, but this relationship was due to late-maturing plants with immature flowers low in cannabinoid concentrations receiving less floral injury. Based on these results, the selection of high-yielding varieties that flower when ovipositional activity of <span>H. zea</span> is expected to decline should be the first step in an integrated pest management program for hemp production. This research expanded our knowledge of the role of fertility rate, varietal characteristics, cannabinoid profile, and floral maturity on damage caused by <span>H. zea</span> to hemp. Findings from this research will allow growers to make more informed agronomic decisions before planting to improve hemp production.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"3c6e7c5fc4c13545f0cb8c02132767d376b80ed6eb2cff5283fc5d92654cf9c7","category":"Environment"}