{"title":"Feasibility and acceptability of collecting dried blood spots (DBS) from children after vaccination during supplementary immunization activities to estimate measles and rubella seroprevalence","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002985","date":1719583200000,"content":"<p>by Andrea C. Carcelen, Christine Prosperi, Mutinta Hamahuwa, Kelvin Kapungu, Gershom Chongwe, Francis D. Mwansa, Phillimon Ndubani, Edgar Simulundu, Innocent C. Bwalya, Kalumbu H. Matakala, Gloria Musukwa, Irene Mutale, Evans Betha, Nchimunya Chaavwa, Lombe Kampamba, Japhet Matoba, Passwell Munachoonga, Webster Mufwambi, Ken Situtu, Philip E. Thuma, Constance Sakala, Princess Kayeye, Shaun A. Truelove, Amy K. Winter, Matthew J. Ferrari, William J. Moss, Simon Mutembo</p>\r\n\r\nNested serosurveys within routine service delivery platforms such as planned supplemental immunization activities (SIAs) provide an opportunity to collect information that can be used to answer valuable questions on the effectiveness and efficiency of the delivery model to inform future activities. However, integrating research data collection in SIAs is rarely done due to concerns it will negatively impact the program. We conducted a serosurvey nested within the November 2020 measles-rubella SIA integrated with the Child Health Week activities in Zambia to evaluate this approach. In-depth interviews with the study teams and vaccination campaign staff at the vaccination sites were conducted. Recorded interviews were transcribed, transcripts were coded and then grouped into themes based on a process evaluation framework. A multi-methods analytical approach was used to assess the feasibility and acceptability of collecting dried blood spots from children during the SIA. This included a quantitative assessment of participant enrollment. The serosurvey successfully enrolled 90% of children from Child Health Week due to close coordination and teamwork between the vaccination teams and serosurvey team, in addition to substantial social mobilization efforts. Continually adjusting the sampling interval that was used to select eligible children allowed us to enroll throughout the SIA and capture a representative sample of children in attendance although it was challenging for the staff involved. As vaccination programs aim to tailor their approaches to reach the hardest-to-reach children, embedding research questions in SIAs will allow evaluation of the successes and challenges and compare alternative approaches. Lessons learned from this experience collecting data during an SIA can be applicable to future research activities embedded in SIAs or other delivery platforms.","author":"Andrea C. Carcelen","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"3c769e8128c8171ae96fa93066e21fa7ee598e07d6d35979694ed821c43f4bfb","category":"Environment"}