{"title":"การล็อกอินแบบสองขั้นตอนและแบบไม่ใช้รหัสผ่านใน Synology DSM 7.0","link":"https://www.blognone.com/node/126041","date":1638124966000,"content":"<div><div><div><p>ปัญหารหัสผ่านรั่วไหล หรือรหัสผ่านไม่ปลอดภัยเพียงพอเป็นปัญหาของบริการออนไลน์จำนวนมาก ในบริการออนไลน์จากผู้ให้บริการรายใหญ่ๆ มักมีความสามารถในการดูแลบริการ ไล่บล็อคไอพีของบอตที่ยิงรหัสผ่าน แต่กับเซิร์ฟเวอร์ขนาดเล็กที่ใช้งานในบ้านหรือในธุรกิจขนาดเล็กนั้นหากตั้งเซิร์ฟเวอร์ออกอินเทอร์เน็ตก็มักจะไม่มีเจ้าหน้าที่หรือระบบมอนิเตอร์มาตรวจสอบการล็อกอินผิดปกติจริงจัง ส่งผลให้มีความเสี่ยง<a href=\"https://www.blognone.com/node/124167\">ถูกยิงรหัสผ่านจนคนร้ายยึดเครื่อง</a>ได้โดยง่าย</p>\n<p>ผู้ผลิต NAS ทั้ง Synology และ QNAP เพิ่มฟีเจอร์จนกลายเป็นเซิร์ฟเวอร์สำหรับธุรกิจขนาดเล็กในช่วงหลัง ก็ปรับความปลอดภัยรหัสผ่านกันต่อเนื่อง ทั้งสองบริษัทแนะนำให้ผู้ใช้ปิดการใช้งานบัญชี admin ซึ่งเป็นบัญชีเริ่มต้น เพื่อลดความเสี่ยงการถูกยิงรหัสผ่านแบบเดียวกับ Ubuntu ที่บังคับใช้สร้างผู้ใช้ใหม่ทันที ไม่ให้ใช้งานบัญชี root ไปจนถึงการบล็อคไอพีอัตโนมัติเมื่อไอพีใดๆ ยิงรหัสผ่านผิดเกินกำหนด</p>\n<p>ใน Synology DSM 7.0 ที่ออกมาปีนี้มีการปรับปรุงความปลอดภัยรหัสผ่านครั้งใหญ่ จากเดิม DSM รองรับการล็อกอินสองขั้นตอนเฉพาะแบบ TOTP ที่ต้องกรอกเลข 6 ตัวจากแอปเช่น Google Authenticator หรือ Microsoft Authenticator เท่านั้น ในเวอร์ชั่นใหม่รองรับการล็อกอินขั้นตอนที่สองอีกสองแบบ ได้แก่</p>\n<ul>\n<li>Approve Sign-in: การล็อกอินผ่านแอป Synology Secure SignIn แบบเดียวกับที่ไมโครซอฟท์ใช้แอป Microsoft Authenticator เวลาผู้ใช้ต้องการล็อกอินบัญชีไมโครซอฟท์ ตัวแอปจะแสดงข้อความแจ้งเตือนให้เรายืนยันว่าเป็นผู้ล็อกอินเองจริงๆ</li>\n<li>Hardware Security Key: สามารถใช้กุญแจ FIDO แบบ USB สำหรับล็อกอินได้</li>\n</ul>\n<p>การออกแบบใหม่ครั้งนี้ดูเหมือนว่าทาง Synology จะมองว่าการล็อกอินทั้งสองแบบมีความปลอดภัยสูงกว่ารหัสผ่านอยู่แล้ว จึงเปิดให้ใช้รูปแบบการยืนยันตัวตนทั้งสองแบบแทนรหัสผ่านได้เลย แต่การล็อกอินแบบไร้รหัสผ่านนั้นที่จริงแล้วก็ยังใช้รหัสผ่านได้อยู่ แต่เพิ่มความสะดวกให้กับผู้ใช้ที่จะไม่ต้องจำรหัสผ่านเท่านั้น</p>\n<p>การเปิดตัวเลือกการล็อกอินเริ่มจากหน้า Personal จากบัญชีผู้ใช้เอง เลือกแท็บ Account ตัวเลือกจะอยู่ด้านล่างสุด</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9cc275611162c01551be914105b501b7.jpg\" /></p>\n<p>เมื่อเลือกล็อกอินแบบสองขั้นตอน (2-Factor Authentication) จะมีหน้าต่างขึ้นมากให้เลือกกระบวนการล็อกอินที่ต้องการ จากสามตัวเลือก</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/69ec16997cf07519112d1862ff78ae4c.jpg\" /></p>\n<p>สำหรับตัวเลือก Approve sign-in และ Hardware security key นั้นผมแนะนำให้เปิดใช้งาน Dynamic DNS และ HTTPS ซึ่งใน DSM นั้น<a href=\"https://www.blognone.com/node/125605\">คอนฟิกคล้ายกับในเราท์เตอร์ SRM</a> เพื่อให้ใช้แอป Secure SignIn โดยตรวจสอบการเข้ารหัสกับตัว NAS ได้ หรือหากเป็นกุญแจ FIDO นั้นจำเป็นต้องตรวจสอบโดเมนของเว็บที่เรากำลังล็อกอินอยู่แล้ว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/73f70146e932ff45ce9af97654d7524d.jpg\" /></p>\n<p>เมื่อเลือกตัวเลือก Approve sign-in ระบบจะถามรหัสผ่านอีกครั้ง และให้ติดตั้งแอป (รองรับทั้ง iOS และ Android) จากนั้นจะแสดงหน้าให้สแกน QR จากแอป Synology Secure SignIn เมื่อสแกนเสร็จแล้ว ระบบจะให้ตั้งค่า TOTP ทันที ซึ่งสามารถใช้งานบนแอปของ Synology เองหรือแอป TOTP อื่นๆ เช่น Google Authenticator หรือ Microsoft Authenticator ก็ได้</p>\n<p>การออกแบบระบบยืนยันตัวตนของ DSM นั้นมองว่าอีเมลเป็นเงื่อนไขสุดท้ายในกรณีที่ผู้ใช้ทำโทรศัพท์หาย ทำให้ไม่สามารถล็อกอินผ่านแอปหรือใส่เลข TOTP ได้ การกู้บัญชีจึงต้องเซ็ตอัพให้ NAS ส่งอีเมลได้ด้วย ที่น่าแปลกใจคือ DSM 7.0 ไม่มีตัวเลือก OTP สำหรับการกู้คืนระบบ ที่ปกติแล้วบริการออนไลน์อย่างกูเกิลหรือเฟซบุ๊ก จะให้รหัสผ่านไว้ 8-12 ชุด เพื่อใช้งานได้ครั้งเดียวในกรณีที่ไม่มีโทรศัพท์อยู่กับตัว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f9abc64fbb2aacef4067d2bc2fa53d53.jpg\" /></p>\n<p>หลังจากเซ็ตอัพการล็อกอินขั้นตอนที่สองเรียบร้อยแล้ว เราสามารถกลับเข้ามาจัดการอุปกรณ์สำหรับการล็อกอินขั้นที่สองได้ โดยเพิ่มอุปกรณ์ได้ในกรณีที่เรามีโทรศัพท์หลายเครื่อง สำหรับการล็อกอินด้วยกุญแจ USB นั้นก็สามารถเลือกภายหลังได้เช่นกัน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1431083edd966bb66479034e7ad44538.jpg\" /></p>\n<p>หลังจากนั้นเมื่อผู้ใช้ต้องการล็อกอินเข้าไปยัง DSM ก็จะได้รับข้อความแจ้งเตือนในโทรศัพท์ และสามารถกดยืนยันการล็อกอินได้ทันที</p>\n<p>จะเห็นว่า DSM 7.0 นั้นรองรับตัวเลือกสำหรับการล็อกอินค่อนข้างมาก นับว่าใกล้เคียงกับบริการออนไลน์รายใหญ่ๆ อย่างไรก็ดี การใช้ระบบล็อกอินเหล่านี้มีข้อจำกัดอยู่บ้าง เช่น</p>\n<ul>\n<li>การล็อกอินด้วย แอป Secure SignIn ต้องผูก NAS เข้ากับบัญชี Synology Account เสมอ ไม่เช่นนั้นจะใช้งานไม่ได้ (ตัว NAS ยิง notification เข้าแอปผ่านเซิร์ฟเวอร์ของ Synology)</li>\n<li>หาก NAS เข้าถึงจากอินเทอร์เน็ตไม่ได้ จะไม่สามารถกดยืนยันการล็อกอินได้ หากโทรศัพท์ไม่ได้อยู่บนเน็ตเวิร์คเดียวกัน แม้จะเห็น notification และหน้าจอถามการยืนยันล็อกอินก็ตาม</li>\n<li>การใช้กุญแจ FIDO ต้องตั้งโดเมนและใช้ HTTPS เท่านั้น</li>\n<li>แอปต่างๆ ของ Synology เอง เช่น Drive หรือ Photos Mobile ยังรองรับเฉพาะ TOTP เท่านั้น ทาง Synology ระบุว่ากำลังพัฒนาแอปให้รองรับกุญแจ FIDO เพิ่มเติมในอนาคต</li>\n</ul>\n<p>แม้จะจำกัดอยู่บ้าง แต่การที่ Synology DSM รองรับมาตรฐานยืนยันตัวตนผู้ใช้ในรูปแบบใหม่ๆ ก็แสดงให้เห็นว่าการยืนยันตัวตนในอนาคตมีแนวโน้มจะใช้การยืนยันตัวตนสองขั้นตอนไปจนถึงการยืนยันตัวตนแบบไม่ใช้รหัสผ่านอีกเลย สำหรับผู้ใช้งาน NAS เป็นการภายใน ในตอนนี้มาตรการเหล่านี้อาจจะยังไม่จำเป็นนัก แต่สำหรับหลายคนที่เปิด NAS ออกสู่อินเทอร์เน็ตผมเชื่อว่าในอนาคตก็น่าจะได้ใช้งานกันเป็นปกติ</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/synology\">Synology</a></div><div><a href=\"/topics/authentication\">Authentication</a></div><div><a href=\"/topics/fido\">FIDO</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3c76c872afc8e52f8c4a2710efc478539e7f5f85c9b0b444a904a40af7a9507e","category":"Thai"}