{"title":"Restoring Severely Atrophic Edentulous Ridge of Mandible Using Self-Expanding Tissue Expander – A Case Report","link":"https://www.preprints.org/manuscript/202404.0544/v1","date":1712568778000,"content":"Introduction\n\nThe placement of implants is often hindered by a severely atrophic mandibular edentulous ridge. A sufficient volume of bone graft is crucial for successful implant restoration. The required bone graft volume directly correlates with the deficiency present in the edentulous ridge. If the residual crestal bone height is so low that the distance between the crestal ridge and the inferior alveolar nerve is less than 2 mm, a significant bone augmentation procedure is necessary. This procedure must ensure the implants are surrounded by a sufficient margin of bone, aiming for a final height of more than 8 mm and a width of more than 7 mm. Achieving primary closure with adequate soft tissue is vital for the success of the bone graft procedure. The key to successful bone grafting lies in the effective management of the soft tissue covering.\n\nCase Report\n\nThis case report details the treatment of a patient with severely atrophic edentulous ridges on both sides, addressed using Self Inflating Tissue Expanders (SITEs) to facilitate bone grafting and implant placement. Following soft tissue expansion, bone grafting and implant placement were successfully performed. The implants supported a fixed restoration, which remained stable and complication-free over a seven-year observation period.\n\nConclusion\n\nThe SITE (Self-Inflating Tissue Expander) proved effective in obtaining a substantial amount of bone graft needed for implant installation. A seven-year follow-up confirmed the implants were well-functioning with stable bone support, healthy soft tissue coverage, and adequate vestibular depth.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3c7b716c1fc01bbff39cad315191764593d5f3d58ea7bcb3906e30b36ffca2fe","category":"Interdisciplinary"}