{"title":"210 Maternal dietary organic selenium improves selenium status in neonatal lambs compared with single maternal or neonatal injection of inorganic selenium","link":"https://academic.oup.com/jas/article/102/Supplement_3/401/7757375?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The objective of this study was to compare the efficiency of three industry standard practices for improving the selenium (Se) status in neonatal lambs. Pregnant Polypay ewes (n = 27) at around 40 d pre-partum were enrolled in the study. The ewes were fed with grass silage and grain and, at 40 d from expected lambing, randomly allocated to one of three groups: 1) a single injection of 25 g sodium selenate as BO-SE/kg body weight (BW) at 4 wk before expected parturition (Inj-E) and not injection in the lambs; 2) no injection of BO-SE in the ewe but injection of 4.38 mg sodium selenite as BO-SE at 3 d of life of the lambs (Inj-L); and 3) no injection of BO-SE to the ewes or lambs but the ewes were fed 3.6 mg Se/day as Se-yeast (Yst-E) through the duration of the study (40 d prepartum + 30 d postpartum). Lambs were nursed by their own dams for 30 d without access to other feed (i.e., only milk). Blood was collected from the lambs at d 3 and 10 of life to measure 14 minerals, including Se, using ICP-MS. Glutathione peroxidase activity (GPx) was measured using a commercial kit. Data were analyzed using a GLIMMIX of SAS with an ARH covariance with treatment and time as the main effect, with lambs nested in ewe as a random effect. The number of lambs/ewes was used as a covariate. The injection of BO-SE in the ewes did not affect concentrations of Se in the lambs at birth, as there were no differences in whole blood Se between lambs in Inj-E and lambs in Inj-L at 3 d of life (i.e., before Inj-L received the BO-SE). The injection of BO-SE did not affect the level of Se in the whole blood of lambs 7 d after the injection compared with baseline (i.e., 3 d of life). Consequently, there was no difference in whole blood Se between lambs in Inj-E and Inj-L groups (177 vs. 167 ng/mL, respectively). However, injection of Se in pre-parturient dams did improve GPx activity in offspring (<span>P</span> = 0.04). Lambs in Yst-E had significantly greater concentrations of Se in whole blood compared with the other two groups at both 3 and 10 d of life (281 ng/mL; <span>P</span> &lt; 0.001). Our data demonstrate that the typical industry standard approach of injecting inorganic Se in prepartum ewes or neonatal lambs is ineffective while feeding Se-yeast to dams was effective in improving Se status in lambs.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3c8834fd4eda4448aa2b77c65c9c3bcb951101047695378fa22e43aca3816292","category":"Environment"}