{"title":"Brolucizumab in recalcitrant neovascular age-related macular degeneration–real-world data in Chinese population","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301096","date":1712066400000,"content":"<p>by Chang-Chi Weng, Sheng-Chu Chi, Tai-Chi Lin, Yi-Ming Huang, Yu-Bai Chou, De-Kuang Hwang, Shih-Jen Chen</p>\r\n\r\nThis retrospective study aimed to determine the short-term efficacy and safety of brolucizumab treatment for recalcitrant neovascular age-related macular degeneration (nAMD) in a real-world setting in Taiwan. Recalcitrant nAMD patients who were treated with brolucizumab from November 2021 to August 2022 at Taipei Veterans General Hospital were included. Patients were followed for 3 months after switching to brolucizumab. The primary outcomes were changes in mean best-corrected visual acuity (BCVA) and central retinal thickness (CRT) from baseline to the third month. The secondary outcomes included the incidence of intraocular inflammation (IOI), proportion of patients with subretinal and intraretinal fluid (SRF and IRF), and change in pigment epithelial detachment (PED) height from baseline to the third month. The significance level was considered as p &lt; .05 in all tests. A total of 38 patients (40 eyes) with a mean (±SD) age of 76.3 (±10.84) years were included. The baseline BCVA was 0.92±0.64 logMAR, and the CRT and PED height were 329.0±171.18 and 189.8±114.94 um, respectively. The patients had a significant reduction in CRT and resolution of IRF and SRF from baseline to the third month. There were numerical improvements in mean BCVA and PED height, but they were not significant. The percentages of achieving at least 0.1, 0.2, and 0.3 logMAR (equivalent to 5, 10, 15 ETDRS letters) visual gain were 50%, 37.5%, and 30%, respectively, during the first 3 months of follow-up. No IOI occurred in these patients. This study demonstrated that brolucizumab had good short-term structural and functional efficacy in recalcitrant nAMD patients.","author":"Chang-Chi Weng","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3c8ad2c923a9caa3071adbff15886285c0129411fcd72d90b74676cf2a057ec3","category":"Interdisciplinary"}