{"title":"The Rediscovery of a Relict Unlocks the First Global Phylogeny of Whip Spiders (Amblypygi)","link":"https://academic.oup.com/sysbio/article/73/3/495/7669116?rss=1","date":1715385600000,"content":"<span><div>Abstract</div>Asymmetrical rates of cladogenesis and extinction abound in the tree of life, resulting in numerous minute clades that are dwarfed by larger sister groups. Such taxa are commonly regarded as phylogenetic relicts or “living fossils” when they exhibit an ancient first appearance in the fossil record and prolonged external morphological stasis, particularly in comparison to their more diversified sister groups. Due to their special status, various phylogenetic relicts tend to be well-studied and prioritized for conservation. A notable exception to this trend is found within Amblypygi (“whip spiders”), a visually striking order of functionally hexapodous arachnids that are notable for their antenniform first walking leg pair (the eponymous “whips”). Paleoamblypygi, the putative sister group to the remaining Amblypygi, is known from Late Carboniferous and Eocene deposits but is survived by a single living species, <span>Paracharon caecus</span><a href=\"#CIT0036\">Hansen (1921)</a>, that was last collected in 1899. Due to the absence of genomic sequence-grade tissue for this vital taxon, there is no global molecular phylogeny for Amblypygi to date, nor a fossil-calibrated estimation of divergences within the group. Here, we report a previously unknown species of Paleoamblypygi from a cave site in Colombia. Capitalizing upon this discovery, we generated the first molecular phylogeny of Amblypygi, integrating ultraconserved element sequencing with legacy Sanger datasets and including described extant genera. To quantify the impact of sampling Paleoamblypygi on divergence time estimation, we performed <span>in silico</span> experiments with pruning of <span>Paracharon</span>. We demonstrate that the omission of relicts has a significant impact on the accuracy of node dating approaches that outweighs the impact of excluding ingroup fossils, which bears upon the ancestral range reconstruction for the group. Our results underscore the imperative for biodiversity discovery efforts in elucidating the phylogenetic relationships of “dark taxa,” and especially phylogenetic relicts in tropical and subtropical habitats. The lack of reciprocal monophyly for Charontidae and Charinidae leads us to subsume them into one family, Charontidae, <span>new synonymy</span>.</span>","author":"","siteTitle":"Systematic Biology Current Issue","siteHash":"ff28aeeb9b03783edee2039c6a58e13e932a0eb216cc2d8b21d5a99c6800e59a","entryHash":"3c93c9742e35f07bef2356ce754fbc38e13f5a3d76c78e1b3e28fde728fcf9e6","category":"Environment"}