{"title":"จีนออกกฎคุมเข้มแพลตฟอร์มไลฟ์ขายของ ต้องคัดกรองเนื้อหาไลฟ์ ป้องกันขายของปลอม โกงยอดขาย","link":"https://www.blognone.com/node/122346","date":1619402179000,"content":"<div><div><div><p>Cyberspace Administration of China หรือ CAC หน่วยงานควบคุมอินเทอร์เน็ตของจีน ออกกฎกำกับดูแลแพลตฟอร์มไลฟ์ขายของ ผู้ให้บริการแพลตฟอร์มต้องระบุรายการสินค้าที่ผิดกฎหมาย และหากมีพฤติกรรมขายสินค้าปลอม โกงยอดคนดู หรือมีความเกี่ยวข้องกับการพนันก็จะถูกแบนทันที</p>\n<p>ตัวกฎระบุให้ผู้ให้บริการแพลตฟอร์มต้องจ้างผู้ดูแลด้านเนื้อหาไลฟ์สด เพื่อตรวจจับและคัดกรองเนื้อหาไลฟ์ให้ปลอดภัย และควรตั้งระบบบัญชีดำป้องกันคนทำผิดซ้ำๆ เป้าหมายของกฎใหม่คือ สร้างสังคมอินเทอร์เน็ตที่ปลอดภัยและรักษาสิทธิผู้บริโภคท่ามกลางการเติบโตของอีคอมเมิร์ซและเศรษฐกิจในรูปแบบใหม่ๆ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/59198becd717b7b26ec8730462e36d24.jpg\" /></p>\n<p>การประกาศกฎใหม่ของ CAC มาไล่เลี่ยกันกับกฎของ State Administration for Market Regulation (SAMR) หน่วยงานคุมตลาดของจีนที่ระบุว่า ให้ผู้ให้บริการแพลตฟอร์มไลฟ์ต้องเก็บบันทึกวิดีโอขายของย้อนหลังไปถึงสามปี</p>\n<p>ปัจจุบันแพลตฟอร์มไลฟ์ขายของในจีน มีเจ้าดังๆ เช่น Taobao ของอาลีบาบา, Douyin ของ ByteDance</p>\n<p>โควิดทำให้การไลฟ์ขายของในจีนเจริญรุ่งเรืองมาก ข้อมูลจาก KPMG บริษัทที่ปรึกษาและบริษัทการเงินพบว่า มูลค่าตลาดไลฟ์ขายของในจีนสูงแตะ 1 ล้านล้านหยวนในปี 2020 นอกจากนี้อินฟลูเอนเซอร์ดังๆ บางรายก็สามารถหาเงินจากไลฟ์ขายของบน Taobao ได้ภายในวันเดียวเป็นล้านหยวน ในขณะเดียวกันก็พบพฤติกรรมจากผู้ไม่หวังดีเช่น ขายสินค้าปลอม โกงยอดขาย เป็นต้น</p>\n<p>ที่มา - <a href=\"https://www.scmp.com/tech/policy/article/3130942/chinese-regulators-tighten-grip-live-streaming-e-commerce-intensifying\">SCMP</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/e-commerce\">E-commerce</a></div><div><a href=\"/topics/law\">Law</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3ca8adbd79dcc9f0385629da1e16a071e3a45cac192bfda9d209cef73fc96beb","category":"Thai"}