{"title":"You can now repair your iPhone 14 and M2 MacBook at home","link":"https://www.macworld.com/article/1961088/self-service-repair-program-iphone-14-m2-macbook-air-pro.html","date":1687275906000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple on Tuesday announced that its Self Service Repair program will be expanded to include the current iPhone 14 lineup and M2 Macs. The company also changed its iPhone System Configurator process, and in some countries added new components that can be self-repaired.</p>\n\n\n\n<p>Starting on June 21, each iPhone 14 model, the M2 13-inch MacBook Air, the M2 Pro MacBook Pro, and the M2 Max MacBook Pro are part of the Self Service Repair program. Anyone wanting to repair these devices can use the same parts, tools, and manuals the Apple Store locations and Authorized Service Providers use. These items are available at the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.selfservicerepair.com/home&amp;xcust=1-1-1961088-1-0-0&amp;sref=https://www.macworld.com/feed\">Self Service Repair Store</a>.</p>\n\n\n\n<p>In Belgium, France, Germany, Italy, Poland, Spain, Sweden, the U.K., and the U.S., Apple added Self Service Repair for desktop M1 Macs, and the True Depth camera and top speaker on the iPhone 12 and iPhone 13 lineups.</p>\n\n\n\n<p>A major part of the self-repair process is System Configurator, an app that, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2023/06/apple-expands-self-service-repair-and-updates-system-configuration-process/&amp;xcust=1-1-1961088-1-0-0&amp;sref=https://www.macworld.com/feed\">according to Apple</a>, “ensures repairs with genuine Apple parts–designed and tested to internationally recognized standards–were completed correctly, and the parts are working properly.” Apple will now no longer require users to contact the Self Service Repair support to finalize a repair in System Configurator.</p>\n\n\n\n<p>Apple <a href=\"https://www.macworld.com/article/552595/apple-self-service-repair-iphone-parts-tools.html\">launched the Self Service Repair program</a> last year, in what seemed to be a response to pressure from the <a href=\"https://www.techadvisor.com/article/742031/soon-apple-might-be-forced-to-make-iphones-repairable-at-home.html\">Right to Repair campaign</a>. Customers can <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.selfservicerepair.com/manuals&amp;xcust=1-1-1961088-1-0-0&amp;sref=https://www.macworld.com/feed\">read the appropriate manual</a> to check the difficulty of a repair–in some instances, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.selfservicerepair.com/tool-kit-rental&amp;xcust=1-1-1961088-1-0-0&amp;sref=https://www.macworld.com/feed\">tool kits will need to be rented</a>, in addition to buying parts. The repairs all require a certain level of mechanical aptitude as well as a good amount of patience, but its a good way to fix a device that otherwise has a lot of life left in it.</p>\n\niPhone, MacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3cb73782fc68910c5fb6c8aeae1c7ae394c55fd113602b00e57cc0fea25157e4","category":"Apple"}