{"title":"Asymmetrical Impact of Daytime and Nighttime Warming on the Interannual Variation of Urban Spring Vegetation Phenology","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004127?af=R","date":1716534000000,"content":"<h2>Abstract</h2>\n<p>Urban warming significantly advances spring vegetation phenology. However, the potential effect of daytime and nighttime warming on the start of the urban vegetation growing season (SOS) remains to be determined. Here, we characterized the interannual response of SOS to daytime and nighttime warming from 2003 to 2020 using remotely sensed phenological observations across cities in the Northern Hemisphere (&gt;30°N). We implemented the partial correlation analysis and the process-based phenology model to quantify the effects of daytime and nighttime warming on vegetation. We found that either daytime or nighttime warming can promote an earlier urban spring SOS for Northern Hemisphere cities, while the phenological response varies across cities. Additionally, the response of SOS to daytime and nighttime urban warming (<i>S</i>\n<sub>\n   <i>T</i>\n</sub>, expressed in advance days of SOS per °C warming) offset each other at an average rate of 0.08 days/°C per decade. Our results suggest that daytime warming predominates the temporal variation of SOS for high-latitude cities, whereas nighttime warming is the primary driver of SOS change in low-latitude cities. By revealing the effect and contributions of daytime and nighttime warming on the urban SOS, our results highlight the importance of considering daytime and nighttime temperatures separately in the response of vegetation phenology to urban thermal warming and climate variability.</p>","author":"Peiyi Yin, \nXuecao Li, \nPetri Pellikka","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"3cc7698f36b60a9851ed347e0597ce55d53c9dea2078f5a24001ef0c4ffc40f4","category":"Environment"}