{"title":"Insights into the chaotropic tolerance of the desert cyanobacterium Chroococcidiopsis sp. 029 (Chroococcidiopsales, Cyanobacteria)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13414?af=R","date":1708105134000,"content":"<h2>Abstract</h2>\n<p>The mechanism of perchlorate resistance of the desert cyanobacterium <i>Chroococcidiopsis</i> sp. CCMEE 029 was investigated by assessing whether the pathways associated with its desiccation tolerance might play a role against the destabilizing effects of this chaotropic agent. During 3 weeks of growth in the presence of 2.4 mM perchlorate, an upregulation of trehalose and sucrose biosynthetic pathways was detected. This suggested that in response to the water stress triggered by perchlorate salts, these two compatible solutes play a role in the stabilization of macromolecules and membranes as they do in response to dehydration. During the perchlorate exposure, the production of oxidizing species was observed by using an oxidant-sensing fluorochrome and determining the expression of the antioxidant defense genes, namely superoxide dismutases and catalases, while the presence of oxidative DNA damage was highlighted by the over-expression of genes of the base excision repair. The involvement of desiccation-tolerance mechanisms in the perchlorate resistance of this desert cyanobacterium is interesting since, so far, chaotropic-tolerant bacteria have been identified among halophiles. Hence, it is anticipated that desert microorganisms might possess an unrevealed capability of adapting to perchlorate concentrations exceeding those naturally occurring in dry environments. Furthermore, in the endeavor of supporting future human outposts on Mars, the identified mechanisms might contribute to enhance the perchlorate resistance of microorganisms relevant for biologically driven utilization of the perchlorate-rich soil of the red planet.</p>","author":"Claudia Fagliarone, \nBeatriz Gallego Fernandez, \nGiorgia Di Stefano, \nClaudia Mosca, \nDaniela Billi","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"3ccc566a8f7500cdac73690da4a26256e999629cc6a8f7d6b48d3ded5729425b","category":"Environment"}