{"title":"Validation and usability of SeDAR e-health video for enhancing cervical cancer screening","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310555","date":1726581600000,"content":"<p>by Rodziah Romli, Emma Mirza Wati Mohamad, Rahana Abd Rahman, Kah Teik Chew, Syahnaz Mohd Hashim, Azmawati Mohammed Nawi</p>\r\nBackground <p>The cervical cancer (CC) incidence rate is increasing among young women aged &lt;50 years despite early screening is proven effective. Electronic health (e-health) has great potential for disseminating health education.</p> Methods <p>This study validated a newly developed e-health tool “SeDAR<sup>®”</sup> and assessed its usability via evaluations by health experts (HE), media experts (ME), and women. The SeDAR<sup>®</sup> content was developed based on protection motivation theory (PMT) using the nominal group technique and in-depth interviews that involved HE and women, respectively. Content validation was performed among the HE (n = 12) and ME (n = 5) using the content validation index (CVI) to identify their agreement. Subsequently, the Video Engagement Scale (VES<sup>®</sup>) was used to validate SeDAR<sup>®</sup> among women of different ethnicities (n = 11) to achieve ecological validity. The experts and women also commented on the presentation of the video.</p> Results <p>The validation yielded a good CVI among the HE (scale-level CVI-average [SCVI/Ave] = 0.986; scale-level CVI-universal agreement [SCVI/UA] = 0.900) and ME (SCVI/Ave = 0.979, SCVI/UA = 0.897). The highest VES<sup>®</sup> score [mean (±SD) = 92.90(±3.46)] proved the ecological validity of SeDAR<sup>®</sup>. The experts’ feedback established that SeDAR<sup>®</sup> conveyed a clear message about awareness of performing CC screening and was suitable for public viewing. The women considered SeDAR<sup>®</sup> easy to understand, and it advised early exposure for early CC screening.</p> Conclusions <p>SeDAR<sup>®</sup> was valid and could constitute an important e-health tool to improve motivation and uptake of CC screening.</p>","author":"Rodziah Romli","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3ccdb55f0f38a211088f0207a3d600b12b424c0798139e38b1afb5d48cb4d782","category":"Interdisciplinary"}