{"title":"Feasibility, safety, and efficacy of intraoperative magnetic resonance imaging-guided hepatectomy for small hepatocellular carcinoma: A retrospective study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306307","date":1719583200000,"content":"<p>by Keiso Matsubara, Shintaro Kuroda, Tsuyoshi Kobayashi, Kentaro Ide, Hiroyuki Tahara, Masahiro Ohira, Naruhiko Honmyo, Yuji Akiyama, Masataka Tsuge, Kazuo Awai, Hideki Ohdan</p>\r\n\r\nAdvancements in diagnostic modalities, such as enhanced magnetic resonance imaging, provide increased opportunities for identifying small hepatocellular carcinoma that is undetectable on preoperative ultrasonography. Whether it is acceptable to leave these lesions untreated is uncertain. This study aimed to evaluate the safety and efficacy of intraoperative magnetic resonance imaging-guided hepatectomy using new navigation systems. This study was conducted between July 2019 and January 2023. We retrospectively studied the clinicopathological features and prognoses of patients with small hepatocellular carcinoma who underwent curative intraoperative magnetic resonance imaging-guided hepatectomy. We evaluated 23 patients (median age, 75 years), among whom 20 (87.0%) were males. Seven (30.4%) and 15 (65.2%) patients had liver cirrhosis and a history of hepatectomy, respectively. The median size of the target lesions was 9 mm, with a median distance of 6 mm from the liver surface. Despite being undetectable preoperatively on contrast-enhanced ultrasonography, all lesions were identified using intraoperative magnetic resonance imaging. Based on pathological findings, 76.0% of the lesions were malignant. The complete resection rate was 100%, and tumor-free margins were confirmed in 96.0% of the patients. Intraoperative magnetic resonance imaging-guided hepatectomy is safe and effective in identifying and resecting small hepatocellular carcinoma lesions that are undetectable on preoperative ultrasonography.","author":"Keiso Matsubara","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3cd48975303dc51dec9651bf0c9023c9385db1c83c011f9d276e1884b2fdb6ad","category":"Interdisciplinary"}