{"title":"Sedimentary DNA reveals phytoplankton diversity loss in a deep maar lake during the Anthropocene","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12562?af=R","date":1712398748000,"content":"<h2>Abstract</h2>\n<p>Anthropogenic-driven environmental change, including current climate warming, has influenced lake ecosystems globally during the Anthropocene. Phytoplankton are important indicators of environmental changes in lakes and play a fundamental role in maintaining the functioning and stability of these ecosystems. However, the extent to which lake phytoplankton were affected by anthropogenic or climatic forces during the Anthropocene remains unclear. Here, we investigated the 160-yr-long dynamics of the phytoplankton community (cyanobacteria and eukaryotic microalgae) in response to anthropogenic forcing in Sihailongwan Maar Lake—a candidate for a Global boundary Stratotype Section and Point for demarcation of the Anthropocene—using DNA metabarcoding and traditional paleolimnological approaches. Our results show a significant decline in phytoplankton diversity and an abrupt shift in community composition around the 1950s, corresponding to the beginning of the “Great Acceleration” period. Specifically, phytoplankton taxa coexistence patterns, niche differentiation, and assembly mechanisms changed significantly after the 1950s. Overall, increases in air temperature and anthropogenic forcing appear to be the dominant controls for community reorganization and diversity decline of the phytoplankton from this deep maar lake. A neutral community model suggests that phytoplankton community composition was mainly controlled by stochastic processes before the 1950s; however, as time progressed, deterministic effects driven by anthropogenic global warming increased. The results of this study imply that anthropogenic perturbations have led to a loss of phytoplankton diversity and a further decline in ecological resilience in deep lakes, with likely knock-on effects on the productivity and function of lake ecosystems.</p>","author":"Dongna Yan, \nMaïlys Picard, \nYongming Han, \nZhisheng An, \nDewen Lei, \nXue Zhao, \nLuyuan Zhang, \nEric Capo","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"3cd9bf7b531565af25340646c612f4d415a1f73a4610a39cad5c54ed69fd2d11","category":"Environment"}