{"title":"Spatio-temporal electroencephalographic power distribution in experimental pigs receiving propofol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303146","date":1715695200000,"content":"<p>by Alessandro Mirra, Darren Hight, Claudia Spadavecchia, Olivier Louis Levionnois</p>\r\nIntroduction <p>When assessing the spatio-temporal distribution of electroencephalographic (EEG) activity, characteristic patterns have been identified for several anesthetic drugs in humans. A shift in EEG power from the occipital to the prefrontal regions has been widely observed during anesthesia induction. This has been called “anteriorization” and has been correlated with loss of consciousness in humans. The spatio-temporal distribution of EEG spectral power in pigs and its modulation by anesthetics have not been described previously. The aim of the present study was to analyze EEG power across an anterior-posterior axis in pigs receiving increasing doses of propofol to 1) characterize the region of highest EEG power during wakefulness, 2) depict its spatio-temporal modification during propofol infusion, and 3) determine the region demonstrating the most significant modulations across different doses administered.</p> Materials and methods <p>Six pigs with a body weight of 33.3 ± 3.6 kg and aged 11.3 ± 0.5 weeks were included in a prospective experimental study. Electroencephalographic activity was collected at the occipital, parietal and prefrontal regions at increasing doses of propofol (starting at 10 mg kg<sup>-1</sup> h<sup>-1</sup> and increasing it by 10 mg kg<sup>-1</sup> h<sup>-1</sup> every 15 minutes). The EEG power was assessed using a generalized linear mixed model in which propofol doses and regions were treated as fixed effects, whereas pig was used as a random effect. Pairwise comparisons of marginal linear predictions were used to assess the change in power when the specific propofol dose (or region) was considered.</p> Results <p>During both wakefulness and propofol infusion, the highest EEG power was located in the prefrontal region (p&lt;0.001). The EEG power, both total and for each frequency band, mostly followed the same pattern, increasing from awake until propofol 20 mg kg<sup>-1</sup> h<sup>-1</sup> and then decreasing at propofol 30 mg kg<sup>-1</sup> h<sup>-1</sup>. The region showing the strongest differences in EEG power across propofol doses was the prefrontal.</p> Conclusion <p>In juvenile pigs receiving increasing doses of propofol, the prefrontal region showed the highest EEG power both during wakefulness and propofol administration and was the area in which the largest frequency-band specific variations were observed across different anesthetic doses. The assessment of the spectral EEG activity at this region could be favorable to distinguish DoA levels in pigs.</p>","author":"Alessandro Mirra","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3cdee7d5e6d2d799c40b8af888c6aa94304793983613b91fac8aa21cedb9b37b","category":"Interdisciplinary"}