{"title":"Natural Target‐Mimicking Translocation‐Based Fluorescent Sensor for Detection of SARS‐CoV‐2 PLpro Protease Activity and Virus Infection in Living Cells","link":"https://www.preprints.org/manuscript/202405.0968/v1","date":1715691705000,"content":"Papain-like protease PLpro, a domain within a large polyfunctional protein nsp3, plays key roles in the life cycle of SARS-CoV-2, being responsible for the first events of cleavage of a polyprotein into individual proteins (nsp1-4) as well as for the suppression of cellular immunity. Here, we developed a new genetically encoded fluorescent sensor, named PLpro-ERNuc, for detection of PLpro activity in living cells using translocation-based readout. The sensor was designed as follows. A fragment of nsp3 protein was used to direct the sensor on the cytoplasmic surface of endoplasmic reticulum (ER) membrane, thus closely mimicking the natural target of PLpro. The fluorescent part included two bright fluorescent proteins - red mScarlet I and green mNeonGreen, separated by a linker with the PLpro cleavage site. Nuclear localization signal (NLS) was attached to ensure accumulation of mNeonGreen into the nucleus upon cleavage. We tested PLpro-ERNuc in the model of recombinant PLpro expressed in HeLa cells. The sensor demonstrated expected cytoplasmic reticular network in the red and green channels in the absence of protease, and efficient translocation of the green signal into nuclei in the PLpro-expressing cells (14-fold increase of the nucleus/cytoplasm ratio). Then, we used PLpro-ERNuc in the model of Huh7.5 cells infected with SARS-CoV-2 virus, where it showed robust ER-to-nucleus translocation of the green signal in the infected cells 24 h post infection. We believe that PLpro-ERNuc represents a useful tool for screening PLpro inhibitors as well as for monitoring virus spread in a culture.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3ce817b0f7440888df4b863be1d68a26deb3072ebaaee793a191ba48a7e28ba9","category":"Interdisciplinary"}