{"title":"The influence of enjoyment, boredom, and burnout on EFL achievement: Based on latent moderated structural equation modeling","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310281","date":1726149600000,"content":"<p>by Maojie Zhou, Xuemei Wang</p>\r\n\r\nIn recent years, the boom in the field of positive psychology in second language acquisition research has seen an increasing number of scholars focusing on the individual well-being of second language learners alongside their learning effectiveness. Despite this growing interest, there is a need to further investigate the specific emotional factors influencing academic achievement in foreign language learning. This study investigates the impact of three emotions—enjoyment, boredom, and burnout—on academic achievement, and the moderating role of academic buoyancy. Data were collected from 563 college English-as-a-foreign-language (EFL) students from China’s mainland using latent moderated structural equation modeling with Mplus. The results of the latent bivariate correlation analysis showed significant correlations between EFL learning emotions, academic buoyancy, and test performance. In the latent moderated structural equations model, enjoyment and burnout predicted test performance. Moreover, academic buoyancy moderated the relationships between enjoyment and test performance, and between burnout and test performance. EFL test performance was highest when enjoyment and buoyancy were both high, or when burnout and buoyancy were both low. These findings highlight the importance of fostering positive emotions and resilience in language learners to enhance their academic performance, offering valuable insights for educators and policymakers aiming to improve foreign language education.","author":"Maojie Zhou","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3cecfc8af82c02e6159959034f62c63f1dd5cfa429660b4d790a6e280a253fb7","category":"Interdisciplinary"}