{"title":"Feeding the machine: We give an AI some headlines and see what it does","link":"https://arstechnica.com/?p=1780089","date":1626361212000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Machine-Learning-Feature-2-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Machine-Learning-Feature-2.jpg\">Enlarge</a> <span>/</span> Turning the lens on ourselves, as it were. </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>There's a moment in any foray into new technological territory when you realize you may have embarked on a Sisyphean task. Staring at the multitude of options available to take on the project, you research your options, read the documentation, and start to work—only to find that actually just <em>defining the problem</em> may be more work than finding the actual solution.</p>\n<p>Reader, this is where I found myself two weeks into this adventure in machine learning. I familiarized myself with the data, the tools, and the known approaches to problems with this kind of data, and I tried several approaches to solving what on the surface seemed to be a simple machine-learning problem: based on past performance, could we predict whether any given Ars headline will be a winner <a href=\"https://arstechnica.com/information-technology/2021/07/is-our-machine-learning-ars-takes-a-dip-into-artificial-intelligence/\">in an A/B test</a>?</p>\n<p>Things have not been going particularly well. In fact, as I finished this piece, my most recent attempt showed that our algorithm was about as accurate as a coin flip.</p></div><p><a href=\"https://arstechnica.com/?p=1780089#p3\">Read 33 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780089&amp;comments=1\">Comments</a></p>","author":"Sean Gallagher","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3cf7e28870030cd7709154b9d10df7343a64fdb7cd5d0af56162e38319234a26","category":"Tech"}