{"title":"Movie written by algorithm turns out to be hilarious and intense","link":"https://arstechnica.com/?p=896589","date":1622390136000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p><a href=\"http://player.cnevids.com/embed/57587c44ba4aa1013c00000c/5511d76261646d5566020000\"> <em>Sunspring</em>, a short science fiction movie written entirely by AI, debuted exclusively on Ars in June 2016. (video link)</a></p>\n\n<p>Ars is excited to be hosting this online debut of <em>Sunspring</em>, a short science fiction film that's not entirely what it seems. It's about three people living in a weird future, possibly on a space station, probably in a love triangle. You know it's the future because H (played with neurotic gravity by <em>Silicon Valley</em>'s Thomas Middleditch) is wearing a shiny gold jacket, H2 (Elisabeth Gray) is playing with computers, and C (Humphrey Ker) announces that he has to \"go to the skull\" before sticking his face into a bunch of green lights. It sounds like your typical sci-fi B-movie, complete with an incoherent plot. Except <em>Sunspring</em> isn't the product of Hollywood hacks—it was written entirely by an AI. To be specific, it was authored by a recurrent neural network called long short-term memory, or LSTM for short. At least, that's what we'd call it. The AI named itself <a href=\"http://benjamin.wtf\">Benjamin</a>.</p>\n<p>Knowing that an AI wrote <em>Sunspring</em> makes the movie more fun to watch, especially once you know how the cast and crew put it together. Director <a href=\"http://thereforefilms.com/\">Oscar Sharp</a> made the movie for <a href=\"http://sci-fi-london.com/\">Sci-Fi London</a>, an annual film festival that includes <a href=\"http://48hour.sci-fi-london.com/\">the 48-Hour Film Challenge</a>, where contestants are given a set of prompts (mostly props and lines) that have to appear in a movie they make over the next two days. Sharp's longtime collaborator, <a href=\"http://rossgoodwin.com/\">Ross Goodwin</a>, is an AI researcher at New York University, and he supplied the movie's AI writer, initially called Jetson. As the cast gathered around a tiny printer, Benjamin spat out the <a href=\"https://www.docdroid.net/lCZ2fPA/sunspring-final.pdf.html\">screenplay</a>, complete with almost impossible stage directions like \"He is standing in the stars and sitting on the floor.\" Then Sharp randomly assigned roles to the actors in the room. \"As soon as we had a read-through, everyone around the table was laughing their heads off with delight,\" Sharp told Ars. The actors interpreted the lines as they read, adding tone and body language, and the results are what you see in the movie. Somehow, a slightly garbled series of sentences became a tale of romance and murder, set in a dark future world. It even has its own musical interlude (performed by <a href=\"http://tigerandman.com\">Andrew and Tiger</a>), with a pop song Benjamin composed after learning from a corpus of 30,000 other pop songs.</p></div><p><a href=\"https://arstechnica.com/?p=896589#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=896589&amp;comments=1\">Comments</a></p>","author":"Annalee Newitz","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3d0197f87b0ed6536e7a134c8aa90651df68787b90064279959f159777f22059","category":"Tech"}