{"title":"WWDC 2023: Conference set to start June 5","link":"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html","date":1680111000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Of the big Apple events of the year, WWDC is the most reliable: In each of the past 16 Junes, like clockwork, Apple has held a big get-together for its developer partners and announced a raft of important software updates. The September iPhone launch and the March/April spring event seem almost unpredictable by comparison.</p>\n\n\n\n<p>In this article, we list the major announcements (and some of the smaller titbits) you can expect to hear about at WWDC 2023 this June. Some of these–updates to the five big Apple operating systems, most obviously–are as predictable as the timing of the event. But we reckon Apple will spring a few surprises too.</p>\n\n\n\n<p>WWDC 2023 will kick off on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2023/03/apples-worldwide-developers-conference-returns-june-5/&amp;xcust=1-1-678333-1-0-0&amp;sref=https://www.macworld.com/feed\">Monday, June 5 </a> and the entire conference and its workshops will be held online. Apple will have a “special in-person experience” for some developers and students to watch the keynote live at Apple Park—but <a href=\"https://www.macworld.com/article/673537/how-to-watch-apples-wwdc-2021-keynote-livestream-video.html\">the event will be streamed live</a> for the world to watch.</p>\n\n\n\n<h2>What is WWDC?</h2>\n\n\n\n<p>WWDC stands for the Worldwide Developers Conference and is dedicated to the third-party software developers that create apps for Apple’s platforms: iPhone, iPad, Mac, etc. Apple invites developers to participate in a series of classes, workshops, and sessions to learn about the system-wide changes coming the major software platforms in the coming year so they can update their apps.</p>\n\n\n\n<p>WWDC is a week-long gathering, beginning with a keynote speech on Monday morning. It generally happens in early June, although the Covid pandemic led to a slight delay in 2020. In reality, while devs are at the heart of the event, it’s also a press event that Apple uses to announce its software plans and potentially some new Macs and other products to the world.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3790417/calendario-wwdc-2020.jpg?quality=50&amp;strip=all\" alt=\"WWDC 2020 logo\" loading=\"lazy\" /><figcaption>Apple will formally announce  WWDC 2023 in March or April.</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>When is WWDC 2023?</h2>\n\n\n\n<p>WWDC 2023 starts on Monday, June 5 with a keynote event that will start at 10 a.m. in California. If you are wondering what time will the WWDC keynote start where you are it translates to: </p>\n\n\n\n<ul><li>UK: at 6pm (BST)</li><li>Europe: at 7pm (CEST)</li><li>US: at 10am (PDT), 11am (MDT), noon (CDT), 1pm (EDT)</li><li>Canada: at 2pm (ADT)</li><li>India: at 10.30pm (IST)</li><li>Singapore and China: next day at 1am</li><li>Japan: next day at 2am (JST) </li><li>Australia: next day at 1am (AWST), 2.30am (ACST), 3am (AEST)</li><li>New Zealand: next day at 5am (NZST)</li></ul>\n\n\n\n<h2>How to watch WWDC 2023</h2>\n\n\n\n<p>Apple will <a href=\"https://www.macworld.com/article/673537/how-to-watch-apples-wwdc-2021-keynote-livestream-video.html\">live stream the opening keynote</a> for all on its website (check Apple’s events page) and elsewhere, such as on YouTube and on the Apple TV app. This means you’ll be able to watch the presentation on iPhone, iPad, Mac, Apple TV, and even PC.</p>\n\n\n\n<h2>How to get tickets to WWDC 2023</h2>\n\n\n\n<p>Some lucky developers will be able to watch the event live in person, but there will be a lot of competition for those tickets. Apple usually holds a ballot to give everyone who needs to be there a chance to apply for a ticket, which usually ends in mid-May. WWDC keynote tickets have been free for the past few years, but previously cost $1,599 for developers to attend and sold out very quickly. In 2022 developers were invited to watch the keynote <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/wwdc22/special-day/&amp;xcust=1-1-678333-1-0-0&amp;sref=https://www.macworld.com/feed\">live at Apple Park</a>, though the event was still prerecorded.</p>\n\n\n\n<p>Even without a ticket, all registered Apple developers get access to session videos, slides, and sample code throughout the week. </p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3788100/federighi_ios_13_logo_wwdc_2019.jpg?quality=50&amp;strip=all\" alt=\"iOS slide at WWDC\" loading=\"lazy\" /><figcaption><p>Apple will unveil the next generation of its operating systems at WWDC.</p>\n</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>WWDC 2023: Software releases</h2>\n\n\n\n<p>WWDC is all about the software, so we can be certain that Apple will reveal details of its upcoming operating system updates for iPhone, iPad, Mac, Apple TV, HomePod, and Apple Watch. Those updates will then be issued to developers as a beta to test, then a few weeks later a public beta will start. Eventually, the new software will be available for everyone to download in the fall (usually September for iOS/iPadOS/watchOS and October for macOS). Here’s what to expect: </p>\n\n\n\n<h3>iOS 17</h3>\n\n\n\n<p>The headliner of the event simply because of the sheer number of iPhone owners across the planet. If you’ve got an iPhone made within the past five years, you’ll likely be able to install the new version of iOS when it’s released in the fall of 2023.</p>\n\n\n\n<p>But before then, there’s a whole beta-testing cycle to get through. <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17 will be announced at WWDC 2023</a>, then released as a developer beta (for registered app developers only) almost immediately after the keynote. Developers will then be able to <a href=\"https://www.macworld.com/article/671198/how-to-install-ios-beta.html\">install the iOS beta</a> and a few weeks later a public beta version will be made available for all users who want to try the new features. Our advice is to be cautious and prepared for serious flaws with the beta software–it might even brick your device.</p>\n\n\n\n<p>Over the course of the next few months, the developer and public betas will go through a testing process where features will be tweaked, changed, fixed, and updated until we reach the finished iOS 17.0 public release, most likely in September.</p>\n\n\n\n<h3>iPadOS 17</h3>\n\n\n\n<p>The accompanying update for iPad owners, iPadOS 17 is likely to incorporate most of the new features of iOS 17 but adapted to a larger-screen interface. When Apple’s two mobile operating systems split in 2019 they were similar in most respects, but the iPad version is heading steadily into its own realm.</p>\n\n\n\n<p>In 2022, Apple released iPad OS 16 a month after iOS 16, so it’s possible that the two versions don’t arrive at the same time.</p>\n\n\n\n<h3>macOS 14</h3>\n\n\n\n<p>What’s Apple got in store for its follow-up to <a href=\"https://www.macworld.com/article/678251/macos-13-ventura-features-compatibility-download-install.html\">macOS Ventura</a>? We’ll find out at WWDC 2023.</p>\n\n\n\n<p>This should be macOS version 14.0, but what is less predictable is the California landmark Apple will name the version after. So far we’ve had: Mavericks, Yosemite, El Capitan, Sierra, High Sierra, Mojave, Catalina, Big Sur, Monterey, and Ventura. Prior to the California-based names Apple named 10 versions of the Mac operating system after big cats. (See <a href=\"https://www.macworld.com/article/672681/list-of-all-macos-versions-including-the-latest-macos.html\">every version of macOS released so far</a>.) Could this be the year Apple makes another big change in its naming convention?</p>\n\n\n\n<h3>watchOS 10</h3>\n\n\n\n<p>The new operating system for the Apple Watch will be revealed at WWDC 2023. This is more of a niche than the iPhone, iPad, and Mac updates discussed above but could bring more health and fitness features to Apple Watch owners around the world. </p>\n\n\n\n<p>Last year’s <a href=\"https://www.macworld.com/article/782575/watchos9-features-release-how-to-install.html\">watchOS 9</a> update was available for those running a Series 4 or later. If you’ve got a Series 4 or later, hopefully, the same will be true of watchOS 9. </p>\n\n\n\n<h3>tvOS 17</h3>\n\n\n\n<p>The lowest-profile of the five big Apple operating systems, tvOS is the platform that runs on the Apple TV.</p>\n\n\n\n<p>Probably the biggest addition in last year’s tvOS 16 update was support for Matter-compatible devices and support for more gaming controllers. What will we get this year? You’ll find out at WWDC.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-HomePod-Gen2_review_16.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"HomePod 1st VS Mini VS 2nd Gen\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-HomePod-Gen2_review_16.jpg?quality=50&amp;strip=all 2000w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-HomePod-Gen2_review_16.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-HomePod-Gen2_review_16.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-HomePod-Gen2_review_16.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-HomePod-Gen2_review_16.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-HomePod-Gen2_review_16.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/02/Apple-HomePod-Gen2_review_16.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>The HomePod will likely be among the products getting a preview of new features coming later in 2023.</p></figcaption></figure><p>Dominik Tomaszewski / Foundry</p></div>\n\n\n\n<h3>HomePod software version 17</h3>\n\n\n\n<p>Apple is also likely to update the software on the HomePod and HomePod mini alongside the other operating systems. In 2022 Apple introduced HomePod Software Version 16 which didn’t bring a lot of new features at the time, but a later update: HomePod Software Version 16.3 brought temperature and humidity sensing to the HomePod mini and more. We may hear more about Apple’s plans for the HomePod during the WWDC event–especially as Apple is rumored to planning big <a href=\"https://www.macworld.com/article/676817/homepod-with-screen-rumours-and-release-date.html\">changes to the HomePod</a> in 2024. </p>\n\n\n\n<h2>WWDC 2023: Hardware releases</h2>\n\n\n\n<p>WWDC tends to be a software-focused event, but Apple has often found time during its WWDC keynotes to launch hardware products too. The first few iPhone revisions—iPhone 3G, iPhone 3GS, iPhone 4, and iPhone 4S—were all released at WWDC, and the HomePod had its unveiling at the event in 2017 as well.</p>\n\n\n\n<p>However, the event has focused on Mac releases in recent years. Apple unveiled the iMac Pro in 2017 alongside updates to the iMac, MacBook, and MacBook Pro, and announced a new Mac Pro and the Pro Display XDR in June 2019. At WWDC 2020, Apple announced the transition from Intel to Apple silicon, and WWDC 2022 saw Apple launch the M2 chip in the MacBook Air and MacBook Pro.</p>\n\n\n\n<p>What’s in the hardware pipeline for Apple right now? Here’s what we hope to see: </p>\n\n\n\n<h3>Reality Pro headset</h3>\n\n\n\n<p>This is the big one. Apple has been rumored to launch a <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">new AR/VR headset</a> for years, and it is finally expected to arrive sometime in 2023, and WWDC has been floated as a possible date. With an extremely high price tag, the device is expected to be mostly geared toward developers, so WWDC would be a great opportunity for Apple to debut the new device, even if it doesn’t launch until later in the year.</p>\n\n\n\n<p>The headset is rumored to look like a pair of ski goggles, with 8K displays, numerous cameras, and an external battery pack, with a price tag that could top $3,000. However, it will be one of the most important product launches in years, as Apple looks beyond the iPhone into a whole new category of wearable device.</p>\n\n\n\n<p>If Apple launches its headset, a major component of the presentation will be the rumored xrOS, which stands for extended reality. Apple will outline the major features, developer tools, and strategies for the operating system, which is expected to focus on entertainment and communication.</p>\n\n\n\n<h3>Mac Pro </h3>\n\n\n\n<p>Over the years, new Mac Pro models have launched at WWDC and this year could be no different. By the time Apple takes the stage at the WWDC event, it will have been three years since it announced its plans to move from Intel to its own silicon, and the Mac Pro is the only Mac that hasn’t made the transition. </p>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/347010/new-mac-pro-2023.html\">latest Mac Pro rumors</a> say the machine will have an M2 Ultra processor and a similar design to the current model.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2019.jpg?quality=50&amp;strip=all\" alt=\"Apple Mac Pro 2019 front and side images\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2019.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2019.jpg?resize=300%2C233&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2019.jpg?resize=768%2C595&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"794\" /><figcaption>The latest Mac Pro launched in 2019, it’s time for a new one. </figcaption></figure><p>Apple</p></div>\n\n\n\n<h3>15-inch MacBook Air</h3>\n\n\n\n<p>Apple is said to be working on <a href=\"https://www.macworld.com/article/819516/15-inch-macbook-air-release-date-specs-rumors.html\">a larger version of the MacBook Air</a> with a 15-inch display and we could see it at WWDC if it doesn’t arrive before them. We don’t know exactly what the rest of the machine will bring, but we expect it to be very similar to the current Air, possibly with the addition of an M2 Pro chip.</p>\n\n\n\n<h3>iMac </h3>\n\n\n\n<p>By the time of the WWDC keynote, the 24-inch iMac will be more than two years old. A WWDC update would make sense, but the rumors are suggesting Apple is <a href=\"https://www.macworld.com/article/1484743/24-inch-imac-release-date-specs-m2-m3-processor-price.html\">waiting for the M3 chip</a> before it updates the iMac, so that new Mac may not launch until later in the year. </p>\n\n\n\n<h3>iMac Pro</h3>\n\n\n\n<p>When Apple launched the <a href=\"https://www.macworld.com/article/676935/apple-brings-m1-ultra-to-new-mac-studio.html\" target=\"_blank\">Mac Studio</a> in 2022 it also discontinued the 27-inch iMac, but that doesn’t mean that the large iMac is dead. In fact, Apple may have plans to bring back the larger iMac. Read the rumors about <a href=\"https://www.macworld.com/article/349270/imac-pro-release-date-display-price.html\">Apple’s plans for a 27-inch iMac Pro</a>. Unfortunately, we think we will have to wait a little longer before we see Apple unveil this new/old product though. </p>\n\n\n\n<h2>Further reading</h2>\n\n\n\n<p>We’ll update this article regularly in the run-up to WWDC, so check back from time to time to see the latest news.</p>\n\n\n\n<p>For a broader view of the year’s plans, check out our guide to the <a href=\"https://www.macworld.com/article/671090/new-apple-products.html\">new Apple products coming in 2023</a>.</p>\n\nApple, iMac, iOS, Mac, Mac Pro, MacBook, MacOS, Personal Software</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3d0d12d8536a9574777f07bf355783174bedcfea1e02b64f9142b3c74fbd4335","category":"Apple"}