{"title":"Competitive interactions affect introgression and population viability amidst maladaptive hybridization","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13746?af=R","date":1719817200000,"content":"<h2>Abstract</h2>\n<p>The deliberate release of captive-bred individuals, the accidental escape of domesticated strains, or the invasion of closely related conspecifics into wild populations can all lead to introgressive hybridization, which poses a challenge for conservation and wildlife management. Rates of introgression and the magnitude of associated demographic impacts vary widely across ecological contexts. However, the reasons for this variation remain poorly understood. One rarely considered phenomenon in this context is soft selection, wherein relative trait values determine success in intraspecific competition for a limiting resource. Here we develop an eco-genetic model explicitly focussed on understanding the influence of such competitive interactions on the eco-evolutionary dynamics of wild populations experiencing an influx of foreign/domesticated individuals. The model is applicable to any taxon that experiences natural or human-mediated inputs of locally maladapted genotypes (‘intrusion’), in addition to phenotype-dependent competition for a limiting resource (e.g. breeding sites, feeding territories). The effects of both acute and chronic intrusion depended strongly on the relative competitiveness of intruders versus locals. When intruders were competitively inferior, density-dependent regulation limited their reproductive success (ability to compete for limited spawning sites), which prevented strong introgression or population declines from occurring. In contrast, when intruders were competitively superior, this amplified introgression and led to increased maladaptation of the admixed population. This had negative consequences for population size and population viability. The results were sensitive to the intrusion level, the magnitude of reproductive excess, trait heritability and the extent to which intruders were maladapted relative to locals. Our findings draw attention to under-appreciated interactions between phenotype-dependent competitive interactions and maladaptive hybridization, which may be critical to determining the impact captive breeding programmes and domesticated escapees can have on otherwise self-sustaining wild populations.</p>","author":"Thomas Eric Reed, \nAdam Kane, \nPhilip McGinnity, \nRonan James O'Sullivan","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"3d0f860bd9ccad98ce600384ed599d9050f31fe946dc3a580fb25d850b946fc5","category":"Environment"}