{"title":"กูเกิลอัพเดตให้สอน Google Assistant อ่านออกเสียงที่อ่านยากได้, รับรู้การเปลี่ยนคำสั่งกลางคัน","link":"https://www.blognone.com/node/122422","date":1619662140000,"content":"<div><div><div><p>Google Assistant เพิ่มฟังก์ชั่นใหม่หลายอย่าง อย่างแรกคือให้ผู้ใช้งานสอน AI อ่านออกเสียงคำที่ออกเสียงยากโดยเฉพาะชื่อคน ผู้ใช้งานสามารถกดอัดเสียงตัวเองเข้าไปเพื่อสอนให้ Google Assistant อ่านออกเสียงตามได้ถูกต้องในภายหลัง เมื่อแอปอัพเดตแล้วจะมองเห็นช่องทางให้สอนอ่านออกเสียง กดที่ Record your own เพื่ออัดเสียงของตัวเองเข้าไป กูเกิลบอกด้วยว่า ระบบไม่บันทึกเสียงของผู้ใช้ และเริ่มใช้งานในภาษาอังกฤษก่อน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/92e94c47357362dbaa632e4cebddc08a.png\" /></p>\n<p>ฟังก์ชั่นถัดมาคือการตั้งเวลา ปัจจุบันผู้ใช้งานมักใช้ Google Assistant ในการตั้งเวลาหรือตั้งปลุกเพื่อทำอะไรบางอย่าง ล่าสุดกูเกิลพัฒนาการรับรู้ Google Assistant ให้ฉลาดมากขึ้นเมื่อเปลี่ยนคำสั่งกลางคัน</p>\n<p>กูเกิลยกตัวอย่าง เช่น พูดให้ตั้งเวลาปลุกตี 4 และหลังจากนั้นเกิดเปลี่ยนใจ อยากให้ตั้งปลุกช้ากว่านั้น 1 ชั่วโมง Google Assistant จะรับรู้โดยอัตโนมัติว่าต้องตั้งปลุกตี 5 หรือในกรณีที่กำลังพูดแก้ไขสิ่งที่ตัวเองสั่ง เช่น ตั้งปลุกตี 4 เอ่อ ไม่ ตั้งปลุก ตี 5 Google Assistant จะรับรู้ว่าต้องปลุกตี 5 เป็นต้น ฟังก์ชั่นนี้ใช้ ปัญญาประดิษฐ์สำหรับประมวลผลภาษา (natural language processing - NLP) หรือ BERT เสนอโดยกูเกิลเมื่อปลายปี 2018</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/dccd15509ed515f210e9ee831472f6d1.png\" /></p>\n<p>นอกจากนี้ กูเกิลยังใช้ BERT พัฒนา Google Assistant ให้รับรู้บริบทมากขึ้น เช่น ถามข้อมูลเรื่องไมอามี่ หลังจากนั้นก็ถามข้อมูลเรื่องชายหาด Google Assistant จะรับรู้ว่าให้แนะนำชายหาดที่ไมอามี่ ไม่ใช่ที่อื่น</p>\n<p>ที่มา - <a href=\"https://blog.google/products/assistant/loud-and-clear-ai-improving-assistant-conversations/\">กูเกิล</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-assistant\">Google Assistant</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/natural-language\">Natural Language</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3d10655607a1f74f40afb0eaf351b96332f661ea51c693cce1f46ffc53920f23","category":"Thai"}