{"title":"How to use Komoot to find and plan a bikepacking adventure","link":"https://www.bikeradar.com/advertising-feature/komoot-bikepacking-collections/","date":1630167310000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/08/Komoot-bikepacking-collections-20dedf7.jpg?quality=45&amp;resize=620,413\" />                                            <p>Caught the <a href=\"https://www.bikeradar.com/features/routes-and-rides/heres-what-you-need-for-a-bikepacking-adventure/\">bikepacking</a> bug or looking to plan your first trip?</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/guide-to-using-komoot/\">Komoot</a>, the route-planning and navigation app, is packed full of established <a href=\"https://www.bikeradar.com/features/routes-and-rides/bikepacking-routes/\">bikepacking routes</a> to choose from, as well as plenty of neat features to help you plan your own.</p>\n<p>Here’s how you can use Komoot to find and plan a bikepacking adventure.</p>\n<h2>Four ways you can use Komoot to plan a bikepacking trip</h2>\n<h3>1. Find your next adventure</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Use Komoot’s ‘Discover’ feature to get inspiration for your next ride.</span></figcaption><span> <i>Komoot</i></span></div>\n<p>Discovering bikepacking routes on your doorstep or seeking inspiration from all over the world has never been easier, thanks to recent additions to the Komoot mobile app.</p>\n<p>Simply tap through the green ‘Find your next adventure’ button on the ‘Discover’ feed and select bikepacking from the sport types.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> You can filter routes based on your current location, browse bikepacking routes from across the globe, or search for routes in specific areas.</span></figcaption><span> <i>Komoot</i></span></div>\n<p>Here you can choose to look at local routes based on your current location, browse bikepacking routes from across the globe, or search for routes in specific areas.</p>\n<p>For example, search for the Cairngorms National Park and you can choose from the <a href=\"https://www.komoot.com/collection/901294/burns-lochs-bothies-of-the-scottish-highlands-cairngorms-loop\" target=\"_blank\">Cairngorms Loop</a>, the <a href=\"https://www.komoot.com/collection/907966/the-grampians-in-full-glory-bikepacking-the-deeside-trail\" target=\"_blank\">Deeside Trail</a> or the <a href=\"https://www.komoot.com/collection/915663/gravel-trails-of-the-coast-and-cairngorms-thecentral-belter\" target=\"_blank\">Central Belter</a>.</p>\n<p>If you’re using Komoot on a desktop computer, head to the ‘Discover’ section to browse routes, with everything from bikepacking inspiration to routes suitable for touring with kids.</p>\n<h3>2. Explore Collections</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Komoot’s bikepacking Collections are created by an expert team of editors, contributors and ambassadors.</span></figcaption><span> <i>Komoot</i></span></div>\n<p>Created by a team of expert editors, contributors and ambassadors, Komoot’s bikepacking Collections range from accessible adventures, including the UK’s <a href=\"https://www.komoot.com/collection/1025015/history-chalk-grassland-and-forest-king-alfred-s-way\" target=\"_blank\">King Alfred’s Way</a>, to more ambitious trails such as the ​​<a href=\"https://www.komoot.com/collection/1200111/montanas-vacias-bikepacking-the-wild-and-remote-empty-mountains\" target=\"_blank\">Montañas Vacías</a> in Spain and the <a href=\"https://www.komoot.com/collection/1015999/ten-incredible-days-in-the-rocky-mountains-the-colorado-trail\" target=\"_blank\">Colorado Trail</a> in the United States.</p>\n<p>There’s even the mighty <a href=\"https://www.komoot.com/collection/1070173/7-600-km-across-the-continent-european-divide-trail\" target=\"_blank\">European Divide Trail</a>, a route that spans Europe from Norway to Portugal, covering some 4,724 miles / 7,603 kilometres across the continent.</p>\n<p>Within each Collection, you’ll find the route broken down into stages, each with a description of what to expect.</p>\n<p>Komoot’s routes are also peppered with user-generated ‘Highlights’, whether that’s an unmissable singletrack descent, a far-reaching trig viewpoint or a cycling-friendly cafe.</p>\n<p>Highlights also show you other riders’ practical tips and experiences as well as photos, so you can get an idea of what you’ll be exploring ahead of riding.</p>\n<p>Each Collection’s introduction sets the scene for the route and will let you know what to expect in terms of terrain and landscapes. You’ll find comments from other riders and practical information on transport links, accommodation and resupply options. There’s also advice on which are the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike/\">best bikes</a> for the route and terrain.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Each Collection’s introduction includes plenty of essential information for your ride, including transport links.</span></figcaption><span> <i>Komoot</i></span></div>\n<p>On that note, if you’re heading off-road on a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bike</a> or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">mountain bike</a>, you can use Komoot’s handy surface and waytypes feature to scope out the dirt roads, trails and singletrack.</p>\n<p>Open up the route, click ‘Details’ and you can see what terrain type to expect by hovering over the elevation graph or toggling ‘waytypes and surfaces’ on the graph.</p>\n<p>Komoot will show you what waytype to expect (e.g. road, cycleway, singletrack), as well as the surface type (paved, unpaved, gravel), according to community-contributed map data from Open Street Maps.</p>\n<p>For more technical singletrack sections, you can check the <a href=\"https://www.komoot.com/help/mtb-scale\" target=\"_blank\">trail rating</a> to make sure you’re riding trails that are either challenging enough for you – or you’re not biting off more than you can chew! Trails are rated between S0 (easiest, suitable for novice riders) and S5 (most difficult, for the most experienced and adventurous riders).</p>\n<p>Found a few Collections that take your fancy? Simply click the bookmark icon to save them to your own profile, ready to revisit again later.</p>\n<p></p>\n<section><div>\n        <h3>Try it for yourself with our discount code</h3>\n<p>Visit <a href=\"https://www.komoot.com/account/gift/?code=RADARBP\" target=\"_blank\">Komoot</a> and enter the code RADARBP to choose your free region bundle of offline maps, saving £8.99. Valid only for new Komoot users only, redeemable until 31/12/2021.</p>\n<p>\n\n    </p></div>\n    </section><h3>3. Make existing routes your own</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Found a Collection you like? You can edit the route to suit your schedule.</span></figcaption><span> <i>Komoot</i></span></div>\n<p>Have you spotted a bikepacking Collection that has your inner adventurer chomping at the bit but you want to tweak the route, perhaps changing the start or finish points, altering the duration or adding in an extra leg to visit friends or accommodation nearby?</p>\n<p>Thankfully, Komoot makes this easy. You can save the individual Tours (i.e. the individual stages on a multi-day ride) to your own profile and edit the routes to your heart’s content – add in your own Highlights, change the start or finish location, add new waypoints, and drag and drop the course to suit you.</p>\n<p>If you’re heading to an area where phone signal might be patchy, you can save your Tours for offline use, so you can use the Komoot app to navigate without needing an internet signal.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Komoot’s premium multi-day route planner offers options for further customisation.</span></figcaption><span> <i>Komoot</i></span></div>\n<p>If you have a Komoot Premium account, you can click the ‘Plan day by day itinerary’ to adjust the full route into as many days as you like, or reverse the direction of travel.</p>\n<p>The slider here is really useful for demonstrating how far you’ll need to ride each day, based on how many days you choose to split the route into. You’ll also get the maximum elevation gain and an estimate of how long you’ll spend in the saddle each day.</p>\n<p>The multi-day planner saves your Tours in a Collection so you can easily access and share them with your bikepacking pals.</p>\n<p></p>\n<h3>4. Plan your own adventure</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Want to plan your own adventure? Komoot’s route planning algorithm can do the heavy lifting for you.</span></figcaption><span> <i>Komoot</i></span></div>\n<p>If you want to plan your own route from scratch, Komoot has a range of features to help you put together the ideal itinerary. Whether you love planning your adventures in minute detail or have more of a spontaneous approach, Komoot’s route planner includes the tools you need to help you enjoy exploring.</p>\n<p>If you want to plan a new route quickly, you can let Komoot’s algorithm do the heavy lifting for you. First, set the sport type according to what you’d like to ride: road cycling for more direct tarmac routes, road touring for quieter back roads, <a href=\"https://www.bikeradar.com/advertising-feature/what-is-gravel-riding/\">gravel riding</a> for lighter off-road sections or mountain biking for more technical off-road trails.</p>\n<p>Komoot will then plot a ‘Tour’ between your selected start and finish points based on road or trail characteristics. You can also alter the course by adding a Highlight or a new waypoint, or manually dragging and dropping the route.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> You can edit your route to take in Komoot’s user-generated Highlights or seek out points of interest.</span></figcaption><span> <i>Komoot</i></span></div>\n<p>You can also use the search bar to display points of interest and services on the Komoot map. If you’re still in the planning stages then you can include these on your route – or if you’re already on the road, adjust your route on the go to navigate directly to them.</p>\n<p>Some of the nuggets you can find on the map include churches (which often have outside taps for refilling water bottles), public transport, bike repair shops, camping grounds and public toilets.</p>\n<p>Finally, premium members have access to the multi-day planner, where you can split down a longer route into a day-by-day itinerary, adjusting the daily length to suit your ambitions.</p>\n<p>You can also use the multi-day planner to highlight accommodation options at the end of each stage, including campsites, hostels and guesthouses.</p>","author":"Katherine Moore","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"3d13da05f507d2cc4d8e818c1ee25eaa09951e8a00bc2cf3926cc5b56be7d372","category":"Cycling"}