{"title":"Increase Productivity with Tasknest as Daily Log and Project Planner","link":"https://www.preprints.org/manuscript/202406.2054/v1","date":1719634032000,"content":"This research discusses the challenges faced by university students in group work assignments and the importance of effective project management. This article introduces Tasknest, a project management platform that helps teams organize tasks, track progress, and improve communication. This article also reviews related studies on project management applications and discusses the Agile methodology used in the development of Tasknest.  The implementation of the task management system was done using Agile methods and Typescript programming language. This web-based system includes a landing page, dashboard page, board page, and settings page. Black box testing was conducted to ensure the system functions as expected, with tests on login, board creation, adding columns and cards, and others. Overall, the system was successfully implemented and tested.  Tasknest application development includes user stories, acceptance criteria, sprint backlogs, sprint planning, reviews, and retrospectives. System design analysis includes usecase diagram, activity diagram, sequence diagram, and entity relationship diagram. Application features include task list management, team member management, real-time collaboration, notification system integration, task enhancement, in-task checklists, user authentication, UI optimization, performance improvement, collaboration feature enhancement, database design, front-end implementation, and UI design. The Agile Alliance outlines 12 principles for implementing Agile methodologies, which prioritize customer satisfaction, collaboration, and continuous improvement. Agile methodologies offer high flexibility, rapid iteration, responsiveness to change, improved product quality, stakeholder involvement, transparency, and clear responsibilities.   Scrum is a framework that supports Agile principles, with a focus on transparency, inspection, and adaptation. Scrum improves team collaboration, rapid adaptation to change, transparency, visibility, product quality, and team motivation. In the development of the Tasknest application, the Scrum methodology is used, with roles such as Product Owner, Scrum Master, and Development Team. Data collection techniques include interviews, observations, and literature studies, while data testing techniques involve black box testing. Planning using Scrum involves creating a Product Backlog with prioritized features and fixes. Prioritization determines the duration of each sprint.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3d1bdda5d6ba068a64779114a952fad51bd5bb88e477417aa5b566af6412ef52","category":"Interdisciplinary"}