{"title":"How to set macOS to automatically import screenshots into Photos","link":"https://www.macworld.com/article/545235/how-to-set-macos-to-auto-import-screenshots-to-photos.html","date":1635332400000,"content":"<div>\n<section><div></div></section><p>The screen-grab features in macOS have grown more powerful over the years, to the point that Apple removed a standalone app, Grab, and replaced it with just another screenshot mode: Command-Shift-5 invokes the Screenshot app, which is also found in the Utilities folder.</p>\n\n\n\n<p>With the Screenshot configuration view active, you can click the Options menu and choose a destination for all your screenshots and screen movie recordings. But noticeably absent is Photos. I know many people who use screenshots as a way to grab a live or current image of something they’re engaged in and use that later.</p>\n\n\n\n<p>For instance, if you live in Zoom, Teams, or other videoconferencing sessions—or even if you’re a parent who, say, recently went to a remote curriculum night by remote video—you may use screenshots to grab images of material shown on screen that isn’t provided in an easily usable form later.</p>\n\n\n\n<p>The trick to streamline this activity is to have an Automator action manage part of it in the background.</p>\n\n\n\n<p>First, set up an Automator workflow that takes anything dropped into a folder and adds it to Photos:</p>\n\n\n\n<ol><li>Launch Automator.</li><li>Click <em>New Document</em> at the lower-left corner of the Open dialog that appears. (Or, later, click <em>File &gt; New</em>.)</li><li>Select <em>Folder Action</em> and click <em>Choose</em>.</li><li>From the <em>Choose Folder</em> menu in the upper-right corner of the action, select or create a folder that you want this action to monitor.</li><li>Expand the Library item in the list of actions at left, click <em>Finder</em>, and drag <em>Filter Finder Items</em> into the pane at right. You may want to constrain this by adding a condition like “Kind” “Is” “Image”.</li><li>Drag <em>Import Files into Photos</em> into the pane below the Finder action. Set that to add to an album if you like. (Create the album first in Photos, as if you select “Add to a new album named,” Automator will keep creator new albums each time it runs.)</li><li>Choose <em>File &gt; Save</em> and name the action descriptively.</li></ol><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/mac911-automator-add-to-photos-bordered.png?w=1200\" /><figcaption>This Automator action for a folder streamlines taking screenshots and importing them into Photos.</figcaption></figure></div>\n\n\n\n<p>Now you just need to set that folder for screenshots:</p>\n\n\n\n<ol><li>Press Command-Shift-5.</li><li>From the <em>Options</em> menu, choose <em>Other Location</em>.</li><li>Select your watched folder.</li><li>Press <em>Escape</em> to exit the Screenshot mode.</li></ol><p>Whenever you create a screenshot from now on, the Automator action will run without any intervention. You can suspend the action in two ways:</p>\n\n\n\n<ul><li>Press Command-Shift-5 and choose another location from the Options menu.</li><li>Open the Automator action, Control-click the Finder Filter Items action, and choose Disable action, then <em>File &gt; Save</em>. Re-enable when you’re ready to use it again.</li></ul><h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3d1bb93dcacaf3c2557337e6c1df6979886da451a87f776c450c11a5fa5409ff","category":"Apple"}