{"title":"Porsche builds a sporty red wagon: The 2022 Taycan GTS Sport Turismo","link":"https://arstechnica.com/?p=1820567","date":1639522874000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/2022-Taycan-GTS-Sport-Turismo-1-800x483.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/2022-Taycan-GTS-Sport-Turismo-1.jpg\">Enlarge</a> <span>/</span> Porsche's newest electric car variant is the $133,300 Taycan GTS Sport Turismo.  (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Porsche provided flights to Los Angeles and two nights in a hotel so we could drive the Taycan GTS Sport Turismo and the sedan that we wrote about two weeks ago. Ars does not accept paid editorial content.</aside>\n<p>Two weeks ago, we found out how the new <a href=\"https://arstechnica.com/cars/2021/11/the-2022-porsche-taycan-gts-first-drive/\">Porsche Taycan GTS sedan</a> handles some light track work—quite competently, as it turns out. But as I noted at the time, few Taycan GTSes will ever take part in a track day, so how the car drives on the road is more important .</p>\n<p>We didn't get a road drive in the GTS sedan, but we did get a few hours' seat time in that car's new sibling, the $133,300 Taycan GTS Sport Turismo. And for readers who don't speak fluent Porsche, that means this one is a station wagon.</p>\n<p>In fact, this is not even the first battery electric station wagon. I think that honor goes to the Taycan Cross Turismo, which is basically the same bodyshell with the suspension raised a few millimeters, plus some plastic bumper extensions to give it an ersatz off-roader feel. Porsche would say that the Cross Turismo \"exemplifies all-weather, all-road capability\" and that this new Sport Turismo version is focused entirely on on-road performance.</p></div><p><a href=\"https://arstechnica.com/?p=1820567#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1820567&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3d2455c9c32fb22eb34cc4ae423ccd9b2ae7bb7c68e9b5b6e59180bd0312a96e","category":"Tech"}