{"title":"FCC chair to investigate exactly how much everyone hates data caps","link":"https://arstechnica.com/?p=1948619","date":1686937027000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/getty-fcc-chair-rosenworcel-800x533.jpg\" alt=\"FCC Chairwoman Jessica Rosenworcel in a photograph taken at a conference.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/getty-fcc-chair-rosenworcel.jpg\">Enlarge</a> <span>/</span> FCC Chairwoman Jessica Rosenworcel at the Paley International Council Summit at Paley Museum on November 8, 2022, in New York City.  (credit: Getty Images | Steven Ferdman )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Federal Communications Commission Chairwoman Jessica Rosenworcel wants the FCC to open a formal inquiry into how data caps harm Internet users and why broadband providers still impose the caps. The inquiry could eventually lead to the FCC regulating how Internet service providers <a href=\"https://arstechnica.com/tech-policy/2021/12/comcast-delays-data-caps-in-northeast-us-for-at-least-another-year/\">such as Comcast</a> impose limits on data usage.</p>\n<p>Rosenworcel yesterday <a href=\"https://www.fcc.gov/document/chair-rosenworcel-proposes-investigate-impact-data-caps\">announced</a> that she asked fellow commissioners to support a Notice of Inquiry on the topic. Among other things, the Notice would seek comment from the public \"to better understand why the use of data caps continues to persist despite increased broadband needs of consumers and providers' demonstrated technical ability to offer unlimited data plans.\"</p>\n<p>The inquiry would also seek comment on \"trends in consumer data usage... on the impact of data caps on consumers, consumers' experience with data caps, how consumers are informed about data caps on service offerings, and how data caps impact competition.\" Finally, Rosenworcel wants to seek comment about the FCC's \"legal authority to take actions regarding data caps.\"</p></div><p><a href=\"https://arstechnica.com/?p=1948619#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1948619&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3d2825f11c107a398ff81330165c5215567ae37ba89e4bebb3304a55d9c1611c","category":"Tech"}