{"title":"Genetic Characteristics and Pathogenicity for Partial Gene fragment of one Bovine Rotavirus in Yunnan Province, China","link":"https://www.preprints.org/manuscript/202407.0481/v1","date":1720165476000,"content":"Group A rotaviruses (RVA) have been identified as the leading cause of neonatal calf diarrhea (NCD) In Yunnan, China, despite the limited documentation on this issue within the country. Given the significant impact on animal health and welfare, further attention is warranted to comprehend the prevalence and epidemiology of this disease. In this study, we isolated RVA strains from NCD clinical samples  to support RVA epidemic study and further disease control in Yunnan. Material and Methods: Ten fecal samples were obtained from calves with a single episode of neonate calf diarrhea from a farmer during a severe NCD outbreak. For the diagnosis of Group A rotavirus (RVA) infection, fecal reverse transcription-polymerase chain reaction (RT-PCR) was employed as the primary method. Subsequently, RVA isolation was conducted on MA104 cells, with inoculates being pretreated with trypsin TPCK to enhance viral infectivity. The isolated RVA strain was further confirmed through RT-PCR and immunofluorescence assay. Results: RVA virus was isolated from clinical samples following six passages depended on trypsin treatment of inoculates. The sign of CPE detected consisted of increased cell granularity, obscure cell boundaries, cell rounding, and eventual degeneration and detachment of cells. Analysis of sequencing revealed that field isolates was of group A serotype. Phylogenetic analysis based on the ORF sequences of the VP4 and VP7 sequences segments indicated that the isolate was classified as the P[1] genotype. VP4 gene of strain YN-1 shares 75.2%-99.7% nucleotide identity of and 81.6%–99.7% amino acid identity with the complete VP4 sequences of the P[1]. The complete VP7 gene of YN-1 is 981 nucleotide long and encode 326 amino acids. The RotaC v2.0 analysis classified the sequence as the G8 genotype. The VP7 gene of strain YN-1 shares 88.5%-97.7% nucleotide identity and 94.2%-99.1% amino acid identity. Conclusion: This is the first study in China which reports the circulation of Group A NCD on cattle farms in the field. Our study constitutes a crucial and a necessary step allowing preventive and veterinary medicine to support RVA disease controls in Yunnan province, China.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3d293d710072c464c1e020a2ee78251db30cfc5ca92dabdb1b900d684695e80e","category":"Interdisciplinary"}