{"title":"เพราะเหงา เราจึงเป็นขวา","link":"https://markpeak.net/loneliness/","date":1612259403000,"content":"<p>ภาพประกอบจาก <a href=\"https://pixabay.com/photos/mother-depressed-homeless-baby-3477164/\">Pixabay</a></p>\n<p>เจอบทความนี้ <a href=\"https://www.bloomberg.com/news/articles/2021-02-01/loneliness-is-what-drives-some-people-to-the-right-wing\">Loneliness Is What Drives Some People to the Right Wing ใน Bloomberg</a> พูดถึงหนังสือ The Lonely Century: How to Restore Human Connection in a World That’s Pulling Apart ของ Noreena Hertz ที่เริ่มวางขายวันนี้ (2 ก.พ. 2021)</p>\n<p>อ่านแล้วน่าสนใจ เลยไปหารีวิวหรือบทความจากที่อื่นมาประกอบด้วย เจอ<a href=\"https://www.ft.com/content/ffadb189-5661-40c3-b142-43f91cf38bdf\">เจ้าตัวไปเขียนลง FT</a> ตั้งแต่ก่อนเลือกตั้ง ปธน. สหรัฐ 2020 เล็กน้อย นำมาแปะไว้เช่นกัน</p>\n<p>หนังสือเล่มนี้มาจากการศึกษา &#8220;ฝ่ายขวา&#8221; ในหลายประเทศ และพบจุดร่วมเดียวกันคือ &#8220;ความเหงา&#8221; ความโดดเดี่ยว ไม่เป็นส่วนหนึ่งของชุมชน หมู่บ้าน องค์กร ประเทศ พูดง่ายๆ คือถูกทอดทิ้ง ไม่ได้รับความสนใจ</p>\n<blockquote><p>“If you troll through the alt-right [websites], loneliness is a theme that you see time and time again in social media feeds,”</p>\n<p>“I define loneliness broadly to include craving the intimacy and company of friends and family and feeling disconnected from them, and also feeling disconnected from your employer and your government, and feeling uncared for and unsupported,”</p></blockquote>\n<p>เดิมทีถ้าเราพูดถึง &#8220;ความเหงา&#8221; มันเป็นเรื่องของปัจเจกซะมาก เหงาเพราะไม่มีเพื่อน มันเป็นเรื่องส่วนตัวนี่นา</p>\n<blockquote><p>Traditional definitions have cast loneliness in terms of the individual, characterising it as feeling bereft of company, love and intimacy or lacking the support of friends.</p></blockquote>\n<p>อย่างไรก็ตาม ด้วยสภาพเศรษฐกิจสังคมยุคหลัง (โดยเฉพาะหลังปี 2010 เป็นต้นมา) ทำให้คนเหงามากขึ้น มีเพื่อนเยอะ แต่ถ้าเพื่อนไม่เข้าใจก็ไม่มีประโยชน์ Herz ประเมินว่าความเหงาในโลกยุคใหม่เกิดจาก</p>\n<ul>\n<li>smartphone-social network ทำให้ขาดปฏิสัมพันธ์กับคนจริงๆ</li>\n<li>urbanization การย้ายถิ่นเข้าเมืองใหญ่ ไม่มีสังคมในละแวกที่อยู่อาศัย หรือไม่รู้สึกเป็นส่วนหนึ่งของสังคม</li>\n<li>โลกทุนนิยมที่เน้นการแข่งขัน บีบให้คนไม่ร่วมมือกัน</li>\n<li>ภาวะเศรษฐกิจบีบคั้นจนต้องรัดเข็มขัด (austerity) อาชีพดั้งเดิมเจอการแข่งขันจากชาติอื่น (globalization) จากหุ่นยนต์ (automation) และล่าสุดคือโดนกระหน่ำหนักด้วยไวรัส (pandemic) และวิกฤตเศรษฐกิจจากไวรัส</li>\n</ul>\n<p>ความเหงาจึงกลายเป็นวาระแห่งชาติ วาระแห่งโลก และกลายเป็นปัจจัยทางการเมือง</p>\n<blockquote><p>Loneliness is political as well as personal, economic as well as social. It is also about feeling disconnected from our fellow citizens and political leaders, and detached from our work and our employer.</p></blockquote>\n<p>ความเหงาลักษณะนี้ทำให้คนกลุ่มนึงมีแนวโน้มที่จะหัวรุนแรงขึ้น (ทั้งไปทางฝ่ายซ้ายและขวา แต่เป็นฝ่ายขวาซะมาก)</p>\n<blockquote><p>a 2016 poll by the Center for the Study of Elections and Democracy revealed Donald Trump voters to be significantly more likely to report having fewer close friends, fewer acquaintances and to spend fewer hours a week with both than supporters of either Hillary Clinton or Bernie Sanders.</p></blockquote>\n<p>กลุ่มคนเหงายังถูกชักจูงได้ง่ายขึ้น หากใช้วิธีการชักจูงที่ให้ความรู้สึกเข้าอกเข้าใจ เห็นใจ ซึ่ง Trump (และนักการเมืองฝ่ายขวาอื่นๆ) มองเห็นจุดนี้ และทำได้เก่งมาก</p>\n<blockquote><p>Trump’s message to the Capitol invaders when he urged them to go home—“we love you”—was telling, Hertz says. “He used the language of love, parenting, speaking to their sense of forsakenness. ‘I’m the only one who sees you, hears you,’ whether that’s true or not.”</p></blockquote>\n<p>ไม่ใช่แค่คำพูด เพราะแนวทางการจัดกิจกรรม แคมเปญหาเสียงของ Trump ก็เช่นกัน มันเกิด sense of belonging ได้ง่ายกว่า</p>\n<blockquote><p>The sea of red-clad folk, sporting matching “Make America Great Again” hats, badges and T-shirts — these are communal events that make people feel part of something bigger. They provide a sense of identity, a kind of kinship that many of his supporters find increasingly hard to get elsewhere.</p>\n<p>Their success also lies in this: an appeal to the feeling of exclusion and marginalisation that many citizens have come to experience in recent years, a sense of being ignored, even abandoned, by those who hold political and economic power. Think of Trump’s rallying cry that “The forgotten men and women of our country will be forgotten no longer”</p></blockquote>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2149\" src=\"https://markpeak.net/wp-content/uploads/2021/02/the-loneliness-century.jpg\" alt=\"\" width=\"329\" height=\"499\" srcset=\"https://markpeak.net/wp-content/uploads/2021/02/the-loneliness-century.jpg 329w, https://markpeak.net/wp-content/uploads/2021/02/the-loneliness-century-198x300.jpg 198w\" sizes=\"(max-width: 329px) 100vw, 329px\" /></p>\n<p>Hertz อ้างงานเขียนของ Hannah Arendt ปัญญาชนหญิงยุคหลังสงครามโลก ที่ศึกษาสาเหตุของเผด็จการ ในหนังสือ The Origins of Totalitarianism</p>\n<blockquote><p>totalitarianism “bases itself on loneliness, on the experience of not belonging to the world at all, which is among the most radical and desperate experiences of man.”</p>\n<p>Arendt writes that for those characterised by “isolation and lack of normal social relationships . . . it is through surrendering their individual selves to ideology that [they] rediscover their purpose and self-respect”. Loneliness, or “the experience of not belonging to the world at all”, is, Arendt writes, “the essence of totalitarian government . . . the preparation of its executioners and victims”.</p></blockquote>\n<p>ทางแก้ตามที่ผู้เขียน Hertz เสนอ คือ สร้าง &#8220;ชุมชน&#8221; ในระนาบต่างๆ ให้คนเข้ามาเจอกัน คุยกัน คลายความเหงาลงไปได้</p>\n<blockquote><p>So what are her solutions? Deal with “legitimate economic grievances.” Restore the power of labor unions. Restore funding for libraries, youth clubs, day care centers, old-age centers. “People don’t have physical spaces where they can come together,” she says. “There’s a real imperative to reinvest in the infrastructure of community.”</p></blockquote>\n<p>กล่าวโดยสรุปคือเป็นแนวคิดที่น่าสนใจมาก และน่าไปสำรวจต่อ รวมถึงไปหาหนังสือมาอ่านด้วย</p>\n<p>หมายเหตุ: เคยเขียนเรื่องทำนองนี้ไว้ใน Brand Inside ในวันขึ้นต้นทศวรรษ 2020</p>\n<div class=\" content_cards_card content_cards_domain_brandinside-asia\">\n\t\t\t<div class=\"content_cards_image\">\n\t\t\t\t<a class=\"content_cards_image_link\" href=\"https://brandinside.asia/decade-of-depression/\">\n\t\t\t\t\t<img src=\"https://assets.brandinside.asia/uploads/2020/01/depression.jpg\" alt=\"จากทศวรรษที่สาบสูญ สู่ทศวรรษซึมเศร้า | Brand Inside\">\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div class=\"content_cards_title\">\n\t\t<a class=\"content_cards_title_link\" href=\"https://brandinside.asia/decade-of-depression/\">\n\t\t\tจากทศวรรษที่สาบสูญ สู่ทศวรรษซึมเศร้า | Brand Inside\t\t</a>\n\t</div>\n\t<div class=\"content_cards_description\">\n\t\t<a class=\"content_cards_description_link\" href=\"https://brandinside.asia/decade-of-depression/\">\n\t\t\t<p>ทศวรรษ 2010s คือทศวรรษที่สาบสูญ (Lost Decade) ของสังคมไทย จากความขัดแย้งทางการเมือง ส่วนทศวรรษ 2020s ขอนิยามว่ามันคือ \"ทศวรรษซึมเศร้า\" (Decade of Depression)</p>\n\t\t</a>\n\t</div>\n\t<div class=\"content_cards_site_name\">\n\t\t<img src=\"https://brandinside.asia/wp-content/uploads/2016/11/favicon.png\" alt=\"Brand Inside\" class=\"content_cards_favicon\"/>\t\tBrand Inside\t</div>\n</div>The post <a href=\"https://markpeak.net/loneliness/\">เพราะเหงา เราจึงเป็นขวา</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"3d2e802ee90e76f523d3383b99884fa7cc9da613f4e2a1ee82ca1560a7244aaa","category":"Thai"}