{"title":"Apple's Big AI Push Implied By Startup Acquisitions and Job Postings","link":"https://www.macrumors.com/2024/01/24/apple-big-ai-push-startup-acquisitions/","date":1706090488000,"content":"Apple has been quietly making a series of artificial intelligence related acquisitions and staff hires in a bid to bring on-device AI to its next-generation iPhones, claims a new report by the <em><a href=\"https://www.ft.com/content/52839eb2-6641-42a6-acd7-5d41e809c97a\">Financial Times</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/siri-symbol-iphone-feature.jpg\" width=\"850\" height=\"481\" />\r<br />\nAccording to the report, indications suggest Apple has been focusing on \"tackling the technological problem of running AI through mobile devices.\" To that end, it has acquired several AI-related startups, the last one occurring early last year when it purchased California-based WaveOne, which offers AI-powered video compression. \r<br />\n\r<br />\nAccording to a recent research note from Morgan Stanley, almost half of Apple's AI job posts have included the term \"Deep learning,\" which relates to the algorithms used to power generative AI. \r<br />\n\r<br />\nPrevious reports have suggested Apple has been testing its <a href=\"https://www.macrumors.com/2023/07/19/apple-experimenting-with-chatgpt-tool/\">\"Ajax\" large language model</a> (LLM) since early 2023, but in contrast to LLMs like OpenAI's ChatGPT, Apple's primary goal is to develop generative AI that works locally on-device, rather than being powered by cloud services in data centers.\r<br />\n\r<br />\nThe challenge in achieving that aim involves optimizing the LLM while reducing its size, as well as heavier reliance on high-performance mobile hardware and faster Apple silicon chips. For example, Apple is said to be planning a <a href=\"https://www.macrumors.com/2023/12/07/apple-iphone-16-microphone-upgrade-siri-ai/\">significant upgrade</a> to the iPhone 16 microphone to improve a new AI-enhanced Siri experience.\r<br />\n\r<br />\nJust last month, Apple AI researchers said they have made a <a href=\"https://www.macrumors.com/2023/12/21/apple-ai-researchers-run-llms-iphones/\">key breakthrough</a> in deploying large language models (LLMs) on iPhones and other Apple devices with limited memory by inventing an innovative flash memory utilization technique.\r<br />\n\r<br />\nApple is said to be on schedule to announce a series of generative AI-based tools at its Worldwide Developers Conference (WWDC) in June, when iOS 18 will be previewed. Morgan Stanley analysts expect the mobile software will be geared towards enabling generative AI and could include its voice assistant Siri being powered by an LLM.<div>Tags: <a href=\"https://www.macrumors.com/guide/ft-com/\">Financial Times</a>, <a href=\"https://www.macrumors.com/guide/artificial-intelligence/\">Artificial Intelligence</a>, <a href=\"https://www.macrumors.com/guide/apple-gpt/\">Apple GPT</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/24/apple-big-ai-push-startup-acquisitions/\">Apple's Big AI Push Implied By Startup Acquisitions and Job Postings</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-big-ai-push-implied-by-startup-acquisitions-and-job-postings.2417281/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3d3689c4ca8259d6c0a7b0f4a47d4adb40415ad518a805204eb236a3d8518577","category":"Apple"}