{"title":"The impact of climate and management on recent mortality in Pinus pinaster resin-tapped forests of inland Spain","link":"https://academic.oup.com/forestry/article/97/1/120/7161777?rss=1","date":1683936000000,"content":"<span><div>Abstract</div>Recent forest decline and amplified mortality have been documented around the world, mainly triggered by the rising water stress associated with more frequent extreme weather events. However, other abiotic and biotic factors may predispose and contribute to these processes. Mediterranean forests are among the biomes considered highly vulnerable to drought-induced decline and mortality. <span>Pinus pinaster</span> ssp. <span>mesogeensis</span>, is a typical western Mediterranean Forest species widely distributed in Spain, where traditional management has focused on a mixed timber-resin production. In the last decades, the species has experienced a severe and generalized process of decline and mortality, especially on inland areas in the Spanish Northern Plateau. The main objectives of this study were to (1) provide an accurate assessment of <span>P. pinaster</span> mortality in resin-tapped forests within the region, (2) identify the main predisposing and inciting abiotic factors controlling the process of dieback and mortality of the species and (3) develop a model for forecasting the annual rate of mortality at landscape scale. We used operational data collected by the Forest Service during 2012–2019, including annual censuses of tree mortality carried out in lots under resin-tapping and periodical forest management inventories. Analysis using spatiotemporal generalized linear mixed models indicated widespread mortality of the species in the territory, which in some areas reached 20 per cent of the trees over an 8-year period. Tree mortality is triggered in warm and dry years and was accelerated following the extreme droughts of 2017 and 2019. High stand stocking and tree aging have been identified as predisposing factors increasing susceptibility to forest decline and mortality. In addition, stands where the species grows mixed with <span>Pinus pinea</span> are more vulnerable, pointing to a possible displacement of <span>P. pinaster</span> in the territory. The developed spatiotemporal generalized linear mixed model allows unbiased estimates of the annual rate of mortality to be calculated through the territory. The model may be used by forest managers in order to identify the most vulnerable areas where the application of adaption strategies should be prioritized, in order to preserve these forests and their associated provision of ecosystem services.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"3d38a185f94eda448a2a264ce35fe03f3e0f4a5297031b41499adc8eefef454c","category":"Environment"}