{"title":"PSIII-15 Feeding patterns of yearling Angus bulls based on feed efficiency metrics","link":"https://academic.oup.com/jas/article/102/Supplement_3/505/7757733?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The study objective was to determine how feeding behavior relates to feed efficiency in yearling Angus bulls at the Cal Poly Bull test. Bulls (n = 102) were housed in four pens sorted according to initial body weight (BW; 460 ± 35, 407 ± 15, 374 ± 20, 323 ± 30; mean kg ± SD), resulting in 24 to 28 bulls/pen. Feeding behavior was monitored using an electronic feeding system (SmartFeed, C-Lock, Inc.) during an 85-d feed efficiency test. Four feeders in each pen were filled twice daily at approximately 0630 h and 1700 h. The number of visits to the feed bunk, visit duration, total feeding time, and hourly feed intake were determined from data collected from the feeding system. These data were summarized by hour in a 24-h period, across the 85-d period. Bulls were retrospectively classified into a high feed efficiency group (HIFE) and low feed efficiency group (LOFE) based on an assessment of their summed residual feed intake rank and their feed:gain ratio rank. Within each pen, 5 HIFE and 5 LOFE bulls were selected, resulting in 20 bulls/treatment used for the final analyses. Data were analyzed using the MIXED procedure in SAS 9.4. The model included the fixed effects of feed efficiency group (HIFE vs LOFE), hour (0 to 24), and the feed efficiency group × hour interaction. Bull within pen was considered a random effect and hour a repeated measure. LOFE bulls visited the bunk more frequently throughout the day during the entire testing period (<span>P</span> = 0.04). Differences between feed efficiency groups depended on hour and most differences were observed within 3 h of fresh feed delivery (<span>P</span> ≤ 0.02). A feed efficiency group × hour interaction (<span>P</span> &lt; 0.001) indicated that LOFE bulls had longer feed bunk visit durations predominantly between fresh feed deliveries (<span>P</span> ≤ 0.048). LOFE bulls spent more time feeding throughout the entire day (<span>P</span> = 0.003) when compared with HIFE bulls. Feeding duration per hour was longer for LOFE bulls during the post-morning feeding period (7-h duration) and post-evening feeding period (4-h duration; <span>P</span> ≤ 0.045). More feed was consumed by LOFE bulls throughout the day (<span>P</span> &lt; 0.001), particularly during the post-morning feeding period (<span>P</span> ≤ 0.05). Overall, bulls exhibiting decreased feed efficiency had different feeding behavior patterns in all behavioral categories than their more feed efficient counterparts, especially around feed delivery. Thus, more active bulls at the feed bunk were less feed efficient, and this behavioral pattern may be an important consideration in bull selection.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3d380dd02ec569eb806347ae815dfe8ce9156a227151d9ade16fbd7192a9941a","category":"Environment"}