{"title":"Research on the Application of RAP Fine Aggregate Based on HMAC Design Concept","link":"https://www.preprints.org/manuscript/202408.1053/v1","date":1723647178000,"content":"In order to apply RAP fine aggregate to High Modulus Asphalt Concrete(HMAC), this study first extracts aged asphalt from RAP fine aggregate through extraction and distillation, and adds it to high modulus modified asphalt in proportions of 20%, 40%, 60%, and 80%. The performance changes of the recycled asphalt were investigated using conventional performance tests and dynamic shear rheological tests (DSR). Microscopic techniques such as four‐component analysis and infrared spectroscopy were employed to explain macroscopic performance changes in terms of component and functional group changes in the asphalt. Using HMAC‐20 gradation as an example, uniaxial compression dynamic modulus tests, rutting tests, freeze‐thaw splitting tests, and low‐temperature bending tests were conducted to evaluate the performance changes of recycled asphalt mixture with different RAP fine aggregate contents through four indices: dynamic modulus, dynamic stability, tensile strength ratio (TSR), and maximum bending strain. The results indicate that for every 20% increase in aged asphalt, the penetration at 25°C, ductility at 25°C, and dynamic viscosity at 60°C decrease by approximately 6.2%, 15.4%, and 3.9%, respectively, while the softening point increases by approximately 13.3%. It is concluded that the addition of aged asphalt significantly affects the ductility at 25°C and the softening point. As the aged content increases, the complex shear modulus (G*) and phase angle (δ) of the recycled asphalt decrease, while the rutting factor increases. The four‐component analysis and infrared spectroscopy of the asphalt demonstrate that the incorporation of aged asphalt is merely a physical blending phenomenon, involving changes in the content of the four components without the formation of new functional groups (new peaks). When RAP fine aggregate is applied to high modulus recycled asphalt mixture, compared to high modulus modified asphalt mixture, the recycled mixtures exhibit higher dynamic modulus and dynamic stability, but significantly reduced water stability and low‐temperature performance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3d3cd649a63a498c55a0af465572fb2519635833e133f91bf83981d94c8043d1","category":"Interdisciplinary"}