{"title":"Aphid-mediated beet yellows virus transmission initiates proviral gene deregulation in sugar beet at early stages of infection","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311368","date":1727791200000,"content":"<p>by Roxana Hossain, Glenda Willems, Niels Wynant, Simon Borgolte, Kristof Govaerts, Mark Varrelmann</p>\r\n\r\nBeet yellows virus (BYV), one of the causal agents of virus yellows (VY) disease in sugar beet (<i>Beta vulgaris</i> subsp. <i>vulgaris</i>), induces economically important damage to the sugar production in Europe. In the absence of effective natural resistance traits, a deeper understanding of molecular reactions in plants to virus infection is required. In this study, the transcriptional modifications in a BYV susceptible sugar beet genotype following aphid-mediated inoculation on mature leaves were studied at three early infection stages [6, 24 and 72 hours post inoculation (hpi)] using RNA sequencing libraries. On average, 93% of the transcripts could be mapped to the <i>B</i>. <i>vulgaris</i> reference genome RefBeet-1.2.2. In total, 588 differentially expressed genes (DEGs) were identified across the three infection stages. Of these, 370 were up- regulated and 218 down-regulated when individually compared to mock-aphid inoculated leaf samples at the same time point, thereby eliminating the effect of aphid feeding itself. Using MapMan ontology for categorisation of sugar beet transcripts, early differential gene expression identified importance of the BIN categories “enzyme classification”, “RNA biosynthesis”, “cell wall organisation” and “phytohormone action”. A particularly high transcriptional change was found for diverse transcription factors, cell wall regulating proteins, signalling peptides and transporter proteins. 28 DEGs being important in “nutrient uptake”, “lipid metabolism”, “phytohormone action”, “protein homeostasis” and “solute transport”, were represented at more than one infection stage. The RT-qPCR validation of thirteen selected transcripts confirmed that BYV is down-regulating chloroplast-related genes 72 hpi, putatively already paving the way for the induction of yellowing symptoms characteristic for the disease. Our study provides deeper insight into the early interaction between BYV and the economically important crop plant sugar beet and opens up the possibility of using the knowledge of identified proviral plant factors as well as plant defense-related factors for resistance breeding.","author":"Roxana Hossain","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3d431b099c65dfe57dff45ef3f084f73fcc3d24c246eb73fc5650a9ea60bc5f6","category":"Interdisciplinary"}