{"title":"Seasonality of submarine groundwater discharge to an Arctic coastal lagoon","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12585?af=R","date":1718718951000,"content":"<h2>Abstract</h2>\n<p>Supra-permafrost submarine groundwater discharge (SGD) in the Arctic is potentially important for coastal biogeochemistry and will likely increase over the coming decades owing to climate change. Despite this, land-to-ocean material fluxes via SGD in Arctic environments have seldom been quantified. This study used radium (Ra) isotopes to quantify SGD fluxes to an Arctic coastal lagoon (Simpson Lagoon, Alaska) during five sampling periods between 2021 and 2023. Using a Ra mass balance model, we found that the SGD water flux was substantial and dependent on environmental conditions. No measurable SGD was detected during the spring sampling period (June 2022), when the lagoon was partially ice-covered. During ice-free periods, the main driver of SGD in this location is wind-driven lagoon water level changes, not tides, which control surface water recirculation through sediments along the lagoon boundary. A combination of wind strength and direction led to low SGD fluxes in July 2022, with an SGD flux of (6 ± 3) × 10<sup>6</sup> m<sup>3</sup> d<sup>−1</sup>, moderate fluxes in August 2021 and July 2023, which had an average flux of (17 ± 9) × 10<sup>6</sup> m<sup>3</sup> d<sup>−1</sup>, and high fluxes in October 2022, at (79 ± 16) × 10<sup>6</sup> m<sup>3</sup> d<sup>−1</sup>. This work demonstrates how soil and environmental conditions in the Arctic impact Ra mobilization, laying a foundation for future SGD studies in the Arctic and shedding light on the major processes driving Ra fluxes in this important environment.</p>","author":"Emma J. Bullock, \nIsabel V. Schaal, \nM. Bayani Cardenas, \nJames W. McClelland, \nPaul B. Henderson, \nMatthew A. Charette","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"3d44ef5236e9c820e82a0d7a1f607d4721159527fbcd2daed1005e7af865c2fd","category":"Environment"}