{"title":"Efficacy of inverted inner limiting membrane flap technique for macular holes of ≤400 μm: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302481","date":1714399200000,"content":"<p>by Seung Min Lee, Ji Woong Lee, Ji Eun Lee, Hee-young Choi, Jong Soo Lee, Iksoo Byon</p>\r\nPurpose <p>To evaluate the efficacy of inverted internal limiting membrane (ILM) flap technique in full-thickness macular holes (MHs) with a size of ≤400 μm compared to the ILM peeling technique.</p> Methods <p>Related literatures that compared inverted ILM flap and ILM peeling in MHs ≤ 400 μm were reviewed by searching electronic databases including Pubmed, EMbase, ClinicalTrials.gov, and Cochrane Library up to April 2023. The primary outcome measure was hole closure rate, and the secondary outcome measures were the mean postoperative best-corrected visual acuity (BCVA), retinal sensitivity, and outer status of the retinal layers, including the external limiting membrane and ellipsoid zone. The quality of the articles was assessed according to the revised version of the Cochrane risk-of-bias tool for randomized trials or the Newcastle–Ottawa scale. In the case of heterogeneity, a sensitivity analysis was conducted, and publication bias was visually evaluated using a funnel plot.</p> Results <p>This review included six studies with 610 eyes for the primary outcome and 385 eyes for the secondary outcomes, which were two randomized control trials and four retrospective studies. Pooled data revealed that the overall MH closure rate was 99.4% in the inverted ILM flap group and 96.2% in the ILM peeling group, without significant difference between the two groups (odds ratio = 3.91; 95% confidence interval, 0.82~18.69; P = 0.09). The inverted ILM flap technique did not have a favorable effect on the BCVA, retinal sensitivity, or recovery of the outer retinal layers. These results were consistent with those of the subgroup analysis of the different follow-up periods. No significant publication bias was observed.</p> Conclusion <p>In eyes with MHs of ≤400 μm, both techniques demonstrated excellent surgical outcomes without significant differences. Therefore, surgical techniques can be selected according to surgeon preferences.</p>","author":"Seung Min Lee","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3d48615d694ea2f02ede12e2fc66326e6921d2ad440328b94f63e9a0f01d5b5f","category":"Interdisciplinary"}