{"title":"Zygote cryobanking applied to CRISPR/Cas9 microinjection in mice","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306617","date":1720533600000,"content":"<p>by Geraldine Schlapp, María Noel Meikle, Jorge Luis Pórfido, Alejo Menchaca, Martina Crispo</p>\r\n\r\nMicroinjection of CRISPR/Cas9 requires the availability of zygotes that implies animal breeding, superovulation schemes, and embryo collection. Vitrification of zygotes may allow having ready-to-use embryos and to temporally dissociate the workload of embryo production from microinjection. In this study, fresh (F group) or vitrified (V group) zygotes were microinjected with CRISPR/Cas9 system to test the hypothesis that vitrified zygotes could be a suitable source of embryos for microinjection. In Experiment 1 (<i>in vitro</i> evaluation), B6D2F1/J zygotes were microinjected and cultured until blastocyst stage. Embryo survival and cleavage rates after microinjection were similar between groups (~50% and ~80% respectively; P = NS). Development rate was significantly higher for F than V group (55.0% <i>vs</i>. 32.6%, respectively; P&lt;0.05). Mutation rate did not show statistical differences among groups (P = NS). In Experiment 2 (<i>in vivo</i> evaluation), C57BL/6J zygotes were microinjected and transferred to recipient females. Embryo survival was significantly lower in fresh than in vitrified zygotes (49.2% <i>vs</i>. 62.7%, respectively; P&lt;0.05). Cleavage rate did not show statistical differences (~70%; P = NS). Pregnancy rate (70.0% <i>vs</i>. 58.3%) and birth rate (11.9% <i>vs</i>. 11.2%) were not different between groups (F <i>vs</i>. V group; P = NS). Offspring mutation rate was higher for F than V group, in both heterodimer analysis (73.7% <i>vs</i>. 33.3%, respectively; P = 0.015) and Sanger sequencing (89.5% <i>vs</i>. 41.7%, respectively; P = 0.006). In conclusion, vitrified-warmed zygotes present a viable alternative source for CRISPR/Cas9 microinjection when the production of fresh embryos is impeded by limited technical support. The possibility of zygote cryobanking to perform microinjection sessions on demand seems to be a suitable alternative to avoid the breeding and maintenance of animals all over the year, enhancing the implementation of CRISPR technology.","author":"Geraldine Schlapp","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3d4a2f4463f628a8f8f5c87f9979783c9cb4f4295e52371da1ef0a8f342b6456","category":"Interdisciplinary"}