{"title":"‘Trump’s Toast, Folks’","link":"https://www.cato.org/blog/trumps-toast-folks","date":1692238750000,"content":"\n<p>Clark Neily, writing for Cato:</p>\n\n<blockquote>\n  <p>America has seen its fair share of lying politicians, but Donald\nTrump is in a class of his own. He appears to view literally any\ninteraction with another human being as an opportunity to be\nexploited and a game to be won. In Trump’s world, rules are for\nchumps, norms are for losers, and the truth is whatever you can\nget another person to believe — nothing more. And of course,\nhistory makes clear that this approach has been quite effective at\nadvancing Trump’s interests in certain settings — preening on the\nset of a game show, for example, or spinning up a fawning,\nfrothing crowd at a campaign event.</p>\n\n<p>But not only will those antics not work in a courtroom, they will\nbackfire. Given the nature of the allegations against him, Trump\nwill <em>have</em> to take the stand even though he has a right not to,\nand given <em>his</em> nature, he will lie to the jury just like he has\nlied to everyone else his entire life.</p>\n</blockquote>\n\n<p>Nothing new in that description, of course, but as Josh Marshall notes, it’s a “tight and concise run-through”. <a href=\"https://talkingpointsmemo.com/edblog/how-not-to-fall-for-trumps-what-he-believes-nonsense\">Marshall adds</a>:</p>\n\n<blockquote>\n  <p>I note this because Trump’s press conference seems to presage a\nnew and insipid public debate about what Donald Trump <em>really</em>\nbelieves. We’d be remiss if we didn’t note that it’s actually\nirrelevant what Trump believes. Believing the bank owes you money\nisn’t a defense for robbing the bank. But that’s not the core\npoint. Trump’s current antics are like a liar’s version of a fake\ninsanity defense in which the defendant makes a spectacle of\nbizarre behavior to prove his case. Surely, we’re supposed be\nthinking, or rather doubting, he wouldn’t go back to the well,\nprovide yet more evidence for the prosecution, unless he somehow\ntruly believe this stuff.</p>\n\n<p>But Trump doesn’t think of truth or lies the way you or I do. Most\nimperfect people, which is to say all of us, exist in a tension\nbetween what we believe is true and what is good for or pleasing\nto us. If we have strong character we hew closely to the former,\nboth in what we say to others and what we say to ourselves. The\nkey to understanding Trump is that it’s not that he hews toward\nthe latter. It’s that the tension doesn’t exist. What he says is\nsimply what works for him.</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/16/trumps-toast\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"3d4d5f1d3c9f8d80d181adef396642c99767d3f462ada542d6fecf84054a5407","category":"Tech"}