{"title":"Bamboo leaf extract treatment alleviates the surface browning of fresh‐cut apple by regulating membrane lipid metabolism and antioxidant properties","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13181?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The effect of bamboo leaf extract (BLE) on controlling the browning of fresh-cut apple stored at 4 °C was investigated. Browning index, H<sub>2</sub>O<sub>2</sub> content, O<sub>2</sub>\n<sup>−</sup> production rate, malondialdehyde (MDA) contents, total phenolic content (TPC) and soluble quinone content (SQC), the activities of polyphenol oxidase (PPO), peroxidase (POD), lipoxygenase (LOX), superoxide dismutase (SOD), catalase (CAT) and ascorbate peroxidase (APX), DPPH (2,2-diphenyl-2-picryl-hydrazyl) and ABTS [2,2-azinobis(3-ethylbenzothiazoline- 6-sulfonic acid)] radical scavenging activities, and the expression of genes related to browning were all investigated.</p>\n<h2>RESULTS</h2>\n<p>BLE effectively alleviated the surface browning of fresh-cut apple, accompanied by a reduction in SQC, LOX activity, H<sub>2</sub>O<sub>2</sub>, O<sub>2</sub>\n<sup>−</sup> production rate and MDA accumulation. Furthermore, BLE treatment enhanced the TPC, enzymatic (SOD, CAT, APX and POD) and non-enzymatic antioxidant activities. Principal component analysis and Pearson correlation analysis found the browning inhibition by BLE is not through the reduction of phenolic substrates and PPO activity.</p>\n<h2>CONCLUSION</h2>\n<p>BLE controls the browning of fresh-cut apple by increasing the antioxidant capacity to scavenge ROS, which could alleviate oxidative damage and maintain the membrane integrity. © 2023 Society of Chemical Industry.</p>","author":"Yuqi Bin, \nMixia Tian, \nJiani Xie, \nMingyu Wang, \nChen Chen, \nAili Jiang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"3d5d70680e339ddb11c9667672dc43ab686e2716040b8060d5abccf70d3d4912","category":"Environment"}