{"title":"ญี่ปุ่นทำลายสถิติเชื่อมต่อเน็ตเวิร์คเร็วที่สุดในโลก 319 Tb/s ผ่านสายไฟเบอร์ระยะทาง 3,000 กิโลเมตร","link":"https://www.blognone.com/node/123752","date":1626431840000,"content":"<div><div><div><p>วิศวกรจาก KDDI Research ประเทศญี่ปุ่น <a href=\"https://www.ofcconference.org/en-us/home/schedule/?day=Friday#f3b.3\">เปิดเผยผลการทดลอง</a> ส่งข้อมูลดิจิทัลผ่านสายไฟเบอร์ใยแก้วแบบ 4 คอร์ ในงาน Conference on Optical Fiber Communications ที่จัดขึ้นเมื่อเดือนมิถุนายนที่ผ่านมา โดยส่งสัญญาณความเร็ว 319 Tb/s (เทราบิตต่อวินาที) ทำลายสถิติ เดิมที่ <a href=\"https://www.ucl.ac.uk/news/2020/aug/ucl-engineers-set-new-world-record-internet-speed\">University College London เคยทำร่วมกับ Xtera และ KDDI Research เอง ไว้ที่ 178 Tb/s ในปี 2020</a></p>\n<p>การทดลองครั้งนี้เป็นการส่งสัญญาณอินเทอร์เน็ตบนสายไฟเบอร์ออฟติกส์ขนาด 125 ไมโครเมตรจำนวน 4 คอร์ และทดสอบส่งข้อมูลผ่านสายระยะทางกว่า 3,000 กิโลเมตร มีข้อสำคัญคือสายแบบ 4 คอร์นี้สามารถนำมาปรับใช้กับโครงสร้างสายไฟเบอร์ปัจจุบันได้ในอนาคต เนื่องจากมีขนาดไม่ต่างจากสายไฟเบอร์อินเทอร์เน็ตทั่วไป แค่ต้องนำมาดัดแปลงใช้งานกับเทคนิคส่งสัญญาณแบบใหม่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a4d6e1042368e8647e1f7f592df46994.jpg\" /><em>ภาพสายไฟเบอร์ออฟติกส์ทั่วไป</em></p>\n<p>เทคนิคส่งสัญญาณนี้ เริ่มโดยการแบ่งสัญญาณอินเทอร์เน็ตเป็นหลายช่วงคลื่นความถี่ต่างกัน ผ่านเทคนิค wavelength-division multiplexing (WDM)  เพื่อให้ส่งข้อมูลได้มากขึ้น จากนั้นยิงเลเซอร์แบบ 552-channel แยกแต่หลายช่วงคลื่นนี้ ไปผ่าน dual polarization modulation เพื่อให้แต่ละช่วงคลื่นส่งสัญญาณออกไปไม่พร้อมกัน เกิดเป็นลำดับการส่งสัญญาณหลายแบบ</p>\n<p>สัญญาณที่มีลำดับต่างกันนี้ จะถูกแบ่งส่งไปยังคอร์ทั้ง 4 คอร์ของสายไฟเบอร์สลับกัน วิ่งต่อไปเป็นระยะทางราว 70 กิโลเมตร ก่อนจะไปถึงจุดขยายสัญญาณที่ใช้ตัวขยายสัญญาณสองแบบ แบบหนึ่งใช้ธาตุธูเลียม (Thulium-doped) และอีกแบบใช้เออร์เบียม (Erbium-Doped) หลังจากนั้นจึงเดินทางต่อและใช้การขยายสัญญาณแบบรามาน (Raman amplification) ตามปกติ ก่อนจะผ่านสายไฟเบอร์อีกส่วน และกลับไปเริ่มขั้นตอนขยายสัญญาณใหม่อีกครั้ง วนไปจนครบระยะ 3,000 กิโลเมตร</p>\n<p>อย่างไรก็ตาม แม้ขนาดของสายไฟเบอร์ 4 คอร์นี้จะไม่ต่างจากสายไฟเบอร์แบบเดิมมากนัก แต่ขั้นตอนการขยายสัญญาณที่ซับซ้อน ทำให้การอัพเกรดโครงสร้างอาจจะต้องใช้เวลานาน แต่เทคโนโลยีเช่นนี้ก็น่าจะทำให้ผู้ให้บริการอินเทอร์เน็ตที่มีโครงข่ายไฟเบอร์ระดับประเทศหรือระดับทวีปอยู่แล้วสามาารถอัพเกรดโครงสร้างพื้นฐานเพื่อรองรับการใช้งานอินเทอร์เน็บที่นับวันจะขยายตัวขึ้นได้ในอนาคต</p>\n<p>ที่มา - <a href=\"https://interestingengineering.com/japan-shattered-internet-speed-record-319-terabits\">Interesting Engineer</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/japan\">Japan</a></div><div><a href=\"/topics/fiber-optics\">Fiber Optics</a></div><div><a href=\"/topics/internet\">Internet</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3d626dc8665d8ba0093be8af0b07988eca658065ae704e8075647e897e898cbf","category":"Thai"}