{"title":"The role of temperature in vitality and survival assessments of beam-trawled and discarded European plaice (Pleuronectes platessa)","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae036/7692827?rss=1","date":1718236800000,"content":"<span><div>Abstract</div>Thermal stress can influence the recovery of fish released after capture. Vitality assessments using reflex and behavioural responses require that responses can be observed reliably, independent of temperature. Here, we tested whether reflex and behavioural impairment and survival of beam-trawled and discarded European plaice (<span>Pleuronectes platessa</span>) are independent from seasonal air and water temperature deviations. In total, 324 beam-trawled plaice (<span>n</span> = 196 in summer and <span>n</span> = 128 in winter) were exposed to two air temperature treatments and two water treatments (i.e. modified and ambient temperatures for both). The modified treatments (i.e. cooled in summer, warmed in winter) represent the thermal shock a fish may experience when being returned to the water. All reflexes and tested behaviours were affected by ambient temperature, with high impairment noted in summer. None of the reflexes were affected by temperature shocks alone, only body flex was. Body flex was highly impaired under every exposure combination. Fish size and duration of air exposure further influenced impairment of reflexes such as head complex and tail grab. More generally, post-release survival was assessed as 21% [95% CI: 16–28%] in summer and 99% [97–100%] in winter. Beam trawling in summer is likely to induce high reflex impairment and mortality in discarded plaice, and therefore spatial–temporal mitigation approaches should be prioritized over control of on-board temperatures.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"3d63df315a594b2bf890a9b4019eaed7b9a1ec0840efc754290550a84fced7dc","category":"Environment"}