{"title":"PSXI-6 Effects of termite frass inclusion in free range broiler beddings on growth, footpad dermatitis score, and blood profiles","link":"https://academic.oup.com/jas/article/102/Supplement_3/721/7757717?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Research on insects as feed has gained attention in the last decade. Among insect species, we have focused on termites, which degrade lignocellulose and synthesize protein by employing gut microbiota. In particular, the damp-wood termite <span>Hodotermopsis sjostedti</span> subsisting on rotten wood, excretes a substantial portion of wood as frass, serving as their primary nest material. Termite frass, a by-product of termite production, has been found to comprise approximately 83% lignin, suggesting potential antibacterial properties. In this study, the effects of termite frass inclusion in free-range broiler chicken bedding on growth, meat and organ weights, blood profile, and footpad dermatitis (FPD) score were examined. Broiler chicks [n = 30; 0 d of age and initial body weight (BW) = 47.1 ± 0.51 g] were divided into three groups and resided in a 1.3 m<sup>2</sup> pen fed on a commercial diet. The groups were subjected to one of the three bedding treatments: 7.5 kg sawdust (0% frass), 7.5 kg sawdust plus 7.5 kg termite frass (100% frass), and 7.5 kg sawdust plus 15.0 kg termite frass (200% frass). Intakes and BW were measured weekly, and the FPD score was assessed at 3, 5, 6, and 7 wk. At 50 d of age, the chickens were slaughtered for meat and organ weights and blood profile analyses. Growth data, meat and organ weights, and blood profiles were analyzed by GLM of SAS, and the weekly FPD score was analyzed by GLIMMIX as binomial data. Average daily gain and final BW were greater (<span>P</span> &lt; 0.001 and <span>P</span> = 0.003, respectively) in chickens for 0% and 200% frass treatments than in 100%. Thigh and fillet meat weights were similar among the treatments, whereas breasts tended to be lighter (<span>P</span> = 0.064) for 100%. Footpad dermatitis scores tended to be greater (<span>P</span> = 0.085) for 200% than for 100%. Among organ weights tested (e.g., liver, heart, spleen, ventriculus, proventriculus, pancreas, cecum, intestine), heart weight was heavier (<span>P</span> = 0.044), whereas proventriculus was lighter (<span>P</span> = 0.022) for 200% than for 100%. On the other hand, cecum weight tended to be heavier (<span>P</span> = 0.075), and intestine tended to be lighter (<span>P</span> = 0.093) for 0% than for 100% and 200% treatments. Plasma alanine transaminase (ALT) and lactate dehydrogenase (LD) were less (<span>P</span> &lt; 0.001 and <span>P</span> = 0.04, respectively) for 100% and 200% than for 0%. In conclusion, termite frass inclusion in free-range chicken bedding had slightly adverse trends on FPD; however, 200% inclusion did not alter the growth performances of chickens. It also suggested that frass inclusion would have preferable effects on chicken health based on plasma ALT and LD values. Further investigation is required for the different organ weights and their effects, such as heart, proventriculus, cecum, and intestine.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3d655f521618de1a0a7446f535bcd5de07f7050a93bba77a53eb795927ff0ea1","category":"Environment"}