{"title":"Elucidating carbon sources of hydrothermal vent animals using natural 14C abundances and habitat water temperature","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12570?af=R","date":1713596082000,"content":"<h2>Abstract</h2>\n<p>Deep-sea hydrothermal vents host exceptional ecosystems with lush animal communities primarily relying on organic matter (OM) produced by chemoautotrophic microbes. Though energy sources and food webs at vents have been extensively studied, the exact carbon sources of chemosynthetic primary production, such as methane (CH<sub>4</sub>) and carbon dioxide (CO<sub>2</sub>) in the vent fluid or bottom water, have not been elucidated quantitatively across spatial scales. Here, we investigate carbon and nitrogen sources of 12 vent animal species at the Iheya North field, Okinawa Trough inhabiting different distances from the central venting area and with various feeding ecologies using natural-abundance radiocarbon (Δ<sup>14</sup>C) in combination with conventional stable carbon and nitrogen isotope ratios (δ<sup>13</sup>C and δ<sup>15</sup>N). Our results show that generally, animals living closer to vent orifices were more depleted in <sup>14</sup>C, indicating they assimilate more carbon from vent fluid CO<sub>2</sub>. Those relying on methanotrophs, however, exhibited low Δ<sup>14</sup>C values regardless of distance due to the lack of methane in the non-vent-influenced bottom water. Organisms with low Δ<sup>14</sup>C values also tend to exhibit low δ<sup>15</sup>N values, implying NH<sub>4</sub>\n<sup>+</sup> assimilation into biomass in environments with high NH<sub>4</sub>\n<sup>+</sup> concentrations. Our results demonstrate that <sup>14</sup>C can clearly distinguish between chemoautotrophically fixed carbon originating from the vent fluid and detrital OM derived from surface primary production, and also discriminate between CO<sub>2</sub>- and CH<sub>4</sub>-based chemoautotrophy. Although vent animals rely on vent fluid energetically, our results highlight that the dependency on vent fluids as carbon source varies greatly depending on habitat, as well as carbon fixation pathways of microbial primary producers.</p>","author":"Hidetaka Nomaki, \nChong Chen, \nNanako O. Ogawa, \nYosuke Miyairi, \nNaohiko Ohkouchi, \nAkiko Makabe, \nShinsuke Kawagucci, \nYusuke Yokoyama, \nMotohiro Shimanaga","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"3d66b5bbd6575107357b67d42bd1aef8441b09949710ed61c7ee5eeb1aff8a35","category":"Environment"}