{"title":"Gallic acid attenuates metastatic potential of human colorectal cancer cells through the miR‐1247‐3p‐modulated integrin/FAK axis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24087?af=R","date":1709898124000,"content":"<h2>Abstract</h2>\n<p>Colorectal cancer (CRC) exhibits highly metastatic potential even in the early stages of tumor progression. Gallic acid (GA), a common phenolic compound in plants, is known to possess potent antioxidant and anticancer activities, thereby inducing cell death or cell cycle arrest. However, whether GA reduces the invasiveness of CRC cells without inducing cell death remains unclear. Herein, we aimed to investigate the antimetastatic activity of low-dose GA on CRC cells and determine its underlying mechanism. Cell viability and tumorigenicity were analyzed by MTS, cell adhesion, and colony formation assay. Invasiveness was demonstrated using migration and invasion assays. Changes in protein phosphorylation and expression were assessed by Western blot. The involvement of microRNAs was validated by microarray analysis and anti-miR antagonist. Our findings showed that lower dose of GA (≤100 μM) did not affect cell viability but reduced the capabilities of colony formation, cell adhesion, and invasiveness in CRC cells. Cellularly, GA downregulated the cellular level of integrin αV/β3, talin-1, and tensin and diminished the phosphorylated FAK, paxillin, Src, and AKT in DLD-1 cells. Microarray results revealed that GA increased miR-1247-3p expression, and pretreatment of anti-miR antagonist against miR-1247-3p restored the GA-reduced integrin αV/β3 and the GA-inhibited paxillin activation in DLD-1 cells. Consistently, the in vivo xenograft model showed that GA administration inhibited tumor growth and liver metastasis derived from DLD-1 cells. Collectively, our findings indicated that GA inhibited the metastatic capabilities of CRC cells, which may result from the suppression of integrin/FAK axis mediated by miR1247-3p.</p>","author":"Chi‐Chou Huang, \nMing‐Chang Tsai, \nYi‐Liang Wu, \nYi‐Ju Lee, \nAn‐Ting Yen, \nChau‐Jong Wang, \nShao‐Hsuan Kao","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"3d739f3ef9a2580bf8d81709a07a2ba3a81f50a4020bd1050b2fb2945b550f8a","category":"Environment"}