{"title":"ไมโครซอฟท์แจ้งเตือนช่องโหว่เปิดทางผู้ใช้บนวินโดวส์อ่านฐานข้อมูลรหัสผ่านในเครื่อง","link":"https://www.blognone.com/node/123841","date":1626945960000,"content":"<div><div><div><p>ไมโครซอฟท์ตั้งค่าสิทธิ์การเข้าถึงไฟล์ระบบผิดพลาดทำให้ผู้ใช้ที่ล็อกอินทุกคนมีสิทธิ์เข้าถึงไฟล์ใน <code>%windir%\\system32\\config\\</code> ซึ่งรวมถึงไฟล์ sam ที่เป็นฐานข้อมูลรหัสผ่านของผู้ใช้ในระบบด้วย เปิดทางให้ผู้ใช้ที่อ่านไฟล์ได้จะสามารถขโมยค่าแฮชของรหัสผ่านออกมาได้</p>\n<p>ฐานข้อมูล sam นั้นเก็บเฉพาะค่าแฮช NTLM ของวินโดวส์ซึ่งปกติหากฐานข้อมูลหลุดออกไปก็ยังต้องอาศัยการยิงค่าแฮชเพื่อหารหัสผ่านจริง แต่วินโดวส์นั้นยอมให้ผู้ใช้ยืนยันตัวตนด้วยค่าแฮชในบางกรณี จนเป็นกลุ่มการแฮกที่เรียกว่า <a href=\"https://en.wikipedia.org/wiki/Pass_the_hash\">pass the hash</a> แฮกเกอร์สามารถเปลี่ยนรหัสผ่านผู้ใช้โดยใช้เพียงค่าแฮช NTLM เท่านั้น ทำให้แฮกเกอร์ที่อ่านฐานข้อมูล sam ได้จะยึดเครื่องด้วยสิทธิผู้ดูแลระบบได้ทันที</p>\n<p>โดยปกติแล้วฐานข้อมูล sam จะถูกอ่านตลอดเวลาโดยระบบทำให้ผู้ใช้ทั่วไปเปิดไฟล์ไม่ได้แม้จะมีสิทธิ์ อย่างไรก็ดีหากระบบมี shadow volume ผู้ใช้ก็สามารถเข้าถึงไฟล์ shadow ของไฟล์ sam อยู่ดี</p>\n<p>ผู้รายงานช่องโหว่นี้คือ  Jonas Lykkegaard อย่างไรก็ดี Will Dormann และ Jeff McJunkin ระบุว่าไมโครซอฟท์เพิ่งเปลี่ยนสิทธิไฟล์ SAM นี้ใน Windows 10 1809 แต่หากติดตั้งใหม่ด้วยไฟล์ติดตั้งเวอร์ชั่นหลังๆ สิทธิ์ไฟล์ก็ตั้งไว้ถูกต้องแล้ว แสดงว่าไมโครซอฟท์แก้ไขสิทธิ์นี้ไปแล้วแต่ไม่ได้กลับไปแก้เครื่องที่ติดตั้งไว้ก่อนหน้า</p>\n<p>ไมโครซอฟท์ยังไม่ได้ออกแพตช์ แต่ผู้ใช้สามารถรันคำสั่งเพื่อปิดสิทธิ์การเข้าถึงไฟล์ด้วยตัวเอง และควรต้องลบ shadow volume ออกด้วยเพื่อไม่ให้คนร้ายเข้าถึงได้อีก สำหรับผู้ใช้ที่ใช้เครื่องคนเดียวอาจจะไม่มีความเสี่ยงใดเป็นพิเศษนัก</p>\n<p>ที่มา - <a href=\"https://www.bleepingcomputer.com/news/microsoft/new-windows-10-vulnerability-allows-anyone-to-get-admin-privileges/\">Bleeping Computer</a>, <a href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-36934\">Microsoft</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/8f3ec3b71bc8b5d0a50ac69808f67658.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/windows-10\">Windows 10</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3d7e6fc438042606d6788aaefb657019f498d32f37388aaf4b8b345596dac1a0","category":"Thai"}