{"title":"Development and Validation of a Logistic Regression Model to Predict Post-Operative Mortality in Emergency Cardiac Surgeries: A Comprehensive Analysis of Pre-Operative Factors and Model Performance","link":"https://www.preprints.org/manuscript/202407.2002/v1","date":1721893162000,"content":"Objective: The primary objective of this study was to develop a logistic regression model to predict post-operative in-hospital mortality rates for patients undergoing emergency cardiac surgeries, with the aim of improving predictive accuracy over traditional risk assessment tools and enhancing patient outcomes and clinical decision-making. Methods: Data were collected from 4,855 patients who underwent emergency cardiac surgeries at a tertiary hospital between 2008 and 2017. The analysis incorporated demographic, anthropomet- ric, and clinical factors, including the ASA classification, emergency status, and various preoperative laboratory values. A logistic regression model was developed, and the Elixhauser Comorbidity Index was calculated using standard ICD-10 codes for its comprehensive assessment of comorbidities. Model performance was evaluated using metrics such as AUROC, AUPRC, accuracy, precision, recall, and F1 score. Results: The logistic regression model demonstrated strong predictive performance, with an AUROC of 0.939 and an AUPRC of 0.350. Key pre-operative factors identified included emergency operation status, ASA classification, and preoperative prothrombin time. The model significantly outperformed the traditional ASA classification system, which showed an AUROC of 0.524 and an AUPRC of 0.010. These findings suggest a substantial improvement in predicting post-operative mortality. Conclusion: The logistic regression model significantly improves the prediction of post-operative mortality in emergency cardiac surgeries compared to the ASA classification system. These findings highlight the potential of incorporating comprehensive pre-operative factors into predictive models to enhance clinical decision-making and patient outcomes. Implementing such models in routine clinical practice could lead to more accurate risk assessments, better resource allocation, and improved patient care.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3d7f959e59219d2e5f2a6dbc35a13e4e042879f7c03237b07f7985ba48ef2205","category":"Interdisciplinary"}