{"title":"On characterizing gender and locational composition of adult PLHIV in Nigeria: Implications for HIV programming","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002863","date":1724680800000,"content":"<p>by Temitayo V. Lawal, Oyewole K. Oyedele, Nifarta P. Andrew</p>\r\n\r\nHuman Immunodeficiency Virus (HIV) remains a global public health menace, and studies have suggested variations across demographic characteristics. This study attempted to characterize the gender and locational variations in the spread and control of HIV among adult Persons Living with HIV (PLHIV) to identify the clustering of PLHIV in Nigeria. We conducted an ecological analysis of data from the 2018 Nigeria HIV/AIDS Indicator and Impact Survey (NAIIS) report. To examine the statistical significance of differences between groups (by gender and location), chi-square and Fisher exact tests were conducted using the Real Statistics Resource Pack in Excel, and ArcGIS for visualization. Significance level was set at 5%. Overall, prevalence of HIV among adult PLHIV was 1.4%—the prevalence was slightly higher among women (1.8%) compared to men (1.0%). About 3/10 (29.3%) self-reported having received HIV test results. In the past 12 months before the survey, only 10.0% self-reported HIV testing among the population, with a significant difference (p&lt;0.001) observed in the urban and rural area (12.4% in urban compared to 8.2% in rural). Another significant finding was the difference in the timing of HIV diagnosis between urban and rural areas (p&lt;0.001). Adult PLHIV residing in rural areas had a higher rate of early detection (94.1%) compared to those in urban areas (70.3%). About 40.0% of HIV positive mothers reported awareness of their HIV status–approximately 58.0% of mothers living in the urban were aware of their HIV status compared to 29.8% in the rural area. The concentration of HIV was disproportionately higher in the rural populations compared to the urban. Findings from this study also show gender-disparities in HIV prevalence, diagnosis, and treatment. Interventions to bridge this gap should be promptly embraced in order to effectively combat the HIV epidemic in Nigeria and achieve an AIDS-free generation.","author":"Temitayo V. Lawal","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"3d98f9db42cbdb953eec1f6e5d39ba1de59596e13b5a7bd33736ffc289143a03","category":"Environment"}