{"title":"First Clinical Experience with a New Device for the Removal of Cochlear Schwannoma","link":"https://www.preprints.org/manuscript/202404.0866/v1","date":1713160852000,"content":"Background:\n\n\nIn most cases, intra-labyrinthine schwannoma (ILS) occurs in patients with unilateral hearing deterioration or neurofibromatosis type II (NF II). The pattern of localization of these tumors is various but affects mostly the cochlea. Extirpation of the ILS, if hidden by the cochlea modiolus, is difficult under the aspect of complete removal. Therefore, a tissue removal device (TRD) was designed and tested in temporal bones.  The principle of handling the new device is a pushing and pipe cleaner handling inside the cochlea. This present study aimed to describe the first in vivo experience with the newly developed TRD for removing cochlear intra-labyrinthine schwannoma.\n\n\nMethods: \nIn three patients, the TRD was used for the tumor removal of ILS. In two patients with a cochlear schwannoma in combination with a cochlea implantation and one patient suffering from NF II, a cochlear schwannoma was removed with the TRD.  The access was performed with a posterior tympanotomy, an enlarged round window approach, and an additional second-turn access. The device was inserted and extracted gradually from the second turn access until the rings were visible in the second turn access. By pushing and pipe cleaner handling, the tumors were removed. An MRI control was performed on the day postoperatively with a T1 GAD sequence.\n\n\nResults:\n\n\nTumor removal with the TRD was performed in a 15-minute procedure. MRI control confirmed a complete removal on the postoperative day in both cases.\n\n\nConclusion:\n\nIn vivo handling of the device confirmed a straightforward handling for tumor removal. MRI scanning showed a complete removal of the tumor by the TRD.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3db069bdb4b11ef3f5dd543e233ca0d453cad0271b10ac6d5e9f178b817df593","category":"Interdisciplinary"}