{"title":"Genotype distribution and allele frequency of thioester-containing protein 1(Tep1) and its effect on development of <i>Plasmodium</i> oocyst in populations of <i>Anopheles arabiensis</i> in Ethiopia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311783","date":1728482400000,"content":"<p>by Arega Tsegaye, Assalif Demissew, Ashenafi Abossie, Hallelujah Getachew, Kassahun Habtamu, Teshome Degefa, Xiaoming Wang, Ming-Chieh Lee, Daibin Zhong, James W. Kazura, Guiyun Yan, Delenasaw Yewhalaw</p>\r\nBackground <p>Thioester-containing protein 1 (TEP1) is a crucial component of mosquitoes’ natural resistance to parasites. To effectively combat malaria, there is a need to better understand how TEP1 polymorphism affects phenotypic traits during infections. Therefore, the purpose of this study was to determine the Tep1 genotype frequency in malaria vector populations from south-western Ethiopia and investigate its effect on <i>Plasmodium</i> oocyst development in <i>Anopheles arabiensis</i> populations.</p> Methods <p>Using standard dippers, <i>Anopheles</i> mosquito larvae were collected from aquatic habitats in Asendabo, Arjo Dedessa, and Gambella in 2019 and 2020. Collected larvae were reared to adults and identified morphologically. Female <i>An</i>. <i>gambiae</i> s.l. were allowed to feed on infected blood containing the same number of gametocytes obtained from <i>P</i>. <i>falciparum</i> and <i>P</i>. <i>vivax</i> gametocyte-positive individuals using indirect membrane feeding methods. Polymerase Chain Reaction (PCR) was used to identify <i>An</i>. <i>gambiae</i> s.l. sibling species. Three hundred thirty <i>An</i>. <i>gambiae</i> s.l. were genotyped using Restricted Fragment Length Polymorphism (RFLP) PCR and sub samples were sequenced to validate the TEP1 genotyping.</p> Results <p>Among the 330 samples genotyped, two TEP1 alleles, TEP1*S1 (82% frequency) and TEP1*R1 (18% frequency), were identified. Three equivalent genotypes, TEP1*S1/S1, TEP1*R1/R1, and TEP1*S1/R1, had mean frequencies of 65.15%, 2.12%, and 32.73%, respectively. The nucleotide diversity was ranging from 0.36554 to 0. 46751 while haplotype diversity ranged from 0.48871 to 0.63161, across all loci. All sample sites had positive Tajima’s D and Fu’s Fs values. There was a significant difference in the TEP1 allele frequency and genotype frequency among mosquito populations (p &lt; 0.05), except populations of <i>Anopheles arabiensis</i> from Asendabo and Gambella (p &gt; 0.05). In addition, mosquitoes with the TEP1 *RR genotype were susceptible and produced fewer <i>Plasmodium</i> oocysts than mosquitoes with the TEP1 *SR and TEP1 *SS genotypes.</p> Conclusion <p>The alleles identified in populations of <i>An</i>. <i>arabiensis</i> were TEP1*R1 and TEP1*S1. There was no significant variation in TEP1*R1 allele frequency between the high and low transmission areas. Furthermore, <i>An</i>. <i>arabiensis</i> carrying the TEP1*R1 allele was susceptible to <i>Plasmodium</i> infection. Further studies on vector-parasite interactions, particularly on the TEP1 gene, are required for vector control techniques.</p>","author":"Arega Tsegaye","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3dbf69d35584394dd1ef5cc2184f5e04c0008e3a3cadd949736d30ff26da7389","category":"Interdisciplinary"}