{"title":"Women’s autonomy, neonatal, infant and under-five mortality in the Upper East Region of Ghana","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002776","date":1726754400000,"content":"<p>by Fabian Sebastian Achana, Augustine Tanle, David Teye Doku</p>\r\n\r\nChild mortality remains a major health challenge in Sub-Saharan Africa. Child survival is greatly influenced by household circumstances and mother’s healthcare choices. Notwithstanding tremendous investment in women empowerment in Ghana, there is limited empirical evidence on whether women’s autonomy translates into better child mortality outcomes. To examine the association between women’s autonomy and neonatal, infant and under-five mortality in the Upper East Region of Ghana. Data were obtained from a randomized cluster household survey among 15–49 years old women in seven districts in the Upper East Region. Data analysis was restricted to 3,243 women who reported ever having given birth. Based on Principal Component Analysis (PCA), we constructed an autonomy index categorized into least, moderate, and high autonomy based on responses to six questions regarding household decision-making. Bivariate and multivariate logistic regressions were used to assess the association of women’s autonomy status and mortality outcomes. Attaining secondary education or higher was significantly associated with infant mortality (adjusted odds ratio (aOR) = 0.39, CI = 0.16, 0.94) and under-five mortality (aOR = 0.39, CI = 0.18–0.87). Also, maternal age was significantly associated with neonatal, infant, and under-five mortality, while living in rural setting was significantly associated with lower risk of neonatal (aOR = 0.38, CI = 0.19–0.75) and under-five (aOR = 0.63, CI = 0.48–0.83) mortality. However, we found that compared to women with least autonomy, infants of those with moderate autonomy (aOR = 1.76, CI 1.07–2.89) and high autonomy (aOR = 1.75; CI = 1.04–2.93) were significantly more likely to die. In this study setting, women’s autonomy was not predictive of child mortality. Interventions that aim to improve child mortality should pay attention to community and family level factors that promote increase utilization of essential early childhood interventions.","author":"Fabian Sebastian Achana","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"3dc1cf7f17fa685aeb5992af338b8cbbce117e257cb509160b1bfe4377538c5d","category":"Environment"}