{"title":"Apple ไตรมาสล่าสุด ยอดขายรวมโต 29% ทำสถิติใหม่สูงสุดของไตรมาสกันยายน","link":"https://www.blognone.com/node/125545","date":1635464798000,"content":"<div><div><div><p>แอปเปิลรายงานผลประกอบการประจำไตรมาสที่ 4 ตามปีการเงินบริษัท 2021 สิ้นสุดวันที่ 25 กันยายน 2021 รายได้รวมเพิ่มขึ้น 29% เทียบกับช่วงเวลาเดียวกันในปีก่อนเป็น 83,360 ล้านดอลลาร์ ซึ่งเป็นสถิติสูงสุดประจำไตรมาสเดือนกันยายน โดยมีกำไรสุทธิ 20,551 ล้านดอลลาร์</p>\n<p>iPhone ขายได้รวม 38,868 ล้านดอลลาร์ เพิ่มขึ้น 47% จากช่วงเดียวกันในปีก่อน Mac ขายได้ 9,178 ล้านดอลลาร์ เพิ่มขึ้น 1.6% (สถิติสูงสุด) iPad 8,252 ล้านดอลลาร์ เพิ่มขึ้น 21% กลุ่มสินค้า Wearables, Home and Accessories 8,785 ล้านดอลลาร์ เพิ่มขึ้น 12% และกลุ่มธุรกิจ Services รายได้ 18,277 ล้านดอลลาร์ เพิ่มขึ้น 12% (สถิติสูงสุด)</p>\n<p>ประเด็นอื่นที่น่าสนใจจากช่วงแถลงผลประกอบการ โดยซีอีโอ Tim Cook และซีเอฟโอ Luca Maestri มีดังนี้</p>\n<ul>\n<li>ผลกระทบจากชิปขาดแคลน ตลอดจนปัญหาโควิด 19 ที่กระทบการผลิต ทำให้แอปเปิลเสียโอกาสจากยอดขายถึง 6 พันล้านดอลลาร์ ในไตรมาสที่ผ่านมา และมองว่าปัญหานี้ยังมีอยู่ในไตรมาสปัจจุบัน</li>\n<li>สินค้าที่จะได้รับผลกระทบมากที่สุดในไตรมาสธันวาคมคือ iPad</li>\n<li>ยอดขายเติบโตในทุกภูมิภาคทั่วโลก</li>\n<li>แอปเปิลมีเงินสดและรายการเทียบเท่าเงินสด 1.91 แสนล้านดอลลาร์</li>\n<li>จำนวนลูกค้าที่จ่ายเงินให้ Subscription บนแพลตฟอร์มมีจำนวน 745 ล้านบัญชี เพิ่มขึ้นมา 160 ล้านบัญชี เทียบกับ 12 เดือนที่แล้ว</li>\n</ul>\n<p>ที่มา: <a href=\"https://www.apple.com/newsroom/2021/10/apple-reports-fourth-quarter-results/\">แอปเปิล</a>, <a href=\"https://www.cnbc.com/2021/10/28/apple-aapl-q4-2021-earnings.html\">CNBC</a> และ <a href=\"https://www.macrumors.com/2021/10/28/apple-4q-2021-earnings/\">MacRumors</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/830569a1fd29a0b915d2f91664a83b48.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3dcd9d011017c3a439866edaff384db17efbb738554374f1dc9e4634206393d2","category":"Thai"}