{"title":"Apple Music comes to PlayStation 5 in new subscriber push","link":"https://www.macworld.com/article/547752/how-to-apple-music-playstation-5.html","date":1635350950000,"content":"<div>\n<section><div></div></section><p>If you’re a PS5 gamer who subscribes to Apple Music, your worlds are finally synced. Sony announced on Wednesday that Apple Music subscribers who own a PlayStation 5 can now <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blog.playstation.com/2021/10/27/apple-music-launches-on-ps5-today/&amp;xcust=1-1-547752-1-0-0&amp;sref=https://www.macworld.com/feed\">access the music streaming service</a> directly through the console. To stream Apple Music before or during a game, users can press the PS button on the DualSense wireless controller to access the Control Center and select the Music Function card. Apple Music will recommend songs that match the game, or users can choose a playlist.</p>\n\n\n\n<p>Users can also watch music videos through the service, and if you decide to start playing a game, the audio from the video will continue to play in the background. When you go back to the video, it will pick up from where the song is currently playing.</p>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/apple-music-playstation-5.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure></div><p>Sony Interactive</p></div>\n\n\n\n<p>To access Apple Music, you need a <a href=\"https://www.macworld.com/article/225687/apple-music-faq-the-ins-and-outs-of-apples-new-streaming-music-service.html\">subscription</a> to the service, and then you need to download the Apple Music app to the PlayStation 5. On the console, go to your media home and select <em>All Apps</em>. Then select <em>Apple Music</em>, and then <em>Download</em>. Once you launch the app, you need to sign in with your credentials.</p>\n\n\n\n<p>The PlayStation 5 is the first gaming console to support Apple Music. This release comes after Apple recently announced the $5 <a href=\"https://www.macworld.com/article/545351/apple-music-voice-plan-homepod-mini-colors.html\">Apple Music Voice Plan</a> that includes new mood and activity <a href=\"https://www.macworld.com/article/546546/apple-music-mood-and-activity-playlists-available.html\">playlists</a>, though it’s unlikely that plan will work here. There is no word as to whether Xbox or Nintendo Switch will follow suit.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3dd2212f103bb32a332416016c6a8cfb4f54b899a124f0e9ff3828945be898d5","category":"Apple"}