{"title":"The rumour mill: a wild week of Jumbo-Visma and Soudal–Quick-Step speculation","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-transfer-season-to-remember","date":1696060801000,"content":"\n      <p><strong><em>This article is from our Rouleur Dispatches newsletter. <a href=\"https://www.rouleur.cc/pages/the-rouleur-newsletter\">Sign-up here</a> to receive it every Saturday straight to your inbox.</em></strong></p>\n<p><span>Cycling has a way of doing things like this. Just as the race season was dying down, and cycling journalists were starting to put their pens – ok, keyboards – to rest after a busy year of writing about bike racing, stories have emerged that have shaken the entire sport. They have been unprecedented, surprising, and some of them have brought concerns about the fragility of cycling’s business model to the surface, once again.</span></p>\n<div></div>\n<div></div>\n<p><span>At </span><i><span>Rouleur</span></i><span>, we’re not about news snippets or securing the biggest scoops, but instead, we try to take time to digest what’s happened, or what we’ve read, to see how we can offer a different perspective. Over the past week, there’s been a hell of a lot to think about. The first curveball was thrown last week by Belgian news outlet </span><i><span>WielerFlits</span></i><span>: Jumbo-Visma and Soudal–Quick-Step could be planning a merger which has the potential to transform the WorldTour.</span></p>\n<p><span>This news has, like for most people involved in the cycling world, occupied my thoughts constantly in recent days. I’ve been writing about other things, interviewing other riders, doing kit reviews, and helping to get our next issue to press, but bubbling away in the background I haven’t stopped thinking about the uncertainty of what the men’s professional peloton will look like next season. Two of cycling’s super teams coming together as one? What about the riders out of contract? What about the staff out of jobs? What will the dynamic be in races? Could this end up being a team that will monopolise both the Grand Tours and the one-day Classics? Primož Roglič, Remco Evenepoel and Jonas Vingegaard all riding in the same jersey? Would that really ever happen at all?</span></p>\n<p><span>In the face of all these questions, we’ve been offered very little in the way of answers. Perhaps Jumbo-Visma and Patrick Lefevere’s silence speaks volumes – neither party has confirmed, but more importantly, have not </span><i><span>denied</span></i><span>, that there’s truth in the rumours. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1657327882.jpg?v=1695980852\" /></span><span>And in all of the speculation, whispers and sensationalist headlines, it has not slipped my mind that there are real people involved here, too. Everyone is talking about the impact that this merger could have on the likes of Evenepoel or Roglič or Vingegaard, but the truth is that riders like them will emerge from it all unscathed – each will have big money contracts on the table from virtually any team they wish. It is the livelihoods of team staff members like mechanics, soigneurs, and physiotherapists which are being shaken, not to mention the lesser known riders on Jumbo and Quick-Step – those who thought they had signed to one of the best teams in the world – now left in the dark about their futures.</span></p>\n<p><span>This merger story was only the first in the Jumbo-Visma off-season saga, too, which has seen enough drama to be in the run-in for a Netflix series of its own. It has since been revealed on the Dutch TV show, </span><i><span>Vandaag Inside</span></i><span> (Today Inside), that Amazon would step in as a co-title sponsor for the team next year. Whether that’s of a newly formed Visma-Quick-Step or of the team on its own, is still a mystery. There’s also murmurs of Roglič being on the transfer market, free from his contract after being stung by his team’s decision to not offer him leadership at the Vuelta a España this year. </span></p>\n<p><span>With all the guesswork, intrigue and speculation, some call this time of year cycling’s silly season. 2023 is verging on the obscene.</span></p>\n<p><span>So, that dream of an off-season for journalists, where the drama and action dies down for a couple of weeks for us to enjoy some TLC, is looking unlikely as the controversy just keeps on brewing. There’s undoubtedly a lot more to be revealed about the potential of a Visma-Quick-Step super-team next season and whatever else may come from these wild few weeks. </span></p>\n<p><span>Hold onto your hats, sports fans – cycling might be about to change forever.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3dd315395adbb3ecfb489668195570ff27d0f39c8402fc862a1149ae8e1828a5","category":"Cycling"}