{"title":"Genetic background of adaptation of Crimean-Congo haemorrhagic fever virus to the different tick hosts","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302224","date":1714053600000,"content":"<p>by Seyma S. Celina, Jiří Černý</p>\r\n\r\nCrimean-Congo haemorrhagic fever orthonairovirus (CCHFV) is a negative-sense, single-stranded RNA virus with a segmented genome and the causative agent of a severe Crimean-Congo haemorrhagic fever (CCHF) disease. The virus is transmitted mainly by tick species in <i>Hyalomma</i> genus but other ticks such as representatives of genera <i>Dermacentor</i> and <i>Rhipicephalus</i> may also be involved in virus life cycle. To improve our understanding of CCHFV adaptation to its tick species, we compared nucleotide composition and codon usage patterns among the all CCHFV strains i) which sequences and other metadata as locality of collection and date of isolation are available in GenBank and ii) which were isolated from in-field collected tick species. These criteria fulfilled 70 sequences (24 coding for S, 23 for M, and 23 for L segment) of virus isolates originating from different representatives of <i>Hyalomma</i> and <i>Rhipicephalus</i> genera. Phylogenetic analyses confirmed that <i>Hyalomma-</i> and <i>Rhipicephalus-</i>originating CCHFV isolates belong to phylogenetically distinct CCHFV clades. Analyses of nucleotide composition among the <i>Hyalomma-</i> and <i>Rhipicephalus-</i>originating CCHFV isolates also showed significant differences, mainly in nucleotides located at the 3<sup>rd</sup> codon positions indicating changes in codon usage among these lineages. Analyses of codon adaptation index (CAI), effective number of codons (ENC), and other codon usage statistics revealed significant differences between <i>Hyalomma</i>- and <i>Rhipicephalus</i>-isolated CCHFV strains. Despite both sets of strains displayed a higher adaptation to use codons that are preferred by <i>Hyalomma</i> ticks than <i>Rhipicephalus</i> ticks, there were distinct codon usage preferences observed between the two tick species. These findings suggest that over the course of its long co-evolution with tick vectors, CCHFV has optimized its codon usage to efficiently utilize translational resources of <i>Hyalomma</i> species.","author":"Seyma S. Celina","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3dd3bb934d7192729211531253034a3cdba828fa73c62a1d12f458a80ccd1465","category":"Interdisciplinary"}