{"title":"N6‐Methyladenosine reader HNRNPC‐mediated downregulation of circITCH prevents miR‐224‐3p sequestering and contributes to tumorigenesis in nasopharyngeal carcinoma","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24139?af=R","date":1706780365000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>N6-Methyladenosine (m6A) RNA methylation modulators are implicated in nasopharyngeal carcinoma (NPC). Circular RNAs (circRNAs) stimulate/inhibit the development of NPC by sponging microRNAs (miRNAs). Herein, m6A modifications affecting the circRNA/miRNA axis in NPC were explored.</p>\n<h2>Methods</h2>\n<p>Twenty prognostic m6A RNA methylation regulators were identified from 504 head/neck squamous cell carcinoma and 44 normal samples from The Cancer Genome Atlas (TCGA). Differentially expressed miRNAs were screened from the TCGA and Gene Expression Omnibus (GEO) databases. RNA-binding protein (RBP)–circRNA and circRNA–miRNA interactive pairs were verified using RBPmap and RNAhybrid, respectively. The RBP/circRNA/miRNA network was constructed using Cytoscape. Furthermore, CircITCH (hsa_circ_00059948), HNRNPC, and miR-224-3p expressions were detected by western blotting and quantitative polymerase chain reaction. The role of circITCH in NPC was examined using apoptosis, scratch wound healing, transwell invasion, and cell counting kit-8 assays. Finally, CircITCH–miR-224-3p and circITCH–HNRNPC interactions were assessed by dual-luciferase reporter and RNA-immunoprecipitation (RIP) assays, respectively.</p>\n<h2>Results</h2>\n<p>Bioinformatics analysis revealed that high pathological grade, late-stage tumors, and low survival were associated with increased HNRNPC expression. MiR-224-3p was upregulated in NPC and sequestered by circITCH. Construction of the RBP/circRNA/miRNA network highlighted the HNRNPC/circITCH/miR-224-3p axis. In vitro experiments demonstrated decreased circITCH expression and increased HNRNPC and miR-224-3p expressions in NPC. In NPC cells overexpressing circITCH, HNRNPC and miR-224-3p expressions were significantly decreased. Dual-luciferase assays demonstrated a targeting relationship between circITCH and miR-224-3p, and RIP assays demonstrated interaction of HNRNPC targets with circITCH.</p>\n<h2>Conclusion</h2>\n<p>CircITCH overexpression inhibited NPC progression by sequestering miR-224-3p, and HNRNPC reduced circITCH expression through direct interaction.</p>","author":"Qiang Zhou, \nWei Song, \nXianhui Li, \nJinyan Lin, \nChuansai Zhu, \nLonghe Cao, \nWanqing Li, \nSen Lin","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"3ddfa9d284ba450c2541e854ae5b6d6a8f42a9e25f44eb8b7ebef555eb5277a6","category":"Environment"}