{"title":"Identifying and validating necroptosis‐associated features to predict clinical outcome and immunotherapy response in patients with glioblastoma","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24309?af=R","date":1724157509000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Necroptosis is a type of programmed cell death involved in the pathogenesis of cancers. This work developed a prognostic glioblastoma (GBM) model based on necroptosis-related genes.</p>\n<h2>Methods</h2>\n<p>RNA-Seq data were collected from the TCGA database. The “WGCNA” method was used to identify co-expression modules, based on which GO and KEGG analyses were conducted. A protein–protein interaction (PPI) network was compiled. The number of key prognostic genes was reduced applying COX regression and least absolute shrinkage and selection operator (LASSO) analysis to build a RiskScore model. Differences in immune microenvironments were assessed using CIBERSORT, ESTIMATE, MCP-count, and TIMER databases. The potential impact of key prognostic genes on GBM was validated by cellular experiments.</p>\n<h2>Results</h2>\n<p>GBM patients in the higher necroptosis score group had higher immune scores and worse survival. The Brown module, which was closely related to the necroptosis score, was considered as a key gene module. Three key genes (GZMB, PLAUR, SOCS3) were obtained by performing regression analysis on the five clusters. The RiskScore model was significantly, positively, correlated with necroptosis score. Low-risk patients could benefit from immunotherapy, while high-risk patients may be more suitable to take multiple chemotherapy drugs. The nomogram showed strong performance in survival prediction. GZMB, PLAUR, and SOCS3 played key roles in GBM development. Among them, high-expressed GZMB was related to the invasive and migratory abilities of GBM cells.</p>\n<h2>Conclusions</h2>\n<p>A genetic signature associated with necroptosis was developed, and we constructed a RiskScore model to provide reference for predicting clinical outcomes and immunotherapy responses of patients with GBM.</p>","author":"Qinghua Yuan, \nWeida Gao, \nMian Guo, \nBo Liu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"3de06668692d3d77671eefe0010c15c3acaa78d8c32a6b8f774e508366768d17","category":"Environment"}