{"title":"198 Discovery of key functional SNP markers associated with feed efficiency in beef cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/35/7757229?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Beef production contributes to approximately 2.4% of the total Greenhouse Gas emissions in Canada. Improving beef cattle feed efficiency (FE) may lead to improved energy partitioning and resource use, thereby improving the sustainability of the beef industry. Our objective was to identify differentially expressed key regulatory genes and associated novel functional SNP markers linked to FE in Canadian beef cattle using RNA-Sequencing (RNA-Seq) of rumen tissue collected from 48 beef cattle [n = 16 Angus, n = 16 Charolais, n = 16 Kinsella (Composite Hybrid including Angus, Charolais, Galloway, Hereford, Holstein, Brown Swiss, and Simmental)] selected for extreme FE phenotypes. In total, 11 key regulatory genes (MYH1, MYL2, MYLPF, TNNC2, EIF4B, RHOD, TCEANC, CKM, ENSBTAG00000040518, SERPINB2, and USP43) were significantly differentially expressed (DE) between extreme Residual Feed Intake (RFI) groups (low-RFI n = 8, high-RFI n = 8 per breed) using CLC Genomics Workbench (FDR &lt; 0.05; |FC| &gt;2). Using an optimized RNA-Seq variant calling pipeline using STAR and BCFtools, a total of [total (unique to low-RFI, unique to high-RFI)] 75 (36, 39), 78 (42, 36), and 53 (35, 18) uniquely fixed functional SNPs were located within coding regions of these 11 functional candidate genes, in low- and high-RFI animals in the Angus, Charolais, and Kinsella breeds, respectively. Considering all functional SNPs uniquely identified in low- or high-RFI groups for all breed comparisons, the majority of SNPs were identified in MYH1, EIF4B, and SERPINB2 genes, which function together in metabolically demanding biological processes (<span>P</span> &lt; 0.05) related to muscle contraction, muscle system, and muscle filament function processes. Additionally, EIF4B and SERPINB2 genes were found to have a role in signaling pathways that coordinate cell growth and immune function, respectively. Using RNA-Seq to identify key regulatory genes and associated functional SNPs linked to FE may uncover important genetic markers that influence the regulation of FE in beef cattle.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3de9d2f178e41efb7d3c1a2dfa782a7999318f11a99338aad7e186fb033cd3e7","category":"Environment"}