{"title":"Verizon customers could have a pretty big refund check headed their way","link":"https://www.macworld.com/article/2195607/iphone-verizon-lawsuit-settlement.html","date":1704820463000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>You know those fees you pay each month on your wireless phone bill alongside descriptions like Admin or Telco? If you subscribe to Verizon you may be getting some of them back.</p>\n\n\n\n<p>Verizon has settled a class-action lawsuit over administrative charges for $100 million that will be paid out to Verizon customers who “received postpaid wireless or data services from Verizon and who were charged and paid an Administrative Charge between January 1, 2016, and November 8, 2023.” That’s basically anyone who has a normal wireless plan.</p>\n\n\n\n<p>There are still several steps before your check will be in the mail, however. Anyone who had Verizon service during those dates can file a claim by April 15, 2024, on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.verizonadministrativechargesettlement.com/home&amp;xcust=1-1-2195607-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Verizon Administrative Charge Settlement site</a>. You’ll need your Notice ID and Confirmation Code, which you’ll see at the top of the email from the Verizon Class Action Settlement Administrator. If you haven’t received an email by January 16 (check your junk mail as well), you can email the settlement administrator.</p>\n\n\n\n<p>As per the settlement terms, Verizon doesn’t admit to any wrongdoing and will, in fact, continue to charge the fees going forward.</p>\n\n\n\n<p>Payments are capped at $100 after an initial minimum allocated amount of $15 per account plus $1 for each month the account was charged and paid an Administrative Charge and/or an Administrative and Telco Recovery Charge between the settlement dates, a total of 95 months. All account holders must submit a claim by the deadline to receive a payment.</p>\n\n\n\n<p>Payments will be sent out “after the settlement is approved and becomes final,” which is scheduled for a final hearing on March 22. However, it could still take years for checks to reach customers. Apple settled its “Batterygate” suit back in 2020 and payments only began <a href=\"https://www.macworld.com/article/2030996/your-batterygate-check-is-finally-in-the-mail-and-its-a-lot-bigger-than-you-thought.html\">arriving this week</a>.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3df0baf9c805dfc032eaf1f50c02440a7d30eeebd6e2e93d12a8845d2a7fc3ca","category":"Apple"}