{"title":"'Noticeable' Price Rises Expected Amid Increased Chip Costs","link":"https://www.macrumors.com/2021/09/06/noticeable-price-rises-expected/","date":1630942671000,"content":"Apple will need to pay more for the chips in its devices and may pass rising costs on to customers, according to sources speaking to <a href=\"https://asia.nikkei.com/Business/Tech/Semiconductors/Chip-prices-set-to-rise-into-2022-as-TSMC-hikes-rates\"><em>Nikkei Asia</em></a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg\" />\r\n<br />\r\nTSMC, Apple's main chip supplier, is in the process of increasing its prices following wider inflation caused by the global chip supply shortage. TSMC's planned price rises are said to be the biggest chip price hikes in a decade.\r\n<br />\r\n\r\n<br />\r\nTSMC was already around 20 percent more expensive than its rivals, but smaller foundries have ramped up their own prices due to higher material and logistics costs, and TSMC has committed to $100 billion in new investment over the next three years, motivating the company to increase its prices so that these added costs can be passed on to clients.\r\n<br />\r\n\r\n<br />\r\nTSMC is reportedly also keen to stop its clients from ordering more chips than they need in the hope of securing production line space and support from contract chipmakers, which has made it difficult for the company to understand real demand. Clients will need to negotiate specific terms for manufacturing before the price rises officially take effect from October 1.\r\n<br />\r\n\r\n<br />\r\nThe company is still working through existing orders, meaning that the impact of the price rises will be felt much more acutely next year when production capacity has expanded and existing orders have been completed. Sources speaking to <em>Nikkei</em> said that chip developers such as Qualcomm will pass TSMC's price increases onto device makers such as Apple. TSMC also supplies Apple directly with the likes of the A14 and <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> chips.\r\n<br />\r\n\r\n<br />\r\nThe effect on retail prices for devices such as smartphones and computers is expected to be \"noticeable.\" It is speculated that many consumer electronics brands will increase the prices of their high-end models next year to offset the impact on mid-range and entry-level devices.\r\n<br />\r\n\r\n<br />\r\nChip prices are expected to remain high while clients push for smaller fabrication and more advanced chip production processes. Other sources said that the market should correct once demand falls since chipmakers will need to lower prices to \"to lure more clients and maintain utilization rates.\"\r\n<br />\r\n\r\n<br />\r\nLate last month, <em>DigiTimes</em> reported that these price rises could hit sooner than expected, with the <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> lineup being <a href=\"https://www.macrumors.com/2021/08/26/iphone-13-price-increase-chip-production/\">more expensive</a> due to increased chip costs.<div>Tags: <a href=\"https://www.macrumors.com/guide/tsmc/\">TSMC</a>, <a href=\"https://www.macrumors.com/guide/nikkei-com/\">nikkei.com</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/06/noticeable-price-rises-expected/\">'Noticeable' Price Rises Expected Amid Increased Chip Costs</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/noticeable-price-rises-expected-amid-increased-chip-costs.2309874/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=FUavF5IZ7q0:0hIbEIN4-MA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=FUavF5IZ7q0:0hIbEIN4-MA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/FUavF5IZ7q0\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3df2ddfc01fdba881bf6d8a53914813a3385de0f2e62307b0f03d2b5054fe4b6","category":"Apple"}