{"title":"A bidirectional reversible and multilevel location privacy protection method based on attribute encryption","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309990","date":1725631200000,"content":"<p>by Zhaowei Hu, Kaiyi Hu, Milu Md Khaled Hasan</p>\r\n\r\nVarious methods such as k-anonymity and differential privacy have been proposed to safeguard users’ private information in the publication of location service data. However, these typically employ a rigid “all-or-nothing” privacy standard that fails to accommodate users’ more nuanced and multi-level privacy-related needs. Data is irrecoverable once anonymized, leading to a permanent reduction in location data quality, in turn significantly diminishing data utility. In the paper, a novel, bidirectional and multi-layered location privacy protection method based on attribute encryption is proposed. This method offers layered, reversible, and fine-grained privacy safeguards. A hierarchical privacy protection scheme incorporates various layers of dummy information, using an access structure tree to encrypt identifiers for these dummies. Multi-level location privacy protection is achieved after adding varying amounts of dummy information at different hierarchical levels N. This allows for precise control over the de-anonymization process, where users may adjust the granularity of anonymized data based on their own trust levels for multi-level location privacy protection. This method includes an access policy which functions via an attribute encryption-based access control system, generating decryption keys for data identifiers according to user attributes, facilitating a reversible transformation between data anonymity and de-anonymity. The complexities associated with key generation, distribution, and management are thus markedly reduced. Experimental comparisons with existing methods demonstrate that the proposed method effectively balances service quality and location privacy, providing users with multi-level and reversible privacy protection services.","author":"Zhaowei Hu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3df5a018cbdabf7a565fdf10c592813dd3cbd33038fde58a7633d1aec0d48e6e","category":"Interdisciplinary"}