{"title":"Google Now Testing Generative AI for Search","link":"https://www.macrumors.com/2023/05/25/google-ai-search/","date":1685041131000,"content":"Google <a href=\"https://blog.google/products/search/search-generative-ai-tips/\">today announced</a> that it is <a href=\"https://labs.google.com/search/install\">opening up access to Search Labs</a>, allowing testers to try out its new Search Generative Experience. The AI-powered Search option is limited to those who have signed up to be a part of Google Labs, with Google letting in a small number of people who have joined the <a href=\"https://labs.google.com/search/install\">Google Labs Waitlist</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/google-search-ai.jpg\" alt width=\"1436\" height=\"666\" />\r<br />\nAI for search is a feature that Google announced during <a href=\"https://www.macrumors.com/2023/05/10/google-io-pixel-fold-ai-announcements/\">its I/O developer conference</a> earlier in May.\r<br />\n\r<br />\nGoogle says that AI Search is designed to \"take some of the work out of searching,\" which can make it easier for users to understand new topics, uncover different viewpoints, and \"get things done more easily.\"\r<br />\n\r<br />\nGoogle suggests that AI search can break down complicated searches into smaller parts, offer quick tips for specific questions, and provide background on what should be considered when searching for items to buy.\r<br />\n\r<br />\nThe addition of generative AI to search is a new concept for Google, and the company says that it will be making \"many updates and improvements over time\" based on user feedback. Access is limited to those in the U.S. right now, with the Google app or Chrome desktop browser required. Google customers eligible to use Google Labs will receive an email.<div>Tag: <a href=\"https://www.macrumors.com/guide/google/\">Google</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/25/google-ai-search/\">Google Now Testing Generative AI for Search</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/google-now-testing-generative-ai-for-search.2390537/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3dfed1e8359de363551c0a8bb62d87c47f9d4ad2a717851e5de2d6f9aaab7e45","category":"Apple"}