{"title":"Biogeographic isolation and climate shape the evolutionary heritage of Neotropical inselbergs","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13860?af=R","date":1721196440000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Quaternary climatic shifts can explain the current distribution of ancient ecosystems as well as the current distributions of gradients that hold species richness and diversity of several lineages in old, climatically buffered, infertile landscapes (OCBILs) as inselbergs. Thus, the combination of phylogenetic approaches and temporal landscape connectivity allows disentangling the mechanisms involved in the origin of the disjunct distribution of plant species and the evolutionary heritage of Neotropical inselbergs.</p>\n<h2>Location</h2>\n<p>Brazilian Atlantic Forest and Caatinga.</p>\n<h2>Time Period</h2>\n<p>Pliocene until the current period.</p>\n<h2>Major Taxa</h2>\n<p>Angiosperms.</p>\n<h2>Methods</h2>\n<p>We used a compiled data set of 42 inselbergs across the Atlantic Forest and Caatinga biomes in eastern Brazil to describe their structure and phylogenetic diversity and map the landscape resistance distances and the effects of resistance on their phylogenetic beta diversity. We also aimed to identify the effectiveness of protected areas and gaps in the conservation of plant species in Brazilian inselbergs.</p>\n<h2>Results</h2>\n<p>We found evidence of dispersal limitation in the inselberg species pool and a latitudinal gradient in plant species richness and phylogenetic diversity across the Neotropical inselberg landscape, with greater isolation between the northeastern and southeastern core areas. Our findings indicate that inselbergs can lead to a high turnover of phylogenetic diversity, thus imposing distinctiveness on the evolutionary lineages of the inselberg flora.</p>\n<h2>Main Conclusions</h2>\n<p>Our results suggest that the current distribution of inselberg's flora in isolated ecosystems may result from a more connected distribution of this flora in the past, as postulated by the Pleistocene habitat fluctuations. However, the patterns of diversity have probably been influenced by events much older than Quaternary climate shifts, due to inselbergs climate stability areas (refugia) since ancient periods. Conservation of mountain vegetation is a crucial strategy for maintaining biodiversity and distinct phylogenetic lineages in the current rapid global climate and land use change scenario.</p>","author":"Herval Vieira Pinto‐Junior, \nGustavo Heringer, \nÉcio Souza Diniz, \nLarissa Areal de Carvalho Müller, \nPedro Manuel Villa, \nJoão Augusto Alves Meira‐Neto, \nAndreza Viana Neri","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"3e1803f3e62091f6a05c0bedeef11d631bdb06d7dd999bf878e9ac81cb53d1ce","category":"Environment"}