{"title":"Prediction of total volatile basic nitrogen (TVB‐N) in fish meal using a metal‐oxide semiconductor electronic nose based on the VMD‐SSA‐LSTM algorithm","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13618?af=R","date":1716966000000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The total volatile basic nitrogen (TVB-N) is the main indicator for evaluating the freshness of fish meal, and accurate detection and monitoring of TVB-N is of great significance for the health of animals and humans. Here, to realize fast and accurate identification of TVB-N, in this article, a self-developed electronic nose (e-nose) was used, and the mapping relationship between the gas sensor response characteristic information and TVB-N value was established to complete the freshness detection.</p>\n<h2>RESULTS</h2>\n<p>The TVB-N variation curve was decomposed into seven subsequences with different frequency scales by means of variational mode decomposition (VMD). Each subsequence was modelled using different long short-term memory (LSTM) models, and finally, the final TVB-N prediction result was obtained by adding the prediction results based on different frequency components. To improve the performance of the LSTM, the sparrow search algorithm (SSA) was used to optimize the number of hidden units, learning rate and regularization coefficient of LSTM. The prediction results indicated that the high accuracy was obtained by the VMD-LSTM model optimized by SSA in predicting TVB-N. The coefficient of determination (<i>R</i>\n<sup>2</sup>), the root-mean-squared error (RMSE) and relative standard deviation (RSD) between the predicted value and the actual value of TVBN were 0.91, 0.115 and 6.39%.</p>\n<h2>CONCLUSIONS</h2>\n<p>This method improves the performance of e-nose in detecting the freshness of fish meal and provides a reference for the quality detection of e-nose in other materials. © 2024 Society of Chemical Industry.</p>","author":"Pei Li, \nZhaopeng Li, \nYangting Hu, \nShiya Huang, \nNa Yu, \nZhiyou Niu, \nZhenhe Wang, \nHua Zhou, \nXia Sun","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"3e1eac971b4e966337ac9e7dabed08ac44fa2a2619186f0dcf7fe0fa1f2acd49","category":"Environment"}