{"title":"Effects of Vitamin E on Immune Response, Antioxidant Capacity, and Liver Tissue Structure of Crucian Carp under Acute Cold Stress","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/2579785?af=R","date":1702627200000,"content":"<p>The purpose of this study was to investigate the effects of vitamin E addition to the water column on immune response, antioxidant capacity, and liver tissue structure of crucian carp (<i>Carassius auratus</i>) under acute cold stress. Crucian carp was placed in the aqueous solution of control group (E1), negative control group (E2), and 100 mg/L vitamin E (E3) and cooled from 20 to 5°C by cold acclimation intelligent cooling device. Samples were taken at three temperature points of 20, 10, and 5°C, respectively, and the samples were detected and analyzed. The results showed that the content of each index increased under acute cold stress. The contents of white blood cell, red blood cell, hemoglobin, platelet, lysozyme, and glutathione peroxidase in E3 treatment group were significantly lower than those in E1 and E2 treatment groups (<i>P</i> &lt; 0.05). The contents of cholinesterase, alkaline phosphatase, acid phosphatase, hydrogen peroxide, superoxide anion, superoxide dismutase, peroxidase, and malondialdehyde in E3 treatment group were significantly lower than those in E1 and E2 treatment groups (<i>P</i> &lt; 0.01). Under acute cold stress, the liver tissue structure of crucian carp also changed, such as hepatocyte vacuolization, and the damage degree of E3 treatment group was lower than that of E1 and E2 treatment groups. In summary, the addition of vitamin E in water to treat crucian carp can reduce the harm caused by acute cold stress to its body and provide a theoretical reference for the application of vitamin E in water to alleviate fish stress.</p>","author":"Jiaming Tang, \nChangfeng Zhang, \nLexia Jiang, \nDongjie Chen, \nPeihong Jiang, \nBaosheng Huang, \nJanice Ragaza","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"3e25440c0b8892ba509a38b86e906f958834b02f272049cd88e3e3c08111e421","category":"Environment"}