{"title":"Survival and population size of the Indo‐Pacific humpback dolphins off the eastern Leizhou Peninsula","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13156?af=R","date":1720162800000,"content":"<h2>Abstract</h2>\n<p>Indo-Pacific humpback dolphins form a resident population off the east coast of Leizhou Peninsula (LZP) in South China. The most recent study suggested ~1,500 individuals in this area, making this population one of only two populations of this species exceeding 1,000 individuals. However, demographic information regarding this population has been lacking since 2012. Using a 5-year (2019–2023) photo-identification data set, we examined two key demographic parameters of the LZP population, namely the apparent survival and population size, using multistate capture-recapture analyses. Annual survival probabilities (φ) changed over time, fluctuating between 0.942 and 0.961 for adults, and between 0.787 and 0.837 for juveniles. Jolly-Seber multistate model analyses resulted in highly comparable noncalf population size estimates from 2020 to 2023 (N̂$$ \\hat{N} $$<sub>2020</sub> = 479, <i>SE</i> = 28; N̂$$ \\hat{N} $$<sub>2021</sub> = 458, <i>SE</i> = 29; N̂$$ \\hat{N} $$<sub>2022</sub> = 481, <i>SE</i> = 27; N̂$$ \\hat{N} $$<sub>2023</sub> = 446, <i>SE</i> = 31). By reviewing the available demographic information, we conclude that the population size of LZP humpback dolphins has been previously overestimated. The time-dependent survivals seemingly reflect a dynamic development of anthropogenic disturbance during the pandemic period. We propose that the population status should be re-evaluated, especially in the postpandemic era when the human activities came back to “normal” levels.</p>","author":"Wenzhi Lin, \nShenglan Chen, \nBinshuai Liu, \nRuiqiang Zheng, \nAgathe Serres, \nMingli Lin, \nMingming Liu, \nSonghai Li","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"3e27a2c3f8ba292ffc0eed7692d086b9b852c107f71ff2b99acd018d00b0e4a4","category":"Environment"}