{"title":"Comparison of Evapotranspiration Values Calculated with Empirical Methods and ETgage Measurements","link":"https://www.preprints.org/manuscript/202404.0790/v1","date":1712827575000,"content":"Measuring reference evapotranspiration (ETo) is a difficult and costly process. Several parameters are needed to calculate it from meteorological parameters with the aid of some developed equations. There may be variable microclimates in some regions and these are often quite far from the climate stations. Therefore, for ETo, it is better to prefer local measurements rather than relying on regional values. ETo is of great importance for all water-related sectors. It is the primary factor designating the amount of irrigation water to be applied to the plant rootzone in agricultural activities. The amount of irrigation water to be applied is determined by correcting ETo value with the plant coefficient (kc) and irrigation efficiency. There have been many developments in measurement/calculation of ETo in recent years and it is expected that there will be more in the future. Within the scope of this study, ETo values measured with ETgage equipment were compared with the monthly ETo values calculated with the use of Thornthwaite, Blaney-Criddle, Cropwat (FAO Penman Monteith), Jensen-Haise and ASCE standardized Penman Monteith (ASCE SZ PM) methods. In terms of total ETo value, Thornthwaite (17%) and Jensen-Haise (14%) methods yielded lower values than ETgage readings. On the other hand, Blaney-Criddle (15%), Cropwat FAO PM (10%) and ASCE SZ PM (30%) methods yielded greater values than ETgage readings. Among the calculation methods, in Cropwat software, FAO PM equation yielded the closest value to ETgage readings. It was concluded based on present findings that ETgage equipment could reliably be used in determination of ETo.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3e2b387e642fc2bda24bb0430e2574e90d6aed4d4428f77074ec3caf52d8d19b","category":"Interdisciplinary"}