{"title":"X sues hate speech researchers whose “scare campaign” spooked Twitter advertisers","link":"https://arstechnica.com/?p=1958122","date":1690914572000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1258889118-800x534.jpg\" alt=\"X sues hate speech researchers whose “scare campaign” spooked Twitter advertisers\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1258889118.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/elon-musk-billionaire-and-chief-executive-officer-of-tesla-news-photo/1258889118\">Bloomberg / Contributor | Bloomberg</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>As Twitter continues its rebrand as X, it looks like Elon Musk hopes to quash any claims that the platform under its new name is allowing rampant hate speech to fester. Yesterday, X Corp <a>sued</a> a nonprofit, the Center for Countering Digital Hate (CCDH), for allegedly \"actively working to assert false and misleading claims\" regarding spiking levels of hate speech on X and successfully \"encouraging advertisers to pause investment on the platform,\" Twitter's <a href=\"https://blog.twitter.com/en_us/topics/company/2023/a-new-era-of-transparency-for-twitter1\">blog</a> said.</p>\n<p>In its complaint, X Corp. claims that CCDH's reports have caused an estimated tens of millions in advertising revenue loss. The company said it's aware of \"at least eight\" specific organizations, including large, multinational corporations, that \"immediately paused their advertising spend on X based on CCDH’s reports and articles.\" X also claimed that \"at least five\" companies \"paused their plans for future advertising spend\" and three companies decided not to reactivate campaigns, all allegedly basing decisions to stop spending due to CCDH's reporting.</p>\n<p>X is alleging that CCDH is being secretly funded by foreign governments and X competitors to lob this attack on the platform, as well as claiming that CCDH is actively working to censor opposing viewpoints on the platform. Here, X is echoing statements of US Senator Josh Hawley (R-Mo.), who accused the CCDH of being a \"foreign dark money group\" in 2021—following a <a href=\"https://counterhate.com/research/the-disinformation-dozen/\">CCDH report</a> on 12 social media accounts responsible for 65 percent of COVID-19 vaccine misinformation, <a href=\"https://www.foxbusiness.com/politics/hawley-vaccine-misinformation-dark-money-group\">Fox Business reported.</a></p></div><p><a href=\"https://arstechnica.com/?p=1958122#p3\">Read 33 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1958122&amp;comments=1\">Comments</a></p>","author":"Ashley Belanger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3e2cd1ffb944baf126b41a1c4ce7e2de5f5469318ab73af5eb4ea3fa37db4cc6","category":"Tech"}