{"title":"Estimating alcohol and tobacco consumption of university students and urban population in Ho Chi Minh City by wastewater analysis","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11083?af=R","date":1721804400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/29ec9b8a-2c73-4b68-bac5-e914fcc97aca/wer11083-toc-0001-m.png\" alt=\"Estimating alcohol and tobacco consumption of university students and urban population in Ho Chi Minh City by wastewater analysis\" />\n<p>This WBE study highlights the high smoking rate among Vietnamese adults and, for the first time, provides evidence-based warnings about nicotine addiction among university students. The existence of household septic tanks within Vietnam's drainage systems may prevent reliable estimation of alcohol consumption for the entire population.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The quantitative measurement of urinary biomarkers in wastewater has emerged as a robust tool for estimating alcohol and tobacco consumption in populations. In this study, we applied the wastewater-based epidemiology (WBE) approach to compare alcohol and tobacco use between university students and urban inhabitants in Ho Chi Minh City, Vietnam. Ethyl sulfate and cotinine serve as markers for alcohol and tobacco use, respectively. Our findings reveal that urban inhabitants aged 15 and above consume 1.56 ± 0.23 mL of pure ethanol and 2.8 ± 0.33 mg of nicotine per day, while university students consume 0.69 ± 0.13 mL of pure alcohol and 1.2 ± 0.2 mg of nicotine per day. This indicates that, on average, students consume less alcohol and tobacco compared with urban adults. A Monte Carlo simulation indicated that, on average, university students in our study smoke 1.5 cigarettes per day, while urban residents aged 15 and above smoke 4.3 cigarettes per day. Considering the smoking prevalence, a student smoker in this study consumes 6.5 cigarettes per day, a level high enough to establish addiction. On the other hand, alcohol use estimation is significantly lower than previous survey-based reports, likely due to degradation within on-site septic tanks. Future research should aim to extend the sampling period to capture seasonal variations and improve the understanding of tobacco and alcohol consumption patterns. The results from this study are crucial for decision-makers in Ho Chi Minh City to develop effective public health strategies and interventions.</p>\n<h2>Practitioner Points</h2>\n<p>\nWastewater-based approach is applicable to estimate the tobacco consumption in Ho Chi Minh City.\nEach current smoker in the urban area of Ho Chi Minh City smokes nearly a package a day.\nThe estimated consumption for student smokers in U-town is 6.5 cigarettes per day, a level high enough to establish addiction.\nThe existence of septic tanks within Vietnam's drainage systems prevents reliable estimation of alcohol consumption for the entire population.\n</p>","author":"Do Thi Thuy Quyen, \nTran Thi Yen Nhi, \nNguyen Thi Thanh Nhon, \nTo Thi Hien","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"3e2daa59adea484f7c8575b4d4b4298ada30e0b6af7f6a19e7468480bac6f50e","category":"Environment"}