{"title":"Tracking Intracellular Proteins of Interest with Cryo-Electron Microscopy","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.387/7720493?rss=1","date":1721779200000,"content":"<span>The goal of this research is to find a straightforward way to track proteins of interest in cryo-electron microscopy (cryo-EM). Many tags have been developed to label proteins in room temperature electron microscopy. One of these tags is the metallothionein (MT) tag developed by Mercogliano and DeRosier [<a href=\"#ozae044.387-B1\">1</a>] and used in transmission electron microscopy (TEM) by Risco <span>et al</span> [<a href=\"#ozae044.387-B2\">2</a>]. MT is a small, 61 amino acid protein that tightly binds to metal atoms. When gold salts are added to live cells, the gold forms nanoclusters on the MT tag and allows the protein of interest to be visualized in electron microscopy. However, the use of gold salts to label proteins for room temperature EM has some caveats. The cells cannot be heavily stained since the presence of other heavy metal stains masks the signal from the gold nanoclusters [<a href=\"#ozae044.387-B2\">2</a>]. This decreases the amount of ultrastructural context of the protein. Furthermore, the MT labeling is not compatible with all embedding resins. To overcome these limitations, we will use the MT tag in cryo-EM, which eliminates the need for both heavy metal staining and resin embedding. As additional benefits, cryo-EM can achieve higher resolutions than room temperature EM and avoids shrinkage artifacts that can occur during chemical fixation and dehydration prior to resin embedding. As a proof-of-concept study, we have tagged the Kirsten rat sarcoma virus (KRAS) protein with MT. Based on previous electron microscopy with the APEX [<a href=\"#ozae044.387-B3\">3</a>] label, which cannot be used with cryo-EM, we know that this protein is primarily found on the filopodia of cells (Figure 1). In order to see whether the gold salts can be visualized in cryo-EM at the expected subcellular location, cells were grown on gold TEM grids. Some cells were transfected with an MT-tagged KRAS plasmid, and others were untransfected. Both transfected and untransfected cells were treated with gold salts. The cells were washed twice before plunge freezing and visualized with cryo-EM (Figure 2). The transfected cells showed dark clusters on the filopodia while the untransfected cells did not, despite both sets of cells being treated with gold salt. The gold nanoclusters are still small, and this method is heavily dependent on transfection and expression efficiency, which is difficult to assess prior to plunge freezing using the previously published MT method [<a href=\"#ozae044.387-B2\">2</a>]. To further build upon this labeling method, we have synthesized fluorescent gold nanoparticles (Figure 3) using previously described methods [<a href=\"#ozae044.387-B4\">4</a>]. This modification facilitates a quick assessment of transfection efficiency involving the tagged protein, prior to the critical step of plunge freezing and EM experiments. Moreover, it enables the utilization of correlated light and electron microscopy (CLEM) to track the MT-tagged protein of interest within the cellular milieu [<a href=\"#ozae044.387-B5\">5</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"3e2e2fbae085b4b0bdc25cfaadd1cedc7de7d6fe267ab5fde7a72ba597040f2e","category":"Environment"}