{"title":"Primoz Roglic wins stage 6 of Paris-Nice: Daily News","link":"https://cyclingtips.com/2021/03/primoz-roglic-wins-stage-6-of-paris-nice-daily-news/","date":1615573514000,"content":"<p>Dear CyclingTips readers,</p>\n\n\n\n<p>All three races today were action-packed. </p>\n\n\n\n<p>The Healthy Ageing Tour suffered horrendous weather and the general classification came down to the wire. In France, the winner was both unexpected and also completely expected. And in Italy the three most popular riders continued to steal the show.</p>\n\n\n\n<p>Read on for more from the world of cycling. </p>\n\n\n\n<p><em>Associate Editor</em><br><em>Abby Mickey</em></p>\n\n\n\n<h2>What&#8217;s News?</h2>\n\n\n\n<h3>Ellen van Dijk wins the Healthy Ageing Tour, Uneken claims final stage</h3>\n\n\n\n<p>Ellen van Dijk narrowly secured the general classification victory after an aggressive and exciting final stage of the Healthy Ageing Tour. </p>\n\n\n\n<p>Lonneke Uneken rode an impressive race, spending the whole stage in the breakaway before heading off solo to take the stage victory. Behind Uneken, Emma Norsgaard continued to show good form, finishing second on the stage and moving into third overall. Lisa Brennauer finished third on the day and held on to her second place in the GC.</p>\n\n\n\n<p>A strong breakaway featuring Norsgaard, fourth in the general classification at the start of the stage, and Jolien D&#8217;hoore, who won stage 1, went clear early in the race. Norsgaard and D&#8217;hoore were joined by Loretta Hanson, Anna Henderson, and Uneken. </p>\n\n\n\n<p>Behind the breakaway, Trek-Segafredo patroled the peloton, and with each ascent of the Vam-berg the team of race leader Van Dijk started to crack. Eventually, Van Dijk was left with only Chloe Hosking to help keep the breakaway in check. As the race closed in on the final 35 km Hanson sat up from the breakaway to return to the peloton and help with the chase. </p>\n\n\n\n<p>The gap dropped below half a minute as the short climb and fast chase did serious damage to the peloton. With 36 km to go, Lisa Klein attacked taking Candian national champion Karol-Ann Canuel with her. The duo only had 14 seconds between themselves and the five leaders. On the Vam-berg Canuel left Klein behind and joined the breakaway. </p>\n\n\n\n<p>With Canuel in the break, the race situation started to shift. D&#8217;hoore returned to the peloton as the rain picked up and the escapee&#8217;s advantage hovered around 20 seconds.</p>\n\n\n\n<p>An attack by Christine Majerus with 25 km to go shattered the peloton causing groups of twos and threes to chase each other down on the descent of the Vam-berg. Majerus joined the breakaway with Van Dijk, Elise Chabbey, and Amy Pieters. With the addition of Majerus and Pieters SD Worx had four riders in the nine rider breakaway and was keen to keep the break going. </p>\n\n\n\n<p>When Uneken attacked around 23 km to go the SD Worx rider was quick to distance herself from her breakaway companions and with three laps remaining Uneken had secured an advantage of 1 minute and 13 seconds. There was no active chase from the eight favourites behind Uneken so they were caught by the peloton with 13 km to go. As the race regrouped behind Uneken, Klein immediately launched an attack, setting off to chase down the lone leader on her own. </p>\n\n\n\n<p>Uneken&#8217;s gap to the peloton was three minutes into the final 10 km of the race with Klein in between the leader and the chasing peloton led by Hanson and Ceratizit-WNT. </p>\n\n\n\n<p>Into the final lap of the race, Lisa Brennauer made a move over the Vam-berg. The German national champion was followed by Norsgaard, Pieters, and Alice Barnes. Van Dijk struggled to remain in contact with Brennauer who was only 23 second behind the Dutchwoman in the general classification. </p>\n\n\n\n<p>Van Dijk caught the challenging group with 2.5 km to go and worked with the two Canyon-SRAM riders to bring down the gap to Uneken. </p>\n\n\n\n<p>Uneken, having spent the entire race in the breakaway, struggled to keep her two-minute advantage on Van Dijk and her companions but was able to finish off the day with an impressive stage victory atop the Vam-berg. </p>\n\n\n\n<p>Behind Uneken, Norsgaard was the first of the chasers to attack. The Danish champion was marked closely by Brennauer, who started the day with only 8 seconds advantage on the young rider. The fourth rider across the finish line was Van Dijk, emptying the tank to win the overall of the Healthy Ageing Tour. </p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/bsytrFw8Krs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p><strong>Top 10, Stage 3</strong></p>\n\n\n\n<p>1 UNEKEN Lonneke (SD Worx) 3:32:13<br>2 NORSGAARD Emma (Movistar Team) +1:14<br>3 BRENNAUER Lisa (Ceratizit &#8211; WNT) <em>st</em><br>4 VAN DIJK Ellen (Trek &#8211; Segafredo) +1:29<br>5 KLEIN List (Canyon &#8211; SRAM) +1:33<br>6 PIETERS Amy (SD Worx) +1:35<br>7 BARNES Alice (Canyon &#8211; SRAM) +1:40<br>8 VAN DER HULST Amber (Parkhotel Valkenburg) +2:20<br>9 GEORGI Pfeiffer (Team DSM) +2:54<br>10 LACH Marta (Ceratizit &#8211; WNT) +2:58</p>\n\n\n\n<p><strong>Top 10, GC</strong></p>\n\n\n\n<p>1 VAN DIJK Ellen (Trek &#8211; Segafredo)<br>2 BRENNAUER Lisa (Ceratizit &#8211; WNT) +0:06<br>3 NORSGAARD Emma (Movistar Team) +0:12<br>4 UNEKEN Lonneke (SD Worx) +0:20<br>5 PIETERS Amy (SD Worx) +0:29<br>6 KLEIN Lisa (Canyon &#8211; SRAM) +0:43<br>7 BARNES Alice (Canyon &#8211; SRAM) +0:56<br>8 BEEKHUIS Teuntje (Team Jumbo &#8211; Visma) +2:42<br>9 VAN DER HULST Amber (Parkhotel Valkenburg) <em>st</em><br>10 HENDERSON Anna (Team Jumbo &#8211; Visma) +2:50</p>\n\n\n\n<h3>Primoz Roglic wins Paris-Nice stage 6</h3>\n\n\n\n<p>Primoz Roglic notched some additional seconds in his bid for overall victory at Paris-Nice by winning stage 6 into Biot. Christophe Laporte and Michael Matthews finished second and third on the stage, respectively.</p>\n\n\n\n<p>The day started fast, with the first hour averaging 48 kph, so it took a while for a breakaway to form. Eventually six riders rode clear of the peloton, but Team BikeExchange, eager to give Matthews a shot at a stage victory, kept the escapees within catching distance. The speed and undulating terrain eliminated most of the pure sprinters, but Sam Bennett was able to remain in the bunch throughout the days climbs.</p>\n\n\n\n<p>Unfortunately, Brandon McNulty, who started the day third in the general classification, was forced to abandon the race due to a crash. </p>\n\n\n\n<p>The breakaway, with roughly a minute and a half advantage, fell apart with 30 km to go. One by one riders dropped from the break leaving Kenny Elissonde to go on alone. Elissonde rode solo until 14 km to go when Jonas Rutsch rocketed out of the peloton and up to the lone leader. </p>\n\n\n\n<p>Still, the two could not stay away. Elissonde, having spent all day ahead of the race, was the first of the two to return to the peloton. Rutsch was reabsorbed with 1 km to go. The final, seemingly insignificant, climb to the finish was just enough to crack the sprinters that remained, most notably Sam Bennett who came to a standstill in the final 600 meters from the effort. </p>\n\n\n\n<p>What had appeared to be a day for a punchy rider ended up being a day for the general classification leader, and Primoz Roglic won the stage ahead of Laporte and Matthews. </p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/uK1tO5jwZOE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p><strong>Top 10, Stage</strong> <strong>6</strong></p>\n\n\n\n<p>1 ROGLIC Primoz (Team Jumbo-Visma) 4:40:22<br>2 LAPORTE Christophe (Cofidis, Solutions Crédits) st<br>3 MATTHEWS Michael (Team BikeExchange) st<br>4 TEUNS Dylan (Bahrain &#8211; Victorious) st<br>5 PARET-PEINTRE Aurélien (AG2R Citroën) st<br>6 HAMILTON Lucas (Team BikeExchange) st<br>7 COQUARD Bryan (B&amp;B Hotels p/b KTM) st<br>8 PACHER Quentin (B&amp;B Hotels p/b KTM) st<br>9 HENAO Sergio (Team Qhubeka Assos) st<br>10 NEILANDS Krists (Israel Start-Up Nation) st</p>\n\n\n\n<p><strong>Top 10, GC</strong></p>\n\n\n\n<p>1 ROGLIC Primoz (Team Jumbo-Visma) <br>2 SCHACHMANN Maximilian (BORA – hansgrohe) +0:41<br>3 IZAGIRRE Ion (Astana &#8211; Premier Tech) +0:50<br>4 VLASOV Aleksandr (Astana – Premier Tech) +0:51<br>5 JORGENSON Matteo (Movistar) +1:08<br>6 BENOOT Tiesj (Team DSM) +1:14<br>7 HAMILTON Lucas (Team BikeExchange) +1:16<br>8 SÁNCHEZ Luis León (Astana &#8211; Premier Tech) +1:21<br>9 LATOUR Pierre (Team Total Direct Energie) st<br>10 PARET-PEINTRE Aurélien (AG2R Citroën) +1:23</p>\n\n\n\n<h3>Mathieu van der Poel wins at Tirreno-Adriatico</h3>\n\n\n\n<p>Mathieu van der Poel continued to live up to the hype by winning stage 3 of Tirreno-Adriatico into Gualdo Tadino. Race leader Wout van Aert finished second on the stage, followed by Davide Ballerini. </p>\n\n\n\n<p>A breakaway of five set out to take on the 216 km long stage ahead of the field. At one point they had over nine minutes advantage on the peloton behind, but as the finish drew nearer, the gap shrunk. </p>\n\n\n\n<p>There were a few exciting cross-wind moments in the middle of the race, but with so many kilometres still to cover, the splits made came back together. </p>\n\n\n\n<p>The advantage of the breakaway came down slowly, and the five out front were absorbed by the peloton in the final 3 km when the sprint trains started to form. </p>\n\n\n\n<p>Deceuninck &#8211; QuickStep tried an <a href=\"https://cyclingtips.com/2021/03/too-clever-by-half-alaphilippes-tirreno-sit-up-backfires/\" target=\"_blank\" rel=\"noreferrer noopener\">interesting manoeuvre</a> in the final kilometre when Zdenek Stybar increased his speed with Julian Alaphilippe on his wheel. Alaphilippe had Van Aert and Van der Poel directly behind him and sat up to let Stybar go clear. This move forced Van Aert to put his nose in the wind and created a perfect launching pad for Van der Poel to take stage honours. </p>\n\n\n\n<p>The general classification changed only slightly, Van der Poel moved to second while Alaphilippe dropped to third. </p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/4fnXo6nQbAY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p><strong>Top 10, stage 3</strong></p>\n\n\n\n<p>1 VAN DER POEL Mathieu (Alpecin &#8211; Fenix) 5:24:18<br>2 VAN AERT Wout (Team Jumbo &#8211; Visma) st<br>3 BALLERINI Davide (Deceuninck &#8211; QuickStep) st<br>4 HIGUITA Sergio (EF Education &#8211; Nippo) st<br>5 VAN AVERMAET Greg (AG2R Citroën) st<br>6 DE BUYST Jasper (Lotto Soudal) st<br>7 GARCÍA CORTINA Iván (Movistar) st<br>8 POGACAR Tadej (UAE &#8211; Team Emirates) st<br>9 SERRANO Gonzalo (Movistar) st<br>10 HOFSTETTER Hugo (Israel Start-Up Nation) st</p>\n\n\n\n<p><strong>Top 10, GC</strong></p>\n\n\n\n<p>1 VAN AERT Wout (Team Jumbo &#8211; Visma)<br>2 VAN DER POEL Mathieu (Alpecin &#8211; Fenix) +0:04<br>3 ALAPHILIPPE Julian (Deceuninck &#8211; QuickStep) +0:10<br>4 LANDA Mikel (Bahrain &#8211; Victorious) +0:19<br>5 POGACAR Tadej (UAE &#8211; Team Emirates) +0:20<br>6 STANNARD Robert (Team BikeExchange) st<br>7 ALMEIDA João (Deceuninck &#8211; QuickStep) st<br>8 HIGUITA Sergio (EF Education &#8211; Nippo) st<br>9 DE BUYST Jasper (Lotto Soudal) st<br>10 KONRAD Patrick (BORA &#8211; hansgrohe) st</p>\n\n\n\n<h3>Final two stages of Paris-Nice altered </h3>\n\n\n\n<p>Following the request of the Mayor of Nice to <a href=\"https://cyclingtips.com/2021/03/the-mayor-of-nice-requests-final-stage-of-paris-nice-be-relocated-to-open-promenade-to-citizens/\" target=\"_blank\" rel=\"noreferrer noopener\">alter the final stage </a>of Paris-Nice away from the Promenade des Anglais, the ASO have announced adjusted routes for both stages 7 and 8. &#8220;</p>\n\n\n\n<p>&#8220;In order to respect the spirit and the rules of confinement which apply to <a href=\"https://twitter.com/VilledeNice\">@VilledeNice</a> this weekend, the organizers redesigned in agreement with the communities and the services of the State the routes of the last 2 stages,&#8221; the race announced on Twitter. </p>\n\n\n\n<p>The new route for stage 7 starts in Le Broc and finishes 119.2 km later in La Colmiane. It features three category two climbs and a final category 1. The final climb is 16.3 km in length and averages 6.5% grades. </p>\n\n\n\n<p>Stage 8 now starts in Plan-de-Var and is only 92.7 km in length, finishing in Levens, located in the mountains north of Nice. The course is two laps of a rolling circuit that finishes on a slight uphill. </p>\n\n\n\n<h3>One Million people watched Le Samyn Dames live </h3>\n\n\n\n<p>Le Samyn Dames, the women&#8217;s 1.1 that took place on March 2nd, announced that 1 million people tuned in to watch Lotte Kopecky outspent Emma Norsgaard and Chloe Hosking. The race was an exciting one, with some punchy climbing cobbled sectors. </p>\n\n\n\n<p>Live coverage of women&#8217;s races has long been thought to be an avenue to get more financial backing into the sport. Following the Omloop Het Nieuwsblad <a href=\"https://cyclingtips.com/2021/03/freewheeling-podcast-the-great-prize-money-debate-of-omloop-het-nieuwsblad/\" target=\"_blank\" rel=\"noreferrer noopener\">prize money debate</a> many professionals took to the internet to share their thoughts on the matter. Most of them believed that while prize money helps them, the most pressing issues for women&#8217;s cycling is<a href=\"https://cyclistsalliance.org/2021/03/four-simple-steps-to-help-build-a-better-future-for-professional-womens-cycling-from-our-rider-council/\" target=\"_blank\" rel=\"noreferrer noopener\"> live coverage of racing</a> and a livable wage.</p>\n\n\n\n<p>With this news from Le Samyn, it&#8217;s clear that there are at least 1 million people in the world who want to watch women&#8217;s racing, and the race hopes that other organizations take notice that women&#8217;s cycling has great potential. </p>\n\n\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">✨1MILLION LIVE VIEWERS✨<br><br>Great news! You were 1 Million watching Le Samyn des Dames 😍<br><br>We are proud to broadcast women’s race 🤗 Congrats Gurls! ✌️<a href=\"https://twitter.com/hashtag/SamynDesDames?src=hash&amp;ref_src=twsrc%5Etfw\">#SamynDesDames</a> <a href=\"https://twitter.com/hashtag/WomenCycling?src=hash&amp;ref_src=twsrc%5Etfw\">#WomenCycling</a> <a href=\"https://twitter.com/hashtag/MoreIsComing?src=hash&amp;ref_src=twsrc%5Etfw\">#MoreIsComing</a> <a href=\"https://t.co/kA6Wgfhe5X\">pic.twitter.com/kA6Wgfhe5X</a></p>— GPSamyn (@GPSamyn) <a href=\"https://twitter.com/GPSamyn/status/1370355708240203780?ref_src=twsrc%5Etfw\">March 12, 2021</a></blockquote> <script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n\n\n<h3>Richard Freeman guilty of ordering testosterone for an unknown rider</h3>\n\n\n\n<p>The Medical Practitioners Tribunal Service (MPTS) has found Dr Richard Freeman guilty of ordering 30 sachets of Testogel testosterone patches. They believe the drug in question was ordered with the&nbsp;<a href=\"https://cyclingtips.com/2021/01/closing-argument-tribunal-is-told-that-freeman-ordered-testosterone-to-dope-a-rider/\" target=\"_blank\" rel=\"noreferrer noopener\">intent to administer it to an athlete</a>&nbsp;with the hope of improving their athletic performance.&nbsp;</p>\n\n\n\n<p>Dr Freeman, the former chief doctor for both Team Sky and British Cycling, faced 22 charges related to incidents in May 2011. These allegations included; purchasing a prohibited substance, lying to UK Anti-Doping, untrue statements and communications to conceal his conduct, inappropriately provided medical treatment to non–riding staff, failing to maintain an adequate record management system, and inappropriate management of prescription-only medications.</p>\n\n\n\n<p>Read the full story <a href=\"https://cyclingtips.com/2021/03/richard-freeman-guilty-of-ordering-testosterone-for-an-unknown-rider/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>. </p>\n\n\n\n<h3>Women&#8217;s Cycling Weekly issue 16</h3>\n\n\n\n<p>Amy Jones curated another wonderful rundown of what happened in <a href=\"https://mamilrepeller.substack.com/p/womens-cycling-weekly-issue-16?utm_campaign=post&amp;utm_medium=email&amp;utm_source=copy\" target=\"_blank\" rel=\"noreferrer noopener\">women&#8217;s cycling this week</a>. From Team BikeExchange&#8217;s rise in minimum salaries to match their men&#8217;s team to Tiffany Cromwell&#8217;s eye on the gravel scene, Amy covers it all. </p>\n\n\n\n<p>You can also find Amy&#8217;s Women&#8217;s Cycling Weekly on the CyclingTips website every Friday. </p>\n\n\n\n<h2>Coming Up.</h2>\n\n\n\n<p>Stage racing continues with the fourth stage of Tirreno-Adriatico and the seventh stage of Paris-Nice. Both races feature big mountain top finishes and will be crucial days for the general classification.</p>\n\n\n\n<h2>In case you missed it&#8230;</h2>\n\n\n\n<ul><li><strong>Dave Rome</strong> reviews Giant&#8217;s <a href=\"https://cyclingtips.com/2021/03/giant-rev-pro-mips-helmet-review/\" target=\"_blank\" rel=\"noreferrer noopener\">Rev Pro Mips</a> helmet. </li><li>Somehow <strong>Iain Treloar </strong>got a hold of the Belgian <a href=\"https://cyclingtips.com/2021/03/11-belgians-paris-nice-breakaway/\" target=\"_blank\" rel=\"noreferrer noopener\">group chat</a> ahead of Paris-Nice stage five. What he discovered might shock you.</li><li>While his home region of Tigray in the midst of a civil war, <strong>Negasi Abreha</strong> trains in Italy, thinking of <a href=\"https://cyclingtips.com/2021/03/negasi-abreha-ethiopia-civil-war-cant-go-home/\" target=\"_blank\" rel=\"noreferrer noopener\">his family and his future</a>.</li></ul>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/primoz-roglic-wins-stage-6-of-paris-nice-daily-news/\">Primoz Roglic wins stage 6 of Paris-Nice: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3e327a8ed380711ef879b4301a801be12fb4b7355db89ef08080684e223cf6db","category":"Cycling"}