{"title":"Twitter ถูกฟ้องเรียกค่าเสียหาย 250 ล้านดอลลาร์ จากประเด็นการละเมิดลิขสิทธิ์เพลง","link":"https://www.blognone.com/node/134369","date":1686805724000,"content":"<div><div><div><p>The National Music Publishers' Association (NMPA) ซึ่งเป็นสมาคมผู้จัดจำหน่ายเพลงของสหรัฐอเมริกา ได้ยื่นฟ้องร้อง Twitter เรียกค่าเสียหายเป็นมูลค่าราว 250 ล้านดอลลาร์ จากประเด็นการละเมิดลิขสิทธิ์เพลง</p>\n<p>NMPA ได้ทำการฟ้องร้องในนามของบริษัทผู้จัดจำหน่ายเพลง 17 แห่ง ซึ่งต่างก็เป็นตัวแทนของศิลปินชื่อดังมากมายในอุตสาหกรรมเพลง โดยทำการฟ้องต่อศาลรัฐบาลกลางใน Tennessee</p>\n<p>ทั้งนี้ NMPA ได้ระบุรายชื่อเพลงประมาณ 1,700 เพลงที่ถูกละเมิด ซึ่งเหล่าบรรดาบริษัทผู้จัดจำหน่ายได้ล้วนแล้วเคยส่งคำร้องไปทาง Twitter ให้ทำการตรวจสอบและจัดการกับเนื้อหาที่ละเมิดลิขสิทธิ์เพลงเหล่านั้น ทว่าทาง Twitter กลับไม่ดำเนินการใดๆ โดย NMPA ได้เรียกร้องให้ศาลสั่งปรับเงิน Twitter เป็นมูลค่า 150,000 ดอลลาร์ สำหรับเพลงแต่ละเพลงที่ถูกละเมิดลิขสิทธิ์ ซึ่งทำให้มูลค่าของคดีนี้รวมกันทั้งหมดประมาณ 250 ล้านดอลลาร์</p>\n<p>ทั้งนี้มีรายงานว่าช่วงที่ Elon Musk กำลังจะเข้าซื้อ Twitter ด้วยมูลค่า 44 พันล้านดอลลาร์นั้น Twitter ได้ตัดสินใจยกเลิกการทำข้อตกลงเรื่องสิทธิ์การใช้เพลงส่วนหนึ่งเพื่อประหยัดค่าใช้จ่ายมากกว่า 100 ล้านดอลลาร์ต่อปี และเมื่อเดือนมีนาคมที่ผ่านมายังมีรายงานข่าวระบุเพิ่มเติมว่าภายหลังจากที่ Musk ซื้อ Twitter ได้เสร็จสิ้นเป็นที่เรียบร้อยแล้ว Twitter ก็ยังมีประเด็นการทำข้อตกลงเรื่องสิทธิ์การใช้เพลงกับบริษัทผู้จัดจำหน่ายเพลงรายใหญ่อีก 3 ราย ที่ยังค้างคาไร้ความคืบหน้า</p>\n<p>ที่มา - <a href=\"https://www.theverge.com/2023/6/14/23761680/twitter-music-lawsuit-nmpa-copyright-infringement\">The Verge</a>, <a href=\"https://www.nytimes.com/2023/06/14/technology/music-twitter-lawsuit-elon-musk.html\">The New York Times</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/18c7b93dbd7b7161a700ea1841d50e98.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/twitter\">Twitter</a></div><div><a href=\"/topics/lawsuits\">Lawsuits</a></div><div><a href=\"/topics/copyright-infringement\">Copyright Infringement</a></div><div><a href=\"/topics/music\">Music</a></div></div></div>","author":"ตะโร่งโต้ง","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3e339a62f96865d5bc834b0221bcd68f3d51c602d8cdbf00edd1a7095d877e11","category":"Thai"}