{"title":"Single‐cell RNA sequencing reveals the landscape of biomarker in allergic rhinitis patient undergoing intracervical lymphatic immunotherapy and related pan‐cancer analysis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24151?af=R","date":1706680508000,"content":"<h2>Abstract</h2>\n<h2>Introduction</h2>\n<p>Allergic rhinitis (AR) is one of the leading allergic diseases worldwide. Allergen immunotherapy (AIT) induces persistent specific allergen tolerance to achieve remission of the symptoms in AR patients. We creatively conducted the intra-cervical lymphatic immunotherapy (ICLIT) for AR patients. However, the underlying molecular mechanism of immune cell response of AIT in AR remains elusive.</p>\n<h2>Method</h2>\n<p>To investigate the transcriptome profile in AR patients who underwent ICLIT, we comprehensively investigated the transcriptional changes in B cells from peripheral blood mononuclear cells of AR patient by single-cell RNA sequencing. Immunoglobulins and relative key gene, which influences the B cell differentiation, was demonstrated. The biomarkers' association with different types of tumors was investigated.</p>\n<h2>Results</h2>\n<p>Naive B cells, germinal center B cells, activated memory B cells, and memory B cells constituted the B cells subsets. The expression of <i>IGHE</i>, <i>IGHGs</i>, <i>IGHA</i>, <i>IGHD</i>, <i>and IGHM</i> from memory B cells was validated. Pseudotime analysis further indicated the dynamic change from the expression of the immunoglobulins in the memory B cells, suggesting that <i>ITGB1</i> may contribute to the differentiation procedure of memory B cells. The cell–cell communication among these immune cells demonstrated the significantly enhanced CD23, BTLA signaling after ICLIT in AR patient. <i>ITGB1</i> was upregulated in 13 tumors and downregulated in six others. High <i>ITGB1</i> expression was linked to poor prognosis in eight types of tumors. <i>ITGB1</i> expression showed correlations with tumor mutation burden, tissue purity, and microsatellite instability in different types of tumors.</p>\n<h2>Discussion</h2>\n<p><i>ITGB1</i> was demonstrated as a potential biomarker for AR patients after ICLIT and is significant in identifying immune infiltration in tumor tissue and predicting tumor prognosis.</p>","author":"Yin Li, \nHao Li, \nWeijun Huang, \nQingqing Yu, \nKai Wang, \nYu Xiong, \nQixing Wang, \nYang Qin, \nXiong Kuang, \nJun Tang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"3e338ef4bd434063f81b662292b1861c4a5b7b2655747b11b4571d0ddb6f9c1c","category":"Environment"}