{"title":"[ลือ] iPad Air ใหม่มี 2 ขนาดจอ - iPad Pro จอ OLED เปิดตัวต้นปีหน้า - MacBook Air M3 อาจมาพร้อมกัน","link":"https://www.blognone.com/node/137116","date":1701909900000,"content":"<div><div><div><p>ข้อมูลล่าสุดจาก Mark Gurman แห่ง Bloomberg คนเดิม บอกว่าแอปเปิลมีแผนออก iPad รุ่นใหม่ ในช่วงต้นปี 2024 โดยรุ่นที่มีอัพเดตคือ iPad Air และ iPad Pro รายละเอียดเบื้องต้นดังนี้</p>\n<ul>\n<li><strong>iPad Air</strong> มี 2 ขนาดหน้าจอคือ 10.9 นิ้ว และ 12.9 นิ้ว โดยทำขนาดออกมาคล้าย iPad Pro สองรุ่นย่อย แต่ราคาถูกกว่า</li>\n<li><strong>iPad Pro</strong> ใช้หน้าจอ OLED เป็นครั้งแรก รุ่นบนใช้ชิป M3 ตัวล่าสุด</li>\n</ul>\n<p>เขายังให้ข้อมูลว่าแอปเปิลจะออก Apple Pencil รุ่นใหม่ และ Magic Keyboard รุ่นใหม่ ซึ่งอย่างหลังจะมาพร้อมดีไซน์ใหม่ ขอบอะลูมิเนียม ทำให้เวลาประกบเข้ากับ iPad ดูเป็นแล็ปท็อปมากขึ้น</p>\n<p>ในรายงานนี้ Gurman บอกว่าแอปเปิลจะอัพเดต iPad mini และ iPad รุ่นปกติ ด้วยเช่นกันในปี 2024 แต่ไม่แน่ใจว่าจะเปิดตัวพร้อมกับ iPad Air และ iPad Pro ใหม่นี้หรือไม่</p>\n<p>ในปี 2023 แอปเปิลไม่มี iPad รุ่นใหม่ออกมาเลย อย่างไรก็ตามหากแอปเปิลเปิดตัว iPad ต้นปีหน้าจริง ก็คาดว่าจะใช้ช่วงเวลาเดิมคือมีนาคม ที่มักใช้เปิดตัว iPad รุ่นใหม่ ซึ่งตอนนั้นตามแผนแอปเปิลจะออกอัพเดต iPadOS 17.4 และ iOS 17.4 ด้วย</p>\n<p>เขายังพูดถึงแผนการออก Mac รุ่นใหม่ช่วงต้นปี คาดว่า MacBook Air ชิป M3 จะเปิดตัวช่วงต้นปีพร้อมกับ iPad Air และ iPad Pro ส่วน Mac รุ่นอื่นยังไม่มีข้อมูล</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/articles/2023-12-06/apple-prepares-m3-macbook-air-and-revamped-ipad-pro-for-early-next-year\">Bloomberg</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/50664e4d56925665a7bbc00a43c7a848.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/ipad-air\">iPad Air</a></div><div><a href=\"/topics/ipad-pro\">iPad Pro</a></div><div><a href=\"/topics/macbook-air\">Macbook Air</a></div><div><a href=\"/topics/rumors\">Rumors</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3e35b1beec40e6af4f66587fc0be6f71ce8af1dcf3e6e3bf64ffe0df22563fa0","category":"Thai"}