{"title":"Phytosulfokine promotes fruit ripening and quality via phosphorylation of transcription factor DREB2F in tomato","link":"https://academic.oup.com/plphys/article/194/4/2739/7517350?rss=1","date":1705017600000,"content":"<span><div>Abstract</div>Phytosulfokine (PSK), a plant peptide hormone with a wide range of biological functions, is recognized by its receptor PHYTOSULFOKINE RECEPTOR 1 (PSKR1). Previous studies have reported that PSK plays important roles in plant growth, development, and stress responses. However, the involvement of PSK in fruit development and quality formation remains largely unknown. Here, using tomato (<span>Solanum lycopersicum</span>) as a research model, we show that exogenous application of PSK promotes the initiation of fruit ripening and quality formation, while these processes are delayed in <span>pskr1</span> mutant fruits. Transcriptomic profiling revealed that molecular events and metabolic pathways associated with fruit ripening and quality formation are affected in <span>pskr1</span> mutant lines and transcription factors are involved in PSKR1-mediated ripening. Yeast screening further identified that DEHYDRATION-RESPONSIVE ELEMENT BINDING PROTEIN 2F (DREB2F) interacts with PSKR1. Silencing of <span>DREB2F</span> delayed the initiation of fruit ripening and inhibited the promoting effect of PSK on fruit ripening. Moreover, the interaction between PSKR1 and DREB2F led to phosphorylation of DREB2F. PSK improved the efficiency of DREB2F phosphorylation by PSKR1 at the tyrosine-30 site, and the phosphorylation of this site increased the transcription level of potential target genes related to the ripening process and functioned in promoting fruit ripening and quality formation. These findings shed light on the involvement of PSK and its downstream signaling molecule DREB2F in controlling climacteric fruit ripening, offering insights into the regulatory mechanisms governing ripening processes in fleshy fruits.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"3e4bd14da771ec07cc66c7d1c915829d78ad090bd5fd7cf156ac29402c80889e","category":"Environment"}