{"title":"watchOS 10 will reportedly be so good, no one will care about the new Apple Watch","link":"https://www.macworld.com/article/1788333/watchos-10-apple-watch-updated-interface-enhancements.html","date":1681739491000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It’s another one of those “bad news/good news” situations. The late-2023 Apple Watches won’t offer much by way of hardware upgrades, according to the latest report, but the year’s watchOS 10 update, which will be available for many existing Apple Watch models at no additional cost, is set to bring “bigger enhancements, including an updated interface.”</p>\n\n\n\n<p>Mark Gurman, a prolific and respected leaker and Apple analyst, made the prediction in the April 16 edition of his <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-04-16/apple-wwdc-2023-june-5-plan-reality-headset-new-macs-watchos-10-ios-17-lgjfj5bf&amp;xcust=1-1-1788333-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On newsletter</a>, along with numerous forecasts related to the Reality headset, the next versions of iOS and iPadOS, <a href=\"https://www.macworld.com/article/1787602/new-macbook-air-pro-15-inch-wwdc-2023.html\">new MacBooks</a>, and other upcoming releases. The report covered so much ground, indeed, that there was little space for specifics concerning Apple’s new smartwatch operating system, although what he did reveal will have been enough to interest Apple Watch owners across the globe.</p>\n\n\n\n<p>“The watchOS update,” Gurman further wrote, “will tell you most of what you need to know about the Apple Watch in 2023. That’s because hardware changes are expected to be minimal, so the operating system upgrade will be the focus.”</p>\n\n\n\n<p>It’s been believed for some time that the <a href=\"https://www.macworld.com/article/1472709/apple-watch-series-9-rumors-specs-features-price-release.html\">Apple Watch Series 9</a>, likely to launch this fall, will be a relatively minor update. Gurman himself <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/markgurman/status/1642624542458904576&amp;xcust=1-1-1788333-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">tweeted</a> earlier this month that it would be “anything but major,” with the next significant hardware upgrade scheduled for 2024. Last year saw the release of the Apple Watch Ultra, and the company frequently follows groundbreaking devices with more cautious updates the next year.</p>\n\n\n\n<p>But what has Apple got in store for us software-wise? An updated interface could mean almost anything, but the way Gurman is talking about it makes it sound like a big change.</p>\n\n\n\n<p>WatchOS has yet to go through a sudden and radical overhaul of its interface, as we saw with iOS 7 back in 2013. That update, it should be noted, was less than universally enjoyed at the time, although its overall switch from skeuomorphic to more abstract elements, softened a little over time, has since become accepted as the standard for mobile interface design. Apple can expect pushback from users if watchOS 10’s interface differs so strongly from its predecessors.</p>\n\n\n\n<p>But it’s worth emphasizing that Gurman is calling it an <em>updated</em> interface, not a new one. Rather than an entirely refreshed design language, then, it’s likely that we can expect something less radical; perhaps something along the lines of the quietly revolutionary Dock which debuted in watchOS 3.</p>\n\n\n\n<p>Keep up with the latest rumors by bookmarking our regularly updated guide to <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC 2023</a>.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3e4bd81e7c122a3754bad075327cabdef03f7845f68963fc8c4445b0db799547","category":"Apple"}