{"title":"Google 'Pixel Fold' to Use Ultra-Thin Glass, Still on Track for 2021 Release","link":"https://www.macrumors.com/2021/07/14/google-pixel-fold-on-track-2021-release/","date":1626260988000,"content":"Google's designs on its first foldable Pixel phone appear to have ramped up a notch, with the company said to be tapping Samsung to supply ultra-thin glass (UTG) layers for an infolding 7.6-inch device that could launch this year.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/Pixel-Fold.jpg\" /><div><em>MacRumors concept render</em></div>\r\n<br />\r\nAccording to a new report from <em><a href=\"http://www.thelec.net/news/articleView.html?idxno=3064\">The Elec</a></em>, Google is just one of several mobile makers seeking to secure UTG orders from Samsung, which is currently the exclusive supplier of the glass. Xiaomi, Honor, and OPPO are all believed to be working on foldable phones with UTG.\r\n<br />\r\n\r\n<br />\r\nSamsung's original 2019 Galaxy Fold used polyimide films, but the out-folding screens were susceptible to <a href=\"https://www.macrumors.com/2019/04/17/samsung-broken-galaxy-fold-devices/\">display creasing and panel breakages</a>, and the company's subsequent (in-)folding smartphones, 2020's Galaxy Z Flip and Galaxy Z Fold 2, both used UTG. The latter has fared better under duress, seemingly proving that almost anything can be bent if you make it thin enough.\r\n<br />\r\n\r\n<br />\r\nThe report falls in line with previous suggestions in <a href=\"https://www.macrumors.com/2021/02/24/google-pixel-foldable-coming-2021/\">February</a> that Samsung has been developing in-folding OLED panels to supply to Oppo, Xiaomi, and Google. Last month, <em>The Elec</em> also <a href=\"http://www.thelec.net/news/articleView.html?idxno=2898\">reported</a> that Samsung would produce foldable displays for Google and other vendors in October, suggesting a \"Pixel Fold\" release in the fourth quarter of this year.\r\n<br />\r\n\r\n<br />\r\nDocuments leaked in <a href=\"https://www.macrumors.com/2020/08/06/foldable-pixel-phone-leaked-google-docs/\">August 2020</a> suggested Google plans to release a foldable pixel phone in Q4 2021. Google <a href=\"https://www.cnet.com/news/google-is-already-working-on-a-foldable-pixel-phone/\">confirmed</a> in 2019 that it is developing technology that could be used in foldable devices, although at the time the company played down the prospect of actually launching a foldable, saying it didn't see \"a clear use case yet.\"\r\n<br />\r\n\r\n<br />\r\nHowever, Google develops the software that has to run on all Android foldable devices, which put it at a distinct advantage when it comes to foldable hardware-software integration.\r\n<br />\r\n\r\n<br />\r\nMarket research firm Omdia expects foldable OLED sales to reach US$2.1 billion this year, a 203% increase from 2020. Most of the sales are expected to come through foldable panels made by Samsung Display, and while Apple appears to have not made a firm decision on whether it will launch a foldable smartphone, previous rumors have suggested that Apple has <a href=\"https://www.macrumors.com/2020/09/10/apple-orders-samsung-foldable-display-samples/\">requested</a> foldable display samples from Samsung for testing purposes in a future ‌<a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>‌.\r\n<br />\r\n\r\n<br />\r\nSamsung has historically been a key supplier to Apple, providing the OLED screens for iPhones. The Korean company apparently intends to dominate the foldable display market as a UTG supplier, although the glass it's using in its current foldable phones is actually made by German manufacturer Schott, while U.S.-based Corning is also emerging as a UTG player.\r\n<br />\r\n\r\n<br />\r\nApple has been <a href=\"https://www.macrumors.com/2021/01/15/iphone-13-in-display-fingerprint-sensor/\">known</a> to be working on <a href=\"https://www.macrumors.com/guide/foldable-iphone/\">foldable display technology</a> for some years now, filing multiple <a href=\"https://www.macrumors.com/2016/11/22/apple-foldable-iphone-with-flexible-display/\">patents</a> regarding the technology, and rumors have also floated around <a href=\"https://www.macrumors.com/2021/02/17/lg-apple-foldable-displays/\">LG's potential involvement</a>.\r\n<br />\r\n\r\n<br />\r\nThe repeated suggestion of Samsung's involvement and orders being placed by Apple offers a more concrete suggestion that work on a foldable ‌‌‌iPhone‌‌‌ is quietly continuing, with some rumors suggesting a release <a href=\"https://www.macrumors.com/2021/02/16/7-inch-foldable-iphone-with-apple-pencil-2023/\">as early as 2023</a>.\r\n<br />\r\n<div>Tags: <a href=\"https://www.macrumors.com/guide/google-pixel/\">Google Pixel</a>, <a href=\"https://www.macrumors.com/guide/foldable-iphone/\">Foldable iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/14/google-pixel-fold-on-track-2021-release/\">Google 'Pixel Fold' to Use Ultra-Thin Glass, Still on Track for 2021 Release</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/google-pixel-fold-to-use-ultra-thin-glass-still-on-track-for-2021-release.2304210/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=xLAfHRaJBc0:f0rCYc0kBrA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=xLAfHRaJBc0:f0rCYc0kBrA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/xLAfHRaJBc0\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3e5b62180583564c359583aa98ed885d603ba14472fbe3534002d2975a617501","category":"Apple"}