{"title":"21 Ancylostoma caninum-derived neutrophil inhibitory factor impairs ovine neutrophil chemotaxis to Haemonchus contortus larval antigen in Suffolk but not St. Croix sheep","link":"https://academic.oup.com/jas/article/102/Supplement_1/56/7617960?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Parasite-resistant St. Croix sheep (STC) generate a potent neutrophilic response to larval stages of Haemonchus contortus (Hc) as demonstrated by abomasal neutrophil infiltration as early as 3 days after infection. This phenomenon is delayed in parasite-susceptible Suffolk sheep (SUF) potentially contributing to larval establishment. An excretory/secretory (E/S) product, common to many helminths, is neutrophil inhibitory factor (NIF) which negatively affects neutrophil migration and activity. Due to differences in neutrophil accumulation between STC and SUF sheep, we hypothesized that Hc-NIF may inhibit migration of SUF and not STC neutrophils. To determine the concentration of NIF to use in subsequent experiments, neutrophils from STC and SUF were cultured with varying concentrations of Ancylostoma caninum-derived NIF (Ac-NIF) before exposure to larval Hc third-stage larval antigen (HcLA). Analysis of migration to stimuli revealed that the Ac-NIF concentration of 0.125 ug/mL yielded the greatest inhibition of migration towards HcLA between SUF and STC (8.70% and 11.64% migration, respectively; P = 0.0004).To test our hypothesis, neutrophils were cultured from STC and SUF sheep in the presence of Ancylostoma caninum-derived NIF (Ac-NIF) and measure chemotaxis to Interleukin-8 (IL-8), HcLA or Hc third-stage excretory/secretory (E/S) products. Neutrophils were isolated then incubated with Ac-NIF (0.125μg/mL) or complete media for 1 h. Neutrophils (1,000,000 cell/mL) were applied to cell migration inserts, and placed into a reservoir containing HcLA (20 μg/mL), E/S (20 μg/mL), IL-8 (50 ng/mL), or complete media. Migration plates were incubated (37°C, 5% CO<sub>2</sub>) for 24 h, after which, migrating cells were quantified using fluorescence. Ac-NIF inhibited SUF neutrophil migration towards IL-8 compared with STC (6.47% vs 9.95%, respectively; P = 0.0025). In response to HcLA alone, 64.0% of STC neutrophils migrated, while only 40.9% of SUF had the ability to migrate (P &lt; 0.001). Towards HcLA, Ac-NIF inhibited SUF neutrophil migration compared with STC (8.40% vs 13.8%, respectively) (P &lt; 0.001). Even more dramatically, in response to E/S products alone, only 24.3% of SUF neutrophils had the ability to migrate, while 76.4% of STC neutrophils migrated towards E/S (P &lt; 0.001). In response to E/S, only 1.52% of SUF Ac-NIF-treated neutrophils were able to migrate, while 23.27% of STC neutrophils migrated (P &lt; 0.001). Taken together, these data demonstrate that STC neutrophils are resistant to effects of neutrophil inhibition that is artificially applied or derived from HcE/S, which may explain breed differences in neutrophil migration in vivo.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3e61a4b7651f9f6ec192b898db7cc4d978159f32c782cbee1df7d04acb8422ab","category":"Environment"}