{"title":"Microsoft releases downloadable tool to fix phantom HP printer installations","link":"https://arstechnica.com/?p=1991945","date":1703016976000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/hp-106-800x450.jpeg\" alt=\"The HP LaserJet M106w is one of the printer models that is mysteriously appearing for some users in Windows 10 and 11. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/hp-106.jpeg\">Enlarge</a> <span>/</span> The HP LaserJet M106w is one of the printer models that is mysteriously appearing for some users in Windows 10 and 11.  (credit: HP)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Earlier this month, Microsoft <a href=\"https://arstechnica.com/gadgets/2023/12/hp-printer-app-is-installing-on-pcs-whether-they-have-hp-printers-or-not/\">disclosed</a> an odd printer bug that was affecting some users of Windows 10, Windows 11, and various Windows Server products. Affected PCs were seeing an HP printer installed, usually an HP LaserJet M101-M106, even when they weren’t actually using any kind of HP printer. This bug could overwrite the settings for whatever printer the user actually did have installed and also prompted the installation of an HP Smart printer app from the Microsoft Store.</p>\n<p>Microsoft still hasn't shared the root cause of the problem, though it did make it clear that the problem wasn't HP's fault. Now, the company has released a fix for anyone whose PC was affected by the bug, though as of this writing, it requires users to download and run <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=105763\">a dedicated troubleshooting tool</a> available from Microsoft's support site.</p>\n\n<p>The <a href=\"https://support.microsoft.com/en-us/topic/kb5034510-microsoft-printer-metadata-troubleshooter-tool-december-2023-b3197f24-fd25-430d-96d2-70f2044ce6a1\">December 2023 Microsoft Printer Metadata Troubleshooter Tool</a> is available for all affected Windows versions, and it will remove all references to the phantom HP LaserJet model (as long as you don't have one installed, anyway). The tool will also remove the HP Smart app as long as you don't have an HP printer attached and the app was installed after November 25, presumably the date that the bug began affecting systems. These steps should fix the issue for anyone without an HP printer without breaking anything for people who do use HP printers.</p></div><p><a href=\"https://arstechnica.com/?p=1991945#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1991945&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3e6cd0519dc3f68c23c63b61756f68c2c4b131dfac8531e0685bc63f7f8e7b8b","category":"Tech"}