{"title":"Peloton Acquires Atlas Wearables: A Peloton Wearable Ahead?","link":"https://www.dcrainmaker.com/2021/03/peloton-acquires-atlas-wearables-a-peloton-wearable-ahead.html","date":1616700358000,"content":"<h3><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/03/image-96.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/03/image_thumb-96.png\" alt=\"image\" width=\"722\" height=\"418\" border=\"0\" /></a></h3>\n<p>Peloton has been quietly acquiring various companies over the past half a year, some three of which were mentioned in <a href=\"https://www.pelobuddy.com/rumor-peloton-acquired-atlas-wearables/\">their latest quarterly filing</a> – however, only one was by name. The rest renamed unnamed. But this week, two companies <a href=\"https://www.bloomberg.com/news/articles/2021-03-22/peloton-buys-wearables-ai-hardware-companies-in-deal-flurry\">have been confirmed</a>. The first being Atlas Wearables, and the second being a <a href=\"https://www.pelobuddy.com/peloton-acquisition-otari-studio-mat/\">smart yoga/workout mat company</a>, Otari.</p>\n<p>Now Atlas Wearables has been around the block a surprisingly long time for a wearable company you probably haven’t heard of. I first covered their Kickstarter campaign <a href=\"https://www.dcrainmaker.com/2014/01/reviewjanuary-13th-2014.html/comment-page-2\">some 7 years ago in 2014.</a> And each year at CES I’d usually see them around.</p>\n<p>Much of the focus of their devices was on the gym front, rather than the wider endurance sports realm, you can see an <a href=\"https://www.tomsguide.com/us/atlas-wristband-2,review-3879.html#:~:text=The%20Atlas%20Wristband%20sets%20itself,and%20monitor%20your%20heart%20rate.\">older review here of their Atlas Wristband 2</a>. Given the gym focus isn’t typically my jam, it wasn’t something I tended to cover. More recently they’ve started to focus more on algorithms and integration – which is probably why Peloton is interested. They’ve been rumored to be working on some sort of strength training device. And algorithms related to what would make sense, as would acquiring a company that focused on strength training.</p>\n<p>However, I’d be extremely skeptical if <a href=\"https://www.dcrainmaker.com/2021/02/peloton-bike-plus-in-depth-review.html\">Peloton</a> were to get into the watch game themselves. See, while Peloton dominates the indoor cycling realm, that’s a relatively small market. Peloton’s most recent filing illustrates why. They have 1.98M (1,980,000) <a href=\"https://investor.onepeloton.com/static-files/dd43f8b8-acc9-443a-bc51-fd26433ec549\">Peloton bikes/treadmills in homes today</a> (plus 625K digital subscribers), and while that’s a lot – for comparison, Fitbit generally sells between 15-20 million devices *per year*. Apple sells between 30-40 million units per year (and growing fast). Garmin is a bit of an unknown here, but my guess is between 2 and 6 million devices per year.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/03/Peloton.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"Peloton\" src=\"https://media.dcrainmaker.com/images/2021/03/Peloton_thumb.jpg\" alt=\"Peloton\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Anyway, the point here isn’t about the others – it’s more of a numbers game. Undoubtedly, the vast majority of Peloton users likely already have a smart wearable of some sort, and making successful wearables is incredibly difficult and requires many years and a large user base to test again. That’s because people are often rather finicky on what I call 1% features. Meaning, a feature that to you is “the most important thing ever, how can a watch not have this”, yet to me is “shrug, never heard of it”. It’s a similar problem to why bike computers are so hard. Everyone has their routines, and changing them is tough.</p>\n<p>However, I’d argue a *far* smart twist for Peloton here is to roll-out a <a href=\"https://www.dcrainmaker.com/2020/05/whoop-3-platform-review.html\">Whoop style tracking band</a>. Keep it low-key, discrete, and non-competitive with the Apple Watch that many Peloton users might be wearing. As long as the optical sensor isn’t a dumpster fire, Peloton could do really well here in a subscription service that targets both Peloton and non-Peloton users alike, while acting as a gateway to the platform as a whole.</p>\n<p>For those not familiar with Whoop, it essentially aims to track only two things: Recovery (via sleep), and strain (your workouts, aka training load). That’s it, no step tracking, no screen, no notifications. It app/platform interface is great, the potential insights fantastic, but its sensor is so horrific it makes the data largely worthless.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2020/05/DSC_5617.jpg\" width=\"720\" height=\"480\" /></p>\n<p>If Peloton were to tie a band like that with their platform/app for live movement tracking using patents from Atlas – that’d do exceedingly well, and also be saleable to non-Peloton Bike/Treadmill owners. Whereas building out a full fledged smartwatch means running up against all the expectation baggage that comes with making a smartwatch. Notifications, apps, music, full activity tracking, reporting, dashboards, baseline watch functionality and tons more. Just start pressing buttons on your smartwatch right now and think to yourself: Everything I see here, they have to build to a Peloton-acceptable level.</p>\n<p>Versus a band that’s just a pile of algorithms and a good optical sensor? They’ve already got that IP with the acquisition. Plus, it’d have the upsell benefit of acting as an heart rate sensor for your bike/app live – one more easy selling point when pushing people over the edge. And Atlas already has sleep tracking, activity tracking, stress tracking, RHR and HRV tracking &#8211; essentially, all the baselines for the perfect no-screen band.</p>\n<p>In any case – interesting times ahead indeed, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"3e72b54dc1615959f06903c7347b56abeb922ceb626ef3e811f201c5dd2e9f08","category":"Cycling"}