{"title":"Ferrer House at Rocafort, an Early Case of Design Brise-Soleil for the Mediterranean in Valencia","link":"https://www.preprints.org/manuscript/202408.2134/v1","date":1724919483000,"content":"In 1944 the architect Antonio Gómez Davó designed and built a new house for Mr. Ferrer at Rocafort in the suburbs of Valencia (Spain). In this same year, Europe, America, Russia and even Japan were still at war and Spain was only recovering from its own intestine conflict. Therefore, architectural innovations and influences were scarce as was the circulation of specialized journals on the matter. But in many creations, like the ceramic vaults and the brise-soleil, Le Corbusier himself had declared his profound nostalgia from the Mediterranean, a Sea that he had come to appreciate in his travels to the “orient”. In the case of Gómez Davó, having been born and raised in a prominent family of Valencia he could not remain indifferent to the design features that appeared in the vernacular architecture of the area, specially the type of inclined louvers of Arabic descent, that covered bow-windows and balconies and which have come to be known in Spain as the Majorcan louvers; nowadays even employed by Rafael Moneo for instance at the extension of the Painter Miro Foundation. However, with so many difficult circumstances surrounding him, Gómez Davó could not get to the point of producing a ground breaking design based on solar assumptions for the whole façade of the building, instead when providing an entrance porch apt for spending life, meals and well deserved rest hours outdoors in the pure Mediterranean tradition, he ventured to construct a surprising perforated wall oriented to the South in order to control radiation in winter and provide shade in the summer while affording excellent light and superb conditions of ventilation. By means of our own devised simulation tools we have analyzed the conditions of the house and especially of such innovative brise-soleil at times reminiscent of Alvar Aalto solutions for day-lit roofs, which he was aware intuitively and by his own incipient study of solar geometry, that needed adaptation from so distant latitudes as Finland and Valencia. By outlining such unknown and bold precedent we contribute to revitalize the early and daring pioneers of solar architecture in peripheral Spain and Europe, at the birth of critic regionalism, a fact often disregarded in conventional history of Modern Architecture.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3e72eaeb4e38574cfeb164856bb01297551dd774a56fd54b9591612fceab402a","category":"Interdisciplinary"}