{"title":"Understanding machine learning predictions of wastewater treatment plant sludge with explainable artificial intelligence","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11136?af=R","date":1727247600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1e793813-543c-4003-bf4d-ddc37f570d8b/wer11136-toc-0001-m.png\" alt=\"Understanding machine learning predictions of wastewater treatment plant sludge with explainable artificial intelligence\" />\n<p>The study employed explainable artificial intelligence (XAI) techniques to enhance the interpretability and transparency of machine learning (ML) model applications in wastewater treatment plants (WWTPs). The results suggest that XAI can successfully explain the decisions made by ML models.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This study investigates the use of machine learning (ML) models for wastewater treatment plant (WWTP) sludge predictions and explainable artificial intelligence (XAI) techniques for understanding the impact of variables behind the prediction. Three ML models, random forest (RF), gradient boosting machine (GBM), and gradient boosting tree (GBT), were evaluated for their performance using statistical indicators. Input variable combinations were selected through different feature selection (FS) methods. XAI techniques were employed to enhance the interpretability and transparency of ML models. The results suggest that prediction accuracy depends on the choice of model and the number of variables. XAI techniques were found to be effective in interpreting the decisions made by each ML model. This study provides an example of using ML models in sludge production prediction and interpreting models applying XAI to understand the factors influencing it. Understandable interpretation of ML model prediction can facilitate targeted interventions for process optimization and improve the efficiency and sustainability of wastewater treatment processes.</p>\n<h2>Practitioner Points</h2>\n<p>\nExplainable artificial intelligence can play a crucial role in promoting trust between machine learning models and their real-world applications.\nWidely practiced machine learning models were used to predict sludge production of a United States wastewater treatment plant.\nFeature selection methods can reduce the required number of input variables without compromising model accuracy.\nExplainable artificial intelligence techniques can explain driving variables behind machine learning prediction.\n</p>","author":"Fuad Bin Nasir, \nJin Li","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"3e776396c32973e41d35154b630314188d8a2903bdd59d82fa98fb3c1027257f","category":"Environment"}