{"title":"Implications of palustrine wetland configuration on the biodiversity of urban aquatic macroinvertebrate communities","link":"https://academic.oup.com/jue/article/doi/10.1093/jue/juae011/7663537?rss=1","date":1714608000000,"content":"<span><div>Abstract</div>Aquatic macroinvertebrates (AM) have a special ecological niche in the functionality of urban wetland communities. This class of animals also play a crucial role in urban environmental and water quality assessments through bio-indication and bio-monitoring. However, the continued loss and isolation of palustrine wetlands, driven by urbanization and other anthropogenic processes, result in reduced biodiversity of macroinvertebrate communities. This study sought to determine how palustrine wetland configuration affect biodiversity structure of AM in Nairobi. Wetland configuration attributes of area, perimeter, shape, and edge were examined. For wetland biodiversity, family richness and Shannon index of diversity were assessed. It was hypothesized that wetland configuration affects the biodiversity of AM. From a population of 303 wetlands, this study used heterogeneous sampling to identify and investigate 31 palustrine wetlands spread across the city of Nairobi. Data were collected using observation checklists and archival review. Correlations and multiple regression analysis were performed in IBM SPSS Statistics 21. It was found that wetland configuration significantly affected the biodiversity of AM at R<sup>2</sup> = 0.587, F (6, 23) = 5.447, <span>P</span> &lt; 0.001. The study highlights the need to identify the optimum wetland configuration pattern for the biotic enhancement and conservation of AM in palustrine wetland habitats in urban landscapes. Consequently, the ecological stability of urban wetland communities, their accessibility, as well as the innate affection by urban residents, become a desired conservation goal in urban planning and design.</span>","author":"","siteTitle":"Journal of Urban Ecology Current Issue","siteHash":"b2629340d80db12a388ca36fcbfe9116474ee0004e4144e67708fd2b8d69c975","entryHash":"3e7cbd73ae4c1b14dee70d6c87ef95d32ac61e585e541d4b65259c94d05e4643","category":"Environment"}