{"title":"Renaming the ‘OS-D/CSP’ family: ‘Lipoid-Binding Proteins’—Molecular Nomenclature, Structure, Expression, Evolution, and Intracellular Functions","link":"https://www.preprints.org/manuscript/202410.0043/v1","date":1727786244000,"content":"Chemosensory proteins (CSP) are found in the olfactory sensory organs (antennae and maxillary palps) and/or gustatory sensory organs (labellum and legs) and long been accepted to function through binding ‘odorants’. Yet, the same CSPs are also expressed in many tissues other than olfactory and gustatory organs, such as gut, brain, fat body, wing, epidermis, corpora allata, pheromone gland, prothoracic gland, etc. In this review, we suggested the rename “chemosensory protein (CSP)” to “4 Cysteines Soluble Protein (4CSP). To support our idea, we reviewed CSPs from several aspects: their primary sequences, existence of CSP in insects, hexapods, and bacteria, expression during development and in other tissues, evolution of CSP genes, genomic mining, their ancestral functions and lipoid binding, function outside the chemosensory/binding aspect, their intracellular function, and from structure to function. The scope of the review per se is broad, and this is especially true given the volume of data that has been gathered on CSP expressed in ways that are not consistent with the olfactory paradigm. We discuss the Mp10 story in aphids, our research on insecticide resistance, and other lipid transport and immunity-related processes. There is substantial evidence to support the non-chemosensory aspects of CSPs, which is where the majority of discussions lean. There are still very few, if any, statements outlining the aspects of CSPs’ chemosensory properties, specifically how they activate olfactory receptor neurons (ORNs). We present an analysis showing a stronger correlation between them and the actin complex family proteins, mucins, and translation initiation factors. An additional argument is the existence of CSPs outside of insects. Therefore, strong arguments in favor of renaming chemosensory proteins are becoming evident here, outweighing the drawbacks.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3e7c7f1accc4bb53f2a0d1ddb9dd0241a86eb394484b63d722101c6204003e22","category":"Interdisciplinary"}