{"title":"Sophie Unwin and Jenny Holl: the duo taking the tandem racing scene by storm","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/sophie-unwin-and-jenny-holl-the-duo-taking-the-tandem-racing-scene-by-storm","date":1624295137000,"content":"\n      <p><span>Watching Jenny and Sophie cross the finish line of the tandem road race, you’d be forgiven for thinking they were a seasoned pairing with a wealth of experience. For them, though, the victory was entirely unprecedented. It was only their second race, and they’d had limited preparation, having only ridden the tandem together for the first time in March of this year. </span></p>\n<div></div>\n<p>Both riders admit that they didn’t expect to be stepping into the rainbow bands only a few months later, winning one of the most prestigious jerseys in the sport. “We’d done the World Cup in Belgium, so we knew we were strong, but I definitely didn't expect to win,” Jenny tells us from back home in the UK, where the result is finally sinking in for both riders.</p>\n<p><span>“My strategy in the race was just to do what Jenny told me,” Sophie says. New to the sport of cycling, she was spotted by Team GB at a talent-ID selection camp last August. “They were looking for a sprint stoker on the tandem,” she explains. “I went to that and they basically said: you're not a sprinter, but you might be alright with endurance. That was my first time on a tandem. I'm still very new to it.”</span></p>\n<p><span>Sophie’s inexperience with road racing is perhaps what makes her pairing with Jenny such a successful match. Holl spent the last four years as part of the Great Britain Senior Academy, racing internationally on the road and picking up some formidable results as part of the team pursuit squad, notably a silver medal in the European Games in 2019. When talking about her decision to transition to tandem racing, Jenny explains she was on review to stay in the Senior Academy and she had specific targets to meet if she was to remain in the squad.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_6352_1024x1024.jpg?v=1624278482\" /></span></p>\n<p><em><span>Photo: Alex Whitehead/SWPix</span></em></p>\n<p><span>“I had to try and hit those in January and I just missed out on them, so that was kind of the end of my Academy time,” she says. “I thought: okay that's a shame, but actually, I've got another opportunity on the tandem, I can give this a go and I'm really keen for it.”</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-l39ion-lionesses\"><strong><em>Related – Introducing the L39ION Lionesses</em></strong></a></p>\n<p><span>Holl channelled her disappointment into her new endeavour and explains that, actually, this gave her a new found motivation. After years of a similar racing calendar and monotonous routine, a fresh challenge was invigorating for the 21-year-old athlete. “It's brand new, it's like being a youth again,” she explains. “It's really exciting.”</span></p>\n<p><span>There has been a lot for Jenny to learn when it comes to racing on the tandem, and it’s a process that she and Sophie have had to work through together. Jenny is able to provide tactical advice from her first-hand experience racing on the road, but she notes that bike handling is an important factor when it comes to riding the tandem and she’s had to spend a lot of time refining her technique.</span></p>\n<p><span>She explains that there was a technical corner on the World Championship course, which the duo struggled with each lap. “With one kilometre to go, we were just off the back of the front group,” Jenny says. “We came around this corner, and I was like: Sophie, if we are going to do anything in this race, we need to just go right now, we don't have any other choice. We just rushed the back of the group and went as hard as we could from there.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB1_4139_1024x1024.jpg?v=1624278598\" /></span></p>\n\n<p><span><em>Photo: Alex Whitehead/SWPix</em></span></p>\n<p><span>Sophie explains that communication is important between the two riders to ensure that they can maintain a good pace management strategy. “I think Jenny probably could push a harder pace than I'm currently capable of, because I am still so new to it,” she says. Still working full-time and trying to juggle this with her training, Sophie explains that she wasn’t expecting to win races so soon.</span></p>\n<p><span>“I almost quit my job before the Worlds, as they weren’t going to let me have the time off,” she says. “But that would have been risky as I really didn’t know how it was going to go!” Sophie can take confidence from their extremely successful campaign though, and talks about how she hopes to transition to part-time work soon, so she can dedicate more time to cycling.</span></p>\n<p><span>Living at opposite ends of the country, with Jenny based in Manchester and Sophie in the South of England, training together can prove difficult, especially with the time constraints of everyday life. “We did one weekend together before we went to the World Cup in Belgium and then we rode together while we were there, but we didn't live together again until we went to Portugal for the World Champs, so we do a lot of our training separately,” Jenny says.</span></p>\n<p><span>Sophie explains that she and Jenny have a good friendship and this bond is imperative when riding a tandem together, as she has to instil confidence in Jenny who has the main control over the bike. “In the race, I can't really see or tell what's going on around us,” she says. “There is a lot of trust that Jenny's doing the right thing and that she will get us around safely. It does help that we get on really well, without that trust, it would be a lot more difficult.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_6584_1024x1024.jpg?v=1624278725\" /></span></p>\n\n<p><span><em>Photo: Alex Whitehead/SWPix</em></span></p>\n<p><span>For the two riders, this journey is just at the very beginning, and both of them acknowledge how much scope for improvement there is. “I think Paris 2024 is the real aim and the long term goal,” Jenny explains. “By that point, we'll have a few years as a pairing and will have developed and worked on our strengths and weaknesses”</span></p>\n<p><span>In the meantime, Jenny hopes to also focus on some races on her solo bike with her team, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/elinor-barker-tekkerz\">Tekkerz</a>, who she explains have been extremely supportive of her commitments to tandem racing and training in her time with them so far. “I really wanted to ride for them, because it just looked like such a nice place to be, it looked really fun,” she says. “I knew they'd support all my track riding, which can obviously be very intense at times”</span></p>\n<p><span>The paralympics this year are a possibility for Sophie and Jenny, but final selection hasn’t yet been made for the GB squad. They admit that it’s early in their time as a pairing to compete in an event of such magnitude, but their performances at the World Championships give a clear indication that they have the talent to perform at the highest level.</span></p>\n<p><span>“We don't know what our limits are, so we've just got to do everything we can,” Jenny explains.</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3e81c30440c1c5b8a7dc3ad6601e15c46431d822e4cc27ffd68276e4742f0840","category":"Cycling"}