{"title":"LGBTQIA+ inclusion in the global health policy agenda: A critical discourse analysis of the Lancet Commission report archive","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311506","date":1728050400000,"content":"<p>by William E. Rosa, Sofia Weiss Goitiandia, Debbie Braybrook, Nicholas Metheny, Kailey E. Roberts, Meghan McDarby, Mia Behrens, Cathy Berkman, Gary L. Stein, Adebola Adedimeji, Donna Wakefield, Richard Harding, Dingle Spence, Katherine Bristowe</p>\r\nContext <p>LGBTQIA+ people worldwide experience discrimination, violence, and stigma that lead to poor health outcomes. Policy plays a crucial role in ensuring health equity and safety for LGBTQIA+ communities. Given Lancet Commissions’ substantial impact on health policy across domains, we aimed to determine how LGBTQIA+ communities and their care needs are incorporated throughout Lancet Commission reports and recommendations.</p> Methods <p>Using critical discourse analysis, we analyzed 102 Commissions for inclusion of and reference to LGBTQIA+ communities using 36 key terms. Three levels of analysis were conducted: 1) micro-level (overview of terminology use); 2) meso-level (visibility and placement of LGBTQIA+ references); and 3) macro-level (outlining characterizations and framing of references with consideration of broader social discourses).</p> Findings <p>36 of 102 (35%) Commissions referenced LGBTQIA+ communities with 801 mentions in total. There were minimal (9/36) references made in the “Executive Summary,” “Recommendations,” and/or “Key Messages” sections of reports. LGBTQIA+ communities were most frequently discussed in reports related to HIV/AIDS and sexual and reproductive health. Few Commissions related to public health, or chronic conditions (9/60) referenced LGBTQIA+ communities. Some reports made non-specific or unexplained references; many discussed the LGBTQIA+ population without specific reference to sub-groups. LGBTQIA+ communities were often listed alongside other marginalized groups without rationale or a description of shared needs or experiences. We identified framings (legal, vulnerability, risk) and characterizations (as victims, as blameworthy, as a problem) of LGBTQIA+ communities that contribute to problematizing discourse.</p> Conclusions <p>LGBTQIA+ people were rarely included in the Commissions, resulting in an inadvertent marginalization of their health needs. Policy initiatives must consider LGBTQIA+ groups from a strengths-based rather than problematizing perspective, integrating evidence-based approaches alongside community-based stakeholder engagement to mitigate inequities and promote inclusive care and policymaking.</p>","author":"William E. Rosa","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3e811d650e57340bee6d7fb447bbedff7449eb6ff8062a68df9344f1c7312800","category":"Interdisciplinary"}