{"title":"Climate mediates the trade‐offs associated with phenotypic plasticity in an amphibian polyphenism","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14187?af=R","date":1727505177000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/3bec5973-7078-4887-9871-ff798493f84d/jane14187-toc-0001-m.png\" alt=\"Climate mediates the trade-offs associated with phenotypic plasticity in an amphibian polyphenism\" />\n<p>Our research provides important and novel insight into how climate change underlies the maintenance of phenotypic plasticity.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPolyphenisms occur when phenotypic plasticity produces morphologically distinct phenotypes from the same genotype. Plasticity is maintained through fitness trade-offs which are conferred to different phenotypes under specific environmental contexts. Predicting the impacts of contemporary climate change on phenotypic plasticity is critical for climate-sensitive animals like amphibians, but elucidating the selective pressures maintaining polyphenisms requires a framework to control for all mechanistic drivers of plasticity.\n\nUsing a 32-year dataset documenting the larval and adult histories of 717 Arizona tiger salamanders (<i>Ambystoma mavortium nebulosum</i>), we determined how annual variation in climate and density dependence explained the maintenance of two distinct morphs (terrestrial metamorph vs. aquatic paedomorph) in a high-elevation polyphenism. The effects of climate and conspecific density on morph development were evaluated with piecewise structural equation models (SEM) to tease apart the direct and indirect pathways by which these two mechanisms affect phenotypic plasticity.\n\nClimate had a direct effect on morph outcome whereby longer growing seasons favoured metamorphic outcomes. Also, climate had indirect effects on morph outcome as mediated through density-dependent effects, such as long overwintering coldspells corresponding to high cannibal densities and light snowpacks corresponding to high larval densities, both of which promoted paedomorphic outcomes.\n\nBoth climate and density dependence serve as important proxies for growth and resource limitation, which are important underlying drivers of the phenotypic plasticity in animal polyphenisms. Our findings motivate new studies to determine how contemporary climate change will alter the selective pressures maintaining phenotypic plasticity and polyphenisms.\n</p>","author":"Mark A. Kirk, \nAlycia C. R. Lackey, \nKelsey E. Reider, \nScott A. Thomas, \nHoward H. Whiteman","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"3e82c0a51eed440e359f05e3869d4d3638b206365be51f6808345076e989bdeb","category":"Environment"}