{"title":"Tundra wolf spider (Araneae: Lycosidae) abundance and phenology shift with distance from a northern highway","link":"https://academic.oup.com/isd/article/doi/10.1093/isd/ixae008/7658015?rss=1","date":1714003200000,"content":"<span><div>Abstract</div>Climate change is disproportionately impacting the North, and northern arthropods are particularly vulnerable to disturbances. The Dempster Highway is a gravel road that crosses the northern Yukon Territory in Canada, and wolf spiders (Araneae: Lycosidae) are the top arthropod predators on the tundra in this region. We investigated the effects of the Dempster Highway on subarctic tundra wolf spider abundance, phenology, and community composition by actively sampling 8 paired plots near (20 m) and far (200 m) from the road. Species richness did not differ with distance from the road, but total wolf spider abundance was much lower near the road, and this was driven by decreased abundance of the dominant tundra wolf spider species, <span>Pardosa lapponica</span> (<a href=\"#CIT0026\">Thorell, 1872</a>). The overall proportion of females carrying egg sacs was higher near the road, suggesting advanced phenology in response to increased temperatures near the road. Together, these results indicate that the Dempster Highway impacts tundra wolf spider communities, which may have important consequences for food web dynamics and ecosystem function.Les changements climatiques ont un impact plus important sur le Nord, et les arthropodes nordiques sont particulièrement vulnérables aux perturbations. La route Dempster est une route de gravier qui traverse le nord du territoire du Yukon au Canada, et les araignées-loups (Araneae: Lycosidae) sont d’importants prédateurs d’arthropodes de la toundra de cette région. Nous avons étudié les effets de la route Dempster sur l’abondance, la phénologie et la composition de la communauté des araignées-loups de la toundra subarctique en échantillonnant activement huit parcelles appariées proches (20 m) et éloignées (200 m) de la route. La richesse des espèces ne différait pas avec la distance par rapport à la route, mais l’abondance totale d’araignées-loups était inférieure près de la route, et cela peut être attribué à une diminution de l’abondance de l’espèce dominante d’araignées-loups de la toundra, <span>Pardosa lapponica</span> (<a href=\"#CIT0026\">Thorell, 1872</a>). La proportion globale des femelles portant des cocons était plus élevée près de la route, suggérant une phénologie avancée en réponse à l’augmentation des températures près de la route. Ces résultats indiquent que, globalement, la route Dempster a un impact sur les communautés d’araignées-loups de la toundra, ce qui peut avoir des conséquences importantes sur la dynamique du réseau trophique et le fonctionnement de l’écosystème.</span>","author":"","siteTitle":"Insect Systematics and Diversity Current Issue","siteHash":"d4d59e2090793e303021830a9c164d689828dc5448b6052be7ec32e87f45cab0","entryHash":"3e8f41b5a24c1ed45378f091259f4b0accc25695b8a5ccbe48119183f4c2df28","category":"Environment"}