{"title":"Saddle stories: From Issue 117 - Body","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/saddle-stories-from-issue-117-body","date":1677229202000,"content":"\n      <p>Established in 1866, Brooks have become synonymous with quality-made saddles. Made to last, their saddles are timeless, long-lasting and have been crafted to provide comfort, durability, style and versatility – on every type of ride.</p>\n<p>For <a href=\"https://www.rouleur.cc/pages/subscribe\">Issue 117 of Rouleur Magazine</a>, four people shared their Brooks saddle story, bringing to light their cycling journeys which led them to becoming a part of the Brooks saddle club. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/share-your-brooks-saddle-story\"><em><strong>Do you own a Brooks saddle? We'd love to hear your story. </strong></em></a></p>\n<h3><span>Dean Ratcliffe</span></h3>\n<p><b>Richmond, London</b></p>\n<p><span>Age: </span><b>64</b></p>\n<p><span>Job: </span><b>CEO, data analysis company, volunteer at A&amp;E, Kingston Hospital NHS Foundation Trust</b></p>\n<p><span>Bike: </span><b>1958 Bianchi</b></p>\n<p><span>I grew up in the North and my first bike was a Claud Butler, with a three-speed Sturmey Archer gear. But when I was studying for my 11-plus, as an incentive my mum said, if you pass, you can have whatever bike you want. I stupidly got a brand-new Raleigh Chopper, blue. It looked great. And it was absolutely crap – I lived in a village outside Wigan, so the way we had to get to football, fishing or school was on bikes. My mates had racers and I was on that bloody Chopper.</span></p>\n<p><span>When I went to university my cycling dropped a bit, but in my late 20s I decided to get a Muddy Fox mountain bike. I went to live in Paris, took the bike with me and used to go riding in Fontainebleau, and even up the Champs-Élysées. After getting married we moved to Boston, where I used to cycle across to the harbour, get a boat to Cape Cod, ride to Martha’s Vineyard and go to Nantucket. Or take trips to Vermont in the spring or autumn.</span></p>\n<p><span>When I moved back to London I worked for Reuters and started commuting by bike in about 1998 – I saw the London Eye get built, saw the congestion charge start and got knocked off three times. Seven bikes nicked.</span></p>\n<p><span>When my son went to university, I bought my first road bike and loved it. I started acquiring more bikes – got a gravel bike, two road bikes, I’ve got a Canyon Aeroad, but quite </span><span>a few years ago I was cycling out to Windsor and I bumped into these old boys on their amazing bikes: the Club Cicli Artigianali. There was one who was 50 and his bike was 50 years old; another guy was 70 and had a 70-year-old bike. I decided as a treat for my 60th birthday to get myself a vintage bike, a 1958, built by Bob Johnson at our club. I wanted it to be Italian, I wanted it to have Campagnolo gears, Mavic wheels and a Brooks saddle and I wanted it to look damn good. </span></p>\n<p><span>It’s one of those bikes that you get somebody riding a Pinarello Dogma and they’ll stop and tell you that they love your bike. There’s a joy to riding them and it’s a pain when the bloody things go wrong, but it’s just a work of art.</span></p>\n<p><span>One of the things I like about cycling is the aesthetics. You don’t get it in other sports. But I like the physical sensation as well. My Aeroad is like a wild stallion, but I don’t feel I’ve got control of it. You don’t go as fast on the Bianchi, but it’s like how I imagine driving an old Rolls Royce would be. You get a feel for travelling and because you don’t go as fast, you appreciate the surroundings a lot more.</span></p>\n<p><span>Cycling keeps you fit, but it’sthe sheer pleasure of getting on your bike, going somewhere and getting you out. Once you’re on your bike, you clip in and all’s good with the world. It’s like walking a dog, you drink in nature, you see the river, you get all the seasons.</span></p>\n<p><b>Favourite ride: </b><span>To Windsor, through Chertsey, Sunningdale and the Great Park. We avoid Windsor itself, because it’s a sod to get back from, but we skirt around the park and come back. It’s just a lovely ride and I love the hills as well.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/041A8633-Edit_copy.jpg?v=1675762531\" alt=\"Dean Ratcliffe on his Bianchi bike\" /></div>\n\n<p><span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/share-your-brooks-saddle-story\"><em><strong>Do you own a Brooks saddle? We'd love to hear your story. </strong></em></a></span></p>\n<h3><span>Honor Elliott</span></h3>\n<p><b>Bow, London</b></p>\n<p><span>Age:</span><b> 29</b></p>\n<p><span>Job:</span><b> Freelance cycling photographer</b></p>\n<p><span>Bike:</span><b> Pink Omnium Cargo Mini-Max</b></p>\n<p><span>We got this bike in lockdown. I was really ill and my boyfriend Theo was having to do everything for both of us. One of the main drivers for it was simply for errands like grocery shopping without needing a car. We live on a boat, so it’s only towpath access, and no deliveries. We also got a second dog, and needed a way to be able to carry both by bike as two wouldn’t fit in a backpack or dogseat. Obviously we have limited space on a narrowboat so wanted to get one bike that would kind of fit us both, and the Mini-Max was perfect with its small overall footprint but decent capacity. It’s basically our car, and as it rides like a hybrid it’s also become our standard go-to commuter bike (particularly useful for bulky photoshoot things too). Our other bikes are all a bit fancy or very specific for certain use, but this is our go-to that we can just lock up outside. Also, when my health is bad we use the bike as a very useful mobility aid as well, with Theo carting me around, slightly regretting that we didn’t choose electric.</span></p>\n<p><span>Theo chose the Brooks saddle for this bike, finding one that had been in the family for years, both as his brother’s and then his mum’s and eventually it became his. It was a solid option for comfort for both of us.</span></p>\n<p><span>I got into cycling as an adult, but I’ve made up for lost time. I went from getting a bike to commute to university when I was 21, to thinking that cycling was my entire world and ending up racing too. It now makes up most of my career – every aspect of my life is related to bikes in some way. We do crit racing, cross racing, track, fixed crits, everything. Bikes everywhere, all the time. </span></p>\n<p><span>When I first started riding, I was blown away by the freedom it give you to get places under your own steam. I grew up in a small town where I relied on lifts or a really bad bus system to get me anywhere. I moved to London and was like, oh my God, why couldn’t I have done this sooner? But aside from the convenience and the freedom, it was also really fun. I discovered that despite having mostly avoided sport my whole life until then, I actually really enjoyed being active and competitive.</span></p>\n<p><b>Favourite ride: </b><span>I was thinking the other day just how underrated a central London middle-of-the-weekday ride is. Not rush hour. I used to have a nine-to-five and only got to commute during horrible times, and missed the freedom I had when I was at uni or working as a courier. But now that I work freelance, I get opportunities to ride in the middle of the day a lot more; I like the dense urban roads when they’re quieter. As roadies, we think a ride has to go into the lanes. But I could just as easily go for a ride around the centre of London. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/041A3090-Edit_copy.jpg?v=1675762752\" alt /><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/share-your-brooks-saddle-story\"><em><strong>Do you own a Brooks saddle? We'd love to hear your story. </strong></em></a></span></p>\n<h3><span>Christine Geiger</span></h3>\n<p><b>Fulham, London</b></p>\n<p><span>Age: </span><b>26</b></p>\n<p><span>Job:</span><b> Graphic designer</b></p>\n<p><span>Bike: </span><b>Stayer OG+ with</b> <b>Scribe wheels</b></p>\n<p><span>My gravel bike is a Stayer OG+, custom fitted for 700C wheels and absolutely no toe touch. I worked with Stayer creatively during lockdown and so it was kind of a parting gift from them when I returned to the world of office jobs. I’m running Scribe wheels; they are wicked loud and a great match for the frame. There’s a nice story in there about a London-based bike manufacturer and wheels from an Irish company. </span></p>\n<p><span>I’ve got a Whisky Monstercross fork on the front because it’s basically just like having suspension. I love that combination of steel and carbon together; it’s right where you want to be. And obviously with the alloy rims, there’s this fun story of these three materials all coming together. </span></p>\n<p><span>The paint finish is called ‘iridescence larva’, and if the name doesn’t already knock you off your seats, seeing it in person will. It’s a colour shift from a brambly purple to gold, so when the sun does hit it, which occasionally does happen in the UK, it’s pretty magical. Every component throughout has its own story of how it ended up on the bike. The Ingrid cranks, for example, are bartered from filming the East Devon Trail with Stayer. I’m also a Hutchinson Cycling Ambassador, so I’ve got some lovely Hutchinson Tundras on, currently at 45mm but I reckon I will bump up to 50mm. I’m off to ride volcanoes in Lanzarote with Sisters in the Wild soon, so every millimetre counts.</span></p>\n<p><span>I’m originally German, but I grew up in the skewer that is central Europe: I’ve lived in Italy, Switzerland, Germany and Sweden. I moved to </span><span>London for university and needed a smarter way of commuting, which came to me in the form of a Bobbin Brownie. It was dark blue with cream tyres, and it was my pride and joy. Eventually the bikes got smaller and faster and more aggressive until I kind of fell into the world of fixed gears. It was a nice, fun, urban, very community-driven space, where I made friends and connections that really sparked my passion for cycling.</span></p>\n<p><span>I got a road bike. Then I got a gravel bike. Then I got another fixed gear bike. I’ve done a couple of fixed-gear crits, a load of bike-packing and you can usually spot me in London with a camera documenting my friends and myself riding bikes in and around the city. It’s kind of all exploded and I’ve really found my happy place in that intersection of the Venn diagram of creativity and bikes. I think it’s just incredible that a bunch of triangles and some circles have brought so many people together. It seems so abstract that we’re all such fanatics about this moving geometry. I’ve met some of the best people in my life just because I happen to ride a bike. Nowhere else could you find such an eclectic mix of people that you get along with so well just because you’ve got cycling in common. I find that particularly in the fixed-gear and gravel worlds, there is no formula or rules to follow. You create an extension of yourself when you are cycling, and nobody can do that better than you. </span></p>\n<p><span>I never considered myself to be an athletic person, but suddenly I’ve found that I spend every moment on my bike. I ride to work on my bike, I work with bikes, and then I ride my bike to meet my friends and then we bike together. Racing aside, there’s no competition to win at cycling, you can just exist with your bike. I’m a real advocate for doing things because you find personal joy and meaning out of them, and I don’t think I’ve ever met anybody who hasn’t enjoyed cycling.</span></p>\n<p><span><b>My favourite ride:</b> I’ve really enjoyed doing Brother in the Wild in Dorset the last couple of years. The annual trip to the Purbecks is a milestone in my year, like for so many others. The people, the landscape, the apple cake... Brother in the Wild just gets that cycling is about more than just the bikes.<br /></span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/041A0442-Edit_copy2.jpg?v=1675763271\" alt /><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/share-your-brooks-saddle-story\"><em><strong>Do you own a Brooks saddle? We'd love to hear your story. </strong></em></a></span></p>\n<h3><span>Mat Shreeve</span></h3>\n<p><b>Kentish Town, London</b></p>\n<p><span>Age: </span><b>39</b></p>\n<p><span>Job: </span><b>Innovation consultant &amp; green economy investor</b></p>\n<p><span>Bike: </span><b>Tern GSD R14, Standert Erdgeschoss, Brother Allday and Brompton P-Line</b></p>\n<p><span>I was a mountain biker years ago. I never raced, but just did it for leisure. Following a global career, I began commuting once back in London in 2018, so not even that long. When working internationally, I rode a dropped bars road bike for the first time in New Zealand. My brother-in-law lent me his old Bianchi and we went for a 70km ride, which was very different from what </span><span>I was used to, which was riding 70km on mud. I spend a good chunk of my time in Wales and </span><span>I have an older 26er there, take a gravel bike there or rent a 29er with modern tech, like dropper posts. Hitting the trails is just such a great escape and form of expression. A good mountain bike on a well-maintained trail is definitely one of my </span><span>top hobbies.</span></p>\n<p><span>I’m lucky enough to have made bikes central to my career, and the freedom and accessibility is what attracts me. Last Friday I had a doctor’s appointment at a quarter past 10, I was in Rapha Soho until 9:45, rode home on my Standert, jumped back on my Brompton and was at the doctor’s five minutes before my appointment. Twenty-five minutes door-to-door with a bike swap – you couldn’t do that in a car. I can just hop on the right bike for the task and go and have a meeting in VIA Atelier in five minutes’ time. It makes me more efficient as a tradesperson and a freelancer and a dad.</span></p>\n<p><span>I work in active travel to a certain degree. I’ve got use of an Urban Arrow cargo bike at the minute, which isn’t mine, but belongs to an electrician </span><span>I work for, The Cycling Sparks. Aaron at Cycling Sparks has got a fleet of them, and when he needs me I go and join him and take all my kit in the front of the cargo bike. Anything in zone one or two, we’ve got down because nobody wants to park a van there – you just can’t park. There are too many Amazon delivery vans, DPDs, Deliveroos – big tech has taken over the roads; that’s what seems to be causing so much of the traffic. Aaron got his latest Rohloff-geared Urban Arrow Cargos with help from a grant from the Energy Saving Trust and he lines up loads of jobs in central London.</span></p>\n<p><span>I work in anything to do with sustainability. I led the carbon footprinting teams calculating the environmental impact of three of the UK’s six big supermarkets for their annual accounting. One of my current freelance clients is BackPedal, which is a GPS-tracked eBike recovery start-up that’s been around for about 18 months and has a 100 per cent success rate. BackPedal’s customers can enjoy the ride and have no worries about using their eBikes for car replacement chores, because if the worst happens and that car-replacement asset gets stolen from where it’s locked, then ex-military, ex-police or off-duty Service people will go and recover it on their behalf. I’ve also worked with Fettle, Rapha and many other cycling and green economy and sustainability-related businesses. It’s the future.</span></p>\n<p><span>I’m lucky to have four bikes with Brooks saddles. The first one I bought was the leather B17 in red, because I was doing up an old Vanmoof 6.1 bike, and I just wanted the right finishing kit on it for that Dutch city bike look. That has now been sold and the finishing kit bequeathed to my Tern GSD r14, an e14 Rohloff-geared cargo bike. It’s our family wagon basically and it’s a beautiful thing to ride around town. </span></p>\n<p><span>I also have three C17s, an All-Weather Carved on my custom Brompton, an orange Cambium on my Brother Allday, which should have been </span><span>a pub bike but turned out to be too fancy to leave outside the put. And then the most recent one, which I’m rather proud of, is the mud green Cambium on a Standert Erdgeschoss in their Moss Def colourway.</span></p>\n<p><span>We live car-free. I’ve got </span><span>a Tesla long-range booked for the weekend and when I’m done I can pop it back into its spot – I don’t need to have that as </span><span>a trophy in my life. My bikes do that instead.</span></p>\n<p><b>My favourite ride:</b><span> One that I regularly do would be the fire access roads in the Cambrian mountains. Maybe going a bit further north in Wales too. The London equivalent would be going to Epping – you’re not looking over your shoulder the whole time at cars coming at you. But on a more practical level, my ride tomorrow will be around the Regent’s Park and into London. You can be chasing through the backstreets, knowing that I can go this way or that way, and get back from Soho and only hit four or five traffic lights…it’s a dream.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/041A7901-Edit_copy.jpg?v=1676624915\" alt /><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/share-your-brooks-saddle-story\"><em><strong>Share your saddle story with Rouleur to be feature in our next online article.</strong></em></a></span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"6dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3e9374c0831d04b699bed8c5db05293c6a0711e58b1e7d04a57ba1","category":"Cycling"}