{"title":"Long-term clinical outcomes of image-guided percutaneous coronary intervention in acute myocardial infarction from the Korea Acute Myocardial Infarction Registry","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304843","date":1717596000000,"content":"<p>by Youngjoon Kwon, Namkyun Kim, Chang-Yeon Kim, Do-Hoon Kim, Hyewon Shin, Min-Su Jung, Jong Sung Park, Yoon Jung Park, Bo Eun Park, Hong Nyun Kim, Se Yong Jang, Myung Hwan Bae, Jang Hoon Lee, Dong Heon Yang, Hun Sik Park, Yongkeun Cho, Kwang Soo Cha, Seung-Ho Hur, Jin-Yong Hwang, Myung Ho Jeong, on behalf of the KAMIR- NIH (Korea Acute Myocardial Infarction Registry- National Institutes of Health) Investigators </p>\r\n\r\nImaging modalities for percutaneous coronary intervention (PCI), such as intravascular ultrasound (IVUS) or optical coherence tomography (OCT), have increased in the current PCI era. However, their clinical benefits in acute myocardial infarction (AMI) have not been fully elucidated. This study investigated the long-term outcomes of image-guided PCI in patients with AMI using data from the Korean Acute Myocardial Infarction Registry. A total of 9,271 patients with AMI, who underwent PCI with second-generation drug-eluting stents between November 2011 and December 2015, were retrospectively examined, and target lesion failure (TLF) at 3 years (defined as the composite of cardiac death, target vessel myocardial infarction, and ischemia-driven target lesion revascularization) was evaluated. From the registry, 2,134 patients (23.0%) underwent image-guided PCI (IVUS-guided: n = 1,919 [20.6%]; OCT-guided: n = 215 patients [2.3%]). Based on propensity score matching, image-guided PCI was associated with a significant reduction in TLF (hazard ratio: 0.76; 95% confidence interval: 0.59–0.98, p = 0.035). In addition, the TLF incidence in the OCT-guided PCI group was comparable to that in the IVUS-guided PCI group (5.3% vs 4.7%, p = 0.903). Image-guided PCI, including IVUS and OCT, is associated with favorable clinical outcomes in patients with AMI at 3 years post-intervention. Additionally, OCT-guided PCI is not inferior to IVUS-guided PCI in patients with AMI.","author":"Youngjoon Kwon","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3ea6eec833a2987b53e72da2a2a7d71d23930e320cc9f2ba94824444aa7bf8cd","category":"Interdisciplinary"}