{"title":"Giro Donne: the Debrief","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-donne-the-debrief","date":1626356918000,"content":"\n      <p><span>The GC race at the Giro d’Italia Donne might have been wrapped up on stage 2, but the tenth and final stage took place Sunday in Cormons — albeit with the GC podium unchanged. Defending champion, Anna van der Breggen, took the win with her teammates Ashleigh Moolman Pasio and Demi Vollering in second and third. </span></p>\n<p><span>The GC might have been decided early on but the battle for stage victories salvaged the race. Without a close-run competition for the pink jersey to focus on — Van der Breggen’s margin was over a minute and a half from stage 2 onwards — the only tension in the race lay in individual stages. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GiroWomens_11th_July-37_1024x1024.jpg?v=1626337328\" /></div>\n<p><em><span>Anna van der Breggen moved into pink on stage two and kept it until the end. Photo: Sean Hardy</span></em></p>\n<p><span>At one end of the spectrum was the unparalleled Marianne Vos making history by taking her <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/opinion-marianne-vos-has-made-history-this-week-let-s-shout-about-it\">29th and 30th Giro Donne</a> stage wins and cementing her position as a cycling legend. Vos took her two wins in entirely different styles; the first, on stage three into Ovada saw the 34-year-old dominate a sprint against Lucinda Brand from a four-up breakaway, the second, on stage 7 came in the form of an explosive attack from a two-up move with Elisa Longo Borghini that Vos carried to the line from 200m to go. </span></p>\n<p><span>In contrast, the race saw four first-time Giro Donne stage winners crowned, between both young and experienced riders. The longest in the making was Ashleigh Moolman Pasio who, to the surprise of many, a Giro Donne stage win had evaded until this year. The 34-year-old took none other than the queen stage to Monte Matajur, demonstrating her supreme climbing talent.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Giro_Womens_8th_July-27_1024x1024.jpg?v=1626337643\" /></div>\n<p><em><span>Marianne Vos. Photo: Sean Hardy. </span></em></p>\n<p><span>Elsewhere, 22-year-old Lorena Wiebes took her first stage win in her debut at the race on stage 5, before backing it up with a second victory on stage 8, both from bunch kicks — yet again proving herself as the fastest rider in the women’s peloton right now. Her closest rival, Emma Norsgaard came second to Wiebes on stage 5 and prophetically declared “</span><span>What's next? To win, for sure,\" in her post-race interview before going on to take her own first stage victory in Colico the next day — beating Coryn Rivera to the line. </span></p>\n<p><span>Rivera herself had been threatening to take a win throughout the race after playing an integral role in Wiebes’ wins as her leadout woman, and then narrowly missing out to Norsgaard. The American rider finally crossed the line first on the final stage of the race, touchingly dedicating her win to her late father — a healthcare worker who died from Covid-19 — saying “I had an angel on my shoulder today.” </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GiroWomens_11th_July-57_1024x1024.jpg?v=1626336941\" /></div>\n<p><em><span>Coryn Rivera leads the select group on stage ten. Photo: Sean Hardy.</span></em></p>\n<p><span>The looming prospect of Tokyo meant that all eyes were on Olympic-bound riders’ form throughout the race. Aside from the obvious candidates of Van der Breggen, Vos, and Vollering, Lizzie Deignan — who finished fourth on GC — was looking razor sharp. Her teammate, Elisa Longo Borghini took a while to find her legs after losing time on stage 2 — and passing Trek’s GC mantle to Deignan — but as the race progressed so did she, clawing her way up to 14th on GC from 22nd after stage 2.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\"><em><strong>Sign up to our women's cycling newsletter</strong></em></a></p>\n<p><span>The race also revealed the wealth of talent among young riders in the women’s peloton including Wiebes and Norsgaard, 21 and 22 years-old respectively. Away from the sprints, 23-year-old Marta Cavalli of FDJ Nouvelle Aquitaine Futuroscope put in a strong performance which saw her come 6th overall and into the best Italian jersey. Cavalli rode a consistent race with four top 10 finishes including fourth on the queen stage behind the untouchable SD Worx trio. Her teammate, Evita Muzic, also impressed, barely placing outside the top 15 on each stage.  </span></p>\n<div>Muzic’s compatriot and France’s only Olympic hopeful on the road, 22-year-old Juliette Labous, finished right behind Cavalli in 7th overall and also claimed her fair share of top-10 finishes throughout the race. 20-year-old Kiwi Niamh Fisher-Black ensured that SD Worx took home the majority of the classification jerseys by claiming the title of best young rider to give them a near-sweep — only the QOM title, evaded them, which was taken by Lucinda Brand. </div>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Giro_Womens_8th_July-36_1024x1024.jpg?v=1626337075\" /></span><span><em><span>Niamh Fisher-Black in the white jersey of best young rider. Photo: Sean Hardy.</span></em></span></p>\n<p><span>While all of this action was taking place, however, fans were left frustrated by inconsistent live coverage which was sporadic in length and timing each day. Without warning, less than 10km was broadcast of some stages and more than 30km of others. Not one second of the queen stage made it to live broadcast, and viewers had to settle for delayed highlights instead with the organisers citing signal difficulties. </span></p>\n<p><span>Whether the race will regain its Women’s World Tour status in 2022 remains to be seen given that the UCI explicitly warned that the Giro’s return to the highest category would be contingent on the 2021 edition meeting the right standards. With the Tour de France Femmes on the way and due to take place in the same month, time will tell whether the newer race takes precedence on rider’s calendars, leaving the Giro languishing in the lower ranks. </span></p>\n<p><span></span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3ea7668c349dc036a5644c02d61da33987784aa3b5d968453b9745ab5664aa50","category":"Cycling"}