{"title":"Apple to Soon Let Users Fix Subscription Billing Issues Directly Within Apps","link":"https://www.macrumors.com/2023/04/20/apple-fix-billing-issues-within-apps/","date":1681983886000,"content":"Apple will soon make it possible for users to fix <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> subscription payment issues within apps, rather than having to go into their device's Settings to make the necessary changes.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/in-app-billing-problem.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nCurrently if a third-party app has an issue with an auto-renewing subscription – if the payment method is no longer valid, for example – users must exit out of the app and make the changes in the <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a> section of the Settings app.\r<br />\n\r<br />\nThis system often forces users to take out the subscription again, which can cause them to lose any in-app discounts or introductory subscription offers. However, that's set to change. From Apple's announcement on its <a href=\"https://developer.apple.com/news/?id=mfx8xxtc&amp;1681940112\">developer website</a>:\r<br />\n<blockquote>Starting this summer, if an auto-renewable subscription doesn't renew due to a billing issue, a system-provided sheet appears in your app with a prompt that lets customers update their payment method for their Apple ID. No action is required to adopt this feature. </blockquote>The new in-app system should make it easier for users to resolve payment issues, says Apple, meaning developers should be better able to retain subscribers and benefit from in-app purchases.\r<br />\n\r<br />\nWhen it goes live in the summer, Apple says the in-app billing issue resolution sheet will require iPhones and iPads to be running a minimum of iOS 16.4 or iPadOS 16.4, respectively.<br />This article, \"<a href=\"https://www.macrumors.com/2023/04/20/apple-fix-billing-issues-within-apps/\">Apple to Soon Let Users Fix Subscription Billing Issues Directly Within Apps</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-to-soon-let-users-fix-subscription-billing-issues-directly-within-apps.2387310/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3ead925559b27465dfdf11f24eb21444d2059b176a0fbbad6a691aec93cf2a00","category":"Apple"}