{"title":"Evaluation of an autonomous acoustic surveying technique for grassland bird communities in Nebraska","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306580","date":1720188000000,"content":"<p>by Grace E. Schuster, Leroy J. Walston, Andrew R. Little</p>\r\n\r\nMonitoring trends in wildlife communities is integral to making informed land management decisions and applying conservation strategies. Birds inhabit most niches in every environment and because of this they are widely accepted as an indicator species for environmental health. Traditionally, point counts are the common method to survey bird populations, however, passive acoustic monitoring approaches using autonomous recording units have been shown to be cost-effective alternatives to point count surveys. Advancements in automatic acoustic classification technologies, such as BirdNET, can aid in these efforts by quickly processing large volumes of acoustic recordings to identify bird species. While the utility of BirdNET has been demonstrated in several applications, there is little understanding of its effectiveness in surveying declining grassland birds. We conducted a study to evaluate the performance of BirdNET to survey grassland bird communities in Nebraska by comparing this automated approach to point count surveys. We deployed ten autonomous recording units from March through September 2022: five recorders in row-crop fields and five recorders in perennial grassland fields. During this study period, we visited each site three times to conduct point count surveys. We compared focal grassland bird species richness between point count surveys and the autonomous recording units at two different temporal scales and at six different confidence thresholds. Total species richness (focal and non-focal) for both methods was also compared at five different confidence thresholds using species accumulation curves. The results from this study demonstrate the usefulness of BirdNET at estimating long-term grassland bird species richness at default confidence scores, however, obtaining accurate abundance estimates for uncommon bird species may require validation with traditional methods.","author":"Grace E. Schuster","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3eafcdbcd5ed9b14356430dcf07c26b021d1faf48d1f0db0c11f188e791922d4","category":"Interdisciplinary"}