{"title":"Entire-range Cooperative Trajectory Planning of Gliding-guided Projectiles with Weak Maneuverability","link":"https://www.preprints.org/manuscript/202405.1402/v1","date":1716457735000,"content":"In modern warfare, the diversified tasks can sometimes be challenging to fulfill with a single projectile, necessitating the incorporation of cooperation constraints in trajectory planning. Limited by the stringent requirements of the launch platform and lower costs, the maneuverability and ability to adjust the flight time range of projectiles are weak. Therefore, the rationality of performance indicators and flight time coordination strategies is especially critical. To fully exploit the control capabilities of projectiles, a battlefield area segmentation method is proposed, differentiated performance indicators and a cooperative trajectory planning model that considers the entire range of projectiles are established. Considering the limitations of existing flight time coordination strategies in applications, targeted improvements have been made in different cooperation scenarios, and a bi-level adaptive cooperation strategy(BACS) with both optimality and flexibility is proposed. To rapidly determine feasible conditions, a simple and universal method for obtaining the capability ranges of cooperation is introduced. The multi-phase optimal control problems are transformed into nonlinear programming problems using the Radau pseudo-spectral method, and simulation results show that the proposed methods are capable of handling trajectory planning tasks in different cooperation scenarios. The improved strategies effectively enhance the planning success rate under relatively harsh conditions and BACS demonstrates good compatibility with the problems studied.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3ebd81533433063c0bb1404b1d703f6d7cd343434b2af211de79b8eb669458aa","category":"Interdisciplinary"}