{"title":"Landscape of ice and fire – uniquely well-preserved Scots pine trunks reveal forest fires near the retreating Weichselian ice margin","link":"http://link.springer.com/10.1007/s00334-023-00974-6","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>Environmental conditions for trees that established in central Fennoscandia shortly after the final retreat of the Weichselian ice sheet remain poorly understood. In this study we examine tree rings of five well-preserved <em>Pinus sylvestris</em> (Scots pines) that grew in the area in front of the retreating ice sheet in northern Sweden. They became buried in flood sediments deposited by a glacial outburst flood (jökulhlaup) about 9.5–9.9 kyr cal <span>bp</span> and the aim of our study was to search for information regarding damage from fires and bioclimatic conditions in their ancient tree ring records. Our analysis, providing a glimpse into the local early Holocene environment in north-central Sweden, suggests that: 1, there were repeated fires (four fire events detected) during the early Holocene; and 2, bioclimatic conditions when the ancient pines were growing resembled those of modern sub-alpine pine woods. The latter is indicated by their patterns of tree ring growth (growth rate and variation), which were statistically similar to those of pines growing in sub-alpine woods with an open canopy, but different from pines in protected and managed boreal forests. Lower δ<sup>13</sup>C for the ancient latewood in comparison to pine wood from trees growing near the Scandinavian mountains before the 1850s were probably caused both by stomata fractionation due to lower atmospheric CO<sub>2</sub> during the early Holocene and by the moist local environment created by the nearby ancient Ancylus lake, which preceded the Baltic Sea. Periods with cloudy and cold summers were also indicated by the occurrence of ‘false rings’. Finds of charred fragments of <em>Calluna vulgaris</em> (heather, ling), an understory shrub that can burn even with a relatively high moisture content, suggest that heath vegetation was crucial to make fire a reoccurring ecological factor in the area during the early Holocene.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"3ec288a0502356a3f92520df684f30eab45c14361e64504286e23a5e42e75492","category":"Environment"}