{"title":"Effects of leaf and stem maturation on nutritional value in Megathyrsus maximus","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13186?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p><i>Megathyrsus maximus</i> is a forage grass native to Africa but widely cultivated in tropical and subtropical regions of the world where it is part of the grazing food chain. This study aimed to evaluate five <i>M. maximus</i> genotypes for the effect of maturity on their morpho-agronomic traits, nutritional composition and digestibility, and to correlate their leaf blade and stem anatomy with their nutritional value.</p>\n<h2>Results</h2>\n<p>The proportion of sclerenchyma tissues increased as maturity was reached, while lignin accumulation was differentiated between genotypes. Gatton Panic, Green Panic and Mutale genotypes maintained their acid detergent lignin (ADL) values for leaf blades in the three cuts evaluated. <i>In sacco</i> ruminal dry matter disappearance was lower in Green Panic genotype at the vegetative stage for stems, but not for leaf blades. Significant positive correlations were found between dry matter disappearance and mesophyll tissues, and the latter were negatively correlated with neutral detergent fiber (NDF) and ADL.</p>\n<h2>Conclusion</h2>\n<p>Our results strongly indicate that cutting age and genotype affected the nutritional value of <i>M. maximus</i> leaf blades and stems, with a more pronounced loss of quality in stems than in leaf blades. We recommend increasing the frequency of grazing at early stage or anticipating the stage of stem elongation in Green Panic to produce forage with better nutritional value. © 2023 Society of Chemical Industry.</p>","author":"Urys M. Hernández Álvarez, \nEliana López Colomba, \nGraciela P. Bollati, \nEdgardo J. Carloni, \nAndrea G. Reutemann, \nKarina A. Grunberg","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"3ec36a2dc2b2e09f46f985c0d32dc69f6a94c1df11065a5245b364e39910b39e","category":"Environment"}