{"title":"Apple to Be Fined Over $500 Million in EU Music Streaming Probe","link":"https://www.macrumors.com/2024/02/19/apple-fined-500-million-eu-music-probe/","date":1708341454000,"content":"Apple is set to be hit with a €500 million ($538 million) fine for allegedly breaking EU law over access to music streaming services, according to a <em><a href=\"https://www.ft.com/content/1e677a7e-9494-4f5b-a724-9e58ef26b34f\">Financial Times</a></em> report.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/06/Apple-vs-Spotify-feature2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe focus of the European Commission's investigation has been Apple's policy of preventing streaming music apps from informing iPhone and iPad users within the app that lower subscription prices are available when signing up outside of the App Store. \r<br />\n\r<br />\nThe investigation began in 2019 after Spotify <a href=\"https://www.macrumors.com/2019/05/06/eu-to-investigate-apple-over-spotify-complaint/\">filed an antitrust complaint against Apple</a>. EU regulators formally charged Apple in the anti-competitive probe in 2021, before the commission last year <a href=\"https://www.macrumors.com/2023/02/28/apple-responds-to-eu-narrowing-antitrust-case/\">narrowed the scope of the investigation</a> and dropped a charge of pushing developers to use its own in-app payment system.\r<br />\n\r<br />\nAccording to the paywalled <em>FT</em> report, the Commission will say Apple's actions are illegal and go against the bloc's rules that enforce competition in the single market. Subsequently, it will ban Apple's practice of blocking music services from letting users outside its App Store switch to cheaper alternatives, which has historically given Apple Music an unfair advantage.\r<br />\n\r<br />\nThe investigation's conclusion will essentially rubber stamp the Commission's preliminary view that Apple's rules equate to \"anti-steering\" and \"unfair trading conditions,\" in breach of EU antitrust law. The Commission previously said that the rules are \"detrimental to users of music streaming services on Apple's mobile devices\" given they may end up paying more and \"negatively affect the interests of music streaming app developers by limiting effective consumer choice.\"\r<br />\n\r<br />\nDevelopers are permitted by Apple's <a href=\"https://developer.apple.com/app-store/review/guidelines/\">App Store Review Guidelines</a> to notify users of alternative buying options through external communications, like email. Apps categorized as \"reader\" apps, including Spotify, have the ability to <a href=\"https://www.macrumors.com/2022/03/30/reader-apps-account-signups-outside-app-store/\">incorporate a link in their app</a> directing users to their website for account management. However, Spotify is still not allowed to promote its reduced subscription rates offered on its website directly from within its iPhone app.\r<br />\n\r<br />\nApple has never previously been fined for antitrust infringements by the EU, but it was hit in 2020 with a <a href=\"https://www.macrumors.com/2020/03/16/france-fines-apple-1b-euros-anti-competitive/\">€1.1 billion ($1.19 billion) fine</a> in France for alleged anti-competitive behaviour. The penalty was revised down to €372 million after Apple appealed.<div>Tags: <a href=\"https://www.macrumors.com/guide/spotify/\">Spotify</a>, <a href=\"https://www.macrumors.com/guide/ft-com/\">Financial Times</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/european-commission/\">European Commission</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">Apple Antitrust</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/19/apple-fined-500-million-eu-music-probe/\">Apple to Be Fined Over $500 Million in EU Music Streaming Probe</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-to-be-fined-over-500-million-in-eu-music-streaming-probe.2419832/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3ec5a7daa45541b3082d0258930d81f6dc5935d96b57907138afab953e049231","category":"Apple"}