{"title":"Therapeutic potential of Rosa roxburghii folium extract in insomnia treatment: a comprehensive evaluation of behavioral and neurochemical effects in a PCPA‐induced mouse model","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13895?af=R","date":1726563079000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Insomnia, a prevalent sleep disorder, detrimentally affects quality of life and is often challenging to manage with conventional treatments. This study delved into identifying and quantifying the main compounds by employing ultra-performance liquid chromatography–Q-Exactive-Orbitrap mass spectrometry, and further to evaluate the therapeutic potential of <i>Rosa roxburghii</i> folium (RRF) extract, with multiple pharmacological activities. Previous research had hinted at the efficacy of glycosides in influencing the <i>γ</i>-aminobutyric acid (GABAergic) system, which plays a pivotal role in sleep regulation. Utilizing a <i>p</i>-chlorophenylalanine-induced insomnia model in BALB/C mice, this investigation aimed to unravel the effects of various dosages of RRF extract on sleep quality and elucidated its mechanism of action.</p>\n<h2>RESULTS</h2>\n<p>A total of 66 compounds in the RRF extract were analyzed. Behavioral assessments demonstrated notable enhancements in sleep duration and latency. Biochemical analyses further corroborated these findings, revealing modulation in neurotransmitter levels indicative of a potential mechanism through the GABAergic and serotoninergic pathways. Additionally, histological evaluations suggested anti-inflammatory and antioxidant effects of the RRF extract.</p>\n<h2>CONCLUSION</h2>\n<p>The findings from this study underscored the therapeutic efficacy of RRF extract in combating insomnia, particularly highlighting its glycoside components’ role. The extract's significant improvement in sleep duration and latency, alongside its modulation of neurotransmitter levels, showcases its potential as a natural remedy for insomnia. Through its action on the GABAergic and serotoninergic pathways, as well as its anti-inflammatory and antioxidant effects, RRF extract emerges as a promising candidate for insomnia treatment, offering a holistic approach to sleep disorder management. © 2024 Society of Chemical Industry.</p>","author":"Fengjin He, \nYanfang Yan, \nMei Peng, \nMing Gao, \nLang Zhou, \nFaju Chen, \nLishou Yang, \nLiangqun Li, \nXiaosheng Yang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"3ecdd3caecfb3bfe5e36aec9c1572ddd633bae0458ab2539e88f98271c6135e1","category":"Environment"}