{"title":"Rodents show darker and redder coloration in warm and rainy environments","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13802?af=R","date":1707816398000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Animal coloration varies in response to environmental conditions. One well-known principle, Gloger's rule, suggests that warmer and wetter environments lead to more pigmented animals. Yet, the original formulation lacks differentiation between the two primary melanin pigments: eumelanin and pheomelanin. We examined spatial eumelanin and pheomelanin variation to unravel the impact of various ecological factors on pigment deposition, and to assess support for the complex version of Gloger's rule.</p>\n<h2>Location</h2>\n<p>South America.</p>\n<h2>Time Period</h2>\n<p>Contemporary.</p>\n<h2>Major Taxa Studied</h2>\n<p>Sigmodontine rodents.</p>\n<h2>Methods</h2>\n<p>We extracted pelage color data from 231 species and quantified the geographic variation in eu- and pheomelanin deposition. We performed linear multiple regression to investigate the influence of temperature, precipitation, predator diversity, and UVA-B radiance in eumelanin (lightness) and pheomelanin (redness).</p>\n<h2>Results</h2>\n<p>Our findings support the original formulations of Gloger's rule. Rodents in warmer and rainier regions, which also entails greater exposure to UV radiation and a diverse range of predators, exhibit darker-colored pelage. In addition, redder rodents prevail in warmer environments. However, contrary to the rule predictions, we observe a reversal for reddish patterns in relation to precipitation, with rainier regions showcasing more intense red rodents.</p>\n<h2>Main Conclusions</h2>\n<p>Our study breaks new ground by investigating previously unexplored facets of Gloger's rule in a continental mammalian group. We discovered compelling evidence that darker and redder coloration aligns closely with temperature and rainfall gradients. Although we found support for eumelanin–pelage predictions, expectations for pheomelanin pigmentation were only partially met. Our results might suggest that selective pressures act differently on dark and reddish coloration, revealing that coloration patterns in response to climate are more intricate than previously formulated.</p>","author":"Felipe O. Cerezer, \nAmanda B. Campos, \nCristian S. Dambros, \nRenan Maestri, \nJamile M. Bubadué, \nNilton C. Cáceres","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"3ed4751757d83e902aca11c6cd8bc7bd18d8ae2be618eb163a484f3f77ac2b54","category":"Environment"}