{"title":"Effects of firebricks for industrial process heat on the cost of matching all-sector energy demand with 100% wind–water–solar supply in 149 countries","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae274/7710221?rss=1","date":1720569600000,"content":"<span><div>Abstract</div>Refractory bricks are bricks that can withstand high temperatures without damage to their structures. They have been used to insulate kilns, furnaces, and other hot enclosures for thousands of years. Firebricks are refractory bricks that can, with one composition, store heat, and with another, insulate the firebricks that store the heat. Because firebricks are made from common materials, the cost per kilowatt-hour-thermal of a firebrick storage system is less than one-tenth the cost per kilowatt-hour-electricity of a battery system. It has thus been hypothesized that using excess renewable electricity to produce and store industrial process heat in firebricks can provide a low-cost source of continuous heat for industry. Here, it is hypothesized further that, upon a transition to 100% clean, renewable energy worldwide, using firebricks to store industrial process heat can reduce electricity generator, electricity storage, and low-temperature heat storage needs, thereby reducing overall energy cost. Both hypotheses are tested across 149 countries combined into 29 world regions. Results suggest, relative to a base case with no firebricks, using firebricks may reduce, among all 149 countries, 2050 battery capacity by ∼14.5%, annual hydrogen production for grid electricity by ∼31%, underground low-temperature heat storage capacity by ∼27.3%; onshore wind nameplate capacity by ∼1.2%, land needs by ∼0.4%, and overall annual energy cost by ∼1.8%. In sum, the use of firebricks for storing industrial process heat appears to be a remarkable tool in reducing the cost of transitioning to clean, renewable energy across all energy sectors.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"3ed40ad0cddbc314a568b943479b0b0ef415d43fc15d7ee099dada828e443e5e","category":"Interdisciplinary"}