{"title":"Alterations of Glucagon Levels and the Glucagon-to-Insulin Ratio in Response to High Dietary Fat or Protein Intake in Healthy Lean Adult Twins: A Post-Hoc Analysis","link":"https://www.preprints.org/manuscript/202410.1711/v1","date":1729586614000,"content":"Background/Objectives: Emerging data support an essential role of glucagon for lipid metabolism. However, data on the role of dietary fat intake for glucagon secretion is limited. This analysis investigated whether altering nutritional fat intake affects glucagon levels in healthy subjects. Methods: 92 twins (age: 31±14 years, BMI: 23±3 kg/m2) consumed two 6-week diets: first a low fat, high carbohydrate diet (LFD) followed by an isocaloric high fat, low carbohydrate diet (HFD). 24 twins (age: 39±15 years, BMI: 24±2 kg/m2) continued with a high protein diet (HPD). Clinical investigation days were performed after 6 weeks of LFD, after 1 and 6 weeks of HFD and after 6 weeks of HPD. Results: The LFD caused a significant decrease of fasting glucagon (-27 %, p&amp;lt;0.001) compared to baseline. After 6 weeks of HFD glucagon increased (117 %, p&amp;lt;0.001 vs. LFD) while free fatty acids decreased. 6 weeks of HPD further increased glucagon levels (72 %, p=0.502 vs. HFD) although fasting amino acid levels remained constant. Fasting insulin and HOMA-IR moderately increased after one week of HFD, while 6 weeks of HPD significantly decreased both. The fasting glucagon-to-insulin ratio decreased through LFD (p&amp;lt;0.001) but increased after HFD (p&amp;lt;0.001) and even further after HPD (p=0.018). Liver fat, triglycerides and blood glucose did not increase during the HFD. The heritability of glucagon levels was 45% with the LFD. Conclusions: A HFD increases glucagon levels and the glucagon-to-insulin ratio under isocaloric conditions compared to a LFD in healthy lean subjects. This rise in glucagon may represent a favorable metabolic response as neither glucose levels nor insulin resistance or liver fat showed clinically relevant increases.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3ede64a8aea37f12c3876263b53a605e878ff99dafb0a54699a555232953dce9","category":"Interdisciplinary"}