{"title":"The Successful Management of a 9-Year-Old Golden Retriever Treated for a Nasal Carcinoma with a Prednisolone/Chlorambucil Metronomic Combination after Radiation Therapy","link":"https://www.preprints.org/manuscript/202408.2078/v1","date":1724904370000,"content":"Nasal tumors are some of the most common tumors in aged golden retrievers. Nasal tumors are mostly found to be adenocarcinomas or carcinomas. Radiation therapy is the first option to debulk the tumor, and oral or intravenous chemotherapy is administered depending on the prognosis. Therefore, it is important to select the most appropriate drug for chemotherapy considering the price and the presence of concurrent disease. Anticancer drugs include first-generation chemotherapies, second-generation targeted anticancer drugs, and third-generation immunotherapy drugs. Considering their price and effectiveness, first- or second-generation anticancer drugs are mainly used.\nWe report a case in which a retriever with a nasal tumor was successfully treated and managed using a combination of chlorambucil (4mg/day, SID) and prednisolone (10mg/day) orally for 9 months at a general practice. A 35 kg spayed female golden retriever aged 8 years and 8 months visited the Bundang New York Animal Hospital in July 2023. A protocol of 4 weeks of chemotherapy followed by 1 week of rest was repeated, and the nasal exudate persisted. The exudate was significantly reduced. The size of the nasal tumor was monitored using CT imaging at a referral hospital, and the images were taken in the following order: 1. before radiation therapy at the referral hospital and before chemotherapy; 2. after radiation therapy and before chemotherapy; and 3. after radiation therapy and after chemotherapy. Since the first instance of nasal bleeding, 12 months have passed (as of July 24). The nasal exudate is barely visible, and the retriever’s vital signs and weight remain stable. The size of the nasal tumor significantly decreased after 9 months of chemotherapy without moderate side effects. This study demonstrates that a prednisolone/chlorambucil metronomic combination can be an alternative to second-generation anticancer drugs as it is the cheapest and most effective way to manage tumors along with conventional radiation therapy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3ef0fbd37d4a674003488eb789e01f5262e6542209e7421dc20e444eeabf7d13","category":"Interdisciplinary"}