{"title":"Toyota is entering a hydrogen-powered Corolla in a 24-hour race","link":"https://arstechnica.com/?p=1760863","date":1619624533000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Super_Taikyu_Series_Race_20210422-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Super_Taikyu_Series_Race_20210422.jpg\">Enlarge</a> <span>/</span> From May 21 to 23, Toyota will enter the Super Taikyu Series with a hydrogen-powered Corolla race car. (credit: Toyota)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>For some, the allure of hydrogen-powered vehicles is hard to resist. Proponents point first to long recharging times for lithium-ion batteries and then to the speed with which pressurized hydrogen can be pumped into a car as reasons that battery-electric vehicles are doomed to failure among drivers conditioned by decades of fast refueling stops at gas stations. Mostly, those hydrogen-powered cars use fuel cells to generate electricity that powers an electric motor. But internal combustion engines can burn hydrogen, too, emitting just water as exhaust.</p>\n<p>In 2006, BMW experimented with the Hydrogen 7, a <a href=\"https://www.caranddriver.com/news/a15147892/2007-bmw-hydrogen-7-car-news/\">V12-powered 7 Series sedan that could run on either gasoline or hydrogen</a>. It wasn't a huge success; BMW made 100 Hydrogen 7s, and when tested by the US Department of Energy's Argonne National Laboratory, they proved to be <a href=\"https://www.anl.gov/article/argonne-tests-find-nearzero-emissions-for-bmw-hydrogen-7\">extremely clean in terms of tailpipe emissions</a>. But hydrogen has a much lower energy density than gasoline, so the hydrogen-powered 7s were extremely inefficient, <a href=\"https://www.bmwblog.com/2016/08/17/bmw-stop-making-hydrogen-7-model/\">averaging just 4.7 mpg (50 L/100 km)</a>.</p>\n<p>As a result, I thought the entire idea of hydrogen-powered internal combustion engines in cars was dead and buried—until this morning, when I spotted an announcement from Toyota. The Japanese automaker will enter the pro-am endurance racing Super Taikyu Series with a hydrogen-powered Corolla race car, starting with a 24-hour race at Fuji, May 21 to 23.</p></div><p><a href=\"https://arstechnica.com/?p=1760863#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1760863&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3efa169cab1c55b08257c55171cf79595134d77a282df330fa4d840ea1ceaf8e","category":"Tech"}