{"title":"Exploring Virulence Factors and Antifungal Susceptibility in Sporothrix Isolates: A Comparative Study between Feline and Human Hosts","link":"https://www.preprints.org/manuscript/202405.1151/v1","date":1715917412000,"content":"Sporotrichosis’ clinical manifestations, lesions in the cutaneous or subcutaneous tissues, it is caused by dimorphic fungi of the Sporothrix complex, is a cosmopolitan mycosis that affects humans and animals. This study aimed to identify prevalent species in Minas Gerais, Brazil, and characterize virulence profiles and antifungal susceptibility associated with Sporothrix isolates. Isolates were identified using macro and micro-morphological traits as well molecular biology techniques. Antifungal susceptibility was determined using the Minimal Inhibitory Concentration test, while, virulence factors such as growth at different temperatures, biofilm formation, melanin production, and urease activity were assessed. Our findings revealed S. brasiliensis as a predominant species isolated. Urease activity was a crucial factor associated with growth at 50°C in S. brasiliensis isolates, highlighting their high thermotolerance. Furthermore, strains isolated from humans produced a more robust biofilm compare to those from felines. Strains of S. brasiliensis isolated from Felis catus exhibited faster melanin production, decreased susceptible to antifungal agents tested, and superior growth capacity at 50°C to strains isolated from humans. Therefore, our study highlights the prevalence of S. brasiliensis causing sporotrichosis in both human and felines. However, it underscores the circulation of different strains, with varying levels of virulence and susceptibility to antifungal agents.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3efdc0e9aef3f6f909080321930a114ef946500c5b17775d0a0b3e5c7073420c","category":"Interdisciplinary"}