{"title":"What does ‘Allow More Data on 5G’ do an iPhone?","link":"https://www.macworld.com/article/2021171/iphone-allow-more-data-on-5g.html","date":1693558800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When Apple introduced the iPhone 12 series, the company added an option designed to improve your experience on your iPhone when you were on a Wi-Fi network, but your cellular plan gave you access to a higher-throughput 5G network. For instance, you can enable this option to have higher-quality FaceTime connections where using a Wi-Fi network would only provide lower-definition FaceTime.</p>\n\n\n\n<p>On an iPhone 12 model or later and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT212196&amp;xcust=1-1-2021171-1-0-0&amp;sref=https://www.macworld.com/feed\">iPads with cellular introduced after that</a>, enabling <em>Settings</em> &gt; <em>Cellular</em> &gt; <em>Cellular Data Options</em> &gt; <em>Data Mode</em> &gt; <em>Allow More Data on 5G</em> lets your device make different choices. Some carriers may enable this option by default if you have an unlimited-usage plan. (That option might be under <em>Settings</em> &gt; <em>Cellular Data </em>or <em>Settings</em> &gt; <em>Mobile Data</em>, and nested under a carrier’s settings if you have a SIM and eSIM or two eSIMs installed.)</p>\n\n\n\n<p>You may have been aware of this feature when it was introduced. However, I discovered recently that Apple quietly updated the feature without changing the explanation of how it works in Settings or introducing it as a new feature. As a result, many discussions of Allow More Data on 5G rely on Apple’s initial features.</p>\n\n\n\n<p>The newer details mix together data usage and quality into a single group of settings, particularly around video and downloads. With Allow More Data on 5G turned on, your device may switch to Wi-Fi for what Apple describes as “higher-quality FaceTime,” high-definition content for streaming video via the TV app, all music and videos played from the Music app, system updates, and automatic iCloud backups. Third-party apps can also tap 5G with the option on for higher-bandwidth purposes.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/08/mac911-5g-allow-over-cell-ios16-bordered.png?w=1146\" alt=\"iOS 16 %G Allow More Data\" width=\"400\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/08/mac911-5g-allow-over-cell-ios16-bordered.png?quality=50&amp;strip=all 1183w, https://b2c-contenthub.com/wp-content/uploads/2023/08/mac911-5g-allow-over-cell-ios16-bordered.png?resize=286%2C300&amp;quality=50&amp;strip=all 286w, https://b2c-contenthub.com/wp-content/uploads/2023/08/mac911-5g-allow-over-cell-ios16-bordered.png?resize=768%2C804&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/08/mac911-5g-allow-over-cell-ios16-bordered.png?resize=1146%2C1200&amp;quality=50&amp;strip=all 1146w\" height=\"1200\" /><figcaption><p>The Allow More Data on 5G option picks the for the highest quality given your carrier plan and Wi-Fi network connection.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>How does it choose when to do so? If you’re on either an insecure Wi-Fi network, one that requires no password to join, or one you use infrequently (as tracked silently by your iPhone or iPad), your device may switch to 5G.</p>\n\n\n\n<p>The other two choices don’t incorporate Wi-Fi usage at all: they’re really a binary choice—Standard and Low Data:</p>\n\n\n\n<ul>\n<li>Low Data reduces cellular data usage by pausing automatic downloads and many background tasks. (You can also set Low Data as an option on a Wi-Fi network.)</li>\n\n\n\n<li>Standard is a “normal” mode, essentially what we’ve seen for many years with an iPhone or iPad over cellular. Video streaming and FaceTime are throttled to “standard quality,” an ambiguous term only meaningful in contrast to what is ostensibly higher quality over 5G or high-performance Wi-Fi networks connected to high-speed Internet.</li>\n</ul>\n\n\n\n<p>On a network that iOS or iPadOS has decided to boost data over 5G, you can opt to override the operating system’s choice. </p>\n\n\n\n<p>You can override this choice for Wi-Fi networks for which your device has decided to override Wi-Fi. This option appears <em>only</em> if your iPhone or iPad has performed that override—otherwise, you won’t see it. Go to <em>Settings</em> &gt; <em>Wi-Fi</em> and tap the info i icon next to the connected network. If your device ever preferred 5G to Wi-Fi, you’ll see an option labeled <em>Use Wi-Fi for Internet</em>. Enable it to block the override for a current network or a future connection.</p>\n\n\n\n<p>All three options above are distinct from Wi-Fi Assist, found at the very bottom of Settings &gt; Cellular, which will use any generation of a cellular network to provide a data boost—but only when connected to a poorly performing Wi-Fi network.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\niOS, iPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3f01a9b787b4788c7e31546d45b66b3aef941efa1dc4c7b48b8bad979a67e77b","category":"Apple"}