{"title":"Evolution of fermented grain yeast communities in strong‐flavour baijiu and functional validation of yeasts that produce superior flavour substances","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13423?af=R","date":1709555316000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Baijiu is a well-known alcoholic beverage in China and the quality is determined by various microorganisms during the fermentation process. Yeast is one of the most important microorganisms in the fermentation of baijiu, it not only has a strong esterification capacity but also affects the aroma of baijiu.</p>\n<h2>Results</h2>\n<p>High-throughput sequencing results showed that the fermented grains (<i>jiupei</i>) during baijiu production were mainly composed of eight yeast species with high abundance, the species and abundance of yeasts changed significantly with the fermentation process. The flavour of 30 yeast strains in the <i>jiupei</i> were determined by sniffing test and GC–MS. Moreover, the strain with the highest flavour substance content (2.34 mg L<sup>−1</sup>) named YX3205 was obtained and identified as <i>Clavispora lusitaniae</i>. Tolerance results showed that <i>C. lusitaniae</i> YX3205 can tolerate up to 15% (v v<sup>−1</sup>) ethanol. In the solid-state simulated fermentation experiment, the content of 24 flavour substances was significantly increased in the fortified group, and the total ester content reached 4240.73 μg/kg, which was 2.8 times higher than that of the control group.</p>\n<h2>Conclusion</h2>\n<p>The present study demonstrated the potential of <i>C. lusitaniae</i> YX3205 to enhance the flavour of baijiu, thereby serving as a valuable strain for the improvement of flavour quality of baijiu.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Zhong‐Fu Duan, \nMei‐Yue Han, \nJia‐Liang Niu, \nJing‐Rong Zhao, \nWei‐Wei Li, \nLi‐Ning Zhu, \nHui‐Feng Ma, \nYan‐Fang Wu, \nXiu‐Ting Li, \nBao‐Guo Sun","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"3f06eee2cad11260a7ea9ab307c26f87374a06de5b66e0975d38686057513988","category":"Environment"}