{"title":"Relationships between functional traits and survival mediated by tree size in subtropical forests","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae036/7667547?rss=1","date":1715212800000,"content":"<span><div>Abstract</div>An important challenge in ecology is to link functional traits to plant survival for generalizable predictions of plant demographical dynamics. However, whether root and leaf traits are consistently associated with tree survival remains uncertain because of the limited representation of root traits. Moreover, the relationships between plant traits and survival are rarely linear and are likely to vary with tree size. We analyzed demographic data from 17 901 trees of 32 subtropical tree species under 3-year-old monocultures to test whether root and leaf traits have consistent relationships with tree survival and how the relationships between traits and tree survival vary with tree diameter. We discovered that leaf and root traits have inconsistent effects on tree survival. Specifically, while specific leaf area (SLA; an acquisition strategy) showed a marginally significant negative impact on survival, root diameter (RD; a conservative trait within the one-dimensional root economic spectrum) also demonstrated a significant negative effect on survival. Furthermore, we found size-dependent relationships between traits and tree survival. The effect of SLA, leaf phosphorus concentration and specific root length, on survival shifted from negative to positive with increasing tree size. However, species with high leaf thickness and RD were positively linked to survival only for small trees. The results highlight that to accurately predict the relationships between traits and tree survival, it is essential to consider both above- and belowground traits, as well as the size-dependent relationships between traits and tree survival.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"3f0fdcfe98752d46859059dd71b3b1c44c023ebfe48c118dd3e3f462e1643a79","category":"Environment"}