{"title":"Wet and windy weather seem to be in store for Paris-Roubaix","link":"https://cyclingtips.com/2021/09/wet-and-windy-weather-seem-to-be-in-store-for-paris-roubaix/","date":1633029309000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/wetcobbles_upload-650x433.jpg\" /></div><h2>Wet and windy weather seem to be in store for Paris-Roubaix</h2><p>\n</p><p>It can be tricky putting too much stock into a weather forecast more than a few days out, but with less than two days to go until the inaugural Paris-Roubaix Femmes and the men’s race taking place the following day, it may be time to acknowledge what appears to be in store this weekend.</p>\n\n\n\n<p>As of Thursday afternoon, the weather forecast suggests a high likelihood of rainfall and heavy winds on Saturday and Sunday.</p>\n\n\n\n<p>Barring a surprise change in the forecast, the first women’s Paris-Roubaix will take place on muddy pavé, while the men’s peloton could be set for the first especially wet edition of the race in nearly two decades. Both races also appear likely to be buffeted by heavy winds with the potential for powerful gusts, with forecasted daytime high temperatures of around 15° C (the high 50s in Fahrenheit).</p>\n\n\n\n<p>The cobbled sectors of the iconic French one-day, as if they already weren’t challenging enough, become ever more technical when wet, with mud increasing the potential for crashes and drama. The last edition of Paris-Roubaix held in particularly rainy conditions was all the way back in 2002, when Johan Museeuw stormed to his third career win in the race. In the many years since, the cobbles have stayed mostly dry, despite a handful of editions in which the midweek forecast seemed to call for rain only for things to change in the days before the race.</p>\n\n\n\n<p>This close to the weekend, that seems unlikely now, with a wet Paris-Roubaix starting to seem more and more probable.</p>\n\n\n\n<p>Mathieu van der Poel (Alpecin-Fenix), who will start the race as one of the top favorites alongside his longtime rival and fellow three-time cyclocross world champion Wout van Aert (Jumbo-Visma), is among those who would not seem to mind pushing through the mud.</p>\n\n\n\n<p>“It would be cool if it rains,” he said ahead of the race, according to Wielerflits. “Okay, it will indeed be a bit more dangerous. More technical too. And you don’t always have everything under control yourself. Then it becomes a matter of avoiding falls, which is already the case in this classic. But if you can stay out of trouble, you can go a long way.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/wet-and-windy-weather-seem-to-be-in-store-for-paris-roubaix/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3f11dc22c10da7c730ab3a2ad171ff645f2fe59958e1303b571080384d55f6f1","category":"Cycling"}