{"title":"Apple Facing $1 Billion UK Antitrust Lawsuit Over App Store Fees","link":"https://www.macrumors.com/2023/07/25/apple-uk-antitrust-lawsuit-app-store-fees/","date":1690275134000,"content":"Apple has become the target of a £785 million ($1 billion) class action lawsuit on behalf of over 1,500 developers in the UK over its <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> fees, reports <em><a href=\"https://techcrunch.com/2023/07/24/apple-targeted-in-app-store-antitrust-damages-suit-thats-seeking-1bn-for-uk-developers/\">TechCrunch</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/06/app-store-blue-banner-uk-fixed.jpg\" alt width=\"1794\" height=\"1009\" />\r<br />\nThe suit accuses Apple of abusing a dominant position by charging a 15% to 30% fee on in-app sales in the ‌App Store‌, a policy that has been criticized by antitrust regulators in other countries. \r<br />\n\r<br />\nIt also argues UK consumers are missing out because developers are being deprived of money that could be spent on research and development to help drive app innovation.\r<br />\n\r<br />\nThe lawsuit is being brought by Sean Ennis, a professor at the Centre for Competition Policy at the University of East Anglia, on behalf of app developers.\r<br />\n<blockquote>\"Apple's charges to app developers are excessive, and only possible due to its monopoly on the distribution of apps onto iPhones and iPads,\" said Ennis in a statement. \"The charges are unfair in their own right, and constitute abusive pricing. They harm app developers and also app buyers.\"</blockquote>The lawsuit is an opt-out class action. In other words, UK-based developers don't have to register to be included in any potential winnings, which would be calculated based on their app business.\r<br />\n\r<br />\nApple has been accused of or investigated for anticompetitive practices in several other countries over the past few years, including France, Germany, the Netherlands, South Korea, Japan, the United States, and more, with many of the complaints related to the ‌App Store‌. As a result, Apple has been forced to make changes to the ‌App Store‌ in some countries, such as allowing developers to offer alternative payment systems in <a href=\"https://www.macrumors.com/2022/06/30/app-store-alternative-payments-south-korea/\">South Korea</a>.\r<br />\n\r<br />\nApple's ‌App Store‌ terms and conditions are also being probed by the UK's Competition and Markets Authority (CMA), which opened its investigation in <a href=\"https://www.macrumors.com/2021/03/04/uk-watchdog-apple-investigation/\">March 2021</a>.\r<br />\n\r<br />\nIn the European Union, Apple is gearing up to accommodate the <a href=\"https://www.macrumors.com/2022/12/13/apple-europe-alternate-app-store-support/\">Digital Markets Act</a>, which will require it to allow apps to be downloaded on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> using <a href=\"https://www.macrumors.com/2023/04/17/app-sideloading-support-coming-ios-17/\">sideloading or alternate app stores</a> in <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>.\r<br />\n\r<br />\nFor Apple's part, it says the ‌App Store‌ is not the only way for developers to reach users, since they can also do so over Safari and other web browsers, where Apple rules do not apply. The company also says the majority of developers don't even pay any commission, while of those who do, many benefit from the ‌App Store‌ Small Business Program which requires them to pay only 15% fees.\r<br />\n\r<br />\nApple has also been keen to point out that over the past 15 years it has not raised commission rates or added fees, while twice in the last two years, federal courts have said Apple is entitled to charge a commission for access to its platform and rejected the assertion that the ‌App Store‌ gives the company monopoly power. Apple often also highlights the success of third-party apps on the ‌App Store‌ and their investments in developers' success, as well as the quality and security of the ‌App Store‌ itself.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">Apple Antitrust</a>, <a href=\"https://www.macrumors.com/guide/united-kingdom/\">United Kingdom</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/25/apple-uk-antitrust-lawsuit-app-store-fees/\">Apple Facing $1 Billion UK Antitrust Lawsuit Over App Store Fees</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-facing-1-billion-uk-antitrust-lawsuit-over-app-store-fees.2396819/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3f11ae6967ce49765b3851e52ecf5918e02e3845dab658302abca012cda8a6ac","category":"Apple"}