{"title":"Protective effect of tretinoin on cervical cancer growth and proliferation through downregulation of pFAK2 expression","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24144?af=R","date":1713272355000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Cervical cancer, a life-threatening disease, is the seventh most commonly detected cancer among women throughout the world. The present study investigated the effect of tretinoin on cervical cancer growth and metastasis in vitro and <i>in</i> vivo in the mice model.</p>\n<h2>Materials and Methods</h2>\n<p>Cell Counting Kit-8, clonogenic survival, and transwell chamber assays were used for determination cells proliferation, colony formation, and invasiveness. Western blotting assay was used for assessment of protein expression whereas AutoDock Vina and Discovery studio software for in silico studies.</p>\n<h2>Results</h2>\n<p>Tretinoin treatment significantly (<i>p</i> &lt; .05) reduced the proliferation of HT-3 and Caski cells in concentration-based manner. Incubation with tretinoin caused a significant decrease in clonogenic survival of HT-3 and Caski cells compared with the control cultures. The invasive potential of HT-3 cells was decreased to 18%, whereas that of Caski cells to 21% on treatment with 8 μM concentration of tretinoin. In HT-3 cells, tretinoin treatment led to a prominent reduction in p-focal adhesion kinase (FAK), matrix metalloproteinases (MMP)-2, and MMP-9 expression in HT-3 cells. Treatment of the cervical cancer mice model with tretinoin led to a prominent decrease in tumor growth. The metastasis of tumor in model cervical cancer mice group was effectively inhibited in spleen, intestines, and peritoneal cavity. In silico studies showed that tretinoin interacts with alanine, proline, isoleucine, and glycine amino acid residues of FAK protein to block its activation. The 2-dimensional diagram of interaction of tretinoin with FAK protein revealed that tretinoin binds to alanine and glycine amino acids through conventional hydrogen bonding.</p>\n<h2>Conclusion</h2>\n<p>In summary, tretinoin suppressed the proliferation, colony formation, and invasiveness of cervical cancer cells in vitro. It decreased the expression of activated focal adhesion kinase, MMP-2, and MMP-9 in HT-3 cells in dose-dependent manner. In silico studies showed that tretinoin interacts with alanine and glycine amino acids through conventional hydrogen bonding. In vivo data demonstrated that treatment of the cervical cancer mice model with tretinoin led to a prominent decrease in tumor growth. Therefore, tretinoin can be developed as an effective therapeutic agent for cervical cancer treatment.</p>","author":"Hui Gong, \nLina Zhao, \nJuntao Liu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"3f11178c4363850dcab525299c92077705b41cc9e9906d583a6826ea2ac00ef3","category":"Environment"}