{"title":"The fish–mangrove link is context dependent: Tidal regime and reef proximity determine the ecological role of tropical mangroves","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12822?af=R","date":1710354816000,"content":"<h2>Abstract</h2>\n<p>Tropical mangroves are known to support fish production, but natural variability in the link between mangrove habitats and fish populations undermines our ability to manage, conserve and restore this ecological relationship. This is largely due to undefined context-dependence in the use of mangroves by fish. We collected a spatially extensive dataset of 494 mangrove fish assemblages using standardised Remote Underwater Video surveys of mangrove edge habitats from five environmentally heterogenous regions in the Indo-Pacific. We used machine learning methods to define contextual limits of the use of mangroves by reportedly mangrove-affiliated fish. We found that tidal range and proximity to coral reefs were the most important contextual predictors of the use of mangroves by most taxa. We established data-driven threshold values for important contextual predictors of the use of mangroves by fish, offering new insights into the variable role played by tropical mangroves in supporting fish life histories. Where mangroves occur as part of reef seascapes in regions with limited tidal range (&lt;1.5 m), they appear to serve an important juvenile habitat function for a wide spectrum of reef fish. In regions with substantially larger tidal ranges, mangroves appear to only support certain reef species with coastal life histories. Coastal and estuary fish were able to use mangroves in a wide variety of non-reef contexts. We demonstrate that key thresholds in environmental context can govern the functional role of mangroves, with strong implications for the role of other habitats in coastal seascapes.</p>","author":"Michael Bradley, \nAlexia Dubuc, \nCamilla V. H. Piggott, \nKatie Sambrook, \nAndrew S. Hoey, \nMartial Depczynski, \nTim J. Langlois, \nMonica Gagliano, \nShaun K. Wilson, \nKatherine Cure, \nThomas H. Holmes, \nGlenn I. Moore, \nMichael Travers, \nRonald Baker, \nIvan Nagelkerken, \nMarcus Sheaves","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"3f13705ca190534fda450d0f41a6769054bcb5d18ae3d1cfa2f8eed8fd01886c","category":"Environment"}