{"title":"402 The effect of supplemental protein degradability and frequency of supplementation on nitrogen metabolism of beef cattle consuming low-quality forage","link":"https://academic.oup.com/jas/article/102/Supplement_3/379/7757477?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Rumen degradable protein (RDP) is required for cattle consuming low-quality forage to ensure adequate fiber digestion. However, in situations where cattle are not supplemented daily, supplementing RDP could overwhelm the nitrogen recycling mechanisms, leading to increased nitrogen excretion. The objective of this experiment was to determine the effect of rumen degradability and frequency of supplemental protein in beef cattle consuming low-quality forage. Treatments were arranged in a 2 × 2 factorial with protein degradability (68.5% or 32.8% RDP) and supplementation frequency (daily or biweekly) as the two factors. Ruminally cannulated Angus steers [n = 8; body weight (BW) = 328 ± 12.2 kg] were used in a Latin rectangle. The low RDP treatment was composed of 50% soybean hulls and 50% corn gluten meal (40.3% CP; 32.8% RDP), and the high RDP treatment consisted of 45.4% soybean hulls, 41.4% soybean meal, 4.1% urea, and 9.1% molasses (40% CP; 68.5% RDP). The biweekly steers were supplemented on d 0, 4, 7, 11, 14, 18, and 21 of each period. Steers were given ad libitum access to low-quality (7.4% CP) native grass hay. Daily blood samples were collected from d 14 to 17 at 0630 h and d 21 at -2, 3, and 7 h relative to supplementation. Rumen fluid samples were collected every 4 h on d 18 to 21. Daily NEFA concentrations decreased (<span>P</span> &lt; 0.001) post-supplementation in the biweekly supplemented steers and then returned to baseline values, while the daily supplemented steers had no change. Hourly NEFA concentrations in steers supplemented with high RDP biweekly increased from 2 h pre-supplementation to 3 h post-supplementation (<span>P</span> &lt; 0.001), then decreased at 7 h post-supplementation back to pre-supplementation concentrations. Plasma urea nitrogen (PUN) increased in biweekly high RDP supplemented steers 1 d after supplementation (<span>P</span> &lt; 0.001) and decreased from d 15 to d 17. PUN concentrations increased from 2 h pre-supplementation through 7 h post-supplementation in both high RDP treatments, while low RDP treatments did not change (<span>P</span> &lt; 0.001). Rumen fluid lactate and ammonia concentrations rapidly increased in the biweekly high RDP-supplemented steers in response to each supplementation (<span>P</span> &lt; 0.001). There were spikes in ammonia concentrations for the daily high RDP treatment post-supplementation; however, they were smaller in magnitude compared with the biweekly high RDP. The low RDP treatments remained steady across all hours of ammonia sampling, where daily and biweekly supplemented steers decreased slightly in the time points following supplementation and then gradually increased. Rumen pH displayed drastic changes in the biweekly high RDP-supplemented group with values ranging from 6.99 to 5.97 (<span>P</span> &lt; 0.001), but the low RDP treatments remained consistent. Supplementing biweekly with high RDP resulted in fluctuations in metabolites not observed in the other treatments, which could reduce forage utilization and increase nitrogen excretion.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3f171e075774e2278f97ca862e2bac6bfe936981fe06dc828b9d06455dd7c390","category":"Environment"}