{"title":"271 The effects of supplementing diets with 25-OH-D3, with or without increased vitamin E, on the performance of nursery pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/162/7664873?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>A total of 1,440 pigs (Camborough × line 800, PIC Canada) were weaned [(20 d of age, 5.5 kg body weight (BW)] and used to compare the effects of 3 dietary fortification strategies for vitamin D and vitamin E, specifically, on growth performance from d 0 to 42 post-weaning. The 3 vitamin fortification strategies were fed over 3 dietary phases; d 0 to 7 (P1), d 7 to 21 (P2), and d 21 to 42 (P3); and consisted of 1) Control (C), “industry-type” diet that met or exceeded NRC (2012) requirement estimates for each diet phase with 1,500 IU vitamin D3 and 70 IU vitamin E/kg diet; 2) HyD, C with 50 μg 25-OH-D3 added per kg diet; and 3) HyD+E, HyD with 140 IU vitamin E/kg diet. There were 16 pens of 28 to 32 pigs allotted to each fortification strategy in a RCBD based on initial BW. Pens were weighed and feed consumption for each was recorded weekly, and average daily gain (ADG), average daily feed intake (ADFI), and feed to gain (F/G) were calculated for each week, diet phase, and the overall period. During P1, ADFI was greatest (<span>P</span> &lt; 0.05, 137 g/d) for pigs fed HyD, and pigs fed HyD or HyD+E had greater (<span>P</span> &lt; 0.05) ADG compared with C (117, 110, and 103 g/d, respectively). Pigs fed HyD were heavier (<span>P</span> &lt; 0.05, 6.37 kg) on d 7 compared with pigs fed C (6.27 kg), with pigs fed HyD+E intermediate (6.31 kg), but there were no differences in F/G during P1. During P2, ADFI was greatest (<span>P</span> &lt; 0.05, 502 g/d) for pigs fed HyD, and pigs fed HyD or HyD+E had greater (<span>P</span> &lt; 0.05) ADG compared with C (419, 412, and 401 g/d, respectively). Pigs fed HyD or HyD+E were heavier (<span>P</span> &lt; 0.05) on d 21 compared with pigs fed C (12.22, 12.13, and 11.91 kg, respectively), but there were no differences in F/G during P2. There were no differences in growth performance during P3 or overall (d 0 to 42). Nevertheless, in conclusion, performance differences during P1 and P2 resulted in pigs fed HyD or HyD+E having numerically greater BW (+0.34 kg) and Income-Over-Feed-Cost (+CA $0.31/pig) on d 42 when compared with pigs fed C.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3f2e6b5584ef8a6f02a0f7b5ddb07d4e5aa168205857f6802ee8ef3ca9e36d6d","category":"Environment"}