{"title":"Preferences of Adults for Synanthropic Flora in the Sustainable Development of Polish Cities&rsquo; Green Areas","link":"https://www.preprints.org/manuscript/202403.0769/v1","date":1710310658000,"content":"Synanthropic flora (weeds, spontaneously developed plants) are plants that accompany humans, appearing as a result of anthropopressure as well as after its cessation. The potential of synanthropic flora in shaping green areas usually brings many measurable benefits that depend on land management in cities. The study aimed to determine the preferences and attitudes of adults towards synanthropic flora in settlement units. The article presents survey results from 447 city residents. The obtained results were statistically analyzed using the k-means clustering method to identify segments of respondents with similar attitudes and preferences toward synanthropic flora. Mann-Whitney U tests were employed to determine statistical differences in the demographic variables among the analyzed clusters of respondents. Additionally, multiple regression analysis was performed to identify the opinions and attitudes towards synanthropic flora, that may influence their greater acceptance in the vicinity of residential areas. The results obtained in multiple regression allow for the statement that the respondent’s evaluation of the level of support for the introduction of more synanthropic vegetation into urban greenery (Yw) grows with the increase of acceptance of synanthropic plants occurrence in surroundings. Respondents’ opinions on the subject of the presence of synanthropic plants were studied using such variables concerning: synanthropic vegetation found in turfgrasses has a positive impact on the visual attractiveness of a site (X1), synanthropic plant communities present themselves better than others (X2), presence of synanthropic vegetation in an estate improves the quality of life in that location (X3), introduction of synanthropic flora into estate arrangements is a positive (X4), support for the use of synanthropic flora for educational purposes - as elements of playgrounds or in the form of environmental workshops (X5). Residents’ acceptance of synanthropic flora in green areas is at a relatively high level.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3f2f6219b38163402261004b60b3496aea24c19bd88d168c4dd32dac7de5581e","category":"Interdisciplinary"}