{"title":"Neutrophil-percentage-to-albumin ratio is associated with chronic kidney disease: Evidence from NHANES 2009–2018","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307466","date":1722866400000,"content":"<p>by Jinxi Li, Ting Xiang, Xinyun Chen, Ping Fu</p>\r\nIntroduction <p>The neutrophil-percentage-to-albumin ratio (NPAR), a novel inflammatory biomarker, has been used to predict the prognosis of patients with cancer and cardiovascular disease. However, the relationship between NPAR and chronic kidney disease (CKD) remains unknown. The purpose of this study was to investigate the possible association between NPAR and CKD.</p> Methods <p>The cross-sectional study included participants with complete information on NPAR, serum creatinine (Scr), or urinary albumin-to-creatinine ratio (UACR) from the 2009–2018 National Health and Nutrition Examination Survey (NHANES). CKD was defined as the presence of either low estimated glomerular filtration rate (eGFR) or albuminuria. Univariate and multivariate logistic regression and restricted cubic spline regression were used to assess the linear and nonlinear associations between NPAR and renal function. Subgroup and interactive analyses were performed to explore potential interactive effects of covariates. Missing values were imputed using random forest.</p> Results <p>A total of 25,236 participants were enrolled in the study, of whom 4518 (17.9%) were diagnosed with CKD. After adjustment for covariates, the odds ratios (ORs) for prevalent CKD were 1.19 (95% CI = 1.07–1.31, <i>p</i> &lt;0.05) for the Q2 group, 1.53 (95% CI = 1.39–1.69, <i>p</i> &lt; 0.001) for the Q3 group, and 2.78 (95% CI = 2.53–3.05, <i>p</i> &lt; 0.001) for the Q4 group. There was a significant interaction between age and diabetes mellitus on the association between NPAR and CKD (both <i>p</i> for interaction &lt; 0.05). And there was a non-linear association between NPAR levels and CKD in the whole population (<i>p</i> for non-linear &lt; 0.001). All sensitivity analyses supported the positive association between NPAR and CKD.</p> Conclusions <p>NPAR was positively correlated with increased risk of CKD. The NPAR may serve as an available and cost-effective tool for identifying and intervening the individuals at risk of CKD.</p>","author":"Jinxi Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3f33607d1de194aaaa761e98dbf95f4f3129061946b1ec92557c28be4c28a21a","category":"Interdisciplinary"}