{"title":"Apple Wants to Partner With Major Publishers to Train AI","link":"https://www.macrumors.com/2023/12/22/apple-ai-major-publisher-deals/","date":1703279264000,"content":"Apple has approached several major publishers to establish deals that would allow the Cupertino company to train generative artificial intelligence systems on news content, reports <em><a href=\"https://www.nytimes.com/2023/12/22/technology/apple-ai-news-publishers.html\">The New York Times</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/03/hey-siri-banner-apple.jpg\" width=\"1200\" height=\"630\" />\r<br />\nApple is aiming for multiyear deals and has approached Condé Nast, NBC News, and IAC. <a href=\"https://www.condenast.com\">Condé Nast publications</a> include Vogue, Wired, Vanity Fair, Ars Technica, Glamour, The New Yorker, GQ, and more, while IAC owns publications like People, The Spruce, Serious Eats, Martha Stewart Living, Real Simple, Entertainment Weekly, and Better Homes &amp; Gardens.\r<br />\n\r<br />\nProposed deals have been worth at least $50 million, and would allow Apple to license archives of news articles. According to <em>The New York Times</em>, some of the publishers were \"lukewarm\" on Apple's offer. Apple's terms are said to be \"too expansive,\" and Apple has been vague about how it will apply generative AI to news.\r<br />\n\r<br />\nOther publishers were \"optimistic\" about a potential partnership, and were pleased that Apple asked to use their content rather than just training generative models on published news without permission as other AI companies have done.\r<br />\n\r<br />\nMultiple rumors have suggested that Apple is working overtime to catch up to its rivals on <a href=\"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/\">generative AI offerings</a>, with Apple testing an \"AppleGPT\" chatbot internally and planning for new AI features in <a href=\"https://www.macrumors.com/roundup/ios-18/\">iOS 18</a>.\r<br />\n\r<br />\nMicrosoft, Google, and Meta have all incorporated generative AI into their products over the course of the last year, which means Apple is lagging behind when it comes to AI technology. ChatGPT, the most popular chatbot from OpenAI, was trained on a huge amount of data that includes books, articles, and web pages.\r<br />\n\r<br />\nIn addition to the copyright issues that come with the broad scraping of internet content, ChatGPT has sometimes been criticized for the accuracy of the information that it sometimes surfaces. By training an AI model on a more tailored set of information, Apple could end up with a more reliable product. Apple is also said to be planning to incorporate generative AI features across its app offerings, so a model that has been fed content from news sources could perhaps be added into <a href=\"https://www.macrumors.com/guide/apple-news-plus/\">Apple News</a>.\r<br />\n\r<br />\n<em>The New York Times</em> says that Apple executives have been \"debating\" how to get the data needed for generative AI products. Apple has not wanted to source information from the internet because of its focus on privacy, so deals with news publishers provide an alternative.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-gpt/\">Apple GPT</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/22/apple-ai-major-publisher-deals/\">Apple Wants to Partner With Major Publishers to Train AI</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-wants-to-partner-with-major-publishers-to-train-ai.2414433/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3f34d3dd241ac1cfae1df85c8d8e92a116f688f53298c109613952d4f891ecbb","category":"Apple"}