{"title":"The Polka-Dot Jersey at the Tour de France - A Brief History","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-polka-dot-jersey-at-the-tour-de-france-a-brief-history","date":1625048739000,"content":"\n      <p>The polka-dot jersey, or <em>maillot à pois rouges</em>, is a white jersey with red spots that signifies the rider leading the king of the mountain's classification at the Tour de France – the best climber in the Tour, in theory, but typically overshadowed by the yellow jersey's climbing prowess.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b>Tour de France 2021 Guide</b></a></p>\n<div></div>\n<p><span>Points are accumulated in the competition by riders individually and are awarded at the top of each categorised climb throughout the Tour. Climbs are ranked from .HC (</span><i><span>Hors catégorie,</span></i><span> a French term which is translated as exceptional category</span><span>) to fourth category climbs. The categorisation of each climb is decided by race organisers prior to the race, and in general is based on the length and steepness of each ascent. </span></p>\n<p><span>The king of the mountain's classification was first introduced at the 1933 Tour de France. This was 30 years after the first edition of the Tour and the 27th edition of the Tour de France. However, the polka-dot jersey wasn’t introduced as a signifier of the competition until 1975. The first rider to wear it was Joop Zoetemelk, though the winner of the classification that year was Lucien Van Impe. T</span><span>he overall winner of the Tour de France that year was Eddy Merckx, who came in second in the elusive polka dot points competition.</span></p>\n<p><span>Prior to 1933, the ‘</span><i><span>Meilleurs Grimpeurs’ </span></i><span>(Best Climber) was awarded by L’Auto. An individual rider was selected by the newspaper which organised the Tour de France at the time. However, the winners of this competition are not official Tour de France classification winners as the award was not handed out by the Tour organisation, but it is the precursor of the modern-day king of the mountain's classification.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-polka-dot-jersey-at-the-tour-de-france-a-brief-history\"><em><strong>Related – Polka Dot Duel: Ide Schelling’s sublime Tour debut</strong></em></a></p>\n<h4><b>Most Successful Riders in the King of the Mountain's Classification</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-51072065-min_1024x1024.jpg?v=1624976973\" />Richard Virenque (centre) in the polka-dot jersey at the 2004 Tour de France (Image credit: JOEL SAGET/AFP via Getty Images)</span></i></p>\n<p><span>Richard Virenque has won the most king of the mountain's classifications in Tour de France history. The Frenchman won the competition seven times between 1994 and 2004, perhaps overshadowed by the subsequently erased achievements of a certain Texan... </span></p>\n<p><span>Lucian Van Impe and the ‘Eagle of Toledo’, Federico Bahamontes, held the record before Virenque with six wins apiece.</span></p>\n<p><span>1. Richard Virenque - 7 <br />2. Lucien Van Impe - 6<br />2. Federico Bahamontes - 6<br />4. Julio Jiménez - 3</span></p>\n<p><span>Eleven riders have won the king of the mountain's classification twice, including Eddy Merckx, Fausto Coppi, Charly Gaul and Rafal Majka. Majka is the most recent rider to claim a second polka-dot jersey — he won the jersey at the 2014 and 2016 Tour de France.</span></p>\n<h4><b>Recent King of the Mountain's Classification Winners</b></h4>\n<p><span>Tadej <span>Pogačar </span>is the most recent winner of the king of the mountain's classification. He won the polka-dot jersey in addition to the yellow and white jersey at the 2020 Tour de France, which was also his Tour debut.</span></p>\n<p><span>2020 - Tadej Pogacar</span><span><br /></span><span>2019 - Romain Bardet</span><span><br /></span><span>2018 - Julian Alaphilippe</span><span><br /></span><span>2017 - Warren Barguil</span><span><br /></span><span>2016 - Rafal Majka</span><span><br /></span><span>2015 - Chris Froome</span><span><br /></span><span>2014 - Rafal Majka</span><span><br /></span><span>2013 - Nairo Quintana</span><span><br /></span><span>2012 - Thomas Voeckler</span><span><br /></span><span>2011 - Samuel Sanchez</span></p>\n<p><span>He’s not the only rider to have won both the king of the mountain's and the general classification recently, Chris Froome achieved the feat for Team Sky in 2015. Nairo Quintana came also close in 2013 when he won the polka-dot jersey and was second in the GC.</span></p>\n<p><span>The GC and KOM jersey have been won by the same rider eleven times by eight different riders. Fausto Coppi, Eddy Merckx and Gino Bartali are the three riders that have achieved this feat.</span></p>\n<p><i><span>Cover image: Chris Graythen/Getty Images</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3f34199cd0ef4196430af0cb493cbbc9c7dc1e605439a76d03e39047fe3ab4e0","category":"Cycling"}