{"title":"MicroRNA Profiling as a Predictive Indicator for Time to First Treatment in Chronic Lymphocytic Leukemia: Insights from the O-CLL1 Prospective Study.","link":"https://www.preprints.org/manuscript/202407.2194/v1","date":1721996196000,"content":"A “watch and wait” strategy, delaying treatment until active disease manifests, is adopted for most CLL cases; however prognostic models incorporating biomarkers have shown to be useful to predict treatment requirement. In our prospective O-CLL1 study including 224 patients, we investigated the predictive role of 513 microRNAs (miRNAs) on time to first treatment (TTFT). In the context of this study six well-established variables (i.e., Rai stage, beta-2-microglobulin levels, IGVH mutational status, del11q, del17p, and NOTCH1 mutations) maintained significant associations with TTFT in a basic multivariable model, collectively yielding a Harrell's C-index of 75% and explaining 45.4% of the variance in the prediction of TTFT. Concerning miRNAs, 73 out of 513 were significantly associated with TTFT in a univariable model; of these, 16 retained an in-dependent relationship with the outcome in a multivariable analysis. For 8 of these (i.e., miR-582-3p, miR-33a-3p, miR-516a-5p, miR-99a-5p, and miR-296-3p, miR-502-5p, miR-625-5p, and miR-29c-3p) a lower expression correlated with a shorter TTFT, whereas in the remaining eight (i.e., miR-150-5p, miR-148a-3p, miR-28-5p, miR-144-5p, miR-671-5p, miR-1-3p, miR-193a-3p, and miR-124-3p) the higher expression was associated with shorter TTFT. Integrating these miRNAs into the basic model significantly enhanced predictive accuracy, raising the Harrell’C index to 81.1% and the explained variation in TTFT to 63.3%. Moreover, the inclusion of the miRNA scores enhanced the Integrated Discrimination Improvement (IDI) and the Net Reclassification Index (NRI), underscoring the potential of miRNAs to refine CLL prognostic models and providing insights for clinical decision-making.\nIn silico analyses on the differently expressed miRNAs revealed their potential regulatory functions of several pathways, including those involved in the therapeutic responses. To add a bio-logical context to the clinical evidence, a miRNA-mRNA correlation analysis revealed at least one significant negative correlation between 15 of the identified miRNAs and a set of 50 Artificial Intelligence (AI) selected genes, previously identified by us as relevant for TTFT prediction in the same cohort of CLL patients.\nIn conclusion, the identification of specific miRNAs as predictors of TTFT holds promise for enhancing risk stratification in CLL to predict therapeutic needs. However, further validation studies and in-depth functional analyses are required to confirm the robustness of these observations and to facilitate their translation into meaningful clinical utility.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3f39e5bc98c4f71c27e8f0cb5c7979e65c6f3af48195ea18cffd670ac0bd9826","category":"Interdisciplinary"}