{"title":"Markov Modulated Poisson Processes Modelling for M2M Heterogeneous Traffic","link":"https://www.preprints.org/manuscript/202408.1508/v1","date":1724232895000,"content":"Theoretical mathematics is a key evolution factor of Artificial Intelligence (AI). Nowadays, representing a Smart system as a mathematical model helps to analyze any system with under development and support different case studies found in the real life. Additionally, the Markov chain has shown itself to be an invaluable tool for decision-making systems, natural language processing, and predictive modelling. In an Internet of Things (IoT), Machine-to-Machine (M2M) traffic necessitates new traffic models due to its unique pattern and different goals. In this context, we have two types of modeling: 1) Source Traffic modeling used to design stochastic processes such that they match the behavior of physical quantities of measured data traffic (e.g., video, data, voice). 2) Aggregated Traffic modeling which refers to the process of combining multiple small packets into a single packet in order to reduce the header overhead in the network. In real world, the heavy challenge is striking a balance between the model accuracy and dealing with a massive number of M2M devices. On the one hand, due to their reliability, Source traffic models have a competitive advantage over Aggregated traffic models. On the other hand, their complexity is expected to make managing the exponential growth of M2M devices difficult. In this paper, we propose a Markov Modulated Poisson Processes (MMPP) framework to study M2M heterogeneous traffic effects as well as Human-to-Human (H2H) traffic using MMPP. To characterize the H2H and M2M coexistence, we use Markov chains as a stochastic process tool. Once using the traditional evolved Node B (eNodeB), our simulation results show that the network's service completion rate will suffer significantly. In the worst-case scenario, when an accumulative storm of M2M requests attempts to access the network simultaneously, the degradation reaches 8% as a completion task rate. However, using our \"Coexistence of Heterogeneous traffic Analyzer and Network Architecture for Long term evolution\" (CHANAL) solution, we can achieve a service completion rate of 96%.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3f3cb3804cc655d1f785cec366e6af447e1e4fe149f7eebd31a00e0558528c0c","category":"Interdisciplinary"}