{"title":"Study on the dry shrinkage characteristics and size effect of swell-shrink characteristic soil","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307679","date":1722866400000,"content":"<p>by Aijun Chen, Xu Zhang, Xiong Shi, Shanshan Zhao, Junhua Chen</p>\r\n\r\nSwell-shrink characteristic soils exhibit a high susceptibility to cracking during the drying process, which poses a significant risk of various geological disasters. Among these, the occurrence of drying shrinkage acts as a prerequisite for the cracking phenomenon. Therefore, it is of utmost importance to comprehend the specific characteristics associated with the drying shrinkage mechanism. To investigate the drying shrinkage behavior of swell-shrink characteristic soils, a series of drying shrinkage experiments were conducted on long strip samples of red clay and expansive soil. Utilizing three-dimensional digital image correlation (DIC) technology, the surface displacement, strain, and anisotropic shrinkage rates of the soil samples during the drying process were obtained, and the size effect on the drying shrinkage of swell-shrink characteristic soil were analyzed. The research findings are as follows: The displacement development of the soil samples in the X and Y directions can be divided into two stages: a linear growth stage and a stable displacement stage. In the Z direction, the soil surface deformation can be divided into three stages: soil surface arching, vertical shrinkage, and shrinkage stabilization. The drying shrinkage of swell-shrink characteristic soil exhibits anisotropy, with the vertical shrinkage rate being the largest, followed by the longitudinal and then the transverse directions. Additionally, the soil sample shrinkage exhibits a size effect, whereby the shrinkage rates in all directions increase with increasing sample width and thickness. During the drying shrinkage process, the stress state on the soil surface evolves from initial tensile strain to subsequent compressive strain. The strain at different positions and times within the soil sample is not uniform, resulting in the non-uniformity and anisotropy of the sample shrinkage. This study provides important insights into the cracking mechanism of swell-shrink characteristic soils and serves as a valuable reference for related laboratory experiments, which will contribute to better prediction and control the geological hazards caused by the drying shrinkage of swell-shrink characteristic soils.","author":"Aijun Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3f44c02c9a5e19f5b6e00fef1ea98b9826a7f5fcb194e2b6b815c6b79c259ab3","category":"Interdisciplinary"}