{"title":"Stack Overflow รายงานผลสำรวจนักพัฒนา React แซงหน้า jQuery, PostgreSQL แซง MongoDB","link":"https://www.blognone.com/node/124069","date":1628097016000,"content":"<div><div><div><p>Stack Overflow ออกรายงานสำรวจนักพัฒนาประจำปีอีกครั้ง (ข่าวเก่า <a href=\"https://www.blognone.com/node/105113\">2018</a>, <a href=\"https://www.blognone.com/node/109281\">2019</a>, <a href=\"https://www.blognone.com/node/116657\">2020</a>) โดยรอบนี้สำรวจนักพัฒนา 83,439 คนเมื่อเดือนพฤษภาคมที่ผ่านมา ผู้ตอบอยู่ในสหรัฐฯ 15,288 คน</p>\n<p>ในแง่ของเทคโนโลยีเว็บมีความเปลี่ยนแปลงสำคัญ คือ React.js กลายเป็นเว็บเฟรมเวิร์ตที่มีการใช้งานอันดับหนึ่ง แทนที่ jQuery เรียบร้อยแล้ว แถมอันตราการแซงค่อนข้างเร็ว โดยมีผู้ใช้ React.js ถึง 40.14% (จาก 35.9%) ขณะที่ jQuery ลดลงเหลือ 34.42% (จาก 43.3%)  ส่วน Angular ก็มีการใช้งานลดลงเช่นกัน โดยมี Express แซงหน้าขึ้นมา ฝั่งไพธอนนั้น Flask ยังได้รับความนิยมสูงขึ้นเรื่อยๆ  และ FastAPI ติดอันดับเป็นครั้งแรก แต่เมื่อถามถึงเฟรมเวิร์คที่นักพัฒนารักที่สุด Svelte และ ASP.NET Core กลับได้ที่หนึ่งด้วยคะแนนเท่ากัน</p>\n<p>ภาษาโปรแกรมมิ่งนั้น Rust ยังคงเป็นภาษาที่นันพัฒนารักที่สุดเป็นปีที่ 5 แต่เมื่อถามว่าต้องการใช้ภาษาใด ภาษาไพธอนก็ยังครองแชมป์เป็นปีที่ 6 น่าสนใจคือภาษา Go กลับตกลงไปเป็นอันดับสี่ และผลสำรวจความต้องการใช้งานใกล้เคียงกับ Rust แล้ว</p>\n<p>ตัวฐานข้อมูล PostgreSQL ขึ้นมาเป็นอันดับหนึ่งของฐานข้อมูลที่นักพัฒนาต้องการใช้งานที่สุด แซงหน้า MongoDB เพียงเล็กน้อย แต่เมื่อถามถึงระบบฐานข้อมูลที่นักพัฒนารักที่สุดกลับเป็น Redis แซงหน้า PostgreSQL ไปเล็กน้อย</p>\n<p>แนวโน้มเงินเดือนนักพัฒนาปีนี้สูงขึ้นค่อนข้างชัดเจน ตำแหน่ง SRE เพิ่มขึ้นเป็น 84,000 ดอลลาร์จาก 80,000 ดอลลาร์ ตำแหน่ง DevOps Specialist เพิ่มเป็น 70,264 ดอลลาร์จาก 68,000 ดอลลาร์ ตำแหน่ง Full-Stack Developer เพิ่มเป็น 56,038 ดอลลาร์จาก 54,000 ดอลลาร์ (ทั้งหมดเป็นค่า median ของผู้ที่ตอบผลสำรวจ)</p>\n<p>ที่มา - <a href=\"https://insights.stackoverflow.com/survey/2021\">Stack Overflow</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f8ead7f8de8f4bc8910faeac98ccd205.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/stack-overflow\">Stack Overflow</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3f4d8bf00f6ba730419800259a56de2381c40bd1ddeb232d7971cf2648fe59e2","category":"Thai"}