{"title":"Substrate availability may limit the response of tropical bacterioplankton biomass to warming","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12647?af=R","date":1723549108000,"content":"<h2>Abstract</h2>\n<p>The response of heterotrophic bacterioplankton to the addition of macrophytic dissolved organic matter (DOM) and temperature was investigated in the Red Sea. We added 40 <i>μ</i>mol C L<sup>−1</sup> of leachates obtained from seagrass and mangrove leaves to natural bacterial communities, incubated them at three temperatures (25.5°C found in situ plus 3°C below and above that value) and monitored the microbial and biogeochemical responses over 4 d. Seagrass and mangrove DOM, important allochthonous sources in tropical oligotrophic regions, had distinct chemical characteristics compared to unamended seawater, with mangrove substrates containing comparatively more nitrogen and protein-like fluorescent DOM than seagrass. Specific growth rates (<i>μ</i>) increased twofold in the seagrass and mangrove treatments (1.0 and 0.8 d<sup>−1</sup>, respectively) relative to the seawater control (0.4 d<sup>−1</sup>). The biomass of heterotrophic bacteria generally reflected <i>μ</i> changes, reaching maximum values of 16.8 and 17.3 <i>μ</i>g C L<sup>−1</sup> in the seagrass and mangrove treatments, respectively, compared to just 2.6 <i>μ</i>g C L<sup>−1</sup> in seawater. The increase in <i>μ</i> values due to experimental warming followed the metabolic theory of ecology, mostly because of enhanced exoenzymatic activity, while cell size decreased as predicted by the temperature–size rule (mean −3% per °C increase). Although the labile nature of the specific seagrass and mangrove DOM leachates was clearly demonstrated, we conclude that tropical heterotrophic bacteria may have limited capability to increase their biomass as a consequence of future warming, even in the presence of high loadings of macrophytic DOM.</p>","author":"Xosé Anxelu G. Morán, \nMaria Ll. Calleja, \nFederico Baltar, \nLuis Silva, \nMohd Ikram Ansari, \nPaloma Carrillo de Albornoz, \nCarlos M. Duarte, \nChristian Lønborg","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"3f545b153e55aba11691de57c6538cb7e2d724c75570a63cb2870d56ad0dc5a3","category":"Environment"}