{"title":"Reaction-diffusion modeling provides insights into biophysical carbon-concentrating mechanisms in land plants","link":"https://academic.oup.com/plphys/article/196/2/1374/7690701?rss=1","date":1717977600000,"content":"<span><div>Abstract</div>Carbon-concentrating mechanisms (CCMs) have evolved numerous times in photosynthetic organisms. They elevate the concentration of CO<sub>2</sub> around the carbon-fixing enzyme rubisco, thereby increasing CO<sub>2</sub> assimilatory flux and reducing photorespiration. Biophysical CCMs, like the pyrenoid-based CCM (PCCM) of <span>Chlamydomonas reinhardtii</span> or carboxysome systems of cyanobacteria, are common in aquatic photosynthetic microbes, but in land plants appear only among the hornworts. To predict the likely efficiency of biophysical CCMs in C3 plants, we used spatially resolved reaction-diffusion models to predict rubisco saturation and light use efficiency. We found that the energy efficiency of adding individual CCM components to a C3 land plant is highly dependent on the permeability of lipid membranes to CO<sub>2</sub>, with values in the range reported in the literature that are higher than those used in previous modeling studies resulting in low light use efficiency. Adding a complete PCCM into the leaf cells of a C3 land plant was predicted to boost net CO<sub>2</sub> fixation, but at higher energetic costs than those incurred by photorespiratory losses without a CCM. Two notable exceptions were when substomatal CO<sub>2</sub> levels are as low as those found in land plants that already use biochemical CCMs and when gas exchange is limited, such as with hornworts, making the use of a biophysical CCM necessary to achieve net positive CO<sub>2</sub> fixation under atmospheric CO<sub>2</sub> levels. This provides an explanation for the uniqueness of hornworts' CCM among land plants and the evolution of pyrenoids multiple times.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"3f55e6aaf103354586c0b2c8c4dca47af07a502349c291ae3e3df70f1d95dec3","category":"Environment"}