{"title":"iOS 14.6 lands with Apple Card Family, Podcasts subscriptions, and more major security fixes","link":"https://www.macworld.com/article/344220/ios-14-6-features-security-release-date-how-to-install.html","date":1621876537000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>Apple started testing iOS 14.6 before the <a href=\"https://www.macworld.com/article/331864/ios-14-5-features-release-date-beta-how-to-install.html\">big iOS 14.5 release</a> even went out to the general public. With iOS 15 expected to begin testing at WWDC in June, many users thought iOS 14.5 would be the last release in the iOS 14 branch. It appears that Apple is not quite done iterating, and so we’ll get <a href=\"https://www.macworld.com/article/346989/ios-14-7-features-release-date-beta-how-to-install.html\">iOS 14.7</a> as well.</p>\n\n\n\n<p>The big feature in this release is support for the new <a href=\"https://www.macworld.com/article/346837/apple-music-lossless-hi-res-lossless-spatial-dolby-atmos-iphone-airpods-homepod-dac.html\">Apple Music lossless and Dolby Atmos formats</a>. While iOS 14.6 is required for those new formats, they will not appear until Apple enables them sometime in June. This release also brings the Apple Card Family and Podcasts subscriptions features that Apple first announced at its <a href=\"https://www.macworld.com/article/343881/everything-apple-announced-at-its-april-20-spring-loaded-event.html\">Spring Loaded event in April</a>. </p>\n\n\n\n<p><em><strong>Update 05/24/21:</strong> iOS 14.6 has been released. Apple is already testing its successor, <a href=\"https://www.macworld.com/article/346989/ios-14-7-features-release-date-beta-how-to-install.html\">iOS 14.7</a>.</em></p>\n\n\n\n<h2>What’s new in iOS 14.6</h2>\n\n\n\n<h3>Apple Music Lossless and Spatial Audio</h3>\n\n\n\n<p>Apple Music’s new Lossless, Hi-Res Lossless, and Dolby Atmos features are coming in June, and will require iOS 14.6.  Note that you may not see these features as soon as you upgrade to iOS 14.6! These features require a server-side update to Apple Music, which will arrive next month.</p>\n\n\n\n<h3>Apple Card Family</h3>\n\n\n\n<p>This version of iOS adds support for the Apple Card Family features announced in at the Spring Loaded event in April. </p>\n\n\n\n<h3>Podcasts subscriptions</h3>\n\n\n\n<p>Apple’s Podcasts Subscriptions feature, also announced at the Spring Loaded event in April, have arrived. Podcast creators will now be able to offer a variety of features for a monthly fee.</p>\n\n\n\n<h2>Security updates</h2>\n\n\n\n<p>There are also <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT212528&amp;xcust=1-1-344220-0-0-0&amp;sref=https://www.macworld.com/feed\">a wide range of security updates in iOS 14.6</a> that patch issues related to audio, I/O, and Webkit. Some of them seem pretty major so we recommend updating ASAP.</p>\n\n\n\n<h2>How to get iOS 14.6</h2>\n\n\n\n<p>Updating your iPhone to iOS 14.6 (or iPad to iPadOS 14.6) is simple. Just open the <em>Settings</em> app and tap on <em>General</em> and then <em>Software Updates</em> to download the latest release. It can take up to a few hours to become available everywhere around the globe, so don’t be alarmed if it’s not there right at 10am on May 24.</p>\n\n\n\n<p>If it’s already more than a day after release and you still don’t see it, try powering your phone down by holding the side button and volume up button for a few seconds, then sliding the “Slide to Power off” control. After a few second, press and hold the side button for a few second to turn your iPhone or iPad back on, and check for the update again.</p>\n\n\n\n<h2>Release notes</h2>\n\n\n\n<p>The full release notes for iOS 14.6 are as follows:</p>\n\n\n\n<p><strong>Apple Card Family</strong></p>\n\n\n\n<ul><li>Apple Card can be shared with up to five people, including anyone 13 years or older in your Family Sharing group</li><li>Apple Card Family adds support for families to track expenses, manage spending with optional limits and controls, and build credit together</li></ul>\n\n\n\n<p><strong>Podcasts</strong></p>\n\n\n\n<ul><li>Subscription support for channels and individual shows</li></ul>\n\n\n\n<p><strong>AirTag and Find My</strong></p>\n\n\n\n<ul><li>Lost mode option to add an email address instead of a phone number for AirTag and Find My network accessories</li><li>AirTag will show the partially masked phone number of the owner when tapped with an NFC-capable device</li></ul>\n\n\n\n<p><strong>Accessibility</strong></p>\n\n\n\n<ul><li>Voice Control users can unlock their iPhone for the first time after a restart using only their voice</li></ul>\n\n\n\n<p><strong>This release also fixes the following issues:</strong></p>\n\n\n\n<ul><li>Unlock with Apple Watch may not work after using Lock iPhone on Apple Watch</li><li>Reminders may appear as blank lines</li><li>Call blocking extensions may not appear in Settings</li><li>Bluetooth devices could sometimes disconnect or send audio to a different device during an active call</li><li>iPhone may experience reduced performance during startup</li></ul>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3f5756d2d6ac2eab3525118a3571cd54d88aaf4487b699973c3b2fb3d68c1442","category":"Apple"}