{"title":"Following carpel tunnel release, what factors affect whether patients return to the same or different hand surgeon for a subsequent procedure?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312159","date":1729605600000,"content":"<p>by Scott J. Halperin, Meera M. Dhodapkar, Neil Pathak, Peter Y. Joo, Xuan Luo, Jonathan N. Grauer</p>\r\nBackground <p>Following carpal tunnel release (CTR), patients may be indicated for subsequent hand surgery (contralateral CTR and/or trigger finger release [TFR]). While surgeons typically take pride in patient loyalty, the rate of returning to the same hand surgeons has not been previously characterized.</p> Methods <p>Patients undergoing CTR were isolated from 2010–2021 PearlDiver M151 dataset. Subsequent CTR or TFR were identified and characterized as being performed by the same or different surgeon, with patient factors associated with changing to a different surgeon determined by multivariable analyses.</p> Results <p>In total, 1,121,922 CTR patients were identified. Of these, subsequent surgery was identified for 307,385 (27.4%: CTR 289,455 [94.2%] and TFR 17,930 [5.8%]). Of the patients with a subsequent surgery, 257,027 (83.6%) returned to the same surgeon and 50,358 (16.4%) changed surgeons. Multivariable analysis found factors associated with changing surgeon (in order of decreasing odds ration [OR]) to be: TFR as the second procedure (OR 2.98), time between surgeries greater than 2-years (OR 2.30), Elixhauser-Comorbidity Index (OR 1.14 per 2-point increase), and male sex (OR 1.06), with less likely hood of changing for those with Medicare (OR 0.95 relative to commercial insurance) (p&lt;0.001 for each). Pertinent negatives included: age, Medicaid, and having a 90-day adverse event after the index procedure.</p> Conclusions <p>Over fifteen percent of patients who required a subsequent CTR or TFR following CTR did not return to the same surgeon. Understanding what factors lead to outmigration of patients form a practice may help direct efforts for patient retention.</p>","author":"Scott J. Halperin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3f5c20bf5fac3f03e4a015ee52bce15015361cf7244186c0d594086447740c85","category":"Interdisciplinary"}