{"title":"Physiological adaptation to irradiance in duckweeds is species and accession specific and depends on light habitat niche","link":"https://academic.oup.com/jxb/article/75/7/2046/7529109?rss=1","date":1705104000000,"content":"<span><div>Abstract</div>Duckweeds span 36 species of free-floating aquatic organisms with body sizes ranging from 2 mm to 10 mm, where each plant body plan is reduced to a largely leaf-like structure. As an emerging crop, their fast growth rates offer potential for cultivation in closed systems. We describe a novel UK collection derived from low light (dLL) or high light (dHL) habitats, profiled for growth, photosynthesis, and photoprotection (non-photochemical quenching, NPQ) responses. Twenty-three accessions of three <span>Lemna</span> species and one <span>Spirodela polyrhiza</span> were grown under relatively low light (LL: 100 μmol m<sup>–2</sup> s<sup>–1</sup>) and high light (HL: 350 μmol m<sup>–2</sup> s<sup>–1</sup>) intensities. We observed broad within- and between-species level variation in photosynthesis acclimation. Duckweeds grown under HL exhibited a lower growth rate, biomass, chlorophyll, and quantum yield of photosynthesis. In HL compared with LL, carotenoid de-epoxidation state and NPQ were higher, whilst PSII efficiency (φPSII) and Chl <span>a</span>:<span>b</span> ratios were unchanged. The dLL plants showed relatively stronger acclimation to HL compared with dHL plants, especially <span>Lemna japonica</span> accessions. These achieved faster growth in HL with concurrent higher carotenoid levels and NPQ, and less degradation of chlorophyll. We conclude that these data support local adaptation to the light environment in duckweed affecting acclimation in controlled conditions.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"3f5f90e4070c2f1127117ca01013634deea3e707e4b4527279a4cb2e3af6191d","category":"Environment"}