{"title":"PSV-24 Administering the maternal bovine appeasing substance before slaughter to improve carcass characteristics of finishing cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/560/7757839?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Two experiments evaluated carcass characteristics of finishing steers administered the maternal bovine appeasing substance (mBAS) prior to slaughter. In Exp. 1, Angus-influenced finishing steers (n = 954) housed in 6 original pens were used. Each original pen was split into a pair of experimental pens 14.3 d ± 3 d prior to slaughter, in a manner that number of steers and average pen body weight (BW) were similar. An oiler containing mBAS (Ferappease Finish Cattle 5%; FERA Diagnostics and Biologicals; College Station, TX) was added to one of the experimental pens 7 d prior to slaughter (n = 6), whereas the other pen did not contain an oiler (CON; n = 6). The oiler was designed to deliver 120 mL of mBAS/steer during a 7-d period. Steer BW was recorded 7 d prior to and during loading (final BW) to the packing plant. No treatment effects were detected (<span>P</span> ≥ 0.51) for BW gain, final BW, and proportion of carcasses that graded Choice or Prime. Carcass dressing was greater (<span>P</span> = 0.02) in mBAS compared with CON steers (65.9 vs. 64.2%; SEM = 0.5), which was not sufficient to impact hot carcass weight (HCW; <span>P</span> = 0.29). Incidence of dark-cutting carcasses did not differ between treatments (<span>P</span> = 0.23), despite being decreased by 3-fold in mBAS steers. In Exp. 2, Angus-influenced finishing steers (n = 80) housed in 16 pens (5 steers/pen) were used. Pens were arranged in 4 rows of 4 pens/row, and rows were alternately assigned to receive an oiler containing mBAS (n = 8) or mineral oil (CON+; n = 8) 7 d prior to slaughter. Oilers were designed to deliver 120 mL/steer of mBAS or mineral oil during the 7-d period. Steer BW was recorded as in Exp. 1, and a blood sample was collected during exsanguination. No treatment effects were detected (<span>P</span> ≥ 0.20) for BW parameters, carcass marbling score, backfat thickness, longissimus muscle area, yield grade, and proportion of carcasses that graded Choice or Prime. Carcass dressing was greater (<span>P</span> = 0.02) in mBAS steers compared with CON+ (60.6 vs. 59.6%; SEM = 0.3) but HCW did not differ (<span>P</span> = 0.47) between treatments. Plasma cortisol concentration was less (<span>P</span> &lt; 0.01) in mBAS steers compared with CON+ (11.7 vs. 20.8 ng/mL; SEM = 1.6). Incidence of dark-cutting carcasses did not differ (<span>P</span> = 0.53) between treatments, despite a 2-fold decrease in mBAS steers. In summary, mBAS administration to finishing cattle using oilers during the last 7 d on feed alleviated the stress elicited by the process of slaughter, which resulted in increased carcass dressing.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3f636c178cb3d1172c7fe00b6cb02eb7ee7c1ff31eefb4d9a5bc178a556c059a","category":"Environment"}