{"title":"Individual Protective Covers (IPCs) Improve Yield and Quality of Citrus Fruit under Endemic Huanglongbing (HLB)","link":"https://www.preprints.org/manuscript/202407.2288/v1","date":1722241403000,"content":"The use of individual protective covers (IPCs) to protect newly planted citrus trees from HLB infection  is being widely adopted in Florida, an HLB endemic citrus producing area. It is known that IPCs positively influence most horticultural traits, increasing tree growth, flush expansion, and leaf size enabling trees to sustain a balanced carbohydrate metabolism by preventing CLas infection and induced higher leaf chlorophyll levels. This may result in more productive trees. However, as the tree grows IPCs eventually are removed, typically between 2 and 3 years after initial installation. Once IPCs are removed, trees become exposed to the ACPs and ultimately become infected. In this work we covered trees from Valencia sweet orange with IPCs for 30 months, until the trees entered fruit bearing age. We investigated how IPC protection of newly planted trees for 30 months influenced fruit quality and yield of ‘Valencia’ trees for three consecutive seasons after IPC removal compared to non-covered trees.  The use of IPCs kick-started the newly planted citrus trees, resulting in more yield and fruits with better internal and external quality. After 30 months of IPC protection, tree canopies were larger and denser supporting more fruit per tree than in non-protected trees for three consecutive seasons even though by the end of the first season after IPC removal trees were HLB positive. Tree height,  scion diameter, canopy volume, and leaf area were significantly improved as compared to non-covered trees. Additionally, fruit quality was significantly improved in the three seasons following IPC removal as compared to non-covered trees. However, a decline in quality was measurable in fruit from IPC trees after the second harvesting season, with trees affected by HLB. Based on the results from this study, we conclude that benefits from IPC protection may last for at least three consecutive seasons once trees enter the productive age despite CLas-infection within 12 months after IPC removal.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3f63b460dbf8a17e0140926238bd06f8cdec5d75555c706b28f6a490d994ea21","category":"Interdisciplinary"}