{"title":"Google’s 36% search revenue share with Apple is 3x what Android OEMs get","link":"https://arstechnica.com/?p=1984072","date":1700086671000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Google-Monopoly-800x450.jpg\" alt=\"The logo for the board game Monopoly, complete with Uncle Pennybags, has been transformed to say Google.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Google-Monopoly.jpg\">Enlarge</a> <span>/</span> Let's see, you landed on my \"Google Ads\" space, and with three houses... that will be $1,400.  (credit: Ron Amadeo / Hasbro)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The biggest slip-up of the Department of Justice's Google search monopoly trial was the reveal that Google pays Apple <a href=\"https://arstechnica.com/tech-policy/2023/11/google-witness-accidentally-blurts-out-that-apple-gets-36-cut-of-safari-deal/\">36 percent</a> of Safari search revenue to remain the default search engine. Google stated it didn't want that number getting out because it “would unreasonably undermine Google’s competitive standing in relation to both competitors and other counterparties.” Google attorney John Schmidtlein apparently \"visibly cringed\" when the number was revealed by its witness (it was <a href=\"https://arstechnica.com/tech-policy/2023/11/google-wraps-defense-by-arguing-its-search-dominance-benefits-everyone/\">later confirmed</a> by Google CEO Sundar Pichai) because Google knows it now has a mess on its hands.</p>\n<p>Many of those \"competitors and other counterparties\" Google is worried about are Android manufacturers. They all get paid some amount of search revenue share, but seeing the huge amount Apple gets paid has probably ruffled some feathers.</p>\n<p>How much more does Google pay for an Apple user than an Android one? A lot. It was <a href=\"https://www.bloomberg.com/news/articles/2023-11-14/for-google-play-dominating-the-android-world-was-existential?embedded-checkout=true\">recently revealed</a> in the <em>Epic v. Google</em> trial (Google has a few monopoly lawsuits going on) that the highest tier of search revenue share for cooperative Android OEMs is only 12 percent, a third of what Google pays Apple. In terms of total cash amount, it's reasonable to assume Apple gets more total money than many smaller companies but to see the direct breakdown that each Apple user is worth three times more than an Android user is a new insight.</p></div><p><a href=\"https://arstechnica.com/?p=1984072#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1984072&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3f63279852bcdc048a088b03d2865195d003944a2df43dbb8e0b16e8f84c40ac","category":"Tech"}