{"title":"Trend Micro Antivirus review","link":"https://www.macworld.com/article/234467/trend-micro-antivirus-review.html","date":1689957083000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n<div><span>At a Glance</span><h3>Expert's Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Excellent malware detection rate</li><li>Monitors for ransomware-style attacks from unknown software in specific folders</li><li>Low system load</li></ul></div><div><h3>Cons</h3><ul><li>Fewer extra features compared to less-expensive or similarly priced higher-rank competitors</li></ul></div></div></div><h3>Our Verdict</h3><p>Trend Micro Antivirus is a good program with well-rated antivirus protection and a simple, straightforward interface that users will appreciate. Anyone looking for additional features will be disappointed with this suite, but it offers good protection at a fair price.</p>\n</div><h3>Price When Reviewed</h3><p>US$30 for the first year</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today: Trend Micro Antivirus for Mac\t\t</h3>\n\t\t\t\t<div>\n\t\t\n\t\t<div>\n\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Trend Micro</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$29.95</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://www.kqzyfj.com/click-100470607-11786122?sid=1-1-234467-2-246141-10131&amp;url=https://www.trendmicro.com/en_us/forHome/products/antivirus-for-mac.html\" target=\"_blank\">View Deal</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\tPrice comparison from Backmarket\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t</div>\n\t\t</div>\n\t\t\n\n\n<p>Trend Micro is probably known by business users, which is where the Japanese manufacturer puts its focus. However, Trend Micro also has a long history with private users looking for virus protection and is one of the best on the market.</p>\n\n\n\n<h2>Features </h2>\n\n\n\n<p>Protection against ransomware is provided and monitors selected folders for suspicious actions. If blackmailing software starts to encrypt data in the Documents folder, for example, this function should prevent this. As usual with many antivirus programs, there is also the mandatory browser extension, which is intended to protect against malware sites. </p>\n\n\n\n<p>But the range of functions seems quite limited compared to competitors such as <a href=\"https://www.macworld.com/article/668092/norton-360-review.html\">Norton</a> and <a href=\"https://www.macworld.com/article/2005226/malware-protection-avast-security-antivirus-scanner-in-test.html\">Avast</a>. For example, there is no anti-phishing function and no VPN application included in the package, which is quite unusual today. Instead, the app recommends Cleaner One Pro, which costs an additional fee.</p>\n\n\n\n<p>The reason for this is likely the fact that the Trend Micro group has other apps for iOS and macOS on offer. These additional programs, rather than being distributed via the official homepage of Trend Micro, are distributed directly via the App Store. Here you will also find the mandatory VPN app for Mac and iPhone, an alternative antivirus solution (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/gb/app/antivirus-one-virus-cleaner/id1068435535?mt=12&amp;xcust=1-1-234467-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Antivirus One</a>), and the free browser extension Trend Micro Browser Security. </p>\n\n\n\n<p>Unfortunately, this leaves Trend Micro’s Antivirus for Mac app a little light on features.  </p>\n\n\n\n<h2>Malware detection</h2>\n\n\n\n<p>There’s no doubt, however, that Trend Micro Antivirus offers good protection.  In 2023 <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.av-comparatives.org/tests/mac-security-test-review-2023/&amp;xcust=1-1-234467-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">AV-Comparatives</a> gave Trend Micro Antivirus for Mac a 100 percent Mac Malware protection score and 100% for Windows Malware detection, protection from Mac PUA (potentially unwanted applications) got a score or 99 percent. That puts it alongside the leaders in AV-Comparitives malware tests. </p>\n\n\n\n<p>Our own spot checks produced similarly good results. Lining up against the Objective See malware library Trend Micro had no trouble detecting most threats as soon as it was unzipped; however, in a few cases, it didn’t detect all the malware contained in a folder until a scan had been run.</p>\n\n\n\n<p>The system load is low so Trend Micro users should not noticeably slow down any action in practice.</p>\n\n\n\n<h2>Installation and interface </h2>\n\n\n\n<p>The installation of a virus scanner is always a bit cumbersome, so extensions must be released via system settings and the so-called hard disk access must also be granted. This is explained during installation via a small help tool that criticizes missing releases and only then allows the software to start. The program isn’t too challenging to use, but looks almost old-fashioned compared to many competitors.</p>\n\n\n\n<p>On the left are five menu items: <em>Overview</em>, <em>Web</em>, <em>Scans</em>, <em>Folder Shield</em>, and <em>Logs</em>. <em>Overview</em> is the at-a-glance dashboard for Trend Micro Antivirus. It shows that the various protections are active. You will also find buttons for updating virus definitions and running scans. It also displays, in much smaller lettering, the last time the app was updated and the last time a scan was run. </p>\n\n\n\n<p>The <em>Web</em> menu option manages what Trend Micro calls its toolbar, though it’s really an extension. Trend Micro’s web extension boasts a privacy scanner that is supposed to check your privacy settings on Facebook, Twitter, and LinkedIn. But it doesn’t offer that option in the extension itself. It’s a real oversight that Trend Micro hasn’t corrected by returning the feature to the extension or deleting mention of it from the app. The extension does take the usual actions you’d expect from web protection such as warning against malicious links.</p>\n\n\n\n<p>For <em>Scans</em>, Trend Micro offers a smart scan, custom scan, and full scan. Finally, <em>Folder Shield</em> is Trend Micro’s approach to ransomware protection. Here, you flag specific folders and if an unknown program tries to change anything in them, Trend Micro will alert you. By default, this includes key folders such as Documents, Music, Pictures, Movies, and Mobile Documents. It also protects USB drives plugged into the Mac by default.</p>\n\n\n\n<p>One additional protection Trend Micro offers is activated during installation: webcam and microphone protection. Like other suites, this is designed to prevent rogue programs from overtaking your equipment.</p>\n\n\n\n<p>Sometimes these folder shield features can be too overzealous and a common issue is that they don’t take kindly to using command-line programs such as Git. Using a version control system is perhaps an edge case, but it’s a good way to see how problematic this protection might be for day-to-day use. In our tests, we had no trouble using Git and the command line to manipulate files as we saw fit.</p>\n\n\n\n<h2>Price </h2>\n\n\n\n<p>As usual, the purchase price for the first year is greatly reduced, a license for a single Mac costs only <a href=\"https://www.kqzyfj.com/click-100470607-11786122?sid=1-1-234467-1-0-0&amp;url=https://www.trendmicro.com/en_us/forHome/products/antivirus-for-mac.html\" target=\"_blank\">$29.50</a> / <a href=\"https://www.kqzyfj.com/click-100470607-11786122?sid=1-1-234467-1-0-0&amp;url=https://www.trendmicro.com/en_gb/forHome/products/antivirus-for-mac.html\">£19.95</a>. However, next year will then cost the full price of $39.95/£49.95.</p>\n\n\n\n<h2>Verdict </h2>\n\n\n\n<p>Trend Micro is an excellent choice for those looking for something that’s simple and easy to use.</p>\n\n\n\n<p>There are options with better protection, however, Trend Micro’s protection is still good and pricing is fair, although you don’t get a lot for your money compared to other services that are just slightly more expensive and offer protection for more than just one device. Still, if all you need is good protection without any of the frills, Trend Micro works.</p>\n\nProfessional Software, Security Software and Services</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"3f69e86f81e1fd35cee4bdfc63ac3102ae7d43776a0d2555c8e5c68e02563bb1","category":"Apple"}