{"title":"BMW’s Neue Klasse points to a radical reinvention for future sedans","link":"https://arstechnica.com/?p=1965050","date":1693643424000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/P90519766-800x755.jpeg\" alt=\"A BMW neue klasse concept in the desert, with a door open\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/P90519766-scaled.jpeg\">Enlarge</a> <span>/</span> The BMW Neue Klasse won't look exactly like this, but details like e-ink will appear in production. (credit: BMW)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>BMW provided flights from Albany to Munich and back, and three nights in a hotel so we could visit the IAA Munich auto show. Ars does not accept paid editorial content.</aside>\n<p>Some car manufacturers are easing their way into electrification by taking existing products and swapping engines and fuel tanks for motors and batteries. Others are taking a more radical approach, rebooting and refreshing to take advantage of the new design flexibility afforded by electric drivetrains.</p>\n<p>BMW has done a little bit of both, starting with the radical i3 and i8 but lately offering things like <a href=\"https://arstechnica.com/cars/2021/10/the-2023-bmw-i4-is-the-electric-bmw-sedan-youve-been-waiting-for/\">the i4</a> and <a href=\"https://arstechnica.com/cars/2022/11/testing-bmws-biggest-and-best-sedan-now-fully-electric-the-2023-i7/\">i7</a>, visually and conceptually quite similar to their <a href=\"https://arstechnica.com/cars/2022/11/how-the-the-wire-helped-me-understand-the-2023-bmw-760i-xdrive/\">gas-powered</a> counterparts. For its next generation of EVs, though, it looks like BMW is committing to the reinvention approach. Meet the all-new-everything Neue Klasse.</p>\n<p>Neue Klasse, which simply means \"new class\" in German, is a reference back to a line of coupes and sedans that BMW launched through the 1960s and early '70s. These are the cars largely responsible for establishing the brand identity we think of today when we think \"BMW.\" With this neue Neue Klasse, BMW is reinventing itself again, this time with a focus on sustainability and electrification—plus a wild design that's unlike any previous production car.</p></div><p><a href=\"https://arstechnica.com/?p=1965050#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1965050&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3f6a6b26f1e2b1adc24b3c5050dccc414cc3ead1311fc470f8a2b5082d1950ab","category":"Tech"}