{"title":"256 Evaluating the effect limit feeding yearling beef steers for 56 or 86 d of a 140-d finishing period on growth performance and carcass trait responses","link":"https://academic.oup.com/jas/article/102/Supplement_3/361/7757101?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The objective of this study was to determine the effect of limit feeding yearling beef steers for 56 or 86 d before offering ad libitum feed for the remainder of the 140-d finishing period on growth performance and carcass traits. Black Angus steers [n = 194; initial body weight (SBW) = 410 ± 17.9 kg] were allocated into 24 pens (8 steers/pen). Pens were randomly assigned to one of three treatments in a randomized complete block design; feed offered ad libitum for the entire finishing period (ADLIB), feed offered at 92% of ad libitum for 56 d then ad libitum for the remainder of the finishing period (RES56), and feed offered at 92% of ad libitum for 86 d then ad libitum for the remainder of the finishing period (RES86). Feed restrictions began on d 22 after diet adaptation with RES56 and RES86 pens being offered 92% of the ADLIB pen within the daily feed offering of their block. Bunks were evaluated daily, and refusals were weighed weekly. Data were analyzed using the MIXED procedure of SAS 9.4 with treatment and block as the fixed and random effects, respectively. From d 1 to 21 RES56 had lesser average daily gain (ADG), feed efficiency (gain to feed; G:F), and a lighter SBW than ADLIB and RES86 (<span>P</span> ≤ 0.02), but DMI did not differ (<span>P</span> ≥ 0.31). From d 22 to 107, G:F was similar (<span>P</span> = 0.45), but ADLIB had a greater SBW, ADG, and DMI than RES56 and RES86 (<span>P</span> &lt; 0.01). From d 78 to 107 RES56 were allowed ad libitum feed intake while RES86 was still restricted. The d 108 SBW tended to be greatest in the ADLIB and least in the RES86 group (<span>P</span> = 0.07), and DMI was least in the RES86 group (<span>P</span> &lt; 0.01). RES56 had the greatest ADG, RES86 the least, and ADLIB were intermediate (<span>P</span> &lt; 0.01). RES56 and RES86 also had increased G:F than ADLIB during this period (<span>P</span> &lt; 0.01). From d 108 to 140 all cattle had ad libitum access to feed, and DMI did not differ (<span>P</span> = 0.31). RES86 had greater ADG and G:F than ADLIB and RES56 during this period (<span>P</span> ≥ 0.31). Cumulatively, final SBW, ADG, and G:F did not differ between the treatments (<span>P</span> ≥ 0.13), but the ADLIB group had increased DMI (<span>P</span> &lt; 0.01). Ribeye area and hot carcass weight (HCW) did not differ (<span>P</span> ≥ 0.12), but rib fat thickness (<span>P</span> = 0.05) and marbling were greater for ADLIB (<span>P</span> = 0.03). Limit feeding yearling beef steers for a portion of the finishing period before resuming ad libitum feed intake resulted in less cumulative DMI without affecting ADG, G:F, final shrunk BW, or HCW; but decreased fat and marbling scores.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"3f7c15318c450218933f940fce074139362fc4aed7c61208f20314f1d9bd705f","category":"Environment"}