{"title":"HashiCorp wins the Palo Alto Networks 2023 Global Technology Partner of the Year award","link":"https://www.hashicorp.com/blog/hashicorp-wins-the-palo-alto-networks-2023-global-technology-partner-of-the-year","date":1701709200000,"content":"<p>We are honored to share that HashiCorp has been named the 2023 <a href=\"https://www.paloaltonetworks.com/blog/2023/11/announcing-our-2023-partner-award-winners/\">Global Technology Partner of the Year by Palo Alto Networks</a>. And we’re even more excited to receive this award for the second time in a row! </p>\n\n<p>These annual awards are presented to an elite group of Palo Alto Networks partners that, over the past 12 months, have excelled in delivering customer solutions. Palo Alto Networks recognized HashiCorp for comprehensive product engineering work on behalf of customers, as well as our go-to-market partnership.</p>\n\n<p>Palo Alto Networks and HashiCorp have been collaborating since 2018, helping customers through their cloud maturity journey using a cloud operating model. Our technology integrations with Palo Alto Networks involve multiple HashiCorp products, including Terraform, Consul, and Vault, which address multi-cloud infrastructure management, security, scalability, and development speed. </p>\n\n<p>“We are delighted to be awarded Palo Alto Networks Global Technology Partner of the Year for the second year in a row,” said Asvin Ramesh, HashiCorp’s Senior Director of Partner Alliances. “Our partnership continues to provide customers with joint solutions for some of the most significant business challenges related to infrastructure and security.”</p>\n\n<p>“Collaboration and integration between technology companies is critical to enabling strong security capabilities for customers,” noted Pamela Cyr, Vice President of Technical Partnerships at Palo Alto Networks. “Together with our technology partners, we’re combining best of breed technologies to create pre-built integrations that help our customers achieve stronger operational efficiencies, improved end-user experiences, and better security outcomes. We’re proud to recognize HashiCorp as Palo Alto Networks 2023 Global Technology Partner of the Year and we look forward to our continued innovation together.” </p>\n\n<h2>Learn more about the HashiCorp-Palo Alto Networks partnership</h2>\n\n<p>For more information on the partnership, see our <a href=\"https://www.hashicorp.com/partners/tech/palo-alto-networks\">Palo Alto Networks partnership page.</a> For more information on Palo Alto Networks, visit <a href=\"http://www.paloaltonetworks.com\">paloaltonetworks.com</a>. And be sure to check out our joint white paper on how to <a href=\"https://www.hashicorp.com/resources/the-cloud-operating-model-with-palo-alto-networks-and-hashicorp\">Scale Your Cloud Operating Model with HashiCorp and Palo Alto Networks</a>.</p>\n","author":"Alejandra Velasquez","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"3f7cb2db460df849feeec8df66d366ec41acecb8b276057f1b9b8e1e2faa5590","category":"Tech"}