{"title":"Assessment of the Global Relationship of Different Types of Droughts in Model Simulations Under High Anthropogenic Emissions","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003629?af=R","date":1713600908000,"content":"<h2>Abstract</h2>\n<p>This study provides a global analysis of the relationship between drought metrics obtained from several climatic, hydrologic and ecological variables in a climate change framework using CMIP6 model data. A comprehensive analysis of the evolution of drought severity on a global scale is carried out for the historical experiment (1850–2014) and for future simulations under a high emissions scenario (SSP5-8.5). This study focuses on comparing trends in the magnitude and duration of drought events according to different standardized indices over the world land-surface area. The spatial and temporal relationship between the different drought indices on a global scale was also evaluated. Overall, there is a fairly large consensus among models and drought metrics in pointing to drought increase in southern North America, Central America, the Amazon region, the Mediterranean, southern Africa and southern Australia. Our results show important spatial differences in drought projections, which are highly dependent on the drought metric employed. While a strong relationship between climatic indices was evident, climatic and ecological drought metrics showed less dependency over both space and time. Importantly, our study demonstrates uncertainties in future projections of drought trends and their interannual variability related to the relationship among indices, stressing the importance of coherent climatic, hydrological and plant physiological patterns when analyzing CMIP6 model simulations of droughts under a warming climate scenario.</p>","author":"Luis Gimeno‐Sotelo, \nAhmed El Kenawy, \nMagí Franquesa, \nIván Noguera, \nBeatriz Fernández‐Duque, \nFernando Domínguez‐Castro, \nDhais Peña‐Angulo, \nFergus Reig, \nRogert Sorí, \nLuis Gimeno, \nRaquel Nieto, \nSergio M. Vicente‐Serrano","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"3f8419d15f877298883f104e5c20b76536054ca2366ad6a57fb4f5818f1e2045","category":"Environment"}