{"title":"Predictive value of CD86 for the occurrence of sepsis (Sepsis-3) in patients with infection","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302063","date":1712844000000,"content":"<p>by Dan lv, Keji Zhang, Changqing Zhu, Xinhui Xu, Hao Gong, Li Liu</p>\r\n\r\nThis prospective observational study explored the predictive value of CD86 in the early diagnosis of sepsis in the emergency department. The primary endpoint was the factors associated with a diagnosis of sepsis. The secondary endpoint was the factors associated with mortality among patients with sepsis. It enrolled inpatients with infection or high clinical suspicion of infection in the emergency department of a tertiary Hospital between September 2019 and June 2021. The patients were divided into the sepsis and non-sepsis groups according to the Sepsis-3 standard. The non-sepsis group included 56 patients, and the sepsis group included 65 patients (19 of whom ultimately died). The multivariable analysis showed that CD86% (odds ratio [OR] = 1.22, 95% confidence interval [CI]: 1.04–1.44, P = 0.015), platelet count (OR = 0.99, 95%CI: 0.986–0.997, P = 0.001), interleukin-10 (OR = 1.01, 95%CI: 1.004–1.025, P = 0.009), and procalcitonin (OR = 1.17, 95%CI: 1.01–1.37, P = 0.043) were independent risk factors for sepsis, while human leukocyte antigen (HLA%) (OR = 0.96, 05%CI: 0.935–0.995, P = 0.022), respiratory rate (OR = 1.16, 95%CI: 1.03–1.30, P = 0.014), and platelet count (OR = 1.01, 95%CI: 1.002–1.016, P = 0.016) were independent risk factors for death in patients with sepsis. The model for sepsis (CD86%, platelets, interleukin-10, and procalcitonin) and the model for death (HLA%, respiratory rate, and platelets) had an area under the curve (AUC) of 0.870 and 0.843, respectively. CD86% in the first 24 h after admission for acute infection was independently associated with the occurrence of sepsis in the emergency department.","author":"Dan lv","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"3f9c51e1b227bd00e1722a34d679f9ae2c4571e37b7de30d4880f65421aa79ea","category":"Interdisciplinary"}