{"title":"‘I have really fallen for cycling’: James Gay-Rees, ‘Tour de France: Unchained’ producer Q&A","link":"https://www.cyclist.co.uk/in-depth/james-gay-rees-tour-de-france-unchained-interview","date":1687882128000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/james-gay-rees-tour-de-france-unchained-interview\">‘I have really fallen for cycling’: James Gay-Rees, ‘Tour de France: Unchained’ producer Q&amp;A</a></p>\n\n<p>The eight-episode docuseries <em><a href=\"https://www.cyclist.co.uk/in-depth/netflix-unchained-review\" target=\"_blank\">Tour de France: Unchained</a></em> was released on Netflix this month from the same producers as F1’s <em>Drive to Survive</em>. It focusses on the 2022 <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\" target=\"_blank\">Tour de France</a> and currently has an IMDB rating of 8.3/10, indicating it seems to have been an enjoyable watch for both fans of the sport and new viewers.</p>\n\n\n\n<p>James Gay-Rees, one of four executive producers of the series<em> </em>– and former winner of an Oscar, BAFTA, Grammy and Emmy awards for <em>Senna</em>, <em>Amy</em>, and <em>Drive to Survive </em>– wasn’t a cycling fan before production began, but now a convert, he caught up with him to discuss his favourite riders, potential for a season two, <a href=\"https://www.cyclist.co.uk/tags/womens-cycling\" target=\"_blank\">women’s cycling</a> and <a href=\"https://www.eurosport.co.uk/cycling/tour-de-france/2022/wow-jonas-vingegaard-allows-tadej-pogacar-to-catch-up-after-crash-in-incredible-gesture-at-tour-de-france_vid1719155/video.shtml\" target=\"_blank\"><em>that</em> handshake</a> not making the cut. </p>\n\n\n\n<div></div>\n\n\n\n<p><strong><em>Cyclist</em>: Were you a fan of cycling before working on Unchained?</strong></p>\n\n\n\n<p>James Gay-Rees: I have a bike as I’ve done a couple of triathlons but I was a little bit scared of the Tour de France. I thought I was maybe a bit too stupid to understand it and wouldn’t be able to get my head around it even though I had loads of friends raving about it. </p>\n\n\n\n<p>When we became involved with making the show I thought that was quite healthy in a way as I deliberately stayed away from a lot of the planning and conversations with teams, I wanted to approach the edit as a complete novice because you want the hardcore cycling fans to watch it, but you want new fans to come to it too. I was trying to be that person, saying what worked for me, what parts got me excited and what concepts I didn’t understand, then relay that back.</p>\n\n\n\n<p>I have to say now – even though I don’t have that much time to watch everything – I have really fallen for cycling. I appreciate just how special it is now and I find it fascinating. I care about who does what, which riders are where, which riders that teams have brought in and for what purpose. I’m desperate to get to a stage this year if I can find the time.’</p>\n\n\n\n<p><strong>As a producer, there’s no one regular day for you. What was it like throughout the Tour de France process?</strong></p>\n\n\n\n<p>I do a lot of editing typically between November and the end of February. It gets a bit dark and gloomy going from one cut to another. At the start, I was with the stakeholders, there’s the raising money aspect of it, running the development, the HR part of it. I’m mostly involved in the beginning and the end of the process.</p>\n\n\n\n<p><strong>When you’re editing, how do you maintain tension throughout the series?</strong></p>\n\n\n\n<p>It’s the same with all these shows really, in the sense that they’re all reflective. They’re giving insight into things that have already happened, but hopefully in such a different way that it’s not really about the result, per se, it’s about the journey. Obviously by the time people watch <em>Drive to Survive</em>, everybody knows who won the World Championship, so it’s not really the point. It’s an insight into why some decisions were made at different points.</p>\n\n\n\n<p>You just try to set off a braid of narratives running. You can’t feature every team in every episode, but you come back to them. Netflix is very keen that you don’t do one team per episode, if you’re a Ferrari fan, you might only watch the Ferrari episode and not the rest of it. We’ve got to try and make the whole thing appealing and interconnected.’</p>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2019/10/02193048/tadej_pogacar_and_jonaas_vingegaard_by_michael_steele_via_getty_-970x647.jpg\" alt=\"tadej_pogacar_and_jonaas_vingegaard_by_michael_steele_via_getty_\" /><figcaption>Michael Steele via Getty </figcaption></figure>\n\n\n\n<p><strong>Do you have a favourite episode from either during the editing process or after watching it on Netflix?</strong></p>\n\n\n\n<p>I do like all the episodes, and there’s certain things that frustrate me as well. I really liked the <a href=\"https://www.cyclist.co.uk/tags/tom-pidcock\" target=\"_blank\">Tom Pidcock</a> episode because he’s such a breath of fresh air and I love his approach to it all, plus his riding is unbelievable. Jasper Philipsen too is a great character; the final sprint was amazing.</p>\n\n\n\n<p>The episodes look quite straightforward but they’re hard to get right in the edit. It’s a funny thing, I never really watch anything back; I saw a bit of <em>Senna</em> on a plane a couple of years ago, but when you’ve watched things so many times, you don’t want to watch them ever again. It’s painful; it’s fun; you get a sense of satisfaction from doing it; we have a mixed relationship with them I think by the end of the process.’</p>\n\n\n\n<p><strong>What frustrated you?</strong></p>\n\n\n\n<p>It’s no more bizarre than just the fact that you quite often can’t include good material. We get that all the time from athletes and you’re like,<em> </em>‘I know, it was great scene, but it just didn’t work in the context of this episode.’ Edits have their own way of taking shape and you have to make tough decisions to get through a story from A to Z in 45 minutes.’</p>\n\n\n\n<p><strong>Is that what happened with the Pogačar/Vingegaard handshake? </strong></p>\n\n\n\n<p>Yeah, you know what, some people have mentioned that. Honestly, it’s not something that was massively on my radar because I wasn’t following every bit of it all. I do need to ask the team why that didn’t go in because it obviously sounds like a great moment. There will have been a reason, I just don’t know right now.</p>\n\n\n\n<p><strong>With editing, is there something to be said about showing crashes almost a bit too repeatedly?</strong></p>\n\n\n\n<p>Having made films about racing drivers that die, you’ve got to treat the situation with total respect. I think that it really depends on the situation. If you’re talking about <a href=\"https://www.cyclist.co.uk/in-depth/gallery-fabio-jakobsen-the-comeback-kid\" target=\"_blank\">Fabio Jakobsen</a>‘s crash in Poland for example, the whole point of the episode was going through something as horrific as he did and sharing the journey back, which I think was well balanced. Of course, you probably do replay the crash a couple of times but I don’t think it’s too gratuitous because we were trying to highlight what was at stake for him because of what he’d been through.</p>\n\n\n\n<p>I think it earned the right to be told that way. If it was at the Tour de France, we’d have to think long and hard about how we dealt with that. Perhaps we wouldn’t include it at all. Context is important. But it would be a complete fallacy for a more-casual F1 fan to say they didn’t watch the beginning of the race to see if there’s going to be a crash, because some do. It’s human nature, you do not want anybody get hurt, you want to see drama and action. It’s part and parcel of the sport, you can’t pretend it’s not there. It’s about treating it with the right level of respect and context.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/netflix-unchained-review\">Netflix’s Tour de France Unchained review: An entertaining recap with a Pogačar-shaped hole</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-2022-stage-18-gallery-jonas-vingegaard\">Gallery: Jonas Vingegaard shows pure class on final mountain stage to all but secure 2022 Tour de France victory</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Men’s Tour de France 2023: Stage-by-stage preview and everything you need to know</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p><strong>Going back to riders and teams, do you have a favourite?</strong></p>\n\n\n\n<p>I like Geraint Thomas because I’m part Welsh and he’s just such a cool Welsh bastard. He’s great in the series, he’s got such a dry, brilliant sense of humour as well as being a killer cyclist. Wout van Aert is really appealing as he’s so damn good. With Jonas Vingegaard, you have to admire what he did, it was extraordinary. Even though he’s not actually in the series, Tadej Pogačar; even though he’s sort of in the background of the story… there’s something about him. He’s like a smiling assassin that doesn’t wander around being a nasty alpha male.</p>\n\n\n\n<p>Honestly, there are so many good characters and they’re also very different. I think there’s a preconception that cyclists are geeky lunatics. They clearly are lunatics but they’re all such different characters, which makes our job a little bit easier.’</p>\n\n\n\n<p><strong>How do you navigate such a key rival like Tadej Pogačar not being in the series first-hand?</strong></p>\n\n\n\n<p>Well, he’s always in the background anyway, he talks to some of our characters, he’s obviously in a lot of the stages that we feature. It’s not like he’s not in it at all, it’s just that he’s not a direct contributor. If we get a chance to do season two, hopefully, that will change.</p>\n\n\n\n<p><strong>Can we say season two is confirmed?</strong></p>\n\n\n\n<p>We’re getting closer. I mean, we have to be, the Tour de France starts pretty soon.</p>\n\n\n\n<p><strong>What has the response to the series been?</strong></p>\n\n\n\n<p>Amazing. I think the reviews have been incredible. I spoke to Netflix in France about it yesterday, they were delighted with the feedback. It’s fantastic. People who watch it seem to really like it and, importantly, they seem to watch all of it. It’s got very high completion rate, which is important to Netflix.</p>\n\n\n\n<p>A lot of cycling fans are watching and we want to get more non-cycling fans in as well. It’s doing very well internationally too, that’s great because you might think maybe it’s a French thing, but it’s playing really well around the world. It’s the beginning of a journey, we want to make it for many years to come and if we can help increase the profile of cycling, that’d be great.</p>\n\n\n\n<p><strong>Would there be any docuseries action on the women’s side of the sport?</strong></p>\n\n\n\n<p>I get asked this question a bit and I think there definitely is potential there. There are a lot of great stories to tell and I’m totally up for it. If this show locks in, then it’s inevitable that we will end up covering the Tour de France Femmes as well. It’s not in my power at the moment, sadly, to make it happen anytime imminent, but I can imagine it happening relatively quickly.</p>\n\n\n\n<p><strong>Finally, who do you want to win the 2023 Tour de France?</strong></p>\n\n\n\n<p>I can’t go on record and say that because it’ll mean that we won’t get access to any other teams! Honestly, I couldn’t. But there are a lot of riders coming back that will be interesting to watch like Julian Alaphilippe and Mathieu van der Poel. I just like all the smaller teams too, it’s great when a small team gets a stage win. Just fantastic.</p>\n\n\n\n<ul><li><strong>Read our <a href=\"https://www.cyclist.co.uk/in-depth/netflix-unchained-review\" target=\"_blank\"><em>Tour de France: Unchained</em> review</a></strong></li><li><strong>Prepare yourself for this year’s race with our<a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\" target=\"_blank\"> Tour de France stage-by-stage guide</a> </strong></li></ul>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/james-gay-rees-tour-de-france-unchained-interview\">‘I have really fallen for cycling’: James Gay-Rees, ‘Tour de France: Unchained’ producer Q&amp;A</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Robyn Davidson &#124; Editorial Assistant","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"3faeef0f3f913007ef07523faa14da7b90782c00b9009a5e6a0531d13113ce9a","category":"Cycling"}