{"title":"Comparitive Chloroplast Genomics of Nine Endangered Habenaria Species and Phylogenetic Relationship of Orchidaceae","link":"https://www.preprints.org/manuscript/202406.0585/v1","date":1718020316000,"content":"Habenaria, a member of Orchidaceae family is the cosmopolitan distributions, which has significant medicinal and ornamental values. Regardless of morphology and molecular data that have been studied in recent times, the phylogenetic relationship is still under debate. Here, we sequenced, assembled, and annotated the whole chloroplast (cp) genome of two species (Habenaria aitchisonii Rchb.f. and Habenaria tibetica Schltr.ex Limpricht) of Habenaria grown on the Qinghai-Tibetan Plateau (QTP), and combined with seven already published cp genomes which may assist to uncover their genomic profiling. The two genomes ranged from 155259-155269 bp in length and both encoded 132 genes, including 86 protein, 38 tRNA and 8 rRNA. In the cp genomes, the tandem repeats (797), SSRs (2195) and diverse loci (3214) were identified. Comparative analyses of codon usage, amino frequency, microsatellite, oligo repeats and transition and transversion substitutions showed similarities among the species. Moreover, we identified 16 highly polymorphic regions with nucleotide diversity above 0.02, which may be suitable for robust authentic barcoding and inferring in the phylogeny of Habenaria species. Among the polymorphic regions, positive selection was significantly exerted on the several genes such as cemA, petA, and ycf1. This may suggest that the important adaptation stratagem for two Habenaria species on the QTP. The phylogenetic relationship displayed that H.aitchisonii and H. tibetica have closer relationship than others and the rest seven species clustered in the other three groups. Our findings also supported the idea that Habenaria could be divided into different sections. This study enriched the genomics resources of Habenaria, which may be helpful for the conservation efforts of these endangered species.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3fb730015b7cb50482bd81c2e87f97d4b4a85384599d9d47ef70f4f3930a7dd1","category":"Interdisciplinary"}