{"title":"Feasibility of Wastewater‐based Public Health Monitoring Systems in Texas’ Small Rural Communities","link":"https://onlinelibrary.wiley.com/doi/10.1111/j.1936-704X.2024.3406.x?af=R","date":1719217197000,"content":"<h2>Abstract</h2>\n<p>In recent years, there has been much focus on the use of wastewater-based epidemiology (WBE) in urban centers, particularly for SARS-CoV-2 monitoring. However, less is known about the application of WBE in rural settings or in areas of limited resources. Most WBE programs in low-resource communities have occurred outside the United States. To reap the benefits, WBE would need to be tailored to better reflect the socioeconomic challenges, technical barriers, communication limitations, and variable wastewater infrastructures associated with rural communities. The objective of this review is to evaluate the potential opportunities and challenges of deploying the current SARS-CoV-2 monitoring methodologies in small, rural communities, with a particular focus on rural Texas. For this, we conducted an inventory of rural communities in the state of Texas and their wastewater infrastructure. Based on specific rural examples, we evaluated the potential of current WBE methodologies used in urban settings to monitor for emerging biological agents of concern such as SARS-CoV-2. Our findings include an overview of rural wastewater capacity across rural Texas, a look at current WBE efforts to detect SARS-CoV-2, and recommendations for future implementation in two cities in rural counties, Kerrville and Valentine. WBE is a rapidly evolving public health tool with several notable advantages associated with cost, access, and adaptability. It is of particular use in resource-limited communities that often exhibit healthcare disparities. This study presents the first overview of the feasibility of implementing WBE in the rural settings of Texas. We provide several recommendations and suggest alternatives that may be of use when planning an expansion of WBE into these areas.</p>","author":"Itza Mendoza‐Sanchez, \nDavida S. Smyth, \nMonica O. Mendez, \nTrish Pearl, \nHanadi Rifai, \nNathan Howell, \nErick Butler","siteTitle":"Wiley: Journal of Contemporary Water Research & Education: Table of Contents","siteHash":"b3db72dc581bb02a697df2c99e39cca4549085da8786047d814851ca018c4f9a","entryHash":"3fbb7b7f8262f5632defc7df9c26e00e041a25a4a86c12455716a05e41353b5a","category":"Environment"}