{"title":"Microbiota and Recurrent Pregnancy Loss (RPL); More than a Simple Connection","link":"https://www.preprints.org/manuscript/202407.0685/v1","date":1720496709000,"content":"Recurrent Pregnancy Loss (RPL) affects 1-2% of women, and its triggering factors are unclear. Several studies have shown the vaginal, endometrial, and gut microbiota may play a role in RPL. A decrease in the quantity of Lactobacillus crispatus in local microbiota has been associated with an increase in local (vaginal and endometrial) inflammatory response and immune cell activation that leads to pregnancy loss. The inflammatory response may be triggered by gram-negative bacteria, lipopolysaccharides (LPS), viral infections, mycosis, or atypia (tumor growth). Bacterial structures and metabolites produced by microbiota could be involved in immune cell modulation and may be responsible for immune cell activation and molecular mimicry. Gut microbiota metabolic products may increase the amount of circulating pro-inflammatory lymphocytes, which, in turn, will migrate into vaginal or endometrial tissues. Local proinflammatory Th1 and Th17 subpopulations along with a decrease in Treg and tolerogenic NK cells are accountable for the increase in pregnancy loss. Local microbiota may modulate the local inflammatory response increasing pregnancy success. Analyzing local and gut microbiota may be necessary to characterize some RPL patients. Although oral supplementation of probiotics has not been shown to modify vaginal or endometrial microbiota, the metabolites produced by it may benefit patients. Lactobacillus crispatus transplantation into the vagina may enhance the required immune tolerogenic response to achieve a normal pregnancy. The effect of hormone stimulation and progesterone to maintain early pregnancy on microbiota has not been adequately studied, and more research is needed in this area. Well-designed clinical trials are needed to ascertain the benefit of microbiota modulation in RPL.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3fc9ad9a26e7388695207e9bce23c4242a0f7f74bc50f1ff1a24326d9ddf96a9","category":"Interdisciplinary"}