{"title":"Google Photos เลิกให้พื้นที่ไม่จำกัดวันนี้ 1 มิ.ย. รวมเทคนิคประหยัดพื้นที่ให้พอใช้","link":"https://www.blognone.com/node/122945","date":1622515975000,"content":"<div><div><div><p>วันนี้ (1 มิถุนายน 2021) Google Photos เปลี่ยนแปลงนโยบายให้พื้นที่ฟรีไม่จำกัด ลดมาเหลือพื้นที่ฟรี 15GB <a href=\"https://www.blognone.com/node/119548\">ตามที่เคยประกาศไว้</a> โดยรูปเก่าก่อนวันที่ 1 มิถุนายน จะไม่ถูกนำมาคิดโควต้าพื้นที่แบบใหม่</p>\n<p>การลดปริมาณพื้นที่สตอเรจของกูเกิลมาเหลือ 15GB ยังเป็นการคิดพื้นที่ใช้งานนับรวมกับบริการอื่นของกูเกิลคือ Gmail และ Google Drive ด้วย (ซึ่งกูเกิลเรียกพื้นที่รวมนี้ว่า Google One) ทำให้ในทางปฏิบัติแล้วเราอาจมีพื้นที่ใช้งานน้อยกว่า 15GB อยู่พอสมควร</p>\n<p>บทความนี้จะแนะนำเทคนิคในการใช้งานพื้นที่ 15GB ให้ประหยัดคุ้มค่าที่สุด</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2f53ed6ff764e46e73157b0d496ac2be.png\" /></p>\n<h3>ลบรูปขนาดใหญ่ รูปเบลอ สกรีนช็อต</h3>\n<p>Google Photos มีเครื่องมือให้เราช่วยลบรูปหรือวิดีโอขนาดใหญ่ๆ ที่เปลืองพื้นที่เก็บ, รูปถ่ายที่เบลอ และภาพหน้าจอที่ถูกซิงก์ไว้ วิธีการสามารถใช้ได้จากหน้า <a href=\"https://photos.google.com/quotamanagement\">Manage storage ของ Google Photos</a> หรือถ้าจากในแอพ ให้เข้าเมนู Account storage ได้เช่นกัน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/0ae472c52e5249f2f2f10629d0e9cebf.png\" /></p>\n<h3>ลบไฟล์ขนาดใหญ่ใน Gmail &amp; Google Drive</h3>\n<p>นอกจากรูปภาพใน Google Photos แล้ว อีกวิธีการหนึ่งที่ช่วยได้คือลบอีเมลเก่าๆ หรือไฟล์ขนาดใหญ่ใน Google Drive โดยเข้าไปที่ <a href=\"https://one.google.com/storage/management\">หน้าจัดการ Storage ของ Google One</a> จะพบตัวเลือก 2 หมวดคือ</p>\n<ul>\n<li>Discarded items ของที่ลบทิ้งได้ เช่น อีเมลในถังขยะที่ยังไม่ถูกเท หรือ อีเมลสแปม ซึ่งกูเกิลจะทยอยลบให้เราเป็นปกติอยู่แล้ว (ช่วยไม่ได้มากนัก)</li>\n<li>Large items ไฟล์ขนาดใหญ่ ซึ่งมีทั้งจาก Gmail, Drive, Photos</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7a70b11ef6b35bf5b25f7cfa3a2ba489.png\" /></p>\n<p>ผมพบว่าส่วนที่เป็นไฟล์ขนาดใหญ่ของ Drive มักเป็นไฟล์ที่เราตั้งใจเก็บลงไดรฟ์อยู่แล้ว แต่อันที่มีประโยชน์มากคือ Gmail ที่สรุปเมลที่แนบไฟล์ขนาดใหญ่ๆ มาให้ (และเป็นเมลที่เรามักไม่ใช้งานแล้ว) การที่หน้า UI ปกติของ Gmail ไม่แสดงขนาดไฟล์แนบ ทำให้เราไม่รู้ว่าอีเมลขนาดใหญ่แค่ไหน การมีหน้ารวมรายการอีเมลพร้อมบอกขนาดไฟล์ จึงมีประโยชน์มากๆ ในแง่นี้ (แต่หน้าจอนี้ก็ออกแบบมาให้เลือกอีเมลจำนวนมากๆ ได้ยาก ต้องค่อยๆ ลบไป)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fc147cf172b64912aca60e3478ac011f.png\" /></p>\n<h3>เลือกเก็บภาพแบบ High Quality / Storage Saver</h3>\n<p>เรื่องนี้หลายคนอาจรู้กันอยู่แล้ว แต่ก็ขอโอกาสเขียนซ้ำเผื่อมีใครยังไม่รู้ Google Photos สามารถเลือกเก็บรูปภาพได้ 2 ขนาดคือ</p>\n<ul>\n<li>Original ไฟล์ภาพเดิมไม่บีบอัดเลย</li>\n<li>High Quality ไฟล์ภาพที่บีบอัดแล้วคุณภาพยังดีอยู่ (<a href=\"https://www.blognone.com/node/122842\">กำลังจะเปลี่ยนชื่อเป็น Storage Saver</a> เพื่อลดความสับสน)</li>\n</ul>\n<p>เดิมที การเลือกเก็บภาพแบบ High Quality ไม่คิดพื้นที่สตอเรจ แต่วันนี้ (1 มิ.ย.) เป็นต้นไป เริ่มคิดพื้นที่แล้ว เพื่อความชัวร์ก็ควรตรวจเช็คว่าเรายังเลือกแบบ High Quality อยู่ ไม่ใช่เลือกแบบ Original ที่จะทำให้พื้นที่เต็มเร็วกว่าเดิม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/5e98009972875658996b085ec6338289.png\" /></p>\n<h3>สุดท้าย ทำอะไรไม่ได้ก็ต้องยอมจ่าย</h3>\n<p>ในยุคที่พื้นที่ 15GB อาจไม่พอใช้แล้วในทางปฏิบัติ หากรูปเยอะ ประหยัดเท่าไรก็ไม่พอ, หาตัวเลือกพื้นที่เก็บข้อมูลที่มีฟีเจอร์แบบ Google Photos ไม่ได้, หรือหาได้แต่ไม่อยากยุ่งยากในการโอนถ่ายไฟล์ข้ามบริการไปมา</p>\n<p>สุดท้ายการยอมจ่ายเงินซื้อพื้นที่ Google One เพิ่มก็อาจเป็นทางเลือกที่ไม่แย่เกินไปนัก</p>\n<p>แพ็กเกจของ Google One เริ่มต้นที่ 100GB คิดเงิน 700 บาท/ปี น่าจะเพียงพอใช้สำหรับบุคคลทั่วๆ ไปแล้ว หรือถ้าต้องการพื้นที่เพิ่มอีกเท่าตัวเป็น 200GB แลกกับเพิ่มราคาอีกเล็กน้อยเป็น 990 บาท/ปี น่าจะยังเป็นตัวเลือกที่พอไหวกันอยู่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/746ee50b280f8e4ef7be15cfbceb1227.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-photos\">Google Photos</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/howto\">Howto</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"3fcae95354079add95b85061bc001d2fe76c454b6154ee36cc479d558be30b26","category":"Thai"}