{"title":"Let’s Talk About The Energym RE:GEN Smart Indoor Bike","link":"https://www.dcrainmaker.com/2021/07/lets-talk-about-the-energym-regen-smart-indoor-bike.html","date":1625504099000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/07/Section-2-w.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/07/Section-2-w_thumb.jpg\" /></a></p>\n<p>Floating across my virtual desk this morning is a crowd funded campaign for an indoor smart bike, <a href=\"https://www.indiegogo.com/projects/re-gen-get-rewarded-to-exercise-generate-power#/\">the Energym RE:GEN indoor bike</a>. Among its claim to fames is that you can charge your toothbrush with it. Also, it has a glowing light to indicate your current power and FTP.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/07/image-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-1.png\" /></a></p>\n<p>But let’s not get ahead of ourselves here.</p>\n<p>The campaign started about three weeks ago, and has surpassed their initial funding goal, though, that goal was put so low as to not be meaningful (which is common). In this case, it’s clear the point of the Indiegogo campaign is to get media/social media attention, something a normal product launch probably wouldn’t do. Any money raised are merely icing on top, unless of course things go so poorly as to be an embarrassment (also sometimes happens).</p>\n<p>In any event, let me be clear upfront: I don’t recommend buying this smart bike. Not because it’s inherently bad, but because my trust in crowd funded platforms continues to decline, and I just don’t see enough of the right terms and industry lingo in this crowd funding page to believe they know what they’re doing – even if their marketing is quite good. Mind you, you can also have companies with plenty of industry lingo and proper term usage screw things up too. Screwing up crowd funded campaigns does not discriminate between industry insiders or not.</p>\n<p>Still, there are some interesting things I figured a quick post on would be worthy. The unit is sorta akin to a blend of a <a href=\"https://www.dcrainmaker.com/2020/07/stages-bike-sb20-smart-bike-in-depth-review.html\">Stages SB20 Bike</a>, and that of a <a href=\"https://www.dcrainmaker.com/2021/02/peloton-bike-plus-in-depth-review.html\">Peloton Bike+,</a> in that it actually includes a digital resistance control system (whereas the original Peloton Bike doesn’t). That means it can control the resistance of the bike, according to their crowd funded page.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-2.png\" /></a></p>\n<p>In their specs, they claim +/- 5% power accuracy, up to 2,000w. For reference, most of the higher end smart bikes on the market have accuracy claims of +/- 1-2%. However, the Peloton Bike+ doesn’t actually make a claim, best I can tell – though, my testing finds it in that range. Whereas the original Peloton Bike floats in the +/- 5-8% range depending on a lot of factors.</p>\n<p>In any event, +/- 5% is a fairly big range for a $2,200 device that promotes Zwift compatibility (whereas less a concern for general fitness reasons). That power accuracy level is basically similar to $500 smart trainers on the market. But we don’t know if they’ll hit that accuracy level. As readers around here know, I’ve literally made a decade-long business out of demonstrating that even the best power meter companies in the world don’t often meet their accuracy claims.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-3.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-3.png\" /></a></p>\n<p>That said, unlike a Peloton Bike/Bike+, it appears to actually connect to Zwift using either ANT+ or Bluetooth Smart (or perhaps both). The details there are fuzzy – they never mention those protocol words anywhere.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-4.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-4.png\" /></a></p>\n<p>And in fact, the FAQ around this aspect gives me plenty of pause:</p>\n<blockquote><p>“Can the RE:GEN connect to Zwift?<br />\nYES! Using our smartphone app, you can connect your RE:GEN bike to Zwift.”</p></blockquote>\n<p>And by ‘plenty of pause’, I mean ‘Dear god…please no.’</p>\n<p>It sounds like they’re probably doing some sort of passthrough via their smartphone app, which won’t end well. We’ve seen this movie before. Anything relaying cycling data through a smartphone back out to another device for race-level speeds never ends well, either lag-wise or stability-wise. And while they do have a jazzy video showing Zwift and someone riding, it doesn’t appear to show both screen and rider in one frame doing a sprint or such for us to deduce lag/latency, or even a swag at accuracy.</p>\n<p></p>\n<p>But we need to back way up here. I’ve gotten <a href=\"https://www.dcrainmaker.com/2021/06/lachlan-mortons-tour-de-france-alt-tour-how-the-tracking-device-site-works.html\">far ahead of the pack people are gonna call me Lachan</a>.</p>\n<p>First, a picture of the bike atop my favorite Ikea rug (actually, it’s not Ikea, but we do have the same rug in our kids bedroom, it’s very soft and we like it a lot). However…Why exactly would you put a bike you’re going to pour buckets of sweat on a rug that’s going to soak it up like a sponge?</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-5.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-5.png\" /></a></p>\n<p>Nonetheless, destroyed rugs aside, as you can see, it’s got the large flywheel up front (exact weight is unspecified), as well as a tablet holder –<strong> but not an actual display</strong>. Looks like most generic spin bikes.</p>\n<p>Meanwhile, off the back, it’s got a spoiler or something. Presumably to assist with aerodynamics while going fast. Frankly, I don’t really understand what that large piece is. It doesn’t appear to serve any purpose, except perhaps to stash Christmas wrapping paper. I do get that there are only so many ways to make a spin bike look unique, but I’m not sure adding bulk is one of the best choices.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/energym-bike-studio-test.40.288.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/energym-bike-studio-test.40.288_thumb.png\" /></a></p>\n<p>The other unique aspect is actually up on the handlebars, the large black thingy with the neon green illuminated racing stripe. That’s the special removable battery. If you remember back to a few paragraphs ago, this things jam in life is that it’s recharging the environment, your body, and your toothbrush. It’s doing so that with that huge e-bike sized battery that sits awkwardly next to your chest while hunkered down doing intervals.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/Energym_Bike_AppScreen.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/07/Energym_Bike_AppScreen_thumb.jpg\" /></a></p>\n<p>While I’m not expert, I’d argue that’s where a water bottle should go. Or, a phone holder. Or, an <a href=\"https://www.dcrainmaker.com/2019/09/tacx-neo-bike-smart-in-depth-detailed-review.html#shifting-riding\">M&amp;M’s holder</a>. Or really, anything else. Nonetheless, let’s take a closer look at it.</p>\n<h3><span>All the Powers:</span></h3>\n<p>The specs of the battery are a bit conflicting. In one image it lists it as 6,000mAh, which is pretty small. The average <a href=\"https://www.amazon.com/s?k=battery+lipstick&amp;linkCode=ll2&amp;tag=dcr07-20&amp;linkId=765dd6d6ee8465bc8657c980b22a8197&amp;language=en_US&amp;ref_=as_li_ss_tl\">lipstick sized battery pack is usually 5,000mAh</a>, and many day-pack ones (like I use constantly) are <a href=\"https://www.amazon.com/Anker-Ultra-Compact-High-Speed-VoltageBoost-Technology/dp/B07QXV6N1B?dchild=1&amp;keywords=battery+bank&amp;qid=1625502429&amp;sr=8-4&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=08f890c5ebc1d7e237cdd7f2120d1ccf&amp;language=en_US&amp;ref_=as_li_ss_tl\">10,000-20,000mAh</a> (half the size of a paperback book, and costing $16).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-6.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-6.png\" /></a></p>\n<p>Simple math says most cell phones take about 2,500-3,000mAh of juice, so a 6,000mAh pack is basically 2 full charges. But this thing is FAR too large to only be 6,000mAh. An in fact, elsewhere in the specs they list 100 watt-hours, which generally would translate to about 26,000mAh. And that’d be about the proper size of a device like this, given the extra lighting on it, as well as the full-sized AC plugs for laptops or such.</p>\n<p>Ok, fine, we’ve got a generic sized battery bank that’s somehow the size of a torpedo. Normally, one I can also buy on Amazon for $15 (not the $200+ they list later in their campaign). Though this one does have 100w charging, which normally costs more. You don’t tend to see that in most <a href=\"https://www.amazon.com/Anker-Powerhouse-Portable-Charger-Delivery/dp/B08F53MW17?&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=233df60d298efed1f2b879f910b6af9d&amp;language=en_US&amp;ref_=as_li_ss_tl\">battery banks until a bit higher up</a>, and is useful for charging a laptop or such. But this doesn’t seem to have the capacity for that as spec’d.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/Battery-on-stand-2.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/07/Battery-on-stand-2_thumb.jpg\" /></a></p>\n<p>Still, there’s two things that stick out at me:</p>\n<p>A) Why on earth is it on the handlebars? Why not place it in that spoiler thing at the back? That’s a *FAR* better place for it. First, it it wouldn’t be awkwardly on the handlebars taking up real-estate, and second, it could then be even better. Plus, it’d give purpose to the spoiler.</p>\n<p>B) Why so small? Normally, companies limit their portable battery sizes to 100 watt hours, because of worldwide rules limiting their use on airplanes above that size. But in this case, nobody is taking that beast on a plane anyway. So, why bother keeping it so small? Go big! The <a href=\"https://www.amazon.com/Jackery-Portable-Power-Station-Generator/dp/B07D29QNMJ?dchild=1&amp;keywords=jackery+battery&amp;qid=1625502606&amp;sr=8-1-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyMERLQlAxS1BGRkRMJmVuY3J5cHRlZElkPUEwNjk2MDU0MlFRVTROWDlUNTlBVCZlbmNyeXB0ZWRBZElkPUEwMDU0NTExM0hDSFpHTTM4RTdUViZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=6a821fbef286b19bcc4f9b2826231f5f&amp;language=en_US&amp;ref_=as_li_ss_tl\">unit I use for shooting outdoors</a> sometimes, or road trips, is 240 watt hours. It’s about the size of a small shoebox. But of course, you could form that differently. Point being, that would be legit useful if, as they suggest, when your home loses power you can use it for power.</p>\n<p>And then finally, the most obvious question:</p>\n<p>C) With all this re-charging prowess, why not power the actual bike from it? It’d easily power this bike, since the bike doesn’t have a screen. In fact, there are numerous bikes that do that today already. We saw that with the Tacx Bike, which has the ability to self-power for most functions, and many other generic spin bikes too.</p>\n<p>And then more recently, the <a href=\"\\\">TrueKinetix TrueBike</a> actually not only self-power, but does re-charge the large internal battery, which in turn powers the full display system (and everything else).</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4406_thumb.jpg\" /></p>\n<p>In fact, going one step further, TrueKinetix plans to offer a connector accessory that’ll actually allow you to plug the bike back into the power system and feed electricity back into our home/grid. Obviously, the logistics of that are tricky depending on your country/home/etc, but here in the Netherlands, that’s apparently a simpler concept to execute upon (where both they, and I, are located).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-7.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-7.png\" /></a></p>\n<p>In any event, my entire point here is that I think the idea of a battery bank on the back of a bike isn’t a bad idea, it’s just not a terribly well executed idea in this case. Further, since we’re talking ‘being green’ as a main and repeatedly stated selling point of this product (even being the name of the product), I’d take a swag that the ecological footprint of this entire battery system might be questionable to begin with, especially compared to a cleaner energy source like solar or wind. But I’ll let that slide for the moment.</p>\n<h3><span>Sweatcoins – Not Bitcoins:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-8.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-8.png\" /></a></p>\n<p>The bike includes Sweatcoin integration. For those outside the UK, you’re probably like: ‘What da fuq is Sweatcoin?’</p>\n<p>Whereas this in the UK are likely in the know, or at least vaguely aware of it.</p>\n<p>Essentially, Sweatcoin is like frequently flyer miles for working out. Be it steps or pedaling, you get credit for doing healthy things. Those coins can in turn be redeemed for a variety of real-world things, including Paypal gift cards. And to it’s credit, the app has a pretty darn strong rating on the app store with 175,000 ratings at 4.5 stars. You can’t get that many ratings/stars being complete hot garbage:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-9.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-9.png\" /></a></p>\n<p>Now, I’m all for these types of integrations (when done properly). We continue to see the rise of employer-driven health and fitness rewards programs (over the past decade+), and this isn’t much different, except done at the bike level. I suppose there’s nothing stopping any other company (Wahoo/Garmin/etc) from doing this, except for the fact they’d have to pay money out for no good reason.</p>\n<p>Garmin/Wahoo/Stages/etc have users that are already working out on their own accord, without needing another carrot to drive/change their behavior. And while the internal details of how Sweatcoin works aren’t super clear, it sounds like some portion of the system works via B2B affiliate schemes. Basically, Sweatcoin drives interest to secondary platforms/apps/subscriptions/devices, and get a bit back from that.</p>\n<p>And that all ignores the pretty heavy advertiser/marketing tracking push that they appear to be collecting and sharing, basically, if you check on ‘See details’, almost every option has the answer of ‘Yes, they’re doing that’.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-10.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-10.png\" /></a></p>\n<p>Now mind you, I presume you can use the RE:GEN bike without Sweatcoin, it’s just that they’ve spent development time integrating it, and marketing time promoting it, so thus, I poked into it. I mean, poked enough to try to understand it, without poking too far and getting dirty.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-11.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-11.png\" /></a></p>\n<p>Finally, it’s worth mentioning price – as that’s where things get a bit funk. The company, Energym, is based in the UK, so things are clearly slanted that way pricing-wise, though, they offer pricing in in USD/EUR/GBP. And at first glance, things are good here – at least for UK folks. That is the base price they’ve got for the early birds, and there are some (err…basically all) of those available at 1,699GBP. And yes, that is the rough correct conversion to USD.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-12.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-12.png\" /></a></p>\n<p>But that’s not the correct cost for the Peloton Bike+. That price is $2,495, not $3,320. That’s because Energym incorrectly did conversion from the UK price to USD, rather than just looking up the correct USD price. Sure, you could get local state taxes, but not every state has that, and even then, it doesn’t add anywhere near that much. However, one would have to seriously debate why exactly you’d compare it to the Peloton Bike+ versus the base Pelton (at $1,899), since RE:GEN doesn’t include *ANY* display, which is included on all Peloton Bikes. Just as it is on the NordicTrack S22i.</p>\n<p>And again, if we compared the price of the NordicTrack S22i in the US, the actual price is $1,999, not $2,814. Their monthly subscription fees are sorta correct, because the S22i includes the first year free – so that’s some $400 less there.</p>\n<p>All of which ignores the fact that RE:GEN doesn’t appear to actually even have a service yet (instructors/studio/etc…) – yet, charges a fee for it. Despite the fact that the entire campaign page fails to show even once, the training app open. They only mention (once) that it somehow exists:</p>\n<blockquote><p>“…tap into the Energym app where you can track your workouts and access<strong> virtual classes, personalised workouts, and the online rider community”</strong></p></blockquote>\n<p>But again, no pictures or imagery from it. Though, toothbrushes.</p>\n<p>Shipping and import-fees wise, things could get dicey too. For UK buyers, they don’t actually appear to clarify anywhere if UK folks will get dinged on import charges, which would be substantial. Just as they would be for the EU – some 19% or so for me in Europe. Shipping-wise, everyone has to pay what are basically the freight charges, and pretty similar to what competitors charge (if slightly less).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-13.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-13.png\" /></a></p>\n<p>So, here’s the thing: I wouldn’t be opposed to a sub-$2,000USD indoor smart bike that was +/-5% accuracy with controllable resistance. Though, I’d say +/- 3% would be the realistic sweet spot. There’s clearly quite a market for such a device. One only need to look at the feedback for people trying to figure out how to use regular $1,895 Peloton bikes with Zwift, or the plethora of peoples comments after the initial Wattbike ATOM launched at roughly that pricing before shifting prices for USD launch. There’s huge demand there, and if someone can tap into that I suspect they’ll have a nice revenue stream.</p>\n<p>And invariably, we’ll likely see it. As much as a company like Zwift would enjoy selling Wahoo KICKR Bike priced $3,500 bikes/hardware, they only need to look at Peloton’s sales numbers (give or take 300,000 bikes a quarter) to see the real money is in lower priced bikes. And as is the case for Peloton, the subscription revenue is what Zwift is most interested in long-term, not the hardware.</p>\n<p>As for the RE:GEN bike, no, I won’t be buying it. But, I do think the battery bits are mildly interesting, at least if reconfigured in a way that was more beneficial to end users, and if they could pull down the prices to something more realistic for a unit without a display.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"3fcd8ed9fa4d2b31012b5bcd9411dce9f27fabdd246b4a6c8e88633892ead243","category":"Cycling"}