{"title":"That time Catherine the Great championed smallpox vaccinations","link":"https://arstechnica.com/?p=1821789","date":1639942171000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/cath4CROP2-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/cath4CROP2.jpg\">Enlarge</a> <span>/</span> Portrait of Catherine the Great. Her 1787 letter to Count Piotr Aleksandrovich Rumiantsev—now up for auction—called for a national vaccination campaign against smallpox. (credit: <a href=\"https://commons.wikimedia.org/wiki/File:Catherine_II_by_Alexey_Antropov_(18th_c,_Tver_gallery).jpg\">Public domain</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>During her long reign, <a href=\"https://en.wikipedia.org/wiki/Catherine_the_Great\">Catherine the Great</a>'s leadership transformed Russia into a powerhouse of Europe. She was also a leader in public health policy, championing a nation-wide vaccination campaign against smallpox at a time when many viewed the practice with distrust. A letter by the Empress outlining her inoculation strategy is <a href=\"https://macdougallauction.com/en/catalogue/view?id=14663\">up for auction</a> by MacDougall's in London. Included in the sale is a portrait of the monarch as the “Lawgiver in the Temple of Justice,” painted by<a href=\"https://en.wikipedia.org/wiki/Dmitry_Levitzky\"> Dmitri Levitsky</a>, who was a favorite of the Russian court in the 1770s and 1780s. The two items are expected to sell for as much as $1.6 million.</p>\n<p>As we've <a href=\"https://arstechnica.com/science/2020/07/scientists-traced-origin-of-smallpox-vaccine-strains-used-during-civil-war/\">reported previously</a>, the World Health Organization declared <a href=\"https://en.wikipedia.org/wiki/Smallpox\">smallpox</a> to be an eradicated disease in 1979, and many people don't remember just how devastating it could be. It began with a high fever and severe vomiting, followed by a skin rash. The victim would next develop sores, which eventually scabbed over and fell off, scarring the skin. About <a href=\"https://www.cdc.gov/smallpox/history/history.html\">three in ten of</a> those infected died, and the survivors were typically badly scarred for life, sometimes even blinded or permanently disabled. </p>\n<p>The Chinese were inoculating people against smallpox as early as the 1500s. European physicians in the early 18th century relied upon variolation (the use of smallpox to induce immunity) to control the spread of smallpox, in which scrapings from smallpox pustules were scratched into a person's arm or inhaled through the nose. While those who received the treatment did go on to develop common smallpox symptoms like fever and rash, the death toll was significantly lower.</p></div><p><a href=\"https://arstechnica.com/?p=1821789#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1821789&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3fcfad12f16809cdc078bf6e16c676a6bcfaa6ee9136e9a462e2ab89888b3390","category":"Tech"}