{"title":"Barriers to the Implementation of Building Information Modeling (BIM) in Late-Adopting Countries in the European Union: The Case of Portugal","link":"https://www.preprints.org/manuscript/202403.1301/v1","date":1711090192000,"content":"Adopting Building Information Modeling (BIM) within the Architecture, Engineering, and Construction (AEC) industry presents an opportunity to address enduring challenges, including chronic productivity deficits and emerging imperatives such as cleaner production and sustainability. However, the pace of BIM implementation (BIMI) across European Union (EU) countries is uneven due to varying contexts and the inherent complexity of BIM adoption. Notably, Portugal lags in BIMI among these countries. Using the Portuguese context, the manuscript endeavours to identify the main barriers to BIMI by the late-adopting countries in the EU and, based on the dynamics of their relationships, design effective mitigation measures to lessen their impact and eventually leverage BIMI. A comprehensive list of barriers was compiled from the literature and ranked by experts through a Delphi survey, resulting in 15 critical barriers. Subsequently, an Interpretive Structural Modelling (ISM) model was constructed to elucidate the hierarchical relationships among these barriers, while a fuzzy Impact Matrix Cross-Reference Multiplication Applied to a Classification (MICMAC) analysis was employed to determine their driving and dependence powers. The resulting main barriers were the lack of evaluation and feedback mechanisms on BIMI, ignorance of BIM capabilities/benefits, scarcity of BIM-capable professionals, lack of experience and cooperation in BIMI, resistance to change, and lack of support from top management. Finally, experts formulated mitigation measures aimed at tackling these main barriers. These measures were designed to not only address each barrier individually but also to have a comprehensive and practical impact on the entire barrier system as a whole. These findings will assist researchers, policymakers, and practitioners in comprehending the barriers and hierarchical structures affecting BIMI in EU late-adopting countries.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3fda6b129fcc5cd7effd206cc969cc0a88708036e07203d0a6d5cfa0315632fc","category":"Interdisciplinary"}