{"title":"CNN: ‘FAA Keeps Boeing’s 737 Max 9 Grounded as It Reviews Inspections and Data’","link":"https://www.cnn.com/2024/01/12/business/boeing-faa-manufacturing-oversight/index.html","date":1705190990000,"content":"\n<p>Pete Muntean, reporting for CNN:</p>\n\n<blockquote>\n  <p>The Federal Aviation Administration said on Friday that after \nreviewing Boeing’s instructions for inspecting grounded 737 Max 9 \nplanes, it has decided to seek more information before allowing \nthe plan to proceed. In a statement, FAA also said it would keep \nthe Boeing 737 Max 9 “grounded until extensive inspection and \nmaintenance is conducted and data from inspections is reviewed.” </p>\n\n<p>The announcement comes exactly one week after the dramatic \nin-flight incident on Alaska Airlines flight 1282, when a part \ncalled a door plug was blown off the side of the plane. [...] 171 \nof the planes remain grounded in the United States as airlines \nAlaska and United await updated emergency inspection guidance from \nthe FAA. </p>\n</blockquote>\n\n<p><a href=\"https://www.faa.gov/newsroom/faa-increasing-oversight-boeing-production-and-manufacturing\">The FAA, yesterday</a>:</p>\n\n<blockquote>\n  <p>After taking decisive and immediate action to ground approximately \n171 Boeing 737-9 MAX planes, the Federal Aviation Administration \n(FAA) today announced new and significant actions to immediately \nincrease its oversight of Boeing production and manufacturing. \nThese actions come one day after the FAA formally notified Boeing \nthat the FAA has launched an investigation into the company as a \nresult of last Friday’s incident on a Boeing Model 737-9 MAX in \nwhich the aircraft lost a passenger door plug while in flight. </p>\n</blockquote>\n\n<p>Something has gone deeply wrong at Boeing, a once-great company. This is exactly the sort of situation where government regulators are needed: for issues pertaining to safety.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/13/faa-keeps-737-maxes-grounded\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"3fe6844311a57a0b6f44764509abc190105592d144fc2bd893638a35753a9d94","category":"Tech"}