{"title":"Study: Glow-in-the-dark worms may shed light on the secrets of regeneration","link":"https://arstechnica.com/?p=1810988","date":1636387239000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/glowwormTOP-800x530.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/glowwormTOP.jpg\">Enlarge</a> <span>/</span> A whole three-banded panther worm from the muscle transgenic line, where the muscle cells are glowing green. (credit: Lorenzo Ricci)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In 1961, Osamu Shimomura and Frank Johnson isolated a protein from jellyfish that <a href=\"https://www.conncoll.edu/ccacad/zimmer/GFP-ww/GFP-1.htm\">glow green</a> under UV light. Corals, too, can fluoresce in a wide range of hues, thanks to similar proteins. Now, scientists at Harvard University have genetically modified the three-banded panther worm to enable the creature to emit a similar green glow, according to a new paper published in the journal Developmental Cell. Their hope is to uncover the secrets to regeneration.</p>\n<p>Most animals exhibit some form of regeneration: regrowing hair, for instance, or knitting a fractured bone back together by growing new skin. But some creatures are capable of particularly amazing regenerative feats, and studying the mechanisms by which they accomplish this could have important implications for human aging. If a salamander loses a leg, the limb will grow back, for example, while some geckos can detach their tails as a distraction to evade predators and then regrow them later. The zebrafish can regrow a lost or damaged fin, as well as repair a damaged heart, retina, pancreas, brain, or spinal cord. Cut a planarian flatworm, a jellyfish, or a sea anemone in half, and it will regenerate its entire body.</p>\n<p>And then there is the three-banded panther worm (<em>Hofstenia miamia</em>), a tiny creature that looks a bit like a plump grain of rice, so named because of its trademark trio of cream-colored stripes across its body. If a panther worm is cut into three parts, each part will generate into a fully formed worm within eight weeks or so. These worms are found primarily in the Caribbean, Bahamas, and Bermuda, as well as Japan, and they are voracious predators, not above taking a few bites out of their fellow panther worms if they're hungry enough and can't find other prey. And they offer a promising new model for studying the mechanics of regeneration.</p></div><p><a href=\"https://arstechnica.com/?p=1810988#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1810988&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3feb232e9842d2b78eecb8ee2b7c7f8d606639f89b88a3d2a3661c4e4f04b3aa","category":"Tech"}