{"title":"Associations among Beliefs Supporting Patriarchal Principles, Conflict Avoidance, and Economic Violence in Intimate Partner Relationships of Ultraorthodox Jews","link":"https://www.preprints.org/manuscript/202409.0707/v1","date":1725948034000,"content":"Beliefs that maintain patriarchal principles may affect individuals’ willingness to avoid conflicts in their intimate partner relationships and eventually are likely to affect chances of intimate partner economic violence. Nonetheless, research has yet to fully explore these associations. This study used a sample of 321 adults in the ultra-Orthodox Jewish community—a patriarchal and traditional culture—to examine associations in beliefs supporting patriarchal principles at the micro (gendered domestic roles), meso, and macro ( institutional power of men and inherent inferiority of women) levels; conflict avoidance and economic violence; and sex differences in these factors. Descriptive statistics were used to explore gender differences in research variables, and path analysis examined the correlations between research variables for men and women. Beliefs in patriarchal ideologies were moderate at all levels, although slightly higher among men. Men tended to avoid conflict with their intimate partner significantly more than women did. Beliefs in support of patriarchal ideologies predicted conflict avoidance, especially among women. Finally, in opposition to prior research findings, this study revealed nonsignificant sex differences in the prevalence of economic violence victimization. These findings, however, do not suggest that economic violence victimization is not rooted in sex issues. We discuss the findings and the meanings assigned to conflict avoidance by men and women while considering gender disparities of power and control. We suggest that the contribution of men’s tendency to avoid conflict likely moderated their chances to perpetrate economic violence.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"3ff96c37f6cbd78f8ddb4d49f5c30fa46803e1540318cd00c662541c9188bb01","category":"Interdisciplinary"}