{"title":"Differences in urine creatinine and osmolality between black and white Americans after accounting for age, moisture intake, urine volume, and socioeconomic status","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304803","date":1717164000000,"content":"<p>by Patrick B. Wilson, Ian P. Winter, Josie Burdin</p>\r\n\r\nUrine osmolality is used throughout research to determine hydration levels. Prior studies have found black individuals to have elevated urine creatinine and osmolality, but it remains unclear which factors explain these findings. This cross-sectional, observational study sought to understand the relationship of self-reported race to urine creatinine and urine osmolality after accounting for age, socioeconomic status, and fluid intake. Data from 1,386 participants of the 2009–2012 National Health and Nutrition Examination Survey were utilized. Age, poverty-to-income ratio (PIR), urine flow rate (UFR), fluid intake, estimated lean body mass (LBM), urine creatinine, and urine osmolality were measured. In a sex-specific manner, black and white participants were matched on age, dietary moisture, UFR, and PIR. Urine creatinine was greater in black men (171 mg/dL) than white men (150 mg/dL) and greater in black women (147 mg/dL) than white women (108 mg/dL) (p &lt; .001). Similarly, urine osmolality was greater in black women than white women (723 vs. 656 mOsm/kg, p = .001), but no difference was observed between white and black men (737 vs. 731 mOsm/kg, p = .417). Estimated LBM was greater in black men (61.8 kg) and women (45.5 kg) than in white men (58.9 kg) and women (42.2 kg) (p≤.001). The strongest correlate of urine osmolality in all race-sex groups was urine creatinine (Spearman ρ = .68-.75). These results affirm that individuals identifying as black produce higher urine creatinine concentrations and, in women, higher urine osmolality after matching for age, fluid intake, and socioeconomic status. The findings suggest caution when comparing urine hydration markers between racial groups.","author":"Patrick B. Wilson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4004f2fd48515ce7178cfb5f2d4bdf595ed8c2391cc8c2b726cd5b5fa698cace","category":"Interdisciplinary"}