{"title":"Apple’s next chips could have 40 cores and mind-blowing speeds","link":"https://www.macworld.com/article/550277/apple-silicon-m2-m3-mac-pro-cores.html","date":1636130226000,"content":"<div>\n<section><div></div></section><p>The M1 Pro and M1 Max might still have that new-chip smell, but that’s not stopping Apple from moving ahead with the next generation of its desktop processors. And according to a new report by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theinformation.com/articles/apples-road-map-for-mac-chips-shows-likely-advantage-over-intel&amp;xcust=1-1-550277-1-0-0&amp;sref=https://www.macworld.com/feed\">The Information</a>, the future is incredibly bright for Apple silicon.</p>\n\n\n\n<p>Apple makes its current chips in partnership with TSMC, with the M1 series being based on a 5nm process with a single die. The next generation of chips—presumably the M2, M2 Pro, and M2 Max—will use an enhanced 5nm process, according to The Information. That likely refers to TSMC’s N4P node, which represents a small six percent die shrink and a 10 percent performance boost over the current node, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.gizmochina.com/2021/10/27/tsmc-n4p-process-node-announced/&amp;xcust=1-1-550277-1-0-0&amp;sref=https://www.macworld.com/feed\">according to reports</a>.</p>\n\n\n\n<p>However, there’s more to the story. The Information’s report also states that the next-gen chips will have two dies, resulting in more cores than the M1 series. TSMC has started trial production of these chips, which should be the M2 Pro and M2 Max Macs coming in late 2022 or 2023.</p>\n\n\n\n<p>The changes get more interesting with the third generation of Apple silicon. According to The Information, the chips are code-named Ibiza, Lobos, and Palma, and Apple and TSMC plan to implement a 3nm process with up to four dies and 40 CPU cores. That would represent a massive leap over even the M1 Pro, which has 10 CPU cores on a single die.</p>\n\n\n\n<p>The Information says that production on these chips won’t start until 2023, which probably means its introduction into Apple’s product lineup will go into 2024. Lobos and Palma may make their debut in pro Macs such as the second-generation 14- and 16-inch MacBook Pros, with a lower-end chip (Ibiza) likely ending up in the MacBook Air and iPad Pro.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/Alder_Lake_CPUs.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>While Apple makes plans to move to a 3nm process, Intel just released its first 10nm desktop chip.</p></figcaption></figure><p>Gordon Mah Ung</p></div>\n\n\n\n<p>The M1 series still has plenty of life in it. The report states that a twin-die M1 Max is planning to be used as the first Apple processor in the company’s high-end Mac Pro. According to separate <a href=\"https://www.macworld.com/article/347010/2022-mac-pro-design-apple-intel-silicon-processor-design-ram-graphics-storage-pro-display-price-release.html\">reports</a>, the new Mac Pro could feature a design that’s smaller than the current one, with the higher-end Mac Pro sticking with the latest Intel processors. Intel this week just revealed its new 10nm <a href=\"https://www.pcworld.com/article/549611/intel-core-i5-12600k-review.html\">Alder Lake desktop CPUs</a>, though there have been no reports on whether this chip will make its way into (or can even be used in) a Mac Pro, which currently uses Intel’s higher-end Xeon chips.</p>\n\n\n\n<p>For reference, the current <a href=\"https://www.macworld.com/article/234823/apple-m1-chip-specs-performance-features-power-efficiency.html\">M1</a> has eight CPU cores, seven or eight GPU cores, and a 16-core Neural Engine. The <a href=\"https://www.macworld.com/article/545435/intel-m1-pro-m1-max-cpu-gpu-performance.html\">M1 Pro and M1 Max</a> double the number of CPU and GPU cores, with the Max’s GPU cores jumping to up to 32 cores. The Pro and Max also switch up their CPU core allocation, reducing the number of efficiency cores to two, while the rest of the CPU cores are performance cores. The Information’s report doesn’t say how many cores would be delegated for performance in the next-generation chips.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4005e796e472add2ddbdb3c695993cf1828b5b8a88de41c325cc8dcfc3283d04","category":"Apple"}