{"title":"Urine metabolomic profiles of autism and autistic traits–A twin study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308224","date":1725372000000,"content":"<p>by Abishek Arora, Francesca Mastropasqua, Sven Bölte, Kristiina Tammimies</p>\r\n\r\nCurrently, there are no reliable biomarkers for autism diagnosis. The heterogeneity of autism and several co-occurring conditions are key challenges to establishing these. Here, we used untargeted mass spectrometry-based urine metabolomics to investigate metabolic differences for autism diagnosis and autistic traits in a well-characterized twin cohort (N = 105). We identified 208 metabolites in the urine samples of the twins. No clear, significant metabolic drivers for autism diagnosis were detected when controlling for other neurodevelopmental conditions. However, we identified nominally significant changes for several metabolites. For instance, phenylpyruvate (p = 0.019) and taurine (p = 0.032) were elevated in the autism group, while carnitine (p = 0.047) was reduced. We furthermore accounted for the shared factors, such as genetics within the twin pairs, and report additional metabolite differences. Based on the nominally significant metabolites for autism diagnosis, the arginine and proline metabolism pathway (p = 0.024) was enriched. We also investigated the association between quantitative autistic traits, as measured by the Social Responsiveness Scale 2nd Edition, and metabolite differences, identifying a greater number of nominally significant metabolites and pathways. A significant positive association between indole-3-acetate and autistic traits was observed within the twin pairs (adjusted p = 0.031). The utility of urine biomarkers in autism, therefore, remains unclear, with mixed findings from different study populations.","author":"Abishek Arora","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4008b21b1fe8635a9c572367a80ccfe035e37fcc52e311b86be48a3c20466db5","category":"Interdisciplinary"}