{"title":"Intel slipped—and its future now depends on making everyone else’s chips","link":"https://arstechnica.com/?p=1803366","date":1634745635000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/intel-manufacturering-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/intel-manufacturering.jpg\">Enlarge</a> (credit: Getty Images | Aurich Lawson)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Last month, Intel CEO Pat Gelsinger stepped to a podium on a hazy, wind-whipped day just outside Phoenix. “Isn’t this awesome!” Gelsinger exclaimed, gesturing over his shoulder. Behind him, two large pieces of construction equipment posed theatrically atop the ocher Arizona soil, framing an organized tangle of pipes, steel, and fencing at the company’s Ocotillo campus. “If this doesn’t get you excited, check your pulse,” he said with a chuckle. A handful of executives and government officials applauded at the appropriate points.</p>\n<p>Despite the gathering dust storm, Gelsinger genuinely seemed to enjoy himself. He was in Arizona to announce not one but two new fabs that, when finished, will form a $20 billion bet that Intel can return to the leading edge of semiconductor manufacturing, one of the world's most profitable, challenging, and cutthroat businesses.</p>\n<p>“Semiconductors are a hot topic these days,” Gelsinger continued. “What aspect of your life is not being increasingly driven by digital transformation? If there was any question on that, COVID eliminated it.”</p></div><p><a href=\"https://arstechnica.com/?p=1803366#p3\">Read 52 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1803366&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"400d5965603255299b05d159600c10a46cf1ce09a8db50350d33e349fa5a1af6","category":"Tech"}