{"title":"Porsche’s third-gen Panamera plug-in hybrid pairs V8 with a big battery","link":"https://arstechnica.com/?p=1986109","date":1700829046000,"content":"<div><figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/2024-Porsche-Panamera-Turbo-E-Hybrid-preview-1-800x600.jpg\" alt=\"A third-gen Porsche Panamera seen from the front 3/4s in a studio\" />\n<p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/2024-Porsche-Panamera-Turbo-E-Hybrid-preview-1-scaled.jpg\">Enlarge</a> <span>/</span> The new Panamera design features raised wings over the hood and new nose section with central air intake. The Turbo E-Hybrid gets some visual differentiation with air blades, a different Porsche crest, and side window trims. (credit: Jonathan Gitlin)</p>\n</figure>\n<div><a name=\"page-1\"></a></div>\n<aside>Porsche provided flights from Washington to Leipzig and accommodation so we could visit the Porsche factory and try out the new Panamera. Ars does not accept paid editorial content.</aside>\n<p>LEIPZIG, Germany—Although it feels like we recently tested the facelifted Porsche Panamera plug-in hybrid, <a href=\"https://arstechnica.com/cars/2020/09/porsche-boosts-battery-capacity-by-20-percent-for-2021-panamera-hybrid/\">it turns out that was more than three years ago</a>. This means there's a new model due in 2024, and Porsche has given Ars a sneak peek at its next sedan as well as the factory that builds them, plus a little time behind the wheel. There's quite a lot to look forward to about the new Panamera, including a more powerful plug-in powertrain and much sharper handling.</p>\n<p>Next spring will see the debut of a pair of V6-powered third-gen Panameras, but we're more interested in the other model that will show up a little later in 2024. It's called the Turbo E-Hybrid, and it pairs a 4.0 L twin-turbocharged V8 engine with a more powerful 187 hp (140 kW) electric motor for a combined output of 670 hp (500 kW) and 685 lb-ft (930 Nm).</p>\n<p>That makes it a tiny bit less powerful but a lot more torque-y than <a href=\"https://arstechnica.com/cars/2019/04/the-porsche-panamera-turbo-sport-turismo-to-hybrid-or-not-to-hybrid/\">the outgoing Panamera Turbo S E-Hybrid we tested in 2019</a>. We expect an even more powerful third-gen Turbo S E-Hybrid will probably appear in due time, as well as less expensive, less powerful versions like the <a href=\"https://arstechnica.com/cars/2018/05/porsches-panamera-4-e-hybrid-sport-turismo-is-a-heck-of-a-hybrid/\">Panamera 4 E-Hybrid</a> too, but for now, all Porsche is saying is that it plans to offer four different E-Hybrid powertrain options given the demand for plug-in Panamera's.</p></div><p><a href=\"https://arstechnica.com/?p=1986109#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986109&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4014d26b5a0d1a449421ec5d125ad66669bbbd616ccc8cedb451b29d12e917ac","category":"Tech"}