{"title":"The temporal distribution of ridership in metro stations from land-use perspective","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308759","date":1725372000000,"content":"<p>by Shian Dai, Liqiang Yu, Lang Song, Ying Li, Xuze Fan</p>\r\n\r\nA reasonable land use development around subway stations can balance the utilization rates of the subway system during peak and off-peak hours, thereby enhancing its service levels and operational efficiency. Analyzing the temporal distribution patterns of passenger flow and their influencing factors is crucial for determining the optimum ratio of each land use type surrounding metro stations. Thus, this paper employs principal component analysis (PCA) at first to investigate the temporal distribution of metro ridership, and identify their main patterns and factor loadings. Then, using geographically weighted regression, the study examines the spatial dependencies between the main component proportions and influencing factors, focusing on Xi’an subway stations. The results indicate that the temporal distribution of passenger flow can be decomposed into three principal components: the first representing commuting characteristics, and the second and third representing regulating functions. The overall distribution is a composite of these components in varying proportions. Residential and educational land uses primarily drive morning and evening peak flows, with residential land use in the city center and peripheral areas having a more pronounced effect compared to transitional areas. Conversely, commercial &amp; office, healthcare, and recreational &amp; park land mitigate peak flows and increase off-peak flows. External hub enhances passenger flow throughout the day, while industrial land use has negligible impact.","author":"Shian Dai","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"401cec528477995f454e84d3df67f93de17595e369e604cc9e96df808ee4e975","category":"Interdisciplinary"}