{"title":"Monterey’s new features only show how much macOS still lags behind iOS","link":"https://www.macworld.com/article/548213/macos-monterey-ios-15-sharing-widgetsshortcuts.html","date":1635760800000,"content":"<div>\n<section><div></div></section><p>With the release of macOS Monterey, Apple’s oldest platform is embarking upon its latest journey around the sun. And while this newest update brings with it a whole host of features, from Focus mode to FaceTime improvements, it also puts into stark relief some of the Mac’s shortcomings—especially when compared to iOS.</p>\n\n\n\n<p>Apple’s been working hard to get its platforms in sync and, to the company’s credit, many of the new features that it rolled out this year have arrived on both platforms—even if not in simultaneous releases. (SharePlay and redesigned Memories in Photos are lacking from the initial Monterey release, despite already coming out for iOS.)</p>\n\n\n\n<p>While attention often focuses on places where iOS is still catching up to the Mac, that street runs both ways. There remain places where iOS offers features that the Mac doesn’t; even some features that have been around for a while now. And though the Mac might be nearing 40 years old, that doesn’t mean it can’t still learn some new tricks.</p>\n\n\n\n<h2>A fair Share</h2>\n\n\n\n<p>When Apple first added the Share sheet in iOS, it was a fairly limited feature, but in the last several years, it’s ended up becoming a critical piece of infrastructure on Apple’s mobile operating system, allowing you to not only share data with others, but also between apps, and even via Shortcuts.</p>\n\n\n\n<p>On the Mac, by comparison, the Share sheet is…sort of present? It doesn’t exist in most apps, and where it does—such as Safari—its features are mainly limited to sending links to other apps on the system. To be fair, there have long been other easy ways of moving data around on the Mac, and the Share menu was originally iOS’s way of handling all those inter-app communication options that its sandbox model didn’t permit.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/macos-monterey-sharetime.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>SharePlay wasn’t available in the initial macOS Monterey but it is in the latest beta. </figcaption></figure><p>Apple</p></div>\n\n\n\n<p>But the Share menu has ended up growing and becoming increasingly useful on iOS, in part because it acts as a central clearinghouse for sharing data that’s quickly and universally comprehensible. There isn’t really any single analogue to that on the Mac, and while Apple doesn’t have to get rid of all the tools that are already on the platform, it would be handy if it could beef up the version of the Share sheet in macOS to add features more akin to iOS—such as the ability to run Shortcuts.</p>\n\n\n\n<h2>Don’t be a widget</h2>\n\n\n\n<p>iPadOS 15 brought widgets to the Home screen of Apple’s tablet line, echoing a move made on the iPhone in iOS 14. But on the Mac, widgets remain banished to column just offscreen, as part of (peculiarly enough) Notification Center—where they are all too often forgotten.</p>\n\n\n\n<p>This isn’t the Mac’s first flirtation with widgets, of course. For a long time, the Mac hosted widgets in a separate screen layer called Dashboard, which would appear to one side of (or later overtop) the desktop. But Dashboard eventually went the way of the iPod classic, disappearing for good a few years ago.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ipados-15-widgets.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Widgets on macOS can’t be placed on the desktop like they can on iPadOS.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>With widgets seeing a resurgence on Apple’s mobile platforms, now’s the time to move them front and center on the Mac: let them finally appear on the desktop, where people might actually get some use out of them. Having data in your Mac’s menu bar is nice, but if the new MacBook Pro has shown us anything, it’s that menu bar space is at a premium—and it’s hardly a good home for the kind of rich experiences you can get with a widget.</p>\n\n\n\n<p>This seems a strange place for the Mac, which has a ton of power and space at its disposal, to skimp. It’s not hard to imagine having weather, or photo, or shortcut widgets sitting on our Mac desktops—the bigger question is why aren’t they already?</p>\n\n\n\n<h2>The unkindest Shortcuts</h2>\n\n\n\n<p>Monterey sees the Mac debut of Shortcuts, which has existed on iOS for several years now. While this is a welcome addition to macOS, which has its own long-running (if somewhat outdated) automation tools like AppleScript and Automator, the Mac version of Shortcuts is still missing out on some features to make it, well, Mac-like.</p>\n\n\n\n<p>Even basic features, like being able to easily grab selected text on screen, or get the name of an open document, can involve cumbersome workarounds like falling back to AppleScript. And some Mac features, like the ability to easily create or switch to different desktop spaces, have never been available in any automation tool.</p>\n\n\n\n<p>Some of this is unsurprising, given that the Mac version of Shortcuts has been ported over from iOS and is still adapting to its new life on Apple’s oldest platform. But given the Mac’s long history of automation, it does sometimes feel like more attention is lavished on the new kid on the block. That said, Apple has publicly acknowledged that Shortcuts is just the beginning of a multi-year automation story on the platform, so there’s good reason to hope that the Mac will catch up to its little siblings—at least in this department.</p>\n</div>","author":"Dan Moren","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"401fc419e91d2790a5d75d377eb89d2ca2d720f1ae6b7b0fbf06c4728ddfc82a","category":"Apple"}