{"title":"The Cyclists' Alliance new three-step Mentor Program","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-cyclists-alliance-new-three-step-mentor-program","date":1621446089000,"content":"\n      <p><span>It’s no secret that the women’s peloton is chronically under-resourced and underfunded. Things have been looking better lately but there is still a long way to go. Many of the improvements made in recent years have come as the result of pressure from women’s cycling union The Cyclists’ Alliance (TCA).</span></p>\n<p><span> From rider contract support, to pressuring the UCI to implement minimum salaries and maternity leave, as well as rider agent approval and changes to the UCI Code of Ethics, TCA have been relentless in their pursuit to make cycling a fairer sport. </span></p>\n\n<p><span>The union’s latest initiative to help female racing cyclists is a three-step Mentor Program to provide pre-career, mid-career, and post-career support to their members. The programme has been pioneered by recently retired rider, and TCA co-founder, Gracie Elvin alongside Roos Hoogenboom, who has also stepped away from the sport in the past year. </span></p>\n<p> </p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TCAMP_600x600.jpg?v=1621443091\" /></div>\n<p><em><span>Image: The Cyclists' Alliance</span></em></p>\n<p><span>A similar programme had already been running in an informal capacity, having been set up by another TCA co-founder, Carmen Small. “It showed a lot of promise. And we had some really nice pairings over the years,” Elvin explains over Zoom. “We can see some gaps there, as well from the time that we have spent in cycling, and just that huge need for keeping women in the sport even when they retire from racing.” </span></p>\n<p><span>The standout arm of the initiative is the post-career development for retiring and retired cyclists for which TCA have partnered with some of the cycling industry’s biggest brands; Cannondale, Liv, Specialized, Trek, and SRAM to offer internships and experience in the industry. </span></p>\n<p><span>This will, a TCA press release states, “provide retired cyclists with incredible opportunities and practical skills to ready them for life beyond the bike </span><span><span>—</span></span> whilst providing the brands with access to a pool of expert, high-performing talent.”</p>\n<p><span>“It's really exciting because these five major brands are </span><span>— </span>in an everyday sense<span>—</span> rivals of each other, and yet they're willing to come together in this kind of project, because they can see the bigger picture,” Elvin says. “Instead of having a naming sponsor for our programme, we were adamant on having this group network so it's a diverse way to have lots of opportunities for the people that we're looking after.” </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Le_Col_banner_299f9a04-bb76-4e0a-a970-35d7a06450db_1024x1024.jpg?v=1621444501\" /></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\"><em><strong>Sign up to our women's newsletter</strong></em></a></p>\n<p><span>Kim Price, Leader of People and Culture at Specialized is equally enthusiastic about the collaborative nature of the programme, “it's much bigger than just one brand. There's a lot of barriers. And the more that we can join together as a coalition to make this happen, the better,” she says. “It's a really good opportunity for us to come together as an industry-wide set of global brands to make a difference, but also to learn from one another.” </span></p>\n<p><span>Tim Vanderjeugd, Global Director of Sports Marketing at Trek agrees, “Of course, we're competitors in many ways, [in] the business side of things, obviously, but also in racing. Specialized is probably our number one rival when it comes to everything we do. But it's great that there can be collaboration across normal party lines,” he says . “I'm glad to see that other brands are in as well. I'm also glad to see that we are no longer the only team that pays a living wage to the riders. So I think that change is coming. And, when we set out to do what we have decided to do, we were hopeful that we weren't going to be the only brand to do it. So it's really cool to see. I'm very pleased with it.’”</span></p>\n<p><span>“It was a nice mirror and reflection of what we're doing with The Cyclists Alliance,” says Elvin. “It's a union. So we're trying to unify all the riders for a greater purpose and to help one another in whatever the case may be. So it's really nice to have these brands also unifying.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_8876_1024x1024.jpg?v=1621443398\" /></div>\n<p><em><span>Gracie Elvin. Photo credit: Alex Whitehead/SWPix.com</span></em></p>\n<p><span>Having recently stepped away from the sport, Elvin knows first-hand what the transition from athlete life is like. “A really key part of having a smooth transition is knowing what your pathway could look like,” she says, citing Anna van der Breggen and Chantal van den Broek Blaak </span><span>—</span> who have known for over a year that they will transition into DS roles at their team, SD Worx, post-retirement.</p>\n<p><span>Having only just stepped away from the pro peloton, says Hoogenboom, also allows the two of them to understand which riders might work best as mentor/mentee pairings for the scheme’s mid-career guidance, “I think it's a big advantage that we were recently racing in the peloton, and we know a lot of people and we know also know, maybe the type of rider. I don't know them all personally, of course, but we have an idea of who they are in the peloton, and how to match them best.”</span></p>\n<p><span>So far, the programme has received 29 applications and created 15 pairings from that. “That's more than what we were expecting,” says Elvin. “It took a lot of work to organise an application survey so we could get some really good data on the applicants, and then that would help with how to pair people up. So that was a good challenge as well, and figuring out the puzzle of the pairs so we actually had quite an even number of mentors and mentees. But we actually had more mentors apply, which was really interesting.”</span></p>\n<p><span>Irish cyclist and TCA member Imogen Cotter applied for the Mentorship Programme and has since been paired with an experienced former rider, “Actually having somebody who's done it all before and have her be able to tell me, ‘this is what you do, and this is how you do it, and this is when you do it’:</span> it's just so so helpful,” she says. </p>\n<p><span>Cotter is a relative newcomer to the sport at 27-years-old but after being picked up by an Irish talent ID programme for the track she found herself moving to Europe to train. Now living in Belgium and focused on the road </span><span>—</span> as well as Zwift racing with the Movistar e-team <span>—</span> she has ambitions to ride professionally and hopes her mentor can guide her through the often nebulous process. “I haven't ever known how to apply to a team or who to contact,” she says. “There's so much I just don't know. I don't know, like the politics of cycling in a way. So just having somebody to guide me through that is very helpful.”</p>\n<p><span>Cotter is not alone in her predicament, and </span><span>—</span> according TCA’s press release <span>—</span> part of the mentorship programme is aimed at helping riders to gain “practical knowledge such as cycling CV tools, advice on how to approach teams and relocation factsheets... with the aim of democratising entry into and diversifying the professional peloton.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1211085225_1024x1024.jpg?v=1621444345\" /></p>\n<p><em>Imogen Cotter (Photo: David Fitzgerald/Sportsfile via Getty Images)</em></p>\n<p><span>“I think it's becoming a really global sport. So it's not just a whitewashed European sport anymore. And we want to make sure there's a lot of not just diversity, but inclusivity. That there’s welcome places for anyone from any country to come to us for support,” says Elvin. “We've noticed in our applications, actually, probably the majority is not from the Central Europe group. There's a lot of North Americans, South Americans, Australians, people from the UK and smaller countries in Europe. And I think that just goes to show that they are looking for that extra support, because it's not that easy for them. And it's really nice to have a bit of a landing place for some of those people.”</span></p>\n<p><span>Diversity is also a priority for Price and Specialized, “The idea of trying to expand diversity in cycling and really change the face of cycling is something that we're all driven to do,” she says. </span></p>\n<p><span>Her colleague, Lindsay Knight, Leader, Community Engagement &amp; Strategic Initiatives at Specialized, agrees that the women’s peloton offers a distinct pool of talent and experience. “It's a group of women who really do have a unique set of intellectual and academic backgrounds, as well as a really unique life experience,” she says. “So this programme is to expose them to the multitude of ways that you could use that. And as a result of that they'll be very individually tailored to what those backgrounds and interests are. And not just at Specialized, that's for every organisation that's part of this coalition.”</span></p>\n<p><span>For Elvin, the goal is clear: “I'd really just love to see more women in roles on the other side of the fence, ultimately after they've finished racing,” she says. “It's obvious and it's clear even in our surveys and data, the majority of the women's peloton is highly educated and highly intelligent and highly capable. And when we lose them to retirement, you don't ever hear from them again, it's such a waste. So I'm really happy to see more women in leadership roles already as some really great trailblazers. And I just want to be part of the solution to making it a more supportive sport from all aspects of the sport.”</span></p>\n<p><span>“We might be able to help one person this year, or five. We're not sure yet. But I think this is going to be a really nice period of time to really collaborate with these brands and figure out how to do it properly.”</span></p>\n<p><span>For more information on The Cyclists’ Alliance Mentor Program visit TCA’s </span><a href=\"https://cyclistsalliance.org/2021/05/the-cyclists-alliance-announces-tcamp/\"><span>website</span></a><span>.</span></p>\n\n<p><em>Cover photo: Thomas Maheux/SWPix</em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"40253fbb10519ca27225cf2f7a09b5fdddd445ba4f189792442d279bd89a9e5d","category":"Cycling"}