{"title":"Numerical investigation of combustion characteristics of extended coherent flame model 3 zones (ECFM‐3Z) in diesel engines running with biodiesel","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14422?af=R","date":1720437575000,"content":"<h2>Abstract</h2>\n<p>This research investigates the application of Extended Coherent Flame Model-3 Zones (ECFM-3Z) to assess the performance and emissions of rapeseed oil methyl ester (ROME). Experimental tests were carried out using a Lombardini 3 LD 350 model single-cylinder diesel engine, at 1600–3000 rpm with 200 rpm speed increments, under full load conditions. For numerical analysis, STAR-CD/ESICE software was employed. Methyl Oleate (C<sub>19</sub>H<sub>36</sub>O<sub>2</sub>) was predicted as the surrogate biodiesel based on Gas Chromatography (GC) analysis and average mass calculation. Notably, the numerical analysis revealed a remarkable similarity in brake power between the experimental and computational investigations. In the range of 2400–3000 rpm, the biodiesel's performance exhibited a maximum deviation of 5%, primarily attributed to pumping, thermal, and friction losses. In terms of emissions, carbon dioxide (CO<sub>2</sub>) emissions were consistent with the findings of the experimental study, with a maximum disparity of 10%. However, carbon monoxide (CO) emissions ranged from 57% to 65% lower than those observed in the experimental study, while nitrogen oxide (NO<sub>x</sub>) emissions exhibited a reduction of 63% to 84%. In contrast, oxygen (O<sub>2</sub>) emissions were notably higher, ranging from 93% to 117% compared to the experimental study, and exhaust temperatures were elevated by 33% to 49% in comparison to the experimental results.</p>","author":"Şeyma Karahan Özbilen, \nEmrullah Hakan Kaleli, \nEmir Aydar","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"402c8c02ae5401b4c18600863a7a6a441ca1f13415033d13e61868c2b1e766a8","category":"Environment"}