{"title":"Grammy Awards ออกกฎ เพลงที่สร้างจาก AI ทั้งหมด จะไม่มีสิทธิ์ได้รับรางวัล","link":"https://www.blognone.com/node/134468","date":1687339445000,"content":"<div><div><div><p>ในยุคที่ AI เริ่มเข้ามามีบทบาทกับทุกอุตสาหกรรมรวมไปถึงวงการเพลง ล่าสุด Harvey Mason jr. ซีอีโอของ Recording Academy ผู้จัดงาน Grammy Awards ได้อัปเดตกฎและแนวทางสำหรับปัญญาประดิษฐ์ (AI) ที่ถูกใช้ประกอบในการสร้างสรรค์ผลงานเพลง</p>\n<p>กฎใหม่ระบุว่า ผลงานที่สร้างโดย AI อย่างเดียว จะไม่มีสิทธิ์ได้รับรางวัล Grammy Awards แต่ในกรณีที่ใช้ AI เป็นองค์ประกอบในการสร้างก็มีสิทธิ์ได้รับรางวัล หากตรงตามเกณฑ์ดังต่อไปนี้</p>\n<ol>\n<li>องค์ประกอบของเพลงส่วนที่เป็นมนุษย์เขียนขึ้น ต้องมีความหมายและมีนัยสำคัญมากพอ</li>\n<li>องค์ประกอบที่ประพันธ์โดยมนุษย์จะต้องตรงกับหมวดหมู่ที่ส่งผลงานเข้าประกวด เช่น หากส่งผลงานในหมวดการแต่งเพลง ดนตรีหรือเนื้อเพลงควรประพันธ์โดยมนุษย์</li>\n<li>ผู้เขียนที่นำ AI เข้าไปมีส่วนในการสร้างสรรค์ผลงานจะไม่มีสิทธิ์ได้รับการเสนอชื่อหรือรับรางวัลในงาน Grammy Awards</li>\n</ol>\n<p>ตัวอย่างคือการใช้ AI ในการสร้างเสียงร้อง จะไม่สามารถรับรางวัลในหมวดหมู่ของการแสดงเสียงร้อง แต่ถ้าเพลงยังมีส่วนที่สร้างจากมนุษย์และมีความหมายอยู่ ก็สามารถได้รับรางวัลในประเภทอื่นที่พิจารณาการมีส่วนร่วมของมนุษย์ในเพลง ถึงแม้ว่าจะมีแทร็กเสียงของ AI ประกอบด้วยก็ตาม</p>\n<p>ในส่วนของ<a href=\"https://www.blognone.com/node/134326\">กรณี The Beatles ที่มีการใช้ AI เพื่อรีมาสเตอร์เพลงและดึงเสียงร้องของ John Lennon ออกจากเทปเดโม่</a> ซึ่งเป็นการใช้ AI เพื่อประมวลเสียง แต่ไม่ได้ถูกใช้สร้างองค์ประกอบของเพลงหรือการแสดงตั้งแต่ต้น จึงคาดเดาว่าเพลงหรืออัลบั้มยังคงมีสิทธิ์ได้รับการพิจารณาจากทาง Grammy</p>\n<p>การใช้ AI เป็นเครื่องมือสร้างสรรค์ยังเป็นประเด็นถกเถียงในวงการศิลปะ การที่ Grammy ตั้งกฎนี้ ถือว่าให้ความสำคัญกับมนุษย์ในการสร้างสรรค์ผลงาน แม้ว่า AI ในปัจจุบันมีความสามารถที่โดดเด่น แต่เวที Grammy Awards ยังคงสงวนไว้สำหรับศิลปินที่เป็นมนุษย์ในตอนนี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/25ee373d1600aef55aaa1c5cb7159ff1.jpg\" /></p>\n<p>ที่มา:<br />\n<a href=\"https://www.grammy.com/news/recording-academy-ceo-harvey-mason-jr-discusses-2024-grammys-new-rules-guidelines\">grammy</a>, <a href=\"https://arstechnica.com/information-technology/2023/06/purely-ai-generated-songs-declared-ineligible-for-grammy-awards/\">arstechnica</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/grammy-awards\">Grammy Awards</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/music\">Music</a></div><div><a href=\"/topics/award\">Award</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"402f2ae8e7cc14070b4b9e3ea886fa2f8558653cd804644e8440b21f373f8041","category":"Thai"}