{"title":"Subjective cognitive and olfactory impairments predict different prospective dementia outcomes","link":"https://academic.oup.com/chemse/article/doi/10.1093/chemse/bjae033/7762052?rss=1","date":1726704000000,"content":"<span><div>Abstract</div>Self-reported measures emerge as potential indicators for early detection of dementia and mortality. We investigated the predictive value of different self-reported measures, including subjective cognitive decline (SCD), subjective olfactory impairment (SOI), subjective taste impairment (STI), and self-reported poor health (SPH), in order to determine the risk of progressing to Alzheimer’s disease (AD) dementia, Parkinson’s disease (PD) dementia, or any-other-cause dementia. A total of 6,028 cognitively unimpaired individuals from the 8th wave of the English Longitudinal Study of Ageing (ELSA) were included as the baseline sample and 5,297 individuals from the 9th wave were included as 2-year follow-up sample. Self-rated measures were assessed using questions from the ELSA structured interview. Three logistic regression models were fitted to predict different the dementia outcomes. SCD based on memory complaints (OR = 11.145; <span>P</span> &lt; 0.001), and older age (OR = 1.108, <span>P</span> &lt; 0.001) significantly predicted the progression to AD dementia at follow-up. SOI (OR = 7.440; <span>P</span> &lt; 0.001) and older age (OR = 1.065, <span>P</span> = 0.035) significantly predicted the progression to PD dementia at follow-up. Furthermore, SCD based on memory complaints (OR = 4.448; <span>P</span> &lt; 0.001) jointly with complaints in other (non-memory) mental abilities (OR = 6.662; <span>P</span> &lt; 0.001), and older age (OR = 1.147, <span>P</span> &lt; 0.001) significantly predicted the progression to dementia of any other cause. Different types of complaints are specifically associated with different dementia outcomes. Our study demonstrates that self-reported measures are a useful and accessible tool when screening for individuals at risk of dementia in the general population.</span>","author":"","siteTitle":"Chemical Senses Current Issue","siteHash":"eaf999c97f18ab6d9732972032217d08ae5a0287f7a7d719a702f9f5727afa53","entryHash":"403538435270b8377b502f94378c8d1fb080923977cec4ab4dedbf54f61e0584","category":"Environment"}