{"title":"Activision Blizzard “Walkout for Equality” to protest management inaction","link":"https://arstechnica.com/?p=1783404","date":1627414575000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/8468473390_bac3e579b8_k-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/8468473390_bac3e579b8_k.jpg\">Enlarge</a> <span>/</span> A em&gt;Warcraft-themed statue sites in front of the Blizzard employee campus. (credit: <a href=\"https://www.flickr.com/photos/gordontarpley/8468473390/\">Flickr / gordontarpley</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>A group of Activision Blizzard employees is planning a \"Walkout for Equality\" on Wednesday to protest the feeling that \"our values as employees are not being accurately reflected in the words and actions of our leadership.\"</p>\n<p>The move comes in the wake of <a href=\"https://arstechnica.com/gaming/2021/07/ca-state-agency-sues-activision-blizzard-alleges-discrimination-against-women/\">a California Department of Fair Employment and Housing lawsuit</a> alleging widespread discriminatory practices at the company. It also comes after an official response from the company that thousands of employees have called \"abhorrent and insulting to all that we believe our company should stand for\" <a href=\"https://arstechnica.com/gaming/2021/07/internal-activision-blizzard-petition-rebukes-abhorrent-insulting-leadership/\">in a signed petition</a>.</p>\n<p>In a statement, walkout organizers said they're asking management to work with them to develop new recruiting practices, publish employee pay rates, and undertake third-party audits to improve staff diversity and prevent harassment. Currently, organizers write, \"women, in particular women of color and transgender women, nonbinary people, and other marginalized groups that are vulnerable to gender discrimination\" are subject to unfair discrimination in hiring, pay, and promotion and suffer from harassment from other employees.</p></div><p><a href=\"https://arstechnica.com/?p=1783404#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1783404&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4038f747362c8144a546dcabe42fe5b97439aacba9fa2d1f63132c3a83fde2c6","category":"Tech"}