{"title":"Linux devices are under attack by a never-before-seen worm","link":"https://arstechnica.com/?p=1994946","date":1704903160000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/router-800x534.jpg\" alt=\"Linux devices are under attack by a never-before-seen worm\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/router.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>For the past year, previously unknown self-replicating malware has been compromising Linux devices around the world and installing cryptomining malware that takes unusual steps to conceal its inner workings, researchers said.</p>\n<p>The worm is a customized version of Mirai, the botnet malware that infects Linux-based servers, routers, Web cameras, and other so-called Internet-of-things devices. Mirai came to light in 2016 when it was used to deliver <a href=\"https://arstechnica.com/information-technology/2016/09/why-the-silencing-of-krebsonsecurity-opens-a-troubling-chapter-for-the-net/\">record-setting distributed denial-of-service attacks</a> that <a href=\"https://arstechnica.com/information-technology/2016/10/inside-the-machine-uprising-how-cameras-dvrs-took-down-parts-of-the-internet/\">paralyzed</a> key parts of the Internet that year. The creators soon released the underlying source code, a move that allowed a wide array of crime groups from around the world to incorporate Mirai into their own attack campaigns. Once taking hold of a Linux device, Mirai uses it as a platform to infect other vulnerable devices, a design that makes it a worm, meaning it self-replicates.</p>\n<h2>Dime-a-dozen malware with a twist</h2>\n<p>Traditionally, Mirai and its many variants have spread when one infected device scans the Internet looking for other devices that accept <a href=\"link\">Telnet connections</a>. The infected devices then attempt to crack the telnet password by guessing default and commonly used credential pairs. When successful, the newly infected devices target additional devices, using the same technique. Mirai has primarily been used to wage DDoSes. Given the large amounts of bandwidth available to many such devices, the floods of junk traffic are often huge, giving the botnet as a whole tremendous power.</p></div><p><a href=\"https://arstechnica.com/?p=1994946#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1994946&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4043eec5c62270827c484bd90789b3d430f858f0f0ecd0ee2ccc7f4068fa22ef","category":"Tech"}