{"title":"How to Deal with Pulpitis: An Overview of New Approaches &ndash; a Narrative Review","link":"https://www.preprints.org/manuscript/202410.1657/v1","date":1729588474000,"content":"Background: Traditional root canal therapy (RCT) has been the primary method for treating necrotic pulp, but it presents limitations such as loss of vitality and postoperative fractures. Recent advancements in regenerative endodontics offer alternative strategies to restore pulp tissue vitality and function. These approaches involve stem cell transplantation, cell homing, and the use of organic scaffolds to promote pulp regeneration. Highlight: This article reviews various regenerative endodontic techniques, including autogenic and allogenic dental pulp transplantation, the use of amniotic membrane scaffolds, platelet-rich fibrin therapy, specialized pro-resolving mediators, nanofibrous and bioceramic-based scaffolds, injectable scaffolds, and dentin matrix proteins. These strategies leverage stem cells, growth factors, and biomaterials to create conducive microenvironments for cell attachment, proliferation, and differentiation, thereby facilitating pulp tissue regeneration. Methods: The literature search was conducted using databases such as PubMed, Scopus, and Google Scholar, employing keywords like \"regenerative endodontics,\" \"pulpitis,\" \"pulp regeneration,\" and \"platelet-rich fibrin.\" Conclusion: The reviewed approaches in regenerative endodontics show promising potential for overcoming the limitations of traditional RCT and promoting pulp tissue regeneration. However, further research is needed to optimize protocols, address challenges, and translate these advancements into routine clinical practice. Ultimately, these innovations have the potential to enhance patient outcomes in endodontic treatment by restoring pulp vitality and function effectively.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"404767b9a01f5636da2f3c5b80463a222c9e686472d8ccfa129beaeddac065f2","category":"Interdisciplinary"}