{"title":"How To Migrate From WordPress To A Headless CMS","link":"https://smashingmagazine.com/2021/07/wordpress-headless-cms-storyblok/","date":1626777000000,"content":"<p>WordPress is the most used website builder in the world; almost half of the web has used WordPress to create their website. It makes sense, because it allows you to quickly create websites and has a rich plugin’s ecosystem to help you scale your site.</p>\n<p>But technology is evolving, and there are more and more options that make it easier to create websites. Moreover, they give us the possibility to improve the website’s performance and to have more control and security over the application.</p>\n<p>The initial <strong>WordPress architecture is monolithic</strong>, so the user interface and data access are combined on the same platform.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/28bf63fc-d808-4108-a836-f1d015885086/1-wp-storyblok-case-study.png\" /></p>\n<p>Since the introduction of the <a href=\"https://developer.wordpress.org/rest-api/\">REST API</a> on WordPress, it can be used in a headless way, allowing developers to use it as a backend and having the front-end in a different project.</p>\n<p>In this decoupled way, <strong>models and controllers are bundled on the WordPress side</strong>, handling data manipulation and database interaction. Meanwhile, the front-end only interacts with the <a href=\"https://www.smashingmagazine.com/2018/01/understanding-using-rest-api/\">REST API</a> via an HTTP client.</p>\n<p>But this also has some disadvantages, you still need to configure and update WordPress, make it secure and are dependent on their technology for the development of new functionalities.</p>\n<h3>Related Reading on SmashingMag</h3>\n\n<p>For those of you who are just starting in the headless world, these articles will help you understand the ins and outs behind it and why everyone is starting to migrate.</p>\n<ul>\n<li>“<a href=\"https://www.storyblok.com/tp/headless-cms-explained\">Headless CMS Explained In 5 Effective Minutes</a>”</li>\n<li>“<a href=\"https://www.cmswire.com/digital-experience/rethink-your-content-strategy-for-a-headless-cms/\">Rethink Your Content Strategy For A Headless CMS</a>”</li>\n<li>“<a href=\"https://www.storyblok.com/tp/component-thinking-improves-productivity\">How Thinking In Components Can Increase Your Productivity</a>”</li>\n<li><a href=\"https://www.smashingmagazine.com/category/headless/\">A curated list of articles related to “Headless” →</a></li>\n</ul>\nBut Why Migrate To A Headless CMS?\n<p>Taking into account that this article will showcase how to migrate from <a href=\"https://wordpress.com/\">WordPress</a> to a Headless CMS, WordPress is probably your current setup.</p>\n<p>A Headless CMS will give us the freedom to <strong>focus only on the front-end project</strong>, being able to choose the technology we are familiar with, and on the structure of our data. In the end, it takes care of the content management and the content delivery, so that we can take care of the rendering part.</p>\n<blockquote>“A Headless CMS is a system that provides the same features as a Content Management System (CMS) and more, all exposed through an API.”</blockquote>\n\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b6f556aa-62e1-4bc2-b8ae-939b2bd88473/2-wp-storyblok-case-study.png\" /></p>\n<p>This type of setup is especially useful for <strong>companies that have multiple sites</strong> and want to reduce costs or simplify processes. A headless architecture allows these companies to <strong>centralize content management in a single administration interface</strong>, providing the APIs that will be consumed by the company’s different web pages.</p>\n<p>Another common use of a headless architecture is to create a front-end project that represents the company brand. In this way, all the products that the company launches will have the same look and feel, but each one will have its own content, managed in the same administration panel.</p>\n<p><strong>Note</strong>: <em>This example can be easily seen on conference websites such as <a href=\"https://frontenddeveloperlove.com/\">JSWorld Conference</a> and <a href=\"https://vuejs.amsterdam/\">VueJS Amsterdam</a> which, being from the same creators, the front-end project is the same, only the content changes.</em></p>\n<p>Different to a CMS like WordPress, in a Headless CMS you have an <strong>administration panel already configured and maintained</strong>, and sometimes also hosted, for you. To start creating content, you just need to create an account, log in, and you will be able to create, edit, duplicate and delete your content, manage users, translate content and work with publication workflows, among other things.</p>\n<p>A headless CMS will make it easier for the people in your team to understand the workflow, whether they are content creators or marketers, something to keep in mind if you aren’t the only one who will edit the content.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9a477735-3eca-4f3b-85d9-43c16f555620/3-wp-storyblok-case-study.png\" /></p>\n<p>It is worth noting that some Headless CMS, not only focuses on offering you the services already offered by a CMS like WordPress. It also provides services such as <strong>image CDNs to resize or reformat your images</strong> on the fly, or additional security through S3 backups.</p>\n<p>Having this setup will not only give you freedom, security and comfort, but will also improve the performance of your application without third-party services. Just by connecting your front-end project via an HTTP client and getting the components and data, you will be up and running.</p>\nThe Benefits Of Going Headless And When It Makes Sense\n<p>WordPress’ architecture often does not offer the possibilities we sometimes need when working on a website, especially when it comes to <strong>optimizing performance</strong>, one of the most important points when ranking our site in a search engine like Google and especially now that <a href=\"https://web.dev/vitals/\">Web Vitals</a> is up and running.</p>\n<p>But it is clear that if we have a personal site that only we ourselves work on, then it’s not necessary to migrate it to a headless setup. However, if more people are involved in that project (not just developers but content creators or marketing teams), then we should consider adopting Headless CMS.</p>\n<h3>How Can A Headless CMS Help Us Improve The Performance Of Our Website And The Quality Of Our Front-End Project?</h3>\n<ul>\n<li><p>By allowing you to develop the <strong>front-end</strong> in a way that is completely <strong>independent</strong> of the platform where you edit your content.</p>\n<p>  The <strong>technology</strong> you choose is your <strong>own choice</strong>, if you wanted to upgrade your project to the latest front-end framework, you would not be dependent on a back-end and could do so without having to rethink migrations.</p>\n</li>\n<li><p>Allowing you to create <strong>multiplatform</strong> projects without having to depend on different administration panels.</p>\n<p>  In the end, if for an app you need a shorter description than the main website, you can always make use of a new \"short_description\" field and just represent it on the front-end of that specific app.</p>\n</li>\n<li><p>It is intended to make <strong>development easier</strong> and simplify the process of creating a site, as well as scaling it.</p>\n<p>  By having the front-end completely isolated we can <strong>change the visual appearance</strong> of our entire application without modifying the structure of our content.</p>\n</li>\n<li>Always offering services that will allow us to <strong>optimize our assets</strong> and the <strong>speed of response</strong> with which they are served to us.\nUltimately all our data will be delivered through CDN networks.</li>\n</ul>\n<p> A content delivery network (CDN), is a geographically distributed network of proxy servers and their data centers. The goal is to provide <strong>high availability and performance</strong> by distributing the service spatially relative to end-users.</p>\n<h3>What If We Are Concerned About How It Will Work With Our Brand’s Or Company’s Structure?</h3>\n<ul>\n<li><p>As well as supporting cross-platform applications, it also allows us to maintain <strong>brand consistency</strong>.</p>\n<p>  Having the front-end as a base project and having multiples spaces in a Headless CMS, allows you to have consistency between your products and makes the scalability easier because we have less code to maintain.</p>\n</li>\n<li>Although not all headless CMS have this benefit, the headless CMS we are migrating to, <a href=\"https://www.storyblok.com/\">Storyblok</a>, has a Visual Editor, which allows creating <strong>independence among teams</strong>.\nThe editors or content creators can access the panel to edit existing content or create new content, being able to see a preview of how it will look before publishing. So they won’t have to involve the development team in this process and can do their work more efficiently.</li>\n<li>It also streamlines content management by allowing you to set up your own <strong>content workflow</strong>.\nYou can define the stages that a piece of content must go through before being published and, only when it passes the process successfully, it will be published.</li>\n</ul>\n<h3>How Can A Headless CMS Save Time Compared To A Traditional CMS?</h3>\n<ul>\n<li>Taking care of maintaining the security of the platform and updating it on your behalf.\nWhenever there is a bug or users require a new feature, the team behind your Headless CMS will develop it for you, you just have to start using it!</li>\n<li>Constantly improving the user experience (UX) and design (UI) for you, so that content creators and developers feel comfortable creating new fields, components or pages.\nBut not only on the visual aspect, but they will also be looking to improve the performance of the database, so you get your content instantly and forget about all the work that is involved.</li>\n</ul>\n<h4>Monolithic vs Headless</h4>\n<table>\n  <thead>\n    <tr>\n      <th>Feature</th>\n      <th>Monolithic</th>\n      <th>Headless</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Architecture</td>\n      <td>Coupled: linked back-end front-end</td>\n      <td>Decoupled: independent front-end project</td>\n    </tr>\n    <tr>\n      <td>Technology</td>\n      <td>You will have to use the one in which the project is developed</td>\n      <td>Freedom to choose your front-end technology</td>\n    </tr>\n    <tr>\n      <td>Cross-platform</td>\n      <td>Limited to one front-end at a time</td>\n      <td>Connects to any front-end projects</td>\n    </tr>\n    <tr>\n      <td>Content workflow</td>\n      <td>Restrictive</td>\n      <td>Custom</td>\n    </tr>\n    <tr>\n      <td>Security and updates</td>\n      <td>You take care</td>\n      <td>It takes care for you</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Having seen the advantages that a headless setup can bring to our project and the people who work on it, I think it is time to look at the steps we need to migrate our project.</p>\nWhat You Need To Keep In Mind When Going Headless\n<p>As we have already mentioned, Headless CMS allow for a clean separation of concerns between content creators and developers. In this way (in a Headless CMS), the developer focuses on creating the content structure, which will be represented in the front-end project, and the editor will be in charge of using the components and filling them with content in the admin panel.</p>\n<h3>Type Of Content We Can Create In A Headless CMS</h3>\n<h4>1. Types of entry or template</h4>\n<p>Similar to <a href=\"https://www.wpbeginner.com/wp-tutorials/how-to-create-custom-post-types-in-wordpress/\">Custom Post Types</a> in WordPress but with more freedom and extensibility when it comes to data types and editors.</p>\n<p>When you go to create a new content entry in your dashboard, you expect to be able to choose what type it depends on the situation. For example, if you have a website with a blog you will want to have several types of templates, one for pages with listings or dynamic content called \"<em>page</em>\" and one for each blog entry \"<em>post</em>\".</p>\n<p>Depending on the headless CMS you have chosen, the name will vary but the concept is the same. In Storyblok these types of entities are called <em>Content Type</em>. “Content Types” define the type of content entry and can hold the basic fields for your content entries. By default, we have a “Page” content type.</p>\n<h4>2. Reusable components</h4>\n<p>In a Headless CMS, you can create, in addition to Content Types, nested components and reuse them between content types and other components. In Storyblok, this type of component — as you may have noticed from its name — is called <strong>Blok</strong>.</p>\n<p>To use them in a <em>Content Type</em> such as a page, you will need to create a field in the schema of type blocks. This field allows you to add nested components to your page while adding content.</p>\n<p>But, in principle, we will not need such components during the migration. It simply gives you the flexibility to <strong>create robust and dynamic applications</strong> without having to involve the developer.</p>\n<p>For example, when a member of the marketing team wants to add a new Hero to the About us page, if the Hero component was created as nested and the page had a Blocks field, the marketing person could add the Hero without having to involve the developer.</p>\n<h3>Rendering The Data Coming From The Headless CMS</h3>\n<p>As we are defining the structure of our content in the Headless CMS panel, we have to <strong>consider which framework we want</strong> to create our front-end project with and which HTTP client we will use.</p>\n<p>When choosing a framework we have to take several factors into account:</p>\n<blockquote>Are my team and I am familiar with this technology?<br /><br />Does it allow me to render my content in the type of rendering my project needs?<br /><br />Does it have plugins or modules that facilitate integration with the Headless CMS I’m using?</blockquote>\n\n<p>In most cases, a static site will be sufficient and will always be the most economical and high-performance answer. So, you just have to <a href=\"https://jamstack.org/generators/\">look for a static site generator</a> for the technology you are familiar with, for example, <em>Nuxt</em> for Vue or <em>Next</em> for the React library.</p>\n<p>Connecting these two things, a <strong>Headless CMS and a static site builder</strong> are considered as a set of web development best practices focused on providing the highest performance, security and lowest cost. This architecture is also known as <a href=\"https://jamstack.org/\">Jamstack</a>. It’s an architecture designed to make the web faster, more secure and easier to scale. It builds on many of the tools and workflows which developers love, and which bring maximum productivity.</p>\n<p>By making use of the trendy frameworks, you will be assured of an integration guide with the Headless CMS you are going to work with, and most of them have already a module or package that allows you to obtain information from the API and in many cases extend it.</p>\n<p>The only thing left for you to do is to <strong>define the structure of your components</strong> concerning how you have structured the data in your Headless CMS and automate the content publishing process. For example, using the <a href=\"https://www.storyblok.com/docs/guide/in-depth/webhooks\">Webhooks</a> that the Headless CMS provides you with, you will be able to start a build process in your favourite <a href=\"https://docs.netlify.com/configure-builds/build-hooks/\">hosting by its build hooks</a> once the content has been published.</p>\nAmount Of Time You’ll Need\n<p>As with any migration, the time required will always <strong>depend proportionally on the complexity</strong> of your project. If we are talking about a common WordPress site you will only need to migrate the Post types that you have defined or that comes by default in it, such as Pages, Posts and Categories, and their content.</p>\n<p>If, on the other hand, you have customized your project with multiple plugins, you will have to develop them through the front-end project or using the ones provided by your Headless CMS. For example, if we are SEO conscious and therefore make use of <a href=\"https://wordpress.org/plugins/wordpress-seo/\">Yoast SEO</a> on WordPress, we will have the <a href=\"https://www.storyblok.com/apps/seo\">Field-Type SEO</a> plugin in Storyblok to help us in the transition, but we will still have to develop our sitemap in the front-end with a <a href=\"https://www.storyblok.com/tp/how-to-generate-sitemap-headless-cms\">guide to help us</a>.</p>\n<p>In the end, all the burden of development will fall on the front-end project, as setting up the Headless CMS will not take that much time.</p>\n<p>But let’s stop talking and let’s take a look at it!</p>\nSteps To Migrate Our Content From WordPress To Storyblok\n<p>The migration will consist of four steps, from the creation of a space in our new Headless CMS Storyblok to the representation of the migrated content in our front-end project, which we will see in detail below and in which I will leave you resources to make the migration easier for you.</p>\n<p>Let’s get started!</p>\n<h3>1. Creating A Space In Storyblok</h3>\n<p>In order to create a space in Storyblok, you first need to have an account. To do this, you will need to select the plan that suits you best.</p>\n<p>Go to the <a href=\"https://www.storyblok.com/pricing\">Pricing page</a> and start with the plan that best suits your needs or try the free plan for testing.</p>\n<p>Create your account, and you will be able to access the panel.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e4bb20a0-3453-40c4-8296-c776f3390dc3/4-wp-storyblok-case-study.jpg\" /></p>\n<p>Choose ‘Create a new space’ and let’s get started!</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/73bcd921-f3fc-4eaa-941a-8d54bf017d06/5-wp-storyblok-case-study.jpg\" /></p>\n<p>Space is a content repository. Think of it as a place to keep all the content related to one project. Each space has its own components, data sources, assets, environments, domains, collaborators and permissions.</p>\n<p>Take some time to explore the sections on the left sidebar. Start by browsing the following:</p>\n<ul>\n<li><strong>Content</strong>, this will be the folder where the content will be stored, where the marketing team will spend most of their time.</li>\n<li><strong>Assets</strong>, where all the images will be stored, which you can then get through the CDN service, optimized and of any size.</li>\n<li><strong>Components</strong>, where you will create the <em>Content types</em> and <em>Nested components</em>.</li>\n<li><strong>Settings</strong>, the section where you will be able to configure the data of your space as well as the languages of your application, the workflows you want your content to follow before being published, user permissions, etc. Let’s say that this area will be the one related to the IT team of the project.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1a48ec4e-5a60-4f20-bcfc-fcfe0ef07875/6-wp-storyblok-case-study.jpg\" /></p>\n<p>If you still want to explore every option on the dashboard before diving into the migration, I recommend taking a look at <a href=\"https://www.storyblok.com/docs/guide/essentials/ui\">Understanding the UI</a> by Storyblok.</p>\n<p>Now that you know a bit about the Storyblok ecosystem, it’s time to define what the content of our application will look like.</p>\n<h3>2. Defining Models</h3>\n<p>To migrate WordPress content to Storyblok, the next step is to create the schemas that define the WP data structure by creating Post Types in the Storyblok space.</p>\n<p>Let’s start with <em>pages</em> and <em>posts</em> (the main Post Types in any WP site), which we’ll call <code>page</code> and <code>post</code> in Storyblok.</p>\n<p>The schema of <em>pages</em> in WP contains the fields: <em>title</em>, <em>slug</em>, <em>featured</em> <em>image</em>, <em>date,</em> and <em>content</em>.</p>\n<p><strong>Note</strong>: <em>To see all the fields contained in a Post Type go to the schema at <a href=\"https://developer.wordpress.org/rest-api/reference/pages/#schema\">WP REST API schema references</a>.</em></p>\n<p>What you need to know is that, by default, any <a href=\"https://www.storyblok.com/docs/guide/essentials/content-structures#component\">Content Type in Storyblok</a> will have some fields already defined for you, such as <em>Name</em>, <em>Slug</em>, <em>Tags</em>, First published <em>date</em>, and so on.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c4d7d0ac-1c41-4085-8aa4-70b68e15db50/7-wp-storyblok-case-study.jpg\" /></p>\n<p>Those fields could be used to migrate the content from WP. You will only need to extend it by adding <em>featured_image</em> and <em>content</em> in the Page Content Type.</p>\n<p>Go to the <strong>Components</strong> section in your space, click on the <code>page</code> created by default, remove the <em>body</em> field and add <em>featured_image</em> as type <code>Assets &gt; Images</code> and <em>content</em> as <code>Rich-text</code>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/de911094-f2d9-4046-beb6-b8b4a8a40043/8-wp-storyblok-case-study.png\" /></p>\n<p>Once the <code>page</code> schema is ready, let’s move on to the <code>post</code>. For the Post Content Type, it is necessary to include more information, such as <em>featured_image</em>, <em>excerpt</em>, <em>content,</em> and <strong>relationships to other types</strong> such as <em>Authors</em> or <em>Categories</em>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f77a2dc7-3127-4977-a2a2-260db10748e2/9-wp-storyblok-case-study.png\" /></p>\n<p>Since <em>Authors</em> and <em>Categories</em> will also have their own content, go to the <strong>Content</strong> section in the sidebar and create a couple of folders called <em>authors</em> and <em>categories</em>.</p>\n<p>Each of the folders must have a default Content Type associated. To do this, in the <strong>Components</strong> section, create <em>Author</em> and <em>Category</em> as new Content Types, and then associate the Content Type relative to each folder by clicking on the three dots on the right of the folder and selecting Settings.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6e3c6929-88a6-45d2-8068-1d4f71c85f2d/10-wp-storyblok-case-study.jpg\" /></p>\n<p>In this way, in the Post Content Type you can add a <em>Single-Option</em> or <em>Multi-Options</em> field with source <strong>Stories</strong> and point to the folder created for each field:</p>\n<ul>\n<li><strong>Authors</strong><br />This specifies the folder where they are located <code>authors/</code>.</li>\n<li><strong>Categories</strong><br />This specifies the folder where they are located <code>categories/</code>.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/52f7bb65-e917-410e-8c50-c460bd0f75bd/11-wp-storyblok-case-study.png\" /></p>\n<p><strong>Note</strong>: <em>If you want to know more about this relationship, have a look at the article <a href=\"https://www.storyblok.com/tp/setting-up-blog-content-structure#authors-and-articles-relationship\">Authors and Articles Relationship</a>.</em></p>\n<p>Now that you have seen how to create a couple of Content Types and how to create relationships between them, you will have to define the rest of the models following the same steps.</p>\n<h4>Adding A Content Type: Global</h4>\n<p>And you ask yourself, what about the content that all my pages will share? Like the navigation menu, footer, and other common elements?</p>\n<p>Don’t worry, Storyblok has already thought about that and offers us a <a href=\"https://www.storyblok.com/tp/cms-website-header-menu-navigation\">simple guide to define our global elements</a> dynamically. It shows us how to create a <em>global</em> Content Type and how to use it in the <strong>Content</strong> section.</p>\n<h3>3. Migrating The Content</h3>\n<p>Now it’s time to start migrating the content you have stored. To access WP content you need to access the REST JSON API. Access the path <code>/wp-json</code>, if the project is deployed, or <code>?rest_route=/</code> if local.</p>\n<p>In case neither of the two routes works, inspect the HTML of your page for a link in the head with <code>rel=\"https://api.w.org/\"</code>, as indicated in the <a href=\"https://developer.wordpress.org/rest-api/using-the-rest-api/discovery/\">WP discovery guide</a>, and get the correct one.</p>\n<div>\n <pre><code>&lt;link rel=\"<a href=\"https://api.w.org/&quot;\">https://api.w.org/\"</a> href=\"<a href=\"https://localhost/your-site/index.php?rest_route=/&quot;\">https://localhost/your-site/index.php?rest_route=/\"</a>&gt;\n</code></pre>\n</div>\n\n<p>To help us during the migration, the Storyblok developers have provided us with a plugin that will save us a lot of work. This plugin is called <a href=\"https://github.com/storyblok/wordpress-importer\">wordpress-importer</a>, on it, it is possible to define the equivalent Content Type in Storyblok for the WP Post type to be migrated, and it will push it to our space and migrate the images to our <strong>Assets</strong> section for us.</p>\n<p><strong>Note</strong>: <em>Using this script requires node ≥14.0.0 because it’s using <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Optional_chaining#browser_compatibility\">optional chaining</a>.</em></p>\n<h4>Creating The Migration Script</h4>\n<p>The first thing to do is to clone the repository. Then, install the NPM packages, using <code>npm install</code> or <code>yarn</code>, and create a file in the root of the project as <em>migrateWPtoStoryblok.js</em>. In order to run the script you need a script in package.json to run it, add:</p>\n<pre><code>\"migrate\": \"node ./migrateWPtoStoryblok.js\"\n</code></pre>\n\n<p>Once everything is ready, it’s time to start defining the script following the README specifications. And, as you can see, the next thing that will be needed is to find the <code>Space_id</code> and the <code>OAuth</code> token to connect to the Storyblok space.</p>\n<ul>\n<li>The <code>Space_id</code> is in the <em>Settings</em> section of the sidebar, as soon as you click on it, you will see it on the right side.</li>\n<li>To generate the <code>OAuth</code> token, you need to go to the top of the sidebar, click on the little arrow right next to the Storyblok logo, and go to <em>My Account</em>. If we scroll down we will see the <em>Personal access tokens</em> section, generate one, and copy it.</li>\n</ul>\n<p>When you have obtained both secrets, you can add them to the beginning of the script along with the URL of the JSON API of your project:</p>\n<div>\n <pre><code>import { Wp2Storyblok } from './index.js'\n\nconst wp2storyblok = new Wp2Storyblok('<a href=\"https://your-domain.com/wp-json'\">https://your-domain.com/wp-json'</a>, {\n  token: 'storyblok-oauth-token', // My Account &gt; Personal access tokens\n  space_id: 'space-id', // Settings\n})\n</code></pre>\n</div>\n\n<p>As described in previous sections, the Page Content Type in Storyblok is the equivalent of the Post Type in WP <em>pages</em>. In the code block below, you’ll see where you’ll need to specify each.</p>\n<p>And, once the Post Type and Content Type are defined, it is time to specify the name of the fields used in this entity type in WP and the equivalent name in Storyblok, in the <code>schema_mapping</code> option.</p>\n<div>\n <pre><code>import { Wp2Storyblok } from './index.js'\n\nconst wp2storyblok = new Wp2Storyblok('<a href=\"https://your-domain.com/wp-json'\">https://your-domain.com/wp-json'</a>, {\n  // ... Secrets\n  content_types: [\n    {\n      name: 'pages', // Post type in WP\n      new_content_type: 'page', // Equivalent Content type in Storyblok\n      folder: '', // OPTIONAL: To save all the content of the same type in a specific folder\n      schema_mapping: {\n        \"title\": \"name\", // \"Field in WP\": \"Field in Storyblok\"\n      }\n    }\n  ]\n})\n</code></pre>\n</div>\n\n<p><strong>Note</strong>: <em>For the migration to work correctly, make sure that the permalinks are selected by the name of the entry and not as simple. Otherwise, the script will not create the parent-child relationship between pages.</em></p>\n<p>Within the <code>schema_mapping</code> you can define several types of fields, these can be:</p>\n<ul>\n<li>A <strong>simple</strong> field, such as <code>title</code>.</li>\n<li>A <strong>sub-property</strong> of a field, like in this case the URL of the feature image.<br /><strong>Note</strong>: <em>The plugin itself takes care of migrating the images to the Storyblok space via the associated URL in <code>links.wp:featuredmedia.0</code>.</em></li>\n<li><p>A field migrated to a <strong>nested block</strong> in Storyblok.</p>\n<p>  Imagine you want to create a component in Storyblok to define your site’s rich text so that all post types using it have the same style and options.</p>\n<p>  For that, you can use the <strong>object format</strong> and specify the name of the field in the Storyblok model under the <em>field</em> property, the name of the <em>component</em> you want to store inside that field, and the name of the <em>field inside the component</em> where the content will be migrated.</p>\n</li>\n</ul>\n<div>\n <pre><code>import { Wp2Storyblok } from './index.js'\n\nconst wp2storyblok = new Wp2Storyblok('<a href=\"https://your-domain.com/wp-json'\">https://your-domain.com/wp-json'</a>, {\n  // ... Secrets\n  content_types: [\n    {\n      // ... Post type WP:Storyblok\n      schema_mapping: {\n        \"title\": \"name\", // \"Field in WP\": \"Field in Storyblok\"\n        \"_links.wp:featuredmedia.0\": \"content.preview_image\", // Using the dot notation you can define subproperties.\n        // Using nested blocks in Storyblok\n        \"content\": {\n          field: 'content.body_items', // Field name in Storyblok\n          component: \"rich-text\", // Component name inside the above field\n          component_field: \"content\" // Field name inside the component where you want to migrate the content\n        }\n      }\n    }\n  ]\n})\n\nwp2storyblok.migrate()\n</code></pre>\n</div>\n\n<h4>Entry Type Page</h4>\n<p>Now that you know how to define the field types, for the page schema, it would look like in the code block below.</p>\n<p>The plugin will take care of the <strong>parent-child relationship</strong> between pages by creating a folder in Storyblok under the parent’s slug and associating the parent as the home of that folder.</p>\n<p>Furthermore, if the <strong>content field contains</strong> <strong>images</strong>, the plugin will also migrate it for you!</p>\n<pre><code>{\n  name: 'pages', // Name of the post type in WP\n  new_content_type: 'page', // Name of the Content Type in Storyblok\n  schema_mapping: {\n    \"date\": \"first_published_at\",\n    \"title\": \"name\",\n    \"slug\": \"slug\",\n    \"_links.wp:featuredmedia.0\": \"content.featured_image\",\n    \"content\": \"content.content\",\n  }\n}\n</code></pre>\n\n<h3>Entry Type Post</h3>\n<p>Posts have a schema similar to pages but, in this case, to store them in a folder you must define the name of the folder below the entry type:</p>\n<pre><code>{\n  name: 'posts', // Post type name in WP\n  new_content_type: 'post', // Content Type name in Storyblok\n  folder: 'articles', // Destination folder name in Storyblok\n  schema_mapping: {\n    \"date\": \"first_published_at\",\n    \"title\": \"name\",\n    \"slug\": \"slug\",\n    \"_links.wp:featuredmedia.0\": \"content.featured_image\",\n    \"excerpt\": \"content.excerpt\",\n    \"content\": \"content.content\",\n  }\n}\n</code></pre>\n\n<h4>Entry Type Category</h4>\n<p>And once the schema for posts has been defined, it makes sense to define the schema for the categories so that they can be associated as described in the previous section.</p>\n<p>In order to define the <strong>folder</strong> that contains them as <strong>categories</strong> and not as category, their default name, you must go to the <strong>Permalinks</strong> option in the WordPress admin and change the <strong>Categories base</strong> option to <code>categories</code>. Then the multi-option field of the Post entries will be the one that has the relationship with the corresponding categories.</p>\n<p><strong>Note</strong>: <em>These steps are the same as those to be followed for migrating authors and linking them to articles.</em></p>\n<div>\n <pre><code>{\n  name: 'categories', // Name of the post type in WP\n  new_content_type: 'category', // Name of the Content Type in Storyblok\n  // By default will be contained by a folder called Category (change it in the Permalinks option in WP)\n  schema_mapping: {\n    \"name\": \"name\",\n    \"slug\": \"slug\",\n    \"description\": \"content.description\",\n    \"parent\": \"content.parent\",\n  }\n}\n</code></pre>\n</div>\n\n<h4>Full Final Script</h4>\n<p>The code below will be the resulting migration script from a WP project with the basic types to the Storyblok space we had created.</p>\n<div>\n <pre><code>import { Wp2Storyblok } from './index.js'\n\nconst wp2storyblok = new Wp2Storyblok('<a href=\"https://your-domain.com/wp-json'\">https://your-domain.com/wp-json'</a>, {\n  token: '',\n  space_id: 34234,\n  content_types: [\n    {\n      name: 'pages', // Name of the post type in WP\n      new_content_type: 'page', // Name of the Content Type in Storyblok\n      schema_mapping: {\n        \"date\": \"first_published_at\",\n        \"title\": \"name\",\n        \"slug\": \"slug\",\n        \"_links.wp:featuredmedia.0\": \"content.featured_image\",\n        \"content\": \"content.content\",\n      }\n    },\n    {\n      name: 'categories', // Name of the post type in WP\n      new_content_type: 'category', // Name of the Content Type in Storyblok\n      // By default will be contained by a folder called Category (change it in the Permalinks option in WP)\n      schema_mapping: {\n        \"name\": \"name\",\n        \"slug\": \"slug\",\n        \"description\": \"content.description\",\n        \"parent\": \"content.parent\",\n      }\n    },\n    // Add authors as categories.\n    {\n      name: 'posts', // Name of the post type in WP\n      new_content_type: 'post', // Name of the Content Type in Storyblok\n      folder: 'articles', // Name of the destination folder in Storyblok\n      schema_mapping: {\n        \"date\": \"first_published_at\",\n        \"title\": \"name\",\n        \"slug\": \"slug\",\n        \"_links.wp:featuredmedia.0\": \"content.featured_image\",\n        \"excerpt\": \"content.excerpt\",\n        \"content\": \"content.content\",\n      }\n    }\n    // More schemas...\n  ]\n})\n\nwp2storyblok.migrate()\n</code></pre>\n</div>\n\n<h3>4. Create A Front-End Project</h3>\n<p>Now that the content is already stored in the Storyblok dashboard, it’s time to connect the Front-end project to Storyblok.</p>\n<p>Whatever your framework or JS library, Storyblok provides the <a href=\"https://github.com/storyblok/storyblok-js-client\">JavaScript client</a> that will help you with the integration. In addition, in case you are using a specific framework, you will find other packages that will ease the way, like in Nuxt the <code>storyblok-nuxt</code> module.</p>\n<p>This JavaScript API will also include a <a href=\"https://www.storyblok.com/docs/Guides/storyblok-latest-js\">bridge between Storyblok and your Front-end</a> application. The bridge is responsible for communicating via iframe with Storyblok to tell the editing interface which component to open when the user clicks on it.</p>\n<p>Here is a list of tutorials you can find on Storyblok to connect your Front-end project.</p>\n<p><strong>Note</strong>: <em>If you don’t find your technology among them, don’t worry there are many other tutorials on the <a href=\"https://www.storyblok.com/\">Storyblok website</a>, search for yours in the search engine, and if you don’t find one I encourage you to contact them, and you will help many more people!</em></p>\n<ul>\n<li><a href=\"https://www.storyblok.com/tp/add-a-headless-cms-to-next-js-in-5-minutes\">Next</a></li>\n<li><a href=\"https://www.storyblok.com/tp/gatsby-multilanguage-website-tutorial\">Gatsby</a></li>\n<li><a href=\"https://www.storyblok.com/tp/add-a-headless-CMS-to-vuejs-in-5-minutes\">Vue</a></li>\n<li><a href=\"https://www.storyblok.com/tp/nuxt-js-multilanguage-website-tutorial\">Nuxt</a></li>\n<li><a href=\"https://www.storyblok.com/tp/add-a-headless-cms-to-angular-in-5-minutes\">Angular</a></li>\n<li><a href=\"https://www.storyblok.com/tp/add-a-headless-cms-to-svelte-in-5-minutes\">Svelte</a></li>\n<li><a href=\"https://www.storyblok.com/tp/headless-cms-ember\">Ember</a></li>\n<li><a href=\"https://www.storyblok.com/tp/tailwindcss-express-js-amp-sites\">AMP</a></li>\n</ul>\n<h3>5. Host Your Front-End Project And Automate Deploy</h3>\n<p>Once your project is ready to go into production, you choose a hosting provider and link your repository for easy deployment, then you ask yourself:</p>\n<blockquote>How do I redeploy my static site if I publish an entry on Storyblok?</blockquote>\n\n<p>The answer is very simple: by using the <a href=\"https://www.storyblok.com/docs/Guides/using-storyblok-webhooks\">webhooks offered by Storyblok</a> and the build hooks of your hosting.</p>\n<p>To give you a real example, <a href=\"https://docs.netlify.com/configure-builds/build-hooks/\">you can create build hooks URLs in Netlify</a> within the deployment section; the URL created for Storyblok in the build hooks will go in the <em>Settings</em> → <em>Webhooks</em> → <em>Story published &amp; unpublished</em> field in the Storyblok space.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/11845da5-550a-4af2-b129-afa8ced50349/12-wp-storyblok-case-study.png\" /></p>\nGuides And Tools We Have Used During Migration\n<p>Let’s recap the links that have helped in the migration of the content and those that helped to understand the functioning of the REST API and the headless CMS to which you are migrating.</p>\n<h3>WP REST API Documentation Needed</h3>\n<h4>REST API</h4>\n<ul>\n<li><a href=\"https://developer.wordpress.org/rest-api/reference/\">REST API Developer Endpoint Reference</a></li>\n<li><a href=\"https://developer.wordpress.org/rest-api/using-the-rest-api/\">Using the REST API</a></li>\n<li><a href=\"https://developer.wordpress.org/rest-api/using-the-rest-api/discovery/\">Discovering the API and its route</a></li>\n</ul>\n<h4>Schemas</h4>\n<ul>\n<li><a href=\"https://developer.wordpress.org/rest-api/reference/pages/#schema\">Page schema reference</a></li>\n<li><a href=\"https://developer.wordpress.org/rest-api/reference/posts/\">Post schema reference</a></li>\n<li><a href=\"https://developer.wordpress.org/rest-api/reference/categories/\">Categories schema reference</a></li>\n</ul>\n<h3>Migrating To Storyblok</h3>\n<h4>General Info</h4>\n<ul>\n<li><a href=\"https://www.storyblok.com/\">The Storyblok official website</a></li>\n<li><a href=\"https://www.storyblok.com/pricing\">Storyblok Pricing &amp; Plans</a></li>\n</ul>\n<h4>Documentation</h4>\n<ul>\n<li><a href=\"https://www.storyblok.com/docs/guide/essentials/ui\">Understanding the UI</a></li>\n<li><a href=\"https://www.storyblok.com/docs/guide/essentials/content-structures\">Structures of Content</a></li>\n<li><a href=\"https://www.storyblok.com/tp/setting-up-blog-content-structure\">Setting Up the Blog Content Structure in Storyblok</a></li>\n</ul>\n<h4>Global Components</h4>\n<ul>\n<li><a href=\"https://www.storyblok.com/tp/cms-website-header-menu-navigation\">How to build a website header menu navigation with Storyblok</a></li>\n<li><a href=\"https://www.storyblok.com/docs/Guides/storyblok-latest-js\">The Storyblok Bridge V2</a></li>\n</ul>\n<h4>SEO Related</h4>\n<ul>\n<li><a href=\"https://www.storyblok.com/tp/how-to-generate-sitemap-headless-cms\">How to generate a445r Sitemap with a headless CMS?</a></li>\n<li><a href=\"https://www.storyblok.com/apps/seo\">https://www.storyblok.com/apps/seo</a></li>\n</ul>\n<h4>Webhooks And Build Hooks</h4>\n<ul>\n<li><a href=\"https://www.storyblok.com/docs/guide/in-depth/webhooks\">Everything about Webhooks</a></li>\n<li><a href=\"https://www.storyblok.com/docs/Guides/using-storyblok-webhooks\">How to use Storyblok webhooks</a></li>\n<li><a href=\"https://docs.netlify.com/configure-builds/build-hooks/\">Hosting build hooks - Netlify example</a></li>\n</ul>\n<h4>Scripts And Packages</h4>\n<ul>\n<li>Universal JavaScript SDK for Storyblok’s API: <a href=\"https://github.com/storyblok/storyblok-js-client\">https://github.com/storyblok/storyblok-js-client</a></li>\n<li>Migration WP to Storyblok helper: <a href=\"https://github.com/storyblok/wordpress-importer\">https://github.com/storyblok/wordpress-importer</a></li>\n</ul>\n<h3>Jamstack</h3>\n<ul>\n<li><a href=\"https://jamstack.org/\">The Jamstack website</a></li>\n<li><a href=\"https://jamstack.org/generators/\">A List of Static Site Generators for Jamstack Sites</a></li>\n</ul>\nConclusion\n<p>After reading this article you will have what you need to understand why a headless setup will improve your project, how to migrate from your WordPress project to a headless CMS like Storyblok and how to keep improving and extending your project.</p>\n<p>As you have seen, <strong>the possibilities of a headless setup are endless</strong>. After the migration, you will have enormous flexibility to scale your project, improve its performance and SEO, increase the productivity of the development team and stay on top of the latest trends.</p>\n<p>Everyone is starting to migrate and there is more and more content and scripts that make it easier. What are you waiting for to migrate your WordPress?</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"405609d97299bb52d38055f5f78dd2f76f065ff287efb7999594b323c6fa9637","category":"Tech"}