{"title":"Control-Alt-Delete: Bikepacking the AZT – Plan B – Sarah Sturm, Brandon Camarda, & Lydia Tanner","link":"https://theradavist.com/2021/04/control-alt-delete-bikepacking-the-azt-plan-b/?utm_source=rss&utm_medium=rss&utm_campaign=control-alt-delete-bikepacking-the-azt-plan-b","date":1618401658000,"content":"<p>When this year’s last winter storm went big (like, really big) we realized we’d have to adjust our plan to bikepack the Coconino Loop in northern Arizona. We shifted our focus South, to the Arizona Trail segments around Tucson, hoping the lower latitude and elevation would deliver the sunshine we craved.</p>\n<p>Instead, we were greeted in Tucson with heavy rain, so we postponed the trip by a day, hoping it would blow over. When the next day also looked rainy, and kind of snowy too, we lost half our riding crew. My partner Brandon, our friend Sarah and I decided to make a start anyway.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/DSC04690.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We set off from the Picket Post trailhead on the AZT, heading southbound under moody skies. The trailhead’s namesake is a commanding volcanic peak, named for a military encampment that was located at its base in the late 1800’s. US soldiers used to “picket” or bare-bones camp on the flat top, in hopes of spotting any approaching attackers—who in this case were likely Dilzhę́’é (Western Apache) people, fighting the occupation of their mineral-rich and spiritually significant lands.</p>\n<p>Today it’s just another lot where thru-hikers, runners, and mountain bikers pass through. The parking attendant told us a story about a particularly aggressive skunk who had apparently terrorized a camper just the night before—so we kept our eyes peeled as we rode away.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/DSC04671.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The landscape was labyrinthine, and the trail dipped in and out of ocotillos, chollas, and saguaros, climbing gently to reveal new folds and layers over each horizon. The going was rough, but never too steep, and the shifting clouds and intermittent rain kept us constantly adjusting our layers.</p>\n<p>As we climbed higher, we skirted our way onto the rim of a deep canyon, which was studded with towering rock formations. Little oases greeted us in each crease of the trail, hinting at invisible water. Eventually, the cacti gave way to tufts of golden grass, which seemed to glow in the low light.</p>\n<p>We paused at the top of a rise to put our rain layers back on and listen to the distant rumble of thunder. That’s when we noticed that it was rolling in a perfect, slow rhythm: grumble, silence; grumble, silence; like some sort of cosmic inhale and exhale. We held our breath to listen.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/DSC04746.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I looked this up later, because it was so wild, and continued intermittently throughout the afternoon. Maybe we were hearing the echo of a jet passing by? Maybe there was a mine nearby with regular rockslides? A copper mine proposed outside the nearby town of Superior would have tunneled more than a mile deep into protected land—but was temporarily halted just weeks before we started our ride.</p>\n<p>Most of what I can find to explain the sound has to do with the way lightning forks and sound travels, and my guess (hope) is we were experiencing some sort of rare combination of rolling thunder bouncing off canyon walls. Or maybe the earth, like us, was just taking a breather.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/1_15-22.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The real weather held off just long enough for us to pitch our tents in the last of the light. We ate the beef tamales I’d stashed in my pack, and tucked in for the night to listen to the rain on our tent flies.</p>\n<p>Brandon and I cold-soaked our main meals, which we’ve done before, but I usually supplement with a stove for ramen and coffee. Feeling hardcore after a pretty successful run last fall on the Colorado Trail, I had opted to leave my little Pocket Rocket behind this time; and instantly regretted it when we woke up soggy and shivering. I ate my cold oats sitting on a cold rock, feeling way less hardcore than I’d hoped I would. Brandon seemed completely unphased.</p>\n<p>Sarah, who was smart and had hot coffee, had spent the morning looking at the route—and concluded (correctly) that we needed to make way better time. Lollygagging around in the rain the day before had only netted us about 30 miles, and we had a long way to go to get back to civilization. We all resolved to ride a little harder, and set off with gusto towards the water cache we knew was just a few miles ahead.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/DSC04787.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The next segment of the AZT heads into the Tortilla mountains, which looked tame on the map but felt more exposed, with lots of loose switchbacks overlapping ranch and mining roads. We finally had great weather, but we did not make better time, even with some smoother doubletrack at the end of the day. We did, however, find a delightful cache of snacks left by a trail angel—who knew Oreos grew in the desert!?</p>\n<p>We rarely saw people throughout our whole ride, but that afternoon we ran into John Schilling on his northbound AZT300 attempt, which was lucky—he told us he’d just spent a day trudging through 18 inches of snow on Mount Lemmon, where we hoped to be the next day. As we went into our official “site watch” around 6 PM, we were all coming to terms with the fact that it would probably not be possible to summit Lemmon and make it home without taking more time off work.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/DSC04816.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>That night we camped on the first bit of land we could find without a sign explicitly forbidding us to do so. An unassuming doubletrack delivered us to a perfect grassy spot, tucked between some scrappy-looking shrubs and overlooking the vast ranchlands below. Sarah made double dinners while Brandon and I ate spoonfuls of Nutella, all of us feeling lucky we were to be there, despite making hilariously slow progress.</p>\n<p>The next morning we made the call: we would roll 14 miles downhill on the Western Wildlands route, then ride ten miles of highway back into Tucson, and another bunch of bike path miles back to our car. It wasn’t the glorious summit we’d hoped for, but it did seem to fit the theme of the trip. As we enjoyed burritos and (hot!) coffee in a strip mall, dirty bikes propped against a nearby fence, we could look up and see the snow on Mount Lemmon.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/04/DSC04803.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I felt a bit like we’d lost some imaginary battle—but I also felt dang satisfied after three days on such beautiful and rugged terrain. Sarah put it really well in her post about the trip:</p>\n<blockquote><p>“There is only so much you can control, in fact, you ultimately have no control, and that’s the beauty of it all. Surrender and you’ll be free.”</p></blockquote>\n<p><strong><em>For all things AZT related, head to the <a href=\"https://aztrail.org/explore/maps/gps-card/\" target=\"_blank\">Arizona Trail Association</a>.</em></strong></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"405ea606d8c8e05b855b05b4b6632985895f050f240a1087329b325c03717d55","category":"Cycling"}