{"title":"Research on the Method for Solving the Safety Factor of Rock Slope Based on Deformation Monitoring Warning Threshold","link":"https://www.preprints.org/manuscript/202405.1713/v1","date":1716795224000,"content":"In view of the fact that the field monitoring information can more intuitively and accurately reflect the stability state of slopes, this paper takes the warning threshold of slope deformation rate monitoring as the slope stability evaluation standard, and puts forward a method for solving the safety coefficient of rocky slopes. The discrete element method 3DEC, which is suitable for rocky slopes, is selected as the numerical calculation tool, and the convergence criterion of its strength reduction method is modified to the slope deformation rate threshold, and the method is realized by the bifurcation method through its built-in FISH programming language. The results of the classical case show that, by selecting the slope deformation rate threshold in the appropriate interval, the results of this paper's method are very close to those of the finite unit stress method and the limit equilibrium method, which verifies the reliability of this paper's method. Further, the method of this paper is applied to an open-pit mine slope project, based on the slope deformation on-site monitoring data, through the time series prediction method to determine the slope deformation rate warning threshold, using the threshold as an evaluation criterion to solve the slope's coefficient of safety, the calculation results show that: the slope's coefficient of safety in natural working conditions is 1.086, basically stable, suffered from continuous rainfall, the slope body is gradually saturated, the slope's coefficient of safety is reduced to 0.987, the slope's safety is reduced to 0.987. After continuous rainfall and gradual saturation of the slope, the coefficient of safety decreased to 0.987, destabilizing and destroying, which is consistent with the site conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"405f2676fd09dfbcba2416be66f85eaae636e99c43bb15d09389045393eef1a7","category":"Interdisciplinary"}