{"title":"Comparative transcriptome and methylome of polar bears, giant and red pandas reveal diet‐driven adaptive evolution","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13731?af=R","date":1718607600000,"content":"<h2>Abstract</h2>\n<p>Epigenetic regulation plays an important role in the evolution of species adaptations, yet little information is available on the epigenetic mechanisms underlying the adaptive evolution of bamboo-eating in both giant pandas (<i>Ailuropoda melanoleuca</i>) and red pandas (<i>Ailurus fulgens</i>). To investigate the potential contribution of epigenetic to the adaptive evolution of bamboo-eating in giant and red pandas, we performed hepatic comparative transcriptome and methylome analyses between bamboo-eating pandas and carnivorous polar bears (<i>Ursus maritimus</i>). We found that genes involved in carbohydrate, lipid, amino acid, and protein metabolism showed significant differences in methylation and expression levels between the two panda species and polar bears. Clustering analysis of gene expression revealed that giant pandas did not form a sister group with the more closely related polar bears, suggesting that the expression pattern of genes in livers of giant pandas and red pandas have evolved convergently driven by their similar diets. Compared to polar bears, some key genes involved in carbohydrate metabolism and biological oxidation and cholesterol synthesis showed hypomethylation and higher expression in giant and red pandas, while genes involved in fat digestion and absorption, fatty acid metabolism, lysine degradation, resistance to lipid peroxidation and detoxification showed hypermethylation and low expression. Our study elucidates the special nutrient utilization mechanism of giant pandas and red pandas and provides some insights into the molecular mechanism of their adaptive evolution of bamboo feeding. This has important implications for the breeding and conservation of giant pandas and red pandas.</p>","author":"Lei Chen, \nJinnan Ma, \nWencai Xu, \nFujun Shen, \nZhisong Yang, \nChristian Sonne, \nRune Dietz, \nLinzhu Li, \nXiaodie Jie, \nLu Li, \nGuoqiang Yan, \nXiuyue Zhang","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"408017f3c1cac531bc388e94283076e3e53773971dc07461c9076510d755aaf4","category":"Environment"}