{"title":"Effects of seaweed fertilizer application on crops’ yield and quality in field conditions in China-A meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307517","date":1721311200000,"content":"<p>by Baolei Pei, Yunpeng Zhang, Ting Liu, Jian Cao, Huai Ji, Zhenzhu Hu, Xinxin Wu, Feibing Wang, Ying Lu, Ningyi Chen, Junkang Zhou, Boqing Chen, Sa Zhou</p>\r\n\r\nSeaweed fertilizer, formulated primarily with seaweed extract as its main ingredient, has been extensively studied and found to significantly improve nutrient use efficiency, increase crop yield and quality, and enhance soil properties under field conditions. This growing body of evidence shows that seaweed fertilizer is a suitable option for sustainable agriculture in China. However, a comprehensive and quantitative analysis of the overall effects of seaweed fertilizer application in China is lacking. To address this gap, we conducted a meta-analysis of relevant studies on the effects of seaweed fertilizers under field conditions in China with MetaWin and SPSS software. Our analysis examined the effects of seaweed fertilizers on crop yield, quality, and growth under different preparation methods, application techniques, and regions. Our results showed that the application of seaweed fertilizer led to a significant average increase in crop yield of 15.17% compared with the control treatments. Root &amp; tuber crops exhibited the most pronounced response, with a yield boost of 21.19%. Moreover, seaweed fertilizer application significantly improved crop quality, with elevations in the sugar-acid ratio (38.32%) vitamin C (18.07%), starch (19.65%), and protein (11.45%). In addition, plant growth parameters such as height, stem thickness, root weight, and leaf area showed significant enhancement with seaweed fertilizer use. The yield-increasing effect of seaweed fertilizers varied depending on their preparation and use method, climate, and soil of application location. Our study provides fundamental reference data for the efficient and scientific application of seaweed fertilizers in agricultural practices.","author":"Baolei Pei","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"40846fc5d32ad69cb55d26b27646cf035e908ebf92edffddc385f68f2141613d","category":"Interdisciplinary"}