{"title":"Examining the Influence of Renewable Energy Consumption, Technological Innovation, and Export Diversification on Economic Growth: Empirical Insights from E-7 Nations","link":"https://www.preprints.org/manuscript/202406.1692/v1","date":1719268068000,"content":"The present research focuses on the endogenous development theory and investigates the relationship between economic growth (dependent variable) and renewable energy consumption, technological innovation, and export diversification (independent variables) in seven emerging economies known as the E-7. Previous studies have examined these factors individually but have not explored their combined impact on the E-7 economies. Therefore, this study contributes to the existing literature on the effects of renewable energy consumption, technological advancement, and export diversification on economic development. The study analyses the dynamic connection among these variables in seven selected emerging countries: Brazil, China, Indonesia, India, Mexico, Russia, and Turkey. Panel data from 1990 to 2022 is utilized, and various methodologies, including panel cointegration, the PMG-ARDL estimator, and robustness tests such as FMOLS and DOLS, are employed. Empirical inferences are drawn using the Dumitrescu-Hurlin Panel Causality (DHC) test, and the long-run relationships among the variables are validated using the Westerlund residual cointegration tests. The results from the PMG-ARDL estimator show that renewable energy consumption, technological advancement, and export diversification have a significant and positive impact on economic expansion, confirming the validity of the endogenous growth model in the E-7 countries. The control variable of the financial sector has a positive but insignificant effect on economic growth, while trade openness has a negative and significant effect. The DHC test results indicate a neutral feedback effect of renewable energy consumption on economic growth. The findings also reveal a unidirectional causal relationship between technological innovation and economic growth. Overall, these findings provide valuable insights for economic policymakers in the E-7 countries. By removing barriers to renewable energy consumption, technological innovation, and export diversification, policymakers can promote sustainable economic development.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"408c0a0134c0eb5b9ff1e633a5622748ba447e06334c28c4bf4564de9ee33e1a","category":"Interdisciplinary"}