{"title":"Uncertainty quantification and sensitivity analysis of neuron models with ion concentration dynamics","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303822","date":1716300000000,"content":"<p>by Letizia Signorelli, Andrea Manzoni, Marte J. Sætra</p>\r\n\r\nThis paper provides a comprehensive and computationally efficient case study for uncertainty quantification (UQ) and global sensitivity analysis (GSA) in a neuron model incorporating ion concentration dynamics. We address how challenges with UQ and GSA in this context can be approached and solved, including challenges related to computational cost, parameters affecting the system’s resting state, and the presence of both fast and slow dynamics. Specifically, we analyze the electrodiffusive neuron-extracellular-glia (edNEG) model, which captures electrical potentials, ion concentrations (Na<sup>+</sup>, K<sup>+</sup>, Ca<sup>2+</sup>, and Cl<sup>−</sup>), and volume changes across six compartments. Our methodology includes a UQ procedure assessing the model’s reliability and susceptibility to input uncertainty and a variance-based GSA identifying the most influential input parameters. To mitigate computational costs, we employ surrogate modeling techniques, optimized using efficient numerical integration methods. We propose a strategy for isolating parameters affecting the resting state and analyze the edNEG model dynamics under both physiological and pathological conditions. The influence of uncertain parameters on model outputs, particularly during spiking dynamics, is systematically explored. Rapid dynamics of membrane potentials necessitate a focus on informative spiking features, while slower variations in ion concentrations allow a meaningful study at each time point. Our study offers valuable guidelines for future UQ and GSA investigations on neuron models with ion concentration dynamics, contributing to the broader application of such models in computational neuroscience.","author":"Letizia Signorelli","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"408fa07f26179477d4e84094c68269dc364154637fba92ad324b2357edb18438","category":"Interdisciplinary"}