{"title":"Judge in Apple v. Epic Games Case Wants In-Person Trial Starting on May 3","link":"https://www.macrumors.com/2021/03/01/epic-vs-apple-in-person-trial-may-3/","date":1614622284000,"content":"Lawyers for <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> and Apple today participated in a <a href=\"https://youtu.be/yxJAOqUFhcY\">management conference</a> with Judge Yvonne Gonzalez to hammer out the details of an upcoming bench trial, which is set to take place on May 3.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/fortnite-apple-logo-2.5.jpg\" alt=\"\" width=\"1280\" height=\"720\" class=\"aligncenter size-full wp-image-756080\" />\r\n<br/>\r\nApple was aiming to get the trial delayed until a later date, but the judge denied the request and said that it will happen in May, which is what &zwnj;Epic Games&zwnj; was pushing for.\r\n<br/>\r\n\r\n<br/>\r\nJudge Gonzalez is planning to hold an in-person trial that will require all witnesses to travel to Northern California to answer questions before the court and the judge. She believes that the case is significant enough that the court should hear it in person, with witnesses in the case less likely to lie when sworn in in a physical courtroom.\r\n<br/>\r\n\r\n<br/>\r\nHealth considerations will be taken into account for witnesses that aren't able to travel to California, but the court will look into people who say they can't visit the court in person.\r\n<br/>\r\n\r\n<br/>\r\nThe judge said that the people involved and the companies involved have the available resources to quarantine for two weeks after the trial. The court plans to put measures in place to keep participants safe, including a limited number of people in the courtroom. Witnesses will be positioned far from the attorneys in the case, with distance between parties, and enough space will be given that witnesses can speak clearly without masks.\r\n<br/>\r\n\r\n<br/>\r\nBased on the COVID numbers in May, the in-person trial could be set aside, but the case will go forward in May no matter what, even if it is held entirely over Zoom. The judge is pushing for a two to three week trial, while &zwnj;Epic Games&zwnj; wants it to last four to five weeks, with the exact length to be determined later when all of the case details are ironed out.\r\n<br/>\r\n\r\n<br/>\r\nThe Epic vs. Apple trial will delve into <a href=\"https://www.macrumors.com/2020/08/13/apple-removes-fortnite-from-app-store/\">Epic's accusation</a> that Apple is a \"behemoth seeking to control markets, block competition, and stifle innovation\" by imposing \"anti-competitive restraints\" against <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> developers and employing \"monopolistic practices in markets.\"\r\n<br/>\r\n\r\n<br/>\r\n&zwnj;Epic Games&zwnj; will argue that the 30 percent cut that Apple takes from apps is \"oppressive\" as is the rule that requires developers to use in-app purchases. Apple lowered the 30 percent fee to 15 percent for developers earning under &#36;1 million, but that does not apply to &zwnj;Epic Games&zwnj;.\r\n<br/>\r\n\r\n<br/>\r\nApple will attempt to prove that its &zwnj;App Store&zwnj; prices are fair and in line with <a href=\"https://www.macrumors.com/2021/02/25/valve-apple-data-request-for-epic-games-case/\">other competitors</a> in the market, and that its &zwnj;App Store&zwnj; policies offer important protections for consumers.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/antitrust/\">antitrust</a>, <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, <a href=\"https://www.macrumors.com/guide/fortnite/\">Fortnite</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/01/epic-vs-apple-in-person-trial-may-3/\">Judge in Apple v. Epic Games Case Wants In-Person Trial Starting on May 3</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/judge-in-apple-v-epic-games-case-wants-in-person-trial-starting-on-may-3.2286674/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=lXksXmbyYQ8:NFB3-6ITd5k:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=lXksXmbyYQ8:NFB3-6ITd5k:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/lXksXmbyYQ8\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"40945933065933c0f698c3add7809856b4a5f4278ed4cf18fdaec090470d34ae","category":"Apple"}