{"title":"สร้างจริงขายจริง Archax หุ่นยนต์ขับได้สไตล์อนิเมะ ขายตัวละ 100 ล้านบาท","link":"https://www.blognone.com/node/136027","date":1696236924000,"content":"<div><div><div><p>บริษัทของญี่ปุ่นนาม <strong>Tsubame Industries</strong> ได้เปิดให้สั่งจองหุ่นยนต์รุ่น <strong>Archax</strong> ซึ่งเป็นหุ่นยนต์ที่สามารถขึ้นไปขับจริงประหนึ่งหลุดมาจากอนิเมะ โดยจะใช้เวลาการผลิตอยู่ที่ 12-18 เดือน ราคาตัวละ 400 ล้านเยน หรือคิดเป็นเงินไทยประมาณ 100 ล้านบาท</p>\n<p>Tsubame Industries เป็นบริษัทที่ถูกก่อตั้งในปี 2021 โดยมีวัตถุประสงค์คือการเปลี่ยนของล้ำ ๆ ที่อยู่ในสื่อบันเทิงไซไฟต่าง ๆ ให้กลายเป็นของจริง ซึ่งในวงการสื่อบันเทิงไซไฟของญี่ปุ่นไม่มีอะไรที่จะดังไปกว่าอนิเมะหุ่นยนต์ และนั่นจึงทำให้ Tsubame สร้าง และประกาศวางจำหน่าย Archax อย่างเป็นทางการในวันนี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ad0074400847459c5b19c9c58bbbfde9.jpg\" /></p>\n<p>Archax เป็นหุ่นยนต์ตัวแรกของ Tsubame มี 4 ขา, ห้องนักบินที่ปิดสนิท และ 2 โหมดการควบคุมได้แก่ Robot Mode ที่มีความสูงอยู่ที่ 4.5 เมตร และ Vehicle Mode ที่จะหดลงมาเหลือ 3.9 เมตร</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ad2dd696bb5b5f4e4f89556dc286fc22.jpg\" /></p>\n<p>ตัวหุ่นยนต์ควบคุมด้วยจอยสติ๊ก และแป้นเหยียบ ที่มีลักษณะคล้ายกับในอนิเมะหุ่นยนต์ ภายในหุ่นจะมีเสียงพูดว่า Hatch closed และ Main switch on ในช่วงที่เปิดเครื่อง และเข้าไปนั่ง ซึ่งในห้องนักบินจะไม่มีหน้าต่างใด ๆ  แต่ตัวของ Archax มีกล้อง 9 ตัว ซึ่งจะแสดงผลบนจอภาพ 4 จอในห้องคนขับ เพื่อถ่ายทอดข้อมูลจากด้านนอกให้คนขับรับรู้</p>\n<p>การเคลื่อนที่ของ Archax จะใช้ล้อที่ฐานของขาทั้ง 4 ข้าง โดยคู่หลังเป็นล้อขับเคลื่อน ส่วนคู่หน้าใช้สำหรับเลี้ยว โดยมีความเร็วสูงสุดอยู่ที่ 10 กิโลเมตรต่อชั่วโมง และมีน้ำหนัก 3.5 เมตริกตัน ตรงจุดนี้ถ้าใครคาดหวังความพริ้วแบบใน Gundam หรือ Armored Core ก็คงต้องผิดหวัง นอกจากนี้ทาง Tsubame บอกว่า Archax สามารถควบคุมจากระยะไกลได้ด้วย</p>\n<p>Archax มีจุดเชื่อมต่อทั้งหมด 26 จุดบนโครงเหล็ก/อลูมิเนียมอัลลอยด์ โดยแผงตัวถังทำจากพลาสติก FRP และ ASA ใช้พลังงานจากแบตเตอรี่ ทำให้เป็นมิตรกับสิ่งแวดล้อมมากกว่าหุ่นยนต์ขนาดยักษ์ที่ทำงานด้วยน้ำมันเบนซิน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/53148ee80a5e112ca044a44aff5f21be.jpg\" /></p>\n<p>Archax มีระยะเวลาการผลิตอยู่ที่ 12-18 เดือน ในราคา 400 ล้านเยน หรือ 100 ล้านบาทต่อตัว ทั้งหมดนี้รวมค่าบำรุงรักษาหรือซ่อมแซมเป็นเวลา 1 ปีที่ Tsubame คุ้มครองโดยไม่มีค่าใช้จ่ายเพิ่มเติม</p>\n<p>Tsubame ตั้งเป้าจะส่งมอบ Archax จำนวน 5 ตัวในช่วงเริ่มต้น โดยสันนิษฐานว่าจะใช้ระบบลอตเตอรี(สุ่ม) หากได้รับคำสั่งซื้อเข้ามามาก แต่เหมือนจะไม่มีช่องทางการสั่งซื้อออนไลน์อย่างเป็นทางการ ดังนั้นหากผู้อ่านต้องการจอง คงมีแต่ต้องส่งอีเมลถึงบริษัทโดยตรงที่ info@tsubame-hi.com</p>\n<p>ที่มา - <a href=\"https://soranews24.com/2023/09/28/real-life-pilotable-anime-style-robots-now-on-sale-in-japan%e3%80%90video%e3%80%91/\">Sora News 24</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tsubame-industries\">Tsubame Industries</a></div><div><a href=\"/topics/robotics\">Robotics</a></div><div><a href=\"/topics/robot\">Robot</a></div><div><a href=\"/topics/anime\">Anime</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4099a1d01faed9d2a2077f9e16231e5d56c24a58059d7f8fe66db1c89ec142f8","category":"Thai"}