{"title":"Empirical Evaluation and Analysis of YOLO Models in Smart Transportation","link":"https://www.preprints.org/manuscript/202409.2125/v1","date":1727350062000,"content":"You Only Look One (YOLO) and its variants have emerged as the most popular real-time object detection algorithms.  They have been widely used in real-time smart transportation applications due to their low-latency detection and high accuracy. However, because of the diverse characteristics of YOLO models,\nchoosing selecting the optimal model according to various applications and environments in smart transportation is critical. In this article, we conduct an empirical evaluation and analysis study for most YOLO versions to assess their performance in smart transportation. To achieve this, we first measure the average precision of YOLO models across multiple datasets (e.g., COCO, PASCAL VOC).  Second, we analyze the performance of YOLO models on multiple object categories within each dataset, focusing on classes relevant to road transportation such as those commonly used in smart transportation applications. \nThird, multiple intersection-over-union (IoU) thresholds are considered in our performance measurement and analysis. By examining the performance of various YOLO models across datasets, IoU thresholds, and object classes, we make six observations on these three aspects while aiming to identify optimal models for road transportation scenarios.  Thus, YOLOv5 and YOLOv8 outperform other models in all three aspects due to their novel performance features.  For instance, YOLOv5 achieves stable performance thanks to its cross-stage partial darknet-53 (CSPDarknet53) backbone, auto-anchor mechanism, and efficient loss functions  including IoU loss, complete IoU loss, focal loss, gradient harmonizing mechanism loss.  Similarly, YOLOv8 outperforms others with its upgraded CSPDarknet53 backbone, anchor-free mechanism, and efficient loss functions like complete IoU loss and distribution focal loss.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"40a079f05dd5835f72e03b6d5ed7562fb2b437ae859cc5308b73974e2935b6d9","category":"Interdisciplinary"}