{"title":"Unlike Apple Watch, Google Will Not Repair Broken Pixel Watches","link":"https://www.macrumors.com/2023/09/17/google-will-not-repair-pixel-watches/","date":1694948623000,"content":"Google currently offers no official repair procedure for the Pixel Watch, meaning that broken devices simply become e-waste (via <a href=\"https://www.theverge.com/23874281/google-pixel-watch-cracks-no-repairs-warranty\"><em>The Verge</em></a>).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/10/pixel-watch-vs-apple-watch-4.jpg\" alt width=\"2560\" height=\"1440\" />\r<br />\nThis information was recently confirmed by Google spokesperson Bridget Starkey to <em>The Verge</em>. Starkey stated, \"At this moment, we don't have any repair option for the Google Pixel Watch. If your watch is damaged, you can contact the Google Pixel Watch Customer Support Team to check your replacement options.\" Google Support chats add that the company \"doesn't have any repair centers or service centers\" for the Pixel Watch.\r<br />\n\r<br />\nThe device's lack of repair options stands in contrast to Google's approach with its Pixel phones, where it partners with iFixit to ensure that spare parts and repair guides are accessible for consumers looking to mend their handsets. An independent <a href=\"https://www.ifixit.com/Guide/Google+Pixel+Watch+Screen+Replacement/160350\">iFixit guide</a> details how to replace the Pixel Watch screen, proving that it is possible to do so. Yet users who wish to undertake such a repair are faced with the challenge of finding a replacement part. Given the Pixel Watch's limited sales compared to mainstream rivals like the Apple Watch, obtaining damaged \"donor hardware\" with the required intact part remains a difficult proposition.\r<br />\n\r<br />\nBy comparison, Apple offers repair solutions for the Apple Watch, albeit at different costs depending on the availability of <a href=\"https://www.macrumors.com/guide/applecare/\">AppleCare</a>+. For Apple Watch owners without ‌AppleCare‌+, the company cites a flat $299 estimate for an Apple Watch Series 8 and $499 for an Apple Watch Ultra. With ‌AppleCare‌+, this drops to $69 for the Apple Watch Series 8 and $79 for the Apple Watch Ultra, not including the cost of ‌AppleCare‌ itself.\r<br />\n\r<br />\nThe Pixel Watch's screen is particularly vulnerable due to its design, featuring a large glass hemisphere that can easily crack upon impact. Google's hardware warranty does not cover damage resulting from accidents, such as drops or impacts, leaving users without many options other than to simply replace the entire device with a new one. The Pixel Watch 2 is rumored to feature almost exactly the same design.<div>Tags: <a href=\"https://www.macrumors.com/guide/google/\">Google</a>, <a href=\"https://www.macrumors.com/guide/google-pixel/\">Google Pixel</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/17/google-will-not-repair-pixel-watches/\">Unlike Apple Watch, Google Will Not Repair Broken Pixel Watches</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/unlike-apple-watch-google-will-not-repair-broken-pixel-watches.2402480/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"40a7d4551173d2786f05e15c4abd2714201864167f407537668692a433f71366","category":"Apple"}