{"title":"NanoMGT: Marker gene typing of low complexity mono-species metagenomic samples using noisy long reads","link":"https://academic.oup.com/biomethods/article/doi/10.1093/biomethods/bpae057/7728470?rss=1","date":1722902400000,"content":"<span><div>Abstract</div>Rapid advancements in sequencing technologies have led to significant progress in microbial genomics, yet challenges persist in accurately identifying microbial strain diversity in metagenomic samples, especially when working with noisy long-read data from platforms like Oxford Nanopore Technologies (ONT). In this article, we introduce NanoMGT, a tool designed to enhance marker gene typing in low-complexity mono-species samples, leveraging the unique properties of long reads. NanoMGT excels in its ability to accurately identify mutations amidst high error rates, ensuring the reliable detection of multiple strain-specific marker genes. Our tool implements a novel scoring system that rewards mutations co-occurring across different reads and penalizes densely grouped, likely erroneous variants, thereby achieving a good balance between sensitivity and precision. A comparative evaluation of NanoMGT, using a simulated multi-strain sample of seven bacterial species, demonstrated superior performance relative to existing tools and the advantages of using a threshold-based filtering approach to calling minority variants in ONT’s sequencing data. NanoMGT’s potential as a post-binning tool in metagenomic pipelines is particularly notable, enabling researchers to more accurately determine specific alleles and understand strain diversity in microbial communities. Our findings have significant implications for clinical diagnostics, environmental microbiology, and the broader field of genomics. The findings offer a reliable and efficient approach to marker gene typing in complex metagenomic samples.</span>","author":"","siteTitle":"Biology Methods and Protocols Current Issue","siteHash":"69c994dba77628d461517adf354c299799d03c68fbf0494d0a5619d40a95f351","entryHash":"40b1bf679d215fd97a8ff4e6b91500dcdefbe85f55bbdbe37cfa7e3eb193707f","category":"Environment"}