{"title":"Interpretable machine learning-based individual analysis of acute kidney injury in immune checkpoint inhibitor therapy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0298673","date":1710856800000,"content":"<p>by Minoru Sakuragi, Eiichiro Uchino, Noriaki Sato, Takeshi Matsubara, Akihiko Ueda, Yohei Mineharu, Ryosuke Kojima, Motoko Yanagita, Yasushi Okuno</p>\r\nBackground <p>Acute kidney injury (AKI) is a critical complication of immune checkpoint inhibitor therapy. Since the etiology of AKI in patients undergoing cancer therapy varies, clarifying underlying causes in individual cases is critical for optimal cancer treatment. Although it is essential to individually analyze immune checkpoint inhibitor-treated patients for underlying pathologies for each AKI episode, these analyses have not been realized. Herein, we aimed to individually clarify the underlying causes of AKI in immune checkpoint inhibitor-treated patients using a new clustering approach with Shapley Additive exPlanations (SHAP).</p> Methods <p>We developed a gradient-boosting decision tree-based machine learning model continuously predicting AKI within 7 days, using the medical records of 616 immune checkpoint inhibitor-treated patients. The temporal changes in individual predictive reasoning in AKI prediction models represented the key features contributing to each AKI prediction and clustered AKI patients based on the features with high predictive contribution quantified in time series by SHAP. We searched for common clinical backgrounds of AKI patients in each cluster, compared with annotation by three nephrologists.</p> Results <p>One hundred and twelve patients (18.2%) had at least one AKI episode. They were clustered per the key feature, and their SHAP value patterns, and the nephrologists assessed the clusters’ clinical relevance. Receiver operating characteristic analysis revealed that the area under the curve was 0.880. Patients with AKI were categorized into four clusters with significant prognostic differences (p = 0.010). The leading causes of AKI for each cluster, such as hypovolemia, drug-related, and cancer cachexia, were all clinically interpretable, which conventional approaches cannot obtain.</p> Conclusion <p>Our results suggest that the clustering method of individual predictive reasoning in machine learning models can be applied to infer clinically critical factors for developing each episode of AKI among patients with multiple AKI risk factors, such as immune checkpoint inhibitor-treated patients.</p>","author":"Minoru Sakuragi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"40c46cc6f702533bc5035c19e1d70c9e825d87ff4100d6716c20037c9188aaa1","category":"Interdisciplinary"}