{"title":"Multi-Cloud and Hybrid Threat Protection with Sumo Logic Cloud SIEM Powered by AWS","link":"https://aws.amazon.com/blogs/aws/hybrid-threat-protection-with-sumo-logic-cloud-siem-powered-by-aws/","date":1626388236000,"content":"<p>IT security teams need to have a real-time understanding of what’s happening with their infrastructure and applications. They need to be able to find and correlate data in this continuous flood of information to identify unexpected behaviors or patterns that can lead to a security breach.</p> \n<p>To simplify and automate this process, many solutions have been implemented over the years. For example:</p> \n<ul> \n <li>Security information management (SIM) systems collect data such as log files into a central repository for analysis.</li> \n <li>Security event management (SEM) platforms simplify data inspection and the interpretation of logs or events.</li> \n</ul> \n<p>Many years ago these two approaches were merged to address both information analysis and interpretation of events. These security information and event management (SIEM) platforms provide real-time analysis of security alerts generated by applications, network hardware, and domain specific security tools such as firewalls and endpoint protection tools).</p> \n<p>Today, I’d like to introduce a solution created by one of our partners: <a href=\"https://www.sumologic.com/blog/cloud-siem-powered-by-aws/\">Sumo Logic Cloud SIEM powered by AWS</a>. Sumo Logic Cloud SIEM provides deep security analytics and contextualized threat data across multi-cloud and hybrid environments to reduce the time to detect and respond to threats. You can use this solution to quickly detect and respond to the higher-priority issues, including malicious activities that negatively impact your business or brand. The solution comes with more than 300 out-of-the-box integrations, including key AWS services, and can help reduce time and effort required to conduct <a href=\"https://aws.amazon.com/compliance/\">compliance</a> audits for regulations such as <a href=\"https://aws.amazon.com/compliance/pci-dss-level-1-faqs/\">PCI</a> and <a href=\"https://aws.amazon.com/compliance/hipaa-compliance/\">HIPAA</a>.</p> \n<p>Sumo Logic Cloud SIEM is <a href=\"https://aws.amazon.com/marketplace/pp/prodview-o622lpl6biu6s\">available in AWS Marketplace and you can use a free trial to evaluate the solution</a>. Before having a look at how this works in practice, let’s see how it’s being used.</p> \n<p><span><strong>Customer Case Study – Medidata<br /> </strong></span>I had the chance to meet a very interesting customer to talk about how they use Sumo Logic Cloud SIEM. <a href=\"https://www.linkedin.com/in/scottalansumner/\">Scott Sumner</a> is the VP and CISO at <strong><a href=\"https://www.medidata.com/\">Medidata</a></strong>, a company that is redefining what’s possible in clinical trials. Medidata is processing patient data for clinical trials of the Moderna and Johnson &amp; Johnson COVID-19 vaccines, so you can see why security is a priority for them. With such critical workloads, the company must keep the trust of the people participating in those trials.</p> \n<p>Scott told me, “There is an old saying: If you can’t measure it, you can’t manage it.” In fact, when he joined Medidata in 2015, one of the first things Scott did was to implement a SIEM. Medidata has been using Sumo Logic for more than five years now. They appreciate that it’s a cloud-native solution, and that has made it easier for them to follow the evolution of the tool over the years.</p> \n<p>“Not having transparency in the environment you process data is not good for security professionals.” Scott wanted his team to be able to respond quickly and, to do so, they needed to be able to look at a single screen that displays all IP calls, network flows, and any relevant information. For example, Medidata has very aggressive checks for security scans and any kind of external access. To do so, they have to look not just at the perimeter, but at the entire environment. Sumo Logic Cloud SIEM allows them to react without breaking anything in their corporate environment, including the resources they have in more than 45 AWS accounts.</p> \n<p>“One of the metrics that is floated around by security specialists is that you have up to five hours to respond to a tentative intrusion,” Scott says. “With Sumo Logic Cloud SIEM, we can match that time aggressively, and most of the times we respond within five minutes.” The ability to respond quickly allows Medidata to keep patient trust. This is very important for them, because delaying a clinical trial can affect people’s health.</p> \n<p>Medidata security response is managed by a global team through three levels. Level 1 is covered by a partner who is empowered to block simple attacks. For the next level of escalation, Level 2, Medidata has a team in each region. Beyond that there is Level 3: a hardcore team of forensics examiners distributed across the US, Europe, and Asia who deal with more complicated attacks.</p> \n<p>Availability is also important to Medidata. In addition to providing the Cloud SIEM functionality, Sumo Logic helps them monitor availability issues, such as web server failover, and very quickly figure out possible problems as they happen. Interestingly, they use Sumo Logic to better understand how applications talk with each other. These different use cases don’t complicate their setup because the security and application teams are segregated and use Sumo Logic as a single platform to share information seamlessly between the two teams when needed.</p> \n<p>I asked Scott Sumner if Medidata was affected by the move to remote work in 2020 due to the COVID-19 pandemic. It’s an important topic for them because at that time Medidata was already involved in clinical trials to fight the pandemic. “We were a mobile environment anyway. A significant part of the company was mobile before. So, we were ready and not being impacted much by working remotely. All our tools are remote, and that helped a lot. Not sure we’d done it easily with an on-premises solution.”</p> \n<p>Now, let’s see how this solution works in practice.</p> \n<p><span><strong>Setting Up Sumo Logic Cloud SIEM<br /> </strong></span>In <a href=\"https://aws.amazon.com/marketplace\">AWS Marketplace</a> I search for “Sumo Logic Cloud SIEM” and look at the <a href=\"https://aws.amazon.com/marketplace/pp/prodview-o622lpl6biu6s\">product page</a>. I can either subscribe or start the one-month <strong>free trial</strong>. The free trial includes 1GB of log ingest for security and observability. There is no automatic conversion to paid offer when the free trials expires. After the free trial I have the option to either buy Sumo Logic Cloud SIEM from AWS Marketplace or remain as a free user. I create and accept the contract and set up my Sumo Logic account.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-free-trial.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-free-trial-1024x568.png\" /></a></p> \n<p>In the setup, I choose the Sumo Logic deployment region to use. The Sumo Logic documentation provides <a href=\"https://help.sumologic.com/APIs/General-API-Information/Sumo-Logic-Endpoints-and-Firewall-Security#aws%C2%A0region-by-sumo-deployment\">a table that describes the AWS Regions used by each Sumo Logic deployment</a>. I need this information later when I set up the integration between AWS security services and Sumo Logic Cloud SIEM. For now, I select US2, which corresponds to the US West (Oregon) Region in AWS.</p> \n<p>When my Sumo Logic account is ready, I use the <a href=\"https://aws.amazon.com/quickstart/architecture/sumo-logic/\">Sumo Logic Security Integrations on AWS Quick Start</a> to deploy the required integrations in my AWS account. You’ll find the source files used by this Quick Start in <a href=\"https://fwd.aws/KEvGk\">this GitHub repository</a>. I open the deployment guide and follow along.</p> \n<p>This architecture diagram shows the environment deployed by this Quick Start:</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/16/sumo-logic-security-integration-architecture-on-aws.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/16/sumo-logic-security-integration-architecture-on-aws.png\" /></a></p> \n<p>Following the steps in the deployment guide, I create an access key and access ID in my Sumo Logic account, and write down my organization ID. Then, I launch the Quick Start to deploy the integrations.</p> \n<p>The Quick Start uses an <a href=\"https://aws.amazon.com/cloudformation/\">AWS CloudFormation</a> template to create a stack. First, I check that I am in the right AWS Region. I use US West (Oregon) because I am using US2 with Sumo Logic. Then, I leave all default values and choose <strong>Next</strong>. In the parameters, I select US2 as my Sumo Logic deployment region and enter my Sumo Logic access ID, access key, and organization ID.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-parameters.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-parameters-1024x529.png\" /></a></p> \n<p>After that, I enable and configure the integrations with AWS security services and tools such as <a href=\"https://aws.amazon.com/cloudtrail/\">AWS CloudTrail</a>, <a href=\"https://aws.amazon.com/guardduty/\">Amazon GuardDuty</a>, <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/flow-logs.html\">VPC Flow Logs</a>, and <a href=\"https://aws.amazon.com/config/\">AWS Config</a>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-connectors.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-connectors-1024x444.png\" /></a></p> \n<p>If you have a delegate administrator with GuardDuty, you can <a href=\"https://docs.aws.amazon.com/guardduty/latest/ug/guardduty_organizations.html\">enabled multiple member accounts as long as they are a part of the same AWS organization</a>. With that, all findings from member accounts are vended to the delegate administrator and then to Sumo Logic Cloud SIEM through the <a href=\"https://serverlessrepo.aws.amazon.com/applications/arn:aws:serverlessrepo:us-east-1:956882708938:applications~sumologic-guardduty-events-processor\">GuardDuty events processor</a>.</p> \n<p>In the next step, I leave the stack options to their default values. I review the configuration and acknowledge the additional capabilities required by this stack (such as the creation of IAM resources) and then choose <strong>Create stack</strong>.</p> \n<p>When the stack creation is complete, the integration with Sumo Logic Cloud SIEM is ready. If I had a hybrid architecture, I could connect those resources for a single point of view and analysis of my security events.</p> \n<p><span><strong>Using Sumo Logic Cloud SIEM<br /> </strong></span>To see how the integration with AWS security services works, and how security events are handled by the SIEM, I use the <a href=\"https://github.com/awslabs/amazon-guardduty-tester\">amazon-guardduty-tester</a> open-source scripts to generate security findings.</p> \n<p>First, I use the included CloudFormation template to launch an <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> instance in an <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Cloud (VPC)</a> private subnet. The stack also includes a <a href=\"https://en.wikipedia.org/wiki/Bastion_host\">bastion host</a> to provide external access. When the stack has been created, I write down the IP addresses of the two instances from the stack output.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-tester.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-tester-1024x347.png\" /></a></p> \n<p>Then, I use SSH to connect to the EC2 instance in the private subnet through the bastion host. There are easy-to-follow instructions in the <a href=\"https://github.com/awslabs/amazon-guardduty-tester/blob/master/README.md\">README</a> file. I use the <code>guardduty_tester.sh</code> script, installed in the instance by CloudFormation, to generate security findings for my AWS account.</p> \n<pre><code>$ ./guardduty_tester.sh</code></pre> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-findings.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-findings-1024x568.png\" /></a></p> \n<p>GuardDuty processes these findings and the events are sent to Sumo Logic through the integration I just set up. In the Sumo Logic GuardDuty dashboard, I see the threats ready to be analyzed and addressed.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-console.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/06/17/sumo-logic-siem-console-1024x595.png\" /></a></p> \n<p><span><strong>Availability and Pricing<br /> </strong></span>Sumo Logic Cloud SIEM powered by AWS is a multi-tenant Software as a Service (SaaS) <a href=\"https://aws.amazon.com/marketplace/pp/prodview-o622lpl6biu6s\">available in AWS Marketplace</a> that ingests data over <a href=\"https://en.wikipedia.org/wiki/HTTPS\">HTTPS</a>/<a href=\"https://en.wikipedia.org/wiki/Transport_Layer_Security\">TLS</a> 1.2 on the public internet. You can connect data from any AWS Region and from multi-cloud and hybrid architectures for a single point of view of your security events.</p> \n<p><a href=\"https://aws.amazon.com/marketplace/pp/prodview-o622lpl6biu6s\"><strong>Start a free trial of Sumo Logic Cloud SIEM and see how it can help your security team.</strong></a></p> \n<p><strong><a href=\"https://www.sumologic.com/blog/accelerate-hybrid-threat-protection-cloud-siem/\">Read the Sumo Logic team’s blog post here for more information on the service.</a> </strong></p> \n<p>— <a href=\"https://twitter.com/danilop\">Danilo</a></p>","author":"Danilo Poccia","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"40c6c7057d6d1169923758ebe83ebd0994b3401f1301ab8a988c2fe51800d673","category":"Tech"}