{"title":"Study protocol for the development of a real-time interface showing the availability of breast and cervical cancer services in Ghana","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312150","date":1729173600000,"content":"<p>by Edward Kofi Sutherland, Justin Dean Smith, Millicent Ofori-Boateng, Sandra Boatemaa Kushitor, Hammond Nii Sarkwah, Bernard Agyei Kwanin, Katherine Ann Sward, Ramkiran Gouripeddi, Stephen Oluaku Manortey, Matthew Dean Price, Anne Rositch, Wil Ngwa, Stephen Craig Alder, Corrine Joshu, Raymond Richard Price</p>\r\nBackground <p>The 5-year survival rates for breast and cervical cancers in Ghana are low in comparison to rates in developed countries. This striking disparity is attributed to numerous factors, including limited access and navigability to appropriate services. A one-time cross-sectional, hospital-based survey was performed by the University of Utah in collaboration with Ghana Health Services (GHS) and Health Facilities Regulatory Agency (HeFRA) from November, 2020 to October, 2021 so as to determine existing hospital-based breast and cervical cancer care services capacity and their geographic availability nationwide. This related information remains dynamic in nature and time. The current project employs a public-academic implementation science and research configuration to explore and develop a real-time interface (RTIF) showing the availability of breast and cervical cancer care services at hospital facilities in-country so as to anchor up-to-date data products for the government, private-sector, and patient-centric consumption.</p> Methods and analysis <p>Multiple methods will be employed to achieve the study objectives between December 2023 to November 2024. The first three objectives shall focus on contextual, needs, and feasibility assessments guided by the domains and constructs within the updated Consolidated Framework for Implementation Research (CFIR) during coding and thematic qualitative analysis. Using purposive sampling, breast and cervical cancer care service stakeholders shall be identified for individual in-depth interviews. The fourth objective will involve creating the RTIF prototype and piloting it in the Eastern Region of Ghana. The final and fifth objective shall employ the systems usability scale (SUS) amongst ten randomly selected individual stakeholders to assess the technical functionality of the interface. A nationwide scale-up shall follow this.</p>","author":"Edward Kofi Sutherland","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"40c7b0e91caa829c3af4d9e91c417387d7389c68d5720dc7dd5b24d421b8fd91","category":"Interdisciplinary"}