{"title":"Rationale and Design of the KOSovan Acute Coronary Syndrome (KOS-ACS) Registry","link":"https://www.preprints.org/manuscript/202404.0031/v1","date":1711961977000,"content":"The KOSovan Acute Coronary Syndrome (KOS-ACS) Registry is established as a prospective, continuous, nationwide, web-based registry that is operated online. The KOS-ACS registry is designed with the following objectives: 1) to obtain data on the demographic, clinical, and laboratory characteristics of ACS patients treated in Kosovo; 2) to create a national database with information on health care in ACS patients treated in Kosovo; 3) to identify the national features of associations between ACS characteristics and clinical outcomes, including mortality, complications, length of hospital stay, and quality of clinical care; and 4) to propose a practical guide for improving the quality and efficiency of ACS treatment in Kosovo. The Kosovo Society of Cardiology and University of Prishtina will be responsible for the development of the KOS-ACS registry and centralized data analysis at the national level. The KOS-ACS Registry will enroll all patients admitted, at any of the registered clinical centers, with the diagnosis of ACS and who will be clinically managed at any of the Kosovo hospitals. Data on patient demographics, clinical characteristics, previous and hospital drug treatment, and reperfusion therapy will be collected. The type of ACS (Unstable angina, NSTEMI or STEMI) will also be clearly defined. The time from first medical contact to balloon inflation (FMC-to-balloon) and door-to-ballon time will be registered. In-hospital death and complications will be registered. Data on post-hospital primary outcome (MACE: cardiac death, all-cause mortality, hospitalization, stroke, need for coronary revascularization) of patients, at 30 days and 1 year, will be included in the Registry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"40d5eb96809e58750aed45f24eadea91c076b71fb3c03e4a6c27b0c5492d6752","category":"Interdisciplinary"}