{"title":"macOS 12: Everything we know (and want)","link":"https://www.macworld.com/article/342964/macos-12-features-appearance-apps-control-center-widgets-wishlist-release-beta.html","date":1619339400000,"content":"\n<div>\n<section><div></div></section><p>Every year since 2011, Apple has released a new major version of macOS, so we know one is coming this year. But since macOS Big Sur 11 was such a big change for Mac users, Apple may very well decide that the next version (<strong><a href=\"https://www.macworld.com/article/342024/after-20-years-of-os-x-macos-11-might-be-gone-after-big-sur.html\">most likely named macOS 12</a></strong>) will mostly focus on fixes and minor feature updates—not unlike Snow Leopard, Mountain Lion and High Sierra, . That doesn’t affect our macOS 12 wishlist, though, except maybe that it gives us a better understanding as to why our wishes may not be granted this year. So when macOS 12 is revealed, here are a few features we hope make the list.</p>\n\n\n\n<h2>macOS 12: Beta and release</h2>\n\n\n\n<p>Apple hasn’t strayed very far from its release schedule since OS X Mavericks launched in October, so it’s a safe bet that <a href=\"https://www.macworld.com/article/342028/wwdc-2021-apple-to-unveil-ios-15-macos-12-on-june-7.html\">Apple will unveil macOS 12 at WWDC</a>, start pushing developer and <a href=\"https://www.macworld.com/article/234377/ios-14-and-ipados-14-public-beta-how-to-get.html\">public betas</a> within a couple of weeks, and then release the final version sometime in the fall. Release dates have varied quite a bit, with Big Sur landing on November 12, Catalina coming on October 7, and Mohave dropping on September 24.</p>\n\n\n\n<h2>macOS 12: Expected new features</h2>\n\n\n\n<p>We don’t have a ton of information regarding macOS 12 just yet, but it sounds like it’s going to be more of a maintenance release along the lines of <a href=\"https://www.macworld.com/article/230132/macos-high-sierra-features-specs-pricing-faq.html\">High Sierra</a>. In a recent Bloomberg report, Mark Gurman wrote that “Apple is also planning a more minor update to macOS after its redesign last year.”</p>\n\n\n\n<h2>macOS 12: What we want to see</h2>\n\n\n\n<h3>Interface and useability</h3>\n\n\n\n<h4>Fixes and optimizations</h4>\n\n\n\n<p>Apple doesn’t wait until a major update like this one to release fixes; they usually address them in point-release updates. But there always seem to be issues that linger. For example, there’s the <a href=\"https://www.macworld.com/article/334275/apple-silicon-m1-macbook-mac-mini-ssd-read-write-excessive-data-terabytes.html\">SSD excessive activity</a> situation that was discovered in February. Even though it <a href=\"https://www.macworld.com/article/338844/how-worried-should-you-be-about-your-m1-macs-ssd-lifespan.html\">may not be as bad as you might think</a>, it still seems like it needs to be addressed.</p>\n\n\n\n<p>As for Macs with Apple silicon specifically, can macOS be even faster than it already is? Big Sur was optimized for Apple’s M1 system on a chip, but there’s always more that could be done with performance and battery life, as we’ve seen with every release of iOS. Big Sur on M1 Macs is very impressive, but there are plenty of little issues that cause our MacBooks to drag, lag, and even crash on a semi-regular basis.  Honestly, if the next version of macOS focuses mostly on fixes and optimization and nothing else, that’s good enough for us. Everything else is a bonus.</p>\n\n\n\n<h4>Time Machine iCloud backups</h4>\n\n\n\n<p>Our friends at Macworld U.K. have this on their <a href=\"https://www.macworld.co.uk/news/macos-12-release-date-3800739/\">wishlist</a>, and we have to agree. One of the iPhone’s best features is iCloud backups, and we’d love to have it be just as effortless on the Mac. Having an offsite backup is good practice to prepare for the worst, and while there are plenty of <a href=\"https://www.macworld.com/article/227256/the-complete-easy-guide-to-backing-up-your-mac.html\">third-party cloud backup services</a>, nothing beats the ease of use of Time Machine. Hooking up an external drive to your Mac is easy enough, but setting it and forgetting at setup it with iCloud would be wonderful.</p>\n\n\n\n<h4>Bring back the Delete icon in Messages</h4>\n\n\n\n<p>Okay, this wish, in the whole scheme of things, is extremely minor. Some might even say it is silly. But it’s an example of how macOS and iOS are merging in many ways, but it should not be forgotten that macOS UX and iOS UX don’t always overlap.</p>\n\n\n\n<p>Big Sur brought macOS Messages on par with the iOS version, which is awesome for things like <a href=\"https://www.macworld.com/article/234822/macos-big-sur-what-s-new-in-the-messages-app.html\">stickers, pinned messages, and Memoji</a>. But there’s one change we hate: Apple removed the “X” button for individual messages next to conversations. Now when we want to delete something, we have to right-click it and then select “Delete Conversation,” or select the message and then go to File &gt; Delete Conversation. Or, if you’re using a trackpad, you can use two fingers and swipe to the left to see the Trash icon.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/macos-catalina-messages-delete.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>The Delete button in Messages disappeared in macOS Big Sur. It needs to come back.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>All those options are fine. But we miss being able to quickly hover over a conversation and click the “X” (seen above) to delete it in a snap. (And yes, we know we can create a custom keyboard shortcut, but that’s not the point.) Removing such simple and intuitive functionality was a mistake and we’d like Apple to bring it back, please.</p>\n\n\n\n<h3>Appearance</h3>\n\n\n\n<h4>Control Center</h4>\n\n\n\n<p>Big Sur’s Control Center—which mirrors the same features in iOS/iPadOS—helps clean up the cluttered menu bar in an intuitive way, but it has very few customization options. Seven of the buttons are permanent, which means the ones you might deem unnecessary (Keyboard Brightness, Display Preferences, Music, etc.) can’t be removed. And there are only three other optional modules you can add.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/macos-big-sur-control-center.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Control Center is a good addition to the Mac, but it needs to be more flexible.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Control Center needs to be at least as customizable as it is on iOS, where it has more controls available, the ability to remove any modules, and support for Home Controls. It might be too much to ask at this point to allow third-party apps in Control Center, but most of our menu bar icons are for third-party apps, and the option to put them in Control Center would be a nice way to clean things up. But at least allowing more macOS modules is a step in the right direction.</p>\n\n\n\n<h4>Desktop widgets</h4>\n\n\n\n<p>Big Sur brought the same customizable widgets to the Mac that iOS 14 brought to the iPhone, and we’re loving them. Apple also brought them to macOS, but they’re stuck in the Notification Center. We’d love it if Apple would move them out as it did with the Dashboard widgets of old.</p>\n\n\n\n<h3>Apps</h3>\n\n\n\n<h4>Shortcuts</h4>\n\n\n\n<p>Apple <a href=\"https://www.macworld.com/article/231862/the-shortcuts-app-for-ios-12-is-now-availablemake-sure-you-grab-it.html\">released</a> the Shortcuts automation app over two years ago for iOS, and it’s become <a href=\"https://www.macworld.com/article/233328/with-ios-13-1-shortcuts-gets-a-lot-more-powerful.html\">a truly powerful tool</a> for getting things done. But on the Mac it would be indispensible.</p>\n\n\n\n<p>The Mac already has the powerful Automator (that icon in your Applications folder with the cool-looking robot), but it’s old and not as user-friendly as Shortcuts. Shortcuts would be a fantastic companion app to Automator, opening up the world of automation to a lot more users that aren’t looking for the kind of power Automator brings. Plus it would bring the Mac and iPhone ever closer since Shortcuts on the Mac would be able to run the hundreds of Shortcuts already available on iOS. Which is a good segué to the next feature on this wishlist…</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/shortcuts-ios14.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Shortcuts is on iOS, and it needs to come to the Mac.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h4>Improved iOS support</h4>\n\n\n\n<p>Apple continues to tweak its iPhone and iPad app support under Catalyst with each Big Sur update, but there’s still work to be done. Mainly, the UI still often feels like we’re using mobile apps on the desktop, particularly with apps like TV and Music, and there are some performance tweaks that can be made too. And we’d also like to see way more apps make their way over to the Mac, especially if Shortcuts makes an appearance. Without the interoperability with all of those iOS apps, it’s not nearly as useful. </p>\n\n\n\n<h4>Wallet</h4>\n\n\n\n<p>I used to be an old-fashioned, pay-with-cash kind of guy, so I didn’t use the iPhone Wallet app very much. Then Covid hit and many stores stopped accepting cash and moved to touchless payment. So it took a pandemic to bring me into the 21st century and to realize how cool an app Wallet is.</p>\n\n\n\n<p>When I shop online, I do it on my Mac, and it would be nice if there was one central location to organize payment accounts, a place that’s more robust than the rudimentary System Preferences pane that can store boarding passes and event tickets, not to mention a place to pay off my Apple Card bill without having to visit <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://card.apple.com/&amp;xcust=1-1-342964-0-0-0&amp;sref=https://www.macworld.com/feed\">card.apple.com</a> or picking up my iPhone.</p>\n\n\n\n<h4>Apple Health and Fitness+</h4>\n\n\n\n<p>Apple’s latest exercise service is available on iPhone, iPad, and Apple TV, but not on the Mac. For anyone who doesn’t have an Apple TV, Fitness+ on, say, an iMac or a Mac mini hooked up to a widescreen monitor is a far better experience than using an iPad or iPhone. And while we’re at it, we’d like to see a Mac version of the Health app, too. It’s a head-scratcher that it’s not available yet.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/apple-fintess-imac.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Apple Fitness+ on an iMac seems to make a lot of sense.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h4>Siri</h4>\n\n\n\n<p>Siri improvements are a perennial choice on <a href=\"https://www.macworld.com/article/342667/ios-15-wishlist-10-ways-apple-can-make-our-iphones-better.html\">every Apple OS wishlist we write</a>. Apple does make a lot of noise about Siri updates every time a new version of macOS or iOS is released, but they never seem like enough. To compete Google Assistant or Amazon Alexa takes constant attention and updates, and we haven’t gotten it yet. We can’t even set simple alarms on our MacBooks yet. It’s time for Siri to make a big leap—and it starts with the Mac.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"40d8c92da9346dbacfb0339400068c6eef6ff6032bed999886d1e0addff71f60","category":"Apple"}