{"title":"Reef fish assemblages differ both compositionally and functionally on artificial and natural reefs in the eastern Gulf of Mexico","link":"https://academic.oup.com/icesjms/article/81/6/1150/7692277?rss=1","date":1718236800000,"content":"<span><div>Abstract</div>Human-made structures, particularly artificial reefs, have played an increasingly important role in restoration, conservation, and management efforts aimed at mitigating the detrimental effects of anthropogenic activities on habitats and their associated communities. However, the extent to which artificial reefs support marine assemblages resembling those of natural habitat remains unclear. In this study, we used a 10-year dataset of reef fish visual surveys performed on paired reefs located in the eastern Gulf of Mexico, complemented by functional trait data, to examine whether artificial and natural reefs support fish assemblages with similar taxonomic and functional diversities. Our results revealed compositionally and functionally distinct assemblages between reef types, a pattern that was consistent across depths. The inclusion of functional diversity allowed us to explicitly identify generalized patterns in the composition of these assemblages that may have only been inferred from a strictly taxonomic-based approach. Specifically, large-bodied, midwater predators were relatively more abundant on artificial reefs, whereas smaller-bodied, benthic-associated invertivores or mesopredators were more frequently observed on natural reefs. The artificial reefs in this study were previously characterized as having greater vertical relief than their natural counterparts, a feature that likely contributed to the greater abundances of midwater predators on those reefs. Similarly, natural reefs typically offered a greater abundance of medium-to-small refugia necessary for smaller-bodied taxa to forage and avoid predation. Previous work also demonstrated that these artificial reefs were visited 2–10 times more frequently by boaters than natural reefs, presumably for recreational fishing purposes. These findings led us to infer that local-scale environmental filtering and variable predator–prey dynamics resulting from differences in the physical characteristics of these reefs coupled with asymmetric fishing activity influenced the observed differences among reef fish assemblages. Additionally, our work underscored the utility of multiple diversity measures in comparative assemblage studies, provided insight into reef-fish assemblage dynamics, and helped to emphasize a pressing need to better understand the role of human-made structures in marine ecosystems.</span>","author":"","siteTitle":"ICES Journal of Marine Science Current Issue","siteHash":"54f8cca1acc450a23f886e7003c55f387c2b0793320a665b1e27fbbf191461e5","entryHash":"40dc82687dbfe11f0d57879ba87e84430f04ba5ffa21bd8c86af42ad1139cd70","category":"Environment"}