{"title":"PSIV-A-13 The relationship between breed-wide expected progeny differences, genomic predictors, and phenotypic values in mature Angus cows","link":"https://academic.oup.com/jas/article/102/Supplement_2/364/7664823?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>For many years, selection for improved beef production centered on heavier weaning weights and more rapid post-weaning gain. More recently, measurement of post-weaning feed intake has facilitated direct improvement in feed efficiency in the feedlot. However, intake on a high concentrate diet is controlled by different biological mechanisms than intake on a high roughage diet. For this reason, the question remains whether an animal that efficiently converts calories from a high-quality concentrate-based ration similar to that of a feedlot diet where the expected progeny differences (EPDs) and genomic predictors (GPs) are developed would also be an efficient forage utilizer as a mature cow. To evaluate this relationship, we compared breed-wide EPDs and predictors to performance on a roughage diet and on a concentrate diet in mature cows. The objective of this study was to determine if EPDs and GPs developed and used in feedlots are applicable to commercial cow/calf producers utilizing forages and other roughages as the main diet ingredient. Data for this study were collected at Oklahoma State University from the fall of 2018 to the spring of 2021. Tissue samples from 64 mature Angus cows were submitted to Neogen for profiling according to genetic potential for 16 different traits. In each trial, retained energy (RE), dry matter intake (DMI), milk production (MILK), mature weight (MW), and average daily gain (ADG) were recorded and compared with the corresponding EPD and GP. Pearson correlations were determined between phenotypic values, GPs, and EPDs for both diets on each trial. No EPD or GP was significantly correlated to any measured trait on the forage diet. The DMI EPD was strongly correlated with DMI on a concentrate-based diet, however, did not predict DMI on a forage diet in mature cows. Based on the evaluations performed in this study, selecting for animals that perform well in the feedlot may be inadvertently selecting for mature cows that perform poorly on a typical mature cow diet of medium to low-quality forages.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"40e48246196b882ddc69251e36c9257f88d1418d3cec734e4c0dc768faed6299","category":"Environment"}