{"title":"What is cyclocross? Plus how to get started with CX racing","link":"https://www.bikeradar.com/advice/fitness-and-training/cyclocross-racing/","date":1692878400000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-1247309250-ef38c03.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-1247309250-ef38c03.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-1247309250-ef38c03.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-1247309250-ef38c03.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-1247309250-ef38c03.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2021/12/GettyImages-1247309250-ef38c03.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Dutch Fem Van Empel competes during the women's elite race at the Brussels Universities cyclocross cycling event, the 8th and final stage in the X2O Badkamers 'Trofee Veldrijden' competition, in Brussels, on February 19, 2023.\" title=\"CYCLOCROSS-BEL-WOMEN-ELITE-TROFEE VELDRIJDEN\" />                                            <p>Cyclocross racing takes place on technical outdoor courses of grass, dirt, mud, sand or sometimes snow. On bikes that don’t look out of place on the road, elite riders display the off-road skills of mountain bikers and the explosivity of track sprinters.</p>\n<p>The cyclocross (often abbreviated to CX) heartland is on the continent, in Belgium and the Netherlands. The World Cup series and even domestic events draw thousands of spectators, who ward off the cold with beer and <em>frites</em>.</p>\n<p><a href=\"https://www.bikeradar.com/events/tour-de-france/\" target=\"_blank\">Tour de France</a> riders in the early 20th century invented cyclocross as a discipline to help maintain shape during the off-season.</p>\n<p>The thrilling autumn and winter sport includes sharp turns, steep banks, hurdles, tree roots and other obstacles. Riders are often forced to dismount and run with their bikes. The best bike handlers bunnyhop wooden barriers.</p>\n<p>Competitors complete as many laps of a course that is typically 1-3km long as they can, plus a final lap, in races lasting 30-60 minutes.</p>\n<p>In the UK, the ‘cross season typically runs from around September to February. Venues such as leisure centres, sport pitches and parks host races. There are many regional competitions you can join, such as the West Midlands Cyclo-Cross League, and national events, namely the Cyclo-Cross National Trophy.</p>\n<p>To ride an individual race, you pay an entry fee and require a British Cycling race membership, or you can buy a day’s race licence. The growing popularity of the sport has led some leagues to require online entry in advance in order to cap numbers.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"DAVID PINTENS/BELGA/AFP via Getty Images\" title=\"CYCLING-CYCLOCROSS-BEL\" />\n\n</div><div><figcaption><span><i></i> Cyclocross goes over almost all types of surfaces in any weather.</span></figcaption><span> <i>DAVID PINTENS/BELGA/AFP via Getty Images</i></span></div>\n<p>But cyclocross remains a welcoming, inclusive sport. It’s a fun way to improve fitness and a gateway into racing for others.</p>\n<p>Moreover, learning <a href=\"https://www.bikeradar.com/advice/skills/technique/cyclocross-skills\">cyclocross skills</a> does wonders for your bike handling. Wout van Aert and Mathieu van der Poel won multiple cyclocross world championships before taking road racing by storm.</p>\n<p>Ineos Grenadiers’ Tom Pidcock, who is also the reigning <a href=\"https://www.bikeradar.com/features/pro-bike/tom-pidcock-bmc-fourstroke/\">Olympic MTB champion</a>, is still a competitive ‘cross racer every winter. In the women’s peloton, Fem van Empel is the reigning cyclocross world champion, an U23 European <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cross-country-racing-guide/\">cross-country mountain biking</a> medallist and a pro on the road with Team Jumbo-Visma.</p>\n<p>Here’s how to trace their tyre tracks to the start grid of your first ‘cross race.</p>\n<h2>Join a club</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"ANTWERPEN, BELGIUM - DECEMBER 28: A general view of Wout Van Aert of Belgium and Team Jumbo - Visma competes ahead of Thomas Pidcock of United Kingdom and Team INEOS Grenadiers during the 46th Superprestige Cyclocross Diegem 2022 - Men's Elite / #Superprestige2023 / on December 28, 2022 in Antwerpen, Belgium.\" title=\"46th Superprestige Cyclocross Diegem 2022 - Men's Elite\" />\n\n</div><div><figcaption><span><i></i> Even the heroes of the sport started out with club racing.</span></figcaption><span> <i>Photo by Luc Claessen/Getty Images)</i></span></div>\n<p>The British Cycling website has a search tool to help you <a href=\"https://www.britishcycling.org.uk/clubfinder\" target=\"_blank\">find your nearest club</a>.</p>\n<p>Once you’ve joined, the resident CX enthusiast will point you in the way of races, and advise on kit and technique. You can practise skills together and share lifts to races.</p>\n<p>Many clubs also organise midweek group sessions, where you can perfect your dismounting, running and remounting.</p>\n<h2>It’s about the bike</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Tom Pidcock's Crossista F\" title=\"CROSSISTA F with Tom Pidcock 01\" />\n\n</div><div><figcaption><span><i></i> A dedicated cyclocross bike will give you better handling off-road and, critically, mud clearance.</span></figcaption><span> <i>Evan Edwards / Shift Active Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cyclocross-bikes/\">Cyclocross bikes</a> are designed for negotiating a ‘cross course’s tight turns rather than all-day comfort. They typically have a shorter frame reach – though this isn’t always the case – a taller bottom bracket to improve ground clearance and lots of clearance around the wheels to stop mud build-up. They’ll also typically be specced with knobbly cyclocross tyres and lower gears than a road bike.</p>\n<p>There is, of course, no reason why you can’t race cyclocross on your road bike, especially if it has <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\" target=\"_blank\">disc brakes</a>, which provide better braking in the wet and won’t get clogged up with mud like regular rim brake calipers. The geometry of a road bike is close enough to a cyclocross bike to be more than workable.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Pack shot of the Ridley Kanzo Fast GRX Di2 Classified gravel bike\" title=\"Ridley Kanzo Fast GRX Di2 Classified 01\" />\n\n</div><div><figcaption><span><i></i> The Ridley Kanzo Fast race bike is almost as aggressive as its X-Night cyclocross bike.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">best gravel bikes</a> can also cope admirably with ‘cross racing because, particularly with more race-focused gravel bikes, the difference between the two is pretty small.</p>\n<p>Local races accept flat-bar bikes too. Therefore, to begin with, you can even ride your <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">mountain bike</a>, provided its tyres are within the mandated width limit (some leagues don’t have one).</p>\n<p>Some riders find it helpful to lower their <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/\" target=\"_blank\">saddle height</a> by 5mm to 7mm when racing cyclocross because it’ll be easier to move about on the bike, make minor adjustments and to get on and off.</p>\n<h2>Gear idea</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Shimano XC7 XC/CX shoe\" title=\"shimano-XC7-7\" />\n\n</div><div><figcaption><span><i></i> Off-road shoes – be they cyclocross, gravel or mountain bike shoes – are essential.</span></figcaption><span> <i>Stan Portus / Our Media</i></span></div>\n<p>Many cyclocross racers prefer to wear a skinsuit, but you can wear a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-jerseys/\">road jersey</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-shorts/\">bib shorts</a> with no problem.</p>\n<p>Off-road, specific footwear is essential, though. The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bike-shoes/\">best cyclocross shoes</a>, paired with <a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\">clipless pedals</a> will hugely benefit your performance and enjoyment.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Flat vs clipless pedals\" title=\"Flat vs clipless pedals\" />\n\n</div><div><figcaption><span><i></i> While there’s nothing stopping you racing cyclocross with flat pedals, two-bolt mountain-bike style clipless pedal systems are most common.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>They are easier to clip in and out of the double-sided pedals they’re used with, easier to run in and stand less of a chance of becoming clogged up with mud. Some riders may also find riding clipped in helps improve their control in technical terrain.</p>\n<h2>Ring the changes</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Orbea Terra M21e Team 1X gravel bike\" title=\"Orbea Terra M21e Team 1X - 06\" />\n\n</div><div><figcaption><span><i></i> Some riders prefer a 1x setup for cyclocross racing, but it’s not essential.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Although a 2x setup will get you around a ‘cross course with no problem at all, single chainrings are an increasingly common sight at races.</p>\n<p>They’re a simple and reliable choice on rugged, chain-rattling terrain, as well as easier to maintain.</p>\n<p>Lower speeds than on the road mean massive gears are unnecessary. A 1x crankset with a 40t chainring and, for example, an 11-40 ratio, will see you up steep banks, but will also ensure you won’t spin out on the flat parts of the course.</p>\n<p>A <a href=\"https://www.bikeradar.com/features/how-to-convert-your-bike-to-a-1x-drivetrain/\">1x conversion</a> on your gravel bike is an affordable alternative to buying a separate ‘cross bike.</p>\n<h2>Low and wide</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Corran Carrick-Anderson's Trek Boone\" title=\"MG_BR_CX Nats_Corran Carrick-Anderson_15\" />\n\n</div><div><figcaption><span><i></i> Cyclocross tyres come in a huge range of styles to suit all conditions.</span></figcaption><span> <i>Matt Grayson</i></span></div>\n<p>Not even the <a href=\"https://www.bikeradar.com/advice/buyers-guides/cyclocross-tyres\">best cyclocross tyres </a>will maintain momentum and grip through woods and mud if they’re at the wrong pressure.</p>\n<p>Roughly 30psi is a good starting point for dry, fast conditions. Wet mud might require 15psi, but an individual’s tyre pressure will vary hugely depending on factors such as skill, speed, weight and tyre tread pattern.</p>\n<p>In a UCI race or national trophy events, the maximum permitted width is 33mm. In regional races in the UK, you’re allowed to ride 35mm or 38mm tyres.</p>","author":"Jack Evans","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"40e667d273458ecd2ed2dea0e9be1516f9b1aedb917fad2ed8f6461936dc034f","category":"Cycling"}