{"title":"Pollinator response to livestock grazing: implications for rangeland conservation in sagebrush ecosystems","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae069/7731216?rss=1","date":1723248000000,"content":"<span><div>Abstract</div>World food supplies rely on pollination, making this plant–animal relationship a highly valued ecosystem service. Bees pollinate flowering plants in rangelands that constitute up to half of global terrestrial vegetation. Livestock grazing is the most widespread rangeland use and can affect insect pollinators through herbivory. We examined management effects on bee abundance and other insect pollinators on grazed and idle sagebrush rangelands in central Montana, USA. From 2016 to 2018, we sampled pollinators on lands enrolled in rest-rotation grazing, unenrolled grazing lands, and geographically separate idle lands without grazing for over a decade. Bare ground covered twice as much area (15% vs. 7) with half the litter (12% vs. 24) on grazed than idle regardless of enrollment. Bee pollinators were 2–3 times more prevalent in grazed than idle in 2016–2017. In 2018, bees were similar among grazed and idled during an unseasonably wet and cool summer that depressed pollinator catches; captures of secondary pollinators was similar among treatments 2 of 3 study years. Ground-nesting bees (94.6% of total bee abundance) were driven by periodic grazing that maintained bare ground and kept litter accumulations in check. In contrast, idle provided fewer nesting opportunities for bees that were mostly solitary, ground-nesting genera requiring unvegetated spaces for reproduction. Managed lands supported higher bee abundance that evolved with bison grazing on the eastern edge of the sagebrush ecosystem. Our findings suggest that periodic disturbance may enhance pollinator habitat, and that rangelands may benefit from periodic grazing by livestock.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"40e68ab6a0c91d27959d766e4e1837bb63e0a7255b890cdf1aced288946570b6","category":"Environment"}