{"title":"Exploring the Potential of Salicylic Acid and Arbuscular Mycorrhizae in Boosting the Growth and Flowering Response of Statice (Limonium sinuatum [L.] Mill.)","link":"https://www.preprints.org/manuscript/202409.1847/v1","date":1727171828000,"content":"In sustainable floriculture, the integration of arbuscular mycorrhizal fungi (AMF) and salicylic acid (SA) in the cultivation of statice flowers presents a promising ecofriendly approach to enhancing crop health and productivity. AMF improve nutrient uptake, particularly phosphorus, in plants, leading to stronger growth and abundant flowering while reducing the reliance on chemical fertilizers. Additionally, AMF enhance soil structure and water retention, fostering robust root systems and increasing the plant's resilience to drought and soil-borne pathogens thus improving soil health and minimizing environmental impact. Complementarily, the application of salicylic acid boosts the plant’s innate defense mechanisms, elevating its resistance to diseases, enhancing stress tolerance, helping statice flowers withstand adverse conditions such as drought and salinity, and promotes vigorous root development for better nutrient absorption. Hence, this study evaluates the effect of mycorrhizal inoculation and salicylic acid treatment on ornamental statice (Limonium sinuatum [L.] Mill.) cv.  Qis White. The investigation involves two primary factors: mycorrhizal inoculation and salicylic acid concentration. For mycorrhizal inoculation, the study compares the untreated control with treatments including Glomus mossae, Gigaspora margarita, and a mixture of both fungi (applied as basal during transplanting). For salicylic acid, the study assesses the untreated control alongside treatments with Salicylic Acid at 100 mg L-1, 150 mg L-1, and 200 mg L-1  (applied as foliar spray at 45 and 90 days after transplanting) in a factorial RCBD experiment with three replications. Growth, flowering, yield and biomass parameters were assessed in this study. The results indicated that statice plants benefited from mycorrhizal inoculation, particularly with Glomus mosseae, when paired with salicylic acid @ 200 mg L-1. This was further validated by principal component analysis. AMF inoculated plants showed improved growth, and superior flower qualities compared to non-inoculated plants. Additionally, the application of salicylic acid demonstrated positive effects across various parameters. Notably mycorrhization led to a delay of 4 to 9 days in the flowering time of statice. In conclusion, mycorrhizal inoculation and salicylic acid can enhance the growth and flowering attributes of statice by choosing the appropriate mycorrhizal inoculum and optimal salicylic acid concentrations. In the future they can contribute to more sustainable and productive statice cultivation by reducing the need for chemical inputs and supporting overall plant health.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"40ea494cefec8625065d47cf2c7a4897215e6885c1ba726afe9c992812fda673","category":"Interdisciplinary"}