{"title":"What Google Maps knows about the world’s cycling habits","link":"https://cyclingtips.com/2021/06/what-google-maps-knows-about-the-worlds-cycling-habits/","date":1622693130000,"content":"<p>Tech giant Google knows a lot of things: where you live, what you search for, what you’re buying, and what keeps you up at night. That knowledge is informed by a number of its products – like Google Search, or Google Chrome, or Google Home – and it’s also informed by Google Maps, the <a href=\"https://themanifest.com/mobile-apps/popularity-google-maps-trends-navigation-apps-2018\">world’s leading mapping app</a>.</p>\n\n\n\n<p>But despite any concern you might have about big tech creeping insidiously into individual lives, there are some fascinating insights that can be gleaned from the big picture. Google has unmatched scale, and is uniquely capable of providing a broad strokes picture of what the world’s up to. </p>\n\n\n\n<p>And today, thanks to Google Maps, they’ve done just that for cycling. </p>\n\n\n\n<h2>Google Maps and cycling</h2>\n\n\n\n<p>Maps was first rolled out in 2005, and began adding cycling-specific functionality from 2010. Over the years since, those features have received a number of updates – such as the addition of elevation profiles in 2017 – in a bid to make the app more appealing for cyclists of all persuasions. Specific cycling directions are currently available in more than 30 countries<sup>1</sup>.</p>\n\n\n\n<p>Because of Google’s immense reach and the market penetration of its Maps app, any data Google provides is backed by billions of journeys from an app that has had more than five billion global downloads. Cyclists are, of course, just a fraction of that whole, but we’re still talking an enormous amount of data. </p>\n\n\n\n<p>Last year, there was a massive COVID-induced bike boom which saw a 69% increase in cycling direction searches from February 2020 onwards, along with all-time record search volume in the northern summer. </p>\n\n\n\n<p>Searches for bike repair services doubled year-on-year, and Google worked with local governments to integrate all of the new pop-up bike infrastructure into its maps. Last year, over 150,000 km of new bike routes were added to Google Maps.</p>\n\n\n\n<h2>Top cities and countries for cycling, according to Google Maps</h2>\n\n\n\n<p>In 2021, the bike boom seems to have continued. In a <a href=\"https://blog.google/products/maps/wheelie-interesting-maps-trends-bike-day/\">new blog post released today</a>, Google has pooled a year’s worth of Google Maps data to provide a snapshot of the year in cycling<sup>2</sup>.</p>\n\n\n\n<p>According to Google, based on “overall cycling directions usage in Google Maps”, the top countries for cycling globally are: </p>\n\n\n\n<ol><li>Germany</li><li>United States</li><li>The Netherlands</li><li>Japan</li><li>France</li></ol>\n\n\n\n<p>Breaking that down to metropolitan areas, the top cities in the world for cycling (again, using the ‘cycling directions usage in Google Maps’ caveat) are: </p>\n\n\n\n<ol><li>Tokyo</li><li>Amsterdam</li><li>London</li><li>Paris</li><li>Munich</li></ol>\n\n\n\n<p>The United States doesn’t appear in that top 5 list, so Google’s provided a special city ranking for its homeland. The top US cities for cycling direction requests are:</p>\n\n\n\n<ol><li>New York</li><li>Los Angeles</li><li>Chicago</li><li>San Francisco</li><li>Washington DC</li></ol>\n\n\n\n<h2>Big and little pictures</h2>\n\n\n\n<p>Zooming back out to a global scale, Google reckons people are cycling further in their average trips. There’s not data available to reveal why that is the case – maybe new cyclists are getting fitter, maybe COVID lockdown restrictions have eased, maybe neither, or maybe both – but regardless, the average cycling route via Google Maps in 2021 is now nearly 10% longer than in 2020. In San Francisco, routes searched are 15% longer, while in Ireland, users are searching for routes that are a colossal 50% longer compared to a year ago. </p>\n\n\n\n<p>Of course, these big picture figures have nuance lying behind them; it’s easy to take a shiny number and run with it while coming up with completely the wrong conclusion. </p>\n\n\n\n<p>Google itself provides a classic context-free example of this: </p>\n\n\n\n<blockquote><p><em>“Tour de New Zealand? People in New Zealand are looking for “bike shops” 30% more [than] they were at the end of April 2020, signaling that their interest in cycling might even withstand the country’s approaching winter season.”</em></p></blockquote>\n\n\n\n<p>… which sounds great, but also, the entirety of New Zealand was effectively sheltering in place for the duration of April 2020 and unlikely to be looking for a bike shop. The New Zealand cycling industry didn’t reopen fully until mid-May.  </p>\n\n\n\n<h2>Wrapping up</h2>\n\n\n\n<p>How much does stuff like this play into the integrity of the entire dataset? It’s tricky to say for sure, but again, you’ve got to come back to that vast user base, across a decent chunk of the planet. </p>\n\n\n\n<p>Zoomed out, to that super broad view where you’re not looking at regional curiosities and not worrying about data privacy, at least one thing seems clear. </p>\n\n\n\n<p>More people are riding bikes, and they’re riding them further. </p>\n\n\n\n<p>And that can only be a good thing.</p>\n\n\n\n<h2>Footnotes</h2>\n\n\n\n<ol><li><em>I asked Google’s media team specifically what countries these were and what plans Google has to roll this feature out to other countries, but at time of publication I had not received a response.</em></li><li><em>Keep in mind that these stats are based on the 30ish countries that have cycling directions in their Google Maps, and that the dataset is the people in those countries that are specifically using Google Maps to get around. That means there’s a level of affluence, because these folks all have a smartphone, and an allegiance to particular devices (i.e. smartphones rather than, say, Garmin or Wahoo GPS units). The developing world doesn’t make an appearance, and there could be an enormous bike boom in India or China or Africa that doesn’t feature in this dataset because they don’t use Google Maps or don’t have as many smartphone users or Google hasn’t introduced cycling directions yet.</em></li></ol>\n\n\n\n\n<p>The post <a href=\"https://cyclingtips.com/2021/06/what-google-maps-knows-about-the-worlds-cycling-habits/\">What Google Maps knows about the world’s cycling habits</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"40f470751e146b388a9f8c6d0ae2f1c2cd716cdf942714a54512e6a03750806b","category":"Cycling"}