{"title":"The next iMac: ‘Pro’ model could be 32 inches and feature a next-gen chip","link":"https://www.macworld.com/article/349270/2021-imac-pro-32-inch-design-apple-silicon-processor-display-colors-ports-price-release.html","date":1625739300000,"content":"\n<div>\n<section><div></div></section><p>The <a href=\"https://www.macworld.com/article/347534/24-inch-imac-review-apple-design-display-colors-storage-upgradability-price.html\">24-inch iMac</a> was released not too long ago, but we’re still waiting for its bigger, faster sibling to replace the current <a href=\"https://www.macworld.com/article/234483/27-inch-apple-imac-2020-review.html\">Intel-based 27-inch iMac</a>. Bloomberg <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-05-18/apple-readies-macbook-pro-macbook-air-revamps-with-faster-chips&amp;xcust=1-1-349270-0-0-0&amp;sref=https://www.macworld.com/feed\">reported</a> in May that Apple had put the larger iMac aside to focus on the 24-inch iMac’s launch, but since that Mac is now available, the rumor mill for the larger iMac should start churning. This article keeps track of the most credible reports of the upcoming iMac, so stay tuned for all the latest news and rumors. </p>\n\n\n\n<h2>2021 iMac: Sizes, design, and colors</h2>\n\n\n\n<p>In January, Bloomberg <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-01-15/apple-plans-redesigned-imac-new-mac-pro-smaller-mac-pro-cheaper-monitor&amp;xcust=1-1-349270-0-0-0&amp;sref=https://www.macworld.com/feed\">reported</a> that Apple planned on replacing both the Intel-based 21.5-inch and 27-inch iMacs with new machines that feature a new design and Apple’s M1 system on a chip (SoC). Apple introduced the first Apple silicon-based redesigned all-in-one with the 24-inch iMac with a new design that shortens the chin, trims the bezels, and shrinks the enclosure down to an impressive 11.5 millimeters.</p>\n\n\n\n<p>As for the larger iMac, it will reportedly use the same design as the 24-inch iMac, and speculation is that it could house a display as large as 32 inches. The current 27-inch iMac measures 25.6 inches wide, 20.3 inches tall, and 8 inches deep, and while Apple’s new design helps make the 24-inch iMac smaller than the 21.5-inch iMac it replaced, there isn’t that much of a difference in size (21.5 inches x 18.1 inches x 5.8 inches (with the stand) vs 20.8 inches x 17.7 inches x 6.9 inches). So a new larger iMac could have a similar footprint to the 27-inch intel iMac.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/24-imac-27-imac.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The next large iMac will look nothing like the current 27-inch model (right) and more like the 24-inch iMac (left).</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Apple offers the 24-inch iMac in several different color choices, but there haven’t been reports on what color choices Apple will use for the larger iMac. The larger iMac is considered to be a “pro”-level iMac, and to create a differentiation between the consumer and pro levels, Apple may decide on different color choices like the iPhone Pro, or stick with the traditional silver like that on the 27-inch iMac or space gray like on the <a href=\"https://www.macworld.com/article/334315/apple-discontinues-imac-pro-as-signs-point-to-imminent-m1-launch.html\">discontinued iMac Pro</a>.</p>\n\n\n\n<h2>2021 iMac: Display</h2>\n\n\n\n<p>To get an idea of what we could expect with the display in the larger iMac, let’s look at what’s being used in the current iMac lineup, as well as the <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/pro-display-xdr/&amp;subid1=1-1-349270-0-0-0\">Pro Display XDR</a>.</p>\n\n\n\n<ul><li>24-inch iMac: 4.5K Retina display (4480-by-2520 resolution) 500 nits brightness, wide color (P3), True Tone technology</li><li>27-inch iMac and iMac Pro: 5K Retina display (5120‑by‑2880 resolution), 500 nits brightness, wide color (P3), True Tone technology</li><li>Pro Display XDR: 6K Retina display (6016-by-3384 resolution), 1,000 nits (XDR) or 500 nits (SDR) brightness, wide color (P3), True Tone technology</li></ul><p>Since the 24-inch iMac is a 4.5K display, it seems that Apple needs to provide at least 6K resolution on the larger iMac—a 5K display doesn’t provide enough value. The brightness will likely stay at 500 nits, and it will have P3 wide color support and True Tone technology.</p>\n\n\n\n<p>The upcoming lager iMac will have smaller bezels than the 27-inch iMac and iMac Pro, which could help the display reach a higher pixel density without having to make the display much bigger.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/27in-imac-2020-nano-texture.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The 27-inch iMac has a nano-texture glass option (right) that does a better job of resisting glare and reflections.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>The 27-inch iMac comes with standard glass on the front of the display, but for $300, Apple offers a nano-texture glass that provides a matte-like finish and does a good job of cutting down glare. Apple will probably continue to offer this with the new larger iMac. As you can see above, it dramatically cuts down on the gloss and glare.</p>\n\n\n\n<h2>2021 iMac: Apple silicon</h2>\n\n\n\n<p>The 24-inch iMac fits in Apple’s consumer product lineup, and it’s outfitted with the M1, the same SoC that’s in Apple’s other consumer Macs. The larger iMac, however, is part of Apple’s pro Mac line, and will have a faster SoC. To figure out what Apple could two, let’s consider what a Bloomberg report said about upcoming SoCs. </p>\n\n\n\n<p><strong>M1X:</strong> A Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2021-05-18/apple-readies-macbook-pro-macbook-air-revamps-with-faster-chips\">report</a> about the upcoming 1<a href=\"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-mini-led-m1x-touch-bar-sd-card-reader-magsafe-price-release-date.html\">4-inch and 16-inch MacBook Pros</a> and <a href=\"https://www.macworld.com/article/347466/2021-mac-mini-design-processor-m1x-gpu-ram-storage-price-release.html\">high-end Mac mini</a> said that that machine will have Apple’s SoC with 10 processing cores, 8 of them performance cores, and the other two as efficiency cores. To speed up graphics performance, this new SoC will be offered with 16- or 32- GPU cores. Bloomberg also reported that the upcoming pro-level SoC will support a maximum of 64GB of RAM, which is four times the maximum supported in the M1. </p>\n\n\n\n<p><strong>M2:</strong> The latest reports say the redesigned MacBook Air will get the next-gen M2 processor, which is expected to release early next year</p>\n\n\n\n<p><strong>M2X:</strong> In a Bloomberg <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-05-18/apple-readies-macbook-pro-macbook-air-revamps-with-faster-chips&amp;xcust=1-1-349270-0-0-0&amp;sref=https://www.macworld.com/feed\">report</a>, Mark Gurman said that the upcoming Mac Pro will feature an Apple SoC with 20 or 40 computing core variations, with 16/32 performance cores and 4/8 efficiency cores. And the GPU would be available with 64 or 128 cores. </p>\n\n\n\n<p>While there has been no word on whether the larger iMac will have this same SoC as those upcoming pro Macs, it gives an idea of what Apple could implement. Apple could use the M1X in the larger iMac, but it also seems possible that Apple could use, say, an M-series SoC with 12 performance cores and four efficiency cores. The iMac’s slim profile must be considered here because it plays a role in the cooling system for the SoC, which could mean the Mac Pro’s chip might not technically be able to be used in an iMac.</p>\n\n\n\n<h2>2021 iMac: Ports</h2>\n\n\n\n<p>The 24-inch iMac comes with Thunderbolt and USB-C ports, and that’s it. Rumors of the <a href=\"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-mini-led-m1x-touch-bar-sd-card-reader-magsafe-price-release-date.html\">14- and 16-inch MacBook Pro</a> and high-end <a href=\"https://www.macworld.com/article/347466/2021-mac-mini-design-processor-m1x-gpu-ram-storage-price-release.html\">Mac mini</a> speculate that Apple will add more Thunderbolt ports, and also equip these Macs with USB-A ports.</p>\n\n\n\n<p>The larger iMac will probably have more ports than its 24-inch sibling, but if Apple is determined to stick to the iMac having a thin profile, that could prevent some ports from being implemented. For example, rumor says that the upcoming MacBook Pro could have an SD card slot, which has been a staple of the 27-inch iMac. It could be left out if the size of an SD card module is prohibitive. (it does seem like an SD card slot is the type of item that could be placed in the side of the tin large iMac, like it is on the 24-inch model.) Even USB-A ports are in jeopardy if Apple sticks with the ultra-thin frame.</p>\n\n\n\n<p>For the $1,499 and $1,699 24-inch iMac, Apple placed the ethernet port in the power adapter brick. The same power adapter is likely to be used for the larger iMac as well.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/m1-imac-power-adapter-ethernet-1.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The ethernet-equipped power adapter will probably be standard with the larger iMac.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>2021 iMac: Other features</h2>\n\n\n\n<p>The 24-inch iMac has an improved FaceTime camera that relies on the M1 to provide better image quality. That same FaceTime camera implementation is expected for the larger iMac as well. It’s possible that the camera could support Face ID, since True Depth references were spotted in macOS Big Sur. (If the larger iMac ships at the end of this year, it will run macOS Monterey.) If it doesn’t have Face ID, it will likely have Touch ID built into the keyboard like the 24-inch iMac.</p>\n\n\n\n<p>The current 27-inch iMac has RAM slots that are user-accessible. With Apple silicon, RAM is built into the SoC, and if Apple also insists on maintaining the thinness of the iMac, there’s a good chance that the RAM will not be user upgradable.</p>\n\n\n\n<h2>2021 iMac: Price and availability</h2>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-05-18/apple-readies-macbook-pro-macbook-air-revamps-with-faster-chips&amp;xcust=1-1-349270-0-0-0&amp;sref=https://www.macworld.com/feed\">Bloomberg</a>, the larger iMac was “paused” so that Apple could get the 24-inch iMac out. No ship date for the larger iMac has been set, with several reports speculating that it could ship at the end of this year. However, the industry is faced with a semiconductor shortage, which will affect when the new iMac will be available since Apple is likely to give the MacBook Pro priority. As for the price, it will likely fall in line with the pricing of the current 27-inch iMac, which starts at $1,799 since Apple kept similar pricing to the 21.5-inch iMac when it launched the 24-inch model.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"40f5c5d44246eb17f539868e886f1506dae0f0744d3b1441e005c798917ac327","category":"Apple"}