{"title":"The physics of how gentoo penguins can swim speedily underwater","link":"https://arstechnica.com/?p=1948717","date":1688682813000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/penguin1-800x534.jpg\" alt=\"A gentoo penguin swimming\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/penguin1.jpg\">Enlarge</a> <span>/</span> Gentoo penguins are the world's fastest swimming birds, thanks to the unique shape and structure of their wings. (credit: <a href=\"https://creativecommons.org/licenses/by-sa/3.0/\">Priya Venkatesh/CC BY-SA 3.0</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p><a href=\"https://en.wikipedia.org/wiki/Gentoo_penguin\">Gentoo penguins</a> are the world's fastest swimming birds, clocking in at maximum underwater speeds of up to 36 km/h (about 22 mph). That's because their wings have evolved into flippers ideal for moving through water (albeit pretty much useless for flying in the air). Physicists have now used computational modeling of the hydrodynamics of penguin wings to glean additional insight into the forces and flows that those wings create underwater. They concluded that the penguin's ability to change the angle of its wings while swimming is the most important variable for generating thrust, according to a <a href=\"https://pubs.aip.org/aip/pof/article-abstract/35/6/061907/2897344/Hydrodynamic-performance-of-a-penguin-wing-Effect?redirectedFrom=fulltext\">recent paper</a> published in the journal Physics of Fluids.</p>\n<p>“Penguins’ superior swimming ability to start/brake, accelerate/decelerate, and turn swiftly is due to their freely waving wings,\" <a href=\"https://publishing.aip.org/publications/latest-content/penguin-propulsion-the-physics-behind-the-worlds-fastest-swimming-birds/\">said co-author Prasert Prapamonthon</a> of King Mongkut‘s Institute of Technology Ladkrabang in Bangkok, Thailand. \"They allow penguins to propel and maneuver in the water and maintain balance on land. Our research team is always curious about sophisticated creatures in nature that would be beneficial to mankind.”</p>\n<p>Scientists have long been interested in the study of aquatic animals. Such research could lead to new designs that reduce drag on aircraft or helicopters. Or it can help build more efficient bio-inspired robots for exploring and monitoring underwater environments—such as <a href=\"https://arxiv.org/abs/2202.01037\">RoboKrill</a>, a small, one-legged, 3D-printed robot designed to mimic the leg movement of <a href=\"https://en.wikipedia.org/wiki/Krill\">krill</a> so it can move smoothly in underwater environments.</p></div><p><a href=\"https://arstechnica.com/?p=1948717#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1948717&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"40fbe32ac5c55313ad3127bc9948b8f3de0885a1414cce8b3a676e4e1ee5eb1f","category":"Tech"}