{"title":"Varda’s drug-cooking Winnebago will be remembered as a space pioneer","link":"https://arstechnica.com/?p=2005808","date":1709035258000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/varda1-800x533.jpeg\" alt=\"Varda's reentry capsule soon after landing at the Utah Test and Training Range.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/varda1.jpeg\">Enlarge</a> <span>/</span> Varda's reentry capsule soon after landing at the Utah Test and Training Range. (credit: <a href=\"https://x.com/VardaSpace/status/1760726397889466792?s=20\">Varda Space Industries</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Varda Space Industries is finally able to celebrate. For nearly eight months, the in-space manufacturing company's first mission was essentially stranded in low-Earth orbit, but not because of any technical malfunction or a restriction imposed by the laws of physics.</p>\n<p>Instead, the spacecraft couldn't return to Earth until Varda and three government entities—the US military, the Federal Aviation Administration's Office of Commercial Space Transportation, and the FAA's Air Traffic Organization—all got on the same page. This was far more complicated than anyone envisioned, and Varda had to bypass landing opportunities in July and September because it couldn't secure governmental approvals.</p>\n<p>Finally, earlier this month, the FAA approved a commercial reentry license for Varda's space capsule, which was somewhat larger than a mini-fridge, to fall back into the atmosphere and parachute to a landing in the remote Utah desert southwest of Salt Lake City. Varda's landing zone was at the Utah Test and Training Range, a sprawling military facility primarily used for weapons testing.</p></div><p><a href=\"https://arstechnica.com/?p=2005808#p3\">Read 40 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2005808&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"40fea7bdb194cb1effe38772e9dc60fe3eec110c7de18463bd25bb4417d288b4","category":"Tech"}