{"title":"Understanding Sandfly Vector Dynamics: Molecular Surveillance of Papatasi Fever Virus in Robat Karim County, Tehran","link":"https://www.preprints.org/manuscript/202406.0382/v1","date":1717721321000,"content":"Introduction: Papatasi fever, or three-day fever, is a viral disease transmitted by a species of female sandfly called Phlebotomus papatasi that has symptoms similar to influenza. Robat Karim County, due to the high abundance of Sandfly and climate change in recent years, provides a suitable environment for the growth and reproduction of Sandfly, especially Phlebotomus papatasi Therefore, the aim of this study was molecular monitoring of Papatasi fever virus in Sandfly of Robat Karim County, Tehran province. Materials and methods: In 7 selected areas in Robat Karim County, 679 Sandfly using sampling methods including traps and aspirators were caught and 500 samples were randomly selected according to the fishing location and transferred to the laboratory of the Medical Entomology Department. After fixing Sandfly on the slide surface, identification and percentage of frequency of sandfly species were determined and then by Real-time PCR method, molecular examination of Papatasi virus infection was performed at Tehran Pasteur Institute. Findings: Out of 679 samples taken, 310 (45.65%) belonged to males and 369 (54.35%) belonged to females. 7 species including 3 species of Sandfly of the genus Phlebotomus and 4 species of the genus Sergentomyia were identified among the samples, the highest percentage of catch belonged to Phlebotomus sergenti (28.57%). Of the 500 samples sent to the laboratory for testing for phleboviruses by Real-time PCR, no positive cases of Papatasi virus infection were observed in them. Conclusion: Robat Karim is one of the endemic areas of infectious diseases such as leishmaniasis. Due to climate change in this region that conditions for the growth and reproduction of Sandfly, especially Phlebotomus papatasi as a Vector of sandfly fever and since the sandfly fever disease is not vaccinated therefore, preventive measures to control and reduce diseases transmitted by Sandfly are important.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"41012317d52b2a17407055e028e641882f4adaeaa702b2718ed717b1f3dd7c39","category":"Interdisciplinary"}