{"title":"When a plan comes together: Inside a massive Eve Online corporate heist","link":"https://arstechnica.com/?p=1933280","date":1682163944000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/evecorp-800x450.jpg\" alt=\"A stock image from CCP Games' &quot;Player Corporations&quot; web page, or a potential movie posted for an &lt;em&gt;Eve&lt;/em&gt;-themed heist film? Who can say, really?\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/evecorp.jpg\">Enlarge</a> <span>/</span> A stock image from CCP Games' \"Player Corporations\" web page, or a potential movie posted for an <em>Eve</em>-themed heist film? Who can say, really? (credit: <a href=\"https://www.eveonline.com/eve-academy/corporations\">CCP Games</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Last week, we marveled at the story of an <em>Eve Online</em> player who used the game's arcane corporate share voting system to take control of <a href=\"https://arstechnica.com/gaming/2023/04/eve-online-player-rigs-in-game-ceo-vote-to-steal-22000-of-assets/\">in-game assets worth tens of thousands of dollars</a>. Still, as we noted at the time, there were some important questions remaining over how mastermind “Flam_Hill\" was able to secure the voting shares necessary to call a CEO vote in the first place.</p>\n<p></p><div><img alt=\"Player card for Sienna d'Orion, the original CEO of &lt;em&gt;Eve Online&lt;/em&gt;'s EHEXP.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/SiennaEve.png\" /><p>Player card for Sienna d'Orion, the original CEO of <em>Eve Online</em>'s EHEXP. (credit: Dave/ Eve Online)</p></div>As it turns out, Flam_Hill is just one alias of Dave (last name withheld), a long-time <em>Eve</em> player who previously served as the CEO of <a href=\"https://zkillboard.com/corporation/98056040/\">the Event Horizon Expeditionairies corporation</a> (EHEXP). And Dave tells Ars that his recent \"hostile takeover\" started as an attempt to reclaim assets from a corporation he felt had lost its way.\n<h2>The motive</h2>\n<p>The story of Dave's EHEXP coup goes all the way back to 2011, when he founded EHEXP under the control of his <em>Eve Online</em> character Nikki Shea. Dave says he quickly transferred the CEO role to his \"original and first\" character, Sienna d'Orion.</p></div><p><a href=\"https://arstechnica.com/?p=1933280#p3\">Read 25 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1933280&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4101b2df0e19f5ac9cee8a332886b7a87c30de720183b90f3e6ca3b9bcb2b187","category":"Tech"}