{"title":"‘Arcade Game Typography’ by Toshi Omagari","link":"https://readonlymemory.vg/shop/book/arcade-game-typography/","date":1682041605000,"content":"\n<p>Read-Only Memory, video game book publishers <a href=\"https://readonlymemory.vg\">extraordinaire</a>:</p>\n\n<blockquote>\n  <p>The first book of its kind — a definitive and beautifully\ndesigned survey of ’70s, ’80s and early ’90s arcade game pixel\ntypography. Exhaustively researched by author Toshi Omagari (a\ncelebrated typeface designer at Monotype UK) <em>Arcade Game\nTypography</em> gathers together 250 pixel typefaces, all carefully\nchosen, extracted, redrawn and categorised by style, and each with\nan accompanying commentary by Omagari. The title also features 4\nillustrated essays on videogame typography theory and practice,\ndocumenting the unique advantages and challenges presented to\ndesigners of these bold, playful and often quirky alphabets.</p>\n</blockquote>\n\n<p>I bought and devoured this book back in October 2019, but somehow never recommended it here on Daring Fireball. I should be arrested for dereliction of duty. But I was reminded of it today by <a href=\"https://mastodon.social/@antonyjohnston/110232389169824182\">this toot from Antony Johnston</a>.</p>\n\n<p>A book about classic arcade game fonts is <em>so</em> obviously up my alley that I’d probably enjoy a bad book about them. But <em>Arcade Game Typography</em> is an exquisitely good book: deeply researched, beautifully illustrated with copious screenshots and close-up pixel-by-pixel details, and engagingly written by Omagari. I’m linking here to the limited edition hardcover, which costs $46, but <a href=\"https://www.amazon.com/Arcade-Game-Typography-Pixel-Type/dp/0500021740/?tag=df-amzn-20\">there’s also a high-quality paperback edition for $28</a>. (Buy through that Amazon link and you’ll make me rich with a cut of the dough.) If you <em>don’t</em> want this book you’re either too young or you’re not hooked up right.</p>\n\n<p><strong>See also:</strong> <a href=\"https://www.youtube.com/watch?v=C5NiAoT3xsY\">Estelle Caswell interviewed Omagari in 2020 in a video for Vox</a>, focusing specifically on the 8x8 pixel Quiz Show font, a.k.a. <em>the</em> arcade font.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/04/20/arcade-game-typography\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"410a6d4c83a3621984eda5ac740431a10e0ef037a9c7f39f72e8146b44917eda","category":"Tech"}