{"title":"Salivary Transcriptome and Mitochondrial Analysis of ASD Children Compared to Healthy Controls","link":"https://www.preprints.org/manuscript/202405.0863/v1","date":1715595185000,"content":"Autism has been described as a gastrointestinal and neurological condition that is represented by impairments in language and social situations. Recently reported increases in the occurrence of Autism Spectrum Disorder (ASD) have resulted in increased research into the environmental differences between areas with a high occurrence, as in the “Western” diet populations, and a more locally derived diet population, wherein the rate appears to be significantly less. Thirty autistic children (USA) ages 6 to 21, were sampled at three different intervals: prior to any intervention, post-xylitol intervention, and post-probiotic intervention. The sampling consisted of buccal swabs for MITOSWAB testing, and saliva for metatranscriptomics to determine the entire range of microorganisms and the metabolome. In addition, a “Blue Zone” subject component that included 30 Colombian children, ages 6-16, and who were healthy and within normal behavior standards, also had buccal swabbing and salivary sampling performed for comparison along with 30 healthy (no history medications, illnesses, or behavior issues) USA children matched for age and gender. Saliva samples were analyzed metatranscriptomically and artificial intelligence was utilized to discern important differences in the microbiome that included bacteria, archaea, fungi, and viruses, and microbial functions. Significant differences were noted, and seen in the temporal data, demonstrating shifts that may have been precipitated by the interventions, with both the probiotics and the polyols. Particular bacterial strains were significantly more prevalent in the autism subject group including a strain that reduces neurotransmitters by enzymatic degradation. This provided supporting evidence to the hypothesis that the occurrence of autism may also be influenced by low Gamma Amino Butyric Acid (GABA) levels during development. Also, of interest was the un-expected finding that verbal skills dramatically increased in 6 of the 30 ASD subjects following xylitol supplementation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"410e7ebb207536b0e84f10711ddd7e76f01724d964db51e0324ad1755aeafaf0","category":"Interdisciplinary"}