{"title":"Tackling syndemics by integrating infectious and noncommunicable diseases in health systems of low- and middle-income countries: A narrative systematic review","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003114","date":1715868000000,"content":"<p>by Angela Jackson-Morris, Sarah Masyuko, Lillian Morrell, Ishu Kataria, Erica L. Kocher, Rachel Nugent</p>\r\n\r\nThe co-occurrence of infectious diseases (ID) and non-communicable diseases (NCD) is widespread, presenting health service delivery challenges especially in low-and middle-income countries (LMICs). Integrated health care is a possible solution but may require a paradigm shift to be successfully implemented. This literature review identifies integrated care examples among selected ID and NCD dyads. We searched PubMed, PsycINFO, Cochrane Library, CINAHL, Web of Science, EMBASE, Global Health Database, and selected clinical trials registries. Eligible studies were published between 2010 and December 2022, available in English, and report health service delivery programs or policies for the selected disease dyads in LMICs. We identified 111 studies that met the inclusion criteria, including 56 on tuberculosis and diabetes integration, 46 on health system adaptations to treat COVID-19 and cardiometabolic diseases, and 9 on COVID-19, diabetes, and tuberculosis screening. Prior to the COVID-19 pandemic, most studies on diabetes—tuberculosis integration focused on clinical service delivery screening. By far the most reported health system outcomes across all studies related to health service delivery (n = 72), and 19 addressed health workforce. Outcomes related to health information systems (n = 5), leadership and governance (n = 3), health financing (n = 2), and essential medicines (n = 4)) were sparse. Telemedicine service delivery was the most common adaptation described in studies on COVID-19 and either cardiometabolic diseases or diabetes and tuberculosis. ID-NCD integration is being explored by health systems to deal with increasingly complex health needs, including comorbidities. High excess mortality from COVID-19 associated with NCD-related comorbidity prompted calls for more integrated ID-NCD surveillance and solutions. Evidence of clinical integration of health service delivery and workforce has grown–especially for HIV and NCDs—but other health system building blocks, particularly access to essential medicines, health financing, and leadership and governance, remain in disease silos.","author":"Angela Jackson-Morris","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"4111db58e26b178a9f0cf7c59ff8fed040eff7fdf1fe1f6a405ece526f386ca5","category":"Environment"}