{"title":"A Cry For Help: Reviewing the Aleck Tocsen Helmet Crash Sensor Without Actually Using It","link":"https://theradavist.com/aleck-tocsen-helmet-crash-sensor/","date":1687359627000,"content":"<p><em>Every time we ride alone, we’re taking a risk. That’s why we we tell people where we’re going and when we’ll be back. But maybe we’re also a little more careful on the downhills, and a little more careful when packing our essentials. There are ways to mitigate that risk, and the <a href=\"https://www.aleck.io/products/tocsen-helmet-crash-sensor-black\">Aleck Tocsen Helmet Crash Sensor</a> is a pretty novel one. <a href=\"https://theradavist.com/tag/travis-engel/\">Travis Engel</a> spent a couple months with one right behind his ear, but never really noticed it. And that’s a good thing.</em> <span></span></p>\n<p>When I first heard of helmet-based crash sensors, they seemed more like an experiment than a utility. Not that I doubted the technology. It isn’t unprecedented, or even all that complicated. I just got hung up on adding yet another node to my connected-gadget matrix with no guarantee I’d ever actually “use” it. Then, someone dropped an Aleck device in my hand at this past Sea Otter Classic, and it was immediately less intimidating. And not just because it’s the size and color of a strawberry Mentos. But because there’s no accompanying service fee. No decisions around monthly vs. yearly contracts. Just one $59.99 purchase and some double-sided tape. Stick it on your helmet and, if it senses a severe enough impact, it sends a message over bluetooth to a connected phone app, which then sends a message over a cellular network to your preselected emergency contact(s) unless you manually cancel the process. The low barrier to entry convinced me to spend a couple months with the Aleck device, and it’s now become a regular part of my kit, even though I still haven’t actually “used” it.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/06/TOCSEN-02.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/06/TOCSEN-02.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/06/TOCSEN-02.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/06/TOCSEN-02.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/06/TOCSEN-02.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/06/TOCSEN-02.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/06/TOCSEN-02.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/06/TOCSEN-02.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Aleck recently acquired German tech brand, Tocsen, who makes the sensors integrated in bike and snow helmets from Uvex and Alpina. This is essentially that same sensor, packaged into a small external device that can adhere to any helmet. It has a few other functions besides texting an SOS message, but we’ll get to those later. The process starts when the device senses an impact severe enough to potentially cause a brain injury. There’s a lot to learn about the long-term effects of TBI, but there’s a wealth of knowledge in that field these days. Although the forces it takes to cause unconsciousness or impairment can vary from person to person, science has a pretty good idea of what those forces are. Tocsen combined “readily available resources such as white papers and comprehensive studies on head impacts” with their own studies on how those impacts can be measured through a helmet. They told me it’s not as simple as just sensing the intensity of a single moment of deceleration, but wouldn’t go into detail. Only that it is gathering information “during and after a collision” to determine the severity of a crash, and whether it was a crash at all.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/06/TOCSEN-03.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/06/TOCSEN-03.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/06/TOCSEN-03.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/06/TOCSEN-03.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/06/TOCSEN-03.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/06/TOCSEN-03.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/06/TOCSEN-03.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/06/TOCSEN-03.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>False alarms were my first concern but I didn’t experience any during testing.. Tocsen claims the device’s programming can tell the difference between a crash and, for example, dropping a helmet on concrete. I tested this several times by dropping an Aleck-equippped helmet (that was destined for decommissioning) and it did not trigger a response. But this is a tricky balance, because Tocsen tunes the device to err on the side of caution. It’d be better to have a false alarm than to ignore an emergency. That’s why there’s a 30-second warning before an SOS is sent. Because I still haven’t *knock on wood* crashed while using the Aleck device, everything I learned about what would happen if I <i>had</i> crashed was from the handy test mode.</p>\n<p><img loading=\"lazy\" width=\"750\" height=\"1334\" src=\"https://media.theradavist.com/uploads/2023/06/IMG_6430.png?resize=150,150&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/06/IMG_6430.png?w=750&amp;quality=75 750w, https://media.theradavist.com/uploads/2023/06/IMG_6430.png?resize=700,1245&amp;quality=75 700w\" /> <img loading=\"lazy\" width=\"750\" height=\"1334\" src=\"https://media.theradavist.com/uploads/2023/06/IMG_6431.png?resize=150,150&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/06/IMG_6431.png?w=750&amp;quality=75 750w, https://media.theradavist.com/uploads/2023/06/IMG_6431.png?resize=700,1245&amp;quality=75 700w\" /> <img loading=\"lazy\" width=\"750\" height=\"1334\" src=\"https://media.theradavist.com/uploads/2023/06/IMG_6433.png?resize=150,150&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/06/IMG_6433.png?w=750&amp;quality=75 750w, https://media.theradavist.com/uploads/2023/06/IMG_6433.png?resize=700,1245&amp;quality=75 700w\" /></p>\n<p>That mode temporarily boosts the device’s sensitivity. Just give it a shake and it’ll sound the alarm and trigger the system. It’s nice that the noise comes from the device, not the phone, so there’s very little chance that I’d sleep through a false alarm if my phone is on silent and/or in my pack. If I don’t cancel the call within 30 seconds, a message goes out to all emergency contacts I’ve added in the app that I’ve crashed. Most importantly, it includes a Google Maps link to my location pulled from my phone’s GPS data. There are some added functions if your emergency contact has the Tocsen app, but it’s not necessary. Strangely, it <em>is</em> necessary that they have cell service. In my experience, those with wifi texting will not receive a notification.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/06/TOCSEN-04.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/06/TOCSEN-04.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/06/TOCSEN-04.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/06/TOCSEN-04.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/06/TOCSEN-04.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/06/TOCSEN-04.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/06/TOCSEN-04.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/06/TOCSEN-04.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>There’s also an optional feature that will send a similar message to all active users of the Tocsen app within a 1.8-mile radius, regardless of whether they’re on your contact list. And there’s a “Back Home Timer” that will automatically send a message with your last recorded location to your contacts if you don’t get back to civilization to shut it off in time. Although we all know we should tell someone when to expect us and where we’re going if we’re heading out alone, the location notification aspect of the Back Home Timer goes one better. But really, it’s the emergency contact message that got me on board.</p>\n<p>The app interface is no-fuss. It’s not overloaded with features. The stuff you’d use most isn’t hidden or complicated, though there are some leftover German phrases here and there that haven’t been translated. Adding or removing contacts is done right in the first screen. For some reason, the app mistakenly told me all the contact numbers I was adding were not cell numbers and “likely” would not receive texts, but messages got through regardless. It’s also recommended to leave GPS permissions on at all times in your system settings, not just when using the app. Seemed odd, but I agreed. Then, my phone nudged me at some point in the week between setup and my first ride to say that the Tocsen app hadn’t actually been using my location all that much, and I could probably go to a <i>while-using-the-app-only</i> GPS permission setting. But I’m satisfied that it’s not draining my battery, so I’m leaving it as-is.</p>\n<p><img loading=\"lazy\" width=\"750\" height=\"1334\" src=\"https://media.theradavist.com/uploads/2023/06/IMG_6502.png?resize=150,150&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/06/IMG_6502.png?w=750&amp;quality=75 750w, https://media.theradavist.com/uploads/2023/06/IMG_6502.png?resize=700,1245&amp;quality=75 700w\" /> <img loading=\"lazy\" width=\"750\" height=\"1334\" src=\"https://media.theradavist.com/uploads/2023/06/IMG_6497.png?resize=150,150&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/06/IMG_6497.png?w=750&amp;quality=75 750w, https://media.theradavist.com/uploads/2023/06/IMG_6497.png?resize=700,1245&amp;quality=75 700w\" /> <img loading=\"lazy\" width=\"750\" height=\"1334\" src=\"https://media.theradavist.com/uploads/2023/06/IMG_6500.png?resize=150,150&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/06/IMG_6500.png?w=750&amp;quality=75 750w, https://media.theradavist.com/uploads/2023/06/IMG_6500.png?resize=700,1245&amp;quality=75 700w\" /></p>\n<p>There’s also a battery indicator for the device itself in the app, which I noticed does drain steadily but slowly over the course of a few days. I didn’t have to charge it every week, but I didn’t feel comfortable waiting <i>two</i> weeks. It’s a bit of a pain because—rigid adhesion to the helmet being crucial—there’s no quick-release function. I had to essentially plug my helmet in to charge it. That also means there’s no swapping the device between helmets, which would be a nice feature for folks like me who like to regularly swap between three perfectly good helmets for some reason. Also, it doesn’t wake automatically. I have to open the app and sorta digitally tap some dials to get it connected. Really, though, the only feature I needed that Aleck can’t deliver is messaging capability outside of cell service. According to Tocsen, “The amount of data which has to go through is minimal, just about the size of an SMS,” so you don’t need 5G, or even 3G. But there’s no G whatsoever on a lot of my trails. The Back Home Timer message is a nice feature, because it gets triggered whether I have service or not. And if I’m out of range when that message is sent, and if I did tell someone my route, they should be able to narrow down my location given the data in that message. It’s not perfect, but going back to what initially eased my skepticism about the Aleck device, I don’t think that matters. Helmets aren’t perfect, and we still wear them. When preparing for the worst, all we can do is our best. I said it in my <a href=\"https://theradavist.com/bike-ride-essentials/#meta\">on-bike-essentials story</a>, but every time we ride, especially when we ride alone, we’re kinda rolling the dice. And if you’re like a lot of Radavist readers, you’re often doing long, remote rides, maybe sometimes for days on end. The gear we choose to bring is based not just on how likely we are to need it, but how convenient it is to have and to hold. Like, I probably won’t lug around a camp chair even if it’ll definitely save my back. But I’ll stick a $60 piece of plastic on my helmet if it might save my life.</p>\n<p>The post <a href=\"https://theradavist.com/aleck-tocsen-helmet-crash-sensor/\">A Cry For Help: Reviewing the Aleck Tocsen Helmet Crash Sensor Without Actually Using It</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"Travis Engel","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"41165b542e2bd39d257f502a9f032fbe041f4e8272ab722fdfaad0ce5fd0ee3f","category":"Cycling"}