{"title":"An Empirical Social Vulnerability Map for Flood Risk Assessment at Global Scale (“GlobE‐SoVI”)","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003895?af=R","date":1709287997000,"content":"<h2>Abstract</h2>\n<p>Fatalities caused by natural hazards are driven not only by population exposure, but also by their vulnerability to these events, determined by intersecting characteristics such as education, age and income. Empirical evidence of the drivers of social vulnerability, however, is limited due to a lack of relevant data, in particular on a global scale. Consequently, existing global-scale risk assessments rarely account for social vulnerability. To address this gap, we estimate regression models that predict fatalities caused by past flooding events (<i>n</i> = 913) based on potential social vulnerability drivers. Analyzing 47 variables calculated from publicly available spatial data sets, we establish five statistically significant vulnerability variables: mean years of schooling; share of elderly; gender income gap; rural settlements; and walking time to nearest healthcare facility. We use the regression coefficients as weights to calculate the “<i>Glob</i>al-<i>E</i>mpirical <i>So</i>cial <i>V</i>ulnerability <i>I</i>ndex (GlobE-SoVI)” at a spatial resolution of ∼1 km. We find distinct spatial patterns of vulnerability within and across countries, with low GlobE-SoVI scores (i.e., 1–2) in for example, Northern America, northern Europe, and Australia; and high scores (i.e., 9–10) in for example, northern Africa, the Middle East, and southern Asia. Globally, education has the highest relative contribution to vulnerability (roughly 58%), acting as a driver that reduces vulnerability; all other drivers increase vulnerability, with the gender income gap contributing ∼24% and the elderly another 11%. Due to its empirical foundation, the GlobE-SoVI advances our understanding of social vulnerability drivers at global scale and can be used for global (flood) risk assessments.</p>","author":"Lena Reimann, \nElco Koks, \nHans de Moel, \nMarijn J. Ton, \nJeroen C. J. H. Aerts","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"411dc5c75613d06f45700828a2b680b76d8af5387b27a292bbb3c2e730463dd9","category":"Environment"}