{"title":"Strong Activation of p53 by Actinomycin D and Nutlin-3a Overcomes Resistance of Cancer Cells to the Pro-apoptotic Activity of FAS Ligand","link":"https://www.preprints.org/manuscript/202310.1608/v2","date":1713419488000,"content":"The FAS ligand (FASLG) is expressed on lymphocytes, which employ it to activated death receptors on targets cells. Cancer cells are generally resistant to apoptosis triggered by FASLG. In this work we found a way to circumvent this resistance by treatment with actinomycin D (ActD) and nutlin-3a (Nut3a). We selected this drug combination based on our transcriptomic data showing strong activation of proapoptotic genes, including the ones for receptor mediated apoptosis, in cells exposed to actinomycin D and nutlin-3a. To test our hypothesis, we pre-exposed cancer cell lines to this drug combination for 45h and next we treated them with recombinant FASLG. This almost instantaneously killed most cells.  Actinomycin D and nutlin-3a strongly synergized in the sensitization because the effect of the drugs acting solo was not as spectacular as the drug combination, which together with FASLG killed more than 99% of cells. Based on the caspase activation pattern (caspase-8, caspase-9, caspase-10), we conclude that both extrinsic and intrinsic pro-apoptotic pathways were engaged. In engineered p53-deficient cells this pro-apoptotic effect was completely lost. Therefore, the combination of ActD+Nut3a activates p53 in an extraordinary way, which overcomes the resistance of cancer cells to apoptosis triggered by FASLG. Interestingly, other combinations of drugs, e.g., etoposide + nutlin-3a, actinomycin D +  RG7112 and actinomycin D + idasanutlin had similar effect. Moreover, normal human fibroblasts are less sensitive to death induced by ActD+Nut3a+FASLG. Our findings create the opportunity to revive the abandoned attempts of cancer immunotherapy employing the recombinant FAS ligand.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"41233c6323d00968e76b2df86807179e194f4fb77424255dbb02c7ad811356cb","category":"Interdisciplinary"}