{"title":"Cute, fun to ride, but does it have a future? The Honda Motocompacto","link":"https://arstechnica.com/?p=1980026","date":1698843633000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/IMG_1298-800x450.jpg\" alt=\"A fleet of six Honda Motocompactos\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/IMG_1298.jpg\">Enlarge</a> <span>/</span> The Motocompacto was the product of one engineer's spare time. (credit: Kevin Williams)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The transition to electrified transportation can come across as boring, which, arguably, isn't all that untrue. Shouty, gas-powered sports cars have been replaced on roads by beige-colored electric crossovers. Electric scooters are ubiquitous now, cavalierly and awkwardly piled up on street corners of any global metropolitan center, serving as last-mile solutions for those unwilling to wait in traffic in the backseat of a rideshare car. It's hard to remember that electric vehicles can be fun, exciting, interesting, and maybe most importantly—cute. The Honda Motocompacto might just be the cutest little last-mile solution and maybe the most exciting electric vehicle on the market, even if Honda itself isn't quite sure what to do with it.</p>\n<p>The Motocompacto certainly looks like no other electric scooter on the market. Appearing like a secret agent's gadget from the Spy Kids universe, the all-white box can transform from what easily could be confused as a briefcase to an oddly rectangular sit-down scooter. Unique, if not unfamiliar, the Motocompacto's form factor could seem a little contrarian in the era of traditional stand-up scooters or sit-down moped ones. I mean, who wants to straddle a motorized briefcase?</p>\n<p>Well, it's because the Motocompacto is a modern reinterpretation of an iconic Honda scooter—the Motocompo. Back in the early 1980s, Honda sold a square-shaped (gas-powered) scooter, meant to fold up and fit in the trunk of its City subcompact hatchback. Even though neither the Motocompo nor the Honda City ever made their way outside of Japan, the outrageously cute form factor serves as inspiration for the similarly named Motocompacto. Heck, Honda has even shown it off in the cargo area of the Prologue EV crossover, <a href=\"https://youtu.be/Jq6JL1lhLIw?si=-hfUwaZ5q882_dK0\">surely a nod to this charmingly Ska-filled ad.</a></p></div><p><a href=\"https://arstechnica.com/?p=1980026#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1980026&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"412a42093d946a4410f51e0205e7034b5d0a8fe1cb465d67a143a7590e787004","category":"Tech"}