{"title":"The spatiotemporal context of individual specialization in resource use and environmental associations","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14090?af=R","date":1714980918000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d0bd4fdf-d535-4531-950a-b742e0d96550/jane14090-toc-0001-m.png\" alt=\"The spatiotemporal context of individual specialization in resource use and environmental associations\" />\n<p>We propose an integrative view of individual specialization across biotic and abiotic axes that brings this concept closer to the <i>n</i>-dimensional niche envisioned by Hutchinson.</p>\n<br />\n<h2>Abstract</h2>\n<p>1. Individual niche specialization is widespread in natural populations and has key implications for higher levels of biological organization. This phenomenon, however, has been primarily quantified in resource niche axes, overlooking individual variation in environmental associations (i.e. abiotic conditions organisms experience).</p>\n<p>2. Here, we explore what we can learn from a multidimensional perspective of individual niche specialization that integrates resource use and environmental associations into a common framework.</p>\n<p>3. By combining predictions from theory and simple simulations, we illustrate how (i) multidimensional intraspecific niche variation and (ii) the spatiotemporal context of interactions between conspecifics scale up to shape emergent patterns of the population niche.</p>\n<p>4. Contemplating individual specialization as a multidimensional, unifying concept across biotic and abiotic niche axes is a fundamental step towards bringing this concept closer to the <i>n</i>-dimensional niche envisioned by Hutchinson.</p>\n<h2>Resumo</h2>\n<p>1. A especialização individual de nicho é prevalente em populações naturais e tem implicações importantes para níveis de organização biológica superiores. Esse fenômeno, entretanto, tem sido principalmente quantificado em eixos do nicho que representam o uso de recursos, negligenciando a variação individual em associações ambientais (i.e. as condições abióticas que organismos experimentam).</p>\n<p>2. Aqui, exploramos o que podemos aprender a partir de uma perspectiva multidimensional da especialização individual que integra o uso de recursos e associações ambientais em uma abordagem única.</p>\n<p>3. Ao combinar predições da teoria e simulações simples, ilustramos como (i) a variação intraespecífica multidimensional de nicho e (ii) o contexto espaço-temporal de interações entre conspecíficos podem moldar padrões emergentes do nicho de populações.</p>\n<p>4. Encarar a especialização individual como um conceito multidimensional e unificador em eixos do nicho bióticos e abióticos é um passo fundamental na direção de aproximar esse conceito do nicho <i>n</i>-dimensional idealizado por Hutchinson.</p>","author":"Raul Costa‐Pereira, \nPei‐Jen Lee Shaner","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"412a821bfc92cbf675a66d5b711a915e7bf693b50ecbecdd3ae4b3990991db0d","category":"Environment"}