{"title":"Framework for Generative Artificial Intelligence Enhanced Microscopy Image Analysis Automation of Metallic Materials: a Case Study","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.170/7719372?rss=1","date":1721779200000,"content":"<span>The characterization of the process-structure-property relationship is essential to optimize processes in manufacturing. However, in practice it often suffers from a lack of quantity and quality in datasets. In an industrial setting subject to time-sensitive considerations, such as troubleshooting by investigating defective parts through microscopy characterization, data are often obtained with suboptimal sample preparation and imaging conditions with limited sampling. Furthermore, the difficulty in quantitatively describing complex microstructures can be compounded by a lack of specialized expertise in industry. To address these challenges, automated extraction of quantitative microstructure data has become a main objective. In recent years, effective approaches have been developed leveraging advanced digital image processing and deep learning techniques [<a href=\"#ozae044.170-B1\">1–3</a>]. Specifically, models employing a U-Net architecture [<a href=\"#ozae044.170-B4\">4</a>] have demonstrated proficiency in performing semantic segmentation of microstructure images with complex contrasts [<a href=\"#ozae044.170-B5\">5–9</a>], a task that traditional histogram-based methods struggle with. However, it is notable that these models, when trained on a specific dataset, may underperform on new images that slightly differ in sample preparation or imaging conditions [<a href=\"#ozae044.170-B10\">10</a>]. These variations, often subtle and challenging to control, can significantly impact the model's accuracy to provide reliable microstructure quantification results.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"412e223ba65690ab197e6535ba49f386984df6d1e8b111d2a81e2abfa3f3230c","category":"Environment"}