{"title":"Evaluation of Compliance and Accuracy in Parkinson&#039;s Disease Motor Symptom Tracking: A Comparative Study of Digital and Traditional Paper Diaries Using a Smartphone Application (My Parkinson’s)","link":"https://www.preprints.org/manuscript/202408.2167/v1","date":1724937348000,"content":"Background/Objectives: This study aimed to evaluate compliance and accuracy in comparison with traditional PD diaries for tracking motor symptoms using a new smartphone application (My Parkinson’s) and paper diary strategies. Parkinson's disease (PD) is a neurodegenerative disorder with progressive motor symptoms. Treatment becomes more challenging as PD progresses, motor complications in the form of wearing-off phenomenon and levodopa-induced dyskinesia develop. Traditional paper diaries and clinical scales used to evaluate patients may be inadequate in assessing whether the patient is “on” or “off,” resulting in less-than-ideal treatment changes. Methods: A randomized crossover design was utilized to examine 22 advanced PD patients who underwent symptomatic assessment with both diaries during two separate 24-hour periods seven days apart. The compliance and accuracy of data were assessed by comparing diary entries with the clinical examination notes and WhatsApp queries. Latterly, patients' diary preferences were also evaluated.; Results: The digital diary had significantly better compliance and accuracy than the paper diaries, with substantial/almost perfect levels of agreement (κ = 0·615 to 0·818) between logged symptoms and clinical examination notes. 65% of patients preferred the digital diary for follow-ups, and there was no significant difference in ease of use compared to paper diaries. Conclusions: Digital diaries are helpful in the clinical management of PD patients as they minimize recall bias and reduce data errors in appropriately selected patients. Our study suggests a broader adoption of digital health technologies in PD management. Still, additional research is necessary to improve the tools and assess long-term patient outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"41396c53ce66df78ce1c8ac71542308ce8da7391a6951e4dba96e80c8d026954","category":"Interdisciplinary"}