{"title":"Classification of industrial tapioca starch hydrolysis products based on their Brix and dextrose equivalent values using near‐infrared spectroscopy","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13546?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Industrial starch hydrolysis allows the production of syrups with varying functionality depending on their Brix value and dextrose equivalent (DE). As the current methods for evaluating these products are labor-intensive and time-consuming, the objective of this study was to investigate the potential of near-infrared (NIR) spectroscopy for classifying the different tapioca starch hydrolysis products.</p>\n<h2>RESULTS</h2>\n<p>NIR spectra of samples of seven products (<i>n</i> = 410) were recorded in transflectance mode in the 12 000–4000 cm<sup>−1</sup> range. Next, orthogonal partial least squares (OPLS) regression models were built to predict the Brix and DE values of the different samples. To classify the different starch hydrolysis products, support vector machines (SVM) were trained using either the raw spectra or latent variables (LVs) obtained from the OPLS models. The best classification accuracy was obtained by the SVM classifier based on the LVs from the OPLS model for DE prediction, resulting in 95% correct classification over all classes.</p>\n<h2>CONCLUSION</h2>\n<p>These results show the potential of NIR spectroscopy for classifying tapioca starch hydrolysis products with respect to their functional properties related to the Brix and DE values. © 2024 Society of Chemical Industry.</p>","author":"Chayanid Sringarm, \nSonthaya Numthuam, \nSudarat Jiamyangyuen, \nSila Kittiwachana, \nWouter Saeys, \nSaowaluk Rungchang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"4143b413c8cccfec186bb849ce929eebe39ab776d1f897fdd33c409feeac25f5","category":"Environment"}