{"title":"41 percent of consumers say their next car will be electric","link":"https://arstechnica.com/?p=1781571","date":1626792110000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1003369244-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1003369244.jpg\">Enlarge</a> <span>/</span> The biggest impediment to EV adoption appears to be cost of ownership, according to EY's 2021 Mobility Consumer Index. (credit:  Carlos Sanchez Pereyra/Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Electric vehicles are increasingly breaking into the mainstream. According to <a href=\"https://www.ey.com/en_gl/automotive-transportation/how-did-a-global-crisis-pave-the-way-for-ev-sales\">a new survey conducted by EY</a>, 41 percent of consumers planning to buy a car say their next vehicle will be a plug-in. And they're mainly making that decision because of the environmental impact.</p>\n<p>EY surveyed 9,000 consumers across 13 countries (Australia, Canada, China, Germany, India, Italy, Japan, New Zealand, Singapore, South Korea, Sweden, the UK, and the US) in June of this year as part of its Mobility Consumer Index. The last time the firm conducted this survey, in September 2020, just 30 percent said their next car would be either a battery EV or plug-in hybrid EV.</p>\n<h2>Where do BEVs beat ICE?</h2>\n<p>EV adoption is moving faster in some places than others. In China, for example, 48 percent say their next car will be an EV, and only 43 percent say it will have an internal combustion engine (with 3 percent looking for a hydrogen fuel cell EV and the remaining 5 percent saying they are unsure). Sweden's numbers are near-identical, with a matching 48 percent wanting an EV.</p></div><p><a href=\"https://arstechnica.com/?p=1781571#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1781571&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"416387e7839aee4324bb94ca4358a407f685897928eba818849b5a8463f0ee17","category":"Tech"}