{"title":"Up front: Orla Chennaoui profile","link":"https://www.cyclist.co.uk/in-depth/orla-chennaoui-interview","date":1683304448000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/orla-chennaoui-interview\">Up front: Orla Chennaoui profile</a></p>\n\n<p>Orla Chennaoui is not a former pro racer; she doesn’t come from a family of cyclists and she hasn’t spent a lifetime immersed in cycling culture. So how has she come to find herself hosting Eurosport’s cycling coverage and commenting on the biggest races in the world?</p>\n\n\n\n<p>‘It’s an odd thing, I think, when I look at it in isolation,’ says Chennaoui as she reflects on her career in the media.</p>\n\n\n\n<div></div>\n\n\n\n<p>‘I learned to ride my bike as a kid. I lived in the countryside in Northern Ireland and would often spend my summer holidays on my bike with my two cousins, Maeve and Maria. We’d cycle to each other’s houses and then go play in the rivers and fields, but that’s as far as it went.</p>\n\n\n\n<p>‘I remember there was one kid at school called Jim who was a competitive cyclist, and at the time we all thought it was weird that Jim shaved his legs. For us it was the definition of strange. I grew up after the time of Sean Kelly and Stephen Roche, so I was aware of the amazing things they’d done – the Irish don’t win very much – but I didn’t get back into cycling until work reintroduced me to it, and I fell in love with it straight away.’</p>\n\n\n\n<p><strong>• Read more: <a href=\"https://www.cyclist.co.uk/news/how-to-watch-and-live-stream-the-giro-ditalia\" target=\"_blank\">How to watch the 2023 Giro d’Italia</a></strong></p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/news/orla-chennaoui-podcast\">Cyclist Magazine Podcast episode 77: Orla Chennaoui, the face of pro cycling</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/news/how-to-watch-and-live-stream-the-giro-ditalia\">How to watch the Giro d’Italia 2023</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/giro-ditalia-watch-live-stages-route-riders-teams-start-list\">Giro d’Italia 2023: Everything you need to know including route, favourites, how to watch and start list</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>Making moves</h2>\n\n\n\n<p>Chennaoui began her journalism career in print, then moved into radio, then local television in England, national television in Scotland and then to Sky, where she was a news correspondent at the age of 26.</p>\n\n\n\n<p>‘It was entirely my decision to move into cycling,’ she says. ‘I became quite disillusioned with news and there was a job opening for the London Olympics, which were coming up in a few years. I applied, got the job and then it just made sense to start with cycling because the British Cycling team had been so successful in Beijing. I proposed cycling trips and stories, and I was like, hey, this is a lot of fun, and other sports didn’t even get a look in. By the time Team Sky came into being [in 2010], I was the only person really within Sky News and Sky Sports News who’d been actively working in cycling for any length of time and knew any of the characters involved in it.’</p>\n\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-02-647x970.jpg\" alt=\"Orla Chennaoui\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-02-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-02-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-02-768x1152.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-02-1024x1536.jpg 1024w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-02-750x1125.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-02-1140x1710.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-02.jpg 1200w\" /><figcaption>Wesley Verhoeve</figcaption></figure></div>\n\n\n<p>Chennaoui’s passion for the sport grew exponentially as she became more involved in the story of Britain’s emergence as a cycling nation and got to sample the delights of life on two wheels for herself.</p>\n\n\n\n<p>‘My first road cycling trip was to go to Tuscany to interview Geraint Thomas and Ben Swift in advance of them being signed for Team Sky. Mark Cavendish had just won Milan-San Remo and Steve Cummings was there as well. You’re following these riders through the beautiful winding roads of Tuscany, and I thought, “This is what I want to be doing for the foreseeable future.” And that was it, I was hooked.</p>\n\n\n\n<p>‘Then I went to my first bike race, and it just pulled me in deeper and deeper. I just wanted to do more cycling, which was the reason I eventually ended up leaving Sky.’</p>\n\n\n\n<p>Chennaoui joined Eurosport in May 2019 as lead presenter of their cycling coverage, alongside Sir Bradley Wiggins, which led to presenting <em>The Breakaway</em> show alongside Adam Blythe and Daniel Lloyd.</p>\n\n\n\n<p>‘I’m so lucky, and I’ve got so much respect for the guys,’ says Chennaoui. ‘The reason it works is that they respect me in return. That’s not a given as a woman who has never ridden a bike competitively, but they respect what my job is. We all love watching bike racing, we genuinely just love to chat about it and none of us takes life too seriously, but we all really care about the show.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"842\" height=\"297\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3.jpg 842w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-300x106.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-768x271.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-750x265.jpg 750w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p>‘Often with television, a particular ego will get in the way and people will want to present themselves in a way that matters more to them than the show, but we’re all trying to do the same thing, which is make the show as good as it can possibly be.</p>\n\n\n\n<p>‘I take some time off in the winter so that I can recalibrate and be with my kids and husband. Coming back into the studio this year was just like coming home; within ten minutes of sitting in the studio I was crying with laughter, I mean barely able to breathe, and it just felt so good. When we came off air, I said to Daniel there was a moment where I forgot we were on television. It felt like we were in the green room just talking about bike racing, like we would do anyway. It’s a real privilege.’</p>\n\n\n\n<h2>Life cycles</h2>\n\n\n\n<p>When Chennaoui talks about spending time with her family, she means at her home in Amsterdam, where she moved from London in 2018. ‘We came here knowing nothing about Amsterdam, but I fell in love with the city straight away. Other than where I grew up in Northern Ireland I’ve never lived somewhere I’ve felt so at home.</p>\n\n\n\n<p>‘When I first moved over here, even though I work in cycling, I saw everyone getting around on bikes and was like, “Well, this is a bit hippy, a bit lefty, a bit weird and kooky.” Then I realised very quickly there was absolutely nothing hippy about it – it’s just incredibly efficient. For a start it’s much easier because you’re avoiding traffic, but also it makes everyone more open and outward looking, and I feel a much deeper sense of connection in my community here than you get in a car society. It changes how everyone interacts with each other, and I think this is something that anyone who has not lived in a bike society will never really appreciate.</p>\n\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-03-647x970.jpg\" alt=\"Orla Chennaoui\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-03-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-03-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-03-768x1152.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-03-1024x1536.jpg 1024w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-03-750x1125.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-03-1140x1710.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-03.jpg 1200w\" /><figcaption>Wesley Verhoeve</figcaption></figure></div>\n\n\n<p>‘I genuinely believe that the fact we all get around by bikes makes such a difference and it is fundamental to my daily wellness to be outside on bicycles.’</p>\n\n\n\n<p>Another aspect of Chennaoui’s sense of personal wellbeing comes from her choice of clothes, which frequently garner considerable attention from viewers, mainly for being so bright and bold.</p>\n\n\n\n<p>‘It’s something I’m grateful for, to be honest, and the reason I say that is because it makes me question what I represent and the values I live by,’ she says.</p>\n\n\n\n<p>‘The reasons that I dress the way I do are multi-layered, one of them being that I suffered postnatal depression and anxiety, and in that period I felt like I completely lost everything: my mind and my body. When I started dressing this way it was a call to other women in particular to say you will find yourself again, you’ll get your personality back, you’re still you somewhere, and you might even be a brighter, bigger, bolder version of you.</p>\n\n\n\n<p>‘So that was a big part of it to begin with. But there’s also, increasingly, a heightened awareness of how we age as women, and how we as a society have this need to put women in boxes.</p>\n\n\n\n<p>‘If you are in your twenties, you’re expected to be sexualised because that is the male gaze and so you dress according to that,’ she says. ‘Then once you start to have children you’re supposed to become more maternal, because otherwise it confuses people and it confuses that male gaze. Once you’re seen to have fulfilled a certain stage in your life, you’re supposed to change visually as you move on.</p>\n\n\n\n<p>‘I don’t feel that is in any way imposed on men, and I don’t want to genderise everything, but men are allowed to express themselves through clothing. Most of them don’t, and that’s their choice, but men are allowed to be all things at all times, and women aren’t so much.</p>\n\n\n\n<p>‘If how I dress makes other people feel uncomfortable, that’s not my problem,’ she adds. ‘It’s my problem if I feel uncomfortable, but if someone else feels uncomfortable, and they’re self-aware enough, they’ll question why they feel that discomfort and it might bring them to a point of enlightenment and awareness.’</p>\n\n\n\n<h2>More, more, more</h2>\n\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-04-647x970.jpg\" alt=\"Orla Chennaoui\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-04-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-04-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-04-768x1151.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-04-1025x1536.jpg 1025w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-04-750x1124.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-04-1140x1709.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-04.jpg 1200w\" /><figcaption>Wesley Verhoeve</figcaption></figure></div>\n\n\n<p>Even in the relatively short time that Chennoaui has been presenting cycling on TV and co-hosting <em>The Cycling Podcast Féminin</em>, she has witnessed a huge amount change in the women’s sport – but nothing, she says, as powerful or as memorable as the 2022 Tour de France Femmes.</p>\n\n\n\n<p>‘Seeing all the fans that had turned up to a bike race that stood by itself and wasn’t an add-on in any way to the men’s racing was the most emotional I’ve been watching a bike race,’ says Chennaoui. ‘I had to bring tissues on set because I was crying and I don’t usually get that emotional about bike races.</p>\n\n\n\n<p>‘The last day of the Tour de France Femmes was also the day of the Women’s Euros finals when England were playing, and I was sent a picture of my daughter and her friend sitting at home watching sport. The contrast in the media and sporting landscape from when I grew up was so overwhelming that I just felt so emotional and so, so proud to be a part of it in a tiny way, and so happy to be alive at this time when everything’s changing for our girls. I hope I’ll never forget what that felt like.’</p>\n\n\n\n<p>Chennaoui is also confident in the continued growth and depth of the women’s peloton.</p>\n\n\n\n<p>‘I find women’s cycling more exciting and more interesting in an objective sense than ever before. In men’s racing the talent is spread all over the place – even at the Tour de France we won’t see all the best riders, like Remco Evenepoel and Primož Roglič. But in the Women’s WorldTour we see the very best riders at almost every race. And that’s absolutely thrilling.</p>\n\n\n\n<p>‘It’s a brilliant time to be following women’s racing as well because we’re seeing riders in the twilight of their careers still winning the biggest races, but we’re also seeing riders coming through development squads and professional teams from a much younger age.</p>\n\n\n\n<p>‘We didn’t use to have the younger riders able to come through and compete, because they would have to go off and have a job or do their education and have a plan B before coming back into bike racing, so we would see this talent coming to fruition an awful lot later. Now we’ve got the likes of Pfeiffer Georgi winning at the age of 22 and Shirin van Anrooij [21] also winning. But then we’ve also got Ashleigh Moolman-Pasio [37] still able to win any bike race in the world, and obviously Marianne Vos [35] and Annemiek van Vleuten [40]. There’s depth across the entire peloton that I think is really, really exciting.’</p>\n\n\n\n<h2>Balancing act</h2>\n\n\n\n<p>Chennaoui’s Instagram bio reads ‘balls may drop’, a hint at all the demands she juggles, such as work (she also writes for <em>The</em> <em>Belfast Telegraph</em> and other media outlets), her family and her own hobbies.</p>\n\n\n\n<p>‘We talk about women having it all and it’s funny, we don’t do that with men; men just have it,’ she remarks. ‘My life is very, very busy but I’m really lucky that I’ve filtered out all the stuff that I don’t like to do. When it’s something that you love doing, you’ll always make time for it but a lot of it is time management. For instance, I’ll set my alarm for 4:30 in the morning so that I have time to properly write a column before the kids get up for school.</p>\n\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-05-647x970.jpg\" alt=\"Orla Chennaoui\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-05-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-05-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-05-768x1152.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-05-1024x1536.jpg 1024w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-05-750x1125.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-05-1140x1710.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-05.jpg 1200w\" /><figcaption>Wesley Verhoeve</figcaption></figure></div>\n\n\n<p>‘I try to make my own boundaries, which is really important too,’ she adds. ‘The other thing is that my party days are behind me. I don’t drink, which frees up a bucketload of time. When my kids came along I shifted the things that didn’t matter to me so that I could keep everything that does. I don’t know if there is a secret to any of it, it’s just hard work. I guess that’s the secret: I work bloody hard.</p>\n\n\n\n<p>‘My early career taught me the value of hard work and how nothing replaces that, and there is no shortcut to get past hard work. No one can ever take hard work away from you as well, which is a brilliant thing. I spent years doing the night shift at Sky where I would arrive at 9pm and leave at 7am, and I didn’t see my husband, but that was good training for the value of hard work.’</p>\n\n\n\n<p>Does Chennoaui ever stop? Not really, as it turns out.</p>\n\n\n\n<p>‘I’m a classically trained violinist,’ she says, grinning. ‘I played in the school orchestra for years and was first violin. I played from primary school until I was about 18. I haven’t played the violin in years and I want to get back into it again. I’ve got a few violins, including my original from when I was little. It’s a bit smashed up, though, so I need to take it to a repair shop.</p>\n\n\n\n<p>‘I absolutely love music and want music to be a part of our home. We bought a piano a few years ago as my daughter is learning, so I’ve been learning with her, but the other day I was thinking why am I doing eight-year-old piano bits? Why don’t I just play the violin again?</p>\n\n\n\n<p>‘But all my other life projects get in the way. It’s all about priorities. I’m also doing psychology MOOCs [mass open online courses] at the minute – they’re an amazing way to learn and I’m prioritising my studies over other things.</p>\n\n\n\n<p>‘There’s a lot to fit into life.’</p>\n\n\n\n<h2>Orla on…</h2>\n\n\n<div>\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-06-970x647.jpg\" alt=\"Orla Chennaoui\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-06-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-06-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-06-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-06-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-06-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-06-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-06-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-06-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/orla-chennaoui-profile-06.jpg 1200w\" /><figcaption>Wesley Verhoeve</figcaption></figure></div>\n\n\n<h3>…the pressure of success</h3>\n\n\n\n<p>‘I’m lucky that I didn’t feel pressure to be hugely successful when I was young. I think these days a lot of young people are almost hampered by that, and what they don’t realise is that you can’t get to where you want to be without hard work. We as humans tend to want to accelerate the process to get to our destination as quickly as possible, but the destination isn’t where we’re going to get our meaning. Our meaning comes in the journey. I think we have to appreciate that journey a little bit more and be OK with learning as we go and not expecting to know everything.’</p>\n\n\n\n<h3>…the Tour de France</h3>\n\n\n\n<p>‘There is no other race that means so much and in which so much can happen and so much can fall apart. But what I love about the Tour de France is that every day you can make amends; every day is another possibility to speculate on how it can go right and how it can go wrong, and it’s never really over until it’s actually over. That in itself is a beautiful metaphor for life. There’s a reason it’s the most famous bike race in the world. It’s utter beauty and devastation on two wheels. I love it.’</p>\n\n\n\n<h3>…Wout van Aert vs Mathieu van der Poel </h3>\n\n\n\n<p>‘That rivalry for me is just everything. I don’t want them to be friends – I want them to hate each other and keep pushing each other to dark places that bring the kinds of performances where we are screaming and standing on our feet, and also tearing our hair out when they sabotage it for each other. It’s just a beautiful rivalry and it’s a privilege to be able to watch that and be in the era of Wout and Mathieu.’</p>\n\n\n\n<p><strong>• This article originally appeared in issue 139 of <em>Cyclist </em>magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/orla-chennaoui-interview\">Up front: Orla Chennaoui profile</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"417906e438a9609651f20c9f862fd64624b869ebdae8ba1878199a037cd2dba3","category":"Cycling"}