{"title":"Environmental and ecological drivers of eye size variation in a freshwater predator: A trade‐off between foraging and predation risk","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14655?af=R","date":1725618290000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/b92ded3a-517e-498b-bad5-8d78e9b5fa55/fec14655-toc-0001-m.png\" alt=\"Environmental and ecological drivers of eye size variation in a freshwater predator: A trade-off between foraging and predation risk\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/08/28/predators-and-water-visibility-can-change-the-size-of-the-eye-in-a-freshwater-fish/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nVariations in the size and shape of the eye have been observed in many species of fish. As eye size is positively related to visual acuity, larger eyes should favour foraging and detection of predators.\n\nHowever, few studies have examined the variation in eye morphology in relation to the complexity of lake conditions, including environmental perturbation and spatial variation in predation and competition. Such tests are especially important as the degrading of the visual climate is expected due to climate change, where browning, turbidity and variations in structural complexity should set different demands for visual acuity of foraging fish under predation risk.\n\nIn this study, we tested the variation of the eye size among 667 individuals of an aquatic predator perch, <i>Perca fluviatilis</i>, from littoral and pelagic habitats of 14 lakes. We used Secchi depth to assess the effects of the visual climate of our lake systems, as fish foraging is highly related to visual conditions, and studied eye size variation in relation to the contribution of the pelagic resources to an individual's diet and the risk of predation.\n\nSecchi depth, the pelagic contribution to the diet and the percentage of piscivores had significant effects on eye size.\n\nThese variable outcomes suggest that the lake environment in terms of visual climate, predation landscape and diet are major factors of eye size variation in this generalist predator. As many fish species trade off foraging against predation risk, future studies will show whether the complexity of intra- and interspecific interactions contribute to the variation in eye size in freshwater fish.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/08/28/predators-and-water-visibility-can-change-the-size-of-the-eye-in-a-freshwater-fish/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Matilda L. Andersson, \nKristin Scharnweber, \nPeter Eklöv","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"417d64cf813dcff86f2589f6ad3a45b1235acd762b2ac836e02dd908707ac8ac","category":"Environment"}