{"title":"Discovery of a Bloch Point Quadrupole Coupling Topological Skyrmions and Antiskyrmions into Hybrid Strings via Holographic Vector Field Electron Tomography","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.500/7720115?rss=1","date":1721779200000,"content":"<span>Magnetic skyrmions and antiskyrmions are topological spin textures with opposite topological charge, NSk=14π∫∫n⋅(∂n∂x×∂n∂y)dxdy=−1 for skyrmions and NSk=+1 for antiskyrmions [<a href=\"#ozae044.500-B1\">1–3</a>]. These spin textures stabilize via the competition between the ferromagnetic exchange interaction and the Dzyaloshinskii-Moriya interaction. In two-dimensions, skyrmions may be described as Bloch- or Néel-type. Bloch-type skyrmions (Fig. 1a) are composed of Bloch domain walls, which are helical spin twists across the interface between two up/down domains, combining to form a vortex structure. On the other hand, Néel-type skyrmions are composed of Néel domain walls (cycloidal spin twists) that combine to form the source/sink-like real space structure shown in Fig. 1b. In contrast, antiskyrmions (Fig. 1c) have an antivortex real space structure and are composed of both Bloch and Néel domain walls, with the latter, denominated Bloch lines, existing as interfaces separating the Bloch domain walls. Recently, three-dimensional (3D) electron and X-ray imaging has demonstrated that in 3D, skyrmions are robust, flexible string-like objects that extend throughout the bulk of the sample [<a href=\"#ozae044.500-B4\">4</a>, <a href=\"#ozae044.500-B5\">5</a>]. What’s more, dipole-dipole energy has been shown to stabilize hybrid skyrmions composed of Néel skyrmion capping layers on the top and bottom with a Bloch-type skyrmion layer in the center [<a href=\"#ozae044.500-B6\">6</a>]. Such exotic spin textures are predicted to show markedly different dynamics from the two-dimensional (2D) Bloch-type skyrmion models, with much lower velocities and skyrmion Hall angles [<a href=\"#ozae044.500-B7\">7</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"418432eafb2c509898a9ecbec218f564dc23fa36eb3a7cc288725ce940301f6b","category":"Environment"}