{"title":"Apple Shares Details on How Apple Card Family Works","link":"https://www.macrumors.com/2021/05/06/apple-card-family-details/","date":1620349291000,"content":"Apple introduced the new <a href=\"https://www.macrumors.com/2021/04/20/apple-card-family/\">Apple Card Family feature</a> at its April event, unveiling the new functionality that will let two people share an <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a> and build credit together and that will also let children use a family ‌Apple Card‌ for purchases.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/apple-card-family.jpg\" />\r\n<br />\r\nAhead of the ‌Apple Card‌ Family launch, Apple has shared some specifics on how it will work in a <a href=\"https://support.apple.com/en-ph/HT212020\">new support document</a>.\r\n<br />\r\n\r\n<br />\r\nFor account co-owners, each participant must be at least 18 years old and will have their credit reported equally in their own names. Each person shares full responsibility for an account balance and all payments. Credit reporting includes positive and negative payment history for both users, in addition to credit utilization. There are several other features available as well:\r\n<br />\r\n<ul>\r\n<br />\r\n \t<li>They can immediately use their shared ‌Apple Card‌ to receive unlimited Daily Cash back on their transactions</li>\r\n<br />\r\n \t<li>They can add or remove participants and order a titanium ‌Apple Card‌ for participants who are 18 years or older</li>\r\n<br />\r\n \t<li>They can view participant activity and account co-owner activity</li>\r\n<br />\r\n \t<li>They can set transaction limits for participants, lock a participant's ability to spend, and receive notifications on participants spending</li>\r\n<br />\r\n \t<li>They can request a credit limit increase</li>\r\n<br />\r\n \t<li>They can close the shared ‌Apple Card‌ account at any time, but are still responsible for paying any remaining balance</li>\r\n<br />\r\n</ul>\r\n<br />\r\nParticipants, aka ‌Apple Card‌ family users who are not co-owners, can use a shared ‌Apple Card‌, but won't be responsible for payments. Participants must be at least 13 years old, and Apple has additional info on how participants work:\r\n<br />\r\n<ul>\r\n<br />\r\n \t<li>They're not responsible for payments</li>\r\n<br />\r\n \t<li>They can view their own transactions and information</li>\r\n<br />\r\n \t<li>They can spend up to the credit limit on the account and may have an optional transaction limit set by an account owner or co-owner</li>\r\n<br />\r\n \t<li>They can immediately use their shared ‌Apple Card‌ and get unlimited Daily Cash on all transactions</li>\r\n<br />\r\n \t<li>If they're 18 years or older, they can order their own titanium ‌Apple Card‌</li>\r\n<br />\r\n \t<li>If they're 18 years or older, they can opt-in to build their credit and be reported on the account (as a co-owner)</li>\r\n<br />\r\n</ul>\r\n<br />\r\nApple makes it clear that everyone on ‌Apple Card‌ Family can be impacted by payment history and credit utilization, which can affect their credit file. Both ‌Apple Card‌ co-owners will see the ‌Apple Card‌ on their credit reports, but participants who are 18+ might too if they're reported as an authorized user.<blockquote>It's important for everyone on ‌Apple Card‌ Family to understand how credit reporting can impact their credit file. Information about the ‌Apple Card‌ Family account, such as payment history and credit utilization, are reported to credit bureaus and shown in credit bureau reports for account owners and co-owners. This information may also be shown in credit bureau reports for a participant if they're being reported on the ‌Apple Card‌ Family account as an authorized user. Being credit reported can assist with building credit history for account co-owners and participants. Generally, accounts that have been established for a while, show consistent on-time payments, and have low balances (e.g. below 30% of the total credit limit), may result in a more positive credit impact.</blockquote>To use ‌Apple Card‌ Family, Family Sharing must be in place and one of the family members must have an ‌Apple Card‌ account. Customers are required to have an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, or Apple Watch with the latest version of iOS, iPadOS, or watchOS.\r\n<br />\r\n\r\n<br />\r\nInviting a family member to ‌Apple Card‌ Family will be able to be done by tapping on the Wallet app, tapping the ‌Apple Card‌, tapping the \"More\" button, and then under People, choosing the \"Share My Card\" option. From there, you can choose whether to make the person you're sharing with a co-owner or a participant.\r\n<br />\r\n\r\n<br />\r\nThere's no word yet on when ‌Apple Card‌ Family will launch, but Apple appears to be laying the groundwork <a href=\"https://www.macrumors.com/2021/04/30/apple-seeds-ios-14-6-beta-2-to-developers/\">in iOS 14.6</a>, so it could go live when iOS 14.6 sees a launch.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/06/apple-card-family-details/\">Apple Shares Details on How Apple Card Family Works</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-shares-details-on-how-apple-card-family-works.2295142/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=v0UhAj3bTZ0:_eE25DUhDL4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=v0UhAj3bTZ0:_eE25DUhDL4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/v0UhAj3bTZ0\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4189e48b44b49fce4057fff11477d42633ee8acbddcb0cc6606f843ae0a0f458","category":"Apple"}