{"title":"Use of machine learning tools to predict health risks from climate-sensitive extreme weather events: A scoping review","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000338","date":1705500000000,"content":"<p>by Shakirah N. Ssebyala, Timothy M. Kintu, David J. Muganzi, Caleb Dresser, Michelle R. Demetres, Yuan Lai, Kobusingye Mercy, Chenyu Li, Fei Wang, Soko Setoguchi, Leo Anthony Celi, Arnab K. Ghosh</p>\r\n\r\nMachine learning (ML) algorithms may play a role in predicting the adverse health impacts of climate-sensitive extreme weather events because accurate prediction of such effects can guide proactive clinical and policy decisions. To systematically review the literature that describe ML algorithms that predict health outcomes from climate-sensitive extreme weather events. A comprehensive literature search was performed in the following databases from inception–October 2022: Ovid MEDLINE, Ovid EMBASE, The Cochrane Library, Web of Science, bioRxiv, medRxiv, Institute of Electrical and Electronic Engineers, Google Scholar, and Engineering Village. The retrieved studies were then screened for eligibility against predefined inclusion/exclusion criteria. The studies were then qualitatively synthesized based on the type of extreme weather event. Gaps in the literature were identified based on this synthesis. Of the 6096 records screened, seven studies met the inclusion criteria. Six of the studies predicted health outcomes from heat waves, and one for flooding. Health outcomes described included 1) all-cause non-age standardized mortality rates, 2) heat-related conditions and 3) post-traumatic stress disorder. Prediction models were developed using six validated ML techniques including non-linear exponential regression, logistic regression, spatiotemporal Integrated Laplace Approximation (INLA), random forest and decision tree methods (DT), and support vector machines (SVM). Use of ML algorithms to assess adverse health impacts from climate-sensitive extreme weather events is possible. However, to fully utilize these ML techniques, better quality data suitable for use is desirable. Development of data standards for climate change and health may help ensure model robustness and comparison across space and time. Future research should also consider health equity implications.","author":"Shakirah N. Ssebyala","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"4189f650aabd4f93bf6aef2bd085423cf28447232197110532aa64ff1af2dbe3","category":"Environment"}