{"title":"Harvest and decimation affect genetic drift and the effective population size in wild reindeer","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13684?af=R","date":1712818800000,"content":"<h2>Abstract</h2>\n<p>Harvesting and culling are methods used to monitor and manage wildlife diseases. An important consequence of these practices is a change in the genetic dynamics of affected populations that may threaten their long-term viability. The effective population size (<i>N</i>\n<sub>e</sub>) is a fundamental parameter for describing such changes as it determines the amount of genetic drift in a population. Here, we estimate <i>N</i>\n<sub>e</sub> of a harvested wild reindeer population in Norway. Then we use simulations to investigate the genetic consequences of management efforts for handling a recent spread of chronic wasting disease, including increased adult male harvest and population decimation. The <i>N</i>\n<sub>e</sub>/<i>N</i> ratio in this population was found to be 0.124 at the end of the study period, compared to 0.239 in the preceding 14 years period. The difference was caused by increased harvest rates with a high proportion of adult males (older than 2.5 years) being shot (15.2% in 2005–2018 and 44.8% in 2021). Increased harvest rates decreased <i>N</i>\n<sub>e</sub> in the simulations, but less sex biased harvest strategies had a lower negative impact. For harvest strategies that yield stable population dynamics, shifting the harvest from calves to adult males and females increased <i>N</i>\n<sub>e</sub>. Population decimation always resulted in decreased genetic variation in the population, with higher loss of heterozygosity and rare alleles with more severe decimation or longer periods of low population size. A very high proportion of males in the harvest had the most severe consequences for the loss of genetic variation. This study clearly shows how the effects of harvest strategies and changes in population size interact to determine the genetic drift of a managed population. The long-term genetic viability of wildlife populations subject to a disease will also depend on population impacts of the disease and how these interact with management actions.</p>","author":"Thomas Kvalnes, \nØystein Flagstad, \nJørn Våge, \nOlav Strand, \nHildegunn Viljugrein, \nBernt‐Erik Sæther","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"419291dc371117bc2616a0765c63ae76640ac3545e1b4d7e31963a49734c4ba2","category":"Environment"}