{"title":"Apple Acquires AR Headset Firm Mira Behind Mario Kart Ride at Super Nintendo World","link":"https://www.macrumors.com/2023/06/06/apple-acquires-ar-headset-firm-mira/","date":1686079652000,"content":"Just a day after Apple debuted its Vision Pro headset, <a href=\"https://www.theverge.com/2023/6/6/23751350/apple-mira-ar-headset-startup\"><em>The Verge</em> reports</a> that Apple has acquired AR headset startup <a href=\"https://www.mirareality.com\">Mira</a>, a firm most known to the public for providing headsets used on Mario Kart rides in Super Nintendo World at Universal Studios Japan and Universal Studios Hollywood.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/mira-mario-kart-ride-universal.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\n<em>The Verge</em> says Mira CEO Ben Taft shared a private photo on Instagram showing a number of Apple employee badges with the comment \"Excited for Mira’s next chapter, at Apple :). 7 year journey from dorm room to acquisition.\" At least 11 Mira employees have reportedly joined Apple, which essentially confirmed the acquisition by issuing its standard press statement to <em>The Verge</em>, saying only that \"we generally do not discuss our purpose or plans.\"\r<br />\n\r<br />\nIn addition to the Mario Kart ride partnership, Mira has also been involved in military contracts and has promoted its headsets for use in manufacturing and mining settings, but it's unlikely most of these efforts will continue under Apple's ownership.\r<br />\n\r<br />\nApple has obviously already developed significant expertise in augmented and virtual reality, so it's unclear exactly why it has acquired Mira, but it's likely to be related to continuing to bolster its talent in the area or perhaps intellectual property rights.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-acquisition/\">Apple Acquisition</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/06/apple-acquires-ar-headset-firm-mira/\">Apple Acquires AR Headset Firm Mira Behind Mario Kart Ride at Super Nintendo World</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-acquires-ar-headset-firm-mira-behind-mario-kart-ride-at-super-nintendo-world.2391944/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"41934377e430cadae0b4547ff09f54fcc58643fa07a0a2405aa92227e4a1ce00","category":"Apple"}