{"title":"Quantifying energy transition vulnerability helps more just and inclusive decarbonization","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae427/7828926?rss=1","date":1729555200000,"content":"<span><div>Abstract</div>The COP28 agreement signals “beginning of the end” of the fossil fuel era, calling on countries to contribute to global efforts to transition away from fossil fuels in energy systems in a just, orderly and equitable manner. While a quantitative assessment of country's vulnerability in energy transition is a prerequisite for national and international policy makers to ensure a just and inclusive transition, it is notably absent in the existing research. Here, we develop a conceptual framework based on the vulnerability scoping diagram (VSD) method to assess differences in energy transition vulnerability across countries, with a specific focus on the challenges associated with transitioning away from fossil fuels. The resulting energy transition vulnerability index (ETVI) scores reveal that countries in the Global South generally exhibit higher vulnerability in their energy transition compared to those in the Global North, and this gap has widened over the past decade. Moreover, the COVID-19 pandemic has disrupted the decade-long trend of continuous decline in global energy transition vulnerability. This study also provides two important applications of ETVI scores, aligning them with major global sustainable development agenda. Firstly, we identify substantial differences in the dynamics of transition vulnerability across seven major party groups in the international climate change negotiations and distinguish four energy transition statuses in relation to achieving global climate goals: <span>Stressful</span>, <span>Leapfrog</span>, <span>Potential Challenges</span>, and <span>Less Painful</span>. Secondly, we demonstrate crucial synergies between energy transition resilience and the 2030 United Nations Sustainable Development Goals (SDGs).</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"419600d78b9e6b80da4611e7024df49bf4f1142e6274cd518ed8bf3df3afcf69","category":"Interdisciplinary"}