{"title":"Direct Quantification of Grain Boundary Space Charge Layers using Multislice Electron Ptychography","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.916/7720209?rss=1","date":1721779200000,"content":"<span>In ionic solids, space charge layers are electronically charged regions that form as ions redistribute around planar defects, leading to a buildup of electrical potential. In oxygen ion conductors, these space charge layers may act as barriers to the free flow of ions. Currently, space charge potentials are primarily characterized indirectly, by measuring the chemical segregation of ions as a proxy measurement for the desired space charge potential. This can be performed using STEM-EDS [<a href=\"#ozae044.916-B1\">1-3</a>], STEM-EELS [<a href=\"#ozae044.916-B4\">4</a>], or APT [<a href=\"#ozae044.916-B5\">5</a>,<a href=\"#ozae044.916-B7\">7</a>], among other techniques. More rarely, space charge potentials can be measured directly through phase-contrast imaging techniques, enabled by the Aharonov-Bohm effect where an electron passing through a region of relative potential acquires a phase shift. Of these techniques, electron holography is the most commonly used method for space charge measurements [<a href=\"#ozae044.916-B6\">6-7</a>], although STEM differential phase contrast (DPC) has also been applied towards quantitative imaging of electric fields at interfaces [<a href=\"#ozae044.916-B8\">8</a>]. Both techniques, however, are susceptible to diffraction contrast which may generate phase shifts orders of magnitude larger than those caused by relatively weak space charge potentials. While methods have been proposed to overcome these challenges [<a href=\"#ozae044.916-B9\">9-10</a>], multislice ptychography provides a different approach. Instead of mitigating the effects of diffraction, multislice ptychography integrates these effects in its forward model, allowing dynamical diffraction contrast to be removed as a source of error. In addition, multislice ptychography retains extremely high resolution, allowing 3D atomic structure to be resolved simultaneously with space charge potential.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"41a5069a955719b6819cca6e72b16bd73f1b1777f28857fea5056a254e4c1ffd","category":"Environment"}