{"title":"VPN servers seized by Ukrainian authorities weren’t encrypted","link":"https://arstechnica.com/?p=1783161","date":1627339478000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/vpn-tunnel-800x450.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/vpn-tunnel.jpeg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/\">Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Privacy-tools-seller Windscribe said it failed to encrypt company VPN servers that were recently confiscated by authorities in Ukraine, a lapse that made it possible for the authorities to impersonate Windscribe servers and capture and decrypt traffic passing through them.</p>\n<p>The Ontario, Canada-based company <a href=\"https://blog.windscribe.com/openvpn-security-improvements-and-changes-7b04ea49222\">said</a> earlier this month that two servers hosted in Ukraine were seized as part of an investigation into activity that had occurred a year earlier. The servers, which ran the <a href=\"https://openvpn.net/\">OpenVPN</a> virtual private network software, were also configured to use a setting that was deprecated in 2018 after security research revealed vulnerabilities that could allow adversaries to decrypt data.</p>\n<p>“On the disk of those two servers was an OpenVPN server certificate and its private key,” a Windscribe representative wrote in the July 8 post. “Although we have encrypted servers in high-sensitivity regions, the servers in question were running a legacy stack and were not encrypted. We are currently enacting our plan to address this.”</p></div><p><a href=\"https://arstechnica.com/?p=1783161#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1783161&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"41a68d451b6deebdf1fbb5abd359600084770d688ddf33d6b1fee8754a6a6e59","category":"Tech"}