{"title":"Transcription factor OsWRKY72 controls rice leaf angle by regulating LAZY1-mediated shoot gravitropism","link":"https://academic.oup.com/plphys/article/195/2/1586/7628152?rss=1","date":1710288000000,"content":"<span><div>Abstract</div>Leaf angle is a major trait of ideal architecture, which is considered to influence rice (<span>Oryza sativa</span>) cultivation and grain yield. Although a few mutants with altered rice leaf inclination angles have been reported, the underlying molecular mechanism remains unclear. In this study, we showed that a WRKY transcription factor gene, <span>OsWRKY72</span>, was highly expressed in the leaf sheath and lamina joint. Phenotypic analyses showed that <span>oswrky72</span> mutants had smaller leaf angles than the wild type, while <span>OsWRKY72</span> overexpression lines exhibited an increased leaf angle. This observation suggests that OsWRKY72 functions as a positive regulator, promoting the enlargement of the leaf angle. Our bioinformatics analysis identified <span>LAZY1</span> as the downstream gene of <span>OsWRKY72</span>. Electrophoretic mobility shift assays and dual-luciferase analysis revealed that OsWRKY72 directly inhibited <span>LAZY1</span> by binding to its promoter. Moreover, knocking out <span>OsWRKY72</span> enhanced shoot gravitropism, which contrasted with the phenotype of <span>lazy1</span> plants. These results imply that OsWRKY72 regulates the leaf angle through gravitropism by reducing the expression of <span>LAZY1</span>. In addition, OsWRKY72 could directly regulate the expression of other leaf angle–related genes such as <span>FLOWERING LOCUS T-LIKE 12</span> (<span>OsFTL12)</span> and <span>WALL-ASSOCIATED KINASE 11</span> (<span>OsWAK11</span>). Our study indicates that OsWRKY72 contributes positively to the expansion of the leaf angle by interfering with shoot gravitropism in rice.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"41bb4de82859e34127ba4068a16e2ae3321623bb5453b9349dd1e71e2b483a80","category":"Environment"}