{"title":"Particulate Filters for Combustion Engines to Mitigate Global Warming. Estimating the Effects of a Highly Efficient but Underutilized Tool","link":"http://link.springer.com/10.1007/s40825-023-00236-x","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Particulate filters are state-of-the-art and are used in internal combustion engines worldwide to eliminate carcinogenic nanoparticles. Health studies estimate that this prevents about one million premature deaths annually. What is less known and often neglected is their equally powerful effect on mitigating global warming. This is because these ultrafine particles form stable aerosols in the atmosphere, absorb sunlight, and heat the atmosphere due to their jet-black color. In addition, once deposited on the ground, they reduce albedo especially when deposited on ice or snow. They also thin clouds and reduce their reflectivity. In this paper, we estimate for the first time the cumulative effect of more than 300 million particulate filters currently installed globally on vehicles, showing that, while they reduce ~ 0.5 Mt of soot per year, their effect on slowing global warming is equivalent to reducing 1 Bt of CO<sub>2</sub> per year or about one-third of the CO<sub>2</sub> emissions of all European Union Member States combined. Despite its strong potential, this highly efficient, proven, and low-cost technology is not yet regarded as a priority in curbing global warming, even though it is possibly the easiest and quickest to implement. If used in retrofitting more diesel and petrol engines worldwide, it could triple the aforementioned effect. While modern internal combustion engines are on track to be replaced with zero-emission vehicles, it is also crucial, and we strongly suggest that, in the interim, all remaining internal fossil fuel combusting engines be fitted with particulate filters. Evidence is presented in this paper that the potential benefits of such retrofit on climate and human health will be impactful and lasting.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"41bdd17637de704624b6bd276a7b0bdadb8fbbbb0b85eff807eea86e251953d1","category":"Environment"}