{"title":"Breast cancer trends in Chile: Incidence and mortality rates (2007–2018)","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001322","date":1719496800000,"content":"<p>by Benjamín Madariaga, Susana Mondschein, Soledad Torres</p>\r\n\r\nBreast cancer (BC) is one of the most common cancers in women worldwide and in Chile. Due to the lack of a Chilean national cancer registry, there is partial information on the status of BC in the country. We aim to estimate BC incidence and mortality rates by health care providers and regions for Chilean women. We used two public anonymized databases provided by the Ministry of Health: the national death and hospital discharges datasets. We considered a cohort of 58,254 and 16,615 BC hospital discharges and deaths for the period 2007–2018. New BC cases increased by 43.6%, from 3,785 in 2007 to 5,435 in 2018. Total BC deaths increased by 33.6% from 1,158 to 1,547 during the same period. Age-adjusted incidence rates were stable over time, with an average rate of 44.0 cases/100,000 women (SD 2.2). There were considerable differences in age-adjusted incidence rates among regions, with no clear geographical trend. Women affiliated to a private provider (ISAPRE) have an average age-adjusted incidence rate of 60.6 compared to 38.8 (both cases/100,000 women) for women affiliated with the public provider (FONASA). Age-adjusted mortality rates have an average of 10.5 cases/100,000 women (SD 0.4). This study shows important differences in incidence rates between private and publicly insured women, with no significant differences in mortality rates. Such differences may be associated with women’s lifestyles, dietary compositions, comorbidities, and differences in healthcare systems. These hypotheses should be studied in greater depth. Additionally, differences in BC incidence found in this study compared to incidences reported from other estimations reinforce the need of a national cancer registry that should lead to more accurate indicators regarding BC in Chile.","author":"Benjamín Madariaga","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"41c647c4161e510c264d954d689af51bc93a8b2bead985909a7743ae504a0dfc","category":"Environment"}