{"title":"Implications of the Spin-Induced Accretion Disk Truncation on the X-ray Binary Broadband Emission","link":"https://www.preprints.org/manuscript/202407.1254/v1","date":1721111228000,"content":"Black hole X-ray binary systems consist of a black hole accreting mass from its binary companion, forming an accretion disk. As a result, twin relativistic plasma ejections (jets) are launched towards opposite and perpendicular directions. Moreover, multiple broadband emission observations from X-ray binary systems range from radio to high-energy gamma-rays. The emission mechanisms exhibit thermal origins from the disk, stellar companion, and non-thermal jet-related components (i.e., synchrotron emission, inverse comptonization of less energetic photons, etc.). In many attempts at fitting the emitted spectra, a static black hole is often assumed regarding the accretion disk modeling, ignoring the Kerr metric properties that significantly impact the geometry around the usually rotating black hole. In this work, we study the possible implications of the spin inclusion in predictions of the X-ray binary spectrum. We mainly focus on the most significant aspect inserted by the Kerr geometry, the innermost stable circular orbit radius dictating the disk’s inner boundary. The outcome suggests a higher-peaked and hardened X-ray spectrum from the accretion disk and a substantial increase in the inverse compton component of disk-originated photons. Jet-photon absorption is also heavily affected at higher energy regimes dominated by hadron-induced emission mechanisms. Nevertheless, a complete investigation requires the full examination of the spin contribution and the resulting relativistic effects beyond the disk truncation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"41d0d48332d3aced5a2caa4157c682ebf3cb6ea4fa5ddb1762c7710b28b6e6b2","category":"Interdisciplinary"}