{"title":"Spatial heterogeneity of soil dissolved organic matter characteristics in the riparian zone of the Three Gorges Reservoir","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2570?af=R","date":1721273930000,"content":"<h2>Abstract</h2>\n<p>Dissolved organic matter (DOM) is one of the active soil carbon fractions. The characteristics of DOM in the riparian zone are closely related to the occurrence of eutrophication. However, there is no scientific consensus on how flooding intensity on DOM distribution in the riparian zone of the Three Gorges Reservoir (TGR). In this study, 99 soil riparian samples were collected from three water level elevations (145–155 m asl, 155–165 m asl and 165–175 m asl) in both mainstream and tributaries of the Yangtze River within the TGR. DOM characteristics were investigated using ultraviolet–visible absorption spectra and three-dimensional fluorescence excitation–emission matrix-parallel factor analysis as well as principal component analysis (PCA). The result showed that dissolved organic carbon (DOC), absorption coefficient at 254 nm (a254), absorption coefficient at 350 nm, specific ultraviolet absorbance at 254 nm (SUVA254), and humification index (HIX) decreased while freshness index (<i>β:α</i>) and biological index (BIX) increased with the decline of the water level elevations. The trend in the DOM characteristics along the riparian zone was mainly attributed to the variation in the bioavailability of DOM and fluorescence components (C1, C3 and C4). Overall, our study highlights the newly formed DOM during the dry season, indicated by <i>β:α</i> and BIX, might be more accumulated at the lower elevation. Furthermore, because of the greater lability during the reservoir impoundment, the newly formed DOM can be easily utilized by algae and may raise water eutrophication under re-flooding and longer flooding, thus enforced strategic mitigation measures could help to achieve the goal of riparian restoration in TGR.</p>","author":"Yun Zhao, \nAmit Kumar, \nKehong Wang, \nJunjie Lin, \nZhiguo Yu, \nShuxun Cheng, \nShuai Zhang, \nZhuolin Yu, \nDan Liu","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"41d4062c7f420f131676102c32bae6c4c62188fcabfa77845c3f9980d6666892","category":"Environment"}