{"title":"133 Effects of supplementing corn silage to fall-calving heifers and cows grazing bermudagrass on cow and calf performance and physiology","link":"https://academic.oup.com/jas/article/102/Supplement_1/61/7618019?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>The objective was to test the effect of supplemental feeding of corn silage to cows grazing bermudagrass pastures on cow and calf performance and physiology. In a completely randomized design, multiparous and primiparous Angus-crossbred cows (n = 24) grazed bermudagrass pastures assigned to one of two levels of supplemental feeding (non-supplemented or supplemented at 1% of BW on a DM basis of corn silage) during the growing season. Each replicate (pasture, n = 4 per treatment) was stocked with 3 cows. Cows averaged 155 ± 14 d of gestation at trial initiation. Cows were fed corn silage (38% DM, 7.83% CP DM basis) daily in fenceline bunks, and supplementation rate was adjusted throughout the trial to maintain 1% of BW. Cows were weighed on two consecutive days at both initiation and conclusion of the trial and cows were maintained on similar diets for 4 d prior to collecting weights to minimize variation in ruminal fill. Body weight (BW), body condition score (BCS), hair score (HS), hair length (HL), and rump fat (RF) measurements were collected at initiation (the middle of the second trimester), trial mid-point (beginning of third trimester), and approximately 2 wk before estimated parturition. Cows were removed from experimental pastures upon trial conclusion and relocated to calving pastures consisting of tame grasses (&gt;65% bermudagrass). Data were analyzed as a mixed model with pasture as experimental unit and cows within pasture as subsamples. Cows began the trial at an average BW of 549 ± 22 kg (SEM) and an average BCS of 5.2 ± 0.17 (SEM). Supplementation of second and third trimester pregnant cows on bermudagrass did not influence BW gain, BCS, HS, or HL (P &gt; 0.27). Rump fat tended (P = 0.15) to be increased with supplemental feeding. Supplemental feeding of corn silage on warm season perennial grass during the growing season did not appear to impact late gestation cow performance at the level fed in this study.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"41d9c6249ac9877763dbe2bbde1b3d9fa251c55f91d5be17f4daedf0563400c7","category":"Environment"}