{"title":"Cross-chaining explained: Shimano and SRAM on drivetrain wear and efficiency","link":"https://www.bikeradar.com/advice/workshop/cross-chaining/","date":1680447650000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Cross-chaining-2-4f34f6c.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Cross-chaining-2-4f34f6c.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Cross-chaining-2-4f34f6c.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Cross-chaining-2-4f34f6c.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Cross-chaining-2-4f34f6c.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Cross-chaining-2-4f34f6c.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Cross-chaining-2-4f34f6c.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Cross-chaining-2-4f34f6c.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Cross-chaining-2-4f34f6c.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Cross-chaining-2-4f34f6c.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Cross-chaining on Shimano Ultra R8000 drivetrain on Giant TCR\" title=\"Cross-chaining on Shimano Ultra R8000 drivetrain on Giant TCR\" />                                            <p>Most bikes have a range of gears to enable you to crest a climb, carve down a descent and everything in between.</p>\n<p>In theory, all of the gears are at your disposal but on some systems, it’s best to avoid using certain gear combinations. This is typically referred to as ‘cross-chaining’.</p>\n<p>Cross-chaining is a complicated and controversial subject. In this guide, we’ll take you through exactly what cross-chaining is, why you shouldn’t cross-chain and how to avoid cross-chaining in the first place.</p>\n<p>We asked Shimano and SRAM for their opinions and some of the responses may surprise you. We also contacted Campagnolo, but the brand declined to comment.</p>\n<h2>What is cross-chaining?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The least amount of friction is when the chain is towards the middle of the cassette because it is in a straight line.</span></figcaption><span> <i>Steve Sayers / Our Media </i></span></div>\n<p>Cross-chaining is the act of riding in the smallest or largest <a href=\"https://www.bikeradar.com/advice/workshop/bike-cassettes/\">cassette</a> sprocket and the corresponding chainring at the same time.</p>\n<p>For example, on a double chainring setup, this is the smallest cassette sprocket and the smallest chainring, or the largest cassette sprocket and the largest chainring.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/bicycle-chains/\">chain</a> performs optimally when it is in a straight line. Cross-chaining forces your chain into an extreme angle, reducing efficiency, increasing wear and harming shifting performance.</p>\n<section><div>\n        \n<h3>What is a ‘chainline’?</h3>\n<p>In the strictest sense of the word, chainline is a measurement taken from the centre of your rear hub to the middle of the freehub. </p>\n<p>For the crankset, it is a measurement taken from the centre of the bottom bracket shell to the space between the chainrings on a 2x setup, or where the chainring sits on a 1x setup. </p>\n<p>As mentioned, the chain performs best when running in a straight line. Some refer to this as an ‘optimum’ or ‘efficient’ chainline.</p>\n<p>\n\n    </p></div>\n    </section><h2>Okay, show me an example of cross-chaining…</h2>\n<h3>Cross-chaining on a 2x drivetrain</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> You can see the chain under more strain when in ‘big-big’.</span></figcaption><span> <i>Steve Sayers / Our Media </i></span></div>\n<p>On a 2x drivetrain, cross-chaining typically refers to when you are riding in the smallest chainring and cassette sprocket, or in the biggest chainring and cassette sprocket.</p>\n<p>It’s also generally recommended to avoid riding in the second smallest sprocket when in the small chainring.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Small-small is a bigger no-no.</span></figcaption><span> <i>Steve Sayers / Our Media </i></span></div>\n<p>SRAM says “with 2x, big-big is fine”, but it specifically discourages riding in a small-small combination because “the chain tension is low, which may result in chain drop, and there’s a small risk of inadvertent chain pick-up by the large ring”.</p>\n<p>Shimano’s response is more coy – the brand says its <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">rear derailleurs</a> are designed to sit at a certain position, depending on how many chainrings they are paired with, although acknowledges there is more friction when cross-chaining.</p>\n<h3>Cross-chaining on a 1x drivetrain</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Does the notion of cross-chaining even exist on 1x drivetrains?</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>Whether cross-chaining is something to worry about on 1x drivetrains is a little murkier, given there aren’t multiple chainrings and the two opposing ends of the cassette represent your easiest and hardest gears.</p>\n<p>SRAM’s take is simple: “There’s literally no such thing as cross-chaining with a 1x system”, with the brand advising riders to “ride the gear that feels best”.</p>\n<p>Like SRAM, Shimano says riders shouldn’t be concerned with cross-chaining on the brand’s 1x drivetrains.</p>\n<p>However, an optimum chainline for drivetrain efficiency exists.</p>\n<p>Using the cogs towards the middle of the cassette, which results in a straighter chainline, is more efficient and quieter.</p>\n<h2>Why is cross-chaining bad?</h2>\n<p>When you cross-chain, the chain is made to run at a more extreme angle because it runs diagonally, potentially increasing friction and strain on the drivetrain components.</p>\n<h3>Drivetrain wear</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Cross-chaining is often thought to lead to increased wear.</span></figcaption><span> <i>David Rome / Immediate Media</i></span></div>\n<p>The additional friction generated by cross-chaining is often thought to lead to increased wear. Because the chain is put under more tension, it’s likely to wear faster, meaning you’ll need to <a href=\"https://www.bikeradar.com/advice/workshop/how-to-replace-a-bicycle-chain/\">replace the chain</a> more often.</p>\n<p>That’s the common thinking, anyway – but SRAM disagrees. SRAM says “cross-chaining has no effect on chain wear. The effect of cross-chaining on the big cog and big ring is insignificant”.</p>\n<p>The brand recommends simply picking the gear ratio that feels best to ride, with the exception of the small-small on a 2x system.</p>\n<h3>Longer chain length</h3>\n<div></div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> You can see the rear derailleur strain to achieve the big-big combination.</span></figcaption><span></span></div>\n<p>When you ride in the big-big combination, the chain is at its longest possible length.</p>\n<p>If the chain is too short, the rear derailleur is put under more strain in this gear, especially if the chain is slightly too short.</p>\n<p>If the chain has been cut too long, when you ride in the small-small combination, the chain will droop onto the driveside chainstay. This will be noisy and you may drop the chain when riding on rough terrain.</p>\n<h3>Noise</h3>\n<div></div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The chain will likely rub the outer cage plate of the front derailleur when riding in big-big.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>Cross-chaining will almost certainly be noisy because the chain is put under more strain.</p>\n<p>You may also hear the noise of the chain rubbing on the inner cage plate of the front derailleur.</p>\n<p>A bike with a poor chainline (where the chainrings or cassette sit too far inboard or outboard relative to the other) may also be noisier.</p>\n<p>The chain may also hit the chainstay if you ride in the small-small combination because the chain is under the least amount of tension.</p>\n<p>On some drivetrains, manufacturers build a trim function into the front shifter. This moves the front derailleur slightly inboard or outboard to prevent the chain from rubbing when cross-chaining.</p>\n<h3>Power loss</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> It’s not as efficient to cross-chain.</span></figcaption><span> <i>Steve Sayers / Our Media </i></span></div>\n<p>It is generally thought to be more efficient not to cross-chain, given the increased friction of the chain rubbing against the front derailleur or cassette teeth and the sub-optimal chainline.</p>\n<p>An efficiency test conducted by <em>Velonews</em> between 1x and 2x drivetrains found a ~5 watt difference riding in the 39-11 compared to the near-equivalent 53-15 gear.</p>\n<h2>How to avoid cross-chaining</h2>\n<p>On a multi-chainring setup (2x or 3x), if you notice you are about to cross-chain, you should consider changing chainring.</p>\n<p>For example, if you’re riding on the big chainring and the second largest sprocket, swap to the easier chainring and change down a gear. You’re effectively achieving an equivalent gear ratio with a better chainline.</p>\n<h3>Do electronic groupsets prevent cross-chaining?</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Shimano prevents you accessing the two smallest cogs when in the inner chainring.</span></figcaption><span> <i>Oscar Huckle / Our Media</i></span></div>\n<p>Some <a href=\"https://www.bikeradar.com/advice/buyers-guides/electronic-groupsets/\">electronic groupsets</a> have features to prevent you from cross-chaining.</p>\n<p>Shimano, SRAM and Campagnolo allow you to ride in the biggest cassette cog and chainring.</p>\n<p>However, on Shimano’s 11- and 12-speed Di2 <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road bike groupsets</a>, the brand prevents you from riding on the two smallest sprockets when using the inner chainring.</p>\n<p>Shimano also offers Synchro Shift. This feature shifts the front and rear derailleur automatically as you select a harder or easier gear, maintaining an optimal chainline and offering the smoothest possible steps through gears.</p>\n<p>On SRAM’s eTap AXS groupsets, the brand prevents the system from shifting into the small-small combination on a 2x setup.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Campagnolo’s Super Record EPS is the exception to the rule.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>Campagnolo bucks the trend with its <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/campagnolo-super-record-12-speed-disc-review/\">Super Record EPS 12-speed groupset</a>, because you are allowed to cross-chain. However, if you happen to be riding in the small-small, the front derailleur automatically self-adjusts to prevent the chain rubbing on the outer cage plate.</p>\n<p>SRAM and Shimano’s electronic front derailleurs also have an ‘auto-trim’ function.</p>\n<h2>Should you ever cross-chain?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Don’t worry if you need to cross-chain occasionally.</span></figcaption><span> <i>Steve Sayers / Our Media </i></span></div>\n<p>Ideally, you should avoid cross-chaining.</p>\n<p>However, this can be hard to remember when you’re riding at the limit, so don’t worry if you find yourself accidentally cross-chaining from time to time.</p>\n<p>In a race scenario, if you’re heading up an incline that isn’t steep enough to warrant changing into the inner chainring, it arguably requires less effort to cross-chain than to concentrate on shifting the front derailleur.</p>","author":"Oscar Huckle","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"41db91d456aa0fda788836d75cc992e23917ed20733c7be03ec8c69ec3260c6a","category":"Cycling"}