{"title":"Sulfur and Peroxide Vulcanization of Rubber Compounds Based on SBR, EPDM and Their Combinations","link":"https://www.preprints.org/manuscript/202403.0611/v1","date":1710155004000,"content":"Rubber compounds based on styrene-butadiene rubber, ethylene-propylene-diene-monomer rubber and the combinations of both rubbers were cured with different sulfur and peroxide curing systems. In sulfur curing systems, two type of accelerators, namely N-cyclohexyl-2-benzothiazole sulfenamide, tetramethylthiuram disulfide and combinations of both accelerators were used. In peroxide curing systems, dicumyl peroxide, and combination of dicumyl peroxide with zinc diacrylate or zinc dimethacrylate, respectively were applied. The work was focused on investigation of the curing system composition as well as type of the rubber or rubbers combinations on curing process, cross-link density and physical-mechanical properties of vulcanizates. The dynamic-mechanical properties on the selected vulcanizates were examined, too. The result revealed correlation between the cross-link density and physical-mechanical properties. Similarly, there was recorded certain correlation between cross-linking degree and glass transition temperature. The tensile strength of vulcanizates based on rubbers combinations was higher when compared to that based on pure rubbers, which points out the fact that by rubbers combination, not only the features of both elastomers can be combined, but also improved tensile characteristics can be achieved. When compared to vulcanizates cured with dicumyl peroxide, materials cured with sulfur system exhibited higher tensile strength. By application of co-agents in peroxide vulcanization, the tensile strength overcame the tensile behavior of sulfur cured vulcanizates.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"41dce116cc398f176eb427d6dab603636e378c6492cc165cbe9e083e7b6550d0","category":"Interdisciplinary"}