{"title":"Large mammal behavioral defenses induced by the cues of human predation","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae382/7748052?rss=1","date":1725321600000,"content":"<span><div>Abstract</div>Large mammals respond to human hunting via proactive and reactive responses, which can induce subsequent nonconsumptive effects (NCEs). Thus, there is evidence that large mammals exhibit considerable behavioral plasticity in response to human hunting risk. Currently, however, it is unclear which cues of human hunting large mammals may be responding to. We conducted a literature review to quantify the large mammal behavioral responses induced by the cues of human hunting. We detected 106 studies published between 1978 and 2022 of which 34 (32%) included at least one measure of cue, typically visual (<span>n</span> = 26 of 106, 25%) or auditory (<span>n</span> = 11 of 106, 10%). Space use (<span>n</span> = 37 of 106, 35%) and flight (<span>n</span> = 31 of 106, 29%) were the most common behavioral responses studied. Among the 34 studies that assessed at least one cue, six (18%) measured large mammal behavioral responses in relation to proxies of human hunting (e.g. hunting site or season). Only 14% (<span>n</span> = 15 of 106) of the studies quantified an NCE associated with an animal's response to human hunting. Moreover, the association between cues measured and antipredator behaviors is unclear due to a consistent lack of controls. Thus, while human hunting can shape animal populations via consumptive effects, the cues triggering these responses are poorly understood. There hence remains a need to link cues, responses, NCEs, and the dynamics of large mammal populations. Human activities can then be adjusted accordingly to prevent both overexploitation and unintended NCEs in animal populations.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"41dd08f03d182e2634ffbd2e212e9e7bcc6354be5ef2b2fe9816ddb09388a567","category":"Interdisciplinary"}