{"title":"Advancing the Decarbonization of the Construction Sector: Lifecycle Quality and Performance Assurance of Nearly Zero-Energy Buildings","link":"https://www.preprints.org/manuscript/202404.0488/v1","date":1712543371000,"content":"Dealing with and maintaining high-quality standards in the design and construction phases is challenging, especially for on-site construction. Issues like improper implementation of building components and poor communication can widen the gap between design specifications and actual conditions. To prevent this, particularly for energy-efficient buildings, it's vital to develop resilient, sustainable strategies. These should optimize resource use, minimize environmental impact, and enhance livability, contributing to carbon neutrality by 2050 and climate change mitigation. Traditional post-occupancy evaluations, which identify defects after construction, are impractical for addressing energy performance gaps. A new, real-time inspection approach is necessary throughout the construction process. This paper suggests an innovative guideline for prefabricated buildings, emphasizing digital 'self-instruction' and 'self-inspection'. These procedures ensure activities impacting quality adhere to specific instructions, drawings, and 3D models, incorporating relevant acceptance criteria to verify completion. This methodology, promoting alignment with planned energy-efficient features, is supported by BIM-based software and Augmented Reality (AR) tools, embodying Industry 4.0 principles. BIM and AR bridge the gap between virtual design and actual construction, improving stakeholder communication and enabling real-time monitoring and adjustments. This integration fosters accuracy and efficiency, key for energy-efficient and Nearly Zero-Energy Buildings, marking a shift towards a more precise, collaborative, and environmentally sensible construction industry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"41dd540dadb4464caccfa376c5d631e12f38ffdb7ec78ebafdbfa59e8581224b","category":"Interdisciplinary"}