{"title":"Flock health planning: How to move from a plan to a reflective planning process in Northern Irish sheep flocks?","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12907?af=R","date":1712896825000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/10158f19-c756-42ff-821b-afa51b60c574/aab12907-toc-0001-m.png\" alt=\"Flock health planning: How to move from a plan to a reflective planning process in Northern Irish sheep flocks?\" />\n<p>This is a predominantly qualitative study of the beliefs and behaviours of sheep farmers, and their veterinarians, from across Northern Ireland, surrounding their flock health plans and flock health planning process. Sheep farmers participating saw their health plan as a static, physical document rather than an ongoing continuous cycle of improvement. Veterinarians saw potential to improve flock health if they could engage farmers and develop an income stream from the work. Farmers and veterinarians concurred that incentivising engagement and support in implementation of the agreed plans was key to drive flock health planning forward.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Flock health planning has been advocated as part of a wider drive within livestock production for veterinarians and farmers to adopt a prevention-focused approach to veterinary medicine. This approach has, at its core, a cyclical process of assessment, evaluation, action and re-assessment, and is documented, at least in summary, in a health plan (HP). The HP has become a defining pillar of farm quality assurance schemes (QASs), introduced to address calls for greater transparency and accountability in food production. There is limited current information on the attitudes and behaviours surrounding flock HPs in the sheep sector and the barriers to greater involvement in an active process of continual improvement through reflective flock health planning. This study aims to address these issues with reference to the national flock in Northern Ireland. A mixed-methods approach was used to explore farmers' and veterinarians' opinions and behaviours related to QASs and HP, with data obtained through an online scoping questionnaire, semi-structured interviews with 27 farmers and 15 veterinarians, and discussion groups with farmers and veterinarians. No evidence of a positive association between a farm having a HP and implementation of 12 industry-recommended flock health activities was identified using the Fisher's exact test. Farmers reported a reluctance to pay for veterinary advice while some veterinarians reported a lack of time to develop HPs for farmers, and sheep-related work generally. Farmers predominantly saw the HP as a static, physical document, which had limited impact on their management practices, rather than a proactive, reflective and collaborative planning process. Veterinarians tasked with completing HPs felt restricted by limited knowledge of on-farm practices, flock production data and a lack of confidence in the accuracy of on-farm medicine records. This led some to believe that the HPs may fail to address critical issues. A new approach to engage farmers and veterinarians together in active flock health planning needs to be developed. This will need a sustainable delivery plan. Then the focus can be shifted towards ongoing reflective health planning to drive change for the betterment of sheep health and welfare.</p>","author":"Paul E. Crawford, \nKim Hamer, \nFiona Lovatt, \nMalgorzata C. Behnke, \nPhilip A. Robinson","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"41e750ef2a181b2a3e73e3ae6a15ece91bfb6581222aa92fad8672e03c3704ac","category":"Environment"}