{"title":"Shanaze Reade’s new role as an ambassador for the 2023 World Championships","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/shanaze-reade-s-new-role-as-an-ambassador-for-the-2023-world-championships","date":1622735681000,"content":"\n      <p><span>“For me, a bike represents freedom,” says Shanaze Reade. It was a freedom that Reade herself was grateful for when growing up, as she experienced firsthand the struggles to make ends meet during her childhood and formative years.</span></p>\n<div></div>\n<p><span>Reade had an illustrious career, winning five world championships in both BMX and track disciplines, but the road to success wasn’t easy. In her<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/i-know-what-its-like-to-be-at-the-rock-bottom-shanaze-reade-video-interview\"> interview with Rouleur in Issue 101</a>, Shanaze discussed her mostly untrodden path to the top, from racing (and winning) on a supermarket bike aged 10, to travelling to championships alone on money that had been fundraised by her local council.</span></p>\n<p><span>Reade speaks openly about not enjoying school, finding that her passion lay solely with sport. Her BMX bike became her obsession, especially when it was announced that BMX would become an Olympic sport in Beijing in 2008. The bike offered Reade a way out of her hometown in Crewe and an outlet to release her love for cycling. Shanaze explained in her interview that she was raised by her grandparents, and didn’t always have an easy time growing up. </span></p>\n<p><span>The solace which her bike provided at a crucial stage of the British rider’s life is something she wants to share with young people today, and she hopes to use the platform that her ambassadorship for the World Championships will give her to raise awareness of this. “My single biggest ambition as an ambassador is to help to find opportunities for every single child in Scotland to access a bike so they too can experience the freedom it can bring to their lives,” she explains.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Shanaze-Reade-3_1024x1024_560d2808-2b71-4a5f-891f-5f276b7bc209_1024x1024.jpg?v=1622730693\" /></span></p>\n<p><span>With her experiences with the limits that a tough childhood can put on young people, Reade feels strongly about delving into the barriers that prevent people getting access to bikes. As part of her role, Shanaze will be visiting local communities in an effort to communicate with families and see how access to bikes and cycling can be made easier and more accessible. Reade explains that first and foremost, she wants to listen and understand first-hand any obstacles that young people face.</span></p>\n<p><span>As well as hoping to make a change holistically to young people in Scotland’s access to resources, Reade also wants to ensure that they feel part of the event. She hopes to involve people in the Championships from the grassroots level, so that they aren’t looking in on the event, but can be included in it. Her wealth of experience at events means that Reade is perfectly poised to give feedback to organisers about barriers she faced when it came to big competitions.</span></p>\n<p><span>Chair of the 2023 UCI Cycling World Championships, Paul Bush explains, “Shanaze is already making an important contribution to this brand-new event in her role as Co-opted board member, sharing her knowledge and experience of competing at multiple world championships.\"</span></p>\n<p><span>Reade's motivation to get more young people on bikes is an inspiration to many people, as is her personal story in cycling. Her ambitions transcend the event itself, as she aims to make big changes in cycling overall, raising awareness of the good which access to a bike can do to young people. </span></p>\n<p><span>Diversity in cycling is something that the sport is crying out for, and with people like Shanaze in positions to make positive changes, riding a bike can hopefully become more accessible than ever before.</span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"41ea6857d69bf30ccb9ec94b58b7c87886b2ecf7355b1dd13a97070fd5492e47","category":"Cycling"}