{"title":"Suppression of the postprandial hyperglycemia in patients with type 2 diabetes by a raw medicinal herb powder is weakened when consumed in ordinary hard gelatin capsules: A randomized crossover clinical trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311501","date":1728482400000,"content":"<p>by Fernanda Duarte Moreira, Caio Eduardo Gonçalves Reis, Andrea Donatti Gallassi, Daniel Carneiro Moreira, Alexis Fonseca Welker</p>\r\nIntroduction <p>Contradictory claims about the efficacy of several medicinal plants to promote glycemic control in patients with type 2 diabetes mellitus (T2DM) have been explained by divergences in the administration form and by extrapolation of data obtained from healthy individuals. It is not known whether the antidiabetic effects of traditional herbal medicines are influenced by gelatin capsules. This randomized crossover trial aimed to evaluate the acute effect of a single dose of raw cinnamon consumed orally either dissolved in water as a beverage or as ordinary hard gelatin capsules on postprandial hyperglycemia (&gt;140 mg/dL; &gt;7.8 mmol/L) in T2DM patients elicited by a nutritionally-balanced meal providing 50 g of complex carbohydrates.</p> Methods <p>Fasting T2DM patients (n = 19) randomly ingested a standardized meal in five experimental sessions, one alone (Control) and the other after prior intake of 3 or 6 g of crude cinnamon in the form of hard gelatin capsules or powder dissolved in water. Blood glucose was measured at fasting and at 0.25, 0.5, 0.75, 1, 1.5 and 2 hours postprandially. After each breakfast, its palatability scores for visual appeal, smell and pleasantness of taste were assessed, as well as the taste intensity sweetness, saltiness, bitterness, sourness and creaminess.</p> Results <p>The intake of raw cinnamon dissolved in water, independently of the dose, decreased the meal-induced large glucose spike (peak-rise of +87 mg/dL and Δ1-hour glycemia of +79 mg/dL) and the hyperglycemic blood glucose peak. When cinnamon was taken as capsules, these anti-hyperglycemic effects were lost or significantly diminished. Raw cinnamon intake did not change time-to-peak or the 2-h post-meal glycaemia, but flattened the glycemic curve (lower iAUC) without changing the shape that is typical of T2DM patients.</p> Conclusions <p>This cinnamon’s antihyperglycemic action confirms its acarbose-like property to inhibit the activities of the carbohydrate-digesting enzymes α-amylases/α-glucosidases, which is in accordance with its exceptionally high content of raw insoluble fiber. The efficacy of using raw cinnamon as a diabetes treatment strategy seems to require its intake at a specific time before/concomitantly the main hyperglycemic daily meals. Trial registration: Registro Brasileiro de Ensaios Clínicos (ReBEC), number RBR-98tx28b.</p>","author":"Fernanda Duarte Moreira","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"41ec6ed8bf916cbf7fbf337e01b070a44eadc5d58f5aff3fd6859341e18ec5df","category":"Interdisciplinary"}