{"title":"Apple Store at MacArthur Center in Virginia Permanently Closing Following Years of Safety Issues at Shopping Mall","link":"https://www.macrumors.com/2021/02/25/apple-macarthur-center-store-closing/","date":1614300325000,"content":"Apple today indicated that its <a href=\"https://www.apple.com/retail/macarthurcenter/\">retail store at the MacArthur Center shopping mall</a> in Norfolk, Virginia will be permanently closing after over 14 years of business, although an exact closure date has yet to be announced by the company.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/apple-store-macarthur-center.jpeg\" alt=\"\" width=\"2880\" height=\"1612\" class=\"aligncenter size-full wp-image-785748\" />\r\n<br/>\r\nApple has assured that it will be offering all employees at the store other positions within Apple, and said that it looks forward to continuing to serve customers in the area at its Lynnhaven Mall retail store in nearby Virginia Beach.\r\n<br/>\r\n\r\n<br/>\r\n\"While we have made the difficult decision to close our store at MacArthur Center, we are pleased to be able to offer all of our team members other jobs within Apple,\" said Apple in a statement shared with MacRumors. \"We look forward to helping customers at Apple Lynnhaven Mall, as well as on Apple.com and our popular Apple Store and Support apps.\"\r\n<br/>\r\n\r\n<br/>\r\nApple's statement does not mention a reason for the store closure, but there have been several safety issues at MacArthur Center, including multiple active shooter situations in recent years. A growing number of retailers have already left the mall, including Nordstrom, Williams-Sonoma, Banana Republic, J. Crew, Fossil, Pottery Barn, and others.\r\n<br/>\r\n\r\n<br/>\r\nApple MacArthur Center first opened in September 2006, and it does not appear that Apple has any immediate plans to open a new store in Norfolk, so customers in the area will have to visit Apple Lynnhaven Mall in Virginia Beach for in-person shopping and support.\r\n<br/>\r\n\r\n<br/>\r\nA person familiar with the matter informed MacRumors that the store will likely be closed in around 90 days, so the location's final day of business will likely be in May. The person said Apple is working quickly to help all employees find new places within the company, and offering relocation packages if necessary. Some employees may be transferred to Apple's Lynnhaven Mall location, or transition to work-at-home AppleCare positions.<div class=\"linkback\">Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-retail-stores/\">Apple Stores</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/25/apple-macarthur-center-store-closing/\">Apple Store at MacArthur Center in Virginia Permanently Closing Following Years of Safety Issues at Shopping Mall</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-store-at-macarthur-center-in-virginia-permanently-closing-following-years-of-safety-issues-at-shopping-mall.2286248/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=15ifmJ7czVk:rbpCcZpIVKU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=15ifmJ7czVk:rbpCcZpIVKU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/15ifmJ7czVk\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"41edbe4cabc1036e51cb4dba0815ee5c2be141360a96c475fcfbba816fc5eb3f","category":"Apple"}