{"title":"Legal and Organizational Framework for the Use of Search and Rescue Dogs in Disasters: A Comparative Analysis between Serbia, Croatia, and Slovenia","link":"https://www.preprints.org/manuscript/202407.0841/v1","date":1720605209000,"content":"This study critically explores the legislative frameworks and national regulations of Serbia, Croatia, and Slovenia concerning the engagement, training, and responsibilities of search and rescue dogs and their handlers. The goal is to offer a thorough understanding of how these dogs and their handlers are engaged, trained, and managed in each country. By carefully analyzing the legal foundations, the study aims to clarify the rights, duties, and responsibilities of all parties involved, ensuring that search and rescue dog deployments are conducted within a structured and lawful framework. Such an understanding is crucial for improving disaster management and ensuring a coordinated response to various emergencies. The findings reveal that although each country has strong legal provisions for deploying search and rescue dogs, there are significant differences in the detail and scope of these regulations. Slovenia is notable for its detailed guidelines, regular evaluations, and licensing processes, setting a high standard. Croatia benefits from strong institutional support and active international collaboration, which greatly enhances its disaster response capabilities. On the other hand, Serbia, despite having a solid foundational framework, could improve by better coordinating with non-governmental organizations and aligning more closely with international standards. Key areas for improvement include harmonizing standards, enhancing training programs, increasing public awareness, better resource allocation, and adopting new technologies. By addressing these issues, Serbia, Croatia, and Slovenia can further strengthen their legal and institutional frameworks, ensuring their search and rescue teams are better prepared for disasters. This study emphasizes the need for continuous improvement through collaboration, standardization, and innovation to maximize the effectiveness of search and rescue operations involving dogs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"41f1a5a5619a1419b055d70d571e235b3d9cca716064927ad813f1d9c7608205","category":"Interdisciplinary"}