{"title":"Google’s airtight legal defense: Apple is better","link":"https://www.macworld.com/article/539135/macalope-google-apple-app-store-competition.html","date":1632826800000,"content":"<div>\n<section><div></div></section><p>Have you ever noticed how sometimes the things a company says to the public at large or the investment community are somewhat different than what they say in court or to regulators?</p>\n\n\n\n<p>To the investment community: WE ARE AN UNSTOPPABLE JUGGERNAUT. WE WILL MOW DOWN ALL IN OUR PATH.</p>\n\n\n\n<p>To courts and regulators: we are but a fearful kitten. do not startle us with loud noises like the ruffling of papers, please!</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5google.com/2021/09/27/google-eu-apple-court/&amp;xcust=1-1-539135-1-0-0&amp;sref=https://www.macworld.com/feed\">Google blasts EU for ignoring Apple as it fights $5 billion fine over Android &amp; Play Store</a></p>\n\n\n\n<p>Reading the headline, the Macalope was actually inclined to take Google’s side. If you’re talking about monopolies and app stores, Apple should definitely be included in the round of general admonitions and corrective action that should be doled out judiciously. Buuuut what’s this particular fine about?</p>\n\n\n\n<blockquote><p>The case took issue primarily with Google’s requirements to bundle Google apps with the Play Store and prevent forks of Android from using those services.</p></blockquote>\n\n\n\n<p>Okay, yeah, that’s not great. And, of course, there are no forks of iOS. Well, other than iPadOS. Not that that absolves Apple, but it doesn’t really relate to Apple. When you get pulled over for speeding and you complain to the officer about all the people cheating on their taxes, don’t expect to get out of the ticket.</p>\n\n\n\n<p>It’s not like the EU has exactly forgotten about Apple. It even has its own somewhat <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cnbc.com/2021/09/23/eu-plans-to-make-usb-c-mandatory-for-apple-iphones-and-other-devices.html&amp;xcust=1-1-539135-1-0-0&amp;sref=https://www.macworld.com/feed\">sigh-inducing directive</a> for the company.</p>\n\n\n\n<p>For its part, however, Google cries foul!</p>\n\n\n\n<blockquote><p>By defining markets too narrowly and downplaying the potent constraint imposed by the highly powerful Apple, the Commission has mistakenly found Google to be dominant in mobile operating systems and app stores, when it was in fact a vigorous market disrupter [Android] is an exceptional success story of the power of competition in action.</p></blockquote>\n\n\n\n<p>Haha, ooookay, let’s parse this a little bit. Android, the operating system with the highest market share and which Google executives told us for years was moments away from developer dominancy, is <em>not</em> dominant at all, according to… let the Macalope just check his notes here… Google. 2012 Google would like to have a word with 2021 Google. In fact, Android is an agent of competition! Competition that Google then tries to squash by limiting what Android OEMs can do with its apps, which is what the whole case is about.</p>\n\n\n\n<p>In closing, your honor, <em>competition</em>.</p>\n\n\n\n<p>Sure.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>There are some <em>very</em> good arguments to be made about Apple’s monopoly power. This is not one of them. This is the “Look over there!” of arguments.</p>\n\n\n\n<p>Apple <em>does</em> have a kind of monopoly on app stores. Because, contrary to Google’s assertions over the years, it’s still the first place you need to be. Which is why Apple doing stuff like, oh, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.applevis.com/forum/accessibility-advocacy/apples-app-review-team-accessible-hangman&amp;xcust=1-1-539135-1-0-0&amp;sref=https://www.macworld.com/feed\">denying an iOS 15 compatibility update</a> to an accessible app already in the Store for being too much like apps already in the Store, of which it is one, is so frustrating.</p>\n\n\n\n<p>We have the number one store! And we’ll deny you access to it for mismanaged, bureaucratic reasons that sound like something out of the game Papers, Please (also <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/papers-please/id935216956&amp;xcust=1-1-539135-1-0-0&amp;sref=https://www.macworld.com/feed\">on the App Store</a>).</p>\n\n\n\n<p>Companies of course will try to work the refs. That’s to be expected. But we can also laugh about the duct-taped-hams-to-your-fists level of ham-fisted-ness in which they do it.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"41fa8ae6cf1dd75f171188ce9f33a7d502c90036e52ecfcf9afcdc26b65821ce","category":"Apple"}