{"title":"Dragon’s Dogma 2 วางขาย 22 มีนาคม 2024 เกมแรกของ Capcom ที่ราคา 69.99 ดอลลาร์","link":"https://www.blognone.com/node/136991","date":1701306218000,"content":"<div><div><div><p>Dragon’s Dogma 2 เกมภาคต่อของ Dragon’s Dogma เมื่อปี 2012 ประกาศวางจำหน่ายในวันที่ 22 มีนาคม 2024 วางขายบนเครื่อง PlayStation 5, Xbox Series X/S และ PC ในราคา 69.99 ดอลลาร์ ถือเป็นเกมแรกของ Capcom ที่ขายในราคานี้ หลังจากที่มักตั้งราคาขาย 59.99 ดอลลาร์มาเป็นเวลานาน โดยในไทยขายราคา 2,459 บาทบน Steam และ 2,460 บาทใน PlayStation Store (เกมของ Capcom ที่วางขายล่าสุดคือ Exoprimal ขายราคา 1,980 บาท)</p>\n<p>ตัวอย่างใหม่ของ Dragon’s Dogma 2 เผยให้เห็นถึงรายละเอียดใหม่ ๆ ของตัวเกมอย่างมอนสเตอร์แบบใหม่ Talos เป็นรูปปั้นนักรบยักษ์ขยับได้ที่มาจากทะเล, ระบบสร้างตัวละคร, ระบบเควส, และเวทย์มนต์แบบใหม่อย่างการเสกหมอก เนื้อเรื่องของภาคนี้จะดำเนินอยู่ในโลกคู่ขนานของเกมภาคแรกที่ยังเป็นเรื่องของ Arisen ที่ถูกมังกรเอาหัวใจไปเหมือนเดิม</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/3b97915594fb04cd966dd5ecb0c4372b.jpg\" /></p>\n<p>เกมนี้กำกับโดย Hideaki Itsuno ที่เคยกำกับเกม Devil May Cry 3-5 และ Dragon’s Dogma ภาคแรกมาก่อน ควบคุมการผลิตโดย Yoshiaki Hirabayashi ที่มีผลงานเด่น ๆ ในช่วงหลังอย่าง Resident Evil 2 และ 4 ฉบับ Remake</p>\n<p>ที่มา - <a href=\"https://www.videogameschronicle.com/news/dragons-dogma-2-release-date-announced-as-part-of-new-product-showcase/\">Video Games Chronicle</a>, <a href=\"https://store.steampowered.com/app/2054970/Dragons_Dogma_2/\">Steam</a> และ <a href=\"https://store.playstation.com/en-th/product/HP0102-PPSA18727_00-DD2GAME000000000\">PlayStation Store</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/dragons-dogma\">Dragon's Dogma</a></div><div><a href=\"/topics/capcom\">Capcom</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"41fb7edc4195e920e9f35cb8b00adf9fe5f8c7550825bb3b0c6fa6a9dd922df6","category":"Thai"}