{"title":"Top Stories: Last-Minute iPhone 13 Rumors, Apple Announces App Store Changes, and More","link":"https://www.macrumors.com/2021/09/04/top-stories-last-minute-iphone-13-rumors/","date":1630760400000,"content":"The finish line is in sight! Apple's annual iPhone event is likely just a week or so away and all eyes will be on the company as it unveils the next version of its most popular product line. With any luck, we'll also see the next-generation Apple Watch and perhaps even some new AirPods.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/Top-Stories-75-Thumbnail.jpg\" />\r\n<br />\r\n\r\n<br />\r\nOther news this week saw Apple making some more changes to its App Store policies in response to a Japanese investigation and delaying the rollout of its controversial child safety features that raised privacy concerns. Read on for details on these stories and more!\r\n<br />\r\n\r\n<br />\r\n<h2>iPhone 13 Feature Breakdown: Everything Rumors Say We Can Expect</h2>\r\n<br />\r\nThe calendar has turned to September and that means Apple's annual iPhone event is likely just around the corner. Ahead of time, we've put together a <a href=\"https://www.macrumors.com/2021/08/31/full-iphone-13-feature-breakdown/\">detailed breakdown of the iPhone 13's expected features</a>, as well as a list of <a href=\"https://www.macrumors.com/2021/08/28/iphone-13-rumors-may-have-missed/\">five iPhone 13 rumors you may have missed</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/10/iphone-13-matte-black-and-bronze-feature.jpg\" />\r\n<br />\r\nApple has yet to announce a date for its iPhone event, but the safe bet is on Tuesday, September 14. It's likely that <a href=\"https://www.macrumors.com/2021/08/27/apple-watch-series-7-what-to-expect/\">Apple Watch Series 7 models</a> will be unveiled at the same event, and we've got more details on what to expect from that device and more below.\r\n<br />\r\n\r\n<br />\r\n<h2>iPhone 13 Satellite Communication Rumor Disputed</h2>\r\n<br />\r\nApple analyst Ming-Chi Kuo recently said the <a href=\"https://www.macrumors.com/2021/08/29/iphone-13-to-feature-leo-to-make-calls-and-text/\">iPhone 13 was \"likely\" to support Low Earth Orbit (LEO) satellite communication</a>, a feature that he said would allow iPhone users to make calls and send messages when cellular and Wi-Fi connectivity is unavailable, but the rumor has <a href=\"https://www.macrumors.com/2021/08/30/iphone-13-satellite-rumor-disputed/\">since been disputed by some experts in the field</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iPhone-LEO-in-Space-Feature.jpg\" />\r\n<br />\r\n<em>Bloomberg</em>'s Mark Gurman later <a href=\"https://www.macrumors.com/2021/08/30/apple-emergency-satellite-features-iphones/\">provided new details on what the satellite capabilities could mean</a> for future iPhones, but he says the feature is unlikely to launch this year.\r\n<br />\r\n\r\n<br />\r\n<h2>What to Expect From the Apple Watch Series 7</h2>\r\n<br />\r\nThe next-generation Apple Watch is likely just weeks away, and rumors suggest it will be a notable upgrade, complete with a new design, larger display sizes, a new color option, and more. <a href=\"https://www.macrumors.com/2021/08/27/apple-watch-series-7-what-to-expect/\">Here is what to expect from the Apple Watch Series 7!</a>\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/Apple-Watch-7-Unreleased-Feature-Flat.jpg\" />\r\n<br />\r\nApple is also reported to be <a href=\"https://www.macrumors.com/2021/09/01/multiple-new-apple-watch-health-features/\">working on several new health features for the Apple Watch</a>, but most if not all of the features are expected to launch in 2022 or later.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple to Let Apps Like Netflix and Spotify Offer Links for Account Sign Ups Outside of the App Store</h2>\r\n<br />\r\nApple this week announced that, starting in early 2022, it will <a href=\"https://www.macrumors.com/2021/09/01/apple-reader-app-changes-japan-ftc/\">allow developers of \"reader\" apps to include an in-app link to their website</a> for users to set up or manage an account. \"Reader\" apps allow a user to access previously purchased content or subscription-based content for digital magazines, newspapers, books, audio, music, and video, according to Apple, such as Netflix, Spotify, and the Amazon Kindle app.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/app-store-vs-developers.jpg\" />\r\n<br />\r\nWhile the change is a step in the right direction towards a fairer App Store, <a href=\"https://www.macrumors.com/2021/09/02/developer-reaction-to-apple-reader-app-change/\">some developers think it isn't enough</a>.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Delays Rollout of Controversial Child Safety Features to Make Improvements</h2>\r\n<br />\r\nApple this week <a href=\"https://www.macrumors.com/2021/09/03/apple-delaying-rollout-of-child-safety-features/\">delayed the rollout of the child safety features</a> that it announced last month following negative feedback, the company has today announced. The planned features include scanning users' iCloud Photos libraries for Child Sexual Abuse Material (CSAM), Communication Safety to warn children and their parents when receiving or sending sexually explicit photos, and expanded CSAM guidance in Siri and Search.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/iphone-communication-safety-feature.jpg\" />\r\n<br />\r\nApple confirmed that feedback from customers, non-profit and advocacy groups, researchers, and others about the plans has prompted the delay to give the company time to make improvements.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple's Upcoming AR/VR Headset to Require Connection to iPhone</h2>\r\n<br />\r\nFor years, Apple has been <a href=\"https://www.macrumors.com/roundup/apple-glasses/\">rumored to be working on an AR/VR headset</a>, and a report this week claimed that it will <a href=\"https://www.macrumors.com/2021/09/02/ar-vr-headset-iphone-connection-required/\">need to be wirelessly tethered to an iPhone</a> or another Apple device to unlock full functionality — similar to the early days of the Apple Watch.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-mixed-reality-headset-mockup-feature-orange.jpg\" />\r\n<br />\r\nThe report offers new details on the Apple-designed chip and other features we can expect from the headset, which is expected to launch in 2022 or later.\r\n<br />\r\n\r\n<br />\r\n<h3>MacRumors Newsletter</h3>\r\n<br />\r\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r\n<br />\r\n\r\n<br />\r\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/sep-2-2021\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/04/top-stories-last-minute-iphone-13-rumors/\">Top Stories: Last-Minute iPhone 13 Rumors, Apple Announces App Store Changes, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-last-minute-iphone-13-rumors-apple-announces-app-store-changes-and-more.2309699/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=_O8NQaTbPrE:9aQ7jb-KEZM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=_O8NQaTbPrE:9aQ7jb-KEZM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/_O8NQaTbPrE\" />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"41fb3941802f74e315a4a15cf40765b686761c2103b4cf0bc01bfc28a57a4e34","category":"Apple"}