{"title":"Changes in Composition and Diversity of the Intestinal Microbiota, Associated with Carbohydrate Consumption in Type 2 Diabetes Mellitus Patients","link":"https://www.preprints.org/manuscript/202410.0875/v1","date":1728619905000,"content":"Type 2 diabetes mellitus (T2DM) is a multifactorial disease, influenced by dietary and environmental factors that can modify the intestinal microbiota. The aim was to evaluate changes in composition and diversity of the intestinal microbiota, associated with carbohydrate (CH) consumption in T2DM patients. Forty patients participated, with and without T2DM. Feces samples were collected for the characterization of microbial diversity from the massive sequencing of the 16S rRNA gene. Carbohydrate consumption was quantified from the FCF, the groups were categorized according to BMI and BMI + CH consumption. The group without T2DM showed normal biochemical and anthropometric parameters, although it had high carbohydrate consumption compared to the group with T2DM. At the Phylum level, there were differences in relative abundance, Control overweight group (CL–OW&amp;gt;CH) and T2DM-Normal Weight &amp;gt; CH patients, had increased Bacteroides and decreased Firmicutes. In contrast, CL–OW&amp;gt;CH and T2DM-OW&amp;lt;CH, showed reduced Bacteroidetes and elevated Firmicutes amount. At the genus level, the differences were in the relative abundance of Roseburia, Clostridium_IV, Prevotella, and Sporobacter, associated with the consumption of carbohydrate. The groups that consumed high amounts of carbohydrates, regardless of whether they had diabetes mellitus and overweight, had a significantly reduced proportion of Faecalibacterium, an altered proportion of Bacteroides. The high consumption of carbohydrate showed considerable modifications in the composition and diversity of the bacterial communities.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"41fff2ce07f7d2507e9f04428ba766eefbb9aa712dd4503fa798329b564b195f","category":"Interdisciplinary"}