{"title":"Effects of empagliflozin on gonadal functions of hyperglycemic male wistar rats","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305636","date":1718632800000,"content":"<p>by Roba Bdeir, Nour A. Al-Sawalha, O’la Al-Fawares, Lama Hamadeneh, Alia Khawaldeh</p>\r\n\r\nEmpagliflozin (EMPA) showed antiapoptotic, oxidative and anti-inflammatory potential effect. EMPA attenuates the inflammation and oxidative stress biomarkers in patients with heart failure while significantly decreases the malondialdehyde (a lipid peroxidation marker) levels in the plasma of diabetic patients. The present study examined the effects of moderate hyperglycemia on reproductive function. Sixty male Wister rats ‎ were divided and randomly allocated into four groups of 15 animals each‎‎. Diabetes was induced by a single intraperitoneal injection of a prepared solution containing STZ diluted in 0.1 M sodium citrate buffer (pH 4.5) at a dosage of 40 mg/kg body weight in selected in groups II and III for seven days before starting the treatment with EMPA. The current study revealed that EMPA for eight weeks prevented testicular high glucose-induced oxidative stress markers such as penile nitric oxide (NO), glutathione peroxidase (GPX) and total anti-oxidant capacity (TAC) in STZ-induced hyperglycemia in a rat model. In addition, EMPA ameliorated the high levels of endogenous Interleukin-6 (IL-6) present in gonads in response to an acute inflammatory found in the hyperglycemic STZ-induced rats. The present study further suggested the protective effects of EMPA and how it has a beneficial role and can effectively attenuate hyperglycemia-induced testicular oxidative damage and inflammatory markers as well as androgen dependent testicular enzymes activity as a protective role against the consequences of hyperglycemia and male sub-infertility.","author":"Roba Bdeir","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"41ff4deb196d5aae784413b9007b0564ac078f6c2e0492a53f2ea5ab7acc49db","category":"Interdisciplinary"}