{"title":"Apple Announces macOS Sonoma With Desktop Widgets and More","link":"https://www.macrumors.com/2023/06/05/apple-announces-macos-sonoma-with-desktop-widgets-and-more/","date":1685987397000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2023/06/macos-sonoma-brings-new-capabilities-for-elevating-productivity-and-creativity/\">announced</a> macOS Sonoma, the latest version of its Mac operating system. Launching this fall, macOS Sonoma includes several new features, including desktop widgets, Apple TV-like aerial screensavers, enhancements to apps like Messages and Safari, a new Game mode that prioritizes CPU and GPU performance for gaming, and more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/macos-sonoma-1.jpg\" alt width=\"1908\" height=\"1044\" />\r<br />\nThe first feature that Apple detailed was new interactive widgets, which can now be placed right on your desktop. Widgets blend into your desktop wallpaper to not be obtrusive when you're working, and with Continuity you can use the same widgets from your iPhone on your Mac.\r<br />\n\r<br />\nmacOS Sonoma also introduces enhanced video conferencing features, including Presenter Overlay to allow a user to display themselves in front of the content they are sharing. Reactions let users share how they feel within a video session, and Screen Sharing has been improved with a simplified process.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/macos-sonoma-3.jpg\" alt width=\"1910\" height=\"1252\" />\r<br />\nAs is usual with macOS updates, Safari is getting numerous new features within Sonoma. There's an update to Private Browsing that provides greater protection from trackers and from people who might have access to the user's device.\r<br />\n\r<br />\nProfiles within Safari offer a way to separate browsing between topics, like having one for work and one for personal browsing. There's also a new way to create web apps that work like normal apps and let you get to your favorite website faster.\r<br />\n\r<br />\nWhen you're not actively using macOS Sonoma, the new screen savers feature slow-motion videos of various locations worldwide. They shuffle between landscape, Earth, underwter, or cityscape themes, similar to what you'll see on tvOS.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/macos-sonoma-2.jpg\" alt width=\"1910\" height=\"1242\" />\r<br />\nFor gamers, there's a new Game Mode in macOS Sonoma that delivers an optimized gaming experience with smoother and more consistent frame rates. It dramatically lowers audio latency with AirPods and reduces input latency with game controllers, and it works with any game on Mac.\r<br />\n\r<br />\nThe beta version of macOS Sonoma is available today through the Apple Developer Program, and a public beta will launch next month. All Mac users can expect a public release of the software sometime this fall.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC 2023</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/05/apple-announces-macos-sonoma-with-desktop-widgets-and-more/\">Apple Announces macOS Sonoma With Desktop Widgets and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-announces-macos-sonoma-with-desktop-widgets-and-more.2391631/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"42033204748c8191b42f58b9f53cd515c9eb7ba9434d448192e0d606d2a90a51","category":"Apple"}