{"title":"‘Apple Passwords Deserve an App’","link":"https://cabel.com/2023/03/27/apple-passwords-deserve-an-app/","date":1679954452000,"content":"\n<p>Cabel Sasser:</p>\n\n<blockquote>\n  <p>We all know that Apple has nice built-in password management in\nmacOS and iOS. But very, very few people know that Apple’s\npasswords can also:</p>\n\n<ul>\n<li>Autofill any 2FA verification codes, which you easily can add by\nscanning QR codes!</li>\n<li>Keep a “Notes” field where you can add extra data, like 2FA\nbackup codes, for each password!</li>\n<li>Import passwords exported from another app, like 1Password!</li>\n</ul>\n\n<p>(And it all syncs across your devices, for free?!)</p>\n\n<p>Very few people know these things because <em>Apple tucks all of\ntheir important password features away in weird little Settings\npanels</em>, instead of in a Proper Real App. I think this is a\nmistake.</p>\n\n<p><em>Passwords are productivity, not preferences.</em></p>\n</blockquote>\n\n<p>I understand the tension within Apple on this front. iOS already has so many apps that many people complain about how many apps are in the system, so Apple is very conservative about adding new apps. But password management is <em>really</em> important, and Apple’s password/security team has done an outstanding job over the years building a reliable trustworthy system. Effectively, there already is an Apple Passwords “app”, but it’s buried inside Settings. There are a lot of nerds who don’t even know that Apple’s built-in password manager can handle 2FA verification codes, because people have a <em>totally</em> reasonable assumption that Settings, as sprawling as it is, only contains ... <em>settings</em>. Not features.</p>\n\n<p>So count me in with Sasser: Apple should break these features out into a discrete Passwords app, <em>and</em> they should launch a marketing campaign to raise awareness of it. I’ve been using the built-in password management in iOS and MacOS (and iCloud for syncing) for years, and last summer I switched all of my 2FA verification codes to it too. It’s a great system, especially if you use Safari as your web browser. But the biggest reason it isn’t used more is that zillions of people don’t even know it’s there.</p>\n\n<p>If Tips is worth a standalone app, surely Passwords is too.</p>\n\n<p>(As a postscript, it’s also possible that you know this feature exists within Settings, but don’t know that it offers full import and export options, because those commands are tucked away in a “···” menu. You can import from, say, 1Password, and export everything back to 1Password.)</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/27/apple-passwords-deserve-an-app\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"42031e7ac11781568c10ab2cc98495b5e2f071d7f153289746791efac31da086","category":"Tech"}