{"title":"iOS 17 Will Let You Create a Voice Sounding Like You in Just 15 Minutes","link":"https://www.macrumors.com/2023/05/17/ios-17-personal-voice-feature/","date":1684351545000,"content":"Apple this week previewed <a href=\"https://www.macrumors.com/2023/05/16/apple-previews-ios-17-accessibility-features/\">new iPhone, iPad, and Mac accessibility features</a> coming later this year. One feature that has received a lot of attention in particular is Personal Voice, which will allow those at risk of losing their ability to speak to \"create a voice that sounds like them\" for communicating with family, friends, and others.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Personal-Voice-iPhone-Feature.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nThose with an iPhone, iPad, or newer Mac will be able to create a Personal Voice by reading a randomized set of text prompts aloud until 15 minutes of audio has been recorded on the device. Apple said the feature will be available in English only at launch, and uses on-device machine learning to ensure privacy and security.\r<br />\n\r<br />\nPersonal Voice will be integrated with another new accessibility feature called Live Speech, which will let iPhone, iPad, and Mac users type what they want to say to have it be spoken out loud during phone calls, FaceTime calls, and in-person conversations.\r<br />\n\r<br />\nApple said Personal Voice is designed for users at risk of losing their ability to speak, such as those with a recent diagnosis of ALS (amyotrophic lateral sclerosis) or other conditions that can progressively impact speaking ability. Like other accessibility features, however, Personal Voice will be available to all users. The feature will likely be added to the iPhone with iOS 17, which should be unveiled next month and released in September.\r<br />\n\r<br />\n\"At the end of the day, the most important thing is being able to communicate with friends and family,\" said Philip Green, who was diagnosed with ALS in 2018 and is a member of the ALS advocacy organization Team Gleason. \"If you can tell them you love them, in a voice that sounds like you, it makes all the difference in the world — and being able to create your synthetic voice on your iPhone in just 15 minutes is extraordinary.\"<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/accessibility/\">Accessibility</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/17/ios-17-personal-voice-feature/\">iOS 17 Will Let You Create a Voice Sounding Like You in Just 15 Minutes</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-will-let-you-create-a-voice-sounding-like-you-in-just-15-minutes.2389805/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4209cd3b9c58e79e2dd3cb34a9e96757dc2a05dd78ab854db2447dd2ad9d863c","category":"Apple"}