{"title":"Worm that jumps from rats to slugs to human brains has invaded Southeast US","link":"https://arstechnica.com/?p=1970550","date":1695414844000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/04/Angiostrongylus_cantonensis-e1491593603207.png\" alt=\"Adult female worm of &lt;em&gt;Angiostrongylus cantonensis&lt;/em&gt; recovered from rat lungs with characteristic barber-pole appearance (anterior end of worm is to the top). Scale bar = 1 mm.\" />\n      <p>Adult female worm of <em>Angiostrongylus cantonensis</em> recovered from rat lungs with characteristic barber-pole appearance (anterior end of worm is to the top). Scale bar = 1 mm. (credit: <a href=\"https://en.wikipedia.org/wiki/Angiostrongylus_cantonensis#/media/File:Angiostrongylus_cantonensis.png\">Lindo et al.</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The dreaded rat lungworm—a parasite with a penchant for rats and slugs that occasionally finds itself rambling and writhing in human brains—has firmly established itself in the Southeast US and will likely continue its rapid invasion, <a href=\"https://wwwnc.cdc.gov/eid/article/29/10/23-0706_article\">a study published this week</a> suggests.</p>\n<p>The study involved small-scale surveillance of dead rats in the Atlanta zoo. Between 2019 and 2022, researchers continually turned up evidence of the worm. In all, the study identified seven out of 33 collected rats (21 percent) with evidence of a rat lungworm infection. The infected animals were spread throughout the study's time frame, all in different months, with one in 2019, three in 2021, and three in 2022, indicating sustained transmission.</p>\n<p>Although small, the study \"suggests that the zoonotic parasite was introduced to and has become established in a new area of the southeastern United States,\" the study's authors, led by researchers at the University of Georgia College of Veterinary Medicine, concluded. The study was published Wednesday in the journal Emerging Infectious Diseases.</p></div><p><a href=\"https://arstechnica.com/?p=1970550#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1970550&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"420db617b5efa5154dd0daf722842513255a15db6fc573d01e06a674c29d1eed","category":"Tech"}