{"title":"Dipole Potential of Monolayers with Biologically Relevant Lipid Compositions","link":"https://www.preprints.org/manuscript/202410.0151/v1","date":1727855101000,"content":"The membrane dipole potential that arises from the interfacial water and constitutive dipolar groups of lipid molecules modulates the interaction of amphiphiles and proteins with membranes. Consequently, its determination for lipid mixtures resembling the existing diversity in biological membranes is very relevant. In this work the dipole potential of monolayers, formed at the air-water interface, from pure or mixed lipids (1-palmitoyl-2-oleoyl-sn-glycero-3-phosphocholine (POPC), 1-palmitoyl-2-oleoyl-sn-glycero-3-phosphoethanolamine (POPE), 1-palmitoyl-2-ol0eoyl-sn-glycero-3-phosphatidyserine (POPS), Sphingomyelin (SpM) and cholesterol) were measured and correlated with the mean area per lipid. The results showed that, as previously observed, cholesterol increases the dipole potential in correspondence with the decrease in the average area per lipid and that the replacement of phosphocholine lipids by sphingomyelin leads to a decrease in the dipole potential. We have also observed that 20 mol% of POPE induces a monolayer condensation which is not affecting the measured dipole potential, except when cholesterol is added to the mixture. Additionally, at the small mole fractions encountered in biomembranes, the presence of the negatively charged lipid POPS increases the dipole potential of monolayers even though an enhancement in the monolayer packing is not evident. This increase in the dipole potential due to POPS and cholesterol and the smaller dipole potential of monolayers containing large amounts of SpM generates a non-zero transbilayer dipole potential in the asymmetric plasma membrane of eukaryotic cells.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"420d405466fecc7834b38c03da022c946949192567427b430dd96731a7b75cf8","category":"Interdisciplinary"}