{"title":"Guidemaster: PC games to keep the dream alive in a cross-platform world","link":"https://arstechnica.com/?p=1952005","date":1688818531000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/01/IMG-1821.jpg\"><img alt=\"CES introduced an OLED PC monitor with quantum dots.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/01/IMG-1821-640x480.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2022/01/IMG-1821-1280x960.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/01/IMG-1821.jpg\">CES introduced an OLED PC monitor with quantum dots.</a> (credit: Scharon Harding)</p></div>\n<p>At the turn of the millennium, it was easy to define what a PC game was: a game programmed to run on a machine with x86 hardware, booting (in most cases) a DOS or Windows operating system, and controlled by a keyboard and mouse. The answer is less clear today, though. Most console games are ported to the PC. Many PC games are ported to console. And the most popular new PC gaming device of 2022, the Steam Deck, doesn’t even have a (physical) keyboard.</p>\n<p>I’m all for more choice in how gamers choose to play, but something is lost when a PC game is forced to fit within the design constraints of console hardware and gamepad input. Fortunately, some titles (and franchises) still take a PC-first approach.</p>\n<p>In the wake of a series of high-profile bad ports from consoles, a years-long GPU shortage, and other challenges for PC gaming, I took a dive back into my Steam library to identify recommendations for anyone who remembers the golden age of PC gaming fondly and wants to recapture some of that magic. Of course, some games are part of classic franchises, but others are fresh takes on the genres that characterized that lost era.</p></div><p><a href=\"https://arstechnica.com/?p=1952005#p3\">Read 40 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1952005&amp;comments=1\">Comments</a></p>","author":"Matthew Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"42159ae140b4d91dde9c130151933fbba38eba50d12fdf6ec0e455a7fff5cf1f","category":"Tech"}