{"title":"T-Mobile Automatically Upgrading Users to More Expensive Plans, But There's an Opt-Out Option","link":"https://www.macrumors.com/2023/10/11/t-mobile-plan-migration/","date":1697059380000,"content":"T-Mobile will be forcing customers on older smartphone plans to move to newer, more expensive plans, according to information that has been <a href=\"https://www.reddit.com/r/tmobile/comments/174uelk/megathread_forced_plan_migration_for_older_plans/\">shared on Reddit</a>. The migration will be automatic, but customers can contact support to ask to opt out of the migration.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/t-mobile-logo-16x9.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThose who had the prior Magenta and One plans will be upgraded to Go5G, while those on the Magenta 55+ plan will be upgraded to Go5G+. Simple Choice and Select Choice users will be moved to Magenta or Essentials Select.\r<br />\n\r<br />\nWith these migrations to new plans, customers will see price increases of $5 to $10 per line depending on current plan. Those on the Simple/Select Choice plans, for example, will see a $10 per line price increase.\r<br />\n\r<br />\nCustomers who miss the notification about the upcoming plan changes can still ask to revert back for a short period, though customer service will attempt to push customers to new plans with one-time credits.\r<br />\n\r<br />\nAs noted by <em><a href=\"https://tmo.report/2023/10/breaking-t-mobile-will-force-customers-onto-newer-plans-unless-you-opt-out/\">The Mobile Report</a></em>, customer support representatives will attempt to convince users about the benefits of the new plan. \"We are not raising the price of any of your plans; we are moving you to a newer plan with more benefits at a different cost,\" T-Mobile instructs employees to say.\r<br />\n\r<br />\nCustomers will begin receiving notifications about the upcoming plan changes on October 17, both through text messages and emails. Migration timing will vary based on bill cycle.<div>Tag: <a href=\"https://www.macrumors.com/guide/t-mobile/\">T-Mobile</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/11/t-mobile-plan-migration/\">T-Mobile Automatically Upgrading Users to More Expensive Plans, But There's an Opt-Out Option</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/t-mobile-automatically-upgrading-users-to-more-expensive-plans-but-theres-an-opt-out-option.2407252/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"421ff1b902401b5a00b17ceeaffbcd8cce83d970aa44f6985b5b71da993de3d7","category":"Apple"}