{"title":"Hackers exploit security flaw to target iOS 17 iPhones with ‘notification attack’","link":"https://www.macworld.com/article/2057293/flipper-zero-bluetooth-pop-up-notification-ddos-iphone.html","date":1697644908000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p><em>Editor’s note: Updated on 10/18/23 with a reference to Xtreme-Firmware. This article was originally posted on 9/6/23.</em></p>\n\n\n\n<p>The iPhone makes it easy to connect to Bluetooth devices, such as AirTags or AirPods. However, a hacker has discovered a way to hijack your iPhone and flood it with prompts to connect to devices, making it difficult to use the iPhone.</p>\n\n\n\n<p>A security researcher called Techryptic (identified as “Anthony” by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://techcrunch.com/2023/09/05/flipper-zero-hacking-iphone-flood-popups/&amp;xcust=1-1-2057293-1-0-0&amp;sref=https://www.macworld.com/feed\">TechCrunch</a>) wrote a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://techryptic.github.io/2023/09/01/Annoying-Apple-Fans/&amp;xcust=1-1-2057293-1-0-0&amp;sref=https://www.macworld.com/feed\">blog post</a> and made a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://youtu.be/OWXt8oTJ1lo&amp;xcust=1-1-2057293-1-0-0&amp;sref=https://www.macworld.com/feed\">video demonstration</a> on how a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://flipperzero.one&amp;xcust=1-1-2057293-1-0-0&amp;sref=https://www.macworld.com/feed\">Flipper Zero</a> can be used to flood an iPhone with the connection notifications that you usually see with Bluetooth devices. As Techryptic <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/tech/status/1698517411098456140?s=20&amp;xcust=1-1-2057293-1-0-0&amp;sref=https://www.macworld.com/feed\">puts it</a>, an attacker can “effectively launch a DDOS [distributed denial-of-service] notification attack on any iOS device.” The barrage of notifications would make it practically impossible for anyone to use the iPhone.</p>\n\n\n\n<p>According to the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://flipperzero.one/#:~:text=What%20is%20Flipper%20Zero&amp;xcust=1-1-2057293-1-0-0&amp;sref=https://www.macworld.com/feed\">Flipper Zero website</a>, a Flipper Zero is a $169 device used to, “explore any kind of access control system, RFID, radio protocols, and debug hardware using GPIO pins.” Techryptic used Flipper Zero to broadcast Bluetooth Advertisements that are used by Apple devices to allow users to make connections.</p>\n\n\n\n<p>Flipper Devices, the company behind the Flipper Zero, sent a statement to Macworld, saying that this functionality is not possible to do on the default Flipper Zero hardware. “We have taken necessary precautions to ensure the device can’t be used for nefarious purposes,” said a Flipper Devices representative. “Since the firmware is open source, individuals can adjust it and use the device in an unintended way, but we don’t promote this and condone the practice if the goal is to act maliciously.”</p>\n\n\n\n<p>Techryptic states that this attack can be used simply as a prank or for security research. Techryptic also noted that a future blog post will explain how it can be used maliciously. Techryptic’s blog post says the Flipper Zero has a limited range, so an attacker needs to be within close proximity of the target. But TechCrunch was told that a Flipper Zero could be outfitted with an “amplified board” to extend the range to “thousands of feet.”</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>Macworld received an email claiming that Techryptic’s work is based on a project called <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://github.com/ECTO-1A/AppleJuice&amp;xcust=1-1-2057293-1-0-0&amp;sref=https://www.macworld.com/feed\">AppleJuice</a>, which is posted to the GitHub account of ECTO-1A and includes “scripts [that] are an experimental PoC [proof of concept] that uses Bluetooth Low Energy (BLE) to send proximity pairing messages to Apple devices.” The AppleJuice project was created on GitHub on August 24 and was inspired by a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://techcrunch.com/2023/08/14/researcher-says-they-were-behind-iphone-popups-at-def-con/&amp;xcust=1-1-2057293-1-0-0&amp;sref=https://www.macworld.com/feed\">demonstration of persistent iPhone Bluetooth pop-ups at Def Con</a> last month.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.zdnet.com/article/flipper-zero-can-lock-up-an-iphone-running-the-latest-ios-17/&amp;xcust=1-1-2057293-1-0-0&amp;sref=https://www.macworld.com/feed\">ZDNet</a> reports that there is another firmware update that can be applied to the Flipper Zero called <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://github.com/Flipper-XFW/Xtreme-Firmware&amp;xcust=1-1-2057293-1-0-0&amp;sref=https://www.macworld.com/feed\">Xtreme-Firmware</a>. After it is installed, an app called Apple BLE Spam has a function called Lockup Crash that can be used to perform a denial of service attack on an iPhone. ZDNet’s testing showed that Xtreme-Firmware can be successfully used against iPhones running iOS 17, but iOS 16 was not affected.</p>\n\n\n\n<h2>How to protect yourself from fake Bluetooth notifications</h2>\n\n\n\n<p>Techryptic, the AppleJuice project, or the Xtreme-Firmware project do not state if Apple has been notified of the security hole. Considering the tone of the Techryptic post–it was titled, “Annoying Apple Fans”–Apple likely did not receive notice from Techryptic prior to the post. Typically, security researchers do not reveal their findings until Apple has released a fix.</p>\n\n\n\n<p>TechCrunch reports that Apple can mitigate the attacks “by ensuring the Bluetooth devices connecting to an iPhone are legitimate and valid, and also reducing the distance at which iDevices can connect to other devices using Bluetooth.” With that in mind, the way Apple would implement a fix is through an iOS update, so it’s important to keep your iPhone up-to-date.</p>\n\n\n\n<p>The only practical way a user can protect themselves is to turn off Bluetooth, which isn’t ideal. So until Apple issues a fix, it’s important to keep in mind that this attack is rare. If you get an unfamiliar notification to connect to a device, be cautious and take precautions–turn down the request if you can. Since this attack could inundate your iPhone with notifications, you may have to try leaving the area and shutting down your phone to stop the attack.</p>\n\niOS, iPhone, Mobile Phone Accessories, Security Software and Services</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4229fbbfed574972737d506a9e64262150037a9f9ee960b2d51d5df8f676f62e","category":"Apple"}