{"title":"Shohei Ohtani’s $700 Million Contract With the Dodgers Will Pay Him Just $2 Million Per Year","link":"https://www.wsj.com/sports/baseball/shohei-ohtani-700-million-contract-deferral-067a345f?mod=hp_lead_pos9","date":1702426706000,"content":"\n<p>Lindsey Adler and Richard Rubin, reporting for The Wall Street Journal (<a href=\"https://apple.news/Ajh7Er2roS3anlf0c2qdn_Q\">News+ link</a>):</p>\n\n<blockquote>\n  <p>Shohei Ohtani joined a new team this weekend. You probably heard \nabout it. The Japanese superstar on Saturday agreed to a \nblockbuster 10-year deal with the Los Angeles Dodgers that will \npay him $700 million in total, making it the largest contract in \nU.S. sports history. But Ohtani won’t actually be the highest-paid \nathlete in America for a while yet. Next season, in fact, the man \nwith the richest contract in baseball history will be making less \nthan some rookies. </p>\n\n<p>Ohtani will take home just $2 million per season over the 10-year \nspan of his contract, which was made official Monday night. In an \nunprecedented structure, Ohtani will defer $68 million per season \nuntil the end of his contract, meaning the Dodgers will pay him \n$680 million between 2034 and 2043. By the time Ohtani receives \nhis final paycheck from the team, he will be 49 years old. [...] </p>\n\n<p>The contract will also have implications for the Dodgers’ payroll \nunder MLB’s luxury tax rules, which calculates its average annual \nvalue based on actual yearly salary ($2 million, in this case) and \nthe present day value of the deal (roughly $44 million). As a \nresult, the Dodgers will take a $46 million hit against their \nluxury tax payroll each season, a record-setting annual average \nvalue, but a steep decrease from a $70 million per year hit if the \nsalary were paid out in full during the course of Ohtani’s \ncontract. </p>\n</blockquote>\n\n<p>This report from the WSJ is the first I’ve seen that accurately explains the luxury tax implications. All the reporting I read over the weekend, when the news of this unusual structure broke, made it sound like only the $2 million per year they’ll be paying Ohtani while he’s actually playing over the next decade would count toward the team’s payroll, which seemed grossly unjust. $46 million per year seems about right.</p>\n\n<p>Ohtani earns an estimated <a href=\"https://theathletic.com/5129506/2023/12/11/dodgers-shohei-ohtani-contract-deferrals/\">$45–50 million per year in endorsement contracts</a>, so it’s doubtful he’ll need to move into the YMCA while wearing Dodger blue. If I were him I’d have pulled a Steve Jobs and taken just $1 per year until the deferments kick in.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/12/12/ohtani-2-million-dollar-man\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"422cfb3830fb92aca80d9d65e6058d4b7529618b874233cfe846774af970cff1","category":"Tech"}