{"title":"The Anti-atherosclerotic Effects of Endothelin Receptor Antagonist, Bosentan, in Combination with Atorvastatin &ndash; an Experimental Study","link":"https://www.preprints.org/manuscript/202405.0913/v1","date":1715662240000,"content":"Bosentan, an endothelin-receptor antagonist (ERA), has potential anti-atherosclerotic properties. We investigated the complementary effects of bosentan and atorvastatin on the progression and composition of the atherosclerotic lesions in diabetic mice. Forty-eight male apoE-/- mice were fed high-fat diet (HFD) for 14 weeks. At week 8, diabetes was induced with streptozotocin and mice were randomized into 4 groups: 1) Control/COG: no intervention. 2) ΒΟG: bosentan 100 mg/kg/day per os. 3) ATG: atorvastatin 20mg/kg/day per os). 4) BO+ATG: Combined administration of bosentan and atorvastatin. The intra-plaque contents of collagen, elastin, monocyte chemoattractant protein-1 (MCP-1), tumor necrosis factor-a (TNF-a), matrix-metalloproteinases (MMP-2,-3,-9), and TIMP-1 concentrations were determined. The percentage of lumen stenosis significantly decreased across all treated groups: BOG: 19.5±2.2%, ATG: 12.8±4.8%, BO+ATG: 9.1±2.7% compared to controls (24.6±4.8%, p&amp;lt;0.001). Both atorvastatin and bosentan significantly increased collagen content and fibrous cap thickness versus COG (p&amp;lt;0.01). All intervention groups reduced the relative intra-plaque concentrations of MCP-1, MMP-3,-9, and increased TIMP-1 compared to COG (p&amp;lt;0.001). Importantly, bosentan showed modest but additive to atorvastatin effects on the latter parameters compared COG (p&amp;lt;0.05). Bosentan treatment in diabetic, atherosclerotic apoE-/- mice delayed the atherosclerosis progression and enhanced plaques’ stability, showing modest but complementary effects with atorvastatin, which are promising in atherosclerotic cardiovascular diseases.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4234ceb4f682ae2bca551cbbc9d87355e6657fda8ad8c255ffc0da4eec830ec1","category":"Interdisciplinary"}