{"title":"More vaccine progress: This time, it’s malaria","link":"https://arstechnica.com/?p=1777363","date":1625081807000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/GettyImages-1167832768-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/GettyImages-1167832768.jpg\">Enlarge</a> <span>/</span> A health worker vaccinates a child against malaria in Ndhiwa, western Kenya. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/health-worker-vaccinates-a-child-against-malaria-in-ndhiwa-news-photo/1167832768?adppopup=true\"> BRIAN ONGORO / Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The development of the COVID-19 vaccines was a triumph of biotechnology. But that triumph has partly obscured the amount of luck involved in the process of vaccine development. We've been trying for decades to produce vaccines against HIV, but no amount of high-tech biology has gotten us there.</p>\n<p>Malaria is another killer that has so far resisted vaccine efforts, but this spring brought hope that we are making progress. Back in May, a small clinical trial of a relatively traditional vaccine showed an efficacy of over 70 percent. And this week, a new paper describes a very different way of generating highly effective immunity to the malarial parasite.</p>\n<h2>Why is malaria so hard?</h2>\n<p>Malaria has resisted vaccination for several reasons. One is that the disease is not caused by just a single infectious agent. Instead, Malaria comes from several related species in the <em>Plasmodium</em> genus. <em>Plasmodium falciparum</em> typically causes more severe illnesses and has thus been the target of most vaccine efforts. But even if we're able to prevent infections by this strain, we won't see the end of malaria.</p></div><p><a href=\"https://arstechnica.com/?p=1777363#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1777363&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4235ddd6a7243eb2580c10e96610c2dd101f0c4415214d314e248ad1bd42118c","category":"Tech"}