{"title":"Archaeologists discover intact medieval gauntlet at Kyburg Castle","link":"https://arstechnica.com/?p=1997138","date":1705679546000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/gauntlet1-800x533.jpg\" alt=\"Archaeologists discover intact medieval gauntlet at Kyburg Castle\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/gauntlet1.jpg\">Enlarge</a> (credit: Canton of Zurich)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Archaeologists <a href=\"https://www.swissinfo.ch/eng/business/swiss-archaeologists-piece-together-14th-century-gauntlet/49131908?linkType=guid&amp;utm_campaign=swi-rss&amp;utm_source=gn&amp;utm_medium=rss&amp;utm_content=o\">announced this week</a> that they have discovered an intact 14th-century medieval gauntlet during excavations around Switzerland's <a href=\"https://en.wikipedia.org/wiki/Kyburg_(castle)\">Kyburg Castle</a>—a rare find, given that only five other gauntlets from this period have been found in the region to date. It's remarkably well-preserved, with many design and decorative details clearly visible. The team also unearthed fragments of the glove's companion, worn on the opposite hand.</p>\n<p>The origins of Kyburg Castle date back to around the late 10th century, with the first mention occurring in 1027 under the name <em>Chuigeburg</em> (translation: \"cows-fort\"). That suggests it was originally used to house livestock. The Holy Roman Emperor <a href=\"https://en.wikipedia.org/wiki/Conrad_II,_Holy_Roman_Emperor\">Conrad II</a> destroyed that early fortification sometime between 1028 and 1030, but it was rebuilt and became a possession of the <a href=\"https://en.wikipedia.org/wiki/Counts_of_Dillingen\">counts of Dillingen</a>. It was partially destroyed again in 1079 as Pope Gregory VII and Henry IV (who would later become Holy Roman Emperor) engaged in a bitter conflict over which of them had the power to install bishops, monastery abbots, and even the pope himself (known as the <a href=\"https://en.wikipedia.org/wiki/Investiture_Controversy\">Investiture Controversy</a>).</p>\n<p>That conflict didn't resolve for a good 50 years, but Kyburg Castle endured, and by the 13th century, the counts of Kyburg (descendants of the Dillingen family) were among the most powerful noble families in the Swiss plateau. Kyburg Castle is one of the largest surviving castles in Switzerland, with its existing core dating back to the 13th century. In addition to the tower and great hall, there are several residential and commercial buildings as well as a chapel, all connected by a ring wall that encloses the courtyard. It has belonged to the Canton of Zurich since 1917 and is currently run by the Verein Museum Schloss Kyburg.</p></div><p><a href=\"https://arstechnica.com/?p=1997138#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1997138&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"42384e10aa23935f8c8d7a7543f5043df6fe207e29069906131393e975aea2b6","category":"Tech"}