{"title":"Dynamics of multilevel alliances in St. Johns River, Florida, Tamanend's bottlenose dolphins (Tursiops erebennus) with respect to an epizootic unusual mortality event","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13165?af=R","date":1723629584000,"content":"<h2>Abstract</h2>\n<p>Disturbance events can alter a community's association patterns, which can influence mating tactics. The St. Johns River (SJR) bottlenose dolphin (<i>Tursiops erebennus</i>) community was impacted by the 2013–2015 unusual mortality event (UME), caused by cetacean morbillivirus, through mortality and social network changes. We analyzed male alliance stability and behavior from April 2011 through March 2017 with respect to the UME. During the UME, 12 first-order alliance dyads ended due to a partner's death or disappearance. Alliance tactics varied: forming second-order alliances (<i>n</i> = 21 alliances; teams of first-order alliances), forming first-order alliances (<i>n</i> = 13 alliances) or remaining unallied after an alliance dissolved (<i>n</i> = 8 individuals). During- and post-UME, fewer allied males formed second-order alliances (55%) compared to pre-UME (68%). While the UME likely indirectly influenced alliance behavior through demographic changes, female presence and breeding season consistently influenced alliance associations and consortships (cooperatively flanking a female), indicating a reproductive function for SJR alliances. Increased consortships when a second-order partner was present suggests second-order alliances may provide consortship support against rival males. These results enhance our understanding of multilevel alliance reproductive benefits and demonstrate the adaptability of male mating tactics in response to disturbances resulting in demographic changes.</p>","author":"Kristin K. Brightwell, \nEwa B. Krzyszczyk, \nQuincy A. Gibson","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"4239d9f8bcd9b33290dbb7298238e0dbcc7a21fd551b9b9cba92c3a93508f0e3","category":"Environment"}