{"title":"Philipsen pips Greipel in Turkey, Mas takes the lead in Valencia: Daily News","link":"https://cyclingtips.com/2021/04/philipsen-pips-greipel-in-turkey-mas-takes-the-lead-in-valencia-daily-news/","date":1618611589000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>We head into the weekend with racing news from the Tour of Turkey and the Volta a la Comunitat Valenciana, as well as an update from Thibaut Pinot, who is still not fully certain that he will start the Giro d’Italia.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br />News Editor</em></p>\n\n\n\n<h2>What’s news?</h2>\n\n\n\n<h3>Philipsen pips Greipel to win stage 6 of the Tour of Turkey</h3>\n\n\n\n<p><strong>Jasper Philipsen</strong> narrowly bested <strong>André Greipel</strong> to win stage 6 of the <strong>Tour of Turkey</strong> on Friday, with <strong>Kristoffer Halvorsen</strong> taking third on the day.</p>\n\n\n\n<p>The 129.1 km stage from Fethiye to Marmaris came down to a bunch kick, with Israel Start-Up Nation leading the way into the final kilometer. Greipel wound up to speed inside the last 200 meters but Philipsen was tucked in just behind and surged past in the closing meters to take a close victory, his first in the Tour of Turkey after nabbing runner-up honors three times so far this year. Greipel settled for second with Halvorsen topping <strong>Mark Cavendish</strong> for third.</p>\n\n\n\n<p>José Manuel Díaz finished safely in the bunch to retain his general classification lead with two stages left to race.</p>\n\n\n<p></p>\n\n\n<h3>Mas wins stage 3 of the Volta a la Comunitat Valenciana</h3>\n\n\n\n<p><strong>Enric Mas</strong> powered to his first victory of the season on Friday’s stage 3 of the <strong>Volta a la Comunitat Valenciana</strong>.</p>\n\n\n\n<p>The 165 km stage from Torrent to Dos Aguas saw a select group get clear of the pack with more than 60 km still to go, with Mas among the riders in the move. Mas and a handful of others held on until the final climb, where they then contended with each other for the stage win.</p>\n\n\n\n<p>Mas battled with <strong>Victor Lafay</strong> and <strong>Elie Gesbert</strong> in the uphill final kilometer until Mas pulled clear and held on to win with a two-second gap to Lafay, with Gesbert taking third on the day. Overnight leader <strong>Miles Scotson</strong> lost touch from the chasing pack, and as such, Mas now leads the general classification with an eight-second gap back to Lafay.</p>\n\n\n<p></p>\n\n\n<h3>Pinot still not fully certain of Giro start</h3>\n\n\n\n<p><strong>Thibaut Pinot</strong> offered an update on his status and his 2021 plans in an interview with <a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Thibaut-pinot-je-n-irai-au-giro-que-si-je-suis-a-100/1243187\" target=\"_blank\">L’Equipe</a>, revealing that he is still not completely certain that he will race the <strong>Giro d’Italia</strong> as he continues to recover from back issues.</p>\n\n\n\n<p>Pinot suffered a back injury when he crashed on stage 1 of the 2020 Tour de France and he spent the offseason focusing on his recovery. He has started multiple races already this year but is still unsure of whether he will be fully ready for the Giro. He is set to race the Tour of the Alps next week, and will have a chance to evaluate his status there.</p>\n\n\n\n<p>“I am scheduled for the Giro but I will only go if I am 100%,” Pinot said. “At 95%, I won’t go, that’s for sure because it’s the most difficult event and I don’t want to relive the last Tour de France and the Vuelta. We will take stock after the Tour of the Alps and even if we have several other plans just in case, I go to ride the Giro.”</p>\n\n\n\n<h3>Roglic doesn’t plan to race the Critérium Dauphiné or the Tour de Suisse</h3>\n\n\n\n<p><strong>Primoz Roglic</strong> is set to start the upcoming <strong>Amstel Gold Race</strong>, <strong>La Flèche Wallonne</strong>, and <strong>Liège-Bastogne-Liège</strong> (where he is the defending champ), but according to <a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Pas-de-criterium-du-dauphine-pour-primoz-roglic/1242944\" target=\"_blank\">L’Equipe</a>, he will then take a break from racing until the Tour de France.</p>\n\n\n\n<p>In other words, Roglic is not planning to race either the <strong>Critérium du Dauphiné</strong> or the <strong>Tour de Suisse</strong>, or any of the other major events in the run-up to the Tour.</p>\n\n\n\n<p>“He raced a lot last year,” Jumbo-Visma sports director Frans Maassen told L’Equipe, “and these two months without running will allow him to store some freshness to be able to link the Tour de France and the Olympics, which are a big goal for him. This is what we have decided and, barring an incident, there will be no change.”</p>\n\n\n\n<h2>In case you missed it …</h2>\n\n\n\n<ul><li>Matt de Neef has the <a href=\"https://cyclingtips.com/2021/04/preview-your-guide-to-the-2021-mens-amstel-gold-race/\" target=\"_blank\">preview</a> with everything you need to know ahead the men’s <strong>Amstel Gold Race</strong>.</li><li>Abby Mickey has the <a href=\"https://cyclingtips.com/2021/04/preview-what-you-need-to-know-ahead-of-the-womens-amstel-gold-race/\" target=\"_blank\">preview</a> with everything you need to know ahead of the women’s <strong>Amstel Gold Race</strong>.</li><li>As Ronan Mc Laughlin writes, <strong>Team Spectra Wiggle powered by Vitus</strong> is a new UK-based team with <a href=\"https://cyclingtips.com/2021/04/spectra-wiggle-p-b-vitus-more-teams-like-this-please/\" target=\"_blank\">refreshing ambitions</a>.</li><li>Amy Jones has the latest in <strong>news from the world of women’s cycling</strong> in the latest <a href=\"https://cyclingtips.com/2021/04/womens-cycling-weekly-issue-21/\" target=\"_blank\">Women’s Cycling Weekly</a>.</li><li>José Been <a href=\"https://cyclingtips.com/2021/04/simon-carr-is-flying-under-the-radar-for-now/\" target=\"_blank\">caught up</a> with <strong>Simon Carr</strong>, who may not be flying under the radar for long.</li></ul>\n<p>The post <a href=\"https://cyclingtips.com/2021/04/philipsen-pips-greipel-in-turkey-mas-takes-the-lead-in-valencia-daily-news/\">Philipsen pips Greipel in Turkey, Mas takes the lead in Valencia: Daily News</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"42391fd684139929f438b63363b167d33a713637f02bd24130092136a140df62","category":"Cycling"}