{"title":"HashiCorp Terraform Cloud Wins 2021 CRN Tech Innovator Award","link":"https://www.hashicorp.com/blog/hashicorp-terraform-cloud-wins-2021-crn-tech-innovator-award","date":1636563600000,"content":"<p>We are thrilled to report that <a href=\"http://www.crn.com/\">CRN</a>, a brand of<a href=\"http://www.thechannelco.com/\"> The Channel Company</a>, has named HashiCorp Terraform Cloud as the winner of the<a href=\"https://www.crn.com/rankings-and-lists/ti2021.htm\"> 2021 CRN Tech Innovator Awards</a> for DevOps Platforms.</p>\n<p>This annual award program showcases innovative IT vendors across 47 different technology categories, in key areas ranging from cloud to storage to networking to security. (<a href=\"https://www.hashicorp.com/blog/hashicorp-named-a-finalist-for-2020-crn-tech-innovator-award\">In 2020, Terraform Cloud was a finalist</a> in the category of Cloud Tools &amp; Management.) To determine the winners, a panel of CRN editors reviewed hundreds of vendor products using multiple criteria, including key capabilities, uniqueness, technological ingenuity, and the ability to address both customer and partner needs.</p><img src=\"https://www.datocms-assets.com/2885/1636476616-2021-crn-tech-innovators-award-winnerhorizontal-logo.jpg\" /><h2><a href=\"#about-hashicorp-terraform-cloud\">»</a><a></a>About HashiCorp Terraform Cloud</h2>\n<p>HashiCorp Terraform Cloud is the fastest way for organizations to adopt Terraform, the world's most widely used multi-cloud provisioning product. Offered as a managed service, Terraform Cloud helps DevOps teams streamline the foundational process of provisioning their cloud infrastructure while providing practitioners, teams, and global businesses with everything they need to consistently manage risks for security, compliance, and operational constraints. It can reduce security risks with a simplified policy and governance regime, ensuring the right people have access to the right things within the cloud. Leveraging a single platform and unified set of APIs and workflows, teams can improve flexibility and reduce costs, enabling a higher percentage of skilled workers to focus on applications that deliver business value.</p>\n<p>Initially released in 2019, Terraform Cloud is a fully featured SaaS application, helping organizations enjoy enhanced workflow capabilities and harness the benefit of infrastructure as code to increase productivity, shorten time-to-resolution for potential issues, reduce time-to-market, and cut operation costs. Used by more than <a href=\"https://www.hashicorp.com/resources/celebrating-terraform-1-0\">120,000 users for 30,000 runs per day, Terraform Cloud</a> is one of the best ways for developers to provision infrastructure to speed application delivery. Hosted by HashiCorp, Terraform Cloud gives HashiCorp systems integrators and reseller partners an alternative solution to Terraform Enterprise to help customers accelerate cloud adoption without requiring dedicated onsite cloud expertise.</p>\n<h2><a href=\"#what-s-new-with-hashicorp-terraform-cloud\">»</a><a></a>What’s New with HashiCorp Terraform Cloud</h2>\n<p>TFC has undergone significant updates since its launch, including a redesigned user interface, a controlled remote state access feature, and workflow visibility and extensibility improvements.</p>\n<p>This year alone, we’ve added:</p>\n<ul>\n<li>The beta release of <a href=\"https://www.hashicorp.com/blog/terraform-cloud-run-tasks-beta-now-available\">Terraform Cloud run tasks</a>, designed to let users integrate third-party tools into the pre-apply stage of a Terraform Cloud run.</li>\n<li>A <a href=\"https://www.hashicorp.com/blog/new-workspace-overview-for-terraform-cloud\">new workspace Overview page for HashiCorp Terraform Cloud</a> that provides a quick and easy-to-reference panel for all the important details in each of your workspaces.</li>\n<li><a href=\"https://www.hashicorp.com/blog/new-workspace-tags-for-terraform-cloud\">New workspace tags for HashiCorp Terraform Cloud</a> that give you a quick and easy new way to search and filter workspaces based on tags.</li>\n<li>A <a href=\"https://www.hashicorp.com/blog/new-apply-user-interface-for-terraform-cloud\">redesigned Apply user interface for Terraform Cloud</a> that brings clarity to how your resources, state, and infrastructure operations are represented during a Terraform run.</li>\n<li>General availability of compliance-driven network infrastructure automation with <a href=\"https://www.hashicorp.com/blog/announcing-consul-terraform-sync-0-4-for-terraform-cloud\">Consul-Terraform-Sync 0.4 for HashiCorp Terraform Cloud</a>.</li>\n</ul>\n<h2><a href=\"#the-hashicorp-terraform-cloud-ecosystem\">»</a><a></a>The HashiCorp Terraform Cloud Ecosystem</h2>\n<p>Just as important, we’ve worked hard to create a robust ecosystem of Terraform Cloud integrations, and we’re thrilled that these efforts are being recognized. Terraform Cloud integrations are designed to help end-user organizations more easily solve integration problems and seamlessly adopt common workflows.</p>\n<p>As announced at the <a href=\"https://www.hashicorp.com/blog/hashicorp-vault-surpasses-100-integrations-with-75-partners\">HashiConf Partner Summit</a> in October, currently HashiCorp has more than 170<a href=\"https://registry.terraform.io/\"> technology partners</a> with more than 300 verified integrations. Terraform Cloud brings flexibility to the Terraform workflow through integrations with a wide variety of open source integrations, including the Terraform Cloud Operator for Kubernetes, which lets operators provision infrastructure internal or external to the Kubernetes cluster directly from the Kubernetes control plane; many enterprise integrations with well-known solutions from such vendors as Cisco, DataDog, GitHub, Okta, and ServiceNow, as well as integrations with leading-edge technologies like BridgeCrew’s and Snyk’s.</p>\n<h2><a href=\"#learn-more\">»</a><a></a>Learn More</h2>\n<p>The Tech Innovator Awards will be featured in the December 2021 issue of CRN and can be viewed online at<a href=\"http://www.crn.com/techinnovators\"> crn.com/techinnovators</a>. HashiCorp reseller partners who would like to learn more should visit the <a href=\"https://www.hashicorp.com/partners\">HashiCorp Partner Portal</a>. Cloud engineers who would like to try Terraform Cloud should visit <a href=\"https://learn.hashicorp.com/tutorials/terraform/cloud-sign-up\">HashiCorp Learn — Terraform Cloud.</a></p>","author":"Michelle Graff","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"424048c84bdb91060e002c09f03e00411c3f31d0cbfda54d47cb6efa3a9b6686","category":"Tech"}