{"title":"Book authors sue OpenAI and Meta over text used to train AI","link":"https://arstechnica.com/?p=1952424","date":1689018179000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-1475417987-800x602.jpg\" alt=\"Comedian and author Sarah Silverman.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-1475417987.jpg\">Enlarge</a> <span>/</span> Comedian and author Sarah Silverman. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/comedian-sarah-silverman-performs-at-the-ryman-auditorium-news-photo/1475417987\">Jason Kempin / Staff | Getty Images North America</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div>\n<p>On Friday, the Joseph Saveri Law Firm filed US federal<span> </span><a href=\"https://llmlitigation.com/\">class-action lawsuits</a><span> </span>on behalf of Sarah Silverman and other authors against OpenAI and Meta, accusing the companies of illegally using copyrighted material to train AI language models such as<span> </span><a href=\"https://arstechnica.com/information-technology/2022/12/openai-invites-everyone-to-test-new-ai-powered-chatbot-with-amusing-results/\">ChatGPT</a><span> </span>and<span> </span><a href=\"https://arstechnica.com/information-technology/2023/02/chatgpt-on-your-pc-meta-unveils-new-ai-model-that-can-run-on-a-single-gpu/\">LLaMA</a>.</p>\n</div>\n<div>\n<p>Other authors represented include Christopher Golden and Richard Kadrey, and an earlier class-action <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.414822/gov.uscourts.cand.414822.1.0_1.pdf\">lawsuit</a> filed by the same firm on June 28 included authors Paul Tremblay and Mona Awad. Each lawsuit alleges violations of the Digital Millennium Copyright Act, unfair competition laws, and negligence.</p>\n</div>\n<div>\n<p>The Joseph Saveri Law Firm is no stranger to press-friendly legal action against generative AI. In November 2022, the same firm<span> </span><a href=\"https://githubcopilotlitigation.com/\">filed suit</a><span> </span>over GitHub Copilot for alleged copyright violations. In January 2023, the same legal group<span> </span><a href=\"https://stablediffusionlitigation.com/\">repeated that formula</a><span> </span>with a class-action lawsuit against Stability AI, Midjourney, and DeviantArt over AI image generators. The GitHub lawsuit was terminated in December 2022 when a<span> </span><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Doe-v-Github-et-al-12-15-22-Order.pdf\">court order</a><span> </span>shows that plaintiffs stopped responding. Procedural maneuvering in the Stable Diffusion lawsuit is still underway with<span> </span><a href=\"https://www.courtlistener.com/docket/66732129/andersen-v-stability-ai-ltd/\">no clear outcome</a><span> </span>yet.</p>\n</div>\n<div>\n<p>In a <a href=\"https://llmlitigation.com/\">press release</a> last month, the law firm described ChatGPT and LLaMA as \"industrial-strength plagiarists that violate the rights of book authors.\" Authors and publishers have been reaching out to the law firm since March 2023, lawyers Joseph Saveri and Matthew Butterick wrote, because authors \"are concerned\" about these AI tools' \"uncanny ability to generate text similar to that found in copyrighted textual materials, including thousands of books.\"</p>\n</div>\n<div>\n<p>The most recent lawsuits from Silverman, Golden, and Kadrey were filed in a US district court in San Francisco. Authors have demanded jury trials in each case and are seeking permanent injunctive relief that could force Meta and OpenAI to make changes to their AI tools.</p>\n</div>\n<div>\n<p>Meta declined Ars' request to comment. OpenAI did not immediately respond to Ars' request to comment.</p>\n</div>\n<div>\n<p>A spokesperson for the Saveri Law Firm sent Ars a statement, saying, \"If this alleged behavior is allowed to continue, these models will eventually replace the authors whose stolen works power these AI products with whom they are competing. This novel suit represents a larger fight for preserving ownership rights for all artists and other creators.\"</p>\n</div>\n<div>\n<h2>Accused of using “flagrantly illegal” datasets</h2>\n</div>\n<div>\n<p>Neither Meta nor OpenAI has fully disclosed what's in the datasets used to train LLaMA and ChatGPT. But lawyers for authors suing say they have deduced the likely data sources from clues in statements and papers released by the companies or related researchers. Authors have accused both OpenAI and Meta of using training datasets that contained copyrighted materials distributed without authors' or publishers' consent, including by downloading works from some of the largest e-book pirate sites.</p>\n</div>\n<div>\n<p>In the <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Silverman-v-OpenAI-7-7-2023-Complaint.pdf\">OpenAI lawsuit</a>, authors alleged that based on OpenAI disclosures, ChatGPT appeared to have been trained on 294,000 books allegedly downloaded from \"notorious 'shadow library' websites like Library Genesis (aka LibGen), Z-Library (aka Bok), Sci-Hub, and Bibliotik.\" Meta has disclosed that LLaMA was trained on part of a dataset called ThePile, which the <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Kadrey-v-Meta-7-7-2023-Complaint.pdf\">other lawsuit alleged</a> includes “all of Bibliotik,” and amounts to 196,640 books.</p>\n</div>\n<div>\n<p>On top of allegedly accessing copyrighted works through shadow libraries, OpenAI is also accused of using a \"controversial dataset\" called BookCorpus.</p>\n</div>\n<div>\n<p>BookCorpus, the OpenAI lawsuit said, \"was assembled in 2015 by a team of AI researchers for the purpose of training language models.\" This research team allegedly \"copied the books from a website called Smashwords that hosts self-published novels, that are available to readers at no cost.\" These novels, however, are still under copyright and allegedly \"were copied into the BookCorpus dataset without consent, credit, or compensation to the authors.\"</p>\n</div>\n<div>\n<p>Ars could not immediately reach the BookCorpus researchers or Smashwords for comment.</p>\n</div>\n<div><a name=\"page-2\"></a></div>\n<div>\n<h2>“Numerous questions of law” raised</h2>\n</div>\n<div>\n<p>Authors claim that by utilizing \"flagrantly illegal\" datasets, OpenAI allegedly infringed copyrights of Silverman's book <i>The Bedwetter</i>, Golden’s <i>Ararat</i>, and Kadrey’s <i>Sandman Slime</i>. And Meta allegedly infringed copyrights of the same three books, as well as \"several\" other titles from Golden and Kadrey.</p>\n</div>\n<div>\n<p>It seems obvious to authors that their books were used to train ChatGPT and LLaMA because the tools \"can accurately summarize a certain copyrighted book.\" Although sometimes ChatGPT gets some details wrong, its summaries are otherwise very accurate, and this suggests that \"ChatGPT retains knowledge of particular works in the training dataset and is able to output similar textual content,\" authors alleged.</p>\n</div>\n<div>\n<p>It also seems obvious to authors that OpenAI and Meta knew that their models were \"ingesting\" copyrighted materials because all the copyright-management information (CMI) appears to have been \"intentionally removed,\" authors alleged. That means that ChatGPT never responds to a request for a summary by citing who has the copyright, allowing OpenAI to \"unfairly profit from and take credit for developing a commercial product based on unattributed reproductions of those stolen writing and ideas.\"</p>\n</div>\n<div>\n<p>\"OpenAI knew or had reasonable grounds to know that this removal of CMI would facilitate copyright infringement by concealing the fact that every output from the OpenAI Language Models is an infringing derivative work, synthesized entirely from expressive information found in the training data,\" the OpenAI complaint said.</p>\n</div>\n<div>\n<p>Among \"numerous questions of law\" raised in these complaints was a particularly prickly question: Is ChatGPT or LLaMA itself an infringing derivative work based on perhaps thousands of authors' works?</p>\n</div>\n<div>\n<p>Authors are already upset that companies seem to be unfairly profiting off their copyrighted materials, and the Meta lawsuit noted that any unfair profits currently gained could further balloon, as \"Meta plans to make the next version of LLaMA commercially available.\" In addition to other damages, authors are asking for restitution of alleged profits lost.</p>\n</div>\n<div>\n<p>\"Much of the material in the training datasets used by OpenAI and Meta comes from copyrighted works—including books written by plain­tiffs—that were copied by OpenAI and Meta without consent, without credit, and without compensation,\" Saveri and Butterick wrote in their press release.</p>\n</div>\n\n</div><p><a href=\"https://arstechnica.com/?p=1952424\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1952424&amp;comments=1\">Comments</a></p>","author":"Ashley Belanger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"424347a8047fb1125c6853f5d9beb4ccd1317c0ef60cb4003f9d354b6d566c68","category":"Tech"}