{"title":"LG Looking to Shut Down Smartphone Business After Failing to Find a Buyer","link":"https://www.macrumors.com/2021/03/22/lg-looking-to-shut-down-smartphone-business/","date":1616421881000,"content":"LG is looking to close down its entire smartphone division after failing to find a buyer for the ailing section of its business, according to the <a href=\"http://www.koreaherald.com/view.php?ud=20210322000785&np=1&mp=1\"><em>Korea Herald</em></a>.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/LG-Rollable.jpg\" alt=\"\" width=\"1280\" height=\"637\" class=\"aligncenter size-full wp-image-790149\" />\r\n<br/>\r\nIn January, LG announced that it was <a href=\"https://www.macrumors.com/2021/01/20/lg-considering-smartphone-business-exit/\">considering options for an exit from the smartphone industry</a>, \"including sale, withdrawal and downsizing.\" Though LG was once the world's third-largest smartphone maker and a sizeable competitor to Apple in the industry, the company's smartphone business has seen declining shipments and accrued losses of &#36;4.5 billion over the past five years, leading to the need for an urgent re-evaluation of the division.\r\n<br/>\r\n\r\n<br/>\r\nLG reportedly entered talks with Vietnam's Vingroup and automaker Volkswagen about purchasing the company's smartphone business, but negotiations did not lead to an agreement. Although the decision has yet to be confirmed, industry insiders report that LG is now likely to shut down its smartphone business instead of selling it. A source speaking to the <em>Korea Herald</em> explained:<blockquote>LG reportedly had talks with others over the sale of the unit but apparently there was not much progress in their negotiations. It seems that selling its entire mobile business appears to be difficult at this moment, as is the partial sale of the unit.</blockquote>With LG's internal restructuring plan now reaching its conclusion and no buyer having been found, the company is said to be leaning toward cutting its losses by closing the smartphone division fully.\r\n<br/>\r\n\r\n<br/>\r\nLG's <a href=\"https://www.macrumors.com/2021/01/12/lg-teases-first-rollable-smartphone-ces/\">recently announced</a> smartphone projects, such as \"Rainbow\" and \"Rollable,\" are believed to have been scrapped, as the company looks to utilize its existing mobile workforce elsewhere in the business, such as the vehicle component solutions division. \r\n<br/>\r\n\r\n<br/>\r\nLG is expected to publicize the decision about its smartphone business unit next month after a board meeting.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/lg/\">LG</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/22/lg-looking-to-shut-down-smartphone-business/\">LG Looking to Shut Down Smartphone Business After Failing to Find a Buyer</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/lg-looking-to-shut-down-smartphone-business-after-failing-to-find-a-buyer.2289203/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Z_qRFtk6vBA:ANoqestgMDE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Z_qRFtk6vBA:ANoqestgMDE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/Z_qRFtk6vBA\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"42439cb05b376f408eeeacc2990337e2a0b72c9660eb6f21d83fce858355b81c","category":"Apple"}