{"title":"PSVI-10 Effects of dietary supplementation of purslane (Portulaca oleraceae), prebiotics, and probiotics on breast meat quality of broilers","link":"https://academic.oup.com/jas/article/102/Supplement_3/529/7757556?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Antibiotic growth promoters (AGPs) used in animal production are considered one of the major causes of antibiotic resistance. Dietary supplements such as pre- and pro-biotics have been known for gut health and immune response improvement and proposed as alternatives to AGPs. Purslane (<span>Portulaca oleraceae</span>) is a leafy vegetable containing increased concentrations of omega-3 fatty acids and antioxidants, making it a potential dietary supplement for poultry. This study aimed to determine the effect of dietary supplementations of purslane, prebiotic, and probiotic alone and in combination on broiler breast meat quality. Broiler chicks (n = 350 Ross 708; 1-d of age) were randomly assigned to 35 pens (7 pens/treatment, 5 male and female birds/pen). Birds were raised for 40 d and fed 1 of 5 dietary treatments: 1) negative control (NC), a corn/soybean basal diet, 2) T1, NC with 2.5% purslane, 3) T2, T1 with prebiotic (mannan-oligosaccharides) at 2 kg/tonne, 4) T3, T1 with probiotic (<span>Bacillus subtilis</span> DSM 32315), or 5) T4, T1 with prebiotic and probiotic. At d 41, 2 males and 2 females/pen were slaughtered, and breast meat was harvested 24 h postmortem. Meat quality parameters, including pH, color, protein solubility, functional properties (drip loss, water holding capacity, marinade uptake, and cooking yield), textural properties, lipid oxidation, and fatty acids profiles in breast meat were determined. Data were analyzed using two-way ANOVA with Duncan’s multiple range test for mean comparison. Because of no interactions between treatment and sex, the main effects were evaluated. No significant differences were found between breast meat from NC-fed and treatment-fed broilers in most meat quality parameters, except for marinade uptake, lipid oxidation, and fatty acid profiles. Marinade uptakes of meat from NC, T1, and T2-fed broilers were significantly greater than those from T3- and T4-fed (<span>P</span> &lt; 0.05). Lipid oxidation in cooked meat from treatment-fed broilers was significantly less than those from NC-fed (<span>P</span> &lt; 0.05) after 7 d of storage, probably due to antioxidants in purslane. The polyunsaturated fatty acid (PUFA) content in meat from T4-fed broilers was significantly greater than that of NC-fed (<span>P</span> &lt; 0.05), suggesting that pro-/pre-biotics could promote the absorption of omega-3 fatty acids from purslane. Breast meat from female broilers did not show any differences from those from male broilers in color, lipid oxidation, fatty acid profiles, and texture, except for shear force and energy. Functional properties and shear force and energy of breast meat from female broilers were significantly greater than those from male broilers (<span>P</span> &lt; 0.05), probably due to its higher pH and protein solubility (<span>P</span> &lt; 0.05). These results suggested that the dietary supplementation of purslane, pre-, and pro-biotics in combination can enhance oxidative stability and fatty acid profiles of breast meat of broilers in addition to their potential impacts on broiler health and productivity.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4246e1fbaafae051054995c05b4c792c211ecb4a738d01169fc549dde3ac3297","category":"Environment"}