{"title":"Population genetics of the freshwater red alga Batrachospermum gelatinosum (Rhodophyta) II: Phylogeographic analyses reveal spatial genetic structure among and within five major drainage basins in eastern North America","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13512?af=R","date":1729525997000,"content":"<h2>Abstract</h2>\n<p>The freshwater red alga <i>Batrachospermum gelatinosum</i> has a well-documented distribution spanning historically glaciated and unglaciated eastern North America. This alga has no known desiccation-resistant propagule; thus, long-distance dispersal events are likely rare. We predicted strong genetic structure among drainage basins and admixture among sites within basins. We predicted greater genetic diversity at lower latitude sites because they likely serve as refugia and the origin of northward, post-Pleistocene range expansion. We used 10 microsatellite loci to investigate genetic diversity from 311 gametophytes from 18 sites in five major drainage basins: South Atlantic Gulf, Mid-Atlantic, Ohio River, Great Lakes, and Northeast. Our data showed strong genetic partitioning among drainage basins and among sites within basins, yet no isolation by distance was detected. Genetic diversity varied widely among sites and was not strictly related to latitude as predicted. The results from <i>B. gelatinosum</i> provide strong support that each stream site contributes to the unique genetic variation within the species, potentially due to limited dispersal and the prevailing reproductive mode of intragametophytic selfing. Simulations of migration suggested post-Pleistocene dispersal from the Mid-Atlantic. <i>Batrachospermum gelatinosum</i> potentially persisted in refugia that were just south of the ice margins rather than in the southernmost part of its range. Research of other taxa with similar ranges could determine whether these results are generally applicable for freshwater red algae. Nevertheless, these results from <i>B. gelatinosum</i> add to the growing literature focused on the patterns and genetic consequences of post-Pleistocene range expansion by eastern North American biota.</p>","author":"Roseanna M. Crowell, \nSarah J. Shainker‐Connelly, \nStacy A. Krueger‐Hadfield, \nMorgan L. Vis","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"424728d14ca8fd9d53914ef4e6898198cd493fbc277b94ec084db5c38aecc3ce","category":"Environment"}