{"title":"Everything Apple announced at its April 20 ‘Spring Loaded’ event","link":"https://www.macworld.com/article/343881/everything-apple-announced-at-its-april-20-spring-loaded-event.html","date":1618963643000,"content":"\n<div>\n<section><div></div></section><p>Apple just got done with its big ‘Spring Loaded’ event, and it was chock full of new products and announcements. You can <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/apple-events/&amp;subid1=1-1-343881-0-0-0\">watch the whole thing on Apple’s site</a>, but here’s a quick summary of what went down, with links to our coverage.</p>\n\n\n\n<h2>Apple Card updates</h2>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/apple-card-apple.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>Apple</p></div>\n\n\n\n<p>Apple started off its event by re-capping its commitment to the environment and making the company carbon neutral by 2030, but the first <em>real</em> announcement wasn’t a new product at all, it was an update to the Apple Card. Adult couples will be able to “co-own” an Apple Card, with both of them sharing a credit rating, and a new “Apple Card Family” feature will allow Apple Card owners to share their card with kids over 13, giving each one spending limits. Existing card users can also merge their accounts and combine their spending limits.</p>\n\n\n\n<h2>Podcast Subscriptions</h2>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/podcast-app-spring-loaded.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>Apple</p></div>\n\n\n\n<p>Apple isn’t charging a monthly fee for <a href=\"https://www.macworld.com/article/343771/apple-introduces-podcasts-subscriptions-new-features-in-podcasts-app.html\">Podcast Subscriptions</a>; this isn’t Apple Podcasts+. Instead, this new program allows podcast creators to create “premium subscriptions” to their podcasts and set their own price. Subscribers can get custom content or early access, and Apple takes its customary 30% revenue cut (dropping to 15% the second year and beyond).  There’s a big update to the Podcasts app, too. It all comes in iOS 14.5, iPadOS 14.5, and macOS 11.3.</p>\n\n\n\n<h2>A purple iPhone 12</h2>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/04/phone-12-purple-3.png?w=1024\" /></figure><p>Apple</p></div>\n\n\n\n<p>It’s an <a href=\"https://www.macworld.com/article/343756/apple-launches-a-surprise-new-iphone-12-color.html\">iPhone 12…only it’s purple</a>!  That’s it. It goes on sale Friday, April 23 and ships on Friday, April 30.</p>\n\n\n\n<h2>AirTags</h2>\n\n\n\n<figure><div>\n\n</div></figure><p>It took only took a few <em>years</em>, but Apple finally announced those rumored item trackers. AirTags work with Bluetooth and the U1 chip and cost a pretty reasonable $29 (or $99 for a four-pack). And get this—they’re IP67 water and dust resistant and have user-replaceable batteries using standard CR2032 coin cells!</p>\n\n\n\n<h2>A new Apple TV 4K</h2>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/apple-tv-siri-remote.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>Apple</p></div>\n\n\n\n<p>Out with the old Apple TV 4K, in with the <a href=\"https://www.macworld.com/article/343779/the-new-apple-tv-4k-is-all-about-the-redesigned-siri-remote.html\">new Apple TV 4K</a>. The new model has an A12 Bionic processor, supports 120Hz output (if your TV supports that), and most importantly, includes a new Siri Remote that looks like it will be a <em>lot</em> more user-friendly. You can even <a href=\"https://www.macworld.com/article/343858/you-can-upgrade-your-siri-remote-without-buying-a-new-apple-tv.html\">buy it alone for $59</a> if you want one for your existing Apple TV. The new Apple TV 4K keeps the same pricing as the one it replaces: $179 for 32GB and $199 for 64GB.</p>\n\n\n\n<h2>All-new iMacs</h2>\n\n\n\n<figure><div>\n\n</div></figure><p>Perhaps the most important new product at the event was the introduction of <a href=\"https://www.macworld.com/article/343752/apple-imac-m1-processor-colors-specs-design-display-keyboard-touch-id-camera-price.html\">new 24-inch iMacs</a>. They come in a variety of colors, are powered by the M1 chip, and have new displays, speakers, microphone arrays, and a totally new higher-quality 1080p webcam. All but the base model come with new color-matched wireless Magic Keyboards that include a Touch ID sensor and color-matched mice or trackpads, too.</p>\n\n\n\n<h2>New iPad Pros</h2>\n\n\n\n<figure><div>\n\n</div></figure><p>The <a href=\"https://www.macworld.com/article/343706/ipad-pro-2021-faq-price-specs-features-release-date.html\">new iPad Pros</a> (we steadfastly refuse to call them “iPads Pro”) are a big step up from last year’s models. They’re powered by the M1 as well (which was always exactly what we expected an M14X to be). Cellular models now have 5G, and the front camera got upgraded to a 12MP Ultra Wide camera, which enables a new feature called Center Stage that follows you around the room while you FaceTime someone. The 12.9-inch model is a $100 more expensive now (and even more with new configurations) but comes with a Liquid Retina XDR display that uses thousands of mini-LED backlights to enable brighter beak brightness, higher contrast, and full HDR support.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"424922c910a3575a5cd2226547f3b0fa29458381ba1988ce91654f049a001c90","category":"Apple"}