{"title":"Drivers of enhanced evaporative demand in U.S. croplands: Determining relative contribution using constrained input scenarios","link":"https://onlinelibrary.wiley.com/doi/10.1111/1752-1688.13156?af=R","date":1708274038000,"content":"<h2>Abstract</h2>\n<p>Altered evaporative demand is a global phenomenon observed over recent decades, however, such change has not been attributed explicitly to specific meteorological drivers, hampering consensus on what has caused such change. Here we investigate exactly how much individual drivers have contributed to long-term grass-reference evapotranspiration (ET<sub>o</sub>) change within conterminous United States (CONUS), with an emphasis on agricultural croplands. Using scenarios that constrain individual drivers i.e., air temperatures (<i>T</i>), relative humidity (RH), solar radiation (<i>R</i>\n<sub>s</sub>), and wind speeds (<i>U</i>\n<sub>2</sub>) to their climatologies, we determined their relative contribution toward ET<sub>o</sub> change at monthly and annual scales. Annual ET<sub>o</sub> increased by 111 mm, or &gt;2 standard deviations (SD) relative to the 1981–2000 baseline, accompanied by strong increase in <i>R</i>\n<sub>s</sub> (2.7 SD), <i>U</i>\n<sub>2</sub> (2.5 SD), <i>T</i> (1.1 SD), and decreased RH (2.3 SD) in regions that account for one-third of calories produced in the U.S. Annual ET<sub>o</sub> increase was attributed primarily to <i>T</i> (relative contribution of 36%), followed by <i>R</i>\n<sub>s</sub> (29%), <i>U</i>\n<sub>2</sub> (18%), and RH (17%) with significant spatial and seasonal variability. During agriculturally critical summer months, <i>R</i>\n<sub>s</sub> was the dominant driver with a 40%–50% relative contribution, and other three drivers were roughly equally important. These findings address demand-side of agricultural water use and imply long-term change in crop functions and performance, water security, and planning across aridity gradients.</p>","author":"M. S. Kukal, \nS. Kukal, \nS. Irmak, \nG. Vellidis","siteTitle":"Wiley: JAWRA Journal of the American Water Resources Association: Table of Contents","siteHash":"b7070794a350c180e68e2251d6fc4f4ad5be669c5d24d82d3d55b25b0dce7a23","entryHash":"424a3852c9a3eea339866f72a7f9ee0798b05829eb4e88dc0d328780773a8c04","category":"Environment"}