{"title":"Growth performance and carcass characteristics of bulls fed tannins associated or not with monensin","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae136/7762464?rss=1","date":1726790400000,"content":"<span><div>Abstract</div>This study aimed to evaluate the effect of tannin (a mix of hydrolyzable and condensed) and its association with monensin on feed efficiency, growth performance, and carcass of bulls fed high-grain diets with 14% and 13% crude protein (<strong>CP</strong>). Bulls (64 Nellore and 96 crossbred Angus × Nellore; initial body weight (<strong>BW</strong>) = 342 ± 25 kg; 20 ± 1 months) were allocated into 20 pens (8 from the same breed per pen). The treatments were T14 – 1.5 g of tannin/kg of dry matter (<strong>DM</strong>) (Bypro; Silva Team Brasil, Estância Velha, Brazil) in a diet with 14% of CP; M14 – 25 ppm monensin (Rumensin; Elanco Saúde Animal, São Paulo, Brazil) in a diet with 14% of CP; TM14 – 1.5 g of tannin/kg of DM and 25 ppm monensin in a diet with 14% of CP; TM13 – 1.5 g of tannin/kg of DM and 25 ppm monensin in a diet with 13% of CP. Data were analyzed using a randomized block design with pens as experimental units. Supplementation with tannin resulted in greater final BW, average daily gain (<strong>ADG</strong>), and dry matter intake (<strong>DMI</strong>) compared with Monensin (<span>P</span> &lt; 0.05). The association between Tannin and Monensin decreased (<span>P</span> &lt; 0.05) DMI without affecting growth performance, consequently improving the gain-to-feed ratio compared to the Tannin-alone treatment. When Tannin was combined with Monensin, there was an increase (<span>P</span> &lt; 0.05) in net energy for gain and net energy for maintenance compared with Tannin supplementation alone. Bulls supplemented with Tannin in their diet exhibited greater (<span>P</span> &lt; 0.05) hot carcass weight, carcass gain, and gluteus medius area compared with those supplemented with Monensin alone. Final BW, ADG, and DMI were lower (<span>P</span> &lt; 0.05) when the CP content of the diet was decreased from 14% to 13%. The optimal combination for achieving maximum growth and feed efficiency was observed when bulls were fed with tannin and monensin combined in a diet containing 14% CP.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"424f805e6105bb2e3ebe1e3d13b154c85a88c67e89f899f2b19b41924a79eb62","category":"Environment"}