{"title":"Four team pursuit world records broken in one day at the Tokyo Olympics","link":"https://cyclingtips.com/2021/08/team-gb-has-set-a-new-womens-team-pursuit-world-record/","date":1627973968000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/CORVOS_00033365-020-650x433.jpeg\" /></div><h2>Four team pursuit world records broken in one day at the Tokyo Olympics</h2><p>\n</p><p>The women’s team pursuit world record has been broken three times in one session at the Tokyo Olympics.</p>\n\n\n\n<p>In a tight first-round tussle against Team USA on Tuesday afternoon, Great Britain’s women’s team posted a time of 4:06.748 for the 4,000-metre event, more than half a second faster than <a href=\"https://cyclingtips.com/2021/08/germany-smashes-team-pursuit-world-record-in-olympic-qualifying/\" target=\"_blank\">the 4:07.307 set by Germany in qualifying a day earlier</a>. Mere minutes later, in its first-round race against Italy, Germany took back the record with a 4:06.166, another half-second faster than Team GB’s time.</p>\n\n\n\n<p>Later in the evening the two record-breaking teams squared off in the gold-medal race. There, the German quartet of Franziska Brauße, Lisa Brennauer, Lisa Klein, and Mieke Kröger lowered the world record yet again, posting a scorching time of 4:04.242 – almost two seconds faster than their first round record from just a few hours earlier. That time was easily enough to take the gold medal ahead of Great Britain. In the bronze-medal race, Team USA beat Canada with a time of 4:08.040.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/CORVOS_00033365-041-1340x894.jpeg\" /><figcaption>Gold for Germany after a super-impressive team pursuit campaign.</figcaption></figure>\n\n\n\n<p>Coming into the Tokyo Olympics the women’s team pursuit record sat at 4:10.236, posted by Team GB at the 2016 Rio Olympics. By the end of the team pursuit competition in Tokyo, that record was six seconds faster, with Germany having set a new mark in all three of its races, and Team GB having done so once.</p>\n\n\n\n<p>The men’s team pursuit world record was also broken on Tuesday with a Filippo Ganna-led Italy posting a blistering 3:42.307 – more than two seconds faster than the previous mark set by Denmark at the 2020 Track World Championships in Berlin.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/CORVOS_00033365-025-1340x825.jpeg\" /><figcaption>Italy en route to breaking the men’s team pursuit world record.</figcaption></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/08/team-gb-has-set-a-new-womens-team-pursuit-world-record/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4250feee9165f4b1f4a279048c239c354f05128dfda9f280cf46e6e6a607747b","category":"Cycling"}