{"title":"Microbiological Criteria for Ensuring the Safety of Mustard","link":"https://www.preprints.org/manuscript/202407.0767/v1","date":1720605622000,"content":"Mustard, a widely used condiment, is derived from mustard seeds and partially defatted mustard flour. Varieties of mustard are primarily distinguished by the ratios of mustard seeds and spices used in their production. This study assessed the microbiological safety of mustard products from the Mustard and Ketchup Factory in Poland, produced between 2019-2021, in compliance with Polish and EU regulations. Three mustard types were analyzed: gourmet, creamy, and spicy, crafted from 'Borowska' white mustard and 'Małopolska' Sarepta mustard seeds. The preparation included powdered mustard seeds, water, sugar, and vinegar. Samples of mustards (20 g each) were tested in triplicate for Salmonella, spore-forming anaerobic bacteria, coliform bacteria, Staphylococcus aureus, mold, and yeast. Additionally, water and spices used in production were analyzed for total coliforms, Escherichia coli, Enterococcus, Salmonella, aerobic mesophilic microorganisms, anaerobic spore-forming bacteria, and mold. Results indicated that spices and water met all microbiological criteria. Mustard samples tested negative for Salmonella and anaerobic spore-forming bacteria, with coliforms, Staphylococcus aureus, mold, and yeast counts within acceptable limits, ensuring compliance with food safety and hygiene standards. This research underscores the importance of ongoing monitoring and strict microbiological standards to maintain food safety. Future studies should develop advanced microbial detection methods and implement robust quality control measures to reduce contamination risks in mustard and other food products.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"42559dec5767ea80038a12f86e17b43d23669dfc670a1c0a8d2a2d49c8179fcd","category":"Interdisciplinary"}