{"title":"Respiratory and muscular effort during pre-slaughter stress affect Nile tilapia fillet quality","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306880","date":1720792800000,"content":"<p>by Silvia Prestes dos Santos, Maria Ildilene da Silva, Antonio Cesar Godoy, David Geovanni De Almeida Banhara, Marcio Douglas Goes, Elenice Souza dos Reis Goes, Claucia A. Honorato</p>\r\n\r\nNile Tilapia (<i>Oreochromis niloticus</i>) management procedures are directly linked to the final quality of the product. The aim of this study was to evaluate the effect of pre-slaughter density and different stunning methods on biochemical, respiratory and muscle injury parameters associated with quality and sensory characteristics of Nile tilapia fillets. Fish with an average weight of 762±105 g were used, first collected called the control group. The experiment was conducted in a 2 × 2 factorial scheme, with two densities (50 and 300 kg of live weight m<sup>−3</sup>) and two stunning methods thus totaling four treatments, with 15 repetitions per treatment totaling 75 fish sampled. Blood gas analysis, evaluation of biochemical parameters, analysis of meat quality and sensory analysis were carried out. For blood gas, biochemical and enzymatic parameters, the highest values were obtained for the density of 300 kg m<sup>−3</sup> and asphyxia method: partial pressures of CO2; glucose and lactate, the highest values presented were 268.98 and 11.33 mg dL<sup>−1</sup> respectively. As well as enzymatic activities, Creatinine kinase (CPK); Creatinine kinase isoenzyme (CKMB) showed higher values (768.93 and 1078.98 mg dL<sup>−1</sup> respectively) in the higher density and asphyxia method. Conversely, when evaluating the quality parameters, the highest values were observed for lower density and thermonarcosis. High depuration density (300 kg m<sup>−3</sup>), combined with the asphyxiation stunning method, promotes changes in respiratory dynamics and provides greater stress, less firm fillet texture and greater weight loss due to cooking, as well as changes in creatine kinase (CK) and its CK-MB isoenzyme, demonstrating greater muscle damage. On the other hand, the density of 50 kg m<sup>−3</sup> during pre-slaughter, combined with the method of stunning by thermonarcosis, provide a longer period of permanence in pre rigor mortis, which will result in fillets with a better sensory profile.","author":"Silvia Prestes dos Santos","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"425a30d44b2b86b82ea0bfc9bfcb9b86f4925bb02f6b71558eda088589a39b38","category":"Interdisciplinary"}