{"title":"Capcom เผยกำไรต่อเนื่อง 11 ปี Street Fighter VI ขายดี ส่วนแฟรนไชส์ Resident Evil ยอดขายทะลุ 150 ล้านชุด","link":"https://www.blognone.com/node/136422","date":1698318221000,"content":"<div><div><div><p>Capcom บริษัทเกมญี่ปุ่นชื่อดังเผยว่าบริษัทมียอดขายและผลกำไรเพิ่มขึ้นอย่างมาก โดยนับยอดขายตั้งแต่ 1 เมษายน จนถึงวันที่ 30 กันยาน 2023 มียอดขายซอฟต์แวร์รวมในช่วงครึ่งปีแรกอยู่ที่ 22.6 ล้านชุด เพิ่มขึ้นจากปีก่อนที่ทำได้ 21.3 ล้านชุด โดย Capcom กล่าวว่ายอดขายเกมแบบดิจิทัลมีความแข็งแกร่งเป็นพิเศษ</p>\n<p>เกมที่ขายดีที่สุดของ Capcom ในช่วง 6 เดือนแรกคือ Street Fighter VI มียอดทะลุ 2.47 ล้านชุดนับตั้งแต่เปิดตัวเมื่อต้นเดือนมิถุนายน ส่วน Resident Evil 4 Remake ขายได้เพิ่มอีก 1.66 ล้านชุด รวมแล้วเป็น 5.45 ล้านชุด ทำให้ Resident Evil เป็นแฟรนไชส์ที่มียอดขายสูงสุดตลอดกาลของ Capcom มียอดขายทั้งแฟรนไชส์ทะลุ 150 ล้านชุดแล้ว</p>\n<p>ด้านเกม IP ใหม่อย่าง Exoprimal ที่วางขายในเดือนกรกฎาคมลงทั้ง PC, Xbox และ PlayStation กลับขายได้น้อยกว่า 940,000 ชุด โดยตัวเกมเปิดให้เล่นใน Game Pass ตั้งแต่วันแรก และเคยมีผู้เล่นทะลุ 1 ล้านคนในช่วงเดือนแรกของการวางจำหน่าย</p>\n<p>ในช่วงระยะเวลา 6 เดือนที่ผ่านมา Capcom กล่าวว่าบริษัทมียอดขายสุทธิเพิ่มขึ้น 52.7% เมื่อเทียบกับช่วงเดียวกันของปีที่แล้วคิดเป็นรายได้ 74,934 ล้านเยน, รายได้จากการดำเนินงานเพิ่มขึ้น 54.5% เป็น 33,835 ล้านเยน, รายได้ทั่วไปเพิ่มขึ้น 57.3% เป็น 36,164 ล้านเยน และกำไรสุทธิเพิ่มขึ้น 56.7 % เป็น 25,287 ล้านเยน</p>\n<p>Capcom กล่าวว่าผลประกอบการของบริษัทเป็นไปตามที่คาดการณ์รายได้แบบรายปี ควบคู่ไปกับการเติบโตของกำไรที่ดำเนินติดต่อกันเป็นเวลา 11 ปี</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/8456e2ab4478ed29eac4e79645b56324.png\" /></p>\n<p>ที่มา - <a href=\"https://www.videogameschronicle.com/news/capcom-says-its-on-track-for-an-11th-straight-year-of-growth-after-strong-sales/\">Video Games Chronicle</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/capcom\">Capcom</a></div><div><a href=\"/topics/street-fighter\">Street Fighter</a></div><div><a href=\"/topics/resident-evil\">Resident Evil</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"425eb8f641541185f65fbe073650283bdd5a760d02156769ba3c689086d8d4c4","category":"Thai"}