{"title":"Cyclizine induces cytotoxicity and apoptosis in macrophages through the extrinsic and intrinsic apoptotic pathways","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24168?af=R","date":1713250800000,"content":"<h2>Abstract</h2>\n<p>Cyclizine, an over-the-counter and prescription antihistamine, finds widespread application in the prevention and treatment of motion sickness, encompassing symptoms such as nausea, vomiting, dizziness, along with its effectiveness in managing vertigo. However, the overuse or misuse of cyclizine may lead to hallucinations, confusion, tachycardia, and hypertension. The molecular mechanisms underlying cyclizine-induced cytotoxicity and apoptosis remain unclear. During the 24 h incubation duration, RAW264.7 macrophages were exposed to different concentrations of cyclizine. Cytotoxicity was assessed through the lactate dehydrogenase assay. Flow cytometry employing annexin V-fluorescein isothiocyanate and propidium iodide was utilized to evaluate apoptosis and necrosis. Caspase activity and mitochondrial dysfunction were evaluated through a fluorogenic substrate assay and JC-1 dye, respectively. Flow cytometry employing fluorogenic antibodies was utilized to evaluate the release of cytochrome c and expression of death receptor, including tumor necrosis factor-α receptor and Fas receptor. Western blotting was utilized to evaluate the expression of the Bcl2 and Bad apoptotic regulatory proteins. The findings unveiled from the present study demonstrated that cyclizine exerted a concentration-dependent effect on RAW264.7 macrophages, leading to the induction of cytotoxicity, apoptosis, and necrosis. This compound further activated the intrinsic apoptotic pathway by inducing mitochondrial dysfunction, Bcl2/Bad exchange expression, cytochrome c liberation, and activation of caspases contained caspase 3, 8, and 9. Moreover, the activation of the extrinsic apoptotic pathway was observed as cyclizine induced the upregulation of death receptors and increased caspase activities. Based on our investigations, it can be inferred that cyclizine prompts cytotoxicity and apoptosis in RAW264.7 macrophages in a concentration-dependent manner by triggering both the intrinsic and extrinsic apoptotic pathways.</p>","author":"Yin‐Che Lu, \nChen‐Yu Chiang, \nYu‐Wei Hsu, \nChun‐Jung Chen, \nWen‐Ying Chen, \nChing‐Chi Tseng, \nLie‐Hua Deng, \nShih‐Pin Chen, \nYu‐Hsiang Kuan","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"4268350f67538a1aa005b23695f87a37b580328bf4b788348f993e0a47113aad","category":"Environment"}