{"title":"Clinical and analytical validation of an 82-gene comprehensive genome-profiling panel for identifying and interpreting variants responsible for inherited retinal dystrophies","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305422","date":1718287200000,"content":"<p>by Jacqueline Chan, Jolyon Holdstock, John Shovelton, James Reid, Graham Speight, Duarte Molha, Venu Pullabhatla, Stephanie Carpenter, Ezam Uddin, Takanori Washio, Hiroko Sato, Yuuki Izumi, Reiko Watanabe, Hayato Niiro, Yoshiyuki Fukushima, Naoko Ashida, Takashi Hirose, Akiko Maeda</p>\r\n\r\nInherited retinal dystrophies comprise a clinically complex and heterogenous group of diseases characterized by visual impairment due to pathogenic variants of over 300 different genes. Accurately identifying the causative gene and associated variant is crucial for the definitive diagnosis and subsequent selection of precise treatments. Consequently, well-validated genetic tests are required in the clinical practice. Here, we report the analytical and clinical validation of a next-generation sequencing targeted gene panel, the PrismGuide IRD Panel System. This system enables comprehensive genome profiling of 82 genes related to inherited retinal dystrophies. The PrismGuide IRD Panel System demonstrated 100% (<i>n</i> = 43) concordance with Sanger sequencing in detecting single-nucleotide variants, small insertions, and small deletions in the target genes and also in assessing their zygosity. It also identified copy-number loss in four out of five cases. When assessing precision, we evaluated the reproducibility of variant detection with 2,160 variants in 144 replicates and found 100% agreement in terms of single-nucleotide variants (<i>n</i> = 1,584) and small insertions and deletions (<i>n</i> = 576). Furthermore, the PrismGuide IRD Panel System generated sufficient read depth for variant calls across the purine-rich and highly repetitive open-reading frame 15 region of <i>RPGR</i> and detected all five variants tested. These results show that the PrismGuide IRD Panel System can accurately and consistently detect single-nucleotide variants and small insertions and deletions. Thus, the PrismGuide IRD Panel System could serve as useful tool that is applicable in clinical practice for identifying the causative genes based on the detection and interpretation of variants in patients with inherited retinal dystrophies and can contribute to a precise molecular diagnosis and targeted treatments.","author":"Jacqueline Chan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"426bfe8884160f1fea93ee6eeb381e1c276049622012c69db7e13dd5df975ca2","category":"Interdisciplinary"}