{"title":"PSIX-21 Can seeds rich in polyunsaturated fatty acids reduce methane emissions when substituting palm oil on dairy beef calves fed high-concentrate diets? In vitro screening","link":"https://academic.oup.com/jas/article/102/Supplement_3/735/7757880?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The aim of this study was to evaluate the rumen in vitro methane (CH4) production of concentrates feed with a different protein source (PS) replacing partially palm oil by different seeds (SE) rich in polyunsaturated fatty acids (PUFA). Concentrate PS were: T1 = 8% soybean meal; and T2 = 15% dried distillers grain. Palm oil (CTR; 4% and 3.5% for T1 and T2, respectively) was partially substituted (1%) by flax seed (FL; 2.7%), canola seed (CO; 3%) or sunflower seed (SU; 2.3%), thus 8 concentrates were tested. Samples were ground at 1-mm and used in an in vitro digestibility assay. The rumen liquid was obtained at the slaughterhouse. Two incubation sets were done; two sampling points lasted 24 and 48 h to calculate the dry matter (DM) digestibility; a third sampling point lasted 12 d to monitor the CH4 production. Data were analyzed using a mixed effects model. Net volume of CH4 per degraded DM presented a PS effect (<span>P</span> &lt; 0.01); T1 produced greater net volume of CH4 per degraded DM than T2 (8.12 vs. 6.91 ± 0.330 ml/mg, respectively). Furthermore, net volume of CH4 per degraded DM presented a SE effect (<span>P</span> &lt; 0.01); all concentrates with seeds tested reduced the net volume of CH4 per degraded DM compared with CTR, and specifically CO produced lower net volume of CH4 per degraded DM than FL and SU (8.91, 7.47, 6.28, 7.39 ± 0.467 ml/mg; CTR, FL, CO, SU, respectively). In conclusion, the use of flax, canola, or sunflower seeds to partially substitute palm oil in concentrate feed, regardless of its PS, can be potential strategies to reduce rumen CH4 emissions, and seems that canola seed may be the most effective one.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"426bd30b4dea99ef790a00d3619d76405a4c27dd4fd35eddb2aebe55c5ca08f0","category":"Environment"}