{"title":"New survey: Nearly 30% of ESA workers experience workplace harassment","link":"https://arstechnica.com/?p=1990895","date":1702500671000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/60013-800x599.jpg\" alt=\"Image of the facade of a building with a curved corner, largely comprised of glass.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/60013-scaled.jpg\">Enlarge</a> <span>/</span> The ESA headquarters in Paris. (credit: <a href=\"https://photolibrary.esa.int/asset/?uuid=37499440-19b4-5ef0-8f5b-5cf65cd50000\">ESA - P. Sebirot</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>According to a new internal survey conducted by the European Space Agency’s (ESA) staff association, about 30 percent of ESA’s employees have either experienced or witnessed harassment in the workplace. The survey, published internally on December 6 and seen by Ars Technica, confirms the findings of our <a href=\"https://arstechnica.com/space/2023/11/contractors-accuse-european-space-agency-of-a-culture-of-harassment/\">recent investigation</a> into allegations of harassment and bullying at the agency.</p>\n<p>The internal survey ran from July 19 to September 15 of this year and collected the responses of 2,751 workers, representing nearly half of all ESA employees across its six main centers in France, Germany, the Netherlands, the UK, Spain, and Italy. The ESA staff association was set up by ESA to represent staff members, but the survey included both staff members and on-site contractors who are loaned to the agency through a network of cooperating manpower companies in Europe.</p>\n<p>Among the respondents, nearly a third said they had witnessed harassment during their time at the agency, while 28 percent said they had directly experienced it. The report states that a “complementary analysis of 1,200 comments” provided by the respondents suggests that about 20 percent of the ESA workers experienced harassment within the past 24 months. The types of harassment disclosed in the survey included bullying and mobbing (60 percent of cases), moral harassment (30 percent of cases) and sexual harassment (10 percent cases).</p></div><p><a href=\"https://arstechnica.com/?p=1990895#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1990895&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"426c17fca4e0f9e00a8752f3af0bd54025598f1af9b09cdfebead303e4c2aaba","category":"Tech"}