{"title":"An Uplifting Avenue upon Mealworm Chitosan for Hemodialysis Application","link":"https://www.preprints.org/manuscript/202404.1094/v1","date":1713358626000,"content":"Chronic kidney disease (CKD) is characterized by a continuous decline in kidney function, often persisting for years or even a lifetime. This study presents a new exploration into the extraction and application of insect chitosan (Tenebrio molitor) targeting hemodialysis (HD). Initially, the potential of insect-derived chitosan as a sustainable and effective alternative to traditional sources (i.e. crustaceans) is demonstrated. Efficient extraction methods were developed (totaling between 6 h and 12 h), producing chitosan. Firstly, chitin was efficiently isolated from T. molitor through deproteinization and demineralization, with yields of approximately 5% (w/w). Subsequently, chitosan was obtained from the extracted chitin resulting in yields of between 65.0 ± 0.8% (w/w) and 79.3 ± 0.8% (w/w). Characterization using Fourier Transform Infrared Spectroscopy (FTIR) confirmed structural similarities with commercial chitosan and degrees of deacetylation in the 73 - 75% range. The bioactive properties of chitosan obtained from T. molitor, including antimicrobial and antioxidant activities, were evaluated. All the microorganisms tested were inhibited, exhibiting minimum lethal concentrations between 2 and 8 mg/mL, confirming the antimicrobial activity of the extracted chitosan. In addition, chitosan showed antioxidant activity in the range of 60 to 65 µmol Trolox equivalent/g, suggesting its viability for various medical applications.This study also developed a chitosan-based membrane (CH - M) culminating in a proof-of-concept phase for hemodialysis. The permeation characteristics of CH-M for urea and albumin were studied in vitro to assess their suitability as HD membranes. Urea was permeable to values of over 70% and albumin was retained.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4271c2ebcef63b457f8d5478a1dda144dbcd9a7cae7e48226049e28d8f699a29","category":"Interdisciplinary"}