{"title":"Toyota to build electric 3-row SUV in Kentucky, batteries in N. Carolina","link":"https://arstechnica.com/?p=1943510","date":1685631307000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/20211214_BEV_32_s-1-800x533.jpg\" alt=\"A grey Toyota electric SUV concept, next to some other Toyota EV concepts\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/20211214_BEV_32_s-1.jpg\">Enlarge</a> <span>/</span> We don't know what this new SUV will look like or be called. The last big electric SUV concept the company showed was this bZ Large SUV in 2021. (credit: Toyota)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Toyota's factory in Georgetown, Kentucky, will get a bit of a glow-up. This week, the automaker confirmed that its factory in the Bluegrass State will assemble a new battery-electric vehicle starting in 2025. It will be an as-yet-unnamed three-row SUV, and the batteries for this new BEV will come from (somewhat) nearby North Carolina.</p>\n<p>Toyota's Kentucky plant currently builds the powertrains and assembles the RAV4 hybrid, as well as sedans like the Camry and Lexus ES. It employs about 8,000 people to build more than half a million vehicles a year.</p>\n<p>\"Toyota Kentucky set the standard for Toyota vehicle manufacturing in the US, and now we’re leading the charge with BEVs,\" said Susan Elkington, president of Toyota Motor Manufacturing, Kentucky. \"Our incredible team of Kentuckians is excited to take on this new challenge while delivering the same great quality and reliability our customers expect.\"</p></div><p><a href=\"https://arstechnica.com/?p=1943510#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1943510&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"427b7f182b4b7b35d39aaf0bd6b00a59e0792a981b040d5206de6f71f4d34f07","category":"Tech"}