{"title":"[FT] นโยบายจำกัดการติดตามโฆษณาของ Apple ทำโซเชียลมีเดียใหญ่เสียรายได้ร่วมหมื่นล้านเหรียญ","link":"https://www.blognone.com/node/125586","date":1635729746000,"content":"<div><div><div><p>จากการที่ Apple ปรับนโยบายความเป็นส่วนตัวบนอุปกรณ์ หรือ App Tracking Transparency กำหนดให้โซเชียลมีเดียต้องขอการยินยอมให้ติดตามข้อมูลที่ส่งผลต่อการมองเห็นโฆษณานั้น ล่าสุด Financial Times รายงานว่า ช่วงครึ่งปีหลังปีนี้ นโยบายดังกล่าวส่งผลกระทบเป็นตัวเงินต่อแพลตฟอร์มอย่าง Snap, Facebook, Twitter และ YouTube ร่วมหมื่นล้านดอลลาร์</p>\n<p>Apple เริ่มใช้นโยบายเพื่อความเป็นส่วนตัวหรือ App Tracking Transparency ช่วงเดือนเมษายนที่ผ่านมา โดย Lotame บริษัทเทคโนโลยีการโฆษณาซึ่งมีลูกค้ารายใหญ่อย่างเช่น The Weather Company และ McClatchy ได้ประมาณการว่าแพลตฟอร์มโซเชียลทั้งสี่ สูญเสียรายได้ไป 12% ในไตรมาสที่สามและสี่ หรือราวๆ 9.85 พันล้านดอลลาร์ Snap ได้รับผลกระทบหนักที่สุด เพราะตัวแพลตฟอร์มเน้นการใช้งานบนมือถือ ส่วน Facebook ได้รับผลกระทบในแง่ของขนาดการตลาดของตัวเอง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2c9bdfaa9e6974e131b8a1d3fb5fd20d.jpg\" /></p>\n<p>Mike Woosley ประธานเจ้าหน้าที่ฝ่ายปฏิบัติการของ Lotame กล่าวว่า ผู้โฆษณากำลังเจอปัญหากับการได้รับผลตอบแทนน้อยลงจากการลงทุนในโฆษณา ยกตัวอย่างแบรนด์ชุดชั้นในชายที่จะได้เข้าถึงลูกค้าหนึ่งรายจากโฆษณา $5 ซึ่งกำหนดเป้าหมายไปที่ผู้ชาย 1,000 คน แต่กลายเป็นว่าจู่ๆ บริษัทโฆษณาก็ไม่สามารถทำการกำหนดเป้าหมายโฆษณาได้ เพราะไม่รู้ว่าใครเป็นหญิงใครเป็นชาย ทำให้ต้องจ่ายเงินเพิ่มขึ้นเพื่อให้เข้าถึงกลุ่มลูกค้ามากขึ้น</p>\n<p>Aidan Corbett หัวหน้าผู้บริหารของ Wayflyer บริษัทผู้ให้เงินทุนแก่การเริ่มต้นช้อปปิ้งออนไลน์ บอกว่า หากความสามารถในการโฆษณาบน Facebook เริ่มไม่คุ้มค่า คนก็จะเริ่มย้ายออก ซึ่ง TikTok ได้รับความนิยมอย่างมาก เพราะใช้เงินน้อยกว่าในการทำให้โฆษณาแสดงผล 1,000 ครั้ง</p>\n<p>Eric Seufert ที่ปรึกษา adtech กล่าวว่า Facebook ได้รับผลกระทบหนักที่สุดจากเหตุการณ์นี้ ซึ่ง Facebook ต้องทำโครงสร้างและเฟรมเวิร์คใหม่ทั้งหมดซึ่งน่าจะต้องใช้เวลาอย่างน้อย 1 ปี</p>\n<p>ช่วงแรกๆ ที่ Apple เสนอโยบายใหม่ๆ Facebook โจมตี Apple หนักมาก <a href=\"https://www.blognone.com/node/120153\">ว่าใช้เหตุผลเรื่องความเป็นส่วนตัวมาบังหน้าผลประโยชน์ของตัวเอง</a></p>\n<p>ในขณะเดียวกัน Twitter ดูจะเป็นผู้ที่ได้รับผลกระทบน้อย (รายได้โฆษณาไตรมาสก่อนหน้าเพิ่มขึ้น 41%) เนื่องจากโฆษณาบน Twitter พึ่งพาบริบทและการสร้างแบรนด์ มากกว่าการติดตามพฤติกรรมการใช้อุปกรณ์ ส่วน Alphabet ก็มีข้อมูลผู้ใช้ของบุคคลมากพอ ไม่จำเป็นต้องติดตามผู้ใช้ในแอปของบุคคลที่สาม</p>\n<p>ที่มา - <a href=\"https://www.ft.com/content/4c19e387-ee1a-41d8-8dd2-bc6c302ee58e\">Financial Times</a>, <a href=\"https://gizmodo.com/apples-privacy-policy-cost-snap-facebook-twitter-and-1847971994\">Gizmodo</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/snap\">Snap</a></div><div><a href=\"/topics/twitter\">Twitter</a></div><div><a href=\"/topics/alphabet\">Alphabet</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/advertisement\">Advertisement</a></div><div><a href=\"/topics/privacy\">Privacy</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"42877e03183c0d3600a4c95d4a22eca6ec27754911051bc6127e613cb2e7d13f","category":"Thai"}