{"title":"PSIV-29 Efficacy of a chute-side pregnancy test on early pregnancy determination in mature Rambouillet ewes","link":"https://academic.oup.com/jas/article/102/Supplement_3/821/7757625?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Distinguishing pregnant from non-pregnant ewes in early pregnancy allows for more efficient flock management by producers. While early pregnancy detection techniques like ultrasonography and hormone quantification are well established, these techniques are often not adaptable to field conditions or require specialized equipment and training. The objective of this study was to evaluate a validated bovine commercial on-farm pregnancy test on efficacy for detecting early pregnancy in distinct blood constituents of ewes. Rambouillet ewes [n = 30; average body weight (BW) = avg 60.9 ± 1.1 kg; age 2 to 8 yr) were estrous synchronized using a 5 d CIDR protocol followed by 2 injections of PGF<sub>2α</sub> at 0 and 4 h. A rattle-painted ram was subsequently placed with ewes for a 35-d breeding season. Blood constituents including whole blood (WB), plasma (PL), and serum (SE) were collected via jugular venipuncture prior to synchronization (d 0) and on d 20, 35, and 70 after breeding. Blood constituents were individually evaluated using the IDEXX Alertys OnFarm pregnancy test for pregnancy detection. Trans-abdominal ultrasonography was performed on d 35 and d 70 post-breeding. Serum progesterone (P<sub>4</sub>) was quantified on d 100 of gestation to confirm pregnancy status. Progesterone concentrations ≥ 4 ng/mL were considered pregnant. On d 20 of gestation, IDEXX tests agreed with P<sub>4</sub> concentrations on d 100 (χ<sup>2</sup> = 0.30) in WB, SE and PL at 35.7, 53.6, and 53.6%, respectively. Pregnancy detection accuracy increased on d 35 of gestation as IDEXX tests agreed with P<sub>4</sub> at d 100 (χ<sup>2</sup> = 1.00) in WB, SE, and PL at 60.7, 60.7 and 60.7% accuracy, respectively. On d 70 of gestation, IDEXX tests agreed with P<sub>4</sub> at d 100 (χ<sup>2</sup> = 0.81) in WB, SE, and PL at 90.7, 93.3 and 93.3% accuracy, respectively indicating similarity in pregnancy diagnosis in the two methods. Detection of pregnancy using ultrasonography at d 35 identified 33% of pregnant ewes, while d 70 ultrasound detected 93% of pregnant ewes when compared with d 100 serum P<sub>4</sub>. Results suggest that the IDEXX pregnancy test provides early diagnosis of pregnancy with d 70 results comparable to d 100 serum P<sub>4</sub> quantification regardless of blood constituent type.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4288149e3bd7ac32bfcd686daa9491a37f2d6d9e86378511d07dbdcb776f3c68","category":"Environment"}