{"title":"The measurement of China’s provincial physical capital stock based on the improved method and indicators","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307946","date":1723557600000,"content":"<p>by Qi Wang, Ziyu Ma</p>\r\n\r\nPhysical capital stock is the basic indicator of macroeconomic empirical studies and also an important manifestation of macroeconomic activity capacity. When measuring China’s provincial physical capital stock by the perpetual inventory method, the treatment for the depreciation rate and the initial physical capital stock in the existing literature has some defects in reflecting the economic performance. The purpose of this paper is to build the most reliable and reasonable statistical series of China’s provincial physical capital stock. We establish a measurement formula in form of the variable depreciation rate and improve the treatment for the depreciation rate and the initial physical capital stock. For the depreciation rate, we measure the benchmark depreciation rate of physical capital and determine the variable depreciation rate according to the economic growth rate, which makes the variable depreciation rate reflect the economic growth. For the initial physical capital stock, we measure the initial physical capital stock according to the capital output ratio, which makes the initial physical capital stock reflect the economic aggregate. Based on these improvements, we measure China’s provincial physical capital stock from 1952 to 2022 by the perpetual inventory method. Through analyzing the measurement results, we have a more distinct insight into the temporal and spatial characteristics of China’s provincial physical capital stock: The growth rate of physical capital stock at the provincial level has slowed in spite of remaining high; The eastern region is much higher than the central and western regions. According to these two characteristics, it is suggested that policymakers need to improve market mechanisms and adjust investment policies to promote a benign profile of economic growth and a regional optimization of capital formation.","author":"Qi Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"428828498a73547058142af51543f57a8861e92e3411c727876fa6c56b72b3a9","category":"Interdisciplinary"}