{"title":"ผลทดสอบ PS5 ล็อตใหม่ ซีพียูเย็นลง 11 องศา, ส่วนอื่นร้อนขึ้นเล็กน้อย","link":"https://www.blognone.com/node/124720","date":1631510759000,"content":"<div><div><div><p>หลังยูทูบเบอร์ <a href=\"https://www.blognone.com/node/124484\">Austin Evans ทดสอบระบบระบายความร้อนของเครื่อง PS5</a> ด้วยกล้องจับความร้อนจากภายนอก พบว่าอุณหภูมิสูงขึ้นเล็กน้อย ก็มีดราม่าตามมาพอสมควร ว่าการทดสอบความร้อนจากพลาสติกส่วนนอกของเครื่อง ไม่สะท้อนความร้อนจริงของฮาร์ดแวร์ภายใน</p>\n<p>ล่าสุดยูทูบเบอร์ <a href=\"https://www.youtube.com/watch?v=Pwu_fkYwLEQ\">Hardware Busters International</a> จึงได้นำเครื่อง PS5 ล็อตใหม่มาทดสอบอีกครั้ง คราวนี้วัดอุณหภูมิภายในแยกแต่ละส่วนอย่างชัดเจน และทดสอบขณะเปิดเล่นเกม</p>\n<p>Hardware Busters International พบว่าขณะเล่นเกม พัดลมยังหมุนเท่าเดิม ตัวเครื่องกินไฟเท่าเดิม แต่ความร้อนของซีพียู ลดลงถึง 11 องศา จาก 51 เหลือ 40 องศา แต่ส่วนอื่นเช่นแรม ความร้อนเพิ่มจาก 40 เป็น 48 องศา หน่วยความจำของกราฟฟิก (VRAM) ความร้อนเพิ่มจาก 45 เป็น 46 องศา และลมร้อนจากตัวเครื่องมีอุณหภูมิเพิ่มจาก 40 องศา เป็น 42 องศา</p>\n<p>น้ำหนักเครื่องที่ลดลง 300 กรัม อาจแปลว่าฮีทซิงก์และฮีทไปป์ถูกปรับลดจริง แต่อาจเป็นการปรับดีไซน์ของฮีทซิงก์ ไปเน้นการระบายความร้อนของซีพียูแทน เพราะเป็นส่วนที่ทำงานหนักสุดในเครื่องคอนโซล แม้ทำให้ชิ้นส่วนอื่นร้อนขึ้น ก็ยังไม่ถึงขั้นทำให้การทำงานของเครื่องมีปัญหา</p>\n<p>ส่วนเรื่องลมร้อน (exhaust) ที่มีอุณหภูมิสูงขึ้น อาจแปลว่าการระบายความร้อนมีประสิทธิภาพสูงขึ้นด้วยเช่นกัน เพราะการลดแผ่นระบายความร้อนน้อยลงในบางจุด อาจทำให้ลมระบายความร้อนหมุนเวียนได้ดีขึ้น และเมื่อรวมอุณหภูมิของซีพียู หน่วยความจำ และ VRAM ของ PS5 รุ่นใหม่ก็พบว่าลดลงจากเดิม 137 องศา เหลือราว 134 องศา</p>\n<p>ที่มา - <a href=\"https://www.youtube.com/watch?v=Pwu_fkYwLEQ\">Hardware Busters International</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ps5\">PS5</a></div><div><a href=\"/topics/sony\">Sony</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"428ba17b6ccaa8b4a75d34d6d6097736096dfe3f0285f5051c2b4f7269c40493","category":"Thai"}