{"title":"Noncytotoxic Graphene Nanoplatelets Upregulates Cell Proliferation and Self-Renewal Genes of Mesenchymal Stem Cells","link":"https://www.preprints.org/manuscript/202407.2227/v1","date":1722333180000,"content":"Graphene nanoplatelets (UGZ-1004) are advancing as a promising biomaterial for regenerative medicine. This study provides a detailed assessment of UGZ-1004, emphasizing its physical properties, cytotoxicity, intracellular interactions, and particularly its effects on mesenchymal stem cells (MSCs). UGZ-1004 was characterized to have lateral sizes and layer counts in line with ISO standards and exhibited high carbon purity (0.08%). Cytotoxicity evaluations demonstrated that UGZ-1004 is non-toxic to various cell lines, including fibroblast 3T3, epithelial kidney VERO, microglia BV-2, and MSCs, in accordance with ISO-10993-5/2020/2023 guidelines. The study focused on MSCs, revealing that UGZ-1004 supports their self-renewal and proliferation. MSCs exposed to UGZ-1004 maintained their characteristic surface markers and proliferation rates. Importantly, UGZ-1004 promoted significant upregulation of genes crucial for cell cycle regulation and DNA repair, such as CDK1, CDK2, and MDM2. This gene expression profile suggests that UGZ-1004 enhances MSC self-renewal capabilities, ensuring robust cellular function and longevity. Moreover, UGZ-1004 exposure led to the downregulation of genes associated with tumor development, including CCND1 and TFDP1, mitigating potential tumorigenic risks. These findings underscore the potential of UGZ-1004 to not only bolster MSC proliferation but also enhance their self-renewal processes, which are critical for effective regenerative therapies. The study highlights the need for continued research into the long-term impacts of graphene nanoplatelets and their application in MSC-based regenerative medicine.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"428cea95aab1348972ab1fac793aea0823cfd81c3b5ebd2b080c8d86cf125bc8","category":"Interdisciplinary"}