{"title":"Blizzard delays Diablo IV, Overwatch 2 amid exec departure","link":"https://arstechnica.com/?p=1809941","date":1635955885000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/jenoneal-800x629.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/jenoneal.png\">Enlarge</a> <span>/</span> Jen Oneal will be leaving her co-leadership position atop Blizzard after less than three months. (credit: <a href=\"https://careers.blizzard.com/global/en/albany\">Activision Blizzard</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It's been less than three months since former Vicarious Visions head Jen Oneal stepped up to co-lead Blizzard alongside Mike Ybarra, following <a href=\"https://arstechnica.com/gaming/2021/08/blizzard-president-j-allen-brack-steps-down-amid-lawsuit-fallout/\">the departure of longtime veteran J. Allen Brack</a>. On Tuesday, though, Oneal announced her sudden departure as the company continues to navigate <a href=\"https://arstechnica.com/gaming/2021/07/ca-state-agency-sues-activision-blizzard-alleges-discrimination-against-women/\">lawsuits surrounding accusations of widespread harassment</a>.</p>\n<p>Oneal <a href=\"https://news.blizzard.com/en-us/blizzard/23738005/a-message-from-jen-oneal\">said in a statement</a> that she will be stepping down from leadership immediately ahead of leaving the company entirely at the end of the year. \"I am doing this not because I am without hope for Blizzard, quite the opposite—I’m inspired by the passion of everyone here, working towards meaningful, lasting change with their whole hearts,\" she wrote. \"This energy has inspired me to step out and explore how I can do more to have games and diversity intersect, and hopefully make a broader industry impact that will benefit Blizzard (and other studios) as well... Blizzard’s best days are ahead. I truly believe that.\"</p>\n<p>Alongside Oneal's departure, Activision Blizzard announced a donation of $1 million to <a href=\"https://www.getwigi.com/\">Women in Games International</a>, a nonprofit where Oneal serves on the board. \"Though we will all miss [Oneal] greatly, we wish her all the best as we work with her on a plan to make an industry-wide impact through the WIGI grant,\" Blizzard head Mike Ybarra said on an earnings call Tuesday.</p></div><p><a href=\"https://arstechnica.com/?p=1809941#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1809941&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"428e56906c4846ed28d0ac50146ac7ffdccbab329f81ccbfda0e01a1788e5b7f","category":"Tech"}