{"title":"Review: OWC's Envoy Pro FX is an Ultra Fast, Expensive Portable SSD for Macs","link":"https://www.macrumors.com/review/owc-envoy-pro-fx/","date":1614993713000,"content":"A few months ago, OWC introduced the <a href=\"https://www.anrdoezrs.net/links/462641/type/dlg/https://eshop.macsales.com/shop/owc-envoy-pro-fx\">Envoy Pro FX</a>, a portable SSD storage drive that is described as \"the fastest, most compatible drive ever.\" I take a closer look at the Envoy Pro FX and its capabilities in my review below.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/owc-envoy-pro-fx-featured.jpg\" alt=\"\" width=\"1600\" height=\"900\" class=\"aligncenter size-full wp-image-787320\" />\r\n<br/>\r\n<h3>Key Features</h3><ul><li><strong>Wide compatibility</strong>: The drive can be connected to a wide range of devices with Thunderbolt 3/4 or USB-C ports, such as the latest Mac, iPad Pro, and iPad Air models, as well as PCs and Microsoft Surface devices. There is also a USB-A adapter attached to the Thunderbolt cable included in the box.</li>\r\n<br/>\r\n<li><strong>Very fast speeds:</strong> Thunderbolt 3/4 compatibility allows for very fast read/write speeds up to an advertised 2,800 MB/s. I test speeds below.</li>\r\n<br/>\r\n<li><strong>Bus-powered:</strong> The drive is powered by the device it is connected to, not a power supply.</li>\r\n<br/>\r\n<li><strong>Tough design:</strong> The drive's aluminum housing has IP67-rated water and dust resistance and military-grade drop protection.</li>\r\n<br/>\r\n<li><strong>Storage capacities:</strong> 240GB, 480GB, 1TB, and 2TB.</li></ul>\r\n<br/>\r\n\r\n<br/>\r\n<h3>Performance</h3>\r\n<br/>\r\nThe Envoy Pro FX enclosure is equipped with OWC's Aura P12 Pro, a high-performance SSD with M.2 NVMe 1.3 technology. With a PCI-Express 3.1 connection via Thunderbolt 3, OWC promises impressive read/write speeds up to 2,800 MB/s.\r\n<br/>\r\n\r\n<br/>\r\nMy test setup consisted of a base model 16-inch MacBook Pro with a 2.6GHz six-core 9th-generation Intel Core i7 processor running macOS Big Sur 11.2, with the Envoy Pro FX connected directly to the MacBook Pro with a single Thunderbolt 3 cable. The drive was formatted with a single Apple File System (APFS) volume for macOS.\r\n<br/>\r\n\r\n<br/>\r\nUsing the popular AmorphousDiskMark 3.1 storage benchmark app by Katsura Shareware, the Envoy Pro FX achieved sequential read and write speeds of up to 3,002 MB/s and 2,324 MB/s respectively on my Mac. This is a bit above what OWC advertises, but in my actual usage of the drive, data transfer speeds were around the 2,700-2,800 MB/s mark. For example, I was able to transfer a 25GB file in around nine seconds.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/envoy-pro-fx-benchmark.jpg\" alt=\"\" width=\"1120\" height=\"792\" class=\"aligncenter size-full wp-image-787330\" />\r\n<br/>\r\nBy comparison, SanDisk's 1TB Extreme Pro SSD also uses M.2 NVMe 1.3 technology, but without Thunderbolt 3, sequential read performance is limited to up to 2,000 MB/s. And at the low end, external HDDs often top out at read speeds of around 100 MB/s to 150 MB/s. Of course, both of those options are far cheaper than the Envoy Pro FX, with some comparisons included in my pricing section below.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Design</h3>\r\n<br/>\r\nWith a sleek aluminum housing, the Envoy Pro FX resembles an Apple product, but the white OWC logo and Envoy Pro FX branding takes away from the aesthetic. The drive's \"charcoal gray\" color is a bit darker than the Space Gray finish of the MacBook Pro, but they still look nice side by side. Along the left and right sides of the drive are what OWC calls \"deeply grooved fins\" to help with heat dissipation and ensure sustained performance. The fanless drive never felt overly hot to the touch during some large file transfers in my testing.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/envoy-pro-fx-3.jpg\" alt=\"\" width=\"1600\" height=\"1200\" class=\"aligncenter size-full wp-image-787325\" />\r\n<br/>\r\nThe bottom of the drive has two non-skid rubber feet to prevent it from sliding around on a desk or other surface. On the front of the drive is a slim LED status light that appears blue when the drive is powered on and flashes slowly during file transfers, but the LED isn't very bright, so I found it pretty useless during daylight hours. (I'm no pro photographer, so the picture above makes the LED look brighter than it is.)\r\n<br/>\r\n\r\n<br/>\r\nThe back of the drive has a single Thunderbolt 3 port, which doubles as a USB-C port, as the two standards share the same connector design.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/envoy-pro-fx-4.jpeg\" alt=\"\" width=\"1638\" height=\"600\" class=\"aligncenter size-full wp-image-787324\" />\r\n<br/>\r\nWith no fan, the Envoy Pro FX has silent operation. As expected, the drive didn't make any noise during my testing, which is certainly pleasant. Unfortunately, the fans in my Intel-based MacBook Pro quickly revved up while completing a Time Machine backup to the drive, but I'll take the blame here for not upgrading to an M1 Mac yet.\r\n<br/>\r\n\r\n<br/>\r\nAs an external drive that fits in the palm of my hand, the Envoy Pro FX can easily be brought on the go, making it a convenient, portable solution for storing files while traveling. With a single Thunderbolt 3 cable that connects to a Mac for data and power, IP67-rated water and dust resistance, and military-grade drop protection, the Envoy Pro FX provides a plug-and-play experience without any worry.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Compatibility</h3>\r\n<br/>\r\nThe Envoy Pro FX can be connected to a wide range of devices with Thunderbolt 3/4 or USB-C ports, such as the latest Mac, iPad Pro, and iPad Air models, as well as PCs and Microsoft Surface devices. There is also a USB-A adapter attached to the Thunderbolt cable included in the box that allows the drive to be connected to USB-A devices.\r\n<br/>\r\n\r\n<br/>\r\nTo take advantage of the maximum speeds that the Envoy Pro FX offers, a 2016 or newer Mac with Thunderbolt 3/4 ports running macOS High Sierra or later is needed. OWC lists <a href=\"https://eshop.macsales.com/item/OWC/TB3ENVPFX01/\">full system requirements</a> on its website.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/envoy-pro-fx-drive-guide.jpg\" alt=\"\" width=\"800\" height=\"528\" class=\"aligncenter size-full wp-image-787331\" />\r\n<br/>\r\nThe drive comes preloaded with OWC's Drive Guide formatting utility for configuring the drive, with options to create a single Apple File System (APFS) volume that fills the entire drive for macOS High Sierra and later, a single HFS+ volume that fills the entire drive for older macOS versions, or a single exFAT volume that fills the entire drive for use with both macOS and Windows. The drive can also be configured manually.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Pricing</h3>\r\n<br/>\r\nGiven that the Envoy Pro FX is a top-of-the-line portable SSD, it should come as no surprise that the drive isn't cheap. Pricing starts at &#36;199 for 240GB of storage, followed by 480GB for &#36;229, 1TB for &#36;319, and 2TB for &#36;499.\r\n<br/>\r\n\r\n<br/>\r\nA few comparisons with other 1TB drives compatible with the Mac:<ul><li><a href=\"https://www.apple.com/shop/product/HM8Q2ZM/A/g-technology-1tb-g-drive-mobile-usb-c-portable-hard-drive\">G-Technology G-DRIVE Portable HDD</a> (up to 140 MB/s): &#36;79.95</li>\r\n<br/>\r\n<li><a href=\"https://www.amazon.com/dp/B0874XN4D8\">Samsung T7 Portable SSD</a> (up to 1,050 MB/s): &#36;169.99 (on sale for &#36;159)</li>\r\n<br/>\r\n<li><a href=\"https://www.amazon.com/SanDisk-1TB-Extreme-Portable-SDSSDE61-1T00-G25/dp/B08GTYFC37/\">SanDisk Extreme Pro Portable SSD</a> (up to 1,050 MB/s): &#36;279.99 (on sale for &#36;179.99)</li>\r\n<br/>\r\n<li><a href=\"https://www.amazon.com/SanDisk-1TB-Extreme-Portable-SDSSDE81-1T00-G25/dp/B08GV9M64L/\">SanDisk Extreme Pro Portable SSD V2</a> (up to 2,000 MB/s): &#36;299.99 (on sale for &#36;229.99)</li></ul>\r\n<br/>\r\n\r\n<br/>\r\nA black 0.7-meter Thunderbolt 3 cable is included in the box with the Envoy Pro FX.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/envoy-pro-fx-2.jpg\" alt=\"\" width=\"1600\" height=\"1200\" class=\"aligncenter size-full wp-image-787326\" />\r\n<br/>\r\n<h3>Final Verdict</h3>\r\n<br/>\r\nThe Envoy Pro FX is excellent, but pricey. If you want ultra-fast read/write speeds, this drive has certainly earned my stamp of approval; however, if you are simply looking for a drive to store your Time Machine backups, then it would be more economical to consider a basic 1TB hard drive for around a quarter of the price of the Envoy Pro FX, or a non-Thunderbolt SSD as a good middle ground in terms of price and speed.\r\n<br/>\r\n\r\n<br/>\r\nThe Envoy Pro FX <a href=\"https://www.anrdoezrs.net/links/462641/type/dlg/https://eshop.macsales.com/shop/owc-envoy-pro-fx\">can be ordered on OWC's website</a>.\r\n<br/>\r\n\r\n<br/>\r\n<small><em>Note: MacRumors is an affiliate partner with OWC and Amazon. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. OWC provided MacRumors with an Envoy Pro FX for this review. No other compensation was received.</em></small><div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/owc/\">OWC</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/review/owc-envoy-pro-fx/\">Review: OWC&#039;s Envoy Pro FX is an Ultra Fast, Expensive Portable SSD for Macs</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/review-owcs-envoy-pro-fx-is-an-ultra-fast-expensive-portable-ssd-for-macs.2287261/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=W-N4aMR7BII:k_k8eXXqmUQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=W-N4aMR7BII:k_k8eXXqmUQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/W-N4aMR7BII\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4290f3dffbb4e863bc3c3bb860d3cebdb7b508888ec2bed54a7f44849a177272","category":"Apple"}