{"title":"School feeding for improving child nutrition in conflict‐affected settings: Feasibility and cost efficiency of alternative models in Yemen","link":"https://onlinelibrary.wiley.com/doi/10.1111/nyas.15222?af=R","date":1726470000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/88deef51-c31e-4095-88bc-98cdedf372d6/nyas15222-gra-0001-m.png\" alt=\"School feeding for improving child nutrition in conflict-affected settings: Feasibility and cost efficiency of alternative models in Yemen\" />\n<p>School feeding programs can support children's nutrition, health, and education in emergencies. This study assessed the feasibility, trade-offs, cost efficiency, and perceived benefits of school feeding modalities operating in urban Yemen.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>School feeding programs can support children's nutrition, health, and education in emergencies. This study assessed the feasibility, trade-offs, cost efficiency, and perceived benefits of school feeding modalities operating in urban Yemen. It draws on primary data from a qualitative evaluation with 21 school feeding implementers and 88 beneficiaries conducted in Feb–Mar 2023, and secondary data from a desk review of published and program literature on school feeding operations. Results showed that school feeding provided students with on average 18%, 40%, and 66% of daily energy, protein, and micronutrient requirements, respectively. Models including fortified snacks were 3–11 times more cost-efficient in terms of nutrient delivery. The most prominent strength of the models examined were the perceived benefits on child, family, and financial outcomes. Among the main weaknesses was the poor nutritional quality of the meal, which in turn emerged as a primary opportunity to improve school feeding through hybrid models providing a combination of fortified snacks and healthy meals. Other weaknesses such as poor water, sanitation, and hygiene infrastructure, and desired improvements such as the school kitchen and canteen, require considerable investments. Hybrid models are cost-efficient, acceptable, and feasible in Yemen and can serve the diet and nutrition needs of school-aged children.</p>","author":"Lilia Bliznashka, \nDalia Elsabbagh, \nSikandra Kurdi, \nOlivier Ecker, \nAulo Gelli","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"4292bf6992651092de9c27d4eefff24cf7d21818df5a34426659e419344cc2f7","category":"Environment"}