{"title":"Limited genetic depletion despite extinction risk: genomic diversity of a peripheral population of red-spotted bluethroats in Central Europe","link":"https://academic.oup.com/zoolinnean/article/doi/10.1093/zoolinnean/zlae094/7740522?rss=1","date":1724457600000,"content":"<span><div>Abstract</div>Small and isolated populations are at risk of local extinction, either due to the reduction of genetic diversity or due to stochastic events. We assessed genetic diversity in populations of the red-spotted (<span>Luscinia svecica svecica</span>) and white-spotted bluethroat (<span>L. s. cyanecula</span>) subspecies from six European sites, focusing on a peripheral and declining, red-spotted population from Central Europe (Krkonoše Mountains, Czech Republic). Analysis of population structure using mitochondrial sequences (cytochrome <span>b</span>) and ddRAD genomic data revealed that the two subspecies form clearly defined clusters, but traces of possible admixture were found in three populations of the white-spotted bluethroat. Demographic history reconstruction indicates past population range expansion in both subspecies, while the occurrence of short (0.4 Mbp) runs of homozygosity (ROH) segments suggests possible inbreeding 50 to 200 generations ago. Interestingly, although established by a small number of individuals, the Krkonoše population show reduced genetic diversity in only one measure of summary statistics, possibly due to sustained gene flow. Correspondingly, nine highly homozygous genes were recovered within a 2.6-Mbp long ROH region on the Chr 5. Thus, we found only a small reduction of genetic diversity in a population facing extinction, contrary to the expectations for a geographically distant and small population.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"4293da72d9789f2c218346aebca92b3cf878e88e515cff853b32ddbcb9033298","category":"Environment"}