{"title":"The quest to understand tornadoes","link":"https://arstechnica.com/?p=1977718","date":1697972818000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/GettyImages-1509959669-800x576.jpg\" alt=\"This stovepipe tornado formed under an intense rotating wall cloud near Keota, Iowa, on March 31, 2023.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/GettyImages-1509959669-scaled.jpg\">Enlarge</a> <span>/</span> This stovepipe tornado formed under an intense rotating wall cloud near Keota, Iowa, on March 31, 2023. (credit: <a href=\"https://www.gettyimages.com/detail/photo/keota-stovepipe-tornado-royalty-free-image/1509959669\">Jonah Lange/Getty </a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>One muggy day in July 1986, a news helicopter was recording footage of a festival in Minneapolis when the pilot and photographer glimpsed a tornado over nearby Brooklyn Park. They moved toward it, filming the powerful twister for 25 minutes, mesmerizing viewers watching it live on TV.</p>\n<p>Watching as the helicopter hovered within maybe a half-mile of the twister was Robin Tanamachi, who was a kid growing up in Minneapolis at the time. “We were seeing all this really beautiful interior vortex structure,” she says. “I was just absolutely hooked on that, and I know I was not the only one.” Today, Tanamachi is a research meteorologist at Purdue University in West Lafayette, Indiana, and one of many researchers delving into twisters’ mysteries, searching for details about their formation that may bolster future forecasts.</p>\n<p>Tornadoes can be elusive research subjects. Through chasing storms and using computer simulations, scientists have worked out the basic ingredients needed to spin up a twister, but two crucial questions continue to vex them: Why do some thunderstorms form tornadoes while others don’t? And how exactly do tornadoes get their spin?</p></div><p><a href=\"https://arstechnica.com/?p=1977718#p3\">Read 32 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1977718&amp;comments=1\">Comments</a></p>","author":"Knowable Magazine","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4296cf95c5cab6a91d140bc2292a7149ffd36316a81f266ea99295867fc7f79a","category":"Tech"}