{"title":"Strong Climate Control on the Millennial‐Scale Dust Variability and Sediment Provenances in the Equatorial Indian Ocean Inferred From Sr‐Nd Isotopes","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004808?af=R","date":1709884800000,"content":"<h2>Abstract</h2>\n<p>High-resolution Sr and Nd isotope compositions along with major and trace element abundances have been analyzed in silicate fraction of sediments core, SSD004-GC03, from the Equatorial Indian Ocean (7.2°N and 77.9°E) at 1,540 m water depth with a depositional history of ∼38 ka to determine source variabilities and their controlling factors. <sup>87</sup>Sr/<sup>86</sup>Sr (0.71978–0.72491), Ɛ<sub>Nd</sub> (−14.8 to −21.9), and a couple of source diagnostic elements display profound variability over the depositional time scale and point toward major sediment contribution from the Peninsular Gneissic Complex (PGC) and the Deccan Basalts along with aeolian dust flux, their relative proportions being determined by climate variability. The cold/arid periods are characterized by an enhanced proportion of aeolian dust and the Deccan Basalts, whereas the sediment contribution from the PGC is augmented during the warm/humid periods. The sediment provenance variations at the Equatorial Indian Ocean coincide very well with known cold/arid (Heinrich Stadial events: HS 1–4, LGM, Younger Dryas, 8.2 ka, 5.2 ka, and 1.1 ka) and warm/humid (Early Deglacial, Holocene Intensified Monsoon) climatic events reported in the tropical region and sea-level change which are strongly captured by the Sr-Nd isotope and elemental composition of sediments. The present investigation underscores the significant role of climate, mainly the aridity, in modulating the dust fluxes and erosion intensity and the strong coupling between Indian monsoon and North Atlantic climatic oscillations and further demonstrates minimal time delay between the production and transport of sediment from source to sink.</p>","author":"Arvind Shukla, \nSunil Kumar Singh, \nDharmendra Pratap Singh, \nAka Sharma, \nA. P. Dimri","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"429ac3f7fef25f09a22c094cad0163c8f097893b6106be3402f943e41d7aae39","category":"Environment"}