{"title":"Wear OS is getting a multi-generational leap in power thanks to Samsung","link":"https://arstechnica.com/?p=1786031","date":1628615343000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/11-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/11.jpg\">Enlarge</a> <span>/</span> Samsung's 5 nm Exynos W920.  </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Tomorrow is Samsung's big event for the back half of 2021, and in addition to launching <a href=\"https://arstechnica.com/gadgets/2021/07/samsung-confirms-august-11-event-heres-what-to-expect/\">some foldable smartphones</a>, the company is expected to reveal the Galaxy Watch 4 and the big Wear OS revamp it is working on with Google. Google is cooking up the first major Wear OS release since 2018, and Samsung is abandoning Tizen for smartwatches and going all-in on Wear OS with the Galaxy Watch 4. Last night, Samsung <a href=\"https://news.samsung.com/global/samsung-introduces-the-industrys-first-5nm-processor-powering-the-next-generation-of-wearables\">took the wraps</a> off the main SoC for the Galaxy Watch 4, and compared to what Wear OS usually gets, Samsung is shipping a <em>beast</em> of an SoC.</p>\n<p>The \"Samsung Exynos W920\" will be a multi-generational leap in performance for Wear OS. Samsung says this is a 5 nm chip with two ARM Cortex A55 cores and an ARM Mali-G68 GPU. For the always-on display mode, there's an additional Cortex M55 CPU, which can keep the watch face ticking along while using minimal power. There's also an integrated LTE modem for on-the-go connectivity.</p>\n<p>Compared to Samsung's previous smartwatch chip, the Tizen-only Exynos 9110 (10 nm, 2x Cortex A53), the company is promising \"around 20 percent\" better CPU performance and \"ten times better graphics performance.\" Remember that the Exynos 9110 is from <em>2018</em>, so those comparative numbers are inflated, but at 5 nm, this is a more modern chip than Wear OS has ever seen.</p></div><p><a href=\"https://arstechnica.com/?p=1786031#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1786031&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"42ac348c450f345e30ee9d81e07f58981c4532ed9c88a7f7243ffee946f5dcfe","category":"Tech"}