{"title":"Trapped in amber: Fossilized dinosaur-era crab bridges evolutionary gap","link":"https://arstechnica.com/?p=1806041","date":1634758413000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/crabTOP-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/crabTOP.jpg\">Enlarge</a> </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Once upon a time, during the Cretaceous period, a tiny crab wandered out of the water onto land and somehow got trapped in amber, which preserved it for 100 million years. At least that's what a team of scientists hypothesize might have happened in <a href=\"https://science.org/doi/10.1126/sciadv.abj5689?_ga=2.85241754.2082222226.1634227186-840884453.1599868289\">a new paper</a> announcing their discovery of the oldest known modern-looking crab yet found in the fossil record. The paper was published in the journal Science Advances.</p>\n<p>This new type of \"true crab\" (aka a brachyuran) measures just five millimeters in leg span and has been dubbed <em>Cretapsara athanata.</em> The name is meant to honor the period in which the crab lived and Apsara, a South and Southeast Asian spirit of the clouds and waters. \"Athanatos\" means \"immortal,\" a sly reference to the fossilized crab being frozen in time.</p>\n<p>It's rare to find nonmarine crab fossils from this era trapped in amber; most such amber fossils are those of insects. And the previously discovered crabby fossils are incomplete, usually consisting of pieces of claws. This latest find is so complete that it doesn't seem to be missing even a single hair. The find is of particular interest because it pushes back the time frame for when nonmarine crabs crawled onto land by 25 to 50 million years—consistent with long-standing theories on the genetic history of crabs—and offers new insight into the so-called <a href=\"https://en.wikipedia.org/wiki/Cretaceous_crab_revolution\">Cretaceous Crab Revolution</a>, when crabs diversified worldwide.</p></div><p><a href=\"https://arstechnica.com/?p=1806041#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1806041&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"42b4db3ade693e984513501f74047ead75284fe0a4f9fabe8b8e91818cc827da","category":"Tech"}