{"title":"Berlin's Second Apple Store Opening on Thursday","link":"https://www.macrumors.com/2021/12/01/apple-store-berlin-opening-thursday/","date":1638411186000,"content":"Apple's newest store in Berlin, Germany is set to open on Thursday, December 2, Apple <a href=\"https://www.apple.com/newsroom/2021/12/apple-rosenthaler-strasse-opens-thursday-december-2-in-berlin/\">announced today</a>. Apple Rosenthaler Straße is the first <a href=\"https://www.macrumors.com/guide/apple-store/\">Apple Store</a> in the Mitte borough of Berlin, and it joins Apple Kurfürstendamm in the city.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/apple-berlin.jpg\" /><blockquote>\"We're excited to open our second store in Berlin, right in the heart of Mitte,\" said Deirdre O'Brien, Apple's senior vice president of Retail + People. \"Blending Apple's exceptional technology and tools with the creative passion we share with this community gives us the opportunity to create something really special for our customers in Germany.\"</blockquote>Located near the Hackesche Höfe, Apple Rosenthaler Straße is located in a historic part of the city that's surrounded by design firms and art studios. The store features the same general ‌Apple Store‌ design that Apple has deployed worldwide with dedicated tables that highlight product options, a Forum and video wall, and a dedicated area for product pickups. There are seven-meter high floor-to-ceiling windows and towering trees inside to complete the look.\r\n<br />\r\n\r\n<br />\r\nTo celebrate the store's opening, Apple plans to host Berlin artists from illustrator collective Parallel Universe. Each artist will draw their take on Mitte's creative spirit using an <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>, and customers can also start signing up for <a href=\"https://events.apple.com/ms/xww6uj7woR0X9A3Z8acISk9VdH60MurN7MAvJSY75sHQxWqaTEhMjEmalXqC7MMJuZhb5crVxf5sKUXGDQ_UXlJXr_Rqae-Bb-r9ydviPg35QL2tcXvDSBR_LpacC8ysunfU/overview\">Today at Apple classes</a>.\r\n<br />\r\n\r\n<br />\r\nNext year, the Berlin store will offer Today at Apple Creative Studios, an initiative that provides career-building mentorship, industry skills training, tools, and creative resources to underrepresented communities.\r\n<br />\r\n\r\n<br />\r\nApple Rosenthaler Straße is set to open on Thursday, December 2, at 10 a.m. CET in Berlin. Customers will be able to <a href=\"https://www.apple.com/de/retail/rosenthalerstrasse/\">book appointments</a> for an introduction to the store and shopping, with limited capacity and social distancing measures in place. Starting on December 3, the location will offer walk-ins, pickups, and Genius Bar support.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-store/\">Apple Store</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/12/01/apple-store-berlin-opening-thursday/\">Berlin's Second Apple Store Opening on Thursday</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/berlins-second-apple-store-opening-on-thursday.2325844/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=1XWXp4VGyJc:3mFNnM0LjQU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=1XWXp4VGyJc:3mFNnM0LjQU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"42b454deab990fba1ea1c23f4f45b4d3e2d2837c5edd31e6f88fa2f522f56a0c","category":"Apple"}