{"title":"Apple introduces paid podcast subscriptions with redesigned app","link":"https://www.macworld.com/article/343771/apple-introduces-podcasts-subscriptions-new-features-in-podcasts-app.html","date":1618940719000,"content":"\n<div>\n<section><div></div></section><p>With the podcasts market getting more competitive by the day, Apple on Tuesday revealed new features for its dedicated app to keep up. The key new feature is Podcasts Subscriptions, a new service available in 170 countries in May that will offer exclusive content, early access to new series, and ad-free shows. Unlike its other subscription services, Apple isn’t charging a monthly fee for Podcast Subscriptions. Instead, content creators will set their own pricing and terms and fans will be able to subscribe to the podcasts they choose through the app. </p>\n\n\n\n<p>Changes are also coming to the Podcasts app. To help solve that problem of discovery, Apple is introducing a new Channels feature, which groups shows curated by creators. The app also has new pages that feature artwork for each show, an enhanced Search tab, and the ability to save individual episodes for offline playback. The Podcast app also has a new Smart Play button that automatically starts “episodic shows from the latest episode and serialized shows from the beginning of each series.” Users will be able to check out the content of both free channels and paid subscriptions. These changes will be available in <a href=\"https://www.macworld.com/article/331864/ios-14-5-features-release-date-beta-how-to-install.html\">iOS 14.5</a>, iPadOS 14.5, and macOS Big Sur 11.3 which are due to arrive next week. </p>\n\n\n\n<p>For podcast creators, Apple has a new <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://podcaster.apple.com/&amp;xcust=1-1-343771-0-0-0&amp;sref=https://www.macworld.com/feed\">Podcasts for Creators</a> website as well as the Apple Podcasters Program ($10 a year), which includes all of the tools needed to offer premium subscriptions on Apple Podcasts.  According to Apple, the website helps “creators learn more about podcasting, stay informed about the latest news and features, and explore in-depth guides with best practices.”</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"42bb7c029275999d81fe65ec576297716162ce2ce3ca28754fbc2a927e823aaf","category":"Apple"}