{"title":"Development of a Cost-driven, Real-Time Management Strategy for e-Mobility Hubs Including Islanded Operation","link":"https://www.preprints.org/manuscript/202406.0192/v1","date":1717499089000,"content":"The installation of electric vehicle supply equipment (EVSE) increases demand and peak loads, potentially straining existing energy distribution infrastructure. Dispersed and inadequately planned placement of charging points (CPs) can disrupt the electrical grid, surpass contracted demand thresholds, and require infrastructure upgrades, thereby incurring unfeasible costs for Distribution System Operators (DSOs). In this context, it is necessary to recognize the role of business models in enabling effective electrification of the transportation sector. In response to these challenges, this paper introduces a novel e-mobility hub management strategy, tailored for implementation in the Brazilian context. The proposed strategy revolves around a microgrid configuration encompassing dispatchable and photovoltaic generation, a battery energy storage system (BESS), EVSE infrastructure, and local loads. Moreover, this centralized controller facilitates the implementation of dynamic pricing and demand-response mechanisms, integral to business models seeking to integrate EVSE into the distribution grid. To validate the efficacy of the proposed solution, hardware-in-the-loop (HIL) simulations of the microgrid system are conducted. These simulations, incorporating the centralized controller, serve as a tool for assessing system performance and viability before on-site equipment deployment. Finally, this paper concludes with the insights gleaned from test analysis and its discussion through a selection of the most expressive scenarios, including islanded and connected operation modes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"42bc6ab2d0e56c0df45ff5f7da2bf3a239eb5b7944de7fb669653f0fce1d45cb","category":"Interdisciplinary"}