{"title":"Is there evidence of convergent displacement of characters in the release calls of Cuban species of the genus Peltophryne (Anura: Bufonidae)?","link":"https://academic.oup.com/biolinnean/article/140/3/471/7285203?rss=1","date":1695859200000,"content":"<span><div>Abstract</div>Anuran release calls are produced by females and males in response to mating attempts by other males. The efficiency of the release signal to initiate dismount ensures that amplexus is not prolonged, avoiding exposure to predation and increasing the time available for breeding opportunities. Convergent character displacement of release calls may facilitate interspecific communication. In this contribution, we described and compared the release calls of sexually active males of four endemic species of Cuban toads of the genus <span>Peltophryne</span> in allopatric and sympatric conditions, exploring possible evidence of convergent displacement in areas of sympatry. One of these species, <span>Peltophryne peltocephala</span>, is widely distributed in the Cuban archipelago, with contact areas with two other species of large toads. Convergent character displacement requires that the allopatric character states of the species are significantly different from each other, and the sympatric character states are not significantly different. Although significant differences were detected between pairs of different species, in terms of duration of call sequence, call duration, interval between calls and dominant frequency, we did not find a robust pattern consistent with the expected pattern of convergent displacement of acoustic characters. Almost all call variability of allopatric populations fell inside the variability of sympatric populations.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"42bd2a145c5d2f0956ab6a0df8360f727ae3784053a5ff06282929a699c05d18","category":"Environment"}