{"title":"Four-toed sengi (Petrodromus tetradactylus, Afrotheria, Mammalia) museomics reveals a crucial role of East African forests in macroscelidean diversification","link":"https://academic.oup.com/zoolinnean/article/doi/10.1093/zoolinnean/zlae081/7715773?rss=1","date":1721174400000,"content":"<span><div>Abstract</div>Sengis (Macroscelidea) are members of the Afroinsectivora, a group of mammals belonging to the supercohort Afrotheria. Sengis’ low population densities and their distribution, which includes politically unstable regions with ongoing armed conflicts, hinder contemporary sampling of comprehensive datasets. We overcome this obstacle for the species <span>Petrodromus tetradactylus</span>, one of the most widely distributed sengi species, by utilizing 44 historical museum samples from multiple natural history museums. These historical samples were combined with newly generated or published data of 11 modern samples, thus creating a dataset of 55 <span>P. tetradactylus</span> individuals covering most of the species’ distribution.Phylogenetic reconstruction with 11 nuclear loci in conjunction with mostly complete mitochondrial genomes reveals multiple deeply divergent and formerly unknown lineages within this monotypic genus, highlighting the need for a taxonomic revision. Furthermore, we can show that the assumed allopatric distribution of <span>P. tetradactylus</span> in Central Africa most likely represents a sampling artifact. Biogeographic character mapping indicates that the African forest system and its dynamics through climate fluctuations shaped the evolutionary and biogeographic history of this taxon. We show that lineages within <span>Petrodromus</span> that were able to adapt to dryer woodland ecosystems are much more widely distributed than lineages restricted to moist forest systems. The evolution and radiation of the four-toed sengi (<span>P. tetradactylus</span>) mirrors the patterns of its distant relative, the giant sengis (<span>Rhynchocyon</span>) in both ecotype variation and overall distribution, implying a significant influence of climate and landscape features in shaping diversification.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"42cb2650e314529434007fa5f84d0f40f86ff680bb0ff1b698ff3c2628da1460","category":"Environment"}