{"title":"รัฐศักดินา","link":"https://markpeak.net/thailand-feudalism/","date":1632378982000,"content":"<p><em>ภาพจาก<a href=\"https://twitter.com/CrusaderKings/status/1438518043580186624/photo/1\">เกม Crusader Kings III (Twitter)</a></em></p>\n<p>“รัฐไทยยังอยู่ในยุคฟิวดัล ไม่ได้ออกจากยุคมืดเลย” เป็นประโยคที่ผมใช้เปรียบเปรยแบบขำๆ ในหมู่เพื่อนฝูงแบบไม่ได้คิดอะไรมากนัก</p>\n<p>แต่เมื่อคนระดับธงชัย วินิจจะกูล ออกมาพูดในประเด็นเดียวกัน (อย่างเป็นระบบกว่ามาก) ก็ควรค่าแก่การมาบันทึกไว้</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://prachatai.com/journal/2021/09/94971\">\n\t\t\t\t\t<img src=\"https://live.staticflickr.com/65535/49639414971_739cb2b56e_h.jpg\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://prachatai.com/journal/2021/09/94971\">\n\t\t\tธงชัย วินิจจะกูล: ประชาชนในรัฐศักดินาใหม่ของเจ้านายเหนือหัว\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://prachatai.com/journal/2021/09/94971\">\n\t\t\t<p>ธงชัย วินิจจะกูล เสนอว่ารัฐไทยปัจจุบันมีสภาพถอยหลังคล้ายกับรัฐศักดินาโบราณ เป็นเครือข่ายอุปถัมภ์ตามลำดับชั้น คุณค่าหลักของระบบนี้คือความจงรักภักดี โดยรัฐรับผิดชอบต่อเจ้านายเหนือหัว มิใช่ประชาชน ส่วนความกินดีอยู่ดีสำคัญน้อยกว่าความมั่นคงของศักดินา ประชาชนจึงทำได้แค่รอรับเมตตารัฐศักดินาคือระบบมาเฟียที่พัฒนาที่สุด เป็นการปกป้องคุ้มครองคนในอาณัติ</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://prachatai.com/sites/default/files/pct_index.jpg\" />\t\tprachatai.com\t</div>\n</div>\n<p>ประเด็นเรื่องรัฐศักดินา ในที่นี้มีความหมายรวมๆ คือ feudal state ทั่วไป (ซึ่งส่วนใหญ่จะหมายถึงยุโรปยุคกลาง) ธงชัยให้คำนิยามไว้ดังนี้</p>\n<blockquote><p>ธงชัยอธิบายว่ารัฐศักดินาไม่ว่าที่ไหนในโลกหากเปรียบอย่างง่ายๆ ก็คือระบบมาเฟียที่พัฒนาถึงที่สุด หมายความว่าเป็นระบบอำนาจที่ผูกติดกับตัวบุคคลเฉกเช่นเดียวกับรัฐศักดินา แต่สิ่งหลังพัฒนาให้อำนาจดิบแปรเปลี่ยนเป็นอำนาจศักดิ์สิทธิ์ เป็นอุดมการณ์ที่ทำให้เชื่อว่าอำนาจการคุ้มครองแบบดิบๆ อย่างระบบมาเฟียเป็นอำนาจที่ชอบธรรม เถลิง เฉลิมฉลอง ยกย่อง เชิดชู สรรเสริญ จนหมดสิ้นความรู้สึกว่าเป็นอำนาจดิบของคนหนึ่งคน</p>\n<p>“ระบบมาเฟียถือว่าตัวเองให้ความคุ้มครองแก่ประชาชนในท้องถิ่นหนึ่งๆ เขาเรียกว่าให้ความคุ้มครอง เวลาเรียกภาษีส่วย เขาเรียกว่าเก็บค่าคุ้มครอง รัฐศักดินาถือว่าตัวเองปกป้องคุ้มครอง แผ่บารมีคุ้มหัวราษฎรให้อยู่ในความสงบเรียบร้อย ระเบียบสังคม ระเบียบศีลธรรมอันดีงาม เขาใช้คำว่าคุ้มครองเหมือนกัน พูดง่ายๆ รัฐศักดินาไม่สนใจการทำนุบำรุงความเจริญให้ก้าวหน้า คือไม่ใช่ไม่สนใจเลย อาจจะเป็นเรื่องรอง รองมากรองน้อยแล้วแต่รัชสมัย แต่หลักๆ priority สำคัญที่สุดก็คือคุ้มครองให้สังคมสงบ คุ้มครองในความเห็นของเจ้าศักดินา รัฐศักดินาทำหน้าที่ไม่ต่างกับมาเฟีย ต่างกันแต่เพียงว่าเขาไม่ได้ใช้อำนาจดิบ แต่เขาใช้บารมี ใช้มหากรุณาธิคุณ”</p></blockquote>\n<p>หากเราเทียบระบบมาเฟียทั่วไป ที่มอบ “ความสงบเรียบร้อย” (order) ให้กับคนในอาณัติของตัวเอง การันตีว่าถ้าหากมีใคร ไม่ว่าจะเป็นคนนอกหรือคนในก็ตาม มาสร้างความรุนแรง ความไม่ปลอดภัยในชีวิตและทรัพย์สิน มาเฟียผู้ปกครองจะ “จัดการให้” โดยมีค่าตอบแทนคือ “ส่วย” “ค่าคุ้มครอง” หรือ “ภาษี” แล้วแต่จะเรียก</p>\n<p>ส่วนการใช้บารมีเพื่อปกครอง ผมมองว่าเป็นต้นทุนการจัดการที่มีประสิทธิภาพเหนือกว่าการใช้กำลัง หากเราใช้กรอบคิด “เรื่องเล่า” ตามแบบของ Yuval Harrari คนเขียน Sapiens ก็เป็นเรื่องเดียวกัน คือ ประดิษฐ์เรื่องเล่า เรื่องสมมติขึ้นมา เพื่อให้คนในสังคมคล้อยตามกัน โดยไม่ต้องใช้กำลังบังคับ</p>\n<blockquote><p>“รัฐปัจจุบันทำตัวเป็นศักดินาใหม่ จะเรียกว่าเจ้าขุนมูลนายก็ได้ คืออ้างบุญคุณสารพัด แต่บุญคุณสำคัญที่สุดคือรักษาความสงบ เวลามีปัญหา การทำนุบำรุงความเจริญ จัดการเรื่องโควิดเฮงซวยอย่างไรก็เป็นเรื่องรอง เรื่องหลักคือการรักษาความสงบ รัฐศักดินาเชื่อว่าตัวเองเป็นผู้มีบุญบารมี ปกครองโดยบุญบารมี จะโหดร้ายสักแค่ไหน จะจารีตนครบาลแบบไหนก็เพื่อจรรโลงการปกครองของผู้มีบุญบารมี</p>\n<p>“รัฐเจ้าขุนมูลนายปัจจุบันเชื่อว่าตนเองเป็นคนดีที่สูงกว่าคนอื่น ต้องปกครองด้วยคนดี จำได้ไหมครับ ประโยคที่กล่าวทำนองว่าต้องทำทุกอย่างเพื่อให้เป็นการปกครองของคนดี อย่าให้คนไม่ดีมามีอำนาจได้ อันนี้ศักดินาเต็มตัวเลย ไม่ว่าคนดีจะใช้วิธีการที่ป่าเถื่อนอย่างไร รวมทั้งเหนือกฎหมายก็ต้องทำเพื่อให้การปกครองอยู่ในมือของคนดี เปลี่ยนคำว่าคนดีเป็นผู้มีบุญบารมีแค่นั้น เหมือนรัฐศักดินาหมดเลย</p></blockquote>\n<p>อีกประเด็นคือ ความสัมพันธ์แบบ hierarchy ต่อกันไปเป็นชั้นๆ หากไปดูตามหนังมาเฟีย (อย่าง The Godfather) หรือโครงสร้างองค์กรขนาดใหญ่ในปัจจุบัน (เช่น ระบบ downline ของวงการขายตรง) ก็เป็นการจัดโครงสร้างองค์กรเป็น unit ย่อยที่บริหารตัวเองได้ และส่งต่อคุณค่า-ความสัมพันธ์กันเป็นลำดับชั้นเช่นกัน</p>\n<p>ในระบบขายตรง การความสัมพันธ์ที่ส่งต่อกันอาจเป็นค่าตอบแทนที่เป็นตัวเงิน แต่พอเป็นการปกครองที่เน้นเรื่อง order ของโครงสร้างสังคมเหนือสิ่งอื่นใด สิ่งที่ส่งต่อกันเป็นชั้นๆ จึงเป็นความภักดี ตามที่ธงชัยเขียนไว้</p>\n<p>หมายเหตุ: ธงชัยเคยอธิบายเรื่องคุณลักษณะ “ลำดับชั้น” ของสังคมไทยที่มีความเป็น organic society แบบพุทธด้วย <a href=\"https://markpeak.net/modernity-in-siam/\">เคยเขียนบล็อกถึงเรื่องนี้ไว้</a></p>\n<blockquote><p>“ทั้งศักดินาเก่าและใหม่เป็นรัฐที่ขึ้นกับเครือข่ายอุปถัมภ์ระหว่างบุคคลเป็นชั้นๆ จากล่างขึ้นไปถึงเจ้าของศูนย์กลาง ค่าของคน value คุณค่าของความสัมพันธ์อันนี้ที่สำคัญที่สุด ไม่ได้อยู่ตรงที่การประกอบกรรมความดี ถึงแม้เขาจะพยายามทำสิ่งที่ดี รวมทั้งจิตอาสาทั้งหลาย คุณค่าสำคัญที่สุดอยู่ที่ความจงรักภักดี เพราะฉะนั้นจิตอาสาในแบบบวกหรือจิตอาสาในแบบลบ เช่นกำจัดยาเสพติดด้วยวิธีการป่าเถื่อนก็อาจจะยอมได้ ถ้าคุณจงรักภักดีจริง ดูกันไปก็แล้วกันนะว่าจะพ้นผิดลอยนวลหรือว่าจะลงโทษอย่างเบาๆ ก็ว่ากันไป</p>\n<p>“ความจงรักภักดีหมายถึงอะไร ความจงรักภักดีหมายถึงการทำตามคำสั่งความต้องการของนายเหนือหัวเป็นชั้นๆ ขึ้นไป รัฐราชการที่เป็นเสมือนสมบูรณาญาสิทธิ์ในปัจจุบันจึงเป็นวัฒนธรรมของระบบราชการ ผมเห็นว่าวัฒนธรรมระบบราชการปัจจุบันเปลี่ยนและต่างไปจากวัฒนธรรมระบบราชการในสมัยที่ผ่านมาอย่างมาก ผมไม่กล้าบอกว่านี่ไม่ใช่ระบบราชการ ผมว่านี่ยังเป็นรัฐราชการ เป็นระบบราชการอยู่ แต่สิ่งที่ต่างก็คือปัจจุบันเต็มไปด้วยการรอคำสั่งนาย จากล่างถึงนายก นายไม่สั่งไม่กล้าทำ นายสั่งอะไรก็ถูกหมด เป็นรัฐราชการที่มีลักษณะผูกติดกับตัวบุคคล very personal อย่างยิ่ง ยิ่งกว่ารัฐราชการยุคก่อนๆ ซึ่งระบบราชการและ technocrat มีสิทธิ์ มีเสียง มีอำนาจ มีอิทธิพล ผลักดันการเปลี่ยนแปลงมากกว่านี้ ปัจจุบันไม่ว่าใครจะเสนอ เทคโนแครตที่ไหน ลงท้ายอย่างเดียวก็คือนายกฯ ว่าอย่างไร</p></blockquote>\n<p>ส่วนจุดสูงสุดของการปกครองอยู่ที่ “พลังศักดิ์สิทธิ์”</p>\n<p>ตัวอย่างที่ดีของ “พลังศักดิ์สิทธิ์” ที่ใช้ปกครองคนในรัฐศักดินาคือ แนวคิดเรื่อง “อาณัติสวรรค์” ของจีน (เทียนเซี่ย – <a href=\"https://en.wikipedia.org/wiki/Tianxia\">Tianxia</a> – ภาษาอังกฤษมักแปลว่า All Under Heaven ถ้าแปลไทยคือ “ใต้หล้า”) ที่มองว่าฮ่องเต้ (หรือตระกูลฮ่องเต้) ได้รับอำนาจจากฟ้า (ที่ยิ่งใหญ่กว่าคนบนโลก) ให้มาปกครอง</p>\n<p>ภายหลังการเปลี่ยนแปลงราชวงศ์ ขุนนางหรือขุนศึกลุกขึ้นมาปฏิวัติ โค่นราชวงศ์ก่อนหน้าลง ก็สามารถอธิบายได้ว่า “อาณัติสวรรค์เปลี่ยนแปลงแล้ว” ไม่สนับสนุนราชวงศ์ก่อนอีกต่อไป <a href=\"https://www.facebook.com/permalink.php?story_fbid=380441586779282&amp;id=100044403310217\">เรื่องนี้ในเพจ Starless Night ของคุณ Harit อธิบายไว้ละเอียด</a></p>\n<blockquote><p>“รัฐศักดินาไม่ accountable ต่อประชาชน หมายถึงเขาไม่ต้องรายงาน ไม่ต้องหวั่นเกรงการรับผิดรับชอบกับประชาชน การกระทำต่างๆ ไม่ต้องแคร์ประชาชน เพราะความชอบธรรมไม่ได้มาจากประชาชน ความชอบธรรมของรัฐศักดินาแต่โบราณมาจากพลังศักดิ์สิทธิ์ทั้งหลาย การดูแลทุกข์สุขของราษฎรเป็นเพียงแค่พฤติกรรม คุณดูแลราษฎรได้ดีหรือไม่ดีอาจจะทำให้พลังศักดิ์สิทธิ์ไม่พอใจแล้วลงโทษคุณ ลงโทษกษัตริย์ศักดินา แต่ว่าสิ่งที่กษัตริย์เขาแคร์คือพลังศักดิ์สิทธิ์เหล่านั้นเห็นว่าเขายังควรอยู่ในอำนาจหรือไม่ อันนี้รัฐศักดินาแต่โบราณเป็นอย่างนั้น</p></blockquote>The post <a href=\"https://markpeak.net/thailand-feudalism/\">รัฐศักดินา</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"42cdf4f0772527b55174f5f891fd50aae6cfb9949a1f8b098b61c3d3f9c08c77","category":"Thai"}