{"title":"Factors shaping network emergence: A cross-country comparison of quality of care networks in Bangladesh, Ethiopia, Malawi, and Uganda","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001839","date":1721743200000,"content":"<p>by Yusra Ribhi Shawar, Nehla Djellouli, Kohenour Akter, Will Payne, Mary Kinney, Kasonde Mwaba, Gloria Seruwagi, Mike English, Tanya Marchant, The QCN Evaluation Group , Jeremy Shiffman, Tim Colbourn</p>\r\n\r\nThe Quality-of-Care Network (QCN) was conceptualized by the World Health Organization (WHO) and other global partners to facilitate learning on and improve quality of care for maternal and newborn health within and across low and middle-income countries. However, there was significant variance in the speed and extent to which QCN formed in the involved countries. This paper investigates the factors that shaped QCN’s differential emergence in Bangladesh, Ethiopia, Malawi, and Uganda. Drawing on network scholarship, we conducted a replicated case study of the four country cases and triangulated several sources of data, including a document review, observations of national-level and district level meetings, and key informant interviews in each country and at the global level. Thematic coding was performed in NVivo 12. We find that QCN emerged most quickly and robustly in Bangladesh, followed by Ethiopia, then Uganda, and slowest and with least institutionalization in Malawi. Factors connected to the policy environment and network features explained variance in network emergence. With respect to the policy environment, pre-existing resources and initiatives dedicated to maternal and newborn health and quality improvement, strong data and health system capacity, and national commitment to advancing on synergistic goals were crucial drivers to QCN’s emergence. With respect to the features of the network itself, the embedding of QCN leadership in powerful agencies with pre-existing coordination structures and trusting relationships with key stakeholders, inclusive network membership, and effective individual national and local leadership were also crucial in explaining QCN’s speed and quality of emergence across countries. Studying QCN emergence provides critical insights as to why well-intentioned top-down global health networks may not materialize in some country contexts and have relatively quick uptake in others, and has implications for a network’s perceived legitimacy and ultimate effectiveness in producing stated objectives.","author":"Yusra Ribhi Shawar","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"42d277d915c77267ac8a8eb01835d3320b8d3bf0c063577a54302f4aba52024d","category":"Environment"}