{"title":"Functional traits and size interact to influence growth and carbon sequestration among trees in urban greenspaces","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14505?af=R","date":1705917843000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/4f4b477f-ae94-4740-98f2-3f640e615469/fec14505-toc-0001-m.png\" alt=\"Functional traits and size interact to influence growth and carbon sequestration among trees in urban greenspaces\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/10/carbon-accumulation-and-growth-among-urban-trees-is-explained-by-a-complex-relationship-between-traits-and-tree-size/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThere is persistent uncertainty about how integrated plant functions, like growth, are mechanistically constrained and practically predicted by functional traits. For trees, these knowledge gaps persist for two reasons: First, studies of ‘natural’ forests are observational, with highly variable and confounding resource limitation and competition; second, most studies investigate only a few popular traits and ignore context-dependencies in trait effects on growth (e.g. trait–environment or trait–ontogeny interactions).\n\nWe assessed 17 traits as predictors of radial growth and aboveground carbon sequestration for 182 trees, including individuals of 42 species common to temperate cities. By focusing exclusively on planted trees growing in isolation, our unique study is a pseudo-experiment that spans a large range of taxonomic and trait variability, and minimizes confounding effects of environmental heterogeneity (e.g. shifts in light availability with tree size). Focal traits included not only commonly measured traits related to leaf economics and plant size, but also wood traits and whole-plant phenology.\n\nModels with indices of tree ontogeny (size) and traits explained 80% and 72% of variability in relative growth and carbon sequestration, respectively, and traits accounted for ~20% of the variation. Traits related to said tree functions included leaf dry matter content (<i>LDMC</i>), leaf N content, mature height, wood anatomy and phenology. <i>LDMC</i> was positively correlated with wood growth and C sequestration across all size classes, while the positive effects of leaf N, mature height and wood density were only apparent for smaller trees. Ring-porous species had higher rates of growth and C sequestration than diffuse-porous species.\n\nConsistent with recent theory, growth rates of isolated, urban trees vary as function of simple and interactive effects of traits and size. Our findings are useful for optimizing reforestation efforts in temperate cities, where planners and land managers can select species for rapid growth and C sequestration using freely available data for the ‘effect’ traits we identified, including wood anatomy and density, leaf N, and <i>LDMC</i>. Lastly, the trait–growth relationships we describe here may reflect those of ‘naturally’ isolated trees growing in savannas and/or woodlands and provide an insightful frame of reference for trees in closed-canopy forests.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/10/carbon-accumulation-and-growth-among-urban-trees-is-explained-by-a-complex-relationship-between-traits-and-tree-size/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Milos Simovic, \nKevin E. Mueller, \nSean M. McMahon, \nJuliana S. Medeiros","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"42d526b1d5aa59b30805fe5bea2536114716eb1aebf9ea2ebb11e40418b3de38","category":"Environment"}