{"title":"Amazon EBS io2 Block Express Volumes with Amazon EC2 R5b Instances Are Now Generally Available","link":"https://aws.amazon.com/blogs/aws/amazon-ebs-io2-block-express-volumes-with-amazon-ec2-r5b-instances-are-now-generally-available/","date":1626727564000,"content":"<p>At AWS re:Invent 2020, we <a href=\"https://aws.amazon.com/blogs/aws/now-in-preview-larger-faster-io2-ebs-volumes-with-higher-throughput/\">previewed Amazon EBS io2 Block Express volumes</a>, the next-generation server storage architecture that delivers the first SAN built for the cloud. Block Express is designed to meet the requirements of the largest, most I/O-intensive, mission-critical deployments of Microsoft SQL Server, Oracle, SAP HANA, and SAS Analytics on AWS.</p> \n<p>Today, I am happy to announce the general availability of Amazon EBS io2 Block Express volumes, with Amazon EC2 <a href=\"https://aws.amazon.com/blogs/aws/new-amazon-ec2-r5b-instances-providing-3x-higher-ebs-performance/\">R5b instances</a> powered by the <a href=\"https://aws.amazon.com/jp/ec2/nitro/\">AWS Nitro System</a> to provide the best network-attached storage performance available on EC2. The io2 Block Express volumes now also support io2 features such as <a href=\"https://aws.amazon.com/blogs/aws/new-multi-attach-for-provisioned-iops-io1-amazon-ebs-volumes/\">Multi-Attach</a> and <a href=\"https://aws.amazon.com/blogs/aws/amazon-ebs-update-new-elastic-volumes-change-everything/\">Elastic Volumes</a>.</p> \n<p>In the past, customers had to stripe multiple volumes together in order go beyond single-volume performance. Today, io2 volumes can meet the needs of mission-critical performance-intensive applications without striping and the management overhead that comes along with it. With io2 Block Express, customers can get the highest performance block storage in the cloud with four times higher throughput, IOPS, and capacity than io2 volumes with sub-millisecond latency, at no additional cost.</p> \n<p>Here is a summary of the use cases and characteristics of the key Solid State Drive (SSD)-backed EBS volumes:</p> \n<table> \n <tbody> \n  <tr> \n   <td></td> \n   <td><strong>General Purpose SSD</strong></td> \n   <td><strong>Provisioned IOPS SSD</strong></td> \n  </tr> \n  <tr> \n   <td><strong>Volume type</strong></td> \n   <td>gp2</td> \n   <td>gp3</td> \n   <td>io2</td> \n   <td>io2 Block Express</td> \n  </tr> \n  <tr> \n   <td><strong>Durability</strong></td> \n   <td>99.8%-99.9% durability</td> \n   <td>99.999% durability</td> \n  </tr> \n  <tr> \n   <td><strong>Use cases</strong></td> \n   <td>General applications, good to start with when you do not fully understand the performance profile yet</td> \n   <td>I/O-intensive applications and databases</td> \n   <td>Business-critical applications and databases that demand highest performance</td> \n  </tr> \n  <tr> \n   <td><strong>Volume size</strong></td> \n   <td>1 GiB – 16 TiB</td> \n   <td>4 GiB – 16 TiB</td> \n   <td>4 GiB – 64 TiB</td> \n  </tr> \n  <tr> \n   <td><strong>Max IOPS </strong></td> \n   <td>16,000</td> \n   <td>64,000 **</td> \n   <td>256,000</td> \n  </tr> \n  <tr> \n   <td><strong>Max throughput </strong></td> \n   <td>250 MiB/s *</td> \n   <td>1,000 MiB/s</td> \n   <td>1,000 MiB/s **</td> \n   <td>4,000 MiB/s</td> \n  </tr> \n </tbody> \n</table> \n<p><small>* The throughput limit is between 128 MiB/s and 250 MiB/s, depending on the volume size.<br /> ** Maximum IOPS and throughput are guaranteed only on <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/instance-types.html#ec2-nitro-instances\">instances built on the Nitro System</a> provisioned with more than 32,000 IOPS.</small></p> \n<p>The new Block Express architecture delivers the highest levels of performance with sub-millisecond latency by communicating with an AWS Nitro System-based instance using the Scalable Reliable Datagrams (SRD) protocol, which is implemented in the Nitro Card dedicated for EBS I/O function on the host hardware of the instance. Block Express also offers modular software and hardware building blocks that can be assembled in many ways, giving you the flexibility to design and deliver improved performance and new features at a faster rate.</p> \n<p><strong><u>Getting Started with io2 Block Express Volumes</u></strong><br /> You can now create io2 Block Express volumes in the <a href=\"https://console.aws.amazon.com/ec2\">Amazon EC2 console</a>, <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (AWS CLI)</a>, or using an SDK with the Amazon EC2 API when you create R5b instances.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/07/18/2021-io2-blockexpress-1.png\" /></p> \n<p>After you choose the EC2 R5b instance type, on the <strong>Add Storage</strong> page, under <strong>Volume Type</strong>, choose <strong>Provisioned IOPS SSD (io2)</strong>. Your new volumes will be created in the Block Express format.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/07/18/2021-io2-blockexpress-2.png\" /></p> \n<p><strong><u>Things to Know</u></strong><br /> Here are a couple of things to keep in mind:</p> \n<ul> \n <li>You can’t modify the size or provisioned IOPS of an io2 Block Express volume.</li> \n <li>You can’t launch an R5b instance with an encrypted io2 Block Express volume that has a size greater than 16 TiB or IOPS greater than 64,000 from an unencrypted AMI or a shared encrypted AMI. In this case, you must first create an encrypted AMI in your account and then use that AMI to launch the instance.</li> \n <li>io2 Block Express volumes do not currently support fast snapshot restore. We recommend that you initialize these volumes to ensure that they deliver full performance. For more information, see <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ebs-initialize.html\">Initialize Amazon EBS volumes</a> in Amazon EC2 User Guide.</li> \n</ul> \n<p><strong><u>Available Now</u></strong><br /> The io2 Block Express volumes are available in all AWS Regions where R5b instances are available: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Tokyo), Europe (Frankfurt), with support for more AWS Regions coming soon. We plan to allow EC2 instances of all types to connect to io2 Block Volumes, and will have updates on this later in the year.</p> \n<p>In terms of pricing and billing, io2 volumes and io2 Block Express volumes are billed at the same rate. Usage reports do not distinguish between io2 Block Express volumes and io2 volumes. We recommend that you use tags to help you identify costs associated with io2 Block Express volumes. For more information, see the <a href=\"http://aws.amazon.com/ebs/pricing/\">Amazon EBS pricing</a> page.</p> \n<p>To learn more, visit the <a href=\"https://aws.amazon.com/ebs/provisioned-iops/\">EBS Provisioned IOPS Volume</a> page and <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ebs-volume-types.html#io2-block-express\">io2 Block Express Volumes</a> in the Amazon EC2 User Guide.</p> \n<p>– <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"42daec56a010292fcc3de6120ad62201f406f4f606f8f975dc7b2eb40f5a2d9d","category":"Tech"}