{"title":"Polyphenol Antioxidants in Savory and Other Snacks","link":"https://www.preprints.org/manuscript/202408.1880/v1","date":1724679410000,"content":"Whole grain consumption in the US has increased due to the introduction of whole grains initially in breakfast cereals and then in snacks.   Most people consider fiber as the health benefit of eating whole grains since it inhibits the absorption of fats and sugar in the GI tract.  Polyphenols, the major antioxidants in the US diet, are primarily covalently bound to the fiber matrix of grains that are broken during digestion.  Human biomarkers have been found after cereal grain consumption, thus proving bioavailabilty of polyphenols. Savory snacks (n=32) studied included potato chips, tortilla chips, pretzels and crackers. The snacks contained as the first ingredient enriched wheat, whole wheat, corn, potatoes, and beans. We have used both a Folin and ferric reducing antioxidant power (FRAP) colorimetric method with catechin as the standard for the commercial snack assays.  Total polyphenols were analyzed after basic hydrolysis.  Maximum bio-accessible polyphenols were measured after sample hydrolysis simulating in vivo digestion.  FRAP measurements were done on the same samples. FRAP total antioxidant capacity values were significantly higher than Folin total polyphenols but followed the same trends and were highly correlated. Digestion significantly decreased both polyphenols and antioxidant capacity. Whole grain snacks, defined as having &amp;gt; 50% whole grains, had significantly more polyphenols (7 times) than enriched grain snacks. Savory snack Folin polyphenols after in vitro digestion averaged 64% of the total polyphenol value.  This indicates polyphenol bio-accessibility might be favorable after snack consumption. Using published data and this work, the order of total polyphenols in all snacks is nuts &amp;gt;&amp;gt; dried fruits &amp;gt; popcorn &amp;gt; pretzels &amp;gt; tortilla chips &amp;gt; crackers &amp;gt; potato chips. Potato chips are the most consumed snack but are lowest in polyphenols antioxidants","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"42e2003feb9b4f3767f7b48caa68242fe75ea2b70b4249d6e8be12f695911b08","category":"Interdisciplinary"}