{"title":"Long‐term monitoring of the microbial quality and Legionnaires' disease risk in tap water from mass catering establishments","link":"https://onlinelibrary.wiley.com/doi/10.1111/wej.12899?af=R","date":1707382863000,"content":"<h2>Abstract</h2>\n<p>Legionnaires' disease is caused by <i>Legionella (L.) pneumophila</i>. Inhaling aerosolized water containing this bacteria is the most common transmission route. Shower heads used in the catering industry's dishwashing units are also potential amplifying systems for bacteria and possible sources of infection by generating droplets and aerosols. Therefore, these systems should not contain pathogenic bacteria. This study aims to monitor the microbial quality, Legionnaires' disease risk and <i>L. pneumophila</i> presence in tap water samples from the water outlet of the shower-type dishwashing unit of mass catering establishments for a year. Seventy-two tap water samples were microbiologically tested for total mesophilic aerobic bacteria count, coliform, <i>Escherichia (E.) coli</i> and <i>L. pneumophila</i>. DNA was isolated from <i>L. pneumophila</i>-positive samples, and their serogroup was characterized by real-time PCR. The correlation between seasonal variation and prevalence of <i>L. pneumophila</i> serogroup and <i>L. pneumophila</i> and other indicator bacteria were statistically tested by Spearman rank test (<i>p</i> &lt; 0.05). Findings showed that 17 (24%) samples had microbial growth, 14 (19.4%) were positive for <i>L. pneumophila</i> and 13 isolates were characterized as <i>L. pneumophila</i> serogroup 1. The statistical analysis showed no significant correlation between seasonal variation (<i>p</i> = 0.491) and <i>L. pneumophila</i> and total mesophilic aerobic bacteria count, coliform and <i>E. coli</i> (<i>p</i> = 0.923). Overall, <i>Legionella</i> spp. is an essential indicator of the microbial quality in the tap water from mass catering establishments and should be regularly monitored for public health independently from seasonal variation and other indicator bacteria.</p>","author":"Murat Ay","siteTitle":"Wiley: Water and Environment Journal: Table of Contents","siteHash":"b8106c59269b0bf6595ebcba72d4376e8b07e3df9f0e7d2a7b1cfbc109aa602a","entryHash":"42e599632e7986cb744e5a1a880608ce072bfb76b7ecbfb682d33068c39e4223","category":"Environment"}