{"title":"The heat is on: sensitivity of goldsinny wrasse to global climate change","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae068/7815629?rss=1","date":1728345600000,"content":"<span><div>Abstract</div>Unsustainable harvesting practices have drastically reduced fish populations globally and developments in aquaculture have increased. Unexpectedly, Atlantic salmon farming caused the opening of a new fishery in northern European countries, where previously unharvested mesopredatory species, like the goldsinny wrasse (<span>Ctenolabrus rupestris</span>), are captured for use as cleaner fish in pens along the coast and fjords. The goldsinny wrasse is widespread in coastal areas where it plays an ecologically important role as a predator of small invertebrates. Since climate change effects are particularly pronounced in coastal waters, it becomes urgent to understand how fish like the goldsinny will respond to global climate change, including the increasing frequency and intensity of marine heatwaves (MHWs), ocean freshening (OF) and ocean acidification (OA). To address this, we conducted a multi-stressor experiment exposing adult goldsinny to each stressor individually, as well as to all three combined. The results indicated that the goldsinny is highly affected by MHWs and extremely sensitive to a multi-stressor environment, with 34% and 53% mortality, respectively. Additionally, exposure to a MHW event, OF and multi-stressor conditions affected fish metabolism, with the highest standard metabolic- and maximum metabolic-oxygen consumption rates observed for the MHW treatment. Increases in oxidized glutathione (GSSG) and percent oxidized glutathione (% GSSG) in the livers, indicative of oxidative stress, were also seen in the MHW, OF and multi-stressor treatments. As a single stressor, OA showed no significant impacts on the measured parameters. This information is important for conservation of coastal marine environments, given the species’ important role in shallow-water habitats and for management of goldsinny or other mesopredatory fish harvested in coastal ecosystems. The sensitivity of the goldsinny wrasse to future stressors is of concern, and any potential reductions in abundance as a result of climate change may lead to cascade effects with ecosystem-wide consequences.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"430002b7bd48d4d011366b651beb39f185e7f85522c1d8ebcd4aad2e17730fea","category":"Environment"}