{"title":"A novel cellobiose 2‐epimerase from anaerobic halophilic Iocasia fonsfrigidae and its ability to convert lactose in fresh goat milk into epilactose","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13680?af=R","date":1719047009000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Cellobiose 2-epimerase (CE) has received great attention due to its potential applications in the food and pharmaceutical industries. In this study, a novel CE from mesophilic anaerobic halophilic bacterium <i>Iocasia fonsfrigidae</i> strain SP3-1 (IfCE) was successfully expressed in <i>Escherichia coli</i> and characterized.</p>\n<h2>RESULTS</h2>\n<p>Unlike other CEs, the purified IfCE shows only epimerization activity toward <i>β</i>-1,4-glycosidic linkages of disaccharides, including mannobiose, cellobiose and lactose, but not for monosaccharides, <i>β</i>-1,4-glycosidic linkages of trisaccharides and <i>α</i>-1,4-glycosidic linkages of disaccharides. Only one epimerization product was obtained from the action of IfCE against mannobiose, cellobiose and lactose. Under optimum conditions, 31.0% of epilactose, a rare and low-calorie prebiotic sweetener with medicinal and pharmacological properties, was obtained from 10 mg mL<sup>−1</sup> lactose. IfCE was highly active against lactose under NaCl concentrations up to 500 mmol L<sup>−1</sup>, possibly due to the excessive basic (arginine and lysine) and acidic (aspartic and glutamic acids) amino acid residues, which are localized on the surface of the halophilic enzyme structure. These residues may protect the enzyme from Cl<sup>−</sup> and Na<sup>+</sup> ions from the environment, respectively. Under normal conditions, IfCE was able to convert lactose present in fresh goat milk to epilactose with a conversion yield of 31% in 10 min. In addition, IfCE has been investigated as a safe enzyme for human allergen.</p>\n<h2>CONCLUSION</h2>\n<p>The results suggested that IfCE is a promising candidate to increase the quality and value of milk and dairy products by converting lactose that causes digestive problems in people with lactose intolerance into epilactose. © 2024 Society of Chemical Industry.</p>","author":"Sokhoeun Eat, \nShinta Wulansari, \nPrattana Ketbot, \nRattiya Waeonukul, \nPatthra Pason, \nAyaka Uke, \nAkihiko Kosugi, \nKhanok Ratanakhanokchai, \nChakrit Tachaapaikoon","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"43020d96546652995fb8e3f7b28c91a04eea66d834100acb08be3d556950ee5d","category":"Environment"}