{"title":"NaCl Modifies Biochemical Traits in Bacterial Endophytes Isolated from Halophytes: Towards Salinity Stress Mitigation Using Consortia","link":"https://www.preprints.org/manuscript/202403.1281/v1","date":1711025682000,"content":"Bacterial endophytes (120) were isolated from six halophytes (Distichlis spicata, Cynodon dactylon, Eragrostis obtusiflora, Suaeda torreyana, Kochia scoparia, and Baccharis salicifolia). These halophiles were molecularly identified and characterized with or without NaCl conditions. Characterization was based on tests such as indole acetic acid (IAA), exopolysaccharides (EPS), and siderophores (SID) production; solubilization of phosphate (P), potassium (K), zinc (Zn), and manganese (Mn); mineralization of phytate; enzymatic activity (acid and alkaline phosphatase, phytases, xylanases, and chitinases) and mineralization/solubilization mechanisms involved (organic acids and sugars). Eleven halophiles (tolerated NaCl 2.5 M) were identified as Oceanobacillus sp. (1), Bacillus sp. (2), Nesterenkonia sp. (3), Bacillus velezensis (4), Halobacillus sp. (5), Oceanobacillus sp. (6), B. velezensis (7) Halomonas sp. (8), B. pumilus (9), Pseudomonas sp. (10) and Oceanobacillus sp. (11). Biochemical responses of nutrient solubilization and enzymatic activity varied between bacteria and the presence of NaCl. Organic acids were involved in P-mineralization and nutrient solubilization. Tartaric acid was common in the solubilization of P, Zn, and K. Maleic and vanillic acid were only detected in Zn and K solubilization, respectively. Moreover, sugars appeared to be involved in the solubilization of nutrients; fructose was detected in solubilization tests. Therefore, these bacteria should be tested as a consortium to mitigate saline stress in glycophytes under a global climate change scheme that threatens to exacerbate soil salinity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4309079ab9b9bec6c57659e98f1e38ea5b4e258ec1743dbdefb95e66af0d3a85","category":"Interdisciplinary"}