{"title":"Advancing Mountainscape Diversity, Functioning, and Disturbance Dynamics Studies with Hyperspectral Imaging Requires a Focus on Plant Traits, Soil-Rock Attributes, and Landsliding","link":"https://www.preprints.org/manuscript/202410.0558/v1","date":1728370647000,"content":"The global biodiversity crisis has emphasized the unique contribution of functional diversity to ecosystem function, stability, and resilience. In this regard, the increasing availability of remotely sensed data together with the development of new sensors and approaches has the potential to improve our ability to quantify and monitor ecosystem traits and functions at unprecedent spatial, temporal, and spectral scales. In particular, air- and spaceborne hyperspectral data are making possible the measurement of plant-level functional traits to investigate ecosystem function and functional diversity in novel ways. In this review we pose that these developments together with similar ones focusing on soils and lithologies can help us understand relationships between functional diversity, ecosystem processes, and landsliding, and more broadly the disturbance dynamics of mountainscapes. Acknowledging the challenges associated with mountainscapes, this review 1) synthesizes broad established methods to retrieve functional traits from remotely sensed data, 2) summarizes approaches derived from remotely sensed data to characterize functional diversity and its relationships with ecosystem functioning, and 3) elaborates on how these methods and approaches can provide a needed holistic view of landslides. This holistic view recognizes the critical role that interactions between ecosystem and geomorphic processes play in the dynamics of mountainscapes mediated by landslides and the contribution of ecosystem diversity and processes to landslide susceptibility and recovery. In this “ecosystem-centered” view of landslides it might be necessary to scale from individual landslides and sites to entire landslide populations, assemblages, and landscapes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"430ee2b3856765c923b516517731cb8200f5453d29180797821e060d68647c99","category":"Interdisciplinary"}