{"title":"Apple Relocating Siri Evaluation Team in San Diego to Austin","link":"https://www.macrumors.com/2024/01/14/apple-moving-san-diego-siri-team-to-austin/","date":1705268033000,"content":"Apple is relocating a team of around 120 people focused on improving Siri in San Diego to Austin later this year, according to multiple affected employees.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/03/hey-siri-banner-apple.jpg\" width=\"1200\" height=\"630\" />\r<br />\nThe reorganization was confirmed by Apple today in a statement shared with <em>MacRumors</em>.\r<br />\n\r<br />\n\"We're bringing our Data Operations Annotations teams in the US together at our campus in Austin, where a majority of the team is already based,\" an Apple spokesperson said. \"Everyone currently employed will have the opportunity to continue their role with Apple in Austin. We are deeply committed to San Diego where we have grown significantly, and are continuing to hire as we expand our world-class engineering teams.\"\r<br />\n\r<br />\nThe news was first reported <a href=\"https://www.bloomberg.com/news/articles/2024-01-14/apple-to-shutter-121-person-san-diego-ai-team-in-reorganization\">by <em>Bloomberg</em>'s Mark Gurman</a>, who said employees in San Diego willing to relocate to Austin by June will be able to continue in their roles. The report said employees who do not relocate or find another role within Apple will receive severance pay. His report outlines many other specific details.\r<br />\n\r<br />\nWhile some other large tech companies like Google, Microsoft, and Amazon have laid off thousands of employees over the past year, Apple has so far avoided this outcome. However, it is unlikely that all affected employees in San Diego are willing to relocate over a thousand miles away to Austin, so some may be facing termination.\r<br />\n\r<br />\n\"Data Operations Annotations\" employees are primarily tasked with evaluating Siri's responses to queries from customers who have opted in to the <a href=\"https://www.macrumors.com/2019/08/28/apple-apologizes-over-siri-privacy-concerns/\">Siri grading program</a>. In the U.S., this work will continue entirely in Austin going forward. Apple has similar teams in China, Ireland, Singapore, Spain, and other countries around the world.\r<br />\n\r<br />\nApple had approximately 161,000 full-time employees as of September 30, according to a company filing last year.<div>Tag: <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/14/apple-moving-san-diego-siri-team-to-austin/\">Apple Relocating Siri Evaluation Team in San Diego to Austin</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-relocating-siri-evaluation-team-in-san-diego-to-austin.2416340/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"431239b462d2779ed925f82f48712f685184def99eb79b93fda171a0ef7e2e83","category":"Apple"}