{"title":"Bloomberg: Apple Working on Emergency Satellite Features for iPhones, 2021 Launch Unlikely","link":"https://www.macrumors.com/2021/08/30/apple-emergency-satellite-features-iphones/","date":1630361819000,"content":"Apple is working on satellite capabilities for the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> that will allow users to send texts in emergency situations, reports <em><a href=\"https://www.bloomberg.com/news/articles/2021-08-30/apple-plans-to-add-satellite-features-to-iphones-for-emergencies\">Bloomberg</a></em>. The feature would also allow ‌iPhone‌ users to report crashes and other emergencies in areas where there is no cellular coverage.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2019/12/iPhone-in-Space.jpg\" />\r\n<br />\r\nThere are at least two emergency features that will rely on satellite networks, and while satellite technology has been in the works for years, these capabilities are not likely to launch in 2021.\r\n<br />\r\n\r\n<br />\r\nThe first feature, Emergency Message via Satellite, is designed to let users text emergency services and contacts using a satellite network when there is no signal available, and it will be integrated into the Messages app as a third communications protocol alongside SMS and iMessage. It will feature gray message bubbles rather than green or blue, and message length will be restricted.<blockquote>The texting-via-satellite tool, codenamed Stewie inside Apple, will restrict messages to a shorter length. The texts will automatically push through to an emergency contact's phone, even if the do-not-disturb setting is on. One planned design will let a user send the message by typing \"Emergency SOS\" where they would usually input a contact name. In addition to delivering texts, the service may eventually be able to handle some phone calls too.</blockquote>The second feature will let users report major emergencies like plane crashes and fires using satellite networks. It will be similar to a \"911\" call in the U.S. and can provide information like a user's location and medical ID, in addition to alerting emergency contacts.\r\n<br />\r\n\r\n<br />\r\nA report over the weekend from Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> said that the <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> <a href=\"https://www.macrumors.com/2021/08/29/iphone-13-to-feature-leo-to-make-calls-and-text/\">would include</a> low earth orbit satellite communication connectivity to allow users to make calls and send messages without 4G and 5G coverage, but <a href=\"https://www.macrumors.com/2021/08/30/iphone-13-satellite-rumor-disputed/\">further analysis has indicated</a> that this suggestion is incorrect and unlikely.\r\n<br />\r\n\r\n<br />\r\nAccording to <em>Bloomberg</em>, when Apple does implement satellite connectivity, it will be limited to \"crisis scenarios\" and will not be an alternative to cellular networks that allows for widespread texting and calling.\r\n<br />\r\n\r\n<br />\r\nApple will not launch these satellite capabilities in every country, and their availability will be dependent on  local regulations and satellite locations. One built-in feature will ask users to go outdoors and walk in a specified direction to help the ‌iPhone‌ connect to a satellite. Connections may not be instantaneous, and it could take up to a minute for an ‌iPhone‌ to successfully communicate with a satellite. \r\n<br />\r\n\r\n<br />\r\nConnecting to satellites will require a special modem chip, and Apple will continue to use Qualcomm technology for the next few years. It is not clear if Apple will partner with Globalstar, as Kuo has suggested. Globalstar competitors Iridium Communications and Omnispace are not working with Apple, according to <em>Bloomberg</em>, but the report does not rule out Globalstar.\r\n<br />\r\n\r\n<br />\r\nThe satellite features are \"unlikely to be ready before next year,\" though Apple's modem chips this year could \"have the hardware needed for satellite communications.\" The functionality could be changed or scrapped prior to when Apple is planning to launch it and it has not yet been finalized. \r\n<br />\r\n\r\n<br />\r\nApple has considered launching <a href=\"https://www.macrumors.com/2019/12/20/apple-secret-team-satellites-beam-data-to-devices/\">its own satellites</a>, but the planned emergency features will rely on existing networks. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/30/apple-emergency-satellite-features-iphones/\">Bloomberg: Apple Working on Emergency Satellite Features for iPhones, 2021 Launch Unlikely</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/bloomberg-apple-working-on-emergency-satellite-features-for-iphones-2021-launch-unlikely.2309234/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=N80uNBZOrqs:zt7Bz_XOjVE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=N80uNBZOrqs:zt7Bz_XOjVE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/N80uNBZOrqs\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4313ce6b1fb5004074eccc5888043ef2cac32a2cad65cc9ba914887bb507ea98","category":"Apple"}