{"title":"Association between cardiometabolic index and testosterone levels in adult men: NHANES 2011–2016","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306401","date":1724853600000,"content":"<p>by Xuanchun Huang, Lanshuo Hu, Shiyi Tao, Tiantian Xue, Jun Li, Xuejiao Wang</p>\r\nObjective <p>Exploring the relationship between the cardiometabolic index (CMI) and serum testosterone levels as well as testosterone deficiency in American adult males. Additionally, comparing the diagnostic value of the CMI with several common obesity and metabolism indices for identifying testosterone deficiency.</p> Methods <p>This cross-sectional study was conducted using data from the National Health and Nutrition Examination Survey (NHANES) from 2011 to 2016. Serum testosterone levels and testosterone deficiency were used as dependent variables, with the cardiometabolic index as the independent variable. Multivariable regression was used to assess the relationship between the independent and dependent variables, while subgroup analyses were performed to ensure the stability of the results. Smooth curve fitting was utilized to evaluate the nonlinear relationship between the CMI and testosterone levels. Receiver operating characteristic curves (ROC) were plotted for several obesity and metabolism prediction indices and the area under the curve was calculated to compare the specificity and sensitivity of each diagnostic index in the diagnosis of testosterone deficiency.</p> Results <p>Among 3541 adult male participants, CMI is negatively associated with serum testosterone levels and positively associated with testosterone deficiency. In the fully adjusted model, for every unit increase in CMI, serum testosterone decreased by 14.89 ng/dl. Comparing the highest quartile to the lowest quartile of CMI, each unit increase in CMI, serum testosterone decreased by 98.58 ng/dl. Furthermore, each unit increase in CMI was associated with a 16% increase in incidence of testosterone deficiency. By plotting the ROC curves, we found that the AUCs for Lipid Accumulation Product (LAP), Body Mass Index (BMI), Weight Adjusted Waist Index (WWI), CMI, Visceral Adiposity Index (VAI) and Triglyceride glucose index (TyG) were 0.73, 0.72, 0.71, 0.69, 0.66, and 0.66 respectively.</p> Conclusion <p>Elevated levels of CMI are associated with lower testosterone levels and an increased risk of testosterone deficiency. The predictive value of the LAP was superior to that of CMI, while the predictive value of CMI was higher than VAI and TyG.</p>","author":"Xuanchun Huang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"431404f5c4db17ab294f7cbd5f6f61af462b05377f9f6fdd0c5fae0b165225e1","category":"Interdisciplinary"}