{"title":"Rapid population decline in McKay’s Bunting, an Alaskan endemic, highlights the species’ current status relative to international standards for vulnerable species","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duad064/7479806?rss=1","date":1702944000000,"content":"<span><div>Abstract</div>The McKay’s Bunting (<span>Plectrophenax hyperboreus</span>) is endemic to Alaska, breeds solely on the remote and uninhabited St. Matthew and Hall islands (332 km<sup>2</sup>) in the central Bering Sea, and is designated as a species of high conservation concern due to its small population size and restricted range. A previous hypothesized population estimate (~2,800 to 6,000 individuals) was greatly increased (~31,200 individuals) after systematic surveys of the species’ entire breeding range in 2003, establishing McKay’s Bunting as one of the rarest passerines in North America. In 2018, we replicated the 2003 surveys and used density surface models to estimate breeding season densities, distributions, and population change over the intervening time period. Our results indicate that the McKay’s Bunting population declined by 38% (95% CI: 27 to 48%) from ~31,560 to 19,481 individuals since 2003. Spatial model predictions showed no areas with an increase of birds on either St. Matthew or Hall islands but revealed declines across 13% (42 km<sup>2</sup>) of St. Matthew Island. Declines disproportionately occurred both in marginal habitats with reduced rocky nesting substrate and in high-density hotspots along the coast of St. Matthew Island. The total area occupied by breeding adults decreased by 8%, and high-density hotspots shifted inland from the coast of St. Matthew Island to higher elevations on both islands, the latter potentially responses to exceptionally warm weather and reduced spring snow cover in 2018. Additionally, we observed low numbers of predators and interspecific competitors in 2018, suggesting that these did not cause the decline. Our findings indicate that McKay’s Bunting meets international standards for elevating its conservation status from Least Concern to Endangered based on the International Union for Conservation of Nature Red List of Threatened Species ranking criteria. Additional population monitoring and studies to identify the causal mechanisms of the recent population decline of this rare species could assist future population assessments.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"431e5628ab8b29449bf83f3a8d0acb1a29758e53069bd4816c9d569b174f2f77","category":"Environment"}