{"title":"Jenny Lay-Flurrie ประธานฝ่าย Accessibility อีกหนึ่งเบื้องหลังไมโครซอฟท์ในการเข้าถึงผู้พิการ","link":"https://www.blognone.com/node/122543","date":1620293287000,"content":"<div><div><div><p>ไมโครซอฟท์ถือว่าเป็นหนึ่งในบริษัทเทคที่จริงจังสร้างอุปกรณ์และซอฟต์แวร์ให้มีความเข้าถึงผู้พิการหรือ Accessibility ในปี 2018 ไมโครซอฟท์เปิดตัว<a href=\"https://www.blognone.com/node/102375\">คอนโทรลเลอร์สำหรับผู้พิการ Xbox Adaptive Controller</a> มาพร้อมกล่องบรรจุที่ใช้ฟันเปิดได้ และยังเปิดรับ<a href=\"https://www.blognone.com/node/121223\">นักพัฒนาเกมทำเกมเพื่อผู้พิการด้วย</a> และเมื่อสัปดาห์ที่ผ่านมานี้เอง ไมโครซอฟท์เปิดตวแผนการ 5 ปี ใช้เทคโนโลยีพัฒนาคุณภาพชีวิตผู้พิการ</p>\n<p>WSJ เข้าสัมภาษณ์ Jenny Lay-Flurrie ประธานฝ่ายการเข้าถึงของไมโครซอฟท์ ซึ่งมีไม่กี่บริษัทที่มีตำแหน่งนี้อยู่ พูดคุยถึงแนวคิดการทำงานที่ส่งผลให้ไมโครซอฟท์เป็นผู้นำที่จริงจังเรื่อง Accessibility และที่สำคัญเธอยังเป็นผู้ที่มีปัญหาเรื่องการได้ยินด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/497d83a7088f2f9dc49bb749b48e457e.png\" /><br />\nภาพจาก <a href=\"https://news.microsoft.com/stories/people/jenny-lay-flurrie.html\">ไมโครซอฟท์</a></p>\n<p>Lay-Flurrie ได้แต่งตั้งเข้ามาในตำแหน่งปี 2016 ซึ่งเป็นช่วงที่ไมโครซอฟท์ปรับแผนในองค์กร พยายามยกเรื่อง Accessibility เข้ามาในศูนย์กลางธุรกิจมากขึ้น เธอบอกว่า ในองค์กรไม่ใช่เฉพาะสายเทคโนโลยีเท่านั้น ควรจะมีตำแหน่ง CAO (chief accessibility officer) มากกว่านี้ ซึ่งเธอพบว่ามันน้อยมากอย่างน่าเวทนา</p>\n<p>เมื่อถามถึงวิธีการทำงานภายในทีม Accessibility ในไมโครซอฟท์ซึ่งเป็นบริษัทที่คุมผลิตภัณฑ์หลายอย่าง Lay-Flurrie บอกว่า วิธีการทำงานคือ กระตุ้นให้ทีมอื่นๆ ได้เห็นวิสัยทัศน์และประโยชน์ที่จะได้จาก Accessibility ซึ่งในองค์กรมีความเปิดกว้างให้เข้าถึงทีมงานได้ทุกทีม ตั้งแต่ฝ่าย HR และ ฝ่าย Xbox เป็นต้น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9c6004482899ddaaffeb528e8678eba2.jpg\" /></p>\n<p>ก่อนหน้านี้ตำแหน่ง CAO ไม่ได้มีเป็นตำแหน่งแยกออกมา แต่อยู่ในทีมสร้างผลิตภัณฑ์อีกทีหนึ่ง ซึ่งทำให้การพัฒนาผลิตภัณฑ์นั้นไม่ครอบคลุมมากพอถ้า CAO นั่งเป็นคนในทีมนั้นๆ ทำให้ต้องเพิ่มการจ้างงาน จ้างผู้พิการ และที่สำคัญที่สุดคือการรับฟังลูกค้าและผู้ใช้งาน ด้านผลตอบแทนจากการลงทุนใน Accessibility นั้น Lay-Flurrie บอกว่า มันน้อยมากอยู่แล้ว แต่จะให้กับดักเรื่องผลตอบแทนการลงทุนมากำหนดกรอบการพัฒนาเพื่อผู้พิการไม่ได้</p>\n<p>ด้านการทำองค์กรให้ friendly ต่อผู้พิการ รวมถึงการจ้างงานผู้พิการ อาจดูเป็นเรื่องที่เฉพาะองค์กรใหญ่สามารถทำได้ Lay-Flurrie ตอบเรื่องนี้ว่า จริงๆ แล้ว มันสามารถเริ่มได้เลย ตัวอย่างเช่น เปลี่ยนสีเฟอร์นิเจอร์ในที่ทำงานให้มีสีต่างกัน ผู้ที่มีสายตาเลือนรางจะได้มองแยกแยะออก, ประตูเปิดปิด ที่ไม่เปิดยากจนเกินไป ซึ่งในไมโครซอฟท์เองก็ได้เผยแพร่คู่มือเกี่ยวกับการจ้างงานผู้พิการ และคาดหวังว่ามันจะช่วยให้องค์กรอื่นเห็นคุณค่าของสิ่งนี้</p>\n<p>แม้ Lay-Flurrie จะเป็นผู้มีปัญหาการได้ยินแต่เธอก็ชอบดนตรีมาก เธอจบปริญญาตรีสาขาดนตรีจาก University of Sheffield, ปริญญาโทสาขาการจัดการจากมหาวิทยาลัย Bradford ในอังกฤษ ทำงานใน T-Mobile ก่อนจะมาเป็นหัวหน้าฝ่ายสนับสนุนลูกค้าของไมโครซอฟท์</p>\n<p>ที่มา - <a href=\"https://www.wsj.com/articles/how-microsofts-chief-accessibility-officer-does-her-job-11620036000?mod=djemalertNEWS\">WSJ</a>, <a href=\"https://news.microsoft.com/stories/people/jenny-lay-flurrie.html\">ไมโครซอฟท์</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/accessibility\">Accessibility</a></div><div><a href=\"/topics/xbox\">Xbox</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4330b3688732cda22f456ecbf692ae500594bccf9a1c1f634adeddcc09384765","category":"Thai"}