{"title":"Ars Frontiers is here: Come (virtually) hang out with the experts","link":"https://arstechnica.com/?p=1940428","date":1684760456000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>The Frontiers livestream. Your favorite Ars writers will appear inside of this magic box starting at 1:30 pm US Eastern Daylight Time! </p></div>\n<p>It's Frontiers Day at Ars Technica! Between the hours of 13:30 and 17:00 (all times US Eastern Daylight, UTC-4:00), we'll be carrying our livestreamed discussion with a half-dozen expert-packed panels on topics that range from IT to health care to space innovation. Each session will last approximately 30 minutes, with the last 10 minutes reserved for questions and answers from the audience. If you want to weigh in, leave your questions as comments <a href=\"https://www.youtube.com/watch?v=P5yPqdOUHsU\">on the YouTube stream</a>. (You can also leave questions in the comments of this article, but YouTube is the preferred place because the moderators gathering questions will be focusing their efforts there.)</p>\n<h2>Schedule and sessions</h2>\n<p>The event kicks off at 13:30 EDT, with a quick intro from Ars Editor-in-Chief Ken Fisher and me. Even though this is a virtual event, Ken and I will be at the Ars studio at the Condé Nast Manhattan office to act as hosts. Ken will welcome everyone in and say some opening remarks, and we'll roll from there directly into the sessions. Each session will also be bookended by a short recap by Ken and me.</p>\n<h3>Session 1: TikTok—banned or not, it's probably here to stay (13:30 EDT)</h3>\n<p>Ars senior policy reporter Ashley Belanger gets to be up first with an <a href=\"https://arstechnica.com/tech-policy/2023/05/montana-is-first-state-to-ban-tiktok-over-national-security-concerns/\">especially relevant topic</a>: While Congress and various states are vowing action against TikTok, will \"banning\" the app (whatever \"banning\" actually means) really come to anything? What are the policy implications around this kind of regulation, and how did we get here? We'll feature EFF Legal Director Corynne McSherry among the panel's guests, along with Columbia University's <a href=\"https://www.tc.columbia.edu/faculty/il2311/\">Ioana Literat</a> and former White House lawyer and CPRI Executive Director <a href=\"https://cpri.uci.edu/leadership/uci-leadership/bryan-cunningham-bio/\">Bryan Cunningham</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1940428#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1940428&amp;comments=1\">Comments</a></p>","author":"Lee Hutchinson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"433603f42d01211d9b13f2e9815d7f1e90b9059c510ccc858dd8b201a54eb189","category":"Tech"}