{"title":"A Novel Approach to Compute Discrete Nonlinear Single Unit Activity Features","link":"https://www.preprints.org/manuscript/202409.0585/v1","date":1725865475000,"content":"Nonlinear single unit activity (SUA) characteristics are the useful measures to reveal the information processing and transfer features associated with Parkinson’s disease (PD) in the basal ganglia. Most of the state-of-the-art approaches to compute such parameters in continuous and discrete forms are strongly dependent on SUA recording length, noise level and input parameters. Due to the specificity of SUA data collection (mainly short recordings with relatively low signal-to-noise ratio) new techniques to evaluate neuronal nonlinear properties are needed. We have developed an encoding technique based on a mean interspike interval (ISI) value to calculate spike train discrete nonlinear features. The approach to compute mutual information (MI) of isolated neurons with its unstructured activity was also proposed. The proposed technique of SUA nonlinear features evaluation slightly depends on spike train length, has low correlations with other SUA characteristics (firing rate, coefficient of ISI variance and asymmetry index). The derived entropy measure in the subthalamic nucleus has significant positive correlation with PD severity. The proposed approach provides nonlinear features that are slightly dependent on investigated sample size and independent on input parameters. Also, the developed mean ISI based measures reflect the more complex nature of oscillatory activity in the basal ganglia, than it was thought previously. Moreover, MI, unlike entropy, takes into account the position of the spike train elements, which allows us to investigate the amount of information retained after the occurrence of temporary failures. The developed approach may be useful in describing nonlinear features of basal ganglia activity contributing to PD pathophysiology probably associated with impaired information transfer in movement disorders.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"43380c488d8628d352cf37c09c4aa24c225940bf53aa66caa5bc655d11a2eb2d","category":"Interdisciplinary"}