{"title":"Listen up! Bea Wolf is a brilliant retelling of a classic Old English saga—for kids","link":"https://arstechnica.com/?p=1925154","date":1681504070000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/beawolf1-800x529.jpg\" alt=\"Kids and grown-ups alike will enjoy answering &quot;candy's clarion call&quot; in &lt;em&gt;Bea Wolf&lt;/em&gt;.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/beawolf1.jpg\">Enlarge</a> <span>/</span> Kids and grown-ups alike will enjoy answering \"candy's clarion call\" in <em>Bea Wolf</em>. (credit: Boulet/Macmillan)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A rowdy group of young \"mallow-munchers,\" \"bully-crushers,\" and \"bedtime breakers\" must battle a fun-hating foe intent on putting an end to their untamed revels in <a href=\"https://www.amazon.com/dp/1250776295/?tag=arstech20-20\"><em>Bea Wolf</em></a>, a new graphic novel by cartoonist and writer Zach Weinersmith, with illustrations by the French cartoonist <a href=\"https://en.wikipedia.org/wiki/Boulet_(comics)\">Boulet</a>. It's a 21st-century re-imagining of the Old English epic poem <em>Beowulf,</em> but unlike most prior translations aimed at adults, this one targets kids (although adults should love it, too).</p>\n<p>Ars readers are likely already familiar with <a href=\"https://en.wikipedia.org/wiki/Zach_Weinersmith\">Weinersmith's work</a>, most notably the webcomic <a href=\"https://en.wikipedia.org/wiki/Saturday_Morning_Breakfast_Cereal\">Saturday Morning Breakfast Cereal</a>, still going strong after 20 years, as well as The New York Times bestseller <a href=\"https://www.amazon.com/dp/B06XBQ443G/?tag=arstech20-20\"><em>Soonish</em></a>, a popular science book co-authored with his wife, <a href=\"https://en.wikipedia.org/wiki/Kelly_Weinersmith\">Kelly Weinersmith</a>. While he's known for his science-nerd credentials, Weinersmith (like me) earned his undergraduate degree in English literature. That's where he started drawing what's now known as \"Classic SMBC.\" The comic soon morphed into the single-panel version we know and love today, while Weinersmith went back to college to study physics.</p>\n<p>It was while he was studying literature that Weinersmith fell in love with <a href=\"https://en.wikipedia.org/wiki/Beowulf\"><em>Beowulf</em></a>, as well as the medieval chivalric romance <a href=\"https://en.wikipedia.org/wiki/Sir_Gawain_and_the_Green_Knight\"><em>Sir Gawain and the Green Knight</em></a>. When he became a father, he told some of those timeless tales to his daughter, Ada. In 2015, he crowdfunded a children's retelling of <em>Sir Gawain</em> called <a href=\"https://www.kickstarter.com/projects/weiner/augie-and-the-green-knight-a-childrens-adventure-b\"><em>Augie and the Green Knight</em></a>, and said it was because he wanted to give his daughter a book \"about little girls who are smart, and scientific, and risk-taking.\" <a href=\"https://en.wikipedia.org/wiki/Boulet_(comics)\">Boulet</a> created the illustrations for that book, so it was only natural for Weinersmith to ask him to also illustrate <em>Bea Wolf</em>. </p></div><p><a href=\"https://arstechnica.com/?p=1925154#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1925154&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4356645c5210e66f8a7cd94012a880024aa5a1b73672ecfcae2936a9eed51ba7","category":"Tech"}