{"title":"Coping and end-of-life decision-making in ALS: A qualitative interview study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306102","date":1719410400000,"content":"<p>by Celia Spoden, Olga Wenzel, Anke Erdmann, Gerald Neitzke, Irene Hirschberg</p>\r\n\r\nHow do people with amyotrophic lateral sclerosis (PALS) deal with their diagnosis and engage in end-of-life decision-making? What informational or supportive needs do they have for counselling about life-sustaining treatment and end-of-life care? Which correlating conditions and influences relate to these needs and how do they connect to the wish to die or wish to live? We conducted a qualitative interview study with 13 people with ALS in Germany from March 2019 to April 2021. Data collection and analysis followed a grounded theory-based approach and revealed close relationships between coping, informational needs and the preparedness for decision-making. We identified the coping strategies ‘avoid thinking about end-of-life’ and its counterpart, ‘planning ahead to be well-prepared,’ and differentiated the latter into the patterns ‘withdrawing from life and taking precautions against life-prolongation’ and ‘searching for a new meaning in life and preparing for life-sustaining treatment’. The approaches are based on individual perceptions, attitudes and motives and can be positively/negatively reinforced by healthcare professionals (HCP), family and other interpersonal networks, but also by disease progression and in reaction to health care services. Type and degree of needs concerning information and counselling differed according to coping strategies. These strategies may vary over time, resulting in different support needs. Our findings signify that deep insight is needed into PALS‘ coping processes to understand their decision-making about life-sustaining treatment. Healthcare professionals should be sensitive to illness experiences beyond medical aspects and foster coping as a biographical process to better support people with ALS.","author":"Celia Spoden","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"43595e01d689715521dcc9855f03544798534b6b2b8a0b8ca0530112eb474a76","category":"Interdisciplinary"}