{"title":"Shared E-scooter Usage Analysis considering the Effect of Weather Conditions and Land Use: Qatar Case Study","link":"https://www.preprints.org/manuscript/202406.0660/v1","date":1718081862000,"content":"Shared e-scooters are gaining popularity as a solution for first and last-mile connectivity in urban areas. This study conducted in Doha, Qatar, aimed to understand how weather and land use patterns affect e-scooter usage, utilizing various datasets. Given the novelty of micromobility systems in Qatar and their sensitivity to the local hot and humid climate, the study employed a comprehensive analytical approach. Analysis revealed that e-scooter demand spikes on weekends, particularly in the afternoon. Influential land use factors include proximity to universities and employment centers, while a higher presence of Qatari females in an area correlates with reduced usage, pointing to cultural influences. Weather conditions, especially humidity and extreme temperatures, significantly impact e-scooter demand. The study employed the Density-Based Spatial Clustering of Applications with Noise (DBSCAN) algorithm for trip clustering and the Random Forest (RF) algorithm to model trip counts, considering temperature and humidity. Insights showed humidity as a critical predictor of hourly e-scooter trip counts. These findings underscore the importance of considering weather, land use, the relationship between land use characteristics and weather variations, and finally cultural factors in optimizing e-scooter services. By integrating data analysis and machine learning, the study offers valuable insights for enhancing urban mobility and transportation planning in GCC countries, promoting sustainable urban mobility.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"435f4855399de667fb5fe2ed087b1df3b2cae024c91a7f58ed28f5c6b4b2b4a9","category":"Interdisciplinary"}