{"title":"Host preference patterns in domestic and wild settings: Insights into Anopheles feeding behavior","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13693?af=R","date":1717222455000,"content":"<h2>Abstract</h2>\n<p>The adaptation of <i>Anopheles</i> malaria vectors to domestic settings is directly linked to their ability to feed on humans. The strength of this species–habitat association is unequal across the species within the genus, with the major vectors being particularly dependent on humans. However, our understanding of how blood-feeding behavior interacts with and adapts to environmental settings, including the presence of humans, remains limited. Using a field-based approach, we first investigated <i>Anopheles</i> community structure and feeding behavior patterns in domestic and sylvatic settings in La Lopé National Park in Gabon, Central Africa. We characterized the preference indices using a dual-host choice sampling approach across mosquito species, habitats, and seasons. We then quantified the plastic biting behavior of mosquito species in each habitat. We collected individuals from 16 <i>Anopheles</i> species that exhibited significant differences in species composition and abundance between sylvatic and domestic settings. The host-seeking behavior also varied among the seven most abundant species. The general attractiveness to each host, human or animal, remained relatively constant for each species, but with significant variations between habitats across species. These variations, to more generalist and to more anthropophilic behavior, were related to seasonal changes and distance from the village, respectively. Finally, we pointed out that the host choice of major malaria vectors changed in the absence of humans, revealing a plastic feeding behavior of these species. This study highlights the effect of humans on <i>Anopheles</i> distribution and feeding evolution. The characterization of feeding behavior in wild and domestic settings provides opportunities to better understand the interplay between genetic determinants of host preference and ecological factors. Our findings suggest that protected areas may offer alternative thriving conditions to major malaria vectors.</p>","author":"Lemonde Bouafou, \nBoris K. Makanga, \nNil Rahola, \nMarilou Boddé, \nMarc F. Ngangué, \nJosquin Daron, \nAudric Berger, \nTheo Mouillaud, \nAlex Makunin, \nPetra Korlević, \nJoachim Nwezeobi, \nPierre Kengne, \nChristophe Paupy, \nMara K. N. Lawniczak, \nDiego Ayala","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"4363da357110f55f8f87a091dcf64c32e0b9a2d11036d8f0b51549f53622b3d2","category":"Environment"}