{"title":"Piezoresistive, Piezocapacitive and Memcapacitive Silk Fibroin Based Cement Mortars","link":"https://www.preprints.org/manuscript/202410.1896/v1","date":1729761570000,"content":"Water stable proteins may offer a new field of applications in smart materials for buildings and infrastructures where hydraulic reactions are involved. In this study, cement mortars modified through water-soluble silk fibroin (SF) are proposed. Water-soluble SF obtained by redissolving SF films in phosphate buffer solution (PBS) showed the formation of a gel with β-sheet features of silk II. Electrical measurements on SF indicate that calcium ions are primarily involved in the conductivity mechanism. By exploiting the water solubility properties of silk II and Ca2+ ion transport phenomena and its trapping effect over water molecules, SF provides piezoresistive and piezocapacitive properties to cement mortars, thus enabling self-sensing of mechanical strain which is quite attractive in structural health monitoring applications. SF/cement-based composite introduces the capacitive gauge factor that surpasses the traditional resistive gauge factor reported in the literature by threefold. Cyclic voltammetry measurements demonstrated SF cement mortars possess memcapacitive behavior for positive potentials around +5 V, attributed to an interfacial charge build-up modulated by the SF concentration and the working electrode. Electrical square-biphasic excitation combined with cyclic compressive loads revealed memristive behavior during the unloading stages. These findings along with the availability and the sustainability of SF pave the way for the design of novel multifunctional materials, particularly for applications in masonry and concrete structures.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"43662cecfc330f3717016dcc93c389725cfd976d89dbcacde83cb3fbcb27f879","category":"Interdisciplinary"}