{"title":"Fine-scale forest structure, not management regime, drives occupancy of a declining songbird, the Olive-sided Flycatcher, in the core of its range","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duad065/7486457?rss=1","date":1703116800000,"content":"<span><div>Abstract</div>Climate change, management legacies, pest outbreaks, and fire regimes are combining to pose a growing risk of broad-scale loss of forest cover throughout western North America. Already, habitat changes have been linked with declines in numerous bird species; understanding the relative importance of management regimes and habitat structure may be critical to conserving at-risk species. The Olive-sided Flycatcher (<span>Contopus cooperi</span>) is a declining songbird associated with tall, open forests in California’s Sierra Nevada, the core of its breeding range, where the management regimes of the National Park Service (NPS) and U.S. Forest Service (USFS) have led to divergent forest conditions over the past century. We combined a landscape-scale passive acoustic monitoring program, the BirdNET animal sound identification algorithm, and single-season occupancy models to explore the relationships between Olive-sided Flycatchers in the Sierra Nevada and both management regimes and fine-scale forest structure. Olive-sided Flycatcher site occupancy increased as canopy cover decreased relative to mean tree diameter, which is consistent with their preference for mature, open forests. These “open forest” conditions were most prevalent on NPS-managed lands, which is consistent with the assumption that the NPS management regime is more faithful to the historical conditions that had supported a larger Olive-sided Flycatcher population than at present. Thus, the support we found for a positive association with USFS-managed lands after controlling for “open forest” suggests that other habitat features are also important. Our results suggest that conservation strategies for Olive-sided Flycatcher breeding habitat should prioritize the protection and generation of open canopies in areas with large trees, as well as the identification of other important habitat features. Prescribed fire, mechanical thinning, and a return of Indigenous forest management practices could help to restore historical forest and fire conditions beneficial to this and other species with similar habitat requirements. Fine-scale alterations to forest structure can be implemented much more rapidly and at much broader scales than the imposition of strict protected status, suggesting that there may be multiple pathways to conservation when species respond to habitat at fine spatial scales.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"436f008a84f14572b2400b74cd30aa4465f0a607535e8c68577c19cb0f28b222","category":"Environment"}