{"title":"Spotlight on Milan Menten: Lotto-Dstny’s new rising sprint star","link":"https://www.cyclingtips.com/2023/03/spotlight-on-milan-menten-lotto-dstnys-new-rising-sprint-star/","date":1680098787000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1247559087.jpeg?width=1200\" alt=\"Spotlight on Milan Menten: Lotto-Dstny's new rising sprint star\" /></figure><p>Arnaud De Lie and Caleb Ewan have taken much of the headlines at <a href=\"https://www.cyclingtips.com/tag/lotto-dstny/\">Lotto-Dstny</a> this season, but Milan Menten has been carving an impressive early season for the Belgian squad.</p>\n<p>Menten put his name on the 2023 map with a convincing win at Le Samyn at the end of February, before going on to take podium finishes at the GP Criquielion and Nokere Koerse.</p>\n<p>Aside from it being the biggest win of his career so far, Menten’s victory at Samyn was particularly memorable as he managed to dislocate his shoulder during his exuberant celebrations. Fortunately for him, it didn’t seem to dampen his joy or his form as the spring carried on, though he had to spend a few days recovering afterward.</p>\n<p><strong>Also read:</strong> <a href=\"https://www.cyclingtips.com/2023/03/spotlight-on-ricarda-bauernfeind-one-of-cyclings-most-exciting-young-prospects/\">Spotlight on Ricarda Bauernfeind: One of cycling’s most exciting young prospects</a></p>\n<p>More recently, he took a top 10 finish at the GP de Denain and on two stages of the Volta a Catalunya and he is next due to race at the one-day Volta Limburg Classic this Sunday. It is no doubt one of the strongest starts to a season that the 26-year-old has enjoyed in his career.</p>\n<p>While Menten may be a relatively new name to most prior to his Samyn win, the young Belgian has been a professional since 2018 when he was signed up by the Sport Vlaanderen-Baloise squad. He spent the last two seasons with Bingoal Pauwels Sauces team before signing for Lotto-Dstny for this season.</p>\n<blockquote>\n<div> <a href=\"https://www.instagram.com/p/CpvgZCHsU72/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <p></p>\n<div>\n<div></div>\n<div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div></div>\n<div></div>\n<div>\n<div>View this post on Instagram</div>\n</div>\n<div></div>\n<div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<p></p></a><p></p>\n<p><a href=\"https://www.instagram.com/p/CpvgZCHsU72/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Milan Menten (@milanmenten)</a></p>\n</div>\n</blockquote>\n<p></p>\n<p>This season is not the first time that Menten has ridden in Lotto colors after he spent three seasons on the U23 squad between 2015 to 2017. In his final season with the team, he notched up six wins and he finished second to Jasper Philipsen at the U23 Paris-Tours.</p>\n<p>Despite his performances, Lotto didn’t think he was ready to make the jump up to the WorldTour with them and he went to Sport Vlaanderen instead.</p>\n<p>“At the time, he did not have the level to step up to the WorldTour, but we have been following him ever since and noticed how well he has developed himself,” the then Lotto-Dstny CEO John Lelangue said when Menten’s signing was announced last September.</p>\n<p>“It is clear that he is ready to step up now. Within our professional organization, by making a balanced racing program and having a clear hierarchy during races, we are convinced we can help him take the next step in his career.”</p>\n<p>Menten’s time with Sport Vlaanderen brought in some solid results, but he would have to wait until his switch to Bingoal in 2021 to score his first-ever professional UCI win when he took a stage of the CRO Race. A top-three finish just behind Fabio Jakobsen at the Tour de Wallonie earlier in the season showed that he was making strides in his development.</p>\n<blockquote>\n<div> <a href=\"https://www.instagram.com/p/CiuatenMGzO/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <p></p>\n<div>\n<div></div>\n<div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div></div>\n<div></div>\n<div>\n<div>View this post on Instagram</div>\n</div>\n<div></div>\n<div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<p></p></a><p></p>\n<p><a href=\"https://www.instagram.com/p/CiuatenMGzO/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Milan Menten (@milanmenten)</a></p>\n</div>\n</blockquote>\n<p></p>\n<p>While it’s technically a sideways swap following the team’s demotion last year, his move to Lotto-Dstny for this season sees him take yet another step up and makes him an exciting prospect for the remainder of the season.</p>\n<p>Though he is defined as a sprinter, Menten is not a pure fast man and he prefers if the parcours has a tough finish to eliminate the likes of Jakobsen, as shown by his Samyn success. His role at Lotto-Dstny will see him look to fill in the blanks where De Lie and Ewan are not available, mopping up the much-needed points as the team aims to return to the WorldTour.</p>\n<p>“The timing is right,” Menten said of his move to Lotto-Dstny. “I feel I am ready to take the next step. And I am very happy with the plan the team has with me sprinting for victory in UCI .1 and ProSeries races. That is something I succeeded in the past two years already, but surrounded by a team like Lotto Soudal, winning gets easier.”</p>","author":"Sadhbh O'Shea","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"43714b0a3dd680ef805dec5473b8ee9ed10c25b98a20e4b077e6cf0fc032d7c2","category":"Cycling"}