{"title":"Overcoming the Tropical Andes publication divide: Insights from local researchers on challenges and solutions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306189","date":1719410400000,"content":"<p>by Jose W. Valdez, Lucía Castro Vergara, Gabriela Orihuela, Miguel Fernandez</p>\r\n\r\nThe Tropical Andes, one of the world’s most biodiverse regions, is vital for ecological research and conservation. However, while researchers in Bolivia, Ecuador, and Peru contribute significantly to scientific knowledge, their publication rates in academic journals have historically lagged behind neighboring nations. A multifaceted strategy was employed to understand and address the publication divide in the Tropical Andes region. This approach focused on regional researchers and consisted of a three-day workshop to improve scientific writing skills, offer publication insights, and equip researchers with tools to overcome obstacles. A series of surveys were also conducted to explore the challenges faced by local researchers and their proposed solutions, covering topics such as participant demographics, factors contributing to lower publication rates, personal barriers, proposed strategies for improving publications, specific topics of interest, participant satisfaction, most valuable workshop topics, and future recommendations. The workshop had an overwhelming response, with over 500 interested participants registering in just a few days, mostly experienced professionals, highlighting the need for such initiatives in the region. About two-thirds had ready-to-publish materials, highlighting the potential impact of targeted interventions on unlocking untapped knowledge. The surveys revealed the challenges contributing to the publication divide, including insufficient training, cultural emphasis on economic development, language barriers, limited resource access, lack of institutional support, high publishing costs, and time and financial constraints. The most common personal barriers were insufficient knowledge and experience in the publication process, lack of self-confidence, and fears of rejection. Proposed solutions include conducting training workshops, fostering collaborative networks, improving resource accessibility, and an institutional and cultural shift that encourages publishing. Addressing challenges faced by experienced professionals in the Tropical Andes by understanding individual needs, fostering support, and demystifying the publication process offers a promising path to closing the publication divide and unlocking the region’s valuable scientific contributions.","author":"Jose W. Valdez","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4378b6570cffc94d18d47f7c004c62b66d56b596888c9ee260f184840aacd906","category":"Interdisciplinary"}