{"title":"Has sentiment returned to the pre-pandemic level? A sentiment analysis using U.S. college subreddit data from 2019 to 2022","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299837","date":1710511200000,"content":"<p>by Tian Yan, Fang Liu</p>\r\nBackground <p>As the impact of the COVID-19 pandemic winds down, both individuals and society are gradually returning to life and activities before the pandemic. This study aims to explore how people’s emotions have changed from the pre-pandemic period during the pandemic to this post-emergency period and whether the sentiment level nowadays has returned to the pre-pandemic level.</p> Method <p>We collected Reddit social media data in 2019 (pre-pandemic), 2020 (peak period of the pandemic), 2021, and 2022 (late stages of the pandemic, transitioning period to the post-emergency period) from the subreddits communities in 128 universities/colleges in the U.S., and a set of school-level baseline characteristics such as location, enrollment, graduation rate, selectivity, etc. We predicted two sets of sentiments from a pre-trained Robustly Optimized BERT pre-training approach (RoBERTa) and a graph attention network (GAT) that leverages both the rich semantic information and the relational information among posted messages and then applied model stacking to obtain the final sentiment classification. After obtaining the sentiment label for each message, we employed a generalized linear mixed-effects model to estimate the temporal trend in sentiment from 2019 to 2022 and how the school-level factors may affect the sentiment.</p> Results <p>Compared to the year 2019, the odds of negative sentiment in years 2020, 2021, and 2022 are 25%. 7.3%, and 6.3% higher, respectively, which are all statistically significant at the 5% significance level based on the multiplicity-adjusted p-values.</p> Conclusions <p>Our study findings suggest a partial recovery in the sentiment composition (negative vs. non-negative) in the post-pandemic-emergency era. The results align with common expectations and provide a detailed quantification of how sentiments have evolved from 2019 to 2022 in the sub-population represented by the sample examined in this study.</p>","author":"Tian Yan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"437ea5f75e9c6a0c75a34481a9a47914f084c40bfb8cd6749343a96eb9d3fc89","category":"Interdisciplinary"}