{"title":"Anti-lipase Induced Anti-obesity Effect of Ethanol Extract of Syzygium cumini and Dioscoria bulbifera Plants in Rat Model: An Integration between Pharmacological and Computational Approaches","link":"https://www.preprints.org/manuscript/202408.1785/v1","date":1724648084000,"content":"Obesity, a chronic disorder of global prevalence, is associated with major health problems leading to mortality. Because of the presence of diverse types of bioactive molecules in plants, attention is being concentrated on the exploration of plant-based drugs to treat the disease. Inhibition of pancreatic lipase by the natural compounds in plants is one of the popular mechanisms for the management of obesity. The current study investigates the mechanism of the anti-obesity effect of the ethanol extract of seeds of Syzygium cumini seeds and roots of Dioscoria bulbifera in fatty diet-induced obese white albino Wister rats (age 8-9 weeks, average weight 110±8 gm). The total phenolic substances present in the ethanol extract of S. cumini was 103.79±3.45 and that of and D. bulbifera was 69.31 ± 2.99 mg GAE/g of dry extract. Correlating the phenolic contents, we also got the DPPH antioxidant activity of the plant extracts. The IC50 value of ethanol extract of S. cumini, D. bulbifera and standard Butyrated hydroxyl toluene (BHT) was found to be 93.03±6.23, 177.13±7.52, and 10.84±0.92 µg/mL, respectively. The body weight of fatty diet-induced rats was significantly reduced by S. cumini, D. bulbifera ethanol extract with a dose of 500 mg/kg bw during 12 weeks of treatment. The anti-obesity effect of the plant extracts is comparable to that of Orlistat with a dose of 10 mg/kg bw. The Orlistat at a concentration of 0.1 mg/ml could be able to inhibit 95.71% activity of Porcine pancreatic lipase while the ethanol extract of S. cumini, D. bulbifera with a concentration of 1.0 mg/ml showed 60.84% and 54.59% of anti-lipase activity. Moreover, the increased TG, LDL and cholesterol in HFD induced rats were significantly reduced by the plant extract as well as Orlistat. Molecular Docking study reveals that quercetin and isoquercetin bind with the rat lipase enzyme at the same site as that of orlistat with high affinity. Taken together, we can conclude that the ethanol extracts of causes anti-obesity effect by inhibiting the pancreatic lipase enzyme.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"437edbc17230e553e8c2e8c8ac90ba03e3ce0e1505704d009ba869fa409f3f69","category":"Interdisciplinary"}