{"title":"เอหิปัสสิโก","link":"https://markpeak.net/come-and-see/","date":1690644660000,"content":"<p><strong>เอหิปัสสิโก</strong> (Come and See) เป็นชื่อสารคดีเกี่ยวกับวัดพระธรรมกาย ที่เริ่มฉายในโรงเมื่อปี 2564 และภายหลังมาฉายทาง Netflix ด้วย เป็นอีกเรื่องที่จดลงไว้ในลิสต์แต่ไม่ได้ดูสักที จนกระทั่งมาเห็นทวีตของผู้กำกับว่าจะออกจาก Netflix แล้ว (31 ก.ค. 2566) จึงต้องรีบดูให้เร็ว เพราะหลุดไปแล้วน่าจะหาดูได้ยากเลยแหละ</p>\n<p>https://twitter.com/nottaponboon/status/1684479882389225472</p>\n<p><strong>เอหิปัสสิโก</strong> นำชื่อมาจากนิทรรศการของวัดพระธรรมกายเอง ที่ต้องการ “ท้าพิสูจน์” (come and see) ว่าภาพลักษณ์ที่คนทั่วไปเข้าใจผิดๆ ต่อมุมมองของวัดนั้นเป็นอย่างไร ซึ่งก็นำมาจากธรรมะบทหนึ่งของพระพุทธเจ้าอีกที (“<a href=\"https://www.dharma-gateway.com/monk/preach/somdej/sd-157.htm\">ควรเรียกให้มาดู</a>“)</p>\n<p>สารคดีนี้จึงจับความขัดแย้งกรณีธรรมกาย โดยมีเส้นเรื่องเป็นการบุกวัดเพื่อจับตัวหลวงพ่อธรรมชโย เมื่อปี 2560-2561 เป็นเส้นเรื่องหลัก จากนั้นเล่ามุมมองของแต่ละฝ่ายที่ขัดแย้งกันอย่างสุดขั้ว ตั้งแต่ฝ่ายผู้ศรัทธาระดับ “สู้ตายเพื่อวัด” ไปจนถึงฝ่ายที่เคยเป็นอุบาสิกา และแม้กระทั่งอดีตพระลูกวัด ที่เปลี่ยนใจไม่ศรัทธาต่อวัดอีกแล้ว รวมถึงความเห็นจากนักวิชาการเข้ามาเสริมในแง่มุมอื่นๆ ด้วย</p>\n<p>สำหรับคนที่ติดตามเรื่องวัดพระธรรมกายมาก่อน ในแง่คอนเทนต์คงไม่มีอะไรใหม่ แต่คนที่ไม่เคยติดตามเรื่องธรรมกายมาแบบใกล้ชิด สารคดีเรื่องนี้ถือเป็นจุดเริ่มต้นที่ดี เห็นภาพรวมได้ครอบคลุม และสามารถไปค้นคว้าหารายละเอียดต่อได้ (หนังไม่ได้ลงรายละเอียดของ “พระธรรม” ตามแนวธรรมกายมากนัก ซึ่งเป็นเรื่องที่เข้าใจได้)</p>\n<p>สิ่งที่ผู้สร้างทำได้ดี คงเป็นการไปติดตามชีวิต สัมภาษณ์ความคิด ของเหล่าอุบาสกอุบาสิกาอย่างใกล้ชิด ได้เห็นแง่มุมที่เป็นวิถีชีวิตประจำวันในวัด เช่น การเดินทางขึ้นรถบัสไปทำบุญ การนอนในวัด การเข้าไปลงแรงขัดห้องน้ำวัด หรือการทำกับข้าว นั่งกินข้าว พูดคุยกันเองในหมู่ผู้ศรัทธา ตรงนี้ถือเป็นฟุตเตจที่มีคุณค่าอย่างมากในแง่การบันทึกประวัติศาสตร์ช่วงนี้เอาไว้</p>\n<p>อันที่รู้สึกว่าเสียดายที่พูดถึงน้อยไปหน่อยคือ เหตุการณ์ไคลแมกซ์ช่วงเจ้าหน้าที่บุกยึดวัด (และชาววัดบุกกลับในอีกไม่กี่วันถัดมา) ซึ่งค่อนข้าง dramatic และน่าจะใช้เป็นตัวขมวดปมจบเรื่องได้ดี แต่กลับเล่าข้ามๆ ไปหน่อยจนรู้สึกว่า อ้าว เหตุการณ์ตรงนี้เคลียร์ไปแล้วเหรอ</p>\n<p></p>\n<p>ภาพรวมต้องบอกว่าเป็นสารคดีไทยที่ทำดีมากเรื่องหนึ่ง เล่าเรื่องได้น่าสนใจ มุมมองบาลานซ์ เน้นตั้งคำถามให้คิดเองมากกว่าหาคำตอบ และถ่ายภาพสวย ตัดต่อออกมาดี</p>The post <a href=\"https://markpeak.net/come-and-see/\">เอหิปัสสิโก</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"43827b83392d9c3cb657d7c763961ba1fce018f05d033bbe7748f71d6d290eb3","category":"Thai"}