{"title":"Evaluation of Biochemical Serum Indicators for Polycystic Ovarian Syndrome Diagnosis among Women with Obesity","link":"https://www.preprints.org/manuscript/202408.1916/v1","date":1724769597000,"content":"Polycystic Ovarian Syndrome (PCOS) is a common endocrine condition that affects 8–13% of women of reproductive age and is one of the leading causes of anovulation and infertility. In Kazakhstan, the prevalence of this syndrome is particularly high compared to other countries and the global average. Currently, the diagnosis of polycystic ovarian syndrome is based on internationally established Rotterdam criteria, using hyperandrogenism, i.e. high testosterone levels, as a key parameter. These criteria are applied to diagnose PCOS in all female patients, although obese patients may have excess testosterone produced by adipose tissue. To avoid possible false PCOS diagnoses, an additional criterion could be considered to diagnose PCOS among obese women. Anti-Müllerian hormone (AMH) is promising as a more effective diagnostic criterion, since its level represents the state of the ovarian reserve and adipose tissue does not produce AMH. Therefore, the use of AMH instead of hyperandrogenism as a diagnostic criterion for PCOS among obese women might improve diagnostic precision and patient treatment. In this study, data on the levels of various hormonal indicators such as estrogen, progesterone, and others were analyzed for a large cohort of female patients with and without PCOS to explore possible correlations between these indicators, AMH, and testosterone. The findings suggest that the absence of a negative correlation between AMH and follicle-stimulating hormone (FSH), and a positive correlation of AMH with testosterone could support the use of AMH as a reliable additional criterion for PCOS diagnosis among obese women.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4383870e789d4649aa55958cfc32cf95705fe771d1c4bae24b7a53e73e5076f0","category":"Interdisciplinary"}