{"title":"Impacts of Land Use Transition on Ecosystem Services in the Dongting Lake Area","link":"https://www.preprints.org/manuscript/202404.1614/v1","date":1714530251000,"content":"Urbanization-induced land use transition results in a decline in ecosystem services, which has implications for regional ecological security. In order to explore the relationship between ecosystem services and land use transition, this paper utilizes the InVEST model, geographically weighted regression model to examine the impact of land use transition on ecosystem services in the Dongting Lake area (DLA). The results showed that (1) During the period 2000-2020, the intensity and motivation of land-use transition showed obvious spatial and temporal heterogeneity with the variation of urbanization development. (2) Habitat quality and Carbon sequestrations showed a downward trend. In contrast, food supply followed an upward trend; soil conservation and water yield services initially increased and dropped later. The overall spatial changes in habitat quality and Carbon sequestration appear to be insignificant. Food supply shows significant differences in the plains compared to other areas; while soil conservation and water yield service shows significant changes in places other than the DLA. (3) From 2000 to 2020, land use transition dynamics, population density, GDP density, night lighting and transition intensity had mainly negative effects on ecosystem services. Only the Normalized Vegetation Index (NDVI) showed a positive effect on ecosystem services. The results of the research will provide valuable references for the development and implementation of spatial ecological restoration planning and land use policies in the national territory.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"43870f2aa831f08a14d69fb33dfe18fed06222baf2c0ccbbdb52003d2e947852","category":"Interdisciplinary"}