{"title":"Will demand for the Volkswagen ID Buzz outstrip supply?","link":"https://arstechnica.com/?p=1997790","date":1705938267000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/VW-ID-buzzes-800x600.jpg\" alt=\"A pair of Euro-spec ID Buzzes by a river in Copenhagen\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/VW-ID-buzzes-scaled.jpg\">Enlarge</a> <span>/</span> You don't have to get a two-tone paint job on your ID Buzz, but it helps. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Volkswagen's forthcoming electric minivan couldn't be better named. Simply put, in the years that we've been writing about cars, nothing on four wheels has created quite as much buzz as the VW ID Buzz with its adorably retro styling. But if all that attention translates into actual buyers, the electric microbus may end up being oversubscribed, at least to begin with.</p>\n<p>Charlie Hall, chairman of the Volkswagen National Dealer Advisory Council, says the US may only see 20,000 ID Buzzes imported this year, <a href=\"https://www.autonews.com/dealers/vw-dealer-council-leader-awaiting-id-buzz-boost\">according to an interview today in Automotive News</a>. \"It sounds like we may have the opportunity for additional European capacity if we need it, but we're still trying to sort out where the demand is going to be globally,\" Hall said.</p>\n<h2>Years in the making</h2>\n<p>VW's plan to resurrect the iconic T1 Microbus goes back to 2001 during the industry's flirtation with retro car design. While vehicles like the new VW Beetle, Ford's porthole-a-licious Thunderbird, and the ever-customizable Chrysler PT Cruiser made it to production, the <a href=\"https://www.caranddriver.com/news/a15139290/volkswagen-microbus-auto-shows/\">Microbus concept</a> never did.</p></div><p><a href=\"https://arstechnica.com/?p=1997790#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1997790&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"438cda1bc56f367fb31c081284f6ddee81d1e9108d29a06f7cad88fa24594421","category":"Tech"}