{"title":"Unmanned High-Speed Aerial Vehicles in Medical Logistics: A Comprehensive Comparative Analysis of Blood Sample Transportation with Weather Variability","link":"https://www.preprints.org/manuscript/202408.0887/v1","date":1723537993000,"content":"Background: The integration of unmanned aerial vehicles (UAVs), commonly known as drones, into medical logistics offers transformative potential for the transpor-tation of sensitive medical materials, such as blood samples. Traditional car transportation is often hindered by traffic delays, road conditions, and geographic barriers, which can compromise timely delivery. Methods: This study provides a comprehensive analysis comparing high-speed drone transportation with traditional car transportation under various weather conditions. Blood samples, including EDTA whole blood, Serum, Li-Heparin Plasma, and citrate plasma tubes, were transported via both methods across temperatures ranging from 4 to 20 degrees Celsius. The integrity of the samples was assessed using a wide array of analytes and statistical analyses, including Passing-Bablok regression and Bland-Altman plots. Results: The results demonstrated that drone transportation maintains blood sample integrity comparably to traditional car transpor-tation. For serum samples, the correlation coefficients (r) ranged from 0.830 to 1.000, and the slopes varied from 0.913 to 1.111, with minor discrepancies in five analytes (total bilirubin, calcium, ferritin, potassium, and sodium). Similar patterns were observed for EDTA, Lithium-Heparin, and Citrate samples, indicating no significant differences between transportation methods. Conclusions: These findings highlight the potential of drones to enhance the efficiency and reliability of medical sample transport, particularly in scenarios requiring rapid and reliable delivery. Drones could significantly improve logistical operations in healthcare by overcoming traditional transportation challenges.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"439212f18b434285317bd9855c1d1b14cb5643b660be1dd2413c289045eabde7","category":"Interdisciplinary"}