{"title":"Relationships in Shark Skin: Mechanical and Morphological Properties Vary between Sexes and among Species","link":"https://academic.oup.com/icb/article/63/6/1154/7241811?rss=1","date":1691798400000,"content":"<span><div>Synopsis</div>Shark skin is a composite of mineralized dermal denticles embedded in an internal collagen fiber network and is sexually dimorphic. Female shark skin is thicker, has greater denticle density and denticle overlap compared to male shark skin, and denticle morphology differs between sexes. The skin behaves with mechanical anisotropy, extending farther when tested along the longitudinal (anteroposterior) axis but increasing in stiffness along the hoop (dorsoventral or circumferential) axis. As a result, shark skin has been hypothesized to function as an exotendon. This study aims to quantify sex differences in the mechanical properties and morphology of shark skin. We tested skin from two immature male and two immature female sharks from three species (bonnethead shark, <span>Sphyrna tiburo</span>; bull shark, <span>Carcharhinus leucas</span>; silky shark, <span>Carcharhinus falciformis</span>) along two orientations (longitudinal and hoop) in uniaxial tension with an Instron E1000 at a 2 mm s<sup>−1</sup> strain rate. We found that male shark skin was significantly tougher than female skin, although females had significantly greater skin thickness compared to males. We found skin in the hoop direction was significantly stiffer than the longitudinal direction across sexes and species, while skin in the longitudinal direction was significantly more extensible than in the hoop direction. We found that shark skin mechanical behavior was impacted by sex, species, and direction, and related to morphological features of the skin.</span>","author":"","siteTitle":"Integrative and Comparative Biology Current Issue","siteHash":"715dd1b0fb4f45600bceadb227e9b7fdf8bd9d1d7a2fd3d5e0399d2c1f410646","entryHash":"439db77a0de035ecc84253fb0439c9be8b0cea7199535029c8ce99b3175c0a43","category":"Environment"}