{"title":"Counterpoint: Flip Phones Are a Dumb Idea","link":"https://www.theverge.com/23757846/flip-phones-forever-motorola-razr-samsung","date":1686788959000,"content":"\n<p>David Pierce for The Verge, “Every Smartphone Should Be a Flip Phone, Starting Right Now”:</p>\n\n<blockquote>\n  <p>Okay, so I’ve convinced you, right? Flip phones forever! Here’s\nthe problem: none of the flip phones currently on the market live\nup to this promise. There aren’t even many to choose from. The Z\nFlip 4 gets a lot of things right, but it’s held back by a\ntoo-small front screen and a just-fine camera setup. The new Razr\nPlus looks really promising, particularly because of its larger\nfront screen, though its processor and durability ratings aren’t\nparticularly impressive. It also gets the software wrong, I think;\nletting me run full apps on the front screen isn’t just silly — it runs against the whole appeal of a flip phone.</p>\n\n<p>What we need is competition. That’s going to take the rest of the\nsmartphone world, from Apple and Google to Huawei and Oppo to\nNothing and OnePlus, to all decide that flip phones are the\nfuture. They can and should keep working on slab phones and\nfoldables because those have their place and their users. But we\nhad it right in 2003: the best kind of phone is a flip phone.\nPhones got smarter, and their shape got worse. It’s time for us to\nfinally get the best of both worlds.</p>\n</blockquote>\n\n<p>I enjoy an honest contrarian take as much as the next person, but I legit don’t get why any company makes one of these, let alone why Pierce would suggest they might go mainstream. Foldables I sort of get, in terms of potential — you carry a double-thick rectangular phone in exchange for a tablet-sized large screen when unfolded. I’ve yet to see one that seems good, but I get the potential for the basic concept — bigger screens are better, all things considered. <em>Westworld</em>’s super-thin tablets that fold into pocketable phones are the best vision for this I’ve seen, and the best examination of <em>Westworld</em>’s tablets <a href=\"https://www.theverge.com/2018/11/14/18088620/samsung-foldable-phone-science-fiction-movies-television-westworld-star-trek\">was published by ... The Verge, back in 2018</a>.</p>\n\n<p>But a flip phone that folds into a double-thick square? I don’t get it. You gain no reduction in volume or weight, and no increase in usable screen real estate. But now you have an extra step each time you want to use your phone, an additional point of mechanical failure on the device, and a form factor that isn’t compatible with putting your phone in a protective case.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/14/flip-phones-dumb-idea\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"439e2b62e88cf1360f57aba05723ae06345d242848c5d8f31b41416fd7302109","category":"Tech"}