{"title":"Cross-Cultural Adaptation and Validation of an Attitude about Euthanasia Scale in Portuguese Older Adults with Mixed Anxiety-Depressive Disorder","link":"https://www.preprints.org/manuscript/202405.0372/v1","date":1715130748000,"content":"Recently, the Portuguese parliament approved the decriminalisation of euthanasia for incurable illnesses. As the experiences of other countries show us, it will be a matter of time before mental disorders are addressed. Studying the phenomenon, particularly in vulnerable groups, in advance is essential for proper law drafting. Therefore, instruments which allow an objective assessment and comparison between groups must be available. This study aims to explore the validation of Faria's Attitude about Euthanasia scale in Portuguese older adult patients with mixed anxiety-depressive disorder. A sample of 114 older adult patients with mixed anxiety-depressive disorder collected by convenience in the Psychiatry Department of Senhora da Oliveira Hospital in Portugal was included. The pre-final version of the scale was tested in a small group with good results. The validity of the internal structure was analysed using exploratory factorial analysis. The internal consistency study verified reliability. For construct validity, we assessed the correlation with other validated scales measuring attitudes toward euthanasia, cognitive performance, personality and empathy. Attitude about euthanasia scale showed good internal consistency. One factor was retained in the principal component analysis. Significant correlations verified construct validity. The results support the scale's usefulness and validity. This study makes available a unique instrument to assess the overall tendency of the attitudes towards euthanasia in European-Portuguese, which can be used, for example, to compare Portuguese with Brazilian older adult psychiatric patients suffering from the same disorder. Furthermore, the adapted scale paves the way for other cross-cultural translations, adaptations, validations, and comparative analyses.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"43a5984de9b124431b6c333e33647cbedff4fa24f825bb6ea5dd9526aa7562b2","category":"Interdisciplinary"}