{"title":"A Refined Supply‐Demand Framework to Quantify Variability in Ecosystem Services Related to Surface Water in Support of Sustainable Development Goals","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004058?af=R","date":1714404853000,"content":"<h2>Abstract</h2>\n<p>As water-related ecosystem services (WRES) encounter unprecedented threats with climate change and human activities, it is important to understand the impact of variations in the supply and demand for WRES on Sustainable Development Goals (SDGs). Previous studies commonly overlooked water quality and water-use sectors when using comprehensive supply-demand index (SDI<sub>com</sub>), defined as the difference between water supply and demand, leading to challenges in applying WRES estimation to SDGs assessment. We constructed a refined supply-demand framework for WRES, categorizing the water supply by water quality and the water demand by sectors. It allows the calculation of refined supply-demand index (SDI<sub>ref</sub>), addressing the limitations of SDI<sub>com</sub>. Our findings demonstrate that SDI<sub>ref</sub> could be effectively employed to assess SDGs and rectify the overestimation of SDI<sub>com</sub> in the case study in Xinjiang. The supply-demand relationship of water resources indicates surpluses in domestic and industrial water use and deficits in agricultural and ecological water use, with the latter worsening. SDI<sub>ref</sub> is projected to be higher in the scenario with SSP2-4.5 and high growth rate of irrigation efficiency. Our study suggested informed decisions based on SDG-specific targets to either maintain or enhance SDG progress scores. The proposed refined supply-demand framework of WRES established a quantitative link between WRES and human well-being, providing applicable insights for other ecosystem service assessments in other regions.</p>","author":"Feng Li, \nQinchuan Xin, \nZheng Fu, \nYing Sun, \nYujiu Xiong","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"43c1cfa8f4f28474b9186c14c8f893656f5526f6c63dc9ef4607b6062b3473cb","category":"Environment"}