{"title":"Barrier Effects of a Novel Poly (Lactic acid/Caprolactone) Bilayer Membrane for Guided Bone Regeneration on Skull without Periosteum of Adult-Senior Staged Rats","link":"https://www.preprints.org/manuscript/202403.0835/v1","date":1710390912000,"content":"Vertical and horizontal bone augmentation is one of the most challenging techniques in bone engineering. The use of barrier membranes and scaffolds in guided bone regeneration (GBR) procedures is a common approach for the treatment of lost bone around teeth and dental implants. The aim of this study was to estimate the barrier effects of a synthetic poly (lactic acid/caprolactone) [P(PA/CL)] bilayer membrane for GBR, compared to a porcine collagen bilayer membrane, in the vertical augmentation model on 10–12-months old rat skull without periosteum. The HAp block (diameter: 4 mm, height: 3 mm, porosity:75%, average pore size:150 μm) was placed on the rat skull without a periosteum. The P(LA/CL) membrane (solid layer: 25 μm, porous layer: 175 μm) or the collagen membrane (solid layer, porous layer) was applied onto the HAp block. At 3, 6, and 12 weeks after the surgery, the incised tissues were fixed, decalcified, and stained with hematoxylin and eosin for histological evaluation. The P(LA/CL) membrane remained until 12 weeks and could achieve barrier effects to inhibit cellular invasion from the repositioned soft tissues. Local bone formation occurred in the interconnected pores of HAp at 6 weeks. On the other hand, the collagen membrane did not inhibit cellular invasion for its expansion until 3 weeks, and was absorbed until 6 weeks. The results indicated that the P(LA/CL) membrane might be effective in GBR as occlusive absorbable membrane.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"43cd3af8c8451a68135d6c0d3a5da7cc2b1e4acea3a0eb57d8999cc17210c990","category":"Interdisciplinary"}