{"title":"Identification of Convection as a Source for the Gravity Waves Observed in the Upper Mesosphere during Indo-French Campaign on Coupling of Lower and Middle Atmospheres","link":"https://www.preprints.org/manuscript/202404.0500/v1","date":1712545602000,"content":"An Indo-French campaign was conducted during May 2014 at Gadanki (13.5oN, 79.2oE), India, for investigating gravity wave (GW) coupling between the lower and middle atmospheres using a suite of experimental techniques. In this paper we are presenting the sources for those GWs which are observed at airglow layer (~87 km) using (OH) Airglow Imager during the campaign. For this purpose we have developed a background model atmosphere by combining the ERA-Interim, MSIS E 90 model and HWM 07 model data sets. Uniqueness of the present study lies in using near-real time background atmosphere data from simultaneous radiosonde and SVU Meteor Radar covering both source and propagation/ dissipation regions of GWs. We have observed 17 wave events and used GROGRAT model for reverse tracing to locate the source(s). When we searched for the sources near the terminal points or along the ray path, deep convection is found to occur but no strong wind shear. This indicates that the source for the observed GWs is deep convection. We have also simulated small scale waves that can reach mesosphere during different seasons (background conditions). GWs with periods less than 100 minutes and horizontal wavelengths less than 200 km are mostly reaching the mesospheric altitudes. Interestingly, it is found that only few GWs that are generated in the troposphere reach the mesospheric altitudes during the monsoon season, though strong sources like convection and wind shear persist throughout this season. Thus, background wind plays significant role in deciding the propagation of GWs in to upper atmosphere.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"43d0c88d2287204cc5478a55e1dc7c6b58237ee2aeda08fdb922dc7743d7ef73","category":"Interdisciplinary"}