{"title":"Cholesterol Dietary Intake and Tumour Cell Metabolism Drive Early Epithelial Tumorigenesis","link":"https://www.preprints.org/manuscript/202405.0400/v1","date":1715080815000,"content":"Epidemiological studies point cholesterol as a possible key factor for both prostate cancer incidence and progression. So, it could represent a targetable metabolite as the most aggressive tumors also appear to be sensitive to therapies designed to decrease hypercholesterolemia, such as statins. However, whether and how cholesterol, through its dietary uptake and its metabolism, could be important for early tumorigenesis, remains unknown. Oncogene clonal induction in Drosophila melanogaster accessory gland allows to reproduce tumorigenesis from initiation to early progression, where tumour cells undergo basal extrusion to form extra-epithelial tumors. Here we show that these tumors accumulate lipids, and especially esterified cholesterol, as in human late carcinogenesis. Interestingly, high cholesterol diet displays limited effect on accessory gland tumorigenesis. On the contrary, cell-specific downregulation of cholesterol uptake, intracellular transport or metabolic response, impairs the formation of such tumors. Furthermore, in this context, high cholesterol diet suppresses this impairment. Taken together, these results reveal that during early tumorigenesis, tumour cells strongly increase their uptake and use of dietary cholesterol to specifically promote the step of basal extrusion. Interestingly, expression data from primary prostate cancer tissues indicate an early signature of redirection from cholesterol de novo synthesis to uptake. Altogether, these results suggest by which mechanism reduction of dietary cholesterol could lower the risk and slow down the progression of prostate cancer.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"43d1b241cbac3af2f24eae2803fceea7d9b6fe7797cc2fa4f975f4b29df45ee0","category":"Interdisciplinary"}