{"title":"iPhone 13 Face ID tweak could work with masks, sunglasses","link":"https://www.macworld.com/article/354152/iphone-13-face-id-tweak-could-work-with-masks-sunglasses.html","date":1629986179000,"content":"<div>\n<section><div></div></section><p>One of the best security features of Apple’s <a href=\"https://www.macworld.com/article/230490/face-id-iphone-x-faq.html\">Face ID unlocking and authentication system</a> is also its biggest annoyance: it only works when it can see your entire face, as millions of mask-wearing iPhone users learned during the pandemic. However, a new Face ID tweak might change that in the iPhone 13.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.frontpagetech.com/2021/08/25/exclusive-apple-testing-new-face-id-hardware-that-works-with-masks-foggy-glasses/&amp;xcust=1-1-354152-1-0-0&amp;sref=https://www.macworld.com/feed\">Jon Prosser’s Front Page Tech</a>, Apple has tweaked the Face ID hardware in the iPhone 13 with a new location for the TrueDepth camera on the left side of the notch rather than its current position on the right side. While that doesn’t mean anything on its own, Prosser says the new placement is fueling a new feature that lets Face ID identify users wearing masks and glasses. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/iphone-12-face-id-prototype.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The Face ID prototype is fitted over the iPhone 12 to mimic the new system in the iPhone 13.</figcaption></figure><p>Front Page Tech</p></div>\n\n\n\n<p>Apple has built a prototype case that houses the new system, Prosser reports, so it can be tested with Apple employees using the iPhone 12. The report says the test is being conducted at “a large scale to collect the most data possible,” with Apple employees asked to “wear masks and glasses to test the new hardware. Some tests are conducted with masks on (and) off. Others are conducted with glasses on (and) off while wearing a mask.” He says the tests “include every style of eyeglasses and mask.”</p>\n\n\n\n<p>The tests are presumably to test the accuracy of the system before it debuts in the iPhone 13. Based on the prototypes pictured, the system requires new hardware to operate, which is purportedly already built into the iPhone 13. So all Apple is doing is testing to make sure the system is ready to go at launch. If not, the feature could be delayed or not appear at all.</p>\n\n\n\n<p>Apple faced a bit of criticism last year when people realized the Face ID system didn’t work when wearing a mask. A <a href=\"https://www.macworld.com/article/331851/how-to-unlock-apple-watch-wearing-mask-ios-14-5.html\">workaround that uses the Apple Watch</a> as an authenticator arrived in iOS 14.5, but for many users, the frustration remains, especially as mask-wearing ramps up again in the face of the COVID-19 Delta variant.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"43dd4101db6b1d746336d0e8d96f27467915cde0993b671fff7b7c318839fd5c","category":"Apple"}