{"title":"Test-retest reliability of Latin American Group for Maturity (GDLAM) protocol in older women","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302134","date":1713535200000,"content":"<p>by Álvaro Huerta Ojeda, Emilio Jofré-Saldía, Jimena Arriagada Molina, Patricia Rojas Quinchavil, María Paz Parada Toledo, Sergio Galdames Maliqueo, María-Mercedes Yeomans-Cabrera, Carlos Jorquera-Aguilera, Frano Giakoni-Ramirez, Maximiliano Bravo</p>\r\n\r\nFunctional autonomy (FA) is a critical factor in determining the quality of life of older adults (OA), especially in the case of older women (OW), as they face a decline in FA in their later years of life. FA should be assessed early, using valid, reliable, and low-cost tests. This study evaluated the test-retest reliability of GDLAM and GDLAM autonomy index (GI) in OW. Thirty-nine OW (71.2 ± 6.50 years) participated in the study. A repeated measures design was used to compare the interday test-retest reliability of the five GDLAM tests (seconds) and the GI (points). The five tests represent activities of daily living, such as dressing or wandering around the house, while the GI provides a weighting of the results of the five tests. The analysis consisted of the intraclass correlation coefficient (ICC), standard error of measurement (SEM), and coefficient of variation (CV). A CV ≤ 10% and an ICC ≥ 0.80 were considered acceptable reliability, whereas a CV ≤ 5% and an ICC ≥ 0.90 were considered high reliability. The outcome of the five tests, represented by the GI, showed high interday test-retest reliability (CV = 6.00% and ICC = 0.91). The results of this study demonstrate that the five tests of the GDLAM protocol and the GI have high interday test-retest reliability and good interday reproducibility. From a practical point of view, the GDLAM protocol allows the assessment of FA of community-dwelling OW, providing background for early diagnosis and, with it, the possibility of developing an individualized physical exercise prescription.","author":"Álvaro Huerta Ojeda","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"43eb6a6f0dca45b32f0ea20e4499ee7842149f2b2214c3d2f30f67e12c7395bd","category":"Interdisciplinary"}