{"title":"Our AI headline experiment continues: Did we break the machine?","link":"https://arstechnica.com/?p=1781268","date":1626793235000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Machine-Learning-Feature-3-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Machine-Learning-Feature-3.jpg\">Enlarge</a> (credit: Aurich Lawson | Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>We're in phase three of our machine-learning project now—that is, we've gotten past denial and anger, and we're now sliding into bargaining and depression. I've been tasked with using Ars Technica's trove of data from five years of headline tests, which pair two ideas against each other in an <a href=\"https://en.wikipedia.org/wiki/A/B_testing\">\"A/B\" test</a> to let readers determine which one to use for an article. The goal is to try to build a machine-learning algorithm that can predict the success of any given headline. And <a href=\"https://arstechnica.com/information-technology/2021/07/feeding-the-machine-we-give-an-ai-some-headlines-and-see-what-it-does/\">as of my last check-in</a>, it was… not going according to plan.</p>\n<p>I had also spent a few dollars on Amazon Web Services compute time to discover this. Experimentation can be a little pricey. (<em>Hint</em>: If you're on a budget, don't use the \"AutoPilot\" mode.)</p>\n<p>We'd tried a few approaches to parsing our collection of 11,000 headlines from 5,500 headline tests—half winners, half losers. First, we had taken the whole corpus in comma-separated value form and tried a \"Hail Mary\" (or, as I see it in retrospect, a \"<a href=\"https://en.wikipedia.org/wiki/Leeroy_Jenkins\">Leeroy Jenkins</a>\") with the Autopilot tool in AWS' SageMaker Studio. This came back with an accuracy result in validation of 53 percent. This turns out to be not that bad, in retrospect, because when I used a model specifically built for natural-language processing—AWS' <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/blazingtext.html\">BlazingText</a>—the result was 49 percent accuracy, or even worse than a coin-toss. (If much of this sounds like nonsense, by the way, I recommend <a href=\"https://arstechnica.com/information-technology/2021/07/feeding-the-machine-we-give-an-ai-some-headlines-and-see-what-it-does/\">revisiting Part 2</a>, where I go over these tools in much more detail.)</p></div><p><a href=\"https://arstechnica.com/?p=1781268#p3\">Read 29 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1781268&amp;comments=1\">Comments</a></p>","author":"Sean Gallagher","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"43eda95921f7a0a17d209213af29108b1817573f96cc5ccc4f3c60234d2a7a37","category":"Tech"}