{"title":"The iPhone 15 was a big deal in 2023 but these three moves were even bigger","link":"https://www.macworld.com/article/2170988/apple-2023-year-in-review-vision-pro-silicon-ai.html","date":1702564383000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>We’re just a couple weeks away from putting 2023 in our rearview mirror, so it’s time–as the natural order of things dictates—to cast our eyes back over the last 12 months and attempt to shape the events into some semblance of narrative.</p>\n\n\n\n<p>The past year in Apple has certainly been eventful, ranging from big updates on the Mac line to totally absent iPads to a brand new product category to challenges from rivals and governments alike. Even if the company hasn’t had its most blockbuster financial results of all time, you’d be hard-pressed to say it hasn’t had its nose to the grindstone.</p>\n\n\n\n<p>Of course, the big moves aren’t always the ones that are obvious from the outside. Sometimes, some trends only become apparent when you have the chance to look at them in retrospect.</p>\n\n\n\n<h2>Apple silicon steams forward</h2>\n\n\n\n<p>2023 was another great year for the Mac. Just a month shy of the product’s 40th anniversary, it’s hard to oversell just how incredible a boom the iconic personal computer has had–a huge chunk of which can be attributed to Apple silicon.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Apple-MacBook-Air-15in-13.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple MacBook Air 15in display\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Apple-MacBook-Air-15in-13.jpg?quality=50&amp;strip=all 2000w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Apple-MacBook-Air-15in-13.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Apple-MacBook-Air-15in-13.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Apple-MacBook-Air-15in-13.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Apple-MacBook-Air-15in-13.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Apple-MacBook-Air-15in-13.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Apple-MacBook-Air-15in-13.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>Apple added a bigger 15-inch MacBook Air to give consumers more choices.</p></figcaption></figure><p>Dominic Preston / Foundry</p></div>\n\n\n\n<p>Interestingly, the pace of Apple’s chips seemed to accelerate a bit this year: the <a href=\"https://www.macworld.com/article/1475537/m2-pro-max-chips-cpu-gpu-peformance-m1-intel.html\">M2 Pro and M2 Max</a> debuted in January in the <a href=\"https://www.macworld.com/article/1480214/16-inch-macbook-pro-m2-pro-review.html\">MacBook Pro</a> and <a href=\"https://www.macworld.com/article/1480091/mac-mini-m2-pro-review.html\">Mac mini</a>, paving the way for updates to the <a href=\"https://www.macworld.com/article/1948425/mac-studio-m2-max-review.html\">Mac Studio</a> and <a href=\"https://www.macworld.com/article/347010/new-mac-pro-2023.html\">Mac Pro</a>–along with the powerhouse <a href=\"https://www.macworld.com/article/1941691/m2-ultra-processor-mac-pro-studio.html\">M2 Ultra</a> and new <a href=\"https://www.macworld.com/article/1948603/15-inch-macbook-air-m2-review.html\">15-inch MacBook Air</a>–midway through the year. That might have seemed like plenty for a single year, but just a few months later, in October, the company rolled out not only its M3 chip, but simultaneously the M3 Pro and M3 Max variants, leaving only a putative M3 Ultra on the shelf.</p>\n\n\n\n<p>The rapid rate of chip development shows just how much Apple has invested in this aspect of its business over the last decade–these kinds of things don’t happen overnight, much as it might seem like it to the outside observer. Apple knows silicon is core to its business (all puns intended) and the company isn’t about to pull back on it now. If nothing else, that example is worth keeping in mind when it comes to other technologies that Apple might be interested in. The work isn’t always obvious, even when it’s happening furiously.</p>\n\n\n\n<h2>The learning machines</h2>\n\n\n\n<p>Artificial intelligence is the buzziest of buzzwords, the one that everybody’s been talking about across the tech industry for the last year or so (can we finally bid a not-so-fond adieu to cryptocurrency and the blockchain?). Given that prevalence, it’s not a surprise that AI’s even started to simmer within discussions about Apple: has the company missed the boat? Will it produce generative AI products in the year ahead? Or is the conversation missing all <a href=\"https://www.macworld.com/article/1521988/apple-machine-learning-ai-microsoft-bing-google-bard.html\">the machine learning-related tech that the company already has</a>?</p>\n\n\n\n<p>But even if AI features have not yet come to the forefront, it’s clear that the company has spent a lot of time working behind the scenes in 2023. It did, in fact, release a generative AI accessibility feature, Personal Voice, as part of iOS 17, and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/watch?v=ra9I0HScTDw&amp;xcust=1-1-2170988-1-0-0&amp;sref=https://www.macworld.com/feed\">even produced a short film about it</a>. Just this past week, Apple went a step further and very quietly released <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2023/12/6/23990678/apple-foundation-models-generative-ai-mlx&amp;xcust=1-1-2170988-1-0-0&amp;sref=https://www.macworld.com/feed\">an open-source framework for building AI models optimized for Apple silicon</a>, which feels very much like the company ramping up for big developments.</p>\n\n\n\n<p>And, naturally, CEO Tim Cook got the requisite questions on AI during quarterly financial calls with analysts, who are always digging for any tidbit on the company’s future plans. During <a href=\"https://www.macworld.com/article/2124873/apple-q4-2023-earnings-loss-iphone-mac-sales.html\">last month’s call</a>, he responded by saying:</p>\n\n\n\n<blockquote>\n<p>In terms of generative AI, obviously, we have work going on. I’m not going to get into details about what it is, because as you know, we really don’t do that. But you can bet that we’re investing. We’re investing quite a bit.</p>\n</blockquote>\n\n\n\n<p>While this work seems largely still beneath the surface, the shift from the beginning of 2023 to the developments we’re seeing now, at the end of the year, says that Apple knows AI is no passing fad.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/wwdc-vision-pro-model.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"WWDC Vision Pro model\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/wwdc-vision-pro-model.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/06/wwdc-vision-pro-model.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/wwdc-vision-pro-model.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/wwdc-vision-pro-model.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/wwdc-vision-pro-model.jpg?resize=1536%2C865&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/06/wwdc-vision-pro-model.jpg?resize=2048%2C1153&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/06/wwdc-vision-pro-model.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/06/wwdc-vision-pro-model.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>Apple’s spatial computing platform made a splashy debut at WWDC this past June.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>The Vision Pro thing</h2>\n\n\n\n<p>No list of Apple’s biggest moves of 2023 would be complete without the <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Vision Pro</a>–which is somewhat tricky, as the device isn’t expected to ship for another month at least. But if the AR headset was omnipresent as a rumor before the announcement, its dominance over the Apple-related conversation has only solidified in the back half of the year. Given how much the Vision Pro has captured the attention of the Apple community, it’s hard to imagine that it hasn’t had an even more profound effect within the company itself.</p>\n\n\n\n<p>The Vision Pro is without a doubt the most significant new Apple product since at least the Apple Watch, which is itself closing in on a decade of life at this point. Even before the release of the headset—or, as Apple would have it, “spatial computer”—it’s clear that the development of this product has been a major focus of the company’s resources, from materials and engineering to software.</p>\n\n\n\n<p>Whether it succeeds, well, that’s a question for 2024.</p>\n\n\n\n<h2>Where do we go from here?</h2>\n\n\n\n<p>That’s not all that happened in 2023, of course: the year also saw Apple finally release some of its <a href=\"https://www.macworld.com/article/1814473/final-cut-logic-pro-ipad-subscription-launch.html\">pro apps for the iPad</a>, continue its march on security and privacy features, and release big updates to all of its major software platforms, all while contending with increased scrutiny from regulators and governments around the world.</p>\n\n\n\n<p>With all of that behind us, it’s time to look forward to what 2024 might hold. Next week, I’ll take a look at what will likely be the biggest stories in the Apple world for the year ahead.</p>\n\nApple Inc, CPUs and Processors, Mac, Virtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"43f16a5f01ac538403cc33f534126ec3049ad5502a36d8e7eed68d93f69a1a15","category":"Apple"}