{"title":"Bombich Software Announces Carbon Copy Cloner 6 Featuring Faster Backups, Quick Updates, Snapshot Navigator, and More","link":"https://www.macrumors.com/2021/05/20/bombich-carbon-copy-cloner-6-released/","date":1621507694000,"content":"Bombich Software has released <a href=\"https://bombich.com\">version 6 of Carbon Copy Cloner</a>, the first major update to the backup program and Time Machine alternative in over four years.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/carbon-copy-cloner-6.jpg\" />\r\n<br />\r\nApart from offering the <a href=\"https://bombich.com/blog/2021/05/19/beyond-bootable-backups-adapting-recovery-strategies-evolving-platform\">ability</a> to make bootable backups on Intel and <a href=\"https://www.macrumors.com/guide/apple-silicon/\">Apple Silicon</a> Macs, the new-look CCC 6 includes a number of additional features, including a \"Quick Update\" to existing backups that is said to be up to 20 times faster. To achieve this, CCC 6 now uses the macOS FSEvents service to check for a list of folders modified on the source since the last backup, rather than scanning every folder for changes.\r\n<br />\r\n\r\n<br />\r\nUsing the same underlying technology that's used by the \"Quick Update\" feature, CCC 6 also offers a new automation option that allows users to have a task run when a threshold of data changes have occurred at the source. So rather than scheduling hourly or daily tasks, CCC can run tasks when a specific amount of data has changed on the disk, with the added ability to limit the number of automated tasks that run in a given time window.\r\n<br />\r\n\r\n<br />\r\nElsewhere, a new Preview feature offers an advance look at what changes will be made to the destination before a backup runs, while new Backup Audits record detailed information about the transactions that occurred during the task, such as files copied, files updated, folders created or updated, and files deleted or archived. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/ccc6-snapshot_navigator.jpg\" />\r\n<br />\r\nCCC's new Compare feature offers a visual comparison of a task's source and destination, and provides details if the differences are the result of a task filter. There's also a new Snapshot Navigator, which allows users to step through older versions of their backups and get a preview of files as they were at specific points in time. \r\n<br />\r\n\r\n<br />\r\nInterface-wise, CCC's main window has been redesigned for <a href=\"https://www.macrumors.com/guide/ios-dark-mode/\">Dark Mode</a>, and now has a smaller desktop footprint while making many of the controls and font sizes larger. It also now includes more detailed progress indication while a task is running, including a time remaining estimate, and file processing and transfer rates are now charted in real time during backup tasks.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/ccc-task_control.jpg\" />\r\n<br />\r\nMeanwhile, the menubar item has been updated, and now offers one-click access to starting, stopping and monitoring CCC tasks. It also tracks disk usage consumed by snapshots and alerts users to usage that exceeds expectations. \r\n<br />\r\n\r\n<br />\r\n<a href=\"https://sites.fastspring.com/bombich/product/ccc6\">Carbon Copy Cloner 6</a> costs $39.99 for a personal and household license, or a commercial, single computer license. CCC 5 users get a 50% discount off that price, while CCC 4 users are being offered a 25% discount. CCC 5 owners who purchased the app after February 18, 2021 are eligible for a free upgrade. A 30-day trial of the software is also available on the <a href=\"https://bombich.com\">Bombich website</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/carbon-copy-cloner/\">Carbon Copy Cloner</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/20/bombich-carbon-copy-cloner-6-released/\">Bombich Software Announces Carbon Copy Cloner 6 Featuring Faster Backups, Quick Updates, Snapshot Navigator, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/bombich-software-announces-carbon-copy-cloner-6-featuring-faster-backups-quick-updates-snapshot-navigator-and-more.2296895/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=NLAC6Hn0EYg:GRVm00VojGI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=NLAC6Hn0EYg:GRVm00VojGI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/NLAC6Hn0EYg\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"43f975169f4c37f9f9a6a63678bf8722ac46d08c961d84fcc241a74c74ec19a9","category":"Apple"}