{"title":"17 Effects of trace mineral source on dry matter digestibility of silage and mineral absorption","link":"https://academic.oup.com/jas/article/102/Supplement_3/78/7757171?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Copper, manganese, and zinc when coming from highly soluble sources in the rumen can strongly bind to diet fiber, which reduces it intestinal absorption and DM digestibility. Thus, the objective of this study was to evaluate the digestibility of dry matter and the apparent absorption of Cu, Mn, and Zn depending on different sources of these trace minerals. Four ruminally cannulated crossbred steers [body weight (BW = 560 ± 35 kg)] were used in a 4 × 4 Latin square design and offered corn silage ad libitum, and mineral supplement for four 21-d periods (14-d adaptation and 7-d data collection). Treatments assigned were: 1) Control (No Cu, Mn, and Zn); 2) Cu, Mn, and Zn-sulfate; 3) Cu, Mn, and Zn-organic; and 4) Cu, Mn, and Zn-hydroxychloride. In each period, two dry matter intake measurements and two total feces collections were carried out for 24 h. Thus, the digestibility of dry matter (DMd) and the apparent absorption (aA = trace minerals intake - trace minerals in feces/trace minerals intake) of Cu, Mn, and Zn were calculated. Data were subjected to analysis of variance (<span>P</span> &lt; 0.05), and when significant, a multiple comparison test was performed (SNK test). No treatment x animal x period interactions were observed (<span>P</span> ≥ 0.05). The greatest DM digestibility was in the diets with Cu, Mn, and Zn-hydroxychloride and Cu, Mn, and Zn-organic, and the least DMd were Cu, Mn, and Zn-sulfate and control diet (<span>P</span> &lt; 0.05), respectively 588, 575, 468 e, 449 g/kg (Table 1). Copper apparent absorption was greater (<span>P</span> &lt; 0.05) in steers receiving Cu-hydroxychloride (0.14) and Cu-organic (0.12) and was equal (<span>P</span> ≥ 0.05) between those receiving Cu-sulfate (0.05) and those not receiving (-0.006) supplemental Cu. The sources did not affect (<span>P</span> ≥ 0.05) manganese aA, and the absorption of Mn was greater (<span>P</span> &lt; 0.05) in steers receiving Mn than those not receiving. Diets with Zn-hydroxychloride (0.16) and Zn-organic (0.12) had greater (<span>P</span> &lt; 0.05) aA than diet with Zn-sulfate (0.01), and steers that did not receive supplemental zinc (-0.10) had the least (<span>P</span> &lt; 0.05) zinc aA. Low ruminal solubility trace minerals sources result in greater DM digestibility. Hydroxychloride and organic are more absorbable than Cu and Zn sulfates. Non-supplementation resulted in a net loss of Cu, Mn, and Zn, regardless of the type of trace minerals source.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"43fd4c3bfb579761c3ee4d54685694a8033ad73674edd7055031e26acf775245","category":"Environment"}