{"title":"iOS 15: How to use Siri to quickly share anything on your screen","link":"https://www.macworld.com/article/544740/how-to-ios-15-siri-share-anything-on-your-screen.html","date":1635933600000,"content":"<div>\n<section><div></div></section><p>Sometimes it’s a pain to share that cool thing you found online. You have to copy URLs or images, switch over to the Messages app, tap-and-hold, select paste…</p>\n\n\n\n<p>Or you can poke around through various menus looking for the Share menu (usually a box with an arrow coming out of the top) to directly send content. But you’d be surprised how many users don’t know about the Share menu at all, and even if you do, it can be hard to find in some apps.</p>\n\n\n\n<p>With iOS 15, there’s a much faster and easier way to send anything on your screen to another person. Simply say “Hey Siri, share this with [name]” (or something similar like “send this to [name]” and Siri will share the content on the screen to that person using Messages. You can use any name that Siri would normally recognize from your Contacts or Messages history, or familial relationships if you have them in your Contact details (e.g. “send this to mom”). </p>\n\n\n\n<p>Siri will pop up a Messages card with the content and say “Ready to send it?” If you say “yes” it gets sent immediately. If you say “no,” the card will stay up on the screen so you can type in a message to accompany it.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/ios15-siri-share.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>Items such as images, web pages, Apple Music or Podcasts, Apple News stories, and Maps locations will share attachments with the actual content. For content Siri can’t share, it will warn you that it can only send a screenshot—but Siri will still automatically take that screenshot and drop it in a Message for you.</p>\n\n\n\n<p>It’s all very frictionless. Just ask Siri to share something, and Siri will prepare the item and drop it in a message in no time at all. No digging around for Share menus, no copy/paste, no flipping back and forth to the Messages app.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"43ff852f7d40d4e984d2c6b46654f65296ca865aeecde674b40d0371063cd6d0","category":"Apple"}