{"title":"Apple Vision Pro: Everything you need to know","link":"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html","date":1704723783000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple has announced that its Vision Pro headset will go on sale in the U.S. on February, with pre-orders for the $3,499 device starting on Friday January 19, 2024 and the devices on sale at Apple Stores in the U.S. from February 2. The announcement looks primed to cause a stir at CES (running from January 9 to 12) despite Apple not attending the conference. </p>\n\n\n\n<p>Here’s everything you need to know Apple’s VR headset, although Apple’s not referring to it as such, Apple describes the headset as a “revolutionary spatial computer” with a big emphasis on how a user will be able to stay present in the physical world while wearing it. Apple CEO Tim Cook spoke at WWDC in June 2023 about how the Vision Pro ushers in “the beginning of a new era for computing.” </p>\n\n\n\n<p>Want to know what it’s like to wear a Vision Pro? Macworld’s Roman Loyola has and he describes the experience here: <a href=\"https://www.macworld.com/article/1944516/apple-vision-pro-hands-on-feaures-design-fit.html\" target=\"_blank\">I entered Apple’s thrilling Vision Pro world and didn’t want to leave!</a> We also discuss his <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html#toc-9\">experiences with the Vision Pro</a> below. </p>\n\n\n\n<p><strong>Update January 8:</strong> <em>The Vision Pro will go on sale on January 19.</em></p>\n\n\n\n<h2>Apple Vision Pro: Release date</h2>\n\n\n\n<p>When it revealed the Vision Pro at WWDC in June 2023, Apple said that the Vision Pro headset would be available “early next year”. Its arrival in January 2024 is slightly earlier than we had anticipated, but the announcement a day before CES is well-timed for media attention.  </p>\n\n\n\n<p>The headset will initially be available in the U.S only., with Apple indicating at the initial unveiling in 2023 that other countries would have to wait until “later next year”. As for when in 2024 that might be, in July 2023 Gurman <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2023-07-07/apple-vision-pro-headset-to-launch-in-us-stores-by-appointment&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">suggested</a> that the U.K. and Canada could see the new headset launch before the end of 2024, while Asia and other parts of Europe would have to wait until “soon after”. </p>\n\n\n\n<h2>Apple Vision Pro: Price and how to buy</h2>\n\n\n\n<p>The Vision Pro will start at $3,499, Apple hasn’t confirmed the price outside the U.S. yet, but based on Apple’s usual pricing structure that’s probably around £3,499 in the U.K. </p>\n\n\n\n<p>There will be an additional cost associated with any prescription lenses that are required, according to Apple you will pay $99 for Zeiss Optical Inserts (Readers) and $149 for ZEISS Optical Inserts (Prescription). </p>\n\n\n\n<p>Apple Vision Pro comes with either a Solo Knit Band and Dual Loop Band so the user can select the one that is most comfortable. </p>\n\n\n\n<p>We also don’t know whether there will be additional options or accessories other than an external battery pack. </p>\n\n\n\n<p>If you want to buy the Vision Pro you will be able to pre-order one from <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-557878-1-0-0&amp;u=https://www.apple.com/apple-vision-pro/\" target=\"_blank\">Apple’s website</a> on January 19 at 5 am PT. The device will then be available to purchase from Apple Stores around the United States from February 2. </p>\n\n\n<p><a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-557878-7-0-0&amp;u=https://www.apple.com/apple-vision-pro/\" target=\"_blank\">Pre-order Vision Pro from Apple</a></p>\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-Vision-Pro-design.jpg?quality=50&amp;strip=all\" alt=\"Apple Vision Pro design\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-Vision-Pro-design.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-Vision-Pro-design.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-Vision-Pro-design.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-Vision-Pro-design.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"683\" /></figure><p>Apple</p></div>\n\n\n\n<h3>Will there be a cheaper version of Vision Pro? </h3>\n\n\n\n<p>We took the fact that the Vision Pro has the word Pro in its name as a big hint that a less Pro version will be coming down the line. That’s not exactly evidence, but Bloomberg’s Mark Gurman believes that a cheaper headset will arrive in 2025. </p>\n\n\n\n<p>In a June 2023 newsletter, he wrote that a <a href=\"https://www.macworld.com/article/1950084/vision-pro-strategy-ipod-mini-cheaper-model-features-specs.html\">“cheaper” version of the Vision Pro is in development</a>. It will likely have “lower quality screens, either an iPhone-grade chip or an older Mac chip, and fewer cameras.” He also <a href=\"https://www.macworld.com/article/2098332/apple-working-full-time-sequel-vision-pro.html\">reported in October</a> that Apple’s Vision pro is already working on the sequel to the headset, which will be cheaper than the original model. </p>\n\n\n\n<p>Gurman suggests the cheaper headset will be called either Apple Vision or Apple Vision One. </p>\n\n\n\n<h2>Apple Vision Pro: Design </h2>\n\n\n\n<p>Apple has picked the materials that the Apple Vision Pro is made from to make it as “wearable” as possible. A custom aluminum alloy frame curves around the user’s face and a modular design means it can be “perfectly” tailored to fit each user.</p>\n\n\n\n<p>The Light Seal is made of a soft textile that comes in a variety of sizes and shapes to suit the user’s face for a precise fit. There are flexible straps that can be adjusted to fit the head and ensure that the Audio Pods are positioned near the ears. The cushioned Head Band is available in multiple sizes and can be changed for another size or style. </p>\n\n\n\n<h2>Apple Vision Pro: Prescription eyewear</h2>\n\n\n\n<p>Those who need glasses will be able to purchase custom optical inserts to correct their vision. These ZEISS Optical Inserts are sold separately and magnetically attach to the headset’s lenses. The additional lenses are not included in the price of the headset, so there is an additional cost associated with them. </p>\n\n\n\n<p>When Macworld’s Roman Loyola tried out the <a href=\"https://www.macworld.com/article/1944516/apple-vision-pro-hands-on-feaures-design-fit.html\">Vision Pro at Apple Park</a> an optometrist measured his prescription and Apple fitted the headset with the appropriate lenses. He then removed his glasses when he put the headset on. He said he was able to see, but thought that maybe the prescription wasn’t exact because he noticed fuzziness with text. </p>\n\n\n\n<p>Apple confirmed to Loyola that when you order Vision Pro you will have to submit a prescription from your optometrist. It’s unclear as to how that will work when buying at an Apple Store. Possibly a customer will have to submit a prescription at the retail store. </p>\n\n\n\n<p>There is information about the cost of lenses in the price section above. According to Apple you will be required to pay $99 for Zeiss Optical Inserts (Readers) and $149 for ZEISS Optical Inserts (Prescription).</p>\n\n\n\n<h2>Apple Vision Pro: Compatibility </h2>\n\n\n\n<p>Apple hasn’t said anything about compatibility in terms of whether you will need a particular generation of iPhone to use the Vision Pro, but it seems likely that it won’t be supported by every handset.</p>\n\n\n\n<p>In fact, analyst Ming-Chi Kuo has suggested that the <a href=\"https://www.macworld.com/article/1958352/iphone-15-upgraded-uwb-chip-vision-pro.html\">iPhone 15 will feature an upgraded Ultra Wideband (UWB) chip for this purpose</a>–which may mean no other iPhone will support the Vision Pro. </p>\n\n\n\n<h2>Apple Vision Pro: Specs and features</h2>\n\n\n\n<p>The Vision Pro will, according to Apple, “deliver phenomenal compute performance.” It is powered by both an M2 processor and a new R1 chip used to process input from 12 cameras, five sensors, and six microphones, it also eliminates lag to avoid latency. Apple says it can update images at eight times faster than the blink of an eye. The headset “runs virtually silent”, according to Apple.</p>\n\n\n\n<p>There are two ultra-high-resolution displays that combine to produce 23 million pixels and create a 4K display for each that could generate a display that appears to be 100 feet wide. Video can be rendered at 4K resolution and text appears sharp from any angle. </p>\n\n\n\n<p>There are two individually amplified drivers inside each audio pod that can deliver Personalized Spatial Audio based on the user’s own head and ear geometry. As a result, the sound feels like it is coming from the space around you. Vision Pro also matches the sound to the room using audio raytracing. There’s also an advanced sensor array. </p>\n\n\n\n<p>Inside the lenses, a high-performance eye-tracking system uses cameras and a ring of LEDs to project invisible light patterns on the user’s eyes. As a result, the Apple headset is able to tell what way the user is looking and use high-performance eye tracking to control the interface. There are no external accessories other than controllers for playing games.</p>\n\n\n\n<p>The Vision Pro also recognizes the user’s iris via a new method to unlock the device and authenticate passwords and purchases called Optic ID. Like the iPhone and Mac, all data is stored on a dedicated Secure Enclave processor.  </p>\n\n\n\n<p>There’s also a nifty feature called EyeSight that projects the correct perspective of your eyes to the people looking at you. EyeSight also includes a visual indicator that makes it clear to others when a user is capturing a spatial photo or video.</p>\n\n\n\n<h3>Apple Vision Pro: Battery life </h3>\n\n\n\n<p>Apple says the Vision Pro’s external battery pack provides up to two hours of use. It can also be used while plugged in.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Vision-Pro-apps-interface.jpg?quality=50&amp;strip=all\" alt=\"Vision Pro Apps interface\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Vision-Pro-apps-interface.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Vision-Pro-apps-interface.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Vision-Pro-apps-interface.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Vision-Pro-apps-interface.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"683\" /></figure><p>Apple</p></div>\n\n\n\n<h2>Apple Vision Pro: Software and apps</h2>\n\n\n\n<p>With a Vision Pro headset users will be able to watch a movie, listen to music, browse photos, look at 3D objects, and even collaborate on a presentation. </p>\n\n\n\n<p>The Vision Pro headset will run visionOS, an operating system that Apple has designed from the ground up for visual computing. On June 21, Apple announced that the<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2023/06/developer-tools-to-create-spatial-experiences-for-apple-vision-pro-now-available/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\"> visionOS software development kit is now available</a> to members of the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Developer Program</a>. Next month, the company will open developer labs at its Cupertino, California headquarters, as well as in London, Munich, Shanghai, Singapore, and Tokyo. At the lab, developers can get hands-on experience with Apple Vision Pro hardware and support from Apple engineers. </p>\n\n\n\n<p>There will be an App Store via which users will be able to download familiar iPhone and iPad apps as well as new apps designed for Vision Pro. Apple says that there will be lots of apps available at launch, including Microsoft Office Apps, third-party video conferencing apps, and Adobe Lightroom. Apple also previewed a SkyGuide app that can “transfer” you to space.</p>\n\n\n\n<p>Apple says that Vision Pro “makes new types of games possible”. Apparently, users will be able to play over 100 Apple Arcade games on a screen as large as they want with support for popular game controllers. </p>\n\n\n\n<p>There will also be a number of well-known Apple apps available at launch, such as Safari, Messages, and FaceTime. Here are some of the apps you can expect to see: </p>\n\n\n\n<h3>Video Conferencing</h3>\n\n\n\n<p>FaceTime will be available for the Vision Pro and will be able to take advantage of the room around you so that you can see everyone you are talking to in life-size tiles. The participant’s voice will also come from the direction of their tile thanks to Spatial Audio. </p>\n\n\n\n<p>Apple has created a novel solution to the fact that you have a mask on and don’t have a camera in front of you. It can show call participants a ‘Persona’–a digital representation of the user created using Apple’s most advanced machine-learning techniques. The Persona is based on your appearance and can even reflect face and hand movements in real-time.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Eye-Sight-Apple-Reality-Pro.jpg?quality=50&amp;strip=all\" alt=\"Apple Reality Pro Eye Sight\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Eye-Sight-Apple-Reality-Pro.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Eye-Sight-Apple-Reality-Pro.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Eye-Sight-Apple-Reality-Pro.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Eye-Sight-Apple-Reality-Pro.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"683\" /></figure><p>Apple</p></div>\n\n\n\n<h3>TV and movies</h3>\n\n\n\n<p>Entertainment was a major part of the WWDC presentation, with Apple showing off an immersive experience when watching movies and TV shows. With the new Cinema Environment, you’ll be able to watch shows and movies “at the frame rate and aspect ratio the filmmaker intended with immersive Spatial Audio” and watch movies on what feels like a 100-feet screen. Vision Pro will also support 3D movies including Avatar: Way of the Water.</p>\n\n\n\n<p>The latest update to the <a href=\"https://www.macworld.com/article/2065533/airpods-pro-2-case-usb-c-iphone-15-charging.html\">AirPods Pro with a USB-C case</a> added support for lossless audio when used with an Apple Vision Pro headset. </p>\n\n\n\n<h3>Photos and videos</h3>\n\n\n\n<p>You’ll be able to take spatial photos and spatial videos in 3D with Vision Pro, and then “relive those cherished moments like never before with immersive Spatial Audio.” And of course, you’ll be able to view your plain 2D photos and videos as well, for example, Panorama photos shot on an iPhone will expand and wrap around the user.</p>\n\n\n\n<p>In <a href=\"https://www.macworld.com/article/2117707/ios-17-2-beta-is-out-now-and-includes-the-journal-app.html\">iOS 17.2</a>, there’s a new option in the Camera settings to record spatial vision for Vision Pro.</p>\n\n\n\n<h2>Disney+</h2>\n\n\n\n<p>Disney CEO Bob Iger joined Apple on stage to demonstrate his excitement about the new technology. In a video demo, he showed movies, TV shows, and sports on Vision Pro that bring entertainment to new levels, including special movie presentations, court-side views, and interactive experiences. Iger said Disney content will be available on day one.</p>\n\n\n\n<h2>Apple Vision Pro experience: What is is like to use Vision Pro</h2>\n\n\n\n<p>Macworld’s Roman Loyola was able to spend an hour <a href=\"https://www.macworld.com/article/1944516/apple-vision-pro-hands-on-feaures-design-fit.html\">wearing a Vision Pro</a>, an experience he described as “emotional, immersive, and completely captivating.” </p>\n\n\n\n<p>The device he tried on was an early beta, so it’s possible—likely even—that the hardware or software could change before next year</p>\n\n\n\n<p>During the keynote presentation that introduced Vision Pro Apple said that the Vision Pro input system is controlled by a person’s eyes, hands, and voice. But the real control happens with your eyes: Vision Pro is able to detect exactly where you are looking. As a result, users can browse through apps by simply looking at them, tapping their fingers to select, flicking their wrist to scroll, or using voice to dictate. You can just look at a text input and begin dictating, for example. </p>\n\n\n\n<p>Loyola confirmed that you don’t have to hold out your arms to gesture to control the interface, you navigate by looking at what you want to see, and then use hand gestures to perform actions. Loyola said he didn’t have too hard a time adjusting from a using fingers to tap icons to using his eyes and that “Eye tracking was accurate and didn’t feel like it put a strain on my eyes,” he reported. It took about 20 minutes for controlling the interface this way to feel natural, Loyola said.</p>\n\n\n\n<p>When you first put on Vision Pro you see your surroundings. You can freely move apps to fill the space around you and they can expand into your space. Apple says you can control how immersed you are in Vision Pro with a twist of the Digital Crown. </p>\n\n\n\n<p>Loyola described being put right in the middle of the recorded memory that “triggered memories and emotions of my own from similar moments.” He said that the immersive video gave him “thrills,” explaining: “My body reacted to situations and my mind responded to the sights and sounds.” In one demo, Loyola “got to pet a freakin’ dinosaur. Not a beast that looks like a 3D model set against an illustrated background, but a realistic-looking dinosaur that sniffed my hand and let me pet it.” It all sounds pretty impressive. </p>\n\n\n\n<p>According to Loyola, you do see the headset while wearing it, though it doesn’t interfere with the sense of immersion.</p>\n\n\n\n<p>While there are other headsets that can offer an immersive experience, Loyola notes that “the difference with the Apple Vision Pro is the two displays set in front of each eye. The resolution and color they display are fantastic and make things look realistic.” While Loyola did experience some pixelation and playback stutter (of the people in the room with him not of the videos) he was impressed. </p>\n\n\n\n<p>If you are concerned that the Vision Pro might not fit you, fear not. Loyola, who feels that his head is large, said that “when I first put the Apple Vision Pro on, I had to tighten–not loosen–the straps to get a proper fit”. He added: “The headset had a Velcro strap that goes across the top of your head–this strap is not shown in Apple’s product photos or videos. I think that after the measurements were taken of my head, Apple determined that I would benefit from this top strap”. There is also a Light Seal that fits across the forehead where the eyebrows are, Apple said that this seal is available in multitudes of shapes and sizes to ensure the perfect fit. </p>\n\n\n\n<p>After wearing the Vision Pro for an hour Loyola said that he didn’t have any fatigue in his neck or any tenderness where the headset and straps hugged his head. There were some reports of testers suffering from soreness around the top of their head, but it’s very possible they were also dealing with sunburn since Apple’s keynote had been delivered outside in bright sunlight. </p>\n\n\n\n<p>Apple described one design goal of Vision Pro as being to be “Never isolated from the people around you”. It achieves this in various ways, one is by displaying your eyes when there is someone near you. This is called EyeSight and it is designed to send a clear signal to people that you can’t see them when that is the case. Similarly, if someone is near by they will appear in your view. This way it should still be easy to interact with the world around you while wearing the headset.</p>\n\n\n\n<p>A user can bring Mac wirelessly into Apple Vision Pro just by looking at it. The contents of the Mac screen are then brought on to the 4K display you see through the Vision Pro. Loyola wasn’t able to test this feature. </p>\n\n\n\n<p>An advanced Spatial Audio system is core to the Apple Vision Pro experience, creating the feeling that sounds are coming from the environment around the user and matching the sound to the space, according to Apple. The Vision Pro will also work seamlessly with familiar Bluetooth accessories, according to Apple.  </p>\n\n\n\n<h2>Apple Vision Pro: Terminology</h2>\n\n\n\n<ul>\n<li>VR = Virtual Reality (completely replaces your view)</li>\n\n\n\n<li>AR = Augmented Reality (overlays real world with graphics and information)</li>\n\n\n\n<li>MR = Mixed Reality (combining AR and VR) </li>\n\n\n\n<li>XR = Extended Reality (combining AR, VR and MR)</li>\n</ul>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/apple-ar-glasses-patent-illo.jpg?quality=50&amp;strip=all\" alt=\"Apple AR glasses patent illustration\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/apple-ar-glasses-patent-illo.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2021/08/apple-ar-glasses-patent-illo.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2021/08/apple-ar-glasses-patent-illo.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2021/08/apple-ar-glasses-patent-illo.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"683\" /><figcaption>An early Apple Patent</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Apple Vision Pro: Problems and prohibitions</h2>\n\n\n\n<p>If you have any of the following conditions you may not be able to use an Apple headset. </p>\n\n\n\n<figure><div>\n<blockquote><p>If you’re prone to inner ear infections, have ADHD/ADD, anxiety disorders, a pacemaker, epilepsy, blackouts/seizures or are pregnant, you may be warned against using the headset. In addition to Meniere's disease, past traumatic brain injuries, post-concussion syndrome, migraines. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/fuasZ1Cy8F&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">https://t.co/fuasZ1Cy8F</a></p>— Mark Gurman (@markgurman) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/markgurman/status/1664709177195876391?ref_src=twsrc%5Etfw&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">June 2, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Those are all standard limitations for VR headsets, but nonetheless it illustrates the fact that this headset won’t be for everyone.  </p>\n\nComputer Accessories</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4402e4c7d53e38065d40cbb2c7d870777acef1dad8901703ae6e224c6a4bdf23","category":"Apple"}