{"title":"Beeper Mini for Android sends and receives iMessages, no Mac server required","link":"https://arstechnica.com/?p=1988361","date":1701788447000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/beeper_pixel3_redux-800x610.jpg\" alt=\"Beeper messages looking iMessage-like blue on an Android phone\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/beeper_pixel3_redux.jpg\">Enlarge</a> <span>/</span> A Pixel 3, messaging a savvy iPhone owner, one with the kinds of concerns Beeper hopes to resolve for its customers. (credit: Kevin Purdy)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In the past week, I have sent an iMessage to one friend from a command-line Python app and to another from a Pixel 3 Android phone.</p>\n<p>Sending an iMessage without an Apple device isn't entirely new, but this way of doing it is. I didn't hand over my Apple credentials or log in with my Apple ID on a Mac server on some far-away rack. I put my primary SIM card in the Pixel, I installed <a href=\"https://play.google.com/store/apps/details?id=com.beeper.ima\">Beeper Mini</a>, and it sent a text message to register my number with Apple. I never gave Beeper Mini my Apple ID.</p>\n<p>From then on, my iPhone-toting friends who sent messages to my Pixel 3 saw them as other-iPhone blue, not noticeably distracting green. We could all access the typing, delivered/read receipts, emoji reactions, and most other iPhone-to-iPhone message features. Even if I had no active Apple devices, it seems, I could have chosen to meet Apple users where they were and gain end-to-end encryption by doing so.</p></div><p><a href=\"https://arstechnica.com/?p=1988361#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1988361&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"440560307eb01fd0f47c4b792ae4a944e888c9511414bdc1c612607b95ae0e63","category":"Tech"}