{"title":"Combinations of Terminalia bellirica (Gaertn.) Roxb. and Terminalia chebula Retz. Extracts with Selected Antibiotics Against Antibiotic-Resistant Bacteria: Bioactivity and Phytochemistry","link":"https://www.preprints.org/manuscript/202409.1612/v1","date":1726824467000,"content":"Antimicrobial resistance (AMR) is a worsening global health crisis that has arisen due to antibiotic overuse and misuse. Antibiotic resistance renders standard treatments less effective, making it difficult to control some infections, thereby increasing morbidity and mortality. Medicinal plants are sustainable treatment options that are becoming increasingly important as antibiotics lose their efficacies. The present study evaluates the antibacterial activity of aqueous, methanolic and ethyl acetate extracts prepared using Terminalia bellirica and Terminalia chebula fruit against six bacterial pathogens using disc diffusion and broth microdilution assays. The aqueous and methanol extracts of T. bellirica and T. chebula showed substantial zones of inhibition (ZOIs) against S. aureus and MRSA. The activity against those bacteria was determined to be strong, with minimum inhibitory concentrations (MIC) ranging from 94 µg/mL to 392 µg/mL. Additionally, the T. bellirica methanolic extract showed noteworthy antibacterial activity against E. coli and an ESBL E. coli strain (MIC values of 755 µg/mL for both). The aqueous T. bellirica and T. chebula extracts also inhibited K. pneumoniae growth (MIC values of 784 µg/mL and 556 µg/mL respectively), whilst the methanolic extracts of these plants also inhibited ESBL K. pneumoniae growth (MIC values of 755 µg/mL and 1509 µg/mL respectively). Eighteen additive interactions were observed when extracts were combined with reference antibiotics. Notably, strong antagonistic interactions occurred when any of the extracts were mixed with polymyxin B. All extracts were subjected to LC-MS analysis, revealing several interesting flavonoids and tannins, including 6-galloylglucose, 1,2,6-trigalloyl-β-D-glucopyranose, 6-O-[(2E)-3-phenyl-2-propenoyl]-1-O-(3,4,5-trihydroxybenzoyl)-β-D-glucopyranose, propyl gallate, methyl gallate, sanguiin H4, hamamelitannin, pyrogallol, gallic acid, ellagic acid, chebulic acid, and chebuloside II. All extracts were nontoxic when tested in brine shrimp assays. This lack of toxicity, combined with their antibacterial activities suggests that these plant species may be promising sources of antibacterial compound(s) that warrant further study.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"440739abad80199af56ceeb5fbc6c26bd0b4ead5ce25accbb7a17cb9cce4da8b","category":"Interdisciplinary"}