{"title":"New – FreeRTOS Extended Maintenance Plan for Up to 10 Years","link":"https://aws.amazon.com/blogs/aws/new-freertos-extended-maintenance-plan-for-up-to-10-years/","date":1638469276000,"content":"<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/19/freertos-logo.png\" />Last AWS re:Invent 2020, we announced <a href=\"https://aws.amazon.com/blogs/aws/new-freertos-long-term-support-to-provide-years-of-feature-stability/\">FreeRTOS Long Term Support</a> (LTS) that offers a more stable foundation than standard releases, as manufacturers deploy and later update devices in the field. <a href=\"https://aws.amazon.com/freertos/\">FreeRTOS</a> is an open source, real-time operating system for microcontrollers that makes small, low-power edge devices easy to program, deploy, secure, connect, and manage.</p> \n<p>In 2021, FreeRTOS LTS released <a href=\"https://freertos.org/2021/03/freertos-long-term-support-now-includes-aws-iot-over-the-air-update-aws-iot-device-defender-and-aws-iot-jobs-libraries.html\">202012.01</a> to include <a href=\"https://freertos.org/ota/index.html\">AWS IoT Over-the-Air</a> (OTA) update, <a href=\"https://freertos.org/iot-device-defender/index.html\">AWS IoT Device Defender</a>, and <a href=\"https://freertos.org/iot-jobs/index.html\">AWS IoT Jobs</a> libraries that provides feature stability, security patches, and critical bug fixes for the next two years.</p> \n<p>Today, I am happy to announce <a href=\"https://www.freertos.org/EMP.html\">FreeRTOS Extended Maintenance Plan (EMP)</a>, which allows embedded developers to receive critical bug fixes and security patches on their chosen FreeRTOS LTS version for up to 10 years beyond the expiry of the initial LTS period. FreeRTOS EMP lets developers improve device security (or helps keep devices secure) for years, save on operating system upgrade costs, and reduce the risks associated with patching their devices.</p> \n<p>FreeRTOS EMP applies to libraries covered by FreeRTOS LTS. Therefore, developers have device lifecycles longer than the LTS period of 2 years and can continue using a version that provides feature stability, security patches, and critical bug fixes, all without having to plan a costly version upgrade.</p> \n<p>Here are main features of FreeRTOS EMP:</p> \n<table> \n <tbody> \n  <tr> \n   <td><strong>Features</strong></td> \n   <td><strong>Description</strong></td> \n   <td><strong>Why is it important?</strong></td> \n  </tr> \n  <tr> \n   <td>Feature stability</td> \n   <td>Get FreeRTOS libraries that maintain the same set of features for years</td> \n   <td>Save upgrade costs by using a stable FreeRTOS codebase for their product lifecycle</td> \n  </tr> \n  <tr> \n   <td>API stability</td> \n   <td>Get FreeRTOS libraries that have stable APIs for years</td> \n  </tr> \n  <tr> \n   <td>Critical fixes</td> \n   <td>Receive security patches and critical bug* fixes on your chosen FreeRTOS libraries</td> \n   <td>Security patches help keep their IoT devices secure for the product lifecycle</td> \n  </tr> \n  <tr> \n   <td>Notification of patches</td> \n   <td>Receive timely notification upcoming patches</td> \n   <td>Timely awareness of security patches helps proactively plan the deployment of patches</td> \n  </tr> \n  <tr> \n   <td>Flexible subscription plan</td> \n   <td>Extend maintenance by a year or longer</td> \n   <td>Continue to renew their annual subscription for a longer period to keep the same version for the entire device lifecycle, or for a shorter period to buy time before upgrading to the latest FreeRTOS version.</td> \n  </tr> \n </tbody> \n</table> \n<p><em>* A critical bug is a defect determined by AWS to impact the functionality of the affected library and has no reasonable workaround.</em></p> \n<p><strong><u>Getting Started with FreeRTOS EMP</u></strong><br /> To get started, subscribe to the plan using your AWS account, and renew the subscription annually or for a longer period to either cover their product lifecycle or until you are ready to transition to a new FreeRTOS LTS release.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/28/Site-Merch_FreeRTOS_EMP-ConsoleSign-In.png\" />Before the end of the current LTS period, you will be able to use your AWS account to complete the FreeRTOS EMP registration on the FreeRTOS console, review and agree to the associated terms and conditions, select the LTS version, and buy an annual subscription. You will then gain access to the private repository where you’ll receive .zip files containing a git repo with chosen libraries, patches, and related notifications.</p> \n<p>Under NDA, AWS will notify you via official AWS Security channels of an upcoming patch and its timelines (if AWS is reasonably able to do so and deems it appropriate). Patches will be sent to your private repository within three business days of successfully implementing and getting AWS Security approval for our mitigation.</p> \n<p>AWS will provide technical support for FreeRTOS EMP customers via separate subscriptions to <a href=\"https://aws.amazon.com/premiumsupport/\">AWS Support</a>. AWS Support is not included in FreeRTOS EMP subscriptions. You can track issues such as AWS accounts, billing, and bugs, or get access to technical experts such as patch integration issues based on your AWS Support plan.</p> \n<p><strong><u>Available Now</u></strong><br /> <a href=\"https://www.freertos.org/EMP.html\">FreeRTOS EMP</a> will be available for the current and all previous FreeRTOS LTS releases. Subscriptions can be renewed annually for up to 10 years from the end of the chosen LTS version’s support period. For example, a subscription for FreeRTOS 202012.01 LTS, whose LTS period ends March 2023, may be renewed annually for up to 10 years (i.e., March 2033).</p> \n<p>You can find more information on the <a href=\"https://aws.amazon.com/freertos/features/\">FreeRTOS feature page</a>. Please send us feedback on the <a href=\"https://forums.freertos.org/\">forum</a> of FreeRTOS or <a href=\"https://aws.amazon.com/premiumsupport/\">AWS Support</a>.</p> \n<p><a href=\"https://pages.awscloud.com/FreeRTOS-EMP-Extended-Maintenance-Plan.html\">Sign up</a> to get periodic updates on when and how you can subscribe to FreeRTOS EMP.</p> \n<p>— <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"44265c5b36ae110459dd36651b21a67f7af3c6da92bd28177c1e7fb53f9c31ba","category":"Tech"}