{"title":"The Relationship between Circulating Zonulin Levels and Renal Functions, Systemic Inflammation, and Endothelial Dysfunction in Patients with Chronic Kidney Disease Stages 3-5 Not on Dialysis","link":"https://www.preprints.org/manuscript/202409.2268/v1","date":1727694015000,"content":"Background and Objectives: Zonulin (Zo) is a molecule that has been identified as an intestinal permeability marker in recent years. It has been previously linked to type 2 diabetes mellitus, obesity, and cardiovascular disease, but its role in chronic kidney disease (CKD) remains unclear. This study aimed to investigate the relationship between Zo and systemic inflammation (SI), endothelial dysfunction (ED), and especially renal functions, in patients with CKD. Materials and Methods: One hundred sixty-three participants were enrolled in this study and were divided into two groups (patient and control), according to the presence of CKD. Results: A total of 104 patients with CKD (mean age: 58.9 ±1.4) and 59 control subjects (mean age: 59.0 ±1.1) were included, with similar age (p = 0.934) and gender (p = 0.196) between the groups. In the comparison analysis, plasma Zo levels in the CKD group (166.16 ± 53.54) were significantly higher than those in the control group (143.30 ± 60.92) (p &lt; 0.001). In the correlation analysis, the serum Zo level showed a positive correlation with claudin-3 (r = 0.612, p &lt; 0.001), IL-6 (r = 0.307, p &lt; 0.001), and creatinine (r = 0.313, p &lt; 0.001) and a negative correlation with glomerular filtration rate (GFR) (r = -0.320, p &lt; 0.001) and TC (r = -0.074, p = 0.047). Additionally, according to a linear regression analysis, the Zo level was significantly associated with GFR after adjusting for age and SBP (β value = -0.918, p = 0.012). Conclusion: High serum Zo levels in patients with CKD reflected increased intestinal permeability and were associated with impaired renal function. Moreover, it was thought that Zo level could be associated with SI, but novel clinical studies are needed to elucidate its relationship with ED.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"443f46ad62ca64a06bd778041a17f9c4b87953d167c4d1804979b4195ffdd68b","category":"Interdisciplinary"}