{"title":"Cycling Plus Summer issue on sale now! Subscribe and receive a free Ritchey Comp Skyline saddle worth £47.99","link":"https://www.bikeradar.com/news/cycling-plus-latest-issue-gift/","date":1623234840000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/BR_blog_image_381_new1-397c117.jpg?quality=45&amp;resize=620,413\" />                                            <p>In the Summer edition of <em>Cycling Plus</em> the team delves into the fruitful world of aerodynamics to test four of the most slippery bikes available today. Experience a first ride of Condor’s Super Acciaio Disc, test Zipp’s 303 Firecrest wheels and strap on eight pairs of the best shoes for gravel riding.</p>\n<p><em>Cycling Plus</em> examines the mental trickery of comeback king Primož Roglič and go on the hunt for wild food in Somerset with foraging king David Hamilton.</p>\n<p>It’s almost time for the Tour de France and this month <em>Cycling Plus</em> has its annual 36-page guide previewing the 108th edition of the great race.</p>\n<ul><li><a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPW381&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=ritchey_CPW381&amp;utm_content=editorial-link\" target=\"_blank\">Subscribe to Cycling Plus to receive your free gift as well as discounts and more</a></li>\n</ul><h2>How fast can you go?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Speed freaks, listen up…</span></figcaption><span></span></div>\n<p>Let’s be honest, going fast is one of the reasons a lot of us starting riding bikes and in this four-bike race to the finish line, the <em>Cycling Plus</em> team test a quartet of fast movers from Vitus, Cannondale, Scott and Felt to see which one pips at the post.</p>\n<h2>Wild riding</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Nuts in May: foraging for wild food</span></figcaption><span></span></div>\n<p><em>Cycling Plus</em>’s features editor, John Whitney, goes on a wild ride with forager David Hamilton and cooks up the results on a Somerset beach.</p>\n<h2>Rough minded</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The best gravel shoes tested</span></figcaption><span></span></div>\n<p>If you’re planning some excursions off the well-trodden path and onto rougher trails then make sure you’re shod appropriately with <em>Cycling Plus</em>’s test of eight of the best shoes on the shelf, with a guide of what to look for.</p>\n<h2>La Grande Boucle</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> 2021 Tour de France</span></figcaption><span></span></div>\n<p>The long-awaited Tour de France returns at the end of June and the <em>Cycling Plus</em> team has created a comprehensive guide to all the stages and asks the burning question on everyone’s lips: ‘Can anyone stop the Slovenians?’.</p>\n<h2>Subscription offer</h2>\n<div>\n    <img /></div>\n<p> </p>\n<p><a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPW381&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=ritchey_CPW381&amp;utm_content=editorial-link\" target=\"_blank\">Subscribe to Cycling Plus magazine today</a> to join a community of like-minded cyclists and discover the latest news and views in cycling.</p>\n<p>Whether you’re looking at investing in a new bike, trying a different kind of cycling or searching for new gear to make those days on the road more comfortable, <em>Cycling Plus</em> is the magazine for you.</p>\n<p>You’ll find engaging, inspiring features and photography on every page from across the UK and around the world, plus interviews with the movers and shakers breaking records in cycling and becoming household names.</p>\n<p><a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPW381&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=ritchey_CPW381&amp;utm_content=editorial-link\" target=\"_blank\">Subscribe today</a> and receive a free Ritchey Comp Skyline saddle worth £47.99.</p>\n<section><div>\n        <p><strong>Why subscribe?</strong></p>\n<ul><li><span>Save 35% </span>on the shop price*</li>\n<li>Receive a Ritchey Comp Skyline saddle worth £47.99</li>\n<li>Every issue delivered straight to your door</li>\n<li>Never miss an issue or supplement</li>\n<li>Exclusive offers and competitions with our Subs Zone!</li>\n</ul><p>\n\n    </p></div>\n    </section><p>You can <a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPW381&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=ritchey_CPW381&amp;utm_content=editorial-link\" target=\"_blank\">subscribe to Cycling Plus here</a> and check out the mag’s <a href=\"https://www.facebook.com/CyclingPlusMagazine/\" target=\"_blank\">Facebook</a>, <a href=\"https://www.instagram.com/cyclingplus/\" target=\"_blank\">Instagram</a> and <a href=\"https://twitter.com/cyclingplus\" target=\"_blank\">Twitter</a> accounts for all of the latest cycling news.</p>\n<p><em>*Offer open to new UK customers subscribing to the print edition only. Full details of the Direct Debit Guarantee will be provided and are available on request. Please allow 28 working days for delivery of your gift. You will receive 13 issues per year. Your subscription will start with the next available issue. If at any time you are dissatisfied please notify us in writing and we will refund you for all unmailed issues. 35% saving based on buying 13 issues at full UK shop price. In the unlikely event your selected gift is unavailable, we reserve the right to send an alternative gift. Offer ends: 07/07/21.</em></p>","author":"Katie Nicholls","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"443f19fb3817324ec96d66ef5c6868ab0480320837ffe45eec6234c1cfc92398","category":"Cycling"}