{"title":"Apple to Pay iPhone 7 Users in U.S. Who Experienced 'Loop Disease' Audio Issues","link":"https://www.macrumors.com/2024/01/17/apple-settlement-iphone-7-audio-issues/","date":1705518419000,"content":"Apple last year agreed to pay $35 million to settle a <a href=\"https://www.macrumors.com/2020/01/31/iphone-7-loop-disease-lawsuit-narrowed-proceeds/\">U.S. class action lawsuit</a> alleging that the iPhone 7 and iPhone 7 Plus were prone to audio issues due to a defective chip in the devices, and it has now started notifying eligible customers by email.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/iPhone-7-Plus-Jet-Black.jpg\" width=\"1600\" height=\"900\" />\r<br />\nYou may be eligible for a payment from Apple if you are a U.S. resident who owned an iPhone 7 or iPhone 7 Plus between September 16, 2016 and January 3, 2023, and reported audio issues covered by the settlement to Apple, and/or paid Apple out of pocket to have your iPhone repaired or replaced as a result of the covered audio issues.\r<br />\n\r<br />\nThose who did not receive a notice, but believe they are eligible to submit a claim, are instructed to email info@smartphoneaudiosettlement.com.\r<br />\n\r<br />\nThe deadline to select a payment method, object to the settlement, or opt out is June 3, with more details available on the <a href=\"https://smartphoneaudiosettlement.com/\">settlement notice website</a>. Those who paid Apple out of pocket could receive up to $349, while others could get up to $125, according to the proposed settlement, which requires approval by a California court on July 18.\r<br />\n\r<br />\nApple was <a href=\"https://www.macrumors.com/2019/05/07/apple-class-action-lawsuits-iphone-7-audio-issues/\">sued over the issue</a> in multiple U.S. states in 2019, with the complaints alleging that the company violated consumer protection laws and breached warranties. Despite agreeing to a settlement, Apple has denied any wrongdoing, and the court hearing the class action has not ruled in favor of Apple or the plaintiffs.\r<br />\n\r<br />\n<h2>\"Loop Disease\"</h2>\r<br />\nIn an internal document, obtained by <em>MacRumors</em> in May 2018, Apple <a href=\"https://www.macrumors.com/2018/05/04/apple-aware-of-iphone-7-mic-issue-ios-11-3/\">acknowledged a microphone issue affecting some iPhone 7 and iPhone 7 Plus models</a>:<blockquote>Some customers might report that after they've updated to iOS 11.3, the microphone on their iPhone 7 or iPhone 7 Plus doesn't work and the speaker button is grayed out when they make or receive a call.\r<br />\n\r<br />\n<strong>Symptoms:</strong>\r<br />\n- The speaker button is grayed out during calls\r<br />\n- Other people are unable to hear the customer on cellular or FaceTime calls\r<br />\n- If a customer plays back a video or voice memo that they've made after installing iOS 11.3, there is no sound</blockquote>The alleged defect is informally known as \"Loop Disease\" online. Despite acknowledging the issue internally, Apple never posted a service program about the issue on its website, and it never responded to our repeated requests for comment.\r<br />\n\r<br />\nAs far as an underlying cause, the class action lawsuit alleged that \"the materials used in the ‌iPhone‌'s external casing are insufficient and inadequate to protect the internal parts,\" eventually resulting in the audio chip losing electrical contact with the logic board due to \"flexion\" of the device's external casing during regular use. It's unclear how many iPhone 7 and iPhone 7 Plus units were affected in total.\r<br />\n\r<br />\nApple initially said its service providers could request a \"warranty exception\" for affected iPhones, which resulted in free repairs for at least some customers, but that abruptly ended in July 2018 after <a href=\"https://www.macrumors.com/2018/07/17/apple-ends-free-oow-iphone-7-mic-repairs/\">Apple deleted the document</a>. Afterwards, some customers <a href=\"https://www.macrumors.com/2018/12/17/iphone-7-microphone-defect/\">had to pay an out-of-warranty fee of around $300</a> in the U.S. for a fix.\r<br />\n\r<br />\nIf the settlement is approved, those customers will finally be able to get at least some of their money back from Apple after years of silence.\r<br />\n\r<br />\n<em>(Thanks, <a href=\"https://twitter.com/mbrkhrdt\">Michael Burkhardt</a>!)</em><div>Tag: <a href=\"https://www.macrumors.com/guide/lawsuit/\">Apple Lawsuits</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/17/apple-settlement-iphone-7-audio-issues/\">Apple to Pay iPhone 7 Users in U.S. Who Experienced 'Loop Disease' Audio Issues</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-to-pay-iphone-7-users-in-u-s-who-experienced-loop-disease-audio-issues.2416622/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"44423115bc15ce323a703e5199ba8cf66562e9c8e9794ba73061c1281b084c23","category":"Apple"}