{"title":"Earliest known burial in Africa is that of a small, fragile child","link":"https://arstechnica.com/?p=1763016","date":1620318033000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/PYS-cave-general-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/PYS-cave-general.jpg\">Enlarge</a> (credit: Mohammad Javad Shoaee)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>A child died two to three years into their life in the coastal highlands of what is now Kenya 78,000 years ago. Archaeological evidence suggests that survivors wrapped the small body tightly before laying it, curled on one side with the tiny head resting on a pillow, in a carefully dug pit in Panga ya Saidi cave. The child’s grave is now the oldest known example of people in Middle Stone Age Africa burying their dead.</p>\n<h2>A child called Mtoto</h2>\n<p>A thesaurus is a handy thing, but sometimes seemingly tiny differences in meaning can actually have a huge impact. Consider the implications of “disposing of bodies” versus “laying the dead to rest.” One of the things archaeologists are most interested in about the lives of the earliest members of our species—and our close relatives, now extinct—is when and how we first began to make that distinction.</p>\n<p>When did early humans stop viewing a dead human body as something smelly to be removed from the living area before it attracted scavengers and sickness? When did they decide it needed to be treated carefully to ensure safe passage to an afterlife—or perhaps give peace for the living?</p></div><p><a href=\"https://arstechnica.com/?p=1763016#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763016&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"44505fa79da54d1377b6ca44d93059c687ce79e1eebf538fecd7656573c42e75","category":"Tech"}