{"title":"Philips Hue Secure Contact Sensors Gain HomeKit Support","link":"https://www.macrumors.com/2023/11/17/philips-hue-secure-contact-sensors-support-homekit/","date":1700222121000,"content":"Signify has released new Philips Hue Contact Sensor firmware that adds support for Apple HomeKit, reports <em><a href=\"https://hueblog.com/2023/11/16/hue-secure-contact-sensor-now-compatible-with-homekit/\">Hueblog.com</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/hue-secure-contact-sensor.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nPreviously the indoor sensors could only be controlled through the Philips Hue app's Security Center. Now, after updating to the new firmware (1961076030), they appear in the Home app, where users can use the \"open\" and \"closed\" status of the sensors to create automations and control other HomeKit devices that are not connected to the Philips Hue Bridge. \r<br />\n\r<br />\nReleased in September, the Philips Hue Secure Contact Sensor can be applied to doors, windows, cabinets, and more, sending notifications when the contact sensor is opened or closed. Users can remotely activate an alarm that flashes the lights, sounds a siren, and contacts local authorities, plus there are options for customizing camera settings. \r<br />\n\r<br />\nAs with Philips Hue Secure cameras, the sensors can be linked to lights to activate them when the sensor is triggered, so they can be used for things like turning on the lights in the bathroom when the door is opened.\r<br />\n\r<br />\n<a href=\"https://www.philips-hue.com/en-us/p/hue-secure-contact-sensor/046677580995\">Philips Hue Secure Contact Sensors</a> are priced at $40 for one or $70 for a two-pack, and various mounts and other add-on hardware can be purchased for $15 to $50. More information is available on the <a href=\"https://www.philips-hue.com/en-us/p/hue-secure-contact-sensor/046677580995\">Hue website</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/philips-hue/\">Philips Hue</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/17/philips-hue-secure-contact-sensors-support-homekit/\">Philips Hue Secure Contact Sensors Gain HomeKit Support</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/philips-hue-secure-contact-sensors-gain-homekit-support.2411248/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4451c0535521e8e49b516ac1657aaeb85e8d2d9ba181afa8cdfb227b5d1449c4","category":"Apple"}