{"title":"A motor doper speaks, but is she the only one?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-motor-doper-speaks-but-is-she-the-only-one","date":1707230470000,"content":"\n      <p><span>I was midway through writing a script for an episode of my podcast about motor doping, </span><a href=\"https://lnk.to/GhostInTheMachine\" target=\"_blank\"><span>Ghost In The Machine</span></a><span>, when my producer sent me a message that read: “I just cannot FATHOM the arrogance to be whizzing around a race with a motor in your bike. It’s insane.”</span></p>\n<div></div>\n<div></div>\n<p><span>As someone who, unlike my producer, makes a living from writing and speaking about cycle racing, I shared his feelings. Who’d be so stupid, immoral, dishonest and fraudulent to whack a tiny concealed motor inside a frame or wheel and then try to win a race with said modified bike? It’s beyond comprehension.</span></p>\n<p><span>Yet in the past year my thoughts on motor doping have gone from believing it to being nothing short of a conspiracy, to finding out that cycling almost universally agrees that motors have previously been used in the biggest of bike races, and to knowing that, even with a trio of detection systems now in place, it is still possible in 2024 to get away with this most outlandish form of cheating. Let me, and the podcast, explain why.</span></p>\n<h3><span>Breaking the silence</span></h3>\n<p><span>Ghost In The Machine, a Stak podcast that is initially a five-part series with at least a further two episodes in production, examines the suspicions and threat of motor doping through the lens of the only sanctioned motor doper in the sport’s history, that of Belgian rider Femke Van den Driessche. A motor was found in her spare bike at the 2016 Cyclo-cross World Championships - coincidentally or not, on the very first day motor-detecting tests were introduced.</span></p>\n<p><span>Alongside explaining the different type of motors, how they work, where they can be sourced from, and what it’s like to ride a motorised bike (I was genuinely stunned by how subtle, light and powerful they are when I rode one), I try to get to the bottom of what led Van den Driessche to take the risk she did, and to figure out whether she was the only one to attempt such a brazen form of cheating, or if she was the just the one unlucky one to be caught; in other words, was she scapegoated by the UCI, cycling’s governing body, to deter bigger names? And was she also a victim of her chaotic background? My journey towards answers involves death threats, chemical doping, and several bizarre tangents that, if nothing else, will keep you entertained.</span></p>\n<p><span>Van den Driessche has always denied that the bike with the motor in it was hers, claiming that it belonged to a family friend, Nico. In episode four of the podcast, both Van den Driessche and Nico finally break their silence after eight years. I won’t reveal too much about what they say, except to reveal that this case had a profoundly negative and life-altering effect on one of their lives. What was most concerning, when zooming out and looking at the wider question of motor doping, was that Nico claimed around 50 cyclists asked him to install a motor in their bikes in the aftermath of Van den Driessche being caught. He was tight-lipped if any of those apparently requesting help were professionals. </span></p>\n<h3><span>Flames of suspicion</span></h3>\n<p><span>I have never thought that Van den Driessche was part of a systemised motor operation – her case appears to have been orchestrated entirely by her inner circle – but Nico’s revelation only fanned the flames of suspicion that more pro riders have tried to cheat in this way. Indeed, during the course of my investigation I have learned that the doubts are widespread and go far beyond the popular YouTube videos many cite, and I’ve been struck by how many informed people - including some of the most senior individuals at the highest level of cycling - fear that the sport has been duped multiple times over. </span></p>\n<p><span>An Italian journalist, Marco Bonarrigo, explains in episode two that he found evidence of a major WorldTour team buying bikes with a concealed motor inside them, but could not prove that they were used in races; similarly, French investigative reporter Thierry Vildary reveals that a former mechanic of a big star was prepared to share incriminating information about hidden motors, only to back down when he was hastily paid off. The opinion that motor doping is not limited to Van den Driessche is only strengthened by the fact that no tests were in place to detect motors until the day one was found in her spare bike. It was literally so easy to get away with – it was almost impossible to be caught.</span></p>\n<p><span>Today, there are three forms of testing undertaken by the UCI, but there is not a lot of faith in the magnetic iPad scanners and two forms of x-ray technology, principally because they are not used as frequently as they ought to be. Many in the WorldTour peloton continue to point out to me that a doped bike could quite easily escape scrutiny, and others, including officials at major teams, have raised the idea that a motor being found in a high-profile rider’s bike would just be too damaging for the sport, and thus would be covered up. No independent authority overseeing the testing is a major red flag that must be addressed urgently. The more I’ve immersed myself in the topic, the more in-the-know people have alerted me to their suspicions and given me leads to work on. There are also growing hints that a big scandal could be around the corner.</span></p>\n<h3><span>Conscious of the threat</span></h3>\n<p><span>To the backdrop of all this is plenty of doses of reality. Van den Driessche remains the only one to have been caught in a professional race. All the conjecture, anecdotes and rumours are just that – no one has ever provided hard evidence of another rider using a motor. What’s more, multiple people in a team would have to be aware of a motor plot, and the school of thought goes that someone would surely feel too guilty about their involvement and eventually come clean; to date, there’s not been one whistleblower. In addition, pretty much everyone agrees that mechanical fraud is far worse than conventional doping, and being caught with a motor would spell the end of one’s career – like it did for Van den Driessche – and possibly lead to the closure of the implicated team. In summary, the risk is just too great for any professional rider to invest in a hidden motor. It’s easy to see why so many people think the topic is the fantasy of the conspiracists.</span></p>\n<p><span>But that doesn’t mean we should dismiss the threat. In sport, and especially in cycling, we have to perpetually be aware that people, sadly, will always be tempted to cheat. I don’t know if motor doping is happening today – and I share the scepticism many have for the reasons outlined above – but I do know it’s still possible, and I also strongly believe that the UCI need to improve how they tackle technological fraud. </span></p>\n<p><span>I hope that Ghost In The Machine generates a much-needed debate around motor doping, because it’s only by being conscious of its threat can we truly prevent another case like Van den Driessche’s.</span></p>\n<p><i><span>Chris Marshall-Bell is a freelance sports journalist who writes regularly for Rouleur, among others. He is based in Valencia, Spain.</span></i></p>\n<p><i><span>Ghost In The Machine is a Stak Production. Listen </span></i><a href=\"https://lnk.to/GhostInTheMachine\" target=\"_blank\"><i><span>now</span></i></a><i><span> wherever you get your podcasts.</span></i></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4459a3c6ef158dca7cecd9536bc9e1fdc3c6b524f6fd617d5a5985aa01d0b208","category":"Cycling"}