{"title":"Mild hypothermia pretreatment improves hepatic ischemia-reperfusion injury: A systematic review and meta-analysis of animal experiments","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305213","date":1719928800000,"content":"<p>by Li-juan Wei, Ke Wei, Shu-yu Lu, Min Wang, Chun-xi Chen, Hui-qiao Huang, Xiao Pan, Pin-yue Tao</p>\r\nBackground and aim <p>Mild hypothermia in hepatic ischemia-reperfusion injury is increasingly being studied. This study aimed to conduct a systematic evaluation of the effectiveness of mild hypothermia in improving hepatic ischemia-reperfusion injury.</p> Methods <p>We systematically searched CNKI, WanFang Data, PubMed, Embase, and Web of Science for original studies that used animal experiments to determine how mild hypothermia(32–34°C) pretreatment improves hepatic ischemia-reperfusion injury(in situ 70% liver IR model). The search period ranged from the inception of the databases to May 5, 2023. Two researchers independently filtered the literature, extracted the data, and assessed the risk of bias incorporated into the study. The meta-analysis was performed using RevMan 5.4.1 and Stata 15 software.</p> Results <p>Eight randomized controlled trials (RCTs) involving a total of 117 rats/mice were included. The results showed that the ALT levels in the mild hypothermia pretreatment group were significantly lower than those in the normothermic control group [Standardized Mean Difference (SMD) = -5.94, 95% CI(-8.09, -3.78), <i>P</i>&lt;0.001], and AST levels in the mild hypothermia pretreatment group were significantly lower than those in the normothermic control group [SMD = -4.45, 95% CI (-6.10, -2.78), <i>P</i>&lt;0.001]. The hepatocyte apoptosis rate in the mild hypothermia pretreatment group was significantly lower than that in the normothermic control group [SMD = -6.86, 95% CI (-10.38, -3.33), <i>P</i>&lt;0.001]. Hepatocyte pathology score in the mild hypothermia pretreatment group was significantly lower than that in the normothermic control group [SMD = -4.36, 95% CI (-5.78, -2.95), <i>P</i>&lt;0.001]. There was no significant difference in MPO levels between the mild hypothermia preconditioning group and the normothermic control group [SMD = -4.83, 95% CI (-11.26, 1.60), <i>P</i> = 0.14]. SOD levels in the mild hypothermia preconditioning group were significantly higher than those in the normothermic control group [SMD = 3.21, 95% CI (1.27, 5.14), <i>P</i> = 0.001]. MDA levels in the mild hypothermia pretreatment group were significantly lower than those in the normothermic control group [SMD = -4.06, 95% CI (-7.06, -1.07) <i>P</i> = 0.008].</p> Conclusion <p>Mild hypothermia can attenuate hepatic ischemia-reperfusion injury, effectively reduce oxidative stress and inflammatory response, prevent hepatocyte apoptosis, and protect liver function.</p>","author":"Li-juan Wei","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"445af62ed0bb67a5978ddd0b98d9e07b682cbb5d50574137f5048775f6ad18c5","category":"Interdisciplinary"}