{"title":"Weak Sustainability at Regional Scale","link":"https://www.preprints.org/manuscript/202410.0900/v1","date":1728647352000,"content":"In principle, weak sustainability, WS, requires that inclusive wealth, IW, be non-decreasing. WS provides a more complete account of the sustainability of a geographical entity (e.g., the world, a nation, or a sub-national region) than sustainability indicators, SIs, on one hand, and conventional economic accounts (e.g., gross domestic product, GDP) on the other. We briefly summarize WS theory, noting that it was developed, implicitly, for a geographical space without internal boundaries. Empirical WS assessment was developed by international bodies (the World Bank and the UN Environmental Program) to shine light upon national governments that might be maintaining the current welfare of their citizens, but investing insufficiently in national assets to maintain intertemporal wealth. In so doing, the need arose to address a suite of issues stemming from national boundaries that may limit the mobility of people, resources, goods and services. WS assessment at sub-national levels (states and counties, in the case of the US) has similar motivations – to provide more complete accountability for regional officials who may be maintaining welfare by consuming assets – but the implications of cross-boundary flows are much greater given the porosity of regional boundaries. WS scholars and practitioners have arrived at a consensus that the appropriate criterion for WS status is IW/capita, i.e. the welfare of people should be sustained. Regional economists and economic geographers tend to associate regional success with population growth, which may increase total IW at some cost to individual welfare. We consider this issue in some depth – what is at issue, and how any conflict might be resolved – ultimately concluding that IW/capita is the appropriate criterion for WS assessment, while leaving broader questions of population ethics unresolved. We summarize recent research [1] that starts with the Arrow et al framework [2] and improves methods of assessing IW, especially its health capital component, and assesses IW/capita for all states and counties in the US. These improved methods reveal substantially more not-WS states and counties than the Arrow et al framework [2]. The not-WS counties exhibit a distinct rural bias, consistent with the hypotheses and empirical findings of regional scientists. Our work demonstrates that regional WS assessment is feasible, produces results that are consistent with prior expectations based on reasoning and empirical research, and has the potential to provide fresh insights into longstanding questions of regional development.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"445bb33598f810ebfdb85ccb129f4ba2173e08cb8984e9d8a20ce43ab23c00b5","category":"Interdisciplinary"}