{"title":"Collateral benefits: River flow normalization for endangered fish enabled riparian rejuvenation","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4255?af=R","date":1715076409000,"content":"<h2>Abstract</h2>\n<p>Like most rivers worldwide, the transboundary North American Kootenay/i River has experienced multiple impacts including watershed developments, river channelization, and floodplain clearing, draining, and diking. Construction of Libby Dam was authorized by the 1964 Columbia River Treaty (CRT) between the United States and Canada, and in 1975 began regulating downstream flows for flood risk management and hydropower generation. Following cumulative impacts, the endemic Kootenai River White Sturgeon population collapsed and was designated as endangered in 1994 (U.S. Endangered Species Act). Subsequent Biological Opinions from the U.S. Fish and Wildlife Service prescribed Libby Dam operations to provide springtime flow pulses for sturgeon spawning. These provided the unanticipated benefit of substantial seedling recruitment of native and introduced riparian cottonwoods and willows. The regulated flow regime was further adaptively managed to provide a more normative (natural) regime, to balance ecological functions with flood risk management and hydropower generation. The broadened ecological considerations would be consistent with the proposed priorities for the modernization of the international CRT. The observed responses revealed that (1) diverse aquatic and riparian organisms are dependent on common river flow characteristics; (2) a normalized flow regime provided substantial ecological benefits; and (3) due to multiple influences, hybrid ecosystems develop along regulated rivers, with a blending of natural and altered processes and communities. For other regulated rivers, we recommend that (1) high springtime flows be allowed, as feasible; (2) followed by the gradual post-peak recession; and (3) the maintenance of sufficient flows through the warm and dry interval of mid to late summer.</p>","author":"Stewart B. Rood, \nGregory C. Hoffman, \nNorm Merz, \nPaul Anders, \nRohan Benjankar, \nMichael Burke, \nGregory Egger, \nMary Louise Polzin, \nScott Soults","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"445d8850a3730bd20f18719133ad97c6f54a01c241a5cc25f7dc2440e0828c22","category":"Environment"}