{"title":"Discovery of allosteric regulators with clinical potential to stabilize alpha-L-iduronidase in mucopolysaccharidosis type I","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303789","date":1716213600000,"content":"<p>by Elena Cubero, Ana Ruano, Aida Delgado, Xavier Barril, Sara Morales, Ana Trapero, Lorenzo Leoni, Manolo Bellotto, Roberto Maj, Beatriz Calvo-Flores Guzmán, Natalia Pérez-Carmona, Ana Maria Garcia-Collazo</p>\r\n\r\nMucopolysaccharidosis type I (MPS I) is an inherited lysosomal disease caused by lowered activity of the enzyme alpha-L-iduronidase (IDUA). Current therapeutic options show limited efficacy and do not treat some important aspects of the disease. Therefore, it may be advantageous to identify strategies that could improve the efficacy of existing treatments. Pharmacological chaperones are small molecules that protect proteins from degradation, and their use in combination with enzyme replacement therapy (ERT) has been proposed as an alternative therapeutic strategy. Using the SEE-Tx<sup>®</sup> proprietary computational drug discovery platform, a new allosteric ligand binding cavity in IDUA was identified distal from the active site. Virtual high-throughput screening of approximately 5 million compounds using the SEE-Tx<sup>®</sup> docking platform identified a subset of small molecules that bound to the druggable cavity and functioned as novel allosteric chaperones of IDUA. Experimental validation by differential scanning fluorimetry showed an overall hit rate of 11.4%. Biophysical studies showed that one exemplary hit molecule GT-01803 bound to (Kd = 22 μM) and stabilized recombinant human IDUA (rhIDUA) in a dose-dependent manner. Co-administration of rhIDUA and GT-01803 increased IDUA activity in patient-derived fibroblasts. Preliminary <i>in vivo</i> studies have shown that GT-01803 improved the pharmacokinetic (PK) profile of rhIDUA, increasing plasma levels in a dose-dependent manner. Furthermore, GT-01803 also increased IDUA enzymatic activity in bone marrow tissue, which benefits least from standard ERT. Oral bioavailability of GT-01803 was found to be good (50%). Overall, the discovery and validation of a novel allosteric chaperone for rhIDUA presents a promising strategy to enhance the efficacy of existing treatments for MPS I. The compound’s ability to increase rhIDUA activity in patient-derived fibroblasts and its good oral bioavailability underscore its potential as a potent adjunct to ERT, particularly for addressing aspects of the disease less responsive to standard treatment.","author":"Elena Cubero","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"445e88055bc900eefde1c5674bdfb7f19e8665dee6aadbb99f106fb6f5798dfa","category":"Interdisciplinary"}