{"title":"Chiral analysis of amphetamine, methamphetamine, MDMA and MDA enantiomers in human hair samples","link":"https://academic.oup.com/jat/article/48/4/226/7645273?rss=1","date":1711670400000,"content":"<span><div>Abstract</div>A novel analytical method was developed for the simultaneous quantification of the R/S-enantiomers of amphetamine, methamphetamine, MDA and MDMA in hair samples using liquid chromatography-tandem mass spectrometry (LC–MS-MS). This method involved a straightforward derivatization step with dansyl chloride and the use of a chiral column, enabling the separation and quantification of all eight enantiomers in a single analysis. The method exhibited excellent linearity across a concentration range of 0.03–3.00 ng/mg for each enantiomer. Precision and accuracy were within acceptable limits, with bias and relative standard deviation (RSD) values consistently below 6% and 9%, respectively. Selectivity and specificity assessments confirmed the absence of any interference from contaminants or co-extracted drugs. The method demonstrated high sensitivity, with limits of detection (LOD) below 8 pg/mg and limits of quantification (LOQ) below 19 pg/mg for all analytes. Extraction recovery exceeded 79%, and matrix effects were minimal for all analytes. Processed sample stability evaluations revealed consistent results with deviations below 11% for all analytes. Application of the method to 32 authentic human hair samples provided valuable insights into amphetamine use patterns, allowing differentiation between medical amphetamine consumption and illicit use based on enantiomeric composition. Additionally, the method detected co-use of methamphetamine, MDA or MDMA in some samples, highlighting its applicability in drug monitoring and real-life case scenarios within a forensic institute. This innovative analytical approach offers a sensitive and selective method for enantiomeric differentiation of amphetamine, methamphetamine, MDA and MDMA in human hair samples, providing a valuable tool for forensic and clinical investigations.</span>","author":"","siteTitle":"Journal of Analytical Toxicology Current Issue","siteHash":"684cff8c881f5537e121ec409f4017c5ba6630e2a004f9595c9e918ac4254c23","entryHash":"4462451f1d1a5049072544927f1231d4ed27e55d482752dcd67a60e28a57bd72","category":"Environment"}