{"title":"Effect of Exogenous Nitric Oxide on Enterocytozoon hepatopenaei Copy Numbers and Immunity of Exopalaemon carinicauda","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/2250046?af=R","date":1678176000000,"content":"<p>To explore the effect of nitric oxide (NO) on <i>Enterocytozoon hepatopenaei</i> (EHP) invading the shrimp, sodium nitroprusside was used as an exogenous NO donor to investigate the effects of different concentrations (0 <i>μ</i>g/L (control group), 0.3 <i>μ</i>g/L, 0.6 <i>μ</i>g/L, and 0.9 <i>μ</i>g/L) of sodium nitroprusside on the EHP copy number and the structure in the hepatopancreas of <i>Exopalaemon carinicauda</i> infected by EHP. The results showed that the EHP copy number in the sodium nitroprusside group was significantly lower than that in the control group, and the hepatopancreas in the sodium nitroprusside injection group had less structure damage than the control group. Additionally, superoxide dismutase (SOD) activity in the control group and 0.3 <i>μ</i>g/L groups increased and then decreased, while alkaline phosphatase (AKP) activity decreased and then increased, with the same trend, and, the inducible nitric oxide synthase (iNOS) activity in the haemolymph of the 0.3 <i>μ</i>g/L group was significantly higher than that of the control group at 3 days (<i>P</i> &lt; 0.05). The NO content the 0.3 <i>μ</i>g/L group was also higher from 1 to 4 days than that in the control group and significantly higher than that in the control group at 3 days (<i>P</i> &lt; 0.05). The injection of NO could reduce the EHP copy number in infected <i>E. carinicauda</i> and slow down the pathological changes in the hepatopancreas structure, which might be related to the increase in NO content.</p>","author":"Haiyi Jiang, \nYongchuang Li, \nJing Xu, \nWanying Li, \nWazir Ali Baloch, \nFei Yu, \nHua Mu, \nHuan Gao, \nMohamed Abdelsalam","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"4464d34180b8780b5a5e0d5395a3df17a145c31081228ece89ad011fd38eaf7a","category":"Environment"}