{"title":"WebKit on VisionOS Will Support Open WebXR Content","link":"https://www-roadtovr-com.cdn.ampproject.org/c/s/www.roadtovr.com/apple-vision-pro-webxr-support-safari-model/amp/","date":1687545507000,"content":"\n<p>Ben Lang, writing for Road to VR:</p>\n\n<blockquote>\n  <p>In a somewhat surprising move, Apple confirmed that Safari on\nVision Pro will support WebXR. Prior to the reveal of the headset,\nit was an open question whether the company would entertain the\nidea of XR experiences through the browser, and even more so if\nthe company would adopt the relatively new <a href=\"https://immersiveweb.dev/\">WebXR\nstandard</a>. But now Apple has confirmed that Safari on\nVision Pro will indeed support WebXR.</p>\n\n<p>The company confirmed as much in its WWDC 2023 developer talk\ntitled <a href=\"https://developer.apple.com/videos/play/wwdc2023/10279/\">Meet Safari for Spatial Computing</a>, in which the\nApple explained the version of Safari running on Vision Pro is\n“truly is Safari with the same WebKit engine underneath, plus some\nthoughtful additions for [Vision Pro].”</p>\n\n<p>Thanks to Safari on visionOS being a fully-featured version of the\nbrowser, existing websites should work exactly as expected, the\ncompany says. But to go beyond flat web pages, Safari on visionOS\nincludes support for WebXR for immersive experiences and the new\n<code>&lt;model&gt;</code> tag for 3D models.</p>\n</blockquote>\n\n<p>I don’t find this surprising at all. Apple has always embraced open content and the web, to the extent that it makes sense in the overall platform experience. Web browsing on mobile phones was practically non-existent before the iPhone. (Steve Jobs aptly described the circa 2007 mobile web as “the baby Internet” <a href=\"https://thenextweb.com/news/genius-annotated-with-genius\">during the iPhone introduction</a>.)</p>\n\n<p>Perhaps most tellingly regarding VisionOS, <a href=\"https://www.linkedin.com/in/adarose/?originalSubdomain=uk\">Apple hired Ada Rose Cannon</a> a year ago — she’s co-chair of the W3C Immersive Web Working Group and <a href=\"https://ada.is/\">a preeminent figure</a> in the WebXR community.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/23/webkit-visionos-webxr\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"44647a13778c26445ff533597c34b8350ec8c4cfba3d6bbc79f4638ecb098f84","category":"Tech"}