{"title":"Drug-induced impairment of mitochondrial fatty acid oxidation and steatosis: assessment of causal relationship with 45 pharmaceuticals","link":"https://academic.oup.com/toxsci/article/200/2/369/7658967?rss=1","date":1714176000000,"content":"<span><div>Abstract</div>Drug-induced liver injury (DILI) represents a major issue for pharmaceutical companies, being a potential cause of black-box warnings on marketed pharmaceuticals, or drug withdrawal from the market. Lipid accumulation in the liver also referred to as steatosis, may be secondary to impaired mitochondrial fatty acid oxidation (mtFAO). However, an overall causal relationship between drug-induced mtFAO inhibition and the occurrence of steatosis in patients has not yet been established with a high number of pharmaceuticals. Hence, 32 steatogenic and 13 nonsteatogenic drugs were tested for their ability to inhibit mtFAO in isolated mouse liver mitochondria. To this end, mitochondrial respiration was measured with palmitoyl-<span>l</span>-carnitine, palmitoyl-CoA + <span>l</span>-carnitine, or octanoyl- <span>l</span>-carnitine. This mtFAO tri-parametric assay was able to predict the occurrence of steatosis in patients with a sensitivity and positive predictive value above 88%. To get further information regarding the mechanism of drug-induced mtFAO impairment, mitochondrial respiration was also measured with malate/glutamate or succinate. Drugs such as diclofenac, methotrexate, and troglitazone could inhibit mtFAO secondary to an impairment of the mitochondrial respiratory chain, whereas dexamethasone, olanzapine, and zidovudine appeared to impair mtFAO directly. Mitochondrial swelling, transmembrane potential, and production of reactive oxygen species were also assessed for all compounds. Only the steatogenic drugs amiodarone, ketoconazole, lovastatin, and toremifene altered all these 3 mitochondrial parameters. In conclusion, our tri-parametric mtFAO assay could be useful in predicting the occurrence of steatosis in patients. The combination of this assay with other mitochondrial parameters could also help to better understand the mechanism of drug-induced mtFAO inhibition.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"44651ae28b5e49c0c2387ce943b7961d537ea3b91aa549f8be1dc274f0152e87","category":"Environment"}