{"title":"Amazon Refuses to Allow Libraries to Buy the Books They Publish","link":"https://www.washingtonpost.com/technology/2021/03/10/amazon-library-ebook-monopoly/","date":1615584129000,"content":"\n<p>Geoffrey Fowler, writing for The Washington Post:</p>\n\n<blockquote>\n  <p>You probably think of Amazon as the largest online bookstore.\nAmazon helped make e-books popular with the Kindle, now the\ndominant e-reader. Less well known is that since 2009, Amazon has\npublished books and audiobooks under its own brands including\n<a href=\"https://amazonpublishing.amazon.com/lake-union-publishing.html\">Lake Union</a>, <a href=\"https://amazonpublishing.amazon.com/thomas-mercer.html\">Thomas &amp; Mercer</a> and <a href=\"https://www.audiblestudios.com/\">Audible</a>. Amazon is a beast\nwith many tentacles: It’s got the store, the reading devices and,\nincreasingly, the words that go on them.</p>\n\n<p>Librarians have been no match for the beast. When authors sign up\nwith a publisher, it decides how to distribute their work. With\nother big publishers, selling e-books and audiobooks to libraries\nis part of the mix — that’s why you’re able to digitally check\nout bestsellers like Barack Obama’s “A Promised Land.” Amazon is\nthe only big publisher that flat-out blocks library digital\ncollections. Search your local library’s website, and you won’t\nfind recent e-books by Amazon authors Kaling, Dean Koontz or Dr.\nRuth Westheimer. Nor will you find downloadable audiobooks for\nTrevor Noah’s “Born a Crime,” Andy Weir’s “The Martian” and\nMichael Pollan’s “Caffeine.”</p>\n</blockquote>\n\n<p>Looks like it’s time for the Justice Department to investigate Apple Books again.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Amazon Refuses to Allow Libraries to Buy the Books They Publish’\"  href=\"https://daringfireball.net/linked/2021/03/12/fowler-amazon-libraries\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"4471749e4a74bab63e9d1e2525a85cfa48cd09d9688ba5a10da23ac811f7e8d3","category":"Tech"}