{"title":"A review of bacterial disease outbreaks in rainbow trout (Oncorhynchus mykiss) reported from 2010 to 2022","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13886?af=R","date":1700043901000,"content":"<h2>Abstract</h2>\n<p>Outbreaks of bacterial infections in aquaculture have emerged as significant threats to the sustainable production of rainbow trout (<i>Oncorhynchus mykiss</i>) worldwide. Understanding the dynamics of these outbreaks and the bacteria involved is crucial for implementing effective management strategies. This comprehensive review presents an update on outbreaks of bacteria isolated from rainbow trout reported between 2010 and 2022. A systematic literature survey was conducted to identify relevant studies reporting bacterial outbreaks in rainbow trout during the specified time frame. More than 150 published studies in PubMed, Web of Science, Scopus, Google Scholar and relevant databases met the inclusion criteria, encompassing diverse geographical regions and aquaculture systems. The main bacterial pathogens implicated in the outbreaks belong to both gram-negative, namely <i>Chryseobacterium, Citrobacter, Deefgea Flavobacterium, Janthinobacterium, Plesiomonas, Pseudomonas, Shewanella,</i> and gram-positive genera, including <i>Lactococcus</i> and <i>Weissella,</i> and comprise 36 new emerging species that are presented by means of pathogenicity and disturbance worldwide. We highlight the main characteristics of species to shed light on potential challenges in treatment strategies. Moreover, we investigate the role of various risk factors in the outbreaks, such as environmental conditions, fish density, water quality, and stressors that potentially cause outbreaks of these species. Insights into the temporal and spatial patterns of bacterial outbreaks in rainbow trout aquaculture are provided. Furthermore, the implications of these findings for developing sustainable and targeted disease prevention and control measures are discussed. The presented study serves as a comprehensive update on the state of bacterial outbreaks in rainbow trout aquaculture, emphasizing the importance of continued surveillance and research to sustain the health and productivity of this economically valuable species.</p>","author":"Muhammed Duman, \nSoner Altun, \nIzzet Burcin Saticioglu, \nJesús L. Romalde","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"4478bc03a598aca6d656a7a5e0a918d226e5984916cb6bd45bf5df0de8c87058","category":"Environment"}