{"title":"Twitter US ad sales plunged 59%, and internal forecasts are grim, NYT reports","link":"https://arstechnica.com/?p=1944528","date":1685982903000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/getty-twitter-logo-laptop-800x533.jpg\" alt=\"Twitter logo is seen on a laptop screen and a smartphone screen.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/getty-twitter-logo-laptop.jpg\">Enlarge</a> (credit: Getty Images | Christopher Furlong )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Twitter's US advertising revenue plunged 59 percent year over year during a recent five-week period, The New York Times <a href=\"https://www.nytimes.com/2023/06/05/technology/twitter-ad-sales-musk.html\">reported</a> today. The firm's US ad \"revenue for the five weeks from April 1 to the first week of May was $88 million, down 59 percent from a year earlier, according to an internal presentation obtained by The New York Times.\"</p>\n<p>Owner Elon Musk said in an <a href=\"https://www.bbc.com/news/business-65248196\">April BBC interview</a>: \"I think almost all advertisers have come back or said they are going to come back.\" But internal projections are grim, according to the NYT report. One internal forecast cited by the NYT predicted that Twitter's US ad revenue in June \"will be down at least 56 percent each week compared with a year ago.\"</p>\n<p>Twitter \"has regularly fallen short of its US weekly sales projections, sometimes by as much as 30 percent,\" and that \"performance is unlikely to improve anytime soon, according to the documents and seven current and former Twitter employees,\" the NYT reported. \"Twitter's ad sales staff is concerned that advertisers may be spooked by a rise in hate speech and pornography on the social network, as well as more ads featuring online gambling and marijuana products, the people said.\"</p></div><p><a href=\"https://arstechnica.com/?p=1944528#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1944528&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"447c34a4929ef604b7c8db92111ffe9945b6860b1753f9ff681a90252618f5f3","category":"Tech"}