{"title":"Workplace Vaccination against COVID-19 and Seasonal Influenza in the United States: A Modeling Based Estimation of the Health and Economic Benefits for Employers and Employees","link":"https://www.preprints.org/manuscript/202407.1919/v1","date":1721805341000,"content":"Background: COVID-19 has a major impact on businesses, with employee absenteeism resulting in lost productivity and medical costs to employers as well as lost wages and medical costs to employees. The aim of this analysis was to assess the economic impact of workplace COVID-19 vaccination in the United States (US).Methods: A decision tree economic model, populated with US data for the working-age population, estimated the burden of COVID-19 in the workplace (symptomatic infections, long COVID cases, inpatient/outpatient care, absent days) with and without vaccination. Disease burden and impact of seasonal influenza vaccination was studied for context. Results: Without workplace vaccination, an average US business (with 10,000 employees), had an estimated 18,175 absent days from COVID-19, resulting in employer lost productivity costs of $5.08 million. Implementing COVID-19 workplace vaccination (at 70% US Healthy People target vaccination rate) prevented an estimated 3,132 absent days, saving employers $876,453 in lost productivity costs and $240,633 in medical costs. It also saved  employees $182,196 in medical costs  and $198,250 in lost wages . Seasonal influenza caused around 5,333 absent days, and seasonal influenza vaccination (at 70% coverage) prevented 1,675 absent days, saving employers $468,394 in lost productivity and saving  employees $27,757 in medical costs. Conclusions: COVID-19 remains a burden to US businesses. Implementing COVID-19 workplace vaccination and increasing vaccination coverage rates for COVID-19 and seasonal influenza has the potential to prevent a significant number of absent days, while providing employers and employees with cost savings from averted disease and its consequences.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"44b84533c7e15963002c5f1683dec71ca3ae2b8c84a97e11e07fcc84e7ca205b","category":"Interdisciplinary"}