{"title":"Neurological Sequelae of Post-COVID-19 Fatigue: A Review Of Dipeptidyl Peptidase IV-Mediated Cerebrovascular Complications","link":"https://www.preprints.org/manuscript/202410.0980/v1","date":1728789431000,"content":"Coronavirus disease 2019 (COVID-19) has been a global pandemic affecting millions of people’s lives, which has led to ‘post-COVID-19 fatigue’. Alarmingly, severe acute respiratory syn-drome-coronavirus 2 (SARS-CoV-2) not only infects the lungs but also influences the heart and brain. Endothelial cell dysfunction and hypercoagulation, which we know occur with this infection, lead to thrombo-inflammation that can manifest as many myriad cardio-cerebrovascular disorders, such as brain fog, fatigue cognitive dysfunction, etc. Additionally, SARS-CoV-2 has been associated with oxidative stress, protein aggregation, cytokine storm, and mitochondrial dysfunction in neurodegenerative diseases. Accordingly, the identification of molecular targets involved in these actions could provide strategies for preventing and treating this disease. In particular, the very common enzyme dipeptidyl peptidase IV (DPPIV) has recently been identified as a candidate co-receptor for the cell entry of the SARS-CoV-2 virus with its involvement in infection. In addition, DPPIV has been reported as a co-receptor for some viruses such as Middle East respiratory syn-drome-coronavirus (MERS-CoV). It mediates immunologic reactions and diseases such as type 2 diabetes mellitus, obesity, and hypertension, which have been considered the prime risk factors for stroke among other types of cardio-cerebrovascular diseases. Unlike angiotensin-converting enzyme 2 (ACE2), DPPIV has been implicated in aggravating the course of infection due to its disruptive effect on inflammatory signalling networks and the neuro–glia–vascular unit. Regarding the neurological, physiological, and molecular grounds governing post-COVID-19 fatigue, this review focuses on DPPIV as one of such reasons that progressively establishes cerebrovascular grievances following SARS-CoV infection.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"44c46a0d2a91f37e297df3c6d50af8532c482e6043f045cb477a094af5efa146","category":"Interdisciplinary"}