{"title":"Maternal folic acid and vitamin B12 supplementation during medium to late gestation promotes fetal development via improving placental antioxidant capacity, angiogenesis and amino acid transport","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13171?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Folic acid and vitamin B<sub>12</sub> (FV), being B vitamins, not only facilitate the remethylation of homocysteine (Hcy) but also contribute to embryonic development. This study aimed to assess the impact of FV supplementation during late pregnancy on sows' reproductive performance, amino acid metabolism, placental angiogenesis, and related parameters. Twenty primiparous sows at day 60 of gestation were randomly allocated to two groups: a basal diet (CON) group and a group receiving a basal diet supplemented with folic acid at 20 ppm and vitamin B<sub>12</sub> at 125 ppb.</p>\n<h2>RESULTS</h2>\n<p>The findings revealed that dietary FV supplementation significantly reduced the incidence of intrauterine growth retardation compared to the CON group (<i>P</i> &lt; 0.05). Furthermore, it led to a decrease in the Hcy levels in umbilical cord serum (<i>P</i> &lt; 0.05) and activation of the placental mechanistic target of rapamycin complex 1 (mTORC1) signaling pathway (<i>P</i> &lt; 0.05). Additionally, FV supplementation lowered placental malondialdehyde levels (<i>P</i> &lt; 0.05) and increased the expression of placental thioredoxin (<i>P</i> = 0.05). Moreover, maternal FV supplementation notably elevated placental vascular density (<i>P</i> &lt; 0.05) and the expression of sodium-coupled neutral amino acid transporter 2 (SNAT2) (<i>P</i> &lt; 0.05), as well as amino acid concentrations in umbilical cord blood (<i>P</i> &lt; 0.05).</p>\n<h2>CONCLUSION</h2>\n<p>Maternal FV supplementation during medium to late gestation reduced Hcy levels in umbilical cord blood and positively impacted fetal development. This improvement was closely associated with increased placental antioxidant capacity and vascular density, as well as activation of the placental mTORC1-SNAT2 signaling pathway. © 2023 Society of Chemical Industry.</p>","author":"Rui Zhou, \nLi Zhe, \nFangyuan Chen, \nTianle Gao, \nXiaoling Zhang, \nLingjie Huang, \nYong Zhuo, \nShengyu Xu, \nYan Lin, \nBin Feng, \nLianqiang Che, \nDe Wu, \nZhengfeng Fang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"44c92b01eba7b27a9b73b02cd0f4220d2b2a230b114f04d64036c53b9d888596","category":"Environment"}