{"title":"Zooplankton responses to simulated marine heatwave in the Mediterranean Sea using <i>in situ</i> mesocosms","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308846","date":1724767200000,"content":"<p>by Soultana Zervoudaki, Maria Protopapa, Andriana Koutsandrea, Anna Jansson, Ella von Weissenberg, Georgios Fyttis, Athanasia Sakavara, Kostas Kavakakis, Charitomeni Chariati, Katja Anttila, Pauline Bourdin, Behzad Mostajir, Francesca Vidussi, Jonna Engström-Öst</p>\r\n\r\nGlobally, marine heatwave frequency, intensity, and duration are on the rise, posing a significant threat to plankton communities, the foundational elements of the marine food web. This study investigates the ecological and physiological responses of a temperate plankton community in the Thau lagoon, north-western Mediterranean, to a simulated +3°C ten-day heatwave followed by a ten-day post-heatwave period in <i>in-situ</i> mesocosms. Our analyses encompassed zooplankton grazing, production, community composition in water and sediment traps, as well as oxidative stress and anti-oxidant biomarkers. The results revealed increased abundances of harpacticoid copepods and polychaete larvae during the simulated heatwave and post-heatwave event. Sediment trap data indicated elevated mortality, particularly dominated by polychaete larvae during the post-heatwave period. Oxidative stress biomarker (lipid peroxidation LPX) levels in the plankton community correlated with temperature, signaling cellular damage during the heatwave. LPX increased and proteins decreased with increasing salinity during the experiment. Offspring production peaked during the post-heatwave phase. Notably, the calanoid copepod <i>Acartia clausi</i> exhibited a preference for ciliates as its primary prey, constituting 20% of the overall available prey. Our findings suggest a potential shift in coastal zooplankton communities during future marine heatwaves, transitioning from calanoid mesozooplankton dominance to a system featuring meroplankton and/or harpacticoid copepods. Although species preying on microzooplankton may gain advantages in such conditions, the study underscores the damaging impact of heatwaves on organismal lipids, with potential consequences for reproduction, growth, and survival within marine ecosystems.","author":"Soultana Zervoudaki","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"44cc575e13f6db7d5ce82e59333687ff56ad6855c09ba19e1cfb6a69f62436d6","category":"Interdisciplinary"}