{"title":"RB1 Mutations Induce Smoking‐Related Bladder Cancer by Modulating the Cytochrome P450 Pathway","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24409?af=R","date":1725615315000,"content":"<h2>ABSTRACT</h2>\n<p>Cigarette smoking causes multiple cancers by directly influencing mutation burden of driver mutations. However, the mechanism between somatic mutation caused by cigarette smoking and bladder tumorigenesis remains elusive. Smoking-related mutation profile of bladder cancer was characterized by The Cancer Genome Atlas cohort. Integraticve OncoGenomics database was utilized to detect the smoking-related driver genes, and its biological mechanism predictions were interpreted based on bulk transcriptome and single-cell transcriptome, as well as cell experiments. Cigarette smoking was associated with an increased tumor mutational burden under 65 years old (<i>p</i> = 0.031), and generated specific mutational signatures in smokers. <i>RB1</i> was identified as a differentially mutated driver gene between smokers and nonsmokers, and the mutation rate of <i>RB1</i> increased twofold after smoking (<i>p</i> = 0.008). <i>RB1</i> mutations and the 4-aminobiphenyl interference could significantly decrease the <i>RB1</i> expression level and thus promote the proliferation, invasion, and migration ability of bladder cancer cells. Enrichment analysis and real-time quantitative PCR (RT-qPCR) data showed that <i>RB1</i> mutations inhibited cytochrome P450 pathway by reducing expression levels of <i>UGT1A6</i> and <i>AKR1C2</i>. In addition, we also observed that the component of immunological cells was regulated by <i>RB1</i> mutations through the stronger cell-to-cell interactions between epithelial scissor<sup>+</sup> cells and immune cells in smokers. This study highlighted that <i>RB1</i> mutations could drive smoking-related bladder tumorigenesis through inhibiting cytochrome P450 pathway and regulating tumor immune microenvironment.</p>","author":"Zhenguang Mao, \nFang Gao, \nTuo Sun, \nYi Xiao, \nJiajin Wu, \nYanping Xiao, \nHaiyan Chu, \nDongmei Wu, \nMulong Du, \nRui Zheng, \nZhengdong Zhang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"44ccf0fbd270bb0eaf9d5b4b96bdcf21655e83a8c37f568bd3b4ebf401750509","category":"Environment"}