{"title":"Genome-wide Identification and Characterization of the Terpenoid Synthase Gene Family in Physcomitrella patens","link":"https://www.preprints.org/manuscript/202409.2119/v1","date":1727600479000,"content":"Terpenoids are crucial secondary metabolites found in plants, essential for numerous physiological functions such as defense strategies, signal communication, and adaptation to environmental stresses. The enzymes referred to as Terpene Synthases (TPS) play crucial roles in the production of these compounds, fulfilling an essential role throughout the entire biosynthetic pathway.Despite their importance, systematic studies on the TPS genome in Physcomitrium patens (P. patens) remain inadequate. This research offers an extensive bioinformatics evaluation of the TPS genes in P. patens, aiming to clarify their possible functions in plant development, growth, and responses to stress. Preliminary examinations were conducted on the physicochemical characteristics, secondary protein structures, subcellular distribution, and genetic configurations of the TPS genes in P. patens. Initial analyses were performed on the physicochemical properties, protein secondary structures, subcellular localization, and gene structures of the TPS genes in P. patens. The findings demonstrate that TPS family members are dispersed across six chromosomes, with ten TPS family members identified. Analysis of conserved motifs revealed that the PpTPS members exhibit high sequence conservation, suggesting that these enzymes maintain stable structural characteristics during terpene synthesis. Further examination of evolutionary pressures indicated that TPS family members are predominantly subjected to purifying selection, which helps preserve the structural stability of TPS enzymes. Furthermore, an analysis of cis-acting elements indicated that TPS genes might respond to various factors, including light, plant hormones, tissue development, and environmental stressors. This suggests that TPS genes could be vital in managing how plants adapt to changes in their environment. Tissue expression profiling revealed that TPS family members have significant functions across various developmental stages and tissues. This is demonstrated by qRT-PCR analyses, indicating that the expression of the PpTPS gene is influenced by abscisic acid (ABA), methyl jasmonate (MeJA), sodium chloride (NaCl), and polyethylene glycol (PEG). The findings suggest that the PpTPS genes could play an essential role in the functional development of plant leaves and in their responses to abiotic stress.In summary, this research presents a comprehensive examination of the TPS family members in P. patens, yielding important perspectives on the functions of the PpTPS7 and PpTPS8 genes in the development of leaves and responses to abiotic stress.The findings contribute to a deeper understanding of the functions and regulatory mechanisms of TPS genes and present new perspectives and strategies for the enhancement and application of P. patens.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"44cd35687718697bbe34b676e6434d397e3145741b5abef570772214b6e33264","category":"Interdisciplinary"}