{"title":"Novel Aquareovirus isolated from channel catfish (Ictalurus punctatus) used in mussel restoration efforts in Wisconsin","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13938?af=R","date":1710141928000,"content":"<h2>Abstract</h2>\n<p>Channel catfish (<i>Ictalurus punctatus</i>) are a food fish extensively reared in aquaculture facilities throughout the world and are also among the most abundant wild catfish species in North America, making them a popular target of anglers. Furthermore, channel catfish are important members of aquatic ecosystems; for example, they serve as a glochidial host for the endangered winged mapleleaf mussel (<i>Quadrula fragosa</i>), making them critical for conserving this species through hatchery-based restoration efforts. During a routine health inspection, a novel aquareovirus was isolated from channel catfish used in mussel propagation efforts at a fish hatchery in Wisconsin. This virus was isolated on brown bullhead cells (ATCC CCL-59) and identified through metagenomic sequencing as a novel member of the family <i>Spinareoviridae,</i> genus <i>Aquareovirus</i>. The virus genome consists of 11 segments, as is typical of the aquareoviruses, with phylogenetic relationships based on RNA-dependent RNA polymerase and major outer capsid protein amino acid sequences showing it to be most closely related to golden shiner virus (aquareovirus C) and aquareovirus C/American grass carp reovirus (aquareovirus G) respectively. The potential of the new virus, which we name genictpun virus 1 (GNIPV-1), to cause disease in channel catfish or other species remains unknown.</p>","author":"Eric Leis, \nRyan Katona, \nSara Dziki, \nRebekah McCann, \nIsaac Standish, \nEryn Opgenorth, \nAudrey Dikkeboom, \nAilam Lim, \nCharlotte E. Ford, \nTony L. Goldberg","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"44d76df346d60e726185552649a37c79c1e7e02af90b4ebd25f26ede8166350d","category":"Environment"}