{"title":"Apple Now Allows Developers to Request Access to Additional iPhone Hardware and Software Features","link":"https://www.macrumors.com/2024/01/25/apple-interoperability-request-form/","date":1706219262000,"content":"To comply with the EU's Digital Markets Act, Apple has <a href=\"https://developer.apple.com/support/ios-interoperability/\">introduced</a> a new <a href=\"https://developer.apple.com/contact/request/interoperability/\">request form</a> that allows developers of iOS apps distributed in the EU to request additional interoperability with iPhone hardware and software features.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iPhone-15-General-Feature-Black.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nApple already offers developers more than 250,000 APIs, enabling them to access iPhone features and frameworks such as cameras, microphones, Bluetooth, HealthKit, SiriKit, and much more. Now, developers can request access to additional iPhone features and technologies for use in their apps in the EU, as they see fit.\r<br />\n\r<br />\nApple says it will evaluate interoperability requests on a case-by-case basis, and release additional APIs in future iOS versions as necessary. Apple says requests must be technically feasible and adhere to the Digital Markets Act.\r<br />\n\r<br />\nIt's unclear how many of these requests Apple will approve, if any.\r<br />\n\r<br />\nApple is already making the NFC chip in iPhones <a href=\"https://www.macrumors.com/2024/01/25/apple-nfc-third-party-apps-eu/\">accessible to third-party payment and wallet apps</a> in the EU, along with Iceland, Liechtenstein, and Norway, which will provide users with alternatives to Apple Pay and the Apple Wallet. This change was introduced with iOS 17.4, which is <a href=\"https://www.macrumors.com/2024/01/25/ios-17-4-alternative-app-marketplaces-eu/\">available in beta now</a> and will be released in March.\r<br />\n\r<br />\nThe <a href=\"https://developer.apple.com/contact/request/interoperability/\">request form</a> and <a href=\"https://developer.apple.com/support/ios-interoperability/\">additional details</a> can be found on Apple's website.<br />This article, \"<a href=\"https://www.macrumors.com/2024/01/25/apple-interoperability-request-form/\">Apple Now Allows Developers to Request Access to Additional iPhone Hardware and Software Features</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-now-allows-developers-to-request-access-to-additional-iphone-hardware-and-software-features.2417451/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"44dfea2f787e9538ebb6eb69597543b7b578a2f460ff08eed33c943d100db7f2","category":"Apple"}