{"title":"Riot Games จะบันทึกเสียง Voice Chat เพื่อแก้ปัญหาด่าทอ-เหยียด เริ่มที่ Valorant เกมแรก","link":"https://www.blognone.com/node/122462","date":1619836288000,"content":"<div><div><div><p>การคุยด้วยเสียงขณะเล่นเกมมัลติเพลเยอร์ (voice chat) กลายเป็นมาตรฐานไปแล้วในยุคสมัยนี้ สิ่งที่ตามมาคือปัญหาเรื่องด่าทอ กลั่นแกล้ง เกลียดชัง หรือเหยียดเพศ/เชื้อชาติ ซึ่งแก้ไขได้ยากกว่าบริการโซเชียลที่เน้นข้อความ (แบบ Facebook) เพราะไม่สามารถใช้ระบบอัตโนมัติเข้ามาดักจับคำพูดที่เป็นเสียงได้ง่ายนัก อีกทั้งเป็นการสนทนาสดๆ ไม่ได้มีบันทึกเสียงไว้ย้อนฟังภายหลัง</p>\n<p>ล่าสุด Riot Games เจ้าของเกมยิง Valorant ประกาศแก้ปัญหานี้ด้วยการบันทึกเสียงพูดขณะเล่นเกม เพื่อใช้วิเคราะห์ว่าเกิดปัญหาอะไรขึ้น หากมีผู้เล่นรายงานปัญหาเข้ามา</p>\n<p>Riot Games บอกว่าจำเป็นต้องปรับแก้เงื่อนไข Privacy Notice และ Terms of Service เพื่อให้ผู้เล่นยอมรับการบันทึกเสียงด้วย บริษัทยืนยันว่าไม่ได้ฟังเสียงผู้เล่นตลอดเวลา และจะมาเปิดฟังเมื่อได้รับแจ้งปัญหาเท่านั้น หากผู้เล่นไม่ต้องการให้บันทึกเสียง มีทางเดียวคือต้องปิดฟีเจอร์ voice chat</p>\n<p>นโยบายนี้ยังมีผลเฉพาะเกม Valorant เพียงเกมเดียวเท่านั้น ส่วนเกมอื่นๆ ของค่ายคือ League of Legends, Teamfight Tactics, Legends of Runeterra, Wild Rift ก็จะประกาศข่าวตามมาในอนาคต</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3e5a274a93332e673aec9b0534b3049d.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.riotgames.com/en/news/updating-the-privacy-notice-and-terms-of-service\">Riot Games</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/valorant\">Valorant</a></div><div><a href=\"/topics/riot-games\">Riot Games</a></div><div><a href=\"/topics/hate-speech\">Hate Speech</a></div><div><a href=\"/topics/racism\">Racism</a></div><div><a href=\"/topics/privacy\">Privacy</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"44e2341999728d0c707d516d8b4356133f76023fe53543ab60462c0513d7d1d2","category":"Thai"}