{"title":"An overview of the drivers of performance in nonbreeding Nearctic–Neotropical migratory songbirds","link":"https://academic.oup.com/auk/article/doi/10.1093/ornithology/ukae018/7693276?rss=1","date":1718323200000,"content":"<span><div>ABSTRACT</div>Developing conservation and recovery strategies for Nearctic–Neotropical migratory songbirds requires key research because population-limiting factors remain unknown for many species. In particular, the stationary nonbreeding period (sometimes referred to as overwintering) encompasses 6–8 months of the full annual cycle. We conducted a systematic review to assess what is known about the factors that influence individual-level performance (i.e., fitness proxies or indicators of self-maintenance) of Nearctic–Neotropical migratory songbirds during the stationary nonbreeding period. We focused on the metrics of apparent survival, persistence, and body condition (mass-related) indices. We found that 51 of 125 migratory Passeriformes species’ performance has been studied in 57 studies during the nonbreeding period. However, most species appear in only one study; thus, knowledge is skewed toward 3 species appearing in ≥ 10 studies. Body condition indices were the most studied group of metrics and apparent survival was the least studied. Habitat type, food availability, and precipitation were studied much more than other drivers, such as disease and predation. The most studied driver of nonbreeding performance was habitat type. Evidence was found among these studies that suggest that natural habitat types, wetter habitats or precipitation, and high availability of food may positively influence body condition, apparent survival, and persistence. Significant knowledge gaps remain that, if filled, could inform conservation strategies, especially for 59.2% of Passeriformes that are Nearctic–Neotropical migratory species and for areas of the nonbreeding range.</span>","author":"","siteTitle":"Ornithology Current Issue","siteHash":"4b42e15d9ceec568e037973cb16bc8a0448c103c6eaf3f714117d3650f8eefe7","entryHash":"44e53fd7519096c1509adfffe556866629889d2ef890a6a299391b5713585faa","category":"Environment"}