{"title":"Bartender 4 Now Supports macOS Big Sur, Gains Menu Bar Spacing Options, Quick Reveal, and More","link":"https://www.macrumors.com/2021/04/19/bartender-4-macos-big-sur-apple-silicon/","date":1618821523000,"content":"Surtees Studios has released <a href=\"https://www.macbartender.com/Bartender4/\">Bartender 4</a> for <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">macOS Big Sur</a>, following extended testing in public beta. As well as macOS 11 support, the popular tool for rearranging or hiding Mac menu bar items now runs native on <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> Macs and comes with several new features and core abilities.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/BartenderBar@2x.jpg\" />\r\n<br />\r\nWith Big Sur, Apple increased the space between menu bar items, which reduces the space available for icons. To alleviate this problem, Bartender 4 now allows users to revert to pre-Big Sur spacing or even use no spacing so to fit in more menu bar apps.\r\n<br />\r\n\r\n<br />\r\nBartender 4 also introduces menu bar spacers, which allow users to add spacers between groups of menu bar items that can either be just a configurable space, text, or even emoji, for grouping menu bar items into similar groups.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/bartender-4-spacing.jpg\" />\r\n<br />\r\nMeanwhile, there are new triggers for showing menu bar items, including image comparisons that show a menu bar item when it matches a particular state, and the ability to use scripts to show items, such as when VPNs or <a href=\"https://www.macrumors.com/guide/airpods/\">AirPods</a> connect, for example. Other built-in triggers include showing the battery icon when on battery power and showing Time Machine during a backup.\r\n<br />\r\n\r\n<br />\r\nWith the new Quick Reveal feature, users can now also get instant access to hidden menu bar items by moving their mouse to the menu bar, or alternately by clicking the menu bar.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/bartender-4-quick-reveal.gif\" />\r\n<br />\r\nElsewhere, there are improvements to Bartender's search function, which now sports a Spotlight-like interface with fuzzy search to very quickly find, show and activate menu bar items from your keyboard. It's also now possible to assign hotkeys to menu bar items to display them.\r\n<br />\r\n\r\n<br />\r\nIn addition, Bartender 4 introduces a new preferences screen to organize and order menu bar items, and choose where new menu bar items are placed.\r\n<br />\r\n\r\n<br />\r\n<a href=\"https://www.macbartender.com/\">Bartender 4</a> costs <a href=\"https://www.macbartender.com/Bartender4/purchase.html\">$15 after a free four-week trial</a>, while upgrading users get a 50% discount. Bartender 4 is also featured in <a href=\"https://go.setapp.com/stp86\">MacPaw's Setapp app store</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2021/04/19/bartender-4-macos-big-sur-apple-silicon/\">Bartender 4 Now Supports macOS Big Sur, Gains Menu Bar Spacing Options, Quick Reveal, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/bartender-4-now-supports-macos-big-sur-gains-menu-bar-spacing-options-quick-reveal-and-more.2292167/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=C8ip5q37hZQ:MRBR8bNXXKM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=C8ip5q37hZQ:MRBR8bNXXKM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/C8ip5q37hZQ\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"44e6b1e2f4478cb1cc685d4ca012965c7c82aa25d576b7246efaa0979ee13d7c","category":"Apple"}