{"title":"Diocletian และสี่จักรพรรดิ","link":"https://markpeak.net/diocletian-tetrachy/","date":1620921230000,"content":"<p>งานอดิเรกช่วงนี้คือสนใจประวัติศาสตร์จักรวรรดิไบแซนไทน์ (โรมันตะวันออก) เลยทำให้ต้องย้อนไปอ่านประวัติศาสตร์ของโรมันตะวันตกเพิ่มเติมด้วย</p>\n<p>หลายปีที่แล้วเคยไปเที่ยวเมือง Split ประเทศโครเอเชีย สถานที่ท่องเที่ยวสำคัญคือ พระราชวังของจักรพรรดิไดโอคลีเชียน (Diocletian) ซึ่งตอนนั้นไม่ได้รู้ประวัติศาสตร์โรมันมากนัก เลยไม่ค่อยอินเท่าไร (ใครที่ดู Game of Thrones พระราชวังนี้ใช้ถ่ายฉากที่เดเนริสขังมังกรของตัวเองไว้ในคุกใต้ดิน)</p>\n<p>พอมาศึกษาประวัติศาสตร์โรมันเลยพบว่า ไดโอคลีเชียน เป็นจักรพรรดิที่เก่งมากๆ และมีบทบาททอย่างมากคนหนึ่งในประวัติศาสตร์โรมันเลย</p>\n<p>ถ้าย้อนประวัติศาสตร์โรมันแบบพอสังเขป โรมันเปลี่ยนระบอบการปกครองจากสาธารณรัฐ (republic) มาเป็นจักรวรรดิ (empire) จากการขึ้นครองราชย์ของ ออกุสตุสซีซาร์ (Augustus) หลังสงครามคลีโอพัตราอันลือลั่นในช่วง 27 ปีก่อนคริสตกาล</p>\n<p>แต่ระบบจักรพรรดิของโรมันไม่ได้เป็นแบบจักรพรรดิจีนที่สืบทอดสายเลือดอย่างเดียว เพราะสามารถแต่งตั้งนายทหารที่มีบทบาทในช่วงนั้นมาเป็นจักรพรรดิได้ด้วย</p>\n<p>ระบบจักรพรรดิของโรมันสืบทอดมาหลายศตวรรษ จนมาเจอเหตุการณ์ช่วงที่เรียกว่า <a href=\"https://en.wikipedia.org/wiki/Crisis_of_the_Third_Century\">Crisis of the Third Century</a> กินเวลาประมาณ 50 ปีในช่วงคริสต์ศตวรรษที่ 3 (ค.ศ. 235-284)</p>\n<p>โรมันช่วงนี้เจอปัญหาหลายอย่าง ทั้งการบุกเข้ามาของคนเถื่อน (barbarian) ทางตอนเหนือของยุโรป และการชิงอำนาจกันเองไปมาภายในระหว่างแม่ทัพนายกอง วิกฤตการณ์ที่ยาวนานทำให้โรมันไม่เป็นปึกแผ่น มีจักรพรรดิหลายองค์เปลี่ยนไปมา และส่งผลให้โรมันอ่อนแรงลงมาก</p>\n<p>จนกระทั่งในปี ค.ศ. 284 มีนายทหารชาวดัลมาเชีย (Dalmatia ปัจจุบันเป็นพื้นที่ของโครเอเชีย) ชื่อ Diocles (ตามแบบกรีก) เรืองอำนาจขึ้นมา และเมื่อจักรพรรดิองค์ก่อนหน้า Numerian ที่ครองโรมันซีกตะวันออกป่วยตาย เหล่าทหารจึงเลือกเขาขึ้นมาเป็นจักรพรรดิคนใหม่ ชื่อว่า Diocletian ตามแบบโรมัน</p>\n<p>จากนั้น ไดโอคลีเชียนก็เปิดศึกกับจักรพรรดิฝั่งตะวันตก และสามารถเอาชนะได้ในสงคราม <a href=\"https://en.wikipedia.org/wiki/Battle_of_the_Margus\">Battle of Margus</a> (ปัจจุบันคือเซอร์เบีย) ทำให้เขากลายเป็นจักรพรรดิที่รวมโรมันได้เป็นหนึ่งอีกครั้งในปี 285</p>\n<p>แต่การปกครองอาณาจักรโรมันที่กว้างขวางไปครึ่งยุโรป และยิ่งมีสถานะที่วุ่นวายมานาน 50 ปีนั้นไม่ใช่เรื่องง่าย ยิ่งระบบการสื่อสารสมัยก่อนไม่ดีพอ การสั่งการต่างๆ ข้ามทวีปจึงทำได้ยากมาก ทางออกของไดโอคลีเชียนจึงเป็นการตั้งจักรพรรดิร่วม (co-emperor) มาแบ่งเบาภาระ แบ่งพื้นที่กัน</p>\n<p>ไดโอคลีเชียนตั้งเพื่อนทหาร Maximian ขึ้นมาเป็นจักรพรรดิร่วมในปี 285 โดยมอบหมายให้ Maximian ปกครองจักรวรรดิฝั่งตะวันตก และตัวเขาเองดูแลฝั่งตะวันออก</p>\n<p>หลังจากนั้นเกือบ 10 ปี ในปี 293 ระบบจักรพรรดิร่วมก็วิวัฒนาการเป็น 4 จักรพรรดิ (<a href=\"https://en.wikipedia.org/wiki/Tetrarchy\">Tetrarchy</a>) ที่แต่ละซีกจักรวรรดิจะมีจักรพรรดิ 2 องค์ คือ จักรพรรดิอาวุโส (augustus) และจักรพรรดิรุ่นเด็ก (caesares) แต่จักรพรรดิทั้ง 4 คนจะมีดินแดนของตัวเอง</p>\n<p>Diocletian แต่งตั้ง Galerius นายทหารซึ่งเป็นลูกเขยของเขามาเป็นซีซาร์ ส่วน Maximian ก็ตั้งนายทหารที่เป็นลูกเขยอีกเหมือนกัน Constantius Chlorus มาเป็นซีซาร์</p>\n<p>การแบ่งดินแดนชุดแรกมีดังนี้</p>\n<ul>\n<li>ฝั่งตะวันตก\n<ul>\n<li>สเปน อิตาลี แอฟริกาเหนือ = Augustus (Maximian)</li>\n<li>กอล เวียน บริเตน (ฝรั่งเศ+อังกฤษ) =  Caesar (Constantius)</li>\n</ul>\n</li>\n<li>ฝั่งตะวันออก\n<ul>\n<li>ตะวันออกและเอเชีย (นับจากตุรกีเป็นต้นไป) = Augustus (Diocletian)</li>\n<li>พันโนเชีย โมเอเชีย เธรซ (คาบสมุทรบอลข่าน) = Caesar (Galerius)</li>\n</ul>\n</li>\n</ul>\n<p>แต่ละโซนก็มีเมืองหลวงของตัวเอง โดยที่เมืองหลวงกลาง กรุงโรม ไม่ได้มีผลมากนักในทางปฏิบัติอีกแล้ว เป็นแค่เมืองหลวงตามธรรมเนียมเฉยๆ</p>\n<div><img src=\"https://markpeak.net/wp-content/uploads/2021/05/791px-Tetrarchy_map3.jpg\" /><p>ภาพจาก <a href=\"https://en.wikipedia.org/wiki/File:Tetrarchy_map3.jpg\">Wikipedia</a></p></div>\n<p>ตามระบบ 4 จักรพรรดิ หากจักรพรรดิรุ่นใหญ่ (ออกุสตุส) ตาย ซีซาร์จะได้เลื่อนขึ้นมาเป็นออกุสตุสแทน (แต่ยังครองดินแดนเดิมของตัวเอง)</p>\n<p>แต่หลังจากใช้ระบบ 4 จักรพรรดิมานานประมาณ 10 ปี ในปี 305 ไดโอคลีเชียนก็ทำสิ่งที่เซอร์ไพร์สคือ สละบัลลังก์ ซึ่งเขาเป็นจักรพรรดิโรมันคนแรกที่สละบัลลังก์ด้วย (เหตุผลสำคัญคือป่วยด้วย ตอนนั้นอายุประมาณ 60 แล้ว) แต่เท่านั้นยังไม่พอ เขายังชวน Maximian สละบัลลังก์ด้วยเช่นกัน ทำให้ “ซีซาร์” ทั้งสองคนคือ Galerius และ Constantius ได้เลื่อนชั้นขึ้นมาเป็นออกุสตุสแทน (ทั้งสองคนแต่งตั้งซีซาร์ขึ้นมาใหม่อีกต่อหนึ่ง)</p>\n<p>เกษียณแล้วไปทำอะไร ไดโอคลีเชียนจึงกลับบ้านเกิดดัลมาเชีย ไปสร้างพระราชวังริมทะเลอยู่ที่เมือง Split ในปัจจุบัน ส่วน Maximian ก็ทำแบบเดียวกันแต่ไปอยู่ที่อิตาลีตอนใต้ ตัวของไดโอคลีเชียนก็ใช้ชีวิตแบบคนแก่ ทำสวนในพระราชวัง จนกระทั่งป่วยมากๆ และฆ่าตัวตายในปี 311</p>\n<p>ส่วนระบบ 4 จักรพรรดิที่ไดโอคลีเชียนวางเอาไว้ก็อยู่ได้ไม่นาน เพราะผู้สืบทอดทั้ง 4 คนก็เปิดศึกชิงอำนาจกันเอง (ในปี 308 ทั้ง 4 คนอ้างตัวเป็นออกุสตุสกันหมด ไม่มีใครยอมเป็นซีซาร์อีกแล้ว ทำให้ ไดโอคลีเชียนและ Maximian ต้องมาช่วยหย่าศึกชั่วคราวด้วย)</p>\n<p>ระบบ 4 จักรพรรดิมาสิ้นสุดในปี 324 โดยผู้ชนะคนสุดท้ายคือ Constantine ลูกชายของ Constantius ที่สามารถรวมจักรวรรดิโรมันได้เป็นปึกแผ่น (จริงๆ) อีกครั้ง และเขาคือผู้สร้างนคร Constantinople ที่กลายเป็นเมืองหลวงของโรมันตะวันออกมาอีกพันกว่าปี</p>The post <a href=\"https://markpeak.net/diocletian-tetrachy/\">Diocletian และสี่จักรพรรดิ</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"44ee2b5e0c2fe9de5acc837311d88bacf0c5ff0121c9de45b7e57afceb8e603d","category":"Thai"}