{"title":"Who is Florian Vermeersch, Lotto-Soudal’s Roubaix Starlet?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/florian-vermeersch-lotto-soudal-s-roubaix-starlet","date":1633538862000,"content":"\n      <p>Just a few hundred metres remain on the Roubaix Velodrome in a grizzly edition of Paris-Roubaix. Mathieu van der Poel leads, with Sonny Colbrelli biding his time on the Alpecin Fenix rider’s wheel. Prior to the race, the two riders had accumulated fifteen victories between them across the 2021 season. Which superstar would claim the Hell of the North?</p>\n<p><span>Well, it was very nearly neither of them. That’s because Lotto-Soudal’s Florian Vermeersch — who is yet to win a professional bike race — rides onto the velodrome alongside the aforementioned duo.</span></p>\n<div></div>\n<p><span>Few were talking up Vermeersch’s chances prior to the race. With defending champion Philippe Gilbert and former winner John Degenkolb starting for Lotto Soudal, Vermeersch’s name wasn’t the first you’d look to when analysing the team's lineup, let alone the 175-rider strong Roubaix startlist. </span></p>\n<p><span>However, after passing Gianni Moscon on <span>Carrefour de l'Arbre</span>, Vermeersch resisted the tempo set by Colbrelli and Van der Poel on the five-star sector</span><span>. With the rest of his breakaway comrades dropped, Vermeersch found himself in a position he could not have dreamt of hours earlier.</span></p>\n<p><span>Undeterred by the company he shared, Vermeersch continued to work as the kilometres ticked from double to single digits, until the 3km to go mark. Here, Vermeersch launched an initial attack, but Colbrelli reacted rapidly to the Belgian’s acceleration. </span>So, back to the velodrome, with the three riders accepting that their fate would be decided in a sprint.</p>\n<p><span>Vermeersch sat off Colbrelli’s wheel, providing him with space to jump the more reputable duo ahead of him. He timed his move well, but his early launch point allowed Colbrelli to benefit from his draft, before accelerating past the Belgian to win the first monument of his career. A heartbreaking conclusion to the most spectacular performance in Florian Vemeersch’s young life as a pro cyclist.</span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1344612107-min_1024x1024.jpg?v=1633511714\" />Florian Vermeersch moments after crossing the line second in Paris-Roubaix 2021 (Image credit: Bernard Papon - Pool/Getty Images)</span></i></p>\n<p><span><span>Colbrelli used his last ounce of strength to hold his bike aloft, before collapsing to the ground metres away from Vermeersch, where neither rider could contain their emotions.</span></span></p>\n<p><span>Vermeersch described his feelings after the race. “I’m having mixed feelings at the moment. I know it was an incredible day, I was in the breakaway all day and then I could ride the final with two champions like this in my first Paris-Roubaix. I’m really proud, but I’m also really disappointed that I just missed out on the win.”</span></p>\n<p><span>Vermeersch so nearly became the youngest winner of Paris-Roubaix since World War II. But who is he, and how did he get to this point?</span></p>\n<p><span>The Belgian made the step up to the WorldTour in the pandemic-struck 2020 season. Although he was one of the youngest riders on a WorldTour roster, he swiftly made an impression. He was fourth in the Brussels Cycling Classic, a race won by Tim Merlier. Vermeersch defeated the likes of Jasper Philipsen and Pascal Ackermann in a sprint, displaying early credentials in a fast finish. The race took place in wet, grim conditions, which clearly doesn't hamper Vermeersch.</span></p>\n<p><span>Additionally, Vermeersch is well versed on the time trial bike — he finished fifth in the highly competitive Belgian National Championships in 2020, a result he would replicate in 2021. He also secured a respectable ninth place overall at the BinckBank Tour, largely down to another solid display in a time trial — he was 13th on stage 4.</span></p>\n<p><span>His progression continued in 2021 with Lotto Soudal, a</span><span>dding a mountain jersey at the Tour de Wallonie to his </span><em><span>palmarès</span></em><span> before starting his first Grand Tour at La Vuelta a España. Although he didn’t come close to winning a stage on his Grand Tour debut, Vermeersch displayed further sprinting pedigree when he was in the top ten on stage 2.</span></p>\n<p><span>The 22-year-old also finished in the top 20 at the E3 Saxo Bank Classic and Brugge-De Panne.</span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB1_8635-min_1024x1024.jpg?v=1633512462\" /></span></i></p>\n<p><em><span>Image credit: Alex Broadway/SWpix</span></em></p>\n<p><span>Vermeersch was the underdog in the Roubaix velodrome, but should he have been? Going up against Van der Poel and Colbrelli, it would have been easy to discount the young Belgian. However, Vermeersch’s power data, which he uploaded to </span><a href=\"https://www.strava.com/activities/6059043404\" target=\"_blank\"><span>his Strava</span></a><span>, illustrates just how strong he was.</span></p>\n<p><span>In the final sprint, Vermeersch’s power output peaked at an astounding 1,476 watts. Not bad, particularly after tackling over 250 kilometres of cobbles and mud.</span></p>\n<p><span>Just over one year into his WorldTour career, we can draw some conclusions from his results. Vermeersch is a highly versatile rider. He’s already shown that he can shake it up with top level WorldTour sprinters, whilst he is also a very capable time trialist. However, his true speciality lies in the cobble classics.</span></p>\n<p><span>Considering his attributes and age, Vermeersch will get another chance to win the Hell of the North, and he knows it. “A few weeks back, I said that Roubaix is my favourite race to win and today I came so close. I hope I can come back next year or in a few years to compete for the win.”</span></p>\n<p><span>Florian Vermeersch was the surprise package of Paris-Roubaix 2021, a race that is notoriously difficult for youngsters to win. </span>However, following a magnificent display beyond his years, no one will be surprised to see <span>Vermeersch </span>to the fore on the cobblestones over the next decade.</p>\n<p><i><span>Cover image: <span>Tim de Waele/Getty Images</span></span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"44f68d6d0b36c8be3488a392a6193c1e999d8767a97cf586907952953fceb54e","category":"Cycling"}