{"title":"Synthesis, characterization, and phosphorus adsorption of Mg/Fe‐modified biochar from cotton stalk pretreated with Coriolus versicolor","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11077?af=R","date":1721113200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/a4dfd331-d2fe-4848-ad98-7f56e0cd3870/wer11077-toc-0001-m.png\" alt=\"Synthesis, characterization, and phosphorus adsorption of Mg/Fe-modified biochar from cotton stalk pretreated with Coriolus versicolor\" />\n<p>In the study, it was aimed to break the lignocellulosic structures of cotton stalk and to impregnate the surface with more metal oxide by using <i>Coriolus versicolor</i> white rot fungus. The pre-treated Fe and Fe/Mg modified biochars were named as CV-CS/Fe and CV-CS/Mg, and their P adsorption capacities and kinetic mechanisms were investigated.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>In recent years, the research potential in utilizing biochars as adsorbents in adsorption processes has grown due to their eco-friendly and economical nature. However, biochar often possesses a negative surface charge that limits its affinity for binding anions. Nitric acid washing and pretreatment with <i>Coriolus versicolor</i> can break down the lignocellulosic structure in cotton stalk waste, facilitating the subsequent impregnation of Mg and Fe metal oxides. These pretreatment steps can lead to the production of diverse and functionalized biochars with higher adsorption capacities. In this study, cotton stalk waste was first washed with diluted nitric acid and then subjected to biological pretreatment by incubation with <i>C. versicolor</i>, followed by impregnation with Mg and Fe to obtain CV-CS/Fe and CV-CS/Mg biochars. The results showed that the applied pretreatments altered the physicochemical properties and significantly increased the phosphorus adsorption capacity. The adsorption capacities of CV-CS/Fe and CV-CS/Mg biochars were found to be 277.88 and 507.01 mg g<sup>−1</sup>, respectively. The results indicate that the incorporation of multiple metal oxide impregnates enhances P adsorption. Furthermore, in the kinetic study, pseudo-first-order and pseudo-second-order models provided a well fit, determining chemical adsorption as the main adsorption mechanism for phosphorus adsorption. The biochars demonstrated compatibility with Langmuir–Freundlich models. Overall, the findings suggest the possibility of synthesizing biochars with improved adsorptive properties through pretreatment, and these engineered biochars hold promising potential as effective adsorbents in the field.</p>\n<h2>Practitioner Points</h2>\n<p>\nEco-friendly, natural, and economical biochar was synthesized.\nBiochar was produced via <i>Coriolus versicolor</i> pretreatment.\nHigh adsorption capacities of CV-PS/Mg biochars were found to be 507.01 mg g<sup>−1</sup>.\nAdsorption capacities of biochars can be improved by pretreatment.\n</p>","author":"Ece Ümmü Deveci, \nDerya Öz, \nÖzgecan Madenli","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"44f689e810c854ceae9f18fd9bb0f8e90ef349175e7d0e57cfcad93d908a2877","category":"Environment"}