{"title":"How to use an SD camera card with your Mac","link":"https://www.macworld.com/article/1531760/how-to-use-sd-camera-card-mac.html","date":1679043600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Macs and digital cameras have gone hand in hand for a couple of decades. But Apple hasn’t always provided a direct way to transfer images from a camera if you don’t have the correct USB cable handy. Let’s not get started on Wi-Fi transfer–a nightmare with most cameras, even in 2023.</p>\n\n\n\n<p>Nearly all digital cameras switched to the SD (Secure Digital) Card format about 15 years ago from previous formats. It offers compact, high-density flash memory storage, with higher capacities coming with the 2009 SDXC (eXtended Capacity) upgrade, which increased a 32GB maximum to up to 2TB in a card!</p>\n\n\n\n<p>Apple included or includes an SDXC Card slot that can read nearly all SD formats on these models of Macs:</p>\n\n\n\n<ul><li>21.5-inch and 27-inch iMac models (2010 or later)</li><li>13-inch MacBook Air (2013 to 2017)</li><li>Mac mini (2011 to 2014)</li><li>MacBook Pro (2011 to 2014, then restarting in 2021)</li><li>Mac Studio</li></ul>\n\n\n\n<p>SD Cards are rated by throughput, which has increased dramatically over the years. The latest widespread standards are UHS-I and UHS-II. (UHS stands for Ultra High Speed.) All the Macs above can read the earlier MMC, Default Speed, and High Speed flavors, as well as UHS-I and UHS-II. SD Cards come in both standard and microSD sizes. However, you can use a microSD adapter (these are sometimes included when you purchase a microSD Card) that is effectively a full-sized SD Card to use it with a Mac or card reader.</p>\n\n\n\n<p>However, the newer UHS-II cards, three times faster than UHS-I, only support their higher speeds in a few Mac models. These are the iMac Pro, the 27-inch Intel iMac model released in 2020, and all MacBook Pro models released from 2021 onward.</p>\n\n\n\n<p>You likely won’t buy a UHS-II speed card unless you have a particular purpose–like recording low-compression 4K video directly on a camera–because the cost for that added speed is much higher. A SanDisk UHS-I 256GB card has a street price of $40, while the UHS-II version is $280.</p>\n\n\n\n<p>If you don’t have a Mac that comes with an SD Card slot, it’s an easy matter to add one. You can get straightforward USB Type-A adapters for as little as $7 with UHS-I throughput support. <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-1531760-1-0-0&amp;u=https://www.apple.com/shop/product/MUFG2AM/A/usb-c-to-sd-card-reader\">Apple sells a $39 USB-C adapter</a> with support for UHS-II. Don’t pay for UHS-II support unless you need it.</p>\n\n\n\n<p>Many USB-C and Thunderbolt docking stations also include an SD Card slot as a basic feature. See our recommended <a href=\"https://www.macworld.com/article/668894/best-thunderbolt-3-4-and-usb-c-docking-stations-for-macbook-pro-and-air.html\" target=\"_blank\">best Thunderbolt docks for Mac</a>.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Kevin.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nMac, Storage</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"44f7c7cbbc90ca246dc3e812adf7797b6bc19a21dcd06d1235897cf463c0755d","category":"Apple"}