{"title":"Understanding stakeholder perspectives on Apgar score, cyanosis and identifying jaundice in ethnic minority neonates","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311977","date":1729000800000,"content":"<p>by Frankie Fair, Amy Furness, Gina Higginbottom, Sam Oddie, Hora Soltani</p>\r\nObjectives <p>To explore neonatal assessments that include an element of evaluating skin colour in neonates of black, Asian and minority ethnicities, focusing on the Apgar score, presence of cyanosis and presence of jaundice.</p> Design <p>We employed focused ethnography involving diverse healthcare professionals (HCPs) and parents or caregivers with Black, Asian, or ethnic minority children born in the last five years. Zoom interviews were performed following a semi-structured interview guide. Ethnographic data analysis was conducted using NVivo software.</p> Results <p>There was a lack of consistency in how HCPs applied the Apgar scores, which also varied from textbook guidelines. The use of pink as a skin colour descriptor for ethnic minority neonates created a divide among both parents and HCPs. HCPs relied more heavily on other elements of the Apgar score or infant breathing and crying at birth to gauge infant wellness. When identifying cyanosis, HCPs depend on specific body locations for accurate assessment of oxygenation, but the limitations of visual assessment are acknowledged. For jaundice, most HCPs recognised the difficulty in identifying the colour yellow in infants with darker skin tones. HCPs focussed on yellowing of the sclera and gums and other well-being assessments to detect jaundice. Some interviewed parents noticed jaundice in their infants before HCPs but felt they were not listened to when raising concerns. HCPs acknowledged the need for additional training to effectively assess the health of ethnic minority infants.</p> Conclusion <p>This study highlights disparities in neonatal health assessment from the perspectives of healthcare professionals and parents from diverse backgrounds. Varied practices in determining the Apgar score and recognising cyanosis and jaundice signal the need for standardised protocols, appropriate educational materials, and targeted training. Addressing these challenges is vital for equitable care, emphasising comprehensive training and bias mitigation efforts in maternal and neonatal healthcare.</p>","author":"Frankie Fair","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"44f780bf333fb0c8b310357dc2045b71dd6c3f9e20092d4f9075132c9ecca828","category":"Interdisciplinary"}