{"title":"Best downhill mountain bikes in 2023 plus our buyer’s guide","link":"https://www.bikeradar.com/advice/buyers-guides/best-downhill-mountain-bikes/","date":1700992800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Giant-Glory-Advanced-root-step-3dc6fa7.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Giant-Glory-Advanced-root-step-3dc6fa7.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Giant-Glory-Advanced-root-step-3dc6fa7.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Giant-Glory-Advanced-root-step-3dc6fa7.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Giant-Glory-Advanced-root-step-3dc6fa7.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Giant-Glory-Advanced-root-step-3dc6fa7.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Giant-Glory-Advanced-root-step-3dc6fa7.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Giant-Glory-Advanced-root-step-3dc6fa7.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Male rider in black and red top riding the Giant Glory Advanced full suspension mountain bike\" title=\"Giant Glory Advanced root step\" />                                            <p>These are the best downhill mountain bikes in 2023, as rated and reviewed by our technical writer and UCI Downhill World Cup competitor, Luke Marshall.</p>\n<p>With some brands’ ‘halo’ <a href=\"https://www.bikeradar.com/advice/fitness-and-training/downhill-mountain-biking-explained/\">downhill</a> bikes now topping out at £10,000, we’d wager most riders with a hankering for some gravity-fuelled action are more likely to buy an <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-enduro-bikes/\">enduro mountain bike</a> or even one of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-trail-bikes/\">best trail mountain bikes</a>. Trail and enduro bikes can be pedalled to the top of descents instead of always having to rely on uplift services.</p>\n<p>But, if you’re committed to spending your weekends in the back of a smelly uplift van in the quest for pure gravity-fed action, dedicated DH bikes are still within grasp for those with less cash or a more divided-up budget.</p>\n<p>The bottom line is that nothing quite beats the speed and outright wildness a DH bike provides, despite it being possible to ride an enduro bike on the same terrain.</p>\n<p>To find out more, read our <a href=\"#buyers-guide\">downhill mountain bike buyer’s guide</a>.</p>\n<h2>Best downhill mountain bikes</h2>\n<h3>Giant Glory Advanced</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul>\n    <li>\n    </li>\n</ul>\n\n\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Pack shot of the Giant Glory Advanced full suspension mountain bike\" title=\"Giant Glory Advanced\" />\n\n</div><div><figcaption><span><i></i> Changeable headset cups enable you to refine the reach of the Glory by plus or minus 5mm.</span></figcaption><span> <i>Tom Hardman</i></span></div>\n<ul>\n<li>£7,499 / $8,000 / €7,999 / AU$11,499 as tested</li>\n<li><strong>Pros:</strong> Plush travel with plenty of support; high levels of adjustability; great shock tune</li>\n<li><strong>Cons</strong>: Rims dent easily; high-speed rebound adjuster difficult to reach</li>\n</ul>\n<p>Giant’s Glory has plenty of heritage in downhill, and the current bike lives up to that legacy with a sure-footed and stable ride feel that compels on hard-charging descents.</p>\n<p>This Glory Advanced comes with top-notch suspension that provides plenty of adjustability, with a 203mm Fox Factory 40 fork up front and a DHX2 Factory <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-rear-shocks/\">shock</a> controlling 200mm of travel.</p>\n<p>The frame features adjustable geometry, which should keep even the biggest tinkerers happy.</p>\n<p>We found the Giant AM30 rims to be the Achilles heel of this model and they were quick to dent.</p>\n<p>With an overriding sense of composure, the Glory performs well when faced with a variety of trails and conditions.</p>\n<ul>\n<li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/giant-glory-advanced-review/\">Read our full Giant Glory Advanced review</a></li>\n</ul>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Propain Rage 3 CF Mix Highend</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul>\n    <li>\n    </li>\n</ul>\n\n\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Pack shot of the Propain Rage 3 CF Mix Highend full suspension mountain bike\" title=\"Propain Rage 3 CF Mix Highend\" />\n\n</div><div><figcaption><span><i></i> The Rage 3 CF Mix Highend runs on a mixed ‘mullet’ wheel size.</span></figcaption><span> <i>Tom Hardman</i></span></div>\n<ul>\n<li>£6,519 / €6,389 as tested</li>\n<li><strong>Pros:</strong> Handles steep tech and jumps with ease; 215mm of travel is very forgiving; pedals better than expected</li>\n<li><strong>Cons:</strong> Seat tube could be shorter; saddle a little chunky for our preference</li>\n</ul>\n<p>The Rage 3 is an impressive piece of kit that should be taken seriously by those looking for top-end performance at a reasonable price.</p>\n<p>The bike has a fun character and provides plenty of performance on a variety of trails, with the 215mm of rear-wheel travel adding to a very forgiving ride.</p>\n<p>A 200mm Fox 40 Factory fork features up-front and a Float DHX2 Factory shock is mounted in the frame.</p>\n<p>At speed, the bike remains engaging. However, it falls short on the roughest terrain, where it lacks the same composure as other bikes on this list.</p>\n<ul>\n<li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/propain-rage-3-c%E2%80%A6x-highend-review/\">Read our full Propain Rage 3 CF Mix Highend review</a></li>\n</ul>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Nukeproof Dissent 297 RS</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul>\n    <li>\n    </li>\n</ul>\n\n\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Pack shot of the Nukeproof Dissent Carbon 297 RS full suspension mountain bike\" title=\"Nukeproof Dissent Carbon 297 RS\" />\n\n</div><div><figcaption><span><i></i> Nukeproof’s Dissent Carbon 297 RS is priced attractively.</span></figcaption><span> <i>Tom Hardman</i></span></div>\n<ul>\n<li>£6,000 as tested</li>\n<li><strong>Pros:</strong> Competitive price compared to rivals; good beginning and end-stroke feel</li>\n<li><strong>Cons:</strong> Low stack height; feels bogged down at slower speeds</li>\n</ul>\n<p>Nukeproof’s Dissent Carbon 297 RS proves to be a great platform for aggressive riders, with out tester touting its ability, and calm and collected nature.</p>\n<p>This reduces the bike’s versatility, with it feeling lethargic and sluggish on mellower trails and at slower speeds.</p>\n<p>The carbon fibre frame produces 200mm of travel through the brand’s Fallout linkage, which is connected to a RockShox Super Deluxe Ultimate shock.</p>\n<p>Up-front, there’s a 200mm RockShox Boxxer Ultimate <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-suspension-forks/\">suspension fork</a>, which provides a smooth and supportive ride.</p>\n<ul>\n<li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/nukeproof-dissent-297-rs-review/\">Read our full Nukeproof Dissent 297 RS review</a></li>\n</ul>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<section>\n    <div>\n        \n<h4>How we tested </h4>\n<p>Reviewer and technical writer Luke Marshall has more than 20 years of mountain bike experience. He is a gravity-focused rider with a history of racing downhill, previously competing in the UCI Downhill World Cup. </p>\n<p>For our latest downhill MTB test, Luke took three downhill world cup race bikes out to the French Alps to give them a thorough thrashing.</p>\n<p>This enabled him to ride suitable trails and use chairlift and gondola uplifts to get plenty of testing runs in.</p>\n<p>He judged these bikes on their overall ride character, and how easy they were to ride at our limits. </p>\n<p>He wanted to dig into how they balance traction and support, their chassis stability at speed and how they behave under braking.</p>\n<p>He also considered how they feel on the trail and who they’re most suitable for. </p>\n<p>\n\n    </p></div>\n    </section>\n\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<h2>Downhill mountain bike buyer’s guide | Finding the right downhill bike for you</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Vitus Dominer\" title=\"Vitus Dominer\" />\n\n</div><div><figcaption><span><i></i> Decide what’s most important to you when it comes to choosing a downhill mountain bike.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>When looking for a downhill bike, a good starting point is to ask the question ‘what do I want from a DH bike?’ Is it top-performing suspension? Or do you want high-end components, or even more sophisticated frame technologies such as carbon fibre constructions or hydroformed tubes?</p>\n<p>Choosing a DH bike that concentrates your cash into one area over another, especially if you’re on a budget, will always create compromises though.</p>\n<h3>Prioritising performance</h3>\n<p>How do you prioritise performance, then? It’s quite a balancing act and requires a bit of careful consideration. You need to be able to rank, in order, the parts of the bike you think are the most important.</p>\n<p>Is it the frame’s construction? Its geometry? The way the suspension works? The bike’s components or its fork and shock dampers? The wheels and tyres or something else, such as its looks? Prioritising any one element should help guide your purchase.</p>\n<h3>Setting a budget</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Canyon Sender CF 7.0\" title=\"Canyon Sender CF 7.0\" />\n\n</div><div><figcaption><span><i></i> How much do you have to spend?</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>In recent years, we’ve seen a lot of the fancy tech that makes top downhill bikes so expensive trickle down to their more affordable siblings, so you can get quite a lot of bike for your buck nowadays.</p>\n<p>Most DH rigs now have adjustable geometry, metric trunnion shocks and downhill-specific parts. Even if you’re considering a model that’s much cheaper than a brand’s range-topper, its suspension may not be as sophisticated and the parts may feel clunkier, but that doesn’t mean it’ll be any less fun on the hill.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Saracen Myst AL\" title=\"Saracen Myst AL 03\" />\n\n</div><div><figcaption><span><i></i> Getting a model lower in the range doesn’t necessarily mean less fun on the trails.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>It is possible to pick up a bottom-spec DH bike for around £2,000 / $2,000 / €2,000, although some can be found cheaper in sales and at the end of their model year. Equally, the second-hand market is truly vibrant, so you can still get your kicks on a shoestring.</p>\n<p>Top-end bikes – that can reach lofty purchase prices of around £10,000 / $10,000 / €10,000 – will be dripping with top DH-specific kit and have cutting-edge technology, such as the latest suspension designs and dampers.</p>\n<h3>Direct to consumer</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"male cyclist wearing red riding black full suspension mountain bike on dirt track\" title=\"Nukeproof Dissent 290 Comp 24\" />\n\n</div><div><figcaption><span><i></i> Online retailers can offer great value.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>Generally speaking, direct-to-consumer brands – such as YT Industries, <a href=\"https://www.bikeradar.com/brand/canyon/\">Canyon</a>, Cube and others – offer the most top-end parts and frame technologies for the least amount of coin.</p>\n<p>On the flip side, because you’re <a href=\"https://www.bikeradar.com/features/buying-a-bike-from-a-bike-shop-vs-buying-online/\">buying a bike from the internet</a>, there’s no bike shop to help out when things go wrong and you could be left bikeless for longer than you’d like. So you’ll need to decide how important that initial purchase price is compared to after-sales support.</p>\n<h3>Frame construction</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"bar and stem combo on full suspension mountain bike\" title=\"Scott Gambler 900 Tuned-20\" />\n\n</div><div><figcaption><span><i></i> Carbon or alloy might be your next choice.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>A carbon fibre frame will generally cost more than an alloy one. For that extra money, it will normally be lighter and should have a more tuned construction compared to an alloy counterpart.</p>\n<p>Carbon is an easier material to work with to generate different characteristics over an alloy bike.</p>\n<h3>Geometry</h3>\n<p>Spending more money won’t necessarily get you better geometry, so study the geo charts carefully when you’re looking to buy.</p>\n<p>A bike with great geometry at a reasonable price is a good place to start, meaning you can upgrade the parts over time to improve the way it rides. For more information, check out our guide on all things <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-bike-geometry-and-handling/\">bike geometry and handling</a>.</p>\n<h3>Suspension kinematics</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"frame linkage on full suspension mountain bike\" title=\"Nukeproof Dissent 290 Comp 12\" />\n\n</div><div><figcaption><span><i></i> What do you need from your bike’s suspension?</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>The way the suspension works is really important, but don’t get too bogged down on whether it’s single-pivot, Horst-link, four-bar or virtual-pivot-point style suspension.</p>\n<p>Each one of those designs can be tuned in a certain way, so study up on what you think you’d like from the bike’s suspension by reading <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-mountain-bike-rear-suspension-systems/\">our ultimate suspension guide</a>.</p>\n<h3>Suspension dampers</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"fox rear suspension on mountain bike\" title=\"Scott Gambler 900 Tuned-19\" />\n\n</div><div><figcaption><span><i></i> Check the suspension damping.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>Because they’re a high-value upgrade, getting the right suspension dampers fitted to your bike’s fork and shock from the factory is important. Carefully read the bike’s specs, making sure its suspension is damped correctly. It would be worth considering sacrificing some of the bike’s spec – such as elements of the drivetrain or the wheels – to get better dampers.</p>\n<h3>Components</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"sram drivetrain on mountain bike\" title=\"Canyon Sender CF 7 05\" />\n\n</div><div><figcaption><span><i></i> Spec can always be upgraded over time if suspension and geometry are your priorities.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>Although these make up a large portion of the bike, they don’t necessarily change its fundamental ride characteristics. Given the choice between outstanding suspension and geometry or a platter of top-spec parts, it would be wise to go for the better suspension and geometry.</p>\n<p>The bike’s parts can be upgraded over time as they break or your budget permits. That said, if this is a finite-spend, one-off purchase, then consider carefully what tyres, brakes and gears are bolted to the bike. Poor performance in these areas is the most detrimental to the overall ride feel, especially if the frame’s geometry and suspension is sorted.</p>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>","author":"Alex Evans","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"44fe36a1910dca08da13aaa7b695f9f73d82b5573bb6116bdd21b09cee1d5d3a","category":"Cycling"}