{"title":"Marine fishes experiencing high-velocity range shifts may not be climate change winners","link":"http://link.springer.com/10.1038/s41559-024-02350-7","date":1709856000000,"content":"<h3>Abstract</h3>\n                  <p>Climate change is driving the global redistribution of species. A common assumption is that rapid range shifts occur in tandem with overall stable or positive abundance trends throughout the range and thus these species may be considered as climate change ‘winners’. However, although establishing the link between range shift velocities and population trends is crucial for predicting climate change impacts it has not been empirically tested. Using 2,572 estimates of changes in marine fish abundance spread across the world’s oceans, we show that poleward range shifts are not necessarily associated with positive population trends. Species experiencing high-velocity range shifts seem to experience local population declines irrespective of the position throughout the species range. High range shift velocities of 17 km yr<sup>−1</sup> are associated with a 50% decrease in population sizes over a period of 10 yr, which is dramatic compared to the overall stable population trends in non-shifting species. This pattern, however, mostly occurs in populations located in the poleward, colder, portion of the species range. The lack of a positive association between poleward range shift velocities and population trends at the coldest portion of the range contrasts with the view that rapid range shifts safeguard against local population declines. Instead, our work suggests that marine fishes experiencing rapid range shifts could be more vulnerable to climatic change and therefore should be carefully assessed for conservation status.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"45116da35ed1ef9da9b55f9fe10e45e1b910ef1b624260fd3cc332f8632011ac","category":"Environment"}