{"title":"The effect of planting grass filter strips on fishes in agricultural headwater streams","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4137?af=R","date":1711954800000,"content":"<h2>Abstract</h2>\n<p>\nGrass filter strips (i.e., herbaceous riparian buffers) are a widely used conservation practice in the United States to mitigate the impacts of agriculture on streams and rivers. Yet, only a limited amount of information is available on the effects of grass filter strips on stream fishes and instream habitat conditions and long-term assessments are rare. The objective of this research was to document the long-term effects of planting grass filter strips adjacent to channelized agricultural headwater streams on fish community structure and instream habitat.\nFishes, instream habitat and riparian characteristics were sampled from three channelized agricultural headwater streams without grass filter strips, three channelized agricultural headwater streams with grass filter strips and two unchannelized streams having forested riparian habitats in central Ohio from spring of 2006 to autumn of 2015.\nFish species richness, abundance, darter species richness, per cent darters, sunfish species richness, minnow species richness and per cent headwater fishes did not differ among riparian habitat types. Darter species richness and per cent darters differed annually. Mean water depth, velocity, wetted width, instream habitat diversity, dominant grain size and per cent instream wood did not differ among riparian habitat types. Mean water depth, water velocity, wetted width and instream habitat diversity exhibited annual differences. Additionally, mean riparian width, woody vegetation density and per cent canopy cover were greater in forested streams than the unplanted and grass filter strip streams. Riparian characteristics did not differ annually.\nThe lack of fish community responses 10–13 years after planting grass filter strips is probably due to the lack of corresponding changes in hydrological characteristics, substrate and instream wood amounts. These results suggest that grass filter strips should not be implemented alone but in conjunction with conservation practices that will improve physical habitat quality and water quality.\n</p>","author":"Peter C. Smiley Jr.","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"451631982136a02e51546db177457e9791a968341d60cadc67da8f978693574b","category":"Environment"}