{"title":"Bandai Namco เผยยกเลิกเกมไปอย่างน้อย 5 เกม เน้นปรับโครงสร้างควบคุมคุณภาพเกมมากขึ้น","link":"https://www.blognone.com/node/138240","date":1708082101000,"content":"<div><div><div><p>รายงานผลประกอบการล่าสุด Bandai Namco ประกาศยกเลิกพัฒนาเกมไปอย่างน้อย 5 เกม เพื่อมุ่งเน้นไปที่การควบคุมคุณภาพของเกมให้ดีขึ้น หลังรายได้ที่นับถึงไตรมาสที่ 3 ของปีงบประมาณที่สิ้นสุดในเดือนธันวาคม 2023 แผนกดิจิทัล (ซึ่งรวมถึงวิดีโอเกมเป็นหลัก) มียอดขายสุทธิลดลง 8.9% เมื่อเทียบกับช่วงเดียวกันของปีที่แล้ว มีรายได้ลดลง 96.5%</p>\n<p>Bandai Namco บอกว่าเกม Dragon Ball และ One Piece ยอดขายยังคงมีเสถียรภาพในญี่ปุ่น และต่างประเทศ ส่วน Armored Core 6 ก็เป็นหนึ่งในเกมที่ได้รับความนิยม แต่ยังไม่มีเกมไหนที่ทำยอดขายได้เทียบเท่า Elden Ring ในช่วงปีที่แล้ว เลยเป็นเหตุให้รายได้รวมลดลง</p>\n<p>นอกจากนี้ Bandai Namco ยังตั้งข้อสังเกตอีกว่าการทบทวนกระบวนการพัฒนาเกมส่งผลให้ขาดทุน ส่วนเกมออนไลน์ใหม่ และเกมอื่น ๆ ที่เปิดตัวในปีงบประมาณนี้ก็มีมูลค่าลดลง จึงทำให้บริษัทต้องปรับโครงสร้างการสร้างเกมตามแผนระยะกลางในอนาคตให้เหมาะสม, สมดุล, ตรวจสอบอย่างรอบคอบ และสร้างเกมที่เน้นคุณภาพมากขึ้น เนื่องจากในปัจจุบันการพัฒนาเกมใช้เวลานานขึ้น (นับตั้งแต่ช่วงลงทุนไปจนถึงช่วงคืนทุน) โดยบริษัทตัดสินใจยกเลิกเกมอย่างน้อย 5 เกมที่อยู่ในระหว่างการพัฒนา และบันทึกว่าเป็นการสูญเสียรายได้จากการวางจำหน่ายด้วย</p>\n<p>อย่างไรก็ตามแม้ว่าผลกำไรจะลดลงอย่างมาก แต่อย่างน้อยเกม Tekken 8 ก็ประสบความสำเร็จขายได้มากกว่า 2 ล้านชุดนับตั้งแต่วางขาย ส่วนเกมอื่น ๆ ในปีนี้ Bandai Namco มี Expansion ใหม่ของ Elden Ring และ Dragon Ball Sparking Zero จอคิวรอวางขายอยู่</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/57499926142aae01a91752a974720ac8.png\" /></p>\n<p>ที่มา - <a href=\"https://www.videogameschronicle.com/news/bandai-namco-reveals-it-recently-cancelled-five-games-saying-it-plans-stricter-quality-control/\">VGC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/bandai-namco\">Bandai Namco</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4517f28df080f55d5639f7e2dd86e703f150d8649ea41ad32424619512b61c81","category":"Thai"}