{"title":"US agency sues top crypto exchange Binance and CEO, seeks permanent trading bans","link":"https://arstechnica.com/?p=1927325","date":1680024576000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/getty-binance-ceo-800x571.jpg\" alt=\"Binance founder and CEO Changpeng Zhao sitting at a table and speaking into a microphone, wearing a shirt with a Binance logo.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/getty-binance-ceo.jpg\">Enlarge</a> <span>/</span> Binance founder and CEO Changpeng Zhao at the Web Summit 2022 conference in Lisbon, Portugal. (credit: Getty Images | Ben McShane )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The US Commodity Futures Trading Commission (CFTC) yesterday sued Binance, the world's largest cryptocurrency exchange, saying the company and its founder, Changpeng Zhao, are charged with \"willful evasion of federal law and operating an illegal digital asset derivatives exchange.\"</p>\n<p>Binance committed \"numerous violations of the Commodity Exchange Act and CFTC regulations,\" the agency said. In a <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8680-23\">press release</a> announcing the civil enforcement action, the agency said its litigation \"seeks disgorgement, civil monetary penalties, permanent trading and registration bans, and a permanent injunction against further violations of the CEA and CFTC regulations.\"</p>\n<p>The CFTC alleges that the defendants operated the trading platform \"through an intentionally opaque common enterprise, with Zhao at the helm as Binance's owner and chief executive officer.\" The agency said the defendants \"chose to knowingly disregard applicable provisions of the CEA while engaging in a calculated strategy of regulatory arbitrage to their commercial benefit.\" Samuel Lim, Binance's former chief compliance officer, was charged with aiding and abetting the violations.</p></div><p><a href=\"https://arstechnica.com/?p=1927325#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927325&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"451b35a9b82a6bd3eb443d5b5a8ecebbe71ed75ad1091c7bb558996cb1d3173a","category":"Tech"}