{"title":"Fitbit Daily Readiness Score Review: Here’s How it Works","link":"https://www.dcrainmaker.com/2021/11/fitbit-daily-readiness-score-review-heres-how-it-works.html","date":1636466400000,"content":"<p></p>\n<p>Today Fitbit announced that they are rolling out their new Daily Readiness Score to Fitbit Premium users. This covers the Sense, Versa 3, Versa 2, Charge 5, Luxe, and Inspire 2. As long as you have one of those devices and a Fitbit Premium subscription, then you get to activate the Daily Readiness score in your account.</p>\n<p>The aim of the score is to provide you with a daily ‘How ready are you’ number, encompassing sleep, recent activity, and heart rate variability. From there, Fitbit will give you recommended workouts optimized for that score. And if your score is low enough, it’ll tell you to simply relax and recover (potentially with low impact items), rather than trying to push your body.</p>\n<p>Over the last week I’ve been gathering data trying out the new score system, and seeing how it works. Further, I’ve been comparing it to other scores from other devices, including Whoop and Oura – all in an effort to see what makes the most sense.</p>\n<p>With that, let’s dive into it.</p>\n<h3><span>Getting it Set Up:</span></h3>\n<p>Now before you go forward, you’ll need to consent to the daily readiness score. Meaning, you’ll specifically have to go into the Fitbit app and agree to this, else you won’t get a score. As a casual reminder, you also previously had to consent to do things like see your Stress Management score details. Frankly, this is bizarre. Not because asking for permission for the data it already asked permission for (yet again) is weird, but because it, in turn, means that Fitbit isn’t using any of your historical data. It’s not collecting anything new here, it’s already been collecting this data (for years).</p>\n<p>As a result, you won’t get your score for 4 days, and then it’ll take another 10 days of fine-tuning until you reach Readiness Score happiness. I know this sounds trivial, but if the entire point of daily readiness score is personalization based on your historical data –  then why throw all that data away from consideration? Point being, you need to consent to start. Also, you can actually remove consent and delete the scores later if you don’t like Fitbit or something.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image001-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image001_thumb-2.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image0016-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image0016_thumb-1.png\" /></a></p>\n<p>Anyway, with that all set, now you go forth and do nothing for four days. And by ‘nothing’, I mean sleep and workout as normal. Fitbit notes that you need to get at least 3 hours of sleep per night for at least four nights, and that you need four days of wearing it (notably/ideally with three workouts in there somewhere). During this time frame, it’ll count down the days till magic appears:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image0018-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image0018_thumb-2.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00110-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00110_thumb-2.png\" /></a></p>\n<p>After you’ve completed this onboarding period, you’ll get your first score.</p>\n<p>So, let’s break down what Fitbit is capturing and displaying here. Note that in my case I did this test period with the Charge 5, but again, you can use any of the aforementioned Fitbit devices.</p>\n<h3><span>Readiness Score Details:</span></h3>\n<p>Each morning after you wake up and your sleep score is calculated, you’ll get your Readiness Score. It’ll be displayed within the Fitbit smartphone app:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00112-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00112_thumb-2.png\" /></a></p>\n<p>That score won’t change for the remainder of the day, no matter what you do that day. This score is aimed at telling you whether or not you’re ready to tackle another workout, whether that workout should be harder, or whether you should take more recovery. It does this using data the watch is collecting in three core categories:</p>\n<p><strong>Part 1 – Activity Levels:</strong> It’s looking at your heart rate values over the course of the day, including both workouts and non-workouts, and figuring out how much effort you put out that day in terms of fitness fatigue.</p>\n<p><strong>Part 2 – Recent Sleep:</strong> The platform looks at not just your last night’s sleep, but weighs it with your last three nights’ sleep. Meaning if you’ve had a so-so night of sleep last night, but two solid nights prior, you’ll get more leniency than if you had three back to back to back crappy nights of sleep.</p>\n<p><strong>Part 3 – Heart Rate Variability (HRV):</strong> The unit measures your HRV score during your deep sleep. Historically speaking Fitbit has done HRV measurement over the course of the night, though I’ve asked for clarity on exactly which portions of the night they calculate the score from (more on why in a second).</p>\n<p>With all three of these things put together, you’ll get a ‘Readiness Score’ that’s from 0 to 100 each day. The higher the score, the more ‘ready’ you are. The lower the score, the more recovery you need. The scores are bucketized into three buckets: Low (0-29), Good, and Excellent (30-100). You can see three examples of my score here:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00115.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00115_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00117.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00117_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00119.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00119_thumb.png\" /></a></p>\n<p>Note that Fitbit is inconsistent on these numbers. In my actual usage, my score of ‘30’ got a ‘Good’ score. However, all their PR mockup screenshots from the past three months show a score of ‘30’ as a ‘Low’ score. Further, they don’t define anywhere at this point the top-end of the ‘Good’ score and where it transitions to ‘Excellent’. And finally, as you see above with my real-world 30, that fills the entire bar of the 2nd chunk, which seems weird – since obviously I’m a single unit away from being in the lowest category. That’s like having an odometer that shows you at 30MPH when you’re doing 70KPH on the highway. What’s the point?</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/image-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/image_thumb-1.png\" /></a></p>\n<p>In any event, you can tap on the readiness score to see how and why you got the score you did. Up top it’ll have some text, and then from there it’ll show your Active Zone minutes each day. Remember that Fitbit’s Active Zone minutes aren’t directly workout minutes, but a multiplier based on intensity. So a 40-minute workout (like yesterday) can earn 96 Active Zone minutes because it was painful enough.</p>\n<p>As you slide down further you’ll see those three pillars shown – Activity, Recent Sleep, HRV, and how you scored in each one.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00121.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00121_thumb.png\" /></a></p>\n<p>I can then tap on each of those categories to get a bit more detail on why it gave me that score. I like this, the approach is far more detailed than Whoop, or Garmin in terms of *WHY* something is contributing to a score (save one bit I’ll discuss in a second). Oura does a similarly good job here of contribution factors. Here’s Activity:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00123.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00123_thumb.png\" /></a></p>\n<p>Then Sleep:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00125.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00125_thumb.png\" /></a></p>\n<p>Then HRV:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00127.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00127_thumb.png\" /></a></p>\n<p>What’s a bit unclear to me though is that given I had moderate activity, supposedly high sleep, and ‘average’ HRV, how I end up with a score of 39. I’m not necessarily disputing the feeling of 39, but more how those three bars end up giving me a 39, when visually if I average those, then I’d expect a 50-70 score:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00129.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00129_thumb.png\" /></a></p>\n<p>So while Fitbit does a good job at explaining the *why* behind each component, they fail to explain how exactly each component contributes to your score. Meaning, is that ‘Moderate’ activity level hurting me? Is the ‘average’ HRV level bringing me down score-wise?</p>\n<p>Scores aside, if we scroll down a bit we’ll see the recommendations for the day. In this case, it recommends 78-110 Active Zone minutes, which seems like an awful lot for a day with a readiness score in the 30’s. That’s roughly an hour-long workout at a moderately high intensity. Or 45 minutes at painfully high intensity.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00131.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00131_thumb.png\" /></a></p>\n<p>And then below it recommends a slate of different workouts from the Fitbit Premium guided workouts catalog. The only challenge is none of these workouts would get me anywhere near that 78-110 Active Zone minutes, as all of them are in the 10-30 minute range, and all of them relatively low intensity (since Active Zone minutes are purely cardio based on heart rate zones).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00133.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00133_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image00135.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image00135_thumb.png\" /></a></p>\n<p>Ideally it would have offered me a 45-60 minute workout at moderate to high intensity, which would have done the trick. Digging around the catalog they certainly have things in the HIIT range, and even some at those durations.</p>\n<p>Finally, it’s worthwhile noting that Fitbit doesn’t display your Readiness Score on your wearable. Instead, you have to open the app. This seems strange to me, after all, they display your sleep score – and arguably our readiness score is more important than your sleep score. I would think ideally Fitbit would follow Suunto and Apple with a ‘Wake-up’ style message which displays your sleep/readiness stats for the day. Or at least, stick it in the same place they (Fitbit) stick the sleep score, on the ‘Today’ dashboard:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/clip_image001-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/clip_image001_thumb-1.jpg\" /></a></p>\n<p>After all – if the point of the score is to provide value, then why hide it?</p>\n<h3><span>Comparison Scores:</span></h3>\n<p>I’ve been tracking comparison scores between different trackers over the last while. Of course, since I’m somewhat wrist-limited on my body, there’s only so many places to record data – especially since I’ve been having trouble getting accurate Whoop 4.0 sleep data anywhere but the wrist (it works great there, but sleep data fails on bicep or Whoop Body clothing positions). Point being, for this data set I’ve got the Fitbit Charge 5 on one wrist, Whoop 4.0 on the other, and the new Oura V3 ring on my finger. All 24×7.</p>\n<p>Here’s the score comparisons for the last few days, once I cleared the initial ‘settling’ window of the Fitbit Charge 5. I’m past the settling windows on Oura and Whoop:</p>\n<p><strong>Monday Night:</strong></p>\n<p>Fitbit Readiness Score: 38<br />\nFitbit Sleep Score: 74<br />\nOura V3 Readiness Score: 67<br />\nOura V3 Sleep Score: 70<br />\nWhoop 4.0 Recovery Score: 28%<br />\nDCR’s In My Head Score: Tired, I’d give sleep score a 50ish, but readiness in the 50’s.</p>\n<p><strong>Sunday Night:</strong></p>\n<p>Fitbit Readiness Score: 69<br />\nFitbit Sleep Score: 79<br />\nOura V3 Readiness Score: 77<br />\nOura V3 Sleep Score: 73<br />\nWhoop 4.0 Recovery Score: 43%<br />\nDCR’s In My Head Score: Good sleep, ready to roll – solid 80’s readiness in my head.</p>\n<p><strong>Saturday Night:</strong></p>\n<p>Fitbit Readiness Score: 30<br />\nFitbit Sleep Score: 64<br />\nOura V3 Readiness Score: 57<br />\nOura V3 Sleep Score: 62<br />\nWhoop 4.0 Recovery Score: 35%<br />\nDCR’s In My Head Score: Went to bed late, a little tired, but overall feel good, maybe in the 70’s.</p>\n<p>–</p>\n<p>Note that both Oura and Fitbit have additional Sleep Scores. One could (correctly) argue that the better comparison of scoring is Whoop Recovery vs Oura/Fitbit Sleep Scores, as technically speaking Whoop doesn’t take into account previous days’ activity/training load in their Recovery Score. Whereas both Oura and Fitbit do. Instead, Whoop’s Recovery Score is purely ‘What did you do last night’ driven. Whereas they give you a different daily training score, which is “How hard did you work today”. Anyways, just wanted to make that clear.</p>\n<p>I’ll dive into both the Whoop 4.0 and Oura V3 in far more detail in my in-depth reviews slated for very shortly. At a high level you can compare them, but as with anything, the details and nuance depend on what you want out of each.</p>\n<p>Of course, on the Fitbit side I’ve still got another 9 days in theory of wearing it before it reaches full happiness level. Though at this point I’m less concerned about the specifics of the score than I am about the usability of it.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p>At a high level, I like how Fitbit has created the score and how they’re clear on where each component comes from. The fact that it takes into account more than just last night’s sleep is useful, as a single bad night’s sleep isn’t always disastrous (as anyone having trouble sleeping the night before a race can attest to). Similarly, inclusion of activity levels in a single readiness score is also quite logical – and ironically something very few companies actually do. Most divide up the training/activity load compared to the sleep side. This pulls it all together. Finally, in theory, recommended workouts based on that score is great, especially since Fitbit has such a diversity of workouts in terms of types of sports but also intensities.</p>\n<p>Now the challenge though is that my real-life usage of it sorta leaves me with constantly asking “Ok, but why?”. For example, it says I have a 39 score yet recommends a pretty significant amount of high-intensity work today – thus, “OK, but why so much intensity then?”. Or it gives me the three pillars/components of the score that all show roughly mid to high ‘scores’, yet my overall score today is at 39 – thus, “OK, but why is more score lower than any given average piece?”. Or that its odometer has a mere three chunks, enabling me to score a 30, yet still appear to be at 70% on the graph – thus, “Ok, but why not just fill the progress bar up to match your score?”</p>\n<p>Again – I really do like the structure of what Fitbit is doing, but in actual execution, it feels a bit unfinished – especially for a Premium-only feature.</p>\n<p>With that, I’ll probably check in again down the road a ways to see if perhaps they’ve changed things based on feedback from users or their own data.</p>\n<p>Thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"45271ccf4480c11a95924a1e314bfa86f02a7de5d67eedf41a9b21cccb7a1c78","category":"Cycling"}