{"title":"Acid‐induced conformation regulation of peanut polysaccharide and its effect on stability and digestibility of oil‐in‐water emulsion","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13155?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Developing the stable and healthy emulsion-based food is in accord with the needs of people for health. In the present study, acidification at pH 3.0 of peanut polysaccharide (APPSI) was employed to regulate its conformation and further improve its advantages in preparing oil-in-water emulsion.</p>\n<h2>RESULTS</h2>\n<p>The results indicated that acidification induced conversion of PPSI aggregates into linear chains. Increasing concentration promoted formation of cross-linked network structure shown in transmission electron microscopy images. Consequently, the viscosity, yield stress, storage modulus and flow activation energy significantly increased, further fabricating gel structure. Moreover, aggregation behavior suggested that more exposed proteins were involved in gel structure, thereby forming many hydrophobic cores as verified by fluorescence spectroscopy of pyrene. Afterwards, emulsion characteristics indicated that APPSI produced strong and thick steric hindrance around oil droplets and the coil-like interweaved chains locked the continuous phase, bringing strong elasticity and resistance to stress and creaming. Meanwhile, the lower fatty acid in APPSI-emulsion was released after simulated gastrointestinal digestion, mainly as a result of the high retention ratio of emulsion droplets. Furthermore, the elastic and viscous Lissajous curves suggested that the structure strength of APPSI-emulsion was similar to that of the salad dressing within the strain 53.22%.</p>\n<h2>CONCLUSION</h2>\n<p>The conformation of PPSI after acidification at pH 3.0 was suitable for preparing the stable emulsion. The obtained emulsion could resist digestion and maintain a strong structure, comprising a cholesterol-free and low-fat salad dressing substitute. © 2023 Society of Chemical Industry.</p>","author":"Jianfen Ye, \nXiao Hua, \nXingfeng Shao, \nRuijin Yang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"45323a02c65aa97525c7e25a20e9a4fe8f0b330b779ac91dbf82639dbadecf8f","category":"Environment"}