{"title":"Influence of Soil Ecological Stoichiometry on aboveground biomass Under Fertilizer Application and Mixed Sowing Treatments","link":"https://www.preprints.org/manuscript/202410.0850/v1","date":1728612005000,"content":"The construction of artificial grasslands using native species is an effective measure to restore degraded grassland. In this study, three native grass species, Elymus nutans, Elymus tangutorum and Poa litwinowiana, domesticated in the northern Tibetan Plateau, were used as test subjects. Three monocultures El. N, El. T and Po. L and four mixed combinations El. N+El. T, El. N+Po. L, El. T+Po. L and El. N + El. T + Po. L were set up, with 7 sowing combinations as the main zones, and nested fertilization and non-fertilization as the secondary zones. The optimal sowing combinations were selected to clarify the community growth dynamics of different grass pasture, and to investigate the transgressive overyielding and diversity effects of artificial grassland and the response of soil chemometrics to fertilizer application, with a view to providing a scientific basis for ecological restoration of degraded grassland in the northern Tibetan Plateau. The results show that the different sowing combinations of grassland all exhibit significant growth, with aboveground biomass peaking on 20 September. The type of El. N is the dominant community of the mixed combinations. The forage yield was highest in the combination, and the fertilization treatment significantly increased the forage yield. El. N + El. T + Po. L mixed sowing with fertilizer application is the recommended methodology to establish artificial grassland in the northern Tibetan Plateau. The relative yield totals of the mixed combinations were all greater than 1, and all were transgressive overyielding. Combined with the analysis of the distribution of soil ecological stoichiometric characteristics under fertilizer and non-fertilizer treatments, it was found that aboveground biomass and transgressive overyielding coefficients responded to soil ecological stoichiometry in completely different ways. Under the unfertilized treatment, soil C, N and P are regulated primarily through microbial stoichiometry under the resource dependence of soil dissolved nutrient stoichiometry, which affected aboveground of artificial grassland. Under the fertilizer treatment, microbially mediated extracellular enzyme stoichiometry was dynamically changing to regulate the new substrate environmental supply and demand balance derived from fertilizer application. Future research should further explore the long-term effects of these combinations under different environmental conditions and integrate other ecological restoration techniques to enhance the sustainability and ecological benefits of artificial grasslands. This will help achieve ecological balance and efficient utilization of forage resources in the Tibetan Plateau region, providing a more comprehensive scientific basis for regional environmental protection.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"45365d5acbef1f2c4e78fef158e521f2bd43f0a415cb4ffb211ef47e7f7df0d7","category":"Interdisciplinary"}