{"title":"Measurement Error Analysis of Seawater Refractive Index Measurement Sensor Based on a Position-Sensitive Detector","link":"https://www.preprints.org/manuscript/202406.1817/v1","date":1719405792000,"content":"The refractive index of seawater is one of the essential parameters in ocean observation, so it is necessary to achieve high-precision seawater refractive index measurements. A seawater refractive index measurement system based on position-sensitive detectors is an effective means to achieve high-precision measurement of seawater refractive index. However, in the actual seawater refractive index measurement process, the impact of the measurement error caused by the jitter signal obtained from the measurement on the measurement results cannot be ignored. In this paper, we theoretically analyse the causes of the long jitter signals during seawater refractive index measurement and quantify the influencing factors. Through the analysis, it can be seen that the angle between the two windows in the refractive index measurement area of seawater causes a great error on the measurement results, so the angle between the two windows should be controlled within 2.06° in order to effectively reduce the measurement error. At the same time, the factors affecting the measurement accuracy of the position-sensitive detector are analysed, and the factors leading to the reduction of the measurement accuracy of the position-sensitive detector are mainly the background light, the size of the photosensitive surface, and the change of the temperature of the working environment. For the above factors, we add a narrow-band filter with a bandwidth of 0.9nm in front of the photosensitive surface of the position-sensitive detector during the construction of the measurement system, so as to filter out stray light other than the signal light source. On the premise of ensuring the measuring range of the refractive index of seawater, a position-sensitive detector with a photosensitive surface size of 4 mm×4 mm was selected. In order to reduce the temperature variation of the working environment of the position-sensitive detector, the measurement system was partitioned. In order to validate the testing error range of the optimised test system, standard seawater samples under the same conditions were measured. It can be seen that the jitter signal of the measurement system has been reduced from 0.0022mm before the optimisation to 0.0011mm after the optimisation, and the deviation of the refractive index has been reduced by 1.09×10−8RIU. The experimental results show that the refractive index of seawater has been effectively reduced by adjusting the optical path and the structure of the seawater refractive index measurement system.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"453b27fd6bd2c57fda55c0fc02c5b90184c0fa2c27e9217c92d047701a02456d","category":"Interdisciplinary"}