{"title":"Rocket Report: SpaceX to build huge launch tower, Branson sells Virgin stock","link":"https://arstechnica.com/?p=1757167","date":1618570814000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/BlueOrigin_NS15_06_CapsuleDescent-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/BlueOrigin_NS15_06_CapsuleDescent.jpg\">Enlarge</a> <span>/</span> New Shepard crew capsule is seen landing in West Texas. (credit: Blue Origin)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 3.41 of the Rocket Report! As always there is plenty of news in the world of launch, and this week we have several stories about heavy lift vehicles. Perhaps most interesting, SpaceX has received approval from the Federal Aviation Administration to press ahead with construction of a large tower for its Starship Launch System.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Blue Origin completes final step before crew mission</strong>. On Wednesday morning, in West Texas, Blue Origin flew its New Shepard-15 mission on a suborbital flight to test its vehicle for passengers. Two people even climbed into the vehicle before the launch to test the ingress procedures, but they exited before the launch took place. The mission was another success, with both the booster and capsule making a feathery landing.</p></div><p><a href=\"https://arstechnica.com/?p=1757167#p3\">Read 26 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1757167&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"453c2846f4402c71eb8ff2716e133dce8d0008a808f914b6f1bffbd400da2228","category":"Tech"}