{"title":"Applying parentage methods to detect gravel augmentation effects on juvenile Chinook Salmon recruitment rates","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4264?af=R","date":1709625600000,"content":"<h2>Abstract</h2>\n<p>Quantifiable measurement of habitat restoration effects on salmonid reproductive performance is limited, although it is necessary for evaluating whether population responses follow management actions. We investigated using close-kin mark-recapture methods to partition restoration effects within standard monitoring metrics of juvenile emigrants leaving the natal reach. This approach allowed for statistical comparison of relative juvenile capture rates (recruitment) from Chinook Salmon (<i>Oncorhynchus tshawytscha</i>) naturally reproducing in gravel augmented (restored) and nonaugmented (unrestored) reaches of a highly managed California River. Genetic parentage techniques linked adult females that had spawned in augmented and nonaugmented spawning habitats with juvenile Chinook Salmon sampled the following spring at a trap located below the natal spawning area. Successful recruitment was documented from both augmented and nonaugmented habitats, with no statistical difference between the two habitat types. The capture rate per adult female was low (0.19–0.24 juveniles/female) compared to rates observed in other systems. Within the juvenile collections, most females in the study had 0 or 1 offspring observed; however, one female that spawned in a restored habitat had 25 offspring recovered at the trap. We modeled juvenile capture rates in relation to a range of biological and environmental variables including spawning habitat site, spawning habitat treatment (augmented and nonaugmented), annual spawner abundance, year spawned, female fork length, spawning and hatch day, and flow maximum and variance. There was an inverse relationship between annual adult abundance (escapement obtained from carcass surveys) and recruitment (juvenile recoveries at trap), suggesting habitat limitation may be creating density-dependent effects. Additionally, female body size was positively associated with recruitment, while spawning day and mean daily temperature were inversely associated with recruitment, suggesting that both biological and environmental factors independent of habitat influenced reproduction potential. This study provides evidence that habitat restoration could have an additive (incremental) positive effect on recruitment rate, informing hatchery management and restoration activities related to population recovery.</p>","author":"Scott M. Blankenship, \nAvery Scherer, \nCheryl Dean, \nKirsten Sellheim, \nJamie Sweeney, \nJoseph Merz","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"453d955d8a9bd1f4bdfe98ed725e4ef1f93c84c896eba2cabd675c38ffa82818","category":"Environment"}