{"title":"เฟซบุ๊กโอเพนซอร์ส Blender Bot 2.0 ปัญญาประดิษฐ์แชทบอทที่จำเรื่องราวที่แชทได้ เติมความรู้ได้เรื่อยๆ","link":"https://www.blognone.com/node/123824","date":1626891259000,"content":"<div><div><div><p>เฟซบุ๊กนำเสนอ Blender Bot 2.0 ปัญญาประดิษฐ์แชทบอท ที่เน้นการใช้งานจริงมากขึ้นด้วยการเรียนรู้เรื่องราวใหม่ๆ จากอินเทอร์เน็ต พร้อมกับจำบทสนทนาได้นานขึ้น ทำให้แชทบอตมีความสามารถใกล้เคียงมนุษย์จริงๆ มากขึ้น</p>\n<p>ทุกวันนี้ปัญญาประดิษฐ์แชทบอทจำนวนมากมักอาศัยการฝึกปัญญาประดิษฐ์ด้วยข้อมูลมหาศาล แม้จะมีความสำเร็จหลายอย่างแต่มีข้อจำกัดคือความรู้ของแชทบอทนั้นมีจำกัดตามที่ฝึกมาเท่านั้น ไม่สามารถรับรู้ข้อมูลใหม่ๆ ที่เปลี่ยนแปลงทุกวัน และเนื่องจากความรู้ทั้งหมดทุกฝึกไว้ในตัวปัญญาประดิษฐ์แต่แรก บางครั้งตัวปัญญาประดิษฐ์เกิดอาการ<em>หลอน</em> ด้วยการตอบข้อเท็จจริงผิดไปจากความเป็นจริงโดยผู้พัฒนาไม่แน่ใจว่ามันนำความรู้ผิดๆ มาจากไหน</p>\n<p>Blender Bot 2.0 มีความสามารถเรียนรู้ข้อเท็จจริงเพิ่มเติมได้เรื่อยๆ โดยหากเป็นคำถามตัวปัญญาประดิษฐ์ก็จะไปค้นจากอินเทอร์เน็ตมาแปลงเป็นบทสนทนา ทำให้ผู้ใช้ได้ข้อมูลปัจจุบัน และหากผู้ใช้เล่าข้อเท็จจริงบางอย่างตัวบอทก็จะจำได้เป็นเวลานานหลายวันหรือหลายเดือน สถาปัตยกรรมเช่นนี้ทำให้บอทแต่ละตัวตอบผู้ใช้แต่ละคนต่างกันไปตามความทรงจำที่เคยพูดคุยกันก่อนหน้า</p>\n<p><img src=\"https://scontent.fbkk28-1.fna.fbcdn.net/v/t39.2365-6/218809612_533276327869881_6266526427832306048_n.jpg?_nc_cat=110&amp;ccb=1-3&amp;_nc_sid=ad8a9d&amp;_nc_ohc=_qit41Xh8xYAX-1nFxU&amp;_nc_ht=scontent.fbkk28-1.fna&amp;oh=595e16e430b24adf83f68c9f91182ef8&amp;oe=60FE2A75\" /></p>\n<p>กระบวนการฝึก Blender Bot 2.0 ต้องสร้างชุดข้อมูลพิเศษ ชุดแรกคือ ข้อมูลการแปลงบทสนทนาให้กลายเป็นคำค้นหา และอีกชุดคือบทสนทนาต่อเนื่องหลายรอบ (multi-session chat)</p>\n<p>เฟซบุ๊กระบุว่า Blender Bot 2.0 ยังมีอาการหลอนอยู่บ้าง รวมถึงบางครั้งก็ตอบคำถามขัดแย้งกันเอง นอกจากนี้ตัวโมเดลปัญญาประดิษฐ์ยังไม่ได้เรียนรู้จากการสนทนาก่อนหน้า หากข้อความบางอย่างทำให้การแชตผิดพลาด ผู้ใช้ไม่สามารถสอนให้ปัญญาประดิษฐ์แก้ไขได้</p>\n<p>ที่มา - <a href=\"https://ai.facebook.com/blog/blender-bot-2-an-open-source-chatbot-that-builds-long-term-memory-and-searches-the-internet/\">Facebook</a></p>\n<p><img src=\"https://scontent.fbkk28-1.fna.fbcdn.net/v/t39.2365-6/218826365_334320384835626_5539040833117094338_n.jpg?_nc_cat=110&amp;ccb=1-3&amp;_nc_sid=ad8a9d&amp;_nc_ohc=SWjKiP1ZyBsAX-kluwK&amp;_nc_ht=scontent.fbkk28-1.fna&amp;oh=bbf20795084ad4bfed1a7b97ef20a52f&amp;oe=60FD2111\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"45428c567c27ffd001b1ee07960c7446d08ada37ff306545be86461fa2929034","category":"Thai"}