{"title":"The people behind a WorldTour team #2: The bus driver","link":"https://www.cyclist.co.uk/in-depth/pro-cycling-team-staff-bus-driver","date":1709038361000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/pro-cycling-team-staff-bus-driver\">The people behind a WorldTour team #2: The bus driver</a></p>\n\n<p>In all the excitement of a Tour de France stage, the spotlight rarely falls on the team bus driver. Except in 2013, when the driver for Orica-GreenEdge, Garikoitz Atxa, endured the infamy of getting the team bus wedged beneath the finish gantry of Stage 1, with the peloton just kilometres from the finish and getting closer by the second.</p>\n\n\n\n<p>‘Have you ever had bad luck like that?’ <em>Cyclist</em> asks EF Education-EasyPost’s bus driver, Richard Romero. ‘Thankfully not,’ the Spaniard replies. ‘It looked very stressful. Mind you, so is driving a long and heavy vehicle up and down the mountains.’</p>\n\n\n\n<p>Romero is a recent recruit to the cycling bus service but has been in the sport for 20 years. ‘I used to be a soigneur and my first professional race was the 2003 Giro d’Italia with the Kelme Costa Blanca team,’ he says. ‘I then worked with many teams, including national squads, before taking my bus driver’s test in 2019 with the Delko Pro team. I joined EF as a soigneur in 2021, and at the end of the season they offered me the driver role.’</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/audax-stories\">Meet the audaxers</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/does-bike-weight-matter\">Opinion: Weight matters</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/pro-cycling-team-staff-chef\">The people behind a WorldTour team #1: The team chef</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>EF has two official drivers, who are responsible for the buses that are used to transfer the riders from hotel to start line – ‘even if it’s only 500m, like we had once at the Tour du Suisse’ – and then from the race finish to the next hotel.</p>\n\n\n\n<p>Romero accumulates up to 180 days of racing each year, equating to upwards of 60,000km. That’s Europe only, he says, as he doesn’t leave the northern hemisphere for work. Nor does the bus, meaning the team either hires an alternative for races such as the Tour Down Under or one is provided by the organiser.</p>\n\n\n\n<p>‘The longest drive is probably to the Tour of Denmark. Our service course is in Girona, where we store the bus, and it’s more than 2,000km to somewhere like Copenhagen.’</p>\n\n\n\n<p>The bus Romero drives is 40m long, 11 years old and has over 420,000km on the clock. ‘But it’s still reliable and drives well,’ he assures us, which is just as well for both him and the riders.</p>\n\n\n\n<h2>All mod cons</h2>\n\n\n\n<p>Inside, the vehicle is designed to meet the very specific requirements of a WorldTour team.</p>\n\n\n\n<p>‘Normally a team will buy a bus that has been stripped out,’ says Romero. ‘A specialist company then designs the interior for cyclists. The riders’ seats are incredibly comfortable and can rotate. Each rider’s seat will change race by race, apart from Rigo [Rigoberto Urán]. He always has the same seat right behind me, as he’s our captain.’</p>\n\n\n\n<p>Urán’s throne, like all the others, is flanked by cubby holes and charging ports for phones, race radios, race numbers… and he always travels with a hair dryer, which explains his immaculate bouffant.</p>\n\n\n\n<p>‘Above the driver’s seat we have the first of four televisions. This is for the sport director to run through the course profile and tactics for that day. There’s also a television where we might watch the end of a stage if we’re parked, and there’s another one at the back of the bus for meetings. And we have one we attach outside for fans and journalists to watch.’</p>\n\n\n\n<p>There’s one toilet, two showers and two coffee machines: ‘They’re Nespresso and we use capsules. Years ago we had a much larger machine but it was impractical. The riders generally have espressos, while many of the staff will have cappuccinos. A rider might ask for one occasionally but they’re calorific so that’s rare.’</p>\n\n\n<div>\n<figure><a href=\"https://store.cyclist.co.uk/subscriptions\" target=\"_blank\"><img width=\"970\" height=\"343\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-970x343.jpg\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-970x343.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-300x106.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-768x271.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-1536x543.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-2048x724.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-750x265.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-1140x403.jpg 1140w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p>The nutrition theme continues into the bus’s kitchen, where a fridge holds the ingredients for post-ride shakes: ‘I’ll always mix the recovery drinks, which contain carbs and protein, with input from the nutritionist. He’ll guide me on quantities as they can vary depending on role in the team and role on the day.</p>\n\n\n\n<p>‘I cook for the riders too,’ he adds. ‘Nothing too complicated – chicken, pasta and vegetables – and only at smaller races. Our chef [Owen Blandy, featured last issue] is at the bigger one-day races and Grand Tours. They eat on the way back to the hotel.’</p>\n\n\n\n<p>Romero keeps the cupboards on board the bus stocked with energy bars and gels, with intake guided by a poster traffic light system: ‘If it’s a hard day, maybe in the mountains or if there’s cold weather, it’s a red day so the riders will be advised to take in more carbohydrates. If it’s green, it’s an easy day so they should consume less.’</p>\n\n\n\n<p>Stored beneath the riders is an electric generator and two water tanks – one 800-litre tank of clean water for drinking and showers, one 400-litre tank for dirty water from showers and the toilet.</p>\n\n\n\n<h2>Clean and protect</h2>\n\n\n\n<p>‘I clean those showers every single day,’ Romero laments. ‘In fact, I clean the bus inside and outside every day. It can be very messy once the riders have finished.’</p>\n\n\n\n<p>At times he even finds himself taking on the role of bodyguard: ‘We store Wahoo turbo trainers on the bus, which the riders warm up and cool down on. I stretch out a barrier because the fans, who we love, can often come very close. If Rigo and Richard Carapaz are at the same race it’s crazy, because they are like rock stars.’ </p>\n\n\n\n<p>Romero is also responsible for protecting the riders on the road: ‘The scariest place I’ve driven is in the Dolomites at the Giro d’Italia. You have narrow roads, sheer drops… it’s <em>difficult</em>. Then again, you must remain relaxed. This is your job and you must stay calm. It can be hard work.’</p>\n\n\n\n<p><strong>• This article originally appeared in issue 149 of <em>Cyclist </em>magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to </a><a href=\"https://store.cyclist.co.uk/subscriptions\" target=\"_blank\">subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/pro-cycling-team-staff-bus-driver\">The people behind a WorldTour team #2: The bus driver</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"4547ef13cce908e0e1e7dfe44b4a4a3a98cd77f0c0818b11375c7906270e5b69","category":"Cycling"}