{"title":"The role and value of counsellors in the treatment journeys of people with tuberculosis and their families: Qualitative insights from the South Fly District of Papua New Guinea","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002572","date":1729519200000,"content":"<p>by Paula Jops, John Cowan, Richard Nake Trumb, Martha Kupul, Allan Kuma, Stephen Bell, Tess Keam, Mathias Bauri, Herolyn Nindil, Suman S. Majumdar, Stacia Finch, William Pomat, Ben J. Marais, Guy B. Marks, John Kaldor, Andrew Vallely, Stephen M. Graham, Angela Kelly-Hanku</p>\r\n\r\nCombined education and counselling can contribute to person-centred care for tuberculosis (TB), improving uptake, adherence, and outcomes of treatment for TB disease and TB infection. Though strongly recommended by the World Health Organization for all people diagnosed with TB, education and counselling is not widely implemented in TB programs around the world. In 2016, a pilot TB education and counselling program, delivered by trained professionals and peers, was initiated to support people on TB treatment in the South Fly District of Papua New Guinea. This article reports on select findings from a qualitative study that examined the socio-cultural dimensions of TB, including treatment support such as education and counselling, in the South Fly District. An assessment on data collected during 128 semi-structured in-depth interviews of the role of counsellors on TB treatment journeys revealed strong participant support for the counsellors and the services they delivered, with particular emphasis on the emotional support provided to address fears and concerns related to TB diagnosis and treatment, and to support treatment adherence; valuable attributes of counsellors; their role as intermediaries between patients and health workers; their provision of biomedical knowledge of TB transmission and disease; and their assistance in addressing stigma and discrimination from family and community. Participants also noted how tackling the socio-structural issues that drive TB transmission in people’s homes and communities were beyond the remit of counsellors’ work. TB education and counselling should be an essential part of all TB services to provide support and encouragement for people to continue treatment to completion.","author":"Paula Jops","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"454917de8645b0a3f997eedd0d3e9a32dbca7682ea8133d220760d2099b9850b","category":"Environment"}