{"title":"A sad dictator rides through Ashgabat on World Bicycle Day","link":"https://cyclingtips.com/2021/06/sketch-a-sad-dictator-on-world-bicycle-day-in-ashgabat/","date":1622812471000,"content":"<p>What a difference a year makes. </p>\n\n\n\n<p><a href=\"https://cyclingtips.com/2020/06/the-uci-just-gave-its-highest-award-to-a-dictator/\">A year ago to the day</a>, Gurbanguly Berdimuhamedov was on a teleconference with David Lappartient and Igor Makarov, being handed the mysterious UCI Order in recognition for his services to cycling. The Turkmen dictator had secured hosting rights to the 2021 World Track Championships, and seemed convinced that the country would be hosting the 2026 World Road Championships as well. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/Screen-Shot-2020-06-05-at-8.56.27-am-1340x750.jpg\" /></figure>\n\n\n\n<p>In celebration of the occasion, he had ordered an enormous statue to cycling to be erected on the outskirts of Ashgabat. Gold figures on bikes jerkily circled a blue globe. Thousands of Berdimuhamedov’s subjects followed him in neat rows, processing slowly along the vast empty highways of the capital. </p>\n\n\n\n<p>In the year since, Berdimuhamedov has become a minor celebrity in the cycling world, at the centre of a <a href=\"https://cyclingtips.com/2020/11/the-dictator-the-oligarch-and-the-uci-president/\">web of intrigue</a> involving the UCI and senior members of the sport’s establishment. But a year on from one of the dictator’s proudest moments, the story of Berdimuhamedov and cycling reached its nadir. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Screen-Shot-2021-06-04-at-9.31.49-am-1340x679.png\" /></figure>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Screen-Shot-2021-06-04-at-9.42.47-am-1340x678.png\" /></figure>\n\n\n\n<p>It was World Bicycle Day, and the <a href=\"https://cyclingtips.com/2021/06/uci-moves-track-worlds-from-covid-free-turkmenistan-due-to-covid/\">UCI had made the surprise announcement </a>that Ashgabat would no longer be the host of Track Worlds. One of Berdimuhamedov’s great sportswashing ploys had disappeared in a puff of (harmful) dust. </p>\n\n\n\n<p>But because it was World Bicycle Day – one of Berdimuhamedov’s favourite days of the year, and a Turkmen public holiday – there was a procession to be held. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Screen-Shot-2021-06-04-at-9.40.50-am-1340x676.png\" /></figure>\n\n\n\n<p>You can watch pretty much the whole thing on Youtube, if you’re so inclined. Turkmen news outlets – both written and filmed – are not known for their brevity. In yesterday’s edition of the nightly TV news, Altyn Asyr, World Bicycle Day is the dominant theme of proceedings. </p>\n\n\n\n<p>The 35 minute bulletin has an opening segment from a minute in featuring Berdimuhamedov riding around Ashgabat that runs for the first twelve and a half minutes, and then there’s a brief break for other news, and then it’s more World Bicycle Day content from 18 minutes ‘til the weather report (hot and overcast is the basic gist). </p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>There are countless great moments, ranging from another <a href=\"https://youtu.be/Z4fBItQJJPw?t=126\">genre-hopping dance banger</a> to a <a href=\"https://youtu.be/Z4fBItQJJPw?t=1905\">visit to a Turkmen bike shop</a>. There’s a kid’s bike there that has Spiderman all over it and says, simply, SPIDER. </p>\n\n\n\n<p>Mostly, though, it’s the Berdimuhamedov show. Berdimuhamedov slowly freewheeling his way along freeways that peter out in the middle of a desert. Berdimuhamedov half-heartedly waving at one of the many dancing troupes. Berdimuhamedov scowling through the start of the news bulletin. </p>\n\n\n\n<p>I don’t speak Turkmen – as much as I sometimes wish I do, seeing how much time I seem to spend writing about the place – but something seems different about the dictator’s demeanour this time around. He looks a bit pissed off, like he had a World Championships taken away from him for reasons that he doesn’t totally agree with, or because of a virus he refuses to acknowledge. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Screen-Shot-2021-06-04-at-9.44.24-am-1340x676.png\" /></figure>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Screen-Shot-2021-06-04-at-9.36.16-am-1340x678.png\" /></figure>\n\n\n\n<p>Since COVID struck, Berdimuhamedov has <a href=\"https://cyclingtips.com/2021/01/covid-free-turkmenistan-to-vaccinate-riders-against-virus-it-wont-acknowledge/\">steadfastly denied the existence of it</a> within his country’s borders. That COVID was ultimately the reason that was cited for the relocation of the Track Worlds is, to put it lightly, a bit ironic. But there were so many other reasons why it could, and should, have happened sooner – homophobia, persecution of religious and political minorities, suppression of a free media, vote-rigging, corruption. </p>\n\n\n\n<p>If COVID’s the excuse that we’re going with, I guess it’ll do as a euphemism for greater ills. </p>\n\n\n\n<p>Toward the end of one of the news segments, Berdimuhamedov stands in front of a sprawling government complex surveying his people through a pair of aviator sunglasses. He’s the sportswashing superstar of the show, a tyrant in a tracksuit, and the thousands of people parading in front of him to pounding techno beats are his supporting cast. </p>\n\n\n\n<p>There was probably something like this planned for October 13, when the world of cycling would enter the fantasy world of Turkmenistan. We’ll never know. This year, the Gurbanguly show’s not going international.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Screen-Shot-2021-06-04-at-9.27.34-am-1340x680.png\" /></figure>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Screen-Shot-2021-06-04-at-9.42.11-am-1340x676.png\" /></figure>\n\n\n    <div>\n    <div>\n\t\n<h2>SIDEBAR: A bit on World Bicycle Day</h2>\n<p>First instituted in 2018, World Bicycle Day was universally ratified by the United Nations and sponsored by Turkmenistan, with the motion brought forward by the country’s permanent ambassador to the UN, Aksoltan Attaeva. </p>\n<p>Over the years since, Berdimuhamedov has been keen to take credit for the day, building it into a healthsome narrative of him as the great defender of public health. In a press release yesterday, state media characterised World Bicycle Day as “an initiative put forward by the esteemed President”. The UCI, under fire last year for sneaking a prestigious award to a dictator, also cited World Bicycle Day as a reason why Berdimuhamedov was a fitting once-in-13-years recipient for the UCI Order. </p>\n<p>As with so much about this whole story, the reality of World Bicycle Day is quite different. Instead of being an order handed down from on high by Gurbanguly Berdimuhamedov, World Bicycle Day was in fact the initiative of a Polish-American Sociology professor, Leszek Sibilski, and was first proposed in 2015.</p>\n<p>Sibilski – who is a former national-level track cyclist in Poland – has remained tied to cycling since he moved into academia. Together with students of his from Montgomery College over the years – many of whom passionately supported the project, taking on social media roles and even designing the World Bicycle Day logo – there was a groundswell of support for the idea, and finally, a connection was made with the Turkmen UN delegation, who were amenable to putting such an initative forward.</p>\n<p>On the first ever World Bicycle Day, Sibilski and 12 students of his attended the United Nations in New York to watch his idea become a reality. Sibilski loves bikes for entirely wholesome reasons – the way that they can reduce distances in the developing world, improve sustainability and reduce gender inequalities.</p>\n<p>Sibilski, who has seen World Bicycle Day grow over the years since, says that he has had no contact or recognition from Berdimuhamedov or the UCI, both of whom have enthusiastically embraced the concept for their own purposes. No UCI Order for the academic, certainly.</p>\n<p>In an interview with CyclingTips, Sibilski stressed that he “was the one who contacted the Turkmenistan UN Mission in New York City and provided the entire cycling expertise during the preparation process … I was the sole source for cycling/bicycle expertise/consulting for the Turkmenistan UN diplomats.” He’s never been to Turkmenistan; he financed the establishment of World Bicycle Day from his own personal funds. </p>\n<p>Whilst he had a positive experience getting World Bicycle Day over the line, Sibilski seems a bit perturbed for it to have become a tool for government propaganda in Turkmenistan. But it’s a day that the world celebrates bikes – including for those wholesome reasons that he loves them himself – and for that reason, he’s understandably proud.     </p></div>\n    </div>\n\t<p></p>\n<p>The post <a href=\"https://cyclingtips.com/2021/06/sketch-a-sad-dictator-on-world-bicycle-day-in-ashgabat/\">A sad dictator rides through Ashgabat on World Bicycle Day</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"454f21eb0f5efa6342a9419dfc7a2fa4bc57bbac64586ef66c424a2315d00d91","category":"Cycling"}