{"title":"Effect of chronic cyclic heat stress and supplemented inorganic and organic zinc source levels on grow-finish pig growth performance and estimated body composition","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae029/7639046?rss=1","date":1712016000000,"content":"<span><div>Abstract</div>Zinc (<strong>Zn</strong>) supplementation has proved to mitigate the effects of heat stress with varying effects evident with Zn source during acute heat events. However, the effects of Zn supplementation during long-term summer weather patterns have yet to be explored. Therefore, the objective of this study was to identify the effects of supplementation source and level of Zn to mitigate the negative effects of long-term, cyclic heat stress in finishing swine. Six hundred cross-bred pigs were housed under thermoneutral (<strong>TN</strong>) or cyclic heat (<strong>HS</strong>) conditions simulating summer heat with acute 3-d heat waves for a 70-d study. Thermoneutral conditions were 16.7 to 18.9 °C throughout the study. HS pigs were housed at the same temperature as TN from days 0 to 18, then 28 °C/24 °C for 12 h/12 h on days 18 to 21, followed by 30 °C/26.7 °C for 12 h/12 h on days 24 to 70, except during acute heat (32 to 33 °C/29 to 30 °C, 12 h/12 h) on days 21 to 24, 42 to 45, and 63 to 66. Treatments were arranged in a 2 × 6 factorial with main effects of environment (HS vs. TN) and dietary available Zn supplementation: (1) 50 mg/kg zinc oxide (<strong>ZnO</strong>), (2) 130 mg/kg ZnO, (3) 50 mg/kg of organic Zn (Availa Zn), (4) 50 mg/kg ZnO + 40 mg/kg organic Zn, (5) 50 mg/kg ZnO + 60 mg/kg organic Zn, and (6) 50 mg/kg ZnO + 80 mg/kg organic Zn. Pigs (5 pigs/pen) were blocked by initial body weight (72.2 kg) and randomly allotted to 1 of 12 temperature and diet treatment combinations across 10 replicates. Body weight and feed intake were determined at the beginning and end of each acute heat event. All pigs were ultrasonically scanned at the 10th rib (<strong>TR</strong>) to predict loin muscle area (<strong>LMA</strong>), backfat (<strong>BF</strong>), and percent lean. Data were analyzed by the MIXED procedure in SAS with pen as the experimental unit. At day 63, HS pigs were lighter (<span>P</span> &lt; 0.05), had lower overall average daily gain (<strong>ADG</strong>; <span>P</span> &lt; 0.05) and average daily feed intake (<span>P</span> &lt; 0.05). A diet-by-environment interaction was observed for overall ADG (<span>P</span> &lt; 0.05) with diet 5 HS pigs having a 3.9% reduction in ADG whereas diet 6 had 14.4% reduction in ADG, while under TN temperatures diet 6 had the greatest overall ADG of all treatments. Other diets were intermediate in their ADG under both HS and TN conditions. Pigs under HS had less BF at the TR (<span>P</span> &lt; 0.05) and a smaller LMA (<span>P</span> &lt; 0.05), and a greater calculated percent lean (<span>P</span> &lt; 0.05). Our results indicate that a blend of supplemental Zn sources at 50/60 mg/kg may mitigate the reduction in growth performance due to HS. While not directly contrasted, the NRC requirement of 50 mg/kg Zn may be too low to optimize finishing pig growth performance under both TN and HS conditions.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"45514a0bee13ca5ae27f773c8751e35cc53011a8ad8d29da31169d912f74662b","category":"Environment"}