{"title":"Effect of a loss of the <i>mda5/ifih1</i> gene on the antiviral resistance in a Chinook salmon <i>Oncorhynchus tshawytscha</i> cell line","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311283","date":1728914400000,"content":"<p>by Catherine Collins, Lise Chaumont, Mathilde Peruzzi, Nedim Jamak, Pierre Boudinot, Julia Béjar, Patricia Moreno, Daniel Álvarez Torres, Bertrand Collet</p>\r\n\r\nCells are equipped with intracellular RIG-like Receptors (RLRs) detecting double stranded (ds)RNA, a molecule with Pathogen-Associated Molecular Pattern (PAMPs) generated during the life cycle of many viruses. Melanoma Differentiation-Associated protein 5 (MDA5), a helicase enzyme member of the RLRs encoded by the <i>ifih1</i> gene, binds to long dsRNA molecules during a viral infection and initiates production of type I interferon (IFN1) which orchestrates the antiviral response. In order to understand the contribution of MDA5 to viral resistance in fish cells, we have isolated a clonal Chinook salmon <i>Oncorhynchus tshawytscha</i> epithelial-like cell line invalidated for the <i>ifih1</i> gene by CRISPR/Cas9 genome editing. We demonstrated that IFN1 induction is impaired in this cell line after infection with the Snakehead Rhabdovirus (SHRV), the Salmon Alphavirus (SAV) or Nervous Necrosis Virus (NNV). The cell line, however, did not show any increase in cytopathic effect when infected with SHRV or SAV. Similarly, no cytopathic effect was observed in the <i>ifih1</i><sup>-/-</sup> cell line when infected with Infectious Pancreatic Necrosis Virus (IPNV), Infectious Haemorrhagic Necrotic Virus (IHNV). These results indicate the redundancy of the antiviral innate defence system in CHSE-derived cells, which helps with circumventing viral evasion strategies.","author":"Catherine Collins","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"456b94f6cfbb7cef776b66bf888156cbf3f4c19abbbdf15d048bf8239e10cb03","category":"Interdisciplinary"}