{"title":"Probing the Solid-Electrolyte Interface in Lithium Ion Batteries with Time-of-Flight Secondary Ion Mass Spectrometry","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.091/7719380?rss=1","date":1721779200000,"content":"<span>The performance of lithium-ion batteries is partially determined by their solid-electrolyte interface (SEI). The distribution and chemical speciation of lithium and the interaction of lithium with other electrolyte components is critical information in the search non-flammable solid-state electrolytes for more efficient lithium ion batteries [<a href=\"#ozae044.091-B1\">1</a>]. Obtaining such information from X-ray and electron microscopies is limited by their low sensitivity to lithium and hydrogen. However, imaging and depth profiling by time-of-flight secondary ion mass spectrometry (ToF-SIMS) can reveal three dimensional atomic and molecular distributions in the SEI at micrometer resolutions that are independent of elemental mass [<a href=\"#ozae044.091-B2\">2</a>, <a href=\"#ozae044.091-B3\">3</a>]. Model battery samples were prepared with a solid electrolyte composed of a conducting polymer, a lithium salt, and ceramic nanofibers [<a href=\"#ozae044.091-B4\">4</a>]. Voxels of the SEI in these samples were probed by ToF-SIMS using 30 keV Bi3+primary ions from a liquid metal ion gun (IONTOF M6, Münster, Germany) with simultaneous depth profiling with an argon gas cluster ion beam. ToF-SIMS data analysis strategies for this and other solid electrolyte formulations will be discussed that select secondary ions most representative of different SEI components before and after electrochemical cycling; address variation in ion yields with species, lateral position, or depth; avoid detector saturation; and reduce deleterious sample charging effects.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"457045cdd2d2543054b64c549cf7c326e35cb511bd0faef41f52f3bb239441da","category":"Environment"}