{"title":"The impact of species phylogenetic relatedness on invasion varies distinctly along resource versus non‐resource environmental gradients","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14607?af=R","date":1708336218000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/b52bae6a-0d42-4f48-a8d7-fcec16a7164d/jpe14607-toc-0001-m.png\" alt=\"The impact of species phylogenetic relatedness on invasion varies distinctly along resource versus non-resource environmental gradients\" />\n<p>Our results suggest that the impact of species phylogenetic relatedness on invasion success varies distinctly along resource versus non-resource environmental gradients. These results help to reconcile Darwin's naturalization conundrum, thereby improving the ability to predict the success of alien plant invasions in a changing world. Our study stresses the need to consider adjusting forest species composition to strengthen their resistance to invasion, while taking into account resource and non-resource environmental gradients, particularly after wildfires.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nUnderstanding why some, but not other, plant communities are vulnerable to alien invasive species is essential for predicting and managing biological invasions. Darwin proposed two seemingly contradictory hypotheses on how native-invader relatedness influences invasion success, emphasizing, respectively, the importance of environmental filtering and competition between natives and invaders. Despite much recent empirical research on this topic, reconciling these two hypotheses, known as Darwin's naturalization conundrum, remains a challenge.\n\nUsing plot-level data from natural forests along elevational transects covering strong environmental gradients, we examined whether the invasion of the globally invasive species crofton weed (<i>Ageratina adenophora</i>) can be explained by environmental filtering and/or competition from closely related species linked to environmental gradients.\n\nAbundant precipitation, warm temperatures, open canopies and postfire environments facilitated <i>A. adenophora</i> invasion, whereas resident taxonomic richness suppressed its invasion. Importantly, we found that invader-resident relatedness had a strong negative effect on invader cover under resource scarcity conditions (e.g. low water availability), but not under non-resource environmental stress gradients (e.g. low temperature).\n\n<i>Synthesis and applications.</i> Our results suggest that the impact of species phylogenetic relatedness on invasion success varies distinctly along resource versus non-resource environmental gradients. These results help to reconcile Darwin's naturalization conundrum, thereby improving the ability to predict the success of alien plant invasions in a changing world. Our study stresses the need to consider adjusting forest species composition to strengthen their resistance to invasion, while taking into account resource and non-resource environmental gradients, particularly after wildfires.\n</p>","author":"Guoyan Wang, \nXiaojuan Zhang, \nFlorencia Yannelli, \nJing‐Ji Li, \nSonglin Shi, \nTingbin Zhang, \nXiaojuan Bie, \nXu Chen, \nPei‐Hao Peng, \nLin Jiang","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"457ce16ffabfd5550fc70a35c9bc189285f871bfc687b302e9eb8b96b3e611bc","category":"Environment"}