{"title":"Structure, functional and physicochemical properties of lotus seed protein under different pH environments","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13554?af=R","date":1713873468000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUD</h2>\n<p>This study investigated the structure, functional and physicochemical properties of lotus seed protein (LSP) under different pH environments. The structures of LSP were characterized by sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE), fourier transform infrared spectroscopy (FTIR), zeta potential, particle size distributions, free sulfhydryl and rheological property. The functional and physicochemical properties of LSP were characterized by color, foaming property, emulsification property, solubility, oil holding capacity (OHC), water holding capacity (WHC), differential scanning calorimetry analysis (DSC) and surface hydrophobicity.</p>\n<h2>Results</h2>\n<p>LSP was mainly composed of 8 subunits (18 kDa, 25 kDa, 31 kDa, 47 kDa, 51 kDa, 56 kDa, 65 kDa and 151 kDa), in which the richest band was 25 kDa. FTIR results showed that LSP had high total contents of α-helix and β-sheet (44.81%–46.85%) in acidic environments. Meanwhile, there were more β-structure and random structure in neutral and alkaline environments (pH 7.0 and 9.0). At pH 5.0, LSP had large particle size (1576.98 nm), high emulsion stability index (91.43 min), foaming stability (75.69%), water holding capacity (2.21 g g<sup>−1</sup>), but low solubility (35.98%), free sulfhydryl content (1.95 μmol g<sup>−1</sup>) and surface hydrophobicity (780). DSC analysis showed the denaturation temperatures (82.23°C) of LSP at pH 5.0 was higher than those (80.10°C, 80.52°C, 71.82°C) at pH 3.0, 7.0, 9.0. The analysis of rheological properties showed that LSP gel had high stability and great strength in alkaline environment.</p>\n<h2>Conclusion</h2>\n<p>The findings were anticipated to serve as a valuable reference for the implementation of LSP in the food industry.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Xin Zhong, \nYing‐Qiu Li, \nGui‐Jin Sun, \nChen‐Ying Wang, \nYan Liang, \nXiang‐Zhong Zhao, \nDong‐Liang Hua, \nLei Chen, \nHai‐Zhen Mo","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"458637531a9c334e402d08e9b00d4e0d1cf8b5bafdceada19ee96052bad6fb05","category":"Environment"}