{"title":"New MacBook Pro tidbits: 10-core CPU, 32-core GPU, MagSafe, more","link":"https://www.macworld.com/article/545229/macbook-pro-unleashed-last-minute-rumors.html","date":1634510403000,"content":"<div>\n<section><div></div></section><p>With just hours to go before Apple kicks off its <a href=\"https://www.macworld.com/article/544472/apple-unleashed-event-what-to-expect.html\">highly anticipated “Unleashed” event</a>, we’re starting to get a more complete picture of the MacBook Pro redesign. After learning of <a href=\"https://www.macworld.com/article/545203/the-m1x-macbook-pro-might-have-a-notch.html\">a possible notch</a> yesterday, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2021-10-17/when-will-new-apple-aapl-macbook-pro-launch-as-soon-as-monday-kuvjbbne&amp;xcust=1-1-545229-1-0-0&amp;sref=https://www.macworld.com/feed\">Mark Gurman of Bloomberg</a> has shared his thoughts on Apple’s next-gen laptop, and it’s shaping up to be one of Apple’s biggest upgrades in years.</p>\n\n\n\n<p>For starters, he expects the new CPU to have 10 cores comprised of eight high-performance cores and two energy-efficient cores. That’s a boost over the <a href=\"https://www.macworld.com/article/234860/apple-silicon-m1-system-on-chip-macbook-air-macbook-pro-mac-mini-imac-m1x-specs-features-intel-apps-rosetta-2.html\">M1 chip</a>, which has four high-performance cores and four energy-efficient cores. On the graphics side, Gurman says Apple will offer two varieties: 16 cores and 32 cores. For comparison, the current M1 comes in seven-core and eight-core varieties.</p>\n\n\n\n<p>Additionally, Gurman confirms reports that the new MacBook will mark the return of the HDMI port and SD card slot. Additionally, Gurman reports that Apple “even weighed bringing back an old-school USB-A port to the MacBook Pro,” but he says the old-school port didn’t make the cut. </p>\n\n\n\n<p>Another feature likely making a return to the side of the MacBook Pro will be MagSafe. Gurman says Apple will market it as “an ecosystem” alongside <a href=\"https://www.macworld.com/article/234834/best-magsafe-cases-chargers-accessories-iphone-12-12-pro-12-pro-max-12-mini.html\">MagSafe on the iPhone 12</a>, with a charger that “quickly yanks out if someone trips on the cord.” Gurman says MagSafe speeds will be faster than they are on the iPhone 12, which top out at 15W. </p>\n\n\n\n<p>Gurman also expects the Touch Bar to be retired in the new MacBook Pro. Rumors have claimed for months that Apple will be ditching the skinny display that was introduced in 2016. It would represent the second major rollback for a MacBook feature after the butterfly keyboard, which began being phased out in 2019.</p>\n\n\n\n<p>Finally, Gurman muses on the name of Apple’s next homegrown Mac chip. Rumors have basically settled on M1X as the name, but Gurman also floats the idea of M1Z for the higher-end graphics option. He also reports that new chips have appeared in developer logs under the names “M1 Pro” and “M1 Max,” though he doesn’t expect Apple to use those names in the shipping product.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4590d1c8d181cddfb34dd9072c40dc22f6028e56dd3c7e62ecffa96ed1101116","category":"Apple"}