{"title":"Effect of Nebulised BromAc&reg; on Mucus Plug in a Mechanically Ventilated Ex-Vivo Ovine Lung Model for Obstructive Respiratory Tract","link":"https://www.preprints.org/manuscript/202406.1231/v1","date":1718758295000,"content":"Mucus plugging of the respiratory tract occurs in airway diseases, including asthma, chronic obstructive pulmonary disease and cystic fibrosis. It can cause blockage of airways, leading to breathlessness and lung failure. Here, we demonstrate the effect of BromAc® in dissolving mucus plugs in an novel ex-vivo ovine obstructive lung model using a ventilatory setup. Mucus simulant was filled into the trachea of freshly slaughtered ovine lungs and ventilated via an endotracheal tube (ETT) using Continuous Mandatory Ventilation. Predetermined single or repeated doses of Bromelain, Acetylcysteine (Ac), BromAc® and saline control were administered via an Aerogen® vibrating nebuliser and ventilated for 30 or 60 minutes. Ventilatory recording of resistance, compliance, tidal volume was conducted and rheology pre and post treatment were measured. A significant decline in airway resistance (p&amp;lt;0.0001) compared to saline control was observed when treated with Bromelain, Ac and BromAc®, with the latter showing a stronger mucolytic effect than single agents. The decline in resistance was also effective in shorter timepoint (p&amp;lt;0.05) at lower doses of the drugs. Changes in compliance, peak pressure and tidal volume was not observed post-administration of the drugs. Rheology measurements revealed that BromAc®™ significantly reduced the viscosity of the mucin at the end of 30-minute and 60-minute time points (p&amp;lt;0.001) compared to the saline control. BromAc® showed complete dissolution of the respiratory mucus simulant and improved ventilatory airflow parameters in the ex-vivo ovine model.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"459463140e0d1518d6fd635bc6304f9ade1d7e4ab127a1f22852f49e16facfa1","category":"Interdisciplinary"}