{"title":"From struggle to strength in African and Middle Eastern newcomers’ integration stories to Canada: A participatory health equity research study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302591","date":1714485600000,"content":"<p>by Maggie Fong, Amy Liu, Bryan Lung, Ibrahim Alayche, Shahab Sayfi, Ryan Yuhi Kirenga, Marie Hélène Chomienne, Ammar Saad, Jean Grenier, Azaad Kassam, Rukhsana Ahmed, Kevin Pottie</p>\r\nBackground and objectives <p>Newcomers (immigrants, refugees, and international students) face many personal, gender, cultural, environmental and health system barriers when integrating into a new society. These struggles can affect their health and social care, reducing access to mental health care. This study explores the lived experiences of African and Middle Eastern newcomers to Ontario, Canada. An understanding of newcomer integration challenges, successes and social justice issues is needed to improve health equity and social services.</p> Methods <p>In this qualitative study, we used a participatory research approach to collect stories reflecting participants’ integration perspectives and experiences. Beginning with our immigrant community network, we used snowball sampling to recruit newcomers, ages 18 to 30, originating from Africa or the Middle East. We used qualitative narrative analysis to interpret stories, identifying context themes, integrating related barriers and facilitators, and resolutions and learnings. We shared our findings and sought final feedback from our participants.</p> Findings <p>A total of 18 newcomers, 78% female and approximately half post-secondary students, participated in the study. Participants described an unknown and intimidating migration context, with periods of loneliness and isolation aggravated by cold winter conditions and unfamiliar language and culture. Amidst the struggles, the support of friends and family, along with engaging in schoolwork, exploring new learning opportunities, and participating in community services, all facilitated integration and forged new resilience.</p> Conclusions <p>Community building, friendships, and local services emerged as key elements for future immigrant service research. Utilizing a participatory health research approach allowed us to respond to the call for social justice-oriented research that helps to generate scientific knowledge for promoting culturally adaptive health care and access for marginalized populations.</p>","author":"Maggie Fong","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4595ffc6e12bb26e39832ca7aa3af908caf552748dedbc43a20fbcfb49d8e2c8","category":"Interdisciplinary"}