{"title":"Isochronous singing in 3 crested gibbon species (Nomascus spp.)","link":"https://academic.oup.com/cz/article/70/3/291/7217070?rss=1","date":1688342400000,"content":"<span><div>Abstract</div>The search for common characteristics between the musical abilities of humans and other animal species is still taking its first steps. One of the most promising aspects from a comparative point of view is the analysis of rhythmic components, which are crucial features of human communicative performance but also well-identifiable patterns in the vocal displays of other species. Therefore, the study of rhythm is becoming essential to understand the mechanisms of singing behavior and the evolution of human communication. Recent findings provided evidence that particular rhythmic structures occur in human music and some singing animal species, such as birds and rock hyraxes, but only 2 species of nonhuman primates have been investigated so far (<span>Indri indri</span> and <span>Hylobates lar</span>). Therefore, our study aims to consistently broaden the list of species studied regarding the presence of rhythmic categories. We investigated the temporal organization in the singing of 3 species of crested gibbons (<span>Nomascus gabriellae, Nomascus leucogenys</span>, and <span>Nomascus siki</span>) and found that the most prominent rhythmic category was isochrony. Moreover, we found slight variation in songs’ tempo among species, with <span>N. gabriellae</span> and <span>N. siki</span> singing with a temporal pattern involving a gradually increasing tempo (a musical <span>accelerando</span>), and <span>N. leucogenys</span> with a more regular pattern. Here, we show how the prominence of a peak at the isochrony establishes itself as a shared characteristic in the small apes considered so far.</span>","author":"","siteTitle":"Current Zoology Current Issue","siteHash":"e7197aa0e79464a44186f16a81d9758c42b85acdd06820e73429ff264fcd9f66","entryHash":"459d3d89a707fb41f366de10bffd3da922b29838de9bee670c33a81db3d9609b","category":"Environment"}