{"title":"Apple Watch Series 7: Rumors, Features, Possible Release Date and More","link":"https://www.macrumors.com/guide/apple-watch-series-7/","date":1630774980000,"content":"Apple is expected to introduce the Apple Watch Series 7 at an event in September, and the Series 7 is an exciting update because it features the first significant redesign to the Apple Watch that we've seen in years.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/Apple-Watch-7-Unreleased-Feature-Flat.jpg\" />\r\n<br />\r\nThis guide covers everything we know about the Apple Watch Series 7, ranging from design changes to launch date to production issues.\r\n<br />\r\n<h2>Design and Display</h2>\r\n<br />\r\nThe Apple Watch has looked largely the same since it was released in 2017, though it did get a display overhaul 2017. The Apple Watch Series 7 will feature a much more <a href=\"https://www.macrumors.com/2020/09/14/kuo-no-120hz-iphone-12/\">dramatic design change</a> that will make it clearly distinguishable from prior Apple Watch models.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/prosser-apple-watch-series-7.jpg\" />\r\n<br />\r\nFirst of all, it <a href=\"https://www.macrumors.com/2021/08/26/first-45mm-apple-watch-band-spotted/\">will come</a> in new 41mm and 45mm <a href=\"https://www.macrumors.com/2021/08/24/apple-watch-series-7-case-sizes-increase/\">size options</a>, up from 40 and 44mm. The larger sized display will <a href=\"https://www.macrumors.com/2021/06/14/apple-watch-7-thinner-display-borders/\">feature thinner bezels</a> and a new lamination technique that brings the display closer to the front cover, with updated screen technology.\r\n<br />\r\n\r\n<br />\r\nThe 45mm Apple Watch Series 7 model, which will be the largest to date, <a href=\"https://www.bloomberg.com/news/articles/2021-09-02/apple-s-bigger-watch-will-jam-more-data-than-ever-on-your-wrist\">will have</a> a body size that measures in at 1.9 inches diagonally, up from 1.78 inches, and it will have a resolution of 396 x 484, up from 368 x 448, which equates to 16 percent more pixels. We don't know the exact dimensions of the 41mm model, but it too will see a comparable increase in body size.\r\n<br />\r\n\r\n<br />\r\nThe casing will have a flat-edged design that's similar to the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> or the <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>, which is a departure from the curved edges of the current Apple Watch models. Apple is also rumored to be considering <a href=\"https://www.macrumors.com/2021/05/19/prosser-apple-watch-series-7-design/\">new color options</a>, including a green color that would join the blue shade introduced in 2019.\r\n<br />\r\n\r\n<br />\r\nBecause of this new design, the Apple Watch may be slightly thicker, but <em>Bloomberg</em> says the thickness increase won't be noticeable to users. Other rumors have suggested the Apple Watch Series 7 will be thinner than prior models, so we'll need to wait to see which take is correct.\r\n<br />\r\n\r\n<br />\r\n<h2>Renders</h2>\r\n<br />\r\nWe haven't seen Apple Watch Series 7 component leaks this year, but a few sites have <a href=\"https://www.macrumors.com/2021/08/17/apple-watch-series7-cad-larger-display/\">created renders</a> that are based on information allegedly sourced from the Apple's Asian supply chain.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/91mmobile-apple-watch-series-1.jpg\" />\r\n<br />\r\nThese renders from <em>91mobiles</em> feature an Apple Watch with a flat-edged design, a flatter digital crown, and two longer speakers at the left side of the device.\r\n<br />\r\n\r\n<br />\r\nAccording to the information the renders are based on, the 44mm Apple Watch Series 7 will have a 1.8-inch display, up from the 1.73-inch display in the Series 6. It may also be 1.7mm thinner than the current version.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/91mmobile-apple-watch-series-2.jpg\" />\r\n<br />\r\n\r\n<br />\r\n<h2>Processor and Connectivity</h2>\r\n<br />\r\nApple updates the processor in the Apple Watch each year and the Series 7 will be no exception. The Apple Watch Series 7 is rumored to include a smaller \"S7\" chip that uses <a href=\"https://www.macrumors.com/2021/06/23/apple-watch-series-7-double-sided-s7-chip/\">double-sided technology</a> for module miniaturization.\r\n<br />\r\n\r\n<br />\r\nA smaller S7 chip will allow more room for other components, and one source suggests Apple will use this extra space for <a href=\"https://www.macrumors.com/2021/06/28/apple-watch-series-7-improved-battery-life/\">a bigger battery</a> or new health sensors. Apple is also expected to introduce improved wireless connectivity and an improved U1 Ultra Wideband chip.\r\n<br />\r\n\r\n<br />\r\n<h2>Health Features</h2>\r\n<br />\r\nThere have been no rumors of new health sensors coming in the Apple Watch Series 7, but <em>Nikkei</em> <a href=\"https://www.macrumors.com/2021/08/31/apple-watch-series-7-production-delay/\">recently claimed</a> that the device would have blood pressure measuring capabilities\r\n<br />\r\n\r\n<br />\r\n<em>Bloomberg</em>'s Mark Gurman <a href=\"https://www.macrumors.com/2021/09/01/no-chance-apple-watch-series-7-blood-pressure/\">quickly refuted</a> this claim and said there is \"no chance\" that blood pressure monitoring will be included in the 2021 Apple Watch.\r\n<br />\r\n\r\n<br />\r\nThere has been discussion of blood pressure monitoring due to Apple's partnership <a href=\"https://www.macrumors.com/2021/07/14/apple-supplier-unveils-health-tracking-tech/\">with Rockley Photonics</a>, a company that makes advanced digital health sensors, but this technology is not ready for use.\r\n<br />\r\n\r\n<br />\r\n<h2>New Watch Faces and Software</h2>\r\n<br />\r\nThe Apple Watch Series 7 <a href=\"https://www.macrumors.com/2021/08/29/apple-watch-series-7-new-watch-faces/\">will feature</a> a series of exclusive watch faces that are designed to take advantage of the larger displays. <em>Bloomberg</em> <a href=\"https://www.bloomberg.com/news/articles/2021-09-02/apple-s-bigger-watch-will-jam-more-data-than-ever-on-your-wrist\">has outlined</a> what to expect:\r\n<br />\r\n\r\n<br />\r\n<ul>\r\n<br />\r\n<li>A Modular Max watch face will offer the digital time alongside a small complication like temperature, while additional larger complications will be stacked on top of each other below. It's similar to Infograph Modular, but can show more than one large complication.</li>\r\n<br />\r\n<li>A Continuum face will shift based on \"the flow of time and the current hour.\"</li>\r\n<br />\r\n<li>A new world time watch face will allow users to see all 24 time zones simultaneously. An external dial will display the time zones, while an inner dial will display the time in each location. <em>Bloomberg</em> says it's similar to watch faces popularized by luxury watch makers Patek Philippe, Breitling, and others.</li>\r\n<br />\r\n<li>There's a new Hermes watch face that features numbers that change hour by hour and new Nike watch face with numbers that change based on a person's motion.</li>\r\n<br />\r\n</ul>\r\n<br />\r\n\r\n<br />\r\nWith the launch of the Apple Watch Series 7, Apple also <a href=\"https://www.macrumors.com/2021/08/16/apple-to-launch-variations-time-to-walk-feature/\">plans to introduce</a> new \"Time to Run\" and \"Audio Meditations\" features that will accompany the \"Time to Walk\" option that was introduced earlier this year.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Watch Series 7 Release Date</h2>\r\n<br />\r\nWe're expecting Apple to introduce the Apple Watch Series 7 in September alongside new <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> models. Based on past event dates, the most likely date for the Apple Watch Series 7 event is Tuesday, September 14.\r\n<br />\r\n\r\n<br />\r\nNormally new Apple Watch models come out shortly after Apple holds a launch event, but unfortunately, <a href=\"https://www.macrumors.com/2021/08/31/apple-watch-series-7-production-delay/\">late August reports</a> from <em>Nikkei</em> and <em>Bloomberg</em> have pointed toward production issues.\r\n<br />\r\n\r\n<br />\r\nApple has run into challenges due to the complexity of the Series 7 design, so its release could be delayed or it could be available in limited quantities at launch. Apple has reportedly halted production, but we'll need to wait until the September debut to see whether launch is delayed or supplies are limited. <em>DigiTimes</em> has suggested that production is set to <a href=\"https://www.macrumors.com/2021/09/02/apple-watch-series-7-production-timing/\">ramp up</a> at the end of September. \r\n<br />\r\n\r\n<br />\r\n<h2>Future Apple Watch Rumors</h2>\r\n<br />\r\nAccording to <em>The Wall Street Journal</em> and other sources, Apple <a href=\"https://www.macrumors.com/2021/09/01/multiple-new-apple-watch-health-features/\">is developing</a> several new health features for future Apple Watch models. These include blood-pressure monitoring, a thermometer for fertility and sleep tracking, sleep apnea detection, and diabetes detection.\r\n<br />\r\n\r\n<br />\r\nNone of these features are expected to arrive in Apple Watch models before 2022.\r\n<br />\r\n\r\n<br />\r\n<h3>Blood Glucose Monitoring</h3>\r\n<br />\r\nApple is rumored to have a team of biomedical engineers working on a method for <a href=\"https://web.archive.org/web/20170829063414/https://www.macrumors.com/2017/04/12/apple-secret-team-diabetes-research/\">non-invasively monitoring blood glucose</a> levels using optical sensors, technology that could potentially make its way into the Apple Watch at some point in the future. Such a feature would make diabetes management much easier because it would not require puncturing the skin.\r\n<br />\r\n\r\n<br />\r\nThere have been rumors that Apple <a href=\"https://www.macrumors.com/2021/01/25/apple-watch-series-7-blood-glucose-monitoring/\">will add</a> blood glucose monitoring capabilities to the Apple Watch Series 7 using a non-invasive optical sensor, but <em><a href=\"https://www.macrumors.com/2021/06/14/apple-watch-7-thinner-display-borders/\">Bloomberg</a></em> says that a blood sugar sensor will not be ready for commercial launch for several more years.\r\n<br />\r\n\r\n<br />\r\nBlood glucose monitoring has been a feature that Apple <a href=\"https://www.macrumors.com/2017/04/12/apple-secret-team-diabetes-research/\">has been working on</a> for years, based on rumors, but it is a serious health feature that would likely require regulation.\r\n<br />\r\n\r\n<br />\r\n<h3>Blood Pressure measurements</h3>\r\n<br />\r\nApple supplier Rockley Photonics is working on <a href=\"https://www.macrumors.com/2021/07/14/apple-supplier-unveils-health-tracking-tech/\">an advanced digital sensor system</a> that allows wearable devices to monitor biomarkers like core body temperature, blood pressure, body hydration, alcohol, lactate, glucose trends, and more, using optical sensors.\r\n<br />\r\n\r\n<br />\r\nThis technology could eventually make its way to the Apple Watch given <a href=\"https://www.macrumors.com/2021/05/03/apple-watch-blood-pressure-glucose-alcohol/\">the partnership</a> between Apple and Rockley, and rumors suggest we will see blood pressure monitoring capabilities introduced at some point.\r\n<br />\r\n\r\n<br />\r\nA wrist-worn blood pressure monitor could be used to detect when blood pressure is rising and the function would be able to detect hypertension. Apple was aiming to release this feature in 2022, but it could be pushed as the technology still needs to be perfected. \r\n<br />\r\n\r\n<br />\r\nBlood pressure monitoring would work by measuring the speed of the wave of a heartbeat through a user's arteries using sensors. It would tell a user how their blood pressure is trending, but it won't be able to provide baseline systolic and diastolic blood pressure measurements. \r\n<br />\r\n\r\n<br />\r\n<h3>Temperature Sensor</h3>\r\n<br />\r\nApple was considering adding a body temperature sensor in the 2021 Apple Watch, but <em>Bloomberg</em> says it is instead likely to be introduced in the 2022 update.\r\n<br />\r\n\r\n<br />\r\nA temperature measuring function would be useful for fertility tracking and keeping track of sleep, and in the future, it could also detect when a user has a fever.\r\n<br />\r\n\r\n<br />\r\n<h3>Sleep Apnea Detection</h3>\r\n<br />\r\nApple is aiming to use the existing blood oxygen sensor to detect sleep apnea, but there <a href=\"https://www.macrumors.com/2021/09/01/multiple-new-apple-watch-health-features/\">are issues</a> with taking frequent readings without significantly impacting battery life.\r\n<br />\r\n\r\n<br />\r\n<h3>Rugged Apple Watch</h3>\r\n<br />\r\nAccording to <em>Bloomberg</em>, Apple is <a href=\"https://www.macrumors.com/2021/03/26/apple-launch-apple-watch-extreme-sports-2021/\">working on</a> a version of the Apple Watch \"with a rugged casing\" that's aimed at athletes, hikers, and others who use the watch in more extreme conditions than day to day wear. It will feature the same functionality as a standard Apple Watch, but with improved impact resistance and protection. Apple is expected to launch the rugged Apple Watch in 2022. \r\n<br />\r\n\r\n<br />\r\n<h3>Haptic Buttons</h3>\r\n<br />\r\nRumors indicate a future version of the Apple Watch <a href=\"https://www.macrumors.com/2018/06/08/apple-watch-solid-state-haptic-buttons/\">will adopt solid state buttons</a> that don't physically click but instead provide haptic feedback to users when the buttons are touched, but it's not clear when this is coming. Apple introduced haptic feedback for the Digital Crown in the Series 4, and haptic feedback could potentially extend to the side button in a later Apple Watch model.\r\n<br />\r\n\r\n<br />\r\nFurther in the future, the Apple Watch may do away with buttons altogether, with the sides of the device adopting support for touch and swipe-based gestures.\r\n<br />\r\n\r\n<br />\r\n<h3>MicroLED Displays</h3>\r\n<br />\r\nApple reportedly has a <a href=\"https://www.macrumors.com/2018/03/18/apple-microled-displays/\">secret manufacturing facility</a> in Santa Clara, California where it is designing and producing test samples of displays that use microLED, a technology that will follow OLED. microLED screens can result in devices that are slimmer, brighter, and use less power. Rumors suggest an Apple Watch with a microLED display could launch in <a href=\"https://www.macrumors.com/2020/08/10/apple-watch-to-adopt-microled-3-4-years/\">three or four years</a>.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Watch Patents</h2>\r\n<br />\r\nApple has patented <a href=\"https://www.macrumors.com/2019/09/03/apple-watch-smart-bands-patents/\">several interesting technologies</a> that could potentially be used in future Apple Watch devices, such as a biometric authentication feature that authenticates identity based on the wearer's skin pattern. Such a feature would eliminate the need for a passcode when wearing the Apple Watch.\r\n<br />\r\n\r\n<br />\r\n<img src=\"http://images.macrumors.com/article-new/2019/09/apple-watch-biometric-sensor.jpg\" />\r\n<br />\r\n\r\n<br />\r\nAnother patent describes a self-tightening Apple Watch band that would adjust during intensive activities like running or working out for accurate heart rate readings, and loosen up afterward. The tightening could also be used for directions, workout reps, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"http://images.macrumors.com/article-new/2019/09/apple-watch-band-indicators.jpg\" />\r\n<br />\r\n\r\n<br />\r\nA third patent describes an Apple Watch band with an LED indicator that would visualize the progress of an activity or task, providing a visual indicator when completing a workout or an Activity ring, for example.\r\n<br />\r\n\r\n<br />\r\nApple in December 2019 published a patent describing how the Apple Watch could help doctors monitor the symptoms of <a href=\"https://www.macrumors.com/2019/12/05/patent-apple-watch-improving-parkinsons-symptoms/\">Parkinson's patients</a> using sensors to keep track of tremors. Apple believes this method of data tracking will allow users to better track their symptoms so they can plan activities around symptom patterns.\r\n<br />\r\n\r\n<br />\r\nA 2020 <a href=\"https://www.macrumors.com/2020/12/15/future-apple-watch-could-gain-touch-id-and-camera/\">pair of patents</a> suggest Apple is researching <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a> and an under-display camera for the Apple Watch. Apple describes a side button with an integrated ‌Touch ID‌ fingerprint sensor that could be used for user identification and device unlocking. Currently, the Apple Watch unlocks with a passcode and also when the paired <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> is unlocked.\r\n<br />\r\n\r\n<br />\r\nAs for an under-display camera, the patent describes a two-stage display technology that includes a camera that are externally visible only when engaged.\r\n<br />\r\n\r\n<br />\r\nIn 2021, Apple outlined a radical <a href=\"https://www.macrumors.com/2021/03/23/apple-redesigned-wrap-around-apple-watch/\">redesign of the Apple Watch</a> in a patent filing, featuring a rounded watch face, wrap-around flexible display, and digitally-customizable watch bands.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-watch-wrap-around-display-patent-design.jpg\" />\r\n<br />\r\n\r\n<br />\r\nApple has <a href=\"https://www.macrumors.com/2017/01/24/modular-band-links-apple-watch/\">filed several other patents</a> covering the possibility of moving hardware into the Apple Watch's band, including batteries, speakers, kinetic power generators, haptic feedback devices, and <a href=\"https://www.macrumors.com/2019/06/25/apple-watch-positionable-camera-band-patent/\">even cameras</a>.\r\n<br />\r\n\r\n<br />\r\nThere's no word on whether these patented features will make it into an actual Apple Watch in the future, but it's interesting to see what Apple is working on and considering behind the scenes.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Don't Buy)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/apple-watch-series-7/\">Apple Watch Series 7: Rumors, Features, Possible Release Date and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-watch-series-7-rumors-features-possible-release-date-and-more.2309717/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ytredF02r3U:Dwl_h3ghD4E:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ytredF02r3U:Dwl_h3ghD4E:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ytredF02r3U\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"45ae10a32378d704c05354785b183e4835399ec4a39504e446c6980ea024b384","category":"Apple"}