{"title":"The potent effect of selenium nanoparticles: insight into the antifungal activity and preservation of postharvest strawberries from gray mold diseases","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13502?af=R","date":1714640631000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Most microorganisms that cause food decay and the lower the shelf life of foods are fungi. Nanotechnologies can combat various diseases and deal with the application of nanomaterial to target cells or tissues. In this study selenium nanoparticles (Se-NPs) were synthesized using ascorbic acid and characterized by ultraviolet–visible spectroscopy, transmission electron microscopy (TEM), X-ray diffraction and zeta potential. The different concentrations of As/Se-NPs were tested against various fungi, including <i>Alternaria linicola</i>, <i>Alternaria padwickii</i>, <i>Botrytis cinerea</i>, <i>Bipolaris</i> sp., <i>Cephalosporium acremonium</i>, <i>Fusarium moniliform</i> and <i>Fusarium semitectum.</i> This study tested the influence of coated As/Se-NPs on healthy strawberry fruits and those infected with <i>Botrytis cinerea</i> during 16 days of storage, with regard to shelf life, decay percentage, weight loss, total titratable acidity percentage, total soluble solids content (TSS) and anthocyanin content.</p>\n<h2>RESULTS</h2>\n<p>Energy-dispersive X-ray analysis showed only two elements: selenium and oxygen. TEM images showed that the nanoparticles ranged in size between 26 to 39 nm and were rhombohedral in shape. Se-NPs showed antifungal activity against all tested fungi, the most effective being against <i>Botrytis cinerea</i>, <i>Cephalosporium acremonium</i> and <i>Fusarium semitectum</i>. During storage periods of strawberries fruits coated with As/Se-NPs, the shelf life was increased, and the number of decaying fruits was less than in control (uncoated) and coated infected fruits. The decline in weight loss was lower in coated fruits than in control fruits.</p>\n<h2>CONCLUSION</h2>\n<p>These findings demonstrated that As/Se-NPs could effectively maintain the postharvest quality of strawberries, even when the fruit was infected with <i>B. cinerea</i>. © 2024 Society of Chemical Industry.</p>","author":"Ragaa A Hamouda, \nMarwa S Abdel‐Hamid, \nNashwa Hagagy, \nAshraf M Nofal","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"45af81f9db3602a89bea3d996e105f6bacc8f96c1d68059a6b7c1c8043ecf929","category":"Environment"}