{"title":"กลุ่มนักลงทุน VC กว้านซื้อที่ดินแถบซานฟรานซิสโก เตรียมสร้างเมืองใหม่สำหรับคนทำงานเทค","link":"https://www.blognone.com/node/135469","date":1693196895000,"content":"<div><div><div><p>ตั้งแต่ปี 2018 เป็นต้นมา มีบริษัทลึกลับชื่อ Flannery Associates ไล่กว้านซื้อที่ดินในย่านใกล้เคียงกับสนามบิน Travis Air Force Base ในเขต Solano County ทางตะวันตกเฉียงเหนือจากเมืองซานฟรานซิสโก (บริเวณสีแดงในภาพ)</p>\n<p>นับถึงปัจจุบัน Flannery ซื้อที่ดินไปแล้วกว่า 52,000 เอเคอร์ หรือประมาณ 210 ตารางกิโลเมตร (เทียบขนาดแล้ว ใหญ่กว่าเขตเมืองซานฟรานซิสโก 2 เท่า) โดยไม่มีคำอธิบายใดๆ ว่าเป็นใคร และซื้อที่ดินเยอะขนาดนี้ไปทำไม (ตามระบบกฎหมายสหรัฐอเมริกา ค่อนข้างคุ้มครองข้อมูลของบริษัทเอกชน ไม่เปิดเผยต่อสาธารณะ) จนเกิดความสงสัยและคาดเดาไปหลายทาง</p>\n<p>ล่าสุดเริ่มมีรายงานการสอบสวนจากสื่อต่างๆ ออกมาว่าเบื้องหลังของ Flannery เป็นกลุ่มนักลงทุน VC ของอุตสาหกรรมเทคโนโลยี นำโดย Michael Moritz อดีตพาร์ทเนอร์ของบริษัทลงทุนชื่อดัง Sequoia Capital ที่ลงทุนในบริษัทเทคโนโลยีดังๆ มาแล้วมากมาย นอกจากนี้ยังมี Reid Hoffman ผู้ร่วมก่อตั้ง LinkedIn, Marc Andreessen ผู้ร่วมก่อตั้ง Netscapr และบริษัทลงทุน Andreessen Horowitz รวมถึง Laurene Powell Jobs ภรรยาหม้ายของสตีฟ จ็อบส์ด้วย (รายชื่อเหล่านี้ยังเป็นการสอบสวนของ The New York Times และยังไม่ยืนยัน 100%)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5ea680d8909e8eee132a8cfcb0b20977.png\" /></p>\n<p>นอกจากนี้ยังมีเอกสารนำเสนอของ Moritz ตั้งแต่ปี 2017 ว่าแผนการของเขาคือ \"สร้างเมืองใหม่\" ในย่าน Bay Area ที่เริ่มต้นใหม่จากศูนย์ สร้างบ้านด้วยเทคโนโลยีใหม่ยุคปัจจุบัน มีฟาร์มโซลาร์ให้พลังงาน มีต้นไม้และสวนจำนวนมาก ออกแบบเมืองให้เดินได้โดยไม่ต้องใช้รถยนต์</p>\n<p>วิสัยทัศน์ของ Moritz คือถ้ามีโอกาสวางแผนสร้างเมืองใหม่ตั้งแต่แรก สามารถวางผังเมืองที่น่าอยู่กว่าซานฟรานซิสโกได้ และการที่เมืองนี้อยู่ห่างจากซานฟรานซิสโกและย่านซิลิคอนวอลเลย์ไม่ไกล (ใช้เวลาเดินทางด้วยรถยนต์ราว 1 ชั่วโมง) ก็มีโอกาสสูงที่คนจะย้ายมาอยู่อาศัย มาทำงานที่นี่กันแทนเป็นจำนวนหลายหมื่นคน ช่วยแก้ปัญหาเรื่องบ้านแพงในย่าน Bay Area ได้</p>\n<p>ตอนนี้ทาง Flannery Associates ยังไม่ได้ออกมาให้ข้อมูลอื่นใด ยกเว้นยอมรับว่านายทุนเบื้องหลังเป็นกลุ่มนักลงทุน VC จำนวนหนึ่งเท่านั้น</p>\n<p>ที่มา - <a href=\"https://www.sfgate.com/bayarea/article/mystery-bay-area-land-buyers-outed-18331473.php\">SF Gate</a>, <a href=\"https://www.marinij.com/2023/08/25/the-silicon-valley-elite-who-want-to-build-a-city-from-scratch/\">Marin Independent Journal</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/san-francisco\">San Francisco</a></div><div><a href=\"/topics/california\">California</a></div><div><a href=\"/topics/silicon-valley\">Silicon Valley</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"45b46c92e8f1a3763c4947ea0daa10600597ce7787ec1fa1801a3f5f46894386","category":"Thai"}