{"title":"Humans drive spatial variation in mortality risk for a threatened wolf population in a Canis hybrid zone","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14589?af=R","date":1712118390000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/8003c108-2a21-474f-8af8-7d87b71d556f/jpe14589-toc-0001-m.png\" alt=\"Humans drive spatial variation in mortality risk for a threatened wolf population in a Canis hybrid zone\" />\n<p>Despite being listed as ‘threatened’ under the Ontario Endangered Species Act, eastern wolves are still legally trapped and shot outside protected areas in central Ontario. Eastern wolves and dispersing canids survive poorly outside of APP, primarily from human-caused mortality. These results, along with the apparent inadequacy of the smaller protected areas, suggest that expanding the threatened eastern wolf population outside APP is unlikely under current management conditions. Protecting eastern wolves from human-caused mortality is complicated as it would require a harvest ban for all canids, including coyotes.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLarge carnivores often exhibit high survival rates in protected areas, whereas intentional and unintentional human-caused mortality may be greater in adjacent areas. These patterns can result in source-sink dynamics and limit population expansion beyond protected areas.\n\nWe used telemetry data from 438 canids in 141 packs collected from 2002 to 2020 to evaluate mortality risk for wolves, coyotes, and admixed canids in a 3-species hybrid zone in and adjacent to a large protected area in Ontario, Canada. The hybrid zone is occupied by most of the remaining eastern wolves (<i>Canis lycaon</i>), a rare, threatened species that hybridizes with sympatric eastern coyotes (<i>C. latrans</i>) and Great Lakes grey wolves (<i>C. lupus</i>).\n\nWithin Algonquin Provincial Park (APP), annual human-caused mortality from harvest and vehicles was low (0.06, 95% CI [0.03, 0.08]), whereas annual human-caused mortality was higher in adjacent areas (0.31, 95% CI [0.25, 0.37]). Smaller protected areas implemented to help protect eastern wolves did not significantly reduce mortality. Eastern wolves survived poorly relative to other canids and dispersing canids survived poorly relative to residents. Mortality risk was greater when canids were closer to roads. Mortality risk was also increased or reduced by the strength of individual-level selection or avoidance of roads relative to their availability, respectively.\n\nOur results provide a comprehensive evaluation of factors influencing spatial variation in mortality risk for canids to inform eastern wolf recovery efforts. Additionally, we developed a novel modelling approach for investigating the influence of resource selection on mortality risk, which highlighted that individual-level responses to risk can strongly influence population-level mortality patterns.\n\n<i>Synthesis and applications</i>. Despite being listed as ‘threatened’ under the Ontario Endangered Species Act, eastern wolves are still legally trapped and shot outside protected areas in central Ontario. Eastern wolves and dispersing canids survive poorly outside of APP, primarily from human-caused mortality. These results, along with the apparent inadequacy of the smaller protected areas, suggest that expanding the threatened eastern wolf population outside APP is unlikely under current management conditions. Protecting eastern wolves from human-caused mortality is complicated as it would require a harvest ban for all canids, including coyotes.\n</p>","author":"John F. Benson, \nPeter J. Mahoney, \nTyler J. Wheeldon, \nConnor A. Thompson, \nMariah E. Ward, \nAshley A. D. McLaren, \nGlenn E. Desy, \nJohn M. Fryxell, \nBrent R. Patterson","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"45b8b3155dd6fec0a4739f5849565aa3668a4de7a03aaaa4d35de289acc4f62d","category":"Environment"}