{"title":"Simulation of Necessary Macro TFP growth and Its Feasible Dual Circulation Source Pathways to Achieve China&rsquo;s 2035 Economic Vision Goal: A Dynamic CGE Study","link":"https://www.preprints.org/manuscript/202408.0456/v1","date":1723111065000,"content":"By introducing final goods trade, intermediate goods trade, and factor-strengthening technology spillovers, along with technology absorption thresholds into the global value chain, this paper builds a global dynamic recursive general equilibrium model. This model can simulate China's technological progress driven by both 'internal' and 'external' (trade and FDI) dual circulations. Eight scenarios are employed to test and demonstrate whether China can follow the dual-circulation pattern and achieve the 2035 economic vision. The main conclusions are as follows:: (1) If China maintains its trade opening policy, the 2035 vision goal can be achieved, with external circulation being more important than internal for technological spillovers; (2) The economic growth impacts of external and internal circulations operate relatively independently. However, Foreign Direct Investment (FDI) provides a relatively larger synergistic effect to all forms of external trade circulation; (3) Regarding international trade partners, we find that RCEP is the most important strategic partner to China; (4) Apparently, FDI is not an effective way to lift the productive services sector's TFP, and China's realistic choice is to open the productive services market wider, as its efficiency is a pivotal reflection of China's independent innovation capability; (5) For factor-strengthening effects, spillovers are more favorable to 'capital' than to other kinds of labor; (6) The impact of China-US decoupling is enormous to the world. In all the scenarios we have envisioned, the United States is always the country that loses the most, and Europe would be the group of countries to benefit when there is a large increase of TFP in the US.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"45b9a6628ddbaa30b49f1b4ab6b1817a0b9a16681a0844846be609b0d20c9edc","category":"Interdisciplinary"}