{"title":"The influence of pre‐exposure to marine heatwaves on the critical thermal maxima (CTmax) of marine foundation species","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14622?af=R","date":1723009822000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/2f999dd1-8ac3-480b-8474-4167a58b633b/fec14622-toc-0001-m.png\" alt=\"The influence of pre-exposure to marine heatwaves on the critical thermal maxima (CTmax) of marine foundation species\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/12/marine-heatwaves-can-lower-thermal-tolerance-of-habitat-forming-species/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nMarine foundation species underpin some of the world's most diverse ecosystems but they are increasingly threatened by intensification of marine heatwaves (MHWs). Where MHWs exceed critical thermal maxima (CT<sub>max</sub>), increased mortality and population declines can occur. CT<sub>max</sub> is increasingly used to assess MHW population vulnerability but studies estimating CT<sub>max</sub> across species, range edges and thermal histories in a comparable manner remain lacking.\n\nWe determined the impact of MHWs on subsequent CT<sub>max</sub> estimates of matched cool/warm affinity pairs of marine foundation species (kelp, seagrass and bivalves) in the Western English Channel. Following a 4-week MHW simulation, individuals were subjected to a CT<sub>max</sub> trial, where temperatures were raised by 2°C day<sup>−1</sup> until physiological end points were reached.\n\nWe found no positive effect of MHWs on CT<sub>max</sub> but clear negative impacts were observed for some groups of foundation species. Increased MHW intensity had a stepwise negative impact on the physiology of both warm (<i>Laminaria ochroleuca</i>) and cool water (<i>L. digitata</i>) kelp species that manifested in significant reductions in CT<sub>max</sub>. Surprisingly, this was most marked in the warm water species, which runs opposite to the assumed safety of leading-edge populations. The physiology of warm (<i>Zostera noltii</i>) and cool (<i>Z. marina</i>) seagrasses was negatively impacted by increasing MHW intensity but no significant decrease in CT<sub>max</sub> was observed. Both bivalve species (<i>Mytilus edulis</i> and <i>Magallana gigas</i>) showed marked resistance to exposure to MHWs, which was unexpected given the observed vulnerability of these species to stressful summertime conditions.\n\nOur results show pre-exposure to realistic MHWs can influence CT<sub>max</sub> values but generalities are difficult to make across groups or based on assumed thermal safety margins. We show CT<sub>max</sub> is a labile trait and exposure to MHWs, can erode the resilience of an individual or population to subsequent thermal challenges. This leaves uncertainty within frameworks built to understand where and when MHWs will be most impactful.\n\nFurther experimentation across a wider range of species and thermal challenges is needed to better understand the dynamic nature of CT<sub>max</sub> and field validation is needed to determine the responses of individuals and populations within complex natural systems.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/12/marine-heatwaves-can-lower-thermal-tolerance-of-habitat-forming-species/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Nathan G. King, \nTayla Leathers, \nKathryn E. Smith, \nDan A. Smale","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"45bb489f220adcd5dc3a96ee874b84c60de1b945c9b6fe77a922b1839638dc4e","category":"Environment"}