{"title":"Ingenious modders are keeping old Macs alive long after Apple has given up","link":"https://www.macworld.com/article/1813085/old-macs-youtube-modders-ram-chips-cpu-ssd.html","date":1684754100000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Thanks to Apple’s move to its own chips, the Mac has been on a roll recently, after a frustrating spell of bad keyboards, poor ports, and overheating with pre-M1 Macs. But not all of those old Macs are bad–many of them are actually still cherished by their owners. For example, the Intel-equipped 13-inch MacBook Pro and MacBook Air were tremendously popular and held down the fort on the affordable end of the MacBook lineup for many years.</p>\n\n\n\n<p>These laptops may not be considered “modern” by the new standards set by Apple, but they are still supported with the latest version of macOS. They were somewhat upgradeable, easy to fix, and had tons of spare parts available. Within the secondhand community, even Macs with soldered-down components are looked at as having value, and ingenious tinkerers are repairing, upgrading, and adding software support to old machines long after Apple moved on to something new.</p>\n\n\n\n<p>YouTuber Collin Mistr, known as dosdude1, demonstrates his skilled approach to upgrading and modifying older Macs on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/@dosdude1&amp;xcust=1-1-1813085-1-0-0&amp;sref=https://www.macworld.com/feed\">his channel</a>. The videos are far from polished but show off how modifications and soldered-on upgrades can give old Macs new life. “The first machine I ever got was some water-damaged MacBook off of eBay for really cheap. One day I just decided to learn how to fix those. Then I got good with surface mount soldering and over time, got different equipment for [ball grid array chips],” Mistr said. Whether it’s upgrading soldered RAM or CPU beyond factory specifications, Mistr does it all with a combination of tweaked custom firmware and chip swaps.</p>\n\n\n\n<p>“[The 2015 MacBook Airs] are actually pretty straightforward because Apple actually, when they were developing it, intended those to work with 16 gigs of RAM… you don’t have to modify the system ROM.” Mistr says his wildest upgrade was to a 2015 11-inch Air, the last year for that body style. “I took the CPU and RAM from a 2015 MacBook Pro with the top spec and soldered them on and made a 3.1 GHz Air.”</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/mbp-13-nevbolt.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"IBoff NevBolt\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/mbp-13-nevbolt.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/05/mbp-13-nevbolt.jpg?resize=300%2C215&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/mbp-13-nevbolt.jpg?resize=768%2C550&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/05/mbp-13-nevbolt.jpg?resize=1200%2C859&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/05/mbp-13-nevbolt.jpg?resize=1536%2C1099&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/05/mbp-13-nevbolt.jpg?resize=2048%2C1466&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"859\" /><figcaption>iBoff’s NevBolt  modifies older MacBook Pros so that it can equipped with a<br />high-speed M.2 slot and a SATA 2.5-inch drive.</figcaption></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://iboffrcc.com/&amp;xcust=1-1-1813085-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">iBoff</a></div>\n\n\n\n<p>Mistr cited pioneering work from a small firm in Malaysia that sent him parts to test. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.iboffrcc.com&amp;xcust=1-1-1813085-1-0-0&amp;sref=https://www.macworld.com/feed\">iBoff</a>, run by a man who goes by the name Bo, keeps Macs running longer due to user demand. Bo’s craziest modification replaces the Thunderbolt chip on 2011 and 2012 MacBook Pros. Newer storage technologies like NVMe SSDs can increase performance meaningfully, but not all Macs from the past can natively support these devices because of the Thunderbolt chip.</p>\n\n\n\n<p>“Customers started asking if we can add NVMe SSDs to the MacBook Pro…after much studying, prototype trial &amp; error, testing stability, we successfully released the NevBolt.” <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://iboffrcc.com/pages/nevbolt-2-installation-guide&amp;xcust=1-1-1813085-1-0-0&amp;sref=https://www.macworld.com/feed\">NevBolt</a> runs a cable from where the Thunderbolt controller would otherwise sit and adds a high-speed M.2 slot and a SATA 2.5-inch drive in the optical drive bay–even offering an option to connect an external GPU (something that Thunderbolt 1 Macs didn’t quite support).</p>\n\n\n\n<p>Other iBoff products add M.2 drives to devices that had only soldered-on storage. “The whole story changed when Apple started to solder SSDs to the [logic board] for MacBooks 2016 and above,” said Bo. “The soldered SSD [has a finite life], so we found a way to replace the dead soldered SSD, pushing us to do more homework regarding this issue, and we are able to install NVMe SSDs [in these models].”</p>\n\n\n\n<h2>Older Macs, newer software</h2>\n\n\n\n<p>As old Macs are dropped from Apple’s supported list, the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://dortania.github.io/OpenCore-Legacy-Patcher/&amp;xcust=1-1-1813085-1-0-0&amp;sref=https://www.macworld.com/feed\">Open Core Legacy Patcher</a> project swoops in, using tricks learned when running macOS on non-Apple hardware and gives its utilities away for free. “The goal is to extend the life of Macs Apple no longer wants to support. For me it’s really important for people of lower income, people from other countries…in Brazil [Macs] are four times the price [of elsewhere],” says <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://github.com/khronokernel&amp;xcust=1-1-1813085-1-0-0&amp;sref=https://www.macworld.com/feed\">Mykola Grymalyuk</a>, the project leader. “With the current scope of the project, we’re only targeting 2008 or newer Macs…we want to support every Mac that has been dropped since then. We support 88 models, if I recall correctly.” </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/open-core-project-icon.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Open Core Legacy Project\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/open-core-project-icon.jpg?quality=50&amp;strip=all 1564w, https://b2c-contenthub.com/wp-content/uploads/2023/05/open-core-project-icon.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/open-core-project-icon.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/05/open-core-project-icon.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/05/open-core-project-icon.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/05/open-core-project-icon.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/05/open-core-project-icon.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>The Open Core Legacy Project does work that allows obsolete Macs to run current versions of macOS.</p></figcaption></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://dortania.github.io/OpenCore-Legacy-Patcher/&amp;xcust=1-1-1813085-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Dortania</a></div>\n\n\n\n<p>Open Core Legacy Patcher lets unsupported machines run newer versions of macOS but sometimes with reduced functionality and it makes routine updates potentially tricky for novices. “You couldn’t give [an OCLP-enabled device] to a 6th grader and say, ‘Here’s your laptop for school.’ Just because there is something, like when you do an OS update, Apple nukes all our patches, so you have to repair the operating system. We do have mechanisms in place that try to notify you…but that can only go so far for end users.”</p>\n\n\n\n<h2>Future hurdles may be too high</h2>\n\n\n\n<p>A hard reality may be coming up for these savvy hardware and software hackers. With the advent of tighter security, things like Apple’s T1 and T2 chips, along with device management software, can turn older Macs into trash, with little hope of resuscitation or repair. “I know Apple claims [Activation Lock] is mostly for anti-theft, which it does prevent, but they try to hide from you that most locked devices you find out there, on eBay or in surplus sales, are locked not because they were stolen, but because the organization that had the devices didn’t know the lock exists in the first place,” opines Colin Mistr. “[Apple] doesn’t care…they’d rather the device be destroyed than reused.” </p>\n\n\n\n<p>People like Bo, Mistr, and Mycola, have their work cut out for them. Older Macs still browse the internet just fine, can run newer operating systems with a little bit of work, and can even get hardware boosts well beyond what they were designed for. With a lot of Intel Macs hitting retirement age, there’s never been a better time to pick one up and spiff it up for casual use. “It saves people money, it means there’s less e-waste, and more people have an opportunity to get into the Mac for a lot less money,” says Mykola. “Especially if you see a Mac on the side of the road…just pick it up, adopt it, and give it some love.”</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"45c0319668c8547d0242f2a8c04bb4e8fad9febce77bc3efd4e4950b7682bde0","category":"Apple"}