{"title":"FCC plans to rein in “gateway” carriers that bring foreign robocalls to US","link":"https://arstechnica.com/?p=1800615","date":1633375139000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/06/getty-robot-phone-800x640.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/06/getty-robot-phone.jpg\">Enlarge</a> (credit: Getty Images | Juj Winn)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Federal Communications Commission hopes to reduce the number of illegal robocalls from overseas with an expansion of rules that require phone companies to implement Caller ID authentication technology and block illegal calls. \"Eliminating illegal robocalls that originate abroad is one of the most vexing challenges the commission faces because of the difficulty in reaching foreign-based robocallers and the foreign voice service providers that originate their traffic,\" the FCC <a href=\"https://docs.fcc.gov/public/attachments/DOC-376196A1.pdf\">said</a>.</p>\n<p>To make a dent in that problem, the FCC is proposing new requirements on domestic gateway providers that accept calls from outside the US. A <a href=\"https://docs.fcc.gov/public/attachments/FCC-21-105A1.pdf\">Notice of Proposed Rulemaking</a> (NPRM) <a href=\"https://www.fcc.gov/document/fcc-proposes-rules-stop-illegal-robocalls-entering-us\">adopted</a> Thursday and released on Friday proposes requiring those gateway phone companies to implement STIR (Secure Telephone Identity Revisited) and SHAKEN (Signature-based Handling of Asserted Information Using toKENs) protocols, which verify the accuracy of Caller ID by using digital certificates based on public-key cryptography.</p>\n<p>\"This proposal would subject foreign-originated calls, once they enter the United States, to requirements similar to those of domestic-originated calls, by placing additional obligations on gateway providers in light of the large number of illegal robocalls that originate abroad and the risk such calls present to Americans,\" the NPRM said. Gateway providers would be required to \"apply STIR/SHAKEN caller ID authentication to, and perform robocall mitigation on, all foreign-originated calls with US numbers,\" the FCC <a href=\"https://docs.fcc.gov/public/attachments/DOC-376196A1.pdf\">said</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1800615#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1800615&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"45c29e5ef219e4aecfa712b757d17529adf87b9fbe7de43ec5aad38b6ec42267","category":"Tech"}