{"title":"Calendar updates, Van der Poel talks Milan-San Remo rivals: Daily News","link":"https://cyclingtips.com/2021/03/calendar-updates-van-der-poel-talks-milan-san-remo-rivals-daily-news/","date":1616105238000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>Thursday&#8217;s brought a calendar update from the UCI with new dates for quite a few postponed races, as well as some thoughts from Mathieu van der Poel ahead of Milan-San Remo.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>UCI publishes updated 2021 road calendar</h3>\n\n\n\n<p>The <strong>UCI</strong> has published an <strong>updated calendar</strong> for the 2021 season with new dates for numerous postponed events, including a handful of WorldTour races.</p>\n\n\n\n<p>On the men&#8217;s side, <strong>Eschborn-Frankfurt</strong> is among the events with new dates. The WorldTour one-day in Germany has been postponed from May 1 to September 19, which will coincide with the first day of the UCI Road World Championships. On the women&#8217;s side, the <strong>Women&#8217;s Tour</strong> will now be held from October 4 to 9, the <strong>Tour of Chongming</strong> Island will run from October 14 to 16, and the <strong>Ronde van Drenthe</strong> will be held on October 23, while the new <strong>Donostia San Sebastian Klasikoa</strong> will run on July 31.</p>\n\n\n\n<p>Other rescheduled events include the <strong>Volta ao Algarve</strong> and the <strong>Ruta del Sol</strong>. The UCI also said that it has extended the road season to October 31 in case there are further postponements this season.</p>\n\n\n\n<h3>Van der Poel talks San Remo rivals</h3>\n\n\n\n<p><strong>Mathieu van der Poel</strong> has offered some thoughts on his main rivals for <strong>Milan-San Remo</strong>, which takes place in Italy on Saturday. The 26-year-old Dutchman is among the bookmakers&#8217; top favorites for the race alongside defending champion <strong>Wout van Aert</strong> and 2019 winner <strong>Julian Alaphilippe</strong>, and he confirmed that he sees them as top contenders.</p>\n\n\n\n<p>&#8220;Those two are the big names. I also see Michael Matthews, and he has a fast sprint. I think he will be a guy to watch,” Van der Poel said. “I think Wout has a little bit of an advantage because he has already won the race. For him, it’s a bit easier, for sure, it will be a new race. Normally, San Remo is an honest race, and normally the strongest wins there as well.”</p>\n\n\n\n<p>Van der Poel also touched on the topic of attacking on the Cipressa, which tops out around 23 km from the finish.</p>\n\n\n\n<p>&#8220;It would be extremely nice to get over Cipressa with a small group and go to the Poggio for sure,&#8221; he said. &#8220;But I don&#8217;t know if you attack there, you&#8217;ll get many guys with you, and the part between them is fast so you&#8217;re at a disadvantage against a bunch.&#8221;</p>\n\n\n\n<h3>Majerus joins UCI Safety Commission</h3>\n\n\n\n<p>The <strong>CPA Women</strong> announced on Thursday that <strong>Christine Majerus</strong> has joined the UCI Safety Commission as a rider representative alongside <strong>Matteo Trentin</strong> and <strong>Philippe Gilbert</strong>.</p>\n\n\n\n<p>The commission includes representatives of various stakeholders involved in professional cycling but prior to the addition of Majerus, it did not include any rider representatives from the women&#8217;s peloton.</p>\n\n\n\n<h3>Tribunal deems Freeman&#8217;s fitness to practice &#8216;impaired&#8217;</h3>\n\n\n\n<p>As <a href=\"https://www.theguardian.com/sport/2021/mar/18/richard-freemans-fitness-to-practise-medicine-is-impaired-tribunal-rules\" target=\"_blank\" rel=\"noreferrer noopener\">The Guardian</a> reports, the Medical Practitioners Tribunal has deemed <strong>Richard Freeman&#8217;s</strong> fitness to practice medicine &#8220;impaired.&#8221; The tribunal will now consider possible sanctions for the former Sky and British Cycling doctor.</p>\n\n\n\n<p>Freeman was found guilty last week of having ordered testosterone to British Cycling headquarters &#8220;knowing or believing&#8221; it was for a rider.</p>\n\n\n\n<p>&#8220;The tribunal bore in mind that Dr Freeman’s misconduct involved a number of significant elements, including serious dishonesty, as well as behavior which could have placed patients at unwarranted risk of harm,&#8221; read a statement from the tribunal on Thursday. &#8220;It concluded that public confidence in the profession would be undermined if a finding of impairment were not made. The tribunal has therefore determined that Dr Freeman’s fitness to practice is impaired by reason of his misconduct.”</p>\n\n\n\n<h3>Former NBA player Shawn Bradley paralyzed after being hit by driver</h3>\n\n\n\n<p>According to a statement from the Dallas Mavericks, former NBA player <strong>Shawn Bradley</strong> was left paralyzed after being hit by a motorist while riding his bike in January.</p>\n\n\n\n<p>Bradley, 48, was hit from behind while riding his bike in St. George, Utah, a block away from home. Following the collision, he underwent neck surgery and has spent eight weeks in the hospital.</p>\n\n\n\n<p>&#8220;With his wife Carrie at his side around the clock, and supported by an amazing team of rehabilitation specialists and family, Bradley is in good spirits,&#8221; read the statement from the Dallas Mavericks. &#8220;He plans to use his accident as a platform to bring greater public awareness to the importance of bicycle safety.&#8221;</p>\n\n\n\n<h2>Coming Up &#8230;</h2>\n\n\n\n<p>While plenty of stars are gearing up for Saturday&#8217;s Milan-San Remo, a handful of big names will be racing on Friday at the Bredene Koksijde Classic. The UCI 1.Pro-rated event will take riders 199 km on Belgian roads. There are a few cobbled sectors and a few climbs midway through the race, but a flat run-in to the line will have the fast finishers eyeing a win. Mads Pedersen and Tim Merlier will be riders to watch, while Deceuninck-Quick-Step will have multiple options, including Florian Sénéchal and Mark Cavendish.</p>\n\n\n\n<h2>In case you missed it &#8230;</h2>\n\n\n\n<ul><li>Matt de Neef has the <a href=\"https://cyclingtips.com/2021/03/preview-your-guide-to-the-2021-milan-san-remo/\">preview</a> of Milan-San Remo with the things you need to know ahead of Saturday&#8217;s race.</li><li>If <a href=\"https://cyclingtips.com/2021/03/the-best-bike-race-bracket-challenge/\" target=\"_blank\" rel=\"noreferrer noopener\">making a bracket</a> to predict how a run-off vote determining the world&#8217;s best bike race might turn out sounds like something you&#8217;d be interested in, you&#8217;re in luck!</li></ul>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/calendar-updates-van-der-poel-talks-milan-san-remo-rivals-daily-news/\">Calendar updates, Van der Poel talks Milan-San Remo rivals: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"45c33c0be6de60b1a2346b7808c77f21c41ffcd5960580ff12575c12f7d61647","category":"Cycling"}