{"title":"Advancing Adherence and Compliance to Personal Protective Equipment Policies among Health Care Workers &ndash; Insights from a Groundbreaking Case Study in Cameroon","link":"https://www.preprints.org/manuscript/202403.1810/v1","date":1711702800000,"content":"Personal protective equipment (P PE) rules must be respected and followed to the letter of healthcare professionals in Cameroon to avoid the transmission of infectious diseases. This research proposes solutions to the problems of non-adherence and non-compliance among healthcare workers in Cameroon towards PPE rules. Inadequate access to suitable PPE, discomfort when wearing PPE during poor quality, and a lack of training on correct PPE use are just a few of these obstacles amongst HCWs in Cameroon. Hospitals and healthcare facilities should prioritize offering thorough instruction on PPE use and pinpoint the need to adhere consistently to PPE rules to remove these obstacles. They should also ensure that all healthcare personnel have access to and a sufficient supply of the proper PPE. Through the organization of impromptu visits by surveillance teams to identify areas of support and training, there is a need for assistance from government bodies and public health groups in creating awareness of the security value of PPE use among healthcare professionals. There is a lack of PPE in health care settings in rural areas in Cameroon, thus a need for an adequate supply. Then can we put appropriate PPE policies and practices for HCWs in Cameroon, as they will keep to it.Healthcare professionals in Cameroon must comprehend that following PPE standards protects not just their selves from diseases but also their patients, coworkers, and communities. We are accountable for ensuring everyone's safety and well-being, and adhering to PPE regulations is an essential first step.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"45c4eb67f93f9c5c1741fc63d6f0e09dd563a503c538455af4a8791e95c465ed","category":"Interdisciplinary"}