{"title":"Avira Prime for Mac review","link":"https://www.macworld.com/article/668098/avira-prime-for-mac-review.html","date":1704380586000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n<div><span>At a Glance</span><h3>Expert's Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Easy to use</li><li>Full VPN</li><li>Won’t slow down your Mac</li></ul></div><div><h3>Cons</h3><ul><li>No fine-tuning scan options</li></ul></div></div></div><h3>Our Verdict</h3><p>Avira Prime adds to the company’s Free Security with extra tools such as a VPN, but core protection is the same whether you’re paying or not.</p>\n</div><h3>Price When Reviewed</h3><p>$99.99</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today: Avira Prime\t\t</h3>\n\t\t\t\t<div>\n\t\t\n\t\t<div>\n\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Avira – Free Security for Mac</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$0</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://prf.hn/click/camref:1100liSb7/pubref:1-1-668098-2-664177-11300/destination:https://www.avira.com/en/free-security%0A\" target=\"_blank\">View Deal</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Avira – Prime (first year)</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$59.99</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://prf.hn/click/camref:1100liSb7/pubref:1-1-668098-2-664177-11300/destination:https://www.avira.com/en/prime%0A\" target=\"_blank\">View Deal</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Product</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\tPrice comparison from Backmarket\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t</div>\n\t\t</div>\n\t\t\n\n\n<p>While it’s handy that various security and utility suites are trying to fold more features into their offerings, some parts sometimes work better than others.</p>\n\n\n\n<p>Avira Prime, the paid version of Avira’s free antiviral software <a href=\"https://www.macworld.com/article/668094/avira-free-security-for-mac-review.html\">Avira Free Security</a> works to provide several tools for the user. </p>\n\n\n\n<h2>Features </h2>\n\n\n\n<p>Like similar applications on the market (you can read about alternatives to Avira Prime in our roundup of the <a href=\"https://www.macworld.com/article/668850/best-mac-antivirus-software.html\">best antivirus software for Mac</a>), Avira Prime is designed around several modules (Virus Scans, Protection Options, Quarantine, VPN, Passwords, Cookie Cleaner, Identity Assistant, Junk Cleaner, Uninstaller, and Startup Apps). Each module can be customized and configured as needed. The software installs cleanly enough and requests permission to fully access the hard drive, which is par for the course. </p>\n\n\n\n<p>Once a virus scan has begun, the Quick Scan can take less than 10 seconds, while a Full Scan took over six hours to look over 800+ gigabytes of files on a one terabyte SSD. The Custom Scan feature allows files and folders to be dropped in for quick scanning as well as external volumes to be scanned through as needed. It’s easy enough to minimize Avira Prime and work with other applications as the scan continues, so it’s not entirely occupying your Mac as it chugs through your files. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/Avira-Full-Scan.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Avira Prime Full Scan\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/Avira-Full-Scan.jpg?quality=50&amp;strip=all 2163w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Avira-Full-Scan.jpg?resize=300%2C212&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Avira-Full-Scan.jpg?resize=768%2C544&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Avira-Full-Scan.jpg?resize=1200%2C850&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Avira-Full-Scan.jpg?resize=1536%2C1088&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Avira-Full-Scan.jpg?resize=2048%2C1451&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"850\" /></figure><p>Foundry</p></div>\n\n\n\n<p>The other modules tend to work as advertised. The Cookie Cleaner module does a good job of allowing you to view and clean up your cookie data. It helpfully groups cookies into different categories so we could easily remove stats, tracking and ads-based items without touching login records, and it did this across our different browsers. Junk Cleaner was surprisingly effective, reclaiming almost 55GB of space when we tried it. There’s also a dedicated uninstaller manager for cleaning up when removing apps and controls to manage those that start automatically. </p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/reviews/3803523/avira-prime-review-cookies-2021.jpg\" alt=\"Avira Prime review Mac 2021\" loading=\"lazy\" /></figure></div>\n\n\n\n<p>The Identity Assistant offers to extensively track your email addresses, phone numbers, credit cards, bank accounts, physical addresses, driver’s license, gamer tags, insurance account numbers, and mother’s maiden name to see if any illicit activity surfaces including this information. </p>\n\n\n\n<p>Password Manager is a combination of local system and browser extensions  plus a web-based management console with its own master password. Passwords section of the main window a button sends the user to a web page, where credentials are managed. This works best with a browser extension and we are pleased to confirm that one is <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/gb/app/avira-pwm-for-safari/id1575186255?mt=12&amp;xcust=1-1-668098-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">now available for Safari</a> (the extension used to only be available for Opera, Chrome and Firefox.) </p>\n\n\n\n<p>The password manager and junk files cleaner are included in both free and paid-for versions of Avira. Where Prime differs from the Free Security version is that you get full, unlimited use of the VPN service (provided as a separate app) instead of the 500MB per month limit imposed on non-paying users. The VPN can optionally block malicious website content, adding to the software’s local scanning and monitoring security. The module creates a VPN network configuration, which allows for extra privacy, but if you have a dedicated client you already like, this may be a better option. </p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/reviews/3803523/avira-prime-review-main-2021-clean.jpg\" alt=\"Avira Prime review Mac 2021\" loading=\"lazy\" /></figure></div>\n\n\n\n<h2>Usability &amp; Performance </h2>\n\n\n\n<p>Where performance is concerned, the Junk Cleaner module does a good job of removing extraneous trash, downloads, and temporary files to help recover disk space, the Uninstaller does a good job of locating and removing applications, and the Startup Apps offers tight control over which applications activate when your Mac is booted. Aside from Avira Prime crashing once when the Junk Cleaner was running, these elements work as well as anything offered by competing software suites.</p>\n\n\n\n<p>Still, there are some prominent concerns to address. First and foremost, the Full Scan took over six hours to complete on my 2022 M2 MacBook Pro. In addition to this, the program stopped to confirm that the user granted access to scan areas such as Documents and Downloads during the initial full scan, something I’d never seen before in any application I’ve worked with. While elements such as the scheduler work and allow scans to be programmed in advance, the fact that Avira Prime’s viral scan located and quarantined several minor worm files, but missed suspect files such as the Wave web browser, which has been implicated in assorted phishing scams in recent months, proved worrisome. </p>\n\n\n\n<p>That said, independent test labs at AV Comparatives and AV Test have given Avira Prime for Mac good scores. In May 2023 Avira scored 99% for Mac Malware protection and 99% for Mac PUA Protection with <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.av-comparatives.org/tests/mac-security-test-review-2023/&amp;xcust=1-1-668098-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">AV Compatitives</a>, while <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.av-test.org/en/antivirus/home-macos/macos-ventura/september-2023/avira-security-2.1-235303/&amp;xcust=1-1-668098-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">AV Test</a> gave Avira 99.8% in September 2023. </p>\n\n\n\n<p>One criticism is that the Identity Assistant only points out where your personal information’s been compromised in large-scale hacks, such as those that occurred at Adobe, Dropbox, and Tumble and this feels like an upsell. The software quickly emails you information that could have been discovered for free on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://haveibeenpwned.com/&amp;xcust=1-1-668098-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">haveibeenpwned.com</a>. Avira Prime then offers identity monitoring for $38.99 for the first year with an automatic renewal of $64.99 for each additional year until canceled.</p>\n\n\n\n<h2><span>Price</span></h2>\n\n\n\n<p><span>Avira Prime is a five-device subscription that can cover your Mac and iPhone and – if necessary – a Windows PC and Android smartphone as well. There’s no trial and no special first-year price offered, which means there’s no surprise a year into your subscription with inflated renewal costs.</span></p>\n\n\n\n<p>However, while there is no trial of Avira Prime, there is a free version: <a href=\"https://www.macworld.com/article/668094/avira-free-security-for-mac-review.html\">Avira Free Security for Mac</a>, which we review separately. There’s also the slightly cheaper <a href=\"https://prf.hn/click/camref:1100liSb7/pubref:1-1-668098-1-0-0/destination:https://www.avira.com/en/internet-security%0A\" target=\"_blank\">Avira Internet Security</a> </p>\n\n\n\n<p>The rate of $9.99/£8.99 per month to cover five devices with Avira Prime isn’t terrible, but when you consider that there is no limit to the number of devices the free version will cover, you might want to make do with the free option which offers the same core protection as Prime.</p>\n\n\n\n<ul>\n<li>\n<a href=\"https://prf.hn/click/camref:1100liSb7/pubref:1-1-668098-1-0-0/destination:https://www.avira.com/en/prime%0A\" target=\"_blank\"><span>Get Avira Prime</span></a></li>\n</ul>\n\n\n\n<p><span>This is really the sticking point with Prime: it’s pretty expensive when you consider that Avira Free Security offers the same core protection as Prime. It doesn’t feel like you’re getting much extra for your money with Prime.</span></p>\n\n\n\n<h2><span>Verdict</span></h2>\n\n\n\n<p><span>Avira Prime does a good job of spotting and dealing with unwanted software, through both manual and automatic scans and activity monitoring. The additional features are well designed; the Phantom VPN, the cookie cleaning, junk file management and uninstaller helper all add to the package. </span></p>\n\n\n\n<p><span>If you just want something to watch for dodgy software activity Avira Free Security may be all you need. And it’s hard not to think that Avira is doing itself a disservice by offering so much for free: the additional benefits of Avira Prime won’t justify the annual subscription cost for most people.</span></p>\n\nAntivirus, Security Software and Services</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"45dfd607e620adf0c825b6a1128569f6346b0e40c2ccf64a7682e032a76b5157","category":"Apple"}