{"title":"Cause-Related Mortality in Canada by Income Quintile: Examining the Impact of Multiple Causes before and after the COVID-19 Pandemic","link":"https://www.preprints.org/manuscript/202409.2342/v1","date":1727678262000,"content":"Mortality rates are fundamental to understanding the overall health of a population. However, statistics are usually reported using the primary underlying cause of death, overlooking potentially relevant contributing causes listed on death certificates. This paper presents indicators for multiple cause-related mortality in Canada from 2000 – 2022. Deaths from the Canadian Vital Statistics Database (2000 – 2022) were merged with multiple cause files and classified into 136 cause of death groupings. Summary statistics for multiple causes were calculated, including the Standardized Ratio of Multiple to Underlying (SRMU), which is also calculated by neighbourhood income quintile. Age-Standardized Mortality Rates (ASMR) were calculated for the underlying cause of death (ASMRUC) and compared to rates including any mention of each respective cause (ASMRAM). These were then compared to ASMRs based on a contributing-cause weighting scheme (ASMRW). The average number of causes reported on death certificates has increased from 2.79 in 2002 to 3.19 in 2021. Those in the lowest income quintiles have a higher average number of causes (3.31 in 2021) compared to those in the highest income quintile (3.09 in 2021). When employing multiple cause weighting strategies, the rank order of age-standardized mortality rates is significantly elevated for conditions including renal failure, hypertension, pneumonia, septicemia, arterial fibrillation, and artery diseases. Multiple cause-of-death approaches provide further insight into the patterns of mortality and highlight conditions that become leading causes using weighted approaches. This provides evidence to support efforts to address these conditions. There are also differences in multiple causes of death reporting by income quintile which warrants further investigation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"45e5eac1528fdf0edfa256b3c67846861ec460ba04a364c92df2cb51c95ddc40","category":"Interdisciplinary"}