{"title":"Effects of the Minimum Wage (MW) on Income Inequality. Systematic Review and Analysis of the Spanish Case","link":"https://www.preprints.org/manuscript/202406.1682/v1","date":1719302325000,"content":"Background. The minimum wage has become a standard measure in economic and social policies of countries all over the world and it directly or indirectly affects between 20% and 30% of the labour force. The primary objective of this measure is to guarantee that workers receive a minimum wage that allows them to lead a decent life, thereby reducing inequality and poverty. However, studies on the minimum wage have not focused on assessing the effects on these dimensions, but on employment, anticipating a negative effect (in line with the traditional theory of perfect competition), which they have been unable to substantiate.\nObjectives and Methods. The objective of this study is to address this research gap by analysing the effects of minimum wage increases on income inequality and poverty. To this end, firstly, a systematic review of the empirical analyses was conducted using the PRISMA methodology, with a view to ensuring that all empirical evidence was available. Secondly, the Spanish case was examined. As the significant increase in minimum wage in Spain in 2019 (21,3% in real terms) presents an invaluable opportunity to utilise this event as a natural experiment to generate new evidence, a difference-in-differences approach was employed to assess the impact of this phenomenon.\nResults. In relation to the first objective, a number of non-exhaustive and outdated literature reviews have been identified, which have been subjected to a critical review. In addition, a total of 31 articles that empirically analysed this relationship in recent years (2020-2024) have been included. The available evidence indicates a clear inverse relationship between the minimum wage and inequalities and poverty. Regarding the Spanish case, there has been a dearth of scientific studies on this subject, particularly in the context of the significant increase observed in 2019, which makes this article of particular relevance. The results are statistically significant, demonstrating an increase of approximately 18% in annual gross income among low-income households, relative to the control group. Furthermore, there is evidence of a spillover effect and a lighthouse effect towards income groups closer to the treatment group. This suggests that the minimum wage increase has a positive impact on the income of workers earning just above the new minimum and even below it. This result is consistent with the existing literature, which shows that minimum wage increases have a positive effect on the income of workers earning slightly above or below the new minimum.\nScientific contribution. In doing so, two new basic scientific contributions were made: a systematic, exhaustive, and up-to-date literature review (up to June 2024), as there is, to our knowledge, no recent systematic review of this relationship (minimum wage vs. inequality). Then, the introduction of new scientific evidence demonstrating that a significant increase in the minimum wage can significantly improve the income of low-wage earners without the adverse effects that would otherwise disrupt this positive effect, thereby reducing income inequality and poverty.\nAs a limitation of the study, it would be desirable to delve deeper into other aspects not analysed here, such as the effects on productivity and consumption. Furthermore, it has not been possible to analyse the medium and long-term effects, due to data limitations. Nevertheless, there is evidence that inequality and poverty are on a downward path.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"45ea255bd0ebdc3998989f06d30ee4cb7d0d9af370b07fb05077e24e31396569","category":"Interdisciplinary"}