{"title":"Potential Barriers to Adaptive Actions in Water–Rice Coupled Systems in Japan: A Framework for Predicting Soft Adaptation Limits","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2022WR034219?af=R","date":1712300400000,"content":"<h2>Abstract</h2>\n<p>The changing climate makes it more difficult to manage water resources and food production sustainably. Various adaptation measures have been proposed to moderate the negative impacts of climate change; however, implementation of these measures may be hampered by other factors even if the benefits are acknowledged—a situation termed “soft adaptation limits” by the IPCC. We hypothesized that societal rules can be a potential barrier to adaptive action if they are too fixed, because such rules have coevolved with the interactions between the past climate and human activities. To test this hypothesis, we present a framework based on the assumption that associated societal rules of Japan's matured irrigation systems are potential barriers to adaptation. The framework consisted of two process-based models, one to evaluate the water deficit risk and one to evaluate the benefits of optimizing rice yield and quality. We applied each model to an experiment in which we shifted the current transplantation date by 1 week for up to 5 weeks before and after the current date under the historical (1981–2000) and RCP 2.6 and 8.5 (2011–2030 and 2031–2050) scenarios. We revealed two contrasting development pathways in the study watershed. Soft adaptation limits imposed by water availability will occur by 2030 if farmers optimize for quality, whereas mutual benefits to farmers and river administrators will be achieved if farmers seek yield. We argue that more participatory research with stakeholder engagement, as well as policy discussions about these possible developments, is needed to ensure successful adaptation.</p>","author":"Asari Takada, \nTakeo Yoshida, \nYasushi Ishigooka, \nAtsushi Maruyama, \nRyoji Kudo","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"45f09e94e421673d9b07e03166da6d73e316f411d3bb12a3b7138aa3c22c5ad7","category":"Environment"}