{"title":"MBUK August 2021 issue on sale now. Subscribe and get a pair of G-Form Sorata Trail Gloves!","link":"https://www.bikeradar.com/news/mbuk-latest-issue-gift/","date":1627992022000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/MBK_398_digiads.1440x958-f3dda45.jpg?quality=90&amp;resize=620,413\" />                                            <p>MBUK’s August issue is in the shops now – with a free pair of Jagwire workshop gloves to help you give your beloved steed some TLC this summer!</p>\n<p>In this unmissable issue the team show you how to manual like a pro, scale impossible climbs, fend off flats and stay out of trouble when riding off-piste. On test, there are 12 disc brakes, six sets of grips and full-suspension trail bikes from Focus, Sonder, Specialized and Vitus.</p>\n<p>Meet the wakeboarding star making waves in the dirt jump scene, find out what has been crowned the best British blue trail, see how much decent riding can be squeezed into 12 hours and pay tribute to some of the riders who helped shape the modern mountain bike. All this plus rides in the Cotswolds and Scottish Borders, four route maps and all the usual MBUK tips and titbits – plus Mint Sauce, of course!</p>\n<ul><li><a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription?promo=MBW396&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=peaty_MBW396&amp;utm_content=editorial-link&amp;style=brand\" target=\"_blank\">Subscribe to Mountain Biking UK to receive your free gift as well as discounts and more</a></li>\n</ul><h2>Revolutionaries</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Joe Breeze, one of the grandaddies of mountain biking. <em>Larry Cragg</em></span></figcaption><span></span></div>\n<p>In this special feature, MBUK looks back on the history of mountain biking to pinpoint the riders who changed the sport forever. From ace athletes to maverick mechanics who shaped the bikes we ride today, discover the icons and unsung heroes of MTB.</p>\n<h2>£3,000 trail bikes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Can you get a killer do-it-all full-susser for three grand? <em>Ian Linton</em></span></figcaption><span></span></div>\n<p>For this issue’s bike test the testing team have found four do-it-all full-suspension bikes at the competitive price point of three grand. As always, they’ve tested them head to head, to find out which is the best affordable trail slayer on the market.</p>\n<h2>Disc brakes on test</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A dirty dozen of the most powerful hydraulic stoppers around are put through the mill. <em>Russell Burton</em></span></figcaption><span></span></div>\n<p>Believe it or not, a good set of brakes is essential for your ability to ride faster; aiding confidence and control as well as stopping power. MBUK have reviewed 12 hydraulic disc brakes in this month’s group test to single-out the ultimate speed scrubbers for your bike.</p>\n<h2>Wake up call</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Wakeboarder Liam Peacock transfers his talents from the waves to the woods. <em>Steve Behr</em></span></figcaption><span></span></div>\n<p>Liam Peacock is a world-class wakeboarder. When lockdown put a stop to his wave-riding plans, Liam took to his mountain bike as a way to pass the time. However, when he found that his talent for airtime translated well to the world of dirt jumps, Liam was quickly nailing massive flips. Steve Behr hangs out with this multi-disciplined machine to hear his story.</p>\n<h2>Exmoor and more and more…</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> How much ‘downcountry’ riding can 12 hours on Exmoor get you? <em>Paul Box</em></span></figcaption><span></span></div>\n<p>MBUK and BikeRadar’s cross-country aficionado Tom Marvin heads to the West Country to see just how much riding you can cram into a 12-hour stint on one of these newfangled ‘downcountry’ bikes. Can these rad XC rigs tackle Exmoor’s gnarliest log drops and rock gardens?</p>\n<h2>And that’s not all…</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> POC’s Kortal Race MIPS helmet – reviewed in this month’s Wrecked and Rated. <em>Russell Burton</em></span></figcaption><span></span></div>\n<p>This issue of MBUK is jam-packed with all the latest and greatest bikes, product reviews and news stories from the mountain biking world. There are new bikes from Norco and Cannondale, along with pages of product reviews that include POC’s Kortal Race MIPS helmet.</p>\n<h2>Free gift</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Don’t miss your free Jagwire workshop gloves with this issue! <em>Andy Lloyd</em></span></figcaption><span></span></div>\n<p>This month every reader gets a pair of Jagwire workshop gloves with their copy of the mag. These heavy-duty hand protectors will make all those fettles, tinkers and tweaks much easier and safer, and will prove an invaluable addition to your toolkit, whether in the workshop or at the trailside.</p>\n<h2>Subscription offer</h2>\n<div>\n    <img /></div>\n<p><a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription?promo=MBW396&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=peaty_MBW396&amp;utm_content=editorial-link&amp;style=brand\" target=\"_blank\">Subscribe to MBUK</a>, Britain’s best-selling mountain biking magazine – made by riders to inform, excite and entertain other riders – and receive <span>a pair of G-Form Sorata Trail gloves</span><span>!</span></p>\n<p>Since MBUK’s first issue in 1988, it’s blazed a trail all of its own, combining unrivalled product testing with easy-to-understand skills tips and maintenance advice, inspiring route guides, entertaining riding features and stunning photography from the world’s best snappers – and all while never taking things too seriously.</p>\n<section><div>\n        <h2>Why subscribe?</h2>\n<ul><li>Save 30%* on the shop price: only £24.99 every 6 issues</li>\n<li>Get a pair of <span>G-Form Sorata Trail gloves!</span></li>\n<li>Every issue delivered straight to your door</li>\n<li>Never miss an action-packed issue or supplement</li>\n<li>Exclusive offers and competitions with our Subs Zone!</li>\n</ul><p>\n\n    </p></div>\n    </section><p>You can <a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription?promo=MBW396&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=peaty_MBW396&amp;utm_content=editorial-link&amp;style=brand\" target=\"_blank\">subscribe to MBUK here</a> and check out our <a href=\"https://www.facebook.com/MBUKMag/\" target=\"_blank\">Facebook</a>, <a href=\"https://www.instagram.com/mbukmagazine/\" target=\"_blank\">Instagram</a> and <a href=\"https://twitter.com/mbukmagazine?lang=en\" target=\"_blank\">Twitter </a>accounts for all of the latest mountain bike action.<br />\nAnd don’t forget to sign up to the <a href=\"http://www.mbuk.com/newsletter\" target=\"_blank\">newsletter!</a></p>\n<p>*Offer open to new UK customers subscribing to the print edition by direct debit only. Full details of the Direct Debit Guarantee will be provided and are available on request. Please allow 28 working days for delivery of your gift. You will receive 13 issues per year. Your subscription will start with the next available issue. 30% saving based on buying 13 issues at full UK shop price. In the unlikely event your selected gift is unavailable, we reserve the right to send an alternative gift. Offer ends: 04/08/21.</p>","author":"Chris Barnard","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"45f135810c46df799b9eeaafe171365091b7fcf3204bae3e5d6f6744e247ff79","category":"Cycling"}