{"title":"Zoledronic acid and ibandronate-induced nephrotoxicity in 2D and 3D proximal tubule cells derived from human and rat","link":"https://academic.oup.com/toxsci/article/198/1/86/7459915?rss=1","date":1701820800000,"content":"<span><div>Abstract</div>Drug-induced proximal tubule (PT) injury remains a serious safety concern throughout drug development. Traditional in vitro 2-dimensional (2D) and preclinical in vivo models often fail to predict drug-related injuries presented in clinical trials. Various 3-dimensional (3D) microphysiological systems (MPSs) have been developed to mimic physiologically relevant properties, enabling them to be more predictive toward nephrotoxicity. To explore the capabilities of an MPS across species, we compared cytotoxicity in hRPTEC/TERT1s and rat primary proximal tubular epithelial cells (rPPTECs) following exposure to zoledronic acid and ibandronate (62.5–500 µM), and antibiotic polymyxin B (PMB) (50 and 250 µM, respectively). For comparison, we investigated cytotoxicity using 2D cultured hRPTEC/TERT1s and rPPTECs following exposure to the same drugs, including overlapping concentrations, as their 3D counterparts. Regardless of the in vitro model, bisphosphonate-exposed rPPTECs exhibited cytotoxicity quicker than hRPTEC/TERT1s. PMB was less sensitive toward nephrotoxicity in rPPTECs than hRPTEC/TERT1s, demonstrating differences in species sensitivity within both 3D and 2D models. Generally, 2D cultured cells experienced faster drug-induced cytotoxicity compared to the MPSs, suggesting that MPSs can be advantageous for longer-term drug-exposure studies, if warranted. Furthermore, ibandronate-exposed hRPTEC/TERT1s and rPPTECs produced higher levels of inflammatory and kidney injury biomarkers compared to zoledronic acid, indicating that ibandronate induces acute kidney injury, but also a potential protective response since ibandronate is less toxic than zoledronic acid. Our study suggests that the MPS model can be used for preclinical screening of compounds prior to animal studies and human clinical trials.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"45fab0bfa348e08785cb392d6cd725aa9308eafbf0ef7983ac03525b911d749d","category":"Environment"}