{"title":"Saturn’s tiny moon Mimas seems to have an ocean, too","link":"https://arstechnica.com/?p=2001616","date":1707324454000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/image-800x800.png\" alt=\"Greyscale image of a moon lit on one side, with its face dominated by a giant crater.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/image.png\">Enlarge</a> <span>/</span> That is actually a moon. (credit: <a href=\"https://science.nasa.gov/saturn/moons/mimas/\">NASA/JPL/Space Science Institute</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The once-exclusive club of Solar System objects that host oceans is getting increasingly crowded. On Wednesday, Nature released a paper providing evidence that Saturn's moon Mimas has a subsurface ocean beneath its heavily cratered crust. The evidence for this ocean comes in the form of orbital oddities that are seemingly impossible to explain by anything other than the presence of an ocean.</p>\n<h2>Solid looks</h2>\n<p>Of Saturn's seven major moons, Mimas orbits closest to the planet, taking less than a day to complete an orbit. It's also the smallest of the major moons, with a diameter of just under 400 kilometers (about 250 miles). Despite its diminutive size, Mimas hosts the second-largest crater on any moon in the Solar System. The Herschel Crater dominates the surface of the moon, giving it an appearance that evokes the Death Star.</p>\n<p>Even outside of Herschel, the moon's surface is heavily pocked by craters, suggesting it has been static for most of the moon's history. That's in sharp contrast to moons like Europa and Enceladus, where the subsurface oceans allow the constant remodeling of their surfaces, leaving them with much sparser crater histories. So Mimas seemed like a very poor candidate for hosting an ocean.</p></div><p><a href=\"https://arstechnica.com/?p=2001616#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2001616&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"45fb47ad23a841a79a77f02cd2bd7aec1708a2d15f9b9c74dc0bc120a13ce191","category":"Tech"}