{"title":"Automated Non-Sterile Pharmacy Compounding: A Multi-Site Study in European Hospital and Community Pharmacies with Pediatric Immediate Release Propranolol Hydrochloride Tablets","link":"https://www.preprints.org/manuscript/202403.0740/v1","date":1710327740000,"content":"Pharmacy compounding, the art and science of preparing customized medications to meet individual patient needs, is in a verge of transformation. Traditional methods of compounding often involve manual and time-consuming processes, presenting challenges in terms of consistency, dosage accuracy, quality control, contamination and scalability. However, the emergence of cutting-edge technologies has paved a way for a new era for pharmacy compounding, promising to redefine the way medications are prepared and delivered as pharmacy-tailored personalized medicines. In this multi-site study, more than 30 hospitals and community pharmacies from 8 countries in Europe utilized a novel automated dosing approach inspired by 3D printing for compounding of non-sterile propranolol hydrochloride tablets. CuraBlend® excipient base, a GMP manufactured pharma-ink, intended for automated compounding applications was used. A standardized study protocol to test the automated dosing of tablets with variable weights was performed in all participating pharmacies in 4 different iterative phases. Integrated quality control was performed with an in-process scale and NIR spectroscopy supported by HPLC content uniformity measurements. In total, 6088 propranolol tablets were produced at different locations during this study. It was shown that the dosing accuracy of the process increased from about 90% to 100% from phase 1 to phase 4 by making improvements to the formulation and the hardware solutions.  The results indicate that through this novel automated and quality-controlled compounding approach extemporaneous pharmacy manufacturing can take a giant leap forward towards automation and digital manufacture of dosage forms in hospital pharmacies and compounding pharmacies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"45fbb16e78970352ff331921536ce1c29233c01725cc02106b5baf19a4ea2c81","category":"Interdisciplinary"}