{"title":"Here’s why you’ll want to upgrade to iOS 16.4 as soon as it arrives next week","link":"https://www.macworld.com/article/1660169/ios-16-4-new-features-upgrade-home-architecture-emoji-web-app.html","date":1679768427000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When it comes to iOS “point release” updates, there are those that don’t seem to change much and those that bring a bunch of fun new features to your iPhone. <a href=\"https://www.macworld.com/article/1481562/ios-16-4-release-candidate-features-install.html\">iOS 16.4</a>, which will arrive on phones next week is the latter. </p>\n\n\n\n<p>New security updates are usually a good enough reason to update your iPhone right away, but in the case of iOS 16.4, you’re going to get a bunch of enhancements that will impact the way you use your iPhone. These are the three biggest new features coming to your phone next week.</p>\n\n\n\n<h2>New Home architecture</h2>\n\n\n\n<p>Apple first released its promised new Home architecture <a href=\"https://www.macworld.com/article/1442447/ios-16-2-upgrade-to-new-home-architecture-pulled.html\">back in iOS 16.2</a>, but users had trouble updating and it was quickly pulled just a few days later. After several months, it’s now back in iOS 16.4.</p>\n\n\n\n<p>The new architecture doesn’t really add any specific new features yet. It’s just a total reworking of the under-the-hood workings of the Home app and HomeKit for efficiency, reliability, and speed. If you previously upgraded before Apple pulled it last December, you shouldn’t need to upgrade again, but things should work more smoothly than last time.</p>\n\n\n\n<p>Once you update to iOS 16.4, you can open the Home app, tap the (…) button in the upper right corner, and then select <em>Home Settings</em>. The prompt to update will be at the top of the screen. Note that all your other Apple things (especially Home Hubs like Apple TV or HomePod) will need to be updated as well.</p>\n\n\n\n<h2>New emojis</h2>\n\n\n\n<p>Who doesn’t love emojis? In iOS 16.4 Apple is <a href=\"https://www.macworld.com/article/1516394/ios-16-4-iphone-emoji-donkey-moose-shaking-face.html\">adding 21 new emojis</a> (31 if you include skin tone variations). You’ll get:</p>\n\n\n\n<ul><li><strong>Heart:</strong> Blue, pink, gray</li><li><strong>Smiley:</strong> Shaking face</li><li><strong>Gesture:</strong> Rightwards and leftwards pushing hand with 5 skin tones each</li><li><strong>Animals:</strong> Donkey, moose, goose, wing, jellyfish</li><li><strong>Nature:</strong> Hyacinth, pea pod, ginger</li><li><strong>Items:</strong> Folding hand fan, hair pick, flute, maracas</li><li><strong>Symbols:</strong> Khanda, wireless</li></ul>\n\n\n\n<h2>Web app push notifications</h2>\n\n\n\n<p>For a long time now, one of the biggest problems with “web apps”–websites you add to your home screen to act like apps–was the lack of ability to send push notifications. With iOS 16.4, web apps added to your home screen can use the HTML5 standard Web Push API to send push notifications, complete with badge icons. Of course, they’ll have to ask permission to do this just like any app, and you can go to Settings &gt; Notifications to adjust the way the web app notifies you.</p>\n\n\n\n<p>This will only apply to apps added to your home screen. You know, like <a href=\"https://www.macworld.com/article/589410/how-to-wordle-app-iphone-ipad.html\">you would do with Wordle</a>. Unlike Safari on the Mac, regular websites accessed in Safari on iOS still can’t send push notifications.</p>\n\n\n\n<p>For all the latest news about iOS 16 and the latest version read our <a href=\"https://www.macworld.com/article/631448/ios-16-features-compatibility-how-to-update.html\">iOS 16 superguide</a>.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4601b0fa0434875471771e4b4957db04d109bf0cc1521ecbefcce4a492a9fb66","category":"Apple"}