{"title":"Australia Eyes Consumer Impact of Google's Default Search Engine Deal With Apple","link":"https://www.macrumors.com/2021/03/11/australia-google-default-search-ios/","date":1615467877000,"content":"The Australian Competition and Consumer Commission watchdog is eyeing a potential probe into pre-installed software and pre-defined \"default\" choices on mobile devices, including Google being set as the default search engine on Apple devices. \r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/07/searchengineoptionsios.jpg\" alt=\"\" width=\"1300\" height=\"942\" class=\"aligncenter size-full wp-image-748738\" />\r\n<br/>\r\nIn a <a href=\"https://www.accc.gov.au/media-release/feedback-sought-on-choice-and-competition-in-internet-search-and-web-browsers\">press release</a> (via <em><a href=\"https://www.zdnet.com/article/australia-extends-tech-giant-probe-to-google-and-apple-browser-domination/\">ZDNet</a></em>), the agency is asking for consumer and industry feedback on the state of default settings, pre-installed web browsers, and how it impacts consumer choice, freedom, and competition. On Apple devices, Google is the default search engine in Apple's Safari browser, and while users can change it, there <a href=\"https://www.macrumors.com/2020/07/01/uk-regulators-apple-google-search-engine-deals/\">has been </a>concern over how it hinders competition.\r\n<br/>\r\n\r\n<br/>\r\nEarlier last year, the United States Department of Justice <a href=\"https://www.macrumors.com/2020/10/25/google-apple-search-default-8-12-billion/\">launched an antitrust lawsuit</a> against Google, accusing it of anticompetitive behavior. As part of the case, it was revealed that Apple receives anywhere between &#36;8 billion and &#36;12 billion per year from Google in exchange to make it the default search engine for Safari. The lawsuit claims that the lucrative deal makes it significantly harder for competing search engines such as DuckDuckGo to grow and compete, given the massive advantage Google has.\r\n<br/>\r\n\r\n<br/>\r\nACCC Chair Rod Sims says that while users can change the search engine to other providers besides Google, the default option \"increases the likelihood that consumers and businesses will stick with that option.\" Sims says that the agency wants to hear directly from consumers and businesses about how these default choices and pre-installed software impact how they use those services.\r\n<br/>\r\n<blockquote>We would like to hear from consumers and businesses about the impact of the pre-installation of services and default settings on devices on their use of these services. We're also interested in how the design of user interfaces on devices, such as <a href=\"https://www.macrumors.com/guide/home-screen/\">widgets</a>, search bars, and the steps required for a consumer to change a default search service can affect how consumers use these services.</blockquote>The agency has not formally launched an investigation into the situation. However, it is requesting feedback as part of an upcoming report \"on the impact of default settings and pre-installation of search services and web browsers on consumer choice and competition.\"<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/google/\">Google</a>, <a href=\"https://www.macrumors.com/guide/australia/\">Australia</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/11/australia-google-default-search-ios/\">Australia Eyes Consumer Impact of Google&#039;s Default Search Engine Deal With Apple</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/australia-eyes-consumer-impact-of-googles-default-search-engine-deal-with-apple.2287946/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=-uwsCh-Xt4I:vYRimaxqSMY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=-uwsCh-Xt4I:vYRimaxqSMY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/-uwsCh-Xt4I\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4605df780afb41101d51ef906a96824b5cc83292d1eb36f2f982291571d03a17","category":"Apple"}