{"title":"Are bikes really more expensive now? 2009 vs. 2021 prices and value compared","link":"https://www.bikeradar.com/features/why-are-bikes-so-expensive/","date":1619614849000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/09/20200915_SB_5DSR_MG_3055-aba269f.jpg?quality=45&amp;resize=620,413\" />                                            <p>Bikes are pretty expensive these days, eh? In recent years, manufacturers have seemingly been competing to see who can charge the most outrageously large sum of money for a bicycle.</p>\n<p>We barely raise an eyebrow when a new superbike appears on the scene with a five-figure price tag; that’s now the norm for halo road models from both mainstream manufacturers such as Trek and Specialized, and brands historically associated with exclusivity such as Pinarello and Colnago.</p>\n<p>At the same time, what we consider to be entry-level or mid-range has evolved dramatically. Many of the minimalist road bikes of yesteryear have given way to more genre-blurring designs thanks to the takeover of disc brakes and the concurrent interest in more varied road (and gravel) riding.</p>\n<p>But have road bikes really got more expensive, and are you getting better or worse value for money? What even constitutes an apples-to-apples comparison? Let’s break it down.</p>\n<p><em>Note: this feature focuses on road bikes. There are parallel trends in mountain biking, but MTB tech has evolved dramatically in ways that would make similar comparisons less meaningful. Also, this article is long enough as it is without further muddying the waters. Prices quoted were checked 16 April 2021.</em></p>\n<h2>Halo bikes cost more than ever</h2>\n<p>This seems to be an incontrovertible fact. Before the armchair economists chime in, yes, inflation is a thing and it can distort our perception of the value of money over time, but when it comes to bikes, the high-end has been pushed upwards beyond inflation, hasn’t it? Let’s look at some examples…</p>\n<p>The Specialized S-Works Tarmac is a benchmark for superbikes and it’s been around for a long time as the brand’s flagship race bike, so it’s a handy basis for comparison.</p>\n<p>Turn the clock back a bit and a 2009 Specialized S-Works Tarmac SL2 with a <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-7900-group-review/\">Shimano Dura-Ace 7900 groupset</a> would have set you back $8,500 in the US or £5,382 in the UK according to the pricing I’ve dug up. (It’s surprisingly hard to find reliable historic pricing, so don’t take these figures as absolute gospel.)</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The S-Works Tarmac SL2 was seriously drool-worthy in 2009 and still looks pretty sharp today.</span></figcaption><span> <i>Specialized</i></span></div>\n<p>Here’s how those numbers stack up when you adjust for inflation to 2021 money and compare it to the price of the current equivalent bike, the <a href=\"https://www.bikeradar.com/news/2021-specialized-tarmac/\">Specialized Tarmac SL7 with Dura-Ace R9100 series Di2</a>.</p>\n<div>\n                <table><colgroup><col></col><col></col><col></col><col></col><col></col></colgroup><thead><tr><th>﻿Country</th><th>2009 Specialized S-Works Tarmac SL2 Dura-Ace</th><th>2009 price adjusted for inflation to 2021 money</th><th>2021 Specialized S-Works Tarmac SL7 Dura Ace Di2</th><th>% change after inflation adjustment</th></tr></thead><tbody><tr><td>US </td><td>$8,500</td><td>$10,536</td><td>$13,000</td><td>+23</td>        </tr><tr><td>UK </td><td>£5,382 </td><td>£7,588 </td><td>£11,500 </td><td>+51</td>        </tr></tbody></table></div>\n\n<p><em>Source: <a href=\"https://www.bls.gov/data/inflation_calculator.htm\" target=\"_blank\">U.S. Bureau of Labour Statistics</a> / <a href=\"https://www.hl.co.uk/tools/calculators/inflation-calculator\" target=\"_blank\">Hargreaves Lansdown</a> (February 2009–February 2021)</em></p>\n<p>The first thing to note is the difference between UK and US – the pound was much stronger compared to other currencies at the time and pricing tended to reflect this; these days we’re used to near-parity pricing (in terms of numbers) between the two countries.</p>\n<p>As a result of this and other factors, including <a href=\"https://www.bikeradar.com/features/long-reads/pandemic-brexit-bike-prices/\">current supply issues, Brexit, and the pandemic</a>, those of us in the UK appear considerably worse off.</p>\n<p>I should note that I’m not an economist and I’m aware that there are different methods for measuring inflation. A more complete study would also need to look in-depth at how wages and the real cost of living have varied, but that’s beyond the scope of this feature.</p>\n<p>It’s also worth mentioning that in the 21st century, we’re used to the idea that bikes are relatively affordable and a basic machine – i.e. the kind non-enthusiasts typically buy for practical purposes – costing less than a single month’s wages. That wasn’t always the case.</p>\n<h2>New bikes are just better</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The 2021 Specialized S-Works Tarmac SL7 is stunning in a variety of ways.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Back to the Tarmacs, our 2009 vs. 2021 comparison isn’t apples-to-apples at all. The 2021 bike <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/specialized-s-works-tarmac-sl7-review/\">is better in every way</a>.</p>\n<p>It’s more aerodynamic, it’s stiffer, it has better shifting, it stops better thanks to <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">disc brakes</a>, it comes with a <a href=\"https://www.bikeradar.com/reviews/training/power-meters/\">power meter</a> as standard and it has tyre clearances unheard of just a few years ago for a race bike, making it fundamentally more versatile.</p>\n<p>Despite all these improvements, it’s almost certainly lighter too, although there may not be much in it because the older bike had inherently more feathery rim brakes – it wasn’t difficult to build high-end bikes of that era below the 6.8kg UCI minimum weight.</p>\n<p>If you buy an S-Works Tarmac SL7 now you’re getting one of the most cutting-edge bikes on the market, but does that justify a price hike of over 50 per cent (for UK buyers)? That’s hard to say.</p>\n<p>Of course, buying the halo bike from a range never really makes financial sense; it has to be a heart over head decision to some extent because diminishing returns kick in at much lower prices.</p>\n<p>A second-tier Specialized Tarmac SL7 is still a better bike than the 2009 S-Works SL2 in every respect that matters.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> In many respects, the 2021 Tarmac Expert is a better bike than the halo bike of old.</span></figcaption><span> <i>Specialized</i></span></div>\n<p>The UK version of the <a href=\"https://www.specialized.com/gb/en/tarmac-sl7-expert/p/188008?color=302561-188008&amp;searchText=94920-3544\" target=\"_blank\">Tarmac SL7 Expert</a>, for example, costs £5,250 with Shimano Ultegra and mid-depth carbon wheels, or you can have Di2 and cheaper aluminium wheels <a href=\"https://www.specialized.com/gb/en/tarmac-sl7-expert---ultegra-di2/p/175295?color=290854-175295&amp;searchText=94920-3044\" target=\"_blank\">for the same money</a>. US buyers get the latter option only, and it’s priced at $5,500.</p>\n<p>In real terms, these bikes are significantly cheaper than an SL2 was in 2009 and my take away is that, as bike buyers, we’re still winning. It’s just that you’ll pay a huge premium if you must have the notional ‘best’ option.</p>\n<h2>Cheap bikes aren’t cheap anymore either, right?</h2>\n<p>Let’s take a look at some more typical numbers. In the UK, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-under-1000/\">£1,000 has always been a key price point</a>. For new bike buyers, a grand is a significant psychological hurdle, and typically the largest sum a rider might be willing to spend on their first serious road bike.</p>\n<p>For many years, it was also the upper limit for the UK government’s <a href=\"https://www.bikeradar.com/advice/buyers-guides/cycle-to-work-scheme-everything-you-need-to-know/\">Cycle to Work scheme</a>, although that’s no longer the case.</p>\n<p>In 2009, £1,000 bought you a lot of road bike. In fact, £1,000 was exactly the amount I spent on my first new road bike that very year – a Ribble Carbon Sportive with Campagnolo Centaur.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> This bike actually featured in <a href=\"https://www.bikeradar.com/features/revealed-our-top-road-bike-of-2009/\">that year’s Bike of the Year</a>, albeit in a more expensive spec.</span></figcaption><span> <i>Matthew Loveridge</i></span></div>\n<p>Now, this was a pretty sweet deal even at the time. Campagnolo’s 10-speed Centaur groupset looked far more expensive than it was thanks to a smattering of carbon and it included the wonderful ‘skeleton’ brake calipers with gram-shaving cut-outs.</p>\n<p>The whole bike weighed something like 8kg with a fairly heavy set of aluminium clincher wheels – a very reasonable figure.</p>\n<p>Bikes like these weren’t uncommon. £1,000 generally got you either a budget carbon frame or a decent aluminium one, typically built with Shimano 105 or sometimes even Ultegra components.</p>\n<h2>What does £1,000 get you now?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Ribble Endurance AL Disc Tiagra is one of the better-specced bikes under the magic £1,000.</span></figcaption><span> <i>Ribble Cycles</i></span></div>\n<p>If we look to Ribble, the only road bike that still sneaks in under the £1k threshold is the <a href=\"https://www.ribblecycles.co.uk/ribble-endurance-al-disc/\">Endurance AL Disc</a> in its cheapest build with Shimano Tiagra components and mechanical disc brakes.</p>\n<p>It’s a very tidy looking thing that rides well (<a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/ribble-endurance-al-disc/\">a slightly higher spec model we reviewed back in 2019</a> scored 4.5 stars) but it’s a wholly different proposition to the road bikes that used to dominate this price bracket.</p>\n<p>The Ribble has an aluminium frame, disc brakes, large tyre clearances and endurance geometry. It weighs close to 10kg and is fairly typical of modern entry-level road bikes.</p>\n<p>Don’t get me wrong, I love bikes like this – <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/rose-pro-sl-disc-105-review/\">the Rose Pro SL is another</a> – because they’re more versatile than traditional road bikes, and I’m a firm believer that at the lower end, <a href=\"https://www.bikeradar.com/features/this-is-why-its-time-to-stop-buying-cheap-carbon-bikes/\">aluminium is often a better choice than carbon</a>. Nevertheless, it’s a rather less sporty proposition.</p>\n<h2>But you’re forgetting inflation again!</h2>\n<p>Again, though, we need to adjust for inflation to make a fair comparison. Using the same 2009–2021 date range as above, your £1,000 bike from 2009 should now cost £1,410.</p>\n<p>Sticking with Ribble, £1,410 now buys you an Endurance AL Disc with a full Shimano 105 hydraulic groupset (with change at RRP £1,299) or the <a href=\"https://www.ribblecycles.co.uk/ribble-r872/\" target=\"_blank\">carbon-framed R872</a> with full 105 and rim brakes (RRP £1,399).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> With full 105 and a carbon frame, the R872 is an appealing prospect.</span></figcaption><span> <i>Ribble Cycles</i></span></div>\n<p>The latter, with its affordable carbon frame and rim brake groupset is a much closer relation to my old Carbon Sportive. But is the present-day R872 a better bike? That’s difficult to say.</p>\n<p>It’s not particularly light at a claimed 8.7kg, but on the other hand it gets arguably the best mid-range groupset on the market, <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-105-r7000-r7020-groupset-review/\">Shimano 105</a>.</p>\n<p><a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-105-r7000-r7020-groupset-review/\">Current 105 benefits from tech that’s trickled down from Dura-Ace R9100</a>, a groupset that wasn’t even a gleam in the eye of Shimano’s engineers back in 2009.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Mid-level groupsets like Shimano 105 are extremely refined these days.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Side-by-side with the 2009 bike, the 2021 machine will shift and stop better, but I wouldn’t expect the differences to be night and day.</p>\n<p>Nevertheless, we really liked the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/ribble-r872-tiagra-review/\">Tiagra-equipped R872 we reviewed in 2020</a> and it’s fair to say that buyers of the latest models are not getting short-changed here.</p>\n<p>Setting a maximum budget of £1,410, here’s a random selection of current road bikes you could buy including the aforementioned Ribble Endurance AL:</p>\n<div>\n                <table><colgroup><col></col><col></col><col></col><col></col><col></col></colgroup><thead><tr><th>﻿Make &amp; model</th><th>Frame material</th><th>Groupset</th><th>Brake type</th><th>Price</th></tr></thead><tbody><tr><td>BMC Teammachine ALR One 105</td><td>Aluminium</td><td>Shimano 105, non-series cranks</td><td>Rim</td><td>£1,400 </td>        </tr><tr><td>Boardman SLR 8.9 Carbon</td><td>Carbon</td><td>Shimano 105, FSA cranks, Tektro brakes</td><td>Rim</td><td>£1,100 </td>        </tr><tr><td>Canyon Endurace AL 7.0</td><td>Aluminium</td><td>Shimano 105</td><td>Rim</td><td>£1,349 </td>        </tr><tr><td>Giant Contend AR 2</td><td>Aluminium</td><td>Shimano Tiagra, Tektro brakes</td><td>Cable disc</td><td>£1,349 </td>        </tr><tr><td>Ribble Endurance AL Disc</td><td>Aluminium</td><td>Shimano 105</td><td>Hydraulic disc</td><td>£1,299 </td>        </tr><tr><td>Planet-X EC-130E Rivet Rider</td><td>Carbon</td><td>SRAM Rival 22</td><td>Rim</td><td>£1,399 </td>        </tr><tr><td>Specialized Allez Elite</td><td>Aluminium</td><td>Shimano 105, Praxis cranks</td><td>Rim</td><td>£1,249 </td>        </tr></tbody></table></div>\n\n<p>In looking around at the current market, I noted the following:</p>\n<ul><li>There are fewer affordable carbon bikes on the market generally, many have been replaced by aluminium models</li>\n<li>You still get a whole lot of bike for your money, but even many of those with rim brakes don’t give you a full groupset (i.e. one that includes a crankset and brakes that match the rest of the build)</li>\n<li>Ribble’s pricing is actually something of an outlier. Since rivals such as Canyon upped their prices, Ribble is one of the only brands offering full hydraulic groupsets in this price bracket.</li>\n</ul><h2>Bikes are better overall even if pricing feels less generous</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Whatever your feelings about bike industry trends, there’s no question that the current generation of road bikes are amazingly good, and the affordable ones really have benefited from trickle-down tech.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>It’s hard to draw concrete conclusions because I’m only looking at a small sample of the bikes on the market, and it depends enormously on what you consider a true equivalence.</p>\n<p>In my Specialized Tarmac comparison above, the present-day second-tier bike is tangibly better in a number of ways than the flagship model of yesteryear.</p>\n<p>At the lower end, it sometimes feels less clear cut. If you base the comparison solely on an inflation-adjusted price, the newer bikes don’t always offer great leaps forward without compromising elsewhere.</p>\n<p>If you want disc brakes, for example, you’re typically going to drop down the groupset hierarchy at least one level, and weights have either stayed similar for rim brake models or increased for models that have switched to discs.</p>\n<p>Of course, this is still somewhat reductive – the newer bikes have often improved in small ways that aren’t immediately obvious from a glance at the specs.</p>\n<p>Most will have wider rims and tyres than bikes of a decade ago and some will have the option to go <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless</a> too, offering a comfier ride that’s often faster in the real world.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">Entry-level and mid-range groupsets</a> really are better than they were a few years ago, and bikes are usually specced with much more <a href=\"https://www.bikeradar.com/news/the-complete-guide-to-bicycle-gears-bicycle-transmissions-explained/\">beginner-friendly gearing</a> than they used to be.</p>\n<p>Modern road bikes are also more versatile than ever before, and the choice in drop-bar bikes is far more diverse than it used to be – you can now have everything from a pure skinny tyred racer to something that’s almost a mountain bike, or you have an immense choice of bikes that occupy a useful middle ground between those extremes.</p>\n<p>My take? There’s little to be gained lamenting bike price increases. It sucks when things get more expensive, but there’s never been a better time to be a rider.</p>","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"4615bb2769f4d4e4712d463d8ff270776554a3ea3ab8004d9290eda01a72d000","category":"Cycling"}