{"title":"Culture War: Exploring the Influence of the Christian Religion and the Catholic Church Backing on Populist Party CHEGA","link":"https://www.preprints.org/manuscript/202404.1287/v1","date":1713448360000,"content":"The endorsement from Christian circles in facilitating the rise of right-wing populism in Brazil, the United States, as well as the support and alliance of the Polish Catholic Church with the Law and Justice (PiS) government, is widely acknowledged. Embedded within the intricate fabric of multifaceted factors contributing to the surge of right-wing populism, the Culture War assumes a pivotal yet often underestimated role. Manifesting as a profound confrontation, the Culture War signifies an existential clash between contrasting perspectives concerning socio-cultural values grounded in religious scripture. Progressive endeavors strive to deconstruct longstanding norms, advocating for the ascendancy of post-materialistic ideals, while conservative domains portray an unwavering commitment to safeguarding national and religious socio-cultural values as sacrosanct. Both factions employ moral-ethical justifications in their respective pursuits, rendering the landscape of cultural discourse a nuanced tapestry of ideological contention.\n\nThe influence of Christian doctrine on the conflict surrounding social justice, and the potential convergence between Christian doctrine and the positions of Populist right-wing movements on social justice issues, is underscored. By employing a singular case study focused on Portugal, owing to the nation's enduring relationship with Catholicism spanning from Monarchical times to the Republic and the Fascist Catholic regime, Portugal emerges as indisputably one of the most religious countries in the Western world, akin to Poland. Consequently, in theory, the support of the Portuguese Catholic Church for the nascent Populist right-wing and Christian-oriented party should be evident amidst the Culture War conflict, wherein conservative religious Christian values face existential challenge.\n\nHowever, the backing extended to CHEGA by both the Catholic Church and the Portuguese Episcopal Conference assumes an ambivalent and markedly diminished stance, diverging from the previously robust support observed in established center-right mainstream parties such as the PSD and CDS. Despite this reality and the absence of official support for CHEGA, numerous Christian politicians or activists have expressed endorsement or alignment with the right-wing party, departing from their former affiliations, primarily due to social justice concerns.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4616ba4f52ff22bf3cadb9519dfd4d7264d8c5881635766fb7faeb2e2c4e8c59","category":"Interdisciplinary"}