{"title":"Ketones for cycling: What are they, do they work and are they banned?","link":"https://www.cyclist.co.uk/in-depth/what-are-ketones-cycling","date":1706723603000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/what-are-ketones-cycling\">Ketones for cycling: What are they, do they work and are they banned?</a></p>\n\n<h2>What are ketones?</h2>\n\n\n\n<p>‘Ketones are an energy source produced by the liver during fasting or periods of low carbohydrate intake,’ says Peter Hespel, professor in exercise physiology at Leuven University and collaborator with Soudal-QuickStep.</p>\n\n\n\n<p>‘We all have ketones circulating in our blood but generally at very low levels.’</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/enhanced-games-cycling\">What if doping were completely legal? Welcome to the Enhanced Games</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/doping-cycling\">Doping in cycling: Everything you need to know</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/british-cyclists-part-of-ketones-trial-at-london-2012-olympics\">British cyclists part of ketones trial at London 2012 Olympics</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/ketones-taste-like-gin-and-tonic-de-plus-discusses-use-of-wonder-supplement\">‘Ketones taste like gin and tonic’ De Plus discusses use of wonder supplement</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/we-tried-legal-doping-and-this-is-what-happened\">We tried legal doping, and this is what happened</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>If ketones are produced when fasting, how does that help cycling performance?</h2>\n\n\n<div>\n<figure><img width=\"854\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032755/legal_doping_3-scaled-e1706712346477-854x970.jpg\" alt=\"legal_doping_3\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032755/legal_doping_3-scaled-e1706712346477-854x970.jpg 854w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032755/legal_doping_3-scaled-e1706712346477-264x300.jpg 264w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032755/legal_doping_3-scaled-e1706712346477-768x872.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032755/legal_doping_3-scaled-e1706712346477-1353x1536.jpg 1353w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032755/legal_doping_3-scaled-e1706712346477-750x851.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032755/legal_doping_3-scaled-e1706712346477-1140x1294.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032755/legal_doping_3-scaled-e1706712346477.jpg 1708w\" /><figcaption></figcaption></figure></div>\n\n\n<p>This is where we must differentiate between endogenous ketones, produced within your body, and exogenous ketones, a lab-made synthetic supplement.</p>\n\n\n\n<p>The idea first mooted by ketone researcher Professor Kieran Clarke of Oxford University was that, when taken orally, exogenous ketones are effectively another energy source.</p>\n\n\n\n<p>Ingesting ketones helps spare precious glycogen (the body’s most readily available energy source), ensuring you’re fully charged for an upcoming hill or sprint.</p>\n\n\n\n<h2>Why are ketones in the news?</h2>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032806/nairo-quinta-tdf-2022-tt-matthew-loveridge-1-970x546.jpg\" alt=\"nairo-quinta-tdf-2022-tt-matthew-loveridge-1\" /></figure>\n\n\n\n<p>In February 2022 Nairo Quintana became the latest WorldTour rider to call for a ban on ketones. ‘The more they ban them, the better for us,’ the Colombian told Spanish paper <em>Marca</em>.</p>\n\n\n\n<p>He was following Arnaud Démare, Guillaume Martin and Thibaut Pinot, arguably because ketones are prohibited for teams signed up to the <a href=\"https://www.cyclist.co.uk/in-depth/doping-cycling\" target=\"_blank\">Movement for Credible Cycling (MPCC)</a>, which includes teams such as Démare and Pinot’s former squad Groupama-FDJ but doesn’t include Visma-Lease a Bike or Ineos Grenadiers.</p>\n\n\n\n<p>The latter has always denied ketone use but the former openly use ketones and have an official partnership with HVMN, which includes using its Ketone IQ product and R&amp;D for future projects. Soudal-QuickStep also have an official ketone partner, KetoneAid. Ketones are not banned by WADA, the World Anti-Doping Agency.</p>\n\n\n\n<h2>Why are they prohibited by the MPCC?</h2>\n\n\n\n<figure><img width=\"970\" height=\"546\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032812/getty-mpcc-wrist-band-edited-970x546.jpg\" alt=\"getty-mpcc-wrist-band-edited\" /><figcaption>Joel Saget / Staff via Getty</figcaption></figure>\n\n\n\n<p>Ketones are controversial primarily because of their side effects, which include vomiting and stomach distress, and ‘uncertainty over any long-term effects’.</p>\n\n\n\n<p>Ketones aren’t banned by the UCI, although it recommends against their use because of those digestive issues. UCI medical director Xavier Bigard recently told L’Equipe,</p>\n\n\n\n<p>‘To date, there is no scientific evidence that ketone bodies improve performance.’</p>\n\n\n\n<h2>I’m confused. The MPCC has prohibited a product that doesn’t work?</h2>\n\n\n\n<p>‘The use of ketones is still experimental,’ says sports nutrition scientist Asker Jeukendrup, who has worked with Visma-Lease a Bike. ‘There are few studies to go by and the results of those studies are not as clear-cut as is sometimes communicated.’</p>\n\n\n\n<p><strong>Related: <a href=\"https://www.cyclist.co.uk/news/dutch-anti-doping-boss-says-jumbo-visma-ketone-use-in-grey-area\" target=\"_blank\">Dutch anti-doping boss says Jumbo-Visma ketone use in ‘grey area’</a></strong></p>\n\n\n\n<p>Then again, Jeukendrup says on paper the rationale is relatively solid. ‘It’s the same rationale that I experimented with during my PhD 25 years ago, but with medium chain triglycerides (MCT). These are partly converted to ketone bodies, especially beta hydroxybutyrate, which is a good substrate for the muscle.</p>\n\n\n\n<p>‘We demonstrated that MCTs were rapidly used and they could be a good alternative fuel. However, it’s pointless even thinking about additional fuels if you don’t have a perfect fuelling plan in the first place.</p>\n\n\n\n<p>‘All the rest is just icing on a cake. Often people forget about the cake and all they want to do is talk about the icing. This is the case with ketones.’</p>\n\n\n\n<h2>So does that mean Bigard is wrong?</h2>\n\n\n\n<p>It’s true that the benefits of ketones are equivocal, but these are still relatively early days in their evolution. According to Professor Clarke they were first used in 2012 at the Tour de France and the Olympics.</p>\n\n\n\n<p>British Cycling later revealed it was involved in a ketone trial that year but didn’t specify which Olympic disciplines. Team Sky denied using them.</p>\n\n\n\n<p>Since then, further research into dosages and timings have suggested ketones have a role to play in performance, albeit potentially between sessions rather than during…</p>\n\n\n\n<h2>Tell me more…</h2>\n\n\n\n<p>‘Recovery is arguably where ketones deliver their greatest gains,’ says Hespel. ‘Our subjects undertook intense exercise to deplete their glycogen stores and then consumed a ketone ester during their recovery. We showed that muscle protein synthesis rates were higher.’</p>\n\n\n\n<p>In short, ketones began the process of repairing and rebuilding muscle faster, making it look like an attractive substance for multi-stage races.</p>\n\n\n\n<p>Hespel and his research group dug down deeper by roughly mimicking the training loads of riding the Tour on super-fit recreational riders, specifically so that volume and intensity nearly reached overtraining levels over a three-week period.</p>\n\n\n\n<p>The subjects were split into two groups: one consumed a daily placebo, one a ketone ester. ‘The ketone group increased their calorie intake but the control group didn’t,’ Hespel adds.</p>\n\n\n\n<p>That’s important, says former pro cyclist Greg Henderson. ‘You’re so fatigued and sick of eating. You need to fuel on the bike, as well as before, after and between stages… you become sick of eating. It’s hard to keep on top of eating.’</p>\n\n\n\n<p>Lack of nutrition impairs sleep, recovery and level of effort the following day. Ketones were demonstrated to have no negative effect on the desire to eat, and so helped accelerate recovery. More recently, Hespel has also shown a during-ride improvement by combining ketones and sodium bicarbonate.</p>\n\n\n\n<h2>You keep mentioning ketone ester. What is it?</h2>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032823/legal_doping-970x699.jpg\" alt=\"legal_doping\" /></figure>\n\n\n\n<p>Ketone esters are the purest form of ketones compared to ketone salts. ‘Often ketone salts are cheaper supplements and only deliver small amounts of ketone bodies with relatively large amounts of salt,’ says Jeukendrup.</p>\n\n\n\n<p>‘We use esters in our research as we’re looking to raise blood-ketone concentration to over 3mmol per litre of blood,’ says Hespel. ‘Any less than that – including levels seen on a ketogenic diet – and any effect is much smaller.’</p>\n\n\n\n<p>It’s why Hespel labels the commercialising of ketones as ‘the Wild West’, with numerous products on the market that simply won’t tap into the already contested claims.</p>\n\n\n\n<p>‘Often we’d use at least 25g of ketone ester whereas some products are less than 5g. I don’t think there’s any scientific evidence that this nominal amount improves performance.’</p>\n\n\n\n<h2>So do ketones have benefits for the recreational cyclist?</h2>\n\n\n\n<p>If you’re a Cat-1 cyclist undertaking a multi-day event and you’ve already ticked off all the textbook nutritional boxes, then maybe. For the rest of us, a rounded diet and solid on-bike fuelling strategy is of much greater importance.</p>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032825/hvmn-ketones-970x758.jpg\" alt=\"hvmn-ketones\" /></figure>\n\n\n\n<p>If you do flirt with the world of ketones, the choice on the market is flourishing.</p>\n\n\n\n<p>A <a href=\"https://hvmn.me/CYCLIST\" target=\"_blank\">three-pack of HVMN Ketone-IQ</a> for example will set you back $120 (or $108 if you sign up for a subscription). A bottle contains ten 35ml servings, with 10g of ketones in each.</p>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03032827/g-ketone-performance.jpg\" alt=\"g-ketone-performance\" /></figure>\n\n\n\n<p>Meanwhile three servings of <a href=\"https://www.deltagketones.com/products/g-ketone-performance\" target=\"_blank\">DeltaG G Ketone Performance</a> (25g of ketones per bottle) created by Oxford University’s Professor Clarke costs $85.</p>\n\n\n\n<p>Brand recommendations will vary but athletes are advised to take one bottle of the latter 30 minutes before exercise, followed by a serving every two hours, so it’s fair to say ketones will be prohibitively expensive for the majority of cyclists.</p>\n\n\n\n<p>‘The cost will eventually come down but it’s expensive to produce legitimate ketone products,’ says Hespel.</p>\n\n\n\n<p>Still, while ketones remain legal in a sport of marginal gains, it’s unlikely we’ve heard the last of them.</p>\n\n\n\n<p><em>Here’s your next read: <a href=\"https://www.cyclist.co.uk/in-depth/we-tried-legal-doping-and-this-is-what-happened\" target=\"_blank\">We tried legal doping, and this is what happened</a></em></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/what-are-ketones-cycling\">Ketones for cycling: What are they, do they work and are they banned?</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Martin James","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"462de979aced0aa2662fe750702148670e7a1dc280a04205732850cf749a7a94","category":"Cycling"}