{"title":"Best road bikes 2021: how to choose the right one for you","link":"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/","date":1624966200000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Wilier-Filante-SLR-02-b60dbd8.jpg?quality=90&amp;resize=620,413\" />                                            <p>While <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/\">road bikes</a> may seem simple, there’s a huge number of things to consider when buying a drop-bar machine and this guide will help you select the best road bike for you.</p>\n<h2>Endurance (sportive) vs. race bike geometry</h2>\n<p>Road bikes fall into two general broad categories; race and endurance.</p>\n<p><strong>Race bikes</strong> put the rider’s torso in a lower, more aerodynamic position and typically have more aggressive geometry for quick handling.</p>\n<p><strong>Endurance bikes</strong> put the rider in a more upright position and the frame angles are a little more relaxed for confidence-inducing stability and long-distance comfort. These are sometimes also known as sportive bikes.</p>\n<p>In either category, you should expect to pay between £500 and £1,000 for a high-quality, entry-level machine that will give years of trouble-free service.</p>\n<p>The best way to learn the difference between the two is to ride both, either through test rides at an event or a shop, or by borrowing a bike from a friend.</p>\n<p>As with any product, bikes come in good/better/best levels.</p>\n<p>The main points of difference are the frame materials (aluminium bikes tend to be cheaper, while carbon fibre frames are lighter but more expensive. Steel and titanium frames tend to be more niche), the parts (strong, light, cheap – pick two) and the wheels (see previous parenthetical).</p>\n<p>A bike’s drivetrain (or transmission) and brakes are collectively referred to as the ‘groupset’. For help with the various technical terms, don’t miss our guide to the <a href=\"https://www.bikeradar.com/features/what-is-a-road-bike/\">anatomy of a bicycle</a>.</p>\n<p>Unsure if a road bike is right for you? Find out <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike/\">what type of bike you should buy</a>. If you’re looking to ride to work, head to our guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/whats-the-best-bike-for-commuting/\">best bike for commuting</a>.</p>\n<section><div>\n        <h3>Best alloy, steel or titanium road bikes</h3>\n<p>Bike frames are made from a variety of materials. We’ve already shortlisted our top-performing aluminium, steel and titanium frames:</p>\n<ul><li><a href=\"https://www.bikeradar.com/features/quick-guide-to-bike-frame-materials/\">Quick guide to frame materials</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-aluminium-road-bikes/\">The best aluminium road bikes</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-steel-road-bikes/\">The best steel road bikes</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-titanium-road-bikes/\">The best titanium road bikes</a></li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Road bike groupsets explained</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The collection of drivetrain and braking components known as the groupset is one important deciding factor in determining the overall cost – and quality – of a road bike.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Road bikes used to be called 10-speeds, referring to the two chainrings up front multiplied by the five cogs in the rear.</p>\n<p><a href=\"https://www.bikeradar.com/news/the-complete-guide-to-bicycle-gears-bicycle-transmissions-explained/\">Road bike gearing</a> has evolved considerably since those days though, and most road bikes now have two chainrings and between nine and 12 cogs– <a href=\"https://www.bikeradar.com/features/rotor-1x13-hydraulic-groupset-weights-price-specs-details/\">or now, even 13</a> – in the rear.</p>\n<p>Shimano and SRAM are, by far, the most common drivetrain brands, although you will also find Campagnolo, Microshift and FSA components out there too.</p>\n<p>In general, endurance bikes have smaller gears, meaning it’s easier to get up hills, while race bikes have larger gears for higher top-end speed.</p>\n<p>Bigger chainrings mean more outright speed (and effort), and smaller chainrings – dubbed compact – mean less effort.</p>\n<p>For a detailed breakdown of the options, see our <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">buyer’s guide to road bike groupsets</a>.</p>\n<h2>How to get the correct road bike size</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A bike fit from a good shop is an invaluable investment.</span></figcaption><span> <i>BikeRadar</i></span></div>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-much-difference-does-a-bike-fit-make/\">Bike fit</a> is critical. A budget road bike that fits you like a glove will feel and handle much better than an ill-fitting superbike.</p>\n<p>While most brands have bike fit charts on their websites, it’s vital to just go and sit on the thing if you are new to cycling.</p>\n<p>Once you learn what fit works for you, you can shop using the charts; in the meantime, try bikes as you would shoes.</p>\n<p>Once you have selected the right size frame – which any good bike shop can help you with – you then need to <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/\">get your bike’s saddle height correct</a> and <a href=\"https://www.bikeradar.com/advice/workshop/how-to-adjust-your-handlebar-height/\">adjust the handlebar height</a> for comfortable riding. Again, a professional fit at a good shop is invaluable here.</p>\n<p>Most good shops will work with you to fine-tune other elements of your fit too, such as the distance to the <a href=\"https://www.bikeradar.com/features/road-bike-handlebars-guide-how-to-choose-the-right-ones/\">handlebar</a>, the angle of the handlebar and even the feel of the saddle.</p>\n<p>Note that saddle preference is highly personal; there’s no universal right answer here. The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-saddles/\">best road bike saddles</a> will be supportive while allowing sufficient blood flow in your delicate areas, and not get in the way of pedalling.</p>\n<p>Many saddles are considered unisex, but some of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-womens-road-bike-saddles/\">best women’s road bike saddles</a> have features specifically tailored to female anatomy.</p>\n<p>Just try a few until you find something comfortable – many saddle manufacturers will also offer demo services via their dealers.</p>\n<h2>What tyres will my road bike come with?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The numbers on the sidewall of the tyre refer to the size of the tyre on the wheel and width of the tyre when inflated. Minimum and maximum air pressure figures are usually printed too.</span></figcaption><span> <i>James Huang / Immediate Media</i></span></div>\n<p>Most road bikes come with slick or very lightly treaded tyres.</p>\n<p>In recent years, it’s become more common to spec wider tyres on road bikes. Race bikes are often fitted with 25mm-wide tyres, while endurance bikes come with 28mm or even 32mm tyres.</p>\n<p>Regardless of the width, all of these tyres will roll fast and the wider tyres give you a little more cushioning (and speed over rougher road surfaces) in exchange for a little more weight.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">best road bike tyres</a> will offer a combination of speed (low rolling resistance), grip, and puncture resistance.</p>\n<p>Tyres are one of the easiest things to change, so you don’t need to worry much about what the bike comes with. That said, if you are keen on maximising the comfort of your bike, make sure the frame has clearance for wider tyres.</p>\n<p>Again, race bikes that favour aerodynamics will typically skew towards skinny tyres, while the endurance bikes that deliver comfort will generally have plump rubber.</p>\n<p>If you’re unsure <a href=\"https://www.bikeradar.com/features/how-to-inflate-a-bicycle-tyre-everything-you-need-to-know-about-pumps-valves-pressure-and-more/\">how to pump up your tyres</a>, check out our comprehensive article.</p>\n<h2>Should I buy a road bike with rim or disc brakes?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Many modern road bikes now feature disc brakes.</span></figcaption><span> <i>Tom Wragg</i></span></div>\n<p>For decades, road bikes used caliper rim brakes, where blocks of rubber squeezed against the rims.</p>\n<p>Now, however, the majority of mid-range and high-end road bikes come equipped with disc brakes, which have been used on mountain bikes for many years.</p>\n<p>The <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">disc brakes vs. rim brakes</a> debate is endless but, in short, discs offer superior braking in wet weather, but are heavier and slightly more hassle to maintain.</p>\n<p>Rim brakes are still common on more affordable bikes, and they remain a perfectly viable option for many riders.</p>\n<p>Note that the majority of rim brake bikes cannot be converted to discs and vice versa, so once you’ve made your choice, you’re committed to it.</p>\n<h2>What do I need to go on a road ride?</h2>\n<p>Your road bike will come nearly complete, but you will still need to purchase a few things before you go for your <a href=\"https://www.bikeradar.com/features/routes-and-rides/how-to-plan-your-first-road-bike-ride/\">first road bike ride</a>, including <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bottle-cages/\">water bottle cages</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-water-bottles/\">water bottles</a>, supplies to <a href=\"https://www.bikeradar.com/advice/workshop/how-to-fix-a-puncture-video/\">fix a flat tyre</a> (<a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tube</a>, <a href=\"https://www.bikeradar.com/features/6-of-the-best-tyre-levers/\">tyre levers</a>, a <a href=\"https://www.bikeradar.com/advice/buyers-guides/6-of-the-best-co2-inflators/\">CO2 inflator</a> and/or a <a href=\"https://www.bikeradar.com/advice/buyers-guides/how-to-choose-a-bicycle-pump/\">pump</a>) and perhaps a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-saddle-bags/\">saddle bag</a>.</p>\n<p>If you buy at a shop they will be glad to set you up with these things.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Clipless (i.e. clip-in) pedals are a very worthwhile investment.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Most bikes will come with a set of cheap plastic pedals and these won’t stop you enjoying your road bike, but investing in a set of <a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\">clip-in (confusingly known as clipless) pedals</a> will massively improve performance and control.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-pedals/\">best road bike pedals</a> make a real difference to your riding experience and most riders adapt quickly to <a href=\"https://www.bikeradar.com/features/how-to-use-clipless-pedals/\">using clipless pedals</a>.</p>\n<h2>Best cheap road bikes – best road bikes under £750</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The RC120 is one of Triban’s cheapest bikes, but it’s a great place to get started with road riding.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Getting into road riding needn’t cost you a fortune. Even just £350 will buy you a bike that will get you started with the world of road riding, although spending even slightly more will get you a significantly better bike.</p>\n<p>Our full buyer’s guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cheap-road-bikes/\">best cheap road bikes</a> is a great place to start, and we’ve got <a href=\"https://www.bikeradar.com/features/how-to-buy-a-used-or-second-hand-bike-online/\">tips for second-hand bike buyers</a> too.</p>\n<h2>Best road bikes under £1,000</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> £1,000 gets you access to some very tasty machinery in 2021.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-under-1000/\">best road bikes under £1,000</a> are a great place to start if you have a bit more cash and are new to cycling, or if you’re unsure how much riding you’re actually going to be doing.</p>\n<h2>Best road bikes under £2,000</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> £2,000 gets you a whole load of bike nowadays.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>The pro-level superbikes that fall into the price range beyond this bracket are truly amazing and it’s easy to be tempted by them.</p>\n<p>But don’t worry if you can’t get your hands on one without remortgaging your house because the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-under-2000/\">best road bikes under £2,000</a> still bring you into serious – and seriously good – bike territory.</p>\n<h2>Best road bikes under £3,000</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Bikes for under £3,000 are now incredibly good.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>This sort of price range used to be the sole preserve of the dedicated race bike. But the profile of this section of the market has now changed and the <a href=\"https://www.bikeradar.com/features/best-road-bike-under-3000/\">best road bike under £3,000</a> is now just as likely to be a sportive/endurance model.</p>\n<h2>BikeRadar’s 2021 Road Bike of the Year</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Boardman SLR 9.4 AXS was our 2021 Road Bike of the Year winner.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>A special place must be reserved for the overall winner of our Bike of the Year award. For 2021 that title was awarded to the outstanding <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/boardman-slr-9-4-axs-disc-carbon-review/\">Boardman SLR 9.4 AXS Disc Carbon</a>.</p>\n<p>You can find all of the bikes shortlisted for our awards in our <a href=\"https://www.bikeradar.com/news/2021-road-bike-of-the-year/\">BikeRadar Bike of the Year 2021</a> feature.</p>","author":"Jack Luke","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"4633eb57ff7977f16f673c00d7fa02764e08a6cf32b2eca2bd77c27dfa18dbf9","category":"Cycling"}