{"title":"Pro-Russian hackers target elected US officials supporting Ukraine","link":"https://arstechnica.com/?p=1927817","date":1680178757000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/03/russiaflag-800x556.jpeg\" alt=\"Locked out.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/03/russiaflag.jpeg\">Enlarge</a> <span>/</span> Locked out. (credit: <a href=\"https://www.gettyimages.com/search/photographer?assettype=image&amp;family=creative&amp;license=rf&amp;photographer=SEAN%20GLADWELL&amp;sort=best#license\">Sean Gladwell / Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Threat actors aligned with Russia and Belarus are targeting elected US officials supporting Ukraine, using attacks that attempt to compromise their email accounts, researchers from security firm Proofpoint said.</p>\n<p>The campaign, which also targets officials of European nations, uses malicious JavaScript that’s customized for individual webmail portals belonging to various NATO-aligned organizations, a <a href=\"https://www.proofpoint.com/us/blog/threat-insight/exploitation-dish-best-served-cold-winter-vivern-uses-known-zimbra-vulnerability\">report</a> Proofpoint published Thursday said. The threat actor—which Proofpoint has tracked since 2021 under the name TA473—employs sustained reconnaissance and painstaking research to ensure the scripts steal targets’ usernames, passwords, and other sensitive login credentials as intended on each publicly exposed webmail portal being targeted.</p>\n<h2>Tenacious targeting</h2>\n<p>“This actor has been tenacious in its targeting of American and European officials as well as military and diplomatic personnel in Europe,” Proofpoint threat researcher Michael Raggi wrote in an email. “Since late 2022, TA473 has invested an ample amount of time studying the webmail portals of European government entities and scanning publicly facing infrastructure for vulnerabilities all in an effort to ultimately gain access to emails of those closely involved in government affairs and the Russia-Ukraine war.”</p></div><p><a href=\"https://arstechnica.com/?p=1927817#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927817&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4635ca925507b3db1e605b67590257808913d0e1f24cfdab03167065a14b37a8","category":"Tech"}