{"title":"Elite’s New Training Desk: First Look","link":"https://www.dcrainmaker.com/2021/09/elites-new-training-desk-first-look.html","date":1631040903000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/09/IMG_0135.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/IMG_0135_thumb.jpg\" /></a></p>\n<p>Elite showed off their new trainer desk at Eurobike, which includes multiple power ports, and the ability to fold up for easy storage. It maintains the same style as both their Tuo trainer as well as their <a href=\"https://www.dcrainmaker.com/2021/07/elite-rizer-review-steering-simulation-accessory.html\">RIZER gradient/steering accessory</a> (and also, their slightly more expensive <a href=\"https://www.dcrainmaker.com/2018/07/elite-fouripista-14000eur-indoor-smart-bike-first-ride-and-specs.html\">14,000€ Fuoripista smart bike</a>). Except, unlike all of those products, it lacks a name we collectively struggle to pronounce. It’s simply named ‘Training Desk’. Actually, technically it’s in all caps, like an old man screaming – TRAINING DESK – but hey, at least it has all its vowels intact.</p>\n<p>While I’ll have a full actual-usage review of the new Elite trainer desk at some point between here and the future, for now I got to poke at it while at Eurobike. So consider this just a quick peek at things till I get a unit in the DCR Cave to run through its paces.</p>\n<p>Note that this, combined with Elite’s earlier RIZER gradient and steering simulator make up Elite’s announcements for Eurobike and the upcoming ‘indoor trainer season’ (as much as that concept is fading…aka…winter). This is likely a pattern we’ll see throughout the rest of the indoor trainer industry. Demand is extremely high, and many of these companies have sold out distributor/retailer allocations well into next year for new products, based on the maximum they can find ways to manufacture (which, like everyone else, is limited by ‘all the things’ these days).</p>\n<h3><span>The Specs:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/IMG_0130.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/IMG_0130_thumb.jpg\" /></a></p>\n<p>Look, this post won’t take long. I promise. Starting from the ground up, it sits on three swiveling wheels that allow it to be rolled around. The two legs are made of steel, and wood (bamboo, specifically).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/IMG_0138.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/IMG_0138_thumb.jpg\" /></a></p>\n<p>The main pole that supports the desk (also metal) is adjustable and can go from a minimum height of 75cm (29.5”) to 120cm (47.2”).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/IMG_0133.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/IMG_0133_thumb.jpg\" /></a></p>\n<p>Atop that, is the table portion. This supports a load of 20kg (44lbs) – which should be enough for even the <a href=\"https://amzn.to/2VlBrUT\">largest Haribo containers I can find</a>, as well as a laptop and a few bottles of Prosecco. All our usual indoor training essentials.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/IMG_0141.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/IMG_0141_thumb.jpg\" /></a></p>\n<p>Inside that bamboo topped desk are three power outlets, plus an on/off switch. In fact, below the wooden base is a larger empty area for you to rats-nest a bunch of cables as you see fit.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/IMG_0148.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/IMG_0148_thumb.jpg\" /></a></p>\n<p>There are little grooves cut in the top so you can hide the cabling and just have the charger part sticking out on the desk.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/IMG_0146.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/IMG_0146_thumb.jpg\" /></a></p>\n<p>On top of the desk you’ll get two non-slip pads for your laptop and phone, plus an actual wooden phone or tablet holder.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/IMG_0136.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/IMG_0136_thumb.jpg\" /></a></p>\n<p>About the only immediate downside I’m spotting is that there isn’t internal cabling routing down to the ground. Elite includes two Velcro straps so you can make it as tidy as possible yourself, but internal cable routing would have been a nice touch at this price point. Also, I caught Elite pretty early in the show (right at open), so they hadn’t quite put on their Cable Guy hat yet and made the wiring look crispy. Plus, it also didn’t help matters that I made them take it apart (break it down) too:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/IMG_0142.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/IMG_0142_thumb.jpg\" /></a></p>\n<p>The desk can fold up for storage, which should look like this picture from Elite’s site once you finish doing so:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb.png\" /></a></p>\n<p>One of the things that is slightly advantageous about this design is that there isn’t a direct dependency on front-wheel forward space clearance, or any point that could be impacted on a rocker plate. Some desks can be a bit more tricky there, but this should resolve that. But I’ll have to dig into those aspects once I have it in the Cave.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/IMG_0144.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/IMG_0144_thumb.jpg\" /></a></p>\n<p>Now, like many premium-looking indoor trainer accessories, this one isn’t cheap. It’ll set you back 299EUR, or $399USD. Elite says the US pricing is beholden to the same increases as the RIZER was, due to the 400% increase in shipping costs over the past year. Still, Elite says there’s already significant distributor and retailer interest, and that the first batches arriving this month in stores are already spoken for. And I will say that based on briefly poking at it during the show, it feels well built.</p>\n<p>This post though reminded me I still haven’t written up about the Saris TD1 desk, which I unboxed this past winter/spring (with much frustration, as folks saw on my Instagram stories at the time). I’ve been using it here and there since. I’m hopeful that Elite’s high-priced option will be better engineered and quality-controlled than the Saris one I received (an abnormality for Saris, which usually produces well made/engineered items). At first glance, the Elite desk seems to be – but the proof in the tiramisu will be getting it into the DCR Cave, assembling it, and using it. Which, should be very soon.</p>\n<p>Else, I think the cheaper plastic/metal options from <a href=\"https://www.dcrainmaker.com/2021/03/kom-cycling-trainer-media-deskreview.html\">KOM Cycling</a> and <a href=\"https://www.dcrainmaker.com/2020/09/rad-lifeline-conquer-cycling-trainer-desk-cheaper-wahoo-desk.html\">RAD Cycling/etc</a> will continue to reign supreme in finding reasonable bike/trainer-specific desks. Still, I’m all about power outlets, and that’s something those lower-priced offerings don’t have. Nor of course, do they have the style that’s shown here.</p>\n<p>With that – thanks for reading!</p>","author":"Ray Maker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"463cec7966a9a0b7865c3e2f373a0c638c56e1ff99fdb84e0dde78d22baab6e3","category":"Cycling"}