{"title":"Apple Watch Series 7 sports a larger screen, faster charging","link":"https://www.macworld.com/article/357613/apple-watch-series-7-design-display-features.html","date":1631644560000,"content":"<div>\n<section><div></div></section><p>At Apple’s “California streaming” event on Tuesday, the company took the wraps off of the Apple Watch Series 7, the latest flagship in its wearable lineup. The Series 7 goes on sale on Friday, September 17, with prices starting at $399. However, Apple did not set an actual ship date, stating that the Series 7 will start shipping later this fall.</p>\n\n\n\n<h2>Apple Watch Series 7: Design and display</h2>\n\n\n\n<p>The Apple Watch Series 7 watch features 41mm and 45mm screens, the largest models Apple has ever made. The company says that the Series 7 display is 20 percent larger than the Series 6 and 50 percent larger than the Apple Watch SE. However, the watch itself hasn’t increased much in size—Apple achieves the 1mm increase by shrinking the bezel to 1.7mm.</p>\n\n\n\n<p>Apple is releasing several new features that take advantage of the larger screen. There’s now a full on-screen keyboard that supports the QuickPath entry method. And several new watch faces display more information. Apple also made the buttons within some apps on the Series 7 larger so they’re easier to press.</p>\n\n\n\n<p>The watch has a slightly updated design with three all-new colors: green, midnight blue, and starlight. Apple calls the Series 7 its most durable watch, with an IP6x durability rating (the 6 rating indicates that it is dust-tight). It also has a new crack-resistant display and 50-meter water resistance like the Series 6.</p>\n\n\n\n<h2>Apple Watch Series 7: Faster charging</h2>\n\n\n\n<p>Apple says that the Apple Watch Series 7 offers improved charging speed through its magnetic charger. During the event, Apple said that the Series 7 is 33 percent faster, and with eight minutes of charging, the Series 7 will last for a full eight hours of sleep tracking.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/apple-watch-series-7-features.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<h2>Apple Watch Series 7: New fitness features</h2>\n\n\n\n<p>Apple continues to add more fitness features with each new Apple Watch. The Series 7 now has features for cyclists, with the ability to start and stop tracking in sync with your ride, fall detection, e-bike support, and more.</p>\n\n\n\n<p>Apple is also including more features that work with the Fitness+ service. Fitness+ will have Pilates and a set of workouts to get ready for the snow season as well as guided meditations. All Apple Watch Series 7 users will get three months of free Fitness+.</p>\n\n\n\n<h2>Apple Watch Series 7: Price and availability</h2>\n\n\n\n<p>The Apple Watch Series 7 starts at the same $399 and will be available for preorder beginning on Friday, September 17. However, Apple hasn’t yet announced when the watch will ship, only saying it will be available “later this fall.” Apple is also continuing to sell the Apple Watch 3 for $199 and the Apple Watch SE for $279.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"464422831672ba4f36a1f58154e110c27868a164157b4af26508139e67fd4430","category":"Apple"}