{"title":"Effect of ultrasound combined with pineapple protease treatment on the tenderness of dried shrimp","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13277?af=R","date":1712768606000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>In order to improve the tenderness of dried shrimp products as well as to reduce the hardness of the meat during the drying process, shrimp were treated with ultrasound combined with pineapple protease and the tenderization condition was optimized by measuring the texture and shear force of dried shrimp. In addition, the sulfhydryl content, myofibril fragmentation index (MFI) and microstructure were also examined to clarify the mechanisms of shrimp tenderization.</p>\n<h2>RESULTS</h2>\n<p>The results showed UB1 group with ultrasonic power of 100 W, heating temperature of 50 °C and pineapple protease concentration of 20 U mL<sup>−1</sup> were the optimum tenderization conditions, where shrimp showed the lowest hardness (490.76 g) and shear force (2006.35 gf). Microstructure as well as sodium dodecyl sulfate–polyacrylamide gel electrophoresis results suggested that during the tenderization process the muscle segments of shrimps were broken, degradation of myofibrillar proteins occurred, and MFI values and total sulfhydryl content increased significantly (<i>P</i> &lt; 0.05) (MFI value = 193.6 and total sulfhydryl content = 93.93 mmol mg<sup>−1</sup> protein for UB 1 group).</p>\n<h2>CONCLUSION</h2>\n<p>Ultrasound combined with bromelain could be used as a simple and effective tenderization method for the production of tender dried shrimp. The best conditions were 100 W ultrasonic power, 50 °C ultrasonic temperature, and 20 U mL<sup>−1</sup> bromelain. © 2024 Society of Chemical Industry.</p>","author":"Xinyi Zhou, \nJian Wang, \nJingxu Zhao, \nChunhong Yuan, \nXiaojun Zhang, \nTao Huang, \nWenge Yang, \nHuamao Wei","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"46462df116f8902a85afd7c25c6b51493a7c2565c31a5457b03bd50b5bea6dd3","category":"Environment"}