{"title":"Inferred drought‐induced plant allocation shifts and their impact on drought legacy at a tropical forest site","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17287?af=R","date":1714658996000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/30d383cf-fbfa-473b-aeb7-1a7881be9f96/gcb17287-toc-0001-m.png\" alt=\"Inferred drought-induced plant allocation shifts and their impact on drought legacy at a tropical forest site\" />\n<p>At a wet location in the tropics, we demonstrate that changes in how plants allocate carbon (for growth or respiration) can be determined using model data fusion (constraining model runs with observations through a Bayesian statistical method), rather than relying on difficult direct measurements. The models show that changes in plant growth at this site significantly reduced the plant's ability to absorb carbon after a drought. This reduction was due to decreased leaf allocation that lowers photosynthesis and increased root allocation that enhances carbon release into the atmosphere through more litter production and decomposition.</p>\n<br />\n<h2>Abstract</h2>\n<p>While droughts predominantly induce immediate reductions in plant carbon uptake, they can also exert long-lasting effects on carbon fluxes through associated changes in leaf area, soil carbon, etc. Among other mechanisms, shifts in carbon allocation due to water stress can contribute to the legacy effects of drought on carbon fluxes. However, the magnitude and impact of these allocation shifts on carbon fluxes and pools remain poorly understood. Using data from a wet tropical flux tower site in French Guiana, we demonstrate that drought-induced carbon allocation shifts can be reliably inferred by assimilating Net Biosphere Exchange (NBE) and other observations within the CARbon DAta MOdel fraMework. This model-data fusion system allows inference of optimized carbon and water cycle parameters and states from multiple observational data streams. We then examined how these inferred shifts affected the duration and magnitude of drought's impact on NBE during and after the extreme event. Compared to a static allocation scheme analogous to those typically implemented in land surface models, dynamic allocation reduced average carbon uptake during drought recovery by a factor of 2.8. Additionally, the dynamic model extended the average recovery time by 5 months. The inferred allocation shifts influenced the post-drought period by altering foliage and fine root pools, which in turn modulated gross primary productivity and heterotrophic respiration for up to a decade. These changes can create a bust-boom cycle where carbon uptake is enhanced some years after a drought, compared to what would have occurred under drought-free conditions. Overall, allocation shifts accounted for 65% [45%–75%] of drought legacy effects in modeled NBE. In summary, drought-induced carbon allocation shifts can play a substantial role in the enduring influence of drought on cumulative land-atmosphere CO<sub>2</sub> exchanges and should be accounted for in ecosystem models.</p>","author":"Matthew A. Worden, \nCaroline A. Famiglietti, \nPaul A. Levine, \nShuang Ma, \nA. Anthony Bloom, \nDamien Bonal, \nClément Stahl, \nAlexandra G. Konings","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"4647d26e2b92d46dd08307d1ae8f487104a0e42d0371d281ee1a4e7f72d5c0b8","category":"Environment"}