{"title":"Antibiotic resistance alters the ability of Pseudomonas aeruginosa to invade bacteria from the respiratory microbiome","link":"https://academic.oup.com/evlett/article/8/5/735/7701827?rss=1","date":1719705600000,"content":"<span><div>Abstract</div>The emergence and spread of antibiotic resistance in bacterial pathogens is a global health threat. One important unanswered question is how antibiotic resistance influences the ability of a pathogen to invade the host-associated microbiome. Here we investigate how antibiotic resistance impacts the ability of a bacterial pathogen to invade bacteria from the microbiome, using the opportunistic bacterial pathogen <span>Pseudomonas aeruginosa</span> and the respiratory microbiome as our model system. We measure the ability of <span>P. aeruginosa</span> spontaneous antibiotic-resistant mutants to invade pre-established cultures of commensal respiratory microbes in an assay that allows us to link specific resistance mutations with changes in invasion ability. While commensal respiratory microbes tend to provide some degree of resistance to <span>P. aeruginosa</span> invasion, antibiotic resistance is a double-edged sword that can either help or hinder the ability of <span>P. aeruginosa</span> to invade. The directionality of this help or hindrance depends on both <span>P. aeruginosa</span> genotype and respiratory microbe identity. Specific resistance mutations in genes involved in multidrug efflux pump regulation are shown to facilitate the invasion of <span>P. aeruginosa</span> into <span>Staphylococcus lugdunensis</span>, yet impair invasion into <span>Rothia mucilaginosa</span> and <span>Staphylococcus epidermidis</span>. <span>Streptococcus</span> species provide the strongest resistance to <span>P. aeruginosa</span> invasion, and this is maintained regardless of antibiotic resistance genotype. Our study demonstrates how the cost of mutations that provide enhanced antibiotic resistance in <span>P. aeruginosa</span> can crucially depend on community context. We suggest that attempts to manipulate the microbiome should focus on promoting the growth of commensals that can increase the fitness costs associated with antibiotic resistance and provide robust inhibition of both wildtype and antibiotic-resistant pathogen strains.</span>","author":"","siteTitle":"Evolution Letters Current Issue","siteHash":"ccc44437a8276654c44dddd156a8ce3b5dae5730f1c2406ed04aa90599bdf071","entryHash":"4650dac92c5e18a3caf7adaf95af294572121f18c02ebd54c625347a5009b739","category":"Environment"}