{"title":"Pain and fatigue in adult patients with multiple osteochondromas: The Netherlands","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305640","date":1721224800000,"content":"<p>by Ihsane Amajjar, Kuni Vergauwen, Nienke W. Willigenburg, S. John Ham, Rob J. E. M. Smeets</p>\r\nBackground <p>Multiple Osteochondromas (MO) is a rare genetic disorder characterised by the presence of numerous benign bone tumours, known as osteochondromas. Within the spectrum of debilitating symptoms associated with MO, pain is recognized as a major problem. Interestingly, our clinical observations suggest that fatigue is also a significant concern but has merely been touched upon in MO literature. This study aims to (1) assess the level of pain and fatigue in adult patients with MO; (2) compare fatigue in MO to healthy subjects and patients with Rheumatoid Arthritis (RA); (3) identify associated variables for pain and fatigue in patients with MO.</p> Methods <p>In this cross-sectional study, 353 adult MO patients completed a survey with validated questionnaires on pain, fatigue and psychosocial factors. Pain and fatigue were assessed with the Numeric Rating Scale (NRS), and fatigue was also measured with the Checklist Individual Strength (CIS). Fatigue (CIS) was compared with reference scores of healthy subjects and patients with RA, using a one-sample t-test. Multiple linear regression models for pain and fatigue were developed using a-priori selected independent variables based on a theoretical framework (ICF-model).</p> Results <p>Pain was reported by 87.8% (NRS = 3.19±2.6) and fatigue by 90.4% (NRS = 4.1±2.6) of patients with MO. Fatigue scores for MO (CIS = 84.1±15.3) were significantly higher (p&lt;0.001) compared to reference scores of healthy subjects and patients with RA. The multivariable analysis for pain provided a final regression model with six variables (R<sup>2</sup> = 0.445, p&lt;0.001) of which fear avoidance beliefs and fatigue had the strongest association. For the fatigue models NRS (R<sup>2</sup> = 0.455, p&lt;0.001) and CIS (R<sup>2</sup> = 0.233, p&lt;0.001), the strongest associations were found with anxiety and depression respectively.</p> Conclusions <p>Pain and fatigue are highly prevalent in patients with MO. Fatigue is significantly higher compared to healthy subjects and patients with RA. Several variables associated with pain and fatigue have been identified that could help improve multidisciplinary treatment plans.</p>","author":"Ihsane Amajjar","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"465bd5247068af6bb7caf013b81f2080346e24ede9717613d18e88533890d6eb","category":"Interdisciplinary"}