{"title":"Biases and limitations in observational studies of Long COVID prevalence and risk factors: A rapid systematic umbrella review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302408","date":1714658400000,"content":"<p>by Miao Jenny Hua, Gisela Butera, Oluwaseun Akinyemi, Deborah Porterfield</p>\r\nBackground <p>Observational studies form the foundation of Long COVID knowledge, however combining data from Long COVID observational studies has multiple methodological challenges. This umbrella review synthesizes estimates of Long COVID prevalence and risk factors as well as biases and limitations in the primary and review literatures.</p> Methods and findings <p>A systematic literature search was conducted using multiple electronic databases (PubMed, EMBASE, LitCOVID) from Jan 1, 2019 until June 9, 2023. Eligible studies were systematic reviews including adult populations assessed for at least one Long COVID symptom four weeks or more after SARS-CoV-2 infection. Overall and subgroup prevalence and risk factors as well as risk of bias (ROB) assessments were extracted and descriptively analyzed. The protocol was registered with PROSPERO (CRD42023434323). Fourteen reviews of 5–196 primary studies were included: 8 reported on Long COVID prevalence, 5 on risk/protective factors, and 1 on both. Prevalence of at least 1 Long COVID symptom ranged from 21% (IQR: 8.9%-35%) to 74.5% (95% CI: 55.6%-78.0%). Risk factor reviews found significant associations between vaccination status, sex, acute COVID-19 severity, and comorbidities. Both prevalence and risk factor reviews frequently identified selection and ascertainment biases. Using the AMSTAR 2 criteria, the quality of included reviews, particularly the prevalence reviews, were concerning for the adequacy of ROB assessments and justifications for conducting meta-analysis.</p> Conclusion <p>A high level of heterogeneity render the interpretation of pooled prevalence estimates of Long COVID challenging, further hampered by the lack of robust critical appraisals in the included reviews. Risk factor reviews were of higher quality overall and suggested consistent associations between Long COVID risk and patient characteristics.</p>","author":"Miao Jenny Hua","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"465c6472d6248acc08ce1fa463a5b3a4902fb1b0c7ed73e74e71a25afa4f1531","category":"Interdisciplinary"}