{"title":"Correlations between Achilles tendon moment arm and plantarflexor muscle architecture variables","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309406","date":1724940000000,"content":"<p>by Logan Faux-Dugan, Stephen J. Piazza</p>\r\n\r\nThe production of triceps surae plantarflexion moment is complex in that the Achilles tendon moment arm affects the Achilles tendon force by determining the muscle length change and shortening velocity during ankle rotation. In addition, there is evidence for associations between the sizes of muscles and their moment arm at the joints they span. These relationships between muscle architecture and tendon moment arm ultimately affect the muscle’s force generating capacity and are thus important for understanding the roles played by muscles in producing locomotion. The purpose of this study was to investigate <i>in vivo</i> the relationship between architecture of two plantarflexors and the Achilles tendon moment arm in a healthy adult population. Ultrasound-based measurements were made of the architecture (fascicle length, muscle volume, physiological cross-sectional area, and anatomical cross-sectional area) of the lateral and medial gastrocnemius and the Achilles tendon moment arm was assessed using a technique that combined ultrasound imaging and motion analysis. Positive correlations were observed between the length (r = 0.499, p = 0.049) and size variables (muscle volume r = 0.621, p = 0.010; ACSA r = 0.536, p = 0.032) of the lateral gastrocnemius and the Achilles tendon moment arm, but correlations were only observed for size variables (muscle volume r = 0.638, p = 0.008; PCSA r = 0.525, p = 0.037; ACSA r = 0.544, p = 0.029), and not the length, of the medial gastrocnemius. These findings suggest lateral gastrocnemius adapts to moment arms to maintain force production throughout the range of motion across individuals, while the medial gastrocnemius does not and is thus better suited for static force generation.","author":"Logan Faux-Dugan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"465e1241a99e88f3ac0e3627ed55e42657183fe15965a83451de9cb369cf4c4e","category":"Interdisciplinary"}