{"title":"Apple Says Vision Pro Does Not Support Hard Contact Lenses","link":"https://www.macrumors.com/2024/01/19/apple-says-vision-pro-no-hard-contact-lenses/","date":1705671186000,"content":"<a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> should not be used while wearing hard contact lenses, Apple says in its pre-order process for its new spatial computing headset.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/apple-vision-pro-eye.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nAccording to a <a href=\"https://support.apple.com/en-us/HT213965?cid=mc-ols-visionpro-article_ht213965-buy_flow-11182023\">new linked support document</a>, wearing hard contacts \"might impact your experience with ‌Apple Vision Pro‌.\" Apple goes on to suggest that those who use such contacts when not wearing glasses may be able to use ZEISS Optical Inserts instead. \r<br />\n<blockquote>If you experience difficulty with eye tracking, and your eye care provider has indicated that eye glasses with a comprehensive prescription are an option for you, then you may consider ordering ZEISS Optical Inserts. Otherwise, you may use an alternate form of input such as Pointer Control. </blockquote>For users who have had monovision corrective surgery, Apple recommends that they consult with an eye care provider for a comprehensive prescription that works within the supported prescription range for ‌Apple Vision Pro‌. Apple also says that ‌Apple Vision Pro‌ works well with most soft contact lenses, but cosmetic contact lenses are not compatible with the headset and should be removed before using the device. \r<br />\n\r<br />\nApple also offers the following advice for people with a diagnosed vision condition:\r<br />\n<blockquote>Some medical conditions, such as those involving eyelid drooping, changes in eye alignment (including strabismus or lazy eye), or uncontrolled eye movements (including nystagmus) might make it difficult for Apple Vision Pro to properly detect your eyes. This might impact the visual experience.</blockquote>Apple says that to compensate for any of the above, users can adapt ‌Apple Vision Pro‌ to suit their needs for navigation using the headset's accessibility features. Instead of using their eyes, users can use their wrist, head, index finger, or voice to navigate. \r<br />\n\r<br />\nStarting at $3,499, ‌Apple Vision Pro‌ pre-orders are now open, with the devices scheduled to ship to customers on February 2.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AppleVisionPro\">Vision Pro (Don't Buy)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/19/apple-says-vision-pro-no-hard-contact-lenses/\">Apple Says Vision Pro Does Not Support Hard Contact Lenses</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-says-vision-pro-does-not-support-hard-contact-lenses.2416779/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"46609f8dad701b5f4b4055605167cdbc49590d99043becb799cb0ea1770de940","category":"Apple"}