{"title":"PSLBI-21 Interactive effects of dietary betaine supplementation and soybean hulls inclusion on growth performance and carcass composition of young growing pigs","link":"https://academic.oup.com/jas/article/102/Supplement_3/632/7757552?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Growing barrow pigs [n = 24; Large White x Landrace x Duroc; 29.51 ± 3.24 kg initial body weight (BW)] were assigned to 4 treatments in a 2 x 2 factorial design to evaluate the synergistic effects of dietary levels of betaine (BET; 0 and 0.1%) and soybean hulls (SBH; 0 and 15%) on growth performance and carcass composition. Pigs were blocked by initial BW and housed in individual pens with ad libitum access to feed and water for a 28-d feeding period. Pigs were weighed and feed intake was recorded at 14-d intervals. Real-time ultrasonic (RTU) measurements of the 10th-rib longissimus dorsi muscle area (LMA) and off-midline backfat thickness (BF) were obtained initially and on d 28 for all pigs. Prediction equations were used to estimate total fat tissue (TOFAT) and fat-free total lean (FFTOLN) from the measurements. All data were analyzed using the MIXED procedure of the SAS software. Growth performance data were analyzed as repeated measures on time and carcass data were analyzed as single measures with the respective baseline values used as covariate in the statistical model. There were no SBH x BET interactions for growth response variables. Pig growth was not affected by dietary BET supplementation. During the first 14 d of the study, pigs fed 15% SBH had decreased average daily gain (ADG; <span>P</span> = 0.01), average daily feed intake (ADFI; <span>P</span> = 0.02), and feed efficiency [gain:fee; (G:F;<span>P</span> = 0.04)] when compared with pigs fed diets without SBH. From d 15 to 28, dietary addition of 15% SBH reduced ADFI (<span>P</span> = 0.01), whereas no significant effects on the other growth performance variables were observed. Overall, when compared with pigs fed diets without SBH, pigs fed diets with 15% SBH had reduced feed intake (<span>P</span> = 0.01) and ADG (<span>P</span> = 0.04), which resulted in lighter pigs (<span>P</span> = 0.03) at the completion of the feeding trial. A SBH x BET interaction (<span>P</span> = 0.04) was observed for LMA, with decreased values (<span>P</span> &lt; 0.05) detected for BET-supplemented pigs only when SBH was not included in the diet. No additional carcass composition traits were altered by BET supplementation. Including 15% SBH to the diet decreased BF (<span>P</span> = 0.05) and TOFAT (<span>P</span> = 0.04) in growing pigs. Neither BET supplementation nor SBH inclusion affected FFTOLN. In conclusion, adding supplemental BET to diets with SBH did not synergistically alter nutrient partitioning of young growing pigs. Although no beneficial effects of BET supplementation on growth and carcass composition traits were observed, feeding pigs diets containing 15% SBH resulted in slower growth rates with less fat deposition.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"46672a46774c5ffa96ae7616f9686a8347163010202e8356ac33eb11492febdb","category":"Environment"}