{"title":"Asymmetric effects of hydroclimate extremes on eastern US tree growth: Implications on current demographic shifts and climate variability","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17474?af=R","date":1724137200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/08d94ff1-01f1-40a7-be13-2fbc2cfd3cc9/gcb17474-toc-0001-m.png\" alt=\"Asymmetric effects of hydroclimate extremes on eastern US tree growth: Implications on current demographic shifts and climate variability\" />\n<p>In the eastern United States, land use decisions have impacted what species are present in forests. The climate of the region has also changed and is expected to continue to warm and produce stronger drought stress on forest communities. Using an extensive network of tree-ring records, we found that species that prefer wetter environments, which are becoming more common in forests, are more sensitive to drought. Thus, the ongoing species shift in the eastern United States combined with drier conditions suggests that drought will have an even larger impact on aboveground carbon uptake in the future in the eastern United States.</p>\n<br />\n<h2>Abstract</h2>\n<p>Forests around the world are experiencing changes due to climate variability and human land use. How these changes interact and influence the vulnerability of forests are not well understood. In the eastern United States, well-documented anthropogenic disturbances and land-use decisions, such as logging and fire suppression, have influenced forest species assemblages, leading to a demographic shift from forests dominated by xeric species to those dominated by mesic species. Contemporarily, the climate has changed and is expected to continue to warm and produce higher evaporative demand, imposing stronger drought stress on forest communities. Here, we use an extensive network of tree-ring records from common hardwood species across ~100 sites and ~1300 trees in the eastern United States to examine the magnitude of growth response to both wet and dry climate extremes. We find that growth reductions during drought exceed the positive growth response to pluvials. Mesic species such as <i>Liriodendron tulipifera</i> and <i>Acer saccharum</i>, which are becoming more dominant, are more sensitive to drought than more xeric species, such as oaks (<i>Quercus</i>) and hickory (<i>Carya</i>), especially at moderate and extreme drought intensities. Although more extreme droughts produce a larger annual growth reduction, mild droughts resulted in the largest cumulative growth decreases due to their higher frequency. When using global climate model projections, all scenarios show drought frequency increasing substantially (3–9 times more likely) by 2100. Thus, the ongoing demographic shift toward more mesic species in the eastern United States combined with drier conditions results in larger drought-induced growth declines, suggesting that drought will have an even larger impact on aboveground carbon uptake in the future in the eastern United States.</p>","author":"Justin T. Maxwell, \nTsun Fung Au, \nSteven A. Kannenberg, \nGrant L. Harley, \nMatthew P. Dannenberg, \nDarren L. Ficklin, \nScott M. Robeson, \nMacarena Férriz, \nMichael C. Benson, \nBenjamin R. Lockwood, \nKimberly A. Novick, \nRichard P. Phillips, \nMaegen L. Rochner, \nNeil Pederson","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"4668712dbc241caeb8942c526309503bfaa343c121a0720f633bf917657da987","category":"Environment"}