{"title":"Tree drought–mortality risk depends more on intrinsic species resistance than on stand species diversity","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17503?af=R","date":1727161200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e185f7bc-deb0-4e11-9136-21fb0a6e5508/gcb17503-toc-0001-m.png\" alt=\"Tree drought–mortality risk depends more on intrinsic species resistance than on stand species diversity\" />\n<p>Written Summary: Working with more than 20 species and 5 experimental forests in different European biomes, we show that the risk of a tree dying under extreme drought is mainly determined by its species identity, rather than whether it grows in a monoculture or a mixture. However, even if the effects of species richness are weak on average, certain species mixtures can drastically limit the risk of tree mortality under drought in certain species combinations. Understanding these mechanisms is essential for developing predictive and operational tools for management strategies to adapt forests to extreme drought.</p>\n<br />\n<h2>Abstract</h2>\n<p>Increasing tree diversity is considered a key management option to adapt forests to climate change. However, the effect of species diversity on a forest's ability to cope with extreme drought remains elusive. In this study, we assessed drought tolerance (xylem vulnerability to cavitation) and water stress (water potential), and combined them into a metric of drought–mortality risk (hydraulic safety margin) during extreme 2021 or 2022 summer droughts in five European tree diversity experiments encompassing different biomes. Overall, we found that drought–mortality risk was primarily driven by species identity (56.7% of the total variability), while tree diversity had a much lower effect (8% of the total variability). This result remained valid at the local scale (i.e within experiment) and across the studied European biomes. Tree diversity effect on drought–mortality risk was mediated by changes in water stress intensity, not by changes in xylem vulnerability to cavitation. Significant diversity effects were observed in all experiments, but those effects often varied from positive to negative across mixtures for a given species. Indeed, we found that the composition of the mixtures (i.e., the identities of the species mixed), but not the species richness of the mixture per se, is a driver of tree drought–mortality risk. This calls for a better understanding of the underlying mechanisms before tree diversity can be considered an operational adaption tool to extreme drought. Forest diversification should be considered jointly with management strategies focussed on favouring drought-tolerant species.</p>","author":"Renaud Decarsin, \nJoannès Guillemot, \nGuerric le Maire, \nHaben Blondeel, \nCéline Meredieu, \nEmma Achard, \nDamien Bonal, \nHervé Cochard, \nDéborah Corso, \nSylvain Delzon, \nZoé Doucet, \nArsène Druel, \nCharlotte Grossiord, \nJosé Manuel Torres‐Ruiz, \nJürgen Bauhus, \nDouglas L. Godbold, \nPeter Hajek, \nHervé Jactel, \nJoel Jensen, \nSimone Mereu, \nQuentin Ponette, \nBoris Rewald, \nJulien Ruffault, \nHans Sandén, \nMichael Scherer‐Lorenzen, \nHernán Serrano‐León, \nGuillaume Simioni, \nKris Verheyen, \nRamona Werner, \nNicolas Martin‐StPaul","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"46682cc31f9e86ac72091a2e244125193ae839753dac7723ea8c1d0b63130988","category":"Environment"}