{"title":"Multisensory Eating Experiences in Northern Norway: An Exploratory Study","link":"https://www.preprints.org/manuscript/202405.1438/v1","date":1716366470000,"content":"Intrinsic and extrinsic sensory elements influence our food experiences. However, most research in extrinsic multisensory aspects of food has centered on WEIRD (White, Educated, Industrialized, Rich, and Democratic) urban participants. This study breaks from this by investigating multisensory eating experiences in the context of Northern Norway, a region characterized by distinct seasonal shifts, harsh arctic weather, unique atmospheric phenomena (e.g., the midnight sun and northern lights), limited food growth opportunities, and a rich Sámi cultural heritage. Our exploratory research used participant observation and interviews, involving four researchers from diverse backgrounds who closely examined multisensory food experiences within four Northern Norwegian food-related tourism businesses, all infused with Sámi cultural elements. Four themes emerged: 1) Experience elements, involving elements associated with plants, animals, and non-animate objects. 2) Bipolar concepts, which refer to contradicting dimensions where experience elements varied, notably in the interplay between Sámi and Norwegian traditions. 3) Sensory stories, which highlight the narratives, enriching the eating experience with context, such as tales of dining under the captivating northern lights. 4) Values which indicate guiding principles shaping these experiences on a broader scale, emphasizing support for local traditions and culture. Our main contribution is the presentation of a new contextual framework of multisensory eating experiences which can be applicable to studying eating experiences in other contexts.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"46712b24ebbfc5a30f92184a6acd74aa7a60e25efeda42f770f9f45767ed93f6","category":"Interdisciplinary"}