{"title":"Smarter in the city? Lizards from urban and semi-natural habitats do not differ in a cognitive task in two syntopic species","link":"https://academic.oup.com/cz/article/70/3/361/7637241?rss=1","date":1711670400000,"content":"<span><div>Abstract</div>Urbanization occurs at a global scale, imposing dramatic and abrupt environmental changes that lead to biodiversity loss. Yet, some animal species can handle these changes, and thrive in such artificial environments. One possible explanation is that urban individuals are equipped with better cognitive abilities, but most studies have focused on birds and mammals and yielded varied results. Reptiles have received much less attention, despite some lizard species being common city dwellers. The Italian wall lizard, <span>Podarcis siculus</span>, and the common wall lizard, <span>Podarcis muralis</span>, are two successful lizards in anthropogenic habitats that thrive in urban locations. To test for differences in a cognitive skill between urban and semi-natural environments, we investigated inhibitory control through a detour task in syntopic populations of the two species, across 249 lizards that were tested in partially artificial field settings. Sophisticated inhibitory control is considered essential for higher degrees of cognitive flexibility and other higher-level cognitive abilities. In this task, we confronted lizards with a transparent barrier, separating them from a desired shelter area that they could only reach by controlling their impulse to go straight and instead detour the barrier. We found no differences between lizards in urban and semi-natural environments, nor between species, but females overall performed better than males. Moreover, 48% of the lizards in our study did not perform a correct trial in any of the 5 trials, hinting at the difficulty of the task for these species. This study is among the first to address lizard cognition, through their inhibitory control, as a potential explanation for success in cities and highlights one should be careful with assuming that urban animals generally have enhanced cognitive performance, as it might be taxa, task, or condition dependent.</span>","author":"","siteTitle":"Current Zoology Current Issue","siteHash":"e7197aa0e79464a44186f16a81d9758c42b85acdd06820e73429ff264fcd9f66","entryHash":"46759965b3abfe0cd9da9223e088ce24cb9d39be787a49960f1c5ef66914428f","category":"Environment"}