{"title":"The centrality of redox regulation and sensing of reactive oxygen species in abiotic and biotic stress acclimatization","link":"https://academic.oup.com/jxb/article/75/15/4494/7603472?rss=1","date":1707350400000,"content":"<span><div>Abstract</div>During land plant evolution, the number of genes encoding for components of the thiol redox regulatory network and the generator systems of reactive oxygen species (ROS) expanded, tentatively indicating that they have a role in tailored environmental acclimatization. This hypothesis has been validated both experimentally and theoretically during the last few decades. Recent developments of dynamic redox-sensitive GFP (roGFP)-based <span>in vivo</span> sensors for H<sub>2</sub>O<sub>2</sub> and the redox potential of the glutathione pool have paved the way for dissecting the kinetics changes that occur in these crucial parameters in response to environmental stressors. The versatile cellular redox sensory and response regulatory system monitors alterations in redox metabolism and controls the activity of redox target proteins, and thereby affects most, if not all, cellular processes ranging from transcription to translation and metabolism. This review uses examples to describe the role of the redox- and ROS-dependent regulatory network in realising the appropriate responses to diverse environmental stresses. The selected case studies concern different environmental challenges, namely excess excitation energy, the heavy metal cadmium and the metalloid arsenic, nitrogen or phosphate shortages as examples for nutrient deficiency, wounding, and nematode infestation. Each challenge affects the redox-regulatory and ROS network, but our present state of knowledge also points toward pressing questions that remain open in relation to the translation of redox regulation to environmental acclimatization.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"467599e0116af377793c9beddb77c14ae7559614e596dd4ad941c3d4ad2fb66a","category":"Environment"}