{"title":"Expectations, experiences and challenges of nursing students using the virtual learning medium during the COVID-19 pandemic: A descriptive phenomenological study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299967","date":1709906400000,"content":"<p>by Puoza Deo Gracious, Jerry Armah, Edward Appiah Boateng, Victoria Bam, Veronica Dzomeku, Joana Kyei-Dompim, Ampem Darko Oklodu-Abbey, Abigail Kusi Amponsah</p>\r\nBackground <p>The COVID-19 pandemic caused several higher educational institutions to switch from traditional face-to-face to virtual learning medium. This abrupt shift came with new expectations, experiences and challenges to nursing/ midwifery students, particularly new users, and even more so when preparation, orientation, and support were lacking or ineffective. The present study therefore aimed at exploring the expectations, experiences and challenges of nursing students using the virtual learning medium during the COVID-19 pandemic.</p> Methods <p>This was a descriptive phenomenological design using 12 purposively sampled nursing and midwifery students from a public university in Ghana. With the aid of a semi-structured guide, individual face-to-face interviews were audiotaped, transcribed verbatim at a later time and deductively analyzed into themes using the customer experience execution model.</p> Results <p>Participants were aged 22–36 years and involved equal number of males and females (n = 6), with majority being Christians (n = 11). Six themes were generated from the study: (1) “Initial thoughts and emotions” described participants initial reactions to the virtual educational medium during the pandemic; (2) \"Expectations with the virtual medium\" referred to the participants’ anticipations regarding the convenience offered by the virtual medium; (3) \"Experiences with the virtual medium\" depicted the participants’ recognition of both positive and negative encounters while using the virtual learning platform; (4) “Evaluation and recommendation” described participants’ reports of meeting expectations and recommendations they made to enhance virtual learning; (5) \"Challenges and limitations of the virtual medium\" typically represented the obstacles encountered by nursing/ midwifery students when they embraced the virtual medium; (6) “Prospects of the virtual medium” referred to participants’ views on the future of the virtual medium.</p> Conclusion <p>The study has brought to light that the virtual education environment comes with its own expectations, experiences and challenges to students. Provision of adequate support such as orientation and simulation laboratories by higher education institutions to satisfy students’ needs is necessary to enhance nursing education.</p>","author":"Puoza Deo Gracious","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"467fc2a3b96cbacce3eae6e0676057bbabf9cd27d928d853a11f807b152b45df","category":"Interdisciplinary"}