{"title":"A 3.3‐Million‐Year Record of Antarctic Iceberg Rafted Debris and Ice Sheet Evolution Quantified by Machine Learning","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024PA004897?af=R","date":1725622145000,"content":"<h2>Abstract</h2>\n<p>Over the last 3.3 million years, the Antarctic Ice Sheet (AIS) has undergone phases of ice sheet growth and decay, impacting sea level and climate globally. Presently, the largely marine-terminating AIS loses mass primarily by iceberg calving and basal melt of ice shelves. Quantifying past rates and timing of AIS melt is vital to understanding future cryosphere and sea level changes. One proxy for past ice sheet instabilities is iceberg rafted debris (IRD) fluxes. However, traditional methods of IRD quantification are labor-intensive. Here, we present a new method of identifying IRD grains in sediment core X-ray images using a convolutional neural network machine learning algorithm. We present a 3.3-million-year record of AIS IRD melt events using sediment cores from International Ocean Discovery Program Sites U1536, U1537, and U1538 in the Southern Ocean's “Iceberg Alley.” We identify two increases in the IRD fluxes throughout this period, at ∼1.8 and 0.43 Ma. We propose that after 1.8 Ma, the AIS expanded and transitioned from a primarily terrestrial-terminating to a primarily marine-terminating ice sheet. Therefore, after 1.8 Ma, glacial terminations and AIS iceberg discharge are associated with variations in global ice volume, presumably through the mechanism of sea level and, therefore, grounding line change. The second AIS regime change occurs during the Mid-Brunhes Event (∼0.43 Ma). After this time, there are heightened and continuous IRD fluxes at each glacial termination, indicating increased AIS size and instability after this time.</p>","author":"Claire E. Jasper, \nBlake Dyer, \nBrendan T. Reilly, \nTrevor Williams, \nSidney Hemming, \nMaureen E. Raymo","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"467fc1019aef2597be8144e156d575f25a18dc98a188e58fdbab44ba60f71186","category":"Environment"}