{"title":"Walk or swim: The substrate for movement affects female treefrog mate choice behaviors but has little effect on their preferences","link":"https://onlinelibrary.wiley.com/doi/10.1111/eth.13499?af=R","date":1723559565000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d08478a8-f6d2-43f4-a2df-bb8886b984df/eth13499-toc-0001-m.png\" alt=\"Walk or swim: The substrate for movement affects female treefrog mate choice behaviors but has little effect on their preferences\" />\n<p>We conducted acoustic playback trials to examined whether the mate choice behavior of female treefrogs was affected by whether they had to swim or walk towards a potential mate. Mate preferences were not strongly affected by the substrate of movement, but females showed differences in phonotaxis behavior consistent with them perceiving water as a more dangerous environment. This suggests that females do not compromise mate preferences but adjust associated behaviors to minimize risk.</p>\n<br />\n<h2>Abstract</h2>\n<p>Semiaquatic animals breed in environments with a mix of aquatic and terrestrial features, each requiring appropriate types of locomotion with differential energetic demands and containing different suits of predators. We surveyed calling locations of male Eastern Gray Treefrogs (<i>Hyla versicolor</i>) at our study pond to assess average composition of land/water substrates available to females during mate choice. We also conducted acoustic playback trials to examine whether the mate choice behavior of females was affected by approach substrate; that is, whether females had to swim or walk towards a potential mate. We found that mate preferences were not strongly affected by the substrate of movement: the preferred call duration (“peak preference”) was similar in both treatments, but females showed somewhat stronger discrimination against values deviating from their peak preference (higher “preference selectivity”) in the water treatment. By contrast, other aspects of phonotaxis behavior were clearly different and consistent with females perceiving water as a more dangerous environment: in the water treatment, females took longer to leave the dry release point, jumped further when leaving the release point, and took advantage of features of the playback setup (i.e., the aquatic arena was surrounded by walls) to leave the water and approach the speaker “on land”. This suggests that females do not compromise mate preferences but adjust associated behaviors to minimize risk, and that environmental heterogeneity has little influence on sexual selection regimes.</p>","author":"Hannah Warner, \nGerlinde Höbel","siteTitle":"Wiley: Ethology: Table of Contents","siteHash":"7a94182f50d5fe321f60efa1a57eebe5c3e6a74d1fa25ba04a906a999025c0b6","entryHash":"4680e0fbc1b70dc1697dd56d15dc93402224fc7113d87ae3844dc0e96e1a8ac9","category":"Environment"}