{"title":"ISP ในออสเตรเลียทยอยหยุดให้บริการฟรีอีเมลที่แถมกับเน็ตบ้าน แต่คาดกระทบวงจำกัด","link":"https://www.blognone.com/node/135365","date":1692515516000,"content":"<div><div><div><p>เรื่องมีอยู่ว่าผู้ให้บริการอินเทอร์เน็ตบ้านในออสเตรเลียหลายราย เริ่มแจ้งลูกค้าว่าจะหยุดให้บริการอีเมล ซึ่งมักแถมมาให้กับการติดตั้งอินเทอร์เน็ต โดยมี address เป็นโดเมนของผู้ให้บริการนั้น ๆ ทำให้ผู้ใช้งานที่ยังผูกติดกับอีเมลเก่าแสดงความไม่พอใจกับเรื่องที่เกิดขึ้น เพราะใช้งานและผูกกับหลายระบบมานาน ไม่ต้องการไปไล่แก้ไขอีเมลใหม่</p>\n<p>การแถมอีเมลมาพร้อมกับอินเทอร์เน็ตบ้าน เป็นเรื่องที่นิยมทำกันในยุค 90s ก่อนที่ต่อมาการสมัครอีเมลฟรีจากผู้ให้บริการหลักเช่น Gmail, Hotmail หรือ Outlook จะเข้ามาเป็นที่นิยมมากขึ้น จึงอาจบอกได้ว่าผู้ที่ยังใช้อีเมลเดิมที่ผูกติดกับ ISP น่าจะเป็นลูกค้าเก่าแก่มานานมากระดับหลายสิบปีทีเดียว โดยบริการอีเมลในออสเตรเลียดังกล่าวที่เตรียมปิดตัวเช่น iiNet Webmail หรือ Bigpond ทั้งนี้คาดว่าผลกระทบจะมีอยู่จำกัด</p>\n<p>ด้านหน่วยงานกำกับดูแลด้านโทรคมนาคมของออสเตรเลียมองว่าการเปลี่ยนแปลงนี้เป็นเรื่องที่ดี ทำให้ผู้ใช้บริการอีเมลไม่ต้องผูกบัญชีตนเองกับผู้ให้บริการ เพิ่มทางเลือกในการย้ายค่ายได้ง่ายขึ้น ส่วนมุมมองผู้ให้บริการเชื่อว่าจะช่วยลดต้นทุนบริหารจัดการความปลอดภัยของระบบอีเมล เนื่องจากความเสี่ยงเรื่องการโจมตีทางไซเบอร์ที่มีมากขึ้น แต่ธุรกิจอีเมลนี้ไม่สามารถสเกลได้แบบรายใหญ่เพราะขึ้นกับจำนวนลูกค้าอินเทอร์เน็ตบ้าน</p>\n<p>ที่มา: <a href=\"https://www.theguardian.com/australia-news/2023/aug/19/australias-internet-providers-are-ditching-email-to-the-disgust-of-older-customers\">The Guardian</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/dcd084a00564791a872629abc548463d.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/australia\">Australia</a></div><div><a href=\"/topics/isp\">ISP</a></div><div><a href=\"/topics/e-mail\">E-mail</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"468071f4992a0aed8856ec50b4653149e990baff64bfa0a74728c8df933413fa","category":"Thai"}