{"title":"10 products I loved in 2021: Caley Fretz","link":"https://cyclingtips.com/2021/12/10-products-i-loved-in-2021-caley-fretz/","date":1638753906000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Caley10things2021-650x366.jpg\" /></div><h2>10 products I loved in 2021: Caley Fretz</h2><p>\n</p><p>This was a year of change for me. Big changes. Life-altering changes. My riding reflected that, in good ways and less good ways. </p>\n\n\n\n<p>We had a kid in April, our first. It was an instant priority shift, as any parent will tell you. Then we moved from the road and gravel heaven of Boulder to mountain bike nirvana Durango, Colorado in June. I went from having a handful of incredible hour-long road loops to hit in the morning to having a pile of incredible trail loops, except now I had much less time to actually do those rides. </p>\n\n\n\n<p>I rode less, but I valued those rides more. I hardly touched a road bike in the second half of the year. We got rid of a second car and bought a truck and camper that’s horrifying to park anywhere near civilization, so we ride everywhere in town, shop and commute, and do the kid drop-off by bike. </p>\n\n\n\n<p>Very little in my life is like it was a year ago. As a result, the products I’ve loved have shifted quite a bit, too. </p>\n\n\n\n<h2>Urban Arrow Family</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/ten-things-fretz-1-of-2-1340x895.jpg\" /></figure>\n\n\n\n<p>Our goal was to replace a car. Thus far, mission accomplished. Our truck sits untouched for weeks at a time and is generally only used for big trips. So though the Urban Arrow isn’t exactly cheap, the price is easier to swallow when compared to a car, insurance, gas, etc. And it’s so much more fun. </p>\n\n\n\n<p>I love this thing for a bunch of reasons. One, it has an enormous carrying capacity. The first weekend we had it we rode it to a wedding with my wife and kid inside. It regularly handles big shopping trips and has even made a couple of Home Depot runs. </p>\n\n\n\n<p>Two, it takes a baby seat – the same one that goes in our car. It clips into little suspended pegs so her ride is even more comfortable than ours. We’ve got the rain cover for it as well, which, combined with some good rain gear for the adult, means we can drop the kiddo off at her grandparents’ in almost any weather. </p>\n\n\n\n<p>It’s incredibly stable, the big Magura brakes are great, it goes a couple of days between charges, and we just ordered up some studded tires for the impending winter here. </p>\n\n\n\n<p>I do wish it had a little suspension fork or something, and you have to be careful when it’s empty because there’s so little weight over the front tire. Adding a suspension seat post (as James Huang did) is on the list of upgrades, too. </p>\n\n\n\n<p><strong>Price: </strong>US$5,999<br /><strong>More information:</strong> <a href=\"https://urbanarrow.com/\">Urbanarrow.com </a></p>\n\n\n\n<h2>Sportful Supergiara baggies</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/ten-things-fretz-1-of-1.jpg\" /></figure>\n\n\n\n<p>I almost forgot to add these, until a friend asked me for a shorts recommendation and these were the obvious answer. He wanted baggies that fit relatively tight and breath well because he hated the clammy thigh feeling heavy mountain bike shorts often confer. The Supergiaras check all the right boxes.  </p>\n\n\n\n<p>My only issue with them is the price – $150 is a lot for a pretty simple baggy short. Then again, I wore them on more rides this year than any other piece of clothing, as they easily span the gap between gravel, cross country, even trail riding if you don’t want to look full huckabro. </p>\n\n\n\n<p>I love them because the material is stretchy and relatively thin, so they move with you, they fit tight, and they don’t flap. The pockets are deep so you don’t lose your phone or whatever else you have in there, and there are two zippered pockets for valuables. </p>\n\n\n\n<p><strong>Price:</strong> US$150<br /><strong>More information:</strong> <a href=\"https://www.sportful.com/us/men/collections/Gravel/p/112050721A-002\\\">Sportful.com </a></p>\n\n\n\n<h2>Timber Bear Bell </h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/ten-things-loved-timber-bell-1-of-1.jpg\" /></figure>\n\n\n\n<p>There are bears where I live, but that’s not why I have this bell on my bike. I have it for hikers, other riders, and anybody else who might be around a blind corner on the tight, scrub-oak-filled trails I often ride. </p>\n\n\n\n<p>The Timber isn’t the sort of bell you actively ring. The little button turns it on and off – on and it rings constantly, off and it’s silent. In bear country, you leave it on so you don’t surprise something with large teeth and claws. I turn it on, usually only when descending, so I don’t surprise some poor hiker out for a stroll. </p>\n\n\n\n<p>Trail etiquette requires always staying in control of course, but the heads up provided by the bell is a simple way to keep trail interactions positive. Warning momma bears of my presence is a nice side effect. </p>\n\n\n\n<p><strong>Price: </strong>US$25<br /><strong>More info:</strong> <a href=\"https://www.mtbbell.com/\">mtbbells.com</a></p>\n\n\n\n<h2>Vittoria Corsa Control 30 mm</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/ten-things-love-corsa-control-1-of-1.jpg\" /></figure>\n\n\n\n<p>It’s become something of a tradition for me to include my favorite road tire of the moment in this annual list. Previously, that was the Specialized Turbo Cotton Hell of the North in a 28 mm. I still love that tire; it’s impressively durable and the ride is sublime. But this year, I’ve upsized to 30 mm, and the Turbos don’t come in 30 mm. </p>\n\n\n\n<p>That necessitated some experimentation. I tried a 30 mm Continental GP5000 (not tubeless) and loved the grip but missed the tan wall look. A set of Pirelli P Zero Races rode well but were a touch fragile for daily use and occasional dirt. </p>\n\n\n\n<p>I grabbed a set of Corsa Controls (the version of the Corsa with extra puncture protection) just ahead of the Tour de France and put them on my travel bike. They are exactly what I was looking for. Supple, grippy, reasonably durable (no flats yet), and with a tanwall. I don’t foresee switching to anything else for a while. </p>\n\n\n\n<p><strong>Price: </strong>US$75<br /><strong>More info: </strong><a href=\"https://www.vittoria.com/us/en/tires/road-tires/corsa-control\">Vittoria.com</a></p>\n\n\n\n<h2>Tire liners for hardtails and gravel bikes</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/CushCore-Gravel-CX-2-1340x894.jpg\" /></figure>\n\n\n\n<p>There are a bunch of options in this space from a variety of brands, but I can specifically speak to the cross country version of Cushcore, called Cushcore XC. I think there are three of us at CT including some sort of tire liner in our Top 10s, which speaks to how transformative these little rolls of foam can be. </p>\n\n\n\n<p>For years, tire liners were primarily marketed toward big trail or enduro bikes as a means of preventing blowouts as they blast through massive rock gardens at Mach 4. They work well there, but I don’t think that’s actually their best use case. Their best use case is on bikes with tires that are easily overwhelmed by the terrain – that’s gravel and XC bikes. </p>\n\n\n\n<p>Cushcore XC completely changed how and where I felt comfortable riding a Cannondale FSi hardtail and the gravel version was amazing on the flat bar Specialized Diverge we tested in this fall’s Field Test. Pre-Cushcore, I flatted multiple times on the hardtail as I took it through terrain it, and its XC tires, simply couldn’t handle. I broke the rear rim in multiple places, too. I’d hit a section of rocks at sped and <em>thwack thwack</em>, there goes my air, my sidewall, and sometimes my rim. </p>\n\n\n\n<p>Post Cushcore I haven’t flatted once in six months, on the same tires, riding the same trails. </p>\n\n\n\n<p>I run a single rear liner, as that’s the tire that gets abused (particularly on a hardtail). It adds about 150 grams but I can’t say I’ve noticed it much. Running a tire that was 150 g heavier would certainly be noticeable because of the impact of added sidewall and tread thickness on rolling resistance, but the liner doesn’t seem to have the same effect. </p>\n\n\n\n<p>Not worrying about riding dainty made the hardtail significantly more fun and more capable. I now view tire inserts in the same light as dropper posts: equipment that truly changes how you ride, where you ride, and what you ride at a relatively minimal cost (compared to, say, buying a whole new, more capable bike.)</p>\n\n\n\n<p><strong>Price:</strong> US$75 / AU$107 / £56<br /><strong>More info:</strong> <a href=\"https://www.cushcore.com/product/cushcore-xc-set/\">Cushcore.com</a></p>\n\n\n\n<h2>A fly fishing rod</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/ten-things-loved-fly-rod-1-of-1.jpg\" /><figcaption>Photo: Kristi Diller</figcaption></figure>\n\n\n\n<p>It’s been a while since I picked up a new hobby, and maybe a year in which my free time dwindled considerably wasn’t the year to do it. But I’m not the only new dad I know who’s turned to fishing. There’s something about it that’s calming. Maybe it’s the beer you can drink while doing it. </p>\n\n\n\n<p>My wife got me a fly fishing setup for my birthday and though my hit rate is still atrocious I’ve loved figuring out something new. It’s simultaneously highly technical and really simple, meaning I can dive as deep on any given day as my bandwidth allows. It helps that the river that runs through Durango, which I can walk to, is a pretty decent trout spot, and there’s tons of high country water available (the photo above is from outside Crested Butte). </p>\n\n\n\n<p>On the list for next year: A couple of ride-to-fish adventures. </p>\n\n\n\n<p><strong>Price:</strong> As low as US$40 but the sky’s the limit.<br /><strong>More information:</strong> <a href=\"https://www.takemefishing.org/how-to-fish/types-of-fishing/fly-fishing/\">Takemefishing.org</a></p>\n\n\n\n<h2>The Road Book 2021 </h2>\n\n\n\n<p>Maybe I’m just a hopeless nerd, but I truly enjoy thumbing through the Road Book every fall when it arrives. It’s got everything, the whole season, winners and losers and stats and essays and photos and all sorts of good stuff. There is no better record of a road racing season. </p>\n\n\n\n<p>It’s edited by the indefatigable Ned Boulting and includes essays from some of the best writers in cycling, including our own weekend editor, Kit Nicholson, plus in-their-own-words writing from the winners of some of the biggest races this year. Where else can you read Tadej Pogacar and Lizzie Deignan? </p>\n\n\n\n<p>It’s £50 and frankly should be twice the price. Bike racing geeks, go forth and purchase. </p>\n\n\n\n<p><strong>Price: </strong>US$66 / £50<br /><strong>More info:</strong> <a href=\"https://www.theroadbook.co.uk/?gclid=Cj0KCQiA47GNBhDrARIsAKfZ2rAdoeYU0jR57yS3j6FnF5DoxEYONdxouci5phxjz06g7Ml2Q6RAwgMaAsoBEALw_wcB\">theroadbook.co.uk</a></p>\n\n\n\n<h2>Wahoo Element Rival watch</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/ten-things-fretz-2-of-2-1340x895.jpg\" /></figure>\n\n\n\n<p>Ronan already included this on <a href=\"https://cyclingtips.com/2021/11/10-products-i-loved-in-2021-ronan-mc-laughlin/\">his list</a>, but I like it enough to drop it in as well. </p>\n\n\n\n<p>I’ve mentioned this elsewhere, but I don’t love riding with a computer on my bars anymore. I just find it distracting. But I still like logging my rides, if only to keep myself honest (“Caley you’ve ridden 2 hours per week for the last month, maybe that’s why you’re grumpy”). I like putting stuff up on Strava to see, after the fact, whether I’m going slow or going fast. </p>\n\n\n\n<p>The Rival lets me do that, but I don’t have to stare at it while riding. It’s always on me, always charged (because it’s always on me, so I notice when it’s not charged), and I can just walk out the door and hit go. </p>\n\n\n\n<p>I don’t have a ton of experience with sports watches, to be honest. So this is more an endorsement of the genre than the Rival specifically. </p>\n\n\n\n<p>That said, after a few hiccups a couple of months ago, the Rival has been pretty flawless. For some reason around July it started losing elevation and would sometimes upload rides to the Elemnt app that would refuse to be pushed to Strava. A firmware update fixed both issues. </p>\n\n\n\n<p>I like that Wahoo pushes those updates somewhat frequently, both fixing bugs and adding features. </p>\n\n\n\n<p>It looks decent, it works, and I don’t have to look at it when I’m suffering. </p>\n\n\n\n<p><strong>Price: </strong>US$330 <br /><strong>More info:</strong> <strong><a href=\"https://www.wahoofitness.com/devices/sport-watches/elemnt-rival/buy?utm_id=go_cmp-10431089166_adg-103629629276_ad-445249061673_pla-293946777986_dev-c_ext-_prd-WF140CONF_mca-9049687_sig-Cj0KCQiA47GNBhDrARIsAKfZ2rAaqg6Qpz6Tz6KQ3jeWWuUT4jvGqTmTcutWU1ipW83G2c21RcaT7ekaAnkuEALw_wcB&amp;utm_source=google&amp;gclid=Cj0KCQiA47GNBhDrARIsAKfZ2rAaqg6Qpz6Tz6KQ3jeWWuUT4jvGqTmTcutWU1ipW83G2c21RcaT7ekaAnkuEALw_wcB\">wahoofitness.com</a></strong></p>\n\n\n\n<h2>Specialized Chisel </h2>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/ten-things-loved-chisel-1-of-1-2-1340x895.jpg\" /></figure></li></ul></figure>\n\n\n\n<p>Ahh, aluminum. If you listen to any of our podcasts you know that I, along with much of the crew here at CT, am a huge fan of the frame material. That’s doubly true for off-road bikes, where tire selection and pressure have a ride quality impact orders of magnitude greater than frame material. </p>\n\n\n\n<p>The Chisel is one of the new breeds of cross country hardtails that borrows some geometry cues from the trail world. It has a slacker front end and a longer front-center and reach, creating cockpit space and keeping the front wheel well out in front of you. That makes it way more fun at speed. It handles brilliantly. </p>\n\n\n\n<p>It’s also $1,900, at least the one I tested. The Rockshock Judy fork is probably the only component that left something to be desired across the whole build. I even raced it. $1,900 for a fully raceable cross country bike is awesome. </p>\n\n\n\n<p><strong>Price:</strong> US$1,900<br /><strong>More info: </strong><a href=\"https://www.specialized.com/us/en/shop/bikes/mountain-bikes/cross-country-mountain-bikes/chisel/c/chisel?gclid=Cj0KCQiA47GNBhDrARIsAKfZ2rDBZuSfYZtT2O_1GXbL7pngwZdnDuFQjlxj-MsmYtCefQ5rWwi430kaAm-QEALw_wcB\">Specialized.com</a></p>\n\n\n\n<h2>CyclingTips VeloClub membership</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/01/2021-bike-reviews-cyclingtips-Field-Test-6-2-edited-1340x754.jpg\" /></figure>\n\n\n\n<p>Come on, as the editor around here you know I have to include this. I’m crazy proud of the work my colleagues put out week after week, month after month, across an array of topics far wider than any other bike site on these here interwebs. If you read down this far you should probably just go sign up right now. </p>\n\n\n\n<p><strong>Price:</strong> US 75c per week<br /><strong>More information:</strong> <a href=\"https://cyclingtips.com/signup/\">CyclingTips.com</a></p>\n\n\n    <div>\n    <div>\n\t\n\n\n\n<p><em>Stay tuned for more <a href=\"https://cyclingtips.com/tag/most-loved-2021/\" target=\"_blank\">’10 products I loved in 2021′</a> articles from other members of the CyclingTips team. In the meantime you can catch up on all of <a href=\"https://cyclingtips.com/tag/most-loved-2020/\" target=\"_blank\">last year’s picks</a>. Or go back further into the archives for our round-ups from <a href=\"https://cyclingtips.com/tag/most-loved-2019/\" target=\"_blank\">2019</a>, <a href=\"https://cyclingtips.com/tag/most-loved-2018/\" target=\"_blank\">2018</a>, and <a href=\"https://cyclingtips.com/tag/most-loved-2017/\" target=\"_blank\">2017</a>.</em></p>\n\n\n\n    </div>\n    </div>\n\t\n<p></p><a href=\"https://cyclingtips.com/2021/12/10-products-i-loved-in-2021-caley-fretz/\">Read More</a>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"46824f1b7aaa6034f98443fed117e019b6b36c46bb46586559e7acaa02cd0389","category":"Cycling"}