{"title":"Environmental change legacies attenuate disturbance response of desert soil microbiome and multifunctionality","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2435.14521?af=R","date":1715144986000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/bc878f8a-cad9-4abf-a0e9-8e51a340abf0/fec14521-toc-0001-m.png\" alt=\"Environmental change legacies attenuate disturbance response of desert soil microbiome and multifunctionality\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/31/past-drought-and-freezing-attenuates-soil-microbial-and-functional-responses-to-the-next-drought-and-freezing-in-desert-ecosystems/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nDeserts are predicted to be one of the ecosystems most vulnerable to global climate change, with dramatic fluctuations of temperature and water, even over the span of a single day. These previous disturbances could influence the response of the soil microbiome and its functions to subsequent disturbances, which is known as legacy effect. However, how legacy effects shape the response of soil microbiome and its functions to environmental fluctuations (e.g. temperature and water availability) in desert ecosystems remains to be investigated.\n\nHere, we firstly exposed desert soils to drought, freezing or their combination, and then followed by a second disturbance, resulting in a temporally full factorial treatment.\n\nWe found that environmental change legacies affected the response of soil multifunctionality, microbial abundance and richness to second drought and freezing, except for eukaryotic richness. Initial disturbances caused legacy effects on microbial composition and weakened their responses to later disturbances, and these effects were stronger for prokaryotes than eukaryotes. The attenuated response to later disturbances is largely due to that almost half of the taxa affected by the earlier disturbances were also affected by the second disturbances. The phylogenetic depth of these responses varied minimally among the types of disturbances but were more conserved for negative responses, indicating a result of historical adaptation. Moreover, the altered community composition was associated with functional changes in the disturbed soils.\n\nThese findings will improve our understanding of the mechanisms underlying the legacy impacts of multiple environmental disturbances on desert microbial communities and strengthen our ability to develop management strategies for protection prior to disturbance events.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/31/past-drought-and-freezing-attenuates-soil-microbial-and-functional-responses-to-the-next-drought-and-freezing-in-desert-ecosystems/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>摘要</h2>\n<p>\n\n沙漠是最容易受到全球气候变化影响的生态系统之一，即使在一天之内，温度和水分也会发生剧烈波动。先前的扰动可能会影响土壤微生物组及其功能对后续扰动的响应，这被称为遗留效应。然而，遗留效应如何影响沙漠生态系统中土壤微生物组及其功能对环境扰动(如温度波动和水分可用性)的响应仍有待研究。\n\n这里我们首先将沙漠土壤暴露于干旱、冷冻和二者的共同处理下，然后再进行第二次扰动。\n\n研究发现除了真核微生物丰富度外，初始的环境扰动影响了土壤多功能性、微生物丰度和丰富度对后续干旱和冷冻的响应。初始扰动对微生物组成造成了遗留效应，削弱了它们对后续扰动的响应，并且遗留效应在原核生物中更强。对后续扰动的减弱很大程度上是因为受后续扰动影响的类群中几乎一半的类群已经受到了初始扰动的影响。并且这些类群对扰动的系统发育深度在扰动类型之间变化很小，但对于负向响应更为保守，这可能是历史适应的结果。此外，群落组成变化也与扰动下功能的变化有关。\n\n这些发现将增进我们对多种环境扰动下沙漠微生物群落遗留效应机制的理解，并增强我们在扰动事件发生前制定保护管理策略的能力。\n</p>","author":"Ziheng Peng, \nHang Gao, \nHaibo Pan, \nJiejun Qi, \nShi Chen, \nYu Liu, \nYang Wang, \nChujie Jin, \nGehong Wei, \nShuo Jiao","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"4696254b5e129b612d6d44b2da363faa559a29e8a1c51addc3b5725388d1fd9a","category":"Environment"}