{"title":"Ecological baselines in the Eastern Mediterranean Sea shifted long before the availability of observational time series","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17272?af=R","date":1713250800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/38801ff9-239c-452a-b4fb-1d1108a494b6/gcb17272-toc-0001-m.png\" alt=\"Ecological baselines in the Eastern Mediterranean Sea shifted long before the availability of observational time series\" />\n<p>Human-driven extinctions of native species and introductions of nonindigenous ones have significantly modified the world's biota, often already before the onset of scientific monitoring. Focusing on the Eastern Mediterranean Sea, we analyzed an 18-year-long dataset on live-collected mollusks and compared it to historical biodiversity information reconstructed from decades- to centuries-old accumulations of empty shells preserved on the seafloor. We found that the living species assemblage, even at the beginning of monitoring, was already very different from what lived in the region historically. Our results highlight that scientists must combine different sources of information to accurately describe and understand biodiversity changes.</p>\n<br />\n<h2>Abstract</h2>\n<p>Native biodiversity loss and invasions by nonindigenous species (NIS) have massively altered ecosystems worldwide, but trajectories of taxonomic and functional reorganization remain poorly understood due to the scarcity of long-term data. Where ecological time series are available, their temporal coverage is often shorter than the history of anthropogenic changes, posing the risk of drawing misleading conclusions on systems' current states and future development. Focusing on the Eastern Mediterranean Sea, a region affected by massive biological invasions and the largest climate change-driven collapse of native marine biodiversity ever documented, we followed the taxonomic and functional evolution of an emerging “novel ecosystem”, using a unique dataset on shelled mollusks sampled in 2005–2022 on the Israeli shelf. To quantify the alteration of observed assemblages relative to historical times, we also analyzed decades- to centuries-old ecological baselines reconstructed from radiometrically dated death assemblages, time-averaged accumulations of shells on the seafloor that constitute natural archives of past community states. Against expectations, we found no major loss of native biodiversity in the past two decades, suggesting that its collapse had occurred even earlier than 2005. Instead, assemblage taxonomic and functional richness increased, reflecting the diversification of NIS whose trait structure was, and has remained, different from the native one. The comparison with the death assemblage, however, revealed that modern assemblages are taxonomically and functionally much impoverished compared to historical communities. This implies that NIS did not compensate for the functional loss of native taxa, and that even the most complete observational dataset available for the region represents a shifted baseline that does not reflect the actual magnitude of anthropogenic changes. While highlighting the great value of observational time series, our results call for the integration of multiple information sources on past ecosystem states to better understand patterns of biodiversity loss in the Anthropocene.</p>","author":"Jan Steger, \nCesare Bogi, \nHadas Lubinevsky, \nBella S. Galil, \nMartin Zuschin, \nPaolo G. Albano","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"46982c5e2752c82e845ae698b3fc351342d70def344119f1578c744c77ad48b7","category":"Environment"}