{"title":"Valve Says Counter-Strike 2 for macOS Not Happening Because There Aren't Enough Players on Mac to Justify It","link":"https://www.macrumors.com/2023/10/10/valve-confirms-counter-strike-2-no-macos/","date":1696932870000,"content":"Valve on Monday said it has no plans for a macOS version of the recently released game <em>Counter-Strike 2</em>, the follow-up title replacing the hugely popular FPS <em>Counter-Strike: Global Offensive</em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/counter-srike-21.jpg\" alt width=\"800\" height=\"450\" />\r<br />\nValve confirmed its decision and gave its reasons in a newly published <a href=\"https://help.steampowered.com/en/faqs/view/73EF-08A3-0935-6369\">Steam support FAQ</a>:\r<br />\n<blockquote>As technology advances, we have made the difficult decision to discontinue support for older hardware, including DirectX 9 and 32-bit operating systems. Similarly, we will no longer support macOS. Combined, these represented less than one percent of active CS:GO players.\r<br />\n\r<br />\nMoving forward, Counter-Strike 2 will exclusively support 64-bit Windows and Linux.</blockquote>Last month's release of <em>Counter-Strike 2</em> forced a 26GB update for everyone with CS:GO, including Mac users, but after installation those on macOS soon discovered that the update <a href=\"https://www.macrumors.com/2023/09/30/counter-strike-2-no-mac-version-available/\">makes the original game and the update unplayable</a> because of the lack of support and no rollback option. \r<br />\n\r<br />\nValve now says Mac players will be eligible for a Prime Status Upgrade refund if most of their <em>CS:GO</em> playtime was on macOS and they played <em>CS:GO</em> on a Mac between the announcement of the <em>Counter-Strike 2</em> Limited Test (March 22, 2023) and the launch of <em>Counter-Strike 2</em> (September 27, 2023), regardless of when they purchased their Prime Status Upgrade. Valve will offer the refunds until December 1, 2023.\r<br />\n\r<br />\nValve added that those who wish to continue playing <em>CS:GO</em> on macOS will be able to access a legacy version or \"frozen build\" of the game, which has all the features of <em>CS:GO</em> except for official matchmaking. Support for this version of <em>CS:GO</em> will end on January 1, 2024. After this date, the game will still be available, but certain functionality that relies on compatibility with the Game Coordinator (e.g., access to inventory) may degrade and/or fail, according to Valve.\r<br />\n\r<br />\nDespite Valve's refund offer to Mac users, the news that a macOS version of <em>Counter-Strike 2</em> is not in active development will come as a bitter blow to many players. Though <em>CS:GO</em> launched all the way back in 2012, it's still one of the most popular FPS games available today, with tens of millions of players logging in each month. So even if less than 1 percent of the user base is on Mac, that could still account for hundreds of thousands of players.\r<br />\n\r<br />\nRegardless of numbers, one of the reasons Valve is reluctant to develop <em>CS2</em> for Mac is that Apple devices do not provide native support for the Vulkan API that the game is based on. Vulkan was designed to succeed OpenGL and address some of the latter's shortcomings, and while there is an open-source library called MoltenVK that provides a Vulkan implementation on top of Apple's Metal graphics API, it still lacks some of Vulkan's advanced features.<div>Tag: <a href=\"https://www.macrumors.com/guide/valve/\">Valve</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/10/valve-confirms-counter-strike-2-no-macos/\">Valve Says Counter-Strike 2 for macOS Not Happening Because There Aren't Enough Players on Mac to Justify It</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/valve-says-counter-strike-2-for-macos-not-happening-because-there-arent-enough-players-on-mac-to-justify-it.2407023/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"46abe6bf11bf30deb5daccb754ec4fe793e96d55e9ad1d6b0bc73918001556a2","category":"Apple"}