{"title":"Lateral Antebrachial Cutaneous Nerve Neuropathy: Electrodiagnostic Findings and Etiologies in 49 Cases","link":"https://www.preprints.org/manuscript/202409.0054/v1","date":1725259513000,"content":"Background: The lateral antebrachial cutaneous nerve (LACN) is the terminal sensory branch of musculocutaneous nerve and is rarely entrapped or injured.  This study describes the electrodiagnostic (EDX) findings and etiologies of LACN neuropathy. \nMethods: This is a review of 49 patients with pain and/or paresthesia of the forearm who underwent EDX studies.  The diagnosis of LACN neuropathy was based on clinical and sensory conduction abnormalities.  \nResults: The most common etiology of LACN neuropathy was iatrogenic injury in 30 (61.2%) patients, primarily due to biceps tendon repair at the elbow (11 [36.7%]) and phlebotomy (5 [16.7%].  Fifteen (30.6%) patients sustained a non-iatrogenic injury at the proximal forearm/elbow, consisting of 6 (60%) laceration injuries and 5 (33.3%) stretch injuries.  Four (8.2%) patients comprised the “other” etiology category, including 2 mass lesions causing LACN compression.  Pain, paresthesia, and/or numbness in the LACN distribution were reported in 33 (67.3%), 27 (55.1%), and 23 (46.9%) patients, respectively.  Hypoesthesia was detected in 45 (91.8%) patients, and dysesthesia in 7 (14.3%).  The sensory nerve action potentials (SNAPs) of the LACN on the symptomatic side were absent in 44 (89.8%) patients.  Of the 5 patients whose SNAPs of the LACN were detected, all had a decreased amplitude and 2 had increased sensory latency.  \nConclusion: The most common etiology for LACN neuropathy in this series was iatrogenic injury; repair of biceps tendon at the elbow was the most frequent provoking cause.  Protection of the LACN during surgical procedures at the elbow and forearm is vital to prevent iatrogenic injury.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"46ba3eadbc70b60a6affa3ba0380a6bcb583950bb7634ed3f4396139e6ee916c","category":"Interdisciplinary"}