{"title":"Here’s the full analysis of newly uncovered genetic data on COVID’s origins","link":"https://arstechnica.com/?p=1925722","date":1679434106000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1193097829-800x534.jpeg\" alt=\"Security guards stand in front of the closed Huanan Seafood Wholesale Market in the city of Wuhan, in the Hubei Province, on January 11, 2020, where the Wuhan health commission said that the man who died from a respiratory illness had purchased goods. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1193097829-scaled.jpeg\">Enlarge</a> <span>/</span> Security guards stand in front of the closed Huanan Seafood Wholesale Market in the city of Wuhan, in the Hubei Province, on January 11, 2020, where the Wuhan health commission said that the man who died from a respiratory illness had purchased goods.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/security-guards-stand-in-front-of-the-closed-huanan-seafood-news-photo/1193097829?adppopup=true\">Getty | NOEL CELIS</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A group of independent, international researchers has released its full analysis of newly uncovered metagenomic data collected by the Chinese Centers for Disease Control and Prevention in January and February of 2020. The data <a href=\"https://arstechnica.com/science/2023/03/genetic-data-links-sars-cov-2-to-raccoon-dogs-in-china-market-scientists-say/\">closely links SARS-CoV-2 to the genetic tracks of wild animals, particularly raccoon dogs</a>, sold at the Huanan Wholesale Seafood Market in Wuhan, China, the early epicenter of the COVID-19 pandemic, the group's analysis says.</p>\n<p><a href=\"https://zenodo.org/record/7754299#.ZBoRMezMI-S\">The full analysis</a> provides additional, compelling evidence that the pandemic coronavirus made its leap to humans through a natural spillover, with a wild animal at the market acting as an intermediate host between the virus' natural reservoir in horseshoe bats and humans. It was authored by 19 scientists, led by Michael Worobey, an evolutionary biologist at the University of Arizona; Kristian Andersen, a virologist at the Scripps Research Institute in California; and Florence Débarre, a theoretician who specializes in evolutionary biology at France's national research agency, CNRS.</p>\n<p>Prior to the release of the full analysis late Monday, information on the findings was only made public through media reports and statements from the World Health Organization, which was briefed on the analysis last week. But, the raw metagenomic data behind the analysis is still not publicly available. It was briefly posted on a public genetic database called the Global Initiative on Sharing Avian Influenza Data (GISAID) as recently as earlier this month, and the international researchers were able to download it during that window of availability. But, administrators for the database quickly removed the data after its discovery, saying the removal was at the request of the submitter, a researcher at China CDC.</p></div><p><a href=\"https://arstechnica.com/?p=1925722#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1925722&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"46ba472520f559b44b4848cd4f6d2b473ad6bf6cebeb9558ada2828264dac3f9","category":"Tech"}