{"title":"Rotting human torso takes center stage in wild medical waste lawsuit","link":"https://arstechnica.com/?p=1950825","date":1687988348000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-1248624667-800x533.jpeg\" alt=\"Bags to hold clinical samples labeled with Sanford Health.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-1248624667-scaled.jpeg\">Enlarge</a> <span>/</span> Bags to hold clinical samples labeled with Sanford Health. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/bags-to-hold-samples-are-displayed-at-a-mobile-testing-unit-news-photo/1248624667?adppopup=true\">Getty | Tom Pennington</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A medical waste disposal company operating in Fargo, North Dakota, has filed <a href=\"https://www.kfyrtv.com/2023/06/26/human-torso-concealed-plastic-container-sanford-health-sued-inappropriate-handling-medical-waste/\">a scathing lawsuit</a> against health care system Sanford Health. The lawsuit claims—among many things—that Sanford employees tried to surreptitiously unload a rotting human torso hidden in a plastic container at the facility, faking a signature accepting the delivery in the process. The facility, by law, is not authorized to handle human remains.</p>\n<p>The torso incident was among a string of alleged brazen acts and \"egregious conduct\" by Sanford employees. The disposal company—Monarch Waste Technologies (MWT)—accuses Sanford employees of repeatedly and knowingly mishandling, mislabeling, and improperly delivering medical waste to its treatment facility in their short-lived relationship. That includes failing to sort medical waste, hiding hazardous waste bags in other, non-hazardous waste containers, and delivering waste in improper containers that could leak.</p>\n<p>The two companies had signed two 10-year contracts in September 2020, a lease agreement for the treatment facility and a waste disposal agreement. Two years prior to that, Sanford's own medical waste incinerator was shut down after failing emissions standards. It had also allegedly raised complaints among residents, who accused Sanford of allowing medical waste, such as glass vials of blood, to be strewn around the incineration facility, sometimes ending up on residents' property.</p></div><p><a href=\"https://arstechnica.com/?p=1950825#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1950825&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"46cc6b866184d8f2fb28eecc0326dfea458e2b68345f70890359a18086bcd904","category":"Tech"}