{"title":"ระบบสถิติที่ไม่ขโมยข้อมูลผู้ใช้","link":"https://menn.blog/privacy-friendly-analytics/","date":1615863600000,"content":"<img src=\"https://menn.blog/content/images/2021/03/privacy.png\" /><p>เริ่มต้นจาก PDPA หรือ พ.ร.บ. คุ้มครองข้อมูลส่วนบุคคล กำลังจะบังคับใช้ในวันที่ 1 มิถุนายน 2564 นี้ ทำให้หลายเว็บ พยายามสร้างกล่องแสดงข้อความแจ้งเตือน (Lightbox Consent) ว่า เว็บมีการเก็บข้อมูลและติดตามการใช้งาน และ อาจแสดงหน้าปรับแต่งให้ผู้ใช้เลือกเพิ่มอีกว่าจะให้ติดตามในประเด็นไหนได้บ้าง</p><p>ซึ่งผมว่ามันทำให้เว็บ <strong>ใช้งานยาก รก โหลดช้า </strong>และ คนที่ได้ข้อมูลเหล่านี้ไป ก็เป็นบริษัทยักษ์ใหญ่อย่าง Google และ Facebook ที่นำข้อมูลส่วนตัวจำนวนมากไปหาประโยชน์อีกต่อ</p><p>ทำให้เริ่มหาตัวเลือก และเจอว่า มันมีระบบสถิติที่เคารพความเป็นส่วนตัวของผู้เยี่ยมชมอยู่ด้วย และถ้าเราใช้การเก็บสถิติแบบนี้ เราก็ไม่จำเป็นต้องมี Popup / Lighbox มาให้ผู้ใช้กดยินยอม เว็บก็จะยิ่งใช้งานได้ง่าย</p><figure><img src=\"https://menn.blog/content/images/2021/03/privacy.png\" /></figure><h2>Privacy Friendly Analytics</h2><p>ผมลองไล่หาและเปรียบเทียบดู เจอทั้งที่ฟรีและเสียตังค์ เลยทวีตไว้ด้านล่าง</p><figure><blockquote><p>ถ้าระบบ Analytics ของเว็บเคารพ User Privacy เราไม่จำเป็นต้องทำ Popup PDPA รกๆ ก็ได้<br /><br />งั้นจะใช้อะไรแทน Google Analytics ดี?<br /><br />1. เสียตังค์<br />• <a href=\"https://t.co/jxSUphhAFz\">https://t.co/jxSUphhAFz</a><br />• <a href=\"https://t.co/M6qXeoCdwE\">https://t.co/M6qXeoCdwE</a><br /><br />2. ฟรี<br />• <a href=\"https://t.co/qRvoOjHwYb\">https://t.co/qRvoOjHwYb</a><br />• <a href=\"https://t.co/mRbPeHlObv\">https://t.co/mRbPeHlObv</a> <a href=\"https://t.co/wjfZyybh4k\">pic.twitter.com/wjfZyybh4k</a></p>— Seed Webs (@seedwebs) <a href=\"https://twitter.com/seedwebs/status/1364758192413020161?ref_src=twsrc%5Etfw\">February 25, 2021</a></blockquote>\n\n</figure><p>ก่อนจะมาเจอว่า บทความ <a href=\"https://www.devxify.com/privacy-friendly-analytics-comparison/\">War Of Privacy Friendly Analytics</a> กล่าวที่มาที่ไป รวมถึงยกตัวอย่างบริการ 3 แห่งได้น่าสนใจมาก ทั้ง Plausible Analytics, Fathom Analytics และ Simple Analytics</p><h2>จุดเด่นของระบบสถิติที่คำนึงถึงความเป็นส่วนตัว</h2><p>จุดเด่นร่วมกันของทั้ง 3 เว็บคือ</p><ol><li>เคารพความเป็นส่วนตัว แต่ยังเก็บสถิติได้ละเอียด ให้เราเห็นภาพว่ามีคนเข้าแต่ละหน้าเท่าไหร่บ้าง</li><li>ไม่ต้องติดข้อความแจ้งเตือนรกๆ เพราะไม่ขโมยข้อมูลส่วนตัวผู้ใช้</li><li>ส่งเมลสรุปสถิติรายเดือนได้ แยกแต่ละเว็บแต่ละเมลได้ (เหมาะกับส่งเมลสรุปให้ลูกค้าอีกต่อ)</li><li>นำไปใช้กี่เว็บก็ได้ ระบบจะคิดเงินตามยอดวิวของทุกเว็บรวมกัน</li></ol><p>โดยจุดเด่นของแต่ละเว็บ คือ</p><h2>1. Plausible Analytics</h2><p><a href=\"https://plausible.io/\"><strong>Plausible Analytics</strong></a> นั้น ใช้ JS Script ขนาดเล็กที่สุด (&lt; 1 KB) เชื่อม Google Search Console ได้ ทำมาหลังสุด ราคาถูกสุด เป็น Open Source ด้วย นั่นคือ หากต้องการไปทำระบบเอง ก็เอาโค้ดมาติดตั้งเองได้เลย</p><figure><img src=\"https://menn.blog/content/images/2021/03/plausible.png\" /></figure><h2>2. Fathom Analytics</h2><p><a href=\"https://usefathom.com/\"><strong>Fathom Analytics</strong></a> ทำสวย ทำมาก่อนใคร เช็คเว็บล่มได้ และ มีแมวด้วย! ทำเว็บดีมาก อ่านแล้วอยากจ่ายเงินมาก แต่ว่าแพงกว่าคนอื่นแฮะ</p><figure><img src=\"https://menn.blog/content/images/2021/03/usefathom.png\" /></figure><h2>3. Simple Analytics</h2><p><a href=\"https://simpleanalytics.com/\"><strong>Simple Analytics</strong></a> วีดีโอฮาดี บอกว่า เมื่อโลกจริงเราไม่อยากให้ใครมาตามติดในทุกๆ ที่ โลกออนไลน์ก็ควรเป็นเช่นกัน เก็บสถิติทวีตได้ดีมาก</p><figure><img src=\"https://menn.blog/content/images/2021/03/simpleanalytics.png\" /></figure><h2>ย้ายออกจาก Google Analytics</h2><p>เนื่องจากที่ผ่านมา การทำโปรเจ็ค <a href=\"https://seedthemes.com/\">SeedThemes.com</a> / <a href=\"https://seedwebs.com/\">SeedWebs.com</a> หรือบล็อก <a href=\"https://menn.blog/\">Menn.Blog</a> แห่งนี้ ผมเองไม่ได้ใช้เวลาไปกับการเช็คสถิติหรือทำการตลาดเท่าไหร่ ยิ่งแคมเปญต่างๆ ใน Facebook Page หรือลงโฆษณากับ Google เคยลองแค่ให้พอรู้จัก แล้วก็ไม่ได้ทำกับเว็บตัวเองเลย</p><p>เลยตัดสินใจว่า งั้นลองเลิกใช้ Google Analytics ดูดีกว่า ลดการเอาข้อมูลผู้ใช้ไปป้อนให้บริษัทเหล่านี้ด้วย ส่วนระบบ Comment ในบล็อก เดี๋ยวหาตัวอื่นอีกทีฮะ</p><h2>ไปใช้ Plausible และโหลดเร็วสุดๆ</h2><p>ทำให้ได้ลองสมัคร Plausible แล้วตั้งค่าต่างๆ ดู ผลพลอยได้อีกอย่างก็คือ เมื่อไม่ต้องโหลด Google Analytics อ้วนๆ แล้ว เว็บก็เลยโหลดเร็วมาก คะแนน Page Speed ของ <a href=\"https://seedwebs.com/\">SeedWebs.com</a> สามารถทำได้ 100/100 ทั้งในส่วน Mobile และ Desktop เลย</p><figure><img src=\"https://menn.blog/content/images/2021/03/seedwebs-pagespeed-100.png\" /></figure><div><h2>โครงสร้างเว็บ Seed Webs</h2><ol><li>ใช้ธีม <a href=\"https://seedthemes.com/item/plant/\">Plant จาก SeedThemes</a> ที่เน้นให้โหลดเร็วอยู่แล้ว</li><li>ใช้ปลั๊กอิน <a href=\"https://generateblocks.com/\">GenerateBlocks</a> ในการจัดหน้า เลิกใช้ Page Builder อ้วนๆ ทั้งหลาย (มี<a href=\"https://www.facebook.com/107624117239335/videos/626167774931717\"> ไลฟ์สอน</a> นาทีที่ 12:20 เป็นต้นไป)</li><li>เตรียมรูปให้มีขนาดพอดี หากขยันก็ใช้ <a href=\"https://imageoptim.com/\">ImageOptim</a> ลดขนาดรูปก่อน ถ้าขี้เกียจก็ใช้ปลั๊กอิน <a href=\"https://shortpixel.com/\">ShortPixel</a> ช่วยปรับรูปให้ตอนเขียนบทความไปเลย</li><li>ใช้ปลั๊กอิน <a href=\"https://wordpress.org/plugins/autoptimize/\">Autoptimize</a> ช่วยบีบอัด CSS / JS และสร้างไฟล์แคช</li><li>จริงๆ 1-4 ก็ได้คะแนน 100 ได้แล้ว แต่เว็บนี้มีระบบ E-Commerce ยังใช้ jQuery อยู่ เลยลงปลั๊กอิน <a href=\"https://perfmatters.io/\">perfmatters</a> เพื่อปิด jQuery และปลั๊กอินในหน้าที่ไม่ใช้ออกไป เลยได้คะแนน 100 เต็มได้ หน้าที่ใช้ jQuery ก็จะเหลือ 97-99</li></ol></div><h2>สรุป</h2><p>แนวโน้มของเว็บและแอป คือความเป็นส่วนตัว โดยมีกฏหมายต่างๆ ที่ช่วยให้ผู้คนปลอดภัยจากการโดนขโมยข้อมูลส่วนตัวไปใช้</p><p>การสร้างเว็บไซต์ที่ดี จึงกลับมาสู่จุดเริ่มต้นว่า ให้สร้างเนื้อหาที่ดี จนผู้ใช้อยากจะให้ข้อมูลเอง ทั้งสมัครสมาชิก หรือซื้อสินค้าบริการต่างๆ</p><p>การแอบเก็บข้อมูลผู้ใช้ จะยิ่งทำได้ยากขึ้นเรื่อยๆ และอาจไม่เกิดประโยชน์เท่ากับการสร้างเนื้อหาที่ดี สร้างสินค้าและบริการที่ดี</p><h2>หมายเหตุการเขียนบล็อก</h2><p>ที่ผ่านมา เขียนบันทึกกระจายไว้หลายที่ ทั้งบล็อกส่วนตัว สเตตัสเฟสบุ๊ก และเว็บบริษัท ต่อไปจะพยายามรวบรวมไว้ที่บล็อกแห่งนี้เป็นหลักนะครับ ดังนั้น ต่อไปบล็อกนี้น่าจะมีบันทึกเชิงเทคนิคเพิ่มมากขึ้นด้วยอีกทางครับ</p>","author":"เม่น","siteTitle":"เม่น • บล็อก","siteHash":"12f49096dcb7d4ce38cfda709c2a594b39fe28a8a04178d76c9958c90aebab51","entryHash":"46d73bea236b9bf8cac3ab669855dcc7e1ab3e11492b741ab212209dbc4886e2","category":"Thai"}