{"title":"Resident Evil 4 Now Available on iPhone, iPad, and Mac","link":"https://www.macrumors.com/2023/12/20/resident-evil-4-now-iphone-ipad-mac/","date":1703072638000,"content":"The 2023 remake of popular game <em><a href=\"https://www.capcom-games.com/apple/en-us/\">Resident Evil 4</a></em> is available from today on iPhone, iPad, and Mac. Capcom released the <em>Resident Evil 4</em> remake on PlayStation, Xbox, and PC back in March. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/resident-evil-4.jpg\" width=\"1280\" height=\"720\" />\r<br />\nCompared to the original 2005 title, the updated version includes overhauled graphics, new characters, and updated gameplay elements like crafting items and ammo from resources.\r<br />\n<blockquote>Cutting-edge technology and creativity have breathed new life into this standout entry in the Resident Evil series. With juiced-up visuals and a reimagined story, this new title aims to honor its predecessor's successes by digging even deeper into its core message. Dodge death with a greatly expanded repertoire of character actions in this heart-pounding experience!</blockquote><em>Resident Evil 4</em> can be played on iPhone 15 Pro models thanks to the A17 Pro chip, which features hardware-accelerated ray tracing and improved GPU capabilities that make console-quality gaming possible. The game is also compatible with iPads that are equipped with an M1 or later, and all Apple silicon Macs.\r<br />\n\r<br />\n<em>Resident Evil 4</em> can be downloaded for free from the <a href=\"https://apps.apple.com/app/resident-evil-4/id6462360082\">App Store</a>, and though the full IAP unlock is usually priced at $59.99, the main game can be bought for half that price until the discount ends on January 17. The Separate Ways mini game is available for $9.99, while an additional DLC pack is priced at $14.99, and several weapon packs are available at prices ranging from $2.29 to $7.49.<div>Tag: <a href=\"https://www.macrumors.com/guide/capcom/\">Capcom</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/20/resident-evil-4-now-iphone-ipad-mac/\">Resident Evil 4 Now Available on iPhone, iPad, and Mac</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/resident-evil-4-now-available-on-iphone-ipad-and-mac.2414238/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"46e2438f924c063da3fb72199f3e4bbcb2d8c6503575dfee3f432965538c748d","category":"Apple"}