{"title":"The effect of final irrigation with different solutions on smear layer removal and dentin erosion: A scanning electron microscope study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308606","date":1723212000000,"content":"<p>by Mohammed AlBatati, Ammar AbuMostafa</p>\r\nAim <p>This study aimed to compare the effectiveness of initial irrigation with sodium hypochlorite (NaOCl) and final irrigation with QMix, 40% citric acid, and 17% ethylenediaminetetraacetic acid (EDTA) on smear layer removal and dentin erosion.</p> Methodology <p>Forty extracted human mandibular premolar teeth were randomly divided into four groups (<i>n</i> = 10) according to the type of final irrigants used: 17% EDTA, QMix, citric acid, and control (normal saline). Canals were mechanically prepared using ProTaper Next instruments to an apical size of X3. Subsequently, the roots were sectioned in a buccolingual direction. Scanning electron microscopy (SEM) was used to assess the presence of the smear layer and the amount of dentin erosion in the coronal, middle, and apical thirds of the root canals.</p> Results <p>In regards to smear layer removal, there was a significant difference between the control group and the other tested groups. Moreover, it was significantly higher in the coronal and middle thirds than in the apical third. However, there were no significant differences between the groups of EDTA, QMix, and citric acid. Concerning dentin erosion, citric acid produced significantly more dentin erosion than the other tested groups.</p> Conclusion <p>Final irrigation with solutions had a higher ability to remove the smear layer in the coronal and middle thirds compared to the apical third. Of all the solutions tested, 40% citric acid had the most pronounced impact on dentin erosion, followed by 17% EDTA and QMix.</p>","author":"Mohammed AlBatati","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4713f953bb0c087976f9c51088286bda45684f10fbffa5750fce1d5a3169cac8","category":"Interdisciplinary"}