{"title":"Challenges of Treating a Helicobacter pylori  Infections following the COVID-19 Pandemic in Croatia: A Review","link":"https://www.preprints.org/manuscript/202408.0481/v1","date":1723006972000,"content":"Background: Helicobacter pylori (H. pylori) is a prevalent bacterial pathogen implicated in various gastroduodenal diseases, including chronic gastritis, peptic ulcer disease, and gastric cancer. The COVID-19 pandemic has significantly influenced antibiotic prescription practices, potentially exacerbating antibiotic resistance in H. pylori. Objective: This study aims to investigate antibiotic prescription during COVID-19 pandemic in Croatia and its possible impact  on H. pylori antibiotic resistance, with a focus on Croatia. Methods: A comprehensive literature search was conducted to identify relevant studies from March 2020 to June 2024. The search strategy included terms related to COVID-19, antibiotic prescription, and Croatia. Studies were selected based on predefined eligibility criteria, focusing on observational research addressing antibiotic use during the pandemic. Results: The COVID-19 pandemic leads to significant fluctuations in community antibiotic consumption within the European Union/European Economic Area. In Croatia, antibiotic use in 2022 surpassed 2019 levels, driven by increased consumption of macrolides and other antibiotics. This surge, influenced by early pandemic treatment claims and penicillin shortages, contributed to rising antibiotic resistance in H. pylori. Resistance rates to clarithromycin and levofloxacin were notably high, driven by mutations in the 23S rRNA, gyrA, and gyrB genes. Discussion: The increased antibiotic use during the COVID-19 pandemic has highly likely complicated H. pylori eradication efforts, highlighting the necessity of judicious antibiotic use and robust antimicrobial stewardship. The pandemic underscored the need for new therapeutic strategies, optimized eradication regimens, and advanced diagnostic methods to manage bacterial infections effectively. Conclusions: The COVID-19 pandemic has significantly impacted antibiotic use and resistance patterns, posing new challenges for H. pylori eradication. Addressing these challenges requires a multifaceted approach, including the development of new drugs and advanced diagnostics, coupled with sustained efforts in antimicrobial stewardship to combat emerging resistance threats.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"471c5448d6e10b5c59c648834a20014364742b0b5c592eb5e9c5d9001544d3d8","category":"Interdisciplinary"}