{"title":"Understanding maternal sepsis risk factors and bacterial etiology: A case control study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305411","date":1719410400000,"content":"<p>by Kelly Thompson, Duy Pham Thanh, Jane E. Hirst, Mark Woodward, Hai Pham Thanh, Huong Tran Thi Lien, Kiet Tao Tuan, Binh Le Thanh, Evelyne Kestelyn, Thuan Dang Trong, Katie Harris, Linh Nguyen Thi My, Hien Vu Thi Minh, Tuyen Ha Thanh, Thanh Le Quang, Louise Thwaites</p>\r\nIntroduction <p>Maternal disorders are the third leading cause of sepsis globally, accounting for 5.7 million (12%) cases in 2017. There are increasing concerns about the emergence of antimicrobial resistance (AMR) in bacteria commonly causing maternal sepsis. Our aim is to describe the protocol for a clinical and microbiology laboratory study to understand risk factors for and the bacterial etiology of maternal sepsis in a tertiary Obstetrics and Gynaecology Hospital.</p> Methods <p>This case-control study aims to recruit 100 cases and 200 controls at Tu Du Hospital in Ho Chi Minh City, Vietnam, which had approximately 55,000 births in 2022. Women aged ≥ 18 years and ≥ 28 weeks gestation having a singleton birth will be eligible for inclusion as cases or controls, unless they have an uncomplicated localised or chronic infection, or an infection with SARS-CoV-2. Cases will include pregnant or recently pregnant women with sepsis recognised between the onset of labour and/or time of delivery/cessation of pregnancy for up to 42 days post-partum. Sepsis will be defined as suspected or confirmed infection with an obstetrically modified Sequential Organ Failure Assessment score of ≥ 2, treatment with intravenous antimicrobials and requested cultures of any bodily fluid. Controls will be matched by age, location, parity, mode of delivery and gestational age. Primary and secondary outcomes are risk factors associated with the development of maternal sepsis, the frequency of adverse outcomes due to maternal sepsis, bacterial etiology and AMR profiles of cases and controls.</p> Discussion <p>This study will improve understanding of the epidemiology and clinical implications of maternal sepsis management including the presence of AMR in women giving birth in Vietnam. It will help us to determine whether women in this setting are receiving optimal care and to identify opportunities for improvement.</p>","author":"Kelly Thompson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"471e8c86b88ebfbefd4d37349146babdec2d185ab94e371a2163f64987a60f21","category":"Interdisciplinary"}