{"title":"ผู้บริหาร Meta เชื่อว่า Apple Vision Pro จะเปิดตลาด Metaverse ได้ และทำให้บริษัทเป็น Android โลกเสมือน","link":"https://www.blognone.com/node/137918","date":1706482355000,"content":"<div><div><div><p>Meta Platforms บริษัทแม่ของ Facebook ซึ่ง<a href=\"https://www.blognone.com/node/125543\">เปลี่ยนชื่อบริษัท</a>ตั้งแต่ปี 2021 เพื่อ<a href=\"https://www.blognone.com/node/123906\">สะท้อนวิสัยทัศน์</a>มุ่งสู่การเป็นบริษัท Metaverse แต่ผ่านมาเกือบสามปี ส่วนธุรกิจ Reality Labs ที่รับผิดชอบด้าน Metaverse ยังมี<a href=\"https://www.blognone.com/node/136404\">รายได้</a>น้อยกว่า 1% ของรายได้รวมทั้งหมด ก็อาจสะท้อนว่าตลาดโลกเสมือนนั้นยังไม่ได้ออกสู่กลุ่มผู้ใช้งานทั่วไปแบบธุรกิจโซเชียลมีเดีย</p>\n<p>อย่างไรก็ตาม The Wall Street Journal อ้างแหล่งข่าวที่เกี่ยวข้อง บอกว่าผู้บริหารระดับสูงของ Meta ตอนนี้เชื่อกันว่าการมาของ Apple Vision Pro จะช่วยเปิดตลาดโลกเสมือนให้เข้าถึงลูกค้าทั่วไปในวงกว้างขึ้น โดยบริษัทวางตำแหน่งเหมือนกับ Android ในตลาดสมาร์ทโฟน</p>\n<p>ตอนนี้ Meta จึงเริ่มนำเสนอแผนกับนักพัฒนามากขึ้น เพื่อให้ร่วมกันพัฒนาและแอปบนแพลตฟอร์มมากขึ้น โดยสะท้อนโอกาสที่กำลังมาจาก Apple Vision Pro แต่ปัญหาใหญ่คือกระบวนการควบคุม เพราะ Vision Pro ใช้ตำแหน่งตามสายตาผู้ใช้งาน ขณะที่ Quest ของ Meta ยังใช้คอนโทรลเลอร์ควบคุมเป็นหลัก</p>\n<p>ก่อนหน้านี้ผู้บริหารแอปเปิลมีมุมมองต่อคำว่า Metaverse ที่ตรงข้ามกับ Meta เช่น Greg Joswiak หัวหน้าฝ่ายการตลาดที่บอกว่าเขาจะไม่ใช้คำนี้ หรือตอนนำเสนอ Vision Pro แอปเปิลก็<a href=\"https://www.blognone.com/node/134205\">ไม่พูดคำว่า Metaverse</a> ออกมาเลย</p>\n<p>ที่มา: <a href=\"https://www.wsj.com/tech/personal-tech/meta-facebook-vr-quest-war-apple-1a09ae0b\">The Wall Street Journal</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/17efdfa64ec10bbd1a4da5170c996084.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/metaverse\">Metaverse</a></div><div><a href=\"/topics/apple-vision-pro\">Apple Vision Pro</a></div><div><a href=\"/topics/virtual-reality\">Virtual Reality</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"471fa3ae7941fd4216a6e5c83c1f2ea4295b5ebeceeb1e2fc577e499369721ec","category":"Thai"}