{"title":"Reduction in time to viral suppression among persons living with HIV in Jamaica between 2017–2019","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003107","date":1714053600000,"content":"<p>by Anya Cushnie, Ralf Reintjes, Miia Artama, J. Peter Figueroa</p>\r\nIntroduction <p>HIV viral suppression is important for effective treatment and for reducing new infections. In 2019, only 66% of persons on antiretroviral treatment (ART) in Jamaica were virally suppressed. We aim to compare time to viral suppression by ART initiation year and type of treatment site to understand the implications for programming.</p> Methods <p>We assessed time to viral suppression among 4560 persons who received viral load testing either pre or post ART initiation from 2017–2019. We used descriptive statistics and Kaplan-Meier estimates to compare survival curves by ART year (2017, 2018, 2019), sex and type of treatment site (public and non-governmental organizations). Persons were censored if suppression was not achieved. Mixed effects Cox regression was used to determine the effect of covariates on the likelihood of viral suppression. We report hazard ratios and 95% confidence intervals.</p> Results <p>Pre-ART viral load testing decreased from 36% in 2017 to 30% in 2019. For post-ART viral load tests, approximately 78% (n = 1589) of persons achieved suppression, 51% (n = 809) were female and 86% (n = 1341) used a public treatment site. The median time to suppression decreased by 3 months from 2017 to 2019. The likelihood of suppression was almost 2 times greater in 2018 (HR = 1.56, CI = 1.39–1.75) and 3 times greater in 2019 (HR = 3.17, CI = 2.76–3.64) compared to 2017. NGO treatment sites were also significantly associated with the likelihood of viral suppression compared to public sites.</p> Conclusion <p>Pre-ART viral load testing and the time to viral suppression decreased over three years. Initiating ART after 2017 and early use of NGO treatment sites were found to significantly increase the likelihood of achieving suppression. This demonstrates improvements in the national HIV response but there is need to increase the number of persons on ART and achieving viral suppression.</p>","author":"Anya Cushnie","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"4721f5288597ab8f31f51cf06a2e74daece5c4b3e0921895900c2bf3de465969","category":"Environment"}