{"title":"What to expect from Sony’s May 24 not-E3 livestream","link":"https://arstechnica.com/?p=1939994","date":1684358305000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/08/Spider-Man_PS4_Preview_Side-800x450.jpg\" alt=\"Spider-Man\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/08/Spider-Man_PS4_Preview_Side.jpg\">Enlarge</a> <span>/</span> A screenshot from the first <em>Spider-Man</em> PlayStation game. (credit: Sony)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>E3 might be canceled this year, but the big gaming companies are forging ahead regardless—either as part of Summer Games Fest or with their own presentations and livestreams. Arguably the top dog these days is Sony, which will host <a href=\"https://blog.playstation.com/2023/05/17/youre-invited-playstation-showcase-broadcasts-live-next-wednesday-may-24-at-1pm-pacific-time/\">what it claims</a> to be a meaty \"PlayStation Showcase\" on May 24.</p>\n<p>The show will last more than an hour, making it quite a bit longer than the usual PlayStation State of Play livestreams, which are usually 30 minutes or so. While Sony has mostly moved beyond the old industry marketing cadence of centering heavily on E3 every June, this looks to be as close to an E3 presser as Sony will offer this year.</p>\n<p>Sony promises \"a wealth of new games\" for PlayStation 5 and PlayStation VR2 from a wide range of development studios. \"Expect a glimpse at several new creations from PlayStation Studios, as well as spellbinding games from our third-party partners and indie creators,\" a blog post announcing the event says.</p></div><p><a href=\"https://arstechnica.com/?p=1939994#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1939994&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"473757db64b433b3da8804652b90e26b1a67df940486ea5e259be89c816986e9","category":"Tech"}