{"title":"Modeling Neural Network Demyelination: Insights into Multiple Sclerosis Pathophysiology and Symptom Correlation","link":"https://www.preprints.org/manuscript/202406.1719/v1","date":1719303015000,"content":"Multiple Sclerosis (MS) is a chronic autoimmune disorder characterized by the demyelination of neural fibers in the central nervous system. Understanding the impact of demyelination on neural network efficiency is crucial for elucidating the pathophysiological mechanisms underlying MS. This study aims to model the effects of demyelination on neural network efficiency, specifically focusing on how increased resistance and path lengths due to demyelination correlate with the clinical symptoms of MS. We employed a graph-theoretical approach to simulate neural networks, introducing varying degrees of demyelination. The demyelination was represented by increasing the resistance (weights) of selected edges within the network, affecting both random and clustered distributions of network connections. The primary metric analyzed was the average shortest path length, indicative of network efficiency. The models demonstrated a significant increase in the average shortest path length in demyelinated networks compared to intact ones. Specifically, networks with clustered demyelination exhibited localized inefficiencies, correlating with the focal nature of MS lesions. The increase in path length was associated with reduced signal transmission efficiency, providing insights into a range of MS symptoms including motor and sensory impairments, cognitive dysfunction, visual disturbances, and fatigue. The graph-theoretical model of neural network demyelination offers a novel perspective on how structural changes in the brain's connectivity due to MS can lead to diverse clinical manifestations. While the model simplifies the complexity of neural networks, it underscores the potential of computational approaches in understanding and predicting the course of neurological disorders like MS.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"47467a48bec5a93930a8b4abddbcd51ce70483274c0cdbdf42211648cefbd39c","category":"Interdisciplinary"}