{"title":"Opinion | Internal cable routing has gone too far","link":"https://www.bikeradar.com/features/opinion/internal-cable-routing-has-gone-too-far/","date":1634052608000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/01/20210120_SB_5DSR_MG_4941-884f7a9.jpg?quality=45&amp;resize=620,413\" />                                            <p>Internal cable routing has gone too far.</p>\n<p>What started out as a smart, watt-saving, front-end tidying feature for racing bikes, appears to have turned into a must-have for almost every road and gravel bike, at every price point, and I think that’s a problem.</p>\n<p>We’ve talked about the <a href=\"https://www.bikeradar.com/news/internal-cable-routing-hot-or-not/\">positives and negatives of internal cable routing before</a>, but this isn’t about that.</p>\n<p>This is less about whether internal cable routing is a good idea full stop and more about where it should feature and what kind of bikes are – or, more specifically, aren’t – improved by it.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Semi-external cables are a rare sight on new bikes in 2021.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<h2>How did we get here?</h2>\n<p>It all began so innocently, around the summer of 2015, when stock was plentiful and bike prices weren’t <a href=\"https://www.bikeradar.com/features/long-reads/pandemic-brexit-bike-prices/\">rising faster than London property values</a>.</p>\n<p>Mainstream brands such as Trek and Specialized released groundbreaking <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-aero-road-bike/\">aero road bikes</a> like the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/trek-madone-9-series-first-ride-review/\">2016 Madone</a> and <a href=\"https://www.bikeradar.com/news/new-specialized-venge-vias-sets-high-bar-for-aero-road-2/?image=2&amp;type=gallery&amp;gallery=1&amp;embedded_slideshow=1\">Venge Vias</a>, both of which featured fully integrated cable routing at the front end (no doubt these weren’t the first bikes to do it, but the summer of 2015 was when mainstream brands started to jump on this particular trend).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Trek’s 2016 Madone was one of the first mainstream road bikes to adopt fully internal cable routing.</span></figcaption><span> <i>James Huang / Immediate Media</i></span></div>\n<p>Being cylindrical in shape, <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-brake-gear-cables-explained/\">gear and brake cables</a>, and hydraulic hoses, are not aerodynamically optimised. The wind doesn’t like round things, after all.</p>\n<p>A simple way to make a bike more slippery, then, is to tuck the cables away into the aero-optimised handlebar and frameset. Who could complain? Other than mechanics, of course, but when did that ever stop anyone.</p>\n<p>The market approved and other brands followed suit.</p>\n<p>At some point, though, this feature started migrating from aero bikes to <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-climbing-bikes/\">climbing bikes</a>, then to endurance bikes, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bikes</a>… Now it seems like almost every new drop handlebar bike has fully internal cable routing.</p>\n<h2>What’s the problem with fully internal cable routing?</h2>\n<p>The problem, as far as I see it, is that this internal cable routing is becoming pervasive on drop handlebar bikes of all levels, regardless of whether it really adds anything to the bike.</p>\n<p>On an aero road bike or a <a href=\"https://www.bikeradar.com/advice/buyers-guides/time-trial-bikes/\">time trial bike</a>, fully hidden cables make more sense. With bikes like those, it’s reasonable to want all the marginal gains you can get, though as I found when recently testing four of the latest aero bikes, <a href=\"https://www.bikeradar.com/features/aero-bike-test-notes/\">some brands still do a better job than others</a> at hiding cables while still keeping the cockpit user-friendly.</p>\n<div></div>\n<div>\n    <img /></div><div><figcaption><span><i></i> Hidden cables make sense on aero road and time trial bikes, where every watt counts.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>Indeed, if you’re not racing, is it worth saving a few watts (we’ll come on to exactly how many a little later) for all the added complexity and reduced serviceability that often comes with fully hidden cables?</p>\n<p>And I say this as someone who, as many of you will know, is often chasing small gains.</p>\n<p>As ever, it’s a case of balancing that gain against potential downsides.</p>\n<section><div>\n        <p>This column was written before <a href=\"https://www.bikeradar.com/news/specialized-tarmac-sl7-recall/\">Specialized’s recall of the Tarmac SL7</a>, due to an issue relating to the bike’s proprietary headset and internal cable routing, but this complexity can create additional headaches for all parties.</p>\n<p>\n\n    </p></div>\n    </section><p>Look beyond aero bikes, which at least have the excuse of focusing on lower aerodynamic drag, and we’re starting to see potentially complex internal cable routing right down to entry-level bikes.</p>\n<p>Take the recently announced 2022 Scott Speedster 50. It’s the cheapest model in the new Speedster range and uses 2×7-speed non-series Shimano gearing, with mechanical disc brakes… and fully internal cable routing through the frameset.</p>\n<p>Fully internal cable routing isn’t appropriate for this kind of bike.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Bikes like the Specialized Crux and Aethos show there’s still a large appetite for simplicity and user-friendliness among bike riders.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>As with any internal cable routing, especially with mechanical gear and brake cables, the cable bends are tighter and there’s less tolerance for poor setup (in terms of <a href=\"https://www.bikeradar.com/advice/workshop/how-to-thread-internal-brake-and-gear-cables-video/\">cable length and routing)</a>.</p>\n<p>In turn, this means a higher likelihood of headaches, such as spongy shifting and braking.</p>\n<p>Servicing parts like the <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-headsets/\">headset</a> or gear and brake cables also becomes substantially more complex because, in many cases, the whole front end usually needs to be disassembled just to service the headset bearings.</p>\n<p>On more expensive bikes, which now often feature electronic groupsets and hydraulic <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">road disc brakes</a>, it’s less of an issue.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Shimano’s latest Dura-Ace Di2 R9200 groupset features wireless STI levers to help ease installation.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Wireless electronic groupsets, be that SRAM’s fully wireless eTap or the wireless shifters on Shimano’s new <a href=\"https://www.bikeradar.com/news/shimano-dura-ace-di2-r9200/\">Dura-Ace R9200</a> and <a href=\"https://www.bikeradar.com/news/shimano-ultegra-di2-r8100/\">Ultegra R8100</a> groupsets, suffer no ill effects from integrated front ends.</p>\n<p>And while threading electronic shifting wires through a complicated cockpit and frameset might be difficult to set up initially, it’s a job that generally needs to be done just once (as shifting performance doesn’t degrade due to cable stretch or contamination).</p>\n<ul><li><a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">Road bike groupsets: everything you need to know</a></li>\n</ul><p>Though bleeding them is still a hassle, hydraulic brakes are also less sensitive to tight bends than mechanical gear and brake cables.</p>\n<p>While it still makes servicing more complex, owners of such bikes may be more willing to accept this to have a bike that’s closer to the cutting-edge of bike design (however we define that).</p>\n<p>Equally, if you can’t adjust your bike fit or service the bike without booking it in at your local shop, the question remains as to whether any tangible benefit is worth it out there in the real world.</p>\n<h2>“Up to 3 watts in extreme cases”</h2>\n<p>According to <a href=\"https://www.bikeradar.com/brand/canyon/\">Canyon</a>, “<a href=\"https://www.bikeradar.com/news/2021-canyon-aeroad/\">up to 3 watts in extreme cases</a>” is all we’re likely to be getting out of fully concealed cables.</p>\n<p>Given most brands have a propensity to use flattering language when it comes to performance claims (because why wouldn’t they?), I doubt the German brand is underselling this gain.</p>\n<p>In fact, given Canyon has caveated the wattage claim with “in extreme cases”, it’s probably fair to assume the gain is even smaller under more everyday circumstances.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Hiding all the cables on the front end of my time trial bike would make some sense, but the potential performance gain is a marginal one.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>In <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-your-best-ever-time-trial/\">time trials</a> or road races, where the margins between winning and losing can be so small, compromising simplicity and serviceability for 3 watts makes some sense in performance terms (especially if you have a professional mechanic looking after your bike).</p>\n<p>As someone who waxes chains, pores over rolling resistance charts for the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">best road tyres</a>, and owns <a href=\"https://www.bikeradar.com/news/rule-28-aero-socks/\">aero socks</a> and multiple <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meters</a>, and generally agonises over every last watt, I’d want to save those 3 watts on a race bike, providing I can still service the bike without a degree in mechanical engineering.</p>\n<p>Is it a big enough gain to justify complex internal cable routing on bikes designed for general road or gravel riding, though? I don’t think so.</p>\n<h2>Cleanliness is next to godliness?</h2>\n<p>Clean cockpits do look fantastic, of course, and bike brands are likely trying to capture a far wider portion of the market, with a feature that grabs headlines on their top-tier bikes.</p>\n<p>That’s nothing new in the world of bike tech, and as a less performance-minded aside, internal cable routing also makes mounting <a href=\"https://www.bikeradar.com/advice/buyers-guides/bikepacking-bags/\">bikepacking bags</a> easier, if you’re the kind of fashionable cyclist who does that.</p>\n<p>If either of those reasons is enough for you, that’s perfectly okay – every rider, and consumer, rightly has the choice to buy what they want – but having semi-external cable routing on my <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/giant-tcr-advanced-pro-2-disc-long-term-review/\">Giant TCR Advanced Pro 2 Disc long-term review</a> bike hasn’t caused me any concerns this past year, either. I’ve loved that frame so much I’ve bought it.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> I’ve come round to the view that the semi-external cable routing on the latest Giant TCR’s is actually something to celebrate not criticise.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>It might seem like I’m being hypocritical here, as I’ve previously argued vociferously that <a href=\"https://www.bikeradar.com/features/aero-bike-test-notes/\">aero gains can still matter even if you’re not racing</a>.</p>\n<p>But while big-ticket changes like aero framesets and <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">deep-section wheels</a> typically bring tangible performance gains, the aero benefits of fully internal cable routing are all but impossible to discern without controlled testing.</p>\n<p>Ultimately, on bikes not primarily designed with all-out, no-compromise speed in mind, fully internal cable routing seems like extra hassle for little detectable gain – and it’s a trend I want to stop.</p>\n<p><em>What do you think? Is fully internal cable routing a welcome feature on entry-level bikes or is the added complexity a bad idea? Let us know in the comments below.</em></p>","author":"Simon Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"474a0a40f08c661f1bdd3420dbf84fe4db70fd1036a4a9f6d34445f39ff4eefa","category":"Cycling"}