{"title":"Distribution Characteristics of Trichiurus japonicus and Its Relationship with Environmental Factors in Central and Southern East China Sea and Yellow Sea","link":"https://www.preprints.org/manuscript/202409.1253/v1","date":1726534551000,"content":"Trichiurus japonicus is the most productive fish caught in our country. In order to understand the seasonal distribution of Trichiurus japonicus in the central and southern parts of the East China Sea and Yellow Sea, three species distribution models were adopted, namely Random Forest Model, K-nearest neighbor algorithm and gradient ascending decision Tree model, based on the data of trawling surveys in the central and southern parts of the East China Sea and Yellow Sea from 2008 to 2009. Combined with variance inflation factor and cross-check, the distribution model of Trichiurus japonicus was screened and constructed to analyze the influence of environmental factors on the distribution of Trichiurus japonicus in the central and southern parts of the East China Sea and the Yellow Sea. The results showed that the random forest model had the advantages of fitting effect and prediction ability among the three models. The analysis of this model showed that the water depth, bottom water temperature and surface salinity had a great influence on the habitat distribution of Trichiurus japonicus. The relative resources of Trichiurus japonicus increased with the increase of bottom water temperature and reached the maximum at 23.8℃, and first increased and then decreased with the increase of water depth and surface salinity, reaching the maximum at 72 m and 31.2‰, respectively. The random forest model was used to predict the spatial distribution of Trichiurus japonicus in the East China Sea and the central and southern Yellow Sea during 2008-2009, and the results showed that the predicted results were close to the actual situation. The research results can provide reference for the exploitation and protection of Trichiurus japonicus resources in the East China Sea and the central and southern Yellow Sea.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"475598a68985cb648316228e47e1d8b252276f08a3933950c432308924f98615","category":"Interdisciplinary"}