{"title":"Meta เปิดระบบยืนยันตันตนก่อนโฆษณาการเมืองและเลือกตั้ง เปิดคลังโฆษณาดูข้อมูลย้อนหลังได้ 7 ปี","link":"https://www.blognone.com/node/133312","date":1680678415000,"content":"<div><div><div><p>Meta เปิดระบบให้เพจหรือผู้ใช้ที่ต้องการโฆษณาด้านการเมืองหรือการเลือกตั้งต้องขออนุญาตโฆษณาผ่านการยืนยันตัวตนด้วยบัตรประชาชนหรือเอกสารที่รัฐบาลออกให้ก่อน เพื่อแสดงความโปร่งใสว่าใครเป็นสปอนเซอร์โฆษณา</p>\n<p>เมื่อยืนยันตัวตนเรียบร้อยแล้ว ในโพสต์ที่มีการโฆษณาทางการเมืองและการเลือกตั้ง จะมีข้อความว่า “Sponsored, Paid for by” หรือ “ได้รับสปอนเซอร์จาก” ตามด้วยองค์กรที่มีอิทธิพลและเป็นผู้สนับสนุนโฆษณานั้น ๆ หากองค์กรที่ต้องการยืนยันตัวตนไม่ได้อยู่ในประเทศไทยจะไม่ได้รับอนุญาตให้ลงโฆษณาทางการเมืองเพื่อป้องกันการแทรกแซงจากอิทธิพลต่างประเทศ</p>\n<p>กระบวนการในการยืนยันตัวตนสำหรับโฆษณาทางการเมืองจะใช้เวลาขออนุญาต 72 ชั่วโมง</p>\n<p>นอกจากนี้ Meta ยังสร้างคลังโฆษณา (Ad Library) ที่จัดเก็บข้อมูลโฆษณาทุกชนิด ระบุวันเวลา แพลตฟอร์มที่โพสต์ สปอนเซอร์ และบัญชีที่ยืนยันตัวตนไว้ หากเป็นโฆษณาทั่วไปจะสามารถดูข้อมูลได้เมื่อสถานะของโพสต์ยัง Active อยู่ แต่โฆษณาทางการเมืองและการเลือกตั้งสามารถดูข้อมูลย้อนหลังได้ 7 ปี แม้โฆษณานั้นจะไม่ Active แล้ว</p>\n<p>กระบวนการการยืนยันตัวตนเริ่มเปิดใช้เมื่อเดือนกันยายนปีที่แล้ว ดังนั้น จะมีข้อมูลโฆษณาการเมืองย้อนหลังเริ่มจากวันที่เปิดใช้ระบบ ขณะนี้ผู้ใช้สามารถเข้าไปดูข้อมูลในคลังโฆษณาได้แล้วที่ <a href=\"https://web.facebook.com/ads/library/?active_status=all&amp;ad_type=political_and_issue_ads&amp;country=TH&amp;media_type=all\">Ad Library</a></p>\n<p>ที่มา - ข่าวประชาสัมพันธ์</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/de7b051fa883b9c08cc65d95a8ea58d3.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/thailand\">Thailand</a></div></div></div>","author":"Augustine","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"476138df6350828db5efb942e69a62b3110cf01f9fdff077f1166591fe81b429","category":"Thai"}