{"title":"The psychological impact of torture and state repression in Türkiye between 2015 and 2018: Reports from Turkish refugees seeking asylum in Germany","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002561","date":1722261600000,"content":"<p>by Estella Alejandra Tambini Stollwerck, Ilkem Sarikaya, Kathrin Yen, Hans-Christoph Friederich, Christoph Nikendei</p>\r\n\r\nTorture seeks to undermine not only the physical and emotional well-being of an individual, but to damage the coherence of entire communities. Thus, torture and state repression are used to weaken entire subpopulations. After the failed coup d’état in Türkiye in 2016 and during the subsequently following state of emergency that lasted until 2018, allegations of torture and other degrading treatment in Türkiye spread widely. Since then, the number of asylum-seekers in Germany has risen considerably. This paper analyses the reports of twenty Turkish citizens that fled to Germany to seek asylum in the aftermath of the events. In semi-structured interviews held in Turkish, we assessed the experiences of torture and state repression, psychological consequences, and the current well-being and living situation. All interviewees described illicit violence of state authorities and government supporters, especially while under arrest. Though the methods varied, there was a constant pattern of imbalance of power. The psychological impact of these methods were present after relocation to Germany and included signs of PTSD, anxiety disorders, and major depression. The reports of torture, state repression, and their psychological impact emphasise the importance for policy makers to address the prevention of human rights violations and support the needs of survivors.","author":"Estella Alejandra Tambini Stollwerck","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"476606f84d165472ed7f475f5ea69bdbde89f92af971d651be3c786c204a46d5","category":"Environment"}