{"title":"Use of Eltrombopag to Improve Thrombocytopenia and Transfusion Requirement in Anti-CD19 Car-T Cell-Treated Patients","link":"https://www.preprints.org/manuscript/202407.2382/v1","date":1722309661000,"content":"Abstract Background/Objectives Immune effector cell-associated hematotoxicity (ICAHT) is a frequent adverse event after chimeric antigen receptor (CAR)-T cell therapy. Grade ≥3 thrombocytopenia occurs in around one third of patients, many of whom become platelet transfusion-dependent. Without pharmacological support, platelet recovery may last for months. Eltrombopag is a thrombopoietin receptor agonist (TPO-RA) able to accelerate megakaryopoiesis, which has been used successfully in patients with bone marrow failure and immune thrombocytopenia (ITP.) Its role to manage thrombocytopenia, and other cytopenias, in CAR-T cell-treated patients has been scarcely addressed in the real-world setting. Our aim was to report the Feasibility of this approach and the outcome of patients included in the GETH-TC registry. Methods This is a retrospective, multicenter, observational study. Patients who developed platelet transfusion-dependence subsequently to CAR-T cell treatment were recruited in 10 Spanish hospitals and followed-up for at least 30 days after the first dose of eltrombopag was administered. Results Thirty-eight patients were enroled and followed-up for a median (interquartile range [IQR]) of 175 (99, 489) days since CAR-T cell infusion. At eltrombopag start, 18 patients had thrombocytopenia and another severe cytopenia, while 8 patients had severe pancytopenia. After 32 (14, 38) days on eltrombopag, 29 (76.3%) patients recovered platelet transfusion independence. The number of platelet units used correlated with the time needed to restore platelet counts to levels 20x109/L (Rho = 0.639, p","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4769c1944108e58a79a96ee8e0250e1c7d2649d1cd1cf3f01428649d4af42c82","category":"Interdisciplinary"}