{"title":"Sugar/sugar alcohol with glycerol as co‐plasticizers for high‐content starch/PBAT blown films: from fine structure to physicochemical properties","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13901?af=R","date":1726801411000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Glycerol is a well-known plasticizer for starch-based materials, but it easily migrates during starch retrogradation, thereby deteriorating the films' properties. We hypothesized that the performance of high-content starch/poly(butylene adipate-co-terephthalate) (PBAT) films could be enhanced by using sugar/sugar alcohol (glucose, sucrose and sorbitol) as natural, green and edible co-plasticizers with glycerol.</p>\n<h2>RESULTS</h2>\n<p>The employment of co-plasticizers reduced the melt fluidity of the blends, established intermolecular hydrogen bonds with starch and resulted in a brittle film structure. The presence of sucrose contributed to the formation of more B-type starch crystals. Glucose and sucrose promoted the conversion of bound water to entrapped water, while sorbitol contributed to more bound water. The co-plasticizers enhanced films' thermal stability, moisture permeability (from 3.61 to 3.72 × 10<sup>−11</sup> g m m<sup>−2</sup> s<sup>−1</sup> Pa<sup>−1</sup>), and oxygen barrier (from 12.84 to 8.74 × 10<sup>−13</sup> cm<sup>3</sup> cm cm<sup>−2</sup> s<sup>−1</sup> Pa<sup>−1</sup>). Glucose/glycerol co-plasticized film had the maximum tensile strength (10.12 MPa), and sucrose/glycerol co-plasticized film showed the highest Young's modulus (380.31 MPa).</p>\n<h2>CONCLUSION</h2>\n<p>Sorbitol with linear structure and the lowest melting point exhibited a plasticizing capacity similar to glycerol. The molecular structure (linear or cyclic), hydroxyl group proportion and melting point of the sugar/sugar alcohol were the key factors to regulate the fine structure and properties of starch/PBAT films. © 2024 Society of Chemical Industry.</p>","author":"Yuntong Wu, \nShan Gao, \nJiajun Zhao, \nShuai Kong, \nHao Wang, \nWentao Wang, \nHanxue Hou","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"478452bb4f19f67288d8db526c1be7694a9bd718fcee56df79892bcd414f8f2f","category":"Environment"}