{"title":"Introgression Underlies Phylogenetic Uncertainty But Not Parallel Plumage Evolution in a Recent Songbird Radiation","link":"https://academic.oup.com/sysbio/article/73/1/12/7294611?rss=1","date":1696550400000,"content":"<span><div>Abstract</div>Instances of parallel phenotypic evolution offer great opportunities to understand the evolutionary processes underlying phenotypic changes. However, confirming parallel phenotypic evolution and studying its causes requires a robust phylogenetic framework. One such example is the “black-and-white wagtails,” a group of 5 species in the songbird genus <span>Motacilla</span>: 1 species, <span>Motacilla alba</span>, shows wide intra-specific plumage variation, while the 4r others form 2 pairs of very similar-looking species (<span>M. aguimp</span> + <span>M. samveasnae</span> and <span>M. grandis</span> + <span>M. maderaspatensis</span>, respectively). However, the 2 species in each of these pairs were not recovered as sisters in previous phylogenetic inferences. Their relationships varied depending on the markers used, suggesting that gene tree heterogeneity might have hampered accurate phylogenetic inference. Here, we use whole genome resequencing data to explore the phylogenetic relationships within this group, with a special emphasis on characterizing the extent of gene tree heterogeneity and its underlying causes. We first used multispecies coalescent methods to generate a “complete evidence” phylogenetic hypothesis based on genome-wide variants, while accounting for incomplete lineage sorting (ILS) and introgression. We then investigated the variation in phylogenetic signal across the genome to quantify the extent of discordance across genomic regions and test its underlying causes. We found that wagtail genomes are mosaics of regions supporting variable genealogies, because of ILS and inter-specific introgression. The most common topology across the genome, supporting <span>M. alba</span> and <span>M. aguimp</span> as sister species, appears to be influenced by ancient introgression. Additionally, we inferred another ancient introgression event, between <span>M. alba</span> and <span>M. grandis</span>. By combining results from multiple analyses, we propose a phylogenetic network for the black-and-white wagtails that confirms that similar phenotypes evolved in non-sister lineages, supporting parallel plumage evolution. Furthermore, the inferred reticulations do not connect species with similar plumage coloration, suggesting that introgression does not underlie parallel plumage evolution in this group. Our results demonstrate the importance of investing genome-wide patterns of gene tree heterogeneity to help understand the mechanisms underlying phenotypic evolution. [Gene tree heterogeneity; incomplete lineage sorting; introgression; parallel evolution; phylogenomics; plumage evolution; wagtails.]</span>","author":"","siteTitle":"Systematic Biology Current Issue","siteHash":"ff28aeeb9b03783edee2039c6a58e13e932a0eb216cc2d8b21d5a99c6800e59a","entryHash":"4793750215bf43b2a548b6557bb3ee7a3aebceb80e8735534ba57bed177412d3","category":"Environment"}