{"title":"Exploration of Genes Related to Intramuscular Fat Deposition in Xinjiang Brown Bulls","link":"https://www.preprints.org/manuscript/202408.1182/v2","date":1724065490000,"content":"The aim of this study was to investigate the differentially expressed genes associated with intramuscular fat deposition in the longissimus dorsi muscle of Xinjiang Brown Bulls. The longissimus dorsi muscles of 42 Xinjiang Brown Bulls were selected under the same feeding conditions. The intramuscular fat content of muscle samples were determined by Soxhlet extraction method, from which 5 samples with high intramuscular fat content (HIMF group) and 5 samples with low intramuscular fat content (LIMF group) were selected. It was found that the intramuscular fat content of HIMF group was 46.054% higher than that of LIMF group. Muscle samples produced by paraffin section for morphological observation. It was found that the fat richness of the HIMF group was better than that of the LIMF group. Transcriptome sequencing technology was used to analyze the gene expression differences of longissimus dorsi muscle. Through in-depth analysis of the longissimus dorsi muscle by transcriptome sequencing technology, we screened a total of 165 differentially expressed genes. The results of Gene Ontology (GO) enrichment analysis showed that the differentially expressed genes in the two groups were mainly clustered in biological pathways related to carbohydrate metabolic processes, redox processes and oxidoreductase activities. Kyoto Encyclopedia of Genes and Genomes (KEGG) enrichment analysis showed that the differentially expressed genes were significantly clustered in 15 metabolic pathways, which mainly covered fatty acid metabolism (related to lipid metabolism and glucose metabolism), pentose phosphate pathway, Peroxisome Proliferator-Activated Receptors (PPAR) signalling pathway and other important metabolic processes. The three genes that were predominantly enriched in the glycolipid metabolic pathway by analysis were SCD5, CPT1C, and FBP2, all of which directly or indirectly affect intramuscular fat deposition. In summary, the present study investigated the differences in gene expression between high and low intramuscular fat content in the longissimus dorsi muscle of Xinjiang Brown Bulls by transcriptome sequencing technology, and revealed the related signalling pathways. Therefore, we hypothesized that SCD5, CPT1C, and FBP2 were the key genes responsible for the significant differences in intramuscular fat content of the longissimus dorsi muscles in a population of Xinjiang Brown Bulls. We expect that these findings will provide fundamental support for subsequent studies exploring key genes affecting fat deposition characteristics in Xinjiang Brown Bulls.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"47a696149104a054dd754601c4ddf9fdd848e03ba37a6c1255612f8d7cf218a7","category":"Interdisciplinary"}