{"title":"Efficacy and safety of tegoprazan in the treatment of gastroesophageal reflux disease: A protocol for meta-analysis and systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302450","date":1714658400000,"content":"<p>by Hanxue Zheng, Shunqi Yuan, Jianmin Liu</p>\r\nObjective <p>The incidence of gastroesophageal reflux disease (GERD) is increasing year by year, the clinical manifestations are complex and diverse, and the adverse effects of long-term use of proton pump inhibitors and gastrointestinal motility drugs have been of great concern in recent years. The effectiveness of tegoprazan in the treatment of GERD is still controversial. This protocol describes a systematic review and meta-analysis to evaluate the efficacy and safety of tegoprazan in the treatment of gastroesophageal reflux disease.</p> Methods <p>PubMed, Embase, Cochrane Library and Web of Science will be searched from the database inception to 1 March 2023. All randomized controlled trials related to tegoprazan for GERD will be included. Extracted data will include publication details, basic information, demographic data, intervention details and patient outcomes. The primary outcome will be complete resolution of major symptoms, complete resolution of heartburn, proportion of heartburn-free days, chronic cough, hoarseness, and adverse events. Risk of bias will be assessed using the Cochrane Collaboration’s tool for assessing risk of bias. Article selection, data extraction and risk of bias assessment will be performed in duplicate by two independent reviewers. If the meta-analysis is precluded, we will conduct a descriptive synthesis using a best-evidence synthesis approach.</p> Discussion <p>The results of this study will provide reliable evidence to evaluate the efficacy and safety of tegoprazan in the treatment of GERD and help patients, physicians and clinical investigators choose the most appropriate treatment.</p>","author":"Hanxue Zheng","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"47b129b99e368573ac890d5a17b6e56581fea0fccb22c0457455c5c970193642","category":"Interdisciplinary"}