{"title":"Code snippet hints at new iPads with horizontal camera layout","link":"https://www.macworld.com/article/2218574/code-snippet-hints-new-ipads-horizontal-camera-layout.html","date":1706263871000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The last time Apple updated the standard iPad, way back in fall 2022, one of the more interesting innovations was a change in design which moved the front-facing camera from the short edge (the ‘top’ when the iPad is held in the traditional or portrait orientation) to one of the long edges. This makes far more sense if, as applies to most tablet owners, the main thing you use your front camera for is video chats.</p>\n\n\n\n<p>But the strange thing about this neat bit of lateral thinking was that it applied only to the standard <a href=\"https://www.macworld.com/article/1371039/ipad-10th-generation-review.html\">10th-gen iPad</a>, and not to the far more expensive iPad Pro models which were launched at the same time. This decision was never explained: does Apple imagine that Pro owners are too busy working to have FaceTime conversations?</p>\n\n\n\n<p>In the long and at this point ongoing gap while we wait for the next iPad, opinions have differed on whether the long-edge camera has proven a success, and whether Apple intends to apply the same design to other models. Earlier this week, indeed, we reported on some <a href=\"https://www.macworld.com/article/2213864/leaked-renders-design-12-9-inch-ipad-air.html\">leaked CAD renders</a> which appeared to indicate that the company’s upcoming <a href=\"https://www.macworld.com/article/2110304/new-ipad-air-6-rumors-release-date.html\">12.9-inch iPad Air</a> will have the front camera on the short edge. Bigger-spending customers seem likely to continue to miss out on the sensible new design.</p>\n\n\n\n<p>But perhaps not. Posting on Twitter/X Thursday, MacRumors writer Steve Moser reported that he has spotted a snippet of code in the first beta of <a href=\"https://www.macworld.com/article/2218208/ios-17-4-beta-eu-app-store-changes-features-install.html\">iOS 17.4</a> which hints at the arrival of new iPads with horizontal camera setups. The key line says: “During Face ID setup, iPad needs to be in landscape with the camera at the top of the screen.”</p>\n\n\n\n<p>It’s worth noting that there are plenty of other interesting tidbits in Moser’s analysis of the beta, which you can read on Twitter:</p>\n\n\n\n<figure><div>\n<blockquote><p>iOS 17.4 Beta 1 (21E5184i) changes:<br />1) Text hints at new iPads with horizontal Face ID Layout Even though it says 'iPad' this is most likely for the new iPad Pro due this March. <br />\"During Face ID setup, iPad needs to be in landscape with the camera at the top of the screen.\"<br /><br />2)… <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/NcmsH4J2NE&amp;xcust=1-1-2218574-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/NcmsH4J2NE</a></p>— Steve Moser (@SteveMoser) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/SteveMoser/status/1750641897381487014?ref_src=twsrc%5Etfw&amp;xcust=1-1-2218574-1-0-0&amp;sref=https://www.macworld.com/feed\">January 25, 2024</a></blockquote>\n</div></figure>\n\n\n\n<p>Moser thinks that while the code says merely “iPad,” this is more likely to be a reference to a <a href=\"https://www.macworld.com/article/1835319/14-inch-ipad-pro-release-specs-features-price.html\">new iPad Pro</a> coming in March. Which in turn means that Apple could still be planning to launch an iPad Air with a vertical camera, while porting the horizontal design to the Pro line. That wouldn’t make a whole lot of sense, but it is technically possible.</p>\n\n\n\n<p>One possible reason why Apple has been reluctant to move the camera on non-standard iPads up to now has been the complicating factor of the Apple Pencil, which attaches magnetically to the upper-market models along the same long edge and creates a likely clash with the placement of the components for the charging coil and the camera. Whether Apple’s intentions regarding the camera indicate a parallel change in the way the Apple Pencil is charged is uncertain, but it would be deeply annoying if the company launched yet another Pencil and <a href=\"https://www.macworld.com/article/2109119/apple-pencil-usb-c-lightning-features-comparison.html\">confused matters</a> still further.</p>\n\niPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"47b7928ef1355f07af3c72e0f3efc309260bcb68916873754ef9e27f8bf5ccdd","category":"Apple"}