{"title":"Axonal regrowth under release of myelin-associated glycoprotein: chemotaxis by pioneer Schwann cells and Cajal’s gigantic clubs","link":"https://academic.oup.com/jmicro/article/73/3/251/7283188?rss=1","date":1695686400000,"content":"<span><div>Abstract</div>Myelin-associated glycoprotein (MAG), released from pre-degenerated distal nerves following axotomy, blocks the regrowth of sprouts and naked axons. Ensheathed axons, however, continue to elongate and reach MAG-releasing distal nerves. To determine the regenerative mechanism of ensheathed axons without navigators of axonal growth cones by the film model method, we inserted a MAG-releasing distal nerve segment treated with liquid nitrogen (N<sub>2</sub>DS) between the two films, facing the proximal end of the common peroneal nerves in mice transected 4 days earlier for axons to become ensheathed. On the third postoperative day (Day 3), axon fascicles, subjected to silver staining, extended toward N<sub>2</sub>DS but with few branches, forming terminal swellings called Cajal’s gigantic clubs (CGCs) that are filled with axonal growth cones. Filter paper wetted with either 250 pg/ml MAG or N<sub>2</sub>DS showed the same configurations when inserted between the two films. This effect was lost following anti-MAG treatment; fascicles strayed near the parent nerve with numerous branches, formed a net of axons and tapered toward thin tips at their ends, just like controls without N<sub>2</sub>DS. Schwann cell bundles on Day 3 detected with anti-S100, formed sheaths of CGCs at their ends and connected to pioneer Schwann cells (pSCs). To analyze the physiology of Schwann cells, independent of axons, the parent nerve transected 4 days prior was crushed. On Day 2, with pSCs ahead, Schwann cell bundles extended toward N<sub>2</sub>DS. On Day 4, main bundles regressed, leaving pSCs motionless. Thus, MAG is a candidate chemoattractant for both pSCs and CGCs.</span>","author":"","siteTitle":"Microscopy Current Issue","siteHash":"60a1297b225cb0d11d4d9bb729ba33f4e93147012db6d6a2eafbfc087077a550","entryHash":"47b9ceb6dbb51981a0793111996a5e425afb5ccc73e0a63f8e0ab06361fb32d4","category":"Environment"}