{"title":"Longitudinal single-subject neuroimaging study reveals effects of daily environmental, physiological, and lifestyle factors on functional brain connectivity","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002797","date":1728396000000,"content":"<p>by Ana María Triana, Juha Salmi, Nicholas Mark Edward Alexander Hayward, Jari Saramäki, Enrico Glerean</p>\r\n\r\nOur behavior and mental states are constantly shaped by our environment and experiences. However, little is known about the response of brain functional connectivity to environmental, physiological, and behavioral changes on different timescales, from days to months. This gives rise to an urgent need for longitudinal studies that collect high-frequency data. To this end, for a single subject, we collected 133 days of behavioral data with smartphones and wearables and performed 30 functional magnetic resonance imaging (fMRI) scans measuring attention, memory, resting state, and the effects of naturalistic stimuli. We find traces of past behavior and physiology in brain connectivity that extend up as far as 15 days. While sleep and physical activity relate to brain connectivity during cognitively demanding tasks, heart rate variability and respiration rate are more relevant for resting-state connectivity and movie-watching. This unique data set is openly accessible, offering an exceptional opportunity for further discoveries. Our results demonstrate that we should not study brain connectivity in isolation, but rather acknowledge its interdependence with the dynamics of the environment, changes in lifestyle, and short-term fluctuations such as transient illnesses or restless sleep. These results reflect a prolonged and sustained relationship between external factors and neural processes. Overall, precision mapping designs such as the one employed here can help to better understand intraindividual variability, which may explain some of the observed heterogeneity in fMRI findings. The integration of brain connectivity, physiology data and environmental cues will propel future environmental neuroscience research and support precision healthcare.","author":"Ana María Triana","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"47bbdd044a953bf83babfc209efd21e2ba0b18c1d78aae2e5348d3cb9bda352a","category":"Environment"}