{"title":"Genetic Variants Linked to Opioid Addiction: A Genome Wide Association Study","link":"https://www.preprints.org/manuscript/202410.0378/v1","date":1728292956000,"content":"Opioid addiction disorder (OAD) affects millions of people worldwide. While it is known that OAD originates from many factors, including social and environmental factors, the role of genetic variants in developing the disease has also been reported. This study aims to investigate the genetic variants that may be associated with the risk of developing OAD upon exposure. Twenty-three subjects who had previously been given opioid-based painkillers to undergo small surgical treatment were recruited at Prisma Health Upstate clinic and elsewhere. Eleven of them were considered non-persistent opioid users (controls), and 12 of them were persistent opioid users (cases) after an initial surgery and at the time of sample collection. The subjects were asked to provide saliva samples, which were subjected to DNA sequencing at Clemson University Center for Human Genetics, and variant calling was performed. The GWAS for genes known to be associated with OAD resulted in 13 variants (intronic or SNV) with genome-wide significance (raw p-value &lt; 0.01) and two missense variants, rs6265 (Val66Met in BNDF isoform a) and rs1799971 (Asn40Asp) in OPRM1 previously reported in the literature. Furthermore, extending the GWAS to find all the genomic variants and  filtering the variants to include only variants found in cases (persistent opioid users) but not in controls (non-persistent opioid users) resulted in 11 new variants (p-value&lt; 0.005). Considering that OAD is a complex disease and the effect may come from different variants in the same genes, we performed a co-occurrence analysis of variants on the genes and identified four genes, LRFN3, ZMIZ1, RYR3, and OR1L6 with three or more variants in the case subjects but not in control individuals.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"47bcc4d9b556ca2666411ff8ba11253d71e6a1c1a4a9a580ad8096a34580a1df","category":"Interdisciplinary"}