{"title":"Nocturnal Glucose Profile according to Timing of Dinner Rapid Insulin and Basal and Rapid Insulin Type: An Insulclock&reg; Connected Insulin Cap-Based Real-World Study","link":"https://www.preprints.org/manuscript/202405.0999/v1","date":1715768983000,"content":"Background: Study to assess glucose levels of people with type 1 diabetes (T1D) overnight based on insulin type and timing.\nMethods: Real-world, retrospective study in T1D using multiple daily insulin injections. Contin-uous glucose monitoring and insulin injections data were collected for ten hours after dinner us-ing the Insulclock® connected cap. Meal events were identified using ROC detection methodology. The timing of rapid insulin, second injections, and the type of insulin analogs used were evaluat-ed.\nResults: Nocturnal profiles (n=775, 49 subjects) were analyzed. Higher glucose AUC over 180mg/dL was observed in delayed injections (number; %; mg/dL x h): -45-15min (n=136; 17.5%, 175.9 ±271.0); -15-0min (n= 231; 29.8%, 164.0 ±237.1); 0+45min (n= 408; 52.6%, 203.6 ±260.9), (p 0.049). The use of ultrarapid (FiAsp®) (URI) vs rapid insulin analogs (RI) was associated with less hypoglycemia events (7.1 vs 13.6%; p 0.005) and TBR70 (1.7 +6.9 vs 4.6 +13.9%; p 0.003). Us-ers of glargine U300 vs degludec had higher TIR (70.7 vs 58.5 %) (Adjusted R-squared: 0.22, p &lt; 0.001). The use of a correction injection (n= 144, 18.6%) was associated with higher hypoglycemia events (18.1 vs 9.5%; p 0.003), TBR70 (5.5 +14.2 vs 3.0 +11.1%; p 0.003), glucose AUC over 180 mg/dL (226.1 +257.8 vs 178.0 +255.3 mg/dL x h; p 0.001), and lower TIR (56.0 +27.4 vs 62.7 +29.6 mg/dL x h; p 0.004).\nConclusions: Dinner rapid insulin timing, insulin types and correction injections affect nocturnal glucose profile in T1D.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"47bfbd6bf637f9e04842cd16893813cf995a7bd13d4692dbc2872e05c40c433b","category":"Interdisciplinary"}