{"title":"Temporal resource continuity for egg parasitoids of Dalbulus maidis (Hemiptera: Cicadellidae) during winter on irrigated maize crops and edge grasses","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae079/7734086?rss=1","date":1723766400000,"content":"<span><div>Abstract</div>Little is known about winter-season parasitism of eggs of the corn leafhopper <span>Dalbulus maidis</span> DeLong (Hemiptera: Cicadellidae), an important pest of maize throughout the Americas. Our study, conducted in Mexico, aimed to characterize winter-season parasitism of corn leafhopper eggs on maize crops cultivated with drip irrigation and on wild grasses that grow on the edges of maize crops when maize is not present. Maize leaves baited with <span>D</span>. <span>maidis</span> eggs were used to trap the egg parasitoids in the field. In the first year (2022), parasitism of <span>D. maidis</span> eggs was investigated in maize fields planted contiguously on different dates (asynchronous planting). In the second year (2023), parasitism of <span>D. maidis</span> eggs was evaluated in edge grasses and in adjacent maize crops planted on the same date (synchronous). The highest percentage of parasitism (53%), percentage of emergence, and total abundance of egg parasitoids were found in asynchronous maize fields. Here, <span>Anagrus virlai</span> Triapitsyn (Hymenoptera: Mymaridae), <span>Paracentrobia subflava</span> (Girault) (Hymenoptera: Trichogrammatidae), and <span>Pseudoligosita</span> sp. (Hymenoptera: Trichogrammatidae) wasps were found parasitizing the <span>D. maidis</span> eggs, with <span>P. subflava</span> being the most abundant. In wild edge grasses, only <span>P. subflava</span> was found, showing low levels of parasitism, while in synchronous maize, <span>P. subflava</span> increased its percentage of parasitism (up to 37%), percentage of emergence, and abundance, during winter. These results suggest that <span>P. subflava</span> acts as an efficient biological control agent of <span>D. maidis</span> in irrigation-grown maize crops during the winter season, and that edge grasses are overwinter habitats for <span>P. subflava.</span></span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"47c91407044c3b9c2649d2782c0a3868f579e1203f71bad666281389639b31a2","category":"Environment"}