{"title":"Sea anemone–anemonefish symbiosis: Behavior and mucous protein profiling","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15772?af=R","date":1715771117000,"content":"<h2>Abstract</h2>\n<p>Fish species of the genus <i>Amphiprion</i> (Perciformes: Pomacentridae) seek protection from predators among the tentacles of sea anemones as their natural habitat, where they live essentially unharmed from stinging by the host's nematocysts. The skin mucus of these anemonefish has been suggested as a protective mechanism that prevents the discharge of the nematocysts upon contact. Whereas some anemonefish species seem to produce their own protective mucous coating, others may acquire mucus (or biomolecules within) from the sea anemone during an acclimation period. In controlled experiments, we show that <i>Amphiprion ocellaris</i> acclimated successfully to their natural host anemone species <i>Stichodactyla gigantea</i>, and also to <i>Stichodactyla haddoni</i>, and in some cases <i>Heteractis crispa</i>, neither of which are natural host species. No symbiosis was observed for three other anemone species tested, <i>Entacmaea quadricolor</i>, <i>Macrodactyla doreensis,</i> and <i>Heteractis malu</i>. We explored the skin mucous protein profile from naive and experienced <i>A. ocellaris</i> during their acclimation to natural and unnatural host anemones. We confidently report the presence of metabolic and structural proteins in the skin mucus of all samples, likely involved in immunological defense, molecular transport, stress response, and signal transduction. For those anemonefish that established symbiosis, there was a clear increase in ribosomal-type proteins. We additionally provide evidence for the presence of anemone proteins only in the skin mucus of individuals that established symbiosis. Our results support previous speculation of the role of skin mucous–associated proteins in anemonefish–anemone symbiosis. Further exploration of these mucosal proteins could reveal the mechanism of anemonefish acclimation to host anemones.</p>","author":"Hai‐Thanh T. Nguyen, \nMin Zhao, \nTianfang Wang, \nBinh T. Dang, \nAudrey J. Geffen, \nScott F. Cummins","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"47d87a99e52753005dcc25bc93cee9cf6839bc8fe092fc2a50f59692cd7810d4","category":"Environment"}