{"title":"Harmonizing Nature, Engineering and Creativity: An Interdisciplinary Exploration of Engineered Living Materials, Artistry and Sustainability in Collaborative Mycelium Brick Construction","link":"https://www.preprints.org/manuscript/202407.1898/v1","date":1721823685000,"content":"This study presents an innovative approach to interdisciplinary education by integrating principles of biology, engineering and art to foster holistic learning experiences for children. The focus lies on assembling mycelium bricks as engineered living materials with promising applications in sustainable construction. Through a collaborative group task, children engage in the hands-on creation of these bricks, gaining insights into mycology, biomaterials engineering and artistic expression. The curriculum introduces fundamental concepts of mycelial growth and its potential in sustainable material development. Children actively participate in fabricating 3D forms (negative and positive) using mycelium bricks, thereby gaining practical knowledge in shaping and moulding living materials. This hands-on experience enhances their understanding of biological processes and cultivates an appreciation for sustainable design principles. The group task encourages teamwork, problem-solving, and creativity as children collaboratively compose structures using mycelium bricks. Integrating art into the activity adds a creative dimension, allowing participants to explore aesthetic aspects while reinforcing the project’s interdisciplinary nature. Conversations about the material’s end of life and decomposition are framed within the broader context of Nature’s cycles, facilitating an understanding of sustainability. This interdisciplinary pedagogical approach provides a model for educators seeking to integrate diverse fields of knowledge into a cohesive and engaging learning experience. The study contributes to the emerging field of biomimetics education, illustrating the potential of integrating living materials and 3D understanding activities to nurture a holistic understanding of science, engineering and artistic expression in young learners.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"47e84526cddd5012eef987d10d07e74855d095914858668b4516447226a89397","category":"Interdisciplinary"}