{"title":"Various investigations of ameliorative role of Ashwagandha seeds (Withania somnifera) against amoxicillin toxicity","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae091/7691502?rss=1","date":1718150400000,"content":"<span><div>Abstract</div>Several studies showed the adverse effects of amoxicillin on various body organs. So, this research has been designed to evaluate the modulatory role of Ashwagandha seed extract (ASE) against amoxicillin (AM) toxicity. Rats treated with AM (90 mg/kg), protected by ASE doses (100, 200 and 300 mg/kg), and treated by ASE at the same three doses. At the end of the experimental period, DNA comet assay, cytogenetic examinations, sperm-shape analysis, evaluation of the malondialdehyde (MDA) percentages, histopathological examinations, and biophysical tests (modulus, relaxation time, permittivity, entropy, and internal energy change of brain) were documented. The results confirmed that AM treatment induced significant elevation of DNA damage, cytogenetic aberrations, and MDA content in brain, liver, and testis tissues and sperm-shape anomalies. ASE treatment significantly minimized the genetic changes, sperm-shape anomalies, and MDA generation. These enhancements were more pronounced by protective ASE and increased by increasing the dose level. In histopathological examinations, AM treatment caused neurotoxicity in brain tissue. ASE treatment, partially, minimized these damages and the positive effects of therapeutic ASE were more noticeable. Biophysical parameters showed that therapeutic ASE was better for relaxation time, permittivity, and free energy change. Protective and therapeutic ASE were able to recover entropy and internal energy changes in variant degrees.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"47edde7267324610d26c8e4b25a299fac66e372db3f7e607a612ae078dc02396","category":"Environment"}