{"title":"Personality trait structures across three species of <i>Macaca</i>, using survey ratings of responses to conspecifics and humans","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309946","date":1725631200000,"content":"<p>by Alexander J. Pritchard, Eliza Bliss-Moreau, Krishna N. Balasubramaniam, John P. Capitanio, Pascal R. Marty, Stefano S. K. Kaburu, Małgorzata E. Arlet, Brianne A. Beisner, Brenda McCowan</p>\r\n\r\nComparative studies reliant on single personality surveys to rate wild primates are scarce yet remain critical for developing a holistic comparative understanding of personality. Differences in survey design, item exclusion, and factor selection impede cross-study comparisons. To address these challenges, we used consistently collected data to assess personality trait structures in wild rhesus (<i>Macaca mulatta</i>), bonnet (<i>M</i>. <i>radiata</i>), and long-tailed (<i>M</i>. <i>fascicularis</i>) macaques that varied in their degree of phylogenetic closeness, species-typical social styles, and anthropogenic exposure in urban or urban-rural environments. We administered 51-item personality surveys to familiar raters, and, after reliability and structure screenings, isolated 4–5 factor solutions among the species. Four consistent factors emerged: Confident, Sociable, Active, and Irritable/Equable. This latter factor had differential expression across species. Item composition of the Irritable/Equable factor was consistent with their anticipated differences in social styles, but confounded by cross-site anthropogenic variation. We also administered a 43-item survey confined to human-primate situations which paralleled our findings of social style variation, while also exhibiting variation that aligned with population differences in human density. Our findings indicate that macaque personality trait structures may be emergent outcomes of evolutionary and/or socioecological processes, but further research is needed to parse these processes’ relative contributions.","author":"Alexander J. Pritchard","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"47f131129cd4b6dbe08aab03a4eb441cd78b54786a5a1193cd5622f355dceb64","category":"Interdisciplinary"}