{"title":"Announcing HCP Vault General Availability","link":"https://www.hashicorp.com/blog/vault-on-the-hashicorp-cloud-platform-ga","date":1617811200000,"content":"<p>We are pleased to announce that <a href=\"https://cloud.hashicorp.com/\">HashiCorp Vault</a> is now generally available as a fully managed service for AWS environments on the HashiCorp Cloud Platform (HCP). HCP Vault allows organizations to get Vault clusters up and running quickly, providing access to best-in-class secrets management and encryption capabilities with the platform providing resilience and operational excellence as a service.</p>\n<p>In January, we announced the <a href=\"https://www.hashicorp.com/blog/vault-on-the-hashicorp-cloud-platform-public-beta\">HCP Vault public beta</a>, and gave details on the push-button deployment and fully managed infrastructure it provides. In this post, we’ll review some of the capabilities of HCP Vault and explain how pricing for this managed service works.</p>\n<h2><a href=\"#getting-started\">»</a><a></a>Getting Started</h2>\n<p>As a fully managed service, HCP Vault is the easiest way to secure, store, and tightly control access to tokens, passwords, certificates, encryption keys, and other sensitive data. HCP Vault also enables secure secrets management across EC2, EKS, Lambda, and many other AWS services.</p>\n<p>HCP Vault is designed to minimize the steps necessary to use Vault within your AWS environments. At a high level, operators need to take these three steps to start using HCP Vault:</p>\n<ol>\n<li><strong>Create an account</strong>: First create a <a href=\"https://portal.cloud.hashicorp.com/sign-up\">HashiCorp Cloud Platform</a> account.</li>\n<li><strong>Deploy a cluster</strong>: Next, select HCP Vault from the dashboard. We have a <a href=\"https://learn.hashicorp.com/tutorials/cloud/get-started-vault?in=vault/cloud\">quickstart deployment guide</a> that will walk you through the process of creating your HashiCorp Virtual Network (HVN) and a Vault cluster.</li>\n<li><strong>Peer with AWS</strong>: Once you have deployed their HVN and cluster, the next step is to peer that network with your existing AWS environments.</li>\n</ol>\n<p>That’s it; you are ready to connect and use HCP Vault. In practice, these steps will have a range of options when you drill down into them, so we’ve created a series of <a href=\"https://learn.hashicorp.com/collections/vault/cloud\">Learn guides</a> to help you manage the finer details of your setup.</p><p>We have recorded a screencast which gives an overview of the HashiCorp Cloud Platform and walks through the process for getting started with HCP Vault.</p>\n<h2><a href=\"#pricing-and-aws-region-availability\">»</a><a></a>Pricing and AWS Region Availability</h2>\n<p>At launch, HCP Vault is generally available in AWS regions in the U.S. (Oregon and Virginia) and Europe (Frankfurt, Ireland, and London). We plan to add additional region options in the U.S. and Europe, and expand to other parts of the world in the future.</p>\n<p>For pricing, HCP Vault offers the following packages:</p>\n<ul>\n<li><strong>Development cluster</strong>: This is the best way to get started testing HCP Vault in AWS environments. The development cluster is a non-production, single-node deployment of Vault billed by the hour. At launch, we are offering a free month to new users.</li>\n<li><strong>Standard cluster - hourly</strong>: For production workflows, we recommend provisioning a multi-node highly available cluster. This will launch a three-node Vault deployment that is ready to handle production-grade workloads.</li>\n<li><strong>Standard cluster - annual</strong>: Organizations that plan to run large production deployments on HCP Vault have the option of an annual agreement with us. Please reach out to our <a href=\"https://www.hashicorp.com/contact-sales\">sales team</a> or your HashiCorp representative if you are interested in annual HCP options.</li>\n</ul>\n<p>To review our pricing information, please visit our <a href=\"https://cloud.hashicorp.com/pricing/vault\">HCP Vault pricing page</a>.</p>\n<h2><a href=\"#next-steps\">»</a><a></a>Next Steps</h2>\n<p>We are very excited about making HCP Vault generally available. We recommend creating an HCP account and trying HCP Vault for yourself. For more information about HCP Vault and pricing, please visit our <a href=\"https://cloud.hashicorp.com/\">product page</a> or <a href=\"https://portal.cloud.hashicorp.com/sign-up\">sign up</a> through the HCP portal.</p>","author":"Justin Weissig","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"47f84836688e84cb593e81405df8a2603fb4d9edfb3c16acaa1abe2c4a314f75","category":"Tech"}