{"title":"Fungal trait‐environment relationships in wood‐inhabiting communities of boreal forest patches","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14627?af=R","date":1722247146000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/4a67c31f-dd3c-463b-93fb-35fc50fb0bc1/fec14627-toc-0001-m.png\" alt=\"Fungal trait-environment relationships in wood-inhabiting communities of boreal forest patches\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/17/discovering-the-secrets-of-wood-inhabiting-fungi-insights-into-community-traits-and-environmental-interactions/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nFungal traits can provide a mechanistic understanding of how wood-inhabiting fungi interact with their environment and how that influences community assembly in deadwood. However, fungal trait exploration is relatively new and almost no studies measure fungal traits in their environment.\n\nIn this study we tested species- and trait-environment relationships in reproducing fungal communities inhabiting 571 Norway spruce (<i>Picea abies</i>) logs in 55 isolated forest patches (0.1–9.9 ha) of different naturalness types, located in Northern boreal Sweden. The studied patches were (1) semi-natural set-aside patches within highly managed landscapes, or (2) old-growth natural patches located in an unmanaged landscape. We tested species and trait relationships to deadwood substrate and forest patch variables. We measured mean fruit body size and density for each of the 19 species within communities.\n\nTraits assembled in relation to log decay stage and forest patch naturalness, illustrating the important role of deterministic environmental filtering in shaping reproducing wood-inhabiting fungal communities. Early decay stage communities had larger, less dense, annual fruiting bodies of half-resupinate type and were more often white-rot fungi. Species rich mid-decay stage communities had mixed trait assemblages with more long lived perennial fruit bodies of intermediate size, and both brown- and white-rot fungi equally represented. Finally, late decay stage communities had smaller, denser and perennial fruit bodies, more often of the brown-rot type.\n\nThe relationships between the studied traits and decay stages were similar in both set-aside and natural patches. However, set-aside semi-natural patches in highly managed landscapes more frequently supported species with smaller, perennial and resupinate fruit bodies compared to natural patches in an unmanaged landscape.\n\n<i>Synthesis</i>. We found that log decay stage was the primary driver of fungal community assembly of species and traits in isolated forest patches. Our results suggest that decay stage filters four reproduction traits (fruit body density, size, lifespan and type) and one resource-use trait (white or brown rot). Our results highlights, for the first time, that communities with diverse fungal reproductive traits are maintained foremost across all deadwood decay stages under different forest naturalness conditions.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/17/discovering-the-secrets-of-wood-inhabiting-fungi-insights-into-community-traits-and-environmental-interactions/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Samantha K. Dawson, \nHåkan Berglund, \nOtso Ovaskainen, \nBengt G. Jonsson, \nTord Snäll, \nElisabet Ottosson, \nMari Jönsson","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"480012208a7b28108755aa23fc2ff9eb331b5a5704dfa2bda29b89c37fed2af1","category":"Environment"}