{"title":"CMK-3 Carbon Nanopipes Arrangement Synthesized with Pectin Extracted from Golden Delicious Apple","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.418/7719792?rss=1","date":1721779200000,"content":"<span>Mesoporous materials have been widely studied due to their applications mainly as adsorbents and catalysts. The CMK-3 material is a mesoporous carbon synthesized using a silica SBA-15 as a hard template and sucrose as a carbon source [<a href=\"#ozae044.418-B1\">1</a>]. The carbon nanopipes arrangement is an inverse replica of the SBA-15 cylindrical mesopores. Their hierarchical porosity refers to the slit micropores of carbon and the mesoporous given by the template [<a href=\"#ozae044.418-B2\">2</a>], which provides the carbon material with a variety of characteristics like strength and stability against cyclic and thermal treatments [<a href=\"#ozae044.418-B3\">3</a>]. The most common carbon precursors for CMK-3 synthesis are sucrose, furfuryl alcohol, glucose, phenolic resins, acetonitrile, and others [<a href=\"#ozae044.418-B4\">4</a>]. This project aims to propose a new, economical, and environmentally friendly carbon source (pectin from Golden Delicious apple) to improve the CMK-3 synthesis method and elucidate their nanopipes arrangement employing microscopy techniques. The SBA-15 template was synthesized following the procedure described in Quiroz et al., 2023 [<a href=\"#ozae044.418-B1\">1</a>] for a typical synthesis procedure. For the CMK-3-pectin carbon synthesis, the methodology reported by Ryoo, 2000 [<a href=\"#ozae044.418-B2\">2</a>] was modified substantially for the precursor source and the temperature ramps. Briefly, the carbon source was pectin, extracted from Golden Delicious Apples following the acid hydrolysis method described by Rojas-Candelas et al, 2022 in a previous report [<a href=\"#ozae044.418-B5\">5</a>]. Then, 1 g of silica template was mixed with 2.3 g of pectin and 10 ml of diluted H<sub>2</sub>SO<sub>4</sub>; the mixture was dehydrated at 363 K followed by the increase of temperature to 453 K, both for 4 hours. After that, the pyrolysis step at 700°C and the remotion of the silica template with hydrofluoric acid were carried out. Finally, the SBA-15 and CMK-3-pectin from apple were observed using a scanning electron microscope (Hitachi, SU3500 I, Santa Clara, CA, USA) at 5.0 kV. The micrographs of SBA and CMK-3-pectin from apple were obtained by a transmission electron microscope (field emission electron microscope JEM-2010F, USA). All images were analyzed using Digital Micrograph software (v. 3.7.1, Gatan Software Team, USA).</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"480235fdd190b6334ddde032d7cf18ba5fc14d7383946d85060fcfbb66dec94b","category":"Environment"}