{"title":"Large Divergence of Projected High Latitude Vegetation Composition and Productivity Due To Functional Trait Uncertainty","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004563?af=R","date":1723540154000,"content":"<h2>Abstract</h2>\n<p>Vegetation distribution and composition are expected to change in northern high latitudes under rapid warming, which regulates ecosystem functions but remains challenging to predict. Vegetation change arises from the interplay of chronic climate trends such as warming and transient demographic processes of recruitment, growth, competition, and mortality. Most predictive models overlooked the role of demographic dynamics controlled by plant traits. Here, we simulate vegetation dynamics at the Kougarok Hillslope site in Alaska under historical and future climates using the E3SM Land Model coupled to the Functionally Assembled Terrestrial Simulator (ELM-FATES). To evaluate the roles of plant traits, we parameterize the model with 5,265 trait configurations representing diverse physiological and demographic strategies. Results show current modeled biomass, composition, and productivity are most sensitive to traits controlling photosynthetic capacity, carbon allocation, allometry, and phenology. Among all trait configurations, ∼5% reproduce in situ biomass and plant functional type (PFT) composition measured in 2016, that are indistinguishable from these two observed ecosystem states. Notably, these same trait configurations produce diverging biomass, composition, and productivity under future climate, where the uncertainty attributable to traits is twice the change attributable to climate change. The variation of projected productivity arises from emerging PFT composition under novel climate regimes, primarily explained by traits controlling cold-induced mortality, recruitment, and allometry. Our findings highlight the importance and uncertainty of demographic dynamics and its interaction with climate change in shaping Arctic vegetation change. Improved model predictions will likely benefit from explicit consideration of vegetation demography and better constraints of critical traits.</p>","author":"Yanlan Liu, \nJennifer A. Holm, \nCharles D. Koven, \nVerity G. Salmon, \nAlistair Rogers, \nMargaret S. Torn","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"4804ffe4262a4a81cc321dcccd4f6a622eca8b735b9fcf98a24703f9e87e4e1c","category":"Environment"}