{"title":"Knowledge of abortion legality among health facility staff in Ghana","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308371","date":1724335200000,"content":"<p>by Grace Sheehy, Chelsea Polis, Easmon Otupiri, Caroline Moreau</p>\r\nBackground <p>Abortion has been legal for multiple indications in Ghana since 1985, and efforts have been made to expand the availability of safe abortion care in the years since. However clandestine, and potentially unsafe, abortions remain common, suggesting numerous barriers to access persist; one possible barrier is poor knowledge of the abortion law among those working in health facilities. Our study aimed to identify levels of legal knowledge among health facility staff across Ghana.</p> Methods <p>Data for this paper are drawn from a nationally representative cross-sectional health facility survey conducted in 2018; our analytic sample includes 340 facilities that provide induced abortion and/or postabortion care (PAC). The survey collected data on provision of abortion and PAC, as well as knowledge of abortion legality and recommendations for reducing unsafe abortion. We used descriptive statistics to examine levels of knowledge and recommendations, and logistic regression to assess associations with individual and facility characteristics.</p> Findings <p>Comprehensive knowledge of the legal indications for abortion was low among health facility staff; just 6% identified all legal indications, and the majority (83%) underestimated the number of conditions under which abortion is legal. Knowledge was higher for more restrictive indications, such as a woman’s life being at risk, which was identified by 72% of respondents, than more broadly interpretable indications, such as mental health, identified by 29%. Respondents in facilities providing both induced abortion and PAC had better knowledge of several legal indications than those in facilities providing PAC only.</p> Conclusions <p>Health facility staff have significant gaps in their knowledge of abortion legality. Knowledge of the law among this population is highly important for ensuring that abortion care is made available to the fullest extent of the law. Efforts are needed to improve knowledge of the law among providers and facility staff, particularly for indications with broad interpretability.</p>","author":"Grace Sheehy","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"480e62489be82a07655c7cc0e01128ebfdb9c3cdf629e1486e272998c1b5bf44","category":"Interdisciplinary"}