{"title":"Panic, washing machines, and creating chaos: How the pros handle crosswinds","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/panic-washing-machines-and-danger-how-the-pros-handle-crosswinds","date":1708438298000,"content":"\n      <p><span>There’s a nervous buzz in the days leading up to the 2024 UAE Tour. At some point during the next week, the wind is almost certain to roar in the desert from either the right or the left – when that moment eventually comes, some will fare better than others. </span></p>\n<div></div>\n<div></div>\n<p><span>The peloton’s attitude towards crosswinds can be split into categories, depending on a rider’s individual goals in the race. At the very top of the hierarchy when it comes to battling a brutal breeze are the strong, time trialist-type riders who can push plenty of watts on the flat. If they want to ride hard in the crosswinds with an aim of eventually winning the stage, it’s a nervous time for the lighter climbers who need the road to kick up to excel.</span></p>\n<p><span>Things change, however, when the echelon specialists are aiming to look after the general classification contenders on their teams. Then, the climbers can breathe a small sigh of relief, because they have bodyguards in the chaos, somewhat protected from the famed ‘washing machine’ effect that echelons cause. As riders line across the roads aiming to gain protection from sideways gusts, good technique – and plenty of bravery – in echelons is imperative. </span></p>\n<p><span>The movement of an echelon goes like this: one rider moves slightly to the side of the rider in front and sits just behind their wheel, their placement depending on the wind direction. Instead of the usual through and off motion seen most commonly in cycling, the riders rotate in a circular motion across the road – known as the ‘washing machine’ effect. When riders miss the front echelon, this is when problems can occur, riders can find themselves riding in the gutter, in the wind in single file. Sooner or later, the energy of these riders inevitably runs out and they find themselves out of the back, battling against brutal winds on a long and lonely road.</span></p>\n<p><span>“It’s just a track race. It’s an elimination,” Team Corratec-Vini Fantini rider Mark Stewart commented. “You have to just stay at the front, if you’re not moving forward, you’re moving backwards. You have to focus on the next couple of hundred metres, then when they’re done, focus on the next hundred metres.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1467840316_1024x1024.jpg?v=1708371548\" />Riders like Stewart, who have a track cycling background, relish the opportunities to split things up in the crosswinds: “If it’s windy I’d rather it was full-on crosswinds, then it’s just down to action, everyone knows what is going to happen. When the wind is behind, it creates a lot of tension without any action. That’s way more dangerous. If it’s full-on crosswinds, it’s just physical then. Coming from the track, we’ve sort of got that higher power and that ability to go on and off the gas multiple times”</span></p>\n<p><span>Jayco-Alula’s Luka Mezgec, an experienced one-day racer and sprinter, was in agreement with Stewart that if you’re good at echelons, they can actually be pretty fun.</span></p>\n<p><span>“I actually like it, especially if the bunch is filled with a lot of climbers and a lot of teams are searching for those climbers. If you don’t really have a main GC guy or just have to take care of a sprinter who is good in the crosswinds, then I like it because I like to create a bit of chaos and see what’s going on behind. If you’re in the second or third echelon you say ‘f*ck’ I wish it wouldn’t be windy today,” Mezgec explained. “The safest way is always to take your turns. Sometimes it feels easier to just sit behind but it can quickly go sideways if you lose too many positions and end up in the ditch. Then you need to have good sprinting legs to make those small efforts and regain what you lost.”</span></p>\n<p><span>For sprinters, staying at the front while conserving enough energy as possible is key when the wind is blowing sideways. Phil Bauhaus of Bahrain-Victorious believes that choosing the right moments to put in efforts during echelons is crucial.</span></p>\n<p><span>“It’s best to be in front and be safe. I’m a sprinter, so for me I want to have an easy race. With crosswinds, you’re never sure how much energy you should invest. If you make one mistake, you find yourself in the second and third group,” Bauhaus said. “You have to prepare for everything. You should never feel safe. If you are at the back to be smart and save energy, the next moment you can find yourself in the wind and losing the wheels, then you’re dropped.”</span></p>\n<p><span>Echelon etiquette is also a key part of riding in crosswinds, and, according to the peloton, there are some important things to keep in mind when it comes to what not to do in the crosswinds.</span></p>\n<p><span>“From my experience, don’t sit behind the Italians – so people might be avoiding my wheel being in this team,” Stewart laughed. “It’s the Italian pro conti teams that struggle in these sorts of conditions, but if you’re behind those big guys from Belgium and Holland, you’re probably doing alright. It’s about the wheels you follow.”</span></p>\n<p><span>Mezgec believes that preparation is crucial when it comes to preparing for a day with high risks of crosswinds – knowing the key turns where the wind direction could change forms a key part of Jayco-Alula’s pre-race meetings.</span></p>\n<p><span>“You have to know the points where it's dangerous, when the direction of the wind could potentially split it. You have to be at the front on those points. We have a strong team when it comes to crosswinds, but we need to take care of the climbers too. If we say on the radio, now it’s important to be at the front and follow us when the echelon happens, you have to push them to start working with us so we all stay together,” he said.</span></p>\n<p><span>As the Slovenian rider pointed out, those protecting general classification contenders must always spare a thought for the climbers who aren’t physically suited to the efforts that echelons require. Ilan van Wilder, one of Soudal–Quick-Step’s key climbers, said that while echelons can be a spectacle for those of us on the comfort on our sofas, they are dreaded days for the lightweight climbers.</span></p>\n<p><span>“We have to be in the front as much as possible, but it’s not easy because the whole bunch thinks like this,” Van Wilder commented. “You have to really try to use your power in the right moment, because it’s not easy when sometimes we’re riding at 65kph – on the flat, that’s really hard. For the fans it’s nice, but if you’re at the race for the GC, it’s a horribly stressful day for me. The worst thing you can do is panic.”</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4810bdd6d9a4c96553dc0ef50f90ab249ae8d94203e68fe23e9c793ad755716f","category":"Cycling"}