{"title":"Apple ยอมรับ iPhone 15 ซีรี่ส์มีปัญหาชาร์จไร้สายกับรถ BMW ระบุจะแก้ไขภายในปีนี้","link":"https://www.blognone.com/node/136414","date":1698299496000,"content":"<div><div><div><p>Apple รับทราบถึง<a href=\"https://www.blognone.com/node/136026\">ปัญหาการชาร์จแบบไร้สายของ iPhone 15 ซีรี่ส์กับรถ BMW</a> และสัญญาว่าจะทำการแก้ไขภายในปีนี้</p>\n<p>จากบันทึกภายในที่ส่งให้กับบรรดาผู้ให้บริการที่ได้รับอนุญาตของ Apple นั้น Apple ระบุว่าการชาร์จไร้สายของ iPhone 15, iPhone 15 Plus, iPhone 15 Pro และ iPhone 15 Pro Max ในรถ BMW และ Toyota Supra รุ่นล่าสุดบางรุ่น อาจส่งผลให้โทรศัพท์รุ่นดังกล่าวปิดการใช้งาน NFC ชั่วคราว ซึ่งเกิดขึ้นในสัดส่วนที่<strong>น้อยมาก ๆ</strong> แต่ในบันทึกไม่ได้ระบุสาเหตุแต่อย่างใด</p>\n<p>ใน iPhone นั้นมีชิป NFC สำหรับใช้งานฟีเจอร์ต่าง ๆ เช่น Apple Pay และกุญแจรถยนต์แบบดิจิทัล ซึ่งผู้ใช้ที่ได้รับผลกระทบจากปัญหานี้อาจได้รับข้อความแสดงข้อผิดพลาด ไม่สามารถตั้งค่า Apple Pay ได้ ในแอป Wallet แม้ว่าผู้ใช้จะตั้งค่า Apple Pay แล้วก็ตาม</p>\n<p>Apple กล่าวว่าปัญหานี้จะได้รับการแก้ไขในการอัปเดตซอฟต์แวร์ภายในปลายปีนี้ โดยบันทึกดังกล่าวเพิ่งเผยแพร่ออกมาไม่กี่ชั่วโมงหลังปล่อย iOS 17.1 ออกมา ในระหว่างนี้ Apple แนะนำให้ลูกค้าที่ได้รับผลกระทบหยุดชาร์จโทรศัพท์แบบไร้สายในรถยนต์ไปก่อน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e106d82c66ad46a7532a7cd5e78ab596.png\" /></p>\n<p>นอกจากนี้มีการร้องเรียนบางส่วนเกี่ยวกับปัญหานี้ในฟอรัม MacRumors และ X แต่ไม่มีความชัดเจนว่าปัญหาดังกล่าวแพร่กระจายไปมากเพียงใด ลูกค้าที่ได้รับผลกระทบกล่าวว่า iPhone จะเข้าสู่โหมดการกู้คืนข้อมูลโดยมีหน้าจอสีขาว และชิป NFC จะไม่ทำงานอีกต่อไปหลังจากที่อุปกรณ์รีบูต ลูกค้าไม่สามารถแก้ไขปัญหาได้ ดังนั้นจึงต้องไปที่ Apple Store หรือผู้ให้บริการที่ได้รับอนุญาตจาก Apple</p>\n<p>Apple กล่าวว่าช่างเทคนิคสามารถลองรีสตาร์ทชิป NFC ใน iPhone ที่ได้รับผลกระทบได้โดยใช้เครื่องมือซอฟต์แวร์ของ Apple Service Toolkit 2 หากขั้นตอนนี้ไม่สามารถแก้ไขปัญหาได้ Apple แนะนำให้ช่างเทคนิคซ่อมแซมฮาร์ดแวร์แทน</p>\n<p>ที่มา - <a href=\"https://www.macrumors.com/2023/10/25/apple-to-fix-iphone-15-bmw-charging-issue/\">Macrumors</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/iphone-15-pro\">iPhone 15 Pro</a></div><div><a href=\"/topics/iphone-15\">iPhone 15</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/bmw\">BMW</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4817ceea05357dcfaf9105f80e0f811c1e2d3a4c375cf12999482c366650b3b4","category":"Thai"}