{"title":"True Online เปิดตัว Prepay True Wireless Hi-Speed เน็ตบ้านไร้สายแบบเติมเงิน เริ่มต้นชั่วโมงละ 29 บาท","link":"https://www.blognone.com/node/121389","date":1614244070000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p><strong>True Online</strong> เน้นย้ำความเป็นผู้นำเทคโนโลยีเน็ตบ้าน เปิดบริการใหม่ <strong>Prepay True Wireless Hi-Speed</strong> เน็ตบ้านไร้สายแบบเติมเงิน ความเร็วสูงสุด 200 Mbps ทันที โดยมีแพ็กเกจให้เลือกทั้งแบบรายชั่วโมง รายวัน และรายสัปดาห์ ในราคาเริ่มต้นเพียง 29 บาท ใช้งานสะดวก เหมือนใช้โทรศัพท์แบบเติมเงิน แค่เติมเงินซื้อแพ็กเกจเท่าที่ต้องการจะใช้งานก็สามารถเข้าใช้บริการเน็ตความเร็วสูงได้ทันที</p>\n<p>คุณธนภูมิ ภาคย์วิศาล ผู้อำนวยการและหัวหน้าสายงานการพาณิชย์ ทรูออนไลน์ บมจ. ทรูคอร์ปอเรชั่น กล่าวว่า \"ทรูออนไลน์ ในฐานะผู้นำบรอดแบนด์อินเทอร์เน็ตอันดับ 1 ของไทย  มุ่งมั่นพัฒนานวัตกรรมเพื่อตอบโจทย์ลูกค้าชาวไทยทุกกลุ่มมาโดยตลอด  ล่าสุด พร้อมนำเสนอบริการใหม่  Prepay True Wireless Hi-Speed Prepay True Wireless Hi-Speed เน็ตไร้สาย แบบเติมเงิน ซึ่งเป็นอีกขั้นของการพัฒนาเทคโนโลยีอย่างต่อเนื่องจากทรูออนไลน์  โดยเฉพาะเรื่องของการเพิ่มช่องสัญญาณ\"</p>\n<p>นวัตกรรมใหม่นี้ ตอกย้ำความมุ่งมั่นของ True Online ในการส่งมอบประสบการณ์การใช้งานอินเทอร์เน็ตที่ดีที่สุดแก่คนไทย ด้วยการสรรหาเทคโนโลยีใหม่ๆ และสร้างมาตรฐานใหม่ให้กับวงการอินเทอร์เน็ตบ้านของไทยเทียบเท่ามาตรฐานโลกมาตลอด 16 ปี การันตีโดย 2 รางวัลจากสถาบันทดสอบคุณภาพอินเทอร์เน็ตระดับโลก nPerf คือ “รางวัลอินเทอร์เน็ตบรอดแบรนด์ที่ดีที่สุดในไทยประจำปี 2563” และ “รางวัลไฟเบอร์ดีที่สุดประจำปี 2563”</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5388359fd012a3503ede05d06a1fa87e.jpg\" ></p>\n<p><strong>Prepay True Wireless Hi-Speed</strong> เป็นการให้บริการผ่าน Wi-Fi แบบ dual-band ที่มีทั้ง Wi-Fi แบบ 2.4Ghz และ 5GHz โดยเพิ่มช่องสัญญาณแบนด์วิธขึ้นมาแบบพิเศษ ที่แม้จะทำงานอยู่บนเครือข่ายของ True Fiber Internet แต่ไม่ไปรบกวนการใช้งานของผู้ใช้เดิมแน่นอน</p>\n<p>True Online พัฒนาเครือข่ายแบบ Fixed Wireless network กับ Fixed Broadband ที่อยู่บนเน็ตเวิร์คหลัก (Core Network) เดียวกัน ให้ผสมผสานร่วมกับโครงข่ายรองที่เข้าถึงพื้นที่ใช้งาน (Last Mile Network ) และอุปกรณ์โมเด็ม/เร้าเตอร์ และทำการทดลองทดสอบบริการนี้มาตั้งแต่ช่วงไตรมาส 4 ที่ผ่านมา จนมั่นใจว่ามีคุณภาพและความเสถียรที่น่าพอใจ จึงพร้อมนำนวัตกรรมใหม่นี้ มาเปิดให้บริการ Prepay True Wireless Hi-Speed ให้กับผู้ใช้</p>\n<p>ในเบื้องต้น <strong>Prepay True Wireless Hi-Speed</strong> จะครอบคลุมบริเวณชุมชน ห้างต่างๆ กว่า 100,000 จุด โดยใช้ชื่อเครือข่ายว่า @TrueHiSpeed และจะขยายการให้บริการไปยังอาคารพักอาศัย และจุดอื่นๆ ในอนาคต ซึ่งแต่ละพื้นที่จะมีการใช้อุปกรณ์เครือข่ายเพื่อรองรับจำนวนผู้ใช้งานที่แตกต่างกัน ตอบโจทย์ความต้องการใช้งานอินเทอร์เน็ตที่เพิ่มมากขึ้นโดยเฉพาะในช่วงสถานการณ์โควิดทั้งการทำงานนอกสถานที่ และการเรียนออนไลน์</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/6bd3bba07d54bd130e5ad7551fc342df.jpg\" ></p>\n<p>นอกจากนี้ยังเสริมสร้างความสะดวก ให้กับผู้ที่ไม่อยากหรือไม่สามารถติดตั้งหรือเดินสายไฟเบอร์ เช่นกลุ่มนักเรียน นักศึกษา คนทำงานที่พักอาศัยอยู่หอพัก อพาร์ทเมนต์ เพิ่มความยืดหยุ่นให้ผู้ใช้งานในช่วงระยะเวลาสั้นๆ ที่ไม่อยากมีสัญญาผูกมัดระยะยาว</p>\n<p>การใช้งานทำได้โดยการเลือกเชื่อมต่อกับ Wi-Fi ชื่อ @TrueHiSpeed จากนั้นกดปุ่มเลือกแพกเกจที่ต้องการสมัคร และกรอกเบอร์โทรศัพท์เพื่อรับหมายเลข OTP ก่อนใส่รหัส OTP เพื่อยืนยันการซื้อ จากนั้นรับ SMS ยืนยันการซื้อ พร้อมรหัสผ่านลงชื่อเข้าใช้งาน โดยหนึ่งล็อกอิน สามารถใช้งานได้พร้อมกันถึง 3 อุปกรณ์</p>\n<p>ยอดเงินจะตัดจากใบเสร็จในเดือนถัดไป หรือจากวงเงินในเบอร์โทรศัพท์ของเครือข่าย True สำหรับเครือข่ายอื่น สามารถใช้งานได้ผ่านบัตร Truemoney หรือ Truemoney Wallet และจะมีการเพิ่มช่องทางชำระเงินอื่นในอนาคต</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/003ae364dcef82563cbad860d028f33f.jpg\" ></p>\n<p>True Online เตรียมเปิดให้บริการเน็ตบ้านไร้สาย Prepay True Wireless Hi-Speed อย่างเป็นทางการในวันที่ 1 มีนาคม 2564 ผู้ที่สนใจสามารถอ่านรายละเอียดเพิ่มเติมได้ที่ <a href=\"https://trueonline.truecorp.co.th/PrePayTrueWirelessHiSpeed\">หน้าเพจของ Prepay True Wireless Hi-Speed</a></p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/true\">True</a></div><div class=\"field-item odd\"><a href=\"/topics/isp\">ISP</a></div><div class=\"field-item even\"><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"advertorial","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"481dcac0bfbcfa90ddf1647a1bc0ec3b96a48dcb3e182ce173d6178fbba297de","category":"Thai"}