{"title":"Phytoplankton biomass responses to a marine heat wave align with altered nitracline depth","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12624?af=R","date":1719999272000,"content":"<h2>Abstract</h2>\n<p>The 2014–2015 warm anomaly (aka “the Blob”), the largest of periodic and intensifying marine heat wave (MHW) perturbations in the northeast Pacific, may provide some insight about the future warmer ocean. Here, we use mixed-layer carbon estimates for total phytoplankton, major size classes and functional groups from 45 CalCOFI cruises to: (1) compare 2014–2015 MHW impacts in the southern California Current System to baseline estimates from 2004 to 2013 and (2) to test a space-for-time exchange hypothesis that links biomass structure to variability of nitracline depth (NCD). Seasonal and inshore-offshore analyses from nine stations revealed almost uniform 2°C MHW warming extending 700 km seaward, fourfold to sixfold declines in nitrate concentration and 18-m deeper NCDs. Phytoplankton C decreased 16–21% compared to 45–65% for Chl <i>a</i>, with the threefold difference due to altered C : Chl <i>a</i>. Among size classes, percent composition of nanoplankton decreased and picophytoplankton increased, driven by higher <i>Prochlorococcus</i> biomass, while <i>Synechococcus</i> and picoeukaryotes generally declined. Diatom and dinoflagellate C decreased in both onshore and offshore waters. Seasonally, the MHW delayed the normal winter refresh of surface nitrate, resulting in depressed stocks of total phytoplankton and nanoplankton, <i>Synechococcus</i> and picoeukaryotes during winter. Consistent with the space-for-time hypothesis, biomass variations for baseline and MHW cruises followed similar (not significantly different) slope relationships to NCD. All biomass components, except <i>Prochlorococcus</i>, were negatively related to NCD, and community biomass structure realigned according to regression slopes differences with NCD variability. Empirically derived biomass-NCD relationships could be useful for calibrating models that explore future food-web impacts in this coastal upwelling system.</p>","author":"Michael R. Landry, \nAlexandra L. Freibott, \nJennifer L. Beatty, \nKaren E. Selph","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"481eab147d42688dde4285615582dadd996c98a04a5b5f8f6d9bcd864f1578b4","category":"Environment"}