{"title":"Enhancing Understanding Through Data Visualization: What Can Available Data Reveal About Access to Energy in Displacement Contexts on the African Continent?","link":"https://www.preprints.org/manuscript/202403.1470/v2","date":1715333451000,"content":"The extent of access to energy of displaced populations in settlements and camps in Africa is largely 14 unknown. A multitude of contextual factors, such as the location and the characteristics of housing, 15 the legal status, the socio-cultural background, and the availability of humanitarian and public ser- 16 vices impact the living conditions and the needed energy services. Limitations in accessing energy 17 services have direct, multilayered, and far-reaching implications, including impacts on health, nu- 18 trition, education, protection, and livelihood. The objective of this article is to contribute to a more 19 comprehensive overview of the current state of energy access in displacement contexts on the Afri- 20 can continent by identifying and utilizing existing data. After a screening of the vast and various 21 available information, setting up of a database, consolidating the gathered data as well as assessing 22 the quality through a quality assessment method, the currently available information is visualized 23 and discussed. Considerable differences in the access to electricity for displaced persons across the 24 countries are found. For both electricity and clean cooking, the availability for displaced persons 25 ranges from nearly no access at all up to an access rate of 100%. More strikingly, the results also 26 show that besides South Africa and countries in the Maghreb region, the access to both clean cook- 27 ing and electricity for displaced persons is very low. At the same time, the fragmented data availa- 28 bility, the poor data quality, and the questionable expediency of available data allows neither solid 29 theoretical conclusions nor planning of effective practical implementation measures. Novel inter- 30 disciplinary research, conceptual frameworks and indicators are needed for the purpose of compa- 31 rability and consistency. Future research has the potential to more comprehensively capture the 32 current state of access to energy in displacements contexts and in a next step to examine how energy 33 is interwoven in the lives of displaced people to derive a set of more detailed context-sensitive en- 34 ergy indicators. It is essential that the concerned persons, the displaced persons themselves are in- 35 cluded in the research in a meaningful way.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4827cfd2f62e14fbb96c1aeda54fa30582deb0b977bd09cf1fd4440c8b5cd992","category":"Interdisciplinary"}