{"title":"Apple Halted M2 Chip Production in January Amid 'Plummeting' Mac Sales","link":"https://www.macrumors.com/2023/04/03/apple-stopped-m2-chip-production-1q-2023/","date":1680515084000,"content":"Apple halted production of its M2 series chips at the start of 2023 following a pronounced slump in global demand for MacBooks, claims a new report out of Korea.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/01/M2-MacBook-Pro-and-Mini-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nFacing \"plummeting\" Mac sales amid a severe PC market downturn, Apple in January completely suspended production of its custom-designed M2 series processors that power new MacBook Pro and Mac mini models and the latest MacBook Air, according to <em><a href=\"https://www.thelec.kr/news/articleView.html?idxno=20468\">The Elec</a></em>.\r<br />\n<blockquote>Taiwan's TSMC did not send 5 nano-process M2 chip wafer workpieces to the outsourced semiconductor package test (OSAT) in January and February, according to the OSAT industry on the 3rd. It is believed that it was because Apple requested to stop production as demand for MacBooks dwindled. </blockquote>As the report notes, TSMC finalizes its fabrication process by sending the wafer-processed products to Amkor Technology's Korean factory for packaging work. However, in January and February there were reportedly no products forthcoming, which also forced the package material parts company for M2 chips to stop supplying the usual materials. \r<br />\n\r<br />\nThe suspension is said to have continued through February, after which production of M2 series chips resumed, but they were \"only half the level of the previous year,\" said the Korean-language report, quoting a person familiar with the matter. \r<br />\n\r<br />\nApple's revenue was <a href=\"https://www.macrumors.com/2023/02/02/apple-earnings-call-insights/\">down approximately 5% year-over-year in the first quarter</a>, a steeper decline than had been expected by analysts as Apple grappled with iPhone supply issues in particular but which also saw declines in Mac and wearables.\r<br />\n\r<br />\niPad revenue was up 30% thanks to the launch of new M2 ‌iPad‌ models, but Mac revenue saw a notable drop because there were no new Macs released in the final months of 2022. Mac revenue was $7.7 billion, down from $10.9 billion in the year-ago quarter. ‌\r<br />\n\r<br />\nDuring his <a href=\"https://www.macrumors.com/2023/02/02/apple-1q-2023-earnings/\">Q1 2023 earnings call</a>, CEO Tim Cook admitted that Apple faced a \"challenging\" situation in the PC market. \"The industry is contracting,\" said Cook. \"We have a low share but we have a competitive advantage with Apple silicon, so strategically we are well positioned within the market. But I think it will be a little rough in the short term,\" added the Apple chief.\r<br />\n\r<br />\nApple unveiled the M2 chip in June 2022, when it appeared in an updated 13-inch MacBook Pro and a new MacBook Air. In January 2023, Apple then added M2 Pro and M2 Max variants to its 14-inch and 16-inch MacBook Pro models, and also added M2 and M2 Pro chips to its Mac mini configuration options.\r<br />\n\r<br />\nApple's first custom processor, the M1, was announced in late 2020 and still powers Apple's 24-inch iMac, which was launched in April 2021. Almost a year later the Mac Studio was unveiled with Max and Ultra versions of the same chip. \r<br />\n\r<br />\nAn updated version of the iMac with the M2 chip is seemingly missing from Apple's plans, <a href=\"https://www.macrumors.com/2022/08/05/new-imac-missing-from-plans/\">according to <em>Bloomberg</em>'s Mark Gurman</a>, and there is no word on if or when a refreshed version of the ‌Mac Studio‌ with M2‌ Max and ‌M2‌ Ultra chips will launch.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/macbook-pro-13/\">MacBook Pro 13\"</a>, <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">MacBook Pro 14 &amp; 16\" </a>, <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>, <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/theelec-kr/\">The Elec</a>, <a href=\"https://www.macrumors.com/guide/apple-silicon/\">Apple Silicon</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_13\">13\" MacBook Pro (Caution)</a>, <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_16\">14\" &amp; 16\" MacBook Pro (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#MacBook_Air\">MacBook Air (Neutral)</a>, <a href=\"https://buyersguide.macrumors.com/#Mac_Mini\">Mac Mini (Buy Now)</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/macbook-pro.90\">MacBook Pro</a>, <a href=\"https://forums.macrumors.com/forums/macbook-air.122\">MacBook Air</a>, <a href=\"https://forums.macrumors.com/forums/mac-mini.146\">Mac mini</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/03/apple-stopped-m2-chip-production-1q-2023/\">Apple Halted M2 Chip Production in January Amid 'Plummeting' Mac Sales</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-halted-m2-chip-production-in-january-amid-plummeting-mac-sales.2385725/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"482aa60f7bee93638b998d36e41c8699637ea6956ba91b803a4cbae1de3ee2eb","category":"Apple"}