{"title":"Most High Mountainous Areas Around the World Present Elevation‐Dependent Aridification After the 1970s","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003936?af=R","date":1715151600000,"content":"<h2>Abstract</h2>\n<p>The research on the trends of mountainous aridity and the issue of elevation-dependent aridity (EDA) has long been hindered by limitations in data validity. In this study, we present global monthly merged data sets of Vapor Pressure Deficit and Aridity Index (AI) from 1960 to 2020, aiming to detect and attribute elevation-dependent patterns of atmospheric and soil aridity in six representative high mountainous areas worldwide. Our findings reveal that most of the mountainous regions experienced significant aridification after the 1970s (<i>p</i> &lt; 0.05). The Rocky Mountains and Ethiopian Highlands are identified as the most vulnerable areas, with both atmospheric and soil aridity increasing by 13% across all elevation gradients. Significant humidification has been observed only in High Asian Regions at 4,000 m above sea level with an approximate decrease of 11% in soil AI. In both temporal and spatial patterns, soil aridity exhibits stronger heterogeneity compared to atmospheric aridity, with certain regions and seasons showing humidification, despite the overall aridification trend. Elevation-dependent aridity is observed in two-thirds of the mountains, but whether high altitude alleviates or amplifies aridity depends on the pattern of precipitation changes at different elevations. The rise in air temperature is the primary driving factor for soil and atmospheric aridification, contributing to over 50% of each. In two-thirds of the regions, changes in precipitation exacerbate soil aridity. Simulations show that human activities are closely related to the ongoing prolonged atmospheric aridification. This study contributes to a comprehensive understanding of global mountainous aridity evolution projected under climate change.</p>","author":"Jiapei Ma, \nGenxu Wang, \nShouqin Sun, \nJinlong Li, \nPeng Huang, \nLinmao Guo, \nKai Li, \nShan Lin","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"482ee09cfd47da9c2912cab4ad830084835ddfa489820db8de9336ac402a3912","category":"Environment"}