{"title":"Derived Neutrophils to Lymphocyte Ratio Predicts Survival Benefit from TPF Induction Chemotherapy in Local Advanced Oral Squamous Cellular Carcinoma","link":"https://www.preprints.org/manuscript/202407.0387/v1","date":1720079847000,"content":"Background: To evaluate derived neutrophil to lymphocyte ratio (dNLR) in predicting the prognosis of patients with locally advanced oral squamous cell carcinoma (LAOSCC), and the survival benefits from docetaxel, cisplatin, and 5-FU (TPF) induction chemotherapy (IC); Methods: Patients from a phase III trial involving TPF IC in stage III/IVA OSCC patients (NCT01542931) were enrolled. Receiver operating characteristic curves were built and area under the curve was computed to determine dNLR cutoff points. Kaplan-Meier estimates of survival and Cox proportional hazards models were used for longitudinal analysis; (3) Results: 224 patients were identified (median age, 55.4 yr; range, 26 to 75 yr; median follow-up, 90 months; range, 3.2 to 93 months); Cutoff points for dNLR was 1.555. Multivariate analysis showed dNLR was an independent negative predictive factor for survival (overall survival (OS): hazard ratio (HR) = 1.154, 95% confidence interval (CI): 1.018-1.309, P = 0.025, disease-free survival (DFS): HR = 1.123, 95% CI: 0.260-1.000, P = 0.050, local recurrence-free survival (LRFS): HR = 1.134, 95% CI: 1.002-1.283, P = 0.047, distant metastasis-free survival (DMFS): HR = 1.146, 95% CI: 1.010-1.300, P = 0.035). Low dNLR combining cTNM stage III disease predicts benefit from TPF IC for the patients [OS (χ² = 4.674, P = 0.031), DFS (χ² = 7.134, P = 0.008), LRFS (χ² = 5.937, P = 0.015) and DMFS (χ² = 4.832, P = 0.028)]; (4) Conclusions: dNLR is an independent negative predictive factor in LAOSCC patients. Patients of cTNM stage III and low dNLR can benefit from TPF IC.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4830c1f35b9d957a294c924acfc1b3a63a2ee99caa43a82db9445447a3d9929d","category":"Interdisciplinary"}