{"title":"Five two-wheeled adventures with Canyon that’ll cost you less than you think","link":"https://www.bikeradar.com/advertising-feature/five-two-wheeled-adventures-with-canyon-thatll-cost-you-less-than-you-think/","date":1638014456000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/img-1-lifestyle-pathliteon-3fbf4c4.jpg?quality=90&amp;resize=620,413\" />                                            <p>Cycling has always been a cost-effective and eco-friendly way to explore, but investing in a bike is still a big financial commitment. By opting for a direct-to-consumer brand such as Canyon and reducing the cost through a Cycle to Work scheme, you can enjoy all sorts of epic two-wheeled adventures without completely emptying your bank account.</p>\n<p>Canyon is well known for its bikes’ excellent value for money. The German manufacturer’s range caters for everyone from pro-peloton athletes to eco-conscious commuters, meaning there’s something for everyone.</p>\n<p>To highlight the diversity of the Canyon range, here are five UK cycling adventures and the Canyon bikes equipped to tackle them. The best part? They’re all available to purchase through the UK’s leading Cycle to Work provider, <a href=\"https://www.canyon.com/en-gb/customer-service/cyclescheme.html?utm_medium=referral&amp;utm_source=bikeradar&amp;utm_campaign=cyclescheme_dec2021\" target=\"_blank\">Cyclescheme</a>, saving you 25-39 per cent.</p>\n<section><div>\n        <h2>How does Cyclescheme work?</h2>\n<p>In short, you choose a bike, pay nothing up front and spread the cost with monthly repayments via salary sacrifice.</p>\n<p>These come directly out of your salary, meaning you don’t pay any tax or National Insurance contributions on your repayments.</p>\n<p>Exactly how much you’ll save depends on your tax band – those in higher tax rate bands can save up to 39 per cent, whereas those in the basic tax rate bands will save from 25 per cent. </p>\n<p>At the end of your agreement, you’ll pay a small fee to transfer the bike into your full ownership. Alternatively, you can return the bike at no cost. </p>\n<h3>Why should you use Cyclescheme?</h3>\n<p>First and foremost, purchasing through Cyclescheme will save you a significant chunk of money on your new bike. </p>\n<p>Thinking more broadly, when compared to the cost of commuting by car or paying for a typical annual railcard, purchasing a discounted bike through Cyclescheme could offer enormous savings on your living costs. </p>\n<p>Not only that, but it’s also a good way to reduce your carbon footprint and improve your health – both physical and mental. </p>\n<p>If you’re interested in finding out how much you could cut your C02 emissions by and how many calories you could burn, take a look at Cyclescheme’s <a href=\"https://www.cyclescheme.co.uk/health-calculator\" target=\"_blank\">health calculator</a> to see the potential benefits in black and white.</p>\n<p>\n\n    </p></div>\n    </section><h2>Five adventures you can have with Canyon</h2>\n<h3>Ride the C2C with the Canyon Pathlite:ON 8</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Pathlite:ON 8 has a 200km range.</span></figcaption><span> <i>Canyon</i></span></div>\n<p>Spanning 137 miles between the North Sea and the Irish Sea, the C2C (coast to coast) is the most popular cycling challenge in the UK. The route takes in spectacular views of rolling hills, mountains and coastlines as it meanders its way through Northumberland, skirts around the North Pennines and the Lake District, and hugs the Solway Coast.</p>\n<p>As one of Canyon’s top-end e-tourers, the <a href=\"https://www.canyon.com/en-gb/electric-bikes/electric-touring-bikes/pathlite-on/?utm_medium=referral&amp;utm_source=bikeradar&amp;utm_campaign=cyclescheme_dec2021\" target=\"_blank\">Pathlite:ON 8</a> is well-equipped for the challenge. It’s built for comfort over long distances, with an upright riding position and ergonomic handlebars. And with its 200km range and beefy 57mm tyres, there are few places it’ll struggle to go.</p>\n<p>The Pathlite:ON can be equipped with dual batteries for long days in the saddle, but the external power pack is easily removed to reduce weight on shorter rides. Despite the room said external power pack takes up in the front triangle, there is still space for two bottles. Plus, a sturdy luggage rack ensures there’s ample capacity to carry everything else too.</p>\n<ul><li>RRP: £3,749</li>\n<li>Cyclescheme price: basic rate £2,811.75, higher rate £2,436.85</li>\n</ul><h3>Take the scenic route to the office with the Canyon Commuter:ON 7</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Canyon’s Commuter:ON 7 is available in two frame styles.</span></figcaption><span> <i>Canyon</i></span></div>\n<p>Cyclescheme’s primary purpose is to encourage people to cycle to work. This is great for the environment, but it can also be an opportunity to discover new routes and explore hidden parts of your local area every day.</p>\n<p>Regardless of where you live, taking your commute from four wheels to two and getting off the beaten track is an excellent way to fit some exercise around work, and improve your mental health. It’s amazing what a bit of fresh air and some endorphins first thing in the morning can do.</p>\n<p>The <a href=\"https://www.canyon.com/en-gb/electric-bikes/electric-city-bike/commuter-on/?utm_medium=referral&amp;utm_source=bikeradar&amp;utm_campaign=cyclescheme_dec2021\" target=\"_blank\">Commuter:ON 7</a> is a great option for this. It’s a nimble city bike that can provide some assistance when required. It’s lightweight for an electric bike too, and is available in two frame styles – mid-step and step-over – to suit riders of all shapes and sizes.</p>\n<p>At the core of the bike is a Fazua Ride 50 Evation motor. It offers a range of up to 75km and will deliver maximum support of 250 watts. Built-in lights will keep riders safe and visible on evening or early-morning commutes, and there’s also an Ortlieb rack to carry office supplies or shopping.</p>\n<ul><li>RRP: £3,099</li>\n<li>Cyclescheme price: basic rate £2,324.25, higher rate £2,014.35</li>\n</ul><h3>Get muddy in Kielder Forest with the Canyon Grail:ON CF 7 WMN</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Gravel riders can get big savings on the Grail:ON CF 7 WMN.</span></figcaption><span> <i>Canyon</i></span></div>\n<p>Northumberland is one of the most underrated cycling destinations in the UK, but that works in the favour of those who know. Situated right on the Scottish border, Kielder Forest is one of the largest areas of woodland in the UK, and, thanks to the region’s relatively sparse population, is often completely deserted.</p>\n<p>Kielder is also home to a vast network of dusty fireroads, woodland singletrack and MTB trails, making it prime gravel-bike territory.</p>\n<p>Boasting a powerful motor, generous tyre clearance and a low centre of gravity, the <a href=\"https://www.canyon.com/en-gb/electric-bikes/electric-gravel-bikes/grail-on/?utm_medium=referral&amp;utm_source=bikeradar&amp;utm_campaign=cyclescheme_dec2021\" target=\"_blank\">Grail:ON CF 7 WMN</a> is perfect for exploring the forest. With a more upright riding position than the standard Grail, it’s built to feel relaxed and comfortable, and the shock-damping seatpost takes the bite out of rough terrain.</p>\n<p>Much like the Grail, the Grail:ON features Canyon’s innovative double-decker bar. It’s constructed from carbon and designed to absorb shock, but it also opens up a wider range of hand positions than a traditional bar.</p>\n<ul><li>RRP: £4,699</li>\n<li>Cyclescheme price: basic rate £3,524.25, higher rate £3,054.35</li>\n</ul><h3>Tackle some towpaths with the Canyon Roadlite 7</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Roadlite 7 is a lightweight and versatile hybrid.</span></figcaption><span> <i>Canyon</i></span></div>\n<p>From Scotland’s Great Glen Way to Lancaster Canal in the Lakes, the UK is home to some outstanding towpath action. Following the waterways is a great way to get away from the traffic and remind yourself what cycling is all about, and Canyon’s <a href=\"https://www.canyon.com/en-gb/hybrid-bikes/city-bikes/roadlite/?utm_medium=referral&amp;utm_source=bikeradar&amp;utm_campaign=cyclescheme_dec2021\" target=\"_blank\">Roadlite 7</a> is the perfect bike for the job.</p>\n<p>Combining the speed and agility of a road bike with the comfort and control of flat bars, the Roadlite 7 is a great-looking hybrid with a lot to offer.</p>\n<p>It’s equipped with a mix of Shimano 105 and Ultegra components for smooth, reliable shifting, and is built around disc brakes as standard for total control in all conditions.</p>\n<p>Comfortable 30mm tyres roll well over tarmac, but provide sufficient cushioning to tackle unpaved towpaths too. Overall, it’s a fast, light, versatile machine that’ll suit anyone looking to improve their fitness and get outside.</p>\n<ul><li>RRP: £1,499</li>\n<li>Cyclescheme price: basic rate £1,124.25, higher rate £974.35</li>\n</ul><h3>Explore London with the Canyon Precede:ON CF 8 ST</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Soak up London’s bustling urban atmosphere on the Precede:ON CF 8.</span></figcaption><span> <i>Canyon</i></span></div>\n<p>Braving the Big Smoke on two wheels can feel daunting, but it’s actually one of the UK’s safest cities to ride in. Recent years have seen big improvements in cycling infrastructure, making a bike one of the best tools for exploring the city.</p>\n<p>So, why not forget the open-top bus and navigate the city’s nooks and crannies on a state-of-the-art e-bike instead?</p>\n<p>The <a href=\"https://www.canyon.com/en-gb/electric-bikes/electric-city-bike/precede-on/?utm_medium=referral&amp;utm_source=bikeradar&amp;utm_campaign=cyclescheme_dec2021\" target=\"_blank\">Precede:ON CF 8 ST</a> is built for urban life. It’s got everything required to get around the city quickly and comfortably, all rolled up into one stylish package.</p>\n<p>Powered by a Bosch Performance Line CX motor, it has a 100km range and provides swift acceleration to get from A to B in plenty of time.</p>\n<p>The most impressive part is probably the cockpit. It features a sleek, one-piece bar and stem that houses the first ever set of integrated brake levers. There’s even a bell, a Supernova front light and a built-in Bosch Kiox computer that provides GPS, fitness data and sensor connectivity too.</p>\n<ul><li>RRP: £3,999</li>\n<li>Cyclescheme price: basic rate £2,999.25, higher rate £2,599.35</li>\n</ul><p>To find out more about the Cyclescheme with Canyon, click <a href=\"https://www.canyon.com/en-gb/customer-service/cyclescheme.html?utm_medium=referral&amp;utm_source=bikeradar&amp;utm_campaign=cyclescheme_dec2021\" target=\"_blank\">Cyclescheme</a></p>","author":"Paddy Maddison","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"4844fd9315d00e2a759eb5981112de4c62ecb04512ff8ff87e1b432590e8f859","category":"Cycling"}