{"title":"Removal of insecticides from waters and soils by sulfate radical‐based advanced oxidation processes","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300055?af=R","date":1717665340000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/ed1de989-624a-4f2d-944b-445e0de2b25c/appl202300055-gra-0001-m.png\" alt=\"Removal of insecticides from waters and soils by sulfate radical-based advanced oxidation processes\" /><p>This critical review analyzes the articles published over the destruction of insecticides from waters and soils by persulfate (PS) (S<sub>2</sub>O<sub>8</sub>\n<sup>2−</sup>) and peroxymonosulfate (PMS) (HSO<sub>5</sub>\n<sup>−</sup>) based processes. Sulfate radical (SO<sub>4</sub>\n<sup>●−</sup>) and hydroxyl radical (<sup>●</sup>OH) are generated as oxidizing agents from the activation of both, PS and PMS oxidants.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Insecticides are toxic compounds widely used to prevent, destroy, and control any insect pests. A larger food production with increasing agricultural activity has been ensured from their application to farmlands. Insecticides have been detected in waters and soils being dangerous for living beings. Due to their high biorecalcitrance and stability at ambient conditions, they cannot be destroyed in conventional wastewater treatment plants (WWTPs) and powerful advanced oxidation processes (AOPs) are being developed for their removal. This review presents a detailed and critical analysis over the application of sulfate radical-based AOPs to the remediation of waters and soils polluted with insecticides. Persulfate (PS) and peroxymonosulfate (PMS) are used as parent oxidants but they need to be activated to produce strong effective oxidizing radicals such as sulfate radical (SO<sub>4</sub>\n<sup>●−</sup>) and hydroxyl radical (<sup>●</sup>OH). Alkaline, thermal, catalytic, UV, UV with Fe, photocatalytic, and other methods applied as activators of PS and/or PMS are separately analyzed in waters and soils. For each hybrid procedure, the fundamentals are briefly detailed and the best results reported in the literature are summarized and discussed. The effect of operating parameters on the oxidation power of treatments in pure water, real waters, WWTPs effluents, and contaminated soils are remarked to show the viability of sulfate radical-based AOPs for insecticides removal from waters and soils. The effect of added common anions and natural organic matter, the detection of oxidizing radicals by selective scavengers and electron paramagnetic resonance, and the identification of the generated by-products in waters are described. Comparisons with analogous treatments with H<sub>2</sub>O<sub>2</sub> and Fenton are discussed as well. Further research efforts should consider a deeper study of PS- and/or PMS-based processes of insecticides not only in actual agricultural and real wastewaters, but also in many soils to confirm their possible suitability at the industrial level.</p>","author":"Enric Brillas","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"4844971d6a3c271b96e61d3df379ebae6234f85192d4e7384eee48ab401a6e85","category":"Environment"}