{"title":"PSXI-7 Effects of selected feed additives on feedlot cattle performance when fed diets containing rehydrated corn grain silage","link":"https://academic.oup.com/jas/article/102/Supplement_3/755/7757631?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The use of additives makes it possible to improve body weight (BW) gain and muscle growth, the efficiency of nutrient use, in addition to reducing the incidence of metabolic disorders. The objective of the study was to evaluate the performance, feed intake and carcass production of feedlot Nelore cattle, fed with a high concentrate diet, using different feed additives. Nelore bulls [n = 48; initial BW (BWi = 378.1 kg ± 8.92 kg; 20 mo of age), were used. Bulls were allocated in a collective pen, randomly distributed in two treatments: 1) Sodium Monensin (MON), 26 mg/kg DM; and2) CRINA + RUMISTAR + Hy-D (CRD), blend of essential oils, 90 mg/kg DM + exogenous α-amylase, 560 mg/kg DM + 25 hydroxyvitamin D3, 1 mgּ animal<sup>-1</sup>ּ d<sup>-1</sup>. The experiment lasted 101 d, the animals were weighed fasting (± 16 h) at the beginning and end of the experiment, at the end of the experiment the animals were subjected to carcass ultrasound, dry matter intake (DMI) was measured daily individually using electronic troughs with selector doors (Intergado, PONTA, Betim, MG-Brazil). The initial carcass weight (195.6 kg, <span>P</span> = 1.0) was estimated using the equation HCWi = 0.6587*BWi-53.44 (R² = 0.993), obtained through the reference slaughter of 9 animals, and the final carcass weight measured in the refrigerator. The “step-up” adaptation protocol lasted 15 d, followed by the finishing diet until the end of the experimental period, consisting of ground corn, rehydrated corn grain silage, cottonseed cake, whole cottonseed, sugarcane bagasse, urea and vitamin-mineral supplement. Data were analyzed by SAS PROC ANOVA, using BWi as a covariate when significant. Animals fed CRD had a greater final BW (534.0 vs 515.6 kg, <span>P</span> = 0.003) and increased average daily gain (ADG) by 0.180 kg/d (1.54 vs 1.36 kg/d, <span>P</span> = 0.003). DMI was greater (10.2 vs 9.3 kg/d, <span>P</span> &lt; 0.001) as well as DMI:BW (2.24 vs 2.09 %BW/d, <span>P</span> &lt; 0.001). The feed efficiency did not differ between treatments (<span>P</span> = 0.21). Animals fed CRD presented heavier HCW (305 vs 291 kg, <span>P</span> = 0.004) and ADG carcass (1.08 vs 0.95 kg/d, <span>P</span> = 0.004). The carcass conversion, calculated as kg DM/15 kg carcass produced (143.5 vs 152.6, <span>P</span> = 0.11), carcass yield (<span>P</span> = 0.15), 12th ribeye area (<span>P</span> = 0.52) and 12th rib fat (<span>P</span> = 0.12), were similar among the treatments. Feeding CRD tended to improve marbling (1.67 vs 1.45%, <span>P</span> = 0.08). These results underscore the potential of CRD as an effective alternative to traditional additives in enhancing the performance and carcass quality of feedlot cattle.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"486f238db2f8babadda8439b9f595e376b4e65bf1a05781b5d25dd5055536ee5","category":"Environment"}