{"title":"WeTV งัดกลยุทธ์ 3X มาใช้ ตั้งเป้าโต 3 เท่า เพิ่มซีรีส์ญี่ปุ่น, อีสปอร์ต และฟีเจอร์จอในจอ","link":"https://www.blognone.com/node/124855","date":1632202317000,"content":"<div><div><div><p>WeTV สตรีมมิงจาก Tencent  แถลงยุทธศาสตร์ใหม่ ตั้งเป้าเป็นสตรีมมิงอันดับสองของภูมิภาคเอเชียตะวันออกเฉียงใต้ เพิ่มเนื้อหาซีรีส์ญี่ปุ่น และการถ่ายทอดสดอีสปอร์ต พร้อมเพิ่มเครื่องมือรองรับการโฆษณาเพื่อดึงดูดแบรนด์มาลงโฆษณาบน WeTV</p>\n<p>WeTV เปิดตัวในไทยอย่างเป็นทางการในปี 2019 และสร้างชื่อให้กับตัวเองด้วยซีรีส์จีนดังเรื่อง ปรมาจารย์ลัทธิมาร</p>\n<p>นางสาวกนกพร ปรัชญาเศรษฐ ประธานเจ้าหน้าที่ฝ่ายการตลาด และการขาย และผู้จัดการ WeTV ประจำประเทศไทย เล่าภาพรวมความเติบโตในไทยให้ฟังว่า ปัจจุบัน WeTV มีผู้ใช้งานรายเดือน 13 ล้านราย 1 ใน 4 เป็นผู้ใช้งาน VIP (WeTV มีโมเดลดูฟรีด้วยแต่สามารถจ่ายเพื่อดูเนื้อหาทั้งหมดได้) ผู้หญิงยังคงเป็นกลุ่มผู้ใช้งานหลัก โดยใน 2-3 ปีถัดไปเตรียมงัดกลยุทธ์ 3X มาใช้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/82eda8667216cf441c189a9047dbd44d.png\" /></p>\n<p>ส่วนประเด็นรัฐบาลจีนมีนโยบายควบคุมวงการบันเทิงเข้มข้น ไม่ว่าจะเป็นการแบนระบบโหวตไอดอล ลบข้อมูลดาราจีนตามโซเชียล ควบคุมพฤติกรรมไอดอลให้เป็นไปในรูปแบบที่รัฐบาลจีนต้องการ นางสาวกนกพร ระบุว่า ทางบริษัททำตามกฎหมายของประเทศนั้นๆ ที่เราเข้าไปดำเนินธุรกิจ</p>\n<p>สำหรับกลยุทธ์ที่ WeTV คือ 3X คือ Expansion, Extra Experience, Exclusivity เพื่อเป้าหมายการเติบโต 3 เท่าภายในปี 2023</p>\n<ul>\n<li><strong>Expansion</strong> ขยายเนื้อหาบนแพลตฟอร์มให้ครอบคลุมซีรีส์ญี่ปุ่น และการถ่ายทอดสดอีสปอร์ต จากเดิมที่เน้นซีรีส์จีน และ WeTV Original ที่เกิดจากการร่วมสร้างในไทยและเกาหลี นอกจากนี้ยังทำ Cross-platform กับช่อง 8 นำละครของ WeTV ไปฉายยังช่อง 8 เพื่อเข้าถึงผู้ใช้รายใหม่เพิ่มเติม<br />\nขยายความร่วมมือกับเครือข่ายโทรคมนาคม, บริษัททำ OTT Device และ Payment Gateway เพิ่มช่องทางการจ่ายเงินให้สะดวก และเพิ่มช่องทางการรับชมบนจอใหญ่ผ่านอุปกรณ์ OTT Device</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c605cb3446c5cdef8314744692b83bbe.png\" /></p>\n<ul>\n<li><strong>Extra Experience</strong> เพิ่มฟีเจอร์ใหม่ๆ ระหว่างดู WeTV เช่น Flying Comment การพิมพ์ระหว่างดูซีรีส์สดเพื่อเพิ่มอรรถรส, ฟีเจอร์ Ins-screen หรือดูซีรีส์ไปพร้อมกับการใช้งานแอปอื่น, VIP Digital Gift Card ส่งบัตรของขวัญให้เพื่อนๆ ได้, ฟีเจอร์ Rent เช่าชมคอนเทนต์พิเศษ เช่นเบื้องหลังการถ่ายทำซีรีส์ เป็นต้น</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/341053580cd65e51df2d65a6d6bc18ce.png\" /></p>\n<ul>\n<li><strong>Exclusivity</strong> นำเสนอคอนเทนต์ให้ดูที่แรกทั้งในรูปแบบ First Run และดูย้อนหลัง Rerun โดยในช่วงครึ่งปีหลังนี้ WeTV จับมือกับพันธมิตรผู้ผลิตคอนเทนต์ชั้นนำของประเทศไทย เปิดตัว WeTV ORIGINAL ออริจินัลคอนเทนต์ไทยทั้งหมด 13 เรื่อง นำทัพความบันเทิงด้วย “เมียหลวง” “เด็กฝึกหน้าใส เติมหัวใจนายหญิง” “กลรักรุ่นพี่” “Bangkok Fable” และ “ออฟฟิศติดฮา”  เป็นต้น รวมถึงซีรีส์จีนเรื่องใหม่ราว 13 เรื่องที่จะนำเข้ามาบนแพลตฟอร์ม</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/82eda8667216cf441c189a9047dbd44d.png\" /></p>\n<p>นอกจากนี้ WeTV นำเสนอฟีเจอร์เพื่อการลงโฆษณาในหลากหลายรูปแบบ เช่น โฆษณาก่อนเริ่มเรื่อง กลางเรื่อง รวมถึงแบนเนอร์กราฟิกใน trailer สามารถสอดแทรกโลโก้แบรนด์ลงในแบนเนอร์ได้ และที่น่าสนใจคือ อนาคต WeTV จะเพิ่มฟีเจอร์วางสินค้าแบรนด์ในรูปแบบ 2-3 มิติลงในเนื้อหาซีรีส์ (In App Placement) ได้ด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/597a6d632dd93012c0dd1a9833918383.png\" /></p>\n<p>ที่มา - งานแถลงข่าว</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/wetv\">WeTV</a></div><div><a href=\"/topics/tencent\">Tencent</a></div><div><a href=\"/topics/thailand\">Thailand</a></div><div><a href=\"/topics/streaming\">Streaming</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"48876c0e099d66a8f0be0da35bd609dd3d8fbca4669fc4476f8eb6629f502600","category":"Thai"}