{"title":"Evaluating Inclusion of Commercial Pistachio By-Product as Functional Ingredients in Rainbow Trout Fishmeal and Plant-Meal Based Diets","link":"https://www.preprints.org/manuscript/202408.2069/v1","date":1724920904000,"content":"The growing demand for sustainable aquaculture requires exploring alternative protein sources for fish diets. However, some of these alternatives can have adverse health effects, prompting research into functional feed ingredients to mitigate these issues. This study investigated pistachio shell powder (PSP), a by-product rich in antioxidants, as a functional feed ingredient in rainbow trout diets. The dose-dependent effects of PSP inclusion (0%, 0.5%, 1%, 2%) on growth performance, intestinal health, and gut microbiota were assessed in fish fed either a fish meal (FM) or plant meal (PM) diet. Over a 12-week feeding period, rainbow trout fingerlings were assigned to diets incorporating varying levels of PSP in either FM or PM diets. Growth performance, intestinal morphology, gene expression, total antioxidant capacity (TAC), total phenolic compound (TPC) levels, and gut microbiota composition were evaluated. PSP at 1% significantly (P&amp;lt;0.05) improved weight gain and growth index in FM diets but did not affect growth in PM diets. No significant differences (P&amp;gt;0.05) were observed in other growth parameters, intestinal health, or oxidative stress markers, though a trend toward down-regulation of inflammatory genes was noted in PM diets at 2% PSP. PSP inclusion did not significantly alter gut microbiota alpha diversity but significantly (P&amp;lt;0.05) affected beta diversity in FM diets at the 0.5% level. Differential abundance analysis of gut microbiota revealed taxa-specific responses to PSP, particularly the genus Candidatus arthromitus increasing in relative abundance with PSP inclusion in both FM and PM based diets. Overall, PSP inclusion up to 2% did not elicit significant adverse effects on growth, intestinal health, or antioxidant status.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"488d099ea49d308c177fb02b3ad05f848d851030c04fcb456bd9646ad13189b1","category":"Interdisciplinary"}