{"title":"Balancing Stocking Density and Feed Intake for Barramundi (Lates calcarifer) Raised in Recirculating Aquaculture Systems","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/2264274?af=R","date":1728053281000,"content":"<p>To address the growing demand for optimization strategies in recirculating aquaculture systems (RAS), this study investigates the impact of stocking density and feeding levels on barramundi (<i>Lates calcarifer</i>). A total of 3510 fish with an initial weight of 50.2 ± 1.1 g were allocated into 27 tanks, each with a volume of 1 m<sup>3</sup>. The fish were grown at three stocking densities: low (LD, 5.6 kg m<sup>−3</sup>) with 110 fish per tank, medium (MD, 6.7 kg m<sup>−3</sup>) with 130 fish per tank, and high (HD, 7.7 kg m<sup>−3</sup>) with 150 fish per tank. All fish were fed to satiation but were offered three feeding levels that varied according to fish body weight (BW): standard (SF, 20.6 × BW<sup>−0.418</sup>), high (HF, 11.4 × BW<sup>−0.242</sup>), and very high (VHF, 7.0 × BW<sup>−0.094</sup>). After 8 weeks, the stocking density had increased to 24.9, 29.3, and 33.0 kg m<sup>−3</sup> in the LD, MD, and HD groups, respectively. The biomass gain increased with both stocking density and feeding levels (<i>P</i> &lt; 0.001), reaching 23.6 kg in both HD-HF and HD-MF groups. Higher stocking density was found to reduce fish BW gain (<i>P</i> &lt; 0.05) and total feed intake (<i>P</i> &lt; 0.05), while lower feeding levels significantly improved the feed conversion ratio (<i>P</i> &lt; 0.001). The consistency of daily feed intake (DFI, as a proportion of BW) was dependent on feeding level in all groups. Subsatiation feeding levels maintained consistent feed intake, whereas exceeding satiation levels led to irregular feed intake patterns and a significant increase in day-to-day and tank-to-tank variabilities. The DFI 1 day before the first feed refusal was used to propose an optimized feeding table for barramundi. This study emphasizes the tradeoff between overall tank productivity and individual fish performance and showed that slightly underfeeding barramundi can be beneficial for day-to-day farm management.</p>","author":"Richard Le Boucher, \nWeiqiang Chung, \nJessalin Kai Lin Ng, \nLydia Shun En Tan, \nCo Sin Lee, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"48948b797b2b6cd348adb57440eb588ed63362c6407299517891051ab0aa0889","category":"Environment"}