{"title":"Changes in phosphorus‐related performance attributes of dryland winter wheat cultivars released between the 1940s and 2010s in Shaanxi Province, China","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13793?af=R","date":1723098225000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Water and nutrients are two main determinants of wheat yield, which are vital for maintaining high crop yields. In the present study, the effects of water and phosphate fertilization on wheat yield, photosynthetic parameters, water productivity and phosphate use efficiency were investigated. Five dryland wheat cultivars from the 1940s to the 2010s that are widely cultivated in Shaanxi Province, China, were used. Experiments were conducted from 2019 to 2022 using two irrigation levels (normal rainfall and no precipitation after the reviving stage) and two phosphorus application levels (0 and 100 kg ha<sup>−1</sup>).</p>\n<h2>RESULTS</h2>\n<p>Compared with old cultivars (‘Mazha’), the grain yield of modern cultivars (‘Changhan 58’) was 89.24% higher and was closely correlated with chlorophyll index, leaf area index, photosynthetic rate and tillers. With the replacement of cultivars, the phosphorus content, water potential and phosphatase activity of wheat leaves increased. Considering water–phosphorus interactions, the water use efficiency and phosphorus use efficiency of wheat showed a significant positive correlation.</p>\n<h2>CONCLUSION</h2>\n<p>Our findings indicate that modern wheat cultivars are more responsive to phosphorus. Further analysis revealed that modern varieties have evolved two phosphorus absorption strategies in response to phosphorus deficiency – namely, the formation of a phosphorus supply source, which may result in larger numbers of green organs; and an increase in phosphorus sinks, which tended to activation and transport of plant phosphorus. Our results may thus contribute to water conservation, increased yields and the development of strategies for efficient phosphorus fertilization. © 2024 Society of Chemical Industry.</p>","author":"Zhan He, \nHuida Lian, \nCheng Qin, \nJiakun Yan, \nHongbing Li, \nSuiqi Zhang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"48954b223891ef43da4f78179cd93c85fd6e7d92ca3e4c5a3077bc304c35473c","category":"Environment"}