{"title":"Android malware steals user credentials using optical character recognition","link":"https://arstechnica.com/?p=1957518","date":1690576282000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/smartphone-800x534.jpg\" alt=\"Android malware steals user credentials using optical character recognition\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/smartphone.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Security researchers have unearthed a rare malware find: malicious Android apps that use optical character recognition to steal credentials displayed on phone screens.</p>\n<p>The malware, dubbed CherryBlos by researchers from security firm Trend Micro, has been embedded into at least four Android apps available outside of Google Play, specifically on sites promoting money-making scams. One of the apps was <a href=\"https://web.archive.org/web/20230618192931/https://play.google.com/store/apps/details?id=com.miner.synthnet\">available</a> for close to a month on Google Play but didn’t contain the malicious CherryBlos payload. The researchers also discovered suspicious apps on Google Play that were created by the same developers, but they also didn’t contain the payload.</p>\n<h2>Advanced techniques</h2>\n<p>The apps took great care to conceal their malicious functionality. They used a paid version of commercial software known as Jiagubao to encrypt code and code strings to prevent analysis that can detect such functionality. They also featured techniques to ensure the app remained active on phones that had installed it. When users opened legitimate apps for Binance and other cryptocurrency services, CherryBlos overlaid windows that mimicked those of the legitimate apps. During withdrawals, CherryBlos replaced the wallet address the victim selected to receive the funds with an address controlled by the attacker.</p></div><p><a href=\"https://arstechnica.com/?p=1957518#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1957518&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"48953e8eac5af01bb563e88debbb7cb859eca12f8b308956c13712ba6a9920b7","category":"Tech"}