{"title":"Effect of ozone sterilization on controlling leaf mildew and gray mold tomato disease in a glasshouse and its influence on other growth parameters","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13292?af=R","date":1712732400000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>In order to explore the effect of ozone sterilization treatment on tomato disease control and increase fruit setting rate, this study took 906 pink fruit tomato as test material, used a small ozone generator to carry out ozone treatment single-factor test, and then selected orthogonal table to guide the ozone treatment combination. The effects of different ozone treatment concentration, ozone treatment duration and ozone treatment times on the growth, disease and fruit setting rate of potted tomato were analyzed.</p>\n<h2>RESULTS</h2>\n<p>Different ozone treatment had effects on leaf mildew, gray mold and fruit setting rate of tomato. The influence degree of three factors on leaf mildew, gray mold and fruit setting rate was from large to small, <i>a</i> &gt; <i>b</i> &gt; <i>c</i>, <i>a</i> &gt; <i>c</i> &gt; <i>b</i>, <i>b</i> &gt; <i>a</i> &gt; <i>c</i>. A quadratic regression model was established with the control effect of tomato leaf mildew, gray mold and fruit setting rate as response values, and the optimal parameter combination was determined: The ozone treatment concentration was 0.0465 g kg<sup>−1</sup>, the ozone treatment time was 30 min, and the ozone treatment times were twice a week. In this case, the control efficiency of tomato leaf mildew was 95.02%, the control effect of gray mold was 99.49%, and the fruit setting rate was 76.5%. The test parameters were accurate and reliable.</p>\n<h2>CONCLUSION</h2>\n<p>The ozone sterilization method proposed in this article is safe and green, and can provide theoretical support for the recovery and reconstruction of tomato disease in a glasshouse. © 2024 Society of Chemical Industry.</p>","author":"Xinao Li, \nYuanyi Liu, \nCe Zhang, \nHailong Che, \nQinghao He, \nLijuan Wang, \nBing Yao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"48a1a832fb4e3cfcc3605a7e41cb27bc38e627abeacb8f10d8193aad26597ee1","category":"Environment"}