{"title":"Save 15% at Le Col with exclusive BikeRadar discount code","link":"https://www.bikeradar.com/bikeradar-bargains/le-col-discount-code/","date":1616773939000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/03/le_col_discount_code-77fe995.jpg?quality=90&amp;resize=620,413\" />                                            <p>The weather is changing, the days are growing longer and it’s a time when many cyclists are eager to get back on the road. If you’re in search of some new summer cycling apparel, we know where to send you: <a href=\"https://lecol.cc/\" target=\"_blank\">Le Col</a>.</p>\n<p>The company stocks a wide range of performance cycling gear, and it’s kindly sent an exclusive discount code our way. Simply enter this at the checkout, and you can save 15 per cent off your entire purchase.</p>\n<p>Read on to find out more, and see a few of our favourite Le Col items.</p>\n<section><div>\n        <h2><strong>Le Col discount code 2021</strong></h2>\n<ul><li><strong>AFF-BIKERADAR-15</strong> – 15% off all items at Le Col</li>\n</ul><p>\n\n    </p></div>\n    </section><h2><strong>Men’s Pro Jersey – £125 £106.25 with discount code</strong></h2>\n<div>\n    <img /></div>\n<p>This summer layer from Le Col is, according to the company, the most aerodynamic jersey it has ever created. We certainly like the look of its four-way stretch fabric and silicone hem and sleeve grippers – the hallmarks of well-designed cycling wear. With our discount code, you can pick it up for £18.75 less.</p>\n<ul><li><a href=\"https://lecol.cc/products/pro-jersey?variant=15031887298623\" target=\"_blank\">Save £18.75 on Le Col’s Men’s Pro Jersey with our discount code</a></li>\n</ul><h2><strong>Women’s Sport Jersey II – £95 £80.75 with discount code</strong></h2>\n<div>\n    <img /></div>\n<p>This women’s jersey is a new addition to the Le Col range, and shows the same level of craft and quality. Designed to fit your frame a little more loosely, the Sport Jersey II is made from a highly breathable stretch polyester – perfect for those sweltering summer rides. Make sure you take advantage of our exclusive code: you’ll save £14.25.</p>\n<ul><li><a href=\"https://lecol.cc/products/womens-sport-jersey-ii?variant=39283872104511\" target=\"_blank\">Save £14.25 on Le Col’s Women’s Sport Jersey II with our discount code</a></li>\n</ul><h2><strong>Le Col x Rudy Project Spinhawk Sunglasses – £100 £85 with discount code</strong></h2>\n<div>\n    <img /></div>\n<p>These sunglasses are the fruits of a collaboration with Italian cycling brand Rudy Project. We love everything about the Spinhawk, from its orange multi-laser lenses to the red and turquoise interiors of the arms. Make sure you pick them up for £15 less with our code.</p>\n<ul><li><a href=\"https://lecol.cc/products/le-col-x-rudy-project-spinhawk-sunglasses?variant=32908756189247\" target=\"_blank\">Save £15 on Le Col x Rudy Project Spinhawk Sunglasses with our discount code</a></li>\n</ul><h2><strong>Le Col Men’s Sport Bib Shorts – £130 £110.50</strong></h2>\n<div>\n    <img /></div>\n<p>These bib shorts from Le Col feature silicone leg grippers, mesh bib straps and a comfortable chamois for long days in the saddle. Our discount code knocks a solid £19.50 off the £130 asking price.</p>\n<ul><li><a href=\"https://lecol.cc/products/sport-bib-shorts?variant=15196528312383\" target=\"_blank\">Save £19.50 on Le Col’s Sport Bib Short with our discount code</a></li>\n</ul><h2><strong>Le Col Women’s Sport Waist Shorts – £90 £76.50</strong></h2>\n<div>\n    <img /></div>\n<p>These women’s shorts are all about comfort as well as performance. Their Lycra material has been ergonomically cut to offer you a supportive fit, and is complemented by reflective tabs and a Dolomiti chamois pad. Enter our discount code at the checkout and you’ll see £22.50 taken off the price.</p>\n<ul><li><a href=\"https://lecol.cc/products/womens-sport-waist-shorts?variant=15154404982847\" target=\"_blank\">Save £22.50 on Le Col’s Women’s Sport Bib Tights with our discount code</a></li>\n</ul>","author":"Matt Breen","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"48a4329b96a8aab56737ef2d1632fbca936a743e29e714f457b8d59def4a01cc","category":"Cycling"}