{"title":"Google makes office attendance part of performance reviews","link":"https://arstechnica.com/?p=1946397","date":1686261079000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1230856893-800x573.jpg\" alt=\"People walk out of a Google office building in Taipei, Taiwan, on January 29, 2021.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1230856893.jpg\">Enlarge</a> <span>/</span> People walk out of a Google office building in Taipei, Taiwan, on January 29, 2021. (credit: Ceng Shou Yi/NurPhoto)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google is a company that was <a href=\"https://www.businessinsider.com/googles-office-slides-2012-5\">once famous</a> for its whimsical, cushy office spaces. But during the pandemic, even the cushiest office space failed to be attractive. And now, in the post-pandemic work-from-home era, Google would still really like its employees to use those offices. The latest news from <a href=\"https://www.wsj.com/articles/google-gets-stricter-about-employees-time-in-office-9a20f2e\">The Wall Street Journal</a> details how Google is pressuring employees to come back to the office, which includes making in-person office attendance part of employee performance reviews. Apparently, work done from home will not be viewed as favorably as work done from the office.</p>\n<p>The report quotes a staff-wide email from Google Chief People Officer Fiona Cicconi justifying the move, saying, \"We’ve heard from Googlers that those who spend at least three days a week in the office feel more connected to other Googlers, and that this effect is magnified when teammates work from the same location. Of course, not everyone believes in ‘magical hallway conversations,’ but there’s no question that working together in the same room makes a positive difference.\"</p>\n<p>Google currently has a \"hybrid work\" policy where employees are expected to come into the office for at least three days of work a week. The report says employees who have \"frequent absences\" will start getting reminders about office attendance.</p></div><p><a href=\"https://arstechnica.com/?p=1946397#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1946397&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"48a4dc5c1148e1cc7e7c0e0af271bd59009e6e10e26e8c971422dfae13dd6cae","category":"Tech"}