{"title":"Mental Detours Part One: Bike Touring the Italy Divide(ish) – Hailey Moore","link":"https://theradavist.com/italy-divide-bike-tour/","date":1702468808000,"content":"<p><em>Travel is routinely romanticized. And it is romantic—how could having the privilege of “checking out” of the daily drum of work, family, bills, etc., and the attendant stress in favor of experiencing a new place not be? The word vacation is, of course, derived from the verb “to vacate,” and while going on vacation is about the act of leaving, it’s also about finding. Finding new culture, new landscapes, new experiences, but maybe just as importantly it’s about finding new perspective on what it is you’ve placed on hold.</em></p>\n<p><em>After two weeks spent bike touring in Italy in October, <a href=\"https://theradavist.com/tag/hailey-moore/\" target=\"_blank\">Hailey Moore</a> reflects on what she found while away and the paradox of trying to experience more than the Trip Advisor-version of a place without missing the five-star sights. Read on for part one of her Italy Divide reflections while riding from Trento to Florence. </em><span></span></p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04444.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04444.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2023/12/DSC04444.jpg?resize=1024,685&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04444.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/DSC04444.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04444.jpg?resize=1800,1203&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/DSC04444.jpg?resize=1335,892&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04444.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04444.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p>The slim street was cast in the still-gray light of morning. A cover of the song “Wagon Wheel” was playing through the cafe’s speakers overhead, and the plaintive, twanging lyrics felt decidedly out of place against the jumble of staccato Italian syllables that reached our ears from the crowd of high schoolers passing by. But the coffee was good: small cups of espresso served with small pots of hot water on the side to indulge our American preferences. A lingering fog of disappointment clouded the air as much as the opaque hour or the cigarette smoke that hung like cobwebs in the close corridor. Still, our bikes leaned nearby, unfeeling and undeterred, ready.</p>\n<h3>The Plan</h3>\n<p>The plan was to ride the Italy Divide—starting at its southern terminus near Naples and concluding some 30 miles past the designated finish of Arco, in the city of Trento—then tack on a few days in Italy’s Dolomite mountains in the north. During a month-long stint overseas—bookended by work obligations for both my partner, Tony, and myself—we would have two weeks in the middle to see as much of the country as we could. It would be my first time in Italy, and I had plenty of romantic notions about how the trip might unfold. Still, I’ve done enough travel and bike touring to know that not all that glitters is golden hour, even in the land where there are nearly as many pasta shapes as days in the year.</p>\n<p><img loading=\"lazy\" width=\"1920\" height=\"2560\" src=\"https://media.theradavist.com/uploads/2023/12/IMG_2443_jpg-scaled.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/IMG_2443_jpg-scaled.jpg?w=1920&amp;quality=75 1920w, https://media.theradavist.com/uploads/2023/12/IMG_2443_jpg-scaled.jpg?resize=1024,1365&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/IMG_2443_jpg-scaled.jpg?resize=2000,2667&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/IMG_2443_jpg-scaled.jpg?resize=768,1024&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/IMG_2443_jpg-scaled.jpg?resize=1800,2400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/IMG_2443_jpg-scaled.jpg?resize=1335,1780&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/IMG_2443_jpg-scaled.jpg?resize=700,933&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/IMG_2443_jpg-scaled.jpg?resize=1152,1536&amp;quality=75 1152w, https://media.theradavist.com/uploads/2023/12/IMG_2443_jpg-scaled.jpg?resize=1536,2048&amp;quality=75 1536w\" /></p>\n<p>After my time spent covering the <a href=\"https://theradavist.com/komoot-slovenia-womens-rally/\" target=\"_blank\">Komoot Slovenia Women’s bikepacking rally</a>, we took the train (or several trains) to the northern city of Trento, positioned at the gateway to the Dolomites. Although the rally had routed us through the coastal city Trieste, a few days to regroup in Trento before embarking on our route provided me with my first extended impression of an Italian city. Walking around on our first evening, I was struck by how the old center felt like more than just a collection of buildings and streets but a complete structure unto itself. The passages were tight and winding, the open squares paved with rippling bricks. From the walls that curved upwards to the sidewalks underfoot, every surface seemed warped, breaking the straight planes that I’m so used to in the US. A misaligned grid of close corridors and extended archways often limited sight lines to just down the block and cut off the passage of any breeze. It felt both charming and overwhelmingly man-made; I’d never before felt so acutely “inside” of a city.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1337\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04881.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04881.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/DSC04881.jpg?resize=1024,685&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04881.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04881.jpg?resize=1800,1203&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/DSC04881.jpg?resize=1335,892&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04881.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04881.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<h3>Day 0</h3>\n<p>On what was expected to be our final afternoon in Trento, we packed up our bikes, left our remaining luggage with a friend, and pedaled over to the train station for the transfer to Naples. We’d already bought the tickets and secured a hostel for the night down south. But just before boarding, we were stopped by a train attendant who informed us that we would not, in fact, be going to Naples that night. Italy (and, as we later heard, other European countries) has finicky rules about transporting complete bikes on trains. We’d unwittingly avoided this on our train trip from Ljbuljana, but—from what we gathered—you are not allowed to take a complete, unboxed bike on the faster, more direct trains in Italy. Rather, you can only take them on regional trains—that have designated space for bike cargo in the first or last cars—which often take upwards of twice as long. Furthermore, it was too late to cancel our hostel (much less refund our train tickets) and we left the train station in the kind of aimless despondency that immediately accompanies the loss of large sums of money.</p>\n<p>Over the past years touring together, Tony and I have gotten into the habit of exchanging our respective “highs and lows” for each day, often as we’re lying on the ground tucked into our sleeping bags. That night, discretely camped off the bike path a few miles outside of town, the train snafu was the unanimous low. While shedding our suitcases and putting vacation responders on had been a relief, the real high of the day felt more like an absence than an act; there was nothing left to do but start. We decided to cut our losses and ride the route in reverse, starting from Trento the next morning, then see how far we got in the time allotted before taking the trains back north. I was excited by the unrealized potential of the next two weeks.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04565.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04565.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2023/12/DSC04565.jpg?resize=1024,685&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04565.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/DSC04565.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04565.jpg?resize=1800,1203&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/DSC04565.jpg?resize=1335,892&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04565.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04565.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<h3>Day 1: Trento to Vineyards Before Brentonico</h3>\n<p>Staying in Trento the night before had thrown both of us off-kilter. Our usual bike-trip morning pack-up routine felt at odds with our completely fresh legs as we pedaled a couple of miles back into town to find a coffee before setting off up the first big climb: Monte Bondone. Most cafes weren’t open yet so we stopped at the cringingly-American influenced Urban Coffee Lab (whose napkin’s suggested, in English, to “Urbanize your life,” and whose menu included the “Spring Break” pancake stack and “Empire State” milkshake). It was here that we tried to shake off the lingering disappointment of the previous day’s missed train as someone sang a cover of that contemporary East Coast folk anthem, about landmarks not far from where I spent the first 21 years of my life in the U.S. But as soon as we emptied our espresso and pointed our wheels across the river, there was no question where we were: our Italian bike tour had officially started.</p>\n<p>The only climb I’ve done in the States that rivals Bondone—in vertical gain and views—came during the opening miles of this year’s <a href=\"https://theradavist.com/2023-rapha-yomp-rally-review/\" target=\"_blank\">Rapha Yomp Rally</a> in California, up Gibraltar Road outside of Santa Barbara. Still, the immediate 4,800-foot ascent from the center of Trento in roughly 12 miles proved even a touch steeper than Gibraltar and certainly more consistently precipitous than the majority of the long, gradual slogs I know back home in Colorado. But I didn’t mind and, in fact, relished the opening leg-tester. The morning was sterling and it felt good to settle into the rhythm of the climb. As the switchbacks grew shorter, one corner gave way to the first uninterrupted view of the western skyline—the Dolomites! Having made several previous trips to the imposing range, Tony said, “Yeah, aren’t the Tetons cute?” by way of comparison.</p>\n<p><img loading=\"lazy\" width=\"879\" height=\"1314\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04584-2.jpg?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04584-2.jpg?w=879&amp;quality=75 879w, https://media.theradavist.com/uploads/2023/12/DSC04584-2.jpg?resize=768,1148&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04584-2.jpg?resize=700,1046&amp;quality=75 700w\" /> <img loading=\"lazy\" width=\"1369\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04593.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04593.jpg?w=1369&amp;quality=75 1369w, https://media.theradavist.com/uploads/2023/12/DSC04593.jpg?resize=1024,1532&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04593.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04593.jpg?resize=1335,1997&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04593.jpg?resize=700,1047&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04593.jpg?resize=1027,1536&amp;quality=75 1027w\" /></p>\n<p>The deserted ski resort—where we naturally stopped for a couple of requisite summit macchiatos—and the fading, painted names of World Tour riders leftover from the Giro on the thin ribbon of a descent, both spoke to a season in flux. The relative isolation we found cautiously carving the S-curves into the Arco Valley, and then—another pass later—into Lake Garda made the discovery of such all-time road riding even sweeter.</p>\n<p>There were still plenty of lingering-summer crowds though along the shore of Lake Garda where we took a quick dip before finding dinner. I didn’t know they made water in such a brilliant shade of blue. Leaving town as we made the climb toward Arco, I kept stealing glances back to catch the sun’s brilliant last dance for the day reflecting across the water.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04597.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04597.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2023/12/DSC04597.jpg?resize=1024,685&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04597.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/DSC04597.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04597.jpg?resize=1800,1203&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/DSC04597.jpg?resize=1335,892&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04597.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04597.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<h3>Day 2: Brentonico to Cerro Veronese</h3>\n<p>The farmer, whose field we had slept beside, found us around 6:30 AM as we were cinching down our just-packed bags. Although an Italian acquaintance had told us that wild camping was permissible in Italy (and, we had pitched our tent outside of the bounds of his fence), I still felt myself involuntarily bracing for a potentially awkward interaction.</p>\n<p>He extracted himself and some tools from the tiny Smart Car that he’d arrived in and wished us a very cheerful “Buon Giorno!” We timidly smiled back and did the same, but as it was evident that we did not speak Italian as soon as we opened our mouths, he paused before letting a huge smile crack open his sun-worn face, and with three more hearty “Buon Giorno’s!” the farmer strode across the field and immediately set to work on his vines.</p>\n<p>As we started pedaling through the vineyards, on a steep-as-hell rough-paved track, we couldn’t help but compare our brief glimpse into this man’s life with our own fathers through labored conversation. The farmer was around their ages, if not older, and it didn’t seem like a stretch to assume that he’s probably been attending to these same fields for decades (as our friend Franz would say, “an Italian story.”) While Tony saw a parallel in his own dad’s strong connection to place—being the fourth generation in their family to homestead in northeast Nebraska—he lamented his dad’s lack of vigor in chasing the satisfaction of daily toil. While my own dad may have plenty of vigor, his driftless nature has left him without many deep ties—geographic, or otherwise. Was this just a moment of romantic projection, or a real contrast between our two cultures?</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1337\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04624.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04624.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/DSC04624.jpg?resize=1024,685&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04624.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04624.jpg?resize=1800,1203&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/DSC04624.jpg?resize=1335,892&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04624.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04624.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p>The early start on the vineyard track gave way to the sun rising at our backs as we rode through the village of Brentonico. A wide, meandering climb brought us to another small ski hill and we caught our first surf on dirt along the cat-track service road. We were picking up on a theme though and the surface soon became paved again as we turned over the big cogs on 12+% gradients to the shoulder of a pass. As we climbed, the morning felt still and clean like the crisp air that drifts in through an open window in the night. The ski lift cars sat suspended, motionless save for the faintest clinking—like wine glasses hung by their stems—that mixed with the bells of the cows grazing below.</p>\n<p>When we reached the top, I was amazed to look down at my Garmin to find that we’d already climbed over 4,000’ in the first 13 miles of the day! So far, our riding had revealed that Italians are big fans of paved surfaces and served as a reminder that it’s far easier to accumulate vert on tarmac. An equal descent into the town of Avio followed; the switchback-ridden plummet into the cliffband-lined canyon left us literally agape. When we could peel our eyes from the technical turns ahead, we exchanged amazed glances and whooped into the abyss. In Avio, we bought cappuccinos from the local bar and drank them in a small courtyard near a group of older Italians cackling over cigarettes and coffee. We also had the first of many sidewalk picnics—bread, pesto, mozzarella, tomato—outside the local grocery to regroup before the remaining half of the day.</p>\n<p>The ride profile for this, our second day, would end up resembling a pair of mostly-symmetrical cat ears, each representing one 4,000’+ climb. While I rode my usual morning motivation through the first, the climb that awaited us that afternoon would prove much more tedious.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1474\" src=\"https://media.theradavist.com/uploads/2023/12/IMG_2349.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/IMG_2349.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2023/12/IMG_2349.jpg?resize=1024,737&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/IMG_2349.jpg?resize=2000,1439&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/IMG_2349.jpg?resize=768,553&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/IMG_2349.jpg?resize=1800,1296&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/IMG_2349.jpg?resize=1335,961&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/IMG_2349.jpg?resize=700,504&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/IMG_2349.jpg?resize=1536,1106&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"1536\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2023/12/IMG_2371.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/IMG_2371.jpg?w=1536&amp;quality=75 1536w, https://media.theradavist.com/uploads/2023/12/IMG_2371.jpg?resize=1024,1365&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/IMG_2371.jpg?resize=768,1024&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/IMG_2371.jpg?resize=1335,1780&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/IMG_2371.jpg?resize=700,933&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/IMG_2371.jpg?resize=1152,1536&amp;quality=75 1152w\" /></p>\n<p>There is no easing into a climb that gains over 5,000’ in 12 miles. Especially with full stomachs on loaded bikes. As soon as we left Avio the work started in earnest, with road signs warning of 20% pitches and my Garmin calling out 1-2 km stretches of 16% grades. Despite being incredulous at the task at hand, I was becoming increasingly impressed with the bike I was reviewing for this trip: <a href=\"https://www.instagram.com/truelovecycles/?hl=en\" target=\"_blank\">True Love</a>’s Heart Breaker. Ascending Bondone the day before, I’d first noticed the bike’s efficiency as a climber. Whether this was a result of the oversized downtube or the straighter chainline afforded by the hanger-less Transmission XX derailleur mount, I was still unclear. Regardless, I was pleased to feel like little-to-no power was being absorbed by the bike as we mashed up the hill.</p>\n<p>During the paved portion of the climb, we leaped-frogged twice with an older Italian man astride a road bike; the first time, he was stopped for a snack on the one flat-ish reprieve and, as we passed, he motioned to us that the climb was about to get very steep. He wasn’t wrong. Atop this ridiculous pitch, it was our turn to stop for a short bite but this time when the man reached us, he stopped again. Although it was clear that we did not speak Italian and this man’s English was elementary at best, I tried to politely listen while he made a concerted effort to communicate what we thought might be a crucial bit of information.</p>\n<p><img loading=\"lazy\" width=\"1369\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2023/12/IMG_7526.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/IMG_7526.jpg?w=1369&amp;quality=75 1369w, https://media.theradavist.com/uploads/2023/12/IMG_7526.jpg?resize=1024,1532&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/IMG_7526.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/IMG_7526.jpg?resize=1335,1997&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/IMG_7526.jpg?resize=700,1047&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/IMG_7526.jpg?resize=1027,1536&amp;quality=75 1027w\" /> <img loading=\"lazy\" width=\"1283\" height=\"857\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04578-2.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04578-2.jpg?w=1283&amp;quality=75 1283w, https://media.theradavist.com/uploads/2023/12/DSC04578-2.jpg?resize=1024,684&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04578-2.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04578-2.jpg?resize=700,468&amp;quality=75 700w\" /></p>\n<p>It turns out he only wanted to brag about his age, which he conveyed by pointing to himself and then the road ahead—while giving a smug look at us and our bikes—and signing something in the ballpark of him being “65.” In the humid heat of the afternoon and with plenty of vert already in the legs, I was not feeling generous—bragging, after all, is not attractive even in Italian—and I had the urge to point at my bike and sign “18” to signal its weight in kilograms then ask how much his bike weighed. Fortunately, he soon left us to our snack and carried on up the road.</p>\n<p>Tony and I were both feeling worked by the climb and I think we were both relying on the as-yet unspoken assumption that the riding might ease up a bit once the pavement turned to gravel. In one sense it didn’t but in another it did: once we hit the next section of 12%+, it was an easy decision to just get off and walk as the gravel underneath was loose and golf ball-sized. With just a few hundred feet left in the climb, we broke out of the trees to find a high-prairie pasture-scape with long views of the mountains at its fringes.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04700.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04700.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2023/12/DSC04700.jpg?resize=1024,685&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04700.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/DSC04700.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04700.jpg?resize=1800,1203&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/DSC04700.jpg?resize=1335,892&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04700.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04700.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p>It was a juxtaposition that my brain wasn’t ready for, as nearly any continuous 5,000-foot climb in Colorado would bring you into an alpine environment. It was here, when my expectations were subverted, that I felt my first ache of homesickness. But, rather than an immediate, pressing sense of sadness, the feeling was a simultaneous longing for the familiar mixed with the comfort of, and gratitude for, being so familiar with another, if distant, place.</p>\n<p>With the lumpy, upward-trending slope, we mostly walked through the pasture until finally reaching the distant skyline and regaining an established road. By this point, we’d both been rationing water and I was down to half of the second 28-ounce bottle that I’d left with from Avio, though I could have easily chugged the rest on the spot. Italy was making us soft—as, thus far, the frequent villages en route (almost all with clean, running, public fountains) had meant that water was never a concern—and we’d both misjudged the demands of the climb (I had packed a Katadyn filter, but as of yet, we’d seen no running water). Upon rejoining the road, we made a desperate, searching circle around a B&amp;B, clearly closed up for the season, in hopes of finding a spigot. With no luck, I was more annoyed that we’d wasted the time. As is always the case in moments like this, there was nothing to do but remount the bikes and push onward.</p>\n<p><img loading=\"lazy\" width=\"2560\" height=\"1920\" src=\"https://media.theradavist.com/uploads/2023/12/IMG_2412-scaled.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/IMG_2412-scaled.jpg?w=2560&amp;quality=75 2560w, https://media.theradavist.com/uploads/2023/12/IMG_2412-scaled.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/IMG_2412-scaled.jpg?resize=2000,1500&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/IMG_2412-scaled.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/IMG_2412-scaled.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/IMG_2412-scaled.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/IMG_2412-scaled.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/IMG_2412-scaled.jpg?resize=1536,1152&amp;quality=75 1536w, https://media.theradavist.com/uploads/2023/12/IMG_2412-scaled.jpg?resize=2048,1536&amp;quality=75 2048w\" /></p>\n<h3>Days 3-5: Cerro Veronese to Florence</h3>\n<p>The next three days that it took us to reach Florence have started to blend together in a workmanlike blur; it is reasonable that, by the third day into the trip and nearing our third week overseas, the initial honeymoon-esque glow would start to subside, but this happened to coincide with the actual quality of the riding subsiding, too. Here, I think it’s important to call attention to the potentially problematic nature of expectations. Italy, by all estimations, is a beautiful country. But throughout the trip, I did my best to hold the concept of the trip—Bike Touring in Italy!—in balance with its lowercase reality: bike touring in Italy. Holding romantic preconceptions of what the trip should be like ran the risk of allowing any clot of discarded cigarette butts, crowded squares, or less-than-heavenly gelato to unreasonably diminish the lived experience. This is not to say that I was steeling myself to be disappointed, only that I was trying to be clear-eyed about the fact that I might not pass every pedal stroke in pure pizza-dreaming jubilance. Just take things as they come.</p>\n<p>This was a helpful mindset to call upon during the extended transfer across the Po Valley, an impossibly-flat agrarian stretch that the route traversed primarily along mixed-surface canal paths. We passed two full days in these lowlands (riding into the night during one, where our headlight beams revealed the iridescent glinting eyes of dozens of feral cats) and I was reminded of the way that Norton Juster, in his children’s chapter book <em>The Phantom Tollbooth</em>, writes about the doldrums as if they’re an actual physical place.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04712.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04712.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2023/12/DSC04712.jpg?resize=1024,685&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04712.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/DSC04712.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04712.jpg?resize=1800,1203&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/DSC04712.jpg?resize=1335,892&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04712.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04712.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p>After an unplanned half-day spent in a hotel in Bologna on day four—where Tony recovered from an uncharacteristic migraine and I tried to do what amounted to a full load of laundry in the sink—and a pleasant climb over the Apennine mountains, we made it to Florence in the evening on our fifth day of riding. Tony and I are not big on creating strict itineraries for bike tours and, given the last-minute direction change after our blunder with the train system, I was especially glad we hadn’t chained ourselves to a string of reservations. Still, when we reached different cities along the route (Bologna, Florence, and later, Rome) this meant we were left to make sleeping arrangements the day of our arrival.</p>\n<p>Going into the Italy Divide, we’d budgeted to spend about three nights in hotels/hostels; we’d lost one to the missed reservation in Naples, and we’d spent another unexpectedly in Bologna. In a dutiful effort to save our last hotel stay for Rome—and, given the shock-inducing prices for any place in Florence—we compromised by finding a private campground on the hilltop community of Fiesole that overlooks Florence from the northeast.</p>\n<p>But first: dinner. I’d been nurturing the quaint fantasy all day that we’d find the perfect tucked-away place in Florence for a celebratory dinner, but the reality of the university district where we found ourselves just before sunset was a crowded one. And, as we were learning, many restaurants in Italy do not adhere to our early-to-bed-early-to-rise preferred dinner schedule; at home, Tony and I usually sit down before 7 PM. Most restaurants here closed for a few hours in the afternoon and didn’t re-open until 7 or 7:30. Furthermore, reservations are much more commonplace in Italy—even for seemingly-casual spots—and it can be hard to get a table as a walk-in without one. Rather than try to fill our time while waiting for places to open, we opted for an unceremonious grocery store spread instead. I left Tony to watch the bikes in the growing dark outside and walked into the bustling, fluorescent-lit store.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1367\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04775.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04775.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2023/12/DSC04775.jpg?resize=1024,684&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04775.jpg?resize=2000,1335&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/DSC04775.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04775.jpg?resize=1800,1201&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/DSC04775.jpg?resize=1335,891&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04775.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04775.jpg?resize=1536,1025&amp;quality=75 1536w\" /></p>\n<p>Travel, in countries where you do not speak the dominant language, makes the trivial taxing. I first experienced this as an undergraduate student while completing a five-week immersive French summer study-abroad program in Paris. Although my French is now quite rusty (<em>malheureusemen</em>t), I still viscerally remember the exhaustion I would feel upon finally re-entering my dorm room each night, after a day spent in the streets of Paris. This was 2013 and pre-iPhone for me so I navigated the subway system and city streets in good-old, brow-furrowing, analog fashion.</p>\n<p>When you’re at your best, this feels like a grand adventure; when you’re hungry, tired, or homesick, simple tasks made harder by the language barrier can cause a lot more stress. Of course, after a few early missteps, I had soon figured out my morning routine: I knew the route to reach the Sorbonne school, the bakery to stop at along the way, and how to order my watered-down americano. Still, the sensory overload and distinct feeling of otherness never left. The olfactory assault of the mix of perfumes and colognes that greeted me each morning upon entering the subway car left me wondering if I needed to start wearing perfume. The heavy weight of prolonged gazes as I did my morning runs through parks in a sports bra made me itch to put a shirt on. The flicker of recognition of my foreignness that would pass over every pair of French eyes I spoke to—no matter how short a phrase—made me strive to better disguise my betraying vowels.</p>\n<p>Part of this exhaustion was due to the fact that I’d never spent extended time in a big city, but the language and, to some extent, cultural barrier undoubtedly contributed. The quiet of my room was like a balm for my translating-tired mind. It was only once I’d escaped the city noise that I would realize how much my face ached, either from holding tension in my jaw, or using unfamiliar muscles in my clumsy enunciations. A treasured vice was watching American shows on Netflix and reading English books. It was in Paris—at the ex-pat haunt-turned-tourist stop Shakespeare and Co.—that I picked up a copy of Salinger’s <em>Franny and Zooey</em>, one of my now-favorite books. As much as the content, the comfort of language it provided surely made it all the more dear to me.</p>\n<p><img loading=\"lazy\" width=\"2560\" height=\"1713\" src=\"https://media.theradavist.com/uploads/2023/12/moore001645-R1-E015-scaled.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/moore001645-R1-E015-scaled.jpg?w=2560&amp;quality=75 2560w, https://media.theradavist.com/uploads/2023/12/moore001645-R1-E015-scaled.jpg?resize=1024,685&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/moore001645-R1-E015-scaled.jpg?resize=2000,1338&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/moore001645-R1-E015-scaled.jpg?resize=768,514&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/moore001645-R1-E015-scaled.jpg?resize=1800,1204&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/moore001645-R1-E015-scaled.jpg?resize=1335,893&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/moore001645-R1-E015-scaled.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/moore001645-R1-E015-scaled.jpg?resize=1536,1028&amp;quality=75 1536w, https://media.theradavist.com/uploads/2023/12/moore001645-R1-E015-scaled.jpg?resize=2048,1370&amp;quality=75 2048w\" /> <img loading=\"lazy\" width=\"2560\" height=\"1713\" src=\"https://media.theradavist.com/uploads/2023/12/Moore001569-R1-067-32-scaled.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Moore001569-R1-067-32-scaled.jpg?w=2560&amp;quality=75 2560w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-067-32-scaled.jpg?resize=1024,685&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-067-32-scaled.jpg?resize=2000,1338&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-067-32-scaled.jpg?resize=768,514&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-067-32-scaled.jpg?resize=1800,1204&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-067-32-scaled.jpg?resize=1335,893&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-067-32-scaled.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-067-32-scaled.jpg?resize=1536,1028&amp;quality=75 1536w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-067-32-scaled.jpg?resize=2048,1370&amp;quality=75 2048w\" /></p>\n<p><em>Film photos from a December 2022 trip to Paris. </em></p>\n<p>The fluorescent lights bore down on the busy aisles in the Florence grocery store. I was already tired and wanted to get out with our dinner as fast as possible but my thoughts were muddled and I didn’t have a clear plan of what to buy. Vegetables—definitely vegetables—were a priority, given the amount of bread we’d been eating, driven by the portable convenience of pizza and sandwiches. After plucking a few things from the produce shelves, I approached the prepared foods counter. The glass display held some promising entrees—farro-stuffed tomatoes for one—but I was already dreading how I would relay the quantity of each item that I wanted to the attendant.</p>\n<p>After several minutes of studying the display, I started to grow annoyed that nobody had indicated that it was my turn. I’d seen a few people in my vicinity leave the counter with their parcels so I spent a few moments trying to catch the eye of an attendant. Nada. It was only then, when I felt the instinctive alertness triggered by another’s gaze, that I looked up to see a man watching me. I then noticed that, in addition to his groceries, he was holding something else in his hand: a ticket. As my travel-addled mind began to comprehend the situation, I realized that the loose cluster of other shoppers around him were also all holding tickets, and that they formed an unorganized line. Finally, I saw the source of my confusion itself, a waist-high ticket dispenser standing on the far side of the counter from which customers picked a number and then waited to be called on by the store’s employees behind the counter. It all made so much shame-inducing sense and before my cheeks could start to burn, I turned on my heel and walked away.</p>\n<p>Of course, I felt silly for abandoning my stuffed-tomato dinner dreams over such a trivial misunderstanding. But, in my unwashed, disheveled state, I was already growing restless of the dinnertime crowds. I half-randomly filled my basket and made my way to the self checkout. I was all but finished scanning my items when I remembered—the damn bell pepper. I’d forgotten, for approximately the 100th time, that you weigh and price your own produce in Italian grocery stores by using the scale and sticker machines in the produce section. I couldn’t believe that I’d forgotten again as, in the preceding days, I’d found myself at the checkout counter multiple times with unpriced items, each time sending the cashier out from behind the register to price them for me. After the ticket dilemma and spending half an hour in the store already, I was too drained to admit produce defeat. I hurriedly put the pepper in the bag and walked out.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04729.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04729.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2023/12/DSC04729.jpg?resize=1024,685&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04729.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/DSC04729.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04729.jpg?resize=1800,1203&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/DSC04729.jpg?resize=1335,892&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04729.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04729.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<h3>Day 6: Florence</h3>\n<p>After a hard night’s sleep (literally, our site at the campground was a sort of terraced platform lined with cobbles), the day started off right with us finding a neighborhood bakery open in Fiesole—no easy task in a country that reserves Sundays for mass. As we’d grown to expect, the bakery’s standing room was snug and the counters were full. The proprietress, a matron who looked to be in her 60s wearing flashy blue eyeshadow, warmly greeted everyone in a husky smoker’s voice—”Buon Giorno, Buon Giorno à tutti!”—as if we’d just arrived at a party in her home. Our choice of some kind of caramelized turnovers, and the cappuccinos we paired them with, were the best bakery fare we’d found so far in Italy, and our total—including a couple sandwiches—was just €11.50.</p>\n<p>As the sun rose higher, we haltingly made the short descent back into Florence, stopping to take in the views and identify famous landmarks. From our vantage point up on the hill, it was easy to spot our primary destination for the half-day of sightseeing we’d set aside, “Il Duomo” or the massive red dome that marks the Cathedrale de Santa Maria del Fiore.</p>\n<p><img loading=\"lazy\" width=\"1369\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04722.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04722.jpg?w=1369&amp;quality=75 1369w, https://media.theradavist.com/uploads/2023/12/DSC04722.jpg?resize=1024,1532&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04722.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04722.jpg?resize=1335,1997&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04722.jpg?resize=700,1047&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04722.jpg?resize=1027,1536&amp;quality=75 1027w\" /> <img loading=\"lazy\" width=\"1369\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04725.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04725.jpg?w=1369&amp;quality=75 1369w, https://media.theradavist.com/uploads/2023/12/DSC04725.jpg?resize=1024,1532&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04725.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04725.jpg?resize=1335,1997&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04725.jpg?resize=700,1047&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04725.jpg?resize=1027,1536&amp;quality=75 1027w\" /></p>\n<p>As we neared the Piazza del Duomo, we caught glimpses of the cathedral from the cross streets, but it was like trying to look at an elephant through the slats of a picket fence. The streets became increasingly choked with crowds and we were forced to get off and walk the bikes. When we finally broke out into the square, the magnitude of the cathedral was revealed. I’ve never seen so many people standing around to look at a human-built structure—not even at the Eiffel Tower. Souvenir shops and cafés lined the perimeter of the square with tables and chairs arranged like theater seats; everyone was facing the same direction. It was hard to keep your eyes from drifting over the green, slate, and pink marble-sided façade.</p>\n<p>After ordering a couple of macchiatos (when it came to coffee on this trip, we fully embraced the Italian way) we joined the spectacle by seating ourselves at one of the little café tables. Café scenes are one of my favorite aspects of European culture (at least where I’ve experienced it in France and Italy)—you need no more excuse than wanting something to drink to sit down for an hour or two and enjoy the ongoing show that is life in a city. We alternated between marveling at the dome and rubbernecking at all the other tourists who were here to do the same.</p>\n<p><img loading=\"lazy\" width=\"1369\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04754.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04754.jpg?w=1369&amp;quality=75 1369w, https://media.theradavist.com/uploads/2023/12/DSC04754.jpg?resize=1024,1532&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04754.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04754.jpg?resize=1335,1997&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04754.jpg?resize=700,1047&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04754.jpg?resize=1027,1536&amp;quality=75 1027w\" /> <img loading=\"lazy\" width=\"1369\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04737.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04737.jpg?w=1369&amp;quality=75 1369w, https://media.theradavist.com/uploads/2023/12/DSC04737.jpg?resize=1024,1532&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04737.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04737.jpg?resize=1335,1997&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04737.jpg?resize=700,1047&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04737.jpg?resize=1027,1536&amp;quality=75 1027w\" /></p>\n<p>Our remaining morning and early afternoon hours in Florence passed quickly: since we had the bikes with us, we had to skip visiting any museums, though we were able to view a small outdoor collection of sculptures in the Loggia dei Lanzi near the Uffizi Gallery. As I read the plaques, I noted that the dates of creation ranged from the 3rd century BCE to the 1800s, and many of the earliest pieces were listed as being restored at times that still predated the founding of the United States. These sculptures had lived for centuries before the country that has informed my entire world view was even a concept. The history of this place was starting to seep into my understanding in a deeper way.</p>\n<p>Based on the recommendation of two friends, we felt compelled to seek out some schiacciata sandwiches on our way out of town from, apparently, the only place in Florence worth getting them: All’antico Vinaio. We made several circles in the tourist-ridden district on the north banks of the river as my phone’s GPS got confused and bounced off the buildings before we were finally successful in honing in on the shop’s location. Naturally, there was a line about 30 people long.</p>\n<p><img loading=\"lazy\" width=\"1519\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04761-1.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04761-1.jpg?w=1519&amp;quality=75 1519w, https://media.theradavist.com/uploads/2023/12/DSC04761-1.jpg?resize=1024,1381&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04761-1.jpg?resize=768,1035&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04761-1.jpg?resize=1335,1800&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04761-1.jpg?resize=700,944&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04761-1.jpg?resize=1139,1536&amp;quality=75 1139w\" /> <img loading=\"lazy\" width=\"1365\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04755.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04755.jpg?w=1365&amp;quality=75 1365w, https://media.theradavist.com/uploads/2023/12/DSC04755.jpg?resize=1024,1536&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04755.jpg?resize=768,1152&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04755.jpg?resize=1335,2003&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04755.jpg?resize=700,1050&amp;quality=75 700w\" /></p>\n<p>Although I have no doubt that the sandwiches are spectacular, I probably should have known that a recommendation from two non-locals would mean that it was a popular tourist destination: this is the paradox of travel in the internet age. Restaurants and other local landmarks become boxes to be ticked as a way of proving that you had the *insert city* experience: you got the coffee from X second-wave shop; you ate the crazy donut from Y; you posed in front of Z statue or mural. As someone who took a selfie in front of the Eiffel Tower a year prior to this writing, I get it.</p>\n<p>There’s a certain amount of “getting lost” and wandering to be done in new-to-you places, but most people also don’t have the time to explore every off-the-beaten-track alley in search of that perfectly-quaint, out-of-the way bistro or bakery. It is efficient to do and see the things that are famous; they’re usually famous for a reason after all. But I also think that the more of an attraction something becomes, the more at risk it is of becoming a caricature of itself and its culture. But, there are degrees to this: while the schiacciata spot in Florence and gondola rides in Venice may have lost some of their (brace for it) authenticity, I doubt that the impact of beholding the Florence cathedral will diminish, no matter how many tourists stand gawking at its base. Similarly, it’s a depressing thought to think that visitors might actually take the Mall of America as a face-value representation of my home country, though I am hopeful that the symbolic strength of seeing the Statue of Liberty will never wane.</p>\n<p>On the day we left home, as Tony and I waited surrounded by our bike bags and other luggage for the bus to take us to the airport, a man wanted to know where we were off to with our bikes. Slovenia and Italy, we told him. He responded by saying that he’s “done that trip” and hoped we had a great time. His interest and well-wishes undoubtedly came from good intentions but—picturing all of the bivy spots we would improvise and knowing our loose itinerary—I couldn’t help but think, no you haven’t done this trip. Because, wouldn’t it be a disservice to each of our experiences to imagine they were the same?</p>\n<p><img loading=\"lazy\" width=\"1743\" height=\"2560\" src=\"https://media.theradavist.com/uploads/2023/12/Moore001569-R1-063-30-scaled.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Moore001569-R1-063-30-scaled.jpg?w=1743&amp;quality=75 1743w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-063-30-scaled.jpg?resize=1024,1504&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-063-30-scaled.jpg?resize=2000,2937&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-063-30-scaled.jpg?resize=768,1128&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-063-30-scaled.jpg?resize=1800,2644&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-063-30-scaled.jpg?resize=1335,1961&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-063-30-scaled.jpg?resize=700,1028&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-063-30-scaled.jpg?resize=1046,1536&amp;quality=75 1046w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-063-30-scaled.jpg?resize=1394,2048&amp;quality=75 1394w\" /> <img loading=\"lazy\" width=\"1713\" height=\"2560\" src=\"https://media.theradavist.com/uploads/2023/12/Moore001569-R1-075-36-scaled.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Moore001569-R1-075-36-scaled.jpg?w=1713&amp;quality=75 1713w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-075-36-scaled.jpg?resize=1024,1531&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-075-36-scaled.jpg?resize=2000,2990&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-075-36-scaled.jpg?resize=768,1148&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-075-36-scaled.jpg?resize=1800,2691&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-075-36-scaled.jpg?resize=1335,1996&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-075-36-scaled.jpg?resize=700,1046&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-075-36-scaled.jpg?resize=1028,1536&amp;quality=75 1028w, https://media.theradavist.com/uploads/2023/12/Moore001569-R1-075-36-scaled.jpg?resize=1370,2048&amp;quality=75 1370w\" /></p>\n<p><em>A couple more from Paris…</em></p>\n<p>Needless to say, we skipped the sandwiches. After a couple of pizzas on a restaurant patio and a gelato stop across the river, we pedaled south out of Florence. Leaving the river meant that we quickly gained elevation and, as we had started the day, were soon overlooking the city. Looking back on Il Duomo, I was grateful for our time spent in one of the most beautiful cities I have ever seen. And while I’ll never forget the grandeur of our front-row seats beneath the Cathedrale, or the feeling of winding our way, awestruck, through the streets, the distance that our perspective afforded just outside the city felt like I was getting a truer, fuller view of Florence. For a time, I wasn’t just another person in the crowds trying to take the same photo that thousands of others had taken before me—it was beautiful just to know that Florence would go on existing after we’d traveled on.</p>\n<p><img loading=\"lazy\" width=\"1616\" height=\"1080\" src=\"https://media.theradavist.com/uploads/2023/12/DSC04753.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/DSC04753.jpg?w=1616&amp;quality=75 1616w, https://media.theradavist.com/uploads/2023/12/DSC04753.jpg?resize=1024,684&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/DSC04753.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/DSC04753.jpg?resize=1335,892&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/DSC04753.jpg?resize=700,468&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/DSC04753.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p><em>Keep an eye out for Hailey’s follow-up part-two Reportage where she writes about making it to Rome and tacking on a short, multi-sport tour in the Dolomites—coming soon! </em></p>\n<p>The post <a href=\"https://theradavist.com/italy-divide-bike-tour/\">Mental Detours Part One: Bike Touring the Italy Divide(ish)</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"Hailey Moore","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"48ad081bd750e49a761a49bb000d1937ea97b73e33c42589d0f73f238648845a","category":"Cycling"}