{"title":"Habitat-specific allocations of elements in Atriplex lentiformis seeds indicate adaptation to metal toxicity","link":"https://academic.oup.com/jxb/article/75/16/5076/7676307?rss=1","date":1715990400000,"content":"<span><div>Abstract</div>Self-sustaining vegetation in metal-contaminated areas is essential for rebuilding ecological resilience and community stability in degraded lands. Metal-tolerant plants originating from contaminated post-mining areas may hold the key to successful plant establishment and growth. Yet, little is known about the impact of metal toxicity on reproductive strategies, metal accumulation, and allocation patterns at the seed stage. Our research focused on the metal tolerant <span>Atriplex lentiformis</span>. Specifically, we examined the effects of toxic metal(loid) concentration in soils on variability in its reproductive strategies, including germination patterns, elemental uptake, and allocation within the seeds. We employed advanced imaging techniques like synchrotron X-ray fluorescence microscopy (2D scans and 3D tomograms) combined with inductively coupled plasma mass spectrometry to reveal significant differences in metal(loid) concentration and distribution within the seed structures of <span>A. lentiformis</span> from contrasting habitats. Exclusive Zn hotspots of high concentrations were found in the seeds of the metallicolous accession, primarily in the sensitive tissues of shoot apical meristems and root zones of the seed embryos. Our findings offer novel insights into phenotypic variability and metal tolerance and accumulation in plants from extreme environments. This knowledge can be applied to enhance plant survival and performance in land restoration efforts.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"48b3bdf19e4fe78983052a90fa59b59311d5088bdf6da2ca0c6e32555e7a6b4d","category":"Environment"}