{"title":"Visceral leishmaniasis follow-up and treatment outcomes in Tiaty East and West sub-counties, Kenya: Cure, relapse, and Post Kala-azar Dermal Leishmaniasis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306067","date":1719324000000,"content":"<p>by Grace C. Kennedy, Katherine O’Brien, Hellen Nyakundi, Mwatela Kitondo, Wilson Biwott, Richard G. Wamai</p>\r\nBackground <p>Visceral Leishmaniasis (VL) is a neglected tropical disease (NTD) with the highest regional burden in East Africa. Relapse and Post Kala-azar Dermal Leishmaniasis (PKDL) contribute to the spread of VL in endemic areas, making their surveillance imperative for control and elimination. Little is known about long-term patient outcomes in Kenya through follow-up after VL treatment, despite its requirement for control and elimination by the World Health Organization (WHO) and the Kenya Ministry of Health (KMOH).</p> Methodology/Principal findings <p>36 follow-up patients in Tiaty East and West, sub-counties, Kenya, and records from 248 patients at the regional Chemolingot Sub-county Hospital (CSCH) were analyzed separately using Fisher’s Exact Tests, two-sample t-tests, and Welch’s t-tests in R (Version 4.3.0). The study found a prevalence rate of 88.89% (n = 32) final cure, 5.56% (n = 2) relapse, and 5.56% (n = 2) PKDL in follow-up patients and 92.74% (n = 230) initial cure, 6.86% (n = 17) relapse, and 0.80% (n = 2) PKDL in overall CSCH patients. The mean lengths of time at which follow-up patients relapsed and developed PKDL were 4.5 and 17 months, respectively. Young age (p = 0.04, 95% CI 0.63–24.31), shorter length of time from initial treatment to follow-up (p = 0.002, 95% CI 1.03-∞), lower Hb level at primary treatment (p = 0.0002, 95% CI 1.23–3.24), and living in Tiaty East sub-county (p = 0.04, 95% CI 0.00–1.43) were significantly associated (p&lt;0.05) with VL relapse in follow-up study patients. Female sex (p = 0.04, 95% CI 0.84-∞) and living in Tiaty East sub-county (p = 0.03, 95% CI 0.00–1.43) were significantly associated with PKDL in follow-up study patients.</p> Conclusions/Significance <p>More research should be done on PKDL in Kenya with active follow-up to understand its true burden. These results on prevalence and risk factors for PKDL and relapse in Kenya should inform knowledge of patient outcomes and interventions in the region.</p>","author":"Grace C. Kennedy","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"48b6f314ecad3c5fdc3c7f4f07f8483f23842a5f6aadbeea95631c1b00aafd15","category":"Interdisciplinary"}