{"title":"Stabilization of nitrite in the presence of the nitrification inhibitor allylthiourea (ATU) in freshwater nitrification rate measurements","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10643?af=R","date":1723630173000,"content":"<h2>Abstract</h2>\n<p>Nitrification rate measurements provide critical information on the performance of an environmental process central to the N cycle and are best studied using isotope labeling techniques. However, combining the high sensitivity of isotope labeling techniques with selected inhibition of nitrifiers as a whole or of specific nitrifier guilds has not been established in limnology. This can be achieved with different concentrations of the commonly used nitrification inhibitor allylthiourea (ATU). In the <sup>15</sup>N-ammonium oxidation technique, the converted isotope label is typically captured in an excess pool of <sup>14</sup>N-nitrite. Here, we assessed how different storage conditions affect the stability of the nitrite pool in freshwater samples treated with ATU. When stored frozen, the nitrite pool was rapidly destabilized to 25–31% after 7 d of storage and even to less than 5% after storage exceeding 90 d for samples treated with ATU, thus making them unusable for rate determinations in these cost and labor-intensive experiments. In comparison, this was not the case in marine samples or freshwater samples not treated with ATU, where the nitrite pool remained stable. Building on these results, we tested two options to stabilize nitrite during the storage of freshwater samples. The nitrite pool was stable if samples were stored at 4°C instead of freezing. We recommend this option for short-term storage. For long-term storage, samples should be supplemented with 0.5 mmol L<sup>−1</sup> NaCl to increase salinity before freezing. As in marine samples, this stabilized the nitrite pool. Our results provide important guidance for the storage of non-saline samples used for nitrification rate measurements in freshwater environments.</p>","author":"Jade Bosviel, \nKatharina Kitzinger, \nMichael Pester","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"48c2267537dd60ffeb3f97c5aeb4157de38f01b0b1465b2450569e4039ebf396","category":"Environment"}