{"title":"Research on the Anti-fatigue Effect and Mechanism of Arecoline in Sleep Deprived-Induced Mouse Fatigue","link":"https://www.preprints.org/manuscript/202406.1278/v1","date":1718850489000,"content":"Objective: This research was aimed to estimate the anti-fatigue effects of arecoline and elucidate its underlying mechanisms using a murine model of central fatigue precipitated by sleep deprivation (SD).\nMethods: Seventy-two male C57BL/6 mice were randomly allocated into six groups: a control group, a SD-induced fatigue model group, a group receiving Rhodiola Rosea capsules (2.5 mg/kg), and arecoline groups administered low, medium, and high doses (10, 20, and 40 mg/kg, respectively). Following 28 days of continuous administrations, the effects of arecoline on the mouse fatigue-related behaviors was assessed by the behavioral tests, including grip strength, rotarod performance, and weight-bearing swimming endurance. Enzyme-linked immunosorbent assays (ELISAs) were utilized to measure the levels of the relevant biochemical markers. Western blotting was employed to quantify the expression of nuclear factor erythroid 2-related factor (Nrf2), Kelch-like ECH-associated protein 1 (Keap1), heme oxygenase 1 (HO-1), sequestosome-1 (p62), and NADPH quinone oxidoreductase 1 (NQO1) in the gastrocnemius muscle.\nResults: Arecoline administration notably enhanced grip strength, delayed the onset of fatigue as evidenced by extended latencies in rotarod tests, and increased the duration of weight-bearing swimming in mice. In the elevated plus maze, arecoline significantly reduced both the number of entries and the total distance traveled in the open arms. Arecoline markedly decreased serum levels of creatine kinase, blood urea nitrogen, lactate dehydrogenase, triglycerides, and cholesterol, while elevated total testosterone, lactate dehydrogenase, and immunoglobulin G levels. Furthermore, it significantly increased superoxide dismutase(SOD), catalase(CAT), and glutathione peroxidase activity in the gastrocnemius muscle, reduced malondialdehyde levels, augmented hippocampal SOD and CAT activity, and elevated glycogen stores in both liver and muscle tissues. Neurotransmitter levels were significantly increased, cytokine levels were markedly reduced, and the expression of Nrf2, Keap1, NQO1, p62, and HO-1 in brain tissue was significantly upregulated.\nConclusion: The current study for the first time demonstrated that arecoline has significant anti-fatigue activity, and its mechanism of action is related to elevate the levels of glucose and lipid metabolism, relieve oxidative stress damage, inhibit neuroinflammatory response, regulate neurotransmitter levels and Keap1/Nrf2/HO-1 signaling pathway. The current study provides a new insight into the potential of arecoline in prevention and improvement of fatigue.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"48c3dcaff8c4463d9396bf4f3c7c53edbe0d7e73469f7071e91caa0c775d9014","category":"Interdisciplinary"}