{"title":"แรงกว่า ถูกกว่า จริงไหม?​ เปรียบเทียบประสิทธิภาพ vCPU Core ระหว่างคลาวด์ไทย กับคลาวด์นอก","link":"https://www.blognone.com/node/135791","date":1695267000000,"content":"<div><div><div><p>จะเลือกใช้ระบบคลาวด์อย่างไรให้คุ้มค่าที่สุดสำหรับองค์กรธุรกิจยุคดิจิทัล?</p>\n<p>นี่คือคำถามสำคัญในช่วงที่องค์กรแข่งขันกันเพิ่มประสิทธิภาพ เพื่อให้สามารถสู้กับคู่แข่งได้ ยิ่งมีผู้ให้บริการคลาวด์ (Cloud Provider) ทั้งในไทยและต่างประเทศให้เลือกแบบนี้ การตัดสินใจเพื่อให้ได้ผลลัพธ์ที่ดีที่สุด จึงไม่ใช่เรื่องง่าย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/a79175c31b7dcee4abd82b17797241bf.jpg\" /></p>\n<p>โอกาสนี้ NIPA Cloud จะมาช่วยหาคำตอบว่า ผู้ให้บริการคลาวด์รายใดให้ความคุ้มค่ากับผู้ใช้งานมากที่สุด? โดยเปรียบเทียบประสิทธิภาพของ vCPU Core ซึ่งถือเป็นรากฐานสำคัญในการให้บริการคลาวด์ เพื่อเป็นตัวช่วยให้นักพัฒนาและเจ้าของธุรกิจเข้าถึงข้อมูลที่มีประโยชน์ต่อการตัดสินใจและสามารถเลือกสิ่งที่คุ้มค่าที่สุดต่อองค์กรได้</p>\n<p>เริ่มต้นจากผู้ให้บริการ 5 รายใหญ่ในปัจจุบัน ได้แก่ Amazon Web Services (AWS), Microsoft Azure, Google Cloud Platform (GCP), Alibaba Cloud, Tencent Cloud และ คลาวด์ไทยอย่าง NIPA Cloud Space มาทำการวัดประสิทธิภาพ vCPU Core ในการให้บริการทั้งรูปแบบ Dedicated Core และ Shared Core ซึ่งพบสิ่งที่น่าสนใจอยู่หลายประการ</p>\n<p><em>หมายเหตุ : ข้อมูลทั้งหมดเกิดขึ้นระหว่างเดือนสิงหาคมถึงกันยายน 2565 และการวิเคราะห์ครั้งนี้ได้ใช้การทดสอบที่ Data Center 2 แห่ง ได้แก่ สิงคโปร์ (Singapore region) สำหรับการเปรียบเทียบ Dedicated Core และสหรัฐอเมริกา (US region) สำหรับ Shared Core</em></p>\n<p><strong>วิธีการทดสอบ</strong></p>\n<p>เพื่อลดความลำเอียง NIPA Cloud จึงใช้ราคาเฉลี่ยค่าบริการคลาวด์ ทั้งแบบ compute optimized และ general purpose มาหาอัตราส่วนประสิทธิภาพต่อราคา (Multi-core performance per core) ซึ่งหากค่านี้มีค่ามากก็แปลว่ามีความคุ้มค่าสูง แต่หากค่านี้มีค่าน้อยก็แปลว่ามีความคุ้มค่าต่ำโดยผลลัพธ์ในการวัดประสิทธิภาพของ vCPU Core ทาง NIPA Cloud อ้างอิงมาจากเกณฑ์มาตรฐานของ GeekBench 5 ซึ่งทดสอบด้วยค่ามาตรฐาน และได้นำค่าจากแต่ละ Machine type ที่มีการทดสอบมาเฉลี่ยสำหรับ Machine type ที่มีขนาดเท่ากัน</p>\n<p><strong>ผลการทดสอบในแง่ประสิทธิภาพ</strong></p>\n<p>จากผลการทดสอบของผู้ให้บริการคลาวด์ทั้ง 6 ราย พบว่าคะแนน multi-core performance per price ของผู้ให้บริการคลาวด์ต่างชาติโดยรวม มีคะแนนต่ำกว่า NIPA Cloud Space ถึงประมาณ 1.5-2 เท่า ซึ่งสะท้อนให้เห็นความคุ้มค่าของ NIPA Cloud ที่สูงกว่า ดังภาพด้านล่าง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b098f8f7cb60237e5a15f4403af9d704.jpg\" /></p>\n<p>อย่างไรก็ตาม หากคำนวณค่าเฉลี่ยของทุก machine type จะมีความแตกต่างของยี่ห้อฮาร์ดแวร์ที่ใช้งาน เนื่องจาก Cloud ที่เป็น Global Cloud นั้นมี machine type ที่หลากหลาย จึงอาจไม่ใช่ค่าที่สะท้อนความคุ้มค่ามากนัก เราจึงเปรียบเทียบฮาร์ดแวร์ที่เป็นยี่ห้อเดียวกัน นั่นคือ AMD EPYC โดยนำมาคิดเป็นค่า performance per price เช่นกัน โดยจากการทดสอบพบว่า NIPA Cloud Space มีค่าประสิทธิภาพต่อราคาสูงที่สุด กล่าวคือ สะท้อนถึงความคุ้มค่าที่มากที่สุด</p>\n<p><em>หมายเหตุ : Alibaba Cloud และ Tencent Cloud ณ วันที่หาข้อมูลนั้น ไม่พบฮาร์ดแวร์ AMD ที่ผู้ให้บริการ 2 รายนี้ให้บริการ ดังนั้น ในผลลัพธ์จะมีผู้ให้บริการเพียง 4 รายเท่านั้น</em></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f8446a2248f458b470c080cbd5255a47.jpg\" /></p>\n<p>Shared core ถือเป็นอีกหนึ่งทางเลือกในการ optimized การใช้งาน กล่าวคือมีการใช้งาน vCPU core ร่วมกับผู้อื่น ซึ่งข้อดี คือ ราคาของ VM จะถูกกว่าราคาของ Dedicated Core อย่างมาก แต่ข้อเสีย คือ ประสิทธิภาพจะลดลง และอาจมีการแกว่งตัวได้บ้างในบางช่วงเวลา</p>\n<p>เมื่อเปรียบเทียบประสิทธิภาพต่อราคา (performance ของ vCPU per price ของการใช้งาน shared core) จะพบว่า NIPA Cloud Space ให้บริการในระดับที่สูงกว่าคลาวด์ระดับโลกอย่าง Amazon Web Services, Microsoft Azure และ Google Cloud Platform ถึง 2-3 เท่า</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ece34096fe08ec202c6fbd127d408fc6.jpg\" /></p>\n<p><strong>บทสรุปสำคัญ: ราคาที่แพงที่สุด อาจไม่ได้เป็นตัวเลือกที่ดีที่สุด</strong></p>\n<p>หลายครั้งการทดสอบเปรียบเทียบความคุ้มค่า (vCPU Performance vs Price) ราคาที่แพงสุด ไม่ได้หมายความว่าจะได้ performance ที่ดีที่สุดเสมอไป หรือ ราคาที่ต่ำที่สุด ไม่ได้หมายความว่าเป็นตัวเลือกที่แย่ที่สุดเสมอไป นอกจากเรื่องของราคาแล้ว การให้บริการ vCPU ประสิทธิภาพสูงที่มีความสม่ำเสมอ (dedicated core) หรือ vCPU ที่มีประสิทธิภาพลดลงมาจากการแบ่งปันการใช้งานร่วมกับผู้อื่น (shared core) ก็เป็นสิ่งสำคัญที่ผู้ใช้ต้องคำนึงถึงด้วยเช่นเดียวกัน</p>\n<p>จากการทดสอบเปรียบเทียบครั้งนี้ แสดงให้เห็นว่า NIPA Cloud คือผู้ให้บริการที่ให้ความ”คุ้มค่า” มากที่สุดสำหรับบริการในด้านประสิทธิภาพและ performance ของ vCPU Core ไม่ได้ด้อยไปกว่าผู้ให้บริการคลาวด์ต่างชาติเลย</p>\n<p>อ่านบทคัดย่อและดาวน์โหลดเอกสารฉบับเต็มได้ที่ <a href=\"https://nipa.cloud/th/blog/cloud-cpu-benchmark-2022-report?fbclid=IwAR3tizHZLF0Z31IwCUaKZ9qEUPT6bywAr6Rvh_dni-eJ1fHIvhQZHmcsqU0\">https://nipa.cloud/th/blog/cloud-cpu-benchmark-2022-report</a></p>\n<h1>จบปัญหาดับดาวน์ด้วยคลาวด์จากนิภา</h1>\n<h1>อันดับ1คลาวด์ไทยที่คนเลือกใช้มากที่สุด</h1>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/nipa-cloud\">Nipa Cloud</a></div><div><a href=\"/topics/cloud-provider\">Cloud Provider</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"48c5e9ad35efdccb5a9691b245a1709b0ae9ed073e225183ae7f1a78a63eff1c","category":"Thai"}