{"title":"Bottled water, tap water and household-treated tap water–insight into potential health risks and aesthetic concerns in drinking water","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000272","date":1725458400000,"content":"<p>by Samantha E. Bear, Talya Waxenberg, Charles R. Schroeder, Jessica J. Goddard</p>\r\n\r\nUnderstanding drinking water quality at the point-of-use across a range of consumer options is essential for designing effective public health interventions in the face of deteriorating source waters and complex contaminant mixtures. This is especially pressing as the popularity of tap water alternatives like bottled water and household treatment increases, yet this data is largely missing from the academic literature and policy discussions. This study presents one of the first evaluations of water quality comparing three common consumer drinking water options in the nine county San Francisco Bay Area with a survey of 100 analytes in 100 bottled water samples, 603 tap water samples, and 111 samples of household-treated tap water. Analytes measured included general water quality characteristics, metals, other inorganics, volatile organic compounds (including disinfection byproducts), and three microbial indicator species in bottled water only. Samples were evaluated to assess potential taste, odor, and color issues, as well as potential health risks by calculating cumulative toxicity quotients to reflect the additive toxicity of chemical mixtures. All three drinking water options had potential health risks, primarily driven by the presence of trihalomethanes (contributing from 76.7 to 94.5% of the total cumulative toxicity across the three drinking water options). While tap water had the highest potential toxicity among the three drinking water options, results suggest that household-scale treatment may reduce the potential for aesthetic issues and health risks of tap water.","author":"Samantha E. Bear","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"48cd58fd54f090a7d170158298becfc2055c69643cef19c090eaee2cdb770682","category":"Environment"}