{"title":"HP wireless all-in-one has 83 Wh rechargeable battery, handle for portability","link":"https://arstechnica.com/?p=1974095","date":1696624347000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/listing-980x651.jpg\" alt /></div>\n          <p>\n            HP sees the Envy Move being shared among family members and moved from room to room.                          [credit:\n                              HP                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>In a tech world with powerful desktops and<a href=\"https://arstechnica.com/gadgets/2023/04/last-gen-ultralight-laptops-are-nearly-as-fast-as-new-models-and-theyre-cheaper/\"> ultralight laptops</a>, all-in-one PCs have become a niche category. Yet, with the right twist, they can become more interesting. HP's Envy Move all-in-one PC, released today, has a handle and an integrated, rechargeable 83 Wh battery. Combined with a handle on its backside and a built-in pocket for its wireless keyboard, this AIO is ready to go wherever you want.</p>\n<p>The <a href=\"https://tidd.ly/3F8fD2j\" target=\"_blank\">Envy Move</a> is only 9.04 pounds and measures 21.74×5.85×14.43 inches. In a <a href=\"https://press.hp.com/us/en/blogs/2023/hp-envy-move-pc.html\">blog </a>post on Thursday, Jo Tan, senior vice president and division president of Personal Systems Consumer Solutions at HP Inc., said the computer was the \"world's only\" all-in-one with an integrated battery.</p>\n<p>The PC also has a built-in stand that Tan said uses two HP patents and can work on \"any flat surface.\" In videos shared with the press, the device's two feet look like they align horizontally with the device's bottom edge until they're pressed down onto a surface. Then, the legs flip out perpendicular to the machine's bottom edge and provide stability.</p></div><p><a href=\"https://arstechnica.com/?p=1974095#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1974095&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"48d0bbdda73150780c9589ad4d1c5f72d8afb8e81587536cd7c1960933c39bee","category":"Tech"}