{"title":"Apple Releases Tool to Help Developers Port Windows Games to Mac","link":"https://www.macrumors.com/2023/06/10/apple-releases-mac-game-porting-toolkit/","date":1686446923000,"content":"Apple at WWDC this week announced a <a href=\"https://developer.apple.com/videos/play/wwdc2023/10123/\">new toolkit</a> that makes it easier for game developers to port Windows games to the Mac. The toolkit provides an emulation environment that allows developers to run their existing, unmodified Windows game on the Mac and quickly evaluate how well the game could run on macOS before writing any code. A beta version of the toolkit is available for download on the Apple Developer website.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Mac-Gaming.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nApple is also offering developers a new Metal shader converter that simplifies the process of converting a Windows game's shaders and graphics code to run on Macs with Apple silicon. Apple says the toolkit and converter significantly reduce the total development time required to port games to the Mac, from months to just a few days.\r<br />\n\r<br />\nDevelopers interested in porting Windows games to the Mac can watch Apple's series of <a href=\"https://developer.apple.com/videos/play/wwdc2023/10123/\">\"bring your game to Mac\" videos</a> for more details. Apple also has a page on its website outlining various <a href=\"https://developer.apple.com/games/\">gaming technologies and tools</a> available for developers.\r<br />\n\r<br />\nApple appears to be increasing its commitment to high-end gaming on the Mac. For example, macOS Sonoma <a href=\"https://www.macrumors.com/2023/06/05/macos-14-game-mode/\">features a new Game Mode</a> that temporarily prioritizes CPU and GPU performance for gaming. Game Mode also lowers AirPods audio latency, and reduces input latency with popular third-party game controllers by doubling the Bluetooth sampling rate, according to Apple. macOS Sonoma will be released later this year.<div>Tags: <a href=\"https://www.macrumors.com/guide/windows/\">Windows</a>, <a href=\"https://www.macrumors.com/guide/mac-gaming/\">Mac Gaming</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/10/apple-releases-mac-game-porting-toolkit/\">Apple Releases Tool to Help Developers Port Windows Games to Mac</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-tool-to-help-developers-port-windows-games-to-mac.2392500/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"48d209e5510598d1c5dee2a18a524541696d6d89492024b2e1a027c09d9e80fd","category":"Apple"}