{"title":"Report Suggests iPhone 14 Plus More Popular Than iPhone 13 Mini","link":"https://www.macrumors.com/2023/03/21/iphone-14-plus-popularity-vs-iphone-13-mini/","date":1679403046000,"content":"Apple's iPhone 14 Plus appears to be selling better than the iPhone 13 mini it effectively replaced in the company's flagship lineup, based on display panel shipment data provided by Display Supply Chain Consultants (DSCC).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/09/iphone-14-iphone-14-plus-in-hand-feature.jpg\" alt width=\"2078\" height=\"1168\" />\r<br />\nAccording to the <a href=\"https://www.displaysupplychain.com/blog/dscc-reports-april-panel-shipments-for-the-iphone-14-series-fall-23-m-m\">DSCC report</a>, which compares iPhone panel shipment data from June 2022 through April 2023 (allocating a two-month forecast), shipments for the 6.7-inch iPhone 14 Plus are 59% higher than they were for the 5.4-inch iPhone 13 mini over the equivalent period year-on-year. \r<br />\n\r<br />\nThat's despite evidence suggesting that the iPhone 14 Plus is the least popular model in the current series. \r<br />\n\r<br />\nAlthough the iPhone 14 Plus appears to be doing a lot better than the iPhone 13 mini, it's far behind the iPhone 14 Pro Max, which takes a 36% share of overall panel shipments for the series. The iPhone 14 Pro accounts for 28% of shipments, while the iPhone 14 takes a 25% share. The iPhone 14 Plus meanwhile languishes behind the others with a 11% share.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/dscc-panel-shipment-report-2022-23.jpg\" alt width=\"1400\" height=\"473\" />\r<br />\nOverall, the iPhone 14 series looks to be marginally more popular than the previous series, with a 2% increase in the number of year-on-year panel shipments as of April, apparently buoyed by increased sales of the more expensive Pro models at the cost of fewer standard iPhone 14 models being sold.\r<br />\n\r<br />\nTaking into account potential stockpiling and shipment lags, monthly panel shipment numbers are unlikely to mirror the exact same number of iPhone units being sold in any given month. Nevertheless, the combined numbers for the 11-month period provide a likely accurate overall picture of sales. <br />This article, \"<a href=\"https://www.macrumors.com/2023/03/21/iphone-14-plus-popularity-vs-iphone-13-mini/\">Report Suggests iPhone 14 Plus More Popular Than iPhone 13 Mini</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/report-suggests-iphone-14-plus-more-popular-than-iphone-13-mini.2384302/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"48d580bf564c1aeb423ce4ee28562cbf70cd5f70fb3295d77c4e86f2d43a6865","category":"Apple"}