{"title":"Photoperiod and temperature interactions drive the latitudinal distribution of Laminaria hyperborea (Laminariales, Phaeophyceae) under climate change","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13497?af=R","date":1726124400000,"content":"<h2>Abstract</h2>\n<p>Due to global rises in temperature, recent studies predict marine species shifting toward higher latitudes. We investigated the impact of interacting abiotic drivers on the distribution potential of the temperate kelp <i>Laminaria hyperborea</i>. The ecosystem engineering species is widespread along European coasts but has not yet been observed in the High Arctic, although it can survive several months of low temperatures and darkness. To investigate its ability to extend northward in future, we conducted a long-term multifactorial experiment with sporophytes from Porsangerfjorden, Norway—close to the species' documented northernmost distribution margin. The samples were exposed to three different photoperiods (PolarDay, LongDay, and PolarNight) at 0°C, 5°C, and 10°C for 3 months. Optimum quantum yield of photosynthesis (<i>F</i>\n<sub>v</sub>/<i>F</i>\n<sub>m</sub>), dry weight, pigments, phlorotannins, and storage carbohydrates were monitored. Both physiological and biochemical parameters revealed that <i>L. hyperborea</i> was strongly influenced by the different photoperiods and their interaction with temperature, while temperature alone exerted only minor effects. The <i>F</i>\n<sub>v</sub>/<i>F</i>\n<sub>m</sub> data were integrated into a species distribution model to project a possible northward expansion of <i>L. hyperborea</i>. The combination of extended day lengths and low temperatures appeared to be the limiting reason for northward spread of <i>L. hyperborea</i> until recently. However, with water temperatures reaching 10°C in summer, this kelp will be able to thrive also in the High Arctic. Moreover, no evidence of stress to Arctic winter warming was observed. Consequently, <i>L. hyperborea</i> has a high potential for spreading northward with further warming which may significantly affect the structure and function of Arctic ecosystems.</p>","author":"Nora Diehl, \nPhilipp Laeseke, \nInka Bartsch, \nMargot Bligh, \nHagen Buck‐Wiese, \nJan‐Hendrik Hehemann, \nSarina Niedzwiedz, \nNiklas Plag, \nUlf Karsten, \nTifeng Shan, \nKai Bischof","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"48f17a4026a529498d36c3d1664d887b28b30dd59d1870a51470efbeff6ac655","category":"Environment"}