{"title":"Effect of different oligomerization assemblies of γ‐conglutin on its interaction behavior with vitexin","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13223?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Several different factors underlie the molecular mechanisms of phenolic compound-protein interactions. They include the environmental conditions. In the case of <i>γ</i>-conglutin, pH conditions translate directly into the adoption of two distinct oligomeric assemblies, i.e. hexameric (pH 7.5) or monomeric (pH 4.5). This paper reports research on the pH-dependent oligomerization of <i>γ</i>-conglutin in terms of its ability to form complexes with a model flavonoid (vitexin).</p>\n<h2>RESULTS</h2>\n<p>Fluorescence-quenching thermodynamic measurements indicate that hydrogen bonds, electrostatic forces, and van der Waals interactions are the main driving forces involved in the complex formation. The interaction turned out to be a spontaneous and exothermic process. Assessment of structural composition (secondary structure changes and arrangement/dynamics of aromatic amino acids), molecular size, and the thermal stability of the different oligomeric forms showed that <i>γ</i>-conglutin in a monomeric state was less affected by vitexin during the interaction.</p>\n<h2>CONCLUSION</h2>\n<p>The data show precisely how environmental conditions might influence phenolic compound-protein complex formation directly. This knowledge is essential for the preparation of food products containing <i>γ</i>-conglutin. The results can contribute to a better understanding of the detailed fate of this unique health-promoting lupin seed protein after its intake. © 2023 Society of Chemical Industry.</p>","author":"Jaroslaw Czubinski, \nKrzysztof Dwiecki","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"48f2be92b40220d2e62d228abb9dac22a95a499da60fa2a03b3ae3bc8f9a3ca1","category":"Environment"}