{"title":"Anionic lipids facilitate membrane development and protochlorophyllide biosynthesis in etioplasts","link":"https://academic.oup.com/plphys/article/194/3/1692/7420153?rss=1","date":1699920000000,"content":"<span><div>Abstract</div>Dark-germinated angiosperm seedlings develop chloroplast precursors called etioplasts in cotyledon cells. Etioplasts develop lattice membrane structures called prolamellar bodies (PLBs), where the chlorophyll intermediate protochlorophyllide (Pchlide) forms a ternary complex with NADPH and light-dependent NADPH:Pchlide oxidoreductase (LPOR). The lipid bilayers of etioplast membranes are mainly composed of galactolipids, which play important roles in membrane-associated processes in etioplasts. Although etioplast membranes also contain 2 anionic lipids, phosphatidylglycerol (PG) and sulfoquinovosyldiacylglycerol (SQDG), their roles are unknown. To determine the roles of PG and SQDG in etioplast development, we characterized etiolated Arabidopsis (<span>Arabidopsis thaliana</span>) mutants deficient in PG and SQDG biosynthesis. A partial deficiency in PG biosynthesis loosened the lattice structure of PLBs and impaired the insertion of Mg<sup>2+</sup> into protoporphyrin IX, leading to a substantial decrease in Pchlide content. Although a complete lack of SQDG biosynthesis did not notably affect PLB formation and Pchlide biosynthesis, lack of SQDG in addition to partial PG deficiency strongly impaired these processes. These results suggested that PG is required for PLB formation and Pchlide biosynthesis, whereas SQDG plays an auxiliary role in these processes. Notably, PG deficiency and lack of SQDG oppositely affected the dynamics of LPOR complexes after photoconversion, suggesting different involvements of PG and SQDG in LPOR complex organization. Our data demonstrate pleiotropic roles of anionic lipids in etioplast development.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"48f21e74bda650e8d205457c1e6aba77ba3a7753bbc8ecde8a3db2e77349f0f0","category":"Environment"}