{"title":"Assos Mille GT wind jacket review","link":"https://www.cyclist.co.uk/reviews/9940/assos-mille-gt-wind-jacket-review","date":1627567627000,"content":"<span>\n      <span><a href=\"/authors/marc-abbott\">Marc Abbott</a></span>\n  </span><div>  \n  <div>      <div><span>Tuesday, August 3, 2021 - 09:49</span></div>    </div></div><p>\nA premium, summer-ready weather barrier from Assos</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/07/screenshot_2021-07-29_at_15.06.30.png?itok=sC4Eq8PN\" />  </div>\n<div>  \n  <div>      <div><div>  \n  <div>\n    <div>\n      <div></div>\n    </div>\n  </div>\n      <span>\n      <strong>4.0</strong>\n      / <span>5</span>\n    </span>\n  \n</div>\n</div>    </div></div><div>  \n  <div>      <div>£110</div>    </div></div><div>\n      <p> Living in the UK, where four seasons in one day is not an unusual experience, requires us to accumulate a cycling wardrobe that offers something for every eventuality. Jerseys, bibshorts, socks, legwarmers, kneewarmers, armwarmers, gilets, wind jackets… the list is long, but each element is an essential for temperate climes.</p>\n<p>The problem with wind jackets is that, while usually quite affordable and worn only occasionally, they can hamper your ride if made badly. The Assos Mille GT wind jacket is specifically designed for summer use.</p>\n<p>Anyone who’s slung on a wind jacket for an early start or late return will recognise that creeping feeling of overheating, and the slimy interior caused by accumulated sweat… But – and this might make your ears prick up – the Assos Mille GT wind jacket suffers none of those pitfalls.</p>\n<h3>The difference</h3>\n<p>I’ve ridden in some nastly old wind jackets in my time, boiling in the bag as every movement of my torso was accompanied by a crisp packet-style rustle from the shell of the jacket.</p>\n<p>The Assos Mille GT wind jacket, however, is a joy to ride in, thanks to the materials employed. At the front of the jacket is the Swiss company’s ‘Foil Ultra’ ripstop fabric, which supplies the windproofing and even – thanks to a DWR treatment – even shrugs off light rain. The breathability so often missing from wind jackets is supplied by a warp-knit windproof stretch panel that runs up the inside of the arms and down the side of the torso.</p>\n<p><a href=\"https://www.wiggle.co.uk/assos-mille-gt-wind-jacket\" target=\"_blank\"><strong><em>Buy now from Wiggle for £110</em></strong></a></p>\n<p>This also allows a modicum of freedom of movement from this form-fitting jacket. Assos does reckon the Mille GT wind jacket is a ‘regular’ fit, but I had to size up to a size M in order to get something that wasn’t restrictive. For reference, I’ve a 36-inch chest and weigh 65kg dripping wet, so I’m a classic size S. Do bear this in mind if you’re buying online.</p>\n<h3>Simple but brilliant</h3>\n<p>It’s easy to be fooled by the innocuous appearance of this simple black jacket but, beyond the difference in materials, the whole garment is peppered with practicalities, and simple to throw on and stash away.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/9603/gallery-the-underdog-triumphs-on-stage-3-at-the-giro-ditalia\">Gallery: The underdog triumphs on Stage 3 at the Giro d'Italia</a></div>      <div><a href=\"/reviews/9679/cube-agree-c62-slt-review\">Cube Agree C:62 SLT review</a></div>      <div><a href=\"/reviews/4211/cube-cross-race-c62-cyclocross-bike-review\">Cube Cross Race C:62 cyclocross bike review</a></div>      <div><a href=\"/reviews/6076/cube-nuroad-ws-2019-bike-review\">Cube Nuroad WS 2019 bike review</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 116: on sale now!</a></div>    </div></div><p>\nThe size M Assos Mille GT wind jacket weighs just 92g, and scrunches up into the size of a small orange (or half a panino, if you’re the type of person who’d rather fold than scrunch), which makes it very easily to stow in a jersey pocket whilst riding.</p>\n<p>The elasticated wrists aren’t so tight that they cut off your blood supply but they do keep out any breeze. The stretch hem is complemented by a single strip of silicone gripper around the full circumference, wihch ensures the jacket stays absolutely anchored to your kit.</p>\n<p>There’s some very subtle Assos branding to the chest, an easily accessed full-length zipper and reflective tabs at the rear. And the double-fabric neck is not only comfortable against the skin but also great at keeping the elements at bay.</p>\n<h3>You get what you pay for</h3>\n<p>Dropping £110 on a jacket that you might not use more than 20 times a year does sound like a false economy, but the Assos Mille GT wind jacket justifies its pricetag admirably. Decent materials, a good fit, excellent breathability and exceptionally light and compact construction make this a jacket that you’ll want to wear, rather than grudgingly pack in your jersey pocket as a last resort.</p>\n<p><a href=\"https://www.wiggle.co.uk/assos-mille-gt-wind-jacket\" target=\"_blank\"><strong><em>Buy now from Wiggle for £110</em></strong></a></p>\n<p>Look at the investment in this piece the same way you would a nice sandwich. Yep, you could pick up a BLT from a supermarket meal deal, but it’s always going to disappoint, whether that’s due to limp lettuce or stringy bacon. Head to the farm shop or deli, whack those simple ingredients on a doorstop of home-made bread and the end result is clearly one worth paying a little extra for. </p>\n  </div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"48f883e2f4e96496124dfa042f42e8da01f13236013d68739a6436e8fa59f785","category":"Cycling"}