{"title":"Exploring urban forests in Minas Gerais, Brazil: floristic diversity and biome-driven insights to green infrastructure planning","link":"http://link.springer.com/10.1007/s11252-024-01601-6","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>This study analyzed urban forests in cities of the state of Minas Gerais, Brazil, aiming to explore the floristic composition, determine whether native or exotic species predominate, and investigate whether the biome of origin influences species composition. A survey of floristic studies in urban areas conducted in 2002–2023, utilized four databases: Google Scholar, Scopus, Scielo, and Web of Science. The search used the following descriptors: \"qualitative analysis\", \"urban afforestation\", \"urban forest\", \"urban green spaces\", and \"Minas Gerais\". Species were classified by origin, i.e., native or exotic, and in relation to their biome (Atlantic Forest, Cerrado, and Caatinga). A total of 407 species were identified, with 56% classified as exotic. The floristic profile of the urban forest was characterized by high richness of Fabaceae and significant representation of species such as <em>Cenostigma pluviosum</em>, <em>Moquilea tomentosa</em>, <em>Terminalia catappa</em>, <em>Ficus benjamina</em>, and <em>Murraya paniculata</em>. A Wilcoxon test revealed a significantly higher number of exotic species than natives. Based on the results of non-metric multidimensional scaling, along with cluster analysis, it was confirmed that the species composition of the urban forest is not related to the biome of origin or associated with the mesoregions of Minas Gerais, demonstrating biotic homogenization. In conclusion, the notable number of exotic species highlights a lack of planning by municipal authorities in developing a Green Infrastructure System. We recommend that species selection for the urban forest composition consider ecological, economic, and sociocultural criteria, consider the biome of local ecosystems, and prioritize the native indigenous species.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"48fb724bfecb39fb6075774d20876a0e6fcceb45afe29af01656f4b810d7db57","category":"Environment"}