{"title":"Unraveling female mate choice in Schizocosa mccooki: The interplay of male mass and vibratory courtship","link":"https://onlinelibrary.wiley.com/doi/10.1111/eth.13494?af=R","date":1722954675000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e8dd1689-b8f8-45f8-933e-202b4109585b/eth13494-toc-0001-m.png\" alt=\"Unraveling female mate choice in Schizocosa mccooki: The interplay of male mass and vibratory courtship\" />\n<p>The study aims to explore the relationship between male mass, temporal and spectral properties, and their association with mating success in the wolf spider <i>Schizocosa mccooki</i>. We found that male <i>S. mccooki</i> produce two vibratory signals, thumps and raps. Male mass is independent from temporal measurements of male courtship, but negatively correlates with signal frequency. Our data suggest that females evaluate both temporal and spectral properties of male courtship when making copulation decisions.</p>\n<br />\n<h2>Abstract</h2>\n<p>Sexual selection is an important evolutionary force and despite extensive research, understanding mate choice on naturally occurring trait variation remains an intriguing area of study. The correlation between mass, a trait associated with courter viability and common target for mate choice, and signals is particularly noteworthy. This study focuses on <i>Schizocosa mccooki</i>, the largest member of a wolf spider genus renowned for its diverse complex male courtship. Our objective was to understand the relationship of male mass and other courtship signals on female choice within this species. We conducted lab experiments involving random pairings of field caught males and females, recording vibratory courtship and its outcomes. Our findings revealed that <i>S. mccooki</i> courtship consisted of vibratory signals with two major components, thumps and raps. Male mass, overall courtship vigor, and thump duration were found to predict mating success. Interestingly, we found no correlation between temporal traits and mass suggesting independent information and an absence of trade-offs between mass, courtship vigor, and signal component rates/durations. Instead, we found that heavier males tend to produce thumps with lower frequencies. The finding that male mass predicts mating success contrasts with patterns observed in other species in this well-studied genus. By uncovering the mate choice patterns of <i>S. mccooki</i>, this study underscores the importance of comparative studies to understand the ways in which sexual selection drives diversification, even among closely related taxa.</p>","author":"Lin Yan, \nAthena Sabaria, \nDamian O. Elias, \nMalcolm F. Rosenthal","siteTitle":"Wiley: Ethology: Table of Contents","siteHash":"7a94182f50d5fe321f60efa1a57eebe5c3e6a74d1fa25ba04a906a999025c0b6","entryHash":"49032c1f9b36cfe9873fc97574ca9a1d597137cb179a7093655429bc40c3ad29","category":"Environment"}