{"title":"Comprehensive evaluation and application of woody plants in the green spaces of parks in saline–Alkaline areas from a low-carbon perspective: A case study of Tianjin Qiaoyuan Park","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303341","date":1715349600000,"content":"<p>by Jieyuan Bai, Hongcheng Wang</p>\r\n\r\nThe field of landscape architecture has placed significant emphasis on low-carbon landscapes due to the increasing challenges posed by global warming and environmental deterioration in recent years. The soil ecological conditions in saline–alkaline areas are characterized by poor quality, resulting in suboptimal growth conditions for trees. This, in turn, hampers their ability to effectively sequester carbon, thereby diminishing the potential benefits of carbon sinks. Additionally, the maintenance of tree landscapes in such areas generates more carbon emissions than does conventional green land, making it difficult to reap the benefits of tree-based carbon. A comprehensive evaluation of trees in green park spaces in saline–alkaline areas is conducted from a low-carbon perspective; by identifying the dominant tree species that are well suited to greening, we can offer a precise scientific foundation for implementing low-carbon greening initiatives in cities situated in saline–alkaline environments. Therefore, as a case study, this study investigates Tianjin Qiaoyuan Park, a typical saline park in the Bohai Bay region. The hierarchical analysis method (AHP) was used to evaluate 50 species of trees and shrubs in the park from a low-carbon perspective. The results show that the evaluation system consists of four criterion layers and 15 indicator factors. The relative weight of the criterion layer followed the order of habitat adaptability (B2) &gt; carbon sequestration capacity (B1) &gt; low-carbon management and conservation (B3) &gt; landscape aesthetics (B4). The indicator layer assigned greater weight values to net assimilation (C1), saline and alkaline adaptability (C3), drought tolerance (C4), irr igation and fertilization needs (C8), growth rate (C2), and adaptability to barrenness (C5). The trees were classified into five distinct categories, with each exhibiting significant variation in terms of the strengths and weaknesses of the indicators. According to the comprehensive score, the trees were categorized into three levels. The Grade I plants exhibited the best carbon efficiency performance, comprising a total of 12 species (e.g. <i>Sabina chinensis</i>, <i>Fraxinus chinensis ’Aurea’ and Hibiscus syriacu</i>), and demonstrated superior performance in all aspects. Grade II trees, consisting of 26 species (e.g <i>Pinus tabuliformis</i>, <i>Paulownia fortunei</i>, <i>Ligustrum × vicaryi</i>), had the second-highest comprehensive score. Moreover, Grade III trees, encompassing 12 species (e.g <i>Acer mono</i>, <i>Cedrus deodara</i>, <i>Magnolia denudata</i>), exhibited lower comprehensive scores. The extensive use of Grade I and II tree species is recommended in the implementation of low-carbon greening projects in the Bohai Bay region, while Grade III tree species should be judiciously utilized. The findings of this research can serve as a valuable resource for the scientific identification of tree species that are suitable for urban park green spaces in the Bohai Bay region, which is characterized by predominantly saline and alkaline soil. Additionally, the development of an evaluation system can guide the selection of low-carbon tree species when evaluating other types of saline and alkaline lands.","author":"Jieyuan Bai","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"49058f88455253a5e088aa16dbfa3a96055633522755d9d01288fa212bffea12","category":"Interdisciplinary"}