{"title":"Localizing Your Next.js App","link":"https://smashingmagazine.com/2021/11/localizing-your-nextjs-app/","date":1636462800000,"content":"<p>Instructing Next.js your app intends to have routes for different locales (or countries, or both) could not be more smooth. On the root of your project, create a <code>next.config.js</code> if you have not had the need for one. You can copy from this snippet.</p>\n<pre><code>/** @type {import('next').NextConfig} */\n\nmodule.exports = {\n  reactStrictMode: true,\n  i18n: {\n    locales: ['en', 'gc'],\n    defaultLocale: 'en',\n  }\n}</code></pre>\n\n<p><strong>Note</strong>: <em>The first line is letting the TS Server (if you are on a TypeScript project, or if you are using VSCode) which are the properties supported in the configuration object. It is not mandatory but definitely a nice feature.</em></p>\n<p>You will note two property keys inside the <code>i18n</code> object:</p>\n<ul>\n<li><code>locales</code><br />A list of all locales supported by your app. It is an <code>array</code> of <code>strings</code>.</li>\n<li><code>defaultLocale</code><br />The locale of your main root. That is the default setting when either no preference is found or you forcing to the root.</li>\n</ul>\n<p>Those property values will determine the routes, so do not go too fancy on them. Create valid ones using <a href=\"https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes\">locale code</a> and/or <a href=\"https://en.wikipedia.org/wiki/List_of_ISO_3166_country_codes\">country codes</a> and stick with lower-case because they will generate a <code>url</code> soon.</p>\n<p>Now your app has multiple locales supported there is one last thing you must be aware of in Next.js. Every route now exists on every locale, and the framework is aware they are the same. If you want to navigate to a specific locale,  we must provide a <code>locale</code> prop to our <code>Link</code> component, otherwise, it will fall back based on the browser’s <code>Accept-Language</code> header.</p>\n<pre><code>&lt;Link href=\"/\" locale=\"de\"&gt;&lt;a&gt;Home page in German&lt;/a&gt;&lt;/Link&gt;</code></pre>\n\n<p>Eventually, you will want to write an anchor which will just obey the selected locale for the user and send them to the appropriate route. That can easily be achieved with the <code>useRouter</code> custom hook from Next.js, it will return you an <code>object</code> and the selected <code>locale</code> will be a <code>key</code> in there.</p>\n<pre><code>import type { FC } from 'react'\nimport Link from 'next/link'\nimport { useRouter } from 'next/router'\n\nconst Anchor: FC&lt;{ href: string }&gt; = ({ href, children }) =&gt; {\n  const { locale } = useRouter()\n\n  return (\n    &lt;Link href={href} locale={locale}&gt;\n      &lt;a&gt;{children}&lt;/a&gt;\n    &lt;/Link&gt;\n  )\n}</code></pre>\n\n<p>Your Next.js is now fully prepared for internationalization. It will:</p>\n<ul>\n<li>Pick up the user’s preferred locale from the <code>Accepted-Languages</code> header in our request: courtesy of Next.js;</li>\n<li>Send the user always to a route obeying the user’s preference: using our <code>Anchor</code> component created above;</li>\n<li>Fall back to the default language when necessary.</li>\n</ul>\n<p>The last thing we need to do is make sure we can handle translations. At the moment, routing is working perfectly, but there is no way to adjust the content of each page.</p>\nCreating A Dictionary\n<p>Regardless if you are using a Translation Management Service or getting your texts some other way, what we want in the end is a JSON object for our JavaScript to consume during runtime. Next.js offers three different runtimes:</p>\n<ul>\n<li>client-side,</li>\n<li>server-side,</li>\n<li>compile-time.</li>\n</ul>\n<p>But keep that at the back of your head for now. We’ll first need to structure our data.</p>\n<p>Data for translation can vary in shape depending on the tooling around it, but ultimately it eventually boils down to locales, keys, and values. So that is what we are going to get started with. My locales will be <code>en</code> for English and <code>pt</code> for Portuguese.</p>\n<pre><code>module.exports = {\n  en: {\n    hello: 'hello world'\n  },\n  pt: {\n    hello: 'oi mundo'\n  }\n}</code></pre>\n\nTranslation Custom Hook\n<p>With that at hand, we can now create our translation custom hook. </p>\n<pre><code>import { useRouter } from 'next/router'\nimport dictionary from './dictionary'\n\nexport const useTranslation = () =&gt; {\n  const { locales = [], defaultLocale, ...nextRouter} = useRouter()\n  const locale = locales.includes(nextRouter.locale || '')\n    ? nextRouter.locale\n    : defaultLocale\n\n  return {\n    translate: (term) =&gt; {\n      const translation = dictionary[locale][term]\n\n      return Boolean(translation) ? translation : term\n    }\n  }\n}</code></pre>\n\n<p>Let’s breakdown what is happening upstairs:</p>\n<ol>\n<li>We use <code>useRouter</code> to get all available locales, the default one, and the current;</li>\n<li>Once we have that, we check if we have a valid locale with us, if we do not: fallback to the default locale;</li>\n<li>Now we return the <code>translate</code> method. It takes a <code>term</code> and fetches from the dictionary to that specified locale. If there is no value, it returns the translation <code>term</code> again.</li>\n</ol>\n<p>Now our Next.js app is ready to translate at least the more common and rudimentary cases. Please note, this is not a dunk on translation libraries. There are <strong>tons of important features</strong> our custom hook over there is missing: interpolation, pluralization, genders, and so on.</p>\nTime To Scale\n<p>The lack of features to our custom hook is acceptable if we do not need them right now; it is always possible (and arguably better) to implement things when you actually need them. But there is one fundamental issue with our current strategy that is worrisome: it is not leveraging the isomorphic aspect of Next.js.</p>\n<p>The worst part of scaling localized apps is not managing the translation actions themselves. That bit has been done quite a few times and is somewhat predictable. The problem is dealing with the bloat of shipping endless dictionaries down the wire to the browser — and they only multiply as your app requires more and more languages. That is data that very often becomes useless to the end-user, or it affects performance if we need to fetch new keys and values when they switch language. If there is one big truth about user experience, it’s this: your users will surprise you. </p>\n<p>We cannot predict <em>when</em> or <em>if</em> users will switch languages or need that additional key. So, ideally, our apps will have all translations for a specific route at hand when such a route is loaded. For now, we need to split chunks of our dictionary based on what the page renders, and what permutations of state it can have. This rabbit hole goes deep.</p>\nServer-Side Pre-Rendering\n<p>Time to recap our new requirements for scalability:</p>\n<ol>\n<li>Ship as little as possible to the client-side;</li>\n<li>Avoid extra requests based on user interaction;</li>\n<li>Send the first render already translated down to the user.</li>\n</ol>\n<p>Thanks to the <code>getStaticProps</code> method of Next.js pages, we can achieve that without needing to dive at all into compiler configuration. We will import our entire dictionary to this special Serverless Function, and we will send to our page a list of special objects carrying the translations of each key.</p>\nSetting Up SSR Translations\n<p>Back to our app, we will create a new method. Set a directory like <code>/utils</code> or <code>/helpers</code> and somewhere inside we will have the following:</p>\n<pre><code>export function ssrI18n(key, dictionary) {\n  return Object.keys(dictionary)\n    .reduce((keySet, locale) =&gt; {\n      keySet[locale] = (dictionary[locale as keyof typeof dictionary][key])\n      return keySet\n    , {})\n}</code></pre>\n\n<p>Breaking down what we are doing:</p>\n<ol>\n<li>Take the translation <code>key</code> or <code>term</code> and the <code>dictionary</code>;</li>\n<li>Turn the <code>dictionary</code> object into an array of its <code>keys</code>;</li>\n<li>Each key from the dictionary is a <code>locale</code>, so we create an object with the <code>key</code> name and each <code>locale</code> will be the value for that specific language.</li>\n</ol>\n<p>An example output of that method will have the following shape:</p>\n<pre><code>{\n  'hello': {\n    'en': 'Hello World',\n    'pt': 'Oi Mundo',\n    'de': 'Hallo Welt'\n  }\n}</code></pre>\n\n<p>Now we can move to our Next.js page.</p>\n<pre><code>import { ssrI18n } from '../utils/ssrI18n'\nimport { DICTIONARY } from '../dictionary'\nimport { useRouter } from 'next/router'\n\nconst Home = ({ hello }) =&gt; {\n  const router = useRouter()\n  const i18nLocale = getLocale(router)\n\n  return (\n    &lt;h1 className={styles.title}&gt;\n      {hello[i18nLocale]}\n    &lt;/h1&gt;\n  )\n}\n\nexport const getStaticProps = async () =&gt; ({\n  props: {\n    hello: ssrI18n('hello', DICTIONARY),\n    // add another entry to each translation key\n  }\n})</code></pre>\n\n<p>And with that, we are done! Our pages are only receiving exactly the translations they will need in every language. No external requests if they switch languages midway, on the contrary: the experience will be super quick.</p>\nSkipping All Setup\n<p>All that is great, but we can still do better for ourselves. The developer could take some attention; there is a lot of bootstrapping in it, and we are still relying on not making any typos. If you ever worked on translated apps, you’ll know that there will be a mistyped key somewhere, somehow. So, we can bring the type-safety of TypeScript to our translation methods.</p>\n<p>To skip this setup <em>and</em> get the TypeScript safety and autocompletion, we can use <a href=\"https://github.com/atilafassina/next-g11n\"><code>next-g11n</code></a>. This is a tiny library that does exactly what we have done above, but adds types and a few extra bells and whistles.</p>\nWrapping Up\n<p>I hope this article has given you a larger insight into what <a href=\"https://nextjs.org/docs/advanced-features/i18n-routing\">Next.js Internationalized Routing</a> can do for your app to achieve Globalization, and what it means to provide a top-notch user experience in localized apps in today’s web. Let hear what you think in the comments below, or send a <a href=\"https://atila.io/twitter\">tweet</a> my way.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"490a651f0c95d3a28a2ba48e817d67106d5817655b635d43fdf411a93daa871b","category":"Tech"}