{"title":"Nothing Launches $149 Ear (2) Wireless Earbuds to Compete With AirPods Pro 2","link":"https://www.macrumors.com/2023/03/22/nothing-launches-ear-2-wireless-earbuds/","date":1679503731000,"content":"Nothing today announced the launch of its second-generation wireless earbuds, the <a href=\"https://us.nothing.tech\">Nothing Ear (2)</a>, which offer many of the same features as Apple's <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> 2 at a lower price point. We went hands-on with the Ear (2) earbuds to see whether they're a viable alternative to the ‌AirPods Pro‌ 2 for those who want to save some cash.\r<br />\n\r<br />\n<div></div>\r<br />\nThe Ear (2) earbuds are the successor to the Nothing Ear (1), and Nothing has used the same general form factor. Nothing's products stand out because of the clear design that lets you see some of the internals, and it's definitely a unique and appealing look. There's a clear body for the stem, with additional components housed in the white plastic top that also has a silicone tip for a comfortable fit in the ear. Compared to the ‌AirPods Pro‌ 2, the Nothing Ear (2) are just about as comfortable, even for longer periods of wear.\r<br />\n\r<br />\nLike the ‌AirPods Pro‌ 2, the Ear (2) earbuds feature Active Noise Cancellation. Nothing advertises some bells and whistles like personalization that tailors ANC to the shape of a user's ear, but the ANC on the Ear (2) is about on par with the ‌AirPods Pro‌ 2 ANC. There is a transparency mode that is meant to adjust noise reduction based on environment in real time, like Apple's Adaptive Transparency, but as we've encountered before, no one seems to be able to do Transparency like Apple. The Ear (2)'s transparency options just aren't great.\r<br />\n\r<br />\nAs for sound quality, Nothing has added Hi-Res Audio certification and LHDC 5.0, which is a low latency audio codec meant to deliver better sound. There's also an 11.6mm driver and a \"dual-chamber\" design for better sound quality and \"smoother airflow,\" and while the sound is good, it is not quite at the ‌AirPods Pro‌ 2 level.\r<br />\n\r<br />\nThe Ear (2) earbuds are also lacking many of the features that you get using ‌AirPods Pro‌ 2 with Apple devices, such as instant pairing, automatic device switching, and Spatial Audio, which is something to keep in mind.\r<br />\n\r<br />\nNothing highlights a range of features like Dual Connection for connecting to two devices at the same time, a personal sound profile for customization, and clear voice technology for better call quality. The customization in particular is something that you can't get with the AirPods, so that might appeal to some who want more control over the listening experience.\r<br />\n\r<br />\nThe Nothing Ear (2) buds feature 36 hours of total playback time with the charging case battery life included and ANC turned off, and they offer IP54 water resistance so they're able to hold up to sweat. There are on-device controls that are activated with a press, and if you have an Android device or a Windows device there are some quick pairing options to take advantage of.\r<br />\n\r<br />\nMake sure to watch our video to see the earbuds in action, with a full overview of all of the available features.\r<br />\n\r<br />\nThe Nothing Ear (2) earbuds <a href=\"https://us.nothing.tech\">are priced at $149</a>, and they are available for purchase from the Nothing website starting today.<div>Tag: <a href=\"https://www.macrumors.com/guide/nothing/\">Nothing</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/22/nothing-launches-ear-2-wireless-earbuds/\">Nothing Launches $149 Ear (2) Wireless Earbuds to Compete With AirPods Pro 2</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/nothing-launches-149-ear-2-wireless-earbuds-to-compete-with-airpods-pro-2.2384459/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"490d097f67dac3f9dc085aec2cabd4ba3246bc3981d760828c1eff8ea2d5518f","category":"Apple"}