{"title":"Human-Derived collagen hydrogel as an antibiotic vehicle for topical treatment of bacterial biofilms","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303039","date":1714744800000,"content":"<p>by Evan Jarman, Jordan Burgess, Ayushi Sharma, Kate Hayashigatani, Amar Singh, Paige Fox</p>\r\n\r\nThe complexity of chronic wounds creates difficulty in effective treatments, leading to prolonged care and significant morbidity. Additionally, these wounds are incredibly prone to bacterial biofilm development, further complicating treatment. The current standard treatment of colonized superficial wounds, debridement with intermittent systemic antibiotics, can lead to systemic side-effects and often fails to directly target the bacterial biofilm. Furthermore, standard of care dressings do not directly provide adequate antimicrobial properties. This study aims to assess the capacity of human-derived collagen hydrogel to provide sustained antibiotic release to disrupt bacterial biofilms and decrease bacterial load while maintaining host cell viability and scaffold integrity. Human collagen harvested from flexor tendons underwent processing to yield a gellable liquid, and subsequently was combined with varying concentrations of gentamicin (50–500 mg/L) or clindamycin (10–100 mg/L). The elution kinetics of antibiotics from the hydrogel were analyzed using liquid chromatography-mass spectrometry. The gel was used to topically treat Methicillin-resistant <i>Staphylococcus aureus</i> (MRSA) and <i>Clostridium perfringens</i> in established Kirby-Bauer and Crystal Violet models to assess the efficacy of bacterial inhibition. 2D mammalian cell monolayers were topically treated, and cell death was quantified to assess cytotoxicity. Bacteria-enhanced <i>in vitro</i> scratch assays were treated with antibiotic-embedded hydrogel and imaged over time to assess cell death and mobility. Collagen hydrogel embedded with antibiotics (cHG+abx) demonstrated sustained antibiotic release for up to 48 hours with successful inhibition of both MRSA and <i>C</i>. <i>perfringens</i> biofilms, while remaining bioactive up to 72 hours. Administration of cHG+abx with antibiotic concentrations up to 100X minimum inhibitory concentration was found to be non-toxic and facilitated mammalian cell migration in an <i>in vitro</i> scratch model. Collagen hydrogel is a promising pharmaceutical delivery vehicle that allows for safe, precise bacterial targeting for effective bacterial inhibition in a pro-regenerative scaffold.","author":"Evan Jarman","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4913ea7dea53a50682861dbe6b3ea35bc2169bc331d53b66ec0063df750c7735","category":"Interdisciplinary"}