{"title":"Thibaut Pinot: Once More, With Feeling","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/thibaut-pinot-once-more-with-feeling","date":1690052291000,"content":"\n      <p><span>When Thibaut Pinot is an old man and looks back on his life many years from now, surely the most vivid memory of his years as a professional cyclist will be the few minutes of roiling, fervent din in the last few kilometres of the Petit Ballon on stage 20 of the 2023 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>. He was carried towards the summit of the climb by a thermal updraft of love and passion, just him, alone with his public, a single quiet introvert in communion with thousands by the roadside and many tens of thousands more watching on television. Old man Pinot will look out at the green hills around his smallholding, listen to the chatter of the goats, and maybe he’ll smile.</span></p>\n<div></div>\n<p><span>Everything that you need to know about Thibaut Pinot, an entire life and career, were contained in that moment. People want Pinot to win. At the same time, they know he will not. And the combined willpower of thousands upon thousands of cycling fans will not, in the end, be enough to make any difference. The author Darin Strauss wrote, in his memoir </span><i><span>Half a Life,</span></i><span> “Regret doesn’t budge things; it seems crazy that the force of all that human want can’t amend a moment, can’t even stir a pebble.” </span></p>\n<p><span>Because moments like that in cycling, fleeting and transcendent as they are, do not exist separately from the world. Pinot was alone, but he was also only 35 seconds ahead of his erstwhile companions Tom Pidcock and Warren Barguil and 1:24 ahead of the yellow jersey group. Tadej Pogačar’s UAE Emirates team had kept the break on a tightish leash all day, and could easily anticipate closing the gap on the tough final climb to the Col du Plazerwasel. While the cycling world bathed itself in the warm glow of that perfect moment, and hoped it would last forever, it turned out to be transient, as the racers behind coldly readied themselves to chase, catch and drop Thibaut Pinot. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230722TDF0033-A.S.O._Pauline_Ballet_1024x1024.jpg?v=1690052193\" alt /></div>\n<p> <em><span>Pauline Ballet / ASO</span></em></p>\n<p><span>Pinot is often described as one of cycling’s last romantics, although it would be more accurate to say he is its most prominent. He races on feel and emotion, a human counterpoint to the circumspection and rationality of Jumbo-Visma, or the Ineos Grenadiers, who have a stereotypically more classicist, northern European approach. Romanticism is how we would like the world to be; classicism is how the world actually is. It is why Jonas Vingegaard will be the winner of the 2023 Tour de France. And it is why Thibaut Pinot only came seventh at Le Markstein on stage 20. He even got outsprinted for sixth.</span></p>\n<p><span>Pinot’s fans hoped that this second-last stage in his final Tour, on his home roads in Alsace, would be a victory parade. However, they would not have been optimistic, even though the rider himself put himself in the right position to win, and if the yellow jersey group had not chased, he could even have done so. However, that was outside of his control. “Hope,” wrote the author and future Czech president Václav Havel in his 1991 book </span><i><span>Disturbing the Peace</span></i><span>, “is not the same thing as optimism. It is not the conviction that something will turn out well, but the certainty that something makes sense, regardless of how it turns out.” There was something that made sense about Pinot’s solo move from the group with 31km to go – it felt </span><i><span>right</span></i><span> that he was off the front, and his ascent of the Petit Ballon, in front of his adoring fans, was the Tour’s farewell gift to him and his to the Tour. But it all made sense regardless of how it turned out, which is why it doesn’t matter that Pinot didn’t win.</span></p>\n<p><span>I wonder how Pinot views his career. He could have won the 2019 Tour de France, an anarchic, unpredictable race in which he spent most of the three weeks climbing better than anybody else, but lost it twice – first in the crosswinds of a flat stage in the first half, and then when a muscular injury forced him out of the race in tears on the penultimate stage in the Alps. On the other hand, that race cemented his status as a tragic hero, which he seemed not to appreciate, but which he has resignedly come to terms with as his career’s end approaches. He’s grown up a bit, too – the younger Thibaut Pinot disliked the attention and pressure of his prominence, but in the last couple of years, he’s half embraced it. And for someone with a reputation as a plucky loser, he’s got a glittering palmarès, including victory in Il Lombardia and Grand Tour placings of third, fourth, fifth, sixth and seventh. He achieved 20 top-10 finishes in WorldTour stage races, though his only GC wins – seven in total – were in smaller races. He won 33 races in total, which is a pretty good return. You could say that his palmarès were not the equal to his physical potential, but that is to misunderstand the complex and ephemeral balance between head, heart and legs in cycling. You could say that if Thibaut Pinot had been more organised and rode more defensively, then he’d have won more races, but then he also wouldn’t have been Thibaut Pinot.</span></p>\n<p><span>And this is why the highest expression of who he is and what he means to cycling is found not on the results sheet, but in the fleeting memory of those few minutes on the Petit Ballon, when Thibaut Pinot ascended beyond the race itself and into the hearts of cycling fans. In the end, the career of Thibaut Pinot has never been about winning and losing, but about feeling.</span></p>\n<p><em><span>﻿Main image: Getty Images</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"49304b7771df4508fe2105d8810ee1299b2b0c6af479a94b33eea931a1806890","category":"Cycling"}