{"title":"Mathematics of Epidemics: On the General Solution of SIRVD, SIRV, SIRD and SIR Compartment Models","link":"https://www.preprints.org/manuscript/202402.1675/v2","date":1710511416000,"content":"The susceptible-infected-recovered-vaccinated-deceased (SIRVD) epidemic compartment model extends the SIR model to include the effects of vaccination campaigns and time-dependent fatality rates on epidemic outbreaks. It encompasses the SIR, SIRV, SIRD, and SI models as special cases, with individual time-dependent rates governing transitions between different fractions. We investigate a special class of exact solutions and accurate analytical approximations for the SIRVD and SIRD compartment models. While the SIRVD and SIRD equations pose complex integro-differential equations for the rate of new infections and the fractions as a function of time, a simpler approach considers determining equations for the sum of ratios for given variations. This approach enables us to derive fully exact analytical solutions for the SIRVD and SIRD models. For nonlinear models with a high-dimensional parameter space, such as the SIRVD and SIRD models, analytical solutions, exact or accurately approximative, are of high importance and interest: not only as suitable benchmarks for numerical codes, but especially as they allow us to understand the critical behavior of epidemic outbursts as well as the decisive role of certain parameters. In the second part of our study, we apply a recently developed analytical approximation for the SIR and SIRV models to the more general SIRVD model. This approximation offers accurate analytical expressions for epidemic quantities, such as the rate of new infections and the fraction of infected persons, particularly when the cumulative fraction of infections is small. The distinction between recovered and deceased individuals in the SIRVD model affects the calculation of the death rate, which is proportional to the infected fraction in the SIRVD/SIRD cases but often proportional to the rate of new infections in many SIR models using a posteriori approach. We demonstrate that the temporal dependence of the infected fraction and the rate of new infections differs when considering the effects of vaccinations and when the real-time dependence of fatality and recovery rates diverge. These differences are highlighted for stationary ratios and gradually decreasing fatality rates. \\Revised{The case of stationary ratios allows one to construct a new powerful diagnostics method to extract analytically all SIRVD model parameters from measured COVID-19 data of a completed pandemic wave.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"49314afa4fe2732411b1d91fdf649cdcc7e26fd5b23b1cda17920ab47c685a7c","category":"Interdisciplinary"}