{"title":"Power Signal Histograms: A Method of Power Grid Data Compression on the Edge for Real-time Incipient Fault Forensics","link":"https://www.preprints.org/manuscript/202409.1222/v1","date":1726479309000,"content":"Across the power grid infrastructure, deployed power transmission systems are susceptible to incipient faults that interrupt standard operations. These incipient faults can range from being benign in impact to causing massive hardware damage and even loss of life. The power grid is continuously monitored, and incipient faults are recorded by Digital Fault Recorders (DFRs) to mitigate such outcomes. DFR recorded data allows power quality forensics and event analysis, but this capability comes at the cost of high data storage and data transmission requirements. It is common for data older than two weeks to be overwritten due to storage limitations and without being analyzed. This inhibits the creation of long-term data libraries that would enable incipient fault forensics and the characterization of behavior that precedes them, which limits the development and implementation of preventive measures; thus, there is a critical need to reduce DFR recorded data storage requirements. This work addresses this critical need by leveraging the cyclic and residual histograms and introducing the frequency, and Root Means Squared (RMS) histograms, which alleviate current high data storage requirements and provides effective Incipient Fault Prediction (IFP). The residual, frequency, and RMS histograms are an extension of the cyclic histogram, reduce the date storage requirement by up to 99.58%, can be generated on the DFR without interrupting its normal operations, and are capable of predicting voltage arcing six hours before it is strong enough to trigger a DFR recorded event.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"49347cef5e5c6f1910c1667d455e4165761d828827e518bd926d365b39f9a765","category":"Interdisciplinary"}