{"title":"In silico investigation of the role of miRNAs in a possible developmental origin of prostate cancer in F1 and F2 offspring of mothers exposed to a phthalate mixture","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24181?af=R","date":1710146631000,"content":"<h2>Abstract</h2>\n<p>A previous study using miRNA sequencing revealed that exposure to a mixture of phthalates during pregnancy and lactation dysregulated rno-miR-184 and rno-miR-141-3p in the ventral prostate (VP) of offspring. Here, rno-miR-184 and rno-miR-141-3 expressions were obtained by RT-qPCR in the VP of F1 males as well as in F2 offspring, aiming to establish a relationship with possible oncogenic targets through in silico analyses with multigenerational approach. Additionally, some targets were measured by western blots to highlight a possible relationship between the deregulated miRNAs and some of their targets. VP samples from rats exposed to a mixture of phthalates maternally during pregnancy and lactation (GD10 to PND21-F1) and VP from offspring (F2) were examined. The phthalate mixture at both concentrations (20 μg and 200 mg/kg/day) increased the expression of both miRNAs in the F1 (PND22 and 120) and F2 (descendants of F1-treated males) prostate. Target prediction analysis revealed that both microRNAs are responsible for modulating the expression and synthesis of 40 common targets. A phthalate target association analysis and the <i>HPA</i> database showed an interesting relationship among these possible miRNAs modulated targets with prostate adenocarcinoma and other oncogenic processes. Western blots showed alteration in P63, P53, WNT5, and STAT3 expression, which are targeted by the miRNAs, in the VP of F1/F2 males. The data draw attention to the epigenetic modulation in the prostate of descendants exposed to phthalates and adds to one of the few currently found in the literature to point to microRNAs signature as biomarkers of exposure to plasticizers.</p>","author":"A. M. Aquino, \nM. N. Fioretto, \nL. G. Alonso‐Costa, \nV. A. Rocha, \nP. V. Souza, \nN. Magosso, \nL. F. Barbisan, \nL. A. Justulin, \nJ. A. Flaws, \nW. R. Scarano","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"4935c07a23d53ff3aff6d34a0dc92aa4b8665138276231f0e472f87cd33642a5","category":"Environment"}