{"title":"Mac Home directory bug is blocking user logins on macOS Ventura 13.3","link":"https://www.macworld.com/article/1683099/macos-ventura-13-3-home-directory-bug-system-integrity-protection.html","date":1680693300000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you’re a macOS Ventura user and you’ve set up your user account with the Home directory saved to an external storage device, you should wait before updating to version 13.3. A number of users who set up their Macs this way have found that they cannot access their accounts after installing the update. [<em>Hat tip to Macworld reader Lee</em>.]</p>\n\n\n\n<p>The problem, which is <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/MacOS/comments/124fods/warning_133_breaks_setups_where_home_directories/&amp;xcust=1-1-1683099-1-0-0&amp;sref=https://www.macworld.com/feed\">addressed on Reddit</a>, is that after updating to 13.3, the Mac restarts, and then when the user tries to log in, a message appears that says the log-in “failed because an error occurred.” No explanation of the error is offered, and clicking the OK button simply sends the user back to the login screen.</p>\n\n\n\n<p>The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/MacOS/comments/124fods/comment/je9yt8u/&amp;xcust=1-1-1683099-1-0-0&amp;sref=https://www.macworld.com/feed\">workaround</a>, explained by Neat_Release_2683 on Reddit, involves turning off System Integrity Protection while in Recovery Mode. I was able to replicate the problem on a 14-inch M1 Pro MacBook Pro with Ventura 13.3 and an account Home folder saved to a USB-C flash drive. I used the steps below to fix it.</p>\n\n\n\n<h2>Workaround to macOS Ventura 13.3 external Home folder bug</h2>\n\n\n\n<p>If your user account’s Home folder is saved to an external drive, and it is the only account with admin rights, you can try using the workaround below. If your Mac has another admin account on it with the Home folder saved to the Mac’s internal drive, there is another workaround you can use.</p>\n\n\n\n<div>\n<div><div><div>At a glance </div></div><ul><li><span>Time to complete: </span><span>  5 minutes</span></li><li>Tools required: macos Ventura 13.3</li></ul></div>\n\n\n\n<div>\n<div><span>1.</span>\n<h3>Boot into Recovery Mode</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/macos-recovery-screen.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Recovery screen\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>On M-series Macs, hold down the power button and continue to hold until the screen says, “Loading startup options.”</p>\n\n\n\n<p>On Intel Macs, hold down the Command and R keys.</p>\n\n\n\n<p>Select the <em>Option</em> icon when it appears and click <em>Continue</em>.</p>\n\n\n\n<p>The macOS Recovery screen should appear with user login icons. Select an account that has admin rights, then click <em>Next</em>. Enter the password for the account.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>2.</span>\n<h3>Go to the Terminal</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/macos-recovery-mode-terminal.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Recovery Mode Terminal\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>You’re now in Recovery Mode. Ignore the main window and click the <em>Utilities</em> menu. Select <em>Terminal</em>. If you’re not familiar with using the <a href=\"https://www.macworld.com/article/671618/how-to-use-terminal-on-mac.html\">Terminal</a>, it’s okay. The Terminal is the command-line interface for the Mac, and you’ll enter an easy command.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>3.</span>\n<h3>Turn off SIP</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/terminal-disable-sip.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macos terminal disable SIP\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>A Terminal window appears, with a prompt that says something like, <code>-bash-3.2#</code> and then a cursor.</p>\n\n\n\n<p>Type <code>csrutil disable</code> and then press the Return key.</p>\n\n\n\n<p>That command turns off System Integrity Protection, and if you’ve never turned it off before, a warning will appear. Type <code>y</code> to continue.</p>\n\n\n\n<p>Enter your username and then your password, It may look like your Mac is doing nothing but wait a bit. A message telling you to restart your Mac will appear when the changes are implemented.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>4.</span>\n<h3>Restart, login, check iCloud, re-enable SIP</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/ventura-desktop-home-external.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Ventura desktop Home external\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Now restart your Mac ( &gt; <em>Restart</em>). You should be able to log into your account.</p>\n\n\n\n<p>Go to <em>System Settings</em> and check your iCloud settings to make sure everything is enabled.</p>\n\n\n\n<p>Now you can re-enable SIP by repeating steps 1 through 4, but at the Terminal in step 2, enter the command <code>csrutil enable</code> instead.</p>\n</div>\n</div>\n</div>\n</div>\n</div>\n\n\n\n<h2><strong>Workaround if you have multiple admin accounts</strong></h2>\n\n\n\n<p>You can use the following workaround for the user account with the Home folder on an external drive. But you need to have <em>another account with admin rights</em> on the Mac that also has its Home folder on the <em>internal</em> Mac storage.</p>\n\n\n\n<ol><li>Log into the admin account that has its Home folder saved to internal storage.</li><li>Go to System Settings &gt; <em>Privacy &amp; Security</em>.</li><li>In the main section of the window, scroll down to the “Allow accessories to connect” section. Click the pop-up to the right and select <em>Always</em>.</li></ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/ventura-acessory-permission.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Ventura accessory permission\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/ventura-acessory-permission.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/04/ventura-acessory-permission.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/ventura-acessory-permission.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/ventura-acessory-permission.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/ventura-acessory-permission.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/04/ventura-acessory-permission.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/04/ventura-acessory-permission.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/04/ventura-acessory-permission.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Foundry</p></div>\n\n\n\n<ol><li>MacOS requires a username and password to modify this setting. Enter the info and click <em>Modify Settings.</em></li><li>Log out, and you should be able to log into the account that has its Home folder on external storage.</li></ol>\n\n\n\n<h2>What is causing the problem?</h2>\n\n\n\n<p>Based on my hands-on experience (and not a deep tech dive into working code), the problem seems to be related to a feature within macOS’s System Integrity Protection, referred to as SIP. One of the features of SIP is that it can alert you whenever an accessory (such as an external storage device) is connected to your Mac.</p>\n\n\n\n<p>With Ventura 13.3, this alert seems to hinder the ability to log in, creating a Catch-22 situation. Because the external drive has yet to be approved by the user, the Mac won’t access the drive and log in can’t be accomplished. But if you can’t log in, you can’t approve the drive. If SIP is turned off, then the alerts won’t appear and the external drive can connect.</p>\n\n\n\n<p>Why would anyone save a Home folder to an external drive in the first place? Mostly it’s because the Mac’s internal storage is running out. The Home folder saves a lot of user info, such as app libraries and your files. It is possible to save individual components of the Home folder to an external drive instead of the whole Home folder–for example, on a 2013 Mac Pro with a 512GB SSD that I use at home, I save my iMovie, Photos, and Music libraries to a 5TB external drive. But some people may not want to hassle with individual components and simply place the whole Home folder on an external drive.</p>\n\n\n\n<p>Apple has been contacted about this issue but has not yet responded to our inquiry. It’s unclear if this issue is addressed in the macOS Ventura 13.4 beta that is currently in the works. We’ll update this article with any further developments.</p>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4935cacd1deb006cb78f09962b5ffcf8db72d357caee7555f4e5cbf331e5e2cd","category":"Apple"}