{"title":"Elon’s Edsel? The Tesla Cybertruck went on sale today","link":"https://arstechnica.com/?p=1987661","date":1701381101000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/2024-Tesla-Cybertruck-in-a-showroom-1-800x600.jpg\" alt=\"A Tesla Cybertruck in a Tesla store\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/2024-Tesla-Cybertruck-in-a-showroom-1-scaled.jpg\">Enlarge</a> <span>/</span> It will probably be a while before you see these on the road, but some Tesla stores now have display Cybertrucks. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Thursday afternoon, Tesla delivered the first 10 production Cybertrucks to customers at an event livestreamed on X, Tesla CEO Elon Musk's social media network. A demo video featured shots of the Cybertruck negotiating barren wildernesses, including one that was meant to look like Mars. Musk, who has mostly made headlines in recent weeks for <a href=\"https://arstechnica.com/tech-policy/2023/11/elon-musk-on-x-antisemitism-controversy-dont-advertise-go-f-yourself/\">endorsing virulent antisemitic theories on his social media platform</a>, took to the stage almost half an hour late, initially delivering his presentation from the back of a truck with his face hidden in shadow.</p>\n<p>Musk claimed the Cybertruck is better than any other truck but also more of a sports car than any other sports car, made of a \"special Tesla designed steel alloy\" that he claimed will never rust and which cannot be stamped but which can also be produced in volume.</p>\n<p>Mindful of the window-breaking debacle during <a href=\"https://arstechnica.com/cars/2019/11/tesla-wants-to-reinvent-the-pickup-with-the-39900-cybertruck/\">the truck's debut in 2019</a>, Tesla designer Franz von Holzhausen came on stage to throw baseballs at its windows. Unlike last time (when presenters used metal balls), the allegedly bulletproof glass did not shatter. Musk implied that in a crash with another vehicle, the Cybertruck—which weighs 6,603–6,843 lbs (2,995–3,104 kg)—will destroy the other vehicle.</p></div><p><a href=\"https://arstechnica.com/?p=1987661#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1987661&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"493a89f6484c9770cb114fa0d9626f8b768dbebff7759f10348285e133f25006","category":"Tech"}