{"title":"501 The effect of dietary camelina, flaxseed, and canola oil supplementation on skin fatty acid profile, inflammation and immune responses in healthy adult horses","link":"https://academic.oup.com/jas/article/102/Supplement_3/137/7757280?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>As n-6 and n-3 fatty acids (FA) have pro- and anti-inflammatory effects, respectively, supplemental oils have the potential to impact inflammation, the immune response, and skin and coat health. This study aimed to evaluate the effects of camelina (CAM), in comparison to canola (OLA) and flaxseed (FLX) oil on the skin FA profile, inflammation, and the immune response in horses. Horses [n = 24; 14.2 ± 4.8 yr; 518 ± 63 kg body weight (BW)] were acclimated to sunflower oil over 4 wk. Groups were balanced by location, age, weight, sex, and breed and randomly assigned one of the three treatments (CAM, OLA, FLX). Horses were fed their assigned oil at a dose of 0.37 g/kg BW for 16 wk. Skin samples were collected on wk 16, and the skin FA composition was analyzed by gas chromatography. On wk 10 and 12, keyhole limpet hemocyanin (KLH) was administered intramuscularly to each horse to stimulate a systemic immune response. Blood was collected on wk 14 and 16 for the evaluation of plasma KLH immunoglobulin G (IgG) concentrations using a modified ELISA protocol and results were presented as optical density units. On wk 12, after the first KLH injection, a delayed-type hypersensitivity (DTH) test was performed by intradermally injecting KLH and the area of swelling was measured using the software ImageJ at 0.5-, 1-, 8-, 24-, 48-, 72-, and 96-h post-injection. Data were analyzed using the GLIMMIX procedure of SAS considering the effects of treatment, time, and their interaction as fixed, and the effects of horse and location as random. Repeated measures on horses were modelled using a spatial power covariance structure. Significance was declared at <span>P</span> ≤ 0.05 and when fixed effects were significant, means were separated using Tukey-Kramer adjustments. Immune and inflammatory responses were produced by the KLH injections; however, there were no differences among treatment groups regarding KLH antibody and DTH response (<span>P</span> &gt; 0.44). The percentages of palmitic (<span>P</span> = 0.02) and stearic acid (<span>P</span> = 0.03) in the skin at wk 16 were greater in FLX as compared with CAM but neither differed from the OLA. The percentage of linoleic acid (<span>P</span> = 0.01) was greater in CAM than OLA but neither differed from FLX at wk 16. The percentage of all other FA was similar among treatment groups (<span>P</span> &gt; 0.06). These results suggest that CAM is comparable to FLX and OLA regarding support of an immune and inflammatory response, and the oil FA composition was not reflected in the skin FA profile after feeding for 16 wk as hypothesized. In conclusion, at the dose provided, CAM supports a similar immune and inflammatory response to KLH as FLX and OLA; however, the lack of incorporation of FA from the diet into the skin should be further explored.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"493b536d57badbfe6dc9818db7346b1a1569b24f577869901dec02f090ebafd9","category":"Environment"}