{"title":"A Demand-Side Response Optimization Method for Flexible Loads Considering the Benefits of Peak-to-Valley Smoothing","link":"https://www.preprints.org/manuscript/202403.0623/v1","date":1710160310000,"content":"To satisfy the interests of multiple agents and those of comprehensive indicators such as peak-to-valley differences and load fluctuations occurring on the network side, this paper presents a flexible load demand-side response optimization method that considers the benefits of peak-to-valley smoothing. First, load aggregation modelling of air conditioning and electric vehicles was conducted, and the complementarity of the power consumption behaviour of different types of flexible loads was used to improve the responsiveness of the load aggregator. Second, considering demand-side responses and taking into account the interests of both supply and demand, the load fluctuation and peak-to-valley difference on the network side are reduced, and a flexible load double-layer optimization model incorporating the peak-to-valley smoothing benefit is established. Finally, the effectiveness of the proposed optimization model is verified by using the KKT condition and the big M method to evaluate this two-layer optimization problem as a single-layer optimization problem. Comparative examples demonstrate that the proposed two-layer optimization method can improve the revenue of the distribution network operators and the load aggregators by using the complementary nature of the load response characteristics of electric vehicles and air conditioners. Moreover, the proposed method can effectively reduce the load peak-to-valley difference and load fluctuation of the distribution network by introducing the peak-to-valley smoothing benefit model.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"494700ef9887f3b4b5ef7e2a80faf83dfb51036292cd0b771b1ba2f2dc5cb24b","category":"Interdisciplinary"}