{"title":"Application of synthesized metal-trimesic acid frameworks for the remediation of a multi-metal polluted soil and investigation of quinoa responses","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310054","date":1725631200000,"content":"<p>by Amir Zarrabi, Reza Ghasemi-Fasaei, Abdolmajid Ronaghi, Sedigheh Zeinali, Sedigheh Safarzadeh</p>\r\n\r\nMetal-organic frameworks (MOFs) are structures with high surface area that can be used to remove heavy metals (HMs) efficiently from the environment. The effect of MOFs on HMs removal from contaminated soils has not been already investigated. Monometallic MOFs are easier to synthesize with high efficiency, and it is also important to compare their structures. In the present study, Zn-BTC, Cu-BTC, and Fe-BTC as three metal-trimesic acid MOFs were synthesized from the combination of zinc (Zn), copper (Cu), and iron (Fe) nitrates with benzene-1,3,5-tricarboxylic acid (H<sub>3</sub>BTC) by solvothermal method. BET analysis showed that the specific surface areas of the Zn-BTC, Cu-BTC, and Fe-BTC were 502.63, 768.39 and 92.4 m<sup>2</sup>g<sup>-1</sup>, respectively. The synthesized MOFs were added at the rates of 0.5 and 1% by weight to the soils contaminated with 100 mgkg<sup>-1</sup> of Zn, nickel (Ni), lead (Pb), and cadmium (Cd). Then quinoa seeds were sown in the treated soils. According to the results, the uptakes of all four HMs by quinoa were the lowest in the Cu-BTC 1% treated pots and the lowest uptakes were observed for Pb in shoot and root (4.87 and 0.39, μgpot<sup>-1</sup>, respectively). The lowest concentration of metal extracted with EDTA in the post-harvest soils was for Pb (11.86 mgkg<sup>-1</sup>) in the Cu-BTC 1% treatment. The lowest metal pollution indices were observed after the application of Cu-BTC 1%, which were 20.29 and 11.53 for shoot and root, respectively. With equal molar ratios, highly porous and honeycomb-shaped structure, the most crystallized and the smallest constituent particle size (34.64 nm) were obtained only from the combination of Cu ions with H<sub>3</sub>BTC. The lowest porosity, crystallinity, and a semi-gel like feature was found for the Fe-BTC. The synthesized Cu-BTC showed the highest capacity of stabilizing HMs, especially Pb in the soil compared to the Zn-BTC and the Fe-BTC. The highly porous characteristic of the Cu-BTC can make the application of this MOF as a suitable environmental solution for the remediation of high Pb-contaminated soils.","author":"Amir Zarrabi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4961a099fcce9e780767a85296bd5daef712c1d147151ea7370a3106c31edb6d","category":"Interdisciplinary"}