{"title":"Optimizing coffee production: Increased floral visitation and bean quality at plantation edges with wild pollinators and natural vegetation","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14591?af=R","date":1709702618000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/81b0de04-ff51-49b1-b646-dc5e5eb03d14/jpe14591-toc-0001-m.png\" alt=\"Optimizing coffee production: Increased floral visitation and bean quality at plantation edges with wild pollinators and natural vegetation\" />\n<p>Our study emphasises the key role of pollinators in coffee production and their impact on fruit and seed characteristics. Bee visits were more frequent in border areas, emphasising their reliance on natural nesting sites. Bee-mediated pollination positively affected fruit traits and self-pollinated fruits in plantation borders had reduced mass. Solitary bee nesting was primarily observed in native vegetation, underlining its importance for bee populations. Pollen composition in nests varied with proximity to coffee plantations, indicating landscape vegetation influences pollinator foraging. These findings support optimising coffee plantation design by preserving native vegetation to increase coffee yields and conserve biodiversity.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAnimal pollination is important for more than 75% of agricultural crops, including coffee, whose productivity can increase with adequate pollination. Bees, including many solitary species, are diverse pollinators, with around 85% of them considered more effective than honeybees in pollen transfer. We assessed the coffee plantation and its surrounding vegetation for solitary bee nesting throughout the coffee flowering season and measured their impact on coffee productivity.\n\nWe installed collection stations with trap nests inside a coffee plantation, on the border and inside the native vegetation in a farm in Diamantina, MG, Brazil. We used 10 weekly monitored replicates at least 1 km apart. We evaluated fruiting by autogamy in relation to natural pollination and used the increase in fruit set from pollinators to calculate the farmer's monetary gain. We recorded bee visits to the exposed flowers during coffee flowering considering both on the edge and inside the coffee plantation. Ripe fruits were dried, counted and weighed.\n\nWe discovered 132 solitary bee nests outside the plantation, with 54% containing coffee pollen grains, indicating coffee as an essential resource for bees even outside the crop area. More bee visits occurred at the coffee plantation's edge, resulting in increased fruit production, denser fruits, and rounder fruits in that area. Bagged flowers produced consistent seeds in all locations. The farmer could earn an extra US$1736.37 per hectare if the entire area received the same level of pollination contribution from bees as observed at the coffee border.\n\n<i>Synthesis and applications</i>. Our study emphasises the key role of pollinators in coffee production and their impact on fruit and seed characteristics. Bee visits were more frequent on border areas, emphasising their reliance on natural nesting sites. Bee-mediated pollination positively affected fruit traits and self-pollinated fruits in plantation borders had reduced mass. Solitary bee nesting was primarily observed in native vegetation, underlining its importance for bee populations. Pollen composition in nests varied with proximity to coffee plantations, indicating landscape vegetation influences pollinator foraging. These findings support optimising coffee plantation design by preserving native vegetation to increase coffee yields and conserve biodiversity.\n</p>\n<h2>Resumo</h2>\n<p>\n\nA polinização animal é importante para mais de 75% dos cultivos agrícolas, incluindo o café, cuja produtividade pode aumentar com a polinização adequada. As abelhas são um grupo muito diverso de polinizadores, dos quais cerca de 85% são espécies solitárias recorrentemente destacadas como mais eficazes que as abelhas melíferas na transferência de pólen nos cultivos. Aqui avaliamos a adequabilidade de uma plantação de café e seu entorno para a colonização de nidificação de abelhas solitárias antes, durante e após a floração do café. Também medimos a participação efetiva das abelhas na produtividade do café.\n\nInstalamos estações de coleta com ninhos armadilha no interior do cafezal, na borda e no interior da vegetação nativa em uma fazenda em Diamantina, em Minas Gerais, Brasil. Utilizamos 10 repetições a pelo menos 1 km de distância, as quais monitoradas semanalmente. Além disso, avaliamos a frutificação por autogamia (exclusão de polinizadores) em relação a polinização natural (flores expostas) e utilizamos o aumento na produção de frutos dos polinizadores para calcular o ganho monetário do agricultor. Durante a floração do café, todas as visitas realizadas pelas abelhas às flores expostas, tanto na borda quanto no interior do cafezal, foram observadas e contadas. Os frutos maduros foram secos, contados, pesados, medidos e tiveram sua densidade calculada.\n\nUm total de 132 ninhos de abelhas solitárias foram encontrados fora da plantação de café, dos quais 54% continham grãos de pólen de café, revelando que o café é um recurso importante para essas abelhas, embora suas colônias estejam localizadas fora da área de plantação. Foram observadas mais visitas de abelhas na borda do cafezal do que em seu interior, o que levou a uma maior frutificação e frutos mais densos e redondos nesta parte do cafezal. Flores ensacadas produziram sementes semelhantes em todos os locais. O agricultor ganhará um adicional de US$1.736,37 por hectare se toda a área receber a mesma contribuição de polinização das abelhas que ocorre na borda do cafezal.\n\n<i>Síntese e aplicações</i>. Nosso estudo destaca o papel vital dos polinizadores na produção de café e seu impacto nas características dos frutos e sementes. As visitas de abelhas foram significativamente mais frequentes nas áreas de borda, destacando a sua dependência de áreas naturais para a nidificação. A polinização mediada por abelhas afetou positivamente a massa, redondeza e densidade dos frutos, com frutos autopolinizados nas bordas do cafezal apresentando massa reduzida. A nidificação de abelhas solitárias foi observada principalmente na vegetação nativa, ressaltando sua importância no apoio às populações de abelhas. A composição polínica nos ninhos variou com a proximidade das plantações de café, indicando que a estrutura da vegetação da paisagem influencia o forrageamento dos polinizadores. Estas conclusões defendem uma abordagem para otimizar o desenho das plantações de café, preservando a vegetação nativa e criando habitats favoráveis aos polinizadores, especialmente em zonas fronteiriças, para aumentar a produtividade do café e, ao mesmo tempo, promover a conservação da biodiversidade.\n</p>","author":"Ana Carolina Pereira Machado, \nGudryan J. Baronio, \nCinthia Soares Novaes, \nJeff Ollerton, \nMarina Wolowski Torres, \nDanúbia Natalina Silva Lopes, \nAndré Rodrigo Rech","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"496300a4ba240aa80db492c75324cd2ca92b627de64ebcf9bf9c1ce69245d7b9","category":"Environment"}