{"title":"Ferulic Acid Inhibits Arsenic‐Induced Colon Injury by Improving Intestinal Barrier Function","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24360?af=R","date":1718604864000,"content":"<h2>ABSTRACT</h2>\n<p>The prolonged exposure to arsenic results in intestinal barrier dysfunction, which is strongly concerned with detrimental processes such as oxidative stress and the inflammatory response. Ferulic acid (FA), as a phenolic acid, possesses the capability to mitigate arsenic-induced liver damage and cardiotoxic effects dependent on inhibition of oxidative stress and inflammatory responses. FA can mitigate testicular tissue damage and alveolar epithelial dysfunction, the mechanism of which may rely on nuclear factor erythroid 2-related factor 2/heme oxygenase 1 (Nrf2/HO-1) activation and nuclear factor-kappa B (NF-κB) pathway blocking. Based on the antioxidant and anti-inflammatory properties of FA, we speculated that FA might have the potential to inhibit arsenic-induced intestinal damage. To confirm this scientific hypothesis, mice exposed to sodium arsenite were treated with FA to observe colonic histopathology and TJ protein levels, and oxidative stress and TJ protein levels in Caco-2 cells exposed to sodium arsenite were assessed after FA intervention. In addition, molecular levels of NF-κB and Nrf2/HO-1 pathway in colon and Caco-2 cells were also detected. As shown in our data, FA inhibited arsenic-induced colon injury, which was reflected in the improvement of mucosal integrity, the decrease of down-regulated expression of tight junction (TJ) proteins (Claudin-1, Occludin, and ZO-1) and the inhibition of oxidative stress. Similarly, treatment with FA attenuated the inhibitory effect of arsenic on TJ protein expression in Caco-2 cells. In addition to suppressing the activation of NF-κB pathway, FA retrieved the activation of Nrf2/HO-1 pathway in colon and intestinal epithelial cells induced by arsenic. In summary, our findings propose that FA has the potential to mitigate arsenic-induced intestinal damage by preserving the integrity of intestinal epithelial TJs and suppressing oxidative stress. These results lay the groundwork for the potential use of FA in treating colon injuries caused by arsenic.</p>","author":"Shumin Wang, \nYan Hong, \nYuxiu Li, \nZhenfen Zhang, \nJing Han, \nZhe Yang, \nYanping Yang, \nZhaolei Ma, \nQi Wang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"4966ab6f29c6c9f0f8b56de5f3cd029d466c929b7afc5b724de92096b96a22e1","category":"Environment"}