{"title":"อินเทลประกาศแผนเทคโนโลยีการผลิต เปลี่ยนชื่อเป็น Intel 7, Intel 4, Intel 3 เตรียมเข้าสู่ยุคอังสตรอม","link":"https://www.blognone.com/node/123907","date":1627357336000,"content":"<div><div><div><p>อินเทลแถลงข่าวประกาศแผนการพัฒนาเทคโนโลยีการผลิต เปลี่ยนชื่อเทคโนโลยีการผลิตให้กลายเป็นแบรนด์อินเทลแทนเลขนาโนเมตรเช่นเดิม และภาพใหญ่ที่สุดคือการเตรียมพร้อมสู่เทคโนโลยีระดับอังสตรอม โดยเทคโนโลยีที่ประกาศออกมาแล้วได้แก่</p>\n<ul>\n<li><strong>Intel 7</strong> จะใช้งานในซีพียูเดสก์ทอป Alder Lake ที่จะเปิดตัวในปลายปี 2021 นี้ และซีพียูเซิร์ฟเวอร์ Sapphire Rapids ที่จะเริ่มผลิตปี 2022</li>\n<li><strong>Intel 4</strong> ใช้เทคโนโลยี EUV และคาดว่าประสิทธิภาพต่อพลังงานจะเพิ่มขึ้นประมาณ 20% โดยจะพร้อมผลิตปลายปี 2022 และเริ่มส่งมอบสินค้าจริงปี 2023 จะใช้งานกับซีพียู Meteor Lake สำหรับไคลเอนต์ และ Granite Rapids สำหรับเซิร์ฟเวอร์</li>\n<li><strong>Intel 3</strong> ใช้เทคโนโลยี FinFET รวมกับ EUV ทำให้ประสิทธิภาพต่อพลังงานเพิ่มขึ้นจาก Intel 4 ไปอีกประมาณ 18% คาดว่าจะเพิ่มเดินสายการผลิตได้ปลายปี 2023</li>\n<li><strong>Intel 20A</strong> เทคโนโลยีระดับอังสตรอมตัวแรก เปลี่ยนเทคทรานซิสเตอร์ให้เป็นแบบ RibbonFET นับเป็นการเปลี่ยนใหญ่ครั้งแรกนับจากที่อินเทลใช้ FinFET ตั้งแต่ปี 2011 และ PowerVia เทคโนโลยีการจ่ายพลังงานด้านหลังเวเฟอร์ คาดว่าจะผลิตได้จริงปี 2024</li>\n<li><strong>Intel 18A</strong> เทคโนโลยียุคต่อไปที่อยู่ระหว่างการพัฒนาร่วมกับ ASML ผู้ผลิตเครื่องจักรผลิตชิป โดยใช้เทคโนโลยี High NA EUV</li>\n</ul>\n<p>สำหรับเทคโนโลยี Intel 20A นั้น Qualcomm ประกาศแล้วว่าจะมาใช้โรงงานผลิตชิปด้วย ตามแนวทางของ <a href=\"https://www.blognone.com/node/121850\">Pat Gelsinger ซีอีโอใหม่ที่เริ่มรับผลิตชิปให้กับบริษัทภายนอก</a></p>\n<p>ที่มา - <a href=\"https://www.intel.com/content/www/us/en/newsroom/news/intel-accelerates-process-packaging-innovations.html\">Intel</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fdf1dc7b3a3568f0cbb9782d960628db.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/intel\">Intel</a></div><div><a href=\"/topics/semiconductor\">Semiconductor</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"496c32cfbae15866eadbe580fd5238b4b39439584c5c71608f711f86382403b5","category":"Thai"}