{"title":"Psychometric validity of the sum score of the Sniffin’ Sticks-Extended Test","link":"https://academic.oup.com/chemse/article/doi/10.1093/chemse/bjae032/7746505?rss=1","date":1725062400000,"content":"<span><div>Abstract</div>A common tool to measure olfactory function is the Sniffin’ Sticks Test extended version (SSET). The SSET evaluates olfactory ability by summing the scores of three subtests: Threshold, Discrimination, and Identification. Recent meta-scientific literature revealed that many psychometric instruments currently in use have not been adequately validated, leading to a measurement crisis that raises concerns about the validity of the conclusions drawn with these instruments. Two examples of the measurement crisis are (i) the use of sum scores without testing their assumptions (e.g. unidimensionality and tau-equivalence), which indicate that all subtests have the same, stable relationship with their underlying construct, and (ii) the lack of assessment of measurement invariance across groups. Here, we aim to investigate the unidimensionality and tau-equivalence assumptions, internal consistency, and measurement invariance of sex and age groups of the SSET. We tested 988 (555 females, mean ± SD: 39.75 ± 18.60 years) participants with the Italian version of the SSET. The tau-equivalent model demonstrated excellent fit indices (CFI robust = 1, TLI robust = 1, RMSEA robust = 0, SRMR = 0.013), which best explain the data, indicating that all subtests are equally important in measuring olfactory function, but not necessarily equally precise. The results also revealed full measurement invariance across age groups and configural, partial metric, and scalar invariance across sexes, indicating that the use of latent means to compare sex groups should be chosen over raw scores. However, the SSET demonstrated moderate internal consistency. Future studies should clarify whether the reliability of the SSET can be increased.</span>","author":"","siteTitle":"Chemical Senses Current Issue","siteHash":"eaf999c97f18ab6d9732972032217d08ae5a0287f7a7d719a702f9f5727afa53","entryHash":"4973be4a9337a1ed375161b349e2b52b8397d4b81c9c0790397b990f6485be24","category":"Environment"}