{"title":"The Potential Challenges and Limitations of Implementing Modern Office Design Features in Residential Spaces: A SPAR-4-SLR Approach","link":"https://www.preprints.org/manuscript/202409.0255/v1","date":1725399294000,"content":"The COVID-19 pandemic has significantly altered how people work, with an increasing number transitioning to working-from-home (WFH). This paradigm shift has raised various challenges in adapting living spaces to meet the needs of remote work. Dedicated workspaces or home offices need to be customised for creativity and productivity. Thus, this systematic literature review explores the potential challenges and limitations of implementing modern office design features in residential environments. The study synthesises findings from 108 peer-reviewed articles published within the last decade, focusing on ergonomics, productivity, work-life balance, and spatial constraints. The study found several challenges in translating office design features to home settings. Firstly, spatial limitations in residential areas often restrict the implementation of open-plan layouts and collaborative zones, which are hallmarks of modern office designs. Secondly, the integration of ergonomic furniture and adjustable workstations are limited by budget constraints and the dual-purpose nature of many home spaces. Furthermore, the review highlights the psychological challenges of maintaining work-life boundaries when professional and personal spaces overlap. Noise pollution and distractions emerge as significant factors impacting productivity in home offices, which contrasts controlled modern office environments. The review suggests that the complete replication of modern office design in homes may be impractical, a hybrid approach that adapts key features to residential constraints could enhance home office productivity. Potential solutions could include modular furniture designs, the simulation of collaborative spaces, and the development of noise-cancelling technologies specifically for home environments. This study contributes to the growing body of knowledge on remote work environments and provides valuable insights for enhancing work-life balance, environmental sustainability, and economic growth.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"49760ccf8980afbf86c2a357bebe0693e3eb94e184ec915cf6a01e7c7d3d9fa8","category":"Interdisciplinary"}