{"title":"บัตรเครดิต ttb ผนึก Google Pay และ Visa เปิดฟีเจอร์ชำระเงินยุคดิจิทัล แตะจ่ายไร้สัมผัสผ่านสมาร์ทโฟนแอนดรอยด์ พร้อมรับเครดิตเงินคืนสูงสุด 1,200 บาท","link":"https://www.blognone.com/node/138193","date":1707991200000,"content":"<div><div><div><p>ทีทีบี เดินหน้าสร้างชีวิตทางการเงินที่ดีขึ้นรอบด้านให้กับผู้ถือบัตรเครดิต ttb อย่างต่อเนื่อง ล่าสุดจับมือ Google ผู้ให้บริการ Google Pay ระบบรับชำระเงินออนไลน์ และ Visa ขยายฟีเจอร์ชำระเงินแบบไร้สัมผัสด้วยสมาร์ทโฟน แตะง่าย จ่ายเร็ว สะดวก ปลอดภัย ไม่ต้องพกบัตร พร้อมมอบเครดิตเงินคืนเพิ่มสูงสุด 1,200 บาท ให้ผู้ถือบัตร ttb ที่ผูกบัตรใช้จ่ายตั้งแต่วันนี้ ถึง 30 เมษายน 2567</p>\n<p><img alt=\"alt=&quot;ttb x Google Pay x Visa&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/3b7988d755db40d2d4e56eb34661c0ec.jpeg\" /></p>\n<p><strong>นางสาวนันทพร ตั้งเจริญศิริ รองประธานเจ้าหน้าที่บริหาร หัวหน้าบริหารความสัมพันธ์และประสบการณ์ลูกค้าบุคคล ทีเอ็มบีธนชาต</strong> เปิดเผยว่า ทีทีบี มุ่งมั่นพัฒนาโซลูชันการเงินอย่างไม่หยุดยั้งเพื่อส่งมอบประสบการณ์การเงินที่ดีที่สุดให้กับลูกค้าทุกกลุ่ม  ทุกไลฟ์สไตล์การใช้ชีวิต โดยเฉพาะยุคดิจิทัลที่คนรุ่นใหม่มีพฤติกรรมการจับจ่ายที่ชื่นชอบความสะดวกสบาย ทันสมัย แต่ยังมีความปลอดภัยสูงสุด ทีทีบี จึงร่วมกับ Google และ Visa พลิกโฉมการชำระเงินซื้อสินค้าหรือบริการออนไลน์  ด้วยการชำระเงินรูปแบบใหม่ผ่านสมาร์ทโฟนระบบปฏิบัติการแอนดรอยด์ที่ผูกบัตรเครดิต ttb กับแอปพลิเคชัน Google wallet เพื่อยกระดับชีวิตทางการเงินของผู้ถือบัตรให้สะดวกสบาย รวดเร็วและปลอดภัย ไม่ต้องพกบัตรเครดิต เพียงผูกการใช้จ่ายด้วยบัตรเครดิต บนแพลตฟอร์มที่เป็นกระเป๋าเงินดิจิทัล และใช้การแตะจ่ายด้วยสมาร์ทโฟน แท็บเล็ต หรือนาฬิกาแอนดรอยด์แทนการหยิบสัมผัสบัตร ปลอดภัยจากการโจรกรรมข้อมูลบนหน้าบัตร อิสระในการใช้จ่ายทั้งช่องทางออฟไลน์และออนไลน์ โดยสามารถใช้บริการได้ตั้งแต่วันที่ 15 กุมภาพันธ์ 2567</p>\n<p><strong>นายกิตติพงษ์ หยู Finance Industry Lead Google ประเทศไทย</strong> กล่าวว่า จากรายงานเศรษฐกิจดิจิทัลเอเชียตะวันออกเฉียงใต้ในปี 2023 พบว่าการชำระเงินแบบดิจิทัลได้รับความนิยมเพิ่มขึ้น รวมถึงความนิยมชำระเงินผ่านโทรศัพท์มือถือของคนไทย จะส่งผลให้มูลค่าธุรกรรมรวมของการชำระเงินแบบดิจิทัลในประเทศไทยสูงถึง 1.76 แสนล้านดอลลาร์สหรัฐในปี 2025 ซึ่งการร่วมมือกันในครั้งนี้ของ Google และทีทีบี จะเป็นทางเลือกใหม่ให้กับผู้ถือบัตรเครดิต ttb สามารถใช้บริการชำระเงินผ่านบัตรบนสมาร์ทโฟนระบบแอนดรอยด์ได้อย่างสะดวกสบายและปลอดภัยยิ่งกว่าเดิม ช่วยลดโอกาสการโจรกรรมด้วยระบบสแกนลายนิ้วมือ สแกนใบหน้า หรือการตั้งค่าด้วยรหัส PIN ในการชำระเงิน โดยผู้ถือบัตรสามารถดาวน์โหลดแอป Google Wallet ได้จาก Google Play Store และเพิ่มบัตรเครดิต ttb ใน Google Wallet เพื่อแตะจ่าย ชำระเงินแบบไร้สัมผัสได้อย่างง่ายและรวดเร็วด้วย Google Pay ทุกจุดบริการที่มีสัญลักษณ์ Contactless</p>\n<p><strong>นายสมหวัง เหลืองไพบูลย์ศรี Head of Products &amp; Solutions วีซ่า</strong>  กล่าวว่า ด้วยการพัฒนาของเทคโนโลยีและนวัตกรรมด้านการชำระเงิน จึงเป็นเรื่องสำคัญที่ทาง Visa ร่วมมือกับพันธมิตรเพื่อสร้างสรรค์นวัตกรรมการชำระเงินที่ตอบโจทย์ความต้องการของผู้บริโภคยุคใหม่ที่ลดการใช้เงินสด เน้นความสะดวก รวดเร็วและปลอดภัยผ่านการชำระเงินแบบดิจิทัล ซึ่งสอดคล้องกับผลการศึกษาของ Visa เรื่องทัศนคติการชำระเงินของผู้บริโภคที่พบว่า มากกว่าครึ่งของผู้บริโภคชาวไทย หรือ คิดเป็น 55% ถือเงินสดน้อยลงเมื่อเทียบกับปีก่อนหน้า และกว่า 92% มีความสนใจที่จะชำระเงินในรูปแบบไร้สัมผัส (Contactless) ซึ่งผู้ถือบัตรเครดิต Visa ที่ออกโดย  ทีทีบี  สามารถใช้จ่ายกับร้านค้าหรือผู้ให้บริการต่าง  ๆ ได้อย่างสะดวก รวดเร็วและปลอดภัยผ่าน Google Wallet ที่ติดตั้งบนอุปกรณ์ที่รองรับระบบปฏิบัติการ Android และ WearOS ในสมาร์ทวอทช์ และอุปกรณ์พกพาในระบบปฏิบัติการแอนดรอยด์</p>\n<p>ในโอกาสเปิดตัวฟีเจอร์ใหม่ของบัตรเครดิต ttb ในครั้งนี้  ผู้ถือบัตรเครดิต ttb ที่ลงทะเบียนผูกบัตรกับระบบ Google Pay และทำธุรกรรมชำระเงินผ่านระบบ Google Pay ระหว่างวันที่ 15 กุมภาพันธ์ 2567 – 30 เมษายน 2567 ใช้จ่ายสะสมทุก 1,000 บาท จะได้รับเครดิตเงินคืน 100 บาท สูงสุด 1,200 บาท ตลอดแคมเปญ และในอนาคตจะยังคงมอบสิทธิพิเศษอื่น  ๆ เพิ่มเติมให้กับผู้ถือบัตร ttb อย่างต่อเนื่อง เพื่อสนับสนุนให้ผู้ถือบัตรหันมาใช้จ่ายในรูปแบบไร้สัมผัสมากขึ้น</p>\n<p><strong>รายละเอียดเพิ่มเติม <a href=\"https://www.ttbbank.com/creditcard/gpay-bn\">https://www.ttbbank.com/creditcard/gpay-bn</a></strong></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ttb\">TTB</a></div><div><a href=\"/topics/bank\">Bank</a></div><div><a href=\"/topics/ttbbank\">ttbbank</a></div><div><a href=\"/topics/tmbthanachart\">TMBThanachart</a></div><div><a href=\"/topics/ttbcreditcard\">ttbcreditcard</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"49795d295855bad291c9afa363a6e212043dc15ccacfe7c6857784f1636a4e14","category":"Thai"}