{"title":"Color Mechanics In UI Kits","link":"https://smashingmagazine.com/2023/04/color-mechanics-ui-kits/","date":1681934400000,"content":"<p>I am currently working on research linked to a project on creating a complete guide to <strong>developing a UI kit as a technical system</strong>. In the first stage, I collected technical decisions, requirements, and possible solutions by analyzing open-source and proprietary UI kits. My initial plan was to to dive deep into every detail after collecting the main decisions that were made in dozens of such UI kits.</p>\n<p>At my main workplace, an open-source UI kit is used under the hood. I soon noticed that it was difficult to understand its API when it came to anything related to colors.</p>\n<p>I had many questions:</p>\n<ul>\n<li>Which tasks does the kit’s API solve? </li>\n<li>Which concepts does its API implement?</li>\n<li>How is the API implemented?</li>\n<li>What should I know before starting to implement such mechanics in a UI kit from scratch? </li>\n<li>What are the best practices?</li>\n</ul>\n<p>I decided to temporarily interrupt my data collection and dive deep into this topic. In this article, I want to share some things that I’ve learned. I suppose that I’m not the only one who has such questions, and this article’s goal is to answer these questions to save you time. It will also help me not to burn out and to continue my research work.</p>\n<p>How to deal with colors is one of many technical decisions. It incorporates many subdecisions and relates to other decisions, such as:</p>\n<ul>\n<li>How to implement theme switching — according to user action or the OS setting?</li>\n<li>How to provide theme configuration for different system levels?</li>\n<li>How to automatically make a color palette?</li>\n<li>How to implement color-contrast checking?</li>\n<li>How to support different contrast models? (<a href=\"https://adrianroselli.com/2017/11/os-high-contrast-versus-inverted-colors.html\">Windows has high-contrast mode, whereas macOS has inverted colors</a>.)</li>\n</ul>\n<p>In the article, I’ll cover two parts. First, we’ll look at <strong>base operations</strong>, which include the definition and use of colors and known issues and practices related to color. Secondly, we’ll look into an <strong>approach to solving tasks</strong> by analyzing existing solutions and understanding the connections between them.</p>\n<p>Some code examples will contain Sass and TypeScript, but these aren’t the focus of this article. You will hopefully come to understand a model that you can implement with the tools of your choice.</p>\n<p>Also, I’d like to warn you against trying to create your own UI kit. The subdecisions that I mentioned aren’t done consciously. You will see that even implementing a small part of a kit, such as the definition and use of colors, is not as easy as it seems at first glance. Can you imagine the complexity of developing an entire system?</p>\n<p>As reference examples, we will use <a href=\"https://mui.com/material-ui/customization/color/\">Material UI</a> and <a href=\"https://fluentsite.z22.web.core.windows.net/\">Fluent UI React Northstar</a>.</p>\n<p>Why them?</p>\n<p>As for <strong>Material UI</strong>: </p>\n<ul>\n<li>It contains a lot of best practices (I have compared it with others).</li>\n<li>It’s one of the most popular UI kits in open-source software (at least according to the GitHub stars).</li>\n<li>I have a lot of experience in using and <a href=\"https://github.com/mui/material-ui/issues/20852#issuecomment-1239306709\">customizing</a> it.</li>\n</ul>\n<p>As for <strong>Fluent UI React Northstar</strong>:</p>\n<ul>\n<li>It contains a lot of best practices (I’ve also compared it with others);</li>\n<li>It’s used in large-scale enterprise projects.</li>\n<li>It contains new concepts that simplify the public API and implementation based on previous experience developing UI kits (see the <a href=\"https://github.com/layershifter/office-ui-fabric-react\">Fluent UI Web readme</a>).</li>\n</ul>\n<p>As a bonus, you will understand how to use the APIs of these UI kits.</p>\n<p>To achieve the article’s goals, we will follow a few steps:</p>\n<ol>\n  <li>Consider which tasks are required to be solved.</li>\n  <li>Define the terms and their meaning. Without a common language, it would be hard for us to understand each other.<br />\n\n<blockquote>“A project faces serious problems when its language is fractured. Domain experts use their jargon, while technical team members have their own language tuned for discussing the domain in terms of design.<br /><br />The terminology of day-to-day discussions is disconnected from the terminology embedded in the code (ultimately the most important product of a software project). And even the same person uses different language in speech and in writing so that the most incisive expressions of the domain often emerge in a transient form that is never captured in the code or even in writing.<br /><br /><strong>Translation blunts communication and makes knowledge crunching anemic.</strong>”<br /><br />— <em>Domain-Driven Design Tackling Complexity in the Heart of Software</em>, Eric Evans, Addison-Wesley, 2004</blockquote>\n</li>\n<li>Consider problems we might encounter and how to solve them.</li>\n<li>Illustrate solutions by considering the implementation of reference UI kits.</li>\n<li>Follow the example of the best reference.</li>\n</ol>\n\n<p>Let’s dive in!</p>\nColors Mechanics Model\n<h3>Terminology</h3>\n<p>Let’s say that our ultimate goal is to provide the ability to switch themes. In this case, the following concepts come into play:</p>\n<ul>\n<li><strong>Color, hue</strong><br />This refers to the type of color (red, blue, and so on). The term we’ll use in this article is “color”.</li>\n<li><strong>Color shade, color gradient, color variant, color tone</strong><br />Color may be determined by hue, brightness, and saturation. The term we’ll use in this article is “color variant”.</li>\n</ul>\n<blockquote>“One important detail about Munsell’s color system is that he divided the color space into three new dimensions: The hue determined the type of color (red, blue, and so on), the value determined the brightness of the color (light or dark), and the chroma determined the saturation of the color (the purity of the color). These dimensions are still used to this day in some representations of the RGB color model.”<br /><br />— “<a href=\"https://programmingdesignsystems.com/color/a-short-history-of-color-theory/index.html#a-short-history-of-color-theory-xZzRFOZ\">A Short History of Color Theory</a>”, from <em>Programming Design Systems</em></blockquote>\n\n<ul>\n<li><strong>Color palette</strong><br />This is a set of variants of color. We’ll refer to it in this article as “color palette”.</li>\n<li><strong>Design tokens</strong><br />These are general component property names from a design point of view. The term we’ll use in this article is “visual properties”. For example:<ul>\n<li>border,</li>\n<li>text,</li>\n<li>background.</li>\n</ul>\n</li>\n<li><strong>Color scheme, theme, color theme</strong><br />A color scheme is created to impose some constraints. The term we’ll use in this article is “color scheme” because “theme” is more general than “color scheme” (encompassing font size and so on). For example, a color scheme might:<ul>\n<li>contain only variants of the color pink,</li>\n<li>be tailored to light or dark illumination of the space around the device,</li>\n<li>be tailored to people with vision impairment,</li>\n<li>be tailored to specific device constraints.</li>\n</ul>\n</li>\n</ul>\n<h3>Producing Operations With Color</h3>\n<p>We’ll consider basic operations such as defining and using color. </p>\n<p>Color is defined according to various color model notations (RGB, HSL, etc.).</p>\n<p>In the case of development of a digital user interface, a color scheme is created to color UI components. Each UI component might have a different color for its various properties in each scheme. For example, the background color of a call-to-action button might be red or blue depending on the current theme.</p>\n<p>So, how can colors be represented?</p>\n<h4>How to Name Variables?</h4>\n<p>If you just name variables according to their color, you will get into a situation where a variable named <code>redColor</code> should have a blue color value in another scheme.</p>\n<p>Also, the components that show an error state should still be able to use the red color from the <code>redColor</code> variable. So, another layer of abstraction needs to be introduced to solve the problem.</p>\n<p>This additional layer organizes colors by their function (for example, error state) or visual property name (for example, background). It acts as a color scheme.</p>\n<p>It’s interesting that organization by function was already introduced to <a href=\"https://www.smashingmagazine.com/2021/09/simplifying-form-styles-accent-color/\">CSS properties</a>.</p>\n<p>Each value in the layer’s structure would be mapped to the color palette value by color name and color variant.</p>\n<h3>How To Remember Use Cases?</h3>\n<p>After adding colors to the layer, you might encounter a minor problem — how to remember their use cases:</p>\n<blockquote>I remember the very first time I tried Sass on a project. The first thing I wanted to do was variablize my colors. From my naming-things-in-HTML skillz, I knew to avoid classes like <code>.header-blue-left-bottom</code> because the color and position of that element might change. It’s better for them to reflect what it is than what it looks like.<br /><br />So, I tried to make my colors semantic, in a sense — what they represent, not what they literally are:<br /><br />\n<pre><code>$mainBrandColor: #F060D6;\n$secondaryFocus: #4C9FEB;\n$fadedHighlight: #F1F3F4;\n</code></pre>\nBut I found that I absolutely never remembered them and had to constantly refer to where I defined them in order to use them. Later, in a ‘screw it’ moment, I named colors more like…<br /><br />\n<pre><code>$orange: #F060D6;\n$red: #BB532E;\n$blue: #4C9FEB;\n\n$gray-1: #eee;\n$gray-2: #ccc;\n$gray-3: #555;\n</code></pre>\nI found that to be much more intuitive, with little, if any, negative side effects. After all, this isn’t crossing the HTML-CSS boundary here; this is all within CSS and developer-only-facing, which puts more of a narrow scope on the problem.”<br /><br />— Chris Coyier, “<a href=\"https://css-tricks.com/what-do-you-name-color-variables/\">What do you name color variables?</a>”</blockquote>\n\n<p>In the initial stage of the project, writing comments next to the variables might help. And creating a dictionary might help to communicate with a design team in subsequent stages.</p>\n<blockquote>“The use of dictionaries as a means to establish a common understanding of terms has already proved its benefits in various software-related fields. Literature on software project management <strong>recommends the usage of a project glossary or dictionary that contains a description of all terms used in a project</strong>. This glossary serves as a reference for project participants over the entire project life cycle.”<br /><br />— <em>Concise and Consistent Naming</em>, Florian Deissenboeck, Markus Pizka, 2006, Software Qual J</blockquote>\n\n<p>Now we understand why just using color names wouldn’t work. But it points to the solution for another minor problem: defining names for variants of a particular color.</p>\n<h3>How To Define Names For Color Variants?</h3>\n<p>The solution is simple. Just add numbers as suffixes to the names. The advantage of this approach is that adding a new color will be easy, and the suffix will tell you that the color is a variant of another color. But this is still hard to remember.</p>\n<pre><code>$gray-1: #eee;\n$gray-2: #ccc;\n$gray-3: #555;\n</code></pre>\n\n<p>Another approach is to give a unique name to each color. This approach is the least convenient because names wouldn’t have any useful information, and you would have to remember them. You would need to define the names or use a name generator, which is an unnecessary dependency.</p>\n<p>A better solution is suggested by Zain Adeel in his article “<a href=\"https://uxdesign.cc/my-struggle-with-colors-52156c664b87\">My Struggle With Colors</a>”:</p>\n<blockquote>Using a scale from 10–100 with a tone at each ten is by far the simplest. A purple-10 will understandably be the lighter tone in comparison to a purple-50. The familiarity of such an approach allows the system to grow predictably.</blockquote>\n\n<p>The approach provides maximum useful information by name. Also, it can cover more cases if a prefix is added. For example, the prefix “A” can denote an accent color. As explained <a href=\"https://mui.com/material-ui/customization/color/#2014-material-design-color-palettes\">in the Material UI documentation</a>:</p>\n<blockquote>A single color within the palette is made up of a hue, such as “red”, and shade, such as “500”. “red 50” is the lightest shade of red (pink!), while “red 900” is the darkest. In addition, most hues come with “accent” shades, prefixed with an A.</blockquote>\n\n<p>A disadvantage is that the cascade will change if you ever have to add an intermediate color with a brightness variant. For example, if you have to add a color between <code>gray-10</code> and <code>gray-20</code>, then you might replace <code>gray-20</code> and then have to adjust the following color values (<code>gray-30</code>, gray-40, and so on).</p>\n<p>Also, any solution comes with potential maintenance issues. For example, we would have to ensure that all color definitions have all possible variants in order to avoid a scenario where we have <code>gray-20</code> but not <code>red-20</code>.</p>\n<p>One approach to solving problems is <a href=\"https://material.io/design/color/the-color-system.html#color-usage-and-palettes\">Material Design’s color system</a>. One of the values of this guide is that it doesn’t contain details of technical implementation, but rather focuses on concepts containing only important information.</p>\nIllustrating Solutions\n<p>Let’s look at an implementation from top to bottom.</p>\n<h3>Fluent UI React Northstar (<code>@fluentui/react-northstar@0.63.1</code>)</h3>\n<h4>Color Scheme</h4>\n<p>Let’s consider the <a href=\"https://github.com/microsoft/fluentui/tree/dab45a2afe609709735b9b6e604a1af40d50e809/packages/fluentui/react-northstar/src/themes/teams\">“Teams” theme</a>. </p>\n<p>Fluent UI React Northstar has a two-dimensional color scheme model.</p>\n<p><img src=\"https://files.smashing.media/articles/color-mechanics-ui-kits/1-color-schemes.png\" /></p>\n<p>“Brand” is the color scheme. “Light theme,” “HC theme,” and “Dark theme” will also be color schemes in this article.</p>\n<p><strong>Grouping Approach</strong></p>\n<p>Color scheme object keys are visual properties combined with states.</p>\n<div>\n<pre><code>export const colorScheme: ColorSchemeMapping&lt;ColorScheme, TeamsColorNames&gt; = {\n  amethyst: createColorScheme({\n    background: colors.amethyst[600],\n    backgroundHover: colors.amethyst[700],\n    backgroundHover1: colors.amethyst[500],\n    backgroundActive: colors.amethyst[700],\n  }),\n};\n</code></pre>\n</div>\n\n<p><strong>Note</strong>: <a href=\"https://github.com/microsoft/fluentui/blob/dab45a2afe609709735b9b6e604a1af40d50e809/packages/fluentui/react-northstar/src/themes/teams/colors.ts#L214\">Check out the source code</a>.</p>\n<p>In the <a href=\"https://github.com/microsoft/fluentui/blob/dab45a2afe609709735b9b6e604a1af40d50e809/packages/fluentui/react-northstar/src/themes/teams/index.tsx#L13\"><code>siteVariables</code></a> key of the theme configuration, the colors palette is located in the <a href=\"https://github.com/microsoft/fluentui/blob/dab45a2afe609709735b9b6e604a1af40d50e809/packages/fluentui/react-northstar/src/themes/teams/siteVariables.ts#L8\"><code>colors</code> key</a>, and the color scheme is in the <a href=\"https://github.com/microsoft/fluentui/blob/dab45a2afe609709735b9b6e604a1af40d50e809/packages/fluentui/react-northstar/src/themes/teams/siteVariables.ts#L8\"><code>colorScheme</code></a> key. They are explicitly separated.</p>\n<h4>Color Palette</h4>\n<p>A color palette is an object. Interestingly, some color values are defined with transparency, and the palette contains colors named according to their function.</p>\n<pre><code>export const colors: ColorPalette&lt;TeamsTransparentColors&gt; = {\n  ...contextualAndNaturalColors,\n  ...primitiveColors,\n  ...transparentColors,\n};\n</code></pre>\n\n<p><strong>Note</strong>: <a href=\"https://github.com/microsoft/fluentui/blob/dab45a2afe609709735b9b6e604a1af40d50e809/packages/fluentui/react-northstar/src/themes/teams/colors.ts#L173\">Check out the source code</a>.</p>\n<blockquote>“Colors in Teams color palette have the following categorization.<br /><br /><strong>Primitive colors</strong><br /><br />This part of the palette contains colors that, semantically, cannot have any tints. This group is represented by two colors, black and white — as there is nothing blacker than black and nothing whiter than white.<br /><br />[...]<br /><br /><strong>Natural colors</strong><br /><br />This part of the palette includes colors from those that are the most commonly used among popular frameworks (blue, green, gray, orange, pink, purple, teal, red, yellow). Each color includes at least ten gradients; this allows us to satisfy the most common needs.<br /><br />This decision is experienced from Material UI and allows us to define more variants than by using semantical naming (lightest, lighter, etc.). However, there is no requirement for a client to define all the gradient values for each color — it is just enough to define those that are actually used in the app.<br /><br />[...]<br /><br /><strong>Contextual colors</strong><br /><br />This part of the palette may include brand color as well as danger, success, info colors, and so on.”<br /><br />— “<a href=\"https://fluentsite.z22.web.core.windows.net/0.63.1/colors#color-palette\">Colors</a>”, Fluent UI documentation</blockquote>\n\n<p>The value in the object’s key by color name may be an object containing keys such as a color variant or just a color string literal of a specific color model.</p>\n<pre><code>export const naturalColors: TeamsNaturalColors = {\n  orange: {\n    50: '#F9ECEA', // darkOrange[50]\n    100: '#EFDBD3', // app orange14\n    200: '#EDC2A7', // old message highlight border\n    300: '#E97548', // orange[900]\n    400: '#CC4A31', // app orange04 darkOrange[400]\n    500: '#BD432C', // app orange03\n    600: '#A33D2A', // app orange02\n    700: '#833122', // app orange01 darkOrange[900]\n    800: '#664134', // app orange14 dark\n    900: '#51332C', // app orange16 dark\n  },\n}\n</code></pre>\n\n<p><strong>Note</strong>: <a href=\"https://github.com/microsoft/fluentui/blob/dab45a2afe609709735b9b6e604a1af40d50e809/packages/fluentui/react-northstar/src/themes/teams/colors.ts#L54\">Check out the source code</a>.</p>\n<pre><code>export const primitiveColors: PrimitiveColors = {\n  black: ‘#000’,\n  white: ‘#fff’,\n};\n</code></pre>\n\n<p><strong>Note</strong>: <a href=\"https://github.com/microsoft/fluentui/blob/dab45a2afe609709735b9b6e604a1af40d50e809/packages/fluentui/react-northstar/src/themes/teams/colors.ts#L121\">Check out the source code</a>.</p>\n<h3>Material UI (<code>@mui/material@5.10.4</code>)</h3>\n<h4>Color Scheme</h4>\n<p>Material UI provides only dark and light color schemes as default schemes.</p>\n<p><strong>Grouping Approach</strong></p>\n<p>The <code>palette</code> key of the theme configuration contains the color scheme used in this article.</p>\n<p><img src=\"https://files.smashing.media/articles/color-mechanics-ui-kits/2-screen-default-scheme-explorer.png\" /></p>\n<p>Keys linked to the colors of the color scheme have been chosen according to the following groups:</p>\n<ol>\n  <li><strong>The functional purpose of the color</strong>:\n    <ul>\n      <li><code>primary</code></li>\n      <li><code>primaryDark</code></li>\n      <li><code>text</code></li>\n      <li><code>gray</code></li>\n      <li><code>error</code></li>\n      <li><code>success</code></li>\n      <li><code>warning</code></li>\n      <li><code>secondary</code></li>\n      <li><code>info</code></li>\n      <li><code>action</code></li>\n      <li><code>divider</code></li>\n    </ul>\n    <br />As the value in these object keys, they may be the following keys:\n    <ul>\n      <li><code>light</code></li>\n      <li><code>main</code></li>\n      <li><code>dark</code></li>\n      <li><code>contrastText</code></li>\n    </ul>\n  </li>\n  <li><strong>Visual property name</strong><br />For example, <code>background</code>.</li>\n  <li><strong>Colors grouped in a category</strong>:<br />\n<pre><code>{\n  common: {\n    black: \"#1D1D1D\"\n    white: \"#fff\"\n  }\n}\n</code></pre>\n</li></ol>\n\n<p>At the same time, the values in <code>theme.palette</code> contain other stuff:</p>\n<ul>\n  <li>The current color scheme mode:<br />\n\n<pre><code>{\n  mode: 'dark',\n}</code></pre>\n</li>\n<li>Utilities such as <code>getContrastText</code>,</li>\n<li>...and more.</li>\n</ul>\n\n<h4>Color Palette</h4>\n<p>Each color is an object. Keys are a color variant. The prefix <code>A</code> denotes the accent color.</p>\n<pre><code>const blue = {\n  50: '#e3f2fd',\n  100: '#bbdefb',\n  200: '#90caf9',\n  300: '#64b5f6',\n  400: '#42a5f5',\n  500: '#2196f3',\n  600: '#1e88e5',\n  700: '#1976d2',\n  800: '#1565c0',\n  900: '#0d47a1',\n  A100: '#82b1ff',\n  A200: '#448aff',\n  A400: '#2979ff',\n  A700: '#2962ff',\n};\n\nexport default blue;\n</code></pre>\n\n<p><strong>Note</strong>: <a href=\"https://github.com/mui/material-ui/tree/512896973499adbbda057e7f3685d1b23cc02de9/packages/mui-material/src/colors\">Check out the source code</a>.</p>\n<h3>Comparison</h3>\n<p>We will choose the best reference example according to the following factors:</p>\n<ul>\n<li>an API that corresponds with the given terminology agreed on by client;</li>\n<li>implementation that corresponds with the given terminology;</li>\n<li>following best practices for the designated tasks.</li>\n</ul>\n<h4>Correspondence With Given Terminology</h4>\n<p><strong>Fluent UI React Northstar</strong></p>\n<p><strong><em>Pros:</em></strong>   </p>\n<ul>\n<li>The color palette and color scheme are explicitly separated.</li>\n</ul>\n<p><strong><em>Cons:</em></strong>  </p>\n<ul>\n<li>The color palette contains not only common color names (red, green, and so on).</li>\n</ul>\n<p><strong>Material UI</strong></p>\n<p><strong><em>Pros:</em></strong></p>\n<ul>\n<li>The color scheme (the “palette” key in the theme configuration) contains not only colors.</li>\n<li>The “palette” key name is confusing because if you want to use a color palette, you would import the “colors” object from the <code>@mui/material</code> package.</li>\n<li>Misunderstanding is compounded by incomplete compliance with the Material UI guide:<ul>\n<li><a href=\"https://github.com/mui/material-ui/issues/17241\">Not all “on” colors aren’t presented</a>. Presented colors are named differently.</li>\n<li><a href=\"https://github.com/mui/material-ui/issues/21126\">“Surface” color is named differently</a>.</li>\n</ul>\n</li>\n</ul>\n<h4>Used Practices</h4>\n<p>From the point of view of this factor, let’s consider only the differences.</p>\n<p><strong>Fluent UI React Northstar</strong></p>\n<p>Adding a postfix denoting the brightness of color was chosen as the approach to name variables. The color palette contains colors named by their function and common color names (red, green, and so on). The color scheme groups color by visual properties combined with states.</p>\n<p><strong>Material UI</strong></p>\n<p>Adding a suffix denoting the brightness of the color and a prefix denoting the accent color was decided on as the approach to naming variables. The color palette contains colors named by their common color names (red, green, and so on). The color scheme groups color by visual properties and function.</p>\n<p>I would use the Fluent UI React Northstar as the reference for implementation because it accords with the given terminology. If the topics that were mentioned in the introduction as not being considered were to be considered, then the choice might have been different.</p>\nConclusion\n<p>Let’s summarize the key points:</p>\n<ol>\n<li>If you want to implement something, examine the best references in order to avoid reinventing the wheel, and focus instead on finding solutions to unresolved problems.</li>\n<li>During the examination process, you will encounter solved tasks and terms. Make a summary of them.</li>\n<li>Choose the best solutions according to your task’s requirements and limitations.</li>\n<li>Choose the best reference that corresponds with the solutions that you chose.</li>\n<li>Implement by following the best reference.</li>\n</ol>\n<p>If you want to dig into color theory, I strongly recommend the book <a href=\"https://programmingdesignsystems.com/color/a-short-history-of-color-theory/index.html#a-short-history-of-color-theory-xZzRFOZ\"><em>Programming Design Systems</em></a>, written by Rune Skjoldborg Madsen.</p>\n<p><em>I would like to thank Andrey Antropov, Daniyal Gabitov, and Oleksandr Fediashov for their suggestions for improvement and valuable additions. I would also like to thank the editors of Smashing Magazine for their assistance.</em></p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"497a2e879b87283e0c6516fcb88cd4744fbff253a47aa453d82c375ca2cb8b0e","category":"Tech"}