{"title":"LncRNA MYU Facilitates Angiogenesis in HUVECs under Hypoxia by Functioning as a ceRNA for miR-23a-3p","link":"https://www.preprints.org/manuscript/202406.1404/v1","date":1718866169000,"content":"Background: Angiogenesis is essential for various physiological and pathological processes, such as embryonic development and cancer cell proliferation, migration, and invasion. Long noncoding RNAs (lncRNAs) play pivotal roles in normal homeostasis and disease processes by regulating gene expression through various mechanisms, including as competing endogenous RNAs (ceRNAs) of target microRNAs (miRNAs). The lncRNA MYU is known to promote prostate cancer proliferation via the miR-184/c-Myc regulatory axis, and to be upregulated in vascular endothelial cells under hypoxic conditions, which often occurs in solid tumors. In the present study, we investigated whether MYU might affect cancer growth by regulating angiogenesis in vascular endothelial cells under hypoxia. \nMethods: The expression of MYU-regulated miR-23a-3p and interleukin-8 (IL-8) in HUVEC cell lines was examined using qRT-PCR. CCK-8 assay, EdU assay, Wound-healing assay and Tube-formation assay were used to assess the effect of MYU on cell proliferation, migration and tube formation of HUVEC cells in vitro. Dual-luciferase reporter assay was performed to examine the effect of miR-23a-3p on MYU and IL-8 expression.\nResults: We found that overexpression of MYU and knockdown of miR-23a-3p in human umbilical vein endothelial cells (HUVECs) under hypoxia promoted cell proliferation, migration, and tube formation. Mechanistically, MYU was shown to bind competitively to miR-23a-3p, thereby preventing miR-23a-3p binding to the 3′ untranslated region of IL-8 mRNA. In turn, increased production of pro-angiogenic IL-8 promoted HUVEC proliferation, migration, and tube formation under hypoxia. \nConclusion: This study identified a new role for lncRNA MYU as a ceRNA for miR-23a-3p, and uncovered a novel MYU–miR-23a-3p–IL-8 regulatory axis for angiogenesis. MYU and/or miR-23a-3p may thus represent new targets for the treatment of hypoxia-related diseases by promoting angiogenesis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4985824697bf0b0359b8b7a5af735f4023f1fd327f149d0f8c80da051a7407fc","category":"Interdisciplinary"}