{"title":"Functional evaluation of Bacillus licheniformis PF9 for its potential in controlling enterotoxigenic Escherichia coli in weaned piglets","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae050/7639540?rss=1","date":1712102400000,"content":"<span><div>Abstract</div>During the bacterial selection, isolate PF9 demonstrated tolerance to low pH and high bile salt and an ability to extend the lifespan of <span>Caenorhabditis elegans</span> infected with enterotoxigenic <span>Escherichia coli</span> (<strong>ETEC</strong>; <span>P</span> &lt; 0.05). Thirty-two weaned piglets susceptible to ETEC F4 were randomly allocated to four treatments as follows: 1) non-challenged negative control group (<strong>NNC</strong>; basal diet and piglets gavaged with phosphate-buffered saline), 2) negative control group (<strong>NC</strong>; basal diet and piglets challenged with ETEC F4, 3 × 10<sup>7</sup> CFU per pig), 3) positive control (<strong>PC</strong>; basal diet + 80 mg·kg<sup>−1</sup> of avilamycin and piglets challenged with ETEC F4), and 4) probiotic candidate (PF9; control basal diet + 2.5 × 10<sup>9</sup> CFU·kg<sup>−1</sup> diet of <span>B. licheniformis</span> PF9 and piglets challenged with ETEC F4). The infection of ETEC F4 decreased average daily gain and gain:feed in the NC group when compared to the NNC group (<span>P</span> &lt; 0.05). The inoculation of ETEC F4 induced severe diarrhea at 3 h postinoculum (<strong>hpi</strong>), 36, 40 hpi in the NC group when compared to the NNC group (<span>P</span> &lt; 0.05). The supplementation of <span>B. licheniformis</span> PF9 significantly relieved diarrhea severity at 3 hpi when compared to the NC group (<span>P</span> &lt; 0.05). The inoculation of ETEC F4 reduced duodenal, jejunal, and ileal villus height (<strong>VH</strong>) in the NC group when compared to the NNC group. A significant (<span>P</span> &lt; 0.05) decrease was detected in the duodenal VH in the PC and NNC groups. Moreover, the NNC group had a reduced relative mRNA level of Na<sup>+</sup>-glucose cotransporter 1 (<strong>SGLT1</strong>) when compared to the NC group (<span>P</span> &lt; 0.05). Compared to the NC and NNC groups, the supplementation of <span>B. licheniformis</span> PF9 increased the relative mRNA levels of aminopeptidase N, occludin, zonula occludens-1, and SGLT1 (<span>P</span> &lt; 0.05). The supplementation of <span>B. licheniformis</span> PF9 also significantly increased the relative mRNA level of excitatory amino acid transporter 1 when compared to the NC group (<span>P</span> &lt; 0.05). Piglets supplemented with <span>B. licheniformis</span> PF9 showed lower relative abundance of Bacteroidetes in the colon than piglets from the NNC group (<span>P</span> &lt; 0.05). The NNC group had a higher relative abundance of Firmicutes in the ileum than all the challenged piglets (<span>P</span> &lt; 0.05); however, a lower relative abundance of Proteobacteria in the ileum and colon was observed in the NC group (<span>P</span> &lt; 0.05). This study provides evidence that <span>B. licheniformis</span> PF9 has the potential to improve the gut health of piglets under challenging conditions.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"49855e164e15b7d4eebf4a3b990bc5408d1394da6ad1bb936f9baaa5827bff0d","category":"Environment"}