{"title":"Product Evaluation of a Topical Live Probiotic Serum for Skin Health","link":"https://www.preprints.org/manuscript/202406.1847/v1","date":1719395877000,"content":"Background: Micrococcus luteus is a commensal bacterial member on the human skin and is essential in keeping the balance among the various microbial flora of the skin. M. luteus strain Q24 or BLIS Q24TM was isolated from the skin of a healthy human adult and has been identified to produce a unique antimicrobial spectrum that is inhibitory towards pathogenic bacteria associated with many skin diseases such as acne. It has been developed as a probiotic with potential applications in improving overall skin health.Aim: This study aimed to evaluate the perceived changes in skin quality following topical application of a formulation containing skin commensal probiotic BLIS Q24TM. Materials and methods: A 28-day study involving 100 adult participants with self-reported normal skin with occasional blemishes or breakouts, topically applied a serum formulation containing BLIS Q24TM to the face. Participants quantitatively evaluated the probiotic serum effect on their skin at baseline Day 0 and then again on Day 10, 20 and 28 of the application. In addition, participants maintained a photo diary to record the perceived changes to their skin.Results: A total of 96 participants completed this research. In comparison to the baseline (Day 0), within 10 days, a significant reduction in blackheads (48%), oiliness (48%), blemishes (57%), dry areas (23%), redness/rosacea (45%) and flaky and rough skin (38%) were reported. The probiotic serum was also effective in a significant reduction in fine lines and wrinkles (38%), whiteheads (41%), pimples (55%), age spots (29%), and acne (21%) by the end of 28 days of probiotic application. Overall, there’s agreement that probiotic serum delivers or exceeds consumer expectations from the concept and performs just as well, or better, than their regular moisturiser.Conclusions: An approach of delivering a live probiotic packaged in an innovative formula to improve several skin conditions in otherwise healthy individuals was found to be successful. This study highlights that a serum formulation containing BLIS Q24TM has a positive impact on skin health with it being effective topically in reducing the appearance of skin blemishes, oiliness, wrinkles, redness, and dryness. BLIS Q24TM offers the potential for the prevention of skin health-related issues and routine maintenance of skin microbiome for healthy skin.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4989fffcf4a2bae2a0f86b8f525a36b06ff9c92cb2fed0741b59b0eb6cf3a9dc","category":"Interdisciplinary"}