{"title":"PEITC Induces DNA Damage and Inhibits DNA Repair‐Associated Proteins in Human Retinoblastoma Cells In Vitro","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24393?af=R","date":1724418582000,"content":"<h2>ABSTRACT</h2>\n<p>Phenethyl isothiocyanate (PEITC), a natural product, exists in biological activities, including anticancer activity in many human cancer cells. No information shows that PEITC affects DNA damage in human retinoblastoma (RB) cells in vitro. In this study, the aim of experiments was to determine whether PEITC decreased total viable cell number or not by inducing protein expressions involved in DNA damage and repair in Y79 RB cells in vitro. Total cell viability was measured by PI exclusion assay, and PEITC reduced the total Y79 viable cell numbers in a dose-dependent manner. DNA condensation and DNA impairment were conducted by DAPI staining and comet assays, respectively, in Y79 cells. The findings show that PEITC induced DNA condensation dose-dependently based on the brighter fluorescence of cell nuclei stained by DAPI staining. PEITC-induced DNA damage showed a more extended DNA migration smears than that of the control, which was performed by a comet assay. Western blotting was performed to measure the protein expressions involved in DNA damage and repair, which showed that PEITC at 2.5–10 μM increased NRF2, HO-1, SOD (Mn), and catalase; however, it decreased SOD (Cu/Zn) except 10 μM PEITC treatment, and decreased glutathione, which were associated with oxidative stress. Furthermore, PEITC increased DNA-PK, MDC1, H<sub>2</sub>A.X<sup>pSer139</sup>, ATM<sup>pSer1981</sup>, p53, p53<sup>pSer15</sup>, PARP, HSP70, and HSP90, but decreased TOPIIα, TOPIIβ, and MDM2<sup>pSer166</sup> that were associated with DNA damage and repair mechanism in Y79 cells. The examination from confocal laser microscopy shows that PEITC increased H<sub>2</sub>A.X<sup>pSer139</sup> and p53<sup>pSer15</sup>, and decreased glutathione and TOPIIα in Y79 cells. In conclusion, the cytotoxic effects of PEITC on reducing the number of viable cells may be due to the induction of DNA damage and the alteration of DNA repair proteins in Y79 cells in vitro.</p>","author":"Sheng‐Yao Hsu, \nYi‐Ping Huang, \nTe‐Chun Hsia, \nJaw‐Chyun Chen, \nShu‐Fen Peng, \nWen‐Tsong Hsieh, \nFu‐Shin Chueh, \nChao‐Lin Kuo","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"498b099a5b00af762c44b2a2232810d02202aca8ce8aa1b421a0393cdba0bd19","category":"Environment"}