{"title":"Tailoring the physicochemical properties of starch: impact of integrated ultrasonic and ethanol pretreatment on the oil uptake of infrared fried ginkgo seeds","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13417?af=R","date":1711110892000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The structural changes of starch would have a more crucial impact on oil absorption and quality changes in starch-rich fruits and vegetables during frying process with enhanced heat transfer (such as infrared frying). In the present study, the influence of integrated ultrasonic and ethanol (US + ethanol) pretreatment on oil uptake in infrared fried (IF) ginkgo seeds was evaluated regarding modifications in the physicochemical properties of starch. The pretreatment was performed with ultrasonic (40 kHz, 300 W) and ethanol osmotic (95%, v/v) treatment individually or integrated for 40 min.</p>\n<h2>RESULTS</h2>\n<p>The mass transfer in the pretreatment was facilitated by combined ultrasound and ethanol. The swelling power, solubility, and gelatinization degree of starch was significantly increased. Low-frequency-NMR curves and images revealed that the bound water fraction in ginkgo seeds was increased and the water distribution was homogenized. The results of Fourier transform-infrared spectrum and differential scanning calorimeter revealed that the crystalline regions of starch were reduced and the thermal enthalpy was decreased after US + ethanol pretreatment. The total, surface and structural oil content in IF ginkgo seeds with US + ethanol pretreatment was reduced by 29.10%, 34.52% and 29.73%, respectively. The US + ethanol pretreatment led to a thinner crust layer with increased porosity and smaller-sized pores in the IF ginkgo seeds as observed by stereo microscopy and scanning electron microscopy.</p>\n<h2>CONCLUSION</h2>\n<p>The changes in structural and physicochemical properties of starch by combined ultrasound and ethanol affect the crust ratio and pore characteristics in fried high-starch fruits and vegetables, thereby reducing oil absorption. © 2024 Society of Chemical Industry.</p>","author":"Ya Su, \nYing Chen, \nMenglin Sun, \nAiqing Ren, \nJianlin Li, \nZhenbin Liu, \nTiesong Zheng","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"498e6363bb581fe79cf44b9a96c91b31d782c13eca1a9d45032d132d1b26ec7b","category":"Environment"}