{"title":"Low-Level Laser Can Increase Extracellular Matrix Signals Mediated by Cytokine Modulation during the Lung Recellularization Process","link":"https://www.preprints.org/manuscript/202404.1709/v1","date":1714113736000,"content":"Several Lung diseases can result in lung damage structural changes, with lung transplantation as a only therapeutic option when the disease reaches an advanced progression, unfortunately, the success of lung transplantation is limited. In this context, lung bioengineering is considered a potential therapeutic alternative and the current approach is based on the use of the natural extracellular matrix (ECM) of the decellularized lung. The use of undifferentiated cells to seed an ECM can be a more practical strategy for lung bioengineering but the sterilization of the organ for this recellularization process is still a challenge. In this sense, Low-Level Laser Therapy (LLLT) can emerge as a potential treatment alternative. Therefore, the objective of this study was to verify if LLLT, can optimize lung recelularization with mesenchymal stem cells by cytokine modulation. For this, we decellularized lungs from C57BL/6 mice perfusing SDS 1% via pulmonary artery, sterilized with LLL (660nm, 100mW, 30s). Whole lung scaffolds were recellularized: (1) Recellularized Lung (2) Recellularized Lung + LLLT. Mesenchymal stem cells derived from human tooth pulp (DPSc) were seeded into lungs and incubated for 24 hours at 37ºC, 5% CO₂, in a bioreactor-like conditions, maintaining CPAP at 20cmH2O, 90% O2, and LLL at wavelength of 808nm, 100mW, 30s. Culture medium were analyzed at 24 hours. H&amp;amp;E, immunostaining, SEM and ELISA assay were performed. We produced viable biological scaffolds absent of DNA content, preserving glycosaminoglycans and collagen I, III and IV, fibronectin, laminin and elastin and lung structure (SEM). The levels of IL-6 and IL-8 were stable during the 24 hours of culture. IFN-γ levels showed significant difference in the DPSc and DPSc+LLLT group in the 24-hour evaluation. The levels of IL-10 decreased after LLLT. These findings highlight LLLT's role in cytokine regulation and contamination prevention during lung recellularization with mesenchymal stem cells. Overall, these results demonstrated that LLLT's modulated cytokine levels and could prevent contamination during the lung recellularization process with mesenchymal stem cells, offering promise for enhanced therapeutic strategies in lung bioengineering","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4999be45d263620b2eea33a4d83c954afa8166845027d04e81905e865459c366","category":"Interdisciplinary"}