{"title":"The ecological–hydrological regime of the Han River basin under changing conditions: The coupled influence of human activities and climate change","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2632?af=R","date":1722317571000,"content":"<h2>Abstract</h2>\n<p>Because of the confluence of human activities and climate change, the hydrological regime in the Han River basin has substantially evolved, necessitating a multi-faceted, quantitative analysis of the causative factors. Employing cross-wavelet analysis, we examined nonlinear relationships between runoff and meteorological variables. Additionally, we assessed hydrological indicators via the IHA index and RVA, then quantified the drivers of runoff variations across different time scales using the Budyko hypothesis and a Generalized Regression Neural Network (GRNN) model. The findings reveal the presence of sustained resonance periods within the climate-runoff system, notably concentrated in 9- to 15-month intervals during the years 1985–1994, 1995–2012, and 2014–2018, with a confidence level of 95%. Overall, the basin exhibited moderate change (41.66%), with 15 indicators displaying varying degrees of moderate to high transformation. These shifts underscore significant ecosystem transformations. The influence of driving factors on runoff varies across temporal scales. On an annual scale, human activities predominantly shape runoff changes (52.35%), while meteorological factors contribute significantly (47.65%). Conversely, at the monthly scale, climate change emerges as the dominant influence on runoff patterns in June and September, with human activities maintaining a principal role in other months, notably exceeding 90% even in November.</p>","author":"Hongxiang Wang, \nWeiqi Yuan, \nHuan Yang, \nFengtian Hong, \nKefei Yang, \nWenxian Guo","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"49b793b38c4a2607d91fafeb29e9ac6bd1b5575fca83d12306b495df9c4189d5","category":"Environment"}