{"title":"National Beef Quality Audit-2022 Phase 1: face-to-face and digital interviews","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae034/7626882?rss=1","date":1710201600000,"content":"<span><div>Abstract</div>The National Beef Quality Audit (<strong>NBQA</strong>) has been conducted regularly since 1991 to assess and benchmark quality in the U.S. beef industry, with the most recent iteration conducted in 2022. The goal of NBQA Phase I is to evaluate what needs to be managed to improve beef quality and demand. Interviews (<span>n</span> = 130) of industry personnel were conducted with the aid of routing software. In total, packers (<span>n</span> = 24), retailers (<span>n</span> = 20), further processors (<span>n</span> = 26), foodservice (<span>n</span> = 18), and allied government agencies and trade organizations (<span>n</span> = 42) were interviewed. Interviews were routed in software based on interviewee involvement in either the fed steer and heifer market cow and bull sectors, or both. Interviews were structured to elicit random responses in the order of determining “must-have” criteria (quality factors that are required to make a purchase), best/worst ranking (of quality factors based on importance), how interviewees defined quality terms, a strength, weakness, opportunities, threats (<strong>SWOT</strong>) analysis, general beef industry questions, and sustainability goals (the latter four being open-ended). Quality factors were 1) visual characteristics, 2) cattle genetics, 3) food safety, 4) eating satisfaction, 5) animal well-being, 6) weight and size, and 7) lean, fat, and bone. Best/worst analysis revealed that “food safety” was the most (<span>P</span> &lt; 0.05) important factor in beef purchasing decisions for all market sectors and frequently was described as “everything” and “a way of business.” Culture surrounding food safety changed compared to previous NBQAs with interviewees no longer considering food safety as a purchasing criterion, but rather as a market expectation. The SWOT analysis indicated that “eating quality of U.S. beef” was the greatest strength, and cited that educating both consumers and producers on beef production would benefit the industry. Irrespective of whether companies’ products were fed or market cow/bull beef, respondents said that they believed “environmental concerns” were among the major threats to the industry. Perceived image of the beef industry in the market sectors has improved since NBQA-2016 for both fed cattle and market cow/bull beef.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"49bbbeb22cadeaf006fa38f68a52daee70ea975ddbaaf11b8f9bd3a82908b6f3","category":"Environment"}