{"title":"Decoding the role of flavonoids in ROS management during heat stress in tomato pollen","link":"https://academic.oup.com/plcell/article/36/10/4285/7736071?rss=1","date":1724025600000,"content":"<span>Without the luxury of air conditioning, scorching heat can be brutal for plants. Extreme temperatures adversely affect multiple phases of plant reproduction, particularly pollen viability and germination. A 4 °C to 6 °C increase above optimal temperatures during sexual reproduction negatively impacts crop yields by increasing reactive oxygen species (ROS) levels. While controlled, localized ROS bursts are essential for pollen growth and development, excessive ROS can be detrimental (<a href=\"#koae234-B1\">De Storme and Geelen 2014</a>; <a href=\"#koae234-B2\">Kaya et al. 2014</a>). To counter these damaging effects, plants produce specialized metabolites like flavonoids (flavonols and anthocyanins) with antioxidant properties that protect against harmful ROS. The tomato <span>anthocyanin reduced</span> (<span>are</span>) mutant, with a mutation <span>Flavanone 3-Hydroxylase</span> (<span>F3H</span>), accumulates reduced flavonoid levels in its roots, leaves, and pollen compared with wild-type plants (<a href=\"#koae234-B3\">Maloney et al. 2014</a>). The <span>are</span> mutant exhibits decreased pollen viability and pollen tube elongation at normal temperatures, which is reversed when the mutant is complemented with the full-length <span>F3H</span> gene. The <span>are</span> mutant at normal and elevated temperatures shows higher incidence of pollen tube rupture (<a href=\"#koae234-B4\">Muhlemann et al. 2018</a>). Therefore, the <span>are</span> mutant serves as an excellent tool to understand the precise mechanisms of heat-induced ROS generation and their oxidative targets, as well as uncovering how high temperatures hinder pollen growth and development at the molecular and cellular levels is crucial to counter reproductive failure.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"49be65d32bdac585e175c285c398f026ec0fd162eb7bcb163ada54a9d9670d1e","category":"Environment"}