{"title":"Environmental associations of <i>Ophidiomyces ophidiicola</i>, the causative agent of ophidiomycosis in snakes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310954","date":1729605600000,"content":"<p>by Nicholas Friedeman, Evin Carter, Bruce A. Kingsbury, Michael J. Ravesi, Jillian M. Josimovich, Monica Matthews, Mark A. Jordan</p>\r\n\r\nEmerging pathogenic fungi have become a topic of conservation concern due to declines observed in several host taxa. One emerging fungal pathogen, <i>Ophidiomyces ophidiicola</i>, is well documented as the causative agent of ophidiomycosis, otherwise known as snake fungal disease (SFD). <i>O</i>. <i>ophidiicola</i> has been found to cause disease in a variety of snake species across the United States, including the eastern massasauga (<i>Sistrurus catenatus</i>), a federally threatened rattlesnake species. Most work to date has involved detecting <i>O</i>. <i>ophidiicola</i> for diagnosis of infection through direct sampling of snakes, and attempts to detect <i>O</i>. <i>ophidiicola</i> in the abiotic environment to better understand its distribution, seasonality, and habitat associations are lacking. We collected topsoil and groundwater samples from four macrohabitat types across multiple seasons in northern Michigan at a site where <i>Ophidiomyces</i> infection has been confirmed in eastern massasauga. Using a quantitative PCR (qPCR) assay developed for <i>O</i>. <i>ophidiicola</i>, we detected <i>Ophidiomyces</i> DNA in topsoil but observed minimal to no detection in groundwater samples. Detection frequency did not differ between habitats, but samples grouped seasonally showed higher detection during mid-summer. We found no relationships of detection with hypothesized environmental correlates such as soil pH, temperature, or moisture content. Furthermore, the distribution of <i>Ophidiomyces</i> positive samples across the site was not linked to estimated space use of massasaugas. Our data suggests that season has some effect on the presence of <i>Ophidiomyces</i>. Differences in presence between habitats may exist but are likely more dependent on the time of sampling and currently uninvestigated soil or biotic parameters. These findings build on our understanding of <i>Ophidiomyces</i> ecology and epidemiology to help inform where and when snakes may be exposed to the fungus in the environment.","author":"Nicholas Friedeman","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"49bee8f0a00b4786a6ec39ce25d481381dfbb6b1a7779f044c7ad3fac7a903b9","category":"Interdisciplinary"}