{"title":"Mathieu van der Poel won Milan-San Remo on a new Canyon Aeroad – here’s what we know so far","link":"https://www.bikeradar.com/news/mathieu-van-der-poel-new-canyon-aeroad-milan-sanremo/","date":1679503226000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Mathieu-van-der-Poels-new-Canyon-Aeroad-3-020e779.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Mathieu-van-der-Poels-new-Canyon-Aeroad-3-020e779.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Mathieu-van-der-Poels-new-Canyon-Aeroad-3-020e779.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Mathieu-van-der-Poels-new-Canyon-Aeroad-3-020e779.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Mathieu-van-der-Poels-new-Canyon-Aeroad-3-020e779.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Mathieu-van-der-Poels-new-Canyon-Aeroad-3-020e779.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Mathieu-van-der-Poels-new-Canyon-Aeroad-3-020e779.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Mathieu-van-der-Poels-new-Canyon-Aeroad-3-020e779.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Mathieu-van-der-Poels-new-Canyon-Aeroad-3-020e779.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Mathieu-van-der-Poels-new-Canyon-Aeroad-3-020e779.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Mathieu van der Poel's new Canyon Aeroad at the 2023 Strade Bianche\" title=\"Mathieu van der Poel's new Canyon Aeroad at the 2023 Strade Bianche\" />                                            <p>Mathieu van der Poel is riding an updated version of Canyon’s aero-focused road bike, the Aeroad CFR.</p>\n<p>We first spotted van der Poel on a new Aeroad at the Strade Bianche and the Dutch star went on to win Milan–San Remo on the updated machine, attacking over the top of the Poggio before holding off Filippo Ganna and Wout van Aert to win the opening Monument of the season.</p>\n<p>The principal change to van der Poel’s Aeroad appears to be a repositioned seatpost clamp and Canyon, as you’d expect at this stage, is remaining tight-lipped as to whether any other updates have been made beneath the bonnet.</p>\n<p>Here’s what we know so far about van der Poel’s Aeroad.</p>\n<h2>1. This is the same prototype we saw Mathieu van der Poel riding in January</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Mathieu van der Poel is riding a new Canyon Aeroad.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>Remember the black <a href=\"https://www.bikeradar.com/news/new-canyon-aeroad-prototype/\">Canyon Aeroad ‘prototype’</a> we spotted van der Poel riding in December? Canyon has confirmed this is the same updated bike.</p>\n<p>“Basically this is the same black prototype that Mathieu was seen on in January, except it’s a painted version,” Ben Hillsdon, Canyon’s global communications manager, told BikeRadar.</p>\n<p>While the German brand hasn’t revealed any details around the updated Aeroad’s future availability, clearly the bike is ready for WorldTour racing.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> We spotted van der Poel riding this black prototype back in December.</span></figcaption><span> <i>Mathieu van der Poel </i></span></div>\n<h2>2. The seatpost clamp has been moved to the top tube</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The seatpost clamp has been moved to the top tube.</span></figcaption><span> <i>George Scott / Our Media</i></span></div>\n<p>This, on the face of it, is a very subtle update, but we have spotted one significant change – albeit one that’s focused on usability and reliability, rather than all-out performance.</p>\n<p>Canyon has moved the seatpost clamp from the seat tube to the top tube, introducing what we expect to be a wedge-based setup similar to a number of other <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-aero-road-bike/\">aero road bikes</a>.</p>\n<p>The previous version of the Aeroad was <a href=\"https://www.bikeradar.com/news/2021-canyon-aeroad/\">introduced in 2019</a> and, with it, Canyon adopted a clamp position similar to that of the Ultimate, the firm’s all-round race bike.</p>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Canyon-Aeroad-CFR-seatpost-clamp-bolt-89ced07.jpeg?quality=90&amp;resize=556%2C723\" width=\"556\" height=\"723\" alt=\"Canyon Aeroad CFR seatpost clamp bolt\" title=\"Canyon Aeroad CFR seatpost clamp bolt\" /></div>    <figcaption><div>\n    <figcaption><span>The Canyon Aeroad CFR seatpost clamp bolt was previously located on the rear of the seat tube.</span>\n    </figcaption><span>\n                    <i>Simon von Bromley / Our Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Canyon-Aeroad-CFR-seatpost-design-7839270.jpeg?quality=90&amp;resize=556%2C723\" width=\"556\" height=\"723\" alt=\"Canyon Aeroad CFR seatpost design\" title=\"Canyon Aeroad CFR seatpost design\" /></div>    <figcaption><div>\n    <figcaption><span>By placing the seatpost clamp within the seat tube, Canyon said the design allowed for more of the unclamped post to flex.</span>\n    </figcaption><span>\n                    <i>Canyon</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<p>By moving the clamp midway down the seat tube, Canyon said the increased amount of unclamped post would enable more flex and improve comfort. Inside, the aero-shaped seat tube housed a smaller, D-shaped seatpost.</p>\n<p>Now, the seatpost clamp is accessed from the top tube, with the exposed Torx bolt visible on van der Poel’s bike at Strade Bianche and Milan–San Remo.</p>\n<p>Ultimately, we can’t see what’s going on inside the seat tube. However, given that the flex afforded by the previous design required the seatpost clamp to be located on the seat tube, we can assume Canyon has moved to a more typical seatpost that’s unlikely to offer the same amount of movement.</p>\n<h2>3. The design offers easier maintenance and adjustment</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> You can see the seatpost clamp bolt is no longer visible on the seat tube.</span></figcaption><span> <i>Tim de Waele</i></span></div>\n<p>According to Canyon, the revised clamp position enables easier maintenance and adjustment.</p>\n<p>“Mathieu’s bike has a new position for the seatpost clamping bolt, moving it to the front-side of the seatpost to reduces the chance of dirt ingress, and there is a minor adjustment to the frame to fit this,” said Hillsdon.</p>\n<p>The previous Aeroad’s seatpost design had already received an update after the bike’s launch in 2020, with some riders experiencing excessive wear due, in part, to the flexing design and the ability for dirt to enter the frame.</p>\n<p>A mid-cycle update in 2021 saw the seatpost move to an S-shaped design, rather than running straight from top to bottom, while Canyon also added a cosmetic cap to the external portion of the post where it meets the top tube.</p>\n<p>The clamping bolt remained on the rear of the seat tube, though, and that’s the key change with this new model.</p>\n<h2>4. The rest of the frame is largely unchanged</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Canyon has tweaked the frame shape at the junction between the seat tube and top tube, in order to accommodate a wedge-style seatpost clamp.</span></figcaption><span></span></div>\n<p>In order to accommodate the new clamp design, Canyon has tweaked the frame shape where the top tube meets the seat tube. It’s a more angular affair, with the frame sloping at approximately a 45-degree angle to house the wedge that’s likely to be inside.</p>\n<p>While Hillsdon said the frame shape has been tweaked to accommodate the new clamp, there could, in theory, be a (very) small aerodynamic benefit from introducing what is effectively a ‘compensation triangle’.</p>\n<section><div>\n        \n<h3>What is a compensation triangle?</h3>\n<p>A compensation triangle is defined by the UCI’s technical regulations as: “Isosceles compensation triangles with two 8cm sides are authorized at the joints between frame elements except at the joints between the chain stays and seat stays where triangles are not authorized.</p>\n<p>“The effective width of the head tube zone may not exceed 16cm at the narrowest point between the inner join of the top tube and down tube and the front of the box for the head tube.”</p>\n<p>\n\n    </p></div>\n    </section><p>On the seatpost itself, the rubber cover is still in place to prevent dirt and water entering the gap between the post and frame tubes.</p>\n<p>Seatpost update aside, there are no obvious changes to the Aeroad’s frame shape.</p>\n<p>When we spotted van der Poel riding the unpainted prototype, we hinted at potential changes to the fork crown and seatstays based on the limited images we had at the time, but any updates are aesthetically minor and difficult to determine definitively at this stage.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Will a new Aeroad be officially released later in 2023?</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>Given Canyon will have needed to re-work the Aeroad’s carbon mould to accommodate the changes on van der Poel’s frame, this seems likely an unusually minor update.</p>\n<p>Canyon may reveal more when the bike launches but, despite the Aeroad approaching three years since its last major redesign, this appears to be a subtle tweak, on the surface at least.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> This, on the face of it, appears to be a minor update to Canyon’s aero road bike.</span></figcaption><span> <i>George Scott / Our Media</i></span></div>\n<h2>5. Only Mathieu van der Poel is riding the bike</h2>\n<div></div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> MVDP won Milan–San Remo on the updated bike.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>Mathieu van der Poel, as Alpecin–Deceuninck’s star man, is the only rider in the team on the new bike.</p>\n<p>The rest of the team are on the existing Aeroad CFR and Canyon is remaining tight-lipped about when that’s likely to change – and, more significantly for us, when the updated bike will be released.</p>\n<p>“We aren’t ready to share further details about this prototype, but we can say that the real-world race feedback we receive from Mathieu will help us to continue providing innovative new solutions for athletes and amateur racers alike,” said Hillsdon.</p>","author":"George Scott","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"49c666c4574d5be7933b2a4a1eeee6cb3c40dcdfd18466810c3306df84f805b1","category":"Cycling"}