{"title":"Perinatal exposure to traffic related air pollutants and the risk of infection in the first six months of life: a cohort study from a low-middle income country","link":"http://link.springer.com/10.1007/s00420-024-02064-0","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <span>\n                      <h3>Objective</h3>\n                      <p>There is limited study from low-and-middle income countries on the effect of perinatal exposure to air pollution and the risk of infection in infant. We assessed the association between perinatal exposure to traffic related air pollution and the risk of infection in infant during their first six months of life.</p>\n                    </span>\n                    <span>\n                      <h3>Methods</h3>\n                      <p>A prospective cohort study was performed in Jakarta, March 2016–September 2020 among 298 mother-infant pairs. PM<sub>2.5</sub>, soot, NO<sub>x</sub>, and NO<sub>2</sub> concentrations were assessed using land use regression models (LUR) at individual level. Repeated interviewer-administered questionnaires were used to obtain data on infection at 1, 2, 4 and 6 months of age. The infections were categorized as upper respiratory tract (runny nose, cough, wheezing or shortness of breath), lower respiratory tract (pneumonia, bronchiolitis) or gastrointestinal tract infection. Logistic regression models adjusted for covariates were used to assess the association between perinatal exposure to air pollution and the risk of infection in the first six months of life.</p>\n                    </span>\n                    <span>\n                      <h3>Results</h3>\n                      <p>The average concentrations of PM<sub>2.5</sub> and NO<sub>2</sub> were much higher than the WHO recommended levels. Upper respiratory tract infections (URTI) were much more common in the first six months of life than diagnosed lower respiratory tract or gastro-intestinal infections (35.6%, 3.5% and 5.8% respectively). Perinatal exposure to PM<sub>2.5</sub> and soot suggested increase cumulative risk of upper respiratory tract infection (URTI) in the first 6 months of life per IQR increase with adjusted OR of 1.50 (95% CI 0.91; 2.47) and 1.14 (95% CI 0.79; 1.64), respectively. Soot was significantly associated with the risk of URTI at 4–6 months age interval (aOR of 1.45, 95%CI 1.02; 2.09). All air pollutants were also positively associated with lower respiratory tract infection, but all CIs include unity because of relatively small samples. Adjusted odds ratios for gastrointestinal infections were close to unity.</p>\n                    </span>\n                    <span>\n                      <h3>Conclusion</h3>\n                      <p>Our study adds to the evidence that perinatal exposure to fine particles is associated with respiratory tract infection in infants in a low-middle income country.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"49cd14ad3204c7b9460ffb505013a81b9b8f18f3a16d2a7cc29e0295fc9092dd","category":"Environment"}