{"title":"Evaluation of a modified quantitative polymerase chain reaction assay for genus <i>Schistosoma</i> detection using stool and urine samples from schistosomiasis endemic areas in Kenya","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310118","date":1726840800000,"content":"<p>by Henry Kanyi, Richelle W. Kihoro, Benard Chieng, Sylvie Araka, Henry Emisiko, Thierry Ramos, Sarah Nogaro, Sammy M. Njenga</p>\r\nIntroduction <p>The microscopy-based Kato-Katz and urine filtration techniques have traditionally faced challenges in the detection of schistosomiasis in areas with low infection levels. A modified singleplex <i>Schistosoma</i> genus-specific quantitative real-time polymerase chain reaction (qPCR) assay was therefore evaluated as a sensitive and confirmatory schistosomiasis diagnostic test.</p> Methodology <p>The qPCR assay utilized primers and probe targeting internal transcribed spacer– 2 (ITS2) sequence of <i>S</i>. <i>mansoni</i>, <i>S</i>. <i>haematobium</i> and <i>S</i>. <i>intercalatum</i>. A plasmid (pDMD801, 100pg/ul) was used as an internal amplification control and its qPCR assays were run in parallel to the <i>Schistosoma</i> assays. This assay utilized samples collected from 774 participants and microscopically examined for three consecutive days. A total of 699 day-one samples (urine and stools) from two schistosomiasis endemic sites were analyzed. Similarly, 75 persons from a non-endemic control site provided both urine and stool samples that were also analyzed.</p> Results <p>Using microscopy, the proportion of positives in the two endemic regions altogether was 289/699 (41.3%). Using qPCR, 50.4% of the samples (352/699) were found to be positive for schistosome infection. The percentage of positive samples was slightly higher at 57.8% (203/351) in the <i>S</i>. <i>mansoni</i> endemic site compared with the <i>S</i>. <i>haematobium</i> site at 42.8% (149/348). Majority of the microscopy results were light infections at 26.8% (n = 94) and 26.1% (n = 91) while qPCR majority of the infections were high at 41.6% (n = 146) and 31.3% (n = 109) for the <i>S</i>. <i>mansoni</i> and <i>S</i>. <i>haematobium</i> sites, respectively. There were no positives detected by either microscopy or qPCR in the non-endemic site. Using Bayesian Latent Class Model, which does not use any technique as a gold standard, qPCR showed higher sensitivity (86.4% (PCI: 82.1–90.3)) compared to microscopy (75.6% (PCI: 71.1–80.0)).</p> Conclusions <p>This study documents a single day-one sample modified <i>Schistosoma</i> qPCR assay as a powerful improved molecular assay for the detection of schistosomiasis infection that utilize either stool or urine samples. The assay is therefore recommended for monitoring in areas with low infection levels to enable accurate determination of the disease’s control endpoint.</p>","author":"Henry Kanyi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"49d1189748e010217484358e0f4dcda8bf00ec635e9a63f1e1e5a9b2b9ee8d02","category":"Interdisciplinary"}