{"title":"Introducing Amazon Q, a new generative AI-powered assistant (preview)","link":"https://aws.amazon.com/blogs/aws/introducing-amazon-q-a-new-generative-ai-powered-assistant-preview/","date":1701193166000,"content":"<p>Today, we are announcing <a href=\"http://aws.amazon.com/q\">Amazon Q</a>, a new generative artificial intelligence- (AI)-powered assistant designed for work that can be tailored to your business. You can use Amazon Q to have conversations, solve problems, generate content, gain insights, and take action by connecting to your company’s information repositories, code, data, and enterprise systems. Amazon Q provides immediate, relevant information and advice to employees to streamline tasks, accelerate decision-making and problem-solving, and help spark creativity and innovation at work.</p> \n<p>Amazon Q offers user-based plans, so you get features, pricing, and options tailored to how you use the product. Amazon Q can adapt its interactions to each individual user based on the existing identities, roles, and permissions of your business. AWS never uses customers’ content from Amazon Q to train the underlying models. In other words, your company information remains secure and private.</p> \n<p>In this post, I’ll give you a quick tour of how you can use <a href=\"http://aws.amazon.com/q/business-expert\">Amazon Q for general business use.  </a></p> \n<ul> \n <li>For information on how developers and IT professionals can use Amazon Q, see: <a href=\"https://aws.amazon.com/blogs/aws/amazon-q-brings-generative-ai-powered-assistance-to-it-pros-and-developers-preview/\">Amazon Q brings generative AI-powered assistance to IT pros and developers (preview)</a></li> \n <li>For information on how business analysts can use Amazon Q in QuickSight, see: <a href=\"https://aws.amazon.com/blogs/aws/new-amazon-q-in-quicksight-uses-generative-ai-assistance-for-quicker-easier-data-insights-preview/\">New Amazon Q in QuickSight uses generative AI assistance for quicker, easier data insights (preview)</a></li> \n <li>For information on how contact center agents can use Amazon Q in Connect, see: <a href=\"https://aws.amazon.com/blogs/aws/new-generative-ai-features-in-amazon-connect-including-amazon-q-facilitate-improved-contact-center-service\">New generative AI features in Amazon Connect, including Amazon Q, facilitate improved contact center service</a></li> \n</ul> \n<p><strong><u>Amazon Q is your business expert<br /> </u></strong>Let’s look at a few examples of how Amazon Q can help business users complete tasks using simple natural language prompts. As a marketing manager, you could ask Amazon Q to transform a press release into a blog post, create a summary of the press release, or create an email draft based on the provided release. Amazon Q searches through your company content, which can include internal style guides, for example, to provide a response appropriate to your company’s brand standards. Then, you could ask Amazon Q to generate tailored social media prompts to promote your story through each of your social media channels. Later, you can ask Amazon Q to analyze the results of your campaign and summarize them for leadership reviews.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-intro.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-intro.png\" alt=\"Amazon Q\" width=\"1628\" height=\"1116\" /></a></p> \n<p>In the following example, I deployed Amazon Q with access to <a href=\"https://aws.amazon.com/blogs/aws/author/antjebar/\">my AWS News Blog posts from 2023</a> and called the assistant “AWS Blog Expert.”</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-08.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-08.png\" alt=\"Amazon Q\" width=\"1670\" height=\"1199\" /></a></p> \n<p>Coming back to my previous example, let’s assume I’m a marketing manager and want Amazon Q to help me create social media posts for recent company blog posts.</p> \n<p>I enter the following prompt: “Summarize the key insights from Antje’s recent AWS Weekly Roundup posts and craft a compelling social media post that not only highlights the most important points but also encourages engagement. Consider our target audience and aim for a tone that aligns with our brand identity. The social media post should be concise, informative, and enticing to encourage readers to click through and read the full articles. Please ensure the content is shareable and includes relevant hashtags for maximum visibility.”</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/26/2023-amazon-q-business-13.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/26/2023-amazon-q-business-13.png\" alt=\"Amazon Q\" width=\"1577\" height=\"896\" /></a></p> \n<p>Behind the scenes, Amazon Q searches the documents in connected data sources and creates a relevant and detailed suggestion for a social media post based on my blog posts. Amazon Q also tells me which document was used to generate the answer. In this case, it is PDF file of the blog posts in question.</p> \n<p>As an administrator, you can define the context for responses, restrict irrelevant topics, and configure whether to respond only using trusted company information or complement responses with knowledge from the underlying model. Restricting responses to trusted company information helps mitigate hallucinations, a common phenomenon where the underlying model generates responses that sound plausible but are based on misinterpreted or nonexistent data.</p> \n<p>Amazon Q provides fine-grained access controls that restrict responses to only using data or acting based on the employee’s level of access and provides citations and references to the original sources for fact-checking and traceability. You can choose among 40+ built-in connectors for popular data sources and enterprise systems, including <a href=\"https://aws.amazon.com/s3/\">Amazon S3</a>, Google Drive, Microsoft SharePoint, Salesforce, ServiceNow, and Slack.</p> \n<p><strong><u>How to tailor Amazon Q to your business<br /> </u></strong>To tailor Amazon Q to your business, navigate to <a href=\"https://console.aws.amazon.com/amazonq/home\">Amazon Q in the console</a>, select <strong>Applications</strong> in the left menu, and choose <strong>Create application</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-02.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-02.png\" alt=\"Amazon Q\" width=\"1538\" height=\"977\" /></a></p> \n<p>This starts the following workflow.</p> \n<p><strong>Step 1</strong>.<strong> Create application</strong>. Provide an application name and create a new or select an existing <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a> service role that Amazon Q is allowed to assume. I call my application <code>AWS-Blog-Expert</code>. Then, choose <strong>Create</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-03.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-03.png\" alt=\"Amazon Q\" width=\"1536\" height=\"1155\" /></a></p> \n<p><strong>Step 2</strong>.<strong> Select retriever</strong>. A retriever pulls data from the index in real time during a conversation. You can choose between two options: use the Amazon Q native retriever or use an existing <a href=\"https://aws.amazon.com/kendra/\">Amazon Kendra</a> retriever. The native retriever can connect to the Amazon Q supported data sources. If you already use Amazon Kendra, you can select the existing Amazon Kendra retriever to connect the associated data sources to your Amazon Q application. I select the native retriever option. Then, choose <strong>Next</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-04.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-04.png\" alt=\"Amazon Q\" width=\"1528\" height=\"978\" /></a></p> \n<p><strong>Step 3</strong>.<strong> Connect data sources</strong>. Amazon Q comes with built-in connectors for popular data sources and enterprise systems. For this demo, I choose <strong>Amazon S3</strong> and configure the data source by pointing to my S3 bucket with the PDFs of my blog posts.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-05.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-05.png\" alt=\"Amazon Q\" width=\"1531\" height=\"2094\" /></a><br /> Once the data source sync is successfully complete and the retriever shows the accurate document count, you can preview the web experience and start a conversation. Note that the data source sync can take from a few minutes to a few hours, depending on the amount and size of data to index.</p> \n<p>You can also connect plugins that manage access to enterprise systems, including ServiceNow, Jira, Salesforce, and Zendesk. Plugins enable Amazon Q to perform user-requested tasks, such as creating support tickets or analyzing sales forecasts.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/26/2023-amazon-q-business-10.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/26/2023-amazon-q-business-10.png\" alt=\"Amazon Q\" width=\"1272\" height=\"782\" /></a></p> \n<p><strong>Preview and deploy web experience<br /> </strong>In the application overview, choose <strong>Preview web experience</strong>. This opens the web experience with the conversational interface to chat with the tailored Amazon Q AWS Blog Expert. In the final step, you deploy the Amazon Q web experience. You can integrate your SAML 2.0–compliant external identity provider (IdP) using IAM. Amazon Q can work with any IdP that’s compliant with SAML 2.0. Amazon Q uses service-initiated single sign-on (SSO) to authenticate users.</p> \n<p><span><strong>Join the preview</strong></span><br /> Amazon Q is available today in preview in AWS Regions US East (N. Virginia) and US West (Oregon). Visit the product page to learn how <a href=\"http://aws.amazon.com/q/business-expert\">Amazon Q can become your expert in your business.</a></p> \n<p>Also, check out the <a href=\"https://github.com/aws-samples/amazon-q-slack-gateway/blob/main/README.md\">Amazon Q Slack Gateway</a> GitHub repository that shows how to make Amazon Q available to users as a Slack Bot application.<a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-slack.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/25/2023-amazon-q-business-slack.png\" alt=\"Amazon Q Slack Bot\" width=\"2095\" height=\"1237\" /></a></p> \n<p><span><strong>Learn more</strong></span></p> \n<ul> \n <li><a href=\"http://aws.amazon.com/q\">Amazon Q main product page</a></li> \n <li><a href=\"http://aws.amazon.com/q/business-expert\">Amazon Q for general business use</a></li> \n</ul> \n<p>— <a href=\"https://www.linkedin.com/in/antje-barth/\" target=\"_blank\">Antje</a></p>","author":"Antje Barth","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"49d3cbcb9bdcd78dc98a7c0139c7311dade0344667c846208002b7156b239f4e","category":"Tech"}