{"title":"Samsung Unveils World's First OLED Display With Built-In Fingerprint and Blood Pressure Sensing","link":"https://www.macrumors.com/2023/05/23/samsung-sensor-oled-display-fingerprint/","date":1684842754000,"content":"Samsung Display has unveiled a new generation of OLED panel that it says can recognize fingerprints anywhere on the screen and even check the user's heart rate, blood pressure, and stress levels using multiple simultaneous finger readings.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/samsung-sensor-oled-display.jpg\" alt width=\"2500\" height=\"1622\" /><div><em>Samsung's 'Sensor OLED Display' at SID Display Week 2023</em></div>\r<br />\nUsually, fingerprint sensors in smartphones are attached under the display panel as a separate module and are only sensitive to fingerprint data within a limited portion of the screen. By contrast, Samsung's new \"Sensor OLED Display\" extends this sensitivity to the entire screen by embedding a light-sensing organic photodiode (OPD) into the panel itself. \r<br />\n\r<br />\nThe technology currently being shown off at <a href=\"https://www.displayweek.org\">SID Display Week 2023</a> opens up some exciting possibilities for future smartphones, such as multi-finger authentication (putting four fingers on the display, for example), which could offer several thousand million times stronger security than a single finger. \r<br />\n\r<br />\nAnother potential feature could be the ability to authenticate individual apps on a phone's Home Screen simply by placing a finger on the app icon to open it, replacing the need for a passcode or facial authentication.\r<br />\n\r<br />\nBut perhaps the most intriguing claim being made is the ability of the Sensor OLED Display to check cardiovascular health, including blood pressure when two fingers are used. \r<br />\n\r<br />\n\"To accurately measure a person's blood pressure, it is necessary to measure the blood pressure of both arms,\" notes <a href=\"https://global.samsungdisplay.com/31165\">Samsung Display's press release</a>. \"The Sensor OLED display can simultaneously sense the fingers of both hands, providing more accurate health information than existing wearable devices.\"\r<br />\n\r<br />\nSamsung says the system works because OLED light is reflected differently depending on the contraction and relaxation of the blood vessels inside the finger, and when it returns to the panel, the OPD is able to recognize it and converts it into a blood pressure reading.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/samsung-blood-pressure-oled.jpg\" alt width=\"3000\" height=\"1144\" /><div><em> 'Sensor OLED Display' measuring blood pressure and heart rate</em></div>\r<br />\nSamsung did not provide information on the accuracy rate or speed of its Sensor OLED display, nor did it explain whether the authentication and biometric readings could be taken at the same time, but the company clearly has confidence that the technology is destined for smartphones in the near future. \r<br />\n\r<br />\nCould it or something similar one day appear in an iPhone? It's no secret that Apple has been working on a Touch ID system designed to be set under the display since at least 2013, with <a href=\"https://www.macrumors.com/2017/02/14/apple-fingerprint-sensing-display-patent/\">several</a> patents <a href=\"https://www.macrumors.com/2016/10/04/new-apple-patent-touch-id/\">awarded</a> to the company over the years. Indeed, despite claims that under-screen Touch ID on a future iPhone is unlikely, Apple has, if anything, intensified its research in under-screen fingerprint sensing technology.\r<br />\n\r<br />\nEarlier this year, Apple was granted a <a href=\"https://www.patentlyapple.com/2023/03/apple-wins-a-touch-id-under-display-patent-focused-on-an-optical-imaging-system-that-operates-in-the-shortwave-infrared-ban.html\">patent</a> relating to under-screen Touch ID that combines shortwave infrared technology with an optical imaging system that could have multiple functions. Not only does the latest embodiment aim to read the user's fingerprint when it touches the display, it could also determine vein pattern, blood oxygenation, pulse, and the presence of gloves and wetness.\r<br />\n\r<br />\nAt this point, we can't be certain that Apple will ever put Touch ID under iPhone screens. There also remains a possibility that Apple instead introduces an iPhone with Touch ID built into a physical side button, in line with the latest iPad Air and iPad mini models, although there haven't been any rumors to suggest that Apple plans to follow that route.\r<br />\n\r<br />\nApple's roadmap for under-panel technology, as <a href=\"https://www.macrumors.com/2023/04/03/under-display-face-id-to-debut-on-iphone-17-pro/\">outlined</a> by DSCC industry consultant Ross Young, suggests we're unlikely to see an under-screen version of Touch ID in an iPhone anytime soon. Apple appears to be more focused on moving Face ID and the front-facing camera under the display, both of which it aims to achieve by 2027.<div>Tag: <a href=\"https://www.macrumors.com/guide/samsung/\">Samsung</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/23/samsung-sensor-oled-display-fingerprint/\">Samsung Unveils World's First OLED Display With Built-In Fingerprint and Blood Pressure Sensing</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/samsung-unveils-worlds-first-oled-display-with-built-in-fingerprint-and-blood-pressure-sensing.2390284/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"49d92fd7b1c95359b107572c4ff1151a31a6d11c1cbdd4720e03db9b37f9aac4","category":"Apple"}