{"title":"Spatiotemporal variation in clam recruitment among beaches in Washington State (USA)","link":"https://onlinelibrary.wiley.com/doi/10.1111/maec.12790?af=R","date":1704431995000,"content":"<h2>Abstract</h2>\n<p>Abundant clam populations provide ecosystem services and commercial and recreational shellfish harvests worldwide. Two non-native clams (Manila clams, <i>Ruditapes philippinarum</i>; eastern soft-shell clams, <i>Mya arenaria</i>) commonly populate mid-intertidal zones of coarse-sediment beaches in Washington State, USA. To better understand factors influencing their abundance, we used passive mid-intertidal spat collectors to determine the density and distribution of clam recruits (150–500 μm shell length) at eight beaches spanning over 500 km and over two reproductive seasons (2016 and 2017). Cumulative seasonal recruitment (clams &lt;500 μm) in 2016 and 2017 at +1.0 m MLLW ranged from 800 to 125,000 m<sup>−2</sup> for <i>Ruditapes philippinarum</i> and 50–85,000 m<sup>−2</sup> for <i>M. arenaria</i>, and did not differ by substrate type at small scales (gravel vs. crushed shell). At larger scales, different interannual recruitment patterns across sites did not dramatically shift the ranked order of highest and lowest recruitment sites. Cumulative recruitment tended to be lower at warmer sites, while timing of peak recruitment was not consistently related to temperature. Sites also differed in the relative recruitment of the two clam species, but most beaches had greater densities of <i>R. philippinarum</i> than <i>M. arenaria</i> at both recruitment and juvenile stages. Although recruitment densities differed by two orders of magnitude across sites, post-settlement factors eliminated initial spatial variation within a year, dampening recruitment variability among these beaches that all contribute to commercial and recreational clam production.</p>","author":"J. N. Kobelt, \nD. S. Yiu, \nM. N. Dethier, \nJ. L. Ruesink","siteTitle":"Wiley: Marine Ecology: Table of Contents","siteHash":"9aeeb02fb4d0869ca2d9b47a9c219a8693576fd84433bf6b8b40db990539dbf7","entryHash":"49e0c29cc12ff180a90458db83d1955bb80ed283f087b17c797bfb963e6c2b91","category":"Environment"}