{"title":"37 Key learnings from the improving pig survivability project","link":"https://academic.oup.com/jas/article/102/Supplement_2/237/7664855?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The Improving Pig Survivability Project has completed 5 yr encompassing research, education, and extension with the goal of reducing overall mortality in the U.S. commercial swine industry. The project is funded by National Pork Board and Foundation for Food and Agriculture Research, and continues through 2026. Team members represent institutions including Iowa State University, Kansas State University, and Purdue University. The project is guided by an advisory board consisting of US swine producers and allied industry partners. Research efforts seek to identify factors contributing to swine mortality in commercial production, and to develop strategies and information that can be utilized to reduce mortality and maximize pig survivability. Key economic findings include the first publicly available economic tool for swine producers to input their specific production information and costs, creating a farm level specific cost of mortality for both the breeding herd and post-weaning to market. Key strategies found to reduce sow mortality include: understanding late gestation body condition as thin sows in late gestation are more likely to prolapse compared with normal or overweight sows; Early intervention to monitor and treat lameness resulted in 25.4% relative reduction in annualized sow mortality in commercial settings tested; Feeding sows four 1.5-pound meals reduced farrowing assistance and reduced piglet deaths compared with ad libitum intake for 3 to 5 d before farrowing; perineal score, genetics, and microbiome risk factors for pelvic organ prolapse were identified. Key strategies found to reduce pre-weaning mortality include: colostrum should be 300 to 350 g per piglet, and a milky cheese addition during enrichment period. Key strategies found to reduce wean to finish mortality include: whole-herd analysis of 2,568 WTF closeouts revealed sow farm parameters associated with improved livability were sow farm health status and productivity associated with lower WTF mortality; Increased mortality was associated with <span>Streptococcus suis</span>, <span>Glaeserella parasuis</span>, PRRSv, <span>Mycoplasma hyopneumoniae</span> and PEDv; early maturing duroc sired pigs had reduced stress, greater feed intake, decreased % losing body weight post weaning, and greater gain during the nursery period; enrichment cubes to pigs post-weaning reduced the percentage losing body weight after weaning; feeding large pellet creep feed in lactation improved nursery pig growth and decreased fallout rates; mat feeding reduced mortality and removals; sensory attractant powder before and after weaning reduced percentage that lost body weight the first 3 d after weaning, and linoleic:linolenic acid ratio can impact gilt growth and the use of lower energy diets appears to reduce joint inflammation. In addition to grant funding, 22 additional projects were supported by in-kind industry donations/partnerships worth over $1.6 million. Resources generated are available in peer-reviewed publications, factsheets (English and Spanish), short informational videos, and podcasts (PigX). Project outcomes are available at the Improving Pig Surviability website (<a href=\"http://www.piglivability.org\">www.piglivability.org</a>).</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"49e3dceb803ad295562e1bb737387c7e35fae5ccb0b086d86d016c4ccc8eb303","category":"Environment"}