{"title":"“Dead Duck Day” marks that time a scientist witnessed gay duck necrophilia","link":"https://arstechnica.com/?p=1944360","date":1685998995000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/deadduck1-800x601.jpg\" alt=\"close-up views of dead duck specimen\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/deadduck1.jpg\">Enlarge</a> <span>/</span> This drake mallard duck has ceased to be! And suffered one final post-mortem ignominy by a fellow duck. (credit: C.W. Moeliker, 2001)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On June 5, 1995, a Dutch ornithologist named <a href=\"https://en.wikipedia.org/wiki/Kees_Moeliker\">Kees Moeliker</a> was working quietly in his office in the new wing of the Natural History Museum in Rotterdam, the Netherlands, when there was an unusually loud bang one floor below. The wing's all-glass facade sometimes took on mirror-like qualities, so there was a regular supply of birds colliding with the glass. In this case, the collision was from a <a href=\"https://en.wikipedia.org/wiki/Mallard\">drake mallard duck</a> (<em>Anas platyrhynchos</em>) lying dead on its belly in the sand.</p>\n<p>Things took an unusual turn when Moeliker spotted a second, living male mallard nearby, which began pecking at the back of the dead duck's head. After a couple of minutes, the living duck \"mounted the corpse and started to copulate, with great force,\" Moeliker recalled, only stopping for a couple of short breaks. The ornithologist managed to snap some photos of this odd behavior before intervening and collecting the dead duck specimen–over the noisy objections of its living \"mate.\" It was the first documented case of homosexual necrophilia in the species.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/deadduck3.jpg\"><img alt=\"(a) Moeliker's office in new north wing of the Natural History of Rotterdam in 1997. (b) Where the duck hit the glass facade. (c) Where Moeliker observed the &quot;homosexual necrophilia.&quot;\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/deadduck3-640x208.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/deadduck3.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/deadduck3.jpg\">(a) Moeliker's office in new north wing of the Natural History of Rotterdam in 1997. (b) Where the duck hit the glass facade. (c) Where Moeliker observed the \"homosexual necrophilia.\"</a> (credit: Christian Richters)</p></div>\n<p>Moeliker published his findings in <a href=\"https://www.hetnatuurhistorisch.nl/fileadmin/user_upload/documents-nmr/Publicaties/Deinsea/Deinsea_08/Deinsea_8_15_Moeliker_.pdf\">a 2001 paper</a> that would eventually snag him the <a href=\"https://improbable.com/ig/winners/#ig2003\">2003 Ig Nobel Prize in Biology</a>. It also inspired the annual \"<a href=\"http://www.deadduckday.com\">Dead Duck Day</a>\" celebration, held at the very spot the unfortunate duck perished, marked by a memorial plaque. The brief commemorative ceremony—which also acknowledges \"the billions of other birds that die(d) from colliding with glass buildings and challenges people to find solutions to this global problem,\" <a href=\"https://improbable.com/2023/05/28/dead-duck-day-is-approaching-again/\">per Moeliker</a>—is typically followed by a six-course duck dinner at a local Chinese restaurant called <a href=\"https://tai-wu.nl\">Tai Wu</a>. The event is co-organized by the museum and the European Bureau of Improbable Research.</p></div><p><a href=\"https://arstechnica.com/?p=1944360#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1944360&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"49e40b5105fa3a58cb6a4813763668bb42ae48a8d4571f50cacf75819f463b09","category":"Tech"}