{"title":"Predicting the Effect of miRNA on Gene Regulation to Foster Translational Multiomics Research &ndash; A Thorough Review on the Role of ChIP-Seq Data","link":"https://www.preprints.org/manuscript/202403.1127/v1","date":1711089496000,"content":"Gene regulation is vital for cellular function and homeostasis, involving diverse mechanisms controlling specific gene products and contributing to tissue-specific gene expression. Dysregulation leads to diseases, emphasizing the need for understanding these mechanisms. Non-coding regions, notably enhancers and super-enhancers (SEs), act as crucial gene regulators, orchestrating transcriptional activity via transcription factors (TFs). SEs, with high activity, are pivotal in cell identity and disease progression. Current computational approaches focus on individual regulators like TFs and miRNAs, neglecting SE interactions. We emphasize incorporating SEs into models to enhance understanding. Experimental studies have recently linked miRNAs and TFs to SEs. Chromatin immunoprecipitation followed by sequencing (ChIP-Seq) provides valuable SE information. In this review, we categorize computational methods leveraging TF and miRNA data into three areas and explore challenges integrating enhancers/SEs. These include unraveling indirect regulatory networks, identifying network motifs, and enriching pathway identification by dissecting gene regulators, including SEs. We hypothesize that addressing these challenges will enhance our understanding of gene regulation, aiding in identifying therapeutic targets and disease biomarkers. We believe that understanding the role of ChIP-Seq data in predicting the effect of miRNA on gene regulation is crucial to construct statistical/computational model that would tackle these challenges.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"49e5aee278b0f6c55e1f9024ecc8eab2e7d1696566888560f66f8bcf1a8365dd","category":"Interdisciplinary"}