{"title":"Adaptation of the Client Diagnostic Questionnaire for East Africa","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001756","date":1710856800000,"content":"<p>by Edith Kamaru Kwobah, Suzanne Goodrich, Jayne Lewis Kulzer, Michael Kanyesigye, Sarah Obatsa, Julius Cheruiyot, Lorna Kiprono, Colma Kibet, Felix Ochieng, Elizabeth A. Bukusi, Susan Ofner, Steven A. Brown, Constantin T. Yiannoutsos, Lukoye Atwoli, Kara Wools-Kaloustian</p>\r\n\r\nResearch increasingly involves cross-cultural work with non-English-speaking populations, necessitating translation and cultural validation of research tools. This paper describes the process of translating and criterion validation of the Client Diagnostic Questionnaire (CDQ) for use in a multisite study in Kenya and Uganda. The English CDQ was translated into Swahili, Dholuo (Kenya) and Runyankole/Rukiga (Uganda) by expert translators. The translated documents underwent face validation by a bilingual committee, who resolved unclear statements, agreed on final translations and reviewed back translations to English. A diagnostic interview by a mental health specialist was used for criterion validation, and Kappa statistics assessed the strength of agreement between non-specialist scores and mental health professionals’ diagnoses. Achieving semantic equivalence between translations was a challenge. Validation analysis was done with 30 participants at each site (median age 32.3 years (IQR = (26.5, 36.3)); 58 (64.4%) female). The sensitivity was 86.7%, specificity 64.4%, positive predictive value 70.9% and negative predictive value 82.9%. Diagnostic accuracy by the non-specialist was 75.6%. Agreement was substantial for major depressive episode and positive alcohol (past 6 months) and alcohol abuse (past 30 days). Agreement was moderate for other depressive disorders, panic disorder and psychosis screen; fair for generalized anxiety, drug abuse (past 6 months) and Post Traumatic Stress Disorder (PTSD); and poor for drug abuse (past 30 days). Variability of agreement between sites was seen for drug use (past 6 months) and PTSD. Our study successfully adapted the CDQ for use among people living with HIV in East Africa. We established that trained non-specialists can use the CDQ to screen for common mental health and substance use disorders with reasonable accuracy. Its use has the potential to increase case identification, improve linkage to mental healthcare, and improve outcomes. We recommend further studies to establish the psychometric properties of the translated tool.","author":"Edith Kamaru Kwobah","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"49f3a2d008fa1de83eacd3531631d603eb7705204b7afd2c35fc717033673772","category":"Environment"}