{"title":"How to master the attack position: MTB body position explained","link":"https://www.bikeradar.com/advice/skills/mtb-attack-position/","date":1620237600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2019/03/1436945596724-l5644vkz3d25-8f3eb1e.jpg?quality=90&amp;resize=620,413\" />                                            <p>The attack position (sometimes referred to as the ready position) is a fundamental aspect of mountain biking. As with all key MTB skills, getting it right will reward the rider with a more comfortable and controlled ride. Get it wrong and, well, at best you’ll be uncomfortable on the bike and at worst you run the risk of crashing.</p>\n<p>When the trail gets rough your bike will start to buck and move around. The idea of a good body position is to isolate your core mass (head and torso) from this chatter so you can stay smooth, in control and in balance.</p>\n<p>Use these tips to put yourself in a position where you can let the bike move beneath you, so you can stay in balance and relaxed.</p>\n<ul><li><a href=\"http://www.bikeradar.com/mtb/gear/article/how-to-ride-rocky-sections-44972/\">How to ride rocky sections</a></li>\n<li><a href=\"http://www.bikeradar.com/mtb/gear/article/how-to-jump-a-mountain-bike-16024/\">How to jump a mountain bike</a></li>\n<li><a href=\"http://www.bikeradar.com/blog/article/how-to-ride-drop-offs-with-confidence-44652/\">How to ride drop-offs</a></li>\n</ul><h2>1. Your basic ‘ready’ or ‘attack’ position</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> This is the basic ‘ready’ or ‘attack’ position for mountain biking.</span></figcaption><span></span></div>\n<h4>Loosen up</h4>\n<p>If you’re in balance, you can loosen up and allow the bike to move around underneath you and track the terrain. Use your arms and legs like suspension by absorbing undulations on the trail.</p>\n<h4>Stand up</h4>\n<p>It goes without saying that if you sit down on rough terrain you’re going to feel like you’re riding a bucking bronco! Stand up, lower your chest, and keep a slight bend in your knees for extra control. Drop your saddle to get it out of the way, if you’re bike has a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">dropper post</a>.</p>\n<h4>Weight distribution</h4>\n<p>Drop your heels and support your core mass with your legs and not your hands. This will get your weight low at the bottom bracket, which is stable, and free your arms up for control and steering, rather than taking all your weight. Think heavy feet, light hands.</p>\n<h4>Heels down</h4>\n<p>With your cranks perfectly level, place the ball of your foot on the pedal axle or just in front of it, in a mid-foot position, and drop your heels towards the ground.</p>\n<h4>Head up</h4>\n<p>Your head position affects your balance so get your chin up and focus on the trail ahead. Try not to look down at the front wheel because this will unbalance you straight away. Look down the trail, where you want to go.</p>\n<h4>Elbows up</h4>\n<p>Bend your elbows and hold them up so you can use your arms to control and lean the bike.</p>\n<h4>Engage your core</h4>\n<p>Try not to round your lower back like you’re slouched in a chair because it isn’t good for power and efficiency when it comes to more advanced skills. Stick your backside out and engage your core muscles.</p>\n<h4>Cover your brakes</h4>\n<p>Always keep your anchors covered with one finger just in case you need to scrub speed or stop quickly.</p>\n<h2>2. Your climbing position</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Weight distribution is crucial when climbing.</span></figcaption><span></span></div>\n<p>Having a good body position, in combination with managing your power output, can make climbs more manageable, whether long ascents or short, sharp rises.</p>\n<p>The aim is to balance your weight between the front and rear wheels, so you have traction at the rear and maintain a bit of weight on the front wheel to stop it from lifting or wandering.</p>\n<h4>Get low</h4>\n<p>Lower your chest towards the bar, move your hips forward on the saddle, tuck your elbows in and look up. If your hands feel light and you’re not hanging off the bar then you’re probably in the right place. Getting your chest low will keep some weight on your front wheel so you can maintain your steering.</p>\n<h4>Sit… or stand</h4>\n<p>In most cases, it’s more efficient to sit, but you may want to stand for a break or if you need to put more power down. On rough terrain hover just above your normal seated position so you can absorb bumps and the bike can move around underneath you.</p>\n<h4>Manage power output</h4>\n<p>It’s important not to burn yourself out quickly, so relax and try to maintain a good average power for the whole climb, rather than sprinting then freewheeling. You’ll need to carry as much momentum as possible into short steep climbs, so make sure you put the power down early.</p>\n<h4>Gear selection</h4>\n<p>On long climbs, aim to spin your legs for better efficiency. If you need extra traction on loose terrain, over-gear slightly by using a higher gear so you don’t spin out.</p>\n<h2>3. Body position riding downhill</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Move your hips back when descending.</span></figcaption><span></span></div>\n<p>The core principles of your basic body position remain largely the same when riding downhill. Effectively the front wheel has pitched away from you, so you need to lower your chest in order to keep bent elbows, which lets the bike move around.</p>\n<p>The most important thing is to keep your heels down and your core mass over your feet and not in your hands. Do this by moving your hips back towards the rear tyre.</p>\n<h4>Look ahead</h4>\n<p>Look as far ahead as you can down the trail to spot obstacles in good time. Lifting your head will help you do this.</p>\n<h4>Bend your elbows</h4>\n<p>Bent elbows make you ready to absorb hits and manipulate the bike. Don’t overbend though, or you’ll run out of ‘arm travel’.</p>\n<h4>Keep your heels down</h4>\n<p>Dropping your heels gives you more control – your bike is pushed into your feet, putting more weight on your pedals.</p>\n<h4>Cover your brakes</h4>\n<p>Powerful brakes help you stop with ease. One finger on the levers is enough and won’t compromise your grip on the bar.</p>\n<h4>Stay loose</h4>\n<p>The looser you feel on the bike, the more relaxed you become. This helps you absorb hits with your elbows and knees, which lets the bike track the terrain.</p>\n<h2>4. Your braking position</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dipping your heels will make sure your body weight goes through your cranks.</span></figcaption><span> <i>Mick Kirkman</i></span></div>\n<p>Braking effectively and at the right time will help you ride safely and smoothly while maintaining speed.</p>\n<p>Use both brakes smoothly and equally, on the whole, to control your speed. When you brake, your body position will move forwards and onto the bar, so counteract this by dipping your heels.</p>\n<p>Try to avoid constantly dragging your brakes because your <a href=\"https://www.bikeradar.com/advice/workshop/how-to-set-up-your-mountain-bike-suspension-video-guides-to-help-you-get-the-most-from-your-bike/\">suspension</a> won’t work effectively when you do and you won’t be able to stay loose.</p>\n<h4>Stay smooth</h4>\n<p>Braking affects your body position and suspension, so try to brake before technical or rough sections of trail if you want to ride smoother.</p>\n<h4>Look for traction</h4>\n<p>Spot grippy surfaces to brake on. Try to avoid braking on loose and slippery terrain because it will unbalance you.</p>\n<h4>Brake straight</h4>\n<p>Scrub your speed before corners, when you can brake in a relatively straight line. Try not to brake around corners because you risk losing traction and it will prevent you from leaning the bike.</p>","author":"Joe Rafferty","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"49f71c9aeb7d39372a47fc7519477221e0e50cea0ba559ec51ccb3a1d5f45552","category":"Cycling"}