{"title":"Best cycling books | BikeRadar’s reading list for cycling bookworms","link":"https://www.bikeradar.com/advice/buyers-guides/best-cycling-books/","date":1618239180000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2019/07/Books-about-pro-racing-1da214e.jpg?quality=90&amp;resize=620,413\" />                                            <p>Whether you’re seeking out a cycling book to get lost in, are in search of inspiration or advice, or looking to buy a gift for a cycling bookworm, we’ve got you covered. These are the best cycling books, according to the BikeRadar team.</p>\n<p>From historical tales of the <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> and epic trans-continental adventures, to training and nutrition guides and beautiful coffee table books, there’s bound to be something here for everyone.</p>\n<p>Because the selection is so vast, we’ve broken our picks down into categories that should help you narrow down your choices to something you’re sure to love.</p>\n<p>Click one of the links below to fast-track to a particular section, or read on to browse the whole list.</p>\n<section><div>\n        <ul><li><span><a href=\"#racing\">Books about pro racing</a></span></li>\n<li><span><a href=\"#biographies\">Biographies and autobiographies</a></span></li>\n<li><span><a href=\"#adventure\">Adventure planning</a></span></li>\n<li><span><a href=\"#journeys\">Inspiring journeys and travelogues</a></span></li>\n<li><span><a href=\"#nutrition\">Nutrition and training books</a></span></li>\n<li><span><a href=\"#history\">Books about cycling history</a></span></li>\n<li><span><a href=\"#coffee\">Coffee table books</a></span></li>\n</ul><p>\n\n    </p></div>\n    </section><p><a></a></p>\n<h2>Cycling books about pro racing</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Let your roadie friend get lost in stories of the great races.</span></figcaption><span> <i>Various</i></span></div>\n<p>If you’re buying for someone who is an avid follower of the racing each year, they’re sure to enjoy one of the many books that celebrate the best of the race calendar.</p>\n<h4><em>The Official History of the Tour de France</em>, Serge Laget</h4>\n<p>A celebration of the world’s most famous endurance event in the calendar, with stories from each major era of the race, more than 300 photographs (some dating way back to the 19th century), copies of souvenir brochures, period newspaper articles, posters, stickers, postcards and much more.</p>\n<ul><li>RRP £20 / $29.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Road Book 2020</em>, Ned Boulting (ed.)</h4>\n<p>This cycling almanac is something of a bible for roadies. It contains information about every single WorldTour race in the year, along with essays from leading cycling figures, team profiles, and everything else the ultimate cycling fan could want.</p>\n<ul><li>RRP £50</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Yellow Jersey</em>, Peter Cossins</h4>\n<p>Arguably the most iconic garment in all of the cycling world, the yellow jersey is now 100 years old. This book is its tribute, featuring interviews with many of its wearers, including Chris Froome, Thomas Voeckler and Antonin Rolland.</p>\n<ul><li>RRP £25 / $28.53</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Lanterne Rouge: The Last Man in the Tour de France</em>, Max Leonard</h4>\n<p>At the other end of the scale is the Lanterne Rouge, the rider placed last in the Tour, and rarely the name that gets remembered. However, there are some brilliant stories to be told, such as the breakaway leader who took a wrong turn and a drug doper slowed down by his own cocktail.</p>\n<ul><li>RRP £10.99 / $22.15</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Giro d’Italia: The Story of the World’s Most Beautiful Bike Race</em>, Colin O’Brien</h4>\n<p>Italy’s answer to the Tour de France, the <a href=\"https://www.bikeradar.com/news/how-to-watch-the-giro-ditalia/\">Giro d’Italia</a>, comes with plenty of drama and lively characters. This book tells many stories about suffering, feuds and betrayals, tradition under threat, and the heroism of the riders themselves.</p>\n<ul><li>RRP £9.99 / $11.45</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Monuments: The Grit and the Glory of Cycling’s Greatest One-day Races</em>, Peter Cossins</h4>\n<p>The Monuments are brutal one-day races prized by the pros, and for good reason: they’re the longest, toughest and usually the dirtiest. Peter Cossins details the turbulent history of these iconic races and the riders immortalised by them.</p>\n<ul><li>RRP £9.99 / $12</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>To Hell on a Bike: Riding Paris-Roubaix – the Toughest Race in Cycling</em>, Iain MacGregor</h4>\n<p>They call it the ‘Hell of the North’ for a reason. In this book, Iain MacGregor takes on the brutal challenge of riding the Paris-Roubaix course, while exploring its history and culture, and gaining insights from some of its legends.</p>\n<ul><li>RRP £9.99 / $9.28</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<p><a></a></p>\n<h2>Cycling biographies and autobiographies</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> There are plenty of fascinating characters in cycling – how about a biography?</span></figcaption><span> <i>Various</i></span></div>\n<p>If you’re buying for someone who idolises one of cycling’s many characters, then the story of their life makes a thoughtful present.</p>\n<h4><em>The Tour According to G: My Journey to the Yellow Jersey</em>, Geraint Thomas</h4>\n<p>The story of how Geraint Thomas finally got his yellow jersey after years of bad luck, crashes and self-sacrifice.</p>\n<ul><li>RRP £8.99 / $28</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>My World</em>, Peter Sagan</h4>\n<p>Sagan is not only one of the greatest riders of all time, he’s probably one of the most entertaining as well. His autobiography offers a glimpse behind the scenes and into his world of mischief.</p>\n<ul><li>RRP £9.99 / $19.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Merckx: Half Man, Half Bike</em>, William Fotheringham</h4>\n<p>Eddy ‘The Cannibal’ Merckx has a half-told story. Behind the legend lay a sensitive and anxious man who suffered horrific injury, doping controversy and tragedy.</p>\n<ul><li>RRP £10.99 / $19.99</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Climb: The Autobiography</em>, Chris Froome</h4>\n<p>Chris Froome’s autobiography takes us from the dusty roads of Kenya, where he was born, to his second time winning the Tour de France.</p>\n<ul><li>RRP £9.99 / $17.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Breakaway</em>, Nicole Cooke</h4>\n<p>Nicole Cooke’s autobiography tells the damning tale of her struggle to gain the recognition and riches that came so effortlessly to her male counterparts during cycling’s darkest period of doping.</p>\n<ul><li>RRP £10.99 / $12.81</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Greatest: The Times and Life of Beryl Burton</em>, William Fotheringham</h4>\n<p>Beryl Burton is one of the biggest names in women’s racing in the UK, dominating the sport during the ’60s and ’70s. This biography was published to coincide with this year’s World Championships in Yorkshire and explores the life behind the legend.</p>\n<ul><li>RRP £20</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Death of Marco Pantani: A Biography</em>, Matt Rendell</h4>\n<p>Pantani’s death in a cheap hotel sent shockwaves through the cycling community who knew him as the iconic double-winner of the Tour and Giro in 1998. Drawing upon his own experience of Pantani, while also speaking to his psychoanalysts, family and friends, Matt Rendell tells the full story of Pantani’s short but explosive career.</p>\n<ul><li>RRP £9.99 / $17.99</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<p><a></a></p>\n<h2>Books about adventure planning</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Help the bikepacker or Alpine climber in your life plan their next adventure.</span></figcaption><span> <i>Various</i></span></div>\n<p>The only thing greater than going on an adventure is planning it. So, if you’re buying for a bivvying bikepacker or a masochistic mountain climber, there’s bound to be something here that gets them excited to plan the next big ride.</p>\n<h4><em>Bikepacking: Mountain Bike Camping Adventures on the Wild Trails of Britain</em>, Laurence McJannet</h4>\n<p>This beautiful book offers an array of off-road routes in the UK, separated by region, and provides suggestions of where to eat and where to stay if camping’s not an option.</p>\n<ul><li>RRP £16.99 / $24.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Microadventures: Local Discoveries for Great Escapes</em>, Alastair Humphreys</h4>\n<p>If your giftee is more limited in time and resources, then introduce them to the world of microadventuring – something cheap, simple and close to home.</p>\n<ul><li>RRP £16.99 / $21.99</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Escape by Bike: Adventure Cycling, Bikepacking and Touring Off-Road,</em> Joshua Cunningham</h4>\n<p>After cycling from London to Hong Kong over 11 months and passing through 26 countries, Joshua Cunningham offers up some of the best practical advice for planning adventures abroad, from making travel arrangements to packing and navigating.</p>\n<ul><li>RRP £19.95 / $29.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Scottish Bothy Bible: The Complete Guide to Scotland’s Bothies and How to Reach Them</em>, Geoff Allan</h4>\n<p>If your bikepacking friend is planning a stint in Scotland, why not get them the ultimate guide to Scottish bothies? It will both inspire their plans and help them find shelter when it’s needed.</p>\n<ul><li>RRP £16.99 / $24.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Lost Lanes series</em>, Jack Thurston</h4>\n<p>If they’re more of an on-road explorer, Jack Thurston’s series of Lost Lanes books provides a multitude of routes to enjoy in the UK. The books also come with downloadable GPX tracks. As well as Southern England, Thurston has produced books devoted to the lost lanes of the <a href=\"https://www.amazon.co.uk/gp/product/1910636134/ref=dbs_a_def_rwt_bibl_vppi_i1/?tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">West Country</a> and <a href=\"https://www.amazon.co.uk/gp/product/1910636037/ref=dbs_a_def_rwt_bibl_vppi_i2/?tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">Wales</a>.</p>\n<ul><li>RRP £14.99 / $24.95</li>\n<li>Buy now from <a href=\"https://www.amazon.co.uk/Lost-Lanes-Glorious-Southern-South-East/dp/0957157312/?tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">Amazon</a> (<a href=\"https://www.amazon.co.uk/Lost-Lanes-Glorious-Southern-South-East/dp/0957157312/?tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">£9.53</a>)</li>\n</ul><h4><em>Britain’s Greatest Cycling Climbs</em>, Simon Warren</h4>\n<p>Simon Warren may well be Britain’s most accomplished hill climber, having produced eight regional climbing guides for the UK, covering the South East and West, the North East and West, the Midlands, Yorkshire, Scotland and Wales. And that’s not even mentioning his other books on <a href=\"https://go.skimresources.com?id=71026X1519955&amp;xs=1&amp;url=https%3A%2F%2Fwww.waterstones.com%2Fbook%2F100-greatest-cycling-climbs-of-italy%2Fsimon-warren%2F9781472143051\" target=\"_blank\">Italy</a>, <a href=\"https://go.skimresources.com?id=71026X1519955&amp;xs=1&amp;url=https%3A%2F%2Fwww.waterstones.com%2Fbook%2Fhellingen%2Fsimon-warren%2F9781472144096\" target=\"_blank\">Belgium</a> and the <a href=\"https://www.amazon.co.uk/Greatest-Cycling-Climbs-Tour-France/dp/0711234825/?tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">Tour de France</a>.</p>\n<ul><li>RRP £50 / $65</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Ultimate Etapes: Ride Europe’s Greatest Cycling Stages</em>, Peter Cossins</h4>\n<p>Have your friend raring to ride the best routes in Europe with this essential guide to the most renowned stages of modern cycling. It’s aimed at all abilities and provides detailed route descriptions, maps, elevation profiles and suggestions for other rides in the same region.</p>\n<ul><li>\n<ul><li>RRP £20 / $29.99</li>\n</ul></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Epic Bike Rides of the World</em>, Lonely Planet</h4>\n<p>Organised by continent, this Lonely Planet book details 200 amazing rides the world has to offer. Each route comes with a map, practical advice and stunning photography. This hardback is beautiful and doubles up as a great coffee table book as well.</p>\n<ul><li>RRP £14.99 / $35</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<p><a></a></p>\n<h2>Inspiring cycling journeys and travelogues</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> If they dream of seeing the world, they can do so vicariously for now.</span></figcaption><span> <i>Various</i></span></div>\n<p>We all love to hear other people’s stories, don’t we? If you’re buying for someone who is yearning to challenge themselves, one of the best things you can do is introduce them to someone who’s already done it – let an inspirational story plant the seed.</p>\n<h4><em>End to End, </em>Paul Jones</h4>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>5.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<p>Ostensibly about chasing the Roads Records Association end-to-end record (riding ~850 miles along the length of Britain from Land’s End to John O’ Groats), the stories and people in the book are captivating, raw and very funny.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/accessories/books/end-to-end-book-review/\" target=\"_blank\">Read our full review of <em>End to End</em></a></li>\n<li>RRP £16.99</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Where There’s a Will: Hope, Grief and Endurance in a Cycle Race Across a Continent</em>, Emily Chappell</h4>\n<p>Emily Chappell is an accomplished ultra-endurance racer, having competed in a multitude of events such as the Strathpuffer, the <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/lauf-anywhere-weekend-warrior-edition-long-term-review/\">Transatlantic Way</a>, and most notably, winning the Transcontinental Race in 2016. Her latest book is a truly relatable story about self-doubt, self-discovery, grief and achieving what at first seems impossible.</p>\n<ul><li>RRP £14.99 / $17.64</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4>Mind is the Ride, Jet McDonald</h4>\n<p>Jet McDonald’s amalgamation of cycle touring, bike anatomy and philosophy is a truly unique reading experience that will have its reader quoting Descartes while pondering the inner workings of their bottom bracket, all while cycling to India.</p>\n<ul><li>RRP £16.99 / $19.03</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>One More Croissant for the Road</em>, Felicity Cloake</h4>\n<p>This is one that’s written in every cyclist’s language. Felicity Cloake cycled 2,300km across France while tasting the best of its culinary offerings along the way. A delightful rendition of her epic journey that will leave your giftee hankering for a bike tour and a madeleine.</p>\n<ul><li>RRP £14.99 / $13.88</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Conversations from Land’s End to John O’Groats</em>, Nick Hand</h4>\n<p>Nick Hand’s bike is no ordinary bike – it’s a printing press. Taking it on a LEJOG adventure, he recorded conversations with people he met along the way and printed them. The resulting book is a quaint selection of encounters, along with some stunning photography.</p>\n<ul><li>RRP £16</li>\n<li>Buy now from <a href=\"https://go.skimresources.com?id=71026X1519955&amp;xs=1&amp;url=https%3A%2F%2Fwww.departmentofsmallworks.co.uk%2Fshop%2Fconversations-from-landsend-to-johnogroats\" target=\"_blank\">The Letterpress Collective</a> (<a href=\"https://go.skimresources.com?id=71026X1519955&amp;xs=1&amp;url=https%3A%2F%2Fwww.departmentofsmallworks.co.uk%2Fshop%2Fconversations-from-landsend-to-johnogroats\" target=\"_blank\">£16</a>)</li>\n</ul><h4>T<em>he Cyclist Who Went Out in the Cold: Adventures Along the Iron Curtain Trail</em>, Tim Moore</h4>\n<p>Tim Moore is arguably the two-wheel equivalent of Bill Bryson. In this instalment he takes a small-wheeled, two-geared shopper bike along the 9,000km Iron Curtain trail. Need I say more?</p>\n<ul><li>RRP £8.99 / $16.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>With the Sun on our Right</em>, Tim Moss</h4>\n<p>While there are many round-the-world cycling stories out there, what makes With the Sun on our Right unique is the focus it places on personal encounters, and the true hospitable nature of people. If that’s not enough, it’s a refreshing insight into Moss’s mental health, which will hopefully enable other men to open up about this important topic.</p>\n<ul><li>RRP £12 / $15.85</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Back in the Frame: How to Get Back on your Bike, Whatever Life Throws at You</em>, Jools Walker</h4>\n<p>Lady Vélo, as she’s also known, offers up a charming story of falling back in love with cycling after a long absence. From her first wobbly days on her Pashley Princess, to taking on the Eroica, she talks openly about how cycling impacts her mental health and how she carved a space for herself as a woman of colour in a very white and male dominated industry.</p>\n<ul><li>RRP £8.99 / $21.99</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<p><a></a></p>\n<h2>Cycling nutrition and training books</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> For a more practical approach, get them something to help with their training.</span></figcaption><span> <i>Various</i></span></div>\n<p>Perhaps you’ve got a friend or loved one who’s training for a particular event and needs a little push in the right direction. Help them find some practical advice in these guides to training and nutrition, aimed specifically at cyclists.</p>\n<h4><em>The Cycling Chef: Recipes for Performance and Pleasure</em>, Alan Murchison</h4>\n<p>Alan Murchison is a Michelin-starred chef who also happens to be a champion athlete. He now cooks for British Cycling athletes, and in this book he shares 65 recipes for nutritionally balanced, fuelling meals.</p>\n<ul><li>RRP £22 / $34</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Cycling Mind: The Psychological Skills for Peak Performance on the Bike – and in Life</em>, Ruth Anderson</h4>\n<p>Ruth Anderson is British Cycling’s Lead Psychologist and she knows a thing or two about the mental barriers that can disrupt performance. In The Cycling Mind she details the athlete’s psychological journey from training to competing, offering practical guidelines to keep moving forward in the most trying times.</p>\n<ul><li>RRP £14.99 / $19.81</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Fast After 50: How to Race Strong for the Rest of Your Life</em>, Joe Friel</h4>\n<p>Who says you have to slow down as you get older? Fast After 50 was written for endurance athletes who want to keep pushing themselves beyond what would normally be considered their peak. It offers high-intensity workouts, strength training, cross-training, recovery and performance-enhancing nutrition.</p>\n<ul><li>RRP £17.99 / $21.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Cyclist’s Training Bible: <span>The World’s Most Comprehensive Training Guide</span>,</em> Joe Friel</h4>\n<p>Now in its fifth edition, this comprehensive guide will help aspiring cyclists to develop a personal training plan and equip them with all the information they need while planning their next big challenge.</p>\n<ul><li>RRP £21.99 / $26.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Science of the Tour de France: Training Secrets of the World’s Best Cyclists,</em> James Witts</h4>\n<p>Give them the push they need to level up. This book includes insights from the likes of Marcel Kittel, Peter Sagan and Bauke Mollema, and covers the pioneering science behind the pros, from using power meters to race strategy.</p>\n<ul><li>RRP £16.99 / $24</li>\n<li>Buy now from <a href=\"https://go.skimresources.com?id=71026X1519955&amp;xs=1&amp;url=https%3A%2F%2Fwww.whsmith.co.uk%2Fproducts%2Fthe-science-of-the-tour-de-france-training-secrets-of-the-worlds-best-%2Fjames-witts%2Fpaperback%2F9781472921703.html\" target=\"_blank\">WHSmith</a> (<a href=\"https://go.skimresources.com?id=71026X1519955&amp;xs=1&amp;url=https%3A%2F%2Fwww.whsmith.co.uk%2Fproducts%2Fthe-science-of-the-tour-de-france-training-secrets-of-the-worlds-best-%2Fjames-witts%2Fpaperback%2F9781472921703.html\" target=\"_blank\">£11.89</a>)</li>\n</ul><h4><em>Fuelling the Cycling Revolution: The Nutritional Strategies and Recipes Behind Grand Tour Wins and Olympic Gold Medals</em>, Nigel Mitchell</h4>\n<p>Nigel Mitchell is head of nutrition for EF Education First Pro Cycling team, and his book is a practical toolkit for any cyclist looking to eat their way to improved performance. It cuts out the pseudo-science and features anecdotes and case studies from real riders.<br /><a></a></p>\n<ul><li>RRP £16.99 / $25</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<p><a></a></p>\n<h2>Books about cycling history</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Treat the cycling nerd in your life to some riveting reads.</span></figcaption><span> <i>Various</i></span></div>\n<p>When you’re passionate about a subject, you might want to devour everything that’s ever been written about it. If you know someone who feels this way about cycling, treat them to something they can really sink their teeth into.</p>\n<h4><em>Bikes and Bloomers: Victorian Women Inventors and their Extraordinary Cycle Wear</em>, Kat Jungnickel</h4>\n<p>A cycling history book with a difference, Bikes and Bloomers traces the evolution of women’s cycling kit and tells the story of how the humble bicycle contributed to women’s liberation. It draws on in-depth archival research and reminds us just how far we’ve come.</p>\n<ul><li>RRP £25 / $21.95</li>\n<li>Buy now from <a href=\"https://www.amazon.co.uk/Bikes-Bloomers-Victorian-Extraordinary-Goldsmiths/dp/1906897751/?tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">Amazon</a> (<a href=\"https://www.amazon.co.uk/Bikes-Bloomers-Victorian-Extraordinary-Goldsmiths/dp/1906897751/?tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">£10.95</a>)</li>\n</ul><h4><em>Cycling and Cinema</em>, Bruce Bennett</h4>\n<p>Bruce Bennett delves into the history of the bicycle in cinema, covering all manner of films from slapstick comedies of the early 20th century to Hollywood blockbusters, and everything in between. Throughout, Bennett makes the case that on top of being a source of fun and a means of transportation, the bike is a vehicle of social and political transformation.</p>\n<ul><li>RRP £25 / $30</li>\n<li>Buy now from <a href=\"https://go.skimresources.com?id=71026X1519955&amp;xs=1&amp;url=https%3A%2F%2Fwordery.com%2Fcycling-and-cinema-bruce-bennett-9781906897994\" target=\"_blank\">Wordery</a> (<a href=\"https://go.skimresources.com?id=71026X1519955&amp;xs=1&amp;url=https%3A%2F%2Fwordery.com%2Fcycling-and-cinema-bruce-bennett-9781906897994\" target=\"_blank\">£23.08</a>)</li>\n</ul><h4><em>The End of the Road: The Festina Affair and the Tour that Almost Wrecked Cycling</em>, Alasdair Fotheringham</h4>\n<p>The 1998 Tour de France was not without its drama. This retelling of what’s become known as the Festina affair – when sports physiotherapist Willy Voet was arrested on the French-Belgian border mid-race – is the first English-language book that delves deep into the subject.</p>\n<ul><li>RRP £9.99 / $9.90</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Revolution: How the Bicycle Reinvented Modern Britain</em>, William Manners</h4>\n<p>Manners’ debut book charts the role of cycling in 1980s Britain, from its influence on fashion to the freedom of movement it offered, this well-researched history is as entertaining as it is informative.</p>\n<ul><li>RRP £9.99 / $13.55</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Women on the Move: The Forgotten Era of Women’s Bicycle Racing</em>, Roger Gilles</h4>\n<p>Staying in the 1890s but heading across the Atlantic, Roger Gilles looks at the early days of women’s racing and in particular how it thrived from 1895 to 1902. He tells the stories of some of the best female racers of the time: Lizzie Glaw, Tillie Anderson and Dottie Farnsworth to name a few.</p>\n<ul><li>RRP £24.99 / $29.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Three Weeks, Eight Seconds: The Epic Tour de France of 1989</em>, Nige Tassell</h4>\n<p>Another account of a notorious Tour, the 1989 Tour de France saw Greg LeMond beat Laurent Fignon to the finish line by 50 seconds. The two rivals had been battling it out for three weeks, with the yellow jersey being passed back and forth, and Nige Tassell brings this astonishing story to life.</p>\n<ul><li>RRP £9.99 / $14.55</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Great Bike Race: The Classic, Acclaimed Book that Introduced a Nation to the Tour De Franc</em>e, Geoffrey Nicholson</h4>\n<p>First published in 1977, The Great Bike Race is hailed as the benchmark English-language book about the Tour de France and has been reprinted this year for more people to enjoy. It was the original book that introduced us to the Tour outside of France, telling the story of the 1976 race in all its glory.</p>\n<ul><li>RRP £8.99 / $12.79</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<p><a></a></p>\n<h2>Cycling coffee table books</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> If you have a friend who loves showing off their passion for cycling, a nice big hardback will do the trick.</span></figcaption><span> <i>Various</i></span></div>\n<p>If you’re really not sure what sort of book to buy the cyclist in your life, you can’t go wrong with a big, hardback book full of beautiful photographs or silly cycling cartoons.</p>\n<h4><em>The Rough-Stuff Fellowship Archive</em>, Mark Hudson</h4>\n<p>The Rough-Stuff Fellowship was founded in 1955 and is the oldest off-road cycling club in the world. In this amazing book, its archive is shared with the world, including stunning imagery and hand-drawn maps and documents. It’s a true treasure trove from a bygone era.</p>\n<ul><li>RRP £30 / $40.20</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>A History of Cycling in 100 Objects</em>, Suze Clemitson</h4>\n<p>Whether you want to bust out some factoids at the dinner table or answer an onslaught of questions about the sport you love so much, this book can be handy to keep around the house. Why is it a yellow jersey? How did bloomers influence bicycle design? How did Graeme Obree’s ‘Old Faithful’ get its nickname? Give someone the answers.</p>\n<ul><li>RRP £20 / $35</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>The Cycling Cartoonist: An Illustrated Guide to Life on Two Wheels</em>, Dave Walker</h4>\n<p>Dave Walker’s cartoons will resonate with any cyclist who gets this book. As a true N+1 advocate, Walker makes some great observations about the habits of cyclists, offering a great opportunity to have a chuckle and stop taking themselves so seriously.</p>\n<ul><li>RRP £10.99 / $15</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Queens of Pain: Legends and Rebels of Cycling</em>, Isabel Best</h4>\n<p>Published by Rapha Editions, you know it’s going to look good. Queens of Pain charts the history of women’s pro-racing from the 1890s to the 1990s, and traces the stories of its heroines back to their roots as stunt women, speed skaters, mothers, shop assistance and delivery girls.</p>\n<ul><li>RRP £25</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Mountains: Epic Cycling Climbs</em>, Michael Blann</h4>\n<p>If your giftee is at home in the mountains, then help them bring the mountains home with them. This luxury coffee table book contains stunning photographs taken over a three-year period to chart the most famous European cycling climbs. These are printed alongside personal recollections from the likes of Greg LeMond, Lizzie Armistead, Geraint Thomas, and many more.</p>\n<ul><li>RRP £34.95 / $50</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h4><em>Cyclepedia: A Tour of Iconic Bicycle Designs</em>, Michael Embacher</h4>\n<p>Anyone who appreciates the aesthetic of a beautiful bike will love this book. It contains a unique collection of over 250 bicycles that demonstrate just how much bikes have evolved. It’s carefully curated selection of some of the most beautiful bicycles around the world, and is a true homage to our love of all things two-wheeled.</p>\n<ul><li>RRP £14.95 / $19.95</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>","author":"Mildred Locke","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"49fa02938750a226f342b514bc6363419f165184e8d749eab98e9f138999257e","category":"Cycling"}