{"title":"Watershed, lake, and food web factors influence diazotrophic cyanobacteria in mountain lakes","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12523?af=R","date":1706960100000,"content":"<h2>Abstract</h2>\n<p>Cyanobacterial blooms can occur in freshwater ecosystems largely isolated from development and not experiencing extensive cultural eutrophication. For example, remote mountain lakes can experience intense blooms of diazotrophic (nitrogen-fixing) cyanobacteria caused by factors acting at different spatial and temporal scales. In this study, we examined how cross-scale interactions among watershed, lake, and food web characteristics influence diazotrophic cyanobacteria biovolume in mountain lakes. We quantified diazotrophic cyanobacteria biovolume, zooplankton abundance, and physico-chemical variables for 29 lakes in the Cascade Mountains of Oregon, USA, in summer 2019. Watershed characteristics were compiled from historical datasets available for the region. Diazotrophic cyanobacteria biovolume ranged across the lakes from 0 to 1,930,000 <i>μ</i>m<sup>3</sup> mL<sup>−1</sup>; <i>Dolichospermum</i> was the most common genus. Random forest models showed that 11 watershed, lake, and food web characteristics explained 76% of the variance in diazotrophic cyanobacteria biovolume among the sampled lakes. Structural equation models suggested that the drainage ratio (i.e., the relative area of the lake to the watershed) was positively related to phosphorus concentrations and, in turn, to diazotroph biovolume. Among lakes, hypolimnetic dissolved oxygen was negatively correlated with diazotroph biovolume, possibly due to the release of nutrients, like phosphate and iron, bound to sediments. In addition, zooplankton grazers were negatively related to diazotrophic cyanobacteria biovolume, potentially reflecting the influence of stocked fish. Thus, lake management must account for bottom-up factors, such as nutrient loading, which is influenced by lake morphometry and watershed size, as well as top-down factors, such as fish stocking, to effectively mitigate diazotrophic cyanobacterial blooms.</p>","author":"Lara S. Jansen, \nDaniel Sobota, \nYangdong Pan, \nAngela L. Strecker","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"49fe594a0ac06baaf35bf05eb5df9e46a559451da0c1b741e2ad41e22e89418d","category":"Environment"}