{"title":"The OsCPK17-OsPUB12-OsRLCK176 module regulates immune homeostasis in rice","link":"https://academic.oup.com/plcell/article/36/4/987/7311101?rss=1","date":1697155200000,"content":"<span><div>Abstract</div>Plant immunity is fine-tuned to balance growth and defense. However, little is yet known about molecular mechanisms underlying immune homeostasis in rice (<span>Oryza sativa</span>). In this study, we reveal that a rice calcium-dependent protein kinase (CDPK), OsCPK17, interacts with and stabilizes the receptor-like cytoplasmic kinase (RLCK) OsRLCK176, a close homolog of <span>Arabidopsis thaliana</span> BOTRYTIS-INDUCED KINASE 1 (AtBIK1). Oxidative burst and pathogenesis-related gene expression triggered by pathogen-associated molecular patterns are significantly attenuated in the <span>oscpk17</span> mutant. The <span>oscpk17</span> mutant and <span>OsCPK17</span>-silenced lines are more susceptible to bacterial diseases than the wild-type plants, indicating that OsCPK17 positively regulates rice immunity. Furthermore, the plant U-box (PUB) protein OsPUB12 ubiquitinates and degrades OsRLCK176. OsCPK17 phosphorylates OsRLCK176 at Ser83, which prevents the ubiquitination of OsRLCK176 by OsPUB12 and thereby enhances the stability and immune function of OsRLCK176. The phenotypes of the <span>ospub12</span> mutant in defense responses and disease resistance show that OsPUB12 negatively regulates rice immunity. Therefore, OsCPK17 and OsPUB12 reciprocally maintain OsRLCK176 homeostasis and function as positive and negative immune regulators, respectively. This study uncovers positive cross talk between CDPK- and RLCK-mediated immune signaling in plants and reveals that OsCPK17, OsPUB12, and OsRLCK176 maintain rice immune homeostasis.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"4a00e979ed2361c9d048fb566591ee88553f0c3b320d4b759aacf54c7c133c15","category":"Environment"}