{"title":"166 Development of non-model organoids in animal research: A paradigm shift in in vitro models","link":"https://academic.oup.com/jas/article/102/Supplement_3/130/7757415?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>For decades, two-dimensional (2D) cell cultures have been used as the gold standard in vitro models for basic research, drug discovery and preclinical screening applications. However, since 2009, the field has quickly shifted towards the use of three-dimensional (3D) stem cell-derived organoids. Organoids offer a variety of advantages compared with conventional 2D models, including being self-organized, retaining their cellular polarity, and being simplified versions of organs in vitro. Adult stem cells can self-renew, differentiate into multiple cell types, and are genomically stable over multiple passage lines, providing a variety of technical benefits and offering the closest recapitulation of the in vivo environment. Our laboratory has focused on expanding, characterizing, and utilizing animal-derived 3D organoid models, specifically focusing on canines; but also including other animals such as swine, turtles, snakes, and squirrels to study their unique adaptations. Practically, we can use 3D canine colonoids for the screening of anti-inflammatory candidates using our tumor necrosis factor (TNF)-α stimulation model. Additionally, we have grown and used swine lung organoids as a model for studying H1N1 viral uptake. Furthermore, we have grown and bio-banked tumor organoids/spheroids from a variety of canine cancers, including urothelial carcinoma (derived from urine and biopsies) and nasal carcinoma, among others, with future applications in precision veterinary medicine and comparative oncology. To accomplish this goal, we have carried out in vitro screening of a variety of chemotherapies and combination therapies at different concentrations across patients to predict in vivo responses and demonstrate the predictive ability of the organoid model. Finally, our laboratory has derived and characterized a variety of healthy organoid lines from canines including the pancreas, lung, liver, bladder, colon, and pituitary to act as healthy controls in mechanistic studies looking at disease pathogenesis and for uses in basic biology. In summary, in vitro organoid models from various animal species and tissues can be used in a variety of basic and applied research fields, including virology, toxicology, and oncology, with the potential to broaden our scientific understanding of disease and overall improve human and veterinary medicine.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4a02ae19942925f562e341c39b0d68b98b1e32bea3bed68f20557d21c8754925","category":"Environment"}