{"title":"Access to Quality Seed, Credit, and Extension Services Are Key Factors Influencing the Adoption of Improved Wheat Production Technologies in the Irrigated, Heat-Prone, Arid Environments of Sudan","link":"https://www.preprints.org/manuscript/202406.1953/v1","date":1719506437000,"content":"Successful strategies that can contribute to poverty reduction and improve the livelihoods of the poor, particularly in Sub-Saharan Africa (SSA), are critically needed to address the technology adoption constraints. The objectives of this study were to assess the adoption rate of improved technologies and management practices and to identify the key factors influencing their adoption in the major wheat-producing areas of Sudan's irrigated, dry, and heat-prone environments. A farm survey was conducted in 2021 using a structured questionnaire that included all recommended technological options for optimum and sustainable wheat production. A total of 300 farmers, 93, 101, and 106 from Northern (NS), Kassala (KS), and Gezira (GS) states, respectively, were selected and interviewed. Besides descriptive statistics, a binary logistic model was used to identify the socioeconomic and production factors affecting farmers' perceptions of improved and recommended technological options. The study found a wide range of adoption rates depending on the specific technology practice and the area surveyed. The lowest adoption rate was observed for land preparation (6.5%) in NS. Adoption rates ranging from 26-100% were observed for technologies such as sowing date, seed rate, seed treatment, awareness of released varieties, nitrogen and phosphorus fertilizers application, and chemical weed control. The difference in the productivity of technological options adopters was significant (P = 0.015) compared to non-adopters. The binary logistic regression results showed that five out of seven explanatory variables hypothesized to influence wheat farmers' perceptions on the decision to adopt improved and recommended technologies significantly influenced farmers' decision to adopt the technologies. In particular, access to quality seed, financial credit, and extension services were found to be the most critical determinants of adopting improved technologies. Approaches that bring together all stakeholders along the crop value chain, including policymakers, to jointly analyze, identify, and prioritize challenges, develop and apply solutions and work plans using feedback and learning mechanisms are expected to increase farmer awareness and adoption of improved technologies, ultimately leading to sustainable wheat production.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4a1187ce8b5805da6f9e0502df54e6d7353bb8ec0a3d23e3e2f2c6dfefe99549","category":"Interdisciplinary"}