{"title":"What the heck’s an Intellivision Amico? Console’s leaky dev portal offers hints","link":"https://arstechnica.com/?p=1776210","date":1624986011000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/amico-listing-question-800x433.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/amico-listing-question.png\">Enlarge</a> <span>/</span> The latest render of the upcoming Intellivision Amico console, with our own question marks placed in each controller's embedded touch screen. A dev portal leak has helped us answer some, but not all, of the questions that remain ahead of the product's current announced release date of October 10, 2021, for $249. (credit: Intellivision / Sam Machkovech)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Since its announcement as a crowdfunded game console in 2018, <a href=\"http://intellivision.com\">the Intellivision Amico</a> has had a weird public image. There have been many YouTube pronouncements about its family-friendliness, yet there are few concrete details that have convinced us it will stand out in an increasingly crowded home-gaming market. And this year, public scrutiny about the $250 system (currently open for <a href=\"https://intellivision.com/shop-amico-preorder\">$100 preorder \"down payments\"</a> or <a href=\"https://www.gamestop.com/video-games/retro-gaming/intellivision-amico\">full-price preorders</a>, which include two controllers and six pack-in games) has grown, particularly after Intellivision joined the 2021 virtual E3-showcase fray—and did so with a resounding thud.</p>\n<p>Thus far, the Amico has used video presentations to show what the company hopes will set this handheld apart from the pack. Those videos mostly originate from Intellivision and a few hand-picked fan YouTube channels. Until we can go hands on with live hardware ourselves, these videos leave us with question marks about dev kits and other potentially inauthentic presentations. Leaks from an Intellivision developer portal this week will have to suffice for now, as it's a great opportunity to finally take a closer look at what the heck an Intellivision Amico actually is.</p>\n<h2>“Exactly what stock photos are meant for”</h2>\n<p>I began closely watching the Amico once I noticed that <a href=\"https://www.youtube.com/watch?v=5QZcAe80uCs\">its E3 2021 presentation video</a> included unclear footage of how the device actually works. These \"live gameplay\" videos hint at Amico's central gimmick: gameplay happens primarily on a TV screen, but the device can also integrate content on an LCD screen embedded in every controller (controllers resemble <a href=\"https://arstechnica.com/gaming/2017/03/a-wii-u-owners-send-off-to-a-deeply-flawed-but-essential-nintendo-console/\">Nintendo's Wii U</a>, albeit with smaller gamepads). However, the E3 video cuts and pans so much that we can't tell if the Amico controllers are legitimately interacting with the nearby TV set. Older Amico videos have shown apparent lag between controller input and TV display—when those videos haven't hidden the controller from view altogether, that is. This recent E3 presentation did nothing to reduce concern on that front.</p></div><p><a href=\"https://arstechnica.com/?p=1776210#p3\">Read 34 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1776210&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4a15a8e427b4aa237ae58123e3eb6ece705b2e50272df0d6fd7871157f15f70b","category":"Tech"}