{"title":"Software downloaded 30,000 times from PyPI ransacked developers’ machines","link":"https://arstechnica.com/?p=1784124","date":1627646088000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/computer-code-800x552.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/computer-code.jpg\">Enlarge</a> </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Open source packages downloaded an estimated 30,000 times from the PyPI open source repository contained malicious code that surreptitiously stole credit card data and login credentials and injected malicious code on infected machines, researchers said on Thursday.</p>\n<p>In a <a href=\"https://jfrog.com/blog/malicious-pypi-packages-stealing-credit-cards-injecting-code/\">post</a>, researchers Andrey Polkovnichenko, Omer Kaspi, and Shachar Menashe of devops software vendor JFrog said they recently found eight packages in PyPI that carried out a range of malicious activity. Based on searches on <a href=\"https://pepy.tech/\">https://pepy.tech</a>, a site that provides download stats for Python packages, the researchers estimate the malicious packages were downloaded about 30,000 times.</p>\n<h2>Systemic threat</h2>\n<p>The discovery is the latest in a long line of attacks in recent years that abuse the receptivity of open source repositories, which millions of software developers rely on daily. Despite their crucial role, repositories often lack robust security and vetting controls, a weakness that has the potential to cause serious supply chain attacks when developers unknowingly infect themselves or fold malicious code into the software they publish.</p></div><p><a href=\"https://arstechnica.com/?p=1784124#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1784124&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4a1602309104fb276f7bb3ab28a176c594c2512ba6e042af06ce19130c947719","category":"Tech"}