{"title":"Parental overproduction allows siblicidal bird to adjust brood size to climate-driven prey variation","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae007/7596212?rss=1","date":1706745600000,"content":"<span><div>Abstract</div>Parental overproduction is hypothesized to hedge against uncertainty over food availability and stochastic death of offspring and to improve brood fitness. Understanding the evolution of overproduction requires quantifying its benefits to parents across a wide range of ecological conditions, which has rarely been done. Using a multiple hypotheses approach and 30 years of data, we evaluated the benefits of overproduction in the Blue-footed booby, a seabird that lays up to three eggs asynchronously, resulting in an aggressive brood hierarchy that facilitates the death of last-hatched chicks under low food abundance. Results support the resource-tracking hypothesis, as low prey abundance (estimated from sea surface temperature and chlorophyll-a concentration) led to rapid brood reduction. The insurance hypothesis was supported in broods of three, where last-hatched chicks’ survival increased after a sibling’s death. Conversely, in broods of two, results suggested that parents abandoned last-hatched chicks following first-hatched chicks’ deaths. No direct evidence supported the facilitation hypothesis: the presence of a last-hatched chick during development did not enhance its sibling’s fitness in the short or long term. The value of last-hatched offspring to parents, as “extra” or “insurance” varied with indices of food abundance, brood size, and parental age. Ninety percent of overproduction benefits came from enabling parents to capitalize on favorable conditions by fledging additional offspring. Our study provides insight into the forces driving overproduction, explaining the adaptiveness of this apparently wasteful behavior and allowing us to better predict how overproduction’s benefits might be modified by ocean warming.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"4a2ab9ae201d86f6adffa3f9e85558ff651f00588d48ca13926e0524a5f978fd","category":"Environment"}