{"title":"Variable Responses of Plant Water Use to Soil Water Availability in Robinia Pseudoacacia under Prolonged Drought","link":"https://academic.oup.com/forestscience/article/70/2/89/7612944?rss=1","date":1708560000000,"content":"<span><div>Abstract</div>Large-scale afforestation on the Loess Plateau has been subjected to more frequent and severe drought due to climate change. However, there is a lack of definite evidence elucidating the adjustments in water supply-demand relationships under prolonged drought. In this study, we investigated the responses of plant characteristics related to plant water supply and demand in 2-year-old <span>Robinia pseudoacacia</span> seedlings to soil water availability (SWA). We systemically analyzed the acclimation of plant water use to prolonged drought. A logistic function was used to fit relationships between normalized net photosynthetic rate (<span>P</span><sub><span>n</span></sub>), transpiration rate (<span>T</span><sub><span>r</span></sub>), stomatal conductance (<span>G</span><sub><span>s</span></sub>), soil-root hydraulic conductance (<span>K</span><sub><span>sr</span></sub>), root-leaf hydraulic conductance (<span>K</span><sub><span>rl</span></sub>), and whole plant hydraulic conductance (<span>K</span><sub><span>plant</span></sub>) with SWA. The results revealed significant difference in responses of these parameters to SWA (<span>p</span> &lt; .001). The sensitivities of <span>P</span><sub><span>n</span></sub>, <span>T</span><sub><span>r</span></sub>, and <span>G</span><sub><span>s</span></sub> to drought increased from 60-day to 120-day drought, contributing to reduce water consumption. Meanwhile, the relative stable sensitivities of hydraulic conductance (<span>K</span><sub><span>sr</span></sub>, <span>K</span><sub><span>sr</span></sub>, and <span>K</span><sub><span>plant</span></sub>) promoted a consistent water supply at different ecological levels. Additionally, coordination between <span>G</span><sub><span>s</span></sub> with hydraulic conductance helped maintain normal physiological activities under drought. These findings enhance our understanding of adjustments in plant water use in response to prolonged drought in <span>Robinia pseudoacacia</span>.Study Implications: Our findings have implications for better understanding the acclimation of <span>Robinia pseudoacacia</span> to prolonged drought. First, our results suggest decreased water demand (water consumption) by <span>Robinia pseudoacacia</span> under prolonged drought because the sensitivities of net photosynthetic rate (<span>P</span><sub><span>n</span></sub>), transpiration rate (<span>T</span><sub><span>r</span></sub>), and stomatal conductance (<span>G</span><sub><span>s</span></sub>) to drought increased from 60-day to 120-day drought treatments. Second, our study indicates a relative stable water supply (soil-root, root-leaf, and whole plant hydraulic conductance; <span>K</span><sub><span>sr</span></sub><span>, K</span><sub><span>rl</span></sub>, and <span>K</span><sub><span>plant</span></sub>) of <span>Robinia pseudoacacia</span> at different ecological levels under prolonged drought. Finally, our research has implications for the coordination of stomatal and hydraulic regulation.</span>","author":"","siteTitle":"Forest Science Current Issue","siteHash":"05e2fee9ae6a27cd288c89ae75adf607539d339849a171c4fab1eaa2f11b4162","entryHash":"4a2d554e09a4224ec338f4373cfd2cecbaeac433b265ff98fd0a7285ce0f1144","category":"Environment"}