{"title":"Using net anthropogenic nutrient inputs at fine spatial scales benefits decision‐making in watersheds to protect water quality","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14733?af=R","date":1721806510000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/9fe0d386-0e97-4e18-ba16-cebdf8d6bb6d/jpe14733-toc-0001-m.png\" alt=\"Using net anthropogenic nutrient inputs at fine spatial scales benefits decision-making in watersheds to protect water quality\" />\n<p>The use of the detailed components of NANI and NAPI at the finest scale possible provides relevant quantitative information and acts as an effective communication tool between scientists and decision makers. We suggest that the use of this approach can better enable targeted nutrient reduction strategies based on scientific evidence to protect water quality.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nExcessive nutrient loadings from various human activities on land to inland and coastal waters result in water quality degradation through cultural eutrophication. Accurately identifying and quantifying the main nitrogen and phosphorus sources on land is essential to implement proper intervention strategies to reduce loadings in order to preserve water quality for the long term.\n\nThe Net Anthropogenic Nitrogen/Phosphorus Inputs (NANI/NAPI) mass balance approach has successfully been used to quantify nutrients added on land to sustain human activities and predict the fraction exported to water. However, the rich detail of information used to generate the mass balance is typically merged and upscaled to whole watersheds, averaging out highly heterogeneous patterns on land, which would be key to identify regions that disproportionately load nutrients to receiving waters.\n\nHere we present NANI and NAPI at increasingly finer scales (watershed, county, and municipal) in eight catchments of the Saint-Lawrence Basin in Québec, Canada, and compare input changes between two different decades (1981 and 2021).\n\nIn 2021, NANI ranged from 828 to 6602 kg km<sup>−2</sup> at the watershed scale whereas the range at the municipal one was much greater from near 0 to 27,413 kg km<sup>−2</sup>, highlighting the importance of using the municipal scale to pinpoint specific regions of high inputs. We then show how partitioning individual NANI components (the same could be done for NAPI) could reveal the dominant input type among urbanisation, crop-intensive, or livestock-intensive agriculture, which can help decision makers choose the most effective intervention strategy based on dominant input type. Finally, we discuss how information derived over time can further be used to enhance understanding around mitigation strategies.\n\n<i>Policy implications</i>. The use of the detailed components of NANI and NAPI at the finest scale possible provides relevant quantitative information and acts as an effective communication tool between scientists and decision makers. We suggest that the use of this approach can better enable targeted nutrient reduction strategies based on scientific evidence to protect water quality.\n</p>","author":"Stéphanie Shousha, \nRoxane Maranger","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"4a301b72edd165027d3a76d762d65b61c1434601a795920b14c7b758e250fc91","category":"Environment"}