{"title":"Finders' eaters: Increasing bush encroachment may shift carcass detection from diurnal avian to nocturnal mammalian scavengers","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13262?af=R","date":1714055305000,"content":"<h2>Abstract</h2>\n<p>Bush encroachment is increasingly becoming a problem for biodiversity conservation in African savannas. While this invasion by woody vegetation may hamper avian scavengers such as vultures, which primarily search by sight, it may benefit mammalian scavengers that search by smell. This study aimed to examine the ability of nocturnal mammalian and diurnal avian scavengers to locate carcasses at increasing vegetation densities. We successively placed 27 impala (<i>Aepyceros melampus</i>) carcasses five days apart in a 2000 ha fenced game camp that offered an extensive range of woody plant densities. Scavenger arrivals and first feedings were recorded with camera traps. The avian scavengers, mainly white-backed Vultures (<i>Gyps africanus</i>), fed exclusively on carcasses during the day, and mammalian scavengers, predominantly brown hyenas (<i>Parahyena brunnea</i>), fed solely at night. The two guilds thus competed exploitatively without direct interaction between them. For vultures, the time taken to locate a carcass increased with woody plant density. The mean density of woody plants that avian scavengers located carcasses at was 2188 plants/ha, whereas mammalian scavengers located carcasses at appreciably higher densities of 5156 plants/ha. Resource managers need to understand the synergy between maintaining woody vegetation to benefit nocturnal mammalian scavengers and maintaining open savannas to benefit diurnal avian scavengers.</p>\n<h2>Résumé</h2>\n<p>L’embroussaillement devient progressivement un problème pour la conservation de la biodiversité dans les savanes africaines. Si cet envahissement par la végétation ligneuse peut gêner les oiseaux charognards tels que les vautours, qui recherchent principalement par la vue, il peut profiter aux mammifères charognards qui recherchent par l’odorat. Cette étude visait à examiner la capacité des mammifères charognards nocturnes et des oiseaux charognards diurnes à localiser les carcasses à des endroits où les densités de végétation sont croissantes. Nous avons placé successivement 27 carcasses d’impalas (Aepyceros melampus) à cinq jours d’intervalle dans un camp de chasse clôturé de 2 000 ha offrant une large gamme de densités de plantes ligneuses. Les arrivées des charognards et les premiers repas ont été enregistrés à l’aide de pièges photographiques. Les oiseaux charognards, principalement des vautours à dos blanc (Gyps africanus), se nourrissaient exclusivement de carcasses pendant la journée, et les mammifères charognards, principalement des hyènes brunes (Parahyena brunnea), se nourrissaient uniquement la nuit. Les deux guildes se livraient donc à une concurrence d’exploitation sans interaction directe entre elles. Pour les vautours, le temps nécessaire pour localiser une carcasse augmentait avec la densité des plantes ligneuses. La densité moyenne de plantes ligneuses à laquelle les oiseaux charognards localisaient les carcasses était de 2 188 plantes/ha, alors que les mammifères charognards localisaient les carcasses à des densités sensiblement plus élevées de 5 156 plantes/ha. Les responsables de ressources doivent comprendre la synergie entre le maintien de la végétation ligneuse au profit des mammifères charognards nocturnes et le maintien des savanes ouvertes au profit des oiseaux charognards diurnes.</p>","author":"Gerard Malan, \nKyle S. Walker, \nAra Monadjem","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"4a36503c3efb37e0a4b1399fd299185ecf74dc02d4368bbbb32fd3065e2a18da","category":"Environment"}