{"title":"Retrospective Study of the Epidemiological-Clinical Characteris-Tics of Burns Treated in a Hospital Emergency Service (2018&ndash;2022)","link":"https://www.preprints.org/manuscript/202407.0271/v1","date":1719967798000,"content":"Background: Burns are a common and severe medical emergency requiring immediate specialized care to minimize damage and prevent complications. Burn severity depends on depth, extent, and location, with more complex care needed for burns on critical areas or extensive burns. Nursing is essential in burn management, providing immediate care, adapting treatments, managing pain, preventing infections, and offering emotional support for recovery. Methods: Retrospective, observational study that analyzed burn cases treated at the Hospital Complex of Cáceres (Spain) 2018-2022. Inclusion criteria were based on ICD-10 codes for burns, excluding severe cases not treated in this service. Data were analyzed using descriptive statistics, Student's t-tests, Chi-square tests, and ANOVA. Results: 220 patients, with a mean age of 47 years and 60.9% male. Most burns (95.5%) affected the external body surface, with a mean hospital stay of 7.86 days. Medical treatment was provided to 75.5% of patients, and 24.5% required surgical intervention. Significant differences in treatment procedures were observed according to age, skin thickness, and burn degree. Older patients had more procedures and longer hospital stays. Excision and transfer procedures were more common in full-thickness and severe burns. Conclusions: The findings align with previous research on burn demographics and treatment approaches. Treatment differences by age and burn severity highlight the need for tailored interventions. The study underscores the importance of comprehensive burn management, including psychological support for improved long-term outcomes. Further research could explore the impact of socio-economic factors on burn incidence and treatment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4a3ee877b8918e7531067792c6b6786c3a0d1daee657d2742d5476fe8dcbcb3e","category":"Interdisciplinary"}