{"title":"Common garden experiments and SNP genotyping at the extremes of a steep precipitation gradient suggest local adaptation in a Patagonian conifer","link":"https://academic.oup.com/botlinnean/article/206/1/14/7619112?rss=1","date":1709510400000,"content":"<span><div>Abstract</div>Plants inhabiting contrasting physical conditions might develop local adaptations overriding the homogenizing effects of gene flow. Hypotheses of local adaptation on phenotypic, genomic, and environmental variation under extreme precipitation regimes were tested in the Patagonian conifer <span>Austrocedrus chilensis</span>. Common garden experiments on progeny and genotype-to-environment association analysis on adults were conducted. Samples consisting of seeds and leaves from adult trees were collected from contrasting dry (DF) and humid (HF) forests along a steep but short precipitation gradient. Seeds were germinated and seedlings were grown under common garden conditions for 24 months. DNA was extracted from 75 randomly selected trees from DF and HF, and genotyped by sequencing to obtain single-nucleotide polymorphisms (SNPs). Seedlings from HF outgrew DF ones suggesting genetically based differences. Twenty-four outlier SNP loci differed between DF and HF, whereas neutral genes (3242) showed high levels of admixture. Eight out of the 24 outlier SNPs aligned with transcripts, half of them related to drought stress responses, and principal component analysis identified four precipitation-related marker–climate associations. Quantitative and genomic traits suggested that natural selection maintains divergence under contrasting climatic conditions regardless high gene flow. This underscores the importance of dry forests as reservoirs of drought-tolerant variants to cope with forecasted climate change.</span>","author":"","siteTitle":"Botanical Journal of the Linnean Society Current Issue","siteHash":"84b5fa2619594e061395c38d918de42c13a5b0cd8ac0441f237084e35d0e4410","entryHash":"4a409230b1f76511b9c874a7d4423a817413013386fd5d224f2b4dd3c54df76d","category":"Environment"}