{"title":"Epigenetic control during root development and symbiosis","link":"https://academic.oup.com/plphys/article/196/2/697/7691838?rss=1","date":1718150400000,"content":"<span><div>Abstract</div>The roots of plants play multiple functions that are essential for growth and development, including anchoring to the soil as well as water and nutrient acquisition. These underground organs exhibit the plasticity to modify their root system architecture in response to environmental cues, allowing adaptation to change in water and nutrient availability. In addition, roots enter in mutualistic interactions with soil microorganisms, for example, the root nodule symbiosis (RNS) established between a limited group of plants and nitrogen-fixing soil bacteria and the arbuscular mycorrhiza symbiosis involving most land plants and fungi of the Glomeromycetes phylum. In the past 20 years, genetic approaches allowed the identification and functional characterization of genes required for the specific programs of root development, root nodule, and arbuscular mycorrhiza symbioses. These genetic studies provided evidence that the program of the RNS recruited components of the arbuscular mycorrhiza symbiosis and the root developmental programs. The execution of these programs is strongly influenced by epigenetic changes—DNA methylation and histone post-translational modifications—that alter chromatin conformation modifying the expression of key genes. In this review, we summarize recent advances that highlight how DNA methylation and histone post-translational modifications, as well as chromatin remodeling factors and long noncoding RNAs, shape the root system architecture and allow the successful establishment of both root nodule and arbuscular mycorrhiza symbioses. We anticipate that the analysis of dynamic epigenetic changes and chromatin 3D structure in specific single cells or tissue types of root organs will illuminate our understanding of how root developmental and symbiotic programs are orchestrated, opening exciting questions and new perspectives to modulate agronomical and ecological traits linked to nutrient acquisition.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"4a41c85ac03cdd9263dadee8dbe61ac8014415728446ff1506c768dafa147108","category":"Environment"}