{"title":"Atomic-Scale 3D Structural Analysis of Core-Shell Nanoparticles","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.887/7719905?rss=1","date":1721779200000,"content":"<span>Through the creation of epitaxy between two distinct materials, it is possible to finely manage the misfit strain at their interface [<a href=\"#ozae044.887-B1\">1</a>, <a href=\"#ozae044.887-B2\">2</a>]. Core-shell architectures are prominent examples of such strain-engineered materials, where adjusting the misfit strain at the interface allows for the tailored design of material properties [<a href=\"#ozae044.887-B3\">3</a>]. Achieving a comprehensive exploitation of the strain effects at interfaces necessitates an atomic-level insight into their 3D interface structures. In this study, we present a detailed atomic-level analysis of the 3D structure of Pd@Pt core-shell nanoparticles using atomic electron tomography (Fig. 1) [<a href=\"#ozae044.887-B4\">4-10</a>]. We obtained detailed 3D displacement and strain maps for these nanoparticles (Fig. 2A-E), unveiling a direct correlation between the strains at the surface and the interface. Additionally, we observed clear Poisson effects across the entire nanoparticle and within its local atomic bonds (Fig. 2F-G). The strain distribution exhibited notable shape-dependent anisotropy, a finding supported by molecular statics simulations. By analyzing the surface strains, we were able to predict the activities of the oxygen reduction reaction at the surface [<a href=\"#ozae044.887-B8\">8</a>, <a href=\"#ozae044.887-B9\">9</a>]. These insights offer a profound understanding of the connections between structure and properties in core-shell configurations, indicating that both strain and catalytic surface properties can be meticulously adjusted through strategic core-shell design. More detailed information about this study can be found in the published paper [<a href=\"#ozae044.887-B8\">8</a>, <a href=\"#ozae044.887-B11\">11</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"4a4c5decade6913d29689211c3b8693c4453da68c029082e04b3aabc55ec832a","category":"Environment"}