{"title":"Prevalence and risk factors of work-related musculoskeletal disorders among shopkeepers in Ethiopia: Evidence from a workplace cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300934","date":1711029600000,"content":"<p>by Amensisa Hailu Tesfaye, Gebisa Guyasa Kabito, Fantu Mamo Aragaw, Tesfaye Hambisa Mekonnen</p>\r\nIntroduction <p>Work-related musculoskeletal disorders (WRMSDs) are the leading cause of disability worldwide. Shopkeepers are prone to developing work-related musculoskeletal disorders, but they are largely overlooked in research and policy actions, particularly in developing countries. So far, there is a lack of data on the magnitude and factors influencing work-related musculoskeletal disorders among shopkeepers in Ethiopia. Therefore, the current study aimed to explore the prevalence and risk factors of work-related musculoskeletal disorders among shopkeepers in Gondar City, Ethiopia.</p> Methods <p>A workplace-based cross-sectional study was conducted from July to August 2022, in Gondar city, Northwest Ethiopia. A multistage sampling technique was used to select 625 shopkeepers. The data were collected using an interviewer-administered standardized Nordic Musculoskeletal Questionnaire. Analysis was made using Stata version 14. Factors associated with the prevalence of work-related musculoskeletal disorders were identified using the multivariable Poisson regression model. The adjusted prevalence ratio with 95% confidence intervals (CIs) and p-value &lt; 0.05 were applied to establish the significance of associations.</p> Results <p>The overall prevalence of work-related musculoskeletal disorders among shopkeepers in the past 12 months was found to be 81.1% (N = 507). The most frequently affected body part was the lower back (46.6%), followed by the upper back (43.8%) and shoulder (35.4%). Being female (<i>p</i> = 0.043), being in the age group of ≥40 years (<i>p</i> = 0.028), being overweight (<i>p</i> = 0.035), experiencing job stress (<i>p</i> = 0.006) and prolonged sitting (<i>p</i> = 0.045) were significant factors for the prevalence of work-related musculoskeletal disorders among shopkeepers.</p> Conclusion <p>This study revealed that shopkeepers face an alarmingly high prevalence of work-related musculoskeletal disorders. Female, older, overweight, stressed and shopkeepers who sit in the same position for long periods of time were identified as particularly vulnerable groups. These findings call for the urgent development and implementation of preventive measures, including ergonomic adjustments, education and training programs, stress management techniques and the promotion of physical activity, to protect this vulnerable workforce from the debilitating effects of work-related musculoskeletal disorders and to ensure their long-term health and well-being.</p>","author":"Amensisa Hailu Tesfaye","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4a50ad368dcb23fd76bb8d5c006cd894accf60adaf1fd043b1e40c5451d2e1d1","category":"Interdisciplinary"}