{"title":"Salmon farming alters the structure and functioning of Norwegian maerl bed communities","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4142?af=R","date":1713506053000,"content":"<h2>Abstract</h2>\n<p>\nEffluents resulting from fish farming activities can alter the structure and functioning of benthic ecosystems. In Norway, recent technological advances within the salmon industry have facilitated the expansion of aquaculture into shallower locations, leading to additional pressures upon coastal habitats.\nMaerl/rhodolith beds are important bioengineers in coastal waters—supporting highly diverse associated macrofaunal communities—and are likely to be particularly at risk.\nThis study aims to investigate the environmental changes induced by fish farms in their vicinity and their impact on the structure and functioning of maerl bed macrofaunal communities.\nHigh dissolved nutrients and organic enrichment levels were observed close to the cages, associated with lower live maerl cover.\nOverall, the most substantial impact of salmon farms on macrofaunal communities was observed within 100 m from the cages. Nevertheless, changes in the structure and functioning of assemblages were evidenced up to 300 m.\nIn the vicinity of the cages, communities were characterized by the dominance of endobenthic subsurface deposit feeders and opportunistic species, notably the polychaetes <i>Chaetozone</i> sp., <i>Capitella</i> sp. and <i>Scoloplos armiger</i>. Conversely, sites situated farther away from the cages exhibited higher abundances of epibenthic taxa, including crawlers, grazers and species sensitive to organic enrichment.\nSites unaffected by the presence of fish farms were described by high abundances of the ophiuroid <i>Ophiura robusta</i>, the polychaete <i>Proclea graffi</i> and ostracods, reflecting more favourable environmental conditions.\nSuch changes in macrofaunal communities highlight the vulnerability of maerl beds to the impacts of aquaculture, thus emphasizing the importance of rigorous site selection when establishing new fish farming facilities.\n</p>","author":"Erwann Legrand, \nBastien Taormina, \nJacques Grall, \nPål Næverlid Sævik, \nYann Lelièvre, \nLucas Pinsivy, \nViviana Peña, \nVivian Husa","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"4a53c1c0ed7091d28b1025f5a25a9a71c0b9f86fd7e845e284f5b64e23d5c7a9","category":"Environment"}