{"title":"Google says the AI-focused Pixel 8 can’t run its latest smartphone AI models","link":"https://arstechnica.com/?p=2008918","date":1709925757000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/1-800x450.jpg\" alt=\"The bigger Pixel 8 Pro gets the latest AI features. The smaller model does not. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/1.jpg\">Enlarge</a> <span>/</span> The bigger Pixel 8 Pro gets the latest AI features. The smaller model does not.  (credit: Google)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>If you believe Google's marketing hype, AI in a phone is really, really important, the best AI is Google's, and the best place to get that AI is Google's flagship smartphone, the Pixel 8. We're five months removed from the launch of the Pixel 8, and that doesn't seem like a justifiable position anymore: Google says its latest AI models can't run on the Pixel 8.</p>\n<p>Google dropped that news in a Mobile World Congress wrap-up video that was spotted by <a href=\"https://twitter.com/MishaalRahman/status/1765812906896113681\">Mishaal Rahman</a>. At the end of the show in a Q&amp;A session, Googler Terence Zhang, a member of the Gemini-on-Android team, said \"[Gemini] Nano will not be coming to the Pixel 8 because of some hardware limitations. It's currently on the Pixel 8 Pro and very recently available on the Samsung S24 family. It'll be coming to more high-end devices in the near future.\"</p>\n<p>That is a wild statement. Gemini is Google's latest AI model, and it made a<a href=\"https://arstechnica.com/information-technology/2024/02/google-debuts-more-powerful-ultra-1-0-ai-model-in-rebranded-gemini-chatbot/\"> big deal</a> of the launch last month. Gemini comes in a few different sizes, and the smallest \"Nano\" size is specifically designed to run on smartphones as a much-hyped \"on-device AI.\" The Pixel 8 and Pixel 8 Pro are Google's flagship smartphones. Google designed the phone and the chip and the AI model and somehow can't make these things play nice together?</p></div><p><a href=\"https://arstechnica.com/?p=2008918#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2008918&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4a568d367ecabce9ef3066bf6d25b548eef14f4ec89bd81dffcc6e9a269afe27","category":"Tech"}