{"title":"Improvement of Electric Fish Optimization Algorithm for Standstill Label Combined with Levy Flight Strategy","link":"https://www.preprints.org/manuscript/202409.1219/v1","date":1726476811000,"content":"The Electric Fish Optimization (EFO) Algorithm is inspired by the predation behavior and communication of weak electric fish. It is a novel meta-heuristic algorithm that attracts researchers because it has few tunable parameters,high robustness,and strong global search capabilities. Nevertheless, when operating in complex environments, the EFO algorithm encounters several challenges including premature convergence, susceptibility to local optimum, and issues related to passive electric field localization stagnation. To address these challenges, this study introduces an Adaptive Electric Fish Optimization Algorithm Based on Standstill Label and Level Flight (SLLF-EFO). This hybrid approach incorporates the Golden Sine Algorithm and Good Point Set Theory to augment the EFO algorithm’s capabilities, employs a variable step size Levy flight strategy to efficiently address passive electric field localization stagnation problems, and utilizes a standstill label strategy to mitigate the algorithm’s tendency to fall into local optimum during the iterative process. By leveraging multiple solutions to optimize the EFO algorithm, this framework enhances its adaptability in complex environments. Experimental results from benchmark functions reveal that the proposed SLLF-EFO algorithm exhibits improved performance in complex settings, demonstrating enhanced search speed and optimization accuracy This comprehensive optimization not only enhances the robustness and reliability of the EFO algorithm but also provides valuable insights for its future applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4a5aaba61fb78581ec7fe6d8d19ef5985ac588501b45ceb907dac3741d80de04","category":"Interdisciplinary"}