{"title":"Chemical and transcriptomic analyses of leaf trichomes from Cistus creticus subsp. creticus reveal the biosynthetic pathways of certain labdane-type diterpenoids and their acetylated forms","link":"https://academic.oup.com/jxb/article/75/11/3431/7633991?rss=1","date":1711152000000,"content":"<span><div>Abstract</div>Labdane-related diterpenoids (LRDs), a subgroup of terpenoids, exhibit structural diversity and significant commercial and pharmacological potential. LRDs share the characteristic decalin–labdanic core structure that derives from the cycloisomerization of geranylgeranyl diphosphate (GGPP). Labdanes derive their name from the oleoresin known as ‘Labdanum’, ‘Ladano’, or ‘Aladano’, used since ancient Greek times. Acetylated labdanes, rarely identified in plants, are associated with enhanced biological activities. Chemical analysis of <span>Cistus creticus</span> subsp. <span>creticus</span> revealed labda-7,13(<span>E</span>)-dien-15-yl acetate and labda-7,13(<span>E</span>)-dien-15-ol as major constituents. In addition, novel labdanes such as <span>cis</span>-abienol, neoabienol, <span>ent</span>-copalol, and one as yet unidentified labdane-type diterpenoid were detected for the first time. These compounds exhibit developmental regulation, with higher accumulation observed in young leaves. Using RNA-sequencing (RNA-seq) analysis of young leaf trichomes, it was possible to identify, clone, and eventually functionally characterize labdane-type diterpenoid synthase (diTPS) genes, encoding proteins responsible for the production of labda-7,13(<span>E</span>)-dien-15-yl diphosphate (<span>endo</span>-7,13-CPP), labda-7,13(<span>E</span>)-dien-15-yl acetate, and labda-13(<span>E</span>)-ene-8<span>α</span>-ol-15-yl acetate. Moreover, the reconstitution of labda-7,13(<span>E</span>)-dien-15-yl acetate and labda-13(<span>E</span>)-ene-8<span>α</span>-ol-15-yl acetate production in yeast is presented. Finally, the accumulation of LRDs in different plant tissues showed a correlation with the expression profiles of the corresponding genes.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"4a5c2c500456c684112740da8150c432655faf4adb7445136c85e8751b03dca6","category":"Environment"}