{"title":"This electric fastback is the next Audi A6 e-tron, due in late 2022","link":"https://arstechnica.com/?p=1757780","date":1618808437000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/XS21Outdoor52582-980x735.jpg\" /></div>\n        <p>\n          This is Audi's all-electric A6 e-tron concept.                      [credit:\n                        Audi                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>It has been a bumper few days for new electric vehicle reveals. Traditionally the time of the New York International Auto Show, last week saw new battery EVs from <a href=\"https://arstechnica.com/cars/2021/04/everything-we-know-about-audis-next-electric-crossover-the-q4-e-tron/\">Audi</a>, <a href=\"https://arstechnica.com/cars/2021/04/mazdas-electric-mx-30-goes-on-sale-in-the-us-this-fall/\">Mazda</a>, and <a href=\"https://arstechnica.com/cars/2021/04/mercedes-goes-all-out-with-its-new-electric-luxury-sedan-the-eqs/\">Mercedes-EQ</a>. This coming week, the Shanghai Auto Show will take place in corporeal form, and Audi has brought along something special. It's called the A6 e-tron concept, but don't let the \"concept\" bit fool you; when the actual A6 e-tron arrives in late 2022, it'll look a lot like the car you see in the gallery above.</p>\n<h2>A new EV platform</h2>\n<p>Audi and its corporate siblings within Volkswagen Group have made efficient use of highly flexible vehicle architectures, where a common set of components is used to create a wide range of different vehicles. When <a href=\"https://arstechnica.com/series/volkswagen-defeat-device-scandal/\">dieselgate</a> forced VW Group to abandon that fuel in favor of electrification as a way to meet tough European climate regulations, it put Audi in charge of developing a replacement for the MLB Evo architecture that Audi, <a href=\"https://arstechnica.com/cars/2020/09/this-porsche-plug-in-suv-is-a-pricey-dayglo-antidepressant-on-wheels/\">Porsche</a>, Bentley, and <a href=\"https://arstechnica.com/cars/2019/04/the-fastest-suv-our-first-drive-in-lamborghinis-641-horsepower-urus/\">Lamborghini</a> have used to make cars and SUVs.</p>\n<p>The new platform is called PPE—Premium Platform Electric—and the new A6 e-tron will be one of the first BEVs to make use of it. (This is in addition to the new MEB architecture for smaller BEVs built in much greater volume.) In fact, the A6 e-tron won't be the first PPE-derived BEVs to reach market; late 2022 should see the arrival of an electric replacement for the Porsche Macan crossover, as well as a new Audi Q6 SUV, but we don't have any more details to share about those two at this time.</p></div><p><a href=\"https://arstechnica.com/?p=1757780#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1757780&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4a651f4676c29bbd82b6d9b0b6f5db38ac51e75c2d63f98a4ab3ce4f1ef30b87","category":"Tech"}