{"title":"How does collectivism help deal with perceived vaccine artificiality? The case of COVID-19 vaccination intent in European young adults","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300814","date":1710856800000,"content":"<p>by Wojciech Trzebiński, Jerzy Trzebiński</p>\r\n\r\nVaccine \"unnaturalness\" (artificiality) is one of the major anti-vaccine arguments raised in public debate. Therefore, health communication should rebut unnaturalness arguments and be cautious when emphasizing human intervention (e.g., advanced vaccine technology), which may entail perceiving vaccines as artificial. Understanding how the relationship between perceived vaccine artificiality and vaccination intent differs across social groups can help enforce the above health communication efforts by focusing them on specific audiences. The objective of the current paper is to assess the moderating role of a particular socio-cultural factor—vertical collectivism (reflecting the orientation on social hierarchy)—in the relationship between perceived vaccine artificiality and vaccination intent. It is proposed that vertical collectivism diminishes the negative effect of perceived vaccine artificiality. Two studies with European young adults measured COVID-19 vaccination intent and vertical collectivism. Study 1 (N = 418) was correlational, measuring perceived vaccine artificiality. The data were analyzed with a moderation model. Study 2 (N = 203) was experimental, manipulating perceived vaccine artificiality by human-intervention appeal (i.e., emphasizing human intervention in vaccine development and operation). The data were analyzed with moderation and moderated mediation models. Study 1 demonstrated that the effect of perceived vaccine artificiality on vaccination intent was less negative when the level of vertical collectivism was higher. In Study 2, with higher levels of vertical collectivism, the effect of human-intervention appeal on vaccination intent was less negative, and the indirect effect through perceived vaccine artificiality turned even positive. Those results contribute to the fields of perceived naturalness/artificiality, vaccination behavior, health communication, and cultural dimensions theory, providing empirical evidence that the negative effect of perceived vaccine artificiality on vaccination intent is diminished by vertical collectivism, as proposed. Health practitioners are guided on how to consider different levels of collectivism of their audiences while referring to vaccine artificiality in their communication. Specifically, it is suggested that rebutting \"unnaturalness\" anti-vaccine arguments should be focused on people low in vertical collectivism, and messages featuring human intervention (e.g., a vaccine’s technological advancement) should be targeted at people high in vertical collectivism.","author":"Wojciech Trzebiński","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4a6ef9635361ae762b26bdd5db2e5d5a7fdb9505372cbe0860390558b104952a","category":"Interdisciplinary"}