{"title":"Genome-wide analysis of long noncoding RNAs as <i>cis</i>-acting regulators of transcription factor-encoding genes in IgA nephropathy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304301","date":1716559200000,"content":"<p>by Yaling Zhai, Huijuan Tian, Wenhui Zhang, Shuaigang Sun, Zhanzheng Zhao</p>\r\nBackground <p>IgA nephropathy (IgAN) is the most common form of primary glomerulonephritis in the world, but the disease pathogenesis noncoding is yet to be elucidated. Previous studies have revealed regulatory functions for long noncoding RNA (lncRNA) in various diseases; however, the roles of lncRNA in IgAN and regulation of transcription factors (TFs) have been scarcely investigated.</p> Methods <p>Renal tissue samples (n = 5) from patients with IgAN and control samples (n = 4) were collected and RNA sequencing (RNA-seq) was performed. Four software programs were employed for lncRNA prediction. GO (Gene Ontology)/KEGG (Kyoto Encyclopedia of Genes and Genomes) were employed for analysis of the identified differentially expressed genes (DEGs). A regulatory network model of DE lncRNA-TF-DEG was developed, and the levels of expression of key lncRNAs, TFs, and corresponding target genes were assessed using qRT-PCR and immunofluorescence.</p> Results <p>The current study identified 674 upregulated and 1,011 downregulated DE mRNAs and 260 upregulated and 232 downregulated DE lncRNAs in IgAN samples compared with control samples. The upregulated DE mRNAs showed enrichment in cell adhesion and collagen glial fiber organization pathways. The DE lncRNAs-DE mRNAs showing co-expression are associated with transmembrane transport. A novel regulatory network model of lncRNA-TF-DEG has been developed. This study identified seven TFs that are <i>cis</i>-regulated by 6 DE lncRNAs, and show co-expression with 132 DEGs (correlation coefficient ≥ 0.8, P ≤ 0.01), generating 158 pairs that showed co-expression. The lncRNAs NQO1-DT and RP5-1057120.6 were found to be highly expressed in IgAN samples. The TFs vitamin D Receptor (VDR) and NFAT5, along with their target genes were also aberrantly expressed.</p> Conclusion <p>Key lncRNAs and TFs centrally associated with IgAN have been identified in this study. A regulatory network model of lncRNA-TF-mRNA was constructed. Further studies on the genes identified herewith could provide insight into the pathogenesis of IgAN.</p>","author":"Yaling Zhai","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4a7b3f922c7f0a258a5bb56351e6a6773f021c3ed0343a5ce188303a14d8d480","category":"Interdisciplinary"}