{"title":"X/Twitter เริ่มเก็บเงิน 1 ดอลลาร์ต่อปี เพื่อให้ Tweet, Reply, Quote ได้ ทดสอบที่นิวซีแลนด์-ฟิลิปปินส์","link":"https://www.blognone.com/node/136275","date":1697589019000,"content":"<div><div><div><p>X หรือ Twitter <a href=\"https://legal.twitter.com/en/not-a-bot-terms.html\">ประกาศ</a>เริ่มทดสอบโปรแกรมใหม่ชื่อว่า Not A Bot ซึ่งทำให้เข้าถึงสิทธิการใช้งานบนแพลตฟอร์มระดับเขียน (Write-Level) ได้แก่ โพสต์เนื้อหา (ทวีต), รีพลาย, รีโพสต์ (รีทวีต), โควทข้อความ, บุ๊คมาร์ก โดยผู้ใช้งานต้องจ่ายเงินแบบ subscription <strong>1 ดอลลาร์ต่อปี</strong> เพื่อให้เข้าถึงสิทธิดังกล่าว</p>\n<p>X บอกว่าการเปลี่ยนแปลงนี้มีผลกับ <strong>บัญชีสมัครใช้งานใหม่</strong>ที่ไม่ยืนยันตัวตน (ไม่ได้สมัคร X Premium หรือ Twitter Blue ชื่อเดิม) เฉพาะในประเทศนิวซีแลนด์ และฟิลิปปินส์ <strong>ไม่มีผลกับบัญชีปัจจุบัน</strong>ที่ใช้งานอยู่ก่อนหน้า บัญชีสมัครใหม่ยังสามารถอ่านโพสต์ กดติดตาม หรือดูภาพ-วิดีโอได้ และ X ย้ำว่าโปรแกรมนี้เป็นโปรแกรมที่มีสถานะทดสอบเบต้า ซึ่งหมายความว่า X จะดูผลลัพธ์เพื่อพิจารณาว่าจะทำหรือไม่ทำต่อไป</p>\n<p>การทดสอบนี้ X บอกว่าเพื่อลดสแปมและบอท ซึ่งที่ผ่านมา X เห็นทิศทางที่ดีขึ้นมาตลอด โปรแกรม Not A Bot นี้จึงใช้วิธีเก็บเงินจำนวนที่น้อยมาก (แบบที่ <a href=\"https://www.blognone.com/node/135804\">Elon Musk เคยเกริ่น</a>ก่อนหน้านี้) และไม่ได้ทำเพื่อหวังสร้างผลกำไร</p>\n<p>ที่มา: <a href=\"https://fortune.com/2023/10/17/twitter-x-charging-new-users-1-dollar-year-to-tweet/\">Fortune</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e1a1f705916cb641895566630d4a9437.png\" /></p>\n<blockquote><p>Starting today, we're testing a new program (Not A Bot) in New Zealand and the Philippines. New, unverified accounts will be required to sign up for a $1 annual subscription to be able to post &amp; interact with other posts. Within this test, existing users are not affected.This…</p>\n<p>— Support (@Support) <a href=\"https://twitter.com/Support/status/1714429406192582896?ref_src=twsrc%5Etfw\">October 17, 2023</a></p></blockquote>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/x-company\">X.com</a></div><div><a href=\"/topics/social-network\">Social Network</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4a7da4f7766c1c829ee7a24663b719b2823605f3b9e6a4fb2aaa4c5e0823c2ce","category":"Thai"}