{"title":"Autism-Related Cc2d1a Heterozygous Mice: Increased Levels of miRNAs Retained in DNA/RNA Hybrid Profiles (R-loop)","link":"https://www.preprints.org/manuscript/202407.0900/v1","date":1720685074000,"content":"Autism spectrum disorder (ASD) is a complex neurodevelopmental disorder, with a highly variable expression of phenotypes (restricted interest or activity and repetitive behavior in communication and social interactions), genes (mutation), markers (alteration of transcription) and pathways. Loss of function of the CC2D1A gene appears to primarily affect the brain, leading to a range of behavioral problems in humans. In our study published in 2020; we found that the expressions of miR-19a-3p, miR-361-5p, miR-150-5p, miR-3613-3p, miR-126-3p and miR-499a-5p were downregulated in the serum samples of autistic patients and their families. Here, acquired non-Mendelian hereditary character in a genetically defined mouse model of autism (Cc2d1a +/-) correlates with the transcriptional alteration of five miRNAs. We seek to test the hypothesis that miRNA levels are varying by changes in RNA/DNA structure during development, thereby creating transcription alteration. Behavioral tests were conducted on the offspring of Cc2d1a +/- mutant and control mice, such as novel object, social interaction, marble burying and tail suspension behavior. Two RNA fractions were isolated from mouse hippocampal tissues and sperm cells by standard TRIzol extraction: total RNA and fraction of RNA bound to DNA in the form of a DNA/RNA hybrid (R-loop). The expression levels of miR-19a-3p, miR-361-5p, miR-150-5p, miR-126-3p and miR-499a-5p were investigated by quantitative real-time RT-PCR. We report differences in the distribution of five miRNAs in the hippocampus between male and female mice in RNA fractions, particularly in colonies of Cc2d1a +/- mice. Furthermore, the number of miRNAs engaged in the DNA/RNA hybrid fraction is generally higher in the mutant pedigree than in the control group. On the other hand, in sperm both fractions are at lower levels than in controls. R-loops contribute to the physiology and pathology of organisms including human disease. Here we report a variation in five miRNA levels between gender and tissue. Our results suggest that the transcription levels of these five miRNAs are directly regulated by their RNA.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4a85688a19ce5f567f26eb7a5302243f5bd545af4e8baa0514d1a84b10dfc212","category":"Interdisciplinary"}