{"title":"A gut microbial metabolite cocktail fights against obesity through modulating the gut microbiota and hepatic leptin signaling","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13758?af=R","date":1721377449000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Excessive body weight and obesity elevate the risk of chronic non-communicable diseases. The judicious application of the gut microbiome, encompassing both microorganisms and their derived compounds, holds considerable promise in the treatment of obesity.</p>\n<h2>RESULTS</h2>\n<p>In this study, we showed that a cocktail of gut microbiota-derived metabolites, comprising indole 3-propionic acid (IPA), sodium butyrate (SB) and valeric acid (VA), alleviated various symptoms of obesity in both male and female mice subjected to a high-fat diet (HFD). The 16S ribosomal RNA (rRNA) sequencing revealed that administering the cocktail via oral gavage retained the gut microbiota composition in obese mice. Fecal microbiota transplantation using cocktail-treated mice as donors mitigated the obesity phenotype of HFD-fed mice. Transcriptomic sequencing analysis showed that the cocktail preserved the gene expression profile of hepatic tissues in obese mice, especially up-regulated the expression level of leptin receptor. Gene delivery via <i>in vivo</i> fluid dynamics further validated that the anti-obesity efficacy of the cocktail was dependent on leptin signaling at least partly. The cocktail also inhibited the expression of appetite stimulators in hypothalamus. Together, the metabolite cocktail combated adiposity by retaining the gut microbiota configuration and activating the hepatic leptin signaling pathway.</p>\n<h2>CONCLUSIONS</h2>\n<p>Our findings provide a sophisticated regulatory network between the gut microbiome and host, and highlight a cocktail of gut microbiota-derived metabolites, including IPA, SB, and VA, might be a prospective intervention for anti-obesity in a preclinical setting. © 2024 Society of Chemical Industry.</p>","author":"Yanxi Dong, \nJiali Dong, \nHuiwen Xiao, \nYuan Li, \nBin Wang, \nShuqin Zhang, \nMing Cui","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"4a94c74ba8c70fb6f43056593db1573b0c4098d6a15842e1ba88f0360bfc0512","category":"Environment"}