{"title":"Buttons are back at Porsche as we see the 2024 Cayenne interior","link":"https://arstechnica.com/?p=1927378","date":1680127256000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/Interior_1_1-800x533.jpg\" alt=\"The 2024 Porsche Cayenne interior\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/Interior_1_1-scaled.jpg\">Enlarge</a> <span>/</span> The Cayenne gets a facelift for model-year 2024, and that includes a lot of Taycan-like touches. But we're most excited by the fact that Porsche is pulling back from touchscreen overload.  (credit: Porsche)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Something many of us can agree on is that there are too many touchscreens in modern cars. <a href=\"https://arstechnica.com/cars/2022/08/yes-touchscreens-really-are-worse-than-buttons-in-cars-study-finds/\">They're distracting to use</a>, particularly when it's for often-used things like the car's climate controls. Consider this a feel-good story then, because Porsche has shown us the interior of its next Cayenne SUV, and it seems that in Stuttgart, buttons are back on the menu. Some, at least.</p>\n<p>An almost entirely touchscreen user interface was probably Porsche's only misstep with the <a href=\"https://arstechnica.com/cars/2019/09/the-porsche-taycan-every-bit-as-good-as-a-200000-porsche-should-be/\">otherwise-excellent Taycan</a>. Indeed, <a href=\"https://arstechnica.com/cars/2022/11/the-2022-audi-rs-e-tron-gt-shows-badge-engineering-is-nothing-to-fear/\">when Audi used that car's platform to make its own electric express, the e-tron GT</a>, it was notable that the climate control touchscreen was gone, replaced with actual buttons to make it hotter or cooler, more or less windy. There's no need to use a touchscreen to aim the air vents in an e-tron GT, either, unlike in a Taycan.</p>\n<p>It is therefore encouraging to see that Porsche's design team is listening to feedback, because in many other ways the refreshed interior of the Cayenne incorporates a lot of Taycan-like touches.</p></div><p><a href=\"https://arstechnica.com/?p=1927378#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927378&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4aa184ce2510d5247d278080e58711185e97101364ff861b2db3133c89fb44d0","category":"Tech"}