{"title":"Cadmium aggravates liver injury by activating ferroptosis and neutrophil extracellular traps formation in Nile tilapia (Oreochromis niloticus)","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24276?af=R","date":1718077862000,"content":"<h2>Abstract</h2>\n<p>Cadmium (Cd) is a pervasive environmental contaminant and a significant risk factor for liver injury. The present study was undertaken to evaluate the involvement of ferroptosis and neutrophil extracellular traps (NETs) in Cd-induced liver injury in Nile tilapia (<i>Oreochromis niloticus</i>), and to explore its underlying mechanism. Cd-induced liver injury was associated with increased total iron, malondialdehyde (MDA), and Acyl-CoA synthetase long-chain family member 4 (ACSL4), together with reduced levels of glutathione, glutathione peroxidase-4a (Gpx4a), and solute carrier family 7 member 11 (SLC7A11), which are all hallmarks of ferroptosis. Moreover, liver hyperemia, neutrophil infiltration, increased inflammatory factors and myeloperoxidase, as well as elevated serum DNA content in Cd-stimulated Nile tilapia suggested that a considerable number of neutrophils were recruited to the liver. Furtherly, in vitro experiments demonstrated that Cd induced the formation of NETs, and the possible mechanism was related to the generation of reactive oxygen species and nicotinamide adenine dinucleotide phosphate (NADPH) oxidase, along with the P38 and extracellular regulated protein kinase (ERK) signaling pathways. We concluded that ferroptosis and NETs are the critical mechanisms contributing to Cd-induced liver injury in Nile tilapia. These findings will contribute to Cd toxicological studies in aquatic animals.</p>","author":"Jingjing Wang, \nYichun Chen, \nXia Wang, \nYoupeng Sun, \nMingzhen Jiang, \nYingrong Ye, \nHanpeng Wu, \nYun Lu, \nHuabing Zhong, \nYihe Wu, \nErshun Zhou, \nZhengtao Yang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"4ab0079fc4fc0ae5649aef25caa53b0363c951f81a4446606958b395ed7e18a7","category":"Environment"}