{"title":"Key Aroma Differences in Volatile Compounds of Aged Feng-flavored baijiu Determined using Sensory Descriptive Analysis and GC&times;GC&ndash;TOFMS","link":"https://www.preprints.org/manuscript/202404.1521/v1","date":1713919732000,"content":"Sensory descriptive analysis was used to evaluate the aged Feng-flavored baijiu. The results indicated that there are notable differences in the samples of different ages. The samples with shorter storage times and fresh distilled Baijiu present bran flavor, and fresh green flavor. with the increase of storage time, the fragrance of honey, sweetness, flowers, and aging gradually increases. The samples of Feng-flavored baijiu were dected by Headspace solid-phase microextraction (HS-SPME) combined with comprehensive two-dimensional gas chromatography time-of-ﬂight mass spectrometry (GC×GC–TOFMS) , in total, 496 sustances were identiﬁed in all samples, mainly containing 14 types of substances, such as esters, aldehydes etc., of which 42 substances were found in Feng-flavored baijiu for the first time. Chemometrics was used to analyze the key differential compounds. 143 differential compounds closely related to aging were preliminarily screened, and principal component analysis revealed that these samples were separated by year. 65 differential compounds were selected out by partial least squares discriminant analysis(PLS-DA). Furthermore, 43 key differential compounds were selected from the aged Feng-flavored baijiu combined with variable importance in projection and Pearson correlation coefficients. Partial least squares regression (PLSR) was used to research the correlation of sensory properties and key differential compounds, and the results indicated that most compounds were closely related to the aged Baijiu . This study afford theoretical basis and reference for flavor research of Feng-flavored baijiu.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4ab1329281ef611805c648605a985ba12226810ff73a11fba7c99b698fa062cd","category":"Interdisciplinary"}