{"title":"Effects of Probiotics and Its Extracellular Products on the Growth Performance, Immune Response, and Aeromonas hydrophila Resistance of Grass Carp","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/5555865?af=R","date":1714978800000,"content":"<p>The goal of this study was to research the effects of <i>Lactobacillus buchneri</i> L3-9 and its extracellular products on growth, immunity, intestinal microorganisms, and disease resistance to <i>Aeromonas hydrophila</i> in grass carp. A total of 120 fish (80–90 g) were distributed into 12 aquariums (10 fish/aquarium) in three replicates and fed 1% of their body weight for 21 days. The grass carp were fed four different diets: a control (group C), a diet supplemented with 1 × 10<sup>6</sup> cell g<sup>−1</sup> of <i>L. buchneri</i> L3-9 (group B), a diet supplemented with extracellular products of <i>L. buchneri</i> L3-9 (group E), and a diet supplemented with <i>L. buchneri</i> L3-9 and the extracellular products (group BE). Compared with the control diet, the B, E, and BE diets increased the weight gain rate by 4.49%, 2.59%, and 4.38%, respectively (<i>p</i>  &lt; 0.05), and significantly decreased the feed conversion ratio by 0.72, 0.57, and 0.76, respectively (<i>p</i> &lt; 0.05). Groups B, BE, and E showed significant decreases in mortality, with values of 26.67%, 16.67%, and 23.33%, respectively (<i>p</i> &lt; 0.05). Group B showed a significant increase in superoxide dismutase (SOD) activity and total antioxidant capacity (T-AOC) and decrease in malondialdehyde (MDA) content compared to the control group (<i>p</i> &lt; 0.05). The highest catalase (CAT) activity was found in group E (<i>p</i> &lt; 0.05). In group B, the expression of the gut proinflammatory gene <i>TNF-α</i> was downregulated (<i>p</i> &lt; 0.05), and the expression of anti-inflammatory genes, including <i>TGF-β1</i>, <i>IL-10</i>, and <i>Tlr-8</i>, was upregulated compared to that in the control group (<i>p</i> &lt; 0.05). Groups BE and E showed an increased abundance of <i>Lactobacillaceae</i>. Additionally, a drastic decrease in the abundance of pathogenic bacteria such as <i>Aeromonadaceae</i> and <i>Enterobacteriaceae</i> was in these groups compared to the control group. In conclusion, <i>L. buchneri</i> L3-9 and its extracellular products could improve the growth performance, immune responses, and resistance to <i>A. hydrophila</i> in grass carp. This study provides insights for the development and application of microecological preparations.</p>","author":"Xiantao Gao, \nYuanzhi Peng, \nXiaokun Gao, \nZhicheng Zhu, \nJingjing Zhang, \nWanli Cheng, \nMinmin Cai, \nLongyu Zheng, \nFeng Huang, \nJibin Zhang, \nHamed Ghafarifarsani","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"4ab9a98f0da0b8f4ae47d1dbc276bd1d2af7a0382c9ef61a301f17982041481f","category":"Environment"}