{"title":"Intraperitoneal Administration of 17-DMAG as an Effective Treatment Against Leishmania braziliensis Infection in BALB/c Mice: A Preclinical Study","link":"https://www.preprints.org/manuscript/202407.0125/v1","date":1719841281000,"content":"Background: Leishmaniasis is a significant global public health issue that is caused by parasites from Leishmania genus. With limited treatment options and rising drug resistance, there is a pressing need for new therapeutic approaches. Molecular chaperones, particularly Hsp90, play a crucial role in parasite biology and are emerging as promising targets for drug development.\nObjective: This study evaluates the efficacy of 17-DMAG in treating BALB/c mice from cutane-ous leishmaniasis through in vitro and in vivo approaches.\nMaterials and Methods: We assessed 17-DMAG cytotoxic effect on bone marrow-derived mac-rophages (BMMΦ) and its effects against L. braziliensis promastigotes and intracellular amastigotes. Additionally, we tested the compound's efficacy in BALB/c mice infected with L. braziliensis via intraperitoneal administration to evaluate the reduction of lesion size and de-crease of parasite load in the ears and lymph nodes of infected animals.\nResults: 17-DMAG showed selective toxicity [selective index=432) towards Leishmania amastigotes, causing minimal damage to host cells. The treatment significantly reduced lesion sizes in mice and results in parasite clearance from ears and lymph nodes. It also diminished in-flammatory responses and reduced the release of pro-inflammatory cytokines (IL-6, IFN-g, TNF) and the regulatory cytokine, IL-10, underscoring its dual leishmanicidal and anti-inflammatory properties.\nConclusion: Our findings confirm the potential of 17-DMAG as a viable treatment for cutaneous leishmaniasis and support further research into its mechanisms and potential applications against other infectious diseases.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4ac31ef5c6921962d5d59e3157d514cd7f3f28cbac972b90a4e38de3bdfec424","category":"Interdisciplinary"}