{"title":"52 Evaluation of linseed meal on ovarian follicular development after synchronization in preovulatory small ruminants during seasonal anestrus","link":"https://academic.oup.com/jas/article/102/Supplement_1/79/7618021?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Seasonal estrous of small ruminants can hinder overall reproductive efficiency of holistic management strategies involving sheep and goats. The objective of this study was to quantify the effect of increased melatonin containing feed ingredients on ovarian function during seasonal anestrus. Ovarian follicle number and follicle sizes were evaluated on Spanish × Boer cross does and Rambouillet ewes amounts of lineseed meal in the treatment diet (P30DIET) or an isocoloric and isonitrogenous control diet (CON). The P30DIET contained 2.5% linseed meal which contained increased melatonin (Manchester et al. 2000). At d -18 ewes and does were stratified by age into treatment groups and the P30DIET and CON diets were supplemented (0.91 kg and 0.68 kg per animal per day for sheep and goats, respectively). Synchronization protocols were administered at d 0 for both groups and ovarian ultrasound measures were collected 48 h after the removal of the controlled internal drug release device (CIDR). Mixed model procedures of SAS were used to analyze the number of dominant follicles that were present following the synchronization protocols. The number of dominant follicles observed in the P30DIET goats was significantly greater than the CON consuming goats (P &lt; 0.05). Least Squares Means estimates (LSMEANS) in the P30DIET were 1.5 ± 0.20 as compared with CON goats (0.91 ± .21). These data suggest that flushing small ruminants with greater linseed meal during the seasonal anestrus period can increase the number of dominant follicles therefore implying an improvement in reproductive efficiency in holistic management strategies of small ruminants.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4acd774702aea8467edc7ad2d1d7660b32ceff169dd4a9752f090ed146628794","category":"Environment"}