{"title":"Research Advances on the Hard Seededness Trait of Soybean and the Underlying Regulatory Mechanisms","link":"https://www.preprints.org/manuscript/202404.0932/v1","date":1713166623000,"content":"Soybean is one of the world’s most economically significant crops and is widely utilized as an essential source of vegetable protein and edible oil. Cultivated soybean is domesticated from its annual counterpart, wild soybean, which is considered valuable germplasm for soybean breeding. However, wild soybean accessions generally produce seeds with impermeable coats, a trait known as hard seededness (HS), which is beneficial for long-term seed survival but is undesirable for the uniform water absorption and germination of seeds, thus limiting the utilization of wild soybeans in breeding. However, moderate HS can isolate the embryo from the surrounding environment and is thus beneficial for long-term seed storage and germplasm preservation. The HS trait is primarily associated with the structure and chemical composition of the seed coat. However, its development is also influenced by various environmental conditions, such as water and temperature. Genetic analysis has revealed that HS of soybean is a complex quantitative trait controlled by multiple genes or minor quantitative trait loci (QTL), with many QTLs and several causal genes currently identified. Investigating the physiological and molecular mechanisms underlying this trait is crucial for soybean breeding, production, and food processing. For this article, the literature was reviewed and condensed to create a well-rounded picture of the current understanding of internal and external factors, QTLs, causal genes, and the regulatory mechanisms related to the HS of soybean, with the aim of providing reference for future research and utilization of this trait.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4adf9e0be30cffa16649a99e057cadadff2d0cb07960ec1fa472ceb0806f2ae3","category":"Interdisciplinary"}