{"title":"Molecular Basis of Plant-Pathogen Interaction in the Agriculture Context","link":"https://www.preprints.org/manuscript/202405.0821/v1","date":1715586751000,"content":"Biotic stressors pose serious threats to crop yield, jeopardizing food security and resulting in over US$220 billion per year losses to the agriculture industry. Plants activate innate defense mechanisms upon pathogen perception and invasion. The plant immune response comprises numerous concerted steps, including the recognition of invading pathogens, signal transduction, and activation of defensive pathways. However, pathogens have evolved various structures to evade plant immunity. Given these facts, genetic improvements of plants are required for sustainable disease management to ensure global food security. Advanced genetic technologies have provided new opportunities to revolutionize and boost plant disease resistance against devastating pathogens. Furthermore, targeting susceptibility (S) genes, such as OsERF922 and BnWRKY70, through CRISPR methodologies offers novel frontiers to disrupt the molecular compatibility of pathogens and introduce durable resistance against them in plants. Here, we provide a critical overview of advances in understanding disease resistance mechanisms. The review also critically examines management strategies under challenging environmental conditions and R gene-based plant genome engineering systems intending to enhance plant responses against emerging pathogens. This work underscores the transformative potential of modern genetic engineering practices in revolutionizing plant health and crop disease management while emphasizing the importance of responsible application to ensure sustainable and resilient agricultural systems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4ae02d6ba704ef3b45b1e52475e97aae18683fcc2b328b4faafdb74bfdcb250f","category":"Interdisciplinary"}