{"title":"Trophic niche drives the evolution of craniofacial shape in Trinidadian guppies","link":"https://academic.oup.com/evolut/article/78/5/894/7601139?rss=1","date":1707091200000,"content":"<span><div>Abstract</div>Diverse clades of fishes adapted to feeding on the benthos repeatedly converge on steep craniofacial profiles and shorter, wider heads. But in an incipient radiation, to what extent is this morphological evolution measurable and can we distinguish the relative genetic vs. plastic effects? We use the Trinidadian guppy (<span>Poecilia reticulata</span>) to test the repeatability of adaptation and the alignment of genetic and environmental effects shaping poecilid craniofacial morphology. We compare wild-caught and common garden lab-reared fish to quantify the genetic and plastic components of craniofacial morphology across 4 populations from 2 river drainage systems (<span>n</span> = 56 total). We first use micro-computed tomography to capture 3D morphology, then place both landmarks and semilandmarks to perform size-corrected 3D morphometrics and quantify shape space. We find a measurable, significant, and repeatable divergence in craniofacial shape between high-predation invertivore and low-predation detritivore populations. As predicted from previous examples of piscine adaptive trophic divergence, we find increases in head slope and craniofacial compression among the benthic detritivore foragers. Furthermore, the effects of environmental plasticity among benthic detritivores produce exaggerated craniofacial morphological change along a parallel axis to genetic morphological adaptation from invertivore ancestors. Overall, many of the major patterns of benthic-limnetic craniofacial evolution appear convergent among disparate groups of teleost fishes.</span>","author":"","siteTitle":"Evolution Current Issue","siteHash":"a2040112c8b98efe6d76767c53ee42b7ea8ce26086ad99269623cfcce66a3405","entryHash":"4ae4ec1b18f12fec33f6679a129b10b46909570bfd9a7c5331e27ee7350a49ca","category":"Environment"}