{"title":"You have 72 hours to buy the original, moddable GTA III trilogy on PC","link":"https://arstechnica.com/?p=1802507","date":1633725600000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GTA-800x444.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GTA.png\">Enlarge</a> </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>After months of rumors that Rockstar was cooking up revamped versions of the original <em>Grand Theft Auto 3 </em>trilogy for modern hardware, the publisher confirmed Friday its plans to do just that—and if you're interested in playing your own custom-tailored version of these classics on PC by installing mods, you have three days to buy the collection on Steam.</p>\n\n<p>As has become standard practice for many publishers when updating older games for newer platforms, Rockstar is removing all previous versions and bundles of <em>Grand Theft Auto 3, Vice City, </em>and <em>San</em> <em>Andreas</em> from every console and PC storefront effective \"the week of October 11, 2021,\" the publisher said <a href=\"https://support.rockstargames.com/articles/4408282103571/Grand-Theft-Auto-III-Grand-Theft-Auto-Vice-City-and-Grand-Theft-Auto-San-Andreas-not-available-for-purchase\">on its support page</a>. While each entry received Windows ports in the early 2000s, PC players are currently limited to buying the games via Rockstar's game launcher or through Steam, and only the latter platform supports mods.</p>\n<h2>Modded no more</h2>\n<p>Steam is also noticeably absent from the new trilogy's list of confirmed platforms, which include the PlayStation 4 and 5, Xbox platforms, Nintendo Switch, and PC via Rockstar's game launcher, with iOS and Android ports coming next year. As of press time, all three games and the <em>Grand Theft Auto: The Trilogy </em>bundle are still available on Steam. Current owners will also be able to download and access the games on their purchased platforms, Rockstar confirmed.</p></div><p><a href=\"https://arstechnica.com/?p=1802507#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1802507&amp;comments=1\">Comments</a></p>","author":"Steve Haske","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4ae5d611c3bbb8712c41e490a4f061d2c216f5330e90c9e032c4b758a2fce10c","category":"Tech"}