{"title":"A nature-based solutions approach to managing shrimp aquaculture effluent","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000076","date":1693404000000,"content":"<p>by Garrett M. Goto, Emily Corwin, Alexander Farthing, Anisa Rilla Lubis, Dane H. Klinger</p>\r\n\r\nWhile coastal habitat conversion was a primary environmental concern in Asia for the mostly extensive shrimp aquaculture sector in previous decades, the transition towards intensive production is creating new environmental risks, primarily water quality impacts from nutrient-rich effluent. There is a need to compare the performance of conventional and Nature-based Solution (NbS) effluent treatment options given the increasing nutrient loads from more intensive aquaculture and historic loss of ecosystem services from mangrove deforestation. This study evaluates the potential for common and emerging effluent treatment systems to address total nitrogen and total phosphorus effluent from shrimp farms across a spectrum of production intensities. Nutrient waste loading for four stocking density scenarios (7PLm<sup>-2</sup>, 20PLm<sup>-2</sup>, 75PLm<sup>-2</sup>, and 120PLm<sup>-2</sup>) are estimated to compare the treatment efficiency, economic feasibility, spatial requirements, and ecosystem service provision of conventional and NbS effluent treatment systems. We use secondary data to assess effluent treatment systems applicable for shrimp aquaculture in Asia. Findings provide the conceptual framework for comparing the characteristics and tradeoffs of aquaculture effluent treatment systems. Constructed mangrove wetlands are an NbS approach that can meet the intensification needs of aquaculture producers and reduce negative impacts from aquaculture effluent at competitive costs, while also providing ecosystem service co-benefits.","author":"Garrett M. Goto","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"4ae81f3ea785f50b39daefb411534e2f7690d15d2f82c5f587f5802ee79dffd2","category":"Environment"}