{"title":"★ Warner Bros. Discovery Is Really Going to Drop the ‘HBO’ Brand and Just Call Its Streaming Service ‘Max’","link":"https://daringfireball.net/2023/04/warner_max","date":1681336594000,"content":"\n<p><a href=\"https://press.wbd.com/us/media-release/warner-bros-discovery-unveils-max-streaming-service\">Warner Bros. Discovery</a>:</p>\n\n<blockquote>\n  <p>Warner Bros. Discovery today introduced Max, its enhanced\nstreaming service, which will launch in the U.S. on May 23. Max is\nthe destination for HBO Originals, Warner Bros. films, Max\nOriginals, the DC universe, the Wizarding World of Harry Potter,\nan expansive offering of kids content, and best-in-class\nprogramming across food, home, reality, lifestyle and\ndocumentaries from leading brands like HGTV, Food Network,\nDiscovery Channel, TLC, ID and more. Max will stand out amongst\nstreamers by uniquely combining unrivaled breadth and superior\nquality with iconic franchises and strong product experience, all\nfor great value.</p>\n</blockquote>\n\n<p>I would argue the opposite: that by cramming their entire disparate gamut of brands into a single service, none of them stand out, and the Max brand stands for nothing.<sup><a href=\"#fn1-2023-04-12\">1</a></sup></p>\n\n<blockquote>\n  <p>Max will offer three pricing options, giving subscribers the\nchoice to select which plan best fits the needs of their\nhousehold.</p>\n\n<ul>\n<li>Max Ad-Lite — $9.99/month or $99.99/year <br />\n2 concurrent streams, 1080p resolution, no offline downloads,\n5.1 surround sound quality</li>\n<li>Max Ad Free — $15.99/month or $149.99/year <br />\n2 concurrent streams, 1080 resolution, 30 offline downloads, 5.1 surround\nsound quality</li>\n<li>Max Ultimate Ad Free — $19.99/month or $199.99/year <br />\n4 concurrent streams, up to 4K UHD resolution, 100 offline\ndownloads, Dolby Atmos sound quality</li>\n</ul>\n</blockquote>\n\n<p>These prices are pretty much the same as <a href=\"https://www.netflix.com/signup/planform\">Netflix’s</a>, except that Netflix’s “basic with ads” tier (it’s adorable that Max is calling theirs “ad-lite”) is $7/month and, criminally, still limited to 720p resolution. <a href=\"https://www.disneyplus.com/welcome/disney-hulu-espn-bundle\">Disney+</a> currently offers two plans: $8/month with ads, or $11/month without (and with offline downloads). Disney+ also offers bundles with Hulu and ESPN+: $13/month with ads, $20/month without. Apple TV+ — with a growing but admittedly boutique-sized library compared to Max, Netflix, and Disney/Hulu — is $7/month, and has no tier with ads.</p>\n\n<p>When this “Max” name truncation was first rumored in December, <a href=\"https://daringfireball.net/linked/2022/12/06/cnbc-warner-max\">I wrote</a>:</p>\n\n<blockquote>\n  <p>Not the worst name they could go with. The mistake with “HBO Max”\nwas muddying the premium HBO brand with the “anything and\neverything” content of a unified app for everything this enormous\ncontent factory conglomerate puts online. My big question is what\nhappens to HBO content. Is it stuck in a tab inside the “Max” app,\nor will there be a standalone “HBO” app too?</p>\n</blockquote>\n\n<p>Looks like HBO is now just a brand inside the Max service. They’re ceding the “everything you get on this service is premium content, and there are no ads” ground to Apple TV+. HBO is still HBO on cable, but as the world inexorably moves to an all-streaming future, this feels like “corporate synergy” run amok. The non-HBO content in HBO Max already diluted the brand; now they’re putting even more non-premium content (all the Discovery crap) into the same app. (Today’s New York Times headline says it all: “<a href=\"https://www.nytimes.com/2023/04/11/business/media/max-streaming-warner-hbo.html\">‘Succession’ and ‘Dr. Pimple Popper’ Together in New Warner Streaming App</a>”.)</p>\n\n<p>Disney set the example Warner Bros. Discovery should have followed, with Disney+ and Hulu as separate apps, but priced together in a bundle. Disney isn’t relegating Disney+ content into a mere tab in the Hulu app, nor are they allowing Hulu’s content to dilute the prestigious Disney brand in the Disney+ app.</p>\n\n<p>HBO’s old slogan was “It’s not TV. It’s HBO”. That slogan captured HBO’s prestige: unedited major motion pictures, best-of-breed original content, all without commercial interruptions. HBO’s new slogan might as well be “It’s not TV. It’s a tab somewhere in the Max app.”</p>\n\n<div>\n<hr />\n<ol>\n<li>\n<p>The nomenclatural trend <em>du jour</em> for subscription services is to take your company’s existing well-known brand and tack on a suffix like <em>plus</em>, <em>max</em>, or <em>one</em>. Hence: Disney+, ESPN+, Paramount+, Apple TV+, Apple One. I think that’s what Warner was going for with the “Max” in HBO Max. So in some sense going with just plain “Max” makes no more branding sense than if Disney+ or Paramount+ had been named just “Plus”. But for those of you my age or older, <em>Max</em> also brings to mind Cinemax — Warner’s longtime cable-pay-channel sibling to HBO. Premium and commercial-free, like HBO, but clearly not <em>as</em> premium. HBO is <a href=\"https://www.baseball-reference.com/players/d/dimagjo01.shtml\">Joe DiMaggio</a>; Cinemax is <a href=\"https://www.baseball-reference.com/players/d/dimagdo01.shtml\">Dom DiMaggio</a>. HBO is the home of hall-of-fame groundbreaking original series like <em>The Sopranos</em>, <em>The Wire</em>, <em>The Larry Sanders Show</em>, <em>Curb Your Enthusiasm</em>, <em>Game of Thrones</em>, and <em>Succession</em>. Cinemax is the home of ... <a href=\"https://www.imdb.com/list/ls567109928/\">checks notes</a> ... <em>Banshee</em>, <em>The Knick</em>, <em>Warrior</em>, and <em>Mike Judge Presents: Tales from the Tour Bus</em>. Cinemax’s biggest claim to fame from my teenage years is that after a certain hour, they showed movies that earned them the nickname “<a href=\"https://screencrush.com/rip-skinemax/\">Skinemax</a>”. (Sleepovers were always preferably held at the homes of Cinemax subscribers.)</p>\n\n<p>No matter what Warner Bros. Discovery intends “Max” to mean, it feels damn stupid to lean even vaguely on Cinemax, and not at all on HBO, as a brand name. <a href=\"#fnr1-2023-04-12\">↩︎</a></p>\n</li>\n</ol>\n</div>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"4b024e15cfbe3e6a15b574846fd99c4fab82ac644b821ebdd050aca3897e443a","category":"Tech"}