{"title":"PSII-23 Egg production and quality in older Lohmann LSL lite hens in response to rearing space allowance and provision of omega-3 fatty acids and yeast bioactives from placement through to 17 wk of age","link":"https://academic.oup.com/jas/article/102/Supplement_3/700/7757648?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Rearing practices prior to sexual maturity have implications on hen performance. The objective of the current study was to evaluate egg production and quality in Lohmann LSL lite hens reared on low or high spacing allowances (SA) in enriched cages and fed diets with a source of omega-3 fatty acids (n-3 FA) or yeast bioactives (YB) from placement to 17 wk of age (woa). The high and low SA were: 348 cm<sup>2</sup>/bird; ~50 birds/cage) and 284 cm<sup>2</sup>/bird; ~68 birds/cage, respectively. The diets provided were control (C), C + 3% co-extruded full fat flaxseed and pulse mixture (FFF; 1:1 wt/wt) for n-3 FA and C + YB, yeast cell walls processed with β-1,3-glucan hydrolase (Tables 1-3). At the beginning of 18 woa, a total of 288 hens were placed in 72 enriched cages (4 hens/cage) based on rearing treatments (n = 12). The hens had ad libitum access to commercial layer diet and water. From 52 to 72 woa, eggs were recorded daily for calculation of hen day egg production (HDEP). Egg weight (EW), shell thickness (EST), shell breaking strength (ESBS), yolk color (YC), and Haugh unit (HU) were analyzed on bi-weekly basis. Egg mass was calculated based on EW and HDEP. Data were subjected to PROC GLIMMIX procedure of SAS with rearing SA, diets, and associated interactions as fixed effects. The cumulative impact of the diets on HDEP did not exhibit significant differences (Table 4). However, the space allowance (SA) demonstrated an effect (<span>P</span> &lt; 0.05) with hens reared in increased SA yielding greater HDEP (98.2 to 94.5%) compared with hens reared in decreased SA (94.0 to 90.8%) at 56, 58, 60, 63 and 71 woa. Furthermore, hens reared in SA exhibited greater HU values (<span>P</span> &lt; 0.05) throughout, although egg weight and mass were not affected (<span>P</span> &gt; 0.05; Table 5-8) by SA. In conclusion, under the conditions of the study, provision of n-3 FA and YB did not present noticeable carryover impact on egg production and quality during the mid to late laying cycle. However, rearing spacing allowance influenced egg production and quality. Suggesting, reducing rearing stress through the provision of higher space allowance prior to sexual maturity had carryover effects on hen productivity in late lay cycle.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4b0a4243f97e6a407bf88469344c17dd8fff329e445cb0178d47b7157577dda8","category":"Environment"}