{"title":"Impact Of SARS-CoV-2 Pandemic On The Diagnosis Of Cervical Cancer And Precursor Lesions - A Single Center Retrospective Study","link":"https://www.preprints.org/manuscript/202404.0371/v1","date":1712221178000,"content":"Objective: The aim of our study was to perform a retrospective analysis of the volume of cervical screening tests, the number of patients treated with an excision method, and the incidence of invasive and non-invasive cervical during a pandemic and pre-pandemic period of 24 months. Results: There was a statistically significant age difference between the two study periods, both by the average age of patients and by age group. The mean difference was 32 years before the pan-demic and 35 years during the pandemic (p-value &gt;0.05). The majority of patients presenting for investigations before and during the pandemic were in the 30-39-year-old age group (31.95%, respectively; 34.2% (p-value = 0.003). The biggest patient loss ratio identified by age group was in the 50–59 years: 14,53% in the pre-pandemic period and 9,1% in the pandemic period. In the pan-demic period, patients from rural areas presented in the clinical trial with a lower rate of 39.52% (83 patients) vs. 60.47% (127 patients) in urban areas. A higher percentage of patients experiencing cervicorrhagia as a clinical manifestation in the pandemic period vs. the prepandemic period, with an increase in more severe lesions in the pandemic period, has a statistical significance of 8% more newly diagnosed compared to the pre-pandemic period. Conclusion: The addressability of the patients during the COVID period was not affected in a drastic way in our study. We encountered a decrease in appointments in the age group 50–59 years and a decrease in patients with rural residence. In our study, we found an increase in cervicorrhagia as a reason for consultation in the pandemic period with a higher lesion degree, both on a pap smear and on a cervical biopsy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4b151aa40951e6a3ff280e18144e377713d37fcde3ba0a94c310df4d6d98982e","category":"Interdisciplinary"}