{"title":"Thermal Stability and Purity of Graphene and Carbon Nanotubes: Key Parameters for Their Thermogravimetric Analysis (TGA)","link":"https://www.preprints.org/manuscript/202406.0317/v1","date":1717591930000,"content":"Thermal analysis is widely employed for the characterization of nanomaterials. It encompasses a variety of techniques that allow the evaluation of the physicochemical properties of a material by monitoring its response under controlled temperature. In the case of carbon nanomaterials, such as carbon nanotubes and graphene derivatives, thermogravimetric analysis (TGA) is particularly useful to determine the quality and stability of the sample, presence of impurities and the degree of functionalization or doping after post-synthesis treatments. Furthermore, TGA is widely used to evaluate the thermal stability against oxidation by air, which can be for instance enhanced by the purification of the material and by nitrogen doping, finding application in areas where a retarded combustion of the material is required. Herein, we have evaluated key parameters that play a role in the data obtained from TGA. Within this study we show that the thermogravimetric curve of carbon nanomaterials is greatly influenced by these parameters. This is important in terms of data recording and their analysis, since a poor control of the conditions of measurement might lead to false conclusions. We highlight this by analyzing different samples of graphene and carbon nanotubes where both thermal stability and sample purity assessment are found to be dependent on the employed TGA parameters. Finally, a set of TGA parameters are recommended for the analysis of carbon nanomaterials to obtain reliable data.ยก","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4b18b861d671550facf57321270c152a0ce106e98d320673b3e5d96896daf5a7","category":"Interdisciplinary"}