{"title":"Cloudflare เปิดบริการให้อินเทอร์เน็ตชุมชนเข้ามาเชื่อมต่อฟรี","link":"https://www.blognone.com/node/123941","date":1627495327000,"content":"<div><div><div><p>Cloudflare เปิดตัว Project Pangea โครงการเชื่อมต่อบริการอินเทอร์เน็ตชุมชนเข้าสู่อินเทอร์เน็ตฟรี โดยให้บริการ Cloudflare Network Interconnect, Magic Transit, และ Magic Firewal โดยไม่มีค่าใช้จ่าย</p>\n<p>ผู้ให้บริการอินเทอร์เน็ตชุมชนต้องหาทางเชื่อมต่อเน็ตเวิร์คเข้าไปยังศูนย์ข้อมูลที่เป็นจุด peering ของ Cloudflare ด้วยตัวเอง โดยผู้ให้บริการบางรายอาจจะให้บริการอยู่ใกล้ๆ ศูนย์ข้อมูลจนสามารถเชื่อมต่อได้โดยตรง, บางรายอาจจะต้องลากสายใหม่เองหรือเช่าลิงก์จากผู้ให้บริการอื่น, หรืออินเทอร์เน็ตชุมชนจะรวมตัวกันเช่าลิงก์เข้าไปยังศูนย์ข้อมูลก็ได้ นอกจากนี้ผู้ให้บริการต้องหา IPv4 มาด้วยตัวเอง (กำลังรองรับ IPv6 ในอนาคต) เมื่อเชื่อมต่อได้แล้วก็จะสามารถใช้บริการต่างๆ ได้ฟรีที่แบนด์วิดท์ 5Gbps และยังมีเงื่อนไขห้ามขายแบนด์วิดท์ไปใช้งานอย่างอื่นนอกจากอินเทอร์เน็ตชุมชน</p>\n<p>Cloudflare ระบุว่าอินเทอร์เน็ตชุมชนนั้นไม่จำเป็นต้องเป็นพื้นที่ห่างไกล หรือชุมชนยากจนเสมอไป แต่หลายครั้งบางพื้นที่กลับเข้าไม่ถึงผู้ให้บริการอินเทอร์เน็ตรายใหญ่ก็สามารถรวมตัวกันเปิดบริการอินเทอร์เน็ตชุมชนกันเองได้ แต่ที่ผ่านมาค่าใช้จ่ายของผู้ให้บริการอินเทอร์เน็ตชุมชนกลายเป็นค่าเชื่อมต่ออินเทอร์เน็ตที่แพงกว่าค่าลากสายและดูแลลิงก์เสียอีก</p>\n<p>ผู้ให้บริการอินเทอร์เน็ตชุมชนที่สนใจสามารถส่งใบสมัครเข้าไปได้ที่<a href=\"https://www.cloudflare.com/pangea/\">หน้าเว็บโครงการ</a> สำหรับประเทศไทยสามารถเชื่อมต่อกับ Cloudflare ได้ผ่านทาง <a href=\"https://www.peeringdb.com/ix/2454\">CSL</a></p>\n<p>ที่มา - <a href=\"https://blog.cloudflare.com/pangea/\">Cloudflare</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f5568dbf73cea2f34a701afc32fa7170.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/cloudflare\">Cloudflare</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4b1bcfc4c80075da97b6d1f51b849f2ee25ec28103fa9ea224e1c82b8936dfd1","category":"Thai"}