{"title":"Antimicrobial Evaluation of Two Polycyclic Polyprenylated Acylphloroglucinol Compounds: PPAP23 and PPAP53","link":"https://www.preprints.org/manuscript/202406.1687/v1","date":1719223572000,"content":"Polycyclic polyprenylated acylphloroglucinols (PPAPs) comprise a large group of compounds of mostly plant origin. The best-known compound is hyperforin from St. John's wort with its antidepressant, antitumor and antimicrobial properties. Chemical synthesis of PPAP variants allows the generation of compounds with improved activity and compatibility. Here we studied two synthetic PPAP-derivatives, PPAP 23 and PPAP 53, as to their antimicrobial activity. While PPAP 23 is insoluble in water, PPAP 53, the sodium salt, is water-soluble. In vitro, both compounds exhibited good and comparable activity against methicillin-resistant Staphylococcus aureus (MRSA) and vancomycin-resistant Enterococcus faecium. Both compounds had no adverse effects on Galleria mellonella wax moth larvae, even at high concentrations. However, they were unable to protect the larvae from infection with S. aureus because components of the larval coelom neutralized the antimicrobial activity; a similar neutralizing effect was also seen with serum albumin. In a septic arthritis model triggered by S. aureus PPAP23 decreased the formation of abscesses and bacterial load in kidneys, and in a mouse skin abscess model topical treatment with PPAP 53 resulted in an approximately two-fold reduction in S. aureus counts. PPAP 23 and PPAP 53 also showed high growth inhibiting activity against anaerobic Gram-positive pathogenic gut bacteria such as Clostridium perfringens and Clostridium difficile. Based on these results, we envision potential application of PPAP 23 and PPAP 53 in the topical treatment of wound infections with Gram+ pathogens, and their oral use in intestinal infections with C. difficile.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4b1e8dbf28df132a8f0e4bfadf1e07af5f535d92e825fb739485d78c35616605","category":"Interdisciplinary"}