{"title":"Feeding protocol with live feed and inert diet to determine the ideal age/size for weaning mullet Mugil liza (Valenciennes, 1836)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15841?af=R","date":1718082582000,"content":"<h2>Abstract</h2>\n<p>The Lebranche mullet <i>Mugil liza</i> is a marine fish of great importance for artisanal and industrial fishing, as well as aquaculture. The use of live feeds during the larviculture phase of marine fish is a significant component of production costs. The present study evaluated the effects of the feeding transition on different larval stages of <i>M. liza</i>, from the combined supply of live feed (<i>Brachionus rotundiformis</i> + <i>Artemia franciscana</i>) and live + inert feed (<i>Artemia franciscana</i> + inert diet) until the weaning phase to only the inert diet. A total of 3240 <i>M. liza</i> larvae (weight 0.0133 ± 0.0062 g and length 0.793 ± 0.160 cm) were distributed among the 12 experimental units (<i>n</i> = 270), resulting in four groups with three replicates each. Treatment groups consisted of feed transition with <i>A. franciscana</i> (enriched metanauplii) to commercial inert feed starting weaning at four different larval ages: 28, 31, 34, and 37 days post hatching. Zootechnical performance indexes and intestinal histomorphometry were evaluated. Mortality, condition factor, and length variation coefficient did not show significant differences between treatments. Final weight, final length, weight gain, and length gain were significantly greater in larvae that started weaning at 31, 34, and 37 days post hatching. Weight coefficient of variation was significantly higher in larvae that started weaning at 28 days (67.51 ± 11.70) compared to 37 days (34.40 ± 7.30). In intestinal histology, villi height (180.3 ± 4.4) was significantly higher in larvae that started weaning at 37 days post hatching. Considering the evidence found in the present study, it is recommended to start weaning <i>M. liza</i> on the 31st day post-hatching, using a 2-day co-feeding protocol (31st and 32nd days). From the 33rd day after hatching, <i>M. liza</i> larvae can receive only commercial feed.</p>","author":"João Vitor de Azevedo Manhães, \nFernanda Regina da Silva, \nElenice Martins Brasil, \nMariana Rangel Pilotto, \nLucas Cardoso, \nFabio Carneiro Sterzelecki, \nMarina Cesconeto dos Santos, \nMarco Shizuo Owatari, \nCaio Magnotti, \nVinicius Ronzani Cerqueira","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"4b213aa7b48cde4a496df573fe0aa23ce16bf319c8ade8fb560de0f465c8ee3b","category":"Environment"}