{"title":"Final Eternals trailer is heavy on the exposition, eye-popping visuals","link":"https://arstechnica.com/?p=1788500","date":1629399084000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/eternals1-980x408.jpg\" /></div>\n        <p>\n          Eternals, assemble! (l-r) Kingo (Kumail Nanjiani), Makkari (Lauren Ridloff), Gilgamesh (Don Lee), Thena (Angelina Jolie), Ikaris (Richard Madden), Ajak (Salma Hayek), Sersi (Gemma Chan), Sprite (Lia McHugh), and Phastos (Brian Tyree Henry).                      [credit:\n                        YouTube/Marvel Studios                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Plot details have been scant to date for <a href=\"https://en.wikipedia.org/wiki/Eternals_(film)\"><em>Eternals</em></a>, Marvel's forthcoming film based on the <a href=\"https://en.wikipedia.org/wiki/Eternals_(comics)\">comic book series</a> of the same name created by Jack Kirby in 1976. We now have the final trailer, and it's a doozy: nearly three full minutes of mostly new footage, heavy on exposition and the striking CGI-heavy visuals Marvel is known for. The trailer also answers one obvious burning question: just where were these incredibly powerful eternal beings when all the action with Thanos wiping out half of humanity was going down? I mean, humanity really could have used their help.</p>\n<p>As <a href=\"https://arstechnica.com/gaming/2021/05/we-have-our-first-good-look-at-eternals-as-marvel-drops-extended-teaser/\">I've written previously</a>, the comic book storyline tells of alien Celestials who visited Earth a million years ago, creating two divergent races—the Eternals and the Deviants—by way of genetic experiments. Those experiments were also responsible for the rare emergence of mutations in certain humans, giving them super powers. The Eternals protect the human race from the Deviants, and the two races engage in recurrent violent clashes. The Eternals' immortality and powers come from cosmic energy and their ability to channel it. A new <a href=\"https://www.marvel.com/comics/issue/85560/eternals_2021_1\"><em>Eternals</em> comic series</a> was launched in January of this year, written by Kieron Gillen with art by Esad Ribić. </p>\n<p>We know the film takes place after the events of <a href=\"https://arstechnica.com/gaming/2019/04/avengers-endgame-is-three-of-marvels-best-films-rolled-into-one/\"><em>Avengers: Endgame</em></a> and that an unexpected tragedy will force the Eternals out of hiding to join forces with humans to fight their ancient enemy, the Deviants. An extended teaser dropped in May, set to a mournful cover of \"<a href=\"https://www.youtube.com/watch?v=xHa6a3FtPJg\">The End of the World.</a>\" The teaser didn't convey much information in terms of plot, but it did give us glimpses of our primary characters over the course of centuries.</p></div><p><a href=\"https://arstechnica.com/?p=1788500#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1788500&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4b2ba3aef1413b089be82fb3af22b581db546360ff0e88b55eef1dd722cec563","category":"Tech"}