{"title":"The must-have accessory for Apple’s AR headset will be an Apple One subscription","link":"https://www.macworld.com/article/1814982/services-secret-to-apple-headset.html","date":1683714600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>As Apple’s <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">Worldwide Developers Conference</a> approaches, so too does the rumored announcement of the company’s much-ballyhooed mixed reality headset. <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Expectations</a> for the device are high–as is the reported price tag–and much of the tech community is waiting with bated breath to see if Apple can deliver a game-changing device where other competitors have foundered.</p>\n\n\n\n<p>If Apple does manage to pull a rabbit out of its hat, the company will surely attribute that success to its signature ability to combine hardware and software into one seamless package, delivering a product in the way that only Apple can.</p>\n\n\n\n<p>But there’s another element of Apple’s business that will play a big part in whether or not Apple’s headset is a hit, and you don’t have to go very far down the company’s balance sheet to find it: services.</p>\n\n\n\n<h2>Yes, service</h2>\n\n\n\n<p>Apple’s services have fast become one of the most important segments of its business, second only to the iPhone in terms of the revenue it brings in. But even before they were grouped together as a business unit, these ingredients have long played a key role in Apple products, providing the glue that bonds the ecosystem together.</p>\n\n\n\n<p>So it’s little surprise that any new platform the company launches would rely heavily on services. As my colleague Jason Snell pointed out a few weeks ago, one of Apple’s strengths is its ability to <a href=\"https://www.macworld.com/article/1790302/ar-headset-platform-iphone-ios.html\">reuse the same technology</a>, helping bootstrap its various platforms by not having to reinvent the wheel.</p>\n\n\n\n<p>That’s even more the case with services. Any device the company decides to launch is sure to tie in with the various services the company already offers, giving it a leg up on competitors that may have to either spin up their own offerings or, more likely, integrate with third parties in order to bring crucial content to the table. But since Apple already has all of these services at its fingertips, the company basically gets to start on third base. That’s a major mark in favor of any new Apple product, but especially a mixed-reality headset.</p>\n\n\n\n<h2>Head of the class</h2>\n\n\n\n<p>Almost every single service that Apple has could have big advantages for a mixed reality headset, and it’s not even a stretch to envision what they could offer.</p>\n\n\n\n<p>Media consumption services like Apple TV+ and Apple Music are a no-brainer: imagine watching movies with friends <a href=\"https://www.macworld.com/article/558669/ar-vr-headset-animoji-shareplay-spatial-audio.html\">via SharePlay on an enormous virtual screen</a>. Or an outdoor concert put on by Apple in a virtual venue. That’s built-in content that’s available to an Apple headset at little additional cost to the company or—for those who already subscribe to Apple’s services–the user.</p>\n\n\n<div><figure><img src=\"https://bilder.macwelt.de/4318647_original.jpg?quality=50&amp;strip=all\" alt=\"Apple Fitness+\" loading=\"lazy\" /><figcaption><p>Apple Fitness+ is a natural fit with a mixed-reality headset.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Add on to that Apple’s existing interactive services, Apple Arcade and Apple Fitness+, and it’s easy to see the applications there as well. Both gaming and fitness have proved to be significant markets for existing headsets, and with fitness and health being a particular focus area for Apple, it’s hard to imagine that the company doesn’t have a plan in place to use that as a killer app: virtual workouts in fun locations, for example, or maybe even specific workout types that take advantage of what the headset can do. This is also a glowing opportunity to meld these two categories into one; gamified fitness options have already proved successful on devices of this kind. (Just ask players of Beat Saber or Supernatural.)</p>\n\n\n\n<p>There are also the ancillary services that Apple relies on: iCloud is sure to be a big part of any forthcoming device from the company, letting you log into your account and have instant access to all of your data. The App Store, likewise, will be absolutely critical to the headset’s future as it enables third-party development. And more than a few customers are going to want to protect an expensive investment with Apple Care.</p>\n\n\n\n<p>And then there’s Apple News…ah, well, they aren’t all going to be winners.</p>\n\n\n\n<h2>Foundation…and empire?</h2>\n\n\n\n<p>Looking at the way all of these services are poised to come into play with an Apple headset illustrates how Apple has positioned itself for success in almost any new product category that comes along. Yes, the Services category has the benefit of providing recurring revenue for the company, and that’s great, but even more importantly it also gives Apple a solid foundation on top of which to build any new platform–much in the same way that existing iPad apps are likely to provide a solid base layer for software for the device.</p>\n\n\n\n<p>Of course, that doesn’t mean that Apple can simply snap its fingers and dump its service into a brand-new platform. It still needs to do the work of actually adapting these services to that platform–including a brand new interface–but in the case of the headset, it does mean that it has a variety of existing things it can leverage to provide compelling use cases from the jump.</p>\n\n\n\n<p>Because here’s the important thing to take away: the headset is fundamentally a product built atop <em>experiences</em>. And that’s precisely what Apple has designed its services to enable.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4b33d1ec8c01d70a399f46f3d7c1317c549c59c64b2c9fcd10e638015ab3db0f","category":"Apple"}