{"title":"Quantifying Prescribed‐Fire Smoke Exposure Using Low‐Cost Sensors and Satellites: Springtime Burning in Eastern Kansas","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023GH000982?af=R","date":1711620632000,"content":"<h2>Abstract</h2>\n<p>Prescribed fires (fires intentionally set for mitigation purposes) produce pollutants, which have negative effects on human and animal health. One of the pollutants produced from fires is fine particulate matter (PM<sub>2.5</sub>). The Flint Hills (FH) region of Kansas experiences extensive prescribed burning each spring (March-May). Smoke from prescribed fires is often understudied due to a lack of monitoring in the rural regions where prescribed burning occurs, as well as the short duration and small size of the fires. Our goal was to attribute PM<sub>2.5</sub> concentrations to the prescribed burning in the FH. To determine PM<sub>2.5</sub> increases from local burning, we used low-cost PM<sub>2.5</sub> sensors (PurpleAir) and satellite observations. The FH were also affected by smoke transported from fires in other regions during 2022. We separated the transported smoke from smoke from fires in eastern Kansas. Based on data from the PurpleAir sensors, we found the 24-hr median PM<sub>2.5</sub> to increase by 3.0–5.3 μg m<sup>−3</sup> (based on different estimates) on days impacted by smoke from fires in the eastern Kansas region compared to days unimpacted by smoke. The FH region was the most impacted by smoke PM<sub>2.5</sub> compared to other regions of Kansas, as observed in satellite products and in situ measurements. Additionally, our study found that hourly PM<sub>2.5</sub> estimates from a satellite-derived product aligned with our ground-based measurements. Satellite-derived products are useful in rural areas like the FH, where monitors are scarce, providing important PM<sub>2.5</sub> estimates.</p>","author":"Olivia Sablan, \nBonne Ford, \nEmily Gargulinski, \nMelanie S. Hammer, \nGiovanna Henery, \nShobha Kondragunta, \nRandall V. Martin, \nZoey Rosen, \nKellin Slater, \nAaron van Donkelaar, \nHai Zhang, \nAmber J. Soja, \nSheryl Magzamen, \nJeffrey R. Pierce, \nEmily V. Fischer","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"4b33e95f6d716343b0e0a962fb98ce4a30e680a4af16d4e05e151ce635c20a7d","category":"Environment"}