{"title":"YouTube Music continues glacial development pace, adds background playback","link":"https://arstechnica.com/?p=1801139","date":1633453867000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/06/YouTube-Music-Money-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/06/YouTube-Music-Money.jpg\">Enlarge</a> <span>/</span> Welcome to YouTube Music. Please swipe your credit card here.  (credit: <a href=\"https://commons.wikimedia.org/wiki/File:Money_Cash.jpg\">Jericho / Ron Amadeo</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>October marks the first anniversary of the <a href=\"https://arstechnica.com/gadgets/2020/10/rip-google-play-music-2011-2020/\">death of Google Play Music</a>, leaving only the sad shadow of a replacement music service, YouTube Music, in Google's ecosystem. YouTube Music is showing just how far behind the streaming music wars it is with the announcement of a new feature: <a href=\"https://canada.googleblog.com/2021/10/dont-stop-music.html\">background music playback</a>. Previously, playing a streaming song on the ad-supported YouTube Music app would only work if you had the app open—navigating to something else on your phone would stop the music. Now, five years after the service's launch and one year after the shutdown of Google Play Music, you can use YouTube Music like—well—a music app without paying for YouTube Premium.</p>\n<p>One last detail: this extremely basic feature is only rolling out to Canada next month. For now, everyone else still can't use YouTube Music like a regular streaming music app without paying for the service. Google says that free background playback will be available to \"listeners around the world\" at some point, but it hasn't said when.</p>\n<p>SoundCloud and Spotify offer free background streaming—as did Google Play Music before it was shut down—but YouTube Music hasn't been able to replicate that feature for the past five years. Subscribers to the $9.99 YouTube Music Premium have been able to play music in the background, and the feature is available for music you've uploaded yourself. But if you were listening to the ad-supported streaming catalog, the music just stopped in the background.</p></div><p><a href=\"https://arstechnica.com/?p=1801139#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1801139&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4b4d16cfe2a76ecf0159270a0551bf22357866462260072567b20953fc1f02e0","category":"Tech"}