{"title":"PSXIII-16 Kinematics and viability of spermatozoa from Criollo and Angus bulls in a low-input system","link":"https://academic.oup.com/jas/article/102/Supplement_3/715/7757925?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The Chihuahuan Criollo cattle is a genetic resource with special adaptive characteristics to rough, arid and semi-arid ecosystems. There is a great interest in incorporating such adaptations into beef production systems as one of the strategies for sustainable production to face the climate change challenge. Reproductive success is determinant to achieve sustainability in animal production systems. Most research efforts to improve reproductive efficiency have focused on the study of females. However, it has been shown that much of the economic losses caused by embryonic deaths are due to the bull. The aim of this study was to evaluate the quality of thawed semen from Angus and Criollo bulls kept in a low-input system. Thirteen healthy bulls (n = 7 Angus and 6 = Chihuahuan Criollo), with an average age of 4.3 ± 0.48 yr, grazing in the same rangeland and subjected to natural pasture conditions, were studied. Semen obtained by electroejaculation, were frozen and subsequently thawed for analyses. Characteristics of motility, vitality (V), morphology (M) and plasma membrane integrity (PMI) were evaluated in fresh and thawed semen, whereas movement kinetics (MK) and acrosome reaction (AR) were evaluated in thawed semen. Statistical analysis was performed using the PROC GLM of SAS Studio 2022 including the fixed effects of breed, semen condition and their interaction for variables of progressive motility (PM), V, M, PMI and the effect of breed for variables of MK and AR. As expected, PM and V were less (<span>P</span> &lt; 0.05) in thawed (57.93 ± 4.1 and 53.69 ± 2.7) compared with fresh (72.64 ± 3.9 and 74.98 ± 2.6) semen, whereas no differences (<span>P</span> &gt; 0.05) were found in M. However, the interaction between semen condition and breed for PMI tended to the significance (<span>P</span> = 0.08) with a PMI of 68.95 ± 4.6 and 58.98 ± 4.3 for Criollo and Angus, respectively, in fresh semen, whereas in thawed semen this difference was inverted (52.08 ± 4.6 and 58.40 ± 4.6). It is important to note that the semen retained quality traits with values above the minimum accepted for use in artificial insemination, despite the scarcity of resources of the system in which the animals were kept. There were no differences by breed in the main MK variables; however, AR reported as live unreacted sperm was less (<span>P</span> &lt; 0.05) in Criollo (40.49 ± 4.49) compared with Angus bulls (58.48 ± 4.49). In conclusion, it is important to incorporate the assessment of membrane integrity and acrosome reaction in thawed semen evaluation to obtain a more accurate prediction of the potential fertility of samples, even if motility parameters appear to be optimal.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4b507bdcbaa995075cb56bee0e487f602696eed05d1a956d50bfb45d344265f9","category":"Environment"}