{"title":"Research on Aerodynamic Characteristics and Pitch Regulated Control Strategy of Coaxilcopter with Variable Rotor Spacing","link":"https://www.preprints.org/manuscript/202404.0020/v1","date":1711958671000,"content":"This study investigates the impact of rotor spacing on the aerodynamic performance of a coaxialcopter. It has been observed that a small distance between two rotors can result in significant interaction between the propellers, consequently affecting the rotor's aerodynamic efficiency. Exploiting this characteristic, the present research introduces a coaxialcopter with variable rotor spacing. Employing finite element numerical simulations, we assess the aerodynamic behavior of this novel configuration. Through comprehensive measurements and analysis of its aerodynamic performance across varying rotor spacings from 0.1R to 1R, we validate the effectiveness of a rotor spacing control strategy for enhancing takeoff maneuvers. Our numerical simulation results reveal that the performance characteristics of both upper and lower rotor converges toward that of a single rotor as pitch ratio increases, along with the reduce of their thrust fluctuations and aerodynamic performance periodicity. Considering stable power consumption patterns and endurance performance, we analysis the interrelations binding of pitch distance of the rotors, rotational speed, and pitch angle, vis-à-vis the thrust coefficient and power coefficient. Through parameter optimization method, we demonstrate that adjusting rotor spacing offers a practical means to enhance payload capacity without increasing power input, thereby improving the efficiency, which validates the practicality and efficacy of the parameter optimization approach. Furthermore, optimizing rotor spacing for specific operational scenarios enhances overall aerodynamic performance, suggesting a viable flight control strategy for takeoff and landing conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4b578e78dbc3fca2d940c485666357c8c36aa2f07b57ec1d760a71b11478d708","category":"Interdisciplinary"}