{"title":"Risk factors for postoperative ileus in hysterectomy: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308175","date":1722520800000,"content":"<p>by Zhuoer Hou, Ting Liu, Xiaoyan Li, Hangpeng Lv, Qiuhua Sun</p>\r\nObjective <p>The study intended to evaluate the risk factors of postoperative ileus in hysterectomy patients.</p> Study design <p>Systematic review and meta-analysis.</p> Methods <p>This study conducted a systematic review and meta-analysis in accordance with the Preferred Reporting Program for Systematic Review and Meta-analysis statement. PubMed, Web of Science, Embase, the Cochrane Library and China National Knowledge Internet were searched. The search period was restricted from the earliest records to March 2024. Key words used were: (hysterectomy) AND (postoperative ileus OR postoperative intestinal obstruction OR ileus OR intestinal obstruction). Two researchers screened literatures and extracted data, and used Newcastle-Ottawa scale and Joanna Briggs Institute critical appraisal checklist for analytical cross-sectional studies to evaluate their quality. Then, Stata17 software was used for statistical analysis.</p> Result <p>A total of 11 literatures were included. Personal factors and previous history of disease factors of postoperative ileus in hysterectomy patients included use opioids (OR = 3.91, 95%CI: 1.08–14.24), dysmenorrhea (OR = 2.51, 95%: 1.25–5.05), smoking (OR = 1.55, 95%: 1.18–2.02), prior abdominal or pelvic surgery (OR = 1.46, 95%CI: 1.16–1.83) and age (OR = 1.03, 95%: 1.02–1.04). Surgery-related factors included perioperative transfusion (OR = 4.50, 95%CI: 3.29–6.16), concomitant bowel surgery (OR = 3.79, 95%CI: 1.86–7.71), anesthesia technique (general anesthesia) (OR = 2.73, 95%CI: 1.60, 4.66), adhesiolysis (OR = 1.97, 95%CI: 1.52–2.56), duration of operation (OR = 1.78, 95%CI: 1.32–2.40), operation approach (laparoscopic hysterectomy) (OR = 0.43, 95%CI: 0.29–0.64) and operation approach (vaginal hysterectomy) (OR = 0.35, 95%CI: 0.18–0.69).</p> Conclusions <p>The results of this study were personal factors and previous history of disease factors, surgery-related factors, which may increase the risk of postoperative ileus in hysterectomy patients. After the conclusion of risk factors, more accurate screening and identification of high-risk groups can be conducted and timely preventive measures can be taken to reduce the incidence of postoperative ileus.</p> Trial registration <p>The study protocol for this meta-analysis was registered (CRD42023407167) with the PROSPERO database (www.crd.york.ac.uk/prospero).</p>","author":"Zhuoer Hou","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4b607fbb3adb21864ea7cccb9403ed31715be5d1461b5394b08111fbc29ef995","category":"Interdisciplinary"}