{"title":"Last-Minute iPhone 15 Report Reveals New Battery Life, Design, and Camera Details","link":"https://www.macrumors.com/2023/09/08/last-minute-iphone-15-report-reveals-new-details/","date":1694172098000,"content":"<em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> today shared his <a href=\"https://www.bloomberg.com/news/articles/2023-09-08/apple-event-2023-iphone-15-pro-max-airpods-watch-series-9-products-to-expect\">expectations</a> for Apple's \"Wonderlust\" event, revealing several significant new features for the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> and <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> models. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iPhone-15-Blue-Three-Quarters-Perspective-Camera-Closeup-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nGurman claims that the new titanium chassis of the ‌iPhone 15 Pro‌ models will be more durable, reduce weight by around 10 percent, and have a brushed effect, unlike the polished finish of the current devices that have stainless steel frames, to reduce fingerprints. The edges where the metal sides and glass front and back of the device meet are now more smooth and rounded. He added that the displays of both Pro models will look perceptibly larger due to their reduced bezels, which are about one-third smaller. \r<br />\n\r<br />\nWhile the A17 Bionic will offer improved performance thanks to its first-of-its-kind <a href=\"https://www.macrumors.com/guide/3nm/\">3nm</a> fabrication process, one of the main benefits of the chip will apparently be enhanced battery life. The <a href=\"https://www.macrumors.com/roundup/iphone-14-pro/\">iPhone 14 Pro</a> and ‌iPhone 14 Pro‌ Max currently have a battery life of around 23- and 29-hours, respectively. The next-generation devices will also feature more memory, increasing from the 6GB of memory that have been offered in Pro <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> models in recent years.\r<br />\n\r<br />\nThe new \"Action Button\" that replaces the mute switch have customizable functionality to perform tasks including \"silencing the phone, turning on a Focus mode, opening the flashlight, launching the camera, starting a voice recording, opening <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> shortcuts, pulling up the digital magnifying glass and opening accessibility settings.\"\r<br />\n\r<br />\nIn addition, the ‌iPhone 15 Pro‌ and ‌iPhone 15 Pro‌ Max's telephoto and ultra wide cameras will feature more megapixels than their predecessors, increasing beyond 12-megapixels for the first time. Gurman also clarified that the ‌iPhone 15 Pro‌ Max will retain its \"Pro Max\" moniker, and will not be branded as an \"Ultra\" model as some previous rumors have suggested.\r<br />\n\r<br />\nBoth the standard and the Pro ‌iPhone‌ models will feature an all-new \"U2\" ultra wideband chip, the first iteration of the component since the U1 chip's introduction in the ‌iPhone‌ 11 Pro in 2019. The new chip will improve location capabilities, allowing people and devices to be tracked more precisely in the <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> App. It is apparently set to come to all of the next versions of Apple's major products. Another improvement coming to the entire ‌iPhone‌ lineup is faster wireless charging speeds and a more repairable design.\r<br />\n\r<br />\nGurman also reiterated several previously reported rumors, such as the <a href=\"https://www.macrumors.com/guide/dynamic-island/\">Dynamic Island</a>, A16 Bionic chip, and 48-megapixel main camera coming to the ‌iPhone 15‌ and ‌iPhone 15‌ Plus, as well as the ‌iPhone 15 Pro‌ Max's periscope telephoto camera with up to 6x optical zoom.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a>, <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/08/last-minute-iphone-15-report-reveals-new-details/\">Last-Minute iPhone 15 Report Reveals New Battery Life, Design, and Camera Details</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/last-minute-iphone-15-report-reveals-new-battery-life-design-and-camera-details.2400802/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4b6371f9ece180c76f47f42a981962eb1194035dca44513d0332523d01ae8183","category":"Apple"}