{"title":"Tropical agroforestry supports insect pollinators and improves bean yield","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14629?af=R","date":1710515327000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/e43a319e-1953-4029-82c8-4b9a97f71086/jpe14629-toc-0001-m.png\" alt=\"Tropical agroforestry supports insect pollinators and improves bean yield\" />\n<p>This study showed that, compared to monoculture, agroforestry generally promotes pollination services in a tropical context. Furthermore, we found that agroforestry is likely to be particularly helpful for pollinators when it increases flower abundance and plant richness and if it is coordinated so that woody cover also increases at the landscape scale.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPollination services contribute to crop productivity worldwide, but insect pollinators are declining in most agricultural landscapes, mainly due to agricultural expansion and an increase in intensive agricultural practices. To reduce the negative effects of agricultural expansion and intensification, farmers can adopt ecological interventions, such as diversifying agricultural systems through agroforestry. However, there have been variable results on the effectiveness of agroforestry in enhancing pollinators and pollination services. Furthermore, most of the information has been generated in temperate regions, while the impact of agroforestry in tropical East Africa is largely unknown.\n\nUsing common beans (<i>Phaseolus vulgaris</i> L.) as the focal crop, this study tested whether a tropical agroforestry system called Chagga home gardens supports pollinator communities and improves pollination and crop yield. We examined 16 agroforestry plots paired with 16 non-agroforestry plots located along a gradient of woody (trees and shrubs) cover within a 1-km radius to document the abundance, species richness and visitation rates of pollinating insects on bean flowers and how they contributed to bean yield.\n\nThe beans planted in the agroforestry plots had almost twice the abundance of insect pollinators, three times the richness of the species and almost twice the visitation rates than those planted in non-agroforestry plots. We also found a significant positive effect of woody cover in the surrounding landscape on insect pollinator abundances, but not on species richness and visitation rates. Additionally, the abundance and richness of insect pollinators increased significantly with flower abundance, while the overall plant richness in a plot significantly increased insect pollinator abundance and their visitation rate. The difference in bean yield between unbagged flowers (in which insect pollinators were allowed to access bean flowers) and bagged flowers and the total yield were higher in agroforestry than in non-agroforestry plots.\n\n<i>Synthesis and applications</i>. This study showed that, compared to monoculture, agroforestry generally promotes pollination services in a tropical context. Furthermore, we found that agroforestry is likely to be particularly helpful for pollinators when it increases flower abundance and plant richness and if it is coordinated so that woody cover also increases at the landscape scale.\n</p>","author":"Nanyika Kingazi, \nRuwa‐Aichi Temu, \nAgnes Sirima, \nMattias Jonsson","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"4b66b99654915eb04a99fa7772f7a6d1ac01f3494bd9d76ad8c25dc45d1c833c","category":"Environment"}