{"title":"Patterns and outcomes of acute toxicological cases before, during, and after COVID-19 lockdown in Sohag University hospitals, Egypt","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae061/7645259?rss=1","date":1712966400000,"content":"<span><div>Abstract</div><div>Background</div>Toxicologists manage poisoning by preventing, detecting, and treating it, which requires continuous data collection and analysis of toxicological hazards.<div>Aim of the work</div>The study aims to report and compare the pattern and outcome of acute toxicological cases admitted to Sohag University Hospitals during the COVID-19 lockdown (2020–2021) with the year before (2019) and the year after (2022).<div>Methods</div>This comparative study reviewed the sociodemographic and clinical data in the medical records. The study showed that Sohag University Hospitals received 670 toxicological cases between 2019 and 2022; 105 cases in 2019, 347 cases in 2020–2021, and 218 cases in 2022.<div>Results</div>Most of patients were below seven years with no sex differences. Accidental poisoning was the most frequent toxicity. The oral route was the most common in the three studied periods. During the lockdown, metal phosphide was the most frequent (19.0%), while therapeutic agents were the most reported after the lockdown (23.9%). The delay time showed a significant difference between the studied periods (<span>p</span>-value &lt; 0.001). In the three studied periods, complete recovery was achieved in more than 70% of cases; however, the mortality rate and the rate of complications during the lockdown period (10.4% and 9.5%, respectively) were almost twice those of the year before and the year after the pandemic with significant odds ratio of mortality during pandemic (OR) 0.07 CI 95% (0.02, 0.11).<div>Conclusion</div>The pandemic had a bad impact on outcomes as showed the highest percentage of mortality compared to before and after COVID-19 periods.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"4b6a771dd0a5b74293460319b6d5e1817cd5cb063c63becf3f0027731186271b","category":"Environment"}