{"title":"Vulnerabilities in Supermicro BMCs could allow for unkillable server rootkits","link":"https://arstechnica.com/?p=1973415","date":1696458070000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/07/chip-based-rootkit-800x534.jpeg\" alt=\"Vulnerabilities in Supermicro BMCs could allow for unkillable server rootkits\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/07/chip-based-rootkit.jpeg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>If your organization uses servers that are equipped with baseboard management controllers from Supermicro, it’s time, once again, to patch seven high-severity vulnerabilities that attackers could exploit to gain control of them. And sorry, but the fixes must be installed manually.</p>\n<p>Typically abbreviated as BMCs, baseboard management controllers are small chips that are soldered onto the motherboard of servers inside data centers. Administrators rely on these powerful controllers for various remote management capabilities, including installing updates, monitoring temperatures and setting fan speeds accordingly, and reflashing the UEFI system firmware that allows servers to load their operating systems during reboots. BMCs provide these capabilities and more, even when the servers they’re connected to are turned off.</p>\n<h2>Code execution inside the BMC? Yup</h2>\n<p>The potential for vulnerabilities in BMCs to be exploited and used to take control of servers hasn’t been lost on hackers. In 2021, hackers exploited a vulnerability in BMCs from HP Enterprise and installed a custom rootkit, researchers from Amnpardaz, a security firm in Iran, <a href=\"https://threats.amnpardaz.com/en/2021/12/28/implant-arm-ilobleed-a/\">reported</a> that year. ILObleed, as the researchers named the rootkit, hid inside the iLO, a module in HPE BMCs that’s short for Integrated Lights-Out.</p></div><p><a href=\"https://arstechnica.com/?p=1973415#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1973415&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4b7c87c07ce18c947f617af35763f1caf8e5738fb9699fe7584e206396f69c60","category":"Tech"}