{"title":"To lose the jersey or keep the jersey? Why ceding a Grand Tour lead is not as simple as it seems","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/to-lose-the-jersey-or-keep-the-jersey-why-ceding-a-grand-tour-lead-is-not-as-simple-as-it-seems","date":1683573586000,"content":"\n      <p>One of the many confusing contradictions of professional cycling for the uninitiated is the idea of trying to lose a jersey that you’re also eventually aiming to win.</p>\n<div></div>\n<p>To the seasoned cycling fan it makes perfect sense; hand over the overall leadership to a rider that poses an unlikely threat to your chances and avoid the endless podiums, interviews, and mandatory doping control that follows a Grand Tour stage and get to your hotel earlier every night.</p>\n<p>But in pure sporting terms it is difficult to fully explain. In how many other major sports would you voluntarily lose your lead to ultimately win? Still, it’s an almost tried and tested formula in cycling at this point, hence the scarcity of someone holding the lead from start to finish in a Grand Tour in the modern era.</p>\n<p><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2023-stage-four-preview\"><em>Read more: Giro d'Italia 2023 stage four preview - a taste of the Apennines</em></a></strong></p>\n<p>Relinquishing the jersey might as well, to a certain extent, afford the leader’s team a reprieve from the responsibility of control within the peloton, but it too comes with its own efforts and risks. Who’s getting in the breakaway? How much of a threat do they pose? How much time do you give them? In the early stages of a Grand Tour when time gaps are not so distinct, it’s a difficult balancing act for a team to master.</p>\n<p>This is the scenario facing Soudal-Quick-Step on stage four of the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>. The race leader, Remco Evenepoel, has already confidently declared he’ll attempt to cede the <em>maglia rosa</em> to a rider in the breakaway – assuming the medium mountain stage plays out in the way it’s expected – either because or despite his dominance so far, depending on your point of view.</p>\n<p>On the one hand, for the reasons stated above, there’s some very tangible benefits to giving up the race lead. Plus, considering his time trial performance on day one, there’s probably no shortage of confidence within himself that he’ll be able to claim it back on stage nine’s 35km effort against the clock.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GM203658.jpg?v=1683573444\" alt=\"Remco Evenepoel\" /></div>\n<p>On the other hand, managing the breakaway on stage four does not look, on paper, like a straightforward affair. Forty-nine riders remain within three minutes of Evenepoel, and it will be tricky to ensure that the right combination of riders go up the road without an unwanted GC threat slipping in there; should that transpire, the onus on chasing will fall to Soudal-Quick-Step.</p>\n<p>There’s extra difficulty for Evenepoel too. He’s lucky enough to still be under-25, so losing the <em>maglia rosa</em> won’t cut down many of his post-race formalities unless a rider eligible for the white jersey also makes it to the finish in the escape.</p>\n<p>From a perhaps naive sentimental perspective, it also feels like a slight affront to watch race leaders give up the prestigious jerseys so easily, particularly when you don’t know if you’ll ever see it again (eg. Primož Roglič, Giro d’Italia 2019). Understandably, mitigating you and your team’s efforts for as long as possible is of great value in such a gruelling event, but the aim to lose days in any of the Grand Tour leader’s jerseys in some ways just doesn’t feel right.</p>\n<p>Moreover, from the outside it looks like Evenepoel thrives on leading the way. He did so for much of the Vuelta a España last year with great assurance after taking the red jersey on stage six and, alongside the likes of Tadej Pogačar or Jonas Vingegaard, has the seemingly immeasurable talent to actually pull off leading a three week race from start to finish.</p>\n<p>So to keep the jersey or lose the jersey? If Evenepoel has his way it seems somewhat inevitable that the Giro lead will switch hands on Tuesday, but the unpredictable nature of a Grand Tour may not make this smooth sailing for the young Belgian. Still, the rainbow bands aren’t a bad substitute.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4b807585f25063925e51e42fd78da9280698d4db9aa89ffeb5beaaafd2d2fac0","category":"Cycling"}