{"title":"A New Casjensviridae Bacteriophage Isolated from Hospital Sewage Effectively Disrupt Biofilms of Carbapenem Resistant Klebsiella pneumonia Clinical Isolates","link":"https://www.preprints.org/manuscript/202405.2177/v1","date":1717396266000,"content":"Klebsiella pneumoniae, a member of the ESKAPE pathogen group, is a prominent cause of hospital-acquired infections. The WHO recognized carbapenem-resistant K. pneumoniae as a critical-one priority pathogen. These resilient superbugs have the ability to form biofilms and present a significant global threat. In the present study, we isolated and characterized a bacteriophage SAKp02, from hospital sewage, infectious to carbapenem-resistant K. pneumoniae patient isolates. SAKp02 could infect 43 of 72 clinical isolates, indicating a broad host spectrum. Whole genome analysis classified SAKp02 within the family Casjensviridae, with a 59,343 bp genome encoding 82 ORFs. Comparative genomic analysis revealed significant differences between SAKp02 and its closest viruses, indicating a distinct genetic makeup positioning it as a novel phage strain within the lineage. The SAKp02 genome comprises bacteriolytic enzymes, including holin, endolysin, and phage depolymerase, crucial for bacterial lysis and biofilm disruption. It reduced biofilm biomass by over threefold compared to the control and eradicated 99% of viable cells within a 4-hour treatment period. Scanning electron microscopy corroborated the ability of the phage to dismantle biofilm matrices and lyse bacterial cells. Safe and effective treatments are warranted, and hence, the fully characterized lytic phages with therapeutic potential against drug-resistant clinical isolates of bacteria are needed. Our study is the first to report the antibacterial and antibiofilm activity of Casjensviridae phages, and our discovery of a novel K. pneumoniae phage broadens the arsenal against the bacteria.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4b8c51bcbcfa407a665bf8fe078cfb1ca7c36a71cde3e49d8108b3c72260929e","category":"Interdisciplinary"}