{"title":"Active packaging coating based on <i>Lepidium sativum</i> seed mucilage and propolis extract: Preparation, characterization, application and modeling the preservation of buffalo meat","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311802","date":1728482400000,"content":"<p>by Fatemehe Majdi, Behrooz Alizadeh Behbahani, Hassan Barzegar, Mohammad Amin Mehrnia, Morteza Taki</p>\r\n\r\nBuffalo meat is naturally perishable, making it susceptible to spoilage due to its high moisture content and vulnerability to microbial contamination. Edible coatings have attracted attention as a packaging method that can prolong the shelf life of meat. The study aimed to examine the impact of a combination of <i>Lepidium sativum</i> mucilage (LS) coating and propolis extract (PE) on prolonging the shelf life of buffalo meat. The chemical characteristics (chemical compounds, total phenol content (TPC), total flavonoid content (TFC), antioxidant activity, and cytotoxicity) and antimicrobial activity of the PE (disk diffusion agar, well diffusion agar, minimum inhibitory concentration, and minimum bactericidal concentration) were investigated. The effect of the PE on the cell wall of pathogenic bacteria was examined using a scanning electron microscope. Biological properties of LS (TPC, TFC, antioxidant activity and antimicrobial effect (pour plate method)) was investigated. Different concentrations of PE (0, 0.5, 1.5, and 2.5%) were added to the coating mixture containing LS, and their effects on extending the shelf life of buffalo meat samples stored at 4°C for 9 days were assessed. The PE included gallic acid, benzoic acid, syringic acid, 4–3 dimethoxy cinnamic acid, <i>p</i>-coumaric acid, myricetin, caffeic acid, luteolin, chlorogenic acid, and apigenin. The PE was determined to have a TPC of 36.67 ± 0.57 mg GAE/g and a TFC of 48.02 ± 0.65 mg QE/g. The extract’s radical scavenging activity ranged from 0 to 76.22% for DPPH radicals and from 0 to 50.31% for ABTS radicals. The viability of C115 HeLa cell was observed to be 94.14 μg/mL. The PE and LS, exhibited strong antimicrobial properties against pathogenic bacteria. The LS was determined to have a TPC of 15.23 ± 0.43 mg GAE/g and a TFC of 11.51± 0.61 mg QE/g. The LS was determined to have a DPPH of 429.65 ± 1.28 μg/mL and a ABTS of 403.59 ± 1.46 μg/mL. The microbiological analysis revealed that the LS+2.5%PE treatment was the most effective in inhibiting the growth of total viable count (6.23 vs. 8.00 log CFU/g), psychrotrophic bacteria count (3.71 vs. 4.73 log CFU/g), coliforms count (2.78 vs. 3.70 log CFU/g), and fungi count (2.39 vs. 3.93 log CFU/g) compared to the control sample. The addition of PE to the edible coating also demonstrated a concentration-dependent effect on preserving the moisture, pH, color, and hardness of the buffalo meat. Sensory evaluation results suggested that incorporating PE into the edible coating extended the shelf life of buffalo meat by three days. In the second stage of this paper, this investigation employed two distinct forecasting methodologies: the Radial Basis Function (RBF) and the Support Vector Machine (SVM), to predict a range of quality indicators for coated meat products. Upon comparison, the RBF model exhibited a higher level of accuracy, showcasing its exceptional capacity to closely match the experimental outcomes. Therefore, this type of food coating, renowned for its strong antimicrobial properties, has the potential to effectively package and preserve perishable and delicate food items, such as meat.","author":"Fatemehe Majdi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4b93d0a98aca964459fc8f9f6cbfc812cd226abbc98037c4f2a94365bb3345db","category":"Interdisciplinary"}