{"title":"A toolkit for planning and implementing acute febrile illness (AFI) surveillance","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003115","date":1713448800000,"content":"<p>by Lilit Kazazian, Rachel Silver, Carol Y. Rao, Michael Park, Chandler Ciuba, Madeline Farron, Olga L. Henao</p>\r\n\r\nAcute febrile illness (AFI) is a broad clinical syndrome with a wide range of potential infectious etiologies. The lack of accessible, standardized approaches to conducting AFI etiologic investigations has contributed to significant global gaps in data on the epidemiology of AFI. Based on lessons learned from years of supporting AFI sentinel surveillance worldwide, the U.S. Centers for Disease Control and Prevention developed the toolkit for planning and implementing AFI surveillance, described here. This toolkit provides a comprehensive yet flexible framework to guide researchers, public health officials, and other implementers in developing a strategy to identify and/or monitor the potential causes of AFI. The toolkit comprises a cohesive set of planning aids and supporting materials, including an implementation framework, generic protocol, several generic forms (including screening, case report, specimen collection and testing, and informed consent and assent), and a generic data dictionary. These materials incorporate key elements intended to harmonize approaches for AFI surveillance, as well as setting-specific components and considerations for adaptation based on local surveillance objectives and limitations. Appropriate adaptation and implementation of this toolkit may generate data that expand the global AFI knowledge base, strengthen countries’ surveillance and laboratory capacity, and enhance outbreak detection and response efforts.","author":"Lilit Kazazian","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"4b9598ad800199e2fe9fcff20d4faeb83dd8261aafcd1bc1eaefdea742a8aace","category":"Environment"}