{"title":"Self potent antimicrobial and antifouling properties of zinc nanoparticles derived from lichen symbionts","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14307?af=R","date":1709812904000,"content":"<h2>Abstract</h2>\n<p>Biofouling poses a significant economic challenge for marine transportation. The use of chemical compounds to eliminate fouling layers beneath the ship's surface, albeit effective, raises concerns due to its potential harm to the aquatic ecosystem. Lichen symbiotic associations, an underexplored research area, show promise in producing antimicrobial and antifouling compounds. These lichen-associated bacteria engage in various functional activities and have multiple bacterial counterparts. The optimal conditions for cultivating lichen-associated bacteria for maximum growth were identified as a pH of 7, a temperature of 30°C, and an incubation period of 8 days. Glucose served as the carbon source, while yeast extract served as the nitrogen source. Additionally, zinc nanoparticles were successfully synthesized from the thriving lichen-associated bacteria. Fourier transform infrared spectroscopy (FTIR) analysis indicated distinctive bands at 3890 and 3103 cm<sup>−1</sup>, corresponding to the O<span></span>H stretching of alcohol and acid stretch bands, respectively. Furthermore, the presence of amide in N<span></span>H banding in the synthesized zinc nanoparticles was represented by a band at 1636 cm<sup>−1</sup>. SEM images of the produced zinc NPs displayed a spherical shape, ranging in size from 40 to 70 nm. To assess the impact of these nanoparticles from lichen-associated bacteria on biofouling activity in marine transportation, zebrafish results were analyzed.</p>","author":"Rubavathi Subbaiyan, \nAyyappadasan Ganesan, \nBhuvaneshwaran Muthusamy, \nBrindha Ramasubramanian","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"4b952ad50d4ded9a41a00736cbf0aa54d6ba36bc4d5c6226fc22efdc1f0c5190","category":"Environment"}