{"title":"Privacy-Enhanced Sentiment Analysis in Mental Health: Federated Learning with Data Obfuscation and BERT","link":"https://www.preprints.org/manuscript/202410.1394/v1","date":1729212580000,"content":"Accurate sentiment prediction on digital platforms while ensuring user anonymity and privacy presents substantial challenges. Predominantly, existing methodologies are centralized, impeding the achievement of both robust analysis with strong privacy protections and model accuracy. This paper investigates federated learning (FL), augmented with a novel Data Obfuscation (DO) technique and Bidirectional Encoder Representations from Transformers (BERT), to develop a new framework addressing this issue. The proposed framework enables continuous supervision of mental states by autonomously learning from aggregated global data on federated servers. The use of the emotion data set for prediction demonstrated a considerable improvement in accuracy (82.74%), precision (83.30%) and recall (82.74%) and F-1 score (82.80%) over baseline results of precision (16.73%), precision (23.29%), recall (16.73%) and F-1 score (18.18%). In addition, two privacy attack scenarios were executed to evaluate system resilience. Membership Inference Attacks, which determine whether a specific data point was part of the training set, and Linkage Attacks, which attempt to associate data samples with a specific client. However, the system preserves its privacy guarantees despite these adversities. The proposed approach skillfully balances privacy and accuracy, establishing a foundation for scalable and secure mental health support systems. This research exemplifies a model for leveraging FL and Data Obfuscation to enhance both the privacy and effectiveness of predictive analytics in critical applications, offering transformative advantages for digital platforms by enabling deep emotional analysis of users while safeguarding their privacy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4b9f0317db538b0f376b3103990c445870b309ccbdb7551a78e0b9fd8e66696f","category":"Interdisciplinary"}