{"title":"When Mediterranean Artisanal Fishers Protect Coastal Ecosystems","link":"https://www.preprints.org/manuscript/202409.1512/v1","date":1726753455000,"content":"According to EuroStat data recorded landings of fisheries products from European waters were estimated at about 6 million tons in 2001, down to 3.2 million tons in 2022. Gradual decline slowed after the entering into force of the reform of the European Common Fisheries Policy (CFP) end 2013, but was followed by a steeper decline after 2018 (1). This casts some doubt on claims that the resources are nowadays better managed, even if a warming ocean provokes measurable poleward migration of species. Within this general picture, the broad-brush landscape is influenced by policy applications more in favour of industrial exploitations and regulatory and market environments making it very hard for many small-scale fishers (SSF) to remain in business, let alone attract younger successors for generational transition. In crowded marine spaces it is a challenge to allocate access rights fairly between fisheries, exclusion zones for resource and habitat protection and much needed ecosystem recovery (2), platforms for fossil exploitation, wind farms, underwater cables and recreational uses. Two examples of local initiatives with recovery potential in the Mediterranean are briefly presented. They are spearheaded by artisanal fishers, who seek to restore spawning grounds and other coastal habitats as a way to procure enough fish and other complementary activities to secure their livelihoods in the future and supported by local scientists and nature conservation organisations. While promising, this is still rather the exception. Here it is argued that trust-building between artisanal fishers, conservationists and scientists, and greater systemic support to SSF by governments increase chances for the urgently needed structural shifts that can reverse the on-going decline in biodiversity and ocean productivity which all aspire to.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4ba291258bc3b4577d5fde304cc3ffb4f3f62e8df2f0d5b1386b3a8de9af1fbb","category":"Interdisciplinary"}