{"title":"Jasper Stuyven: \"I'm the Classics guy of tomorrow\"","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/jasper-stuyven-classics-guy-of-tomorrow","date":1616256943000,"content":"\n      <p><em>Back in January 2015, we interviewed second-year pro Jasper Stuyven over a game of pool at Trek Factory Racing's camp. We talked about his rebellious phase and expulsion from school, lessons learned from Fabian Cancellara and his Paris-Roubaix dreams.</em></p>\n<p><em>After winning the 2021 Milan-Sanremo following a few Monument near misses, the Classics star of tomorrow has become today's one. And in the light of his triumph in Italy, it's entertaining to read his youthful description of himself as a man who \"will never have a solo breakaway\"...</em></p>\n<p>Jasper Stuyven knows that Rome wasn’t built in a day: he spent half a week on holiday there with his girlfriend this winter. Naturally, most of it was seen from the saddle, though he swapped his racy Trek for a rented bicycle. He rode around the Colosseum, but didn’t enter.</p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>That rather sums up his professional career: observing monuments and impressive structures close up from the outside, waiting to become a reference point himself.</p>\n<p>Stuyven’s first year as a professional with Trek Factory Racing was about learning the ropes, but 2015 was dotted by setbacks: decent form and finishes would be followed by bouts of sickness. He started well at Qatar but was not at his best for the Tour of Flanders or Paris-Roubaix.</p>\n<p class=\"p1\"><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">The 2021 Men's Early Season: The Rouleur Racing Guide</a></strong></em></p>\n<p>The turning point was a hard-fought maiden professional victory on stage eight of the Vuelta a España. That was a sign of Stuyven’s bloody-mindedness: he broke his scaphoid in a crash 50 kilometres from the finish. But he fought back on, was the last man to make the split over the final hill and won the bunch sprint into Murcia. Never mind that he had to abandon the next day because of his shattered hand. </p>\n<p>“I felt I could do that [kind of ride] from the start of the season but didn’t really have the chance to show it,” he says. “That victory was a relief [after] all the hard work I kept doing, all the sacrifices, coming back two or three times in one year, working hard to still try and be good again. I had to make a new mind-set and new goals because of everything that happened.”</p>\n<p>Though his name sounds more fitting for a house cat than a Classics hitter, there is a defiant streak in Stuyven. As a teenager, he was expelled from secondary school in Belgium.</p>\n<p>“It’s a story that will remain untold,” he says, with a hint of a smile. “Nothing crazy, I just rebelled a little bit. Didn’t really work out with the rules of the school, the way they worked. Not the best co-operation between us.”</p>\n<p>What was he rebelling against? “The way they were doing certain things, the way they put teachers more like ‘we are here, you are here’,” he says, his hands indicating two very different levels. “It was hard for me to deal with.”</p>\n<p>Stuyven is certainly no dummy: he is currently taking a degree in sales management alongside his cycling career. But this rebel is pursuing another cause even more ferociously: cobbled Classics success.</p>\n<p> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Portrait-Jasper-Stuyven_1024x1024.jpg?v=1616256784\" alt=\"\"></p>\n<p>Cancellara himself has said that he sees Stuyven as a future team leader. The Leuven-born talent has helped Cancellara, supporting him to Tour of Flanders victory in 2014. In turn, last year, the Swiss, unable to race due to breaking his back at GP E3-Harelbeke, was on the phone to Stuyven before the Ronde and Roubaix, proffering advice over the fine detail. </p>\n<p>“Maybe your next question is ‘what did you learn from him?’” Stuyven says. “It’s hard to say. It’s how much you are willing to learn. If you listen, if you watch, if you see how he acts with sponsors, fans, how he is focusing on things.” </p>\n<p>There are similarities to be drawn between the pair. Both are exactly the same height – 186 centimetres – and share an imposing physical solidity, built like proverbial brick outhouses compared to the average pro rider. Both were junior world champions on the road too.</p>\n<p>Stuyven differs in that he “will never have a solo”. Rather than cleaving off the front with force, he prefers to rely on his fast finish. It helped him to victory at the junior World Championships road race in 2009, ahead of Arnaud Démare. He added Paris-Roubaix the following year. Since then, he has been earmarked as a talent to watch. </p>\n<p>Under pressure from quarters of the Belgian media, Stuyven crossed the pond to join Bontrager-Livestrong, Axel Merckx’s US development team. “It was a really great time. Maybe it was good to be away from all the press. Because I was world champion, I got called the new Tom Boonen. So they forget about you a little bit.”</p>\n<p>Stuyven waited till 2014 to turn pro, eschewing earlier offers. He is now developing into a fast finisher who prefers punchy finales where the thoroughbreds get dropped, as shown by that Vuelta win. In the races he covets the most, he has only shown brief glimpses of potential; his best finish is 32nd at last year’s Tour of Flanders. </p>\n<p>Into his third year as a professional, he has pinpointed Omloop Het Nieuwsblad and Dwars door Vlaanderen as targets. It’s a case of walking before you can run, only natural to aim at a semi-Classic before moving on to that hallowed Monument.</p>\n<p>“Have I imagined winning Roubaix? Over and over again!” he laughs. “It was my biggest dream to win it as a junior, an U23 and as a pro. Unfortunately, the last year of my U23 career, they cancelled Roubaix. And I got close [second place] in my first year, but it’s not a win. In the end, only winning counts and that’s all people remember.” </p>\n<p>First place is evidently on his mind: he repeats a variation of that final sentence twice more during our conversation. While the 23-year-old still has time on his side, his sense of impatience is palpable.</p>\n<p>As Fabian Cancellara approaches the final six months of his career, there is a gaping hole, both at Trek-Segafredo and the Classics firmament, waiting to be filled. </p>\n<p>“I don’t want to be just a pro. I always aim high,” Stuyven says. “Of course, that also makes you deal a lot with disappointments, especially with last season, but for me, I want to be at the top level. </p>\n<p>“Fabian is the Classics guy of today. And they say that I’m the Classics star of tomorrow, but that I need to prove it.”</p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Andy McGrath","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4ba9a7943f5ab7ed800f63dff2de6fa6d36a28d49283db8ce2efadcc31265fb7","category":"Cycling"}