{"title":"Mössbauer study of iron oxide nanoparticles","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400008?af=R","date":1716886525000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/37b2de7a-c47e-4c4c-bc58-1141c0b602f2/appl202400008-gra-0001-m.png\" alt=\"Mössbauer study of iron oxide nanoparticles\" /><p>Determination of hyperfine and structural parameters of rare-earth substituted Co ferrite nanoparticles CoFe<sub>2−<i>x</i>\n</sub>R<sub>\n   <i>x</i>\n</sub>O<sub>4</sub> (R = Yb, Gd; <i>x</i> = 0.05, 0.1, 0.3) with <sup>57</sup>Fe Mössbauer spectroscopy. Effect of thermal treatment on microstructure and inversion parameter.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Magnetic nanoparticles have recently attracted attention for biochemical and medical applications like drug delivery and hyperthermia for a variety of reasons with most important being their stability, chemical compatibility, and suitable magnetic properties like moderate specific mass magnetization. Cobalt ferrites are a well-studied family of materials and the partial substitution of Fe<sup>3+</sup> cations by rare earth (RE) ones may be used to tune the magnetic properties. In the present work pure and substituted Co ferrite nanoparticles with nominal stoichiometry CoFe<sub>2−<i>x</i>\n</sub>R<sub>\n   <i>x</i>\n</sub>O<sub>4</sub> (R = Yb, Gd; <i>x</i> = 0.05, 0.1, 0.3) synthesized by the co-precipitation method are studied with <sup>57</sup>Fe Mössbauer spectroscopy to determine the incorporation of RE ions in the spinel lattice. The fitting procedure was based on the standard spinel model using two sextets for the octahedral and the tetrahedral coordinated positions of Fe atoms. All isomer shift values were found within the typical range of high spin ferric ions while quadrupole splitting values strongly suggest that there is a substitution preference; RE ions replace iron ones in octahedral sites. The inversion parameter was found to decrease with RE content (lowest value about 0.534 for CoFe<sub>1.90</sub>Yb<sub>0.10</sub>O<sub>4</sub>) and thermal treatment always results in changing the material toward normal spinel, while pure CoFe<sub>2</sub>O<sub>4</sub> was inverse. Thermal treatment of substituted materials in ambient air at temperature range 1500–1700 K for 12 h increase crystallite size and changes the degree of inversion.</p>","author":"Christina Karra, \nCharalampos Sarafidis","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"4bb0f57bf3b6b688ead378765bb29c09197e7cb87896cfa617e52921d659e95e","category":"Environment"}