{"title":"Shuji Utsumi ขึ้นเป็นประธาน, ซีโอโอและซีอีโอของ Sega อเมริกา ควบซีอีโอยุโรป","link":"https://www.blognone.com/node/137618","date":1704971560000,"content":"<div><div><div><p>Sega ประกาศเลื่อนตำแหน่งให้คุณ Shuji Utsumi ขึ้นเป็นประธาน, ซีโอโอ และซีอีโอ (ชื่อตำแหน่งทางการคือ  <a href=\"https://en.wikipedia.org/wiki/Representative_director_(Japan)\">Representative Director</a>) ของ Sega สาขาอเมริกา  และควบตำแหน่งซีอีโอของ Sega สาขายุโรป มีผล 1 เมษายน 2024 โดยคุณ Shuji Utsumi มีประสบการณ์ในอุตสาหกรรมเกมมาอย่างโชกโชนตั้งแต่การมีส่วนสำคัญในการก่อตั้ง Sony Computer Entertainment และการเปิดตัว PlayStation รุ่นแรกในอเมริกาเหนือ</p>\n<p>ช่วงปี 1999 คุณ Shuji มีส่วนช่วยให้เครื่องเกม Dreamcast วางขายนอกญี่ปุ่นหลังจากนั้นเขาออกจาก Sega และไปทำงานให้กับ Disney Interactive Asia เขามีส่วนสำคัญในการเชื่อมความสัมพันธ์ระหว่าง Disney และ Square Enix จนเกิดเฟรนไชส์ Kingdom Hearts ขึ้นมา</p>\n<p>ปี 2019 คุณ Shuji กลับมาทำงานที่ Sega อีกครั้งในฐานะซีเอสโอและรองประธานของ Sega ประเทศญี่ปุ่น แล้วถูกเลื่อนตำแหน่งเป็นประธาน, ซีโอโอร่วมฝ่าย Consumer Game and Transmedia และตัวแทนซีอีโอ Sega อเมริกา และเป็นประธานของ Sega ยุโรปในช่วงปี 2021 ถึง 2023</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/046a723093f7cb5b2ee2b10abdb90703.jpg\" /></p>\n<p>ช่วงหลัง Shuji เป็นผู้บริหารที่ออกมาให้สัมภาษณ์กับสื่ออยู่หลายครั้งไม่ว่าจะเป็น <a href=\"https://www.blognone.com/node/136794\">Sega รู้สึกเป็นเกียรติที่ Xbox สนใจเข้าซื้อกิจการแต่ไม่ขายอยู่ดี</a> และ <a href=\"https://www.blognone.com/node/136778\">Sega เตรียมหยิบแฟรนไชส์อื่น ๆ มาดัดแปลงเพิ่มหลังภาพยนตร์ Sonic ประสบความสำเร็จ</a></p>\n<p>ที่มา - <a href=\"https://www.segasammy.co.jp/en/release/44209/\">Sega Sammy</a> via <a href=\"https://www.videogameschronicle.com/news/sega-appoints-dreamcast-and-psone-veteran-shuji-utsumi-as-new-western-boss/\">VGC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sega\">Sega</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4bbe2c31867d3c3fa8a48b79853dac40b4339b41ca9a62b30ebf2b0d06c3f651","category":"Thai"}