{"title":"AirPlay in hotel rooms officially delayed until 2024","link":"https://www.macworld.com/article/2168672/airplay-in-hotel-rooms-officially-delayed-until-2024.html","date":1702336763000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Now that <a href=\"https://www.macworld.com/article/2117707/ios-17-2-released-new-features-security-uodates-journal-app.html\">iOS 17.2 is out</a>, any previously-mentioned iOS 17 features that we don’t yet have are going to come in 2024. Apply may begin beta testing iOS 17.3 any minute now, but the actual release is definitely not coming until the new year.</p>\n\n\n\n<p>That means two key features—<a href=\"https://www.macworld.com/article/2164226/apple-music-wont-get-collaborative-playlists-until-next-year.html\">Apple Music collaborative playlists</a> and AirPlay in select hotels—aren’t going to be here in time for the busy holiday travel season.</p>\n\n\n\n<p>To that end, Apple has officially updated its <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2168672-1-0-0&amp;u=https://www.apple.com/ios/ios-17/\">iOS 17 site</a> with a disclaimer that the hotel AirPlay experience is “Coming in an update in 2024.” While we already knew this to be true based on the fact that major iOS 17 releases for the year are done and the hotel AirPlay isn’t in there, it’s nice to see an official confirmation.</p>\n\n\n\n<p>Apple did not update the Apple Music collaborative playlists part of the site to say the same thing, perhaps because it was a part of the iOS 17.2 beta until the very last release, and the company expected it to be released in 2023. There has been no official reason as to why that feature was scrubbed, but it is expected that it needed more protections against spam and abuse.</p>\n\n\n\n<p>When AirPlay for hotel rooms does launch, it will be available only in select hotels at first. It will probably take quite a long time before you can reliably expect most hotels at which you stay to feature AirPlay connectivity. </p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4bdce4acae1fcc57dc9f626264699e3457ff645837b56d5d0649e4836942fb09","category":"Apple"}