{"title":"Visualizing Plasmon Mediated Metal Deposition and Gold Nanorod Reshaping with Liquid Phase Transmission Electron Microscopy","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.810/7720099?rss=1","date":1721779200000,"content":"<span>Plasmonic nanoparticles convert incident light to highly excited charge carriers (“hot” electrons and holes) that can drive redox reactions at the particle surface [<a href=\"#ozae044.810-B1\">1</a>,<a href=\"#ozae044.810-B2\">2</a>]. Plasmonic hot electrons may reduce metal ions to deposit secondary, catalytically active metals onto colloidal plasmonic noble metal nanoparticles, generating highly efficient photocatalysts [<a href=\"#ozae044.810-B2\">2</a>]. In conjunction with simulation methods [<a href=\"#ozae044.810-B3\">3</a>], high resolution <span>in situ</span> experimental measurements can contribute to developing comprehensive understanding of hot carrier dynamics. Liquid phase transmission electron microscopy (LP-TEM) can uniquely visualize nanometer-scale phenomena in liquid in real time, including secondary metal deposition on seed nanoparticles [<a href=\"#ozae044.810-B4\">4-7</a>]. The TEM electron beam acts an evanescent broadband light source that generates surface plasmons in metallic nanostructures [<a href=\"#ozae044.810-B6\">6</a>]. Prior work by Sun <span>et al.</span> showed the electron beam during LP-TEM imaging of colloidal silver (Ag) nanoparticles induced shape transformations [<a href=\"#ozae044.810-B6\">6</a>]. However, both LSPR mediated chemistry and radiolysis can drive aqueous phase redox chemistry during LP-TEM, obscuring the precise reaction mechanism. Radiation chemistry often dominates reaction pathways due to production of strongly oxidizing and reducing radicals such as hydroxyl radicals (OH•), solvated electrons (e<sub>s</sub>), and hydrogen radicals (H•) by electron beam water radiolysis [<a href=\"#ozae044.810-B8\">8</a>]. For instance, Chen <span>et al</span>. found Ag deposition on plasmonic gold nanorods (AuNRs) in water during LP-TEM was consistent with ligand-mediated chemical reduction by radicals, as opposed to LSPR hot electron driven reactions [<a href=\"#ozae044.810-B7\">7</a>]. Application of LP-TEM to probe plasmon-mediated redox processes requires establishing strategies to minimize solvent radiolysis and accumulation of redox-active radicals.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"4be594cbae4d5e8260b36a43a0449d6220560780e32ceb9ab8658d8dcc8aa58c","category":"Environment"}