{"title":"State-of-the-Art DC-DC Converters for Satellite Applications: A Comprehensive Review","link":"https://www.preprints.org/manuscript/202410.0792/v1","date":1728557810000,"content":"Future manned and deep space missions require an Electrical Power System (EPS) that can deliver high power while overcoming challenges like weight and volume constraints and the harsh environment of space. To supply, store, and transmit power to various satellite subsystems, a variety of DC-DC converters are employed. The design specifications of DC-DC converters for various satellite applications are identified in this article, which also offers a state-of-the-art review of non-isolated, isolated, and integrated topologies. Foreseeing the future of electric propulsion, various electric sources for electric propulsion are contrasted, and converters for electric propulsion are studied. The chosen topologies are compared in terms of practical parameters like reliability, modularity, redundancy, efficiency, and power density. Application-wise comparisons of the topologies are also presented, along with details on how well they work with different kinds of satellites. The article also identifies the areas that are still unexplored for each application. In view of the identified research gaps, a generalized Modular Isolated Interleaved topology of a DC-DC converter is proposed for satellite applications, which is one of the articles’ unique contributions. The MATLAB simulation results of the proposed method, taking Cuk converter as an example for a total power of 5kW are presented. Findings indicate that adding more modules improves the system’s overall reliability, efficiency, and power density by lowering losses, semiconductor current stress, and component size. Such designs are easily adaptable to satellite applications, particularly at high power levels.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4bea2d712d2e2045ddca7a819cf15e77486606d47e5231cda8ace81598d5dab5","category":"Interdisciplinary"}