{"title":"Mass extinction event 260 million years ago resulted from climate change, studies say","link":"https://arstechnica.com/?p=1956409","date":1690308000000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Titanophoneus_3-800x555.jpg\" alt=\"Artist’s depiction of two dinocephalians, a group of land animals that\r\ndied out in the Captitanian extinction(s).\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Titanophoneus_3.jpg\">Enlarge</a> <span>/</span> Artist’s depiction of two dinocephalians, a group of land animals that\r\ndied out in the Captitanian extinction(s). (credit: <a href=\"https://creativecommons.org/licenses/by-sa/3.0/\">Dmitry Bogdanov: DiBgd at English Wikipedia CC BY-SA 3.0</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Capitanian mass extinction was once <a href=\"https://www.pnas.org/doi/abs/10.1073/pnas.1613094113\">lumped in</a> with the “Great Dying” of the end-Permian mass extinction, but the lesser-known extinction occurred 8–10 million years earlier. It may not have been great, but it was quite lethal, seeing as many as 62 percent of species go extinct, according to <a href=\"https://www.pnas.org/doi/abs/10.1073/pnas.1613094113\">one estimate</a>. Two new papers by different teams shed new light on the event, revealing a pattern of cause and effect that’s seen in other mass extinctions: huge volcanic eruptions, global warming, the collapse of the terrestrial ecosystem, and the spread of oxygen-starved ocean dead zones.</p>\n<h2>Ocean dead zones</h2>\n<p><a href=\"https://www.sciencedirect.com/science/article/pii/S0012821X23001413\">Huyue Song</a> of China University of Geosciences and colleagues from China, the US, and the UK studied mid-Permian-age rocks at a site called Penglaitan, about 300 miles west of Hong Kong. They found that there were two distinct pulses of Capitanian extinction, one about 262 million years ago and another around 260 million years ago. Those are both well before the more famous “Great Dying” end-Permian extinction, which occurred 252 million years ago, and Song’s team set out to uncover what happened.</p>\n<p>“In a way, the extinction losses have been hiding in the shadow of the end-Permian extinction,” said Paul Wignall, a professor at the University of Leeds and a co-author on Song’s paper. “It wiped out a lot of genera of all the usual things in the sea,” adding, “a bunch of animals died on land,” as well.</p></div><p><a href=\"https://arstechnica.com/?p=1956409#p3\">Read 23 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1956409&amp;comments=1\">Comments</a></p>","author":"Howard Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4becff051852030c5483ee5f4090b3741a71d10af11fa26e43f836f412de4813","category":"Tech"}