{"title":"Foresight for SOE Companies in Indonesia’s Construction Industry: Recognizing Future Opportunities","link":"https://www.preprints.org/manuscript/202409.1183/v1","date":1726472972000,"content":"As part of the \"Indonesia Emas 2045\" framework, State-Owned Enterprises (SOEs) in the construction industry are expected to dominate government infrastructure projects. This research conducts an industrial foresight analysis of Indonesia's SOE construction industry to identify future trends and opportunities. The study employs a three-level analysis: macro (using the PESTLE framework), meso (applying Porter's Five Forces), and micro (focusing on organizational scope). Data were collected from seven industry experts from both SOEs and the private sector, supplemented by secondary sources. The qualitative findings were gathered using Delphi method, while expert voting provided the quantitative assessment. The results highlight that focusing on macro-level targets like Net Zero Emissions (NZE) and Sustainable Development Goals (SDGs) is crucial in implementing Environmental, Social, and Governance (ESG) practices. Adoption of advanced technologies such as Construction 4.0 emerges as a top priority, with digital innovations such as predictive analytics, digital control towers, LiDAR, and Building Information Modeling (BIM) enhancing efficiency and risk management. Achieving sustainability and technological advancement requires regulatory certainty, serving as the third pillar at the macro level. At the micro level, strengthening the SOE construction industry's core competencies, resources, and capabilities is essential to accelerate future trends. Competitiveness at the meso level is not a significant concern, as the industry operates with moderate competition.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4bf318162e982543779947fe9d36a81d8375315a02b77f1aeb7f97c65068467e","category":"Interdisciplinary"}