{"title":"Evaluation of Urban Resilience and Its Influencing Factors: Case Study of the Yichang-Jingzhou-Jingmen-Enshi Urban Agglomeration in China","link":"https://www.preprints.org/manuscript/202407.0326/v1","date":1719998987000,"content":"In the context of global urbanization and climatic change, the frequency of various uncertainties and disturbances faced by urban system is increasing, and enhancing urban resilience has become one of the vital components of sustainable development of modern cities. At the same time, urban resilience has become a hot topic in interdisciplinary research such as economics, ecology, and geography. This paper constructs urban resilience evaluation indicator system based on four dimensions—economy, ecology, society, and infrastructure. The evaluation indicator is used to measure the resilience levels of Yichang-Jingzhou-Jingmen-Enshi (YJJE) urban agglomeration in China from 2010 to 2023. Using the entropy weight method, the Getis-Ord Gi* model, and the robustness testing, this paper analyzes the spatiotemporal evolution characteristics of urban resilience in YJJE urban agglomeration. Then, the factor contribution model is used to explore the influencing factors of urban resilience. Finally, the CA-Markov model is used to predict urban resilience in 2030. The results are as follows: From 2010 to 2023, the urban resilience values of all prefecture-level and county-level cities in YJJE urban agglomeration showed an upward trend, and it indicated that the resilience of urban system is improving. Meanwhile, the urban resilience of YJJE urban agglomeration increased with an average annual growth rate of 3.25%. Furthermore, the urban resilience exhibited a significant spatially heterogeneity distribution, with Xiling, Wujiagang, Xiaoting, Yidu, Zhijiang, Dianjun, Dangyang, Yuan’an, Yiling, Duodao being the high-value agglomerations of urban resilience, and Hefeng, Jianli, Shishou, Wufeng being the low-value agglomerations of urban resilience. Then, we identified critical driving factors of urban resilience in YJJE urban agglomeration. Finally, the urban resilience of all cities within YJJE urban agglomeration will reach the medium level or higher than medium level in 2030. Xiling, Wujiagang, Xiaoting, Zhijiang, Dianjun, Dangyang, Yuan’an will remain hot spots of urban resilience, while Jianli will remain cold spots of urban resilience in the future. This study can provide the scientific reference and policy recommendation for the government to build resilient cities and improve sustainable urban development.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4bf8c7524e0548126dfa179e7091173e0bfbdee5abe807d1e3bc39468825991f","category":"Interdisciplinary"}