{"title":"Stolen MacBook Pro schematics confirm HDMI, SD card, and MagSafe","link":"https://www.macworld.com/article/343999/stolen-macbook-pro-schematics-confirm-hdmi-sd-card-and-magsafe.html","date":1619034699000,"content":"\n<div>\n<section><div></div></section><p>Yesterday might have been a big deal for Apple with the launch of the <a href=\"https://www.macworld.com/article/343881/everything-apple-announced-at-its-april-20-spring-loaded-event.html\">M1 iMac, iPad Pro, and AirTag trackers</a>, but one of Apple’s MacBook suppliers didn’t have such a good day. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-04-21/apple-targeted-in-50-million-ransomware-hack-of-supplier-quanta&amp;xcust=1-1-343999-0-0-0&amp;sref=https://www.macworld.com/feed\">Bloomberg reports</a> that Quanta Computer Inc, a key supplier for Apple’s MacBooks, was hit with a $50 million ransomware attack by a well-known dark web hacking group REvil.</p>\n\n\n\n<p>After refusing to pay the exorbitant sum, REvil made good on its threat. As Bloomberg reports, the group “posted schematics for a new laptop, including 15 images detailing the guts of what appears to be a Macbook designed as recently as March 2021.” Bloomberg didn’t divulge what was in the documents, but Macrumors, who also saw the schematics after they were published, says <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/04/21/macbook-pro-stolen-schematics-ports/&amp;xcust=1-1-343999-0-0-0&amp;sref=https://www.macworld.com/feed\">they clearly show new ports</a> coming to the next-gen notebook:</p>\n\n\n\n<p><em>On the right side of the machine, there’s a visible HDMI port, accompanied by a USB-C/Thunderbolt port and followed by an SD Card reader. The left side features two additional USB-C/Thunderbolt ports and a ‌MagSafe‌ charging slot, for a total of three USB-C/Thunderbolt ports instead of four as we have today.</em></p>\n\n\n\n<p>Macrumors also says that “Leaked images of the new MacBook Pro floating around on Twitter also confirm that the device will not feature a Touch Bar.”</p>\n\n\n\n<p>It was <a href=\"https://www.macworld.com/article/3607760/is-apple-about-to-admit-it-was-wrong-about-the-macbook-pro.html\">previously rumored</a> that Apple would be returning ports and MagSafe to the upcoming MacBooks as well as tweaking the design and removing the Touch Bar. Apple just released a new iMac at its Spring Loaded event, so we’re not expecting to see any new Macs until at least <a href=\"https://www.macworld.com/article/342028/wwdc-2021-apple-to-unveil-ios-15-macos-12-on-june-7.html\">WWDC in June</a>.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4bf8ee76d5355cf32e002fdc390afb6c834159a40020e4c57fd1535ffa4f9161","category":"Apple"}