{"title":"Roll-out of an educational workshop to improve knowledge and self-confidence of healthcare professionals engaged in mainstreaming of breast cancer genetics","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307301","date":1721397600000,"content":"<p>by Valerie Jenkins, Ruth Habibi, Virginia Hall, Pauline Leonard, Anneliese Lawn, Jay Naik, Rachel Papps-Williams, Lesley Fallowfield</p>\r\nBackground <p>There are calls worldwide for the mainstreaming of genetic testing in breast cancer (BC) clinics, but health care professionals (HCPs) are not always familiar with nor confident about genetic counselling. TRUSTING (Talking about Risk &amp; uncertainties of Testing in Genetics is an educational programme shown to significantly improve HCPs’ knowledge, communication, self-confidence, and self-awareness. We rolled out TRUSTING workshops across the UK and probed their influence on mainstreaming within BC clinics.</p> Methods <p>1 surgeon, 3 oncologists, and 1 nurse specialist who had attended the original TRUSTING evaluation project were trained to facilitate the 8-hour programme in pairs. The participants (all health care professionals) attending their workshops completed 3 questionnaires: - 1) the Intolerance to Uncertainty Scale, 2) an 18-item multiple choice knowledge questionnaire about <i>BRCA</i> 1/2 gene testing, incidence and risk reducing interventions and 3) a 10-item questionnaire exploring self-confidence when advising patients and their families about these issues. Both knowledge and self-confidence were re-tested post workshop together with evaluation of the facilitators’ approach and overall satisfaction with the event. Follow-up questionnaires 3–12 months later examined impact of workshops on HCPs’ own practice and how mainstreaming was working in their clinics.</p> Results <p>120 HCPs (61 surgeons; 41 nurses; 9 oncologists; 9 other) attended 12 workshops. Knowledge scores (mean change = 6.58; 95% CI 6.00 to 7.17; p&lt;0.001), and self-confidence (mean change = 2.64; 95% CI 2.33 to 2.95; p&lt;0.001) improved significantly post workshop. Ratings for the facilitators’ approach were uniformly high (mean range 9.6 to 9.9 /10). Most delegates found the workshops useful, enjoyable, and informative and 98% would definitively recommend them to colleagues. Follow-up data (n = 72/96) showed that 57% believed attendance had improved their own practice when discussing genetic testing with their patients. When asked about mainstreaming more generally, 78% reported it was working well, 18% had not yet started, and 3% thought it was problematic in their centre.</p> Conclusions <p>Discussing the implications that having a pathogenic gene alteration has for patients’ treatment and risk-reducing interventions is complex when patients are already coming to terms with a breast cancer diagnosis. Training facilitators enhanced the wider roll-out of the TRUSTING educational programme and is an effective means of helping HCPs now involved in the mainstreaming of genetic testing.</p>","author":"Valerie Jenkins","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4bf9dadd87935479c7da8e05c750ec3c3905698527151df10b35a12556dcd6a9","category":"Interdisciplinary"}