{"title":"Using underutilized residues of coffee to obtain valuable dietary and antioxidant bioactive compounds","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13151?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Coffee cultivation and agroindustry generate residues that are rich in several metabolites. These compounds, such as phenolic compounds and alkaloids, are known for their antioxidant activity and are usually consumed as nutraceuticals. The purpose of this study was to evaluate the occurrence of chemical and antioxidant components of low-pruned coffee stems under different fertilizer regimes. Extractives and lignin composition, histochemical, chromatographic, and antioxidant analyses were performed.</p>\n<h2>RESULTS</h2>\n<p>Multiple compounds were found to accumulate in the stems of coffee trees. Furthermore, the presence of phenolic compounds such as chlorogenic acid, vanillin, resveratrol, and the alkaloids caffeine and trigonelline varied depending on the type of fertilization. In all samples examined, optimal performance was observed at the highest tested concentration (500 μg mL<sup>−1</sup>). All samples analyzed presented a great performance at the highest concentration tested (500 μg mL<sup>−1</sup>), with the dose 70% and the dose 100%, which is the recommended for the culture, showing the highest values for most of the concentrations and the best half-maximal inhibitory concentration (IC<sub>50</sub>) when compared with the other samples tested.</p>\n<h2>CONCLUSION</h2>\n<p>As shown in the results, the reuse of stem residues as antioxidant material, with the potential to be profitable, and has the added benefit of providing a sustainable destination for material that until now has been underutilized. © 2023 Society of Chemical Industry.</p>","author":"Jéfyne Campos Carréra, \nRay Rodrigues de Souza, \nAna Claudia Gama Batista, \nGabriela Aguiar Campolina, \nFrancides Gomes da Silva Júnior, \nManuel Losada Gavilanes, \nRubens José Guimarães, \nMaria das Graças Cardoso, \nFábio Akira Mori","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"4bfaaeafd65f4bb99f95a49d1b5d3820fc892d2d7bad1ec99ee6f975e25b2657","category":"Environment"}