{"title":"Tom Pidcock makes history at World Cup Rucphen with a spectacular victory","link":"https://cyclingtips.com/2021/12/tom-pidcock-makes-history-at-world-cup-rucphen-with-a-spectacular-victory/","date":1639841805000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/GettyImages-1359689610-650x433.jpg\" /></div><h2>Tom Pidcock makes history at World Cup Rucphen with a spectacular victory</h2><p>\n</p><p>Tom Pidcock (Ineos Grenadiers) took a historic first World Cup victory in spectacular fashion at Rucphen in the Netherlands.</p>\n\n\n\n<p>After <a href=\"https://cyclingtips.com/2021/12/wout-van-aert-swapped-mud-for-snow-and-still-no-one-could-come-close/\">last week’s snow</a>, the CX World Cup returned to the dirt and sand of the famous Rucphen course to kick off a bumper weekend of cyclocross. In the absence of Wout van Aert (Jumbo-Visma), who is on training camp with his team, the race was hotly contested from beginning to end.</p>\n\n\n\n<p>David van der Poel (Alpecin-Fenix) – brother of Mathieu who was meant to race here, but has <a href=\"https://www.facebook.com/alpecinfenix/posts/3175838709314221\">delayed his season debut</a> while he recovers from knee injury – and Lars van der Haar (Baloise Trek Lions) led the field throughout lap one, and though the pace was high, it took a long time for the race to meet any real drama.</p>\n\n\n\n<p>At the halfway point, there were still more than ten riders within touching distance of the front, but a small number had stamped their marks on the course. Pidcock first came to the front at the start of lap four and immediately imposed his strength over the others, but the ever-present Eli Iserbyt (Pauwels Sauzen-Bingoal) was up to the task, as was his teammate Michael Vanthourenhout who’d ridden a quiet race to stay in contention.</p>\n\n\n\n<p>By the end of lap six, Pidcock, Iserbyt and Vanthourenhout were easing away from the chasers, albeit not by much so they had to keep the pressure on. It looked like the British national champion’s day was done in the last few laps as Iserbyt attacked any sign of weakness, but Pidcock roared back in the eleventh hour.</p>\n\n\n\n<p>After flying over the sand and bunny hopping the planks at the end of the last lap, Pidcock hit the finishing straight first and at speed, and a disappointed Iserbyt could not respond, while Vanthourenhout rolled in for third. It’s a historic first World Cup victory for the young rider, who is the first British man to achieve the feat.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/tom-pidcock-makes-history-at-world-cup-rucphen-with-a-spectacular-victory/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4bfd392fe3c8d78a1e13d91d613f4230b64cb70e73de4a51de53784eeca78927","category":"Cycling"}