{"title":"Effect of feathers on drag in plunge‐diving birds","link":"https://onlinelibrary.wiley.com/doi/10.1111/nyas.15181?af=R","date":1721138454000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/971b0f5c-c44d-4307-85b0-6edce74a850c/nyas15181-gra-0001-m.png\" alt=\"Effect of feathers on drag in plunge-diving birds\" />\n<p>This study examines how feathers influence the hydrodynamic drag in diving birds. It reveals that the drag coefficient during water entry is doubled by feathers, likely due to the roughness of feather structures. Despite the feathers’ ability to hold and release bubbles, there is no reduction in drag. These findings could guide the development of bio-inspired aquatic vehicles.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This study explores the impact of feathers on the hydrodynamic drag experienced by diving birds, which is critical to their foraging efficiency and survival. Employing a novel experimental approach, we analyzed the kinematics of both feathered and nonfeathered projectiles during their transition from air to water using high-speed imaging and an onboard accelerometer. The drag coefficients were determined through two methods: a direct calculation from the acceleration data and a theoretical approach fitted to the observed velocity profiles. Our results indicate that feathers significantly increase the drag force during water entry, with feathered projectiles exhibiting approximately double the drag coefficient of their smooth counterparts. These findings provide new insights into the role of avian feather morphology in diving mechanics and have potential implications for the design of bioinspired aquatic vehicles in engineering. The study also discusses the biological implications of increased drag due to feathers and suggests that factors such as body shape might play a more critical role in the diving capabilities of birds than previously understood.</p>","author":"Florent Debenedetti, \nSunghwan Jung","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"4c02dbf9cde6084f1da07a39d3e495f8f1d21ee43c7606cda85f6a9de1fbc217","category":"Environment"}