{"title":"AWS Clean Rooms Now Generally Available — Collaborate with Your Partners without Sharing Raw Data","link":"https://aws.amazon.com/blogs/aws/aws-clean-rooms-now-generally-available/","date":1679426565000,"content":"<p>Companies across multiple industries, such as advertising and marketing, retail, consumer packaged goods (CPG), travel and hospitality, media and entertainment, and financial services, increasingly look to supplement their data with data from business partners, to build a complete view of their business.</p> \n<p>Let’s take a marketing use case as an example. Brands, publishers, and their partners need to collaborate using datasets that are stored across many channels and applications to improve the relevance of their campaigns and better engage with consumers. At the same time, they also want to protect sensitive consumer information and eliminate the sharing of raw data. Data clean rooms can help solve this challenge by allowing multiple companies to analyze their collective data in a private environment.</p> \n<p>However, it’s difficult to build data clean rooms. It requires complex privacy controls, specialized tools to protect each collaborator’s data, and months of development time customizing analytics tools. The effort and complexity grows when a new collaborator is added, or a different type of analysis is needed, as companies have to spend even more development time. Finally, companies prefer to limit data movement as much as possible, usually leading to less collaboration and missed opportunities to generate new business insights.</p> \n<p><span><strong>Introducing AWS Clean Rooms<br /> </strong></span>Today, I’m excited to announce the general availability of <a href=\"https://aws.amazon.com/clean-rooms/\">AWS Clean Rooms</a> which we first announced at AWS re:Invent 2022 and <a href=\"https://aws.amazon.com/about-aws/whats-new/2023/01/aws-clean-rooms-now-available-preview/\">released the preview</a> of in January 2023. AWS Clean Rooms is an analytics service of AWS Applications that helps companies and their partners more easily and securely analyze and collaborate on their collective datasets without sharing or copying each other’s data. AWS Clean Rooms enables customers to generate unique insights about advertising campaigns, investment decisions, clinical research, and more, while helping them protect data.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/03/21/product-page-diagram_AWS-Clean-Rooms@2x-1-1024x526.png\" alt width=\"1024\" height=\"526\" /></p> \n<p>Now, with AWS Clean Rooms, companies are able to easily create a secure data clean room on the AWS Cloud in minutes and collaborate with their partners. They can use a broad set of built-in, privacy-enhancing controls for clean rooms. These controls allow companies to customize restrictions on the queries run by each clean room participant, including query controls, query output restrictions, and query logging. AWS Clean Rooms also includes advanced cryptographic computing tools that keep data encrypted—even as queries are processed—to help comply with stringent data handling policies.</p> \n<p><strong><span>Key Features of AWS Clean Rooms</span><br /> </strong>Let me share with you the key features and how easy it is to collaborate with AWS Clean Rooms.</p> \n<p><strong>Create Your Own Clean Rooms<br /> </strong>AWS Clean Rooms helps you to start a collaboration in minutes and then select the other companies you want to collaborate with. You can collaborate with any of your partners that agree to participate in your clean room collaboration. You can create a collaboration by following several steps.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/03/15/cr-1.jpg\" alt width=\"1647\" height=\"699\" /></p> \n<p>After creating a <strong>collaboration</strong> in AWS Clean Rooms, you can select additional collaboration members who can contribute. Currently, AWS Clean Rooms supports up to five collaboration members, including you as the collaboration creator.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/27/cleanrooms-ga-2.png\" alt width=\"813\" height=\"498\" /></p> \n<p>The next step is to define which collaboration member can perform a query in collaboration with the <strong>member abilities</strong> setting.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/27/cleanrooms-ga-3.png\" alt width=\"813\" height=\"776\" /></p> \n<p>Then, collaboration members will get notifications in their accounts, see detailed info from a collaboration, and decide whether to join the collaboration by selecting <strong>Create membership</strong> in their AWS Clean Rooms dashboard.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/03/15/cr-7.jpg\" alt width=\"1460\" height=\"866\" /></p> \n<p><strong>Collaborate without Moving Data Outside AWS<br /> </strong>AWS Clean Rooms works by analyzing Amazon S3 data in place. This eliminates the need for companies to copy and load their data into destinations outside their respective AWS environments of the collaboration members or using third-party services.</p> \n<p>Each collaboration member can create <strong>configured tables</strong>, an AWS Clean Rooms resource that contains reference to the AWS Glue catalog with underlying data that define how that data can be used. The configured table can be used across many collaborations.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/27/cleanrooms-ga-5-1024x401.png\" alt width=\"1024\" height=\"401\" /></p> \n<p><strong>Protecting Data<br /> </strong>AWS Clean Rooms provides you with a broad set of privacy-enhancing controls to protect your customers’ and partners’ data. Each collaboration member has the flexibility to determine what columns can be accessed in a collaboration.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/27/cleanrooms-ga-6-1024x452.png\" alt width=\"1024\" height=\"452\" /></p> \n<p>In addition to column-level privacy controls, as in the example above, AWS Clean Rooms also provides fine-grained query controls called <strong>analysis rules</strong>. With built-in and flexible analysis rules, customers can tailor queries to specific business needs. AWS Clean Rooms provides two types of analysis rules for customers to use:</p> \n<ul> \n <li>Aggregation analysis rules allows queries that aggregate analysis without revealing user-level information using COUNT, SUM, and AVG functions along optional dimensions.</li> \n <li>List analysis rules allow queries that output user-level attribute analysis of the overlap between the customer’s table and the tables of the member who can query.</li> \n</ul> \n<p>Both analysis rule types allow data owners to require a join between their datasets and the datasets of the collaborator running the query. This limits the results to just their intersection of the collaborators datasets.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/27/cleanrooms-ga-8-1024x861.png\" alt width=\"1024\" height=\"861\" /></p> \n<p>After defining the analysis rules, the member who can query and receive results can start writing queries according to the restrictions defined by each participating collaboration member. The following is an example query in the collaboration.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/27/cleanrooms-ga-11-1024x581.png\" alt width=\"1024\" height=\"581\" /></p> \n<p>Analysis rules allow collaboration members to restrict the types of queries that can be performed against their datasets and the usable output of the query results. The following screenshot is an example of a query that will not be successful because it does not satisfy the analysis rule since the <code>hashed_email</code> column cannot be used in <code>SELECT</code> queries.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/27/cleanrooms-ga-12-1024x548.png\" alt width=\"1024\" height=\"548\" /></p> \n<p><strong>Full Programmatic Access<br /> </strong>Any functionality offered by AWS Clean Rooms can also be accessed via the API using AWS SDKs or AWS CLI. This makes it easier for you to integrate AWS Clean Rooms into your products or workflows. This programmatic access also unlocks the opportunity for you to host clean rooms for your customers with your own branding.</p> \n<p><strong>Query Logging<br /> </strong>This feature allows collaboration members to review and audit the queries that use their datasets to make sure data is being used as intended. With <strong>query logging</strong>, collaboration members who have query control and other members whose data is part of the query, can receive logs if they enable <strong>query logging</strong>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/03/15/cr-4.jpg\" alt width=\"1022\" height=\"223\" /></p> \n<p>If this feature is enabled, query logs are written to Amazon CloudWatch Logs in each collaboration member’s account. You can access the summary of the log queries in the last 7 days from the collaboration dashboard.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/03/15/cr-8-1.jpg\" alt width=\"1454\" height=\"753\" /></p> \n<p><strong>Cryptographic Computing<br /> </strong>With this feature, you have the option to perform client-side encryption for sensitive data with cryptographic computing. You can encrypt your dataset to add a protection layer, and the data will use a cryptographic computing protocol called private-set intersection to keep data encrypted even as the query runs.</p> \n<p>To use the cryptographic computing feature, you need to download and use the <a href=\"https://github.com/aws/c3r\">Cryptographic Computing for Clean Rooms (C3R) encryption client</a> to encrypt and decrypt your data. C3R keeps your data cryptographically protected while in use in AWS Clean Rooms. C3R supports a subset of SQL queries, including JOIN, SELECT, GROUP BY, COUNT, and other supported statements on cryptographically protected data.</p> \n<p>The following image shows how you can enable cryptographic computing when creating a collaboration:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/03/16/cr-10.jpg\" alt width=\"1524\" height=\"1808\" /></p> \n<p><span><strong>Customer Voices<br /> </strong></span>During the preview period, we heard lots of feedback from our customers about AWS Clean Rooms. Here’s what our customers say:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/15/adspace-comscore.jpeg\" alt width=\"299\" height=\"69\" /></p> \n<p><a href=\"https://www.comscore.com/\">Comscore</a> is a measurement and analytics company that brings trust and transparency to media. Brian Pugh, Chief Information Officer at Comscore, said, “As advertisers and marketers adapt to deliver relevant campaigns leveraging their combined datasets while protecting consumer data, Comscore’s Media Metrix suite, powered by Unified Digital Measurement 2.0 and Campaign Ratings services, will continue to support critical measurement and planning needs with services like AWS Clean Rooms. AWS Clean Rooms will enable new methods of collaboration among media owners, brands, or agency customers through customized data access controls managed and set by each data owner without needing to share underlying data.”</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/15/adspace-dish-media-1024x154.png\" alt width=\"300\" height=\"45\" /></p> \n<p><a href=\"https://media.dish.com/\">DISH Media</a> is a leading TV provider that offers over-the-top IPTV service. “At DISH Media, we empower brands and agencies to run their own analyses of prior campaigns to allow for flexibility, visibility, and ease in optimizing future campaigns to reach DISH Media’s 31 million consumers. With AWS Clean Rooms, we believe advertisers will benefit from the ease of use of these services with their analysis, including data access and security controls,” said Kemal Bokhari, Head of Data, Measurement, and Analytics at DISH Media.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/15/adspace-fox-300x130.png\" alt width=\"150\" height=\"65\" /></p> \n<p><a href=\"https://www.foxcorporation.com/\">Fox Corporation</a> is a leading producer and distributor of ad-supported content through its sports, news, and entertainment brands. Lindsay Silver, Senior Vice President of Data and Commercial Technology at Fox Corporation, said, “It can be challenging for our advertising clients to figure out how to best leverage more data sources to optimize their media spend across their combined portfolio of entertainment, sports, and news brands which reach 200 million monthly viewers. We are excited to use AWS Clean Rooms to enable data collaborations easily and securely in the AWS Cloud that will help our advertising clients unlock new insights across every Fox brand and screen while protecting consumer data.”</p> \n<p><a href=\"https://advertising.amazon.com/solutions/products/amazon-marketing-cloud\">Amazon Marketing Cloud (AMC)</a> is a secure, privacy-safe clean room application from Amazon Ads that supports thousands of marketers with custom analytics and cross-channel analysis.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2022/11/21/adspace-amazon-ads.png\" alt width=\"300\" height=\"78\" />“Providing marketers with greater control over their own signals while being able to analyze them in conjunction with signals from Amazon Ads is crucial in today’s marketing landscape. By migrating AMC’s compute infrastructure to AWS Clean Rooms under the hood, marketers can use their own signals in AMC without storing or maintaining data outside of their AWS environment. This simplifies how marketers can manage their signals and enables AMC teams to focus on building new capabilities for brands,” said Paula Despins, Vice President of Ads Measurement at Amazon Ads.</p> \n<p>Watch this video to learn more about AWS Clean Rooms:</p> \n<div> \n <p></p> \n</div> \n<p><strong>Availability<br /> </strong>AWS Clean Rooms is generally available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Paciﬁc (Seoul), Asia Paciﬁc (Singapore), Asia Paciﬁc (Sydney), Asia Paciﬁc (Tokyo), Europe (Frankfurt), Europe (Ireland), Europe (London), and Europe (Stockholm).</p> \n<p><strong>Pricing &amp; Free Tier<br /> </strong>AWS Clean Rooms measures compute capacity in Clean Rooms Processing Units (CRPUs). You only pay the compute capacity of queries that you run in CRPU-hours on a per-second basis (with a 60-second minimum charge). AWS Clean Rooms automatically scales up or down to meet your query workload demands and shuts down during periods of inactivity, saving you administration time and costs. AWS Clean Rooms free tier provides a tier of 9 CRPU-hours per month for the first 12 months per new customer.</p> \n<p>AWS Clean Rooms helps companies and their partners more easily and securely analyze and collaborate on their collective datasets without sharing or copying each other’s data. Learn more about benefits, use cases, how to get started, and pricing details on the <a href=\"https://aws.amazon.com/clean-rooms\">AWS Clean Rooms</a> page.</p> \n<p>Happy collaborating!</p> \n<p>— <a href=\"https://www.linkedin.com/in/donnieprakoso\">Donnie</a></p>","author":"Donnie Prakoso","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"4c08544485208da0271079933fa763c8b84b1012f9a7dec6d2fbe3045d9b3a48","category":"Tech"}