{"title":"Pharmacological and behavioral investigation of putative self-medicative plants in Budongo chimpanzee diets","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305219","date":1718892000000,"content":"<p>by Elodie Freymann, Susana Carvalho, Leif A. Garbe, Dinda Dwi Ghazhelia, Catherine Hobaiter, Michael A. Huffman, Geresomu Muhumuza, Lena Schulz, Daniel Sempebwa, Florian Wald, Eguma R. Yikii, Klaus Zuberbühler, Fabien Schultz</p>\r\n\r\nWild chimpanzees consume a variety of plants to meet their dietary needs and maintain wellbeing. While some plants have obvious value, others are nutritionally poor and/or contain bioactive toxins which make ingestion costly. In some cases, these nutrient-poor resources are speculated to be medicinal, thought to help individuals combat illness. In this study, we observed two habituated chimpanzee communities living in the Budongo Forest, Uganda, and collected 17 botanical samples associated with putative self-medication behaviors (e.g., bark feeding, dead wood eating, and pith-stripping) or events (e.g., when consumer had elevated parasite load, abnormal urinalysis, or injury). In total, we selected plant parts from 13 species (nine trees and four herbaceous plants). Three extracts of different polarities were produced from each sample using <i>n</i>-hexane, ethyl acetate, and methanol/water (9/1, <i>v/v</i>) and introduced to antibacterial and anti-inflammatory <i>in vitro</i> models. Extracts were evaluated for growth inhibition against a panel of multidrug-resistant clinical isolates of bacteria, including ESKAPE strains and cyclooxygenase-2 (COX-2) inhibition activity. Pharmacological results suggest that Budongo chimpanzees consume several species with potent medicinal properties. In the antibacterial library screen, 45 out of 53 extracts (88%) exhibited ≥40% inhibition at a concentration of 256 μg/mL. Of these active extracts, 41 (91%) showed activity at ≤256μg/mL in subsequent dose-response antibacterial experiments. The strongest antibacterial activity was achieved by the <i>n-</i>hexane extract of <i>Alstonia boonei</i> dead wood against <i>Staphylococcus aureus</i> (IC50: 16 μg/mL; MIC: 32 μg/mL) and <i>Enterococcus faecium</i> (IC50: 16 μg/mL; MIC: &gt;256 μg/mL) and by the methanol-water extract of <i>Khaya anthotheca</i> bark and resin against <i>E</i>. <i>faecium</i> (IC50: 16 μg/mL; MIC: 32 μg/mL) and pathogenic <i>Escherichia coli</i> (IC50: 16 μg/mL; MIC: 256 μg/mL). We observed ingestion of both these species by highly parasitized individuals. <i>K</i>. <i>anthotheca</i> bark and resin were also targeted by individuals with indicators of infection and injuries. All plant species negatively affected growth of <i>E</i>. <i>coli</i>. In the anti-inflammatory COX-2 inhibition library screen, 17 out of 51 tested extracts (33%) showed ≥50% COX-2 inhibition at a concentration of 5 μg/mL. Several extracts also exhibited anti-inflammatory effects in COX-2 dose-response experiments. The <i>K</i>. <i>anthotheca</i> bark and resin methanol-water extract showed the most potent effects (IC50: 0.55 μg/mL), followed by the fern <i>Christella parasitica</i> methanol-water extract (IC50: 0.81 μg/mL). This fern species was consumed by an injured individual, a feeding behavior documented only once before in this population. These results, integrated with associated observations from eight months of behavioral data, provide further evidence for the presence of self-medicative resources in wild chimpanzee diets. This study addresses the challenge of distinguishing preventative medicinal food consumption from therapeutic self-medication by integrating pharmacological, observational, and health monitoring data—an essential interdisciplinary approach for advancing the field of zoopharmacognosy.","author":"Elodie Freymann","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4c0ae69262c44321ffef02a61289ed309ff2ea574756a9b1c9b42744dbb2d6c7","category":"Interdisciplinary"}