{"title":"Moisture sorption isotherm and thermodynamic analysis of egg powders dried by foam‐mat‐assisted refractance window drying","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13692?af=R","date":1719042552000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>In the designed study, the moisture sorption isotherm and thermodynamic properties of refractance-window-dried egg white powder (EWP), egg yolk powder (EYP) and whole egg powder (WEP) were determined.</p>\n<h2>RESULTS</h2>\n<p>The adsorption isotherm of egg powders was classified as type II, giving a sigmoidal shape. Peleg showed the highest goodness of fitting for egg powder. The monolayer moisture content of egg powders varied between 0.02 and 0.09 g g<sup>−1</sup>. According to the thermodynamic analysis, an increase in moisture content led to a decrease in net isosteric heat of sorption (<i>q</i>\n<sub>st</sub>), and the highest decrease was observed in EWP. The <i>q</i>\n<sub>st</sub> of EWP was calculated as 18 637 kJ mol<sup>−1</sup>, while it decreased to 3104 kJ mol<sup>−1</sup> at 0.2 g g<sup>−1</sup> moisture content. Like <i>q</i>\n<sub>st</sub>, sorption entropy decreased from 52.07 to 7.14 J mol<sup>−1</sup> K<sup>−1</sup> with increasing water activity (<i>a</i>\n<sub>w</sub>) for EWP. Increasing temperature caused a decrease in spreading pressure and was higher in EWP samples. Increasing moisture content and temperature also decreased Gibbs free energy level.</p>\n<h2>CONCLUSION</h2>\n<p>Moisture sorption isotherm (MSI) is used to predict the amount of bound water in a material at a specific relative humidity and temperature. To inhibit chemical and microbiological spoilage, the drying process must continue until the monolayer moisture content is reached. In this study, the monolayer moisture content of powdered eggs for safe storage was demonstrated by MSI. Additionally, by determining the thermodynamic functions of egg powder, valuable information was obtained related to predicting the energy requirement in drying processes. © 2024 Society of Chemical Industry.</p>","author":"Sultan Arslan‐Tontul, \nAyse Gunisik, \nIsmail Tontul","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"4c0abbfb024c73db322c22ebc4febe044e6d490d2454df4fbd0d5c1d98ebe491","category":"Environment"}