{"title":"Perinatal and early life risk factors of adverse early childhood developmental outcomes: Protocol for systematic review using socioecological model","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311500","date":1729173600000,"content":"<p>by Kendalem Asmare Atalell, Gavin Pereira, Bereket Duko, Sylvester Dodzi Nyadanu, Gizachew A. Tessema</p>\r\nBackground <p>Adverse early childhood developmental outcomes impact later schooling and adulthood life courses. However, there needs to be more comprehensive evidence on the effect of various perinatal and early life risk exposures. Hence, we aimed to systematically identify the various perinatal and early childhood risk factors using a socioecological model to inform appropriate prevention strategies.</p> Method <p>The systematic review will adhere to the 2020 PRISMA guidelines. The protocol was registered in PROSPERO with a registration number of CRD42023447352. We will systematically search for articles on adverse early childhood developmental outcomes, which include physical, cognitive, language and communication and social-emotional development from main databases, such as EMBASE, Medline, Global Health, PsycINFO, CINAHL and Web of Science Core Collection, dating from 2000. We will use Population, Exposure, Comparator, Outcome and Study Design (PECOS) criteria to select eligible studies for our review: 1) Population includes children in early childhood age (i.e., up to eight years) undergoing developmental assessments. 2) Exposure: various perinatal and early life risk factors. 3) Comparators: Children with no or low levels of exposure to the risk factors. 4) Outcome: adverse early childhood developmental outcome. 5) Study design: all observational studies that report the prevalence or incidence of adverse early childhood developmental outcomes and associated risk factors published since 2000. There will be no restriction based on country of origin or geographical location except language (only published in English). Textual and narrative synthesis using the socioecological model will be used to synthesise the data.</p>","author":"Kendalem Asmare Atalell","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4c15068f728d6d250d09d16bcc866ce482e2769f0a4125f8d216767176a897ff","category":"Interdisciplinary"}