{"title":"Decadal changes in surface CO2 concentrations and CO2 fluxes in a mountain lake","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12557?af=R","date":1716879600000,"content":"<h2>Abstract</h2>\n<p>Climate warming impacts biogeochemical cycles in lakes. However, the factors controlling CO<sub>2</sub> dynamics in mountain lakes over multidecadal scales are poorly understood. Here, we capitalized on long-term monthly data (1995–2022) of oligotrophic mountain Lake Tovel and calculated surface CO<sub>2</sub> concentrations and flux by applying geochemical relationships and the thin boundary layer approach. Advanced time-series and regression modeling was used to determine temporal patterns and environmental parameters explaining surface CO<sub>2</sub> concentrations and flux. Surface CO<sub>2</sub> concentrations were highest from 2009 to 2017 (annual mean: 109.1 <i>μ</i>mol CO<sub>2</sub> L<sup>−1</sup>) but lower before and after this period. Concomitantly, the air–water CO<sub>2</sub> flux (<i>μ</i>mol CO<sub>2</sub> m<sup>−2</sup> d<sup>−1</sup>) showed a period of lowest (mean<sub>1995–2010</sub>: 6.4 ± 0.7), highest (mean<sub>2011–2017</sub>: 35.7 ± 2.1), and intermediate emissions (mean<sub>2018–2022</sub>: 19.3 ± 4.7). Temporal modeling showed that hypolimnetic and deep hypolimnetic dissolved oxygen (DO) had the same change points and trends as surface CO<sub>2</sub> concentrations. In multiple linear regression, hypolimnetic DO, silica, and the standardized precipitation index (pseudo-<i>R</i>\n<sup>2</sup>\n<sub>adj.</sub> = 0.62; <i>p</i> &lt; 0.01) best predicted annual mean surface CO<sub>2</sub> concentrations. Regression results and the overlap between temporal trend patterns indicated that surface CO<sub>2</sub> concentrations of Lake Tovel were positively influenced by external (loading of allochthonous carbon) and internal (lake autumn mixing) factors. The recent decline in surface CO<sub>2</sub> concentrations from the year 2018 was attributed to increased stratification that offset lake autumn mixing and thus lead to the observed decline. These results help us to better understand the carbon cycle in mountain lakes in a changing climate.</p>","author":"Ulrike Obertegger, \nStefano Corradini, \nLeonardo Cerasino, \nLinda C. Weiss","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"4c16d847d08b6f23f0a330b87bf5ff703cab0adb5829daae81ecf45f8103ac06","category":"Environment"}