{"title":"Study on purification effect of river ammonia nitrogen and optimization of layout parameters in the combination of ecological spur dikes and deep pool shoals: Experiments and MIKE21","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4246?af=R","date":1706609669000,"content":"<h2>Abstract</h2>\n<p>The construction of ecological spur dikes and deep pool shoals can increase the diversity of water flow structures while also hastening the transport and transformation of pollutants. However, current research has paid little attention to the effects of the arrangement parameters on water purification capacity when the ecological spur dikes and deep pool shoals are combined. In this study, we investigated the purification capacity of ammonia nitrogen using the combination of spur dikes and deep pool shoals through laboratory flume experiments and numerical simulation. The laboratory flume experiments revealed that the combination of staggered spur dikes and the opposite side deep pool shoals provided the most effective purification. Secondly, in order to obtain the optimal arrangement parameters for the combination of ecological spur dikes and deep pool shoals more easily, the numerical model based on MIKE21 was validated using experimental results and applied to Section 2 of the Shiqiao River in Nanling County, Wuhu City, Anhui Province. The numerical simulation showed that the length of the spur dikes had the greatest impact on the purification effect, followed by the spacing of the spur dikes and the width of the deep pool shoals, the angle of the spur dikes, the spacing of the deep pool shoals, and the length of the deep pool shoals had the least effect. The optimal parameters for the combination of spur dikes and deep pool shoals are as follows: spur dike parameters: 60°(angle), 10 m(length), 17 m(spacing); deep pool shoal parameters: 60 m(length), 10 m(width), and 210 m(spacing).</p>","author":"Qihang Wang, \nSongmin Li, \nXiaoling Wang, \nYitian Chen, \nYazhi Zheng, \nGuangyao Dong","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"4c1acf8a6ede730a0c0e0f0b04b111d916e9882932798833d7bb06d4b4eec1b3","category":"Environment"}