{"title":"Thousands of routers and cameras vulnerable to new 0-day attacks by hostile botnet","link":"https://arstechnica.com/?p=1986211","date":1700681751000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/10/iot-botnet-800x450.jpg\" alt=\"A stylized human skull over a wall of binary code.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/10/iot-botnet.jpg\">Enlarge</a> (credit: <a href=\"https://arstechnica.com/author/aurich-lawson/\">Aurich Lawson / Ars Technica</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Miscreants are actively exploiting two new zero-day vulnerabilities to wrangle routers and video recorders into a hostile botnet used in distributed denial-of-service attacks, researchers from networking firm Akamai said Thursday.</p>\n<p>Both of the vulnerabilities, which were previously unknown to their manufacturers and to the security research community at large, allow for the remote execution of malicious code when the affected devices use default administrative credentials, according to an <a href=\"https://www.akamai.com/blog/security-research/new-rce-botnet-spreads-mirai-via-zero-days\">Akamai post</a>. Unknown attackers have been exploiting the zero-days to compromise the devices so they can be infected with Mirai, a potent piece of open source software that makes routers, cameras, and other types of Internet of Things devices part of a botnet that’s capable of waging DDoSes of previously unimaginable sizes.</p>\n<p>Akamai researchers said one of the zero-days under attack resides in one or more models of network video recorders. The other zero-day resides in an “outlet-based wireless LAN router built for hotels and residential applications.” The router is sold by a Japan-based manufacturer, which “produces multiple switches and routers.” The router feature being exploited is “a very common one,” and the researchers can’t rule out the possibility it’s being exploited in multiple router models sold by the manufacturer.</p></div><p><a href=\"https://arstechnica.com/?p=1986211#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986211&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4c1e8aec4f8464d63d295803642085a5ff5f765500455512fd7741828001a2af","category":"Tech"}