{"title":"PP- and PS-wave migration of OBN seismic data from rugged seabeds","link":"http://link.springer.com/10.1007/s11600-023-01203-4","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Multicomponent seismic exploration offers advantages in precisely describing complicated geological structures compared with conventional PP-wave exploration. For multicomponent ocean bottom node (OBN) seismic data, due to the complication of the seismic-wave propagation path and the diffuse scattering of wavefield energy in rugged seabeds, the reflections show distortion and crossover characteristics, resulting in the distortion of underlying strata in migration sections. Furthermore, the common midpoint stacking approach based on the uniform datum is no longer applicable because of the large elevation differences between sources and receivers. In this study, we propose a PP- and PS-waves prestack time migration (PSTM) method for OBN acquisition with rugged seabeds. The proposed method can significantly improve the imaging quality by correcting the downward P-wave traveltime in seawater and adopting an optimized migration aperture from the formation dip-angle model. Moreover, we develop feasible strategies to establish formation dip-angle and PP- and PS-migration velocity models. The typical feature of the improvements we make on PSTM is that the non-hyperbolic moveouts of both PP- and PS-waves on common image gathers induced by the non-uniform elevations of shot and receiver points and the asymmetry ray path of PS-wave are corrected to be quasi-hyperbolic. Numerical tests and field data applications demonstrate that our method can effectively image underlying structures with rugged seabeds and has potential in multicomponent OBN exploration.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"4c2417065ca6256479de66c5cbdaa3efadd82c08c5cd0ed66f5a0c3febb281e5","category":"Environment"}