{"title":"Invertebrates Of Siberia, A Potential Source Of Animal Protein For Innovative Human Food Production. 4. Biomass Nutrient Composition Change In Worms And Crickets","link":"https://www.preprints.org/manuscript/202410.1230/v1","date":1729013484000,"content":"Background: The possibility of nutrient composition design in biomass of invertebrates is studied. The results may be used for gaining the particular nutrient concentration in biomass used for food products or medicine purposes. Methods: Two model species of terrestrial invertebrates, such as the House cricket Acheta domesticus (Linnaeus, 1758) and the earthworm Eisenia fetida (Savigny, 1826), within the variation of feeding substrate, are studied in this paper. Results: It is stated that in crickets and earthworms similar tendencies of B-vitamin content increase occur for those vitamins where their initial level was high. A double dose of the vitamin enrichment of food substrate leads to increasing of vitamin C, fat-soluble vitamins and the major part of B-vitamins content. In a control group of crickets a level of vitamin C was 1.5 times lower than in a control group of earthworms. After the enrichment of feeding substrate, the level of vitamin C in biomass of crickets has not changed, but within the earthworms it has significantly increased. The content of a multiple range of minerals have not changed after a singular dose enrichment, but some microelements, such as Pb and Se, have significantly decreased in earthworms after a double dose enrichment of feeding substrate. The calorific value of crickets is twice higher than the earthworms one and it has not significantly changed after a double dose substrate enrichment. Conclusions: It is revealed that the content of vitamins in the biomass of model species can be controlled within the feeding substrate enrichment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4c2b1cac739fcbc7694eb088e8c6741059ac1c8bab20477894e0b66a791a3013","category":"Interdisciplinary"}