{"title":"Predictive Performance of Machine Learning Models for Kidney Complications Following Coronary Interventions: A Systematic Review and Meta-Analysis","link":"https://www.preprints.org/manuscript/202407.0156/v1","date":1719901075000,"content":"Background: Acute kidney injury (AKI) and contrast-induced nephropathy (CIN) are common complications following percutaneous coronary intervention (PCI) or coronary angiography (CAG), presenting significant clinical challenges. Machine learning (ML) models offer promise for improving patient outcomes through early detection and intervention strategies.\nMethods: A comprehensive literature search following PRISMA guidelines was conducted in PubMed, Scopus, and Embase from inception to June 11, 2024. Study characteristics, ML Models, performance metrics (AUC, accuracy, sensitivity, specificity, precision), and risk of bias assessment using the PROBAST tool were extracted. Statistical analysis used a random-effects model to pool AUC values, with heterogeneity assessed via the I² statistic.\nResults: From 431 initial studies, 14 met the inclusion criteria. Gradient Boosting Machine (GBM) and Support Vector Machine (SVM) models showed the highest pooled AUCs of 0.87 (95% CI: 0.82-0.92) and 0.85 (95% CI: 0.80-0.90), respectively, with low heterogeneity (I² &lt; 30%). Random Forest (RF) had a similar AUC of 0.85 (95% CI: 0.78-0.92) but significant heterogeneity (I² &gt; 90%). Multilayer Perceptron (MLP) and XGBoost models had moderate pooled AUCs of 0.79 (95% CI: 0.74-0.84) with high heterogeneity. RF showed strong accuracy (0.83, 95% CI: 0.70-0.96), while SVM had balanced sensitivity (0.69, 95% CI: 0.63-0.75) and specificity (0.73, 95% CI: 0.60-0.86). Age, serum creatinine, left ventricular ejection fraction, and hemoglobin consistently influenced model efficacy.\nConclusions: GBM and SVM models, with robust AUCs and low heterogeneity, are effective in predicting AKI and CIN post-PCI/CAG. RF, MLP, and XGBoost, despite competitive AUCs, showed considerable heterogeneity, emphasizing the need for further validation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4c2eec00c2332bfaeed5d0b97d0a53b35b3091b39f361623e2775ce419e3074f","category":"Interdisciplinary"}