{"title":"Eosinophils and risk of ulcerative colitis in European population: Evidence from Mendelian randomization study","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24314?af=R","date":1714381232000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Observational studies have indicated that peripheral blood eosinophil count is elevated in individuals diagnosed with ulcerative colitis (UC) and correlates with the disease activity of UC. However, this conclusion contradicts with findings from other studies. Therefore, we employed Mendelian randomization (MR) method to assess the genetic link between eosinophil count and UC.</p>\n<h2>Method</h2>\n<p>This MR study utilized summary data from genome-wide association studies (GWAS) on eosinophil count and UC. The main approach used for conducting MR analysis was the inverse variance weighted (IVW) method. Meta-analysis of the IVW results was performed alongside multiple sensitivity analyses to confirm the robustness of the MR analysis results.</p>\n<h2>Results</h2>\n<p>The IVW method unveiled a causal relationship between eosinophil count and UC (OR = 1.18, 95% CI: 1.04–1.33, <i>p</i> = .01) in the discovery cohort. This finding was further corroborated by the replication cohorts (OR = 1.16, 95% CI: 1.04–1.29, <i>p</i> = .01; OR = 1.12, 95% CI: 1.01–1.24, <i>p</i> = .03). The meta-analysis indicated that the overall odds ratio (OR) for all studies was 1.15 (common effect model, 95% CI: 1.08–1.23, <i>p</i> &lt; .01). Sensitivity analysis suggested the absence of heterogeneity and horizontal pleiotropy in all MR analyses.</p>\n<h2>Conclusion</h2>\n<p>Based on bidirectional two-sample MR analysis, there is an indication that elevated eosinophil count may increase the risk of UC. However, potential confounding factors cannot be ruled out, and further research is necessary to explore how eosinophils contribute to the onset and progression of UC.</p>","author":"Yijia Shao, \nCong Liu, \nXiuqi Wang, \nWei Zhou","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"4c335f96f4d1a57cd4ecca047260277f6eead3e2ca2bc7850b2175757f3080f4","category":"Environment"}