{"title":"<i>Plasmodium</i> RON11 triggers biogenesis of the merozoite rhoptry pair and is essential for erythrocyte invasion","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002801","date":1726668000000,"content":"<p>by David Anaguano, Opeoluwa Adewale-Fasoro, Grace W. Vick, Sean Yanik, James Blauwkamp, Manuel A. Fierro, Sabrina Absalon, Prakash Srinivasan, Vasant Muralidharan</p>\r\n\r\nMalaria is a global and deadly human disease caused by the apicomplexan parasites of the genus <i>Plasmodium</i>. Parasite proliferation within human red blood cells (RBCs) is associated with the clinical manifestations of the disease. This asexual expansion within human RBCs begins with the invasion of RBCs by <i>P</i>. <i>falciparum</i>, which is mediated by the secretion of effectors from 2 specialized club-shaped secretory organelles in merozoite-stage parasites known as rhoptries. We investigated the function of the Rhoptry Neck Protein 11 (RON11), which contains 7 transmembrane domains and calcium-binding EF-hand domains. We generated conditional mutants of the <i>P</i>. <i>falciparum</i> RON11. Knockdown of RON11 inhibits parasite growth by preventing merozoite invasion. The loss of RON11 did not lead to any defects in processing of rhoptry proteins but instead led to a decrease in the amount of rhoptry proteins. We utilized ultrastructure expansion microscopy (U-ExM) to determine the effect of RON11 knockdown on rhoptry biogenesis. Surprisingly, in the absence of RON11, fully developed merozoites had only 1 rhoptry each. The single rhoptry in RON11-deficient merozoites were morphologically typical with a bulb and a neck oriented into the apical polar ring. Moreover, rhoptry proteins are trafficked accurately to the single rhoptry in RON11-deficient parasites. These data show that in the absence of RON11, the first rhoptry is generated during schizogony but upon the start of cytokinesis, the second rhoptry never forms. Interestingly, these single-rhoptry merozoites were able to attach to host RBCs but are unable to invade RBCs. Instead, RON11-deficient merozoites continue to engage with RBC for prolonged periods eventually resulting in echinocytosis, a result of secreting the contents from the single rhoptry into the RBC. Together, our data show that RON11 triggers the de novo biogenesis of the second rhoptry and functions in RBC invasion.","author":"David Anaguano","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"4c343658c363f143194979f07cd598ca4791789a08422af50db7d6862b097f5a","category":"Environment"}