{"title":"Effect of glycosylation, acylation and pyranylation at cyanidin C‐ring on its interaction with vitamin C in apple juice beverage matrix","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13835?af=R","date":1724758429000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Synchronous degradation between anthocyanin and vitamin C was found in fruit and vegetable juice matrices. To investigate whether the C-ring of anthocyanin is the key site of this interaction, cyanidin with four different C-ring modifications (3-glucosylation, 3,5-diglucosylation, 6″-malonylation, pyranylation) was added to vitamin C-containing apple juice, and the changes of anthocyanin retention, vitamin C retention, color, antioxidative activity and differential metabolites were analyzed.</p>\n<h2>RESULTS</h2>\n<p>The anthocyanin retention was in the order of pyranylation &gt;6″-malonylation &gt;3,5-diglucosylation &gt;3-glucosylation. The vitamin C retention was in the order of 6″-malonylation &gt; pyranylation &gt;3,5-diglucosylation &gt;3-glucosylation. The order of color stability was the same as that of anthocyanin retention, and the order of antioxidative activity was opposite to that of vitamin C retention. The results showed that modification at the C-ring limited the activity of anthocyanin, and suggested that the C-ring was one of the key sites for anthocyanin and vitamin C interaction. The shared differential metabolite of all apple juice matrices added with different anthocyanins was <i>trans</i>-hinokiresinol, which was likely generated from anthocyanin skeleton reacted with certain compounds in apple juice.</p>\n<h2>CONCLUSION</h2>\n<p>This study showed that modification of the anthocyanin C-ring could affect the anthocyanin and vitamin C interaction to some extent, which provided valuable insights for the application of anthocyanin C-ring modification in shelf-life quality control of typical fruit and vegetable beverages with the coexistence of anthocyanin and vitamin C. © 2024 Society of Chemical Industry.</p>","author":"Jinping Huang, \nChen Yang, \nXin Pan, \nJihong Wu, \nFei Lao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"4c3832f769f5fd1d7b44678fbbc231423336b66ed0ffac63dbe8bb859e38d56f","category":"Environment"}