{"title":"A new dawn? Population baselines of snow leopards and other mammals of the Kishtwar High Altitude National Park, India新的曙光？印度基什特瓦尔高海拔国家公园雪豹和其他哺乳动物的种群基线","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.61?af=R","date":1724752001000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e4bbd436-ccb2-465a-8dcf-dc4412d60f46/inc361-gra-0001-m.png\" alt=\"A new dawn? Population baselines of snow leopards and other mammals of the Kishtwar High Altitude National Park, India 新的曙光？印度基什特瓦尔高海拔国家公园雪豹和其他哺乳动物的种群基线\" /><p>The Greater Himalayas in India, of which Kishtwar High Altitude National Park (KHANP) is a part, harbours potential snow leopard habitat. We sampled three catchments within the Dachhan region of KHANP using 44 cameras and identified four unique snow leopard individuals across 14 detections in nine camera locations. We propose KHANP as a conservation landscape under the Project Snow Leopard of the Government of India.\n</p><br />\n<h2>Abstract</h2>\n<p>Accurately assessing the status of threatened species requires reliable population estimates. Despite this necessity, only a small proportion of the global distribution range of the vulnerable snow leopard (<i>Panthera uncia</i>) has been systematically sampled. The Indian section of the Greater Himalayas, which includes Kishtwar High Altitude National Park (KHANP), harbours potential snow leopard habitat. Nevertheless, there has been limited ecological and conservation research focusing on species that are specific to KHANP, as well as limited research on the broader biodiversity of the Greater Himalayas. We used Spatially Explicit Capture-Recapture (SECR) models to provide—to our knowledge—the first robust snow leopard population density and abundance estimates from KHANP. We also provide a Relative Abundance Index (RAI) for non-volant mammals (excluding small rodents). Our study sampled three catchments within the Dachhan region of KHANP—Kibber, Nanth and Kiyar—using 44 cameras over a 45-day period between May and June 2023. We identified four unique snow leopard individuals across 15 detections in nine camera locations. SECR analysis estimated a density of 0.50 snow leopards per 100 km<sup>2</sup> (95% confidence interval: 0.13–1.86), corresponding to an abundance of four individual (4–9) adults. Camera trapping revealed a total of 16 mammal species, including the endangered Kashmir musk deer (<i>Moschus cupreus</i>). Marmots (<i>Marmota caudata</i>) had the highest RAI of 21.3 (±0.2). Although the estimated density and abundance of snow leopards in our study area had relatively wide 95% confidence intervals, our combined results of snow leopard densities and RAIs of prey species such as ibex and marmots indicate that KHANP is a potentially important area for snow leopards. Given the geopolitical history of Jammu and Kashmir in India, the region where KHANP is located, wildlife research remains a low priority. We hope our study encourages authorities to support further research. This study is an initial step towards evaluating the potential of KHANP as a conservation landscape under the Government of India's Project Snow Leopard.</p>\n<h2>摘要</h2>\n<p>准确评估濒危物种的现状需要可靠的种群数据。尽管如此，全球范围内对易危物种雪豹（<i>Panthera uncia</i>）进行系统采样监测的区域却很少。大喜马拉雅山脉印度段，包括基什特瓦尔高海拔国家公园（KHANP），拥有潜在的雪豹栖息地。然而，针对 KHANP 特有物种的生态和保护研究十分有限，对大喜马拉雅山脉更广泛的生物多样性的研究也相对较少。本研究使用空间显式捕获-重捕（SECR）模型，首次提供了来自卡罕坝国家公园可靠的雪豹种群密度和多度估计。本研究还提供了非飞行哺乳动物（不包括小型啮齿动物）的相对多度指数 (RAI)。在 2023 年5月至6月的45天时间里，使用44台红外相机对基什特瓦尔高海拔国家公园达昌地区 (Dachhan region) 的三个流域——吉伯尔、南特和基亚尔——进行监测。在九个相机位点的 15 次探测中识别出 4 只不同的雪豹个体。SECR分析结果显示每100平方公里范围内有0.50只雪豹（95%置信区间:0.13-1.86），相当于研究区内有4只（4-9只）成年雪豹。通过红外相机监测共发现16种哺乳动物，其中包括濒危物种克什米尔麝（<i>Moschus cupreus</i>）。此外，长尾旱獭（<i>Marmota caudata</i>）是本研究中监测到相对多度最高的物种（RAI:21.3 ，SD:± 0.2)。尽管雪豹在我们研究区域的估计密度和丰度的95%置信区间相对较宽，但我们结合雪豹密度和猎物（如北山羊和旱獭）的相对多度指数结果表明，KHANP是雪豹重要的潜在栖息地。鉴于印度查谟和克什米尔地区（KHANP所在地区）的地缘政治历史，野生动物研究仍然是一个优先级较低的事项。本研究是评估 KHANP在印度政府“雪豹项目”下作为景观单元参与保护潜力探索的第一步，我们希望通过本研究促进当地政府对以后更多研究的支持。【审阅:耿颖】</p>","author":"Munib Khanyari, \nOyndrila Sanyal, \nPankaj Chandan, \nDeepti Bajaj, \nCharu Sharma, \nManoj Rana, \nNeeraj Sharma, \nTawqir Bashir, \nKulbhushansingh Suryawanshi","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"4c3cdc998a9a8d2f41db32c9881d0df65b261c57802d3932ca7c9bdfb00a4d73","category":"Environment"}