{"title":"HashiConf Global Preview: Sessions for Cloud Platform Teams","link":"https://www.hashicorp.com/blog/hashiconf-global-preview-sessions-for-cloud-platform-teams","date":1633446900000,"content":"<p>As enterprise cloud strategies mature, “platform teams” have become a best practice. Platform teams build, run, and support infrastructure and backing services that are exposed to development teams as self-service offerings.</p>\n<p><a href=\"https://hashiconf.com/global/\">HashiConf Global</a> (livestream Tuesday - Wednesday, October 19 - 20, and rebroadcast for the Asia/Pacific time zones on Wednesday - Thursday, October 20 - 21) is packed with sessions designed for platform teams. Here’s a preview of the relevant HashiConf talks grouped  into popular cloud architecture pillars: Operational Excellence, Security, and Reliability.</p>\n<h2><a href=\"#operational-excellence\">»</a><a></a>Operational Excellence</h2>\n<h3><a href=\"#tide-s-self-service-service-mesh-with-consul-https-hashiconf-com-global-schedule-tides-self-service-service-mesh-with-consul\">»</a><a></a><a href=\"https://hashiconf.com/global/schedule/tides-self-service-service-mesh-with-consul/\">Tide's Self-Service Service Mesh With Consul</a></h3>\n<p><strong>Wednesday, October 20, 12:30 p.m. ET</strong></p>\n<p><a href=\"https://www.tide.co/\">Tide Business Bank</a> — a leading UK FinTech firm — tells its <a href=\"https://www.hashicorp.com/products/consul\">HashiCorp Consul</a> adoption story. This talk is especially relevant for platform owners using Amazon Web Services (AWS). <a href=\"https://hashiconf.com/global/speakers/jez-halford/\">Jez Halford</a>, Tide’s Head of Cloud Engineering, explains how Tide uses <a href=\"https://cloud.hashicorp.com/pricing/consul\">HCP Consul</a> to wire up Amazon ECS and EC2, as well as ECS and AWS Fargate. Interestingly, the move to Consul came without downtime or a painful “big bang” migration. If you want greater networking automation across different AWS runtimes — and want to upgrade from your status quo — here’s your playbook.</p>\n<h3><a href=\"#a-journey-to-improving-slos-with-hashicorp-vault-https-hashiconf-com-global-schedule-a-journey-to-improving-slos-with-vault\">»</a><a></a><a href=\"https://hashiconf.com/global/schedule/a-journey-to-improving-slos-with-vault/\">A Journey to Improving SLOs With HashiCorp Vault</a></h3>\n<p><strong>Wednesday, October 20, 2:00 pm ET</strong></p>\n<p>Experienced cloud engineers tend to have a story or two about the expired certificate everyone forgot about. Good secrets management hygiene is essential to application — and platform — uptime and reliability. In this session, <a href=\"https://hashiconf.com/global/speakers/george-hantzaras/\">George Hantzaras</a>, a cloud engineering leader at Citrix, explains how <a href=\"https://www.hashicorp.com/products/vault\">HashiCorp Vault</a> improved service level objectives (SLOs) in the company’s observability infrastructure.</p>\n<h3><a href=\"#redeploying-stateless-systems-in-lieu-of-patching-https-hashiconf-com-global-schedule-redeploying-stateless-systems-in-lieu-of-patching\">»</a><a></a><a href=\"https://hashiconf.com/global/schedule/redeploying-stateless-systems-in-lieu-of-patching/\">Redeploying Stateless Systems in Lieu of Patching</a></h3>\n<p><strong>Tuesday, October 19, 1:00 pm ET</strong></p>\n<p>Seasoned operators know that patching is a way of life. But does it have to be? <a href=\"https://hashiconf.com/global/speakers/chris-manfre/\">Chris Manfre</a>, a Senior DevOps Engineer at Petco, says “no.” In this talk, he describes a better approach to vulnerability mitigation: replace unpatched instances with new instances that feature updated templates. He explains how <a href=\"https://www.packer.io/\">HashiCorp Packer</a> and <a href=\"https://www.hashicorp.com/products/terraform\">HashiCorp Terraform Enterprise</a> can help you adopt this <a href=\"https://www.hashicorp.com/resources/what-is-mutable-vs-immutable-infrastructure\">immutable infrastructure</a> best practice.</p>\n<h2><a href=\"#security\">»</a><a></a>Security</h2>\n<h3><a href=\"#vault-for-secrets-management-in-consul-k8s-https-hashiconf-com-global-schedule-vault-for-secrets-management-in-consul-k8s\">»</a><a></a><a href=\"https://hashiconf.com/global/schedule/vault-for-secrets-management-in-consul-k8s/\">Vault for Secrets Management in Consul K8s</a></h3>\n<p><strong>Tuesday, October 19, 12:30 pm ET</strong></p>\n<p>We’re all hearing a lot about <a href=\"https://www.hashicorp.com/solutions/zero-trust-security\">zero trust security</a> these days, and for good reason. It’s the modern approach to protecting critical systems and customer data. But what does implementing zero trust security really entail?</p>\n<p>Here’s a starting point: modernize your infrastructure around the new control point for security: identity. This is what the most secure organizations have done in recent years. From there, platform teams can authenticate and authorize access for services and users alike. That sounds great, but how do you actually do that in the real world? This talk will give you a big part of the answer, especially if you’re a Kubernetes shop.</p>\n<p><a href=\"https://hashiconf.com/global/speakers/kyle-schochenmaier/\">Kyle Schochenmaier</a>, HashiCorp Senior Engineer on the Consul Ecosystem, and HashiCorp Senior Product Manager <a href=\"https://hashiconf.com/global/speakers/david-yu/\">David Yu</a> HashiCorp explain how to use Vault as the secrets management backend for Consul atop Kubernetes. They also explain how to rotate secrets in Consul on Kubernetes. Attend this talk, and you’ll be in a much stronger position to combine the protections from Vault (machine authN and authZ) with those from Consul (machine-to-machine access).</p>\n<h3><a href=\"#managing-target-s-secrets-platform-https-hashiconf-com-global-schedule-managing-targets-secrets-platform\">»</a><a></a><a href=\"https://hashiconf.com/global/schedule/managing-targets-secrets-platform/\">Managing Target's Secrets Platform</a></h3>\n<p><strong>Tuesday, October 19, 1:30 p.m. ET</strong></p>\n<p>Every vertical industry has its own unique security challenges. Retailers around the world use HashiCorp’s tech to improve their security posture. This is a big job, and it requires constant vigilance from platform teams in this sector. Target — one of the largest retailers in the US with more than 1,900 locations — has an extraordinarily large attack surface to protect. <a href=\"https://hashiconf.com/global/speakers/shane-petrich/\">Shane Petrich</a>, a Target Lead Engineer, details how Target keeps its HashiCorp Vault deployment humming.</p>\n<h3><a href=\"#vault-roadmap-https-hashiconf-com-global-schedule-vault-roadmap\">»</a><a></a><a href=\"https://hashiconf.com/global/schedule/vault-roadmap/\">Vault Roadmap</a></h3>\n<p><strong>Tuesday, October 19, 2:00 p.m. PT</strong></p>\n<p>There’s a reason why Vault is the dominant secrets management solution for platform teams: it’s incredibly powerful and it continues to get even better. So what innovations do we have planned for Vault in the near future? Attend this session and hear the specifics from <a href=\"https://hashiconf.com/global/speakers/darshant-bhagat/\">Darshant Bhagat</a>, Product Head for Vault, and <a href=\"https://hashiconf.com/global/speakers/naaman-newbold/\">Naaman Newbold</a> Vault Director of Engineering.</p>\n<h2><a href=\"#reliability\">»</a><a></a>Reliability</h2>\n<h3><a href=\"#consul-use-cases-at-stripe-service-mesh-and-more-https-hashiconf-com-global-schedule-consul-use-cases-at-stripe-service-mesh-and-more\">»</a><a></a><a href=\"https://hashiconf.com/global/schedule/consul-use-cases-at-stripe-service-mesh-and-more/\">Consul Use Cases At Stripe: Service Mesh and More</a></h3>\n<p><strong>Tuesday, October 19, 1:30 p.m. PT</strong></p>\n<p>Interest in the service mesh pattern is surging. <a href=\"https://www.hashicorp.com/state-of-the-cloud#multi-cloud-is-tightly-connected-to-other-modern-technology-initiatives\">According to the HashiCorp State of Strategy Cloud survey</a>, service mesh adoption is expected to grow 250% in the year ahead. If this is on your roadmap, who better to learn from than <a href=\"https://stripe.com/\">Stripe</a>? After all, even a few seconds of downtime could cost the fintech giant millions. This company is on the cutting edge of modern networking, and there’s a lot to learn from its experience with Consul and Kubernetes.</p>\n<p><a href=\"https://hashiconf.com/global/speakers/mark-guan/\">Mark Guan</a> and <a href=\"https://hashiconf.com/global/speakers/ruoran-wang/\">Ruoran Wang</a>, Software Engineers at Stripe, reveal the details of their multi-region service networking tech stack. If this sounds like an impressive feat of engineering, it is. This duo gives you an inside look at their overall topology across various AWS accounts and regions, and how they federated multi-region clusters together.</p>\n<h3><a href=\"#the-future-of-hcp-packer-https-hashiconf-com-global-schedule-the-future-of-hcp-packer\">»</a><a></a><a href=\"https://hashiconf.com/global/schedule/the-future-of-hcp-packer/\">The Future of HCP Packer</a></h3>\n<p><strong>Tuesday, October 20, 12:30 p.m. ET</strong></p>\n<p>Platform teams use <a href=\"https://www.packer.io/\">Packer</a> to create identical machine images for multiple clouds from a single source configuration. Meanwhile, these same teams use Terraform to deploy images. What if there was a way to bring these two technologies closer together? That’s the vision behind <a href=\"https://www.hashicorp.com/blog/announcing-hcp-packer\">HCP Packer</a>: bridge the image-management workflows between Packer and Terraform. This service was first announced at<a href=\"https://hashiconf.com/europe/\"> HashiConf Europe in June</a>.</p>\n<p><a href=\"https://hashiconf.com/global/speakers/megan-marsh/\">Megan Marsh</a>, Packer’s Engineering Lead, will demonstrate the product and unveil exciting roadmap details. And don’t miss the <a href=\"https://hashiconf.com/global/hands-on-labs/?lab=build-a-golden-image-pipeline-with-hcp-packer\">hands-on lab for HCP Packer</a> at 1:30 p.m. ET on Wednesday, October 20.</p>\n<h3><a href=\"#network-automation-on-terraform-cloud-with-cts-https-hashiconf-com-global-schedule-network-automation-on-terraform-cloud-with-cts\">»</a><a></a><a href=\"https://hashiconf.com/global/schedule/network-automation-on-terraform-cloud-with-cts/\">Network Automation on Terraform Cloud With CTS</a></h3>\n<p><strong>Wednesday, October 20, 1:30 p.m. PT</strong></p>\n<p>Ticketing systems are the enemy of the modern platform team. They served their purpose in years past; now we’re in the era of automation and self-service. Yet even the most determined enterprise likely has a few workflows that still depend on tickets. One stubborn scenario: requests for network configuration changes. Here, dev teams are ready to release new code to production, but the new code requires firewall policy updates or changes to the load balancer member pool.</p>\n<p>This session focuses on <a href=\"https://www.hashicorp.com/blog/announcing-consul-terraform-sync-0-3-for-terraform-enterprise\">Consul-Terraform-Sync</a> (CTS), a new capability that automates this gap in your workflow. HashiCorp Senior Engineers <a href=\"https://hashiconf.com/global/speakers/melissa-kam/\">Melissa Kam, </a>and <a href=\"https://hashiconf.com/global/speakers/kim-ngo/\">Kim Ngo</a> show you how CTS introduces network infrastructure automation to Consul and integrates directly with Terraform Cloud. Attend this session and learn how CTS monitors changes to the L7 network layer, and subsequently uses Terraform to dynamically update infrastructure.</p>\n<h3><a href=\"#workday-s-multi-cloud-network-fabric-with-consul-vault-https-hashiconf-com-global-schedule-workdays-multi-cloud-network-fabric-with-consul-and-vault\">»</a><a></a><a href=\"https://hashiconf.com/global/schedule/workdays-multi-cloud-network-fabric-with-consul-and-vault/\">Workday's Multi-Cloud Network Fabric With Consul &amp; Vault</a></h3>\n<p><strong>Wednesday, October 20, 1:00 p.m. ET</strong></p>\n<p>The hallmark of a reliable distributed system is that it continues to behave as expected even as it changes rapidly. Workday’s platform team has supported rapid growth and innovation over the last few years. To handle this growth, it uses Consul and Vault as part of its critical infrastructure. Workday Principal Engineer <a href=\"https://hashiconf.com/global/speakers/daniele-vazzola/\">Daniele Vazzola</a> explains how his company uses HashiCorp’s tools to support deployments across multiple cloud providers and on-premises datacenters. He even digs into how this multi-cloud fabric empowers service teams to autonomously set up secure connections across datacenters between workloads running on heterogeneous platforms. Don’t miss it!</p>\n<h2><a href=\"#join-us-for-the-livestreams\">»</a><a></a>Join Us for the Livestreams</h2>\n<p>These fantastic talks are only a small part of what you’ll experience at HashiConf Global, happening online Tuesday - Wednesday, October 19 - 20 (and rebroadcast for the Asia/Pacific time zones on Wednesday - Thursday, October 20 - 21)<strong>.</strong> This year, in addition to the visionary keynote sessions and dozens of useful practitioner talks, we’ve added free <a href=\"https://hashiconf.com/global/hands-on-labs/\">hands-on labs</a>. For platform teams, we recommend the labs: <a href=\"https://hashiconf.com/global/hands-on-labs/?lab=vault-as-a-certificate-authority-for-consult-connect\">Vault as a Certificate Authority (CA) for Consul Connect</a> and <a href=\"https://hashiconf.com/global/hands-on-labs/?lab=create-a-custom-provider-with-the-terraform-plugin-framework\">Create a Custom Provider With the Terraform Plugin Framework</a>.</p>\n<p><a href=\"https://hashiconf.com/global\">Register for HashiConf Global today</a> — it’s fast and free.</p>","author":"Jared Ruckle","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"4c3da18885723f1da261b168c6b2948e7585e78dc92b4906e60041aea2a108eb","category":"Tech"}