{"title":"Mark Cerny เผยเบื้องหลังการออกแบบ PS5 ฟีเจอร์ที่นักพัฒนาต้องการที่สุดคือ SSD","link":"https://www.blognone.com/node/126049","date":1638166455000,"content":"<div><div><div><p>Mark Cerny หัวหน้าฝ่ายสถาปัตยกรรม PlayStation ให้สัมภาษณ์กับ Wired เล่าเบื้องหลังกระบวนการออกแบบ PS5 ให้เราได้ทราบกัน</p>\n<p>Cerny เล่าว่าขั้นแรกของการออกแบบคอนโซลคือการประชุมระดมสมองในทีมก่อน นำรายการฟีเจอร์ที่ใส่ไม่ทันในคอนโซลรุ่นก่อน, รายการไอเดียใหม่ๆ รวมถึงเสียงเรียกร้องจากนักพัฒนาเกมว่าอยากได้อะไร มารวมกันแล้วดูว่าฟีเจอร์ไหนควรทำ สามารถทำได้หรือไม่ ภายใต้ข้อจำกัดอะไรบ้าง</p>\n<p>Cerny บอกว่าฟีเจอร์ที่ได้รับการร้องขอเยอะที่สุดตั้งแต่ยุค PS4 คือสตอเรจแบบ SSD โดยเขาอ้างถึง Tim Sweeney ซีอีโอของ Epic Games ที่บอกว่าฮาร์ดดิสก์เป็นตัวฉุดรั้งวงการเกม เพราะการหมุนจานเพื่อเรียกข้อมูล เป็นอุปสรรคสำคัญของการออกแบบเกม ทำให้นักพัฒนาต้องออกแบบฉากให้มีช่วงโหลดข้อมูล ไม่สามารถสร้างฉากขนาดใหญ่ที่ลื่นไหลได้อย่างที่ต้องการ</p>\n<p>แต่ถึงแม้ข้อเรียกร้อง SSD เป็นมติเอกฉันท์ของวงการ Cerny ก็เล่าว่ายังมีรายละเอียดทางเทคนิคอีกมากที่ต้องตัดสินใจ เช่น ประเภทของ SSD, ความเร็วของ SSD (เขาเล่าว่านักพัฒนาเรียกร้อง 1 GBps แต่สุดท้ายแล้ว โซนี่ตั้งเป้าให้ได้ 5-10X)</p>\n<p>รายละเอียดอีกอันที่น่าสนใจคือเรื่อง Integrated I/O ที่โซนี่ออกแบบชิป I/O เฉพาะเพื่อจัดการเรื่องบีบอัดข้อมูล นักพัฒนามีหน้าที่ให้เกมเรียกขอข้อมูลจากระบบเท่านั้นพอ การจัดการข้อมูลที่เก็บในสตอเรจ การขยายการบีบอัด ระบบแคช ฯลฯ ตัวชิป I/O จะจัดการให้ทั้งหมด (PS5 ใช้<a href=\"https://www.blognone.com/node/120449\">อัลกอรึทีมบีบอัด Kraken ของบริษัท RAD ที่เพิ่งถูก Epic ซื้อไป</a>)</p>\n<p>Cerny ยังเล่าถึงการออกแบบซีพียู/จีพียู ว่าต้องตัดสินใจเลือกจำนวนคอร์ของแต่ละฝั่ง ซึ่งความเห็นของนักพัฒนาก็หลากหลาย นอกจากนี้ยังมีรายการฟีเจอร์แบบคัสตอมบางอย่างที่สั่ง AMD ทำให้ เช่น วิธีการเก็บข้อมูลหากเกมแครช, โหมดความเข้ากันได้กับเกมเก่ายุค PS4</p>\n<p>ประเด็นเรื่อง Tempest 3D audio เป็นอีกเรื่องที่ Cerny พูดถึง โดยบอกว่าตั้งใจให้เกมเมอร์ทุกคนได้สัมผัสประสบการณ์นี้ ผ่านหูฟังทั่วๆ ไปหรือแม้แต่ผ่านลำโพงทีวี และโซนี่อยากให้นักพัฒนาทำงานง่าย จึงเพิ่มชิป 3D audio เฉพาะเข้ามาให้ใน SoC มีวิธีการทำงานคล้ายจีพียู แต่ใช้ประมวลผลแหล่งปล่อยเสียงในเกมแทน เมื่อนักพัฒนาสามารถสร้างเสียงที่รู้สึกถึงแหล่งที่มา (presence) ก็จะเพิ่มมิติการเล่าเรื่องแบบใหม่ๆ ได้</p>\n<p>ที่มา - <a href=\"https://www.youtube.com/watch?v=cJkx-OLgLzo\">Wired</a> via <a href=\"https://www.polygon.com/22792063/ps5-design-sony-mark-cerny-game-developers\">Polygon</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ps5\">PS5</a></div><div><a href=\"/topics/playstation\">PlayStation</a></div><div><a href=\"/topics/ssd\">SSD</a></div><div><a href=\"/topics/hardware\">Hardware</a></div><div><a href=\"/topics/sony\">Sony</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4c406859535d1d640f323cc5fedeba28fa51e68f8d7ab5ad4da303be363fcc61","category":"Thai"}