{"title":"iOS 15’s beta tweaks show Apple is finally listening–just like it always has","link":"https://www.macworld.com/article/355802/macalope-ios-15-tweaks-apple-listening.html","date":1631012400000,"content":"<div>\n<section><div></div></section><p>This year, for the first time ever, Apple has listened to customers. Other than all the other times it did.</p>\n\n\n\n<p>Writing for Bloomberg (the outfit that brought you “<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/features/2018-10-04/the-big-hack-how-china-used-a-tiny-chip-to-infiltrate-america-s-top-companies&amp;xcust=1-1-355802-1-0-0&amp;sref=https://www.macworld.com/feed\">The Big Hack</a>”, a story widely disputed by representatives of the companies involved, security experts, journalists, and the teens that hang out outside the Gas-N-Sip), Mark Gurman says <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2021-08-22/apple-s-ios-15-reversal-shows-it-s-now-actually-listening-to-users&amp;xcust=1-1-355802-1-0-0&amp;sref=https://www.macworld.com/feed\">“Apple’s iOS 15 Reversal Shows It’s Now Actually Listening to Users.”</a></p>\n\n\n\n<blockquote><p>Apple isn’t particularly known for listening to consumers when making design decisions…</p></blockquote>\n\n\n\n<p>It’s not known for that, yet it still actually does it more than you’d think.</p>\n\n\n\n<p>Most of Gurman’s examples of Apple not listening are hardware-related: the iPhone 4’s <a href=\"https://www.macworld.com/article/206363/apple_iphone4.html\">antenna</a>, the <a href=\"https://www.macworld.com/article/232811/apple-improves-butterfly-keyboard-again-offers-to-free-fixes-for-some-macbook-models.html\">butterfly keyboard</a> and the <a href=\"https://www.macworld.com/article/235020/apples-next-m1-macbook-pros-might-dump-the-touch-bar-revive-magsafe.html\">Touch Bar</a>. This is a bit of an unfair comparison as it’s a lot harder to make hardware changes mid-stream than software ones. And it often eventually does change hardware based on feedback. It took Apple a few years to start shipping larger phones, but it eventually did. There’s an example of the company chasing the market, as much as the Macalope wishes it hadn’t.</p>\n\n\n\n<p>For the one example Gurman offers that isn’t hardware, iOS 7, Gurman notes Apple <em>did</em> make changes based on feedback, it just didn’t ditch the entire thing. These goalposts just sliiiide back and forth. It’s worth pointing out that while many complaints about iOS 7 were based on usability and accessibility issues, others were centered on Apple ditching “manly colors”, turning iOS 7 into “an estrogen-addled mess designed for 13-year-old girls”.</p>\n\n\n\n<p>There are some criticisms that simply should not be listened to. They should be recorded onto laserdisc and shot into the sun. See, for example, the insistence that Apple should bring Flash to iOS. Apple didn’t listen to complaints and it <a href=\"https://www.macworld.com/article/225914/you-dont-have-to-be-a-villain-to-say-flash-must-die.html\">shouldn’t have</a>.</p>\n\n\n\n<p>But even while Apple sometimes sticks to its guns, it’s long been flexible when appropriate. While it took several months after the release of Leopard in 2007 (this was before Apple offered public betas), Apple backtracked on the translucent menu bar and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.tech-recipes.com/rx/2782/leopard_disable_enable_translucent_menu_bar/&amp;xcust=1-1-355802-1-0-0&amp;sref=https://www.macworld.com/feed\">added an option to disable it</a>.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>Everyone says Apple doesn’t do focus groups, but it’s been releasing public betas for seven years and they’re not solely for finding bugs. Speaking of public betas, Apple released a public beta of Mac OS X in 2000. It, incidentally, featured an Apple icon right in the middle of the menu bar, something that mercifully did not make its way into the 10.0 release because people hated it.</p>\n\n\n\n<p>There’s no doubt Apple can sometimes be pretty pig-headed. While it does take longer to make hardware changes, the fact that the Magic Mouse still to this day in the year 2021 charges from a port on the bottom of the mouse, rendering it useless while charging, is frankly an insult to pigs who can, on occasion, be quite reasonable. At least <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Apple_USB_Mouse&amp;xcust=1-1-355802-1-0-0&amp;sref=https://www.macworld.com/feed\">the hockey puck mouse</a> was the same bare minimum of usability at all times. (The hockey puck mouse only lasted two years. The bottom-charging Magic Mouse has been with for six.)</p>\n\n\n\n<p>The changes to Safari since iOS 15 was first introduced at WWDC are certainly a fairly heavy rollback. But they’re also getting fixed before the general release. The Macalope doesn’t know any particulars behind this proposed change, but it almost seems like it’s an internal disagreement over design that was allowed to play out in the beta. Someone really liked the idea and other people said “Well, let’s see what people think… <em>Gary</em>.”</p>\n\n\n\n<p>And now Gary eats by himself at the cafeteria.</p>\n\n\n\n<p>Apple certainly starts with its own way of thinking, but it’s listened to feedback for a long time now.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4c4b27a6dc8357e6e9ca3d36cd96c10a6de96bf6365b9cf33612800b04053f16","category":"Apple"}