{"title":"Tree size partially mediates the influence of climate on fruit and seed production in Ricinodendron heudelotii (Baill.) Heckel","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13302?af=R","date":1720609776000,"content":"<h2>Abstract</h2>\n<p>Understanding environmental drivers of fruit and seed production in wild edible fruit species is essential for their valorisation. <i>Ricinodendron heudelotii</i> is an oilseed plant whose kernels are particularly treasured in cosmetic and medical industries. This study assessed fruits and seeds production patterns of <i>R. heudelotii</i>. Data were collected for three consecutive years on 30 trees in the phytodistricts of Plateau, Pobè and South Borgou where it naturally occurs. Tree dbh, total height, crown diameter, number of fruits and seed mass were measured. Climatic data were obtained from NASA Power Database. Data were analysed using linear (seed mass) and generalised linear (number of fruits) mixed models and structural equation modelling. Fruit and seed production were significantly higher in the South-Borgou phytodistrict (1433 ± 1144 fruits, 4.26 ± 3.39 kg of Dry matter per tree) and Plateau phytodistrict (1.66 ± 0.35 g DM/seed). Tree dbh further significantly mediated the effect of minimum temperature, and relative humidity on seed mass. Tree dbh, irradiance and dry season rainfall were identified as the best-predictors of seed mass production (kg DM). These results improved current knowledge of the fruit and seed production of <i>R. heudelotii</i> and are of significant importance for the exploitation of the species.</p>\n<h2>Résumé</h2>\n<p>Il est fondamental de comprendre les facteurs environnementaux de la production de fruits et de graines chez les espèces sauvages de fruits comestibles pour pouvoir les valoriser. <i>Ricinodendron heudelotii</i> est une plante oléagineuse dont les noisettes sont particulièrement prisées par les industries cosmétique et médicale. La présente étude a évalué les schémas de production de fruits et de graines de <i>R. heudelotii</i>. Des données ont été collectées pendant trois années consécutives sur 30 arbres dans les districts phytosanitaires du Plateau, du Pobè et du Sud-Borgou où l'espèce est naturellement présente. Le DHP, la hauteur totale, le diamètre de la couronne, le nombre de fruits et la masse des graines des arbres ont été mesurés. Les données climatiques ont été obtenues à partir de la NASA Power Database. Les données ont été analysées à l'aide de modèles mixtes linéaires (masse des graines) et linéaires généralisés (nombre de fruits) et d'un modèle d'équation structurelle. La production de fruits et de graines était nettement plus élevée dans le district phytosanitaire du Sud-Borgou (1433 ± 1144 fruits, 4,26 ± 3,39 kg de matière sèche par arbre) et dans le district phytosanitaire du Plateau (1,66 ± 0,35 g de MS/semence). Le DHP de l'arbre a également contribué de manière considérable à l'effet de la température minimale et de l'humidité relative sur la masse des graines. Le DHP de l'arbre, l'irradiance et les précipitations de la saison sèche ont été identifiés comme les meilleurs indicateurs de la production de masse de graines (kg MS). Ces résultats améliorent les connaissances actuelles sur la production de fruits et de graines de <i>R. heudelotii</i> et sont d'une importance capitale pour l'exploitation de l'espèce.</p>","author":"Guillaume Hounsou‐Dindin, \nKolawolé Valère Salako, \nKisito Gandji, \nAristide Cossi Adomou, \nAchille Assogbadjo, \nRomain Glèlè Kakaï","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"4c4eee86ad9b0a8e3cbf2b61a8699a76a915b83d53739622b01667bc89af9a18","category":"Environment"}