{"title":"Comparison of Measurement Protocols for Internal Channels of Transparent Microfluidic Devices","link":"https://www.preprints.org/manuscript/202409.0313/v1","date":1725458966000,"content":"The microfluidic industry recognizes the lack of sensitive and standardized testing methods as one of the major hurdles to overcome before fulfilling its revolutionary promises. Highly ranked upon the list of things in need of testing methods are the internal dimensions of microfluidic structures after chip assembly. This work, performed under the MFMET project, aims to address this challenge by presenting and comparing multiple protocols for measuring the dimensions of internal microfluidic channels of fully assembled transparent chips. The protocols include optical profilometry, optical microscopy and tiled digital imagery. Several standardized chip designs out of two different materials commonly used in microfluidics (D263©bio and TOPAS© COC) were measured by the different protocols. A consistency analysis through normalized error statistics revealed optical profilometry as the preferred method due to its low uncertainty compared to the other protocols and its higher consistency with nominal geometry values. All protocols showed difficulty with vertical depth measurements of internal structures. Associated possible directions of future research are considered including further study of the influence of multiple refractive surfaces on optical profilometry measurements and further investigation of confocal microscopy as a potential measurement method showing promising preliminary results. The influence of the different materials appears to be minimal on optical profilometry, but other materials and method would merit looking into before such an observation might be generalized. In conclusion, the results of this work directly address the current lack of measurement methods for internal microfluidic structures by providing a comprehensive comparison of different protocols, ultimately suggesting a preferred option for immediate application within the microfluidic industry. Additionally, this work offers valuable directions for future research, serving as an initial step in overcoming a significant challenge that impedes the microfluidic industry from realizing its revolutionary potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4c6ccca1c9c17ca9aff8b80c397b46ee5b21b2b9eda88233f1674f1a0438296d","category":"Interdisciplinary"}