{"title":"HPV Vaccine Uptake in Tennessee: Implications for Improving HPV Vaccine Coverage with the Inclusion of Mid-adults","link":"https://www.preprints.org/manuscript/202408.1922/v1","date":1724752102000,"content":"Human papillomavirus (HPV) is the most common sexually transmitted infection in the US and the world. Infection with high-risk oncogenic HPV strains have been shown to induce cellular transformation leading to anogenital and oropharyngeal cancers. The HPV vaccine first developed in 2006 for females aged 9-26 years has been demonstrated to be safe and effective in preventing 90% of all HPV associated cancers. However, vaccine hesitancy, misinformation, and barriers to vaccine access has resulted in suboptimal vaccination rates among adolescent populations, especially in rural communities in the South. HPV vaccine coverage in Tennessee is currently below the national average and below the Healthy People 2030 goal of an 80% vaccination rate for individuals 13-17 years old based on recommendation guidelines for up-to-date HPV vaccination status as of 2022. HPV vaccination rates for Tennesseans with private insurance in 2022 was 68% and 38% for those that were insured. Up-to-date HPV vaccination rates for Tennesseans living in urban communities was 58% in 2022 and 46% for those living in rural communities. Overall, HPV associated cancers rates are higher in Tennessee at 12.9/100,000 compared to the overall rate in the US of 11.8/100,000 persons in 2022. Interventions to improve HPV vaccine awareness, education, and access could improve vaccine confidence and uptake especially among rural and uninsured populations in Tennessee. Most recently, the Advisory Committee on Immunization Practices (ACIP) has expanded recommendations for the HPV vaccinations for some individuals 27-45 years who were not vaccinated at a younger age with shared clinical decision-making. The impact of this recommendation on Tennesseans should be examined.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4c7e811defe1ce2c7676d3c1ca564012d5c548c03d14a532504fadeb9be90393","category":"Interdisciplinary"}