{"title":"Correctness of Frequency Standards Accuracy Estimates","link":"https://www.preprints.org/manuscript/202410.0559/v1","date":1728370656000,"content":"For measuring time, distances and movements, including determining the location of ground objects using a global navigation satellite system using the triangulation method, high-precision generators of extremely accurately generated reference frequencies, as reference measures of frequency and time intervals, are extremely relevant. Along with those already approved as frequency and time standards, exemplary stable frequency signal generators are constantly being created, improved and researched, that is, prototypes of future frequency and time standards based on new principles. Model generators are also being created on known principles with additional measures to increase their accuracy. The most important stage in the creation of such standards and their prototypes is the study of the stability and accuracy characteristics of the resulting model generators. Traditionally, indicators such as the two-sample Allan variance are used for this, and even more often the square root of this value, called the Allan function, is used. Many publications report results in which the dependence of this function on the averaging time is given on a double logarithmic scale. A decrease in this value with increasing averaging time looks natural and is beyond doubt, however, the right branch of this graph very often begins to bend upward, which indicates that with increasing averaging time the Allan function increases. This fact cannot satisfy future users of these exemplary generators, since such an increase indicates that the frequency value they generate should not be trusted, because it turns out that over a long period of time the generated frequency can deviate from the required value very far, and the longer this time , the more this function can deviate. The situation is aggravated by the fact that the Allan function does not include offset, that is, such an important characteristic as frequency reproducibility, when in fact this characteristic should also be taken into account. This article offers a new vision and interpretation of the metrological characteristics of the accuracy, stability and reproducibility of the generated frequency of a model generator.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4c87e4c3717d258def89d8bf1f32c648dd81e545e9ceda7aa6ac65814bf980ca","category":"Interdisciplinary"}