{"title":"Adults&rsquo; with Intellectual Disabilities Perspectives on Quality of Life: A Qualitative Study","link":"https://www.preprints.org/manuscript/202408.0013/v1","date":1722504224000,"content":"Adults’ with Intellectual Disabilities (ID) experiences on occupational participation were explored through the prism of Occupational Justice model (MOJ) aiming to shape and develop an occupation-centered model of Quality of Life (QoL). In this qualitative study participated thirteen adults with ID (N=13). A semi-structured interview based on MOJ was constructed and administered to explore perspectives on QoL, as well as injustices regarding occupational participation. The interviews were processed with QSR NVivo8 following content analysis research methodology. An Occupational – Quality of Life (O-QoL) model with an everyday occupations core component has been formed. This model includes three core O-QoL domains: (i) social well-being, (ii) emotional – physical well-being and (iii) material adequacy. Main indicators of O-QoL were the recreational occupations and social activities, while socio-environmental factors such as occupational deprivation have been identified as aggravating. In addition, specific occupations such as leisure activities, physical exercise / sports, art, video games and vocational training could also be beneficial for O-QoL. Moreover, the importance of promoting and supporting the rights of people with ID for employment, independent living and sexual expression was highlighted. The O-QoL could be a valuable conceptual framework in the field of ID, however further research for developing specialized assessment tools and Occupational Therapy interventions to promote O-QoL is needed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4c8c2ec4352cb1d2147d34fe5e95259b53cbd960af1ab4bbded1982531b1d0cc","category":"Interdisciplinary"}