{"title":"Tesla price cuts and a tax credit are driving used EV sales","link":"https://arstechnica.com/?p=1930418","date":1681142154000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-172662668-800x533.jpg\" alt=\"Stickers on the windshield of a car for sale at a used car dealership\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-172662668-scaled.jpg\">Enlarge</a> (credit: Getty images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>After several years of strong growth in sales of electric vehicles, there is evidence that the supply of used EVs is starting to grow as well. Data gathered by industry analyst Cox Automotive shows a 32 percent increase in sales of used EVs through licensed car dealers to 42,753 cars for the first three months of 2023. Cox says this does not include private party sales and that used EV sales in the first quarter of this year represent twice as many as were sold in Q1 2021.</p>\n<p>\"Every new vehicle eventually becomes a used vehicle,\" said Jonathan Smoke, chief economist of Cox Automotive. \"Our data sets indicate used EV sales will begin increasing rapidly from here, following a clear path set by new sales. In Q1, our team at Manheim [a wholesale marketplace for used cars] processed a record number of used EVs in the wholesale market. This is an approaching challenge for the industry we’ve already begun to embrace, as placing a value on a used EV is a new set of skills we all need to develop and refine.\"</p>\n<p>More than 900,000 used cars went through Manheim in Q1 2023, of which 9,800 were EVs—a tiny overall percentage but an increase of 40 percent compared to Q1 2022.</p></div><p><a href=\"https://arstechnica.com/?p=1930418#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1930418&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4c92b8e6a928d8835190c5718dcb1a98e4120fcf1f5979d3e506fdbcb3b9ba57","category":"Tech"}