{"title":"GSK‐3β/Notch‐1 Activation Promotes Radiation‐Induced Renal Damage: The Role of Gallic Acid in Mitigation of Nephrotoxicity","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24361?af=R","date":1718779436000,"content":"<h2>ABSTRACT</h2>\n<p>Despite the therapeutic advances in treating malignancies, the efficient radiotherapeutic approaches with deprived adverse reactions still represent a potential clinical inquiry. The current study aims to elucidate the role of gallic acid (GA) in modifying the hazardous renal cytotoxicity induced by acute exposure to radiation. The MTT test was used to evaluate the viability of Vero cells exposed to 2 Gy gamma radiation with or without incubation of GA. In an in vivo model, male Wistar rats were divided into four experimental groups (<i>n</i> = 6): Control, Irradiated (IRR, 5 Gy), GA (100 mg/kg, i.p.) + IRR, and Glycogen synthase kinase inhibitor (GSKI, 3 mg/kg, i.p.) + IRR. Based on the MTT toxicity assay, from 0 and up to 5 μM dosages of GA did not demonstrate any cytotoxicity to Vero cells. The optimal GA dose that could protect the cells from radiation was 5 μM. Furthermore, GA exerted a protective effect from gamma radiation on renal tissue as indicated by corrected renal functions, decreased LDH level in serum, and balanced oxidative status, which is indicated by decreased tissue contents of NOx and TBARS with a significant increase of reduced GSH. These outcomes were inferred by the upregulation of nuclear factor erythroid 2-related factor 2 (Nrf2) expression. The overall molecular impact of radiation in damaging the renal tissue may be explained by modifying the upstream AKT activity and its downstream targets GSK-3β/Notch-1. Here, we concluded that the anticipated adverse reaction in the course of radiation exposure could be protected by daily administration of GA.</p>","author":"Doaa H. Abdel‐Naby, \nMarwa M. El‐Sheikh, \nSahar S. Abd El‐Rahman, \nTarek El‐Hamoly","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"4c994a7dd609112bf4e2bc3ecde19f7be409784fd6d47e4c750de0d68410c55e","category":"Environment"}