{"title":"Cognitive Function, Healthy Diet, and All-Cause Mortality among Chinese Older Adults: A Longitudinal Prospective Study","link":"https://www.preprints.org/manuscript/202404.0345/v1","date":1712202702000,"content":"Background: Both of cognitive decline and unhealthy lifestyle have been associated with an increased risk of mortality in older people. We aimed to investigate whether lifestyle behaviors might modify the association between cognitive function and the risk of all-cause mortality in Chinese older populations.\nMethods: The study included 5,124 individuals free of dementia in the Chinese Longitudinal Healthy Longevity Survey from 2011 to 2018. Cognitive function was measured using the Mini-Mental State Examination in 2011. A lifestyle score was calculated on the basis of five lifestyle factors including smoking, alcohol consumption, physical activity, diet and body mass index. Cox proportional hazards models were performed to examine the association between baseline cognitive function and all-cause mortality, with an interaction term of cognitive function and lifestyle score being added to the models\nResults: During a median follow-up of 6.4 years, we documented 1,461 deaths. Both higher cognitive function (HR: 0.96; 95% CI: 0.96–0.97) and healthier lifestyle (HR: 0.92; 95% CI: 0.87–0.97) were significantly associated with a lower risk of mortality. We found that lifestyle significantly modified the association of cognitive function with mortality (P for interaction = 0.004). The inverse association between high cognitive function and mortality was more prominent among participants with healthier lifestyle. Of note, among the lifestyle scores component, diet showed a significant interaction with mortality (P for interaction = 0.003), with the protective HR of the all-cause mortality associated with higher MMSE scores was stronger among participants with healthy diets compared with unhealthy diets.\nConclusion: Our study indicates that cognitive decline is associated with an increased risk of mortality, and such relations are modified by overall lifestyle, with healthy diet being the major contributor.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4c9c1c9469de5f119210e0b71a70629b00eca2cdcb181484f20568fde8b892d1","category":"Interdisciplinary"}