{"title":"PSIX-4 Standardized amino acid digestibility of defatted black soldier fly larvae meal (BSFLM) in extruded canine diets","link":"https://academic.oup.com/jas/article/102/Supplement_3/571/7757608?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The use of insects, such as black soldier fly (<span>Hermetia illucens</span>) larvae meal (BSFLM), as an alternative protein source for animal feed, including pet food, has gained attention due to their high nutritional value and sustainability attributes. The aims of the study were to determine the chemical composition and amino acid digestibility of canine diets using BSFL to partially or completely replace chicken meal (CM) at 15% or 30% inclusion using the precision-fed cecectomized rooster assay. Fifteen cecectomized roosters (n = 5 per treatment) were randomly assigned to the test diets: Control, 15% BSFLM, and 30% BSFLM. After 26 h of feed withdrawal, 20 g of substrates were crop-fed and excreta were collected for 48 h. Data were analyzed using SAS Proc Mixed 9.4 with <span>P</span> ≤ 0.05 significance. The chemical composition was similar among all 3 dietary treatments. On average, the diets had similar macronutrient compositions: dry matter 92 to 93.7%, organic matter 89%, crude protein (CP) 26.7 to 28.4%, acid hydrolyzed fat 14.6%, total dietary fiber (TDF) 11.5 to 13.3%, and gross energy was 4.9 kcal/g. The slight variations in CP and TDF concentrations were due to the BSFLM. Additionally, all diets had similar concentrations of indispensable and dispensable amino acids. The standardized digestibility for all indispensable amino acids was above 75% for all dietary treatments, except histidine, lysine, and methionine + cysteine for the 30% BSFLM diet. The inclusion of BSFLM at both 15% or 30%, as a partial or full replacement of chicken by-product meal, did not negatively impact the chemical composition or amino acid digestibility of the experimental diets. Overall, this study highlighted the viability of BSFLM as an alternative and sustainable protein source in canine nutrition, indicating that extruded diets formulated with BSFLM as a partial or primary protein source can sustain adult dogs’ nutritional needs similarly to diets formulated with CM.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4c9cd2057ee28555ab0ecc7fedb15af982e329c8e636bb3ac631c7c095c35f67","category":"Environment"}