{"title":"Vuelta a España 2023 stage 14 preview: a relentless day of climbing","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2023-stage-14-preview","date":1694190602000,"content":"\n      <p><b>Distance: </b>156.5km<b><br /></b><b>Start location: </b>Sauveterre-de-Béarn<b><br /></b><b>Finish location: </b>Larra-Belagua <b><br /></b><b>Start time: </b>12:55 CEST<b><br /></b><b>Finish time (approx): </b>17:30 CEST</p>\n<p>Having crossed the border into France on stage 13 via the mountains of the Pyrenees, the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> ventures deeper into the country to begin stage 14 in Sauveterre-de-Béarn. Considering that the riders will head immediately from there back south towards the Pyrenees for what is a second successive huge day of climbing featuring about 4,500m of elevation gain, it’s a curious decision from the organisers to start the stage with such a long stretch of flat to get back into the mountains. What it does mean is that the medieval town of Sauveterre-de-Béarn is showcased. It’s a place with plenty of history, featuring a Monréal Tower and the Légend Bridge defensive structures that signify Béarn’s history as a place fought over between England, France, Navarre and Gascony, before becoming its own sovereign principality. </p>\n<p><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/0205b.png?v=1693296863\" /></p>\n<p><i>Stage 14 profile sourced via the Vuelta website</i></p>\n<p><span>The climbs might not be as famous as the iconic summits tackled yesterday, but they are just as hard, making these two days in the Pyrenees the hardest back-to-back of the whole Vuelta. Not that it starts out that way — the first 54km as the riders make their way from Sauveterre-de-Béarn back into the Pyrenees are along flat valley roads, which could make for a chaotic start to the day as non-climbers looking for a head-start to help shield them from the time cut and climbers wanting to go for the stage win all try to get up the road. </span></p>\n<p>Only the proper climbers will be left at the head of the race by the top of the first of the day’s three climbs, the Col Hourcère. Averaging a brutal 8.7% for 11.1km, it’s one of the five climbs at this Vuelta to have been given an <em>especial</em> category. Then immediately after they’re done descending that comes the next of those highest-ranked climbs, the Puerto de Larrau, which might be even harder. It rises at a similarly steep gradient, save for a brief downhill stretch towards the top, but for significantly longer, totalling 14.9km.</p>\n<p>Downhill roads briefly interrupted by the short category Puerto de Laza brings the riders back into Spain and to the foot of the final climb, Puerto de Belagua, a mountain making its Vuelta debut. With shallower gradients averaging 6.3%, the 9.5km effort isn’t quite as hard as the two monstrous summits that precede it, but the lengthy 38km gap between it and the top of Puerto de Larrau means the GC contenders are likely to wait until it to start attacking. And, after so much climbing already, both today and yesterday, it might just be the climb that pushes some of them past breaking point, and potentially turn the race on its head. </p>\n<h3>Contenders</h3>\n<p>After Jumbo-Visma's display of dominance to the top of the Tourmalet on Friday, it's difficult to know if they'll have the same impetus to control the race so completely from start to finish. It'll be up to the other riders around them in the GC to take the initiative if they want a stage win and to gain time, but right now it doesn't look like anyone can get close to them.</p>\n<p>In that light, and given the current state of the top of the GC, the breakaway may have a much better chance of staying clear, if Jumbo-Visma decide so.</p>\n<p>Ineos Grenadiers have no skin in the GC game, so they'll surely try and put the likes of <strong>Geraint Thomas</strong>, <strong>Jonathan Castroviejo</strong>, or <strong>Egan Bernal</strong> in the escape, the latter having impressed to hang on to the penultimate climb on stage 13.</p>\n<p><strong>Juanpe López</strong> (Lidl-Trek) went one climb further than Bernal and was dropped on the Tourmalet and sits far enough down on GC that he could be allowed to get in a break.</p>\n<p><strong>Michael Storer</strong> (Groupama-FDJ) looks in good nick having tried to aid Lenny Martinez to a high GC finish. With the Frenchman now out of the top 10, the Aussie climber could be allowed a bit more leeway in chasing stage wins.</p>\n<p>Storer's compatriot <strong>Chris Hamilton</strong> has already recorded a third place on a summit finish at this Vuelta, and along with <strong>Romain Bardet</strong> he offers DSM-Firmenich a good prospect of a top result in the mountains.</p>\n<p><strong>Wout Poels</strong> (Bahrain-Victorious) can go well on a stage like this (as he showed at the Tour de France this year), and could be the most likely member of Bahrain-Victorious, along with <strong>Damiano Caruso</strong>, to be able to deliver a stage win from the break.</p>\n<p><strong>Remco Evenepoel</strong> (Soudal-Quick-Step) is of course now completely out of the GC picture and, should he continue in the race, would be an exceptionally strong candidate to win any stage if he gets in a break. His team now also have <strong>James Knox</strong>, <strong>Pieter Serry</strong>, <strong>Louis Vervaecke</strong>, and <strong>Jan Hirt</strong>, as options to put into breaks on mountain stages.</p>\n<p>Of course there's always that nagging feeling that a winner will emerge from the Jumbo-Visma triumvirate and if we were to pick, we'd say <strong>Primož Roglič</strong> would be best suited to the finish. </p>\n<h3>Prediction</h3>\n<p>We think there's every chance Jumbo-Visma will continue to stamp their authority on this race, and Primož Roglič will win the stage.</p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4cc661933bdc49716aad1490ba4387f5ff88ed54a701d19b7a5b6171ab2d112c","category":"Cycling"}