{"title":"Molecular phylogenetic analysis of the East Asian hemicultrine fishes (Teleostei: Cyprinidae: Xenocypridinae), with suggestions to their generic classification and redescription of the recently described species Hemiculter yungaoi Vasil'eva et al. 2022","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15776?af=R","date":1715072034000,"content":"<h2>Abstract</h2>\n<p>The hemicultrine fishes are a group of small-sized cyprinids, widely distributed but endemic to East Asian rivers and lakes. Till now, the taxonomic boundaries and relationships within this group remain poorly explored. In the present study, we study the phylogeny of this group, providing suggestions for classification of the hemicultrine group. Using two mitochondrial and three nuclear genes, and samples representing all genera, our results showed that the group consists of seven major lineages, of which four (<i>Hemiculterella</i>, <i>Hainania</i>, <i>Pseudolaubuca</i>, and <i>Anabarilius</i>) were monophyletic and three (<i>Hemiculter</i>, <i>Toxabramis</i>, and <i>Pseudohemiculter</i>) were not. Based on the phylogenetic tree, we redefined the genera. We revive the genus <i>Siniichthys</i>, which has three species, <i>Siniichthys bleekeri</i>, <i>Siniichthys lucidus</i>, and <i>S. varpachovskii</i>, that were previously treated as members of the genus <i>Hemiculter</i> but showed distant relationships to the genus <i>Hemiculter</i> in our phylogenetic tree. With the new results, a diagnostic key for clades of the hemicultrine group is provided. Furthermore, we provide more detailed information on diagnostic features of the recently described species <i>Hemiculter yungaoi</i> (Vasil'eva et al., 2022). This work will facilitate future systematic studies, pave the way for evolutionary studies, and provide valuable information for the urgent conservation of hemicultrine fishes.</p>","author":"Qiaoling Deng, \nMingzheng Li, \nDan Yu, \nLin Chen, \nWenjing Li, \nXingwei Cai, \nHuanzhang Liu","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"4cca62573848b8786efa5c73a589a1d1053f4ecaf6a0b04c9114dcf3f44c3930","category":"Environment"}