{"title":"Environmental technology and firm performance: The role of digital financial inclusion, information and communication technology, and education","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12545?af=R","date":1723086507000,"content":"<h2>Abstract</h2>\n<p>This research aims to determine how environmental technology (ET), digital financial inclusion (DFI), information and communication technology (ICT), and education affect a firm's performance in China from 1998 to 2020. We have employed the quantile autoregressive distributed lag model to estimate the variables' short- and long-term relationship across various quantiles. In the context of non-state-owned enterprises (NSOE), the estimates of ET are positively significant in almost half of the quantiles in the long run, while in the short run, the estimates are insignificant. In the NSOE model, the DFI estimates are significant and positive at the highest quantiles only in the long run and almost at all quantiles in the short run. Likewise, the estimates of ET are positively significant in half quantiles in the long run and insignificant in the short run in terms of state-owned enterprises (SOE). In the SOE model, the DFI estimates are significant and positive at the highest quantiles only in the long run and at medium and highest quantiles in the short run. ICT and educational development have a favorable impact on a firm's performance across all quantiles in the long run in SOE and NSOE models. However, in the short run, these variables have a favorable impact only at higher quantiles in SOE and NSOE. These findings imply that more ET, DFI, ICT, and education are crucial for improving the performance of state-owned and non-state-owned firms.</p>","author":"Fei Pang, \nIlhan Ozturk, \nSidra Sohail","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"4ccd029ac3b7a62578f44341cc5998be8388bf9e97e7391a6fba323dd0d5d522","category":"Environment"}