{"title":"Use of Cryopreserved Sperm of Grass Carp (Ctenopharyngodon idella) for Seed Production at the Hatchery Level of Bangladesh—A Need for Development of Germplasm Repositories","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/9655558?af=R","date":1727783315000,"content":"<p>Grass carp (<i>Ctenopharyngodon idella</i>), a freshwater nonnative fish species, is a potential aquaculture candidate in Bangladesh. The seed of the species is produced in the hatcheries by hypophysation, but the quality of seedstock of grass carp is deteriorated due to inbreeding, negative selection, and interspecific introgression among fishes. To increase the availability of quality seed and best genetic traits of grass carp, this study dealt with finding suitable conditions of sperm cryopreservation protocols and evaluated the effectiveness of cryopreserved sperm through breeding trials of <i>C. idella</i>. A broodstock population was developed from fingerlings imported from China by the Bangladesh Department of Fisheries. Sperm was collected from hormone-induced mature males, with an estimated concentration of 2.4 ± 0.3× 10<sup>10</sup> cells/mL and a pH of 8.3 ± 0.2. Sperm motility was evaluated in different concentrations of NaCl solution. The highest motility (96% ± 1%) and longest motility duration (22 ± 1 min) were achieved at 0.4% of NaCl (128 mOsmol/kg). The toxicity of DMSO and methanol at concentrations of 5%, 10%, and 15% was evaluated for 5–40 min using Alsever’s solution and egg yolk citrate. The highest motility was achieved during 5 and 10 min of incubation with cryoprotectants at 5% and 10%. Alsever’s solution with 10% DMSO at 1:9 dilution with sperm produced the highest equilibration motility (93% ± 2%) and when cooled at 10°C/min yielded the highest postthaw motility (85% ± 3%). Fertilization of 24% ± 3% to 51% ± 2% and hatching of 18% ± 2% to 41% ± 2% were achieved by using cryopreserved sperm in six selected private hatcheries. The fertilization rate for fresh sperm sourced from hatchery-reared males was 64% ± 5% to 85% ± 3%, and the hatching rate ranged from 53% ± 6% to 74% ± 5%. Thus, the cryopreservation protocol of <i>C. idella</i> sperm was found to be feasible for fry production at commercial hatcheries, but further research is needed to improve the fertilization and hatching rates.</p>","author":"Shajjad Hossian, \nMd. Faijan Reza, \nMohammad Matiur Rahman, \n Mariom, \nMohammed Jahangir Alam, \nMd. Abdur Razzak, \nMd. Fazlul Awal Mollah, \nTerrence R. Tiersch, \nMd. Rafiqul Islam Sarder, \nUmit Acar","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"4ccfcccf45d012485995381ee5faf5ee2dfefcd82286d8b2501008f509834768","category":"Environment"}