{"title":"Can Pikmin Bloom recapture the magic of Pokémon Go?","link":"https://arstechnica.com/?p=1808045","date":1635359847000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Walk-to-make-flowers-bloom_1-800x1719.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Walk-to-make-flowers-bloom_1.jpg\">Enlarge</a> <span>/</span> ...and you'll neeeeeveeeeerrrr waaaaaaalk allooooooooooone. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The first and last time Nintendo collaborated with location-based AR company Niantic, the result was <a href=\"https://arstechnica.com/series/pokemon-go/\">the worldwide mega-phenomenon <em>Pokémon Go</em></a>. Five years later, the companies are working together once again to see if they can recapture the magic with a new augmented reality game based on the much more niche <em>Pikmin</em> franchise.</p>\n<p>After testing an early version of the <em>Pikmin Bloom</em> app over the last week, I can say that the game serves as an effective, super-cute pedometer, providing some nice, gentle motivation for reluctant walkers to get up and get their daily steps in. But while this gamified Fitbit requires less fuss and direct hassle than <em>Pokémon Go</em>, the game's basic \"watch the numbers go up\" loops also don't have the same compulsive collect-them-all appeal as Niantic's previous hit.</p>\n<h2>Watching numbers go up</h2>\n<p><br />\nFor the uninitiated, <a href=\"https://arstechnica.com/gaming/2013/08/pikmin-3-review-like-herding-pikmin-shaped-cats/\">Pikmin</a> are tiny, colorful, slightly humanoid creatures with blooming flowers on their heads. In the original console games, your character grows and manages an expanding team of Pikmin with varying abilities to help a marooned spaceman escape a planet. In <em>Bloom</em>, the Pikmin who follow you on your daily walks are more concerned with planting petals and growing normal flowers, which show up permanently on the game's map.</p></div><p><a href=\"https://arstechnica.com/?p=1808045#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1808045&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4cd23123f536458f6018e20748b9d429e5eb1abb2168dac6950a477b2314adf4","category":"Tech"}