{"title":"Convergent photophysiology and prokaryotic assemblage structure in epilithic cyanobacterial tufts and algal turf communities","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13424?af=R","date":1705670080000,"content":"<h2>Abstract</h2>\n<p>As global change spurs shifts in benthic community composition on coral reefs globally, a better understanding of the defining taxonomic and functional features that differentiate proliferating benthic taxa is needed to predict functional trajectories of reef degradation better. This is especially critical for algal groups, which feature dramatically on changing reefs. Limited attention has been given to characterizing the features that differentiate tufting epilithic cyanobacterial communities from ubiquitous turf algal assemblages. Here, we integrated an in situ assessment of photosynthetic yield with metabarcoding and shotgun metagenomic sequencing to explore photophysiology and prokaryotic assemblage structure within epilithic tufting benthic cyanobacterial communities and epilithic algal turf communities. Significant differences were not detected in the average quantum yield. However, variability in yield was significantly higher in cyanobacterial tufts. Neither prokaryotic assemblage diversity nor structure significantly differed between these functional groups. The sampled cyanobacterial tufts, predominantly built by <i>Okeania</i> sp., were co-dominated by members of the Proteobacteria, Firmicutes, and Bacteroidota, as were turf algal communities. Few detected ASVs were significantly differentially abundant between functional groups and consisted exclusively of taxa belonging to the phyla Proteobacteria and Firmicutes. Assessment of the distribution of recovered cyanobacterial amplicons demonstrated that alongside sample-specific cyanobacterial diversification, the dominant cyanobacterial members were conserved across tufting cyanobacterial and turf algal communities. Overall, these data suggest a convergence in taxonomic identity and mean photosynthetic potential between tufting epilithic cyanobacterial communities and algal turf communities, with numerous implications for consumer-resource dynamics on future reefs and trajectories of reef functional ecology.</p>","author":"Ethan C. Cissell, \nSophie J. McCoy","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"4cdb985b68112166fa16886b061328d7b90fd58b56d4774534ba1ae515125332","category":"Environment"}