{"title":"Hand contamination and hand hygiene knowledge and practices among commercial transport users after the SARS-CoV-2 virus (COVID-19) scare, Enugu State, Nigeria","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002627","date":1717164000000,"content":"<p>by Ifeanyi O. Aguzie, Ahaoma M. Obioha, Chisom E. Unachukwu, Onyekachi J. Okpasuo, Toochukwu J. Anunobi, Kenneth O. Ugwu, Patience O. Ubachukwu, Uju M. E. Dibua</p>\r\n\r\nContaminated hands are one of the most common modes of microorganism transmission that are responsible for many associated infections in healthcare, food industries, and public places such as transportation parks. Public health approaches during COVID-19 pandemic have shown that hand hygiene practices and associated knowledge are critical measure to control the spread of infectious agent. Hence, assessment of commercial transport users’ knowledge, belief and practices on hand hygiene, and potential contamination with infectious agents which is the aim of the study, aligns with general health concern of quantifying contamination risk levels to predict disease outbreaks. This study utilized a randomized sampling approach to select 10 frequently used commercial parks within two districts in the State: Enugu and Nsukka. The parameters analysed include a cross-sectional questionnaire survey, hand swab and hand washed samples collected from dominant hand of participants. A total of 600 participants responded to the questionnaire survey, while 100 participants’ hand swabs were examined for microbial contamination. This study recorded a high prevalence of fungal (90.0%) and bacterial (87.0%) species; 20 species of fungus were identified with prevalence range of 1% to 14%; 21 bacterial species were isolated with prevalence range of 1% to 16%. These species were identified as either opportunistic, non-invasive, or pathogenic, which may constitute a health concern amongst immunocompromised individuals within the population. <i>Aspergillus</i> spp. (14%), was the most common fungal species that was exclusively found amongst Nsukka commercial users, while <i>E</i>. <i>coli</i> was the most prevalent isolated bacterial species amongst Nsukka (12%) and Enugu (20%) commercial park users. Prevalence of fungal contamination in Nsukka (94.0%; 47/50) and Enugu (86.0%; 43/50) were both high. Prevalence of bacterial contamination was higher in Enugu than Nsukka but not significantly (47[94.0%] vs. 40[80.0%], p = 0.583). A greater number of participants (99.3%) were aware of the importance of hand hygiene, however with low compliance rate aside “after using the toilet” (80%) and “before eating” (90%), other relevant hand washing and sanitizing practices were considered less important. With these observations, we can emphatically say that despite the COVID-19 scare, commercial park users within the sampled population do not efficiently practice quality hand wash and hygiene measures, hence, risking the widespread of infectious agents in situation of disease outbreak or among immunocompromised individuals.","author":"Ifeanyi O. Aguzie","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"4ce36d874ca8c5fc7868f4fe2c7bad4b01b44c66f697bbebe949ebafda011563","category":"Environment"}