{"title":"Sea cucumber, Neostichopus grammatus, density and tank cleaning frequency affect abalone, Haliotis midae, growth in integrated multitrophic aquaculture","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13111?af=R","date":1728888493000,"content":"<h2>Abstract</h2>\n<p>The integrated multitrophic aquaculture (IMTA) of sea cucumber and abalone has been proposed as a potential bioremediation tool that stimulates increased abalone growth. This study assessed the role of sea cucumber stocking density and frequency of tank cleaning in IMTA on growth, water, and sludge bioremediation. The study was conducted for 16 weeks and was made of four treatments and four replicates; abalone cocultured with sea cucumber (low density—27: 1 g [abalone (ab): sea cucumber (sc)]) with tanks cleaned once a week (L1); abalone cocultured with sea cucumber (low density) with tanks cleaned twice a week (L2); abalone cocultured with sea cucumber (high density—15:1 g [ab:sc]) with tanks cleaned once a week (H1) and abalone cocultured with sea cucumber (high density) with tanks cleaned twice a week (H2). Rearing water nitrite was significantly lower (<i>p</i> = 0.001) at high stocking density of sea cucumbers, but sludge was unaffected. Tanks cleaned once weekly had higher sludge organic matter (<i>p</i> = 0.015) and sludge sulfur content (<i>p</i> = 0.020) and lower sludge carbon (<i>p</i> = 0.003) and nitrogen content (<i>p</i> = 0.049). At the end of the experiment, the stocking density of sea cucumber and frequency of tank cleaning affected abalone mean weight [<i>p</i> = 0.047; <i>p</i> = 0.011, respectively] without a significant interaction (<i>p</i> = 0.517). Abalone in H1 had a higher mean weight and shell length than abalone in L2 and H2 but was similar to those in L1. The stocking density and frequency of cleaning used in this study had no effect on the growth of sea cucumbers [<i>p</i> = 0.150; <i>p</i> = 0.470, respectively]. This study has shown that in an abalone–sea cucumber IMTA system, the stocking density of sea cucumber and the frequency at which tanks are cleaned influence abalone growth and bioremediation of the rearing water. Our result suggests H1 as the best density (ab:sc) and cleaning frequency. The tank cleaning frequency alone affects the tank sludge quality; tanks need not be washed too frequently as, in addition to causing animal stress, cleaning markedly increased carbon and nitrogen level of tank sludge. Both these effects are likely to negatively impact abalone growth.</p>","author":"Abigail John Onomu, \nMatthew James Slater, \nNiall Gordon Vine","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"4ce607e5397cb03acfb5ac0eb92b1a8f28db5f7eb07533103d2aa009020d7565","category":"Environment"}