{"title":"Starfield reveal: Coming November 11, 2022, exclusively to PC, Xbox Series X/S","link":"https://arstechnica.com/?p=1772824","date":1623603248000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/Screenshot-5782-980x551.png\" /></div>\n        <p>\n          \"Launch sequence initiated.\" <em>Starfield</em>'s release date has been confirmed.                  </p>\n        </div>\n      </li>\n      </ul><p>Half an hour before Sunday's Xbox and Bethesda game-reveal event, one major announcement found its way out of the bag: the cinematic reveal for the upcoming space-exploration adventure game <em>Starfield</em>.</p>\n<p>\"Cinematic\" should be in scare quotes, because Bethesda Game Studios has advertised that this trailer, as released by <a href=\"https://www.washingtonpost.com/video/sports/launcher/trailer-starfield/2021/06/13/6dc44dc4-fbc4-4073-b99e-88593e4127aa_video.html\">the Washington Post</a> ahead of schedule, runs on its brand-new Creation Engine 2 and is \"in-game alpha footage.\" Content rendered inside a game engine isn't necessarily the same as live gameplay. Plus, this trailer mostly consists of slow pans over a single planet's exterior and the inside of our apparent hero's spaceship, set to blast off.</p>\n<p>Still, what we're seeing looks less like an artificially sweetened trailer full of rapid camera pans and detailed zooms on faces (cough, cough, <em>Halo Infinite</em>'s earliest trailer) and more like a true look at Bethesda Game Studios' first bonafide adventure since 2015's <a href=\"https://arstechnica.com/gaming/2015/11/fallout-4-review-check-your-next-gen-expectations-at-the-vault-door/\"><em>Fallout 4</em></a>. Its emphasis on curved surface reflections, vast view distances, geometrically intense rocky plains, and at least one highly detailed human face imply a demanding game—which explains why the trailer ends with confirmation that this is an Xbox Series X/S and PC game, not base Xbox One. (And, tellingly, not any PlayStation consoles—a post-acquisition reality for Bethesda and Xbox that the deal's players have loudly hinted to in recent months.)</p></div><p><a href=\"https://arstechnica.com/?p=1772824#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1772824&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4cebe7b0f3c587328ec24ae05bc4a4262b6c5ebbeae8bbde4375afcf61f30c9d","category":"Tech"}