{"title":"Determinants of comprehensive knowledge of HIV transmission and prevention among women of reproductive age 15–49 years in Nigeria","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003450","date":1722348000000,"content":"<p>by Charles Nzelu, Uche Nzelu, Amara Uche Ugwunze, Ngozi Azodoh</p>\r\n\r\nComprehensive knowledge of HIV transmission and prevention has been reported as a necessary factor for ending the HIV epidemic. Women of reproductive age identified as a vulnerable group to HIV infection require this knowledge to prevent contracting HIV infection. Therefore, this study aimed to identify those factors that impact these women’s comprehensive knowledge of HIV transmission and prevention. This study used secondary data from the 2018 Nigerian Demographic and Health Survey. A weighted sample of women of reproductive age with complete data on the determinants and comprehensive knowledge of HIV was included in each analysis. The Chi-square test of Independence was used to determine the association between the determinants and the dependent variable. Bivariable and multivariable logistic regression analysis was done to predict the effects of the determinants on the comprehensive knowledge of women of reproductive age. Variables with a p-value of ≤ .01 were considered statistically significant determinants of comprehensive knowledge of HIV transmission and prevention. The findings showed that women of reproductive age with no or lower level of education, living in rural areas, poor wealth index, do not listen or listen less frequently to radio, and watch television less frequently were more likely to have comprehensive knowledge of HIV transmission and prevention at Alpha = .01. The number of women with comprehensive knowledge of HIV was low compared with those with no comprehensive knowledge. This is a concern that needs to be addressed. Further studies using primary data to validate the findings of this study that individuals with no or lower level of education, living in rural areas, poorer or middle wealth index, do not listen or listen less frequently to radio and do not watch or watch less frequently television were more likely to have comprehensive knowledge of HIV transmission and prevention are recommended.","author":"Charles Nzelu","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"4cf22b335f4570c055e8b8b2592e87b7d66553517955bcea36df8be7d34e8757","category":"Environment"}