{"title":"US military leans into megaconstellations after their “resiliency” in Ukraine","link":"https://arstechnica.com/?p=1955030","date":1689789339000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-1239026530-800x534.jpg\" alt=\"Commander of US Space Command General James Dickinson testifies during a Senate Armed Services Committee hearing March 8, 2022, in Washington, DC.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-1239026530.jpg\">Enlarge</a> <span>/</span> Commander of US Space Command General James Dickinson testifies during a Senate Armed Services Committee hearing March 8, 2022, in Washington, DC. (credit: Drew Angerer/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The leader of the United States Space Command, an Army general named James H. Dickinson, said Wednesday that megaconstellations such as SpaceX's Starlink network have played an important role in Ukraine's efforts to deter an invasion by Russia.</p>\n<p>\"We are seeing for the first time what a megaconstellation means to the world,\" Dickinson said. \"That provides such resiliency and redundancy in terms of maintaining satellite communications in this example. That is powerful, and the department is moving in that direction.\"</p>\n<p>Dickinson made his remarks <a href=\"https://www.youtube.com/watch?v=Zszjr9ZwDE4\">at the Aspen Security Forum</a>. As leader of the Space Command, Dickinson is responsible for the command and control of all US military forces in outer space. He said Starlink had facilitated communications among Ukraine's armed forces and that other commercial companies had provided essential observation services through means such as synthetic aperture radar, which can observe at night and through clouds.</p></div><p><a href=\"https://arstechnica.com/?p=1955030#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1955030&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4cf770394022633c2ac4024116677e77cb45bc996ef519124b26b2e4c38d8714","category":"Tech"}