{"title":"Refreshed iPads might be arriving today. Or a new Apple Pencil. Or nothing","link":"https://www.macworld.com/article/2107278/new-ipads-october-2023-spec-bump-conflicting-reports.html","date":1697541129000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>On two things pundits agree: New iPads are on the way and Apple is unlikely to announce them at a dedicated press event. Beyond that, however, we have serious disagreements.</p>\n\n\n\n<p>“Sources familiar with Apple’s media plans” (as reported by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://superchargednews.com/2023/10/14/apple-launching-new-ipads-this-week/&amp;xcust=1-1-2107278-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Supercharged</a>) claim that Apple will announce a raft of new iPad models this week. Those sources say Tuesday, October 17 is the most likely date for the unveiling, and that the <a href=\"https://www.macworld.com/article/1998359/next-gen-ipad-air-in-works-launch-schedule-mystery.html\">iPad Air</a>, <a href=\"https://www.macworld.com/article/678361/ipad-mini-7-specs-design-processor-release.html\">iPad mini</a>, and <a href=\"https://www.macworld.com/article/1371039/ipad-10th-generation-review.html\">10th-gen iPad</a> are all in line for a refresh: “The updates will feature minor spec bumps, bringing the models in line with faster and more efficient chips,” the site predicts, rather pessimistically. “The iPad Air will gain the M2 chip, an upgrade from the current M1 chip, while the upcoming iPad mini will feature the A16 Bionic chip.”</p>\n\n\n\n<p>On Monday, leaker Majin Bu on X (formerly Twitter) also claimed that Apple will launch the 11th-gen iPad on Tuesday with new colors. </p>\n\n\n\n<figure><div>\n<blockquote><p>the new 11 gen 10.9 inch iPad that Apple will present tomorrow will have the exact same design as the 10 gen model, furthermore the accessories will be perfectly compatible <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/UPd7SWq6gY&amp;xcust=1-1-2107278-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/UPd7SWq6gY</a></p>— Majin Bu (@MajinBuOfficial) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/MajinBuOfficial/status/1714024008767680536?ref_src=twsrc%5Etfw&amp;xcust=1-1-2107278-1-0-0&amp;sref=https://www.macworld.com/feed\">October 16, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>This all makes sense. The mini is certainly due for an update, given that the last (6th-gen) model arrived more than two years ago, and the 5th-gen iPad Air from March 2022 is more than 18 months old. The 10th-gen standard iPad came out just a year ago, but Apple’s entry-level device habitually gets annual updates, while the <a href=\"https://www.macworld.com/article/1835319/14-inch-ipad-pro-release-specs-features-price.html\">iPad Pros</a>, which were also updated last fall, tend to follow a longer cycle.</p>\n\n\n\n<p>Another source, however, begs to differ. In the latest edition of his <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-10-15/apple-october-2023-executive-promotions-new-vps-of-retail-software-operations-lnrh4t94&amp;xcust=1-1-2107278-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On newsletter</a>, Bloomberg leaker-Mark Gurman insists that new iPads will not appear this month. He doesn’t offer much more detail, other than to concede that new versions of the three models mentioned above <em>are</em> in development (with the update focusing on “faster chips”), so it’s possible that they could yet appear before Christmas. Particularly since Gurman mentions, by way of contrast, that the iPad Pro update won’t happen until 2024.</p>\n\n\n\n<p>Reports have also claimed that Apple is preparing to launch a new <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macotakara.jp/rumor/entry-45469.html&amp;xcust=1-1-2107278-1-0-0&amp;sref=https://www.macworld.com/feed\">3rd-gen Apple Pencil</a> with magnetic tips. It’s not clear whether the new device would be compatible with the 11th-gen iPad, which inexplicably is only compatible with the 1st-gen Apple Pencil and <a href=\"https://www.macworld.com/article/1367043/usb-c-lightning-apple-pencil-dongle-design-waste-upsell.html\">requires a dongle</a>.</p>\n\n\n\n<p>Whichever of these new devices release, however, the announcement seems unlikely to be a blockbuster. Our bickering sources, after all, agree that these will be minor, iterative updates, with no mention of the kind of flagship new features about which Apple loves to build an event. (Fixing jelly scrolling on the iPad mini, as Supercharged mentions, really doesn’t count.) And the latter site explicitly predicts that “the announcements will take place on Apple’s website and its YouTube channel and will not include a flashy hybrid event for significant product announcements.”</p>\n\n\n\n<p>This year has been a slow one for Apple events, with just two so far; Apple often holds a spring event, but didn’t bother in 2023, and often holds multiple fall events (it had as many as three in September, October and November 2020) but again has limited itself to just the one. The signs suggest 2023 may end up featuring just two Apple events, and the last time Apple was so reticent with the public was in 2017.</p>\n\n\n\n<ul>\n<li>2023: 2 Apple events (and counting)</li>\n\n\n\n<li>2022: 3</li>\n\n\n\n<li>2021: 4</li>\n\n\n\n<li>2020: 4</li>\n\n\n\n<li>2019: 3</li>\n\n\n\n<li>2018: 4</li>\n\n\n\n<li>2017: 2</li>\n\n\n\n<li>2016: 4</li>\n</ul>\n\n\n\n<p>Whether the shortage of events reflects a wider conservatism and lack of risk-taking is debatable; in fact, it’s probably more to do with the amount of development and marketing resource being directed towards <a href=\"https://www.macworld.com/article/1944516/apple-vision-pro-hands-on-feaures-design-fit.html\">Apple Vision Pro</a>, which doesn’t launch until 2024. But it’s certainly feeling like this will go down as one of the quieter years in Apple’s history.</p>\n\niPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4cf84cc717198bb31f5a1a805bd0739c5c72ffde963dce9b6eab1b2cae8bb664","category":"Apple"}