{"title":"How I saved $200 on an M3 Max MacBook Pro at the Apple Store","link":"https://www.macworld.com/article/2160989/apple-store-price-match-m3-max-macbook-pro-200-off.html","date":1701692100000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you read my article from a couple of weeks ago, you know that I bought an M3 Pro MacBook Pro, <a href=\"https://www.macworld.com/article/2126699/m3-pro-max-macbook-pro-performance-cores-memory.html\">returned it</a>, and bought an M3 Max model instead. Two weeks ago the laptop finally arrived and I absolutely love it. And after saving an extra $200 at the Apple Store, I love it even more.</p>\n\n\n\n<p>That’s right: I saved actual money at the Apple Store. Thanks to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://x.com/DSCCRoss/status/1730826561874719089?s=20&amp;xcust=1-1-2160989-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">a post on X by Ross Young</a> of Display Supply Chain Consultants, I learned Saturday night that Apple has a little-publicized price-matching policy—so little publicized that I couldn’t find a mention of it anywhere on Apple’s site or in its <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/legal/sales-support/sales-policies/retail_us.html&amp;xcust=1-1-2160989-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Retail Store Purchase Policies</a>. But it does exist, even if you bought your new MacBook Pro a month ago.</p>\n\n\n\n<p>Technically, you have two weeks from the date you received your device, and I received mine exactly two weeks ago today.  So yesterday morning, I found a site (<a href=\"https://www.bhphotovideo.com/c/product/1793626-REG/apple_mrx53ll_a_14_macbook_pro_max.html?BI=21883&amp;KBID=28249&amp;SID=1-1-2160989-1-0-0\" target=\"_blank\">B&amp;H Photo</a>) that was selling my exact MacBook Pro for $2,999, $200 less than the MSRP, and I gave Apple a call.</p>\n\n\n\n<p>I expected pushback, maybe confusion, and at the very least difficulty, but the sales representative who took my call was nothing but helpful. When I told her I was looking to get a price match, she checked my order to make sure I was still within the two-week return window, confirmed B&amp;H Photo was an authorized Apple reseller (which took a minute because she didn’t initially see the store on her list, but she eventually found it after some back-and-forth), and verified the price and specs. After everything checked out, she refunded me $200.</p>\n\n\n\n<p>It was that simple. Apple will match any price from an authorized reseller up to 10 percent of the MSRP, so some iPad and AirPods price matches will be capped. For example, Apple sells the AirPods Pro for $249, so the most you’ll get back on a price match is $24.90; you’ll most certainly be able to <a href=\"https://www.macworld.com/article/673507/best-airpods-deals.html\">get them cheaper</a> at Amazon or Best Buy. The same goes for an iPad Air or iPad mini.</p>\n\n\n\n<p>But for large-ticket items like the MacBook Pro, iMac, and Mac Studio, you could save hundreds at the Apple Store—in actual money, not gift cards.</p>\n\nApple Inc, MacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4d038e8340127acc1ba59601d435a4ccfd2ed6b8c7f65d877a3baf9bc56fefb8","category":"Apple"}