{"title":"The effect of surfactant on biosolubilization of weathered coal","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14378?af=R","date":1708742427000,"content":"<h2>Abstract</h2>\n<p>Weathered coal is a type of coal with barren utility value, which is exposed on the surface for a prolonged time or shallowly buried in coal seams, and the physicochemical properties of weathered coal have changed compared with high-quality coal. China is also a country with large reserves of weathered coal, therefore, the value utilization of weathered coal has received tremendous scientific attention. Herein, the main purpose is to explore the combined effect of surfactants and microorganisms on bioconversion of weathered coal to produce humic substances. Tween-80, <i>Phanaerochaete chrysosporium</i> (J1) and <i>Trametes versicolor</i> (J2) were selected as surfactants and engineering strains to convert weathered coal. 3D fluorescence spectra were used to analyze the species and contents of humic acids during the biosolubilization process of weathered coal. Results revealed that both J1 and J2 exhibited good performance on weathered coal biosolubilization (increasing 10% and 14% compared to the control, respectively). The intensity of weathered coal biosolubilization was significantly increased by 15% and 12% when J1 and J2 were applied in combination with Tween-80. And the addition of Tween-80 also distinctly reduced the molecular weight of humic substances. In summary, surfactant plays an important role in bioconversion of weathered coal, while molecular weight of humic substances was different that weathered coal biosolubilization under the co-action of J1 and Tween-80 increased and J2 with Tween-80 was opposite. In short, this project might provide a new strategy for exploring the biodegradation of weathered coal.</p>","author":"Qian Tong, \nYu Wang, \nXinping Mao, \nChuanyu Wan, \nMiao Wen, \nFengpeng Han","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"4d052b15576a7de7912656f876ba542f93f64754a21e2a3679b584986535c3ee","category":"Environment"}