{"title":"“Smoke archaeology” reveals early humans were visiting Nerja Caves 41,000 years ago","link":"https://arstechnica.com/?p=1937907","date":1683736879000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/caveTOP-800x560.jpg\" alt=\"María Medina of the University of Cordoba working in the Navarro Cave, Malaga, Spain\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/caveTOP.jpg\">Enlarge</a> <span>/</span> María Medina of the University of Cordoba working in the Navarro Cave, Malaga, Spain. (credit: University of Cordoba)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>For over a decade, Maria Medina, an archaeologist affiliated with the University of Cordoba, has been conducting research on what she terms \"smoke archaeology\": trying to reconstruct Europe's prehistoric past by analyzing the remnants of torches, fire, and smoke in French and Spanish caves. Her latest discovery is that humans regularly visited the <a href=\"https://en.wikipedia.org/wiki/Caves_of_Nerja\">Caves of Nerja</a> as far back as 41,000 years ago, a good 10,000 years earlier than previously believed, according to a <a href=\"https://doi.org/10.1038/s41598-023-32544-1\">recent paper</a> published in the journal Scientific Reports. </p>\n<p>As we've <a href=\"https://arstechnica.com/science/2021/06/archaeologists-recreated-three-common-kinds-of-paleolithic-cave-lighting/\">reported previously</a>, there are nearly 350 prehistoric caves in France and Spain alone. They include the oldest cave painting yet known: a red hand stencil in Maltravieso Cave in Caceres, Spain, likely drawn by a Neanderthal some 64,000 years ago. The <a href=\"https://en.wikipedia.org/wiki/Caves_of_Nerja\">Caves of Nerja</a> are located in Malaga, Spain, and boast paintings believed to date back 42,000 years.</p>\n<p>The caves were discovered in 1959 by five friends who gained access via a narrow sinkhole dubbed \"La Mina\"—one of two natural entrances, with a third created the following year to enable better access for tourists.</p></div><p><a href=\"https://arstechnica.com/?p=1937907#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1937907&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4d05f6352c84cd699e0ee5536c8a5998fcf76d808ceca045fcdb0b7b064ed443","category":"Tech"}