{"title":"241 Impact of benzoic acid supplementation in low-protein diets for starter pigs","link":"https://academic.oup.com/jas/article/102/Supplement_3/233/7757409?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Utilizing low crude protein (CP) diets represents a potential avenue for reducing both feed costs and nitrogen excretion in swine production. However, dietary non-essential amino acid content must be considered in addition to essential amino acid content in the context of low CP diet formulations. Dietary glycine content may become limiting in such diets because this glycine in corn and soybean meal is low relative to glycine utilization in the pig. The objective of this study was to evaluate the effect of adding benzoic acid, which is excreted in urine as its glycine conjugate hippuric acid, to low CP diets on growth performance of starter pigs. At 28 d age, pigs were weaned and divided into nursery room pens according to body weight (BW) and sex 5 mixed-sex pigs per pen). Pigs were fed a commercial nursery diet for 4 d; at 32 d age, pigs were weighed, and pens were assigned to one of three dietary treatments: 1) high crude protein (HCP; n = 12 pens); 2) low crude protein (LCP; n = 11 pens) and 3) low crude protein + benzoic acid (LCP+BA; n = 12 pens). Pigs were fed for 4 wk and pig BW and feed disappearance were measured weekly to calculate average daily gain (ADG), average daily feed intake (ADFI), and feed efficiency (FE; gain-to-feed ratio). At d 0, 14 and 28, blood was collected from one pig/pen by jugular venipuncture. Serum was analyzed for amino acid concentrations with HPLC. The ADG of HCP group (0.58 ± 0.01 kg/d) was greater than LCP (0.54 ± 0.01 kg/d) and LCP+BA (0.51 ± 0.01 kg/d; <span>P</span> &lt; 0.05); ADG of LCP was also greater than LCP+BA (<span>P</span> &lt; 0.05). There was no difference in ADFI among groups (<span>P</span> &gt; 0.05). However, FE of LCP+BA was less than both HCP (0.536 vs 0.579 ± 0.006 kg/kg; <span>P</span> &lt; 0.05) and LCP (0.536 vs 0.576 ± 0.006 kg/kg; <span>P</span> &lt; 0.05); there was no difference in FE between HCP and LCP (<span>P</span> &gt; 0.10). Glycine concentration of LCP+BA (513 ± 32 µmol/L) was less than LCP (630 ± 32 µmol/L; <span>P</span> &lt; 0.05), whereas glycine concentration of HCP (578 ± 32 µmol/L) was intermediate. Lysine concentrations were least in HCP (105 ± 9 µmol/L), intermediate in LCP (138 ± 9 µmol/L), and greatest in LCP+BA (167 ± 9 µmol/L; <span>P</span> &lt; 0.01). The observed reduction in growth performance with benzoic acid exceeds that achieved by feeding low CP diets alone. Greater lysine concentrations in pigs supplemented benzoic acid suggests that lysine was used less efficiently for growth. These findings also caution against supplementing low CP diets with benzoic acid without supplementing additional protein.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4d17f0b002b27676729ace796620aba0548a30bc293ce07065833d9c2740bf10","category":"Environment"}