{"title":"‘I’m just excited to race my bike for a living’: Cat Ferguson interview","link":"https://www.cyclist.co.uk/in-depth/cat-ferguson-interview","date":1709054424000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/cat-ferguson-interview\">‘I’m just excited to race my bike for a living’: Cat Ferguson interview</a></p>\n\n<p>Cat Ferguson is one of Britain’s next generation of super talents, with big victories across road, cyclocross and track racing at junior level and a pro contract with Movistar starting in August this year. <em>Cyclist </em>caught up with her to discuss her past, present and future.</p>\n\n\n\n<p><strong>Congratulations on your silver in the Cyclocross World Championships – how do you feel the race went?</strong></p>\n\n\n\n<p>It definitely didn’t meet my goals, I would say. I went in there hoping to come away with a jersey, especially after the strong team relay [Great Britain came second]. My chances on the [Junior Women’s] course were quite strong so I was quite disappointed to be honest with silver. Although it’s still a medal at the Worlds, it just felt a little bit disappointing just because I was so close the whole race: racing in the front, I was controlling the race, I felt physically and technically strong. And just a couple of small mistakes in the last two minutes of the race meant there was effectively not enough course for me to close the gap down to Célia [Gery]. It was a strong race by her and maybe the deserving winner in the end.</p>\n\n\n\n<p><strong>What are your reflections on the cyclocross season as a whole?</strong></p>\n\n\n\n<p>I’d say almost a bit similar. I came in really hoping that I’d come away with the World Cup Series. I really targeted the Euros and Worlds and have come second in all of them to Célia. So maybe that shows she was the stronger rider the whole season, but in terms of the World Cup series I was so close on the final round to taking the win. Then I had a crash on the last banking of the race, which meant I couldn’t contest for the sprint, which would have meant I’d have won the whole series. I took second in that so it’s been a bit of a running theme this season, but I can still be pleased with it. </p>\n\n\n\n<p><strong>Does having those frustrating experiences spur you on even more?</strong></p>\n\n\n\n<p>Definitely. So far in my junior career I’ve come second at about six major championships, I’ve never won a jersey. So with each silver I’m getting almost more angry and frustrated and training harder for the next championship in the hope that I can finally come away with a jersey. </p>\n\n\n\n<p><strong>What do you feel has been your best performance overall?</strong></p>\n\n\n\n<p>The first World Cup round in Troyes, in France. Initially, I thought the course didn’t suit me because it had a little bit of running in it, and in the past I struggled a bit in running courses. But I managed to get over that in the race and came away with the win, which meant I led the World Cup Series from the first round, which was really cool. I’ve got to wear the leader’s skinsuit for the next two rounds, so that race and getting to wear the skinsuit was definitely my highlight. </p>\n\n\n\n<p><strong>How do you manage doing both road and track and still find the time for the cyclocross season as well?</strong></p>\n\n\n\n<p>It’s definitely a little bit difficult. I had four days off after the cross Worlds before going to Spain on a training camp to get ready for road season. It doesn’t give you much time to reflect and think back on races, which in this case I was happy about because I didn’t really want to think back to the Worlds and how close I was to that jersey. You have to just be organised and really plan ahead in terms of when you are going to rest, so because I’ve had such a short one after the cross season I’ll look to have another rest, maybe during my exam season because I’m in year 13. But balancing all three is definitely something I enjoy and I like being busy all the time so I’d like to continue with them.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/pro-log-lotte-kopecky-uae-tour\">Pro Log: Lotte Kopecky wins UAE Tour Women, Mads Pedersen dominates Tour de la Provence, Adrien Petit’s heart-warming act of respect and update on Taco van der Hoorn’s concussion</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/annemiek-van-vleuten-interview-2024\">‘I am happy with everything I achieved’: Annemiek van Vleuten profile</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/neil-lora-fachie-paracycling\">‘It’s challenging at times but that’s competitive sport’: Lora and Neil Fachie interview</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<figure><img width=\"970\" height=\"648\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-970x648.jpg\" alt=\"Cat Ferguson running her bike up a muddy hill\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-970x648.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-768x513.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-1536x1026.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-2048x1368.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-750x501.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-1140x761.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-cat-ferguson-cyclocross-worlds-2024-350x233.jpg 350w\" /><figcaption>DAVID PINTENS/BELGA MAG/AFP via Getty Images</figcaption></figure>\n\n\n\n<p><strong>What’s your favourite discipline to ride? Do you have a favourite?</strong></p>\n\n\n\n<p>I’d probably say road – it’s quite close between road and cross and then track is sort of trailing behind. I don’t really like track but you’ve got to do it for British Cycling!</p>\n\n\n\n<p><strong>Looking ahead to your senior career, do you plan to continue with all three or specialise?</strong></p>\n\n\n\n<p>I’d like to obviously continue with the road for the rest of my career. For cross and track, I want to do both of them but when and how much I’m still not sure about. I’d like to keep doing cross a bit each winter, maybe just during the Christmas period. Maybe in the future, I’d like to start doing track again. One of the biggest goals of mine, since I’ve been a little girl, is to go to the Olympics and there’s more races and opportunities on the track. So if that’s the way I get there, then I would definitely want to start track back up again. </p>\n\n\n\n<p><strong>What’s the atmosphere like in the British Cycling camp of up-and-coming riders?</strong></p>\n\n\n\n<p>I think it’s great what British Cycling have created. They’ve created a junior academy with the nine best junior girls in the UK and I’d say my closest friends are in that academy. Obviously it is competitive, we are competing at the end of the day for spots to go to the World Championships and Nations Cups and things like that, but we’re all almost like family, I spend so much time with them. And I think the competition is very healthy and it definitely spurs you on.</p>\n\n\n\n<p><strong>Can you tell me a bit about how you got into cycling? </strong></p>\n\n\n\n<p>My mum and dad – I’m an only child – are really sporty. They used to do running, climbing, mountain biking and every winter since I was about four we used to go skiing. I picked it up really quickly and became quite good at it. When I was maybe 10, I joined a giant dry ski slope club, and to aid training for that I joined a cycling club, but I just started to prefer cycling. I met some closer friends at that club and just really enjoyed the social aspect of it, then started doing it properly since lockdown. </p>\n\n\n\n<p><strong>So you kind of became a cyclist by accident?</strong></p>\n\n\n\n<p>A little bit. My mum and dad both are really into it. They’re out here in Spain on holiday now while I’m at training camp and both of them will be riding every day, not with me. They’re very active.</p>\n\n\n\n<p><strong>Do they live their own cycling dreams vicariously through you?</strong></p>\n\n\n\n<p>Yeah, I think so. They’re not pushy, but my dad is the owner of the team I ride for – Shibden-Hope Tech-Apex Team – which is a new junior team this year. </p>\n\n\n\n<p><strong>What’s it like having your dad as your sporting director?</strong></p>\n\n\n\n<p>I love it. I think it’s great to get first-hand advice on everything and he asks me and all the girls our opinions – it’s not a dictatorship in terms of the team. Credits to my dad really, which I don’t often say!</p>\n\n\n\n<p><strong>How do you find balancing the training and the racing, especially doing three disciplines, while also still being in school?</strong></p>\n\n\n\n<p>That’s definitely such a challenge. I maybe have a couple of regrets on choosing the A-Levels I do. I chose them to be a little bit easier than I would have chosen if I wasn’t cycling, but looking back, I sort of wish I’d chosen even easier options. I do business, psychology and sports science. When you’re not at school it’s obviously very difficult, but my school is really supportive. And I think the system since Covid lockdown of online school has definitely helped. </p>\n\n\n\n<p><strong>And how do you balance all of that with being a normal teenager? </strong></p>\n\n\n\n<p>It takes a lot of planning. I love planning my day, my week, months in advance almost. I think making sure you’ve got enough time for the training, enough time for your schoolwork, and then obviously enough time for yourself to just rest and relax, whether that’s meeting new friends or anything like that. I think it’s really important to find time to prioritise that because ultimately that is what keeps you happy and motivated to keep training and to keep doing schoolwork.</p>\n\n\n\n<p><strong>What do you do to unwind in between fitting all your work and training in?</strong></p>\n\n\n\n<p>I like going out with my friends and also, I wouldn’t call it cooking or baking, I call it concocting. Just throwing together healthy-ish riding snacks – I guess it is still related to cycling but I really enjoy doing that. And it also helps me if I look at the week, see what I’ve got coming up, I can adjust what I’m making for how difficult and intense the load is. I really enjoy the nutrition behind cycling as well.</p>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-970x647.jpg\" alt=\"2023 Junior Women's Road World Champs finish\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-1536x1024.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-2048x1365.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/02/GettyImages-CAT-FERGUSON-road-worlds-2023-350x233.jpg 350w\" /><figcaption>Dean Mouhtaropoulos/Getty Images</figcaption></figure>\n\n\n\n<p><strong>Tell us about your move to Movistar</strong>.</p>\n\n\n\n<p>It’s incredible. I don’t think I could really be in a better situation even if I dreamed of it. Some people may criticise me for signing this early but it takes so much pressure off this next year, I’m purely racing for fun, there’s no pressure on results, or anything like that. I don’t need to stress about getting a team, getting a contract, like some of my racing friends do. To have that security is just amazing and I couldn’t wish for a better team to be honest. I met them in a camp before the Benidorm World Cup, it was incredible to meet them all and put proper faces to names.</p>\n\n\n\n<p><strong>What do you hope to kind of gain from being around some of the best cyclists in the world? </strong></p>\n\n\n\n<p>I think it’s invaluable to be around experienced riders all the time. Even simple things like sitting at dinner and eating their meal with them, you do genuinely just pick up so much from them. I think it’s something that money can’t buy, being around people like that, and I’m incredibly grateful that they’ve given me this opportunity at such a young age.</p>\n\n\n\n<p><strong>Did you manage to spend any time with Annemiek van Vleuten before she retired?</strong></p>\n\n\n\n<p>No, sadly not. And she has been one of my idols for a long time. She left before I got there but hopefully she’ll come back and maybe do sort of some mentoring kind of role.</p>\n\n\n\n<p><strong>You mentioned getting some criticism online. Do you see any downsides to cycling teams signing very young riders on long contracts?</strong></p>\n\n\n\n<p>Yeah, I can completely see where some of them are coming from. They’re ultimately mainly just a little bit concerned about me and thinking, maybe I’ve not put enough thought into signing this early, but for me it felt so right that there was no doubt in my mind that I wouldn’t do it. Regarding teams signing riders so young, I’ve got an agent and without him I think I maybe wouldn’t have been so comfortable to make the move to sign three years at this age. He sort of gave me the reassurance that it was right and it isn’t too early so long as I’m happy with it.</p>\n\n\n\n<p><strong>How much do you engage with social media?</strong></p>\n\n\n\n<p>I really like social media. I think it’s really useful to advertise yourself in other ways than just racing and things like that. It’s great to get your own personality out there so I think it’s important that you do engage with it. I’d say I don’t use Twitter too much, mainly Instagram. I don’t really see if I get trolled on Twitter so maybe that’s why I’ve got such a positive mindset on social media. I do find some things on Instagram, like criticism, a little bit negative. But ultimately, I think overall it’s an extremely positive tool to have with you. </p>\n\n\n\n<p><strong>What are your big goals for the next couple of seasons?</strong></p>\n\n\n\n<p>As I’ve talked about before, I really want to get a Worlds jersey, and a Euros jersey would be nice as well. Hopefully, I can get one on the track and then I’d love to come away with the road Worlds, that would be so special and really top my junior years off. In August I’m looking at racing with Movistar, because that’s when I’m sort of eligible to raise up [to stagiaire]. I’m really excited for that, to settle in and enjoy my first couple of races in the WorldTour. </p>\n\n\n\n<p><strong>And if you could win one race over your whole career, what would it be? </strong></p>\n\n\n\n<p>I think I would win an Olympic gold medal. Because growing up being a sporty kid that did all sorts of sports, watching the Olympics in London, I always looked up to the Olympics so much and a gold medal is also something I’ve dreamed of. Probably on the road, but any one would be pretty special.</p>\n\n\n\n<p><strong>As you move into having a senior career, do you feel particular pressure to replicate the successes you’ve had in your junior career? </strong></p>\n\n\n\n<p>To be honest, I’ve not really thought about that. Just because when I came into the junior ranks, I didn’t expect to be where I am, being able to contest for the win in most races. For me that was a bit of a shock, so I think I’ll probably carry that into the U23 and elite ranks, put no pressure on myself and purely do it because I love it. So for now I’ll just see how it goes. Obviously it would be amazing to be at the top in the elite, but I understand completely how much that takes. I’m just so excited to race my bike for a living. </p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/cat-ferguson-interview\">‘I’m just excited to race my bike for a living’: Cat Ferguson interview</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"fclifford","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"4d1862f0589505f9c443ac97f1dceabcf8555e971f7316bf5be16c29fa2dd2f9","category":"Cycling"}