{"title":"Optimizing test and treat options for vivax malaria: An options assessment toolkit (OAT) for Asia Pacific national malaria control programs","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002970","date":1716386400000,"content":"<p>by Sanjaya Acharya, Manash Shrestha, Ngo Duc Thang, Lyndes Wini, M. Naeem Habib, Josselyn Neukom, Karma Lhazeen, Caroline A. Lynch, Kamala Thriemer</p>\r\n\r\nDesigning policy in public health is a complex process requiring decision making that incorporates available evidence and is suitable to a country’s epidemiological and health system context. The main objective of this study was to develop an options assessment toolkit (OAT) to provide a pragmatic and evidence-based approach to the development of policies for the radical cure (prevention of relapse) of vivax malaria for national malaria control programs in the Asia-Pacific region. The OAT was developed using participatory research methods and a Delphi process using a sequential multi-phase design, adapted with a <i>pre-development phase</i>, a <i>development phase</i>, and a <i>final development phase</i>. In the <i>pre-development phase</i>, a literature review was conducted to inform the toolkit development. Data collection in the <i>development phase</i> consisted of core research team discussions, multiple rounds of consultation with participants from National Malaria Control Programs (NMP) (online and in person), and two separate modified e-Delphi processes with experts. The <i>final development</i> phase was the piloting of the toolkit during the annual meeting of the Asia Pacific Malaria Elimination Network (APMEN) Vivax Working Group. We developed a tool kit containing the following elements: i) Baseline Assessment Tool (BAT) to assess the readiness of NMPs for new or improved coverage of radical cure, ii) eight scenarios representative of Asia Pacific region, iii) matching test and treat options based on available options for G6PD testing and radical cure for the given scenarios, iv) an approaches tool to allow NMPs to visualize considerations for policy change process and different implementation strategies/approaches for each test and treat option. The OAT can support vivax radical cure policy formulation among NMPs and stakeholders tailoring for their unique country context. Future studies are needed to assess the utility and practicality of using the OAT for specific country context.","author":"Sanjaya Acharya","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"4d1b4d2ea5e779a5eb8d8a625b62de46cbac82fa9810c6cb44542fb4a197e492","category":"Environment"}