{"title":"Investigation of Flowback Behavior for Multi-Fractured Horizontal Wells in Gulong Shale Oil Reservoir Based on Numerical Simulation","link":"https://www.preprints.org/manuscript/202405.1493/v1","date":1716454543000,"content":"Multi-stage hydraulic fracturing with horizontal well technology has been widely used in shale oil reservoir. After hydraulic fracturing, hydraulic fractures and opened beddings are intertwined, which result in a complex fracture network. As well as the migration of multi-phase fluids during fracturing and soaking processes, which lead to complex flowback performance, and brings dif-ficulty to productivity evaluation and flowback strategies optimization. In this paper, taking the Daqing Gulong shale reservoir as an example, a numerical model for flowback period, which considered oil-water-gas three-phase flow and orthogonal fracture network has been established. The characteristics and influencing factors of flowback performance have been deeply studied, and the flowback modes of shale oil are reasonably optimized. Factors such as PTPG (pseu-do-threshold pressure gradient), opened bedding stress sensitivity, opened bedding permeability and matrix permeability have obvious effects on the flowback performance, resulting in signifi-cant variations in production peaks, high yield periods, and decline rates. In addition, three flowback modes are distinguished based on the rate at which the BHP (bottom hole pressure) drops. These correspond to three types of choke modes. Based on the result of numerical model, three flowback modes are optimized and the impacts of different flowback modes on shale oil flowback are clarified. This study is particularly important for understanding the performance of shale oil flowback and guiding the efficient exploitation of shale oil.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4d1c3f59039f36565bf076578a4145f234da98be514a79b4eb536e0c417e2ac0","category":"Interdisciplinary"}