{"title":"Exploring the ingenious science and science fiction of making things invisible","link":"https://arstechnica.com/?p=1933799","date":1689613137000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/invisibleTOP-800x535.jpg\" alt=\"Still from 1933 film showing man with an invisible head\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/invisibleTOP.jpg\">Enlarge</a> <span>/</span> H.G. Wells' <em>The Invisible Man</em> inspired a 1933 film. It's just one cultural example of the human fascination with invisibility.  (credit: Universal Pictures)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>There's a <a href=\"https://en.wikipedia.org/wiki/Ring_of_Gyges\">well-known story</a> in Plato's <a href=\"https://en.wikipedia.org/wiki/Republic_(Plato)\"><em>Republic</em></a> in which a humble shepherd named <a href=\"https://en.wikipedia.org/wiki/Gyges_of_Lydia\">Gyges</a> finds a magical gold ring that renders whoever wears it invisible. Gyges proceeds to use his newfound power to murder a king and take over the throne. Plato intended it as a cautionary tale about whether a man could act justly even if the fear of consequence was removed. (The fictional Gyges clearly failed that moral test.) The parable famously inspired J.R.R. Tolkien's <a href=\"https://en.wikipedia.org/wiki/The_Lord_of_the_Rings\"><em>Lord of the Rings</em></a> trilogy, among other works. And it's one of the earliest examples of the longstanding human fascination with invisibility.</p>\n<p>\"Invisibility represents the perfect merger of not being seen while being able to see others, which would be great if you were a primitive hunter-gatherer,\" Greg Gbur, a physicist at the University of North Carolina, Chapel Hill, told Ars. \"But more purely, it represents power. You see that in the story of the Ring of Gyges, where the ability to make yourself unseen gives you a tremendous advantage over others. So it's fascinating as a symbol of pure power and how people might use and abuse it.\" </p>\n<p>Gbur is the author of a new book from Yale University Press, <a href=\"https://www.amazon.com/dp/0300250428/?tag=arstech20-20\"><em>Invisibility: The History and Science of How Not to Be Seen</em></a>, covering the earliest discoveries in optical physics through to the present, along with how invisibility has been portrayed in science fiction (a longstanding passion for Gbur). He's also the author of 2019's fascinating <a href=\"https://yalebooks.yale.edu/book/9780300231298/falling-felines-and-fundamental-physics\"><em>Falling Felines and Fundamental Physics</em></a>, which explored the <a href=\"https://arstechnica.com/science/2019/12/the-surprisingly-complicated-physics-of-why-cats-always-land-on-their-feet/\">surprisingly complicated physics</a> of why cats always seem to land on their feet, ferreting out several obscure scientific papers spanning decades of research in the process. His interest in invisibility science dates back to his graduate school days when his advisor assigned him a project on the topic.</p></div><p><a href=\"https://arstechnica.com/?p=1933799#p3\">Read 28 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1933799&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4d25697c683e2975f5fab06c11d8987be95d41a5aa29f319326091739c169d84","category":"Tech"}