{"title":"Does cycling shoe stiffness actually matter?","link":"https://www.bikeradar.com/features/does-cycling-shoe-stiffness-actually-matter/","date":1638608401000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/12/Does-shoe-stiffness-matter-9071942.jpg?quality=45&amp;resize=620,413\" />                                            <p>It’s long been assumed that stiff clipless <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-cycling-shoes/\">cycling shoes</a> offer increased performance and efficiency benefits compared to more flexible shoes. However, <a href=\"https://osf.io/preprints/sportrxiv/k6bh8/\" target=\"_blank\">a new study from the Department of Mechanical Engineering at the University of Colorado</a> suggests that’s not always the case.</p>\n<p>In an analysis of the measurable advantages of cycling shoes and <a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\">clipless pedals</a> used by competitive and recreational road cyclists, researchers found no hard evidence that a super-stiff sole is a winning choice for sprinting.</p>\n<h2>How was the study conducted?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The riders tested the shoes on a short uphill slope.</span></figcaption><span> <i>Joseph Branston / Immediate Media</i></span></div>\n<p>Sports scientists measured the mechanical power outputs, velocities, and cadences of 19 healthy male cyclists during a series of 50m flat-out sprints.</p>\n<p>The riders trialled three shoes, all with identical uppers, that were attached to soles with very different grades of stiffness – the most flexible shoe used injection-moulded soles, the second set a carbon-fibre/fibreglass blend and the stiffest shoe featured a full carbon fibre sole.</p>\n<p>All of the cyclists rode outdoors on a paved asphalt road with a steady, uphill gradient (4.9 per cent) and used the same clipless pedals throughout all tests.</p>\n<h2>What were the findings of the study?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The study showed little to no difference in performance when comparing shoes of differing stiffness.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>No difference was detected between the three shoe soles.</p>\n<p>Measurements for average and peak power, average and peak cadence, maximal sprint velocity, acceleration and crank torque were almost identical throughout.</p>\n<p>“We found no difference in performance between less stiff and stiffer road cycling shoe soles during short uphill sprints in recreational/competitive cyclists,” concluded lead researcher Rodger Kram.</p>\n<p>According to their research, the stiffest cycling shoe soles, when compared both to a moderately stiff and the least stiff road cycling shoe offered by a “well-known manufacturer” showed no performance benefits in:</p>\n<ul><li>50m average and peak one-second power</li>\n<li>Average and peak change in velocity</li>\n<li>Maximum velocity</li>\n<li>Peak acceleration</li>\n<li>Peak torque</li>\n</ul><p>The researchers also expressed surprise at the uniformity of findings through the short sprints.</p>\n<h2>Does this mean flexible shoes are just as fast as stiff shoes?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Before you ditch your stiff cycling shoes in favour of some stylish SPD sandals, consider these points.</span></figcaption><span> <i>Reuben Bakker-Dyos / Immediate Media</i></span></div>\n<p>Before you cancel your order for those stylish stiff-soled Giros and opt for your old-school plimsolls, it’s worth remembering that this is also only one trial, among a small group of trained riders focused upon ‘longitudinal sole stiffness’ and its impact upon a few seconds of all-out sprinting.</p>\n<p>Over longer time periods, differences in sole stiffness might produce benefits. Some bike-fitting specialists agree.</p>\n<p>“Sprint performance normally isn’t the main reason for selecting a stiffer shoe, at least not from a bike-fitting perspective,” suggests Innes Ogilvy of Edinburgh-based bike fitter Bramblers Cycling. “And the findings of this study probably won’t help people find the right shoe still.”</p>\n<p>“I think the reason for designing a stiff shoe or buying one should be to improve comfort,” adds Ogilvy. “In my experience, those who have intentionally opted for more flexible cycling shoes tend to have had bad experiences with stiff shoes because they bought something that didn’t fit, not because it was stiff.”</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Bont argues that stiffness does matter.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>The latest study has raised a few eyebrows among the creators of cycling shoes. “If their argument was true, you could easily race in a pair of running shoes, which is obviously not the case at all,” insists Istvan Nemeth, CEO at Bont Cycling.</p>\n<p>Kram’s own previous research backs up this claim.</p>\n<p>A study published in 2019 that compared the results of 12 cyclists testing stiff-soled shoes and clipless pedals against running shoes – which typically have next-to-no longitudinal stiffness – and platform pedals found stiff clipless shoes produced much better performance stats and were shown to positively improve cycling performance during high-power, uphill sprints.</p>\n<p>Broadly speaking, this suggests that while there is an advantage to be had by choosing stiffer shoes, the returns in performance become vanishingly small past a certain point.</p>\n<p>The 2020 study was unable to define where this critical point lies but, for most of us, it’s likely safe to assume that even entry-level shoes will provide all of the stiffness we need from a performance perspective.</p>\n<h2>What about fit and comfort?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Fit is more important than stiffness.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Stiff shoes may have advantages beyond performance for some riders, however.</p>\n<p>Critically, because the clipless pedals are so small (compared to flat pedals), a stiffer shoe helps spread out pedalling forces across the whole foot. If your clipless shoes were as flexible as a running shoe, you would be driving your pedalling force into a small area, which is likely to be both inefficient and very uncomfortable.</p>\n<p>Both Nemeth and Ogilvy point out that, stiffness aside, the key to getting the right shoes is having a proper bike fit. “We emphasise mainly anatomical fit, structural support and stiffness in that order,” adds Nemeth.</p>\n<p>“Turning the pedals is a cyclical movement, good sprinters understand the importance of the upstroke as well as the downstroke… Apart from the sole stiffness, to support the foot on the upstroke you also need proper structural support on the top of the foot.</p>\n<p>“In addition, having structural arch support that stops the foot from pronating and acting as a dampener, and having shoes that allow your foot to spread effectively inside the shoes, all go a long way to increasing efficiency.</p>\n<p>“Simply stiff shoes are not enough and having stiff shoes without the other two parts done correctly will cause issues and discomfort.”</p>\n<h2>So does shoe stiffness actually matter?</h2>\n<p>In summary, when compared to riding in flexible running shoes with flat pedals, a stiff clipless-pedal shoe will provide a tangible performance benefit.</p>\n<p>However, the majority of clipless shoes on the market are likely to be stiff enough for most riders (though exactly how much ‘enough’ is isn’t clear).</p>\n<p>More critical is that you get a shoe that is suitable for your chosen cycling discipline, that also fits and supports your feet well.</p>","author":"Rob Kemp","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"4d29158cb6998a8ac6ae3b0d994fb7943a39f5060931df741e79d00dbe016693","category":"Cycling"}