{"title":"Wind Speed and Vegetation Coverage in Turn Dominated Wind Erosion Change With Increasing Aridity in Africa","link":"https://onlinelibrary.wiley.com/doi/10.1029/2024EF004468?af=R","date":1718021409000,"content":"<h2>Abstract</h2>\n<p>Wind erosion is one of the main causes of land degradation and desertification. Clarifying the spatiotemporal variations of wind erosion and the dominant factors of its spatial characteristics and the temporal trend will contribute to the establishment of appropriate wind erosion control and management practices, which is essential for combating global land degradation and strengthening ecological protection in drylands. Here, we assessed wind erosion in Africa during 2001–2020 based on the Revised Wind Erosion Equation (RWEQ). We also analyzed the influential factor of spatial characteristics and temporal variation based on machine learning and other methods under different aridity. Results revealed that the average annual wind erosion modulus was 16,672 t/km<sup>2</sup>/a in Africa during 2001–2020, with hyper-arid areas and arid areas accounting for more than 90% of the total wind erosion modulus. The spatial characteristics of wind erosion were dominated by natural factors but not anthropogenic activities. Except in hyper-arid areas, wind speed and vegetation coverage together dominated the spatial characteristics. Wind speed was the dominant factor in wind erosion change, while in arid and semi-arid areas, the capability of vegetation coverage to affect wind erosion change was comparable to wind speed. It can be concluded that, although revegetation does contribute to the reduction of wind erosion in arid and semi-arid areas, taking into account water resource constraints and land use conflicts, large plantations can be replaced with windbreaks to increase vegetation coverage while reducing near-surface wind speed, which improves the sustainability of ecological projects aimed at combating land degradation and desertification.</p>","author":"Hanbing Zhang, \nJian Peng, \nChaonan Zhao","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"4d2bfa0f872e1b8a5634ac4f2d19bd7566242ca41f06e20e815d510285343845","category":"Environment"}