{"title":"Characterization and Optimization of Boride Coatings on AISI 1137 Steel: Enhancing Surface Properties and Wear Resistance","link":"https://www.preprints.org/manuscript/202409.1893/v1","date":1727167872000,"content":"This study investigates the optimization of boron coating parameters for medium carbon steels, specifically AISI 1137, and their subsequent effects on mechanical properties, which are crucial for industrial applications. Despite extensive research on boronizing processes, an understanding of the optimal conditions that enhance wear resistance and hardness while maintaining structural integrity is still lacking. To address this gap, we systematically examined the impact of boronizing temperatures (850 °C and 950 °C) and durations (2, 4, and 8 hours) on the structural and mechanical properties of AISI 1137 steel. Our findings indicate the need for improved surface properties in medium carbon steels used in demanding environments, such as automotive and machinery components. The boronizing process was carried out using Ekabor 1 powder, with characterization performed through optical microscopy, pin-on-disk wear tests, and Vickers hardness analysis. Results showed that the thickness of the boronized layer ranged from 50.6 μm to 64.8 μm, with wear resistance increasing by 1.8 to 3.9 times at 950 °C compared to 850 °C. The measured hardness of the boronized surface layers varied between 1963.7 HV and 219.3 HV, decreasing from the boronized layer toward the base material. The optimal parameters for wear resistance and hardness were found to be a temperature of 950 °C and a duration of 8 hours, facilitating the formation of FeB and Fe2B phases, which significantly enhanced the steel's mechanical properties. This research provides valuable insights into the boronizing process and establishes a foundation for optimizing surface treatments to extend the lifespan and performance of medium carbon steels in industrial use.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4d35b4bed9e5197695f6c0c82ab833dbb8fb8357908248276c5065c53dab42b8","category":"Interdisciplinary"}