{"title":"Cyclophosphamide induces the loss of taste bud innervation in mice","link":"https://academic.oup.com/chemse/article/doi/10.1093/chemse/bjae010/7616296?rss=1","date":1709164800000,"content":"<span><div>Abstract</div>Many common chemotherapeutics produce disruptions in the sense of taste which can lead to loss of appetite, nutritional imbalance, and reduced quality of life, especially if taste loss persists after treatment ends. Cyclophosphamide (CYP), an alkylating chemotherapeutic agent, affects taste sensitivity through its cytotoxic effects on mature taste receptor cells (TRCs) and on taste progenitor cell populations, retarding the capacity to replace TRCs. Mechanistic studies have focused primarily on taste cells, however, taste signaling requires communication between TRCs and the gustatory nerve fibers that innervate them. Here, we evaluate cyclophosphamide’s effects on the peripheral gustatory nerve fibers that innervate the taste buds. Following histological analysis of tongue tissues, we find that CYP reduces innervation within the fungiform and circumvallates taste buds within 4 days after administration. To better understand the dynamics of the denervation process, we used 2-photon intravital imaging to visualize the peripheral gustatory nerve fibers within individual fungiform taste buds up to 20 days after CYP treatment. We find that gustatory fibers retract from the taste bud properly but are maintained within the central papilla core. These data indicate that in addition to TRCs, gustatory nerve fibers are also affected by CYP treatment. Because the connectivity between TRCs and gustatory neurons must be re-established for proper function, gustatory fibers should continue to be included in future studies to understand the mechanisms leading to chemotherapy-induced persistent taste loss.</span>","author":"","siteTitle":"Chemical Senses Current Issue","siteHash":"eaf999c97f18ab6d9732972032217d08ae5a0287f7a7d719a702f9f5727afa53","entryHash":"4d42ec8a08b35b73f2814608922f25c8107aa3a096a429b7881a53426f16ca1f","category":"Environment"}