{"title":"How to avoid indoor training burnout | 7 essential tips","link":"https://www.bikeradar.com/advice/fitness-and-training/indoor-training-burnout/","date":1698598845000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/How-to-avoid-indoor-training-burnout-ce1ca15.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/How-to-avoid-indoor-training-burnout-ce1ca15.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/How-to-avoid-indoor-training-burnout-ce1ca15.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/How-to-avoid-indoor-training-burnout-ce1ca15.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/How-to-avoid-indoor-training-burnout-ce1ca15.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/How-to-avoid-indoor-training-burnout-ce1ca15.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/How-to-avoid-indoor-training-burnout-ce1ca15.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/How-to-avoid-indoor-training-burnout-ce1ca15.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/How-to-avoid-indoor-training-burnout-ce1ca15.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/How-to-avoid-indoor-training-burnout-ce1ca15.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"How to avoid indoor training burnout\" title=\"How to avoid indoor training burnout\" />                                            <p>With the nights drawing in and the weather becoming increasingly inclement, many of us are starting to dust off our trusty indoor trainers.</p>\n<p>Riding indoors has increased in popularity over recent years, and has helped many people improve their fitness. It has also made cycling more accessible to <a href=\"https://www.bikeradar.com/advice/fitness-and-training/60-minute-turbo-training-sessions/\">time-crunched riders</a> and those who lack confidence on the roads.</p>\n<p>Indoor cycling isn’t without its drawbacks, though. In particular, there’s a high risk of getting ‘burnt out’ when spending many of your riding hours inside.</p>\n<p>So, let’s explore why <a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">indoor training</a> can cause burnout, and cover tips you can put in place to avoid becoming worn down by indoor riding.</p>\n<h2>Why indoor training can cause burnout</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"The nature of indoor training makes it easy to overdo it.\" title=\"Man checking his stats after his indoors cycling turbo trainer session\" />\n\n</div><div><figcaption><span><i></i> The nature of indoor training makes it easy to overdo it.</span></figcaption><span> <i>Getty</i></span></div>\n<p>Initially, enthusiasm for indoor training is high – the appeal of shorter, structured sessions and even some group riding or racing can be just what’s needed after lots of longer <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-vs-outdoor-cycle-training/\">outdoor miles</a>.</p>\n<p>It is also satisfying to complete some uninterrupted, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/60-minute-turbo-training-sessions/\">time-efficient training sessions</a>, rather than the often stop-start, and sometimes hazardous, nature of riding outside.</p>\n<p>However, indoor riding can become monotonous (even if <a href=\"https://www.bikeradar.com/features/opinion/indoor-cycling-is-boring/\">that’s the way some riders like it</a>) since there’s no change in scenery.</p>\n<p>Many would argue you don’t get the same satisfaction from completing a certain distance or reaching the top of a tough climb as in the ‘real’ world.</p>\n<p>In a bid to keep indoor training interesting, riders tend to over-intensify training too, which can quickly lead to physical burnout. Ultimately, these factors can easily derail your training.</p>\n<p>To help you reap the <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-cycling-benefits/\">benefits </a><a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-cycling-benefits/\">indoor training</a> offers and avoid the common pitfalls, here are some tips to help you keep training indoors on a consistent basis…</p>\n<h2>1. Use power variation (but keep this within the spirit of the session)</h2>\n<p>Choose sessions that are structured and varied, such as alternating between five minutes at one wattage, five minutes at another and so on.</p>\n<p>This enables you to focus on smaller, more manageable chunks, rather than being overwhelmed by the total ride duration (and how much of it you still have left to go).</p>\n<p>What’s important, though, is that any power variation should be within the spirit of the session.</p>\n<p>For example, if you’re looking to do a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zone</a> 2 endurance ride (~55 to 75 per cent of FTP), aim to use a session where the power stays largely within this zone 2 range.</p>\n<p>Plenty of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">indoor training apps</a> will add bursts of intensity within an endurance ride to keep things interesting.</p>\n<p>However, these often have no real physiological benefit and can undermine your training by creating unnecessary fatigue, potentially hindering some of the adaptations you’re looking to get from the rides.</p>\n<h2>2. Turn ERG mode off for some structured sessions</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Simon von Bromley riding a time trial bike on a smart trainer\" title=\"ERG Mode is overrated_01\" />\n\n</div><div><figcaption><span><i></i> ERG mode can be useful in some circumstances.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>If you have a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a>, ERG mode is a fantastic feature that holds power at a target wattage, adjusting resistance according to cadence.</p>\n<p>It’s great, because it enables you to follow a structured session while focusing on something else – such as watching TV.</p>\n<p>However, our advice would be to do at least some of your structured sessions with <a href=\"https://www.bikeradar.com/features/opinion/erg-mode-is-overrated/\">ERG mode off</a>.</p>\n<p>This can provide mental stimulation and an element of challenge because you have to focus on holding your wattage at a target output.</p>\n<p>If you’re ultimately training to improve your power outdoors when the weather improves, switching ERG mode off will also make your indoor riding much more like the outdoors.</p>\n<p>When performing <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">high-intensity interval sessions</a>, switching ERG mode off can also allow for higher-quality efforts in some cases.</p>\n<p>This is because you can more easily fine-tune your wattage based on how you’re feeling – e.g. pushing a little harder if you’re having a good day, or backing off slightly if things are feeling harder than normal.</p>\n<p>This can help avoid physical burnout or failed sessions.</p>\n<h2>3. Get Social</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift on a laptop and the BikeRadar Podcast on an iPhone\" title=\"Zwift on a laptop and the BikeRadar Podcast on an iPhone\" />\n\n</div><div><figcaption><span><i></i> Apps such as Zwift can prevent burnout.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>It’s perhaps an obvious tip, but using a social platform such as <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a> for some of your indoor riding can pay great dividends.</p>\n<p>Joining an organised group ride or race can provide extra motivation and accountability, as well as help the time pass a lot more quickly. To enhance the experience, you can even join a Discord group to chat away with fellow riders via a headset.</p>\n<h2>4. Set yourself some process goals</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wattbike Atom pedalling dynamics\" title=\"Wattbike Atom pedalling dynamics\" />\n\n</div><div><figcaption><span><i></i> Some devices, such as those from Wattbike, can provide information on, for example, how ‘good’ your pedalling technique is.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>Riding indoors isn’t all about sheer power output.</p>\n<p>You can also work on abilities such as the smoothness of your pedal stroke, the left-right balance of your legs, or how well you’re engaging your glute muscles.</p>\n<p>Having process goals like this for some of your indoor rides can help bring purpose to your training sessions, as well as providing something to keep your mind focused.</p>\n<p>Certain equipment, such as a <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wattbike-atom-next-generation-review/\">Wattbike</a> or dual-sided <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meter</a> pedals will give you feedback on data including your pedalling smoothness and torque generation, so you can even set some objective goals to work towards and track your progress.</p>\n<h2>5. Test progress (but not too regularly)</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Jack Evans doing a 4km time trial on a Watt bike.\" title=\"CZ1_9554\" />\n\n</div><div><figcaption><span><i></i> FTP testing requires a gruelling maximal 20-minute effort, so don’t overdo it.</span></figcaption><span> <i>Chris Teagles / Our Media </i></span></div>\n<p>Seeing clear improvements in your cycling fitness is an excellent way to keep motivation high.</p>\n<p>You can measure your progress indoors in various ways, such as by performing one or more all-out efforts and looking for improvements in your power, or looking for a reduction in your heart rate and perceived effort when riding at a given wattage.</p>\n<p>Ensure any testing you do is relevant to the type of training you are undertaking. So, if you’re looking to improve <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">FTP</a>, an <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-take-ftp-test-zwift/\">FTP test</a> is appropriate.</p>\n<p>However, if you’re trying to improve your explosive power, then it would be more relevant to test your power over 30 to 120 seconds, for example.</p>\n<p>As a word of warning, it’s best not to do maximal testing too often, because it can be a key cause of both mental and physical burnout. Generally, every eight weeks is the most we’d recommend.</p>\n<h2>6. Avoid over-intensifying training (and consider this when choosing a plan)</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Simon von Bromley of BikeRadar using a smart trainer on Zwift\" title=\"Simon von Bromley of BikeRadar using a smart trainer on Zwift\" />\n\n</div><div><figcaption><span><i></i> Some indoor training plans could leave you overcooked.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>In a bid to keep training interesting, there’s a tendency for indoor riding to be over-intensified.</p>\n<p>This means most of your training sessions have at least some time spent at a high ‘zone 3’ intensity, or above (e.g. 85 per cent of FTP, or higher).</p>\n<p>This can be a fast track to becoming <a href=\"https://www.bikeradar.com/advice/fitness-and-training/overtraining-syndrome/\">overtrained</a> because you’re not allowing sufficient recovery between training sessions in order for your body to adapt.</p>\n<p>It can also mean you’re never quite sufficiently fresh to go really hard in any of your sessions.</p>\n<p>This can result in most of your training sessions being neither very hard nor very easy.</p>\n<p>Over time, your training will lack the variety and acute adaptive stimuli needed to continue to see fitness improvements, and you’ll reach a fitness plateau.</p>\n<p>Our recommendation would be to aim for no more than two high-intensity sessions per week (i.e. efforts above FTP, or a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/power-zone-training-cycling/\">Zwift race</a>).</p>\n<p>Depending on your fitness and capacity to recover, you may find you can comfortably include one ‘middle intensity’ session each week (e.g. efforts between ~75 and 95 per cent FTP, or a hard group ride). The remaining training sessions each week would then be at a lower intensity level (less than 75 per cent FTP).</p>\n<p>If you opt to follow a pre-built training plan (which can be a great motivator in itself), be careful about the amount of high-intensity work the plan includes.</p>\n<p>Some commercial plans are built to achieve short-term fitness wins and to keep training ‘fun’ through lots of high-intensity sessions.</p>\n<p>However, these plans can be a wrong choice over the longer term if they cause fitness stagnation and burnout.</p>\n<h2>7. Get your training environment right</h2>\n<p>Finally, we all know riding indoors can be a sweaty affair, which can place additional strain on the body, both in terms of temperature regulation and maintaining hydration.</p>\n<p>To minimise this stress, we’d recommend investing in a good fan setup for your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/tips-for-building-the-ideal-indoor-training-space/\">pain cave</a>, and pre-chilling your drinks, which can make a big difference to your core body temperature as well as hydration levels.</p>\n<p>If you’re still overheating, consider using a wet towel on the back of your neck and wrists, and if you’re a salty sweater (you’ll know this if you see salt on your kit, and often find sweat stings your eyes) try adding some electrolytes to your drinks.</p>\n<h2>Example training weeks to avoid indoor training burnout</h2>\n<h3>Example 1</h3>\n<ul>\n<li><strong>Mon:</strong> Day off</li>\n<li><strong>Tues:</strong> High-intensity interval session</li>\n<li><strong>Weds:</strong> Zone 2 endurance ride, including 15 mins focused glute activation and 15 mins focused on smooth pedal stroke.</li>\n<li><strong>Thurs:</strong> Day off</li>\n<li><strong>Fri:</strong> Zwift race</li>\n<li><strong>Sat:</strong> Zone 2 endurance ride with ERG mode off, alternating power every 10 mins between low, medium and high zone 2.</li>\n<li><strong>Sun:</strong> Zwift group ride at a zone 2/ low zone 3 pace</li>\n</ul>\n<h3>Example 2</h3>\n<ul>\n<li><strong>Mon:</strong> Day off</li>\n<li><strong>Tues:</strong> FTP Test</li>\n<li><strong>Weds:</strong> Day off</li>\n<li><strong>Thurs:</strong> Zwift race</li>\n<li><strong>Fri:</strong> Day off</li>\n<li><strong>Sat:</strong> Zone 2 endurance ride working on left/right power balance and some high-cadence drills.</li>\n<li><strong>Sun:</strong> Shorter zone 2 endurance ride with ERG mode off, targeting 5 mins at 5W increments from the bottom to the top end of zone 2; followed by a short Zwift group ride.</li>\n</ul>","author":"Tom Bell","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"4d426f9f3a0f61974a9d545a7f65b578e58c5bfabbc6eaa6c03ec49409d41c51","category":"Cycling"}