{"title":"PSA: Google Authenticator's Cloud-Synced 2FA Codes Aren't End-to-End Encrypted","link":"https://www.macrumors.com/2023/04/27/google-authenticator-cloud-sync-no-e2e/","date":1682599161000,"content":"Earlier this week, Google <a href=\"https://www.macrumors.com/2023/04/24/google-authenticator-google-account-integration/\">updated</a> its Authenticator app to enable the backup and syncing of 2FA codes across devices using a Google Account. Now an examination by Mysk security researchers has found that the sensitive one-time passcodes being synced to the cloud aren't end-to-end encrypted, leaving them potentially exposed to bad actors.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/google-authenticator.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nPrior to the integration of Google Account support, all codes in the Google Authenticator app were stored on device, which meant that if the device was lost, so too were the one-time passcodes, potentially causing loss of account access as well. But it seems that by enabling cloud-based syncing, Google has opened up users to a security risk of a different sort. \r<br />\n\r<br />\n\"We analyzed the network traffic when the app syncs the secrets, and it turns out the traffic is not end-to-end encrypted,\" said Mysk via <a href=\"https://twitter.com/mysk_co/status/1651021165727477763\">Twitter</a>. \"This means that Google can see the secrets, likely even while they're stored on their servers. There is no option to add a passphrase to protect the secrets, to make them accessible only by the user.\"\r<br />\n\r<br />\n\"<a href=\"https://www.cyberark.com/what-is/secrets-management/\">Secrets</a>\" is a term used to refer to private pieces of information that act as keys to unlock protected resources or sensitive information; in this case, one-time passcodes.\r<br />\n\r<br />\nMysk said that its tests found the unencrypted traffic contains a \"seed\" that's used to generate the 2FA codes. According to the researchers, anyone with access to that seed can generate their own codes for the same accounts and break in to them.\r<br />\n\r<br />\n\"If Google servers were compromised, secrets would leak,\" Mysk told <a href=\"https://gizmodo.com/google-authenticator-two-factor-not-end-encrypted-1850377102\"><em>Gizmodo</em></a>. Since the QR codes involved with setting up two-factor authentication contain the name of the account or service, the attacker can also identify the accounts. \"This is particularly risky if you're an activist and run other Twitter accounts anonymously,\" added the researchers.\r<br />\n\r<br />\nMysk subsequently advised users not to enable the Google account feature that syncs 2FA codes across devices and the cloud.\r<br />\n\r<br />\n<div><blockquote><p>Google has just updated its 2FA Authenticator app and added a much-needed feature: the ability to sync secrets across devices.<br /><br />TL;DR: Don't turn it on.<br /><br />The new update allows users to sign in with their Google Account and sync 2FA secrets across their iOS and Android devices.… <a href=\"https://t.co/a8hhelupZR\">pic.twitter.com/a8hhelupZR</a></p>— Mysk 🇨🇦🇩🇪 (@mysk_co) <a href=\"https://twitter.com/mysk_co/status/1651021165727477763?ref_src=twsrc%5Etfw\">April 26, 2023</a></blockquote>  </div>\r<br />\nResponding to the warning, a Google spokesperson told <em><a href=\"https://www.cnet.com/tech/services-and-software/googles-new-cloud-based-authentication-isnt-end-to-end-encrypted-yet/\">CNET</a></em> it had added the sync feature early for convenience's sake, but that end-to-end encryption is still on its way: \r<br />\n<blockquote>End-to-End Encryption (E2EE) is a powerful feature that provides extra protections, but at the cost of enabling users to get locked out of their own data without recovery. To ensure that we're offering a full set of options for users, we have also begun rolling out optional E2EE in some of our products, and we plan to offer E2EE for Google Authenticator in the future.\"</blockquote>Until that happens, there are alternative services for syncing authentication codes across devices, such as <a href=\"https://www.macrumors.com/how-to/set-up-and-use-2fa-ios/\">Apple's own 2FA code generator</a> and third-party apps like <a href=\"https://authy.com\">Authy</a>.<div>Tags: <a href=\"https://www.macrumors.com/guide/google/\">Google</a>, <a href=\"https://www.macrumors.com/guide/security/\">Security</a>, <a href=\"https://www.macrumors.com/guide/two-factor-authentication/\">Two-Factor Authentication</a>, <a href=\"https://www.macrumors.com/guide/encryption/\">Encryption</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/27/google-authenticator-cloud-sync-no-e2e/\">PSA: Google Authenticator's Cloud-Synced 2FA Codes Aren't End-to-End Encrypted</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/psa-google-authenticators-cloud-synced-2fa-codes-arent-end-to-end-encrypted.2387974/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4d45559897695eaea82c43e82cd09f62806bb28d6c923245c73636a4e5e0188f","category":"Apple"}