{"title":"What is ACME PKI?","link":"https://www.hashicorp.com/blog/what-is-acme-pki","date":1695240000000,"content":"<p>Many organizations continue to use antiquated methods to manage and track certificates. Common methods include tracking certificates in spreadsheets, text documents, and ticketing solutions. These methods are not only time consuming, taking hours or days to provision or renew certificates, they can also lead to security and compliance issues. The lack of an alerting mechanism or management interface can lead to systems outages that are otherwise easily avoidable. </p>\n\n<h2>What is ACME?</h2>\n\n<p>PKI, or <a href=\"https://en.wikipedia.org/wiki/Public_key_infrastructure\">public key infrastructure</a>, has evolved to include powerful protocols to resolve many of these certificate management issues. One such protocol is Automated Certificate Management Environment protocol (ACME).</p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Automatic_Certificate_Management_Environment\">ACME</a> is a protocol for automating certificate lifecycle management of certificates issued by a Certificate Authority (CA) to clients such as company servers, devices, etc.  Expanded use of certificates, including TLS to secure applications, services, and databases increases the burden and operational risk associated with manual certificate management. The ACME protocol solves many of these risks by enabling security and platform teams to: </p>\n\n<ul>\n<li>Automate the management of certificate domains</li>\n<li>Provision trusted certificates</li>\n<li>Monitor certificate expiration</li>\n</ul>\n\n<p>Additionally, ACME supports the automated renewal or revocation of certificates based on an organization's security policy. Leveraging ACME instead of manual certificate management not only improves your organization's security posture but reduces the risk of system outages caused by human error.</p>\n\n<p>The ACME protocol also addresses a situation known as certificate authority (CA) lock-in. CA lock-in occurs when an organization has a significant dependency on a single CA. This limits an organization's ability to quickly switch CAs if something happens to their current CA, such as a data compromise or outage. ACME is a popular protocol adopted by many CAs, including <a href=\"https://www.vaultproject.io/\">HashiCorp Vault</a>, that makes certificate migration or the selection of a backup CA provider much easier.</p>\n\n<h2>Why use ACME?</h2>\n\n<p>The primary rationale for adopting ACME is the simplification and automation it provides organizations to manage the complexities of modern certificate management. IT teams rely on ACME to help manage their certificate needs because:</p>\n\n<ul>\n<li>ACME is an open standard</li>\n<li>It is considered a best practice when if comes to PKI and TLS security posture</li>\n<li>It has ongoing <a href=\"https://www.abetterinternet.org/\">community-based enhancements and support</a></li>\n<li>It has reduced IT costs for organizations</li>\n<li>It increases organizational agility by adding and supporting backup CAs</li>\n</ul>\n\n<h2>HashiCorp Vault and ACME</h2>\n\n<p>HashiCorp Vault is a platform for identity-based security and secrets and certificate lifecycle management. Vault introduced support for the ACME protocol as part of the June 2023 <a href=\"https://www.hashicorp.com/blog/vault-1-14-brings-acme-for-pki-aws-roles-and-more-improvements\">1.14 release</a> to help customers automate certificate lifecycle management using industry-standard tooling for private PKI needs, eliminating dependency on manual processes or alternate products. Standard ACME clients, such as <a href=\"https://dwdraju.medium.com/securing-hashicorp-vault-with-lets-encrypt-ssl-19cad1eb294\">Certbot</a>, the CNCF's Kubernetes cert-manager, can automate certificate requests from Vault without users needing to know Vault APIs or auth mechanisms. To learn more about how to use ACME on HashiCorp Vault, check out our tutorial on how to <a href=\"https://developer.hashicorp.com/vault/tutorials/secrets-management/pki-acme-caddy\">Enable ACME with PKI secrets engine</a>.</p>\n\n<p>In the coming months HashiCorp plans to release a series of informational blogs and white papers focusing on PKI adoption and best practices. To learn more about Vault and data protection, visit our <a href=\"https://www.hashicorp.com/products/vault/features\">Vault features page</a>.</p>\n","author":"Rich Dubose","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"4d470efd5a0ed510e15169afc987a24fdd5007931c7a8695d10082109639cc00","category":"Tech"}