{"title":"Vulnerability of Eastern Tropical Pacific chondrichthyan fish to climate change","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17373?af=R","date":1720162800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/dab97799-032c-452a-8fe6-522ed22ba30e/gcb17373-toc-0001-m.png\" alt=\"Vulnerability of Eastern Tropical Pacific chondrichthyan fish to climate change\" />\n<p>This assessment identifies sharks' vulnerability to climate change in a data-poor tropical region and suggests management actions.</p>\n<br />\n<h2>Abstract</h2>\n<p>Climate change is an environmental emergency threatening species and ecosystems globally. Oceans have absorbed about 90% of anthropogenic heat and 20%–30% of the carbon emissions, resulting in ocean warming, acidification, deoxygenation, changes in ocean stratification and nutrient availability, and more severe extreme events. Given predictions of further changes, there is a critical need to understand how marine species will be affected. Here, we used an integrated risk assessment framework to evaluate the vulnerability of 132 chondrichthyans in the Eastern Tropical Pacific (ETP) to the impacts of climate change. Taking a precautionary view, we found that almost a quarter (23%) of the ETP chondrichthyan species evaluated were <i>highly</i> vulnerable to climate change, and much of the rest (76%) were <i>moderately</i> vulnerable. Most of the <i>highly</i> vulnerable species are batoids (77%), and a large proportion (90%) are coastal or pelagic species that use coastal habitats as nurseries. Six species of batoids were <i>highly</i> vulnerable in all three components of the assessment (exposure, sensitivity and adaptive capacity). This assessment indicates that coastal species, particularly those relying on inshore nursery areas are the most vulnerable to climate change. Ocean warming, in combination with acidification and potential deoxygenation, will likely have widespread effects on ETP chondrichthyan species, but coastal species may also contend with changes in freshwater inputs, salinity, and sea level rise. This climate-related vulnerability is compounded by other anthropogenic factors, such as overfishing and habitat degradation already occurring in the region. Mitigating the impacts of climate change on ETP chondrichthyans involves a range of approaches that include addressing habitat degradation, sustainability of exploitation, and species-specific actions may be required for species at higher risk. The assessment also highlighted the need to further understand climate change's impacts on key ETP habitats and processes and identified knowledge gaps on ETP chondrichthyan species.</p>\n<h2>Abstracta</h2>\n<p>El cambio climático es una emergencia medioambiental que amenaza a especies y ecosistemas en todo el mundo. Los océanos han absorbido alrededor del 90% del calor antropogénico y entre el 20% y el 30% de las emisiones de carbono, lo que ha provocado su calentamiento, acidificación, desoxigenación, cambios en la estratificación de los océanos y en la disponibilidad de nutrientes, así como fenómenos extremos más pronunciados. Dadas las predicciones de cambios, hay una importante necesidad de entender cómo las especies marinas se verán afectadas. En este estudio utilizamos una Evaluación Integrada de Riesgos para evaluar la vulnerabilidad de 132 condrictios del Pacífico Tropical Oriental (PTO) a los impactos del cambio climático. Adoptando un enfoque preventivo, estimamos que la vulnerabilidad general al cambio climático es Alta para casi una cuarta parte (23%) de las especies de condrictios del PTO evaluadas y Moderada para gran parte del resto (76%). La mayoría de las especies altamente vulnerables son batoideos (77%), y una gran proporción de éstas (90%) son especies costeras o especies pelágicas que utilizan los hábitats costeros como áreas de crianza. Seis especies de batoideos tuvieron una vulnerabilidad Alta en los tres componentes de la evaluación. Esta evaluación indica que las especies costeras, en particular las que dependen de áreas de crianza costeras, son las más vulnerables al cambio climático. Es probable que el calentamiento de los océanos, junto con la acidificación y la posible desoxigenación, tenga efectos generalizados sobre las especies de condrictios del PTO, pero las especies costeras se verán también afectadas por los cambios en los aportes de agua dulce, la salinidad y el aumento del nivel del mar. Esta vulnerabilidad relacionada con el clima se ve agravada por otros factores antropogénicos que ya se están produciendo en la región, como la sobrepesca y la degradación del hábitat. La mitigación de los impactos del cambio climático sobre los condrictios del PTO implica medidas que incluyan abordar la degradación del hábitat y la sostenibilidad de la explotación pesquera, y acciones para las especies de mayor riesgo son necesarias. Esta evaluación también destaca la necesidad de comprender mejor los impactos del cambio climático en los hábitats y procesos clave del PTO y las lagunas de conocimiento identificadas en relación con las especies de condrictios del PTO.</p>","author":"Florencia Cerutti‐Pereyra, \nElizabeth J. Drenkard, \nMario Espinoza, \nBrittany Finucci, \nFelipe Galván‐Magaña, \nAna Hacohen‐Domené, \nAlexander Hearn, \nMauricio E. Hoyos‐Padilla, \nJames T. Ketchum, \nPaola A. Mejía‐Falla, \nAna V. Moya‐Serrano, \nAndres F. Navia, \nDiana A. Pazmiño, \nDeni Ramírez‐Macías, \nJodie L. Rummer, \nPelayo Salinas‐de‐León, \nOscar Sosa‐Nishizaki, \nCharles Stock, \nAndrew Chin","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"4d4787d2eb114d8bb3506891658faea038de30a9b3317f1c4452963ca02aa995","category":"Environment"}