{"title":"Perception of Complementary Medicine and Treatment Adherence as Predictors of Self-Efficacy in Individuals with Chronic Conditions in Mexico","link":"https://www.preprints.org/manuscript/202404.1234/v1","date":1713424593000,"content":"Chronic conditions like type 2 diabetes mellitus (T2DM), arterial hypertension (HTN), and obesity are major global health issues, causing significant morbidity and mortality. In Latin America, these conditions contribute to millions of premature deaths annually, posing challenges exacerbated by limited healthcare access and poor primary care quality, particularly in Mexico. Complementary medicine presents a potential solution, offering minimally invasive techniques to improve physical, mental, and spiritual well-being. Effective treatment adherence, crucial for positive outcomes, is influenced by self-efficacy, the ability to manage one's behavior in response to medical conditions. However, treatment adherence rates remain low, indicating a pressing public health concern. This study aimed to explore how perception of complementary medicine and treatment adherence predict self-efficacy among individuals with chronic conditions in Mexico. Analyzing data from 113 participants revealed significant correlations between variables, with treatment adherence positively associated with self-efficacy and perception of holistic medicine negatively correlated with self-efficacy. Regression analysis showed that incorporating perception of complementary medicine and treatment adherence significantly explained self-efficacy levels, suggesting the potential of complementary therapies in holistic healthcare approaches. However, collinearity between variables highlights the need for further research to better understand these relationships and their implications for improving healthcare outcomes in Mexico. Integrating complementary therapies with conventional treatments could enhance overall well-being and treatment adherence, offering promising avenues for addressing chronic conditions in the region. These findings underscore the importance of comprehensive healthcare approaches that integrate both conventional and complementary modalities to optimize health outcomes and quality of life for individuals with chronic conditions in Mexico and beyond.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4d60960cb0ea5040b6638fac5b1cde6a67c8dacacef673aebb1b0f9db3edbf6d","category":"Interdisciplinary"}