{"title":"Oxylipins in Aqueous Humor of Primary Open Angle Glaucoma Patients","link":"https://www.preprints.org/manuscript/202407.1928/v1","date":1721807184000,"content":"PURPOSE: To investigate the oxylipin profiles in aqueous humor of primary open angle glaucoma (POAG) patients.\nMETHODS: Aqueous humor samples were collected from 17 POAG patients and 15 cataract subjects and subjected to the liquid chromatography-mass spectrometry (LC-MS) analysis to detect the oxylipins. The prediction potential of the differential abundant oxylipins was assessed by the receiver operating characteristic (ROC) curves. Pathway and correlation analyses on the oxylipins and clinical and biochemical parameters were also conducted.\nRESULTS: The LC-MS analysis detected a total of 76 oxylipins, of which 29 oxylipins reached the detection limit. The multivariate analysis identified 5 differential abundant oxylipins, 15-keto-prostaglandin F2 alpha (15-kPGF2α), Leukotriene B4 (LTB4), 12,13-Epoxyoctadecenoic acid (12,13-Epome), 15-Hydroxyeicosatetraenoic acid (15-HETE) and 11-Hydroxyeicosatetraenoic acid (11-HETE). The 5 oxylipins are enriched in the arachidonic acid metabolism and linoleic acid metabolism pathways. Pearson correlation analysis showed that 11-HETE was positively correlated with intraocular pressure and central corneal thickness and negatively with cup/disk ratio in the POAG patients. In addition, 15-kPGF2α was positively correlated with visual field defect, and LTB4 was negatively correlated with macular thickness. \nCONCLUSIONS: This study revealed the oxylipin profile in the aqueous humor of POAG patients. Oxylipins involved in arachidonic acid metabolism pathway could play a role in POAG and anti-inflammatory therapies could be potential treatment strategies for POAG.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4d62ac883112c38ce251b65cc9edb6c846d471d39871e453f63780077fee2827","category":"Interdisciplinary"}