{"title":"Lawyers have real bad day in court after citing fake cases made up by ChatGPT","link":"https://arstechnica.com/?p=1949734","date":1687541544000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/getty-robot-lawyer-800x450.jpg\" alt=\"A robot hand places blocks spelling \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/getty-robot-lawyer.jpg\">Enlarge</a> (credit: Getty Images | style-photography)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A federal judge tossed a lawsuit and issued a $5,000 fine to the plaintiff's lawyers after they used ChatGPT to research court filings that cited six fake cases invented by the artificial intelligence tool made by OpenAI.</p>\n<p>Lawyers Steven Schwartz and Peter LoDuca of the firm Levidow, Levidow, &amp; Oberman \"abandoned their responsibilities when they submitted non-existent judicial opinions with fake quotes and citations created by the artificial intelligence tool ChatGPT, then continued to stand by the fake opinions after judicial orders called their existence into question,\" <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.575368/gov.uscourts.nysd.575368.54.0_5.pdf\">US District Judge Kevin Castel wrote</a> in an order yesterday. The lawyers, Castel wrote, \"advocated for the fake cases and legal arguments\" even \"after being informed by their adversary's submission that their citations were non-existent and could not be found.\"</p>\n<p>The judge issued one fine of $5,000 to be paid by the two lawyers and their firm under joint and several liability. More embarrassingly for the lawyers, they are required to send letters to six real judges who were \"falsely identified as the author of the fake\" opinions cited in their legal filings. Castel described the legal analysis in one of the fake cases as \"gibberish.\"</p></div><p><a href=\"https://arstechnica.com/?p=1949734#p3\">Read 25 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1949734&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4d634459611d5fef0b83c2e5129ba08a3aec8cf964a8a674925e00af8b707ce3","category":"Tech"}