{"title":"How NASA plans to melt the Moon—and build on Mars","link":"https://arstechnica.com/?p=1941711","date":1684937820000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/mars-dune-alpha-800x510.jpg\" alt=\"Mars Dune Alpha is the first structure built for NASA by the Moon to Mars Planetary Autonomous Construction Technology team.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/mars-dune-alpha.jpg\">Enlarge</a> <span>/</span> Mars Dune Alpha is the first structure built for NASA by the Moon to Mars Planetary Autonomous Construction Technology team. (credit: ICON)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In June a four-person crew will enter a hangar at NASA’s Johnson Space Center in Houston, Texas, and spend one year inside a 3D-printed building. Made of a slurry that—before it dried—looked like neatly laid lines of soft-serve ice cream, Mars Dune Alpha has crew quarters, shared living space, and dedicated areas for administering medical care and growing food. The 1,700-square-foot space, which is the color of Martian soil, was designed by architecture firm BIG-Bjarke Ingels Group and 3D printed by Icon Technology.</p>\n<p>Experiments inside the structure will focus on the physical and behavioral health challenges people will encounter during long-term residencies in space. But it’s also the first structure built for a NASA mission by the Moon to Mars Planetary Autonomous Construction Technology (MMPACT) team, which is preparing now for the first construction projects on a planetary body beyond Earth.</p>\n<p>When humanity returns to the Moon as part of NASA’s <a href=\"https://www.wired.com/tag/artemis/\">Artemis program</a>, astronauts will first live in places like an orbiting space station, on a lunar lander, or in inflatable surface habitats. But the MMPACT team is preparing for the construction of sustainable, long-lasting structures. To avoid the high cost of shipping material from Earth, which would require massive rockets and fuel expenditures, that means using the regolith that’s already there, turning it into a paste that can be 3D printed into thin layers or different shapes.</p></div><p><a href=\"https://arstechnica.com/?p=1941711#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1941711&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4d6659624e341acf741b4aec16ce1e6e01101ed6f122aa7e846594d13a7e442a","category":"Tech"}