{"title":"Bernal and Sivakov will share leadership for Ineos at the Giro: Daily News","link":"https://cyclingtips.com/2021/05/bernal-and-sivakov-will-share-leadership-for-ineos-at-the-giro-daily-news/","date":1620161953000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>Tuesday’s headlines included news of the Ineos Grenadiers’ Giro lineup, a contract extension for Giro hopeful Emanuel Buchmann, tensions between the UCI and WADA that emerged in the wake of Chris Froome’s salbutamol case in 2018, and a doping ban for Matteo Spreafico.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br />News Editor</em></p>\n\n\n\n<h2>What’s news?</h2>\n\n\n\n<h2>Ineos Grenadiers say Sivakov will be ‘joint leader’ with Bernal at the Giro</h2>\n\n\n\n<p>The <strong>Ineos Grenadiers</strong> have confirmed the team’s <strong>Giro d’Italia</strong> lineup with <strong>Egan Bernal</strong> and <strong>Pavel Sivakov</strong> as headliners for the race. In a press release, the team said that Sivakov would be a “joint leader” with Bernal.</p>\n\n\n\n<p>There had been some questions in recent weeks regarding Bernal’s readiness for the Italian Grand Tour as he has worked to recover from lingering back issues, but he is apparently set to make his debut start in the race. Sivakov, meanwhile, will be making his second career start in the race, having rode to ninth overall in his 2019 debut.</p>\n\n\n\n<p>Bernal and Sivakov will feature as GC hopefuls for the squad with <strong>Filippo Ganna</strong>, <strong>Jonathan Castroviejo</strong>, <strong>Jhonatan Narvaez</strong>, <strong>Salvatore Puccio</strong>, <strong>Gianni Moscon</strong>, and <strong>Daniel Martinez</strong> rounding out the roster.</p>\n\n\n\n<h3>Chris Froome’s salbutamol case led to tensions between the UCI and WADA</h3>\n\n\n\n<p>A <a href=\"https://www.bbc.com/sport/cycling/56980256\" target=\"_blank\">BBC Sport</a> report published on Tuesday revealed <a href=\"https://cyclingtips.com/2021/05/froomes-salbutamol-case-led-to-tension-between-the-uci-and-wada/\" target=\"_blank\">tensions</a> that emerged between the <strong>UCI</strong> and <strong>WADA</strong> in the aftermath of <strong>Chris Froome’s</strong> salbutamol case. Froome exceeded the allowed limit for salbutamol in a test at the 2017 <strong>Vuelta a España</strong>, but he was ultimately cleared, with the UCI saying that it made a decision “having received WADA’s position.”</p>\n\n\n\n<p>E-mails between UCI President <strong>David Lappartient</strong> and then-WADA president <strong>Craig Reedie</strong> published by BBC Sport show tensions between the organizations following that announcement. Reedie seemed to take issue with what he saw as the UCI shifting responsibility to WADA.</p>\n\n\n\n<p>“The UCI was the results management authority with exclusive jurisdiction over the case and all relevant elements at its disposal,” Reedie wrote in an email to Lappartient. “If the UCI … disagreed with WADA’s position, it was under no obligation to espouse it.”</p>\n\n\n\n<p>Lappartient responded by saying that the UCI had tried to “protect” WADA’s salbutamol regime despite having reservations about it and also expressed frustration with the “lack of public solidarity from WADA.”</p>\n\n\n\n<p>“The fact the UCI ‘did not attribute [its] decision to any systemic failing’ was not because it does not have concerns about your salbutamol regime, but rather because it elected not to air these in a written document sent to an athlete,” Lappartient wrote.</p>\n\n\n\n<h3>Buchmann extends</h3>\n\n\n\n<p><strong>Emanuel Buchmann</strong>, who is hoping to contend for the general classification at the upcoming <strong>Giro d’Italia</strong>, has extended his contract with <strong>Bora-Hansgrohe</strong>. The 26-year-old German will ride on with the German WorldTour squad through 2024.</p>\n\n\n\n<p>Buchmann has been with the team since 2015 and in that time has developed into one of its top GC riders. In a particularly impressive 2019 campaign, he finished on the overall podium at the <strong>Itzulia Basque Country</strong> and the <strong>Critérium du Dauphiné</strong> before riding to fourth overall at the <strong>Tour de France</strong>.</p>\n\n\n\n<p>“Last year was quite difficult for me, and it’s in difficult times, and not necessarily in the good times, that it becomes noticeable whether a partnership still harmonizes,” said Buchmann, whose 2020 campaign was marred by crashes. “The support that I received showed me that I am in the right team. What Ralph Denk and Dan Lorang made possible ahead of the Tour was great, even if it didn’t ultimately lead to success. I feel very comfortable and we still have a big common goal, the Tour de France podium, which we will now continue to work towards.”</p>\n\n\n\n<h3>Spreafico receives a three-year ban</h3>\n\n\n\n<p><strong>Matteo Spreafico</strong>, who registered two adverse analytical findings for Enobosarm (ostarine) during last year’s <strong>Giro d’Italia</strong>, has received a three-year ban.</p>\n\n\n\n<p>The 28-year-old Italian has not raced since October 22 of 2020, and he was fired from <strong>Vini Zabù</strong> after his doping positive. He would ultimately be the first of two Vini Zabù riders in a 12-month period to return adverse analytical findings after Matteo De Bonis tested positive for EPO in February. <a href=\"https://cyclingtips.com/2021/04/vini-zabu-suspended-for-30-days/\" target=\"_blank\">The team has since received a suspension</a> from the UCI.</p>\n\n\n\n<p>Spreafico’s ban will run through October 21 of 2023.</p>\n\n\n\n<h2>Meme of the Day</h2>\n\n\n\n<p>Helpful stuff from Phil Gaimon for anyone trying to figure out what positions are allowed on the bike.</p>\n\n\n<blockquote>\n<div> <a href=\"https://www.instagram.com/p/COcKeCelh3R/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> \n<div>\n<div></div>\n<div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div></div>\n<div></div>\n<div>\n<div> View this post on Instagram</div>\n</div>\n<div></div>\n<div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n</a><p><a href=\"https://www.instagram.com/p/COcKeCelh3R/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"></a></p>\n<p><a href=\"https://www.instagram.com/p/COcKeCelh3R/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"></a></p>\n<p><a href=\"https://www.instagram.com/p/COcKeCelh3R/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"></a></p>\n<p><a href=\"https://www.instagram.com/p/COcKeCelh3R/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"></a></p>\n<p><a href=\"https://www.instagram.com/p/COcKeCelh3R/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"></a></p>\n<p><a href=\"https://www.instagram.com/p/COcKeCelh3R/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"></a></p>\n<p><a href=\"https://www.instagram.com/p/COcKeCelh3R/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Phil Gaimon (@philgaimon)</a></p>\n</div>\n</blockquote>\n<p> </p>\n\n\n<h2>In case you missed it …</h2>\n\n\n\n<ul><li><strong>Real-world testing</strong> sheds light on <a href=\"https://cyclingtips.com/2021/05/real-world-aero-testing-which-hand-positions-are-fastest/\" target=\"_blank\">which aero hand positions are the fastest</a>. </li><li><strong>Allied Cycle Works</strong> has launched a chain lube <a href=\"https://cyclingtips.com/2021/05/allied-cycle-works-launches-grax-chain-lube-optimised-for-gravel/\" target=\"_blank\">optimized for gravel</a>.</li><li>Matt de Neef has your <a href=\"https://cyclingtips.com/2021/05/preview-your-stage-by-stage-breakdown-of-the-2021-giro-ditalia-course/\" target=\"_blank\">stage-by-stage</a> breakdown of the 2021 <strong>Giro d’Italia</strong> route.</li><li>Watch <strong>Vasek Kolár</strong> push a gravel bike <a href=\"https://cyclingtips.com/2021/05/watch-a-gravel-bike-get-pushed-to-its-limit-by-a-trials-world-champ/\" target=\"_blank\">to its limits</a>.</li><li>As James Huang writes, <strong>Vittoria</strong> has <a href=\"https://cyclingtips.com/2021/05/vittoria-purchases-legendary-tubular-brand-a-dugast/\" target=\"_blank\">purchased</a> <strong>A. Dugast</strong>.</li></ul>\n\n\n    <div>\n    <div>\n\t\n\n\n\n<h2>GET THE DAILY NEWS DIGEST DELIVERED TO YOUR INBOX!</h2>\n\n\n\n<p>Enter your email address to have the Daily News Digest delivered directly to your inbox and receive instant access to comment on any article on CyclingTips.com</p>\n\n\n\n\n\n    \n    <div>\n        <div>\n            <a>Sign Up</a>\n        </div>\n    </div>\n    \n\n\n\n    </div>\n    </div>\n\t\n<p>The post <a href=\"https://cyclingtips.com/2021/05/bernal-and-sivakov-will-share-leadership-for-ineos-at-the-giro-daily-news/\">Bernal and Sivakov will share leadership for Ineos at the Giro: Daily News</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4d678b38c41d69e982f70a16678a61f351aa82ad436939ae04384aba178f7f26","category":"Cycling"}