{"title":"Texas abortion ban prompts Salesforce to help employees, families “exit” state","link":"https://arstechnica.com/?p=1793991","date":1631535732000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1233172256-800x532.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1233172256.jpg\">Enlarge</a> <span>/</span> Protesters hold up signs as they march down Congress Ave at a protest outside the Texas state capitol on May 29, 2021 in Austin, Texas. Thousands of protesters came out in response to a new bill outlawing abortions after six weeks was signed into law by Texas Governor Greg Abbot. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/protesters-hold-up-signs-as-they-march-down-congress-ave-at-news-photo/1233172256\">Sergio Flores/Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Salesforce CEO Marc Benioff confirmed late on Friday that his company would pay for employees and their families to relocate out of Texas if they are concerned about their ability to seek reproductive health care. The move comes after the state’s anti-abortion law went into effect earlier this month and the US Supreme Court refused to block the law.</p>\n<p>“Ohana if you want to move we’ll help you exit TX. Your choice,” Benioff said in a <a href=\"https://www.cnbc.com/2021/09/10/salesforce-offers-to-relocate-employees-from-texas-after-abortion-bill.html\">tweet</a>, using the Hawaiian word for “family.” (Benioff and Salesforce have a <a href=\"https://www.sfgate.com/business/article/Salesforce-s-Hawaii-obsession-provokes-debate-13267251.php\">long obsession</a> with things Hawaiian.)</p>\n<p>Texas’ new law, known as Senate Bill 8, bans abortions as early as six weeks. That’s well before many women know they’re pregnant. Most women won’t be able to get an accurate result from an at-home pregnancy test until <a href=\"https://my.clevelandclinic.org/health/articles/7247-fetal-development-stages-of-growth\">three to four weeks</a> after the day of their last period, and those who don’t take a test won’t suspect anything until they miss a period four weeks in. Six weeks is so early that doctors don’t call it a fetus, they still call it an embryo. Six weeks is far too early for anyone to know whether the pregnancy won’t spontaneously abort itself. So effectively, the law gives women at most two weeks to decide whether to seek an abortion. It does not make exceptions for rape or incest, but does for medical emergencies.<span> </span></p></div><p><a href=\"https://arstechnica.com/?p=1793991#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1793991&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4d6a8c71eea01e6880b8a7784748284f4d6c8eeb1fe0062326b3d2f7470c78ff","category":"Tech"}