{"title":"Simulating policy options for improving household resilience to food demand shocks in the context of West Africa","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12407?af=R","date":1706676280000,"content":"<h2>Abstract</h2>\n<p>Policy interest often focuses on specific instruments that effectively enhance household resilience to food security shocks. Based on microeconomic household demand and resilience theory, this paper investigates to what extent increased household resilience capacities result in household food consumption being more robust to adverse food price and income shocks. Using nationally representative household data from the Ghana Living Standards Survey, baseline parameters estimated from a micro-econometric quadratic almost ideal demand system are used to simulate the impacts of income and price shocks on food demand of urban and rural non-poor as well as urban and rural poor households. We assess how policy instruments that increase household resilience capacities, proxied by the values of assets owned, livestock, or household crop buffer stocks, affect shocks' impacts on food demand. Results show that a 20% general increase in food prices induces a demand switch from all other foods to basic staples and miscellaneous foods while a 20% reduction in available food expenditure dampens demand for pulses, greens, protein foods, and oils. Policy instruments that increase assets, livestock, and crop stocks of only poor households are more beneficial to the urban poor—increasing their demand for greens, protein foods, and oils—than policy instruments that raise resilience capacities of all households. On the other hand, rural poor households' protein demand tends to be enhanced by a general increase in assets, livestock, and crop buffer stocks. These findings illustrate that governments in low-income countries should focus their policy efforts on ensuring food affordability by avoiding price peaks for those food commodities playing major roles in typical national diets. We also conclude that the ongoing Investment for Food and Jobs policy in Ghana helps improving poor households' resilience capacities by raising their buffer stocks, boosting their assets, or increasing the number of livestock kept.</p>","author":"Isaac Gershon Kodwo Ansah, \nCornelis Gardebroek, \nRico Ihle","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"4d6f62a4a5adbd922ba33ab2f047fd2b7ecb330e869730ae8245de7dd1ad9d88","category":"Environment"}