{"title":"The development of hepatic steatosis depends on the presence of liver-innervating parasympathetic cholinergic neurons in mice fed a high-fat diet","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002865","date":1729605600000,"content":"<p>by Jiyeon Hwang, Junichi Okada, Li Liu, Jeffrey E. Pessin, Gary J. Schwartz, Young-Hwan Jo</p>\r\n\r\nHepatic lipid metabolism is regulated by the autonomic nervous system of the liver, with the sympathetic innervation being extensively studied, while the parasympathetic efferent innervation is less understood despite its potential importance. In this study, we investigate the consequences of disrupted brain–liver communication on hepatic lipid metabolism in mice exposed to obesogenic conditions. We found that a subset of hepatocytes and cholangiocytes are innervated by parasympathetic nerve terminals originating from the dorsal motor nucleus of the vagus. The elimination of the brain–liver axis by deleting parasympathetic cholinergic neurons innervating the liver prevents hepatic steatosis and promotes browning of inguinal white adipose tissue (ingWAT). The loss of liver-innervating cholinergic neurons increases hepatic <i>Cyp7b1</i> expression and fasting serum bile acid levels. Furthermore, knockdown of the G protein-coupled bile acid receptor 1 gene in ingWAT reverses the beneficial effects of the loss of liver-innervating cholinergic neurons, leading to the reappearance of hepatic steatosis. Deleting liver-innervating cholinergic neurons has a small but significant effect on body weight, which is accompanied by an increase in energy expenditure. Taken together, these data suggest that targeting the parasympathetic cholinergic innervation of the liver is a potential therapeutic approach for enhancing hepatic lipid metabolism in obesity and diabetes.","author":"Jiyeon Hwang","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"4d7008cba9b20f8fe95525c627f554d1ad5028985f0b111eb6556bff28055680","category":"Environment"}