{"title":"Mac OS X: An act of desperation that formed the foundation for the modern Mac","link":"https://www.macworld.com/article/340370/an-act-of-desperation-20-years-ago-formed-the-building-block-for-the-modern-mac.html","date":1616576400000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>To understand the desperation Apple felt in the mid-to-late 1990s, look no further than to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/kevinpurcell/status/1111765780855554050&amp;xcust=1-1-340370-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">one particular t-shirt</a>. On the front was a 3-D rendered numeral eight. On the back, the words &ldquo;Hands-On Experience&rdquo; and Mac OS 8 logo.</p>\n\n\n\n<p>At Apple&rsquo;s Worldwide Developer Conference in June 1996, many of us got to experience the future of the Mac for the first time. We got the t-shirt for test driving Apple&rsquo;s transformational new operating system, one that replaced the woefully out-of-date classic Mac OS with something that could compete with Microsoft. The operating system was nicknamed Copland and it never shipped. The &ldquo;Hands-On Experience&rdquo; shirts and an accompanying book, &ldquo;Mac OS 8 Revealed,&rdquo; were as good it was ever going to get.</p>\n\n\n\n<p>With its back against the wall and its internal software development failing, Apple was left with only desperation moves. Fortunately, it made a good one, resulting in <a href=\"https://www.macworld.com/article/1014500/12xpreview.html\">Mac OS X 10.0</a>, which shipped 20 years ago this week.</p>\n\n\n\n<h2 id=\"classic-mac-os-had-to-die\">Classic Mac OS had to die</h2>\n\n\n\n<p>Classic Mac OS&mdash;the Mac operating system before OS X&mdash;was built on a shaky foundation. As revolutionary as the original Mac was, it was also an early-1980s project that didn&rsquo;t offer all sorts of features that would become commonplace by the late 1990s.</p>\n\n\n\n<p>That operating system had been originally designed to fit in a small memory footprint and run one app at a time. Its multitasking system was problematic; clicking on an item in the menu bar and holding down the mouse button would effectively stop the entire computer from working. Its memory management system was primitive. Apple needed to make something new, a faster and more stable system that could keep up with Microsoft, which was coming at Apple with the user-interface improvements of Windows 95 and the modern-OS underpinnings of Windows NT.</p>\n\n\n\n<p>That&rsquo;s where the t-shirt came in. Copland was intended to be Mac OS 8, and it was supposed to ship in the middle of 1996. It was going to offer pre-emptive multitasking, protected memory, a redesigned user interface with multiple themes, intelligent search, broad support for OpenDoc (if you don&rsquo;t know, don&rsquo;t ask), and much more. The ship date slipped to the middle of 1997, and some of Copland&rsquo;s more ambitious features were pushed off even further to a theoretical OS 9 code-named Gershwin. And then, a few months after Apple handed out those t-shirts, it killed the entire project.</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/copland-tshirt-kpurcell.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"Mac OS 8 Copland t-shirt\" class=\"wp-image-100060033\"><figcaption><p>A replica of the Mac OS 8 Copland t-shirt given to select WWDC attendees in 1996.</p></figcaption></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/kevinpurcell/status/1111765780855554050&amp;xcust=1-1-340370-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\" class=\"imageCredit\" rel=\"nofollow\">Dr. Kevin Purcell (via Twitter)</a></div>\n\n\n\n<p>What instead shipped as Mac OS 8 in the summer of 1997 was a version of the classic Mac OS, dressed up in the clothes of Copland. The advanced search technology, redesigned filesystem, revamped multitasking, and memory protection were nowhere to be found. While it offered some improvements over System 7, Mac OS 8 did nothing to solve Apple&rsquo;s larger operating-system problem.</p>\n\n\n\n<h2 id=\"shopping-for-a-future\">Shopping for a future</h2>\n\n\n\n<p>In a spectacularly humbling moment for Apple, the company began searching for a company from which it could buy or license an operating system or, at the least, use as the foundation of a new version of Mac OS. The company&rsquo;s management, led by CEO Gil Amelio and CTO Ellen Hancock, clearly had come to the conclusion that Apple itself was incapable of building the next-generation Mac OS.</p>\n\n\n\n<p>Though there were a lot of wild ideas thrown around (building Mac OS atop Microsoft&rsquo;s Windows NT kernel and rebuilding the platform using Java were two of them), the two most obvious targets were small companies with operating systems that had the modern features Apple wanted most. Both were, perhaps unsurprisingly, being run by former Apple executives.</p>\n\n\n\n<p>In one corner was <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Be_Inc.&amp;xcust=1-1-340370-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">Be, Inc.</a>, run by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://medium.com/@gassee&amp;xcust=1-1-340370-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">Jean-Louis Gasse&eacute;</a>. Be was developing a new, modern graphical interface from scratch, and it ran on the same PowerPC chips Apple used at the time. You could even reboot from Mac OS into BeOS on certain Power Mac models. BeOS was gorgeous, fast, and offered advanced search capabilities that were far ahead of its time. Its biggest liability was that it was unfinished, so if Apple were to buy it, there would be a huge amount of development ahead of it.</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/steve-jobs-time.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060034\"><figcaption><p>The NeXT deal not only gave Apple a modern Mac operating system, it brought Steve Jobs back to Apple.</p></figcaption></figure><p class=\"imageCredit\">Time</p></div>\n\n\n\n<p>In the other corner was <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/NeXT&amp;xcust=1-1-340370-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">NeXT</a>, founded by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://computerhistory.org/blog/steve-jobs/&amp;xcust=1-1-340370-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">Steve Jobs</a>. Although perhaps a bit less cutting-edge than BeOS, NextStep was a more complete package, and it also had the Steve Jobs factor. Amelio and Hancock were apparently convinced, and brokered a $400 million <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://web.archive.org/web/20020208190346/http://product.info.apple.com/pr/press.releases/1997/q1/961220.pr.rel.next.html&amp;xcust=1-1-340370-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">deal</a> to buy NeXT and bring Jobs back to Apple in an advisory role.</p>\n\n\n\n<p>You know what eventually happened to Jobs. He was an &ldquo;advisor&rdquo; who became a board member who became the interim CEO who ultimately transformed Apple into one of the world&rsquo;s biggest and most regarded companies by the time of his death in 2011.</p>\n\n\n\n<p>What you might not know is that NextStep, that operating system that came over in the deal, was essentially the core of Mac OS X. The software decisions made at NeXT in the 1990s reverberate to this day, in code that runs not just on the Mac, but on all of Apple&rsquo;s devices&mdash;iPhone, iPad, Apple Watch, and Apple TV.</p>\n\n\n\n<h2 id=\"the-long-road-to-os-x\">The long road to OS X</h2>\n\n\n\n<p>Apple bought NeXT in December of 1996. Mac OS X 10.0 shipped in March of 2001. As powerful and sophisticated as NextStep was, it took the new Apple software organization&mdash;led by NeXT&rsquo;s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.nextequity.com/avie&amp;xcust=1-1-340370-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">Avie Tevanian</a>&mdash;more than four years from acquisition to a &ldquo;completed&rdquo; version of Mac OS X. (And stopping the clock 20 years ago this week is probably unfair. I&rsquo;d mark the end of the Mac OS X transition as April 2002, when <a href=\"https://www.macworld.com/article/151007/06wwdc.html\">Steve Jobs held a funeral for Mac OS 9</a> because <a href=\"https://www.macworld.com/article/199938/osx-10-1.html\">OS X was finally good enough</a>.)</p>\n\n\n\n<p>What took so long? The NeXT interface needed to be revamped to resemble Mac OS in order to get Mac users on board with the new operating system. This was an area where Mac OS really won the day. With each successive preview release, NeXT&rsquo;s influence faded away. Perhaps its greatest interface legacy on macOS today is the Dock, which never existed before OS X.</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macos-big-sur-dock.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"macOS Big Sur Dock\" class=\"wp-image-100060035\"><figcaption><p>NeXT&rsquo;s greatest legacy is on every Mac today: the Dock.</p></figcaption></figure><p class=\"imageCredit\">Apple</p></div>\n\n\n\n<p>There were also several false starts, including Rhapsody and Mac OS X Server, weird hybrids of NextStep and Mac OS that didn&rsquo;t get it right. Apple realized that it couldn&rsquo;t just ship NeXT&rsquo;s app-development environment, the Yellow Box&ndash;the ancestor of present-day Apple&rsquo;s Cocoa&ndash;and expect the developers of all Mac apps to completely rewrite their software for a new platform.</p>\n\n\n\n<p>Instead, Apple had to create a layer cake of an operating system, with Yellow Box (which allowed NextStep developers such as The Omni Group to become fledgling Mac developers) living alongside Blue Box, a modernized version of the existing Mac OS application environment. By creating Carbon, a set of modernized Mac-style interfaces, Mac developers could modify their existing apps to run on Mac OS X, rather than needing to rewrite them.</p>\n\n\n\n<p>And of course, there was Classic, a virtualized version of the original Mac OS that would be capable of running unmodified apps. Using Classic was a supremely weird experience, but it did provide a bridge for people who couldn&rsquo;t give up their old software.</p>\n\n\n\n<p>This is one big reason why Mac OS X took as long as it did to make it out into the world. It needed to update the NeXT app approach (which survives to this day across Apple&rsquo;s platforms) while building multiple layers of compatibility to give Mac software a place to run. And until Microsoft and Adobe publicly committed to building OS X native versions of their apps, it was an open question if Apple could pull it off.</p>\n\n\n\n<h2 id=\"more-than-steve-jobs\">More than Steve Jobs</h2>\n\n\n\n<p>It&rsquo;s often said that Steve Jobs was the most valuable asset in the Apple-NeXT deal. And it&rsquo;s impossible to argue that, given what happened to Apple in the several years after the deal.</p>\n\n\n\n<p>But it&rsquo;s also an unfair to point to make. Apple&rsquo;s entire operating-system strategy for the last 20 years has used NextStep as a foundation. Every iPhone app developer who uses classes such as NSObject, NSString, and NSArray <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/documentation/foundation/nsurlsession&amp;xcust=1-1-340370-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">are staring it right in the face</a>: the NS prefix comes from <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Foundation_Kit&amp;xcust=1-1-340370-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">NextStep</a>.</p>\n\n\n\n<p>So when we celebrate the 20th anniversary of Mac OS X, it&rsquo;s important to realize <em>what</em> we&rsquo;re celebrating. We&rsquo;re celebrating a software release that was the culmination of Steve Jobs&rsquo;s return to Apple. We&rsquo;re celebrating the operating system we still use, two decades later. But we&rsquo;re also celebrating the foundation of iOS, iPadOS, tvOS, and watchOS.</p>\n\n\n\n<p>In that way, this isn&rsquo;t just the 20th anniversary of Mac OS X 10.0. It&rsquo;s the 20th anniversary of modern Apple, and the end of the dark days when Apple couldn&rsquo;t fix its own operating system. (Been there, saw that, got the t-shirt.)</p>\n</div></body></html>","author":"Jason Snell","siteTitle":"How to use Sticky and Slow Keys in macOS to make you a better typist","siteHash":"a7879ba5f180a82d66aec288ff9d7878ee4e9167517300eaf1008def9c1281a2","entryHash":"4d7589cca6168e841be867f6c1e43376dcea0c0e9620b8aa9d16ab0311b79380","category":"Apple"}