{"title":"Effects of extreme temperatures and recovery potential of Gongolaria barbata from a coastal lagoon in the northern Adriatic Sea: an ex situ approach","link":"https://academic.oup.com/aob/article/134/3/415/7628933?rss=1","date":1710374400000,"content":"<span><div>Abstract</div><div>Background and Aims</div>Globally, rising seawater temperatures contribute to the regression of marine macroalgal forests. Along the Istrian coastline (northern Adriatic), an isolated population of <span>Gongolaria barbata</span> persists in a coastal lagoon, representing one of the last marine macroalgal forests in the region. Our objective was to examine the impact of extreme temperatures on the morphology and physiology of <span>G. barbata</span> and test its potential for recovery after simulating marine heatwave (MHW) conditions.<div>Methods</div>We explored the occurrence of marine heatwaves in southern Istria, adjacent to the study area, in addition to extreme temperatures inside the area itself. Subsequently, we performed a thermotolerance experiment, consisting of a stress and recovery phase, in which we exposed <span>G. barbata</span> thalli to four extreme (28, 30, 32 and 34 °C) and one favourable (18 °C) temperature. We monitored morphological and physiological responses.<div>Key Results</div>Our findings indicate a significant rise in frequency, duration and intensity of MHWs over decades on the southern Istrian coast. Experimental results show that <span>G. barbata</span> demonstrates potential for both morphological and physiological recovery after exposure to temperatures as high as 32 °C. However, exposure to 34 °C led to thallus decay, with limited ability to regenerate.<div>Conclusions</div>Our results show that <span>G. barbata</span> has a remarkable resilience to long-term exposure to extreme temperatures ≤32 °C and suggest that short-term exposure to temperatures beyond this, as currently recorded inside the lagoon, do not notably affect the physiology or morphology of local <span>G. barbata</span>. With more MHWs expected in the future, such an adapted population might represent an important donor suitable for future restoration activities along the Istrian coast. These results emphasize the resilience of this unique population, but also warn of the vulnerability of marine macroalgal forests to rising seawater temperatures in rapidly changing climatic conditions.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"4d7d3c3e0c7b0fcdcc2ce2b5b119f3fb42399e590fbb8be0a7709ac1ee7c39c0","category":"Environment"}