{"title":"Forbes: TikTok Creators’ Private Financial Information Stored in China","link":"https://www.forbes.com/sites/alexandralevine/2023/05/30/tiktok-creators-data-security-china/?sh=77dce1897048","date":1685552387000,"content":"\n<p>Alexandra S. Levine, reporting for Forbes:</p>\n\n<blockquote>\n  <p>Over the past several years, thousands of TikTok creators and\nbusinesses around the world have given the company sensitive\nfinancial information — including their social security numbers\nand tax IDs — so that they can be paid by the platform. But\nunbeknownst to many of them, TikTok has stored that personal\nfinancial information on servers in China that are accessible by\nemployees there, Forbes has learned.</p>\n\n<p>TikTok uses various internal tools and databases from its\nBeijing-based parent ByteDance to manage payments to creators who\nearn money through the app, including many of its biggest stars in\nthe United States and Europe. The same tools are used to pay\noutside vendors and small businesses working with TikTok. But a\ntrove of records obtained by Forbes from multiple sources across\ndifferent parts of the company reveals that highly sensitive\nfinancial and personal information about those prized users and\nthird parties has been stored in China. The discovery also raises\nquestions about whether employees who are not authorized to access\nthat data have been able to. It draws on internal communications,\naudio recordings, videos, screenshots, documents marked\n“Privileged and Confidential,” and several people familiar with\nthe matter.</p>\n\n<p>In testimony before Congress earlier this year, TikTok CEO Shou Zi\nChew claimed U.S. user data has been stored on physical servers\noutside China. “American data has always been stored in Virginia\nand Singapore in the past, and access of this is on an as-required\nbasis by our engineers globally,” he said under oath at a House\nhearing in March.</p>\n</blockquote>\n\n<p>TikTok should be banned in the United States, and Chew should be charged with perjury. This is not complicated.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/31/tiktok-creators-financial-info-china\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"4d8a20d2eea2f1b1743843f488596c43c44f44866bf1016435c22210908202dd","category":"Tech"}