{"title":"Strategies for Professors on How to Mitigate the Negative Effects of ChatGPT in Higher Education","link":"https://www.preprints.org/manuscript/202410.0010/v1","date":1727776330000,"content":"The research identified challenges faced by teachers, suggested effective pedagogical strategies, and proposed practical recommendations to mitigate the negative impacts of ChatGPT in higher education. These strategies promote the ethical and responsible use of artificial intelligence, ensuring academic integrity. The article deeply analyzes pedagogical strategies to prevent plagiarism and promote academic integrity, offering a practical guide for educators on how to ethically integrate AI into their pedagogical practices. By filling a gap in the literature, the study contributes to the discussion on the ethical use of AI in education, offering evidence-based recommendations and fostering critical reflection on the impact of emerging technologies in the academic environment. The research highlights effective pedagogical strategies to mitigate the negative effects of ChatGPT, promoting an educational approach that prevents plagiarism and encourages the ethical use of AI. Through documentary analysis of scientific articles and data coding according to Bardin's methodology, patterns and trends were identified for the development of innovative pedagogical practices. The qualitative approach included a literature review and content analysis of articles published in the last five years. The results indicated that, although ChatGPT can personalize teaching and support content development, it also increases the risk of plagiarism and reduces students’ critical engagement. To combat these challenges, it is suggested to create personalized assessments, promote critical thinking, and use plagiarism detection tools. Continuous teacher training and the development of clear policies on the ethical use of AI are essential to ensure academic integrity and quality of learning.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4d94d558aa85fbdacd10faff8f047c89db929d1aee0ca1e3858dba9654902aeb","category":"Interdisciplinary"}