{"title":"Assessing Climate Change Impacts on Crop Yields and Exploring Adaptation Strategies in Northeast China","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004063?af=R","date":1712410812000,"content":"<h2>Abstract</h2>\n<p>Northeast China (NEC) is the most prominent grain-producing region in China. However, it is currently facing significant impacts from climate change. Since the climate-related impacts on crop yield in this region are a major concern for society in the future, quantifying climate change impacts on crop yields in NEC is essential to ensure future food security. This study aimed to quantify the effects of future climate change on crop yields in NEC and explore adaptation strategies using the Crop Growth Model (PCSE) driven by downscaled CMIP6 climate projections under four Shared Socioeconomic Pathways (SSPs) scenarios during 2015–2100. Results showed that there could be average reductions in crop yields of 21.4% for maize and 4.2% for soybean by the year 2100 under SSP585 compared to the 2015 baseline. The increasing temperature was the dominant factor in reducing yields, although elevated CO<sub>2</sub> and precipitation offered partial compensation. The optimized planting date brought noticeable benefits for rice and soybean but had limited effects on maize due to heat stress. Relocating rice expansion eastward and implementing earlier planting increased yields by up to 50% but adversely decreased soybean and maize due to competition. This study enriches our comprehension of climate change impacts on NEC agriculture, while also quantifying potential benefits and constraints of evaluated adaptations. The proposed adaptations may help mitigate projected yield declines in other key agricultural regions across the globe. Adjusting crop management practices to capitalize on changing climate factors shows promise as a strategy for sustaining production globally.</p>","author":"Qingchen Xu, \nHongbin Liang, \nZhongwang Wei, \nYonggen Zhang, \nXingjie Lu, \nFang Li, \nNan Wei, \nShupeng Zhang, \nHua Yuan, \nShaofeng Liu, \nYongjiu Dai","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"4d9548f78f7bcb8a373468706568eba7aec03132974f63194784516ad450aafa","category":"Environment"}