{"title":"Pore Structure Characterization and Fractal Characteristics of Tight Limestone Based on Low Temperature Nitrogen Adsorption and Nuclear Magnetic Resonance","link":"https://www.preprints.org/manuscript/202405.1957/v1","date":1716977229000,"content":"Pore structure characterization and fractal analysis have great significance for understanding and evaluating tight limestone reservoirs. In this work, the pore structure of tight limestone is characterized combined with low-temperature nitrogen adsorption (LTNA) and low-field nuclear magnetic resonance (NMR), and the fractal dimension of tight limestone pore structure is discussed based on LTNA and NMR data. The results indicate that the pores of tight limestone have H3 and H4 types, the pore size distribution (PSD) of H3 type is a wave distribution ranging from 2 to 10 nm, and the PSD of H4 type is a unimodal distribution ranging from 2 to 10 nm. The transverse relaxation time (T2) spectrum of tight limestone shows single peak (DF), double peak (SF) and three peak (TF), and the T2 spectrums for micropores, mesopores and macropores range from 0.1 to 10 ms, from 10 to 100 ms, and greater than 100 ms, respectively. The LTNA fractal dimension of tight limestone (DL) ranges between 2.4446 and 2.7688, with an average of 2.5729, and the NMR fractal dimensions of micropores (DNMR1), mesopores (DNMR2) and macropores (DNMR3) are distributed between 0.3744 to 1.1293, 2.4263 to 2.9395 and 2.6582 to 2.9989, respectively. Moreover, there is no correlation between fractal dimension and permeability and porosity, a negative correlation between DL and average pore radius, a positive correlation between DL and specific surface area, and a positive correlation between DNMR2 and DNMR3 and micropore content, while DNMR2 and DNMR3 are negatively correlated with the content of mesopores and macropores.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4d970009ec3e2f961921f211d91fcbad3266634f57b8f8b760c6c5ce2acc3c9a","category":"Interdisciplinary"}