{"title":"Wilier announces the Rave SLR offering all-road and gravel racing in one","link":"https://cyclingtips.com/2021/10/wilier-announces-the-rave-slr-offering-all-road-and-gravel-racing-in-one/","date":1634050835000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Wilier-Rave-SLR-7-650x366.jpg\" /></div><h2>Wilier announces the Rave SLR offering all-road and gravel racing in one</h2><p>\n</p><p>Wilier Triestina has officially announced the Rave SLR gravel and all-road bike, which we saw at Eurobike back at the beginning of September. </p>\n\n\n\n<p>The Rave SLR is seemingly Wilier’s answer to the N+1 problem, doubling up as a gravel racing or all-road bike. As such, Wilier will offer the Rave SLR in both gravel and road builds, with groupsets, wheelsets, and integrated handlebar options to match each discipline. In the Rave SLR, Wilier says it set its sights on “creating a product with two separate souls, perfect for all-road, perfect for gravel, but the same incredible racing inclination.”</p>\n\n\n\n<p>At the heart of these gravel and all-road build options are the new Rave SLR frame and forks featuring truncated aero-tubing, integrated cable routing and clearance for wider tyres. Wilier says the new frame features the same lightweight and stiffness characteristics as its road racing frames, with a slightly higher stack and a shorter reach for a balanced geometry better suited to the Rave’s gravel and endurance focus. Wilier used the same carbon mix and construction technologies utilised in the <a href=\"https://cyclingtips.com/2019/06/wilier-zero-slr-2020-first-ride-review/\" target=\"_blank\">Zero SLR</a> and the <a href=\"https://cyclingtips.com/2021/06/wilier-filante-slr-review-superbike-pedigree-with-style-to-match/\" target=\"_blank\">Filante SLR</a> frames to hit those stiffness and low-weight targets with the new Rave SLR. Wilier says it “channelled all the experience gained in the use of technopolymers, mixing carbon with special viscoelastic fibres such as Liquid Crystal Polymers” to create a responsive and light frame. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Wilier-Rave-SLR-1-1340x754.jpg\" /><figcaption>The Rave SLR in gravel racing mode with J-Bar cockpit, Campagnolo Ekar groupset, and Shamal carbon wheels.  </figcaption></figure>\n\n\n\n<p>While by no means the lightest road frame ever, the Rave SLR’s claimed 950g frame weight and 415g fork have it at the pointy end of gravel frame weigh-ins, even if that is a full 225g more than the <a target=\"_blank\" href=\"https://cyclingtips.com/2021/10/2022-specialized-crux-review/\">new Specialized Crux</a> unveiled last week. Given that racing inclination in the geometry and frame characteristics and a relatively meagre 42mm of tyre clearance, the new Rave SLR is undoubtedly designed for the gravel racer rather than the bike packer and off-road explorer gravel rider. </p>\n\n\n\n<p>Unsurprisingly, Wilier offers a number of builds to hit those all-road or gravel racing specific setups with <a href=\"https://cyclingtips.com/2021/08/new-shimano-dura-ace-di2-r9200-and-ultegra-di2-r8100-everything-to-know/\" target=\"_blank\">Dura-Ace R9200 and Ultegra Di2 R8100</a>, <a href=\"https://cyclingtips.com/2020/09/new-campagnolo-ekar-groupset-brings-mechanical-13-speed-to-gravel/\" target=\"_blank\">Campagnolo Ekar</a>, and <a href=\"https://cyclingtips.com/2019/04/sram-force-etap-wireless-electronic-groupset-details-weights-prices/\" target=\"_blank\">SRAM Force Etap AXS</a> options. Furthermore, the new Rave SLR is available with Wilier’s J-bar or Zero-bar integrated handlebars. </p>\n\n\n\n<p>While both handlebar options fully integrate the cable routing for a sleek looking, even if not always popular, setup, the two bar options provide vastly different stem angles. The Zero-Bar, which first appeared on the Zero SLR performance road bike, offers a much lower front-end setup than the more radical-looking split stem on the J-Bar. That J-Bar was first introduced on Wilier’s more adventure-orientated Jena gravel bike and features slightly flared drops alongside a positive sloping stem. </p>\n\n\n\n<p>Wilier completes the build options with its own SLR 42 KC carbon wheels on the road build options, while the gravel builds feature Campagnolo’s Shamal Carbon or Miche Graff carbon offerings. The new bike is available in two colour ways, Sand/Green Matt for the gravel shredding setups and Black/Grey Matt for the road-going bikes.</p>\n\n\n\n<p>While Wilier promises versatility in the new Rave SLR frame and fork, the build options will ultimately somewhat narrow the end bike’s do-it-all ability, raising the question if Wilier has compromised the bike’s performance with a frame designed for two use cases. We hope to answer that question, with a Rave SLR review bike to expected to arrive soon.</p>\n\n\n\n<p>The new Rave SLR starts at €8,300 for a gravel-specific Campagnolo Ekar build or €9,000 for a road-going SRAM Force Etap AXS build. </p>\n\n\n\n<p><a href=\"https://wilier.com/en/my2022/int/racing-bikes/gravel-bikes/rave-slr?origin=int&amp;utm_campaign=Rave%2520SLR&amp;utm_source=cyclingtips.com&amp;utm_medium=takeover\" target=\"_blank\">Wilier.com</a></p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Wilier-Rave-SLR-9-1340x754.jpg\" /><figcaption>The all-road Dura-Ace Di2 build option.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Wilier-Rave-SLR-8-1340x754.jpg\" /><figcaption>The Rave SLR features a seat post clamp and dropped seat stays similar to those seen on the Zero SLR, but </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Wilier-Rave-SLR-4-1340x754.jpg\" /><figcaption>The new bike is available in two colour ways, Sand/Green Matt for the gravel shredding setups and Black/Grey Matt for the road going bikes.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Wilier-Rave-SLR-5-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Wilier-Rave-SLR-6-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Wilier-Rave-SLR-2-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Wilier-Rave-SLR-3-1340x754.jpg\" /><figcaption>That J-Bar has a distinctive stem design.</figcaption></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/10/wilier-announces-the-rave-slr-offering-all-road-and-gravel-racing-in-one/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4d98eafa1b5b1570051fe770dfe021a98d4aa067189b5ad53490af3ca03bcf30","category":"Cycling"}