{"title":"PSXII-24 Use of a commercial blend of tannins as feed additive for feed lot cattle on large pen trial improves carcass weight and carcass feed conversion","link":"https://academic.oup.com/jas/article/102/Supplement_3/778/7757898?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The utilization of commercial tannin extracts as feed additives holds promise for enhancing animal performance and health within commercial feedlot settings. This study aimed to assess the impact of a commercial tannin blend, SilvaFeed BX (Indunor, Buenos Aires, Argentina), sourced from quebracho and chestnut extracts along with saponins, on the performance of beef cattle. Nelore bullocks (n = 1,198) were allocated to 12 pens in a completely randomized block design, stratified by initial date, at a commercial feedlot facility in Goias State, Brazil. Each pen served as an experimental unit, with 10 pens housing 100 animals each and 2 pens containing 99 animals each. The experimental treatments included a Control diet with monensin alone [25 ppm/kg dry matter (DM)] or treated with BX (0.7 g/kg DM) on top of the control diet. Individual body weights (BW) were recorded at processing (initial BW; IBW) and shipment (final BW; FBW), while DM intake (DMI) was averaged per pen throughout the study duration. Carcass weight (CW) was individually measured at the packing plant, and carcass gain was calculated as the discrepancy between carcass weight and the estimated initial carcass weight, set at 50% of the IBW, aligning with customary practices for negotiating feeder cattle in Brazil. Statistical analyses were conducted using Proc Glimmix in SAS, treating pens and treatments as fixed effects and blocks as random effects, with IBW considered as a covariate. Residuals were assessed for normality, identifying three outliers. Mean comparisons were facilitated using LSMEANS. The results indicated that BX-treated cattle exhibited increased FBW (502.17 vs. 493.64 kg, <span>P</span> = 0.0992), carcass weight (275.76 vs. 268.78 kg, <span>P</span> = 0.0343), total carcass gain (107.52 vs. 100.54 kg, <span>P</span> = 0.0343), and improved carcass feed conversion (10.46 vs. 11.45 kg DM/kg; Table). Despite numerical differences, the limited number of replications were not enough to detect significant differences between treatments in average daily gain (<span>P</span> = 0.2419), DMI (<span>P</span> = 0.5508), feed conversion (<span>P</span> = 0.2641), or dressing (<span>P</span> = 0.3757). In conclusion, BX, a blend of tannins, exhibits potential for enhancing carcass weight and feed conversion efficiency in Nelore bullocks. Further investigations employing larger sample sizes are warranted to comprehensively elucidate its effects on other performance parameters.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4da126e38990dce519b20a5f19bf88487f5e032d121d87538d62fb1178afeaaa","category":"Environment"}