{"title":"Assessing Nitrogen Fertilization in Processing Pepper: Critical Nitrogen Curve, and Crop Yield Response","link":"https://www.preprints.org/manuscript/202409.1528/v1","date":1726794815000,"content":"Groundwater pollution in intensive horticultural areas is becoming an increasingly important problem. Therefore, this study evaluates nitrogen (N) fertilization in open field processing pepper crop in Extremadura, Spain. Previous research on the effect of N on sweet peppers grown in greenhouses is abundant, but data on outdoor cultivation, especially considering variety and site influences, are lacking. Field trials were conducted in 2020, 2021 and 2022 to determine the opti-mum N fertilizer rate for processing peppers, with the aim of reducing environmental impacts such as nitrate leaching while maintaining crop yields.\nDifferent N rates were applied in the trials, ranging from no N fertilizer to 300 kg N/ha. Meas-urements included crop yield, biomass, intercepted photosynthetically active radiation (PAR), and canopy cover. The study also developed a critical nitrogen curve (CNC) to determine the minimum N concentration required for optimal growth. The results showed that applying more than 200 kg N/ha did not significantly increase yield. Nitrogen-free treatments resulted in earlier fruit maturity, concentrating the harvest and reducing waste. In addition, excessive N application led to envi-ronmental problems such as groundwater contamination due to nitrate leaching.\nThe study concludes that outdoor pepper crops in this region can achieve optimal yields with lower N rates (around 120 kg N/ha) compared to current practices, thereby reducing environmental risks and fertilizer costs. It also established relationships between biomass, canopy cover, and N uptake to improve fertilization strategies. These data support future crop modelling and sustainable fertili-zation practices.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4da730a6a3e61ba2fb3cb8e90a73a0483259c40c431446d38d26faafabec7fa5","category":"Interdisciplinary"}