{"title":"Unsung heroes: Tsgabu Grmay on taking money from his dad to rent a bike to racing as a WorldTour pro","link":"https://www.cyclingtips.com/2023/03/unsung-heroes-tsgabu-grmay-on-taking-money-from-his-dad-to-rent-a-bike-to-racing-as-a-worldtour-pro/","date":1679485052000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/TSABU-GRMAY-scaled-e1679484914617.jpg?width=1200\" alt=\"Unsung heroes: Tsgabu Grmay on taking money from his dad to rent a bike to racing as a WorldTour pro\" /></figure><p>When <a href=\"https://www.cyclingtips.com/tag/tsgabu-grmay/\">Tsgabu Grmay</a> was a child growing up in Ethiopia, he would save up money he got from tips helping his father out at his garage so he could rent a bicycle.</p>\n<p>Grmay, who is riding his fifth season with the <a href=\"https://www.cyclingtips.com/tag/jayco-alula/\">Jayco-AlUla</a> this year, didn’t have his own bike as a child. The only way he could feed his passion for two wheels was to go down to the nearest bike rental place and get one out.</p>\n<p>While Grmay would save up his tips, which would go on biscuits and biking, it wasn’t enough to get him on the bike as much as he wanted, and he would sometimes resort to pinching a few coins from his father when he was asleep.</p>\n<p>“I’m not sure if it’s a good story or a bad story, but my father works at home and my mother she doesn’t because we have a large family and in the night when they sleep I would go to his pocket to steal some coins from his pocket just ride a bike,” Grmay told <em>CyclingTips</em>. “I had to rent a bike and pay money and when I asked my father and he doesn’t give me any because we are a poor family and it just 50 cents for him is too much so I would go into his pocket and steal some coins and ride a bike.</p>\n<p><strong>Also read:</strong> <a href=\"https://www.cyclingtips.com/2018/10/pioneer-a-candid-discussion-with-one-of-pro-cyclings-few-black-african-riders/\">Pioneer: A candid discussion with one of pro cycling’s few black African riders</a></p>\n<p>“When I started cycling my brother was riding and he had more salary which was good at that moment in Ethiopia. I was dreaming that if I become like him I will be in a local team and they will pay me, I would live in a team house and I will eat there for free and I would eat pasta.</p>\n<p>“I had this dream that was pushing me to be a cyclist. Every time I found a coin or someone gave one to me, when I was helping my father work in a garage changing tires, I would just buy bread or biscuits or ride a bike. Most of the time I just rode a bike.”</p>\n<p>Grmay’s father wouldn’t learn about his son’s penny-pinching ways until much later in life when he spoke about it in an earlier interview. Now that the 31-year-old is a WorldTour professional, it’s a story that they can laugh about.</p>\n<p>In any case, it was Grmay’s father — as well as his brother Solomon — that lit the flames of passion for cycling that he had as a child. The cycling scene in Ethiopia was still comparatively new compared to some of its near neighbors and his dad had been a part of the rise of it in Grmay’s home city of Mek’ele.</p>\n<p>“[Cycling] was my freedom and was my happiness. My father and my big brother were cyclists, so I grew up watching my older brother he was one of the good riders in the local races. I was a big fan, and I was just watching him growing up,” he said. “My father always traveled by bike around the city and went to work by bike. I grew up seeing pictures of my father when he was a cyclist, a long time ago. I’m talking about 40 years ago. He was one of the people who started local cycling in Mek’ele.</p>\n<p>“He was not the first, there were people before him, but he was there in the first five or six years when cycling started in my city. I was always listening to my father and my older brother talking about cycling and Eritrean cycling, there was a lot of history. So, I grew up with that.”</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1401352634.jpeg?width=730\" alt=\"Tsgabu Grmay at the Criterium du Dauphine in 2022\" width=\"1024\" height=\"683\" /><figcaption><span>Tsgabu Grmay at the Criterium du Dauphine in 2022</span> (Photo: Dario Belingheri/Getty Images)</figcaption></figure>\n<p>After spending much of his childhood getting out on a rented bike as much as he could, Grmay finally started cycling competitively aged 16. At the time, he was passionate about all sports and was also playing soccer, a hugely popular sport in Ethiopia.</p>\n<p>However, he was not particularly good at football and his friends and teammates were keen that he take up a different sport. Grmay remembers clearly the moment that he decided cycling was the sport for him, it came after a hefty fall while riding down a descent with his brother.</p>\n<p>“I just wanted to be a bike rider and my friends also told me to start cycling because I was not good at football,” Grmay laughed. “They were way better than me and I would sometimes make stupid mistakes and they say to me you have to leave this like you have to stop and ride your bike and just be a cyclist like my brother. I spoke to my brother, and he tested me and he told me’ you can be a good cyclist.’ From then he helped me, giving me a bike and jerseys. I was really happy.</p>\n<p>“I was loving it but on the second or third day, I had a big crash in a descent. I was on the gravel, and I was going fast. I don’t know what happened, I just hit a rock or something. My brother was happy because he said to me ‘now we have to choose’ because it is going be like this. The next day I had a lot of scratches, and I lost a lot of skin, it was a bad crash. I told him ‘no, I want to continue.’ He said to me from that moment I knew you were going to be a good cyclist.”</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-532509310.jpeg?width=730\" alt=\"Tsgabu Grmay turned professional with MTN-Qhubeka in 2012\" width=\"1024\" height=\"683\" /><figcaption><span>Tsgabu Grmay turned professional with MTN-Qhubeka in 2012</span> (Photo: Tim de Waele / Getty Images)</figcaption></figure>\n<p>Some 15 years on from that moment, Grmay is now an experienced professional after riding with several teams, including MTN-Qhubeka, Lampre-Merida, Trek-Segafredo, and Jayco-AlUla. After initially moving to Lucca in Italy, where the Qhubeka team was based, he moved to Girona five years ago.</p>\n<p>While living in Italy, he was constantly plagued by visa issues as he traveled to races outside of the country. In Spain, he was able to claim residency through a program for athletes. Now, as a Spanish resident, those visa issues that many riders from African countries endure are a thing of the past for him.</p>\n<p>Becoming a European professional was not on the radar for Grmay as a 16-year-old. His sights were initially set on riding with the UCI’s World Cycling Centre and racing at the African championships, things changed when he got his chance to ride with the squad in 2011. A year later, he would sign his first contract.</p>\n<p>“I just started cycling, because I love it and I just want to do it. My mother was against me because she wanted me to continue school and so did my father,” Grmay said. “When I decided to be a cyclist, I completely stopped school. In Ethiopia, you can stop whenever you want. I just wanted to ride a bike, I wanted to spend more time on the bike.</p>\n<p>“I became a good rider in local races, I started to win and I started to think I can be selected for the national team for the Africa championship and all these races. My brother went to the South Africa Training Center in 2007 and the UCI Aigle, because he was one of the good cyclists locally. I wanted to go to South Africa and also to Switzerland, but never I was never dreaming or thinking about doing the Tour de France or being in a WorldTour team.</p>\n<p>“We didn’t even know how it worked. The only international race we knew was Tour de France. When I went to UCI in 2011, I started to dream big because I see people coming from there that also step up to WorldTour and Continental teams. I said, ‘I can also do this,’ and that was the turning point.”</p>","author":"Sadhbh O'Shea","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4daf5ab5346c712f23a914b2ae03a5fcc53f2acbef685700789553ec829784a9","category":"Cycling"}