{"title":"The Summer of Cheech: Casa Verde, Crust Bikes, and a Limited Run of 24″ Romanceurs – Crust Bikes","link":"https://theradavist.com/2021/09/the-summer-of-cheech-casa-verde-crust-bikes-and-a-limited-run-of-24-romanceurs/?utm_source=rss&utm_medium=rss&utm_campaign=the-summer-of-cheech-casa-verde-crust-bikes-and-a-limited-run-of-24-romanceurs","date":1630497657000,"content":"<p>You may not know me but maybe you’ve heard of my company? Well, I’m using this article as the official announcement of my debutante summer, The Summer of Cheech. I’m Cheech, Co-Owner of <a href=\"https://crustbikes.com/\" target=\"_blank\">Crust Bikes</a> and Creator/ Designer of <a href=\"https://crustbikes.com/collections/casa-verde\" target=\"_blank\">Casa Verde</a>.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/PattyJJBlue_232a12e5-f22e-40c9-b268-fbb15922e095_1800x1800.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/08/JJJavichoPurple1_1800x1800-1.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/08/MamiFront2_1800x1800.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I am making up for a lost year and going full-steam ahead with the funnest summer ever and a cross-country road trip! Last year, although sad and miserable, it gave me space to look inward and push forward to express my visual creativity. I got into video-making for the Crust YouTube, worked with my sister to design some cool merch for Crust and I finally gave in and went full-throttle with Casa Verde. Casa Verde, my family name, is what I like to describe as a “non-traditional” cycling apparel brand. It was born from my dislike of lycra bicycle kits. I think the lycra bicycle uniform/kit is ugly, I also feel this way about mountain bike costumes. They scream  “I will sit in a landfill for decades”.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/CocoFront1best_1800x1800.jpeg\" /><img src=\"https://media.theradavist.com/uploads/2021/08/TigreFront_1800x1800.jpeg\" /></p>\n<p>I understand that these kits are “needed” when racing but can we just go back to luxurious wool bibs? When I got into big bikes as an adult, I didn’t see myself fitting into the skin-tight bicycle scene. I wanted to be comfortable, look cute, and wear natural fibers that didn’t stink. I wanted pieces that could take me from the bike to work, back on the bike, and out to meet friends for cocktails. It didn’t exist, so I took my very fancy Fashion Degree and went to work.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/DSC07952-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Casa Verde focuses on garment construction that is cycling-friendly i.e. gusset construction, butt and back pocket re-enforcement, roomy leg openings, back-snack pockets, etc. But I think what makes it different is that I deliver in Natural, Organic, and Recycled fabrics, I’m not afraid of color or prints, and you’ll see hints of my Andean Indigenous culture in trims. My designs often work around the textiles instead of the other way around. For example, the Cheypie Skort is made of linen.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/SFATerracottaFront1_1800x1800.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Linen is made of the flax plant, stronger and more moisture-wicking than cotton. It is constructed with a crotch gusset, back re-enforcements, ample pockets, and is lined in recycled antimicrobial spandex. So although the Cheypie may appear to be a flirty skort that’s easy on the eyes, she is a true performance piece, most recently used on the Great Divide tour by my two favorite riders of all-time, Arya Tenzin and Sam Scipio.  Apart from focusing on low-impact textiles, I have everything made in small batches by a WOC-owned factory in NYC.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/DSC07958-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>What I am designing might not be for everyone but following my instincts is something I learned from running Crust. This brings me to my 24” Romanceur. Yup, that’s right, 24”. Why? Because I am a full-grown adult at 4’10” and I deserve a sexy bike! The designer and co-owner of Crust Bikes, Matt, has made it his goal to create frames that will not only be comfortable for me but also look good. He started with the Evasion Step-Thru in 2016, The Cheecho in 2017, the mini XS Scapegoat in 2019, the mini Dreamer in 2019, and now the crown jewel, the 24” Romanceur in 2020.  When I saw the Romeo built up with its adorable 24” wheels it all made sense, my bike finally looked proportioned. And I finally had a frame with a straight top-tube (its the little things).</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/DSC07967-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>My Romeo is built to take me off-road into the trails. Most of the bikes I’ve owned have felt a little like monster trucks which have been nice because it gives me the confidence to roll over rocks and roots, but my first time on the Romeo felt completely different. It felt smaller in the best way. My first ride was at our local Richmond Mtb trails, Pocahontas. It flowed smoothly and because it felt smaller, I could throw it around a bit easier as opposed to just trucking through like I did with my Scapegoat. Because I can handle the Romeo easier I find myself wanting to jump more instead of just rolling. Sure it might be  1-2” of air but it’s something! It’s inspiring! Catering to a specific market, like petite bikes, for a tiny company like Crust is logistically difficult but we’re happy to share that a limited run of these 24” Romanceurs will be available for sale.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/DSC07960-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>You can catch me living my best life, slinging Crust, and Casa Verde if not, maybe I’ll be at your local trails on my Romeo, please come say hi and all shorties are welcome to test my bikes!</p>\n<p><em>Note on product photos: Casa Verde is family and it was so fun to collaborate with my siblings and mom on these product photos. We have the best time together.</em></p>\n<p>For those of you looking for some quick nerdy details about the 24” Romanceur, here you go:</p>\n<p><em>There will only be 8 of them. They will be available in Matte Clear or the same Turquoise as the most recent run of Romanceurs. There will only be one size which is a 48cm top tube with a 46cm seat tube. It will be thru axle 12×100 front/ 12×142 rear and will have all the internal routing, rack mounts, and lugs that any other Romeo has. For the rest of the nitty gritty details and some build notes you will have to wait until they are available on the site in the next couple of weeks. If you’re looking to be notified of when they’re available, your best bet is to keep up with us <a href=\"https://www.instagram.com/crustbikes/\" target=\"_blank\">on the Gram</a> and <a href=\"https://crustbikes.com/\" target=\"_blank\">sign up for our Gossip newsletter.</a></em></p>\n<p> </p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"4db57c3547423047d877e0d2d2c230c54c6036932b0967054f28dd4971e90491","category":"Cycling"}