{"title":"Google’s head of AR software quits, citing “unstable commitment and vision”","link":"https://arstechnica.com/?p=1952976","date":1689106568000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/01/44-1-1440x1080-800x600.jpeg\" alt=\"Promotional image of AR glasses.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/01/44-1-1440x1080.jpeg\">Enlarge</a> <span>/</span> Product photography of the Google Glass wearable. (credit: Google)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google's head of operating system and software platforms for augmented and mixed reality devices, Mark Lucovsky, has left the company after months of turmoil for the company's mixed reality projects and staff. He publicly announced his departure in a <a href=\"https://twitter.com/marklucovsky/status/1678465552988381185\">tweet</a> on Monday:</p>\n<blockquote><p>I have decided to step away from my role at Google, where I was Senior Director of Engineering, responsible for OS and Software Platform for AR and XR devices. The recent changes in AR leadership and Google’s unstable commitment and vision have weighed heavily on my decision.</p></blockquote>\n<p>It's unclear exactly which leadership changes he's referring to, but it seems possible or even likely that he's talking about the recent departure of Clay Bavor, who had led Google's XR work since 2015. Bavor left the company in March of this year.</p>\n<p>Google was one of the pioneers of mass-market AR when it piloted Google Glass with developers in 2013, but things have been rocky of late. The company killed Glass, brought it back as an enterprise-only product, then <a href=\"https://arstechnica.com/gadgets/2023/03/google-glass-is-about-to-be-discontinued-again/\">killed it again</a>. Rumors swirled that the tech giant was working on a new AR product called <a href=\"https://arstechnica.com/gadgets/2022/01/first-details-leak-on-project-iris-googles-next-ar-headset/\">Project Iris</a>, but it was reportedly <a href=\"https://arstechnica.com/gadgets/2023/06/google-reportedly-gives-up-on-making-ar-glasses-for-the-third-time/\">canceled</a> this year amidst a wave of company layoffs.</p></div><p><a href=\"https://arstechnica.com/?p=1952976#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1952976&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4db6cda609c48e2be24e2b11aa558b85516f7848846e1470b411fd3784cf5879","category":"Tech"}