{"title":"A new Apple Watch Ultra is very very likely to arrive this year","link":"https://www.macworld.com/article/1997157/apple-watch-ultra-2-launch-2024-3d-printed-parts.html","date":1689612339000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Generally speaking, Apple’s smartwatches follow a predictable release schedule: since the Series 3, every standard model has come out one year after its predecessor. But the non-standard SE and Ultra models are more complicated to predict, and the latter in particular presents a conundrum. There’s only been one Ultra so far, for one thing, which means there’s no pattern to examine.</p>\n\n\n\n<p>One theory holds that, because it’s a more expensive version of the Apple Watch, customers will buy new Ultra units less frequently, and that the maker will follow a similar principle when bringing out new models: every other year, perhaps. But that theory is looking increasingly shaky, with a second major analyst now nailing his colors to the annual-refresh mast.</p>\n\n\n\n<p>In an investors’ note published this weekend (seen by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.gsmarena.com/apple_watch_ultra_2_to_have_3d_printed_parts_coming_later_this_year-news-59216.php&amp;xcust=1-1-1997157-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">GSMArena</a>), the enormously respected Ming-Chi Kuo firmly stated that Apple is working on a second version of the Apple Watch Ultra and that it will be released in the second half of 2023. As GSMArena notes, that almost certainly means the fall. We expect the <a href=\"https://www.macworld.com/article/1472709/apple-watch-series-9-rumors-specs-features-price-release.html\">Apple Watch Series 9</a> to debut alongside the <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15</a> at an event in September, and the new Ultra would fit in neatly with those launches.</p>\n\n\n\n<p>Kuo further reveals that as of this launch, the Apple Watch Ultra will feature 3D-printed parts for the first time. (He says this process will be used for “some of the titanium mechanical parts.”) This shouldn’t make a huge difference to customers, except insofar as costs and production times are likely to be trimmed. If it helps Apple to avoid a price rise, this will be good news.</p>\n\n\n\n<p>In terms of timing, Kuo’s claim corroborates an earlier prediction by Mark Gurman along the same lines. (In fact, Gurman was more specific, naming the <a href=\"https://www.macworld.com/article/1967628/new-apple-watch-ultra-fall-2023.html\">fall of 2023</a>.) With the two biggest names in the Apple predictions game now singing from the same hymn sheet, few would bet against the second Ultra appearing in two months.</p>\n\n\n\n<p>Still, lots can change in that time, and it remains possible that Gurman and Kuo’s information is sound right now but Apple’s plans will change. Any product can hit a delay, as we saw with the endlessly pushed-back Vision Pro; nothing is certain until somebody gets on stage and makes the official announcement, and maybe <a href=\"https://www.macworld.com/article/230469/apple-airpower-features-specs-price-faq.html\">not even then</a>. Still, if you’ve got your eye on a new Apple Watch Ultra it’s probably best to wait a couple of months.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4db6c3fd354bdf935587a6c5b08c3d25455e3a4ffeab14080ddcf99c564626f2","category":"Apple"}