{"title":"COVID-19 vaccination uptake among healthcare workers in Ghana: A comprehensive analysis of knowledge, attitude, perceived vaccine effectiveness, and health belief model constructs","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002738","date":1714658400000,"content":"<p>by Whiteson Mbele, Phyllis Dako-Gyeke, Andreas Ndapewa Frans</p>\r\n\r\nThe novel Coronavirus Disease 19 (COVID-19) caused devastating effects globally, and healthcare workers were among the most affected by the pandemic. Despite healthcare workers being prioritized in COVID-19 vaccination globally and in Ghana, hesitancy to receive the vaccines resulted in delayed control of the pandemic. In Ghana, healthcare workers had a vaccine acceptance of 39.3% before the vaccine rollout. Consequently, this study assessed the uptake of COVID-19 vaccination and associated factors among healthcare workers in Ghana in the post-vaccine roll-out period. This was an analytical cross-sectional study that used a semi-structured questionnaire to collect data on COVID-19 vaccination uptake and influencing factors. 256 healthcare workers were selected in Ayawaso West Municipality of Ghana using a stratified random sampling approach. Descriptive statistics were used to examine socio-demographic factors and Likert scale responses. Bivariable and Multivariable logistic regression were performed using IBM SPSS version 22 to identify predictors of vaccine uptake and a statistical significance was declared at p&lt;0.05. More than three-fourths of participants 220 (85.9%) had received at least one dose of the COVID-19 vaccination, while 36 (14.9%) were hesitant. More than half 139 (54.3%) had adequate knowledge about COVID-19 vaccination and the majority 188 (73.4%) had positive perceptions about its effectiveness. Moreover, 218 (85.2%) of HCWs had a positive attitude towards COVID-19 vaccination. Positive attitude towards COVID-19 vaccination (AOR = 4.3; 95% CI: 1.4, 13.0) and high cues to action (AOR = 5.7; 95% CI: 2.2, 14.8) were the factors that significantly predicted uptake of COVID-19 vaccination among healthcare workers. COVID-19 vaccination among HCWs in Ghana is promising. However, hesitancy to receive the vaccination among a significant proportion of HCWs raises concerns. To ensure vaccination of all healthcare workers, interventions to promote vaccination should target key determinants of vaccination uptake, such as attitude towards the vaccination and cues to action.","author":"Whiteson Mbele","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"4db91e72268b2b50e4b57e3065c0aebd91312cfa553e3e6dec23f301921dac87","category":"Environment"}