{"title":"Apple kills off Apple Card financing for SIM-free iPhones","link":"https://www.macworld.com/article/1958026/apple-kills-off-apple-card-financing-sim-free-iphones.html","date":1687179779000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>In a decision with intriguing strategic undertones, Apple has announced that, starting on 15 August, it will no longer offer financing to customers buying SIM-free iPhones. The <a href=\"https://www.macworld.com/article/233649/apple-card-monthly-payments-iphone.html\">Apple Card Monthly Installment</a> (ACMI) option will be limited to those committing to a connection with AT&amp;T, T-Mobile, or Verizon.</p>\n\n\n\n<p>The news, reported by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2023/06/15/apple-card-financing-sim-free-iphones/&amp;xcust=1-1-1958026-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">9to5Mac</a>, is a surprising change to the previous system. Until now Apple has been happy to provide financing to iPhone buyers who wish to “Connect to a carrier later,” which opens up the possibility of using any number of carriers or even using the device without a cellular connection, as long as they make the purchase online. (In-store ACMI purchases were already limited to carrier-connected iPhones.) The new system will effectively limit customers to the three big carriers.</p>\n\n\n\n<p>“Currently, carrier connection with AT&amp;T, T-Mobile, or Verizon is required for all iPhone purchases made with ACMI from Apple Store locations only,” Apple said in a note on its website. “Starting August 15, 2023, carrier connection with AT&amp;T, T-Mobile, or Verizon is required for all iPhone purchases made with ACMI.”</p>\n\n\n\n<p>It isn’t clear at this point–and Apple certainly hasn’t chosen to clarify–why the company is making this change, but 9to5Mac speculates that the carriers may have applied some pressure. The new policy is certainly beneficial to AT&amp;T, T-Mobile, and Verizon, which are likely to see an uptick in connections, more than it is to Apple’s customers. On the other hand, it’s difficult to imagine Apple getting pushed around in a market where it has significant leverage; maybe the company just hoped we wouldn’t notice.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4dc07b5e18c4a187f85ada18b7ca5c956548623fd276939df99a50ba7677f384","category":"Apple"}