{"title":"Cloning and functional analysis of the juvenile hormone receptor gene CsMet in Coccinella septempunctata","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae065/7704700?rss=1","date":1719964800000,"content":"<span><div>Abstract</div>The potential role of the juvenile hormone receptor gene (<span>methoprene-tolerant</span>, <span>Met</span>) in reproduction of <span>Coccinella septempunctata</span> L. (Coleoptera: Coccinellidae)<span>(Coleoptera: Coccinellidae),</span> was investigated by cloning, analyzing expression profiles by quantitative real-time PCR, and via RNA interference (RNAi). <span>CsMet</span> encoded a 1518-bp open reading frames with a predicted protein product of 505 amino acids; the latter contained 2 Per-Arnt-Sim repeat profile at amino acid residues 30–83 and 102–175. <span>CsMet</span> was expressed in different <span>C. septempunctata</span> larvae developmental stages and was most highly expressed in third instar. <span>CsMet</span> expression in female adults gradually increased from 20 to 30 d, and expression levels at 25 and 30 d were significantly higher than levels at 1–15 d. <span>CsMet</span> expression in 20-d-old male adults was significantly higher than in males aged 1–15 d. <span>CsMet</span> expression levels in fat body tissues of male and female adults were significantly higher than expression in the head, thorax, and reproductive system. At 5 and 10 d after <span>CsMet</span>-dsRNA injection, <span>CsMet</span> expression was significantly lower than the controls by 75.05% and 58.38%, respectively. Ovary development and vitellogenesis in <span>C. septempunctata</span> injected with <span>CsMet</span>-dsRNA were significantly delayed and fewer mature eggs were produced. This study provides valuable information for the large-scale rearing of <span>C. septempunctata</span>.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"4dc227b78e4db3744765f129807ec45ce87a1e794cc1da69973005607cea64dd","category":"Environment"}