{"title":"A network-based modeling framework reveals the core signal transduction network underlying high carbon dioxide-induced stomatal closure in guard cells","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002592","date":1714572000000,"content":"<p>by Xiao Gan, Palanivelu Sengottaiyan, Kyu Hyong Park, Sarah M. Assmann, Réka Albert</p>\r\n\r\nStomata are pores on plant aerial surfaces, each bordered by a pair of guard cells. They control gas exchange vital for plant survival. Understanding how guard cells respond to environmental signals such as atmospheric carbon dioxide (CO<sub>2</sub>) levels is not only insightful to fundamental biology but also relevant to real-world issues of crop productivity under global climate change. In the past decade, multiple important signaling elements for stomatal closure induced by elevated CO<sub>2</sub> have been identified. Yet, there is no comprehensive understanding of high CO<sub>2</sub>-induced stomatal closure. In this work, we assemble a cellular signaling network underlying high CO<sub>2</sub>-induced stomatal closure by integrating evidence from a comprehensive literature analysis. We further construct a Boolean dynamic model of the network, which allows in silico simulation of the stomatal closure response to high CO<sub>2</sub> in wild-type <i>Arabidopsis thaliana</i> plants and in cases of pharmacological or genetic manipulation of network nodes. Our model has a 91% accuracy in capturing known experimental observations. We perform network-based logical analysis and reveal a feedback core of the network, which dictates cellular decisions in closure response to high CO<sub>2</sub>. Based on these analyses, we predict and experimentally confirm that applying nitric oxide (NO) induces stomatal closure in ambient CO<sub>2</sub> and causes hypersensitivity to elevated CO<sub>2</sub>. Moreover, we predict a negative regulatory relationship between NO and the protein phosphatase ABI2 and find experimentally that NO inhibits ABI2 phosphatase activity. The experimental validation of these model predictions demonstrates the effectiveness of network-based modeling and highlights the decision-making role of the feedback core of the network in signal transduction. We further explore the model’s potential in predicting targets of signaling elements not yet connected to the CO<sub>2</sub> network. Our combination of network science, in silico model simulation, and experimental assays demonstrates an effective interdisciplinary approach to understanding system-level biology.","author":"Xiao Gan","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"4dcaab8d9947f8ee0ec45e9e7c5c05d056fe62218fd7d51733dc028d0ff47f54","category":"Environment"}