{"title":"Trends in SARS-CoV-2 seroprevalence among pregnant women attending first antenatal care visits in Zambia: A repeated cross-sectional survey, 2021–2022","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003073","date":1712152800000,"content":"<p>by Elizabeth Heilmann, Tannia Tembo, Sombo Fwoloshi, Bupe Kabamba, Felix Chilambe, Kalubi Kalenga, Mpanji Siwingwa, Conceptor Mulube, Victoria Seffren, Carolyn Bolton-Moore, John Simwanza, Samuel Yingst, Ruchi Yadav, Eric Rogier, Andrew F. Auld, Simon Agolory, Muzala Kapina, Julie R. Gutman, Theodora Savory, Chabu Kangale, Lloyd B. Mulenga, Izukanji Sikazwe, Jonas Z. Hines</p>\r\n\r\nSARS-CoV-2 serosurveys help estimate the extent of transmission and guide the allocation of COVID-19 vaccines. We measured SARS-CoV-2 seroprevalence among women attending ANC clinics to assess exposure trends over time in Zambia. We conducted repeated cross-sectional SARS-CoV-2 seroprevalence surveys among pregnant women aged 15–49 years attending their first ANC visits in four districts of Zambia (two urban and two rural) during September 2021-September 2022. Serologic testing was done using a multiplex bead assay which detects IgG antibodies to the nucleocapsid protein and the spike protein receptor-binding domain (RBD). We calculated monthly SARS-CoV-2 seroprevalence by district. We also categorized seropositive results as infection alone, infection and vaccination, or vaccination alone based on anti-RBD and anti-nucleocapsid test results and self-reported COVID-19 vaccination status (vaccinated was having received ≥1 dose). Among 8,304 participants, 5,296 (63.8%) were cumulatively seropositive for SARS-CoV-2 antibodies from September 2021 through September 2022. SARS-CoV-2 seroprevalence primarily increased from September 2021 to September 2022 in three districts (Lusaka: 61.8–100.0%, Chongwe: 39.6–94.7%, Chipata: 56.5–95.0%), but in Chadiza, seroprevalence increased from 27.8% in September 2021 to 77.2% in April 2022 before gradually dropping to 56.6% in July 2022. Among 5,906 participants with a valid COVID-19 vaccination status, infection alone accounted for antibody responses in 77.7% (4,590) of participants. Most women attending ANC had evidence of prior SARS-CoV-2 infection and most SARS-CoV-2 seropositivity was infection-induced. Capturing COVID-19 vaccination status and using a multiplex bead assay with anti-nucleocapsid and anti-RBD targets facilitated distinguishing infection-induced versus vaccine-induced antibody responses during a period of increasing COVID-19 vaccine coverage in Zambia. Declining seroprevalence in Chadiza may indicate waning antibodies and a need for booster vaccines. ANC clinics have a potential role in ongoing SARS-CoV-2 serosurveillance and can continue to provide insights into SARS-CoV-2 antibody dynamics to inform near real-time public health responses.","author":"Elizabeth Heilmann","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"4dd0fb445ffefded74b2d8b16228329117c3268a36d7e858db7ffaca68847aeb","category":"Environment"}