{"title":"Delineation of the impacts of varying 6-benzylaminopurine concentrations on physiological, biochemical and genetic traits of different olive cultivars under in vitro conditions","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae038/7720909?rss=1","date":1721865600000,"content":"<span><div>Abstract</div><strong>Abstract</strong>. The plant growth regulator 6-benzylaminopurine (BAP) is an important component of plant nutrient medium with tendency to accelerate physiological, biochemical and molecular processes in woody plants such as olive. To date, limited knowledge is available on the role of BAP in mediating physiological, biochemical and genetic activities in olives under <span>in vitro</span> conditions. To cover this research gap, the current study was conducted with the objective of studying the role of BAP in regulating physiological traits (chlorophyll, CO<sub>2</sub> assimilation), antioxidant enzymes (superoxide dismutase, catalase and peroxidase), metabolic contents (starch, sucrose and flavonoids) and gene expression (<span>OeRbcl, OePOD10, OeSOD10, OeCAT7, OeSS4, OeSuSY7, OeF3GT and OeChlH)</span> under varying concentrations (0, 0.5, 1.5 and 2.5 mg L<sup>−1</sup>) within the provided <span>in vitro</span> conditions. The explants obtained from different olive cultivars (‘Leccino’, ‘Gemlik’, ‘Moraiolo’, ‘Arbosana’) were cultured on olive medium (OM) provided with different BAP concentrations using a two-factorial design, and data were analysed statistically. All traits increased significantly under <span>in vitro</span> conditions due to increasing concentrations of BAP; however, this increase was more dramatic at 2.5 mg L<sup>−1</sup> and the least dramatic at 0.5 mg L<sup>−1</sup>. Moreover, correlation, principal component analysis and heatmap cluster analysis confirmed significant changes in the paired association and expression of traits with changing BAP concentration and type of olive cultivars. Likewise, the expression of all genes varied due to changes in BAP concentration in all cultivars, corresponding to variations in physiological and biochemical traits. Moreover, the spectrographs generated via scanning electron microscopy further indicated the variations in the distribution of elements in olive leaf samples due to varying BAP concentrations. Although all cultivars showed a significant response to <span>in vitro</span> varying concentrations of BAP, the response of Arbosana was statistically more significant. In conclusion, the current study proved the dynamic impact of the varying BAP concentrations on regulating the physiological, biochemical, and molecular attributes of olive cultivars.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"4dd2ad2c3153463778cae53d92f959b3fb0e3e8ec74f16a4bf1e514425017e11","category":"Environment"}