{"title":"How to pedal without pain","link":"https://www.cyclist.co.uk/in-depth/how-to-pedal-without-pain","date":1709047176000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/how-to-pedal-without-pain\">How to pedal without pain</a></p>\n\n<p>For many people, pain is part of cycling, especially if you’re pushing for a new personal best, trying to add extra kilometres to your longest ride or mixing it up in the bunch at a race. However, even the most dedicated masochist should still be at liberty to decide the amount of pain inflicted upon them.</p>\n\n\n\n<p>If spending time on the bike is leaving your body aching there’s likely to be something amiss. Here we run through some of the most common cycling maladies, their likely causes and some possible solutions. </p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/best-foods-for-cycling\">10 essential foods for cyclists</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/tutorials/pilates-for-cyclists\">Pilates for cyclists: 6 moves to make you a stronger rider</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/tutorials/five-post-ride-leg-stretches-for-cyclists\">Post-ride leg stretches for cyclists</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/tutorials/how-to-stop-leg-cramp-when-cycling\">How to stop leg cramp when cycling</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/tutorials/how-yoga-can-benefit-cyclists\">How yoga can benefit cyclists</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>Neck and back pain</h2>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2016/06/02132330/rt_adobestock_50653000-889x970.jpg\" /></figure></div>\n\n\n<p>Slamming your stem might look very pro and help you achieve a low and aerodynamic position but unless you’ve got a <a href=\"https://www.cyclist.co.uk/tutorials/how-yoga-can-benefit-cyclists\" target=\"_blank\">yogi’s level of flexibility</a> it’s also liable to put a crick in your back.</p>\n\n\n\n<p>To get yourself down low you’ll need an extremely supple lower back along with well-above average hip flexibility and serious core strength.</p>\n\n\n\n<p>Also, as your front end gets lower you’ll have to crane your neck upwards more to compensate and see down the road. If you don’t fancy splashing out on a proper <a href=\"https://www.cyclist.co.uk/in-depth/man-vs-machine-inside-contemporary-bike-fitting\" target=\"_blank\">bike-fit</a>, at least be realistic about your levels of flexibility.</p>\n\n\n\n<p>If your position feels too low, either pop another spacer under your stem or flip it upside down to raise the handlebars and reassess. </p>\n\n\n\n<p>There are also simple exercises you can do to combat neck and back pain which can be done out of the saddle or in it as long as you’re not bombing along.</p>\n\n\n\n<p>One simple one is to turn your head gently to first the left and to the right while in the upright position, holding it for five seconds in each position. Make sure your chin is tucked in.</p>\n\n\n\n<p>This keeps your cervical spine – your neck – in a neutral position while giving your neck muscles a good stretch. Repeat the exercise three times to the left and three times to the right. </p>\n\n\n\n<p>Another good one to try is to simply roll your shoulders backwards four or five times. This makes your muscles in your neck contract and helps them to then relax, as well as loosening up your shoulder muscles and upper-back muscles in the process, helping to support the neck better. </p>\n\n\n\n<p>One muscle group that can be particularly affected by long hours in the saddle is your deep-neck flexor muscles, which need to be stimulated while you’re out on the road.</p>\n\n\n\n<p>You’ll find these deep in your throat, either side of your windpipe. To access these muscles all you need to do is pull your chin slightly back in a gentle movement.</p>\n\n\n\n<p>You’re not aiming to show off your double chin here – if you do end up with one, it means you’ve pushed your chin back too far.</p>\n\n\n\n<p>If you find yourself struggling, imagine you’re holding a tennis ball just between your chin and throat. At the same time imagine a string is pulling your head upwards from the crown of your head. This will elongate the back of your neck, stretching the muscles out.</p>\n\n\n\n<p>Now try to swallow. If it hurts, you know you’re targeting your deep-neck flexor muscles correctly. Hold this position for about 10 seconds intermittently throughout your ride, as well as doing it a few times before you get on the bike as a warm up.</p>\n\n\n\n<h2>Knee pain</h2>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2016/06/02132333/rt_adobestock_56843007-e1709038983408.jpg\" /></figure></div>\n\n\n<p>It’s very common for riders to push a far higher a gear than is necessary. While the likes of Chris Froome might be able to happily spin their legs at 100rpm for hours on end, that’s probably a little fast for the average road cyclist.</p>\n\n\n\n<p>However, selecting a lower gear and raising your cadence rather than grinding out the big gears will relieve pressure on your hips and help prevent stiff or tight muscles in your thighs.</p>\n\n\n\n<p>Essentially, letting the gears do the work rather than wrenching on the pedals will minimise the stresses caused to your body.</p>\n\n\n\n<p>Next time you go out for a ride, try riding a gear or two lower (easier) than normal – both on the climbs and the flat bits. It might feel inefficient at first, but you’ll soon get used to it and your body will thank you in the long run. </p>\n\n\n\n<p>Another common cause of knee pain is having your saddle set either too low or too high. As a very rough rule of thumb, when your foot is at the bottom of the pedal stroke, your leg should be almost straight but with a slight bend.</p>\n\n\n\n<p>A saddle that’s too low can cause pain or a feeling like a hot buzzing sensation in the front of your knee. If you think your saddle might be a bit low try raising it 5mm at a time.</p>\n\n\n\n<p>Conversely, a saddle that’s too high can cause your hips to rock as they dip to reach the bottom of the stroke. This can cause knock-on problems for your back.</p>\n\n\n\n<p>However, the most common result of a saddle that’s too high is pain in the back of the knee as it over-extends. If you think this might be the case try dropping the saddle in 5mm increments until you feel more comfortable. </p>\n\n\n\n<p>Cleat positioning can also have an impact on knees, so don’t shy away from tinkering with where they are seated on your soles. Play around with them and see if you notice a difference.</p>\n\n\n\n<ul>\n<li><strong>Read more: <a href=\"https://www.cyclist.co.uk/tutorials/how-to-change-your-saddle-height\" target=\"_blank\">How to set and change your saddle height</a></strong></li>\n\n\n\n<li><strong>Read more: <a href=\"https://www.cyclist.co.uk/tutorials/how-to-fit-and-adjust-cleats-for-cycling-shoes\" target=\"_blank\">How to fit and adjust cleats</a></strong></li>\n</ul>\n\n\n\n<h3>Foot pain</h3>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2016/06/02132336/rt_adobestock_101647656-873x970.jpg\" /></figure></div>\n\n\n<p>It’s not uncommon for cyclists to experience ‘hotspots’ in the feet, which usually occur as pain under the balls of the feet and a numbness in the toes.</p>\n\n\n\n<p>This comes from pressure being concentrated on one part of the sole, squeezing the nerves between the bones in the feet.</p>\n\n\n\n<p>This condition is actually fairly common among more experienced cyclists because the fat pads in our feet shrink as we get older, meaning the nerves down there are less cushioned or protected.</p>\n\n\n\n<p>If your feet feel numb, one solution is to simply loosen your shoes to allow better blood flow. If you’ve already loosened them off and you’re still experiencing numbness you might want to look at buying wider shoes.</p>\n\n\n\n<p>Your feet expand as they heat up, which can of course happen when you exercise, so while your beloved Sidis might have felt like the perfect fit in the shop, out on the road, on a blazing hot day it might well be a different story. </p>\n\n\n\n<p>One final and relatively cheap solution is to look at getting some insoles. Although you can get custom-fit ones, standard off-the-peg ones will be suitable for most people.</p>\n\n\n\n<p>Insoles – or orthotics, to give them their scientific name – are intended to support the arch of the foot, which can collapse, especially as you get older (<a href=\"https://www.cyclist.co.uk/in-depth/custom-orthotics\" target=\"_blank\">click here to read our custom orthotics feature</a>).</p>\n\n\n\n<p>Prices for cycling-specific insoles such as Specialized’s BG Footbed Insoles start at around £25, and should ideally be changed every 12 months if you ride 5,000 miles or less a year, and even more frequently if you’re putting in more mileage than that. </p>\n\n\n\n<h3>Ankle pain</h3>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2016/06/02132340/rt_adobestock_101647656-873x970.jpg\" /></figure></div>\n\n\n<p>If you find you’re experiencing discomfort in the back of your ankle, it’s probably a sign of achilles tendinitis and a surefire sign that you’ve been trying too do too much to soon.</p>\n\n\n\n<p>This ailment is particularly common among cyclists who’ve taken an extended break out of the saddle and rather than easing themselves back into training gently (which is the right way) have just gone out there and smashed it (which is the wrong way).</p>\n\n\n\n<p>Having your cleats set too far forward on your shoes, which forces you to pedal through your toes, can also put strain on your achilles and result in ankle pain.</p>\n\n\n\n<p>So what’s the best way of treating it? Well, apart from moving your cleats back, if that is the cause of the problem, you can ice the affected area and use an anti-inflammatory gel.</p>\n\n\n\n<p>You can also switch up your diet to combat any inflammation of the joints. Try juicing up the hard stem of a pineapple and drinking it on an empty stomach.</p>\n\n\n\n<p>Like a lot of tropical fruit, pineapples are rich in a powerful enzyme called bromelain, which some studies have shown can reduce pain and inflammation.</p>\n\n\n\n<p>While most enzymes get broken down in your digestive tract, bromelain actually gets absorbed into your body whole, meaning that it can get around your entire system.</p>\n\n\n\n<p>To supercharge your juice, try adding some turmeric to it. A 2009 study showed that this spicy herb was just as effective as ibuprofen at providing pain relief for arthritis sufferers.   </p>\n\n\n\n<p>You can also do gentle exercises to relieve ankle pain. Try standing on a step on the balls of your feet, with your heels hanging over the edge and stretch your achilles by gently pushing you heels down.</p>\n\n\n\n<p>When you’ve pushed them as far as you can, hold for 20 seconds and then gently raise yourself back up again. </p>\n\n\n\n<h3>Hand pain</h3>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2016/06/02132343/rt_adobestock_50652762-912x970.jpg\" /></figure></div>\n\n\n<p>Ulnar neuropathy is a condition that’s unlikely to kill you but can still be incredibly irksome. If your palms and pinkies, particularly your little fingers and/or ring fingers feel numb, tingly or weak after riding, you may be putting too much pressure on your ulnar nerve.</p>\n\n\n\n<p>That’s the nerve that passes through the base of your hand. Squish this little fella and you’ll suddenly find yourself with all the dexterity of an alcoholic octogenarian.</p>\n\n\n\n<p>A cockpit that’s too low or cramped can place excessive weight on your hands, so try something a little more relaxed. Padded gloves can help, as can thicker bar tape.</p>\n\n\n\n<p>Other strategies include trying to grip the bars less tightly and varying your position more frequently. Dropping a few psi out of the tyres will also reduce the level of vibration transmitted to your hands too.</p>\n\n\n\n<h3>Hip pain</h3>\n\n\n<div>\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2016/06/02132346/rt_adobestock_101234861-679x970.jpg\" /></figure></div>\n\n\n<p>Pushing excessively high gears, overly tight muscles, weak glutes (that’s the muscle group in your backside) – all can cause your hips to hurt.</p>\n\n\n\n<p>If you find yours are regularly sore after a long ride, think about how you ride. Are you pushing your muscles and joints too hard? Better to gear back and increase your cadence to take pressure off your hips rather than risk doing yourself long-term damage. You can also improve the strength of your glutes out of the saddle.</p>\n\n\n\n<p>Try kettlebell swing excercises (swinging a kettlebell from between your legs in a forward and upward direction). This movement blasts your glutes explosively.</p>\n\n\n\n<p>To get the most from this <span>exercise, make sure you squeeze your buttocks </span>together at the top of the movement. You’ll feel the burn in your butt cheeks afterwards but it’ll do wonders to help preserve your hips as well as develop your fast-twitch muscle fibres down there.</p>\n\n\n\n<p>These weaken with age and yet are crucial to almost every activity you do – and that includes riding your bike.</p>\n\n\n\n<h3>Cramp</h3>\n\n\n\n<p>It’s still a bit of a mystery exactly what causes cramps, but if you want to avoid being laid up at the roadside with your legs in the air, it definitely helps to warm up properly, stay hydrated and keep your electrolytes topped up – all of which are good ideas anyway.</p>\n\n\n\n<p>Potassium may also reduce cramping so try taking a banana, which is rich in the mineral, along as a snack as well as something salty to keep your sodium levels up. Existing injuries or excessive stresses and strains can also cause recurrent cramps, so if you’re experiencing it frequently, it might be an idea to contact your GP.</p>\n\n\n\n<p>You’ve also probably seen pros shaking out their legs while riding. Although this can help, if you feel a cramp coming on while you’re on the bike, unless you’re in the middle of a race, consider getting off the bike and stretching out the muscle for a few minutes.</p>\n\n\n\n<p>Warming down properly can also help prevent cramping once off the bike. Try spending the last 10 minutes of your ride sitting up and spinning to give your legs a chance to warm down.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/how-to-pedal-without-pain\">How to pedal without pain</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"jcunningham","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"4dd7aba1d48edad9105961b021029b009a2f26085ad7150da6977ccf1e0c089e","category":"Cycling"}