{"title":"71 Growth and reproductive responses to gonadotropins in gilts fed on ad libitum (AD) or restricted (RS) bases using an electronic sow feeder (ESF)","link":"https://academic.oup.com/jas/article/102/Supplement_2/43/7664771?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Previous work in our laboratory showed that age at puberty was similar for replacement gilts fed on either RS or AD bases using an ESF. The objective of this investigation was to determine the effects of feeding (RS vs. AD) on growth and sexual development in gilts treated with gonadotropins (P.G. 600; Merck Animal Health, Rahway, NJ). Prepubertal crossbred gilts were moved at 150 d of age to an open pen with an ESF (ACCUTEAM, Osborne Industries, Osborne, KS) located in an environmentally controlled, curtain-sided building. A 10-d training period to the ESF ensued, during which all gilts received feed on AD basis. At 160 d of age, gilts were allocated to treatments in a 2-by-2 factorial design. Treatments were RS plus P.G. 600 (n = 9), RS without P.G. 600 (n = 10), AD plus P.G. 600 (n = 8), or AD without P.G. 600 (n = 8). The P.G. 600 treatment was administered at 170 d of age. Estrus detection commenced at d 171 and continued for 32 d. Puberty onset was not affected by feeding basis (<span>P</span> = 0.85), P.G. 600 (<span>P</span> = 0.56), or feeding basis x P.G. 600 (<span>P</span> = 0.25). Time in estrus and body weight (BW) at puberty were also similar between treatments. Estrous cycle length was shorter (<span>P</span> &lt; 0.01, 20.0 vs. 21.2 d, SE = 0.54) for RS compared with AD gilts. Bodyweights throughout the trial were similar between treatments but were affected by day (<span>P</span> &lt; 0.01), typical of growing gilts. Feed disappearance was affected by feeding basis (<span>P</span> &lt; 0.01, 2.30 vs. 4.54 kg/d, SE = 0.03 for RS and AD, respectively) and day (<span>P</span> &lt; 0.01). For pubertal gilts, gain to feed ratio was improved (<span>P</span> &lt; 0.01, 0.29 vs. 0.21, SE = 0.03) in RS compared with AD gilts, but average daily gain (ADG) was greater in AD gilts (<span>P</span> = 0.05, 0.75 vs 0.88 kg/d, SE = 0.09). Data were normalized for the 20-d period before second estrus. Feed disappearance was affected by feeding basis x day, and decreased in AD, but not RS gilts, as gilts approached estrus (<span>P</span> = 0.04). Feeding visits (<span>P</span> &lt; 0.01) and feeding visit duration (<span>P</span> &lt; 0.01) were affected by feeding basis with AD gilts consuming feed more frequently and spending less time eating per visit. In this study, RS feeding did not delay, and P.G. 600 did not hasten puberty onset. Moreover, RS gilts grew slower but were more feed efficient than AD gilts. We continue to find that employment of an ESF may support current estrus detection methods by monitoring feeding behavior in AD-fed gilts.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4de53b3030eb9a7591b83b72efc1a50775c66b3d03105074a2385992a30b4066","category":"Environment"}