{"title":"Design of a Strategic Platform for the Smart Supervision of Public Expenditure for Colombia in the Context of Society 5.0","link":"https://www.preprints.org/manuscript/202406.1979/v1","date":1719575231000,"content":"The overarching vision of Society 5.0 seeks to integrate technology to enhance the quality of life and address social issues, with the primary goal of creating human-centered communities, which nowadays represent the inhabitants of Smart Cities. In this context, this work addresses the design of a modular strategic platform for the smart supervision of public expenditure, to be used by the Directorate of Information, Analysis, and Immediate Reaction (DIARI) of the General Comptroller of the Republic (CGR) of Colombia as a significant contribution towards the country’s transition into the Society 5.0. The design was performed by conducting a detailed literature review on fiscal control; a comprehensive analysis of the legal, organizational, and technological aspects of the country and the CGR; and developing six functional modules focused on topics such as continuous learning, strategic decision-making, distinctive value, strategic achievements, capacity building, and organization, within a three-year implementation plan, through a participatory approach. This plan aims to integrate the platform to enable real-time monitoring, early detection of irregularities, and increased transparency in the management of data and public resources. The strategic platform for the DIARI of the CGR is useful for Smart Cities and the transition into Society 5.0 since it ensures efficient public expenditure management, enhancing transparency and citizen empowerment through modern technologies, data analytics, and active participation in governance processes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4dee5ab40cb3c9790bca9e43aadab2223680a503dd44c874019a67c129187870","category":"Interdisciplinary"}