{"title":"Deep Unfolded Tikhonov Regularized Conjugate Gradient Algorithm for MIMO Detection","link":"https://www.preprints.org/manuscript/202408.0644/v1","date":1723181636000,"content":"In addressing the multifaceted problem of multiple-input multiple-output (MIMO) detection in wireless communication systems, this work highlights the pressing need for enhanced detection reliability under variable channel conditions and MIMO antenna configurations. We propose a novel method that sets a new standard for deep unfolding approaches to MIMO detection by integrating the iterative conjugate gradient method with Tikhonov regularization, combining the adaptability of modern deep learning techniques with the robustness of classical regularization. Unlike conventional techniques, our strategy treats the regularization parameter of Tikhonov regularization as well as step size values and search direction coefficients of conjugate gradient (CG) method as trainable parameters within the deep learning framework, allowing for dynamic modification according to channel conditions and MIMO antenna configurations. Detection performance is significantly improved by the proposed approach in variety of conditions. In different MIMO settings, the suggested method consistently shows better bit error rate (BER) and normalized minimum mean square error (NMSE) performance. Across a range of MIMO configurations and channel conditions, the proposed method exhibits significantly lower BER and NMSE values than well-known techniques such as DetNet and CG. The proposed method has superior performance over CG and other model-oriented methods, especially in small number of iterations. Consequently, the simulation results demonstrate the flexibility of the proposed approach, making it a viable choice for MIMO systems with a range of antenna configurations and different channnel conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4df6479729be8e2376166fc26d08f0542ebd556034461f9e3fdcec1de47f579c","category":"Interdisciplinary"}