{"title":"PSLBI-2 Alberta lamb producers sheep/goat vegetation management accreditation course","link":"https://academic.oup.com/jas/article/102/Supplement_3/639/7757650?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Sheep and goats present land stewards with a unique opportunity to graze areas that cattle cannot access and by consuming plants that cattle find unpalatable. While Alberta has a thriving sheep industry and ranks third in Canadian sheep and lamb inventories, producers continue to seek new opportunities to improve land stewardship and better understand grazing animal management. Resources are limited for flock managers that provide the details necessary to successfully graze sheep or goats and maintain forage health under typical and novel circumstances. These typical and uncommon grazing situations include invasive weeds, solar farms, low-quality marginal lands, forests, inner city vegetation control, and powerline cut blocks. In partnership with Lakeland College, the Alberta Lamb Producers and the Alberta Goat Association obtained funding from Alberta Environment and Parks through their Rangeland Sustainability Program to develop a Sheep/Goat Vegetation Management Accreditation Course. In consultation with some knowledgeable Alberta sheep and goat producers, summer students developed a series of vegetation management modules for Alberta sheep and goat producers to learn best management practices for grazing forages under typical and unique situations. These modules form a vegetation management accreditation program. The modules include 1) Grazing Principles; 2) Grazing Forages – native and tame; 3) Stockmanship and Animal Welfare; 4) Building a Business Case; and 5) Unique Grazing – under solar panels, powerline cut blocks, meeting landscape goals and controlling invasive species, forest grazing, and urban grazing. The course will be offered through Lakeland College in the D2L continuing education platform after a group of sheep/goat producers have gone through the course and provided their feedback. The D2L platform will monitor the number of producers and landowners who complete the course to determine the effectiveness of the project. The modules will educate flock owners and serve as a go-to resource for comprehensive grazing and sheep/goat management under specific situations. Stakeholders requiring or offering vegetation management services using livestock would benefit from these resources for contract and partnership development purposes. The project engages land and animal stakeholders to balance and show both perspectives and needs related to vegetation management.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4df798157c070fe2e04528f38416645044dd28aa748c3670428ac73c4cd4130f","category":"Environment"}