{"title":"Effects of juicing methods on the bioactive compounds and flavor quality of ‘Black‐seed’ pomegranate from three producing areas","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13230?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Color, nutrients and flavor are the key characteristics of pomegranate juice, but they are susceptible to processing methods and raw materials. In this study, the effects of aril juicing and whole fruit juicing methods on the composition of ‘Black-seed’ pomegranate juice from three producing areas were studied, including physicochemical parameters, color attributes, organic acids, sugars, phenolic compounds, and volatile compounds.</p>\n<h2>RESULTS</h2>\n<p>The whole fruit juicing method resulted in higher juice yields of pomegranate fruit with 69.01–72.59%, hue angle values were 5.95–6.45°, and the juice remained red. The highest level of citric acid (21.21 g L<sup>−1</sup>), total acids (24.78 g L<sup>−1</sup>), and total anthocyanin content (435.59 mg L<sup>−1</sup>) were found in whole fruit juice, and seven tannins were detected. The most abundant volatile compounds were (<i>Z</i>)-3-hexen-1-ol and 1-hexanol in all juice samples, with alcohol content increased and aldehydes content decreased by whole fruit juicing. Principal component analysis revealed that the 24 indexes (variable important in projection &gt;1) clearly distinguished juice samples obtained by two juicing methods, with ellagic acid hexoside, (<i>E</i>)-2-heptenal, (+)-catechin, and octanoic acid having the best discriminatory potential.</p>\n<h2>CONCLUSION</h2>\n<p>Overall, the effects of juicing method on ‘Black-seed’ pomegranate juice were greater than those of raw-material-producing areas. These results confirmed the potential for using the whole ‘Black-seed’ pomegranate for processing, and also provided a theoretical basis for the healthy product development and utilization of dark-color pomegranate varieties. © 2023 Society of Chemical Industry.</p>","author":"Lei Yuan, \nWenhui Zou, \nYijin Peng, \nLinyan Zhou","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"4df8ac1c346f6666a9da871f1504130e2b334e5e5dee3faa23ac4a58bc63328b","category":"Environment"}