{"title":"Worm’s rear end develops its own head, wanders off to mate","link":"https://arstechnica.com/?p=1989758","date":1702065228000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Screen-Shot-2023-12-08-at-2.30.22-PM-800x200.jpeg\" alt=\"Three images of worm-like organisms.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Screen-Shot-2023-12-08-at-2.30.22-PM.jpeg\">Enlarge</a> <span>/</span> From left to right, the head of an actual worm, and the stolon of a male and female. (credit: <a href=\"https://www.nature.com/articles/s41598-023-46358-8/figures/1\">Nakamura et. al.</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Some do it horizontally, some do it vertically, some do it sexually, and some asexually. Then there are some organisms that would rather grow a butt that develops into an autonomous appendage equipped with its own antennae, eyes, and brain. This appendage will detach from the main body and swim away, carrying gonads that will merge with those from other disembodied rear ends and give rise to a new generation.</p>\n<p>Wait, <i>what in the science fiction B-movie alien star system is this thing?</i></p>\n<p><i>Megasyllis nipponica </i>really exists on Earth. Otherwise known as the Japanese green syllid worm, it reproduces by a process known as <a href=\"https://pubmed.ncbi.nlm.nih.gov/30535381/\">stolonization</a>, which sounds like the brainchild of a sci-fi horror genius but evolved in some annelid (segmented) worms to give future generations the best chance at survival. What was still a mystery (until now) was exactly how that bizarre appendage, or stolon, could form its own head in the middle of the worm’s body. Turns out this is a wonder of gene regulation.</p></div><p><a href=\"https://arstechnica.com/?p=1989758#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1989758&amp;comments=1\">Comments</a></p>","author":"Elizabeth Rayne","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4dfec70b3648188a8883c86bb791b0cadf8abf7c7387d2ec12d7b869d31d2d2d","category":"Tech"}