{"title":"Effects of Water Temperature and Salinity on the Growth and Survival of Hybrid Pufferfish Larvae (Takifugu obscurus♀ X T. rubripes♂)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/8511980?af=R","date":1721822691000,"content":"<p><i>Takifugu</i> genus pufferfish are popular in East Asian countries such as Korea, Japan, and China, but they are avoided as aquaculture species due to slow growth, high cannibalism rates, and susceptibility to diseases. Hybridization is considered one of the most important and efficient breeding methods for aquatic animals, and recent studies have been conducted on hybridization. This study compared optimal water temperature and salinity ranges for hybrid pufferfish by examining three water temperature conditions (15, 20, and 25°C) and five salinity conditions (0, 3, 10, 25, and 33 psu). The hatching rates of hybrid pufferfish embryos were 65.3%, 63.5%, and 67.7% at 0, 3, and 10 psu, respectively, while all embryos died at 25 and 33 psu. Hybrid pufferfish larvae had the highest survival rates at 20°C, and growth rates increased with rising water temperatures. In the salinity experiment, survival rates were 86.0%, 85.0%, 88.0%, and 88.5% at 3 psu, 10 psu, 25 psu, and 33 psu conditions, respectively, with the highest growth observed at 25 psu conditions. Hybrid pufferfish embryos showed good survival in freshwater, but all died in seawater. However, larvae showed good survival and growth in seawater, while all died in freshwater. Therefore, rearing hybrid pufferfish embryos seem suitable at salinities of 10 psu or lower, and increased resistance to salinity was observed in hybrid pufferfish after hatching, indicating that rearing under various salinity conditions ranging from 3 to 33 psu may be feasible.</p>","author":"Jin Lee, \nKyeong-Ho Han, \nWoo-Sung Choi, \nTae-Sik Yu, \nHyung-Sun Kim, \nSung-Hun Lee, \nAbdel-Fattah M. El-Sayed","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"4e01ddd5e9dd5ed9bd6f59ee7d2941524905efc06ecc1fc239658c78fbae03e7","category":"Environment"}