{"title":"‘I’ve been knocking on that door for a while and it’s keeping me hungry’: Magnus Sheffield interview","link":"https://www.cyclist.co.uk/in-depth/magnus-sheffield-cyclist","date":1698069950000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/magnus-sheffield-cyclist\">‘I’ve been knocking on that door for a while and it’s keeping me hungry’: Magnus Sheffield interview</a></p>\n\n<p><strong>Magnus, have you ever been to the British city of Sheffield?</strong></p>\n\n\n\n<p>I’ve not. But at the Tour Down Under, I had a British flag next to my name on the start list. So we had four Brits and one fake one.</p>\n\n\n\n<p><strong>You’ve been an American on a British team for nearly two years. What have you picked up?</strong></p>\n\n\n\n<p>Quite a big vocabulary. I think when I go back home my mates won’t quite recognise the way I speak. I’ve been able to chip away at a few sayings and words. I say ‘punter’ quite a lot.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/matej-mohoric-gravel-worlds-bike\">Matej Mohorič’s crazy (and unreleased) Gravel World Champs-winning bike</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/2023-pro-cycling-retirements\">End of an era: All the road cycling greats retiring this year</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/cycling-hour-record\">What is the cycling Hour record?</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>Rod Ellingworth [deputy team principal] actually gave us a dictionary of British sayings and Rodspeak. It’s quite funny. [Reads from his phone] ‘Ey up, all right, sounds good, snap, bit of snap, snap time, go to town, crack on, get at it, get after it, get stuck in.’ That’s the one I hear the most. Most of them mean work hard.</p>\n\n\n\n<p><strong>Tell us more about your background as an American who is also part Norwegian.</strong></p>\n\n\n\n<p>My mom is from Norway, so that’s a big part of my identity. I still have family around Oslo and Kristiansund. I love going back, as it feels part of my childhood. A lot of times it was for Christmas so we’d go skiing or to <em>hytte</em>, which is a cabin. I also have fond memories of going crab fishing, swimming and diving for mussels.</p>\n\n\n\n<p><strong>What has been your most significant performance so far?</strong></p>\n\n\n\n<p>My win in Brabantse Pijl last year because it had been quite a long time since an American had won a one-day race of that nature. I think I’ve also been really close a lot, like in Poland last year and the Tour Down Under this year. A big goal of mine is to win my first WorldTour race. I’ve been knocking on that door for a while and it’s keeping me hungry.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"970\" height=\"347\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-300x107.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-768x275.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1536x550.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-750x269.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1140x408.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4.jpg 1818w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p><strong>Growing up in New York State, you were a talented skier. How did you decide between skiing and cycling? And have any skills transferred across?</strong></p>\n\n\n\n<p>I never competed internationally but my dream growing up was always to ski at university, get a scholarship and be an Olympic skier. It wasn’t until I was 15 that I had a big shift in my aspirations. I’d always ridden a bike, since I could walk, and it felt quite natural. I started mountain biking, then I got into cyclocross and road cycling.</p>\n\n\n\n<p>I’m able to memorise courses quite well. In Flanders I didn’t have my bike computer with me when I swapped bikes, but I still knew the route. I think that comes from the visualisation from ski racing that we do in between runs.</p>\n\n\n\n<p><strong>Do you remember your first road race in Europe?</strong></p>\n\n\n\n<p>I remember showing up in Belgium and being a bit puzzled how the fans lined up on the side of the road weren’t just friends and family, they were spectators. I was told they were betting on the race, which I thought was hilarious because the odds were definitely not in my favour. After I won a few races I knew I’d made it when the Belgians started gambling on me.</p>\n\n\n\n<p><strong>There’s a lack of top-level US races compared to a decade ago when there were Tours of Colorado, Utah, California, etc. How can that be changed?</strong></p>\n\n\n\n<p>It’s quite sad because some of my teammates say the Tour of California was the best race of the year, the one they looked forward to the most. It’s a real shame it’s gone away. The reason for it, like with anything, is there are ups and downs with popularity. The US has a very big cycling industry but it’s a shame because the racing scene has definitely taken a hit in the past couple of years.</p>\n\n\n\n<p>It’s difficult to pinpoint one thing but gravel racing has opened up a lot of doors and the industry has followed with that. There used to be a lot of criteriums, which have also gone away. I’m not sure exactly why that is, if it’s because of the cities with the road closures. But we have a really exciting generation where you see guys like Neilson [Powless], Matteo [Jorgenson], Brandon [McNulty], Quinn [Simmons] and myself performing in Europe. I’m hoping that can then bring the racing scene back in the US.</p>\n\n\n\n<p><strong>Contending for the Tour de France might be the only thing that speaks to the average American. Do you think you could be a Tour winner in the future?</strong></p>\n\n\n\n<p>It’s a hard question because the Tour is the biggest thing in the sport. I think that would be the biggest goal in my career but there are a lot of things that would have to go right. There’s a reason why it’s the hardest race. But that is a dream of mine.</p>\n\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/10/magnus-sheffield-1-647x970.jpg\" alt=\"Magnus Sheffield\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/10/magnus-sheffield-1-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/10/magnus-sheffield-1-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/10/magnus-sheffield-1-768x1152.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/10/magnus-sheffield-1-1024x1536.jpg 1024w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/10/magnus-sheffield-1-750x1125.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/10/magnus-sheffield-1-1140x1710.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/10/magnus-sheffield-1.jpg 1200w\" /><figcaption>David Powell / Cyclist</figcaption></figure></div>\n\n\n<p><strong>What have you discovered about your attributes as a rider?</strong></p>\n\n\n\n<p>A big focus of mine is the time-trial. It’s a completely separate discipline in cycling, I’d argue. But I like to climb and the one-day races are also quite well-suited to me. I seem to enjoy the real gritty races as well.</p>\n\n\n\n<p>In a recent interview, you said that leadership is sometimes about what you don’t say. What did you mean by that? It’s your attitude around the team and staff. Professionalism is important: things like being on time and the way you speak to and treat people. Sometimes it’s not about what you say, but how you say it. And leadership is also about confidence and showing a bit of panache on the bike. Not ever being defeated really, I guess, is being a true leader.</p>\n\n\n\n<h3>Career highlights</h3>\n\n\n\n<p><strong>Age</strong> 21<br /><strong>Born</strong> Pittsford, New York, USA<br /><strong>Team</strong> Ineos Grenadiers</p>\n\n\n\n<p><strong>Notable results</strong><br /><strong>2023:</strong><br />4th overall, 1st Young Rider Classificiation, Tour of Britain<br />2nd, Tour of Norway<br />4th overall, 1st Young Rider Classificiation, Tour Down Under</p>\n\n\n\n<p><strong>2022</strong>:<br />1st, Brabantse Pijl<br />2nd overall, 1st Young Rider Classificiation, Danmark Rundt</p>\n\n\n\n<p><strong>2021:</strong><br />10th, World Championships Junior Time-Trial</p>\n\n\n\n<p><strong>2020</strong>:<br />1st, Valley of the Sun Stage Race</p>\n\n\n\n<p><strong>2019:</strong><br />3rd, World Championships Junior Road Race</p>\n\n\n\n<p><strong>• This article originally appeared in issue 145 of <em>Cyclist </em>magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/magnus-sheffield-cyclist\">‘I’ve been knocking on that door for a while and it’s keeping me hungry’: Magnus Sheffield interview</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"4e023af9dfd7c4e7272fa16ffd78a2880090c0bbeb64ba23113cb70c420fb608","category":"Cycling"}