{"title":"Inside the Apple Vision Pro Developer Labs","link":"https://developer.apple.com/news/?id=5nn2hddv","date":1693255733000,"content":"\n<p>Apple’s Developer News site has a nice interview with three indie developers who’ve visited the Vision Pro labs, including Michael Simmons from <a href=\"https://flexibits.com/\">Flexibits</a> and David “Underscore” Smith, of <a href=\"https://www.david-smith.org/apps/\">Widgetsmith</a> fame:</p>\n\n<blockquote>\n  <p>For his part, Simmons saw Fantastical work right out of the box.\nHe describes the labs as “a proving ground” for future\nexplorations and a chance to push software beyond its current\nbounds. “A bordered screen can be limiting. Sure, you can scroll,\nor have multiple monitors, but generally speaking, you’re limited\nto the edges,” he says. “Experiencing spatial computing not only\nvalidated the designs we’d been thinking about — it helped us\nstart thinking not just about left to right or up and down, but\nbeyond borders at all.”</p>\n</blockquote>\n\n<p>Simmons’s remarks echo my biggest takeaway from my demo experience: the lack of a “frame” encompassing windows.</p>\n\n<blockquote>\n  <p>And as not just CEO but the lead product designer (and the guy who\n“still comes up with all these crazy ideas”), he came away from\nthe labs with a fresh batch of spatial thoughts. “Can people look\nat a whole week spatially? Can people compare their current day to\nthe following week? If a day is less busy, can people make that\nday wider? And then, what if like you have the whole week wrap\naround you in 360 degrees?” he says. “I could probably — not\nkidding — talk for two hours about this.”</p>\n</blockquote>\n\n<p>Two hours, you say? <a href=\"https://daringfireball.net/thetalkshow/2022/04/30/ep-345\">I know a guy</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/28/inside-vision-developer-labs\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"4e07e330a9b228a897f04976199a6c22f5dfe19ea9797cb0ef4a4e995b510edf","category":"Tech"}