{"title":"Comparison of the ability of resection versus nonresection surgery to prevent the recurrence of sigmoid volvulus: A protocol of a meta-analysis and systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310402","date":1727186400000,"content":"<p>by Xiaomei Jiang, Qiang Du, Lie Yang</p>\r\nPurpose <p>Based on clinical research guidelines and clinical practice, patients with sigmoid volvulus (SV) who receive conservative treatment have a greater recurrence rate than patients who do not receive conservative treatment, which is almost without any controversy. Surgical treatment is usually the final treatment for patients with SV. However, there are multiple surgical methods for the treatment of SV, which can be roughly divided into resection and nonresection methods. The available evidence on the effectiveness of surgery for preventing postoperative recurrence is still inadequate. Therefore, we drafted this systematic review protocol with meta-analysis aimed to compare the effects of these two major types of surgery on preventing the recurrence of SV.</p> Methods <p>We comprehensively and systematically reviewed the PubMed, EMBASE, MEDLINE and Cochrane Library databases of articles on SV from inception to November 16, 2023. Two independent authors will screen and analyze the detected literature, and disputes will be resolved through communication with a third experienced person. After evaluating the quality of the literature and estimating the risk of bias, we calculate the pooled effect size and 95% confidence interval. Heterogeneity is analyzed by subgroup analysis, and sensitivity analysis can be carried out to assure the reliability of the results. Finally, the Grading of Recommendations Assessment, Development and Evaluation (GRADE) will be used to evaluate the strength of the evidence. The results of each analysis will be recorded in detail. The whole process was carried out in strict accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses Protocols guidelines (PRISMA-P).</p> Trial registration <p>Protocol registration: The study protocol has been registered at the International Prospective Register of Systematic Reviews platform (PROSPERO) (CRD42024508350). Protocol version 1.0, 13 Feb 2024.</p>","author":"Xiaomei Jiang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4e0b642171415525ceb3c84d4f9d0c33e12be4cd16b9a428398a82874921ba35","category":"Interdisciplinary"}