{"title":"Apple's Rumored 5G Modem for iPhones Has Suppliers Competing for Orders","link":"https://www.macrumors.com/2023/03/14/apple-5g-modem-suppliers-eyeing-orders/","date":1678809696000,"content":"Apple's <a href=\"https://www.macrumors.com/2022/12/21/iphone-15-qualcomm-5g-modem/\">rumored 5G modem project</a> has multiple suppliers interested in assisting with final assembly of the chip, according to a new report.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/Apple-Wi-Fi-Chip-Feature-Navy.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nWhile the custom-designed modem will likely be manufactured by Apple's chipmaking partner TSMC, the final packaging stage may be handled by other suppliers. Taiwanese supply chain publication <a href=\"https://www.digitimes.com/news/a20230313PD218.html\"><em>DigiTimes</em></a> today reported that ASE Technology and Amkor Technology are \"competing\" to package the modem chips. The two companies already have experience packaging Qualcomm's modem chips, the report states.\r<br />\n\r<br />\nQualcomm is currently the exclusive supplier of 5G modems for Apple devices, including the entire iPhone 14 lineup, but Apple has long been rumored to be designing its own 5G chip as an in-house replacement. Last month, Qualcomm CEO Cristiano Amon said he <a href=\"https://www.macrumors.com/2023/02/27/qualcomm-ceo-apple-5g-chip-2024/\">expected Apple's 5G modem to be ready in 2024</a>, but <em>Bloomberg</em>'s Mark Gurman reported that it <a href=\"https://www.macrumors.com/2023/01/09/apple-in-house-modem-chips-2024/\">could take up to three years</a> for Apple to fully transition away from Qualcomm.\r<br />\n\r<br />\nThe first device expected to be equipped with Apple's custom 5G modem <a href=\"https://www.macrumors.com/2023/02/27/kuo-iphone-se-4-oled-display/\">is the fourth-generation iPhone SE</a>, which will likely be released around March 2024. It's unclear how Apple's chip would perform compared to Qualcomm's modems, but the switch to an in-house design would likely reduce Apple's production costs over time.\r<br />\n\r<br />\nIn the meantime, all iPhone 15 models are expected to be equipped with <a href=\"https://www.macrumors.com/2022/03/01/qualcomm-unveils-new-5g-snapdragon-x70-modem/\">Qualcomm's Snapdragon X70 modem</a>, which has further cellular speed and power efficiency improvements compared to the Snapdragon X65 in all iPhone 14 models. <div>Tags: <a href=\"https://www.macrumors.com/guide/digitimes-com/\">DigiTimes</a>, <a href=\"https://www.macrumors.com/guide/apple-5g-modem/\">Apple 5G Modem</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/14/apple-5g-modem-suppliers-eyeing-orders/\">Apple's Rumored 5G Modem for iPhones Has Suppliers Competing for Orders</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-rumored-5g-modem-for-iphones-has-suppliers-competing-for-orders.2383683/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4e105f03139497d28fd3ffcd3d194c6c50ef96b85c3e0dc0982dde1bac5d1a7a","category":"Apple"}