{"title":"Manage EDI at scale with new AWS B2B Data Interchange","link":"https://aws.amazon.com/blogs/aws/introducing-aws-b2b-data-interchange-simplified-connections-with-your-trading-partners/","date":1701111567000,"content":"<p>Today we’re launching <a href=\"https://aws.amazon.com/b2b-data-interchange/\">AWS B2B Data Interchange</a>, a fully managed service allowing organizations to automate and monitor the transformation of EDI-based business-critical transactions at cloud scale. With this launch, AWS brings automation, monitoring, elasticity, and pay-as-you-go pricing to the world of B2B document exchange.</p> \n<p>Electronic data interchange (EDI) is the electronic exchange of business documents in a standard electronic format between business partners. While email is also an electronic approach, the documents exchanged via email must still be handled by people rather than computer systems. Having people involved slows down the processing of the documents and also introduces errors. Instead, EDI documents can flow straight through to the appropriate application on the receiver’s system, and processing can begin immediately. Electronic documents exchanged between computer systems help businesses reduce cost, accelerate transactional workflows, reduce errors, and improve relationships with business partners.</p> \n<p>Work on EDI started in the 1970s. I remember reading <a href=\"https://researchportal.unamur.be/en/studentTheses/unstructured-documents-in-edifact\">a thesis about EDIFACT</a>, a set of standards defining the structure of business documents, back in 1994. But despite being a more than 50-year-old technology, traditional self-managed EDI solutions deployed to parse, validate, map, and translate data from business applications to EDI data formats are difficult to scale as the volume of business changes. They typically do not provide much operational visibility into communication and content errors. These challenges often oblige businesses to fall back to error-prone email document exchanges, leading to high manual work, increased difficulty controlling compliance, and ultimately constraining growth and agility.</p> \n<p>AWS B2B Data Interchange is a fully managed, easy-to-use, and cost-effective service for accelerating your data transformations and integrations. It eliminates the heavy lifting of establishing connections with your business partners and mapping the documents to your system’s data-formats and gives visibility on documents that can’t be processed.</p> \n<p>It provides a low-code interface for business partner onboarding and EDI data transformation to easily import the processed data to your business applications and analytics solutions. B2B Data Interchange gives you easy access to monitoring data, allowing you to build dashboards to monitor the volume of documents exchanged and the status of each document transformation. For example, it is easy to create alarms when incorrectly formatted documents can’t be transformed or imported into your business applications.</p> \n<p>It is common for large enterprises to have thousands of business partners and hundreds of types of documents exchanged with each partner, leading to millions of combinations to manage. AWS B2B Data Interchange is not only available through the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a>, it is also accessible with the <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (AWS CLI)</a> and <a href=\"https://aws.amazon.com/tools/\">AWS SDKs</a>. This allows you to write applications or scripts to onboard new business partners and their specific data transformations and to programmatically add alarms and monitoring logic to new or existing dashboards.</p> \n<p>B2B Data Interchange supports the <a href=\"https://x12.org/\">X12</a> EDI data format. It makes it easier to validate and transform EDI documents to the formats expected by your business applications, such as JSON or XML. The raw documents and the transformed JSON or XML files are stored on <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a>. This allows you to build event-driven applications for real-time business data processing or to integrate business documents with your existing analytics or AI/ML solutions.</p> \n<p>For example, when you receive a new EDI business document, you can trigger additional routing, processing, and transformation logic using <a href=\"https://aws.amazon.com/step-functions\">AWS Step Functions</a> or <a href=\"https://aws.amazon.com/eventbridge\">Amazon EventBridge</a>. When an error is detected in an incoming document, you can configure the sending of alarm messages by email or SMS or trigger an API call or additional processing logic using <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>.</p> \n<p><span><strong>Let’s see how it works<br /> </strong></span>As usual on this blog, let me show you how it works. Let’s imagine I am in charge of the supply chain for a large retail company, and I have hundreds of business partners to exchange documents such as <a href=\"https://en.wikipedia.org/wiki/Bill_of_lading\">bills of lading</a>, customs documents, <a href=\"https://www.truecommerce.com/edi-transaction-codes/edi-856/\">advanced shipment notices</a>, invoices, or <a href=\"https://www.truecommerce.com/edi-transaction-codes/edi-861/\">receiving advice certificates</a>.</p> \n<p>In this demo, I use the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a> to onboard a new business partner. By onboarding, I mean defining the contact details of the business partner, the type of documents I will exchange with them, the technical data transformation to the JSON formats expected by my existing business apps, and where to receive the documents.</p> \n<p>With this launch, the configuration of the transport mechanism for the EDI document is managed outside B2B Data Interchange. Typically, you will configure a <a href=\"https://aws.amazon.com/aws-transfer-family/\">transfer gateway</a> and propose that your business partner transfer the document using <a href=\"https://docs.aws.amazon.com/transfer/latest/userguide/create-server-sftp.html\">SFTP</a> or <a href=\"https://docs.aws.amazon.com/transfer/latest/userguide/create-b2b-server.html\">AS2</a>.</p> \n<p>There are no servers to manage or application packages to install and configure. I can get started in just four steps.</p> \n<p>First, I create a profile for my business partner.</p> \n<p><span><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-02-20.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-02-20.png\" alt=\"B2B Data Interchange - Create profile\" width=\"800\" height=\"392\" /></a></span></p> \n<p>Second, I create a transformer. A transformer defines the source document format and the mapping to my existing business application data format: JSON or XML. I can use the graphical editor to validate a sample document and see the result of the transformation directly from the console. We use the standard <a href=\"http://docs.jsonata.org/overview.html\">JSONATA</a> query and transformation language to define the transformation logic to JSON documents and standard <a href=\"https://en.wikipedia.org/wiki/XSLT\">XSLT</a> when transforming to XML documents.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-07-00.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-07-00.png\" alt=\"B2B Data Interchange - Create transformer - input\" width=\"800\" height=\"480\" /></a></p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-07-52-1.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-07-52-1.png\" alt=\"B2B Data Interchange - Create transformer - transformation\" width=\"800\" height=\"862\" /></a></p> \n<p>I activate the transformer once created.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-09-34.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-09-34.png\" alt=\"B2B Data Interchange - Create transformer - activate\" width=\"800\" height=\"200\" /></a></p> \n<p>Third, I create a trading capability. This defines which <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> buckets will receive the documents from a specific business partner and where the transformed data will be stored.</p> \n<p>There is a one-time additional configuration to make sure proper permissions are defined on the S3 bucket policy. I select <strong>Copy policy</strong> and navigate to the Amazon S3 page of the console to apply the policies to the S3 bucket. One policy allows B2B Data Interchange to read from the incoming bucket, and one policy allows it to write to your outgoing bucket.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-12-57.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-12-57.png\" alt=\"B2B Data Interchange - Create capability\" width=\"800\" height=\"317\" /></a></p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-13-04.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-13-04.png\" alt=\"B2B Data Interchange - Create capability - configure directory\" width=\"800\" height=\"449\" /></a></p> \n<p>While I am configuring the S3 bucket, it is also important to turn on Amazon EventBridge on the S3 bucket. This is the mechanism we use to trigger the data transformation upon the arrival of a new business document.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/31/2023-10-31_13-44-52.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/31/2023-10-31_13-44-52.png\" alt=\"B2B Data Interchange - Enbale EventBridge on S3 bucket\" width=\"800\" height=\"375\" /></a></p> \n<p>Finally, back at the B2B Data Interchange configuration, I create a partnership. Partnerships are dedicated resources that establish a relationship between you and your individual trading partners. Partnerships contain details about a specific trading partner, the types of EDI documents you receive from them, and how those documents should be transformed into custom JSON or XML formats. A partnership links the business profile I created in the first step with one or multiple document types and transformations I defined in step two.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-14-58.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-11-11_16-14-58.png\" alt=\"B2B Data Interchange - Create partnership\" width=\"800\" height=\"450\" /></a></p> \n<p>This is also where I can monitor the status of the last set of documents I received and the status of their transformation. For more historical data, you can navigate to <a href=\"https://aws.amazon.com/cloudwatch/\">Amazon CloudWatch</a> using the links provided in the console.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-10-31_14-04-04-v2.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-10-31_14-04-04-v2.png\" alt=\"B2B Data Interchange - Log group\" width=\"800\" height=\"293\" /></a></p> \n<p>To test my setup, I upload an EDI 214 document to the incoming bucket and a few seconds later, I can see the transformed JSON document appearing in the destination bucket.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-10-31_14-03-41-v2.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/11/2023-10-31_14-03-41-v2.png\" alt=\"B2B Data Interchange - Transformed document on the bucket\" width=\"800\" height=\"257\" /></a></p> \n<p>I can observe the status of document processing and transformation using <code>Invocations</code> and <code>TriggeredRules</code> CloudWatch metrics from EventBridge. From there, together with the CloudWatch Logs, I can build <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/CloudWatch_Dashboards.html\">dashboards</a> and configure <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/ConsoleAlarms.html\">alarms</a> as usual. I can also configure additional enrichment, routing, and processing of the incoming or transformed business documents by writing an <a href=\"https://docs.aws.amazon.com/lambda/latest/dg/getting-started.html\">AWS Lambda function</a> or a <a href=\"https://docs.aws.amazon.com/step-functions/latest/dg/welcome.html\">workflow using AWS Step Functions</a>.</p> \n<p><span><strong>Pricing and availability<br /> </strong></span>AWS B2B Data Interchange is available today in three of the AWS Regions: US East (Ohio, N. Virginia) and US West (Oregon).</p> \n<p>There is no one-time setup fee or recurring monthly subscription. AWS charges you on demand based on your real usage. There is a price per partnership per month and a price per document transformed. The <a href=\"https://aws.amazon.com/b2b-data-interchange/pricing\">B2B Data Interchange pricing page has the details</a>.</p> \n<p>AWS B2B Data Interchange makes it easy to manage your trading partner relationships so you can automatically exchange, transform, and monitor EDI workflows at cloud scale. It doesn’t require you to install or manage any infrastructure and makes it easy for you to integrate with your existing business applications and systems. You can use the AWS B2B Data Interchange API or the AWS SDK to automate the onboarding of your partners. Combined with a fully managed and scalable infrastructure, AWS B2B Data Interchange helps your business to be more agile and scale your operations.</p> \n<p><span><strong>Learn more:</strong></span></p> \n<ul> \n <li><a href=\"https://aws.amazon.com/b2b-data-interchange/\">AWS B2B Data Interchange web page</a></li> \n <li><a href=\"https://console.aws.amazon.com/b2bi/home\">Log in to the console</a></li> \n</ul> \n<p>Go build!</p> \n<a href=\"https://twitter.com/sebsto\">-- seb</a>","author":"Sébastien Stormacq","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"4e1009cfc26882f5cd75dd2f52a642f5736ee0ec786d57b36673c5de842c3e92","category":"Tech"}