{"title":"Hydrogen lobbyist quits, slams oil companies’ “false claims” about blue hydrogen","link":"https://arstechnica.com/?p=1788930","date":1629546345000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/GettyImages-1063648066-980x653.jpg\" /><p>A hydrogen filling station. (credit: Peter Gercke/picture alliance via Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The head of a hydrogen lobbying group has stepped down amid concerns that blue hydrogen made from natural gas would serve as a “lock-in” for fossil fuels.</p>\n<p>Oil and gas companies in recent years have been touting the purported advantages of hydrogen made from natural gas. Supporters admit that blue hydrogen is not zero carbon, but they argue that its use would help build demand and infrastructure while costs for green hydrogen, which is made from renewable power, are brought down.<span> </span></p>\n<p>At issue, though, is whether blue hydrogen is truly low carbon, as its boosters suggest. According to a recent study, <a href=\"https://arstechnica.com/science/2021/08/blue-hydrogen-pushed-by-gas-companies-harms-climate-more-than-coal-study-says/\">blue hydrogen may be worse for the climate than coal</a>. The low-carbon claims about blue hydrogen hinge on the fact that carbon dioxide needs to be captured at every step, from the steam reformation process that makes the gas from methane to the natural gas generators that provide heat and power for the reactions. Not every step is perfect, and between 10–40 percent of the carbon dioxide can evade capture depending on the system.</p></div><p><a href=\"https://arstechnica.com/?p=1788930#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1788930&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4e100bc58f7ddc433848042677728cf43c971a4ff7aa3b654444174f02fd95fc","category":"Tech"}