{"title":"Immediate postnatal prediction of death or bronchopulmonary dysplasia among very preterm and very low birth weight infants based on gradient boosting decision trees algorithm: A nationwide database study in Japan","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300817","date":1711548000000,"content":"<p>by Kota Yoneda, Tomohisa Seki, Yoshimasa Kawazoe, Kazuhiko Ohe, Naoto Takahashi, on behalf of the Neonatal Research Network of Japan </p>\r\nIntroduction <p>Bronchopulmonary dysplasia (BPD) poses a substantial global health burden. Individualized treatment strategies based on early prediction of the development of BPD can mitigate preterm birth complications; however, previously suggested predictive models lack early postnatal applicability. We aimed to develop predictive models for BPD and mortality based on immediate postnatal clinical data.</p> Methods <p>Clinical information on very preterm and very low birth weight infants born between 2008 and 2018 was extracted from a nationwide Japanese database. The gradient boosting decision trees (GBDT) algorithm was adopted to predict BPD and mortality, using predictors within the first 6 h postpartum. We assessed the temporal validity and evaluated model adequacy using Shapley additive explanations (SHAP) values.</p> Results <p>We developed three predictive models using data from 39,488, 39,096, and 40,291 infants to predict “death or BPD,” “death or severe BPD,” and “death before discharge,” respectively. These well-calibrated models achieved areas under the receiver operating characteristic curve of 0.828 (95% CI: 0.828–0.828), 0.873 (0.873–0.873), and 0.887 (0.887–0.888), respectively, outperforming the multivariable logistic regression models. SHAP value analysis identified predictors of BPD, including gestational age, size at birth, male sex, and persistent pulmonary hypertension. In SHAP value-based case clustering, the “death or BPD” prediction model stratified infants by gestational age and persistent pulmonary hypertension, whereas the other models for “death or severe BPD” and “death before discharge” commonly formed clusters of low mortality, extreme prematurity, low Apgar scores, and persistent pulmonary hypertension of the newborn.</p> Conclusions <p>GBDT models for predicting BPD and mortality, designed for use within 6 h postpartum, demonstrated superior prognostic performance. SHAP value-based clustering, a data-driven approach, formed clusters of clinical relevance. These findings suggest the efficacy of a GBDT algorithm for the early postnatal prediction of BPD.</p>","author":"Kota Yoneda","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4e12ead9f3a891f983bddcd3ce2c1464a572c67520007ee7b2143dfa2c684590","category":"Interdisciplinary"}