{"title":"WWDC21 keynote reaction: Get to work and ignore the privacy double standard","link":"https://www.macworld.com/article/348250/apple-almost-gets-full-privacy-marks.html","date":1623142800000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>During an Apple keynote, a pastime Apple followers like to engage in on Twitter, Slack, text, telex, party line, whatever method of communication is most handy, is coming up with hilarious zingers to things the company announces.</p>\n\n\n\n<p>Let’s do a little of that today, shall we?</p>\n\n\n\n<p>First example: Apple said there’s going to be a new mindfulness app on the Watch. There’ll also be Tai Chi workouts in Fitness+. So, shorter Apple: “We’re the Zen company that sells you constant distraction devices.”</p>\n\n\n\n<p>It’s great to enable new functionality. The Macalope just finds it hilarious that the company introduced both a “Find Focus in the Day” feature and the ability for shared notes to yell at you in <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/ipados/ipados-preview/&amp;subid1=1-1-348250-0-0-0\">the same operating system</a> in the same keynote.</p>\n\n\n\n<p>Another item one might poke fun at is the references in the keynote to work. Some of these came off a little weird as a group of Apple employees <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2021/6/4/22491629/apple-employees-push-back-return-office-internal-letter-tim-cook&amp;xcust=1-1-348250-0-0-0&amp;sref=https://www.macworld.com/feed\">recently sent a letter to Tim Cook</a> asking for more work from home alternatives in the future after Apple announced employees must return to the office at least three days a week starting in the fall. So, it was a little eyeroll-inducing to see a new Mail feature demonstrated using an email about work/life balance. Because <em>that’s</em> not ironic. Then there was the watchOS team member demonstrating a feature by texting her daughter about how much they miss their dog all day long when they’re at work and school.</p>\n\n\n\n<p>YOU MADE A PUPPY SAD, TIM. HOPE YOU’RE HAPPY.</p>\n\n\n\n<p>Developers, it seems, weren’t hugely excited by the keynote itself. And that’s understandable. Most of it was devoted to features they can’t really take advantage of and some of it to things that probably compete with them. Only the last 20 minutes or so was really focused at developers, but that’s what the WWDC keynote has become. Developers did, however, seem pretty excited about the details that came out <em>after</em> the keynote, such as APIs for <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mactanaka/status/1401994518573072392&amp;xcust=1-1-348250-0-0-0&amp;sref=https://www.macworld.com/feed\">requesting refunds</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/marcoarment/status/1401992701013381121&amp;xcust=1-1-348250-0-0-0&amp;sref=https://www.macworld.com/feed\">subscription cancelations</a> and the announcements from the State of the Union.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>The Macalope is not really equipped to talk about those announcements. Coding is hard with hooves. So, of the announcements the company made during the Keynote, the Macalope wants to spend a little time talking about privacy.</p>\n\n\n\n<p>Yes, again. What’s that supposed to mean?</p>\n\n\n\n<p>You know, Kevin, your attitude is not helpful. Not helpful at all.</p>\n\n\n\n<p>Apple <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/06/apple-advances-its-privacy-leadership-with-ios-15-ipados-15-macos-monterey-and-watchos-8/&amp;xcust=1-1-348250-0-0-0&amp;sref=https://www.macworld.com/feed\">continues to fire</a> proverbial shots across the bow of and literally right at the worst elements of the advertising industry. The Macalope heard from more than one person that people in the advertising industry had nothing but responses of the four-letter variety to the company’s anti-tracking pixel feature in Mail.</p>\n\n\n\n<p>If you’re on a paid iCloud tier, Apple also added Private Relay, which sends Safari traffic in an encrypted format for when you’re using public Wi-Fi; Hide My Email so you can create unique, random email addresses; and expanded support for HomeKit Secure Video. Every Apple keynote pretty much brings bad news for advertisers and companies like Facebook and Google that get a lot of their revenue from advertising. Facebook has… “stooped to” is not the right phrase… <em>slid over to</em> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://forums.appleinsider.com/discussion/221980&amp;xcust=1-1-348250-0-0-0&amp;sref=https://www.macworld.com/feed\">funding “research papers”</a> talking about how Apple’s privacy features are “devastating” to “app developers, advertisers and the ads ecosystem”.</p>\n\n\n\n<p>Yeah. <em>Bummer.</em></p>\n\n\n\n<p>More like this, please, Apple.</p>\n\n\n\n<p>Even these changes, however, as great as they are, don’t come without a zinger you can apply.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://stratechery.com/2020/facebooks-earnings-apples-ad-exception-facebooks-headwinds/&amp;xcust=1-1-348250-0-0-0&amp;sref=https://www.macworld.com/feed\">As Ben Thompson has noted</a> (subscription), Apple chose not to include itself in the iOS 14 switch that turns off tracking at the top of the Privacy page in Settings. Instead, you have to scroll down to the bottom to find the Apple Advertising section to turn off “Personalized Ads” if you want to also stop <em>Apple</em> from tracking you for advertising purposes. At least it’s there and having Apple track you is probably slightly better than having anyone who wants to pay for the information track you. But that’s not so much weak tea as it is hot water with a brown crayon in it.</p>\n\n\n\n<p>These are all still really great improvements for privacy. Just walk the walk, Apple, and you’d get full marks.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4e13119f93e93b7e31cb7f1e7be131dcb1e246e72d430748687a5b17a3556de0","category":"Apple"}