{"title":"Service Quality and Customer Satisfaction with Special Reference to Restaurants","link":"https://www.preprints.org/manuscript/202407.1441/v2","date":1721309003000,"content":"In the foodservice industry, clients judge not only the product standard but also the service quality they receive during their restaurant experience. Therefore, when the importance of the dining experience is strongly regarded by consumers in terms of intellectual and motivational attributes, they are happier to suggest the establishment to others. The main objective of this research is to study the influence of different service quality factors in restaurants and their impact on customer satisfaction. This research is also undertaken to evaluate the identification of important factors for the restaurant industry and the levels of service quality among customers satisfaction with the services offered by restaurants in India. As factor analysis, correlation, and regression research, this study was conducted using a modified IBM SPSS Statistics 24 and AMOS instrument among the 630 randomly selected customers. A weighted mean was used to describe the levels of service quality and customer satisfaction. Multiple regressions were used to determine the predictors of customer satisfaction. The results reveal the main 12 service quality factors, which are: 1. Process-related factors: system for take-away orders, order tracking system, and time for food preparation 2. People-related factors: focus on customers' special requests, peer group influence, and making you feel special. 3. Physical Environment: Walking Space, Architecture of the Restaurant, and Signals for Direction 4. Performance-related factors: food served at an appropriate temperature; food presentation; portion size of food in the restaurant. The researchers have developed one model on service quality factors that is described in the research paper.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4e14f32b4c4f21a3fb2c83009f99457773a070afea290cbc66346149547e69bc","category":"Interdisciplinary"}