{"title":"Understanding the Mellowing Effect of Bottle Aging on the Sensory and Aesthetic Perceptions of Varietal Dry White Wines","link":"https://www.preprints.org/manuscript/202407.2276/v1","date":1722240468000,"content":"The aging ability of dry white wines has been increasingly recognised. The present work aimed to understand which sensory factors drive their quality evaluation by experienced tasters. Individuals assessed several aesthetic, synthetic, and analytic flavour attributes, using dark tasting glasses. Wines originated from the grape varieties Alvarinho, Arinto, Sauvignon Blanc and Pinot Bianco with a wide range of ages. Basic physical-chemical analysis, browning (Abs 420 nm), elemental composition and a partial volatile fraction were also determined. The overall quality scores were a function of complexity and balance and were negatively influenced by the perception of faultiness. The different ages could be associated with a continuous sensory space characterised by a decreasing perception of freshness and an increase in the mellowed flavours. All wines shared an austere in-mouth perception elicited by their acidity, saltiness, bitterness, smoothness and dryness. Nevertheless, quality scores were similar from the youngest to the oldest-tasted wines (17 years old). The exception was a Sauvignon Blanc wine from a recent vintage that was judged as faulty due to the perception of earthiness. Overall, the tasted wines displayed an unexpected aging ability as demonstrated by the difference between the predicted and real wine ages. To improve the recognition of old wines, the metaphor “mellowed by age” is proposed to describe flavours resulting from beneficial aging instead of “oxidised by age”.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4e17129251f86df16eb4141ea6c2ce5ead2dbd0ec02ec5b3fa38c833974c6639","category":"Interdisciplinary"}