{"title":"Genital coupling and copulatory wounding in the interspecific mating of the Drosophila auraria species complex (Diptera: Drosophilidae)","link":"https://academic.oup.com/biolinnean/article/141/4/493/7275665?rss=1","date":1694822400000,"content":"<span><div>Abstract</div>Structural matching of genitalia between sexes of the same species would guarantee a stable mating posture and tight genital coupling that minimizes the reproductive cost in females. Interspecific mating might cause mismatches in genital structures between sexes, leading to an unstable mating posture, abnormal genital coupling, enhanced risk of wounding to the genitalia, and reduced mating duration. In this study, copulation duration, mating posture, genital coupling and copulatory wounding were analysed in reciprocal combinations of interspecific mating between <span>Drosophila auraria</span> and <span>Drosophila triauraria</span> and between <span>Drosophila biauraria</span> and <span>Drosophila subauraria</span>. Interspecific mating exhibited a large variation in copulation duration, and copulatory wounds were produced in females at positions that lacked the corresponding fold structures, although the frequency of copulatory wounds was sometimes lower than in intraspecific mating. The angle of the aedeagus insertion during mating and positions of the copulatory wounds after interspecific mating were as expected from the male species, suggesting that males attempt to tighten genital coupling and stabilize copulation using the genitalia regardless of the female species. As in other groups of <span>Drosophila</span> studied to date, the species-specific structures in female genitalia contact the conspecific male organs during copulation, and the results suggest that they might have functions related to sexual conflict or sexual selection.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"4e2340ba3fc342843457a9afc52a4ed81f7e18111de958f50403d87babae4a5a","category":"Environment"}