{"title":"Gurman Predicts Big March for Apple: New iPads Pro and Air, M3 MacBook Airs, and New iPad Peripherals","link":"https://www.bloomberg.com/news/articles/2023-12-06/apple-prepares-m3-macbook-air-and-revamped-ipad-pro-for-early-next-year?srnd=premium","date":1701893620000,"content":"\n<p>Mark Gurman, reporting for Bloomberg:</p>\n\n<blockquote>\n  <p>The iPad Air, which is the company’s mid-tier tablet, currently \ncomes with a 10.9-inch screen. For next year’s release, the \ncompany will add a version that’s about 12.9 inches, matching the \nsize of what’s currently the biggest iPad Pro. </p>\n\n<p>The company is also preparing revamped versions of the Apple \nPencil and Magic Keyboard accessories, which it will sell \nalongside the new iPad Pro. The new Pencil — codenamed B532 — \nwill represent the third generation of the product. The company \nreleased a new low-end model in November. </p>\n\n<p>The new Magic Keyboards — codenamed R418 and R428 — will make \nthe iPad Pro look more like a laptop and include a sturdier frame \nwith aluminum. </p>\n</blockquote>\n\n<p>A big iPad Air is interesting, and I suspect will prove popular. No word, alas, on a new iPad Mini though. (I wish Apple would drop the “Mini” brand and just make the iPad Air in three sizes: mini, regular, and large, with identical specs.)</p>\n\n<p>Gurman offers no details about the form factor for the updated iPad Pro models. Given that last year’s 10th-generation regular iPad moved the front-facing camera to the long side of the device — the appropriate location for a camera when the iPad is being used laptop-style — it seems like a safe guess that Apple will do the same with these next-gen iPad Air and Pro models. But the spot where that camera would go is currently the same spot where current iPad Pros have the magnetic attachment for a 2nd-gen Apple Pencil. So I think that’s why Apple is going to introduce a 3rd-gen Pencil — they might need an altogether new way of pairing, charging, and attaching Pencils if they move the front-facing camera to the long side. (Well, that’s <em>one</em> reason to create a 3rd-gen Pencil. Other reasons, of course, would include various ways of making a <em>better</em> stylus — <a href=\"https://www.apple.com/newsroom/2018/10/new-ipad-pro-with-all-screen-design-is-most-advanced-powerful-ipad-ever/\">the current 2nd-gen Pencil is now over 5 years old</a>.)</p>\n\n<p>I’m also quite curious about the purported reimagined Magic Keyboards. The current ones are transformative for iPads, functionally, but the rubbery surface material just isn’t durable enough — especially the white ones. MacBooks are remarkably durable; iPad Magic Keyboards demand to be treated carefully. On mine, the rubber <a href=\"https://mastodon.social/@gruber/111535291723972240\">is peeling away around my most-used keys</a>. That shouldn’t happen with any keyboard, but it definitely shouldn’t happen with one that costs $300-350.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/12/06/gurman-apple-march\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"4e25820e0f78991cc84ebac27e4d0aeca839771f1e6721976860451b9fe4a19d","category":"Tech"}