{"title":"PSVII-23 Discriminating meat from different Canadian cattle feeding systems by visible and near-infrared spectroscopy","link":"https://academic.oup.com/jas/article/102/Supplement_3/686/7757604?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Labeling of meat products is key to guarantee quality and origin. Rising production costs and an increase in world trade are leading to an on-going growth of meat fraud. Hence, the objective of this study was to evaluate the potential of visible and near-infrared (Vis-NIR) spectroscopy to discriminate meat from different Canadian cattle feeding systems. Steers (n = 45) were randomly assigned to three feeding systems: barley (n = 15), corn (n = 15) or grass-fed (n = 15). At 72 h postmortem, Vis-NIR spectra were collected on a) the longissimus thoracis (LT) muscle between the 12<sup>th</sup> and 13<sup>th</sup> ribs after 20 min of blooming (intact lean), and b) the adjacent subcutaneous fat from each in-bone ribeye. Afterwards, a steak from the anterior side of the striploin was collected and frozen at -20°C until analysis. After thawing at 4°C overnight, the striploin steak was ground and spectra were collected (ground meat). Four spectral replicates were acquired from each tissue sample with a portable LabSpec4 Standard-Res spectrometer (380–2,500 nm; 1 nm-bandwidth). The absorbances of the visible (Vis), near-infrared (NIR), and both regions combined (Vis-NIR) were later imported into the software PLS_Toolbox 9.3. under MATLAB R2023b. After the application of several mathematical pre-processing treatments, Partial Least Square-Discriminant Analysis (PLS-DA) and Support Vector Machine (SVM) discriminant approaches were performed. For the intact tissue, the best results were obtained using the Vis-NIR region with a combination of 2<sup>nd</sup>derivative+smoothing+mean center, and a PLS-DA with 6 latent variables (LV). This approach correctly classified 100% of the meat samples from each feeding group, with an area under the curve of a receiver operating characteristic curve (AUROC) of 1 in cross-validation (CV). Likewise, 100% of the fat samples from each feeding system were correctly classified in CV, using only the Vis region and 2<sup>nd</sup>derivative+smoothing+mean center by PLS-DA (5 LV and AUROC<sub>CV</sub> = 1). For ground meat, both PLS-DA (Vis, smoothing + mean center, 6 LV, AUROC<sub>CV</sub> = 1 or Vis-NIR, mean scatter correction, 6 LV, AUROC<sub>CV</sub> = 1) and SVM (Vis-NIR, smoothing + standard normal variate) correctly classified 100% of the samples from barley, corn and grass-fed in CV. The classification was successful only considering the Vis region due to the high homogenization of these samples. For fat, the significant variable importance in projection (VIP) scores were found at 423 to 612 nm, where carotenoids absorb energy. This would explain the accuracy of the Vis region for the classification of the fat samples. For intact and ground meat, significant VIP scores were found in both the Vis region, due to the myoglobin absorption, and NIR region (1,796 to 1,900 nm), due to the vibration of the hydrocarbon bonds from fatty acids. Hence, these results showed the potential of Vis-NIR spectroscopy to authenticate either fat, intact lean or ground meat from cattle fed different diets.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4e2a0337b677a3ebb3c769a12a36e7d47c3593bdb2459c5bdea2d4aa150b9b26","category":"Environment"}