{"title":"Beyond salinity: Plants show divergent responses to soil ion composition","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13821?af=R","date":1709219358000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>In salt-affected environments, salinity shapes ecosystem functions and species composition. Apart from salinity, however, we know little about how soil chemical factors affect plant species. We hypothesized that specific ions, most of which contribute to salinity, co-determine plant niche differentiation. We asked if the importance of ions differs for species with (halophytes) and without (associated species) physiological adaptations to saline soils.</p>\n<h2>Location</h2>\n<p>Carpatho-Pannonian region (Central and Eastern Europe).</p>\n<h2>Time period</h2>\n<p>2005–2021.</p>\n<h2>Major taxa studied</h2>\n<p>Vascular plants.</p>\n<h2>Methods</h2>\n<p>We recorded species occurrences and collected soil samples in 433 plots in saline habitats. We measured pH, salinity (electrical conductivity), and concentrations of Ca<sup>2+</sup>, K<sup>+</sup>, Mg<sup>2+</sup>, Na<sup>+</sup>, SO<sub>4</sub>\n<sup>2−</sup> Cl<sup>−</sup>, CO<sub>3</sub>\n<sup>2−</sup> and mineral nitrogen (mN) and calculated the sodium adsorption ratio (SAR). For 88 species, we fitted response curves with Huisman–Olff–Fresco (HOF) models. To study ions' effects on species composition and ions' variance, we compared unconstrained and constrained ordinations and performed a principal component analysis. We used random forests to analyse the importance of ions for individual species and created two-dimensional species niche plots for key ions.</p>\n<h2>Results</h2>\n<p>Ion concentration niches varied among species and did not necessarily correspond to soil salinity or alkalinity. We frequently observed monotonic, sigmoidal model responses, while skewed unimodal responses were rare. Ions explained a considerable proportion of species compositional variation. Particularly, Na<sup>+</sup>, SO<sub>4</sub>\n<sup>2−</sup>, Cl<sup>−</sup>, and CO<sub>3</sub>\n<sup>2−</sup> contributed to the ions' variance. Na<sup>+</sup>, followed by SO<sub>4</sub>\n<sup>2−</sup>, Cl<sup>−</sup>, CO<sub>3</sub>\n<sup>2−</sup>, Ca<sup>2+</sup>, Mg<sup>2+</sup>, and mN, was most important for the occurrence of individual species. Compared to associated species, Na<sup>+</sup>, SO<sub>4</sub>\n<sup>2−</sup>, and mN were significantly less important for halophytes, whereas Cl<sup>−</sup> and CO<sub>3</sub>\n<sup>2−</sup> played a significant role.</p>\n<h2>Main conclusions</h2>\n<p>We show that ion composition co-determines niche differentiation in saline soils, suggesting evolved physiological adaptations in halophytes. Our study calls for incorporating high-resolution data on soil ion composition in ecological research.</p>","author":"Ricarda Pätsch, \nGabriele Midolo, \nZuzana Dítě, \nDaniel Dítě, \nViktoria Wagner, \nMichal Pavonič, \nJiří Danihelka, \nZdenka Preislerová, \nMirjana Ćuk, \nHans Georg Stroh, \nTibor Tóth, \nHelena Chytrá, \nMilan Chytrý","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"4e2a94f89f651e072e3374ea7c041174f0fd55f8dd1ec01ae1ca2340b1942c29","category":"Environment"}