{"title":"Impacts of age and environment on postnatal microglial activity: Consequences for cognitive function following early life adversity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306022","date":1719324000000,"content":"<p>by Michaela Fanikos, Skylar A. Kohn, Rebecca Stamato, Heather C. Brenhouse, Kelsea R. Gildawie</p>\r\n\r\nEarly life adversity (ELA) increases the likelihood of later-life neuropsychiatric disorders and cognitive dysfunction. Importantly, ELA, neuropsychiatric disorders, and cognitive deficits all involve aberrant immune signaling. Microglia are the primary neuroimmune cells and regulate brain development. Microglia are particularly sensitive to early life insults, which can program their responses to future challenges. ELA in the form of maternal separation (MS) in rats alters later-life microglial morphology and the inflammatory profile of the prefrontal cortex, a region important for cognition. However, the role of microglial responses <i>during</i> MS in the development of later cognition is not known. Therefore, here we aimed to determine whether the presence of microglia during MS mediates long-term impacts on adult working memory. Clodronate liposomes were used to transiently deplete microglia from the brain, while empty liposomes were used as a control. We hypothesized that if microglia mediate the long-term impacts of ELA on working memory in adulthood, then depleting microglia during MS would prevent these deficits. Importantly, microglial function shifts throughout the neonatal period, so an exploratory investigation assessed whether depletion during the early versus late neonatal period had different effects on adult working memory. Surprisingly, empty liposome treatment during the early, but not late, postnatal period induced microglial activity changes that compounded with MS to impair working memory in females. In contrast, microglial depletion later in infancy impaired later life working memory in females, suggesting that microglial function during late infancy plays an important role in the development of cognitive function. Together, these findings suggest that microglia shift their sensitivity to early life insults across development. Our findings also highlight the potential for MS to impact some developmental processes only when compounded with additional neuroimmune challenges in a sex-dependent manner.","author":"Michaela Fanikos","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4e2f805b475ccc2b150f4eb52f211de2d51ad60d0a8431a35e8e594dbe9fe142","category":"Interdisciplinary"}