{"title":"The Past, Present, and Future of the Internet: A Statistical, Technical, and Functional Comparison of Wired/Wireless Fixed/Mobile Internet","link":"https://www.preprints.org/manuscript/202404.1855/v1","date":1714357126000,"content":"This paper examines the quantitative and qualitative situation of the current fixed and mobile Internet and its expected future. First, the number of users and penetration rate of the Internet, various types of services in different countries, the ranking of countries in terms of the mean and median download and upload Internet data speeds, Internet data volume, and number and location of data centers in the world are presented. The second task introduces and details twelve performance evaluation metrics for broadband Internet access. Third, different wired and wireless Internet technologies are introduced and compared based on data rate, coverage, type of infrastructure, and their advantages and disadvantages. Based on the technical and functional criteria, in the fourth work, two popular wired and wireless Internet platforms, one based on optical fiber and the other based on the 5G cellular network, are compared in the world in general and Australia in particular. Moreover, this paper has a look at Starlink as the latest satellite Internet candidate, especially for rural and remote areas. The fifth task outlines the latest technologies and emerging broadband Internet-based services and applications in the spotlight. Sixthly, it focuses on three problems in the future Internet in the world, namely the digital divide due to the different quality of the Internet and new Internet-based services and applications of emerging technologies, the impact of the Internet on social interactions, and hacking and insecurity on the Internet. Finally, some solutions to these problems are proposed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4e307a972f255687af055c25f55dd45f3378f34ce2ccc9bdcd777e505cd11fa5","category":"Interdisciplinary"}