{"title":"The effects of dacitic (rhyolitic) tuff breccia and corn distillers’ dried grains with solubles (DDGS) inclusion on pellet mill electrical efficiency, production rate, and subsequent pellet quality","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae112/7718978?rss=1","date":1721779200000,"content":"<span><div>Abstract</div>Two experiments were conducted to evaluate the effect of Azomite (AZO) and 30% distillers' dried grains with solubles (DDGS) on pellet mill (PM) electrical consumption (kWh/MT), production rate, and pellet quality. Experiment 1 was conducted as a 2 × 2 × 2 factorial with main effects of diet formulation (0% or 30% DDGS), PM (1 or 2), and AZO (0% or 0.25%) with 4 replications per treatment. PMs were equipped with a 4.4 × 39.0-mm (L:D 8.9) or 4.4 × 35.8 mm (L:D 8.2) die with PM production rates held constant at 31.8 metric ton (MT)/h and conditioning temperature was held constant at approximately 82 °C. Experiment 2 was designed as a 2 × 2 factorial of treatments with 4 replicates per treatment to evaluate the impact of AZO and DDGS on PM production rates and pellet quality. PM production rate was adjusted by the feeder screw to maintain 70% motor load, a 4.0 × 35.8-mm (L:D 8.75) PM die was used, and conditioning temperature held constant at approximately 82 °C. For experiment 1, a DDGS × PM interaction (<span>P = </span>0.040) was observed. Diets containing 30% DDGS had a decreased kWh/MT compared to the control when using PM-1, whereas no differences were observed for kWh/MT between 0% and 30% when using PM-2. A DDGS × PM interaction (<span>P</span> = 0.019) was observed for kWh/MT standard deviation (STD). Diets containing DDGS increased STD compared to the control when pelleted with PM-2; however, there was no evidence of difference between the DDGS and control diets when pelleted with PM-1. There was an AZO × DDGS interaction (<span>P</span> &lt; 0.05) for kWh/ton STD. No differences were observed in kWh/ton STD when pelleting corn–soy diets with or without AZO while AZO reduced kWh/ton STD in 30% DDGS diets. Diets containing AZO had reduced (<span>P</span> &lt; 0.05) kWh/MT and pellet durability index (PDI) compared to diets pelleted without AZO. PDI was improved (<span>P</span> &lt; 0.05) for diets containing DDGS. For experiment 2, diets containing AZO had increased (<span>P</span> &lt; 0.05) PM production rate compared to those without AZO. The inclusion of 30% DDGS reduced (<span>P</span> &lt; 0.05) PM production rate compared to the corn–soy diet. There was a tendency for an AZO × DDGS interaction (<span>P</span> = 0.083) for PDI. Azomite inclusion to corn–soy diets reduced PDI while there was no evidence of difference in diets containing DDGS. In conclusion, the addition of 0.25% AZO to the diet improved PM efficiency; however, this potentially leads to a reduced PDI depending on diet type and PM settings.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"4e3127ec168e7b4b7ef93d5a078c52ec97b10480bcb0f607dfb25dae0d9debff","category":"Environment"}