{"title":"Ecological investigations of giant Phaeocystis colonies in Viet Nam: I. Cell abundance and elemental composition","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13479?af=R","date":1724695876000,"content":"<h2>Abstract</h2>\n<p><i>Phaeocystis globosa</i> is an important bloom-forming marine phytoplankton species that often accumulates to large levels in temperate and tropical waters and has significant impacts on food webs and biogeochemical cycles. It can form “giant” colonies that reach 3 cm in diameter. Microscopic observations, colony elemental composition, and pigment composition were analyzed to assess the characteristics of colonies as a function of colony size. Particulate organic carbon (POC) per unit surface area, colonial cell density, and chlorophyll <i>a</i> per unit surface area all increased with colony size, in contrast to results from temperate waters. Cellular chl <i>a</i> averaged 0.85 pg chl · cell<sup>−1</sup>. Colonies had both photosynthetic and protective pigments, with fucoxanthin being the dominant accessory pigment. Based on chl <i>a</i> and pigment levels, it appears colonies were acclimated to relatively low irradiances, likely due to their life cycle and the extremely turbulent environment in which they grew. Mucous carbon ranged from 16.2% to 79.2% of the total POC, and mucous carbon per unit surface area increased with colony size, suggesting that the mucous envelope did not thin as the colony grew. Based on elemental composition, nitrogen did not appear to limit growth, but phosphorus:carbon ratios were similar to those of P-limited cultures. Giant colonies represent an extreme response to the environment, but they do not appear to have greatly different characteristics than other tropical strains.</p>","author":"Rui Meng, \nWalker O. Smith Jr, \nRuobing Cao, \nHai Doan‐Nhu, \nLam Nguyen‐Ngoc, \nJinxiu Wang","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"4e3cd5e2f48d6de4400b9e1baaa9d62b05eb032ebec37a0d96e850da163f7b19","category":"Environment"}