{"title":"Sediment–vegetation interactions determine the fate of fluvial sediment in the upper reaches of a large estuary","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12502?af=R","date":1704799687000,"content":"<h2>Abstract</h2>\n<p>Feedbacks between sediment and plants in the submersed aquatic vegetation (SAV) beds of the Susquehanna Flats help modulate sediment delivery into the upper Chesapeake Bay from its major tributary (Susquehanna River). Recent modeling work has shown that SAV can steer the river plume, directly controlling sediment transport and fate. However, transport mechanisms likely differ between flood and non-flood conditions and depend on event timing. An opportunity to evaluate these insights in the field occurred with several flood events in summer 2018. Sediment and biomass samples were collected after the flood in the large, continuous main SAV bed of the Flats and in smaller patches to the west of the main bed to evaluate the effect of SAV bed size (width). Sediment characteristics (grain size, organic content) and deposition rates were compared to previous observations during non-flood conditions in the main bed in 2014–2015 and in the smaller patches in 2019. Overall, sediment deposition rates could be predicted by an empirical model including sediment load, vegetation biomass, and SAV bed width, reflecting the role of vegetation in steering the Susquehanna River plume and modulating sediment input to the upper Chesapeake Bay. Understanding spatiotemporal patterns of sedimentation is essential for realistic estimates of sediment and nutrient (especially nitrogen and carbon) storage in freshwater SAV systems, which have not received as much attention as their saltwater counterparts.</p>","author":"Cindy M. Palinkas, \nCassie Gurbisz, \nMiles C. Bolton","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"4e3fdf40679b79c8d263c2a3581b7762607bc4680085e6505bbed4db8bd80c24","category":"Environment"}