{"title":"Pseudo‐green water as a potential enhancer of growth and coloration in European lobster, Homarus gammarus, larvae","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13105?af=R","date":1728551418000,"content":"<h2>Abstract</h2>\n<p>Depleting European lobster, <i>Homarus gammarus</i>, wild stocks from historic overexploitation, stock enhancement programs, and farming of this lucrative species are viable options for meeting consumer demand. Early larval stages pose a hatchery challenge because of low survival rates. This study evaluates pseudo-green water benefits during the larval stage. Commonly used aquaculture algal species, <i>Tetraselmis suecica</i> (TS), <i>Dunaliella tertiolecta</i> (DT), and <i>Nannochloropsis</i> sp. (N), were tested as a monoculture or mixture treatment over 13 days post-hatching of the lobster larvae, from this, seven treatment permutations (TS, DT, N, TS + DT, TS + N, DT + N, and TS + DT + N) were included. A further eighth treatment with no added algae was used as a basal reference point (control). The growth assessment found that co-culturing had benefited carapace length and shell coloration (cephalothorax, <i>p</i> = 0.023) but no enhancement to the weight or survival ratios was observed. All larvae reached stage III by the 13th day, with survival rates ranging between 12.5% and 20%. Results indicated that mixed algal species generally had higher mean growth perfromance values than monoalgal cultures and clearer water. <i>Nannochloropsis</i> sp. significantly improved growth performance (higher weight and length). Algal matrices containing <i>Nannochloropsis</i> sp. resulted in the highest growth performance, emphasizing the importance of co-culturing lobster larvae with algae to improve hatchery operations.</p>","author":"Matt E. Bell, \nJulie O'Grady, \nPaula C. Domech, \nErik R. Frontaura, \nSimon J. Davies, \nStephen McCusker, \nJames Hinchcliffe, \nAlex H. L. Wan","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"4e4901397fdae9aad5931ba85c7b85b19185fb630a9ff3389a8ab3777bbd4c65","category":"Environment"}