{"title":"Specific nanoprobe design for MRI: Targeting laminin in the blood-brain barrier to follow alteration due to neuroinflammation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302031","date":1712844000000,"content":"<p>by Juan F. Zapata-Acevedo, Mónica Losada-Barragán, Johann F. Osma, Juan C. Cruz, Andreas Reiber, Klaus G. Petry, Amael Caillard, Audrey Sauldubois, Daniel Llamosa Pérez, Aníbal José Morillo Zárate, Sonia Bermúdez Muñoz, Agustín Daza Moreno, Rafaela V. Silva, Carmen Infante-Duarte, William Chamorro-Coral, Rodrigo E. González-Reyes, Karina Vargas-Sánchez</p>\r\n\r\nChronic neuroinflammation is characterized by increased blood-brain barrier (BBB) permeability, leading to molecular changes in the central nervous system that can be explored with biomarkers of active neuroinflammatory processes. Magnetic resonance imaging (MRI) has contributed to detecting lesions and permeability of the BBB. Ultra-small superparamagnetic particles of iron oxide (USPIO) are used as contrast agents to improve MRI observations. Therefore, we validate the interaction of peptide-88 with laminin, vectorized on USPIO, to explore BBB molecular alterations occurring during neuroinflammation as a potential tool for use in MRI. The specific labeling of NPS-P88 was verified in endothelial cells (hCMEC/D3) and astrocytes (T98G) under inflammation induced by interleukin 1β (IL-1β) for 3 and 24 hours. IL-1β for 3 hours in hCMEC/D3 cells increased their co-localization with NPS-P88, compared with controls. At 24 hours, no significant differences were observed between groups. In T98G cells, NPS-P88 showed similar nonspecific labeling among treatments. These results indicate that NPS-P88 has a higher affinity towards brain endothelial cells than astrocytes under inflammation. This affinity decreases over time with reduced laminin expression. <i>In vivo</i> results suggest that following a 30-minute post-injection, there is an increased presence of NPS-P88 in the blood and brain, diminishing over time. Lastly, EAE animals displayed a significant accumulation of NPS-P88 in MRI, primarily in the cortex, attributed to inflammation and disruption of the BBB. Altogether, these results revealed NPS-P88 as a biomarker to evaluate changes in the BBB due to neuroinflammation by MRI in biological models targeting laminin.","author":"Juan F. Zapata-Acevedo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4e559c0f8b322bc446ff1c0189744b149afa40a8978de65eb4d3c68b1a7571cc","category":"Interdisciplinary"}