{"title":"Spatial variation in spring arrival patterns of Afro‐Palaearctic bird migration across Europe","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13850?af=R","date":1717830000000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Geographical patterns of migrant species arrival have been little studied, despite their relevance to global change responses. Here, we quantify continent-wide interspecific variation in spatiotemporal patterns of spring arrival of 30 common migrant bird species and relate these to species characteristics and environmental conditions.</p>\n<h2>Location</h2>\n<p>Europe.</p>\n<h2>Time Period</h2>\n<p>2010–2019.</p>\n<h2>Major Taxa Studied</h2>\n<p>Birds, 30 species.</p>\n<h2>Methods</h2>\n<p>Using citizen science data from EuroBirdPortal, we modelled arrival phenology for 30 Afro-Palaearctic migrant species across Europe to extract start and duration of species arrival at a 400 km square resolution. We related inter and intraspecific variation in arrival and duration to species characteristics and temperature at the start of the growing season (green-up).</p>\n<h2>Results</h2>\n<p>Spatial variation in start of arrival times indicates that it took, on average, 1.6 days for the leading migratory front to move northwards by 100 km (range: 0.6–2.5 days). There was a major gradient in arrival phenology, from species which arrived earlier, least synchronously, in colder temperatures and progressed slowly northwards to species which arrived later, most synchronously and in warmer temperatures and advanced quickly through Europe. The slow progress of early arrivers suggests that temperature limits their northward advance; this group included Aerial Insectivores and species wintering north of the Sahel. For the late arrivers, which included species wintering further south, seasonal resource availability in Africa may delay their arrival into Europe.</p>\n<h2>Main Conclusions</h2>\n<p>We found support for the green-wave hypothesis applying widely to migratory landbirds. Species arrival phenologies are linked to ecological differences between taxa, such as diet, and wintering location. Understanding these differences informs predictions of species' sensitivity to global change. Publishing these arrival phenologies will facilitate further research and have additional conservation benefits such as informing designation of hunting seasons. Our methods are applicable to any taxa with repeated occurrence data across large scales.</p>","author":"Jennifer A. Border, \nPhilipp H. Boersch‐Supan, \nJames W. Pearce‐Higgins, \nChris M. Hewson, \nChristine Howard, \nPhilip A. Stephens, \nStephen G. Willis, \nAlasdair I. Houston, \nGabriel Gargallo, \nStephen R. Baillie","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"4e5542e8c729698c3cf381e7be5bf18d78b0f546012ebbf23b899a1fa03671f0","category":"Environment"}