{"title":"A new booid snake from the Eocene (Lutetian) Konservat-Lagerstätte of Geiseltal, Germany, and a new phylogenetic analysis of Booidea","link":"https://academic.oup.com/zoolinnean/article/doi/10.1093/zoolinnean/zlad179/7471459?rss=1","date":1702339200000,"content":"<span><div>Abstract</div>We describe two exceptionally preserved fossil snakes from the Eocene Konservat-Lagerstätte of Geiseltal, located in the state of Saxony-Anhalt, Germany. The two snake specimens, GMH LIX-3-1992 and GMH XXXVIII-20-1964, can be confidently identified as booids based on general morphology and were thus compared to other geographically and/or temporally close fossil booids. We found that GMH LIX-3-1992 is morphologically very similar to <span>Eoconstrictor spinifer</span>, also from Geiseltal, and to <span>Eoconstrictor fischeri</span>, from the middle Eocene of Messel, but differs from both in a number of cranial and vertebral features. Based on these differences we erect the new species <strong><span>Eoconstrictor barnesi</span> sp. nov.</strong>; GMH XXXVIII-20-1964 is very similar to GMH LIX-3-1992 and the two differ only in features that are likely ontogenetic. Phylogenetic analyses of snakes using maximum parsimony and Bayesian inference on datasets inclusive of both morphological and molecular data consistently support a close affinity of <span>E. barnesi</span> to <span>E. fischeri</span> and <span>E. spinifer</span>. Our preferred phylogenetic hypothesis places the three species of <span>Eoconstrictor</span> in a clade that is sister to Neotropical Boidae, a result consistent with previous studies. The genus <span>Eoconstrictor</span> could provide an important calibration point for molecular clock studies of booids and snakes in general.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"4e579c28370c1d3ae784154e2e7f8506286e68380329753a2417b93f8a8c3d0b","category":"Environment"}