{"title":"Latest Beats Collaboration Features Beats Flex With Detachable Heart Charm","link":"https://www.macrumors.com/2023/03/29/beats-flex-verdy-heart-charm/","date":1680098400000,"content":"Apple's Beats by Dre brand is launching a new collaboration with graphic artist <a href=\"https://www.instagram.com/verdy/\">Verdy</a> and the Tokyo-based Girls Don't Cry project, featuring custom-designed Beats Flex earphones in a distinctive blue and red theme with a detachable heart charm on the cable.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/beats-flex-verdy.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThe collaboration includes an ad campaign featuring model Jasmine Daniels, who appears in a Girls Don't Cry-inspired bedroom listening to Koteri's \"Something I Need.\"<blockquote>\"Im really happy to work on the Beats Flex earphones because it's my wife's favorite style,\" said Verdy. \"We've made a friends-and-family version in the past, so I'm really excited to release this special colorway to the public.\"</blockquote><div></div>\r<br />\nBeats Flex <a href=\"https://www.macrumors.com/review/beats-flex/\">originally launched in late 2020</a> as the lowest-cost option in the Beats family. An evolution of the previous BeatsX model, the Beats Flex connect to your device wirelessly over Bluetooth, but the individual earbuds are connected by a cable that wraps behind the neck.\r<br />\n\r<br />\nInline modules along the cable house the battery, electronics, and physical controls for the earphones. Standard Beats Flex were originally priced at $49.99, but Apple <a href=\"https://www.macrumors.com/2021/09/27/beats-flex-headphones-price-increase/\">increased the price to $69.99</a> in late 2021, likely due to supply chain issues that increased the cost of components. Occasional sales have, however, continued to drop pricing to the $50 range from time to time.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/beats-flex-verdy-packaging.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThe limited-edition Girls Don't Cry Beats Flex will be available for $69.99 (£69.99 / ¥9800) starting Saturday, April 1, via <a href=\"https://girlsdontcryshop.com/\">Girlsdontcryshop.com</a> and <a href=\"https://www.doverstreetmarket.com\">Dover Street Market</a> locations in the United States, United Kingdom, and Japan. Verdy will also host a special retail pop-up on April 1 at Rise Above Gallery in Osaka, Japan.<div>Tags: <a href=\"https://www.macrumors.com/guide/beats/\">Beats</a>, <a href=\"https://www.macrumors.com/roundup/beats-flex/\">Beats Flex</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/29/beats-flex-verdy-heart-charm/\">Latest Beats Collaboration Features Beats Flex With Detachable Heart Charm</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/latest-beats-collaboration-features-beats-flex-with-detachable-heart-charm.2385222/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4e581ff56cac643aa4980ec3e8c91a985b2f995a2eefdbf77f30310887ccea72","category":"Apple"}