{"title":"New multi-language docs simplify CDK for Terraform adoption","link":"https://www.hashicorp.com/blog/new-multi-language-docs-simplify-cdk-for-terraform-adoption","date":1690214400000,"content":"<p>If you are not familiar with HashiCorp Configuration Language (HCL) or prefer other programming languages when using HashiCorp Terraform, <a href=\"https://developer.hashicorp.com/terraform/cdktf\">CDK for Terraform</a> (CDKTF), <a href=\"https://www.hashicorp.com/blog/cdk-for-terraform-now-generally-available\">released in GA</a> last August, lets you define and provision cloud infrastructure using your choice of language (includingTypeScript, Python, C#, Java, and Go), while still benefiting from the full ecosystem of Terraform providers and modules. But until now, there was no easy way to discover examples of resource configurations in your preferred language without doing your own mental translation.</p>\n\n<p>Today, we are excited to announce CDK for Terraform multi-language provider docs in the <a href=\"https://registry.terraform.io/\">Terraform Registry</a>. This helps you simplify infrastructure provisioning and improve productivity by offering provider configuration options and code samples for the programming languages supported by CDKTF alongside the HCL documentation in the registry.</p>\n\n<p>If you are new to working with a particular resource in your preferred programming language, such as TypeScript, for example, you can copy-paste the code samples from the multi-language provider docs in the registry and then adapt them for your needs. This is especially useful when starting a new project — no mental translation required.</p>\n<p>We are launching this feature with the following set of providers and resources and plan to gradually expand the documentation over time:</p>\n\n<ul>\n<li><a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs\">Amazon Web Services (AWS) provider documentation</a> (available in TypeScript and Python)\n\n<ul>\n<li>Services: EC2, Lambda, VPC, and EKS</li>\n</ul></li>\n<li><a href=\"https://registry.terraform.io/providers/hashicorp/tfe/latest\">Terraform Cloud/Enterprise provider documentation</a> (available in TypeScript and Python)</li>\n</ul>\n\n<p>To view the new documentation, navigate to the Terraform Registry and then to the particular <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/ec2_host?lang=typescript\">resource page</a> you want to provision in your CDKTF project. For example, if you’d want to provision an Amazon EC2 Dedicated Host in TypeScript, you can now find the translated snippet in the Registry by selecting “TypeScript” in the language selection dropdown. </p>\n<img src=\"https://www.datocms-assets.com/2885/1689968219-cdktf-multi-lang.png\" alt=\"Terraform\" /><h2>Try CDK for Terraform</h2>\n\n<p>CDKTF is designed to help make Terraform adoption easier so more developers will enjoy the benefits that Terraform provides — cost savings, faster delivery, and reduced risk. The new multi-language provider docs are another major step toward that goal.</p>\n\n<p>If you’re new to the project, these <a href=\"https://developer.hashicorp.com/terraform/tutorials/cdktf\">tutorials for CDK for Terraform</a> are the best way to get started. You can dive deeper into our documentation with this <a href=\"https://developer.hashicorp.com/terraform/cdktf\">overview of CDKTF</a>.</p>\n\n<p>Whether you’re still experimenting or actively using CDK for Terraform, we’d love to hear from you. Please <a href=\"https://github.com/hashicorp/terraform-cdk/issues/new?assignees=&amp;labels=bug%2C+new&amp;template=bug-report.md&amp;title=\">file any bugs you encounter</a>, let us know about your <a href=\"https://github.com/hashicorp/terraform-cdk/issues/new?assignees=&amp;labels=enhancement%2C+new&amp;template=feature-request.md&amp;title=\">feature requests</a>, and share your questions, thoughts, and experiences in the <a href=\"https://discuss.hashicorp.com/c/terraform-core/cdk-for-terraform/47\">CDK for Terraform discussion forum</a>.</p>\n","author":"Ansgar Mertens","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"4e5cc9a5e9d0e6a56115720841270367d9a9b731bdd15374df772e839fc42e12","category":"Tech"}