{"title":"Screening and Analyzing of Genes and Signaling Pathways Associated with Size Differentiation of Adult Male Prawn Macrobrachium nipponense","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/3134932?af=R","date":1675497600000,"content":"<p>To better understand the size differentiation mechanism of adult male prawn <i>Macrobrachium nipponense</i>, transcriptome sequencing was performed from the second pereiopod, hepatopancreas, and muscle of adult male prawn <i>M. nipponense</i> with significant differences in size (large: 1.47 ± 0.12 g; small: 0.28 ± 0.04 g). A total of 46,557 unigenes with an average length of 1,312 bp were obtained. Based on pereiopod of large male (LP) versus pereiopod of small male (SP), muscle of large male (LM) versus muscle of small male (SM), and hepatopancreas of large male (LH) versus hepatopancreas of small male (SH), a total of 805, 473, and 1,037 significantly upregulated DEGs were identified, respectively. The KEGG pathway analysis indicated that pathways such as the PI3K-Akt pathway, the cAMP pathway, the Hippo pathway, and the Ras signaling pathway were enriched in all three comparisons, which may be key size regulators in adult male prawn <i>M. nipponense</i>. Furthermore, as potential candidates for size differentiation in adult male prawns, twenty-eight DEGs involved in these four pathways were screened out, and their expressions were verified by quantitative real-time PCR (qPCR). The results of this study preliminarily elucidate the molecular mechanism of male <i>M. nipponense</i> in size differentiation and provide a theoretical reference for improving the commercial size of cultured male prawn <i>M. nipponense</i>.</p>","author":"Gang Jiang, \nYongming Zhu, \nYucai Xue, \nYing Lu, \nZhiwei Liu, \nXuxiong Huang, \nLiqiao Chen","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"4e6625a5bee292044815c3f1224bcea52d9dbd86d0f276bffb2ee92777ed2fd0","category":"Environment"}