{"title":"Factors Impacting the Adoption and Acceptance of ChatGPT in Educational Settings: A Narrative Review of Empirical Studies","link":"https://www.preprints.org/manuscript/202409.0826/v1","date":1726045184000,"content":"This narrative review synthesizes findings from empirical studies to explore the factors influencing the adoption of ChatGPT in higher education. The review highlights several critical determinants, both confirmed and debatable, of ChatGPT acceptance among students and educators. Previous studies have predominantly utilized theories such as the Technology Acceptance Model (TAM), the Unified Theory of Acceptance and Use of Technology (UTAUT), and the Diffusion of Innovations (DoI) theory. Confirmed factors include performance expectancy, effort expectancy, social influence, facilitating conditions, and trust, which significantly predict user attitudes and intentions toward adopting ChatGPT. Perceived usefulness and ease of use are core components influencing adoption positively. However, some factors have shown inconsistent impacts. While generally critical, effort expectancy and facilitating conditions vary based on context. Social influence, demographic characteristics (age, gender), extrinsic motivation, and technology readiness exhibit inconsistent effects, suggesting that intrinsic motivations may be more critical. Data collection primarily used online surveys with structured questionnaires, varying widely in sample sizes from small pilot studies to large-scale surveys and covering diverse academic disciplines. Practical implications suggest enhancing perceived usefulness and ease of use through training and technical support, building trust by addressing privacy concerns, and leveraging social influence to drive adoption. The review underscores the need to refine technology acceptance models to incorporate broader psychological and contextual factors, integrate intrinsic motivation theories, and adopt a systems thinking approach. Addressing limitations such as potential selection bias and the quality and scope of existing studies, future research can develop robust models and provide deeper insights into ChatGPT adoption dynamics in higher education, supporting its effective integration to enhance learning outcomes and foster educational innovation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4e681f37fbe13d2159d65d6a1b65610b975c1824c694ef8420731d80594e037f","category":"Interdisciplinary"}