{"title":"Person who made the Windows 3.1 port of Wordle is back with a ChatGPT client","link":"https://arstechnica.com/?p=1949948","date":1687799313000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/wingpt_computer.png\" alt=\"WinGPT answering many pressing and cutting-edge questions.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/wingpt_computer.png\">Enlarge</a> <span>/</span> WinGPT answering many pressing and cutting-edge questions. (credit: <a href=\"https://www.dialup.net/wingpt/\">Dialup.net</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n\n<p>Microsoft is working to integrate ChatGPT-based technology into <a href=\"https://arstechnica.com/gadgets/2023/05/built-in-chatgpt-driven-copilot-will-transform-windows-11-starting-in-june/\">more and more places in Windows 11</a>, but it isn't doing the same for older versions of Windows. Those of you with an old Windows 3.1 or Windows 95 PC can breathe easy, though, because the same developer who created the Windows 3.1 version of <em>Wordle</em> has returned with a Windows 3.1 ChatGPT client called <a href=\"https://www.dialup.net/wingpt/\">WinGPT</a>.</p>\n<p>WinGPT supports any 16- or 32-bit version of Windows 3.1 or newer but won't run natively on 64-bit versions of Windows. You can download it from the bottom of <a href=\"https://www.dialup.net/wingpt/\">this Dialup.net page</a>, which also doubles as a development blog detailing how it was built and how its icon was designed. You'll need to provide your own OpenAI API key.</p>\n<p>Running ChatGPT on ancient systems is possible mostly because most processing happens on OpenAI's servers rather than locally, so you don't need a modern 16-core battle station to make it work. The main limitation on old hardware is memory rather than processing power. Windows 3.1 generally won't boot with more than 256MB, and a period-appropriate 386 or 486 PC would be more likely to use between 4MB and 8MB (for reference, here's <a href=\"http://www.1000bit.it/ad/bro/compaq/CompaqDeskPro-M-WindowsEdition.pdf\">a 1992 Compaq Deskpro ad</a> for 386 and 486 PCs). The OS would install and run on systems with as little as 1MB.</p></div><p><a href=\"https://arstechnica.com/?p=1949948#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1949948&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4e6af2c0ba38987338ad447bafa2732da7bc9018f13d01de57408cc2b441fb8d","category":"Tech"}