{"title":"A single base pair substitution in zebrafish distinguishes between innate and acute startle behavior regulation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300529","date":1710770400000,"content":"<p>by Elelbin A. Ortiz, Philip D. Campbell, Jessica C. Nelson, Michael Granato</p>\r\n\r\nBehavioral thresholds define the lowest stimulus intensities sufficient to elicit a behavioral response. Establishment of baseline behavioral thresholds during development is critical for proper responses throughout the animal’s life. Despite the relevance of such innate thresholds, the molecular mechanisms critical to establishing behavioral thresholds during development are not well understood. The acoustic startle response is a conserved behavior whose threshold is established during development yet is subsequently acutely regulated. We have previously identified a zebrafish mutant line (<i>escapist</i>) that displays a decreased baseline or innate acoustic startle threshold. Here, we identify a single base pair substitution on Chromosome 25 located within the coding sequence of the <i>synaptotagmin 7a</i> (<i>syt7a</i>) gene that is tightly linked to the <i>escapist</i> acoustic hypersensitivity phenotype. By generating animals in which we deleted the <i>syt7a</i> open reading frame, and subsequent complementation testing with the <i>escapist</i> line, we demonstrate that loss of <i>syt7a</i> function is not the cause of the <i>escapist</i> behavioral phenotype. Nonetheless, <i>escapist</i> mutants provide a powerful tool to decipher the overlap between acute and developmental regulation of behavioral thresholds. Extensive behavioral analyses reveal that in <i>escapist</i> mutants the establishment of the innate acoustic startle threshold is impaired, while regulation of its acute threshold remains intact. Moreover, our behavioral analyses reveal a deficit in baseline responses to visual stimuli, but not in the acute regulation of responses to visual stimuli. Together, this work eliminates loss of <i>syt7a</i> as causative for the <i>escapist</i> phenotype and suggests that mechanisms that regulate the establishment of behavioral thresholds in <i>escapist</i> larvae can operate independently from those regulating acute threshold regulation.","author":"Elelbin A. Ortiz","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4e6fadc0d0ad6da7d8b91e7d6ec3406b41019d2f8bd34e1630560ca49679e5eb","category":"Interdisciplinary"}