{"title":"Association between stringency of lockdown measures and emergency department visits during the COVID-19 pandemic: A Dutch multicentre study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303859","date":1716300000000,"content":"<p>by F. Marlijn Booij-Tromp, Nicole J. van Groningen, Sebastian Vervuurt, Juanita A. Haagsma, Bas de Groot, Heleen Lameijer, Menno I. Gaakeer, Jelmer Alsma, Pleunie P. M. Rood, Rob J. C. G. Verdonschot, Marna G. Bouwhuis</p>\r\nIntroduction <p>The COVID-19 outbreak disrupted regular health care, including the Emergency Department (ED), and resulted in insufficient ICU capacity. Lockdown measures were taken to prevent disease spread and hospital overcrowding. Little is known about the relationship of stringency of lockdown measures on ED utilization.</p> Objective <p>This study aimed to compare the frequency and characteristics of ED visits during the COVID-19 outbreak in 2020 to 2019, and their relation to stringency of lockdown measures.</p> Material and methods <p>A retrospective multicentre study among five Dutch hospitals was performed. The primary outcome was the absolute number of ED visits (year 2018 and 2019 compared to 2020). Secondary outcomes were age, sex, triage category, way of transportation, referral, disposition, and treating medical specialty. The relation between stringency of lockdown measures, measured with the Oxford Stringency Index (OSI) and number and characteristics of ED visits was analysed.</p> Results <p>The total number of ED visits in the five hospitals in 2019 was 165,894, whereas the total number of visits in 2020 was 135,762, which was a decrease of 18.2% (range per hospital: 10.5%-30.7%). The reduction in ED visits was greater during periods of high stringency lockdown measures, as indicated by OSI.</p> Conclusion <p>The number of ED visits in the Netherlands has significantly dropped during the first year of the COVID-19 pandemic, with a clear association between decreasing ED visits and increasing lockdown measures. The OSI could be used as an indicator in the management of ED visits during a future pandemic.</p>","author":"F. Marlijn Booij-Tromp","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4e740fd833ecd2dd403838043d69784e388b614d038868a4cb324026ebda8e04","category":"Interdisciplinary"}