{"title":"Transcription factor PpNAC1 and DNA demethylase PpDML1 synergistically regulate peach fruit ripening","link":"https://academic.oup.com/plphys/article/194/4/2049/7441650?rss=1","date":1700611200000,"content":"<span><div>Abstract</div>Fruit ripening is accompanied by dramatic changes in color, texture, and flavor and is regulated by transcription factors (TFs) and epigenetic factors. However, the detailed regulatory mechanism remains unclear. Gene expression patterns suggest that PpNAC1 (NAM/ATAF1/2/CUC) TF plays a major role in peach (<span>Prunus persica</span>) fruit ripening. DNA affinity purification (DAP)-seq combined with transactivation tests demonstrated that PpNAC1 can directly activate the expression of multiple ripening-related genes, including <span>ACC synthase1</span> (<span>PpACS1</span>) and <span>ACC oxidase1</span> (<span>PpACO1</span>) involved in ethylene biosynthesis, <span>pectinesterase1</span> (<span>PpPME1</span>), <span>pectate lyase1</span> (<span>PpPL1</span>), and <span>polygalacturonase1</span> (<span>PpPG1</span>) related to cell wall modification, and <span>lipase1</span> (<span>PpLIP1</span>), <span>fatty acid desaturase</span> (<span>PpFAD3-1</span>), and <span>alcohol acyltransferase1</span> (<span>PpAAT1</span>) involved in volatiles synthesis. Overexpression of <span>PpNAC1</span> in the tomato (<span>Solanum lycopersicum</span>) <span>nor</span> (nonripening) mutant restored fruit ripening, and its transient overexpression in peach fruit induced target gene expression, supporting a positive role of PpNAC1 in fruit ripening. The enhanced transcript levels of <span>PpNAC1</span> and its target genes were associated with decreases in their promoter mCG methylation during ripening. Declining DNA methylation was negatively associated with increased transcripts of <span>DNA demethylase1</span> (<span>PpDML1</span>), whose promoter is recognized and activated by PpNAC1. We propose that decreased methylation of the promoter region of <span>PpNAC1</span> leads to a subsequent decrease in DNA methylation levels and enhanced transcription of ripening-related genes. These results indicate that positive feedback between PpNAC1 and PpDML1 plays an important role in directly regulating expression of multiple genes required for peach ripening and quality formation.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"4e75022468f8528718d95b9dc2093433304c2313df2a89a26671dc6e9ad29856","category":"Environment"}