{"title":"Zipp 353 NSW wheelset review: is comfort the new aero?","link":"https://cyclingtips.com/2021/10/zipp-353-nsw-wheelset-review-is-comfort-the-new-aero/","date":1635209441000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-21-650x366.jpg\" /></div><h2>Zipp 353 NSW wheelset review: is comfort the new aero?</h2><p>\n</p><p>The high-end road wheel world is going through a transition period. While in recent years the industry has obsessed over watts of drag saved and yaw angles, the talk is noticeably shifting to what’s actually faster in the real world. </p>\n\n\n\n<p>Zipp is a name synonymous with aero. The brand played a large role in the creation of the aero wheel market and progressed it further than most. However even Zipp is beginning to change its tune, and the marketing for its latest range of 40-ish-millimetre-deep wheels waxes lyrical about almost every performance attribute except aerodynamic superiority. Personally, I find this an interesting transition and one that’s on its way to becoming more widespread in the industry. </p>\n\n\n\n<p>And it’s this transition that makes <a href=\"https://www.sram.com/en/zipp/models/wh-353-ntld-a1\">Zipp’s 353 NSW</a> – its new flagship do-it-all road or gravel race wheel – quite an interesting product to cover. At US$4,000 for a pair, this tubeless-only and disc-only wheelset is almost priced to be a conversation starter. And having spent some time on them I can see that while these are exceptionally nice wheels to ride, I’m left questioning the value proposition. </p>\n\n\n\n<p>There are obviously a whole lot of interesting tech and design decisions behind these pricey wheels, and so I decided I best write a word for every dollar they cost (just joking … but also not). </p>\n\n\n    <div>\n        <div>\n\t\t\t                <h2>Story Highlights</h2>\n\t\t\t\n\t\t\t                <ul>\n\t\t\t\t\t                        <li><strong>What:</strong> Zipp’s top-tier disc-brake do-it-all road wheelset.</li>\n\t\t\t\t\t                        <li><strong>Weight:</strong> 1,294 g, including tubeless tape and valves. </li>\n\t\t\t\t\t                        <li><strong>Price:</strong> US$4,000 / AU$6,027 (pair) </li>\n\t\t\t\t\t                        <li><strong>Highs:</strong> Undeniably smooth and controlled ride, stable, great warranty, impressively light, easy repair and service. </li>\n\t\t\t\t\t                        <li><strong>Lows:</strong> Price, no good for skinnier rubber, must use tubeless tyres, not for the aero lovers, a rare smidge of rotor rub at the front, price. </li>\n\t\t\t\t\t                </ul>\n\t\t\t        </div>\n    </div>\n\n\n\n\n<h2>No skinny rubber here</h2>\n\n\n\n<p>Intended to be a pinnacle product, the wavy-shaped 353 NSW (New Speed Weaponry) offers an effective 45 mm-deep rim and sits in Zipp’s wheel line-up as the do-it-all performance road wheel. It’s effectively the price-no-object halo version of the 5 mm shallower <a href=\"https://cyclingtips.com/2020/05/2021-zipp-303-firecrest/\">303 Firecrest</a> (US$1,939), a wheel that itself sits at a premium over <a href=\"https://cyclingtips.com/2020/05/new-zipp-303-s-aero-wheels-are-wider-hookless-tubeless-cheaper-disc-only/\">Zipp’s base-level 303 S</a> (US$1,327). All three are pitched as versatile and modern wheels for use across road and gravel riding. </p>\n\n\n\n<p>Like the mid-tier 303 Firecrest, the 353 NSW features a 25 mm internal width hookless (TSS) rim design that demands the use of compatible tubeless tyres. With such a wide rim, Zipp says those tyres must have at least a 28 mm printed width and be run at no more than 72.5 psi. In reality, most 28 mm tyres will sit beyond a measured 30 mm width on these rims. For example, Schwalbe’s Pro Ones in a 28 mm measure at an actual 31.3 mm, while Continental’s new GP5000 S TL in a 30 mm width come in at an actual 32.5 mm. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-3-1-1340x754.jpg\" /><figcaption>A rim this wide is going to make the tyre wider than its printed size. </figcaption></figure>\n\n\n\n<p>Those wanting to run 40-50 mm wide gravel tyres on these rims can do so with no issue, but I suspect most keen on such a premium wheel will be predominately looking to keep them away from pointed rocks. </p>\n\n\n\n<p>With such voluminous rubber matched with lower running pressures, the 353 NSW aims to offer lower rolling resistance, increased ride comfort, and better grip – and this is the basis for many of the <a href=\"https://www.sram.com/globalassets/publicsites/cms-campaign-pages-not-story-pages/zipp/totalsystemeffeciency/pdf-downloads/tse-explained2.pdfhttps://www.sram.com/globalassets/publicsites/cms-campaign-pages-not-story-pages/zipp/totalsystemeffeciency/pdf-downloads/tse-explained2.pdf\" target=\"_blank\">performance claims related to these wheels</a>. Of course, the lower tyre pressures (60 psi on average, according to Zipp) achieve much of that, but Zipp is confident that its wider rim provides better tyre support than a narrower rim at such low pressures.</p>\n\n\n\n<p>Zipp claims these are the most efficient wheels for general riding on mixed road surfaces and perhaps with a little dirt thrown in. And interestingly, the 353 NSW and 303 Firecrest share these benefits. </p>\n\n\n\n<p>A wide internal rim width and a hookless rim wall are not necessarily related. In a recent CyclingTips Nerd Alert podcast, we sat down with Zipp’s product manager Bastien Donzé to talk about <a href=\"https://cyclingtips.com/2021/09/nerd-alert-podcast-clearing-up-the-road-tubeless-wheels-and-tires-confusion/\" target=\"_blank\">all things hookless rims and why Zipp has decided to trade-in the option of open tyre compatibility</a>. In short, Zipp believes that hookless is the answer to creating a carbon rim that defies the old rule that things can’t be stronger, lighter, and cheaper. It could be argued that the 303 S and 303 Firecrest achieve all three, but ‘cheaper’ isn’t a feature to be seen with the 353 NSW. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-18-1340x754.jpg\" /><figcaption>Hookless rims are otherwise known as Tubeless Straight Side (TSS). </figcaption></figure>\n\n\n\n<p>Hookless rims certainly offer benefits but they also carry two obvious downsides. Firstly, you must run a compatible tubeless tyre (but you can run a tube within). The second is that the industry is currently in a transition period to making hookless-compatible tubeless road tyres. Thankfully signs are that this is a temporary transition. For example, Continental just updated its GP5000 tubeless tyre to be compatible. No, not all popular tyre options can currently be used with these rims but I believe this situation will wholly improve in the near future.  </p>\n\n\n\n<h2>Aero things </h2>\n\n\n\n<p>The 353 NSW is an easy one to spot from a distance as it features Zipp’s ‘Sawtooth’ rim profile that sees the 353’s rim depth flow between 42.7 and 46.5 mm. </p>\n\n\n\n<p>First introduced with the original (and deeper) 454 NSW, the wavy shape was initially released with talk of biomimicry research and the role of the tubercles found on humpback whales. The general idea was that the undulating shape produced a wheel that simulated the aero efficiency of a deeper rim with the crosswind stability of a shallower one. Zipp has since stopped talking about whales, and I was surprised to hear Donzé state that the shape only offers a marginal aerodynamic advantage on a rim of this depth.   </p>\n\n\n\n<p>“We actually think our Sawtooth profile only provides a small stability benefit on the 353,” he said. “The reason is simple: Sawtooth provides the most aero and stability benefits on deep profile rims, which is the reason it came out initially on 454 and 858. As the rim becomes shallower, the aerobalance benefits also become smaller.“ So why use the Sawtooth profile at all? I’ll get to that in the next section. </p>\n\n\n\n<p>Other details on the rim include Zipp’s intricate ‘Hyperfoil’ nodes and ‘Hexfin’ dimples that are the successor to the golf ball-like dimpling. According to Donzé, these do assist with keeping the airflow attached to the rim for longer and reduce the chance of <a href=\"https://en.wikipedia.org/wiki/Stall_(fluid_dynamics)\" target=\"_blank\">stalling</a>. And while no specific figures were shared, Donzé said “they do play a role in drag reduction and stability.“ </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-24-1340x754.jpg\" /><figcaption>A closer look reveals plenty of fine details in the rim surface. </figcaption></figure>\n\n\n\n<p>Identical front and back, the 353’s rims are covered in unique little aero details but perhaps miss the big picture. Compare those measured tyre widths above to the 30.65 mm exterior width of the rim, and straight away, you can see that these wheels don’t meet the often referenced <a href=\"https://www.youtube.com/watch?v=mDZ61aMegnQ\">105% rule</a> and are therefore not going to please the aero-obsessed. In fact, according to Donzé, the 353 NSW did not spend design time in a wind tunnel. </p>\n\n\n\n<p>Those after a Zipp-branded, aero, optimised road wheel for use on smoother surfaces should look to the <a href=\"https://cyclingtips.com/2021/06/zipp-launches-new-454-nsw-404-firecrest-and-858-nsw-go-fast-aero-wheels/\" target=\"_blank\">404 Firecrest and 454 NSW wheels</a>. These wheels feature a 2 mm narrower internal rim width that allows the use of a 25 mm tyre and therefore can hit the 105% rule. And when set up with their respective narrowest allowed tyres, the 454 NSW is said to sit at about 1.5-2 watts faster (at 45 km/h) when compared to the 353 NSW. No data was shared for how the 353 NSW compares to the 303 Firecrest. And of course, Donzé points out that the 353 NSW’s wider rim and wider required tyre will win back time on rougher surfaces. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-4-1340x754.jpg\" /><figcaption>Even a 28 mm (printed) tyre is wide enough to break the 105% rule. </figcaption></figure>\n\n\n\n<p>Clearly, Zipp is no longer solely focused on aerodynamic excellence, especially when it comes to a mid-depth wheel like the 353 NSW. A sceptical view of this scenario is that advanced aerodynamic design is not the golden ticket to sales it once was. The potential for aerodynamic advantage has dwindled in recent years as brands have figured out the low hanging fruit and are now often playing within the margin of error of a wind tunnel. The days of selling solely on one’s wind-cheating merit started decaying when generic wheel brands began copying such proven profiles. </p>\n\n\n\n<p>An optimistic view (and the side of the fence I mostly sit on) is that the market is maturing, and many of the big names are now clearly looking beyond the wind tunnel and are finally recognising that people ride bikes outdoors. Brands are now addressing the obvious issues of handling and stability in blustery conditions and are perhaps recognising that designing for a wind tunnel isn’t the best path for many riders. </p>\n\n\n\n<p>Zipp has partnered with aerodynamic test machinery experts <a href=\"https://www.aerolab.com/\">AeroLab</a> to perform outdoor aerodynamic and rolling resistance testing to take the place of indoor testing. This real-world testing is helping to provide more relevant data and is informing (and confirming) new areas for performance gains. Still, it’s early days for this tech and in the case of the 353 NSW, the company’s previous test resulted in corrupted and unusable data. The test involving the 353 NSW is yet to be repeated.  </p>\n\n\n\n<p>“Aero is not everything – it is only one component of speed, contrary to what the bike industry (and Zipp too, in all fairness) has been saying for many years,” said Donzé. “There are conditions in the real world where it’s faster to be less aero, as long as you have higher rolling efficiency and vibration damping. As a result, there’s no point in saying which of 353 or 454 is faster – it all depends on your ride style and the type of rides you are doing.</p>\n\n\n\n<p>“For high-speed rides on flat to undulating terrain and clean roads, 454 is probably the ticket. For longer rides, on rougher roads and with bigger elevation change; 353 is the better option.”</p>\n\n\n\n<h2>And we’re back to focussing on weight</h2>\n\n\n\n<p>Wider tyres and the advent of disc brakes have seen road bike weights trend upward, and it sure seems that wheel brands are once again pursuing the goal of fewer grams. </p>\n\n\n\n<p>The 303 Firecrest dropped a whopping 300 grams from its predecessor, and at about 1,400 grams with tubeless tape and valves it’s now by no means a heavy option. The 353 NSW manages to shave a further 100 grams while offering a deeper rim profile and marginally higher lateral stiffness. </p>\n\n\n\n<p>My front and rear sample wheels tipped the scales at 596 g and 698 g respectively (1,294 g for the pair with XDR driver body), including the pre-installed tubeless rim tape and the alloy tubeless valves. Now those weights aren’t the very lowest out, but they’re certainly pretty minuscule for a disc brake wheelset that features 24 Sapim CX-Ray steel bladed spokes front and rear and that maintains a decent rim depth and a wide internal width.</p>\n\n\n\n<p>A large contributor to the fewer grams comes from the Sawtooth rim profile, something that also allows the use of slightly shorter spokes, too. “The reason we’re using this profile on a 303 depth is that Sawtooth provides structural benefits for the rim: thanks to that shape, the rim becomes stronger and stiffer at a lighter weight”, explained Donzé, who later went on to summarise the design as offering the best combination of aero and lightweight. A 353 NSW rim weighs just 341 g. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-15-1340x754.jpg\" /><figcaption>Low wheelset weight is always the sum of all parts, but certainly, the rims play the main role here. </figcaption></figure>\n\n\n\n<p>Of course, such a detailed rim design carries an increased cost. “Sawtooth rims are more labour-intensive than Firecrest wheels – their profiles require significantly more time to layup and cure,” said Donzé. Both the 353 and 303 Firecrest rims are produced in-house within the USA.</p>\n\n\n\n<p>Also more expensive are the graphics which get printed directly onto the rim surface. Unlike the decals used on Zipp’s more affordable wheels, these are said to be lighter, fade-free, and won’t peel. </p>\n\n\n\n<h2>A look inside the hub </h2>\n\n\n\n<p>Zipp’s new Cognition V2 hubs also shave off a few grams and are designed to roll more freely than the ZR1 DB found in the Firecrest wheels. How much more freely do you ask? I have no idea, but the wheels spin for a hell of a long time. </p>\n\n\n\n<p>Zipp’s previous generation Cognition hub featured an intricate array of magnets and magic to provide engagement, and if things went wrong then no fun was had. By comparison, the Cognition V2 is vastly simpler in its design, it now offers a faster pick up (54T), is said to have lower friction, and of course, improved durability. With two drive rings that mesh with each other, the design isn’t all that different to being a vastly oversized version of <a href=\"https://cyclingtips.com/2020/04/dt-swiss-240-exp-hubs/\">DT Swiss’ EXP</a> hub design. </p>\n\n\n\n<p>Those “Axial Clutch” drive rings offer an intricate shape made with metal injection moulding. Pushing them together is a rather unique Sylomer spring assembly, or put more simply, the spring is made of lightweight foam and yet functions like a metal wave washer. That foam isn’t the stuff used in your couch, but rather is commonly found as a damper in power tools or in the medical imagery field, and is said to hold its mechanical properties over time. </p>\n\n\n\n<p>The ratchet rings are lubricated with oil, not grease, and are kept shielded by a large seal that’s pressed into the hub shell (take care when removing this). Zipp suggests <a href=\"https://www.sram.com/globalassets/document-hierarchy/service-manuals/zipp/wheels-and-hubs/zipp-cognition-v2-hubs-service-manual.pdf\">cleaning and re-oiling</a> the drive mechanism every 100 hours of use. It’s a process that should only take a couple of minutes and doesn’t even require the cassette to be removed from the freehub – just yank on the cassette with the wheel out of the bike and you’ll gain access. The Sylomer spring does soak up some of the lubricant, and while I had assumed that was intentionally done to act as a lubricating oil reservoir for the drive rings, that is apparently not the design intent. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-10-1340x754.jpg\" /><figcaption>The large rear hub shell plays host to oversized driverings. Follow the right arrow for a deeper look inside. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-11-1340x754.jpg\" /><figcaption>Pulled apart. From left to right you have the end cap, the freehub body, the drivering seal, and then the two driverings. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-12-1340x754.jpg\" /><figcaption>A closer look at the intricate rings. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-14-1340x754.jpg\" /><figcaption>Behind all that you have Sylomer spring assembly. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-13-1340x754.jpg\" /><figcaption>Put back together, the large seal is pushed back into the hub shell. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-17-1340x754.jpg\" /><figcaption>Back as one piece. </figcaption></figure></li></ul></figure>\n\n\n\n<p>At speed the driverings almost glide over the top of each other, and the low friction design means the hub coasts progressively quieter with speed. While not silent, this is a hub that’s free of obnoxious decibels. </p>\n\n\n\n<p>Both front and rear hubs feature simple press-on end caps that don’t require tools for entry to the cartridge bearings or freehub mechanism. Bearing preload is automatically handled by a small wave spring in each hub. All up, these really are a simple hub to maintain and with standard-sized bearings throughout. </p>\n\n\n\n<p>Zipp doesn’t give you ceramic bearings for the US$4,000 wheelset price tag and I think that’s a cheeky profit-margin-booster on their part. However, I also can’t complain about the performance of the provided high-quality steel cartridge bearings that are fitted with low-contact seals. They really do roll well. Such free rolling suggests only light external sealing, exactly what you want in a performance-focused product, but those keen on using these in wet and gritty conditions should be prepared to open them up far more frequently. </p>\n\n\n\n<p>The hub shells are aluminium and interestingly feature rather normal flanges for use with J-bend spokes. I’ve become quite accustomed to seeing straight-pull spokes and matching hubs on any high-end performance wheel and so this stood out as an interesting design choice. According to Donzé, the decision was made out of practicality – almost any bike shop in the world will be able to repair a J-bend spoked wheel, while a straight pull spoke can be harder to source. Those spokes are accompanied by external aluminium nipples. Zipp hasn’t always prioritised ease of service and repair, so kudos to them. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-1-1340x754.jpg\" /><figcaption>I bet you didn’t expect to see J-bend spokes here? </figcaption></figure>\n\n\n\n<p>My sample pair arrived to me lightly used and so I can’t speak to whether there was any settling in period or spoke tension drop from new. What I can say is that the spokes were strung up tightly and with consistent figures all around. For the rear I measured the non-driveside spokes at 56% of the tension of the driveside. This is fairly common in many wheels and shouldn’t present any long-term issues, but I’m sure wheel builders around the world will have words about such things. </p>\n\n\n\n<p>The wheels are supplied stock to suit standard 100 x 12 mm forks and 142 x 12 mm thru-axle frames. The wheels can be ordered with either a Shimano HG freehub or SRAM XDR. The Campagnolo 10-12 speed freehub body is only available separately. The hubs feature centerlock rotor mounts. </p>\n\n\n\n<p>Extras? What extras. For US$4,000 you get wheels fitted with tubeless tape and alloy valves, and then a couple of disc brake lockrings. Wishing for a pair of Quarq TyreWizs, matching wheel bags, or a Zipp-branded valve core tool to be included in the price? Yeah, so was I. </p>\n\n\n\n<h2>A generous warranty </h2>\n\n\n\n<p>Zipp covers all of its new wheels with a pretty generous lifetime warranty.</p>\n\n\n\n<p>That lifetime warranty extends to any issues experienced during normal riding use, such as slamming the rim into a giant pothole. “If you ride your bike and you have an issue, we’ll take care of you free of charge,” Donzé said. “Potholes are part of regular intended use, those are everywhere.”</p>\n\n\n\n<p>Zipp also offers a 50% discount on a replacement wheel if damage occurs outside of regular use, such as during flying, driving your pride and joy into a roof, or if <a href=\"https://www.youtube.com/watch?v=ngG5ezxwxB0\" target=\"_blank\">opening a tasty beverage with a spinning wheel</a> goes wrong.  </p>\n\n\n\n<h2>Ride report </h2>\n\n\n\n<p>Getting the 353 NSWs set up is a simple enough affair. How difficult the fitment of tubeless tyres is can vary, and I experienced a range from ‘easy to do with two thumbs’ to ‘needing one tyre lever’. In the scheme of things, these rims are about average to fit tyres to. </p>\n\n\n\n<p>From there airing them was easy and entirely possible with a floor pump. And it’s impressive how securely the tyres snap and effectively lock into place on the hookless rim. Undoing a flat tyre does require you to physically unseat the bead from the rim. </p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CUWRYI2ByI-/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div>View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CUWRYI2ByI-/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Dave Rome (@romeandstuff)</a></p></div></blockquote> \n\n\n\n<p><em>Tyres still pop into place as they reach their maximum diameter. Inflation shown with the recently <a href=\"https://cyclingtips.com/2021/10/topeak-joeblow-tubi-2stage-floor-pump-review/\" target=\"_blank\">reviewed Topeak JoeBlow Tubi pump</a>. </em></p>\n\n\n\n<p>A wide wheel like this will almost certainly require a re-think of what pressures you use, and it pays to experiment. <a href=\"https://axs.sram.com/guides/tire/pressure\" target=\"_blank\">Zipp’s online pressure calculator</a> recommended that my 70 kg body and I use just 53 psi front and 56.5 psi rear with a 28 mm tyre fitted. Meanwhile, <a href=\"https://info.silca.cc/silca-professional-pressure-calculator\" target=\"_blank\">Silca’s calculator</a>, which asks different questions, spat out suggested pressures closer to 65 and 66.5 psi. My preference ended up somewhere between the two suggestions.<a href></a></p>\n\n\n\n<p>No matter how stiff a modern road wheel is, you can quite easily make it feel comfortable by dropping the tyre pressure. That was exactly my finding with <a href=\"https://cyclingtips.com/2021/05/cadex-36-disc-road-wheelset-review/\" target=\"_blank\">Cadex’s carbon-spoked 36 Disc wheels</a>, which you could tell were almost unforgiving, but it barely mattered once you ran the right tyre pressure with those tubeless-only rims. By comparison, the 353 NSW is a more forgiving wheel and even if the rim width and tyre pressures were kept consistent, they’d still ride noticeably smoother than those Cadexs. Add the fact that the Zipp rims are actually some 2.5 mm wider and these wheels are sure to bring a new level of smooth rolling and comfort to whatever bike they’re fitted to. </p>\n\n\n\n<p>Interestingly, I found that the wider rim and accompanying increased tyre volume also played a small, and subtle, role in how reactive the bike felt. I did some back-to-back testing between the 353 NSWs and a pair of <a href=\"https://cyclingtips.com/2021/02/scribe-aero-wide-42-disc-brake-road-wheelset-review/\">Scribe Aero Wide 42+ wheels</a> that are literally a quarter of the cost.</p>\n\n\n\n<p>Those Scribes offer a 21 mm internal rim width and in turn keep a 28 mm tyre a little narrower and more rounded. What I found was that when aired up based on the respective recommendations of Silca’s pressure calculator, the Scribe assisted with more reactive handling where the bike tipped over with greater urgency, basically as if the bike’s trail figure was reduced. By contrast, the 353 NSW felt a smidge more subdued for a given speed. One isn’t necessarily better than the other, but my theory is that it simply comes down to the Zipp’s wider rims and its impact on the tyre shaping. </p>\n\n\n\n<p>That wide rim will inevitably square or flatten the shaping of a tyre more than a narrower rim, and I think Zipp is right to suggest a 28 mm minimum here. And while the 28 mm tyres in question rode great on these wheels, I personally would rather have a slightly narrower rim for such a tyre width. Pick a tyre with a printed width of 30, 32 or beyond and the Zipp’s 25 mm internal rim width progressively becomes more beneficial. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-28-1-1340x754.jpg\" /><figcaption>This is the rim width I choose for gravel tyres. Personally, I think a slightly narrower rim is ideal if you’re doing pure road riding and only ever want to run 28 mm tyres. </figcaption></figure>\n\n\n\n<p>That back-to-back testing extended across other areas, too. In a straight line roll test, neither the Scribe nor Zipp wheels produced a measurably different outcome. Both hit a top speed of 74 km/h, and with repeatable results. But again, the Zipp wheels did it with a subtly smoother ride feel that had me initially think it was slower. Of the two, the Zipp wheels certainly urge you to go faster.  </p>\n\n\n\n<p>Similarly, I can’t say that I felt a big difference in crosswind stability between the Scribe wheels and the Zipps. The Zipps do have the edge, and that’s quite impressive given the deeper and lighter rim. However both wheels are what I’d consider to be stable, and both are only just deep enough to start being talkative in ultra heavy gusts. Those coming from shallower wheels may notice it, while those used to deeper wheels or older V-shaped profile rims will say these are not at all impacted by crosswinds. </p>\n\n\n\n<p>Those Scribes are by no means heavy wheels (1,400 g), and I’ll admit to not being able to detect the 100-gram difference between them and the 353s. I was actively looking for a difference by jumping from low speeds, and yet both felt similarly reactive and lively to me.</p>\n\n\n\n<p>Continuing this swapping just cemented my opinion that modern disc brake wheels are damn good and that the differences between low-cost and ultra-premium wheels can be subtle at best – especially given there’s no brake track to compare. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Zipp-353-NSW-tubeless-disc-brake-road-wheelset-review-cyclingtips-5-1340x754.jpg\" /><figcaption> Disc brakes have facilitated price drops in carbon wheels without fear of safety. And that gives fewer reasons to spend top dollar on such a wheel. </figcaption></figure>\n\n\n\n<p>I much preferred the general lack of noise from the Zipps when coasting (those Scribes are annoyingly loud) and likewise, if all I was riding was poorly kept tarmac and well-kept dirt then I’m sure the 353 NSWs would stand above, but that’s not the reality of my local road riding. And if was after a wheel for off-road use then I’d feel more comfortable riding a more affordable wheel such as the 303 Firecrest. </p>\n\n\n\n<p>These wheels were almost entirely problem free during my testing and the only nuisance I experienced was the slightest amount of disc brake rotor noise at the front when really tugging on the handlebars. My theory is that the wave washer-based bearing preload allows the hub axle to move by the tiniest amount. </p>\n\n\n\n<p>The 353 NSW is a fast-feeling wheel – its low mass makes it quick to react to accelerations. It’s stiff enough to track where you want it and not twist in a sprint. It seems to hold its speed well for a rim that’s about 45 mm in depth, and feels stable in the process, too. Perhaps most noticeable is just how smooth and controlled the ride is with these wheels fitted, and those benefits will only become more noticeable the worse your roads get. However, what I can’t definitively say is that the 353 NSW is indeed a faster or measurably better wheel than others. And at this time, nor can Zipp. </p>\n\n\n\n<p>“The subjective feedback we get from field testers is that 353 is perceivably faster than 303 Firecrest,” said Donzé. “However, we can’t quantify it at this point <em>[ed. due to the previous testing resulting in corrupted data]</em>.” Interestingly, <a href=\"https://www.sram.com/globalassets/publicsites/cms-campaign-pages-not-story-pages/zipp/totalsystemeffeciency/pdf-downloads/tse-explained2.pdf\" target=\"_blank\">Zipp does have data to show</a> that the 303 Firecrest is measurably faster than the 23 mm width 303 S, at least across a dirt road.</p>\n\n\n\n<h2>Worth the price? </h2>\n\n\n\n<p>OK, so let me summarise. According to Zipp, when compared to the 303 Firecrest, the 353 NSW’s slightly deeper rim profile should be subtly more aero without a trade-off in stability. With the same 25 mm internal rim width, the rolling resistance, ride comfort, and tyre support are equal. Lateral stiffness is higher on the 353 NSW, but you’ll need a jig to tell. From a tangible point of view, you give up nothing and save 100 grams. You also get hubs that turn more freely. And the end result is a feathery wheelset that’s going to provide a healthy dose of ride comfort which equates to speed when riding beyond smooth surfaces.   </p>\n\n\n\n<p>Now is all of that worth paying double for? It’s a big fat nope from me. </p>\n\n\n\n<p>While certainly a more expensive product to produce, the reality is that Zipp’s NSW wheels are priced in a way to help recoup the company’s hefty research and development costs that go into these wheels, future wheels, and the cheaper wheels that benefit directly from such an investment. </p>\n\n\n\n<p>Zipp’s transparency on the 353 NSW’s actual advantages over its cheaper wheels has been a cool refreshing breeze to me. The 353 NSW remains a product that exists for the individuals who simply want the best regardless of the price, even when the laws of diminishing returns are shining brighter than a fresh neon sign. However, even then I’m still not convinced these justify the astronomical asking price and I’d probably need to see a US$500 price drop before that opinion changes.  </p>\n\n\n\n<p>Perhaps the main takeaway from this review is that Zipp’s three-tier wheel hierarchy plays out like a textbook sales tactic and one that inevitably has you looking to the middle option as if it’s a golden goose. </p>\n\n\n\n<p>Clever marketing or not, the more affordable 303 Firecrest wheels actually have a lot going for them and I’d seriously consider buying a pair myself if I were in the market for such an all-rounder wheel that can mix it up across road and fast gravel. After all, we’re talking about a wheel that is quite literally half the price and at least 95% as good.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/zipp-353-nsw-wheelset-review-is-comfort-the-new-aero/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4e7af4018958cc21491b890a2949c4227ea9ecfba230c241c567bb38612315c7","category":"Cycling"}