{"title":"Amanda Spratt – Question Time","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/amanda-spratt-question-time","date":1627038283000,"content":"\n      <p><b>Where is the best place in the world you’ve ever cycled?</b></p>\n<p><span>I have to say my home in Blue Mountains. I’m so lucky to have grown up in a World Heritage area, where the Three Sisters are, a beautiful location. That’s where my heart is and I look forward to going back there every year.</span></p>\n<p><b>What did you want to be when you were a kid?</b></p>\n<p><span>A marine biologist. I had this fascination with fish and sea creatures. I’m not sure if it’s from our family holiday, picking up shells on the beach and trying to work out what they were, but I always thought that’s what I was going to be. I did sport, but at that point I wasn’t thinking I would be a professional athlete in the future.</span></p>\n<div></div>\n<p><b>What is your hidden talent?</b></p>\n<p><span>I can speak Pig Latin. We had a team camp trivia night a few years ago and we had to say “Pig Latin”, which is “igpay atinlay”, and I was the only person who knew how to do that. I used to use it with my brother so that my mother couldn’t understand what we were saying. You take off the first letter of the word and put it at the end with an A. So pig becomes “igpay” and latin becomes “atinlay”. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/women-s-olympic-road-race-2021-will-we-see-dutch-dominance\"><strong><em>Related – Women's Olympic Road Race Preview</em></strong></a></p>\n<p><b>If you could change one thing in the world, what would it be?</b></p>\n<p><span>No Covo. I think that’s an easy one right now.</span></p>\n<p><b>Have you ever been in trouble with the police?</b></p>\n<p><span>No. I’m an angel. </span></p>\n<p><b>What would your karaoke song be? </b></p>\n<p><span>Girls Just Wanna Have Fun. At the Tour Down Under every year we have a tradition in the team of a karaoke night after the race. [Breaks into song]</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IMG_1676_1024x1024.jpg?v=1627037632\" /></span></p>\n<p><b>Who’s the most famous person you’ve ever met?</b></p>\n<p><span>I think Prince William at the London Olympics when he came to visit us at the village. I didn’t think I would feel starstruck but I was very nervous. </span></p>\n<p><b>What’s the worst job you’ve ever done?</b></p>\n<p><span>I was a mushroom picker. I was just flicking through the local paper, looking for something to make some extra coin, so I went out there, did a little interview, then the man took me out and showed how to pick mushrooms in a big, dark room that smelt of mould. I think I lasted one day then stopped.</span></p>\n<p><b>Who’s your sporting icon?</b></p>\n<p><span>Cathy Freeman. Many people in Australia would remember sitting down and watching her win gold at the 2000 Olympics in Sydney under so much pressure with a home crowd. A moment I will always remember, just legendary at the time.</span></p>\n<p><b>Have you planned the next move after your cycling career?</b></p>\n<p><span>No, I haven’t planned something. I’ve completed a university certificate in business, I’ve got a communications degree in public relations, but I’m not sure exactly what my plan would be. I’d love to do a bit more travel and see places without being on a bike race and only seeing the hotels, so maybe a bit of travel first, and then I’d really like to stay involved with the sport. I’ve been on a bike since I was nine years old, so I would love to help develop women’s cycling even more. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/under-the-radar-riders-who-could-pull-off-a-surprise-performance-in-tokyo\"><em><strong>Under the Radar: Riders to watch at the Tokyo Olympics</strong></em></a></p>\n<p><b>What’s your go-to dessert order?</b></p>\n<p><span>Sticky date pudding, every time. I love it. My mum makes a beautiful one, with caramel butterscotch sauce and a bit of ice cream. That’s one of my favourite things in the world. </span></p>\n<p><b>If you had a superpower, what would yours be?</b></p>\n<p><span>In Harry Potter, they have this thing where you can walk into a fire then all of a sudden, they are in a different spot. I’d love to be able to be here talking to you now, then </span><span>c</span><span>lick my fingers and be in Australia with my family, then do it again and be back at team camp. I reckon that would be pretty cool.</span></p>\n<p><b>Finish this sentence: happiness is…</b></p>\n<p><span>Wherever you are surrounded by people that are making you happier and fulfilled in life.</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4e83814fe41d5a98571263540b55fb1cd6a52f01d60568709b01a6fe7300ae76","category":"Cycling"}