{"title":"Niantic ประกาศปลดพนักงาน 230 คน - สร้าง Pokémon GO ให้ยั่งยืน - มองหาโอกาสใหม่จาก MR","link":"https://www.blognone.com/node/134607","date":1688082125000,"content":"<div><div><div><p>John Hanke ซีอีโอ Niantic ส่งอีเมลถึงพนักงานทุกคน แจ้งแผนการปรับโครงสร้างองค์กรเพื่อรองรับการแข่งขันในอนาคต โดยจะปรับโฟกัสลดจำนวนเกมลง และสร้างความยั่งยืนให้กับเกมที่บริษัทพัฒนาเองมากขึ้น ผลดังกล่าวทำให้บริษัทเตรียมปิดสตูดิโอในลอสแอนเจลิส ปลดพนักงานประมาณ 230 คน เตรียมปิดตัวเกม <a href=\"https://www.blognone.com/node/129146\">NBA All-World</a> และยุติการพัฒนาเกม <a href=\"https://www.blognone.com/node/130327\">Marvel World of Heroes</a></p>\n<p>Niantic ให้เหตุผลของการตัดสินใจนี้ว่าเนื่องจากบริษัทขยายทีมและการลงทุนมากในช่วงโควิด 19 ทำให้ค่าใช้จ่ายเพิ่มมากกว่ารายได้ และเมื่อหมดการระบาดของโควิด ปัญหาเศรษฐกิจและการเปลี่ยนแปลงในตลาดเกมมือถือ ทำให้รายได้ไม่เติบโตอย่างที่ประเมินไว้ บริษัทยังบอกว่านับตั้งแต่ความสำเร็จของ Pokémon GO ระบบ App Store และการโฆษณาบนมือถือมีการเปลี่ยนแปลงมาก ทำให้การเปิดตัวเกมให้สำเร็จในวงกว้างเป็นเรื่องยากขึ้นมาก</p>\n<p>ทิศทางจากนี้ของ Niantic คือการทำให้ Pokémon GO มีความมั่นคงยั่งยืนมากที่สุด (Niantic ใช้คำว่าเป็น forever game) โดยยังคงการลงทุนและพัฒนาเกมนี้ต่อไป เช่นเดียวกับเกมที่มีโอกาสสูงได้แก่ <a href=\"https://www.blognone.com/node/125486\">Pikmin Bloom</a>, <a href=\"https://www.blognone.com/node/132931\">Peridot</a> และ <a href=\"https://www.blognone.com/node/133471\">Monster Hunter Now</a> รวมถึงยังคงลงทุนในธุรกิจบริการด้าน AR ต่าง ๆ สำหรับนักพัฒนาทั้ง AR map และ AR platform นอกจากนี้บริษัทจะมองหาโอกาสของ AR บนแพลตฟอร์มใหม่ Mixed Reality หรือ MR ซึ่งตอนนี้มีอุปกรณ์ทั้ง Meta Quest Pro และ Apple Vision Pro มากระตุ้นตลาด</p>\n<p>ที่มา: <a href=\"https://nianticlabs.com/news/organizational-update\">Niantic</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3764d0aa4ec379bf911c6e3c6d44e370.jpg\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/niantic-labs\">Niantic Labs</a></div><div><a href=\"/topics/layoff\">Layoff</a></div><div><a href=\"/topics/pokemon-go\">Pokemon Go</a></div><div><a href=\"/topics/augmented-reality\">Augmented Reality</a></div><div><a href=\"/topics/mixed-reality\">Mixed Reality</a></div><div><a href=\"/topics/mobile-games\">Mobile Games</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4e8595b95f05c57f805eeb0e43596c9cfdb72940f829d0f8b8e1a4e776090550","category":"Thai"}