{"title":"A major role of coumarin-dependent ferric iron reduction in strategy I-type iron acquisition in Arabidopsis","link":"https://academic.oup.com/plcell/article/36/3/642/7453556?rss=1","date":1701129600000,"content":"<span><div>Abstract</div>Many non-graminaceous species release various coumarins in response to iron (Fe) deficiency. However, the physiological relevance of these coumarins remains poorly understood. Here, we show that the three enzymes leading to sideretin biosynthesis co-exist in Arabidopsis (<span>Arabidopsis thaliana</span>) epidermal and cortical cells and that the shift to fraxetin at alkaline pH depends on MYB72-mediated repression of <span>CYTOCHROME P450</span>, <span>FAMILY 82</span>, <span>SUBFAMILY C</span>, <span>POLYPEPTIDE 4</span> (<span>CYP82C4</span>). In vitro, only fraxetin and sideretin can reduce part of the Fe(III) that they mobilize. We demonstrate that coumarin-mediated Fe(III) reduction is critical under acidic conditions, as fraxetin and sideretin can complement the Fe(III)-chelate reductase mutant <span>ferric reduction oxidase 2</span> (<span>fro2</span>), and disruption of coumarin biosynthesis in <span>fro2</span> plants impairs Fe acquisition similar to in the Fe(II) uptake-deficient mutant <span>iron-regulated transporter 1</span> (<span>irt1</span>). Disruption of sideretin biosynthesis in a <span>fro2 cyp82C4-1</span> double mutant revealed that sideretin is the dominant chemical reductant that functions with FRO2 to mediate Fe(II) formation for root uptake. At alkaline pH, Fe(III) reduction by coumarins becomes almost negligible but fraxetin still sustains high Fe(III) mobilization, suggesting that its main function is to provide chelated Fe(III) for FRO2. Our study indicates that strategy-I plants link sideretin and fraxetin biosynthesis and secretion to external pH to recruit distinct coumarin chemical activities to maximize Fe acquisition according to prevailing soil pH conditions.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"4e8686835b4c9ffce4da808ef5269a1a8ecd7498bb8ec3a060d2ca5fd3b0f653","category":"Environment"}