{"title":"macOS 14 Sonoma: The Ars Technica review","link":"https://arstechnica.com/?p=1959801","date":1695748120000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/sonoma-light-800x500.jpg\" alt=\"macOS 14 Sonoma: The Ars Technica review\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/sonoma-light.jpg\">Enlarge</a> </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>I was preparing to write an intro calling <a href=\"https://nr.apple.com/Dq5w1F8LE5\">macOS Sonoma</a>—version 14.0 of Apple's desktop operating system, for those of you who can't keep the ever-lengthening list of California codenames straight—a \"low-key\" or \"small\" release. Because it definitely feels that way, and it's tempting to think that Apple is taking it easy on new features for older OSes because it's devoting so much internal time to VisionOS and the Vision Pro.</p>\n\n<p>But looking back, I've said something along those lines for each of the last few macOS releases (and several others before that). Honestly, these days, what macOS update <em>hasn't</em> been \"low-key\"? Every one since <a href=\"https://arstechnica.com/gadgets/2020/11/macos-11-0-big-sur-the-ars-technica-review/\">Big Sur</a> (11.0) overhauled the UI and added Apple Silicon support has been content to add a few pieces on top of the foundation, fiddle a bit with under-the-hood enhancements and new security measures, maintain feature parity with iOS for the built-in apps, and call it a day. That's what Sonoma does, too.</p>\n<p>So macOS Sonoma is a perfectly typical macOS release, a sort of \"<a href=\"https://arstechnica.com/gadgets/2022/10/macos-13-ventura-the-ars-technica-review/\">Ventura</a>-plus\" that probably has one or two additions that any given person will find useful but which otherwise just keeps your Mac secure and avoids weird iCloud compatibility problems with whatever software is running on your phone. You probably don't need to run out and install it, but there's no real reason to avoid it if you're not aware of some specific bug or compatibility problem that affects the software you use. It's business as usual for Mac owners. Let's dive in.</p></div><p><a href=\"https://arstechnica.com/?p=1959801#p3\">Read 243 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1959801&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4e8a8afd1373b8c0db0b30ab3af46bce71e7d84ef257d320d36567c933554230","category":"Tech"}