{"title":"Optimum design and analysis of solar pump with the help of genetic algorithm, a MATLAB tool, and RSM tool at minimum cost","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14308?af=R","date":1715141849000,"content":"<h2>Abstract</h2>\n<p>In this research paper, a well-performing solar pump at the minimum cost of project life is designed and installed. Initially, the capacity of submersible pumps and discharge have been determined based on the water requirement of the crop and the size of the field. The total number of solar panels, inverter size, and motor pump system have been designed based on the law of conservation of energy. The two optimization techniques genetic algorithm (GA) and response surface methodology (RSM) have been used for analyzing the pump performance parameters and total cost. The GA tool has been used to determine the optimum tilt angle on which responses namely solar flux, solar panel efficiency, exergy, and pump efficiency should be maximum. Moreover, the performance of the solar pump at the optimum tilt angle has been compared with the 28° fixed tilt angle (latitute of location). For the experimental study solar pump experimental setup of 5 hp power has been installed in Faculty of Engineering and Technology, MJP Rohilkhand University at 28.36°N, 79.43°E. The total cost of the solar pump has been optimized with the help of RSM based on the discharge and head of the solar pump. The new optimization approach reduced the levelized cost of electricity (LCOE) from 0.041 to 0.035 $/kWh and the payback period is reduced from 4 to 3 years. The annual increment in average solar flux and overall efficiency has been recorded to be from 606 to 697 W/m<sup>2</sup> and 11% to 14% respectively.</p>","author":"Vineet Singh, \nVinod Singh Yadav, \nNiraj Kumar, \nManoj Kumar, \nManoj Kumar Singh","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"4e8d71b3fa27c6be7485de140ff9981d241d84ae8f34074b07cea4be7cdd7030","category":"Environment"}