{"title":"The Effect of Temperature and Treatment Regime on the Physical, Chemical, and Biological Properties of Poultry Litter Biochar","link":"https://www.preprints.org/manuscript/202403.0998/v1","date":1710750957000,"content":"Poultry litter was converted to biochar by torrefaction and to hydrochar by hydrothermal carbonisation. Many parameters were measured for the resulting chars, to investigate the effect of production method and production temperature. SEM showed the presence of large quantities of crystalline material on the surface of the biochars. The elemental composition of some crystals was determined as 35% K and 31% Cl. This was confirmed as sylvite (KCl) crystals, which explains the high levels of water extractable potassium in the biochar and may also be important in germination inhibition. Biochars almost totally inhibited germination, whilst hydrochars decreased germination. Although germination occurred on hydrochar, root growth was severely inhibited. Consequently, germination index may be better to determine total phytotoxicity as it measures both effects and could be used as a bioassay for chars used as soil amendments. Washing removed germination inhibition in a low temperature char (3500C), possibly by removing KCl, however root toxicity remained. There were very low levels of heavy metals, suggesting they are not the source of toxicity. In biochars, pore mean size decreased with temperature from 3500C to 6000C, due to changes in pore size distribution. Mean pore size was measured directly using SEM. The merits of this method are discussed. Low temperature biochars seem best suited for fuel as they have high calorific value, high hydrophobicity, low ash content and high yield. Higher temperatures are better for soil amendment and sequestration applications with a smaller mean pore size, higher surface area, and higher pH.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4e9ac85011e4d7e498dfe2a1fb9ad8809a64a6c79914fd3648fba08821519994","category":"Interdisciplinary"}