{"title":"Effects of handling and surgical implant on juvenile wild trout: Physiological and behavioral impact","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15783?af=R","date":1715326453000,"content":"<h2>Abstract</h2>\n<p>Fish involved in telemetry studies are usually handled, anaesthetized, and subjected to internal tag implantation, all of which have the potential to disrupt the fish's physiology, migratory patterns, food-seeking behavior, growth, and survival. As fish tagging is a widespread standard method in aquaculture, it is crucial to gain a better understanding of the short- and long-term effects on various aspects of fish welfare. The experimental outcomes of each phase of the surgical process and how it affects the fish's ability to recover during the post-tagging period, particularly in small salmonids, are poorly understood. Thus, it is essential to measure the extent of these adverse effects to precisely extrapolate differences in surgical intervention for tagged fish compared to their unmanipulated counterparts. In our study, we explored the post-tagging impacts on wild-captured brown trout (<i>Salmo trutta</i>) (1+) juveniles. We examined the time effect on fish recovery after each phase of the surgical procedure, which included anaesthetized fish, followed by surgery with/without internal tagging, within the first 2 and 25 h post-surgery. Common blood parameters (glucose levels and haematocrit) and endpoints related to swimming behavior, including fish movement, direction, and social distancing aspects, were studied. The findings of the study indicated no significant changes in glucose and haematocrit levels over the observational period. Fish subjected to anesthesia and tagging procedures exhibited a significant decrease in swimming activity, recovering to baseline levels 1 h after anesthesia and 24 h after surgical (tagging) procedures in recirculating aquaculture systems. Tagged fish showed less social proximity than non-tagged fish in the first 2 h post-surgery. A significant effect size was observed between nonsurgical (anesthesia) and surgical (non-tagged/tagged) groups, highlighting a more pronounced impact associated with surgical tag interventions. Our data indicate that the magnitude of behavioral response was significantly influenced by tag weight (~1.4% body/tag weight ratio in water) among manipulated fish groups. Consequently, our study reveals that wild-captured <i>S</i>. <i>trutta</i> juveniles, tagged with commercially available low-weight acoustic tags (V6, 69 kHz), experienced negative effects on swimming performance. In surgical studies, acknowledging potential influences is crucial for accurately inferring fish physiological and behavioral status. Emphasizing fish recovery potential in both short- and long-term periods is essential for quantifying tagging effects. Future research should prioritize exploring alternative tagging technologies and refining methodologies, with a particular focus on assessing telemetry's impact on socioeconomically relevant small salmonids.</p>","author":"Tomas Makaras, \nMilda Stankevičiūtė","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"4ea44a56bf06fe9faf613ac6b57faceaa905bfb8374564bcd65dd4ab01321ba8","category":"Environment"}