{"title":"WADA investigation finds that British Cycling engaged in its own testing of riders","link":"https://cyclingtips.com/2021/10/wada-investigation-finds-that-british-cycling-engaged-in-its-own-testing-of-riders/","date":1634674680000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/another-anti-doping-photo-650x433.jpg\" /></div><h2>WADA investigation finds that British Cycling engaged in its own testing of riders</h2><p>\n</p><p>A World Anti-Doping Agency (WADA) investigation has found that British Cycling engaged in its own drug-testing of riders in a private laboratory, violating WADA rules.</p>\n\n\n\n<p>The investigation, called Operation Echo, looked into allegations that British Cycling tested samples from elite riders for nandrolone “as part of a study into potential contamination of supplements,” according to the WADA statement. “Contrary to the rules laid down by the World Anti-Doping Code and the relevant International Standard, the samples were collected by British Cycling staff rather than doping control officers, analyzed by a non-WADA-accredited laboratory, and provided by the athletes on the basis that UKAD would never know the results.”</p>\n\n\n\n<p>The testing falls afoul of WADA regulations because independent anti-doping organizations like WADA and UK Anti-Doping were set up to prevent precisely this sort of self-policing. They remove testing from the hands of entities with a vested interest in not finding positives. </p>\n\n\n\n<p>The investigation found that at least one employee of the UK Anti-Doping agency knew about the study.</p>\n\n\n\n<p>“‘Operation Echo’ confirmed potential wrongdoing by individuals in both British Cycling and UKAD at that time,” said Gunter Younger, director of WADA’s Intelligence and Investigations Department. “Following this investigation, a copy of our report was provided to the WADA Compliance, Rules and Standards Department for its consideration. In addition, the summary report was provided to the Union Cycliste Internationale – the governing body under which British Cycling operates – and to the United Kingdom Department of Digital, Culture, Media, and Sport for their attention.</p>\n\n\n\n<p>“‘Operation Echo’ makes no corrective recommendations as those involved in the events of 2011 are no longer employed by UKAD, and UKAD has already put safeguards in place to avoid a repeat occurrence. It is important to acknowledge that WADA I&amp;I received the full cooperation and transparency of British Cycling and UKAD throughout our investigation.”</p>\n\n\n\n<p>In a statement, British Cycling said that it had “only conducted the testing having sought and received the express approval of UKAD’s Director of Legal.”</p>\n\n\n\n<p>Operation Echo also looked into allegations that the UKAD had given athletes’ biological passport data to British Cycling, and that it had allowed two athletes to privately test supplements for potential contamination as part of their defenses in adverse analytical finding cases and then use the results in anti-doping hearings. The investigation did not find evidence to support any of those allegations.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/wada-investigation-finds-that-british-cycling-engaged-in-its-own-testing-of-riders/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4eaf94c1f385374ae1c06de1be0f5369870a9345967250822454feea215ec267","category":"Cycling"}