{"title":"Effects of Five Years of Treatment of Onchocerciasis with Ivermectin under Community Guidelines in Resurgent Areas of Burkina Faso: A Before-and-After Analysis","link":"https://www.preprints.org/manuscript/202407.0382/v1","date":1720096214000,"content":"Background:Almost the entire country of Burkina Faso was endemic to onchocerciasis. Onchocerciasis control efforts thus brought the prevalence of O. volvulus to a level where the disease was no longer a public health problem and a national onchocerciasis control program was set up in 1991 to ensure surveillance and maintain the gains made. A resurgence of onchocerciasis cases has been observed in two regions (Comoé, South West) located around several river basins in the 2010-2011. In accordance with WHO guidelines, for the management of resurgent cases, CDTI was implemented in the affected areas of Comoé and Sud-Ouest regions.\nMethodology: We conducted an extensive analysis to determine the effects of CDTI on parasitological indices of onchocerciasis in these two areas and we also analyzed the data in relation to the location of the village in relation to the river to see if this was a factor in the decrease in prevalence. \nResults: A total of 43 villages in 6 health districts, i.e., 100% of the villages that participated in the epidemiological surveys before and after the implementation of CDTI in the Southwest and Cascade regions were included in the study. The key findings were that standardized microfilaria prevalence and CMFL decreased significantly after the implementation of CDTI in both regions. For the average of the two regions, the results for standardized microfilaria prevalence were -5.91 with a 95% confidence interval of (-9.67; -2.16) and for CMFL were -0.29 with a 95% confidence interval of (-0.57; -0.01). Our results showed also a decline in standardized microfilaria prevalence and CMFL in all villages involved in the study. Moreover, the drop in the trajectory of the curve representing the predicted standardized microfilaria prevalence of villages located within 5 km of the streams was greater than that of villages located more than 5 km from the streams.\nConclusion: Our results thus show that the implementation of effective CDTI could stop the transmission of O. volvulus in these two regions. The main challenge for stopping transmission could be the migration of populations to neighboring countries and migration of the vector from one country to another, as Burkina Faso shares some river basins with neighboring countries.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4eaf717635540d8274f16e3b2e95604c24170b5143463681abeb9c18886cf532","category":"Interdisciplinary"}