{"title":"Missing phosphorus legacy of the Anthropocene: Quantifying residual phosphorus in the biosphere","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17376?af=R","date":1719385200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/eade51eb-cff2-488c-b4e7-3553c7c65269/gcb17376-toc-0001-m.png\" alt=\"Missing phosphorus legacy of the Anthropocene: Quantifying residual phosphorus in the biosphere\" />\n<p>The amount of phosphorus (P) circulating in soil and water has been suddenly increased by human activities in less than 100 years, largely by mining of phosphate rock deposits to enrich soils via fertilization for crop production. How much of this “new” human-added P has accumulated in the soil–water continuum, and where it is located, is a necessary challenge to solve in order to optimize trade-offs bet agroecosystem productivity and water quality impairment. This article reviews knowns and unknowns to quantify the amount and distribution of residual P.</p>\n<br />\n<h2>Abstract</h2>\n<p>A defining feature of the Anthropocene is the distortion of the biosphere phosphorus (P) cycle. A relatively sudden acceleration of input fluxes without a concomitant increase in output fluxes has led to net accumulation of P in the terrestrial-aquatic continuum. Over the past century, P has been mined from geological deposits to produce crop fertilizers. When P inputs are not fully removed with harvest of crop biomass, the remaining P accumulates in soils. This residual P is a uniquely anthropogenic pool of P, and its management is critical for agronomic and environmental sustainability. Managing residual P first requires its quantification—but measuring residual P is challenging. In this review, we synthesize approaches to quantifying residual P, with emphasis on advantages, disadvantages, and complementarity. Common approaches to estimate residual P are mass balances, long-term experiments, soil test P trends and chronosequences, with varying suitability or even limitations to distinct spatiotemporal scales. We demonstrate that individual quantification approaches are (i) constrained, (ii) often complementary, and (iii) may be feasible at only certain time–space scales. While some of these challenges are inherent to the quantification approach, in many cases there are surmountable challenges that can be addressed by unifying existing P pool and flux datasets, standardizing and synchronizing data collection on pools and fluxes, and quantifying uncertainty. Though defined as a magnitude, the distribution and speciation of residual P is relatively less understood but shapes its utilization and environmental impacts. The form of residual P will vary by agroecosystem context due to edaphoclimatic-specific transformation of the accumulated P, which has implications for management (e.g., crop usage) and future policies (e.g., lag times in P loading from non-point sources). Quantifying the uncertainty in measuring residual P holds value beyond scientific understanding, as it supports prioritization of monitoring and management resources and inform policy.</p>","author":"Andrew J. Margenot, \nShengnan Zhou, \nSuwei Xu, \nLeo M. Condron, \nGeneviève S. Metson, \nPhilip M. Haygarth, \nJordon Wade, \nPrince C. Agyeman","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"4eb05d942918fb0e5997869b46d70578c6339afed0394e2917c25e9a93b8638a","category":"Environment"}