{"title":"“Lensed” supernova could shed light on fundamental forces shaping Universe","link":"https://arstechnica.com/?p=1947028","date":1686587274000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/cosmic1CROP-800x535.jpg\" alt=\"gravitational lensing image of supernova\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/cosmic1CROP.jpg\">Enlarge</a> <span>/</span> Gravitational lensing has revealed a previously unknown supernova explosion more than 4 billion light-years away. (credit: Joel Johansson, Stockholm University)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Astronomers have detected a previously unknown supernova explosion more than 4 billion light-years away using a rare phenomenon called \"gravitational lensing,\" which serves as a kind of cosmic magnifying glass. They described their discovery and its potential implications in a new paper published in the journal Nature Astronomy. Co-author Ariel Goobar, director of the <a href=\"http://www.okc.albanova.se/\">Oskar Klein Center</a> at Stockholm University, <a href=\"https://cmns.umd.edu/news-events/news/igor-andreoni-astronomers-discover-supernova-explosion-through-rare-cosmic-magnifying-glasses\">described</a> the find as \"a significant step forward in our quest to understand the fundamental forces shaping our universe.\"</p>\n<p>Gravitational lensing is a direct consequence of the general theory of relativity: mass bends and warps spacetime, and light must follow that curvature. The phenomenon <a href=\"https://arstechnica.com/science/2020/06/astronomers-have-finally-measured-the-distance-of-first-observed-einstein-ring/\">can form</a> rare effects like an \"<a href=\"https://en.wikipedia.org/wiki/Einstein_ring\">Einstein ring</a>\" or an \"<a href=\"https://en.wikipedia.org/wiki/Einstein_Cross\">Einstein cross</a>.\" Essentially, the distortion in space-time caused by a massive object (like a galaxy) acts as a lens to magnify an object in the background. Since these aren't perfect optical-quality lenses, there are often some distortions and unevenness. This causes the light from the background object to take different paths to Earth, and thus a single object can appear in several different locations distributed around the lens. At cosmological scales, those paths can also require light to travel very different distances to get to Earth.</p>\n<p>Gravitational lensing helps astronomers spot celestial objects that might otherwise be too faint or far away to see, like a distant supernova, which can lead to other interesting questions. For example, <a href=\"https://arstechnica.com/science/2022/11/single-hubble-image-captured-supernova-at-three-different-times/\">last year</a>, astronomers analyzed a Hubble image from 2010, where the image happened to also capture a supernova. Because of gravitational lensing, the single event showed up at three different locations within Hubble's field of view. Thanks to the quirks of how this lensing works, and because light travels at a finite speed, all three of the locations captured different <em>times</em> after the star's explosion, allowing researchers <a href=\"http://dx.doi.org/10.1038/s41586-022-05252-5\">to piece together</a> the time course following the supernova, even though it had been observed over a decade earlier.</p></div><p><a href=\"https://arstechnica.com/?p=1947028#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1947028&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4eb937b2f2b11148bfda8a232d178a233876cd1fbd9d2d9971d622c82ed6a7f2","category":"Tech"}