{"title":"WhatsApp Rolls Out Multi-Device Support to All Users on iOS and Android","link":"https://www.macrumors.com/2021/11/08/whatsapp-multi-device-rollout-ios-android/","date":1636363175000,"content":"WhatsApp has rolled out multi-device support to all users on iOS and Android, allowing WhatsApp to be used on up to four linked devices without users needing to be connected via a smartphone.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/whatsapp-multi-device-support.jpg\" />\r\n<br />\r\nTo enable multi-device support, users need to join the multi-device beta. Launch WhatsApp on iPhone, then select <strong>Settings -&gt; Linked Devices</strong>. Select <strong>Multi-Device Beta</strong>, then tap <strong>Join Beta</strong>. Once that's done, you'll be able to start linking devices.\r\n<br />\r\n\r\n<br />\r\nAfter your devices are linked, messages can be sent and received using the WhatsApp desktop app or web-based service and your phone will no longer need to stay online, although it's not currently possible to delete messages or conversation threads from a linked device. \r\n<br />\r\n\r\n<br />\r\nIt's worth noting that you can't message or call from web, desktop, or Portal to users who have an outdated version of WhatsApp on their phone, and you can only have one phone connected to your WhatsApp account at one time. Personal calls and messages remain end-to-end encrypted across devices.\r\n<br />\r\n\r\n<br />\r\nIf you don't use your phone for over 14 days, your linked devices will be disconnected. Given the feature is still in beta, WhatsApp also cautions that the performance and quality of its service may be affected, although users can leave the beta at any time.\r\n<br />\r\n\r\n<br />\r\nWhatsApp is <a href=\"https://www.macrumors.com/2021/06/03/whatsapp-multi-device-support-hints-ipad-app/\">reportedly</a> working on an iPad version of its app, and the Meta-owned company has hinted that the rollout of multi-device support will bring the iPad version one step closer to release.<div>Tag: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/11/08/whatsapp-multi-device-rollout-ios-android/\">WhatsApp Rolls Out Multi-Device Support to All Users on iOS and Android</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whatsapp-rolls-out-multi-device-support-to-all-users-on-ios-and-android.2322319/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ZDkXPsei1AU:JZ4WLdv0jS8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ZDkXPsei1AU:JZ4WLdv0jS8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ZDkXPsei1AU\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4ed6e5db3843efb530a1b0d9901910dc1353b4a6ea40215e7054c01918b978f3","category":"Apple"}