{"title":"Activation and inhibition of the sweet taste receptor TAS1R2-TAS1R3 differentially affect glucose tolerance in humans","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0298239","date":1714572000000,"content":"<p>by Matthew C. Kochem, Emily C. Hanselman, Paul A. S. Breslin</p>\r\n\r\nThe sweet taste receptor, TAS1R2-TAS1R3, is expressed in taste bud cells, where it conveys sweetness, and also in intestinal enteroendocrine cells, where it may facilitate glucose absorption and assimilation. In the present study, our objective was to determine whether TAS1R2-TAS1R3 influences glucose metabolism bidirectionally via hyperactivation with 5 mM sucralose (n = 12) and inhibition with 2 mM sodium lactisole (n = 10) in mixture with 75 g glucose loads during oral glucose tolerance tests (OGTTs) in healthy humans. Plasma glucose, insulin, and glucagon were measured before, during, and after OGTTs up to 120 minutes post-prandially. We also assessed individual participants’ sweet taste responses to sucralose and their sensitivities to lactisole sweetness inhibition. The addition of sucralose to glucose elevated plasma insulin responses to the OGTT (F(1, 11) = 4.55, p = 0.056). Sucralose sweetness ratings were correlated with early increases in plasma glucose (R<sup>2</sup> = 0.41, p&lt;0.05), as well as increases in plasma insulin (R<sup>2</sup> = 0.38, p&lt;0.05) when sucralose was added to the OGTT (15 minute AUC). Sensitivity to lactisole sweetness inhibition was correlated with decreased plasma glucose (R<sup>2</sup> = 0.84, p&lt;0.01) when lactisole was added to the OGTT over the whole test (120 minute AUC). In summary, stimulation and inhibition of the TAS1R2-TAS1R3 receptor demonstrates that TAS1R2-TAS1R3 helps regulate glucose metabolism in humans and may have translational implications for metabolic disease risk.","author":"Matthew C. Kochem","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4ed7fd3fcca1f5437b0bca657b70477f5da2ae624ae2281b8f3a6f703107b078","category":"Interdisciplinary"}