{"title":"Apple Expanding Device Repair Programs for Consumers and Independent Shops","link":"https://www.macrumors.com/2023/10/24/apple-expanding-device-repair-programs/","date":1698172159000,"content":"Apple is expanding its Self-Service Repair and Independent Repair Provider programs and will make parts, tools, and documentation needed for product repairs available to repair shops and consumers nationwide.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Apple-Self-Service-Repair-Program-iPhone.jpeg\" width=\"1600\" height=\"900\" />\r<br />\nThe news was announced by the White House as part of an event focused on right to repair policies, and <a href=\"https://www.reuters.com/technology/apple-make-tools-parts-fix-phones-computers-available-nationwide-white-house-2023-10-24/\">was shared by <em>Reuters</em></a>. Apple has not yet made a formal announcement, but more information is expected later today.\r<br />\n\r<br />\nThe White House is aiming for a nationwide right to repair law, which Apple is endorsing. Apple <a href=\"https://www.macrumors.com/2023/10/11/california-right-to-repair-law/\">recently supported</a> right to repair legislation in California because California's bill requires all repair parts to come from Apple. Third-party components must be disclosed by non-authorized repair shops.\r<br />\n\r<br />\nApple has been offering a self-service repair program for consumers since 2022, providing genuine repair manuals, parts, and tools through its <a href=\"https://www.selfservicerepair.com/en-US/home\">Self-Service Repair Store</a>. At the current time, Apple offers repair kits and parts for iPhones, Mac notebooks, Mac desktops, and Apple displays.\r<br />\n\r<br />\nApple also <a href=\"https://www.macrumors.com/2019/08/29/apple-independent-repair-program/\">offers a similar repair program</a> for some independent repair shops, allowing them to source genuine parts to repair out-of-warranty Apple devices.\r<br />\n\r<br />\nApple's Self-Service Repair Program is often more expensive than taking a device to an Apple retail location or Authorized Service Provider for repair, but it is a option for those who want to conduct their own repairs. Independent Repair Provider Program participants <a href=\"https://www.macrumors.com/2020/02/06/apple-independent-repair-shops-contracts/\">have also complained</a> about Apple's invasive contracts and high component prices.<br />This article, \"<a href=\"https://www.macrumors.com/2023/10/24/apple-expanding-device-repair-programs/\">Apple Expanding Device Repair Programs for Consumers and Independent Shops</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-expanding-device-repair-programs-for-consumers-and-independent-shops.2408561/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4edcfd058987d1d81ab1ca697364a28312ebe41540f9462d94b76902b249ce3e","category":"Apple"}