{"title":"Giro d’Italia winners: A brief history","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-d-italia-winners-the-full-history","date":1682418696000,"content":"\n      <p><span>Beginning in 1909, the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia </a>has had a long history, and up until today 105 winners have proudly worn the maglia rosa on top of the podium. One of the three prestigious Grand Tours, the Giro is the first of the year and winning the general classification title is a monumental moment in any rider's career. </span></p>\n<div></div>\n<p><span>On May 6, all the UCI WorldTour teams will line up on the start line in Italy, with eight riders in a team all looking to make their mark in Italy's premier race But only one rider will wear the maglia rosa while being showered in pink confetti in Rome. </span></p>\n<p><span>We take a look back at some of the former Giro d'Italia winners and those who set benchmarks in the race’s history. </span></p>\n<h3><b>Most Giro d’Italia wins</b></h3>\n<p>As of 2022, 22 riders have won the Giro d'Italia more than once, with some elite riders winning the pink jersey five times in their careers. It’ll come as no surprise that those who top the leaderboard for most Giro wins are some of the legendary names of the sport. </p>\n<p><span>The three riders that share the crown of most Giro d’Italia wins are Alfredo Binda, Fausto Coppi, and Eddy Merckx. While none of them were able to win the GC for five consecutive years, each of them have forever written their names in the Giro's history for their remarkable achievement in returning five times to win one of the world's most gruelling events. </span></p>\n<p><span><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Coppi-Giro_1950_01_a88ecaa7-9808-4c49-a94e-8135c2f794aa.jpg?v=1681204696\" alt=\"Coppi at the 1950 Giro d'Italia\" /></em></span><span><i>Fausto Coppi on the start line of the 1950 Giro d'Italia – the first year he'd win the </i><i>Italian</i><i> Grand Tour</i></span></p>\n<p><span>Binda was the first rider to succeed multiple times on the Italian roads, taking his first victory in 1925, the 13th edition of the Giro. With a total distance of over 3,500km across 12 stages, only 39 out of 126 riders made it to the finish line in Milan, with Binda winning with an advantage of almost five minutes. He then went on to win in 1927, 1928, 1929 and 1933. He wrote history in the sport, becoming the first to win the Giro on five occasions. Before him, only Giovanni Brunero had succeeded in winning more than once with three wins. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-giro-d-italia-trophy-maker-inside-the-factory\"><em><strong>Read more: Inside the factory where they make the Giro d'Italia trophy</strong></em></a></p>\n<p><span>It wasn’t until the 1940s that Coppi won his first Giro title, just before the Grand Tour was cancelled due to the Second World War in 1941. Not only did Coppi win this race with a lead of 2:40, it was also his first time attempting the Italian Grand Tour. It wasn’t until seven years later, in 1947, that he won his second title. The Italian then went on to win in 1949, 1952 and 1953. </span></p>\n<p><span>Dominated by Italian riders, the Giro has only had a handful of people from outside its home country win more than once. Belgian cycling legend Merckx is one of those, winning his first maglia rosa in 1968, also taking the points classification and mountains classification, dominating that year’s edition. He won the Giro again in 1970, and then won the overall title back-to-back from 1972 until 1974. </span></p>\n<p><span>No rider in recent history has come close to rivalling their five wins. Only Alberto Contador and Vincenzo Nibali have won the Giro more than once in recent years, but they are both now retired. </span></p>\n<ul>\n<li><span><strong>Five wins:</strong> Alfredo Binda, Fausto Coppi and Eddy Merckx</span></li>\n<li><span><strong>Three wins:</strong> Giovanni Brunero, Fiorenzo Magno, Felice Gimondi, Bernard Hinault</span></li>\n<li><span><strong>Two wins:</strong> Carlo Galetti, Costante Girardengo, Giovanni Valetti, Charly Gaul, Franco Balmamion, Jacques Anquetil, Giuseppe Saronni, Miguel Indurain, Ivan Gotti, Gilberto Simoni, Paolo Savoldelli, Ivan Basso, Alberto Contador, Vincenzo Nibali </span></li>\n</ul>\n<h3><strong>Youngest Giro d'Italia winners</strong></h3>\n<p>Over the past decade, opportunities and confidence in young riders has meant that riders in their early 20s have achieved the monumental feat of winning Grand Tour early in their careers. But this is not a new trend in the Giro, with many of the youngest riders winning it in its early history. </p>\n<p>Not only did Coppi win his first Giro on his first attempt, he is also the youngest winner in the race's history – aged just 20 years and 268 days. Coppi is also the second youngest Grand Tour winner behind Henri Cornet, who won the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> in 1904, aged 19 years and 352 days. </p>\n<p><a href=\"https://www.rouleur.cc/es/blogs/the-rouleur-journal/the-history-of-tour-de-france-winners\"><em><strong>Read more: The full history of Tour de France winners</strong></em></a></p>\n<p><em></em>The second youngest Giro d'Italia winner is Luigi Marchisio, who won in 1930, aged 21 years and 43 days. He held the title of the youngest winner until Coppi won 10 years later in 1940. The youngest winner in the past decade was Nairo Quintana, who won in 2014, aged 24 and 117 days. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-532799104.jpg?v=1681204975\" alt=\"Quintana in his leaders kit at the 2014 Giro d'Italia\" /><em>Nairo Quintana donning the maglia rosa in the 2014 Giro d'Italia </em></p>\n<ul>\n<li>\n<strong>Fausto Coppi:</strong> 20y+268d</li>\n<li>\n<strong>Luigi Marchisio:</strong> 21y+43d</li>\n<li>\n<strong>Giuseppe Saronni:</strong> 21y+257d</li>\n<li>\n<strong>Gino Bartali:</strong> 21y+325d</li>\n<li>\n<strong>Franco Balmamion:</strong> 22y+150d</li>\n<li>\n<strong>Damiano Cunego:</strong> 22y+254d</li>\n<li>\n<strong>Alfredo Binda:</strong> 22y+301d</li>\n<li>\n<strong>Gino Bartali:</strong> 22y+317d</li>\n<li>\n<strong>Eddy Merckx:</strong> 22y+361d</li>\n</ul>\n<h3><strong>Oldest Giro d'Italia winners</strong></h3>\n<p>Age is just a number for some cyclists when it comes to winning Grand Tour titles, and winning the Giro is no exception. <span>Aged 34 years and 180 days, t</span>he oldest rider to date is Fiorenzo Magni, who won in 1955 – his third Giro win. This was closely followed by Tony Rominger, who was aged 34 years and 69 days when he won in 1995. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-515257910.jpg?v=1681205109\" alt=\"Magni celebrating his win at the Giro \" /><em>Fiorenzo Magni celebrating his win at the 38th Giro d'Italia</em></p>\n<p>Coppi once again enters the charts of the oldest Giro winners. His fifth and final win in 1953 saw him become the third oldest winner at the age of 33 years and 261 days. </p>\n<p>However, Chris Horner is the oldest Grand Tour winner in history, winning the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> in 2013 aged 41. </p>\n<ul>\n<li>\n<strong>Fiorenzo Magni:</strong> 34y+180d</li>\n<li>\n<strong>Tony Rominger:</strong> 34y+69d</li>\n<li>\n<strong>Fausto Coppi:</strong> 33y+261d</li>\n<li>\n<strong>Felice Gimondi:</strong> 33y+257d</li>\n<li>\n<strong>Chris Froome:</strong> 33y+7d</li>\n<li>\n<strong>Francesco Moser:</strong> 32y+357d</li>\n<li>\n<strong>Fausto Coppi:</strong> 32y+267d</li>\n<li>\n<strong>Ivan Basso:</strong> 32y+185d</li>\n<li>\n<strong>Alberto Contador:</strong> 32y+176d</li>\n</ul>\n<h3><b>Recent Giro d’Italia winners: </b></h3>\n<p><strong>2022:</strong> Jai Hindley (Bora-Hansgrohe) </p>\n<p><span><strong>2021:</strong> Egan Bernal (Ineos Grenadiers)</span></p>\n<p><span><strong>2020:</strong> Tao Geoghegan Hart (Ineos Grenadiers)</span></p>\n<p><span><strong>2019:</strong> Richard Carapaz (Movistar)</span></p>\n<p><span><strong>2018:</strong> Chris Froome (Team Sky) </span></p>\n<p><span><strong>2017:</strong> Tom Dumoulin (Team Sunweb)</span></p>\n<p><span><strong>2016:</strong> Vincenzo Nibali (Astana) </span></p>\n<p><span><strong>2015:</strong> Alberto Contador (Tinkoff-Saxo)</span></p>\n<p><span><strong>2014:</strong> Nairo Quintana (Movistar)</span></p>\n<p><span><strong>2013:</strong> Vincenzo Nibali (Astana)</span></p>\n<p><span><strong>2012:</strong> Ryder Hesjedal (Garmin-Barracuda) </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4ee27d6ec145e6160dba8aa645440632a71dcdc3e94f757b979e61b943ac42f9","category":"Cycling"}