{"title":"iFixit Explains iPad Mini 'Jelly Scroll' Issue in Teardown Video","link":"https://www.macrumors.com/2021/09/29/ifixit-ipad-mini-teardown-jelly-scroll/","date":1632946356000,"content":"iFixit today tore apart one of Apple's new <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a> models, and in the process of the teardown, the repair site gave a detailed overview of why the new tablets are displaying an issue that has been dubbed \"jelly scrolling.\"\r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\nSome new <a href=\"https://www.macrumors.com/guide/ipad-mini-6/\">iPad mini 6</a> owners have noticed that text or images on one side of the screen appear to be tilted downward when scrolling through content, which affects all LCD screens but is particularly noticeable on the ‌iPad mini‌.\r\n<br />\r\n\r\n<br />\r\nAccording to iFixit, jelly scrolling usually isn't as prominent as it is on Apple's new 8.3-inch tablet, and it's caused by the way the screen refreshes. The screen refreshes from one side to another, in a wave-like pattern, rather than all at once. On the ‌iPad mini‌, iFixit speculates that the direction the screen is scanning is related to the placement of the controller board that drives the ‌iPad mini‌ display, and that's why there's jelly scrolling when in portrait mode.\r\n<br />\r\n\r\n<br />\r\nThe ‌iPad mini‌ has a controller board that's located in a vertical orientation on the left hand side. The <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a>, which does not exhibit the same issue in portrait orientation, has a controller board located at the top of the tablet.<blockquote>When you scroll parallel to the direction the display is refreshing, the display still isn't refreshing all at once, but the effect of the refresh is less noticeable because it's not splitting the text.\r\n<br />\r\n\r\n<br />\r\nThis is why you probably don't notice this on other displays. The jelly scroll is usually masked because the display is refreshing (or scanning) parallel to whichever way the scrolling motion is taking place. So a computer monitor will refresh vertically in its landscape orientation, and a smartphone will refresh vertically in its portrait orientation.\r\n<br />\r\n\r\n<br />\r\nIt just so happens that this iPad mini display is refreshing horizontally when you hold it in its vertical orientation, which is the way you typically hold an iPad to scroll.</blockquote>iFixit says that it's also possible that Apple is using a cheaper display panel for the ‌iPad mini 6‌, which could have resulted in the refresh scan being more pronounced than expected.\r\n<br />\r\n\r\n<br />\r\nApple has said that the jelly scrolling issue <a href=\"https://www.macrumors.com/2021/09/28/apple-jelly-scrolling-normal-behavior/\">is normal behavior</a> for an LCD screen, and that likely means the company does not plan to offer replacements for users who are seeing this issue. For that reason, those unhappy with the ‌iPad mini‌'s display should make sure to return the tablet within its 14 day return window.\r\n<br />\r\n\r\n<br />\r\nThere were no other major surprises with the ‌iPad mini 6‌, but a full look inside is available in iFixit's video. Overall, iFixit gave the ‌iPad mini‌ a repair score of three due to an excess of adhesive and other repair limitations.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/ifixit/\">iFixit</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPad_Mini\">iPad Mini (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ipad.137\">iPad</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/29/ifixit-ipad-mini-teardown-jelly-scroll/\">iFixit Explains iPad Mini 'Jelly Scroll' Issue in Teardown Video</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ifixit-explains-ipad-mini-jelly-scroll-issue-in-teardown-video.2314462/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=luQIER9GguY:i4oU6L3KLJQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=luQIER9GguY:i4oU6L3KLJQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/luQIER9GguY\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4ee941e3725fb55758c94e0edfd96420849c99e7850b3b71cf5e4fe154435ff3","category":"Apple"}