{"title":"Google Pixel Fold: The thinnest foldable (with the biggest battery) in the US","link":"https://arstechnica.com/?p=1938017","date":1683745278000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/14-1-980x668.jpg\" alt /></div>\n          <p>\n            This lineup, from left to right, shows the Pixel 7 Pro, Pixel 7, Pixel 7a, and then the Pixel Fold. It's very short and very wide.                           [credit:\n                              Google                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Following Google's <a href=\"https://arstechnica.com/gadgets/2023/05/google-makes-the-pixel-fold-official/\">early half-announcement</a> that the Pixel Fold is a real phone, Google finally posted the full details of the upcoming foldable today during the company's I/O conference. Google's first-ever foldable smartphone will cost $1,799, and it's up for preorder now. Google says the phone is shipping next month sometime.</p>\n<p>First, let's talk about the very interesting dimensions of the Pixel Fold. The official specs have the phone at 139.7×79.5×12.1 mm when folded and 139.7×158.7×5.8 mm when open. Just look at the lineup of Pixel phones in the gallery above. The Fold is both the shortest and widest phone in the lineup. That 5.8 mm thickness for each half is very thin, easily besting the 6.3-mm-thick Galaxy Z Fold 4 and the <a href=\"https://arstechnica.com/gadgets/2022/12/oppos-foldable-phones-take-on-samsung-with-a-flip-phone-and-a-tablet/\">Oppo Find N2,</a> which is 7.4 mm thick.</p>\n<p>Google calls this the thinnest foldable on the market. That's true for the US, but internationally, you can find the <a href=\"https://arstechnica.com/gadgets/2023/03/huaweis-foldable-is-thinner-lighter-and-has-more-battery-than-samsung/2/\">Huawei Mate X3</a> at 5.3 mm for each half or the 5.4-mm-per-half <a href=\"https://arstechnica.com/gadgets/2022/08/xiaomi-clones-the-galaxy-fold-makes-it-40-thinner-adds-a-bigger-battery/\">Xiaomi Fold 2</a>. We're usually not fans of the old-school smartphone thinness wars, but for foldables, which are mini tablets you're supposed to carry in a pocket, bulk can be a real problem. Google is pitching this device as being pocket-friendly. At 283 g, though, it seems like it will weigh a lot compared to the Fold 4 (263 g) or the Oppo Find N2 (a very impressive 233 g).</p></div><p><a href=\"https://arstechnica.com/?p=1938017#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1938017&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4ef4c93ff5616d744d3199cf806e34969d097d5b08e1f6d3db846e798f76a007","category":"Tech"}