{"title":"Qualitative behavioral assessment of dogs with acute pain","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305925","date":1718978400000,"content":"<p>by Francesca Zanusso, Barbara Contiero, Simona Normando, Flaviana Gottardo, Giulia Maria De Benedictis</p>\r\n\r\nFree Choice Profiling (FCP) methodology allows observers to qualitatively assess animal behavior using their own vocabulary. This study aims to investigate the ability of 3 different observer groups to recognize pain-related emotions in 20 dogs using FCP methodology, and to compare FCP data with the Glasgow Composite Pain Scale-Short Form (GCPS- SF) scores. The observer groups consisted of 10 dog owners, 10 veterinary students and 10 veterinarians. Ten healthy (“healthy”) dogs and 10 dogs showing clinical signs of pain (“pain”) were filmed, and the resulting 20 footages were shown to observers who were blind to the pain-related nature of the study. All observers described and scored animals’ emotional expression using FCP; then, students and veterinarians scored all dogs using GCPS- SF. FCP data were analyzed using Generalized Procrustes Analysis (GPA). Spearman correlation coefficient (ρ) was used to determine the correlation among observer groups’ FCP scores of the first two FCP dimensions (DIM1 and DIM2), and to compare GCPS-SF scores with FCP scores for the students and veterinarian observer groups. Each observer group reached a significant (p &lt; 0.001) good consensus profile. “Healthy” dogs were mainly described as “quiet” and “lively”, while the majority of “pain” dogs were considered “in pain” and “suffering”. The correlation among FCP scores was high between owners’ DIM1 and students’ DIM1 (ρ = -0.86), owners’ DIM2 and students’ DIM2 (ρ = 0.72) and students’ DIM2 and vets’ DIM1 (ρ = 0.70). The correlation between GCPS-SF scores and FCP scores was high for students’ DIM2 (ρ = 0.77) and for veterinarians’ DIM1 (ρ = 0.92). Qualitative methods such as FCP could be used in association with semi-quantitative methods to evaluate the effect of pain on animal emotional expression. Observers’ cultural background and personal experience did not substantially affect qualitative behavioral assessment in dogs with acute somatic pain.","author":"Francesca Zanusso","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4ef43f99e5ae48c64e9024306393e5cce749edf4dcebeaa8f71256a36408afd1","category":"Interdisciplinary"}