{"title":"Removal of E133 brilliant blue dye from artificial wastewater by electrocoagulation using cans waste as electrodes","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14292?af=R","date":1709812904000,"content":"<h2>Abstract</h2>\n<p>Solid-waste management, particularly of aluminum (Al), is a challenge that is being confronted around the world. Therefore, it is valuable to explore methods that can minimize the exploitation of natural assets, such as recycling. In this study, using hazardous Al waste as the main electrodes in the electrocoagulation (EC) process for dye removal from wastewater was discussed. The EC process is considered to be one of the most efficient, promising, and cost-effective ways of handling various toxic effluents. The effect of current density (10, 20, and 30 mA/cm<sup>2</sup>), electrolyte concentration (1 and 2 g/L), and initial concentration of Brilliant Blue dye (15 and 30 mg/L) on the efficiency of the EC process were examined in this study. The results show that removal efficiency increased with current density and sodium chloride (NaCl) concentration and decreased with initial dye concentration. The electrical power and electrodes consumed increased with an increase in current density and decreased notably with increased NaCl. The optimum current density and amount of NaCl were 20 mA/cm<sup>2</sup> and 2 g/L, respectively to attain highest values of E133 brilliant blue dye removal. The EC process was examined using adsorption isotherms and kinetics models. Those results showed that the Langmuir isotherm matched the experimental data. Furthermore, the experimental data were followed the Elovich model kinetics.</p>","author":"Rasha H. Salman, \nEntisar M. Khudhair, \nKhalid M. Abed, \nAmmar S. Abbas","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"4f045b2bf287374f289a1d0a180b328452a78cf2ea0ef2251cfb3d0d7d9b8151","category":"Environment"}