{"title":"Bloomberg: Apple Watch Series 7 to Feature Thinner Screen Bezels, Faster Processor, and Updated Ultra Wideband Tech","link":"https://www.macrumors.com/2021/06/14/apple-watch-7-thinner-display-borders/","date":1623667285000,"content":"This year's Apple Watch Series 7 is likely to have thinner display bezels and use a new lamination technique that brings the display closer to the front cover, according to <em>Bloomberg</em>'s Mark Gurman.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-watch-6s-202009.jpeg\" />\r\n<br />\r\nFrom the <a href=\"https://www.bloomberg.com/news/articles/2021-06-14/apple-plans-faster-watch-future-temperature-and-glucose-sensors\">report</a>:\r\n<br />\r\n<blockquote>The Cupertino, California-based tech giant is planning to refresh the line this year -- with a model likely dubbed the Apple Watch Series 7 -- by adding a faster processor, improved wireless connectivity and an updated screen, according to people with knowledge of the plans. \r\n<br />\r\n\r\n<br />\r\nFor this year's model, Apple has tested thinner display borders and a new lamination technique that brings the display closer to the front cover. The new Watch is likely to be slightly thicker overall, but not in a way that's noticeable to the user.</blockquote>The model will also include updated ultra-wideband functionality, the same underlying technology in Apple's AirTag item finder, according to Gurman, although additional biometric health sensors are likely to be pushed back to a successor model.\r\n<br />\r\n<blockquote>Apple had previously aimed to put a body temperature sensor in this year's model, but that is now more likely to be included in the 2022 update. The blood-sugar sensor, which would help diabetics monitor their glucose levels, is unlikely to be ready for commercial launch for several more years.</blockquote>Apple previewed its upcoming <a href=\"https://www.macrumors.com/roundup/watchos-8/\">watchOS 8</a> software update at WWDC last week, demonstrating previously unseen features such as the ability for Apple Watch to unlock door and hotel rooms. It was not clear at the time which Apple Watch models these new features would be made for, but Gurman's report suggests they could be exclusive to the forthcoming Series 7.\r\n<br />\r\n\r\n<br />\r\nGurman previously <a href=\"https://www.macrumors.com/2021/03/26/apple-launch-apple-watch-extreme-sports-2021/\">reported</a> that Apple is working on a more rugged \"extreme sports\" model of the Apple Watch and that it could launch as soon as this year. However, Gurman has now revised that expectation and says that it won't arrive until 2022 at the earliest. Apple is also said to be planning a revised model of the <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a> for launch next year, according to the report. Apple launched the latter model in 2020 as a more affordable alternative to the Series 6.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a>, <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">bloomberg.com</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Caution)</a>, <a href=\"https://buyersguide.macrumors.com/#Apple_Watch_SE\">Apple Watch SE (Neutral)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/14/apple-watch-7-thinner-display-borders/\">Bloomberg: Apple Watch Series 7 to Feature Thinner Screen Bezels, Faster Processor, and Updated Ultra Wideband Tech</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/bloomberg-apple-watch-series-7-to-feature-thinner-screen-bezels-faster-processor-and-updated-ultra-wideband-tech.2300840/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=CBQgfAJOUwY:Fhlr7BJ9ZhI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=CBQgfAJOUwY:Fhlr7BJ9ZhI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/CBQgfAJOUwY\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4f148318aadd0779d42d1c0006fda4baaa5558e9f3000cb6773aa0e6e5bc6ac4","category":"Apple"}