{"title":"Below‐ground root nutrient‐acquisition strategies are more sensitive to long‐term grazing than above‐ground leaf traits across a soil nutrient gradient","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14565?af=R","date":1719984926000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/0c0315e5-2d02-431e-88fc-2ff8fac2120d/fec14565-toc-0001-m.png\" alt=\"Below-ground root nutrient-acquisition strategies are more sensitive to long-term grazing than above-ground leaf traits across a soil nutrient gradient\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/04/10/above-ground-leaf-and-below-ground-root-differ-in-their-response-to-long-term-grazing-root-traits-are-more-sensitive/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nUnderstanding how plant nutrient acquisition strategies respond to grazing at the community level is critical understanding ecosystem structure and functioning in grasslands. However, few studies have simultaneously compared the difference in above-ground (leaf) and below-ground (root) nutrient-acquisition strategies in response to long-term grazing, especially at the regional scale.\n\nHere, we measured a set of leaf and fine-root traits that correspond to the fast-slow economic spectrum at the community level in 10 experimental sites from paired grazed and ungrazed grasslands across a soil nutrient gradient covering three major types of grasslands in northern China.\n\nWe found that patterns of variations of leaf and fine-root traits were consistent with both a leaf and root economic spectrum at the community level for both grazed and non-grazed plots. Grazing had minor effect on community-level leaf nutrient-acquisition strategies but strongly influenced community-level root nutrient-acquisition strategies. Specifically, root nutrient-acquisition strategies were shifted to more exploitative resource use in grazed communities. Moreover, soil nutrient contributed to the changes in both leaf and root nutrient-acquisition strategies, which tended towards a more resource acquisition strategy with increasing soil nutrient levels. Grazing significantly interacted with soil nutrient to affect root nutrient-acquisition strategies, and grazing contributed more to root nutrient-acquisition strategies than soil nutrient.\n\n<i>Synthesis</i>. Our results demonstrated completely inconsistent responses of community-level above- and below-ground resource acquisition strategies to long-term grazing, and below-ground acquisition strategies were more sensitive to long-term grazing. Our findings also suggest that high intensity anthropogenic activities such as grazing may strongly modify below-ground resource acquisition strategies.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/04/10/above-ground-leaf-and-below-ground-root-differ-in-their-response-to-long-term-grazing-root-traits-are-more-sensitive/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Jinting Cai, \nXiaobin Pan, \nYingli Xiao, \nYue Wang, \nGuangyin Li, \nYao Wang, \nMinna Zhang, \nLing Wang","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"4f1534b55d490acc6dadf162af021b7b9e841fe1e026ba4ff56d5e25ad6df73f","category":"Environment"}