{"title":"Selle Italia Model X Green Superflow saddle review: Only $50, rides like $200","link":"https://cyclingtips.com/2021/08/selle-italia-model-x-green-superflow-saddle-review-only-50-rides-like-200/","date":1628042068000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-1-650x366.jpg\" /></div><h2>Selle Italia Model X Green Superflow saddle review: Only $50, rides like $200</h2><p>\n</p><p>It seems these days that most of us are used to bicycle saddles that cost an exorbitant amount of money. Performance models that are halfway decent are almost guaranteed to cost well into the triple digits. You want carbon fiber rails? Go ahead and double that. Specialized’s flagship S-Works Power Mirror saddle with its fancy 3D-printed top retails for a mind-splitting US$450 / AU$750 / £390 / €429. And let’s not even get into even-fancier custom models or proper ultralights made with 100% carbon fiber. </p>\n\n\n\n<p>Selle Italia’s Model X Green Superflow, on the other hand, costs just US$50 / AU$TBC / £45 / €50, and that’s at full retail. But despite the bargain pricing, it looks and rides like a million bucks.</p>\n\n\n\n<h2>A familiar shape</h2>\n\n\n\n<p>At first glance, the Model X Green Superflow seems to borrow design elements from a variety of popular models. In keeping with recent trends, it’s a short-nosed saddle with a total length of 245 mm and a single 145 mm width for now — nearly identical to the <a href=\"https://cyclingtips.com/2017/10/specialized-power-vs-pro-stealth-stub-nose-saddle-comparison-review/\" target=\"_blank\">Specialized Power and PRO Stealth</a>. The Model X Green Superflow also has a large cutout like those other two saddles, but the broader nose and more gradual taper is more similar to the Stealth, its center channel runs the full length of the upper, and its side-to-side profile is slightly more curved than the Power or Stealth, both of which are notably flatter across the top. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-2-1340x754.jpg\" /><figcaption>The Model X Green Superflow follows the trend of short-nosed saddles, but there are enough differences between other similar saddles like the Specialized Power and Pro Stealth that it still feels different while riding.</figcaption></figure>\n\n\n\n<p>In terms of its fore-aft profile, the Model X Green Superflow is more akin to the Stealth, with just the slightest dip in the middle, as opposed to the Power, which has a more pronounced kick toward the tail. Generally speaking, though, the Model X Green Superflow is a very normal-looking saddle. Whereas something like a Toyota Prius or BMW i3 is purposely trying hard to make sure everyone knows it’s different, Selle Italia seems to be intentionally flying under the radar.</p>\n\n\n\n<p>It’s when you look more closely that things start to get a little weird.</p>\n\n\n\n<p>The cover of the Model X Green Superflow is oddly rubbery, with the embossed logos and dots providing just the slightest hint that it’s a molded part, as opposed to more conventional saddles where a cover material is stretched over a separate layer of padding. Selle Italia won’t provide much detail on the actual manufacturing process, but exploded images provided by the company sure seem to suggest the cover and gel padding are all formed together in a single step.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-4-1340x838.jpg\" /><figcaption>Selle Italia builds the Model X Green Superflow using some sort of proprietary automated process. It supposedly eliminates adhesives and polyurethanes, but it also allows for a very good saddle at a shockingly low price. Photo: Selle Italia.</figcaption></figure>\n\n\n\n<p>On more conventional saddles, the rails attach to the underside of the shell at the very tip and tail. But on the Model X Green Superflow, the shell — which is presumably some type of fiber-reinforced plastic — is molded together in one piece with the forward and rearward bits of the rail anchors. Shoehorned in between those stubs are two relatively short steel rails instead of the usual U-shaped bit.</p>\n\n\n\n<p>Selle Italia isn’t just staying mum about how the upper is constructed; the company isn’t revealing any specifics at all on exactly how any of this is manufactured, aside from the fact the process is fully automated and uses no adhesives or polyurethanes. Even just that fully automated part, however, is incredibly intriguing given what I’ve seen at every saddle factory I’ve visited over the years.</p>\n\n\n\n<p>“It’s the first saddle made entirely via automation — the first no-glue-no-touch saddle to be produced by Selle Italia, possibly anybody,” said the company’s US media relations agent, Tim Jackson. “It’s quite literally a ‘pour all the materials in one side and out comes a saddle on the other.'”</p>\n\n\n\n<p>According to Jackson, Selle Italia’s process is also subject to very stringent EU rules since the saddles are wholly manufactured in Italy, including EU-sourced materials that fall under the same environmental requirements. It also helps that everything is located more closely geographically, which cuts down on transportation. </p>\n\n\n\n<h2>Putting it to the test</h2>\n\n\n\n<p>I did two short rides on my sample to test the waters before deciding to just dive in with a 157 km (98-mile) charity ride that I knew would entail somewhere around six hours. Granted, I was also going to be armed with a good chamois (<a href=\"https://cyclingtips.com/2021/05/review-castellis-new-premio-black-bib-shorts/\" target=\"_blank\">thanks Castelli</a>!), but that sort of throw-caution-to-the-wind behavior generally isn’t advised when it comes to new saddles.</p>\n\n\n\n<p>I’m happy to say, however, that the Model X Green Superflow not only passed with flying colors, but that I barely thought about it at all, which is about the highest praise you can give to any saddle, new or otherwise.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-7-1340x754.jpg\" /><figcaption>The nose of the saddle looks to be punishingly hard, but the gel-like padding is surprisingly cushy in spite of how thin it is. The exposed plastic edges didn’t bother me, either.</figcaption></figure>\n\n\n\n<p>The gel padding is relatively thin, but its high density provides excellent support that never grew tiresome. The rather firm shell helps further in that respect, but there’s still a bit of tuned flex that helps on unexpected potholes, too. I admittedly haven’t had the saddle long enough to know if the padding will “pack out”, but past experience has demonstrated that gel-based padding is generally resistant to that sort of thing. Whether the plastic shell will hold up just as well remains to be seen, but I find the overall stiffness of the thing to be pretty encouraging.</p>\n\n\n\n<p>At least for me, I’d say the Model X Green Superflow’s shape is spot-on. I initially had doubts about how flat and thin the nose looked, but even that proved to be a non-issue. I spent the last hour of that ride perched far forward on the saddle as I was trying to stay low to outrun the incoming rain clouds (I was unsuccessful), and it was remarkably comfortable, even with the edges of the plastic shell peeking out below. </p>\n\n\n\n<p>I personally found the slightly more curved left-to-right profile to provide a more “locked in” feeling than what I usually get with a Power or Stealth, too, and it was easy to find a comfy spot and stay there. There was another 15 km-long (10-mile) stretch in the middle of the ride where we were getting pounded with rain, and it was only after rolling into the next rest stop that I realized I hadn’t moved on the saddle at all after the first few drops started to fall. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-3-1340x754.jpg\" /><figcaption>The Model X Green Superflow is notably more curved left-to-right than the Specialized Power or Pro Stealth.</figcaption></figure>\n\n\n\n<p>In fairness, some of that locked-in feeling likely comes from the cover material, the rubbery texture of which is grippier than usual. I didn’t have any problems with it when wearing Lycra, but it’s arguably a little too grippy when wearing baggies. On the plus side, whatever material Selle Italia is using here doesn’t absorb water at all, so even if you’re caught in a downpour like I was, you can rest assured that at least your saddle won’t stay wet for hours after the sun comes out again.</p>\n\n\n\n<p>The Model X Green Superflow even looks good to my eye, with a high-performance shape and excellent finish work that provides few clues to its budget pricing. I could do without the battleship-grey cover color, but my guess is that’s an easy thing for Selle Italia to change. </p>\n\n\n\n<p>My only real complaint here is the weight (you didn’t think there was no catch at all, did you?) Selle Italia quotes the Model X Green Superflow at a relatively hefty 315 g, and my test sample came in just a single gram lighter. That makes the Model X Green Superflow exactly twice as heavy as an S-Works Power, although that saddle is also <em>six</em> times more expensive. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-5-1340x754.jpg\" /><figcaption>Selle Italia is making a big deal of the saddle’s “green” bona fides. But what’s more interesting is how Selle Italia might be able to use this technology to perhaps dramatically lower prices for high-performance saddles.</figcaption></figure>\n\n\n\n<p>Keen-eyed readers might notice that the Model X Green Superflow looks nearly identical to Selle Italia’s Novus Boost Evo Superflow, which is 70 g lighter thanks to its lighter-weight padding, yet doesn’t cost too much more. I haven’t tried that one myself, but unless that foam padding is similarly supportive, I’d rather save the money.</p>\n\n\n\n<p>Point being, weight weenies obviously need not apply here. But for everyone else, the Selle Italia Model X Green Superflow seems like one hell of a bargain.</p>\n\n\n\n<h2>Future implications</h2>\n\n\n\n<p>It’s worth noting that the process used to produce the Model X Green Superflow is entirely new to Selle Italia, and the fact that the company is able to make something so good in Italy with such a remarkably affordable price is astounding. </p>\n\n\n\n<p>What’s far more intriguing is where the company might take this technology from here.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-11-1340x754.jpg\" /><figcaption>This might technically be true, but it’s not entirely obviously what the material is so that sorting facilities can know what to do with all of the bits.</figcaption></figure>\n\n\n\n<p>Additional widths seem like a natural next step, along with more color choices. But if the cost savings are what Selle Italia says they are, it seems safe to assume that the company will release more models sooner than later, all of which would likely be cost-disruptive. Something with a more traditional full-length shape, perhaps? Or something more purpose-built for mountain biking? Maybe a higher-performance variant with carbon rails and more pared-down padding might be possible? </p>\n\n\n\n<p>If Selle Italia is able to pull off something like any or all of the above, it’d not only put a whole bunch of other brands on notice, but could recalibrate the public’s expectations on how much higher-performance saddles should cost.</p>\n\n\n\n<p>Yes, this sucker is heavy, but it really is that good. Go buy one. You can thank me later.</p>\n\n\n\n<p>More information can be found at <a href=\"https://us.selleitalia.com/en/saddles/model-x-green-superflow/\" target=\"_blank\">www.selleitalia.com</a>.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-6-1340x754.jpg\" /><figcaption>The cover material is rather grippy. Whether you consider that a good or bad thing will depend on what you prefer.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-8-1340x754.jpg\" /><figcaption>The steel rail sections look super short, and indeed, there’s only 80 mm exposed. They extend a fair bit into those plastic stubs,though.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-9-1340x754.jpg\" /><figcaption>Selle Italia’s “Flex Control” supposedly allows for flex in the shell where you want it, but stiffness elsewhere. The saddle is awfully comfy, so I guess it works.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Selle-Italia-Model-X-Green-Superflow-saddle-review-10-1340x754.jpg\" /><figcaption>There are slots molded into the rear section to attach a saddle pack. The slots are only 40 mm long, though, so you’ll want to check if that’ll work with your preferred bag.</figcaption></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/08/selle-italia-model-x-green-superflow-saddle-review-only-50-rides-like-200/\">Read More</a>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4f1b9b30d581aaf7ac03657a55dd2197842b33a65594e53126e477d2a4a503f9","category":"Cycling"}