{"title":"Cooking Emissions Levels and Associated Health Effects among Households in Dodoma City, Tanzania","link":"https://www.preprints.org/manuscript/202404.1369/v1","date":1713796005000,"content":"BACKGROUND AND OBJECTIVE: The use of biomass for cooking carries significant health implications and can lead to adverse environmental issues such as deforestation, greenhouse gas emissions, and erosion. Despite these concerns, there is a lack of information about the nature and extent of cooking emissions in many developing countries. To address this gap, a study was conducted to assess cooking emission levels and their associated health effects among households in Dodoma City, Tanzania.\nMETHODS: A descriptive cross-sectional design was conducted, involving 285 households in the peri-urban area of Dodoma City, Tanzania. A combination of questionnaires, observational checklists, and sampling devices (Aeroqual series 500 for Carbon Monoxide and Temptop PMD 351 for Particulate Matters) were employed for data collection, adhering to established protocols. Additionally, lung function tests were conducted with consent from the primary household cooks. Collected data were entered into an Excel spreadsheet and analyzed using STATA 17 software.\nFINDINGS: Out of 285 participants, 74.7% predominantly use charcoal for cooking, with 68.4% having outdoor kitchen setups. Significant differences in pollutant concentrations were observed across various fuel types (P=0.0001), with firewood emitting higher levels of particulate matter and carbon monoxide. Carbon monoxide concentrations during cooking were 6 times higher for firewood, 5 times higher for charcoal-gas, and 3 times higher for charcoal compared to WHO daily average limits. Additionally, a positive correlation between pollutant concentrations was noted (P-value = 0.0000). Lung problems 17.8% followed by eye irritation 15.7% were mentioned by those who claimed to know the health effects associated with cooking emissions. In addition, the spirometry test indicated that the majority of the participants had % predicted &gt;80 while only 19% had % predicted below 50. \nCONCLUSION: Charcoal and firewood remain the primary cooking fuels in the study area despite their significant negative impacts. Our findings highlight a lack of awareness among community members regarding the health effects of biomass cooking emissions and insufficient guidance on constructing healthy kitchens. To address this, enforcing building standards, raising health awareness, and ensuring affordable access to modern fuels are crucial steps. These measures are essential for promoting healthier cooking practices and mitigating the adverse effects on households.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4f20b749ce32596bc16ff58a95ceecad9f8d40efa747a57e3d303ace1a8a6d5a","category":"Interdisciplinary"}