{"title":"[ลือ] Netflix กำลังพิจารณาขึ้นราคาสมาชิก มีผลในอเมริกาและแคนาดาก่อน","link":"https://www.blognone.com/node/136057","date":1696377021000,"content":"<div><div><div><p>มีรายงานจาก The Wall Street Journal ระบุว่า Netflix มีแผนปรับขึ้นราคาค่าสมาชิกอีกครั้ง มีผลกับแพ็คเกจราคาสูงที่ไม่มีโฆษณาแทรกระหว่างรับชม เบื้องต้นจะขึ้นราคาเฉพาะในอเมริกาและแคนาดาก่อน ส่วนการขึ้นราคาในประเทศอื่นทั่วโลกยังอยู่ในขั้นตอนหารือ</p>\n<p>ทั้งนี้ The Wall Street Journal สอบถามเรื่องนี้ไปยัง Netflix แต่บริษัทปฏิเสธที่จะให้ความเห็น ทั้งนี้ Netflix มีการปรับขึ้นราคาครั้งล่าสุดใน<a href=\"https://www.blognone.com/node/126723\">เดือนมกราคม 2022</a> แต่มีผลเฉพาะอเมริกาและแคนาดา</p>\n<p>ช่วงที่ผ่านมาผู้ให้บริการสตรีมมิ่งรายใหญ่ในอเมริกาต่างทยอยปรับขึ้นราคาสมาชิก โดยใช้กลยุทธ์คล้ายกันคือเพิ่มโปรแกรมถ่ายทอดสดการแข่งขันกีฬาเข้ามา เพื่อหวังว่าผู้ชมจะไม่ยกเลิกสมาชิก ขณะเดียวกันการขึ้นราคาก็มีผลเฉพาะแพ็คเกจไม่มีโฆษณา ส่วนแพ็คเกจราคาถูกกว่าที่มีโฆษณาจะคงราคาเดิมไว้ ทำให้ส่วนต่างมีมากขึ้น จูงใจให้ผู้ชมที่ไม่ต้องการจ่ายเงินเพิ่ม ย้ายมาดูแพ็คเกจติดโฆษณาแทน ซึ่งบริการสตรีมมิ่งหลายรายพบว่ารายได้เฉลี่ยต่อผู้ชมนั้น ได้เงินมากกว่าเพราะสามารถทำราคาจากการขายโฆษณาได้</p>\n<p>คาดว่า Netflix จะประเมินราคาที่ปรับขึ้นหลังการ<a href=\"https://www.blognone.com/node/134840\">ประท้วงหยุดงาน</a>ของสหภาพนักแสดง SAG-AFTRA สิ้นสุดลงก่อน โดยตอนนี้<a href=\"https://www.blognone.com/node/135956\">สมาคมผู้เขียนบท</a>ได้ยุติการประท้วงไปแล้ว พร้อมกับข้อตกลงเรื่องผลประโยชน์ใหม่ที่น่าจะเพิ่มมากขึ้น โดยคาดว่าส่วนของสหภาพนักแสดงก็จะมีรูปแบบคล้ายกัน</p>\n<p>ที่มา: <a href=\"https://www.wsj.com/business/media/netflix-price-increase-actors-strike-792de9be\">The Wall Street Journal</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e8bc53528633280794109ac053af101e.jpg\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/video-streaming\">Video Streaming</a></div><div><a href=\"/topics/rumors\">Rumors</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4f2a53bf47fb1555967b5b6fde8773d6a8bf47b0a152a982a558cf5d6785eeb2","category":"Thai"}