{"title":"Why Has Mastodon Adoption Stalled?","link":"https://blog.bloonface.com/2023/06/12/why-did-the-twittermigration-fail/","date":1687547111000,"content":"\n<p>Bloonface, in a thoughtful post regarding the stagnation in growth in the Fediverse:</p>\n\n<blockquote>\n  <p>Mastodon is at risk of falling into the trap that a lot of\nfree/open source software does, where the idea of the software\nbeing “free as in speech” is expected to outweigh or explain away\ndeficiencies in its usefulness. However, this ignores three\nsalient facts:</p>\n\n<ul>\n<li><p>Most people don’t give a thruppenny fuck about their freedom to\nview and edit the source code of the software they use, which\nthey would not know how to do even if they cared;</p></li>\n<li><p>Most people are not ideologically opposed to the notion of\nproprietary software, and cannot be convinced to be because it\nis simply not important to them and cannot be explained in terms\nthat are important to them; and</p></li>\n<li><p>When given the choice between a tool which is immediately useful\nfor achieving some sort of goal but conflicts with some kind of\nideological standpoint, and a tool which is not as useful but\nthey agree with ideologically, they will probably choose the\nformer.</p></li>\n</ul>\n</blockquote>\n\n<p>After Elon Musk took the helm at Twitter <a href=\"https://fedidb.org/\">there was an initial burst of new users and increased usage</a> on Mastodon (and the rest of the Fediverse, but mostly this is about Mastodon as an alternative to Twitter). And then it flattened, and perhaps has even declined.</p>\n\n<p>I would like to see Mastodon thrive. But the platform’s ideological zealotry is obviously holding it back and seemingly isn’t going to change. That’s why I’m much more optimistic about Bluesky’s long-term prospects. Six weeks later and I feel stronger than ever about <a href=\"https://mastodon.social/@gruber/110314523447694321\">this quip I posted in early May</a>:</p>\n\n<blockquote>\n  <p>Bluesky: “If you liked Twitter, you’ll love Bluesky.”</p>\n\n<p>Mastodon: “If you hated Twitter, you’ll like Mastodon.”</p>\n\n<p>Hundreds of millions of people liked what Twitter once was, and\nwhat it aspired to be. Bluesky might be that.</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/23/bloonface-twitter-migration\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"4f2ed1bbd6bfe708092a66e7fc6bf87f5ef548b53433b108456f3340a2965f15","category":"Tech"}