{"title":"How to check if the Pegasus spyware is installed on your iPhone","link":"https://www.macworld.com/article/351546/how-to-check-if-the-pegasus-spyware-is-installed-on-your-iphone.html","date":1626788586000,"content":"\n<div>\n<section><div></div></section><p>If you’re concerned about <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.washingtonpost.com/investigations/interactive/2021/nso-spyware-pegasus-cellphones/&amp;xcust=1-1-351546-0-0-0&amp;sref=https://www.macworld.com/feed?\">recent reports of the Pegasus spyware</a> reportedly installed by the Israeli NSO Group to hack journalists and world leaders, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://github.com/mvt-project/mvt&amp;xcust=1-1-351546-0-0-0&amp;sref=https://www.macworld.com/feed?\">there’s a tool to check if </a><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://github.com/mvt-project/mvt#readme&amp;xcust=1-1-351546-0-0-0&amp;sref=https://www.macworld.com/feed?\">it’s</a><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://github.com/mvt-project/mvt&amp;xcust=1-1-351546-0-0-0&amp;sref=https://www.macworld.com/feed?\"> hidden on your iPhone</a>. But <a href=\"https://www.macworld.com/article/351455/macalope-iphone-pegasus-spyware-threat-android-security.html\">you probably have nothing to worry about</a>.</p>\n\n\n\n<p>According to a report in the Washington Post in conjunction with nonprofit groups Forbidden Stories and Amnesty International and several others, military-grade spyware developed by an Israeli firm was used to hack some 40 smartphones “belonging to journalists, human rights activists, business executives and two women close to murdered Saudi journalist Jamal Khashoggi.” </p>\n\n\n\n<p>The phones appeared on a list of more than 50,000 phone numbers, according to the Post. NSO has denied the allegations.</p>\n\n\n\n<p>There’s a good chance your iPhone isn’t on that list. While the legality of the operation may be in question, reports say the NSO seemingly targeted high-level politicians, government officials, and journalists in the operation and were only successful less than half the time. For example, Amnesty International examined 67 phones and found that “23 were successfully infected and 14 showed signs of attempted penetration.” Of those, nearly all were iPhones, according to the investigation. </p>\n\n\n\n<p>But if you’re concerned, there’s a way to test whether your iPhone has been targeted. It’s not an easy test, mind you, but if you’re using a Mac or Linux PC and have backed up your iPhone using it, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://github.com/mvt-project/mvt&amp;xcust=1-1-351546-0-0-0&amp;sref=https://www.macworld.com/feed?\">the Mobile Verification Toolkit</a> will be able to detect whether your phone has the Pegasus spyware installed on it. The tool, which TechCrunch tested, works using the macOS Terminal app and searches your latest iPhone backup on your Mac, “is not a refined and polished user experience and requires some basic knowledge of how to navigate the terminal.” You’ll need to install libusb as well as Python 3 using Homebrew. (You can learn more about the installation <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://github.com/mvt-project/mvt#readme&amp;xcust=1-1-351546-0-0-0&amp;sref=https://www.macworld.com/feed?\">here</a>.) TechCrunch says the check only takes “about a minute or two to run” once it’s been set up.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4f304d17eb01ddadfac75f24ea9de7ad7ab60008b4313f64eb7e3979387d0fc3","category":"Apple"}