{"title":"Invasive crab positively correlated with native predatory crab species over a regional scale","link":"http://link.springer.com/10.1007/s10530-024-03390-7","date":1727740800000,"content":"<h3>Abstract</h3>\n                    <p>The abundance of an invasive species within an ecosystem after introduction can depend on multiple factors. Although large-scale abiotic data are typically used to model the distribution of invasive species, there may be other fine-scale environmental or biotic factors within the invaded range influencing changes in the species’ distribution and abundance. Here, we examined the abundance of the invasive tropical/subtropical green porcelain crab, <em>Petrolisthes armatus</em> (Gibbes, 1850)<em>,</em> at 33 oyster reef sites along 150 km of coastline within the northerly portion of its invaded range. We measured a suite of biological, physical, and landscape level metrics to examine which factors (other than temperature) were most associated with the abundance of this invasive species. <em>P. armatus</em> were present at 32 reefs across our spatial range and densities were highest at the northern sites in our domain. Our results revealed native mud crab density is positively correlated with <em>P. armatus</em> density, accounting for 23% of the spatial variation in abundance of <em>P. armatus</em> within its invaded range, more than 30 years after initial invasion. We hypothesize that the positive associations between native predatory mud crabs and this invasive crab may be a result of hydrodynamics aggregating both species within the same areas, or attraction by both crabs for the same fine-scale habitat structural attributes (i.e., interstitial space). These data emphasize the importance of collecting high-resolution survey data to understand the variables that are correlated with the abundance and distribution of invasive species at regional scales within its invaded range.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"4f39d8ba4a8657112222a54cd5979e34f51c836b40c47e1a1378ee552f6ef757","category":"Environment"}