{"title":"Biodiversity Conservation in Xishuangbanna, China: Diversity Analysis of Traditional Knowledge Related to Biodiversity and Conservation Progress, Achievements Evaluation","link":"https://www.preprints.org/manuscript/202403.1256/v1","date":1711021770000,"content":"Biodiversity plays an important role in maintaining the ecological balance of the earth. The study of traditional knowledge related to biological resources is a hot issue in the field of international biodiversity conservation. Xishuangbanna is a key area of biodiversity and a cultural hotspot of international significance. According to the Technical Regulation for Classification, Investigation, and Inventory of Traditional Knowledge Relating to Biological Diversity issued by the Ministry of Ecology and Environment, we investigated and catalogued the traditional knowledge related to biodiversity of the Jino people who have lived in Xishuangbanna for generations, and collected 490 entries of traditional knowledge related to biodiversity of the Jino people. Drawing on the traditional knowledge diversity index calculation method proposed by Wang Guoping, the overall traditional knowledge α-diversity index of the Jino people is 0.63, indicating that the richness of the traditional knowledge of the Jinuo people is relatively high. The traditional culture related to biodiversity, the traditional knowledge related to agricultural genetic resources, and the traditional technology related to the sustainable utilization of biological resources are relatively rich and diverse. The diversity index is 0.86, 0.82 and 0.79 respectively. In addition, Xishuangbanna has invested a lot of energy in biodiversity protection, including the establishment of nature reserves, botanical gardens, zoos, ecological tea gardens and other species reserves, the promulgation of laws and policies related to biodiversity protection, and has achieved remarkable results in in-situ protection and ex-situ protection. On the basis of analyzing the progress and achievements of biodiversity conservation in Xishuangbanna, this study points out that Xishuangbanna faces challenges such as the loss of traditional knowledge, insufficient conservation efforts, and great changes in land use, and puts forward corresponding suggestions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4f47d73ce84edcbbe1892c7eb6ffbd2f4566cae3eb9a5997d47c5711236f7630","category":"Interdisciplinary"}