{"title":"Google Plans to Delete Accounts That Haven't Been Used in Over Two Years","link":"https://www.macrumors.com/2023/05/16/google-deleting-inactive-accounts/","date":1684270260000,"content":"Google today announced that it is updating its <a href=\"https://blog.google/technology/safety-security/updating-our-inactive-account-policies/\">inactive account policy</a>, with Google Accounts that have not been used in at least two years to be deleted. Google says that accounts that have not been used for long periods of time are more likely to be compromised because of the use of older, less secure passwords and a lack of two-factor authentication.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/02/Google-Logo-Feature-Slack.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nGoing forward, if a Google Account has not been used or signed into for at least two years, Google may delete the account and its contents. This includes content from Gmail, Google Docs, Google Drive, Google Meet, Calendar, YouTube, and Google <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a>.\r<br />\n\r<br />\nThe policy is applicable to personal Google Accounts rather than those created for businesses and schools. Users with an inactive account will see those accounts being deleted starting in December 2023, but Google plans to provide plenty of notice before it starts to cull accounts.\r<br />\n\r<br />\nAccounts that were created and never used again will be the first to be nixed, with Google sending multiple notifications to both the account email address and the recovery email, if one has been provided.\r<br />\n\r<br />\nTo keep a Google Account active, Google recommends signing in at least once every two years, and anyone who has signed into an account or a Google service recently has an account that is considered active and will not be deleted.\r<br />\n\r<br />\nActivity includes reading or sending an email, using Google Drive, watching a YouTube video, downloading a Google Play app, using Google Search, having an active subscription through a Google Account, or using Sign in with Google.\r<br />\n\r<br />\nBack in 2020, Google said that it would wipe content from unused accounts but would keep the accounts intact. That is now changing with the plan to delete inactive accounts.<div>Tag: <a href=\"https://www.macrumors.com/guide/google/\">Google</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/16/google-deleting-inactive-accounts/\">Google Plans to Delete Accounts That Haven't Been Used in Over Two Years</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/google-plans-to-delete-accounts-that-havent-been-used-in-over-two-years.2389714/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4f4d6b3b7ae0ecf522c147ea25b88e1e4fd00f40ea7c9ccbf930078addf4ed2d","category":"Apple"}