{"title":"Release of CM‐12 from A2‐type casein by the cleavage of Ser–Leu–Xaa at the C‐terminus using Aspergillus oryzae alkaline protease","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13743?af=R","date":1720762748000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p><i>Aspergillus oryzae</i> protease can release the opioid peptide β-casomorphin-10 (CM-10, YPFPGPIPNS, 60–69) from A2-type casein. However, not only is the yield of the active peptide low, but the key enzyme involved in processing has yet to be identified.</p>\n<h2>RESULTS</h2>\n<p>A significant amount of the opioid peptide <sup>60</sup>YPFPGPIPNSLP<sup>71</sup> (CM-12) was produced from the A2-type casein peptide <sup>53</sup>AQTQSLVYPFPGPIPNSLPQNIPPLTQTPV<sup>82</sup> when the active protease in <i>A. oryzae</i> protease extract was fractionated with DEAE-Sepharose. The fractionated enzyme produced CM-12 from bovine A2-type casein but not from bovine A1 casein. A major protein of 34 kDa was purified and identified as an alkaline protease (Alp). Motif prediction of the Alp cleavage site using Multiple EM for Motif Elicitation analysis revealed preferable cleavage at the C-terminal end of Ser–Leu–Xaa for the release of CM-12. A2-type casein hydrolysate by Alp exhibited similar levels of opioid activity to that of synthetic CM-12 in cAMP-Glo assays with μ-opioid receptor-expressing HEK293 cells. These results suggest that CM-12 is a major opioid peptide in the casein hydrolysate.</p>\n<h2>CONCLUSION</h2>\n<p>Our findings showed that Alp fractionated from <i>A. oryzae</i> protease extract produced the opioid peptide CM-12 from A2-type casein as a result of preferential cleavage at the C-terminal end of Ser–Leu–Xaa and the removal of coexisting enzymes. Moreover, docking predictions suggested a stable interaction between CM-12 and the 3D structure of Alp. Casein hydrolysate with Alp-containing CM-12 has the potential for use as a bioactive peptide material with opioid activity. © 2024 Society of Chemical Industry.</p>","author":"Cui Yingjie, \nMoe Fukunaga, \nNobuhiro Hayashi, \nKanami Orihara, \nKazuhiko Miyanaga, \nNaoyuki Yamamoto","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"4f4e712b0c8ed028b7aaea5675f3b701ad9b64b443e34faf936a1923cf9d592d","category":"Environment"}