{"title":"Signal Tests Sharing Public Usernames in Place of Phone Numbers","link":"https://www.macrumors.com/2023/11/09/signal-private-messenger-tests-usernames/","date":1699536322000,"content":"Encrypted messaging app <a href=\"https://signal.org\">Signal</a> has <a href=\"https://community.signalusers.org/t/public-username-testing-staging-environment/56866\">announced</a> it is testing public account usernames so that users don't have to share their phone number to connect through the service.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/signal-logo.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nCurrently, signing up to Signal requires that you share your phone number with other users when connecting with them. While the new method still requires an account to be associated with a number during setup, it is not subsequently shared when contacting other users, making the communication even more private and secure. \r<br />\n\r<br />\nAccording to Signal VP of engineering Jim O'Leary, the username test is currently limited to a separate build in the platform's Staging Environment and remains \"pre-beta,\" so it may cause crashes and other bugs to occur since it fundamentally changes the way that accounts are identified in the Signal ecosystem. \r<br />\n\r<br />\nUsers who install the build will be able to share their usernames via a QR code or a link, allowing them to use it as a way for others to contact them, no phone number required. There is also an option to turn off phone number discovery in the app under Settings ➝ Privacy ➝ Phone number ➝ Who can find my number.\r<br />\n\r<br />\n<div><blockquote><p>Signal is testing username feature. This would mean that you would not have to provide your phone number to people you want to contact. You will be able to set your phone number as private and not share it. <a href=\"https://t.co/OUI2S8dEtp\">pic.twitter.com/OUI2S8dEtp</a></p>— Lukasz Olejnik, Ph.D, LL.M (@lukOlejnik) <a href=\"https://twitter.com/lukOlejnik/status/1722349114304708669?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote> </div>\r<br />\nSignal has been working on usernames since at least 2019, but it is not known when the feature will be ready for primetime. Using the pre-beta build on desktop and iOS today requires some technical knowhow involving code compiling, more information about which can be found in the <a href=\"https://community.signalusers.org/t/public-username-testing-staging-environment/56866\">Signal forums</a>. <div>Tags: <a href=\"https://www.macrumors.com/guide/encryption/\">Encryption</a>, <a href=\"https://www.macrumors.com/guide/signal/\">Signal</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/09/signal-private-messenger-tests-usernames/\">Signal Tests Sharing Public Usernames in Place of Phone Numbers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/signal-tests-sharing-public-usernames-in-place-of-phone-numbers.2410432/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4f50ba3615c1e261c6d4158ceaaadaef6ef294270f6ec97eddf0d03ffe374de1","category":"Apple"}