{"title":"Preparation of Co–Ce@RM catalysts for catalytic ozonation of tetracycline","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11146?af=R","date":1729577338000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/83e3bf23-1a1e-4306-a498-8cab11be71d6/wer11146-toc-0001-m.png\" alt=\"Preparation of Co–Ce@RM catalysts for catalytic ozonation of tetracycline\" />\n<p>Free radical quenching experiments showed that superoxide radicals (O<sub>2</sub>\n<sup>−</sup>·) and singlet oxygen (<sup>1</sup>O<sub>2</sub>) were the main active groups leading to the degradation of tetracycline (TCN). When characterizing the water quality, it was speculated that TCN would undergo degradation pathways such as demethylation, dehydroxylation, double bond cleavage, and ring-opening reactions under the action of various active substances.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>In this work, a Co–Ce@RM ozone catalyst was developed using red mud (RM), a by-product of alumina production, as a support material, and its preparation process, catalytic efficiency, and tetracycline (TCN) degradation mechanism were investigated. A comprehensive assessment was carried out using the 3E (environmental, economic, and energy) model. The optimal production conditions for Co–Ce@RM were as follows: The doping ratio of Co and Ce was 1:3, the calcination temperature was 400°C, and the calcination time was 5 h, achieving a maximum removal rate of 87.91% of TCN. The catalyst was characterized using different analytical techniques. Under the conditions of 0.4 L/min ozone aeration rate, with 9% catalyst loading and solution pH 9, the optimal removal rates and chemical oxygen demand by the Co–Ce catalytic ozonation at RM were 94.17% and 75.27%, respectively. Moreover, free radical quenching experiments showed that superoxide radicals (O<sub>2</sub>\n<sup>−</sup>) and singlet oxygen (1O<sub>2</sub>) were the main active groups responsible for the degradation of TCN. When characterizing the water quality, it was assumed that TCN undergoes degradation pathways such as demethylation, dehydroxylation, double bond cleavage, and ring-opening reactions under the influence of various active substances. Finally, the 3E evaluation model was deployed to evaluate the Co–Ce@RM catalytic ozonation experiment of TCN wastewater.</p>\n<h2>Practitioner Points</h2>\n<p>\nThe preparation of Co–Ce@RM provides new ideas for resource utilization of red mud.\nCatalytic ozonation by Co–Ce@RM can produce <sub>1</sub>O<sup>2</sup> active oxygen groups.\nThe Co–Ce@RM catalyst can maintain a high catalytic activity after 20 cycles.\nThe degradation pathway of the catalytic ozonation of tetracycline was fully analyzed.\nCatalytic ozone oxidation processes were evaluated by the “3E” (environmental, economic, and energy) model.\n</p>","author":"Wenquan Sun, \nYiming Xie, \nMing Zhang, \nJun Zhou, \nYongjun Sun","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"4f50e635c0ece8c4a79278fa0af0df03e01863bd82ec9e6a881102e3b290762b","category":"Environment"}