{"title":"Investigation into pectin extraction and technological implementations in the food industry","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13638?af=R","date":1717836566000,"content":"<h2>Abstract</h2>\n<p>Pectin, a complex polysaccharide found abundantly in the cell walls of fruits and vegetables, plays a pivotal role in various food applications owing to its unique gelling, thickening and stabilizing properties. As consumer preferences lean towards natural and sustainable ingredients, the demand for pectin as a food additive has surged. This burgeoning interest has prompted a comprehensive exploration into both the extraction methods of pectin from its natural sources and its diverse technological applications in the food industry. The extraction process involves breaking down the plant cell wall to release the pectin. Traditional methods such as hot acid extraction have been widely used, but advances in technology have spurred the development of novel techniques like enzyme-assisted extraction and microwave-assisted extraction. These methods aim not only to enhance the yield and purity of extracted pectin but also to minimize environmental impact and energy consumption. Pectin's versatility has positioned it as a valuable ingredient in the food industry. Its ability to form gels under specific conditions makes it a key component in the production of jams, jellies and fruit preserves. Additionally, pectin acts as a stabilizer in dairy products, prevents syneresis in baked goods and improves the texture of confectionery items. The application of pectin goes beyond its role as a gelling agent; it is also employed in the encapsulation of bioactive compounds, enhancing the functional properties of various food products. © 2024 Society of Chemical Industry.</p>","author":"Elsa Cherian, \nKhadeeja TS, \nSaheersha KN, \nAshitha KS, \nNisha G Poothicote","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"4f5207fbcb0415ef69bc5155eb6d13f963bc4440c0abeb1d314dae2cc88c6c86","category":"Environment"}