{"title":"Reproductive ecology of the sand crab (Ovalipes punctatus) population in the Yellow Sea of Korea","link":"https://onlinelibrary.wiley.com/doi/10.1111/ivb.12438?af=R","date":1724742000000,"content":"<h2>Abstract</h2>\n<p>Understanding the reproductive ecology of crustaceans is important for developing appropriate resource management policies. Because the demand for sand crabs (<i>Ovalipes punctatus</i>) as a food resource has recently surged in Korea, their reproductive ecological characteristics should be comprehensively described. In this study, the reproductive ecological characteristics—sex ratio, female gonad maturity, abdominal width (AW), condition factor (<i>K</i>), and gonadosomatic index (<i>GSI</i>)—of individuals of <i>O. punctatus</i> collected from the Yellow Sea in Korea (35°15′00″N, 125°15′00″E) from January to December 2021 were examined. Based on the sex ratio (1:1.61, females:males), we determined that males were more abundant than females. The monthly <i>K</i> for both the males and females reached its maximum in April. The monthly <i>GSI</i> revealed that the males were most numerous in December, whereas the females were most abundant in May. The <i>GSI</i> graph indicates that the main spawning season of <i>O. punctatus</i> is from May to July. The AW and <i>GSI</i> of the females increased as their gonads matured; based on this correlation, the maturity of female individuals can be determined by examining the abdominal flap morphology. The results of histological analysis indicated that females of <i>O. punctatus</i> exhibit synchronous development, by which oocytes develop simultaneously. Furthermore, the size at maturity, at which more than half of the individuals participated in spawning, was 75.6 mm. The findings of this study contribute to the development of policies for the sustainable fisheries of <i>O. punctatus</i>.</p>","author":"Hyeon Gyu Lee, \nJae Mook Jeong, \nYoun Hee Choi","siteTitle":"Wiley: Invertebrate Biology: Table of Contents","siteHash":"288dc5c0698e157be6008116ed4a15ccbcde55ff21b19d813cd3a3ab63550757","entryHash":"4f5860527c5bc58f99b09b97f395d35a7dcb3ef215dfae9a4845c04c81518bf4","category":"Environment"}