{"title":"Apolipoprotein E Gene Variation in Pakistani Type 2 Diabetic Subjects with and without Cardiovascular Complications","link":"https://www.preprints.org/manuscript/202404.0029/v1","date":1711960015000,"content":"Background Apolipoprotein E (APOE) gene polymorphism has been implicated in the pathogenesis of various metabolic disorders, including type 2 diabetes mellitus (T2DM). Type 2 diabetes mellitus (T2DM) is a major public health concern worldwide, including in Pakistan. Cardiovascular problems linked with T2DM have a significant impact on people and society. The study's goal is to investigate the relationship between Apolipoprotein E (ApoE) genotypes, lipid profiles, and cardiovascular complications such as ischemic heart disease (IHD) and stroke.\nMethods: This study was carried out on 260 subjects, divided into control D1: Diabetics without cardiovascular issues. D2: Diabetics with heart disease. D3: Diabetics with stroke. D4: Diabetics with both heart disease and stroke. Anthropometric parameters (age, BMI) and risk factors (smoking, diabetes duration, hypertension) were assessed in all groups. Serum levels of TC, TG, LDL, HDL, VLDL, creatinine, BSF, and HbA1c were measured. Apolipoprotein E gene polymorphism was determined using PCR-RFLP.\nResults: Hypertension, BMI, and dyslipidemia, defined as elevated levels of total cholesterol, triglycerides, LDL, HDL, and VLDL, as well as uncontrolled hyperglycemia (elevated fasting blood sugar and glycated hemoglobin) in T2DM, were linked to vascular complications such as IHD and stroke. Hypertension was prevalent in 75.4% of the population, with greater rates among the elderly. Stage 2 hypertension was more prevalent in all age groups. Apolipoprotein E gene polymorphism was discovered, with genotypes 3/3, 4/4, 2/3, and 3/4 being the most prevalent. Genotype 3/4 was more common in diabetics who had IHD/stroke or both problems, whereas genotype 2/3 was linked to DM and stroke.\nConclusion: It is concluded that BMI, hypertension, hyperglycemia, atherosclerosis, and dyslipidemia are linked with cardiovascular complications of type 2 diabetes. Apolipoprotein E gene polymorphism is associated with cardiovascular disease in diabetic patients by affecting the lipid profile.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4f5b437790521ad0d8b0f0200cf3e600252b4e697da2348362515920ef1da5dc","category":"Interdisciplinary"}