{"title":"Introducing channel assignment history and rollback for HCP Packer","link":"https://www.hashicorp.com/blog/introducing-channel-assignment-history-and-rollback-for-hcp-packer","date":1678723200000,"content":"<p>HCP Packer, a powerful tool for creating and tracking image artifacts across multi-cloud environments, has just released two new features: <em>channel assignment history</em> and <em>channel rollback</em>. These additions provide further visibility into <a href=\"https://developer.hashicorp.com/packer/tutorials/hcp-get-started/hcp-image-channels\">image channels</a> and enable a simple, one-click remediation workflow. This post will cover some challenges of artifact management and explain how HCP Packer’s new features aim to solve them. </p>\n\n<h2>Artifact management challenges</h2>\n\n<p>For HCP Packer users to successfully implement a <a href=\"https://developer.hashicorp.com/packer/tutorials/cloud-production/golden-image-with-hcp-packer\">golden image pipeline</a>, they need to have visibility into all artifacts created. Currently, visibility into the lifecycle of iterations ends when they are removed from a channel. Administrators can’t see which artifacts have been made available to downstream consumers and when. </p>\n\n<p>This lack of visibility makes it difficult to track the assignment history of iterations and roll back a channel without custom tooling. When a user tries to revoke an iteration currently assigned to one or more channels, it results in an error. This makes channel rollback a multi-step process prone to human error and often requires platform teams to update multiple channels before remediation can occur. </p>\n\n<p>Our latest features, channel assignment history and rollback, provide a complete record of artifact activity in a channel and a simple workflow for remediation.</p>\n\n<h2>Channel assignment history</h2>\n\n<p>Users can now browse any existing bucket and select a channel to see exactly which iterations have been made available to downstream consumers. For plus-tier subscribers, the complete history of channel iterations is tracked and saved for a full year. Users can click through to view each channel's history and extended metadata. This allows platform teams to see when a specific iteration was assigned and by whom.</p>\n<img src=\"https://www.datocms-assets.com/2885/1678491803-hcpp-channel-history.png\" alt=\"Channel\" /><h2>Channel rollback</h2>\n\n<p>Channel rollback builds on the availability of channel assignment history and aims to provide quicker remediation of released artifacts. Users can now automatically roll back channels to the previously assigned iteration when revoking a currently assigned iteration.</p>\n<img src=\"https://www.datocms-assets.com/2885/1678491808-hcpp-channel-rollback.png\" alt=\"Channel\" /><h2>Benefits</h2>\n\n<p><strong>Greater visibility into artifacts:</strong> Users can now see when images were made available to downstream consumers and the user that assigned them. They can also easily view the status of parent images to ensure they are up to date. Visibility into the extended metadata for each channel assignment helps users ensure their internal compliance requirements are met. Access to channel assignment history provides a more complete view of image lifecycles throughout their artifact estate. </p>\n\n<p><strong>Efficient remediation workflows:</strong> Channel rollback provides a simpler remediation process with one-click access to assign a previous iteration. This approach requires less custom code to automate reliable rollback. This workflow is especially useful when revoking a currently published iteration and it allows organizations to reduce their time to remediation during a security incident.</p>\n\n<h2>Summary and resources</h2>\n\n<p>Channel assignment history and rollback build on HCP Packer’s current capabilities to increase visibility into users' artifact estate and simplify remediation workflows.</p>\n\n<p>To learn more about channel assignment history and rollback, check out the <a href=\"https://developer.hashicorp.com/hcp/docs/packer/manage-image-use/image-channels\">image channels</a> and <a href=\"https://developer.hashicorp.com/hcp/docs/packer/manage-image-use/revoke-images\">revocation</a> documentation, <a href=\"https://developer.hashicorp.com/packer/tutorials/hcp-get-started/hcp-immediately-revoke-image-iterations\">image revocation tutorial</a>, and <a href=\"https://www.youtube.com/watch?v=wUdf34kCdv4\">demo video</a>:</p>\n<p>Get started with <a href=\"https://www.hashicorp.com/products/packer\">HCP Packer</a> for free to track and manage artifacts across all your cloud environments.</p>\n","author":"Mitchell Ross","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"4f5c90eaa7d374a563ddd071734062f286d4f26623780cd679e89b4469846249","category":"Tech"}