{"title":"เจ้าของไอเดีย Metaverse คือผู้บริหาร Oculus และอดีตผู้สร้างเกม Crash Bandicoot","link":"https://www.blognone.com/node/125600","date":1635771101000,"content":"<div><div><div><p>สำนักข่าว CNBC เปิดเผยที่มาของแนวคิด Metaverse ว่ามาจาก Jason Rubin ผู้บริหารของ Oculus เขียนเอกสารภายในชื่อ \"The Metaverse\" เป็นสไลด์ความยาว 50 หน้าเมื่อปี 2018 กระตุ้นให้บอร์ดบริหารของ Facebook ต้องคิดเรื่องนี้อย่างจริงจัง</p>\n<p>Jason Rubin เป็นผู้ร่วมก่อตั้งสตูดิโอ Naughty Dog ในปี 1986 และโด่งดังในฐานะผู้สร้างเกม Crash Bandicoot เขาลาออกจาก Naughty Dog ในปี 2004 แล้วไปทำงานกับ THQ เป็นเวลาสั้นๆ ก่อนมาร่วมงานกับ Oculus ในปี 2014 จนถึงปัจจุบัน (ตำแหน่งปัจจุบันคือ VP Metaverse Content)</p>\n<p>วิสัยทัศน์ของ Rubin วาดภาพ metaverse ออกมาเป็นการใช้ชีวิตในเมืองเสมือนจริง แต่งตัวอวตารของตัวเองได้ มีสกุลเงินเสมือน และเมื่อเจอกับคนอื่นที่น่าสนใจก็สามารถแต่งงานกันได้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/5fd62767ee898f26c1a3f8830c0446e4.jpg\" /></p>\n<p>ภาพจาก <a href=\"https://twitter.com/Jason_Rubin/status/1436018247531307056\">@Jason_Rubin</a></p>\n<p>เอกสารฉบับนี้บอกให้ Facebook \"ไปไกลกว่า VR\" เพราะตลาดมีจำกัด (เมื่อปี 2018 Oculus มีผู้ใช้งาน 250,000 คนต่อเดือน) จึงต้องหาวิธีสร้าง metaverse ที่เข้าถึงคนจำนวนมากๆ ให้ได้ ซึ่งไม่มีวิธีอื่นนอกจากการทุ่มกำลังครั้งใหญ่ (massive launch) ให้เข้าถึงคนเหล่านี้</p>\n<p>Rubin ยังเสนอให้ Facebook หาพาร์ทเนอร์เพื่อช่วยผลักดัน metaverse ไปด้วยกัน จะได้เร็วกว่าการทำเองลำพัง เขายังพยากรณ์เอาไว้ว่า metaverse จะมีอันเดียวเท่านั้น คนที่ทำสำเร็จก่อนคือผู้ชนะคนสุดท้าย หากปล่อยโอกาสทิ้งไว้ก็จะไม่สามารถเอาชนะในตลาดนี้ได้อีกเลย คู่แข่งที่เขาระบุชื่อในเอกสารคือ Google, Apple, Sony, HTC และ Valve</p>\n<p>Rubin ให้สัมภาษณ์กับ CNBC ยืนยันว่าเอกสารนี้เป็นของจริง แต่ก็ออกตัวว่าไม่ได้มีแต่บันทึกของเขาฉบับเดียว ยังมีการผลักดันของคนอื่นๆ อีกมาก</p>\n<p>ที่มา - <a href=\"https://www.cnbc.com/2021/10/30/facebooks-meta-mission-was-laid-out-in-a-2018-paper-on-the-metaverse.html\">CNBC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/crash-bandicoot\">Crash Bandicoot</a></div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/naughty-dog\">Naughty Dog</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/virtual-reality\">Virtual Reality</a></div><div><a href=\"/topics/facebook\">Facebook</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4f712492fc9528839f11d873ab82cf758b379d6c9b352137d87860571e1f9a85","category":"Thai"}