{"title":"The spatiotemporal properties of artificial feeding schemes influence the post-fledging movement of Egyptian Vultures","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duae010/7754278?rss=1","date":1711497600000,"content":"<span><div>Abstract</div>Many vulture populations have severely declined in the past decades, showing high juvenile mortality. To support these populations, feeding stations are used to increase food availability and to supply food without antibiotics and toxic compounds. Yet, supplying food at feeding stations may affect vulture behavior. We present a large-scale field experiment testing how different food provision schemes affected the movement of Egyptian Vultures (<span>Neophron percnopterus</span>). We used GPS transmitters harnessed to 18 vulture chicks and described their movements post-fledging. We categorized the vultures into 3 groups according to the feeding scheme used at feeding stations near their nests: frequent and spatially dispersed food supply (FD); non-frequent and spatially dispersed food supply (NFD); and frequent food supply, concentrated in one location (FC). We found that birds from all three groups increased their roosting distances from the nest with fledgling age, with the NFD and FC groups showing a greater increase than the FD group. Additionally, all 3 groups increased their daily flight distances, with the NFD group presenting the largest increase and the FD group presenting the smallest increase. Our findings offer new insights into the relevance of spatiotemporal differences in the management of feeding stations and show its effect on movement during birds’ early life stages, creating 2 main movement patterns: local and regional. Our findings can help decide upon the preferable feeding scheme in a way that will either encourage or reduce the early dispersal distances of fledglings, according to long- and short-term conservation objectives. For example, local movements during the post fledging period to known and stable food resources may reduce the risk of anthropogenic-induced mortality, while it may negatively affect long-term survival by hindering foraging, flight, and exploring skills and affect dispersion to future breeding sites.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"4f74f8e655fab70d4faf385be4fa0fe65c2594f413817209db879381237c99e1","category":"Environment"}