{"title":"Cephalometric Evaluation of Facial Height Ratio and Growth Patterns: A Retrospective Cohort Study","link":"https://www.preprints.org/manuscript/202409.1465/v1","date":1726716972000,"content":"(1) Background: This retrospective cohort study aimed to investigate the cephalometric evaluation of facial height ratio (FHR) and growth patterns. (2) Methods: We assessed facial height ratios, Y-axis to SN angle, and growth patterns in 94 participants from Timis county using digital cephalograms. Participants were categorized based on Angle’s classification. Cephalograms were digitally traced and analyzed using WebCeph imaging software. Statistical analysis was conducted using Python version 3.11.9. (3) Results: Significant correlations were observed between FHR and craniofacial development, particularly regarding hypodivergent growth patterns. In a sample of 94, molar classes showed varying patterns: Class I—33.3% hyperdivergent, 61.5% normodivergent, 33.3% hypodivergent. Class II—50% hyperdivergent, 30.8% normodivergent, 52% hypodivergent. Class III—16.7% hyperdivergent, 7.7% normodivergent, 14.7% hypodivergent. Y-axis to SN angle values were within normal limits across groups (Group I: 65.0 (IQR: 61.2-69.0), Group II: 65.0 (IQR: 62.0-69.0), Group III: 67.0 (IQR: 59.7- 69.0). A strong negative correlation was found between Y-axis to SN angle and Jarabak’s ratio (r = -0.72, p &amp;lt; 0.001), highlighting the need for holistic assessment methods in orthodontic practice. (4) Conclusion: Patients from Timis county predominantly exhibit a hypodivergent growth pattern across all malocclusion types. Understanding these patterns is essential for comprehensive orthodontic treatment planning. Further research is needed to explore the implications of these findings on treatment outcomes and patient care.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4f794a230494565b24a2c1178fb0e87257b5034b45f95fa5aff68400bbf2c817","category":"Interdisciplinary"}