{"title":"Autoworker strike could give GM breathing room to fix battery production","link":"https://arstechnica.com/?p=1969136","date":1695067323000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/2022-GMC-HUMMER-EV-Ultium-054-inside-ultium-800x448.jpg\" alt=\"A naked GM Ultium rolling chassis\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/2022-GMC-HUMMER-EV-Ultium-054-inside-ultium.jpg\">Enlarge</a> <span>/</span> The Ultium platform is the foundation of GM’s EV strategy, including the battery cells, modules and pack, plus drive units containing electric motors and integrated power electronics. It underpins GM’s EV architecture and was developed with a common set of components, providing energy for nearly every segment on the road. At least that's if it can ramp up production. (credit: General Motors)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Last Thursday, the United Auto Workers <a href=\"https://arstechnica.com/cars/2023/09/thousands-of-workers-go-on-strike-at-ford-gm-and-stellantis-plants/\">went on strike at a trio of factories</a> owned by Ford, General Motors, and Stellantis. Negotiations to replace an expiring contract reached a stalemate, leading to thousands of UAW members stopping work in Michigan, Missouri, and Ohio. The strike has been targeted to disrupt profitable production lines like Ford's Bronco, but there might be a silver lining to the strike for General Motors.</p>\n<p>That curious idea appeared over the weekend <a href=\"https://www.reuters.com/business/autos-transportation/gm-add-battery-module-assembly-some-north-american-ev-plants-2023-07-25/\">in Reuters</a>. You see, GM has been having somewhat of a production problem. The automaker has publicly committed to going all-in on electrification, developing a new battery platform to be shared across Brightdrop, Buick, Cadillac, Chevrolet, and GMC.</p>\n<h2>An Ultium-shaped headache</h2>\n<p>Known as Ultium, the new batteries are meant to be far cheaper to produce than the batteries that power the Chevy Bolt; <a href=\"https://arstechnica.com/cars/2020/03/general-motors-announces-new-battery-platform-claims-100kwh-soon/\">when Ultium was first announced</a>, CEO Mary Barra said that costs would drop below $100/kWh \"early in the platform's life.\"</p></div><p><a href=\"https://arstechnica.com/?p=1969136#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1969136&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4f7c48ccc30b346add505f1247c429061506b99f5324de5ed514c3c420ea8e96","category":"Tech"}