{"title":"ABCA3 c.838C&amp;gt;T (p.Arg280Cys, R280C) and c.697C&amp;gt;T (p.Gln233Ter, Q233X, Q233*) as Causative Variants for RDS: a Review of the Literature and Family Case Study","link":"https://www.preprints.org/manuscript/202408.1302/v1","date":1724150461000,"content":"Background. Respiratory distress syndrome (RDS) is the primary cause of respiratory failure in preterm infants, but it also affects 5-7% of term infants. Dysfunctions in pulmonary surfactant metabolism, resulting from mutations of the lung surfactant genes, are rare diseases, ranging from fatal neonatal RDS to interstitial lung disease, associated with increased morbidity and mortality. This study aims to clarify the clinical significance of ABCA3 variants found in a specific family case, as existing data in the literature is inconsistent. Material and methods: A family case report was conducted; targeted panel genetic testing identified a variant of the SFTPB gene and two variants of ABCA3 genes. Comprehensive research involving a systematic review of PubMed, Google Scholar databases, and genome browsers was used to clarify the pathogenicity of the two ABCA3 variants found in the index patient. Advanced prediction tools were employed to assess the pathogenicity of the two ABCA3 variants, ensuring the validity and reliability of our findings. Results: The index case exhibited fatal neonatal RDS. Genetic testing revealed the presence of the SFTPB p.Val267Ile variant, not previously reported, a benign variant based on family genetic testing and history. Additionally, two ABCA3 gene variants were identified: c.697C&amp;gt;T, not yet reported, and c.838C&amp;gt;T. These variants were found to affect ABCA3 protein function and were likely associated with neonatal RDS. Prediction tools and data from nine other cases in the literature supported this conclusion. Conclusions: Based on in silico predictors, analysis of the presented family, and cases described in the literature, it is reasonable to consider reclassifying the two ABCA3 variants identified in the index case as pathogenic/pathogenic. Reclassification will improve genetic counseling accuracy and facilitate correct diagnosis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4f883d1c16f312a99412affbf56c8b4897f84ffb626dba837314beef0bc8c077","category":"Interdisciplinary"}