{"title":"Tailoring the characteristics of polyacrylonitrile nanofiltration membranes for nickel removal from wastewater: The influence of binary solvents and pore‐forming agents","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11126?af=R","date":1726561333000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1d8a12c1-66fa-4b22-9df0-3f83e5a9d240/wer11126-toc-0001-m.png\" alt=\"Tailoring the characteristics of polyacrylonitrile nanofiltration membranes for nickel removal from wastewater: The influence of binary solvents and pore-forming agents\" />\n<p>Polyacrylonitrile (PAN) nanofiltration (NF) membranes prepared using a binary solvent are investigated. The aim to optimize dope formulation, membrane performance, and durability for efficient nickel (Ni) removal from wastewater streams.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This work presents the results of an investigation on the physiochemical and structural characteristics of polyacrylonitrile (PAN) nanofiltration (NF) membranes prepared using a novel concept of binary solvents for nickel (Ni) removal from wastewater streams. The thermodynamic and kinetic aspects are emphasized aiming to optimize dope formulation, membrane performance, and durability. The fabricated membranes were characterized by scanning electron microscopy (SEM), porosimetry, tensile stress/strain, and flux and rejection. Results revealed that the use of an equal (1:1) mixture of n-methyl-2-pyrrolidone (NMP) and dimethylformamide (DMF) as dope solvents led to the formation of membranes with enhanced performance, offering pure water flux of 2.33 L·m<sup>−2</sup>·h<sup>−1</sup>·bar<sup>−1</sup> and Ni rejection of 90.84%. Moreover, the incorporation of 0.5 wt.% PEG as a pore-forming agent to the dope solution further boosted pure water flux to 4.97 L·m<sup>−2</sup>·h<sup>−1</sup>·bar<sup>−1</sup> with negligible impact on Ni rejection. Besides attractive performance, the adopted strategy offered membranes of exceptionally high flexibility with no sign of defect or failure especially during module fabrication and testing enabling smooth and hassle-free scale-up and extension to other applications.</p>\n<h2>Practitioner Points</h2>\n<p>\nOptimized solvent mixture: A 1:1 blend of n-methyl-2-pyrrolidone (NMP) and dimethylformamide (DMF) as solvents resulted in enhanced membrane performance.\nHigh flux and Ni rejection: The fabricated membranes exhibited a pure water flux of 2.33 L·m<sup>−2</sup>·h<sup>−1</sup>·bar<sup>−1</sup> and a remarkable Ni rejection of 90.84%.\nPEG enhancement: Incorporating 0.5 wt.% PEG as a pore-forming agent further improved the membrane's pure water flux to 4.97 L·m<sup>−2</sup>·h<sup>−1</sup>·bar<sup>−1</sup>, without compromising Ni rejection.\nExceptional flexibility: The adopted strategy yielded membranes with exceptional flexibility, making them suitable for scale-ups and other applications.\n</p>","author":"Mehrdad Ghahghaei, \nAlex Tawanda Kuvarega, \nSeyed Saeid Hosseini","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"4f8e8e3216ad1e48ee16125bae124d4f565cee3e17ffd1901a8fe9c5fe6f5e88","category":"Environment"}