{"title":"Adults’ spatial scaling of tactile maps: Insights from studying sighted, early and late blind individuals","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304008","date":1717077600000,"content":"<p>by Magdalena Szubielska, Marta Szewczyk, Paweł Augustynowicz, Wojciech Kędziora, Wenke Möhring</p>\r\n\r\nThe current study investigated spatial scaling of tactile maps among blind adults and blindfolded sighted controls. We were specifically interested in identifying spatial scaling strategies as well as effects of different scaling directions (up versus down) on participants’ performance. To this aim, we asked late blind participants (with visual memory, Experiment 1) and early blind participants (without visual memory, Experiment 2) as well as sighted blindfolded controls to encode a map including a target and to place a response disc at the same spot on an empty, constant-sized referent space. Maps had five different sizes resulting in five scaling factors (1:3, 1:2, 1:1, 2:1, 3:1), allowing to investigate different scaling directions (up and down) in a single, comprehensive design. Accuracy and speed of learning about the target location as well as responding served as dependent variables. We hypothesized that participants who can use visual mental representations (i.e., late blind and blindfolded sighted participants) may adopt mental transformation scaling strategies. However, our results did not support this hypothesis. At the same time, we predicted the usage of relative distance scaling strategies in early blind participants, which was supported by our findings. Moreover, our results suggested that tactile maps can be scaled as accurately and even faster by blind participants than by sighted participants. Furthermore, irrespective of the visual status, participants of each visual status group gravitated their responses towards the center of the space. Overall, it seems that a lack of visual imagery does not impair early blind adults’ spatial scaling ability but causes them to use a different strategy than sighted and late blind individuals.","author":"Magdalena Szubielska","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4f8f08557f7aaf1d6d13a16327b274b0b422613508da87441efe94cbf4332084","category":"Interdisciplinary"}