{"title":"Molecular Characterization of Immunoglobulin M (IgM) and Polymeric Immunoglobulin Receptor (pIgR) and Expression Response to Vibrio harveyi Challenge in Leopard Coral Grouper (Plectropomus leopardus)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/8883767?af=R","date":1684825200000,"content":"<p>Immunoglobulin M (IgM) is the primary antibody in fish, which is transported from epithelial cells into the external secretion system by polymeric immunoglobulin receptor (pIgR). In this study, the full length of IgM and pIgR complementary DNA sequences from leopard coral grouper (<i>Plectropomus leopardus</i>) was characterized, and their expression levels under <i>Vibrio harveyi</i> infection were studied. cDNA sequence analysis showed that the pl-IgM heavy chain cDNA contained an open reading frame (ORF) of 1797 bp encoding a polypeptide of 597 amino acids consisting of a signal peptide, a variable region, and 4 constant regions. pl-pIgR (1041 bp) encodes 346 amino acids with 2 Ig-like domains (ILDs). The expression levels of pl-IgM and pl-pIgR in healthy fish were mainly in the intestine and spleen of fish, which indicates the relationship between the mucosal-associated lymphoid tissue and system lymphoid tissue. Messenger RNA (mRNA) expression profiles of pl-IgM and pl-pIgR were significantly increased in the intestine, head kidney, spleen, and liver after <i>V. harveyi</i> infection. The cDNA sequences of two ILDs were cloned and expressed in <i>Escherichia coli</i> BL21 (DE3). The recombinant pl-pIgR protein had antibacterial function against <i>V. harveyi</i> and <i>Vibrio alginolyticus</i> at 200 ng/<i>μ</i>l. Our results indicate that pl-IgM and pl-pIgR are involved in the mucosal-associated immune and systemic immune response in the antibacterial immunity of leopard coral grouper.</p>","author":"Lei Wang, \nYang Liu, \nZiwei Zhang, \nKaimin Li, \nQian Zhou, \nTianshi Zhang, \nYou Liang, \nChunhua Zhu, \nSonglin Chen, \nMahmoud Dawood","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"4f964ab7ee79c04baca6e1e94b6320ef22c627960a62dc66e7b6ff87d84c81b4","category":"Environment"}