{"title":"Exploring the Efficacy of Aluminum Foam as an Innovative Solution to Mitigate Surface Faulting Effects on Shallow Foundations: A Numerical Investigation","link":"http://link.springer.com/10.1007/s10706-023-02686-0","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>In earthquakes, foundations of structures may encounter damages due to faulting. To address this issue, numerous innovative mitigation methods have been introduced. Among these, an efficient solution involves constructing a trench wall filled with a material capable of not only absorbing the faulting energy but also diverting the propagation route of fault rupture. In this research, a novel material called closed-cell aluminum foam (CCAF) is introduced to be implemented within the trench wall considering its noticeable energy absorbing and flexibility. To evaluate the performance of the trench wall filled with CCAF [or Aluminum Foam Wall (AFW)] under fault rupture conditions, ABAQUS, a Finite Element Method software, is employed for numerical analyses and the obtained results are validated against centrifuge experimental data for both free field and shallow foundation’s presence conditions. Based on the findings, the application of AFW resulted in a substantial reduction in the rotation degree of the shallow foundation. In one case, it experienced a significant decrease from 11.64° to a mere 0.48°. Furthermore, when compared to alternative mitigation methods such as Smart Wall Barrier (SWB) or Soil Bentonite Wall (SBW), AFW exhibited superior performance under identical conditions. In similar conditions, AFW achieved a remarkable rotation degree of 0.06°, while SWB and SBW registered rotation degrees of 0.4° and 0.2°, respectively. The obtained results indicate that AFW demonstrates a promising ability to efficiently absorb faulting energy and divert the propagation of fault rupture.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"4f99de97cb929c0e697a688172750f03624414b5f0383caf29aab0e767062a44","category":"Environment"}