{"title":"Cyclist's 31 Inspirational Women No2: Shanaze Reade","link":"https://www.cyclist.co.uk/sponsored/9284/cyclists-31-inspirational-women-no2-shanaze-reade","date":1614606602000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/maria-david\">Maria David</a></span>\n      <span class=\"field-item odd\"><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-03-02T14:20:00+00:00\">2 Mar 2021</span></div>    </div></div><p class=\"short-teaser\">\nReade is a five-time BMX world champion, track world champion and double Olympian</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/03/shanaze_reade-offside.jpg?itok=wxFK75Lw\" />  </div>\n<div class=\"field field-name-body\">\n      <p> <a href=\"https://www.cyclist.co.uk/tags/zwift-womens-history-month\"><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/02/31_inspirational_women_clickable_logo_new.jpg\" alt=\"Cyclist's 31 Inspirational Women\" border=\"0\" /></a></p>\n<p><strong>To celebrate International Women's Month, we have partnered with Zwift to tell the stories of 31 inspirational women across 31 days.</strong></p>\n<p><strong>Words: </strong>Maria David <strong> </strong></p>\n<p>Crewe-born Shanaze Reade shot to prominence in 2007 by winning the UCI BMX World Championship and partnering Victoria Pendleton to the Team Sprint title at the Track World Championhips in what was only her second track race ever.</p>\n<p>After successfully defending her BMX title the next year, she went to the Beijing Olympics as the favourite to add Olympic gold to her growing medal count. But it was not to be: she crashed on the final berm while chasing down the eventual winner, Anne-Caroline Chausson, in the final.</p>\n<p>Shanaze recalls the disappointment well: ‘It was very disappointing to come away with nothing,’ she says, ‘but I don’t regret taking the risks I did as you want to win at all costs.’</p>\n<p>Further world titles would duly follow in 2011 and 2012, but Shanaze would finish a disappointing sixth at the London 2012 Olympics, and admits it was a challenge to overcome the subsequent low period in her life.</p>\n<blockquote><p>Everyone in life goes through highs and lows and I guess it’s all about how you come out of those difficulties</p></blockquote>\n<p>‘I got into BMX biking when my uncle took me to the local track with his children,’ Shanaze explains. ‘The coach, a Jamaican guy called Bob who took rubbish from no one, encouraged us all.</p>\n<p>‘As kids in Crewe this was a big deal as many people there worked in a factory or were on benefits. I was especially encouraged, being the only female there. I always felt welcomed and didn’t see any barriers.</p>\n<p>‘BMX-ing was 20 years of my life. It has brought me a lot of success, but some definite lows as well. After the 2012 Olympics I was so down that I didn’t get out of bed for two months and I put on a lot of weight. I really struggled with my mental health and turned to drink.</p>\n<p>‘I realised it was a reaction to the expectations that had been put on me. I didn’t just want to be Shanaze the BMX World Champion; I wanted to show that there’s more to me than just that.</p>\n<p>Since those days Shanaze has carved a new image for herself and says she feels far more content with life.</p>\n<p>‘Everyone in life goes through highs and lows and I guess it’s all about how you come out of those difficulties. For me it’s all about mindset and exercise. It’s about being honest and open and allowing yourself to be vulnerable.</p>\n<p>‘I’m now a fitness coach and ambassador for Fabletics, PhD Nutrition, the BikeisBest campaign, as well as working with Insynch Bikes.</p>\n<p>‘It’s been really good for me to be a part of this because it’s not about elite performance but cycling in general and it aligns with my morals and values about getting more people on bikes and being more active.</p>\n<p>‘These days I use time on my bike to look after the cardio side of things. I go out on my road bike regularly – here’s a bypass on a beautiful stretch of road about 30 or 40km long, and I just do 30km out and 30km back. I also ride my mountain bike regularly and put my podcast on too.</p>\n<p>‘For me, any form of exercise is like meditation but when you go out on your bike, you’re at one with nature and your mind quietens. It’s really good thinking time, so I don’t do anything that’s extreme or competitive or anything like that. I kind of just use it as “me time”.</p>\n<div class=\"field field-name-field-see-related field-type-node-reference field-label-above\">      <div class=\"field-label\">See related&nbsp;</div>\n  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/in-depth/8831/tadej-pogacar-the-man-who-would-be-king\">Tadej Pogacar: The man who would be king</a></div>      <div class=\"field-item odd\"><a href=\"/news/6834/how-much-did-tadej-pogacar-earn-for-winning-the-tour-de-france-and-how-does-that-compare\">How much did Tadej Pogacar earn for winning the Tour de France and how does that compare to other sports?</a></div>      <div class=\"field-item even\"><a href=\"/news/9283/adidas-launches-spd-version-of-samba-trainers\">Adidas launches SPD version of Samba trainers</a></div>      <div class=\"field-item odd\"><a href=\"/news/2252/all-you-need-to-know-about-the-classics-monuments-cobbles\">Cycling Spring Classics 2021: Race dates, Monuments, cobbles and live TV guide</a></div>      <div class=\"field-item even\"><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 111: on sale now!</a></div>    </div></div><p>\n‘I want my whole life centred around what I believe in and what I am passionate about. I don’t want to sell myself short by doing something that I’m not passionate about, just because it pays the bills.</p>\n<p>‘I feel extremely grateful and fortunate that I am able to live a full, rich life, doing the things that I love, and there is no better place to be.’</p>\n<p>For more from Zwift this International Women's Month, <a href=\"https://www.zwift.com/\" target=\"_blank\">visit here</a>. </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/cyclists\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Cyclists</a></div>    </div></div>","author":"mjames","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"4fa302b886b9ecbb2247a5417a6395d1cab0c67308416d64bdf5de543dafaa0d","category":"Cycling"}