{"title":"295 Development of a model to predict forage intake and growth of nursing beef calves","link":"https://academic.oup.com/jas/article/102/Supplement_2/217/7665055?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Models to predict intake and growth of preweaning calves have received less attention than postweaning calves. The objective was to develop a model to predict forage intake and growth of nursing beef calves. Data on milk intake, forage intake, and body weight (BW) of 51 Hereford calves from birth to 200 d of age were acquired from Boggs (1977). Milk and forage intake equations were those evaluated by Lancaster et. al. (2021; 10.1093/jas/skaa406). Forage digestibility was evaluated with a dataset on in vitro and in vivo measurements. Milk energy concentration was evaluated with a dataset on milk yield and composition. NASEM growth equation was evaluated using the dataset of Hildebrand et al. (2022; 10.1093/jas/skac064.321). Model precision and accuracy were evaluated using the concordance correlation coefficient (CCC) and mean bias (MB). The NASEM and WOOD milk yield equations predicted milk intake reasonably well (CCC = 0.796 and 0.820; MB = 4.29% and 1.31%, respectively); the WOOD equation was used in subsequent analyses. Forage intake prediction was imprecise (CCC = 0.348 to 0.613) and inaccurate (MB = 19.36 to 57.67%). Body weight prediction was moderately precise (CCC = 0.574 to 0.766) and moderately accurate (MB = 6.39 to 15.79%). With observed BW, forage intake prediction was moderately precise (CCC = 0.528 to 0.834) and highly to poorly accurate (MB = 0.81 to 27.56%). With observed forage intake, BW prediction by the NASEM growth equation resulted in CCC of 0.821 and MB of 9.69%. Published equations relating IVDMD to in vivo OMD were imprecise (CCC = 0.437 to 0.520) and moderately to highly accurate (MB = -9.46 to 7.67%). A new equation was developed: OMD, % = 7.7719 ± 4.3825 + 0.8937 ± 0.0772*IVDMD, % with RMSE = 2.803% and R<sup>2</sup> = 0.9055. Milk energy concentration changed with days in milk (DIM; <span>P</span> &lt; 0.05) and milk yield (<span>P</span> &lt; 0.05): Energy, Mcal/kg = 0.7525 ± 0.0037 + 0.00069 ± 0.00016*DIM -0.00012 ± 0.00003*DIM*Yield, kg/d with RMSE = 0.031 and R<sup>2</sup> = 0.527. Evaluating the NASEM growth equation in beef cattle resulted in CCC of 0.777 and MB of -13.56%. A new equation was developed: EBG, kg/d = 7.9279 ± 0.8254*(RE, Mcal/d/EBW, kg<sup>0.75</sup>) ^0.7083 ± 0.0385 with RMSE = 0.1127 and R<sup>2</sup> = 0.6940. With observed forage intake, BW prediction with new equations resulted in CCC of 0.901 with MB of 1.58%. With the new equations, forage intake prediction by TED06, BAK76, TED09A, TED09B, and HOL82 resulted in CCC of 0.822, 0.700, 0.434, 0.686, and 0.380 with MB of -7.01, -5.08, 36.87, 13.24, and 10.96%, respectively. Body weight prediction resulted in CCC of 0.935, 0.938, 0.896, 0.926, and 0.886 with MB of -7.34, -6.21, -0.09, -5.35, and -9.41%. In conclusion, prediction of forage intake and BW in nursing beef calves were hindered by use of IVDMD, constant milk energy concentration, and the NASEM growth equation.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4faada5a44544b076e2b983127a9e3964d87d254cb3e2b92a7a7f4e848d2c224","category":"Environment"}