{"title":"Eco-alternative treatments for <i>Vibrio parahaemolyticus</i> and <i>V</i>. <i>cholerae</i> biofilms from shrimp industry through Eucalyptus (<i>Eucalyptus globulus</i>) and Guava (<i>Psidium guajava</i>) extracts: A road for an Ecuadorian sustainable economy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304126","date":1723557600000,"content":"<p>by Nicolás Renato Jara-Medina, Dario Fernando Cueva, Ariana Cecibel Cedeño-Pinargote, Arleth Gualle, Daniel Aguilera-Pesantes, Miguel Ángel Méndez, Lourdes Orejuela-Escobar, Diego F. Cisneros-Heredia, Rebeca Cortez-Zambrano, Nelson Miranda-Moyano, Eduardo Tejera, António Machado</p>\r\n\r\nUnderstanding how environmental variables influence biofilm formation becomes relevant for managing <i>Vibrio</i> biofilm-related infections in shrimp production. Therefore, we evaluated the impact of temperature, time, and initial inoculum in the biofilm development of these two <i>Vibrio</i> species using a multifactorial experimental design. Planktonic growth inhibition and inhibition/eradication of <i>Vibrio</i> biofilms, more exactly <i>V</i>. <i>parahaemolyticus</i> (VP87 and VP275) and <i>V</i>. <i>cholerae</i> (VC112) isolated from shrimp farms were evaluated by Eucalyptus and Guava aqueous leaf extracts and compared to tetracycline and ceftriaxone. Preliminary results showed that the best growth conditions of biofilm development for <i>V</i>. <i>parahaemolyticus</i> were 24 h and 24°C (<i>p</i> &lt;0.001), while <i>V</i>. <i>cholerae</i> biofilms were 72 h and 30°C (<i>p</i> &lt;0.001). Multivariate linear regression ANOVA was applied using colony-forming unit (CFU) counting assays as a reference, and R-squared values were applied as goodness-of-fit measurements for biofilm analysis. Then, both plant extracts were analyzed with HPLC using double online detection by diode array detector (DAD) and mass spectrometry (MS) for the evaluation of their chemical composition, where the main identified compounds for Eucalyptus extract were cypellogin A, cypellogin B, and cypellocarpin C, while guavinoside A, B, and C compounds were the main compounds for Guava extract. For planktonic growth inhibition, Eucalyptus extract showed its maximum effect at 200 μg/mL with an inhibition of 75% (<i>p</i> &lt; 0.0001) against all <i>Vibrio</i> strains, while Guava extract exhibited its maximum inhibition at 1600 μg/mL with an inhibition of 70% (<i>p</i> &lt; 0.0001). Both biofilm inhibition and eradication assays were performed by the two conditions (24 h at 24°C and 72 h at 30°C) on <i>Vibrio</i> strains according to desirability analysis. Regarding 24 h at 24°C, differences were observed in the CFU counting between antibiotics and plant extracts, where both plant extracts demonstrated a higher reduction of viable cells when compared with both antibiotics at 8x, 16x, and 32x MIC values (Eucalyptus extract: 1600, 3200, and 6400 μg/mL; while Guava extract: 12800, 25600, and 52000 μg/mL). Concerning 72 h at 30°C, results showed a less notorious biomass inhibition by Guava leaf extract and tetracycline. However, Eucalyptus extract significantly reduced the total number of viable cells within <i>Vibrio</i> biofilms from 2x to 32x MIC values (400–6400 μg/mL) when compared to the same MIC values of ceftriaxone (5–80 μg/mL), which was not able to reduce viable cells. Eucalyptus extract demonstrated similar results at both growth conditions, showing an average inhibition of approximately 80% at 400 μg/mL concentration for all <i>Vibrio</i> isolates (<i>p</i> &lt; 0.0001). Moreover, eradication biofilm assays demonstrated significant eradication against all <i>Vibrio</i> strains at both growth conditions, but biofilm eradication values were substantially lower. Both extract plants demonstrated a higher reduction of viable cells when compared with both antibiotics at 8x, 16x, and 32x MIC values at both growth sets, where Eucalyptus extract at 800 μg/mL reduced 70% of biomass and 90% of viable cells for all <i>Vibrio</i> strains (<i>p</i> &lt; 0.0001). Overall results suggested a viable alternative against vibriosis in the shrimp industry in Ecuador.","author":"Nicolás Renato Jara-Medina","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4fac6685789d6972ac3a4955c39d29105d146a4d8616e1f86d25c3ddab68f594","category":"Interdisciplinary"}