{"title":"Multi-elemental Characterization of Soils in the Vicinity of Siderurgical Industry: Levels, Depth Migration and Toxic Risk","link":"https://www.preprints.org/manuscript/202404.0668/v1","date":1712724456000,"content":"The assessment of soil contamination in the vicinity of integrated siderurgical plants is of outmost importance for agroecosystems and human health, and sensitive techniques should be employed for accurate assessment of chemical elements (metals, potential toxic elements, rare earths, radioelements) in soil and further evaluation of potential ecological and safety risk. In this paper a total of 45 major, minor and trace elements (Al, As, Au, Ba, Br, Ca, Cd, Ce, Co, Cr, Cs, Cu, Dy, Eu, Fe, Hf, Hg, I, K, La, Mg, Mn, Mo, Na, Nd, Ni, Pb, Rb, Sb, Sc, Sm, Sn, Sr, Ta, Tb, Th, Ti, Tm, U, V, W, Y, Yb, Zn and Zr) were quantified in soils located around a large siderurgical works (Galati, SE Romania) using instrumental neutron activation analysis (INAA) in combination with X-ray fluorescence (XRF) and inductively coupled plasma mass spectrometry (ICP-MS). The statistical analysis results and vertical distribution patterns for three depths (0-5 cm, 5-20 cm, 20-30 cm) indicate inputs of toxic elements in the sites close to the ironmaking and steelmaking facilities and industrial wastes dumping site. For selected elements, a comparison with historical, legislated and world reported concentration values in soil was performed and depth migration, contamination and toxic risk indices were assessed. The distribution of major, rock forming elements was closer to the Upper Continental Crust (UCC), and to the Dobrogea loess, finding confirmed by the ternary diagram of the incompatible trace elements Sc, La and Th, as well as by the La to Th rate. At the same time, the La/Th vs. Sc and Th/Sc vs. Zr/Sc bi-plots suggested a felsic origin and a weak recycling of soils mineral components.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"4fb6ba7c38c52b468938f61201eb2237c791594cbc00c782cd022329921a5a65","category":"Interdisciplinary"}