{"title":"iOS 16.4 is out now with new emojis and critical security updates","link":"https://www.macworld.com/article/1481562/ios-16-4-release-features-emoji-install.html","date":1679978700000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>After a delayed arrival of the first beta that didn’t arrive until February 16, more than three weeks after iOS 16.3 arrived, it appears that Apple is ready to release the latest version of iOS 16 to the masses. There are several new features in the latest update, along with standard bug fixes and security updates. Here’s everything you can expect when it arrives on your iPhone, likely on Monday, March 27, or Tuesday, March 28.</p>\n\n\n\n<p><em><strong>Update 3/27/23:</strong> Apple has released iOS 16.4 and iPadOS 16.4.</em></p>\n\n\n\n<h2>iOS 16.4: New features</h2>\n\n\n\n<p>Here are some of the significant changes and additions in iOS 16.4. We will continue to update this section as more changes are discovered.</p>\n\n\n\n<p><strong>New emoji:</strong> This release adds the <a href=\"https://www.macworld.com/article/1516394/ios-16-4-iphone-emoji-donkey-moose-shaking-face.html\">emoji that are part of the Unicode 15.0 standard</a>. They include a shaking face (side to side, like “no”), several heart colors including a pink heart that was strangely absent until now, left and right pushing hands, several new animals (moose, goose, jellyfish), and a few food items and musical instruments.</p>\n\n\n\n<p><strong>Web push notifications:</strong> This release adds support for web push notifications. Web apps saved to the home screen can send system notifications through the Push API, Notifications API, and Service Workers by using the standard HTML5 Web Push API. Websites have to ask for permission just as apps do, and it has to be in response to a user action (like tapping a “subscribe” button or the like).</p>\n\n\n\n<p><strong>Home architecture upgrade:</strong> The Home architecture upgrade that was pulled from the iOS 16.2 release is back in iOS 16.4. This is an under-the-hood update of the Home architecture; the Home app itself was updated in an earlier release.</p>\n\n\n\n<p><strong>Voice Isolation for cellular calls:</strong> A new setting in Control Center will prioritize your voice and block out ambient noise around you while on calls.</p>\n\n\n\n<p><strong>Podcasts app:</strong> The Podcasts app across iPhone, iPad, and CarPlay improves the Up Next queue and adds features like episode filtering and the ability to browse by season.</p>\n\n\n\n<p><strong>Widgets:</strong> A new Wallet widget to easily track orders. </p>\n\n\n\n<p><strong>Books page-turning animation:</strong> The page-turning animation, where the corner of the page folds up, is back in Apple Books after being removed in the first iOS 16 release.</p>\n\n\n\n<p><strong>New beta requirements:</strong> If your device is registered as a beta tester, you can open Settings &gt; <em>General</em> &gt; <em>Software Updates</em> and a new menu allows you to select whether you want no beta updates, Developer Beta updates (if applicable), or Public Beta updates. Also, developers will now need an authorized developer account to install updates rather than just a profile.</p>\n\n\n\n<p><strong>Apple ID for beta access:</strong> Apple is cracking down on loading beta versions through third-party sites and profiles, requiring verification of an Apple ID enrolled in either the public or developer beta program. With iOS 16.4, you’ll be able to designate an Apple ID with beta access that is separate from the one used for the rest of the device’s features.</p>\n\n\n\n<p>If you want to learn more about iOS 16 read about the <a href=\"https://www.macworld.com/article/631448/ios-16-features-compatibility-how-to-update.html\">new features (and problems) that have arrived in iOS 16</a> since it launched. </p>\n\n\n\n<h2>iOS 16.4 release notes</h2>\n\n\n\n<p>These are the official release notes from Apple for iOS 16.4:</p>\n\n\n\n<ul><li>21 new emoji including animals, hand gestures, and objects are now available in emoji keyboard</li><li>Notifications for web apps added to the Home Screen</li><li>Voice Isolation for cellular calls prioritizes your voice and blocks out ambient noise around you</li><li>Duplicates album in Photos expands support to detect duplicate photos and videos in an iCloud Shared Photo Library</li><li>VoiceOver support for maps in the Weather app</li><li>Accessibility setting to automatically dim video when flashes of light or strobe effects are detected</li><li>Fixes an issue where Ask to Buy requests from children may fail to appear on the parent’s device</li><li>Addresses issues where Matter-compatible thermostats could become unresponsive when paired to Apple Home</li><li>Crash Detection optimizations on iPhone 14 and iPhone 14 Pro models</li></ul>\n\n\n\n<h2>iOS 16.4: Security updates</h2>\n\n\n\n<p>iOS 16.4 includes more than 30 security updates, including several that could be deemed high-risk. Among the flaws patched:</p>\n\n\n\n<p><strong>Calendar</strong></p>\n\n\n\n<ul><li><strong>Impact:</strong> Importing a maliciously crafted calendar invitation may exfiltrate user information</li><li><strong>Description:</strong> Multiple validation issues were addressed with improved input sanitization.</li><li><strong>CVE-2023-27961:</strong> Rıza Sabuncu (@rizasabuncu)</li></ul>\n\n\n\n<p><strong>Find My</strong></p>\n\n\n\n<ul><li><strong>Impact: </strong>An app may be able to read sensitive location information</li><li><strong>Description:</strong> A privacy issue was addressed with improved private data redaction for log entries.</li><li><strong>CVE-2023-23537: </strong>an anonymous researcher</li></ul>\n\n\n\n<p><strong>WebKit</strong></p>\n\n\n\n<ul><li><strong>Impact: </strong>A website may be able to track sensitive user information</li><li><strong>Description: </strong>The issue was addressed by removing origin information.</li><li><strong>CVE-2023-27954: </strong>an anonymous researcher</li></ul>\n\n\n\n<h2>iOS 16.4: How to install the latest update </h2>\n\n\n\n<p>Here’s how to get the latest iOS update on your iPhone or iPad: </p>\n\n\n\n<ol><li>Open Settings.</li><li>Tap <em>General</em>.</li><li>Tap <em>Software Update</em>.</li><li>Tap <em>Download and Install</em></li><li>Follow the prompts and wait for your phone to restart</li></ol>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"4fc498aec4f017728fbd2e393b0d0ff9fe3d3877616a4d7862c1ce9f06f8e439","category":"Apple"}