{"title":"Canadian Police Claim AirTags Are Being Used by Thieves to Track Cars They Intend to Steal","link":"https://www.yrp.ca/en/Modules/News/index.aspx?newsId=167fa5b3-3583-431d-8cc0-91e49aee3bff","date":1638571615000,"content":"\n<p>York Regional Police:</p>\n\n<blockquote>\n  <p>Since September 2021, officers have investigated five incidents\nwhere suspects have placed small tracking devices on high-end\nvehicles so they can later locate and steal them. Brand name ‘air\ntags’ are placed in out-of-sight areas of the target vehicles when\nthey are parked in public places like malls or parking lots.\nThieves then track the targeted vehicles to the victim’s\nresidence, where they are stolen from the driveway.</p>\n\n<p>Thieves typically use tools like screwdrivers to enter the\nvehicles through the driver or passenger door, while ensuring not\nto set off alarms. Once inside, an electronic device, typically\nused by mechanics to reprogram the factory setting, is connected\nto the onboard diagnostics port below the dashboard and programs\nthe vehicle to accept a key the thieves have brought with them.\nOnce the new key is programmed, the vehicle will start and the\nthieves drive it away.</p>\n\n<p>Over the past year, more than 2,000 vehicles have been stolen\nacross the region.</p>\n</blockquote>\n\n<p>Five incidents out of 2,000 is not exactly a trend, but the basic idea here is interesting. I’m interested in knowing <em>how</em> the police figured out that AirTags were used in this way. Let’s say a thief hides an AirTag on your car while it’s in a public parking lot. Then you park the car in your home’s driveway. The thief comes in the middle of the night and steals your car. You call the police and they come to your home to investigate. How would they know an AirTag had ever been involved?</p>\n\n<p>My only guess is that in these five incidents, the victims were iPhone users who got the “<a href=\"https://support.apple.com/en-us/HT212227\">AirTag Found Moving With You</a>” alert. They tapped the “Play Sound” button, found the nefariously hidden AirTag, and (perhaps because they know their car is high-end) had the foresight to call the police. Or, maybe they disregarded the alert, thinking their iPhone had picked up on someone else’s AirTag by mistake. But then their car gets stolen a day or two later, and the unexpected “AirTag Found Moving With You” alert they had disregarded suddenly seems relevant, so they share that with the police.</p>\n\n<p>If that’s the basic idea, then the use of AirTags in this way might be more prevalent than the five cases suggest, because if the car owner doesn’t use an iPhone (or uses an older iPhone still running an older version of iOS), neither the owner nor the police would have any way of knowing an AirTag had ever been involved in the theft.</p>\n\n<p>(<a href=\"https://www.macrumors.com/2021/12/03/airtag-linked-to-car-thefts/\">Via MacRumors</a>.)</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/12/03/canada-car-thieves-airtags\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"4fd797b9cbc000a0fe35970afce351c6fbf9625ea90de667f7de64e6552f1ab8","category":"Tech"}