{"title":"Computational screening and molecular docking of compounds from Traditional Chinese Medicine (TCM) by targeting DNA topoisomerase I to design potential anticancer drugs","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310364","date":1726149600000,"content":"<p>by Mst. Sharmin Sultana Shimu</p>\r\n\r\nEach year thousands of people suffer across the globe due to higher cancer incidence and mortality rates. Additionally, the treatment option for cancer patients is also costly, and often cancer drugs suffer from lower efficacy with more side effects. The DNA topoisomerase can function as an established cancer target because Human Topoisomerase (Top1) regulates genetic transcription during the post-mitotic phase and plays a critical role in DNA supercoiling during replication and repair. Therefore, during drug therapy, blocking the Top1 may be crucial for inhibiting the proliferation of cancer cells. Here, the TCM (traditional Chinese medicine) compounds have been screened through the virtual screening. The Chinese medicine library’s virtual screening process made it possible to narrow down the compound list to 29 compounds based on binding energy (-7.1 to -9.3Kcal/mol), while following Lipniski filtering, MM/PB (GB) SA filtering was used to screen the remaining 22 compounds and the top four compounds were chosen based on binding free energy. Here, the four compounds; CID-65752 (T2972: Rutaecarpine), CID-5271805 (T4S2126: Ginkgetin), CID-9817839 (T2S2335: Dehydroevodiamine) and CID-51106 (T3054: Daurisoline) had comparatively higher binding energy of -8.2, -8.5, -8.3 and -8.2 respectively during molecular docking than other compounds. Among these four compounds, no toxic profile of the two screened compounds; CID-5271805 and CID-9817839 was found in ADMET filtering. Moreover, the SASA (solvent accessible surface area), Rg (radius of gyrations), RMSD (root mean square deviation), and RMSF (root mean square fluctuation) profile of the drug-protein complex reveals the stability and rigidity of the compounds in molecular dynamics simulation study. However, these studies need to be validated in experimental approaches to develop more potent and effective cancer drugs.","author":"Mst. Sharmin Sultana Shimu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"4fd854a9a311e82eb141157d1be7cefb0efe0032762d02613dfb50af48096aec","category":"Interdisciplinary"}