{"title":"77 Assessing abundance of pregnancy markers among fertility-classified beef cows","link":"https://academic.oup.com/jas/article/102/Supplement_1/25/7617964?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>In beef cattle, for a single pregnancy opportunity, only 60% of cows will remain pregnant. It is possible that uterine dysfunction prevents adequate embryo signaling and subsequent placentation. Our aim was to compare the abundance of molecular markers associated with pregnancy retention among embryo recipients classified for fertility. The hypothesis was that expression of interferon-stimulated genes (ISG15 and RSAD2) in lymphocytes and concentration of pregnancy associated glycoproteins (PAGs) in serum increase according to cow fertility. Cyclic, Bos Indicus-influenced, primiparous cows (n = 50) were submitted to five consecutive rounds of estrus synchronization, embryo transfer (ET), pregnancy termination and recovery. The ET was conducted 7 days after estrus (D7). Each cow received two embryos per transfer from a randomly assigned bull pair (BP) containing one embryo from each bull A, B or C (BP1 = A+B; BP2 = A+C; BP3 = B+C). Pregnancy diagnostic was conducted on D32 and D45 using B-mode ultrasonography. Blood samples were collected on D20 to quantify expression of ISG15 and RSAD2 in peripheral blood mononuclear cells and on D25, D32, and D39 to quantify serum concentration of PAGs. Based on D45 pregnancy outcome (pregnant or open), cows were classified as Fertile (Fert; n = 14), Sub-fertile (SF; n = 16) or Infertile (IF; n = 15) if they were pregnant 3, 2, or 1 out of the 5 experimental rounds, respectively. Five cows that never sustained a pregnancy until D45 were excluded. The overall prevalence of twin-pregnancies was 7.8% (n = 13/166). Expression of ISG15 was increased in Fert compared to IF cows (P = 0.01; 0.0196 ± 0.0042 vs 0.0164 ± 0.0052, respectively). There was no effect of fertility classification on the expression of RSAD2. Serum concentrations of PAGs increased over time (P &lt; 0.0001), regardless of fertility classification (day x fertility classification; P &gt; 0.4). There was an effect of BP on the probability of pregnancy on D32 and D45 (P &lt; 0.05). For D32, BP2 (84%) was 3 times more likely to maintain a pregnancy than BP1 (52%), while BP3 (74%) was not significantly different. On D45, BP2 (80%) was 2.8 times more likely to remain pregnant than BP1 (50%), and BP3 (62%) was not different than either BP1 or BP2. The interaction bull pair by fertility classification on the probability of pregnancy on D45 approached significance (P = 0.1). While pregnancy to BP2 was similar across all fertility classifications (80%), pregnancy to BP1 decreased dramatically as classifications changed from Fert to IF (88% vs. 14%, respectively). In conclusion, IF cows were less able to respond to IFN-t, likely because of a reduced secretion of IFN-t from the elongating conceptus. Also, IF cows are more susceptible to the genetics of the embryo than FERT cows.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4fdaa8627bd8b4ec5c7faf5dd48205f889960c82c42a6502a29b90f597a61f71","category":"Environment"}