{"title":"How African Ungulates Respond to Tourist Vehicles in Kruger National Park","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13335?af=R","date":1729234819000,"content":"<h2>ABSTRACT</h2>\n<p>Managers of protected areas need to balance how they use or preserve their resources, especially regarding ‘road ecology’. This study focuses on Kruger National Park's (KNP) common ungulates’ response to tourist vehicles. We answered the following questions for impala, zebra, giraffe, blue wildebeest, greater kudu and steenbok: What mediates animal flight and flight distance from a vehicle? How much of KNP is affected by roads? Are ungulates using or avoiding roads? We sampled 55.9% of KNP's tourist roads, where we approached animals and determined whether and how far they fled. We georeferenced sightings and estimated the amount of land area along KNP's tourist roads where animals would be expected to flee from vehicles. Of 517 animal sightings, Impala were sighted most (263) and steenbok least (32). Impala had the highest flight propensity (42.6%) and wildebeest lowest (13%). Steenbok were found closest to the road (22.13 m) and wildebeest furthest (77.6 m). Impala had the closest tolerance distance (16.63 m), with zebra furthest (44.74 m). Impala fled the least distance (9.93 m) and zebra fled furthest (24.52 m). Binary logistic regressions (BLRs) showed that all species fled more consistently when closer to the road. The amount of KNP affected by animal flight based on BLRs was largest for zebra (2.32% of the park) and smallest for kudu (0.84%). Impala used the first 10 m of the roadside more than expected and 10–20 m from the road less. KNP's ungulates are habituated to vehicles since flight propensity was low, distribution analysis showed no-road avoidance, flight distance was short, and animals &gt; 50 m from the road generally do not flee. Given the amount of KNP that is already affected by vehicle traffic, as tourism increases, the land solely devoted to wildlife will necessarily decrease. This study aims to provide information for the best management of roads and traffic in KNP.</p>","author":"Andrea Romero, \nBrian J. O'Neill, \nKristen Rauch, \nAshley Roscoe","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"4fda5bf1f1b3db2a1b64ac75fa48e2baa519ba4e54d6a36be979783da6b348bc","category":"Environment"}