{"title":"Investigating the effects of species niche shifts on the potential distribution of Tuta absoluta (Lepidoptera: Gelechiidae) by using global occurrence data","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae059/7678834?rss=1","date":1716249600000,"content":"<span><div>Abstract</div>Invasive species may occupy quite different environments in their invaded areas to native ones, which may intensively interfere with predicting potential distribution through ecological niche modeling (ENM). Here, we take the tomato leafminer <span>Tuta absoluta</span> Meyrick (Lepidoptera: Gelechiidae), a tomato pest, as an example to investigate this topic. We analyzed niche expansion, stability, unfilling, and Schoener’s D by principal component analysis (PCA) ordination method to examine its realized niche shifts and to explore how ENM approaches are affected by niche shifts. We used 5 datasets: Asian, African, European, South American, and global occurrence records in this study. Results showed that high niche unfilling for the species’ invaded areas in Asia (20%), Africa (12%), and Europe (37%), possibly due to <span>T. absoluta</span> being in the early stages of invasion. High niche expansion was observed in Asia (38%) and Europe (19%), implying that some European and Asian populations had reached new climatic areas. African niche had the most niche stability (94%) and was equivalent to the native one in climate space (PCA ordination method), but the <span>n</span>-dimensional climate space framework showed that they were different. When projecting the native model to Asia and Europe, the native model performed poorly, implying that the niche shifts affected the transferability of the native model. ENM based on global data outperformed than other models, and our results suggested that <span>T. absoluta</span> has a large potential distribution in Asia, Mexico, South Europe, the United States, and Australia. Meanwhile, we recommend updating ENMs based on the species’ invasion stage.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"4fdc2484b4eb76a6cc7c18a5ce202afd4eeccb9235ecdb9d6d34dd565b4c4087","category":"Environment"}