{"title":"48 Use of 4,500 FTU/kg of phytase on performance and blood parameters of finishing pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/86/7665044?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Phytase hyper-dosing is a recent concept in nutrition based on the use of high doses of the enzyme with growth promoting effect. Supplementary release of inosotol, rapid and strong destruction of phytic acid and other non-phosphoric effects are proposed mechanisms for the positive results found on pig growth. The hypothesis of this concept would be to accelerate this destruction of the phytate improving feed conversion ratio (FCR). A second hypothesis is that this increased destruction of the phytate may generate decreased concentrations of cortisol, because the inositol has insulin-like effects, reducing glycemy and reducing cortisol concentrations and FCR. To evaluate these hypotheses, two different studies were conducted, in Brazil and Mexico, using Quantum Blue (AB Vista) in two formulation strategies, Control Group - a dose and nutritional matrix of 750 FTU/kg; Hyper-dosing Group - a dose strategy of 4,500 FTU/kg (but with the same matrix of 750 FTU/kg). In the Brazilian evaluation (Trial 1 - RESTRICTED feed consumption trial), 364 animals/treatment were used, divided into 26 replications of 14 animals each (13 pens of males and 13 pens of females). In the Mexican evaluation (Trial 2 – NO restricted feed consumption trial), 400 animals/treatment were used, divided into 8 replications of 50 animals each, all animals used in this evaluation were males. In both studies, body weight gain, feed intake and FCR were evaluated. In the Brazilian study, in addition, the blood cortisol concentration of the animals was also evaluated. The data from each experiment were analyzed using the GLM platform (Minitab 18), and ANOVA used to assess differences on treatments (<span>P</span> ≤ 0.05). As presented in Table 1, in Trial 1, no differences were noted (<span>P</span> &gt; 0,05) with the Hyper-dosing strategy for males; however, for females, this strategy improved (<span>P</span> ≤ 0.05) the FCR in Hyper-dosing Group versus Control Group. This difference in results between sexes can be explained by the feeding rate adopted in this experiment, which was similar for all animals (highly restrictive), what may have penalized some animals more because of the greater maintenance costs. The analysis of the blood parameters of these animals demonstrated a reduction (<span>P</span> ≤ 0.05) in cortisol concentrations, indicating that the use of phytase Hyper-dosing can be even better in situations of thermal or environmental stress. Also presented in Table 1, in the Mexican study the results were possible to observe a statistical trend (<span>P</span> ≤ 0.05 and &gt; 0.10) for the use of the Hyper-dosing concept for FCR. In conclusion, the use of 4,500 FTU/kg of Quantum Blue in the last 30 d of finishing pigs helps to improve performance and reduce blood cortisol concentrations of these animals, especially in situations where the production efficiency rate is moderate.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"4fe4c30d5e008ec9c1012ce338e0ddb98321c164394829c3fced44a7b6f7dbfb","category":"Environment"}