{"title":"Striking Charter workers build ISP where “profits are returned to users”","link":"https://arstechnica.com/?p=1757204","date":1618511570000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/bronx-antenna-1-800x600.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/bronx-antenna-1.jpg\">Enlarge</a> <span>/</span> Rooftop antenna at Immaculate Conception School in the Bronx. (credit: <a href=\"http://peopleschoice.coop/our-work\">People's Choice Communications</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Charter Communications employees who have been on strike since 2017 are building an Internet service provider in New York City called \"<a href=\"http://peopleschoice.coop/\">People's Choice</a>.\"</p>\n<p>\"People's Choice Communications is an employee-owned social enterprise launched by members of IBEW Local #3 to bridge the digital divide and help our neighbors get connected to the Internet during the COVID-19 pandemic,\" the <a href=\"http://peopleschoice.coop/about-us\">ISP's website says</a>. \"We are the workers who built a large part of New York City's Internet infrastructure in the first place. We built out [Charter] Spectrum's cable system, until in 2017, the company pushed us out on strike by taking away our healthcare, retirement, and other benefits. It's now the longest strike in US history.\"</p>\n<p>So far, People's Choice <a href=\"http://peopleschoice.coop/our-work\">says</a> it has completed rooftop antenna installations at two schools in the Bronx and installed \"hardline connections to wireless access points connecting 121 units\" at <a href=\"https://www.bflnyc.org/\">housing</a> for survivors of domestic violence who have disabilities.</p></div><p><a href=\"https://arstechnica.com/?p=1757204#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1757204&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4fe4cae42babcce5b7d015462749fb32bf106a905643aa15b730be4cafa51446","category":"Tech"}