{"title":"The use of vision modelling to design bycatch reduction devices using light","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12827?af=R","date":1711530029000,"content":"<h2>Abstract</h2>\n<p>Artificial light can be used to deter unwanted non-target catch (bycatch) from fishing gear, which is thought to be achieved by repelling bycatch, or highlighting escape routes on nets. To select for responses in bycatch species, light should (1) cause the bycatch species to avoid capture, and (2) not invoke the same reaction in target species. One way to maximise the chance of a bycatch species responding to light is to ensure the light colour used is more visible to bycatch species. Some studies have considered the visual sensitivity of certain species to address this. In particular, the wavebands of light that a species is sensitive to. However, using this measurement alone is incomplete as it does not consider other factors that affect visibility, such as the ambient light spectrum, and wavelength-dependant light attenuation in different water types and depths. To account for these variables, and to more accurately predict how both target and bycatch species view light colours in a fishing context, we used a model of the vision of commercially relevant species in fisheries across the world. From this, we show whether a light colour is more visible to a bycatch species compared to a target species in a particular depth and water type, and how modelling can be used to make informed assessments of the selection of relevant light colours in fishing. We also discuss the limitations of using vision models alone and the need for corresponding behaviour and/or fishing trials with lights.</p>","author":"Jasmine Somerville, \nJon Blount, \nMartin Stevens","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"4fe738ed1eed5fedb7cf7854e949b3f21c2eea34190047fb6a3ca6a22f5bf870","category":"Environment"}