{"title":"Simultaneous onboard analysis of seawater dissolved inorganic carbon (DIC) concentration and stable isotope ratio (δ13C‐DIC)","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10642?af=R","date":1723806016000,"content":"<h2>Abstract</h2>\n<p>Dissolved inorganic carbon (DIC) and its stable carbon isotope (<i>δ</i>\n<sup>13</sup>C-DIC) are valuable parameters for studying the aquatic carbon cycle and quantifying ocean anthropogenic carbon accumulation rates. However, the potential of this coupled pair is underexploited as only 15% or less of cruise samples have been analyzed for <i>δ</i>\n<sup>13</sup>C-DIC because the traditional isotope analysis is labor-intensive and restricted to onshore laboratories. Here, we improved the analytical precision and reported the protocol of an automated, efficient, and high-precision method for ship-based DIC and <i>δ</i>\n<sup>13</sup>C-DIC analysis based on cavity ring-down spectroscopy (CRDS). We also introduced a set of stable in-house standards to ensure accurate and consistent DIC and <i>δ</i>\n<sup>13</sup>C-DIC measurements, especially on prolonged cruises. With this method, we analyzed over 1600 discrete seawater samples over a 40-d cruise along the North American eastern ocean margin in summer 2022, representing the first effort to collect a large dataset of <i>δ</i>\n<sup>13</sup>C-DIC onboard of any oceanographic expedition. We evaluated the method's uncertainty, which was 1.2 <i>μ</i>mol kg<sup>−1</sup> for the DIC concentration and 0.03‰ for the <i>δ</i>\n<sup>13</sup>C-DIC value (1<i>σ</i>). An interlaboratory comparison of onboard DIC concentration analysis revealed an average offset of 2.0 ± 3.8 <i>μ</i>mol kg<sup>−1</sup> between CRDS and the coulometry-based results. The cross-validation of <i>δ</i>\n<sup>13</sup>C-DIC in the deep-ocean data exhibited a mean difference of only −0.03‰ ± 0.07‰, emphasizing the consistency with historical data. Potential applications in aquatic biogeochemistry are discussed.</p>","author":"Zhentao Sun, \nXinyu Li, \nZhangxian Ouyang, \nCharles Featherstone, \nEliot A. Atekwana, \nNajid Hussain, \nWei‐Jun Cai","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"4ff195cb0e4e02220da72604747ec8bff5b01b4653b74577236ad2e5f50fc11c","category":"Environment"}