{"title":"Iranian classical dance as a subject for empirical research: An elusive genre","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15098?af=R","date":1710223255000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/cea236d4-48d1-4059-9677-268440d9c804/nyas15098-gra-0001-m.png\" alt=\"Iranian classical dance as a subject for empirical research: An elusive genre\" /><p>Iranian classical dance is a rich resource for academic research, both for humanities scholarship and for the empirical disciplines (e.g., empirical aesthetics, experimental psychology, affective neuroscience). To support such research, this paper (a) describes the aesthetics, characteristics, and history of Iranian classical dance; (b) outlines issues of definition and systematization; and (c) gives an overview of related cultural complexities and sociopolitical issues in the past 40 years.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Dance has entered mainstream empirical research: dance as an experimental stimulus, and dancers as movement experts. Informed by several sources, including primary sources (original, historical documents, and oral reports, such as interviews with practitioners and academic scholars of Iranian dance genres) and secondary sources (research literature), we describe what we label “Iranian classical dance” within this paper as an important resource for empirical research, not only in humanities scholarship but also, and importantly, for empirical aesthetics, emotion psychology, cross-cultural psychology, and affective neuroscience. For this purpose, we (1) describe the aesthetics, characteristics, and history of Iranian classical dance; (2) outline issues of definition and systematization; and (3) give an overview of the cultural complexities and sociopolitical issues regarding Iranian classical dance in the past 40 years, which have shaped its current form. After the political revolution of 1979 (Iranian solar calendar year: 1358), dance in Iran—both as everyday practice and as a cultural heritage—was first forbidden, and now remains heavily restricted. International, interdisciplinary research teams can contribute to safeguarding Iranian classical dance in the future by firmly enshrining it into empirical research on human dance. We outline empirical research perspectives on Iranian classical dance, dataset resources, and expert communities.</p>","author":"Julia F. Christensen, \nShahrzad Khorsandi, \nMelanie Wald‐Fuhrmann","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"4ff2d9edf544c496e4b4257370806113706fb398e9d4d9de9791b3967f715dd7","category":"Environment"}