{"title":"The worst Apple products of all time","link":"https://www.macworld.com/article/342225/worst-apple-products-of-all-time.html","date":1617271200000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>It&rsquo;s been 45 years since Apple became a company, and it has released a lot of groundbreaking products over that time. But it hasn&rsquo;t all been iPhones and iPads&mdash;Apple has also made more than its fair share of failed, clunky, and just plain terrible products. Narrowing down our list was surprisingly tough, so we focused on products that had a combination of <em>bad</em> and <em>impactful</em>&mdash;nobody cares that the Pippin was terrible. With that in mind, here are our picks for the 10 worst Apple products of all time (in no particular order), and be sure to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www..macworld.co.uk/feature/best-apple-products-of-all-time-3803292/&amp;xcust=1-1-342225-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">check out the best Apple products over at Macworld UK</a>. </p>\n\n\n\n<h2 id=\"apple-usb-mouse-hockey-puck-mouse\">Apple USB Mouse (Hockey puck mouse)</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/worst-puck-mouse.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060594\"></figure><p class=\"imageCredit\">Apple</p></div>\n\n\n\n<p>Officially called the Apple USB Mouse, this was the first Apple mouse to drop Apple Desktop Bus (ADB) in favor of USB. That&rsquo;s about all it had going for it. Apple&rsquo;s first USB mouse shipped with the original <a href=\"https://www.macworld.com/article/190458/original_imac.html\">Bondi Blue iMac G3</a> and was easily the worst part of that computer. The circular shape was such a catastrophic disaster of design that it now sits proudly near the top of any list of Apple failures you&rsquo;ll ever come across. It was uncomfortable to hold, rotated as you used it, and tipped when you clicked the button too hard. Oh, and the cord was way too short. It&rsquo;s not a good sign when the thing you are meant to use as the primary means of controlling a product is largely unusable (see: Siri Remote below).<br><em>&mdash;Jason Cross</em></p>\n\n\n\n<h2 id=\"siri-remote\">Siri Remote</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/apple-tv-siri-remote.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060595\"></figure><p class=\"imageCredit\">Apple</p></div>\n\n\n\n<p>Apple is often accused of pursuing form over function, and when it makes devices like the Siri Remote you can see why. The average TV remote is big and dumb and ugly, but it does its job well: it feels comfortable in the hand and helps you find buttons without looking. Apple created a remote that was slim and minimalist, with the result that you don&rsquo;t even know if you&rsquo;re holding it the right way up. The trackpad is cooler than the old direction wheel but less user-friendly. And the remote gets lost all the time, just to add insult to injury. We&rsquo;ll be happy to see it go (hopefully) <a href=\"https://www.macworld.com/article/342131/its-increasingly-likely-that-the-next-apple-tv-will-finally-get-a-new-remote.html\">with the next Apple TV update</a>.<br><em>&mdash;David Price</em></p>\n\n\n\n<h2 id=\"eworld-mac-mobileme\">eWorld/.Mac/MobileMe</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/WORST-eworld.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060596\"></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<p>Before there was the internet, there were dial-up online communities, with America Online being the most popular. In 1994, Apple tried to get in on the action with <a href=\"https://www.macworld.com/article/223467/remembering-eworld-apples-forgotten-online-service.html\">eWorld</a>, which also replaced the outdated AppleLink online support service. But not only did it have to battle AOL, it was available only to Mac and Newton users, and it didn&rsquo;t offer anything of value that wasn&rsquo;t on AOL. Combine that with Apple hardly putting any effort into eWorld at all, and it was an easy project to put on the company&rsquo;s chopping block during its massive restructuring in 1996. <br><em>&mdash;Roman Loyola</em></p>\n\n\n\n<p>Apple&rsquo;s online services offerings have had a bit of a rocky history and those with a coveted @mac.com email address probably don&rsquo;t have the happiest memories. That email address initially came with iTools, but was later part of the subscription-based .Mac offering that included web hosting, online storage, and backup abilities. In June 2008, Apple gave subscribers to .Mac exactly one month&rsquo;s notice that they would be closing .Mac and replacing it with MobileMe. The transition was anything but smooth with issues delaying the start of MobileMe, but worst of all, many of the .Mac features were not transitioned (I&rsquo;ve never really forgiven Apple for the lost libraries of photos I had stored on the service). Thankfully Apple let us keep the @mac.com address because that&rsquo;s the only good thing to come out of it. <br><em>&mdash;Karen Haslam</em></p>\n\n\n\n<p>The final rebranding of Apple&rsquo;s pre-iCloud online service (after iTools and .Mac), MobileMe at least had the right idea. For $99 per year, Apple would sync all sorts of stuff across your gadgets: photos, contacts, e-mail, bookmarks, and so on. It was pitched as &ldquo;Exchange for the rest of us.&rdquo; If only it actually worked! The service was plagued with problems from the very beginning, including launch delays, sign-up failures, and multiple serious outages. Things were so bad that Apple gave out <a href=\"https://www.macworld.com/article/192031/mobileme-8.html\">two free extensions</a>. Steve Jobs even wrote a company-wide email in which he said, &ldquo;The launch of MobileMe was not our finest hour.&rdquo; Ouch.<br><em>&mdash;Jason Cross</em></p>\n\n\n\n<h2 id=\"ipod-hi-fi\">iPod Hi-Fi</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/worst-ipod-hifi.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060597\"></figure><p class=\"imageCredit\">Roman Loyola/IDG</p></div>\n\n\n\n<p>Apple marketed the iPod Hi-Fi bookshelf speaker as a revolution in home audio for enthusiasts, but the message fell on deaf ears. It didn&rsquo;t help that the iPod Hi-Fi <a href=\"https://www.macworld.com/article/179028/ipodhifireview.html\">didn&rsquo;t produce the sound quality</a> that nit-picky audiophiles demanded and its design actually hampered stereo imaging. It was built to be portable but it was quite heavy at 17 pounds and it absolutely wasn&rsquo;t built to take the abuse that comes with being carried around. While we&rsquo;ll admit it had a solid design, the iPod Hi-Fi just couldn&rsquo;t compete with its more practical and better-sounding challengers and was discontinued just a year after its release.<br><em>&mdash;Roman Loyola</em></p>\n\n\n\n<h2 id=\"butterfly-keyboard\">Butterfly keyboard</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macbook-pro-butterfly-keyboard.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060598\"></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<p>In 2015, Apple made the best laptop keyboard on the planet. After the MacBook landed in March, it also made the worst. The MacBook&rsquo;s butterfly keyboard was supposed to be a revolution in thinness that delivered &ldquo;a crisp and responsive feel when typing.&rdquo; Instead, it was loud, sticky, and prone to so many issues that <a href=\"https://www.macworld.com/article/232811/apple-improves-butterfly-keyboard-again-offers-to-free-fixes-for-some-macbook-models.html\">Apple launched a service program</a> that covers every butterfly keyboard model ever released. Thankfully Apple has since returned to delightful scissor-switch keys, but we&rsquo;ll never forget the five long years we suffered with the butterfly keyboard.<br><em>&mdash;Michael Simon</em></p>\n\n\n\n<h2 id=\"apple-maps-launch\">Apple Maps launch</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/worst-maps.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060599\"></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<p>Almost a decade ago, Apple sought to end its reliance on Google Maps with its own mapping service and app. First shipped in iOS 6, Apple Maps was a cobbled-together mashup of various data sources that were all out of the company&rsquo;s direct control. The results were often pretty, <a href=\"https://www.macworld.com/article/2010186/opinion-ios-6-maps-is-great-and-its-not.html\">but that&rsquo;s about all</a>. It was fraught with data errors such as warping landscapes, inaccurate labels, and directions that were so bad they became the subject of internet memes. It took several years for Apple to clean up the mess, all while Google kept adding features to its own mapping service. Two years ago <a href=\"https://www.macworld.com/article/231566/apple-maps-remap.html\">Apple began rolling out all-new map data</a>&mdash;gathered and controlled by Apple&mdash;and Apple Maps is finally starting to get legitimately good. But those first few years were terrible and unforgettable.<br><em>&mdash;Jason Cross</em></p>\n\n\n\n<h2 id=\"airpods-max-smart-case\">AirPods Max Smart Case</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/worst-airpods-max-case.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060600\"></figure><p class=\"imageCredit\">Apple</p></div>\n\n\n\n<p>You can argue about <a href=\"https://www.macworld.com/article/234986/airpods-max-review.html\">the merits of the AirPods Max themselves</a>, which have proved divisive (I like them). But pretty much everyone agrees that their case&mdash;hilariously branded as the Smart Case&mdash;is a stellar example of Apple&rsquo;s bad design. It looks like nothing you&rsquo;ve seen in your life: a weird hybrid blend of handbag and failed art project. Quality control is lacking, with cutouts in slightly the wrong place and magnets weaker than they should be. And most importantly it provides no protection whatsoever to the most vulnerable part of the AirPods Max, their headband. Smart Case? More like Dumb Case.<br><em>&mdash;David Price</em></p>\n\n\n\n<h2 id=\"mac-pro-2013\">Mac Pro (2013)</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/worst-mac-pro.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060601\"></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<p>Apple&rsquo;s sleek, modern, and compact designs are part of its corporate identity, but the 2013 Mac Pro is an example of the company trying way too hard. When Apple replaced the towering Power Mac/Mac Pro behemoth with a cylinder a fraction of the size, it was a prime example of a company thinking it can get away with telling its customers what they need instead of listening to those customers. <a href=\"https://www.macworld.com/article/222619/mac-pro-late-2013-review-apples-new-mac-pro-really-is-for-pros.html\">The 2013 Mac Pro was an engineering feat</a>, but Apple eventually acknowledged that it did its customers wrong and went back to a tower design for the Mac Pro in 2019.<br><em>&mdash;Roman Loyola</em></p>\n\n\n\n<h2 id=\"ipod-socks\">iPod Socks</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/worst-ipod-socks.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060602\"></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<p>It was hard to know whether Apple was entirely serious when it started selling iPod Socks in December 2004. The iPod Socks fit any iPod or device of that particular size and shape, cost $29, and were sold in packs of six in a variety of bold colors. Apple was no doubt hoping to get them into Santa&rsquo;s sack, but <a href=\"https://www.macworld.com/article/173204/ipodsocks.html\">the iPod Socks were tacky</a>&mdash; the polar opposite of what we expect from Apple. Beyond shielding iPods from scratches and dust, there was little benefit to the iPod Socks. They would certainly offer no protection if you dropped your iPod. And yet, as implausible as it may seem, the iPod Socks continued to be sold by Apple until 2012 when they were finally removed from shelves. <br><em>&mdash;Karen Haslam</em></p>\n\n\n\n<h2 id=\"ipod-shuffle-3rd-gen\">iPod shuffle (3rd gen)</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/worst-ipod-shuffle.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100060603\"></figure><p class=\"imageCredit\">Apple</p></div>\n\n\n\n<p>The original iPod Shuffle basically got everything right. <a href=\"https://www.macworld.com/article/1139406/3Gipodshufflereview.html\">The third-gen model did not</a>. It was cheaper at just $59 and came in a variety of colors, but the good stuff ended there. Apple took the &ldquo;shuffle&rdquo; part to heart and removed all buttons from the face of the device. It moved all of the controls to the headphone cord, which meant you had to use Apple&rsquo;s earbuds or buy a third-party pair with an Apple-approved headphone adapter if you wanted buttons, or else rely on voice control, neither of which were ideal solutions. Plus its incredibly small size made it very easy to misplace despite its built-in clip. &ldquo;Easy to lose and hard to use&rdquo; isn&rsquo;t nearly as compelling as &ldquo;1,000 songs in your pocket.&rdquo;<br><em>&mdash;Michael Simon</em></p>\n</div></body></html>","author":"Macworld Staff","siteTitle":"How to share a Mac’s drive with another Mac, whether Intel or Apple silicon","siteHash":"539a74e02eb4d5300027eb3e5fed7a754910a96d4e4f390bdaa8c3ed1b979e5d","entryHash":"4ffc2d9211c48c8411879747c52f6a9494b3b132af766a6d905097d85c414338","category":"Apple"}