{"title":"watchOS 10: Everything you need to know about the next Apple Watch update","link":"https://www.macworld.com/article/1792869/watchos-10-release-date-new-features.html","date":1682073000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple is often accused of charging too much money for its products, but some of the company’s most momentous releases are free. Such as the annual major software updates for the iPhone, Mac, iPad, and Apple Watch, which unlock a raft of new features at no extra expense.</p>\n\n\n\n<p>This year, in fact, the watchOS 10 software update (cost: $0) is expected to be <a href=\"https://www.macworld.com/article/1788333/watchos-10-apple-watch-updated-interface-enhancements.html\">considerably more significant</a> than this year’s new hardware. The <a href=\"https://www.macworld.com/article/1472709/apple-watch-series-9-rumors-specs-features-price-release.html\">Apple Watch Series 9</a> (likely cost: $399 and upwards) has been labeled “anything but major,” whereas the new OS is expected to bring “bigger enhancements, including an updated interface.”</p>\n\n\n\n<p>This article is our watchOS 10 deep dive, sifting through the leaks and rumors to bring you the best available information about its release schedule, hardware compatibility, and range of interface changes and new features. WWDC can’t come soon enough!</p>\n\n\n\n<h2>watchOS 10 release date: When will watchOS 10 arrive?</h2>\n\n\n\n<p>watchOS 10 will be announced at <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC 2023</a> on June 5, enter a lengthy beta testing process, and finally become available for official public download in the fall.</p>\n\n\n\n<p>It’s worth noting that Apple hasn’t announced any of this (other than the date of WWDC), but the company’s OS updates follow a predictable pattern. Every summer, Apple announces major new versions of watchOS, iOS, iPadOS, macOS, and tvOS. It demonstrates some or all of these at its WWDC gathering–the stage time varies depending on what Apple thinks is most interesting to the audience–and then begins beta testing. The final releases generally appear in September (watchOS 9 was released on September 9 last year), at roughly the same time as the year’s new iPhones and Apple Watches.</p>\n\n\n\n<p>Here’s the schedule we expect for watchOS 10:</p>\n\n\n\n<ul><li><strong>June 5:</strong> watchOS 10 is unveiled at the WWDC keynote presentation.</li><li><strong>June 5:</strong> First developer beta is released.</li><li><strong>July:</strong> First public beta is released.</li><li><strong>June-September:</strong> A series of betas are released, gradually getting closer to the final product.</li><li><strong>September:</strong> watchOS 10.0 is rolled out to the public.</li></ul>\n\n\n\n<h2>watchOS 10 compatibility: Which Apple Watches will be able to run watchOS 10?</h2>\n\n\n\n<p>We expect watchOS 10 to run on the same devices as watchOS 9: the Apple Watch Series 4 and later. But we won’t know for sure until WWDC.</p>\n\n\n\n<p>The recent pattern has been that Apple trims its list of compatible models every other year. In 2018, watchOS 5 dropped support for the first-gen Apple Watch; in 2020, watchOS 7 dropped the Series 1 and 2; and in 2022, watchOS 9 dropped the Series 3. That’s why we think watchOS 10 will refrain from swinging the axe, and the Series 4 will live for one more year–although it may not get access to the full range of new features.</p>\n\n\n\n<p>Of course, each version of watchOS also has a list of compatible iPhones: for the time being, each Apple Watch needs to have a paired iPhone with iOS 17. In 2019, watchOS 6 dropped support for the iPhone 5, 6, and 6 Plus; the remaining iPhones lasted another three years, but in 2022, watchOS 9 dropped the iPhone 6s and 6s Plus, the 7 and 7 Plus, and the 2016 iPhone SE. Following that bloodbath, our suspicion is that the iPhone 8 and later will again be compatible with the new version of watchOS this year.</p>\n\n\n\n<h2>watchOS 10: How to install the beta and full version</h2>\n\n\n\n<p>Once watchOS 10 is here for real, installing it on your Apple Watch will be easy. Simply open the Watch app on the companion iPhone, make sure you’re in the My Watch tab, then go to <em>General</em> &gt; <em>Software Update</em> and follow the onscreen instructions. You may need to update the iPhone first.</p>\n\n\n\n<p>You’ll also be able to <a href=\"https://www.macworld.com/article/350193/watchos-8-public-beta-install-profile-devices.html\">try out a beta of watchOS 10</a> before the fall. To do that, you’ll need to join <a href=\"https://www.macworld.com/article/674359/how-to-join-apples-beta-program-and-try-out-new-software.html\">Apple’s beta program</a> and understand that some features on your watch might break. Apple is <a href=\"https://www.macworld.com/article/1782726/macos-watchos-beta-process-profiles-apple-id.html\">streamlining the beta process</a> in watchOS 9.5, so you’ll only need to sign into your Apple ID to get betas on all of your devices, and you can easily switch them off if you want to stop receiving them. In the same <em>Software Update</em> tab, you’ll see a new <em>watchOS 10 Beta</em> tab that will let you switch from watchOS 9 updates to watchOS 10 updates.</p>\n\n\n\n<h2>watchOS 10: Rumored new features</h2>\n\n\n\n<p>The new version of watchOS will include umpteen small tweaks designed to improve the reliability of existing functions, but the real meat of Apple’s announcement will focus on the new things you will soon be able to do with your Apple Watch and the new ways you will interact with it. Here are the new features and major changes we expect in watchOS 10.</p>\n\n\n\n<h3>Updated interface</h3>\n\n\n\n<p>The user’s comfort with a digital interface is as much about familiarity as sound design principles, and any major change in this area is sure to lead to pushback; that’s what Apple experienced with the radically redesigned and initially unpopular iOS 7 back in 2013. But Mark Gurman, the leaker/analyst who predicted big things for the Apple Watch this year, was careful to use the word <em>updated</em> rather than <em>new</em> to describe the watchOS 10 interface. It’ll be different, but it doesn’t sound like it’ll be totally different.</p>\n\n\n\n<p>More detail about what this will look like emerged on April 18, when leaker Analyst 941 on Twitter (Anonymous-A.S on the Macrumors forums) predicted “a redesigned homescreen layout/grid” and said this would be “much easier to use, move, &amp; act more familiar to iOS, including folders.” The prediction was accompanied by renders showing very large icons lined up in straight rows and columns (as opposed to the space-saving tessellating honeycomb pattern currently used) and a rough visual of how folders will work.</p>\n\n\n\n<figure><div>\n<blockquote><p>Happy 9:41 AM<br /><br />I saved the best for last, watchOS will have a redesigned homescreen layout/grid.<br /><br />heavy details SOON. but it's going to be much easier to use, move, &amp; act more familiar to iOS, including folders.📂<br /><br />Unsure if it will be a third option or replace grid as default. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/GuNvcnmIox&amp;xcust=1-1-1792869-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/GuNvcnmIox</a></p>— 941 (@analyst941) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/analyst941/status/1648366185967239170?ref_src=twsrc%5Etfw&amp;xcust=1-1-1792869-1-0-0&amp;sref=https://www.macworld.com/feed\">April 18, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>It’s fair to say that the current honeycomb grid is not easy to use, because the icons are small and haphazardly arranged, while their closeness to one another makes it easy to open the wrong app. The list view is a better option for most Apple Watch owners, but having larger and more regularly arranged icons feels like a win, even if the idea of folders on such a small screen is less appealing.</p>\n\n\n\n<p>But bear in mind firstly that this is not confirmed: Analyst 941 has scored a few hits with accurate predictions recently, but doesn’t have a long track record to warrant a great deal of trust. And secondly, even if the general theory is correct, the details and execution are still up in the air. The rough renders of course look slightly awkward, but Apple’s designers would be able to create something more polished. But once we’re used to it, this could be a very usable interface.</p>\n\n\n\n<h3>New apps, including Health?</h3>\n\n\n\n<p>Apple likes to offer an entirely new app to headline an OS update, such as Breathe in watchOS 3 and Walkie Talkie in watchOS 5, but we’ve not heard any rumors of something similar this year. What we are hearing is that Apple may bring the existing Health app to the Apple Watch… although the origin of this theory is unclear. (At the time of writing <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://bgr.com/tech/watchos-10/&amp;xcust=1-1-1792869-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">BGR</a> confidently states that Apple “is expected to bring the Health app for the Apple Watch,” without citing a source; <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.tomsguide.com/news/watchos-10&amp;xcust=1-1-1792869-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Tom’s Guide</a>, meanwhile, mentions this as something it would <em>like</em> to happen, and we wonder if wires have become crossed somewhere along the line.) Nevertheless, it would make sense for the Apple Watch to get a centralized health dashboard, given its increasing centrality to Apple’s health and fitness efforts.</p>\n\n\n\n<h3>Miscellaneous changes</h3>\n\n\n\n<p>There are certain features Apple adds to its smartwatch each year as a matter of routine. watchOS 10 will almost certainly see the addition of new faces, for example, and there will be new complications for the faces we’ve already got. There’s a good chance the Workout app will get a new routine or two. Sleep tracking will probably be tweaked a little more since it’s still behind the equivalent feature on Fitbit.</p>\n\n\n\n<p>None of these is big enough to headline a keynote, since they are expected. But small iterative improvements are still an important part of the value offered by Apple’s free yearly updates.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-WWDC23-hero.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple WWDC 2023\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-WWDC23-hero.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-WWDC23-hero.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-WWDC23-hero.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-WWDC23-hero.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-WWDC23-hero.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-WWDC23-hero.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-WWDC23-hero.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-WWDC23-hero.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption>watchOS 10 may be one of the highlights of WWDC 2023, but there will be plenty more to enjoy.</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Further reading</h2>\n\n\n\n<p>With no spring event held earlier this year, <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC 2023</a> should be a cracker of an event, with loads of major announcements expected.</p>\n\n\n\n<p>On the software side, watchOS 10 will be accompanied by four other operating system updates, of which the most significant will probably be <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17</a> (which could see the arrival of sideloading on the iPhone for the first time) and <a href=\"https://www.macworld.com/article/1670742/macos-14-wishlist-dynamic-island-time-machine-clock-sync-ios-apps.html\">macOS 14</a> for the Mac.</p>\n\n\n\n<p>But there should be new hardware too. Apple would like to build the event around its long-awaited <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">mixed-reality headset</a>, the first in an entirely new ecosystem of products that could eventually surpass the iPhone in importance–although the word “could” is carrying a lot of weight for this troubled and often-delayed project.</p>\n\n\n\n<p>There are also new Macs in the pipeline. There could be as many as <a href=\"https://www.macworld.com/article/1788880/wwdc-15-13-macbook-air-pro-design-processor.html\">three new MacBooks</a>, including a new <a href=\"https://www.macworld.com/article/819516/15-inch-macbook-air-release-date-specs-rumors.html\">15-inch MacBook Air</a>, and Apple fans dare to hope the company will finally bring the <a href=\"https://www.macworld.com/article/347010/new-mac-pro-2023.html\">Mac Pro</a> into the realms of Apple silicon.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5006af0ba26940b91787579ac6c340235ecdf9499032c5c88137414c6c592f1f","category":"Apple"}