{"title":"In vivo injection of exogenous molecules into octocorals: Application to the study of calcification","link":"https://onlinelibrary.wiley.com/doi/10.1002/lom3.10610?af=R","date":1715404866000,"content":"<h2>Abstract</h2>\n<p>In vivo studies of the effects of molecules of interest, such as hormones or xenobiotics on corals, are essential to uncover their effects on coral biological processes. However, exposure to such molecules is very challenging in aquarium systems due to the duration of exposure, the high cost of the compounds, their quantity, and their diffusion in seawater. In this study, we provide a durable alternative method by in vivo injection. The aim of this study was to evaluate slow release and local injection as a novel method of delivering compounds to corals. In this method, coconut oil, which solidifies upon injection and has a melting point of about 24°C, is used as the vehicle for injection. Local diffusion of the injected products in the organism was followed using visual tracers. Specifically, two classes of fluorescent markers were used, one of which examined internalization into cells (rhodamine), while the others were used as an application to monitor the calcification process (alizarin, calcein). In parallel, we developed an analytical method to quantify the calcein and alizarin labeling of sclerites, which allowed us to determine calcification rates in different parts of the coral. Two octocorals were used to optimize these methods, with <i>Sarcophyton</i> sp. being the preferred organism to develop and validate the injection procedures and characterize the diffusion of the markers. Once the method was perfected, injections were performed on the precious coral <i>Corallium rubrum</i> to prove the transferability of the method.</p>","author":"Clémence Forin, \nGuillaume Loentgen, \nDenis Allemand, \nSylvie Tambutté, \nPhilippe Ganot","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"50152ce1a57e445f253f3f79942344c4c61192f4babdd244c2c1f2349852e4c3","category":"Environment"}