{"title":"Urban Planning and Green Building Technologies Based on Artificial Intelligence: Principles, Applications, and Global Case Study Analysis","link":"https://www.preprints.org/manuscript/202408.1108/v1","date":1723645927000,"content":"The application of AI technology in urban planning covers multiple levels, such as data analysis, decision support, and automated planning. Urban research relies on AI technology to understand and summarize the law of urban growth and improve the analysis of the evolution trend of urban space. Planning and design use AI technology to explore the relevant factors affecting urban development and their weights and discuss the critical role of green building technology in the sustainable development of the construction industry. With the increase in global energy consumption and carbon emissions, traditional building methods can no longer meet environmental protection requirements and efficient use of resources. As a sustainable development solution, green building technology has been paid more and more attention to and adopted by people. These technologies focus not only on the energy efficiency and environmental impact of buildings but also on the resource utilization and environmental load of green buildings over their entire life cycle driven by machine learning. This paper details the basic principles and applications of green building technologies, including AI-driven reduction of negative environmental impacts, improvement of occupant health, efficient use of resources, and optimization of indoor environmental quality. This paper focuses on the critical role of the LEED assessment system developed by the U.S. Green Building Council in advancing green building practices. In addition, the paper analyzes vital points such as water use in green building design, machine learning-driven wind environment optimization, solar technology application, and practical application cases of these technologies on a global scale.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"501c579bd29075370091a6fe88698f6f88a12f25a060f862a3a472b58973b166","category":"Interdisciplinary"}