{"title":"Here's How Apple Watch Widgets Work in watchOS 10","link":"https://www.macrumors.com/2023/06/15/how-apple-watch-widgets-work-watchos-10/","date":1686833292000,"content":"Apple last week previewed watchOS 10, its next major software update for compatible Apple Watch models. Among a handful of new features, one of the most impactful is the introduction of widgets. Let's take a closer look at how they work and what you can do with them.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/widgets-in-watchos10.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\n<h2>What's Up With Widgets?</h2>\r<br />\nWidgets offer a new way to quickly bring up app-related information from any watch face on your Apple Watch, without having to open the corresponding app or rely exclusively on complications. In other words, if you choose simple faces without complications, you can still access the information you want, and if you like complication-rich faces, now you can get even more info at a glance.\r<br />\n\r<br />\nIn watchOS 10, an upward turn of the Digital Crown or a swipe up from the bottom of the watch face using your finger (Control Center is now accessed via the Side button) reveals a dynamic Smart Stack of widgets below the time and date that takes up half of the screen. You can scroll through these widgets with the Digital Crown or your finger, and tap a widget to open its corresponding app. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/widgets-watchos.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nBy using machine learning, the order of widgets can change based on your needs at any given time of day. \r<br />\n\r<br />\nFor example, if you have upcoming events in your calendar, a boarding pass for an upcoming flight, or tasks you need to complete, these will be displayed in order of priority. Or if you start a timer, it will appear at the top of the widget stack so you can easily see how long is left.\r<br />\n\r<br />\nIn addition to relevance-based ordering, Smart Stack also includes the ability to manually organize widgets, so the Smart Stack can be as dynamic or as fixed as you want. \r<br />\n\r<br />\nThere are actually two types of widget in watchOS 10: Dedicated app widgets that provide information from a single app, and a user-configurable complications widget that shows up to three watch face-style complications.\r<br />\n \r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/watch-widgets-complications.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nAt the very bottom of the widget stack is a button that takes you to the traditional app menu to access all your Apple Watch apps.\r<br />\n\r<br />\n<h2>Choosing the Widgets You Want to See</h2>\r<br />\nLike iPhone Home Screen widgets in iOS 16, Apple Watch widgets in watchOS 10 can work as a Smart Stack that changes based on the context or time of day, or you can manually choose the ones you want to include and also pin widgets to the top of the stack. The following steps show you how to edit widgets from any watch face.\r<br />\n<ol><li>On an Apple Watch running watchOS 10, scroll up using the Digital Crown, or swipe up from the bottom of the screen using your finger.</li>\r<br />\n<li>Long press any widget to enter the stack's jiggle mode. (Note that you can't edit the date and time display at the top of the stack.)</li>\r<br />\n<li>Tap the red minus button on a widget to remove it from the stack, or tap the large plus button above the stack to add one.</li>\r<br />\n<li>To pin a widget so that it remains at the top of the stack, tap its yellow pin icon.</li>\r<br />\n<li>To edit the complications widget, scroll to the bottom and tap the minus icon next to a complication, then tap the plus symbol to replace it with another available complication. (Note: You can also pin the complications widget.)</li></ol><img src=\"https://images.macrumors.com/article-new/2023/06/editing-widgets-watch.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\n\r<br />\n<h2>Summing Up</h2>\r<br />\nApple is pitching widgets as a way of enjoying simple watch faces like Portrait, without being far from the sort of onscreen information that complications typically provide. By using the Digital Crown, real-time data from your favorite apps is just a dial turn away. What do you think of widgets? Let us know in the comments.\r<br />\n\r<br />\nwatchOS 10 will be released to the public this fall and is compatible with the <a href=\"https://www.macrumors.com/guide/will-my-apple-watch-model-run-watchos-10/\">Apple Watch Series 4 and later</a>. In addition, you'll also need an iPhone capable of running iOS 17. This includes the iPhone XS or later and iPhone XR or later. For a full list of iPhones compatible with iOS 17, <a href=\"https://www.macrumors.com/guide/will-my-iphone-run-ios-17/\">check out our quick guide</a>. <div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a>, <a href=\"https://www.macrumors.com/roundup/watchos-9/\">watchOS 9</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-ipados-macos-tvos-watchos-visionos-programming.135\">iOS iPadOS macOS tvOS watchOS visionOS Programming</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/15/how-apple-watch-widgets-work-watchos-10/\">Here's How Apple Watch Widgets Work in watchOS 10</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/heres-how-apple-watch-widgets-work-in-watchos-10.2393072/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"501fde7ca950b0fa0ef388f30242ec470031a2aa7eb176a516a2f9e8964ed272","category":"Apple"}