{"title":"Tokyo 2020 Olympic Time Trial Debrief","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tokyo-2020-olympic-time-trial-debrief","date":1627496860000,"content":"\n      <p>With the men’s and women’s time trials done and dusted, the road cycling events at the Olympic Games are complete, and we will have to wait three years for the unique highlight that the Olympics brings to the cycling season.</p>\n<p><span>In the men’s time trial, Primož Roglič<b> </b>was at the forefront from the beginning of his run. He held a narrow lead after the first lap of the Fuji International Speedway, before extending his winning margin over the second lap to more than one minute. Tom Dumoulin was second whilst Rohan Dennis picked up bronze. <span>Stefan Küng </span>and Filippo Ganna were fourth and fifth respectively, cruelly missing out on a medal by just seconds.</span></p>\n<div></div>\n<p><span>In the women’s race, Annemiek van Vleuten finally claimed the first Olympic gold medal of her career, just days after briefly mistaking her runner-up ride for first in the women's road race. Switzerland's<span> </span></span>Marlen Reusser finished second, whilst Anna van der Breggen was third.</p>\n<p><span>So, what are the main stories, talking points and things we’ve learnt from the Olympic time-trials?</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/anna-kiesenhofer-the-mathematician-who-won-the-numbers-game\">Related – Anna Kiesenhofer: the mathematician who beat the odds</a></strong></em></p>\n<h4><b>Tom is Back</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1234256468-min_1024x1024.jpg?v=1627471647\" />Image credit: INA FASSBENDER/AFP via Getty Images</span></i></p>\n<p><span>In January, the cycling world was rocked by the news that Tom Dumoulin had decided to take a break from pro cycling. The Dutchman stated, “I have felt for some time that it is very difficult for me to know how to find my way as Tom Dumoulin the cyclist.” </span></p>\n<p><span>Some speculated that we had seen the last of the Dumoulin, as he took the time to mull over how he should approach the next phase of his career. We even caught a glimpse of him on the roadside in April watching the Amstel Gold Race — an event that Dumoulin has started on five occasions.  </span></p>\n<p><span>Dumoulin returned to racing in June, which means that prior to the Olympics, he had only started the Tour de Suisse and the Dutch national championships. This is what makes his performance at the Olympics so special.</span><span><br /></span><span></span></p>\n<p><span>His lack of racedays means that Dumoulin couldn't have been sure of his form prior to the Olympics. However, the Dutchman acquired the silver medal with a stellar performance — </span><span>the second Olympic medal of Dumoulin’s career, having also finished second in Rio 2016.</span></p>\n<p><span>Speaking after his excellent ride, Dumoulin stated, “I will continue cycling. That is what I have decided in recent weeks.”</span></p>\n<p><span>Tom Dumoulin is back to his best, and more importantly, he is enjoying what he does again.</span></p>\n<h4><b>Van Vleuten finally lands Gold</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1234251078-min_1024x1024.jpg?v=1627471691\" />Image credit: INA FASSBENDER/AFP via Getty Images</span></i></p>\n<p><span>The world witnessed one of the great Olympic surprises in recent memory when Anna Kiesenhofer — a woman without a professional cycling contract — won the women’s Olympic road race. The Austrian attacked just metres into the race to form part of the early breakaway, and the peloton never saw her again.</span></p>\n<p><span>It was a surprise, then, that Annemiek van Vleuten — one of the true stars of the sport — celebrated so emphatically when she crossed the finish line in second place. Later, she explained that she thought she’d won the gold medal, as did many of the other riders in the peloton.</span></p>\n<p><span>Despite the bittersweet day for Van Vleuten, she remained focused on the task at hand to win the first Olympic gold of her career. After the race, Van Vleuten said to Eurosport, “I knew after the road race I was in super great shape. Everyone was talking about everything else, nobody was talking about my performance. I shut off social media. I didn’t listen to anything.”</span></p>\n\n<p><span><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-most-dramatic-moments-in-women-s-olympic-road-race-history\">Related: Most dramatic moments in women's Olympic Road Race history</a></em></strong></span></p>\n<p><span>To remain totally undistracted from the road race and to direct all her energy on time-trial gold, may just be Van Vleuten’s best performance of the Tokyo Olympics.</span></p>\n<h4><b>Primož Roglič tosses adversity aside</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1234257658-min_1024x1024.jpg?v=1627471722\" />Image credit: GREG BAKER/AFP via Getty Images</span></i></p>\n<p><span>Primož Roglič has endured a year of adversity. Although he won the Itzulia Basque Country Tour in early April, he crashed whilst leading Paris-Nice before being forced to withdraw from the Tour de France after crashing early.</span></p>\n<p><span>However, Roglič realigned his objectives to the Olympic Games. He wasn’t able to compete for a medal in the road race, but that may have been a blessing in disguise. This allowed the Slovenian to sit up early and focus purely on the time-trial, whilst the likes of Wout van Aert were spending resources battling for a medal.</span></p>\n<p><span>Roglič led after the first lap, but the top six were split by just over 15 seconds. However, Roglic obliterated his rivals on the second lap of the Fuji course to eventually win by over one minute. </span></p>\n<p><span>After suffering setbacks in his major goals so far, Roglič’s ride was the definition of a bounce back performance.</span></p>\n<h4><b>Dygert must remain patient</b></h4>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1331077557-min_1024x1024.jpg?v=1627471949\" /></span><em><span>Image credit: Tim de Waele/Getty Images</span></em></p>\n<p><span>Chloé </span><span>Dygert was one of the big favourites entering the 2020 World Championship time trial. However, the American lost control and crashed over a roadside barrier, suffering a severe leg injury.</span></p>\n<p><span>The American had won the 2019 World Championships by a stunning 92 seconds at the age of just 22. It is no wonder, then, that so much has been made of her comeback.</span></p>\n<p><span>It is now clear that Dygert is not quite at the same, other worldly level, yet. The American finished just over two minutes behind Van Vleuten to claim seventh place in Fuji.</span></p>\n<p><span>However, this should be seen as a step forward rather than anything negative for Dygert, who is now left with a sizeable scar on her leg, which more closely resembles a shark bite than any mark left by a cycling accident.</span></p>\n<p><span>The 24-year-old must remain patient as she finds her best form. Afterall, time is on her side.</span></p>\n<h4><b><span>Küng</span>'s Luck must Turn</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1234255740-min_1024x1024.jpg?v=1627472159\" /></b><em>Image credit: JASPER JACOBS/BELGA MAG/AFP via Getty Images</em></p>\n<p>Fourth place can be the most painful finish – the highest position an athlete can finish at the Olympic Games without a medal. But the heartbreak of missing out on the podium is elevated to a new level when the time difference is the smallest of margins.</p>\n<p><span>Over 44.2km, 750 metres of climbing and 56 minutes of racing, less than a second separated <span>Stefan Küng</span> from a place on the podium. He was also just three seconds behind Tom Dumoulin in the silver medal position.</span></p>\n<p><span>It’s not the only major near miss for <span>Küng</span><span> </span>this year, who finished second on stage 5 of the Tour de France to <span>Tadej Pogačar</span> weeks ago. He was also runner-up to Wout van Aert in the Tirreno-Adriatico time-trial in March.</span></p>\n<p><span>The reigning European and Swiss time-trial champion clearly has bags of class which is evident by his seven World Tour victories. However, the 27-year-old has never won a WT race outside of Switzerland or Belgium. A turn of luck, and a prestigious victory, will surely come <span>Küng's</span><span> </span>way soon.</span></p>\n<p><em><span>Cover image: Michael Steele/Getty Images</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"5029a1d7e48e4db29d4212a9b9da0c93a43527e664309b9cac4d63ba87644ed4","category":"Cycling"}