{"title":"Acclimation to moderate temperatures can have strong negative impacts on heat tolerance of arctic arthropods","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14573?af=R","date":1716181517000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/bad7978b-9436-4da5-ac7b-15281c9b02f0/fec14573-toc-0001-m.png\" alt=\"Acclimation to moderate temperatures can have strong negative impacts on heat tolerance of arctic arthropods\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/05/01/arctic-insects-mites-and-springtails-are-negatively-affected-by-prolonged-exposures-to-moderate-temperatures/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe Arctic is impacted by some of the fastest temperature changes observed on Earth, but the impact on the terrestrial arthropod fauna is unclear. Acute physiological thermal limits of terrestrial ectotherms from high latitudes often exceed the local air temperatures, suggesting that they may be able to cope with increasing temperatures. However, knowledge on how Arctic terrestrial arthropods cope with elevated temperatures for longer periods is lacking.\n\nHere we investigate how acclimation temperature and exposure time affect the acute physiological heat tolerance of five terrestrial arthropod species (<i>Neomolgus littoralis</i>, <i>Megaphorura arctica</i>, <i>Nysius groenlandicus</i>, <i>Psammotettix lividellus</i> and <i>Nabis flavomarginatus</i>) immediately after collection in Arctic and sub-Arctic habitats.\n\nWe show that although acute heat tolerances are relatively high, even exposure to moderate (temperature span assessed ca. 3–29°C) acclimation temperatures for a 24 h period have strong negative effects on heat tolerance for four of the five species. Similarly, exposure time negatively affected heat tolerance, but depending on species and temperature.\n\nTogether our results suggest that exposure to even moderately elevated temperatures for periods of 24 h or even shorter can lead to lower acute heat tolerance for cold adapted terrestrial arthropod species from sub-Arctic and Arctic regions. Consequently, climate change leading to extended periods of mildly elevated temperatures may have strong negative effects on these species. We argue that this aspect is currently overlooked when assessing the ability of arthropods from Arctic and sub-Artic regions to cope with climate changes as such predictions are typically based on acute heat tolerance estimates and with the assumption of beneficial acclimation responses.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/05/01/arctic-insects-mites-and-springtails-are-negatively-affected-by-prolonged-exposures-to-moderate-temperatures/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Jesper Givskov Sørensen, \nNatasja Krog Noer, \nTorsten Nygaard Kristensen, \nSimon Bahrndorff","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"502c8764c82aacc76617334c7ef9df685da77876d70be64358cc329acd1a8d6e","category":"Environment"}