{"title":"★ Ahead of Season 1 Finale, Apple Has Made the Entire First Episode of ‘Silo’ Free — on Twitter","link":"https://daringfireball.net/2023/06/apple_silo_twitter","date":1687992039000,"content":"\n<p><a href=\"https://twitter.com/AppleTV/status/1673730750095712256\">Apple TV, yesterday on Twitter</a>:</p>\n\n<blockquote>\n  <p>3 days until the #Silo finale.</p>\n\n<p>Here’s the entire first episode.</p>\n</blockquote>\n\n<p>Embedded right in that promoted tweet is the entire series premiere.<sup><a href=\"#fn1-2023-06-28\">1</a></sup></p>\n\n<p>Putting aside, for this paragraph, the politics surrounding Twitter, this is a rather interesting promotional move. You can watch the premiere episodes for all Apple TV+ original series for free in the Apple TV app: <em>Silo</em>, <em>Ted Lasso</em>, <em>Severance</em>, <em>The Morning Show</em>, <em>Hijack</em> (the new thriller starring Idris Elba) — all of them. It’s an obvious strategy: get hooked on even one of these premieres and it costs just $5/month to watch the rest. The biggest obstacle to any streaming service is just getting someone to <em>try</em> it. Everyone with an iPhone or iPad or Mac already has the Apple TV installed, and a lot of people already have the app on their TVs or set top boxes. But Apple isn’t linking from Twitter to the TV+ app — they’ve shared the entire episode right on Twitter itself. Not YouTube, not Facebook. Twitter. That wasn’t even technically possible <a href=\"https://techcrunch.com/2023/05/18/twitter-now-allows-paid-users-to-upload-two-hour-long-videos/\">until last month</a>.</p>\n\n<p>But asking anyone today to put aside the politics of Twitter is a bit like the old “<em>But other than that, how’d you enjoy the play, Mrs. Lincoln?</em>” joke. There is a number one user on Twitter, and that user is Elon Musk, and his politics and policies are veering <a href=\"https://thehill.com/homenews/4061600-musk-says-cis-cisgender-considered-slurs-on-twitter/\">more toxic</a>, not less, as time goes on. Advertising is fundamentally about paying to reach an audience, not an endorsement of content, but at some level it’s a partnership. Publishers and platforms reject objectionable ads, and advertisers eschew objectionable platforms. Where is that line for Apple with Twitter?</p>\n\n<p>Musk, unsurprisingly, <a href=\"https://twitter.com/elonmusk/status/1673831774038949888\">seems exultant</a> over Apple’s <em>Silo</em> promotion, which includes a custom <a href=\"https://www.macrumors.com/2023/05/30/wwdc-2023-hashflag/\">hashflag</a> icon. And here’s no less an influencer than MrBeast, Jimmy Donaldson, <a href=\"https://twitter.com/MrBeast/status/1673850123967770624\">replying to Musk</a>: “Really is a smart move, I never would have heard of this show and now I’m watching episode 1 and invested lol.” If you’re wondering why Apple would even <em>consider</em> continuing to advertise on Twitter, there’s your answer: the platform still has tremendous reach.</p>\n\n<p>Apple spends a veritable fortune on advertising across a slew of mediums. But the only place where I see anyone asking “Why is Apple advertising <em>there</em>?” is Twitter. It’s hard not to think that Twitter, bereft of premium brand advertisers and looking to jumpstart its foray into hosting long-form video content, is getting more from this <em>Silo</em> promotion than Apple is getting from newfound viewers. It’s not the money (which Musk has plenty of), it’s the prestige (of which Twitter is by most accounts bankrupt). You can’t buy prestige, and Apple has chosen to bestow some on Twitter through this promotion. Is it <em>outrageous</em> that Apple continues to advertise on Twitter? I say no. But it feels a bit skeevy, and more than a little curious, that they choose to.</p>\n\n<div>\n<hr />\n<ol>\n<li>\n<p>I started watching <em>Silo</em> a few weeks ago and I like it a lot. Season one does a good job revealing a bit more of the overall mystery each week, while simultaneously doling out some answers along the way. Strong premise, good cast, good production values. It’s no <em>Severance</em> but it’s really good. (I feel the same way about <em>Foundation</em>, but I like <em>Silo</em> better.) It’s a good show and I’m glad it’s <a href=\"https://variety.com/2023/tv/news/silo-renewed-season-2-apple-1235643158/\">already been renewed for a second season</a>. In some alternate universe, <em>Silo</em> was <a href=\"https://www.netflix.com/title/80214497\">a show</a> on Netflix, where more people would have seen it but it <a href=\"https://www.theonion.com/netflix-condemns-wga-strike-for-putting-future-show-can-1850395744\">would have been cancelled nonetheless</a>. <a href=\"#fnr1-2023-06-28\">↩︎</a></p>\n</li>\n</ol>\n</div>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"50328f7d157f54d144acddc7197a0759252f1e8f7116f9c27ca15fefc3b1e968","category":"Tech"}