{"title":"65 Metagenomic analysis of ensiled grocery food waste","link":"https://academic.oup.com/jas/article/102/Supplement_3/304/7757366?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Vegetables and fruits are the main sources of plant fiber, minerals, and vitamins essential for human health. However, commercially manufactured foods which are not consumed end up in landfills and contribute to economic losses as well as to methane emissions, a global warming gas. Besides recycling food waste (FW) as compost to reduce unsaleable vegetables and fruits intended for landfill, it can be ensiled as an alternative source for a sustainable livestock feed. Metagenomics is the analysis of genetic material purified directly from environmental samples by sequencing and enables taxonomic identification of the microbial communities present. This study aimed to evaluate the silage produced with different mixtures (fruit, vegetables, bread, and bakery products) of FW after 60 d to evaluate microbial community and functional diversity. The FW was ground to a particle size of 1 cm<sup>2</sup> and three treatments in duplicates were obtained: control (refrigerated), sundried (exposed to sun) and passive-dried (inside the building). The DNA of the ensiled FW was extracted for two metagenomic sequencing approaches; specific regions sequencing including 16S rRNA (bacterial diversity), 18S rRNA (species differences in eukaryotes), internal transcribed spacer (ITS; for fungal classification) and shotgun sequencing. Specific coding region sequencing is more precise while shotgun sequencing can better identify the most abundant organisms. Therefore, we are using these two methods for comparative analysis and to enable us to capture the entire microbial community. Analysis of the metagenomic data are ongoing with the intention to characterize potential pathogenic bacteria and antimicrobial resistance genes within the ensiled FW to confirm that the ensiled FW is safe to feed to cattle. We are awaiting data for specific region sequencing. Overall, we expect to confirm if this approach is useful for silage analysis.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"50342879dcc3355e5ba9b712061d99b1601a1fae3ea07965160dc61b833dcd4c","category":"Environment"}