{"title":"Humble Bundle เตรียมบังคับแบ่งเงินให้บริษัท 15-30% จากเดิมบริจาคให้การกุศลได้ทั้งหมด","link":"https://www.blognone.com/node/123547","date":1625211230000,"content":"<div><div><div><p>Humble Bundle เว็บไซต์ขายเกมแบบยกแพ็ก ที่ให้ผู้ใช้จ่ายเท่าไรก็ได้ตามที่ต้องการ แต่จะมีเกมพิเศษให้ หากจ่ายเกินขั้นต่ำ ก่อนหน้านี้เคยให้ผู้ใช้สามารถเลือกบริจาคเงินทั้งหมด 100% ให้กับการกุศล โดยไม่แบ่งให้ผู้จัดจำหน่ายหรือเว็บ Humble Bundle ได้</p>\n<p>ระบบนี้จะมีเปลี่ยนแปลงภายในกลางเดือนกรกฎาคม ให้ผู้ใช้ต้องแบ่งเงิน 15-30% ให้กับเว็บไซต์ Humble Bundle และส่วนแบ่งนี้จะแตกต่างกันไปในแต่ละชุดเกม แต่ Humble Bundle ยืนยันว่าจะมีเกมจัดชุดกรณีพิเศษ ที่ยังบริจาคเงินให้การกุศล 100% อยู่ คล้ายคลึงกับชุด <a href=\"https://www.blognone.com/node/115588\">Humble Heal COVID-19</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ccd9ad212d068ad3e25d6f44f47ee8e9.jpg\" /></p>\n<p>Humble Bundle บอกว่าหน้า UI และสไลเดอร์ในการปรับเงินส่วนแบ่ง จะเขียนระบุชัดเจนว่าผู้ใช้ต้องแบ่งเงินเท่าไรให้เว็บไซต์เป็นขั้นต่ำ พร้อมบอกว่าโลกของสโตร์ขายเกมบนพีซีเปลี่ยนไปมาก การทำให้แน่ใจว่าเว็บไซต์ยังมีรายได้อยู่ แปลว่าทีมงานจะสามารถลงทุนกับคอนเทนต์ใหม่ๆ ทำให้ชุมชนชาว Humble เติบโต เพื่อนำเงินไปสู่องค์กรการกุศลเพิ่มมากขึ้นได้ในอนาคต</p>\n<p>Humble Bundle เคยทดสอบนำสไลเดอร์ที่มอบเงินให้การกุศล 100% ออก สำหรับผู้ใช้บางคน ในเดือนเมษายนที่ผ่านมา แต่การที่ไม่แจ้งล่วงหน้าทำให้เกิดประเด็นดราม่า ซึ่ง Humble Bundle ก็<a href=\"https://blog.humblebundle.com/2021/04/23/a-note-about-sliders-and-our-bundle-pages/\">ออกมาเขียนบล็อกขอโทษ และชี้แจง</a>ในภายหลัง ก่อน<a href=\"https://blog.humblebundle.com/2021/05/05/an-update-on-bundle-sliders/\">อัพเดตนำสไลเดอร์กลับมาชั่วคราวในเดือนพฤษภาคม</a> และแจ้งการเปลี่ยนแปลงส่วนแบ่งใน<a href=\"https://blog.humblebundle.com/2021/07/01/changes-coming-to-humble-bundle-sliders/\">บล็อกล่าสุดของเดือนนี้</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/5c1b6742abf835600a64dec932aefdf1.png\" /></p>\n<p>Humble Bundle เคยให้<a href=\"https://arstechnica.com/gaming/2010/05/the-greatest-indie-game-sale-ever-and-how-it-came-to-be/\">สัมภาษณ์กับ ArsTechnica</a> ในปี 2010 หลังเว็บเปิดตัวได้ไม่นาน ว่าแม้ผู้ซื้อจะเลือกบริจาคเงินทั้งหมดให้การกุศล ก็ยังถือว่าเป็นชัยชนะของบริษัทอยู่ อย่างไรก็ตาม Humble Bundle <a href=\"https://www.blognone.com/node/96274\">ขายกิจการให้ IGN ไปในปี 2017</a> และอาจเป็นไปได้ยากขึ้นเรื่อยๆ ในการทำร้านค้าเกมบนพีซีโดยไม่มีรายได้เข้าบริษัทแบบตายตัว</p>\n<p>ที่มา - <a href=\"https://blog.humblebundle.com/2021/07/01/changes-coming-to-humble-bundle-sliders/\">Humble Bundle</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/humble-bundle\">Humble Bundle</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5039f4768c344e6a93225376a6cef05f317c2be2b8e8a02b70d19ff938c714cd","category":"Thai"}