{"title":"Alena Tensor and Its Possible Applications in Unification Theories","link":"https://www.preprints.org/manuscript/202310.1872/v8","date":1719996265000,"content":"Alena Tensor is a recently discovered class of energy-momentum tensors that provides mathematical framework in which, as demonstrated in previous publications, the description of a physical system in curved spacetime and its description in flat spacetime with fields are equivalent. The description of a system with an electromagnetic field based on the Alena Tensor can be used to reconcile physical descriptions. In curvilinear description, EFE were obtained with Cosmological Constant related to the invariant of the electromagnetic field tensor, which can be interpreted as negative pressure of vacuum, filled with electromagnetic field. In classical description for flat spacetime, three densities of four-forces were obtained: electromagnetic, gravity, and the force responsible for the Abraham-Lorentz effect (radiation reaction force). There was obtained Lagrangian density and generalized canonical four-momentum, containing electromagnetic four-potential and a term responsible for other two forces. In the quantum picture, QED Lagrangian density simplification was obtained, and the Dirac, Schrödinger and Klein-Gordon equations may be considered as approximations of the obtained quantum solution. The distribution of charged matter was expressed as polarization-magnetization stress-energy tensor, what may explain why gravity is invisible in QED. The description used also leads to conclusion, that charged particles cannot remain at complete rest and that they should have spin. Obtained connection of Einstein tensor with gravity and radiation reaction force, after transition to curvilinear description, excludes black hole singularities. Farther use of Alena Tensor in unification applications was also discussed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"504a2c9be00fe5968f6fd3f61f06c6031465dc6a9a47b0c533cdf3c0eee13762","category":"Interdisciplinary"}