{"title":"A video monitoring and computational system for estimating migratory juvenile fish abundance in river systems","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10607?af=R","date":1715404866000,"content":"<h2>Abstract</h2>\n<p>Diadromous fishes migrate between marine and fresh waters for reproduction. For anadromous species, which spawn in freshwater, improved access to freshwater spawning and nursery habitats and ability of juveniles to emigrate to the ocean may support population recovery. Despite the potentially enormous influence of early life stage survival on adult population size, managers and scientists have limited capacity to assess numbers of juvenile anadromous fishes leaving freshwater ecosystems. Such data are critical for evaluating reproductive success and habitat suitability and have been identified as a top priority in anadromous fish research and management. We developed a state-of-the-art underwater video and computational system to collect videos to estimate abundances and migration timing for juvenile river herring (<i>Alosa pseudoharengus</i>; <i>Alosa aestivalis</i>). We collected continuous video in the Monument River (Bourne, Massachusetts, USA) from June to November 2017. We trained three types of neural network models to detect and count fish in video frames and evaluated model performance by comparing human counts to model outputs. Our top model assessed presence and absence (<i>F</i>1 = 87%) and counted fish (counting error 9.4%) with an accuracy comparable to human counters (<i>F</i>1 = 88%). Our system's capability to collect accurate counts of emigrating juveniles will provide critical information that could be related to the numbers of spawning adults, system-specific productivity, and spawning and nursery habitat suitability. Both the video collection system and computational model may be transferrable to other sites and for other species where tracking juvenile emigration may inform management efforts.</p>","author":"Meghna N. Marjadi, \nSidney Batchelder, \nRyan Govostes, \nAllison H. Roy, \nJohn J. Sheppard, \nMeghan‐Grace Slocombe, \nJoel K. Llopiz","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"504ed794229ddb9e06896a8ac70bdb7958cb516119b4d66128ce623a091fd48a","category":"Environment"}