{"title":"Addressing life expectancy and healthy life expectancy through environmental indicators: Novel dynamic autoregressive distributed lag estimation","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12498?af=R","date":1717723456000,"content":"<h2>Abstract</h2>\n<p>This study innovatively combines healthy life expectancy (LE) with traditional LE measures to shed light on environmental impacts on public health. Second, it utilizes the Markov chain Monte Carlo algorithm to model data until 2025; this is a new method in environmental health research. This study investigates the impact of environmental indicators on LE and healthy LE, a landmark piece of research that incorporates the latter in such analyses. The major harmful outcomes of economic growth, carbon emissions, and particulate matter 2.5 on both life expectancies are verified. In the kingdom of Saudi Arabia, post-Vision 2030 estimations show a low impact of these environmental factors, which implies that Vision successfully adjusted the environmental impacts. Notably, the ecological footprint's coefficient is insignificant in both models. These insights are crucial for shaping and refining environmental and health policies. The research addresses a gap in the literature, focusing on environmental health in Saudi Arabia. It considers CO<sub>2</sub>, particulate matter 2.5, and ecological footprints as key environmental indicators, acknowledging Saudi Arabia's role as a major fossil fuel producer and its consequent environmental challenges. The study also emphasizes the significant health risks posed by particulate matter. The inclusion of healthy LE as a dependent variable, alongside mortality, and the examination of Saudi Vision 2030's impact on environmental health further underline the study's comprehensive and innovative approach.</p>","author":"Ghazala Aziz, \nRida Waheed, \nSuleman Sarwar, \nMajid Ibrahim Alsaggaf, \nMohd Saeed Khan","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"50560a97a7bc70e644a78a9e2347be9a8d401813e5c381e7568da01a27d9cef7","category":"Environment"}