{"title":"Amazon liable for crash because software “micromanages” delivery drivers, victim says","link":"https://arstechnica.com/?p=1813138","date":1637003705000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-1325780600-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-1325780600.jpg\">Enlarge</a> <span>/</span> An Amazon delivery truck drives down a street in Anaheim, California. (credit: iStock)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Amazon is currently defending itself against a lawsuit that could determine whether it is liable for the actions of its contract delivery drivers.</p>\n<p>In March, Ans Rana was going to see his sister’s new house with his father and brother, who was driving a Tesla Model S, when they came upon a disabled vehicle on Interstate 75 outside Atlanta. Rana’s brother <a href=\"https://www.ajc.com/news/ksu-grad-fighting-for-his-life-weeks-after-crash-on-i-75/UCFY77PJZNAB7FW7L6V43L4P2Q/\">slowed</a> to a near stop, but the Amazon delivery van behind them apparently didn’t notice. The driver of the van was going nearly 14 miles per hour over the speed limit, Rana’s lawyers allege in a lawsuit. The van slammed into the rear of the Tesla with such force that it pushed the car into the left lanes of the interstate where it was struck by a Toyota Corolla before hitting the median barrier.</p>\n<p>Rana suffered life-threatening injuries, including a traumatic brain injury, and had to be placed on a ventilator. His spinal cord was also damaged, and he hasn’t been able to regain the use of his legs or arms despite months of therapy and rehabilitation.</p></div><p><a href=\"https://arstechnica.com/?p=1813138#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1813138&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"505bd3b7d28cd2910176484ed341754adba6a7c93351bde6f63f3041fd3281f5","category":"Tech"}