{"title":"Application of a crude digestive proteases preparation to improve the ripening of marinated fillets from low‐technological value Baltic herring (Clupea harengus membras L.)","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13358?af=R","date":1718348660000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>As a result of climate change (reduced the oxygen content and food available in the waters) and overfishing, ever larger batches of the herring catch are classified as low-value fish and used for feedstuff or canned food production. Fast and complete ripening of marinated fillets, especially from low-value Baltic herring, poses a problem because of the low muscle protease activity and changes in muscle tissue proteins.</p>\n<h2>RESULTS</h2>\n<p>For the first time, a crude digestive proteases preparation (CDPP) was obtained from herring viscera using a two-stage method consisting of ethanol extraction and then salt precipitation. CDPP had a reduced hemoglobin content, with optimum activity at pH 7.5–8.8 or 60–120 g kg<sup>−1</sup> NaCl. At pH 4–5, it still exhibited 24–68% of proteolytic activity. CDPP was used for 4–24 h of brining of fresh and frozen–thawed fillets or injection of fresh fillets before marinating. CDPP-brining increased especially cathepsin D and carboxypeptidase A activities, whereas it decreased cathepsin B and L activities in the marinades. CDPP-brining mitigated the negative effect of freezing–thawing on mass-yield, protease activity, protein hydrolysis, texture profile, colour and sensory quality of the marinated fillets. CDPP-injection was found to be the best method because it increased mass-yield and ripeness of the marinated fillets to a greater extent than CDPP-brining did. The marinades from the CDPP-treated fillets had no bitter taste as a result of the presence of hemoglobin or chymotrypsin, and there were no results indicating lipid oxidation.</p>\n<h2>CONCLUSION</h2>\n<p>The application of CDPP in marinating technology is a viable approach to enable the use of low-value herring in food production, shorten the marinating time, and improve the ripeness and sensory quality of meat. © 2024 Society of Chemical Industry.</p>","author":"Patryk Kamiński, \nMariusz Szymczak, \nBarbara Szymczak","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"5060cd03836bb64b3f8b62705e8fd37ab927b64701c1785b1915b5be313fe7e5","category":"Environment"}