{"title":"Climatic and environmental changes of ~100 thousand years: The mammals from the early Middle Pleistocene sequence of Notarchirico (southern Italy)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311623","date":1729692000000,"content":"<p>by Beniamino Mecozzi, Alessio Iannucci, Marco Carpentieri, Antonio Pineda, Rivka Rabinovich, Raffaele Sardella, Marie-Hélène Moncel</p>\r\n\r\nHere we revise all the paleontological sample of Notarchirico, including historical collections and new findings collected during 2016–2023 excavations. Notarchirico is one of the most significant sites for the study of human evolution and terrestrial ecosystem dynamics during the Early-Middle Pleistocene Transition, preserving nearly 100.000 years of environmental and climatic changes constrained between 695 ± 6 ka and 614 ± 12 ka. The deposit yielded the oldest human fossil of the Italian Peninsula, and one of the oldest European evidence of <i>Homo heidelbergensis</i>, as well as one of the earliest evidence of bifacial tools in western Europe, commonly associated with the Acheulean techno-complex. Our paleontological results revealed the presence of three different mammal complexes, documenting faunal dynamics in response of climatic driven-changes recognized during the early Middle Pleistocene. The lower complex (levels I2-G) indicates the dominance of wooded spaces, sparse steppes, and the existence of water bodies (lakes or ponds), indicating a deterioration of the fully interglacial conditions recorded during the end of MIS 17; the middle complex (levels G-C) with a low number of mammal remains can be attributed to the glacial conditions of MIS 16; the upper complex (levels B-above α) indicates an improvement in climate, transitioning towards the full interglacial conditions of the of MIS 15. The faunal sample of Notarchirico, based on its firm chronological setting, offers important data for the Biochronological Scheme of European Land Mammals, including one of the oldest records of <i>Palaeoloxodon antiquus</i> and <i>Cervus elaphus</i> in Europe, <i>Panthera spelaea</i> in southwestern Europe, <i>Dama</i> cf. <i>roberti</i> in Italian Peninsula, and one of the latest occurrences of <i>Bison schoetensacki</i> in Europe.","author":"Beniamino Mecozzi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"506a34e97cabec526d72fa5ab51fcccaa329dfd1354aa956a2b989064fd61375","category":"Interdisciplinary"}