{"title":"Roku warns customers: “Google may remove your access to YouTube TV“","link":"https://arstechnica.com/?p=1760079","date":1619454865000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/09/Roku-Express-with-Remote-800x470.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/09/Roku-Express-with-Remote.jpg\">Enlarge</a> <span>/</span> The new Roku Express with its remote. (credit: <a href=\"https://www.roku.com/\">Roku</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>YouTube TV is supposed to bring the best parts of cable TV to streaming, but it's also bringing one of the most annoying parts: <a href=\"https://arstechnica.com/tech-policy/2019/07/tv-blackouts-hit-record-high-as-customers-get-screwed-by-industry-squabbles/\">carriage disputes</a>.</p>\n<p>Roku and Google are apparently fighting over the terms of carrying YouTube TV on Roku's streaming platform. Roku has sent out an email blast to customers with a subject line saying, \"Google may remove your access to YouTube TV.\" If you can't already tell, we're getting a very one-sided take on the story right now. Google has yet to offer a response to Roku's first salvo, though we've asked for comment and will update this article if Google responds. <strong>Update:</strong> Google has responded, see below.</p>\n<p>Roku's email says, \"Recent negotiations with Google to carry YouTube TV have broken down because Roku cannot accept Google’s unfair terms, as we believe they could harm our users.\" Roku's email only vaguely alludes to what it is claiming Google wants, saying, \"We cannot accept Google's unfair and anticompetitive requirements to manipulate your search results, impact the usage of your data, and ultimately cost you more.\"</p></div><p><a href=\"https://arstechnica.com/?p=1760079#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1760079&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"50772866dc1edcec9016e6371ef25145cd7f3e95bd9a2f9a8565ac27c5ae0b5f","category":"Tech"}