{"title":"First lacustrine application of the diatom‐bound nitrogen isotope paleo‐proxy reveals coupling of denitrification and N2 fixation in a hyper‐eutrophic lake","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12627?af=R","date":1720463660000,"content":"<h2>Abstract</h2>\n<p>Past changes in the input/output, and internal cycling, of bioavailable nitrogen (N) in marine and lacustrine environments can be reconstructed by analyzing the N isotopic composition (δ<sup>15</sup>N) of organic matter in the sedimentary record. To verify, and eliminate, potential biases of bulk sedimentary δ<sup>15</sup>N (δ<sup>15</sup>N<sub>bulk</sub>) signatures by diagenetic alteration and external N inputs, we applied, for the first time, the diatom-bound N isotope (δ<sup>15</sup>N<sub>db</sub>) paleo-proxy to lake sediments. By comparing δ<sup>15</sup>N<sub>bulk</sub> and δ<sup>15</sup>N<sub>db</sub> in a sedimentary record from eutrophic Lake Lugano (Switzerland), we demonstrate that changing redox conditions influence the degree of N-isotopic alteration of the bulk sediment, emphasizing the need for caution when interpreting δ<sup>15</sup>N<sub>bulk</sub> in paleolimnological studies. Furthermore, in combining δ<sup>15</sup>N<sub>db</sub> measurements with X-ray fluorescence scanning and state-of-the-art molecular biomarker analyses, we reconstruct nutrient cycling and paleoenvironmental conditions in the lake over the past ~ 125 yr. Coeval with the period of severe eutrophication in Lake Lugano in the 1960s, our proxy data indicate that export production, δ<sup>15</sup>N<sub>db</sub>, and the concentration of heterocyst glycolipids (a biomarker for N<sub>2</sub>-fixing cyanobacteria) increased simultaneously. Together, these data suggest that the rise in δ<sup>15</sup>N<sub>db</sub> is likely the result of enhanced water-column denitrification in response to increased phytoplankton productivity. We hypothesize that greater export production during eutrophication led to anoxic conditions in the hypolimnion as a result of enhanced organic matter remineralization, raising water-column denitrification. Enhanced N loss and remobilization of phosphorous (P) from the sediments under anoxic conditions lowered the N : P ratio in the lake, fostering cyanobacterial N<sub>2</sub> fixation in surface waters.</p>","author":"Anja S. Studer, \nLars Wörmer, \nHendrik Vogel, \nNathalie Dubois, \nMaciej Bartosiewicz, \nKai‐Uwe Hinrichs, \nFabio Lepori, \nMoritz F. Lehmann","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"507f42dea4a15d8b74226ff1a68bbe33a34a6bb996888eed1d214bfb3fe7e77b","category":"Environment"}