{"title":"Chinese company wins race for first methane-fueled rocket to orbit","link":"https://arstechnica.com/?p=1953453","date":1689196647000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/zq2-1-800x545.jpeg\" alt=\"A Zhuque-2 rocket developed by the Chinese company LandSpace lifts off from its launch pad late Tuesday (US time).\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/zq2-1.jpeg\">Enlarge</a> <span>/</span> A Zhuque-2 rocket developed by the Chinese company LandSpace lifts off from its launch pad late Tuesday (US time). (credit: <a href=\"https://mp.weixin.qq.com/s/RkHAc7B3nMKyTct_SIvcLw\">LandSpace</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A commercial Chinese firm named LandSpace launched its Zhuque-2 rocket late Tuesday and made history as the first company to send a methane-fueled launcher into orbit, beating a bevy of US vehicles to the milestone.</p>\n<p>LandSpace launched the Zhuque-2 rocket at 9 pm ET Tuesday (01:00 UTC Wednesday) from the Jiuquan spaceport, a military-run facility in the Gobi Desert of northwestern China. The company called the launch a success in a press release, and <a href=\"https://twitter.com/TSKelso/status/1679035923651264513?s=20\">publicly available US military tracking data</a> confirmed the rocket reached an orbit at an average altitude of about 280 miles (450 kilometers).</p>\n<p>“The flight mission was completed according to the procedure, and the launch mission was a complete success,” LandSpace said. “The (Zhuque-2) rocket is the world's first liquid oxygen methane rocket that successfully entered orbit, and it is also the first launch vehicle in domestic civil and commercial aerospace to successfully enter orbit based on a self-developed liquid engine.”</p></div><p><a href=\"https://arstechnica.com/?p=1953453#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1953453&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"50888b40322b90dc42cbda9a0d25a9925365c0e99f113eade2d1ad9d116e818d","category":"Tech"}