{"title":"Manga D’Auteur: The Witches Cycle Chapter 1 and Tony Concrete on the Series – Tony Concrete","link":"https://theradavist.com/bikepacking-manga-the-witches-cycle/","date":1704888024000,"content":"<p><em>The Witches Cycle is French artist <a href=\"https://www.instagram.com/concrete.road/\" target=\"_blank\">Tony Concrete</a>‘s latest creation, a bikepacking-themed manga that follows the lives of two witches, Vera and Mary. Set in a fictionalized territory on the border of France and Germany, the two witches have taken an oath to use their powers to protect the natural world from the encroachment of concrete, using bikes instead of broomsticks, while also confronting the real-world dilemmas of money, friendship, and social-political issues.  </em></p>\n<p><em>We’re beyond thrilled to announce that The Radavist will be sharing all installments from The Witches Cycle, starting today with Chapter 1. Find the first issue by scrolling through the gallery, and read on below for some background on the series from the creator.</em></p>\n<p><span></span></p>\n<p><em>The Witches Cycle</em> is work of fiction that I crafted independently, exercising complete artistic freedom before proposing it for publication. The series is a long-running manga that follows the lives of Vera and Mary over several months. Identifying as witches, Vera and Mary have made it their mission to take care of the region they live in. On their bikes, they ride through their territory to regulate the flow of energy. They lead the precarious lives of young adults sharing an apartment. Vera tries to escape the world of work so she can devote herself entirely to her mission, and she lives on welfare and shoplifts to minimize expenses. Meanwhile, Mary juggles odd jobs and video games but compensates for her lack of time with an extraordinary talent for magic. <em>The Witches Cycle</em> narrates the story of the witches’ battle against the curse of concrete!</p>\n<p>And now, I’ll answer a few questions!</p>\n<p><img loading=\"lazy\" width=\"1880\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-2.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-2.jpg?w=1880&amp;quality=75 1880w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-2.jpg?resize=1024,726&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-2.jpg?resize=768,545&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-2.jpg?resize=1800,1276&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-2.jpg?resize=1335,947&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-2.jpg?resize=700,496&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-2.jpg?resize=1536,1089&amp;quality=75 1536w\" /></p>\n<h3>Tony Concrete? Who’s That?</h3>\n<p>Tony Concrete is a pseudonym I recently adopted. Previously, I used my last name, but it sounded a lot like another French artist, causing confusion. Since my Instagram page is named <a href=\"https://www.instagram.com/concrete.road/\" target=\"_blank\">Concrete Road</a> (a nod to a Ghibli anime), I decided on the pen name Tony Concrete. I hope it doesn’t sound too silly for English speakers…</p>\n<p>To put it simply, I’m trying to draw « manga d’auteur». For a long time, nobody wanted to publish this kind of project, but I was able to develop my work through artist residencies. That’s how I came to create <em>The Concrete Temples</em>, a series of stories about mysterious, cursed buildings. <em>The Witches Cycle</em> is part of this series.</p>\n<p>I’ve been living in Alsace, a French region on the border with Germany, for about ten years. During this time, I’ve explored the area on my bike, and I’ve put the landscapes that amazed me into <em>The Witches Cycle</em>.</p>\n<p><img loading=\"lazy\" width=\"1880\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-72.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-72.jpg?w=1880&amp;quality=75 1880w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-72.jpg?resize=1024,726&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-72.jpg?resize=768,545&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-72.jpg?resize=1800,1276&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-72.jpg?resize=1335,947&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-72.jpg?resize=700,496&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-72.jpg?resize=1536,1089&amp;quality=75 1536w\" /></p>\n<h3>What is your relationship with cycling?</h3>\n<p>I love cycling, but I’m primarily an artist before a cyclist. I discovered the world of bikepacking when I was an art school student, probably around 2010. I was immediately captivated by the aesthetic dimension of this universe. I remember seeing incredible rigid 29+ bikes on Tumblr, with custom-made saddlebags, frame bags, and handlebar bags, and thinking, “This is the most beautiful thing in the world.” That’s when the idea of creating comics centered around adventure cycling took root in me.</p>\n<p>At that time, bikepacking wasn’t a thing in France, so it was an interest I couldn’t share with anyone. I traveled on a lousy Decathlon aluminum MTB with German bags while drooling over prollyisnotprobably.com. In 2014, I moved after my studies and was finally able to get a Surly ECR, which I still ride. At that time, I did a lot of solo riding, it was an incredible pleasure to discover a wonderful region on a wonderful bike.</p>\n<p>In 2017 I started the Instagram account @concrete.road, with the idea of paving the way for a comic that would mix science fiction and bikepacking (this project is still in the works). Thanks to this Instagram page, I was invited to join the adventure team of the German manufacturer <a href=\"https://tout-terrain.de/en/\" target=\"_blank\">Tout Terrain</a> for a few years (they are located super close to my city). They provided me with an Outback model, which I rode in Norway for scenery research for my comic and in Japan for research on sports manga. From then on, I had two fantastic bikepacking rigs in size M, allowing me to start bringing people along and introducing my friends to adventure cycling. During these trips, I took a lot of photos, which I now use as documentation for my drawings. So it’s not surprising to find my bikes pictured in my manga. Speaking of which, a question of lore arises: how do Vera and Mary, who are supposed to be broke, ride such expensive bikes? Don’t worry, there’s an explanation, and I hope to have the opportunity to tell you that story someday.</p>\n<p><img loading=\"lazy\" width=\"1880\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-15.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-15.jpg?w=1880&amp;quality=75 1880w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-15.jpg?resize=1024,726&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-15.jpg?resize=768,545&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-15.jpg?resize=1800,1276&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-15.jpg?resize=1335,947&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-15.jpg?resize=700,496&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-15.jpg?resize=1536,1089&amp;quality=75 1536w\" /></p>\n<h3>How did the idea for <em>The Witches Cycle</em> come about?</h3>\n<p>When I settled in Alsace, I was obsessed with the ancient nuclear power plant on the border between France and Germany, which has since been shut down. I had started writing a story where witches mobilized to prevent a nuclear catastrophe. My main inspiration was the manga <a href=\"https://www.tcj.com/reviews/witches-the-complete-collection/\" target=\"_blank\"><em>Witches</em> by Daisuke Igarashi</a>. Of course, I also wanted to include bikes, so I imagined they could fly on them like broomsticks. I was thinking about portraying witches with spectacular powers, inspired by <em><a href=\"https://www.imdb.com/title/tt0097814/\" target=\"_blank\">Kiki’s Delivery Service</a></em>, or weird magical girl anime like <em><a href=\"https://www.imdb.com/title/tt1773185/\" target=\"_blank\">Puella Magi Madoka Magika</a></em>.</p>\n<p>However, as I researched witchcraft past and present, I thought it would be more interesting to portray contemporary witches. People who, like every one of us, are involved in belief systems based on their rationality. People who, like everyone else, claim to be able to alter the flow of causality through their practices.</p>\n<p><img loading=\"lazy\" width=\"933\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-18.jpg?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-18.jpg?w=933&amp;quality=75 933w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-18.jpg?resize=768,1097&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-18.jpg?resize=700,1000&amp;quality=75 700w\" /> <img loading=\"lazy\" width=\"933\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-19.jpg?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-19.jpg?w=933&amp;quality=75 933w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-19.jpg?resize=768,1097&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-19.jpg?resize=700,1000&amp;quality=75 700w\" /></p>\n<h3>Are you sure it’s really a bike comic, or is it actually about something else?</h3>\n<p>The Witches Cycle talks about the magic of cycling, the indescribable sacred feeling one can experience in certain landscapes. But it’s indeed also a comic about many other things; friendship primarily. The intense relationships formed around a shared passion. The life of a <a href=\"https://en.wikipedia.org/wiki/NEET\" target=\"_blank\">NEET</a>, of which I have extensive experience. And it tackles all kinds of contemporary issues: the world of work, justice, land use policy, and environmental activist struggles… There will even be an attempt to explain the invention of fidget spinners.</p>\n<p>My characters’ lives are a big mix of those of the people around me. Many are people trying to do creative things, it’s a predominantly white milieu, children from good families choosing to live unconventional lives—a milieu that might somehow resemble the cycling community. Through Vera and Mary, I’ve tried to paint a panorama of the world I perceive around me. It’s obviously a very limited perception, at the intersection of my generation, my social milieu, and my territory. Moreover, as I’m either at home drawing or out on my bike, there are a lot of things I don’t perceive. So consider it a vision full of blind spots.</p>\n<p><img loading=\"lazy\" width=\"1880\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-30.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-30.jpg?w=1880&amp;quality=75 1880w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-30.jpg?resize=1024,726&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-30.jpg?resize=768,545&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-30.jpg?resize=1800,1276&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-30.jpg?resize=1335,947&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-30.jpg?resize=700,496&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-30.jpg?resize=1536,1089&amp;quality=75 1536w\" /></p>\n<h3>Is the French social system really like in your comic?</h3>\n<p>In my comic, it’s not exactly France. Rather, this story takes place in an imaginary administrative district straddling France and Germany, with caricatured rules and laws. So don’t take the information in this comic at face value. When I started writing this story, I also wanted to issue a kind of warning against certain neoliberal developments that were taking shape. For example, in my comic, Vera has to work for free to keep her welfare benefits. When I wrote it, it seemed absurd. But I was very slow to draw, and in the meantime the Macron government succeeded in making free work a reality. Personally, I benefited for a long time from social help, which allowed me to dedicate a lot of time to building my work. Without such a system, I couldn’t have created this comic.</p>\n<p><img loading=\"lazy\" width=\"933\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-31.jpg?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-31.jpg?w=933&amp;quality=75 933w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-31.jpg?resize=768,1097&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-31.jpg?resize=700,1000&amp;quality=75 700w\" /> <img loading=\"lazy\" width=\"933\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-32.jpg?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-32.jpg?w=933&amp;quality=75 933w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-32.jpg?resize=768,1097&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-32.jpg?resize=700,1000&amp;quality=75 700w\" /></p>\n<h3>Are you some kind of witch yourself?</h3>\n<p>Just like my characters, I cycle around my region hoping to change the world by practicing an art that nobody believes in, but the parallel ends there. I’m not a witch, but it’s a symbol I try to treat with deference. It’s a complicated figure, caution and delicacy are necessary, especially in my position. I know it’s important to many people, and incomprehensible to many others. Among those who claim the figure of the witch, there are groups with absolutely opposing political beliefs. The witch is a tutelary figure in feminist and anti-capitalist circles, but at the same time, European paganism is being recuperated by the extreme right. What’s more, while witchcraft can be a vehicle for empowerment, magic is also close to sectarian or ideological aberrations, and the tipping points are sometimes blurry. I hope to be able to convey the complexity of this situation, even if it means putting aside my belief systems to stand by my characters. I tried to design a coherent magical system for them, inspired by some of the practices I researched. But in my drawings, I avoid directly incorporating elements from specific traditions, as I would fear betraying them. Instead, I aim to describe a very personal magical practice, which would be specific to my characters.</p>\n<p><img loading=\"lazy\" width=\"933\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-76.jpg?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Witches-Cycle-76.jpg?w=933&amp;quality=75 933w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-76.jpg?resize=768,1097&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Witches-Cycle-76.jpg?resize=700,1000&amp;quality=75 700w\" /></p>\n<p><em>Thanks to John, Josh, Spencer, and everyone who makes this publication possible. Thanks to Mercedes, who works as a translator and agent on this project. Thanks to Damian who took care of me at Tout Terrain. Special thanks to Anaïs, the editor in charge of the French version of this project. A big kiss to my friends in Strasbourg. Special thanks to the people who have <a href=\"https://www.patreon.com/concreteroad\" target=\"_blank\">supported me on Patreon</a> over the last few years.</em></p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"508be41eed304b387584127fbfd43e5f31eb90e0869bcf3b95fe497aee8519e1","category":"Cycling"}