{"title":"The Yellow Jersey at the Tour de France - A Brief History","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-yellow-jersey-at-the-tour-de-france-a-brief-history","date":1624890460000,"content":"\n      <p><span>The yellow jersey, or <em>maillot jaune</em>, is easily the most recognisable jersey in pro cycling. That hasn't always been the case, though.</span></p>\n<div></div>\n<p><span>In modern pro cycling, the yellow jersey is given to the leader of the general classification at the Tour de France.</span></p>\n<p><span>However, it has not always been used at the Tour. In the first edition of the Tour de France in 1903, which was won by Maurice Garin, the leader of the race was instead signified by a green armband.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Tour de France 2021 Guide</a></strong></em></p>\n<p>Officially, Eugène Christophe became the first rider to wear the yellow jersey over fifteen years later at the 1919 Tour de France. At that point, the Tour de France hadn't taken place since 1914 due to the first World War, and Director of the Tour de France — Henri Desgrange — decided that the event should display the leader more clearly to both spectators and other competitors. L'Auto, the organising newspaper, used yellow paper at the time, so the leader's jersey became yellow.</p>\n<p><span>However, there are some doubts over when the yellow jersey tradition was genuinely introduced. Belgian cyclist <span>Philippe Thys</span> was a three-time winner of the Tour de France between 1913 and 1920. After his retirement, he claimed that in 1913, Desgrange asked him to wear a yellow jersey as the race leader, though Thys declined.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-56227190_1024x1024.jpg?v=1624883270\" /></span></p>\n\n<p><em><span><span>Tour de France winner Philippe Thys. </span>Photo credit: Roger Viollet via Getty Images</span></em></p>\n<p><span>At first, </span>Eugène Christophe<span> was not satisfied when Desgrange asked him to wear the yellow leader's jersey, complaining that both spectators and his rivals mocked him because he looked like a canary.</span></p>\n<p><span>Nowadays, the yellow jersey is the most sought after jersey in cycling. </span><span>Mathieu van der Poel won his first yellow jersey after a jaw-dropping display on the <span>Mûr-de-Bretagne at the 2021 Tour de France. </span></span><span>Before the race, Van der Poel said, “taking the yellow jersey is, I think, a dream of almost every rider.” </span></p>\n<p>From looking like a canary to the pinnacle of the sport. Quite the contrast, eh.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1232277_f916570f-03ba-4ee4-b6af-464fe5764674_1024x1024.jpg?v=1624890683\" /></p>\n<p><em>Miguel Indurain. Photo: Mike Powell/Getty Images</em></p>\n<h4>\n<strong>Who has won the most yellow jerseys?</strong> </h4>\n<p>Before the 2021 edition of the Tour de France, 2,187 yellow jerseys had been officially awarded. Eddy Merckx has claimed the most yellow jerseys across his career, winning 96. Bernard Hinault and Miguel Indurain are second and third on the list with 75 and 60, whilst Chris Froome is the highest active rider with 59.</p>\n<ol>\n<li><span>Eddy Merckx - 96 </span></li>\n<li><span>Bernard Hinault - 75</span></li>\n<li><span>Miguel Indurain - 60</span></li>\n<li><span>Chris Froome - 59</span></li>\n<li><span>Jacques Anquetil - 50</span></li>\n<li><span>Antonin Magne - 38</span></li>\n<li><span>Nicolas Frantz - 37</span></li>\n<li><span>Philippe Thys - 37</span></li>\n<li><span>Andre Leducq - 35</span></li>\n<li><span>Louison Bobet - 34</span></li>\n</ol>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Eddy_Merckx_1969_01-3_1024x1024.jpg?v=1624890817\" /></p>\n<p><em>Eddy Merckx holds the record for winning the most yellow jerseys in his career. Photo: OffSide/L'Equipe</em></p>\n<p>Fabian Cancellara has won the most yellow jerseys while never winning the general classification at the Tour de France. ‘Spartacus’, won 29 yellow jerseys between the years of 2004 and 2015.</p>\n<ol>\n<li><span>Fabian Cancellara - 29</span></li>\n<li><span>Rene Vietto - 26</span></li>\n<li><span>Thomas Voeckler - 20</span></li>\n<li><span>Andre Darrigade - 19</span></li>\n<li><span>Rudi Altig - 17</span></li>\n</ol>\n<p><span><span>After claiming yellow on stage 20 of last year’s Tour de France, Tadej Pogačar is one of only four riders to have won the general classification of the Tour while wearing</span></span><span><span> the yellow jersey for just two days across his career. Jean Robic, Charly Gaul and Jan Janssen are the other three riders to have achieved the feat.</span></span></p>\n<p><i><span>Cover image: <span>A.S.O./Pauline Ballet</span></span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"5098d2a58bb3418c89e456d7460bca6b3b972adb21104c8e358fbf10fa8fd98e","category":"Cycling"}