{"title":"Variation in RNA interference sensitivity in the southern pine beetle, Dendroctonus frontalis (Coleoptera: Curculionidae)","link":"https://academic.oup.com/biolinnean/article/142/2/147/7603854?rss=1","date":1707350400000,"content":"<span><div>Abstract</div>Intraspecific genetic variation underpins many evolutionary processes and phenomena. For species considered pests, the dynamics of how genetic variation is distributed geographically take on a greater importance, because they can impact pest-management strategies directly. This is particularly true when management strategies are genetic in nature, such as population manipulation via RNA interference (RNAi; a naturally occurring antiviral response that disrupts translation of messenger RNAs into proteins to silence genes). Using RNAi for gene silencing is highly species specific; however, the efficacy of this approach in geographically distinct populations of widespread pest species has not been evaluated comprehensively. Here, we present a preliminary study evaluating differential susceptibility of geographically disparate populations of southern pine beetle, <span>Dendroctonus frontalis</span>, to RNAi. Although the efficacy of RNAi has been demonstrated in localized populations, <span>D. frontalis</span> has a broad distribution across North and Central America and is expanding its range owing to climate change. We observe differences in response between and within geographically distinct populations from its core range and recently expanded range. Our findings have broad implications for the use of RNAi as a management tool in widely distributed species and highlight the need for a deeper understanding of intraspecific genetic variation in this species and others.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"509df89eada19c206c3829c54a19f771334f597f566853b315d39541aeb5bd31","category":"Environment"}