{"title":"Retrospective Longitudinal Observational Study on The Long-Term Effects of Sodium-Glucose Cotransporter-2 Inhibitors on The Development of Metabolic Dysfunction-Associated Steatotic Liver Disease in Type 2 Diabetic Japanese Patients","link":"https://www.preprints.org/manuscript/202407.1916/v1","date":1721802455000,"content":"Background/Objectives: The global burden of metabolic dysfunction-associated steatotic liver disease (MASLD) is increasing at an alarming rate. Cardiovascular disease (CVD) is the leading cause of mortality in MASLD patients, therefore, the therapeutic interventions for MASLD should improve coronary risk factors such as obesity, diabetes and dyslipidemia, in addition to improving liver function. The evidence on effect of sodium-glucose cotransporter 2 inhibitors (SGLT2is) which have beneficial pharmacological properties for MASLD, especially the long-term effects, on the progression of MASLD in Asian population is very limited. Methods: The retrospective longitudinal study was performed by using the medical records at the National Center for Global Health and Medicine, Kohnodai Hospital, Japan. We picked up patients with type 2 diabetes who had taken SGLT2is for at least 3 years or longer between April 1, 2014 and March 31, 2018. We collected the data on metabolic parameters, including blood tests and anthropometric parameters, and compared the data before and after the initiation of SGLT2is treatment. Results: During the observation period, 324 patients had taken SGLT2is for 3 years. The 3-year-SGLT2is treatment significantly reduced body weight, hemoglobin A1c, low-density lipoprotein-cholesterol, triglyceride and non-high-density lipoprotein-cholesterol (HDL-C) and significantly increased HDL-C. Furthermore, this treatment significantly improved liver function and the markers for hepatic steatosis and hepatic fibrosis. Conclusions: Considering that the development of CVD determines the prognosis of MASLD patients, the long-term SGLT2is treatment may be an ideal therapy for MASLD patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"50a0dc8d2b87d9a541dea7daef6597b1352ddec7f741e2c52284b2b81e4c1843","category":"Interdisciplinary"}