{"title":"Smart Manufacturing and Pro-Environmental Behaviour: A Moderated Serial Mediation Model","link":"https://www.preprints.org/manuscript/202404.0457/v1","date":1712460644000,"content":"Smart manufacturing encompasses a category of manufacturing that employs computer-integrated capabilities and technologies to enhance supply chain optimization, production efficiency, and recyclability. Yet limited studies have been conducted to optimize these prospects from the perspective of low resource countries where such innovative studies have not been adequately explored. This paper aims to examine the implications of smart manufacturing practices (Smart Procurement, Smart Supply Chain, Smart Production Planning and Control, Automation and Industrial Robot, and Supply Chain Configuration) on pro-environmental behaviour and develop a baseline moderated mediation model to explain the relationship between smart manufacturing and pro-environmental behaviour with a role of green dynamic capability, and environmental orientation. This study is anchored on quantitative research approach, deductive reasoning, and explanatory design. Cross – sectional survey data have been obtained from 382 manufacturing companies in Ghana. Our hypotheses have been tested using Structural Equation Modelling and SMART-PLS version 3.8.9. The study has revealed that smart manufacturing practices significantly and positively relate to pro-environmental behaviour. Moreover, green dynamic capability and environmental orientation moderate the relationship between smart manufacturing and pro-environmental behaviour. The implications of the study include the emergence of a baseline model to guide policymakers, practitioners, and academicians to explain the relationship between smart manufacturing and sustainable manufacturing in the context of developing countries. Again, the social implication of the study includes the realisation of decent job and economic growth, responsible consumption and production as well as actions taken to combat climate change.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"50a77ff36630a4abe03a427211cc94aac0363fdfb6095e4c53643c036241bbe9","category":"Interdisciplinary"}