{"title":"Apple Hit With Lawsuit From App Store Developer Over Copycat Apps","link":"https://www.macrumors.com/2021/03/18/apple-hit-with-lawsuit-from-developer/","date":1616073476000,"content":"App developer Kosta Eleftheriou, who highlighted the problem of <a href=\"https://www.macrumors.com/2021/02/09/scam-apps-ios-making-millions-revenue/\">scam and copycat apps on the App Store</a> last month, is now suing Apple for a variety of allegations, including negligence and anticompetitive conduct (via <a href=\"https://www.theverge.com/2021/3/18/22336380/apple-app-store-scam-lawsuit-kosta-eleftheriou-flicktype-ios-developer\"><em>The Verge</em></a>).\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/app-store-blue-banner.jpg\" alt=\"\" width=\"1600\" height=\"957\" class=\"aligncenter size-full wp-image-776387\" />\r\n<br/>\r\n\r\n<br/>\r\nEleftheriou's complaint, filed against Apple in Santa Clara County, California, accuses the company of exploiting its control over iOS apps \"to make billions of dollars in profits at the expense of small application developers and consumers.\"\r\n<br/>\r\n\r\n<br/>\r\nEleftheriou explains that his keyboard app for the Apple Watch, \"FlickType,\" was targeted by poorly-functioning competing software that eroded his sales and <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> rankings through false advertising and the purchase of fake reviews. The lawsuit revolves around the allegation that Apple failed to do enough to combat the scams, even though it did later remove some of the copycat apps. Specifically, Apple is accused of false advertising, unfair competition, breach of its developer agreement, negligence, and fraud.\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>Apple entices software application developers like Plaintiff to develop innovative applications with the promise of a fair and secure &zwnj;App Store&zwnj; in which to sell them. In truth, Apple systematically flexes its monopoly muscle against potential competition through the &zwnj;App Store&zwnj; and profits from rampant fraudulent practices. If Apple cannot buy a desired application from a developer on the cheap, Apple attempts to crush that developer through exploitive fees and selective application of opaque and unreasonable constraints against the developer.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\nApple attempted to acquire FlickType before purportedly raising \"roadblock after roadblock\" to the app being sold on the &zwnj;App Store&zwnj;. Eleftheriou alleges that Apple actively chose to allow scam and copycat apps on the &zwnj;App Store&zwnj; in an effort to force him to \"give up\" and sell his app to Apple \"at a discount,\" and claims that this period resulted in a year of lost revenue.\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>At the same time, Apple permits other developers that Apple does not view as real competition, including scam competitors, to peddle similar, inferior products because Apple profits from their sales. Scammers oftentimes use screenshots and videos taken from legitimate developer's applications and manipulate their ratings. Apple does little to police these practices because it profits from them. Apple then lies to its regulators by asserting that it must maintain its monopoly power over the sale of Apple-related applications to protect consumers, when, in fact, Apple lets them get ripped off and exploits the developers trying to deliver innovation to consumers.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\nOnce the app was available for sale, the complaint alleges that revenue was severely hemorrhaged by a wave of scam and copycat software. Apple is accused of \"intentionally\" failing to police these apps, \"while Apple continues to amass huge profits for itself.\"\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>Apple holds both its device users and developers hostage. Yet each time it faces antitrust claims, Apple justifies its monopoly by claiming it is necessary to protect its users and developers from unscrupulous conduct and ensure a fair competitive marketplace for the benefit of both. In truth, Apple turns a blind eye to rampant fraud and exploitation to make an easy profit.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\nThe complaint joins a plethora of other ongoing lawsuits against Apple, amid increasing scrutiny over the company's control over the &zwnj;App Store&zwnj; and potential anticompetitive behavior. <div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/lawsuit/\">lawsuit</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">antitrust</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/18/apple-hit-with-lawsuit-from-developer/\">Apple Hit With Lawsuit From App Store Developer Over Copycat Apps</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-hit-with-lawsuit-from-app-store-developer-over-copycat-apps.2288762/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=2J_BsIpxotI:maKycc1uJzU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=2J_BsIpxotI:maKycc1uJzU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/2J_BsIpxotI\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"50b404066763c5738b183f3435d8a7ec9cfcf27925e5983e4eb5e26bb43d32e9","category":"Apple"}