{"title":"Catchment Properties Shape Seasonal Variation in Groundwater‐Surface Water Interaction—Geogenic Silica as a Proxy for Hydrological Turnover Induced Mixing","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036120?af=R","date":1719298800000,"content":"<h2>Abstract</h2>\n<p>The cumulative and bidirectional groundwater-surface water (GW-SW) interaction along a stream is defined as hydrological turnover (HT) influencing solute transport and source water composition. However, HT proves to be highly variable, producing spatial exchange patterns influenced by local groundwater, geology, and topography. Hence, identifying factors controlling HT poses a challenge. We studied spatiotemporal HT variability at two reaches of a third order tributary of the river Mosel, Germany. Additionally, we sampled for silica concentrations in the stream and in the near-stream groundwater. Thus, creating snapshots of the boundary layer between ground- and surface water where HT occurs, driven by mixing processes in the hyporheic zone. We utilize an enhanced hydrograph separation method, unveiling reach differences in storage drainage based on aquifer dimension and connectivity. The data shows a site-specific negative correlation of HT with discharge, while hydraulic gradients correlate with HT only at the reach with faster catchment drainage behavior. Examining silica concentrations between stream and wells shows that silica variation increases significantly with the decrease of HT under low flow conditions at the slower draining reach. At the fast draining reach this relationship is seasonal. In Summary, our results show that stream discharge shapes the influence of HT on solute transport. Yet, reach drainage behavior shapes seasonal states of groundwater storages and can be an additional control of HT. Hence, concentration change of pollutants could be masked by HT. Thus, our findings contribute to the understanding of HT variability along streams and its ability of influencing physico-chemical stream water composition.</p>","author":"Lars Bäthke, \nTobias Schuetz","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"50bcd4a527c98295ab6f7dd706106faa5de1cbd653838c84caf11858aa7c74bc","category":"Environment"}