{"title":"Huawei จับมือ BAIC ผลิตรถยนต์ไฟฟ้า มาพร้อมชิป Kirin 990A รัน HarmonyOS มีรุ่นพิเศษพร้อมระบบขับขี่อัตโนมัติ","link":"https://www.blognone.com/node/122358","date":1619429947000,"content":"<div><div><div><p>Huawei ร่วมมือกับบริษัทผลิตรถยนต์ BAIC ของประเทศจีน เปิดตัวรถยนต์ Arcfox รุ่น Alpha S ในงาน Shanghai International Auto Show เมื่อวันที่ 17 เมษายนที่ผ่านมา โดยมาพร้อมชิป Kirin 990A และรัน HarmonyOS</p>\n<p>Alpha S มีระบบชาร์จเร็ว ชาร์จ 10 นาที วิ่งได้ 197 กิโลเมตร แบ่งเป็นรุ่นใหญ่ๆ สองรุ่นคือรุ่นปกติที่ไม่มีระบบขับขี่อัตโนมัติ ระยะ 525, 603 และ 708 กิโลเมตร กับรุ่นพิเศษ Alpha S HI ที่เพิ่มระบบขับขี่อัตโนมัติ HI (Huawei Inside) และเซ็นเซอร์ lidar 3 ตัว, เรดาร์ millimeter wave 6 ตัว กล้องรอบคัน 9 ตัวเข้ามาด้วย</p>\n<p>Alpha S ราคาเริ่มต้น 251,900 หยวน (ราว 1.22 ล้านบาท) ระยะวิ่ง 525 กิโลเมตรต่อการชาร์จ รุ่น high-end ราคา 344,900 หยวน (ราว 1.67 ล้านบาท) วิ่งได้ 603 กิโลเมตร แต่มีรุ่นระยะ 708 กิโลเมตร ราคา 281,900 หยวน (ราว 1.36 ล้าน) ที่ไม่มีข้อมูลว่าทำไมระยะมากกว่าถึงถูกกว่า แต่คาดว่าน่าจะไม่มีฟีเจอร์เสริมบางอย่างที่รุ่น 603 กิโลโมตรมี</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c87cf8a4700f258c8d00c6e6ab91477c.jpg\" /></p>\n<p>ส่วนรุ่น Alpha S HI ที่มีระบบขับขี่อัตโนมัติ แบ่งย่อยออกเป็นสองรุ่น รุ่นเริ่มต้นจำกัดอัตราการประมวลผลของชิปอยู่ที่ 400 TOPS (tera operation per second) ใช้งานระบบขับขี่อัตโนมัติได้เฉพาะบนทางหลวง ราคา 388,900 หยวน (ราว 1.88 ล้านบาท) รุ่น high-end อัตราประมวลผลเพิ่มเป็น 800 TOPS ใช้งานได้ทั้งบนทางหลวง และถนนในเมือง (urban road) ราคา 429,900 หยวน (ราว 2.1 ล้านบาท)</p>\n<p>ระบบอัตโนมัติในรุ่น Alpha S HI ปรับได้สามแบบคือแบบ NCA ที่สามารถขับขี่แบบอัตโนมัติจากจุดตั้งต้นไปถึงจุดหมายได้ร่วมกับการใช้แผนที่ความละเอียดสูง ปัจจุบันใช้งานได้แค่ในปักกิ่ง เซี่ยงไฮ้ และกวางโจว แบบที่สองคือแบบ ICA+ ระบบขับขี่อัตโนมัติที่มีการเรียนรู้ด้วยตัวเองได้ แต่ไม่สามารถใช้งานการนำทาง point-to-point แบบ ICA ได้ และแบบสุดท้าย ICA เป็น cruise control อัจฉริยะ คล้าย Autopilot ของ Tesla</p>\n<p>ที่มา - <a href=\"https://www.huaweicentral.com/heres-the-autopilot-test-of-huawei-harmonyos-powered-arcfox-alpha-s-smart-car-video/\">Huawei Central</a>, <a href=\"https://www.huaweicentral.com/arcfox-alpha-s-series-smart-car-with-harmonyos-launched-check-highlights-features-and-price/\">Huawei Central</a></p>\n<p><em>วิดีโอทดสอบ ระบบขับขี่อัตโนมัติของ Arcfox Alpha S HI จากผู้ใช้</em></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/huawei\">Huawei</a></div><div><a href=\"/topics/electric-car\">Electric Car</a></div><div><a href=\"/topics/harmonyos\">HarmonyOS</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"50bd703b93fafe95c6c6d0b56f25a1b2e522b632ead92fb4c3850f7a3f247d87","category":"Thai"}