{"title":"Wait, the iPhone SE 4 is going to be good now?","link":"https://www.macworld.com/article/2031061/iphone-se-4-features-display-action-button-camera.html","date":1692095400000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/1354114/iphone-se-4-design-specs-features-release-date.html\">iPhone SE 4</a> had had something of a roller-coaster rumor cycle. Initial reports claimed a new model would arrive in 2024 with a new design and USB-C. Then it was reportedly cancelled; then it was back on; and then it was cancelled again. And now it appears to be back on with a slew of upgrades on board.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/uredditor?s=21&amp;t=HhUOJht6frasmAEyPNn7bA&amp;xcust=1-1-2031061-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Unknownz21 on X</a> (formerly Twitter), the iPhone SE 4 will have a design based on the iPhone 14 that will bring several upgrades over the current model, including Face ID and USB-C. All of these features have been rumored for the iPhone SE over the years, but recent reports suggested Apple had changed course and might not deliver the next-gen model at all. </p>\n\n\n\n<figure><div>\n<blockquote><p>More about the SE 4 – planned features and design changes:<br /><br />– Design based on iPhone 14<br />– Face ID <br />– USB-C <br />– Action button 👀<br />– Only one rear camera</p>— Unknownz21 🌈 (@URedditor) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/URedditor/status/1690658861160812544?ref_src=twsrc%5Etfw&amp;xcust=1-1-2031061-1-0-0&amp;sref=https://www.macworld.com/feed\">August 13, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Unknownz21 doesn’t say what kind of display the iPhone SE 4 will have, but previous rumors have suggested it will switch to OLED. It will also presumably have the old notch design rather than the Dynamic Island, which is reportedly coming to all iPhone 15 models.</p>\n\n\n\n<p>If those upgrades aren’t enough to make the iPhone SE 4 one of the best-value phones Apple has ever made, there’s one more feature Unknownz21 claims Apple is bringing to its budget iPhone: the Action button. The Action button, which will replace the mute switch, will reportedly bring quick functionality such as opening apps and turning on the flashlight. The idea is to replicate the utility of the same-named control on the Apple Watch Ultra.</p>\n\n\n\n<p>It’s been rumored that Apple will bring the Action button to the <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15 Pro and Pro Max</a> this year and expand it to the rest of the line with the iPhone 16. That would make the iPhone SE the last iPhone to get the feature, but still make it feel like a much more modern device that it does now. (However, Unknownz21 does say the iPhone SE 4 will <em>still</em> have a single camera.)</p>\n\n\n\n<p>The current SE is the only iPhone that still has an LCD screen as well as Touch ID and a Home button. It launched in March 2021 and sells for $429.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"50bfbbbaa1b4519022277a456f3de5bf5634497d285bbd2d99a5e0332372350e","category":"Apple"}