{"title":"Influence of pasteurization and spray drying on the fat digestion behavior of human milk fat analog emulsion: a simulated in vitro infant digestion study","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13319?af=R","date":1712768606000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Human milk fat analog emulsion (HMFAE) is an emulsion that mimics the composition and structure of human milk (HM) fat globules. The application of HMFAE in infant formula requires a series of milk powder processing steps, such as pasteurization and spray drying. However, the effect of milk powder processing on fat digestion of HMFAE is still unclear. In this study, the influence of pasteurization and spray drying on the lipolysis behavior of HMFAE was studied and compared with HM using a simulated infant <i>in vitro</i> digestion model.</p>\n<h2>RESULTS</h2>\n<p>Pasteurization and spray drying increased the flocculation and aggregation of lipid droplets in HMFAE during digestion. Spray drying destroyed the lipid droplet structure of HMFAE, and partial milk fat globule membrane-covered lipid droplets turned into protein-covered lipid droplets, which aggravated lipid–protein aggregation during gastric digestion and hindered fat digestion in the small intestine. The final lipolysis degree was in the order HM (64.55%) &gt; HMFAE (63.41%) &gt; pasteurized HMFAE (61.75%) &gt; spray-dried HMFAE (60.57%). After complete gastrointestinal digestion, there were no significant differences in free fatty acid and sn-2 monoacylglycerol profile among the HMFAE, pasteurized HMFAE, and spray-dried HMFAE.</p>\n<h2>CONCLUSION</h2>\n<p>Milk powder processing can reduce lipolysis by altering the lipid droplet structure of HMFAE and the degree of lipid droplet aggregation during digestion. © 2024 Society of Chemical Industry.</p>","author":"Yue Pan, \nShuming Liu, \nXueying Zhang, \nXiaodong Li, \nLu Liu, \nDonghai Hao, \nLiqin Cui, \nChunli Ma, \nXiaoqing Dang, \nYanling Xu, \nYongshun Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"50c60b7fcd5a85bf7b37a490b9cb2d850a17e2662b409b176f2bfc30bd020df1","category":"Environment"}