{"title":"Avirulence of a spontaneous <i>Francisella tularensis</i> subsp. <i>mediasiatica prmA</i> mutant","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305569","date":1718719200000,"content":"<p>by Vitalii Timofeev, Irina Bakhteeva, Galina Titareva, Raisa Mironova, Vera Evseeva, Tatiana Kravchenko, Angelika Sizova, Alexander Borzilov, Natalia Pavlovich, Alexander Mokrievich, Ivan Dyatlov, Gilles Vergnaud</p>\r\n\r\n<i>Francisella tularensis</i>, the causative agent of tularemia, is divided into three subspecies. Two of these, subspecies <i>holarctica</i> and <i>tularensis</i>, are highly pathogenic to humans and consequently relatively well studied. The third subspecies, <i>mediasiatica</i>, is rarely isolated and remains poorly studied. It is distributed in the sparsely populated regions of Central Asia and Siberia. Curently this subspecies is not known to have been responsible for human infections in spite of its high virulence in laboratory animals. Subspecies <i>mediasiatica</i> is currently divided into three subgroups—MI, present in Central Asia, MII, present in southern Siberia, and MIII represented by a unique strain, 60(B)57, isolated in Uzbekistan in 1960. We describe here the unexpected observation that MIII strain 60(B)57 is avirulent and immunogenic. We observed that infection with this strain protected mice from challenge 21 days later with a virulent subsp. <i>mediasiatica</i> strain. With an increase of this interval, the protection for mice was significantly reduced. In contrast, guinea pigs were protected from challenge with strains of the subspecies <i>holarctica</i> and <i>mediasiatica</i> (but not subsp. <i>tularensis</i>) 90 days after infection with 60(B)57. We performed genome assembly based on whole genome sequencing data obtained using the Nanopore MinION for strain 60(B)57 and two subsp. <i>mediasiatica</i> strains representing the Central Asian MI and Siberian MII phylogenetic subgroups. The <i>prmA</i> gene is truncated due to a nonsense mutation in strain 60(B)57. The deletion of gene <i>prmA</i> has previously been shown to induce a loss of virulence in <i>Francisella novicida</i> the closest model organism suggesting that the observed mutation might the cause of the avirulence of strain 60(B)57.","author":"Vitalii Timofeev","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"50caa34294e9f98f2769f312ee9147f53eb4bd2b9ba88c203bec01ac35138d6d","category":"Interdisciplinary"}