{"title":"Speaking to a metronome reduces kinematic variability in typical speakers and people who stutter","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309612","date":1729087200000,"content":"<p>by Charlotte E. E. Wiltshire, Gabriel J. Cler, Mark Chiew, Jana Freudenberger, Jennifer Chesters, Máiréad P. Healy, Philip Hoole, Kate E. Watkins</p>\r\nBackground <p>Several studies indicate that people who stutter show greater variability in speech movements than people who do not stutter, even when the speech produced is perceptibly fluent. Speaking to the beat of a metronome reliably increases fluency in people who stutter, regardless of the severity of stuttering.</p> Objectives <p>Here, we aimed to test whether metronome-timed speech reduces articulatory variability.</p> Method <p>We analysed vocal tract MRI data from 24 people who stutter and 16 controls. Participants repeated sentences with and without a metronome. Midsagittal images of the vocal tract from lips to larynx were reconstructed at 33.3 frames per second. Any utterances containing dysfluencies or non-speech movements (e.g. swallowing) were excluded. For each participant, we measured the variability of movements (coefficient of variation) from the alveolar, palatal and velar regions of the vocal tract.</p> Results <p>People who stutter had more variability than control speakers when speaking without a metronome, which was then reduced to the same level as controls when speaking with the metronome. The velar region contained more variability than the alveolar and palatal regions, which were similar.</p> Conclusions <p>These results demonstrate that kinematic variability during perceptibly fluent speech is increased in people who stutter compared with controls when repeating naturalistic sentences without any alteration or disruption to the speech. This extends our previous findings of greater variability in the movements of people who stutter when producing perceptibly fluent nonwords compared with controls. These results also show, that in addition to increasing fluency in people who stutter, metronome-timed speech also reduces articulatory variability to the same level as that seen in control speakers.</p>","author":"Charlotte E. E. Wiltshire","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"50cccd7000c7942c3f9adbc1cbee06903f890886e85ccdc8b6eb8845d6537786","category":"Interdisciplinary"}