{"title":"Eric Schmidt: How AI Will Transform Science","link":"https://markpeak.net/eric-schmidt-how-ai-will-transform-science/","date":1692320408000,"content":"<p><em>ภาพประกอบ <a href=\"https://www.pexels.com/photo/a-light-microscope-placed-on-a-white-surface-5726808/\">Artem Podrez / Pexels</a></em></p>\n<p>อ่านบทความที่ Eric Schmidt อดีตซีอีโอกูเกิล เขียนเรื่อง <a href=\"https://www.technologyreview.com/2023/07/05/1075865/eric-schmidt-ai-will-transform-science/\">This is how AI will transform the way science gets done</a> ลง MIT Technology Review (ที่มาคือ<a href=\"https://www.blognone.com/node/135325\">ข่าวลือว่า Schmidt กำลังจะตั้งองค์กรด้านวิทยาศาสตร์แนวนี้</a>) คิดว่าน่าสนใจ ควรมาจดเก็บไว้เป็น<a href=\"https://markpeak.net/tag/artificial-intelligence/\">บทความในซีรีส์ AI</a></p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.technologyreview.com/2023/07/05/1075865/eric-schmidt-ai-will-transform-science/\">\n\t\t\t\t\t<img src=\"https://wp.technologyreview.com/wp-content/uploads/2023/06/protein-folding.jpg?resize=1200,600\" alt=\"Eric Schmidt: This is how AI will transform the way science gets done\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.technologyreview.com/2023/07/05/1075865/eric-schmidt-ai-will-transform-science/\">\n\t\t\tEric Schmidt: This is how AI will transform the way science gets done\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.technologyreview.com/2023/07/05/1075865/eric-schmidt-ai-will-transform-science/\">\n\t\t\t<p>Science is about to become much more exciting—and that will affect us all, argues Google's former CEO.</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://www.technologyreview.com/static/media/favicon.1cfcdb44759a0f93ddf5feb5405dd4cc.ico\" alt=\"MIT Technology Review\" />\t\tMIT Technology Review\t</div>\n</div>\n<p>Schmidt บอกว่ากระบวนการทางวิทยาศาสตร์ (scientific process) มันยังเหมือนเดิมแหละ แต่ระหว่างทางแต่ละขั้นตอน มันมีงานพลังถึก งานใช้แรงงาน งานน่าเบื่อซ้ำๆ ซากๆ เยอะ กว่าจะทำวิจัยเสร็จแต่ละเรื่องนั้นสิ้นเปลืองทรัพยากรของมนุษย์ไปมาก เรานำ AI มาช่วย automate กระบวนการเหล่านี้เพื่อประหยัดแรงของมนุษย์ดีกว่า</p>\n<blockquote><p>At its core, the scientific process we all learned in elementary school will remain the same: conduct background research, identify a hypothesis, test it through experimentation, analyze the collected data, and reach a conclusion.</p></blockquote>\n<p>เริ่มจากการทำ literature review แทนที่ต้องมานั่งไล่อ่านเปเปอร์จำนวนมหาศาล ก็มี AI ช่วยอ่าน ช่วยสรุป ช่วยทำ citation ให้</p>\n<blockquote><p>Artificial intelligence is already transforming how some scientists conduct literature reviews. Tools like PaperQA and Elicit harness LLMs to scan databases of articles and produce succinct and accurate summaries of the existing literature—citations included.</p></blockquote>\n<p></p>\n<p>ขั้นถัดมาคือตั้งสมมติฐาน (hypothesis) มีตัวช่วยหลายอย่าง เช่น เอา LLM มาอ่านโครงสร้างความเชื่อมโยงทางวิทยาศาสตร์ (science’s hierarchical structure) แล้วช่วยพยากรณ์ว่าสิ่งที่ยังขาดอยู่ ยังต้องค้นพบให้เจอคืออะไร</p>\n<p>หรือการที่เราทำ simulation ได้เร็วขึ้นกว่าเดิมมาก ก็ช่วยให้นักวิทยาศาสตร์ทดลองสมมติฐานใน simulation ได้หลายแบบมากขึ้น ก่อนไปทดลองจริงๆ กระบวนการเหล่านี้ช่วยลัดขั้นตอนทางวิทยาศาสตร์แบบดั้งเดิม ที่เป็นการค่อยๆ ค้นพบเพิ่มทีละนิด (the incremental process of scientific discovery) มาเป็นการหาแนวทางที่น่าจะดีที่สุด (optimal solution) ตั้งแต่แรกได้เลย</p>\n<blockquote><p>This kind of ability will fundamentally shift the incremental process of scientific discovery, allowing researchers to design for the optimal solution from the outset rather than progress through a long line of progressively better designs, as we saw in years of innovation on filaments in lightbulb design.</p></blockquote>\n<p>Schmidt ยกตัวอย่างซูเปอร์คอมพิวเตอร์ Earth-2 ของ NVIDIA ที่จำลองข้อมูลสภาพอากาศของโลกได้ละเอียดว่าเดิมมาก เพราะใช้วิธีจำลองสภาพอากาศของโลกทั้งใบ มีข้อมูลหลัก Terabyte มารันโลกเสมือนตลอดเวลา จากเดิมระบบพยากรณ์อากาศมีข้อจำกัดที่การพยากรณ์ได้ 50 เรื่องในสัปดาห์หน้า แต่ระบบใหม่ FourCastNet จำลองการพยากรณ์ได้เป็นพันแบบ สามารถพยากรณ์สภาพอากาศที่พบได้ยากแต่เป็นอันตรายสูงได้ล่วงหน้า เพื่อให้คนอพยพหนีได้ทันท่วงที</p>\n<p></p>\n<p>ขั้นตอนของการทดลอง (experimentation) เราใช้ AI ช่วยทำการทดลองได้เยอะขึ้น เร็วขึ้น ถูกลงได้ เช่น มีเครื่องจัดการหลอดทดลองเป็นร้อยๆ พันๆ หลอด ใช้ AI ควบคุม รันตลอดวัน ในระดับที่ไม่มีมนุษย์คนไหนทำได้</p>\n<p>เดี๋ยวนี้เริ่มมีบริษัทที่ทำระบบ cloud lab คือใช้หุ่นยนต์ + AI สร้างห้องแล็บที่ควบคุมได้จากระยะไกล นักวิทยาศาสตร์นั่งสั่งงานหุ่นยนต์จากหน้าคอมได้เลย</p>\n<p>นอกจากนี้ Schmidt ยังบอกว่า AI จะช่วยลด bias ของมนุษย์ที่มีแนวโน้มจะเลือกตัวอย่างจากสิ่งที่เรารู้หรือคุ้นเคยอยู่แล้ว แต่ AI ไม่มี bias แบบมนุษย์, AI มีความสม่ำเสมอมากกว่า สามารถทำงานวิจัยซ้ำรอยคนอื่นเพื่อยืนยันการทดลองของคนอื่นได้ (นักวิจัยมนุษย์ 70% บอกว่ามีปัญหาไม่สามารถทำวิจัยซ้ำแล้วได้ผลออกมาเหมือนกันได้)</p>\n<p></p>\n<p>ขั้นตอนสุดท้ายของการวิเคราะห์และสรุป เราสามารถใช้ LLM อ่านผล และแนะนำว่าควรทดลองครั้งต่อไปอย่างไร มองว่าเป็นพาร์ทเนอร์ช่วยเราในกระบวนการวิจัย เหมือนเป็น AI lab assistant ได้</p>\n<p>Schmidt บอกว่านักวิจัยไม่ต้องกลัวเรื่องว่าจะตกงาน เพราะจะมีงานชนิดใหม่ๆ เกิดขึ้นมา ที่ต้องใช้ความสร้างสรรค์มากขึ้น ลดภาระงานหนักๆ ในแล็บลง</p>\n<p>เครื่องมือใหม่ๆ ยังช่วยลดกำแพงของนักวิทยาศาสตร์รุ่นใหม่ให้เข้ามาทำงานวิจัยได้ง่ายขึ้น เช่น อาจไม่ต้องเรียนวิชาโค้ดดิ้งเต็มรูปแบบ เพราะใช้ AI สั่งงานได้แทน ง่ายกว่า เข้าถึงคนกว้างกว่า</p>\n<blockquote><p>Young researchers might be shifting nervously in their seats at the prospect. Luckily, the new jobs that emerge from this revolution are likely to be more creative and less mindless than most current lab work.</p></blockquote>\n<p>การใช้ AI มาช่วยงานวิจัยเป็นเรื่องหนีไม่พ้น Schmidt ยกตัวอย่างการแข่งขันพยากรณ์โครงสร้างโปรตีน Critical Assessment of Structure Prediction (CASP) ที่มนุษย์ทำคะแนนได้สูงสุดอยู่ราว 30-40 จาก 100 แต่จู่ๆ DeepMind ออกโมเดล AlphaFold มาแล้วทำได้ 58 คะแนน, หลังจากนั้นสองปีออกเวอร์ชัน 2 มาทำได้ 87 คะแนน มนุษย์ตามไม่ทันแล้ว</p>\n<p>แต่ทีมวิจัยที่เป็นมนุษย์สามารถต่อยอดงานจาก AI ได้ เช่น หลังจาก AlphaFold เผยแพร่ซอร์สโค้ดออกมา ก็มีทีมวิจัยจาก U of Washington ไปทำต่อเป็นโมเดล RoseTTAFold พยากรณ์โปรตีนที่มีความซับซ้อนสูงกว่าที่ AlphaFold ทำได้ เป็นตัวอย่างว่าคนร่วมงานกับ AI ได้อย่างไร</p>\n<p>อย่างไรก็ตาม การใช้ AI ก็ยังมีข้อจำกัด เช่น การเพ้อฝันของ AI เอง (hallucination) หรือแล็บอัตโนมัติจะไม่ช่วยให้นักวิจัยมีทักษะลงมือทำจริง ไม่มีช่วงเวลาสั่งสมความรู้และประสบการณ์ได้มากพอ รวมถึงปัญหาเรื่อง safety/guardrail ที่ใช้ป้องกันการใช้ AI ในเรื่องผิดๆ ซึ่ง Schmidt บอกว่ามาตรการของ OpenAI ในการป้องกัน GPT-4 จะเป็นจริงได้ก็ต่อเมื่อรัน GPT-4 ในเครื่องของ OpenAI เองเท่านั้น ถ้ามีใครนำโมเดลออกไปรันข้างนอกได้ รับรองแตกแน่นอน</p>\n<p>Schmidt ยังชี้ว่าการนำ AI มาใช้ด้านวิทยาศาสตร์นั้นเป็นประโยชน์ต่อโลกสูง แต่มีประโยชน์ทางการเงินน้อย ภาคเอกชนคงไม่สนใจเข้ามาทำกัน ตรงนี้เป็นหน้าที่ของรัฐบาล หรือหน่วยงานการกุศล ที่จะเข้ามาสนับสนุนโครงการวิจัยเหล่านี้ ทั้งในเรื่องงบประมาณ และการทำข้อมูลกลาง open data set ที่มีคุณภาพดีพอด้วย</p>The post <a href=\"https://markpeak.net/eric-schmidt-how-ai-will-transform-science/\">Eric Schmidt: How AI Will Transform Science</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"50cfac85e70a267e64c0edfa4d86be0b993da5e1c153b5e83fd3079018f52dcf","category":"Thai"}