{"title":"Marine protected areas can be useful but are not a silver bullet for kelp conservation","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13446?af=R","date":1712751025000,"content":"<h2>Abstract</h2>\n<p>Kelp forests are among the most valuable ecosystems on Earth, but they are increasingly being degraded and lost due to a range of human-related stressors, leading to recent calls for their improved management and conservation. One of the primary tools to conserve marine species and biodiversity is the establishment of marine protected areas (MPAs). International commitments to protect 30% of the world's ecosystems are gaining momentum, offering a promising avenue to secure kelp forests into the Anthropocene. However, a clear understanding of the efficacy of MPAs for conserving kelp forests in a changing ocean is lacking. In this perspective, we question whether strengthened global protection will create meaningful conservation outcomes for kelp forests. We explore the benefits of MPAs for kelp conservation under a suite of different stressors, focusing on empirical evidence from protected kelp forests. We show that MPAs can be effective against some drivers of kelp loss (e.g., overgrazing, kelp harvesting), particularly when they are maintained in the long-term and enforced as no-take areas. There is also some evidence that MPAs can reduce impacts of climate change through building resilience in multi-stressor situations. However, MPAs also often fail to provide protection against ocean warming, marine heatwaves, coastal darkening, and pollution, which have emerged as dominant drivers of kelp forest loss globally. Although well-enforced MPAs should remain an important tool to protect kelp forests, successful kelp conservation will require implementing an additional suite of management solutions that target these accelerating threats.</p>","author":"Karen Filbee‐Dexter, \nSamuel Starko, \nAlbert Pessarrodona, \nGeorgina Wood, \nKjell Magnus Norderhaug, \nCristina Piñeiro‐Corbeira, \nThomas Wernberg","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"50cfa6a0f0fa6cc22f70784fb1378093cc90b681f8e2ed2a34088d70faacb351","category":"Environment"}