{"title":"PSIII-8 CRISPR editing of IGF2 and MSTN to enhance productivity","link":"https://academic.oup.com/jas/article/102/Supplement_3/510/7757792?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The ability to modify the genomes of livestock species has previously been limited by low efficiency and the high cost associated with reagents and the generation of edited live animals (e.g., via somatic cell nuclear transfer). However, the CRISPR/Cas9 system has shown promise by improving specificity and efficacy, while decreasing costs associated with reagent acquisition and potentially live animal production (e.g., via direct editing of embryos). Given these potential improvements there are still a limited number of well-characterized genes for targeting. Nonetheless, there are two genes where molecular variation in different species has shown highly significant effects on increased lean growth and reduced adiposity, insulin-like growth factor 2 (IGF2) and myostatin (MSTN). In pigs, a G-to-A substitution in intron 3 of IGF2 (g.3072G &gt;A) disrupts a conserved binding site for the transcriptional repressor ZBED6 allowing for increased postnatal IGF2 expression. This increased expression is associated with increased lean muscle yield and intramuscular fat deposition, while decreasing backfat. In livestock species other than the pig, numerous loss-of-function mutations in MSTN have been reported. MSTN is a known early regulator of myoblast differentiation, negatively regulating myoblast fusion into myotubes. This results in muscle hyperplasia causing the commonly referred to “double-muscling” phenotype. Animals of this phenotype have significantly increased skeletal muscle mass, improved feed conversion, and decreased fat deposition. These mutations have the potential to act synergistically as demonstrated by generation of a mouse line possessing both IGF2 overexpression and MSTN loss-of-function mutations. Within this line, wild-type (WT) mice have an average body weight (BW) of 19.64 ± 1.89 g at 11 wk of age. In comparison, IGF2 overexpression, MSTN loss-of-function, and the combination of both mutations have average BW of 23.54 ± 2.31 g, 26.14 ± 2.35 g, and 31.43 ± 2.39 g, respectively (<span>P</span> &lt; 0.0001). Based on these results in mice we have initiated editing of both genes in cattle. Two male fetal fibroblast cell lines were generated from d 75 fetuses from high genetic merit Angus matings. Four CRISPR guide RNAs have been designed for both genes and assayed for their in vitro cleavage efficiencies. All guide RNAs exceeded 60% cleavage efficiency. CRISPR/Cas9 ribonuclear protein complexes were electroporated into each cell line. Targeted modifications will be confirmed through sequencing, and successfully modified cell lines will undergo somatic cell nuclear transfer to produce live animals.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"50d782995f37df2ee879cd1e59daf912823b8697b8bc78a1c8a464b8e7940790","category":"Environment"}