{"title":"Physicists unlock multispectral secrets of earliest color photographs","link":"https://arstechnica.com/?p=1769141","date":1622714437000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div></div>\n<p>French physicist <a href=\"https://en.wikipedia.org/wiki/Gabriel_Lippmann\">Gabriel Lippmann</a> pioneered color photography and snagged the 1908 Nobel Prize in Physics for his efforts. But according to <a href=\"https://www.pnas.org/content/118/17/e2008819118\">a recent paper</a> published in the Proceedings of the National Academy of Sciences (PNAS), Lippmann's technique distorted the colors of the scenes being photographed. Physicists at the École Polytechnique Fédérale de Lausanne (EPFL) in Switzerland were able to determine the nature of that distortion and developed a means of reconstructing the original spectrum that created the plates.</p>\n<p>\"These are the earliest multi-spectral light measurements on record, so we wondered whether it would be possible to accurately recreate the original light of these historical scenes,\" <a href=\"https://www.eurekalert.org/pub_releases/2021-04/epfd-uts041421.php\">said co-author Gilles Baechler</a>. \"But the way the photographs were constructed was very particular, so we were also really interested in whether we could create digital copies and understand how the technique worked.\"</p>\n<p>A physics professor at the Sorbonne, Lippmann became interested in developing a means of fixing the colors of the solar spectrum onto a photographic plate in 1886, \"whereby the image remains fixed and can remain in daylight without deterioration.\" He achieved that goal in 1891, producing color images of a stained-glass window, a bowl of oranges, and a colorful parrot, as well as landscapes and portraits—including a self-portrait. (Fun fact: Lippmann's laboratory protégés included a promising Polish physics student named Marie Skłodowska, who went on to marry Pierre Curie and win two Nobel Prizes of her own.)</p></div><p><a href=\"https://arstechnica.com/?p=1769141#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1769141&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"50d811971cc321a73427cf75514c20642ed89b4089d9325fb7af31399160e75d","category":"Tech"}