{"title":"Impacts of marine heatwaves in coastal ecosystems depend on local environmental conditions","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17469?af=R","date":1724050800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/ad32401c-d179-4f5f-8acd-ec85fbd1b008/gcb17469-toc-0001-m.png\" alt=\"Impacts of marine heatwaves in coastal ecosystems depend on local environmental conditions\" />\n<p>This review paper explores how local environmental variation influences the responses of marine life to increasingly severe marine heatwaves (MHWs). It presents a framework of three ‘resilience processes’ (RPs) through which fine-scale spatial variability mediates the impacts of heatwaves on marine ecosystems, from individual organisms to entire communities. The paper emphasizes the importance of high-resolution environmental data and improved climate models for predicting and managing the consequences of MHWs in a changing climate.</p>\n<br />\n<h2>Abstract</h2>\n<p>Marine heatwaves (MHWs), increasing in duration and intensity because of climate change, are now a major threat to marine life and can have lasting effects on the structure and function of ecosystems. However, the responses of marine taxa and ecosystems to MHWs can be highly variable, making predicting and interpreting biological outcomes a challenge. Here, we review how biological responses to MHWs, from individuals to ecosystems, are mediated by fine-scale spatial variability in the coastal marine environment (hereafter, local gradients). Viewing observed responses through a lens of ecological theory, we present a simple framework of three ‘resilience processes’ (RPs) by which local gradients can influence the responses of marine taxa to MHWs. Local gradients (1) influence the amount of stress directly experienced by individuals, (2) facilitate local adaptation and acclimatization of individuals and populations, and (3) shape community composition which then influences responses to MHWs. We then synthesize known examples of fine-scale gradients that have affected responses of benthic foundation species to MHWs, including kelp forests, coral reefs, and seagrass meadows and link these varying responses to the RPs. We present a series of case studies from various marine ecosystems to illustrate the differential impacts of MHWs mediated by gradients in both temperature and other co-occurring drivers. In many cases, these gradients had large effect sizes with several examples of local gradients causing a 10-fold difference in impacts or more (e.g., survival, coverage). This review highlights the need for high-resolution environmental data to accurately predict and manage the consequences of MHWs in the context of ongoing climate change. While current tools may capture some of these gradients already, we advocate for enhanced monitoring and finer scale integration of local environmental heterogeneity into climate models. This will be essential for developing effective conservation strategies and mitigating future marine biodiversity loss.</p>","author":"Samuel Starko, \nMirjam van der Mheen, \nAlbert Pessarrodona, \nGeorgina V. Wood, \nKaren Filbee‐Dexter, \nChristopher J. Neufeld, \nShinae Montie, \nMelinda A. Coleman, \nThomas Wernberg","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"50dcd2eab5a50c7a386c00cd19d93ae237bf8951408b636e403c7811a0ba54c8","category":"Environment"}