{"title":"Stormwater Management: An Integrated Approach to Support Healthy, Livable, and Ecological Cities","link":"https://www.preprints.org/manuscript/202406.1575/v1","date":1719209773000,"content":"The practice of stormwater management has evolved from a singular focus on drainage to a multifaceted approach to support integrated urban development. By contributing to healthy, livable, ecological, and water sensitive cities, it is a key tool to promote Sustainable Development Goal 11 from neighborhood to metropolitan scales. A review of the knowledge base for stormwater management shows several attributes that favor an integrative approach to achieve co-benefits across several sectors. Functional areas of its contributions include drainage, flood control, flood plain management, water quality control, urban ecology, recreation, and city beautification. Legacy path dependance affects the potential to reform land use practices, while stormwater management practice is being affected by climate change, sea level rise, urbanization, inequality, and poor governance. Technical methods for stormwater management are well advanced, but integrative frameworks to address social, ecological and infrastructure needs are more challenging. The sensitivity of ecological issues is most evident in cities in coastal zones. Organizational initiatives are needed to counter neglect of essential maintenance and sustain flood risk reduction in cities. Stormwater management is related to other integrative tools, including IWRM, One Water, One Health, and integrated flood management, as well as the broader concept of urban planning. Stormwater capture and rainfall harvesting offer major opportunities to augment scarce water supplies. Nature-based solutions like low-impact development and the Sponge City concept show promise to transform cities. Major cities face challenges to sustain conveyance corridors for major flows and to store and treat combined sewer runoff. The neighborhood focus of stormwater management elevates the importance of participation and inclusion to advance environmental justice and strengthen social capital. Integrating organizational initiatives from local to city scale and funding improvements to stormwater systems are major challenges that require leadership from higher governance levels, although governments face resistance to change toward integration, especially in countries with poor land use and public works management systems. Finding solutions to neighborhood issues and the connectivity of water systems at larger scales requires complex approaches to urban planning and represent an important agenda for urban and water governance going forward.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"50e5b1745778fc59442d5678146096c978747afc23b7d124620e6e16b75a66d8","category":"Interdisciplinary"}