{"title":"Viviani returns to training, Prudhomme ‘reasonably optimistic’ for season: Daily News","link":"https://cyclingtips.com/2021/02/viviani-returns-to-training-prudhomme-reasonably-optimistic-for-season-daily-news/","date":1612913689000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>Tuesday&#8217;s news items included Elia Viviani&#8217;s return to training, Christian Prudhomme talking about the 2021 season, Thibaut Pinot offering his thoughts on a wide range of subjects, to name only a few of the things in the headlines.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Viviani back to training after cardiac issue</h3>\n\n\n\n<p>Elia Viviani posted a photo of himself training with teammates on Instagram on Tuesday, about three weeks after he left Cofidis training camp after experiencing cardiac anomalies during a ride.</p>\n\n\n\n<p>Viviani underwent cardiac evaluations in Italy and doctors performed an ablation. Following a recovery period, he is now back on the bike.</p>\n\n\n\n<h3>Prudhomme &#8216;reasonably optimistic&#8217; for 2021 racing season</h3>\n\n\n\n<p>Although several races have already been postponed or cancelled, Tour de France director Christian Prudhomme has said in an interview with RTBF that he is &#8220;optimistic&#8221; for the season ahead.</p>\n\n\n\n<p>&#8220;I am above all very happy that the Grand Prix de la Marseillaise and this Étoile de Bessèges have taken place,&#8221; Prudhomme said. &#8220;I am also happy to have heard the Prefect of Drôme confirm to me that the Drôme Classic will take place as planned on February 28. In all the meetings we have with the prefectures, we always recall the specificity of professional sport which allows competitions to exist, obviously with all the appropriate measures. I am therefore reasonably optimistic even though I personally thought a few months ago that we would be fine to start 2021 … This is not the case, but until proven otherwise, this does not prevent us from holding the races respecting what the authorities ask of us.&#8221;</p>\n\n\n\n<h3>Pinot sees Giro as a chance to &#8216;bounce back&#8217;</h3>\n\n\n\n<p>Thibaut Pinot has offered some insight into his decision to target the Giro d&#8217;Italia this year and a variety of other topics in an interview with L&#8217;Equipe. After some frustrating experiences at the Tour de France, the 30-year-old Frenchman said he is hoping to regain some confidence with a strong showing in Italy.</p>\n\n\n\n<p>&#8220;There is something that draws me to the Giro and I think I need that to bounce back,&#8221; Pinot said. &#8220;If I do well, I am back on track. The decision was made before the Giro course was announced but seeing the course reinforces my choice.&#8221;</p>\n\n\n\n<p>Pinot also touched on the topic of corticosteroids. He said that corticosteroids were part of the treatment he received under medical supervision to treat a back issue during the offseason, but voiced concerned about the potential for the abuse of corticosteroids in-competition under therapeutic use exemptions (TUEs).</p>\n\n\n\n<p>&#8220;I have always been against it on ethical grounds but this was in the offseason, in the middle of winter,&#8221; he said. &#8220;I would never do it between two races. There is a month-long effect after an injection so even when you are not racing, the effect is still there. I am completely against it. A rider who needs a TUE to be able to ride has nothing to do in a race. I don’t understand why guys do this.”</p>\n\n\n\n<h3>No 14-day quarantine required to compete at Olympics</h3>\n\n\n\n<p>Despite prior reports suggesting that a 14-day quarantine before competition might be required for athletes to race at the Tokyo Olympics, the International Olympic Committee sent out an athlete playbook last week that does not mention a quarantine requirement ahead of the Olympics.</p>\n\n\n\n<p>For now, athletes will have to test negative for COVID-19 72 hours before flying, but no 14-day quarantine is required. Without a mandatory quarantine, those who ride the Tour de France or the Giro Rosa will be able to go on to compete in Tokyo later this year.</p>\n\n\n\n<h3>AG2R will race on Pirelli tires</h3>\n\n\n\n<p>Pirelli has announced a partnership with World Tour Team AG2R-Citroen to supply tires to the French squad and its U23 feeder team. This brings the number of teams racing on Pirelli P-Zero tubular and tubeless road options in 2021 to three.</p>\n\n\n\n<p>The Ag2R squad will also use Pirelli’s Cinturato tyres for training. Pirelli said ‘the partnership with the team is above all to support the evolution of the product, for a constant exchange of feedback on the tyres thanks to the suggestions of the athletes.”</p>\n\n\n\n<p>Greg Van Avermaet clearly understands the more important benefits of riding and racing on Pirelli bike tires, saying, “Pirelli can bring their great experience to cycling which is a big benefit so I’m happy I can ride Pirelli not only on my car but also on my bike.&#8221;</p>\n\n\n\n<h3>From the Ground Up looks for entry-level riders to race the Leadville 100</h3>\n\n\n\n<p>Mountain bikers Alexey Vermeulen and Ryan Petry are hoping to help three entry-level riders take on the Leadville 100 and document the experience in a project called From the Ground Up.</p>\n\n\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Nv8e9PUMpMQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></p>\n\n\n<p>You can learn more <a href=\"https://www.fromthegroundup.bike/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</p>\n\n\n\n<h3>Happy birthday to &#8230;</h3>\n\n\n\n<p>Ernesto Colnago is 89. He founded his bike company in 1952, and these days, he can say that a rider has won the Tour de France on one of his bikes after Tadej Pogacar did with UAE-Team Emirates so in 2020.</p>\n\n\n\n<h2>In case you missed it&#8230;</h2>\n\n\n\n<h3>Dangerholm&#8217;s sub-10 kg Scott &#8216;Hyper&#8217; Spark is a concept MTB brought to life</h3>\n\n\n\n<p>As James Huang writes, <a href=\"https://cyclingtips.com/2021/02/dangerholm-scott-hyper-spark/\" target=\"_blank\" rel=\"noreferrer noopener\">Dangerholm&#8217;s customized Scott Spark</a> sports a pretty unique build.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/viviani-returns-to-training-prudhomme-reasonably-optimistic-for-season-daily-news/\">Viviani returns to training, Prudhomme &#8216;reasonably optimistic&#8217; for season: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"50edbf0a661d8615cad2b1f4c5d7f060c4584c10504fe6adfc89cf32b451501c","category":"Cycling"}