{"title":"Viviani returns to training, Prudhomme ‘reasonably optimistic’ for season: Daily News","link":"https://cyclingtips.com/2021/02/viviani-returns-to-training-prudhomme-reasonably-optimistic-for-season-daily-news/","date":1612913689000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>Tuesday&#8217;s news items include Elia Viviani&#8217;s return to training, Christian Prudhomme offering his thoughts on the 2021 season, and Thibaut Pinot talking about his Giro plans and a variety of other subjects, to name only a few of the things in the headlines.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Viviani back to training after cardiac issue</h3>\n\n\n\n<p>Elia Viviani posted a photo of himself training with teammates on Instagram on Tuesday, about three weeks after he left Cofidis&#8217;s training camp after experiencing cardiac anomalies during a ride.</p>\n\n\n\n<p>Following his initial departure from training camp, Viviani underwent cardiac evaluations in Italy and doctors performed an ablation. He then spent some time off the bike, but he is now back to training, and he is provisionally slated to start his 2021 campaign racing at the upcoming UAE Tour.</p>\n\n\n\n<h3>Prudhomme &#8216;reasonably optimistic&#8217; for 2021 racing season</h3>\n\n\n\n<p>Although several early-season races have already been postponed or cancelled this year, Tour de France director Christian Prudhomme has said in an interview with <a rel=\"noreferrer noopener\" href=\"https://www.rtbf.be/sport/cyclisme/detail_christian-prudhomme-quand-on-pourra-a-nouveau-se-serrer-la-main-la-proximite-des-champions-cyclistes-reviendra?id=10693032\" target=\"_blank\">RTBF</a> that he is &#8220;reasonably optimistic&#8221; for the season ahead.</p>\n\n\n\n<p>&#8220;I am above all very happy that the Grand Prix de la Marseillaise and this Étoile de Bessèges have taken place,&#8221; Prudhomme said. &#8220;I am also happy to have heard the Prefect of Drôme confirm to me that the Drôme Classic will take place as planned on February 28. In all the meetings we have with the prefectures, we always recall the specificity of professional sport which allows competitions to exist, obviously with all the appropriate measures. I am therefore reasonably optimistic even though I personally thought a few months ago that we would be fine to start 2021 … This is not the case, but until proven otherwise, this does not prevent us from holding the races respecting what the authorities ask of us.&#8221;</p>\n\n\n\n<h3>Pinot sees Giro as a chance to &#8216;bounce back&#8217;</h3>\n\n\n\n<p>Thibaut Pinot <a href=\"https://cyclingtips.com/2021/02/thibaut-pinot-hopes-to-remain-a-grand-tour-contender-at-giro-ditalia/\" target=\"_blank\" rel=\"noreferrer noopener\">offered some insight</a> into his decision to target the Giro d&#8217;Italia this year and covered a variety of other topics as well in an interview with <a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Article/Thibaut-pinot-pour-moi-c-etait-la-fin-de-l-enfance/1221335\" target=\"_blank\" rel=\"noreferrer noopener\">L&#8217;Equipe</a>. After some frustrating experiences at the Tour de France, the 30-year-old Frenchman said he is hoping to regain some confidence with a strong showing in Italy.</p>\n\n\n\n<p>&#8220;There is something that draws me to the Giro and I think I need that to bounce back,&#8221; Pinot said. &#8220;If I do well, I am back on track. The decision was made before the Giro course was announced but seeing the course reinforces my choice.&#8221;</p>\n\n\n\n<p>Pinot also touched on the topic of corticosteroids. He revealed that corticosteroids were part of the treatment he received for a back issue during the offseason, but voiced concerns about the potential for the abuse of therapeutic use exemptions (TUEs) amid the racing season.</p>\n\n\n\n<p>&#8220;When you have an injection or you use cortisone, the effects last for at least three weeks,&#8221; Pinot said. &#8220;Some do it just before races – you are out of competition, but the effect is there. I am completely opposed to all that, but I think there is still &#8216;cycling at two speeds.'&#8221;</p>\n\n\n\n<h3>No 14-day quarantine required to compete at Olympics</h3>\n\n\n\n<p>Despite prior reports suggesting that a 14-day quarantine before competition might be required for athletes to race at the Tokyo Olympics, the International Olympic Committee sent out an athlete playbook last week that does not mention a quarantine requirement ahead of the Olympics.</p>\n\n\n\n<p>For now, athletes will have to test negative for COVID-19 72 hours before flying, but no 14-day quarantine is required. Without a mandatory quarantine, riders will be able to finish the Tour de France or the Giro Rosa and then go on to compete in Tokyo later this year.</p>\n\n\n\n<h3>Danilo Wyss retires</h3>\n\n\n\n<p>Danilo Wyss announced on Instagram on Tuesday that he is retiring.</p>\n\n\n\n<p>Wyss spent the past two seasons with the NTT organization after 11 years at BMC. He made 12 Grand Tour starts over the course of his 13 years riding for first- or second-division teams, and he rode to a Swiss national road title in 2015.</p>\n\n\n\n<h3>AG2R will race on Pirelli tires</h3>\n\n\n\n<p>Pirelli has announced a partnership with AG2R-Citroën to supply tires to the French squad and its U23 feeder team. AG2R will race on Pirelli&#8217;s P-Zero tubular and tubeless road options in 2021 and will use Pirelli’s Cinturato tires for training. Pirelli said that &#8220;the partnership with the team is above all to support the evolution of the product, for a constant exchange of feedback on the tires thanks to the suggestions of the athletes.”</p>\n\n\n\n<p>Pirelli&#8217;s partnership with AG2R Citroën brings to count of WorldTour organizations racing on the tires to three, with Trek-Segafredo and BikeExchange also riding Pirelli tires in 2021.</p>\n\n\n\n<h3>From the Ground Up looks for entry-level riders to race the Leadville 100</h3>\n\n\n\n<p>Pro mountain bikers Alexey Vermeulen and Ryan Petry are hoping to help three entry-level riders take on the Leadville 100 and document the experience in a project called From the Ground Up.</p>\n\n\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Nv8e9PUMpMQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></p>\n\n\n<p>You can learn more <a href=\"https://www.fromthegroundup.bike/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</p>\n\n\n\n<h3>Happy birthday to &#8230;</h3>\n\n\n\n<p>Ernesto Colnago turned 89 on Tuesday. He founded the Colnago bike company in 1954, and these days, he can say that a bike with his name on it was ridden to a Tour de France victory after Tadej Pogacar took the Tour title in 2020.</p>\n\n\n\n<h2>In case you missed it&#8230;</h2>\n\n\n\n<h3>Dangerholm&#8217;s sub-10 kg Scott &#8216;Hyper&#8217; Spark is a concept MTB brought to life</h3>\n\n\n\n<p>As James Huang writes, <a rel=\"noreferrer noopener\" href=\"https://cyclingtips.com/2021/02/dangerholm-scott-hyper-spark/\" target=\"_blank\">Dangerholm&#8217;s customized Scott Spark</a> sports a pretty unique build.</p>\n\n\n\n<h3>Gallery: Breakout rides and heart-stopping finishes at Aussie Road Nationals</h3>\n\n\n\n<p>Photos from Con Chronis <a href=\"https://cyclingtips.com/2021/02/gallery-breakout-rides-and-heart-stopping-finishes-at-aussie-road-nationals/\" target=\"_blank\" rel=\"noreferrer noopener\">capture the action</a> from five days of racing at the Australian Road National Championships.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/viviani-returns-to-training-prudhomme-reasonably-optimistic-for-season-daily-news/\">Viviani returns to training, Prudhomme &#8216;reasonably optimistic&#8217; for season: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"50edbf0a661d8615cad2b1f4c5d7f060c4584c10504fe6adfc89cf32b451501c","category":"Cycling"}