{"title":"watchOS 10 อัพเดตครั้งใหญ่ เพิ่ม Smart Stack เรียกดู Widget ใน Apple Watch ง่ายขึ้น","link":"https://www.blognone.com/node/134173","date":1685995982000,"content":"<div><div><div><p>แอปเปิลอัพเดต watchOS 10 ระบบปฏิบัติการบน Apple Watch ที่แอปเปิลบอกว่าเป็นอัพเดตครั้งสำคัญ ตามข่าวที่ออกมาก่อนหน้านี้ ด้วยการออกแบบใหม่มี Smart Stack ที่เรียกดูข้อมูลต่าง ๆ และ Widget ได้ง่ายขึ้นด้วยการหมุนปุ่ม Digital Crown</p>\n<p>นักพัฒนายังสามารถเพิ่มความสามารถในการแสดงข้อมูลต่าง ๆ ผ่าน Widget บน watchOS 10 นี้ ตัวอย่างเช่น แอป NBA เพิ่มหน้าจอแสดงผลการแข่งขันเรียลไทม์แบบเต็มจอ หรือการเรียกดูสถานะจากแอปกำหนดเป้าหมายต่าง ๆ</p>\n<p>ตัวเลือกหน้าปัดที่เพิ่มมาได้แก่ Palette ที่แสดงสีสันซ้อนทับกัน 3 ชั้น และเปลี่ยนสีเมื่อเวลาผ่าน ส่วนอีกหน้าปัดคือ Snoopy ที่นำสองตัวละครคุ้นเคยอย่าง Snoopy และ Woodstock มาเล่นกับเข็มหน้าปัด หรือออกแอคชันต่าง ๆ ตามกิจกรรมขณะนั้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c05860f6a113f76a361ade59f5bb3452.jpg\" /></p>\n<p>watchOS 10 ยังเพิ่มและปรับปรุงความสามารถอื่นอีกดังนี้</p>\n<ul>\n<li>Cycling รองรับการเชื่อมต่อกับจักรยานที่รองรับบลูทูธ เพื่อเก็บข้อมูลเชิงลึก สำหรับคำนวณกำลังการปั่นและค่า FTP ที่ใช้คำนวนโซน นอกจากนี้ยังมิเรอร์หน้าจอขึ้นมา iPhone เพื่อให้สะดวกในการดูอีกด้วย</li>\n<li>Hiking แอปเดินป่าเพิ่มการปักหมุดจุดอ้างอิง เพื่อให้การค้นหาฉุกเฉินคำนวณจุดคาดการณ์ได้ดีขึ้น และเพิ่มข้อมูลระดับภูมิประเทศความสูง</li>\n<li>Mental Health ปรับปรุงข้อมูลเชิงลึกเพื่อวัดปัจจัยต่าง ๆ ที่อาจส่งผลต่อสุขภาพและจิตและภาวะซึมเศร้า</li>\n<li>Myopia ป้องกันปัญหาสายตาสั้น โดยเฉพาะในเด็ก ด้วยการเตือนให้ออกไปใช้เวลากลางแจ้ง รวมทั้งทำงานร่วมกับ iPhone, iPad ผ่านกล้อง TrueDepth เตือนเมื่อถืออุปกรณ์ใกล้สายตามากเกินไป</li>\n</ul>\n<p>watchOS 10 เปิดให้นักพัฒนาใช้งานเวอร์ชันทดสอบเบต้าตั้งแต่วันนี้เป็นต้นไป เวอร์ชันพับลิกเบต้าเปิดให้ใช้งานเดือนกรกฎาคม และเปิดให้ดาวน์โหลดสำหรับผู้ใช้งานทุกคนภายในปีนี้</p>\n<p>ที่มา: <a href=\"https://www.apple.com/newsroom/2023/06/introducing-watchos-10-a-milestone-update-for-apple-watch/\">แอปเปิล</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/watchos\">watchOS</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/apple-watch\">Apple Watch</a></div><div><a href=\"/topics/operating-system\">Operating System</a></div><div><a href=\"/topics/wwdc23\">WWDC23</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"50ef81026206ce776f17014164ef13961bbc2955e258ef4772ac3623352cc4dc","category":"Thai"}