{"title":"Ratanjot (Alkanna tinctoria L.) Root Extract, Rich in Antioxidants, Exhibits Strong Antimicrobial Activity Against Foodborne Pathogens and Is a Potential Food Preservative","link":"https://www.preprints.org/manuscript/202406.1524/v1","date":1719109541000,"content":"Natural and sustainable plant-based antioxidants and antimicrobials are highly desirable for improving food quality and safety. The present investigation assessed the antimicrobial and antioxidant properties of active components from Alkanna tinctoria (herb) roots, also known as Ratanjot root. Two methods were used to extract active components: microwave-assisted hot water (MAHW) and ethanol and air-dried. MAHW extract yielded 6.29% while the ethanol yielded 18.27%, suggesting superior Ratanjot root extract powder (RRP) solubility in ethanol over water. The ethanol extract showed significantly higher antioxidant activity than the MAHW extract. Gas chromatography and mass-spec analysis revealed three major phenolic compounds: Butanoic acid, 3-hydroxy-3-methyl-; Arnebin 7, and Diisooctylpthalate. The color attributes (L*, a*, b*, hab, C*ab) for the ethanolic and MAHW extracts revealed significant differences (P &lt; 0.05) in all the above parameters for both types of extracts, except for yellowness (b*) and chroma (C*ab) values. The ethanol extract exhibited antimicrobial activity against 14 bacterial species, with a signifi-cantly higher inhibitory effect against Gram-positive bacteria (Listeria monocytogenes and Staphylococcus aureus) than the Gram-negative bacteria (Salmonella enterica serovar Typhimurium and Escherichia coli). The minimum inhibitory concentration (MIC) and minimum bactericidal concentration (MBC) were both 25 mg/ml for the Gram-negative bacteria, while the MIC and MBC concentrations varied for Gram-positive bacteria (0.049 - 0.098 mg/ml and 0.098 - 0.195 mg/ml) and the antimicrobial effect was bactericidal. The antimicrobial activities of RRP extract remained stable under broad temperature (37-100°C) and pH (2-6) conditions, as well as during refrigerated storage for 30 days. Application of RRP at 1% (10 mg/g) and 2.5% (25 mg/g) levels in a cooked chicken meatball model system prevented lipid oxidation and improved sensory attributes and retarded microbial growth during refrigerated (4°C) storage for 20 days. Furthermore, the RRP extract was non-toxic when tested with sheep erythrocytes and did not inhibit the growth of probiotics, Lacticaseibacillus casei, and Lactiplantibacillus plantarum. In conclusion, the study suggests that RRP possesses excellent antimicrobial and antioxidant activities, thus making it suitable for food preservation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"50f929e59dfcba149faa2be999b4606ccdda0ae63929fa228960501e84b61944","category":"Interdisciplinary"}