{"title":"Efficacy and Safety of Pulse Intravenous Methylprednisolone in Pediatric Epileptic Encephalopathies: Timing and Networks Consideration","link":"https://www.preprints.org/manuscript/202403.0515/v2","date":1710159343000,"content":"Abstract: Background: epileptic encephalopathies (EE) are characterized by severe drug-resistant seizures, early-onset, and unfavorable developmental outcome. We describe a cohort of pediatric patients with EE who underwent intravenous methylprednisolone (IVMP) pulse therapy to examine its efficacy/tolerability. Methods: This is a retrospective study from 2020 to 2023. Inclusion criteria were: ≤18 years at the time of IVMP pulse therapy and at least 6 months of follow-up. Efficacy and outcome, defined as seizure reduction &gt;50% (responder rate), were evaluated at 6 and 9 months of therapy, and 6 months after therapy suspension; quality of Life (QoL) was also assessed. Variables predicting positive post-IVMP outcomes were identified using statistical analysis. Results: Twenty-one patients were included. The responding rate was 85.7% at 6 and 9 months of therapy, and 80.9% at 6 months after therapy suspension. Genetic etiology and encephalopathy related to status epilepticus during NREM sleep (ESES) were predictive of efficacy (p=0.0475). The fourth month of therapy was the minimum time point to establish the effectiveness of the treatment. All patients showed improvements in QoL, EEG tracing and postural-motor development. No relevant adverse events were observed. Conclusions: Our study confirms the efficacy and tolerability of pulse IVMP treatment in pediatric patients with EE, especially with genetic etiology and ESES. The fourth month of therapy was the minimum time point to establish its effectiveness. QoL, EEG and postural-motor development also showed improvement.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"50fad364a406677883dd02bb2289b0cc9d61513425160d1170d3f276486afbf5","category":"Interdisciplinary"}