{"title":"Vertical distribution and tissue selection of Helicoverpa zea (Lepidoptera: Noctuidae) adult oviposition and neonates on soybean with an indeterminate or determinate growth habit","link":"https://academic.oup.com/ee/article/53/4/521/7679484?rss=1","date":1716336000000,"content":"<span><div>Abstract</div><span>Helicoverpa zea</span> (Boddie) is a polyphagous pest that can cause serious damage to crops, including soybeans (<span>Glycine max</span> L.). In soybeans with both determinate and indeterminate growth habits, <span>H. zea</span> larvae are more commonly found on leaves compared to blooms, stems, and pods. Past research demonstrated that <span>H. zea</span> adults tend to oviposit near the upper part of the plant canopy in soybeans with a determinate growth habit. However, ovipositional selection on soybeans with an indeterminate growth habit is unknown. We hypothesized that <span>H. zea</span> would oviposit more uniformly throughout the canopy on indeterminate soybean growth habits due to more diffuse reproductive tissue. We planted field and greenhouse experiments with varieties sharing a similar relative maturity (2 maturity group [MG] 5.2 varieties and 2 MG 5.4/5.5 varieties) but with different growth habits. To test oviposition selection, adult <span>H. zea</span> females were allowed to oviposit under field and caged conditions. We counted the number of <span>H. zea</span> eggs and neonates on each plant tissue type from each of 3 equal parts in the plant canopy: upper, middle, and lower. In both experiments, eggs and neonates were most common on leaves at the top of the plant regardless of soybean growth habit. Consequently, ovipositional selection is likely independent of reproductive tissue availability, and patterns of oviposition through the canopy are similar in growth habits. An improved understanding of <span>H. zea</span> ecology in soybeans relative to indeterminate growth habits may improve recommendations for managing this significant pest of soybean.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"50fec0d2bc854f7d97964a93d63682ba8269c0315ef41942afcede55bdec5719","category":"Environment"}