{"title":"An insertion in the promoter of a malate dehydrogenase gene regulates malic acid content in apple fruit","link":"https://academic.oup.com/plphys/article/196/1/432/7681935?rss=1","date":1716508800000,"content":"<span><div>Abstract</div>Malic acid is an important flavor determinant in apple (<span>Malus</span> × <span>domestica</span> Borkh.) fruit. One known variation controlling malic acid is the A/G single nucleotide polymorphism in an aluminum-activated malate transporter gene (<span>MdMa1</span>). Nevertheless, there are still differences in malic acid content in apple varieties with the same <span>Ma1</span> genotype (<span>Ma1</span>/<span>Ma1</span> homozygous), such as ‘Honeycrisp’ (high malic acid content) and ‘Qinguan’ (low malic acid content), indicating that other loci may influence malic acid and fruit acidity. Here, the F1 (Filial 1) hybrid generation of ‘Honeycrisp’ × ‘Qinguan’ was used to analyze quantitative trait loci for malic acid content. A major locus (<span>Ma7</span>) was identified on chromosome 13. Within this locus, a malate dehydrogenase gene, <span>MDH1</span> (<span>MdMa7</span>), was the best candidate for further study. Subcellular localization suggested that <span>MdMa7</span> encodes a cytosolic protein. Overexpression and RNA interference of <span>MdMa7</span> in apple fruit increased and decreased malic acid content, respectively. An insertion/deletion (indel) in the <span>MdMa7</span> promoter was found to affect <span>MdMa7</span> expression and malic acid content in both hybrids and other cultivated varieties. The insertion and deletion genotypes were designated as <span>MA7</span> and <span>ma7</span>, respectively. The transcription factor MdbHLH74 was found to stimulate <span>MdMa7</span> expression in the <span>MA7</span> genotype but not in the <span>ma7</span> genotype. Transient transformation of fruit showed that MdbHLH74 affected <span>MdMa7</span> expression and malic acid content in ‘Gala’ (<span>MA7</span>/<span>MA7</span>) but not in ‘Fuji’ (<span>ma7</span>/<span>ma7</span>). Our results indicated that genetic variation in the <span>MdMa7</span> (<span>MDH1</span>) promoter alters the binding ability of the transcription factor MdbHLH74, which alters <span>MdMa7</span> (<span>MDH1</span>) transcription and the malic acid content in apple fruit, especially in <span>Ma1</span>/<span>Ma1</span> homozygous accessions.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"50ff55a599c74dd665b22d587c1418eaa6a69eb59e89c8d2a162e44f96b94298","category":"Environment"}