{"title":"Honda’s electric go-kart shows off its easily swappable battery system","link":"https://arstechnica.com/?p=1934430","date":1682519126000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/The-eGX-Racing-Concept-800x602.jpg\" alt=\"An electric go-kart\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/The-eGX-Racing-Concept-scaled.jpg\">Enlarge</a> <span>/</span> The kart places battery packs on either side of the driver. (credit: Abigail Bassett)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>LONG BEACH, Calif.—Honda has its hands in all kinds of businesses, from lawnmowers and power generators to IndyCar, go-karts, and consumer vehicles. Honda Performance Division (HPD) works explicitly on the high-performance and racing product line and builds, hones, and maintains everything from the hybrid powertrain <a href=\"https://arstechnica.com/cars/2023/01/heres-why-oems-are-so-interested-in-building-gtp-race-cars/\">we’ve seen in Acura’s LDMh race car</a> to high-performance kart and motorcycle engines.</p>\n<p>With a commitment to going carbon neutral by 2050, Honda has focused its attention on moving everything in its product line toward hybrid and electric powertrains, including a brand-new all-electric go-kart called the eGX Racing Kart Concept. The concept leverages Honda’s Mobile Power Pack, or MPP, and offers swappable batteries with plenty of power. We got a chance to drive the new eGX Racing Kart Concept on a small, multi-elevation track that Honda set up at the Acura Long Beach Grand Prix this month; zipping around in the tiny, powerful, and quick vehicles gave us a taste of the latest electric power plant from Honda.</p>\n<h2>Swappable, sharable batteries and an electric motor</h2>\n<p>The eGX Racing Kart Concept looks just like an e-kart you might see at a K1 Speed or other indoor karting track (minus the surround bumpers). It’s compact, simple, and minimal, and it can reach speeds of up to 45 miles per hour, according to Honda. It’s not Honda’s first electric kart, however, as the company built <a href=\"https://www.gokartguide.com/honda-minimoto-go-kart/\">a kid's e-kart called the Minimoto Go-Kart</a>, which ran on a rechargeable 36-volt battery and reached speeds of 18 miles per hour. Honda no longer makes or sells the Minimoto, but you can still find them on eBay and Craigslist.</p></div><p><a href=\"https://arstechnica.com/?p=1934430#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1934430&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5104e1437e2fd5a19b04540c62cdea11e850aeeac098bbf5f4039a36c2926e65","category":"Tech"}