{"title":"Yes, some cats like to play fetch. It’s science!","link":"https://arstechnica.com/?p=1990305","date":1702571955000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>A cat owner throws a tinfoil ball a few feet in front of their expectant cat twice. The cat chases after the tinfoil ball and retrieves it back to the owner both times, carrying it in its mouth. Credit: Elizabeth Renner. </p></div>\n<p>Cats have a well-deserved reputation for being independent-minded and aloof, preferring to interact with humans on their own quirky terms. So you'd never see a cat playing fetch like a dog, right? Wrong. That sort of play behavior is more common than you might think—one of our cats was an avid fetcher in her younger years, although she's slowed down a bit with age. However, the evidence to date for specific fetching behaviors in cats is largely anecdotal.</p>\n<p>That's why a team of British scientists set out to study this unusual feline play behavior more extensively, reporting their findings in a new paper published in the journal Scientific Reports. The researchers concluded that most cats who like to play fetch learned how to do so without any explicit training and that cats are generally in control when playing fetch with their humans. Specifically, cats will play fetch longer and retrieve the thrown object more times when they initiate the game rather than their owners. In other words, cats are still gonna be cats.</p>\n<p>Many different animal species exhibit play behavior, according to the authors, and it's most common in mammals and birds. <a href=\"https://arstechnica.com/science/2023/01/watching-youtube-cat-videos-for-science-are-those-cats-playing-or-fighting/\">When cats play</a>, their behavior tends to resemble hunting behavior commonly seen in European wildcats and lynxes: rapid approach and retreat, leaping, chasing, pouncing, and stalking. Initially, as kittens, they engage in more social forms of play with their littermates like wrestling, and they tend to engage in more solitary play as adults—the opposite of dogs, who usually start playing with objects alone before transitioning to social play.</p></div><p><a href=\"https://arstechnica.com/?p=1990305#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1990305&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5110dfbeed4edf8d12a97e7f37cf04129365422b49745d2fa119bddce50bf7b9","category":"Tech"}