{"title":"A Qualitative Study on Understanding Family Experiences: Mental Health Literacy in Adolescent Eating Disorder Diagnoses","link":"https://www.preprints.org/manuscript/202410.1732/v1","date":1729607844000,"content":"Adolescent eating disorders pose a significant public health challenge, deeply affecting both physical and emotional well-being. Early diagnosis is important for improving treatment outcomes, though it remains complex due to multiple influencing factors. The family perspective is essential in this process, as it provides valuable insights into changes in adolescents’ habits and emotional health.  Methods: A descriptive qualitative study was conducted in Madrid, Spain, between January and February 2023, using a phenomenological approach to explore the experiences and perspectives of family members of adolescents with eating disorders. Results: Four thematic blocks with their categories were identified: (T1) Diagnosis, (T2) Family (T3) Resources, and (T4) Treatment. Participants emphasized the need for early intervention and a multidisciplinary approach to the treatment of eating disorders. Family therapy was recognized as vital in treatment, and common dissatisfaction in the public health structure underscored the need for greater investment in research and access to specialists. Mental health nurse practitioners have an important role in providing comprehensive care and support as well as mental health literacy.   Conclusions: A holistic patient-centered approach, including family involvement and appropriate support systems, is key to improving outcomes and quality of life of adolescents undergoing treatment for eating disorders. Improving healthcare resources and addressing the challenges faced by families is essential. In addition, mental health literacy is critical, as it enables families to understand the disease better, make informed decisions, and actively participate in the recovery process, contributing to improved therapeutic outcomes and quality of life for patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"51135937bd345d2535331aaf25d2c8041b08a9349e9fa35a8c1889acf23ae1d8","category":"Interdisciplinary"}