{"title":"Jumbo-Visma rolls out new Cervelo R5 in team colours","link":"https://cyclingtips.com/2021/06/jumbo-visma-rolls-out-new-cervelo-r5-in-team-colours/","date":1624747068000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/New-Cervelo-R5-26-1-650x366.jpg\" /></div><h2>Jumbo-Visma rolls out new Cervelo R5 in team colours</h2><p>\n</p><p>In April of this year, CyclingTips global tech editor James Huang reported on what appeared to be the <a target=\"_blank\" href=\"https://cyclingtips.com/2021/04/primoz-roglic-previews-new-cervelo-r5-at-la-fleche-wallonne/\">new Cervelo R5</a> under Primož Roglič at La Flèche Wallonne. </p>\n\n\n\n<p>At last month’s Giro d’Italia, George Bennett raced aboard the as-yet-unannounced R5 in the same black and yellow paint job. </p>\n\n\n\n<p>Fast forward to this year’s <a href=\"https://cyclingtips.com/tag/tour-de-france\" target=\"_blank\">Tour de France</a> and it seems all Jumbo-Visma riders will have the new R5 at their disposal, in regular team colours. This suggests the new R5 is no longer a prototype and instead that it’s one step closer to full release. </p>\n\n\n\n<figure><img /><figcaption>The new Cervelo R5 is an iteration rather than a complete overhaul, but nevertheless, the updates are significant. </figcaption></figure>\n\n\n\n<p>So far, reports on the new R5 have mostly been limited to going over photos with a fine-tooth comb. Not now though – we were able to get our hands on Mike Teunissen’s bike ahead of this year’s <a target=\"_blank\" href=\"https://cyclingtips.com/tag/tour-de-france/\">Tour de France</a>. </p>\n\n\n\n<p>Cervelo is yet to announce the exact details of the new R5, but getting up close with Teunissen’s bike, we can confirm some of James’s speculation from those early photos. </p>\n\n\n\n<figure><ul><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li></ul><figcaption>Internal cable routing and a new front end are the highlight updates to the new Cervelo R5.</figcaption></figure>\n\n\n\n<p>While the new R5 sticks with similar frame and ride characteristic goals, subtle changes to the tube shaping and size in combination with that integrated cable routing make for a substantially updated bike.</p>\n\n\n\n<p>The most obvious of these changes is the new head tube, enlarged at the top to accommodate the internal cable routing, with a slightly narrower midsection. </p>\n\n\n\n<p>As per the race photos spotted earlier this year, Teunissen is running the FSA ACR (Aerodynamic Cable Routing) stem which enables all of this internal cable routing.</p>\n\n\n\n<p>Thanks to this close-up view, we can also see a significantly redesigned fork which transitions more smoothly onto the down tube. The outgoing R5 fork legs curved forward and tapered towards the hub, whereas the updated forks are much straighter and much less tapered. </p>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Gone is the outboard seat clamp cover from the current R5, replaced with a much neater solution which sits flush with the frame.</figcaption></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>The new R5 features an updated seat clamp with a neater, more integrated appearance. The seat clamp is also positioned behind the seatpost on the new bike. However, Cervelo has avoided the trend to drop the seatstays, sticking with the traditional seatstay / seat tube interface. </p>\n\n\n\n<p>The down tube and seat tubes both remain very similar to the current R5, with the D-shaped, truncated airfoil especially evident on the seat tube. </p>\n\n\n\n<p> In terms of tyre clearance, while we have no official details, Teunissen’s measured 26 mm and still had ample space in both frame and fork to safely assume a minimum of 30 mm clearance. </p>\n\n\n\n<p>The new R5 also retains Cervelo’s signature BBRight bottom bracket. </p>\n\n\n\n<figure><img /></figure>\n\n\n\n<p>We weighed Teunissen’s bike at 7.3 kg with Shimano’s Dura-Ace C60 tubular wheels. </p>\n\n\n\n<p>We will bring you official news of the new R5 as we get it. </p>\n\n\n\n<figure><ul><li><figure><img /><figcaption>This is believed to be the new Cervelo R5. Whether Cervelo sticks with R5, changes to R6, or adopts a entirely new name is unknown.</figcaption></figure></li><li><figure><img /><figcaption>Most of the updates are on the front end.</figcaption></figure></li><li><figure><img /><figcaption>The seatpost appears almost identical as that on the outgoing R5.</figcaption></figure></li><li><figure><img /><figcaption>The fork gets a significant redesign. </figcaption></figure></li><li><figure><img /><figcaption>Another view of that new fork.</figcaption></figure></li><li><figure><img /><figcaption>Jumbo-Visma is sticking with 11-speed Dura-Ace for the moment, as are all teams so far in this years Tour.</figcaption></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/06/jumbo-visma-rolls-out-new-cervelo-r5-in-team-colours/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"512dff85468d06e48fe8b71b80704c8fa534832e9122a5a9a7354a05d01b9a60","category":"Cycling"}