{"title":"Archaeologists find “lost golden city” buried under sand for 3,400 years","link":"https://arstechnica.com/?p=1756218","date":1618254411000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/luxorTOP-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/luxorTOP.jpg\">Enlarge</a> <span>/</span> Egyptian archaeologists have discovered a 3400-year-old city just outside Luxor, dating back to the reign of Amenhotop III, grandfather to King Tut. (credit: Zahi Hawass)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>A team of Egyptian archaeologists <a href=\"https://news.artnet.com/art-world/lost-city-discovered-luxor-1957997\">has unearthed</a> what some describe as an industrial <a href=\"https://www.facebook.com/permalink.php?story_fbid=294251502062591&amp;id=100044332304573\">royal metropolis</a> just north of modern-day <a href=\"https://en.wikipedia.org/wiki/Luxor\">Luxor</a>, which incorporates what was once the ancient Egyptian city of <a href=\"https://en.wikipedia.org/wiki/Thebes,_Egypt\">Thebes</a> (aka Waset). The archaeologists <a href=\"https://www.nytimes.com/2021/04/08/world/middleeast/egypt-ancient-city.html\">dubbed the site</a> \"the lost golden city of Luxor,\" and they believe it may have been devoted to manufacturing decorative artifacts, furniture, and pottery, among other items.</p>\n<p>Hieroglyphic inscriptions found on clay caps of wine vessels at the site date the city to the reign of the 18th-dynasty pharaoh <a href=\"https://en.wikipedia.org/wiki/Amenhotep_III\">Amenhotep III</a> (1386-1353 BCE), whose generally peaceful tenure was marked by an especially prosperous era, with Egypt at the peak of its international power. (Mud bricks at the site were also marked with Amenhotep III's cartouche.) There are more surviving statues of Amenhotep III than any other pharaoh. He was buried in the Valley of the Kings, and his mummy was discovered in 1889. Analysis revealed that Amenhotep III died between 40 and 50 years of age, and he likely suffered from various ailments in his later years (most notably arthritis, obesity, and painful abscesses in his teeth).</p>\n<p>The pharaoh's eldest son and heir, Thutmose, died young, so the throne passed to his second son, Amenhotep IV, who soon changed his name to <a href=\"https://en.wikipedia.org/wiki/Akhenaten\">Akhenaten</a>. (His queen was <a href=\"https://en.wikipedia.org/wiki/Nefertiti\">Nefertiti</a>, and his son, who would eventually assume the throne, was the famous boy-king, <a href=\"https://en.wikipedia.org/wiki/Tutankhamun\">Tutankhamun</a>.) Akhenaten rejected the traditional polytheistic religion, dominated by the worship of <a href=\"https://en.wikipedia.org/wiki/Amun\">Amun</a>, and decided to start his own religion. He worshipped <a href=\"https://en.wikipedia.org/wiki/Aten\">Aten</a> instead (hence the name change) and would eventually try to suppress the worship of Amun entirely.</p></div><p><a href=\"https://arstechnica.com/?p=1756218#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1756218&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"512db9bc6fac921e4e848891298eb796457f4ee10d1723b463b69416c3acb46d","category":"Tech"}