{"title":"m6A RNA methylation counteracts dark-induced leaf senescence in Arabidopsis","link":"https://academic.oup.com/plphys/article/194/4/2663/7469956?rss=1","date":1702339200000,"content":"<span><div>Abstract</div>Senescence is an important physiological process which directly affects many agronomic traits in plants. Senescence induces chlorophyll degradation, phytohormone changes, cellular structure damage, and altered gene regulation. Although these physiological outputs are well defined, the molecular mechanisms employed are not known. Using dark-induced leaf senescence (DILS) as the experimental system, we investigated the role of N<sup>6</sup>-methyladenosine (m<sup>6</sup>A) mRNA methylation during senescence in Arabidopsis (<span>Arabidopsis thaliana</span>). Plants compromised in m<sup>6</sup>A machinery components like METHYLTRANSFERASE A (<span>mta</span> mutant) and VIRILIZER1 (<span>vir-1</span> mutant) showed an enhanced DILS phenotype. This was accompanied by compromised chloroplast and photosynthesis performance in <span>mta</span> as well as accumulation of senescence-promoting camalexin and phytohormone jasmonic acid after dark treatment. m<sup>6</sup>A levels increased during DILS and destabilized senescence-related transcripts thereby preventing premature aging. Due to inefficient decay, senescence-related transcripts like <span>ORESARA1</span> (<span>ORE1</span>), <span>SENESCENCE-ASSOCIATED GENE 21</span> (<span>SAG21</span>), <span>NAC-like</span>, <span>activated by AP3/PI</span> (<span>NAP</span>), and <span>NONYELLOWING 1</span> (<span>NYE1</span>) over-accumulated in <span>mta</span> thereby causing accelerated senescence during DILS. Overall, our data propose that m<sup>6</sup>A modification is involved in regulating the biological response to senescence in plants, providing targets for engineering stress tolerance of crops.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"512ec7b6c8d48282422ba956261e85cd976f95d6de41895348b767f3e8086322","category":"Environment"}