{"title":"Edible wild plants, chicory and purslane, alleviated diabetic testicular dysfunction, and insulin resistance via suppression 8OHdg and oxidative stress in rats","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301454","date":1712844000000,"content":"<p>by Enas A. Saad, Hanaa A. Hassan, Mamdooh H. Ghoneum, Mai Alaa El-Dein</p>\r\n\r\nTesticular dysfunction is a prevalent health problem frequently reported in individuals with diabetes mellitus (DM). Oxidative-inflammatory reactions, hormonal and spermatic abnormalities often accompany this illness. Herbal remedies “particularly wild plants” including chicory (<i>Chicorium Intybus)</i> and purslane (<i>Portulaca Oleracea)</i> are emerging as popular agents for people dealing with these issues due to their ability to act as antioxidants, reduce inflammation, and exhibit antidiabetic effects. According to the collected data, the daily administration of chicory (Ch) seed-extract (250 mg/kg) or purslane (Pu) seed-extract (200 mg/kg) to streptozotocin (STZ)-induced diabetic rats (50 mg/kg) for 30 days resulted in the normalization of fasting blood glucose (FBG), serum fructosamine, insulin levels, and insulin resistance (HOMA-IR), as well as reducing lipid peroxidation end-product malondialdehyde (MDA) level, aldehyde oxidase (AO) and xanthene oxidase (XO) activities. While caused a considerable improvement in glutathione (GSH) content, superoxide dismutase (SOD), catalase (CAT) activity, and total antioxidant capacity (TAC) when compared to diabetic rats. Ch and Pu extracts had a substantial impact on testicular parameters including sperm characterization, testosterone level, vimentin expression along with improvements in body and testis weight. They also mitigated hyperlipidemia by reducing total lipids (TL), total cholesterol (TC) levels, and low-density lipoprotein cholesterol (LDL-C), while increasing high-density lipoprotein cholesterol (HDL-C). Furthermore, oral administration of either Ch or Pu notably attuned the elevated proinflammatory cytokines as tumor necrotic factor (TNF-α), C-reactive protein (CRP), and Interleukin-6 (IL-6) together with reducing apoptosis and DNA damage. This was achieved through the suppression of DNA-fragmentation marker 8OHdG, triggering of caspase-3 immuno-expression, and elevation of Bcl-2 protein. The histological studies provided evidence supporting the preventive effects of Ch and Pu against DM-induced testicular dysfunction. In conclusion, Ch and Pu seed-extracts mitigate testicular impairment during DM due to their antihyperglycemic, antilipidemic, antioxidant, anti-inflammatory, and antiapoptotic properties.","author":"Enas A. Saad","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"51414baaf17644d83f9b207a43b91829e50a1bcd707cdfb0acb672b304540e0a","category":"Interdisciplinary"}