{"title":"93 Ruminal archaea and bacteria metatranscriptomic responses to supplementation in steers fed low-quality forage","link":"https://academic.oup.com/jas/article/102/Supplement_3/330/7757176?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Forage comprises the majority of beef cattle diets globally, and its quality can vary. Supplementation presents a significant opportunity to improve the efficiency of production. Supplementation has been shown to increase ruminally available nitrogen, improve forage utilization, and reduce livestock methane (CH<sub>4</sub>) emissions. However, corresponding effects of supplementation on gene expression of rumen microbiota, in particular metabolic pathways involved in methanogenesis, have yet to be studied. This study aimed to evaluate the effect of supplement composition before and after feeding on rumen archaeal and bacterial gene expression in steers consuming a low-quality forage diet. Ruminal samples were collected from five ruminally cannulated Angus steers [body weight (BW) = 375 ± 45 kg] used in a 4 × 4 Latin square fed a basal diet of King Ranch Bluestem Hay (3.5% CP, 73% NDF), and one of four isonitrogenous (130 mg N/kg BW) supplements. Steers provided the two most divergent supplements (2% starch, 43% CP; 56% starch, 21% CP) were used for metatranscriptomic analysis. Rumen fluid samples were collected via rumen cannula 0 and 4 h post-feeding. Total RNA was extracted and sequenced. Differentially expressed genes (DEGs) were identified and functionally annotated. Pathway enrichment analysis was completed to determine enriched pathways (broad metabolic pathways) and modules (specific metabolic reactions). Only main effects are presented in this abstract. Archaeal hydrogenotrophic and methylotrophic methanogenesis reactions and tryptophan biosynthesis reactions were upregulated in the 2% starch supplement (<span>P</span> &lt; 0.05). The 2% starch supplement resulted in fewer bacterial total upregulated carbohydrate-active enzymes compared with the 56% starch supplement (957 vs. 1,695 DEGs, respectively; <span>P</span> &lt; 0.05), and an increased proportion of cellulose and hemicellulose-specific enzymes (35 vs. 29%, respectively; <span>P</span> &lt; 0.05). The 56% starch supplement resulted in upregulation of the bacterial 3-Hydroxypropionate bi-cycle reaction (<span>P</span> &lt; 0.05). Collection time exerted a larger effect than supplement composition on both archaeal and bacterial gene expression, with 83% and 63% of DEGs associated with time, respectively (<span>P</span> &lt; 0.05). Archaeal hydrogenotrophic methanogenesis and carbon metabolism were upregulated 4 h post-feeding. In addition, 1,704 bacterial carbohydrate-active enzymes were upregulated 4 h post-feeding, as compared with 975 upregulated at 0 h (<span>P</span> &lt; 0.05). However, these differences in DEGs did not correlate with significantly enriched pathways of bacterial carbohydrate metabolism. These findings demonstrate improvements to low-quality forage utilization, through CP and starch supplementation, can be correlated to relevant changes in gene expression of rumen microbiota. Furthermore, they demonstrate that supplementation influences the expression of methanogenesis reactions, suggesting an opportunity to affect CH<sub>4</sub> production. Additional studies quantifying forage utilization, rumen microbiota gene expression and CH<sub>4</sub> production are needed to further optimize supplementation strategies for improved efficiency of beef production whilst maintaining or reducing its carbon footprint.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5144c9c3883f18845b36c6dcfa2b7ff0cd33aa6fa77cc62f30f4acad2f9a8cea","category":"Environment"}