{"title":"From AVIF to WebP: A New Smashing Book By Addy Osmani","link":"https://smashingmagazine.com/2021/06/image-optimization-book-release/","date":1623153600000,"content":"<p>Images have been a key part of the web for decades. We interpret images much faster than text, which is why high-quality visuals drive conversions and user engagement. To be effective, all these images need to be carefully orchestrated to appear on the screen fast — but as it turns out, loading images efficiently at scale isn’t a project for a quiet afternoon.</p>\n\n<p><strong>Image optimization</strong>, loading behavior and rendering in the browser require understanding of image formats and image compression techniques, image decoding and browser rendering, image CDNs and adaptive media loading, not to mention effective caching and preloading. Let’s figure it all out.</p>\n\n<p>For a thorough guide on image optimization, we’ve teamed up with <a href=\"https://twitter.com/addyosmani\">Addy Osmani</a>, an engineer manager working on Google Chrome who was working all around web performance for decades. The result is a book with <strong>everything you need to optimize your images</strong> and display them fast, without being slowed down along the way.</p>\n\n<ul>\n<li><a href=\"#about-the-book\">Jump to the details ↓</a></li>\n<li><a href=\"http://provide.smashingmagazine.com/eBooks/image-optimization-sample-chapter.pdf\">Download a free PDF sample</a> (12MB)</li>\n<li><strong>Free worldwide airmail shipping</strong> for printed books.\n</li><li><strong><a href=\"/printed-books/image-optimization/\">Get the book right away.</a></strong></li>\n</ul>\n\n\n    <a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b41ae541-7618-44f2-81cd-cc681c64d0d0/image-optimization-header.png\">\n    <img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b41ae541-7618-44f2-81cd-cc681c64d0d0/image-optimization-header.png\" />\n    </a>\n\n\n\n\nAbout The Book\n<p>Next to videos, images are the heaviest, most requested assets on the web. Some of the biggest size savings and <strong>performance improvements</strong> can come through a better image optimization strategy. So how do we encode, deploy, serve and maintain images over time? Our new book explores just that. <a href=\"http://provide.smashingmagazine.com/eBooks/image-optimization-sample-chapter.pdf\">Check free PDF preview</a> (3MB).</p>\n\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/113fce8f-beb6-468d-a0c3-94020d6f09f5/image-optimization-cover-twist-opt.png\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/113fce8f-beb6-468d-a0c3-94020d6f09f5/image-optimization-cover-twist-opt.png\" /></a>Meet our new book <a href=\"#toc\">“Image Optimization”</a> with everything you need to know to get images on the web right.\n\n<p>Addy’s new book <strong>focuses on what matters</strong>: modern approaches to image compression and image delivery, practical tools and techniques to <strong>automate optimization</strong>, responsive images, current and emerging image formats, how browsers load, decode and render images, CDNs, lazy-loading, adaptive media loading and how to optimize for Core Web Vitals. Everything in one, single, 528-pages book. </p>\n\n<p><em>Image Optimization</em> will help you deliver high-quality responsive images in the best format and size, and at the moment when your users need them the most. Packed with <strong>useful tips and techniques</strong>, the book has a sharp focus on practical application and longevity of your image optimization strategies. <a href=\"#toc\">Jump to table of contents ↓</a></p>\n\n\n\n<h3>You’ll learn:</h3>\n<ul>\n<li>image formats,</li>\n<li><strong>image compression</strong>,</li>\n<li>improve image rendering,</li>\n<li>prepare images for a variety of resolutions,</li>\n<li><strong>automate image optimization</strong>,</li><br /><li>image maintenance,</li><br /><li><strong>lazy-loading</strong> and techniques like SQIP,</li><br /><li>image CDNs, and how to set up one,</li><br /><li><strong>AVIF, JPEG XL, and HEIF</strong>, their pros and cons,</li>\n<li><strong>Core Web Vitals</strong> and how to optimize for them,</li>\n<li>adaptive image delivery for network conditions.</li>\n</ul>\n\n\n    <a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e69faa11-dc33-4cfd-8deb-a63e4ee2a90d/image-optimization-open-4-opt.png\">\n    <img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e69faa11-dc33-4cfd-8deb-a63e4ee2a90d/image-optimization-open-4-opt.png\" /></a>A sneak-peek inside the book, with 528 pages on everything image optimization. <a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e69faa11-dc33-4cfd-8deb-a63e4ee2a90d/image-optimization-open-4-opt.png\">Large view</a>.\n    \n\n\nTable Of Contents\n<p>Images help us tell a story and better engage with our customers. There is no shortage of high-quality photos around us, but how to do we encode, deploy, serve and maintain them?</p>\n\n<p>The <strong>23 chapters</strong> of our shiny new book explore just that.</p>\n\n\n<div>\n    \n          \n              <div>\n                <div>\n                  1. The Humble <code>&lt;img&gt;</code> Element\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>The humble <code>&lt;img&gt;</code> element has gained some superpowers over the years. Given how central it is to image optimization on the web, let’s catch up on what it can do.</p>\n             </div>\n         \n          \n              <div>\n                <div>\n                  2. Optimizing Image Quality\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>Most optimization tools allow you to set the level of quality you’re happy with. Lower quality reduces file size but can introduce artifacts, halos, or blocky degrading.</p>\n             </div>\n         \n          \n              <div>\n                <div>\n                  3. Comparing Image Formats\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>Each new image format has a range of effectiveness if you compare and align on a consistent “quality” of experience. In this chapter, we will explore the challenge of defining quality and setting expectations when converting between formats.</p>\n             </div>\n         \n          \n              <div>\n                <div>\n                  4. Color Management\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>Ideally, every screen and web browser in the world would display color in exactly the same way. Unfortunately, they don’t. Color management allows us to reach a compromise on displaying color through color models, spaces, and profiles.</p>\n             </div>\n         \n          \n              <div>\n                <div>\n                  5. Image Decoding Performance\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>How quickly an image can be decoded determines how soon browsers can show it to the user. Keeping this efficient helps ensure a good user experience. Let’s dig deeper into image decoding to understand how browsers perform behind the scenes and how you can control decoding.</p>\n             </div>\n         \n          \n              <div>\n                <div>\n                  6. Measuring Image Performance\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>In this chapter, we will look into how to use Lighthouse to audit for unoptimized images and how to monitor a web performance budget for images.</p>\n             </div>\n         \n          \n              <div>\n                <div>\n                  7. JPEG\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>The JPEG may well be the world’s most widely used image format. Let’s examine JPEG’s compression modes as these can have a significant impact on perceived performance.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  8. PNG\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>From the very basics to palette modes, index and alpha transparency, and compression tips, in this chapter we’ll take an in-depth look at PNGs.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  9. WebP\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>WebP is a relatively recent image format developed with the aim of offering lower file sizes for lossless and lossy compression at an acceptable visual quality. Let’s explore how to use WebP images in production today.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  10. SVG\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>There are a number of ways to implement SVGs in a web page. In this chapter, we’ll take a look at different approaches and at how to keep your SVGs lean and performant.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  11. Responsive Images\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>Using responsive images is a key part of delivering fully responsive web design. This chapter covers techniques for defining responsive images.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  12. Progressive Rendering Techniques\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>There are many progressive image loading techniques that can shorten perceived load time. In this chapter, we’ll look at different ways of progressively loading images to improve performance and the user experience.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  13. Optimizing Network Requests with Caching and Preloading\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>Downloading files such as images or videos over the network can be slow and costly. HTTP caching, service workers, image spriting, and preloading help optimize network requests. Let’s explore how they work.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  14. Lazy-Loading Offscreen Images\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>Web pages often contain a large number of images, contributing to page bloat, data costs, and how fast a page can load. Let’s take a look at how lazy-loading offscreen images can help improve the situation.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  15. Replacing Animated GIFs\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>If you’re aiming to improve the loading performance of your pages, animated GIFs aren’t very compatible with that goal. But this is an area of loading performance where, without a lot of work, you can get significant gains without a loss of content quality.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  16. Image Content Delivery Networks\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>For sites with large traffic and a global reach, basic optimizations at build time are usually not enough. CDNs help teams to handle known static assets ahead of time as well as dynamic assets to improve load times and site reliability.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  17. HEIF and HEIC\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>While other image formats may offer broader compatibility, HEIF is worth being familiar with as you may have users wishing to work with this format on iOS.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  18. AVIF\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>AVIF aims to produce high-quality compressed images that lose as little quality as possible during compression. Let’s dive deeper into its features, browser support, and performance.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  19. JPEG XL\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>JPEG XL is an advanced image format aiming to deliver very significant compression benefits over JPEG. In this chapter, we’ll take a closer look at what it has to offer.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                20. Comparing New Image File Formats\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>While the new image formats support roughly the same sets of capabilities, the strength of each differentiates between them. The tables in this chapter aim to offer a summary of some of the more important features and how well each format handles various image types.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  21. Delivering Light Media Experiences with Data Saver\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>Browsers with Data Saver features give users a chance to explicitly tell us that they want to use a site without consuming so much data. Let’s see how to make use of Data Saver to deliver light media experiences.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  22. Optimize Images for Core Web Vitals\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>Which metrics should you focus on to improve the user experience? Core Web Vitals focuses on three key aspects of user experience: page loading experience, interaction readiness, and the visual stability of the page. Let’s take a look at each one of them.</p>\n             </div>\n         \n         \n              <div>\n                <div>\n                  23. Twitter’s Image Pipeline (Case Study)\n                </div>\n              </div>\n              <div>\n                  +\n              </div>\n          \n          \n              <div>\n                <p>Tweets are often accompanied by images to illustrate, amuse, and increase user engagement. That is why Twitter places so much emphasis on a strong image optimization process. This case study focuses on the different steps that Twitter has taken to load images faster while ensuring they are as impactful as intended.</p>\n             </div>\n         \n    \n</div>\n\n<p><strong>528 pages</strong>. You can <a href=\"/ebooks/image-optimization-ebook/\">start reading the eBook immediately</a> (PDF, ePUB, Amazon Kindle). The printed books are <strong>shipping worldwide</strong>. Written by Addy Osmani. Illustrations by Espen Brunborg and Nadia Snopek.</p>\n\n\n\n    <a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e33ddef4-acff-448a-aa08-d390c6794335/image-optimization-open-1-opt.png\">\n    <img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e33ddef4-acff-448a-aa08-d390c6794335/image-optimization-open-1-opt.png\" />\n    </a>\n\n\n\n\nAbout the Author\n<p><a href=\"https://twitter.com/addyosmani\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/42e34876-9a53-418f-bb21-34e356ef4b00/addy-osmani-200px.jpg\" /></a><em>Addy Osmani</em> is an engineering manager working on Google Chrome. His team <strong>focuses on speed</strong>, helping keep the web fast. Devoted to the open-source community, Addy’s past open-source contributions include <a href=\"https://smashed.by/lighthouse\">Lighthouse</a> (an auditing tool for performance and web best practices), <a href=\"https://developers.google.com/web/tools/workbox\">Workbox</a> (libraries for offline-caching files using service workers), <a href=\"https://yeoman.io/\">Yeoman</a> (the web scaffolding tool), <a href=\"https://smashed.by/critical\">Critical</a> (the critical-path CSS optimization tool), and <a href=\"https://todomvc.com/\">TodoMVC</a>. Addy is the author of the book <a href=\"https://smashed.by/jsdesignpatterns\"><em>Learning JavaScript Design Patterns</em></a>.</p>\n\n\nReviews and Testimonials\n<blockquote><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d7201569-34d3-499e-a78f-f92211ce3fe3/katie-hempenius-200px-opt.png\" />“An incredibly comprehensive overview of image optimization. This book will teach you <strong>everything you need to know</strong> about delivering effective and performant images on the web.”<br /><br />— <a href=\"https://twitter.com/katiehempenius\">Katie Hempenius</a>, Google</blockquote>\n\n<blockquote><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0cee968c-c0e0-4927-ab02-9c0f74f15b11/mathias-bynens-200px-opt.png\" />“<strong>Optimizing image delivery</strong> is key to building high-performance web apps. This book explains everything developers should know about choosing the right image format, compressing image assets — and more!”<br /><br />— <a href=\"https://twitter.com/mathias\">Mathias Bynens</a>, Google</blockquote>\n\n<blockquote><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e371efd8-90d8-4930-bfe8-f986d6815a4c/colin-bendell-200px-opt.png\" />“Images are the heart and soul of the web; they help create that emotional connection with humans. Yet, it is really easy to ruin that experience through slow loading or worse, over quantizing the pixels and distorting images. <strong>Understanding how images work is essential</strong> for every engineer; the last thing we want is to deal with open bugs from bad creative or performance experiences.”<br /><br />— <a href=\"https://twitter.com/colinbendell\">Colin Bendell</a>, Shopify</blockquote>\n\nTechnical Details\n<ul>\n<li>ISBN: 978-3-945749-94-4 (print)</li>\n<li><strong>Quality hardcover</strong>, stitched binding, ribbon page marker.</li>\n<li><strong>Free worldwide airmail shipping</strong> from Germany. You can start reading the eBook right away.</li>\n<li><a href=\"/ebooks/image-optimization-ebook/\">eBook is available, too</a> as PDF, ePUB, and Amazon Kindle.</li>\n<li><a href=\"/printed-books/image-optimization/\">Get the book right away.</a></li>\n</ul>\n\n\nCommunity Matters ❤️\n<p>Producing a book takes quite a bit of time, and we couldn’t pull it off without the support of our wonderful <strong>community</strong>. A huge shout-out to Smashing Members for the kind, ongoing support. The eBook is and always will be <a href=\"https://www.smashingmagazine.com/membership\">free for <em>Smashing Members</em></a>. Plus, Members get a friendly discount when purchasing their printed copy. Just sayin'! ;-)</p>\n\n<p><em>Stay smashing, and thank you for your ongoing support, everyone!</em></p>\n\n\n    <a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6652b6f9-7861-46aa-8f1b-e7ce943f82c5/image-optimization-thanks-opt.png\">\n    <img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6652b6f9-7861-46aa-8f1b-e7ce943f82c5/image-optimization-thanks-opt.png\" />\n    </a>\n\n\n\n\nMore Smashing Books &amp; Goodies\n<p>Promoting best practices and providing you with practical tips to master your daily coding and design challenges has always been (and will be) at the <strong>core of everything we do</strong> at Smashing.</p>\n\n<p>In the past few years, we were very lucky to have worked together with some talented, caring people from the web community to publish their wealth of experience as <a href=\"/printed-books/\">printed books that stand the test of time</a>. Paul and Adam are some of these people. Have you checked out their books already?</p>\n\n<div>\n<div><a href=\"/printed-books/typescript-in-50-lessons/\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c2f2c6d6-4e85-449a-99f5-58bd053bc846/typescript-shop-cover-opt.png\" /></a></div><h4><a href=\"/printed-books/typescript-in-50-lessons/\">TypeScript In 50 Lessons</a></h4><p>Everything you need to know about TypeScript, its type system, generics and its benefits.</p><p><a href=\"/printed-books/typescript-in-50-lessons/\">Add to cart $44</a></p>\n\n<div><a href=\"/printed-books/checklist-cards/\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/efffa8a0-82a0-415a-8aa5-8684a32083eb/checklist-cards-box-opt.png\" /></a></div><h4><a href=\"/printed-books/checklist-cards/\">Interface Design Checklists (PDF)</a></h4><p>100 practical cards for common interface design challenges.</p>\n<p><a href=\"/printed-books/checklist-cards/\">Add to cart $15</a></p>\n\n<div><a href=\"/printed-books/form-design-patterns/\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/dfedd736-f4dd-467b-aed5-7f3cb5af7dd9/form-design-patterns-shop-image-opt.png\" /></a></div><h4><a href=\"/printed-books/form-design-patterns/\">Form Design Patterns</a></h4><p>A practical guide to designing and coding simple and inclusive forms.</p><p><a href=\"/printed-books/form-design-patterns/\">Add to cart $39</a></p>\n</div>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"514b002904f085e9f7175ef3cec568d89f4f07ec7921733cb34c596ba27af19c","category":"Tech"}