{"title":"Non-Invasive Measurement for Early Diagnosis of Diastolic Dysfunction among Acute Hypertensive Heart Failure","link":"https://www.preprints.org/manuscript/202410.1059/v1","date":1728909880000,"content":"Objective. This study aimed to determine the correlation of colour M-mode velocity propagation in the assessment of left ventricular diastolic function among acute decompensated heart failure patients with preserved ejection fraction (HFpEF). Materials and Methods. This research is an observational analytical study using a cross–sectional study design conducted from April to June 2022. The subjects of this study were patients diagnosed with acute HFpEF and treated at Dr. Soetomo General Academic Hospital, Surabaya. Patients with heart rhythm disturbances, moderate to severe valvular heart disease, and congenital heart defects were excluded from this study. Patients were measured for diastolic function including mitral valve early mitral inflow velocity (MV E Velocity), mitral peak velocity of early filling (E’) (E' Septal and E' Lateral), left atrial volume index (LAVI), The maximal tricuspid regurgitation velocity (TR V Max), Vp, the ratio of early diastolic mitral inflow velocity to early diastolic mitral annulus velocity (E/E'), the ratio between early and late ventricular filling velocity (E/A) and E/Vp Ratio. N-terminal-pro hormone B-type natriuretic peptide (NT–ProBNP) examination was also performed on study subjects as an additional diagnosis of acute heart failure. Results. There were 33 patients who met the inclusion and exclusion criteria and were included in our study. There were 26 patients (78.8%) with grade I diastolic dysfunction, 4 patients (12.1%) with grade II diastolic dysfunction, and 3 patients (9.1%) with grade III diastolic dysfunction. There is a strong positive correlation between Vp with parameters E' Septal (p = &amp;lt; 0.001; r = 0.636) and E' Lateral (p = &amp;lt; 0.001; r = 0.650). Vp is negatively correlated with the ratio E/E' (p = 0.029; r = –0.37). The PCWP estimate with E/Vp ratio had a strong correlation with the NT–Pro BNP value &amp;gt; 300 pg/ml in acute HFpEF patients (p = &amp;lt; 0.001; r = 0.726) compared to the PCWP estimate with E/E' (p = &amp;lt; 0.001; r = 0.549). Conclusion. There is no correlation between Vp value and degree of diastolic dysfunction in patients with acute HFpEF.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"514fad0b6a0673d41d6ceb4d3b5ca54472437354b4c25a7dc63041d16e691a26","category":"Interdisciplinary"}