{"title":"Investigating causality between natural resource rents, openness, and economic growth: A quantile approach","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12338?af=R","date":1715139875000,"content":"<h2>Abstract</h2>\n<p>In the present study, the causality between resource rents, openness, and economic growth was investigated using the quantile causality method and quarterly data (2006–2021) in Iran. The advantage of this method is that it makes it possible to investigate the relationships of variables in the conditional distribution tail and all quantiles by using quantile-based conditional regressions. The results showed a bi-direction causality between resource rents and growth in the tail of the distribution. Therefore, in the upper median quantiles, the causality is from the resources rent to growth, and in the lower quantiles, the causality is in the opposite direction. The results confirmed, in general, the presence of bi-direction causality between economic growth and openness in quantiles. In the middle quantile, there is a uni-direction causality relationship from growth to the trade openness, and in the upper quantile, there is causality from openness to economic growth. In addition, the results showed evidence of a tail dependency between resource rents and trade openness, in some quantiles, the causal relationship is from openness to the resources rent, and in the median quantiles, the causality is from rent to openness. These results show that the rent effect of natural resources can be considered as an opportunity for economic growth by adopting appropriate and flexible policies by governments. We recommend the implementation of more trade liberalization policies to maximize the benefits from trade openness, especially in the countries where the resource curse phenomenon reported. Important policy implications can be learned from the empirical results.</p>","author":"Roozbeh Balounejad Nouri","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"515044b9c5f6f7cfb568352f62fafbf31c81f65003fbfc56a07cd2a3441cf13f","category":"Environment"}