{"title":"10 new bikes we’ve spotted at the 2021 Tour de France","link":"https://www.bikeradar.com/features/pro-bike/new-bikes-2021-tour-de-france/","date":1625671817000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/GettyImages-1326818664-7d267d9.jpg?quality=45&amp;resize=620,413\" />                                            <p>The racing at the <a href=\"https://www.bikeradar.com/events/tour-de-france/\">2021 Tour de France</a> has been hugely exciting and, as ever, the event has been a feast for bike nerds.</p>\n<p><a href=\"https://www.bikeradar.com/features/pro-bike/tour-de-france-bikes/\">Tour de France bikes</a> represent the pinnacle of desirable road cycling tech, with flagship frames, top-spec <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road groupsets</a> and premium <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">carbon wheels.</a></p>\n<p>We’ve spotted a number of new, or very nearly new, bikes being put to good use by the best riders in the world, from brands including Pinarello, Specialized, Canyon and more.</p>\n<p>Some are entirely new and have yet to be launched by their makers, while others have put in the odd appearance at early-season races.</p>\n<p>Here for your pleasure are ten new bikes from this year’s Tour de France.</p>\n<h2>1. Pinarello Dogma F</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Richie Porte of Ineos Grenadiers riding the Pinarello Dogma F on stage 10.</span></figcaption><span> <i>Michael Steele / Getty Images</i></span></div>\n<p>We first spotted Ineos Grenadiers riding a new Pinarello at the Tour de Suisse, and the brand officially launched the <a href=\"https://www.bikeradar.com/news/pinarello-dogma-f/\">Dogma F</a> on the eve of the Tour de France.</p>\n<p>Outwardly very similar to its predecessor apart from a redesigned down tube and reshaped seatstays, the Dogma F is claimed to be stiffer, lighter and more aero than the F12.</p>\n<p>Despite the new bike, it’s been a tough Tour for Ineos Grenadiers, with Geraint Thomas out of the reckoning after crashing in the first week, though Richard Caparaz continues to take the challenge to Tadej Pogačar.</p>\n<h2>2. Merida Scultura 5</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dylan Teuns of Bahrain Victorious riding a smart new Merida on stage 8.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>We’ve been expecting a new Scultura to launch ever since Team Bahrain Victorious riders started appearing on an <a href=\"https://www.bikeradar.com/news/merida-scultura-5/\">unnamed lightweight Merida</a> last month, and the same bike is being ridden at the Tour by riders including Dylan Teuns and Wout Poels.</p>\n<p>We still don’t have official confirmation from Merida on the new bike, but given a “Scultura 5” appears on the UCI list of approved frames, it seems all but certain.</p>\n<p>The new bike more closely resembles the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/merida-reacto-6000-review/\">Merida Reacto</a> aero bike than the current Scultura, with dropped seatstays, fully hidden cables and reasonably generous tyre clearances.</p>\n<p>It looks like another bike that continues the trend of lightweight bikes becoming more aero.</p>\n<h2>3. Lapierre Xelius SL</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> David Gaudu of France, Bruno Armirail of France and Valentin Madouas of Groupama–FDJ are all on the new Xelius SL, seen here on stage three.</span></figcaption><span> <i>Michael Steele / Getty Images</i></span></div>\n<p>Staying with the lightweight theme, Lapierre unveiled the <a href=\"https://www.bikeradar.com/news/2022-lapierre-xelius-sl/\">2022 Xelius SL</a> ahead of the Tour.</p>\n<p>The new Xelius is less curvaceous than the model it replaces, but it retains its signature back-end that sees the seatstays pass either side of the seat tube, before joining the top tube; an arrangement that allows greater seat tube deflection and hence improved comfort.</p>\n<p>Although we’re expecting the Xelius to remain Lapierre’s ‘lightweight’ platform – the Aircode is explicitly the aero bike – the new bike is claimed to be more aerodynamic thanks to its new frame and a cockpit that fully integrates the cables.</p>\n<p>Its geometry is apparently slightly more aggressive too and, like so many race bikes, it’s gone disc-only.</p>\n<h2>4. Lightweight Cube Litening?</h2>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/Louis-Meintjes-33b0da8.jpg?quality=90&amp;resize=525%2C683\" /></div>    <figcaption><div>\n    <figcaption><span>Louis Meintjes was riding a new Cube at the 2021 Criterium du Dauphine.</span>\n    </figcaption><span>\n                    <i> Bas Czerwinski / Getty Images</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/Jan-Bakelants-18a99e5.jpg?quality=90&amp;resize=418%2C544\" /></div>    <figcaption><div>\n    <figcaption><span>And Jan Bakelants appears to be riding the new bike at the Tour de France.</span>\n    </figcaption><span>\n                    <i>Chris Graythen / Getty Images</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<p>The Team Intermarché-Wanty-Gobert Matériaux squad appears to be using a new Cube at the Tour.</p>\n<p>At first glance, it looks fairly similar to the current Litening C:68X SLT, Cube’s aero bike, but with slimmed-down tubes.</p>\n<p>That’s most evident at the top tube, seat tube and seatstay junction. Where the existing Litening has deep, aero-profiled tubes here, including a close cutaway for the rear wheel, the new bike is a much more svelte affair.</p>\n<p>The seat tube still looks to have some aero shaping and the seatstays are dropped (of course).</p>\n<p>We don’t know any more at the moment – there’s nothing new on the UCI’s list of approved frames and forks, and no word from Cube on whether this is an updated Litening or another model altogether – but Louis Meintjes was also riding the bike at the Critérium du Dauphiné.</p>\n<h2>5. Specialized S-Works Aethos</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Kasper Asgreen seen here on stage eight making an S-Works Aethos look absolutely tiny.</span></figcaption><span> <i>Michael Steele / Getty Images</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/news/2021-specialized-s-works-aethos/\">Specialized S-Works Aethos</a> isn’t exactly a new bike – it launched last year – but we’re pretty sure this is the first time it’s appeared at a pro race.</p>\n<p>Specialized made a big deal about how its riders no longer had to choose between lightweight and aero when the <a href=\"https://www.bikeradar.com/news/2021-specialized-tarmac/\">Tarmac SL7 launched</a>, and subsequently told us teams wouldn’t be racing the Aethos.</p>\n<p>Clearly the brand couldn’t resist the marketing opportunity to put the new bike in front of the cameras, and so it was that Kasper Asgreen of Deceuninck-QuickStep rode the mountainous eighth stage of the Tour on a bronzey-pink Aethos with a truly breathtaking amount of saddle-to-bar drop.</p>\n<p>A key selling point of the Aethos is that it can easily be built under the UCI’s 6.8kg minimum weight – the standard Dura-Ace Di2 model is claimed to weigh just 6kg without pedals.</p>\n<p>With a full complement of pedals, bottle cages, computer mount and other accessories, it seems unlikely the team had to add any extra weight to Asgreen’s bike, though.</p>\n<h2>6. Canyon Speedmax CFR Disc TT</h2>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/GettyImages-1326310282-805dc3c.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Stage 5’s 27.2km individual time-trial saw riders from three different teams racing Canyon’s newest speed machine.</span>\n    </figcaption><span>\n                    <i>Michael Steele / Getty Images</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/GettyImages-1326317967-96aebf6.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Mathieu van der Poel pulled out a big performance on the new bike to defend his yellow jersey.</span>\n    </figcaption><span>\n                    <i>Tim de Waele / Getty Images</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/GettyImages-1233731718-5820a96.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Arkea–Samsic’s Warren Barguil was on the new bike too.</span>\n    </figcaption><span>\n                    <i>Christine Poujoulat / AFP via Getty Images</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<div></div>\n<p>The UCI-legal version of <a href=\"https://www.bikeradar.com/news/canyon-speedmax-cfr-disc-tt/\">Canyon’s Speedmax</a> TT/tri bike has put in appearances at a handful of races this year.</p>\n<p>Some but not all of Alpecin-Fenix, Movistar Team and Arkéa-Samsic’s riders are using the new model for the Tour’s two individual time trials, including Mathieu van der Poel, who held the yellow jersey during the first time trial before leaving the race.</p>\n<p>The Speedmax CFR Disc TT is disc-only and claimed to be faster than its predecessor, although not by a huge amount – it was already a seriously slippery bike.</p>\n<p>At launch, the new Speedmax was only available with a 1× drivetrain, but the pros all seem to have opted to retain a front derailleur, no surprise given the long, rolling TT courses of the Tour.</p>\n<h2>7. Cannondale’s new TT bike</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Jonas Rutsch of EF Education–Nippo riding the unnamed Cannondale.</span></figcaption><span> <i>Michael Steele / Getty Images</i></span></div>\n<p>It’s a bumper year for <a href=\"https://www.bikeradar.com/advice/buyers-guides/time-trial-bikes/\">time trial bikes</a>, and Cannondale is another brand to bring an unreleased bike to the Tour in the form of what we’re assuming is the replacement for the existing SuperSlice.</p>\n<p>The new TT machine borrows styling cues from the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cannondale-systemsix-hi-mod-etap-axs-review/\">SystemSix</a> aero road bike, with a more angular frameset than the now-old SuperSlice and, of course, it retains <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">road disc brakes</a>.</p>\n<h2>8. Cervélo’s new R-series</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> This is either an updated Cervélo R5 Disc, or perhaps an R6 Disc.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>A number of Jumbo-Visma riders, including Wout van Aert, have been riding an as-yet-unreleased lightweight Cervélo, a bike <a href=\"https://www.bikeradar.com/news/cervelo-r6-disc/\">that first drew our attention back in April</a>.</p>\n<p>We had speculated this might be an all-new bike called the R6 Disc, but chatter elsewhere online suggests it may retain the R5 Disc name, with the move to integrated cables the only really significant change.</p>\n<p>This bike doesn’t appear on the UCI list either, incidentally.</p>\n<h2>9. Trek Speed Concept</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Bauke Mollema Trek-Segafrado on a new TT bruiser.</span></figcaption><span> <i>Michael Steele / Getty Images</i></span></div>\n<p>Not to be left out, Trek’s time trial bike has been updated too, with riders on what appears to be an all-new unreleased Speed Concept.</p>\n<p>Like a number of others in this list, the new bike has fewer organic curves than its predecessor, and more dramatic aero profiles that take advantage of the latest UCI regulations.</p>\n<p>The new seatstay design is one we’ve seen on quite a few bikes – rather than running straight from the seat tube to the rear dropouts, the top of the stay is horizontal, presumably in aid of cleaner airflow.</p>\n<h2>10. De Rosa TT-03 Disk</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Jesús Herrada of Cofidis riding a new disc-equipped De Rosa.</span></figcaption><span> <i>Michael Steele / Getty Images</i></span></div>\n<p>De Rosa supplies bikes to Cofidis and the eagle-eyed will have noticed that the team’s time trial bikes are sporting discs, even though the current TT-03 is rim brake-only.</p>\n<p>Brakes aside, this bike appears virtually identical to the current model. The disc model – the De Rosa TT-03 Disk – has been on the UCI-approved list since February, but De Rosa has yet to announce the bike formally.</p>\n<p><em>Did we miss any? Which of these juicy new bikes are you most excited to lay your hands on? Let us know your thoughts in the comments below.</em></p>","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"5154cfc30acbd612177fccb6d4bc75fd007a9cc38032c1ae1c9feb4ec4b40480","category":"Cycling"}