{"title":"The Predictive Impact of Antipsychotics on Functionality Index in Schizophrenia (PIAF)","link":"https://www.preprints.org/manuscript/202409.2090/v1","date":1727337555000,"content":"Schizophrenia can lead to significant and long-lasting deficits in patients' functionality. The present study aims to identify a theoretical index that predicts the ability of an antipsychotic to improve the functionality of patients with schizophrenia. An advantage of such a theoretical index is that it represents an attempt to supplement with theoretical information the data coming from meta-analysis and systematic reviews and could directly compare antipsychotics. Aspects such as pharmacodynamics, pharmacokinetics, and pharmaceutical forms have been considered. A total of 29 typical and atypical antipsychotics were analyzed. It was constructed the Predictive Impact of Antipsychotics on Functionality Index (PIAF). This parameter considers pharmacodynamics and administration comfort, each expressed through other parameters. PIAF is higher for antipsychotics with both high Pharmacodynamic Scores, which are correlated only with the active substance, and good Comfort of Administration Scores, which are correlated with both the pharmaceutical forms of antipsychotics and the active substance. The best ranking was obtained by the only partial agonist dopaminergic D2 antipsychotic with LAI formulation (aripiprazole LAI), followed by the atypical LAI antipsychotic with the rarest administrations (paliperidone LAI 6M). Given this ranking, a better antipsychotic would result from the combination of a partial dopaminergic agonist with the lowest possible administration frequency. According to PIAF, the most favourable for the functionality are atypical LAI antipsychotics. The partial agonist mechanism of D2 dopamine represents an advantage. Based on this functionality index, the clinical psychiatrist could select the most suitable antipsychotic for patients, with the ultimate goal of achieving individual maximum potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"515c488e6f87e1775a88832265730690face91394ff707dba1dc98c8607a35a7","category":"Interdisciplinary"}