{"title":"Canyon Endurace CFR eTap review - outstanding in its field","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/canyon-endurace-cfr-etap-review-outstanding-in-its-field","date":1692090000000,"content":"\n      <p>Canyon has redesigned and re-launched the top two models in its Endurace range. There’s also been a reshuffle: there’s a brand-new Endurace CFR at the head of affairs with a new CF SLX playing second fiddle with a big price reduction and second-tier groupsets to reflect it.</p>\n<div></div>\n<p>Check out our launch story for all the details [link], but here we’re looking specifically at the new Endurace CFR – I’ve been riding the SRAM Red eTap-equipped model: here are my impressions.</p>\n<p>CFR stands for ‘Canyon Factory Racing’ and has up to now designated an exclusive level for the top bikes ridden by the brand’s sponsored pros. Adding a CFR to the Endurace platform indicates a growing acknowledgement that Canyon’s biggest-spending customers aren’t necessarily racers but still want to benefit from the German brand’s top materials and technology.</p>\n<p>‘Endurace’ is a composite word made up of endurance and race. In its latest fat-tyred, all-road configuration it might now be weighted more towards endurance than race, but I’m convinced that in this case the last half of the word can just as easily stand for ‘ace’. With its unbelievably plush ride quality and startlingly low weight for a bike of this type, it’s a real ace in the pack.</p>\n<p>If a more upright position is what you’re after, you’ve got an incredibly comfortable and super speedy bike on your hands here. Canyon says the Endurace CFR is “arguably the fastest endurance road bike ever made.” I’d say no argument.</p>\n<h3>Frame and fork</h3>\n<p>The CFR frame is made from Canyon’s highest modulus carbon-fibre and saves a claimed 100g over the CF SLX. This time round Canyon doesn’t supply a frame weight and the claimed built-up weights seem to suggest it weighs a little more than the outgoing CF SLX, even though 7.2kg is still impressive.<img alt=\"Canyon Endurace\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Canyon_endurance_-_by_Alessandra_Bucci-4754.jpg?v=1692030581\" /></p>\n<p>Canyon’s Tom Springbett said: “Features like frame storage add functionality, but also weight due to extra material for reinforcement. Same for extra tyre clearance and aero optimisation … more speed in the real world adds a few grams.” However, Springbett pointed out that when taking the CP0018 cockpit into account the total system could be lighter than predecessors.</p>\n<p>The frame storage is neatly done. A neoprene snake of linked compartments slides into the top tube through a trapdoor, meaning you can dispense with a seat pack or tool keg. It’s a shame the tools themselves aren’t shipped with the bike – you only get the neoprene snake.</p>\n<p><img alt=\"Endurace\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Canyon_endurance_-_by_Alessandra_Bucci-4749.jpg?v=1692030667\" /></p>\n<p>Another highlight of the new frame is that it can accommodate up to 35mm tyres. <br />However, Canyon hasn’t designed mudguard capability into the frame, preferring to keep the frame elements shorter for responsive handling, but some people will miss that. Canyon directs you to the Grail and Grizl for all-season, all-weather solutions. <br />There’s a claim of a redesigned head tube and fork for better aerodynamics but visually the new bike is very much still an Endurace.</p>\n<h3>Geometry</h3>\n<p>The Endurace is not just a more comfortable Ultimate – it also has geometry designed to make the ride position easier, which means a higher stack height at the front and a shorter reach. With this latest version the stack/reach ratio has increased slightly (from 1.51 to 1.56 compared to the Ultimate’s 1.43. In real terms that means a 27mm higher stack and 15 mm shorter reach resulting in a less aggressive 1.56 stack-to-reach ratio over the Ultimate’s 1.43.</p>\n<p><img alt=\"Canyon Endurace\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Canyon_endurance_-_by_Alessandra_Bucci-4770_1.jpg?v=1692031078\" /></p>\n<p>I rode a size M Endurace CF last year, when the new lower end models were launched and found the position too upright to feel fast, so this time asked to review a size S Endurace CFR. Now the saddle-bar drop is more acceptable but the reach for me is very short indeed, and with the integrated CP0018 Aerocockpit it’s obvious not a simple case of swapping in a longer stem – you’ve got to order and pay for a replacement (you do get a discount) and then fit it.</p>\n<p>So it’s important to be sure that the Endurace’s geometry is what you’re looking for, otherwise you could be spending more money on making it more aggressive when the Ultimate might be a better option.</p>\n<h3>Build</h3>\n<p>The CFR comes with a choice of SRAM Red eTap (£8,999), Shimano Dura-Ace (£8,999), or Campagnolo Super Record WRL (£9,499) – the top groupsets as befits the top frame. The Campag build gets Bora Ultra wheels while the Shimano and SRAM roll on DT Swiss ERC 1100 Dicut 45s with 180 hubs. These are not the widest on the market with a 22mm internal rim width but with a sub 1,500g weight, ceramic bearings, 45mm deep rims and a 120kg rider limit they complement the CFR nicely.</p>\n<div><img alt=\"Canyon Endurace\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Canyon_endurance_-_by_Alessandra_Bucci-4763.jpg?v=1692030847\" /></div>\n<p>They’re shod with the excellent Schwalbe Pro One TLE tyres, 30mm front and 32mm rear - and there’s still a lot of clearance around them. The maximum tyre width of 35mm wouldn’t present a problem at all for the frame or fork.</p>\n<p>As well as bringing the CFR level to the Endurace range, Canyon has imported the Aerocockpit CP0018 from the Aeroad and Ultimate. It has the +\\- 20mm width and 15mm cut free height adjustment.</p>\n<p><img alt=\"Canyon Endurace\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Canyon_endurance_-_by_Alessandra_Bucci.jpg?v=1692030922\" /></p>\n<p>Both the CFR and the CF SLX get the VCLS 2.0 seatpost, which supplies 20mm of fore-aft travel with a clever clamp that keeps the saddle tilt the same while the two carbon leaf springs that comprise the post can move. This was, and still is, a gamechanger and has to be ridden to be believed.</p>\n<h3>Ride impressions</h3>\n<p>It’s a shame that no one has come up with a unit to express smoothness. If one existed, the Canyon Endurace CFR would be off the scale. It feels so luxurious that it’s a genuine surprise to discover that it accelerates so sharply. You’d only normally get this sensation with an e-bike. And it’s completely silent with not a single rattle anywhere, even on the worst surface.</p>\n<p>I rode the loop that I’ve used for the last 10 years to test bikes. It has a bit of everything - a steep hill at the very start (the surging e-bike feeling), a smooth five miles of tarmac, a little bike of dual carriageway, a potholed lane, a kicker climb with a swooping descent and a long drag.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Canyon_endurance_-_by_Alessandra_Bucci-4757.jpg?v=1692031196\" alt /></p>\n<p>I don’t normally get any Strava medals since I’ve ridden it so many times and on some really fast bikes too - most recently the Cervélo S5, Trek Madone, Giant Propel and Canyon Aeroad (though not the CFR version). On the Endurace CFR I bagged eight, with the most meaningful my second fastest time out of 251 efforts on a 2.76-mile segment called ‘The Full Flanchford’, which is a tough drag followed by a mile-long blast, which I always ride hard since it’s the final quiet-roads section of the loop. I had a favourable tailwind but it wasn’t as strong as the one when I set my PR three years ago, which was only five seconds faster.</p>\n<p>It’s not the most scientific test but it said to me that the Endurace’s level of luxury wasn’t diminishing pedalling efficiency at all, and that despite the shorter reach, I was still aerodynamic, having done the mile-long blast at 24.8mph.</p>\n<p>I wondered whether this level of isolation from vibrations might affect responsiveness on a fast descent or in tight corners, but I found the opposite. I was able to whoosh downhill with total assuredness as if I was on a full suspension mountain bike and lean into the corners through bumps that might have thrown a lesser bike off its line.</p>\n<p><img alt=\"Canyon Endurace\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Canyon_endurance_-_by_Alessandra_Bucci-4743.jpg?v=1692030754\" /></p>\n<p>I can’t remember ever having experienced this level of comfort, low weight and speed in one bike.</p>\n<h3>Verdict</h3>\n<p>With its direct-to-consumer business model Canyon offers good value, and although all three Endurace CFR builds - the pinnacle of the Endurace range - are priced at around £9K at the time of writing, many brands’ flagship bikes are north of £12K now. So at £8,999 at the time of writing for the SRAM Red eTap-equipped Endurace I rode, in terms of price to performance, the new bike nails it.</p>\n<p>The one thing to watch out for, as I said, is the shorter, more upright geometry compared to standard, more aggressive race bikes, but if your budget is £10K and you’re looking for an endurance bike with a race bike’s speed and weight, I haven’t ridden one that does it better than this.</p>\n<p>If your budget is a bit less, it’s worth checking out the Endurace CF SLX, which is priced a lot lower than the CFR, starting from £3,499 for the Shimano 105-equipped model. The highest priced CF SLX is still almost £4,000 cheaper than the lowest priced CFR and all models come with power meters.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"515e3ad362bb355405cca8f4becda58f2f96df3b782c6395cf7f45a111d40b96","category":"Cycling"}