{"title":"Drought shifts soil nematode trophic groups and mediates the heterotrophic respiration","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae012/7617805?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>As the most diverse metazoan taxa, soil nematodes serve a diversity of functions in soil food webs and thus can regulate microbial community composition and affect organic matter decomposition and nutrient turnover rates. Because nematodes depend on water films to access food resources, drought can negatively affect nematode–microbial food webs, yet the impacts of drought on nematode diversity and abundance and how these changes may influence food web members and their functions are hardly explored. Here, we coupled research along a drought gradient in arid and semiarid grasslands with a detailed intact plant–soil microcosm experiment to explore the patterns and mechanisms of how drought impacts nematode abundance and carbon footprint, microbial phospholipid fatty acid (PLFA) and heterotrophic soil respiration. Overall, in the field and the microcosm experiments, we found that nematode abundance, carbon footprint and diversity, microbial PLFA and heterotrophic respiration were reduced under drier conditions. In addition, drought altered nematode and microbial community composition, through reducing the nematode channel ratio and increasing the relative fungivorous nematode abundance and the fungal to bacterial ratio. The soil decomposition channel shifted from a bacterial to a fungal pathway in response to drought, indicating decelerated heterotrophic respiration under drought. These results highlight the important contribution of soil nematodes and their associated microbial food web to soil carbon cycling. Our findings underscore the need to incorporate key soil fauna into terrestrial ecosystem model evaluation.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"51749f61ce846b1c53e472479b815e113ebf642110661a0994a4ca998414f995","category":"Environment"}