{"title":"MacBook Pro’s MagSafe 3 cable is flashing yellow? macOS Monterey might be the problem","link":"https://www.macworld.com/article/553500/if-your-new-macbook-pros-magsafe-3-cable-is-flashing-yellow-the-problem-might-be-macos-monterey.html","date":1637575200000,"content":"<div>\n<section><div></div></section><p>The latest revision to Apple’s magnetically coupled laptop charging system, MagSafe 3, appeared just weeks ago in the new 14-inch and 16-inch MacBook Pro with the M1 Pro or M1 Max processors. Some reports of charging difficulties quickly followed.</p>\n\n\n\n<p>Some users have found that they have a persistent flashing yellow LED—Apple calls the color <em>amber</em>—on their MagSafe 3 cable’s magnetic connector when correctly plugged into the port and the included USB-C adapter. MagSafe has always made it effectively impossible to plug in its connector the wrong way: either it makes the right contact with multiple charging elements and can pass power, or it doesn’t. (If charging properly, the cable head’s LED should be a solid yellow; when fully charged, green.)</p>\n\n\n\n<p>However, even if the cable head’s indicator is flashing yellow, charging continues—just seemingly not using the “fast charge” feature that can add a 50 percent charge to a low battery within 30 minutes when using the MagSafe 3 connector <a href=\"https://www.macworld.com/article/545592/fast-charging-on-the-16-inch-macbook-pro-is-limited-to-magsafe.html\">with the right power adapter</a>.</p>\n\n\n\n<p>This problem doesn’t appear widespread, but it’s common enough you can find people in online forums trying to find answers, and a Macworld reader experienced it first-hand. Owners have worked through several ideas to fixing the problem: getting Apple to replace the cable, adapter, or both, or even swap out the entire laptop. People have reinstalled macOS, and even used the complicated Apple Configurator 2 option to restore the M1-series Mac’s firmware. (See “<a href=\"https://www.macworld.com/article/334317/how-to-revive-or-restore-an-unresponsive-mac-from-another-mac.html\">How to revive or restore an unresponsive Mac from another Mac</a>.”)</p>\n\n\n\n<p>Some people report that Apple phone support told them to shut down their Mac and then hold down Control-Option-Shift at restart. That would be great…except it’s a feature <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/guide/mac-help/if-your-battery-wont-charge-mh29198/mac&amp;xcust=1-1-553500-1-0-0&amp;sref=https://www.macworld.com/feed\">that only works with Intel Macs</a>, and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT201295&amp;xcust=1-1-553500-1-0-0&amp;sref=https://www.macworld.com/feed\">only Intel Macs that shipped before around 2016</a> and lack the T2 Security Chip.</p>\n\n\n\n<p>If you’re having this problem, it may actually be a firmware issue related to Monterey’s 12.0.1 release. In a confusing sequence, Apple shipped macOS 12.0.1 almost immediately after the initial release of Monterey. However, the 14-inch and 16-inch MacBook Pros were already in production, and the 12.0.0 system release had been preinstalled onto their SSDs. When first powering up one of these models, buyers were prompted to install 12.0.1. Based on reports, people who haven’t yet upgraded to 12.0.1 are <em>not</em> seeing the flashing-yellow issue.</p>\n\n\n\n<p>If you’re experiencing this problem, time may solve it. The 12.1 release of Monterey should appear in the new future with several new features—and hopefully a fix for this one.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Mike.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"517b44d938072f69d11c8dc559d68ec68669d8402156b9cb729f0bbc0884088e","category":"Apple"}