{"title":"Is Wahoo about to release a smart roller?","link":"https://cyclingtips.com/2021/09/is-wahoo-about-to-release-a-smart-roller/","date":1632184437000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Kramon_UCIWorldsMenTT2021_00042-650x426.jpg\" /></div><h2>Is Wahoo about to release a smart roller?</h2><p>\n</p><p>Wahoo has an extensive range of trainers in the Kickr family, but one thing we haven’t seen from the company is a set of good old fashioned rollers – until now. </p>\n\n\n\n<p>While Wahoo hasn’t made any official announcement on any forthcoming rollers, images from the start house of the Time Trial World Championships this week have clearly showed riders turning their legs over on Wahoo roller/trainers – a product that we’ll take a stab at being called the Kickr Rollr. </p>\n\n\n\n<p>Rollers are nothing new, but clearly these are something a bit fancier than a basic roller. We can see a pair of extremely narrow roller drums and a static front wheel support stand. The new trainer also seems to offer a smart/interactive resistance control a la the Kickr, with a flywheel, Bluetooth and ANT+ logos, and a power cable running to the rear. Think of these as a pick and mix of parts from the <a href=\"https://cyclingtips.com/2016/03/first-look-review-feedback-sports-omnium-portable-trainer/\">Feedback Omnium</a>, the <a href=\"https://www.velonews.com/gear/tech-wearables/elite-nero-smart-rollers-review/\">Elite Nero interactive rollers</a>, and a <a href=\"https://cyclingtips.com/2020/08/updated-wahoo-kickr-now-calibrates-itself-adds-built-in-rocker-base/\">Wahoo Kickr</a>.</p>\n\n\n\n<p>Wahoo is an official sponsor of the UCI World Championships and riders in the start house can seemingly extend their warm-up by hopping on the unannounced new trainer from Wahoo. At the rear, there are a pair of narrow, almost mini, roller drums, along with what appears to be a smaller version of the flywheel from the Kickr direct drive trainer.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CUCx8PDMG9_/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CUCx8PDMG9_/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Ken Brinsmead (@kenbrinsmead)</a></p></div></blockquote> \n\n\n\n<p>The new trainer replaces the traditional front roller a support stand connected to the rear wheel rollers unit via an adjustable body linking the front and rear sections of the trainer. </p>\n\n\n\n<p>With traditional rollers, a cable connects the front and rear drums to drive the front roller. This drive, powered by the rear wheel turning the rear drum, rotates the front drum. The full front wheel mount, meanwhile, provides the stability required for roller riding without support. </p>\n\n\n\n<p>Many companies offer front wheel replacing mounts for the roller-nervous and Feedback Sports has its rear drum only Omnium rollers for easy transport and pre-event warm-up – these are usually attached at the axle, however, rather than allowing the wheel to stay on. </p>\n\n\n\n<p>The fact Wahoo has opted for mini roller drums and a front wheel support stand might suggest Wahoo has developed this trainer as a portable warm-up option rather than a dedicated home trainer like the Kickr or even the Elite Nero rollers. Rollers are unquestionably more versatile for pre-event warm-ups, and with a dedicated front wheel support stand, a quicker setup and disassembly is possible than what other brands offer. </p>\n\n\n\n<p>However, that front wheel stand presumably adds a lot of bulk to an otherwise minimal package, thus reducing the unit’s portability – which raises the tantalising question of whether the stand may be providing something more than just stability. </p>\n\n\n\n<p>Unfortunately, there are no clear indications of what this added functionality might be. Some variation of the Kickr Climb gradient simulator seems unlikely, and compatibility with the current Kickr Climb also seems unlikely given the instability a rear roller and front Kickr Climb pairing would most likely create. </p>\n\n\n\n<p>Steering functionality for Zwift is perhaps a more feasible possibility for the front wheel support stand, but again this would seem at odds with the portable design characteristics of the rest of the trainer – who wants Zwift steering pre-event? The new rollers will also seemingly require a power source (note the LEDs and power cables on the floor) for at least some of their functionality, but perhaps the rollers double up as smart and not-so-smart rollers. </p>\n\n\n\n<figure><div>\n<blockquote><p>The Olympics Champion has arrived in the <a href=\"https://twitter.com/wahoofitness?ref_src=twsrc%5Etfw\">@wahoofitness</a> Warm-up Zone <img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/1f525.png\" /> <br /><br />Can <a href=\"https://twitter.com/AnnaKiesenhofer?ref_src=twsrc%5Etfw\">@AnnaKiesenhofer</a> do the incredible once more? <a href=\"https://twitter.com/hashtag/Flanders2021?src=hash&amp;ref_src=twsrc%5Etfw\">#Flanders2021</a> <a href=\"https://t.co/pRuqrub00k\">pic.twitter.com/pRuqrub00k</a></p>— UCI (@UCI_cycling) <a href=\"https://twitter.com/UCI_cycling/status/1439942364282376196?ref_src=twsrc%5Etfw\">September 20, 2021</a></blockquote>\n</div></figure>\n\n\n\n<p>Many indoor trainer brands have understandably spent the last few years focusing on developing the latest and greatest direct drive trainers. As many of the big players now regularly release updates to their current range rather than complete redesigns, it seems that direct-drive progression has stalled somewhat. </p>\n\n\n\n<p>I am predicting indoor trainer development to come somewhat full circle in the coming twelve months with a renewed focus on developing modern rollers with smart and interactive features. Wahoo is not the first to bring smart rollers to the indoor scene – Elite already has its Nero Rollers – but don’t expect Wahoo to be the last either. </p>\n\n\n\n<p>Wahoo hasn’t made any official announcement on the new trainer, but we will bring more news as we get it.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Wahoo-Rollr-10-2-1340x754.jpg\" /><figcaption>The new Wahoo trainer appears to be a portable smart roller option for pre-event warm-ups and training away from home.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Wahoo-Rollr-11-2-1340x754.jpg\" /><figcaption>The new trainer seems to take the “Kickr Rollr” branding and features rear wheel only rollers, a flywheel, and presumably some smart/interactive resistance. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Wahoo-Rollr-10-1340x754.jpg\" /><figcaption>The Rollr looks the finished article, but Wahoo had plenty of test riders pre-time trial.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Wahoo-Rollr-8-1340x754.jpg\" /><figcaption>A view of the rollers from the bike’s drive side. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Wahoo-Rollr-5-1340x754.jpg\" /><figcaption>Look under Nathalie Eklund of Sweden’s arm and you can just catch another glimpse of the flywheel. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Wahoo-Rollr-3-1340x754.jpg\" /><figcaption>The new trainer design means both wheels stay on the bike.</figcaption></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/09/is-wahoo-about-to-release-a-smart-roller/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"517c61c9940681a8aadeeedcf8bbceb0b94dc8d4bf07020e66a0be1d2c9a2706","category":"Cycling"}