{"title":"The Major Role of T Regulatory Cells in Efficiency of Vaccination in General and Immunocompromised Populations: A Review","link":"https://www.preprints.org/manuscript/202407.1691/v1","date":1721629443000,"content":"Since its conception with the smallpox vaccination, worldwide-used vaccines have thwarted multiple pandemics including the recent COVID-19 outbreak. Insightful studies uncovered complexities of different functional networks of CD4 T cells [T helper 1 (Th1); Th2, Th17] and CD8 T cells (T cytotoxic; Tc) as well as B cells (BIgM, BIgG, BIgA and BIgE) subsets during response to vaccination. Both T and B cell subsets forge central, peripheral and tissue-resident subsets during vaccination. It also became apparent that each vaccination formed the network of T regulatory subsets, namely CD4+CD25+Foxp3+ T regulatory (Treg) cells and interleukin-10 (IL-10)-producing CD4+Foxp3− T regulatory 1 (Tr1) as well as many others, are shaping the quality/quantity of vaccine-specific IgM, IgG, and IgA antibody production. These components are especially critical for immunocompromised patients, such as older individuals and allograft recipients, as their vaccination may be ineffective or less effective. This review focuses on presenting how pre- and post-vaccination Treg/Tr1 levels influence the vaccination efficacy. Experimental and clinical work revealed that the Treg/Tr1 involvement evoked different immune mechanisms in diminishing vaccine-induced cellular/humoral responses. Alternative steps may be considered to improve the vaccination response by increasing a dose, changing the delivery route and/or repeated booster doses of vaccines. Vaccination may be combined with anti-CD25 (IL-2Ra chain) or anti-PD-1 (programmed cell death protein) monoclonal antibody (mAb) to decrease Tregs and boost the T/B cell immune response. All these data and strategies for immunizations are presented and discussed, aiming to improve the efficacy of vaccination in humans and especially in immunocompromised and older individuals as well as organ transplant patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"517f0afc936b728cf18397768033a38bbfc0137e3b6b8e1d07f5f6b9e6f9f12d","category":"Interdisciplinary"}