{"title":"Opinion: The UCI should not allow those found guilty of sexual harassment to continue working in the sport","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-culprit-in-the-convoy-how-the-uci-allows-those-found-guilty-of-sexual-harassment-to-continue-working","date":1617209478000,"content":"\n      <p><span style=\"font-weight: 400;\">While the women’s peloton were racing hard at Dwars door Vlaanderen today, behind them in the convoy was a man who has been found guilty by the UCI Ethics Commission of sexual harassment. The man in question is Marc Bracke of Doltcini - Van Eyck Sport. Among other violations, he asked former riders to send photos of themselves in their “panties and bra” to — he claimed — monitor their weight and form. </span></p>\n<p>It should be shocking, yet this is the second example of such a case in the last two years. The paltry punishment of Health Mate Cycle Live manager Patrick van Gansen — found guilty of harassment after four former riders came forward with official complaints — caused outrage last month. He received a three-year (retroactively imposed) suspension and needs only to complete a workplace sexual harassment course before he is able to return to the sport in December 2022. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/cycling-s-metoo-moment-part-one\"><em><strong>Related – Cycling's #MeToo Moment</strong></em></a></p>\n<p><span style=\"font-weight: 400;\">The UCI investigation into complaints against Van Gansen began in June 2019, and after being found guilty in April 2020, he would have been free to work within the sport until he was handed this sanction, in February 2021. It’s thanks only to his misguided ego and declaration that \"women’s cycling doesn’t deserve me\" that he didn’t come back to set up a new team. </span></p>\n<p><span style=\"font-weight: 400;\">Bracke evidently has no such illusions. Although the UCI Ethics Commission found him guilty of harassment in October 2020, he will likely continue working in women’s cycling until the UCI’s Disciplinary Commission come to a decision, which — as in the case of Van Gansen — could take up to ten months. </span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/180810_Vargarda_2854-2-1_1024x1024.jpg?v=1617203101\" alt=\"\"></span></p>\n<p><span style=\"font-weight: 400;\">In contrast, as a rider, a doping violation, such as in the </span><a href=\"https://www.uci.org/inside-uci/press-releases/uci-statement-on-matteo-de-bonis-and-uci-proteam-vini-zabu%E2%80%99\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">recent case of Matteo de Bonis</span></a><span style=\"font-weight: 400;\">, comes with a provisional suspension while the Disciplinary Commission decides on sanctions.</span></p>\n<p><span style=\"font-weight: 400;\">The implications of this are damaging both for victims of Bracke’s harassment who are still racing in the peloton and may see him, and riders who may wish to come forward with complaints against staff in the future. For many, the possibility of coming face-to-face with their abuser after filing a complaint would be enough to put them off.</span></p>\n<p><span style=\"font-weight: 400;\">For these men not to be suspended while multiple complaints of harassment are investigated by the Ethics Commission is bad enough. For them to still not be suspended from the sport after being found guilty by the Commission is even more deplorable. The inaction on the part of the governing body sends the message that, for all their Safety Commissions and banning of so-called ‘dangerous’ positions on the bike, protecting and safeguarding the wellbeing of riders in other aspects of the sport really isn’t their top priority. </span></p>\n<p><span style=\"font-weight: 400;\">Further to failing riders by allowing abusers to remain in the sport while the Disciplinary Commission decides how to punish them, the UCI also fails to inform the plaintiff on proceedings and, as the lawyer of Marion Sicot (one of Bracke’s victims) told </span><a href=\"https://www.cyclingnews.com/news/marion-sicot-appeals-to-cas-over-ucis-lack-of-transparency-in-abuse-cases/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">CyclingNews</span></a><span style=\"font-weight: 400;\"> “The UCI basically communicates with the victims through press releases.”</span></p>\n<p><span style=\"font-weight: 400;\">Sicot has appealed to the Court for Arbitration in Sport (CAS) over the UCI’s lack of transparency with victims throughout proceedings. As it currently stands, once riders have filed a formal complaint, they do not receive any further communication from the UCI on their case unless public statements are issued. </span></p>\n<p><span style=\"font-weight: 400;\">Article 21 of the UCI Code of Ethics states: “The person submitting the file shall have no entitlement for proceedings to be opened, to be a party to proceedings or to be informed of any decision passed.” Meanwhile: “Only the persons who are alleged to have committed a violation of the provisions of the Code and against whom proceedings have been initiated shall be considered as parties before the Ethics Commission.”</span></p>\n<p><span style=\"font-weight: 400;\">Those accused of abuse are kept in the loop, while their victims are kept in the dark.</span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/180810_Vargarda_1819_1d62bb74-c5cb-49a6-98be-9a3ec0ec4afb_1024x1024.jpg?v=1617203060\" alt=\"\"></span></p>\n<p><span style=\"font-weight: 400;\">Rider’s union The Cyclists’ Alliance </span><a href=\"https://cyclistsalliance.org/2021/02/recommendations-on-the-uci-ethics-procedure/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">recently released</span></a><span style=\"font-weight: 400;\"> a series of thorough recommendations to the UCI Code of Ethics stating that they had found “some major flaws in the procedure\". One of their main recommendations was for changes to be made to Article 21. TCA sent the recommendations to both the UCI and the UCI-recognised women’s union, CPA Women.</span></p>\n<p><span style=\"font-weight: 400;\">In their report, TCA state: “The victim is directly impacted in the case, and having gathered the courage to file, it seems unreasonable that the rider is then excluded from being a party to the procedure.” They add: “The UCI has a duty to safeguard all parties involved. The procedure should not solely protect the rights of the alleged perpetrator, but also that of the victims.” As of this week, they had yet to receive a response from the UCI. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/iris-slappendel-interview\"><em><strong>Related – \"We can change the culture of the sport\": Iris Slappendel interview</strong></em></a></p>\n<p><span style=\"font-weight: 400;\">The UCI has been known to update its Code of Ethics in recent years. In 2018, a group of riders wrote an article in Dutch newspaper </span><i><span style=\"font-weight: 400;\">de Volkskrant</span></i><span style=\"font-weight: 400;\"> accusing Cervelo-Bigla manager Thomas Campana of, among other things, bullying and fat shaming (allegations that Campana denied). The UCI Code of Ethics at the time was structured so that riders could not file complaints anonymously. </span></p>\n<p><span style=\"font-weight: 400;\">However, while that particular quirk in the Code has since been amended, there are still myriad failings with the way in which the UCI deal with claims of abuse and harassment that need to change sooner rather than later. </span></p>\n<div class=\"klaviyo-form-WBssxm\"></div>\n<p><span style=\"font-weight: 400;\">Dig a little deeper and the problem is much bigger than the governing body itself. As cycling is an Olympic sport, the UCI are bound by an IOC charter which dictates that member sports cannot apply criminal law in cases such as this. As a result, victims cannot take their abusers through the criminal justice system and proceedings are entirely dependent on the governing body who, as we have seen, cannot be trusted to issue appropriate sanctions.</span></p>\n<p><span style=\"font-weight: 400;\">Unless the UCI are prepared to listen to riders, and those with the athletes’ best interests in mind, the sport cannot be considered a safe space for women and girls to compete in when there is no appropriate safeguarding mechanism in place to protect them from abuse.</span></p>\n<p><em><span style=\"font-weight: 400;\">The UCI were asked to contribute a comment to this piece, and after initial publication provided this statement:<br></span></em></p>\n<meta charset=\"utf-8\">\n<p><em><span style=\"font-weight: 400;\"><span>“The UCI is committed to providing a safe environment for all cycling stakeholders, free from any form of discrimination.</span><br><span>Since being put in place in 2016, the Ethics Commission has dealt with a variety of topics and enabled the UCI to fulfill its duty of enforcing ethical rules and behaviour. The Ethics Commission has proven its ability to deal with highly sensitive subjects and in full independence.</span><br><span>The UCI has been in the process of revising certain rules and procedures, some of which are also part of the Cyclists Alliance’s recommendations. The possibility of imposing provisional sanctions shall be provided for in the Code of Ethics, although its application shall only be considered on a case-by-case basis. Other measures aimed at providing an environment which facilitates inappropriate actions being denounced shall also be considered and communicated in due course.”</span><br></span></em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"51861e998874b4c48f46f76898ad1c0bbf6273ee8eaa5deb51704b4feecc6593","category":"Cycling"}