{"title":"The Roles of Alpha, Beta, and Functional Diversity Indices in the Ecological Connectivity between Two Sub-Antarctic Macrobenthic Assemblages","link":"https://www.preprints.org/manuscript/202406.0263/v1","date":1717576453000,"content":"The study of ecological connectivity is a global priority due to the important role it plays in the conservation of diversity. However, few studies in this context have focused on marine benthic ecosystems. To address this issue, the present work determines the ecological connectivity between two sub-Antarctic macrobenthic assemblages through assessment of the α-, β-, and functional diversity indices. Samples were collected using a van Veen grab at stations located in Bahia Inútil and Seno Almirantazgo. The ecological analysis was based on a total of 113 invertebrate taxa. The mean abundance values were lower in Bahia Inútil (888.9 ± 26.8 ind m-2) than in Seno Almirantazgo (1358.6 ± 43.4 ind m-2). While the mean α-diversity values showed significant differences between assemblages, β- and functional diversity indices presented no significant differences. These results indicate that, despite the distance (56 km) separating the two basins from each other, there is a high degree of connectivity at the functional level between the assemblages, due to the high number of shared species and their functional traits. The species most responsible for this observation were the polychaetes Capitela capitata and Aricidia (Acmira) finitima, as well as the bivalves Nucula pisum and Yoldiella sp. 1. In terms of functional biodiversity, species characterized as omnivorous and with lecithotrophic larval development were mostly responsible for connectivity between assemblages. These results suggest the importance of including β- and functional diversity indices as criteria in the future planning of marine protected areas for the maintenance of marine ecosystem integrity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5198b919fcfcc7587b2d8bb1277d2bfad71553ff2b0be304461b70fe7d3c2745","category":"Interdisciplinary"}