{"title":"Zwift doubles down on gamification with more steering-enabled races","link":"https://www.bikeradar.com/news/winter-2023-zwift-update/","date":1694595648000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Zwiftwinter-2023-update-3fe18d8.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Zwiftwinter-2023-update-3fe18d8.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Zwiftwinter-2023-update-3fe18d8.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Zwiftwinter-2023-update-3fe18d8.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Zwiftwinter-2023-update-3fe18d8.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Zwiftwinter-2023-update-3fe18d8.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Zwiftwinter-2023-update-3fe18d8.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Zwiftwinter-2023-update-3fe18d8.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Zwiftwinter-2023-update-3fe18d8.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/Zwiftwinter-2023-update-3fe18d8.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Zwift winter update 2023\" title=\"Zwift winter update 2023\" />                                            <p>Zwift has announced a host of updates, features and events coming to its platform this winter.</p>\n<p>As well as an expansion to its most popular virtual world, Watopia, Zwift is doubling down on gamification with steering-enabled races coming to <a href=\"https://www.bikeradar.com/news/zwift-off-road-and-crit-training-plans-bikes-and-course/\">Crit City</a> and Repack Rush.</p>\n<p>Zwift’s <a href=\"https://www.bikeradar.com/news/zwift-climb-portals/\">Climb Portal</a> feature is seeing an update too, with greater variety and difficulty scaling coming soon.</p>\n<p>The popular virtual <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">indoor cycling app</a> is also introducing a new way to measure Zwift racers against one another.</p>\n<p>Dubbed ‘Zwift Racing Score’, this new metric is designed to help riders find events or races that better match their personal fitness and skill level, compared to using Pace Group categories alone.</p>\n<p>On top of this, Zwift has released details about events taking place this season, including this year’s Tour of Watopia and Zwift Academy, and new initiatives such as the Women’s Training Club.</p>\n<h2>Watopia expansion brings 19km of new roads</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Watopia expansion october 2023\" title=\"tsoz_fall_23_watopia_1\" />\n\n</div><div><figcaption><span><i></i> Zwift’s most popular virtual world is getting a new expansion in October.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Though Zwift has launched a number of new virtual worlds in recent years, it isn’t forgetting about Watopia – its first and most popular map.</p>\n<p>Zwift says 19km of new roads will be added to Watopia in October, connecting the Fuego Flats to the Mayan Jungle.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Watopia expansion\" title=\"tsoz_fall_23_watopia_5\" />\n\n</div><div><figcaption><span><i></i> The new roads are mainly flat, and connect the Fuego Flats to the Mayan Jungle.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>This new section bypasses the Epic KOM climb, with Zwift saying the roads are “fast and flat”.</p>\n<p>As a result of this expansion, Zwift will also be adding eight new routes to Watopia, with distances varying up to 48km in length.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Watopia expansion\" title=\"tsoz_fall_23_watopia_3\" />\n\n</div><div><figcaption><span><i></i> To complement the expansion, eight new routes have been added to Watopia.</span></figcaption><span> <i>Zwift</i></span></div>\n<h2>Climb Portal updates</h2>\n<p>Having launched in July, Zwift says its Climb Portal feature has rapidly gained popularity, with “one-in-five” Zwift users taking on the gamified replicas of real-world climbs in the months since.</p>\n<p>In response, Zwift is bringing more options to Climb Portal “this fall”.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Climb Pro update\" title=\"tsoz_fall_23_climb-scale_2\" />\n\n</div><div><figcaption><span><i></i> Zwift says its Climb Portal feature has quickly become popular amongst its users.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>According to Zwift, users will be able to scale the difficulty of a climb to 50 or 75 per cent of the original, true-to-life difficulty. Of course, the option to take on a climb at 100 per cent difficulty will also remain for those who like a challenge.</p>\n<p>The Climb Portal entrance located in Zwift’s main map, Watopia, will offer users a rotating selection of climbs, bringing more variety and a reason to check the portal every week.</p>\n<p>The France portal, meanwhile, will feature a ‘climb of the month’, which Zwift says will give “the community the chance to ascend famed climbs together”.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Climb Pro update\" title=\"tsoz_fall_23_climb-scale_1\" />\n\n</div><div><figcaption><span><i></i> Users will soon be able to scale the difficulty of climbs in Climb Portal.</span></figcaption><span> <i>Zwift</i></span></div>\n<h2>Zwift Racing Score</h2>\n<p>If you’ve ever moved up a racing category in Zwift, it can sometimes feel like a massive leap to go from the top of one category to the bottom of the next.</p>\n<p>As a result, Zwift has been looking for ways to rank racers with greater precision – and the solution is Zwift Racing Score.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Racing Score\" title=\"tsoz_fall_23_racing-score_1\" />\n\n</div><div><figcaption><span><i></i> Zwift Racing Score is intended to make selecting virtual races at your level a little easier.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Taking several factors into consideration, such as your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/critical-power/\">critical power</a> or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">Functional Threshold Power </a>(FTP), race results and ‘Zwift skills’, Zwift Racing Score is designed to help users find more evenly matched competition.</p>\n<p>Your score will be updated after every race, with gains or losses determined by finishing position and field strength.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Racing Score\" title=\"tsoz_fall_23_racing-score_2\" />\n\n</div><div><figcaption><span><i></i> Your score will be updated after every race, with the game taking a number of factors about your performance into account.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>If you’ve not previously raced, Zwift will base your score on your power output from previous Zwift activities to give a rough starting point.</p>\n<p>Zwift Racing Score will begin to roll out in November, according to the brand.</p>\n<h2>More gamified races are coming soon</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Crit City\" title=\"tsoz_fall_23_crit-city_3\" />\n\n</div><div><figcaption><span><i></i> Gamified races designed for steering are coming to Crit City and Repack Rush this autumn.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Off the back of the launch of its latest hardware offering, the <a href=\"https://www.bikeradar.com/reviews/training/gadgets/zwift-play-first-ride-review/\">Zwift Play</a> controllers, Zwift is adding new gamified races set in Crit City and Repack Rush this autumn.</p>\n<p>The Crit City races will have both steering and braking enabled – two key features catered for by the Zwift Play controllers – and some will even include boost pads and hazards.</p>\n<p>The idea is to test users’ skill as well as their physical prowess.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Crit City\" title=\"tsoz_fall_23_crit-city_1\" />\n\n</div><div><figcaption><span><i></i> Steering-enabled races in Crit City will feature boost pads and hazards.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Zwift is also adding a Repack Rush Event Mode.</p>\n<p>Repack Rush began life as something of a tech demo for Zwift’s steering features, debuting this summer as a map purely for solo time trials.</p>\n<p>Now, though, Zwift says Repack Rush is being turned into a multiplayer environment.</p>\n<p>There are boost pads to hit, hazards to avoid and time bonuses to pick up along the way, with users competing to complete the course in the fastest time.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Repack Rush\" title=\"tsoz_fall_23_repack_1\" />\n\n</div><div><figcaption><span><i></i> Repack Rush is being opened up as a multiplayer environment.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Zwift’s press release also says, “with other riders to avoid, you’ll need to think more carefully about the line you take”. Does this mean virtual crashing could be coming to Zwift?</p>\n<p>Though optimised for the Zwift Play controllers, Zwift says these events can be entered by any user with a compatible steering device.</p>\n<h2>New and returning events on Zwift this season</h2>\n<h3>Zwift Academy returns</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Academy 2023\" title=\"tsoz_fall_23_academy_4\" />\n\n</div><div><figcaption><span><i></i> Got your eyes on a pro contract this year?</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Beyond gamified races and events, there are also plenty of more traditional events coming to Zwift this season.</p>\n<p>For a start, wannabe <a href=\"https://www.bikeradar.com/features/pro-bike/worldtour-bikes/\">WorldTour</a> pros will be thrilled to learn Zwift Academy is returning, and there’s a pro contract on the line with either CANYON//SRAM or the Alpecin-Deceuninck development team, for the top performing female and male riders.</p>\n<p>Starting 6 November, the Zwift Academy features six workouts designed by Zwift’s partner, Dig Deep Coaching.</p>\n<p>To graduate from the Academy, users will also need to complete two Zwift races.</p>\n<p>If you can’t compete for the pro contract, you’ll still be able to unlock a special kit and bike colour scheme for your Zwift avatar.</p>\n<h3>Tour of Watopia 2023</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift: Tour of Watopia 2023\" title=\"tsoz_fall_23_tour-of-watopia_4\" />\n\n</div><div><figcaption><span><i></i> The 2023 Tour of Watopia will give riders the chance to experience the new Watopia expansion in a double-XP event.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>For riders looking to earn double-XP – to help level up their avatar and unlock new bikes and kit in-game – the Tour of Watopia is back.</p>\n<p>This year’s event consists of five stages, with each available to ride on-demand. Riders can complete each stage on their own, or as part of a group through club rides, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-group-rides/\">Zwift MeetUps</a> and group rides or workouts.</p>\n<p>Perhaps unsurprisingly, this year’s Tour of Watopia is designed to give Zwift users a chance to experience the latest Watopia expansion (detailed above).</p>\n<p>Registration for the 2023 Tour of Watopia opens on 25 September, with events beginning on 2 October.</p>\n<h3>Zwift Women’s Training Club</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift women's training club\" title=\"tsoz_fall_23_women_s-training_3\" />\n\n</div><div><figcaption><span><i></i> Zwift is launching a women’s training club, with regular group rides and events led by top female coaches.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>To help its female users “stay motivated and get more out of every ride”, Zwift is launching the Women’s Training Club.</p>\n<p>This club – which is live now – will host regular group rides and workouts, with guidance from professional female coaches, such as three-time Olympic gold medalist, Kristin Armstrong.</p>\n<p>The club will also promote Club chat among members to encourage “social motivation” and keep them coming back for more.</p>\n<h3>Zwift Ride Series: PretzelFest</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Ride Series: Pretzel Fest\" title=\"tsoz_fall_23_pretzel_1\" />\n\n</div><div><figcaption><span><i></i> Take on PretzelFest to unlock the Lederhosen kit this September.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Every month sees the Zwift Ride Series given a new theme and September’s is Oktoberfest (the German beer festival).</p>\n<p>Completing all of the four stages in the PretzelFest series will earn your avatar the Lederhosen kit.</p>\n<h3>Zwift Racing</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Racing League\" title=\"tsoz_fall_23_racing_5\" />\n\n</div><div><figcaption><span><i></i> Zwift Racing League is back on Tuesday nights, and there are plenty of opportunities for solo riders too.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>The Zwift Racing League is back again on Tuesday nights this fall, with Zwift saying it has more teams signed up than ever before.</p>\n<p>If you aren’t part of a team, though, Zwift’s ZRacing series enables solo riders to compete against other Zwifters every week, all-year round.</p>\n<p>Races typically last around 30 to 40 minutes, and have category enforcement activated to keep things fair.</p>\n<p>The theme for each race series changes on a monthly basis, while there’s one ‘stage’ per week that is available to race at multiple times each day.</p>\n<h2>Zwift Companion app update</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift companion app workout update\" title=\"tsoz_fall_23_workout_1\" />\n\n</div><div><figcaption><span><i></i> Zwift is updating its Companion app to enable users to browse workouts outside of the main game.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Zwift also announced its Companion app is getting an update in November to enable users to browse its <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-workouts-training-plans-zwift/\">library of structured workouts</a>, without needing to launch the Zwift app first.</p>\n<p>This, Zwift says, will help streamline the process of picking the right workout for your goals and schedule before getting on the bike and firing up the main Zwift app.</p>\n<h2>Zwift Hub now comes with a year’s subscription to Zwift</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zwift Hub\" title=\"Zwift Hub\" />\n\n</div><div><figcaption><span><i></i> The Zwift Hub is getting more expensive, but it now includes a year’s subscription to Zwift.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>Last but not least, Zwift has announced it is raising the price of its direct-drive <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a>, the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/zwift-hub-review/\">Zwift Hub</a>, from £449/€499/$499 to £549/€599/$599.</p>\n<p>That price now includes a year’s subscription to Zwift, however, which would otherwise cost £12.99/$14.99/€14.99 per month.</p>\n<p>Once that’s taken into account, it’s arguably a better deal than it was previously – unless, of course, you were planning to use another indoor cycling app instead.</p>","author":"Simon von Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"51a6eb6812d4c16749d930cda507029bb6952e17c695d0fda1b8ec247fc13b78","category":"Cycling"}