{"title":"Tour de France history: Bahamontes loses yellow in 1963","link":"https://www.cyclist.co.uk/in-depth/cycling-bahamontes","date":1691495979000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/cycling-bahamontes\">Tour de France history: Bahamontes loses yellow in 1963</a></p>\n\n<p>As he went to bed on the eve of the final mountain stage of the 1963 <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\">Tour de France</a>, Federico Bahamontes must have had mixed feelings. It was his 35th birthday and just hours earlier he had received the greatest of all presents when he pulled on the yellow jersey in Val d’Isère.</p>\n\n\n\n<p>But any joy felt at slipping on yellow would have been tempered with the knowledge that just three seconds separated him from Jacques Anquetil at the top of the GC.</p>\n\n\n\n<p>Anquetil was targeting his third Tour win in succession and his fourth in total. Mindful of the Frenchman’s supremacy against the clock and wanting to maintain public interest in the race, the Tour’s organisers had reduced the number of time-trial kilometres and moved stage finishes closer to mountain summits.</p>\n\n\n\n<p>It was a move designed to bring the race a certain ‘cinematic suspense’, and was thought to be to the advantage of riders such as Bahamontes. The Spaniard’s lead was slender at best, but there remained one more gruelling day in the mountains for the Spaniard to further his lead.</p>\n\n\n\n<h2>Dirty tricks</h2>\n\n\n\n<p>Stage 17 was 225km from Val d’Isère to Chamonix, taking in four climbs along the way. This was Bahamontes territory. Two days before the stage, Miroir-Sprint ran a cartoon drawn by the famous Pellos entitled La Conférence aux Sommets that showed Anquetil twirling a rope over his head in an attempt to lasso a bewinged Bahamontes.</p>\n\n\n\n<p>Anquetil’s sports director, Raphaël Géminiani, was conscious that his rider needed to control the Spaniard and aware landslides on the Col de la Forclaz meant the stage would be diverted onto an unpaved side road with 18% grades. He hatched a plan for a bike change to allow the Frenchman to benefit from a bike more suited to the steep climb.</p>\n\n\n\n<p>‘Changing bikes is forbidden,’ Anquetil is said to have told Géminiani. ‘That’s my business,’ his DS replied.</p>\n\n\n<div>\n<figure><img width=\"968\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/tour-history-bahamontes-2-968x970.jpg\" alt=\"Federico Bahamontes Tour de France\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/tour-history-bahamontes-2-968x970.jpg 968w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/tour-history-bahamontes-2-300x300.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/tour-history-bahamontes-2-150x150.jpg 150w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/tour-history-bahamontes-2-768x770.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/tour-history-bahamontes-2-75x75.jpg 75w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/tour-history-bahamontes-2-350x350.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/tour-history-bahamontes-2-750x752.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/tour-history-bahamontes-2-1140x1143.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/tour-history-bahamontes-2.jpg 1200w\" /><figcaption>1959 Tour winner Federico Bahamontes built a healthy lead on Stage 17 of the 1963 edition, but would fall victim to some dirty tricks from Jacques Anquetil.</figcaption><figcaption>L'Equipe</figcaption></figure></div>\n\n\n<p>Bahamontes is pictured here during the stage having attacked on the Grand-Saint-Bernard. He enjoyed a lead of 1min 30sec over the pass but the gifted climber was not nearly so talented when the road tipped downwards, and he had been caught by the time the race reached the Forclaz.</p>\n\n\n\n<p>There Anquetil reported a mechanical. The race officials, unaware of the wire cutters in the hands of Anquetil’s mechanic, confirmed the cable to the derailleur had snapped and authorised a bike change. Bahamontes still led over the climb but the swap helped Anquetil stay within touching distance.</p>\n\n\n\n<p>The Frenchman crossed the line in Chamonix one second ahead of the Spaniard to win the stage and claim a 30-second time bonus, lifting the jersey from Bahamontes’ shoulders. Bahamontes would finish second in Paris.</p>\n\n\n\n<h2>From king to champion</h2>\n\n\n\n<p>By the time of that 1963 race Bahamontes was already a Tour champion. He’d first ridden the race in 1954, finishing 25th and claiming the first of an eventual six King of the Mountains titles. Top-ten finishes in 1956 and 1958 served as stepping stones to the top step of the podium.</p>\n\n\n\n<p>Bahamontes had signed to the Tricofilina-Coppi trade team for 1959. ‘Don’t lose time on the flat stages and you must win the Tour,’ Fausto Coppi had said to him in the weeks before the race. Bahamontes waited until the Pyrenees to start his bid for victory but by the time the race exited the mountain range he remained more than 13 minutes behind race leader Michel Vermeulin.</p>\n\n\n\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\"><img width=\"970\" height=\"347\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-300x107.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-768x275.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1536x550.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-750x269.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1140x408.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4.jpg 1818w\" /></a><figcaption></figcaption></figure>\n\n\n\n<p>Fast-forward four stages and he was lying third, just 10 seconds off the new leader, Eddy Pauwels, thanks to a storming ride during the Puy de Dôme mountain time-trial.</p>\n\n\n\n<p>As the great mountain passes of the Alps loomed, events began to fall the Spaniard’s way. He took the race lead in Grenoble but just as importantly the French national team was in disarray. Anquetil and Roger Rivière were refusing to work together, fearful of helping the other increase the value of lucrative post-Tour criterium contracts at the expense of their own.</p>\n\n\n\n<p>There was also the problem of the new French national champion, Henri Anglade, who was riding for the regional Centre-Midi team. Anglade was well placed going into the Alps and while Anquetil and Rivière didn’t want each other to win, neither did they want Anglade standing in yellow in Paris.</p>\n\n\n\n<p>So when Anquetil and Rivière found themselves in a break alongside Anglade, with torrential rain falling and a five-minute lead over the yellow jersey-wearing Bahamontes, neither contributed to the effort to stay away.</p>\n\n\n\n<p>‘The other one did not want to lead,’ Rivière said at the finish. The upshot was that Bahamontes clawed his way back and retained the race lead, holding it until Paris to become the first Spaniard to win the Tour.</p>\n\n\n\n<h2>Faint praise</h2>\n\n\n\n<p>If Spain rejoiced heartily – Bahamontes reflected that given the size and noise of his reception in Toledo it was as if ‘he had returned from winning a war’ – the reaction elsewhere was muted. The French team was booed at the Parc des Princes and cycling’s media was less than effusive in their praise.</p>\n\n\n\n<p>‘Bahamontes, did he win a tinpot Tour?’ asked the front page of the Miroir-Sprint, while in the pages of Coureur Jock Wadley wrote that Bahamontes was ‘a great winner of a modest Tour’. All of which seems a little cruel on the Eagle from Toledo who had just secured the greatest win of his career.</p>\n\n\n\n<p>Not that Bahamontes would have cared. Born into a very poor family, he had reached the pinnacle of his sport. In a 2017 interview with the Spanish daily ABC, Bahamontes recalled working on his father’s road gang, aged 12, crushing stones. His family once lived for a week under a tarpaulin in Madrid and ate only what they could find.</p>\n\n\n\n<p>‘The meat we ate was the cats that I hunted at night with a slingshot or with sticks,’ he said. ‘I went hungry, very hungry… That’s why I became a cyclist.’</p>\n\n\n\n<p>Bahamontes passed away on 8th August 2023. He was 95.</p>\n\n\n\n<p><em>Giles Belbin is the author of Tour de France Champions: an A to Z (<a href=\"http://www.thehistorypress.co.uk\" target=\"_blank\">thehistorypress.co.uk</a>)</em></p>\n\n\n\n<p><strong>• This article originally appeared in issue 110 of Cyclist magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/cycling-bahamontes\">Tour de France history: Bahamontes loses yellow in 1963</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Martin James","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"51b53c3ba3dd8eca66249eaffa084fc42bf0e16c8c55ac2dbb9ae556540639cf","category":"Cycling"}