{"title":"Explanations of and interventions against affective polarization cannot afford to ignore the power of ingroup norm perception","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae286/7821164?rss=1","date":1728950400000,"content":"<span><div>Abstract</div>Affective polarization, or animosity toward opposing political groups, is a fundamentally intergroup phenomenon. Yet, prevailing explanations of it and interventions against it have overlooked the power of ingroup norm perception. To illustrate this power, we begin with evidence from 3 studies which reveal that partisans' perception of their ingroup's norm of negative attitudes toward the outgroup is exaggerated and uniquely predicts their own polarization-related attitudes. Specifically, our original data show that in predicting affective polarization (i.e. how one feels about one's partisan outgroup), the variance explained by ingroup norm perception is 8.4 times the variance explained by outgroup meta-perception. Our reanalysis of existing data shows that in predicting support for partisan violence (i.e. how strongly one endorses and is willing to engage in partisan violence), ingroup norm perception explains 52% of the variance, whereas outgroup meta-perception explains 0%. Our pilot experiment shows that correcting ingroup norm perception can reduce affective polarization. We elucidate the theoretical underpinnings of the unique psychological power of ingroup norm perception and related ingroup processes. Building on these empirical and theoretical analyses, we propose approaches to designing and evaluating interventions that leverage ingroup norm perception to curb affective polarization. We specify critical boundary conditions that deserve prioritized attention in future intervention research. In sum, scientists and practitioners cannot afford to ignore the power of ingroup norm perception in explaining and curbing affective polarization.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"51b68633bd07e394862d820da09ac64bd5cae40e88dfd855bd1e06cedf26e2fa","category":"Interdisciplinary"}