{"title":"How to use clipless pedals | Everything you need to know","link":"https://www.bikeradar.com/advice/skills/how-to-use-clipless-pedals/","date":1628769600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2019/05/MG_7826-e232d42.jpg?quality=90&amp;resize=620,413\" />                                            <p>Clipless pedal systems have been used by most serious cyclists since Look applied step-in ski-binding technology to bikes in 1984. Then Bernard Hinault rode Look’s design to <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> victory in 1985 and there was no going back, with clipless pedals arguably becoming one of the top <a href=\"https://www.bikeradar.com/features/cycling-innovations/\">cycling innovations</a> of all time.</p>\n<p>The term ‘clipless’ can be confusing, though, because you ‘clip in’ to these pedals. But it comes from the pedals not having the toe clips (or straps) that you used to find professional cyclists and amateurs alike using to hold their feet in place.</p>\n<p>Some say that using clipless pedals improves pedalling efficiency because they encourage you to engage your foot through the whole pedal of rotation, rather than just pushing on the pedals on the downstroke.</p>\n<p>On the flip side, <a href=\"https://www.researchgate.net/publication/291111249_The_Pedaling_Technique_of_Elite_Endu%5B%E2%80%A6%5Dlists_Changes_with_Increasing_Workload_at_Constant_Cadence\" target=\"_blank\">some studies</a> have shown that really nobody pulls up on the pedals in any useful way, and improved efficiency might just be a sensation.</p>\n<p>Having said that, clipless pedals stop your feet from sliding around, which is important if you’re pedalling at higher <a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">cadences</a>, sprinting, riding in the wet or – for some riders – riding off-road. On that note, we’ve got a guide on <a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\">clipless pedals vs flat pedals</a>, exploring the pros and cons of each.</p>\n<p>Clipless pedals can also be more comfortable, especially on long rides, because your foot is held in the right place and you won’t have to adjust the position.</p>\n<p>Despite being a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/6-road-cycling-rites-of-passage/\">rite of passage for many cyclists</a>, using clipless pedals for the first time can be intimidating, so we’ve put together this guide to explain the different types of clipless pedals, which will suit your riding style, how to use them and finally some tips to keep in mind.</p>\n<h2>Different types of clipless pedals and shoes explained</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Single-sided clipless road pedals are the norm for most road riding.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Making sure you’re on <a href=\"http://www.bikeradar.com/road/gear/article/the-body-mechanic-are-you-on-the-right-pedal-system-44504/\">the right pedal system</a> can be confusing. Most shoes and pedals fall into two categories: <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-pedals/\">road pedals</a>, which use a three-bolt system, and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-pedals-13-of-our-favourites/\">mountain bike pedals</a>, which use a two-bolt system.</p>\n<p>There’s also a four-bolt system as used by Speedplay, but this goes a slightly different route with the locking mechanism contained in the cleat, rather than the pedal.</p>\n<p>Mountain bike cleat systems like Shimano or Crankbrothers pedals require two-bolt SPD cleats.</p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> Shimano SPD pedals offer double-sided entry.</span></figcaption><span> <i>Mildred Locke / Immediate Media</i></span></div></dt>\n</dl></div>\n<p>It’s important to note all three-bolt systems aren’t necessarily compatible with each other, and neither are all two-bolt systems.</p>\n<p>For example, you can’t use Look cleats with Shimano pedals, so check for compatibility before you buy.</p>\n<p>Neither are three-bolt systems like Shimano SPD-SL road pedals compatible with two-bolt Shimano SPD shoes, even though they’re made by the same company.</p>\n<h3>SPD vs. SPD-SL pedals</h3>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> Shimano SPD vs SPD-SL – what’s the right system for you?</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div></dt>\n</dl></div>\n<p>The big benefit of two-bolt systems like Shimano SPD, as used by mountain bikers, is that you can walk easily in the shoes because they have recessed cleats. The shoes usually have some grip in the sole, but they aren’t quite as stiff as a three-bolt system. They do deal with mud and muck well though.</p>\n<p>This makes them popular with beginners and commuters, and as well as featuring on the <a href=\"https://www.bikeradar.com/features/best-shoes-for-mountain-bikers/\">best shoes for mountain bikers</a> they are the go-to cleat design for the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bike-shoes/\">best gravel bike shoes</a> too.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Speedplay is one of the only double-sided road pedal systems on the market.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>They are often double-sided too, meaning that unlike most road pedals (Speedplay is the exception) you don’t have to worry about which way up the pedal is when clipping in.</p>\n<p>By comparison, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-cycling-shoes/\">road shoes</a> are much harder to walk in because the three-bolt cleats stick out from the bottom of the sole. You’ll need to practice walking with your weight on your heels, or you’ll grind away the delicate (and relatively expensive) cleats quickly.</p>\n<p>There’s nothing stopping you from fitting MTB pedals to your road bike if you prefer. It means you can use MTB shoes with recessed cleats, and many people do it.</p>\n<p>Our guide to <a href=\"https://www.bikeradar.com/advice/buyers-guides/shimano-spd-vs-spd-sl/\">Shimano SPD vs. SPD-SL pedals</a> explains everything you need to know about these pedal types, and you can also compare the benefits and disadvantages of <a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\">flat and clipless pedals</a>.</p>\n\n<h2>Cleat set-up</h2>\n<h3>Road pedals</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Cleats can be rotated to enable the shoes to be fixed at a position that’s comfortable to you.</span></figcaption><span> <i>Thomas McDaniel / Immediate Media</i></span></div>\n<p>A good bike shop can help you fix the cleats to your shoes. If you do it yourself, start by positioning the cleat underneath the ball of your foot, and make sure it’s on straight.</p>\n<p>After you have both cleats on, hop on your bike and lean against a wall or a doorway where you can’t fall over, and pedal backwards for a few minutes. At this point, you can adjust the fore/aft of the cleats and even your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/\">saddle height</a> to get comfortable.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A piece of paper can help you dial in the angle of your cleats perfectly.</span></figcaption><span> <i>BikeRadar</i></span></div>\n<p>If you need to change the angle – because your feet naturally point inwards or outwards and you can feel some discomfort – sit on the edge of a table with your legs dangling off the side, your shoes resting on a rectangular piece of paper, with the edge perpendicular to the table.</p>\n<p>Draw around your shoes, then place the cleats on the outlines so they’re still square to the table edge. The angle between the centre line of your shoes and the edge of the paper (centre line of cleat) is your cleat angle.</p>\n<h3>Mountain bike pedals</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Two-bolt mountain bike cleats, with matching shoes and pedals, are a good option for gravel riding because you’ll likely get them caked in mud.</span></figcaption><span> <i>Mick Kirkman / Immediate Media</i></span></div>\n<p>With mountain bike cleats, you can position the cleat in three directions: fore and aft in relation to the axle, as well as the angle in relation to your shoe.</p>\n<p>Tighten down the bolts just enough to keep them firmly in place. Try not to let them dig into the sole of the shoe because the remaining indentations will make fine-tuning harder — carbon soles are more resistant. Don’t use any grease just yet.</p>\n<p>With your shoes back on, balance yourself against a wall and clip in. Your legs should hang naturally down, without any noticeable stress on your joints.</p>\n<p>Check how much float there is to either side — the amount of lateral movement before the cleat disengages — to ensure it’s even. If there’s any discomfort, adjust the cleat until everything feels good.</p>\n<p>If you’re fitting cleats to a new set of shoes, you’ll need to spend some time finding the optimal place in which to position them.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> If you’ve never fitted them before, start with your cleats fitted around the ball of your foot. The red dots identify the 1st (left) and 5th (right) MTP (metatarsalphalangeal joint) — guesstimating the 3rd is a common starting place for fore/aft placement</span></figcaption><span> <i>Thomas McDaniel / Immediate Media</i></span></div>\n<p>With your riding shoes on, but without any cleats fitted, sit on your bike and hang your right foot down in a natural pedalling position. Mark a spot on the sole of the shoe to show where the cleat sits in the fore and aft relation to the axle.</p>\n<p>Roughly speaking, the cleat should sit under the ball of the foot. Many mountain bikers like to slam their cleats as far back as possible, but this is an extreme setting. You’re much better starting with a neutral position and experimenting to see what works for you.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> This Ergon tool is useful for making sure cleat position is consistent across shoes.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<h2>How to use clipless pedals</h2>\n<p>Despite different cleat and pedal designs, the technique for using clipless pedals is virtually the same across brands and types.</p>\n<p>You clip yourself into the pedal by sliding the front of the cleat under the catch on the pedal and pressing down hard with your heel. When you clip in you should both hear and feel the engagement.</p>\n<p>To release your foot, twist your heel out to the side. With some practice, you’ll be able to do this consistently.</p>\n<p>The best way to practice is to start by leaning against a wall, clipping in and out of the pedals until you get the hang of it. Then progress to a quiet road or better yet, a smooth, grassy area.</p>\n<p>Beware of sudden stops if in an urban area, such as junctions, narrow streets (where traffic is reduced to a single lane) and traffic lights. You’ll find that it’s best to unclip your feet before you reach junctions and traffic lights.</p>\n<p>And don’t worry if you do fall off as you get used to using them. It’s happened to the best of us!</p>\n<section><div>\n        <h2>9 tips for using clipless pedals</h2>\n<h3>1. Try double-sided pedals first</h3>\n<p>If you’re nervous about full-on roadie pedals and you’re primarily a commuter, we’d recommend pedals that you can clip into from either side — double-sided pedals.</p>\n<p>Pedals that you clip into on one side but have a ﬂat platform on the other are also handy if you would like to also sometimes ride in ‘normal’ shoes.</p>\n<h3>2. Slacken off the spring tension</h3>\n<p>Before you jump on your bike don’t forget to ﬁrst slacken off each pedal’s spring tension as far as it will go, so it’s as easy as it can be to clip out when you need to. You can then begin to tighten the pedals once you’re confident clipping in and out. </p>\n<h3>3. Practice unclipping while holding onto a fence</h3>\n<p>Don’t try unclipping both feet at the same time. If you’re at all unsure, practice unclipping while holding onto a fence, or in a doorway or narrow hallway. Try to use a quick, clean, positive outwards swivel of your heel rather than a gradual, slow movement.</p>\n<h3>4. Anticipate </h3>\n<p>Anticipating when you’ll need to put a foot down to stop and unclipping beforehand is a good habit to learn, and will possibly save you from falling over.</p>\n<h3>5. Touring or MTB shoes are great for stop-start commuting</h3>\n<p>A touring or mountain bike shoe with a knobbly sole makes a great commuting choice because you can apply pressure on the pedal without fear of your foot slipping off, no matter how the pedal happens to be aligned. This is particularly handy if your ride means you need to keep clipping in and out at trafﬁc lights.</p>\n<p>These shoes also make for easier walking than road shoes, which is ideal for going into your workplace or when you’re locking your bike up. </p>\n<h3>6. Don’t walk too far in road shoes</h3>\n<p>If you intend to do some walking in your cycling shoes, a mountain bike or gravel shoe almost always has a recess along the middle of the sole for the cleat, so it won’t skid noisily on the ﬂoor.</p>\n<p>The recess also helps guide your cleat into place.</p>\n<h3>7. Keep an eye on cleat wear</h3>\n<p>Keep an eye on cleat wear in your shoes, particularly if you’re using plastic three-bolt road cleats. If the cleats wear down they can feel loose in the pedal so you won’t be getting the advantages of using them. Most cleats have wear markers and you can get cleat covers for easier walking too. </p>\n<h3>8. Keep it clean</h3>\n<p>Don’t forget to look after your clipless system — a lack of maintenance could stop you from clipping in or out smoothly and cause a fall.</p>\n<p>Beware of getting your pedals clogged with dirt too.</p>\n<h3>9. Check the lugs</h3>\n<p>If you’re having trouble engaging the pedal, check the lugs on your shoes aren’t getting in the way.</p>\n<p>You may need to cut back some of the rubber around the cleat for added clearance.</p>\n<p>\n\n    </p></div>\n    </section>","author":"Neil Pedoe","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"51bdecff4bc816e50f33526f4367befa880d6e67e1709a928bc2a5b70e52e0f7","category":"Cycling"}