{"title":"Effects of Replacement of Fish Meal with Poultry By‐Product Meal (PBM) on Growth Performance, Digestive Enzyme, and Immunity of Giant River Prawn (Macrobrachium rosenbergii)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/7500596?af=R","date":1680332400000,"content":"<p>A 56-day feeding trial was performed to determine the effect of replacing fishmeal with 0, 25%, 50%, 75%, and 100% PBM (FM) on growth performance, digestive enzyme, and immunity of juvenile giant river prawn (<i>Macrobrachium rosenbergii</i>). Diets were fed in quadruplicate (50 prawns per replicate) to satiation (3–5% of their body weight). The finial weight, weight gain, and specific growth rate of prawns were significantly reduced (<i>P</i> &lt; 0.05) when 100% PBM was substituted for fish meal, whereas the remaining test diets showed no variation compared to the control (<i>P</i> &gt; 0.05). There was no significant difference in survival rates. The moisture, crude protein, and crude fat of the prawn were unchanged (<i>P</i> &gt; 0.05). The SOD activity, MDA content, and AKP activity of hemolymph did not change significantly. However, the ACP activity of all replacement groups decreased significantly (<i>P</i> &lt; 0.05). The amylase enzyme activity in the intestine of prawn fed 25% of PBM increased significantly compared with the control group, while the trypsin and lipase activities were unchanged. This study showed that PBM up to 75% replacement group does not affect growth performance, and all replacement groups have no adverse effect on intestinal digestive enzyme activity and immunity in juvenile <i>M. rosenbergii</i>. Therefore, poultry by-product meal could replace fish meal by up to 75%.</p>","author":"Agyenim Godfred Boateng, \nJingyi Zhao, \nJianghua Zhao, \nHong Xu, \nHongqin Li, \nMin Zhao, \nQiyou Xu, \nCong Liu, \nJianguang Qin","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"51beee7f3398e3df98fa117ca55d28f85ba9e8a05f2367c8b01c36b8d693a927","category":"Environment"}