{"title":"Tour de France 2023 stage 18 preview - an opportunity for the sprinters","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2023-stage-18-preview","date":1689785258000,"content":"\n      <p><b>Distance: </b><span>184.9km<br /></span><b>Start location: </b><span>Moûtiers<br /></span><b>Finish location: </b><span>Bourg-en-Bresse<br /></span><b>Start time: </b><span>13:05 CEST<br /></span><b>Finish time (approx): </b><span>17:31 CEST</span></p>\n<p>A lot has happened in cycling since Bourg-en-Bresse last hosted a <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> stage in 2007. On that occasion, a 22-year-old Mark Cavendish riding his Grand Tour debut was denied showing the world what he could do in a bunch sprint when a mechanical halted his progress, while earlier a 27-year-old Bradley Wiggins, then known as a track specialist far too heavy to even dream about competing for the yellow jersey, spent most of the day out front in a one-man breakaway (‘someone has to make sure there is some entertainment’ was his typically deadpan reasoning). Their extraordinary achievements put into perspective just how much their careers, and British cycling in general, progressed over the next decade.</p>\n<div></div>\n<p>That stage finished in a sprint won by Tom Boonen, but, although the parcours today is similar, with just two categorised climbs to be overcome and little undulating terrain in between, a repeat of that outcome is far from a foregone conclusion. Whereas that stage took place during the opening week, this one comes just days away from the Tour’s completion, and recent history illustrates just how difficult it is for sprinters’ teams to control breakaways this deep into a Grand Tour — excluding the Paris finales, there hasn’t been a bunch sprint during the third week of a Tour since the 2019 edition, with Søren Kragh Andersen, Matej Mohorič and last year Christophe Laporte all denying the sprinters on stages with comparably flattish parcours.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Tappa18.jpg?v=1688388335\" alt /></p>\n<p><i>Stage 18 profile sourced via ASO</i></p>\n<p>Although there was the potential to send the riders up some climbs (such as Val Thorens, which was climbed from today’s start town Moûtiers in a reduced stage of the 2019 Tour, won by Vincenzo Nibali), the organisers have taken pity on the sprinters, who have fought long and hard since their last opportunity way back in Moulins at the start of the second week. Of the climbs that have been included, neither amounts to much; the Côte de Chambéry-le-Haut and Côte de Boissieu are both ranked only category four, and are completed with 80km of flat still to ride.</p>\n<p>It is unusual though to have, as is the case this year, three sprint chances in the last four days, so there may be a degree of complacency among the sprinters’ teams in the knowledge that they have tomorrow to fall back on if they fail to bring the break back today. At 185km, this is also a very long stage — the longest of the final two weeks, in fact —so if a strong breakaway group can get up the road at the start of the day, even the modest terrain will make this a lengthy, difficult chase for the sprinters’ teams in the peloton.</p>\n<h3>Contenders</h3>\n<p><span>After a gruelling second week in the high mountains, the riders have returned to more favourable terrain for the sprinters. However, after the tough gradients and steep inclines they have had to tackle over the last couple of days not all of the key favourites remain in the race, which creates some opportunities for other fast finishers.</span></p>\n<p><span>However, one formidable obstacle stands in the way of those searching for sprint victories: <strong>Jasper Philipsen</strong> (Alpecin-Deceuninck), who has been dominating the bunch sprints this year. With four wins already this Tour, he has proven to be the fastest rider on flat terrain, bolstered by the support of his teammate and top lead-out man Mathieu van der Poel. The final one kilometre straight, flat run-in to the finish will play to Philipsen's strengths, making it a daunting task for anyone to beat this sprinting star.</span></p>\n<p><b>Mads Pedersen</b><span> (Lidl-Trek) has shown he can outpace Philipsen after winning stage eight, but that was with a more challenging finish. He’s certainly fast, but he will need to go all in to beat his Belgian rival today. </span></p>\n<p><span>Meanwhile, several sprinters are still in pursuit of a stage win, including <strong>Dylan Groenewegen</strong> (Jayco-Alula), <strong>Biniam Girmay</strong> (Intermarche-Circus-Wanty), <strong>Alexander Kristoff</strong> (Uno-X Pro Cycling Team), and <strong>Jordi Meeus</strong> (Bora-Hansgrohe). While all have had solid performances in this Tour, only Groenewegen and Girmay have secured podium finishes thus far. The competition remains fierce as they strive to achieve that elusive victory.</span></p>\n<h3>Prediction</h3>\n<p><span>We think Jasper Philipsen will dominate once again and add a fifth Tour stage to his palmarès this year.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"51c4f7f02d0a7dc4a077f8e204cc3f90896c4ff6a9706e6c2288934f9c1d935e","category":"Cycling"}