{"title":"Apple tries to block Epic’s court win before it takes effect on December 9","link":"https://arstechnica.com/?p=1803108","date":1633979416000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-app-store-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-app-store.jpg\">Enlarge</a> (credit: Getty Images | NurPhoto )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Apple is appealing the court ruling that said it must let iOS app developers direct customers to payment options other than Apple's in-app purchasing system. Although Apple previously called the ruling a \"resounding victory\" because its App Store business model was generally upheld, the company is seeking a stay that would prevent implementation of the injunction requiring Apple to loosen its app rules.</p>\n<p>On September 10, Judge Yvonne Gonzalez Rogers of US District Court for the Northern District of California <a href=\"https://arstechnica.com/gadgets/2021/09/injunction-apple-must-open-up-app-store-payments-in-90-days/\">ruled</a> in favor of Epic Games' claim that Apple violated California's Unfair Competition Law. The judge issued a <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.364265/gov.uscourts.cand.364265.813.0_3.pdf\">permanent injunction</a> that said Apple must stop \"prohibiting developers from (i) including in their apps and their metadata buttons, external links, or other calls to action that direct customers to purchasing mechanisms, in addition to In-App Purchasing and (ii) communicating with customers through points of contact obtained voluntarily from customers through account registration within the app.\"</p>\n<p>If Apple isn't successful in blocking that injunction, the iPhone maker will have to comply with it beginning on December 9. That would make it easier for third-party app developers to collect revenue without giving Apple commissions of up to 30 percent.</p></div><p><a href=\"https://arstechnica.com/?p=1803108#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1803108&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"51cab5f0fed01efaee750e980f3abdffe0ed53a56eea0c860d78a3e329b1de47","category":"Tech"}