{"title":"wcm.04.2024.415.419","link":"https://www.watconman.org/wcm-04-2024-415-419/","date":1723691674000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>OLIVE PITS ACTIVATED CARBON AS AN EFFECTIVE ADSORBENT FOR WATER TREATMENT USING H3PO4 AND H2SO4 ACTIVATING AGENTS</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Ahmad Jamrah, Heba Al-Jawaldeh, Tharaa M. Al-Zghou, Arwa Hamaideh, Motasem M Darwish, Emad Al-Karablieh</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.04.2024.415.419\">10.26480/wcm.04.2024.415.419</a></em></span></p>\n<h3>Abstract</h3>\n<div><img src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />Adsorption is a simple, inexpensive, and common practice in water purification and recycling technologies. Therefore, researchers investigated various approaches and materials to develop low-cost adsorbents. Furthermore, researchers investigated using local materials to develop chemically activated carbon that is capable of removing contaminants from water. This study aims to evaluate the preliminary use of olive pit (OP) derived activated carbon for water treatment from Methylene Blue MB. The effectiveness of olive pits as a pollutant’s adsorbent was investigated under various activation conditions (i.e., particle size, pH, temperature, natural water, distilled water) and using two activating agents: H3PO4 and H2SO4. In total, two samples were investigated; the adsorption process attained equilibrium between 60 min and 120 min, while the results indicated the best performance achieved (i.e., highest absorption) at a size of 0.6 mm, a temperature of 30 ○C, and a base medium (i.e., a pH equal to 8.06). Furthermore, it was found that the natural matter present in natural spring water is responsible for competitive adsorption effects; thus, distilled water had better results. This sample was prepared with olive pits prepared with H3PO4.</div>\n<h3>Keywords</h3>\n<p><span>Activated carbon (AC), olive pits activated carbon (OP-AC), adsorption, methylene blue (MB), Langmuir isotherm, Freundlich isotherm</span></p>\n<h3><strong>1. INTRODUCTION</strong></h3>\n<div>\n<p>Water is an essential resource for all forms of life, and access to clean and safe water is crucial for human health, environmental sustainability, and economic development (Shahedi et al., 2020; Hamaideh et al., 2024). However, due to various natural and human activities, water sources can become contaminated with a wide range of pollutants, including organic and inorganic substances, pathogens, heavy metals, and chemicals. These contaminants pose significant risks to public health and the environment (Al-Hmoud et al., 2020; Al-Zghoul et al., 2023). The treatment of water and wastewater plays a vital role in ensuring the availability of clean water for various uses, such as drinking, agriculture, industrial processes, and recreational activities. It involves a series of processes and technologies aimed at removing or reducing contaminants and improving water quality to meet specific standards and regulations (Jamrah et al., 2023).</p>\n<p>The treatment of water and wastewater typically involves physical, chemical, and biological processes tailored to the specific characteristics of the water source and the targeted contaminants (Al-Hmoud et al., 2020). These processes may include coagulation/flocculation, membrane filtration, advanced oxidation, and aerobic and anaerobic processes (Rifi et al., 2022; El Moussaoui, 2022; Domingues et al., 2021; Yahiaoui et al., 2011; da Silva et al., 2021). However, due to their shortcomings, such as complexity, inefficiency, limited biodegradability, and the uneconomic nature of the process, none of these methods met the required standards (Al-Zghoul et al., 2023; Chandra et al., 2020). This has led to an increased interest in improving low-cost adsorbents. Thus, there is an imperative need to find cost-effective and simple dye treatment methods for water treatment (Sakoor and Nasar, 2016).</p>\n<p>The adsorption process has been widely used for the treatment of water and wastewater from organic and inorganic contaminants and is well-considered by researchers (Rajab et al., 2022; Zhou et al., 2018). It has advantages over other methods due to its simplicity, nature, and low investment requirements in terms of both the initial cost and the land required. Compared to other treatment methods, adsorption requires a significantly smaller land area for implementation, making it a more space-efficient option for water and wastewater treatment (Castañeda-Díaz et al., 2017; Ali et al., 2012). As well as the fact that it can remove soluble and suspended contaminants with a 99.9% removal efficiency (Castañeda-Díaz et al., 2017). In recent years, the search for low-cost adsorbents that have pollutant-binding capacities has increased (Zhou et al., 2018). The availability of local materials such as natural materials, agricultural wastes, and industrial wastes can be utilized as low-cost adsorbents to facilitate treating wastewaters (Rashed, 2013).</p>\n<p>The use of activated carbon as an adsorbent for water and wastewater treatments has gained significant attention in recent years due to its tremendous ability to remove and capture pollutants, yet it is limited due to the high cost of preparing activated carbon filters (Ziati et al., 2017; Surkatti et al., 2021). Therefore, preparing activated carbon from locally cheap and available materials such as date pits (DP) and olive pits (OP) was investigated in various research studies to find an alternative to commercial activated carbon (CAC) (Eder et al., 2021; Jamrah et al., 2024; Jamrah et al., 2024). Activated carbon materials showed higher porosity compared to raw materials. This was because most volatile matter was lost and created a system with advanced pore structure during the carbonization process at high temperatures (Ziati et al., 2017). Furthermore, it dehydrates the cellulose material, which weakens the precursor structure and creates pores. In addition, during the chemical activation process, the decomposition of organic material to release volatile matter takes place, and the development of microporous structures increases the adsorption capacity (Surkatti et al., 2021).</p>\n<p>In Jordan, there are a large number of locally available olive trees, and they are economically feasible materials to produce activated carbon (AC) from their pits (El-Sheikh et al., 2004). Olive pits activated carbon is used as an adsorbent for toxic organic and inorganic compounds, such as spill cleaning, groundwater treatment, and drinking water purification (Jamrah et al., 2024; El-Sheikh et al., 2004). Furthermore, recycling local agricultural waste and by-products will reduce waste disposal costs, and most importantly, provide a cheap alternative to CAC (Surkatti et al., 2021). Various studies investigated using olive pits’ efficiency in removing and purifying wastewater, especially removing the byproducts of industrial processes such as Methylene Blue (C16H18ClN3S) (MB) from aqueous solutions (Al-Balushi et al., 2017; Akl et al., 2013).</p>\n<p>MB is commonly used as a cationic dye in chemical marker dyes and biological dyes, besides adding color to wool, cotton, and silk (Khan et al., 2022). A significant amount of organic dye wastewater is produced in the printing and dyeing processes (Donkadokula et al., 2020). Dye wastewater has characteristics such as high chromaticity, high discharge, a high concentration of organic matter, and low biodegradability (Donkadokula et al., 2020). However, this pigment has a variety of harmful consequences for humans and animals, such as inflammation of the lips, throat, esophagus, and stomach with signs of nausea, gastrointestinal pain, vomiting, and diarrhea (Donkadokula et al., 2020; Kuang et al., 2020). Furthermore, skin contact may cause mechanical discomfort, resulting in redness and itching (Kuang et al., 2020).</p>\n<p>The aim of this research is to evaluate the effectiveness of using olive pits-derived activated carbon (OP-AC) as an MB adsorbent in aqueous solutions under different activating conditions. To illustrate, particle size, temperature, pH, and the effect of the water source on the adsorption amount were investigated in this research. This research is the first to discuss the potential of locally sourced OP as a viable alternative to the more mainstream CAC for treating water. The findings of this research could contribute to the development of a sustainable and efficient adsorbent for water treatment applications, addressing the growing need for effective and environmentally friendly solutions in the field of water purification.</p>\n<h3><strong>2. METHODOLOGY</strong></h3>\n<p>In this research, we adopted a 3-stages approach to activate olive pits and assess the effect of various factors on their adsorption process. In line with (Hilal, 2012), the activation process focuses on improving the adsorption capacity by creating a more porous material.</p>\n<p>The first stage involves investigating the possibility of activating OP as an adsorbent. Thereafter, the generation and analysis of adsorption data relied on adsorption isotherms. Finally, the adsorption processes were assessed under various conditions (i.e., particle size, pH, temperature, and water source). The activation process followed the approach and used two different activating agents, H3PO4 and H2SO4 (Al-Balushi et al., 2017). The process consists of washing the seeds (i.e., a quantity of locally available OP) with deionized water to remove foreign materials. Afterwards, the seeds were dried in an oven at 500 °C for 24 h, then transferred to the muffle furnace, where the material was heated at a temperature between 500 °C and 1000 °C. Finally, the seeds were crushed and sieved using a standard sieve for the required size.</p>\n<p>Thereafter, in the second stage, isotherms were generated using a standard “bottle point” batch procedure. The adsorbent samples of determined weight were placed in tubes, and then the surface water solutions were added in sufficient volumes. The reaction (equilibrium reaction time) was started by weighing the quantities as follows: 0.3 g, 0.5 g, 0.7 g, 0.9 g, 1.1 g, and 1.3 g for each of the activating agents. After evaluating the adsorption performance at different weights, it was found that a sample weight of 0.7 g yielded the best results in terms of adsorption capacity. Different concentrations of the pollutant were added as follows: 60 ppm, 70 ppm, 90 ppm, 100 ppm, 120 ppm, 130 ppm, 150 ppm, 200 ppm, 250 ppm, and 300 ppm. The reaction time for each of the aforementioned samples was found at a temperature of 20 °C, and a particle size of 0.6 mm was used for all experiments. Samples were shaken at 100 rpm.</p>\n<p>Finally, the adsorption process was assessed under various conditions. pH, temperature, particle size, and water source effects on the adsorption amount were investigated. A sample weight of 0.7 g was chosen as the best weight and then stabilized for the rest of the experiments. Experiments were repeated at temperatures of 25 °C and 30 °C to study the effect of temperature on the adsorption process.</p>\n<p>Therefore, different grain sizes (1.18 mm and 2 mm) were investigated to study their effect on the adsorption rate. Moreover, the pH effect on the process was studied by controlling the contaminant concentration at pH values of 4.65, 6.4, and 8.06. Finally, the water source affected the process, where distilled water and surface water samples were used. The effect of natural water on the process was studied for the samples at a temperature of 20 °C and a particle size of 0.6 mm.</p>\n<h3><strong>3. RESULTS</strong></h3>\n<p><strong>3.1 Analysis Of MB</strong></p>\n<p>The concentration of MB in the supernatant solution was measured before and after the adsorption using a double-beam UV spectrophotometer at 665 nm. The activated carbon supernatant did not show any absorbance at this wavelength, and the calibration curve was very reproducible. Furthermore, the calibration curve was linear over the concentration spectrum that is used in this study.</p>\n<p><strong>3.2 Olive Pits</strong></p>\n<p><strong>3.2.1 Effect of Particle Size</strong></p>\n<p>Assessing the particle size, the results in Figure 1 indicate that samples activated with the H3PO4 agent have a higher adsorption capacity compared to samples activated with the H2SO4 agent at any equilibrium concentration. Furthermore, the H3PO4-activated sample achieved almost twice the adsorption rate, where samples activated with H2SO4 and particle sizes of 0.6 mm and 1.18 mm achieved up to 1.5 mg/l and 1.0 mg/l adsorption rates, respectively, while samples activated with H3PO4 achieved up to 3.0 mg/l and 2.0 mg/l for the same particle sizes, respectively. Moreover, it is evident that the relation between equilibrium concentration and adsorption when using the H3PO4 agent is almost linear. Finally, the 0.6 mm particle size achieved noticeably higher adsorption rates compared to 1.18 mm in both activating agents.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"832\" height=\"416\" src=\"https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-01.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-01.jpg 832w, https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-01-300x150.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-01-768x384.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 1:</strong> Effect of OP size investigated using 0.6mm and 1.18 mm particles on amount of pollutant adsorption in mg/g using two different activating agents: H3PO4 and H2SO4.</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>3.2.2 Effect of Temperature</strong></p>\n<p>Furthermore, assessing the temperature effect indicated that using an H3PO4 activating agent increased the adsorption rate noticeably compared to an H2SO4 activating agent, especially at high temperatures (i.e., 25 oC and 30 oC), as illustrated in Figure 2. For example, activating olive pits using the H3PO4 agent at 30 ⁰C achieves up to 5 mg/g, which is a 500% increase compared to the same sample adsorption rate that is activated using the H2SO4 agent at the same temperatures and equilibrium concentration. Furthermore, the results indicate that increasing the temperature when using the H3PO4 activating agent would increase the adsorbed amount noticeably. Contrary to this, samples activated using H2SO4 indicated comparable adsorption amounts at 20 oC and 25 oC, while a noticeable increase occurred at 30 oC.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"852\" height=\"422\" src=\"https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-02.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-02.jpg 852w, https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-02-300x149.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-02-768x380.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 2: </strong> Effect of temperature investigated at 3 different temperatures (20 ⁰C , 25 ⁰C , and 30 ⁰C) on amount of pollutant adsorption in mg/g using two different activating agents: H3PO4 and H2SO4.</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>3.2.3 Effect of pH</strong></p>\n<p>Moreover, the results indicated that samples activated with H3PO4 agent achieved a higher adsorption amount at any of the investigated pH values compared to samples activated with H2SO4 agent, as illustrated in Figure 3. Moreover, in both samples, the absorption amount increases with increasing pH values. However, the adsorption amount showed a slight increase when increasing pH from 4.65 to 6.4, while a noticeable increase occurred at pH equal to 8.06.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"859\" height=\"455\" src=\"https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-03.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-03.jpg 859w, https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-03-300x159.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-03-768x407.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 3: </strong>Effect of pH investigated at 3 different concentrations (pH = 8.06), (pH = 6.4), and (pH=4.65) on the amount of pollutant adsorption in mg/g , using two different activating agents: H3PO4 and H2SO4.</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>3.2.4 Competition Effect at 20 ○C For 0.6 Mm Particle Size.</strong></p>\n<p>Finally, the results clearly indicated the importance of using distilled water, where both samples achieved noticeably higher adsorption amounts when used with distilled water, as illustrated in Figure 4. Using distilled water increased the adsorption amount up to 100% and 50% for H3PO4 and H2SO4, respectively.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"809\" height=\"427\" src=\"https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-04.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-04.jpg 809w, https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-04-300x158.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/08/4wcm2024-415-419-04-768x405.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 4: </strong>Effect of water source investigated using distilled water (arrow ended) and natural water on amount of pollutant adsorption in mg/g using two different activating agents: H3PO4 and H2SO4.</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<h3><strong>4. CONCLUSION AND DISCUSSIONS</strong></h3>\n<p>The research investigated the use of locally available carbon-activated materials (i.e., OP) in water treatment with MB. The OP was prepared with two different materials: H3PO4 and H2SO4. Various researchers investigated the use of carbon-activated materials in treating water pollutants to find a more economical and eco-friendly approach using locally available materials (Ahmad et al., 2012; Hassan et al., 2020). The results were in line with those of researchers, where the adsorption improved noticeably. This result is attributed to the increase in porosity surface due to the loss of volatile matter. The results indicated clearly that using H3PO4 achieved better results than using H2SO4.</p>\n<p>The findings of this research confirmed the importance of particle size, which reflects the porous surface area. The results confirmed that for both activating agents, using a larger size would enhance the adsorption rate. Besides, the results showed that using H3PO4 would enhance the adsorption rate, regardless of the activating agent used. In addition, the results demonstrated clearly that increasing temperature would enhance the adsorption rate for both activating agents, especially when using the H3PO4 activating agent.</p>\n<p>Furthermore, the pH results indicated a similar pattern, where the adsorption rate was higher when using the H3PO4 agent. However, increasing the pH value would enhance the adsorption noticeably for both agents, especially at pH 8.06.</p>\n<p>Finally, the results emphasized the importance of water purity, where distilled water achieved a higher adsorption rate in both agents, which is attributed to the dissolved minerals in spring water (e.g., Na, K, Li, Ca, and Ba), which compete with the pollutant on the surface of the adsorbent, leading to a decreased adsorption capacity of the selected pollutant. Regardless, the results confirmed the benefit of using H3PO4 over H2SO4, where higher adsorption rates were achieved when using H3PO4.</p>\n<p>The findings of this research contribute valuable insights into the potential of locally sourced OP as an alternative to CAC for water treatment. The notable adsorption capacities observed under specific conditions indicate the efficacy of this low-cost adsorbent in addressing water pollution, particularly in the removal of MB. The linear relationship between equilibrium concentration and adsorption for H3PO4-activated samples suggests a predictable and controllable adsorption process.</p>\n<p>This research represents a pioneering effort in exploring the potential of OP as an activated carbon source for water treatment, adding to the growing body of knowledge on low-cost adsorbents. The identified optimal conditions provide practical insights for the application of OP-AC in water purification technologies. However, further research is warranted to scale up the production process and assess the material’s long-term performance under real-world conditions. Overall, this study lays the foundation for the development of sustainable and cost-effective solutions for water treatment using locally available resources.</p>\n<h3><strong>ACKNOWLEDGEMENT</strong></h3>\n<p> </p>\n<p>This research was financially supported by ABDUL HAMEED SHOMAN FOUNDATION, Deanship of Academic Research at The University of Jordan, and the Jordanian Higher Council for Science and Technology (HCST) under CYCLOLIVE PRIMA II projects.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>REFERENCES</strong><p></p>\n<ul>\n<li>Ahmad, T., Danish, M., Rafatullah, M., Ghazali, A., Sulaiman, O., Hashim, R., and Ibrahim, M. N. M., 2012. The use of date palm as a potential adsorbent for wastewater treatment: a review. Environmental Science and Pollution Research, 19, Pp. 1464-1484.</li>\n<li>Akl, M. A., Yousef, A. M., and AbdElnasser, S., 2013. Removal of iron and manganese in water samples using activated carbon derived from local agro-residues. J. Chem. Eng. Process Technol.</li>\n<li>Al-Balushi, K., Revanuru, S., and Sajjala, S. R., 2017. Preparation of activated carbon from date seeds and evaluation of its applications. In International Conference on Civil, Disaster Management and Environmental Sciences (CDMES-17), Pp. 2-3.</li>\n<li>Al-Hmoud, L., Al-Saida, B., and Sandouqa, A., 2020. Olive mill wastewater treatment: a recent review. Jordanian J Eng Chem Ind, 3(3), 91-106.</li>\n<li>Ali, I., Asim, M., Khan, T.A., 2012. Low-cost adsorbents for the removal of organic pollutants from wastewater. Journal of environmental management 113: Pp. 170-183.</li>\n<li>Al-Zghoul, T. M., Al-Qodah, Z., and Al-Jamrah, A., 2023. Performance, Modeling, and Cost Analysis of Chemical Coagulation-Assisted Solar Powered Electrocoagulation Treatment System for Pharmaceutical Wastewater. Water, 15(5), Pp. 980.</li>\n<li>Bansal, R.C., Goyal, M., 2005. Activated Carbon Adsorption. CRC Press.</li>\n<li>Castañeda-Díaz, J., Pavón-Silva, T., Gutiérrez-Segura, E., and Colín-Cruz, A. R. T. U. R. O., 2017. Electrocoagulation-adsorption to remove anionic and cationic dyes from aqueous solution by PV-energy. Journal of Chemistry 2017.</li>\n<li>Chandra, S., Dohare, D., Kotiya, A., 2020. Study of Electrocoagulation Process for Removal of Heavy Metals from Industrial Wastewater. A Review. Int. J. Eng. Res. Technol. 9, Pp. 993–999.</li>\n<li>da Silva, S.W., Welter, J.B., Albornoz, L.L., Heberle, A.N.A., Ferreira J.Z., Bernardes, A.M., 2021. Advanced electrochemical oxidation processes in the treatment of pharmaceutical containing water and wastewater: A review. Current Pollution Reports 7: Pp. 146-159.</li>\n<li>Domingues, E., Fernandes, E., Gomes, J., Castro-Silva, S., and Martins, R. C., 2021. Olive oil extraction industry wastewater treatment by coagulation and Fenton’s process. Journal of Water Process Engineering, 39, 101818.</li>\n<li>Donkadokula, N. Y., Kola, A. K., Naz, I., and Saroj, D., 2020. A review on advanced physico-chemical and biological textile dye wastewater treatment techniques. Reviews in environmental science and bio/technology, 19, Pp. 543-560.</li>\n<li>Eder, S., Müller, K., Azzari, P., Arcifa, A., Peydayesh, M., and Nyström, L., 2021. Mass transfer mechanism and equilibrium modelling of hydroxytyrosol adsorption on olive pit–derived activated carbon. Chemical Engineering Journal, 404, 126519.</li>\n<li>El Moussaoui, T., 2022. Studies on the activated sludge process crucial parameters controlling olive mill wastewater treatment. Science of The Total Environment, 838, 156455.</li>\n<li>El-Sheikh, A. H., Newman, A. P., Al-Daffaee, H. K., Phull, S., and Cresswell, N., 2004. Characterization of activated carbon prepared from a single cultivar of Jordanian Olive stones by chemical and physicochemical techniques. Journal of Analytical and Applied Pyrolysis, 71(1), Pp. 151-164.</li>\n<li>Hamaideh, A., Al-Zghoul, T., Dababseh, N., and Jamrah, A. (2024). Enhancing Water Management in Jordan: A Fresh Tomato Water Footprint Analysis. Jordan Journal of Agricultural Sciences.</li>\n<li>Hassan, S. S., Al-Ghouti, M. A., Abu-Dieyeh, M., and McKay, G., 2020. Novel bioadsorbents based on date pits for organophosphorus pesticide remediation from water. Journal of Environmental Chemical Engineering, 8, 103593.</li>\n<li>Hilal, N. M., Ahmed, I. A., and El-Sayed, R. E., 2012. Activated and Nonactivated Date Pits Adsorbents for the Removal of Copper (II) and Cadmium (II) from Aqueous Solutions. International Scholarly Research Notices, 2012.</li>\n<li>Jamrah, A., Al-Zghoul, T. M., and Darwish, M. M., 2023. A comprehensive review of combined processes for olive mill wastewater treatments. Case Studies in Chemical and Environmental Engineering, 100493.</li>\n<li>Jamrah, A., Al-Zghoul, T., Baarimah, A. O., and Al-Karablieh, E. (2024). Abibliometric analysis of olive mill wastewater treatment methods from 1988 to 2023. Case Studies in Chemical and Environmental Engineering, 9, 100736.</li>\n<li>Jamrah, A., AL-Zghoul, T. M., and Al-Qodah, Z. (2024). An Extensive Analysis of Combined Processes for Landfill Leachate Treatment. Water, 16(12), 1640.</li>\n<li>Khan, I., Saeed, K., Zekker, I., Zhang, B., Hendi, A. H., Ahmad, A., and Khan, I., 2022. Review on methylene blue: Its properties, uses, toxicity and photodegradation. Water, 14(2), Pp. 242.</li>\n<li>Kuang, Y., Zhang, X., and Zhou, S., 2020. Adsorption of methylene blue in water onto activated carbon by surfactant modification. Water, 12(2), Pp. 587.</li>\n<li>Rajab, A. R., Jamrah, A., Al-Ani, Y., and Ismael, Z. M., 2022. Biokinetics and treatability of dairy wastewater using sequencing batch reactor. In AIP Conference Proceedings (Vol. 2660, No. 1). AIP Publishing.</li>\n<li>Rashed, M. N., 2013. Adsorption technique for the removal of organic pollutants from water and wastewater. Organic pollutants monitoring, risk and treatment, Pp. 167-194.S.</li>\n<li>Rifi, S. K., Fels, L. E., Driouich, A., Hafidi, M., Ettaloui, Z., and Souabi, S., 2022. Sequencing batch reactor efficiency to reduce pollutant in olive oil mill wastewater mixed with urban wastewater. International Journal of Environmental Science and Technology, 19(11), Pp. 11361-11374.</li>\n<li>Sakoor, S., and Nasar, A., 2016. Removal of methylene blue dye from artificially contaminated water using citrus limetta peel waste as a very low-cost adsorbent. Journal of the Taiwan Institute of Chemical Engineers, 66, Pp. 154-163.</li>\n<li>Shahedi, A., Darban, A. K., Taghipour, F., and Jamshidi-Zanjani, A. J. C. O. I. E., 2020. A review on industrial wastewater treatment via electrocoagulation processes. Current opinion in electrochemistry 22: Pp. 154-169.</li>\n<li>Surkatti, R., Ibrahim, M. H., and El-Naas, M. H., 2021. Date pits activated carbon as an effective adsorbent for water treatment. In Sorbents Materials for Controlling Environmental Pollution. Pp. 135-161. Elsevier.</li>\n<li>Yahiaoui, O., Lounici, H., Abdi, N., Drouiche, N., Ghaffour, N., Pauss, A., and Mameri, N., 2011. Treatment of olive mill wastewater by the combination of ultrafiltration and bipolar electrochemical reactor processes. Chemical Engineering and Processing: Process Intensification, 50(1), Pp. 37-41.</li>\n<li>Zhou, H., Wei, C., Zhang, F., Liao, J., Hu, Y., Wu, H., 2018. Energy-saving optimization of coking wastewater treated by aerobic bio-treatment integrating two-stage activated carbon adsorption. Journal of Cleaner Production 175: Pp. 467-476.</li>\n<li>Ziati, M., Khemmari, F., Cherifi, O., and Didouche, F. Y., 2017. Removal of polyphenols from olive mill wastewater by adsorption on activated carbon prepared from peach stones. Rev. Roum. Chim, 62(11), Pp. 865-874.</li>\n</ul>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>415-419</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>4</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8719\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/4wcm2024/4wcm2024-415-419.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"AqilZ","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"51cca3063b61b6c24f7e85121566fa96878baf4bbcb2986656d28a673d971727","category":"Environment"}