{"title":"Dynamic Analysis of Stool Microbiota of Simmental Calves and Effects of Diarrhea on Their Gut Microbiota","link":"https://www.preprints.org/manuscript/202406.0818/v1","date":1718177983000,"content":"(1) Background:The objective of this study was to explorethe dynamic changes of gut microbiota in Simmental calves before weaning, and compared microbial composition and functionality differences between diarrhea and health calves; (2) Methods: Fourteen neonatal Simmental calves were divided into a health group (n = 8) and diarrhea group (n = 6). The rectal stool samples were collected from each calf on days 1, 3, 5, 7, 9, 12, 15, 18, 22, 26, 30, 35, and 40. The high-throughput sequencing analysis of the 16S rRNA gene V1–V9 region was conducted to explore the changes in gut microbiota over time in both groups and assess the influence of diarrhea on microbiota structure and function; (3) Results: E.coli, B.fragilis, and B.vulgatus were the top three bacterial species of pre-weaning Simmental calves.Meanwhile, the major functions of fecalmicrobiota included the “Metabolic pathways”,“Biosynthesis of secondary metabolites”,“Biosynthesis of antibiotics”, “Microbial metabolism in diverse environments”, and “Biosynthesis of amino acids”. For calves in health group, PCoA revealed that the bacterial profiles generated from days 1, 3, 5, 7, and 9 separated from days 15, 18, 22, 26, 30, 35, and 40. While the microbial profiles of calves on day 12 crossed with both clusters, suggesting that the dynamic changes of microbial structures with the increasing of ages. When compared the difference of the relative abundance of bacteria between calves in health and diarrhea groups, the results showed that the relative abundance of the beneficial L.johnsonii, F.prausnitzii, and Limosilactobacillus in the health group were significantly higher than those in the diarrhea group (p","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"51cd2c830f50416cadb0640fc7dbe12be6aebac922ee8fd16837b08e02cc035c","category":"Interdisciplinary"}