{"title":"23,000-year-old footprints suggest people reached the Americas early","link":"https://arstechnica.com/?p=1797672","date":1632416422000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Bennett-abg7586-image-2.jpg\" /></figure><div><a name=\"page-1\"></a></div>\n<p>Footprints left behind in layers of clay and silt at New Mexico’s White Sands National Park may be between 23,000 and 21,000 years old. That’s based on radiocarbon dating of the remains of grass seeds buried in the layers of sediment above and below the tracks. If the dates are correct, the tracks are evidence that people walked beside the now-dry Lake Otero during the height of the last ice age, when kilometers of ice covered the northern half of the continent. And that would mean that people must have arrived in North America—and made their way to an area well south of the ice—before the ice sheets expanded enough to close off the route.</p>\n<h2>Arriving ahead of the ice sheets</h2>\n<p>Bournemouth University archaeologist Matthew Bennett and his colleagues found a total of 61 human footprints east of an area called Alkali Flat, which was once the bed and shoreline of an ancient lake. Over time, as the lake’s edge expanded and contracted with shifts in climate, it left behind distinct layers of clay, silt, and sand. Seven of those layers, in the area Bennett and his colleagues recently excavated, held human tracks along with those of long-lost megafauna.</p>\n<p>Some of the sediment layers contained the remains of ancient grass seeds mixed with the sediment. Bennett and his colleagues radiocarbon-dated seeds from the layer just below the oldest footprints and the layer just above the most recent ones. According to the results, the oldest footprints were made sometime after 23,000 years ago; the most recent ones were made sometime before 21,000 years ago. At that time, the northern half of the continent was several kilometers below massive sheets of ice.</p></div><p><a href=\"https://arstechnica.com/?p=1797672#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1797672&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"51ce6bdba6d9fa1f7402a15044609aa4869d580a4241e63e1aca24377a050c02","category":"Tech"}