{"title":"Meta’s failed Giphy deal could end Big Tech’s spending spree","link":"https://arstechnica.com/?p=1817989","date":1638623955000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/Business_Shredded-Dollar-1219747202-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/Business_Shredded-Dollar-1219747202.jpg\">Enlarge</a> (credit: Daniel Grizelj | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Instagram? Sure! WhatsApp? Go nuts. But don’t mess with <a href=\"https://arstechnica.com/tech-policy/2021/11/uk-orders-facebook-to-sell-giphy-rejects-metas-proposed-merger-conditions/\">GIFs</a>. That’s the strange position taken by Britain’s competition watchdog in choosing to block Meta’s takeover of GIF repository Giphy. Meta, the UK’s Competition and Markets Authority (CMA) ruled, must now sell all the GIFs—just 19 months after it reportedly <a href=\"https://arstechnica.com/information-technology/2020/05/facebook-spends-400m-buy-giphy-plans-to-integrate-it-with-instagram/\">paid $400 million</a> for them. It’s a bold move—and a global first.</p>\n<p>Never before has a tech giant been ordered to press undo on a completed deal rather than pay a fine or make promises about how the newly merged businesses would operate. <a href=\"https://www.wired.com/tag/meta/\">Meta</a>, the parent company of <a href=\"https://www.wired.com/tag/facebook/\">Facebook</a>, isn’t pleased. A spokesperson says the company disagrees with the decision and that it is considering all options, including an appeal. Usually a cautious bunch, lawyers agree that the CMA’s decision is a significant moment in the global regulatory wrangling of Big Tech, as it means deals that slipped through in the past may now have a new bar to clear. “There's been a realization that quite small deals over the years have not been scrutinized very extensively,” says Richard Pepper, a partner at the law firm Macfarlanes.</p>\n<p>That realization means regulators everywhere will now be on high alert for what the legal world calls “killer acquisitions”—where an established company buys an innovative startup in an attempt to squash the competition it could pose in the future. The CMA’s decision is also significant because Facebook’s Instagram takeover was waved through by its predecessor, the Office of Fair Trading, back in 2012, in what was the most high-profile probe into the deal outside the US. “The same worldwide enforcers that allowed Facebook to suck up Instagram and WhatsApp are now very wary of even small purchases by the major platforms,” says Eleanor Tyler, a legal analyst at Bloomberg Law, a legal research company. “What this shows is a change in attitude, and that's critical.”</p></div><p><a href=\"https://arstechnica.com/?p=1817989#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1817989&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"51d0668f84cf2675000b31bfaab0532ea30c4fc93bf70164fa4006da613fb3f0","category":"Tech"}