{"title":"Optimal Management of Renewable Energy Sources for Industrial Applications: A South African Inland Downstream Oil Refinery Case Study","link":"https://www.preprints.org/manuscript/202407.1538/v1","date":1721333035000,"content":"Motivated by South Africa's need in the transition to a net-zero economy; this study 10 investigates the integration of renewable energy sources (RES) into oil refineries, considering 11 therein unique challenges and opportunities. The research focuses on optimizing RES allocation 12 using Particle Swarm Optimization (PSO), a data-driven approach that adapts to real-time 13 operational conditions. Traditional energy management systems often struggle with the inherent 14variability of RES, leading to suboptimal energy distribution and increased emissions. Therefore, 15 this study proposes a PSO-based renewable energy allocation strategy specifically designed for oil 16 refineries. It considers factors like the levelized cost of energy, geographical location, and available 17 technology. The methodology involves formulating the optimization problem, developing a PSO 18 model, and implementing it in a simulated oil refinery environment. The results demonstrate 19 significant convergence of the PSO algorithm, leading to an optimal configuration for integrating 20 RES and achieving cost reductions and sustainability goals. The optimization result of 4,457,527.00 21 Rand achieved by iterations is much better than the result of 4,829,638.88 Rand acquired using 22Linear Programming as the baseline model. The mean cost, indicating consistent performance, has 23 remained at its original value of 4,457,527.00 Rand, highlighting the convergence. Key findings 24 include the average distance measure decreasing from 4.2 to 3.4, indicating particle convergence; 25 swarm diameter decreasing from 4.7 to 3.8, showing swarm concentration on promising solutions; 26 average velocity decreasing from 7.8 to 4.25, demonstrating refined particle movement; and the 27 optimum cost function achieved at 4,457,527 Rand with zero standard deviation, highlighting 28 stability and optimal solution identification. This research offers a valuable solution for oil 29 refineries seeking to integrate RES effectively, contributing to South Africa's transition to a 30sustainable energy future.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"51d7818b1b6a0f1cb29b4f261951ce788a5c3d3678907fd74e272618b0e1bfc2","category":"Interdisciplinary"}