{"title":"Adopting Sustainability Competencies in Management Education - A Scoping Review of Progress","link":"https://www.preprints.org/manuscript/202410.0652/v1","date":1728446406000,"content":"There is a growing urgency to address society’s complex issues, many of which are incorporated within the Sustainable Development Goals (SDGs). Higher education has a special role and responsibility to support and promote these goals. The SDG framework helps students understand SDGs, but special competencies are necessary to address them effectively. Sustainability competencies impart the personal/emotional development missing from current programming, but higher education institutions have been reluctant to introduce them into the curricula. This study examines the ongoing debate about integrating sustainability competencies into higher education curricula. We employed a scoping review to synthesize the current issues and highlight key barriers to changing the curricula.\n\nContrary to a commonly expressed theme in the literature, scholarly opinion has converged around a singular model for sustainability competencies, the framework proposed by Wiek et al. (2011) and the 2021 update. Integrating sustainability competencies into management education responds to SDG-4 (quality education) and yields far-reaching impacts. The interconnectedness of the goals means that students acquire the competency to understand, address, and promote various SDGs. Given the absence of a policy decision to integrate sustainability competencies into higher education curricula, this paper provides a timely summary of the issues to focus on discussion and potential action. The focus is on business schools and changing management education. Business schools have been selected given the heightened demand from society for businesses to be more involved in and share responsibility for complex global issues like sustainability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"51dbd06c5250c23712f36939750ce71c6074104e5a9f6178ac1d8bd52c9aa229","category":"Interdisciplinary"}