{"title":"Schizachyrium scoparium (C4) better tolerates drought than Andropogon gerardii (C4) via constant CO2 supply for photosynthesis during water stress","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae012/7624586?rss=1","date":1709856000000,"content":"<span><div>Abstract</div>Abstract. Climate change is dramatically altering global precipitation patterns across terrestrial ecosystems, making it critically important that we understand both how and why plant species vary in their drought sensitivities. <span>Andropogon gerardii</span> and <span>Schizachyrium scoparium</span>, both C<sub>4</sub> grasses, provide a model system for understanding the physiological mechanisms that determine how species of a single functional type can differ in drought responses, an issue remains a critical gap in our ability to model and predict the impacts of drought on grassland ecosystems. Despite its greater lability of foliar water content, previous experiments have demonstrated that <span>S. scoparium</span> maintains higher photosynthetic capacity during droughts. It is therefore likely that the ability of <span>S. scoparium</span> to withstand drought instead derives from a greater metabolic resistance to drought. Here, we tested the following hypotheses: (H1) <span>A. gerardii</span> is more vulnerable to drought than <span>S. scoparium</span> at both the population and organismal levels, (H2) <span>A. gerardii</span> is less stomatally flexible than <span>S. scoparium</span>, and (H3) <span>A. gerardii</span> is more metabolically limited than <span>S. scoparium</span>. Our results indicate that it is actually stomatal limitations of CO<sub>2</sub> supply that limit <span>A. gerardii</span> photosynthesis during drought. <span>Schizachyrium scoparium</span> was more drought-resistant than <span>A. gerardii</span> based on long-term field data, organismal biomass production and physiological gas exchange measurements. While both <span>S. scoparium</span> and <span>A. gerardii</span> avoided metabolic limitation of photosynthesis, CO<sub>2</sub> supply of <span>A. gerardii</span> was greatly reduced during late-stage drought stress. That two common, co-occurring C<sub>4</sub> species possess such different responses to drought highlights the physiological variability inherent within plant functional groups and underscores the need for more studies of C<sub>4</sub> drought tolerance.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"51dde9d01c0964f3493b6920bb6b6bf2d604773640b5ff9b92b78aad3ca27407","category":"Environment"}