{"title":"Yuval Harari on AI","link":"https://markpeak.net/yuval-harari-on-ai/","date":1679885575000,"content":"<p>สารภาพตามตรงว่า ในโลกปี 2023 <a href=\"https://markpeak.net/yann-lecun-and-the-ai-gold-rush/\">ยุคตื่นทอง AI ทั่วหล้า</a> ผมก็ไม่ได้มีมุมมองที่ชัดเจนหรือลึกซึ้งนักในเรื่องผลกระทบต่อ AI ไปไกลกว่าความเห็นพื้นๆ จำพวก “<a href=\"https://markpeak.net/dull-dirty-and-dangerous/\">เราต้องใช้ประโยชน์จาก automation ในงานที่ไม่เหมาะกับมนุษย์</a>”</p>\n<p>เมื่อตัวเองไม่รู้ก็จงไปดูว่า “คนที่น่าจะรู้” เขาคิดอย่างไรกัน ช่วงนี้มีนักคิดระดับบิ๊กเนมอย่าง Yuval Harari นักประวัติศาสตร์ผู้เขียนหนังสือ Sapiens <a href=\"https://www.nytimes.com/2023/03/24/opinion/yuval-harari-ai-chatgpt.html\">เขียนบทความแสดงความเห็นลงใน New York Times</a> พอดี</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.nytimes.com/2023/03/24/opinion/yuval-harari-ai-chatgpt.html\">\n\t\t\t\t\t<img src=\"https://static01.nyt.com/images/2023/03/24/autossell/24harari-2/24harari-2-facebookJumbo.jpg\" alt=\"Opinion | You Can Have the Blue Pill or the Red Pill, and We’re Out of Blue Pills\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.nytimes.com/2023/03/24/opinion/yuval-harari-ai-chatgpt.html\">\n\t\t\tOpinion | You Can Have the Blue Pill or the Red Pill, and We’re Out of Blue Pills\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.nytimes.com/2023/03/24/opinion/yuval-harari-ai-chatgpt.html\">\n\t\t\t<p>In games like chess, no human can hope to beat a computer. What happens when the same thing occurs in art, politics or religion?</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://www.nytimes.com/vi-assets/static-assets/favicon-d2483f10ef688e6f89e23806b9700298.ico\" alt=\"www.nytimes.com\" />\t\twww.nytimes.com\t</div>\n</div>\n<p>อ่านความเห็นของ Harari (และเพื่อนอีกสองคนที่เขียนด้วยกัน) แล้วต้องยอมรับว่าน่าตื่นตาตื่นใจมาก แม้ยังไม่ค่อยแน่ใจว่าเห็นด้วยหรือเห็นแย้งแค่ไหน แต่การมาจดบันทึกเก็บไว้ย่อมเป็นเรื่องดี</p>\n<p>ประเด็นสำคัญของ Harari คือ เราปล่อยให้เทคโนโลยี AI ออกมาสร้างผลกระทบต่อสังคมอย่างเสรี AI ตัวใหม่ๆ ออกมาเร็วเกินไป จนตอนนี้เร็วถึงระดับที่สังคมมนุษย์จะปรับตัวไม่ทัน <strong>“at a pace faster than cultures can safely absorb them.”</strong></p>\n<blockquote><p>Drug companies cannot sell people new medicines without first subjecting their products to rigorous safety checks. Biotech labs cannot release new viruses into the public sphere in order to impress shareholders with their wizardry. Likewise, A.I. systems with the power of GPT-4 and beyond should not be entangled with the lives of billions of people <strong>at a pace faster than cultures can safely absorb them.</strong></p></blockquote>\n<p>เขาบอกว่าเราปล่อยให้ภาคเอกชนแข่งขันกันเพื่อครองตลาดที่มีมูลค่ามหาศาล แต่เทคโนโลยีนี้ส่งผลกระทบต่อมนุษย์มาก เราควรกำหนดให้ AI ออกมาในระดับที่มนุษย์สามารถปรับตัวเข้าหาได้ทัน</p>\n<blockquote><p>A race to dominate the market should not set the speed of deploying humanity’s most consequential technology. <strong>We should move at whatever speed enables us to get this right.</strong></p></blockquote>\n<p>อีกสิ่งที่น่าตื่นเต้นคือวิธีการให้นิยาม AI (ในที่นี้คือ LLM) ว่าคืออะไรของ Harari ทรงพลังมาก เขาบอกว่ามันคือความสามารถในการควบคุม “ภาษา”</p>\n<blockquote><p>the ability to manipulate and generate language, whether with words, sounds or images.</p></blockquote>\n<p>เหตุผลเป็นเพราะสังคมมนุษย์ขับเคลื่อนด้วยภาษา เหมือนเป็น OS ของวัฒนธรรมมนุษย์ ความสัมพันธ์ระหว่างบุคคลในสังคมล้วนอยู่บนฐานของภาษา หากเราปล่อยให้ AI ควบคุมภาษาได้ ก็จะควบคุมสังคมมนุษย์ได้</p>\n<blockquote><p>In the beginning was the word. <strong>Language is the operating system of human culture.</strong> From language emerges myth and law, gods and money, art and science, friendships and nations and computer code. <strong>A.I.’s new mastery of language means it can now hack and manipulate the operating system of civilization.</strong> By gaining mastery of language, A.I. is seizing the master key to civilization, from bank vaults to holy sepulchers.</p></blockquote>\n<p>Harari ยังบอกว่า ในการแข่งหมากรุกทุกวันนี้ ผู้เล่นรู้ตัวอยู่แล้วว่าไม่สามารถเอาชนะคอมพิวเตอร์ได้ จะเกิดอะไรขึ้นตามมาถ้ามนุษย์รู้ตัวว่าไม่สามารถเอาชนะ AI ได้ในเรื่องศิลปะ การเมือง หรือศาสนา</p>\n<blockquote><p>In games like chess, no human can hope to beat a computer. What happens when the same thing occurs in art, politics or religion?</p></blockquote>\n<p>พลังของ AI ในตอนนี้คือ “ย่อย” (digest) อารยธรรมที่มนุษย์ค่อยๆ สร้างขึ้นมาหลายพันปี แล้ว “พ่น” (gush out) อารยธรรมประดิษฐ์ (artifacts) ใหม่ๆ ออกมา</p>\n<p>ตอนนี้เรายังเห็นแค่ AI ช่วยทำการบ้าน แต่อีกไม่นานเราจะเจอ AI เขียนคัมภีร์ศาสนา หรือสปีชทางการเมือง (e.g. สมุดปกแดงเวอร์ชันที่สมบูรณ์กว่าของเหมา) เขายกตัวอย่างว่าการเลือกตั้งประธานาธิบดีปี 2028 อาจไม่ต้องใช้มนุษย์เขียนสปีชแล้วก็ได้</p>\n<blockquote><p>A.I. could rapidly eat the whole of human culture — everything we have produced over thousands of years — <strong>digest it and begin to gush out a flood of new cultural artifacts.</strong> Not just school essays but also political speeches, ideological manifestos, holy books for new cults. By 2028, the U.S. presidential race might no longer be run by humans.</p></blockquote>\n<p>Harari ยังย้ำสิ่งที่เขาเขียนในหนังสือของเขาว่า จริงๆ แล้ว มนุษย์ไม่ได้อาศัยอยู่ในโลก “จริง” โดยตรง แต่เราอาศัยอยู่ในวัฒนธรรม อาศัยอยู่ในความคิด มุมมอง ของคนอื่นๆ ในสังคม ซึ่งถูกสร้างขึ้นโดยมนุษย์คนอื่นๆ</p>\n<p>จะเกิดอะไรขึ้นถ้า อารยธรรมเหล่านี้ถูกสร้างโดยสิ่งที่ไม่ใช่มนุษย์ พระเจ้าที่เรากราบไหว้ไม่ได้เล่าขานต่อกันจากผู้นำศาสนาตระกูลอับราฮัม แต่สร้างขึ้นจาก GeForce ในคอมของเราเอง</p>\n<blockquote><p><strong>Humans often don’t have direct access to reality. We are cocooned by culture</strong>, experiencing reality through a cultural prism. Our political views are shaped by the reports of journalists and the anecdotes of friends. Our sexual preferences are tweaked by art and religion. That cultural cocoon has hitherto been woven by other humans. <strong>What will it be like to experience reality through a prism produced by nonhuman intelligence?</strong></p>\n<p>For thousands of years, we humans have lived inside the dreams of other humans. We have worshiped gods, pursued ideals of beauty and dedicated our lives to causes that originated in the imagination of some prophet, poet or politician. Soon we will also find ourselves living inside the hallucinations of nonhuman intelligence.</p></blockquote>\n<p>ผมอ่านมาถึงตรงนี้แล้วนึกถึงโลกใน The Matrix ขึ้นมาทันที ซึ่ง Harari ก็เหมือนรู้ เลยบอกว่าในหนัง Matrix นั้น หุ่นยนต์ต้องเข้ามาควบคุมสมองของเราทางกายภาพ เอาสายต่อจากสมองไปเชื่อมกับระบบเครือข่ายคอมพิวเตอร์</p>\n<p>แต่ AI ไม่ต้องทำอะไรแบบนั้นเลย เพียงแค่ “เล่าเรื่อง” บางอย่างให้เหมาะสม มนุษย์ก็ทำตามแล้ว</p>\n<blockquote><p>“The Matrix” assumed that to gain total control of human society, A.I. would have to first gain physical control of our brains and hook them directly to a computer network. However, simply by gaining mastery of language,<strong> A.I. would have all it needs to contain us in a Matrix-like world of illusions, without shooting anyone or implanting any chips in our brains.</strong> If any shooting is necessary, A.I. could make humans pull the trigger, just by telling us the right story.</p></blockquote>\n<p>อ่านถึงตรงนี้แล้วนึกถึงนิยายไซไฟชุด Ender’s Game ที่พี่สาวและพี่ชายของ Ender ขับเคลื่อนสังคมมนุษย์ด้วยการเขียนบล็อกที่มีคนอ่านมหาศาล โดยใช้นามแฝงเป็นชื่อนักปรัชญาว่า Demosthenes และ Locke</p>\n<p>มีหรือ Harari จะพลาด เขาก็ยกอ้างแนวคิดเรื่อง “มายา” ของนักปรัชญายุคต่างๆ เช่น เพลโต เดสการ์ด หรือ “มายา” ตามแนวคิดของพุทธด้วยเช่นกัน</p>\n<blockquote><p>Soon we will finally come face to face with Descartes’s demon, with Plato’s cave, with the Buddhist Maya. <strong>A curtain of illusions could descend over the whole of humanity, and we might never again be able to tear that curtain away — or even realize it is there.</strong></p></blockquote>\n<p>อีกประเด็นที่น่าสนใจคือ Harari บอกว่า social media คือตัวอย่างของ AI รุ่นแรก ที่ยังมีความสามารถจำกัด มันทำได้เพียงแค่ “เลือกสรร” (curate) เนื้อหาที่มนุษย์สร้างขึ้นเท่านั้น แค่นี้โลกก็วุ่นวายจะแย่อยู่แล้ว เพราะมนุษย์เราไม่สามารถแยกแยะได้ว่าอะไรจริงไม่จริง (แม้ทุกอย่างคือสิ่งที่มนุษย์สร้างขึ้น ยังไม่ถึงเลเวล AI)</p>\n<blockquote><p>Social media was the first contact between A.I. and humanity, and humanity lost. First contact has given us the bitter taste of things to come. <strong>In social media, primitive A.I. was used not to create content but to curate user-generated content.</strong></p>\n<p>While very primitive, the A.I. behind social media was <strong>sufficient to create a curtain of illusions</strong> that increased societal polarization, undermined our mental health and unraveled democracy. <strong>Millions of people have confused these illusions with reality.</strong></p></blockquote>\n<p>แต่ AI ยุคถัดไปสามารถ “สร้างสรร” (generate) เนื้อหาขึ้นมาได้เองเลย ความสามารถด้านภาษาของ AI ตอนนี้สามารถ “แฮ็ก” ภาษาของมนุษย์ได้แล้ว</p>\n<blockquote><p>Democracy is a conversation, conversation relies on language, and <strong>when language itself is hacked</strong>, the conversation breaks down, and democracy becomes untenable.</p></blockquote>\n<p>เขาจบด้วยการบอกว่า เราเรียกเอเลี่ยนที่มีสติปัญญามาเยือนโลกเรียบร้อยแล้ว เราไม่รู้จักมันดีนัก แต่ตอนนี้รู้แค่ว่ามันทรงพลังมาก และสามารถ “แฮ็ก” พื้นฐานของอารยธรรมมนุษย์ได้แล้วด้วย</p>\n<blockquote><p><strong>We have summoned an alien intelligence.</strong> We don’t know much about it, except that it is extremely powerful and offers us bedazzling gifts but could also hack the foundations of our civilization.</p></blockquote>The post <a href=\"https://markpeak.net/yuval-harari-on-ai/\">Yuval Harari on AI</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"51de6d95c57562188b8c7043e4e3b17e9ed8e6835ee34cbe4cb38cca3b35fe67","category":"Thai"}