{"title":"Serum copeptin, lactate, and shock index as predictors of morbidity and mortality in shocked acutely poisoned patients","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae053/7640745?rss=1","date":1712188800000,"content":"<span><div>Abstract</div>Background: Poisoning-induced shock is a serious medical emergency with a high mortality rate. Hospitalized poisoned individuals experience multiple adverse cardiovascular events that could progress to cardiac arrest. This study was designed to compare the prognostic role of the admission shock index and plasma copeptin level in shocked poisoned patients and to evaluate their associations with initial patients’ characteristics and outcomes. Methods: We conducted a prospective study on acutely poisoned adult patients. Results: A total of 41 patients were enrolled in the study. The mean age of all patients was 27.05 ± 10.99 years and most of the patients were females (n = 27, 66%). Pesticides were the most common type of poisoning (n = 18, 44%), followed by cardiovascular drugs (n = 12, 29.3%). Eleven (26.8%) patients died during the hospital stay length. The initial serum copeptin level and shock index could predict organ dysfunction indexed by sequential organ assessment score (SOFA) with area under the curve (AUCs) of 0.862 and 0.755, respectively. Initial serum copeptin and lactate levels, SOFA score, and their combination can strongly differentiate between survivors and non-survivors with an AUC of 0.944, 0.885, and 0.959, and 0.994, respectively. Conclusion: We concluded that the shock index, serum lactate level, and SOFA score may help in risk stratifying patients and predicting outcomes in critically ill patients with poisoning-induced shock. Copeptin is superior to the shock index in predicting mortality among the studied patients. However, a combination of SOFA score, serum copeptin level, and serum lactate level can develop a more predominant prediction for overall clinical outcomes in these patients.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"51e567a4a9147b0238fab792b0d0b0a11bd7000e25fd4ef52b3308a4ee09d29e","category":"Environment"}