{"title":"Erosion Mechanism of the Gas-Solid Two-Phase Flow in Surface Pipelines for Shale Gas in the Sichuan Basin","link":"https://www.preprints.org/manuscript/202407.1067/v1","date":1720788902000,"content":"The erosion of surface pipelines induced by proppant flowback during shale gas production is significant. The surface pipelines in a shale gas field in the Sichuan Basin experienced perforation failures after only five months of service. To investigate the erosion features of L360N, coatings, and ceramics and optimize the selection of two protective materials, a gas-solid two-phase flow jet erosion experimental device was used to explore the erosion resistance of L360N, coating, and ceramic under different impact velocities (15 m/s, 20 m/s, and 30 m/s). An energy dispersive spectroscope, a scanning electron microscope, and a laser confocal microscope were employed to analyze erosion morphologies. With the increase in flow velocity, erosion depth and erosion rate of L360N, coating, and ceramic increased and peaked under an impact velocity of 30 m/s. Maximum erosion rate and maximum erosion depth of L360N were respectively 0.0350 mg/g and 37.5365 µm. Its primary material removal mechanism was plowing of solid particles and microcracks were distributed on the material surface under high flow velocities. Maximum erosion rate and maximum erosion depth of coating were respectively 0.0217 mg/g and 18.9964 µm. Its primary material removal mechanism was the detachment of the binder phase Co caused by plowing. Maximum erosion rate and maximum erosion depth of ceramics were respectively 0.0108 mg/g and 12.4856 µm. The erosion mechanisms were micro-cutting and plowing. Under different particle impact velocity, different erosion morphologies were observed, but the primary erosion mechanism was the same. The erosion resistance of ceramics was higher than that of coating. Therefore, ceramic lining materials could be used to protect the easily eroded parts, such as pipeline bends and tees, and reduce the failure rate by more than 93%. The study provided the data and theoretical basis for the theoretical study on oil and gas pipeline erosion and pipeline material selection.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"51e6bf69a6dcb285dd89c41bee999b7cc4082147cadcb276829f93da44f43fff","category":"Interdisciplinary"}