{"title":"Morphological and Performance Biomechanics Profiles of Draft Prep American Style Football Players","link":"https://www.preprints.org/manuscript/202409.1657/v1","date":1726843554000,"content":"This study profiled morphological and laboratory-derived performance biomechanics by position of American style football players training for the National Football League draft. Fifty-five players were categorized into Big (e.g., lineman; n=17), Big-skill (e.g., tight end; n=11), and Skill (e.g., receiver; n=27) groups. Body fat (BF%), lean body mass (LBM), total body mass, running force and ground contact time (GCT), countermovement jump height (CMJ-JH), CMJ normalized peak power (CMJ-NPP), and reactive strength were measured in a laboratory. Asymmetry was calculated for running force, GCT, and CMJ eccentric and concentric impulse (IMP). MANOVA determined between-group differences, and radar plots for morphological and performance characteristics were created using Z-scores. There was a significant between-group difference, F(26,80)=5.70, p&amp;lt;0.001;Wilk’s Λ=0.123, partial η2=0.649. Fisher’s least squares difference post-hocs showed Skill had greater JH, CMJ-NPP, reactive strength, and running force versus Big but not Big-skill, p&amp;lt;0.05. Big had greater BF%, LBM, total body mass, and GCT than Skill and Big-Skill, p&amp;lt;0.05. Big-skill had greater GCT asymmetry than Skill and Big, p&amp;lt;0.05. Asymmetries in running forces, and CMJ eccentric and concentric IMP were not different, p&amp;gt;0.05. Morphological and performance biomechanics differences are pronounced between Skill and Big. Big-skill possess characteristics from both groups. Laboratory-derived results provide specialized profiles of draft trainees.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"51ea93462f2b157935966a1d8c30a58a7fbf853468261644e5a77af7b935b73d","category":"Interdisciplinary"}