{"title":"European satellite plunges back to Earth in first-of-its-kind assisted re-entry","link":"https://arstechnica.com/?p=1957604","date":1690588227000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Aeolus_orbit-800x450.jpg\" alt=\"Artist's illustration showing the orbital tracks of the European Space Agency's Aeolus satellite.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Aeolus_orbit.jpg\">Enlarge</a> <span>/</span> Artist's illustration showing the orbital tracks of the European Space Agency's Aeolus satellite. (credit: <a href=\"https://www.esa.int/ESA_Multimedia/Search/(offset)/50/(sortBy)/published?result_type=images&amp;SearchText=Aeolus\">ESA/ATG medialab</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The European Space Agency deftly guided one of its satellites toward a fiery re-entry into Earth's atmosphere Friday, demonstrating a new method of post-mission disposal to ensure the spacecraft would not fall into any populated areas.</p>\n<p>The Aeolus satellite was relatively modest in size and mass—about 1.1 metric tons with its fuel tank empty—but ESA hailed Friday's \"assisted re-entry\" as proof that the space agency takes the stewardship of space seriously.</p>\n<p>When the Aeolus mission was conceived in the late 1990s, there were no guidelines for European satellites regarding space debris or the safety of their re-entry. Aeolus took nearly 20 years to get to the launch pad, operated in space for five years, and now regulations have changed. Future ESA satellites will need to be capable of a targeted re-entry, where rocket engines steer the spacecraft toward a specific patch of ocean or are designed to burn up from aerodynamic heating.</p></div><p><a href=\"https://arstechnica.com/?p=1957604#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1957604&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"51f3f28a78917547c954ef8f572994a86ab84143eadd117b56c9ea173bc3b010","category":"Tech"}