{"title":"Apple's App Tracking Transparency Framework Causing Advertisers to Spend More Money Targeting Android Users","link":"https://www.macrumors.com/2021/07/05/att-causing-more-ad-spending-on-android/","date":1625485345000,"content":"Mobile advertisers are beginning to spend significantly more money targeting Android users thanks to Apple's implementation of a framework on iOS, severely impacting the amount of data companies can collect about users on <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/generic-tracking-prompt-orange.jpg\" />\r\n<br />\r\nAs reported by <em><a href=\"https://www.wsj.com/articles/after-apple-tightens-tracking-rules-advertisers-shift-spending-toward-android-devices-11625477401?mod=rss_Technology\">The Wall Street Journal</a></em>, following the April roll-out of ATT, or the App Tracking Transparency framework, which requires that all apps on ‌iPhone‌ and ‌iPad‌ ask for users consent before tracking their activity across other apps, advertisers have begun to lower their spending on Apple's platform.\r\n<br />\r\n\r\n<br />\r\nAccording to early data from the ad-measurement firm Branch Metrics Inc, seen by <em>The Journal</em>, less than 33% of iOS users have permitted apps to track them across other apps. The remaining 67% of iOS users opted not to permit apps to track their activity. As a result, the amount of advertiser spending on Apple's mobile platform has fallen by about one-third between June 1 and July 1, while spending on Android rose over 10% for the same month, according to ad-measurement firm Tenjin Inc. \r\n<br />\r\n<blockquote>After the tracking change took effect in April, many users of Apple's iOS operating system have received a high volume of prompts from apps asking permission to track them—requests that most have declined. Less than 33% of iOS users opt in to tracking, according to ad-measurement firm Branch Metrics Inc.\r\n<br />\r\n\r\n<br />\r\nAs more of that information has emerged, advertisers have adjusted their buying strategies. Spending on iOS mobile advertising has fallen by about one-third between June 1 and July 1, according to ad-measurement firm Tenjin Inc. Android spending rose 10% over the same period, Tenjin said.\r\n<br />\r\n\r\n<br />\r\nDigital-ad agency Tinuiti Inc. has seen a similar pattern in its clients' spending, research director Andy Taylor said. When iOS users opted out of tracking, Tinuiti advertisers couldn't bid on them, he said. That dearth of iOS users drove up demand—and ad prices—for Android users. About 72.8% of smartphones world-wide use the Android operating system, and about 26.4% use iOS, according to Statcounter.</blockquote>One reason digital advertisers say they're spending less on Apple's mobile platform is due to the lack of \"granular data that made mobile ads on iOS devices effective and justified their prices.\"\r\n<br />\r\n\r\n<br />\r\nWithout proper user tracking, advertisers have significantly less data about a user's interests, preferences, and more. Advertisers and companies, such as Facebook, use that data to compile a profile of a user. The type of data collected from tracking helps advertisers to ensure that their ads are being targeted to potential customers\r\n<br />\r\n<blockquote>Digital advertisers say they have lost much of the granular data that made mobile ads on iOS devices effective and justified their prices. In recent months, ad-buyers have deployed their iOS ad spending in much less targeted ways than were previously possible, marketers and ad-tech companies say. The shortage of user data to fuel Facebook Inc.'s suite of powerful ad-targeting tools reduces their effectiveness and appeal among some advertisers, ad agencies say</blockquote>While several advertisers are being impacted by ATT, Facebook has been the most vocal and critical of the new change. Ever since Apple began to beta test the framework, which was shipped as part of the <a href=\"https://www.macrumors.com/2021/04/26/apple-releases-ios-14-5/\">iOS and iPadOS 14.5 updates</a>, Facebook accused Apple of <a href=\"https://www.macrumors.com/2021/02/25/facebook-personalized-ads-pr-campaign/\">impacting small businesses</a> who rely on advertising as a means of keeping their doors open. <a href=\"https://www.macrumors.com/2021/01/27/apple-privacy-changes-anti-competitive-facebook/\">Facebook also proclaimed that the framework was anti-competitive</a> because, in its view, it gives Apple an upper hand for running its own mobile advertising business on iOS devices. <div>Tag: <a href=\"https://www.macrumors.com/guide/app-tracking-transparency/\">App Tracking Transparency</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/05/att-causing-more-ad-spending-on-android/\">Apple's App Tracking Transparency Framework Causing Advertisers to Spend More Money Targeting Android Users</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-app-tracking-transparency-framework-causing-advertisers-to-spend-more-money-targeting-android-users.2303286/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=4Ph3C_44f2c:HqmEaaWb1Z8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=4Ph3C_44f2c:HqmEaaWb1Z8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/4Ph3C_44f2c\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"51f4b400c1abe285a5cd64cb738347a67b21ca8b2927ca80f04401a36993577a","category":"Apple"}