{"title":"Anker's Latest 'Prime' Lineup Includes Wall Chargers, Desktop Chargers, and Power Banks","link":"https://www.macrumors.com/2023/08/01/anker-prime-chargers-power-banks/","date":1690894800000,"content":"<a href=\"https://howl.me/ckhgOoClXCW\">Anker</a> is introducing a number of new charging accessories in its higher-end Anker Prime lineup today, including multiple variants of wall chargers, desktop chargers, and power banks.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/anker-prime-chargers.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nIn the traditional wall charger category, Anker is launching two new options with GaN technology and folding prongs (U.S. versions only) to enable compact form factors. There's a 67-watt charger ($59.99 at <a href=\"https://howl.me/ckhgE5yedg0\">Anker</a> and <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0C4YTB56H\">Amazon</a>) and a beefier 100-watt version ($84.99 at <a href=\"https://howl.me/ckhgE5roC23\">Anker</a> and <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0C4DGBHY2\">Amazon</a>), with each one featuring a pair of USB-C ports and a USB-A port.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/07/anker-prime-wall-chargers.jpg\" alt width=\"1600\" height=\"900\" /><em>67-watt (left) and 100-watt (right) wall chargers</em></div>\r<br />\nOn each model, you can get the full 67 or 100 watts from either USB-C port, while the USB-A port can deliver up to 22.5 watts. Available power will, however, be divided among the ports if you have multiple accessories plugged in to charge.\r<br />\n\r<br />\nAnker notes that the two models are each about half the size of their respective first-party Apple charger (67-watt and 96-watt) counterparts, while both products include the latest temperature control technology, insulated pins, and advanced chip technology for greater power efficiency.\r<br />\n\r<br />\nIf you need more charging power at a fixed location, the Anker Prime 240W GaN Desktop Charger ($199.99 at <a href=\"https://howl.me/ckhgE5pm0dy\">Anker</a> and <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0C6CZDXZV\">Amazon</a>) offers three USB-C ports and a USB-A port. One of the USB-C ports can deliver up to 140 watts for the fastest possible charging of Apple's 16-inch MacBook Pro models over Apple's USB-C to <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> cable.  The other two USB-C ports can deliver up to 100 watts each while the USB-A port offers up to 22.5 watts of charging power.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/07/anker-prime-desktop-chargers.jpg\" alt width=\"1600\" height=\"900\" /><em>240W GaN (left) and 6-in-1 (right) charging stations</em></div>\r<br />\nFor users who want a thin desktop charging option, the Anker Prime 6-in-1 Charging Station ($109.99 at <a href=\"https://howl.me/ckhgE5ix5DU\">Anker</a> and <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0BSGH355C\">Amazon</a>) offers up to 140 watts of USB charging power across two USB-C and two USB-A ports, plus two additional power outlets, all in a package that's just 0.7 inches thick. A removable 5-foot cable gives you flexibility for placement, while the full 140-watt charging power can be routed through a single USB-C port for the fastest possible MacBook Pro charging. An integrated digital display also gives you a glanceable moment-by-moment look at the USB power draw.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/anker-prime-charging-station.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nFor those who are looking for a combination of desktop and on-the-go charging with some of the latest bells and whistles, the Anker Prime Power Bank series pairs several portable power bank options with a wireless charging base that doubles as a desktop charger.\r<br />\n\r<br />\nThere are three Anker Prime power banks options coming in at 12,000 mAh at 130 watts for $89.99 (<a href=\"https://howl.me/ckhgE5Jsr6s\">Anker</a> and <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0BYNWQF1Y\">Amazon</a>), 20,000 mAh at 200 watts for $129.99 (<a href=\"https://howl.me/ckhgE4YJNF1\">Anker</a> and <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0BYNZXFM2\">Amazon</a>), and 27,650 mAh at 250 watts for $179.99 (<a href=\"https://howl.me/ckhgE50WkIi\">Anker</a> and <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0BYP2F3SG\">Amazon</a>). All three models support a new wireless charging base or can be recharged through their USB-C ports, and they all feature smart displays to provide information on current charge state, estimated time remaining or until full recharge, and current output wattage.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/07/anker-prime-power-bank-base.jpg\" alt width=\"1600\" height=\"900\" /><em>250-watt power bank and charging base</em></div>\r<br />\nThe 130-watt model supports 65-watt input and output with a pair of USB-C ports, while the 200-watt model supports up to 100 watts of input and output with two USB-C ports and a USB-A port. The 250-watt model supports a maximum of 140 watts input and output through a single port with a pair of USB-C ports and a USB-A port.\r<br />\n\r<br />\nThe 100W Charging Base can deliver 100 watts of charging power through its pogo-pin connector to recharge any of the new Anker Prime power banks, while three additional ports integrated into the side of the charging base can charge additional devices. There are two USB-C ports (one at 100 watts and one at 30 watts) and a USB-A port with up to 22.5 watts of charging power. As with the other chargers, the maximum 100-watt charging power will be divided among the various outputs based on what is connected. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/anker-prime-power-bank-charging.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThe charging base sells for $69.99 on its own at <a href=\"https://howl.me/ckhgE5H8nGJ\">Anker</a> and <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0C6Q7H4GK\">Amazon</a> or comes as part of a bundle with the 250-watt power bank model for $219.99, saving you $30 over purchasing the two items separately.\r<br />\n\r<br />\nThe 240W Desktop Charger and the 250W Power Bank are going up for pre-order, while the rest of the new products are launching today in the United States, United Kingdom, and Germany with the exception of the 6-in-1 Charging Station, which is U.S.-only. Some of the new products currently have clippable 10% off coupons at both Anker and Amazon.\r<br />\n\r<br />\n<small><em>Note: MacRumors is an affiliate partner with Anker and Amazon. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.</em></small><div>Tag: <a href=\"https://www.macrumors.com/guide/anker/\">Anker</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/01/anker-prime-chargers-power-banks/\">Anker's Latest 'Prime' Lineup Includes Wall Chargers, Desktop Chargers, and Power Banks</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ankers-latest-prime-lineup-includes-wall-chargers-desktop-chargers-and-power-banks.2397440/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"51fd147869ca3df48da8bcc3b83762709714e40b094755857cfac2bdd7f87062","category":"Apple"}