{"title":"Awareness, treatment, and control among adults living with arterial hypertension or diabetes mellitus in two rural districts in Lesotho","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003721","date":1727704800000,"content":"<p>by Lucia González Fernández, Emmanuel Firima, Ravi Gupta, Mamoronts’ane Pauline Sematle, Makhebe Khomolishoele, Manthabiseng Molulela, Matumaole Bane, Mosa Tlahali, Stephen McCrosky, Tristan Lee, Frédérique Chammartin, Eleonora Seelig, Felix Gerber, Thabo Ishmael Lejone, Irene Ayakaka, Niklaus Daniel Labhardt, Alain Amstutz</p>\r\n\r\nIn Lesotho, the hypertension and diabetes care cascades are unknown. We measured awareness, treatment, and control of hypertension and diabetes among adults ≥18 years and identified factors associated with each step of the cascade, based on data from a population-based, cross-sectional survey in 120 randomly sampled clusters in the districts of Butha-Buthe and Mokhotlong from 1<sup>st</sup> November 2021 to 31<sup>st</sup> August 2022. We used multivariable logistic regression to assess associations. Among participants with hypertension, 69.7% (95%CI, 67.2–72.2%, 909/1305) were aware of their condition, 67.3% (95%CI 64.8–69.9%, 878/1305) took treatment, and 49.0% (95%CI 46.3–51.7%, 640/1305) were controlled. Among participants with diabetes, 48.4% (95%CI 42.0–55.0%, 111/229) were aware of their condition, 55.8% (95%CI 49.5–62.3%, 128/229) took treatment, and 41.5% (95%CI 35.1–47.9%, 95/229) were controlled. For hypertension, women had higher odds of being on treatment (adjusted odds ratio (aOR) 2.54, 95% CI 1.78–3.61) and controlled (aOR 2.44, 95%CI 1.76–3.37) than men. Participants from urban areas had lower odds of being on treatment (aOR 0.63, 95% CI 0.44–0.90) or being controlled (aOR 0.63, 95% CI 0.46–0.85). Considerable gaps along the hypertension and diabetes care cascades in Lesotho indicate that access and quality of care for these conditions are insufficient to ensure adequate long-term health outcomes.","author":"Lucia González Fernández","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"51ff6d67778203407a262a7567cc32b4dd065a73d15a3ca41b52b6d3c79d536b","category":"Environment"}