{"title":"Josie Nelson’s Tour de France Femmes debut diary - Difficult days, French crowds, and team spirit","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-thought-i-would-at-least-finish-in-the-peloton-josie-nelson-s-tour-de-france-femmes-debut-diary","date":1690296080000,"content":"\n      <p><i><span>Josie Nelson from Team Coop-Hitech Products had a strong opening to her 2023 season, taking a fourth-place finish at the Cadel Evans Great Ocean Road Race behind Loes Adegeest, Amanda Spratt and Nina Buijsman. She continued her run of good form at the Women’s UAE Tour until she crashed later that month at Omloop van het Hageland, taking her out of the race and setting off a run of DNFs. It seemed the 21-year-old rider’s luck was changing when she started the La Vuelta Femenina on the right foot, taking 12th on stage two. However, bad luck struck again when Nelson crashed on stage seven causing her concussion, forcing her to abandon the race. </span></i></p>\n<div></div>\n<p><i><span>Despite several setbacks this year, the British rider has fought hard to be in the team’s line-up for the prestigious <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> and starts the eight-day race in Clermont-Ferrand alongside her team, looking to soak everything up at her debut appearance and see what opportunities prevail along the way. </span></i></p>\n<h3><strong>Before stage one</strong></h3>\n<p><span><i>The July sun beats down on the city as the air fills with excited chatter and anticipation as the crowds await the Tour de France Femmes to begin. Standing outside her team bus as the fans wander </i><i>around</i><i> the team buses, Nelson tells Rouleur what her first experience of the Tour has been like so far. </i></span></p>\n<p><span>“I only arrived in Clermont-Ferrand yesterday as I had a bit of a nightmare getting here as my first flight was cancelled to Paris, so I had to rebook a flight at Heathrow and go to a different terminal and fly to Lyon instead, so I stayed the night there in the end. But I am here now, so that is all that matters.</span></p>\n<p><span>“I feel good. Nervous too, obviously, it is a big race and I’ve not done eight stages before, the most I have done is six, so hopefully the extra two won’t be too difficult. But the route is more on the hilly side. I think it is going to be really hard. I don’t think there will be much time to rest, not time at all really, I think it’ll just be full gas for most of it.</span></p>\n<p><span>“I think I am just going to settle into today’s stage and just see how the bunch is riding. Last year I heard there were a lot of nerves in the bunch which was obviously expected in the first edition, so hopefully it has settled down a bit for the second edition. As a team we are just looking to race quite aggressively but obviously not go too much, too hard on the first stage. </span></p>\n<p><span>“I think there could be quite a few attacks [on stage one], but I think they’ll be brought back. After the first stage the GC is sort of then decided so there is a bit more structure in place.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Josie1.jpg?v=1690291292\" alt /><em>Josie Nelson (left) with her Team Coop-HiTech Products at the team presentation in Clermont-Ferrand (Image by Kjetil Alsvik)</em></span></p>\n<h3><strong>After stage one</strong></h3>\n<p><span><i><span>At the end of the opening stage, Nelson placed 135th, 11:35 behind the stage winner and first yellow jersey wearer Lotte Kopecky (SD Worx-Protime). Spinning on her turbo, she reflected on her first-ever Tour stage. </span></i></span></p>\n<p><span>“It wasn’t that great for me to be honest – I thought I would at least finish in the peloton. But I don’t really know what happened, I just sort of blew up a bit. I think positioning played a factor. For the first 40km I was well positioned near the front most of the time and then I sort of ended up drifting to the back and was then just fighting to get to the front from there. But I never really made it, got dropped and did the last 20km by myself, until the climb when a little group formed. The climb [Col du Durtol] was OK. It was hard, but I wasn’t doing it full gas like I would have done if I was in the peloton </span></p>\n<p>“The peloton didn’t seem nervous. There were a few crashes after the halfway point when I think people started to race but it was pretty calm to start with. </p>\n<p>“But I will be hoping for a better result tomorrow. Usually in stage races, in the middle and towards the end I end up finding my legs a bit. It’s just a shame that the very first stage I am so far down the GC. For now, I will get a good massage, get my legs up, refuel, go through tomorrow’s stage and sleep!”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1548923400_16d9882f-7a82-4ffe-aed4-9f0528cd28a8.jpg?v=1690291514\" alt /><em>The peloton during stage one of the Tour de France Femmes (Image by Getty Images)</em></p>\n<h3><strong>After stage two</strong></h3>\n<p><i><span>Despite torrential rain and over 3,000 metres of climbing, Nelson beat her result on stage two, coming 91st, crossing the finish line </span></i><i><span>with her teammate Triril Jørgensen, 11:40 behind stage winner Liane Lippert (Movistar). </span></i></p>\n<p>“Today was quite difficult because when we started we went straight up a climb and the people at the front hit that pretty hard. I had warmed up a bit but potentially not enough, so I was sort of going backwards from there. But then I caught the bunch back again, and then there were a few more climbs, which meant a few more times catching the bunch back again. Then there was the long descent, which was quite nice actually, some time to chill. But from about 100km, those at the front hit the climbs pretty hard again. From there I was just in quite a big group from the finish. </p>\n<p>“I think the peloton would have been more nervous in the front group [due to rain], so they’d be more worried about being dropped. But in the group I was in, it was pretty chill. No one was risking anything. There was no point really, just to save like 10 or 20 seconds. It could have been sketchy, but we all played it pretty safe.</p>\n<p>“It is crazy to see so many fans, you know, they line every single climb around the course and they are just cheering you on. My experience is similar to any stage race, but the biggest difference is the crowds as with other races, you don’t get many people coming to watch – this one is special.</p>\n<p>“I felt much better on stage two. I think I was almost a bit surprised at stage one and how bad I felt in my legs. But I found them a bit more today, so hopefully they can keep on getting better. After the heat on stage one, the rain was actually quite refreshing. </p>\n<p><em>*Cover image by Kjetil Alsvik</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"52050a0bedc59a3e08a7abe6663ff1f9349dab5e4c0c11c00124f9433e5d5c8e","category":"Cycling"}