{"title":"Tadej Pogačar's Tour de France dream dies for another year","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tadej-pogacars-tour-de-france-dream-dies-for-another-year","date":1689793157000,"content":"\n      \n<p>At first there was a narrow fissure, and then, just seconds later, it had grown to a gap, the one where you immediately sit up, fix your eyes on the screen and grab the person next to you out of their slumber. Within minutes it was a complete blowout. Tadej Pogačar had well and truly cracked, the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> was well and truly settled, and the response was well and truly different to the previous times the Slovenian had been beaten by Jonas Vingegaard.</p>\n<div></div>\n<p><span>On the Col du Granon last year, there was disbelief, utter bewilderment. At the Hautacam, a week after, there was surprise. This July, there was shock and despondency on the Col du Marie Blanque, and then at Combloux in the time trial there was yet more surprise, littered with astonishment. On stage 17, up and over the Col de la Loze, there was just an sigh, a shrug of the shoulders. Before it’s been unexpected; this time it was convincing, devastating and expectant. Tadej Pogačar was not Tadej Pogačar - and the signs have been there.</span></p>\n<p><span>It was on Sunday’s enthralling stage to Saint Gervais Mont Blanc that the 24-year-old showed his first signs of weakness in 10 days. He looked laboured, tired, despite his attacks, and it looked like Vingegaard had passed up an open goal to attack his adversary. That night, murmurs filtered through that the Slovenian had a cold sore - a sign of a viral infection - and then on Tuesday he looked off the pace in the time trial, even accounting for the fact that he decimated the entire field - except for the man that really mattered, that is.</span></p>\n<p><span>On Wednesday, at the beginning of the Queen stage, he crashed, opening up a previous wound on his left knee. His face appeared pale, a little more gaunt than usual, and without Jumbo-Visma even turning the screw, the gradients and the distance became too much for him in the latter stages. As his rival cruised through the thinning air; he slipped back, his dream of a third Tour in four years dying a heart wrenching death.</span></p>\n\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg17_pogacar-finish01_2023_1024x1024.jpg?v=1689793073\" alt />Following in the wheels of Marc Soler, with kilometres still to climb on the vicious slopes of the Col de la Loze, Pogačar radioed his team. “I’m gone,” he puffed. “I’m dead.” His parents, father Mirko and mother Marjeta, were at the top of the altiport in Courchevel, waving their customised Slovenian flag on a large pole. A short while after, they took up a vantage point from afar to watch their beaten son go up onto the podium and be awarded the white jersey. “Pogi, Pogi, Pogi,” they chanted. To the press, he said simply: “I’m f**ked.” Walking back down from the mountain, Marjeta told </span><em><span>Rouleur</span></em><span> of her upset. “I just want to see my boy,” she said.</span></p>\n<p><span>With just seven words, she had provided a perspective to the day’s tale. Tadej Pogačar is still the world’s best bike rider - Grischa Niermann, a DS of Jumbo-Visma, said those exact words to </span><em><span>Rouleur</span></em><span> after the stage - but while we will all analyse what went wrong, speculate if he was ill, two parents have a distraught son to comfort.</span></p>\n<p><span>Their little boy, though, will bounce back. It seems preposterous that a rider we all assumed would win multiple Tours will head into next year’s race without a third yellow already hanging up in his wardrobe. You can’t imagine that he will be satisfied with not winning a Grand Tour in two years, so does that make the Vuelta a España, starting in less than five weeks, his next target? The Vuelta’s race director Javier Guillén might be the day's happiest man aside from those involved with Jumbo.</span></p>\n<p><span>That’s a topic for future days and weeks, but for now there is only reflection to be done. Jonas Vingegaard is a deserving double Tour de France champion in waiting, and there’s nothing Tadej Pogačar can do about it. Tadej Pogačar can be beaten, he can crack, and he can look vulnerable. We keep seeing it happen in the Tour. He really absolutely is human. That alone is the biggest revelation and take from the past 12 months.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"520d46abd8752b8f7a2368ce998eaa5408ba249bc224b47b8b0505e0cb36a74b","category":"Cycling"}