{"title":"Photocatalytic degradation of methylene blue by anatase TiO2 coating","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300081?af=R","date":1712655263000,"content":"<h2>Abstract</h2>\n<p>Photocatalytic coatings have the potential to contribute to the purification of water via an advanced oxidation process (AOP) [1]. A commonly used method for analyzing the mechanism of the photocatalytic performance of a given reactor type is to document the degradation behavior in a solution containing methylene blue. However, since methylene blue is rather unstable, the degradation results should be viewed critically. In this work, the degradation behavior of a test solution with methylene blue on quartz glass surfaces coated with photocatalytic titanium dioxide (TiO<sub>2</sub>) of the anatase modification was investigated through a variety of different light sources. The coating was deposited by physical vapor deposition (PVD) with the reactive pulsed DC magnetron sputtering ion plating (MSIP) method described in [2], while the quartz glasses were coated with a 100 nm thick TiO<sub>2</sub> coating on the outside. The same glasses were used for all experiments with TiO<sub>2</sub>. In the determination of the degradation rate, additional experiments were performed using pure quartz glass without any coating, which made it possible to examine the influence of different light sources on the degradation rate of methylene blue in general. Three different light sources, namely UV-A, UV-C, and simple fluorescent lamps were used in this study. The concentration of methylene blue was recorded by photo spectrometer in 10-minute increments throughout the experiment and the experiments were performed for 24 hours in all cases. Our data indicates that the methylene blue test is a poor method because the degradation rate is not clearly differentiable due to the low stability of the test substance. Without including reference testing in the absence of a catalyst, data may be subject to misinterpretation.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Nikolai Desch, \nAngela Rheindorf, \nCornelia Fassbender, \nMarc Sloot, \nMarkus Lake","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"520daee147f07492864c47f295a12ae8f6aa13e1125e049d93743129deeaa0e1","category":"Environment"}