{"title":"CES 2024: This 'MagicMirror' Analyzes Facial Blood Flow to Monitor Vital Signs","link":"https://www.macrumors.com/2024/01/08/ces-2024-anura-magicmirror/","date":1704758219000,"content":"NuraLogix this week unveiled the <a href=\"https://www.nuralogix.ai/magic-mirror/\">Anura MagicMirror</a>, a new health product that is designed to use a combination of sensors and artificial intelligence to check vital signs and provide disease risk assessments.\r<br />\n\r<br />\n<div></div>\r<br />\nThe 21.5-inch tabletop smart mirror takes a 30 second scan when a person sits in front of it, analyzing facial blood flow to provide a wealth of information. It uses a patented Transdermal Optical Imaging technology to detect a person's face and monitor blood flow. Machine learning algorithms use the data to provide information on more than 100 health parameters.\r<br />\n\r<br />\nNuraLogix says that the MagicMirror can provide health information that includes blood pressure, BMI, heart rate variability, pulse rate, breathing rate, and facial skin age. It can provide risk assessments for diabetes, cardiovascular disease, stroke, hypertension, fatty liver disease, and more, plus it offers assessments of mental stress and depression risk.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/anura-magic-mirror.jpg\" width=\"609\" height=\"587\" />\r<br />\nMore information on the MagicMirror can be <a href=\"https://www.nuralogix.ai/magic-mirror/\">found on the NuraLogix website</a>. The company has not provided a launch date or a price, but the device appears to be aimed at clinic waiting rooms, retirement homes, and other health-related facilities.<div>Tag: <a href=\"https://www.macrumors.com/guide/ces-2024/\">CES 2024</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/08/ces-2024-anura-magicmirror/\">CES 2024: This 'MagicMirror' Analyzes Facial Blood Flow to Monitor Vital Signs</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ces-2024-this-magicmirror-analyzes-facial-blood-flow-to-monitor-vital-signs.2415810/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5216ca033bc712b8c9a5956855377df11361d8688c2aa1a215d932406d042b88","category":"Apple"}