{"title":"ลุยงานจริง SCB 10X Bangkok Blockathon 2021 เฟ้นหาสุดยอดนักพัฒนาสายบล็อกเชน รับรางวัลเป็นเงินคริปโต","link":"https://www.blognone.com/node/121973","date":1617180476000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>SCB 10X บริษัทโฮลดิ้งคอมพานีในเครือธนาคารไทยพาณิชย์ เล็งเห็นว่าเทรนด์การเงินโลกกำลังจะเปลี่ยนแปลงครั้งใหญ่ เทคโนโลยีบล็อกเชนหรือเทคโนโลยีการเก็บข้อมูลแบบไร้ศูนย์กลาง จะเข้ามาเปลี่ยนระบบการเงินที่เคยมีศูนย์กลางเป็นธนาคาร (Centralized Finance - CeFi) ให้กลายเป็นระบบการเงินไร้ศูนย์กลาง (Decentralized Finance - DeFi) ในอนาคต</p>\n<p>เมื่อเล็งเห็นจุดนี้ SCB 10X จึงเตรียมความพร้อมเพื่อรองรับการเปลี่ยนแปลงในอนาคต รวมถึงเป็นส่วนร่วมพัฒนา Blockchain Community ในประเทศไทย โดยจัดงานเฟ้นหาสุดยอดนักพัฒนาเทคโนโลยีบล็อกเชนรุ่นใหม่ไฟแรงในไทย “Bangkok Blockathon 2021: Finance and Beyond” ซึ่งมีงานเปิดตัวและเน็ตเวิร์กกิ้งไปเมื่อวันที่ 24 มีนาคม 2021 ก่อนจะมีการแข่งขันจริงๆ ในวันที่ 27-28 มีนาคม</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/2c88aa3e7ca419fa15a8ae5f3c60754d.jpg\" ></p>\n<p>ตัวงานเป็นการจัดการแข่งขันพัฒนาโปรดักต์ในสไตล์ Hackathon ระหว่างทีมนักพัฒนาที่มีตั้งแต่ 1 คน จนถึงสูงสุด 5 คน จำนวน 10 ทีม แต่ก่อนถึงวันประกวดจริง มีนักพัฒนาที่ต้องการเข้าแข่งขันส่งโปรไฟล์เข้ามามากกว่า 200 คน และมีหลายทีมที่โดนใจทีมงาน จนในวันประกาศผล ทีมงานตัดสินใจให้มีทีมที่เข้าร่วมได้ถึง 12 ทีม</p>\n<p>จุดประสงค์ของงานเพื่อเป็นการสร้างโปรดักต์ใหม่ด้วยเทคโนโลยีบล็อกเชน (Build) เพื่อพบปะระหว่างนักพัฒนา กับผู้มีประสบการณ์ในวงการบล็อกเชน และพัฒนาทักษะผ่านการแลกเปลี่ยน (Boost) และยังมีเงินรางวัลเพื่อต่อยอดโปรเจกต์ของนักพัฒนาด้วย (Scale Up)</p>\n<p>งาน SCB 10X Bangkok Blockathon 2021 คราวนี้น่าจะเป็นงาน Hackathon ครั้งแรกๆ ในประเทศไทยในที่มอบเงินรางวัลเป็นเงินคริปโตอีกด้วย โดยทีมที่ชนะเลิศ จะได้รับเงินรางวัลเป็นสกุลเงินคริปโต Bitcoin จำนวน 0.1 BTC รองชนะเลิศได้ Ethereum จำนวน 2 Etereum และรองชนะเลิศอันดับสาม ได้รับ Alpha จำนวน 1,300 Alpha</p>\n<p>งานเปิดตัวในวันที่ 24 มีนาคม 2021 เป็นงานเปิดตัวในสไตล์สบายๆ ที่จัดให้ทีมผู้เข้าแข่งขันได้มาพบปะ พูดคุย โดยมีคุณกวีวุฒิ เต็มภูวภัทร Head of Venture Builder ของ SCB 10X รับหน้าที่เป็นพิธีกร และมี ดร.อารักษ์ สุธีวงศ์ ซีอีโอของ SCB 10X ให้เกียรติมาร่วมพูดเปิดงาน และแนะนำจุดประสงค์ของงาน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/03eb465a4630dcfb5a3f3e96dbafea4f.jpg\" ></p>\n<p>หลังจากนั้นมีเซสชั่น virtual fireside chat โดยคุณ Mike Kayamori ซีอีโอและผู้ร่วมก่อตั้ง Liquid Global แพลตฟอร์มเทรดสกุลเงินคริปโตระดับโลก วิดีโอคอลเข้ามาร่วมพูดคุยกับทีมที่เข้าแข่งขัน โดยมีคุณมุขยา พานิช Chief Venture and Investment Officer ของ SCB 10X รับหน้าที่เป็นผู้ดำเนินงาน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/986acca6b516a9ebff850f5743dd18ac.jpg\" ></p>\n<p>คุณ Mike Kayamori เล่าถึงต้นกำเนิดของบริษัท Liquid Global ตั้งแต่ช่วงที่เขาอยู่ซิลิคอนวัลเลย์ในปี 2009 เมื่อ Bitcoin whitepaper เอกสารระบบการเงิน Bitcoin ถูกเผยแพร่โดย Satoshi Nakamoto หนึ่งปีหลังวิกฤตการเงินโลกในปี 2008 ทำให้ประชาชนไม่เชื่อถือในระบบธนาคาร จนเขาเองได้มาซื้อบิตคอยน์ในปี 2013 หลังมาอยู่กับบริษัทลงทุน SoftBank ของญี่ปุ่น และได้มาอยู่ที่สาขาอินเดีย</p>\n<p>คุณ Mike สนใจระบบการทำงานของบล็อกเชน และมองเห็นอนาคตของบิตคอยน์จากการได้เห็นคนอินเดียจำนวนมากที่ไม่มีบัญชีธนาคาร แต่มีสมาร์ทโฟน และอินเทอร์เน็ต ซึ่งบิตคอยน์ ที่มีแค่สองสิ่งนี้ก็สามารถใช้งานได้ น่าจะช่วยให้ประชาชนที่ไม่มีบัญชีธนาคาร สามารถเข้าถึงเงินทุนได้ง่ายขึ้นในอนาคต</p>\n<p>เขาจึงก่อตั้ง Quoine ในปี 2014 ก่อนจะลุยทำระบบเทรด ทำงานกับธนาคาร และระบบการเทรดก็พัฒนาตามลำดับจนเป็นแบบ DeFi ไม่ต้องมีธนาคารมาเกี่ยว ใช้เพียงเงินคริปโตเท่านั้น และกลายมาเป็น Liquid Global ในทุกวันนี้</p>\n<p>หลังจากนั้นคุณ Mike จึงให้ข้อมูลถึงภาพรวมของวงการ DeFi ในปัจจุบัน ที่มีบริษัทในเซกเตอร์ต่างๆ มากมาย รวมถึงพูดถึงโอกาสและความท้าทายของระบบการเงินแบบไร้ศูนย์กลาง ทั้งด้านการแข่งขันของไอเดีย และบริษัทต่างๆ ไปจนถึงการเข้ามามีส่วนร่วมขององค์กรกำกับดูแลจากภาครัฐในอนาคต พร้อมเน้นย้ำถึงความสำคัญในการทำสิ่งที่เชื่อมั่น และให้กำลังใจผู้เข้าแข่งขันในช่วง Blockathon</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1bd9fbd9c2c8f813ca777f33cf73330a.jpg\" ></p>\n<p>นอกจากนี้ยังมีเซสชั่นพูดคุยกับผู้ก่อตั้งสตาร์ทอัพบล็อกเชนสัญชาติไทย อย่างคุณอรพงศ์ เทียนเงิน ซีอีโอแห่ง Digital Ventures สตาร์ทอัพเทคโนโลยีด้านข้อมูลการเงิน คุณสรวิศ ศรีนวกุล ผู้ก่อตั้ง Band Protocol บริษัท Data Oracle เชื่อมโยงข้อมูลจากโลกจริง เช่นราคาหลักทรัพย์ สู่การนำมาใช้งานบนระบบบล็อกเชน และคุณณัฐวุฒิ พึงเจริญพงศ์ ผู้ก่อตั้ง Ookbee และ CO-CEO ของ SIX Network ผู้นำเทคโนโลยีบล็อกเชนมาใช้กับการพิสูจน์ลิขสิทธิ์ของคอนเทนต์ดิจทัล และระบบการจ่ายเงินโดยใช้ระบบโทเค่น</p>\n<p>ทั้งสามท่านได้มาเล่าถึงไอเดียในการก่อตั้งบริษัทจากประสบการณ์จริง โอกาสในการใช้งานจริง และแนวทางการพัฒนาของวงการเทคโนโลยีบล็อกเชน กับระบบการเงินแบบไร้ตัวกลางในไทย รวมถึงความท้าทายของเทคโนโลยีบล็อกเช่นเอง เพื่อแนะนำเส้นทางการพัฒนาที่จะมากำจัดข้อจำกัดเหล่านี้ ในอนาคต และการเตรียมตัวเพื่อทำตามสิ่งที่ฝัน ไม่ว่าตลาดกำลังพุ่งขึ้นหรือไม่ก็ตาม พร้อมทิ้งท้ายด้วยการให้กำลังใจทีมผู้เข้าแข่งขัน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/067e1f75d164db93fdb0eb933200082c.jpg\" ></p>\n<p>หลังจากนั้นมีการถ่ายรูปรวมทีมผู้เข้ารอบทั้ง 12 ทีม ได้แก่ทีม Flipay, KillSwitch, NPledge,TrustPass, Passive Protocol, NFTPass, Nytu - นายตู้, AMDeFi, BitDoc, Estate-Onblock, newby.sol และ Rug Pull Alpaca (RPA) ร่วมกับผู้บริหาร SCB 10X และวิทยากร</p>\n<p>รวมถึงมีปาร์ตี้ให้ผู้เข้าแข่งขันได้พบปะ พูดคุย เพื่อทำความรู้จักก่อนจะเริ่มแข่งขันโค้ดในวัน Blockathon จริงในวันที่ 27-28 มีนาคม ซึ่ง Blognone ก็จะนำผลการแข่งขันและสรุปโปรไฟล์ของทีมผู้ชนะมาให้ติดตามในคราวต่อไป</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/920853ff4b94a9219fd1a46bc472dfef.jpg\" ></p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/scb10x\">SCB10X</a></div><div class=\"field-item odd\"><a href=\"/topics/blockchain\">Blockchain</a></div><div class=\"field-item even\"><a href=\"/topics/hackathon\">Hackathon</a></div><div class=\"field-item odd\"><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"advertorial","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5217bc253b3a83bc0dbaa9b4a60b500e6257fd8d5f3c9f28bf103fbc6b207f33","category":"Thai"}