{"title":"Gran Turismo 7, Spider-Man 2, KOTOR remake lead PlayStation 5 showcase","link":"https://arstechnica.com/?p=1793392","date":1631237120000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Screenshot-8412-980x551.png\" /></div>\n        <p>\n          \"Will one of you finally give me what I desire?\"                      [credit:\n                        <a href=\"http://www.sony.com/\">Sony</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Sony broke a months-long game of silence today with a wide-ranging PS5 showcase, announcing two new Marvel games from Insomniac, a remake of <em>Star Wars: Knights of the Old Republic</em>, and a March release date for <em>Gran Turismo 7</em>, among other news. This is the first significant update from the publisher since it opted to skip multiple major industry events throughout 2021. The industry behemoth is now offering first glimpses of several games in production from PlayStation Studios and third-party developers.</p>\n<p>Leading the charge was news that a remake of BioWare's classic 2003 RPG <em>Knights of the Old Republic</em>—which many players consider the best <a href=\"https://arstechnica.com/tag/star-wars/\"><em>Star Wars</em></a> game ever made—is in development as a PS5-and-PC exclusive, at least at launch. Though only the briefest clip of what looked like a Sith knight was shown, we already know this is a joint project between Lucasfilm, Sony, and Aspyr Media, a studio known for porting classic <em>Star Wars</em> games to modern hardware. Without a release date yet, we wonder whether BioWare's <em>Old Republic</em> MMO will still be in operation by the time this remake launches.</p>\n<h2>PlayStation Studios galore</h2>\n<p>Sony also had some first-party news to share with actual, PS5-only releases. Insomniac is expanding its vision of the Marvelverse in <em>Marvel's Spider-Man 2</em>, due out 2023, and, unexpectedly, a new game starring Wolverine.</p></div><p><a href=\"https://arstechnica.com/?p=1793392#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1793392&amp;comments=1\">Comments</a></p>","author":"Steve Haske","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5218d7919d705948e51a2db3e69d6c218e274bfbf950d964d620d05f8f51fc79","category":"Tech"}