{"title":"When I Say Hike, You Say Bike: A Swift Campout Double Feature – Pat Valade","link":"https://theradavist.com/2021/10/when-i-say-hike-you-say-bike-a-swift-campout-double-feature/?utm_source=rss&utm_medium=rss&utm_campaign=when-i-say-hike-you-say-bike-a-swift-campout-double-feature","date":1634299205000,"content":"<p>It’s pretty clear that I really like bikes, and I really like camping. A lot of us are here because we like combining the two. I’m also very lucky that my partner also likes bikes and camping, and we live in a place where it’s fairly easily accessible to do both. However, For whatever reason, I’ve never managed to actually do a trip over the Swift Campout weekend, and, it looked like the same thing might happen this year! So, we decided that we might cheat a little, and do a close-to-home, Thursday night camp and take advantage of some beautiful weather. All the while still getting our respective work, and school days in. Ideally leaving the rest of the weekend open to *maybe* sneak another ride and camp night in, you never know.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Lookout_switfcampout-2-of-66.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Take 1: The lookout</strong></p>\n<p>We lovingly call this place the lookout, because, you guessed it, it’s up high, and has a great view. Actually, usually this place has a great view, however on this occasion the local flora had grown quite a bit, snatching a bit of the view. Seeing that this is an old clear cut, I’m more than ok with that, the view is still pretty good. This spot is the epitome of the “local overnighter”, we can just barely see our home from it, and it takes about as much pushing as riding to get to it. One can theoretically have dinner at home, and then head out for the night to ride and camp, which is just what we did.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Lookout_switfcampout-7-of-66.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We live in Squamish BC, which is a notoriously wet place. We’ve had quite a rainy couple of weeks prior to this, and we oh so enjoy a good fire, thus, the first order of business was to take a load of firewood by car (gasp!) and rally it as close to the camp spot as possible. Call this a vehicle-assisted overnight if you like, but we have a few bundles of dry firewood at home, and I was fairly determined to sit around a campfire. Now, I don’t have an apocalypse-prepped 4×4 rig, so that meant stashing the wood at the bottom of the nice hike-a-bike that leads to the camp spot, out of view of any opportunist campers. Back home, a flurry of packing, bags, rubber straps, tire-inflating, tire deflating, minimal cursing, and chain lubing ensued, then we were off!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Lookout_switfcampout-12-of-66.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The sun was shining, the bikes were heavy with beers and water, and we were content. Leaving town, we hit the first gravel hill, I twisted my bars to-and-fro, but! Something seemed off. Ahh !@#$! I had forgotten my camera. Which for me on a bike trip, is about as detrimental as forgetting tires. I had an extra lens in my front bag, and nothing to attach it to. Alycia carried on up the climb, and I pedaled my little heart out back to the house, collected the forgotten piece, and boogied my way back up the hill. A quick pedal through a bit of double track, FSR’s and we were at the bottom of the hike-a-bike that guards this spot. We did the shuttle of bikes to the top, ran back down for the firewood, and in no time, we were settling into the dust.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Lookout_switfcampout-50-of-66.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The fire was responsibly roaring, as the evening sky faded into that murky, mysterious blue that immediately precedes a dark night. Crawling into the cozy confines of our sleeping bags, morning came all too quickly. The morning also means coffee, which no one is complaining about, one of the best parts of camping, biking or not. Another little bonus about camping so close to home is that you can just pack up, and scoot into the kitchen for breakfast, just in time for work, school, and the rest of your day.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Nook_Switfcampout-12-of-88.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Night 2: The Nook</strong></p>\n<p>Hoping we could cheat the system and get a Saturday night of camping and riding for a true, genuine Swift Campout, we left our bikes packed and worked furiously to tick the things off of our respective to-do lists. We both had our doubts, but we made it happen! A few small changes to the bags – swapping instant for regular coffee (yes, I bring instant coffee on rides sometimes, and it’s just fine!), refreshing the beverages, snacks, and strapping on some dry kindling, we were ready to roll. If you’re starting to think I’m firewood paranoid by bringing my own kindling, Alycia would definitely agree with you. Spoiler alert – it worked great and was totally worth hauling around, plus it made a pleasant clattering on the back rack anytime we hit some washboard.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Nook_Switfcampout-28-of-88.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Another early evening departure meant that the quiet paved road that starts this ride, unfurled ahead in the yellow glow of the late sun, and we had it all to ourselves. The whir of rubber on the pavement was only broken by the repetitive squeak of a rear rotor rubbing on a fresh pad, quickly drowned out as soon as we hit gravel. Still close to home, but with a slightly longer ride, this little camp spot has become another one of our go-to favourites. It’s a small zone, with room for only one set of campers, so it is a slight gamble when you head out. You just hope you’ll be the first there and that no one else has decided that the furious little hike-a-bikes are worth the trouble (even though they are). Luckily, we haven’t had to turn around yet.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Lookout_switfcampout-64-of-66.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>As spring stretched into summer, I can’t get enough of these long days. Being able to ride a couple of hours from home gives you light to spare, and time to soak in the views, enjoy the fire, chat, make plans for the summer, and just relax. Every time we strap a bunch of silly things to our bicycles, I do have to take a minute to really appreciate using a bike to get to places like this. I’m happy to say we finally ticked off a Swift Campout! It was perfect being able to link two nights, relatively close to home, and enjoy some un-busy, relaxed time with Alycia, and be home in time for second breakfast…</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"521dc0ba9d11c93c796bf16ed457c1de3e4018cbf21c76d81de6df6caec24eab","category":"Cycling"}