{"title":"Bromeliad populations perform distinct ecological strategies across a tropical elevation gradient","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14528?af=R","date":1712119233000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/c1d98a90-291f-4e35-a79f-9e41c4cf5e04/fec14528-toc-0001-m.png\" alt=\"Bromeliad populations perform distinct ecological strategies across a tropical elevation gradient\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/07/beyond-thermal-tolerance-disparate-thermal-strategies-of-bromeliad-populations-across-a-tropical-elevation-gradient/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe effect of environmental gradients on the remarkable diversity of mountain-associated plants and on the species' abilities to cope with climate change transcends species-specific strategies. For instance, our understanding of the impact of thermal gradients on ecological divergences in populations of widely distributed species is limited, although it could provide important insights regarding species' response to climate change.\n\nHere, we investigated whether populations of an endemic species broadly distributed across an elevation gradient employ unique or multiple divergent ecological strategies according to specific environmental conditions. We hypothesised that populations employ distinct strategies, producing a tolerance-avoidance trade-off related to the thermal conditions they experience across elevations.\n\nWe conducted our research with 125 individuals of <i>Pitcairnia flammea</i> (Bromeliaceae) sampled from various elevations spanning from sea level to ~2200 m and cultivated under the same conditions. To assess specific ecological strategies of <i>P. flammea</i> populations across elevations, we examined leaf temperature, heat and cold tolerances, as well as other structural/morphological, optical, physiological and biochemical leaf traits.\n\nWe majorly observed that water-saving traits diminish as elevation increases while membrane fluidity, majorly associated with unsaturated and very-long-chain lipids, enhances. Low-elevation individuals of <i>P. flammea</i> invest in water storage tissues, which likely prevent excessive water loss through the intense transpiration rates under warming periods. Conversely, high-elevation plants exhibit increased membrane fluidity, a possible response to the stiffening induced by low temperature.\n\nOur results revealed a tolerance-avoidance trade-off related to thermal strategies of populations distributed across an elevation gradient. Low-elevation plants avoid excessive leaf temperature by investing in water-saving traits to maintain transpiration rates. High-elevation individuals, in turn, tend to invest in membrane properties to tolerate thermal variations, particularly cold events.\n\nOur findings challenge the conventional notion that plants' vulnerability to warming depends on species-specific thermal tolerance by showing diverse thermal strategies on populations across an elevation gradient.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/07/beyond-thermal-tolerance-disparate-thermal-strategies-of-bromeliad-populations-across-a-tropical-elevation-gradient/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>Resumo</h2>\n<p>\n\nO efeito dos gradientes ambientais na grande diversidade de plantas associadas a montanhas transcende as estratégias específicas de cada espécie. Nosso entendimento sobre o impacto dos gradientes térmicos nas divergências ecológicas em populações de espécies amplamente distribuídas, por exemplo, é limitado, embora possa fornecer informações importantes sobre a resposta das espécies às mudanças climáticas.\n\nAqui, investigamos se populações de uma espécie endêmica e amplamente distribuída em um gradiente altitudinal, empregam estratégias ecológicas únicas ou múltiplas de acordo com condições ambientais específicas. Nossa hipótese é que as populações empregam estratégias que resultam em um equilíbrio entre tolerância e evitação relacionado às condições térmicas que experimentam em diferentes altitudes.\n\nAnalisamos 125 indivíduos de <i>Pitcairnia flammea</i> (Bromeliaceae) amostrados em diversas altitudes, desde o nível do mar até cerca de 2.200 metros, e cultivados nas mesmas condições. Para avaliar as estratégias ecológicas específicas das populações de <i>P. flammea</i>, examinamos temperatura foliar, tolerâncias ao calor e ao frio, além de outros traços foliares estruturais/morfológicos, óticos, fisiológicos e bioquímicos.\n\nVimos que características de economia de água diminuem à medida que a altitude aumenta, enquanto a fluidez da membrana, associada principalmente a lipídios insaturados e de cadeia muito longa, aumenta. Indivíduos de baixa altitude investem em tecidos de armazenamento de água, provavelmente prevenindo a perda excessiva de água durante períodos de aquecimento e com taxas intensas de transpiração. Por outro lado, plantas de altas altitudes possuem maior fluidez de membrana, uma possível resposta ao enrijecimento induzido por baixas temperaturas.\n\nNossos resultados revelaram um equilíbrio entre tolerância e evitação relacionado às estratégias térmicas de populações distribuídas ao longo de um gradiente de altitude. Plantas de baixa altitude evitam temperaturas foliares excessivas investindo em características de economia de água para manter as taxas de transpiração. Indivíduos de alta altitude, por sua vez, tendem a investir em membranas que toleram variações térmicas, especialmente eventos frios.\n\nNossas descobertas desafiam a noção convencional de que a vulnerabilidade das plantas ao aquecimento depende da tolerância térmica específica da espécie, mostrando estratégias térmicas diversas em populações ao longo de um gradiente de altitude.\n</p>","author":"Cleber J. N. Chaves, \nTami C. Cacossi, \nTaynara S. Matos, \nJoão P. S. P. Bento, \nLucas N. Gonçalves, \nSimone F. Silva, \nMarcus V. da Silva‐Ferreira, \nDouglas F. Barbin, \nJuliana L. S. Mayer, \nAlessandra Sussulini, \nRafael V. Ribeiro, \nClarisse Palma‐Silva","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"521d9996a50c83226479ec88cf60185ccfbcaa58ba5269960058bc42f80902a3","category":"Environment"}