{"title":"Heat shocks during egg incubation led to developmental, morphological, and behavioral differences in Arctic charr (Salvelinus alpinus)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15663?af=R","date":1706075168000,"content":"<h2>Abstract</h2>\n<p>Temperature variation is affecting fish biodiversity worldwide, causing changes in geographic distribution, phenotypic structure, and even species extinction. Incubation is a critical stage for stenothermic species, which are vulnerable to large temperature fluctuations, and its effects on the phenotype at later developmental stages are understudied, despite the fact that the phenotype being essential for organism ecology and evolution. In this study, we tested the effects of heat shocks during the embryonic period on the phenotype of Arctic charr (<i>Salvelinus alpinus</i>). We repeatedly quantified multiple phenotypic traits, including morphology, development, and behavior, over a period of 4 months, from hatching to juvenile stage in individuals that had experienced heat shocks (+ 5°C on 24 h, seven times) during their embryonic stage and those that had not. We found that heat shocks led to smaller body size at hatching and a lower sociability. Interestingly, these effects weakened throughout the development of individuals and even reversed in the case of body size. We also found an accelerated growth rate and a higher body condition in the presence of heat shocks. Our study provides evidence that heat shocks experienced during incubation can have long-lasting effects on an individual's phenotype. This highlights the importance of the incubation phase for the development of ectothermic organisms and suggests that temperature fluctuations may have significant ecological and evolutionary implications for Arctic charr. Given the predicted increase in extreme events and the unpredictability of temperature fluctuations, it is critical to further investigate their effects on development by examining fluctuations that vary in frequency and intensity.</p>","author":"François‐Raphaël Lubin, \nEmilie Réalis‐Doyelle, \nLaurent Espinat, \nJean Guillard, \nAllan Raffard","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"521e9006a4d8100eb7c0b4adf1e5bc2bb23f0a86c05fde48c60221471e0e27ff","category":"Environment"}