{"title":"Amazon’s indoor camera drone is ready to fly around your house","link":"https://arstechnica.com/?p=1799097","date":1632873411000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Amazon unloaded an entire delivery truck's worth of products at a private event today. Here are some of the many, many smart home products that were announced.</p>\n<p>Lookout Nest! Amazon is stepping on Google's turf (and its old thermostat partner, Ecobee) with <a href=\"https://amzn.to/3m76uND\" target=\"_blank\">the Amazon Smart Thermostat</a>. Nest thermostats are a circle, so this thing is a square, with the usual touch controls on the front and an app (the Alexa app) for remote control and usage tracking. \"Thermostat Hunches\" will let Alexa control the thermostat based on your location, and of course there are Alexa voice commands. This is \"made with Honeywell Home Thermostat Technology\" so between Amazon's Echo smarts and Honeywell's thermostat experience, there is plenty of expertise here.</p>\n<h2>The Amazon Smart Thermostat: Way cheaper than the competition</h2>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/55-980x735.jpg\" /></div>\n        <p>\n          Amazon's thermostat.                      [credit:\n                        <a href=\"https://www.amazon.com/\">Amazon</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>The device is $59.99, and <a href=\"https://amzn.to/3zSDbmR\" target=\"_blank\">for $16 more</a> you can get a bundle with a C-Wire Power Adapter, which you might need if your existing thermostat wiring isn't putting out enough power. That is dramatically cheaper than Nest, whose cheapest thermostat <a href=\"https://store.google.com/product/nest_thermostat?hl=en-US\" target=\"_blank\">is $129.99</a>. Amazon is also undercutting its biggest thermostat partner, Ecobee, which ships a thermostat with an entire Alexa speaker and microphone integrated into it, the $229.99 Ecobee 4. This is just a thermostat—but wow is it cheap.</p></div><p><a href=\"https://arstechnica.com/?p=1799097#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799097&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5227fc809d43a212739bf646d1984715396dd2da00c521c093597e86667571f3","category":"Tech"}