{"title":"How to stop macOS Mail from using a bad email address","link":"https://www.macworld.com/article/350143/how-to-stop-macos-mail-from-using-a-bad-email-address.html","date":1625738400000,"content":"\n<div>\n<section><div></div></section><p>Apple wants to make sure it’s easy for you to use email addresses to reach people. To that end, it has several mechanisms that let you store an address and others that automatically retain addresses apps and macOS observe:</p>\n\n\n\n<ul><li>The Contacts app records addresses you’ve entered manually.</li><li>Contacts also shows addresses Siri has found in email and elsewhere if you’ve enabled that feature (see below).</li><li>The Mail app retains a list of addresses to which you’ve sent email.</li><li>Mail shows addresses that Siri has discovered throughout the system (see below).</li></ul><div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/mac911-siri-suggestions-settings-mail.png?w=1200\" /><figcaption>The Siri Suggestions preferences let you disable addresses Siri has found from appearing as potential destinations when filling in recipients in Mail.</figcaption></figure></div></div>\n\n\n\n<p>The multiplicity of locations can make it frustrating to track down and remove an email address you no longer want to fill in automatically when you start typing someone’s name in a new message. An unwanted address typically crops up when someone you know changes their primary email address or gets rid of one they were still using as a backup. You had this address in your Contacts and have exchanged messages using it.</p>\n\n\n\n<p>My spouse recently encountered this problem with a colleague and it took us a good 30 minutes to track down the issue and eliminate it. Our pain is your gain.</p>\n\n\n\n<div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/mac911-siri-suggestions.png?w=778\" /><figcaption>Siri suggestions appear at the bottom of automatic suggestions as you type. (Addresses blurred for privacy.)</figcaption></figure></div></div>\n\n\n\n<h2>Where to look for an invalid email address</h2>\n\n\n\n<p><strong>Start with Contacts.</strong> The most likely location for a lingering email address is in a wayward contact record. Open Contacts and search on the address you want to remove, not the person’s name. My partner found that she had duplicate entries for her colleague that were nearly but not quite identical. One contained the old address.</p>\n\n\n\n<p><strong>Look in Mail’s Previous Recipients list.</strong> You may never have interacted with this list, found in <em>Window &gt; Previous Recipients</em>. It contains every address you’ve ever sent a message to unless you’ve removed it from this list. Search for the address here. If it’s in the list, select it and click <em>Remove From List</em>. (I wrote about this <a href=\"https://www.macworld.com/article/228658/a-mysterious-stranger-appears-in-mail-s-to-field.html\">particular problem last in 2016</a>!)</p>\n\n\n\n<p><strong>Disable Siri Suggestions for Mail.</strong> In the Siri preference pane, click <em>Siri Suggestions &amp; Privacy</em> and select <em>Mail</em>. Uncheck <em>Show Siri Suggestions in App</em>.</p>\n\n\n\n<div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/mac911-remove-address.png?w=1098\" /><figcaption>With a person and address selected, you can use the Remove Address item to delete it as an option in Mail.</figcaption></figure></div></div>\n\n\n\n<p><strong>Remove the address within a message’s To field.</strong> If none of that solves the problem, use a different and highly unintuitive Mail field. First, start typing the name that autofills to the person you want to send an address to or the address without their name attached. Select the person or address, hover over the item that’s now filled into the address field, and click the downward-pointing arrow to its right. Finally, select <em>Remove Address</em>.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Lynn.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"52317d0622d0adbd2c78a83ed8280bde919d54a2201dacd9fea487a348b466d4","category":"Apple"}