{"title":"Remco Evenepoel's Pyrenean redemption","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/remco-evenepoels-pyrenean-redemption","date":1694282953000,"content":"\n      \n<p><span>In the first public explanation behind Remco Evenepoel’s disastrous <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> queen stage performance, the Soudal–Quick-Step sports director Klaas Lodewyck said that “cycling is not racing on a simulator, and we are all human beings.”</span></p>\n<p><span>Twenty-four hours on from Evenepoel’s remorseless toppling, the Belgian broke into tears of joy and relief as he rebounded with a stunning comeback on the second consecutive day in the Pyrenees. This was the sight of the human, not the machine, letting all his emotions pour out. </span></p>\n<div></div>\n<p><span>Cycling is a wicked sport: so much time, money, and energy is invested in the pursuit of glory; one bad day can destroy months of preparation and sully a perception of greatness. Evenepoel’s tears were the reflection of the pain he had endured on the race’s brief foray into France.</span></p>\n<p><span>His night in Lourdes had been restless. “I didn’t sleep too much,” he revealed. “I had a very bad night [with] negative thoughts in my head.” His defeat on the Aubisque, Spandelles and Tourmalet had hit him like a punch in the stomach. “It was a difficult evening with a lot of tears and crying,” he added.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2023-stage-15-preview\"><em><strong>Read more: Vuelta a España 2023 stage 15 preview</strong></em></a></p>\n<p><span>There was only one way such a bloody-minded individual would respond. And any talk of him packing his bags were quashed the moment he pulled up to the start of stage 14. Within minutes, he was attacking to get in the breakaway; on the first climb, Col Hourcère, he was off the front alongside Romain Bardet. Only the Frenchman would see him again all day, but not in the last four kilometres when Evenepoel rode away.</span></p>\n<p><span><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1670079506.jpg?v=1694282887\" /></span><span>It’s difficult to describe this as a defining comeback, for Evenepoel, at almost 20 minutes down, remains completely out of the GC picture. But it was a resurgence that demonstrated his mental fortitude. “Today I woke up, and I told myself to go for it, to make the best of it,” he said. “I can be very proud of this answer after yesterday.”</span></p>\n<p><span>The Belgian, now counting 49 career wins, had done a recon of stage 14 because he anticipated it would be crucial to the general classification battle. But without his presence in the GC group, the race for red is now subdued, a procession for Jumbo-Visma. Disappointingly, but not unsurprisingly, the GC fight was dull and muted, Sepp Kuss maintaining his 1:37 advantage over his Jumbo teammate Primož Roglič.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-day-it-all-went-wrong-for-remco-evenepoel\"><em><strong>Read more: The day it all went wrong for Remco Evenepoel</strong></em></a></p>\n<p><span>It meant that all the attention could be on Evenepoel – as he doubtless likes it. This time, though, for the right reasons. His stage 13 capitulation will eat away at him until he next appears at a Grand Tour – expected to be the 2024 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> – but in the meantime, it will serve as motivation as he sets about consolidating his new-found lead in the mountains classification and adding more Vuelta stages to his </span>palmarès<span>. “That’s a nice dream to go with towards Madrid,” he smiled.</span></p>\n<p><span>Evenepoel’s daily mood has fluctuated during the Vuelta’s first two weeks: there has been anger, frustration, helplessness, and also delight, bravado, and swagger. Friday was nothing but deep sorrow. His win on stage 14 will not make up for the bleakest day in his cycling career, but it has certainly turned a scowl into a smile. The question now is, fuelled by the burning desire to prove his doubters wrong, how many more stages Evenepoel will win before the race ends?</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"523ad208b9295a9cd66ec319e96ccba23edc415f552687e0435cb14e60604f10","category":"Cycling"}