{"title":"Apple Demands Leaker Reveals Sources Under Threat of Being Reported to Police","link":"https://www.macrumors.com/2021/07/28/apple-demands-leaker-reveals-sources/","date":1627480433000,"content":"Apple has sent a cease and desist letter to a leaker based in China as part of its continuing attempts to curtail leaks of unreleased products, according to <em><a href=\"https://www.vice.com/en/article/dyv5bm/apple-tells-leaker-to-snitch-on-sources-or-it-will-report-them-to-the-police\">Vice</a></em>. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/Apple-Leak-Feature.jpg\" />\r\n<br />\r\nA Chinese citizen who shared images of stolen Apple prototypes on social media was sent a warning letter from Fangda Partners, Apple's law firm in China, on June 18, 2021. An extract from the letter read:<blockquote>You have disclosed without authorization a large amount of information related to Apple's unreleased and rumored products, which has constituted a deliberate infringement of Apple's trade secrets. Through investigation, Apple has obtained relevant evidence about your unauthorized disclosure of Apple's unreleased and rumored products. Your intentional infringement is specifically manifested as: publishing unpublished information about Apple's new products through social media platforms, including but not limited to the design and performance of these new products.</blockquote>\r\n<br />\r\n\r\n<br />\r\nThe letter went on to ask the seller to stop obtaining, advertising, and selling leaked Apple devices and requested information about anyone who provided them with leaked devices. The leaker was also asked to sign a document agreeing to comply with the requests within 14 days of receiving the letter. It is not clear who the Chinese citizen was that leaked the prototype devices in this particular case.\r\n<br />\r\n\r\n<br />\r\nA previous <em>Vice</em> investigation revealed that there is a gray market fueled by Chinese Apple or Foxconn employees who sneak unreleased hardware out of factories, which allows resellers to acquire devices to sell to collectors, some of who post images on social media.\r\n<br />\r\n\r\n<br />\r\nElsewhere, the original Twitter account of the leaker known as \"Mr. White,\" with the handle <a href=\"https://twitter.com/laobaiTD\">@laobaiTD</a>, was deleted around June 11. There is a <a href=\"https://twitter.com/MrWhite128\">new Mr. White account</a> on Twitter posting images of Apple prototypes, but the original @laobaiTD was responsible for images purporting to depict a shorter, <a href=\"https://www.macrumors.com/2021/03/03/new-apple-pencil-allegedly-leaks/\">third-generation Apple Pencil</a> and <a href=\"https://www.macrumors.com/2020/12/29/airpods-pro-2-two-sizes/\">second-generation AirPods Pro circuitry</a>. \r\n<br />\r\n\r\n<br />\r\nMr. White leaked accurate images of the <a href=\"https://www.macrumors.com/2020/09/01/iphone-12-pro-rear-glass-photo-shows-lidar-scanner/\">iPhone 12 Pro's rear glass</a>, an <a href=\"https://www.macrumors.com/2020/08/06/supposed-iphone-12-display-unit-leaks/\">iPhone 12 mini display unit</a>, <a href=\"https://www.macrumors.com/2020/07/27/a14-chip-component-iphone-12/\">the A14 chip</a>, the <a href=\"https://www.macrumors.com/2019/01/08/alleged-ipad-mini-5-photos/\">iPad mini 5's chassis</a>, and more, all before their official release, as well as leaked images of unreleased products such as a <a href=\"https://www.macrumors.com/2021/06/16/apple-planned-black-ceramic-apple-watch/\">black ceramic Apple Watch Series 5</a>, a <a href=\"https://www.macrumors.com/2021/03/12/apple-prototyped-jet-black-iphone-x/\">Jet Black iPhone X</a>, and a <a href=\"https://www.macrumors.com/2021/06/10/unreleased-ipod-touch-5-chamfered-edges/\">fifth-generation iPod touch with an alternate design</a>.\r\n<br />\r\n\r\n<br />\r\nThe letter from Apple lines up with <a href=\"https://www.macrumors.com/2021/06/24/reliable-leaker-kang-hit-with-warning/\">others sent last month</a> to the reliable leaker known as \"Kang,\" \"<a href=\"https://www.macrumors.com/2021/07/16/apple-warns-leakers-to-stop/\">CConceptCreator</a>,\" who created leaker <a href=\"https://www.macrumors.com/guide/jon-prosser/\">Jon Prosser</a>'s accurate renders of <a href=\"https://www.macrumors.com/roundup/airpods-max/\">AirPods Max</a> before they were released, and others. Another leaker called \"<a href=\"https://twitter.com/Jin_Store\">Jin Store</a>\" on Twitter, who leaked images of accurate molds of the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> lineup, told <em>Vice</em> that he had not received a letter from Apple.\r\n<br />\r\n\r\n<br />\r\nWhile it seems that many of these letters were sent just over a month ago, it is increasingly clear that June saw a fierce and widespread attempt from Apple to cull information coming from individual leakers outside the United States.<div>Tag: <a href=\"https://www.macrumors.com/guide/mr-white/\">Mr. White</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/28/apple-demands-leaker-reveals-sources/\">Apple Demands Leaker Reveals Sources Under Threat of Being Reported to Police</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-demands-leaker-reveals-sources-under-threat-of-being-reported-to-police.2305775/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5EIy0e_6cTI:iyIYi1hcizw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5EIy0e_6cTI:iyIYi1hcizw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/5EIy0e_6cTI\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"524515b39b8848f2117a2c5bae85599c78a3a16e548cd9cbf8b6df1be8b9a50b","category":"Apple"}