{"title":"CRISPR/Cas Mediated Genome Engineering in Plants: Application and Future Prospective","link":"https://www.preprints.org/manuscript/202404.0435/v1","date":1712314219000,"content":"Genetic engineering in the field for designing crop improvement has become an essential element in responding to the increasing need for food safety, environmental sustainability, and climate-resilient crops. The latest molecular technology is used by many breeders today to achieve remarkable results. Fast genome editing is currently being seen in a variety of organisms, including plants, because to the high specificity, high effectiveness, and low production cost of CRISPR/Cas [Clustered regulatory interspaced short palindromic repeat (CRISPR)-associated protein (Cas)] technology. Its applications in developing higher-yielding, nutrition rich, disease resistance, stress-tolerant crops fruits, and vegetables. Therefore, this technology has the potential to revolutionize agriculture and contribute to global food security. The Cas protein provides the enzymatic machinery necessary for the acquisition of new cells that target invasion elements. Cas proteins such as Cas9, Cas12, Cas13, and Cas14, among others, have distinct architectures and have been used to create new genetic tools that improve features that are important for agriculture. The versatility of Cas has accelerated genomic analysis and facilitated the use of CRISPR/Cas to manipulate and alter nucleic acid sequences in cells of different organisms. This review provides the evolution of CRISPR technology exploring its mechanisms and contrasting it with traditional breeding and transgenic approaches to improve different stress tolerance. We will also discuss the CRISPR/Cas system and explore the workings of the three Cas proteins that are currently known to exist: Cas12, Cas13, and Cas14. The edited crops by this technology do not have foreign DNA inserted into their genome, therefore, they are considered as non-transgenic by the regulatory bodies in most countries.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"52463c9f4637b4e494920a6367d4936fc5381999c9ae57ebf3369e7463736dc5","category":"Interdisciplinary"}