{"title":"Exploring the Potential of Anastatica hierochuntica-Integrated Nanofibers as a Promising Nanoplatform for Enhanced Biofilm Disruption and Accelerated wound Healing","link":"https://www.preprints.org/manuscript/202410.1181/v1","date":1728984625000,"content":"Natural components are sparking a lot of interest in the field of drug formulation and delivery. Anastatica hierochuntica is a small plant, extremely rich in its phytochemical content including flavonoids, phenolics, and several minerals. For that, it is widely used in folk medicine in a plethora of conditions such as headache, asthma, menstrual pain, and childbirth. The aim of this research is to investigate its potential antimicrobial effects when loaded onto nanofiber as field leading. The extract-loaded nanofibers were prepared via electrospinning. The prepared nanofibers were rod-shaped with nanometric size as revealed by scanning electron microscopy. The loaded NFs showed increased hydrophilicity compared to the plain NFs as evidenced by reduced WCA and increased percent water uptake. Further, they exhibited adequate tensile properties compared to the plain NFs as evidenced by increased strain and stress.  Based on the highest hydrophilicity (WCA 43.1±0.6º and % swelling 216.67±2.36% after 1 h) and the best mechanical properties (strain and stress of 67.6% and 0.0486 N/mm2, respectively), NF20 was selected for further investigations.  The selected formulation (NF20) showed a bi-phasic, sustained drug release pattern (73.40±1.31% after 72 h). More importantly, testing the antimicrobial effects of the extract-loaded nanofibers highlighted significant reduction in MIC, MBC, and MFC values when compared with Silymarin standard against Acinetobacter baumannii, Pseudomonas aeruginosa, Staphylococcus aureus, and Aspergillus niger. Finally, wound healing assay confirmed the accelerated wound closure and fibroblasts migration in case of the fabricated NF20, suggesting the potential of the bio- fabricated nanofiber as  a novel promising wound dressing.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5253b05b87658b355011f7d2b2c36e455475876267f9f260a9a6cd9f1761ae62","category":"Interdisciplinary"}