{"title":"Relative exergy and energy analysis of DI‐CI engine fueled with higher blend of Azadirachta indica biofuel with n‐butanol and NiO as fuel additives","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14336?af=R","date":1715141849000,"content":"<h2>Abstract</h2>\n<p>Alternate fuels are in high demand for current engines and such fuels are studied both property-wise and tested as fuel in the current engines. In current work, diesel engines are studied for higher blend Neem (<i>Azadirachta indica</i>) biodiesel (NB) as fuel, and fuel additives such as n-butanol and NiO nano additives are chosen. Experimentation was performed on the experimental stationary engine which is coupled to eddy current dynamometer for four test fuels under varying fuel injection timings. Four test fuels were chosen for experimental studies which are Diesel 90% (vol %) + n-butanol (10%), pure Neem biodiesel, NB 90% (vol %) + n-butanol (10%), and Neem Biodiesel 90% + 25 ppm of nickel oxide dissolved in solvent. The synthesis of nickel oxide nano additives was done using a homogenous grinding method and XRD, FESEM, and EDS characterization signifies the presence of NiO. The Neem biodiesel was derived from base catalytic process and was studied using Gas Chromatography and Mass Spectroscopy apparatus for its chemical composition. The experimentation results which were focused were on the energy, exergy derived, and expenditure at varying fuel injection timings. The exergy and energy usage were almost similar in nature and entropy produced during the chemical-to-mechanical energy transfer reduced with the advancement in fuel injection timing to 27° bTDC for Diesel 90% + Bt.10%, NB90 + Bt.10% and NB100 + 25 ppm of NiO by 2.2%, 2.9%, and 4.6% respectively. Also, the exergy destruction retarded when with advancement in fuel inlet timing to 27° bTDC by 2.1%, 3%, 6.2%, and 6.8% for the same fuels, respectively.</p>","author":"Campli Srinidhi, \nShylesha V. Channapattana, \nKiran Aithal, \nSandeep Sarnobath, \nNamdev A. Patil, \nSanjaykumar Patel, \nAnuja Karle, \nAnsam Adil Mohammed","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"52622d00be6fa050819ae65383948b6bad800b81f307d26f8734c4bee0cbb7b5","category":"Environment"}