{"title":"4D Neutron Imaging of Solute Transport and Fluid Flow in Sandstone Before and After Mineral Precipitation","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036293?af=R","date":1710313200000,"content":"<h2>Abstract</h2>\n<p>In many geological systems, the porosity of rock or soil may evolve during mineral precipitation, a process that controls fluid transport properties. Here, we investigate the use of 4D neutron imaging to image flow and transport in Bentheim sandstone core samples before and after in-situ calcium carbonate precipitation. First, we demonstrate the applicability of neutron imaging to quantify the solute dispersion along the interface between heavy water and a cadmium aqueous solution. Then, we monitor the flow of heavy water within two Bentheim sandstone core samples before and after a step of in-situ mineral precipitation. The precipitation of calcium carbonate is induced by reactive mixing of two solutions containing CaCl<sub>2</sub> and Na<sub>2</sub>CO<sub>3</sub>, either by injecting these two fluids one after each other (sequential experiment) or by injecting them in parallel (co-flow experiment). We use the contrast in neutron attenuation from time-resolved tomograms to derive three-dimensional fluid velocity field by using an inversion technique based on the advection-dispersion equation. Results show mineral precipitation induces a wider distribution of local flow velocities and leads to alterations in the main flow pathways. The flow distribution appears to be independent of the initial distribution in the sequential experiment, while in the co-flow experiment, we observed that higher initial local fluid velocities tended to increase slightly following precipitation. The outcome of this study contributes to progressing the knowledge in the domain of reactive solute and contaminant transport in the subsurface using the promising technique of neutron imaging.</p>","author":"Paiman Shafabakhsh, \nBenoît Cordonnier, \nAnne Pluymakers, \nTanguy Le Borgne, \nJoachim Mathiesen, \nGaute Linga, \nYi Hu, \nAnders Kaestner, \nFrançois Renard","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"526dac91e42ac9c512537a76a7f0e75512dd3fdf700dfa924fa521e3e9fc6d56","category":"Environment"}