{"title":"Driving the Volvo EX30, a $36K EV that prioritizes sustainability","link":"https://arstechnica.com/?p=1981265","date":1699257655000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/Volvo_EX30_CloudBlue_98-800x534.jpg\" alt=\"A blue-grey Volvo EX30 drives towards the camera\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/Volvo_EX30_CloudBlue_98-scaled.jpg\">Enlarge</a> <span>/</span> There are growing calls for smaller, cheaper electric vehicles, and at least Volvo has been listening. (credit: Volvo)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Volvo provided flights from Los Angeles to Barcelona and three nights in a hotel so we could drive the EC30. Ars does not accept paid editorial content.</aside>\n<p>Volvo’s near-term plan is to become a fully electric carmaker by the year 2030. But the company has an even more ambitious—and arguably more impactful—goal on the horizon: to be completely carbon-neutral by 2040. Volvo aims to achieve this by optimizing its manufacturing processes and greatly increasing the amount of recycled, sustainable materials being used in its cars. The new EX30 EV is a small crossover that represents a big step in this direction.</p>\n<p>The EX30 focuses on carbon-neutrality from its inception. This subcompact electric SUV will be built at Volvo’s plant in Zhangjiakou, China—a facility powered by 100 percent climate-neutral electricity—and the carmaker will expand EX30 production to its Ghent, Belgium, factory in 2025. Volvo estimates that 25 percent of the aluminum used in the construction of the EX30 is recycled, as is 17 percent of all steel. Additionally, 17 percent of all the plastics in the EX30—everything from bumpers to interior components—is recycled, which is the highest percentage of any Volvo to date.</p>\n<p>Sitting inside the EX30, these efforts are on full display. Denim, flax, and blended wool that contains 70 percent recycled polyester make up the deco pieces, which not only look cooler than traditional wood or metal trim but also feel more interesting beneath your fingertips. There's a celestial deco that's made from ground-down bits of scraps created during various manufacturing processes, and the denim pieces come from threading together shredded fibers that are usually wasted when recycling jeans. The flax fiber panels are colorful and full of texture, and vegan fabrics cover a long-time Volvo hallmark: super comfy seats.</p></div><p><a href=\"https://arstechnica.com/?p=1981265#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1981265&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"526e2a5ef3e627f984da463fcd9d73076a6bab6bb832e50e29edc4ce75c3e808","category":"Tech"}