{"title":"Rapid quantitative assessment of temporal and spatial variation in key functional genes of the microbial nitrogen cycle across multiple marine environments using the NanoString nCounter","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10594?af=R","date":1708082732000,"content":"<h2>Abstract</h2>\n<p>The marine nitrogen cycle controls oceanic productivity through enzymatic processes mediated by microbes. Here, we report the construction, evaluation, and application of the OceansN CodeSet for the NanoString nCounter, which quantifies a suite of protein-coding genes that are central to microbially mediated nitrogen cycle processes in the ocean. We also placed emphasis on quantifying a diverse set of marine diazotrophs within known <i>nifH</i> phylogenetic clades. The OceansN CodeSet provided direct hybridization-based quantitation of 48 probes in a single sample, presenting advantages in terms of reduced sample handling, elimination of amplification bias, minimal DNA sample requirements, and the ability to assess targets ranging from relatively rare to abundant, with a reliable quantitation limit of ~ 1000 gene copies per target per sample. As such, our approach fills a unique methodological niche between the scale of high-throughput amplicon sequencing (a compositional method) and quantitative polymerase chain reaction (qPCR) (a targeted method with generally lower throughput). When applied to North Atlantic environmental DNA samples, the OceansN CodeSet revealed temporal and spatial patterns in nitrogen assimilation, nitrification, and denitrification, as well as the abundance and distribution of various nitrogen-fixing microorganisms (diazotrophs). Data from the nCounter was validated via internal and external controls, and by comparison to qPCR, <i>nifH</i> amplicon sequencing, and shotgun metagenomic sequencing.</p>","author":"Jennifer Tolman, \nDhwani Desai, \nJulie LaRoche","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"5271401a60bf61eb1dd1b6d1499af6bccfca54ba6295ca2770ca51022ee99419","category":"Environment"}