{"title":"Integrated analysis of gut microbiota and metabolomic profiling in colorectal cancer metastasis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24228?af=R","date":1710414753000,"content":"<h2>Abstract</h2>\n<p>Colorectal cancer (CRC) is characterized by its heterogeneity and complex metastatic mechanisms, presenting significant challenges in treatment and prognosis. This study aimed to unravel the intricate interplay between the gut microbiota and metabolic alterations associated with CRC metastasis. By employing high-throughput sequencing and advanced metabolomic techniques, we identified distinct patterns in the gut microbiome and fecal metabolites across different CRC metastatic sites. The differential gene analysis highlighted significant enrichment in biological processes related to immune response and extracellular matrix organization, with key genes playing roles in the complement and clotting cascades, and staphylococcus aureus infections. Protein–protein interaction networks further elucidated the potential mechanisms driving CRC spread, emphasizing the importance of extracellular vesicles and the PPAR signaling pathway in tumor metastasis. Our comprehensive microbiota analysis revealed a relatively stable alpha diversity across groups but identified specific bacterial genera associated with metastatic stages. Metabolomic profiling using OPLS-DA models unveiled distinct metabolic signatures, with differential metabolites enriched in pathways crucial for cancer metabolism and immune modulation. Integrative analysis of the gut microbiota and metabolic profiles highlighted significant correlations, suggesting a complex interplay that may influence CRC progression and metastasis. These findings offer novel insights into the microbial and metabolic underpinnings of CRC metastasis, paving the way for innovative diagnostic and therapeutic strategies targeting the gut microbiome and metabolic pathways.</p>","author":"Yang Xia, \nLing Duan, \nXin‐lian Zhang, \nYu‐juan Niu, \nXiaoling Ling","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"527dfd0a483e0a12b9e1ab34242e65da6034f52a0e515ef6adda13b455ec63ad","category":"Environment"}