{"title":"Prevalence and Factors Associated with Intestinal Helminthiases and Schistosomiasis Among Preschool &ndash; Aged Children in Rwanda","link":"https://www.preprints.org/manuscript/202410.1080/v1","date":1728913140000,"content":"Background: Intestinal helminthiases and schistosomiasis are among the neglected tropical diseases targeted by the World Health Organization (WHO) for elimination as a public health issue by 2030. For this, it is important to determine their distribution and predicting factors, after a decade of mass deworming campaigns. In particular, such information is scarce among pre-school aged children who have not been the target for epidemiological studies and schistosomiasis deworming activities. This cross-sectional study and secondary data analysis focused on preschool-aged children and was aimed to determine the prevalence of intestinal helminthiases (Ascaris, ankylostoma, trichirus trichura, taenia) and Schistosomiasis, and identify the factors associated with them in Rwanda.\nMethods: Data from 4,675 preschool-aged children randomly selected from 17 districts endemic to Schistosoma mansoni were analyzed. Parasitological assessment was performed using the Kato Katz technique. Having at least one intestinal helminthiasis or schistosomiasis case was considered a positive outcome. A structured questionnaire for childcare guardians, literature, and GIS were used to collect information regarding environmental factors. Data were aggregated at village level to calculate village prevalence used in depicting the distribution of intestinal helminthiases and schistosomiasis. Descriptive analysis was performed, and prevalence was assessed as a measure of frequency. The chi-square test was used for bivariate analysis whereas logistic regression was used for multivariable analysis. The confidence level was set at 95%, and the decision was made based on the P-value. Odds ratios (ORs) were assessed as a measure of association. STATA 15 and ArcGIS software were used in this study.\nResults: The prevalence of intestinal helminthiases and schistosomiasis among preschool-aged children was 20.3%. Ascaris was the most prevalent parasite in this study (15%). Being older than 24 months, having self-employed parents, residence, fetching water into the lake or water body, land cover, clay soil, and high LST are predictors of intestinal helminthiases and schistosomiasis among preschool-aged children in Rwanda.\nConclusion: The prevalence of 20.3% is moderate and in the march towards the elimination of these parasitic infections, deworming activities should be coupled with water supply, reinforcement of the use of Early Child Development (ECD), relocating people living in proximity of wetlands and water bodies, and health education are key interventions in preventing preschool-aged children to get intestinal helminthiases and Schistosomiasis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"527f5900d3d5ebfc113695137dec907aa11c505c9a137d0da504cdb7be9ad7c6","category":"Interdisciplinary"}