{"title":"Anti-5G “quantum pendants” are radioactive","link":"https://arstechnica.com/?p=1821525","date":1639776484000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/anti5G-TOP-800x532.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/anti5G-TOP.jpg\">Enlarge</a> <span>/</span> This \"quantum pendant\" purports to protect the wearer from 5G signals. The anti-5G hysteria is a groundless conspiracy theory, but the pendants aren't just useless trinkets. They emit low levels of ionizing radiation that can cause adverse health effects over time. (credit: Rijksinstituut voor Volksgezondheid en Milieu)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Worried that 5G cell phone towers are beaming dangerous levels of radiofrequency radiation into your brain? Forget the classic <a href=\"https://en.wikipedia.org/wiki/Tin_foil_hat\">tinfoil hat</a> and try the \"quantum pendant\" pictured above. It's a much more stylish accessory. The product leans on a tried and true pseudoscientific marketing gimmick: Slap the label \"quantum\" on something, and the word imparts an aura of magical mystery in the minds of the perpetually gullible.</p>\n<p>These kinds of \"negative ion\" products can be found for sale all over the Internet, claiming to enhance immune function, increase energy, and, yes, protect the wearer from supposedly harmful 5G waves, among other purported benefits. The hysteria over 5G risks has no scientific basis, and even if it did, \"negative ions\" aren't some kind of magical defense. But if people want to spend their hard-earned cash on nonsense, that's their prerogative. No harm, no foul, right?</p>\n<p>Not so fast. It turns out that many of these products <a href=\"https://www.theguardian.com/technology/2021/dec/17/anti-5g-necklaces-radioactive-dutch-nuclear-experts-quantum-pendants?CMP=fb_a-technology_b-gdntech\">emit low levels of ionizing radiation</a> that could be dangerous over prolonged use—so much so that the Authority for Nuclear Safety and Radiation Protection (ANVS) in the Netherlands has just issued <a href=\"https://english.autoriteitnvs.nl/latest/news/2021/12/16/do-you-have-a-quantum-pendant-anti-5g-pendant-or-a-negative-ion-jewellery-item-or-sleep-mask-if-so-store-it-away-safely\">a consumer warning</a> and banned the sale of ten such products, including that snazzy quantum pendant.</p></div><p><a href=\"https://arstechnica.com/?p=1821525#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1821525&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"52804ee3e35a3b835f114345c64cd635330f66a9e54897565b54aecb70898f52","category":"Tech"}