{"title":"Unveiling health dynamics: Exploring the impact of CO2 emissions, urbanization, and renewable energy on life expectancy and infant mortality in SAARC countries (1990–2022)","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12460?af=R","date":1712221838000,"content":"<h2>Abstract</h2>\n<p>This study examines the intensifying threat to public health caused by increased CO<sub>2</sub> emissions from energy and modern urbanization. In this connection, we focused on SAARC countries from 1990 to 2022. The study explores the dynamic association among urbanization, CO<sub>2</sub> emissions, renewable energy, and key health indicators, namely life expectancy and infant mortality. It offers nuanced insights by highlighting the requirement for sustainable policies to meet health challenges associated with CO<sub>2</sub> emissions and urban development in SAARC economies. To achieve the study objectives, the authors utilized panel auto regressive distributed lag for assessing short-term and long-run effects, and the method of moments quantile regressions to check these effects across different quantiles. The empirical results underscore the positive impact of renewable energy, urbanization, GDP, and industrialization on life expectancy. Conversely, CO<sub>2</sub> emissions exhibit a detrimental impact on life expectancy, leading towards numerous diseases in both the short and long term. Notably, in the case of infant mortality, the study discloses that renewable energy, urbanization, GDP, and industrialization negatively affect infant mortality, while CO2 emissions positively impact infant mortality in both short and long-run scenarios. Fully modified ordinary least squares and dynamic ordinary least squares further fortified our findings, supporting the results derived from panel auto regressive distributed lag and method of moments quantile regressions. The study's policy implications highlight the imperative for governments and policymakers to prioritize renewable energy and sustainable urbanization, mitigating the adverse health effects of CO<sub>2</sub> emissions from non-renewable energy sources. The study's findings further endorse a strategic shift towards renewable energy sources, positioning them as substitutes for conventional forms such as fossil fuels. Additionally, the emphasis is on planned and sustainable urbanization, facilitating improved access to health facilities and overall public health.</p>","author":"Aijun Guo, \nObaid Ullah, \nAli Zeb, \nNaeem Ud Din, \nShujaat Hussain","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"52862f8f105bf1a9b5805020f90c20a610bbbfb8950a0691ae5fb2f3a0d7d30f","category":"Environment"}