{"title":"Accenture เผยองค์กรยุคใหม่ ไม่รอปรับตัว New Normal แต่สร้าง New Normal ขึ้นมาเอง","link":"https://www.blognone.com/node/123260","date":1624014000000,"content":"<div><div><div><p>การทำ Digital Transformation เพื่อให้ธุรกิจเดินหน้าต่อได้โดยเฉพาะช่วงวิกฤตโรคระบาดถือเป็นการตัดสินใจครั้งใหญ่ ที่ต้องมาพร้อมกับวิสัยทัศน์ของผู้บริหารที่มีอำนาจในองค์กรด้วย</p>\n<p>Accenture ที่ปรึกษาด้านเทคโนโลยีและธุรกิจชั้นนำของโลก สำรวจความเห็นผู้นำในองค์กรชั้นนำ 6,241 ราย ใน 31 ประเทศ รวมถึงประเทศไทย เพื่อหาคำตอบว่าแต่ละองค์กรมีวิธีคิดอย่างไร วิสัยทัศน์แบบไหนที่จะพาองค์กรรอดพ้นจากวิกฤตครั้งนี้ได้</p>\n<p>Accenture สรุปผลออกมาเป็นรายงาน Accenture Technology Vision 2021 ในชื่อธีมว่า Leaders Wanted: Masters of Change at a Moment of Truth</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/12cc847fd35354a1adf12c5e1e1c7670.png\" /></p>\n<h3>องค์กรยุคใหม่ ไม่รอ New Normal แต่สร้าง New Normal ขึ้นมาเอง</h3>\n<p>รายงานของปี 2021 ชี้ว่า ผู้นำองค์กรทุกคนต้องเป็นผู้นำเรื่องเทคโนโลยีด้วย (every leader is a technology leader) เพราะธุรกิจแยกออกจากเทคโนโลยีไม่ได้อีกแล้ว</p>\n<p>ภัยคุกคามจาก COVID-19 ท้าทายความเชื่อเดิมๆ ของโลกธุรกิจมาก ทุกคนต้องปรับตัวเข้าหาโลกใหม่ และองค์กรที่จะประสบความสำเร็จต้องเป็นผู้นำเรื่องการเปลี่ยนแปลง (Master of Changes)</p>\n<p>ตอนนี้ ผู้นำองค์กรยุคใหม่มองไกลไปถึงยุคหลังโรคระบาดแล้ว พวกเขาไม่รอให้ New Normal เกิดขึ้นแล้วค่อยปรับตัว แต่สร้าง New Normal ขึ้นมาเอง เทคโนโลยีไม่ได้มีประโยชน์แค่แก้ปัญหาทางธุรกิจ แต่สามารถสร้างวิสัยทัศน์ใหม่สำหรับธุรกิจในอนาคต</p>\n<p>ผลสำรวจยังสามารถสรุปเป็นใจความสำคัญได้ว่า องค์กรที่มีพื้นฐานด้านดิจิทัลแข็งแรง จะสามารถปรับตัวและคิดค้นนวัตกรรมใหม่ได้เร็ว สามารถต่อยอดสร้างรายได้ในช่องทางใหม่ๆ ให้องค์กรได้เร็วขึ้น และเร็วกว่าองค์กรที่ตามอยู่ถึง 5 เท่า บริษัทชั้นนำจึงต่างแข่งขันกันเพื่อปรับตัวและปรับบทบาทใหม่ รวมถึงการใช้นวัตกรรมทางเทคโนโลยีที่สร้างขึ้นมาเอง เพื่อเป็นผู้กำหนดสภาวะความเป็นจริงแบบใหม่ที่พวกเขาต้องเผชิญ</p>\n<h3>5 เทรนด์เทคโนโลยีที่องค์กรนำไปปรับใช้ได้ในสามปีข้างหน้า</h3>\n<p>รายงาน Accenture Technology Vision 2021 ยังสรุปเทรนด์เทคโนโลยีแห่งอนาคต 5 ด้าน ที่องค์กรต้องเตรียมปรับตัวในสามปีข้างหน้า<br />\n<img src=\"https://www.blognone.com/sites/default/files/externals/a8ebe4821b4dc3490dd590e43c1cbd55.png\" /></p>\n<p><strong>1. การเลือกสถาปัตยกรรมเทคโนโลยี (Stack Strategically)</strong></p>\n<p>ยุคสมัยของ digital transformation ทำให้องค์กรมีตัวเลือกทางเทคโนโลยีมากอย่างที่ไม่เคยมีมาก่อน ผู้บริหารองค์กรจึงต้องเผชิญกับตัวเลือกที่หลากหลาย ไม่ว่าจะเป็นการเลือกประเภทของคลาวด์ เลือกโมเดลของ AI หรืออุปกรณ์ edge ที่ใช้ประมวลผลปลายทาง</p>\n<p>เราเริ่มเห็นข้อจำกัดขององค์กรยุคเก่าที่ติดอยู่กับสถาปัตยกรรมเทคโนโลยีเก่าที่ไม่ยืดหยุ่นและปรับตัวตามโลกยุคใหม่ไม่ทัน เช่น รัฐบาลท้องถิ่นในสหรัฐที่ยังใช้ระบบประกันสังคมที่เขียนด้วย COBOL ซึ่งเป็นภาษาคอมพิวเตอร์สำหรับใช้ในงานธุรกิจภาษาแรกของโลก และมีปัญหาเมื่อต้องจ่ายเงินชดเชยคนตกงานช่วง COVID-19</p>\n<p>ในยุคสมัยที่สถาปัตยกรรมหรือโครงสร้างทางเทคโนโลยีมีความสำคัญมากกว่าในอดีตมาก การเลือกโครงสร้าง และ tech stack ที่เหมาะสม เปิดโอกาสให้องค์กรปรับตัวได้อย่างรวดเร็ว จึงเป็นเรื่องสำคัญมากของธุรกิจยุคนี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3d3116e7fddd99429893bd3d063a4111.png\" /></p>\n<p><strong>2. โลกคู่ขนาน กายภาพ-ดิจิทัล (Mirrored World)</strong></p>\n<p>แนวคิด Digital Twins คือการทำสำเนาหรือแบบจำลองของวัตถุต่างๆ ทางกายภาพให้อยู่ในรูปแบบดิจิทัล เช่น จำลองเครื่องจักรโรงงาน ซัพพลายเชน และวงจรชีวิตของสินค้า มาไว้ในโลกดิจิทัลในฐานะฝาแฝด</p>\n<p>ช่วงแรกของ Digital Twins ถูกผลักดันขึ้นมาด้วยเหตุผลเรื่องการมอนิเตอร์ หรือจำลองอุปกรณ์ต่างๆ เท่านั้น แต่เมื่อเวลาผ่านไป องค์กรเริ่มค้นพบประโยชน์จากการเชื่อมต่อข้อมูลของฝาแฝดเหล่านี้จำนวนมากๆ เข้าด้วยกัน จนกลายเป็นโรงงาน หรือเมืองเสมือนในโลกไซเบอร์ ที่มีข้อมูลวิ่งไหลผ่านอยู่ตลอดเวลา</p>\n<p>ตัวอย่างบริษัทที่นำแนวคิดนี้ไปใช้คือ Unilever พัฒนา AI เพื่อควบคุมโรงงานผลิต ดึงข้อมูลจากเซ็นเซอร์บนเครื่องจักร เพื่อเก็บข้อมูลสถานะความชื้น อุณหภูมิ และหาสภาพที่ดีที่สุดในการทำงาน ผลคือ Unilever สามารถประหยัดค่าใช้จ่ายกว่าล้านเหรียญ เพิ่มผลผลิต 3% โรงงานผลิตสามารถทำงานได้ต่อเนื่อง ลดดาวน์ไทม์ของเครื่องจักรลง และลดภาระการดูแลโดยมนุษย์ลง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9f920639b6837cbe862cbfee7593461b.png\" /></p>\n<p><strong>3. ทุกคนคือผู้สร้างเทคโนโลยี (I, Technologist)</strong></p>\n<p>การสร้างเทคโนโลยีในองค์กรไม่ได้จำกัดเฉพาะโปรแกรมเมอร์หรือวิศวกรอีกต่อไป เพราะเครื่องมือยุคใหม่อย่าง low-code, การสั่งงานด้วยภาษาธรรมชาติ (natural language processing) และระบบอัตโนมัติ (robotic process automation หรือ RPA) ช่วยให้พนักงานตำแหน่งอื่นๆ ในองค์กร สามารถสร้างแอปพลิเคชันอย่างง่ายๆ มาช่วยแก้ปัญหาของตัวเองได้ โดยไม่ต้องรอโปรแกรมเมอร์ ทำให้ความเร็วในการทำงานเพิ่มขึ้น</p>\n<p>เมื่อทุกคนในองค์กรเข้าถึงเทคโนโลยีได้อย่างเท่าเทียม พนักงานทุกคนจึงเป็นส่วนหนึ่งของ digital transformation สร้างนวัตกรรมขึ้นได้ เป็นโจทย์ขององค์กรที่จะต้องจัดหาเครื่องมือเหล่านี้ให้ทุกคน สอนและกระตุ้นให้ทุกคนรู้จักใช้งาน</p>\n<p>ตัวอย่างองค์กรที่เดินหน้าในทิศทางนี้คือ บริษัทเครื่องดื่ม G&amp;J Pepsi นำ Power Apps ของไมโครซอฟท์มาเชื่อมต่อกับแอปที่ใช้งานในองค์กร โดยออกแบบ UI ที่ง่ายต่อการใช้งาน ผลคือพนักงานสามารถพัฒนาเครื่องมือขึ้นใช้ได้เอง แม้ไม่มีทักษะมาก่อน สามารถสร้างระบบงานใหม่ๆ เข้ามาใช้ในการกระจายคลังสินค้าได้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ec23f1eededfedece32fc343b2339524.png\" /></p>\n<p><strong>4. ยุคแห่งการทำงานที่ไหนก็ได้ (Anywhere, Everywhere)</strong></p>\n<p>COVID-19 มาพร้อมกับรูปแบบการทำงานใหม่คือ การทำงานที่ไหนก็ได้ ไม่ใช่แค่ทำงานจากที่บ้าน แต่อาจเป็นร้านกาแฟ หรือสนามบิน ดังนั้นผู้นำองค์กรจึงต้องเริ่มทบทวนและปรับวัฒนธรรมองค์กรให้เข้ากับโลกการทำงานในรูปแบบใหม่</p>\n<p>องค์กรชั้นนำจะเริ่มเปลี่ยนแนวการทำงานจาก \"นำอุปกรณ์ส่วนตัวมาใช้ในการทำงาน\" (bring your own device - BYOD) มาสู่การที่พนักงานสามารถ “กำหนดสภาวะแวดล้อมการทำงานได้เอง” (bring your own environment - BYOE) ดังนั้น ทั้งระบบไอทีองค์กร ระเบียบองค์กร วัฒนธรรมองค์กร จึงต้องคิดใหม่ทั้งหมดเพื่อเปิดกว้างให้คนทำงานพันธุ์ใหม่นี้</p>\n<p>Accenture ชี้ว่าบริษัทที่จะประสบความสำเร็จในอีก 3 ปีข้างหน้า คือบริษัทที่เปลี่ยนความคิดที่จะนำพนักงานทุกคนกลับไปทำงานในออฟฟิศดังเดิม แต่เลือกจะมองหาโมเดลการทำงานรูปแบบใหม่ในโลกที่เปลี่ยนแปลงไปแล้ว<br />\nซึ่งแนวทาง BYOE จะช่วยแก้ปัญหาเรื่องการหาพนักงานมีฝีมือได้มาก เนื่องจากทำลายข้อจำกัดเรื่องสถานที่ลงไป</p>\n<p>ตัวอย่างองค์กรที่เป็นผู้นำในแนวทางนี้คือ Fujitsu ทำโครงการ work life shift ให้แก่พนักงานกว่าแปดหมื่นคน มอบอำนาจให้พนักงานเลือกเองว่าอยากทำงานแบบไหน นอกจากนี้ยังปรับแผนขยายออฟฟิศให้เป็นดาวกระจาย สร้างออฟฟิศย่อยขนาดเล็กในสถานที่ต่างๆ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c102e2ad1c04f36fb5f082ccb68328fd.png\" /></p>\n<p><strong>5. อยู่รอดได้ด้วยความร่วมมือ (From Me to We)</strong></p>\n<p>แนวคิด Multiparty Systems (MPS) คือการสร้างแพลตฟอร์มแชร์ข้อมูลระหว่างผู้ใช้และองค์กรหลายฝ่าย เพื่อหาโมเดลธุรกิจใหม่ๆ แทนแนวคิดเดิมที่องค์กรเก็บข้อมูลไว้กับตัวเอง</p>\n<p>ตัวอย่างเทคโนโลยีแนวคิด MPS ได้แก่ blockchain, distributed ledger, distributed database, tokenization ที่นำข้อมูลมาใส่ระบบไอทีตรงกลาง และเปิดให้พาร์ทเนอร์ที่เกี่ยวข้องหลายๆ รายเข้ามาแลกเปลี่ยนข้อมูลได้ แนวคิดเหล่านี้สามารถช่วยแก้ปัญหาของระบบไอทียุคเดิมที่เป็นแบบจุดต่อจุด และอาจติดขัดได้หากระบบของฝ่ายใดฝ่ายหนึ่งใช้งานไม่ได้ชั่วคราว ดังที่เกิดขึ้นแล้วกับซัพพลายเชนในยุค COVID-19</p>\n<p>ตัวอย่างจากเทรนด์นี้คือ บริษัทประกันในประเทศจีน ชื่อว่า ผิงอัน สร้างคลาวด์แพลตฟอร์มตามรูปแบบธุรกิจประกันของตัวเอง 5 ประเภท แต่ละกลุ่มธุรกิจมีแอปพลิเคชั่นของตัวเอง แต่ในขณะเดียวกันก็ออกแบบระบบให้เชื่อมโยงกัน สามารถขายประกันข้ามกลุ่มได้ ผลที่ได้คือมีผู้ใช้งานกว่า 500 ล้านคนบนแพลตฟอร์มทั้งหมด มีลูกค้ารายใหม่และขยายแพลตฟอร์มไปยังบริการภายนอก เช่น สถาบันการเงิน ธนาคาร เพิ่มรายได้หมุนเวียนไม่ต่ำกว่า 5 พันล้านเหรียญ</p>\n<h3>Accenture บริษัทที่ปรึกษาด้านเทคโนโลยีและธุรกิจระดับโลก</h3>\n<p>เป็นเวลา 21 ปีแล้วที่ Accenture ได้วิเคราะห์สภาพแวดล้อมขององค์กรต่างๆ เพื่อค้นหาแนวโน้มด้านเทคโนโลยีที่จะเข้ามามีบทบาทเปลี่ยนโลกธุรกิจและอุตสาหกรรมในอนาคตได้ ผู้ที่สนใจสามารถเข้าดูรายละเอียดเกี่ยวกับรายงานได้ที่ <a href=\"https://www.accenture.com/us-en/insights/technology/technology-trends-2021?c=acn_glb_technologyvisiopressrelease_11985252&amp;n=mrl_0221\">Accenture Technology Vision 2021</a></p>\n<p>Accenture เป็นบริษัทที่ปรึกษาระดับโลก มีความถนัดด้านดิจิทัล คลาวด์ และระบบรักษาความปลอดภัย มีความเชี่ยวชาญเฉพาะครอบคลุมกว่า 40 อุตสาหกรรม สามารถให้คำแนะนำด้านยุทธศาสตร์และเป็นที่ปรึกษาแก่ธุรกิจ ปัจจุบันรองรับลูกค้ากว่า 120 ประเทศทั่วโลก ดูรายละเอียดเพิ่มเติมได้ที่เว็บไซต์ <a href=\"https://www.accenture.com/th-en/insights/technology/technology-trends-2021?c=car_glb_brandadvocacygraziambursonmars_12095236&amp;n=otc_0421\">www.accenture.com</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/accenture\">Accenture</a></div><div><a href=\"/topics/technology-trends\">Technology trends</a></div><div><a href=\"/topics/digitaltransformation\">DigitalTransformation</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"advertorial","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"52968124d04978df564869ef749037e2da09af22a4d3ac01142b39daf113655b","category":"Thai"}