{"title":"[ลือ] Samsung เตรียมทดลองบริการเล่นเกมผ่านคลาวด์ใน Samsung Game Launcher","link":"https://www.blognone.com/node/136101","date":1696505899000,"content":"<div><div><div><p>จากรายงานของ Korea Economic Daily บอกว่า  Samsung เตรียมเปิดตัวบริการเล่นเกมผ่านคลาวด์อย่างเป็นทางการภายในแอป Samsung Game Launcher บนโทรศัพท์ Galaxy โดยกล่าวในการประชุมนักพัฒนาเมื่อวันที่ 5 ตุลาคมที่ผ่านมา</p>\n<p>บริการใหม่นี้จะอยู่ในช่วงเบต้า และจะค่อย ๆ ขยายตัวอย่างช้า ๆ ในช่วง 2-3 เดือนต่อจากนี้ โดยมีเป้าหมายไปที่เกมที่อยู่บนมือถือ ซึ่งแตกต่างจากบริการเล่นเกมผ่านคลาวด์อื่น ๆ ที่ส่วนใหญ่จะเน้นไปที่เกมพีซี และคอนโซล แนวทางนี้ของ Samsung ออกแบบมาเพื่อหารายได้จากการติดตั้งเกม และโฆษณาในเกมที่เคยสูญเสียไปคืนมา เนื่องจากในช่วงไม่กี่ปีที่ผ่านมีข้อจำกัดในการกำหนดเป้าหมายโฆษณาต่าง ๆ</p>\n<p>หลัง ๆ มานี้ Samsung เริ่มประสบปัญหาจากรายได้ที่ลดลง เนื่องจากตลาดสมาร์ทโฟนกำลังชะลอตัว ทำให้ Samsung ต้องหาแหล่งรายได้ใหม่ ๆ เพิ่มขึ้นจากฮาร์ดแวร์ที่ตนขายอยู่ ดังนั้นโฆษณา และการสตรีมเกมแบบชำระเงินจึงเป็นหนึ่งในหนทางของการหารายได้ใหม่ ๆ ของ Samsung</p>\n<p>สำหรับ Samsung มีแอปสตรีมมิ่งเกมชื่อ Gaming Hub ในสมาร์ททีวีอยู่แล้ว และได้รวมบริการอื่น ๆ เช่น Amazon Luna และ Nvidia GeForce Now เข้ามาด้วย ส่วน Game Launcher มีในโทรศัพท์มือถือ และดูเหมือนว่าจะเพิ่มบริการเล่นเกมบนคลาวด์เข้าไปใน Game Launcher เร็ว ๆ นี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/88389976d7054afba94ab3ba10802a03.png\" /></p>\n<p>ที่มา - <a href=\"https://www.theverge.com/2023/10/2/23899924/samsung-game-launcher-cloud-service-rumor-leak\">The Verge</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/samsung\">Samsung</a></div><div><a href=\"/topics/samsung-apps\">Samsung Apps</a></div><div><a href=\"/topics/cloud-gaming\">Cloud Gaming</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"529e34c9c3a38e99749968298385188fa408f98f2545fb43e33ac25ed923c062","category":"Thai"}