{"title":"Physicists may have cracked the case of “Zen” stones balanced on ice pedestals","link":"https://arstechnica.com/?p=1799030","date":1632882313000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/zen1CROP-800x532.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/zen1CROP.jpg\">Enlarge</a> <span>/</span> A laboratory reproduction of the Zen stone phenomenon in a lyophilizer.  (credit: Nicolas Taberlet / Nicolas Plihon)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Visit the Small Sea of Lake Baikal in Russia during the winter and you'll likely see an unusual phenomenon: a flat rock balanced on a thin pedestal of ice, akin to stacking Zen stones common to Japanese gardens. The phenomenon is sometimes called a Baikal Zen formation. The typical explanation for how these formations occur is that the rock catches light (and heat) from the Sun and this melts the ice underneath until just a thin pedestal remains to support it. The water under the rock refreezes at night, and it has been suggested that wind may also be a factor.</p>\n<p>Now, two French physicists believe they have solved the mystery of how these structures form, according to a new paper published in the Proceedings of the National Academy of Sciences—and their solution has nothing to do with the thermal conduction of the stone. Rather, they attribute the formation to a phenomenon known as sublimation, whereby snow or ice evaporates directly into vapor without passing through a water phase. Specifically, the shade provided by the stone hinders the sublimation rates of the surrounding ice in its vicinity, while the ice farther away sublimates at a faster rate.</p>\n<p>Many similar formations occur naturally in nature, such as <a href=\"https://en.wikipedia.org/wiki/Hoodoo_(geology)\">hoodoos</a> (tall, spindly structures that form over millions of years within sedimentary rock), <a href=\"https://en.wikipedia.org/wiki/Mushroom_rock\">mushroom rocks</a> or rock pedestals (the base has been eroded by strong dusty winds), and glacier tables (a large stone sitting precariously on top of a narrow pedestal of ice). But the underlying mechanisms by which they form can be very different. </p></div><p><a href=\"https://arstechnica.com/?p=1799030#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799030&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"529feb87db9dc59ca1bd68b8dd028b647780db178d4c5a3ce7e4913e03223a33","category":"Tech"}