{"title":"Genomic Profiling and Expression Analysis of BPC Gene Family in Brassica oleracea in Comparison with Arabidopsis","link":"https://www.preprints.org/manuscript/202404.1502/v1","date":1713850144000,"content":"Originating in the Mediterranean, B. oleracea is grown all over the world and is highly valued for its nutritional value and variety in cooking. Its susceptibility to pests, diseases, and environmental stressors, however, poses significant challenges to sustaining consistent crop quality and productivity. The BASIC PENTACYSTEINE gene significantly impacts plant growth and responses to abiotic stresses. Nevertheless, little is known about its precise role and the underlying biological processes in B. oleracea. Eleven BPC genes in B. oleracea were identified by a thorough genome-wide investigation and categorized into three categories according to their structural traits and gene motifs. There were eight different chromosomes on which these BoBPCs were located. Comparative synteny analysis was used to reveal the evolutionary traits of potatoes, Arabidopsis, and B. oleracea. The BoBPC family genes in B. oleracea were found to have specific cis-elements linked to growth, stress responses, and hormone regulation when their promoter regions were studied. Cuticular wax synthesis expression revealed that all BoBZR1 genes, from wild to mutant, expressed at varied amounts in distinct types. Moreover, distinctive BoBPC gene expression patterns were found in the seven distinct tissues that were studied. Our thorough analysis shows that the BoBPC family is widely involved in B. oleracea developmental processes. The present findings provide an established theoretical basis for further exploration into the composition and roles of BoBPC in B. oleracea.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"52a6a7db192deb007f95dca4e4e67429f7ba5dc06a32d5c06393caa9f91d2d38","category":"Interdisciplinary"}