{"title":"Analyzing fishery data and exploring the resource status of Antarctic krill based on its environmental dependence","link":"https://onlinelibrary.wiley.com/doi/10.1111/fog.12674?af=R","date":1722832214000,"content":"<h2>Abstract</h2>\n<p>Antarctic krill <i>Euphausia superba</i> is a key species in the Southern Ocean ecosystem and has important ecological value. It is also one of the main fishery resources in the Southern Ocean with high economic value. In recent years, with the development of krill fishery and rapid climate change, the conservation and management of krill resources have faced unprecedented challenges. The krill resource is different from the general fishery resources. Due to the krill schooling characteristics, fishery data has some advantages over scientific survey data. Reviewing and analyzing the krill fishery data is necessary. Therefore, in this study, four fishery resource indices (FRIs) were calculated based on Antarctic krill fishery data, and based on the environmental dependence of Antarctic krill, the FRI with the strongest environmental dependence was screened by using the Gradient Forest Model, and the step changes of the FRI with strongest environmental dependence was examined by using the sequential t-test analyses of regime shifts (STARS). The generalized additive model (GAM) to analyze the correlation between the FRI with the strongest environmental dependence and the main environmental factors, and then explore the resource status of Antarctic krill in the study area. The model results showed that the “FRI_hual” had the strongest environmental dependence and was a better indicator of the status of the Antarctic krill in the study area than the others. In the 2009–2010 year, “FRI_hual” had an obvious regime shift. The interaction of environmental factors “ice_area_2” and “SSH_1” has a great impact on “FRI_hual”. Methods used and results obtained in the study can provide new ideas and a scientific reference for future work, including integrated stock assessment of krill and krill resource monitoring, conservation, and management based on the ecosystem.</p>","author":"Rui Wang, \nShigang Liu, \nRan Zhang, \nHai Li, \nPuqing Song, \nYuan Li, \nLongshan Lin","siteTitle":"Wiley: Fisheries Oceanography: Table of Contents","siteHash":"ddf10675d11d4e916ea2c59904318f6a27094a133dc6841be0937d77cc7558c9","entryHash":"52a6147d46a50c084215284a96948a31362cbbf127f2380ad276f273766e9890","category":"Environment"}