{"title":"Polyelectrolyte - Surfactant Mixture Effects on Bulk Properties and Antibacterial, Cytotoxic Activity of Sulfur Nanoparticles","link":"https://www.preprints.org/manuscript/202406.0896/v1","date":1718257510000,"content":"Elemental sulfur, commonly known for its wide range of biological activity, has a long history of being used to protect all garden and vegetable crops from a range of pests and diseases, including powdery mildew, ascochyta blight, clubroot, plant mites, oidium, anthracnose, and scab. In the present study, a quick and environmentally friendly approach has been developed for the synthesis of sulfur nanoparticles with antibacterial activity. Sulfur nanoparticles (SNPs) were prepared by modifying the surface of elemental sulfur using various polyelectrolyte-surfactant mixtures (PSM) including NaCMC-SDBS and PHMG-CTAB. The SNPs were characterized by UV–visible spectrophotometry, X-ray diffraction (XRD), and thermogravimetric analysis (TG/DSC), scanning electron microscopy (SEM), with the SNPs showing an almost spherical shape with an average size in the range of 150-200 nm. The antibacterial activity of the sulfur nanoparticles was tested using against gram-positive S. aureus and E. faecium and gram-negative E. coli and P. aeruginosa bacteria. From this, it could be seen that SNPs exhibited significant antimicrobial activity against gram-positive bacteria, i.e., S. aureus and E. faecium. The in vitro cytotoxicity of the SNPs-1 and SNPs-2 studied to normal (MeT-5A) and tumorous (MCF-7) human cell lines was assessed in the concentration range from 500 μg/ml to 0.12 mg/ml, from which it was determined as being non-cytotoxic. The received products can be considered for potential application in agriculture and medicine.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"52ad3bb50930eb449cdd8f579c27eb5fdaafae14ab150cd5de9b991c7a664fca","category":"Interdisciplinary"}