{"title":"PSLBI-1 Stepwise approach applied to metabolites related to residual feed intake in Angus cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/630/7757796?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Feed efficiency (FE) selection is crucial for improving the economic and environmental sustainability of beef cattle production. Residual feed intake (RFI) is the most commonly used parameter for FE because it is independent of metabolic body weight (MBW) and average daily gain (ADG). Low-RFI (LRFI) animals are more efficient, as they present less feed intake than expected, decreasing dry matter intake (DMI) and methane production per unit of body weight gain (BW). However, considering the time and resources required for RFI measurement, omics methods have been applied to distinguish between LRFI and high-RFI (HRFI) animals. This study performed a stepwise approach as an alternative for selecting important plasma metabolites related to RFI in beef cattle. Black Angus bulls (n = 64) with an initial BW of 321.8 ± 59.98 kg and 12.9 ± 1.08 mo from rearing under continuous grazing were allocated to feedlot pens and fed a diet containing 80:20 roughage:concentrate. The animals were evaluated for DMI and BW using an integrated real-time data collection system (Intergado, Brazil) for 56 d, and ADG was estimated as the slope of the linear regression between BW and days on feed. Blood samples were collected at the end of the finishing phase by puncturing the coccygeal vessels. Through targeted metabolomics, concentrations of plasma amino acids, biogenic amines, and hexoses were determined using an AB Sciex 5500 QTRAP mass spectrometer in liquid chromatography-mass-spectrometry and flow-injection analysis mode. The fixed effect of MBW, ADG, age and batch, and the random effect of sire were considered in the mixed model to determine RFI and to categorize the 20 greatest and 20 least values as HRFI and LRFI, respectively, using the lmer4 R package. A stepwise approach in both directions was used in the MASS R package. The model with the lowest AIC (31.15) presented 23 of the 31 metabolites, followed by ANOVA (Table 1). Serotonin, glutamate, phenylalanine, and tyrosine concentrations were greater in HRFI, whereas aspartate, citrulline, tryptophan, ornithine, taurine, creatinine, and trans-4-hydroxyproline concentrations were greater in LRFI (<span>P</span> &lt; 0.05). The gluconeogenic potential of glutamate, phenylalanine, and tyrosine suggests that an impact on energy availability may affect DMI. Conversely, differences in creatinine and trans-4-hydroxyproline abundance can reflect changes in muscular body mass, while the greater concentrations of aspartate, citrulline, and ornithine in LRFI animals suggest that a lower DMI can be associated with lower urea cycle activity. The stepwise approach appears to be a feasible alternative as a pre-selection method to identify plasma metabolites that could be used to categorize beef cattle for RFI. Further validation is required to confirm the potential of these metabolites as biomarkers for FE selection.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"52b6c59381604481cd4ec886b28896d785b3bec7d4268c8259b1ce211b67b554","category":"Environment"}