{"title":"ChargePoint starts rolling out Tesla-style NACS plugs for its customers","link":"https://arstechnica.com/?p=1977152","date":1697719789000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/ChargePoint_DC-Fast_NACS_Model-3_143-high-800x533.jpg\" alt=\"A blue Tesla charges at a ChargePoint fast charger\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/ChargePoint_DC-Fast_NACS_Model-3_143-high-scaled.jpg\">Enlarge</a> <span>/</span> Tesla-style plugs are coming to ChargePoint chargers. (credit: ChargePoint)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Tesla drivers will soon have a new place to fast-charge their electric vehicles. Today, the charging network ChargePoint announced it will have <a href=\"https://arstechnica.com/cars/2022/07/the-ars-technica-guide-to-electric-vehicle-charging/\">Tesla-style North American Charging Standard support</a> for both its AC and DC chargers over the next few weeks. And in November, it will start shipping NACS cable upgrade kits for existing DC fast chargers, which will allow Tesla EVs to charge at those ChargePoint DC fast chargers.</p>\n<p>\"We've already said we're already taking preorders on the home charger, and then over the next few weeks, we'll start shipping the fast-charge cables to preorder customers that have our fast chargers, and you can already order a new fast charger with NACS cables on,\" said Pasquale Romano, ChargePoint's CEO.</p>\n<p>\"We think the most important difference is we do not make our customers decide by parking space whether the cable is NACS or CCS. I think that's a mess and no one should do that. No one should have a dedicated parking space because you'll never get the ratio right, and it will change over time. So every solution that we have is going to enable both connector types per parking space,\" he told Ars.</p></div><p><a href=\"https://arstechnica.com/?p=1977152#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1977152&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"52b99b777ee7d60114aefdbb55646e77bdc8162b520becea101d372cf7d9c03f","category":"Tech"}