{"title":"New – Amazon EBS Snapshot Lock","link":"https://aws.amazon.com/blogs/aws/new-amazon-ebs-snapshot-lock/","date":1700089142000,"content":"<p>You can now lock individual <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (Amazon EBS)</a> snapshots in order to enforce better compliance with your data retention policies. Locked snapshots cannot be deleted until the lock is expired or released, giving you the power to keep critical backups safe from accidental or malicious deletion, including ransomware attacks.</p> \n<p><span><strong>The Need for Locking</strong></span><br /> AWS customers use EBS snapshots for backups, disaster recovery, data migration, and compliance. Customers in financial services and health care often need to meet specific compliance requirements, with prescribed time frames for retention, and also need to ensure that the snapshots are truly Write Once Read Many (WORM). In order to meet these requirements, customers have implemented solutions that use multiple AWS accounts with one-way “air gaps” between them.</p> \n<p><span><strong>EBS Snapshot Lock</strong></span><br /> The new EBS Snapshot Lock feature helps you to meet your retention and compliance requirements without the need for custom solutions. You can lock new and existing EBS snapshots using a lock duration that can range from one day to about 100 years. The snapshot is locked for the specified duration and cannot be deleted.</p> \n<p>There are two lock modes:</p> \n<p><strong>Governance</strong> – This mode protects snapshots from deletions by all users. However, with the proper IAM permissions, the lock duration can be extended or shortened, the lock can be deleted, and the mode can be changed from Governance mode to Compliance mode.</p> \n<p><strong>Compliance</strong> – This mode protects snapshots from actions by the root user and all IAM users. After a cooling-off period of up to 72 hours, neither the snapshot nor the lock can be deleted until the lock duration expires, and the mode cannot be changed. With the proper IAM permissions the lock duration can be extended, but it cannot be shortened.</p> \n<p>Snapshots in either mode can still be shared or copied. They can be archived to the low-cost Amazon EBS Snapshots Archive tier, and locks can be applied to snapshots that have already been archived.</p> \n<p><span><strong>Using Snapshot Lock</strong></span><br /> From the EBS Console I select a snapshot (Snap-Monthly-2023-09) and choose <strong>Manage snapshot lock</strong> from <strong>Snapshot Settings</strong> in the <strong>Actions</strong> menu:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/28/ebssl_pick_1.png\" width=\"900\" height=\"278\" /></p> \n<p>This is a monthly snapshot and I want to lock it for one year. I choose <strong>Governance </strong>mode and select the duration, then click <strong>Save lock settings</strong>:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/28/ebssl_govmode_1.png\" width=\"700\" height=\"745\" /></p> \n<p>I try to delete it, and the deletion fails, as it should:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/28/ebssl_no_delete_1.png\" width=\"700\" height=\"239\" /></p> \n<p>Now I would like to lock one of my annual snapshots for 5 years, using <strong>Compliance</strong> mode this time:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/28/ebssl_compmode_2.png\" width=\"700\" height=\"1083\" /></p> \n<p>I set my cooling-off period to 24 hours, just in case I change my mind. Perhaps I have to run some kind of audit or final date validation on the snapshot before committing to keeping it around for five years.</p> \n<p>Programmatically, I can use new API functions to establish and control locks on my EBS snapshots:</p> \n<p><code>LockSnapshot</code> – Lock a snapshot in governance or compliance mode, or modify the settings of a snapshot that is already locked.</p> \n<p><code>UnlockSnapshot</code> – Unlock a snapshot that is is governance mode, or is in compliance mode but within the cooling-off period.</p> \n<p><code>DescribeLockedSnapshots</code> – Get information about the lock status of my snapshots, with optional filtering based on the state of the lock.</p> \n<p>IAM users must have the appropriate permissions (<strong>ec2:lockSnapshot</strong>, <strong>ec2:UnlockSnapshot</strong>, and <strong>ec2:DescribeLockedSnapshots</strong>) in order to use these functions.</p> \n<p><span><strong>Things to Know<br /> </strong></span>Here are a couple of things to keep in mind about this new feature:</p> \n<p><strong>AWS Backup</strong> – <a href=\"https://aws.amazon.com/backup/\">AWS Backup</a> independently manages retention for the snapshots that it creates. We do not recommend locking them.</p> \n<p><strong>Pricing</strong> – There is no extra charge for the use of this feature. You pay the usual rates for storage of snapshots and archived snapshots.</p> \n<p><strong>Regions</strong> – EBS Snapshot Locking is available in all commercial AWS Regions.</p> \n<p><strong>KMS Key Retention</strong> – If you are using customer-managed <a href=\"https://aws.amazon.com/kms/\">AWS Key Management Service (AWS KMS)</a> keys to encrypt your EBS volumes and snapshots, you need to make sure that the key will remain valid for the lifetime of the snapshot.</p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"52b997ed2e4738cf41db3e2530cd829e7f8cee2e658f6d0993aa08227decdf5c","category":"Tech"}