{"title":"Native macOS Amazon Prime Video app arrives with picture-in-picture, AirPlay","link":"https://www.macworld.com/article/551860/amazon-prime-video-app-macos-features.html","date":1637000200000,"content":"<div>\n<section><div></div></section><p>Amazon on Monday announced that Prime subscribers now have a native Mac app to watch TV shows, movies, and other Prime Video content. Previously, viewers had to access the service using a web browser to watch content on the Mac. The Amazon Prime Video app is available now for <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/amazon-prime-video/id545519333&amp;xcust=1-1-551860-1-0-0&amp;sref=https://www.macworld.com/feed\">free in the Mac App Store</a>.</p>\n\n\n\n<p>The Prime Video Mac app has a couple of advantages over a browser. The key feature is Picture-in-Picture mode that will present a persistent, resizable video window on top of the Mac interface, regardless of what app you are using. The app also has AirPlay support so you can play content on any AirPlay-compatible device.</p>\n\n\n\n<p>Other key features include show downloads for offline watching, the ability to stop watching on one device and pick up from that point on another device, in-app transactions, and access to Amazon’s exclusive content and live sports. </p>\n\n\n\n<p>The new Mac app is like the Prime Video app that is <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/amazon-prime-video/id545519333&amp;xcust=1-1-551860-1-0-0&amp;sref=https://www.macworld.com/feed\">already available for iOS</a>. Though the Mac Prime Video is Mac native, it is likely based on the iOS version using Apple’s Catalyst project, which was introduced with Catalina.</p>\n\n\n\n<p>When you sign in to the Prime Video app for the first time, you’ll need to enter your Amazon Prime username and password, and then verify your account. The app requires macOS Big Sur or later. A Prime Video subscription is <a href=\"https://www.amazon.com/amazonprime?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">part of Amazon Prime</a>, which is $13 per month or $119 annually. A subscription to Prime Video only (without the Amazon Prime shopping service) is available for $9 per month.</p>\n\n\n\n<p>The new Amazon Prime Video app comes at a time when Apple is under scrutiny for anti-competitive practices. Apple, which offers its own <a href=\"https://www.macworld.com/article/340717/apple-tv-plus-upcoming-shows-future-moves-series-release-dates-film-television.html\">TV+ service</a> for $4.99 a month, is currently in court in a <a href=\"https://www.macworld.com/article/530868/apple-bans-fortnite-indefinitely-as-epic-ceo-lashes-out-on-twitter.html\">case</a> with Epic Games over App Store rules and Apple not allowing third-party purchasing options. Last Friday, a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://lawstreetmedia.com/news/tech/apple-faces-antitrust-suit-for-monopolization-ios-app-distribution/&amp;xcust=1-1-551860-1-0-0&amp;sref=https://www.macworld.com/feed\">case</a> was filed in California that claims that “Apple has engaged in an anticompetitive scheme to monopolize the aftermarket for iOS applications.” Apple also was in <a href=\"https://www.macworld.co.uk/news/app-store-under-pressure-3808289/\">court in South Korea and Japan</a>, and the company has faced several lawsuits in Europe. Apple has made several changes to App Store in-app purchases in the past year as a result of these cases.</p>\n\n\n\n<p>In July 2020, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2020-07-29/apple-considered-taking-40-cut-from-subscriptions-emails-show&amp;xcust=1-1-551860-1-0-0&amp;sref=https://www.macworld.com/feed\">Bloomberg</a> reported that Apple made a special fee exception for Amazon in order to get Prime Video on the iPhone and Apple TV.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"52bef431f7b16d6ecd521b51f52ec287c64a644c0f4fcf56847cb059c1e5ed94","category":"Apple"}