{"title":"Molecular Genetic Divergence Among Several Sunflower Genotypes Using RAPD Technology","link":"http://link.springer.com/10.1007/978-3-031-57054-4_23","date":1735689600000,"content":"<h3>Abstract</h3>\n                    <p>The experiment was conducted in 2023 at the Agricultural Research Department laboratory to identify molecular variations among 10 sunflower genotypes (Original Akmar, Original Haisin, Original Ishaqi, Original Sakha, Original Flami, Selected Aqmar, Selected Haisin, Selected Isqai, Selected Sakha, and Selected Flami). The genotypes were selected using a honeycomb design. To estimate genetic divergence and determine the genetic relationship between genotypes, random amplified polymorphism DNA amplification was used, which is based on PCR technology. Ten primers were used, but the sequences of two primers were not detected. Seventy-four bands were obtained, with an average of 9.25 bands per primer and molecular weights ranging from 200 to 1200 bp. The average number of total bands and polymorphic bands was 9.25 and 7.75, respectively. Primer OPA13 yielded the highest percentage of polymorphic bands at 91.6%, while primer L20 produced the lowest percentage at 57.1%. Primer OPA14 exhibited the highest efficiency at 16.2% and the greatest discriminatory ability at 17.7%. According to the molecular index data and genetic similarity analyzed using the UBGMA method, the genotypes were divided into two main groups in the dendrogram. The first group included G4 (Sakhi original) and G10 (Flami selected), while the second included the remaining genotypes. The second group was also subdivided into several divisions based on the genetic degree of the genotypes. The lowest genetic similarity (highest genetic distance) was found between the original Akmar and selected Flami genotypes, reaching 0.246, while the highest genetic similarity (lowest genetic distance) was 0.986 between the original Akmar and original Hayseen cultivars.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"52c045818757ca5d959ddf26ecafa18f9e3031d4c4414a62c3aed77c26bb6c2f","category":"Environment"}