{"title":"Prevalence and prognostic role of hypochloremia in patients with acute heart failure in Ethiopia: A single-center retrospective analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310251","date":1726149600000,"content":"<p>by Gashaw Solela</p>\r\nBackground <p>In patients with heart failure (HF), multiple electrolyte disorders are common, and recent studies have shown that chloride disorders play a significant role in the prognosis of HF. Data about the prevalence and prognostic role of hypochloremia in patients with acute HF (AHF) are scarce in African nations, including Ethiopia. Hence, this study aimed to assess the prevalence, associated factors, and prognostic role of hypochloremia in patients with AHF in Ethiopia.</p> Methods <p>This was a single-center retrospective analysis of AHF patients, aged ≥15 years, with chloride determination upon admission to the medical wards and medical ICU of Yekatit 12 Hospital Medical College, Addis Ababa, Ethiopia, from July 1, 2022, to July 1, 2023. Statistical Package for Social Sciences, version 26, was used to enter and analyze the data. Descriptive analysis was used to summarize clinical profiles, laboratory data, and outcomes of AHF patients stratified by the presence and absence of hypochloremia. Logistic regression analysis was used to determine the factors associated with hypochloremia and to assess the association of hypochloremia and other factors with in-hospital mortality in patients with AHF. A two-tailed <i>P</i> value &lt;0.05 was regarded as statistically significant.</p> Results <p>A total of 267 AHF patients who had chloride determination on admission were included in this study; the mean age was 56.7 years (standard deviation: 18.6), and the gender-based distribution of the patients was nearly equal. The prevalence of hypochloremia was 36.7%. Diastolic blood pressure &lt;60 mm Hg [adjusted odds ratio (AOR) = 3.63, 95% confidence interval (CI), 1.04, 12.72] and hyponatremia (AOR = 29.20, 95% CI, 13.21, 64.56) were significantly associated with hypochloremia. The in-hospital mortality rate was higher in AHF patients with hypochloremia (16.3%) compared to those without hypochloremia (4.7%). The odds of in-hospital mortality among AHF patients with hypochloremia were 2.8 times higher compared to patients without hypochloremia (AOR = 2.82, 95% CI: 1.08, 7.04) after adjusting for ICU admission, systolic blood pressure &lt; 120 mm Hg and diastolic blood pressure &lt; 60 mm Hg.</p> Conclusions <p>This study revealed a high prevalence of hypochloremia among patients with AHF. Low diastolic blood pressure and hyponatremia were significantly associated with the development of hypochloremia. Most importantly, AHF patients with hypochloremia had a higher in-hospital mortality rate compared to those without hypochloremia. Hence, hypochloremia on admission should be considered a potential prognostic factor in patients with AHF, and further research with a larger sample size is needed to support the findings of this study.</p>","author":"Gashaw Solela","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"52c14176e6cbbf218d629f7f5b0a07e22e1950a0fe6f19aa9cfec17b13fc7fa6","category":"Interdisciplinary"}