{"title":"Ecological interactions between farmed Atlantic salmon and wild Atlantic cod populations in Norway: A review of risk sources and knowledge gaps","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12899?af=R","date":1709020800000,"content":"<h2>Abstract</h2>\n<p>Aquaculture provides an important and expanding source of protein rich and healthy food to the world. However, to minimize environmental harm from aquaculture, interactions with wild fish communities need to be thoroughly assessed. Here, we characterize the existing knowledge pertaining to such interactions, exemplified with Atlantic salmon (<i>Salmo salar</i>) farming in open net pens along the Norwegian coast and potential consequences for wild Atlantic cod (<i>Gadus morhua</i>) populations. Importantly, the wild cod fishery also provides a protein rich, high quality food source with high economic value. We identify seven risk sources that may affect behaviour, physiology, and survival in wild cod. Of particular importance is the large amount of waste feed that causes wild fish to aggregate around farms, thereby altering a multitude of ecological interactions including predation and disease transmission. Moreover, altered food quality in pellets may alter physiological processes and cause mortality to vulnerable life-stages in wild cod. More research is needed on mechanisms and thresholds for harm. As the most important cod fisheries are found in northern Norway, where climate change also is rapid, we expect stronger and potentially more harmful interactions between fish farming and wild cod fisheries as aquaculture continues to expand. We hope that our analysis will inspire further research, on farmed salmon and wild cod interactions, but also on aquaculture and wild fish interactions in general. Such research is fundamental for the development of management systems that can reduce the impact of aquaculture on fisheries and the environment.</p>","author":"Thomas Bøhn, \nJohn F. Strøm, \nPablo Sanchez‐Jerez, \nNigel B. Keeley, \nTorild Johansen, \nKarl Ø. Gjelland, \nNina Sandlund, \nBjørn‐S. Sæther, \nIngeborg Sætra, \nEsben M. Olsen, \nJon E. Skjæraasen, \nSonnich Meier, \nTerje van der Meeren, \nPål A. Bjørn","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"52d6db9a796cde741dabf9e1554a929c9280c5fa283108f10c75ab836fc72e43","category":"Environment"}