{"title":"A pipeline for identification of causal mutations in barley identifies Xantha-j as the chlorophyll synthase gene","link":"https://academic.oup.com/plphys/article/195/4/2877/7649211?rss=1","date":1713312000000,"content":"<span><div>Abstract</div>Thousands of barley (<span>Hordeum vulgare</span> L.) mutants have been isolated over the last century, and many are stored in gene banks across various countries. In the present work, we developed a pipeline to efficiently identify causal mutations in barley. The pipeline is also efficient for mutations located in centromeric regions. Through bulked segregant analyses using whole genome sequencing of pooled F<sub>2</sub> seedlings, we mapped 2 mutations and identified a limited number of candidate genes. We applied the pipeline on F<sub>2</sub> mapping populations made from <span>xan-j.59</span> (unknown mutation) and <span>xan-l.82</span> (previously known). The Xantha-j (<span>xan-j</span>) gene was identified as encoding chlorophyll synthase, which catalyzes the last step in the chlorophyll biosynthetic pathway: the addition of a phytol moiety to the propionate side chain of chlorophyllide. Key amino acid residues in the active site, including the binding sites of the isoprenoid and chlorophyllide substrates, were analyzed in an AlphaFold2-generated structural model of the barley chlorophyll synthase. Three allelic mutants, <span>xan-j.19</span>, <span>xan-j.59</span>, and <span>xan-j.64</span>, were characterized. While <span>xan-j.19</span> is a 1 base pair deletion and <span>xan-j.59</span> is a nonsense mutation, <span>xan-j.64</span> causes an S212F substitution in chlorophyll synthase. Our analyses of <span>xan-j.64</span> and treatment of growing barley with clomazone, an inhibitor of chloroplastic isoprenoid biosynthesis, suggest that binding of the isoprenoid substrate is a prerequisite for the stable maintenance of chlorophyll synthase in the plastid. We further suggest that chlorophyll synthase is a sensor for coordinating chlorophyll and isoprenoid biosynthesis.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"52df72c9d3dd9c6dcd610ccf484edd7dce0abcb020e0f6a4a238ca264a7bb920","category":"Environment"}