{"title":"As Florida punishes schools, study finds masks cut school COVID outbreaks 3.5X","link":"https://arstechnica.com/?p=1798388","date":1632520257000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1333814568-800x490.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1333814568.jpeg\">Enlarge</a> <span>/</span> A second-grade teacher talks to her class during the first day of school at Tustin Ranch Elementary School in Tustin, CA on Wednesday, August 11, 2021. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/second-grade-teacher-wendy-verrall-u2019s-talks-to-her-news-photo/1333814568?adppopup=true\">Getty | Paul Bersebach</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Schools with universal masking were 3.5 times less likely to have a COVID-19 outbreak and saw rates of child COVID-19 cases 50 percent lower in their counties compared with schools without mask requirements. That's according to two new studies published Friday by the Centers for Disease Control and Prevention.</p>\n<p>The new data lands as masks continue to be a political and social flash point in the US. And children—many of whom are still ineligible for vaccination—have headed back into classrooms.</p>\n<p>In <a href=\"https://www.cdc.gov/mmwr/volumes/70/wr/mm7039e1.htm?s_cid=mm7039e1_w\">one of the newly published studies</a>, health researchers in Arizona looked at schools with and without mask policies in Maricopa and Pima Counties. Together, the counties account for more than 75 percent of the state's population. The researchers identified 210 schools that had universal masking requirements from the start of their school years. They compared those to 480 schools that had no mask requirements throughout the study period, which ran from July 15 to August 30.</p></div><p><a href=\"https://arstechnica.com/?p=1798388#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1798388&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"52e05a466bbc26c3f748f7fe600afeca401deb33a93abce4c847a25d424f948f","category":"Tech"}