{"title":"PSV-18 Relationships between serum insulin-like growth factor 1 and cortisol in growing steers to beef production and palatability","link":"https://academic.oup.com/jas/article/102/Supplement_3/511/7757790?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Beef cattle breed and temperament are known to impact beef production; however, the physiological pathways linking stress and growth to palatability are not well understood. To test the hypothesis that live animal circulatory cortisol and insulin-like growth factor 1 (IGF1) would be related to temperament, production efficiency, and palatability, Brahman and Angus steers were classified as calm (n = 13 Angus; n = 12 Brahman), intermediate (n = 11 Angus; n = 10 Brahman), or temperamental (n = 12 Angus; n = 12 Brahman) based on their pen score and exit velocity at weaning. Serum samples collected at 10, 13, and 18 mo of age were evaluated for cortisol and IGF1 concentrations. Steers were maintained on grass pasture until they were moved to a feedlot after the 13-mo collection and provided a growing ration. Following the 18-mo collection, steers were sent to a commercial abattoir. Data were analyzed using linear models in SASv9.4 with breed, age, temperament, and all interactions as fixed effects and age as a repeated effect with animal(breed) as the subject. Relationships between variables were assessed with Pearson correlation coefficients. Calm Angus had greater IGF1 than temperamental Angus (<span>P</span> = 0.02) while intermediate Brahman had greater IGF1 than calm or temperamental Brahman (<span>P</span> ≤ 0.02). Temperamental Brahman had greater cortisol concentrations than calm and intermediate Brahman and temperamental Angus (<span>P</span> ≤ 0.01). In Angus, IGF1 concentrations decreased from 10 to 13 mo and from 13 to 18 mo (<span>P</span> ≤ 0.0006). In contrast, Brahman IGF1 concentrations increased with age to be greater at 13 and 18 mo than 10 mo (<span>P</span> ≤ 0.0001). Angus also had greater serum IGF1 than Brahman at 10 mo, but Brahman had greater IGF1 than Angus at 13 and 18 mo (<span>P</span> ≤ 0.0007). In 10 mo Brahman, IGF1 was positively correlated with animal body weight (BW) and average daily gain (<span>P</span> ≤ 0.005). IGF1 in 10 and 13 mo Brahman was also positively correlated with marbling (P ≤ 0.03). IGF1 in 13 mo Angus was positively correlated with Warner-Bratzler shear force (<span>P</span> = 0.02). Cortisol concentrations in Angus were greater at 10 and 13 mo than at 18 mo (<span>P</span> ≤ 0.004) leading to 10 mo Angus having greater cortisol concentrations than Brahman of the same age (<span>P</span> = 0.05). In Angus, at 10, 13, and 18 mo, cortisol was positively correlated with animal BW and hot carcass weight (P ≤ 0.05). At 10 and 13 mo, cortisol was positively correlated with ribeye area in Angus (<span>P</span> ≤ 0.005). These data suggest that serum IGF1 in Brahman is related to growth and lipid metabolism, and tenderness in Angus. However, cortisol concentrations have a more prevalent relationship with Angus growth and subsequently beef production. This project was supported by USDA NIFA Award #2021-67015-33392.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"52e369b6ae6d5d507051bd28e4ef44c98187ca32018291cf8ff2c90ca191c7a2","category":"Environment"}