{"title":"Vaccine Validation","link":"https://lewcpe.com/blog/archives/2257/vaccine-validation/","date":1622549922000,"content":"<p>พอดีเห็นมีข่าวเรื่องวัคซีนในไทยเยอะ บันทึกความคิดไว้หน่อย</p>\n\n\n\n<ul><li>กระบวนการยากที่สุดก่อนใช้งาน คือเฟส 3 ใช้คนเยอะ แถมควบคุมเวลาไม่ได้</li><li>ในกรณี Pfizer ใช้คน 43,538 คน หลังจากฉีดครบสองเข็มแล้ว 7 วันจึงเริ่มนับประสิทธิภาพ ดังนั้นหากเราจะวิจัยวัคซีนอีกตัว เราต้องหาอาสาสมัครให้ครบโดยเร็ว รวมถึงผลิตวัคซีนเอาไว้สำหรับคนกลุ่มนี้ (เป็นยาหลอกครึ่งหนึ่งก็ต้องผลิตสี่หมื่นกว่าโดสมารอ)</li><li>ให้อุดมดติเลยคือฉีดได้ในวันเดียวหมด ก็ต้องรอเริ่มเก็บผลอีกประมาณเดือนกว่าๆ ของจริงกว่าจะฉีดครบน่าจะใช้เวลานับเดือน</li><li>ถึงเวลาจุดทรมานคือรอกลุ่มผู้ร่วมทดลองทั้งหมดติดเชื้อ ซึ่งไม่สามารถควบคุมได้ว่าจะติดเมื่อไหร่ แต่ในกลุ่มผู้ร่วมทดลองทั้งหมดจะมีเกณฑ์ว่าเริ่มวิเคราะห์ผลได้เมื่อใด ในกรณีของ Pfizer ระบุว่าจะเปิดมาวิเคราะห์ครั้งแรกเมื่อคนติดเกิน 94 คน เป็นผลเบื้องต้น และอีกครั้งคือ 164 คนเป็นผลเฟสสามเป็นทางการ (Pfizer แถลงผล<a href=\"https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-confirm-high-efficacy-and-no-serious\">รอบสามป่วย 927 คน++</a> เมื่อเดือนเมษายน) กรณีของ Pfizer ผู้ร่วมวิจัยน่าจะอยู่ในกลุ่มที่ติดเชื้อหนักมาก ทำให้เคสเพิ่ม 70 เคสภายในสิบกว่าวันเท่านั้น</li><li>ตอนนี้ในไทยติด COVID กันวันละ 2-4000 คน ถ้าคิดต่อประชากรก็อาจะบอกได้ว่าแต่ละวันติดกัน 1 ใน 20000 ถ้ามีกลุ่มตัวอย่าง 40,000 คน แล้ววัคซีนไร้ประสิทธิภาพเป็น 0% เลยก็ต้องรอให้ครบ 100 คน โดยใช้เวลาถึง 50 วัน ถ้าวัคซีนประสิทธิภาพดีเยี่ยม 100% จะยิ่งช้ากลายเป็น 100 วัน สำหรับผลเบื้องต้น ถ้ารอผมเต็มก็จะนานกว่านั้น</li><li>น่าจะเป็นเหตุผลให้วัคซีนบางตัวเลือกวิจัยกับกลุ่มเสี่ยงสูงๆ เช่น กลุ่มเจ้าหนัาที่สาธารณสุข ผลจะได้ครบเร็วขึ้น (มีความเสี่ยงอีกอย่างคือการเลือกกลุ่มตัวอย่างที่ติดเชื้อหนัก / attack rate สูง จะทำให้ประสิทธิภาพของวัคซีนที่วัดได้ลดลง)</li><li>ประเด็นการรอคนติดครบเคยเป็นประเด็นในยุโรป เพราะ<a href=\"https://www.youtube.com/watch?v=ccbqTCazG3Y\">เสนอกันว่าหากทำ challenge trail (ฉีดเชื้อให้ติดเลย) ก็จะเร็วขึ้นมหาศาล</a> แต่สุ่มเสี่ยงผิดจรรยาบรรณ สุดท้ายไม่มีใครกล้าทำ</li></ul>\n\n\n\n<p></p>","author":"lewcpe","siteTitle":"LewCPE's Blog","siteHash":"be60e5c67c985916e913225e0fa8794018c33c335df997dc89cd85d60cc43d78","entryHash":"52ebea02cce7afbe5d9ffb66de2d7fca228392819f23770818be55135363db51","category":"Thai"}