{"title":"Merida Reacto vs. Giant TCR | Aero, discs and integration or classic design?","link":"https://www.bikeradar.com/features/giant-tcr-advanced-2-vs-merida-reacto-4000/","date":1625684417000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/DSC02708_1-bca3f62.jpg?quality=45&amp;resize=620,413\" />                                            <p>The £1,999 / $2,200 Giant TCR Advanced 2 and £2,250 Merida Reacto 4000 are two excellent mid-range race bikes that represent opposite ends of the road bike spectrum.</p>\n<p>One is super modern with aero-everything, integration and discs, while the other is more traditional and has good old rim brakes.</p>\n<p>Which one would I choose? It’s a very close thing.</p>\n<p>I tested the Reacto and the TCR back-to-back and used it as an opportunity to delve into why you might embrace all that modern bike tech has brought us, or alternatively opt for something a little more traditional (but still utterly modern in its own way).</p>\n<p>The Merida isn’t available in the US, incidentally, but this isn’t just about the specific models on test here. You could do similar with bikes from any number of brands and, even sticking with these ones, you could flip things around and pit the aero Giant Propel against the more classic Merida Scultura.</p>\n<p>There are good reasons to choose either of these bikes and for the full story I recommend you watch the video, but if you’re pressed for time, read on for the highlights. We’ll also be publishing full reviews of both bikes in the near future.</p>\n\n<h2>Giant TCR Advanced 2 vs. Merida Reacto 4000 framesets</h2>\n<p>It’s slightly ironic that the Giant is representing the more traditional side of things, given that the original TCR practically defined the modern road bike, introducing us to compact frames with very sloping top tubes.</p>\n<p>While the TCR Advanced 2 is nominally the third-tier option in the range, its frame is identical to the second-tier Advanced Pro model, weighing a claimed 830g unpainted (although you can’t buy an unpainted frame), a penalty of just 85g plus the weight of a seatpost over the seatmast-equipped flagship TCR Advanced SL.</p>\n<p>Giant cited some aero gains when it launched this generation TCR but it’s not an explicitly aero-focused bike.</p>\n<p>It’s also refreshingly simple compared to some of the latest bikes – everything is pretty standard and the cables aren’t fully integrated, so component swapping is very straightforward. (Note that there’s a small error in the video regarding the steerer size – this model actually has a standard 1 1/8in upper steerer, so standard stems will fit.)</p>\n<p>By contrast, the Merida Reacto 4000 ticks just about every box for modern bike design.</p>\n<p>Its frame is all about the aero, with truncated aerofoil tube sections, dropped seatstays and a super-skinny down tube.</p>\n<p>It’s made from Merida’s second-tier CF3 carbon and the claimed frame weight is 1,165g for a painted small. It’s worth noting here that paint can be quite heavy, so the difference from the TCR is likely to be less significant than it appears on paper.</p>\n<p>Integration is all the rage for aero bikes and the Reacto is no exception here, with its cables almost entirely concealed from view.</p>\n<p>The bike uses the same FSA SMR system as the <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/bianchi-arcadex-review/\">Bianchi Arcadex</a> I tested previously, where the cables are routed under a cover on the underside of the stem.</p>\n<p>This makes for a very clean look, but it’s a much more practical system than the proprietary cockpits common on more expensive aero bikes.</p>\n<p>The bar and stem are standard size components and can be changed easily enough.</p>\n<h2>Giant TCR Advanced 2 vs. Merida Reacto 4000 builds</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> These bikes will SHOCK YOU with their excellence, or something.</span></figcaption><span> <i>Max Wilman / Immediate Media</i></span></div>\n<p>Both these bikes have the latest <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-105-r7000-r7020-groupset-review/\">Shimano 105 groupset</a>, with the obvious difference being that the TCR has rim brakes, while the Reacto is designed for <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">hydraulic disc brakes</a>.</p>\n<p>They also both get 52/36 cranks but the TCR has a very slightly easier bottom gear thanks to an 11-30 cassette, compared to the Reacto’s 11-28.</p>\n<p>Own-brand aluminium <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">wheelsets</a> are the order of the day here and neither bike’s is terribly exciting, but they’re both tubeless-ready and entirely sufficient.</p>\n<p>Giant gives you <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-tubeless-road-tyres/\">tubeless tyres</a> as standard which is a nice bonus, although the own-brand tyres are average rather than amazing.</p>\n<p>Merida opts for Continental’s fairly budget Ultra Sport III tyres, which are okay but of course not suitable for tubeless. Both are nominally 25s, although the Giant’s size-up a little bigger in reality.</p>\n<p>There’s nothing to fault on the finishing kit front, and the Reacto has a couple of nice bonuses in the form of a multi-tool attached to the saddle and a neat little rear light nestled in the back of the seatpost.</p>\n<p>Both the bikes I tested were size mediums and the Merida weighed 8.7kg, compared to the Giant’s 7.9kg.</p>\n<h2>Giant TCR Advanced 2 vs. Merida Reacto 4000 geometry</h2>\n<p>That weight difference is slightly exaggerated by Merida’s odd sizing. Most brands would call the bike I rode a large – its <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-geometry-explained/\">geometry</a> numbers would be typical of a 56cm – and it was noticeably bigger than the medium Giant.</p>\n<p>Both bikes have steep, racy angles and shortish (sub-one metre) wheelbases. The medium TCR has 545mm of stack and 388mm of reach, compared to 557mm and 395mm for the Reacto.</p>\n<p>It would make more sense to compare the small Reacto, however, which has 542mm of stack and 390mm of reach – practically the same as the Giant.</p>\n<h2>Riding the Giant TCR Advanced 2 and Merida Reacto 4000</h2>\n<p>No roadie is going to be disappointed by either of these bikes. Both are excellent in their own ways, and the choice between them comes down to what you’re looking for in a bike.</p>\n<p>The TCR is a pure, unadulterated experience that will delight fans of classic climber’s bikes like the first and second generation Scott Addicts, the Ridley Helium SL, and other lightweight designs.</p>\n<p>You get a sense of how refined the TCR platform is. It has a beautifully balanced ride quality that’s lively and exciting. Thanks to those <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless tyres</a>, there’s the option to add extra comfort by running lower pressures.</p>\n<p>The Reacto’s ride is outstanding too, and it does a convincing impression of a much more expensive superbike. With an upgrade to a set of carbon race wheels, it would be a seriously competitive bike.</p>\n<p>It’s fast and fun, and not excessively firm riding, although the TCR is definitely plusher.</p>\n<h2>Giant TCR Advanced 2 vs. Merida Reacto 4000 overall</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Both of these bikes are excellent – the choice depends on what you’re looking for.</span></figcaption><span> <i>Max Wilman / Immediate Media</i></span></div>\n<p>The Giant’s rim brakes might seem anachronistic, but the complete package is so refined and it offers a purity and simplicity rarely seen these days. The Merida, meanwhile, has the look and feel of a much more expensive bike, some budget wheels aside.</p>\n<p>Which better suits your needs is largely a matter of taste. All-weather heroes will be better served by the Merida’s discs and I’d hazard a guess it’s faster in the real world thanks to its aero frameset.</p>\n<p>On the other hand, for pure riding pleasure on days when the sun is shining, the TCR remains as compelling a choice as ever.</p>\n<p>You can’t feel aero gains but you can feel weight, so for non-racers the TCR may be more appealing. The weight difference really isn’t big in real-world terms, though.</p>\n<p>I’d really struggle to choose between these bikes, personally. My heart says TCR because I love a simple, uncomplicated bike, but the Merida is so good it would be a very very close thing.</p>\n<p>Would you go classic and simple or opt for the more cutting-edge, bells and whistles aero bike with the added complexity that entails? Let us know your thoughts in the comments.</p>\n<h2>Giant TCR Advanced 2 specs</h2>\n<ul><li><strong>Size tested:</strong> M</li>\n<li><strong>Sizes available:</strong> XS, S, M, ML, L, XL</li>\n<li><strong>Weight:</strong> 7.9kg</li>\n<li><strong>Frame:</strong> Advanced-Grade Composite</li>\n<li><strong>Chainset:</strong> Shimano 105 52/36</li>\n<li><strong>Bottom bracket:</strong> Shimano press-fit</li>\n<li><strong>Cassette:</strong> Shimano 105 11-30</li>\n<li><strong>Chain:</strong> KMC X11EL-1</li>\n<li><strong>Derailleurs:</strong> Shimano 105</li>\n<li><strong>Levers:</strong> Shimano 105 hydraulic</li>\n<li><strong>Wheels:</strong> Giant PR-2</li>\n<li><strong>Tyres:</strong> Giant Gavia AC 1 Tubeless 25mm</li>\n<li><strong>Stem:</strong> Giant Contact 100mm</li>\n<li><strong>Handlebar:</strong> Giant Contact 420mm</li>\n<li><strong>Headset:</strong> Giant OverDrive</li>\n<li><strong>Saddle:</strong> Giant Approach</li>\n<li><strong>Seatpost:</strong> Giant Variant composite</li>\n<li><strong>Brakes:</strong> Shimano 105 rim brake</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Merida Reacto 4000 specs</h2>\n<ul><li><strong>Size tested:</strong> M</li>\n<li><strong>Sizes available:</strong> XXS, XS, S, M, L, XL</li>\n<li><strong>Weight:</strong> 8.7kg</li>\n<li><strong>Frame:</strong> Reacto CF3 carbon</li>\n<li><strong>Chainset:</strong> Shimano 105 52/36</li>\n<li><strong>Bottom bracket:</strong> Shimano BB86 press-fit</li>\n<li><strong>Cassette:</strong> Shimano 105 11-30</li>\n<li><strong>Chain:</strong> KMC X11</li>\n<li><strong>Derailleurs:</strong> Shimano 105</li>\n<li><strong>Levers:</strong> Shimano 105</li>\n<li><strong>Wheels:</strong> Merida Expert CW</li>\n<li><strong>Tyres:</strong> Continental Ultra Sport III 25mm</li>\n<li><strong>Stem:</strong> FSA SMR ACR 110mm</li>\n<li><strong>Handlebar:</strong> Merida Expert CW 420mm</li>\n<li><strong>Headset:</strong> FSA ACR</li>\n<li><strong>Saddle:</strong> Merida Expert CC</li>\n<li><strong>Seatpost:</strong> Merida Team CW</li>\n<li><strong>Brakes:</strong> Shimano 105 hydraulic disc</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"52f937d41684d8ed97f2f492ce44dda5490f81f61e94a2a8c30dde0ded21dd2c","category":"Cycling"}