{"title":"Effect of carbonization temperatures on the synthesis of biocarbon from Borassus flabellifer fruit fiber for capacitive energy storage","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400005?af=R","date":1712650108000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1bb97059-7347-46b9-8c0f-b0e171a34fc1/appl202400005-gra-0001-m.png\" alt=\"Effect of carbonization temperatures on the synthesis of biocarbon from Borassus flabellifer fruit fiber for capacitive energy storage\" /><p>Extraction of <i>Borassus flabellifer</i> fruit fiber and their conversion in to biocarbon. Carbonization temperature influences the biocarbon's physicochemical properties. Biocarbon synthesized at 800°C showed highest specific surface area of 46.36 m<sup>2</sup> g<sup>−1</sup>. It also showed the superior specific capacitance of 45.76 F g<sup>−1</sup> at 1 A g<sup>−1</sup>\n</p>\n<br />\n<h2>Abstract</h2>\n<p><i>Borassus flabellifer</i> (Palmyra) fruit fiber (PFF) was extracted and converted into biocarbon materials at different carbonization temperatures of 400°C, 600°C, and 800°C under N<sub>2</sub> atmosphere for 1 h. The physicochemical properties of obtained biocarbon materials were investigated via CHNS, SEM-EDX, FTIR, RAMAN, XRD, BET-specific surface area, and TGA techniques. The obtained results were correlated with the capacitive energy storage application of biocarbon materials. The highest specific surface area of 46.36 m<sup>2</sup> g<sup>−1</sup> was observed for the biocarbon materials obtained at 800°C, which also showed superior capacitive performances. The specific capacitances of PFF-derived biocarbon materials obtained at 400°C, 600°C, and 800°C are respectively found to be 28.58, 37.07, and 45.76 F g<sup>−1</sup> at 1 A g<sup>−1</sup> employing 1M KOH as electrolyte. The biocarbon materials obtained at 800°C showed the highest specific energy and power of 1.99 and 261 W kg<sup>−1</sup> at 1 A g<sup>−1</sup>.</p>","author":"Natarajan Sumangala Devi, \nSingaravelu Vivekanandhan","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"530b1601dd5c3a2bd734998a53795fadb01792d5df816ad3594010b120ebf550","category":"Environment"}