{"title":"Assessing the effectiveness of marine nature‐based solutions with climate risk assessments","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17296?af=R","date":1715065200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/4e7ffb6a-1057-4b51-a0b3-488f1070575d/gcb17296-toc-0001-m.png\" alt=\"Assessing the effectiveness of marine nature-based solutions with climate risk assessments\" />\n<p>Despite the increasing demand for nature-based solutions (NBS) to mitigate climate change impacts, we still lack a comparable way to estimate their effectiveness. Here we present a methodology for the estimation of the effectiveness of marine NBS based on the difference of risk estimated when they are applied and when they are not. The effectiveness is estimated from the perspective of each unit of analysis considered (species, or ecosystem services, for example), and it is also dependent on the socioecological context, which allows us to understand the benefits and potential losses of the effectiveness of these management measures.</p>\n<br />\n<h2>Abstract</h2>\n<p>Prospective risks from climate change impacts in ocean and coastal systems are urging the implementation of nature-based solutions (NBS). These are climate-resilient strategies to maintain biodiversity and the delivery of ecosystem services, contributing to the adaptation of social-ecological systems and the mitigation of climate-related impacts. However, the effectiveness of measures like marine restoration or conservation is not exempt from the impacts of climate change, and the degree to which they can sustain biodiversity and ecosystem services remains unknown. Such uncertainty, together with the slow pace of implementation, causes decision-makers and societies to demand a better understanding of NBS effects. To address this gap, in this study, we use the risk mitigation capacity of marine NBS as a proxy for their effectiveness while providing a toolset for the implementation of the method. The method considers environmental data and relies on expert elicitation, allowing us to go beyond current practice to evaluate the effectiveness of NBS in reducing habitat or species risks under different future socio-political and climate-change scenarios. As a result, we present a ready-to-use tool, and supporting materials, for the implementation of the Climate Risk Assessment method and an illustrative example considering the application of the NBS “nature-inclusive harvesting” in two shellfisheries. The method works as a rapid assessment that guarantees comparability across sites and species due to its low data or resource demand, so it can be widely incorporated to adaptation policies across the marine realm.</p>","author":"Juan Bueno‐Pardo, \nAna Ruiz‐Frau, \nClement Garcia, \nElena Ojea","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"530c7922656e1a84fed1627d77b559a3ca86c5667f61eeacb41b165eb6a1519d","category":"Environment"}