{"title":"Volumetric versus Element-scaling Mass Estimation and Its Application to Permo-Triassic Tetrapods","link":"https://academic.oup.com/iob/article/doi/10.1093/iob/obae034/7756867?rss=1","date":1726185600000,"content":"<span><div>Synopsis</div>Size has an impact on various aspects of an animal's biology, including physiology, biomechanics, and ecology. Accurately and precisely estimating size, in particular body mass, is therefore a core objective of paleobiologists. Two approaches for estimating body mass are common: whole-body volumetric models and individual element-scaling (e.g., bones, teeth). The latter has been argued to be more accurate, while the former more precise. Here, we use minimum convex hulls (MCHs) to generate a predictive volumetric model for estimating body mass across a broad taxonomic and size range (127 g – 2735 kg). We compare our MCH model to stylopodial-scaling, incorporating data from the literature, and find that MCH body mass estimation is both more accurate and more precise than stylopodial estimation. An explanation for the difference between methods is that reptile and mammal stylopod circumference and length dimensions scale differentially (slope 1.179 ± 0.102 vs. 1.038 ± 0.031, respectively), such that reptiles have more robust bones for a given size. Consequently, a mammalian-weighted stylopodial-scaling sample overestimates the body mass of larger reptiles, and this error increases with size. We apply both estimation equations to a sample of 12 Permo-Triassic tetrapods and find that stylopodial-scaling consistently estimates a higher body mass than MCH estimation, due to even more robust bones in extinct species (slope = 1.319 ± 0.213). Finally, we take advantage of our MCH models to explore constraints regarding the position of the center of mass (CoM) and find that relative body proportions (i.e., skull:tail ratio) influence CoM position differently in mammals, crocodylians, and Permo-Triassic tetrapods. Further, we find that clade-specific body segment expansion factors do not affect group comparisons but may be important for individual specimens with rather disproportionate bodies (e.g., the small-headed and large-tailed <span>Edaphosaurus</span>). Our findings suggest that the whole-body volumetric approach is better suited for estimating body mass than element-scaling when anatomies are beyond the scope of the sample used to generate the scaling equations and provides added benefits such as the ability to measure inertial properties.</span>","author":"","siteTitle":"Integrative Organismal Biology Current Issue","siteHash":"ad96bcf7a80ab7e3a1a88c34298d761f9695964c0badbbef4e1166baa6580fcc","entryHash":"5312b8aca713598b6dc91643bd594f84909773be06eafb8e6a42b36391294bc9","category":"Environment"}