{"title":"‘I am happy with everything I achieved’: Annemiek van Vleuten profile","link":"https://www.cyclist.co.uk/in-depth/annemiek-van-vleuten-interview-2024","date":1706279221000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/annemiek-van-vleuten-interview-2024\">‘I am happy with everything I achieved’: Annemiek van Vleuten profile</a></p>\n\n<p>Annemiek van Vleuten might write a book about her career one day, but perhaps the events would be better captured in a comic strip or a Netflix drama. The Dutch rider was, after all, the mistress of explosive all-action heroics. Her first Road Race World Championships title, in Harrogate in 2019, was the result of <a href=\"https://www.cyclist.co.uk/news/world-championships-van-vleuten-takes-elite-womens-title-with-incredible-105km-solo-attack\" target=\"_blank\">an outrageous, era-defining 105km solo breakaway</a>, which she later dubbed ‘crazy’. </p>\n\n\n\n<p>In 2021 she buried the ghosts of her horror crash at Rio 2016 (‘I thought she was dead,’ recalled her teammate Anna van der Breggen) to claim gold in the Tokyo Olympics time-trial, somehow finishing nearly a full minute clear of her rivals on a short 22.1km course.</p>\n\n\n\n<p>In 2022 she <a href=\"https://www.cyclist.co.uk/news/tour-de-france-femmes-2022-stage-8-gallery-van-vleuten\" target=\"_blank\">won the inaugural eight-day Tour de France Femmes</a>, despite spending a day vomiting through illness, with her victory powered by <a href=\"https://www.cyclist.co.uk/news/tour-de-france-femmes-2022-stage-7-gallery-van-vleuten\" target=\"_blank\">a daring 60km lone attack in the Vosges mountains</a>. Months later she endured the ‘hell’ of riding 164.3km with a broken elbow, before unleashing a shock late surge to win the Road Race World Championships in Wollongong, Australia.</p>\n\n\n\n<p>‘Cycling has given me a nice podium to inspire people, to entertain people,’ reflects Van Vleuten, who retired in the autumn of 2023 aged 41, having won pretty much everything there is to win. ‘I still have the memories, but they will not be refreshed with new experiences. That will maybe be hard to deal with.’</p>\n\n\n\n<p>Having established a reputation for doing things that normal people can’t do, the newly retired cyclist is now turning her mind to doing things that normal people <em>can</em> do.</p>\n\n\n\n<p>‘I want to learn how to ski,’ she says. ‘I could never ski, and it was sometimes in my contract that I was not allowed to do it. There are other sports I’d like to try. I might go more often to concerts. And I am going on holiday with my mother. I can see that there are some really big treasures that I can enjoy now, because maybe cycling was limiting my options in life more than I was realising.’</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/womens-pro-cycling-highlights-2023\">My top 10 moments in the 2023 women’s road cycling season</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/2024-women-pro-cycling-preview\">5 key storylines for the 2024 women’s pro cycling season</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/tour-de-france-femmes-2022-stage-8-gallery-van-vleuten\">Gallery: Annemiek van Vleuten wins Stage 8 and first ever Tour de France Femmes maillot jaune</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/dutch-courage-annemiek-van-vleuten-profile\">Dutch courage: Annemiek van Vleuten profile</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-02-647x970.jpg\" alt=\"Annemiek van Vleuten\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-02-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-02-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-02-768x1152.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-02-1024x1536.jpg 1024w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-02-1365x2048.jpg 1365w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-02-750x1125.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-02-1140x1710.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-02.jpg 1536w\" /><figcaption>Van Vleuten pioneered innovative training methods and redefined what was possible for a professional athlete – she didn’t turn pro until she was 28, and peaked as she was about to turn 40.</figcaption><figcaption>Negin Zendegani / Lumen Photo</figcaption></figure></div>\n\n\n<p>From ski trips to music gigs, these humble new goals are a reminder of the many sacrifices that elite riders make in their tunnel-visioned pursuit of glory. No wonder they find retirement so bewildering.</p>\n\n\n\n<p>‘When I stopped, I thought: how will it be without a goal?’ she admits. ‘I was a bit insecure about how it would be. But more and more I feel happy, and I am enjoying that I don’t have that goal on my back. I have more time to enjoy life and take opportunities.’</p>\n\n\n\n<p>Throughout her career at elite teams such as Rabobank, Mitchelton-Scott and Movistar, Van Vleuten lived by the motto ‘accept, adapt and move on’. The premise was to move perpetually forwards past any new challenges, and to see only new possibilities, not problems. It is a philosophy that works for retirees too.</p>\n\n\n\n<p>‘I accept that I don’t want to think, “Oh, I am not a top athlete anymore,” so I look at new opportunities – without the stress of all the time having to stay fit.’</p>\n\n\n\n<h2>Going out on a high</h2>\n\n\n\n<p>Having only retired recently, Van Vleuten is still too close to her racing career to be able to reflect on it with any clarity.</p>\n\n\n\n<p>‘Sometimes when I see pictures or videos, it helps me to think back, but it will sink in more next year,’ says the Dutch rider. ‘I’m thinking about writing a book; not an autobiography but another type. That will maybe help me to look back on my career and reflect.’</p>\n\n\n\n<p>Few athletes get to go out at the top of their game. Some suffer from injuries or poor form, others see contract offers dry up. But in 2022 Van Vleuten enjoyed her <em>annus mirabilis</em>, winning the Worlds road race title, the Tour de France Femmes, the Giro Donne, the Challenge by La Vuelta and Liège-Bastogne-Liège. Then in 2023 she won the Giro Donne and the new seven-day La Vuelta Femenina.</p>\n\n\n<div>\n<figure><img width=\"970\" height=\"686\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-03-970x686.jpg\" alt=\"Annemiek van Vleuten\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-03-970x686.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-03-300x212.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-03-768x543.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-03-120x86.jpg 120w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-03-750x530.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-03-1140x806.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-03.jpg 1536w\" /><figcaption>The Dutch rider conquered the world but doesn’t yet have enough distance from her career to forget the pain of defeat, for example on the 2023 Tour. ‘Something was bothering me,’ she says of her performance.</figcaption><figcaption>Negin Zendegani / Lumen Photo</figcaption></figure></div>\n\n\n<p>‘Yeah, it is really nice to finish on a high,’ she admits. ‘I had my best season in 2022, for sure. And in 2023 I was still winning and still there. I have especially good memories of the Giro d’Italia in 2023, when I had a really top level and it is one of my favourite races. I had to fight harder than in 2022 maybe, but there have been good developments in cycling and the level is rising. So hopefully we’ll see that more. It will be better entertainment for me in front of my television.’</p>\n\n\n\n<p>It says a lot about Van Vleuten’s ruthless ambition that she is still annoyed at finishing fourth at the 2023 Tour, therefore missing out on a final Tour-Vuelta-Giro treble.</p>\n\n\n\n<p>‘I under-performed and that is why it was so painful,’ she says. ‘I am fine to lose a race with the level I have, but I didn’t have the normal level. Something was bothering me.’</p>\n\n\n<div>\n<figure><a href=\"https://store.cyclist.co.uk/subscriptions\" target=\"_blank\"><img width=\"970\" height=\"343\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-970x343.jpg\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-970x343.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-300x106.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-768x271.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-1536x543.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-2048x724.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-750x265.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/11/clickable-subs-promo5-1140x403.jpg 1140w\" /></a><figcaption></figcaption></figure></div>\n\n\n<h2>I get knocked down…</h2>\n\n\n\n<p>That frustration at underperforming is a side-effect of Van Vleuten’s ferocious desire to better herself throughout her career. Having turned professional relatively late, perhaps she felt she had some catching up to do. She had previously gone to university to study animal science, then worked in an office job before quitting in 2010, aged 28, to join Nederland Bloeit (later Rabobank). </p>\n\n\n\n<p>Her breakthrough win came at the 2011 Tour of Flanders. But by the end of her career her resume included two Worlds road race titles (2019, 2022), two Worlds time-trial titles (2017, 2018) and an Olympic time-trial gold and road race silver (2021), as well as multiple wins at the Giro Donne (2018, 2019, 2022 and 2023), Tour de France Femmes (2022), La Vuelta Femenina (2021, 2022, 2023), Women’s WorldTour (2018, 2021, 2022), Liège-Bastogne-Liège (2017, 2018) and Strade Bianche (2018, 2020), and a second triumph at the Tour of Flanders (2021).</p>\n\n\n\n<p>‘I don’t think I am going to miss the races, because the racing itself is super-stressful,’ she reflects. ‘To be in front at the right time you also need to fight to be there again and again and again. And that means you take risks. So I had some negative experiences and that puts scars in your head. And that part I will not miss. But I was really driven to get the best out of myself – and that I will miss. Usually in November I make a plan for the next season. And that is not there now. But I am fine because I am happy with everything I achieved.’</p>\n\n\n\n<p>She has so many golden memories that she now struggles to pick a favourite: ‘Sometimes you tend to go for the more recent ones, like the Olympics and the World Championships in Wollongong, where I won with a broken elbow. That was really inspiring for myself to think impossibilities are possible. But I think also after the Rio Olympics to get the gold Tokyo medal was nice. But maybe also the 105km solo in Yorkshire… I cannot choose!’</p>\n\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-04-647x970.jpg\" alt=\"Annemiek van Vleuten\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-04-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-04-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-04-768x1152.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-04-1024x1536.jpg 1024w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-04-1365x2048.jpg 1365w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-04-750x1125.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-04-1140x1710.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/annemiek-van-vleuten-148-04.jpg 1536w\" /><figcaption>Van Vleuten will not turn her back on cycling altogether, possibly working with young athletes. ‘I know for sure I will not be a directeur sportif, so I will reflect on what kind of role is best’.</figcaption><figcaption>Negin Zendegani / Lumen Photo</figcaption></figure></div>\n\n\n<p>That traumatic Olympic race in Rio in 2016, which left Van Vleuten hospitalised with three cracked vertebrae and concussion, proved to be a pivotal moment. In her early career she was told that she was not a natural climber, but Van Vleuten was leading the hilly Rio course before her crash, and that gave her the confidence that she could do more.</p>\n\n\n\n<p>‘After Rio I proved – most importantly to myself – that I can climb,’ she says. The experience led directly to that late-career wave of victories at the Giro Donne, Tour de France Femmes and La Vuelta Femenina.</p>\n\n\n\n<p>Her Rio crash is a stark reminder that successful athletes suffer many tragedies, injuries, doubts and setbacks along the way. Van Vleuten lost her father to cancer in 2008 and often wore the earrings he gave her on her 18th birthday for good luck. She had to endure multiple surgeries between 2009 and 2013 to deal with severe hip pain. And a crash at the 2018 Worlds road race left her with a broken knee (although somehow, she still finished seventh).</p>\n\n\n\n<p>‘I think almost every year I had something to deal with,’ she admits. ‘And it made me grow as a person. Of course, it was not nice. I would have loved to have less disappointment. At some points it was challenging to find the energy to fight the injury or to come back. I could at some points feel that I was a little bit on the edge: can I put myself, once again, back together? Can I keep on fighting? But my trainer always said, “I know you so well that in 48 hours you will have a plan ready to go again.” And it’s so true.’</p>\n\n\n\n<h2>Trailblazer</h2>\n\n\n<div>\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/10/02230230/annemiek_van_vleuten_by_jeff_pachoud_via_getty-970x647.jpg\" alt=\"cyclist in yellow with her hands in the air\" /><figcaption>Jeff Pachoud via Getty Images</figcaption></figure></div>\n\n\n<p>Van Vleuten has left an astonishing legacy in women’s cycling. She will be remembered as a box-office entertainer at races, but she added her own flair to training too, often joining up with men’s teams or going on altitude camps.</p>\n\n\n\n<p>‘I was not scared to get out of the comfort zone,’ she says. ‘Training with the guys but also to go for training camps in Colombia, and Kenya last year. I was really convinced that out of the comfort zone is where the magic happens. Because it keeps me energised, it gives me new experiences. And I like a challenge, but that is also why I am fine that I stopped because I could feel that the challenge was over. I couldn’t find details anymore to improve.’</p>\n\n\n\n<p>Many female pros have also spoken about how Van Vleuten raised the level of women’s racing with her high standards and ruthless racing.</p>\n\n\n\n<p>‘I cannot say that about myself,’ she demurs. ‘But I did hear it and I’m like, come on, we did it all together! But maybe the part to push yourself, to show that women can train longer, and at altitude, I think I inspired some coaches or athletes with that.’</p>\n\n\n\n<p>Van Vleuten knows what impact she has had on women’s cycling history; her triumphs are now etched in the record books, her four rainbow jerseys hang in her window and her trophies are piled up at her mum’s house. But for the first time in years she doesn’t know what the future looks like. Freedom, much like bike racing, can be terrifying and exciting in equal measure.</p>\n\n\n\n<p>‘I don’t have plans with the bike – and that is cool,’ she concludes. ‘The only plan is that I will ride if I feel like it, if the weather is good or if my friends go out. Maybe in the future I could be coaching. Working with young athletes attracts me. I know for sure I will not be a <em>directeur sportif</em>, so I will reflect on what kind of role is best. But I would like to stay in cycling. And it is super-exciting that, at this moment, I don’t know where I will end up.’</p>\n\n\n\n<h2>Win after win </h2>\n\n\n<div>\n<figure><img width=\"970\" height=\"620\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Van-Vleuten-retires-by-Bas-Czerwinski-via-Getty-Images-970x620.jpg\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Van-Vleuten-retires-by-Bas-Czerwinski-via-Getty-Images-970x620.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Van-Vleuten-retires-by-Bas-Czerwinski-via-Getty-Images-300x192.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Van-Vleuten-retires-by-Bas-Czerwinski-via-Getty-Images-768x491.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Van-Vleuten-retires-by-Bas-Czerwinski-via-Getty-Images-1536x982.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Van-Vleuten-retires-by-Bas-Czerwinski-via-Getty-Images-750x479.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Van-Vleuten-retires-by-Bas-Czerwinski-via-Getty-Images-1140x729.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Van-Vleuten-retires-by-Bas-Czerwinski-via-Getty-Images.jpg 1984w\" /><figcaption>Bas Czerwinski/Getty Images</figcaption></figure></div>\n\n\n<p><em>The racing career of Annemiek van Vleuten</em></p>\n\n\n\n<p><strong>2008:</strong> Van Vleuten begins racing part-time for pro team Vrienden van het Platteland</p>\n\n\n\n<p><strong>2010: </strong>Inspired by her progress, she quits her office job, aged 28, to pursue a career in pro cycling with Nederland Bloeit</p>\n\n\n\n<p><strong>2011:</strong> Bags her breakthrough win at the Tour of Flanders and goes on to claim the Women’s Road World Cup</p>\n\n\n\n<p><strong>2014:</strong> Wins the Belgium Tour and earns the first of four national time-trial titles</p>\n\n\n\n<p><strong>2016: </strong>Crashes out of the Rio Olympics road race while leading the field. She recovers to claim her second Belgium Tour a month later</p>\n\n\n\n<p><strong>2017:</strong> Wins <a href=\"https://www.cyclist.co.uk/news/world-championships-annemiek-van-vleuten-wins-womens-individual-time-trial\" target=\"_blank\">her first Worlds time-trial title</a> in Bergen, as well as <a href=\"https://www.cyclist.co.uk/news/annemiek-van-vleuten-wins-stage-2-and-the-overall-at-la-course-by-le-tour-de-france\" target=\"_blank\">La Course by Le Tour de France</a>, the Holland Ladies Tour and the Great Ocean Road Race</p>\n\n\n\n<p><strong>2018:</strong> Wins the Giro Rosa, her <a href=\"https://www.cyclist.co.uk/news/la-course-2018-van-vleuten-leaves-it-late-in-spectacular-finish\" target=\"_blank\">s</a><a href=\"https://www.cyclist.co.uk/news/annemiek-van-vleuten-wins-stage-2-and-the-overall-at-la-course-by-le-tour-de-france\" target=\"_blank\">econd La Course</a>, her <a href=\"https://www.cyclist.co.uk/news/world-championships-2018-van-vleuten-comfortable-winner-on-all-dutch-podium\" target=\"_blank\">second Worlds time-trial title</a>, her second Holland Ladies Tour and the Women’s WorldTour</p>\n\n\n\n<p><strong>2019:</strong> Earns her first Road Race World Championships title in Yorkshire, and triumphs at Liège-Bastogne-Liège, <a href=\"https://www.cyclist.co.uk/news/annemiek-van-vleuten-wins-the-2019-womens-strade-bianche-after-solo-attack\" target=\"_blank\">Strade Bianche</a> and the <a href=\"https://www.cyclist.co.uk/news/giro-rosa-2019-dominant-annemiek-van-vleuten-retains-title\" target=\"_blank\">Giro Rosa</a></p>\n\n\n\n<p><strong>2021:</strong> Wins the Tokyo Olympics time-trial, finishes second in the Olympic road race, claims her second Tour of Flanders and wins the Challenge by La Vuelta</p>\n\n\n\n<p><strong>2022:</strong> Storms to a second Worlds road race title, and wins the Tour de France Femmes, Giro Donne, Challenge by La Vuelta and Liège-Bastogne-Liège</p>\n\n\n\n<p><strong>2023:</strong> Wins her fourth Giro Donne and La Vuelta Femenina in her final year</p>\n\n\n\n<h2>Van Vleuten on…</h2>\n\n\n<div>\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/03/07095051/annemiek_van_vleuten_profile_1-970x647.jpg\" alt=\"annemiek_van_vleuten_profile_1\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/03/07095051/annemiek_van_vleuten_profile_1-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/03/07095051/annemiek_van_vleuten_profile_1-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/03/07095051/annemiek_van_vleuten_profile_1-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/03/07095051/annemiek_van_vleuten_profile_1-1536x1024.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/03/07095051/annemiek_van_vleuten_profile_1-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/03/07095051/annemiek_van_vleuten_profile_1-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/03/07095051/annemiek_van_vleuten_profile_1-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/03/07095051/annemiek_van_vleuten_profile_1-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/03/07095051/annemiek_van_vleuten_profile_1.jpg 2000w\" /><figcaption></figcaption></figure></div>\n\n\n<h3>…being a champion</h3>\n\n\n\n<p>‘I’m a really big fan of athletes that are champions on and off the bike. Marianne Vos has always been a good example. She made me aware that there is something bigger than winning a medal – and that is how you do it. I was always authentic. I never played a role. I wanted to ride to be myself, but also to be nice to people and to inspire people.’</p>\n\n\n\n<h3>…the women’s pro peloton</h3>\n\n\n\n<p>‘I would like to see more women from different nationalities coming up. For example, I see a lack of Spanish women at a high level. But I would like more women from outside Europe too. The minimum salary in the Women’s WorldTour will help. For example, in Colombia women are treated differently to men and maybe with financial support it makes it more possible to go overseas to race.’</p>\n\n\n\n<h3>…competition</h3>\n\n\n\n<p>‘It is important for our sport that the Dutchies have more competitors! And it is also important that more teams are competitive. Last year it was not a good development that SD Worx won so much, and even for the team it is not so nice. It’s more interesting if the quality is more spread out. The races have been interesting but it is important that we give more girls the opportunity to race.’</p>\n\n\n\n<h3>…her university party days </h3>\n\n\n\n<p>‘Oh yeah! But I am not all that keen to go back to my uni days. I am really happy that I had that period of fun. Now I have retired I have more freedom to go out when I want. Maybe not with alcohol but I can go to bed a bit late and enjoy life – and nightlife!’</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/annemiek-van-vleuten-interview-2024\">‘I am happy with everything I achieved’: Annemiek van Vleuten profile</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"531324955565df8e8574cb2d5a3028288942f1b0b6c0841cb29b2f456269de55","category":"Cycling"}