{"title":"Depredations and depravities reign in this week’s Wheel of Time","link":"https://arstechnica.com/?p=1970407","date":1695410758000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/WOFT_S2_UT_205_220316_THIJAN_01089_1_700.jpg\" alt=\"Still no safeword in Tel'aran'rhiod, Rand.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/WOFT_S2_UT_205_220316_THIJAN_01089_1_700.jpg\">Enlarge</a> <span>/</span> Still no safeword in Tel'aran'rhiod, Rand. (credit: Amazon Studios)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Andrew Cunningham and Lee Hutchinson have spent decades of their lives with Robert Jordan and Brandon Sanderson's <em>Wheel of Time</em> books, and they previously brought that knowledge to bear as they <a href=\"https://arstechnica.com/series/the-wheel-of-time-season-one/\">recapped each first season episode</a> of Amazon's new <em>WoT</em> TV series. Now they're doing it again for season two—along with insights, jokes, and the occasional wild theory. These recaps won't cover every element of every episode, but they will contain major spoilers for the show and the book series. We're going to do our best to not spoil major future events from the books, but there's always the danger that something might slip out. <strong>If you want to stay completely unspoiled and haven't read the books, these recaps aren't for you</strong>.</p>\n<p>New episodes of <a href=\"https://amzn.to/3Rd3BvU\"><em>The Wheel of Time</em> season two</a> will be posted for <a href=\"https://amzn.to/3Es0B7q\" target=\"_blank\">Amazon Prime</a> subscribers every Friday. This write-up covers episode six, which was released on September 22.</p>\n<div>\n<strong>Andrew</strong>: As usual for an episode of Wheel of Time, this one does a bunch of things and goes a bunch of places, but the episode's centerpiece will be very familiar to book readers: Egwene's capture by the Seanchan.\n<p>The Seanchan believe that channelers are too dangerous to be left to their own devices. They're captured and leashed and generally treated as beloved pets at best or monsters at worst. Egwene's capture and torment in the books is a cornerstone of her character, and this episode is tough to watch in places. It’s also one of the first times that the show's version of events is clearly more effective and impactful for me than the version in the books—the benefit of doing things in a visual medium.\n</p></div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/WOFT_S2_UT_205_220322_THIJAN_00704_1_700.jpg\"><img alt=\"High Lord Turak and the Seanchan, opening for GWAR this weekend at The Gasworks!\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/WOFT_S2_UT_205_220322_THIJAN_00704_1_700.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/WOFT_S2_UT_205_220322_THIJAN_00704_1_700.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/WOFT_S2_UT_205_220322_THIJAN_00704_1_700.jpg\">High Lord Turak and the Seanchan, opening for GWAR this weekend at The Gasworks!</a> </p></div>\n<div>\n<strong>Lee</strong>: Oh yeah, absolutely—this episode definitely ratchets things up a notch or five. No more Bel Tine presents for Egwene or dancing with Aram—it's straight-up torture time, courtesy of our friends from beyond the western sea. We will likely (eventually) learn at least the broad outlines of Seanchan culture, but the important bit is the one we're being shown right off the bat: to the Seanchan, channelers are sub-human. \"You are not a woman,\" Egwene is told. \"You are a damane.\"\n<p>Egwene spends the episode trapped in a cell—in \"the kennels,\" as they're called—learning about all the quirks and features of the Seanchan a'dam. It would be fascinating if it weren't so gruesome and awful. The a'dam's creator (an Aes Sedai, though we hear much more about her in the books) seems to have put considerable effort into thinking of all the potential ways a damane might fight back and then programmed around them. The a'dam can't be removed by the damane. The damane cannot touch the wristband control leash, even if it's not being held by anyone. The device even prevents the damane from touching other objects that the damane <em>perceives</em> to be weapons—which is just downright insidious, because it turns new damane into active participants in their own breaking. Egwene cannot even pick up a water pitcher to drink, because she can't stop thinking about smashing the sul'dam's head with it. She only gets to drink water after she has <em>convinced herself</em> that she won't attack the Seanchan.</p>\n<p>It's rough. It's really rough. In between the <s>put on the glasses</s> pour the water scenes, we get to see Egwene convulsing repeatedly as she fights with the a’dam—so much so that she ruptures blood vessels in both eyes. And this takes up about half the episode.</p>\n<p>As you point out, though, this is an absolute cornerstone of Egwene's character. It's the honing that will shape her into—well, into what she eventually becomes. (It's not a spoiler, I don't think, to say that the POV characters of an epic fantasy series all have Important Destinies<img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/2122.png\" alt=\"™\" /> laid on them, and Egwene wouldn't be able to inhabit the role—roles, even—she ends up having to inhabit without this shaping.)\n</p></div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_eg.jpg\"><img alt=\"Things are not going great for Egwene.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_eg.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_eg-1280x721.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_eg.jpg\">Things are not going great for Egwene.</a> (credit: Amazon Studios)</p></div>\n<div>\n<strong>Andrew</strong>: My \"this is true to the books\" brain appreciates these scenes a lot but there is a fine line to walk; <em>Game of Thrones</em> became infamous for <a href=\"https://www.esquire.com/entertainment/tv/a27099255/game-of-thrones-treatment-of-women-controversy-legacy/\">how frequently it brutalized its female characters</a>. This almost always took the form of sexual assault, perpetrated by men in positions of power against women who lacked it. <em>Wheel of Time</em> hasn't gone to that well, and if it stays in any way true to the events and themes of the books, it won't. But it's something I hope the show is conscious of.\n<p>Moving on to other characters, we get a good bit of Mat and Min for the first time in a couple of episodes. Show-Min has made a deal with the devil (one of them, anyway) to bring Mat back into Rand's orbit, because Min has had a vision that Mat will kill Rand, and Ishamael has a vested interest in Rand being dead. Mat and Rand meet and have a genuinely touching reunion here, and I'll say I also think the show is handling their relationship a bit better than the books here. Book-Mat, especially at this stage in the story before we had ever entered his perspective, is honestly just kind of a dick?</p>\n<p>Maybe it's because he picked up a dagger that makes him permanently suspicious of everyone around him, but his response to finding out what is going on with Rand is not to <em>help</em> him but to be a distant jerk. Of all the things not to like about the books, you almost never get a good sense of Rand and Mat and Perrin as <em>actual friends</em> rather than People Whose Fates Are Intertwined By Destiny. We're <em>told</em> that they're friends. Their actions usually imply some degree of loyalty to one another. But very rarely do you just get to see two dudes have a hug and a beer because they're genuinely happy to see one another.\n</p></div>\n<div>\n<strong>Lee</strong>: We do indeed have yet to hear any one of the Two Rivers Bros lament that the other Two Rivers Bros are so much better with the ladies, if nothing else. I do wish that the show had time to let that friendship breathe a little more, but alas. And where <em>is</em> that dagger, anyway? I know where it's supposed to be in the books at this point—I don't want to say, in case it spoils something for someone, but it's addressed early on in <em>The Great Hunt</em> and in fact is one of the things that is being hunted for by our main characters—but I can't recall if we've seen where it currently is in the show.\n<p>I want to spend a moment on Rand and Logain, too—if for nothing else than to call out the first on-screen image of someone playing \"stones,\" the in-universe name for what we'd recognize as <a href=\"https://en.wikipedia.org/wiki/Go_(game)\">Go</a>. Stones is a game played in Randland by intellectuals and generals, and it's a given that if you see a character playing stones, that character is supposed to be super smart and brilliant and possibly an authorial self-insert. (\"Take a shot every time someone is playing stones\" is almost as popular a casual WoT drinking game as \"Take a shot every time Nynaeve tugs her braid\" or—my personal favorite—\"Take a shot every time someone says something about the Dark One's taint.\")</p>\n<p>Logain is once again brought in to teach Rand—but really, to teach <em>us</em>—how channeling works for men. (I hope we still get you-know-who teaching Rand later, but Logain is definitely stepping into that other fellow's shoes here.) In a nice little compact scene, the false Dragon manages to teach the true Dragon three important facts about the One Power: women \"surrender\" to saidar, but men \"seize\" saidin; if you take too much in, you'll burn yourself out; and that Rand is <em>incredibly</em> powerful, capable of doing \"anything\" and fighting \"anyone.\"</p>\n<p>Upon releasing the source, Rand then learns a bonus #4 fact: the Dark One's corruption suffuses saidin. The book makes it sound like channeling the corrupted male half of the power is sort of like railing ultra-heroin while simultaneously chugging down raw sewage, and when Rand releases the source, he also releases his lunch. Ew.\n</p></div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_chan2.jpg\"><img alt=\"&quot;UNLIMITED POWER!!!!&quot;\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_chan2.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_chan2-1280x719.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_chan2.jpg\">\"UNLIMITED POWER!!!!\"</a> (credit: Amazon Studios)</p></div>\n<div>\n<strong>Andrew</strong>: Yeah, the show has visually referenced the Dark One's taint (on <em>saidin!</em> His taint on <em>saidin!</em>) before, back when Logain could still channel. Women get to weave sparkly strands of light and men have to channel this inky black stuff. But now Rand is getting a big dose of it for the first time and it doesn't go great for him. Rand's sanity and the degree to which he is still \"himself\" will become major concerns.\n<p>The show's treatment of what happens to channelers after they can no longer channel is still pretty inconsistent with the books; former channelers in the books are no more capable of seeing weaves or teaching a channeler than a non-channeler would be, but Logain is still fully aware of what Rand is doing and what he can do.</p>\n<p>On that topic, let's talk about something I am less enthusiastic about: we're at episode six, and I'm still not really sure where Moiraine <em>or</em> Lan's plotlines are going, and the decision to take Moiraine's channeling ability away and have her spend half the season sniping with her sister in their big stuffy house just feels like it was done so both Moiraine and Lan could mark time while things happened to the other characters. Maybe something stunningly explosive will come from it, and I <em>am</em> glad to see that Siuan Sanche is back in the action, but give me \"scenes of Rand bargaining with Lanfear in the dream world\" or \"scenes of Nynaeve and Elayne trying to save their friend while doing some true-to-the-book bickering\" over \"scenes of a woman trying to write a letter while her nephew gives her a sandwich.\"\n</p></div>\n<div>\n<strong>Lee</strong>: But Barthanes Damodred makes the <em>best</em> sandwiches. Moiraine said so and Aes Sedai cannot lie.\n<p>Yeah, I agree that parts of the season feel kind of interminable, in spite of how bloody short it is. I too could have done with maybe a bit less Moiraine-arguing-with-her-sister and also a bit less of whatever the hell it is Lan has been doing with Alanna and the Funky Bunch, but I've been pretty happy with the World of Dreams bits.</p>\n<p>Speaking of: I want to ask a question that my wife and I both feel pretty unified on, and I'll give you my answer after I hear yours, but: when Lanfear banished Ishamael from Rand's dreams, was she <em>really</em> banishing him? Because it seems much more Lanfear-like for that entire bit to have simply been Lanfear conjuring and then de-conjuring an imaginary Dream Ishy. It seems like the kind of thing she'd do.\n</p></div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_sand.jpg\"><img alt=\"Perfection.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_sand.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_sand-1280x720.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_sand.jpg\">Perfection.</a> (credit: Amazon Studios)</p></div>\n<div>\n<strong>Andrew</strong>: OK, so, hear me out—I think it's really Ishamael, and it's because of a super subtle but-obviously-meant-to-be-noticed thing about how he appears in the World of Dreams.\n<p>Look at scenes early in the episode where Ishamael is communicating with Min in her dreams. Occasionally he \"freezes,\" like you would on a Zoom call where Your Internet Connection Is Unstable. In the scene where he's tormenting Rand before Lanfear sends him away, he's doing the same thing. The visions Rand is getting from Ishamael occasionally freeze-and-jump in the same kind of way, something I thought was just a way to creep out the viewer until you made me start thinking about it.</p>\n<p>But Lanfear, someone known for her mastery of the World of Dreams, doesn't move like this. I think the show is trying to use this to communicate that Ishamael <em>can</em> operate in the world of dreams, but he's not particularly adept at controlling it, and he can easily be booted by someone more talented than he is.</p>\n<p>It <em>does</em> seem Lanfear-ish to try to earn Rand's trust this way, by constructing a scenario that makes her seem more trustworthy. But remember, book-Lanfear is the one who hooked Rand up with his book-channeling teacher. She's got her own motivations and delusions of grandeur, and the Forsaken often work at cross-purposes.\n</p></div>\n<div>\n<strong>Lee</strong>: Ahhh, that is an excellent catch—I'd noticed Ishy's freezing but hadn't made the link to it maybe being tied to his World of Dreams mastery level. And Ishamael &amp; Lanfear are already colluding, as we saw last episode, so it's not like Lanfear having Ishamael stop by Rand's dream for a minute so she can \"vanquish\" him would be a difficult ask. Hell, having Ishamael in on the deal would fit pretty well with both his and Lanfear’s plans—at least for now. Good call.\n<p>One way or another, though, Rand just can't catch a break. He finds Mat again, but rather than leaving town with Rand to escape, he chooses to heed Min's warning and stay away. Rand then decides to depart Cairhien on his own but gets stopped by Lan and Alanna. What are they going to do with him?</p>\n<p>Our answer lies in the arrival of the Amyrlin Seat and fourteen other Aes Sedai (including several familiar faces, like Liandrin and Verin). A similar situation plays out in the novel—Rand delays leaving Shienar for too long and gets stuck having to talk to the Amyrlin, recently arrived in the Borderlands with her retinue. Here, it looks like Rand delayed leaving Cairhien for too long and is stuck having to do the exact same thing. The Amyrlin and Moraine are old schemers when it comes to the subject of the Dragon Reborn, so the plots are all twisting back together. (As they should, since next week is the season's penultimate episode.)\n</p></div>\n<div>\n<strong>Andrew</strong>: I'd talk to someone for a long time about the process of adapting this season. Season one was, for all its departures, more or less a heavily compressed version of <em>The Eye of the World</em> with a bunch of stuff cut for time. For season two, it's like they wrote every single plot from book two (and parts of three) on a big whiteboard and then Tetris'd the story blocks around over and over again, shaving them down until they would fit in the amount of space that the show had to give. As different as the show seems to be, you're always running into recognizable bits, just moved around and recontextualized.\n<p>It certainly seems like most of our heroes are converging on Cairhien, before what I'm assuming will be a cataclysmic season-ending confrontation in Falme.</p>\n<p>That's where Nynaeve and Elayne are still camped out, trying to figure out how to free Egwene and any of the other Ars Sedai-affiliated channelers who have been captured by the Seanchan. Nynaeve and Elayne are very true to their book-selves here as \"powerful women who respect each other but would basically never hang out if they weren't both friends with the same person.\" Right now, it's on them to free Egwene <em>and</em> expose Liandrin, who just happens to be part of the Amyrlin's posse in Cairhien.</p>\n<p>It does seem like the show is going to be less patient than the books about resolving Nynaeve's \"block,\" where she can only channel under specific emotionally heightened circumstances. Leave it to Ryma (Nyokabi Gethaiga), a member of the healing-focused Yellow Ajah, to break it down in terms Nynaeve can understand: when someone is hurt, you don't <em>decide</em> to help them, you just help them.\n</p></div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_chan-scaled.jpg\"><img alt=\"Ryma and Elayne try to probe the a'dam while Nynaeve prepares to screw everything up.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_chan-640x360.jpg\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_chan-1280x720.jpg 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/wots2e6_chan-scaled.jpg\">Ryma and Elayne try to probe the a'dam while Nynaeve prepares to screw everything up.</a> (credit: Amazon Studios)</p></div>\n<div>\n<strong>Lee</strong>: That's a solid characterization of Nynaeve and Elayne's relationship. My wife said that Nynaeve calls Elayne \"princess\" with about the same level of contempt that Han uses with Leia in <em>Empire Strikes Back</em>. And poor Ryma—she'll now be joining Egwene and Maigan (the former Blue sitter, played by Sandy McDade) in the kennels.\n<p>Your description of playing Tetris with the plots is also spot on—that feels exactly like what's happening. I like some of it, and I don't like some of it, but I don't think I'd be able to do any better as a writer if faced with the same length and episode count constraints as the show is having to operate under. If there is a villain here, it's not really the Seanchan, or the Forsaken, or even the Dark One himself—it's whatever bean counters in the programming department decided on those constraints. (There is an obvious \"a'dam around the neck of the show\" metaphor that I could draw here, but I won't. Though I guess I just did.) Regardless, we're reviewing the show we've been given to work with, rather than the longer show we perhaps wish we had.</p>\n<p>I have one additional note from my wife that I need to read into the record: \"Ingtar has better smoky eye than Lanfear and Egwene's sul'dam put together.\" No argument from me there.</p>\n<p>Anything else from your notebook, Andrew, or have we reached the end for this week?\n</p></div>\n<div>\n<strong>Andrew</strong>: \"Wheel of Time? More like Wheel of Prime!\"\n</div>\n<div>\n<strong>Lee</strong>: Hah, yes, I suppose that does mean we are indeed done for this week. With only two episodes left, I'm expecting a lot of big things very soon. Big important things. Big important giant flaming things, in the sky. Because it would be silly to show us a horn in act one and not have <em>someone</em> blow it by act three, right?\n<p>We'll see you back here next Friday. Until then, may you all find water and shade.\n</p></div>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/Wheel-icon-e1637336031883.jpg\" /><p>(credit: <a href=\"https://wot.fandom.com/wiki/Category:Chapter_art\">WoT Wiki</a>)</p></div>\n\n</div><p><a href=\"https://arstechnica.com/?p=1970407\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1970407&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5321ea4813f5c1f87fcb52c6cddcd470b0a208b5ffc45d2f74ce5046c1f711ae","category":"Tech"}