{"title":"“I'm proud to be on the startline and make history” Emma Norsgaard on her first Paris-Roubaix","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/im-proud-to-be-on-the-startline-and-make-history-emma-norsgaard-on-her-first-paris-roubaix","date":1633006430000,"content":"\n      <p><span>“I was super scared before the recon because I’ve heard so many terrible things about Roubaix, but I think it's going to be exciting on Saturday,” says Movistar’s Emma Norsgaard, speaking a few days before the first ever edition of Paris-Roubaix Femmes, a race which is set to be groundbreaking for women’s cycling.</span></p>\n\n<p><span><b><i><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-femmes-2021-preview\">Related - Paris-Roubaix Femmes 2021 Preview<br /></a></i></b></span><span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-2021-preview\"><b><i>Related – Men's Paris-Roubaix 2021 Preview</i></b></a><br /></span></p>\n<div></div>\n<p><span>Norsgaard has little reason to be nervous, though, with the palmarès to her name. Earlier this year she had a hugely impressive Classics campaign, finishing 2nd in both Omloop Het Nieuwsblad and Le Samyn des Dames. Throw in her win in the Ceratizit Festival Elsy Jacobs and 3rd in both the Healthy Ageing Tour and Lotto Ladies Tour overall, as well as numerous top 10s, and it all adds up to one of the most impressive spring seasons of any riders in the peloton. </span></p>\n<p>What’s more, Norsgaard is only 22 years old and is in what she describes as her first “full season” as a professional, following the disruption from Covid-19 last year.</p>\n<p><span>After the Giro Donne in July, where she sprinted to a stage win, Norsgaard’s form dropped slightly, amplified by the incredibly high bar she’d set herself earlier in the year, something she puts down to fatigue. “It's been such a long season,” she says. “But I'm ready to give it a shot on Saturday and it fits me quite well, so I hope I can have some luck.”</span></p>\n<p><span>Luck is going to be a big part of the equation at Paris-Roubaix, one of the most challenging races that the women’s peloton have ever faced. With 17 cobbled sectors in the last 80km, punctures and crashes are likely to play a big factor. The weather forecast looks wet and windy too, only adding to the chaos. Do such challenging conditions suit Norsgaard? “It's going to be the same for everyone,” she says. “But I hope it won’t rain. It’s the first time on the cobbles in Roubaix so I think it would be nice if it didn’t have to be so brutal.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1327813364_575cb6e5-a2de-4583-8914-740d5d0535a3_1024x1024.jpg?v=1632995526\" /><em><span>Image: Getty</span></em></span></p>\n<p><span>Norsgaard expects positioning to be crucial during the race to help avoid the chaos that she thinks is likely to happen towards the back of the peloton. “Mine is quite good and you benefit a lot from that in these kinds of races,” she says.</span></p>\n<p><span> “If your position is good, you can go so far in the race and if the legs are also there, it brings so much more luck. </span>It’s much more fun and you create the race instead of being behind crashes and behind on every corner.”</p>\n<p><span>“I think it's gonna be a selection from behind,” she says. “If you can avoid crashes and punctures, you will probably be in the final.” The Danish youngster expects a fast and furious race from the beginning, especially without the long run-in to the first cobbled section that features in the men’s race. “Everyone will want to be in front, to be the first one on the cobbles,” she says. “That's what I'm most worried about, that people are going to be super stressed and it's going to cause some crashes because it would be so sad if this had to be the end of someone's race.”</span></p>\n<p><span>With the results she has so far, Norsgaard would certainly find herself in a leadership role for a race like Roubaix in most teams. However, being on Movistar with former World Champion and Olympic gold medallist Annemiek van Vleuten keeps the team's options open. Both riders have a big chance of crossing the line first when they reach Roubaix velodrome, so they will approach the race as joint captains.</span></p>\n<p><span>“It’s the end of the season, I'm tired and I feel it in my legs,” says Norsgaard. “For me, it's nice that we don't put all the cards on me and I can maybe relax a little bit on Saturday and see how it's going in the race.”</span></p>\n<p><span>Despite the shared leadership role with Van Vleuten, Norsgaard still has had plenty of opportunities to race for herself this season and she is grateful for the support of her Movistar team-mates who played a big part in each of her five victories.</span></p>\n<p><span>“It's like a little family here in Movistar. There's so much pressure from myself in every race and I feel like the atmosphere here is so chilled which is what I need. It’s the perfect team for me.” Norsgaard has signed for the Spanish outfit until 2025, a testament to the trust she has in Movistar as the right place to continue her development.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1-AW9_0646_1024x1024.jpg?v=1632995563\" /><em><span>Image:</span> Alex Whitehead/SWpix.com</em></span></p>\n<p><span>“If we have success, we are all super happy,” she says. “It's not only when Annemiek wins or if I win that us two are happy; the whole team is happy. I feel like this is the key.”</span></p>\n<p><span>“I think that our team-mates are willing to sacrifice so much for the victory we can create together,” she explains, hoping that Movistar will be able to use this ethos to carry them to a good result at Paris Roubaix-Femmes.</span></p>\n<p><span>The Danish rider is aware it won’t be easy, though, and expects the competition to be fierce – the stakes are high with the chance to be the race's maiden winner. “I think the main competitors are going to be Lotte Kopecky [of Liv Racing] and Chantal van den Broek-Blaak [from SD Worx],” Norsgaard says. “She's gonna do super well because she's strong and she's good technically. It’s the same with Lotte, she's always super strong on the cobbles and for sure, this race suits her really well.” </span></p>\n<p><span>Feeling nervous but confident, and armed with extra bar tape, thick gloves and plasters on her fingers to protect her hands from blistering on the brutal cobbles, Norsgaard is ready to give her all in the Hell of the North. </span></p>\n<p><span>However, in many ways, the results of Paris-Roubaix Femmes are secondary. The fact that the women’s peloton have the opportunity to race such an iconic event signals a big step forward for the sport, and will lead to more exposure, growing the women’s cycling fanbase. It’s something that Norsgaard herself dreamed of when she was growing up. </span></p>\n<p><span>“It’s been a race for so many years for the guys and it's always been this epic race,” she says. “It's super good for women's cycling that we start getting the same races as men, the big races. I think this is the way to do it, to make women's cycling grow. I'm super proud to be on the startline on Saturday and make history.”</span></p>\n<p><em><span>Cover image: Getty</span></em></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"532f6d218995b7f44620007fe3a1a77f0ced481ab4953f4b3652ddbeba23134f","category":"Cycling"}