{"title":"Visual predators and diurnal nest predation provide support for the Skutch Hypothesis and explain evolved incubation behaviors in a montane tropical bird community","link":"https://academic.oup.com/auk/article/doi/10.1093/ornithology/ukad047/7267429?rss=1","date":1694390400000,"content":"<span><div>Abstract</div>The <a href=\"#CIT0085\">Skutch (1949)</a> Hypothesis that nest predation risk constrains parental nest activity has important implications for the evolution of parental care strategies, but the required conditions for the hypothesis to operate have been questioned. We found the necessary conditions existed in a montane tropical bird community where 95.4% of predation events (<span>n</span> = 456) occurred during daylight hours and almost all predators (<span>n</span> = 224) were visually oriented. Moreover, incubation strategies for 21 passerine species were explained by nest predation rates as proposed by the Skutch Hypothesis. Hourly rates of visits to the nest were lower among species with higher nest predation rates, and achieved in part by longer on- and off-bouts. Incubation attentiveness (percent of time incubating) does not necessarily affect parental nest activity and was not related to nest predation rates. Nest predation rates were greater in enclosed- than open-nesting species, counter to long-standing views. Moreover, nest predation was usually higher in the nestling period when parents were more actively visiting nests than during incubation for enclosed- but not open-nesting species. This increase in nest predation in the nestling period for enclosed-nesting species might indicate proximate predation responses to parental nest activity that underlie the evolutionary patterns. Adult mortality also can exert selection on evolved strategies. Following life history theory, annual adult mortality probability explained residual variation in incubation behaviors, while accounting for nest predation, with longer-lived species exhibiting lower nest activity and attentiveness. Ultimately, the conditions for the Skutch Hypothesis were clear and evolved behaviors suggest an important influence of natural selection by nest predation in this montane tropical bird community. At the same time, different patterns of nest predation between open- and enclosed-nesting species emphasize a need for further research into how parental nest activity interacts with nest type to affect predator detection of nests.</span>","author":"","siteTitle":"Ornithology Current Issue","siteHash":"4b42e15d9ceec568e037973cb16bc8a0448c103c6eaf3f714117d3650f8eefe7","entryHash":"5340bc75810e754329fdb868c5e1893204b85f4aeb63ec9668c0bd91d2ad2194","category":"Environment"}