{"title":"Expression of TRPS1 in Metastatic Tumors of the Skin: An Immunohistochemical Study of 72 Cases","link":"https://www.preprints.org/manuscript/202407.2263/v1","date":1722230087000,"content":"TRPS1 (Tricho-rhino-phalangeal syndrome 1), is a GATA transcriptional activator gene encoding for a protein used as a sensitive immunohistochemical marker of breast carcinomas. In dermatopathology, TRPS1 is used as a marker of mammary Paget’s disease, and is also expressed by a variety of primary cutaneous tumors, mostly of adnexal origin. So far, limited data exist on the expression of TRPS1 in metastatic skin tumors. We studied the immunohistochemical expression of TRPS1 in 72 cutaneous metastatic tumors from the breast (n: 19) and other origins (n: 53) in order to assess its diagnostic usefulness. The intensity of TRPS1 immunostaining was expressed as a histoscore: product of percentage of positive cells (scored semi-quantitatively 0-4) and staining intensity (scored 0-3). In normal skin, nuclear TRPS1 expression was observed in cells of adnexal structures (pilosebaceous follicles and sweat glands). Eighteen (18/19, 94.7%) metastatic breast carcinomas showed diffuse and strong TRPS1 positivity (histoscore 12). Lower reactivity was found in some other metastases, including from the lung (11/22), the female genital tract (3/4), the kidney (2/4), whereas most (20/22) metastases from the digestive system and peritoneum, along with a case of metastatic prostate carcinoma, were negative. These results suggest that a high histoscore for TRPS1 is in favor of the mammary origin of a metastatic cutaneous carcinoma. Although TRPS1 is not absolutely specific or sensitive of a particular primary, we believe it can be added to a panel of other markers when investigating the origin of a cutaneous metastasis, namely when this is the first manifestation of the neoplastic disease.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5345838259cfbd5395e9d004b7a43c111f1ce79deacbbe877d3dbb24c645c626","category":"Interdisciplinary"}