{"title":"More of the same: harmonious SD Worx execute perfect plan at Amstel Gold Race","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/more-of-the-same-harmonious-sd-worx-execute-perfect-plan-at-amstel-gold-race","date":1681667240000,"content":"\n      <p>The last time Demi Vollering and Lotte Kopecky placed first and second respectively at a race, at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a> at the start of the spring, the mood between the riders was very different. On that occasion both SD Worx teammates sprinted against each other, and there was an acute sense of hostility in the air. Neither rider celebrated after crossing the line, and Vollering was clearly upset that Kopecky had tried to beat her.</p>\n<div></div>\n<p>The contrast at the finish of Amstel Gold could hardly have been starker. Not only did Vollering cross the line with a delighted grin on her face, Kopecky too lifted her arms to celebrate in honour of her teammate when she won the sprint for second eight seconds later. Vollering then looked behind and waited for her teammate, and the pair embraced warmly, continued to talk and laugh together as they made their way to the podium.</p>\n<p>In a squad stacked full of as much talent as SD Worx, there is always a risk of animosity within the team. Stars who would be outright leaders at any other teams are expected to do a share of teamwork, and sometimes have to sacrifice their personal ambition. Egos can be ruffled and ambitions frustrated.</p>\n<p>All that considered, it’s extremely impressive that SD Worx have managed to keep their various generations of stars happy and harmonious, and whatever tension that did exist between Vollering and Kopecky has clearly been resolved. They’d already delivered a one-two in the aftermath of that Strade Bianche result, albeit in the reverse order, at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a>, when Kopecky went clear solo while Vollering performed marshalling duties in the chase group behind.</p>\n<p>This time the roles were reversed, with Vollering launching the decisive attack over the top of the Cauberg, while Kopecky held back and marked the others. Just as the cobbles of the Tour of Flanders are best suited to Kopecky’s talents, the hilly parcours at Amstel Gold is Vollering’s domain, as indicated by her two runner-up finishes in the previous two editions; it made sense therefore that this was her turn to play the role of protagonist. From all the strain placed on their racing relationships at Strade Bianche, they’ve now grown to become the most formidable partnership in the peloton.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/better-than-i-could-have-expected-shirin-van-anrooij-on-her-big-binda-win-and-going-for-ardennes-glory\"><strong><em>Read more: ‘Better than I could have expected’ - Shirin van Anrooij on her big Trofeo Binda win and going for Ardennes glory</em></strong></a></p>\n<p>Once the selection was formed on the Cauberg with the two SD Worx riders present along with Grace Brown (FDJ-SUEZ), Soraya Paladin, Kasia Niewiadoma (both Canyon-SRAM), Liane Lippert (Movistar), Ashleigh Moolman (AG Insurance-Soudal QuickStep) and Riejanne Markus (Jumbo-Visma), it seemed inevitable that one of them would win. SD Worx had already bent the race to their will, working in the peloton to ensure that all attacks were controlled and that it remained intact at the foot of the final ascent of the Cauberg, with both their leaders present. Lorena Wiebes in particular played an eye-catchingly active role controlling the race, using her anaerobic power to sprint up the race’s many short climbs. It was a ride that put beyond any doubt the notion that she’s merely a pure sprinter, while also showing how deep she’s willing to go in service of her team.</p>\n<p>With so much talent all working so well together, SD Worx were always going to be very difficult to overcome. But several other teams still did their all to take the race to them, chief among them Canyon-SRAM. They were active throughout the day, and in particular used the section between the penultimate and last ascents of the Cauberg to try and get a rider up the road, with each of Elise Chabbey, Soraya Paladin and Kasia Niewiadoma. Of that trio Paladin had the most success, managing to get a gap 9km from the finish with an attack on the Bemelerberg, and subsequently joining force with Grace Brown to form a very dangerous leading duo. Had this pair managed to catch SD Worx out?</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1482596115.jpg?v=1681667152\" alt=\"Amstel Gold Race, Demi Vollering\" /></p>\n<p>While SD Worx did keep the pair close enough to bring them back on the final climb of the Cauberg, among the four riders dragged up to them with Vollering and Kopecky was Niewiadoma, meaning that Canyon-SRAM too had two riders in the lead group. It was an advantageous position, but — perhaps due to the fatigue of Paladin at leading on the Cauberg, and Niewiadoma through hanging on — they failed to act upon it. Vollering was the first to attack, and nobody could follow, meaning the Dutchwoman won while Niewiadoma and Paladin had to be content with fourth and fifth respectively.</p>\n<p>The attack from Paladin was also significant for being the moment it became clear that Annemiek van Vleuten (Movistar) did not have the legs to win. She was next in line when the Italian accelerated, but, rather than lay down the power as we’re so seeing her do, she swung off and looked at other riders to lead the chase. When an earlier attack of hers on rolling terrain 14km from the finish failed to open up a gap, we wondered whether she was keeping her powder dry for the Cauberg, but at this moment it was clear Van Vleuten was not her usual self. Later she blamed the weather conditions for her poor legs, and indeed the cold and the rain did cause much discomfort in the peloton — Kopecky certainly looked stressed when a soigneur was unable to provide her with a rain jacket at one point. Unfortunately, that was Van Vleuten's last chance to win Amstel Gold, so she will retire without ever winning the biggest race of her native Netherlands.</p>\n<p>Without Van Vleuten in her best form, nobody was able to really give SD Worx a scare. Despite having Lucinda Brand gain over two minutes in a two-woman breakaway with Sabrina Stultiens (Liv Racing), Trek-Segafredo were uncharacteristically quiet in the finale, with neither Brand, Elisa Longo Borghini, Elisa Balsamo or Shirin van Anrooij making the selection made on the Cauberg (though Anrooij did make it back up to the group before the finish to sprint for third place, for her third top-five finish of the spring Classics). That means SD Worx have now won six of the nine WorldTour Classics contested so far this spring, and so long as they keep riding as harmoniously as Vollering and Kopecky did today, they’re going to keep on winning.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"534f09f7b753d5d51aa9a0d74fcf75335cdbb65537d3d0a22dd3273f46d7b18b","category":"Cycling"}