{"title":"The Impact of Malnutrition on COPD Outcomes: Role of Mini-Nutritional Assessment (Mna) in Predicting Acute Exacerbations in Patients with Highly Complex COPD and Its Clinical and Prognostic Implications","link":"https://www.preprints.org/manuscript/202406.1467/v1","date":1718930881000,"content":"Background: Current management of COPD is predominantly focused on respiratory aspects. A multidimensional assessment including nutritional assessment, quality of life and disability provides a more reliable perspective of the true complexity of COPD patients. Methods: Prospective observational study of 120 elderly COPD patients at high risk of acute exacerbations. The Mini-Nutritional Assessment (MNA) was administered in addition to the usual respiratory assessment. The primary outcome was a composite of moderate or severe acute exacerbations during 52 weeks of follow-up. Results: The median MNA Short Form (SF) score was 11 (8-12), 39 participants (32.50%) had normal nutritional status, 57 (47.5%) were at risk of malnutrition and 24 (20%) were malnourished. Our multivariate linear logistic models showed that the MNA score was associated with dyspnea and respiratory symptoms severity assessed by the Modified British Medical Research Council (mMRC) and the COPD Assessment Test (CAT) score, with spirometric variables, in particular with the severity of airflow limitation based on the value of FEV1 and with poorer QoL as assessed by the EQ-5D-3 questionnaire. Cox regression analysis according to nutritional status based on the MNA score showed that COPD participants \"at risk of malnutrition\" and \"malnourished\" had a higher risk of moderate to severe acute exacerbations with a hazard ratio (HR) of 3.54 (p=0.002) and 8.20 (p=0.0001), respectively. Conclusion: Our study confirms the importance of assessing nutritional status in elderly COPD patients and its prognostic value.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"535a932f2e8f7c1a15083d4c676e3cb75885429534d1bd67de72c95abf310e36","category":"Interdisciplinary"}