{"title":"Wuliangye strong aroma baijiu promotes intestinal homeostasis by improving gut microbiota and regulating intestinal stem cell proliferation and differentiation","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13562?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Wuliangye strong aroma baijiu (hereafter, Wuliangye baijiu) is a traditional Chinese grain liquor containing short-chain fatty acids, ethyl caproate, ethyl lactate, other trace components, and a large proportion of ethanol. The effects of Wuliangye baijiu on intestinal stem cells and intestinal epithelial development have not been elucidated. Here, the role of Wuliangye baijiu in intestinal epithelial regeneration and gut microbiota modulation was investigated by administering a Lieber–DeCarli chronic ethanol liquid diet in a mouse model to mimic long-term (8 weeks’) light/moderate alcohol consumption (1.6 g kg<sup>−1</sup> day<sup>−1</sup>) in healthy human adults.</p>\n<h2>RESULTS</h2>\n<p>Wuliangye baijiu promoted colonic crypt proliferation in mice. According to immunofluorescence and reverse transcription-quantitative polymerase chain reaction analyses, compared with the ethanol-only treatment, Wuliangye baijiu increased the number of intestinal stem cells and goblet cells and the expression of enteroendocrine cell differentiation markers in the mouse colon. Furthermore, gut microbiota analysis showed an increase in the relative abundance of microbiota related to intestinal homeostasis following Wuliangye baijiu administration. Notably, increased abundance of Bacteroidota, <i>Faecalibaculum</i>, Lachnospiraceae, and <i>Blautia</i> may play an essential role in promoting stem-cell-mediated intestinal epithelial development and maintaining intestinal homeostasis.</p>\n<h2>CONCLUSIONS</h2>\n<p>In summary, these findings suggest that Wuliangye baijiu can be used to regulate intestinal stem cell proliferation and differentiation in mice and to alter gut microbiota distributions, thereby promoting intestinal homeostasis. This research elucidates the mechanism by which Wuliangye baijiu promotes intestinal health. © 2024 Society of Chemical Industry.</p>","author":"Hui Zhu, \nBaoxiang Gu, \nDong Zhao, \nYi Ma, \nMuhammad Aamer Mehmood, \nYuzhu Li, \nKangzhuo Yang, \nYumeng Wang, \nManli He, \nJia Zheng, \nNing Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"535d6abe605fa89c5fe593377a325b1b38885d7c165edfa7d9f6cbc9d03919a3","category":"Environment"}