{"title":"Genome‐wide association studies reveal novel loci controlling tuber flesh color and oxidative browning in Dioscorea alata","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.12721?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Consumers' preferences for food crops are guided by quality attributes. This study aimed at deciphering the genetic basis of quality traits, especially tuber flesh color (FC) and oxidative browning (OB) in <i>Dioscorea alata,</i> based on the genome-wide association studies (GWAS) approach. The <i>D. alata</i> panel was planted at two locations in Guadeloupe. At harvest, the FC was scored visually as white, cream, or purple on longitudinally sliced mature tubers. The OB was scored visually as the presence or absence of browning after 15 min of exposure of the sliced samples to ambient air.</p>\n<h2>RESULTS</h2>\n<p>Phenotypic characterization for FC and OB of a diverse panel of <i>D. alata</i> genotypes highlighted significant variation within the panel and across two locations. The genotypes within the panel displayed a weak structure and could be classified into three subpopulations. GWAS identified 14 and 4 significant associations for tuber FC and OB, respectively, with phenotypic variance, explained values ranging from 7.18% to 18.04%. Allele segregation analysis at the significantly associated loci highlighted the favorable alleles for the desired traits, i.e., white FC and no OB. A total of 24 putative candidate genes were identified around the significant signals. A comparative analysis with previously reported quantitative trait loci indicated that numerous genomic regions control these traits in <i>D. alata</i>.</p>\n<h2>CONCLUSION</h2>\n<p>Our study provides important insights into the genetic control of tuber FC and OB in <i>D. alata.</i> The major and stable loci can be further utilized to improve selection in breeding programs for developing new cultivars with enhanced tuber quality. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Komivi Dossa, \nAngélique Morel, \nMahugnon Ezékiel Houngbo, \nAna Zotta Mota, \nErick Malédon, \nJean‐Luc Irep, \nJean‐Louis Diman, \nPierre Mournet, \nSandrine Causse, \nKien Nguyen Van, \nDenis Cornet, \nHâna Chair","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"535e07c2321cfe3a2f4e0d7274bbaa4cbbe33f538d574cc2f979a0a0ba667e2e","category":"Environment"}