{"title":"Apple finally made the perfect watch face","link":"https://www.macworld.com/article/2086024/applw-watch-watchos-10-snoopy-watch-face.html","date":1697107500000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Among the many changes and new features in <a href=\"https://www.macworld.com/article/1792869/watchos-10-release-date-new-features.html\">watchOS 10</a>, you’ll find new and updated watch faces. One of those is not like the others. The new Snoopy watch face injects a level of personality and reactivity that I didn’t know I was missing until I had it. Despite obvious problems—would it kill Apple to put the date on the face—it’s quickly become my go-to watch face. And I’m not even particularly a fan of Peanuts or Snoopy.</p>\n\n\n\n<p>At first glance, you might assume the new Snoopy watch face is not much different from other “character” faces like Mickey &amp; Minnie or Toy Story. But enable it for a few days and you’ll realize that it’s so much more.</p>\n\n\n\n<p>The Snoopy watch face does something new. When your watch is asleep, Snoopy and Woodstock are napping on his doghouse. When you raise your wrist to wake up your watch, you’ll get a short animation—about three seconds—showing Snoopy and often Woodstock doing…something.</p>\n\n\n\n<p>That’s where the surprise and delight comes from. The team that made this face created <em>148</em> new animations, totaling <em>12 minutes</em> of total animation time. Some animations are just cute, but most are <em>situational</em>. It’s data delivery (of a sort) that makes you smile. And it’s varied enough that you’ll keep discovering new animations for days and weeks.</p>\n\n\n\n<h2>Personality and reactivity</h2>\n\n\n\n<p>The Snoopy animation that plays when your watch wakes up often depends on factors such as the weather, time of day, or location. If it’s hot out, Snoopy might be chilling in a pool or eating ice cream. In the afternoon, he rides a skateboard. Raining? Out comes the umbrella. At dinner time he eats from his bowl or puts on a chef’s hat. </p>\n\n\n\n<p>Many of the animations interact with the watch hands, with Snoopy sliding down the slope of one or peaking out from around a vertical hand.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/snoopy-face-hero.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Snoopy Watch Face\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/snoopy-face-hero.jpg?quality=50&amp;strip=all 2750w, https://b2c-contenthub.com/wp-content/uploads/2023/09/snoopy-face-hero.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/snoopy-face-hero.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/snoopy-face-hero.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/snoopy-face-hero.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/09/snoopy-face-hero.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/09/snoopy-face-hero.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/09/snoopy-face-hero.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption><p>The Snoopy watch face has dozens of unique animations that change based on the weather, location, and time of day.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>It’s not just cute, it’s situational and reactive in a way that connects directly to your emotions. What smartwatch faces try to do is present data clearly; simple numbers or graphs that tell you the temperature outside, the chance of rain, or how many steps you’ve taken. All that stuff is well and good, but after experimenting with many watch faces that offer up all kinds of data, I usually find myself going back to something that just displays the time and date with perhaps battery life or temperature.</p>\n\n\n\n<p>On a screen that small, with an interaction window measured in single-digit seconds, I just don’t want to engage my brain in the way necessary to decode a slew of small data points, glyphs, and graphics. I’ll take out my phone for that.</p>\n\n\n\n<p>And that’s where the Snoopy watch face comes in. It injects the watch face with <em>personality</em>, but more importantly, it uses that personality to provide contextual clues that go right to the emotional center of my brain, without charts or graphs. <em>This</em> is what I want out of my Apple Watch! I want to smile every time I raise my wrist, but I also want to intuitively know–without <em>reading data</em>–something useful based on my own personal situation. Oh, it’s hot out! It’s getting late! It’s raining out! It’s dinner time!</p>\n\n\n\n<p>I would love to see much more of this (perhaps the beings from the Apple TV+ show <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://tv.apple.com/us/show/strange-planet/umc.cmc.zbh4nvi65qy3os9ifxm0fpe4?mttn3pid=Google%20AdWords&amp;mttnagencyid=a5e&amp;mttncc=US&amp;mttnsiteid=143238&amp;mttnsubad=OUS20191076_1-668936567983-c&amp;mttnsubkw=150906657799__6AjWKt92_&amp;mttnsubplmnt=_adext_&amp;xcust=1-1-2086024-1-0-0&amp;sref=https://www.macworld.com/feed\">Strange Planet</a> would make good candidates). But what I really want is for Apple to embrace the central concept of the Snoopy watch face while extending it much further. Using data about me (all kept on-device of course), my watch should feed me friendly context with personality that is just right for the moment. Maybe I have a meeting coming up. Perhaps today is a holiday. Is it time to go to the gym? Do I have dinner reservations soon? Movie tickets? </p>\n\n\n\n<p>It’s all there, on my iPhone and my watch. In apps, emails, in my calendar, or derived from my location and data like weather or traffic reports. My watch could feed me exactly the most relevant info I need every time I raise it, without making me read a single data point or line of text, just by having a fun character perform a brief action. The Snoopy watch face is the first taste that I’ve ever seen, not just on Apple Watch but on any Apple product, and I want more. </p>\n\n\n\n<p>For the first time in years, I’m imagining my Apple Watch not as jewelry nor as a tiny data display, but as a <em>fun companion</em> full of personality that just happens to know everything about my life and can tell me what I need to know when I need to know it. All in a way that makes me smile and protects my privacy.</p>\n\n\n\n<p>We’re not there yet. We may never get there. But the Snoopy watch face is the little taste I needed to realize that it’s exactly what I want.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5360137d387c94beaecf40c9fbd51ecf64b8b78184acd52c748e8ca1e20837e8","category":"Apple"}