{"title":"The effect of COVID-19 pandemic on healthcare seeking in an urban informal settlement in Nairobi and a rural setting in western Kenya","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002968","date":1713362400000,"content":"<p>by George O. Agogo, Patrick K. Munywoki, Allan Audi, Joshua Auko, George Aol, Clifford Oduor, Samuel Kiplangat, Alice Ouma, Terry Komo, Amy Herman-Roloff, Peninah Munyua, Godfrey Bigogo</p>\r\n\r\nThe COVID-19 pandemic caused widespread changes and disruptions to healthcare seeking behavior. There are limited studies on the effect of the COVID-19 pandemic on healthcare seeking patterns in low-and middle-income countries (LMICs), especially in settings with inequitable access to healthcare in rural and urban informal settlements. We investigated the effect of the COVID-19 pandemic on reported healthcare seeking at health facilities and chemists using morbidity data from participants in an ongoing population-based infectious disease surveillance platform in Asembo in Siaya County, a rural setting in western Kenya and Kibera, an urban informal settlement in Nairobi County. We described healthcare seeking patterns before (from 1<sup>st</sup> January 2016 to 12<sup>th</sup> March 2020) and during the pandemic (from 13<sup>th</sup> March 2020 to 31<sup>st</sup> August 2022) by gender and age for any reported illness and select clinical syndromes using frequencies and percentages. We used a generalized estimating equation with an exchangeable correlation structure to assess the effect of the pandemic on healthcare seeking adjusting for gender and age. Overall, there was a 19% (adjusted odds ratio, aOR: 0.81; 95% Confidence Interval, CI: 0.79–0.83) decline in odds of seeking healthcare at health facilities for any illness in Asembo during the pandemic, and a 30% (aOR: 0.70; 95% CI: 0.67–0.73) decline in Kibera. Similarly, there was a decline in seeking healthcare by clinical syndromes, e.g., for ARI, aOR: 0.76; 95% CI:0.73–0.79 in Asembo, and aOR: 0.68; 95% CI:0.64–0.72 in Kibera. The pandemic resulted in increased healthcare seeking at chemists (aOR: 1.23; 95% CI: 1.20–1.27 in Asembo, and aOR: 1.40; 95% CI: 1.35–1.46 in Kibera). This study highlights interruptions to healthcare seeking in resource-limited settings due to the COVID-19 pandemic. The pandemic resulted in a substantial decline in seeking care at health facilities, and an increase of the same at chemists.","author":"George O. Agogo","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"536be6b02ce431ca1c8b9cc0b31c3c135c4ab105c29fe3874dbe7a7e92ba4df3","category":"Environment"}