{"title":"Geometric effects of fragmentation are likely to mitigate diversity loss following habitat destruction in real‐world landscapes","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13826?af=R","date":1710399429000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Habitat conversion is the number one threat to biodiversity. The loss of biodiversity due to habitat loss might be exacerbated if species are harmed by fragmentation per se—the breaking apart of natural habitat that remains (hereafter <i>fragmentation</i>). However, the evidence that species are harmed by habitat fragmentation is mixed. Studies at the patch scale tend to show that fragmentation reduces diversity due to negative demographic effects on species' dispersal, survival and fecundity. In contrast, studies at the landscape scale tend to show that fragmentation increases diversity. This discrepancy may be partly due to geometric effects, defined as greater species turnover between patches in more fragmented landscapes. Although these effects have been demonstrated theoretically and are expected to be stronger across larger spatial extents, it is unclear whether they are likely to occur in real-world settings with both realistic landscape patterns and communities. Here, we investigated the possibility of geometric effects using simulations combined with real-world landscape and community data.</p>\n<h2>Location</h2>\n<p>New Jersey, northeastern USA.</p>\n<h2>Time period</h2>\n<p>Current.</p>\n<h2>Taxa studied</h2>\n<p>Bees.</p>\n<h2>Methods</h2>\n<p>We focused on landscape sizes within the typical range for protected areas (36–576 ha), simulated forest loss using real landscape patterns, and simulated forest-bee communities based on field data we collected.</p>\n<h2>Results</h2>\n<p>We found weak but positive effects of fragmentation: immediately following forest destruction, the most fragmented forests harboured up to 7.3% more species than the least fragmented forests of the same area, in agreement with observational studies of biodiversity along fragmentation gradients. In contrast to expectations, however, the overall effects of fragmentation did not change with spatial extent.</p>\n<h2>Conclusions</h2>\n<p>Our results suggest that fragmentation can mitigate biodiversity loss immediately following habitat destruction, but that the benefits do not vary strongly with spatial extent in real-world landscapes and at extents relevant to land management.</p>","author":"Colleen Smith, \nJuan A. Bonachela, \nDylan T. Simpson, \nNatalie J. Lemanski, \nRachael Winfree","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"536b9634a6a645c86eb343dd34d34b995ffba01a64d88bf5572a56ddcfc58da9","category":"Environment"}