{"title":"Two lineages of bivalve transmissible neoplasia affect the blue mussel Mytilus trossulus Gould in the subarctic Sea of Okhotsk","link":"https://academic.oup.com/cz/article/69/1/91/6535236?rss=1","date":1645574400000,"content":"<span><div>Abstract</div>There are increasing findings of the bivalve transmissible neoplasia derived from the Pacific mussel <span>Mytilus trossulus</span> (<span>Mtr</span>BTN) in populations of different <span>Mytilus</span> species worldwide. The Subarctic is an area where this disease has not yet been sought despite the fact that <span>Mytilus</span> spp. are widespread there, and <span>M. trossulus</span> itself is a boreal species. We used flow cytometry of the hemolymph, hemocytology, and histology to diagnose disseminated neoplasia in a sample of <span>M. trossulus</span> from Magadan in the subarctic Sea of Okhotsk. Neoplasia was identified in 11 of 214 mussels studied. Using mtDNA COI sequencing, we revealed genotypes identical or nearly identical to known <span>Mtr</span>BTN ones in the hemolymph of most of the diseased mussels. Both <span>Mtr</span>BTN evolutionary lineages have been identified, the widespread <span>Mtr</span>BTN2, and <span>Mtr</span>BTN1, so far only known from <span>M. trossulus</span> in British Columbia on the other side of the Pacific from Magadan. In addition, <span>Mtr</span>BTN2 was represented by 2 common diverged mtDNA haplolineages. These conclusions were confirmed for selected cancerous mussels by molecular cloning of COI and additional nuclear and mtDNA genes. On the background of high genetic diversity, different cancers were similar in terms of ploidy (range 4.0–5.8 n) and nuclear-to-cell ratio. Our study provides the first description of neoplasia and <span>Mtr</span>BTN in mussels from the Sea of Okhotsk and from the Subarctic, of both <span>Mtr</span>BTN1 and <span>Mtr</span>BTN2 in the same mussel population, and the first direct comparison between these transmissible cancers.</span>","author":"","siteTitle":"Current Zoology Current Issue","siteHash":"e7197aa0e79464a44186f16a81d9758c42b85acdd06820e73429ff264fcd9f66","entryHash":"5372403d72ab9aeb2e55de5bf422bd97fda9c3d90484dcea2d5e3f0914b727b0","category":"Environment"}