{"title":"ชาวปารีสโหวตยกเลิกบริการเช่าสกู๊ตเตอร์ไฟฟ้า เพราะอุบัติเหตุเยอะ แต่ยังไม่ได้ข้อสรุปว่าจะยกเลิกหรือไม่","link":"https://www.blognone.com/node/133299","date":1680604485000,"content":"<div><div><div><p>ปารีสเป็นเมืองแรกๆ ที่เปิดให้มีบริการเช่าสกู๊ตเตอร์ไฟฟ้าให้คนในเมืองได้ใช้ในการสัญจรเดินทาง แต่ล่าสุดวันอาทิตย์ที่ผ่านมานายกเทศมนตรี Anne Hidalgo กรุงปารีสมีการทำประชามติเรื่องนี้ ก่อนที่ 89% ของผู้ลงคะแนน เห็นชอบที่ให้ยกเลิกบริการเช่าสกู๊ตเตอร์ไฟฟ้า</p>\n<p>ถึงแม้ว่าการใช้สกู๊ตเตอร์ไฟฟ้าจะมีข้อกำหนด โดยจำกัดความเร็วไว้แค่ 10 กิโลเมตร/ชั่วโมง และกำหนดพื้นที่ในการใช้งาน แต่ Anne Hidalgo ได้ให้เหตุผลว่าสกู๊ตเตอร์เป็นต้นเหตุของอุบัติเหตุมากมายที่เกิดขึ้น รวมไปถึงค่าใช้จ่ายก็แพงเกินไปอยู่ที่ประมาณ 5 ยูโร สำหรับการขับขี่ 10 นาที และยังไม่เป็นมิตรต่อสภาพภูมิอากาศเท่าที่ต้องการ ถึงแม้ว่าก่อนหน้านี้เธอจะเห็นด้วยกับการนำสกู๊ตเตอร์ไฟฟ้ามาใช้ในเมืองก็ตาม</p>\n<p>TechCrunch ได้ทำการสำรวจและวิเคราะห์การใช้สกู๊ตเตอร์ไฟฟ้าในปารีสพบว่ามีผู้คนจำนวนมากนิยมใช้สกู๊ตเตอร์ไฟฟ้าแทนการเดินและโดยสารด้วยรถยนต์หรือรถประจำทาง ซึ่งถึงแม้ว่าสกู๊ตเตอร์ไฟฟ้าจะเป็นตัวเลือกที่ดีในการใช้แทนรถยนต์ แต่เมื่อเทียบกับปัญหาอื่นๆ ที่เกิดขึ้นแล้วถือว่าไม่ใช้ทางแก้ปัญหาที่ถูกต้องที่สุด ยังบอกอีกว่าเราควรลงทุนในจักรยานไฟฟ้าและพัฒนาการเดินทางเท้าให้มากขึ้น</p>\n<p>บริษัทผู้ให้บริการเช่าสกู๊ตเตอร์ไฟฟ้าอย่าง Dott, Lime และ Tier ได้บอกว่าการลงคะแนนโหวตไม่เป็นธรรมเนื่องจากมีการเปิดให้โหวตแค่บางพื้นที่เท่านั้นและไม่มีการโหวตผ่านทางออนไลน์ มีผู้ออกเสียงเพียง 103,084 คน ซึ่งคิดเป็น 7.5% ของผู้ที่ลงทะเบียน รวมไปถึงวันที่โหวตเป็นวันเดียวกับที่มีงานวิ่งมาราธอนปารีส ทำให้มีเพียงผู้อาศัยในเมืองเท่านั้นที่โหวตได้ ส่วนคนนอกเมืองไม่สามารถร่วมโหวตด้วยได้ ถึงแม้ว่าบริษัทจะมีการเสนอไม่คิดค่าบริการสำหรับลูกค้าที่ต้องการเดินทางมาร่วมลงคะแนน และใช้เหล่าคนดังมาส่งเสริมการลงคะแนนในวัยรุ่นก็ตาม แต่ผู้ที่มาลงคะแนนส่วนมากก็ยังถือว่าอายุเยอะอยู่ดี</p>\n<p>อย่างไรก็ตาม การลงคะแนนครั้งนี้เป็นเพียงการลงประชามติ ถามความเห็นประชาชนเท่านั้น ผลโหวตไม่ได้เป็นข้อผูกมัดทางกฎหมาย ซึ่งนายกเทศมนตรีกรุงปารีสก็ยังเลือกที่จะเก็บสกู๊ตเตอร์ไว้อยู่ เนื่องจากพิจารณาว่าจำนวนผู้มีสิทธิ์ในการโหวตนั้นถือว่าต่ำอยู่ และ Lime หนึ่งในผู้ให้บริการเช่าสกู๊ตเตอร์ได้ออกเปิดเผยข้อมูลว่า ปี 2021 มีผู้ขับขี่สกู๊ตเตอร์มากถึง 1.2 ล้านคน ซึ่ง 85% เป็นชาวปารีส และมีจำนวนการใช้ถึง 10 ล้านครั้งทั้งใน Lime, Dott และ Tier นับเป็น 27,000 เที่ยวต่อวัน ถือว่าเป็นสัดส่วนที่เยอะมากเลยทีเดียว<br />\n.<br />\nที่มา: https://techcrunch.com/2023/04/02/paris-votes-overwhelmingly-to-ban-shared-e-scooters/</p>\n<p><img alt=\"alt=&quot;Dott&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/e6fbbf7f09329257abe67295b4e7acb5.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/france\">France</a></div><div><a href=\"/topics/e-scooters\">e-scooters</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"53720faf6e10fd9bc37e1259f768c0f5eb7817418956b478b3e633d60f0baa02","category":"Thai"}