{"title":"Intel intros first Meteor Lake chips with faster GPUs and worse single-core speed","link":"https://arstechnica.com/?p=1989886","date":1702566043000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Intel-Core-Ultra-2-800x450.jpg\" alt=\"Intel's Core Ultra CPUs combine multiple silicon dies into a single chip.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Intel-Core-Ultra-2.jpg\">Enlarge</a> <span>/</span> Intel's Core Ultra CPUs combine multiple silicon dies into a single chip. (credit: Intel)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Intel announced technical details about its next-generation Core CPUs a few months ago. <a href=\"https://arstechnica.com/gadgets/2023/09/intels-meteor-lake-cpus-bring-a-much-faster-gpu-radically-new-chip-design/\">Codenamed Meteor Lake</a>, the chips are good and bad news for Intel's chip manufacturing ambitions—they're simultaneously the first chips to use the brand-new Intel 4 process and the first of Intel's mass-market consumer processors to use silicon manufactured by someone other than Intel (in this case, TSMC). They're also a showcase for Intel's Foveros packaging technology, which welds together several pieces of silicon (\"tiles,\" in Intel's words) rather than integrating everything into a single monolithic die.</p>\n\n<p>Today, Intel is announcing the first wave of actual Meteor Lake processors, which Intel says will be available in some PCs starting today—expect to see quite a few of these PC designs announced this week, and even more of them at CES next month.</p>\n<p>The lineup includes 11 chips across two different product families: H-series processors for thin-and-light workstation and gaming laptops and U-series chips that will end up in Ultrabooks. Eight of these are launching today, and three more are expected in Q1 of 2024. The two families share many similarities, including Intel's first built-in neural processing unit (NPU) for accelerating machine learning and AI workloads, but in short, the H-series chips use more power and include more P-cores and GPU cores.</p></div><p><a href=\"https://arstechnica.com/?p=1989886#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1989886&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"537605b90e8e71f7a55bd6b7818837d298c23b448ae9774e66f1f86c48eb0376","category":"Tech"}