{"title":"Advances and knowledge gaps on climate change impacts on honey bees and beekeeping: A systematic review","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17219?af=R","date":1709798400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/44f23c40-bea1-45fe-936f-72e2d4e2fbfc/gcb17219-toc-0001-m.png\" alt=\"Advances and knowledge gaps on climate change impacts on honey bees and beekeeping: A systematic review\" />\n<p>High mortality rates of <i>Apis mellifera</i> have been reported in different continents attributed to different factors, where climate change has been identified as a potential driver negatively impacting pollinators, but it is still unclear how it could affect honey bee populations. Thus, we provide a synthesis of current knowledge on the impacts of climate changes on the honey bees <i>A. mellifera</i> and beekeeping activities. </p>\n<br />\n<h2>Abstract</h2>\n<p>The Western honey bee <i>Apis mellifera</i> is a managed species that provides diverse hive products and contributing to wild plant pollination, as well as being a critical component of crop pollination systems worldwide. High mortality rates have been reported in different continents attributed to different factors, including pesticides, pests, diseases, and lack of floral resources. Furthermore, climate change has been identified as a potential driver negatively impacting pollinators, but it is still unclear how it could affect honey bee populations. In this context, we carried out a systematic review to synthesize the effects of climate change on honey bees and beekeeping activities. A total of 90 articles were identified, providing insight into potential impacts (negative, neutral, and positive) on honey bees and beekeeping. Interest in climate change's impact on honey bees has increased in the last decade, with studies mainly focusing on honey bee individuals, using empirical and experimental approaches, and performed at short-spatial (&lt;10 km) and temporal (&lt;5 years) scales. Moreover, environmental analyses were mainly based on short-term data (weather) and concentrated on only a few countries. Environmental variables such as temperature, precipitation, and wind were widely studied and had generalized negative effects on different biological and ecological aspects of honey bees. Food reserves, plant-pollinator networks, mortality, gene expression, and metabolism were negatively impacted. Knowledge gaps included a lack of studies at the apiary and beekeeper level, a limited number of predictive and perception studies, poor representation of large-spatial and mid-term scales, a lack of climate analysis, and a poor understanding of the potential impacts of pests and diseases. Finally, climate change's impacts on global beekeeping are still an emergent issue. This is mainly due to their diverse effects on honey bees and the potential necessity of implementing adaptation measures to sustain this activity under complex environmental scenarios.</p>\n<h2>Resumen</h2>\n<p>La abeja occidental <i>Apis mellifera</i> es una especie manejada que proporciona diversos productos de la colmena y servicios de polinización, los cuales son cruciales para plantas silvestres y cultivos en todo el mundo. En distintos continentes se han registrado altas tasas de mortalidad, las cuales son atribuidas a diversos factores, como el uso de pesticidas, plagas, enfermedades y falta de recursos florales. Además, el cambio climático ha sido identificado como un potencial factor que afecta negativamente a los polinizadores, pero aún no está claro cómo podría afectar a las poblaciones de abejas melíferas. En este contexto, realizamos una revisión sistemática de la literatura disponible para sintetizar los efectos del cambio climático en las abejas melíferas y las actividades apícolas. En total, se identificaron 90 artículos que proporcionaron información sobre los posibles efectos (negativos, neutros y positivos) en las abejas melíferas y la apicultura. El interés por el impacto del cambio climático en las abejas melíferas ha aumentado en la última década, con estudios centrados principalmente en individuos de abejas melíferas, utilizando enfoques empíricos y experimentales y realizados a escalas espaciales (&lt;10 km) y temporales (&lt;5 años) cortas. Además, los análisis ambientales fueron basaron principalmente en datos a corto plazo (meteorológicos) y se concentraron sólo en algunos países. Variables ambientales como la temperatura, las precipitaciones y el viento fueron ampliamente estudiadas y tuvieron efectos negativos generalizados sobre distintos aspectos biológicos y ecológicos de las abejas melíferas. Además, las reservas alimenticias, las interacciones planta-polinizador, la mortalidad, la expresión génica y el metabolismo se vieron afectados negativamente. Entre los vacios de conocimiento cabe mencionar la falta de estudios a nivel de colmenar y apicultor, la escasez de estudios de predicción y percepción, la escasa representación de las grandes escalas espaciales y a mediano plazo, el déficit de análisis climáticos y la escasa comprensión de los impactos potenciales de plagas y enfermedades. Por último, las repercusiones del cambio climático en la apicultura mundial siguen siendo un tema emergente, que debe estudiarse en los distintos países. Esto se debe principalmente a sus diversos efectos sobre las abejas melíferas y a la necesidad potencial de aplicar medidas de adaptación para mantener esta actividad crucial en escenarios medioambientales complejos.</p>","author":"Germán Zapata‐Hernández, \nMartina Gajardo‐Rojas, \nMatías Calderón‐Seguel, \nAriel A. Muñoz, \nKaren P. Yáñez, \nFabrice Requier, \nFrancisco E. Fontúrbel, \nPablo I. Ormeño‐Arriagada, \nHéctor Arrieta","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"538b35a8526f33f11478ff746e99725ad54e42562d514e9d84097a12ed36872c","category":"Environment"}