{"title":"Apple's September Event: 6 New Products to Expect Beyond the iPhone 15","link":"https://www.macrumors.com/2023/08/28/iphone-15-apple-event-four-other-announcements/","date":1693222800000,"content":"Apple is expected to hold its annual fall event this year on <a href=\"https://www.macrumors.com/2023/08/08/iphone-15-september-12-event/\">Tuesday, September 12</a>, when it will announce its new flagship iPhone 15 lineup, but there are a few more products expected to be unveiled as well.\r<br />\n\r<br />\n<div><div></div></div>\r<br />\nKeep reading to learn everything we know about what else Apple is expected to announce at the event beyond the iPhone 15.\r<br />\n\r<br />\n<h2>Apple Watch Series 9</h2>\r<br />\nThis year, Apple is expected to release the Apple Watch Series 9, an iterative update on the current Series 8. The refresh is expected to focus on updating the cores within the device's S-series chip, delivering a notable performance improvement, but the rest of the device is likely to be effectively the same as the Apple Watch Series 8.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/09/Apple-Watch-Solo-Loops.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nAccording to <em>Bloomberg</em>'s Mark Gurman, the <a href=\"https://www.macrumors.com/2023/05/08/apple-watch-series-9-updated-chip/\">S9 chip will be based on the A15 Bionic chip</a> used in the iPhone 13, iPhone 14, and other devices. The new chip could bring significantly improved performance and efficiency, boosting app launch speeds and potentially improving battery life. Apple reportedly plans to introduce a <a href=\"https://www.macrumors.com/2023/08/01/apple-watch-series-9-pink-color/\">new pink color option</a> for the ‌Apple Watch Series 9‌.\r<br />\n\r<br />\n<h2>Apple Watch Ultra 2</h2>\r<br />\nThe Apple Watch Ultra is Apple's top-of-the-line Apple Watch, priced at $800. At 49mm, it is also the largest, designed for outdoor enthusiasts who need more durability and a wider range of niche features than those who wear the standard Apple Watch.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/09/apple-watch-ultra-3.jpg\" alt width=\"3840\" height=\"2160\" />\r<br />\nA <a href=\"https://www.macrumors.com/2023/06/26/apple-roadmap-2023-24-15-new-devices/\">refreshed version</a> of the Apple Watch Ultra will come out this fall, and it is expected to get the same S9 processor upgrade that is coming to the Apple Watch Series 9, along with <a href=\"https://www.macrumors.com/2023/07/14/2023-apple-watch-ultra-with-3d-printed-parts/\">new 3D printed components</a>.\r<br />\n\r<br />\nThe second-generation version of the Apple Watch Ultra could potentially be <a href=\"https://www.macrumors.com/2023/07/24/apple-planning-to-reduce-apple-watch-ultra-weight/\">lighter than the first-generation model</a>. A rumor from Weibo user Setsuna Digital claims that the new Apple Watch Ultra will have a reduced weight, which could be due to the 3D printed parts Apple is rumored to be using.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/Apple-Watch-Ultra-Black-Feature.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nThe second-generation Apple Watch Ultra could also potentially come in a <a href=\"https://www.macrumors.com/2023/07/31/2023-apple-watch-ultra-new-dark-color/\">new darker color option</a>, such as a black titanium shade. \r<br />\n\r<br />\n<h2>New iPhone Cases and Apple Watch Bands</h2>\r<br />\nAs is typical of September Apple events, it's likely that new iPhone cases and Apple Watch bands will be released in a variety of fresh colors. The new cases and bands sometimes become available to order on Apple's online store just minutes after the event ends.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/Apple-Watch-Woven-Magnet-Strap-Mock-Feature.jpg\" alt width=\"2400\" height=\"1350\" />\r<br />\n<a href=\"https://www.macrumors.com/2023/08/09/new-apple-watch-magnetic-band/\">According to one rumor</a>, Apple is planning to release a new band for the Apple Watch Series 9 that will be made out of a woven fabric material and feature a magnetic buckle, similar to the existing Modern Buckle band. \r<br />\n\r<br />\nMeanwhile, several sources have <a href=\"https://www.macrumors.com/2023/08/17/apple-may-not-offer-leather-cases-for-iphone-15/\">claimed</a> that Apple will not offer leather iPhone 15 cases this year, as it has done for annual iPhone releases since 2013. Instead, it has been suggested the company will offer <a href=\"https://www.macrumors.com/2023/08/28/apple-non-leather-iphone-15-cases/\">leather-like cases</a> that use more eco-friendly materials.\r<br />\n\r<br />\n<h2>USB-C AirPods Pro Case</h2>\r<br />\nApple is likely to release a USB-C charging case for AirPods Pro alongside the launch of the iPhone 15, according to <a href=\"https://www.macrumors.com/2023/07/03/apple-airpods-pro-usb-c-case/\"><em>Bloomberg</em>'s Mark Gurman</a> and Apple analyst <a href=\"https://www.macrumors.com/2023/03/24/airpods-pro-2-usb-c-later-this-year/\">Ming-Chi Kuo</a>. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2019/10/airpods-pro-magsafe-case-design.jpg\" alt width=\"1646\" height=\"926\" />\r<br />\nThe shift is in line with the <a href=\"https://www.macrumors.com/2022/05/13/usb-c-iphone-2023/\">same switch from Lightning to USB-C</a> that is expected to happen across the iPhone 15 series this year.\r<br />\n\r<br />\n<h2>iPhone 15 Color-Matching USB-C Cables</h2>\r<br />\nThis year, Apple is expected to ship iPhone 15 models with a <a href=\"https://www.macrumors.com/2023/08/21/iphone-15-could-come-with-color-matched-cables/\">color-matched braided USB-C to USB-C cable</a> in the box rather than a plain white cable. Rumors suggest that each cable would be available in a color that would match with the shade of the iPhone 15 model.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/usbc-colored-iphone-15-cables.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nRumors suggest that it will measure in at <a href=\"https://www.macrumors.com/2023/08/22/iphone-15-braided-usb-c-cable-could-be-longer/\">1.5 meters instead of one meter</a>. With the braided design, it is also expected to be more durable. If the rumors are accurate, as we believe they are, expect Apple to sell additional color-matching USB-C cables as accessories to <a href=\"https://www.macrumors.com/2023/08/25/iphone-15-colors/\">match the colors of its new smartphone lineup</a>.\r<br />\n<ul><li><a href=\"https://www.macrumors.com/2023/08/07/when-will-iphone-15-be-released/\">When Will the iPhone 15 Be Released?</a></li></ul>\r<br />\n<h2>iPhone 15 Pro Thunderbolt Cable Accessory</h2>\r<br />\nApple may offer a USB-C data transfer accessory cable for iPhone 15 Pro models that is capable of Thunderbolt or USB4 speeds of up to 40Gbps, according to leakers. The length of the cable is said to be 0.8 meters, which is shorter than Apple's <a href=\"https://www.apple.com/shop/product/MN713AM/A/thunderbolt-4-pro-cable-18-m\">existing Thunderbolt 4 Pro cable (1.8m)</a>. Apple will allegedly sell the cable separately. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/thunderbolt-usb-c-cable.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\n<a href=\"https://www.macrumors.com/2022/11/16/iphone-15-high-speed-data-transfer/\">According to Apple analyst Ming-Chi Kuo</a>, the iPhone 15 Pro models will support \"at least\" USB 3.2 or Thunderbolt 3. However, the leaked USB4 cable is based on the Thunderbolt 4 protocol, allowing it to offer equivalent speeds of 40Gbps, or twice the preceding USB 3.2 Gen 2 standard.<br />This article, \"<a href=\"https://www.macrumors.com/2023/08/28/iphone-15-apple-event-four-other-announcements/\">Apple's September Event: 6 New Products to Expect Beyond the iPhone 15</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-september-event-6-new-products-to-expect-beyond-the-iphone-15.2399827/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5395b1cc579130ec92e3bec0fea02dbb7daddb14571dce06f98e153c2c1aa8a7","category":"Apple"}