{"title":"Prepare for more upscaled classic PC game mods with new RTX Remaster beta toolkit","link":"https://arstechnica.com/?p=1998580","date":1706115922000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/nvidia-rtx-remix-in-game-user-interface-800x450.jpg\" alt=\"A sample of the RTX Remix user interface being used to develop  the enhanced &lt;em&gt;Portal with RTX.&lt;/em&gt;\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/nvidia-rtx-remix-in-game-user-interface.jpg\">Enlarge</a> <span>/</span> A sample of the RTX Remix user interface being used to develop  the enhanced <em>Portal with RTX.</em> (credit: <a href=\"https://www.nvidia.com/en-gb/geforce/news/rtx-remix-open-beta-half-life-2-rtx-trailer/\">Nvidia</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In the waning days of 2022, when Nvidia was preparing to release <a href=\"https://arstechnica.com/gaming/2022/11/free-ray-tracing-update-will-overhaul-portals-graphics-on-december-8/\">the impressive, ray tracing-enabled <em>Portal with RTX</em></a>, we were already looking toward a future when \"the Nvidia RTX Remix modding platform used to remaster <em>Portal</em> will also be released to the general public at some point, making it easier to create updated versions of old DirectX 8 and DirectX 9 games with AI-upscaled textures and modern lighting effects,\" as we wrote at the time. That \"at some point\" future has fully arrived this week with Nvidia's <a href=\"https://www.nvidia.com/en-gb/geforce/news/rtx-remix-open-beta-half-life-2-rtx-trailer/\">open beta launch of its RTX Remix modding tools</a>.</p>\n<p>This isn't the wider modding community's first taste of RTX Remix's upscaling and lighting tools. Nvidia released an <a href=\"https://www.nvidia.com/en-us/geforce/news/rtx-remix-runtime-open-source-download/\">alpha version of the RTX runtime</a> last April, offering \"capture and replacement\" modules that could upgrade older game assets and add modern graphical features like DLSS3 at playback. ModDB <a href=\"https://www.moddb.com/rtx/\">lists dozens of older games</a> with an RTX.conf file that offers some level of RTX-powered graphical enhancement.</p>\n<p>But this week's official open beta launch gives \"experienced modders\" new tools to easily create and insert these kinds of updated graphical effects and models in classic titles. That includes \"generative AI texture tools\" that Nvidia <a href=\"https://wccftech.com/nvidia-rtx-remix-open-beta-qa-with-nyle-usmani-past-present-and-future-of-the-generalized-modding-platform/\">says</a> use \"our own proprietary model trained on our in-house dataset\" to automatically upscale low-res textures to up to four times the original resolution. It also means the ability to add \"physically accurate dynamic lights\" that work with ray-tracing-capable hardware and a variety of open source models and material maps for modders to play with.</p></div><p><a href=\"https://arstechnica.com/?p=1998580#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1998580&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"539726e2edd3e237aaa6eb56fae302fe044123947e775e89bc23b3a6a8a9df10","category":"Tech"}