{"title":"Optimizing the winemaking process: NIR spectroscopy and e‐nose analysis for the online monitoring of fermentation","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13336?af=R","date":1708509342000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>In the winemaking process, the rapid determination of specific quality parameters such as sugar content, pH, acidity, concentrations of phenolic compounds, anthocyanins and volatile organic compounds is crucial for high-quality wine production. Traditional analytical methods allow for precise quantification of these parameters but are time-consuming and expensive. This article explores the potential application of non-destructive analytical technique (NDAT) (near infra-red [NIR] and e-nose), as efficient alternatives for online monitoring of fermentation working on two different winemaking tanks and applying chemometrics to develop predictive models to correlate non-destructive and analytical data.</p>\n<h2>RESULTS</h2>\n<p>NIR measurements have been used to build principal components regression models, showing good prediction capability for polyphenols, anthocyanins, glucose and fructose. Both offline and online e-nose applications demonstrate good capability of discriminating different fermentation phases, in agreement with aromatic profile changes observed via gas chromatography-mass spectrometry analysis. Moreover, correlation analysis reveals the potential of quartz microbalances, Taguchi Gas Sensors and H<sub>2</sub>S sensors in predicting the concentration of compounds of great interest for winemaking (e.g. C6 alcohols, ketones, terpenes and ethyl esters) highlighting the robust connection between sensor data and specific chemical classes.</p>\n<h2>CONCLUSION</h2>\n<p>This research aims to showcase the potential employment of NDAT for online monitoring the evolution of must composition during fermentation. The proposed methods could potentially fulfil a longstanding requirement of winemakers, enabling them to closely monitor fermentation allowing the timely making of important technical decisions aimed at achieving oenological objectives in wine production. © 2024 Society of Chemical Industry.</p>","author":"Eleonora Littarru, \nMargherita Modesti, \nGianmarco Alfieri, \nStefano Pettinelli, \nGiuseppe Floridia, \nAndrea Bellincontro, \nChiara Sanmartin, \nStefano Brizzolara","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"53990d1607e312a805d39b98d63b946e84f1326ad8da1c19bc4861232bb20e80","category":"Environment"}