{"title":"Slaveholder ancestry and current net worth of members of the United States Congress","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308351","date":1724248800000,"content":"<p>by Neil K. R. Sehgal, Ashwini R. Sehgal</p>\r\nBackground <p>Whether and how much past slavery affects contemporary social and economic conditions in the United States is an area of active debate. Newly available data on which members of the United States Congress are descendants of slaveholders provides an opportunity to examine this topic. This study sought to determine the relationship between slaveholder ancestry and net worth among members of Congress.</p> Methods <p>Total assets and liabilities were collected from financial declarations of all members of Congress as of April 15, 2021. Net worth was estimated as the difference between total assets and liabilities. Information on slaveholder ancestry was obtained from a Reuters investigative series based on an extensive review of historical documents and verification by board-certified genealogists. Quantile regression was used to determine the association between net worth and slaveholder ancestry after adjustment for demographic factors.</p> Results <p>The median net worth of the 535 members of Congress was $1.28 million (interquartile range $0.11–5.87 million). On univariate analysis, net worth was associated with increased age, White race, increased education, and number of individuals enslaved by ancestors. On multivariate analysis, net worth was independently associated with age, White race, and number enslaved. Legislators whose ancestors enslaved 16 or more individuals had a $3.93 million (95% confidence interval 2.39–5.46) higher net worth compared to legislators whose ancestors were not slave owners after adjustment for age, sex, race, ethnicity, and education.</p> Conclusions <p>Past slaveholding practices are independently associated with current wealth among members of Congress. Because members of Congress are a highly selected group, further work is needed to understand how slaveholder ancestry affects current wealth in the general population to inform efforts to reduce social and economic disparities.</p>","author":"Neil K. R. Sehgal","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"539eefebe97cee87ce1a302d5786cec499d684e01b6ed44c30716f39cd6a9f55","category":"Interdisciplinary"}