{"title":"Apple Event in April? Recapping the Latest iPad Pro, AirPods, and AirTags Rumors","link":"https://www.macrumors.com/2021/03/18/apple-event-april-rumor-recap/","date":1616082082000,"content":"It's been a whirlwind of a month for Apple rumors. First, we heard from leaker Jon Prosser that an Apple Event <a href=\"https://twitter.com/jon_prosser/status/1316924404853592064\">was planned for March 16</a>, but that was <a href=\"https://www.macrumors.com/2021/02/19/no-apple-event-march-16/\">ruled out by <em>Bloomberg</em>'s Mark Gurman</a>. Once that date passed, Prosser and other leakers then suggested there <a href=\"https://www.macrumors.com/2021/03/08/apple-event-march-23-kang/\">would be an Apple Event on March 23</a>, which is seemingly not happening either.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/aipad-pro-tags-slight-tweak-feature.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"aligncenter size-full wp-image-783347\" />\r\n<br/>\r\nWith attention now shifting to April, we've put together this recap of where things stand.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Rumors Shift to April</h3>\r\n<br/>\r\nThe first word that Apple might have April announcements planned came from Japanese website <em>Mac Otakara</em> back in early January. Citing supply chain sources, the blog claimed that Apple would <a href=\"https://www.macrumors.com/2021/01/09/airpods-pro-2-iphone-se-3-april-2021-rumor/\">release second-generation AirPods Pro and a third-generation iPhone SE in April</a>, but the report did not specify whether the products would be announced at an event or with press releases. Apple analyst Ming-Chi Kuo has since claimed that <a href=\"https://www.macrumors.com/2021/03/01/kuo-iphone-se-2022-5g/\">a new iPhone SE will not be released until 2022</a>, but new AirPods Pro are still possible this spring.\r\n<br/>\r\n\r\n<br/>\r\nApril talk intensified this week, starting with a report from Taiwanese supply chain publication <em>DigiTimes</em> that claimed volume shipments of Mini-LED display components for a new 12.9-inch iPad Pro <a href=\"https://www.macrumors.com/2021/03/17/digitimes-12-9-ipad-pro-mini-led-q2-2021/\">will begin in the second quarter of 2021</a>, which spans April through June. This was followed by a report from Gurman, who claimed that <a href=\"https://www.macrumors.com/2021/03/17/thunderbolt-ipad-pro-coming-in-april/\">plans to announce new iPads as early as April</a>, including new 11-inch and 12.9-inch iPad Pro models.\r\n<br/>\r\n\r\n<br/>\r\nNotably, Gurman claimed that the new iPad Pro models could feature a Thunderbolt connector. This rumor certainly sounds plausible, as the new iPad Pro models are expected to be equipped with a faster A14X chip based on the M1 chip in the latest Macs, and the M1 chip supports Thunderbolt. And since Thunderbolt uses the USB-C connector design, the new iPad Pro models would still work with existing USB-C chargers and accessories.\r\n<br/>\r\n\r\n<br/>\r\nAs widely rumored, Gurman said Apple is looking to include Mini-LED backlighting on the new 12.9-inch iPad Pro at a minimum, suggesting that Mini-LED display technology might be exclusive to the larger model, at least for now.\r\n<br/>\r\n\r\n<br/>\r\nKuo added to the pile on early Thursday, claiming that mass production of Mini-LED iPads <a href=\"https://www.macrumors.com/2021/03/18/kuo-12-9-inch-mini-led-ipad-pro-production/\">will begin in mid-to-late April</a>.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Apple Event in April?</h3>\r\n<br/>\r\nApple's last April event <a href=\"https://www.macrumors.com/2010/04/05/iphone-os-4-0-preview-event-scheduled-for-this-thursday/\">was in 2010</a>, when the late Steve Jobs announced the developer preview of iPhone OS 4 (later renamed to iOS 4) at Apple's small Town Hall conference center at its former Infinite Loop headquarters.\r\n<br/>\r\n\r\n<br/>\r\nAccording to Prosser, though, Apple does plan to host an April event this year. In <a href=\"https://www.youtube.com/watch?v=9ZK3PEPywX0\">a YouTube video</a> today, Prosser said that he was actually told by a \"vague and mysterious\" source who has been \"100% accurate\" that there would be an April event back in late February, but Prosser thought that an April event made \"little to no sense\" and he was more inclined to believe his sources mentioning a March 23 event.\r\n<br/>\r\n\r\n<br/>\r\nProsser himself acknowledges that it's worth treating this April event rumor with some skepticism since it would be Apple's first April event in 11 years, but he emphasized his source's perfect track record. It's also worth noting that Prosser has been inaccurate about three consecutive event date rumors, including a <a href=\"https://twitter.com/jon_prosser/status/1316908204681498624\">November 17 event</a>, <a href=\"https://twitter.com/jon_prosser/status/1316924404853592064\">a March 16 event</a>, and a March 23 event (barring a last-minute announcement). \r\n<br/>\r\n\r\n<br/>\r\n<h3>What About the Rest of March?</h3>\r\n<br/>\r\nWith both Gurman and Kuo indicating that new iPads are unlikely to be announced until at least April, and Kuo recently claiming that mass production of third-generation AirPods is <a href=\"https://www.macrumors.com/2021/03/15/airpods-3-mass-production-q3-2021/\">now scheduled for the second half of 2021</a>, the list of new Apple products that could be unveiled in March is starting to shrink.\r\n<br/>\r\n\r\n<br/>\r\nHowever, a <a href=\"https://www.macrumors.com/2021/03/02/ios-14-5-beta-3-items-tab-find-my-app/\">new \"Items\" tab enabled by default</a> in the Find My app in the iOS 14.5 beta has led to some hope that Apple's long-awaited <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags item trackers</a> will finally be released soon. Apple said iOS 14.5 will be released in \"early spring,\" but a specific release date remains unclear. If the Release Candidate version ends up being seeded next week, then iOS 14.5 could be released around Monday, March 29 or Tuesday, March 30.\r\n<br/>\r\n\r\n<br/>\r\nApple could opt to introduce the AirTags and/or other new products with press releases as it did last spring, including updated iPad Pro and MacBook Air models on March 18 and the second-generation iPhone SE on April 15.\r\n<br/>\r\n\r\n<br/>\r\nAt a minimum, Gurman's report this week said AirTags are still \"planned for this year.\"\r\n<br/>\r\n\r\n<br/>\r\nAll in all, while rumors have been all over the map as of late, it seems like there is enough smoke to suggest that at least some new products will be announced within the next six weeks or so. Whether any of the product announcements come in these final days of March or in April, or at an event or otherwise, remains to be seen.<div class=\"linkback\">Related Roundups: <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>, <a href=\"https://www.macrumors.com/roundup/airpods/\">AirPods</a>, <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a></div><div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a></div><div class=\"linkback\">Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#11-iPad-Pro\">11\" iPad Pro (Caution)</a>, <a href=\"https://buyersguide.macrumors.com/#12-9-iPad-Pro\">12.9\" iPad Pro (Caution)</a>, <a href=\"https://buyersguide.macrumors.com/#AirPods\">AirPods (Don't Buy)</a>, <a href=\"https://buyersguide.macrumors.com/#AirPods-Pro\">AirPods Pro (Neutral)</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/18/apple-event-april-rumor-recap/\">Apple Event in April? Recapping the Latest iPad Pro, AirPods, and AirTags Rumors</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-event-in-april-recapping-the-latest-ipad-pro-airpods-and-airtags-rumors.2288783/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ZWUU0Gwtx4U:1ItWaqzcTzs:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ZWUU0Gwtx4U:1ItWaqzcTzs:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ZWUU0Gwtx4U\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"53ad9bc1ba51ae92d40d30966fcf420d5f455511c9f5e808e4b95c71dce6c7ef","category":"Apple"}