{"title":"Ben Pearson: ‘Here’s Why Movie Dialogue Has Gotten More Difficult to Understand’","link":"https://www.slashfilm.com/673162/heres-why-movie-dialogue-has-gotten-more-difficult-to-understand-and-three-ways-to-fix-it/","date":1638586080000,"content":"\n<p>Ben Pearson, writing for Slashfilm:</p>\n\n<blockquote>\n  <p>I used to be able to understand 99% of the dialogue in Hollywood\nfilms. But over the past 10 years or so, I’ve noticed that\npercentage has dropped significantly — and it’s not due to\nhearing loss on my end. It’s gotten to the point where I find\nmyself occasionally not being able to parse entire lines of\ndialogue when I see a movie in a theater, and when I watch things\nat home, I’ve defaulted to turning the subtitles on to make sure I\ndon’t miss anything crucial to the plot.</p>\n\n<p>Knowing I’m not alone in having these experiences, I reached out\nto several professional sound editors, designers, and mixers, many\nof whom have won Oscars for their work on some of Hollywood’s\nbiggest films, to get to the bottom of what’s going on. One person\nrefused to talk to me, saying it would be “professional suicide”\nto address this topic on the record. Another agreed to talk, but\nonly under the condition that they remain anonymous. But several\nothers spoke openly about the topic, and it quickly became\napparent that this is a familiar subject among the folks in the\nsound community, since they’re the ones who often bear the brunt\nof complaints about dialogue intelligibility.</p>\n</blockquote>\n\n<p>I think part of this is a trend that might have been inevitable, as the language of cinema inevitably became the lingua franca of the world. Most people can thoroughly enjoy movies recorded in a foreign language with subtitles. (Have I ever mentioned how fucking much I love Bong Joon Ho’s <em><a href=\"https://www.imdb.com/title/tt6751668/\">Parasite</a></em>? My god, what a masterpiece.) So of course, you can, in theory, enjoy a movie recorded in your own language even if you can’t make out all or even a lot of the dialogue. <em>Trend</em> isn’t even the right word, though — it’s a fad, like <a href=\"http://designishistory.com/1980/ray-gun/\">grunge typography</a> in the 1990s or the bizarre <a href=\"https://theabyssgazes.blogspot.com/2010/03/teal-and-orange-hollywood-please-stop.html\">orange-teal color grading of movies</a> during the 2000s.</p>\n\n<p>But the other factor — which Pearson addresses directly — is the singular influence of Christopher Nolan. Nolan is to mumble-mouthed movie dialogue what David Carson was to illegible typography. Did I buy every issue of Ray Gun? Yes. Do I watch every movie Nolan makes? Yes. But, still, it’s a fad.</p>\n\n<p>The correct answer here is Stanley Kubrick. In the same way the color grading of his films has never seemed dated, no matter the current fad, the audio tracks have not either. You can understand every fucking word every character says. Which makes Nolan’s recent films a bit frustrating, given how amazing a job he did <a href=\"https://daringfireball.net/linked/2018/04/02/2001-50th-anniversary\">supervising the 50th anniversary re-release of <em>2001: A Space Odyssey</em></a>. My gut says Nolan is going to outgrow this.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/12/03/pearson-movie-dialogue\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"53b2da83dd3711ec1cabdf904b79bb1254e9e98dbc62216c2a29b8f07e0ea173","category":"Tech"}