{"title":"The Impact of Wildfire Smoke on Asthma Control in California: A Microsimulation Approach","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024GH001037?af=R","date":1728110343000,"content":"<h2>Abstract</h2>\n<p>Wildfire smoke exposure leads to poorer health among those with pre-existing conditions such as asthma. Particulate matter in wildfire smoke can worsen asthma control, cause acute exacerbations, and increase health resource utilization (HRU) and costs. Research to date has been retrospective with few opportunities to project changes in underlying asthma control and HRU given exposure to wildfire smoke. Using a microsimulation of 5,000 Californians with asthma, we calculated changes in asthma control distribution, risk of exacerbation, and HRU and cost outcomes in the 16 weeks during and after a wildfire. The model was calibrated against empirical values on asthma control distribution and increased HRU after exposure to wildfire smoke. Without smoke exposure, 48% of the cohort exhibited complete or well control of asthma, and 8% required acute healthcare per cycle. Following two consecutive weeks of wildfire smoke, complete or well control of asthma fell to 27%, with an additional 4% HRU. This corresponds to total additional $601,250 in all-cause medical costs and eight fewer quality-adjusted life years over 16 weeks of model time. Our model found increased asthma health and cost burden due to wildfire smoke that were aligned with empirical evidence from a historic wildfire event. This study establishes a framework for a more nuanced understanding of asthma impacts from wildfire smoke that can help inform the development of public health policies to mitigate harm and promote resilience among asthma patients in the face of climate change.</p>","author":"Sigal Maya, \nNeeta Thakur, \nTarik Benmarhnia, \nSheri D. Weiser, \nJames G. Kahn","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"53c89e8a9738b6fc8fe72d78f0c641f60f4f94ccd3fffb4759e43e7b3a992d99","category":"Environment"}