{"title":"Monitoring ecological dynamics on complex hydrothermal structures: A novel photogrammetry approach reveals fine‐scale variability of vent assemblages","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12486?af=R","date":1708528481000,"content":"<h2>Abstract</h2>\n<p>We set out to characterize the fine-scale processes acting on interannual dynamics of deep-sea vent fauna by using a novel approach involving a 5-yr time series of 3D photogrammetry models acquired at the Eiffel Tower sulfide edifice (Lucky Strike vent field, Mid-Atlantic Ridge). Consistently, with the overall stability of the vent edifice, total mussel cover did not undergo drastic changes, suggesting that they have been at a climax stage for at least 25 yr based on previous data. Successional patterns showed consistency over time, illustrating the dynamic equilibrium of the ecological system. In contrast, microbial mats significantly declined, possibly due to magmatic events. The remaining environmental variability consisted of decimeter-scale displacement of vent outflows, resulting from their opening or closure or from the progressive accretion of sulfide material. As a result, vent mussels showed submeter variability in the immediate vicinity of vent exits, possibly by repositioning in response to that fine-scale regime of change. As former studies were not able to quantify processes at submeter scales in complex settings, this pioneering work demonstrates the potential of 3D photogrammetry models for conducting long-term monitoring in the deep sea. We observed that the ability of mussels to displace may enable them to cope with changing local conditions in a stable system. However, the long-term stability of mussel assemblages questions their capacity to withstand large-scale disturbances and may imply a low resilience of these “climax” communities. This suggests that they may be particularly vulnerable to the negative effects of mining activities in hydrothermal ecosystems.</p>","author":"Loïc Van Audenhaege, \nJozée Sarrazin, \nPierre Legendre, \nGarance Perrois, \nMathilde Cannat, \nAurélien Arnaubec, \nMarjolaine Matabos","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"53d221efa321dc9bf67e885fd6c6dcdb0e3bb576a6e72d161737a805a9c7e6b3","category":"Environment"}