{"title":"Cannondale SuperSix Evo CX review: Wickedly quick with brilliant handling","link":"https://cyclingtips.com/2021/11/cannondale-supersix-evo-cx-review-wickedly-quick-with-brilliant-handling/","date":1636561938000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-1-650x366.jpg\" /></div><h2>Cannondale SuperSix Evo CX review: Wickedly quick with brilliant handling</h2><p>    </p><div>\n        <div>\n\t\t\t                <h2>Story Highlights</h2>\n\t\t\t\n\t\t\t                <ul>\n\t\t\t\t\t                        <li><strong>What it is:</strong>Cannondale’s all-around semi-aero carbon road racer, reimagined as a big-tired cyclocross and gravel speedster.</li>\n\t\t\t\t\t                        <li><strong>Frame features:</strong>Moderately aero modular monocoque molded carbon fiber construction, clearance for 700×45 mm tires and 2x cranks, Ai asymmetrical rear end, PF30-83 Ai press-fit bottom bracket shell, SpeedRelease-compatible dropouts.</li>\n\t\t\t\t\t                        <li><strong>Weight:</strong>1,000 g (56 cm frame only, claimed); 8.38 kg (18.47 lb) without pedals, size 51 cm.</li>\n\t\t\t\t\t                        <li><strong>Price:</strong> US$4,000 / AU$5,600 / £3,800 / €4,200.</li>\n\t\t\t\t\t                        <li><strong>Highs:</strong>Quick handling blended with excellent stability, superb pedaling and front-end stiffness, decent ride quality, sleek aesthetics.</li>\n\t\t\t\t\t                        <li><strong>Lows:</strong>Asymmetrical design and wide Q-factor will be dealbreakers for many, creaky bottom bracket, slow-engaging rear hub, no fender mounts, proprietary seatpost.</li>\n\t\t\t\t\t                </ul>\n\t\t\t        </div>\n    </div>\n\n\n\n\n<h2>SuperSix Evo technology hits the dirt</h2>\n\n\n\n<p>Two years ago, Cannondale introduced a new semi-aero all-around road racing bike called the <a href=\"https://cyclingtips.com/2019/06/2020-cannondale-supersix-evo-details-models-prices-weights-tech-first-ride-review/\" target=\"_blank\">SuperSix Evo</a>, complete with truncated-airfoil carbon fiber tube shapes, fully hidden cabling, a dedicated bar-stem combo, and a sleekly hidden seatpost binder. </p>\n\n\n\n<p>This is not that bike. Cannondale’s naming conventions are pretty confusing these days, so allow me to explain things a little first.</p>\n\n\n\n<p>In addition to that SuperSix Evo road bikes, there’s now also the <a href=\"https://cyclingtips.com/2021/08/the-superx-is-done-cannondale-reveals-supersix-evo-se-and-cx-bikes/\" target=\"_blank\">SuperSix Evo CX and SuperSix Evo SE</a>, which are intended to be Cannondale’s premier cyclocross and gravel race bikes. Tube shapes are derived almost directly from the road-going SuperSix Evo — hence the related name — and although these bikes have different missions, they’re built around identical framesets, differing solely in component spec.</p>\n\n\n\n<p>Despite being aimed at gravel, the SuperSix Evo SE is not to be confused with <a href=\"https://cyclingtips.com/2019/08/cannondale-topstone-carbon-long-term-review-a-superb-ride-a-few-quirks/\" target=\"_blank\">the Topstone Carbon</a>, a gravel bike that Cannondale introduced in 2019. Whereas the Topstone is meant to be more of an all-rounder with a smoother ride and somewhat toned-down personality, the newer SuperSix Evo SE is for gravel <em>racing</em> — but yet the SuperSix Evo SE fits 700×45 mm tires as compared to the Topstone Carbon’s 700×40 mm max, which also makes the “racing” bike more capable.</p>\n\n\n\n<p>Got it? Good.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-5-1340x754.jpg\" /><figcaption>That impressive tire clearance and outstanding geometry don’t come without some downsides.</figcaption></figure>\n\n\n\n<p>Confusion aside, the SuperSix Evo CX/SE looks good on paper. Going along with the sleek medium-aero tube shaping is Cannondale “OutFront” frame geometry. One key aspect of the OutFront concept is a longer front center and top tube to help push the front wheel further out for more confidence and stability when things get steep downhill or slippery. However, that’s paired with a somewhat quick 62-69 mm trail figure, an unusually short 422 mm-long rear end, and a relatively high 68-70 mm bottom bracket drop in an attempt to provide agile handling together with better-than-expected stability.</p>\n\n\n\n<p>Producing a frame with those sorts of numbers is relatively straightforward. However, doing that together with clearance for the aforementioned 700×45 mm gravel tires and common dual-chainring cranksets is more difficult. In fact, Cannondale has had to resort to somewhat extreme measures to get there, namely its controversial Ai (Asymmetric Integration) asymmetrical rear end. </p>\n\n\n\n<p>When you look at most gravel bikes, there just isn’t a whole lot of room between the tire and chainring, which is why we see things from many brands like dropped chainstays or very thin chainstay sections that are solid instead of hollow. On the SuperSix Evo CX/SE, Cannondale sort of avoids the issue entirely by pushing the entire drivetrain outward by 6 mm to create more space. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-9-1340x754.jpg\" /><figcaption>Hub spacing is the standard 142 mm, but not every wheel can be redished to fit the proprietary rear end. On paper, it makes a ton of sense. But from a practical standpoint, there are definitely some headaches involved.</figcaption></figure>\n\n\n\n<p>Not surprisingly, there are some peculiarities that go along with this.</p>\n\n\n\n<p>The rear hub spacing is 142 mm as usual, but because both dropouts are also moved toward the driveside by the same 6 mm to maintain proper drivetrain alignment, the wheel is no longer centered between the hub end caps. On the plus side, this results in more even spoke tensions on either side of the rear wheel than usual. However, it also generates some potential compatibility headaches since not every off-the-shelf wheel can be redished to work (custom wheels obviously won’t be an issue). </p>\n\n\n\n<p>Since an asymmetrical crankset would be anatomically unacceptable, Cannondale just widens the bottom bracket on both sides to make sure everything lines up. The <a href=\"https://cyclingtips.com/2018/09/bottom-bracket-crank-axles-bearings-compatibility/\" target=\"_blank\">PF30-83 Ai press-fit shell</a> is 10-15 mm wider than most other shells on the market, and requires a specific spindle (and crankset in many cases). In addition to the compatibility complications, the pedal stance width (often referred to as the Q-factor) increases as you’d expect, which not everyone will like.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-11-1340x754.jpg\" /><figcaption>Going along with that asymmetrical rear end is a wider-than-typical bottom bracket shell, complete with press-fit bearings.</figcaption></figure>\n\n\n\n<p>Nevertheless, Cannondale feels the benefits of the Ai system justify the downsides.</p>\n\n\n\n<p>Although the SuperSix Evo CX and SE share the same framesets, the build kits are somewhat specific to the intended discipline. </p>\n\n\n\n<p>The gravel-focused SE is the more expensive of the two, outfitted with a SRAM Rival eTap AXS wireless electronic 2×12 groupset, DT Swiss CR 1600 Spline tubeless aluminum wheels, and 40 mm-wide Vittoria Terreno Dry tires. </p>\n\n\n\n<p>Alternatively, there’s the more cyclocross-oriented SuperSix Evo CX, equipped with a SRAM Force 1 1×11 mechanical groupset and a more pedestrian wheelset built with DT Swiss R470 db pinned aluminum rims and Formula hubs, wrapped with 33 mm-wide (and UCI-legal) Vittoria Terreno Mix tires. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-4-1340x754.jpg\" /><figcaption>The sparkly blurple paint is bright and eye-catching. The contrasting battleship grey? Not so much. It’s an interesting combo.</figcaption></figure>\n\n\n\n<p>Whichever way you go, cable routing is refreshingly external up front, running from underneath the bar to a port on top of the down tube or a hole in the fork crown. It’s internal otherwise, and blissfully easy to adjust and service the front end as a result.</p>\n\n\n\n<p>For our purposes, the more versatile SuperSix Evo SE would be the clear choice in a test bike, but a sample unfortunately wasn’t available in time for our Field Test event. Instead, we brought in a SuperSix Evo CX and swapped the skinny Vittorias for a set of 45 mm-wide WTB Riddlers (a <a href=\"https://cyclingtips.com/2019/11/ten-products-i-loved-in-2019-james-huang/\" target=\"_blank\">long-time favorite tread</a> for our local conditions) to see what this thing could really do. </p>\n\n\n\n<p>Total weight on our 51 cm test sample in stock condition was 8.38 kg (18.47 lb) without pedals or accessories.</p>\n\n\n\n<h2>Rally car personality</h2>\n\n\n\n<p>While some gravel bikes are content to just cover a wide range of surface conditions capably and deliberately, the SuperSix Evo CX/SE just wants to <em>go </em>— preferably very quickly, and right now. Its personality is more caffeine than Valium, more wound-up puppy than lazy older dog. Much as the name suggests, as it turns out, it’s essentially a road racing bike with fat tires, or put another way, a fairly traditional-feeling cyclocross bike with more versatility.</p>\n\n\n\n<p>It’s notably stiff from end to end, with superb pedaling responsiveness down below and precise handling up front, and immediate reactions to any sort of input in general. It feels taut and eager and offers all sorts of tactile feedback in terms of what the tires are doing at the ground. It’s a visceral machine, not an isolation chamber.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-21-1340x754.jpg\" /><figcaption>The seat tube is scalloped on the back side to boost tire clearance.</figcaption></figure>\n\n\n\n<p>The handling is particularly good. That longer front end easily shrugs off a minor slide if you head into a corner with a little too much enthusiasm, and also provides more confidence if you’re tackling a bit of singletrack and have to navigate some sketchier downhills. At higher speeds, it even feels reassuringly planted even with that somewhat tall bottom bracket.</p>\n\n\n\n<p>The SuperSix Evo CX/SE isn’t just about brutally barreling forward, though, as the relatively short trail dimension and stubby stem still keeps things impressively nimble in terms of steering. The bars are light in your hands (in a good way) and the front wheel is quick to change direction when asked to do so. Further adding to that sense of agility is the short rear end, which follows the front with less delay than you’d expect of a typical gravel bike. </p>\n\n\n\n<p>Despite that longer front end, the bike’s low-speed manners are still excellent since the total wheelbase is pretty tidy. And even in this smaller 51 cm we tested and when maxing out the official tire clearance, toe overlap is almost completely a non-issue, which comes in handy in especially tight confines.</p>\n\n\n\n<p>Taken in total, the SuperSix Evo CX/SE offers a magical combination of stability and agility that is so often sought, but more rarely achieved. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-geometry-1340x754.jpg\" /><figcaption>In case you’re wondering, the geometry between the SuperSix Evo CX and SuperSix Evo SE are exactly the same. Photo: Cannondale.</figcaption></figure>\n\n\n\n<p>In keeping with that race bike personality and road racer-derived tube shapes, ride quality is about what you’d expect: more firm than cushy. The proprietary D-shaped carbon seatpost seems to help a tad in that regard, but the SuperSix Evo CX/SE relies heavily on the tires for rider comfort — something we confirmed when switching back to the stock 33 mm-wide Vittorias. It’s not overly objectionable, but the SuperSix Evo CX/SE maybe wouldn’t be my first choice for an all-day adventure on rougher unpaved roads, and doesn’t feel as smooth as the back end of Cannondale’s Topstone Carbon. </p>\n\n\n\n<p>Versatility isn’t high on the list of the SuperSix Evo CX/SE’s priorities, either. </p>\n\n\n\n<p>There are only two bottle mounts (you don’t even get a third mount on the underside of the down tube), no top tube feed bag mounts, and no fittings on the fork blades. And if you want to do some riding in inclement weather, make sure you’re ok with getting wet since there are no fender mounts to be found. </p>\n\n\n\n<h2>Spec notes</h2>\n\n\n\n<p>Cannondale arguably missed a prime marketing opportunity with the SuperSix Evo CX/SE. That press-fit bottom bracket made so much noise right from the start that it almost seems like the bike should have come with some branded headphones to drown out the din (or at least a bottle of sleeve retaining compound and some tools). I maintain my position that the <em>concept </em>of press-fit bottom brackets isn’t inherently objectionable, but when the execution <s>looks</s> sounds like this, it makes me wish pretty hard that Cannondale had considered something like the T47 threaded standard, which would have added a bit of weight, but otherwise wouldn’t have changed any of the frame’s features, dimensions, or crank compatibility. </p>\n\n\n\n<p>That noise obviously doesn’t affect how the bike performs, but it was certainly very distracting.</p>\n\n\n\n<p>The crankset’s solid-forged aluminum arms also aren’t as light or fancy as Cannondale’s higher-end models, which use a bonded clamshell construction, but most people aren’t likely to care once they gaze upon that striking Spidering one-piece machined narrow-wide chainring. The wider Q-factor is harder to ignore, though. Of course, not every rider will notice this (particularly ones that spend a lot of time on mountain bikes), but those that are a little more in tune with their fit might feel like they’re riding a horse instead of a gravel bike.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-30-1340x754.jpg\" /><figcaption>The Cannondale One crankset doesn’t use the fancy two-piece bonded construction of the company’s higher-end model, but it’s still pretty light – and it looks fantastic.</figcaption></figure>\n\n\n\n<p>The rest of the drivetrain was about what I expected from SRAM’s aging — yet still capable — Force 1 1×11 mechanical groupset. Shift action is firm and highly tactile, and chain movement is consistent and quick, if a little clunky as compared to the company’s fancier electronic setups. Gear range seems spot-on for cyclocross, but a bit narrow for most gravel situations (which is fine considering this is supposed to be a ‘cross bike, after all). And while I know there are a lot of people who don’t care for the aesthetics of the oversized hoods, what I care about more is that they’re comfortable and secure in my larger hands.</p>\n\n\n\n<p>I’d love to see groupset updated with a wider gearing range, and maybe even compatibility with the 12-speed drivetrain bits SRAM uses on its latest electronic gearing options. Perhaps it’s true that mechanical drivetrains have fallen out of favor with buyers in this price range, but I’d argue there’s a strong case to be made for a good, reliable groupset that’s relatively inexpensive to buy and maintain, and easy to service, too. </p>\n\n\n\n<p>The hydraulic disc brakes are the same as they’ve ever been, offering ample power with very good modulation and lever feel. They do tend to squeal when wet, but that’s more or less par for the course when it comes to disc brakes with most stock pads. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-32-1340x754.jpg\" /><figcaption>SRAM’s Force 1 transmission debuted back in 2015, but it still works well, and the hyper-tactile nature of the shifter makes it an excellent choice for cyclocross.</figcaption></figure>\n\n\n\n<p>As I seem to be finding more often than I’d like these days, the wheels are thoroughly underwhelming. The DT Swiss R470 db aluminum rims are perfectly ok, though it’s disappointing to see pinned joint seams instead of welded ones in a bike that costs as much as this one does (retail price on these rims is a humble US$57 apiece). The 20 mm internal width is appropriate for the intended cyclocross use — the DT Swiss CR 1600 Spline on the SuperSix Evo SE is more generous at 23 mm — and although it’s compatible with tubeless tires, you’ll have to supply the sealant, valve stems, and airtight rim tape.</p>\n\n\n\n<p>But it’s the hubs that feel just plain cheap. They’re supplied by OEM specialist Formula, and the freehub mechanism is not only very slow to engage, but also feels vague when it eventually does. This bike deserves better.</p>\n\n\n\n<p>As for the finishing kit, it’s all just fine. I’m personally not a huge fan of the Fabric saddle (it’s too rounded and narrow for my liking), but the two-bolt seatpost is easy to adjust and holds tight. Likewise, the stock aluminum bar and stem are nothing special, but Cannondale has included an agreeable bend. And since the cockpit components are totally standard bits, it’s easy to make adjustments or swap individual parts as you see fit. </p>\n\n\n\n<h2>Final thoughts</h2>\n\n\n\n<p>For performance riding in mixed conditions — and yes, also for proper cyclocross situations — the SuperSix Evo CX/SE was one of our favorites in the test for its ability to straddle multiple genres. Much like the <a href=\"https://cyclingtips.com/2020/04/cervelo-aspero-long-term-review/\" target=\"_blank\">Cervelo Aspero</a>, the SuperSix Evo CX/SE might not be the most capable or most comfortable all-conditions machine, but it does a much better job than most at pulling double duty as a proper road and gravel bike (albeit with a change of tires and/or wheels). And while the Aspero shares a similar geometry concept, the SuperSix Evo CX/SE arguably takes it one step further, and with more tire clearance to boot.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-3-1340x754.jpg\" /><figcaption>Is the juice worth the squeeze? That’s a tricky question to answer.</figcaption></figure>\n\n\n\n<p>That said, is that slight improvement in geometry and clearance over something like the (far more conventional) Aspero enough to justify the unusual asymmetric design? If you’re the type of rider that just buys a bike and leaves it alone, then the compatibility issues of the Ai design aren’t likely to bother you. But otherwise, that unusually dished rear wheel, the special crank, that proprietary seatpost… the SuperSix Evo CX/SE is fantastic in so many ways, but it still might just be a bit too much long-term.</p>\n\n\n\n<p>More information can be found at <a href=\"https://www.cannondale.com/en-us/bikes/road/cyclocross/supersix-evo-cx\" target=\"_blank\">www.cannondale.com</a>.</p>\n\n\n<p>    </p><div>\n    <div>\n\tWant more bike tests? Be sure to check out the rest of the content from the <a href=\"https://cyclingtips.com/tag/2021-cyclingtips-field-test-2/\" target=\"_blank\">our latest Field Test event</a>, and be sure to subscribe to <a href=\"https://www.youtube.com/channel/UCCdLCWglf1cUKQ0R7eMFiTQ\" target=\"_blank\">our YouTube channel </a>so you don’t miss any of the associated videos, either.    </div>\n    </div>\n\t<p></p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-2-1340x754.jpg\" /><figcaption>The SuperSix Evo CX is technically a cyclocross bike based on Cannondale’s description, but it’s the exact same frameset as the SE gravel bike.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-6-1340x754.jpg\" /><figcaption>This SuperSix Evo CX uses the same exact frame as the SuperSix Evo SE, which isn’t the same as the regular SuperSix Evo. Confused? Don’t feel bad. It’s super confusing.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-7-1340x754.jpg\" /><figcaption>The dropped seatstays supposedly improve the ride quality by allowing the seat tube to flex more on bumps than usual.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-8-1340x754.jpg\" /><figcaption>So how did Cannondale manage all that tire and drivetrain clearance into such a short rear end? By offsetting the drivetrain and rear hub to the driveside by 6 mm.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-10-1340x754.jpg\" /><figcaption>Cannondale says the SuperSix CX and SE can handle tires up to 700×45 mm-wide – which it easily does.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-12-1340x754.jpg\" /><figcaption>The shape of the head tube suggests that Cannondale at least considered the idea of a more integrated-looking front end. I’m glad they didn’t go through with it.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-13-1340x754.jpg\" /><figcaption>The tube shaping is very closely related to the road-going SuperSix Evo.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-14-1340x754.jpg\" /><figcaption>The lines are super clean.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-15-1340x754.jpg\" /><figcaption>Lovely.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-16-1340x754.jpg\" /><figcaption>The down tube sports a pseudo-aerodynamic profile.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-17-1340x754.jpg\" /><figcaption>Routing is partially external using Cannondale’s interchangeable port system.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-18-1340x754.jpg\" /><figcaption>The hidden seatpost binder is well done, and mostly shielded from the elements.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-19-1340x754.jpg\" /><figcaption>Two bottle mounts are included in the usual positions, with both high and low options for the down tube bottle.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-20-1340x754.jpg\" /><figcaption>Sorry, folks, there isn’t a third bottle mount on the underside of the down tube if you’re interested in heading out for a longer day.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-22-1340x754.jpg\" /><figcaption>The D-shaped profile in the seatpost and seat tube presumably improves the bike’s aerodynamic performance, but it also makes the seatpost flexier for a more comfortable ride.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-23-1340x754.jpg\" /><figcaption>Although the naming convention is confusing, you can see why Cannondale decided to share the “SuperSix Evo” moniker with both this and the roadgoing model.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-24-1340x754.jpg\" /><figcaption>The fat chainstays suggest a snappy rear end under power – and the bike delivers.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-25-1340x754.jpg\" /><figcaption>The chunky carbon fiber fork looks like it’d be brutal to ride, but it’s actually not bad at all.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-26-1340x754.jpg\" /><figcaption>Tidy cable routing.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-27-1340x754.jpg\" /><figcaption>The stock wheelset is perfectly fine for cyclocross, though hardly noteworthy.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-28-1340x754.jpg\" /><figcaption>Remember when you thought 33 mm-wide cyclocross tires were wide? Maxing out the tire clearance with 45 mm-wide rubber dramatically increased the bike’s capabilities off-road.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-29-1340x754.jpg\" /><figcaption>Lots and lots of clearance. Granted, these are just 33 mm-wide knobbies for UCI-sanctioned ‘cross races, but you can still see how easily a 45 mm-wide gravel tire would fit in here.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-31-1340x754.jpg\" /><figcaption>Sorry, folks, it’s just solid-forged aluminum arms here.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-33-1340x754.jpg\" /><figcaption>The stock gearing on this particular model is a little tight for proper gravel use, but it’s not really a fair criticism since the SuperSix Evo CX is technically aimed at cyclocross.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-34-1340x754.jpg\" /><figcaption>The splatter paint job was very well received.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-35-1340x754.jpg\" /><figcaption>Cannondale outfits both ends with Mavic SpeedRelease-compatible thru-axles, but since the hubs aren’t designed for them so you don’t quite get the full benefit.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-36-1340x754.jpg\" /><figcaption>More splatter. More goodness.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-37-1340x754.jpg\" /><figcaption>Yes to the sparkle!</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-38-1340x754.jpg\" /><figcaption>The bars have a compact bend and long extensions on the drops, both of which work well for the intended use.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-39-1340x754.jpg\" /><figcaption>It’s a plain forged aluminum stem, but it gets the job done, it’s light, and it’s easy to work on.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-40-1340x754.jpg\" /><figcaption>The stock bar tape is wonderfully grippy.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-41-1340x754.jpg\" /><figcaption>The scallop in the seatpost is intended to further promote flex on bumps. Does it work? Hard to say, but the bike is noticeably comfortable.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Cannondale-SuperSix-Evo-CX-SE-review-42-1340x754.jpg\" /><figcaption>Want to run a front derailleur? Have at it.</figcaption></figure></li></ul></figure>\n\n\n\n<hr />\n\n\n\n<p><em>Our Field Test group bike tests are by no means paid events, but they’re still only possible with some outside support. CyclingTips would like to thank the following sponsors for this round of the Field Test:</em></p>\n\n\n\n<ul><li><em><a href=\"https://www.rudyproject.com/\" target=\"_blank\">Rudy Project</a></em></li><li><em><a href=\"https://www.pearlizumi.com/\" target=\"_blank\">Pearl Izumi</a></em></li><li><em><a href=\"https://sierranevada.com/\" target=\"_blank\">Sierra Nevada Brewing Company</a></em></li><li><em><a href=\"https://leadoutgear.com/\" target=\"_blank\">Lead Out Gear</a></em></li><li><em><a href=\"https://www.parktool.com/\" target=\"_blank\">Park Tool</a></em></li></ul>\n<p></p><a href=\"https://cyclingtips.com/2021/11/cannondale-supersix-evo-cx-review-wickedly-quick-with-brilliant-handling/\">Read More</a>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"53d5410237ff181227ce1670885139de16a5d69e21c512b14177e1612b9095f9","category":"Cycling"}