{"title":"ทำยังไงให้หายกลัวงู","link":"https://iannnnn.com/2020/2725","date":1584381976000,"content":"<blockquote><p>“พ่อๆๆ งูมาบ้านเราอีกแล้ว”</p></blockquote>\n\n\n\n<p>นิทานเปิดประตูเข้ามาปลุกผมตื่นนอนตอนเช้าด้วยน้ำเสียงดีใจ… ใช่ครับ ดีใจ นั่นเป็นเพราะลูกๆ รู้ว่าพ่ออยากเจองูแบบใกล้ๆ อีกสักครั้ง</p>\n\n\n\n<p>ก่อนหน้านี้มีงูเขียวหางไหม้มาเที่ยวบ้าน ขดตัวสวยงามอยู่ที่โรงรถ เสียดายที่ตอนนั้นผมไม่อยู่บ้าน เลยไม่ได้เจอเอง แต่กล้องแม่บ้านก็ถ่ายติดเงามาอย่างสวยเลย</p>\n\n\n\n<figure><div>\nhttps://twitter.com/iannnnn/status/1194095850370281472\n</div></figure>\n\n\n\n<p>และก่อนหน้านั้นอีก ตอนที่บ้านเพิ่งสร้างเสร็จใหม่ๆ ช่างก่อสร้างได้ทิ้งท้ายไว้ก่อนเก็บข้าวของออกไปว่า “ผมเจองูเห่าโผล่หัวมาในท่อระบายน้ำหน้าบ้าน พี่ระวังๆ หน่อยละกัน” โอ้โห ขอบคุณมาก ชีวิตกูต่อจากนี้คงแฮปปี้มากๆ </p>\n\n\n\n<p>ถัดจากรั้วบ้านผมคือที่ดินรกร้าง มีต้นไม้ขึ้นปกคลุม ถัดออกไปไม่ไกลก็เป็นดงธูปฤาษีขนาดใหญ่ ก็เป็นที่รู้กันว่าถ้ามาแนวนี้สัตว์เลื้อยคลานเพียบแน่ๆ นอกจากงูแล้ว ก็เคยเจอเหี้ยตัวใหญ่เหี้ยๆ</p>\n\n\n\n<p>ถึงผมจะเติบโตมาจากต่างจังหวัด อยู่ไร่นาสวนมาตั้งแต่เด็กๆ ญาติโยมเห็นงูทีไรก็ฟาดถึงตายทุกครั้งไป แยกไม่ออกทั้งสิ้นว่าตัวไหนมีพิษไม่มีพิษ ถ้าเป็นงู = ตีตายทั้งหมด นั่นทำให้ตัวเองมีความรู้สึกแอนตี้งูอยู่ไม่น้อย ถึงจะไม่ได้กลัวเวอร์ลนลาน แต่ความกลัวก็มีอยู่ เพราะเกิดจากความไม่รู้ ว่าตัวไหนดุ ตัวไหนมีพิษ ตัวไหนกัดตาย ตัวไหนน่ารัก</p>\n\n\n\n<p>ความกลัวเกิดจากความไม่รู้ ก็รู้ซะ จะได้ไม่กลัว</p>\n\n\n\n<p>พอมีลูกเล็ก แถมยังเปิดร้านคาเฟ่ที่มีสวน มีต้นไม้เต็มไปหมด (โฆษณา: <a href=\"https://nitan.cafe\">นิทานคาเฟ่</a>) สิ่งที่ควรทำก็คือ ทำความรู้จักสิ่งมีชีวิตพวกนี้ เผื่อวันนึงจะได้เข้าใกล้ แยกแยะ และหาวิธีจัดการ โดยไม่ได้หลับหูหลับตาตีให้ตายเพราะความกลัวเหมือนที่เจอมาแต่เด็ก</p>\n\n\n\n<p>คือก่อนอื่นต้องปรับทัศนคติตัวเองก่อนว่า การเจองู ไม่ใช่ว่าจะต้องตีให้ตายเท่านั้น มันยังมีวิธีอื่นๆ เช่น ไล่ให้ไปไกลๆ หรือเรียกเจ้าหน้าที่มาจับได้ด้วย</p>\n\n\n\n<figure><div>\n\n</div><figcaption>คลิปนี้ถ่ายไว้สิบกว่าปีก่อน สมัยที่วิดีโอยัง 240p <a href=\"https://iannnnn.com/2008/369\">เขียนบล็อกไว้ด้วย</a></figcaption></figure>\n\n\n\n<p>ด้วยความสนใจที่สะสมมานาน แต่เพิ่งอยากรู้จริงจังก็ตอนที่โดน<a href=\"https://twitter.com/iannnnn/status/1069081076448935936?s=20\">งูปริศนาเลื้อยข้ามหัว</a>ตอนเดินใต้ต้นไม้ที่จันทบุรี T-T เลยต้องรู้จักมันให้ได้ละ ไม่งั้นชีวิตจากนี้จะไม่มีสุขแน่ๆ </p>\n\n\n\n<p>ผมเลยกดเข้า 2 คอมมูนิตี้นี้</p>\n\n\n\n<ul><li><a href=\"https://www.facebook.com/groups/VenomousAndOtherSnakesOfSiam/?ref=group_header\">งูไทย…อะไรก็ได้ all about Thailand snakes</a></li><li><a href=\"https://www.facebook.com/groups/908415245857501/?ref=group_header\">งูไทยทั่วราชอาณาจักร – Snakes of Thailand (~อาณาจักรงูไทยในแดนสยาม~)</a></li></ul>\n\n\n\n<p>ทั้งคู่เป็นกรุ๊ปสนทนาถามตอบเกี่ยวกับงูไทย ใครเจองูก็เข้าไปโพสต์ภาพถามชนิดและสรรพคุณได้ บางทีเจอแค่ซาก เสี้ยวเกล็ด หรือคราบงูชิ้นเล็กๆ หรือคลิปเบลอๆ เอาไปถามปั๊บ มีดันคนตอบได้ด้วย! กลายเป็นมิชชันที่แต่ละคนจะอยากหางูเพื่อเอาไปโพสต์อวดกันว่าเจอ ตลกดี</p>\n\n\n\n<p>นอกนั้นก็เป็นแหล่งความรู้เกี่ยวกับงู โดยเฉพาะงูพิษ มีทั้งแบบข้อความ ภาพนิ่ง และคลิปวิดีโอ ที่ผมติดตามและแนะนำก็มีดังนี้:</p>\n\n\n\n<ul><li><a href=\"https://www.facebook.com/thailandsnakescloseencounters/\">งูพิษชิดใกล้ Thailand Snakes : Close Encounters</a></li><li><a href=\"https://www.youtube.com/channel/UCpbFY4dnqlBUYgL7nGWi65Q\">Nick Chomngam</a> ของคุณนิค นักล่างูที่ทำแชนเนลยูทูบได้ดีมากๆ ห้าดาว</li><li><a href=\"https://www.facebook.com/snakewrangler199/\">Snake Wrangler by Pinyo</a> คุณภิญโญ อาสาสมัครและวิทยากรนักจับงูที่มาดนุ่มโคตรๆ งูที่โดนแกจับคงมีความสุข</li></ul>\n\n\n\n<p>ก็พอทำให้มีความรู้และความเข้าใจ (ที่หมายถึงเข้าใจงู) เพิ่มเติมอีกหลายอย่าง เท่าที่นึกออกตอนเขียนบล็อกนี้เลยก็ เช่น</p>\n\n\n\n<ul><li><strong>งูเห่ามีเวอร์ชันพ่นพิษด้วย:</strong> เอาแค่ไม่พ่นก็น่ากลัวจะตายอยู่แล้ว แล้วนี่พ่นได้ไกลเป็นวาๆ ถ้าโดนก็ตาบอด (มีหมาตาบอดเยอะเลยเพราะเจออีพวกนี้) สังเกตจากดอกจันข้างหลังคอ น้องจะไม่มีโลโก้ (ไม่ทุกตัวนะ เพราะมีการแปรผันของสีของลายด้วย) แต่ถ้าไม่ทันสังเกต หรือยังไม่โปร ก็ให้โกย โทรเรียกเจ้าหน้าที่มาช่วยจับดีกว่า</li><li>งูเห่าสนใจแต่สิ่งเคลื่อนไหวที่อยู่ตรงหน้าเท่านั้น มันมองด้านหลังหรือด้านบนไม่ได้ และมันโง่มาก สมองโปรแกรมให้เกิดมาเพื่อเลื้อย ฉก กินเท่านั้น ไม่มีดราม่าอื่นๆ หยุมหยิม นักจับงูก็อาศัยสรรพคุณนี้จับมันจนดูเหมือนง่ายไปปะพี่…</li><li>เจ้าหน้าที่ที่ว่าก็คืออาสากู้ภัย หรือเจ้าหน้าที่ดับเพลิงก็ได้ ถ้าอยู่กรุงก็โทรเข้า กทม.ได้แหละมั้ง เดี๋ยวเขาประสานงานต่อให้</li><li><strong>งูหลามต่างจากงูเหลือมยังไง:</strong> ถ้าดูง่ายๆ คืองูหลามมีแพตเทิร์นเหมือนยีราฟ ยังกะไปเอาคอยีราฟมาเติมหัวเติมหางเป็นงู และใจเย็น น่ารักกว่างูเหลือมจอมดุ</li><li><strong>งูที่เรากลัวที่สุดคืองูกะปะ:</strong> หลายคนเรียกว่ากับระเบิดแห่งสวนยาง คือภาคใต้จะมีงูชนิดนี้อยู่เยอะ แล้วมันจะขดตัวเล็กๆ (ตัวมันเล็กมากนะ) นอนนิ่งๆ พรางตัวกลมกลืนกับใบไม้แห้ง เหมือนหลับ แต่ถ้าเข้าใกล้ถึงรัศมีโจมตี มันจะฉกเร็วมาก! ที่สำคัญคือพิษแรงมาก ถึงตาย หรือสูญเสียอวัยวะถ้ารักษาไม่ทัน</li><li><strong>ลูกงูพิษโหดๆ:</strong> เช่นพวกงูเห่างูจงอาง ถึงแม้จะยังเด็ก แต่พิษก็แรงพอที่จะฆ่าเราตายได้เหมือนกันนะ แล้วลูกงูจงอางดันตัวลายๆ ดูไม่รู้ว่าเหมือนพ่อแม่มัน ต้องระวัง (จงอางอยู่ภาคใต้เป็นส่วนใหญ่ ภาคนี้ทำไมงูเยอะจังวะ)</li><li>หมาแมวที่เห็นมันสู้งูพิษน่ะ มันเป็นสัญชาตญาณติดตัวของนักล่า ไม่ใช่ทุกตัวจะเก่ง ปราบงูได้ เจ้าเป็นฮีโร่อะไรนะ แต่ถ้าเป็นไปได้ อย่าให้มันเจอกันเลย งูตาย เผลอๆ หมาแมวก็ตายบ่อยไป</li><li><strong>งูทะเลเกือบทุกชนิดพิษอันตรายมาก</strong>: ถ้าจำไม่ผิดคือไม่มีเซรุ่มด้วย แต่เราจะไม่ค่อยได้เจอมัน มีแค่<a href=\"https://www.youtube.com/watch?v=ms3Tm0It6KE\">งูผ้าขี้ริ้ว</a>เท่านั้นที่ไม่มีพิษ แถมยังตัวอ้วนๆ ป้อมๆ น่ารักงุ้ยๆ ถ้าโดนจับก็จะขดตัวเป็นผ้าขี้ริ้ว ชาวประมงเห็นก็ชอบ เอามาเลี้ยง</li><li><strong>งูรัดกัน:</strong> ถ้าเห็นมันควงกันแข่งกันชูคอไหวๆ คือมันสู้กัน ไม่ใช่เลิฟซีนงู</li><li><strong>งูสิง:</strong> เจอได้บ่อย หน้าตาผิวพรรณมีหลายแบบด้วย บางเวอร์ชันไปคล้ายงูจงอาง บางเวอร์ชันคล้ายงูเห่า เพียงแต่งูสิงเป็นงูง่ายๆ ไม่มีพิษสง อย่าตีน้องเลย (วิธีสังเกตเบื้องต้นคือ ตัวมันจะยาวๆ เรียวๆ หางยาวมากเลย ไม่เหมือนน้องเห่าที่หางจะตุ้นๆ)</li><li><strong>ทับสมิงคลาก็พิษโหด:</strong> แล้วดันหน้าตาคล้ายกับงูซื่อๆ น่ารักๆ อย่างปล้องฉนวนลาว ตอนนี้สกิลเรายังดูไม่ออก แต่เคยดูคลิปที่มีคนไปกางเต็นท์บนภูสักภู แล้วมัวแต่กินเหล้าหน้าเต็นท์ ไม่ได้สังเกตว่ามีงูเลื้อยเข้าไปในช่องซิป สรุปคือนอนอุ่นกกงูทั้งคืน ตื่นมาตอนเช้าถึงได้รู้ว่ามีมัจจุราชนอนอยู่ด้วย!</li><li><strong>งูที่นิสัยน่ารักสุดๆ</strong>: คืองูเขียวปากจิ้งจก, เขียวปากแหนบ, งูก้นขบ ลองเอาชื่อไปค้นดูนะครับ น้องๆ ตัวเล็ก ไม่เป็นพิษเป็นภัยกับคน คือ(แทบ)ไม่กัดเลยก็ว่าได้ ถ้าใจถึงคือจับได้เลย นิสัยยังกะกิ้งก่า แล้วอย่างงูก้นขบนี่กินงู(อื่น)ด้วย อยากจะเลี้ยงไว้เฝ้าสวนสักฝูง</li><li>มีงู 14 ชนิดเป็นสัตว์คุ้มครองตาม พ.ร.บ. ดังนั้นเขาเลยไม่จับ-ไม่เลี้ยง เดี๋ยวโดนจับ</li><li>ฯลฯ (นึกออกเท่านี้ก่อน)</li></ul>\n\n\n\n<p>พอได้รู้จักและซึมซับทัศนคติต่องู ก็รู้สึกเป็นบวกมากขึ้น ไม่ได้กลัวงูแบบส่งเดชอีกแล้ว ลบล้างความคิดสมัยก่อนที่เคยคิดว่ามันกัดทุกตัว ดุทุกตัว เป็นบางชนิดเท่านั้นที่เวลสูงกว่าเรา เราก็จะค่อยกลัวมัน</p>\n\n\n\n<p>และมีนิสัยประหลาดเกิดขึ้นหนึ่งอย่าง คืออยากเจองู ยิ่งตัวสวยๆ หรือสถานการณ์เท่ๆ จะได้เอาไปโพสต์ ได้สัก 10 ไลก์ก็ดีใจแล้ว (เสพติดโซเชียลนี่เรา)</p>\n\n\n\n<hr />\n\n\n\n<p>ตัดภาพกลับมาเป็นวันนี้ช่วงเช้า พอลูกปลุกปั๊บ เราก็งัวเงียๆ แต่พอได้ยินคำว่างูเลื้อยอยู่ตรงลานไม้ ก็ตาสว่างโร่ วิ่งไปถ่ายรูปทันที 55555 </p>\n\n\n\n<p>จึงขอปิดท้ายด้วยน้องเขียวพระอินทร์ นักเขมือบตุ๊กแก ที่มาเยือนบ้านเราวันนี้จ้ะ</p>\n\n\n\n<figure><img src=\"https://iannnnn.com/wordpress/wp-content/uploads/2020/03/01-1024x768.jpg\" /><figcaption>เดินลงมาดูก็เจอน้องไต่อยู่ใต้ชายคา</figcaption></figure>\n\n\n\n<figure><img src=\"https://iannnnn.com/wordpress/wp-content/uploads/2020/03/002-1024x768.jpg\" /><figcaption>น้องเลี้ยวซ้าย มุ่งหน้าจะไปทางต้นเหลืองปรีดิยาธร<br />(ที่จริงจะอวดต้นไม้น่ะครับ่วงนี้ออกดอกพอดี สวยมาก)</figcaption></figure>\n\n\n\n<figure><img src=\"https://iannnnn.com/wordpress/wp-content/uploads/2020/03/003-1024x728.jpg\" /><figcaption>เราเลยวิ่งขึ้นชั้นบน ไปยืนบนระเบียงแล้วถ่ายลงมา<br />น้องตกใจเห็นคน เลยสะดุ้งขวับ! ตลกมาก 5555 สะดุ้งแบบ เฮือก! เหมือนช็อตมุก</figcaption></figure>\n\n\n\n<figure><img src=\"https://iannnnn.com/wordpress/wp-content/uploads/2020/03/004-1024x719.jpg\" /><figcaption>ซูมนิดนึง จำไว้นะ ยี่ห้อนี้คืองูเขียวพระอินทร์<br />น้องชอบอยู่ที่สูง ไม่ดุ แต่น้องปราดเปรียวมาก… ดูสิ น้องยิ้มให้กล้อง</figcaption></figure>\n\n\n\n<figure><img src=\"https://iannnnn.com/wordpress/wp-content/uploads/2020/03/005-1024x768.jpg\" /><figcaption>เลื้อยไปแล้วจ้า แบบช้าๆ น้องไม่รีบ เรารักษาระยะห่างกันนะ<br />(ฝนเพิ่งตกเมื่อวาน ดอกไม้ร่วงหมดเลย)</figcaption></figure>\n\n\n\n<figure><img src=\"https://iannnnn.com/wordpress/wp-content/uploads/2020/03/02-768x1024.jpg\" /><figcaption>สุดท้ายรูปนี้เอาไป<a href=\"https://twitter.com/iannnnn/status/1239407296234446848?s=20\">ทวีต</a>และโพสต์ถามในกรุ๊ปงู ว่าตัวไหนสายยาง 5555<br />คือลายมันเหมือนสายยางรดน้ำข้างล่างเป๊ะๆ เลย …ต้องมีวันที่หยิบผิดมั่งแหละ</figcaption></figure>\n\n\n\n<figure><img src=\"https://iannnnn.com/wordpress/wp-content/uploads/2020/03/006-1024x1024.jpg\" /><figcaption>น้องเลื้อยขึ้นต้นกันเกรา และร่อน (ใช่ ร่อนได้) ข้ามรั้วเหลืองชัชวาลไปนอกบ้าน<br />เราเดินมาส่งเพียงเท่านี้ แล้วก็แยกย้ายทางใครทางมัน</figcaption></figure>\n\n\n\n<p>ภารกิจถัดๆ ไปของเราก็คือเอาความเข้าใจงูเหล่านี้ไปเล่าให้ลูกฟัง จะได้รู้จักธรรมชาติของงูและเพื่อนร่วมโลกอื่นๆ จ้ะ</p>\n\n\n\n<p>ป.ล. มีพี่ที่สนิทกันย้ายบ้านไปอยู่สวนปาล์มที่ชุมพร เจองูทุกวัน เจอในสวนตัวเองนี่แหละ  ขยันเอามาอวดชาวเน็ตด้วย จนตอนนี้พี่แกเลี้ยงทั้งห่านทั้งหมาเอาไว้สู้ศึกอสรพิษแล้ว จริงจังมาก</p>\n<p>The post <a href=\"https://iannnnn.com/2020/2725\">ทำยังไงให้หายกลัวงู</a> appeared first on <a href=\"https://iannnnn.com\">iannnnn.com</a>.</p>","author":"iannnnn","siteTitle":"iannnnn.com","siteHash":"a633e1d87162133e28114b6caf1c887bfa26aadefce69cc40a9feea913e71870","entryHash":"53d641605dfda1b9ccf66cea064975f5e7639b38767b493036bd785eaad8082f","category":"Thai"}