{"title":"Mario Kart 8 update nerfs controversial “sandbagging” strategy","link":"https://arstechnica.com/?p=1982598","date":1699551979000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2014/05/Mario-Kart-8-6-640x360.png\" alt=\"Baby Luigi represents the reaction of sandbagging racers in this artistic rendering.\" />\n      <p>Baby Luigi represents the reaction of sandbagging racers in this artistic rendering. (credit: Nintendo)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Since <em>Mario Kart 8</em>'s launch on the Wii U, one of the game's most successful and controversial strategies has involved intentionally hanging out at the back of the pack to amass and abuse the game's best items. Now, over nine years <a href=\"https://arstechnica.com/gaming/2014/05/mario-kart-8-review-one-step-forward-one-step-back/\">since the game's initial release</a>, Nintendo has taken steps to eliminate the controversial \"bagging\" strategy in the latest update to the Switch's <em>Mario Kart 8 Deluxe</em>.</p>\n<p><em>Mario Kart 8</em> players who made use of \"bagging\" (short for \"sandbagging\" and sometimes also called \"item smuggling\") in online races would briefly retreat to last place to sit on a regenerating item box, waiting to acquire some of the game's most powerful items (which are <a href=\"https://www.mariowiki.com/Mario_Kart_8_item_probability_distributions\">much more likely to appear when you are far away from first place</a>). The bagging player could then use one of those items (say, a Golden Mushroom and/or Starman) to quickly catch up with the pack before using the other amassed item (say, a Bullet Bill) to build up a dominant lead. The strategy can be especially effective on tracks like \"Cheese Land,\" where using a Bullet Bill in very specific locations <a href=\"https://www.youtube.com/watch?v=XmHoBDharl0\">can extend how long the powerful item lasts</a>.</p>\n<h2>Not “cheating,” but not exactly “racing”?</h2>\n<p>Despite bagging's controversial reputation among many players, the strategy isn't really comparable to outright cheating—baggers play an unmodified version of the game as it was designed, after all. And <a href=\"https://gamefaqs.gamespot.com/boards/700050-mario-kart-8/73350438\">for years</a>, many <em>Mario Kart 8</em> players have argued that it's a perfectly fair strategy that requires actual skill to use effectively. \"Sandbagging is a risk vs reward kind of thing,\" GameFAQs user RydeonHD <a href=\"https://gamefaqs.gamespot.com/boards/700050-mario-kart-8/73350438\">wrote in 2016</a>. \"There have been many times where it can just plain out backfire (in those cases, it would've just been better to strive for first).\"</p></div><p><a href=\"https://arstechnica.com/?p=1982598#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1982598&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"53da3c8a00f5c7413660cdb01966adde384e7ae0582cfe4dcf7bc77cb83cec8f","category":"Tech"}