{"title":"Green Perspectives: Future Technology Professionals' Views on Sustainability Practices","link":"https://www.preprints.org/manuscript/202405.2056/v1","date":1717118849000,"content":"The increasing focus on sustainability and the adoption of green practices across industries underscore the necessity of equipping future professionals with competencies in implementing sustainable solutions. This study explores the perceptions of former students from two departments within the technological sector towards sustainability practices. A cross-sectional online survey was carried out among alumni from two programs at the University of Thessaly, a university recognized for its commitment to sustainability and green initiatives as a member of the INVEST European University alliance. The survey questionnaire included background inquiries and 16 statements designed to gauge alumni perspectives towards sustainability practices. Specifically, it aims to assess their views through self-assessment and compare differences between the two alumni groups. Responses were collected on a 5-point Likert scale ranging from strongly disagree to strongly agree. A total of 300 graduates from the Computer Science and Telecommunications as well as Electrical Engineering undergraduate programs were encouraged to take part in the survey, achieving a response rate of 69%. Of those who responded, 61% (n = 126) represented the Computer Science and Telecommunications group, while 39% (n = 81) were from the Electrical Engineering program. Our findings indicate a generally positive attitude towards sustainability, with statistically significant differences in perspectives on the implementation of sustainable technologies and stakeholder engagement. These results underscore the necessity of integrating sustainability education deeply within the curricula of technological programs to cultivate a workforce capable of addressing future environmental challenges. This study illuminates the critical role of educational frameworks in shaping the sustainability competencies of technology professionals.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"53da4429841d622ecad0c717c5907e1c15464d73a4f7b0ace7632ea8e5d85b8d","category":"Interdisciplinary"}