{"title":"Xbox ประกาศร่วมมือกับ Inworld เพื่อใช้ AI สร้างเครื่องมือสำหรับการพัฒนาเกม","link":"https://www.blognone.com/node/136620","date":1699356514000,"content":"<div><div><div><p>Xbox ประกาศร่วมมือกับ Inworld บริษัทที่เชี่ยวชาญด้านการใช้ AI เพื่อใช้ AI สร้างเครื่องมือพัฒนาเกมใหม่ ๆ โดยคาดว่า AI จะช่วยสร้างบทสนทนา และเครื่องมือการเล่าเรื่องในเกม รวมถึงเรื่องราว และการออกแบบภารกิจต่าง ๆ ได้</p>\n<p>Inworld AI กล่าวว่าการใช้ AI จะสามารถลดเวลา และทรัพยากรที่ต้องใช้ในระหว่างการผลิตได้ ซึ่งจะช่วยให้การพัฒนาเกมเร็วขึ้น โดยเครื่องมือ AI ของ Inworld จะแบ่งเป็น 2 ส่วนได้แก่</p>\n<ul>\n<li>AI Design Copilot ที่จะเปลี่ยนไอเดียของ prompt จากเกมดีไซเนอร์เป็นสคริปต์ที่มีรายละเอียด, โครงสร้างบทสนทนา, ภารกิจ และอื่น ๆ ภายในเกม</li>\n<li>AI Character Runtime Engine ที่จะเข้าเป็นส่วนหนึ่งกับตัวเกม ช่วยสร้างการเล่าเรื่องแบบใหม่ ๆ ด้วยเรื่องราว, ภารกิจ และบทสนทนาที่สร้างขึ้นแบบไดนามิกให้ผู้เล่นได้สัมผัส</li>\n</ul>\n<p>เมื่อเดือนกุมภาพันธ์ที่ผ่านมา Phil Spencer ซีอีโอของ Microsoft Gaming กล่าวว่านักพัฒนาเกมของ Xbox กำลังสำรวจว่าการใช้ AI จะเป็นจะส่งผลบวกเชิงบวกในการพัฒนาเกมได้อย่างไร โดย Microsoft น้อมรับกับกฎระเบียบของ AI และ Inworld ก็ทำงานร่วมกับบริษัทเกมอื่น ๆ เช่น NetEase, Unity, Unreal และบริษัทอื่น ๆ อีกด้วย</p>\n<p>ทั้งนี้ทั้งนั้น Microsoft และ Inworld AI ไม่ได้บอกว่าความร่วมมือ และการใช้ AI ครั้งนี้ จะส่งผลกระทบต่อนักพัฒนาเกมอย่างไร</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/86fd7a0c1f02efcdd2bf54a11597f7c7.png\" /></p>\n<p>ที่มา - <a href=\"https://developer.microsoft.com/en-us/games/articles/2023/11/xbox-and-inworld-ai-partnership-announcement/\">Microsoft Game Dev</a> via <a href=\"https://developer.microsoft.com/en-us/games/articles/2023/11/xbox-and-inworld-ai-partnership-announcement/\">Gamespot</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/xbox\">Xbox</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"53eda2fd2d771eef22c30d8e54c549c099f5d0276e3c58fd9f9e8377f9276631","category":"Thai"}