{"title":"wcm.04.2024.461.465","link":"https://www.watconman.org/wcm-04-2024-461-465/","date":1727843197000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>ANALYSIS OF THE IMPACT OF CLIMATE CHANGE ON WATER RESOURCES: CASE<br />\nOF THE TENSIFT BASIN (MOROCCO)</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Ghizlane Fahdi, Driss Azdem, Aziza Lamchaimech, Mounia Benrhanem, Jamal Mabrouki, Souad El hajjaji</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.04.2024.461.465\">10.26480/wcm.04.2024.461.465</a></em></span></p>\n<h3>Abstract</h3>\n<div><img loading=\"lazy\" src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />To understand and solve some problems in hydrology and water resources, like plan management, operation management, environmental protection, natural balance, and so on, it is useful to look into how climate change affects these areas. Both in theory and in real life. Climate change is likely to become a growing concern for water professionals in Morocco, as in all regions of the world. The Tensift basin, one of the largest in Morocco, is already suffering from the problem of dwindling water resources. Combined with the risk of a reduction in these resources as a result of climate change, this problem calls for new thinking in terms of socio-economic development guidelines and strategies. The aim of this work is to study the relationship between water resources and climate change in the case of the Tensift basin, by exploring water resources, climate change and related mechanisms, based on data from the Tensift Water Basin Agency.</div>\n<h3>Keywords</h3>\n<p><span>Water resources ; Tensift basin; Greenhouse gas; climate change; scenarios. </span></p>\n<h3><strong>1. INTRODUCTION</strong></h3>\n<div>\n<p>Climate change is defined as a period of 10 years or more in which the average condition of the climate and its deviations experience one or more substantial changes that combined, according to statistics, are statistically significant (Moussa, et al., 2012; Brouyère et al., 2022; Ouhamdouch et al., 2018). The implications of climate change are wide-ranging and multifaceted and include both good and negative outcomes (Bellal et al., 2020). Future climate change will have the greatest impact on the sustainable development of regional, national, and even global areas as it not only impacts the hydrological, biological, and ecological systems but also the economic and human existence (Bekkar et al., 2023). A crucial component of the hydrologic cycle and water resources is the connection to climate change (Elassassi et al., 2022). Climate influences, namely rainfall and temperature variations, have an impact on water resources through changes in water and water quality. And it is made possible by modifications to the different water cycle linkages (Folton et al., 2012; Vecchio and Kuper, 2022). It was noted in the 2007 IPCC Fourth Assessment Report that throughout the previous century, the global temperature has risen by 0.6 to 0.8°C (Change, 1990; Change, 1990; Benchrifa et al., 2022 ; Masson-Delmotte et al., 2022). Similar to many other dry and semi-arid Mediterranean regions, Morocco has had severe droughts in recent years, mostly since the 1960s, which has had a devastating effect on precipitation and, in turn, the number of mobilized water resources (Ghizlane, et al., 2022; Hassani et al., 2021). Water shortages that have affected the supply of water for various industries (agricultural, urbanization, manufacturing, etc.) during the past several years have had a major effect on the economy of the nation (Qadem, 2015; Mabrouki et al., 2022; Taïbi, 2003).</p>\n<p>This paper is based on in-depth research into the relationship between water resources and climate change in the case of the Tensift basin, exploring water resources, climate change and related mechanisms. The analysis will be based on the study of elaborate scenarios on the impact of climate change on the basin and GHG emissions.</p>\n<p><strong>2. METHODOLOGY</strong></p>\n<p><strong>2.1 Characterization of The Study Area</strong></p>\n<p>The Oued Tensift rises in the High Atlas Mountains at an altitude of 4,000 meters. Some 250 km long, it flows into the Atlantic Ocean after receiving contributions from numerous tributaries particularly on the left bank figure 1. The most important of these originate in the High Atlas, including the Rdat, Zat, Ourika, Rheraya, and N’Fis wadis (Ouhamdouch, et al., 2018),. The Tensift watershed is characterized by the presence of active, semi-active, and non-active basins: of the 19,400 km2 of the total watershed, the truly active part is only 7,800 to 8,000 km2. The Oued Tensift basin is characterized by the presence of two distinct parts: The southern part of the basin corresponds to the northern flank of the Atlas Mountains, and is occupied by medium-sized basins (200 to 1500 km²), well-watered and very steep, which constitute the left bank tributaries of the Oued Tensift. The rest of the basin corresponds to the downstream course of these tributaries, to the course of the Oued Tensift itself, and to the small basins which constitute the right bank tributaries of the Oued Tensift. This part of the basin is not very steep and receives little water (Tanouti, 2017; Benchrifa et al., 2023).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"663\" height=\"529\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/Issue-4-461-465.png\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/Issue-4-461-465.png 663w, https://www.watconman.org/wp-content/uploads/2024/10/Issue-4-461-465-300x239.png 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The whole of the Haouz plain between Marrakech and Mejjate is part of the semi-arid continental climate zone, with low rainfall (annual average of 250 mm) and low humidity (Tanouti and Molle, 2013). The spatial distribution of rainfall reflects the influence of distance from the Atlantic and altitude: 190 mm in Chichaoua, 250 mm in Marrakech, and 490 mm in Amezmiz. Temperatures here are high, with very wide daily and annual temperature ranges: very high summer temperatures (average maximum 38°C) and low winter temperatures (average minimum 5°C). The temperature contrasts are remarkable (Hajhouji, 2024). There are notable daily and yearly temperature differences. The Jbilets (Figure.2) climate stations are situated on the perimeter, on the lower slopes. It is not possible to measure directly how the climatic gradients change with height. There are significant temperature variations and a semi-arid environment. Rainfall occurs between 250 and 270 mm every year (Haida et al.,1996; Zamrane, 2016).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1024\" height=\"697\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-2-1024x697.png\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-2-1024x697.png 1024w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-2-300x204.png 300w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-2-768x523.png 768w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-2.png 1181w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>To study the consequences of climate change on water resources, the area corresponds to the action zone of the Tensift Water Basin Agency (ABHT), which covers a surface area of 24,800 km2, i.e. almost 3% of the country’s total surface area. It should be noted that the Department of Water Research and Planning recently carried out a study on “integrating climate change into water resource planning in Morocco” (Benchrifa et al., 2023).</p>\n<p>Various scenarios are available in the literature to represent a range of possible future projections. These scenarios include: In the CMIP3 (AR4) project, the scenarios used are the SRES (Special Report on Emissions Scenarios). These are different hypotheses of socio-economic development that generate different levels of greenhouse gas (GHG) emissions. For the CMIP5 (AR5) project, new scenarios have been defined to take account of recent developments, such as the rapid growth of emerging countries, and also to extend the projections beyond 2100. The approach consisted in setting ‘targets’ for the concentration of GHGs in the atmosphere, and then developing socio-economic scenarios that could generate each of these concentrations. The graph below compares the (SRES) and (RCP) scenarios (Benchrifa et al., 2023).</p>\n<p><strong>3.RESULTS AND DISCUSSION</strong></p>\n<p>To study the consequences of climate change on water resources, the area corresponds to the action zone of the Tensift Water Basin Agency (ABHT), which covers a surface area of 24,800 km2, i.e. almost 3% of the country’s total surface area. It should be noted that the Department of Water Research and Planning recently carried out a study on “integrating climate change into water resource planning in Morocco” (Benchrifa et al., 2023).</p>\n<p><strong>3.1 Water Quality Model Test</strong></p>\n<p><strong>3.1.1 Surface Water and Groundwater Resources</strong></p>\n<p>Surface water resources are highly irregular and unevenly distributed. The High Atlas is the water tower for surface run-off, since the most important wadis originate there, while the plain is a transitional zone for water use (Mahmouhi et al., 2016; Ezaidi and Ait Tirri, 2002). Torrential run-off, which occurs following storms or intense rainfall, is collected by the Tensift hydrographic network, which drains it into the ocean. These resources are threatened by a problem of increasing scarcity, accentuated by years of drought. This problem has already resulted in the over-exploitation of groundwater and water transfers from an adjacent basin: the Oum Rabii basin (Agoumi and Debbarh, 2005; Panagopoulos et al., 2011).</p>\n<p>As table 1 shows, in total, the potential of the Tensift basin totals 665.3 Mm3 over the period 1945-2016, which is comparable with the 677.2 Mm3 estimated in the 2010 PDAIRE study (supplies observed at supply sites, without taking into account the volumes drawn by the PMH). In terms of distribution, it should be noted that the Nfis sub-basin (194 Mm3) generates around 29% of the Tensift basin’s total input (Bellal et al., 2020; Elassassi et al., 2022; Marofi, 1999).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"771\" height=\"666\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Table-1.png\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Table-1.png 771w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Table-1-300x259.png 300w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Table-1-768x663.png 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>3.2 GHG Emission Scenarios</strong></p>\n<p>Based on various assumptions, greenhouse gas (GHG) emission scenarios are forecasts that are used to anticipate possible future climates. The A1, A2, B1, and B2 scenarios are included in the IPCC’s Special Report on Emissions Scenarios (SRES), which represents different rates of economic expansion, advances in technology, and changes in governmental initiatives (IPCC. 2024). Different future GHG emission paths and their effects on radiative forcing are described by Representative Concentration paths (RCPs), such as RCP2.6, RCP4.5, RCP6.0, and RCP8.5. Shared Socioeconomic Pathways (SSPs) provide comprehensive frameworks for studying climate change consequences, mitigation, and adaptation based on socioeconomic trends (Benchrifa et al., 2023). Examples of SSPs include SSP1 (sustainability), SSP2 (middle of the road), SSP3 (regional competition), SSP4 (inequality), and SSP5 (fossil-fueled development) (Change, 1990; van, 2023). The results of studies utilizing these scenarios varied widely, from large emission reductions and sustainable growth in SSP1 and RCP2.6 to high emissions and sluggish economic growth in SSP3 and RCP8.5, underscoring the significance of technical and policy decisions in determining future emissions (Masson-Delmotte et al., 2022; Butphu and Kaewpradit, 2022; Bencheikh et al., 2020).</p>\n<p>In order to account for the long-term uncertainty for many of the driving variables, the range of GHG emissions in the scenarios gets wider with time. After 2050, this widening is mostly due to various socioeconomic events (Benchrifa et al., 2023).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"776\" height=\"541\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-3.png\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-3.png 776w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-3-300x209.png 300w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-3-768x535.png 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>According to the various drought scenarios (Figure.3), the economic impacts range from 4.2 billion dollars (historical drought with a 500-year recurrence) to 7 billion dollars (drought with a 500-year recurrence in a severe climate change scenario – RCP 8.5 – in 2050), causing a loss of 1.8 to 3.5 percentage points to GDP while reducing the capital adequacy ratio of banks by 1.3 to 2.2%. The analysis highlights the significant amplification effects of climate change in all the scenarios (Change, 1990 ; Hassani et al., 2021; Benchrifa et al., 2023; Bencheikh, 2020; Voldoire, A., 2013).</p>\n<p><strong>4.IMPACT OF CLIMATE CHANGE ON WATER SUPPLIES</strong></p>\n<p>The feeder sites selected for the DRPE study are as follows (Benchrifa et al., 2023).‏</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1024\" height=\"508\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/4561-465-Table-1024x508.png\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/4561-465-Table-1024x508.png 1024w, https://www.watconman.org/wp-content/uploads/2024/10/4561-465-Table-300x149.png 300w, https://www.watconman.org/wp-content/uploads/2024/10/4561-465-Table-768x381.png 768w, https://www.watconman.org/wp-content/uploads/2024/10/4561-465-Table.png 1144w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1024\" height=\"446\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Table@-1024x446.png\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Table@-1024x446.png 1024w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Table@-300x131.png 300w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Table@-768x335.png 768w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Table@.png 1145w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The feeder sites selected for the DRPE study are as follows (Benchrifa et al., 2023).</p>\n<p>The annual and seasonal series of mean annual rainfall (MAR), mean annual temperature (MAT) and runoff were plotted on the same graph in order to assess the quality of the data used in the multiple regression analysis. These graphs clearly point out the relationships between the three variables and allow the identification of obvious shifts in the data. MAR is highly variable and it is therefore more difficult to discern a clear relationship with runoff. The figures below show the annual series of MAR, MAT and runoff parameters, by sub-basin (Benchrifa et al., 2023).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"768\" height=\"523\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-4.png\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-4.png 768w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-4-300x204.png 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The analysis revealed that the results of the variability analysis of the change in precipitation and temperature are highly variable. For the models considered in the DRPE study, the variation in temperature is between +1 and +2.5°C. On the other hand, the variation in rainfall is between -30% and +3%.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1024\" height=\"702\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-5-1024x702.png\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-5-1024x702.png 1024w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-5-300x206.png 300w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-5-768x526.png 768w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-5.png 1140w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"572\" height=\"732\" src=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-6.png\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-6.png 572w, https://www.watconman.org/wp-content/uploads/2024/10/461-465-Figure-6-234x300.png 234w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>These results (Figure 5 and Figure 6) show that the models that produce the greatest and least change in precipitation are not the same for each season. For the seasonal change in variable temperature, the majority of models indicate an increase in temperature for all seasons. Although the csiro model indicates an increase in precipitation, there is a decrease in the volume of runoff. For this reason, this model induces an increase in temperature, which produces a decrease in runoff volume.</p>\n<p>The scenarios, which are typical in the literature, encompass a broad range of the primary demographic, economic, and technical driving drivers of GHG. Of the four stories, each scenario is a certain quantitative interpretation (Fattah et al., 2021). Additionally, a variety of government policies, including those pertaining to resource usage, pollution control, social and economic growth, demographic shifts, and technology advancements, can have an impact on the factors that drive greenhouse gas emissions (Mabrouki et al., 2022). The resulting events and narratives substantially reflect this impact. It is advised that any investigation employ a range of SRES scenarios with different driving force assumptions (Fattah et al., 2021). For most studies, therefore, more than one family should be considered. The key unknowns, which range from emissions to driving factors, could alter depending on the application (Ouharba et al., 2024). A few examples include policy analysis, climate modeling, impact assessments, vulnerability assessments, mitigation strategies, and possibilities for adaptation (Nan et al., 2011).</p>\n<p><strong>5.CONCLUSION</strong></p>\n<p>The Tensift basin has a water deficit. In the absence of an appropriate regional water policy, and with climate change, this deficit is set to increase and would ultimately threaten the quality of life of the population, thus prompting integrated reflection by the various stakeholders in different sectors (water resources, agriculture, and urbanization, tourism….) in order to achieve balanced, rational and sustainable management of water resources. The study of how climate change affects water resources will likely focus on improving the accuracy of hydrological models under conditions of land surface parameter changes, developing accurate regional development space and time climate scenarios, perfect distributed hydrologic models, and developing land surface development models that use two-way coupling techniques.</p>\n<p><strong>REFERENCES</strong></p>\n<p>Moussa, A. B., Chahlaoui, A., Rour, E. H., Chahboune, M., Aboulkacem, Et A., 2012. Étude Du Changement De L’etat Des Eaux De L’oued Khoumane A La Confluence Avec Les Eaux Thermales De La Source Ain Hamma Moulay Idriss Maroc , Larhyss Journal P-Issn 1112-3680 / E-Issn 2521-9782, No 11, Art. No 11, Nov. 2012, Consulté Le: 28 Janvier 2024. [En Ligne]. Disponible Sur: Http://Larhyss.Net/Ojs/Index.Php/Larhyss /Article/View/136</p>\n<p>Brouyère, S., Glaude, R., Hutzemakers, J., Orban, P., Goderniaux, P., 2022. Impact du changement climatique sur les ressources en eaux souterraines de Wallonie: des prédictions du passé aux observations du présent , in Journée d’étude 2022. Eau potable: de la protection des ressources à la consommation.</p>\n<p>Ouhamdouch, S., Bahir, M., Carreira, P., 2018. Impact du changement climatique sur la ressource en eau en milieu semi-aride : exemple du bassin d’Essaouira (Maroc) , rseau, vol. 31, no 1, p. 13‑27, 2018, doi: 10.7202/1047050ar.</p>\n<p>Bellal, S.-A., Baiche, A., Dari, Et. O., 2020. Secheresse Et Fluctuations Des Ressources En Eau Souterraines: Le Cas Du Plateau De Mostaganem (Ouest Algerien) », Eau Et Environnement Territoires Et Societes, Vol. 14, P. 107, 2020.</p>\n<p>Bekkar, A., Hssina, B., Douzi, S., Khadija, D., 2023. Transformer-Based Model for Multi-Horizon Forecasting Ozone in Marrakech city, Morocco. Pp. 8. doi: 10.1109/SITA60746. 2023.10373756.</p>\n<p>Elassassi, Z., Ougrad, I., Bedoui, I., Kara, M., El Bouch, M., Assouguem, A., Chaouch, A., 2022. Spatial and Temporal Variations of the Water Quality of the Tiflet River, Province of Khemisset, Morocco, Water, vol. 14, no 12, Art. no 12, janv. 2022, doi: 10.3390/w14121829.</p>\n<p>Folton, N., Tolsa, M., and Arnaud, P., 2012, November.Le Bassin de recherche du Réal Collobrier-Étude des processus hydrologiques en milieu méditerranéen a échelle fine. in 50 ans de l’Orgeval, IRSTEA, 2012, Pp. 7 p.</p>\n<p>Vecchio, K. D., Kuper, M., 2022. La mise en visibilité des eaux souterraines au Maroc: un processus historiquement lié aux politiques de développement de l’irrigation , Développement durable et territoires. Économie, géographie, politique, droit, sociologie, vol. 12, no 3.</p>\n<p>Change, C., 1990. The IPCC Scientific Assessment, First Assessment Report, Contributing Author, WGII Chapter 5. Cambridge university press, Cambridge, UK, 1990.</p>\n<p>Benchrifa, M., Mabrouki, J., Tadili, R., 2022. November. Estimation of global irradiation on horizontal plane using artificial neural network. In The International Conference on Artificial Intelligence and Smart Environment, Pp. 395-400. Cham: Springer International Publishing.</p>\n<p>Masson-Delmotte, V., Zhai, P., Pörtner, H.-O., Roberts, D., Skea, J., Shukla, P. R., 2022. Global Warming of 1.5 C: IPCC special report on impacts of global warming of 1.5 C above pre-industrial levels in context of strengthening response to climate change, sustainable development, and efforts to eradicate poverty. Cambridge University Press.</p>\n<p>Ghizlane, F., Mabrouki, J., Ghrissi, F., and Azrour, M., 2022. Proposal for a high-resolution particulate matter (PM10 and PM2. 5) capture system, comparable with hybrid system-based internet of things: case of quarries in the western rif, Morocco. Pollution, 8(1), Pp. 169-180.</p>\n<p>Hassani, F. E., Hattafi, Y., Lahrach, A., 2021. Water Dynamics of the Sefrou Watershed, Northern Tabular Middle Atlas, Morocco, Journal of Geoscience and Environment Protection, vol. 9, no 9, Art. no 9, sept. 2021, doi: 10.4236/gep.2021.99007.</p>\n<p>Qadem, A., 2015. Quantification, modélisation et gestion de la ressource en eau dans le bassin versant du Haut Sebou (Maroc) », These de doctorat, Université de Lorraine. Consulté le: 30 janvier 2024. En ligne. Disponible sur: https://www. theses.fr /2015LORR0263</p>\n<p>Mabrouki, J., Benchrifa, M., Ennouhi, M., Azoulay, K., Bencheikh, I., Rachiq, T., and El Hajjaji, S., 2022, November. Geographic information system for the study of water resources in Chaâba El Hamra, Mohammedia (Morocco). In The International Conference on Artificial Intelligence and Smart Environment, Pp. 469-474. Cham: Springer International Publishing.</p>\n<p>Taïbi, A. N., La ressource en eaux non conventionnelles facteur de développement en zone saharienne, présenté à Conférence internationale, Hydrologie des régions méditerranéennes et semi-arides, ENSA, 2003. Consulté le: 30 janvier 2024. En ligne. Disponible sur: https://shs.hal.science/halshs-00477734</p>\n<p>Ouhamdouch, S., Bahir, M., Carreira, P., 2018. Impact du changement climatique sur la ressource en eau en milieu semi-aride : exemple du bassin d’Essaouira (Maroc) , rseau, vol. 31, no 1, Pp. 13‑27, 2018, doi: 10.7202/1047050ar.</p>\n<p>Tanouti, O., 2017. La gestion intégrée des ressources en eau à l’épreuve du bassin versant : cas du bassin du Tensift au Maroc , These de doctorat, Paris 10, 2017. Consulté le: 2 août 2024. En ligne. Disponible sur: https://theses.fr/2017PA100172</p>\n<p>Benchrifa, M., Elouardi, M., Fattah, G., Mabrouki, J., Tadili, R., 2023. Identification, simulation and modeling of the main power losses of a photovoltaic installation and use of the internet of things to minimize system losses. In Advanced technology for smart environment and energy, Pp. 49-60. Cham: Springer International Publishing.</p>\n<p>Tanouti, O., Molle, F., 2013. Réappropriations de l’eau dans les bassins versants surexploités. Le cas du bassin du Tensift (Maroc), Études rurales, vol. 192, no 2, Pp. 79‑96, 2013, doi: 10.4000/etudesrurales.9902.</p>\n<p>Hajhouji, Y., 2024. Modélisation hydrologique du bassin versant de l’oued Rheraya et sa contribution à la recharge de la nappe du Haouz (bassin du Tensift, Maroc), phdthesis, Université Paul Sabatier – Toulouse III, 2018. Consulté le: 2 août 2024. En ligne. Disponible sur: https://theses.hal.science/tel-02328912</p>\n<p>Haida, S., Snoussi, M., Latouche, C., Probst, J.-L., 1996. Géodynamique actuelle du bassin versant de l’Oued Tensift (Maroc) : érosion mécanique et bilan des transports solides fluviaux. / Present geodynamic of the Tensift drainage basin (Morocco) : mechanical erosion and fluvial transports of sediments, 1996, doi: 10.3406/ sgeol.1996.1933.</p>\n<p>Zamrane, Z., 2016. Recherche d’indices de variabilité climatique dans des séries hydroclmatiques au Maroc : identification, positionnement temporel, tendances et liens avec les fluctuations climatiques : cas des grands bassins de la Moulouya, du Sebou et du Tensift », phdthesis, Université Montpellier ; Université Cadi Ayyad (Marrakech, Maroc). Faculté des sciences Semlalia, Consulté le: 2 août 2024. En ligne. Disponible sur: https:// theses. hal. science/tel-01690063</p>\n<p>Mahmouhi, N. E., Wartiti, M. E., Wissem, S. A., Kemmou, S., Bahi, S. E., 2016. Utilisation des systèmes d’information géographiques et des modèles hydrologiques pour l’extraction des caractéristiques physiques du bassin versant d’Assaka (Guelmim, sud du Maroc), vol. 16, no 2, 2016.</p>\n<p>Ezaidi, A., Ait Tirri, A., 2002. Une approche sur la collecte d’eau au niveau du Bassin versant: le cas du Bassin Talkjounte au Maroc », Water harvesting in Mediterranean zones: an impact assessment and economic evaluation, Pp. 25, 2002.</p>\n<p>Agoumi, A., Debbarh, A., 2005. Ressources en eau et bassins versants du Maroc: 50 ans de développement, Report Prepared Within the Framework of the , Water: Management of Scarcity, Organized by the Association of Moroccan Engineers of Bridges and Roads, Pp. 13‑62.</p>\n<p>Panagopoulos, Y., Makropoulos, C., Mimikou, M., 2011. Reducing surface water pollution through the assessment of the cost-effectiveness of BMPs at different spatial scales », Journal of Environmental Management, vol. 92, no 10, Pp. 2823‑2835, doi: 10.1016/j.jenvman.2011.06.035.</p>\n<p>Marofi, S., 1999. Role des echanges nappes-fosses dans le fonctionnement hydrologique d’un bassin versant en milieu mediterraneen cultive, These de doctorat, École nationale supérieure agronomique (Montpellier ; 1960-2006), 1999. Consulté le: 29 janvier 2024. En ligne. Disponible sur: https://www.theses.fr/1999ENSA0005</p>\n<p>IPCC. 2024. Sectoral greenhouse gas emissions by sector, European Environment Agency. Consulté le: 2 août 2024. En ligne. Disponible sur: https://www.eea.europa.eu/data-and-maps/daviz/change-of-co2-eq-emissions-2</p>\n<p>van, J.-P., persele de Strihou, Y., Le Treut, H., Hallegatte, S., Hourcade, J.-C., Science du changement climatique : acquis et controverses. 2004. Consulté le: 23 novembre 2023. En ligne. Disponible sur: https://dial. uclouvain. be/pr/boreal /object/ boreal: 161628</p>\n<p>Butphu, S., Kaewpradit, W., 2022. Impacts of eucalyptus biochar application on greenhouse gas emission from an upland rice–sugarcane cropping system on sandy soil, Experimental Agriculture, vol. 58, Pp. e25, janv. 2022, doi: 10.1017/ S0014 479722 000254.</p>\n<p>Bencheikh, I., Mabrouki, J., Azoulay, K., Moufti, A., and El Hajjaji, S., 2020. Predictive analytics and optimization of wastewater treatment efficiency using statistic approach. In Big Data and Networks Technologies 3. Pp. 310-319. Springer International Publishing.</p>\n<p>Voldoire, A., 2013. The CNRM-CM5.1 global climate model: description and basic evaluation, Clim Dyn, vol. 40, no 9, Pp. 2091‑2121, mai 2013, doi: 10.1007 /s00382-011-1259-y.</p>\n<p>Fattah, G., Ghrissi, F., Mabrouki, J., and Kabriti, M., 2021. Control of physicochemical parameters of spring waters near quarries exploiting limestone rock. In E3S web of conferences, Vol. 234, Pp. 00018. EDP Sciences.</p>\n<p>Mabrouki, J., Azrour, M., Boubekraoui, A., and El Hajjaji, S., 2022. Simulation and optimization of solar domestic hot water systems. International Journal of Social Ecology and Sustainable Development. IJSESD, 13(1), Pp. 1-11.</p>\n<p>Fattah, G., Ghrissi, F., Mabrouki, J., and Al-Jadabi, N., 2021. Modeling and assessment of the impact of land use in the Western RIF Region, Morocco, on Water Quality. The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences, 46, Pp. 225-230.</p>\n<p>Ouharba, E. L., Mabrouki, J., and Triqui, Z. E., 2024. Assessment and Future Climate Dynamics in the Bouregreg Basin, Morocco–Impacts and Adaptation Alternatives. Ecological Engineering and Environmental Technology, 25.</p>\n<p>Nan, Y., Bao-hui, M., Chun-kun, L., 2011.Impact Analysis of Climate Change on Water Resources, Procedia Engineering, vol. 24, Pp. 643‑648, 2011, doi: 10.1016 / j.proeng. 2011.11.2710.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>461-465</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>4</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8846\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/4wcm2024/4wcm2024-461-465.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"Natasha","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"53f717977116ed277c100c526b80e1c122d3b11419c3f5ae6fb48dee04bf5164","category":"Environment"}