{"title":"Prediction of Car Purchase Amount Based on Genetic Algorithm Optimised BP Neural Network Regression Algorithm","link":"https://www.preprints.org/manuscript/202406.1304/v1","date":1718769219000,"content":"This study is based on the BP neural network regression model optimised by genetic algorithm and dedicated to predicting the amount of car purchase, this study is important for all parties in the automotive industry. By plotting the violins of six indicators, including gender, age, annual salary, credit card debt, net worth, and car purchase amount, we found that, except for gender, the other data showed a trend of dense in the middle gradually decreasing to the upper and lower sides, with an overall normal distribution. The correlation analysis shows that the amount of car purchase has a high positive correlation with age (0.63), followed by annual income (0.62), the correlation between net worth and the amount of car purchase is 0.49, while the correlation between credit card debt and the amount of car purchase is low (0.03). In the experimental part, we analyse the predicted-actual values of the training and test sets in comparison and find that the model predicted values are very close to the actual values. The RMSE of the training set is 11.559 and the RMSE of the test set is 11.4835, which is not much different from each other, indicating that the model has good generalisation ability. In addition, the R2 of both the training and test sets is 1, indicating that the model fits well. The MAE of the training set is 8.2512 and the MAE of the test set is 9.578; the MBE of the training set is -4.3035 and the MBE of the test set is -2.4547.These metrics indicate that the model performs well in predicting the amount of car purchase. In conclusion, this study provides an effective and reliable method to predict the amount of car purchase, creating a useful bridge between car manufacturers, dealers and consumers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"53f8103fa6bc2664df9b554ee9b07a34330cf2b3c7fa409b57be0f17182a2836","category":"Interdisciplinary"}