{"title":"Iron Overload Accompanying Extracellular Acidosis and Neurodegeneration","link":"https://www.preprints.org/manuscript/202406.0882/v1","date":1718272303000,"content":"The dynamic equilibrium of iron homeostasis has an important role in sustaining metabolic and neurological functions during human life. Iron excretion is modest and unregulated hence this overall equilibrium is tightly regulated in normal conditions by increasing deficient or limiting excessive iron assimilation. Here we focus on neural tissue overload, dyshomeostasis that is preceded by excessive assimilation, disturbances in internal homeostasis or both. Normal steps in iron homeostasis include its uptake across the apical membrane of the enterocytes in a mildly acidic duodenal milieu by the major importer of ferrous iron, Divalent Metal Transporter 1 (DMT1) (Nramp2/DCT1/SLC11A2, solute carrier family 11 member 2) [1, 2], responsible for the uptake of Non-Transferrin Bound Iron (NTBI) and divalent metals [3], passage through enterocytes bound to a chaperone and crossing the basal membrane via the only known cellular ferrous iron exporter, ferroportin  [4] with the iron bound to transferrin (Tf) as it exits. Cells in peripheral tissues largely utilize circulating iron after uptake by receptor-mediated endocytosis of Tf-bound Iron [5].\n       Derangement of duodenal NTBI absorption of iron and heavy metals is influenced by systemic iron metabolism associated with inflammation that leads to iron accumulation into peripheral tissues and potential development of neurodegenerative diseases, involving distribution and fine regulation of DMT1 also in the central nervous system, where inflammatory-related acidosis influences DMT1 uptake, via its action as a proton cotransporter. Pharmacological strategies to inhibit NTBI transport selectively will be illustrated in relationship to protection, particularly neuroprotection, against iron overload associated with acidosis, inflammation, neuroinflammation and subsequent neurodegeneration.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5405254cd468695b5cd8838924e06fb20f7351e27c3d082eaf91670e08307570","category":"Interdisciplinary"}