{"title":"Effects of feeding an inoculated corn silage with or without a direct-fed microbial on dry matter intake, milk production, and nutrient digestibility of high-producing lactating Holstein cows","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae010/7534326?rss=1","date":1705190400000,"content":"<span><div>Abstract</div>This study evaluated the effects of inoculating corn silage and/or feeding a direct-fed microbial (PRO) on performance and nutrient digestibility of lactating dairy cows. At harvesting, corn silage was treated either with water (culated or not [CON]) or <span>Lactococcus lactis</span> and <span>Lentilactobacillus buchneri</span> (INC; SiloSolve FC) at 1.5 × 10<sup>5</sup> cfu/g of corn silage. Ten mini silos and one farm-scale silo bunker per treatment were prepared for the laboratory and the lactating dairy cow trial, respectively. Five mini silos per treatment were opened on days 2 or 90 post-ensiling for pH measurement, as well as chemical analysis and aerobic stability, respectively. The farm-scale silo bunkers were opened 77 d post-ensiling for the beginning of the lactating cow trial. Eighty lactating Holstein cows were assigned in a 2 × 2 factorial design to: (1) CON silage without PRO (CON-CON; <span>n</span> = 20), (2) CON silage with PRO at 14 g/head/d (CON-PRO; <span>n</span> = 20), (3) INC silage without PRO (INC-CON; <span>n</span> = 20), and (4) INC silage with PRO at 14 g/head/d (INC-PRO; <span>n</span> = 20). Concurrently with the feeding trial, eight cows per treatment were chosen for nutrient digestibility. The pH of the corn silage was not affected by the silage inoculant (<span>P</span> ≥ 0.29), but INC yielded greater concentration of acetic acid and longer aerobic stability (<span>P</span> &lt; 0.01). Dairy cows fed INC had a lower mean total dry matter intake (DMI), milk protein content, and somatic cell counts vs. CON (<span>P</span> ≤ 0.02). On the other hand, milk and fat- and protein-corrected milk (FPCM) production efficiency, milk urea-N, DM, crude protein, and starch digestibility were greater for INC-fed cows (<span>P</span> ≤ 0.03). Feeding direct-fed microbials (DFM) improved mean body weight, milk yield, and FPCM, as well as milk protein and lactose yield (<span>P</span> ≤ 0.05), but reduced milk fat and protein content (<span>P</span> = 0.02). A silage inoculant × DFM interaction was observed for milk production efficiency, milk protein and lactose content, and somatic cell count (<span>P</span> ≤ 0.05). Dairy cows fed INC-CON had a greater milk production efficiency and milk lactose content (<span>P</span> ≤ 0.04), but INC-PRO had lower milk protein content and SCC (<span>P</span> ≤ 0.03). In summary, inoculating <span>L. lactis</span> and <span>L. buchneri</span> increased acetic acid content and aerobic stability of corn silage, reduced DMI, but improved milk production efficiency and nutrient digestibility of lactating Holstein dairy cows. On the other hand, feeding PRO improved milk, protein, and lactose yield. Additionally, combining the feeding of an inoculated corn silage with PRO reduced milk somatic cell count.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"5410e89fc2d0696a6dd4b6496e1c5f666b86b4289a283050d70a134ce01c5f04","category":"Environment"}