{"title":"Protecting the High Seas from Illegal, Unregulated, and Unreported Fishing with Overarching Management","link":"https://www.preprints.org/manuscript/202404.0373/v1","date":1712221347000,"content":"Food and Agricultural Organisation estimates from 2014 suggest 64% of the high seas migratory stocks are either overfished or undergoing overfishing. Illegal fishing exacerbates the damage to marine ecosystems, human rights, and food security, and is yet to be included in the recent United Nations (UN) draft agreement to protect high seas biodiversity. We used catch data from the Sea Around Us Project to determine trends in fishing gear use and the catches of countries fishing in the high seas. Using Two-way ANOVA, Principal Coordinates Analysis, and SIMPER Test, we found that Spain, Taiwan, Japan, Indonesia, and Ecuador had the highest catches in 2004-2014. Each decade, only 1 in 10 countries (10.8%) caught over 500,000 tonnes, leaving the remaining 90% of countries catching less than 500,000 tonnes. Further analysis showed the mean high seas catch per fishery decreased 55% between the 2000s and the 2010s. Purse seine and longline were increasingly used towards the 2010s. Catch from purse seine and longline accounted for 70.5% and 78.4% of total high seas catch in 1950-2014 and 2004-2014, respectively. Discards were unreported throughout 1950-2014, and the reporting levels of landings varied greatly between countries and gears. We call for immediate action and recommend (1) including international, overarching high seas governance to end illegal and unsustainable fishing in the high seas in the UN draft agreement, and (2) using large mobile marine protected areas in high seas fisheries management through the UN draft agreement.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5415a55b983b623c197198a2c731655a90250567afb4dc3ba9e3e366d72ec9eb","category":"Interdisciplinary"}