{"title":"Apple’s simplified beta process is coming to the Mac and Apple Watch","link":"https://www.macworld.com/article/1782726/macos-watchos-beta-process-profiles-apple-id.html","date":1681246966000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you installed the <a href=\"https://www.macworld.com/article/1674501/ios-16-5-beta-features-release-install.html\">iOS 16.5 beta</a> on your iPhone, you might have noticed <a href=\"https://www.macworld.com/article/671198/how-to-install-ios-beta.html\">the process was quite a bit different</a>. Now those changes are coming to macOS and watchOS as Apple streamlines its entire beta testing process ahead of WWDC.</p>\n\n\n\n<p>While you’ll still need to be enrolled in Apple’s Beta Software Program, the way OSes are downloaded and installed will soon be a much friendlier process. Like before, you’ll need to head over to the Apple Beta Software Program site, sign in with your Apple ID when prompted, and tap “Enroll your device” under the Get Started section. </p>\n\n\n\n<p>Here’s where things are different. Where you previously had to download a profile for each iOS device and the macOS Public Beta Access Utility for Macs, the new process will let you easily choose whether you want to install the next beta (macOS 13.4) or stick to the latest wide release (macOS 13.3). The same goes for the watchOS, which was previously a somewhat convoluted process that required downloading a profile to your iPhone and installing it on your watch.</p>\n\n\n\n<p>Now you only need to sign up for Apple’s Beta Software Program once and you’ll have the option to install the current public beta on any device that’s signed into that same account. On each device, you’ll see a new tab for Beta Updates, which will list the version of the beta you’re running (watchOS 9 or macOS 13 Public Beta). Tap or click the tab and you’ll see the following options: </p>\n\n\n\n<ul><li><strong>Off:</strong> You’ll no longer receive betas and your iPhone will update to the next full release when it arrives.</li><li><strong>Developer Beta:</strong> If you’re signed up for a developer account, you’ll get developer beta updates as they arrive, usually a day or two before the public beta.</li><li><strong>Public Beta: </strong>You will receive betas as they arrive and will automatically install if Automatic Updates are turned on.</li></ul>\n\n\n\n<p>You’ll also be able to sign in with a different Apple ID that is enrolled in the Apple Beta Software Program or Apple Developer Program, which will let you use a separate ID for iCloud.</p>\n\n\n\n<p>The new beta processes will become official when watchOS 9.5 and macOS 13.4 are released, likely in early May. iOS, iPadOS, and HomePod Sofware already changed with version <a href=\"https://www.macworld.com/article/1481562/ios-16-4-release-features-emoji-install.html\">16.4</a>, and tvOS has been using the system for years.</p>\n\nApple Watch, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5416debcb7d502c495d69ef50ba3e9600d256a521e7099763297d7bb6b0b34bb","category":"Apple"}