{"title":"Sam-Yellowe&rsquo;s Trichrome Staining Identifies Life Cycle Stages of Opportunistic Free-Living Colpodellids","link":"https://www.preprints.org/manuscript/202404.1719/v1","date":1714114434000,"content":"The colpodellids consist of free-living predatory protists phylogenetically related to pathogenic Apicomplexan parasites such as Plasmodium species, Cryptosporidium sp. and Toxoplasma gondii. Among the colpodellids, Colpodella species prey on bodonids, algae, and ciliates. Voromonas pontica preys on Percolomonas species. In the past decade, Colpodella species have been reported to cause opportunistic infections in humans and animals, and having the potential for zoonotic infections in humans due to the presence of Colpodella species in ticks. In the reported cases, transmission and pathogenic stages of Col-podella were not identified by light microscopy. In the colpodellid V. pontica, cyst stages of both the pred-ator and its prey Percolomonas cosmopolitus have not been identified by light microscopy. In this study we evaluated the dye components used for Sam-Yellowe’s trichrome staining, from different major vendors to determine the consistency and reproducibility of the staining protocol to aid the use of the staining proto-col for diagnosis. We show that although slight variations in the color of the stained cells are obtained, life cycle stages of Colpodella ATCC 50594 could be clearly identified, regardless of the vendor used. For the first time, Sam-Yellowe’s trichrome staining series, could identify cysts of V. pontica and its prey, demonstrating that the staining protocol can identify life cycle stages of other colpodellids. Sam-Yellowe's trichrome staining will aid molecular diagnosis of infections caused by colpodellids in human and ani-mals, identify colpodellids in ticks and flies and from environmental samples, when used for staining.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"541f29e74888428e541be59ee57b84fe68cc910b69d2cdf3179fcc9ff95cd76e","category":"Interdisciplinary"}