{"title":"Apple may steal the CES spotlight with a Vision Pro announcement this week","link":"https://www.macworld.com/article/2194198/vision-pro-announcement-week-of-ces.html","date":1704708000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The annual Consumer Electronics Show in Vegas is notable for two reasons: it’s one of the largest tech conferences of the year, and Apple never attends. But this year, Apple might still make more waves than <a href=\"https://www.techadvisor.com/article/1795975/samsung-galaxy-s24.html\" target=\"_blank\">Samsung</a>, <a href=\"https://www.pcworld.com/article/2191945/acers-2024-swift-laptops-are-designed-around-core-ultra-copilot.html\" target=\"_blank\">Acer</a>, and <a href=\"https://www.pcworld.com/article/2190855/asus-new-mini-led-is-a-retina-scorching-treat.html\" target=\"_blank\">Asus</a>.</p>\n\n\n\n<p>According to Mark Gurman’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2024-01-07/apple-2024-plans-challenges-gen-ai-vision-pro-china-sales-app-store-changes-lr3k9p8p?srnd=technology-vp&amp;xcust=1-1-2194198-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">latest Power On newsletter</a>, Apple may make a Vision Pro announcement of some sort this week “to take some of the spotlight away from CES, which begins Tuesday in Las Vegas.” He notes that Apple retail stores will hold “rare, three-hour meetings for all employees” on January 21, which is presumably to make preparations for the new device.</p>\n\n\n\n<p>It’s unclear whether the announcement will be a ship date or an invitation to a dedicated launch event. Apple unveiled Vision Pro at WWDC in June, but a standalone event would allow Apple to showcase third-party apps and any new features that weren’t previously announced. Plus it would rekindle attention for the device that was introduced seven months ago.</p>\n\n\n\n<p>There are still many unknowns about <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Vision Pro</a>, including weight, onboard storage, the cost of prescription lenses, and battery life. Apple has also been working with developers to bring third-party apps to Vision Pro, the main reason why it showed off the device many months before it planned to ship it. We also don’t know when Apple plans to bring the Vision Pro to other countries. Gurman said Apple is eyeing launches in China, Canada, and the U.K. soon after the device ships in the U.S. </p>\n\n\n\n<p>Gurman says Vision Pro sales may be initially limited to Apple Stores so customers can “get fitted with the right light seal, band and cushioning” using a face scan app. He expects stores to begin selling the device in February.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"542735e3946ef45ee259975632dee9776141f971bae0f7b2fc105d873d198b5f","category":"Apple"}