{"title":"Apple Discussed 'Punitive Measures' Against Netflix for Dropping In-App Purchases","link":"https://www.macrumors.com/2021/05/05/apple-netflix-punitive-measures-in-app-purchases/","date":1620237830000,"content":"As the <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> v. Apple trial progresses into its third day, Apple's internal documents and communications with various companies are continuing to surface, giving us some insight into the dealings that Apple has had around the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/netflix-sign-up.jpg\" />\r\n<br />\r\nBack in December 2018, Netflix <a href=\"https://www.macrumors.com/2018/12/28/netflix-no-more-itunes-billing-options/\">stopped offering in-app subscription options</a> for new or resubscribing members and instead began requiring them to sign up for Netflix outside of the ‌App Store‌ in order to avoid paying Apple's 30 percent cut. As it turns out, Apple executives were unhappy with Netflix's decision, and made attempts to persuade Netflix to keep in-app purchases available.\r\n<br />\r\n\r\n<br />\r\nThe subject hasn't yet been broached in the live in-person trial that's going on right now, but <em><a href=\"https://9to5mac.com/2021/05/05/netflix-apple-in-app-purchase/\">9to5Mac</a></em> highlighted emails between Apple executives discussing Netflix's decision. When Apple learned that Netflix was A/B testing the removal of in-app purchases in certain countries, Apple started scrambling to put a stop to it.\r\n<br />\r\n\r\n<br />\r\nApple's ‌App Store‌ Business Management Director Carson Oliver sent out an email in February 2018 outlining Netflix's testing plans and asked his fellow ‌App Store‌ executives whether Apple should take \"punitive measures\" against Netflix.<blockquote>Do we want to take any punitive measures in response to the test (for examples, pulling all global featuring during the test period)? If so, how should those punitive measures be communicated to Netflix? (sic)</blockquote>The emails do not make it clear if Apple did indeed take any steps to limit featuring during Netflix's testing, but Netflix did proceed with the A/B test and found it fruitful. Ahead of when Netflix pulled in-app purchase options, Apple designed an entire presentation to persuade Netflix to continue to offer in-app subscription sign ups.\r\n<br />\r\n\r\n<br />\r\nNetflix was concerned about voluntary churn levels on iOS because it was higher than those who signed up via the web. In a nutshell, iOS users who subscribed to Netflix through in-app purchases were cancelling their Netflix accounts at a greater rate, an issue that Apple worked to solve for Netflix.\r\n<br />\r\n\r\n<br />\r\nOther Netflix concerns included free trial abuse (which Apple addressed), un-grandfathering (raising prices on users locked in to a select price), and offering promotions (wasn't possible to offer discounts on iOS). Apple internally discussed ways to fix these problems for Netflix to encourage the company to stick with in-app purchases.\r\n<br />\r\n\r\n<br />\r\nApple also incentivized Netflix by describing how much dedicated featuring Netflix was getting. Apple said that Netflix was featured more than any other partner, something that Apple was willing to continue doing.\r\n<br />\r\n\r\n<br />\r\nApple proposed continued coordinated featuring across iOS and <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a>, ads promoting Netflix, ‌App Store‌ email campaigns, featuring performance data, an \"‌Apple TV‌ bundle\" and select video partner program benefits such as the option to up-sell non-IAP customers and billing flexibility to un-grandfather and cancel subscription charges.\r\n<br />\r\n\r\n<br />\r\nApple also discussed bundle offers for Netflix and an Apple service along with carrier and payment partners for co-funded subscription offers, as well as in-store marketing for Netflix, but none of these measures ultimately convinced Netflix to stick with in-app purchases.\r\n<br />\r\n\r\n<br />\r\nToday, there is no in-app purchase option for Netflix, and those who want to watch Netflix on an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or an <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> must first sign up on the web, with Apple collecting no money. Netflix is also not allowed to direct customers where to sign up, though, and the splash screen just says \"You can't sign up for Netflix in the app.\"\r\n<br />\r\n\r\n<br />\r\nThe ‌Epic Games‌ v. Apple trial is expected to last for approximately three weeks in total, with Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> and other executives set to testify in the coming weeks.\r\n<br />\r\n\r\n<br />\r\n<div><p><a href=\"https://www.scribd.com/document/506554389/Netflix-Exhibits-in-Epic-Games-v-Apple#from_embed\">Netflix Exhibits in Epic Ga...</a> by <a href=\"https://www.scribd.com/user/212523051/MacRumors#from_embed\">MacRumors</a></p></div><div>Tags: <a href=\"https://www.macrumors.com/guide/netflix/\">Netflix</a>, <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/05/apple-netflix-punitive-measures-in-app-purchases/\">Apple Discussed 'Punitive Measures' Against Netflix for Dropping In-App Purchases</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-discussed-punitive-measures-against-netflix-for-dropping-in-app-purchases.2294961/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=BgpnFl2U3A0:VJ-kAxr8Tzo:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=BgpnFl2U3A0:VJ-kAxr8Tzo:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/BgpnFl2U3A0\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"543921ace38cb7789bb3e928b6dcad9372867662e2904ce36c5ab9c2e608f422","category":"Apple"}