{"title":"In the (convection) zone: Astronomers eavesdrop on stars’ innate “twinkle”","link":"https://arstechnica.com/?p=1956539","date":1692737206000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Visualization of \"Twinkle, Twinkle, Little Star\" played through three sizes of massive stars. Credit: Northwestern University. </p></div>\n<p>Science 101 tells us that the twinkling appearance of stars from our vantage point on Earth is due to atmospheric effects: winds and varying temperatures and densities in the air bend and distort the light. But stars have another sort of \"twinkle\" produced by how gases ripple in waves across their surface, an effect that could provide astronomers with a handy means of exploring the interior of massive stars to learn more about how they form and evolve. But the effect is much too small to be readily detected by telescopes.</p>\n<p>So scientists have now developed the first 3D simulations of that innate twinkle, according to a <a href=\"https://www.nature.com/articles/s41550-023-02040-7\">recent paper</a> published in the journal Nature Astronomy. As a bonus, the researchers converted the data from those rippling waves of gas into an audible sound, so now we can all take a moment to listen to \"Twinkle, Twinkle, Little Star\" (see video above) and Gustav Holst's \"Jupiter\" (see video below) in the \"language\" of the stars.</p>\n<p>“Motions in the cores of stars launch waves like those on the ocean,” <a href=\"https://www.simonsfoundation.org/2023/07/27/twinkling-of-giant-stars-reveals-how-their-innards-churn-in-first-ever-simulations/\">said co-author Evan Anders</a> of Northwestern University. “When the waves arrive at the star’s surface, they make it twinkle in a way that astronomers may be able to observe. For the first time, we have developed computer models which allow us to determine how much a star should twinkle as a result of these waves. This work allows future space telescopes to probe the central regions where stars forge the elements we depend upon to live and breathe.”</p></div><p><a href=\"https://arstechnica.com/?p=1956539#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1956539&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5442fca5337a2924d1cef55a139e9b98494a0d70a3bfbf72b8c0d7977b7c1b6c","category":"Tech"}