{"title":"Feeding ecology of two reef‐associated snappers (Lutjanus fulviflamma and L. fulvus): Influence of lunar phase on feeding activity","link":"https://onlinelibrary.wiley.com/doi/10.1111/fog.12670?af=R","date":1717584592000,"content":"<h2>Abstract</h2>\n<p>The lunar phase is known to influence the spawning activity of some <i>Lutjanus</i> snappers, however, information on its influence on feeding activity is limited. In the present study, diet, feeding habit, and lunar periodicity of feeding activity on two reef-associated sympatric snappers, blackspot snapper <i>Lutjanus fulviflamma</i> (n = 339) and blacktail snapper <i>L. fulvus</i> (n = 172), were investigated by stomach content analyses in the Yaeyama region (24°N, 124°E), southern Japan. Diets of the two snappers were similar and mainly consumed fishes, crabs, and shrimps. Relative volume of the stomach contents to body weight was compared by season, lunar day, and predator size using a generalized linear model. Larger individuals fed on larger fish prey and tended to show higher stomach fullness for both snappers. Periodic regression revealed that the lunar periodicity of the feeding activity is different between the two <i>Lutjanus</i> snappers. The feeding activity of <i>L. fulviflamma</i> increased around the spring tides of both new and full moons during a single lunar cycle. On the other hand, the feeding activity of <i>L. fulvus</i> increased only before the new moon but decreased before the full moon. Spawning of <i>L. fulvus</i> is known to occur only around the full moon, and enlarged gonads are considered to suppress the feeding activity of the species. Individuals with much stomach contents did not have large gonads for both snappers, and this supports the above supposition. Spawning and feeding activities are closely linked and simultaneous temporal analysis will enable a clearer understanding of the ecological role of these predators.</p>","author":"Tamaki Shimose","siteTitle":"Wiley: Fisheries Oceanography: Table of Contents","siteHash":"ddf10675d11d4e916ea2c59904318f6a27094a133dc6841be0937d77cc7558c9","entryHash":"5447662c701eef20ef173d3ca9a172792a176311de74056e0ff9de383256ba41","category":"Environment"}