{"title":"Effect of the Temperature on the Polar and Lewis Acid-Base properties of the Adsorption of PMMA on Silica by Inverse Gas Chromatography","link":"https://www.preprints.org/manuscript/202403.0997/v1","date":1710752646000,"content":"The temperature effect plays an important role for an accurate determination of the polar free energy, polar thermodynamic parameters, and enthalpic and entropic Lewis’s acid base properties of oxides, polymers and composites polymers/oxides. The adsorption of polymers on other solid surfaces is crucial in many industrial applications, coatings, paints, catalysis, colloids and adhesion processes. (1) Background: Inverse gas chromatography at infinite was used for the physico-chemical characterization of solid substrates by determining the thermodynamic parameters of adsorption of model organic solvents on solid surfaces such as polymers, metallic oxides, carbon fibers, pharmaceutical or 3D/4D printing substrates. (2) Methods: A new method based on the London dispersion equation was applied with a new parameter associating the deformation po-larizability and the harmonic mean of the ionization energies of solvent. More accurate values of the dispersive and polar interaction energies of the various organic solvents adsorbed on PMMA in bulk phase and PMMA/silica at different recovery fractions were obtained as well as the Lewis acid-base parameters and the transition temperatures of the different composites. (3) Results: This new methodology gave very interesting results on the behavior of PMMA adsorbed on silica. An important effect of the temperature and the recovery fraction on the various physicochemical and thermodynamic properties was highlighted. The variations of all interaction parameters showed the presence of three transition temperatures for the different PMMA adsorbed on silica with the various coverage rates with a shift of these temperatures for a recovery fraction of 31% (4) Con-clusions: An important variation of the polar enthalpy and entropy of adsorption, the Lewis ac-id-base parameters and the intermolecular separation distance as a function of the temperature and the recovery fraction of PMMA on silica.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"544a7d0e1eedf920a5653966b8fae6aaf2dd5dd568dc9dc924e558e748385e3e","category":"Interdisciplinary"}