{"title":"Health literacy and its determinants among higher education students in the Alentejo region of southern Portugal—A cross-sectional survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309806","date":1727186400000,"content":"<p>by Jorge Rosário, Sara Simões Dias, Sónia Dias, Ana Rita Pedro</p>\r\nIntroduction <p>The capacity of higher education students to comprehend and act on health information is a pivotal factor in attaining favourable health outcomes and well-being. Assessing the health literacy of these students is essential in order to develop targeted interventions and provide informed health support. The aim of this study was to identify the level of health literacy and to analyse its relationship with determinants such as socio-demographic variables, chronic disease, perceived health status, and perceived availability of money for expenses among higher education students in the Alentejo region of southern Portugal.</p> Methodology <p>An observational, descriptive and cross-sectional study was conducted between 22 June and 12 September 2023. An online structured questionnaire consisting of the Portuguese version of the European Health Literacy Survey Questionnaire—16 items (HLS-EU-PT-Q16), including socio-demographic data, presence of chronic diseases, perceived health status, and availability of money for expenses. Data were analysed using independent samples t-test, one-way ANOVA, post-hoc Gabriel’s test, and multivariate logistic regression analyses at a significance level of 0.05. Regression models were used to investigate the relationship between health literacy and various determinants. The study protocol was approved by the Ethics Committee of the University of Évora, and all participants gave written informed consent.</p> Results <p>Analysis of the HLS-EU-PT-Q16 showed that 82.3% of the 1228 students sampled had limited health literacy. The mean health literacy score was 19.3 ± 12.8 on a scale of 0 to 50, with subscores of 19.4 ± 13.9 for health care, 19.1 ± 13.1 for disease prevention, and 19.0 ± 13.7 for health promotion. Significant associations were found between health literacy and several determinants. Higher health literacy was associated with the absence of chronic diseases. Regression analysis showed that lower health literacy was associated with not attending health-related courses, not living with a health professional, perceiving limited availability of money for expenses, and having an unsatisfactory health status.</p> Conclusion <p>This study improves the understanding of health literacy levels among higher education students in Alentejo, Portugal, and identifies key determinants. Higher education students in this region had relatively low levels of health literacy, which may have a negative impact on their health outcomes. These findings highlight the need for interventions to improve health literacy among higher education students and to address the specific needs of high-risk subgroups in the Alentejo.</p>","author":"Jorge Rosário","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5459574ccb63f4585d4bc4b8b9fc40f86e9f922bb9341735606c249b7c16f6f7","category":"Interdisciplinary"}