{"title":"Storage galore: New PS5 update finally lets users add more space for games","link":"https://arstechnica.com/?p=1795141","date":1631659631000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/ps5-800x450.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/ps5.png\">Enlarge</a> <span>/</span> A major new update to the PS5 firmware lets players upgrade the console's internal storage via an M.2 SSD. </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Players will be able to add specific M.2 SSDs to the PS5 with a new system update rolling out tomorrow, two months after a beta that featured the option was made available to users who signed up.</p>\n<p>As detailed in a post <a href=\"https://blog.playstation.com/2021/09/14/ps5s-september-system-software-update-launches-globally-tomorrow/\">on the PlayStation Blog</a>, the update gives users the option to increase the PS5's overall storage capacity by installing a PCIe 4.0 M.2 SSD (ranging from 250GB to 4TB) that fits certain <a href=\"https://www.playstation.com/en-us/support/hardware/ps5-install-m2-ssd/#min\">technical and dimensional requirements.</a> Once the M.2 drive is installed, the new storage space can be used to copy, download, update, and play PS4 and PS5 games as well as media applications. The result will essentially add a second, fully functional internal drive to the console.</p>\n<p>This is a big step up over the \"cold-storage\" solution <a href=\"https://arstechnica.com/gaming/2021/04/playstation-5-game-storage-will-apparently-continue-to-be-a-nightmare/\">that was added to the system</a> in April, which allowed last-gen games to run straight from a standard platter-based external hard drive or SSD via USB—and notably kept players from doing the same for PS5 games. As a result, the feature did little more than let players free up space for PS5 games by storing PS4 games on an external drive... or just letting PS5 downloads collect dust in storage, which Sony said still allowed for faster transfers back to internal storage than just redownloading from scratch. For PS5 players, this did little to alleviate problems with the console's internal 667 GB of available space.</p></div><p><a href=\"https://arstechnica.com/?p=1795141#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1795141&amp;comments=1\">Comments</a></p>","author":"Steve Haske","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"54602d124ec256de85bf83f3936a06bae2bf924032842bdd22ebfaf028d90c9e","category":"Tech"}