{"title":"Biodegradable microplastics can cause more serious loss of soil organic carbon by priming effect than conventional microplastics in farmland shelterbelts","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14662?af=R","date":1727239419000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d139b0e8-ef9b-46e9-93b4-801a3ac83bf4/fec14662-toc-0001-m.png\" alt=\"Biodegradable microplastics can cause more serious loss of soil organic carbon by priming effect than conventional microplastics in farmland shelterbelts\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/13/biodegradable-microplastics-can-cause-more-serious-loss-of-soil-organic-carbon-than-conventional-microplastics-in-farmland-shelterbelts/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nGlobally, the widespread utilization of plastic products has resulted in the accumulation of microplastics (MPs) in the soil. MPs have the potential to impact the loss of soil organic carbon (SOC). Nevertheless, the influence of different types of MPs on SOC loss remains uncertain.\n\nIn this study, a 38 day incubation experiment with two kinds of conventional MPs (polyethylene, polypropylene) as well as two kinds of biodegradable MPs (polyhydroxyalkanoate [PHA], polylactic acid [PLA]) were added into three types of soil (loam, sandy loam, and sandy soil) in farmland shelterbelts, and the sources of CO<sub>2</sub> emissions was distinguished by the difference in <sup>13</sup>C isotope abundance between the biodegradable MPs (PHA and PLA) (−10.02‰ to −9.92‰) and the soil (−24.39‰ to −22.86‰) (&gt;10‰).\n\nIn conjunction with the structural characterization of MPs, as well as soil physicochemical properties and microbial characteristics, we observed that the conventional MPs did not degrade in short term incubation, but significantly enhance soil-derived CO<sub>2</sub> emissions by altering the dissolved N content (NH4+$$ {\\mathrm{NH}}_4^{+} $$-N and dissolved total N [DTN]) and reducing microbial biomass carbon content only in sandy loam soil (<i>p</i> &lt; 0.05). Biodegradable MPs degraded significantly, and enhanced soil-derived CO<sub>2</sub> emissions by reducing soil DTN and NO3−$$ {\\mathrm{NO}}_3^{-} $$-N contents in loam, sandy loam and sandy soil (<i>p</i> &lt; 0.05).\n\nOverall, the input of biodegradable MPs causes a more serious loss of SOC than conventional MPs as the soil sand content increased in short term incubation, which needs to be considered in predicting the global impact of increasing biodegradable MPs pollution.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/13/biodegradable-microplastics-can-cause-more-serious-loss-of-soil-organic-carbon-than-conventional-microplastics-in-farmland-shelterbelts/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Kaitao Jia, \nSiming Nie, \nMengfei Tian, \nWenxue Sun, \nYuan Gao, \nYaru Zhang, \nXiaofei Xie, \nZiqi Xu, \nChunjian Zhao, \nChunying Li","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"5469a3d1e788312ee93398916184ec97c84e4189420f74eb046ab18b4a342989","category":"Environment"}