{"title":"Cross-frequency coupling in cortico-hippocampal networks supports the maintenance of sequential auditory information in short-term memory","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002512","date":1709647200000,"content":"<p>by Arthur Borderie, Anne Caclin, Jean-Philippe Lachaux, Marcela Perrone-Bertollotti, Roxane S. Hoyer, Philippe Kahane, Hélène Catenoix, Barbara Tillmann, Philippe Albouy</p>\r\n\r\nIt has been suggested that cross-frequency coupling in cortico-hippocampal networks enables the maintenance of multiple visuo-spatial items in working memory. However, whether this mechanism acts as a global neural code for memory retention across sensory modalities remains to be demonstrated. Intracranial EEG data were recorded while drug-resistant patients with epilepsy performed a delayed matched-to-sample task with tone sequences. We manipulated task difficulty by varying the memory load and the duration of the silent retention period between the to-be-compared sequences. We show that the strength of theta-gamma phase amplitude coupling in the superior temporal sulcus, the inferior frontal gyrus, the inferior temporal gyrus, and the hippocampus (i) supports the short-term retention of auditory sequences; (ii) decodes correct and incorrect memory trials as revealed by machine learning analysis; and (iii) is positively correlated with individual short-term memory performance. Specifically, we show that successful task performance is associated with consistent phase coupling in these regions across participants, with gamma bursts restricted to specific theta phase ranges corresponding to higher levels of neural excitability. These findings highlight the role of cortico-hippocampal activity in auditory short-term memory and expand our knowledge about the role of cross-frequency coupling as a global biological mechanism for information processing, integration, and memory in the human brain.","author":"Arthur Borderie","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"5473f138dfc3364021f5fc8480a3e5281f6b5508cdec3acbf0bb834907beae2b","category":"Environment"}