{"title":"Visualization system to identify structurally vulnerable links in OHT railway network in semiconductor FAB using betweenness centrality","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307059","date":1720792800000,"content":"<p>by Jinwoo Choi, Youngbin Park, Yeeun Choi, Sehyeon Kim, Heewon Lee, Hyunwoo Park</p>\r\n\r\nIn semiconductor fabrication (FAB), wafers are placed into carriers known as Front Opening Unified Pods (FOUPs), transported by the Overhead Hoist Transport (OHT). The OHT, a type of Automated Guided Vehicle (AGV), moves along a fixed railway network in the FAB. The routes of OHTs on the railway network are typically determined by a Single Source Shortest Path (SSSP) algorithm such as Dijkstra’s. However, the presence of hundreds of operating OHTs often leads to path interruptions, causing congestion or deadlocks that ultimately diminish the overall productivity of the FAB. This research focused on identifying structurally vulnerable links within the OHT railway network in semiconductor FAB and developing a visualization system for enhanced on-site decision-making. We employed betweenness centrality as a quantitative index to evaluate the structural vulnerability of the OHT railway network. Also, to accommodate the unique hierarchical node-port structure of this network, we modified the traditional Brandes algorithm, a widely-used method for calculating betweenness centrality. Our modification of the Brandes algorithm integrated node-port characteristics without increasing computation time while incorporating parallelization to reduce computation time further and improve usability. Ultimately, we developed an end-to-end web-based visualization system that enables users to perform betweenness centrality calculations on specific OHT railway layouts using our algorithm and view the results through a web interface. We validated our approach by comparing our results with historically vulnerable links provided by Samsung Electronics. The study had two main outcomes: the development of a new betweenness centrality calculation algorithm considering the node-port structure and the creation of a visualization system. The study demonstrated that the node-port structure betweenness centrality effectively identified vulnerable links in the OHT railway network. Presenting these findings through a visualization system greatly enhanced their practical applicability and relevance.","author":"Jinwoo Choi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"547460bbc358c6963e70c10cefaf9172e5cd7d2107c22eb9aa0987c0a7b8ee48","category":"Interdisciplinary"}