{"title":"Will the carbon emissions trading system promote enterprises' willingness to pay for carbon emission reduction?","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12519?af=R","date":1720006735000,"content":"<h2>Abstract</h2>\n<p>The emissions trading system (ETS) is one of the effective measures for energy conservation and emissions reduction, and the impact of the carbon ETS can be reflected in the willingness of enterprises to pay for carbon emissions reductions. However, there has been little research exploring the relationship between the two. Therefore, this study fills this knowledge gap by comprehensively investigating the influence of China carbon ETS policy (ETSP) on the willingness of enterprises to pay for carbon emissions reductions, and incorporates environmental awareness (EA), green technology innovation (GTI), and climate risk awareness (CRA) into the research model, thus constructing a new theoretical framework. Empirical analysis is conducted using the structural equation modeling method based on survey data from 478 Chinese enterprises. The results indicate that: (1) the China carbon ETSP can promote the willingness of enterprises to pay for carbon emissions reductions. (2) The China carbon ETSP can also promote the EA, GTI, and CRA of enterprises. (3) EA, GTI, and CRA can also promote the willingness of enterprises to pay for carbon emissions reductions. (4) Mediation effect analysis revealed that EA and CRA, respectively, play a mediating role in the influence process of the China carbon ETSP on the willingness of enterprises to pay for carbon emissions reductions. However, GTI does not have a mediating effect in this process. (5) Comparative mediation analysis found no significant differences in the mediating effects of EA and CRA. This study provides constructive practical recommendations for future carbon market mechanism construction and enterprise emission reduction policy formulation. It also offers guidance and reference for the behavioral decision-making of enterprises in carbon market transactions, and carries practical significance and policy advocacy value.</p>","author":"Zhibin Tao, \nJiaxiao Chao","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"5478008f30ef19e00375dcef0f29c4800ba0e4ffde7d52e4176c41f0a036a69b","category":"Environment"}