{"title":"Metastasis diagnosis using attenuated total reflection-Fourier transform infra-red (ATR-FTIR) spectroscopy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304071","date":1717164000000,"content":"<p>by Samuel Onuh Abuh, Ayan Barbora, Refael Minnes</p>\r\n\r\nThe suitability of Fourier transform infrared spectroscopy as a metastasis prognostic tool has not been reported for some cancer types. Our main aim was to show spectroscopic differences between live un-preprocessed cancer cells of different metastatic levels. Spectra of four cancer cell pairs, including colon cancer (SW480, SW620); human melanoma (WM115, WM266.4); murine melanoma (B16F01, B16F10); and breast cancer (MCF7, MDA-MB-231); each pair having the same genetic background, but different metastatic level were analyzed in the regions 1400–1700 cm<sup>-1</sup> and 3100–3500 cm<sup>-1</sup> using Principal Component Analysis, curve fitting, multifractal dimension and receiver operating characteristic (ROC) curves. The results show spectral markers I<sub>1540</sub>/I<sub>1473</sub>, I<sub>1652</sub>/I<sub>1473</sub>, A3400A3200, and multifractal dimension of the spectral images are significantly different for the cells based on their metastatic levels. ROC curve analysis showed good diagnostic performance of the spectral markers in separating cells based on metastatic degree, with areas under the ROC curves having 95% confidence interval lower limits greater than 0.5 for most instances. These spectral features can be important in predicting the probability of metastasis in primary tumors, providing useful guidance for treatment planning. Our markers are effective in differentiating metastatic levels without sample fixation or drying and therefore could be compactible for future use in in-vivo procedures involving spectroscopic cancer diagnosis.","author":"Samuel Onuh Abuh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"548fa62d9e03516e1f068f4166c98835a67a0324ba00c4b6f3faad0ef5bbbdae","category":"Interdisciplinary"}