{"title":"You don’t win friends with bad salad! A gene editing approach to enhance the powdery mildew resistance in cucumber","link":"https://academic.oup.com/plphys/article/195/2/908/7628501?rss=1","date":1710374400000,"content":"<span>One of the biggest challenges for agriculture lies in finding strategies that minimize crop yield loss due to pests and diseases. Powdery mildew (PM) is a widespread fungal disease that affects a diverse range of crops; for example, in cucumber (<span>Cucumis sativus L.</span>), PM can cause losses of up to 40% (<a href=\"#kiae160-B5\">He et al. 2022</a>). Various studies have focused on identifying PM resistance (PMR) genes that benefit cucumber breeding programs (<a href=\"#kiae160-B7\">Liu et al. 2008</a>). The characterization of quantitative trait loci (QTL) for mapping PMR linked the disruption of the <span>Mildew resistance Locus 8</span> (<span>CsMLO8</span>) gene with the PM resistance in cucumber. However, although the loss of function of <span>CsMLO8</span> is indispensable for the PMR, it is not enough to generate a complete resistance (<a href=\"#kiae160-B8\">Nie et al. 2015a</a>, <a href=\"#kiae160-B9\">2015b</a>; <a href=\"#kiae160-B1\">Berg et al. 2015</a>). The PM-resistant QTL also contains other members of the <span>CsMLO</span> family, pointing out that more than 1 <span>CsMLO</span> gene is involved in PM resistance (<a href=\"#kiae160-B10\">Schouten et al. 2014</a>). A recent study characterized the MLO proteins as calmodulin-gated calcium channel proteins (<a href=\"#kiae160-B4\">Gao et al. 2022</a>), suggesting that calcium signaling is involved in <span>mlo</span>-mediated PM resistance. However, both the components and mechanism of PM resistance remain not fully understood.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"54969c18ad72d339e26f4a2f4573b49c039e9765740aab6576f5767c27394fcb","category":"Environment"}