{"title":"The Sealing of Copper Pipes by Ultrasonic Welding for Heat Pump and Refrigeration Applications","link":"https://www.preprints.org/manuscript/202406.1778/v1","date":1719316234000,"content":"Heat pumps are increasingly becoming a key solution in the quest for decarbonization, offering a significant advantage over traditional boilers due to their superior energy efficiency. Not only can heat pumps provide both heating and cooling, but they also achieve thermal efficiencies exceeding 500%, which can seem to defy conventional expectations. The outdoor unit of a heat pump consists of about twenty main components, one of which is a complex network of copper pipes and sheets welded to valves, connectors, and other fittings. This set involves over thirty welded joints, highlighting a significant opportunity for reducing manufacturing time through process optimization. Copper is a critical material extensively used in various applications due to its excellent thermal and electrical conductivity. However, these very properties make welding copper particularly challenging, especially when aiming to automate and streamline industrial processes. Traditionally, connecting copper pipes and fittings is done through brazing, yet, alternative methods such as LASER welding, electron beam welding, resistance welding, friction welding, and ultrasonic welding also exist. This study focuses on the ultrasonic welding of copper, aiming to identify the optimal parameters that maximize the mechanical strength of overlapping joints and ensure effective tube sealing. Experimental results showed that for copper sheets, the best outcomes were achieved with a welding time of 3 s and a pressure of 6 bar. For tube sealing, the optimal conditions were a welding time of 3 s and a pressure of 4 bar. For both scenarios, the same variables were used, retention time of 0.62 s, initial pressure of 2 bar, retention pressure of 2 bar and sonotrode rising pressure of 3 bar.\nThe analysis reveals that ultrasonic welding of copper can achieve both robust mechanical strength and reliable sealing, making it a promising technique for industrial applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5499f1859f5772a71f1fb408f9137e7aceaa044790ea3ff2a91c05958852d376","category":"Interdisciplinary"}