{"title":"Comparing Strategies and Success of Policy Entrepreneurs in EU Energy and Climate Policy Processes","link":"https://www.preprints.org/manuscript/202409.1145/v1","date":1726618591000,"content":"BackgroundThe clean energy transition required for decarbonisation of our societies make policymakers targets for broad business and non-business advocacy to ensure one’s often conflicting interests are protected or taken into consideration in public policies. The concept of policy entrepreneurs foregrounds the role of agency in understanding such acts of advocacy. This paper compares strategies used by policy entrepreneurs from different social spheres, advocating policy change or status quo, in four longitudinal cases related to European Union energy and climate policy 2011–2023. ResultsPolicy entrepreneurship was mainly of a cultural-institutional nature, aiming at altering or diffusing people’s perceptions, beliefs, norms and cognitive frameworks, worldviews, or institutional logics. But the actions of the European Commission did also include structural entrepreneurship, aiming at overcoming structural barriers to enhance governance influence by altering the distribution of formal authority and factual and scientific information. Motifs of policy entrepreneurs in the four cases differ, but strategies do not differ significantly between the public, private and civic spheres of society. Results indicate that civil society policy entrepreneurs focus on building broader coalitions than public and private sector entrepreneurs. There is no indication that policy entrepreneurs from a certain sector would be more successful than others in setting the agenda, changing perceptions of policy actors, or influencing actual policy change. However, policy entrepreneurs advocating policy change are more active and use more elaborated strategies than policy entrepreneurs advocating status quo. ConclusionsIt is concluded that policy entrepreneurs advocating policy change are more active and use more elaborated strategies than policy entrepreneurs advocating status quo. Thus, they are more successful in influencing policy outcomes. The European Commission was the only policy entrepreneurs to use structural entrepreneurship. the Commission acts to expand its reach into areas where the European Union does not hold much legal competence according to the constitution of the European Union. This comes with democratic deficits related to accountability and legitimacy and should be combated to reinstate and reinforce the position and powers of both the national and European legislators in taking the important decisions that impact the lives of European citizens.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5499c1a9ce96a4baab2307b30ddb83a6789cd346113ddb4273e0e9dc88e2171f","category":"Interdisciplinary"}