{"title":"Exploring the tumor microenvironment: Chemokine‐related genes and immunotherapy/chemotherapy response in clear‐cell renal cell carcinoma","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24190?af=R","date":1710507670000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>The treatment of clear-cell renal cell carcinoma (ccRCC) remains challenge. Chemokines laid impact on the proliferation and metastasis of cancer cells. The objective was to identify the chemokine-related genes and construct a prognostic model for ccRCC.</p>\n<h2>Methods</h2>\n<p>Bulk transcriptomic data (<i>n</i> = 531), single-cell RNA sequencing (scRNA-seq) dataset GSE159115, and other validation cohorts were acquired from the Cancer Genome Atlas Program (TCGA) and GEO databases. All clustering analysis was conducted by Seurat R package. Gene set enrichment analysis (GSEA), immune infiltration analysis, single nucleotide variations (SNV) analysis, and predictive response analysis of immunotherapy/chemotherapy were conducted. 786-O and A498 cell lines were cultured and applied into CCK-8, Western blot, and RT-qPCR kits.</p>\n<h2>Results</h2>\n<p>Univariate Cox analysis was used to screen out chemokine-related genes related to survival. ZIC2, SMIM24, COL7A1, IGF2BP3, ITPKA, ADAMTS14, CYP3A7, and AURKB were identified and applied for the construction of the prognostic model. High-risk group had a poorer prognosis than the low-risk group in each dataset. Memory CD8+ T cells, macrophages, and memory B cells were higher in the high-risk group, while the content of basophils was higher in the low-risk group. Bortezomib_1191, Dactinomycin_1911, Docetaxel_1007, and Daporinad_1248 were more sensitive to high-risk groups than low-risk groups. Moreover, we found that IGF2BP3 significantly elevated in both 786-O and A498 cell lines resistance to sunitinib. Knockdown of IGF2BP3 markedly reduced ccRCC cell migration and viability.</p>\n<h2>Conclusion</h2>\n<p>Our study has yielded a novel prognostic model of chemokine-related genes based on comprehensive transcriptional atlas of ccRCC patients, shedding light on the significant impact of the tumor microenvironment on biology and immunotherapy response of ccRCC. We identified IGF2BP3 as a pivotal regulator in regulating ccRCC resistance to sunitinib.</p>","author":"Yuhao Meng, \nChen Zhang, \nTongfei Fu, \nJiaheng He, \nJunsong Wu, \nYongli Zhan","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"54a059b1970f5769f0ca7dcda42efca492da6a87561dfb10143e29a2707a08e3","category":"Environment"}