{"title":"20 percent of Switch sales now going to households that already had a Switch","link":"https://arstechnica.com/?p=1765955","date":1621378811000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/08/switchlite-9-980x653.jpg\" /></div>\n        <p>\n          Congratulations! It's a bouncing, baby gaming console!                      [credit:\n                        <a href=\"https://www.nintendo.com/\">Nintendo</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>In the last year, Nintendo sold roughly 5.8 million Switch units to households that already had at least one Switch. That's according to <a href=\"https://www.nintendo.co.jp/ir/pdf/2021/210507e.pdf\">a recently translated investor Q&amp;A</a> in which Nintendo President Shuntaro Furukawa said that \"household demand for multiple systems accounted for roughly 20% of [28.83 million] unit sales of the Nintendo Switch family of systems\" for the fiscal year ending March 31.</p>\n<p>While Nintendo <a href=\"https://www.nintendo.co.jp/ir/pdf/2019/190208e.pdf\">said in 2019</a> that \"some households have already purchased multiple consoles,\" this is our first concrete look into just how much multi-Switch households are contributing to the Switch's sales, which now amount to over 85 million units over the system's lifetime. And Furukawa thinks the trend of multi-Switch households is only set to increase.</p>\n<p>\"Going forward, we expect demand for multiple systems per household will increase even as hardware unit sales grow,\" he said. \"By region, significant sales growth is continuing in Asia, and we believe there is still room for sufficient growth of new demand in Europe and the United States, considering the sizes of those populations. To this end, we must thoroughly convey the appeal of existing titles and future titles to consumers.\"</p></div><p><a href=\"https://arstechnica.com/?p=1765955#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1765955&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"54a85b9147616f4b7035f027c7ac31f016284a18429defe7fd04f04230d1baef","category":"Tech"}