{"title":"Robotic dog for navigation of a rehabilitation wheelchair robot in a highly constrained environment","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310024","date":1726840800000,"content":"<p>by Bibhya Sharma</p>\r\n\r\nAdaptation to technological advancements and intelligent digital tools can enable healthcare providers to overcome the challenges of their patient-oriented care systems and processes. One such intelligent tool is automated assistive robots, which can improve patient care and safety in the health sector. This paper presents an invariant set of continuous nonlinear control laws for an assistive robot and a rehabilitation wheelchair robot modeled as a new autonomous robotic dog and rehabilitation wheelchair system for navigating a highly constrained environment. The control laws are derived from the Lyapunov-based control scheme classified under the umbrella of artificial potential field (APF) methods, and inherently proved stability of the new heterogeneous system. The robotic dog guides the wheelchair robot during the navigation process in a cluttered environment where the avoidances are from the robotic dog and the integrated dynamic protective polygon. The wheelchair traverses the obstacle-free path traced by the dynamic polygon. The leash is flexible, and its length is bounded, which invariably provides the protective polygon to change its intrinsic dimension. Thus, the dual-robot system has increased mobility for obstacle avoidance and passing through narrow passageways. The solution proffered herein is only feasible in a highly constrained and isolated human environment where nothing else appears to be moving in the direction of the robotic dog and wheelchair. The computer simulations and associated convergence graphs present the efficacy of the unique control laws for the new heterogeneous robotic system. Adoption of such control laws and their suitable variants can make a big impact in the healthcare industry.","author":"Bibhya Sharma","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"54b0bd7665935a5fa41828cb26baf7c12c73bf54c4f6d43572aa0cf3c1064e83","category":"Interdisciplinary"}