{"title":"A new active packaging system based on chickpea‐based edible coatings added with microcapsules of Cosmos sulphureus Cav. flower extract","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13715?af=R","date":1720012201000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The <i>Cosmos sulphureus</i> Cav. plant is studied for its high polyphenolic content with antioxidant properties. Its flowers, rich in phenolic acids, flavonoids, and tannins, hold promise as antioxidants in food preservation. The inclusion of these compounds in chickpea-based coatings with a previously studied preservative effect would be an excellent option as a food preservation method and microencapsulation addresses challenges like dispersion and degradation of polyphenols in the coating. The objective of this research was to evaluate the <i>in vitro</i> antioxidant activity of <i>Cosmos sulphureus</i> leaves, seed, and flower extracts and explore the protective effects of chickpea-based coatings containing microcapsules of flower polyphenolic extract on the chemical quality of stored roasted sunflower seeds during storage.</p>\n<h2>RESULTS</h2>\n<p>The ethanolic leaf extract exhibited the highest antiradical activity, followed by the aqueous flower extract. After a storage period of 15 days, at 40 °C, the chickpea-based coatings effectively delayed lipid oxidation in the roasted sunflowers seeds, and the inclusion of polyphenolic microcapsules with 0.01% extract (SMC 0.01%) in the coating significantly improved the protective effect. By day 15 of storage, SMC 0.01% showed comparable peroxide value, conjugated dienes, and linoleic acid content to samples containing the synthetic antioxidant BHT (butylated hydroxytoluene). Samples that only contained chickpea-based coating and coating with polyphenolic microcapsules with 0.005% extract exhibited significantly greater reduction in fatty acid content compared to the 0.01% SMC treatment.</p>\n<h2>Conclusion</h2>\n<p>The chickpea-based coating with polyphenolic microcapsules demonstrated antioxidant activity akin to synthetic BHT, offering a promising biopackaging solution for lipid-rich foods like roasted sunflower seeds. © 2024 Society of Chemical Industry.</p>","author":"Ornella F. Camiletti, \nM. Cecilia Prieto, \nAntonella E. Bergesse, \nLeonardo G. Vera, \nNelson R. Grosso","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"54b1a8cce821bbc8b3858752f24965fa133b6a452c323b2b113cedfe161bc487","category":"Environment"}