{"title":"Perspective and Challenges in Oral Cancer Screening Practices of Primary Care Providers","link":"https://www.preprints.org/manuscript/202408.1142/v1","date":1723725616000,"content":"Abstract\n\n\nObjectives: The aim of this study is to understand the rationale for the lack of interest to perform regular opportunistic oral cancer screening (OCS) by primary care providers (PCPs) and the challenges they have in incorporating OCS into their annual examination protocol. \n\nMethod: Sequential exploratory mixed methods were used. Both qualitative and quantitative data from PCPs working at Nebraska Medicine were obtained. One-on-one in-depth interviews were performed to identify PCP's perceptions and challenges in performing OCS. The themes identified in the qualitative study were used as a guide in the development of survey questionnaires. The survey was emailed to all the PCPs (N=100), whose information was available on the Nebraska Medicine publicly accessible website.\n\n Results: The response rate was 34%. Approximately 60% of the participants mentioned that they currently perform oral cancer screening, but only 3.8% of the providers answered that they were performing comprehensive oral cancer screening every time. Forty-eight percent of the providers identified time as the biggest challenge. Over 35.3% of the providers answered that they perform screenings for patients with a history of tobacco (i.e., smoking) or alcohol use. \n\nConclusion: Around half of the participants identified lack of time as their primary challenge in performing OCS and lack of knowledge as their second main obstacle. Very few provided comprehensive OCS and visual examination of the oral cavity is the only step performed often. \n\n\n\n\n\nKeywords: Oral cancer screening - Primary care providers - Oropharyngeal cancer-early detection of cancer-cancer screening-care providers-Health care professionals, health care providers","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"54b307e4a3b4d153222b7ceddb3827f5f00b7fb948e8e1968bda84598dfd2fa3","category":"Interdisciplinary"}