{"title":"Beyond the visible: Accounting for ultraviolet and far‐red radiation in vegetation productivity and surface energy budgets","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17346?af=R","date":1716794069000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/0a0373ad-d4d7-467a-9ce6-58e7f7c78fe8/gcb17346-toc-0001-m.png\" alt=\"Beyond the visible: Accounting for ultraviolet and far-red radiation in vegetation productivity and surface energy budgets\" />\n<p>Earth's surface receives an average of 105 W ultraviolet and far-red energy per meter square, and plants can use them for photosynthesis. However, most climate models do not explicitly consider this, thus subjecting to biased plant productivity and surface energy budget predictions. Moving to hyperspectral radiative transfer models could help resolve the problem.</p>\n<br />\n<h2>Abstract</h2>\n<p>Photosynthetically active radiation (PAR) is typically defined as light with a wavelength within 400–700 nm. However, ultra-violet (UV) radiation within 280–400 nm and far-red (FR) radiation within 700–750 nm can also excite photosystems, though not as efficiently as PAR. Vegetation and land surface models (LSMs) typically do not explicitly account for UV's contribution to energy budgets or photosynthesis, nor FR's contribution to photosynthesis. However, whether neglecting UV and FR has significant impacts remains unknown. We explored how canopy radiative transfer (RT) and photosynthesis are impacted when explicitly implementing UV in the canopy RT model and accounting for UV and FR in the photosynthesis models within a next-generation LSM that can simulate hyperspectral canopy RT. We validated our improvements using photosynthesis measurements from plants under different light sources and intensities and surface reflection from an eddy-covariance tower. Our model simulations suggested that at the whole plant level, after accounting for UV and FR explicitly, chlorophyll content, leaf area index (LAI), clumping index, and solar radiation all impact the modeling of gross primary productivity (GPP). At the global scale, mean annual GPP within a grid would increase by up to 7.3% and the increase is proportional to LAI; globally integrated GPP increases by 4.6 PgC year<sup>−1</sup> (3.8% of the GPP without accounting for UV + FR). Further, using PAR to proxy UV could overestimate surface albedo by more than 0.1, particularly in the boreal forests. Our results highlight the importance of improving UV and FR in canopy RT and photosynthesis modeling and the necessity to implement hyperspectral or multispectral canopy RT schemes in future vegetation and LSMs.</p>","author":"Yujie Wang, \nRenato K. Braghiere, \nYi Yin, \nYitong Yao, \nDalei Hao, \nChristian Frankenberg","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"54b6994d0c4a788a8a83d16b0984e55235c46dc89f0ce6e6ef4a355807565aa0","category":"Environment"}