{"title":"Mechanical excavation of wetland habitat failed to eradicate invasive American red swamp crayfish (Procambarus clarkii) in Malta","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12325?af=R","date":1714124443000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/c2ab1a76-4045-44da-9316-361767966b50/eso312325-toc-0001-m.png\" alt=\"Mechanical excavation of wetland habitat failed to eradicate invasive American red swamp crayfish (Procambarus clarkii) in Malta\" />\n<p>Invasive crayfish pose a persistent problem to freshwater ecosystems globally, and there are limited effective eradication measures. An ecological restoration project in Malta attempted to eradicate the crayfish through mechanical excavation. However three years post-project the crayfish were abundant throughout the project site showing eradication failed.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nInvasive crayfish are an important ecological concern in many freshwater ecosystems. Many efforts have been made to eradicate them, but there is very little documentation of the effectiveness of these efforts. Between 2019 and 2020, a restoration project funded by the European Regional Development Fund tried to eradicate invasive American red swamp crayfish <i>Procambarus clarkii</i> from the Fiddien valley system in Malta by mechanically excavating the valley's stream bed and exporting contaminated debris securely off-site to a dry quarry.\n\nThree years post-intervention, we systematically surveyed the valley system to explore the distribution and relative abundance of the invasive crayfish population. We placed traps in a stratified random sample of stream segments (both those that were included in the original restoration project and those that were not) and recorded catch per unit effort (crayfish caught per trap night) and the size/frequency distribution of crayfish caught.\n\nThe invasive crayfish were still abundant in the upper reaches of the valley system, and, despite the excavation effort, crayfish were present at the highest relative abundance (4.3–14.8 CPUE, median = 12.3) within the restored area.\n\nDespite substantial effort and spending of more than 700,000 €, mechanical excavation did not eradicate invasive crayfish populations. We urge caution for future projects planning to attempt crayfish eradication using this approach and call for much greater impact evaluation, and at the very least post-project monitoring, to ensure lessons can be learnt from such failures in future.\n</p>","author":"Alex Caruana, \nBenjamin Camilleri, \nLuke Farrugia, \nJulia P. G. Jones","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"54b7bf1e63f8ed84f7671f528aee03d8a62f6c10842db5b41498962848e0715f","category":"Environment"}