{"title":"Chipmakers fight spread of US crackdowns on “forever chemicals”","link":"https://arstechnica.com/?p=1926260","date":1679579054000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/chip-fab-800x534.jpg\" alt=\"Chips on a wafer\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/chip-fab.jpg\">Enlarge</a> <span>/</span> The surface of a semiconductor wafer in the cleanroom at the Tower Semiconductor Ltd. plant in Migdal HaEmek, Israel, on Monday, Feb. 28, 2022. Intel Corp. agreed to acquire Tower Semiconductor for about $5.4 billion, part of Chief Executive Officer Pat Gelsingers push into the outsourced chip-manufacturing business. Photographer: Kobi Wolf/Bloomberg via Getty Images (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/the-surface-of-a-semiconductor-wafer-in-the-cleanroom-at-news-photo/1238848989\">Kobi Wolf/Bloomberg via Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Intel and other semiconductor companies have joined together with industrial materials businesses to fight US clampdowns on “forever chemicals,” substances used in myriad products that are slow to break down in the environment.</p>\n<p>The lobbying push from chipmakers broadens the opposition to new rules and bans for the chemicals known as PFAS. The substances have been found in the blood of 97 percent of Americans, according to the US government.</p>\n<p>More than 30 US states this year are considering legislation to address PFAS, according to Safer States, an environmental advocacy group. Bills in California and Maine passed in 2022 and 2021, respectively.</p></div><p><a href=\"https://arstechnica.com/?p=1926260#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1926260&amp;comments=1\">Comments</a></p>","author":"Financial Times","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"54b71644d0c511e088939a39848ee8f785a99abfb53a06d408dd2bee5fbc060d","category":"Tech"}