{"title":"Caffeine and Rapamycin Impair Growth and Morphogenesis by Affecting Both TOR-Dependent Pathways in Dictyostelium","link":"https://www.preprints.org/manuscript/202407.0276/v1","date":1719967777000,"content":"ABSTRACTCaffeine is known to impair both growth and development in the model social amoeba Dictyostelium discoideum. However, little is known about the transcriptional regulation in response to caffeine treatment in Dictyostelium. In yeast cells, caffeine mimics the effect of rapamycin in inhibiting mTORC1 activity. Here, we investigated whether changes in growth and development of Dictyostelium in the presence of caffeine or rapamycin are mediated by mTORC1 and/or mTORC2. Results: Treatment of wild type cells with caffeine or rapamycin resulted in severely impaired growth and in the formation of small aggregates in comparison to untreated cells. rip3‾ cells (lacking a mTORC2 component) and lst8‾cells (lacking a component of both mTOR complexes) showed higher and slower growth rates, respectively, in comparison to parental AX3 cells. Parental AX3 and rip3‾ cells displayed similar sensitivity to rapamycin and caffeine, while lst8‾ cells were more sensitive to these compounds. When developed in the presence of caffeine or rapamycin, AX3 cells formed aggregates after a long delay. Caffeine did not alter the morphology of small rip3‾ mounds and lst8‾ cells continued to remain solitary. However, in the presence of 1µM rapamycin rip3‾cells failed to form mounds while AX3 cells streamed and formed aggregates. Complementation of lst8‾ cells with the wild type lst8 gene rescued the aggregation phenotype. cDNA microarray analysis to uncover the spectrum of differentially regulated genes in response to caffeine treatment revealed 104 and 193 differentially expressed genes at 3-and 6-hours of development, respectively, in comparison to control cells. After 6 hours of starvation in the presence of caffeine, 25 genes encoding ribosomal proteins and 4 encoding elongation factors were up regulated. Furthermore, we identified that upon caffeine treatment at the 3- and 6-hours’ time points, 12 (10 up and 2 down) and 21 (13 up and 8 down) genes, respectively, encoding proteins involved in early development.  Conclusion: We conclude that caffeine and rapamycin have similar effects in decreasing the growth rate and in reducing the aggregate size of D. discoideum. Studies with lst8‾ and rip3‾ cells suggest that these compounds affect cell growth and aggregation by acting on both mTOR complexes, mTORC1 and mTORC2. Analysis of the differentially expressed genes after caffeine treatment suggests a key role of these genes in growth and aggregation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"54bcc52b807070ef3e411ca8a69df944d9dfaa45ce63b1929fa8422cb1ca3e51","category":"Interdisciplinary"}