{"title":"Best downcountry mountain bikes of 2021 | Top-rated downcountry MTBs and buyer’s guide","link":"https://www.bikeradar.com/advice/buyers-guides/best-downcountry-mountain-bikes/","date":1626444022000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Specialized-Epic-EVO-Expert-01-b91c80c.jpg?quality=90&amp;resize=620,413\" />                                            <p>Imagine a bike that can tackle all-day epic rides with ease and efficiency, cover ground extremely fast and has just the right mix of componentry to fly down descents and you’re on your way to picturing the best downcountry mountain bikes.</p>\n<p>Here we list the best downcountry mountain bikes in 2021, as tested and rated by our expert reviewers at BikeRadar and <a href=\"https://www.mbuk.com/\" target=\"_blank\">MBUK</a>.</p>\n<p>A relative newcomer to the <a href=\"https://www.bikeradar.com/mtb/\">mountain bike</a> scene, downcountry bikes are quickly growing in popularity because they give you everything you need and nothing you don’t.</p>\n<p>Many of these bikes started life as race-ready cross-country mountain bikes, but they have been given some extra travel and a more progressive geometry while retaining their XC speed.</p>\n<p>Not all downcountry bikes are built the same, though. While some are more like beefed-up <a href=\"https://www.bikeradar.com/advice/buyers-guides/top-5-2021-cross-country-bikes/\">cross-country mountain bikes</a>, others are closer to paired back, adrenaline-seeking trail bikes.</p>\n<p>We’ve put together a buyer’s guide at the end of this article to help you choose the best downcountry bike for you and to help explain this new category of bike.</p>\n<section><div>\n        <h2>The best downcountry mountain bikes in 2021, as tested by our expert reviewers</h2>\n<ul><li><strong>Transition Spur X01: </strong>£6,000 / $6,499 / AU$10,499 </li>\n<li><strong>Specialized Epic EVO Expert:</strong> £6,750 / $6,300 / AU$10,100 / €6,699</li>\n<li><strong>YT Izzo Pro Race:</strong> £4,599 / $5,299 / AU$83,99 / €5,299</li>\n<li><strong>Nukeproof Reactor Carbon 290 ST:</strong> £4,700 / $4,700 / AU$6,600</li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Transition Spur X01</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>5.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Transition’s Spur is its “all-country bike” that’s been designed from the ground up to “effortlessly explore, seek and pursue the mountain in ways you never imagined”.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<ul><li>Great geometry</li>\n<li>Smooth downhill, sprightly uphill</li>\n<li>£6,000 / $6,499 / AU$10,499 as tested</li>\n</ul><p>Unlike some downcountry bikes, the full-carbon frame Transition Spur is neither a beefed-up XC machine or paired back trail bike. Instead, Transition started from the ground up to build a bike that, it claims, will cover ground quickly and fly down descents.</p>\n<p>The Spur has 120mm of travel in both the front fork and the rear shock and when it comes to descending it really shines a light on how capable a bike like this can be, staying composed with an innate ability to smooth out the trail despite its modest travel.</p>\n<p>When it comes to climbing, the Spur is quick and efficient, surging forward as you step on the pedals, and staying firmly rooted on rough pitches.</p>\n<p>Overall, Transition has created a bike with superb geometry, well-considered kit and a ride that would put many longer travel bikes to shame.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/transition-spur-x01-review/\">Read the full Transition Spur X01 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Specialized Epic EVO Expert</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Specialized has equipped the Epic EVO with geometry that doesn’t look that far off what we’d expect to see on a trail bike.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<ul><li>Super-fast when you step on the pedals</li>\n<li>Short-travel but incredibly capable</li>\n<li>£6,750 / $6,300 / AU$10,100 / €6,699 as tested</li>\n</ul><p>The Specialized Epic EVO is a rocketship, reflective of its cross-country roots.</p>\n<p>On climbs, the bike is sprightly and energetic and gives the feeling that everything you put into the pedals is translated into forward momentum. Slow up a little bit and the bike sits in the middle of its travel and feels more supportive than others.</p>\n<p>When you point the Epic EVO downhill it is surprisingly stable delivering far beyond its 120mm of travel on rougher terrain, but getting the right line is important to really unlock the bike’s potential.</p>\n<p>For the price, one might expect a carbon bar rather than the alloy one Specialized has specced, and the brand’s in-house tyres could be switched out for some extra bite.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/specialized-epic-evo-expert-review/\">Read the full Specialized Epic EVO Expert review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>YT Izzo Pro Race</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<div>\n    <img /></div><div><figcaption><span><i></i> The YT Izzo Pro Race is said to be inspired by the beauty and sharpness of a Samurai sword.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<ul><li>Geometry encourages you to ride hard</li>\n<li>Good spec for the money</li>\n<li>£4,599 / $5,299 / AU$83,99 / €5,299 as tested</li>\n</ul><p>YT’s direct to consumer business model means there are few compromises on the Izzo Pro Race. The bike comes with a top Fox 34 fork, Float DPS shock and SRAM’s Eagle X01 drivetrain.</p>\n<p>Underneath the bike’s sharp lines is a spot-on geometry that delivers an aggressive ride that eggs you on.</p>\n<p>The anti-squat built into the suspension means the Izzo stays composed on climbs and gets up them with ease.</p>\n<p>With 130mm of travel in the front and back, the suspension ramps up nicely and gives you enough support for charging down pretty rough descents, helping create a bike that won’t hold you back.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/yt-izzo-pro-race-review/\">Read our full YT Izzo Pro Race review </a></li>\n<li>\n</li><li><a href=\"https://yt-industries.com/products/outlet/izzo/117/izzo-pro-race-29/preview\" target=\"_blank\">Buy the YT Izzo Pro Race direct</a></li>\n</ul><h2>Nukeproof Reactor Carbon 290 ST</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Nukeproof offers the Reactor in both alloy or carbon and with 29in or 650b wheels, the ST is only available with 29in wheels and in carbon.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<ul><li>Downhill demon</li>\n<li>Great spec for the price</li>\n<li>£4,700 / $4,700 / AU$6,600 as tested</li>\n</ul><p>The Nukeproof Reactor ST is a really capable bike that comes with progressive <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-bike-geometry-and-handling/\">geometry</a> and a good riding position.</p>\n<p>Considering the price point of the Reactor ST, the kit that is bolted to it is really impressive. There is a Fox Factory 34 fork, a Shimano XT 12-speed groupset, Maxxis rubber and carbon handlebar.</p>\n<p>On descents, the Fox 34 feels well-controlled and the 125mm of travel in the rear can take some pretty big hits, creating a ride that is seriously fun.</p>\n<p>The Reactor ST isn’t energetic on climbs and locking the shock is advised to get a bit more efficiency on long drags. This means the Reactor ST isn’t quite as rounded as other downcountry bikes, but when it comes to descending and value for money, it’s hard to beat.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/nukeproof-reactor-290-carbon-st-review/\">Read our full Nukeproof Reactor Carbon 290 ST review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n\n<hr /><h2>Also consider…</h2>\n<p>This downcountry mountain bike scored fewer than four out of five in testing, but is still worth considering.</p>\n<h3>Cannondale Scalpel SE LTD Lefty</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>3.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Scalpel SE shares the same full carbon frame as the cross-country focused Scalpel but gets a longer stroke shock to boost travel.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<ul><li>Incredibly comfortable</li>\n<li>Agile and fun</li>\n<li>£7,o00 / $8,300 / €8,399 as tested</li>\n</ul><p>The Scalpel SE LTD Lefty shares the same carbon frame as Cannondale’s XC Scalpel but has a longer stroke shock to increase the travel from 100mm to 120mm.</p>\n<p>This cross-country DNA is apparent in the handling, with the Scalpel eager to get moving and climb. The bike doesn’t feel quite as supportive or as bob-free as other downcountry bikes, but on long straight climbs, it can go along at a good pace.</p>\n<p>On meandering downhills, the Scalpel really shines and it slithers over roots and rocks with ease and is nimble on flowing trail park descents. But rougher terrain will reveal the limits of the Scalpel quicker than other similar bikes.</p>\n<p>Having said this, if you’re looking for a downcountry bike more at the XC end of the spectrum, the Scalpel is ready to eat up some big miles and comfortably cut through singletrack too.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<hr /><h2>First ride recommendations</h2>\n<p>These downcountry bikes have only been ridden by the BikeRadar testers a handful of times, so they haven’t yet been given a full, rated review, but they are worth considering.</p>\n<h3>Yeti SB115 T1</h3>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> To create the SB115, Yeti tweaked its cross-country SB100 to make it more suitable for fast trails and singletracks.</span></figcaption><span> <i>Max Wilman / Immediate Media</i></span></div>\n<ul><li>Supple and supportive suspension</li>\n<li>Super-solid chassis</li>\n<li>£6,499 / $6,300 / €7,490 as tested</li>\n</ul><p>Adapted from <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/yeti-sb100-first-ride-review/\">Yeti’s SB100 cross-country bike</a>, the SB115 T1 is a solid bike that feels very planted through the chunder but efficient on the climbs.</p>\n<p>The SB115 is graced with Fox Factory suspension that comes up trumps. High anti-squat figures keep the bike feeling stable on climbs.</p>\n<p>On descents, it is soft enough to keep the rear wheel stuck to the ground and with enough mid-stroke support for some good pop. It also ramps up nicely for bigger hits, even though there is just 115mm of travel in the rear.</p>\n<p>The geometry of the Yeti is fairly similar to the SB100, which helps give it its speed, but the reach is short and it could do with a bit more length to remain stable and less skittish on loose rocks and steep chutes.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/yeti-sb115-t1-review/\">Read the Yeti SB115 T1 first ride review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<hr /><h2>Buyer’s guide to downcountry mountain bikes</h2>\n<p>Mountain biking often feels like a broad umbrella for many different disciplines; from trail to high-flying downhill there are myriad riding styles and, of course, the bikes to match.</p>\n<p>Downcountry bikes are one of the latest mountain biking phenomena, sitting at the intersection of cross-country, trail and all-mountain bikes.</p>\n<p>Having existed in one form or another for a number of years, downcountry bikes have recently hit the mainstream and as demand for this type of bike began to balloon, the bike industry responded, and downcountry is now a burgeoning category.</p>\n<p>Different brands approach downcountry bikes in slightly different ways, but this buyer’s guide will take you through everything you need to know.</p>\n<h3>What is a downcountry mountain bike?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Want to cover ground extremely fast but still have enough stability and travel to tackle descents?</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<p>In short, downcountry bikes are lightweight XC style frames with added travel, trail-friendly geometry and wider, nobbly tyres.</p>\n<p>The result? Bikes that will cover ground extremely fast but still let you charge down descents.</p>\n<p>The term “downcountry” was coined by Mike Levy at PinkBike three years ago, and is a mash-up of “downhill”  and “cross country”. So, a pretty neat encapsulation of what the bikes are for, and consequently one that has stuck around.</p>\n<p>The origin of downcountry bikes is a bit hazy. Some say it extends back to cross-country racing, where gnarlier courses demanded more technical, gravity-capable machines. Others say that it comes from engineers making small tweaks to thoroughbred XC race bikes to make them more fun to ride.</p>\n<p>Arguably, they could stem from manufacturers doing their market research and seeing consumers riding more extreme terrain on their cross-country bikes and making corresponding upgrades to existing bikes.</p>\n<p>But, however they came to be, now some of the biggest bikes brands offer off-the-shelf downcountry bikes that deliver a refined balance of short travel, minimal mass and progressive geometry.</p>\n<h3>What to look for in a downcountry mountain bike</h3>\n<p>Alongside trail-friendly geometry, wide nobbly tyres and extended travel, downcountry bikes have a few other features that help them balance their fast and agile ride with their downhill performance and more relaxed feel.</p>\n<p>Much of what makes a downcountry bike is what it is specced with, and here we run through the key things to look out for.</p>\n<h4>A lightweight frame with a relaxed geometry</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> Long, low and lean, downcountry geometry is tailored to strike the balance between efficient climbing and fast descending.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<p>Go back ten years and tell a cross-country rider they’d one day be riding a bike with a 66-degree head tube angle and they’d probably look at you like you’d had one too many caffeine gels. But in 2021, this is exactly what is happening with downcountry bikes.</p>\n<p>This angle is slacker than traditional <a href=\"https://www.bikeradar.com/advice/buyers-guides/top-5-2021-cross-country-bikes/\">cross-country bikes</a> and helps give downcountry bikes their gravity riding potential. This is because a slacker angle means the front fork sticks our further, creating a more stable ride at high speeds.</p>\n<p>Reach figures have also increased as head angles have decreased. A longer reach number makes the bike feel more stable when you’re stood on the pedals descending.</p>\n<p>Descending stability was going to be an inevitable outcome when combining the slack head angle, long reach and the consequential longer wheelbases created by those two figures.</p>\n<p>Even though downcountry bikes have more gravity-friendly geometry, they remain relatively light so riders aren’t pushing too much mass, helping the bikes stay fast.</p>\n<h4>Short-travel</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> 120mm of travel is pretty standard for a downcountry rear shock.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>Although downcountry bikes have a short-travel design, they still offer a bit more travel than cross-country race machines to help them on more technical downhill sections.</p>\n<p>As a general rule, downcountry bikes have between 120mm and 130mm travel in the forks and a variation of between 110mm and 125mm at the back, depending on brand and model.</p>\n<p>Some downcountry bikes do offer more travel, but this is testament to how downcountry is a rather woolly category that is more about different factors coming together than travel defining what the bike is.</p>\n<h4>Large wheels and burly tyres</h4>\n<p>29in wheels are standard on downcountry bikes. Compared to 27.5in wheels, they require less effort to keep their momentum and are consequently more efficient, making them the right choice for the sorts of longer, more pedalling intensive rides you’ll be doing on these bikes.</p>\n<p>Downcountry bikes pair 29in wheels with wider and burlier tyres than you would expect to find on 29er cross-country bikes.</p>\n<p>These <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-tyres/\">mountain bike tyres</a> sit between fast-rolling, lightweight XC tyres and chunkier downhill treads, making them fast and less of a drag when climbing, yet more durable and capable on the rough stuff.</p>\n<h4>Wide bars and short stems</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> Downcountry bikes tend to have wider bars and shorter stems than XC bikes.</span></figcaption><span> <i>Max Wilman / Immediate Media</i></span></div>\n<p>Wide bars and short stems are the go-to for downcountry bikes.</p>\n<p>The wide bars give you more leverage and help make downcountry bikes super-stable, agile and less skittish than bikes with more XC-focused components.</p>\n<p>A shorter stem also improves handling. It gives the bike quicker handling characteristics by making steering more direct and makes the bike feel more responsive.</p>\n<h4>Dropper seatposts</h4>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">Dropper posts</a> are a common feature on downcountry bikes because they give riders a bit more space for moving around and shifting weight on technical descents.</p>\n<p>It’s possible to raise the saddle for efficient pedalling and to make the most of downcountry bikes’ cross-country-style speed, combining the best of both worlds</p>\n<p>It might not be a surprise that downcountry bikes come with dropper posts considering their versatility, and dropper posts are even making their way onto <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bikes</a>.</p>\n<h4>Gearing</h4>\n<p>Gearing on downcountry bikes is slanted towards the cross-country end of the spectrum. Front rings tend to have between 32 and 38 teeth compared to the 30- to 34-tooth rings on trail bikes.</p>\n<p>This allows for more speed, which is always appreciated on the smoother trails and fire roads that a downcountry bike is at home bombing along, and for long days in the saddle.</p>\n<h4>Brakes</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> A mix of rotor sizes and two-pot brakes help fulfil downcountry bikes’ “only what is needed” mantra.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>When it comes to brakes on downcountry bikes there is a mix, but they tend to use two-pot rather than four-pot <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-disc-brakes/\">mountain bike disc brakes</a> where there are only two pistons rather than four.</p>\n<p>This is because downcountry bikes don’t need the braking power of four pistons because they aren’t descending at the fast, white-knuckle speeds of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-downhill-mountain-bikes/\">downhill mountain bikes</a>.</p>\n<p>Two pistons rather than four also saves weight, helping downcountry bikes achieve their svelte builds.</p>\n<p>In keeping with this, downcountry bikes also tend to have a mix of rotor sizes; 180mm on the front for better braking and heat dispersion and 160mm on the rear where braking isn’t so strenuous on the disc and a few grams can be saved.</p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"54be1a6c88eccf826a12e83361ac9ed6291b03f32720dfd61be09fab8c34da78","category":"Cycling"}