{"title":"Virtual reconstruction of stone tool refittings by using 3D modelling and the Blender Engine: The application of the “ReViBE” protocol to the archaeological record","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309611","date":1724940000000,"content":"<p>by Javier Sánchez-Martínez, Katia Calmet, Jorge Martínez Moreno, Xavier Roda Gilabert</p>\r\n\r\nVisual representation of material culture plays a crucial role in prehistoric archaeology, from academic research to public outreach and communication. Scientific illustration is a valuable tool for visualising lithic artefacts and refittings, where technical attributes must be drawn to enhance our understanding of their significance. However, the representation of lithic refittings, which involve dynamic and sequential transformations of a volume, requires an alternative approach to traditional two-dimensional models such as photography or illustration. Advances in imaging technologies have improved our ability to capture and communicate the multifaceted nature of archaeological artefacts. In this context, we present the ReViBE protocol (Refitting Visualisation using Blender Engine), which integrates photogrammetry, 3D modelling and the animation software Blender© for the virtual representation of lithic refittings. This protocol allows the sequential study of core reduction phases and their associated flakes, as well as other aspects related to knapping decision making (core rotations, surface modifications, and direction and position of impact points). Thus, this method allows the visualisation of techno-cognitive aspects involved in core reduction through a step-by-step animation process. In addition, the 3D models and virtual reconstructions generated by ReViBE can be accessed through open repositories, in line with the principles of open science and FAIR (Findable, Accessible, Interoperable, and Reusable) data. This accessibility ensures that data on lithic technology and human behaviour are widely available, promoting transparency and knowledge sharing, and enabling remote lithic analysis. This in turn breaks down geographical barriers and encourages scientific collaboration.","author":"Javier Sánchez-Martínez","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"54c0118fd0aa72edcac5c42fe1ebe902ffffc5356c5aa750b6a5943ed3f9183f","category":"Interdisciplinary"}