{"title":"Simple method for removal of pollutants from water by freezing a portion of aquatic solution using a PET bottle, shredder scrap, and household freezer","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11101?af=R","date":1723198123000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1723f534-d8fb-4db4-87b1-2acf468a57f5/wer11101-toc-0001-m.png\" alt=\"Simple method for removal of pollutants from water by freezing a portion of aquatic solution using a PET bottle, shredder scrap, and household freezer\" />\n<p>A pollutant in a water sample can be removed over 90% by freezing a portion of the solution using a PET bottle, shredder scrap, and household freezer.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>A simple method for purifying water using household items has been developed. The solution containing an environmental pollutant was added to the PET bottle. The lid of the PET bottle was closed, and the bottle was then placed with the lid down in a freezer for 9 h. The pourer of the PET bottle was surrounded by shredded paper scraps as a lagging material. Before the solution was completely frozen, the sample was removed from the freezer. The unfrozen portion (liquid) was sampled. The pollutant was concentrated in the liquid. The remaining frozen portion was completely thawed. As results, the concentration of the pollutant (Congo Red, Cr (VI), Pb (II), pentachlorophenol, fluoride, nitrate, or phosphate) in the thawed liquid was decreased by more than 90% compared with the initial concentration (0.10 mM).</p>\n<h2>Practitioner Points</h2>\n<p>\nA pollutant in a water sample can be removed by freezing a portion of the solution using a PET bottle, shredder scrap, and household freezer.\nFluorine and hexavalent chromium can be removed from water to levels that meet water quality standards.\nThe present method can efficiently remove a wide range of contaminants from water, including azo dyes, heavy metals, and pentachlorophenol.\n</p>","author":"Hiroshi Moriwaki, \nNatsu Nishimura, \nMahiro Oshima","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"54c906ed62106d91d3280b775dcfdbb68a78f3ce21a5fcc799e99baf193da965","category":"Environment"}