{"title":"Metagenomics Insight of Veterinary and Zoonotic Pathogens Identified On Urban Wetlands of Los Lagos, Chile","link":"https://www.preprints.org/manuscript/202407.1746/v1","date":1721650828000,"content":"Wetlands are ecosystems that are essential to ecological balance and biodiversity, never-theless human activity is a constant threat to them. Excess nutrients are caused by inten-sive livestock and agricultural operations, pollution, and population growth, which in turn leads to uncontrolled microbiological development. This impairment in water quality can constitute a risk to animal, human, and environmental health. To thoroughly charac-terize the microbial communities, shotgun metagenomics was used to characterize the taxonomic and functional pattern of microorganisms that inhabit urban wetlands in the Los Lagos Region of Chile. The main objective was to identify microorganisms of veteri-nary relevance, assess their potential antibiotic resistance, and characterize the main vir-ulence mechanism. As expected, a high diversity of microorganisms was identified, in-cluding bacteria described as animal or human pathogens. Also, a diverse repertory of an-timicrobial-resistant genes (ARGs) was detected, which confers mainly resistance to be-ta-lactams, consistent with the families of antibiotics most used in Chile. Besides, a di-verse collection of virulence mechanisms was also identified. Given the significance of the relationship between environmental, animal, and human health—a concept known as One Health—there is a need to establish molecular surveillance programs. This work is the first report of the presence of these harmful biological elements in urban wetlands subjected to anthropogenic pressure, located in the south of Chile.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"54cc427dac816e14e17bd8b6e9a8cc8272048da8c2275b4946dd347c292834e0","category":"Interdisciplinary"}