{"title":"What to wear mountain biking: everything you need to know","link":"https://www.bikeradar.com/advice/buyers-guides/what-to-wear-mountain-biking/","date":1678611600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/10/Fox-DHX-Factory-rear-mountain-bike-shock-2-3e0ee7f.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/10/Fox-DHX-Factory-rear-mountain-bike-shock-2-3e0ee7f.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2022/10/Fox-DHX-Factory-rear-mountain-bike-shock-2-3e0ee7f.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2022/10/Fox-DHX-Factory-rear-mountain-bike-shock-2-3e0ee7f.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/10/Fox-DHX-Factory-rear-mountain-bike-shock-2-3e0ee7f.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/10/Fox-DHX-Factory-rear-mountain-bike-shock-2-3e0ee7f.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/10/Fox-DHX-Factory-rear-mountain-bike-shock-2-3e0ee7f.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/10/Fox-DHX-Factory-rear-mountain-bike-shock-2-3e0ee7f.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/10/Fox-DHX-Factory-rear-mountain-bike-shock-2-3e0ee7f.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/10/Fox-DHX-Factory-rear-mountain-bike-shock-2-3e0ee7f.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Fox DHX Factory rear mountain bike shock fitted to a Marin Alpine Trail XR ridden by Alex Evans\" title=\"Fox DHX Factory rear mountain bike shock-2\" />                                            <p>Comfort, weather conditions, protection and to some extent personal style determine what to wear for mountain biking.</p>\n<p>In general, trail riders and downhill riders tend to opt for baggy kit consisting of loose-fitting shorts with a pair of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-shorts/\">padded Lycra shorts</a> underneath and a similarly loose jersey, whereas more race-focused cross-country riders will often go full Lycra.</p>\n<p>If you’re just starting out, the best kit is the kit you already have, but as you progress the chances are you’ll want clothing designed for the specific demands of mountain biking.</p>\n<p>Ultimately, the choice is totally up to you, and you should wear whatever you feel comfortable in.</p>\n<p>Where you ride and the time of year or season will have a significant impact on what you decide to wear. When the weather is warm and the trails (mostly) dry in the middle of summer, you’ll require less protection from the elements than in <a href=\"https://www.bikeradar.com/features/winter-mountain-biking-what-to-wear-where-to-ride-and-how-to-set-up-your-bike/\">the depths of winter</a>.</p>\n<p>You also need to factor in the demands of your ride. If you’re heading off for an all-mountain adventure in the Alps or Rockies, for example, you’ll need to bring more serious kit because you’ll need to make sure you’re prepared for <a href=\"https://www.bikeradar.com/features/20-essentials-for-epic-mountain-bike-rides/\">backcountry epics</a>.</p>\n<p>However, whenever and wherever you’re riding, there are a number of essentials you’re likely to need.</p>\n<p>If you’re wondering what the essentials are for the road, check our explainer on <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-to-wear-on-a-bike-ride/\">what to wear on a road ride</a>.</p>\n<h2>Helmet</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A helmet really is essential for mountain biking.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>A helmet is an essential piece of kit for mountain bikers. The chances of slipping, crashing or bumping into a tree or rock are much higher than for <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-to-work-guide/\">commuters</a> or most road cyclists, so head protection is crucial.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-helmets-for-trail-riding/\">best mountain bike helmets</a> generally have an integrated peak, which helps keep sun and rain out of your eyes and deflect low-hanging branches.</p>\n<p>A mountain <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/how-to-wear-bike-helmet/\">bike helmet</a> also sits lower around the back and sides of your head to provide <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/bike-helmet-sizes/\">better coverage</a>.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Full-face helmets help you save face when you run out of luck.</span></figcaption><span> <i>Andy Lloyd / Our Media</i></span></div>\n<p>For bike parks, downhill riding, and downhill and <a href=\"https://www.bikeradar.com/features/beginners-guide-to-enduro-racing/\">enduro racing</a>, mountain bikers usually wear a full-face helmet, which offers all-round protection.</p>\n<p>Occasionally, full-face helmets are paired with a neck brace, which prevents the head being dangerously thrown back in the event of a big crash – more of an issue for riders doing big jumps and drops.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-mips/\">MIPS</a> technology is increasingly common in mountain bike helmets. MIPS is an additional layer, or slip-plane, inside the helmet designed to reduce the rotational forces on the brain, which can be experienced in certain impacts.</p>\n<h2>Glasses or goggles</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Glasses or goggles help protect your eyes from the sun and dirt kicked up by your front wheel.</span></figcaption><span> <i>Ian Linton / Immediate Media</i></span></div>\n<p>Glasses or goggles are essential for protecting your eyes from sun glare and debris thrown up by your front wheel.</p>\n<p>Look for <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-sunglasses/\">mountain bike sunglasses</a> with an interchangeable lens and multiple lens options. This enables you to swap the lens out according to the conditions.</p>\n<p>A clear lens, for example, is good for riding in dull or dark conditions, while tinted lenses are better for reducing glare or increasing contrast.</p>\n<p>Trail riders wear glasses most of the time, but if the weather is particularly grim and muddy, goggles are an alternative option because they provide sealed weather protection with a wide range of vision.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-goggles/\">Goggles</a> are usually paired with full-face helmets, though many will fit with regular helmets – known colloquially as going ‘full enduro’.</p>\n<p>Most downhillers will wear goggles rather than glasses because they are more secure and offer more protection on long, technical descents.</p>\n<h2>Jersey</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Mountain bike jerseys tend to have a looser cut than a road jersey.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>Most <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-jerseys/\">mountain bike jerseys</a> will have a loose cut and will come in short-sleeve, three-quarter or long-sleeve options.</p>\n<p>A short-sleeve jersey will keep you cooler in the heat of summer, but a long-sleeve jersey will offer a little more protection for your arms – both from the sun and nettles, thorns and branches. Some long-sleeve jerseys will have mesh panels to improve breathability.</p>\n<p>Prices are generally lower than the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-jerseys/\">best cycling jerseys</a> for road cycling, and there’s a huge range of colours and designs out there.</p>\n<p>Cross-country mountain bikers tend to wear a Lycra jersey, along the lines of a road cycling jersey, with rear pockets ideal for stowing spare tubes, tools and snacks.</p>\n<h2>Shorts, liner shorts and baggy shorts</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Cross-country riders may wear Lycra shorts, but most mountain bikers prefer baggies.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>Padded shorts are a good idea because mountain biking by its very nature takes place on rough terrain, and riders spend time repeatedly getting in and out of the saddle.</p>\n<p>Road-cycling style bib shorts with a chamois pad are ideal either on their own or, more common for trail riding, as an under layer with a pair of baggy mountain bike shorts over the top.</p>\n<p>You can also find padded shorts made of lightweight material or mesh, which are designed to be used just as liners under baggy shorts.</p>\n<p>Baggy mountain bike shorts will usually be knee-length and constructed from either a stretchy material or a robust, tear-resistant fabric with stretch panels around the back to allow the shorts to move with the rider. They should also have room for knee pads to fit underneath.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-mtb-shorts/\">Waterproof shorts</a> protect your bottom and pad from the spray of your rear wheel, allowing you to ride in the rain without the discomfort of sitting on a soiled nappy.</p>\n<h2>Waterproof trousers</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Riding trousers will help keep you warm, dry and clean in mucky conditions.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>If you ride year-round and live somewhere with an inclement climate (like us here in the UK) then riding trousers will make a big difference in mucky conditions.</p>\n<p>Riding trousers will not only help keep you dry, they’ll provide warmth when the temperature drops and stop you getting caked in mud (even if your kit still takes the brunt of it).</p>\n<p>Like jackets, riding trousers are normally available in waterproof and water-resistant variants.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-mtb-trousers/\">Waterproof cycling trousers</a> are likely to be made from a hardshell fabric – the kind of waterproof trousers you might expect to use for hiking – and offer plenty of protection from the rain, but at the cost of breathability.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Waterproof trousers can be difficult to size so it’s recommended to try before you buy.</span></figcaption><span> <i>Ian Linton / Immediate Media</i></span></div>\n<p>Water-resistant trousers are more likely to be made from a softshell fabric, offering improved fit and durability as a result, and with a Durable Water Repellent (DWR) treatment to shed rain.</p>\n<p>Fit is key when it comes to riding trousers. You want something close enough to avoid the material flapping or getting in the way, but with enough room to not restrict pedalling. An articulated cut will help in that respect, too.</p>\n<p>Added extras such as Velcro tabs on the ankles, for a close fit, and abrasion-resistant materials are also useful.</p>\n<h2>Knee pads and other protection</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Keep your knees in good nick with some impact protection.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>Most riders wear <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mtb-knee-pads/\">knee pads</a> at a minimum if they’re riding any trail where there’s an above-average chance of taking a spill. Or just for peace of mind.</p>\n<p>There are more lightweight options than ever before that offer protection while still enabling you to pedal comfortably. For more technical riding, there are chunkier pads available.</p>\n<p>For racing and technical riding, some mountain bikers will also use other body armour, such as elbow pads and back protectors.</p>\n<h2>Gloves</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Mountain bikers wear full-finger gloves rather than fingerless gloves or mitts. Look for gloves with carefully placed grippers.</span></figcaption><span> <i>Sarah Bedford / Our Media</i></span></div>\n<p>Full-finger gloves are favoured by the vast majority of mountain bikers and provide more comprehensive protection than mitts.</p>\n<p>The coverage provided by full-finger <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-gloves/\">mountain bike gloves</a> helps protect the hands from crashes and undergrowth, and some gloves will come with padding on the palms to provide additional cushioning.</p>\n<p>Gloves aimed at downhill or enduro riders often have more protection on the back of the hands because the likelihood of crashing is much higher for this type of riding.</p>\n<p>Gloves can also help with grip because the palm will be designed to provide extra traction on the handlebars</p>\n<p>Look for gloves that have carefully placed grippers, so you’ve got full control over the brakes and shifters.</p>\n<p>Full-finger gloves also provide welcome insulation and windproofing in the autumn, winter and spring when riding in cool or wet conditions.</p>\n<p>That said, you’ll find a wide range of gloves out there, with lighter options for summer riding and more heavily insulated options for cold conditions.</p>\n<p>Investing in a couple of sets of gloves will stand you in good stead and avoid sweaty hands when it’s warm, and freezing hands when it’s chilly.</p>\n<h2>Socks</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Long socks give some protection from thorns and trail debris.</span></figcaption><span></span></div>\n<p>As well as being a way of expressing your style, long <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-socks/\">cycling socks</a> can help protect the shins and calves from scratches and cuts from undergrowth, or from the pedals themselves.</p>\n<p>Waterproof socks are popular with mountain bikers who ride in wet conditions because they help keep feet warm and relatively dry when shoes get wet. On the other hand, lightweight, breathable socks will help keep your feet cool in summer.</p>\n<p>There’s also the option of putting <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-overshoes/\">waterproof shoe covers</a> over the top of riding shoes (most likely if you’re using slim-line shoes for clipless pedals), which adds even more wet weather protection.</p>\n<h2>Shoes</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Mountain bike shoes are usually available in clipless and flat varieties.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p>When it comes to contact points – where the rider makes contact with the bike – the shoe/pedal interface is one of the most important.</p>\n<p>Riders need to feel secure when riding over rough ground and also be able to pedal efficiently up tough, technical climbs.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Recessed cleats mean you can still walk comfortably in clipless shoes.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>There are two choices on offer: <a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\">flat pedals and clipless pedals</a>.</p>\n<p>Lots of trail and cross-country riders will choose to ride clipped in, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-pedals/\">like road cyclists</a>, with a mechanism that connects a cleat on the sole of the shoe to the pedal.</p>\n<p>Clipless shoes look like <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-cycling-shoes/\">road cycling shoes</a> but will have a recessed cleat and a chunky tread to allow the rider to walk a little more normally.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Mountain bikers have two pedal choices: flat and clipless.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p>Other riders opt to ride with ‘flat’ shoes and pedals, where the pedals have a rough-textured surface and ‘pins’ that project outward to grip the shoes.</p>\n<p>Flat pedal <a href=\"https://www.bikeradar.com/features/best-shoes-for-mountain-bikers/\">mountain bike shoes</a> tend to look more like skate shoes or trainers, and will usually have a lace-up fastening, normally with an elasticated band to tuck the laces in to.</p>\n<p>They also have a sole with a tread pattern that works with the pedal pins and is made from extra-grippy rubber for the same reason.</p>\n<p>If you’re riding through the cold, dark months, it’s worth looking at <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-cycling-shoes/\">winter mountain bike shoes</a>, made from warm, weatherproof materials.</p>\n<h2>Jacket</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A lightweight jacket will fend off the wind and showers.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>As with every other type of cycling, mountain biking can be a year-round activity if you have the right kit.</p>\n<p>If the weather starts to look inclement, a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-mountain-biking/\">mountain biking jacket</a> will help keep the elements at bay. Still, there’s a wide range of conditions you may encounter so there’s a wide range of mountain bike jackets to choose from.</p>\n<p>We’re going to run through three of the main options: a lightweight shell, a hybrid jacket and a fully waterproof jacket.</p>\n<p>A lightweight jacket will normally be made of a water-resistant material designed to offer some wind and rain protection, while still retaining breathability, often through mesh panels or perforations in the fabric.</p>\n<p>A jacket like this should also be packable, meaning you can take it off if conditions improve and stow it in a backpack. Or you might keep it in your pack just in case the conditions change mid-ride and you need an extra layer.</p>\n<p>A hybrid jacket is designed to offer the best of all worlds, combining water repellency, warmth and breathability. A good hybrid jacket is likely to be made from a softshell or padded fabric for additional warmth and stretch.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Good waterproof jackets will feature a hood large enough to fit over your helmet.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>While a hybrid jacket will be less packable than a lightweight shell, it should still stuff into a riding pack. Look for a jacket with vents because, even with a breathable fabric, there’s only so much heat build-up a jacket such as this can handle. It’s unlikely to be fully waterproof either.</p>\n<p>A waterproof jacket does what it says on the tin. We’re talking proper hardshell waterproof jackets here, designed to keep the rain out for hours on end.</p>\n<p>A waterproof jacket designed for mountain biking will tend to have a looser fit than a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-cyclists/\">waterproof road cycling jacket</a>, to accommodate layers and potentially body armour underneath, and to allow greater freedom of movement.</p>\n<p>There will usually be a couple of pockets too for stowing essentials and snacks, as well as vents for keeping your internal temperature down when working hard on climbs.</p>\n<p>A good waterproof jacket won’t come cheap but, if you’re committed to riding year-round, it will be one of the best investments you make.</p>\n<h2>Waterproof Onesies</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Waterproof suits promise a silver bullet solution for riding in the worst weather.</span></figcaption><span> <i>Andy Lloyd / Our Media</i></span></div>\n<p>The mountain bike suit combines a waterproof jacket to waterproof pants, giving riders ultimate protection in wet conditions.</p>\n<p>While adoption of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-suits/\">mountain bike onesie</a> has yet to go mainstream, riders heading out into the depths of winter will benefit from the one-piece design.</p>\n<p>Mountain bike suits remove the gap between jacket and pant where spray can penetrate leading to a soggy back.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Waterproof zips mean that once closed the suit retains its weatherproofing.</span></figcaption><span> <i>Andy Lloyd / OurMedia</i></span></div>\n<p>Waterproof fabrics with generous vents are used in the construction of waterproof suits to balance breathability with water resistance.</p>\n<p>Mountain bike onesies are not cheap, but help you out of the door on those days when the couch calls.</p>","author":"George Scott","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"54e99bb7befe5b51373ac145963aed2d7b2cc8aeb00eacf6343bf7ee9f50b37f","category":"Cycling"}