{"title":"Over 150 3D Movies and Spatial Games Coming to Apple Vision Pro","link":"https://www.macrumors.com/2024/01/08/vision-pro-movies-games/","date":1704759437000,"content":"At launch, the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> app will have more than 150 3D movie and TV show options for <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> users to watch, Apple said today when it announced <a href=\"https://www.macrumors.com/2024/01/08/apple-announces-february-2-vision-pro-launch/\">the Vision Pro launch date</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/apple-vision-pro-movie-experience.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nWhile the Vision Pro will work with any TV show or movie available through the ‌Apple TV‌ app on the device, specific titles have been updated with 3D that will make for an even more immersive experience. TV shows and movies that are not 3D will appear on a screen that \"feels 100 feet wide,\" with the Vision Pro offering the resolution of a 4K TV for each eye, along with HDR support.\r<br />\n\r<br />\nApple has created Apple Immersive Video, a \"new entertainment format\" that is designed to put users inside action with 180-degree 3D 8K video recordings that have been captured with Spatial Audio, plus there will be interactive experiences like \"Encounter Dinosaurs.\"\r<br />\n\r<br />\nAs for gaming, the Vision Pro will support more than 250 titles on <a href=\"https://www.macrumors.com/guide/apple-arcade/\">Apple Arcade</a>, with the content able to be played in 2D using a game controller. There are also select \"spatial games\" that have been created for the device, including Game Room, What the Golf?, and Super Fruit Ninja. Apple says that these games take advantage of the Vision Pro's capabilities to transform the space around players, providing \"unique and engaging gameplay experiences.\"\r<br />\n\r<br />\nThe Vision Pro is set to launch on Friday, February 2, with Apple to begin accepting pre-orders on Friday, January 19. At launch, the Vision Pro will only be available in the United States.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a>, <a href=\"https://www.macrumors.com/roundup/visionos/\">visionOS</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/08/vision-pro-movies-games/\">Over 150 3D Movies and Spatial Games Coming to Apple Vision Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/over-150-3d-movies-and-spatial-games-coming-to-apple-vision-pro.2415811/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"54ee952fe8a402478c446d6a63447b65033f55e3ec0de9b73eb20a68ea563477","category":"Apple"}