{"title":"PSII-14 Climate and conception: Investigating the resilience of equine embryo survival to ambient temperatures in southeast Texas","link":"https://academic.oup.com/jas/article/102/Supplement_3/624/7757831?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Amidst the unique challenges posed by the humid and hot climate of southeast Texas, this study aimed to assess the establishment of pregnancy from transferred equine embryos, hypothesizing that an increase in ambient temperature would lead to a decrease in pregnancy establishment. To achieve this, we utilized 17 embryo donors and 46 recipient mares (3 to 9 yr of age), all anatomically and clinically normal with no history of reproductive problems. Breeding records for 49 transferred d 8, grade-1 embryos from a single private horse farm in southeast Texas, along with the reported high and low ambient temperatures on the day of transfer, were analyzed using logistic regression via PROC GLIMMIX in SAS v9.4 with fixed effects for the reported high and low ambient temperatures on the day of transfer, with a random statement for donor and sire. The pregnancy rate for all embryo transfers was 79%. Surprisingly, our results revealed that neither the reported high ambient temperatures (<span>P</span> = 0.16) nor reported low ambient temperatures (<span>P</span> = 0.19) significantly influenced the likelihood of pregnancy establishment observed at d 14 post-ovulation of transferred equine embryos. Furthermore, no statistically significant influence (<span>P</span> &gt; 0.05) on pregnancy establishment was observed when embryo transfers were conducted outside of the thermal neutral zone (5°C to 20°C). Within the context of our study, these results suggest that environmental temperatures in southeast Texas do not significantly impact equine pregnancy outcomes.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"54f086cd7090f562b357c607674821e9e82612ce63f34aca2e4c60b1bf08057b","category":"Environment"}