{"title":"The Prevalence of Gestational Diabetes Mellitus in Polycystic Ovary Disease&mdash;A Systematic Review, Meta-Analysis, and Exploration of Associated Risk Factors","link":"https://www.preprints.org/manuscript/202407.1146/v1","date":1721032865000,"content":"Polycystic ovary syndrome (PCOS) is a common condition in reproductive-age women. Women with PCOS are at higher risk of pregnancy complications including gestational diabetes (GDM). The prevalence of PCOS and GDM varies according to the diagnostic criteria used. The mechanism for the occurrence of GDM in women with PCOS is still unclear. Materials &amp;amp; Methods- A systematic search of the electronic database was done using keywords like PCOS, and GDM to include studies between April 2008 and March 2023 where uniform diagnostic criteria were used. Studies were excluded with high-risk of bias after the assessment of bias, and meta-analysis was done with relative risks and confidence intervals. Results &amp;amp; Discussion-Out of 1896 search results, 95 were selected for full-text. The quality of the studies was scrutinized and a total of 28 studies were included as they fulfilled the inclusion criteria. The incidence of GDM in women with PCOS was found to be 10.55 % (2.9- 54.9%) from pooled data involving 1,280,245. The prevalence of PCOS in women diagnosed with GDM was found from pooled data of 36,351 women in retrospective studies to be 2.47% (1.5- 50.1%). Selection predominantly included cohort studies, most commonly from China. The meta-analysis reported the risk of GDM is higher in women with PCOS than in those without PCOS (HR: 1.59, 95% CI: 1.27–1.91, p &amp;lt; 0.001). Family history of diabetes, ethnicity, pre-pregnancy BMI, insulin resistance, gestational weight gain, use of assisted reproductive techniques, and multifetal gestation were the risk factors for GDM in women with PCOS. Conclusion- The prevalence of GDM in patients with PCOS is high, but the causality is complex. The newer predictive models are promising in clarifying the causative relationships, yet use various parameters at different cut-offs. There is a need for the development of universally acceptable parameters for the early prediction of GDM in women with PCOS.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"54f301b95947cc43d537e7093bb96e31ffbb0719ec50436dc67e28e9f4872605","category":"Interdisciplinary"}