{"title":"KBTG ร่วมกับมหาวิทยาลัย 7 แห่ง พัฒนาหลักสูตร Data Science, AI รับนักศึกษาเข้ามาฝึกงานด้วย","link":"https://www.blognone.com/node/121976","date":1617189730000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>KBTG บริษัทเทคโนโลยีในเครือธนาคารกสิกรไทย เปิดตัวโครงการ Tech Campus ร่วมกับมหาวิทยาลัยช่วยพัฒนาหลักสูตรเกี่ยวกับ Data Science, AI ผลิตบุคลากรให้ตอบโจทย์เชิงธุรกิจด้านเทคโนโลยี พร้อมทั้งส่งนิสิตนักศึกษาเข้าฝึกงานจริงใน KBTG</p>\n<p>โดยมีมหาวิทยาลัย 7 แห่งที่เข้าร่วมโครงการคือ สถาบันเทคโนโลยีแห่งเอเชีย คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย คณะเทคโนโลยีสารสนเทศ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง มหาวิทยาลัยเกษตรศาสตร์ วิทยาลัยนวัตกรรม มหาวิทยาลัยธรรมศาสตร์ มหาวิทยาลัยซีเอ็มเคแอล และวิทยาลัยนานาชาติ มหาวิทยาลัยมหิดล</p>\n<p>ในโครงการนี้ได้ร่วมมือกับองค์กรรัฐ 2 แห่งด้วยคือศูนย์เทคโนโลยีอิเล็กทรอนิกส์และคอมพิวเตอร์แห่งชาติ และสมาคมปัญญาประดิษฐ์ ในโครงการ Tech Campus นอกจากร่วมพัฒนหลักสูตรแล้ว ยังเป็นความร่วมมือทางการวิจัยทางด้านเทคโนโลยีใหม่ๆ นำไปต่อยอดให้วงการธุรกิจไทย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e51088ba322979438eecea1f23a9dc70.jpg\" ></p>\n<p>เรืองโรจน์ พูนผล ประธาน KBTG ระบุว่า เป้าหมายระยะยาวของธนาคารกสิกรไทยคือ One of the World Digital Bank และยังมีธนาคารเปิดใหม่ในต่างประเทศทั้งจีนและเวียดนาม ซึ่งทางธนาคารไม่สามารถไปได้ด้วยตัวคนเดียวได้ เรายังต้องการคนอีกเยอะ จึงจำเป็นต้องร่วมกับหน่วยงานอื่น โดยเฉพาะสถาบันการศึกษา เพื่อขอแรงมาช่วยให้บริษัทขับเคลทื่อนต่อไปได้ และทางบริษัทก็สามารถช่วยมหาวิทยาลัยใสการพัฒนาหลักสูตรและงานวิจัย</p>\n<p>เรืองโรจน์ กล่าวต่อว่า ปัจจุบันประเทศไทยมีการลงทุนงานวิจัย R&amp;D เพียง 0.34% ของ GDP ไทย ซึ่งน้อยเมื่อเทียบกับนานาประเทศ กุญแจสำคัญที่จะทำให้เกิดความก้าวหน้าเชิงเทคโนโลยีด้วยต้องใช้ยุทธศาสตร์ Deep Collaboration ร่วมกับหลายถาคส่วนเพื่อพัฒนาบุคลากรและการวิจัย นอกจากนี้ยังต้องใช้ยุทธศาสตร์ Deep Focus เพื่อให้การวิจัยชัดเจน ไม่สะเปะสะปะ</p>\n<p>ที่ผ่านมา KBTG ร่วมพัฒนาเทคโนโลยีให้กับองค์กรภาครัฐ เช่น โครงการ Thai NLP (Thai Natural Language Processing) ร่วมกับศูนย์เทคโนโลยีอิเล็กทรอนิกส์และคอมพิวเตอร์แห่งชาติ (NECTEC) ลดช่องว่างในการสื่อสารภาษาธรรมชาติระหว่างมนุษย์กับคอมพิวเตอร์, วิจัย Facial Recognition กับสถาบันเทคโนโลยีแห่งเอเชีย (AIT) พัฒนา Face Liveness Detection พิสูจน์ความเป็นบุคคล ป้องกันการปลอมแปลง และโครงการ CU NEX ที่พัฒนาร่วมกับจุฬาลงกรณ์มหาวิทยาลัย</p>\n<p>ที่มา - งานแถลงข่าว</p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/kbtg\">KBTG</a></div><div class=\"field-item odd\"><a href=\"/topics/education\">Education</a></div><div class=\"field-item even\"><a href=\"/topics/thailand\">Thailand</a></div><div class=\"field-item odd\"><a href=\"/topics/kasikorn-bank\">Kasikorn Bank</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"54f5fd3c81ec9a5f24381236ae1fb2a032bbf8a5031d162ae6527e681ad8d91e","category":"Thai"}