{"title":"ไมโครซอฟท์ขอโทษชุมชน .NET หลังถอดฟีเจอร์ Hot Reload ออกจากเวอร์ชั่นโอเพนซอร์สไปใส่ Visual Studio","link":"https://www.blognone.com/node/125436","date":1635059267000,"content":"<div><div><div><p>สัปดาห์ที่ผ่านมาชุมชน .NET เกิดดราม่าขนาดกลางๆ ขึ้นเมื่อ<a href=\"https://github.com/dotnet/sdk/pull/22217\">ไมโครซอฟท์รับ pull request หมายเลข 22217 เข้ามายัง .NET SDK รุ่นโอเพนซอร์ส</a> เป็นการถอนฟีเจอร์ Hot Reload ออกไปโดยระบุเหตุผลว่าฟีเจอร์นี้จะ<a href=\"https://www.blognone.com/node/124018\">รองรับเฉพาะผู้ใช้ Visual Studio 2022 เท่านั้น</a> และวันนี้ไมโครซอฟท์ก็ยอมถอย ใส่ฟีเจอร์กลับเข้ามาใหม่พร้อมเขียนบล็อกขอโทษชุมชน</p>\n<p>แนวทางนี้ทำให้ไมโครซอฟท์ถูกโจมตีอย่างหนักว่าไม่ได้สนใจจะทำให้ .NET เป็นแพลตฟอร์มเปิดสำหรับนักพัฒนาจริงๆ แต่มุ่งจะขาย Visual Studio เท่านั้น</p>\n<p>วันนี้ Scott Hunter ผู้อำนวยการโครงการ .NET ก็ออกมาเขียนบล็อกขอโทษถึงสิ่งที่เกิดขึ้น โดยระบุว่านักพัฒนาลบฟีเจอร์นี้ออกโดยไม่ตั้งใจ เนื่องจากต้องการโฟกัสกับการใส่ฟีเจอร์ Hot Reload ใน Visual Studio เป็นหลัก และไม่ทันคิดว่ามีนักพัฒนาใช้งานฟีเจอร์นี้มากเพียงใด และตอนนี้ไมโครซอฟท์ก็ใส่ฟีเจอร์นี้กลับมาแล้ว</p>\n<p>Hunter ขอบคุณนักพัฒนาที่แสดงความเห็นครั้งนี้ และยืนยันว่าไมโครซอฟท์ต้องการสร้าง .NET ให้เป็นแพลตฟอร์มเปิด โดยไมโครซอฟท์ก็เรียนรู้ที่จะสร้างความสมดุลระหว่างชุมชนโอเพนซอร์สและการทำงานในฐานะบริษัทผู้สนับสนุนโครงการโอเพนซอร์ส เมื่อทำผิดพลาดก็จะเรียนรู้จากความผิดพลาดครั้งนี้</p>\n<p>ที่มา - <a href=\"https://devblogs.microsoft.com/dotnet/net-hot-reload-support-via-cli/\">Microsoft .NET Blog</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/28213062b6505ac983073271aef71049.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/net\">.NET</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/open-source\">Open Source</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"54f8595022a557bf3d043b6f3f7d5efa001b501b564b43ae4a9ea415fbb08a5e","category":"Thai"}