{"title":"Cobble reef restoration in the Baltic Sea: Implications for life below water","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4216?af=R","date":1723446000000,"content":"<h2>Abstract</h2>\n<p>\nMany coastal ecosystems are impacted by human pressures. Rocky reefs are structurally complex habitats that often support elevated fish abundance and marine biodiversity. In the Baltic Sea, rocky reefs have suffered from extraction for decades, leading to a decrease in hard substrata and complex habitat availability.\nThis study is the first to restore cobble reefs and examine the biological effects.\nBaited and unbaited underwater video systems (BRUVS and UBRUVS, respectively) were employed across five years to monitor fish communities before reef deployment in 2017 and after reef deployment in 2018 and 2021.\nUsing a before–after control-impact (BACI) study design with replicates, relative abundances of Atlantic cod (<i>Gadus morhua)</i>, herring (<i>Clupeidae</i> sp.), goldsinny wrasse (<i>Ctenolabrus rupestris</i>), two-spotted goby (<i>Pomatoschistus flavescens</i>), shore crab (<i>Carcinus maenas</i>), and flatfish (<i>Pleuronectiformes</i> <b>spp.</b>) were compared across time and test sites. Comparisons were conducted across 1) restored cobble reefs, 2) natural cobble reefs, and 3) sand-bottom test sites.\nThis study found positive reef restoration effects revealed consistently by BRUVS and UBRUVS in three species: Atlantic cod, goldsinny wrasse and two-spotted goby. These findings indicate that A) it is possible to restore cobble reefs and the associated mobile fauna, but also that B) continued marine extraction of cobble degrades complex habitats to the detriment of various marine species.\nTo preserve Atlantic cod, and other sensitive species, we emphasize ecosystem restoration and warn against marine cobble reef extraction in vulnerable areas. Restoration of marine habitats may contribute to achieving the UN sustainable development goal covering life below water.\n</p>","author":"E. Casabona, \nT. Wilms, \nM. Moltesen, \nJ. L. Bertelsen, \nB. M. Kruse, \nH. Flávio, \nP. Holloway, \nJ. C. Svendsen","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"54f8f6b2dafcbdd78436c2f0195231f1061e127721702bd8b9aa2bab6fca483f","category":"Environment"}