{"title":"Verizon, AT&T, and T-Mobile kill their cross-carrier RCS messaging plans","link":"https://arstechnica.com/?p=1756913","date":1618417695000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/15-2-800x365.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/15-2.jpg\">Enlarge</a> <span>/</span> Google Messenger is the biggest RCS app out there.  (credit: Google)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The Rich Communication Services (RCS) rollout continues to be a hopeless disaster. A year and a half ago, the cellular carriers created the \"Cross-Carrier Messaging Initiative (CCMI),\" a joint venture between AT&amp;T, Sprint, T-Mobile, and Verizon that would roll out enhanced messaging to the masses in 2020. Now, <a href=\"https://www.lightreading.com/ossbsscx/verizon-atandt-t-mobile-kill-rcs-plans/d/d-id/768729\">Light Reading</a> is reporting that initiative is dead, meaning that the carriers have accomplished basically nothing on the RCS front in the past 18 months.</p>\n<p>RCS is a carrier-controlled GSMA standard introduced in 2008 as an upgrade for SMS, the ancient standard for basic carrier messaging. SMS (which started in 1992!) has not kept up with the feature set of over-the-top messaging services like WhatsApp, Facebook Messenger, and iMessage, and while RCS <em>still</em> wouldn't be able to keep up with services like those, it can bring slightly more messaging functionality to carrier messaging. RCS includes things like typing indicators, presence information, read receipts, and location sharing.</p>\n<p>Verizon confirmed the news to Light Reading, saying, \"The owners of the Cross Carrier Messaging Initiative decided to end the joint venture effort. However, the owners remain committed to enhancing the messaging experience for customers including growing the availability of RCS.\"</p></div><p><a href=\"https://arstechnica.com/?p=1756913#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1756913&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"54f955eb983c9e6eb9f4955bc165814152a4ea8aacde86217fedca0ac78ff10d","category":"Tech"}