{"title":"The effects of climate change on food production in India: evidence from the ARDL model","link":"http://link.springer.com/10.1007/s10668-023-03209-w","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>The increasing concentrations of greenhouse gas emissions in the atmosphere along with the increasing temperatures exacerbate the situation, making it one of the major issues for food security. This research aims to explore the effects of climate change on food production in India. More specifically, this study investigates the impact of temperature, rainfall, CO<sub>2</sub>, methane, and N<sub>2</sub>O emissions and energy use on food production using a time spanning from 1990 to 2019 and explores the major critical factors impacting food production in India. The study used autoregressive distributed (ARDL) estimates for long-run and short-run cointegration. The empirical results demonstrated that energy use, rainfall, and methane emissions improve food productivity, whereas temperature and N<sub>2</sub>O emissions undermine food production in the long run and short run. However, the results revealed that CO<sub>2</sub> emissions do not affect food production. Additionally, we used the dynamic ordinal least squared approach to verify the robustness of ARDL results. The results also demonstrate that N<sub>2</sub>O emissions and temperature are critical determinants of food production, indicating that a rise in temperature and N<sub>2</sub>O emissions significantly reduces food production in India. On the other hand, the findings show that methane emissions and rainfall significantly increase food production with a coefficient of 0.19 and 0.059, respectively. The most important adaptation strategies that should be considered due to climate change are reducing greenhouse gas emissions, expanding renewable energy investment, and adopting new technologies to combat environmental challenges.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"55013daf8a1fa84bcebe43cbcfd0a830140257de6a5938db8653c80a8c961f86","category":"Environment"}