{"title":"Epigenetic Reprogramming by Decitabine in Retinoblastoma","link":"https://www.preprints.org/manuscript/202404.1746/v1","date":1714126755000,"content":"Retinoblastoma (Rb) is a rare cancer that nonetheless represents the most common ocular malignancy in children. Rb exists as familiar and sporadic cancer and the increasing incidence of the sporadic one and its pathogenesis is mostly unknown. To date the management of retinoblastoma requires intensive chemotherapy and sometimes invasive surgery in order to preserve vision and quality of life in Rb patients. The discovery of the epigenetic nature of non-hereditable/sporadic Rb led to the development of high-throughput precision investigation strategies for the study of its epigenetic landscape. Here we investigated the effect of the demethylating 5-Aza-2’- deoxycytidine (Decitabine; DAC) agent on preclinical models to assess its possible use as anti-cancer drug in the treatment of Rb patients. We found that DAC treatment induced cell cycle arrest and apoptosis in Weri-Rb-1 cells. We investigated the variation of differential gene expression profile in Rb cells in relation to time of exposure to DAC with respect to controls. Network map analysis evidences 15 hub/driver genes, which share pathways of regulation of TNF-, FAS-, p53-dependent apoptotic signaling and NF-kB pro-survival pathways. Furthermore, a computing expression profile analysis of publicly available datasets of patients’ primary tumors and normal retina cell-derived organoids vs WeriWeri-Rb-1 DEGs depicted the relevancy of these 15 hub genes on retinoblastoma genesis. The antiproliferative effect of DAC treatment on Rb was confirmed in vivo, both in subcutaneous xenograft and orthotopic models also showing the changes the gene methylation status in treated Weri-Rb-1, shedding a new light on the reprogramming antiproliferative dynamics induced by the epigenetic therapy and on the role of this therapeutic approach to spare children sight and life.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5508cbd59fb3c228eb49e55aa1b45c19245cc80e34ab402e2d9e13779406695c","category":"Interdisciplinary"}