{"title":"Signal Ran Instagram Ads That Reveal What They Know About You and Facebook Quickly Banned Them","link":"https://signal.org/blog/the-instagram-ads-you-will-never-see/","date":1620169329000,"content":"\n<p>Jun Harada, writing on the Signal blog:</p>\n\n<blockquote>\n  <p>We created a multi-variant targeted ad designed to show you the\npersonal data that Facebook collects about you and sells access\nto. The ad would simply display some of the information collected\nabout the viewer which the advertising platform uses. Facebook was\nnot into that idea.</p>\n\n<p>Facebook is more than willing to sell visibility into people’s\nlives, unless it’s to tell people about how their data is being\nused. Being transparent about how ads use people’s data is\napparently enough to get banned; in Facebook’s world, the only\nacceptable usage is to hide what you’re doing from your audience.</p>\n\n<p>So, here are some examples of the targeted ads that you’ll never\nsee on Instagram. Yours would have been <em>so</em> you.</p>\n</blockquote>\n\n<p>Good point <a href=\"https://twitter.com/markhurst/status/1389679364795678720\">from Mark Hurst</a>:</p>\n\n<blockquote>\n  <p>Facebook breaks the law and says “our enforcement is never\nperfect.” Sure, because it’s impossible to control their vast\nplatforms.</p>\n\n<p>But @Signal posted FB ads showing surveillance in action, and\nFacebook disabled them immediately.</p>\n</blockquote>\n\n<p><strong>Update:</strong> It occurred to me after sleeping on this that I’d like to know more about how Signal pulled this off. I’m not saying I need to see source code, but at least some sort of explanation of how the stunt worked. The implication is that while Signal’s ads were running, people were seeing ads <em>individually tailored to their interests</em>. I’d love to know more about how that worked. Were they dynamically generated? I don’t see how that would be fast enough. Were the ads all generated in advance? If so, how many did they make? Did they make, say, 100 oddly-specific ads and then use Instagram’s targeting features to serve each of those ads to the best fit for those oddly specific demographics? Signal has earned our collective trust, but there’s a whiff of “too good to be true” about this stunt — it’s heavy on the schadenfreude but light on details.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/05/04/signal-instagram-ads\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"55098126dca482b5806b229ef94e5c812dec4498e05d0f4acb00af7a979b5c76","category":"Tech"}