{"title":"Transdisciplinary Research Supports the Sustainability of Barrier Island Systems Threatened by Climate Change","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004854?af=R","date":1727433002000,"content":"<h2>Abstract</h2>\n<p>The management of developed barrier islands is often piece-meal and reactionary despite the complex, dynamic nature of these systems, and sustainable practices will become increasingly difficult due to heightened pressures of climate change. Adaptation actions, including nature-based solutions, need to be thoroughly evaluated prior to implementation to understand system-wide impacts and avoid maladaptation. Anarde et al. (2024a), (<a target=\"_blank\" href=\"https://doi.org/10.1029/2023ef003672\">https://doi.org/10.1029/2023ef003672</a>), Anarde et al. (2024b), (<a target=\"_blank\" href=\"https://doi.org/10.1029/2023ef004200\">https://doi.org/10.1029/2023ef004200</a>) is the latest important contribution in a growing body of transdisciplinary research that more robustly evaluates the complex physical process-and-response relationship of barrier systems via sophisticated numerical modeling approaches that also interface with socioeconomic models to inform coastal management actions in response to mitigating coastal risk. This new research indicates the importance of coordinated system-scale barrier island management, as strategies to reduce coastal hazard risk in one location will directly affect adjacent communities. Further, this work demonstrates that reducing barrier management interventions may actually promote barrier recovery and sustainability in the face of sea level rise. In addition, recent advances in the analysis and application of remotely sensed data from satellites and oblique aerial photography provide scientists an unprecedented opportunity to track coastal evolution over a wide range of spatial and temporal scales at minimal cost. As sea level rise and changing storm patterns challenge the sustainable management of barrier island systems, integrating these advanced, transdisciplinary tools will enable scientists and coastal practitioners to more thoroughly evaluate coastal adaptation options, efficiently invest limited resources to mitigate coastal hazard risk for communities, support healthy ecosystems, and reduce system-wide impacts.</p>","author":"Patrick L. Barnard, \nDavina L. Passeri","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"550f9685d4ebfa77732ffe2834d9e9a6d07ee8a125786459f87466a68e3a0b0d","category":"Environment"}