{"title":"In Situ Gelling Behavior and Biopharmaceutical Characterization of Nono-Silver Loaded Poloxamer Matrices Designed for Nasal Drug Delivery","link":"https://www.preprints.org/manuscript/202404.1537/v1","date":1713876733000,"content":"A combination of Poloxamer 407 (P407) and hydroxypropyl methylcellulose (HPMC) hydrosols is proposed as an in situ thermo-gelling vehicle for the nasal drug delivery of chlorhexidine-silver nanoparticles conjugates (SN-CX). Varying ratios of P407 and HPMC were applied in the presence and absence of SN-CX in order to optimize the gelation temperature (Tg) to values close to the physiological nasal such (30–34°C). Mechanisms for the observed gelation phenomena were suggested based on viscosimetry, texture analysis, and dynamic light scattering. Tests were carried out for sprayability, washout time, in vitro drug release, ex vivo permeation, and antimicrobial activity. When applied separately, HPMC was found to lower the P407 gelation temperature, whereas SN-CX increased it. However, in the presence of HPMC, SN-CX interfered with the P407 micellar organization in a principally contrasting way, while leading to an even further decrease in Tg. SN-CX-loaded nasal formulation composed of P407 16% and HPMC 0.1% demonstrated a desired gelation at 31.9 °C, good sprayability (52.95% coverage of the anterior nasal cavity), mucoadhesion for 70 min under simulated nasal clearance, expedient release and permeation, and preserved anti-infective activity against seasonal Influenza virus and beta-coronavirus, Pseudomonas aeruginosa, Klebsiella pneumoniae, Staphylococcus aureus and other pathogens. Our findings suggest that the current development could be considered a potential formulation of a protective nasal spray against respiratory infections.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"551019d74d61f1abf8a16c3140042dd9de4f5830ccb8280f071b89e08d26da6d","category":"Interdisciplinary"}