{"title":"Metal‐free nanostructured‐carbon inks for a sustainable fabrication of zinc/air batteries: From ORR activity to a simple prototype","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300023?af=R","date":1692789613000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/905fd838-d6d8-41bc-bfb8-0a6055cf4c4f/appl202300023-gra-0001-m.png\" alt=\"Metal-free nanostructured-carbon inks for a sustainable fabrication of zinc/air batteries: From ORR activity to a simple prototype\" /><p>Electrochemical key parameters for different carbon nanotube compositions and typologies represented by colors, correlated to their respective performances in a zinc–air battery.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Zinc/air batteries are convenient energy storage devices for both small and massive applications. While future perspectives indicate the need for low-cost components and sustainable fabrication processes, the battery performance is in part controlled by the kinetics of the oxygen reduction reaction (ORR), which typically involves transition metals as catalysts. In this context, we prepare a series of metal-free water-based carbon inks, which are tested for their catalytic performance, once deposited on a gas-diffusion substrate, in the air cathode of a simple battery prototype. The inks contain a variety of well-defined carbon nanomaterials and additives, exhibiting different physicochemical properties that critically influence the interaction with the gas diffusion hydrophobic substrate. The intrinsic ORR catalytic activity of the ink material is also analyzed on a glassy carbon electrode by the rotating ring-disc electrode (RRDE) method and specific capacitance measurements. The discharge capacity on our zinc/air battery prototype correlates well with the intrinsic catalytic activity in the RRDE. However, only the activity in the RRDE does not actually assure the performance on the commercial cathode of the prototype, since other chemical compatibility issues play a role. Thus, we highlight the importance of catalyst testing, not only on the RRDE but also under realistic device conditions.</p>","author":"Florencio Santos, \nSebastian Lorca, \nJuan F. Gonzalez‐Martinez, \nAntonio Urbina, \nMiguel A. Alvarez‐Sanchez, \nJosé M. González‐Domínguez, \nEnrique García‐Bordejé, \nAlejandro Ansón‐Casaos, \nAna M. Benito, \nWolfgang K. Maser, \nAntonio J. Fernández Romero","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"5512955f661b229c2bfd1818b5e4c27464cb144d7ec2cb6caf076b69c8efb087","category":"Environment"}