{"title":"Direct and indirect responses of the Arabidopsis transcriptome to an induced increase in trehalose 6-phosphate","link":"https://academic.oup.com/plphys/article/196/1/409/7642903?rss=1","date":1712620800000,"content":"<span><div>Abstract</div>Trehalose 6-phosphate (Tre6P) is an essential signal metabolite that regulates the level of sucrose, linking growth and development to the metabolic status. We hypothesized that Tre6P plays a role in mediating the regulation of gene expression by sucrose. To test this, we performed transcriptomic profiling on Arabidopsis (<span>Arabidopsis thaliana</span>) plants that expressed a bacterial TREHALOSE 6-PHOSPHATE SYNTHASE (TPS) under the control of an ethanol-inducible promoter. Induction led to a 4-fold rise in Tre6P levels, a concomitant decrease in sucrose, significant changes (FDR ≤ 0.05) of over 13,000 transcripts, and 2-fold or larger changes of over 5,000 transcripts. Comparison with nine published responses to sugar availability allowed some of these changes to be linked to the rise in Tre6P, while others were probably due to lower sucrose or other indirect effects. Changes linked to Tre6P included repression of photosynthesis-related gene expression and induction of many growth-related processes including ribosome biogenesis. About 500 starvation-related genes are known to be induced by SUCROSE-NON-FERMENTING-1-RELATED KINASE 1 (SnRK1). They were largely repressed by Tre6P in a manner consistent with SnRK1 inhibition by Tre6P. SnRK1 also represses many genes that are involved in biosynthesis and growth. These responded to Tre6P in a more complex manner, pointing toward Tre6P interacting with other C-signaling pathways. Additionally, elevated Tre6P modified the expression of genes encoding regulatory subunits of the SnRK1 complex and TPS class II and FCS-LIKE ZINC FINGER proteins that are thought to modulate SnRK1 function and genes involved in circadian, TARGET OF RAPAMYCIN, light, abscisic acid, and other hormone signaling.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"5519686000a72bde7b06db6fd3303bb3f7988a09c4072b701420c39429384b76","category":"Environment"}