{"title":"Humic acid improves wheat growth by modulating auxin and cytokinin biosynthesis pathways","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae018/7634559?rss=1","date":1711324800000,"content":"<span><div>Abstract</div>Humic acids have been widely used for centuries to enhance plant growth and productivity. The beneficial effects of humic acids have been attributed to different functional groups and phytohormone-like compounds enclosed in macrostructure. However, the mechanisms underlying the plant growth-promoting effects of humic acids are only partially understood. We hypothesize that the bio-stimulatory effect of humic acids is mainly due to the modulation of innate pathways of auxin and cytokinin biosynthesis in treated plants. A physiological investigation along with molecular characterization was carried out to understand the mechanism of bio-stimulatory effects of humic acid. A gene expression analysis was performed for the genes involved in auxin and cytokinin biosynthesis pathways in wheat seedlings. Furthermore, <span>Arabidopsis thaliana</span> transgenic lines generated by fusing the auxin-responsive <span>DR5</span> and cytokinin-responsive <span>ARR5</span> promoter to ß-glucuronidase (<span>GUS</span>) reporter were used to study the GUS expression analysis in humic acid treated seedlings. This study demonstrates that humic acid treatment improved the shoot and root growth of wheat seedlings. The expression of several genes involved in auxin (<span>Tryptophan Aminotransferase of Arabidopsis</span> and <span>Gretchen Hagen 3.2</span>) and cytokinin (<span>Lonely Guy3</span>) biosynthesis pathways were up-regulated in humic acid-treated seedlings compared to the control. Furthermore, GUS expression analysis showed that bioactive compounds of humic acid stimulate endogenous auxin and cytokinin-like activities. This study is the first report in which using ARR5:GUS lines we demonstrate the biostimulants activity of humic acid.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"551cee6a1b955d30c608074624013a7f6c12a9b050232a7e5c3ee1f53294e71c","category":"Environment"}