{"title":"Humane Announces Telco Partnerships in Japan and South Korea","link":"https://humane.com/media/humane-and-softbank","date":1709247856000,"content":"\n<p>Humane, yesterday:</p>\n\n<blockquote>\n  <p>This partnership, as part of a strategic investment opportunity, \nwill see SoftBank become the exclusive telecom provider for Ai Pin \nin Japan, leveraging SoftBank’s top-class services and compelling \ncustomer touchpoints to bring Ai Pin to a new market. SoftBank and \nHumane will also explore bringing CosmOS to other mobile devices \nand be working together on an app-less ecosystem of third-party \nservices and AI-driven user experiences in Japan. </p>\n</blockquote>\n\n<p>And in <a href=\"https://humane.com/media/humane-and-sk-telecom\">a separate announcement the day before</a>:</p>\n\n<blockquote>\n  <p>Humane Inc and South Korea’s biggest mobile telecommunication \ncompany SK Telecom (SKT) today announced a Telco partnership for \nthe Humane Ai Pin, the world’s first stand-alone Ai device and \nproprietary Ai-driven OS, CosmOS. </p>\n\n<p>This partnership, as part of a strategic investment opportunity, \nwill see SKT become the exclusive telecom provider for Ai Pin in \nSouth Korea, combining Humane’s groundbreaking AI technology with \nSKT’s expertise in advanced mobile networks, IoT, Cloud, AI, and \n5G technologies. Alongside Ai Pin, both companies will explore \nlicensing Humane’s CosmOS, creating an entirely new operating \nmodel between carriers and OEMs. </p>\n</blockquote>\n\n<p><a href=\"https://en.wikipedia.org/wiki/NeXT\">NeXT</a> shipped their first workstations in 1989, but got out of the hardware business in 1993 and tried to make a go of just licensing their OS. Humane might be making that same pivot two months before their first device ships.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/02/29/humane-japan-korea\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"552ad3ff81ff7bce73a0602d028ecd940202f5a2719d010009e84d87d1d44616","category":"Tech"}