{"title":"Apple Developers Required to Justify Use of Some APIs in Latest Move to Boost Privacy","link":"https://www.macrumors.com/2023/07/28/developers-required-to-justify-api-use/","date":1690548031000,"content":"In an effort to bolster user privacy, developers will need to justify their use of certain Apple APIs before their apps can be listed on the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, according to a new <a href=\"https://developer.apple.com/documentation/bundleresources/privacy_manifest_files/describing_use_of_required_reason_api\">article on the Apple developer website</a> spotted by <a href=\"https://9to5mac.com/2023/07/27/app-store-describe-app-api/\"><em>9to5Mac</em></a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/iOS-App-Store-General-Feature-Desaturated.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nThe Apple Developer website now lists some APIs as \"Required Reason APIs,\" meaning that developers have to clarify why they are using them in their privacy manifest. Some commonly used APIs, such as UserDefaults, which stores user preferences, now fall under the Required Reason category.\r<br />\n\r<br />\nWith the launch of <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a>, <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a>, tvOS 17, and <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">macOS Sonoma</a> later this year, developers will receive a warning if they submit apps using a Required Reason API without specifying its usage. From spring 2024, any apps using these APIs without a legitimate justification will be rejected in the review process.\r<br />\n\r<br />\nApple explains that main reason for this change is to curb fingerprinting, a method used to track users across different apps and websites. Fingerprinting uses API calls to gather details about a user's device, such as screen resolution, model, and operating system. This data is then used to create a unique \"fingerprint,\" enabling the user to be identified across various apps or websites.\r<br />\n\r<br />\nAccording to Apple, Required Reason APIs will guarantee that apps only employ these APIs for their prescribed use. In the event of a rejection, Apple will permit developers to contest the decision and submit a request for approval if their case does not fit within the existing guidelines. See the <a href=\"https://developer.apple.com/documentation/bundleresources/privacy_manifest_files/describing_use_of_required_reason_api\">Apple Developer website</a> for more information.\r<br />\n<br />This article, \"<a href=\"https://www.macrumors.com/2023/07/28/developers-required-to-justify-api-use/\">Apple Developers Required to Justify Use of Some APIs in Latest Move to Boost Privacy</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-developers-required-to-justify-use-of-some-apis-in-latest-move-to-boost-privacy.2397140/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5533b8a1e7729c01ada89553e6c680ef420b6a70244dba26862fae596df8d3f4","category":"Apple"}