{"title":"Evaluation of the Effectiveness of Search and Rescue Dogs in Finding Survivors During Disasters: The Case of Serbia, Croatia, and Slovenia","link":"https://www.preprints.org/manuscript/202407.0584/v1","date":1720420507000,"content":"Disasters, whether natural or human-induced, pose significant threats to human lives, property, and infrastructure. This study examines the effectiveness of search and rescue (SAR) dogs in locating survivors during disasters, with a focus on the experiences in Serbia, Croatia, and Slovenia. The primary goals are to evaluate training protocols, operational challenges, success rates, and the overall impact of SAR dogs in disaster scenarios. The findings indicate that SAR dogs greatly enhance the efficiency of disaster response operations. Their superior sense of smell, agility, and ability to manoeuvre through complex terrains make them crucial for quickly locating survivors. However, the performance of SAR dogs is affected by various factors, including the quality of their training, environmental conditions, and the coordination between handlers and dogs. The research highlights several challenges encountered by SAR dogs, such as extreme weather conditions, hazardous terrains, fatigue, and psychological stress. Additionally, limited resources and inconsistent training standards can hinder their effectiveness. The study underscores the importance of standardized training protocols, increased resource allocation, and better coordination among SAR teams. By addressing these challenges, the efficiency of SAR dogs can be further optimized, resulting in more effective disaster responses and higher survival rates. SAR dogs play an essential role in disaster management in Serbia, Croatia, and Slovenia. Ongoing investment in their training and welfare, along with improved operational protocols, will ensure their crucial contribution to saving lives during disasters. This study contributes to a broader understanding of the effectiveness of SAR dogs and provides practical recommendations for enhancing disaster response strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"553a400a743fc35d3252592a139c2f3cef4252a6fcef94dc9bdf874c170b8fef","category":"Interdisciplinary"}