{"title":"Evaluating the spatiotemporal variation of Ba River water quality in the agricultural and urban watershed in the highland of Vietnam","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11100?af=R","date":1723532400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/ba98b2c2-d481-42cc-9a3c-093de1c856e6/wer11100-toc-0001-m.png\" alt=\"Evaluating the spatiotemporal variation of Ba River water quality in the agricultural and urban watershed in the highland of Vietnam\" />\n<p>Water quality in Ba River has been deteriorating due to anthropogenic activities such as intensive agricultural activities, domestic wastewater, mining, and industrial activities. In the period of 2022–2023, the concentrations of most parameters in the autumn (mid-rainy season) were higher than the figures in the other seasons (early-dry and mid-dry seasons). Interesting, the typical pesticides chlorpyrifos (ethyl) and deltamethrin were detected in the study area, revealing the effect of agricultural activity in the region.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The Ba River in Vietnam has been facing pollution due to waste generation from agricultural and urban areas. This study focuses on evaluating the spatiotemporal variations in river water quality based on physicochemical characteristics and pesticide parameters for different seasons in 2022–2023. The results indicate that the concentrations of most parameters in the rainy season were higher than those in the early-dry and dry seasons due to the non-point sources in agricultural areas. Notably, the analysis of pesticide residue in both the rainy and dry seasons revealed low levels of chlorpyrifos (ethyl), and deltamethrin was detected in the only rainy season. The results from the hierarchical cluster analysis and water quality index show that the water quality at Ben Mong, An Khe, and Ba River Bridges was classified as moderately to highly polluted. These areas should focus on regular water quality monitoring and appropriate pollution source management.</p>\n<h2>Practitioner Points</h2>\n<p>\nAgriculture activities strongly affected the water quality of the Highland Ba River of Vietnam.\nChlorpyrifos and deltamethrin pesticides (0.0074–0.0218 μg/L) were detected in Ba River.\nNon-point pollution sources significantly influenced water quality in the Ba River.\nVariations in river water quality mainly depend on seasons and locations.\nWater quality index values in rainy seasons (26–88) are lower than that in dry season (37–92).\n</p>","author":"Tuan Anh Nguyen, \nThi Nhan Nguyen, \nVan Tri Dao, \nBritta Schmalz, \nLe Luu Tran","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"554c39e70a79419f7040697d87b4542e1e07978c797d1cd9a98967599c1e389d","category":"Environment"}