{"title":"เปเปอร์วิจัย วิเคราะห์อารมณ์ความรู้สึก Taylor Swift จากเพลงที่แต่ง ช่วงไหนสุข-เศร้าที่สุด","link":"https://www.blognone.com/node/122017","date":1617378473000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>Megan Mansfield และ Darryl Seligman นักวิจัยด้านฟิสิกส์สองคนจากมหาวิทยาลัยชิคาโก เผยแพร่ร่างรายงานวิจัยวิเคราะห์อารมณ์ของนักร้องสาว Taylor Swift จากเพลงที่เธอแต่งในแต่ละช่วงเวลา</p>\n<p>เป็นที่รู้กันดีในหมู่แฟนเพลงว่า ชีวิตรักของ Taylor Swift มีสีสันมากมาย และเธอก็นำมุมมองต่างๆ ทั้งดีและแย่มาใส่ในเพลงของเธอ ทีมผู้วิจัยจึงสนใจวิเคราะห์รูปแบบของเพลงที่เธอแต่งมาตลอด 14 ปีของอาชีพนักร้อง ว่าแต่ละอัลบั้มสะท้อนอารมณ์ของเธออย่างไรบ้าง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/cdddefaffa288a0b7da9abea1c245bd0.jpg\" ></p>\n<p>ระเบียบวิธีวิจัยคือนำเพลงทั้งหมดของ Taylor มาคัดเพลงโฆษณา เพลงคัฟเวอร์ เพลงที่แต่งร่วมกับนักร้องคนอื่น (และเธอไม่ได้เป็นคนแต่งหลัก) ออกไปจากกลุ่มตัวอย่าง เหลือทั้งหมด 154 เพลง จากนั้นตัดเพลงที่ไม่เกี่ยวกับชีวิตรักออกอีก 5 เพลง เหลือ 149 เพลง</p>\n<p>ผู้วิจัยฟังเพลงทั้งหมด (ใช้เวลารวมเกือบ 10 ชั่วโมง ซึ่งผู้วิจัยบอกว่าเหมาะกับการฆ่าเวลาในช่วงโรคระบาด) วิเคราะห์เนื้อเพลง จังหวะบีทต่อนาที และดูมิวสิควิดีโอด้วย (ถ้ามี) แล้วนำมาวิเคราะห์เนื้อหาของเพลงเพื่อตีความ โดยให้คะแนนเป็น 2 แกนคือ คะแนนความสัมพันธ์ (relationship score) กับคะแนนความสุข (happiness score) นำมาหาความเชื่อมโยงกัน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/4096c7361ae6a783a0287b82eed4b7eb.png\" ></p>\n<p>สิ่งที่ผู้วิจัยพบคือ</p>\n<ul>\n<li>อัลบั้มที่ Taylor มีความสุขมากที่สุดคือ Lover (2019) ตามด้วย Speak Now ส่วนอัลบั้มที่มีความสุขน้อยที่สุดคือ Taylor Swift (อัลบั้มแรก) และ Red</li>\n<li>อัลบั้มที่ Taylor มีความสัมพันธ์ดีที่สุดคือ Lover ส่วนอัลบั้มที่มีความสัมพันธ์แย่ที่สุดคือ Speak Now</li>\n<li>อัลบั้ม Lover ปี 2019 เป็นอัลบั้มที่อารมณ์ความรู้สึกของ Taylor ดีที่สุดทั้งสองด้าน ในขณะที่อัลบั้ม folklore/evermore ของปี 2020 คะแนนกลับใกล้ศูนย์ คือไม่บวกและไม่ลบ ซึ่งผู้วิจัยมองว่าสะท้อนความสัมพันธ์ที่เริ่มมั่นคง และอายุของเธอเองที่มากขึ้นด้วย</li>\n<li>ในด้านกลับกัน อัลบั้มที่ Taylor มีคะแนนอารมณ์ไม่ค่อยดี มีความเชื่อมโยงกับจำนวนบุคคลที่เข้าข่าย \"Bad Boys\" ที่ปรากฏอยู่ในเนื้อเพลงอย่างชัดเจน โดยอัลบั้ม Speak Now มี Bad Boys จำนวนสูงสุดคือ 3 คน</li>\n<li>อีกประเด็นที่น่าสนใจคือ Taylor มักเอ่ยถึง \"สีของดวงตา\" ของบุคคลในเพลงอยู่บ่อยครั้ง ผู้วิจัยได้วิเคราะห์ความเชื่อมโยงของอารมณ์ Taylor กับสีตาของบุคคลในเพลง และพบว่าคนที่ตาสีคราม (indigo) เป็นคนที่ทำให้เธอมีความสุขมากที่สุด</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/2934abb1d82801d55e7af5a2ac6ce5fa.png\" ></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/be96358f92ca51ca36a00317297d6017.png\" ></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8842c68618ad5e35c9e33da49389e743.png\" ></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/72ff41b136643e1f668b6c1ded60f096.png\" ></p>\n<p>ระหว่างการวิจัย ผู้วิจัยสร้างสคริปต์ภาษา Python เพื่อรวบรวมสถิติมาวิเคราะห์ และพัฒนาต่อมาเป็นโปรแกรมชื่อ taylorswift เอาไว้ใช้เลือกเพลงของ Taylor ที่ตรงกับอารมณ์ของเราในขณะนั้นได้ โปรแกรมเปิดให้ดาวน์โหลดบน <a href=\"https://github.com/meganmansfield/taylorswift\">GitHub</a></p>\n<p>งานวิจัยชิ้นนี้ชื่อว่า I Knew You Were Trouble: Emotional Trends in the Repertoire of Taylor Swift ตีพิมพ์ฉบับร่างในวันที่ 1 เมษายน 2021 ถึงแม้เป็นมุขตลกที่ออกแบบมาเพื่อวัน April's Fools แต่ก็เป็นงานวิจัยจริงๆ และโปรแกรมที่ใช้ก็รันได้จริงๆ ด้วย</p>\n<p>สำหรับผู้สนใจอ่านเปเปอร์ฉบับเต็ม ดูได้จาก <a href=\"https://arxiv.org/pdf/2103.16737.pdf\">I Knew You Were Trouble: Emotional Trends in the Repertoire of Taylor Swift</a></p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/taylor-swift\">Taylor Swift</a></div><div class=\"field-item odd\"><a href=\"/topics/research\">Research</a></div><div class=\"field-item even\"><a href=\"/topics/music\">Music</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"55576731ca5dbe3a6a286ee039bccdd4d38d40cbd3f0097174c1001b7b988416","category":"Thai"}