{"title":"Geraint Thomas’s GC hopes fade on the Tour’s first mountain stage","link":"https://cyclingtips.com/2021/07/geraint-thomass-gc-hopes-fade-on-the-tours-first-mountain-stage/","date":1625322381000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/geraintthomas-650x433.jpg\" /></div><h2>Geraint Thomas's GC hopes fade on the Tour's first mountain stage</h2><p>\n</p><p>Eight days into the <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a> and five days after <a href=\"https://cyclingtips.com/2021/06/nightmare-continues-for-ineos-grenadiers-at-the-tour-de-france/\" target=\"_blank\">dislocating his shoulder</a>, Geraint Thomas (Ineos Grenadiers) saw his GC hopes fade on Saturday. The 2018 Tour winner was dropped early on stage 8, the first day in the high mountains so far in this race, and finished the stage more than 34 minutes behind new race leader Tadej Pogačar (UAE Team Emirates).</p>\n\n\n\n<p>Thomas lost touch with the pack less than 10 km into the stage amid a fast start on rain-slicked roads. The Ineos Grenadiers did not send a contingent of domestiques back to help the former Tour winner, instead focusing their efforts around Richard Carapaz.</p>\n\n\n\n<p>Thomas linked up with a number of other stragglers but the gap to the peloton only grew and before long it was clear that Thomas would not be getting back to the pack. Eventually, fellow former pre-race favorite Primož Roglič (Jumbo-Visma) was dropped from the peloton and would ultimately join Thomas and the rest of his group.</p>\n\n\n\n<p>By the midpoint of the stage, Thomas and Roglic were some eight minutes behind the peloton.</p>\n\n\n\n<p>Thomas’s rough outing in the Alps comes five days after he dislocated his shoulder in a crash on stage 3. Although it was popped back into place mid-race and Thomas was able to continue, the 35-year-old Welshman did not put in the performance he would have hoped for in the stage 5 time trial, clearly still affected by the injury. Then, in the finale of Friday’s stage 7, he was briefly dropped as the peloton made its way up a late climb.</p>\n\n\n\n<p>He came into Saturday’s stage 8 in 13th overall, 5:29 down on race leader Mathieu van der Poel (Alpecin-Fenix) and 1:36 behind Pogačar. Now, however, Thomas’s GC hopes have faded entirely.</p>\n\n\n\n<p>After eight days of racing at the Tour, Richard Carapaz is the only Ineos Grenadier within six minutes of the Tour’s defending champion.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/geraint-thomass-gc-hopes-fade-on-the-tours-first-mountain-stage/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"555a8eda05a2565f713d812c028c81e4815f8ed8f4dddc879c0d18e84f03618d","category":"Cycling"}