{"title":"Evidence for a Giant Magneto-Electric Coupling in Bulk Composites with Coaxial Nanofibers of Nickel Zinc Ferrite and PZT","link":"https://www.preprints.org/manuscript/202406.1997/v1","date":1719544424000,"content":"This report is on magneto-electric (ME) interactions in bulk composites with coaxial nanofibers of nickel zinc ferrite and PZT.  Core-shell fibers of PZT and Ni1-x Znx Fe2 O4 (NZFO) with x = 0-0.5 were made by electrospinning.  Both kind of fibers, either with ferrite- or PZT-core and with diameters in the range 1-3 m were made.  Electron- and scanning probe microscopy images indicted well-formed fibers with uniform core and shell structures and defect free interface.  X-ray diffraction data for fibers annealed at 700-900 C did not show any impurity phases.  Magnetization, magnetostriction, ferromagnetic resonance, and polarization P versus electric field E measurements confirmed the ferroic nature of the fibers.  For ME measurements the fibers were pressed into disks and rectangular platelets and then annealed at 900-1000 C for densification.  Strengths of strain mediated ME coupling were measured by H-induced changes in remnant polarization Pr and by low-frequency ME voltage coefficient (MEVC).  The fractional change in Pr under H increased in magnitude, from +3% for disks of NFO– PZT to -82% for NZFO (x=0.3)-PZT, and further increase in x resulted in a decrease to a value of -3% for x=0.5.  Low-frequency MEVC measured in disks of the core-shell fibers ranged from 6 mV/cm Oe to 37 mV/cm Oe.  The fractional changes in Pr and the MEVC values were an order of magnitude higher than for bulk samples containing mixed fibers with random distribution of NZFO and PZT. The bulk composites with coaxial fibers have the potential for use as magnetic field sensors and in energy harvesting applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"555c0f0db368e67c1139328b157e987f5ef92191c718788fa798eb4c2370505c","category":"Interdisciplinary"}