{"title":"How AWS is Supporting Nonprofits, Governments, and Communities Impacted by Hurricane Ida","link":"https://aws.amazon.com/blogs/aws/how-aws-is-supporting-nonprofits-governments-and-communities-impacted-by-hurricane-ida/","date":1631724202000,"content":"<div>\n <a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/10/Cable-Running.jpg\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/10/Cable-Running.jpg\" /></a>\n <p>AWS Disaster Response Team volunteer Paul Fries runs cable to provide connectivity in a police station that has been converted into a supply distribution center and housing for National Guard troops and FEMA.</p>\n</div> \n<p>During the crisis that has resulted in the aftermath of Hurricane Ida, the AWS Disaster Response Team is providing personnel and resources to support our customers, including the Information Technology Disaster Resource Center (ITDRC), St. Bernard Parish government, and Crisis Cleanup.</p> \n<p>In 2018, Amazon Web Services launched the <a href=\"https://www.aboutamazon.com/news/aws/hurricane-season-and-help-has-arrived\">AWS Disaster Response Program</a> to support governments and nonprofits actively responding to natural disasters. Guided by the belief that technology has the power to solve the world’s most pressing issues, the AWS Disaster Response Team has been working around the clock to provide pro bono assistance to public sector organizations responding to Hurricane Ida’s widespread damage.</p> \n<p>The team brings in technical expertise in the form of solutions architects, machine learning practitioners, experts in edge computing, and others across AWS. This allows AWS to support organizations responding to disasters and help them overcome the unique challenges they face.</p> \n<p><strong><u>Establishing Connectivity</u></strong></p> \n<p>When Hurricane Ida hit the United States on August 29th, 2021, it caused power outages and major disruptions to infrastructures for water, power, cellular, and commercial communications. In the South, many were left homeless or without electricity, gas, or water by Ida’s winds and flooding. In New York and New Jersey, hundreds of thousands of people lost power. The AWS Disaster Response team activated its response protocol, including technical volunteer support on the ground and financial support to disaster relief nonprofit <a href=\"https://www.itdrc.org/\">ITDRC</a> for its efforts to establish local internet connectivity and cell phone charging stations. This critical support – including almost 100 sites in New Orleans, Houma, and other heavily impacted areas of Louisiana – is enabling public safety agencies, responding relief organizations, social services, and community members to communicate and coordinate as they respond to and recover from Ida.</p> \n<p><strong><u>Increasing Capacity</u></strong></p> \n<p>AWS volunteers supported disaster relief nonprofit <a href=\"https://www.crisiscleanup.org/\">Crisis Cleanup</a> by providing technical AWS service architecture guidance, enabling them to increase their capacity to provide call-backs to community members requesting assistance with tasks like cutting fallen trees and tarping roofs that were damaged by the storm. AWS volunteers are also helping Crisis Cleanup by conducting call-backs, bolstering their volunteer base to reach a greater number of people more quickly than otherwise would have been possible.</p> \n<p><strong><u>Building Resiliency</u></strong></p> \n<p>To support the St. Bernard Parish government, located just outside of New Orleans, AWS assisted with the deployment of <a href=\"https://aws.amazon.com/workmail/\">Amazon WorkMail</a> to facilitate more resilient communication across teams when their email server was knocked offline when the power went out. Using <span>Amazon WorkMail</span> helped enable government personnel to more effectively communicate by utilizing the cloud instead of traditional infrastructures.</p> \n<p>The AWS Disaster Response Team continues to field requests for support following Hurricane Ida, and is also working with other organizations to support their resilience planning and disaster preparedness efforts.</p> \n<p><strong><u>Learn More</u></strong></p> \n<p>Check out the <a href=\"https://aws.amazon.com/government-education/nonprofits/disaster-response/\">AWS Disaster Response page</a> for more information. To donate cash and supplies to organizations such as Feeding America and Save the Children, visit <a href=\"https://www.amazon.com/b?ie=UTF8&amp;node=17285237011\">the Amazon page on Hurricane Ida</a> or just say, “Alexa, I want to donate to Hurricane Ida relief.”</p>","author":"AWS News Blog Team","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"555f4704182656cbe6d17a41d613e4e07e7aa236eedb441581ca132e856d087a","category":"Tech"}