{"title":"Best women’s bikes – a buyer’s guide to find what you need","link":"https://www.bikeradar.com/advice/buyers-guides/best-womens-bikes-a-buyers-guide-to-find-what-you-need/","date":1617037500000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2019/04/womens_mountainbike_pique-1495470484208-7rk45v3xbxsg-f7bd29f.jpg?quality=45&amp;resize=620,413\" />                                            <p>Getting into cycling and looking to buy a bike, but unsure what type of bike is best for you and your budget? We can help!</p>\n<p>This guide will break it all down, explaining the different types of bikes out there, what kind of riding they’re best suited to and what to expect for your budget, plus lots of advice to help you get riding and loving it.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Looking for a women’s bike? There are more options than ever, with plenty to choose from no matter what kind of cycling you’re planning.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<h2>What type of bike do I need?</h2>\n<p>There are three general types of bike: road bikes, mountain bikes and hybrid bikes, and within each category there is further variation, so you can get really specific about what’s the right bike for you.</p>\n<h3>Road bikes</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Road bikes are great for covering long distances, with some designed for endurance and comfort, and others for speed.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Road bikes are designed for speed and distance on the road. They have lightweight frames, slim tyres and a handlebar with a drop for a more aerodynamic position on the bike.</p>\n<p>Some road bikes are designed with a focus on endurance and comfort, while others focus on speed, making them the ideal choice if you want to cover greater distances, explore the countryside or are planning to do a race or other on-road event.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">Gravel and adventure bikes</a> are becoming increasingly popular. They look like road bikes with their drop handlebars but are designed to be more rugged, and you can often fit luggage and mudguards to them, making them popular for touring, bikepacking and even commuting.</p>\n<p>If a road bike is what you’re looking for, check out our list of the <a href=\"https://www.bikeradar.com/features/best-womens-road-bikes-12-of-the-best/\" target=\"_blank\">best road bikes</a> we’ve tried and tested.</p>\n<h3>Mountain bikes</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> There’s a lot of fun to be had on a mountain bike.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>Mountain bikes are extremely versatile. They’re typically built for off-road use but can still be ridden on any road, they’ll just be slower going than a road bike.</p>\n<p>They have flat handlebars and wider tyres, and usually have suspension on either the front only (hardtail) or on the front and rear (full-suspension), which helps smooth out rough terrain and provides traction for climbing, cornering and riding on muddy ground.</p>\n<p>Mountain bikes are ideal for exploring your local woods, heading out on singletrack and going to a trail centre or bike park.</p>\n<p>Our <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\" target=\"_blank\">buyer’s guide to the best mountain bikes</a> has something for every budget to help you choose what’s right for you, and we’ve also rounded up the <a href=\"https://www.bikeradar.com/gear/article/best-womens-mountain-bike-how-to-choose-the-right-bike-for-you-47069/\" target=\"_blank\">best women’s-specific mountain bikes</a> we’ve tested.</p>\n<h3>Hybrid bikes</h3>\n<p>Hybrid bikes, also known as urban bikes, <a href=\"https://www.bikeradar.com/advice/buyers-guides/whats-the-best-bike-for-commuting/\">commuter bikes</a> and city bikes, usually sit somewhere between road and mountain bikes in their design.</p>\n<p>They typically have flat handlebars and an upright riding position, which make it easy to keep an eye on your surroundings and navigate when riding in traffic.</p>\n<p>Hybrids can have a road-style frame that’s lightweight with a focus on speed and agility or a mountain bike-style frame that’s designed to handle rough roads, towpaths or fire roads, and some front suspension.</p>\n<p>Hybrid bikes also have lugs for attaching mudguards (fenders), pannier racks and <a href=\"https://www.bikeradar.com/features/routes-and-rides/beginners-guide-to-cycling-with-kids/\">child seats</a>.</p>\n<p>You can commute on any type of bike, but if your commute involves a bus or a train, or you have to haul your bike into the office, you might want to consider a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-folding-bikes/\" target=\"_blank\">folding bike</a>.</p>\n<p>As the name suggests, these fold up to a small size that makes taking them on public transport or storing them under a desk much easier.</p>\n<p>For more details on hybrid bikes and our top-rated picks, take a look at our <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hybrid-bikes/\" target=\"_blank\">best hybrid bikes list</a>.</p>\n<h3>What about ebikes?</h3>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-an-electric-bike/\">Ebikes or electric bikes</a> are bicycles that either have a motor built into the frame at the bottom of the bike or on the rear wheel’s hub.</p>\n<p>They provide what’s called ‘pedal assist’, which means they’ll add to the power you put in through the pedals, so you do have to pedal to make them work.</p>\n<p>You can find ebike versions of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-road-bikes/\">road</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-mountain-bikes/\">mountain</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-hybrid-bikes/\">hybrid</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-folding-bikes/\">folding bikes</a>, and they are absolutely brilliant for making commutes easier, providing help on climbs, getting you riding if you have an injury or simply levelling up the playing field between you and your cycling companions – they’re downright fun, too.</p>\n<h3>Cyclocross, gravel and adventure bikes</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Gravel is really popular right now and a lot of fun.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>These bikes are based around road-bike design, with lightweight frames and handlebars with drops, but have carefully tweaked geometry and greater tyre clearance to allow them to be ridden off-road as well as on.</p>\n<p>They usually have a more rugged frame design, fatter tyres with a tread for plenty of grip on grass, mud and gravel tracks, and attachment points for adding mudguards and luggage.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cyclocross-bikes/\" target=\"_blank\">Cyclocross</a> is a type of bicycle racing, so these bikes will have a more aggressive geometry that puts the rider in a racier position on the bike, while gravel and adventure bikes are designed for comfort over long distances on rough surfaces so will tend to have a more upright position.</p>\n<p>Gravel riding is exploding in popularity right now, as cyclists look to get off busy roads and bring a bit more fun to their riding. If we had to recommend just one bike to do a bit of everything, a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\" target=\"_blank\">gravel bike</a> would be it.</p>\n<p>Some of these bikes even come with types of suspension similar to mountain bikes to increase comfort and grip.</p>\n<h2>What size women’s bicycle do I need?</h2>\n<p>Most bikes are sized as Small, Medium, Large, etc (usually mountain bikes and some hybrid bikes), or numerically as centimetres or inches (e.g. 54cm, 17in, etc).</p>\n<p>Like clothes, sizing isn’t consistent across brands so don’t expect one brand’s Medium to feel exactly the same as another’s.</p>\n<p>Most brands have an online size guide that will recommend a size based on your height, or other measurements such as your inner leg length. This is where you should start.</p>\n<p>Try to demo the bike if you can, so you can see how it feels when you ride it. This is particularly important if you sit between sizes because it will help you work out which size to go for.</p>\n<p>For more information, we’ve created a simple <a href=\"http://www.bikeradar.com/us/women/gear/article/womens-bike-sizes-a-simple-guide-40015/\" target=\"_blank\">guide to women’s bike sizes</a> that may help.</p>\n<h2>How can I get my bike to fit better?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> There are some simple things you can do to make your bike fit better, whether it’s a women’s-specific or unisex model.</span></figcaption><span> <i>Elizabeth Elliott / Immediate Media Co</i></span></div>\n<p>Once you have a bike, it’s possible to adjust the fit to make it even better, which is important if you’re going to be riding it a lot because small niggles can turn into big niggles over a long bike ride.</p>\n<p>Also, if you want to make the bike you already have fit better, or adapt a unisex bike, there are some simple changes you can make.</p>\n<p>The <a href=\"http://www.bikeradar.com/road/gear/article/from-unisex-to-female-friendly-6-tweaks-for-better-bike-fit-44770/\" target=\"_blank\">six most common tweaks for a better bike fit</a> are:</p>\n<ol><li>Fitting a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-womens-road-bike-saddles/\">women’s-specific saddle</a></li>\n<li>Changing the seatpost</li>\n<li>Swapping in a shorter stem for the handlebar</li>\n<li>Checking the width of your handlebars</li>\n<li>Changing to <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/what-is-the-best-crank-length-for-cycling/\">shorter cranks</a></li>\n<li>Adjusting the reach of your brakes</li>\n</ol><p>Many of these adaptations are easy to do yourself, or if you buy a bike from your local bike shop it will be able to help.</p>\n<p>If you’re going to be riding a lot – and particularly if you’re going to buy a road bike – we’d recommend getting a bike fit. A bike fit is where an experienced bike-fitter takes measurements including leg length, flexibility and how far you reach forward when seated. They will also observe as you ride the bike on a static trainer.</p>\n<p>From this, they can adjust elements of the bike, such as saddle height, handlebar reach, etc, to give you the best fit possible.</p>\n<p>This may require swapping out certain parts for others, such as <a href=\"https://www.bikeradar.com/features/road-bike-handlebars-guide-how-to-choose-the-right-ones/\">handlebars with a deep drop</a> to a pair with a shallower drop, or a long stem to one that’s slightly shorter.</p>\n<p>We have loads of advice on bike fit on BikeRadar, though, such as <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/\">how to set your saddle height and position</a> and <a href=\"https://www.bikeradar.com/advice/workshop/how-to-adjust-your-handlebar-height/\">how to adjust your handlebar height</a>.</p>\n<p>If you’d like more information, here’s the lowdown on <a href=\"http://www.bikeradar.com/beginners/gear/article/how-to-get-your-road-bike-position-right-39738/\" target=\"_blank\">how to get your road bike position right</a> and how to achieve the <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/mountain-bike-sizing-what-size-bike-do-i-need/\" target=\"_blank\">perfect mountain bike fit</a>.</p>\n<h2>Is there a difference between women’s and men’s bikes?</h2>\n<p>Nearly all the big bike brands make what they call ‘unisex’ bikes; bikes that they say are designed for all riders.</p>\n<p>A lot of brands also make women’s bikes, sometimes called women’s-specific bikes. Often these are mostly the same as the unisex bikes but with different contact points, such as the saddle and handlebar, which will be chosen to suit women better.</p>\n<p>Other brands, such as Liv Cycling and Canyon Bicycles, make bikes specifically for women based only on the body geometry, sizes and needs of women from research data.</p>\n<p>The question is then do women have to ride a women’s-specific bike, and the answer is no, but a lot of women do find they fit them better. It’s always worth testing out a few bikes, both unisex and women’s-specific if you can, to see which feels best for you.</p>\n<p>Whatever <a href=\"https://www.bikeradar.com/advice/buyers-guides/5-approaches-to-womens-specific-bike-design/\">approach a brand has to designing women’s bikes</a>, there are usually a few things they have in common:</p>\n<ul><li><strong>Smaller sizes:</strong> Small, X-Small and XX-Small cater for smaller riders. Sometimes these are the small sizes of the men’s/unisex bike, other times they’re a dedicated women’s frame with a unique geometry.</li>\n<li><strong>Lowered top tube:</strong> This mostly applies to hybrid or commuter bikes, particularly Dutch or ‘sit up and beg’ bikes. They have a lower or sloping top tube which means it’s easier to stand straddling the frame, making it easier to get on and off.</li>\n<li><strong>Women’s saddle:</strong> Women’s bikes usually come with a saddle designed to be comfortable for female riders. However, because saddles are a personal thing, you may still want to try something different. Our <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-womens-bike-saddle-a-buyers-guide/\" target=\"_blank\">buyer’s guide to women’s saddles</a> is a great place to start your search for the perfect perch.</li>\n<li><strong>A shorter reach:</strong> This refers to the distance from the saddle to the handlebar. Bikes with a frame designed for female riders will sometimes have a shorter reach compared to equivalent men’s or unisex models. This sometimes means, combined with other frame elements, such as a higher front end, the result is a more upright position for the rider.</li>\n<li><strong>Shorter crank arms:</strong> For riders with shorter legs, shorter crank arms (the part linking the pedals to the spindle around which they move) reduce the stretch that the leg needs around the pedal stroke, which reduces strain and makes pedalling easier. Shorter cranks can also be pedalled faster.</li>\n<li><strong>Narrower handlebar, shallower drops on road handlebar:</strong> Narrower handlebars are designed to suit narrower shoulders, and the shallower drop on road handlebars means a shorter reach from the seat to the bar.</li>\n<li><strong>Lighter shock tune:</strong> Mountain bikes that feature suspension will have this set up to accommodate the on-average lighter weight of female riders.</li>\n</ul><h3>Do I need a women’s bike?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Our buyer’s guide can help you find out what kind of bike you need.</span></figcaption><span> <i>Phil Hall / Immediate Media</i></span></div>\n<p>Some women have a better fit on women’s-specific models, while others find no difference between <a href=\"https://www.bikeradar.com/features/do-i-need-a-womens-bike/\">women’s and unisex bikes</a>, or prefer unisex bikes completely.</p>\n<p>It’s worth testing out a few bikes, if you can, to compare how different brands or different sizes fit because there are always slight differences in the way brands size up their bikes.</p>\n<p>As previously mentioned, having a bike fit will ensure your bike is right for you, whatever type you go for.</p>\n<h2>Best women’s road bikes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Whether you want to spend £400 or £2,000, there’s a women’s road bike to suit your riding.</span></figcaption><span> <i>Various</i></span></div>\n<p>You can buy a road bike for as little as £200, but to get a decent-quality bike we recommend <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/btwin-triban-520-review/\" target=\"_blank\">starting from about £500</a> if you’re planning to use it for longer distances or events.</p>\n<p>At this price point, you see a massive jump in quality that will really make a difference to anyone doing serious riding.</p>\n<p>You can also get excellent bargains — often in the region of a 30 to 40 per cent discount — if you don’t mind buying last year’s model, so shop around and consider waiting for the end of season or Black Friday sales if you’re looking for a bargain.</p>\n<p>In general, as you go up in price you’ll get a lighter, more aerodynamic or more comfortable bike with better quality parts that work more smoothly and/or are more robust.</p>\n<p>If you’re willing and able to spend big, there’s nothing quite like a top-of-the-range bike, but don’t forget no matter how expensive your bike is, you’ll still be the one turning the pedals.</p>\n<ul><li><a href=\"https://www.bikeradar.com/features/best-womens-road-bikes-12-of-the-best/\" target=\"_blank\">Best women’s road bikes</a></li>\n</ul><h3>What to expect for your money:</h3>\n<ul><li><strong>Under £500 / $700 / AU$900:</strong> Alloy frame and fork, which may feature carbon blades, an 8-speed double crankset (giving you 16 gears), alloy bar and stem, rim brakes or mechanical disc brakes.</li>\n<li><strong>£500 to £700 / $700 to $900 / AU$900 to AU$1,500:</strong> Alloy frame with carbon or alloy forks, and up to 10-speed gears (often Shimano Sora or Tiagra) with a double or sometimes triple crankset. Rim or mechanical disc brakes.</li>\n<li><strong>£700 to £1,000 / $900 to $1,200 / AU$1,500 to AU$2,000:</strong> Alloy frame with carbon or alloy forks, Shimano Tiagra or <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-105-r7000-r7020-groupset-review/\" target=\"_blank\">105 groupset</a> with good-quality rim brakes or mechanical disc brakes.</li>\n<li><strong>£1,000 to £1,500 / $1,200 to $2,500 / AU$2,000 to AU$3,000:</strong> Alloy or carbon frame with carbon forks, Shimano Tiagra, 105, <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-ultegra-r8000-groupset-review/\" target=\"_blank\">Ultegra</a> or similar groupset. Hydraulic disc brake options and lighter components are likely to feature around this price point.</li>\n<li><strong>£1,500 to £3,000 / $2,500 to $4,000 / AU$3,000 to AU$5,000:</strong> Carbon frame and full carbon forks, lightweight and high-end Shimano Ultegra or similar 11-speed gearing, with electronic groupsets on some bikes, carbon bars and seatposts in some cases.</li>\n<li><strong>£3,000 / $4,000 / AU$5,000 upwards:</strong> This is getting towards the level of kit used by professional racers. Expect carbon frames and forks, carbon parts, hydraulic disc brakes or quality rim brakes, lightweight wheels, plus Shimano Ultegra or <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-r9100-review/\" target=\"_blank\">Dura-Ace</a> or <a href=\"https://www.bikeradar.com/reviews/components/groupsets/sram-force-etap-axs-vs-shimano-ultegra-di2/\" target=\"_blank\">electronic gear shifting</a>.</li>\n</ul><h2>Best women’s mountain bikes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Whether you want to tackle trail centres or head out for an all-mountain adventure, there’s a women’s mountain bike designed for you… but, of course, don’t discount unisex bikes.</span></figcaption><span> <i>Various</i></span></div>\n<p>As with road bikes, you can get a mountain bike from as little as £200, but if you’re planning on riding trail centres or off-road, rather than towpaths or bridleways, we recommend spending in the region of £500 upwards and ensuring you get a bike with disc brakes for more stopping power.</p>\n<p>While there are full-suspension bikes available for under £500, we suggest buying a hardtail at this price point because they’re simpler and more likely to include quality parts.</p>\n<ul><li><a href=\"http://www.bikeradar.com/gear/article/best-mountain-bike-the-ultimate-buyers-guide-46712/\">Best mountain bike: how to choose the right one for you</a></li>\n</ul><h3>What to expect for your money:</h3>\n<ul><li><strong>Under £300 / $500 / AU$600:</strong> Alloy frame and steel-forked rigid bike (no suspension) or hardtail. Around 18 gears with V-brakes or mechanical disc brakes.</li>\n<li><strong>£300 to £500 / $500 to $1,000 / AU$600 to AU$900:</strong> Alloy frame hardtail with around 100mm travel fork, 21 to 24 gears with a double crankset, and either hydraulic or mechanical disc brakes.</li>\n<li><strong>£500 to £1,000 / $1,000 to $2,000 / AU$900 to AU$2,000:</strong> Alloy frame hardtails and some full-suspension options, with better-quality suspension forks by brands such as RockShox and Suntour.</li>\n<li><strong>£1,000 to £2,000 / $2,000 to $3,500 / AU$2,000 to AU$3,500:</strong> Full-suspension trail bikes, alloy bar and stem, hydraulic disc brakes and high-quality cross-country hardtails (these are lighter and designed to go faster rather than take on the roughest ground), with a carbon or alloy frame, quality fork such as RockShox Yari, and 11-speed gearing.</li>\n<li><strong>£2,000 to £3,500 / $3,500 to $5,000 / AU$3,500 to AU$6,000:</strong> High-grade alloy or carbon frame with quality suspension components including Fox 34 or 36, or RockShox Pike forks and Fox Evolution rear suspension shock. 12-speed chainset, wheels designed to take <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless tyres</a> (which are less puncture prone and can be run at lower pressures for more grip) and more suspension travel options up to 150mm.</li>\n<li><strong>£3,500 / $5,000 / AU$6,000 upwards:</strong> High-quality carbon fibre frame with top of the range suspension from Fox or RockShox. Wide-ranging 12-speed gearing with a single-ring crankset, high-end tubeless-ready wheels.</li>\n</ul><h2>Best women’s hybrid and urban bikes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A selection of women’s hybrid bicycles.</span></figcaption><span> <i>Various</i></span></div>\n<p>The starting price for a hybrid bike is around £150, and although you can find cheaper, you may find yourself paying in other ways, due to the likely heavy weight and quality of parts.</p>\n<p>In general, as you go up in price bikes will get lighter, which is something to bear in mind if you need to carry it anywhere.</p>\n<p>While some hybrid bikes have pannier racks and/or mudguards fitted, you may want to factor in the additional cost of these if not.</p>\n<p>You’ll also find an array of Dutch-style upright bikes, cruiser bikes, and bikes with vintage-inspired styling, so if you want something that’s beautiful as well as functional you’ll find plenty of options, with many under £500.</p>\n<p>Prices don’t rise uniformly across these different kinds of bikes though – for different styles the value comes through in different ways, such as quality gears and leather finishing kit for some, and premium aluminium for others.</p>\n<h3>What to expect for your money:</h3>\n<ul><li><strong>£150 to £300 / $250 to $400 / AU$300 to AU$500:</strong> Steel or aluminium frames with steel forks, V-brakes and 21 gears with a triple crankset on the front. At this price point bikes are likely to be weighty but robust.</li>\n<li><strong>£300 to £400 / $400 to $600 / AU$500 to AU$700:</strong> There are a huge number of great-quality hybrid bikes available in this price range, with everything from mountain-inspired bikes with front suspension, bright-coloured cruisers and vintage-styled Dutch bikes to hybrids already equipped with mudguards and pannier racks. Expect aluminium or steel frames, and forks and gears ranging from seven to 27.</li>\n<li><strong>£400 to £600 / $600 to $800 / AU$700 to AU$1,000:</strong> You’ll start to see bikes with mechanical disc brakes or, at the higher end, hydraulic disc brakes, plus higher-quality suspension and gearing.</li>\n<li><strong>£600 to £1,000 / $800 to $1,200 / AU$1,000 to AU$1,500:</strong> This is getting towards the high-end of hybrid bikes. Expect higher-quality parts such as Brooks saddles, Sturmey Archer internal hub gears, premium aluminium frames and/or 10-speed Shimano Deore gears.</li>\n<li><strong>£1,000 / $1,200 / AU$1,500 upwards:</strong> Top-of-the-range machines where you’ll see overlap between road bikes and mountain bikes at the same price. Expect high-quality alloy frames, and alloy or carbon forks, as well carbon-framed premium hybrids with Shimano Tiagra or equivalent gearing at the top end.</li>\n</ul>","author":"Aoife Glass","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"55668731e4d1a570311618bb2b31c70f574291c148f2ac196a5813f09dcba3ce","category":"Cycling"}