{"title":"Long‐term climate and hydrologic regimes shape stream invertebrate community responses to a hurricane disturbance","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14086?af=R","date":1716181260000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/fa5fad25-50c3-4a7e-ba45-2aec8eae0b42/jane14086-toc-0001-m.png\" alt=\"Long-term climate and hydrologic regimes shape stream invertebrate community responses to a hurricane disturbance\" />\n<p>Aridity and local climate predictably affect the susceptibility of stream invertebrates to hurricane disturbances.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nDisturbances can produce a spectrum of short- and long-term ecological consequences that depend on complex interactions of the characteristics of the event, antecedent environmental conditions, and the intrinsic properties of resistance and resilience of the affected biological system.\n\nWe used Hurricane Harvey's impact on coastal rivers of Texas to examine the roles of storm-related changes in hydrology and long-term precipitation regime on the response of stream invertebrate communities to hurricane disturbance.\n\nWe detected declines in richness, diversity and total abundance following the storm, but responses were strongly tied to direct and indirect effects of long-term aridity and short-term changes in stream hydrology. The amount of rainfall a site received drove both flood duration and flood magnitude across sites, but lower annual rainfall amounts (i.e. aridity) increased flood magnitude and decreased flood duration. Across all sites, flood duration was positively related to the time it took for invertebrate communities to return to a long-term baseline and flood magnitude drove larger invertebrate community responses (i.e. changes in diversity and total abundance). However, invertebrate response per unit flood magnitude was lower in sub-humid sites, potentially because of differences in refuge availability or ecological-evolutionary interactions. Interestingly, sub-humid streams had temporary large peaks in invertebrate total abundance and diversity following recovery period that may be indicative of the larger organic matter pulses expected in these systems because of their comparatively well-developed riparian vegetation.\n\nOur findings show that hydrology and long-term precipitation regime predictably affected invertebrate community responses and, thus, our work underscores the important influence of local climate to ecosystem sensitivity to disturbances.\n</p>","author":"Bradley A. Strickland, \nChristopher J. Patrick, \nFernando R. Carvallo, \nSean K. Kinard, \nAlexander T. Solis, \nBrandi Kiel Reese, \nJ. Derek Hogan","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"556770b73cca475c3d0e063df33bf41af737efa6200936124204d2e5c3966373","category":"Environment"}