{"title":"Welcome Back, Hipstamatic","link":"https://hipstamatic.app/hello","date":1679525925000,"content":"\n<p>Remember Hipstamatic, the original retro filter camera app for iPhone? At its peak in 2012, photographer <a href=\"https://benlowy.tumblr.com\">Ben Lowy</a> shot <a href=\"https://blog.hipstamatic.com/post/34814095006/reportagebygettyimages-the-latest-cover-of\">the cover image for Time magazine</a> using it. Hipstamatic never really disappeared, but it seemingly lost relevance.</p>\n\n<p>Well, they’re back — recognizable, for sure, but different. New: a photo-sharing social network, ad-free, algorithm-free, and monetized only by a paid membership tier. Hipstamatic co-founder <a href=\"https://hipsta.app/@Lucas\">Lucas Buick</a>, <a href=\"https://www.producthunt.com/posts/hipstamatic-3\">on Product Hunt</a>:</p>\n\n<blockquote>\n  <p>But why bring back Hipstamatic now, after it faded from popularity\nover a decade ago? The answer lies in the growing dissatisfaction\nwith the current state of social media. The recent controversies\nsurrounding Facebook and Meta, as well as concerns over data\nprivacy and the addictive nature of technology, have sparked a\ndesire for something different.</p>\n\n<p>Hipstamatic represents a return to the roots of mobile\nphotography, a time before algorithms and AI ruled the day. It’s a\nreminder that technology can be used for fun and creativity, not\njust profit and engagement. The app’s member-supported community\nis proof that there are people out there who still value genuine\nconnections and the simple pleasure of taking and sharing photos.</p>\n</blockquote>\n\n<p><a href=\"https://hipsta.app/@gruber\">I dig it</a>. Worth installing on your iPhone just to get that icon on your Home screen.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/22/welcome-back-hipstamatic\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"556709d7ea0fc1d90f31d71abfd305971c9f79634d46b2c65fa87900b074b043","category":"Tech"}