{"title":"Compressive strength prediction and low-carbon optimization of fly ash geopolymer concrete based on big data and ensemble learning","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310422","date":1726149600000,"content":"<p>by Peiling Jiang, Diansheng Zhao, Cheng Jin, Shan Ye, Chenchen Luan, Rana Faisal Tufail</p>\r\n\r\nPortland cement concrete (PCC) is a major contributor to human-made CO<sub>2</sub> emissions. To address this environmental impact, fly ash geopolymer concrete (FAGC) has emerged as a promising low-carbon alternative. This study establishes a robust compressive strength prediction model for FAGC and develops an optimal mixture design method to achieve target compressive strength with minimal CO<sub>2</sub> emissions. To develop robust prediction models, comprehensive factors, including fly ash characteristics, mixture proportions, curing parameters, and specimen types, are considered, a large dataset comprising 1136 observations is created, and polynomial regression, genetic programming, and ensemble learning are employed. The ensemble learning model shows superior accuracy and generalization ability with an RMSE value of 1.81 MPa and an R<sup>2</sup> value of 0.93 in the experimental validation set. Then, the study integrates the developed strength model with a life cycle assessment-based CO<sub>2</sub> emissions model, formulating an optimal FAGC mixture design program. A case study validates the effectiveness of this program, demonstrating a 16.7% reduction in CO<sub>2</sub> emissions for FAGC with a compressive strength of 50 MPa compared to traditional trial-and-error design. Moreover, compared to PCC, the developed FAGC achieves a substantial 60.3% reduction in CO<sub>2</sub> emissions. This work provides engineers with tools for compressive strength prediction and low carbon optimization of FAGC, enabling rapid and highly accurate design of concrete with lower CO<sub>2</sub> emissions and greater sustainability.","author":"Peiling Jiang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"556c5eeec5a2da2038b1b1bc34906d108f55bc246b10ca7df57690ef033816b0","category":"Interdisciplinary"}