{"title":"Enhancing the effects of curcumin on oxidative stress injury in brain vascular endothelial cells using lactoferrin peptide nano‐micelles: antioxidant activity and mechanism","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13836?af=R","date":1725003618000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Curcumin is widely known for its antioxidant and anti-inflammatory properties, but its mechanism of action in mitigating oxidative stress injury in brain vascular endothelial cells remains unclear. Due to the poor bioavailability of curcumin, it is challenging to achieve effective concentrations at the target sites. Nano-micelles are known for their ability to improve the solubility, stability, and bioavailability of hydrophobic compounds like curcumin. This study investigated the effects and mechanisms of free curcumin and curcumin embedded in nano-micelles (M(Cur)) on oxidative stress-induced injury in bEnd.3 cells.</p>\n<h2>RESULTS</h2>\n<p>At a protective concentration of 10 μg mL<sup>−1</sup>, micellar curcumin was better able to recover the morphology of bEnd.3 cells under oxidative stress while increasing cell viability, restoring mitochondrial membrane electrical potential, and effectively inhibiting reactive oxygen species generation with a positive cell rate of 2.21%. These results indicate that curcumin significantly improves H<sub>2</sub>O<sub>2</sub>-induced oxidative stress damage in endothelial cells by maintaining the cellular antioxidant balance.</p>\n<h2>CONCLUSION</h2>\n<p>This study adds to knowledge regarding the role of nano-micelles in curcumin intervention for endothelial cell oxidative damage and provides insights for the development of curcumin-based dietary supplements. © 2024 Society of Chemical Industry.</p>","author":"Guipan Chen, \nYiyang Wang, \nXuebo Liu, \nFuguo Liu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"5575664a5e120015ce292863226d20a12cfddd4eafbf4cfa22fbda4537c38d23","category":"Environment"}