{"title":"KBTG ชวนชาวเทคฯ ร่วมงาน KBTG Techtopia พาตะลุยจักรวาล AI เจอกัน 1-2 กันยายน 66 เมืองทองธานี","link":"https://www.blognone.com/node/135128","date":1691132841000,"content":"<div><div><div><p><strong>KBTG</strong> ประกาศจัดงาน <strong>KBTG Techtopia</strong> ในธีม “Across the AI-Verse” วันที่ 1-2 กันยายนนี้ ที่อาคาร KBTG เมืองทองธานี จัดเต็มสาระแง่มุมต่างๆ ของปัญญาประดิษฐ์ (AI) เพื่อเตรียมความพร้อมให้ชาวเทคฯ รับความรู้และประสบการณ์จากกูรูระดับแนวหน้า ตอกย้ำความมุ่งมั่นของ KBTG ในการเป็นผู้นำด้าน AI ของไทย รวมถึงสอดรับนโยบาย ESG ขององค์กรด้วยการมอบรายได้ทั้งหมดให้กับสถาบันสิ่งแวดล้อม คาดจะมีชาวเทคฯ ให้ความสนใจเข้าร่วมงานคับคั่ง เปิดจำหน่ายบัตรแล้วตั้งแต่วันนี้เป็นต้นไป</p>\n<p><img alt=\"alt=&quot;kbtg&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/34882b1be346cbe784ae26e0cf622077.jpg\" /></p>\n<p><strong>เรืองโรจน์ พูนผล</strong> ประธานกลุ่มบริษัทกสิกรบิซิเนส-เทคโนโลยี กรุ๊ป (KBTG) ชวนร่วมงาน KBTG Techtopia จัดขึ้นระหว่างวันที่ 1-2 กันยายนนี้ ณ อาคาร KBTG เมืองทองธานี ถนนแจ้งวัฒนะ เพื่อเป็นเวทีแลกเปลี่ยนความรู้ของคนในวงการไอที ผู้เข้าร่วมงานจะได้ไปผจญภัยในเมืองเทคโนโลยี พร้อมสำรวจเทรนด์ที่มาแรงที่สุดของปี โดยในปีนี้จัดขึ้นในธีม “Across the AI-Verse” รวบรวมสาระน่ารู้เกี่ยวกับวิวัฒนาการของปัญญาประดิษฐ์ (AI) และความเปลี่ยนแปลงที่เกิดขึ้นในมิติต่างๆ เพื่อเตรียมความพร้อมให้คนไทยสายเทคฯ สามารถคว้าโอกาสสู่การเติบโตและเอาชนะความท้าทายใหม่ๆ ผ่านการเรียนรู้และกิจกรรมต่าง ๆ โดยมีผู้บริหารและผู้เชี่ยวชาญด้าน AI จากสถาบันและองค์กรชั้นนำทั้งในประเทศไทยและต่างประเทศ มาร่วมแบ่งปันความรู้และประสบการณ์ให้กับผู้ร่วมงาน อาทิ</p>\n<ul>\n<li>ธนา โพธิกำจร CEO, KASIKORN LINE (LINE BK)</li>\n<li>อาภาพร สกุลกิตติยุต Lead Data Scientist, Microsoft Thailand</li>\n<li>Axel Winter, Chief Digital Officer, Siam Piwat Group</li>\n<li>Louis Hur, CEO, StealthMole</li>\n<li>Rafi Katanasho, APAC Chief Technical Officer and VP of Solution Sales, Dynatrace</li>\n<li>Jenny Chong, Non-Executive Director on the Board of Medway NHS Hospital, UK</li>\n<li>Ben Mumby-Croft, Director of Entrepreneurship, Imperial College London</li>\n<li>Nadhem AlFardan, Principal Security Architect, Cisco</li>\n</ul>\n<p><img alt=\"alt=&quot;kbtg&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/805d7583a0578c45742e471ed496e969.jpg\" /></p>\n<p>นอกจากนี้ภายในงานยังมีกิจกรรมอื่นๆอีกมากมายให้ได้เก็บเกี่ยวความรู้และความสนุกไปด้วยกันทั้งยังเป็นโอกาสให้สร้างความคุ้นเคยกับคนในชุมชน AI อีกด้วย ได้แก่</p>\n<p><strong>Conference Stage</strong> เวทีสัมมนาที่รวบรวมผู้บริหารและผู้เชี่ยวชาญด้าน AI จาก KBTG ไปจนถึงสถาบันและองค์กรชั้นนำในหลากหลายแวดวงทั่วโลกมากกว่า 20 คนที่ K Stadium โดยแบ่งการสัมมนาออกเป็น 4 แกน คือ</p>\n<ul>\n<li>AI Trend and Outlook สัมผัสอิทธิพลของ AI ผ่านเทรนด์และนวัตกรรมเกิดใหม่</li>\n<li>AI Transformation สเต็ปอัพการทำ Transformation องค์กรในหลากมิติด้วย AI</li>\n<li>AI x Human สำรวจสารพัดปัจจัยที่จะเอื้อต่อการอยู่ร่วมกันระหว่างมนุษย์และ AI</li>\n<li>AI Ecosystem ส่องธุรกิจแห่งโลกอนาคตที่ขับเคลื่อนด้วย AI เปิดประตูสู่โอกาสใหม่ๆ</li>\n</ul>\n<p><strong>Showcase Exhibition</strong> กระทบไหล่กับบริษัทเทคชั้นนำของไทยที่จะมาจัดบูธโชว์ผลงาน อย่าง Slack, Dynatrace และ GitHub แถมเปิดโอกาสให้ทุกคนได้มาสัมผัสกับโปรเจคที่ทำโดย KBTG Labs และบริษัทในเครืออย่าง KX และ Kubix</p>\n<p><strong>Playground Workshop</strong> เวิร์คช็อปเสริมสร้างสกิลด้าน AI ในมิติต่างๆ ออกแบบและจัดทำโดยผู้เชี่ยวชาญจากองค์กรชื่อดังอย่าง Google Cloud, Microsoft, Splunk และทีม Beacon Interface จาก KBTG</p>\n<p><strong>KBTG FinFest</strong> ปาร์ตี้ Networking เปิดให้ผู้ร่วมงานได้มาร่วมสนุกช่วงท้ายแต่ละวัน พูดคุยและเพลิดเพลินไปกับอาหารเครื่องดื่ม และเพลงมันส์ๆ โดย DJ Tob จาก Bangkok Invaders/ Southside</p>\n<p>ผู้ที่สนใจสามารถดูรายละเอียดเพิ่มเติมและซื้อบัตรร่วมงานได้ที่ <a href=\"https://www.zipeventapp.com/e/TECHTOPIA-ACROSS-THE-AI-VERSE\">https://www.zipeventapp.com/e/TECHTOPIA-ACROSS-THE-AI-VERSE</a> เปิดจำหน่ายบัตรแล้วตั้งแต่วันนี้เป็นต้นไป บัตรสำหรับบุคคลทั่วไปราคา 1,500 บาท และนักเรียน/นักศึกษาราคา 500 บาท โดย KBTG ได้ตอบรับกับนโยบายของธนาคารกสิกรไทยในการขับเคลื่อนธุรกิจบนหลักการ ESG เพื่อสร้างการเติบโตที่ยั่งยืน ด้วยการนำรายได้จากการขายบัตรทั้งหมดส่งมอบให้กับมูลนิธิสถาบันสิ่งแวดล้อมไทย (Thailand Environment Institute: TEI) เพื่อสนับสนุนการทำงานของ TEI ในการวิจัยและขับเคลื่อนนโยบายควบคู่กับการส่งเสริมกิจกรรมในระดับพื้นที่ ทั้งด้านการเปลี่ยนแปลงสภาพภูมิอากาศ ความหลากหลายทางชีวภาพ การจัดการขยะและลดมลพิษ การจัดการสิ่งแวดล้อมชุมชนและเมืองให้การรับรองฉลากเขียว และยังมีส่วนร่วมในองค์กรธุรกิจเพื่อการพัฒนาที่ยั่งยืน (TBCSD) รวมถึงทำงานกับหลายภาคส่วน</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/kbtg\">KBTG</a></div></div></div>","author":"blognone","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"557a2dc58297039ff7759e47351ec13379f91bbe55e03d77387ebf626f8facbe","category":"Thai"}