{"title":"Gurman: Tang Tan, Apple’s Departing VP of iPhone and Watch Design, to Join LoveFrom to Work on ‘AI Hardware’ With OpenAI","link":"https://www.bloomberg.com/news/articles/2023-12-26/apple-iphone-design-head-tang-tan-to-work-with-jony-ive-sam-altman-on-ai-tech","date":1703638211000,"content":"\n<p>Mark Gurman, reporting for Bloomberg:</p>\n\n<blockquote>\n  <p>Legendary designer Jony Ive and OpenAI’s Sam Altman are enlisting \nan Apple Inc. veteran to work on a new artificial intelligence \nhardware project, aiming to create devices with the latest \ncapabilities. </p>\n\n<p>As part of the effort, outgoing Apple executive Tang Tan will join \nIve’s design firm LoveFrom, which will shape the look and \ncapabilities of the new products, according to people familiar \nwith the matter. Altman, an executive who has become the face of \nmodern AI, plans to provide the software underpinnings, said the \npeople, who asked not to be identified because the endeavor isn’t \npublic. [...] </p>\n\n<p>Tan will lead hardware engineering at the project while working at \nLoveFrom, the people said. Bloomberg News <a href=\"https://www.bloomberg.com/news/articles/2023-12-08/apple-s-iphone-and-watch-product-design-chief-to-leave-in-shake-up\">previously \nreported</a> that the executive was stepping down as Apple’s \nvice president of iPhone and watch product design. He isn’t slated \nto depart until February, though his responsibilities were already \ndivided up this month. </p>\n</blockquote>\n\n<p>“Aiming to create devices with the latest capabilities” is an empty description, but the overall dynamic is interesting nonetheless. Also: I’m genuinely curious who leaked this. Ive’s team at Apple seemingly never leaked anything.</p>\n\n<blockquote>\n  <p>In all, more than 20 former Apple employees have joined the design \nfirm. [...] Shota Aoyagi, another member of Ive’s storied \nindustrial design team at Apple, has also exited. He just started \nat LoveFrom. </p>\n</blockquote>\n\n<p>More designers from Ive’s team at Apple now work at LoveFrom than remain at Apple.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/12/26/tang-tan-lovefrom\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"557a80f063b06f38623e2945cb634d1d338add86d8722c21802589644c434c0e","category":"Tech"}