{"title":"Well-Being and Perfectionism: Assessing the Mediational Role of Self-Compassion in Emerging Adults","link":"https://www.preprints.org/manuscript/202404.1041/v1","date":1713257905000,"content":"The study explores how different dimensions of perfectionism influence psychological well-being (PWB) in emerging adults. Literature has deepened the relationships between maladaptive perfectionism (e.g., excessive self-criticism, perceived discrepancy from the standards) and low PWB. Less is known about whether and how adaptive perfectionism (e.g., pursuing personal standards) relates to PWB. Secondly, the study has investigated whether self-compassion (i.e., self-benevolence, seeing personal imperfections as a common condition) may mediate the relationships between adaptive/maladaptive perfectionism and PWB. Participants (N=217, 18-35 y. o.) completed self-report questionnaires measuring: adaptive/maladaptive perfectionism (Almost Perfect Scale-Revised, APS-R: high standards and order/discrepancy, respectively), PWB, and self-compassion (SCS). Adaptive perfectionism resulted associated with PWB, particularly higher presence of purpose in life, environmental mastery, self-acceptance, and personal growth. Conversely, discrepancy resulted the most robust predictor of low PWB (β=-.68), followed by high standards with a positive direction (β=.23; Rc²=.514, p&amp;lt;.001). A strong negative association emerged between discrepancy and SCS (r=-.67, p&amp;lt;.001). A mediation analysis shows that self-compassion has an indirect effect reducing the strength of the relationship between discrepancy and low PWB. Results suggest focusing on self-compassion as a buffer factor that reduces the negative impact of maladaptive perfectionism on psychological well-being. Implications for education and health psychology are discussed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"557c8d517899d5e668962bd0be654ab399c1b27546841718bf71ab88d29f1b11","category":"Interdisciplinary"}