{"title":"MacRumors Giveaway: Win a Pair of Dusk Electrochromic Smart Sunglasses From Ampere","link":"https://www.macrumors.com/2021/06/18/macrumors-giveaway-smart-sunglasses-ampere/","date":1624039384000,"content":"For this week's <a href=\"https://www.macrumors.com/guide/giveaway/\">giveaway</a>, we've <a href=\"https://ampere.shop\">teamed up with Ampere</a> to offer <em>MacRumors</em> readers a chance to win a <a href=\"https://www.indiegogo.com/projects/dusk-app-enabled-electrochromic-smart-sunglasses#/\">pair of Dusk sunglasses</a>. The Dusk sunglasses aren't your standard pair of sunglasses -- they have adjustable electrochromic lenses.\r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\nYou can use an accompanying app or a control on the sunglasses themselves to adjust the tint level, plus these are smart sunglasses with integrated speaker and microphone so you can also listen to music and take phone calls. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/dusk-light-and-dark.jpg\" />\r\n<br />\r\nLike many sunglasses that play music, the Dusk sunglasses use an open ear audio feature that lets you listen to music without disturbing those around you. The built-in battery gives you four hours of playtime before needing to be recharged, but it lasts for seven days when you're just using tint control. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/dusk-side-view.jpg\" />\r\n<br />\r\nListening to music with an open ear design keeps you aware of what's going on around you, so these sunglasses are ideal for commuters who walk or ride bikes and need to keep tabs on traffic. Ampere has also added in <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> integration, so you can access ‌Siri‌ with the tap of a button.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/dusk-dark-tint.jpg\" />\r\n<br />\r\nWith a classic wayfarer design and a matte black finish, the Dusk sunglasses have universal appeal, and the polarized lenses are able to transition from light to dark to suit your preferences. These are not transitional lenses that react to light -- you have full control over the tint level. There are pre-set tint levels loaded on the frame that can be accessed with a button, and you can create your own preferred tints using the Ampere app. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/dusk-tint-levels.jpg\" />\r\n<br />\r\nWhen you change the tint of the Dusk sunglasses, it takes just a fraction of a second to update, and the polarized lenses block 100 percent of UVA/UVB rays in addition to reducing glare and increasing sharpness, regardless of tint level. Weighing in at 26 grams, the Dusk sunglasses are comfortable for all-day wear.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/dusk-adjustment.jpg\" />\r\n<br />\r\nThe Dusk sunglasses come with a matching carrying case that has a little slot for an Apple AirTag, so as long as you're diligent about returning them to the case after using them, they'll be trackable should they go missing. You can also use the Ampere app to play a sound should the sunglasses go missing in the house. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/dusk-internals.jpg\" />\r\n<br />\r\nSince the Dusk sunglasses offer IP65 dust and water resistance, you can wear them at the pool, on the beach, and in other situations where they might be exposed to moisture. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/dusk-charging-case.jpg\" />\r\n<br />\r\nThere's an optional charging case that can be purchased, which provides up to 40 hours of listening time, and for those who already have earbuds, there's also a more affordable Dusk Lite. The standard Dusk sunglasses offer tint adjustment, speakers, and a microphone for music and calls, while the Lite version just has the tint feature.\r\n<br />\r\n\r\n<br />\r\nAmpere is offering two Dusk prize packs to <em>MacRumors</em> readers, which include a set of Dusk Smart Sunglasses, a Wireless Charging Carry Case with AirTag Holder, a microfiber cleaning cloth, and a Sidekick Tech Sling with AirTag Holder for storage. To enter to win, use the Gleam.io widget below and enter an email address. Email addresses will be used solely for contact purposes to reach the winners and send the prizes. You can earn additional entries by subscribing to our <a href=\"https://my.leadpages.net/leadbox/145ef7173f72a2%3A104a9fa76b46dc/5754903989321728/\">weekly newsletter</a>, subscribing to our <a href=\"https://www.youtube.com/user/macrumors\">YouTube channel</a>, following us on <a href=\"https://twitter.com/macrumors\">Twitter</a>, following us on <a href=\"https://www.instagram.com/macrumors/\">Instagram</a>, or visiting the <em>MacRumors</em> <a href=\"https://www.facebook.com/MacRumors\">Facebook page</a>.\r\n<br />\r\n\r\n<br />\r\nDue to the complexities of international laws regarding giveaways, only <strong>U.S. residents who are 18 years or older and Canadian residents (excluding Quebec) who have reached the age of majority in their province or territory are eligible to enter</strong>. To offer feedback or get more information on the ‌giveaway‌ restrictions, please refer to <a href=\"http://forums.macrumors.com/threads/macrumors-giveaways-why-are-they-only-open-to-u-s-residents.1918337/\">our Site Feedback section</a>, as that is where discussion of the rules will be redirected.\r\n<br />\r\n\r\n<br />\r\n<div><a href=\"https://gleam.io/INYgK/ampere-giveaway\">Ampere Giveaway</a>\r\n<br />\r\n</div>The contest will run from today (June 18) at 11:00 a.m. Pacific Time through 11:00 a.m. Pacific Time on June 25. The winners will be chosen randomly on June 25 and will be contacted by email. The winners will have 48 hours to respond and provide a shipping address before new winners are chosen.\r\n<br />\r\n\r\n<br />\r\nThe Dusk sunglasses are available for pre-order right now for $250 and <a href=\"https://www.indiegogo.com/projects/dusk-app-enabled-electrochromic-smart-sunglasses\">will be shipping out in August</a>, but Ampere has <a href=\"https://www.indiegogo.com/projects/dusk-app-enabled-electrochromic-smart-sunglasses?secret_perk_token=52a8d779#/\">a special deal for <em>MacRumors</em> readers</a> who want to pick up a pair. <em>MacRumors</em> readers <a href=\"https://www.indiegogo.com/projects/dusk-app-enabled-electrochromic-smart-sunglasses?secret_perk_token=52a8d779#/\">who preorder</a> can get the Dusk sunglasses for $225, with a free Tech Sling included.<div>Tag: <a href=\"https://www.macrumors.com/guide/giveaway/\">giveaway</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/18/macrumors-giveaway-smart-sunglasses-ampere/\">MacRumors Giveaway: Win a Pair of Dusk Electrochromic Smart Sunglasses From Ampere</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/macrumors-giveaway-win-a-pair-of-dusk-electrochromic-smart-sunglasses-from-ampere.2301439/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wJH24s0gSfU:J_ILMI95pQ4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wJH24s0gSfU:J_ILMI95pQ4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/wJH24s0gSfU\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5582c5f0b217ac8de6de61f26138629cefb431bdb5cc8bf22c4d318e28adcf8c","category":"Apple"}