{"title":"Study: The best free-throw shooters share these biomechanical traits","link":"https://arstechnica.com/?p=1993101","date":1704145191000,"content":"<div>\n\n\n\n      <p><em>There's rarely time to write about every cool science-y story that comes our way. So this year, we're once again running a special Twelve Days of Christmas series of posts, highlighting one science story that fell through the cracks in 2020, each day from December 25 through January 5. Today: Using markerless motion capture technology to determine what makes the best free throw shooters in basketball.</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Markerless motion capture technology shows the biomechanics of free-throw shooters. Credit: Jayhawk Athletic Peformance Laboratory. </p></div>\n<p>Basketball season is in full swing, and in a close game, the team that makes the highest percentage of free throws can often eke out the win. A better understanding of the precise biomechanics of the best free-throw shooters could translate into critical player performance improvement. Researchers at the University of Kansas in Lawrence used markerless motion capture technology to do just that, reporting their findings in an <a href=\"https://www.frontiersin.org/articles/10.3389/fspor.2023.1208915/full\">August paper</a> published in the journal Frontiers in Sports and Active Living.</p>\n<p>“We’re very interested in analyzing basketball shooting mechanics and what performance parameters differentiate proficient from nonproficient shooters,” <a href=\"https://news.ku.edu/2023/08/29/study-uses-motion-capture-determine-what-makes-best-free-throw-shooters#:~:text=According%20to%20the%20study%2C%20proficient,when%20compared%20with%20nonproficient%20shooters.\">said co-author Dimitrije Cabarkapa</a>, director of the Jayhawk Athletic Performance Laboratory at the University of Kansas. “High-speed video analysis is one way that we can do that, but innovative technological tools such as markerless motion capture systems can allow us to dig even deeper into that. In my opinion, the future of sports science is founded on using noninvasive and time-efficient testing methodologies.”</p></div><p><a href=\"https://arstechnica.com/?p=1993101#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1993101&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5585e9776d3cd5a13498b81fd7220d7c036fa84599892abb29bc5559efd54cac","category":"Tech"}