{"title":"Guilty: Jury Convicts Kaitlin Armstrong of Murdering Pro Cyclist Mo Wilson","link":"https://bikerumor.com/guilty-jury-convicts-kaitlin-armstrong-of-murdering-pro-cyclist-mo-wilson/","date":1700230538000,"content":"<p><img width=\"2000\" height=\"1320\" src=\"https://bikerumor.com/wp-content/uploads/2023/11/armstrong-wilson.jpg\" alt=\"Moriah Wilson next to Kaitlin Armstrong\" srcset=\"https://bikerumor.com/wp-content/uploads/2023/11/armstrong-wilson.jpg 2000w, https://bikerumor.com/wp-content/uploads/2023/11/armstrong-wilson-297x196.jpg 297w, https://bikerumor.com/wp-content/uploads/2023/11/armstrong-wilson-800x528.jpg 800w, https://bikerumor.com/wp-content/uploads/2023/11/armstrong-wilson-120x79.jpg 120w, https://bikerumor.com/wp-content/uploads/2023/11/armstrong-wilson-768x507.jpg 768w, https://bikerumor.com/wp-content/uploads/2023/11/armstrong-wilson-1536x1014.jpg 1536w\" /></p>\n<p><strong>After a two-week trial in Austin, Texas, jurors deliberated for two hours before handing down a guilty verdict against Kaitlin Armstrong for the murder of cyclist Moriah “Mo” Wilson,</strong> <a href=\"https://www.kxan.com/news/local/austin/jury-set-to-begin-deliberations-thursday-in-kaitlin-armstrong-murder-trial/\" target=\"_blank\">local news</a> reported. </p>\n\n\n\n<p>Wilson, an emerging talent in gravel riding, was found dead in an Austin apartment in May 2022 from three gunshot wounds. Prosecutors argued that Armstrong had killed Wilson in an alleged love triangle including pro cyclist Colin Strickland, who also testified during the trial. </p>\n\n\n\n<p>Defense attorneys, however, said that Armstrong was simply caught up in a “nightmare” of circumstantial evidence. </p>\n\n\n\n<p>In the aftermath of the shooting, Armstrong traveled to Costa Rica, where she was apprehended by authorities five weeks later. She also tried to flee custody shortly before the trial. </p>\n\n\n\n<p>On Thursday, a jury found Armstrong guilty of second-degree murder. Armstrong faces up to 99 years in prison, and her sentence will likely be issued on Friday. </p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<h2>Trial Update: Detective Says Armstrong Had Photos of Wilson on iPhone Before Murder</h2>\n\n\n\n<p><strong>Wednesday, November 15 — </strong>The trial of Kaitlin Armstrong for the murder of Moriah “Mo” Wilson continued this week with additional evidence from prosecutors, who allege that Armstrong had planned to kill the promising young cyclist. </p>\n\n\n\n<p>On Monday, the trial’s seventh day, Detective Daniel Portnoy of the Austin Police Department’s digital forensic unit took the stand to testify. After analyzing Armstrong’s iPhone 13, Portnoy found several images of Wilson in the phone’s cache, <a href=\"https://www.independent.co.uk/news/world/americas/kaitlin-armstrong-trial-updates-moriah-wilson-b2446898.html\" target=\"_blank\">The Independent </a>reported. </p>\n\n\n\n<p>In his testimony, Detective Portnoy clarified that information stored in the cache is not necessarily intentionally saved by the phone user, often being saved automatically. Prosecutors claim Armstrong had been tracking Wilson before the cyclist was found dead from three gunshot wounds in an Austin apartment in May 2022. </p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>According to the <a href=\"https://www.statesman.com/story/news/local/2023/11/13/anna-moriah-wilson-kaitlin-armstrong-murder-trial-austin-texas-shooting-case-phone-turned-off/71563438007/\" target=\"_blank\">Austin American-Statesman</a>, Portnoy also said that Armstrong’s phone was turned off just hours before Wilson was killed the night of May 11. </p>\n\n\n\n<p>The family of Wilson left the courtroom on Tuesday during testimony from the medical examiner about Wilson’s fatal gunshot wounds. Dr. Bernadette Derussy, the deputy medical examiner for Travis County, noted three wounds: one to the right side of Wilson’s face, another to the right temporal scalp, and a third to the left side of the chest. </p>\n\n\n\n<p>Firearm forensic scientist Steven Aston also testified this week. Aston had processed the projectiles found by the Austin Police Department on the night Wilson died. During his testimony, Aston said the projectiles found at the scene where Wilson was killed came from the Sig Sauer 9mm owned by Armstrong, <a href=\"https://www.newsnationnow.com/crime/kaitlin-armstrong-trial-day-eight/\" target=\"_blank\">News Nation</a> reported. </p>\n\n\n\n<h2>Mo Wilson Murder Trial Testimony: ‘I Would Kill Her’</h2>\n\n\n\n<p><strong>Thursday, November 9 — </strong>Kaitlin Armstrong allegedly said she would kill Mo Wilson for dating ex-boyfriend and professional cyclist Colin Strickland, according to testimony this week. </p>\n\n\n\n<p>Two witnesses called by prosecutors related stories about Armstrong’s anger toward Wilson before the cyclist was found murdered in an East Austin apartment in May 2022, according to local news reports. Nicole Mertz, a friend of the defendant, said she met Armstrong in a restaurant in November 2021 when Wilson walked in, causing Armstrong to become “visibly angry,” the <a href=\"https://www.statesman.com/story/news/local/2023/11/08/kaitlin-armstrong-trial-anna-mo-wilson-murder-shooting-austin-texas-case-fingerprints-pineapple/71495350007/\" target=\"_blank\">Austin American-Statesman</a> reported. </p>\n\n\n\n<p>Mertz then asked Armstrong what she would do if Strickland started dating someone else. “I would kill her,” Armstrong said, according to Mertz’ testimony. </p>\n\n\n\n<p>Jacqueline Chasteen, a friend of Strickland’s, also testified that Armstrong expressed “in so many words” that she wanted to kill Wilson, <a href=\"https://news4sanantonio.com/news/local/i-would-kill-her-shocking-testimony-and-kaitlin-armstrong-search-history-shown-on-day-5-of-trial\" target=\"_blank\">News4 San Antonio</a> reported. </p>\n\n\n\n<p>The trial over Mo Wilson’s murder started Monday, October 30, and was initially expected to last two weeks. However, the trial may last longer, as prosecutors have a witness list nearly 10 pages long, according to <a href=\"https://www.kxan.com/news/local/austin/witness-list-nearly-10-pages-long-for-kaitlin-armstrong-trial/\" target=\"_blank\">KXAN</a>. In addition to the above testimony, prosecutors have also presented other evidence against Armstrong. </p>\n\n\n\n<p>On Wednesday, the case’s lead investigator said that police had found DNA from Armstrong on Wilson’s bike, which was found near the murder scene, KXAN reported. Investigators also revealed this week that Armstrong had sold her Jeep to CarMax for $12,200 on May 13 — two days after Wilson was found murdered from three gunshot wounds, according to the Austin American-Statesman. </p>\n\n\n\n<p>Stay tuned for more updates as the trial progresses. </p>\n\n\n\n<h2>Mo Wilson Murder Trial: Prosecutors Say Kaitlin Armstrong Used Strava to Track Victim</h2>\n\n\n\n<p><strong>Monday, November 6 — </strong>For millions of cyclists, hikers, and runners, the Strava app allows them to easily track and share their routes with friends and family. </p>\n\n\n\n<p>But for Kaitlin Armstrong, it was a way to find and kill Moriah “Mo” Wilson, prosecutors alleged last week during Armstrong’s ongoing murder trial in Austin, Texas. According to opening statements, Armstrong may have discovered Wilson’s location by checking Strava, where Wilson had posted data about a bike ride on the day of her murder. </p>\n\n\n\n<p>Wilson was shot and killed on May 11, 2022, while staying at the house of a friend in East Austin. Prosecutor Rickey Jones used audio from security cameras in the apartment complex to paint a disturbing picture of what may have happened on the night Wilson was murdered. </p>\n\n\n\n<p>The cameras recorded audible screams from Wilson, followed by two gunshots, Jones said. “Those screams are followed by ‘Pop! Pop!'” he said. “You won’t hear any more screams after that.” </p>\n\n\n\n<p>Then there’s 45 seconds of silence, followed by the sound of a third gunshot, he said. “After that 45 seconds of silence, Kaitlin Armstrong stood over Mo Wilson and put a third shot right in Mo Wilson’s heart,” Jones alleged. </p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>Both Armstrong and Wilson were romantically involved with professional cyclist Colin Strickland, according to court documents. Prosecutors claim that Armstrong killed Wilson out of jealousy. Last Wednesday, prosecutors said that Armstrong was living with Strickland at the time of the murder and monitored his email and social media accounts, prosecutors said. </p>\n\n\n\n<p>Armstrong’s defense attorneys, however, argued that the case against her lacks sufficient evidence or witnesses. Their client is trapped in a “nightmare” of circumstantial evidence, defense attorney Geoffrey Puryear said. No security cameras showed Armstrong near the scene of the crime.</p>\n\n\n\n<p>“You did not hear about any direct evidence showing Kaitlin Armstrong is responsible for this crime,” Puryear said. “Not one witness saw Kaitlin Armstrong allegedly commit this murder. Not one.”</p>\n\n\n\n<p>Armstrong’s trial will continue this week. In addition to a second-degree murder charge, she could face additional charges for attempting to escape police custody shortly before the trial, <a href=\"https://www.nbcnews.com/news/us-news/woman-accused-murdering-cyclist-mo-wilson-tracked-fitness-app-prosecut-rcna123258\">NBC News</a> reported. </p>\n\n\n\n<p>The trial, which started last Monday, is expected to last 2 weeks. </p>\n\n\n\n<h2>Murder Trial of Pro Cyclist Mo Wilson Starts Today: What You Need to Know</h2>\n\n\n\n<p><strong>Monday, October 30 </strong>— The trial for the murder of Mo Wilson begins today — 2 weeks after accused killer Kaitlin Armstrong attempted to flee custody. </p>\n\n\n\n<p>Since Wilson was found shot to death in an Austin home in May 2022, the case has drawn national and international attention. The investigation led authorities to Armstrong, a 36-year-old real estate agent suspected of killing Wilson over a possible love triangle. </p>\n\n\n\n<p>Armstrong has twice attempted to escape authorities. It took a <a href=\"https://gearjunkie.com/biking/mo-wilson-murder-case-timeline\">43-day international hunt</a> to bring her back to the U.S. after Armstrong fled to Costa Rica last June. Earlier this month, she broke free from corrections officers in a chase that lasted about a mile before she was recaptured, according to <a href=\"https://www.cnn.com/2023/10/18/us/kaitlin-armstrong-escape-video-texas/index.html\" target=\"_blank\">CNN</a>. </p>\n\n\n\n<p>Now, Armstrong will finally come to trial, where she faces up to 99 years in prison if convicted on the first-degree murder charge. Armstrong has pled not guilty. </p>\n\n\n\n<p>Stay tuned for GearJunkie trial updates throughout the week. </p>\n\n\n\n<figure><div>\n<div><blockquote><div> <a href=\"https://www.instagram.com/p/CZaC8Qxus9S/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div>View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CZaC8Qxus9S/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Moriah Wilson (@mo__wilson)</a></p></div></blockquote></div>\n</div></figure>\n\n\n\n<h2>Cycling’s ‘Carnival-Like Media Storm’</h2>\n\n\n\n<p>When Wilson was <a href=\"https://gearjunkie.com/biking/mo-wilson-murder-case-timeline\" target=\"_blank\">found dead</a> from three gunshots on May 11 of last year, it shocked the international cycling community. The 25-year-old cyclist was seen as a rising star in the sport and a potential contender for the Olympics. </p>\n\n\n\n<p>Information released by investigators has resulted in a “carnival-like media storm,” said a motion filed by Armstrong’s attorneys, according to the Austin American-Statesman. </p>\n\n\n\n<p>Court documents suggest it only took a few days after Wilson’s murder for police to identify Armstrong as the chief suspect. The yoga instructor and real estate agent had been dating pro cyclist Colin Strickland, 36, who had briefly dated Wilson in the past. But Wilson and Strickland also spent the evening together before her death, and investigators suspect that Armstrong killed Wilson out of jealousy.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>Investigators collected several vital pieces of evidence, according to the arrest affidavit. Security cam footage from the night of the murder shows a car matching the description of Armstrong’s Jeep Cherokee driving past the house where Wilson’s body was found. An anonymous caller told police that Armstrong said she wanted to kill Wilson, and Strickland told authorities that he had bought a gun for Armstrong in January 2022. </p>\n\n\n\n<p>Ballistics tests performed on Armstrong’s Sig Sauer P365 9mm showed “the potential that the same firearm was involved is significant,” court documents said. </p>\n\n\n\n<p>Monday’s trial will begin with jury selection, as well as opening and closing statements from defense attorneys and prosecutors. </p>\n\n\n\n<p>GearJunkie will update this article as the high-profile trial in Austin progresses. </p>\n\n\n\n<hr />\n\n\n\n<p><em>This story originally appeared on <a href=\"https://gearjunkie.com/biking/mo-wilson-murder-trial\">Gearjunkie</a></em></p>\n\n\n\n<p><a href=\"https://www.cnn.com/2022/07/20/us/kaitlin-armstrong-plea-not-guilty/index.html\"></a></p>\n<p>The post <a href=\"https://bikerumor.com/guilty-jury-convicts-kaitlin-armstrong-of-murdering-pro-cyclist-mo-wilson/\">Guilty: Jury Convicts Kaitlin Armstrong of Murdering Pro Cyclist Mo Wilson</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Zach Overholt","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"558d2f0f81e1303d050738b31c4be993b36a6b138abafafe6d726e3089a379ef","category":"Cycling"}