{"title":"Structural characterization of a novel polysaccharide from tremella fuciformis and its interaction with gut microbiota","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13479?af=R","date":1711189808000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Due to their diverse biological activities, polysaccharides derived from <i>Tremella fuciformis</i> have received growing attention. This study aimed to investigate the structural characterization of a purified polysaccharide (designated as PTP-3a) derived from <i>Tremella fuciformis</i> and explore its interaction with gut microbiota <i>in vitro</i>.</p>\n<h2>Results</h2>\n<p>The findings revealed that PTP-3a had a molecular weight of 1.22 × 10<sup>3</sup> kDa and consisted of fucose, glucose, xylose, mannose, and glucuronic acid in a molar ratio of 0.271:0.016:0.275:0.400:0.038. The primary linkage types identified in PTP-3a were 1,3-linked-manp, 1,4-linked-xylp, and 1,2,3-linked-fucp, with corresponding ratios of 0.215:0.161:0.15. In addition, PTP-3a demonstrated notable thermal stability and exhibited a triple helical structure. Moreover, following <i>in vitro</i> fermentation for 48 h, PTP-3a was efficiently utilized, resulting in a reduction in carbohydrate levels, the production of short-chain fatty acids (SCFAs), and pH adjustment. Furthermore, during <i>in vitro</i> fecal microbial fermentation, PTP-3a decreased the relative abundance of <i>Firmicutes</i> while increasing the proportions of <i>Bacteroidetes</i> and <i>Proteobacteria</i>, resulting in a significantly reduced <i>Firmicutes</i>/<i>Bacteroidetes</i> ratio. Additionally, PTP-3a stimulated the growth of beneficial bacteria such as <i>Parabacteroides merdae</i>, <i>Gordonibacter pamelaeae</i>, <i>Bifidobacterium pseudolongum</i>, and <i>Parabacteroides distasonis</i>. Importantly, a strong correlation was observed between the production of SCFAs and specific microorganisms.</p>\n<h2>Conclusion</h2>\n<p>These findings suggested that PTP-3a held potential as a prebiotic for modulating the gut microbiota.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Haizhao Song, \nJing Lu, \nQiang Chu, \nRou Deng, \nXinchun Shen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"558eeb84acbcbaab743a12a6bc07f6321063e4285c42cb456ce2c91c005216a5","category":"Environment"}