{"title":"HashiConf Europe 2021 Recap and Videos","link":"https://www.hashicorp.com/blog/hashiconf-europe-2021-recap-and-videos","date":1624300200000,"content":"<p>HashiConf Europe 2021 will be remembered for the release of <a href=\"https://www.hashicorp.com/blog/announcing-hashicorp-terraform-1-0-general-availability\">Terraform 1.0</a>. But the virtual conference also featured plenty of other impactful announcements and insights: the announcement of <a href=\"https://www.hashicorp.com/blog/announcing-hcp-packer\">HCP Packer</a>, <a href=\"https://www.hashicorp.com/blog/hashicorp-cloud-platform-adds-transit-gateway-okta-new-skus\">updates to the core HashiCorp Cloud Platform</a>, <a href=\"https://www.hashicorp.com/blog/toward-vagrant-3-0\">porting Vagrant to Go</a>, <a href=\"https://www.hashicorp.com/resources/the-road-to-packer-2-0\">a roadmap to Packer 2.0</a>, and <a href=\"https://www.hashicorp.com/blog/terraform-cloud-improved-visibility-for-workflows\">new Terraform Cloud features</a>.</p>\n<p>We have over 30 videos sharing details on those announcements and much more, including case studies, interviews, best practices, and benchmarks. All of the videos are presented below, and many of them already include full transcripts (the rest of the transcripts will be available soon).</p>\n<p>But before you dive into the sessions, check out this short recap video highlighting the best of HashiConf Europe 2021:</p><h2><a href=\"#product-news-and-keynote-highlights\">»</a><a></a>Product News and Keynote Highlights</h2>\n<p>Videos of keynotes, product updates, and news announcements:</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/terraform-1-0-launch-keynote\">Day 1 Keynote: Terraform 1.0 Launch</a></strong></p>\n<p>After some brief remarks from CEO Dave McJannet on the state of HashiCorp, Co-founder and CTO Mitchell Hashimoto tells the story of Terraform from inception all the way to the big announcement of Terraform 1.0, which marks a major milestone for interoperability, ease of upgrades, and maintenance. Terraform 1.0 also comes with a promise of stability and backward compatibility up until at least version 2.0. (For context, check out this <a href=\"https://www.hashicorp.com/resources/celebrating-terraform-1-0\">infographic illustrating the road to Terraform 1.0</a>.) (Transcript available)</p>\n<p>Co-founder and CTO Armon Dadgar concludes the keynote by announcing several visibility and extensibility enhancements to Terraform Cloud, including workspace overviews, public module curation in the private module registry, and run checks.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/the-hcp-vision-and-hcp-packer\">Day 2 Keynote: The HCP Vision and HCP Packer</a></strong></p>\n<p>In this keynote, Armon announces expanded capabilities in HCP for networking, single sign-on, and more. He also reveals that HCP will add support for new configurations of HashiCorp Consul and Vault in the coming months.</p>\n<p>Lead Packer Engineer Megan Marsh also joins the keynote to announce HCP Packer, a new cloud service designed to bridge the gap between image creation and deployment with image-management workflows. The service will be available for beta testing in the coming months, so <a href=\"https://go.hashicorp.com/HCP-Packer-Beta\">sign up now</a>. (Transcript available)</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/infrastructure-keynote-provisioning-network-automation-consul-terraform-sync\">Infrastructure Keynote:\nProvisioning and Network Automation with Consul-Terraform-Sync</a></strong></p>\n<p>Terraform and Consul product managers discuss Day 0, Day 1, and Day 2 activities around infrastructure provisioning and share strategies for dynamically updating network infrastructure using <a href=\"https://learn.hashicorp.com/tutorials/consul/consul-terraform-sync-intro\">Consul-Terraform-Sync</a>. (Transcript available)</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/application-keynote-exploring-the-application-delivery-developer-workflow\">Application Keynote:\nExploring the Application Delivery Developer Workflow</a></strong></p>\n<p>HashiCorp Nomad and Consul product managers explain how we're trying to create a clear path for developers with Nomad, Consul, and HashiCorp Waypoint to simplify orchestration, progressive delivery, and release management integrations. (Transcript available)</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/security-keynote-more-secure-world-with-zero-trust-hashicorp-vault-boundary-consul\">Security Keynote:\nA More Secure World with Zero Trust Architecture</a></strong></p>\n<p>Product and Engineering leadership from the Security product line at HashiCorp lay out our vision for identity-driven security and networking controls with a high-quality user experience using Vault, HashiCorp Boundary, and Consul. (Transcript available)</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/secure-access-management-with-boundary-and-the-hashicorp-stack\">Secure Access Management with Boundary and the HashiCorp Stack</a></strong></p>\n<p>Boundary Product Manager Pete Pacent demos how Boundary, in conjunction with the rest of HashiCorp projects, can help manage the access lifecycle for ephemeral resources to create secure, just-in-time access.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/waypoint-updates-and-roadmap-from-hashiconf-europe-2021\">Waypoint Updates &amp; Roadmap</a></strong></p>\n<p>Waypoint Engineer Rae Krantz provides an introduction, updates, and roadmap for the Waypoint project. (Transcript available)</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/the-road-to-packer-2-0\">The Road to Packer 2.0</a></strong></p>\n<p>Megan Marsh explains recent changes to Packer that support easier adoption of community plugins and discusses upcoming milestones on the path to Packer 2.0.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/the-future-of-vagrant-toward-3-0\">The Future of Vagrant – Toward 3.0</a></strong></p>\n<p>HashiCorp Vagrant engineers announce the product’s migration to a Go code base and explain how it will retain support for Ruby-based Vagrantfiles and Vagrant plugins while enabling new development workflows, environments, and ecosystems. For further details you can also read our blog: <a href=\"https://www.hashicorp.com/blog/toward-vagrant-3-0\">Toward Vagrant 3.0</a> (Transcript available)</p>\n<h2><a href=\"#customer-and-user-stories\">»</a><a></a>Customer and User Stories</h2>\n<p>Videos of talks and sessions covering where and how customers use HashiCorp products.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/starbucks-secrets-at-the-retail-edge-with-hashicorp-vault\">Starbucks: Securing Secrets and Identity at 100,000+ Edge Devices With Vault</a></strong></p>\n<p>Get a deep dive into the architectural patterns that Starbucks used to build secret and identity management capabilities for 100,000+ retail edge devices. You can also watch another Starbucks case study from a previous HashiConf here: <a href=\"https://www.hashicorp.com/resources/terraform-at-starbucks-infrastructure-as-code-for-software-engineers\">Terraform at Starbucks: Infrastructure as Code for Software Engineers</a>.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/observability-as-code-with-terraform\">Vodafone UK: Observability as Code with Terraform</a></strong></p>\n<p>Developers write better code when they can properly observe production systems. Here’s how Vodafone used Terraform to enable self-service observability for all its developers.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/mediamarkt-journey-to-compliance-with-terraform\">Driving Compliance with Policy as Code at MediaMarktSaturn</a></strong></p>\n<p>Large retailer MediaMarktSaturn uses Terraform Enterprise to drive proactively compliant infrastructure consumption across 70 teams.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/a-g-research-story-1-to-1000-vault-namespaces\">1 to 1000 Vault Namespaces at G-Research</a></strong></p>\n<p>Learn how G-Research, an institutional research and brokerage firm, uses Vault to secure the self-service GitOps delivery of 1000+ Vault namespaces using Jenkins, Kubernetes, and Terraform, reducing the dependency on the identity access management (IAM) team.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/terraform-at-decathlon-from-on-prem-to-100-cloud\">From On-Prem to 100% Cloud Journey at Decathlon</a></strong></p>\n<p>Decathlon, a global retailer, made the move from open source Terraform to Terraform Enterprise to improve security, collaboration, and to speed up its cloud journey. There are some great lessons learned here for those scaling their Terraform usage. Also, be sure to read Decathlon’s <a href=\"https://www.hashicorp.com/case-studies/decathlon\">complete Terraform and Vault case study</a> on the HashiCorp website.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/taming-application-secrets-at-bps-with-hashicorp-vault\">Taming Application Secrets at Banca Popolare di Sondri</a></strong></p>\n<p>Italian bank BPS is addressing the long-standing challenge of dealing with secrets in application architectures. The company provides several takeaways for you to learn from its experience.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/protecting-privacy-for-refugees-with-vault-at-the-red-cross\">How the International Red Cross Secures Privacy for Refugees</a></strong></p>\n<p>Learn about the technical architecture and challenges the organization faced building RedSafe, a Vault platform providing safe and secure services for humanitarian crises.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/seeding-hashicorp-vault-with-terraform\">Seeding HashiCorp Vault With Terraform at Form3, a Cloud Native Payment Processing Platform</a></strong></p>\n<p>Operators often assume that setting up Vault has to be a mostly manual process, but the engineers at Form3 created a repeatable process you can use to automate the setup of Vault using Terraform. (Transcript available)</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/seamless-dynamic-credentials-for-developers-with-hashicorp-vault\">Seamless Dynamic Credentials for Developer Tooling at Sky Betting &amp; Gaming</a></strong></p>\n<p>Learn about the process Sky Betting &amp; Gaming uses to allow developers to seamlessly grab dynamic credentials from Vault without having to specify which credentials they need. You can also watch previous HashiConf talks from Sky Betting &amp; Gaming: <a href=\"https://www.hashicorp.com/resources/how-we-accelerated-our-vault-adoption-with-terraform\">How We Accelerated Our Vault Adoption With Terraform</a> and <a href=\"https://www.hashicorp.com/resources/oh-no-i-deleted-my-vault-secret\">Oh No! I Deleted My Vault Secret!</a> (Transcript available)</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/making-movie-magic-with-hashicorp-nomad\">Making Movie Magic With Nomad at Conductor, a Studio-Scale Cloud Rendering Platform</a></strong></p>\n<p>Learn how Conductor uses Nomad to drive industry-leading compute scale that enables visual-effects studios to render massive amounts of content on the cloud.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/migrating-kubernetes-nomad-consul-doubling-pipeline-speed-gitlab-internet-archive\">GitLab + Nomad = A Dream Come True at The Internet Archive</a></strong></p>\n<p>See how the Internet Archive moved more than 100 deployments from Kubernetes to Nomad/Consul clusters with the help of GitLab and a 2-line <code>.gitlab-ci.yml</code></p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/hashicorp-vault-for-crypto-agility\">HashiCorp Vault for Crypto-Agility at Banco Santander</a></strong></p>\n<p>Banco Santander, a Spanish financial service company, is doing research into cryptocurrency and blockchain. In this talk, the bank’s engineers demonstrate a pair of plugins for Vault: Linkable Ring Signatures and Ethereum Signer/Signature Adapter. (Transcript available)</p>\n<h2><a href=\"#everything-else\">»</a><a></a>Everything Else</h2>\n<p>Here are the demos and presentations from the remaining presenters from HashiCorp and our community:</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/what-makes-hashicorp-boundary-different\">What Makes HashiCorp Boundary Different?</a></strong></p>\n<p>Learn how Boundary was designed from the ground up for differentiated security, simplicity, and extensibility.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/the-zero-trust-mindset\">The Zero Trust Security Mindset</a></strong></p>\n<p>Developer Advocate Rob Barnes outlines how the service mesh pattern, identity-based access management, and secrets management can help improve your security posture. (Transcript available)</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/terraform-1-0-and-terraform-cloud-workflows\">Terraform Deep Dive, Part 1: Terraform 1.0 and Terraform Cloud Workflows</a></strong></p>\n<p>In this demo session, see the features of Terraform 1.0 in action and see the updates in Terraform Cloud as well.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/terraform-1-0-we-have-arrived-at-our-destination\">Terraform Deep Dive, Part 2: Terraform 1.0 — We Have Arrived at Our Destination</a></strong></p>\n<p>A recap of all the stability work done to get Terraform 1.0 across the finish line.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/a-terraform-cloud-ux-journey-building-workflows\">A Terraform Cloud UX Journey: Building Workflows</a></strong></p>\n<p>At HashiCorp, we want to make Terraform Cloud the single source of truth for your infrastructure, with an exceptional design and workflow experience. Hear from our Engineering, Product, and Design (EPD) team about how they built and polished the UX for Terraform Cloud. You’ll also get a peek at some of the latest updates in action. (Transcript available)</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/assumptions-and-adventures-in-nomad-autoscaling\">Assumptions and Adventures in Nomad Autoscaling</a></strong></p>\n<p>Learn about some uncommon Nomad use cases that challenge standard Nomad autoscaling assumptions and find out more about the solutions for those cases.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/assumptions-and-adventures-in-nomad-autoscaling\">Sustainable HashiCorp Nomad for SREs</a></strong></p>\n<p>Get practical recommendations for using Nomad to achieve greater practitioner sustainability and better quality of life for operators.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/bring-your-own-key-to-the-cloud-with-hashicorp-vault\">Bring Your Own Key to the Cloud With Vault</a></strong></p>\n<p>Azure calls the concept \"BYOK,\" or “bring your own key.” AWS calls them customer-managed encryption keys. But in essence, with the Key Management Secret Engine, Vault can now become your root of trust outside of the cloud providers’ control. See how the Key Management Secret Engine works.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/multi-region-networking-with-hcp-consul-federation\">Multi-Region Networking with HCP Consul Federation</a></strong></p>\n<p>Watch this session to learn about HCP Consul's new Federation feature, which provides multi-region service networking.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/scale-testing-network-control-plane-inside-consul-global-scale-benchmark\">Scale Testing the Network Control Plane: Inside the Consul Global Scale Benchmark</a></strong></p>\n<p>Take a deeper look at our recent <a href=\"https://www.hashicorp.com/cgsb\">Consul Global Scale Benchmark</a>, in which Consul scaled to update ~170,000 service instances running on 10,000 nodes in less than half a second. This talk explains the testbench and what we learned.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/orchestration-delivery-integrating-gitlab-hashicorp-terraform-packer-vault-waypoint\">Orchestration to Delivery: Integrating GitLab with HashiCorp</a></strong></p>\n<p>This talk discusses joint solutions developed by HashiCorp and GitLab for keeping delivery and infrastructure management workflows in lockstep.</p>\n<p><strong><a href=\"https://www.hashicorp.com/resources/conversation-vicki-cheung-sre-mlops-lessons-learned-from-lyft-openai-duolingo\">In Conversation With Vicki Cheung: SRE, MLOps, and Lessons Learned from Lyft, OpenAI, and Duolingo</a></strong></p>\n<p>Vicki Cheung was previously a senior staff software engineer at Lyft, the head of infrastructure and a founding engineer at Open AI, and a founding engineer at Duolingo. Join HashiCorp's Nic Jackson and Anubhav Mishra as they sit down with Vicki (and her cat) for a fireside chat.</p>\n<h2><a href=\"#see-you-in-october-at-hashiconf-global\">»</a><a></a>See You in October at HashiConf Global</h2>\n<p>We’re extremely grateful to our speakers for creating so many insightful sessions at HashiConf Europe 2021. We know these sessions take a great deal of work, but it’s worth it because the community gains so much knowledge from this content. So, again, thank you!</p>\n<p>Finally, if you’re already itching for even more content, be sure to add <a href=\"https://hashiconf.com/global/\">HashiConf Global</a> to your calendar on October 19-22, 2021. The conference will also be completely digital and for the first time, we will be rebroadcasting it for viewers in the Asia Pacific region. We look forward to having you join us.</p>","author":"Mitch Pronschinske","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"55a2d3ac632634e8bb25f91e97cc2ffda69d0b2b75ab86c85bd3d6c434827ca2","category":"Tech"}