{"title":"On the Resistance to Entropic Elevation of Genetic Information: The Solution to the Non-Randomness of Mutations With Reference to Their Essentiality","link":"https://www.preprints.org/manuscript/202404.1005/v1","date":1713227445000,"content":"Contrary to previous belief, mutation frequency also depends on how essential a gene is. Mutation frequency is substantially lower in the coding regions of essential genes and higher in less essential genes. Even though the mutation bias based on gene essentiality is incapable of invalidating Darwinism, this bias certainly added a rather unsubtle obstacle to it by contradicting a paradigm that was widely held: that mutations are random in the sense of being independent of their function for the organism. The reason this bias occurs is currently unknown. Here, I present the theoretical solution of why genetic mutations also depend on whether the gene is more or less essential. My theory is that each gene or epigene has its own level of resistance to entropic elevation, something directly proportional to the frequency of its expression. The more a gene is expressed, the higher is its resistance to entropic elevation and vice versa. For genetic information to be conserved instead of suffering mutation, a relevant factor is also the frequency of its expression. The energy expenditure directed to a gene of current utility engenders resistance to entropic elevation of the information encoded in that gene, as energy enables not only the existence of information but also its conservation. My theory—which is based on fundamental physics and contains predictions that can be empirically tested—solves a crucial problem in evolutionary biology and genetics; if I am right, I will have established a biological law.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"55a49a89bd89bf71b8ce21b1d9ccc4ad3769775ebdb947e1a89a852454d1828b","category":"Interdisciplinary"}