{"title":"Tubulin participates in establishing protoxylem vessel reinforcement patterns and hydraulic conductivity in maize","link":"https://academic.oup.com/plphys/article/196/2/931/7689807?rss=1","date":1717718400000,"content":"<span><div>Abstract</div>Water transportation to developing tissues relies on the structure and function of plant xylem cells. Plant microtubules govern the direction of cellulose microfibrils and guide secondary cell wall formation and morphogenesis. However, the relevance of microtubule-determined xylem wall thickening patterns in plant hydraulic conductivity remains unclear. In the present study, we identified a maize (<span>Zea mays</span>) semi-dominant mutant, designated <span>drought-overly-sensitive1</span> (<span>ZmDos1</span>), the upper leaves of which wilted even when exposed to well-watered conditions during growth; the wilting phenotype was aggravated by increased temperatures and decreased humidity. Protoxylem vessels in the stem and leaves of the mutant showed altered thickening patterns of the secondary cell wall (from annular to spiral), decreased inner diameters, and limited water transport efficiency. The causal mutation for this phenotype was found to be a G-to-A mutation in the maize gene <span>α-tubulin4</span>, resulting in a single amino acid substitution at position 196 (E196K). Ectopic expression of the mutant <span>α-tubulin4</span> in Arabidopsis (<span>Arabidopsis thaliana</span>) changed the orientation of microtubule arrays, suggesting a determinant role of this gene in microtubule assembly and secondary cell wall thickening. Our findings suggest that the spiral wall thickenings triggered by the α-tubulin mutation are stretched during organ elongation, causing a smaller inner diameter of the protoxylem vessels and affecting water transport in maize. This study underscores the importance of tubulin-mediated protoxylem wall thickening in regulating plant hydraulics, improves our understanding of the relationships between protoxylem structural features and functions, and offers candidate genes for the genetic enhancement of maize.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"55a88adc5e1a4ea9d9241caa6bd4e0a5599f7be0b65f9364eb9963ad6bbf3279","category":"Environment"}