{"title":"Asynchronous Video","link":"https://markpeak.net/asynchronous-video/","date":1635656204000,"content":"<p>บล็อกตอนนี้เป็นภาคต่อของ <a href=\"https://markpeak.net/slack-or-zoom-when-to-do-a-meeting/\">Slack or Zoom เราประชุมออนไลน์กันมากไปไหม</a></p>\n<p>แนวทางหนึ่งที่มาแรงในช่วงหลัง (แต่ยังไม่นานพอที่จะพิสูจน์ว่าเวิร์คจริง) คือแทนที่เราจะมาประชุมกันออนไลน์แบบพร้อมหน้า (synchronous) เปลี่ยนมาเป็นการอัดคลิปแล้วส่งให้กันแทนจะดีกว่าไหม (asynchronous)</p>\n<p>ตัวอย่างบริษัทที่เปิดใช้ฟีเจอร์นี้คือ <a href=\"https://www.blognone.com/node/124864\">Slack Clips</a> แต่ก็ยังมีรายอื่นๆ เช่น Cisco Webex ออกชื่อ Vidcast หรือแม้กระทั่ง Zoom ก็พยายามทำ</p>\n<p>มาเจอ<a href=\"https://www.zdnet.com/article/asynchronous-videos-can-the-tiktok-generation-save-us-from-meeting-overload/#ftag=RSSbaffb68\">บทความใน ZDNet</a> พูดถึงเรื่องนี้ไว้ตรงประเด็นดี</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.zdnet.com/article/asynchronous-videos-can-the-tiktok-generation-save-us-from-meeting-overload/#ftag=RSSbaffb68\">\n\t\t\t\t\t<img src=\"https://www.zdnet.com/a/img/resize/380ec416035f3b442a2a8474a537a2d2dd7bf9ca/2021/08/09/32504dd8-a6dc-4f4e-a7b2-df687919d91c/zooms-ceo-shares-his-secret-every-day-i-join-customer-meetings.jpg?width=770&amp;height=578&amp;fit=crop&amp;auto=webp\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.zdnet.com/article/asynchronous-videos-can-the-tiktok-generation-save-us-from-meeting-overload/#ftag=RSSbaffb68\">\n\t\t\tAsynchronous videos: Can the TikTok generation save us from meeting overload? | ZDNet\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.zdnet.com/article/asynchronous-videos-can-the-tiktok-generation-save-us-from-meeting-overload/#ftag=RSSbaffb68\">\n\t\t\t<p>Technology vendors seem to think there's something to asynchronous video and messaging. It's worth a try, given meeting overload is real.</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://www.zdnet.com/a/fly/bundles/zdnetcss/images/logos/logo-192x192.png\" />\t\tZDNet\t</div>\n</div>\n<p>ZDNet อ้างคำพูดของ <a href=\"https://markpeak.net/bret-taylor/\">Bret Taylor ซึ่งปัจจุบันเป็น COO ของ Salesforce</a> (และเจ้าของ Slack) ที่พูดเรื่องนี้ไว้น่าสนใจดี</p>\n<blockquote><p>If you read about Zoom fatigue, it’s because everyone took the meetings and the conference rooms and they moved to the video conference room and said, we’ve digitally transformed. And you feel exhausted by the end of the day, and you don’t feel more connected to your colleagues. <strong>If you had a morning standup meeting, people could do that asynchronously and watch it on their own time. So, it gives employees more flexibility to actually work asynchronously.</strong> If you talk to any leader who’s really been successful managing a distributed workforce, <strong>asynchronous is one of the words you’ll hear a lot</strong> out of their mouths because that’s really how you take full advantage of the different time zones, different workforce plans, recruiting for more cities, but it’s not easy.</p></blockquote>\n<p>อย่างไรก็ตาม ZDNet ก็เห็นด้วยว่ามันไม่ง่าย ด้วยปัจจัย 3 ข้อคือ</p>\n<blockquote><p><strong>Discipline.</strong> Meetings are undisciplined. If an exec requests a 3- to 10-minute video instead of a 30-minute meeting whoever makes the video needs to be on point.</p></blockquote>\n<blockquote><p><strong>Culture. </strong>There are two cultural hurdles to asynchronous meetings. First, some of us aren’t that great at video. I’ve just worked my way up to being below average at video. And then there are the managers. Many meetings just want you on video in that little box to show you’re “working.” These long-winded video meetings are less intrusive than a key logger (maybe).</p></blockquote>\n<blockquote><p><strong>Video-centricity.</strong> Asynchronous meetings will be awesome once the TikTok generation starts running the show. Teens and tweens are capable of good asynchronous content. It’s safe to say most enterprises aren’t up to speed on quick hit videos.</p></blockquote>\n<p>ข้อ 1 และ 2 เป็นปัญหาในตัวมันเองคือ ไม่ใช่ทุกคนที่อัดคลิป ถ่ายทอดเรื่องราวผ่านวิดีโอได้เก่ง แต่ปัญหานี้จะเริ่มหมดไปในยุค TikTok generation ที่คนรุ่นใหม่เติบโตมากับการฝึกถ่ายวิดีโอตัวเอง ก็เป็นประเด็นที่น่าสนใจดี หากคนรุ่นนี้กลายมาเป็น workforce หลักในสถานที่ทำงาน วิธีสื่อสารระหว่างกันย่อมจะเปลี่ยนไป</p>\n<p></p>\n<p>ZDNet ยังอ้างวิธีทำงานของผู้บริหารบริษัทไอทีบางคน ที่พยายามตัดการประชุมแบบ synchronous มาเป็นการดูคลิปแบบ async เพราะประหยัดเวลามากกว่า เช่น จากการประชุม 30 นาที มาเป็นการดูคลิป 10 นาทีแทน</p>\n<blockquote><p>Jeetu Patel, executive vice president and general manager of Cisco’s security and collaboration business, has a standing rule for <strong>anyone who wants a 30-minute one-on-one meeting. The rule: Send a video no more than 10 minutes.</strong> “The lack of focus time is the biggest stressor with meetings so I’ve moved a lot of work asynchronous,” said Patel</p>\n<p>Patel then sets aside some time to watch a stack of 10-minute asynchronous videos and provides feedback in a direct message if follow up is needed. Add it up and <strong>Patel took 180 minutes of meetings and cut it to 60 minutes or less.</strong> Pro tip: Executives are watching these clips at 2x speed to get the gist faster.</p></blockquote>\n<p>หรือผู้บริหารอีกคนจาก Slack ก็ใช้วิธีเดียวกัน (แถมดูคลิปแบบเร็ว 2x ยิ่งประหยัดเวลา)</p>\n<blockquote><p>Tamar Yehoshua, chief product officer at Slack, has replaced internal standup meetings with 3-minute video clips. Watch the video on your time, respond in a channel and acquire more productive time. <strong>“Instead of going to a 30-minute meeting, I can fast-forward (video), play them on 2x speed and get done in 10 minutes,”</strong> said Yehoshua. “You aggregate all of that together, and it saves a tremendous amount of time.”</p></blockquote>\n<p>ดูแล้วก็เป็นแนวทางเลือกใหม่ในการทำงานที่น่าสนใจ ถ้ามีโอกาสก็น่าลองทำเองดูบ้างเหมือนกัน</p>The post <a href=\"https://markpeak.net/asynchronous-video/\">Asynchronous Video</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"55bdbbfea8358dce61660a18cb5adc11ef86fe3626c395e195c2a45561dfb489","category":"Thai"}