{"title":"Anti-inflammatory effects of elexacaftor/tezacaftor/ivacaftor in adults with cystic fibrosis heterozygous for F508del","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304555","date":1717164000000,"content":"<p>by Heledd H. Jarosz-Griffiths, Lindsey Gillgrass, Laura R. Caley, Giulia Spoletini, Ian J. Clifton, Christine Etherington, Sinisa Savic, Michael F. McDermott, Daniel Peckham</p>\r\n\r\nInflammation is a key driver in the pathogenesis of cystic fibrosis (CF). We assessed the effectiveness of elexacaftor/tezacaftor/ivacaftor (ETI) therapy on downregulating systemic and immune cell-derived inflammatory cytokines. We also monitored the impact of ETI therapy on clinical outcome. Adults with CF, heterozygous for F508del (n = 19), were assessed at baseline, one month and three months following ETI therapy, and clinical outcomes were measured, including sweat chloride, lung function, weight, neutrophil count and C-reactive protein (CRP). Cytokine quantifications were measured in serum and following stimulation of peripheral blood mononuclear cells (PBMCs) with lipopolysaccharide (LPS) and adenosine triphosphate and analysed using LEGEND plex<sup>™</sup> Human Inflammation Panel 1 by flow cytometry (n = 19). ASC specks were measured in serum and caspase-1 activity and mRNA levels determined from stimulated PBMCs were determined. Patients remained stable over the study period. ETI therapy resulted in decreased sweat chloride concentrations (p &lt; 0.0001), CRP (p = 0.0112) and neutrophil count (p = 0.0216) and increased percent predicted forced expiratory volume (ppFEV1) (p = 0.0399) from baseline to three months, alongside a trend increase in weight. Three months of ETI significantly decreased IL-18 (p&lt; 0.0011, p &lt; 0.0001), IL-1β (p&lt;0.0013, p = 0.0476), IL-6 (p = 0.0109, p = 0.0216) and TNF (p = 0.0028, p = 0.0033) levels in CF serum and following PBMCs stimulation respectively. The corresponding mRNA levels were also found to be reduced in stimulated PBMCs, as well as reduced ASC specks and caspase-1 levels, indicative of NLRP3-mediated production of pro-inflammatory cytokines, IL-1β and IL-18. While ETI therapy is highly effective at reducing sweat chloride and improving lung function, it also displays potent anti-inflammatory properties, which are likely to contribute to improved long-term clinical outcomes.","author":"Heledd H. Jarosz-Griffiths","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"55c658048e689735f5731192bdae558bf89092144a5ca294e23b1f13ef056264","category":"Interdisciplinary"}