{"title":"Tesla sexual harassment lawsuits multiply as 6 more women sue Musk-led firm","link":"https://arstechnica.com/?p=1820964","date":1639597191000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/getty-tesla-service-center-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/getty-tesla-service-center.jpg\">Enlarge</a> <span>/</span> A Tesla showroom and service center on Friday, Sept. 4, 2020, in Burbank, California. (credit: Getty Images | Kent Nishimura )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Six more women sued Tesla yesterday, alleging that the company failed to stop rampant sexual harassment at factory facilities in Fremont, California, and service centers in the Los Angeles area.</p>\n<p>The lawsuits are similar to one <a href=\"https://arstechnica.com/tech-policy/2021/11/lawsuit-tesla-is-like-a-frat-house-with-frequent-groping-on-the-factory-floor/\">filed last month by employee Jessica Barraza</a>, who alleged that she and other women working in the carmaker's Fremont factory have been subjected to \"nightmarish conditions of rampant sexual harassment,\" including offensive comments, propositions, and \"frequent groping on the factory floor.\" Barraza alleged that managers and human resources personnel failed to protect her even though she complained repeatedly.</p>\n<p>The lawsuits filed yesterday \"detail specific instances of harassment that each woman experienced, and the lack of action from Tesla when these claims were reported,\" according to a press release from law firm Rudy Exelrod Zieff &amp; Lowe, which represents Barazza and the six other women. \"Those who complained were sometimes threatened into silence or faced undesirable transfers. The message was clear, there would be no consequences for abusers. The six women describe an environment in which it was normal for women to be catcalled, ogled, touched inappropriately, and propositioned.\"</p></div><p><a href=\"https://arstechnica.com/?p=1820964#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1820964&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"55c6c4748f38102eb9d22e49e666d9ad82f91e5dba2dce7ff02e38b6f3ccd622","category":"Tech"}