{"title":"Optimizing Milling Parameters for Enhanced Machinability of 3D‐Printed Materials: An Analysis of PLA, PETG, and Carbon Fiber Reinforced PETG","link":"https://www.preprints.org/manuscript/202405.1751/v1","date":1716804493000,"content":"Fused deposition modeling (FDM) is widely applied in various fields due to its affordability and ease of use. However, it faces challenges such as achieving high surface quality, precise dimensional tolerance and overcoming anisotropic mechanical properties. This paper analyzes and compare the machinability of 3D printed PLA, PETG and carbon fiber reinforced PETG focusing on surface roughness and burr formation. A design of experiments (DoE) with a full factorial design was used, considering three factors: rotation speed, feed rate and depth of cut. Each factor had different levels: rotational speed at 3000, 5500 and 8000 rpm; feed rate at 400, 600 and 800 mm/min; and depth of cut at 0.2, 0.4, 0.6, and 0.8 mm. Machinability was evaluated by roughness and burr height using a profilometer for all the materials under the same milling conditions. To evaluate the statistical significance of the influence of various processing parameters on surface roughness and burr formation in 3D printed components made of three different materials PLA, PETG and carbon fiber reinforced PETG, an analysis of variance (ANOVA) test was conducted. This analysis investigated whether variations in rotational speed, feed rate and depth of cut resulted in measurable and significant differences in machinability results. Results showed that milling parameters significantly affect roughness and burr formation, with optimal conditions for minimizing any misalignment highlighting the trade-offs in parameter selection. These results provide insights into the post-processing of FDM-printed materials with milling, indicating the need for a balanced approach to parameter selection based on application-specific requirements.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"55ccca5a84e4045461ce5d167517d3365131f4dfef0fad9820219782d203d50d","category":"Interdisciplinary"}