{"title":"PSV-21 Pediococcus acidilactici survives an in vitro simulated digestion","link":"https://academic.oup.com/jas/article/102/Supplement_2/316/7665095?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>In the swine industry, probiotics are recognized for optimizing growth performance and production efficiency by modulating host physiology, and the response across studies is not consistent. One area of focus is probiotic mitigation of post-weaning diarrhea, and further mechanistic understanding of probiotic and host physiology could help with consistent performance outcomes. An essential attribute of a probiotic is the ability to survive the harsh environments of the gastrointestinal tract (GIT). The aim of this study was to determine if <span>Pediococcus Acidilactici</span> PECh3A (PA) that has been previously genome sequenced for determining gut physiology mechanisms can survive an in vitro simulated digestion. In the in vitro digestion PA concentrations that were investigated included 10<sup>8</sup>, 10<sup>9</sup>, and 10<sup>10</sup> colony forming units (CFU)/mL. The in vitro digestion (n = 4/concentration) consisted of 5 phases with incubation times simulating the GIT; initial inoculation (0 h), gastric (2 h), upper intestinal (4 h), lower intestinal (9 h) and extended lower intestinal phase (9 h). For the initial inoculation concentrations of PA were added into 25 mL of sterile milk replacer representing dietary requirements of a suckling pig. In the gastric phase pepsin was added and pH was adjusted to 2.5. In the upper intestinal phase bile and pancreatin were added, along with a pH adjustment to 6.8. In the lower intestinal phase, the multi-enzyme complex consisting of carbohydrase enzymes was added and pH adjusted to 4.8. There was no addition during the extended lower intestinal phase. At each sample collection at the end of a phase 1 mL was collected from each flask. For each sample, 100 µL were serially diluted, plated on deMan, Rogosa, and Sharpe (MRS) plates, and incubated at 37°C for 24h. Survivability was determined by counting CFUs and comparing the concentration with the initial CFU/mL at 0 h and reported as percent survival (%S). Data for the in vitro digestion were analyzed according to a randomized complete block design (RCBD) in a split plot using the Repeated Measures Glimmix Procedure of SAS. Additional orthogonal contrasts were analyzed across PA concentrations. Data showed survival for 10<sup>8</sup>,10<sup>9</sup>, and 10<sup>10</sup>CFU/mL at all sample phases (10<sup>8</sup> - 44.24, 60.14, 58.36, 55.69%S; 10<sup>9</sup> - 40.56, 55.60, 49.35, 50.7%S; 10<sup>10</sup> - 32.98, 52.55, 46.72, 43.71%S ± 2.98 respectively; phase <span>P</span> &lt; 0.01 and concentration <span>P</span> &lt; 0.01). There is evidence of a phase and concentration effect on survivability, but no interaction. A linear concentration response was observed across concentrations (54.61, 49.05, 43.99%S ± 1.23; <span>P</span> &lt; 0.05) indicating that as concentration increases the survivability decreases. These findings indicate that PA PECh3A can survive a simulated GIT and potentially impact swine intestinal physiology.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"55d1e6cf0d52d140dc3368229f3b9d66872f8271e3713cbc2a140e2144b32f0e","category":"Environment"}