{"title":"Prevalence of white spot syndrome virus (WSSV) in wild-caught and commodity decapod crustaceans in coastal South Carolina, USA","link":"https://academic.oup.com/jcb/article/doi/10.1093/jcbiol/ruae002/7585772?rss=1","date":1705968000000,"content":"<span><div>Abstract</div>White spot syndrome virus (WSSV) is a highly contagious and economically costly virus that affects many crustacean species. Since its introduction into the United States in the 1990s, it has spread from aquaculture shrimp and crayfish to wild crustaceans throughout the southeastern United States. Transmission to natural systems may occur through contact between commodity (i.e<span>.,</span> store-bought) and wild crustaceans or the use of infected frozen shrimp as bait, which has been proven capable of transmitting the virus. In this study, we surveyed both live (<span>Penaeus setiferus</span> (Linnaeus, 1767) and <span>P. aztecus</span><a href=\"#CIT0016\">Ives, 1891</a>) and frozen commodity shrimp (<span>Penaeus vannamei</span><a href=\"#CIT0003\">Boone, 1931</a>) and crayfish (<span>Procambarus troglodytes</span> (Le Conte, 1856) and <span>P. clarkii</span> (Girard, 1852)) as well as wild populations of some of these species of shrimp, crayfish, and blue crabs (<span>Callinectes sapidus</span><a href=\"#CIT0033\">Rathbun, 1896</a>) in South Carolina for WSSV. We found extremely low levels of the virus in wild-caught decapods but high levels of WSSV in commodity crayfish (50%) and imported frozen shrimp (43.3%). While additional work is needed to understand the environmental conditions that affect the transmission potential of WSSV, these results suggest that care must be taken with commodity crustaceans to prevent introductions of WSSV and subsequent harm to natural ecosystems.</span>","author":"","siteTitle":"Journal of Crustacean Biology Current Issue","siteHash":"8ca07ea220dbc7082c62912ab6b47a7a5a309f6e19a7257844b27bf0267b5f04","entryHash":"55d4936bd96ca6341aba922073bd840f497c5ca27185c272e19ffd5bf6314908","category":"Environment"}