{"title":"A theory for context‐dependent effects of mammalian trampling on ecosystem nitrogen cycling","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14066?af=R","date":1715144873000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/dd80b073-9d4b-4203-8dfb-00a12ab975f9/jane14066-toc-0001-m.png\" alt=\"A theory for context-dependent effects of mammalian trampling on ecosystem nitrogen cycling\" />\n<p>Trampling of vegetation and soil is ubiquitous among walking vertebrates, yet most models and empirical studies do not explicitly consider trampling impacts on ecosystem elemental cycling. With a new mathematical model, the authors resolve context-dependent trampling effects on nitrogen cycling via multiple mechanisms related to detritivore functioning and mortality.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLarge mammalian herbivores substantially impact ecosystem functioning. As their populations are dramatically altered globally, disentangling their consumptive and non-consumptive effects is critical to advance mechanistic understanding and improve prediction of effects over ecosystem and Earth-system spatial extents. Mathematical models have played an important role in clarifying potential mechanisms of herbivore zoogeochemistry, based mostly on their consumptive effects as primary consumers and recyclers of organic and inorganic matter via defecation and urination. Trampling is a ubiquitous effect among walking vertebrates, but the consequences and potential mechanisms of trampling in diverse environments remain poorly understood.\n\nWe derive a novel mathematical model of large mammalian herbivore effects on ecosystem nitrogen cycling, focusing on how trampling and environmental context impact soil processes. We model herbivore trampling with a linear positive or negative additive effect on soil-mediated nitrogen cycling processes.\n\nCombining analytical and numerical analyses, we find trampling by large mammalian herbivores is likely to decrease nitrogen mineralisation rate across diverse environments, such as temperate grassland and boreal forest. These effects are mediated by multiple potential mechanisms, including trampling-induced changes to detritivore biomass and functioning (e.g. rate of organic matter consumption). We also uncover scenarios where trampling can increase nitrogen mineralisation rate, contingent on the environment-specific relative sensitivity of detritivore mineral-nitrogen release and detritivore mortality, to trampling.\n\nIn contrast to some consumptive mechanisms, our results suggest the pace of soil nitrogen cycling prior to trampling has little influence over the direction of the trampling net effect on nitrogen mineralisation, but that net effects may be greater in slow-cycling systems (e.g. boreal forests) than in fast-cycling systems (e.g. grasslands).\n\nOur model clarifies the potential consequences of previously overlooked mechanisms of zoogeochemistry that are common to all terrestrial biomes. Our results provide empirically testable predictions to guide future progress in empirical and theoretical studies of herbivore effects in diverse environmental contexts. Resolving ecological contingencies around animal consumptive and non-consumptive effects will improve whole-ecosystem management efforts such as restoration and rewilding.\n</p>","author":"G. Adam Meyer, \nShawn J. Leroux","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"55d555b3c61c9b1cd473e6beb62b1021c0eb1860403c90c3a15ff234b5deb124","category":"Environment"}