{"title":"Apple needs to change the way AirPods get updates","link":"https://www.macworld.com/article/1806051/airpods-firmware-update-bluetooth-settings-apple-device.html","date":1683207123000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Following the release of the first-ever <a href=\"https://www.macworld.com/article/1804313/ios-16-4-1-macos-13-3-1-rapid-security-response.html\">Rapid Security Response update</a>, which brought important security fixes to billions of devices running iOS/iPadOS 16.4.1 and macOS 13.3.1, Apple on Tuesday <a href=\"https://www.macworld.com/article/1806017/apple-releases-firmware-for-airpods-beats-and-the-magsafe-charger.html\">issued a firmware update</a> (5E135) to all AirPods models except the original earbuds from 2016. I’m willing to bet that most AirPods aren’t even on the <a href=\"https://www.macworld.com/article/1784147/airpods-pro-max-firmware-update-5e133.html\">previous firmware</a> (5E133), let alone this new one.</p>\n\n\n\n<p>Even though AirPods have been out since 2017, Apple still doesn’t have a proper way to update its popular earbuds. Whereas every other device has some sort of a button that lets you download and install the update, AirPods don’t. You have to a) know there’s an update; b) put your AirPods into the case; c) charge the case wirelessly or with a cable; d) make sure it’s within range of an iPhone, iPad, or Mac; and e) wait for an indeterminate amount of time.</p>\n\n\n\n<p>Most people don’t know those steps and many probably aren’t even aware their AirPods have gotten an update since the day they bought them. I wonder how many people even know how to check which firmware their AirPods are on. (On an iPhone or iPad, go to the Settings app, tap Bluetooth, then tap the info button (“i”) next to the name of your AirPods. Then on the next screen, scroll down to the About section to find the firmware version. On a Mac, go to System Preferences or System Settings, click Bluetooth, then tap the info button next to the name of your AirPods.)</p>\n\n\n\n<p>And it’s even worse if you don’t have an Apple device. While Apple has an Android app to update Beats headphones, AirPods users on Windows PCs or Android phones can’t update their AirPods even if they know they need to. Instead, Apple tells them to head over to an Apple Store to get the latest firmware, which they probably wouldn’t even know was there in the first place. Granted, that’s probably not a large pool of users, but if you’re going to sell your product to people who don’t have an Apple device, there should be a way to update it without making an appointment and driving to an Apple Store.</p>\n\n\n\n<p>Updates to earbuds certainly aren’t as important as those for an iPhone, Mac, or Watch, but they shouldn’t be a black hole either. AirPods updates aren’t all bug fixes and other improvements—just this week <a href=\"https://www.macworld.com/article/1808634/airpods-firmware-update-5e133-bluetooth-security-flaw.html\">Apple disclosed</a> that the April update fixed a Bluetooth flaw that could allow an attacker to gain access to your earbuds. And occasionally there are new features, such as Spatial Audio and Conversation Boost, that need to be added after purchase. I wonder how many AirPods Pro users never even realized they got those new features because Apple didn’t tell them.</p>\n\n\n\n<p>With three models and hundreds of millions of devices in use, Apple’s AirPods are no longer a niche product—and they’re certainly more popular than the HomePod, which has an easy updating method through the Home app. Ahead of iOS 17, Apple just <a href=\"https://www.macworld.com/article/1782726/macos-watchos-beta-process-profiles-apple-id.html\">streamlined the process</a> of installing betas by tying them to Apple IDs and eliminating the arduous process of installing profiles. It’s about time Apple did the same for AirPods updates.</p>\n\nHeadphones</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"55e17211386f5b25628d0c2cad458fd3fe74642fc9c5079a7a9a79af1856554a","category":"Apple"}