{"title":"watchOS 10: Top Five New Features","link":"https://www.macrumors.com/2023/06/29/watchos-10-top-5-features/","date":1688055761000,"content":"Alongside <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a>, tvOS 17, and <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">macOS Sonoma</a>, Apple is also introducing <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a>, and it brings some of the biggest updates we've seen to watchOS in years. We've got five reasons why it's going to be worth installing ‌watchOS 10‌ when it launches this fall.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\n<ol>\r<br />\n \t<li><strong>Redesigned Apps</strong> - Apple has overhauled almost all of the stock watchOS apps with a new design language that takes up more of the screen and offers more information at a glance. The Activity app, for example, has new views that show in-depth information on calories burned, workout minutes, and more. The Heart Rate app has a pulsating heart and your current BPM, and the Weather app makes it easier to see the temperature and other conditions you care about. <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a>, Podcasts, News, Music, Mail, Calendar, <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, and tons more apps got updates.</li>\r<br />\n \t<li><strong>Smart Stack</strong> - <a href=\"https://www.macrumors.com/guide/home-screen/\">Widgets</a> are a major focus in ‌watchOS 10‌, with Apple offering a new \"Smart Stack\" of widgets that can be accessed by turning the Digital Crown. The Smart Stack displays widgets that are relevant to your day, and you can customize what's there too. The Smart Stack gives quick access to everything from Activity and Calendar to Reminders, the Music app, Shortcuts, Wallet, and Workout.</li>\r<br />\n \t<li><strong>Control Center</strong> - In addition to Smart Stack for quick access to the functions you need most, Apple made it easier to get to the Control Center. Just press on the Side Button to open up Control Center in an app or at the <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a>.</li>\r<br />\n \t<li><strong>Watch Faces</strong> - There are two new watch faces, including Palette and Snoopy. Palette shifts through different colors throughout the day with a customizable color palette, and Snoopy features characters from the popular Peanuts cartoon like Snoopy and Woodstock. Snoopy is one of Apple's most sophisticated watch faces to date, with Snoopy and Woodstock interacting with the hands of the watch and animating in different positions based on the time of day, weather, and other factors.</li>\r<br />\n \t<li><strong>Mood Tracking</strong> - Both ‌watchOS 10‌ and ‌iOS 17‌ support a new mood tracking feature. On the Apple Watch, you can open up the Mindfulness app and choose the \"State of Mind\" option to log how you're feeling either at a specific moment during the day or for the overall day. You can scroll to select a mood like Pleasant, Neutral, or Unpleasant, and then you can narrow down the emotion you're feeling with Apple providing suggestions. From there, you can select what's impacting your mood, like relationship, work, community, friends, hobbies, and more. Information is aggregated in the Health app so you can see your mood over time and what influences how you feel.</li>\r<br />\n</ol>\r<br />\nThere are also new Workout app features for hikers and cyclists, along with quite a few other additions. To see a full rundown of what's available in ‌watchOS 10‌, <a href=\"https://www.macrumors.com/roundup/watchos-10/\">we have a dedicated watchOS 10 roundup</a>.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a>, <a href=\"https://www.macrumors.com/roundup/watchos-9/\">watchOS 9</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-programming.135\">Apple Programming</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/29/watchos-10-top-5-features/\">watchOS 10: Top Five New Features</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/watchos-10-top-five-new-features.2394587/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"55e185bb4d2ec6909e36f39583524724c04c9936fbcd4cf1b7ac53d657335a1c","category":"Apple"}