{"title":"Factors Influencing the Energy Consumption in a Building: Comparative Study between Two Different Climates","link":"https://www.preprints.org/manuscript/202405.1175/v1","date":1716011193000,"content":"The use of energy resources is essential to the survival and development of human civilization. However, inefficient energy use not only has an impact on the economy, but it also has a significant impact on climate change. Studying and analyzing the factors that increase energy consumption is crucial for improving energy management. The aim of this study is to analyze the factors influencing energy savings in a building taken as a study model under two different climatic conditions. Measurements of the building's energy performance were carried out using the EnergyPlus calculation engine, which enabled us to analyze the strengths of building parameters such as the number of lights, the equipment used, occupancy, temperature and the relationships between the factors influenced. EnergyPlus is an important software tool in the field of building energy efficiency, enabling the precise simulation of building energy consumption. Simulation scenarios based on actual consumption data carried out by researchers have made it possible to develop energy management strategies in buildings in order to optimize energy efficiency, and in particular to promote the thermal performance of these buildings. In the present work, EnergyPlus building energy simulation software is used to simulate the energy consumption of the building of the Faculty of Electrical Engineering at the \"Gheorghe Asachi\" Technical University in Iasi, in order to determine the factors influencing building energy consumption. It has been shown that occupancy and heating and cooling systems are the key factors influencing energy consumption in buildings. The advantage of this study is that it can be used to model the most influential factors in predicting future energy consumption in buildings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"55edaa7da8ccc1d4df1f8a0c94b9e3119bf7bb1101bfdd1b1f19fb52ea510b14","category":"Interdisciplinary"}