{"title":"Class Incremental Learning for Financial Data Streams and Two Classes of Methodologies","link":"https://www.preprints.org/manuscript/202409.1846/v1","date":1727171495000,"content":"Class Incremental Learning (CIL) has emerged as a vital machine learning paradigm, particularly suited for environments with continuous data streams, such as those encountered in the financial industry. CIL enables models to progressively acquire and accumulate new knowledge without retraining the entire dataset, making it highly efficient for dynamic financial markets. In this paper, we explore the application of CIL to financial data streams, where high-frequency, high-dimensional data, such as stock prices and cryptocurrency transactions, evolve rapidly. The challenges inherent in CIL, including catastrophic forgetting—where the model loses previously learned knowledge—and intransigence—where it resists learning new classes—are addressed through both regularization-based techniques and dynamic architecture expansion. We present a comprehensive analysis of the algorithms designed to mitigate these challenges and highlight their relevance in financial applications like algorithmic trading, portfolio management, risk assessment, and fraud detection. By demonstrating how CIL enables models to adapt to new market conditions and asset classes while retaining past knowledge, we illustrate its critical role in advancing real-time financial decision-making. Through a detailed examination of the methodologies and their applications, this paper aims to provide insights into the future of adaptive financial models using Class Incremental Learning. We have also summarized methodologies into a model optimization-based class and a data focused class.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"55f33a13729bd84e71b6d58406bc3de684256996ca0157a1bb9e0b0ce1a8d554","category":"Interdisciplinary"}