{"title":"Review: Androids is a developer commentary track for the Android 1.0 era","link":"https://arstechnica.com/?p=1786567","date":1628946053000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/android-interview-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/android-interview.jpg\">Enlarge</a> <span>/</span> Dozens of Android team members were interviewed for the book, I can only assume it looked like this.  (credit: Aurich Lawson / Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Android will go down in history as one of the most important software projects ever. Today, there are an astounding <a href=\"https://twitter.com/Google/status/1394719458921431040\">three billion</a> monthly active Android devices, and that number gets bigger every day. The OS popularized the way we get mobile notifications, pioneered the modern app store model, and basically killed the entire personal GPS industry when it launched Google Maps navigation. As Ars' resident <a href=\"https://arstechnica.com/gadgets/2016/10/building-android-a-40000-word-history-of-googles-mobile-os/\"><em>Android Historian</em></a>, I was thrilled to hear that Chet Haase, a longtime member of the Android team inside Google, was writing a book detailing the early days of Android development. We try our best to <a href=\"https://arstechnica.com/gadgets/2016/10/building-android-a-40000-word-history-of-googles-mobile-os/\">document Android</a> from the outside, but it's nothing compared to what the actual developers could tell us.</p>\n<p><i>Androids: The Team that Built the Android Operating System </i>is Haase's new book, and it's full of in-the-trenches stories from the people that made Android. Haase has been on the Android team since 2010, and he has pretty regularly been a major conduit between the public and whatever the Android team is working on. He often <a href=\"https://www.youtube.com/watch?v=td3Kd7fOROw\">takes the stage</a> at Google I/O to co-host what is basically the Android State of the Union address: the \"What's New in Android\" talk, which details all the new developer announcements. He co-hosts the weekly \"<a href=\"http://adbackstage.libsyn.com/\">Android Developers Backstage</a>\" podcast, and then there's his day job as an actual engineer on the Android graphics team.</p>\n<p>    </p></div><p><a href=\"https://arstechnica.com/?p=1786567#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1786567&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"55f33c9b8cdad06e9da0781006c286865c92cba4823f8d3cabd7d97a8c26b810","category":"Tech"}