{"title":"Apple Gets 36% of Google's Safari Search Revenue","link":"https://www.macrumors.com/2023/11/13/apple-google-safari-search-revenue/","date":1699900775000,"content":"As Google battles an antitrust lawsuit from the U.S. Department of Justice, secrets about its search deals with Apple have been leaking out. We previously learned that Google is paying Apple billions of dollars to be the primary search engine on Apple devices, and now, <a href=\"https://www.bloomberg.com/news/articles/2023-11-13/apple-gets-36-of-google-revenue-from-search-deal-witness-says\"><em>Bloomberg</em> has shared</a> the total percentage of Google's revenue that Apple earns.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/safari-google-search.jpg\" width=\"3024\" height=\"1964\" />\r<br />\nGoogle pays Apple 36 percent of the total revenue that it earns from searches conducted on the Safari browser on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and Mac, with the number shared by an economics expert testifying on Apple's behalf. According to <em>Bloomberg</em>, Google's main lawyer \"visibly cringed\" when the revenue data was shared, as it was meant to remain confidential.\r<br />\n\r<br />\nLast month, wealth management company Bernstein suggested that Apple is getting anywhere <a href=\"https://www.macrumors.com/2023/10/11/google-pays-apple-billions-default-search/\">from $18 billion to $20 billion</a> per year, representing somewhere around 15 percent of Apple's total annual operating profits.\r<br />\n\r<br />\nApple and Google have both worked to keep details in the antitrust lawsuit private, claiming that publicly sharing the information would \"undermine Google's competitive standing.\"\r<br />\n\r<br />\nGoogle has been the default search engine on Apple devices since 2002, though the agreement between the two tech companies has been revised multiple times. Apple earns a ton of money from the deal, while Google gets to be the default search option on the world's most popular smartphone.\r<br />\n\r<br />\nThe United States Department of Justice is investigating Google because it believes that Google has a search monopoly. Google's lucrative search engine deal with Apple has been a main focus of the legal battle, which is expected to last until the end of November.\r<br />\n\r<br />\nIn October, Microsoft CEO Satya Nadella said that the agreement between Apple and Google has made it impossible for other search engines like Bing to compete. \"You get up in the morning, you brush your teeth, and you search on Google,\" said Nadella. \"With that level of habit forming, the only way to change is by changing defaults.\"\r<br />\n\r<br />\nMicrosoft at one point approached Apple about buying Bing, which would have allowed Apple to create its own search engine, but <a href=\"https://www.macrumors.com/2023/09/28/microsoft-bing-acquisition-talks/\">Apple was not interested</a>. The company was concerned that Bing would not be able to compete with Google in \"quality and capabilities,\" and also, Apple had no motivation to lose out on the money that it earns from Google.\r<br />\n\r<br />\nApple services chief <a href=\"https://www.macrumors.com/guide/eddy-cue/\">Eddy Cue</a> <a href=\"https://www.macrumors.com/2023/09/26/apple-on-why-google-is-default-on-iphone/\">testified in the trial in October</a>, and he said that Google is the ‌iPhone‌'s default search engine because it is the best option. \"We make Google be the default search engine because we've always thought it was the best,\" Cue said. Apple has not been able to make changes to the arrangement because there is no \"valid alternative.\"\r<br />\n\r<br />\nWhile Google is the default search engine on Apple devices, users can opt to swap to Yahoo, Bing, DuckDuckGo, or Ecosia as an alternative, but doing so requires going into the Safari browser's settings.\r<br />\n\r<br />\nIf Google loses the antitrust lawsuit, and there is a chance that could happen, the deal between Apple and Google could be dissolved. Apple could be pushed into allowing customers to choose a search engine option when setting up an Apple device rather than having Google set as the default.\r<br />\n\r<br />\nLosing out on billions of dollars from Google could potentially be the catalyst Apple needs to develop its own search engine, and Apple has indeed considered <a href=\"https://www.macrumors.com/2022/12/19/apple-to-launch-search-engine-to-rival-google/\">building a search solution</a>. Apple's AI chief John Giannandrea runs a search team within Apple, and that team has developed a next-generation search engine for Apple apps that could potentially serve as the basis for a full Google Search alternative.\r<br />\n\r<br />\nShould the Google/Apple deal come to an end, it could be several years before changes are required. A decision in the lawsuit won't come for some time, and once its does, we can expect a lengthy appeals process if it does not go Google's way.<div>Tag: <a href=\"https://www.macrumors.com/guide/google/\">Google</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/13/apple-google-safari-search-revenue/\">Apple Gets 36% of Google's Safari Search Revenue</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-gets-36-of-googles-safari-search-revenue.2410862/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"56009a84be7853e6a07a5f0a029cc3027fdcd64e18b72113cf4d6559c4782d63","category":"Apple"}