{"title":"New iPad Pro Reviews: Mini-LED Display Looks Great, M1 Performance Held Back by iPadOS","link":"https://www.macrumors.com/review/m1-ipad-pro/","date":1621429714000,"content":"The embargo has lifted on reviews of Apple's new iPad Pro, providing a hands-on look at the device before orders beginning arriving to customers this Friday. Key new features include Apple's custom M1 chip for impressive performance improvements, a brighter mini-LED display on the 12.9-inch model, Thunderbolt 3 support, and 5G on cellular models.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/ipad-pro-m1.jpeg\" />\r\n<br />\r\n<a href=\"https://www.theverge.com/22442084/ipad-pro-2021-review-features-screen-mini-led-m1-processor\"><em>The Verge</em>'s Dieter Bohn said</a> the mini-LED display on the 12.9-inch iPad Pro is a \"dream screen\" and functionally equivalent to a high-end OLED TV to his eyes:<blockquote>The joke I've been telling people is that the display is so good that Tenet actually makes sense when you watch it on this iPad Pro. HDR content is incredible on this screen. I am not a display quality enthusiast, but this screen is functionally equivalent to a high-end OLED TV to my eyes, especially in a dark room.</blockquote>While the new iPad Pro is <a href=\"https://www.macrumors.com/2021/05/11/m1-ipad-pro-benchmarks/\">around 50% faster than the previous generation model</a> with the A12Z chip, some reviewers believe this impressive performance improvement is held back by the iPadOS operating system.\r\n<br />\r\n\r\n<br />\r\n<a href=\"https://gizmodo.com/the-ipad-pro-is-as-powerful-as-it-can-be-now-what-1846914479\">Caitlin McGarry at <em>Gizmodo</em></a>:<blockquote>The iPad's hardware is a non-issue at this point. Apple's tablet gets better with every iteration, and the M1 iPad with miniLED display is truly impressive. There are no other tablets that can compare.\r\n<br />\r\n\r\n<br />\r\nBut the iPad Pro isn't competing against other tablets. It's competing against the Mac. And though the iPad is very, very capable, its software often feels hamstrung compared to the Mac's. I give this example all the time, but my most-used app is Airtable, a project management tool I use for my job all day every day. The iPad app looks and works perfectly, just like the Mac app, until I have to do a random task and it boots me to Airtable on the web, which would never happen on the Mac.</blockquote><a href=\"https://www.cnet.com/news/apple-ipad-pro-review-m1-plus-5g-make-for-an-almost-perfect-tablet\"><em>CNET</em>'s Scott Stein said</a> iPadOS's limitations extend to the iPad Pro's new Thunderbolt 3 support:<blockquote>Monitor support is a big example. The iPad Pro can only use an external monitor for apps that choose to support it, which is limited now to some games, video-editing tools... and that's mostly it. It doesn't extend your iPad to a second desktop area, or allow multiple apps on different screens. This is what you'd expect monitor support on an M1-equipped iPad would add, and yet here we are. Apple's developers conference (WWDC) is weeks away, and should reveal where the next iPadOS is heading. I'd expect big changes for the M1 iPad to be announced, but it's hard to predict anything yet.</blockquote><a href=\"https://sixcolors.com/post/2021/05/2021-ipad-pro-review/\">Jason Snell at <em>Six Colors</em> said</a> 5G support on cellular models is a \"big deal\" if you live in an area with mmWave 5G coverage:<blockquote>I know that 5G is an eye-roll-worthy buzzword and that in most parts of the country 5G isn't too much faster than 4G if you can even find it.\r\n<br />\r\n\r\n<br />\r\nHowever, if you're lucky enough to live somewhere with high-speed millimeter-wave 5G available, you will find that it enables broadband-like data rates. Apple made a big deal about 5G on the iPhone, but I think the iPad Pro is a better fit since it's a device you’re more likely to use for applications that require that level of bandwidth. I went to San Francisco's Marina district and while sitting on a bench next to the Palace of Fine Arts, downloading data at two or three gigabits. My home cable connection theoretically offers one gigabit, and I almost never see speeds that approach it. If you're someone who frequently works on an iPad in an area covered with the ultra-fast form of 5G, this will be a big deal.</blockquote><a href=\"https://www.loopinsight.com/2021/05/19/ipad-pro-m1-review/\"><em>The Loop</em>'s Jim Dalrymple said</a> one of his favorite new features on the iPad Pro is Center Stage. Enabled by the iPad Pro's new Ultra Wide front camera, Center Stage automatically keeps users perfectly framed during video calls:<blockquote>One of the features I love the most on the iPad Pro is Center Stage. Using the TrueDepth camera system, a new 12MP Ultra Wide front camera, and the machine learning capabilities of M1, Center Stage allows users to move around while using FaceTime, and the camera will keep them centered in the frame. It's pretty amazing to see it in action.\r\n<br />\r\n\r\n<br />\r\nI started a FaceTime call seated at a desk, I stood up and took a step back, and the camera zoomed out a little to make sure I was in the frame. As I walked back and forth, the camera would pan side to side, following my movements, always keeping me in the center of the window (except if I went to the extreme side). If someone else comes into the frame, it will zoom out, ensuring that the camera can see both people in the frame.</blockquote><h3>More Reviews</h3><ul><li><a href=\"https://www.macstories.net/stories/ipad-pro-2021-review/\">Federico Viticci at <em>MacStories</em></a></li>\r\n<br />\r\n<li><a href=\"https://www.cnn.com/2021/05/19/cnn-underscored/apple-ipad-pro-5th-generation-review/index.html\">Jake Krol at <em>CNN Underscored</em></a></li>\r\n<br />\r\n<li><a href=\"https://www.cnbc.com/2021/05/19/apple-12point9-inch-ipad-pro-2021-review-the-best-ipad-you-can-buy.html\">Todd Haselton at <em>CNBC</em></a></li>\r\n<br />\r\n<li><a href=\"https://www.imore.com/ipad-pro-2021-review\">Daniel Bader at <em>iMore</em></a></li>\r\n<br />\r\n<li><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/ipad-pro-review-apple-5g-display-b1850125.html\">David Phelan at <em>The Independent</em></a></li>\r\n<br />\r\n<li><a href=\"https://www.wsj.com/articles/apples-new-ipad-pro-vs-macbook-air-the-best-m1-device-for-you-11621429204\">Nicole Nguyen at <em>The Wall Street Journal</em></a></li></ul><h3>Video Reviews and Unboxings</h3>\r\n<br />\r\n<div></div>\r\n<br />\r\n<div></div>\r\n<br />\r\n<div></div>\r\n<br />\r\n<div></div>\r\n<br />\r\n<div></div>\r\n<br />\r\nCheck out our <a href=\"https://www.macrumors.com/2021/05/19/ipad-pro-unboxing-videos/\">complete roundup of iPad Pro unboxing videos</a>.\r\n<br />\r\n\r\n<br />\r\nThe new iPad Pro became available to order starting April 30, and orders will begin arriving to customers on May 21.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/reviews/\">reviews</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#11-iPad-Pro\">11\" iPad Pro (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#12-9-iPad-Pro\">12.9\" iPad Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ipad.137\">iPad</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/m1-ipad-pro/\">New iPad Pro Reviews: Mini-LED Display Looks Great, M1 Performance Held Back by iPadOS</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/new-ipad-pro-reviews-mini-led-display-looks-great-m1-performance-held-back-by-ipados.2296770/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=r67xRYleidE:N4oCDl39_iM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=r67xRYleidE:N4oCDl39_iM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/r67xRYleidE\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"560385f426f0aa78c36227d964e221ff18538f02e66aa7d85449d90a4c4efada","category":"Apple"}