{"title":"Vrba was right: Historical climate fragmentation, and not current climate, explains mammal biogeography","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17339?af=R","date":1716879600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/a3d7efa4-8d1d-4341-ad9e-9643ea4e8b48/gcb17339-toc-0001-m.png\" alt=\"Vrba was right: Historical climate fragmentation, and not current climate, explains mammal biogeography\" />\n<p>This study explores how past climate changes have influenced species distribution. We found that regions with more historical climate variation have more specialist species, while generalist species decrease. This effect is stronger than the link between current climate and species richness. These findings support the idea that past climate changes play a big role in shaping where species live.</p>\n<br />\n<h2>Abstract</h2>\n<p>Climate plays a crucial role in shaping species distribution and evolution over time. Dr Vrba's Resource-Use hypothesis posited that zones at the extremes of temperature and precipitation conditions should host a greater number of climate specialist species than other zones because of higher historical fragmentation. Here, we tested this hypothesis by examining climate-induced fragmentation over the past 5 million years. Our findings revealed that, as stated by Vrba, the number of climate specialist species increases with historical regional climate fragmentation, whereas climate generalist species richness decreases. This relationship is approximately 40% stronger than the correlation between current climate and species richness for climate specialist species and 77% stronger for generalist species. These evidences suggest that the effect of climate historical fragmentation is more significant than that of current climate conditions in explaining mammal biogeography. These results provide empirical support for the role of historical climate fragmentation and physiography in shaping the distribution and evolution of life on Earth.</p>","author":"Sara Gamboa, \nSofía Galván, \nSara Varela","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"5605e5a1ef54d75c15a539318c80ef5d41e17c0b81c6657d1ade47c352f2e9f0","category":"Environment"}