{"title":"Predicting the potential global distribution of <i>Ixodes pacificus</i> under climate change","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309367","date":1724767200000,"content":"<p>by Fengfeng Li, Qunzheng Mu, Delong Ma, Qunhong Wu</p>\r\n\r\nIn order to predict the global potential distribution range of <i>Ixodes pacificus</i> (<i>I</i>. <i>pacificus</i>) under different climate scenario models in the future, analyze the major climate factors affecting its distribution, and provide references for the transformation of passive vector surveillance into active vector surveillance, the maximum entropy model (MaxEnt) was used in this study to estimate the global potential distribution range of <i>I</i>. <i>pacificus</i> under historical climate scenarios and different future climate scenarios. The global distribution data of <i>I</i>. <i>pacificus</i> were screened by ENMtools and ArcGIS 10.8 software, and a total of 563 distribution data of <i>I</i>. <i>pacificus</i> were obtained. Maxent 3.4.1 and R 4.0.3 were used to screen climate variables according to the contribution rate of environmental variables, knife cutting method and correlation analysis of variables. R 4.0.3 was used to calculate model regulation frequency doubling and feature combination to adjust MaxEnt parameters. The model results showed that the training omission rate was in good agreement with the theoretical omission rate, and the area under ROC curve (AUC) value of the model was 0.978. Among the included environmental variables, the Tmin2 (minimum temperature in February) and Prec1 (precipitation in January) contributed the most to the model, providing more effective information for the distribution of <i>I</i>. <i>pacificus</i>. MaxEnt model revealed that the distribution range of <i>I</i>. <i>pacificus</i> was dynamically changing. The main potential suitable areas are distributed in North America, South America, Europe, Oceania and Asia. Under the future climate scenario model, the potential suitable areas show a downward trend, but the countries and regions ieeeeeeenvolved in the suitable areas do not change much. Therefore, the invasion risk of the potential suitable area of <i>I</i>. <i>pacificus</i> should be paid attention to.","author":"Fengfeng Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"560ce1845f69361d7c7ff12e2613bccee4cfa10ec4ae0dd56f64fbb8e1983b2c","category":"Interdisciplinary"}