{"title":"Pro tech: Five ways Taco Van Der Hoorn optimised his way to a Giro stage win","link":"https://www.bikeradar.com/features/pro-bike/taco-van-der-hoorn-bike/","date":1620747225000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/GettyImages-1317292728-5681dc3.jpg?quality=45&amp;resize=620,413\" />                                            <p>It’s rare to see a lone breakaway rider outfox the peloton on a sprint stage at a Grand Tour, so it was fantastic to see Taco Van Der Hoorn (what a great name, by the way) of Team Intermarché – Wanty – Gobert Matériaux take a win on stage three of the 2021 Giro d’Italia.</p>\n<p>To understand why events like this are so rare, you simply need to consider the maths.</p>\n<p>How can one rider overcome the collective strength of the teams working together to bring everything back together in time for a sprint finish? On the face of it, it’s an almost impossible task.</p>\n<p>Tactics played a big role, of course, and Van Der Hoorn expertly exploited the brinkmanship taking place between the top sprint teams. It also looked very much like the peloton underestimated the Dutch rider’s strength, giving him too much leeway without realising he had the firepower to make the move stick.</p>\n<p>It was also an exciting victory for us tech nerds, though, because Van Der Hoorn was using a highly optimised clothing and bike setup.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> While Taco Van Der Hoorn celebrates the biggest win of his career, we take the time to revel in every nerdy detail of his bike and setup.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>With a final gap of just four seconds over the chasing peloton, I’d argue those optimisations were absolutely crucial to his victory.</p>\n<p>To make it clear, that’s not to take anything away from his physical performance, which was clearly immense. But racing is about combining brains and brawn, and Van Der Hoorn clearly has both in spades.</p>\n<p>So, let’s take a look at five key optimisations that Van Der Hoorn used to give himself the fastest possible setup.</p>\n<h2>1. Body position</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Van Der Hoorn rides with a super-narrow and aerodynamically efficient position.</span></figcaption><span> <i>Luca Bettini / Getty Images</i></span></div>\n<p>The rider is the biggest cause of aerodynamic drag in the rider plus bike system, accounting for <a href=\"https://www.bikeradar.com/advice/buyers-guides/time-trial-bikes/\">around 80 per cent of the total</a>.</p>\n<p>Anything you can do to improve the way the air flows over your body can, therefore, make a significant difference to how much power is required to ride at a given speed. In other words, if you can make your body more aero, you’ll be able to ride faster for the same effort.</p>\n<p>Van Der Hoorn has clearly done his research, because his position of riding in a tucked down position, with his hands on the hoods and forearms parallel to the ground, is one of the fastest positions available on a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bike</a>.</p>\n<p>When <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-faster-without-pedaling-harder/\">we tested this position in a velodrome</a>, back in 2017, we found it saved a whopping 94 watts when riding at 45kph, versus riding with straight arms on the hoods. #AeroGainz don’t come much bigger than that.</p>\n<p>Turning the brake levers in, to enable a narrower hand position, is also something we’re increasingly seeing throughout pro cycling.</p>\n<p>You can see how much more narrow Van Der Hoorn’s arms are compared to his breakaway companions, and narrow equals fast as it reduces your frontal aera.</p>\n<p>According to Xavier Disley of <a href=\"https://www.bikeradar.com/news/aerocoach-tri-bars/\">AeroCoach</a>, each 10mm narrower you go at your <a href=\"https://www.bikeradar.com/features/road-bike-handlebars-guide-how-to-choose-the-right-ones/\">handlebars</a> typically saves around 2 watts at 45kph. So, swapping from 42cm to 38cm handlebars potentially represents a saving of 8 watts – similar to going from a deep-section rear wheel to a disc wheel.</p>\n<h2>2. Aero clothing</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> If you look closely, you can see Van Der Hoorn is wearing a one-piece skinsuit.</span></figcaption><span> <i>Stuart Franklin / Getty Images</i></span></div>\n<p>Part two of optimising the aerodynamics of your body is aero clothing and kit, and again, Van Der Hoorn has been meticulous in his clothing choices.</p>\n<p>The big ticket item is his speedsuit.</p>\n<p>Made by <a href=\"https://www.bikeradar.com/features/first-look-friday/nopinz-subzero-indoor-cycling-kit/\">NoPinz</a> – the British company that invented the <a href=\"https://www.bikeradar.com/features/first-look-friday/poc-tempor-helmet/\">aero race number pocket</a> – it’s constructed more like a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-your-best-ever-time-trial/\">time trial</a> skinsuit than a separate set of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-shorts/\">bib shorts</a> and a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-jerseys/\">summer jersey</a>, with both halves of the garment sewn together to reduce drag. It also uses fabrics designed to be skin tight and aerodynamically efficient at race speeds.</p>\n<p>On top of this, Van Der Hoorn was also using aero <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-overshoes/\">overshoes</a>, like those we would normally see used for time trials, and earlier in the day, he was wearing arm warmers made out of an aerodynamic fabric too.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Van Der Hoorn appeared to be wearing arm warmers made from an aero fabric earlier in the day, along with aero overshoes.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p>When it comes to saving energy for that big attack, every little helps and it starts right from kilometre 0.</p>\n<p>How much difference does aero clothing make? Well, Specialized reckons its Evade GC road racing skinsuit could save a rider <a href=\"https://www.bikeradar.com/news/specializeds-new-evade-gc-skinsuit-is-tight-enough-to-beat-the-clock/\">96 seconds over the course of 40km</a>, and our time in the wind tunnel suggests a speed suit could be worth <a href=\"https://www.bikeradar.com/features/tunnel-testing-clothing-pearl-izumis-ongoing-aero-design/\">more than 30 watts at 30mph</a> compared to normal cycling kit.</p>\n<p>Basically, it’s a lot.</p>\n<h2>3. Aero road helmet with taped vents</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> If you look beyond Van Der Hoorn’s disbelieving joyous face, you can spot the Dutch rider went as far as taping up his helmet vents.</span></figcaption><span> <i>Luca Bettini / Getty Images</i></span></div>\n<p>On top of all this, Van Der Hoorn was wearing an aero <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-helmets/\">road helmet</a> and he’d even taken the time to tape over the vents on the front.</p>\n<p>While an aero road helmet is a decent drag-reducing tactic (the difference between a <a href=\"https://www.bikeradar.com/news/specialized-s-works-prevail-ii-vent-helmet/\">Specialized Prevail</a> and a <a href=\"https://www.bikeradar.com/reviews/helmets/road-cycling-helmets/specialized-s-works-evade-ii-aero-helmet-review/\">Specialized Evade</a> is apparently around 11 watts at 45kph), the latter detail may be a bit more hit and miss.</p>\n<p><a href=\"https://www.bikeradar.com/features/how-to-ruin-an-aero-road-helmet-dont-do-this/\">Our testing</a> has previously shown the aerodynamic performance of a road helmet is largely attributable to its shape, and simply covering the vents doesn’t always do the trick. Perhaps Van Der Hoorn has tested it himself, though, and found it to be faster for his personal setup.</p>\n<h2>4. Aero bike</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Cube Litening SLT C:68X is a highly accomplished race-ready rig. (This is a SRAM Red eTap AXS-equipped bike we’ve reviewed, whereas Van Der Hoorn rides a bike with Shimano Dura-Ace Di2 and in team colours, of course.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>Continuing on the ‘aero is everything’ theme, Van Der Hoorn was also riding a full-on aero road bike, the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cube-litening-c68x-slt-review/\">Cube Litening C:68X</a>, which is said to reduce aerodynamic drag by 30 per cent compared to the previous, <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cube-litening-c68-slt-disc-review/\">non-aero-optimised Cube Litening</a>.</p>\n<p>The bike features aero-optimised tubes, fully hidden cables and a slippery integrated handlebar and stem.</p>\n<p>Though the body is the largest contributor to aerodynamic drag, the bike accounts for around 20 per cent of total drag, so it still matters.</p>\n<p>Every bike is different, of course, but when <a href=\"https://www.bikeradar.com/brand/cannondale/\">Cannondale</a> launched its <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cannondale-systemsix-hi-mod-dura-ace-di2-review/\">SystemSix aero road bike</a>, it claimed the bike could save around 50 watts at 48kph, compared to “a modern lightweight road bike” (presumably the old, <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cannondale-supersix-evo-hi-mod-team-review/\">round-tubed Cannondale SuperSix</a>), which apparently equates to about 3 seconds per kilometre.</p>\n<p>Again, it’s potentially a fairly big gain.</p>\n<h2>5. Tubeless aero wheels and tyres</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Van Der Hoorn of Netherlands used a set of Continental GP5000 TL tubeless tyres.</span></figcaption><span> <i>Stuart Franklin / Getty Images</i></span></div>\n<p>Last but certainly not least, Van Der Hoorn’s bike was also shod with Newmen carbon aero wheels and <a href=\"https://www.bikeradar.com/reviews/components/tyres/road-bike-tyres/continental-gp5000-tl-tyre-review/\">Continental GP5000 TL tyres</a>, the latter (some of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-tubeless-road-tyres/\">best tubeless tyres</a> we’ve ridden) potentially offering a measurable improvement in rolling resistance compared to the tubular tyres still popular with many in the pro peloton.</p>\n<p>It’s far from the lightest bike setup available, but weight isn’t of primary importance on a rolling day like yesterday. Reducing aerodynamic drag and rolling resistance will have led to a much greater performance improvement than any marginal reduction in weight.</p>\n<ul><li><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">Best road bike tyres</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">Best road bike wheels</a></li>\n</ul>","author":"Simon Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"5623a7806bea579d8685d2427b4cde3b9bd044ced543c0a9d2259fc0143bfa3f","category":"Cycling"}