{"title":"Impacts of wet treatment on leaching toxicity of municipal solid waste incineration bottom ash","link":"http://link.springer.com/10.1007/s13762-023-05402-w","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Wet treatment is usually employed to recover metals from bottom ash. However, its effectiveness on regulating the leaching behavior of bottom ash and minimizing environmental impact is still unquantified when it is used as engineering materials. This study characterized the leaching toxicity of targeted pollutants including Cu, Zn, Ni, SO<sub>4</sub><sup>2−</sup> and Cl<sup>−</sup> in fresh bottom ash and treated bottom ash using batch, standard column up-flow leaching and simulated rainfall down-flow leaching tests. Results from the batch leaching revealed that the potential environmental risk of fresh bottom ash could not be ignored, and the leaching concentrations of the targeted pollutants in fresh bottom ash are generally higher than those of treated bottom ash. The washing process significantly promoted the release of pollutants: This behavior was due both to the increase in surface area and the release of contaminants into water. Furthermore, when bottom ash was applied in water dynamic system such as rainfall environment, its toxicity leaching should be paid more attention onto the early leaching stage with a high release of water dissolved salts, Cl<sup>−</sup> and SO<sub>4</sub><sup>2−</sup>. The leaching concentration of Cu particularly exceeded the limit value before the liquid-to-solid (<em>L</em>/<em>S</em>) ratio = 1. Meanwhile, it was also noted that the leaching of SO<sub>4</sub><sup>2−</sup>, Ni, Cu and Zn in water dynamic system were directly proportionate to <em>L</em>/<em>S</em> ratio. The leaching concentration of the targeted pollutants obtained from the simulate rainfall down-flow tests was 4–6 times higher than those from the standard up-flow column when at the same ratio of liquid and solid.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"562addc329e014f064a277a225a1a0c01611d390fa88d9e599b94adf26938797","category":"Environment"}