{"title":"Preclinical Validation of MIN-T: A Novel Controlled-Released Formulation for the Adjunctive Local Application of Minocycline in Periodontitis","link":"https://www.preprints.org/manuscript/202409.0433/v1","date":1725532121000,"content":"Adjunctive treatment of periodontitis lacks solutions allowing enough time for wound healing in the periodontal pockets by avoiding a fast re-colonization. Such a solution might be an antibiotic containing formulation with a controlled release over weeks. Here, a recently described minocycline containing approach is qualified for further clinical development by focusing on proof-of-concept, systemic burden, resistance development and degradation studies. Animal studies were done in two different (mouse-chamber, rat Porphyromonas gingivalis challenging) models, including effects on inflammation markers, bone loss and bone structure. Also, serum concentrations of minocycline after local application were determined by HPLC-MS/MS. The resistance status of bacterial clinical isolates against minocycline was investigated and the degradation of the formulation was characterized by laser scanning- and scanning electron microscopy. Animal studies clearly demonstrated the applicability of the new formulation in the investigated models. Inflammation markers decreased dosage dependent and reduced bone loss compared to non-treated group was observed. Thereby, the systemic burden of the antibiotic was neglectable. Minocycline is still effective against oral pathogens; resistance development was not seen. The biodegradable thread was first swollen and subsequently degraded over weeks. The results support the continued clinical development of this new formulation. A phase I clinical trial is planned to further evaluate its safety and efficacy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5631b9b103df5eb01b60fc329496e0e0e3f598a0d3a658e2fdb5aeb409a851cb","category":"Interdisciplinary"}