{"title":"An Evaluation of the Effectiveness of Refractive Loupes as an Intervention to Prevent Chronic Neck and Back Pain in Undergraduate Dental Students &ndash; a Longitudinal Study","link":"https://www.preprints.org/manuscript/202410.0904/v1","date":1728647247000,"content":"Chronic neck and back pain is prevalent among dental professionals, stemming from the static and often awkward positions required during clinical practice. This longitudinal study investigates the effectiveness of Refractive loupes, an ergonomic intervention, in mitigating such musculoskeletal issues among undergraduate dental students. Despite being advocated for posture improvement, traditional loupes may exacerbate neck pain due to prolonged static neck positions. However, the impact of ergonomic loupes, designed to maintain neutral neck positions, remains unexplored.This study enrolled undergraduate dental students from the UK and Australia, provided them with Refractive loupes, and tracked their neck and back pain scores over two years. Participants completed pre- and post-intervention questionnaires assessing pain levels, posture, and loupe use history. Results indicate a significant reduction in pain incidence (15.5%) post-refractive use, with 30.6% of participants reporting pain at the study's end compared to 46.1% at the beginning of the study. Notably, 92.3% reported improved posture ratings despite 39.1% experiencing increased pain, suggesting additional factors contributing to pain development beyond posture alone.Further analysis reveals that later adoption of Refractive loupes correlates with increased pain, suggesting a potential preventive benefit if initiated earlier in dental education. Additionally, a comparison of traditional loupe users with their non-loupe-using counterparts indicates more significant pain reduction among the loupe-using cohort post-refractive use, highlighting the need for more extensive studies in this area.In conclusion, Refractive loupes effectively reduce musculoskeletal pain among undergraduate dental students. Nevertheless, challenges persist, warranting continued research into optimal intervention timing and the role of the loupe type used in pain mitigation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"56335075b1dde3427ac37e2e7c4a57ca08ef300f832aef70f3099703227914e0","category":"Interdisciplinary"}