{"title":"Imprinting but not cytonuclear interactions determines seed size heterosis in Arabidopsis hybrids","link":"https://academic.oup.com/plphys/article/195/2/1214/7601550?rss=1","date":1707177600000,"content":"<span><div>Abstract</div>The parent-of-origin effect on seeds can result from imprinting (unequal expression of paternal and maternal alleles) or combinational effects between cytoplasmic and nuclear genomes, but their relative contributions remain unknown. To discern these confounding factors, we produced cytoplasmic–nuclear substitution (CNS) lines using recurrent backcrossing in Arabidopsis (<span>Arabidopsis thaliana</span>) ecotypes Col-0 and C24. These CNS lines differed only in the nuclear genome (imprinting) or cytoplasm. The CNS reciprocal hybrids with the same cytoplasm displayed ∼20% seed size difference, whereas the seed size was similar between the reciprocal hybrids with fixed imprinting. Transcriptome analyses in the endosperm of CNS hybrids using laser-capture microdissection identified 104 maternally expressed genes (MEGs) and 90 paternally expressed genes (PEGs). These imprinted genes were involved in pectin catabolism and cell wall modification in the endosperm. <span>Homeodomain Glabrous9</span> (<span>HDG9</span>), an epiallele and one of 11 cross-specific imprinted genes, affected seed size. In the embryo, there were a handful of imprinted genes in the CNS hybrids but only 1 was expressed at higher levels than in the endosperm. <span>AT4G13495</span> was found to encode a long-noncoding RNA (lncRNA), but no obvious seed phenotype was observed in lncRNA knockout lines. <span>Nuclear RNA Polymerase D1</span> (<span>NRPD1</span>), encoding the largest subunit of RNA Pol IV, was involved in the biogenesis of small interfering RNAs. Seed size and embryos were larger in the cross using <span>nrpd1</span> as the maternal parent than in the reciprocal cross, supporting a role of the maternal <span>NRPD1</span> allele in seed development. Although limited ecotypes were tested, these results suggest that imprinting and the maternal <span>NRPD1</span>-mediated small RNA pathway play roles in seed size heterosis in plant hybrids.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"5646126b01b51f2f4598a5c9f8ff1d613d9f2f234d94c268dc413ea1bfbbf9e7","category":"Environment"}