{"title":"Isolation and purification of flavonoids from quinoa whole grain and its inhibitory effect on lipid accumulation in nonalcoholic fatty liver disease by inhibiting the expression of CD36 and FASN","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13923?af=R","date":1726902850000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Nonalcoholic fatty liver disease (NAFLD), a chronic metabolic disorder marked by excessive lipid deposition, represents a considerable health burden with no established efficacious treatment strategy. Quinoa (<i>Chenopodium quinoa</i> Willd.), valued for its health benefits, is replete with flavonoid bioactives. The aims of this work are to isolate and purify flavonoids from quinoa whole grain that can intervene in NAFLD and to elucidate some of the underlying mechanisms.</p>\n<h2>RESULTS</h2>\n<p><i>Chenopodium quinoa</i> Willd. flavonoids (CQWF) were obtained successfully through an optimized ultrasonic extraction methodology, followed by isolation and purification utilizing macroporous resin D101. The study then explored the therapeutic potential of CQWF and its eluted fractions in models emulating NAFLD conditions: an <i>in vitro</i> fatty liver cell model induced by oleic acid (OA) and palmitic acid (PA) in the HepG2 and BEL-7402 cell lines, and an <i>in vivo</i> high-fat diet (HFD)-induced NAFLD model in C57BL/6N mice. The findings revealed a comprehensive mitigating effect of CQWF30 on NAFLD, manifesting in reduced intracellular lipid accumulation in steatotic hepatocytes and a concerted downregulation of key lipid metabolism genes, <i>CD36</i> and <i>FASN</i>. Administration of CQWF30 reduced triglyceride (TG) levels in both the cellular model and the livers of HFD-fed mice. It also reduced serum concentrations of TG, total cholesterol (T-CHO), low-density lipoprotein cholesterol (LDL-C), aspartate aminotransferase (AST), and alanine aminotransferase (ALT), while increasing high-density lipoprotein cholesterol (HDL-C) in the mice.</p>\n<h2>CONCLUSION</h2>\n<p>These results highlighted the promising therapeutic capacity of CQWF, particularly CQWF30. This research advances the exploration and utilization of flavonoids derived from quinoa whole grain, providing innovative dietary intervention strategies for NAFLD. © 2024 Society of Chemical Industry.</p>","author":"Xiaoqin La, \nZhaoyan Zhang, \nJingyi Liang, \nHanqing Li, \nYan Pang, \nXiaoting He, \nYurui Kang, \nChangxin Wu, \nZhuoyu Li","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"564942319c468dc41e6f0adc9f6f06b6e27bc84fc1f02bd0eb107ca18137fe70","category":"Environment"}