{"title":"Usage of social media and Covid 19 vaccine hesitancy among medical students in Kericho County","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003529","date":1724335200000,"content":"<p>by Calvince Otieno Anino, Philip Sanga</p>\r\n\r\nThe recent Covid 19 pandemic revealed the global challenge posed by infectious diseases. Vaccines are a crucial tool in preventing pandemics, as evidenced by their success in controlling past outbreaks. The rise of information and communication technology has introduced social media platforms as potential game-changers in both preventing and managing future pandemics. However, these same platforms can also be a double-edged sword, hindering the uptake of essential vaccination services. This study investigated the association between social media use and vaccine hesitancy among medical students. The study was designed as an institution based cross sectional study of 423 medical students in Kenya Medical Training College and University of Kabianga in Kericho County. Stratified sampling was used to decide on the two institutions and systematic random sampling was used to select the study participants. Research administered questionnaires were used to collect data on the socio-demographic characteristics, use of social media platforms, social media campaigns, and uptake of Covid 19 vaccines. The collected data was analyzed using Statistical Package for Social Sciences version 25. Chi square was used to establish the association between the independent variables and uptake of Covid 19 vaccines. The variables that were significantly associated with hesitancy to Covid 19 vaccines were further analyzed using binary logistic regression. The confidence interval (CI) was set at 95% and statistical significance was considered at <i>p</i> &lt; 0.05. The study found significant associations between vaccine hesitancy and several factors, including academic level, preferred social media platform, the influence of social media on attitudes towards vaccines, concerns about vaccine safety and efficacy, and confidence in vaccines. The findings present social media as a potential platform for promotion of vaccines utilization during pandemics when used well.","author":"Calvince Otieno Anino","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"5654241eca4a83f78329fa5a128ac91bf3c5a7d3d05ec8612c3a8699aa2cf072","category":"Environment"}