{"title":"Apple Pays $163.34 Million in Licensing Fees for Songwriters and Publishers","link":"https://www.macrumors.com/2021/02/16/apple-pays-163-million-in-licensing-fees/","date":1613521199000,"content":"The Mechanical Licensing Collective <a href=\"https://themlc.com/press/mechanical-licensing-collective-receives-424-million-historical-unmatched-royalties-digital\">today announced</a> (via <a href=\"https://variety.com/2021/music/news/spotify-apple-425-million-royalties-1234908957/\"><em>Variety</em></a> that Apple and other digital service providers have paid a total of &#36;424,384,787 in historical unmatched royalty fees.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/apple-music.jpg\" alt=\"\" width=\"1652\" height=\"704\" class=\"aligncenter size-full wp-image-783994\" />\r\n<br/>\r\nOf that total, Apple paid &#36;163,338,890 which was the highest fee paid out. Spotify paid &#36;152,226,039, which marked the second highest payment. After that, Amazon paid &#36;42,741,507, and Google paid &#36;32,855,222. Other streaming services like Pandora, iHeart Media, SoundCloud, and Deezer paid smaller amounts.\r\n<br/>\r\n\r\n<br/>\r\nThe Mechanical Licensing Collective (MLC) that collected the funding is a nonprofit organization that was created in 2019 by the Music Modernization Act and designated by the U.S. Copyright office.\r\n<br/>\r\n\r\n<br/>\r\nStarting in January 2021, the MLC began providing blanket licenses to eligible streaming and download services in the United States. It collects royalties due under those licenses and then pays them out to songwriters, music publishers, and others to make sure creators are receiving the proper funds for their work. Prior to now, song-by-song licensing was used, making it difficult for streaming services to deliver the proper royalties to all those involved in a song's creation.\r\n<br/>\r\n\r\n<br/>\r\nThe back fees that were paid by streaming companies in January and February are related to the Music Modernization Act's limitation on liability for past infringement. Songwriters, music publishers, composers, and others have long struggled to be paid by streaming music services, which the MLC is meant to address. Music streaming providers also sent data linking royalties to creators, and the MLC's job will be to review and analyze the data provided by the streaming music companies to find and pay the proper copyright holders.\r\n<br/>\r\n\r\n<br/>\r\nSongwriters, composers, music publishers, and others will be able to register with the MLC to receive the payments that they're owed. The MLC will begin sending out payments in April.<blockquote>A total of 20 DSPs separately transferred accrued historical unmatched royalties to The MLC as required in order for them to seek the MMA's limitation on liability for past infringement. In addition to the accrued unmatched royalties transferred to The MLC, the DSPs concerned also delivered more than 1,800 data files, which contain in excess of 1.3 terabytes and nine billion lines of data.\r\n<br/>\r\n\r\n<br/>\r\nThe transfer of these monies represents the culmination of a months-long effort on the part of The MLC and these DSPs to develop and implement the specifications for these usage reports. With these historical unmatched royalties and usage reports now in hand, The MLC can begin the process of reviewing and analyzing the data in order to find and pay the proper copyright owners.</blockquote>\r\n<br/>\r\nGoing forward, music providers like Apple are required to send the MLC monthly usage data on streaming content along with the corresponding royalties, which the MLC will dole out. For unmatched royalties, the MLC <a href=\"https://portal.themlc.com/search\">maintains a database</a> that creators can search to see if they're due missing money.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/16/apple-pays-163-million-in-licensing-fees/\">Apple Pays &#36;163.34 Million in Licensing Fees for Songwriters and Publishers</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-pays-163-34-million-in-licensing-fees-for-songwriters-and-publishers.2284979/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0qG7g1U_VGE:CfPkszFh1Iw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0qG7g1U_VGE:CfPkszFh1Iw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/0qG7g1U_VGE\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"56554f46bf41e7ff1ebe8ef6757babec77e47b4b6416b12931fad8366d7ef62a","category":"Apple"}