{"title":"OSHA probes Amazon warehouse where workers died with no tornado shelter","link":"https://arstechnica.com/?p=1820579","date":1639504630000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1237165711-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1237165711.jpg\">Enlarge</a> <span>/</span> A first responder walks among the wreckage of a damaged Amazon warehouse on December 11, 2021, in Edwardsville, Illinois. (credit: Michael B. Thomas/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The federal Occupational Safety and Health Administration announced yesterday that it is opening an investigation into the deaths of six workers at an Amazon warehouse in Illinois that was struck by a massive tornado, one of more than 40 that ripped through the region over the weekend.</p>\n<p>Nearly half of the 1.1 million-square-foot building was demolished as winds as high as 150 mph (240 kph) tore through the structure. “The west-facing walls of the warehouse collapsed inward, which was followed by multiple structural failures as the tornado moved through the complex,” the National Weather Service <a href=\"https://www.weather.gov/lsx/12_10_2021\">said</a>.</p>\n<p>The first warnings came relatively early, at 8:06 pm and again at 8:16 pm, when the NWS issued tornado warnings. A \"warning\" means that a twister has been sighted or radar data suggests one will form. The NWS says that the tornado formed at 8:28 pm as an EF-0, the lowest on the scale, and quickly intensified to an EF-3 as it moved across Interstate 255. More than 20 minutes elapsed between the first warning and touchdown, <a href=\"https://www.usatoday.com/in-depth/news/nation/2021/06/16/tornado-warning-system-has-come-long-way-but-could-better/5152104001/\">over double</a> the average lead time.</p></div><p><a href=\"https://arstechnica.com/?p=1820579#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1820579&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5656731b2321041d0274ac6435f27bc00b54da33dc0d9138b9449a215e6f47bc","category":"Tech"}