{"title":"Optimising Disaster Resilience Through Advanced Risk Management and Financial Analysis of Critical Infrastructure in the Serbian Defence Industry","link":"https://www.preprints.org/manuscript/202407.1228/v1","date":1721119651000,"content":"This paper presents a comprehensive analysis of the financial factors and risk management strategies essential for optimizing disaster resilience within the Serbian defence industry's critical infrastructure. The significance of this sector is multi-faceted, impacting national security, economic stability, and technological advancement. Primarily, the Serbian defence industry ensures the preservation of vital defence interests, maintaining Serbia's independence from foreign sources for weapons and military equipment in both peacetime and wartime. Economically, it is a significant employer of the working-age population, directly affecting local employment rates, fostering economic development, and ensuring the sustainable growth of this crucial sector. This, in turn, stimulates broader economic activity and enhances social cohesion while strengthening the national balance of payments through increased export potential. From a technological perspective, the defence industry drives scientific, technological, and industrial development, reinforcing Serbia's global political and military standing within the Western Balkans and on the international stage. Consequently, the paper aims to examine the risk management and protection of the Serbian defence industry's critical infrastructure, offering concrete and actionable measures to improve and develop these systems with a particular emphasis on security. The research's utility and contribution lie in identifying similarities and differences in the operational performance of defence industry companies, a vital segment of the national economy. The presentation of these findings focuses on the protection of critical infrastructure. The results will form the basis for further investigation into the underlying causes of business performance and the effective management of critical infrastructure security.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"565805d199262b0a9f57a7e726e53872b5ba489e102cfdb395a9743264afeea4","category":"Interdisciplinary"}