{"title":"Advancing RCCI engine performance via optimal acetylene premix ratios and advanced diesel injection timing: An experimental investigation","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14375?af=R","date":1706865024000,"content":"<h2>Abstract</h2>\n<p>Reactivity controlled compression ignition (RCCI) stands out as an innovative combustion strategy, effectively reconciling stringent emission regulations with precise combustion management and optimal engine performance. In this research, the influence of injection timing of diesel, acting as highly reactive fuel (HRF), alongside variable premix ratios of acetylene, a low reactive fuel (LRF), operating within the RCCI framework has been investigated. In a first-of-its-kind attempt, with a thorough experimental design, the present investigation encompasses a progressive advancement of HRF injection timing, extending up to 110° CA bTDC with 20° CA increments, coupled with LRF integration at premix ratios of up to 70%. Optimal operational conditions materialize at an HRF injection timing advancement of 90° CA bTDC, complemented by a 40% LRF contribution. This configuration yields substantial gains, including a 28.2% upsurge in the cylinder pressure and an 18.6% elevation in the cylinder temperature compared to conventional diesel (CDC) operations. Additionally, the combustion process exhibits an advanced start of combustion (SoC) relative to the CDC baseline, with an 8.53% decline in heat release rate, at 40% LRF enrichment. Under optimal circumstances, moderate hydrocarbon (HC) emissions are noted, while smoke emissions experience a noteworthy reduction of 55.9%, all the while upholding overall output performance. A remarkable 69.8% peak increase in brake thermal efficiency is attained, underscoring the merits of judiciously advancing HRF injection timing and extending LRF utilization within the RCCI paradigm. Thus, the study underscores the synergistic potential between augmented HRF injection timing and controlled LRF integration, offering a promising avenue for elevating the RCCI approach.</p>","author":"Parthasarathi Deb, \nAbhishek Paul","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"565bbb12ea6843a116f999e3aff996f7c84688d6b9339e04cbc1dd619cfb69b8","category":"Environment"}