{"title":"Telegram Gains Group Video Calling and Screen Sharing Support","link":"https://www.macrumors.com/2021/06/28/telegram-gains-group-video-calling/","date":1624883044000,"content":"Telegram Messenger gained some <a href=\"https://telegram.org/blog/group-video-calls\">notable new features</a> over the weekend, including the ability to turn group voice chats into video calls, support for screen sharing, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/telegram-video.jpg\" />\r\n<br />\r\nFirst up, Telegram is touting the new group video calling feature as bringing \"voice chats to a whole new level, ready for online classes, business meetings, and family gatherings.\"\r\n<br />\r\n\r\n<br />\r\nTo turn a group voice chat into a group video call, users can tap the camera icon at the bottom of the screen. Tapping a participant's video makes it go fullscreen, and a pin icon in the top-right corner of the screen lets you pin the video, which makes it stay focused as new users join the call.\r\n<br />\r\n\r\n<br />\r\nTelegram notes that while audio-only participants are unlimited, video is currently available for the first 30 people who join the voice chat. However, this limit will increase soon \"as voice chats take on streaming games, live events and more.\" Screen sharing during a video chat is also straightforward, and appears as an option in the three-dot icon menu. \r\n<br />\r\n\r\n<br />\r\nThe encrypted chat app has also received improved noise suppression in voice chats, and the addition of a new toggle to turn noise suppression off in settings if it's affecting your use case.\r\n<br />\r\n\r\n<br />\r\nTo make better use of the additional screen space of tablets and computers, there are more display options on these devices. Users can tap to open the side panel and see a split-screen view of the video grid and list of participants, optimized for both portrait and landscape orientation.\r\n<br />\r\n\r\n<br />\r\nMeanwhile, voice chats on desktop open in a separate window, so users can type and talk without minimizing anything. Desktop apps also now have selective screen sharing, so it's possible to broadcast an individual window instead of the whole screen.\r\n<br />\r\n\r\n<br />\r\nIn addition to group video calls and screen sharing, this update also adds animated backgrounds, message sending animations, a new menu button for bots, new ways to import stickers, reminders to help keep your account safe, and more. For all the details, <a href=\"https://telegram.org/blog/animated-backgrounds\">check out the Telegram blog</a>.\r\n<br />\r\n\r\n<br />\r\n<a href=\"http://appshopper.com/social-networking/telegram-messenger\">Telegram</a> is a free download for <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. [<a href=\"https://itunes.apple.com/app/telegram-messenger/id686449807\">Direct Link</a>]<div>Tag: <a href=\"https://www.macrumors.com/guide/telegram/\">Telegram</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/28/telegram-gains-group-video-calling/\">Telegram Gains Group Video Calling and Screen Sharing Support</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/telegram-gains-group-video-calling-and-screen-sharing-support.2302565/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=1NdSpEXQMQg:P4_Lp2PBHUY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=1NdSpEXQMQg:P4_Lp2PBHUY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/1NdSpEXQMQg\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"565bce4ca67e5cd919989d9003d075148978114188b93a886590934aec5a5bde","category":"Apple"}