{"title":"iOS 15's Live Text Feature Lets You Digitize Written Notes, Call a Number on a Sign, Translate a Menu, and Much More","link":"https://www.macrumors.com/2021/06/11/ios-15-live-text-features-and-abilities/","date":1623400674000,"content":"In <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, Apple is introducing a new feature called Live Text that can recognize text when it appears in your camera's viewfinder or in a photo you've taken and let you perform several actions with it. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/Apple_iPadPro-iPadOS15-photos-LiveText_060721_big.jpg.large_.jpg\" />\r\n<br />\r\nFor example, Live Text allows you to capture a phone number from a storefront with the option to place a call, or look up a location name in Maps to get directions. It also incorporates optical character recognition, so you can search for and locate the picture of a handwritten note in your photos and save it as text. \r\n<br />\r\n\r\n<br />\r\nLive Text's content awareness extends to everything from QR codes to emails that appear in pictures, and this on-device intelligence feeds into <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> suggestions, too. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/ios15-live-text.jpg\" />\r\n<br />\r\nFor instance, if you take a picture that shows an email address and then open the Mail app and start composing a message, ‌Siri‌'s keyboard suggestions will offer up the option to add \"Email from Camera\" to the To field of your message.\r\n<br />\r\n\r\n<br />\r\nOther Live Text options include the ability to copy text from the camera viewfinder or photos for pasting elsewhere, share it, look it up in the dictionary, and translate it for you into English, Chinese (both simplified and traditional), French, Italian, German, Spanish, or Portuguese.  \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/live-text-translate.jpg\" />\r\n<br />\r\nIt can even sort your photos by location, people, scene, objects, and more, by recognizing the text in pictures. For example, searching for a word or phrase in Spotlight search will bring up pictures from your Camera Roll in which that text occurs.\r\n<br />\r\n\r\n<br />\r\nLive Text works in <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a>, Screenshot, Quick Look, and Safari and in live previews with Camera. In the Camera app, it's available whenever you point your <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>'s camera at anything that displays text, and is indicated by a small icon that appears in the bottom right corner whenever textual content is recognized in the viewfinder. Tapping the icon lets you tap recognized text and perform an action with it. A similar icon appears in the ‌Photos‌ app when you're viewing a shot image.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/visual-look-up-ios-15.jpg\" />\r\n<br />\r\nIn another neural engine feature, Apple is introducing something called Visual Look Up that lets you take photos of objects and scenes to get more information from them. Point your ‌iPhone‌'s camera at a piece of art, flora, fauna, landmarks, or books, and the Camera will indicate with an icon that it recognizes the content and has relevant ‌Siri‌ Knowledge that can add context.  \r\n<br />\r\n\r\n<br />\r\nSince Live Text relies heavily on Apple's neural engine, so the feature is only available on iPhones and iPads with at least an A12 Bionic or better chip, which means if you have an ‌iPhone‌ X or earlier model or anything less than an <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a> (5th generation), <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a> (2019, 3rd generation), or <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> (2020, 8th generation), then unfortunately you won't have access to it.\r\n<br />\r\n\r\n<br />\r\nThe ‌iOS 15‌ beta is currently in the hands of developers, with a public beta set to be released next month. The official launch of ‌iOS 15‌ is scheduled for the fall.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/live-text/\">Live Text</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-15.233\">iOS 15</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/11/ios-15-live-text-features-and-abilities/\">iOS 15's Live Text Feature Lets You Digitize Written Notes, Call a Number on a Sign, Translate a Menu, and Much More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-15s-live-text-feature-lets-you-digitize-written-notes-call-a-number-on-a-sign-translate-a-menu-and-much-more.2300403/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=sSbvIlL17jM:ZPeIkVP-Rc0:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=sSbvIlL17jM:ZPeIkVP-Rc0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/sSbvIlL17jM\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5661b8ec5d12193bac878335e8ef658044ac570644c0415ed20c84b0a46e037f","category":"Apple"}