{"title":"AirPods Max Project Makes Rumored Upgrade for Next-Gen Model a Reality","link":"https://www.macrumors.com/2024/02/28/airpods-max-project-makes-rumored-upgrade-a-reality/","date":1709128800000,"content":"Hardware prototyping consultant Ken Pillonel's latest project switches the <a href=\"https://www.macrumors.com/roundup/airpods-max/\">AirPods Max</a>'s Lightning port for USB-C as part of his ongoing efforts to highlight repairability and sustainability issues in consumer electronics.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/airpods-max-usb-c-ken-pillonel.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe project comes as a response to discontent among some users regarding the premium headphones' continued reliance on the Lightning port for charging while most other Apple devices have made the switch to USB-C, as well as rumors that the second-generation version of the device will finally make the transition. It also serves as a viable fix for damaged ‌AirPods Max‌ Lightning ports, which are costly to replace.\r<br />\n\r<br />\nPillonel created a custom replacement part to allow any technically proficient ‌AirPods Max‌ users to upgrade their headphones to USB-C themselves. The endeavor involved intricate design and manufacturing processes, including the development of an open-source USB-C conversion circuit and a custom printed circuit board that fits perfectly without the need to drill or damaging any of the original components.\r<br />\n\r<br />\n<div></div>\r<br />\n\r<br />\nThe replacement part is designed to sit atop the existing board, meticulously avoiding contact with any other components. The design also addresses potential durability concerns with a flexible section that mitigates stress on the connector, enhancing the kit's longevity.\r<br />\n\r<br />\nPillonel explored the possibility of enabling audio pass-through via the USB-C port but ultimately decided against it due to the prohibitive cost and complexity of integrating Apple's proprietary technology. The conversion kit, along with detailed instructions, is available for purchase via <a href=\"https://shop.kenp.io\">Pillonel's online shop</a>. \r<br />\n\r<br />\nThe second-generation ‌AirPods Max‌ are <a href=\"https://www.macrumors.com/2024/02/19/new-airpods-later-this-year-rumor/\">rumored to launch in late 2024</a>, with the main upgrade being a USB-C port in place of Lightning. No other significant changes are expected, meaning that the headphones will likely <a href=\"https://www.macrumors.com/2024/02/20/airpods-max-2-could-miss-out-on-adaptive-audio/\">miss out on features</a> including the H2 chip and Adaptive Audio, but there might be some new color options.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/airpods-max/\">AirPods Max</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/usb-c/\">USB-C</a>, <a href=\"https://www.macrumors.com/guide/ken-pillonel/\">Ken Pillonel</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AirPods-Max\">AirPods Max (Caution)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/airpods.216\">AirPods</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/28/airpods-max-project-makes-rumored-upgrade-a-reality/\">AirPods Max Project Makes Rumored Upgrade for Next-Gen Model a Reality</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/airpods-max-project-makes-rumored-upgrade-for-next-gen-model-a-reality.2420641/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5662cbaecd456a2c18d3da62ea1503cee37fe141263bebbec9c3cda336ebb865","category":"Apple"}