{"title":"“Locked” for 300 years: Virtual unfolding has now revealed this letter’s secrets","link":"https://arstechnica.com/?p=1746155","date":1614715546000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<figure class=\"video ars-wp-video\"><div class=\"wrapper ars-wp-video-wrapper\" style=\"padding-bottom: 56.25%;\">\n        <video class=\"wp-video-shortcode\" id=\"video-1746155-1\" width=\"1920\" height=\"1080\" preload=\"metadata\" controls=\"controls\"><source type=\"video/mp4\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/00_unfolding_animation-DB-1538.mp4?_=1\"></source></video></div>\n    </figure><p>In 1697, a man named Jacques Sennacque wrote a letter to his cousin, a French merchant named Pierre Le Pers, requesting a certified death certificate for another man named Daniel Le Pers (presumably also a relation). Sennacque sealed the letter with an intricate folding method known as \"<a href=\"http://letterlocking.org/about\">letterlocking</a>,\" a type of physical cryptography—the better to safeguard the contents from prying eyes. That letter was never delivered or opened. More than 300 years later, researchers have virtually \"unlocked\" the letter to reveal its contents for the first time, right down to the watermark in the shape of a bird. They described their results in <a href=\"https://www.nature.com/articles/s41467-021-21326-w\">a new paper</a> published in the journal Nature Communications.</p>\n<p>Co-author Jana Dambrogio, a conservator at MIT Libraries, <a href=\"http://letterlocking.org\">coined the term \"letterlocking\"</a> after <a href=\"https://news.mit.edu/2014/art-and-science-letterlocking\">discovering</a> such letters while a fellow at the Vatican Secret Archives in 2000. The Vatican letters dated back to the 15th and 16th centuries, and they featured strange slits and corners that had been sliced off. Dambrogio realized that the letters had originally been folded in an ingenious manner, essentially \"locked\" by inserting a slice of the paper into a slit, then sealing it with wax. It would not have been possible to open the letter without ripping that slice of paper—evidence that the letter had been tampered with.</p>\n<p>Dambrogio has been studying the <a href=\"https://www.nytimes.com/2015/09/18/arts/design/a-trove-of-letterlocking-or-vintage-strategies-to-deter-snoops.html?partner=rss&amp;emc=rss\">practice of letterlocking</a> ever since, often creating her own models to showcase different techniques. The practice dates back to the 13th century—at least in Western history—and there are many different folding and locking techniques that emerged over the centuries. Queen Elizabeth I, Machiavelli, Galileo Galilei, and Marie Antoinette are among the famous personages known to have employed letterlocking for their correspondence.</p></div><p><a href=\"https://arstechnica.com/?p=1746155#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1746155&comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"56648ea5beef3ba5c91ded0bf65821e35002f0520d1b352ad5595857ce55cdfc","category":"Tech"}