{"title":"Ancient DNA from Sitting Bull’s scalp lock confirms living great-grandson","link":"https://arstechnica.com/?p=1807978","date":1635357641000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/sittingbull1-800x531.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/sittingbull1.jpg\">Enlarge</a> <span>/</span> Hair from Lakota Sioux leader Sitting Bull’s scalp lock, from which DNA was extracted for analysis. (credit: Eske Willerslev)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>An international team of scientists has confirmed the lineage of a living descendent of the famous Lakota Chief Sitting Bull via a new method of DNA analysis designed to track familial lineage using ancient DNA fragments. According to the authors of <a href=\"https://www.science.org/doi/10.1126/sciadv.abh2013\">a new paper</a> published in the journal Science Advances, this is the first time that such an analysis has been used to confirm a link between deceased and living people—in this case, Sitting Bull and his great-grandson, Ernie LaPointe.</p>\n<p>The team's method should be broadly applicable to any historical question involving even the limited genetic data gleaned from ancient DNA. “In principle, you could investigate whoever you want—from outlaws like Jesse James to the Russian tsar’s family, the Romanovs,\" <a href=\"https://www.eurekalert.org/news-releases/932434?\">said co-author Eske Willerslev</a> of the University of Cambridge. \"If there is access to old DNA, typically extracted from bones, hair or teeth, they can be examined in the same way.\"</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Sitting_Bull\">Sitting Bull</a> (<i>Tȟatȟáŋka Íyotake)</i> was a Lakota leader who is best known for his defeat of <a href=\"https://en.wikipedia.org/wiki/George_Armstrong_Custer\">Lt. Col. George Armstrong Custer</a>'s 7th Cavalry at the <a href=\"https://en.wikipedia.org/wiki/Battle_of_the_Little_Bighorn\">Battle of the Little Big Horn</a> (aka, the Battle of the Greasy Grass) on June 25-26, 1876. Various tribes had been joining Sitting Bull's camp over the preceding months, drawn by his spiritual leadership and seeking safety in numbers against US troops. Their number soon grew to more than 10,000. Custer's men were badly outnumbered when they attacked the camp and were forced to retreat. The Sioux warriors ultimately killed Custer and most of his men in what was later dubbed <a href=\"https://en.wikipedia.org/wiki/Battle_of_the_Little_Bighorn\">Custer's Last Stand</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1807978#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1807978&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5666749356bdf831c2167b8c7d40b693f67ddba6930b6400d9a3f424855ef7bd","category":"Tech"}