{"title":"Android to take an “upstream first” development model for the Linux kernel","link":"https://arstechnica.com/?p=1797731","date":1632432751000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/31-980x674.jpg\" /></div>\n        <p>\n          How Linux gets to a phone: the Linux LTS kernel gets forked by Google for the Android Common Kernel, then that gets forked by an SoC vendor for each chip, then that gets forked again by a device manufacturer.                      [credit:\n                        <a href=\"https://source.android.com/devices/architecture/kernel/generic-kernel-image\">Google</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>The Linux Plumbers Conference is this week, and since Android is one of the biggest distributors of the Linux kernel in the world, Google software engineer Todd Kjos <a href=\"https://youtu.be/O_lCFGinFPM?t=2107\">stopped by</a> for a progress report from the Android team. Android 12—which will be out any day now—promises to bring Android closer than ever to mainline Linux by shipping Google's \"Generic Kernel Image\" (GKI) to end-users.</p>\n<p>Traditionally, the Linux kernel is forked several times before it hits an Android phone, usually by each stakeholder in an Android device. First, Google forks the Linux kernel into \"Android common\"—the Linux kernel plus a bunch of phone- and Android-specific changes. Then SoC vendors like Qualcomm, Samsung, or MediaTek fork Android Common to make an SoC-specific kernel for each major chip release. Then each device gets a fork of the SoC kernel for device-specific hardware support.</p>\n<p>Android's kernel fragmentation is a huge mess, and you can imagine how long and difficult the road is for a bugfix at the top of the fork tree to reach to the bottom, where end-users live. The official Android.com documentation notes that \"These modifications can be extensive, to the point that as much as 50% of the code running on a device is out-of-tree code (not from upstream Linux or from AOSP common kernels).\" It's also a big time sink, and even Google phones typically ship kernels that start at two years old.</p></div><p><a href=\"https://arstechnica.com/?p=1797731#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1797731&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"56798ed00a66033d5f63bbac17cc535c13f7790272cc90d37537a15d9376dce8","category":"Tech"}