{"title":"Development and validation of a predictive model for postpartum endometritis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307542","date":1721743200000,"content":"<p>by Xiujuan Wang, Hui Shao, Xueli Liu, Lili Feng</p>\r\nObjective <p>The aim was to develop a predictive tool for anticipating postpartum endometritis occurrences and to devise strategies for prevention and control.</p> Methods <p>Employing a retrospective approach, the baseline data of 200 women diagnosed with postpartum endometritis in a tertiary maternity hospital in Zhejiang Province, spanning from February 2020 to September 2022, was examined. Simultaneously, the baseline data of 1,000 women without endometritis during the same period were explored with a 1:5 ratio. Subsequently, 1,200 women were randomly allocated into a training group dataset and a test group dataset, adhering to a 7:3 split. The selection of risk factors for postpartum endometritis involved employing random forests, lasso regression, and traditional univariate and multifactor logistic regression on the training group dataset. A nomogram was then constructed based on these factors. The model’s performance was assessed using the area under the curve (AUC), calculated through plotting the receiver operating characteristic (ROC) curve. Additionally, the Brier score was employed to evaluate the model with a calibration curve. To gauge the utility of the nomogram, a clinical impact curve (CIC) analysis was conducted. This comprehensive approach not only involved identifying risk factors but also included a visual representation (nomogram) and thorough evaluation metrics, ensuring a robust tool for predicting, preventing, and controlling postpartum endometritis.</p> Results <p>In the multivariate analysis, six factors were identified as being associated with the occurrence of maternal endometritis in the postpartum period. These factors include the number of negative finger tests (OR: 1.159; 95%CI: 1.091–1.233; P &lt; 0.05), postpartum hemorrhage (1.003; 1.002–1.005; P &lt; 0.05), pre-eclampsia (9.769; 4.64–21.155; P &lt; 0.05), maternity methods (2.083; 1.187–3.7; P &lt; 0.001), prenatal reproductive tract culture (2.219; 1.411–3.47; P &lt; 0.05), and uterine exploration (0.441; 0.233–0.803; P &lt; 0.001).A nomogram was then constructed based on these factors, and its predictive performance was assessed using the area under the curve (AUC). The results in both the training group data (AUC: 0.803) and the test group data (AUC: 0.788) demonstrated a good predictive value. The clinical impact curve (CIC) further highlighted the clinical utility of the nomogram.</p> Conclusion <p>The development of an individualized nomogram for postpartum endometritis infection holds promise for doctors in screening high-risk women, enabling early intervention and ultimately reducing the rate of postpartum endometritis infection. This comprehensive approach, integrating key risk factors and predictive tools, enhances the potential for timely and targeted medical intervention.</p>","author":"Xiujuan Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"567ba5afba8ced0f443f3cf8014f87b94e6f913af202c7446f74aadb334e5534","category":"Interdisciplinary"}