{"title":"ศาลอุทธรณ์ตัดสินคดี Epic Games vs Apple ยืนคำตัดสินศาลชั้นต้น ระบุ Apple ไม่มีพฤติกรรมผูกขาด","link":"https://www.blognone.com/node/133545","date":1682383250000,"content":"<div><div><div><p>ศาลอุทธรณ์ภาค 9 ของอเมริกา (The Ninth Circuit Court of Appeals) ออกคำตัดสินจากคดีที่ Epic Games ฟ้องแอปเปิล เนื่องจาก<a href=\"https://www.blognone.com/node/117953\">บัญชีถูกแบน</a>เพราะเกม Fortnite เปิดให้จ่ายเงินโดยตรงผ่านบัตรเครดิตได้ในเกม โดยยืน<a href=\"https://www.blognone.com/node/124697\">คำตัดสินของศาลชั้นต้น</a> ที่ระบุว่าแอปเปิลไม่ได้ผูกขาด แต่มีพฤติกรรมต่อต้านการแข่งขัน จึงมีคำสั่งให้แอปเปิลต้องเพิ่มช่องทางการจ่ายเงิน</p>\n<p>ในช่วงศาลชั้นต้น Epic Games ได้ตัดสินใจยื่นอุทธรณ์ <a href=\"https://www.blognone.com/node/124717\">เพราะมองว่าตนเป็นฝ่ายแพ้คดี</a> ไม่สามารถให้สถานะผูกขาดกับแอปเปิลได้ แต่คำตัดสินจากศาลอุทธรณ์ก็ยังคงเหมือนกับศาลชั้นต้น</p>\n<p>ตัวแทนแอปเปิลออกแถลงการณ์ บอกว่าคำตัดสินนี้เป็นการบอกว่าแอปเปิลคือผู้ชนะ โดยเป็นฝ่ายชนะจากข้อกล่าวหา 9 ใน 10 ของ Epic Games และศาลก็ได้ตัดสินแล้วว่าแอปเปิลไม่ได้มีพฤติกรรมผูกขาด</p>\n<p>ข้อกล่าวหา 1 ข้อ ที่แอปเปิลมองว่าเป็นฝ่ายแพ้ เป็นเรื่องการจ่ายเงินผ่านช่องทางอื่น ซึ่งแอปเปิลจะต้องอนุญาตให้นักพัฒนาแทรกลิงก์เพื่อไปจ่ายเงินในช่องทางอื่นในแอปได้ด้วย</p>\n<p>ด้าน Tim Sweeney ซีอีโอ Epic Games ก็ทวีตหลังศาลมีคำตัดสิน บอกว่าศาลมองว่า Epic Games ยังให้ข้อมูลไม่เพียงพอที่จะระบุว่าแอปเปิลมีพฤติกรรมผูกขาด ตามแนวทางของกฎหมายป้องกันการค้าที่ไม่ธรรม หรือ Sherman Act แต่ก็มีข่าวดี เนื่องจากศาลอนุญาตให้นักพัฒนาแอป iOS สามารถจ่ายเงินผ่านช่องทางอื่นในแอปได้ เราก็จะดำเนินการในขั้นตอนถัดไป</p>\n<p>ที่มา: <a href=\"https://www.cnbc.com/2023/04/24/apple-declares-victory-after-decision-reached-in-epic-games-appeal-.html\">CNBC</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a1cff2145144d62dcf9c81b9ca2e67a1.jpg\" alt /></p>\n<blockquote><p>Apple prevailed at the 9th Circuit Court. Though the court upheld the ruling that Apple's restraints have \"a substantial anticompetitive effect that harms consumers\", they found we didn't prove our Sherman Act case.</p>\n<p>— Tim Sweeney (@TimSweeneyEpic) <a href=\"https://twitter.com/TimSweeneyEpic/status/1650592345111273484?ref_src=twsrc%5Etfw\">April 24, 2023</a></p></blockquote>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/epic-games\">Epic Games</a></div><div><a href=\"/topics/lawsuits\">Lawsuits</a></div><div><a href=\"/topics/apple\">Apple</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"569548e23e656612fda4ff5e560df0cbb25724edb36918aceec47a9f5a29c207","category":"Thai"}