{"title":"Threads Is Coming to the EU in December","link":"https://www.macrumors.com/2023/11/30/threads-to-launch-eu-in-december/","date":1701346069000,"content":"Meta intends to launch Threads in the European Union next month, according to a report by <em><a href=\"https://www.wsj.com/tech/meta-threads-europe-launch-98448df5\">The Wall Street Journal</a></em>. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/instagram-threads-app.jpg\" width=\"1079\" height=\"607\" />\r<br />\nThe social media network debuted in most markets in July, but did not launch in the EU because Meta was unsure whether it would be able to adhere to the bloc's stringent regulations for online services. Threads can import data from Instagram, including behavioral and advertising information.\r<br />\n\r<br />\nAccording to sources who spoke to <em>WSJ</em>, Meta will comply with the regulations by giving EU users a choice of using Threads purely for consumption, without a profile that allows them to make their own posts.\r<br />\n\r<br />\nThe change coincides with recent comments by Adam Mosseri, head of Instagram, who said the platform was rolling out a way to <a href=\"https://www.macrumors.com/2023/11/14/delete-threads-profile-keep-instagram-account/\">delete or deactivate a Threads profile separately</a> while leaving the associated Instagram account intact.\r<br />\n\r<br />\nThe large market expansion should see Threads' user numbers take a jump. Meta CEO Mark Zuckerberg said on a company earnings call last month that Threads now has \"just under\" 100 million monthly users. Since its launch earlier this year it has gained a web app, an ability to search for posts, and a post editing feature.   \r<br />\n\r<br />\nThe expansion comes after several major advertisers, including Apple and Disney, suspended ad spending on Threads rival X (formerly Twitter) after Elon Musk posted controversial comments from his account. Musk on Wednesday said the post in question was a \"mistake,\" and anyone trying to \"blackmail\" him over advertising money could \"go f–yourself,\" while also admitting the loss of ad revenue could end the social media platform.\r<br />\n<ul><li><a href=\"https://www.macrumors.com/2023/11/14/delete-threads-profile-keep-instagram-account/\">Delete Your Threads Profile and Stay on Instagram - Here's How</a></li></ul>\r<br />\nAs mentioned above, Threads integrates with Instagram, so it continues to have a strong user base for such a new app. <a href=\"https://www.threads.net/@macrumors\"><em>MacRumors</em> is on Threads</a>, and all of our content is posted there for those who would like to follow us outside of Twitter and Facebook.<div>Tags: <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/threads/\">Threads</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/30/threads-to-launch-eu-in-december/\">Threads Is Coming to the EU in December</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/threads-is-coming-to-the-eu-in-december.2412453/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5695da0603886b515765790858279b0b653942a521a2a54f0d2b5b97764f643f","category":"Apple"}