{"title":"The iPhone 16 might jump straight to the A18 chip next year","link":"https://www.macworld.com/article/2083959/iphone-16-a18-processor-branding.html","date":1695830346000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>One surprising little detail that popped up during the iPhone 15 introduction earlier this month was that the iPhone 15 Pro models sport an A17 Pro chip. That’s new branding for iPhone chips, which had used the Bionic name for years, but a new report claims it’s going to stick.</p>\n\n\n\n<p>According to analyst Jeff Pu in a report by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/09/27/iphone-16-lineup-a18-a18-pro-chips-analyst-says/&amp;xcust=1-1-2083959-1-0-0&amp;sref=https://www.macworld.com/feed\">MacRumors</a>, the 2024 iPhone 16 Pro and Pro Max will, as expected, have A18 Pro chips. But Pu also says that Apple will use chips branded as “A18” in the iPhone 16 and 16 Plus models.</p>\n\n\n\n<p>Pu’s reliability has been up and down, and MacRumors states that Pu is “likely making an educated guess” about the branding, which implies that Pu did not say that he based his information on inside sources. If this is Pu simply guessing, it does make logical sense–updating the chip branding for the non-pro phones creates more branding consistency from a marketing standpoint.</p>\n\n\n\n<p>Previous rumors had suggested that the iPhone 16 would have <a href=\"https://www.macworld.com/article/2007943/iphone-16-release-date-specs-features-rumors.html#:~:text=Thai%20Nguyen%2FUnsplash-,iPhone%2016%3A%20Specs%20and%20features,in%20the%20iPhone%2015%20Pro.\">a modified version</a> of the A17 Pro chip.</p>\n\n\n\n<p>Currently, Apple introduced the new chip in the Pro models and uses the previous year’s chip in the non-pro iPhones–A17 Pro in the iPhone 15 Pro and Pro Max, and last year’s A16 Bionic in the iPhone 15 and 15 Plus. It’s somewhat confusing to have different numbering systems, so changing the name from A17 Pro to A18 makes sense. Plus it would align the iPhone chips with the Mac chips, which are branded as M2 and M2 Pro, Max, and Ultra.</p>\n\n\n\n<p>The iPhone 16 is a year away and we’ll definitely hear more rumors about chip nomenclature and more. Keep up with the rumors with our <a href=\"https://www.macworld.com/article/2007943/iphone-16-release-date-specs-features-rumors.html\">iPhone 16 rumor roundup</a>.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"56969f7e87c63dea1a19cff1a777842ab73d5a0237b69bb701702679f566f0e5","category":"Apple"}