{"title":"Apple Vision Pro Headset Supports Prescription Inserts for Glasses Wearers","link":"https://www.macrumors.com/2023/06/05/vision-pro-prescription-insert-support/","date":1686008062000,"content":"Apple today announced the Apple Vision Pro, a wearable augmented and virtual reality headset. Because of the way the headset fits against the face, it does not accommodate glasses, but Apple has a solution for those who need prescription lenses. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/apple-vision-pro-lenses.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nApple is partnering with Zeiss to offer Zeiss Optical Inserts that can be customized to each person's vision prescription. The inserts will attach to the Vision Pro lenses magnetically, allowing for precise viewing and eye tracking. \r<br />\n\r<br />\nThere is no word yet on what the Zeiss prescription inserts will cost, but Apple says that vision correction accessories will be sold separately. \r<br />\n\r<br />\nGlasses wearers will need a valid prescription to get the inserts, and not all prescriptions will be supported, so there will be some limitations that might prevent some people from using the headset. \r<br />\n\r<br />\nThe Vision Pro headset will be available in early 2024 and it will be priced starting at $3,499.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/05/vision-pro-prescription-insert-support/\">Apple Vision Pro Headset Supports Prescription Inserts for Glasses Wearers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-headset-supports-prescription-inserts-for-glasses-wearers.2391745/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"569d8644a41e2e4a2c34ab29ad9a4ab48ecd0b824a4763d818c195a0befe03b7","category":"Apple"}