{"title":"Trading acyls and swapping sugars: metabolic innovations in Solanum trichomes","link":"https://academic.oup.com/plphys/article/196/2/1231/7674215?rss=1","date":1715731200000,"content":"<span><div>Abstract</div>Solanaceae (nightshade family) species synthesize a remarkable array of clade- and tissue-specific specialized metabolites. Protective acylsugars, one such class of structurally diverse metabolites, are produced by ACYLSUGAR ACYLTRANSFERASE (ASAT) enzymes from sugars and acyl-coenzyme A esters. Published research has revealed trichome acylsugars composed of glucose and sucrose cores in species across the family. In addition, acylsugars have been analyzed across a small fraction of the &gt;1,200 species in the phenotypically megadiverse <span>Solanum</span> genus, with a handful containing inositol and glycosylated inositol cores. The current study sampled several dozen species across subclades of <span>Solanum</span> to get a more detailed view of acylsugar chemodiversity. In depth characterization of acylsugars from the clade II species brinjal eggplant (<span>Solanum melongena</span>) led to the identification of eight unusual structures with inositol or inositol glycoside cores and hydroxyacyl chains. Liquid chromatography-mass spectrometry analysis of 31 additional species in the <span>Solanum</span> genus revealed striking acylsugar diversity, with some traits restricted to specific clades and species. Acylinositols and inositol-based acyldisaccharides were detected throughout much of the genus. In contrast, acylglucoses and acylsucroses were more restricted in distribution. Analysis of tissue-specific transcriptomes and interspecific acylsugar acetylation differences led to the identification of the brinjal eggplant ASAT 3-LIKE 1 (SmASAT3-L1; SMEL4.1_12g015780) enzyme. This enzyme is distinct from previously characterized acylsugar acetyltransferases, which are in the ASAT4 clade, and appears to be a functionally divergent ASAT3. This study provides a foundation for investigating the evolution and function of diverse <span>Solanum</span> acylsugar structures and harnessing this diversity in breeding and synthetic biology.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"56a721f561a119c38931729330321c90f80a886d3b3abd5844e31346c5ec68cc","category":"Environment"}