{"title":"How the iPhone 13 and Pixel 6 will shape the future of the smartphone","link":"https://www.macworld.com/article/352722/iphone-13-pixel-6-display-camera-processor-tensor.html","date":1628503200000,"content":"<div>\n<section><div></div></section><p>Last week, Google took the wraps off its <a href=\"https://www.macworld.com/article/352439/google-pixel-6-pro-iphone-processor-display-camera-security-design-android.html\">upcoming Pixel 6 line of smartphones</a>—though, in very Google fashion, it didn’t spill all the details about the devices, just dropped enough to tease consumers, with a promise that more would be shared this fall.</p>\n\n\n\n<p>But even that brief look clues us in a little bit about the state of smartphones in 2021. Google may not, thus far, be a maker of top-tier flagship smartphones (a market it’s largely ceded to device makers like Samsung), but as the steward of the Android platform, it obviously has a vested interest in its success, so it’s no surprise that Google’s playbook is taking notes from Apple—though it’s certainly not a one-way street.</p>\n\n\n\n<p>Google is probably hoping to steal some thunder from Apple with its Pixel announcement, given that the annual announcement of the latest iPhone is likely due next month. While that strategy may or may not pay off, it does mean that we can probably start to pinpoint where these two major players have decided to put their energy and resources, which in turn gives us a peek at where the future of the smartphone market is headed.</p>\n\n\n\n<h2>Camera unobscura</h2>\n\n\n\n<p>Cameras are among the most integral pieces of hardware on a smartphone. Aside from the processor, there’s little else that gets the same year-after-year attention from Apple or most of its competitors. Really, it’s kind of ridiculous that we still call the device a “phone,” given that people probably make phone calls on it far less than they use it to take pictures.</p>\n\n\n\n<p>Given that, smartphone makers are all constantly aiming to outperform the others on cameras, and Google is no exception. With the Pixel 6, it’s driving stakes into the ground in a couple of notable places: in particular, with its inclusion of a 4x “folded” telephoto lens in the Pixel 6 Pro, outpacing the 2x telephoto in the iPhone 12 Pro line.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/pixel-6-gold-flat.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The camera bump on the Pixel 6 is a major design element.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>If patents are any indication, Apple’s <a href=\"https://www.macworld.com/article/351198/3-features-that-could-enhance-future-apple-products.html\">been investigating folded lenses</a> of its own, and while it’s unclear if a feature along those lines will make it into the iPhone 13, it seems likely that a camera of that type will show up in a future Apple smartphone eventually.</p>\n\n\n\n<p>Google has also taken the camera bump to the next level, embracing it by turning it into a bar that spans the width of the phone. I wouldn’t expect the iPhone 13 to follow suit in that department, but as the camera advancements probably won’t slow down anytime soon, maybe it’s time to consider a thicker phone? Not only would that allow Apple to potentially reduce—or eliminate—the camera bump, but it also might allow the company to provide more of that always-in-demand resource: battery life.</p>\n\n\n\n<h2>Hertz, doesn’t it?</h2>\n\n\n\n<p>Apple has long prided itself on being the best of the best when it comes to device displays, but the Pixel 6 Pro’s display looks to one-up the current iPhone line in one place: refresh rate. Google’s top-of-the-line phone will sport a display with a 120Hz refresh rate, a feature that can provide smoother motion and animations.</p>\n\n\n\n<p>If that spec sounds familiar, it’s because Apple rolled out its own 120Hz displays, dubbed ProMotion, in the iPad Pro back in 2017. At the time, it boasted of not just the smoother movement, but also the ability to adjust the refresh rate to match content, potentially saving energy.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/pixel-6-front.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The Pixel 6 Pro’s display will reportedly be 120Hz.</figcaption></figure><p>Google</p></div>\n\n\n\n<p>If that spec sounds familiar, it’s because Apple rolled out its own 120Hz displays, dubbed ProMotion, in the iPad Pro back in 2017. At the time, it boasted of not just the smoother movement, but also the ability to adjust the refresh rate to match content, potentially saving energy.</p>\n\n\n\n<p>Since then, ProMotion has been one of those technologies that has perennially been expected to make the jump to the iPhone. 2021 could finally be that year, though it wouldn’t be shocking to see the technology only appear on Apple’s Pro-level smartphones. (Similarly, Google’s version won’t be available on the standard Pixel 6, just the Pixel 6 Pro.)</p>\n\n\n\n<h2>Future Tensor</h2>\n\n\n\n<p>One place that Google took a cue from Apple in the Pixel 6 is also arguably the biggest news of the announcement: the Tensor system on a chip that Google has helped build. It’s unclear exactly what parts of that SoC Google was responsible for creating, but what <em>is</em> evident, based on Google’s stock-in-trade—and the SoC’s name, which it borrowed from its Tensor Processing Unit cloud-based neural network system—is that the key focuses of the technology are machine learning and artificial intelligence.</p>\n\n\n\n<figure><div>\n\n</div></figure><p>The Tensor SoC seems to be Google’s answer to Apple’s own neural engine, first included in the A11 Bionic chip. Google specifically says that Tensor will benefit its “computational photography models” and most of the examples shown to those who were able to preview the device were photo and video related.</p>\n\n\n\n<p>Zoom out to the bigger picture (if you’ll pardon the expression), it suggests that Google is tacitly admitting that if you want to get ahead in the smartphone business, the old adage of famed computer scientist Alan Kay still holds true, that “people who are really serious about software should make their own hardware.”</p>\n\n\n\n<p>This potentially takes the smartphone arms race to a whole new level. The good news is that it means Apple and Google’s competition is shaping up to be fiercer than ever, and that’s something that stands to benefit all users, no matter which platform they use.</p>\n</div>","author":"Dan Moren","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"56b630718396abdc2656cd486d78a6ba46b04d1cd02776f0fc8efe82c794c00a","category":"Apple"}