{"title":"A new dentition-based phylogeny of Litopterna (Mammalia: Placentalia) and ‘archaic’ South American ungulates","link":"https://academic.oup.com/zoolinnean/article/doi/10.1093/zoolinnean/zlae095/7750676?rss=1","date":1725667200000,"content":"<span><div>Abstract</div>Ever since the discovery of <span>Macrauchenia patachonica</span> by Charles Darwin in 1834, the affinities of litopterns—a group of extinct South American Native Ungulates (SANUs)—have been elusive. In particular, the interfamilial relationships and timing of the familial diversification within the order Litopterna have not been addressed with adequate taxon and character sampling, and modern phylogenetic methods. We address these issues using a new morphological matrix of 703 dental and mandibular characters, scored for the earliest litopterns alongside early SANUs of other orders (Astrapotheria, Notoungulata, Pyrotheria, and Xenungulata). We also included members of families that have been often included within Litopterna, such as Didolodontidae, Protolipternidae, Indaleciidae, and Notonychopidae, the last two sometimes grouped in the order Notopterna. We conducted maximum parsimony and undated and tip-dated Bayesian phylogenetic analyses. Our results indicate that (1) didolodontids, protolipternids, and kollpaniines should be considered early SANUs, but not particularly closely related to any order, (2) Indaleciidae and Notonychopidae usually form a monophyletic group (Notopterna), and (3) Litopterna is a monophyletic unit composed of four families [Adianthidae, Anisolambdidae (subfamilies Anisolambdinae and Sparnotheriodontinae), Macraucheniidae, Proterotheriidae], and tentatively the notoptern families Indaleciidae and Notonychopidae with a probable origin ~64.0 Mya in the Early Palaeocene.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"56b7ed897b3872107e22789d24145b269874a1337d52b949232cca6000d42d9d","category":"Environment"}