{"title":"Egan Bernal: 'It's about character, not numbers'","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/egan-bernal-its-about-character-not-the-numbers","date":1682146800000,"content":"\n      <p><em>This article originally appeared on <a href=\"https://www.rouleur.cc/es/pages/volata-home\">Volata</a></em></p>\n<p>Before the start of the sixth stage of Volta a Catalunya, Egan Bernal made time for a chat before getting on the rollers to warm up. As he would later tell me, that stage would be the second fastest of his career since he had to drop out of the 2020 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>. Little did we know then that our conversation about quiet work, mental preparation, and acceptance would become even more meaningful when, hours later, he was involved in a crash and had to abandon the race. “All good,” he would say to me. “We decided it was best to quit as a precaution... the pace was crazy today”. It took 100 kilometres for the breakaway to form on the way to Molins de Rei.</p>\n<div></div>\n<p>The mishaps of the last few weeks forced him to step back and reassess the ‘comeback’. In the Tour de San Juan, in Argentina, he celebrated the first anniversary of his terrible accident since becoming a pro cyclist again. A fall and the consequent blow to his knee altered his plans and kept him out of action for three weeks. The Volta was his return to racing in Europe, and to the demanding WorldTour, for the first time since the 2021 <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>. As long as you empathise and remove the demigod identity we project onto cyclists from the equation, you can imagine that Bernal's has been a herculean task of patiently facing new obstacles and controlling the eagerness to finally speak in the present day.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/FrrMQazXsAAAr9D.jpg?v=1681801685\" /></p>\n<p><em>Bernal has suffered a number of setbacks through crashes this season, but remains determined to push himself to his max this season (Image courtesy of Ineos Grenadiers)</em></p>\n<p>“At a certain point I was starting to get a bit stressed,\" he says. \"I've always been very patient and very calm but after feeling not so bad in Argentina and having to stop for three weeks, the last week was getting long and I wanted it to pass. But, even if it sounds repetitive, after the accident I had, everything is a gain. After all the bad things I had, I know I can't complain about this.”</p>\n<p>On January 24, 2022, Bernal suffered a terrible accident while training with some of his Ineos Grenadiers teammates in Colombia. The medical report was devastating. Less than a fortnight later, he was back on his feet and immediately got on an exercise bike, and a month-and-a-half later he shared his first pedal strokes on the rollers on his social channels</p>\n<p>It was development always ahead of the deadlines set by the medical team, a constant throughout the recovery process. “At no time have we had a break that has slowed down his progression”, says his coach in the team, Xabier Artetxe. “And both the doctors and ourselves thought that there might be one, or even a step backwards that could affect him mentally. We tried to make sure he was prepared for it, but it never happened.”</p>\n<p>The key to this, he says, is that from the very first minute, everything Bernal did was done with the idea of returning to his top level. “Without that attitude and those expectations of being the same as you were, you don't work with the same intensity. He worked for that reason.”</p>\n<p>If Bernal says it can sound repetitive, it's because the questions are repetitive too. He insists: “I see life differently. Even if I’m not going to win anything else, I'm calm. I won a Tour de France and a <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia</a> and I had an accident whose consequences I couldn't control, but I did do the best I could in my recovery for myself, for my family, for my brother, for the people who love me and for the team that has given me all the support. I think I am a professional and I do my job in the best possible way.”</p>\n<p>Clearly, Bernal has worked through a brutal level of mental work to reach that level of acceptance. However, for many, it's still all about \"the best version of Egan\" and winning again. Does he think the media understands his message?</p>\n<p>“No, they don’t,” he says. “If you don't live it, you won't understand it. I'm not saying I'm not going to make it, but people keep asking when I'm going to get back to my best, when we're going to see Egan against Pogačar or Roglič and so on. I'd like to, but if it doesn't happen, it’s OK. I've already won the race for life. I want to inspire people, at the same time I work hard and hopefully one day I'll be back to my best.”</p>\n<p>Those who know him well say that his great merit is his daily sacrifice in pursuit of a goal that he doesn't really know if he's going to achieve. Artetxe explains: “The degree of sacrifice and self-demand that this boy has had since he had the accident is not common. He does it because he wants to get back to the level he was at. He is making good progress and we are all convinced that we have to continue working in this direction.”</p>\n<h3>The faith of an exceptional cyclist</h3>\n<p>We meet again at the Itzulia Basque Country. The team had doubts about whether to call Bernal up or not, but he never had. He’s finally living in the present and doesn't want to think about tomorrow. “He wanted to be here and help the team”, Artetxe says. “He is a Tour winner, but he doesn’t get discouraged and he knows that his team-mates need him”. At the finish of the first stage of the Itzulia the Colombian was full of pure joy. The team had been working all day to finish off with Ethan Hayter's victory in Labastida.</p>\n<p>In Argentina he had started the season better than how he finished in 2022, although he still doesn't allow himself comparisons with those who would be his direct rivals. “It would be very sad for me to do so at this point,” Bernal says. “I'm comparing myself to myself, trying to push my body to the limit every day. Even if they drop me in the first kilometre, I try to finish the climb as fast as I can and look at my numbers and compare them to a month ago, two months ago…”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Fr_W0D5XoAAgy-L.jpg?v=1681802131\" /></p>\n<p><em>Bernal is hopeful of a return to Grand Tour racing at the Tour de France (Image courtesy of Ineos Grenadiers)</em></p>\n<p>He will be satisfied in 2023 if he reaches his best possible level. \"If that means being 30th in the Tour, I'd be happy with that, as if it was being second, first or whatever. Without a back or knee problem preventing me from giving my 100%. It's about finding the best version of Egan.”</p>\n<p>He has what it takes, and doesn’t seem to linger on regrets. When he talks about his mother and the cancer she suffered last year, he speaks of a fighter, a woman for whom life has not been easy and from whom he has never heard a complaint. Her father also suffered some health problems, so the family's circumstances have re-established their priorities in life and made them even tougher in the face of its onslaughts.</p>\n<p>Bernal’s journey is a process that is not yet complete. One day, perhaps exhausted by the effort, he stops and asks Artetxe in search of reassurance: “And do you believe?”. And the trainer, who has remained with him over the years like a guardian angel, would like to have a crystal ball to know how far Bernal is going to go. “Unfortunately I don't have it, but nobody can take that dream out of his head,” Artetxe says. “If he doesn't make it, it won't be because he hasn't tried. That's the difference between a very good rider and a champion. It’s not in numbers or physiology, it's in the character.”<br /><br /></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"56bbcc8cfc75b5c46feed8f459253dd1ae16b31e7ad0ef3b857af497ea23c8a4","category":"Cycling"}