{"title":"Coral reef fish visual adaptations to a changing world","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14668?af=R","date":1727780671000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/93becdfd-2bd4-4065-939c-570070b71a0b/fec14668-toc-0001-m.png\" alt=\"Coral reef fish visual adaptations to a changing world\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/20/coral-reef-fish-visual-adaptations-to-a-changing-world/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nCoral reef ecosystems show fluctuations in their prevailing light environment in response to both regular (e.g. between seasons) and more prevalent stochastic events (e.g. human-induced sediment runoff). In these shifting environments, phenotypic plasticity provides an essential mechanism for coral reef fishes to adjust their visual capability to meet changing sensory requirements.\n\nHere, we evaluate the growing area of research that highlights the many genetic and ecological mechanisms that affect the plastic responses of coral reef fish vision to environmental cues.\n\nWith an increasing number of disturbances in the marine environment, it is critical to understand the extent and limits of visual plasticity under natural and disturbed conditions. With our current knowledge and drawing upon a large body of work in freshwater fishes, we speculate whether coral reef fishes can adapt to the changes to their visual environment and where the limitations could lie.\n\nWhilst coral reef fishes have shown visual adaptations under different light environments, the degree of plasticity is inconsistent between species. Thus, plasticity may not only be functionally significant in maintaining the performance of visually guided behaviours for single species but, more broadly, is likely key to sustaining ecosystem function.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/20/coral-reef-fish-visual-adaptations-to-a-changing-world/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Abigail Shaughnessy, \nFabio Cortesi","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"56c88d1a6dc09859956787a53d8d87ba2e5b9292882b5576cda8fc772dca65cc","category":"Environment"}