{"title":"Impact of aridity rise and arid lands expansion on carbon‐storing capacity, biodiversity loss, and ecosystem services","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17292?af=R","date":1713423600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/034584a8-f310-4ed7-90cf-ed7721415277/gcb17292-toc-0001-m.png\" alt=\"Impact of aridity rise and arid lands expansion on carbon-storing capacity, biodiversity loss, and ecosystem services\" />\n<p>This study shows that increasing aridity in drylands has a significant impact on the carbon, nitrogen, and phosphorus cycles within plant–soil systems, as well as on biodiversity and ecosystem services across different scales. As aridity increases, soil organic carbon, nutrient, and water content decrease, which can lead to the loss of critical ecosystem services. By 2100, half of the world's landmass may become dryland, creating significant challenges for maintaining essential services, impacting human well-being, and raising global and regional socio-political issues.</p>\n<br />\n<h2>Abstract</h2>\n<p>Drylands, comprising semi-arid, arid, and hyperarid regions, cover approximately 41% of the Earth's land surface and have expanded considerably in recent decades. Even under more optimistic scenarios, such as limiting global temperature rise to 1.5°C by 2100, semi-arid lands may increase by up to 38%. This study provides an overview of the state-of-the-art regarding changing aridity in arid regions, with a specific focus on its effects on the accumulation and availability of carbon (C), nitrogen (N), and phosphorus (P) in plant–soil systems. Additionally, we summarized the impacts of rising aridity on biodiversity, service provisioning, and feedback effects on climate change across scales. The expansion of arid ecosystems is linked to a decline in C and nutrient stocks, plant community biomass and diversity, thereby diminishing the capacity for recovery and maintaining adequate water-use efficiency by plants and microbes. Prolonged drought led to a −3.3% reduction in soil organic carbon (SOC) content (based on 148 drought-manipulation studies), a −8.7% decrease in plant litter input, a −13.0% decline in absolute litter decomposition, and a −5.7% decrease in litter decomposition rate. Moreover, a substantial positive feedback loop with global warming exists, primarily due to increased albedo. The loss of critical ecosystem services, including food production capacity and water resources, poses a severe challenge to the inhabitants of these regions. Increased aridity reduces SOC, nutrient, and water content. Aridity expansion and intensification exacerbate socio-economic disparities between economically rich and least developed countries, with significant opportunities for improvement through substantial investments in infrastructure and technology. By 2100, half the world's landmass may become dryland, characterized by severe conditions marked by limited C, N, and P resources, water scarcity, and substantial loss of native species biodiversity. These conditions pose formidable challenges for maintaining essential services, impacting human well-being and raising complex global and regional socio-political challenges.</p>","author":"Akash Tariq, \nJordi Sardans, \nFanjiang Zeng, \nCorina Graciano, \nAlice C. Hughes, \nGerard Farré‐Armengol, \nJosep Peñuelas","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"56df3466a50caa7f8ca26281c1f3867f905c4e9779d70c1146361583ef8db802","category":"Environment"}