{"title":"Impact of Smoking Cessation and Charlson Comorbidity Index on Influenza Vaccination Efficacy in COPD Patients","link":"https://www.preprints.org/manuscript/202405.1382/v1","date":1716284950000,"content":"Chronic obstructive pulmonary disease (COPD) patients are particularly susceptible to respiratory infections like influenza, which exacerbate symptoms and increase healthcare utilization. While smoking cessation and influenza vaccination are recommended preventive measures, their combined impact on healthcare resource utilization is underexplored. The Charlson Comorbidity Index (CCI) assesses comorbidity burden in COPD patients and may influence healthcare outcomes. We conducted a retrospective analysis of 357 COPD patients, evaluating smoking cessation success over one year and influenza vaccination receipt, stratifying patients by CCI scores. Healthcare utilization outcomes included emergency room visits, hospitalizations, and medical expenses. Results showed that 51.82% of patients quit smoking and 59.66% received influenza vaccination, with higher comorbidity prevalence in advanced COPD stages (p=0.002). Both smoking cessation and influenza vaccination independently correlated with decreased emergency room visits, hospital admissions, days, and costs. Patients who both quit smoking and received influenza vaccination exhibited the lowest healthcare utilization rates. In conclusion, smoking cessation and influenza vaccination significantly reduce healthcare resource utilization in COPD patients, with the combination yielding synergistic benefits, particularly in those with lower CCI scores. Integrating these interventions and comorbidity management in COPD strategies is essential for optimizing patient outcomes and healthcare efficiency.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"56e258786b82307c779b1db4e0895e33b9691c3654981a461c20eae542cd98d4","category":"Interdisciplinary"}