{"title":"Knowledge, attitudes, and practices about HIV and other sexually transmitted infections among High School students in Southern Italy: A cross-sectional survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301297","date":1713535200000,"content":"<p>by Francesco Di Gennaro, Francesco Vladimiro Segala, Giacomo Guido, Mariacristina Poliseno, Laura De Santis, Alessandra Belati, Carmen Rita Santoro, Irene Francesca Bottalico, Carmen Pellegrino, Roberta Novara, Luisa Frallonardo, Mariangela Cormio, Michele Camporeale, Sergio Cotugno, Vincenzo Giliberti, Stefano Di Gregorio, Valentina Totaro, Nicola Catucci, Anna De Giosa, Roberta Giusto, Ilaria Viviana Lanera, Gioacchino Angarano, Sergio Lo Caputo, Annalisa Saracino</p>\r\n\r\nHigh School students, recognized as a high-risk group for sexually transmitted infections (STIs), were the focal point of an educational campaign in Southern Italy to share information and good practices about STIs and HIV/AIDS. A baseline survey comprising 76 items was conducted via the REDCap platform to assess students’ initial knowledge, attitudes, and practices (KAP) related to STIs and HIV/AIDS. Sociodemographic variables were also investigated. The association between variables and KAP score was assessed by Kruskal-Wallis’ or Spearman’s test, as appropriate. An ordinal regression model was built to estimate the effect size, reported as odds ratio (OR) with a 95% confidence interval (CI), for achieving higher KAP scores among students features. On a scale of 0 to 29, 1702 participants achieved a median KAP score of 14 points. Higher scores were predominantly reported by students from classical High Schools (OR 3.19, 95% C.I. 1.60–6.33, p&lt;0.001). Additionally, elevated scores were associated with sexually active students (OR 1.48, 95% C.I. 1.12–1.96, p = 0.01), those vaccinated against Human Papilloma Virus (OR 2.47, 95% C.I. 1.89–3.24, p&lt;0.001), those who had used emergency contraception (OR 1.56, 95% C.I. 1.09–2.24, p = 0.02, Table 2) and those obtaining information from TikTok (OR 1.62, 95% C.I. 1.14–2.30, p = 0.01). Conversely, being heterosexual was associated with an overall lower score (OR 0.48, 95% C.I. 0.32–0.73, p&lt;0.001). High School students, often due to early sexual debut, seek information about HIV and STIs independently using social channels. However, the overall level of knowledge, attitudes, and practices remains low. Urgent school-based interventions are needed for this age group.","author":"Francesco Di Gennaro","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"56e52fbe98d7b101590e92f1e009e7fd06166e9c3c4a4b16ca7bca7fca64688f","category":"Interdisciplinary"}