{"title":"Current frameworks for environmental and health assessment of hydrocarbon streams and products are flexible and ready for alternative non crude oil-based feeds","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae114/7724214?rss=1","date":1722384000000,"content":"<span><div>Abstract</div>Hazard and risk assessment of complex petroleum-derived substances has been in a state of continuous improvement since the 1970s, with the development of approaches that continue to be applied and refined. Alternative feeds are defined here as those coming into a refinery or chemical plant that are not hydrocarbons from oil and gas extraction such as biologically derived oils, pyrolysis oil from biomass or other, and recycled materials. These feeds are increasingly being used for production of liquid hydrocarbon streams, and hence, there is a need to assess these alternatives, subsequent manufacturing and refining processes and end products for potential risk to humans and the environment. Here we propose a tiered, problem formulation-driven framework for assessing the safety of hydrocarbon streams and products derived from alternative feedstocks in use. The scope of this work is only focused on petrochemical safety assessment, though the principles may be applicable to other chemistries. The framework integrates combinations of analytical chemistry, <span>in silico</span> and <span>in vitro</span> tools, and targeted testing together with conservative assumptions/approaches to leverage existing health, environmental, and exposure data, where applicable. The framework enables the identification of scenarios where <span>de novo</span> hazard and/or exposure assessments may be needed and incorporates tiered approaches to do so. It can be applied to enable decisions efficiently and transparently and can encompass a wide range of compositional space in both feedstocks and finished products, with the objective of ensuring safety in manufacturing and use.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"56f069cf3fb84f8513803cfe88a1a6d837966b395ad2819ec69bb31ee55b4d59","category":"Environment"}