{"title":"The brutality of this EV crash test was shocking, but both cars passed","link":"https://arstechnica.com/?p=1981548","date":1699292095000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/23C0350_011-800x450.jpg\" alt=\"Two orange-painted Mercedes cars crash into each other head-on, seen from head-on.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/23C0350_011-scaled.jpg\">Enlarge</a> (credit: Mercedes-Benz)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Mercedes-Benz provided flights from New York to Stuttgart, Germany, and a night in a hotel so Alex could visit the Mercedes test facility on the way to a drive event (for a different publication). Ars does not accept paid editorial content.</aside>\n<p>Something unexpected happened as I looked down to watch two Mercedes-Benz EVs crash into each other: I felt… scared.</p>\n<p>It was the culmination of a day spent with Mercedes-Benz discussing the company's plans to fully prevent serious injuries in its vehicles and the first time an automaker publicly conducted a crash test between two EVs, in this case with a select group of journalists in attendance. Witnessing two cars smash into each other would be, at the very least, very exciting.</p>\n<p>But I didn't expect to feel my stomach drop in the moment of impact and the dread that lingered after. The experience hammered home the importance of all the safety measures automakers implement in the cars we spend our lives with and how much work goes into engineering the successful outcomes we hope we never have to experience firsthand.</p></div><p><a href=\"https://arstechnica.com/?p=1981548#p3\">Read 23 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1981548&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"56f1928ebc4c90c39840a76d67e9be363e2e90505cc47fbe0f3d50e323d86ead","category":"Tech"}