{"title":"SpaceX breaks another booster reuse record, but did anyone see it?","link":"https://arstechnica.com/?p=1969569","date":1695226795000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/starlink6-17-800x533.jpg\" alt=\"Starlink 6-17 launches from Florida on Tuesday night.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/starlink6-17-scaled.jpg\">Enlarge</a> <span>/</span> Starlink 6-17 launches from Florida on Tuesday night. (credit: SpaceX)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>SpaceX launched its 67th rocket of the year on Tuesday night, a staggering total for the company and its workhorse booster, the Falcon 9. At this pace, a clip of one launch every four days, the company is likely to launch 90 or more rockets during this calendar year.</p>\n<p>This Starlink satellite launch was notable for a couple of other reasons. It marked the first time SpaceX has reused a Falcon 9 first stage 17 times. This booster, serial number 1058, had previously flown 11 previous Starlink missions along with GPS III-3, Turksat 5A, Transporter-2, Intelsat G-33/G-34, and Transporter-6.</p>\n<p>SpaceX performed a fairly significant assessment of booster wear and tear after its first Falcon 9 stages reached 15 flights, and the company's engineers now believe the rockets can achieve at least 20 flights. Remarkably, SpaceX has been able to push the limits of booster reuse while maintaining a 100 percent record of success across the Falcon 9 rocket's last 228 launches, dating to a pad explosion in September 2016.</p></div><p><a href=\"https://arstechnica.com/?p=1969569#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1969569&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"56f8dc16a509485c060cd77b7c5ed28153f7f39d4f1a8fbd82effa1e354fff4a","category":"Tech"}