{"title":"PSIII-7 7&amp;7 Synch improved pregnancy rates in beef cows experiencing estrus over 24 h before fixed-time insemination","link":"https://academic.oup.com/jas/article/102/Supplement_2/332/7664736?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Our objectives were to compare estrus response and pregnancy rates between two different estrus synchronization protocols and between cows that experienced estrus more than 24 h before appointment breeding and those that experienced estrus less than 24 h before breeding. Over each of 2 yr, postpartum beef cows (n = 1,108) from two different locations were ranked by days postpartum and randomly selected to receive either; 1) 7-d CO-Synch + CIDR (CO-Synch, n = 547), or; 2) 7 &amp; 7 Synch (7&amp;7, n = 561). For the CO-Synch treatment, cows received a controlled internal drug release insert (CIDR; 1.38g progesterone) and 100 µg gonadotropin-releasing hormone (GnRH) i.m., followed in 7 d by CIDR removal and 25 mg prostaglandin F<sub>2</sub>alpha (PGF) i.m., followed in 60 to 66 h with AI and 100 µg GnRH i.m. For the 7&amp;7 Synch protocol, cows received a CIDR (1.38g progesterone) and 25 mg PGF i.m., followed in 7 d by 100 µg GnRH i.m., followed in 7 d by CIDR removal and 25 mg PGF i.m., followed in 60 to 66 h with AI and 100 µg GnRH i.m. Heat detection patches were applied at the time of CIDR removal to determine estrus response by the time of AI, with cows having patches ≥ 50% activated defined as being in estrus and cows with patches &lt; 50% activated defined as not experiencing estrus. In yr 2, an additional heat detection was performed 24 h before breeding, at which time cows with ≥ 50% activated heat detection patches were defined as having an early estrus (i.e., estrus more than 24 h before breeding) and cows with activated patches first observed at the time of AI were defined as having an on-time estrus. Pregnancy status was determined via transrectal ultrasonography 35 d after AI. Data were analyzed using the GLIMMIX procedure of SAS. As expected, cows in the 7&amp;7 treatment had greater (<span>P</span> ≤ 0.005) estrus response and pregnancy rates than those in the CO-Synch treatment (83% vs. 62% and 65% vs. 55%, respectively). The proportion of cows experiencing early estrus was similar (<span>P</span> &gt; 0.60) between treatments (20.4 and 22.9 for Co-Synch and 7&amp;7, respectively). Interestingly, pregnancy rate was impacted by a treatment × estrus timing interaction (<span>P</span> = 0.04), where cows in the Co-Synch treatment that experienced an early estrus (52.9%) had reduced pregnancy rates compared with 7&amp;7 cows that experienced early estrus (74.0%), Co-Synch cows that experienced on-time estrus (73.7%) and 7&amp;7 cows that experienced on-time estrus (70.5%). Our results indicate the 7&amp;7 Synch protocol can effectively increase pregnancy rates to fixed-time AI, and that pregnancy rates of cows experiencing early estrus are influenced by synchronization protocol.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"56fa4946184abbb51f1aa69c472ce4b748e97a767dbe87a8cc6482fefade9c4e","category":"Environment"}