{"title":"Can consumers avoid mislabelling? Genetic species identification provides recommendations for shrimp/prawn products","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13771?af=R","date":1721394467000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Crustaceans of the superfamily Penaeoidea (e.g., shrimps and prawns) are among the most commercially available aquatic products worldwide. However, there are few studies regarding not only the presence but also the characteristics of mislabelling in these food products. Such information would be helpful for consumers in order to avoid the typical problems associated with mislabelling (e.g., health and economic issues). For this reason, this work considers Penaeoidea mislabelling by comparing different products (frozen, fresh, boiled), and sources (hypermarkets, supermarkets and fishmongers) from Spain (Europe).</p>\n<h2>RESULTS</h2>\n<p>A total of 94 samples from 55 different products were collected, representing 19 different species from 13 genera. Mitochondrial DNA (COI gene) was amplified, revealing mislabelling in almost 30% of supermarket products and almost exclusively found in frozen samples (95% of the total) regardless of its price. In addition, products from the Pacific Ocean seem to be particularly susceptible to mislabelling.</p>\n<h2>CONCLUSIONS</h2>\n<p>All in all, recommendations for the consumer in order to avoid mislabelling of prawns include purchasing them fresh from fishmongers; aquaculture products must not be avoided. This study represents, to our knowledge, the first attempt to provide recommendations to consumers based on DNA analyses in order to avoid mislabelling in food products. Further research is therefore required to provide such recommendations in different food products, particularly those that are processed, packaged and/or frozen. © 2024 The Author(s). <i>Journal of the Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Félix Gil, \nBeatriz Beroiz, \nIsabel Ballesteros, \nJose Luis Horreo","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"56fb835712a2db816fd655aa731481a54d0e7c63041995ff896153152f073be9","category":"Environment"}