{"title":"Is the Giro Donne done?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/is-the-giro-donne-done","date":1625753411000,"content":"\n      <p><span>We may still have three stages remaining of the Giro Donne but the GC looks sewn up already. The decision from the new organisers to start the race with a long team time trial followed by an uphill finish and a mountain ITT two stages later has rendered the general classification all but over. The dominant rider sitting at the top of the standings is none other than defending champion Anna van der Breggen, of course, but the clincher is that lurking in second and third are two of her teammates, Ashleigh Moolman Pasio and Demi Vollering.</span></p>\n<div></div>\n<p><span>With some of van der Breggen’s usual competition absent from the race and a number of other contenders wiped out by crashes or simply not in their usual form, the Maglia Rosa is looking pretty comfortable on the back of the World Champion. Kasia Niewiadoma and Annemiek van Vleuten would perhaps have been the biggest threats to van der Breggen on the second stage’s climb to Prato Nevoso, however both have chosen instead to focus on training ahead of the Tokyo Olympic Games later this month. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/women-s-olympic-road-race-2021-will-we-see-dutch-dominance\">Related: Women's Olympic Road Race 2021 Preview</a></em></strong></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GIRO-WOMEN-7TH-JULY-13-_1_1024x1024.jpg?v=1625744197\" /></span></p>\n<p><span>Among those at the race is Elisa Longo Borghini, however the Italian national champion hasn’t featured as heavily as might have been expected of her after some strong performances earlier this season — although she was spotted pulling an enormous turn on the front for Lucinda Brand on stage five. The Trek-Segafredo GC mantle has instead been picked up by next-best non-SD Worx rider Lizzie Deignan, who sits in fourth and 5:53 down on van der Breggen. It’s a strong ride from the former World Champion that in another year might have proven enough for a podium, as it stands, however, not even the strong Trek-Segafredo squad have yet managed to crack the code to beating SD Worx.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/gallery-giro-ditalia-donne\">Related: The Giro d'Italia Donne so far: gallery</a></em></strong></p>\n<p><span>Cecilie Uttrup Ludwig has been another GC prospect to suffer in the opening stages, the Danish rider took a tumble in the TTT leaving her bruised and her team 1:46 down on Trek-Segafredo, who won the stage. Canyon//SRAM might have lost Niewiadoma for this race but Mikayla Harvey seemed more than ready to step up to the plate after some strong performances so far this season. As it happened, however, the young Kiwi — who won the youth classification in 2020 and placed 5th overall — lost too much time on the stage two summit finish and let go of her hopes of chasing a GC standing. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GIRO-WOMEN-7TH-JULY-41_1024x1024.jpg?v=1625744023\" /></span></p>\n<p><span>With the competition falling one by one, van der Breggen’s closest rivals are now her own teammates, but even they are not particularly close. Ashleigh Moolman Pasio sits in second, at 2:51 down and Vollering third at 3:03. Much was made earlier in the season about how many cards SD Worx have to play, but at this one in particular they have a royal flush. Even 20-year-old Kiwi Niamh Fisher-Black is sitting in the top-10 on GC and is in the young rider’s jersey — albeit 7:22 down. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/question-time-with-demi-vollering\">Related: Question Time with Demi Vollering</a></em></strong></p>\n<p><span>The GC time gaps are a symptom of the course design. Had the opening stages been less decisive, or come later on in the race, it might have made for a more dynamic start or at least prevented van der Breggen from running away with the jersey too soon. A wet and wild stage three into Ovada won by Marianne Vos from a breakaway provided some respite from the SD Worx show, but the GC standings barely moved. </span></p>\n<p><span>If her performance on stage two’s summit finish didn’t fully secure the Maglia Rosa for van der Breggen, then stage four’s mountain ITT certainly did. Grace Brown of Team BikeExchange sat in the hot seat for most of the day after posting a time of 26:14 on the 11km climb up to </span><span>Cascate Del Toce, but by the end of the stage van der Breggen had shattered her time into oblivion, coming in at 24:57. Only Demi Vollering could get near to the World Champion with a time of 25:03. Brown at least prevented yet another full SD Worx podium by hanging on for third.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1327111973_1024x1024.jpg?v=1625750044\" /></span></p>\n<p><span>At the other end of the scale, twelve riders became casualties of an ungenerous time cutoff as a result of van der Breggen’s barnstorming ride, with Spanish Continental squad Bizkaia Durango worst off, losing four riders.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/5-years-on-what-impact-has-the-introduction-of-the-women-s-world-tour-had\">Related: 5 years on, is the Women's WorldTour working?</a></em></strong></p>\n<p><span>With an SD Worx GC win looking increasingly likely, other teams are looking to hunt stages. Tuesday’s sprint into Carugate was taken by another imperious rider with an altogether different skill set, Lorena Wiebes. The 22-year-old was given a textbook leadout by her DSM teammates including experienced sprinter Coryn Rivera, and edged out Emma Norsgaard of Movistar for the third time this season. The ever-dynamic Marianne Vos held on for third. </span></p>\n<p><span>Norsgaard gave a post-race interview after losing to Wiebes in which she vowed, \"w</span>hat's next? To win, for sure.\" It turned out to be a prescient statement as she then went on to take the win the following day, beating Rivera and Vos to the line. Meanwhile, the top-16 on GC remained the same. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GIRO-WOMEN-7TH-JULY-16_1024x1024.jpg?v=1625744286\" /></p>\n<p><span>There are few opportunities left for anyone to try and unseat van der Breggen, with rolling and flat stages to come, other GC contender’s only hopes will be to sneak into a breakaway and slowly claw back time. With a team like SD Worx on patrol, however, that seems like a tall order. Stage 9, with another summit finish on a category 1 climb, Monte Matajur, </span>could go either way: van der Breggen could go on the rampage again, or her rivals — who are not teammates — might be able to work together to weaken her grip. The latter scenario, however, is looking increasingly unlikely as the race wears on. </p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide\">Related: Women's WorldTour Calendar 2021</a></em></strong></p>\n<p><span>Much like with a certain Slovenian over in France, the GC war might already be lost at this race, but the battles for stage wins may at least keep things interesting. It’s not over until it’s over, however, and we’ll keep watching until the very last stage — what little we get to see of it, anyway. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"5706df18ab4e6aced22b5f540dc012aa829f7de565635eb6f4f352e86e17f799","category":"Cycling"}