{"title":"นาซ่าเลือก 5 บริษัทออกแบบยานพามนุษย์กลับไปดวงจันทร์ SpaceX ถูกที่สุดเพียง 9.4 ล้านดอลลาร์","link":"https://www.blognone.com/node/124764","date":1631694829000,"content":"<div><div><div><p>นาซ่าประกาศเลือก 5 บริษัทให้ออกแบบยานสำหรับลงจอดดวงจันทร์ (lunar lander) ให้เวลาออกแบบ 15 เดือน โดยเป็นการออกแบบคอนเซ็ปต์เบื้องต้นเพื่อดูประสิทธิภาพของดีไซน์ว่ามีประสิทธิภาพและความปลอดภัยเพียงใด พร้อมกับต้องทดสอบชิ้นส่วนบางชิ้นว่าเทคโนโลยีใช้งานได้จริง</p>\n<p>บริษัทที่ชนะโครงการครั้งนี้ ตามลำดับอักษรได้แก่</p>\n<ul>\n<li>Blue Origin ของ Jeff Bezos มูลค่า 25.6 ล้านดอลลาร์</li>\n<li>Dynetics (บริษัทลูกของ Leidos ผู้ให้บริการไอทีเน้นงานกลาโหมสหรัฐฯ) 40.8 ล้านดอลลาร์</li>\n<li>Lockheed Martin มูลค่า 35.2 ล้านดอลลาร์</li>\n<li>Northrop Grumman มูลค่า 34.8 ล้านดอลลาร์</li>\n<li>SpaceX 9.4 ล้านดอลลาร์</li>\n</ul>\n<p>ราคาโครงการครั้งนี้นับว่า SpaceX ถูกกว่าคนที่เสนอราคาแพงที่สุดถึง 4 เท่าตัว และฉีกออกจากกลุ่มมาก เช่นเดียวกับภารกิจ Commercial Crew สำหรับการนำนักบินอวกาศไปยังสถานีอวกาศนานาชาติที่ SpaceX ถูกกว่า Boeing มากเช่นกัน</p>\n<p>โครงการนี้เป็นส่วนหนึ่งของโครงการ Artemis ที่จะนำมนุษย์ไปตั้งศูนย์บนดวงจันทร์อีกครั้ง โดย Artemis มีชิ้นส่วนที่ต้องพัฒนาอีกจำนวนมาก ทั้งยานลงจอด, ระบบขนส่งบนดวงจันทร์, ที่อยู่อาศัยบนดวงจันทร์, ยานนำส่งสัมภาระจากโลก, ชุดอวกาศแบบใหม่ โดยนาซ่าตั้งเป้าให้ Artemis เปิดทางสู่การสำรวจดวงจันทร์ในราคาประหยัดลงและเปิดตลาดการเดินทางไปดวงจันทร์ในอนาคต เป้าหมายแรกๆ ของโครงการนี้คือพานักบินอวกาศไปลงดวงจันทร์โดยรอบนี้จะมีนักบินหญิงและนักบินผิวสีไปด้วย</p>\n<p>ที่มา - <a href=\"https://www.nasa.gov/press-release/nasa-selects-five-us-companies-to-mature-artemis-lander-concepts\">NASA</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/52f4e3f398cab7ebeb1bf71c80008608.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/nasa\">NASA</a></div><div><a href=\"/topics/spacex\">SpaceX</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5709fef82dd50f841087ea3868a65f3dabe99fe95c8951551d2b446f53aad877","category":"Thai"}