{"title":"Preliminary Screening on Antibacterial Crude Secondary Metabolites Extracted from Bacterial Symbionts and Identification of Functional Bioactive Compounds by FTIR and Gas Chromatography-Mass Spectrometry","link":"https://www.preprints.org/manuscript/202405.0138/v1","date":1715044843000,"content":"Secondary metabolites are bioactive compounds produced by living organisms that can reveal symbiotic relationships in nature. In the work described here, soil-born entomopathogenic-nematodes associated with symbiotic bacteria (Xenorhabdus stockiae and Photorhabdus luminescens) extracted from solvent supernatant containing secondary metabolites showed significant inhibitory action against Escherichia coli, Staphylococcus aureus, Enterococcus faceium, Proteus vulgaris, Bacillus cereus, Bacillus subtilis. These secondary metabolites, characterized by Fourier transform infrared spectroscopy were found to be amine groups of proteins; hydroxyl and carboxyl groups of polyphenols; hydroxyl groups of polysaccharides, and carboxyl groups of organic acids. The major compounds identified by Gas chromatography-mass spectrometry analysis of ethyl acetate extracts of Xenorhabdus stockiae revealed the existence of Nonanoic acid derivatives, Paromycin, Pyrrolidinone, Octodecanal derivatives, Trioxa-5-aza-1-silabicyclo, 4-Octadecenal, Methyl ester, Oleic Acid and 1,2-benzenedicarboxylicacid. Additional extraction from Photorhabdus luminescens was expressed functional compounds such as Indole-3-acetic acid, Piperidinol derivatives, Phthalic acid, 1-Tetradecanol, Nemorosonol, 1-eicosanol and unsaturated fatty acids. These outcomes support the development of new alternative natural antimicrobial agents for pathogen suppression in the future.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"57111d518bf5268b21233b14162ed6ccb794b84ab8d809aef718780e1b93acbc","category":"Interdisciplinary"}