{"title":"Late Cenozoic Faunal and Ecological Change in Africa","link":"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-031621-114105?TRACK=RSS","date":1721692800000,"content":"<div><p>Africa's fossil record of late Cenozoic mammals documents considerable ecological and evolutionary changes through time. Here, we synthesize those changes in the context of the mechanisms proposed to account for them, including bottom-up (e.g., climate change) and top-down (e.g., hominin impacts) processes. In doing so, we (<span>a</span>) examine how the incompleteness of the fossil record and the varied spatiotemporal scales of the evidence complicate efforts to establish cause-effect relationships; (<span>b</span>) evaluate hypothesized drivers of long-term ecological and evolutionary change, highlighting key unknowns; and (<span>c</span>) synthesize major taxonomic and functional trends through time (e.g., downsizing of faunal communities) considering the proposed drivers. Throughout our review, we point to unresolved questions and highlight research avenues that have potential to inform on the processes that have shaped the history of what are today the most diverse remaining large mammal communities on Earth.</p>\n<ul>\n<li><span>▪ \n</span>The study of late Cenozoic African mammal communities is intertwined with questions about the context, causes, and consequences of hominin evolution.\n</li>\n<li><span>▪ \n</span>The fossil record documents major functional (e.g., loss of megaherbivores) and taxonomic (e.g., rise of the Bovidae) changes over the past ∼7 Myr.\n</li>\n<li><span>▪ \n</span>Complexities inherent to the fossil record have made it difficult to identify the processes that drove ecological and evolutionary changes.\n</li>\n<li><span>▪ \n</span>Unanswered questions about the drivers of faunal change and the functioning of past ecosystems represent promising future research directions.\n</li>\n</ul></div>","author":"J. Tyler Faith, John Rowan and Andrew Du","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"572b3854b5c5bffc5207a1915e8ef8de86a7fd575d7448010b649e385eeabb3d","category":"Environment"}