{"title":"Chitosan Nanoparticles with Potential Biomedical Applications: Effect of Concentration in the Non-Solvent Phase","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.631/7719590?rss=1","date":1721779200000,"content":"<span>This study aims to obtain chitosan nanoparticles for potential biomedical applications by exploring the effect of polymer concentration in the solvent phase. Biopolymer nanoparticles, particularly chitosan, hold significant importance in pharmaceutical and food industries. However, traditional fabrication methods involving extensive organic solvent use pose risks to the environment and human health. This study focuses on the synthesis of chitosan nanoparticles using the nanoprecipitation technique, with a specific emphasis on investigating the influence of polymer concentration in the solvent phase. The primary objective is to understand how varying chitosan concentration affects the characteristics and properties of the resulting nanoparticles. Biopolymer nanoparticles, particularly those made from chitosan, have gained significant importance in various industries, such as pharmaceuticals and food. However, traditional fabrication methods involving extensive use of organic solvents pose potential environmental and health risks. In response, the nanoprecipitation technique emerges as a more sustainable and straightforward approach, minimizing the need for toxic substances and reducing environmental impact [<a href=\"#ozae044.631-B1\">1</a>,<a href=\"#ozae044.631-B2\">2</a>]. The standard procedure involves pouring the organic phase, containing the chitosan polymer for nanoparticle formation, into the aqueous phase under magnetic stirring. The solvent from the organic phase diffuses into the aqueous phase, carrying some polymer chains, and the associated polymer chains aggregate to form nanoparticles [<a href=\"#ozae044.631-B3\">3</a>]. In the current study, chitosan (2% w/v) is dissolved in a sodium bisulfite formaldehyde solution (3% w/v) to form the solvent phase. Two dilutions (0.045% and 0.055%) are prepared from this solution, and 1 or 2.5 mL of each dilution is added dropwise to the non-solvent phase (40 mL of methanol). Characterization of the chitosan nanoparticles is performed after their formation, employing dynamic light scattering and atomic force microscopy to determine particle size and morphology, respectively. The results demonstrate that the progressive addition of the polymer solution to the non-solvent phase generally leads to the formation of chitosan nanoparticles with a size of approximately 200 nm, as illustrated in Fig 1. The particle sizes fall within the range of 200-250 nm in diameter. Batch nanoprecipitation is highlighted as a practical and straightforward mixing process involving the one-step or dropwise addition of the polymer solution into a large quantity of non-solvent [<a href=\"#ozae044.631-B4\">4</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"572c3cb4a9bbc1d02ba9d0824b370ed5e3d16f458276b5a5dfd7e36ef2a13e0f","category":"Environment"}