{"title":"Lionel Messi Is Coming to MLS, With a Revenue Sharing Deal From Apple","link":"https://500ish.com/apples-messi-strategy-48bd95fe006","date":1686329471000,"content":"\n<p>MG Siegler:</p>\n\n<blockquote>\n  <p>Earlier today, it was <a href=\"https://www.nytimes.com/2023/06/07/sports/soccer/lionel-messi-inter-miami-mls.html\">announced</a> that Lionel Messi, the\nworld’s greatest soccer player, would be leaving Europe behind and\njoining Inter Miami. This matters because the biggest name in\n<a href=\"https://500ish.com/a-most-beautiful-game-e3a3dcbd228d\">fútbol</a> (soccer), and arguably in all sports, is coming to\nAmerica. But it also matters because he’s coming to play in the\nMLS. A league that has an exclusive television deal with Apple.\nAnd as such, Apple apparently helped lure Messi over with an\nextraordinary offer: a cut of revenue from new subscribers to\ntheir Season Pass service.</p>\n</blockquote>\n\n<p>I’d be very curious to learn just how big a revenue share Messi is getting from Apple, but regardless of the details, this is simply an extraordinary coup for both MLS and Apple TV+. There are only a handful of athletes who are so good, and so beloved, that they can singlehandedly elevate an entire <em>league</em> in a team sport. Lionel Messi is one of them.</p>\n\n<blockquote>\n  <p>Of the people who got early looks at Vision Pro, there’s\nseemingly universal praise for the NBA court-side and MLB\ndugout demos. These were apparently shot with special cameras\nwhich Apple manufactured to be able to capture footage that\ncould take full advantage of the viewing experience on the new\ndevice. It will likely take a bit for this type of content to\nbecome more widespread and accepted amongst the leagues. You\nknow where it won’t be? MLS. <a href=\"https://twitter.com/mgsiegler/status/1666535803068256259\">I fully expect</a> Apple to\nbe filming games with their new Spatial Cameras (I made up the\nname, but it seems like something they might use… ) soon, if\nthey haven’t started already! Apple isn’t undercutting any\nother TV rights here (as they might be with say, the NBA),\n<a href=\"https://mgs.blog/skating-to-where-the-soccer-ball-will-be-bc889b8c368\">they have exclusive rights</a>. To display any game, any\ntime, <em>anywhere</em> on any device.</p>\n</blockquote>\n\n<p>It occurred to me after my demo with Vision Pro that it was slightly surprising that Apple included spatial presentations of NBA basketball and MLB baseball, but not MLS soccer — the sport TV+ is most all-in on. (Apple does of course have weekly national broadcasts of MLB with Friday Night Baseball.) But I’ll eat my hat if Apple isn’t planning to broadcast entire MLS games with this technology.</p>\n\n<blockquote>\n  <p>And finally, fifth, much like Apple used AT&amp;T as their exclusive\ncarrier for the iPhone when it launched, <a href=\"”https://twitter.com/mgsiegler/status/1666536683251339272&lt;strong\">I could see them</a>\nusing their MLS deal in a similar manner. That is, work with a\nleague/carrier that is willing to break norms and allow Apple to\nbe in control of the product and offering. And when it’s a\nsuccess, watch the other leagues/carriers trip over themselves to\nget in line. It worked with the iPhone. Will it work here? Feels\nlike a pretty good bet to make.</p>\n</blockquote>\n\n<p>This is exactly what I was thinking when I mentioned <a href=\"https://daringfireball.net/2023/06/first_impressions_of_vision_pro_and_visionos#fn2-2023-06-07\">in a footnote in my first impressions piece this week</a> that the NFL in particular might have made a colossal mistake signing a long-term deal with Google for Sunday Ticket broadcast rights. Siegler’s comparison to how Apple leveraged its initial exclusivity deal with AT&amp;T with the iPhone seems apt.</p>\n\n<p><strong>Update:</strong> Apple also announced <a href=\"https://www.apple.com/tv-pr/news/2023/06/apple-tv-scores-with-documentary-series-featuring-legendary-football-champion-lionel-messi-and-his-fifa-world-cup-career-culminating-in-his-dramatic-qatar-2022-win/\">a four-part docuseries on Messi’s career</a> coming to TV+.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/09/messi-apple\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"573570386a1c7a274a8d5a249471127aab8ecc8833f7665c11f49997c39268cd","category":"Tech"}