{"title":"Google promises a rescue patch for Android 14’s “ransomware” bug","link":"https://arstechnica.com/?p=1979603","date":1698688704000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Android_14-Hero_image-P8P.width-1200.format-webp-800x451.webp\" alt=\"Google promises a rescue patch for Android 14’s “ransomware” bug\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Android_14-Hero_image-P8P.width-1200.format-webp.webp\">Enlarge</a> (credit: Google)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>So Android 14 has this pretty horrible storage bug for upgrading users. If you have multiple user accounts on your device, upgrading to Android 14 can actually <em>lock you out</em> of the device's local storage, which creates an incredible number of problems that are all pretty similar to getting hit with device-encrypting \"ransomware\" malware. Bugs are always going to happen, but the big problem with this is that Google has seemingly been ignoring it, and <a href=\"https://arstechnica.com/gadgets/2023/10/android-14s-ransomware-data-storage-bug-locks-out-users-remains-unfixed/\">on Friday</a> we wrote about how users have been piling up hundreds of reports for 10 days without an acknowledgement or fix promised by Google.</p>\n<p>Apparently one more round of news reports was enough to get the gears moving at Google. Over the weekend the <a href=\"https://issuetracker.google.com/issues/305766503?pli=1\">Issue tracker bug</a> has been kicked up from a mid-level \"P2\" priority to \"P0,\" the highest priority on the issue tracker. The bug has been assigned to someone now, and Googlers have jumped into the thread to make official statements that Google is looking into the matter. Here's <a href=\"https://issuetracker.google.com/issues/305766503#comment501\">the big post</a> from Google on the bug tracker:</p>\n<blockquote><p>We are aware of an issue occurring on some Pixel devices (Pixel 6 and later models) that have both received the Android 14 update and have multiple users (other than the primary user) set up. Multiple users include <a href=\"https://support.google.com/pixelphone/answer/2865483#zippy=%2Cuser\" target=\"_self\">users</a>, <a href=\"https://support.google.com/pixelphone/answer/2865483#zippy=%2Cguest\" target=\"_self\">guests</a>, <a href=\"https://support.google.com/pixelphone/answer/2865483#zippy=%2Crestricted-profile-tablets-only\" target=\"_self\">restricted profiles</a>, and <a href=\"https://support.google.com/pixelphone/answer/2865483#zippy=%2Cchild-user\" target=\"_self\">child users</a>. However, it does not include having more than one Google account within the primary user or <a href=\"https://support.google.com/work/android/answer/9563584\" target=\"_self\">work profiles</a>.</p>\n<p>Depending on the device, this issue can result in the primary user being unable to access media storage. Alternatively, the issue can reboot the device with a “Factory data reset” message. If this message is accepted, data that is not backed up can be lost, and if it is declined, the device repeatedly reboots with the “Pixel is starting” message.</p>\n<p>We’re continuing to work on fixes for impacted devices, and have already pushed out a Google Play system update that will help prevent this issue from being triggered on additional devices. To check if a Google Play system update is available for your device, follow the instructions in this <a href=\"https://support.google.com/android/answer/7680439#:~:text=Get%20security%20updates%20%26%20Google%20Play%20system%20updates\" target=\"_self\">Help Center article</a>.</p>\n<p><strong>If you’re experiencing this issue:</strong> If your impacted device is unable to access media storage, we anticipate a system update will repair the issue and restore access to media files without requiring a factory reset. If your device is stuck in a \"Pixel is starting\" boot loop due to this issue, we are investigating methods that may be able to recover some data. We’ll provide more information as soon as it is available.</p>\n<p>For users who are not experiencing this issue, or have already factory reset their device, we recommend avoiding creating or logging into a secondary user on the device until the OTA update is available.</p>\n<p>We're sorry for the inconvenience this has caused, and we appreciate your patience.</p></blockquote>\n<p>The highlights here are that Google says the bug affects devices with multiple Android <em>users</em>, not multiple Google accounts or (something we thought originally) users with work profiles. Setting up multiple users means going to the system settings, then \"Multiple users,\" then \"Allow multiple users,\" and you can add a user other than the default one. If you do this, you'll have a user switcher at the bottom of the quick settings. Multiple users all have separate data, separate apps, and separate Google accounts. Child users are probably the most popular reason to use this feature, since you can lock kids out of things like purchasing apps.</p></div><p><a href=\"https://arstechnica.com/?p=1979603#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1979603&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"574120ba0226bcb2ba1eae79510e214be20fd712566a1de63fef7da5d897faf5","category":"Tech"}