{"title":"Causal relationship between ulcerative colitis and male infertility: A two-sample Mendelian randomization study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303827","date":1717077600000,"content":"<p>by Xia Wang, Tongyi Li, Qiu Chen</p>\r\nAims <p>To explore the causal relationship between ulcerative colitis (UC) and male infertility using Mendelian randomization method with single nucleotide polymorphism (SNP) as the instrumental variables.</p> Methods <p>Genetic loci closely associated with UC were extracted as instrumental variables and male infertility was the outcome variable in pooled data from the gene-wide association study (GWAS),which was derived from European ethnic groups. The UC data(ebi-a-GCST003045) contained a total sample size of 27432 individuals and 110944 SNPs, and the male infertility data(finn-b-N14_MALEINFERT) contained a total sample size of 73479 individuals and 16377329 SNPs. The SNPs highly correlated with UC were screened from ebi-a-GCST003045(P&lt;5×10<sup>−8</sup> as the screening condition, the linkage disequilibrium coefficient was 0.001,and the width of the linkage disequilibrium area was 10000 kb).SNPs related to male infertility from finn-b-N14_MALEINFERT (the minimum r<sup>2</sup>&gt;0.8,replacing the missing SNPs with SNPs with high linkage, and deleting SNPs without substitution sites) were extracted. MR analysis was performed using MR-Egger regression, the weighted median and the inverse-variance weighted (IVW) respectively, and the causal relationship between UC and male infertility was evaluated by OR and 95% CI, and the Egger-intercept method was used to test for horizontal multiplicity, and the sensitivity analysis was performed using \"leave-one-out method\". Finally, we used Bayesian Weighted Mendelian Randomization (BWMR) approach to test the results of MR study.</p> Results <p>A total of 86 SNPs were included as IVs, with OR and 95% CI of 1.095(0.820~1.462)、1.059(0.899~1.248)、1.125(1.002~1.264) for MR-Egger, the weighted median and IVW results respectively, and P value of less than 0.05 for IVW, indicating that a causal relationship between UC and male infertility was causally related. The results of MR analysis combined with BWMR analysis also showed positive genetic causal relationship between UC and male infertility.MR-Egger regression showed an intercept of -2.21×10<sup>−3</sup> with a standard error of 0.006 and P = 0.751, there was no horizontal pleiotropy for the IVs of exposure factors. Heterogeneity tests showed no heterogeneity and the results of the \"leave-one-out\" sensitivity analysis were stable.</p> Conclusion <p>There is a causal association between UC and male infertility, which increases the risk of developing male infertility.</p>","author":"Xia Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"57443e084c0a1656442ecd42ff14a7f68182667dbc84e419ef82c8de492d7f59","category":"Interdisciplinary"}