{"title":"PSVIII-19 Assessing methane and carbon dioxide production in beef cows across diverse foraging conditions","link":"https://academic.oup.com/jas/article/102/Supplement_3/600/7757862?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Beef cattle grazing across more than 40M ha of Canada’s grasslands is economically significant yet contributes to methane (CH<sub>4</sub>) emissions. Accurately measuring CH<sub>4</sub> emissions across diverse environments presents substantial challenges. Our study investigated CH<sub>4</sub> and carbon dioxide (CO<sub>2</sub>) production in 3-yr-old pregnant crossbred beef cows (n = 30) across different phases of the beef production cycle, including in drylot and while grazing on native rangeland, in Western Canada’s Aspen Parkland region using the GreenFeed Emissions Monitoring System (GEM). During the January to March drylot phase, enteric CH<sub>4</sub> and CO<sub>2</sub> production of the cows were monitored for 63 d in consort with feed efficiency testing while consuming a mixed oat-barley silage diet. Following this, cows were categorized into three distinct groups based on the standard deviation (SD) of CH<sub>4</sub> yield [gּ kg<sup>−1</sup> dry matter intake (DMI)]: Low (&lt; 0.5 SD; n = 11), Medium (± 0.5 SD; n = 10), and High (&gt; 0.5 SD; n = 9). Post-calving, cows and calves transitioned to native pastures for CH<sub>4</sub> and carbon dioxide (CO<sub>2</sub>) assessment across three distinct foraging conditions: high-quality, high-quantity forage in summer (SUM; 50 d); moderate-quality, high-quantity forage in September (SEP; 22 d); and finally, low-quality, low-quantity forage in October (OCT; 22 d). We hypothesize that ranking cows based on their CH<sub>4</sub> yield (gּ kg<sup>−1</sup> DMI) in drylot settings may have the potential to reflect their CH<sub>4</sub> production (g/d) during grazing conditions, even without feed intake data. Data were analyzed using the PROC MIXED procedure of SAS to examine CH<sub>4</sub> production among cows categorized by their assigned ranking. Spot CH<sub>4</sub> and CO<sub>2</sub> measurements totaled 1,242, 1,145, and 1,205 for the SUM, SEP, and OCT, production phases, respectively. Average daily visits to GEM units were 1.4 ± 0.1, 1.84 ± 0.1, and 1.96 ± 0.1 for the corresponding phases. While High CH<sub>4</sub>-ranked cows had methane production similar to Low CH<sub>4</sub>-ranked cows (234.8 ± 8.2 vs. 235.0 ± 6.0 g/d, respectively), the Medium group had significantly greater methane production (260.5 ± 6.2 g/d; <span>P</span> = 0.008) than the Low and High CH<sub>4</sub> groups. Furthermore, significant interactions were observed between CH<sub>4</sub> ranking groups and CH<sub>4</sub> production during the grazing phase (<span>P</span> = 0.035). Cows in the Medium CH<sub>4</sub> group emitted greater amounts of CH<sub>4</sub> compared with the High group in SUM (288.2 ± 9.3 vs. 247.0 ± 14.1 g/d) and to the Low group in SEP and OCT (276.5 ± 6.6 vs. 238.1 ± 6.3, and 216.7 ± 7.2 vs. 191.8 ± 7.5 g/d, respectively). In conclusion, the drylot CH<sub>4</sub> ranking may hold promise in predicting outcomes for both Low and Medium CH<sub>4</sub>-ranked groups during grazing phases. However, High CH<sub>4</sub>-ranked cows had decreased methane production, likely influenced by grazing-induced changes in feed intake and individual feeding behaviors, prompting further exploration.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"574661bc56065bef2aa6f0ce2d480355e8a2b650ee8b73cae66f341ce4dd70e8","category":"Environment"}