{"title":"357 Injectable trace mineral improves immune response and outcome of Mannheimia haemolytica infection in feedlot steers","link":"https://academic.oup.com/jas/article/102/Supplement_3/372/7757500?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Trace minerals, such as selenium, copper, zinc, and manganese, are important in the immune response. These trace minerals are included in an injectable trace mineral product, Multimin90, which has previously been utilized to boost the immune response during vaccination. However, little is known about its effects on morbid animals. Angus-crossbred steers [n = 32; body weight (BW) = 284 ± 8.5 kg] were used to determine the effects of Multimin90 (ITM; 1 mL/45 kg BW) before or during treatment for bacterial respiratory infection. Steers were fed a common ryelage-based growing diet without supplementation of Zn, Cu, Mn and Se for 4 to 6 wk prior to and during the challenge study. The study was completed in two groups (n = 14 to 18) for sampling logistics. Steers were stratified by BW into three treatments: CON (control, saline injection; n = 9), ITMPRE (ITM 6 d before infection; n = 12) and ITMPOST (ITM 2 d post infection; n = 11). Steers were shipped for 6 h and received at ISU Animal Resource Station (Ames, IA) 7 d before being intratracheally infected with <span>M. haemolytica</span> strain D153 at 9.48 × 10<sup>8</sup> colony forming units on d 0 followed by tulathromycin treatment 2 d post infection (dpi). Liver biopsies were collected -10, 2 and 10 dpi. Blood and bronchoalveolar lavage (BAL) samples were collected on 0, 2 and 5 dpi. Statistics were analyzed using a two-way ANOVA (mixed-effects model) with Tukey’s multiple comparisons test in Prism v9.2.0 (GraphPad Software, Inc). Liver and plasma were analyzed for trace mineral concentration, all steers had adequate trace mineral status prior to and throughout disease challenge. Steers were monitored for signs of clinical illness after inoculation by a trained observer blinded to treatment using a modified Wisconsin clinical scoring system, including cough, nasal discharge and ear score. Compared with CON, steers in ITMPRE and ITMPOST had lesser clinical scores (<span>P</span> &lt; 0.05); treatment did not affect rectal temperatures, which peaked 2 or 3 dpi (Time <span>P</span> = 0.02). There was no difference between treatment in the detection of <span>M. haemolytica</span> in BAL or nasopharyngeal swab samples (<span>P</span> ≥ 0.14). In BAL cells, there were increased frequencies of gamma delta T cells and natural killer cells 5 dpi in ITM treated steers compared with CON (<span>P</span> ≤ 0.04). Treatment did not affect the frequencies of alveolar macrophages, neutrophils, B cells, CD4+ and CD8+ T cell populations in BAL cells (<span>P</span> ≥ 0.15). Overall, ITM administration in TM adequate steers at arrival or during respiratory disease treatment positively affects lung cell recruitment and clinical scores with no negative impacts on disease outcome compared with controls. Further work in TM deficient animals or with more aggressive disease challenge is warranted.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"574abf565cb14996dd04386998aeca678c5bca57af9fee343a1e02738a54ee75","category":"Environment"}