{"title":"Can serum interleukin 34 levels be used as an indicator for the prediction and prognosis of COVID-19?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302002","date":1713276000000,"content":"<p>by Doğu Karahan, Hasan Ata Bolayir, Aslı Bolayir, Bilgehan Demir, Önder Otlu, Mehmet Erdem</p>\r\nObjective <p>Interleukin 34 (IL-34) is a molecule whose expression is increased in conditions such as autoimmune disorders, inflammation, and infections. Our study aims to determine the role of IL-34 in the diagnosis, follow-up, and prognosis of Coronavirus Disease-19 (COVID-19).</p> Method <p>A total of 80 cases were included in the study as 40 COVID-19 positive patient groups and 40 COVID-19 negative control groups. The COVID-19-positive group consisted of 20 intensive-care unit (ICU) patients and 20 outpatients. Serum IL-34, c-reactive protein (CRP), ferritin, D-dimer, troponin I, hemogram, and biochemical parameters of the cases were studied and compared between groups.</p> Results <p>IL-34 levels were significantly higher in the COVID-19-positive group than in the negative group. IL-34 levels increased in correlation with CRP in predicting the diagnosis of COVID-19. IL-34 levels higher than 31.75 pg/m predicted a diagnosis of COVID-19. IL-34 levels did not differ between the outpatient and ICU groups in COVID-19-positive patients. IL-34 levels were also not different between those with and without lung involvement.</p> Conclusion <p>While IL-34 levels increased in COVID-19-positive patients and were successful in predicting the diagnosis of COVID-19, it was not found to be significant in determining lung involvement, risk of intensive care hospitalization, and prognosis. The role of IL-34 in COVID-19 deserves further evaluation.</p>","author":"Doğu Karahan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5758f2be3c8ab7685e572581a97fd99c3f0e59d66809f6b849126803e9155cd5","category":"Interdisciplinary"}