{"title":"Electric Vehicle DC Charging Station Based on XGboost Re-search on Condition Assessment and Operation and Mainte-nance","link":"https://www.preprints.org/manuscript/202408.1689/v1","date":1724559499000,"content":"With the rapid development of electric vehicles, the infrastructure for charging stations is also expanding quickly, and the failure rate of charging piles is increasing. To address the effective op-eration and maintenance of charging stations, a method based on the XGBoost algorithm for electric vehicle DC charging stations is proposed. An operation and maintenance system is constructed based on state analysis, considering the operation status of the charging station and users' charging habits. Factors such as driving and charging habits, road traffic, and charging station equipment are taken into account. The training sample data is established using historical data, online monitoring data, and external environmental data, and the charging station status evaluation model is trained using the XGBoost algorithm. Based on the condition assessment results, a risk assessment model is established in combination with fault parameters. Risk tracking of the charging station is conducted using the lack of power supply (ENC), evaluating the risk level of each station, and determining the operation and maintenance order. The optimal operation and maintenance model for DC charging stations, aimed at achieving both economic and reliable goals, is constructed to determine the op-eration and maintenance schedule for each station. The results of the case study demonstrate that the state evaluation and operation and maintenance strategy can significantly improve the relia-bility of the system and the overall benefits of operation and maintenance while meeting the re-quired standards.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"575bdd2163f55bc7231fb6783300736f091429698e126c7e8746945eac059a90","category":"Interdisciplinary"}