{"title":"Differential effects of plant-beneficial fungi on the attraction of the egg parasitoid <i>Trissolcus basalis</i> in response to <i>Nezara viridula</i> egg deposition","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304220","date":1716300000000,"content":"<p>by Sara Van Hee, Tuğcan Alınç, Berhane T. Weldegergis, Marcel Dicke, Stefano Colazza, Ezio Peri, Hans Jacquemyn, Antonino Cusumano, Bart Lievens</p>\r\n\r\nThere is increasing evidence that plant-associated microorganisms play important roles in defending plants against insect herbivores through both direct and indirect mechanisms. While previous research has shown that these microbes can modify the behaviour and performance of insect herbivores and their natural enemies, little is known about their effect on egg parasitoids which utilize oviposition-induced plant volatiles to locate their hosts. In this study, we investigated how root inoculation of sweet pepper (<i>Capsicum annuum</i>) with the plant-beneficial fungi <i>Beauveria bassiana</i> ARSEF 3097 or <i>Trichoderma harzianum</i> T22 influences the olfactory behaviour of the egg parasitoid <i>Trissolcus basalis</i> following egg deposition by its host <i>Nezara viridula</i>. Olfactometer assays showed that inoculation by <i>T</i>. <i>harzianum</i> significantly enhanced the attraction of the egg parasitoid, while <i>B</i>. <i>bassiana</i> had the opposite effect. However, no variation was observed in the chemical composition of plant volatiles. Additionally, fitness-related traits of the parasitoids (wasp body size) were not altered by any of the two fungi, suggesting that fungal inoculation did not indirectly affect host quality. Altogether, our results indicate that plant inoculation with <i>T</i>. <i>harzianum</i> T22 can be used to enhance attraction of egg parasitoids, which could be a promising strategy in manipulating early plant responses against pest species and improving sustainable crop protection. From a more fundamental point of view, our findings highlight the importance of taking into account the role of microorganisms when studying the intricate interactions between plants, herbivores and their associated egg parasitoids.","author":"Sara Van Hee","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5765d95e289a912880829865f8d0610b038e1b32376745f92889f38500cddbac","category":"Interdisciplinary"}