{"title":"The 2023 Toyota bZ4x: A bouncy ride meets rather good efficiency","link":"https://arstechnica.com/?p=1959241","date":1691422933000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/2023_bZ4X_XLE_FWD_WindChillPearl_034-scaled-1-800x533.jpg\" alt=\"A black and white Toyota bZ4x parked in front of a modern house\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/2023_bZ4X_XLE_FWD_WindChillPearl_034-scaled-1.jpg\">Enlarge</a> <span>/</span> Toyota took better photos of the bZ4x than I did, so I'm using theirs in this review. (credit: Toyota)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A few weeks ago, <a href=\"https://arstechnica.com/cars/2023/05/lexus-2023-rz-450e-disappoints-offering-poor-ev-range-and-a-bumpy-ride/\">we reviewed Lexus' new battery-electric vehicle</a> and came away underwhelmed. Today, it's the turn of its Toyota cousin, the closely related (and unfortunately named) bZ4x. The electric Toyota had a troubled launch last year when the cars had to be recalled <a href=\"https://www.caranddriver.com/news/a40827514/toyota-bz4x-wheel-problem-buyback/\">due to wheels that might fall off</a>. That's all solved now thanks to new bolts, washers, and wheels, so we finally spent a week with the bZ4x. Given this EV's initial reception, I was prepared to be disappointed, but by the end of the week, I was pleasantly surprised. The Toyota isn't particularly flashy, but it is more efficient than I was expecting.</p>\n<p>Let's start with the name, because it's a little weird. But there's a reason behind the alphanumeric jumble. Toyota's plan to reach carbon neutrality is called Beyond Zero, so the EVs it's building to get there adopt the bZ moniker, thus bZ4x. You may want to call it Bizzyforks as at least one friend of mine does—no one will stop you if you do.</p>\n<p>Like the Lexus and the Subaru Solterra, the bZ4x uses Toyota's e-TNGA platform; I mistakenly wrote in that Lexus review that it was an existing platform—it's actually not. It's roughly the same size as the Lexus, too—the wheelbase is an identical 112.2 inches (2,850 mm), but it's a bit shorter (184.6 inches/4,689 mm), a bit narrower (73.2 inches/1,859 mm), and slightly taller (65 inches/1,651 mm).</p></div><p><a href=\"https://arstechnica.com/?p=1959241#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1959241&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5769d9148c032cf2b4e6f612356a1f77e68704cdef893bf3daf0e4e405e60ab9","category":"Tech"}