{"title":"Buyer beware: fake clearance website offering cheap Shimano parts is a scam","link":"https://cyclingtips.com/2021/10/buyer-beware-fake-clearance-website-offering-cheap-shimano-parts-is-a-scam/","date":1635184719000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Shimano-clearance-store-fake-scam-website1-650x366.jpg\" /></div><h2>Buyer beware: fake clearance website offering cheap Shimano parts is a scam</h2><p>\n</p><p>Ever get that feeling something is too good to be true? Well, usually that something is, in fact, too good to be true. </p>\n\n\n\n<p>That’s exactly what <a href=\"https://www.bicycleretailer.com/international/2021/10/22/shimano-warns-clearance-web-store-fake#.YXbt9WZKjzd\">Shimano has said</a> about a website appearing to sell Shimano components at up to 65% off suggested retail price (RRP). The Shimano-clearance website focuses mainly on fishing equipment with pages for reels, rods, apparel, baits, storage, and tools, but also features a “bike components” tab with a drop-down menu offering “off-road bike pedals” and “road bike pedals.” Within these pages, the website lists an extensive list of Shimano pedals with genuine photos, accurate naming and descriptions, but the prices are just too good to be true. </p>\n\n\n\n<p>The site, which we won’t link to, can be found at Shimano dash clearance dot store on an Internet portal near you. </p>\n\n\n\n<p><a href=\"https://cyclingtips.com/2017/04/shimano-dura-ace-r9100-pedals-review/\" target=\"_blank\">Dura-Ace R9100 pedals</a> for $99.98? Why not just price the pedals at $91.00 and pull both my legs. Fancy some XTR pedals legendary for their mud-clearing ability for just $92.99? Well, be warned, it’s only bank accounts getting cleared here.</p>\n\n\n\n<p>In a statement on <a target=\"_blank\" href=\"https://www.shimano.com/en/cms/news/japan/news_detail_591.html\">Shimano.com</a>, dug up by our friends at <a href=\"https://www.bicycleretailer.com/international/2021/10/22/shimano-warns-clearance-web-store-fake#.YXbt9WZKjzd\">Bicycle Retailer and Industry News</a>, the Japanese cycling and fishing equipment giant warned customers a “fake website was found to be posing as Shimano”. Highlighting the website’s attention to detail and apparent authenticity the statement continued, “the website is using the Shimano logo, product images and other content without our authorization”.</p>\n\n\n\n<p>Offering free shipping for orders of more than $40, and featuring a countdown timer to make this once-in-a-lifetime deal even more unmissable, the website has many of the hallmarks of a genuine website. Furthermore, the “about us” page has a heartwarming and welcoming photo of ten people smiling somewhat awkwardly at a camera positioned directly above them. But don’t be fooled. </p>\n\n\n\n<p>The first warning sign something is amiss lies in the opening paragraph. “We leverage the latest tools and technologies to make it as easy as possible for our customers to shop for everything they need to make their businesses go.” How many businesses depend on Dura-Ace pedals to “make their businesses go”? There follows some BS about Shimano-clearance’s “culture built on transparency, collaboration, and innovation”, its “rapid growth”, and award-winning pedigree. That’s funny, given that presumably very few, had even heard of this great website with such stunning deals on Shimano components until the real Shimano released this statement. If anybody finds the real website they ripped this terrible corporate boilerplate from, let us know in the comments. </p>\n\n\n\n<p>Back to the pedals page and more alarm bells are ringing. The prices are ridiculously cheap, even in a world with online retailers regularly offering 18, 25, or even 33% discount on current Shimano products, but more alarmingly this company “obsessed with our customers” has no place for the <a href=\"https://cyclingtips.com/2020/07/an-ode-to-the-shimano-pd-m520-the-worlds-most-reliable-pedal/\" target=\"_blank\">PD-M520, the world’s most reliable pedal</a>. For a company claiming to be “a team of great people who win and lose together (we prefer winning!)”, this is clearly a loss. </p>\n\n\n\n<p>If you need any more, the last clue is the empty social media links at the bottom left of the page. Click on any of the Instagram, Facebook, Pintrest, or YouTube links to jump directly to those sites own home page. Either this award-winning company has such rapid growth it has had no time to create social channels, or Shimano (the real reel manufacturer Shimano) is correct, and this is a fake website, scamming people of their money. I’d bet my last genuine, new, unopened Dura-Ace chain and a pair of used Ultegra pedals it’s the latter. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/buyer-beware-fake-clearance-website-offering-cheap-shimano-parts-is-a-scam/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"5771ad3173de9071fc166b0b92cdb2b788e10a8e5d68bd26a041b5fac7c0ad48","category":"Cycling"}