{"title":"Speculating on the Evolutionary Pathway of the Hypothalamus-Pituitary-Thyroid Axis","link":"https://www.preprints.org/manuscript/202404.0040/v1","date":1711958618000,"content":"Thyroid hormones are essential for regulating the metabolic rate, growth, development, and maintenance of many physiological processes in vertebrates. They are synthesized by the thyroid gland, which is an ancient organ that evolved early in vertebrate evolution. This study aims to characterize the evolutionary path of polymorphic variants associated with the hypothalamus-pituitary-thyroid (HPT) axis by comparing ancient DNA (aDNA) sequences of Late Pleistocene-Holocene hominin populations with those of modern humans. We evaluated the genetic sequences of several populations, including Neanderthals, Denisovans, Palaeolithic hunter-gatherers from European Russia and Sunghir, and Neolithic hunter-gatherers/farmers from Anatolia focusing on genes involved in the development of the thyroid gland and thyroid hormone (TH) biosynthesis, secretion, and transport. Results showed interesting variants in the DIO2 (rs225014), TPO (rs4927611), and TG (rs2069556 and rs1133076) genes. All SNPs seemed to confirm that Neanderthals, and in part Denisovas, were physiologically hypothyroidic. Probably they had lower T3 levels due to defective production or peripheral conversion. From the moment that the most favourable alleles in terms of T3 production appear during the Paleolithic, we are inclined to assume that their selection was linked to environmental pressure.Our study supports insight into the evolutionary history of the endocrine system and can help in providing understanding into the evolution of physiological systems and their adaptation to changing environments. Understanding the evolution of thyroid hormones can also shed light on the mechanisms underlying thyroid disorders in humans.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5776c1da9fba43571ff9f676241d6189bc55887d7e5baf42892418fce406fbb5","category":"Interdisciplinary"}