{"title":"Facebook Reverses Australian Ban on News Sharing","link":"https://www.macrumors.com/2021/02/23/facebook-reverses-australia-news-ban/","date":1614070418000,"content":"Facebook has announced that it will restore the ability for users in Australia to share news content on the social platform, following changes to the country's media code.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/05/facebook.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"aligncenter size-full wp-image-740728\" />\r\n<br/>\r\nThe company <a href=\"https://www.macrumors.com/2021/02/18/facebook-blocks-news-sharing-australia/\">banned</a> all news sharing last week in response to a proposed <a href=\"https://www.accc.gov.au/focus-areas/digital-platforms/draft-news-media-bargaining-code\">Media Bargaining Law</a>, which aims to level the playing field between Australian news media businesses and digital platforms in terms of bargaining power.\r\n<br/>\r\n\r\n<br/>\r\nThe law would allow Australian news publications to negotiate for fair payment for their journalist's work, effectively forcing companies like Facebook and Google to pay for news content.\r\n<br/>\r\n\r\n<br/>\r\nHowever, Facebook said on Tuesday that it had been reassured by discussions over the weekend with the Australian government about negotiated amendments to the bargaining code, adding that it was \"satisfied\" with the agreement they had reached.\r\n<br/>\r\n<blockquote>\"After further discussions, we are satisfied that the Australian government has agreed to a number of changes and guarantees that address our core concerns about allowing commercial deals that recognize the value our platform provides to publishers relative to the value we receive from them,\" Facebook's VP of global news partnerships, Campbell Brown, said in a statement.\r\n<br/>\r\n\r\n<br/>\r\n\"Going forward, the government has clarified we will retain the ability to decide if news appears on Facebook so that we won't automatically be subject to a forced negotiation. We have come to an agreement that will allow us to support the publishers we choose to, including small and local publishers,\" Brown said.</blockquote>Australian authorities plan to introduce further amendments to the proposed law so that the government may not apply the code to Facebook if it can demonstrate a \"significant contribution\" to local journalism, and a two-month mediation period before enforced arbitration comes into effect, allowing parties additional time to reach a private deal.\r\n<br/>\r\n\r\n<br/>\r\nAustralian Treasurer Josh Frydenberg said Facebook chief Mark Zuckerberg had told him the ban would end \"in the coming days\", following the talks. \"Facebook has re-friended Australia,\" he told reporters on Tuesday.\r\n<br/>\r\n\r\n<br/>\r\nDespite Facebook's reversal, its original decision to ban news shared on its platform attracted negative headlines about the company around the world, and prompted other governments to consider moves to curtail its power. Canada has said that it is considering similar changes in its media law, while British politicians also called voiced concerns about Facebook's actions in Australia.\r\n<br/>\r\n\r\n<br/>\r\nHowever, Facebook did receive support from some quarters when it complained that Australia's proposed law had been badly drafted. For instance, Sir Tim Berners-Lee, creator of the web, said he was concerned that forcing companies to pay for certain content could make the internet \"unworkable.\" \r\n<br/>\r\n\r\n<br/>\r\n\"Specifically, I am concerned that that code risks breaching a fundamental principle of the web by requiring payment for linking between certain content online,\" Berners-Lee said.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/facebook/\">Facebook</a>, <a href=\"https://www.macrumors.com/guide/australia/\">Australia</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/23/facebook-reverses-australia-news-ban/\">Facebook Reverses Australian Ban on News Sharing</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/facebook-reverses-australian-ban-on-news-sharing.2285854/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=3WC9-upSca8:6vZhwr3mZkc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=3WC9-upSca8:6vZhwr3mZkc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/3WC9-upSca8\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"577822b15292d607b5e0bc642969e7aeb7eeff78b9883533ba7d20ef83811261","category":"Apple"}