{"title":"Understanding of Spatial Urban Growth Pattern and Associated Landscape Dynamics in Congolese Mining Cities Bordering Zambia from 1990 to 2023","link":"https://www.preprints.org/manuscript/202406.0615/v1","date":1718110622000,"content":"This study investigates the spatial urban growth patterns of cities along the Democratic Republic of Congo (DRC) and Zambia border, a region of significant economic importance characterized by cross-border trade. This activity has led to rapid, but unplanned urban growth. The objective is to quantify the spatial expansion of Congolese cities (Kipushi, Kasumbalesa, Mokambo, and Sakania) bordering Zambia and to evaluate associated landscape changes. The methodology integrates Landsat images from 1990, 2000, 2010, and 2023, coupled with Geographic Information Systems (GIS) and landscape ecology analysis tools. The results reveal substantial landscape transformations in the border cities between 1990 and 2023. These changes are primarily driven by rapid urban expansion, particularly pronounced in Kasumbalesa. Between 1990 and 2023, forest cover declined from 70% to less than 15% in Kipushi, from 80% to 10% in Kasumbalesa, from 90% to 30% in Mokambo, and from 80% to 15% in Sakania. This forest cover loss is accompanied by an increase in landscape element diversity, as indicated by the Shannon diversity index, except in Kipushi, suggesting a transition towards more heterogeneous landscapes. In these border cities, landscape dynamics are also characterized by the expansion of agriculture and savannas, highlighted by an increase in the disturbance index. Spatial pattern changes analysis shows that built-up areas, agriculture, and savannas exhibit trends of patch creation or aggregation, while forests are undergoing processes of dissection and patch attrition. Congolese cities bordering Zambia are undergoing substantial spatial changes propelled by intricate interactions between economic, demographic, and infrastructural factors. Our results highlight the necessity for sustainable development strategies to address challenges such as urban sprawl, deforestation, and fostering cross-border cooperation in border regions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5783c1a00fdb9ac7dd804e768bee5d21925024cbe1eb2977dc852920d743abc7","category":"Interdisciplinary"}