{"title":"Netflix to Take on Apple Arcade With Mobile Games for Subscribers","link":"https://www.macrumors.com/2021/07/20/netflix-mobile-gaming-service/","date":1626813121000,"content":"Netflix today confirmed that it is planning to expand on its TV movie offerings with a new gaming offering. During the company's second quarter earnings report (via <em><a href=\"https://www.cnet.com/news/netflix-confirms-itll-kick-off-original-gaming-with-free-mobile-games-on-its-service/\">CNET</a></em>), Netflix said that gaming is \"another new content category,\" similar to its expansion into original films, animation, and unscripted TV.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/Netflix-16x9.jpg\" />\r\n<br />\r\nNetflix plans to focus primarily on games that are designed for mobile devices, with the games that are offered provided for free to paying subscribers. Netflix said that it wants to learn about how its members \"value games.\"<blockquote>We view gaming as another new content category for us, similar to our expansion into original films, animation and unscripted TV. Games will be included in members' Netflix subscription at no additional cost similar to films and series. Initially, we'll be primarily focused on games for mobile devices. We're excited as ever about our movies and TV series offering and we expect a long runway of increasing investment and growth across all of our existing content categories, but since we are nearly a decade into our push into original programming, we think the time is right to learn more about how our members value games.</blockquote>With the launch of a mobile gaming service, Netflix will be competing directly with <a href=\"https://www.macrumors.com/guide/apple-arcade/\">Apple Arcade</a>, Apple's $4.99 per month service that allows users to access hundreds of ad-free games on <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, Mac, and <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a>.\r\n<br />\r\n\r\n<br />\r\nNetflix's interest in games was <a href=\"https://www.macrumors.com/2021/05/25/netflix-could-offer-apple-arcade-style-service/\">highlighted earlier this year</a> by <em>The Information</em> and <a href=\"https://www.macrumors.com/2021/07/14/netflix-plans-video-game-expansion/\">confirmed last week</a> by <em>Bloomberg</em>. Netflix recently hired former Electronic Arts executive Mike Verdu as president of game development to head up Netflix's gaming division.\r\n<br />\r\n\r\n<br />\r\nThere's no word yet on when exactly Netflix plans to begin rolling out mobile games, nor how those games will be distributed. Apple does not allow alternative app store options on the ‌iPhone‌, so Netflix will have to release games one by one or use a browser-based solution.<div>Tags: <a href=\"https://www.macrumors.com/guide/netflix/\">Netflix</a>, <a href=\"https://www.macrumors.com/guide/apple-arcade/\">Apple Arcade</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/20/netflix-mobile-gaming-service/\">Netflix to Take on Apple Arcade With Mobile Games for Subscribers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/netflix-to-take-on-apple-arcade-with-mobile-games-for-subscribers.2304915/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=fLoqMrDX_Cc:VQGBA7kXf9U:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=fLoqMrDX_Cc:VQGBA7kXf9U:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/fLoqMrDX_Cc\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"57851dd78ee109c1aa099e58a9f7380ef059eabab16ba0d9209043727d8ab7f1","category":"Apple"}