{"title":"<i>Plasmodium</i> gametocyte carriage in humans and sporozoite rate in anopheline mosquitoes in Gondar zuria district, Northwest Ethiopia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306289","date":1719842400000,"content":"<p>by Awoke Minwuyelet, Melkam Abiye, Ayalew Jejaw Zeleke, Sisay Getie</p>\r\n\r\nAlthough the overall burden of malaria is decreasing in Ethiopia, a recent report of an unpredictable increased incidence may be related to the presence of community-wide gametocyte-carrier individuals and a high proportion of infected vectors. This study aimed to reveal the current prevalence of gametocyte-carriage and the sporozoite infectivity rate of <i>Anopheles</i> vectors for <i>Plasmodium</i> parasites. A community-based cross-sectional study was conducted from May 01 to June 30/2019. A total of 53 households were selected using systematic random sampling and a 242 study participants were recruited. Additionally,515 adult female <i>Anopheles</i> mosquitoes were collected using Center for Diseases Control and Prevention (CDC) light traps and mouth aspirators. Parasite gametocytemia was determined using giemsa stain microscopy, while sporozoite infection was determined by giemsa staining microscopy and enzyme linked immunosorbent assay (ELISA). Among the total 242 study participants, 5.4% (95%, CI = 2.9–8.3) of them were positive for any of the <i>Plasmodium</i> species gametocyte. Furthermore, being female [AOR = 15.5(95%, CI = 1.71–140.39)], age group between 15–29 years old [AOR = 16.914 (95%, CI = 1.781–160.63)], no ITNs utilization [AOR = 16.7(95%, CI = 1.902 -146.727)], and high asexual parasite density [(95%, CI = 0.057–0.176, P = 0.001, F = 18.402)] were identified as statistically significant factors for gametocyte carriage. Whereas sporozoite infection rate was 11.6% (95%, CI = 8.2–15.5) and 12.7% (95%, CI = 9.6–16.3) by microscopy and ELISA, respectively. Overall, this study indicated that malaria remains to be an important public health problem in Gondar Zuria district where high gametocyte carriage rate and sporozoite infection rate could sustain its transmission and burden. Therefore, in Ethiopia, where malaria elimination program is underway, frequent, and active community-based surveillance of gametocytemia and sporozoite infection rate is important.","author":"Awoke Minwuyelet","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"57857f1e32df838e53f5d393e92fa52285fd4f325c52c6b9a2436f51216ee9bc","category":"Interdisciplinary"}