{"title":"Potential probiotic characteristics and genomic analysis of a new folate‐producing lactic acid bacteria Lactiplantibacillus plantarum ZFM55","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13552?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Folate is crucial for maintaining health, but humans are unable to synthesize folate and need to obtain it from food. <i>Lactiplantibacillus plantarum</i> can produce the necessary vitamin B for the human body, including folate. Whole genome sequencing technology can clarify the physiological characteristics of folate production in <i>Lactiplantibacillus plantarum</i>. In order to explore new <i>Lactiplantibacillus plantarum</i> that produce folate, the folate production and probiotic characteristics of <i>Lactiplantibacillus plantarum</i> ZFM55 isolated from infant feces were investigated, and whole genome sequencing was performed.</p>\n<h2>RESULTS</h2>\n<p>The folate synthesis ability of <i>Lactiplantibacillus plantarum</i> ZFM55 were measured, and its total folate production was 299.72 ± 28.81 ng mL<sup>−1</sup>. Subsequently, its probiotic properties were explored. The antibacterial test showed that its inhibition zone diameter against <i>Staphylococcus aureus</i> and <i>Salmonella typhimurium</i> was 15.5 ± 0.82 mm and 13.88 ± 0.98 mm, respectively. The tolerance test results indicated that it maintained good activity in simulated gastrointestinal tract and bile salt environments. <i>In vitro</i> intestinal simulation experiments had confirmed that <i>Lactiplantibacillus plantarum</i> ZFM55 can increase the abundance of beneficial bacteria such as <i>Bifidobacteria</i> in the intestine and inhibit the growth of harmful bacteria such as <i>Escherichia</i>_<i>Shigella</i>. Genomic sequencing indicated that the genetic material of <i>Lactiplantibacillus plantarum</i> ZFM55 contains one chromosome and three plasmids, and it has 20 genes related to folate synthesis, which explains its ability to produce folate.</p>\n<h2>CONCLUSION</h2>\n<p>This study reports a new potential probiotic that produces folate, and provides ideas for exploring probiotics with specific probiotic characteristics. © 2024 Society of Chemical Industry.</p>","author":"Zihao Zhang, \nJiayi Xiong, \nLin Chen, \nGang Wang, \nRuomeng Dong, \nFengxuan Wang, \nYingjie Huang, \nXia Meng, \nTiantian Li, \nQing Gu, \nPing Li","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"5785b977927d50154a9f1a3097d7ebb0337b2068b8e5e2b0eb1ae5d246002b37","category":"Environment"}