{"title":"Inferring the metabolic rate of zebrafish from ventilation frequency","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15922?af=R","date":1727256142000,"content":"<h2>Abstract</h2>\n<p>Fish schooling has attracted the interest of the scientific community for centuries. Energy savings have been long posited to be a key determinant for the emergence of schooling patterns. Yet, current methodologies do not allow the precise quantification of the metabolic rate of specific individuals within the school, typically leaving researchers with only a single, global measurement of metabolic rate for the collective. In this paper, we demonstrate the feasibility of inferring metabolic rate of swimming fish using the mouth-opening frequency, a simple proxy that can be scored utilizing video recordings in the laboratory or in the field, even for small fish. The mouth-opening frequency is independent of hydrodynamic interactions within the school, thereby mitigating potential confounding factors that arise when using locomotory measures associated with tail-beat motion. We assessed the reliability of mouth-opening frequency as a proxy for metabolic rate by conducting experiments on zebrafish (<i>Danio rerio</i>) using swimming respirometry. We varied the flow speed from 0.8 to 3.2 body lengths per second and extracted tail-beat motion and mouth opening from video recordings. Our results revealed a strong correlation between oxygen uptake and mouth-opening frequency for nonzero flow speeds but not in quiescent water. Contrary to our expectations, we did not find evidence in favor of the use of tail-beat frequency as a proxy for metabolic rate. Overall, our results open the door to the study of individual metabolic rates in fish schools without confounding factors related to hydrodynamic interactions.</p>","author":"Tianjun Han, \nGiulia Lombardelli, \nSean D. Peterson, \nMaurizio Porfiri","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"5791f81e449d22069a3a781d0cf5041947c1fa2d1a5036349c472f6d55ac2f66","category":"Environment"}