{"title":"Food waste leachate valorization for sustainable biomass production from Arthrospira maxima","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14327?af=R","date":1702550110000,"content":"<h2>Abstract</h2>\n<p><i>Arthrospira</i> has the ability to tolerate effluents from domestic to farm wastewater. Food leachate coming from fruits and vegetables can be toxic in water discharge due to high dissolved oxygen and nutrient demands. Thus, pretreatment is required before passing through wastewater treatment plants, which generates higher costs and contamination in water bodies. In this work, leachate from fruits and vegetables was used in different percentages to produce <i>Arthrospira maxima</i> using airlift-type bioreactors with continuous air flow, two photoperiods, and two inoculums. The treatment with 3% leachate (T1) reached 5.23 g/L after 16 days, while the control reached 3.81 g/L (T0). An optimization of the biomass production was carried out seeking to use the maximum percentage of the leachate, resulting in the best treatment of 9% of leachate (T8) achieving 4.88 g/L. After optimization, three cell disruption methods were applied to the obtained biomass, quantifying amino acids and hydrolysis grade (GH), being the ultrasonication treatment the most important reaching 80% GH and a concentration of 25 mg/g of amino acids, while the unbroken biomass contain 13 mg/g. The <i>Arthrospira maxima</i> species is an algae that can be widely used as a bioremediation method, since it managed to reduce the concentrations of COD and orthophosphates, in addition to containing some of the nutrients that plants require for their development, given that plants require amino acids. During its growth, it is proposed to apply the biomass generated from leachates as a plant biostimulant.</p>","author":"Katty Shcarlen Hernández Gaytán, \nCelestino García Gómez, \nSantiago Iván Suárez Vázquez, \nFernando de Jesús Carballo Méndez, \nJulia Mariana Márquez Reyes, \nRocio Alejandra Chávez Santoscoy","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"579e78e75adc0e046ae02b4db9703b1af105d0929ba2b3d3824871017f2e0c21","category":"Environment"}