{"title":"Video: How to Use an iPad as a Screen for Your Nintendo Switch","link":"https://www.macrumors.com/2023/08/18/ipad-console-display/","date":1692387080000,"content":"If you're on the go and want to play your Nintendo Switch on a larger display than the tiny 6-inch to 7-inch screen that is built into the console, you're in luck if you have a USB-C <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>. With an app and a couple of accessories, you can use your ‌iPad‌ as your Switch display, as <em>MacRumors</em> videographer Dan Barbera demonstrates in his latest video.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nUsing an ‌iPad‌ for a Nintendo Switch was shown off on TikTok recently, and we thought it was a neat idea going under the radar. Though people have mostly demoed a Switch, it works with any console.\r<br />\n\r<br />\nYou'll need a USB-C ‌iPad‌ running <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a> for this to work. The Lightning models can't support the feature because of a specific dongle required. ‌iPadOS 17‌ is expected to launch to the public next month, but there is a public beta available if you want to test it out right now.\r<br />\n\r<br />\nAlong with a USB-C ‌iPad‌, you're also going to need a <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2FCapture-1080P60-Streaming-Recorder-Compatible%2Fdp%2FB08Z3XDYQ7\">USB-C video capture card</a>, which is around $20. It's basically an HDMI to USB-C adapter for the ‌iPad‌ that allows it to hook up to the Switch. After that, you need to install an app. Since this is new ‌iPadOS 17‌ functionality, few apps are available, but <a href=\"https://testflight.apple.com/join/kaEqupTX\">Capture Pro is available via TestFlight</a> and it's what we used for the video. From there, you just need the Switch and an HDMI cable, and Dan demos the whole setup process in the video.\r<br />\n\r<br />\nHave you tried using an ‌iPad‌ as a display for a console? Let us know in the comments below.<br />This article, \"<a href=\"https://www.macrumors.com/2023/08/18/ipad-console-display/\">Video: How to Use an iPad as a Screen for Your Nintendo Switch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/video-how-to-use-an-ipad-as-a-screen-for-your-nintendo-switch.2399019/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"579fe9d3275c8660849f66c0953d4c983965ed41d1d1bf6ff3ae673f31efa287","category":"Apple"}