{"title":"Women’s Gent-Wevelgem 2023 Preview - Route, predictions and contenders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/women-s-gent-wevelgem-2023-preview-route-predictions-and-contenders","date":1679571778000,"content":"\n      <p><span>Gent-Wevelgem has become a crucial race on the Women’s WorldTour calendar in recent seasons. It typically gives the sprinters a good chance at getting victory in a big one-day Classic, but there have been some anomalies with breakaway winners on occasion. This year, the event takes place on March 26th 2023 and has a stellar line-up which includes the peloton’s best sprinters and puncheurs who could go for daring solo attacks.</span></p>\n<div></div>\n<p><span>The typical Belgian weather often plays an important role in this race, with rain and crosswinds sometimes being crucial factors when it comes to deciding the winner. The women’s peloton now also races up the savage Kemmelberg Ossuaire which could make it harder for the sprinters to stick with the bunch and give themselves a shot at going for victory. Gent-Wevelgem is always exciting and unpredictable, and, judging from Women’s WorldTour racing we’ve seen so far this year, we expect 2023’s edition to be one of the best yet.</span></p>\n<h3>Route</h3>\n<p><span>The 162km route of Gent-Wevelgem begins in the town of Ypres, passing under the Menin Gate, a memorial which stands in honour of those who lost their lives during World War I in the Flanders Fields. The first 100 kilometres of the race are pan flat, with the peloton travelling through De Moeren, an exposed, marshy area that can be subject to strong crosswinds.</span></p>\n<p><span>The first climb of the day, the Scherpenberg, comes after 98km of racing and sets off a succession of short, sharp hills. Following the Scherpenberg, the Baneberg, Monteberg and Kemmelberg follow within the next 14km before the riders are given a little respite with a 7km flat section.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ezgif.com-webp-to-jpg_1_1024x1024.jpg?v=1679505131\" alt /></span></p>\n<p><em>Image: Gent Wevelgem</em></p>\n<p><span>This won’t last long, however, as the riders then face the Scherpenberg, Baneberg once again after 117km of racing. Last year, the women’s peloton faced the Kemmelberg Ossuaire (the steeper and longest side of the Kemmelberg climb) for the first time, and they will do so again in 2023. The Kemmelberg Ossuaire has a maximum gradient of 20% and is covered in rough cobbles, it will be the last chance that the peloton has to put the sprinters under pressure before the flat run to the finish.</span></p>\n<p><span>Luckily for those who don’t enjoy the steep gradients, there is then a 34.4km of flatlands which could potentially allow those who have been distanced on the steep climbs to get back into contention for victory. The final 20 kilometres are on wide, exposed roads so there is potential for crosswinds here too and there’s no guarantee of a sprint finish when the riders eventually arrive in Wevelgem.</span></p>\n<h3>Contenders</h3>\n<p><span>Over the last five years, Gent-Wevelgem has become a race which is traditionally suited to the fastest finishers in the peloton who can also get over the series of short climbs that come midway through the race. On the women’s side, Gent-Wevelgem has finished in a reduced bunch sprint every year since 2016 when Chantal van den Broek-Blaak won the race solo by over one minute. Since then, the likes of Lotta Henttala, Marta Bastianelli, Kirsten Wild, Jolien d’Hoore, Marianne Vos and, most recently in 2022, Elisa Balsamo, have taken victory.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/FlandersClassics_1024x1024.jpg?v=1679506238\" alt /></span><em><span>Elisa Balsamo sprints to victory in Gent-Wevelgem 2022 (Image: Flanders Classics)</span></em></p>\n<p><span>This year, </span><b>Elisa Balsamo</b><span> will be back to defend her Gent-Wevelgem title. The Trek-Segafredo rider has had an impressive season so far, finishing second in Trofeo Binda last week and fourth in both the Ronde van Drenthe and Nokere Koerse. Balsamo’s result in Trofeo Binda proves she is climbing well, but we are yet to see her out sprint the likes of </span><b>Lorena Wiebes</b><span> this season. It could be in Trek-Segafredo’s interests to approach those climbs midway through the race aggressively to put Lorena Wiebes under pressure and try and drop her so she doesn’t have a chance of going for victory at the finish, or they may opt to launch attacks with riders like </span><b>Elisa Longo-Borghini</b><span> and </span><b>Shrin van Anrooij</b><span>.</span></p>\n\n<p><span>However, Lorena Wiebes isn’t Team SD Worx’s only option at this race. While the Dutch rider will undoubtedly be their choice if the race does end in a bunch kick, they also have <b>Lotte Kopecky<span> </span></b>as another option if Wiebes is not in the position to sprint for the win. Kopecky has had a stellar season so far, winning both Nokere Koerse and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad\">Omloop het Nieuwsbla</a>d and finishing second in <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a>. She could challenge in a reduced group sprint but will also be looking for opportunities to go for another solo victory.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1248318352_1024x1024.jpg?v=1679506520\" alt /><em><span>Lorena Wiebes celebrates second place behind Kopecky at Nokere Koerse (Image: David Pintens/Getty)</span></em></span></p>\n<p><span>Team DSM’s </span><b>Charlotte Kool </b><span>is another rider who will be fancying her chances in Gent-Wevelgem 2023. The young Dutch sprinter opened her season well at the UAE Tour where she beat her former-teammate Wiebes on two occasions, so she will have confidence about her finishing speed if she is still in contention by the end of the race. However, Kool was unable to climb as well as some of the other sprinters at Omloop het Nieuwsblad, so her main obstacle will be surviving the climbs that come in the middle of the race. If she doesn’t, </span><b>Pfieffer Georgi </b><span>could be the rider who Team DSM back for victory in Gent-Wevelgem.</span></p>\n<p><span>Another sprinter who is in with a real shot of the win is UAE Team ADQ’s </span><b>Marta Bastianelli</b><span>. The experienced Italian won this race back in 2018 so she is familiar with the terrain and already has a victory this season at Le Samyn des Dames.</span></p>\n<p><b>Lotta Henttala </b><span>of AG Insurance-Soudal Quick Step is also a former winner of Gent-Wevelgem and the Finnish rider has had a great start to her first season back in the peloton after having a child, with two top-10 finishes in both the Ronde van Drenthe and Nokere Koerse. Henttala is an outside bet to beat the likes of Wiebes and Kool, but she does seem to be getting stronger with every race she does. Also on the start list for AG Insurance-Soudal Quick Step is Kiwi rider </span><b>Ally Wollaston</b><span> who is fresh off an extremely successful track campaign. If she can convert that speed onto the road, Wollaston could be a serious contender for Gent-Wevelgem.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1469463395_1024x1024.jpg?v=1679506686\" alt /></span><em><span>Shari Bossuyt ahead of Omloop het Nieuwsblad (Image: David Stockman/Getty)</span></em></p>\n<p><span>From Movistar, </span><b>Emma Norsgaard </b><span>is a rider who can climb well and pack a punch at the finish, so she could be a rider to watch if she comes to the line in a reduced bunch and has the chance to fight for victory. The duo of </span><b>Maike van der Duin </b><span>and </span><b>Shari Bossuyt </b><span>of Canyon//SRAM racing are a force to be reckoned with when it comes to bunch sprints too and they also have </span><b>Kasia Niewiadoma i</b><span>n their line-up as an option for a long-range solo attack. FDJ-Suez are without a standout sprinter, (though </span><b>Clara Copponi</b><span> can produce a fast kick if she is on a good day) but </span><b>Grace Brown</b><span> is always a dangerous rider when it comes to brave, opportunistic attacks that can upset the lead out trains. </span><b>Coryn Labecki </b><span>and </span><b>Anna Henderson</b><span> will be the ones to watch from Jumbo-Visma and it’s also worth keeping an eye out for French Champion </span><b>Audrey Cordon-Ragot </b><span>of Zaaf Cycling Team.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-08504_1024x1024.jpg?v=1679506833\" alt /></span><em><span>Alexandra Manly of Team Jayco Alula (Image: Zac Williams/SWpix)</span></em></p>\n<p><span>Team Jayco Alula could be in with a chance of a strong result at Gent-Wevelgem too, they have a team packed with sprinting talent including the likes of</span><b> Ruby Roseman-Gannon</b><span>, </span><b>Letizia Paternoster </b><span>and </span><b>Alexandra Manly.</b> <b>Elinor Barker </b><span>of Team UNO-X is developing well this season and could be well-suited to the terrain of Gent-Wevelgem, but</span><b> Maria Giulia Confalonieri </b><span>could be the sprinter that the team decide to support. Human Powered Health has options with both </span><b>Alice Barnes</b><span> and </span><b>Daria Pikulik.</b></p>\n<p><span>Overall, it’s going to be a battle for the sprinters to stick with the peloton on the tough final climb, but those who can make it over the top have the chance of gunning for victory in what is expected to be a reduced bunch sprint. However, sprinter’s teams will also need to be on the lookout for riders who are trying to chance a sneaky breakaway – there’s a lot of strong riders on the start list.</span></p>\n<h3>Prediction</h3>\n<p><span>We think that Lorena Wiebes of Team SD Worx will get over the climbs that come midway through the race and sprint to victory. The Dutch rider is often unbeatable when she gets a clear run at the finish line and, judging by her performance at Omloop het Nieuwsblad, she’s more likely to be able to stick with the peloton on the steep gradients than her closest sprinting rivals.</span></p>\n<p><em><span>Cover image: Flanders Classics</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"57a5aa4805671b04fdb40062fb002184a521c6a07994ed0dc7ed84a657b39fdb","category":"Cycling"}