{"title":"Mechs, walkers, eVTOL, and more at the 2023 Japan Mobility Show","link":"https://arstechnica.com/?p=1979644","date":1698764225000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/tms-10-of-21-800x603.jpg\" alt=\"A person rides in the Sansei SR-02 walker at the 2023 Japan Mobility Show\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/tms-10-of-21.jpg\">Enlarge</a> <span>/</span> The Sansei SR-02 was among the exhibits at this year's Japan Mobility Show that gave it a feel of the future. (credit: Evan Williams)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Toyota provided flights from Halifax, Canada, to Tokyo, Japan, and five nights in a hotel so we could attend the Japan Mobility Show, plus subsequent briefings and test drives. Ars does not accept paid editorial content.</aside>\n<p>The latest trend in auto shows around the world is to convince us that they aren't auto shows. The car show is out and the mobility show is in, and that means different things for different markets. The Frankfurt International Auto Show, for example, is now IAA Mobility; it has moved to Munich and features loads of bicycles. The Japan Motor Show is now the Japan Mobility Show, but instead of bicycles, it's packed with surreal and sci-fi-ready ways to get you around, some of which are available now.</p>\n<p>Here's a look at the most interesting products from this year's show.</p>\n<h2>Honda eVTOL</h2>\n<p>Honda has always been about more than cars, and that was on display at the Japan Mobility Show, starting with its eVTOL concept.</p></div><p><a href=\"https://arstechnica.com/?p=1979644#p3\">Read 66 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1979644&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"57b3e4026c3357cb7929dcf046a5613ca699ad170cb427b60258c9e643a7a6b6","category":"Tech"}