{"title":"Impact of Bariatric Surgery on Sarcopenia Related Parameters and Diagnosis&mdash;The Preliminary Results of EXPOBAR Study","link":"https://www.preprints.org/manuscript/202407.1018/v1","date":1720766277000,"content":"Introduction: Obesity affects over 650 million individuals worldwide and it is a major public health problem. Bariatric surgery is the most effective treatment for severe obesity, resulting in significant weight reduction and improvement in obesity-related conditions. However, the weight loss achieved through bariatric surgery often correlates with a notable decrease in skeletal muscle. This correlation suggests an elevated risk of sarcopenia among patients after surgery. The aim of this study was to evaluate the effects of obesity and bariatric surgery on sarcopenia-related indicators and diagnosis before and after surgery. Methods: A total of 17 bariatric surgery patients were included in this prospective study. The parameters to diagnose sarcopenia were determined for each participant, based on EWGSOP2 and EASO/ESPEN consensuses. All evaluations were performed on the five moments of this study: before surgery and at 1, 6, 12 and 18 months after surgery. Results: In this study, 88.2% of the subjects were female, the mean BMI was 42.9 kg/m² and the mean weight was 105.9 kg. After surgery, the mean weight consistently decreased, with all differences from baseline being statistically significant (p&lt;0.001). When using the SARC-F questionnaire for screening, the risk of sarcopenia increased post-surgery, and decreased at 12 months, declining to zero at 18 months. Muscle strength decreased significantly (p=0.002) at the 1 month after surgery assessment, with slight variations thereafter, none statistically significant. Muscle mass was normal before surgery but decreased significantly post-surgery (p&lt;0.001). When applying the ESPEN/EASO consensus cut-off criteria for sarcopenic obesity, 35.3% of the patients met the criteria preoperatively. After surgery, the results increased to 70.6% in the first month but decreased afterward to 41.2% at 6 months. Discussion: This study evaluated the impact of bariatric surgery on sarcopenia and sarcopenic obesity, for a duration of up to 18 months after surgery, using the EWGSOP2 and ESPEN/EASO consensuses criteria. Bariatric surgery, the most effective treatment for severe obesity, often results in muscle mass loss alongside fat loss. Handgrip strength, a key sarcopenia indicator, showed a significant early post-surgery decline, whereas the weight-dependent sit-to-stand test did not. This suggests weight loss impacts different muscle function tests variably. Muscle mass decreased continuously after surgery. However, other indicators had mixed results. Applying ESPEN/EASO guidelines, the study found a temporary post-surgery increase in sarcopenic obesity, peaking at one month and returning to pre-surgery levels by six months. However, different criteria led to different results. Conclusion: The results indicate a clear deleterious impact of bariatric surgery on muscle strength and mass, the most important indicators of sarcopenia. Also, the impact seems to occur very early after surgery, indicating that the appropriate timeframe to try to prevent this effect may be the prehabilitation period followed by the post-surgery timeframe.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"57c28fb3f45f659a477bdc8c3e0cc87fa5dadd0eb648f6557fc5131f217b6f78","category":"Interdisciplinary"}