{"title":"ผลรีวิว GeForce 4060 ราคาถูกลง กินไฟน้อยลงมาก แรงขึ้นจาก 3060 แต่ให้แรมน้อย 8GB","link":"https://www.blognone.com/node/134651","date":1688378658000,"content":"<div><div><div><p>สัปดาห์ที่ผ่านมา NVIDIA เริ่มวางขาย <a href=\"https://www.blognone.com/node/133898\">GeForce RTX 4060 รุ่นเดสก์ท็อป</a> ซึ่งถือเป็นการ์ดที่ราคาถูกที่สุดในเจน 4000 Ada Lovelace (ยังไม่ชัดว่าจะมี 4050 เวอร์ชันเดสก์ท็อปตามมาอีกหรือไม่)</p>\n<p>รีวิวจากสื่อต่างประเทศหลายรายก็ออกมาในทางเดียวกันว่า GeForce RTX 4060 เป็นการ์ดระดับเมนสตรีม ออกแบบมาเพื่อเล่นเกมความละเอียด 1080p โดยมีราคา 299 ดอลลาร์ ลดลงจากการ์ดรุ่น 60 ของเจนก่อน (3060) อีกทั้งประหยัดพลังงานมากขึ้นกว่าเจนก่อนๆ มาก (TDP 115W vs 3060 ที่ 170W) ซึ่งเป็นข้อดีของสถาปัตยกรรม Ada Lovelace ในภาพรวม</p>\n<p>สมรรถนะของ 4060 ถือว่าเพิ่มขึ้นจาก 3060 และเป็นรอง 3060 Ti อยู่เล็กน้อย มีสมรรถนะใกล้เคียงกับการ์ดคู่แข่งระดับเดียวกันคือ <a href=\"https://www.blognone.com/node/133993\">Radeon RX 7600 ที่ให้แรมเยอะกว่า (12GB) และราคาถูกกว่ากัน 30 ดอลลาร์</a> อีกตัวเลือกที่น่าสนใจคือ Radeon 6700 XT ของเจนก่อนที่ราคาลดลงมาเกือบ 300 ดอลลาร์เท่ากันแล้ว แต่ถ้าวัดสมรรถนะแบบเปิด Raytracing ด้วย 4060 ยังเหนือกว่าค่าย AMD</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/51128d74759ff47d5c5fd1f7eec04e62.jpg\" /></p>\n<p>อย่างไรก็ตาม มันมีข้อจำกัดสำคัญเรื่องแรมเพียง 8GB แบนด์วิดท์ 128-bit ซึ่งลดลงจาก 12GB 192-bit ของ 3060 (รวมถึงการ์ดรุ่น 60 เจนก่อนๆ) ทำให้เริ่มไม่พอแล้วสำหรับเกมยุคปัจจุบันที่มีปริมาณเท็กซ์เจอร์เยอะๆ (แม้ความละเอียดแค่ 1080p) ซึ่งเป็นจุดอ่อนเดียวกับ 4060 Ti รุ่น 8GB ที่วางขายไปก่อนหน้านี้ และโดนวิจารณ์เรื่องนี้อย่างมากว่า NVIDIA ลดต้นทุนจนเกินไป โดย PC Gamer บอกว่ามันควรเรียกว่า 4050 มากกว่า 4060 ด้วยซ้ำ</p>\n<p>นอกจากนี้ฟีเจอร์เด่นของค่าย NVIDIA อย่างการเปิด DLSS3 เพื่อเพิ่มเฟรมเรต ก็ยังไม่ค่อยมีประโยชน์มากนัก เพราะมีเกมรองรับน้อย แต่ถ้าซื้อมาเพื่อเล่นเกมเหล่านี้ (เช่น Cyberpunk, Forza Horizon 5, Hitman 3) ก็ช่วยเพิ่มเฟรมเรตได้จริง</p>\n<p>เว็บไซต์ Ars Technica ให้นิยามว่า 4060 เป็นการ์ดจอระดับกลางๆ สำหรับคนส่วนใหญ่ (The midrange GPU for most people) ที่ไม่มีเงินถุงเงินถังซื้อการ์ดราคาแพงๆ การอัพเกรดจากการ์ดรุ่นเก่าตั้งแต่ 2060 ลงไปถือว่าคุ้มค่า แต่ถ้าอัพเกรดมาจาก 3060 ย่อมไม่คุ้มแน่นอน เพราะประสิทธิภาพที่เพิ่มขึ้นเจนต่อเจนมีน้อยเกินไป</p>\n<p>ในตลาดแม้มีตัวเลือกอื่นอย่าง AMD Radeon RX 7600 และ Intel Arc A750 ที่ราคาถูกกว่า แต่การใช้การ์ด NVIDIA ก็มีข้อดีตรงที่มีเกมซัพพอร์ตเป็นจำนวนมาก เล่นได้อย่างสบายใจกว่า</p>\n<ul>\n<li><a href=\"https://www.tomshardware.com/reviews/nvidia-geforce-rtx-4060-review-asus-dual\">Tom's Hardware ให้คะแนน 3.5/5</a></li>\n<li><a href=\"https://arstechnica.com/gadgets/2023/06/geforce-rtx-4060-review-not-thrilling-but-a-super-efficient-299-workhorse/\">Ars Technica ให้เรต Approved</a></li>\n<li><a href=\"https://www.pcgamer.com/nvidia-geforce-rtx-4060-review-benchmarks-performance/\">PC Gamer ให้คะแนน 77/100</a></li>\n</ul>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/geforce\">GeForce</a></div><div><a href=\"/topics/nvidia\">NVIDIA</a></div><div><a href=\"/topics/gpu\">GPU</a></div><div><a href=\"/topics/ada-lovelace\">Ada Lovelace</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"57caf6d759957eeae8fd8df8016603880ba808b7b4c61366ea5e7999281cc56c","category":"Thai"}