{"title":"Laggy performance in macOS Big Sur’s Finder? Try closing tabs","link":"https://www.macworld.com/article/342728/macos-big-sur-finder-laggy-try-closing-tabs.html","date":1618570800000,"content":"\n<div>\n<section><div></div></section><p>There’s nothing worse than a mysterious slowdown on your Mac. You search online for answers. You restart. You zap the PRAM or NVRAM (on an Intel Mac). You sigh in frustration. But sometimes the simplest action provides the answer. That appears to be the case with <em>some</em> macOS Big Sur Finder slowdowns.</p>\n\n\n\n<p>After updating an iMac to Big Sur recently, I found the Finder excruciatingly slow. It seemed broken at times. Sometimes, relaunching the Finder sped it up briefly: holding down the Option key, Control-click the Finder icon in the Dock and select Relaunch. You can also press Command-Option-Esc, select the Finder, and click Relaunch.</p>\n\n\n\n<p>Unfortunately, that solution worked briefly, and the Finder would resume its sloth-like state. As I examined what I had in action in the Finder, a single window with eight tabs stood out. I moved those tabs into individuals windows, and the Finder was back to its normal full-speed action. Somehow, perhaps because of the migration from an older macOS, the tabbed window was eating up an enormous amount of processor time.</p>\n\n\n\n<p>To test whether it was a limited problem, I then went from window to window and pressed Command-Shift-T to reveal the tab bar in a single-tabbed window and dragged each tab back into a single window. The speed remained the same.</p>\n\n\n\n<p>It’s possible I’ll see performance degrade again, and then have a tool in my arsenal. For now, something in the Finder’s accounting for tab management has been reset.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a> including screen captures as appropriate, and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"57cbc56591f5300af3a42386171f791d0b2a32b8a10095959fea1b7bb8080607","category":"Apple"}