{"title":"Here are the first official Pixel 6 pictures and info","link":"https://arstechnica.com/?p=1784502","date":1627923406000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/E7zCs8iXsAM4RZE-980x980.jpg\" /></div>\n        <p>\n          The Pixel 6. Notice how the bottom one has a bigger area above the camera block? That's the \"Pro\" model.                       [credit:\n                        Google                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Google has posted an official \"sneak peek\" of its upcoming Pixel 6 flagship. Contained in a <a href=\"https://twitter.com/madebygoogle/status/1422226005339557889\">tweet storm</a> and a <a href=\"https://store.google.com/magazine/google_pixel_6\">teaser website,</a> we're finally getting official pictures and confirmation for many of the rumors that have been out there.</p>\n<p>First up, one of the most exciting aspects of the Pixel 6 is the inclusion of the Google \"<a href=\"https://arstechnica.com/gadgets/2021/04/new-reports-say-the-pixel-6-will-feature-a-custom-google-whitechapel-soc/\">Whitechapel</a>\" SoC. This is Google's first in-house SoC that will serve as the main chip powering the phone. It represents Google dumping Qualcomm as the SoC manufacturer and taking a more Apple-like vertical approach to its phone hardware. The chip is officially called \"Google <a href=\"https://en.wikipedia.org/wiki/Tensor\">Tensor</a>,\" and it's described by the company as \"the brand new chip designed by Google, custom-made for Pixel.\"</p>\n<p>\"The highlight of Tensor is that it can process Google’s most powerful AI and ML models directly on #Pixel6. You’ll see a transformed experience for the camera, speech recognition, and many other Pixel 6 features,\" Google said in its posts today. \"Speech recognition is another foundational technology where you will see a huge improvement in #Pixel6. Google Tensor allows us to make big leaps in: Voice commands, Translation, Captioning, &amp; Dictation.\"</p></div><p><a href=\"https://arstechnica.com/?p=1784502#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1784502&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"57ce077b72f2e5f2ee0ebaf152c50b0af6191b12ab0b1efb0d5ebfd941af244c","category":"Tech"}