{"title":"Celine, a long interspersed nuclear element retrotransposon, colonizes in the centromeres of poplar chromosomes","link":"https://academic.oup.com/plphys/article/195/4/2787/7656883?rss=1","date":1713830400000,"content":"<span><div>Abstract</div>Centromeres in most multicellular eukaryotes are composed of long arrays of repetitive DNA sequences. Interestingly, several transposable elements, including the well-known long terminal repeat centromeric retrotransposon of maize (CRM), were found to be enriched in functional centromeres marked by the centromeric histone H3 (CENH3). Here, we report a centromeric long interspersed nuclear element (LINE), <span>Celine</span>, in <span>Populus</span> species. <span>Celine</span> has colonized preferentially in the CENH3-associated chromatin of every poplar chromosome, with 84% of the <span>Celine</span> elements localized in the CENH3-binding domains. In contrast, only 51% of the CRM elements were bound to CENH3 domains in <span>Populus trichocarpa</span>. These results suggest different centromere targeting mechanisms employed by <span>Celin</span>e and CRM elements. Nevertheless, the high target specificity seems to be detrimental to further amplification of the <span>Celine</span> elements, leading to a shorter life span and patchy distribution among plant species compared with the CRM elements. Using a phylogenetically guided approach, we were able to identify <span>Celine</span>-like LINE elements in tea plant (<span>Camellia sinensis</span>) and green ash tree (<span>Fraxinus pennsylvanica</span>). The centromeric localization of these <span>Celine</span>-like LINEs was confirmed in both species. We demonstrate that the centromere targeting property of <span>Celine</span>-like LINEs is of primitive origin and has been conserved among distantly related plant species.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"57cfe5a2d3201dd718cefc46613822ac51d548f1a78935e9346306a4b8ae2a98","category":"Environment"}