{"title":"Using stream dissolved oxygen and light relationships to estimate stream primary production on mountainous headwater stream ecosystems","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2699?af=R","date":1723183126000,"content":"<h2>Abstract</h2>\n<p>Headwater streams influence the carbon cycle, but their productivity estimation remains challenging. We propose the use of dissolved oxygen data (% saturation, DOsat) and on-site photosynthetically active radiation (PAR) data to develop DOsat~PAR curves as an analogy to the well-known photosynthesis–irradiance (P–E) curves. The premise of our research is that although these curves are simple, they provide detailed information of stream ecosystem productivity dynamics. We used data from two streams in the Oregon Coast Range to investigate daily gross primary productivity (GPP). We used properties of the light-limited portion of the DOsat~PAR regression curves to produce a model to estimate GPP. We found that the slope of the DO–PAR relation varied widely between 1.6 × 10<sup>−4</sup> and 0.045 and had strong correlations (<i>r</i>\n<sup>2</sup> &gt; 0.78). The data from one of the two study sites (Oak Creek) was used for model development while the data from the other site (South Fork Mill Creek) was used for model validation. The model's ability to quantify the effects of a discrete storm event on stream productivity was tested by comparing GPP estimates calculated through a Bayesian framework (streamMetabolizer) and our raw data-driven estimates of GPP which were based on the variability of the DOsat~PAR regression curves. The proposed methodology was successful in estimating GPP in headwaters. We foresee that this method may be used to assess disturbances and construct a baseline understanding of productivity dynamics in other headwater ecosystems that is independent of the methodological challenges of the current stream metabolism models.</p>","author":"Sandra R. Villamizar, \nCatalina Segura, \nDana R. Warren","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"57d38d50c979853d9240d6a5b8a5a3b0caf50c46f55b6a43309a4ab57d2c5419","category":"Environment"}