{"title":"Preparation, structural and morphological characterization of cartilage type II collagen peptide assemblies from sturgeon head","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13717?af=R","date":1720180517000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Sturgeon cartilage type II collagen peptides (SHCPs) can self-assemble and be used to prepare collagen peptide assemblies. Self-assembled peptides have great potential for applications in the food industry. In the present study, self-assembled peptides were prepared from sturgeon cartilage and then characterized.</p>\n<h2>RESULTS</h2>\n<p>The SHCPs self-assembled and formed collagen peptide assemblies. After response surface experiment optimization, the optimal enzyme digestion process comprised 43.1 °C, 3.37 h and 0.96% enzyme addition, and the peptide yield was 78.46%. Physicochemical analysis showed that the SHCPs were amphiphilic, with an average molecular weight of 1081 Da, and were rich in hydrophobic amino acids. Peptide sequence identification showed that the peptides of SHCPs with polar amino acids followed by hydrophobic amino acids could be self-assembled through hydrogen bonding and hydrophobic interaction. Through turbidity experiments, Fourier transform infrared spectroscopy and scanning electron microscopy, we demonstrated that SHCPs can self-assemble into reticular and tubular structures under specific conditions. Furthermore, both the SHCPs-Ca and SHCPs-Mg assemblies were stabilized within a pH range consistent with that of the human gastrointestinal tract.</p>\n<h2>CONCLUSION</h2>\n<p>The present study provides a simple and safe method for preparing novel self-assembled peptide materials from sturgeon by-products, providing a scientific basis for the exploitation of sturgeon cartilage and potentially reducing resource wastage. © 2024 Society of Chemical Industry.</p>","author":"Pengbo Cui, \nTianlun Shao, \nJianfei He, \nWei Tang, \nMingxiao Yu, \nWeixue Zhao, \nJianhua Liu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"57da73e4105901ecbcd980a539526f0610bd01fe151ee0e77a350311651cae55","category":"Environment"}