{"title":"Mothers’ perspectives of the barriers and facilitators to reducing young children’s screen time during COVID-19: A reddit content analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301089","date":1711548000000,"content":"<p>by Leann Blake, Patricia Tucker, Leigh M. Vanderloo</p>\r\n\r\nScreen time for children under 5 is associated with various health risks. Amidst the COVID-19 pandemic, screen use among young children increased significantly. Mothers were more likely than fathers to be the primary caregivers and disproportionally assumed the responsibility of monitoring their children’s screen time. Several studies have examined children’s screen use throughout the pandemic; however, few have addressed mothers’ experiences. Therefore, the current study aimed to investigate mothers’ perceptions regarding the barriers and facilitators faced when trying to reduce their child’s pandemic screen time, as expressed on Reddit (a social media platform for anonymous discussion and information sharing). Two subreddit forums targeted toward mothers, \"mommit\" and \"beyondthebump,\" with 646,000 and 554,000 users, respectively, were examined. Posts were collected using related search terms and screened for inclusion by three independent researchers. Inductive thematic content analysis was leveraged to identify themes. In total, 582 posts were reviewed from March 14th, 2020, to August 31st, 2022. Qualitative analysis yielded 5 themes; 6 barriers and 2 facilitators were derived from themes and/or subthemes, where applicable. Results suggest that mothers faced barriers when trying to reduce their child’s screen time, including their competing work and in-home obligations, using screens to occupy their child during travel, child screen use with other caregivers, offering their child screen time while they needed rest, pandemic changes in routine, and using screens to encourage their child to engage in necessary behaviours. However, facilitating factors, including advice received from other mothers on how to reduce their child’s screen time and the sharing of non-screen alternatives supported mothers in lowering their children’s screen time. These results are important for future interventions, which may utilize the conclusions of this study to address what mothers perceive to be helping or hindering them, thus empowering mothers to successfully limit their children’s screen time.","author":"Leann Blake","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"57ec78b928786ee1deb6dc3d41f0d9d5978df56a0e91169dadbadea1faac416b","category":"Interdisciplinary"}