{"title":"Internet providers that won FCC grants try to escape broadband commitments","link":"https://arstechnica.com/?p=1958448","date":1691011096000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/getty-abstract-broadband-network-800x533.jpg\" alt=\"An abstract illustration shows flowing lines to data to represent a broadband network.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/getty-abstract-broadband-network.jpg\">Enlarge</a> (credit: Getty Images | Yuichiro Chino)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A group of Internet service providers that won government grants are asking the Federal Communication Commission for more money or an \"amnesty window\" in which they could give up grants without penalty.</p>\n<p>The ISPs were awarded grants to build broadband networks from the FCC's Rural Digital Opportunity Fund (RDOF), which <a href=\"https://arstechnica.com/tech-policy/2020/12/spacex-gets-886-million-from-fcc-to-subsidize-starlink-in-35-states/\">selected funding recipients</a> in December 2020. A group calling itself the \"Coalition of RDOF Winners\" has been meeting with FCC officials about their requests for more money or an amnesty window, according to several filings submitted to the commission.</p>\n<p>The group says broadband construction costs have soared since the grants were announced. They asked for extra money, quicker payments, relief from letter of credit requirements, or an amnesty window \"that allows RDOF winners to relinquish all or part of their RDOF winning areas without forfeitures or other penalties if the Commission chooses not to make supplemental funds available or if the amount of supplemental funds the Commission does make available does not cover an RDOF Winner's costs that exceed reasonable inflation,\" <a href=\"https://www.fcc.gov/ecfs/document/1073152262968/1\">a July 31 filing</a> said.</p></div><p><a href=\"https://arstechnica.com/?p=1958448#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1958448&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"57f71673b243afb407f6ec5390021fb83b07d4627d83f6c5950c3b83bfc4ac77","category":"Tech"}