{"title":"Evaluation of Energetic Potential of Slaughterhouse Waste via Anaerobic Digestion by Pressure Induced Separation in West-Africa","link":"https://www.preprints.org/manuscript/202409.2205/v1","date":1727441499000,"content":"Anaerobic digestion has the potential to convert organic waste materials into valuable energy. At the same time, using press water from biomass materials for energy generation, while taking advantage of the resulting cake for other purposes is an emerging approach. Therefore, this study aimed to investigate the residual potential expected from a typical biogas feedstock in the West African context after it has been mechanically separated into liquid and solid phases. Hence, in this study, the rumen contents of ruminants (cow, goat and sheep) and their proportionate ratios were obtained from an abattoir in Ghana. Resource characterisation of the waste samples were carried out in the Central laboratory of the HFR, Germany. Anaerobic batch tests for biogas (biomethane) yield determination were set-up using the Hohenheim Biogas Yield Test (HBT). Inoculum used was obtained from an inoculum production unit at the Hohenheim University biogas laboratory. The trial involved two different forms of the sample: mixture of rumen contents, press water, and inoculum, each in four (4) replicates. The trial was carried out at a mesophilic temperature of 37°C. Results obtained over a seventy (70) day period were transformed into biogas yields. Overall, the results show that the current contents are suitable for biogas generation as an option, as opposed to the current form of disposal at a refuse dump. However, using these mixtures in their original forms is more technically viable than using press water without further treatment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"58039022d8a4791216ed0f699857968eb80314d068be24b5194a8bab8e4c4d2d","category":"Interdisciplinary"}