{"title":"Sulfur isotopes in Archaean crustal reservoirs constrain the transport and deposition mechanisms of nickel-sulfides in komatiites","link":"http://link.springer.com/10.1007/s00126-024-01253-8","date":1722470400000,"content":"<h3>Abstract</h3>\n                    <p>Assimilation and prolonged suspension of crust-derived sulfide liquid in komatiites are essential to form Ni-rich mineralisation. Evaluating the spatial relationship between komatiite-hosted Ni mineralisation and crustal S sources may thus provide insights into mechanisms of transport, metal enrichment and deposition of assimilated sulfide liquid. This study applied facies analysis and S isotopes to sulfides in Ni-mineralised komatiites and stratigraphically underlying bimodal volcanic-volcaniclastic and sedimentary rocks, which formed during rifting in the Agnew-Wiluna Greenstone Belt, Western Australia. The results revealed a lateral variation from rift-distal sedimentary sulfides, through sulfidic BIF, to rift-proximal VMS-style sulfides, the latter of which was predominantly assimilated by komatiites. Both crustal and komatiite-hosted sulfides were overprinted by granite-related skarn alteration during later basin inversion. Spatial S isotopes correlation revealed that Ni mineralisation in komatiites predominantly formed &lt; 5 km from their crustal S sources, excluding long lateral transport as the main metal enrichment mechanism. Rather, metal enrichment likely happened through multiple cycles of sulfide entrapment and entrainment in lava flow vortices that formed in the wake of topographic steps represented by syn-rift faults. These faults were the main loci for pre-existing crustal weaknesses, hydrothermal fluid circulation, and VMS-style sulfide deposition, which were subsequently utilised by komatiites for enhanced thermo-mechanical erosion and crustal sulfide assimilation. This study shows that proximity to the syn-rift faults was the dominant control on the formation of komatiite-hosted Ni–sulfide mineralisation, regardless of substrate lithology. The S isotope signatures of crustal sulfides may be used as a proxy to identify syn-rift faults in highly deformed terranes.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"5815232419913e6db536fe9856875f95d30fed3dc1767c176807340a0376056c","category":"Environment"}