{"title":"Within the boundaries of the Dnipro ice lobe: Biotic dynamics in the Middle Dnipro area (Ukraine) during deglaciation and postglacial stages","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3659?af=R","date":1727951377000,"content":"<h2>ABSTRACT</h2>\n<p>Several new vertebrate and plant taphocoenoses of fluvial origin have been found in central Ukraine, within the area previously covered with till of the late Chibanian Dnipro glacier. These finds represent a timespan from the late Dnipro glacial to the Pryluky interglacial of the regional stratigraphic scheme of Ukraine and fill an important palaeofaunistic gap: arcto-boreal species have been revealed for the first time in deposits of the Dnipro/Kaidaky, Tiasmyn and an intra-Pryluky cold interval. Their appearance in the fossil record marks the most extreme periods of cooling, but even during these extremes arcto-boreal forms did not dominate. Similarly, a few warm-loving species appear only during interglacials. The tundra–steppe semblance of vertebrate fauna remains generally stable during this time. The new findings were also used to test existing correlation models between the stratigraphic scheme of Ukraine and Marine Isotope Stages (MIS). For this, we used the <i>Arvicola</i> interval-zones: the zone of the extinct water vole <i>Arvicola chosaricus</i>, which, in the studied area, covers the Dnipro, Kaidaky and Tiasmyn stages, and of the extant <i>A. amphibius</i> of the Pryluky interglacial and subsequent time periods. In different parts of Europe, replacement between these two species took place from MIS 6–MIS 5 to MIS 5. This indicates that the Tiasmyn with the latest <i>A. chosaricus</i> might represent both MIS 6 and a cold interval within MIS 5. For further refinement of the correlation, we use the newly discovered taphocoenoses with a clear stratigraphic sequence, together with the previously studied Maksymivka locality. They have a clear stratigraphic relation to the Dnipro till, and together with the above-mentioned climatic signal, these proxies support the correlation of the Dnipro glacial with MIS 6, the Kaidaky interglacial with MIS 5e, the Tiasmyn cold interval with MIS 5d, and the Pryluky interglacial with MIS 5c and younger.</p>","author":"Lilia Popova, \nYuriy Veklych, \nOleksandr Kovalchuk, \nAlina Mishta, \nRenata Stachowicz‐Rybka, \nLeonid Gorobets, \nVadym Yanenko, \nYevheniia Nezdolii, \nAlina Stupak, \nMykola Stakhiv, \nAndrii Yevstropov, \nMykhailo Lyshenko, \nLeonid Rekovets, \nZoltán Barkaszi","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"5816a9e2a57090d71c4a840dbd01313a3aa35ab8b51cd542171e1b84c40a44bd","category":"Environment"}