{"title":"Effects of soccer instruction on the executive functions and agility of children in early childhood","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312265","date":1729692000000,"content":"<p>by Sho Aoyama</p>\r\n\r\nStudies have shown that in open-skill sports the executive function of high-performing players is significantly higher than that of the control group. However, whether participation in soccer effectively improves executive function is unclear because previous studies lacked baseline measurements of executive function. Furthermore, agility, mostly developed in early childhood, is the most demanding component of physical fitness in open-skill sports, requiring sudden changes in body direction while running at full speed. However, no studies have examined the improvement in agility of young children participating in open-skill sports through comparison with a control group. This study aimed to clarify whether instruction in soccer, an open-skill sport, can effectively improve the executive function and agility of kindergarteners compared to a control group. In April 2020, 31 five-year-old children enrolled in kindergarten K in H prefecture in Japan were targeted as the intervention group and received soccer instruction for 12 weeks. In April 2020, a control group was established, consisting of 39 five-year-old children enrolled at the same kindergarten. Participants in both groups were measured for agility, inhibition, and working memory before and after (pre–post) soccer instruction for the intervention group. For each item, a two-way ANOVA of the group (intervention group・control group) x measurement period (pre–post) was performed, showing no significant interactions for working memory and agility. Because only the inhibition effect was significant, simple main effects were tested. Regarding inhibition, although the intervention group (<i>M</i> = 0.18, <i>SD</i> = 0.01) and the control group (<i>M</i> = 0.17, <i>SD</i> = 0.01) did not differ significantly in performance pre-intervention, the intervention group (<i>M</i> = 0.23, <i>SD</i> = 0.01) showed significantly better performance post-intervention compared to the control group (<i>M</i> = 0.19, <i>SD</i> = 0.01) (<i>p</i> &lt; .01). Thus, soccer instruction improved kindergarteners’ inhibition, to a level significantly higher than that of the control group. Still, no differences were found between groups regarding working memory and agility.","author":"Sho Aoyama","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"581ccc75e862db528f808e82f08555786223cf3e7fc3c64e67c75150eb8ff984","category":"Interdisciplinary"}