{"title":"PSVIII-11 Cold stress responses in beef heifers with divergent residual feed intake","link":"https://academic.oup.com/jas/article/102/Supplement_3/583/7757814?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Beef cattle have been selected for feed efficiency to reduce feeding costs and environmental impact. Still, there is a paucity of knowledge on how feed-efficient beef females maintained outdoors respond to extreme cold weather. Therefore, this research assessed blood parameters and rumen temperature (RT) of beef heifers with divergent residual feed intake (RFI) during winter in Alberta, Canada. Ccrossbred beef heifers [n = 41; body weight (BW) = 474 ± 38; approximately 21 mo of age) previously tested for RFI in drylot and classified as either more (n = 21; LOW-RFI = -1.0 ± 0.70) or less feed-efficient (n = 20; HIGH-RFI = 1.4 ± 1.00) were used in a completely randomized design for 55 d (January to March). Heifers were maintained in a single dormant pasture and received free-choice hay. A Smart Rumen Bolus (Moonsyst) was used to automatically record RT. Blood samples were collected every 18 ± 8 d based on weather conditions to determine concentrations of blood urea nitrogen (BUN), non-esterified fatty acids (NEFA), insulin-like growth factor 1 (IGF-1), β-Hydroxybutyric acid (BHBA), leptin (LEP), free triiodothyronine (fT3), haptoglobin (HP), heat shock protein 70 (HSP70), gamma-aminobutyric acid (GABA), and serotonin (5-HT). Environmental conditions were assessed by calculating the Climate Comprehensive Index (CCI) using temperature, wind speed, solar radiation, and humidity from a weather station within 1 km of the pasture. Based on CCI, daily weather conditions were considered to impose mild, moderate, severe, extreme, and extremely dangerous stress risk for 3, 15, 19, 13, and 5 d of the study, respectively. Leptin was greater in HIGH vs. LOW-RFI heifers (<span>P</span> = 0.05; 5.21 vs. 4.56 ng/ml). A tendency for an RFI × day interaction was detected for GABA (<span>P</span> = 0.09) and HP (<span>P</span> = 0.06), with greater concentrations in the LOW-RFI heifers on extreme and extremely dangerous cold days, respectively. However, HP concentrations were below the threshold for inflammation throughout the study. An effect of day was detected for IGF-1, LEP, BUN, NEFA, BHB, and 5-HT (<span>P</span> ≤ 0.001). The least concentrations of BHBA and BUN (128 nmol/L and 4.8 mg/dL, respectively) were recorded, along with the greatest NEFA concentration (0.619 mEq/L), during an extremely dangerous cold day. On extreme cold days, LEP (3.7 ug/L) was the least and 5-HT was the greatest (56.7 ng/mL). Rumen temperature was greater in LOW-RFI vs. HIGH-RFI when day imposed greater risks to cause cold stress (<span>P</span> = 0.01). However, no differences were detected in final BW or average daily gain (<span>P</span> ≥ 0.24). In summary, results indicate differential blood parameter dynamics and rumen temperature fluctuations between high and low RFI heifers under varying cold stress conditions. Greater plasma leptin concentrations and decreased rumen temperature are likely associated with heightened thermogenic activity and cold stress in less-feed-efficient heifers.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"58226af8d3b6fd93efab40322db649d8b5630339794b6fe7616a9c67e4d466fd","category":"Environment"}