{"title":"Balancing ecology and practicality to rank waterbodies for preventative invasive species management","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12362?af=R","date":1722994794000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/8f074ac1-ecc1-4310-ac9b-2be5301dc956/eso312362-toc-0001-m.png\" alt=\"Balancing ecology and practicality to rank waterbodies for preventative invasive species management\" />\n<p>“Early detection and rapid response” (EDRR) is the most successful framework for preventative invasive species management, but prioritizing localized EDRR actions with limited resources is challenging. Here, we worked with regional practitioners in Arkansas, USA and the broader Southeastern USA to co-produce a workflow for preventative aquatic invasive species management that estimates establishment risk under current and future climates with a species distribution model, scores waterbodies according to difficulty of eradicating an aquatic invasive species if it were introduced, and combines establishment risk and eradication difficulty scores to rank waterbodies according to preventative management priority. We envision our approach fitting into this potential EDRR workflow (1) horizon scanning and/or climate matching generates lists of high-risk invasive species; (2) species lists are narrowed according to eradication feasibility scores; (3) for all remaining species, all waterbodies across a geography of interest receive prioritization rankings based on establishment risk and eradication difficulty scores.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\n‘Early detection and rapid response’ (EDRR) is the most successful framework for preventative invasive species management, but prioritizing localized EDRR actions with limited resources is challenging. An approach that ranks individual locations, such as waterbodies, for EDRR by combining an invasive species' establishment risk with the practicality of managing it could help set reasonable priorities.\n\nHere, we worked with regional practitioners in Arkansas, USA, and the broader Southeastern USA to co-produce a workflow for preventative aquatic invasive species management that (1) estimates establishment risk under current and future climates with a species distribution model, (2) scores waterbodies according to difficulty of eradicating an aquatic invasive species if it were introduced and (3) combines establishment risk and eradication difficulty scores to rank waterbodies according to preventative management priority. As our focal species, we used giant salvinia (<i>Salvinia molesta</i>), a floating aquatic fern ranked among the worst weeds in the world due to its negative socio-ecological impacts and difficulty to eradicate once established.\n\nCurrent establishment risk is low for much of our study area, but under future climate scenarios (RCP 8.5), areas with &gt;60% giant salvinia establishment risk increased from 546 km<sup>2</sup> to 30,219 km<sup>2</sup> between 2023 and 2040 in Arkansas.\n\nWe found giant salvinia establishment risk and eradication difficulty are independent of each other (<i>r</i> = 0.28), and it follows that, alone, early detection tools such as species distribution models are insufficient for managers to prioritize sites for EDRR.\n\n<i>Practical implication</i>: We envision our approach fitting into a potential EDRR workflow that cascades from broad- to local-scale. To illustrate, (1) horizon scanning and/or climate matching generates lists of high-risk invasive species; (2) species lists are narrowed according to eradication feasibility scores; (3) for all remaining species, all waterbodies across a geography of interest receive prioritization rankings based on establishment risk and eradication difficulty scores. Given that climate change makes predicting invasive species' distributions a moving target, combining co-produced eradication difficulty scoring with species distribution modelling will balance rigour with practicality when prioritizing locations for EDRR.\n</p>","author":"Caleb P. Roberts, \nWilliam E. Grant, \nMatthew L. Horton, \nLindsey A. P. LaBrie, \nMiranda R. Peterson, \nJane S. Rogosch, \nHsiao‐Hsuan Wang","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"582b3fd5067f2f4569189dbf7d994d56cb94c6439b04c463063710f0d9787d2c","category":"Environment"}