{"title":"The Every: When Big Tech rules all, don’t say Dave Eggers didn’t warn us","link":"https://arstechnica.com/?p=1799306","date":1634383820000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/PXL_20210930_185253777-800x600.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/PXL_20210930_185253777.jpg\">Enlarge</a> <span>/</span> The TL;DR: A book so enjoyable, it even stands out when surrounded by tacos and Texas libations. (credit: Nathan Mattise (via his Pixel 3a))</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p><em><a href=\"https://store.mcsweeneys.net/products/the-every\" target=\"_blank\">The Every</a>,</em> a new near-future tech dystopia novel from author <a href=\"https://en.wikipedia.org/wiki/Dave_Eggers\" target=\"_blank\">Dave Eggers</a>, marks the first time the famed writer has penned a sequel in his two-decades-plus career. In the seven years after Eggers published his tech-obsessed bestseller <em>The Circle, </em>the author found himself still taking notes on things that could take place in that world. He soon understood why some of the writers he admires most (Margaret Atwood, Colson Whitehead, Philip Roth, etc.) revisit worlds, characters, and ideas they've already built. The evolution, he told Ars Technica, can be fascinating.</p>\n<p>\"When you establish the foundation and build a world, after the book comes out, you still have ideas about what happens next—I see the attraction,\" Eggers said in an interview with Ars. \"[When I'm going to write a book] there’s usually a catalytic moment: 'OK, all these notes I’ve compiled might be something.' For me, it was thinking about the way we cede control over our lives to algorithms and rely more and more on numbers to determine our own worth and the worth of other things, whether it’s art, humans, restaurants, or basically anything we interact with on a daily basis. Where is this going if we’re uncomfortable with ambiguity or something that can’t be reportedly measured? Why are we so happy to cede decision-making and value assessment to algorithms? What’s it say about us?\"</p>\n<p>Published in 2013, Eggers' <a href=\"https://en.wikipedia.org/wiki/The_Circle_(Eggers_novel)\" target=\"_blank\"><em>The Circle</em></a> centered on surveillance and eventually inspired a Tom Hanks/John Boyega/Emma Watson film. In it, a company called The Circle develops an always-on streaming camera small enough to be unnoticeable, and the device becomes wildly popular. The central character, a low-level employee named Mae, eventually helps the device reach those heights by adopting a totally transparent lifestyle. She allows virtually all of her day-to-day interactions to be live-streamed on this <a href=\"https://arstechnica.com/gaming/2018/03/peoples-republic-of-desire-film-review-yes-black-mirror-is-already-here/\" target=\"_blank\">Twitch-like ecosystem</a>, complete with running comment threads and DMs. As you might expect, it's not always smooth sailing, and the ramifications can be dark.</p></div><p><a href=\"https://arstechnica.com/?p=1799306#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799306&amp;comments=1\">Comments</a></p>","author":"Nathan Mattise","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"58361af5797944b4009b74c13e3d9c5ec6d3cdf9feb7bbda2a1012814c01c20f","category":"Tech"}