{"title":"A shifting terrain: Understanding the perspectives of walk-in physicians on their roles amid worsening primary care access in Ontario, Canada","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303107","date":1715781600000,"content":"<p>by Braeden A. Terpou, Lauren Lapointe-Shaw, Ruoxi Wang, Danielle Martin, Mina Tadrous, Sacha Bhatia, Jennifer Shuldiner, Simon Berthelot, Niels Thakkar, Kerry McBrien, Christine Salahub, Tara Kiran, Noah Ivers, Laura Desveaux</p>\r\nBackground <p>High-quality primary care is associated with better health outcomes and more efficient and equitable health system performance. However, the rate of primary care attachment is falling, and timely access to primary care is worsening, driving many patients to use walk-in clinics for their comprehensive primary care needs. This study sought to explore the experiences and perceived roles and responsibilities of walk-in physicians in this current climate. Methods: Qualitative interviews were conducted with nineteen physicians currently providing walk-in care in Ontario, Canada between May and December 2022.</p> Results <p>Limited capacity for continuity and comprehensiveness of care were identified as major sources of professional tension for walk-in physicians. Divergent perspectives on their roles were anchored in how physicians viewed their professional identity. Some saw providing continuous and comprehensive care as an infringement on their professional role; others saw their professional role as more flexible and responsive to population needs. Regardless of their professional identity, participants reported feeling ill-equipped to manage the swell of unattached patients, citing a lack of time, resources, connectivity to the system, and remuneration flexibility. Conclusions: As practice demands of walk-in clinics change, an evolution in the professional roles and responsibilities of walk-in physicians follows. However, the resources, structure, and incentives of walk-in care have not evolved to reflect this, leaving physicians to set their own professional boundaries with patients. This results in increasing variations in care and confusion across the primary care sector around who is responsible for what, when, and how.</p>","author":"Braeden A. Terpou","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5837f45decfb1b25c0cd26c5636b7c64cfabf4ccb9a3b1e7884a3bf6d1d546f4","category":"Interdisciplinary"}