{"title":"Immersion challenge of three salmonid species (family Salmonidae) with three multilocus sequence typing variants of Flavobacterium psychrophilum provides evidence of differential host specificity","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13889?af=R","date":1700202284000,"content":"<h2>Abstract</h2>\n<p>Bacterial coldwater disease (BCWD), caused by <i>Flavobacterium psychrophilum</i>, results in significant losses among multiple salmonid (family Salmonidae) species. Molecular epidemiology and serotyping studies have suggested that some variants are host specific; however, these associations have not been evaluated by cross-challenging fish species with putatively host-associated <i>F. psychrophilum</i> isolates via more natural (i.e. immersion) exposure routes. To this end, <i>F. psychrophilum</i> isolates US19-COS, US62-ATS and US87-RBT, each originally recovered from diseased coho salmon (<i>Oncorhynchus kisutch</i>), Atlantic salmon (<i>Salmo salar</i>) or rainbow trout (<i>O. mykiss</i>), and belonging to a host-associated multilocus sequence typing clonal complex (e.g. CC-ST9, CC-ST232 or CC-ST10), were PCR-serotyped, evaluated for proteolytic activity, and used to challenge adipose fin-clipped 4-month old Atlantic salmon, coho salmon and rainbow trout via immersion. Findings showed US87-RBT caused disease and mortality only in rainbow trout (e.g. 56.7% survival probability). US19-COS and US62-ATS caused more mortality in coho salmon and Atlantic salmon but also caused disease in both other host species, albeit to a lesser extent. Observed survival differences may be due to variant antigenic/virulence determinants as differences in serotype and proteolytic activity were discovered. Collectively, results highlight the intricacies of <i>F</i>. <i>psychrophilum</i>-host interactions and provide further in vivo evidence that some <i>F. psychrophilum</i> MLST variants are host specific, which may have implications for the development of BCWD prevention and control strategies.</p>","author":"Christopher Knupp, \nThomas P. Loch","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"5842036dc1ec68350b75d29bb1286a979e5fdd5eeb1a4d2c886d5159a0cffc83","category":"Environment"}