{"title":"HD–Zip I protein LlHOX6 antagonizes homeobox protein LlHB16 to attenuate basal thermotolerance in lily","link":"https://academic.oup.com/plphys/article/194/3/1870/7334582?rss=1","date":1698710400000,"content":"<span><div>Abstract</div>Homeodomain–leucine zipper (HD–Zip) I transcription factors are crucial for plant responses to drought, salt, and cold stresses. However, how they are associated with thermotolerance remains mostly unknown. We previously demonstrated that lily (<span>Lilium longiflorum</span>) LlHB16 (HOMEOBOX PROTEIN 16) promotes thermotolerance, whereas the roles of other HD–Zip I members are still unclear. Here, we conducted a transcriptomic analysis and identified a heat-responsive <span>HD–Zip I</span> gene, <span>LlHOX6</span> (<span>HOMEOBOX 6</span>). We showed that LlHOX6 represses the establishment of basal thermotolerance in lily. <span>LlHOX6</span> expression was rapidly activated by high temperature, and its protein localized to the nucleus. Heterologous expression of <span>LlHOX6</span> in Arabidopsis (<span>Arabidopsis thaliana</span>) and overexpression in lily reduced their basal thermotolerance. In contrast, silencing <span>LlHOX6</span> in lily elevated basal thermotolerance. Cooverexpressing or cosilencing <span>LlHOX6</span> and <span>LlHB16</span> in vivo compromised their functions in modulating basal thermotolerance. LlHOX6 interacted with itself and with LlHB16, although heterologous interactions were stronger than homologous ones. Notably, LlHOX6 directly bounds DNA elements to repress the expression of the LlHB16 target genes <span>LlHSFA2</span> (<span>HEAT STRESS TRANSCRIPTION FACTOR A2</span>) and <span>LlMBF1c</span> (<span>MULTIPROTEIN BRIDGING FACTOR 1C</span>). Moreover, LlHB16 activated itself to form a positive feedback loop, while LlHOX6 repressed <span>LlHB16</span> expression. The LlHOX6–LlHB16 heterooligomers exhibited stronger DNA binding to compete for LlHB16 homooligomers, thus weakening the transactivation ability of LlHB16 for <span>LlHSFA2</span> and <span>LlMBF1c</span> and reducing its autoactivation. Altogether, our findings demonstrate that LlHOX6 interacts with LlHB16 to limit its transactivation, thereby impairing heat stress responses in lily.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"585b4984da5d7b2b5a715575ae68896ec750645af537a27a8746d2129ed984a2","category":"Environment"}