{"title":"Apple Says Over 110 Manufacturing Partners Committed to Using 100% Renewable Energy","link":"https://www.macrumors.com/2021/03/31/apple-manufacturers-commit-to-renewable-energy/","date":1617198529000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2020/07/apple-commits-to-be-100-percent-carbon-neutral-for-its-supply-chain-and-products-by-2030/\">announced</a> over 110 of its manufacturing partners around the world have committed to using 100 percent renewable energy for their Apple-related production. Once achieved, Apple says these commitments will prevent over 15 million metric tons of CO2e annually, the equivalent of taking more than 3.4 million cars off the road each year.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/iphone-assembly-trays.jpg\" alt=\"\" width=\"1480\" height=\"880\" class=\"aligncenter size-full wp-image-791722\" />\r\n<br/>\r\nApple already announced some manufacturing partners committed to using 100% renewable energy <a href=\"https://www.macrumors.com/2019/04/11/apple-suppliers-commit-to-100-pct-renewable-energy/\">in the past</a>, such as iPhone assemblers Foxconn, Pegatron, and Wistron, chipmaker TSMC, and iPhone display glass maker Corning.\r\n<br/>\r\n\r\n<br/>\r\nApple is also investing directly in renewable energy projects, including a new California Flats solar farm that helps power its corporate headquarters. The farm is capable of storing up to 240 megawatt-hours of excess energy generated from intermittent sources, including wind and solar, and deploying it when it is most needed.\r\n<br/>\r\n\r\n<br/>\r\nLast year, Apple <a href=\"https://www.macrumors.com/2020/07/21/apple-commits-carbon-neutral-supply-chain-2030/\">unveiled a plan</a> to ​become carbon neutral across its entire business, manufacturing supply chain, and product life cycle by 2030, and the company says it has made steady progress towards this target.\r\n<br/>\r\n\r\n<br/>\r\n\"We are firmly committed to helping our suppliers become carbon neutral by 2030 and are thrilled that companies who've joined us span industries and countries around the world, including Germany, China, the US, India, and France,\" said Lisa Jackson, Apple's vice president for Environment, Policy, and Social Initiatives. \"In a year like no other, Apple continued to work with a global network of colleagues, companies, and advocates to help make our environmental efforts and everything we do a force for good in people's lives — and to work alongside the communities most impacted by climate change.\"\r\n<br/>\r\n\r\n<br/>\r\nOverall, Apple says it has seen consistent reductions in its carbon footprint, even as net revenue increased. The company says its footprint has decreased by 40 percent, and it has avoided more than 15 million metric tons of emissions through initiatives to use low-carbon materials, drive energy efficiency, and switch to clean energy. <div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/apple-environment/\">Apple environment</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/31/apple-manufacturers-commit-to-renewable-energy/\">Apple Says Over 110 Manufacturing Partners Committed to Using 100% Renewable Energy</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-says-over-110-manufacturing-partners-committed-to-using-100-renewable-energy.2290202/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PTcLfNJuwl4:r052BkIoLf0:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PTcLfNJuwl4:r052BkIoLf0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/PTcLfNJuwl4\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"585f000d354cfc71aef2d0dba189156329c05a9df9b60ffce5035b8a5493ffb8","category":"Apple"}