{"title":"Retention forestry can maintain epiphytic lichens on living pine trees, but provides impoverished habitat for deadwood‐associated lichens","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14772?af=R","date":1724935122000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/8e755e02-da9a-4e86-af5b-c2b39f387e04/jpe14772-toc-0001-m.png\" alt=\"Retention forestry can maintain epiphytic lichens on living pine trees, but provides impoverished habitat for deadwood-associated lichens\" />\n<p>Retention forestry can support lichen assemblages associated with living Pinus sylvestris. However, maintaining deadwood-associated lichen diversity through retention practices entails significant challenges. Deadwood-associated lichen diversity relies on high-longevity snags and is not sustained by the habitats provided in retention forestry. Biodiversity maintenance in forest management requires comprehensive provision of the habitat features of unmanaged forests, such as a qualitatively representative deadwood profile, which can prove difficult.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nManaging forests for timber yields reduces the amounts of old trees and deadwood, which has profound effects on species that are dependent on them. Retention forestry, where some trees are permanently left unharvested on clear-cut sites, may enable the formation of deadwood and old trees in managed forests, but it is unresolved how well these practices facilitate the occurrence of species in managed forests, especially in the long term.\n\nWe studied the capacity of tree retention practices to support the diversity of epiphytic lichens, a key group among threatened forest species. We compared lichen assemblages on retained trees in harvested sites to those on trees in unharvested control sites. The data were collected 21-year post-harvest and included living trees, snags (standing dead trees) and logs (fallen trees) of <i>Pinus sylvestris</i> (Scots pine).\n\nLiving trees, snags and logs each hosted distinct lichen communities. The highest lichen diversity was found on snags.\n\nOn living trees, species richness was similar in harvested and unharvested sites, but there was slight species turnover. In contrast, deadwood in unharvested sites hosted higher species richness and distinct species assemblages compared to deadwood in harvested sites. These differences were most pronounced on snags. Specifically, unharvested sites contained high-longevity snags (kelo trees), which hosted unique lichen communities with higher lichen richness than any other studied substrate, including the highest numbers of red-listed and deadwood-dependent species.\n\n<i>Synthesis and applications</i>. Retention forestry can support lichen assemblages associated with living <i>Pinus sylvestris</i>. However, maintaining deadwood-associated lichen diversity through retention practices entails significant challenges. Deadwood-associated lichen diversity relies on high-longevity snags and is not sustained by the habitats provided in retention forestry. Biodiversity maintenance in forest management requires comprehensive provision of the habitat features of unmanaged forests, such as a qualitatively representative deadwood profile, which can prove difficult.\n</p>","author":"Aleksi Nirhamo, \nAino Hämäläinen, \nKaroliina Hämäläinen, \nJari Kouki","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"587ccc388cdf002ddb9a4ef884e83564da6a14b810bb820f69a1422514708817","category":"Environment"}