{"title":"Kuo: Mass Production on Apple's AR/VR Headset May Be Delayed Until End of 2022","link":"https://www.macrumors.com/2021/10/19/apple-ar-vr-headset-mass-production-delay/","date":1634616349000,"content":"Apple may not begin production on its upcoming AR/VR headset until the end of the fourth quarter of 2022, Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> said today in a note sent out to investors. That would likely result in the device launching late in 2022 or in early 2023.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-mixed-reality-headset-mockup-feature-orange.jpg\" />\r\n<br />\r\n\r\n<br />\r\nBefore launching the headset, Apple wants to have \"complete software, ecosystem, and services,\" which Kuo cites as the reason why Apple could be planning to delay mass production from the second quarter of 2022 to the end of 2022.  \r\n<br />\r\n\r\n<br />\r\nAccording to Kuo, Apple has the \"best industrial design solutions\" for an AR/VR headset because of the headset's complexity and the need for a comfortable fit. Kuo also believes that Apple has more of a design challenge in front of it because the company wants to go beyond games with AR/VR software. <blockquote>The AR/MR HMD requires much more industrial design requirements than smartphones because the comfort of wearing them involves so many design details. Therefore, we believe Apple continues to test the best industrial design solutions so far.\r\n<br />\r\n\r\n<br />\r\nThe key to the success of the HMD lies in the software, ecosystem, and service. We believe that Apple is positioning its HMD for various applications, not just gaming applications, so the challenge of building software/ecosystem/services is significantly higher than current products/competitors.</blockquote>In general, Kuo expects head mounted displays to lead to the \"next wave of user interface revolution\" much like multi-touch on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>. Apple will be able to change the market consensus that these kind of AR/VR devices are mainly for gaming, as the company \"is the most capable of developing and promoting diverse applications.\"\r\n<br />\r\n\r\n<br />\r\nKuo previously said the AR/VR headset <a href=\"https://www.macrumors.com/2021/06/08/kuo-apple-ar-headset-2q-2022/\">would launch</a> in the second quarter of 2022, and before that, he believed the headset would come out <a href=\"https://www.macrumors.com/2021/01/04/kuo-airtags-ar-device-2021/\">sometime in 2021</a>.\r\n<br />\r\n\r\n<br />\r\nRumors suggest Apple's AR/VR headset will be similar in design to the Oculus Quest, but with a sleeker look that uses fabrics and lightweight materials for a comfortable fit.\r\n<br />\r\n\r\n<br />\r\nThe headset is rumored to feature two high-resolution 8K displays that may be micro-OLED and a whole slew of cameras for eye detection, head detection, and other augmented reality functions. The headset will be <a href=\"https://www.macrumors.com/2021/09/02/ar-vr-headset-iphone-connection-required/\">reliant on the iPhone</a>, and Apple is rumored to be experimenting with multiple input methods.\r\n<br />\r\n\r\n<br />\r\nApple is also working on a set of smart glasses, but the smart glasses are expected to launch after the headset, which will be Apple's first head mounted AR/VR device. More details are <a href=\"https://www.macrumors.com/roundup/apple-glasses/\">available in our AR/VR roundup</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-glasses/\">Apple Glasses</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/19/apple-ar-vr-headset-mass-production-delay/\">Kuo: Mass Production on Apple's AR/VR Headset May Be Delayed Until End of 2022</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/kuo-mass-production-on-apples-ar-vr-headset-may-be-delayed-until-end-of-2022.2317827/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=UCfFLkZNOWY:UKkhWicSE-8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=UCfFLkZNOWY:UKkhWicSE-8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/UCfFLkZNOWY\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"587d0576aa06e989a84c233e891f58a318f21ff1aa99e367c85e8dc86d016934","category":"Apple"}