{"title":"Dietary Regulation of Lipid Metabolism in Gestational Diabetes Mellitus: Implications for Fetal Macrosomia","link":"https://www.preprints.org/manuscript/202409.1572/v1","date":1726800376000,"content":"The primary therapeutic method for correcting hyperglycemia today is diet therapy. Lipids are not only a source of nutrients but can also act as initiators of adipocyte differentiation in the fetus, which explains the development of fetal macrosomia and future metabolic disorders in children born to mothers with gestational diabetes mellitus (GDM). Changes in the profile of circulating lipids in the maternal bloodstream, depending on adherence to a rational diet among mothers with GDM and the development of fetal macrosomia, is a complex and not fully understood process. The aim of the study was to examine the characteristics of the lipid profile in the blood plasma of pregnant women with GDM in all trimesters of pregnancy based on adherence to diet therapy. The design of the clinical part of the work was carried out within the framework of a 'case-control' study.The study included 110 women, 80 of whom were in the control group, 20 in the group with GDM adhering to the diet, and 10 in the group with GDM not adhering to the diet. The laboratory part was conducted as part of a longitudinal dynamic study with venous blood samples taken at three points: 11-13, 24-26, and 30-32 weeks of pregnancy.A significant impact of diet therapy on the blood lipid composition throughout pregnancy was demonstrated, starting as early as the first trimester. ROC analysis showed high effectiveness of the developed models with an AUC of 0.98 for the \"30-32 weeks\" model, with sensitivity and specificity of 1 and 0.9, respectively. An association was found between diet, maternal blood lipid composition at 32 weeks of pregnancy, and newborn weight. The direction of changes in the lipid spectrum during the development of macrosomia and diet therapy is diametrically opposed. This confirms at the molecular level that diet therapy can normalize not only carbohydrate but also lipid metabolism in the mother and fetus. Based on the obtained data, it can be suggested that after validation, the developed models could be used to refine the prognosis of macrosomia development based on the lipid profile of blood plasma at different stages of pregnancy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"587ddf138b817390c03dc79d0da16d33a6f696a56c3d625cff99fff45ace03e9","category":"Interdisciplinary"}