{"title":"Biopsychosocial impediments in MS: Gender Differences and Impact of Quality of Life on Neuropsychological Function: Multicenter study","link":"https://www.preprints.org/manuscript/202409.0391/v1","date":1725521287000,"content":"Background/Objectives: Multiple sclerosis (MS) is a chronic neurological disorder characterized by various clinical presentations and manifestations that include biopsychosocial impediments. This study has three interrelated goals relevant to biopsychosocial functioning.  The first is to compare cognitive, neuropsychological, and affective functioning and quality of life between patients with MS (PwMS) and a control group. The second is to examine whether cognitive and neuropsychological performance is affected by gender, and the third is to examine whether variation in QoL hinges on cognitive neuropsychological performance.\n\nMethods: This multicenter study was carried out among clinically stable PwMS under follow-up in two tertiary care units in urban Oman. Healthy controls, matched for age and sex, were also recruited as a comparison group. Data were collected using cognitive batteries sensitive to current reasoning ability and conventional neuropsychological batteries designed to measure verbal learning, visual-spatial ability, and processing speed.  The affective range (anxiety and depressive symptoms) and quality of life (QoL) were also assessed.\n\nResults: The PwMS group scored lower on current reasoning ability, verbal learning, visual-spatial ability, and processing speed compared with the control group. The incidence of anxiety was higher in the PwMS group but there was no statistically significant difference in depressive symptoms. No significant differences were found in cognitive variables between the two sexes, except in visual-spatial ability, where women outperformed men. PwMS with low QoL scored lower on the attention and concentration indices than those with adequate QoL. According to QoL, no significant differences were observed in reasoning, verbal learning, and visual-spatial ability.\n\nConclusions: The present sentinel study suggests that the Omani cohort with MS tends to have lower indices of current reasoning ability, visual and spatial memory and cognitive speed compared to control subjects. Gender differences are minimal, except for visual-spatial abilities where women outperform men. Quality of life significantly affects cognitive functioning.  In general, the biopsychosocial impediment appears to be significant, indicating the need for comprehensive evaluation and care in the management of MS.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"587ed5299971fe1f2f38869f29b2cebdd80bf9800df4e5aae3d691f985f0cf10","category":"Interdisciplinary"}