{"title":"Virulence genes, antimicrobial resistance profile, phylotyping and pathotyping of diarrheagenic <i>Escherichia coli</i> isolated from children in Southwest Mexico","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300304","date":1710252000000,"content":"<p>by Gabriela Tapia-Pastrana, Metztli Rojas-Bautista, Pilar Hernández-Pérez, Olegario Santiago-Martínez, Lucía C. Gómez-Rodríguez, Víctor M. Terrazas-Luna, Jacobo Montes-Yedra, Alfonso A. Bautista-Avendaño, Eduardo S. García-López, Nidia Leon-Sicairos, Uriel A. Angulo-Zamudio, Adrian Canizalez-Roman</p>\r\n\r\nDiarrheagenic <i>E</i>. <i>coli</i> (DEC) strains are one of the most important etiology factors causing diarrhea in children worldwide, especially in developing countries. DEC strains have characteristic virulence factors; however, other supplemental virulence genes (SVG) may contribute to the development of diarrhea in children. Therefore, this study aimed to determine the prevalence of DEC in children with diarrhea in southwestern Mexico and to associate childhood symptoms, SVG, and pathotypes with diarrhea-causing DEC strains. DEC strains were isolated from 230 children with diarrhea aged 0–60 months from the state of Oaxaca, southwestern Mexico; clinical data were collected, and PCR was used to identify SVG and pathotypes. Antibiotic resistance profiling was performed on DEC strains. 63% of samples were DEC positive, single or combined infections (two (21%) or three strains (1.3%)) of aEPEC (51%), EAEC (10.2%), tEPEC (5.4%), DAEC (4.8%), ETEC (4.1%), EIEC (1.4%), or EHEC (0.7%) were found. Children aged ≤ 12 and 49–60 months and symptoms (e.g., fever and blood) were associated with DEC strains. SVG related to colonization (<i>nleB</i>-EHEC), cytotoxicity (<i>sat</i>-DAEC and <i>espC</i>-tEPEC), and proteolysis (<i>pic</i>-aEPEC) were associated with DECs strains. <i>E</i>. <i>coli</i> phylogroup A was the most frequent, and some pathotypes (aEPEC—A, DAEC–B), and SVG (<i>espC</i>–B2, and <i>sat</i>–D) were associated with the phylogroups. Over 79% of the DEC strains were resistant to antibiotics, and 40% were MDR and XDR, respectively. In conclusion aEPEC was the most prevalent pathotype in children with diarrhea in this region. SVG related to colonization, cytotoxicity, and proteolysis were associated with diarrhea-producing DEC strains, which may play an essential role in the development of diarrhea in children in southwestern Mexico.","author":"Gabriela Tapia-Pastrana","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"58809840cee9ad4c6bf73ed63fd17fbe75082c796cd2d49d1690a00b8e08abf2","category":"Interdisciplinary"}