{"title":"A higher tissue fraction of parenchyma in secondary xylem supports growth recovery of angiosperm trees after drought","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14680?af=R","date":1729492548000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/293476a4-8b15-4c64-9c10-b3bef6b74826/fec14680-toc-0001-m.png\" alt=\"A higher tissue fraction of parenchyma in secondary xylem supports growth recovery of angiosperm trees after drought\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/09/trees-with-more-parenchyma-could-bounce-back-better-from-drought/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nResilience to drought represents an important focus for trees during climate change, with the aim of predicting the resistance and recovery of species worldwide. Previous studies mainly linked tree growth resilience to plant functional traits that are related to resource acquisition and investment. Here, we investigate a potential link between resilience and the amount of parenchyma tissue in wood, a multifunctional tissue that may provide various physiological benefits to drought-related mechanisms.\n\nWe compiled a global tree-ring data set to evaluate the relationship between growth resistance, resilience or recovery from drought and xylem parenchyma tissue fractions of 50 angiosperms, which was complemented with a local study of nine species from Mt. Tiantong in China. We also assessed the influence of climate and phylogeny on these relationships.\n\nWe found that growth recovery after drought was positively related to the fractions of total parenchyma locally and globally. This association remained statistically significant when accounting for the effects of climate and phylogeny. No other associations between parenchyma fractions and growth resilience metrics were statistically significant.\n\nOur results suggest that drought recovery of angiosperm trees is affected by the amount of parenchyma. Incorporating xylem parenchyma fraction with other traits, such as hydraulic traits, could therefore enhance our comprehension of how various angiosperm tree species will respond to future droughts. Further studies should focus on unravelling the physiological roles of xylem parenchyma fraction.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/09/trees-with-more-parenchyma-could-bounce-back-better-from-drought/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>摘要</h2>\n<p>\n\n在气候变化背景下，树木在干旱胁迫下的弹性成为了研究焦点，这对于预测全球树木对干旱的抵抗力和恢复力至关重要。以往的研究多聚焦于树木生长弹性与植物功能性状之间的联系，这些性状通常与资源获取和分配有关。本研究则鉴于木质部薄壁组织在干旱适应机制中可能发挥的多重生理作用，探讨了木质部薄壁组织含量与干旱胁迫下生长弹性之间的潜在联系。\n\n本研究通过构建一个包含50种被子植物的全球树木年轮数据库以及在中国天童山采集的9种树种数据，从全球和局域两个尺度评估了干旱胁迫下树木生长抵抗力、恢复力以及弹性与木质部薄壁组织含量之间的关系。此外，我们还分析了气候和系统发育因素对这些关系的影响。\n\n本研究发现，无论是全球还是局域尺度，旱后生长恢复力与木质部总薄壁组织含量呈正相关；即使在控制气候和系统发育因素后，这种相关性依然显著。然而，薄壁组织含量与抵抗力或弹性没有显著关联。\n\n我们的结果证实了被子植物树木的旱后恢复能力受到木质部薄壁组织含量的影响。因此，将木质部薄壁组织含量与其他性状(如水力性状)相结合，有助于深化我们对被子植物树木如何响应未来干旱胁迫的理解。未来的研究应进一步探索木质部薄壁组织含量的生理作用机制。\n</p>","author":"Xijin Zhang, \nQingyao Li, \nYongchuan Yang, \nKenji Fukuda, \nHugh Morris, \nSteven Jansen, \nLiangjun Da, \nKun Song","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"588163b5da2012997025ddd0aee38423076c05b636d718823fd9b4c972faff23","category":"Environment"}