{"title":"Gent-Wevelgem Women 2021 Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/gent-wevelgem-women-2021-preview","date":1616693554000,"content":"\n      <p>Due to its flatter parcours, Gent-Wevelgem (taking place on March 28th) is commonly the classic where we will see a showdown between those with the fastest legs in the World Tour. Luckily, sprinting talent in the women’s peloton is at an all time high this season. </p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>That said, with a series of characteristically Belgian bergs to contend with, there is a possibility for the race to finish in a much smaller group – this will depend on whether stronger teams decide they want to split the race. Strong winds or challenging weather conditions could also impact the number of riders who will go on to contest the win. </p>\n<p>The last four editions have finished in a bunch sprint and many riders will fancy their chances in a gallop to the line on the flat run-in to Wevelgem. In 2016, however, Chantal van den Broek-Blaak took a solo win, crossing the line over a minute ahead of Lisa Brennauer in second place.</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/sd-worx-super-squad\">Related – Opinion: SD Worx are cycling's new super squad <br></a><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/gent-wevelgem-2021-preview\">Related – Gent-Wevelgem Men 2021 Preview</a></em></strong></p>\n<p>To avoid a repeat of Broek-Blaak’s win, sprinter’s teams will need to keep a watchful eye on strong breakaway specialists. Looking at their performances so far this season, we know that, should a gap open up between an SD Worx rider and the peloton, reeling them back in can be a challenge for the chasing bunch.</p>\n<p>Whether we see a solo breakaway or a bunch kick, since its first edition in 2012, Gent-Wevelgem has always proved to be an unpredictable and exciting race in the women’s calendar.</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">Related – The Women's 2021 Early Season: The Rouleur Racing Guide</a></em></strong></p>\n<h4>The Route</h4>\n<p>To encourage fans to watch the race from home, the official route of Gent-Wevelgem will not be published until the evening before the race. </p>\n<p>However, looking at previous editions we can expect a relatively flat start to the race, where it is likely the peloton will let an early breakaway establish a lead. </p>\n<p>The climbs will begin after around 60km of racing, these include the Beneberg, the Monteberg and the Kemmelberg. We can expect to see the bunch whittled down during this section of the race, especially since around 20km later the peloton will hit the ‘Plugstreets’.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Gent_route-women_600x600.jpg?v=1616616746\" alt=\"\"></p>\n<p><em>Last year's women's route</em></p>\n<p>The ‘Plugstreets’ are a series of three semi-paved sectors. Although not at the level of difficulty of the gravel roads we’ve seen in Strade Bianche recently, they could cause crashes, splits or untimely punctures for an unlucky few.</p>\n<p>The final climb of the race will be the second ascent of the Kemmelberg.This is likely to be where we will see any attacks from those who want to bring a smaller group to the finish. With an average gradient of 14%, this berg will certainly test the legs after over 100km of racing.</p>\n<p>Any group that does escape on the Kemmelberg will have to survive the long, flat run-in to Wevelgem that follows, however.</p>\n<h4>The contenders</h4>\n<p>Forced to miss last year’s edition following a positive covid-19 test result, Certazit WNT’s strong sprinter Kirsten Wild is a twice winner of this race. She will be back in 2021 to try and add another win to her palmares and will have a good chance of doing so – especially with a strong lead-out from her teammates such as Lisa Brennauer, who showed excellent form in the Healthy Ageing Tour a few weeks ago.</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/healthy-ageing-tour-2021-debrief\">Related: Healthy Ageing Tour 2021 Debrief </a></em></strong></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Chantal-Blaak_1024x1024.jpg?v=1616616890\" alt=\"\"></p>\n<p><em>After winning Strade Bianche, sprint teams will have to work hard to prevent Broek-Blaak from taking another win</em></p>\n<p>Defending champion Jolien d’Hoore will be well supported by the SD Worx team, who have options for both a bunch sprint and a breakaway. Amy Pieters and Christine Majerus will both play important team roles – be it in covering any attacks or making moves themselves.</p>\n<p>Belgian champion Lotte Kopecky will hope to surf the lead-outs of bigger teams and go one better than her second place to d’Hoore in last year’s edition of the race. She is a rider who is likely to make it over the steep slopes of the Kemmelberg and be able to fiercely contest the final sprint.</p>\n<p>Ale BTC Ljubljana’s Marta Bastianelli has had a quieter start to the season, but she is well suited to the parcours of Gent-Wevelgem, winning in 2018. Team DSM sprinter Lorena Wiebes also has had a slow season opening, but looked to be showing great form before her unfortunate crash in the Healthy Ageing Tour a few weeks ago. She will be hoping to secure her first big result of 2021.</p>\n<p>If Emma Norsgaard can continue the form she has shown recently, she will be hard to beat. She is yet to finish outside of the top 11 in any races so far this season and after multiple podium finishes, she will be gunning for the top step on Sunday.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Emma-Norsgaard_1024x1024.jpg?v=1616693533\" alt=\"\"></p>\n<p>Trek Segafredo may hope to drop some of these sprinters on the earlier climbs, however. Neither Lizzie Deignan or Elisa Longo Borghini are well suited to a mass finish, but both can finish strongly from a reduced group. Trek Segafredo’s sprinter Amalie Dideriksen will be their option should a bigger bunch come to the line.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/less-is-more-the-men-can-keep-their-clashing-calendar\">Related: Less is more: the men can keep their clashing calendar</a></strong></em></p>\n<h4>Outside bets</h4>\n<p>Canyon Sram’s Alice Barnes showed her ability to sprint among the best in stage one of the Healthy Ageing Tour, narrowly finishing second to d’Hoore. She is yet to secure a big result in the WWT but looks to be in the form to contend the finish of Gent-Wevelgem, if everything goes right for her on the day.</p>\n<p>Valcar-Travel and Service bring a team of Italian track stars and are well practiced in excellent lead-outs for the likes of Elisa Balsamo, winner of GP Oetingen.</p>\n<p>We will also see Ciclismo Mundial on the startline, a new team formed of cyclo-cross specialists including Ceylin del Carmen Alvarado. Whilst their prowess on the road is relatively unknown, it’s safe to assume that talent of such high calibre will be easily transferable from the mud to the tarmac.</p>\n<p>Jumbo Visma’s Anna Henderson is a young rider who has had a series of impressive results in her Belgian campaign so far this year. Although she will most likely be in a supporting role for Marianne Vos, she will be keen to take her own chance, should the opportunity arise.</p>\n<meta charset=\"utf-8\">\n<p><strong>How to watch it</strong></p>\n<p>Milan San-Remo will be shown on Eurosport and on GCN+ in the UK and United States (amongst other<span> </span><a href=\"https://help.globalcyclingnetwork.com/hc/en-gb/sections/360005300779-Which-races-can-I-watch-\" target=\"_blank\" rel=\"noopener noreferrer\">territories</a>).</p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"588aa0d561dff391161eca395107e4748e6ce2f84cf8ccf2055dd8b5c5e5f42a","category":"Cycling"}