{"title":"MOOTS DEALER SPOTLIGHT–OBST & GEMUSE, BASEL SWITZERLAND","link":"https://moots.com/moots-dealer-spotlight-obst-gemuse-basel-switzerland/","date":1623711016000,"content":"<p>For our featured Moots Dealer this week, we are taking a trip to Basel, Switzerland and a shop called OBST &amp; GEMUSE. Which in translation means FRUITS &amp; VEGETABLES. <span></span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/ShowroomSpring21-3588.jpg\" /></p>\n<p>The name reflects what they offer (cargo bikes &amp; high-end performance bikes), as in two different ends of the spectrum. Founded in 2009 as a courier bag manufacturer and specialist in fixed-gear bikes, OBST &amp; GEMUSE has developed into an all-inclusive shop. They now specialize in highly evolved cargo bike solutions and use the tag<span>  </span>#lightweighthighfreight. The ground floor of the shop houses their cargo bike offerings in a clean, well-organized setting. On the second floor you will find an offering of high-end bikes for clientele, and that’s where Moots can be found. They offer precision fits, professional assembly, and maintenance work for all that they sell. They also carry quality lines of clothing. <span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/Copy-of-_MG_2762.jpg\" /></p>\n<p>The shop is in Basel which serves as a central hub for the wider area. Basel is right in the border triangle between Switzerland, France, and Germany. They have the Black Forest in Germany, the Vosges in France, and the Jura in Switzerland, which makes Basel the ideal destination for cyclists.<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/DSC1687.jpg\" /></p>\n<p>The staff at the shop prides themselves in focusing on quality in everything they do, the products they offer, the attention and service they offer their customers, the way they work in a team, and the approach to projects. You can notice that in the images.<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/DSC1656.jpg\" /></p>\n<p>They have been a Moots Dealer since 2015 and you can find samples of our current offerings on their showroom floor. <span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/ShowroomSpring21-3582.jpg\" /></p>\n<p>You can check out their website here <a href=\"https://obstundgemuese.ch/showroom\">OBST &amp; GEMUSE</a> and if you are every visiting, please stop in and see what’s new.<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/DSC1671.jpg\" /></p>\n<p> </p>\n<p>The post <a href=\"https://moots.com/moots-dealer-spotlight-obst-gemuse-basel-switzerland/\">MOOTS DEALER SPOTLIGHT–OBST &amp; GEMUSE, BASEL SWITZERLAND</a> appeared first on <a href=\"https://moots.com\">Moots</a>.</p>","author":"Jon Cariveau","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"5891fc247b5d7dd852ec6498034f7ef25532a228ca80cd3af02c330b00714b4c","category":"Cycling"}