{"title":"Insights for River Restoration: The Impacts of Vegetation Canopy Length and Canopy Discontinuity on Riverbed Evolution","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036473?af=R","date":1721133858000,"content":"<h2>Abstract</h2>\n<p>River restoration projects often involve vegetation planting to retain sediment and stabilize riverbanks. Laboratory experiments have explored the impact of rigid emergent vegetation canopies on bed morphology. Inside canopies, bed erosion is attributed to vegetation-induced turbulent kinetic energy (<i>TKE</i>). Based on the in-canopy local <i>TKE</i> and the criteria for sediment movement, a method is established and validated for predicting the length of the bed erosion region. In the bare channel, bed erosion is related to the ratio of canopy length to flow adjustment distance, <i>L</i>/<i>L</i>\n<sub>\n   <i>I</i>\n</sub>, and exhibits two trends. At <i>L</i>/<i>L</i>\n<sub>\n   <i>I</i>\n</sub> &lt; 1, the maximum depth, <i>d</i>\n<sub>\n   <i>s</i>(<i>bare</i>)</sub>, and length, <i>L</i>\n<sub>\n   <i>s</i>(<i>bare</i>)</sub>, of the bed erosion region increase with increasing canopy length. At <i>L</i>/<i>L</i>\n<sub>\n   <i>I</i>\n</sub> ≥ 1, <i>d</i>\n<sub>\n   <i>s</i>(<i>bare</i>)</sub> and <i>L</i>\n<sub>\n   <i>s</i>(<i>bare</i>)</sub> are not influenced by the canopy length and remain constant. In vegetated regions with the same length and plant density, discontinuous canopies (streamwise interval <i>s</i> ≥ canopy width <i>D</i>) yield weaker bed erosion than continuous canopies. The mutual influence between two canopies must be considered if the canopy interval satisfies <i>s</i> &lt; 3<i>D</i>. These results provide insights for designing vegetation canopies for river restoration projects.</p>","author":"Fujian Li, \nYuqi Shan, \nMing Li, \nYakun Guo, \nChao Liu","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"589df148e936b904d6f426b57e13a8a2d2891cef2f6e21ee7d5800e3102479b8","category":"Environment"}