{"title":"Predicting Future Trends of Terrestrial Dissolved Organic Carbon Transport to Global River Systems","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004137?af=R","date":1712712556000,"content":"<h2>Abstract</h2>\n<p>A fraction of CO<sub>2</sub> uptake by terrestrial ecosystems is exported as organic carbon (C) through the terrestrial-aquatic continuum. This translocated C plays a significant role in the terrestrial C balance; however, obtaining global assessments remains challenging due to the predominant reliance on empirical approaches. Leaching of dissolved organic C (DOC) from soils to rivers represents an important fraction of this C export and is assumed to drive a large proportion of the net-heterotrophy of river systems and the related CO<sub>2</sub> emissions. Using the model JULES-DOCM, we projected DOC leaching trends over the 21st century based on three scenarios with high (RCP 2.6), intermediate (RCP 4.5), and low (RCP 8.5) climate mitigation efforts. The RCP 8.5 scenario led to the largest DOC leaching increase of +42% to 395 Tg C yr<sup>−1</sup> by 2100. In comparison, RCP 2.6 and RCP 4.5 led to increases of 10% and 21%, respectively. Under RCP 8.5, the sub-tropical zone showed the highest relative increase of 50% above current levels. In the boreal and tropical zones, the simulations revealed similar increases of 48% and 41%, respectively. However, given the pre-eminence of the tropics in DOC leaching, the absolute increment is markedly substantial from this region (+59 Tg C yr<sup>−1</sup>). The temperate zone displayed the lowest relative increase with 35%. Our analysis identified the rising atmospheric CO<sub>2</sub> concentration and its fertilizing effect on terrestrial NPP as the main reason for the future increase in DOC leaching.</p>","author":"Mahdi (André) Nakhavali, \nRonny Lauerwald, \nPierre Regnier, \nPierre Friedlingstein","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"58c18fb97138cb94ee5556120a1e6cfcf8d1324435f59f82d5bdd111d4b71d29","category":"Environment"}