{"title":"DJI เปิดตัว Mavic 3 และ Mavic 3 Cine​ โดรนพร้อมกล้องคู่แบรนด์ Hasselblad และบินได้นานกว่าเดิม","link":"https://www.blognone.com/node/125711","date":1636175957000,"content":"<div><div><div><p>DJI เปิดตัวโดรน Mavic 3 และ Mavic 3 Cine เป็นโดรนรุ่นล่าสุดในไลน์ Mavic โดยรอบนี้มาพร้อมกล้องคู่ และปรับปรุงเวลาบินให้นานกว่าเดิม</p>\n<p>สำหรับตัวกล้อง DJI Mavic 3 และ Mavic 3 Cine ใช้กล้อง L2D-20c dual-camera พร้อมเทคโนโลยี Natural Color Solution ของ Hasselblad โดยกล้องตัวหลักใช้เซนเซอร์ Four Third 20 ล้านพิกเซล พร้อมเลนส์ 24mm ปรับรูรับแสงได้ตั้งแต่ F2.8-11 ส่วนกล้องตัวรองใช้เซนเซอร์ CMOS 1/2 นิ้วที่ 12 ล้านพิกเซล พร้อมเลนส์เทเลโฟโต้ 162mm ค่ารูรับแสงอยู่ที่ F4.4 ซึ่งเลนส์สองตัวนี้รวมกันแล้วทำให้ได้ฟังก์ชันซูม (ทั้ง optical และ digital) รวมสูงสุดถึง 28 เท่า</p>\n<p>สำหรับระบบอัดวิดีโอ ทั้งสองรุ่นรองรับ 5.1K/50p, DCI หรือ UHD 4K/120p และ 1080p/200p ส่วนรุ่น Cine จะเพิ่มฟีเจอร์รองรับ ProRes 422 HQ ที่อัตราข้อมูลสูงสุด 3,772Mbps</p>\n<p>ด้านที่เก็บข้อมูลภายใน Mavic 3 มีพื้นที่ 8GB ส่วน Cine มี SSD ขนาด 1TB บรรจุอยุ่ในตัวโดรนเนื่องจากต้องเก็บไฟล์วิดีโอ ProRes 422 HQ ซึ่งรุ่น Cine จะมาพร้อม 10Gbps Lightspeed Data Cable จาก DJI ที่โอนข้อมูลจากโดรนไปยังคอมพิวเตอร์หรือสตอเรจได้อย่างรวดเร็ว</p>\n<p>สำหรับตัวโดรน DJI Mavic 3 หนัก 895 กรัม ส่วน Mavic 3 Cine หนัก 899 กรัม เบากว่ารุ่น 2 เล็กน้อย ตัวขาและบอดี้ยาวขึ้นและบางลง มีแบตเตอรี่ 5000mAh ขนาดกะทัดรัดมากขึ้น ทำให้อากาศพลศาสตร์ของตัวโดรนดีกว่าเดิม ซึ่ง DJI เคลมว่า Mavic 3 มี drag ลดลงจากรุ่นก่อนถึง 35% บินได้นานสุดถึง 46 นาทีในสภาพแวดล้อมอุดมคติ นานกว่ารุ่นก่อนถึง 15 นาที</p>\n<p>ข้อมูลอื่น ๆ ของตัวโดรน</p>\n<ul>\n<li>DJI Mavic 3 ทั้งคู่สามารถใช้งานผ่านแอป Fly ของ DJI ได้</li>\n<li>รีโมท Mavic 3 รุ่นธรรมดาใช้ RC-N1 Remote Controller เหมือนรุ่น Air 2S และ Mini 2 ส่วนรุ่น Mavic 3 Cine มาพร้อมสมาร์ทคอนโทรลเลอร์แบบใหม่ที่ DJI เรียกว่า RC Pro มาพร้อมหน้าจอ 5.5 นิ้ว 1000-nit</li>\n<li>Advanced Pilot Assistance Program (APAS) เวอร์ชัน 5.0 รับอินพุตจาก vision sensor แบบฟิชอาย 6 ตัว และ wideangle sensor อีก 2 ตัวเพื่อตรวจจับสิ่งกีดขวางในทุกทิศทางและใช้วางแผนหลบ</li>\n<li>ระบบติดตามวัตถุ ActiveTrack อัพเดตเป็นเวอร์ชัน 5.0 ที่สามารถติดตามวัตถุได้แม้จะหลุดออกจากเฟรมแล้ว และจะดึงวัตถุกลับเข้าเฟรมให้เร็วที่สุด</li>\n<li>Return To Home ปรับปรุงใหม่ที่จะวัดความเร็วลมและคำนวณเส้นทางที่ปลอดภัยและเหมาะสมที่สุดในการกลับเข้ามาที่จุดเริ่มบิน</li>\n<li>มีระบบรับสัญญาณจากดาวเทียมทั้ง GPS, GLONASS, BeiDou ในตัว</li>\n<li>ระบบส่งข้อมูล O3+ ควบคุมโดรนได้ไกลสุดถึง 15 กิโลเมตร และในโหมด Sport ตัวโดรนสามารถบินได้ไกลสุดถึง 30 กิโลเมตรที่ความเร็วสูงสุด 21 เมตรต่อวินาที</li>\n</ul>\n<p>DJI Mavic 3 มีราคาวางจำหน่ายอยู่ที่ 2,199 ดอลลาร์ โดยถ้าเป็นชุด Fly More Combo จะอยู่ที่ราคา 2,999 ดอลลาร์ ส่วน Mavic 3 Cine มีจำหน่ายเฉพาะชุด Premium Combo เท่านั้น โดยราคาจำหน่ายอยู่ที่ 4,999 ดอลลาร์</p>\n<p>ที่มา - <a href=\"https://www.dpreview.com/news/0047640267/dji-mavic-3-mavic-3-cine-drones-4-3-cmos-sensor-28x-zoom-and-46-minutes-of-flight-time\">dpreview</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fc6e90331bdf46d1d3e9c16f2dec14b6.jpeg\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/0339cafc1af6a7af8a1650b807e40648.jpeg\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/85d1851f9e3c5c2497de6de36c1925e2.jpeg\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/03fd3b4d7078946e4870616eafe2216b.jpeg\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fa52d451699c694d03720c16e088e3c4.jpeg\" /><br />\nRC Pro</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/dji\">DJI</a></div><div><a href=\"/topics/drone\">Drone</a></div><div><a href=\"/topics/hasselblad\">Hasselblad</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"58c23f823f74f48a450a1b95fec653a5c8851022fcd53eff03be7e216be7fcd2","category":"Thai"}