{"title":"California wants to build more solar farms but needs more power lines","link":"https://arstechnica.com/?p=1927551","date":1680096410000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/solar-farm-800x533.jpg\" alt=\"solar farm in California\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/solar-farm.jpg\">Enlarge</a> <span>/</span> Westlands Solar Park, near the town of Lemoore in the San Joaquin Valley of California, is the largest solar power plant in the United States and could become one of the largest in the world. (credit: Carolyn Cole/Los Angeles Times via Getty)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>California’s San Joaquin Valley, a strip of land between the Diablo Range and the Sierra Nevada, accounts for a significant portion of the state’s crop production and agricultural revenues. But with the state facing uncertain and uneven water supply due to climate change, some local governments and clean energy advocates hope solar energy installations could provide economic reliability where agriculture falters due to possible water shortages.</p>\n<p>In the next two decades, the Valley could accommodate the majority of the state’s estimated buildout of solar energy under a <a href=\"http://www.caiso.com/InitiativeDocuments/Draft20-YearTransmissionOutlook.pdf\">state plan forecasting transmission needs</a> [PDF], adding enough capacity to power 10 million homes as California strives to reach 100 percent clean electricity by 2045. The influx of solar development would come at a time when the historically agriculture-rich valley is coping with new restrictions on groundwater pumping. Growers may need to fallow land. And some clean energy boosters see solar as an ideal alternative land use.</p>\n<p>But a significant technological hurdle stands in the way: California needs to plan and build more long-distance power lines to carry all the electricity produced there to different parts of the state, and development can take nearly a decade. Transmission has become a significant tension point for clean energy developers across the US, as the number of project proposals balloons and lines to connect to the grid grow ever longer.</p></div><p><a href=\"https://arstechnica.com/?p=1927551#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927551&amp;comments=1\">Comments</a></p>","author":"Inside Climate News","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"58cae9d3fa0d17279df339972cef5f3a140cb945ce62c1dec6e21188bbf2938d","category":"Tech"}