{"title":"Why the Col du Tourmalet is the most important climb of the Tour de France","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/why-the-col-du-tourmalet-is-the-most-important-climb-of-the-tour-de-france","date":1625761471000,"content":"\n      <p><span>“Assassins!” yelled stage winner Octave Lapize at the race officials who awaited him at the top of the Col du Tourmalet. \"</span>Vous êtes des assassins! Oui, des assassins!\" He accused the organisers of being murderers for the severity of the stage.</p>\n<p><span>It was the summer of 1910, this was the first time that Tour de France had ascended the brutal climb. Truthfully, the organisers didn’t know what to expect when they sent their ill-prepared peloton up the highest summit in the history of the race.</span></p>\n<div></div>\n<p><span>This was largely due to the fact that the organisers of the 1910 race, quite literally, created the Tourmalet. Before the Tour graced the climb, the Col was nothing more than a farm track between two of the highest peaks in the Pyrenees, used only by farmers and goats. While this might tickle the fancy of trendy gravel racers today, it wasn’t fit for the peloton of the 1900s. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_TDF_07_1910_1024x1024.jpg?v=1625755589\" /></span></p>\n<p><em><span>Octave Lapize in 1910. Photo: Offside/ L'Equipe</span></em></p>\n<p><span>Journalist Alphonse Steines was the pioneering force behind the creation of the Tourmalet. He had a dream to include the climb in the Tour, and ascended it himself in order to give feedback to the race organisers. </span></p>\n<p><span>He faced deep snow and almost found himself stranded on the rocky slopes, but still persevered, underplaying his tribulations and telegramming his boss, and Tour de France organiser, Henri Desgrange: “Crossed Tourmalet stop. Very good road stop. Perfectly feasible\". On his return, Steines asked Desgrange to provide 3000 francs to the local government to build a road on the mountain.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1006157624_1024x1024.jpg?v=1625761072\" /></span></p>\n<p><span>Desgrange granted him his wish and from that conversation came the famous, winding slopes that have formed an iconic part of the race’s history ever since. The Tourmalet has been included in La Grande Boucle 87 times, and is a symbol of the Tour’s constant ability to innovate, creating exciting racing that means it maintains its position as the most important race in cycling. Deep in the dark green mountains and snaking high into the clouds, champions have been made and hearts have been broken on the Tourmalet.</span></p>\n<p><span>Broken hearts are one thing, but one of the most famous stories that comes from the mountain is that of a broken fork. At the 1913 edition of the Tour, Eugene Christophe was clipped by a vehicle on the climb, snapping his frame in the process. </span></p>\n<p><span>No team cars or spare bikes meant that Christophe had to innovate, taking matters into his own hands. On foot, he headed to the nearest town and used his skills as a blacksmith to weld a new fork for his bike. He finished almost four hours behind the stage winner that day, crawling over the summit with his makeshift bike and waving goodbye to the possibility of victory. But he’d embodied the spirit of the Tourmalet, overcoming challenges and defying limitations.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1156923942_1024x1024.jpg?v=1625761098\" /></span></p>\n<p><span>Stories of the climb also seep into the modern era, of course. In recent years, the iconic train of Team Sky have used the long, unrelenting straights to split the race to pieces, distancing their competitors to set up both Chris Froome and Geraint Thomas for emphatic stage victories.</span></p>\n<p><span>For French cycling fans, though, the most emotional moment of the mountain's history was probably made when Thibaut Pinot won in 2019. \"When you’re a climber, all wins at the Tour de France are beautiful, but to win on a monument like this, that’s what I love\" he said in his post race interview. French riders have constantly performed well on the Tourmalet, their understanding of the magnitude of this mountain perhaps serving as extra motivation. In all but one of the last eight times the climb has been included in the Tour, a French rider has led over the summit.</span></p>\n<p><span>The climb is surrounded by ghosts of the Tour de France: a memorial of Jacques Goddet, organiser of the race between 1936 to 1987 pays homage to his contribution to the race. A statue of Lapize gasping for breath stands proudly on the slopes. The first rider to crest the summit of the climb in 2021 will receive the 'Souvenir Jacques Goddet', a cash prize given in honour of the Frenchman.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Col-du-Tourmalet_16_1024x1024.jpg?v=1625667525\" /></span></p>\n<p><em><span>Image by <a href=\"https://www.instagram.com/michaelblann/?hl=en\">Michael Blann</a> and available as a print <a href=\"https://www.rouleur.cc/products/col-du-tourmalet-05-art-print-michael-blann\">here</a></span></em></p>\n<p><span>When the race was taken up the Tourmalet back in 1910, cycling was sent into a different age. Ascending over 2000m in to the blue skies, it was the highest that professional riders had ever been and set the stage for what was to come from the Tour.</span></p>\n<p><span>Winning a stage of the Tour de France will always be special, but there is something that makes the Tourmalet stage stand out from the rest. The mountain’s role in shaping the Tour de France and the story of its inception embody all that the race stands for. </span></p>\n<p><span>It’s a memorial to Alphonse Steines and his ambition, to Eugene Christophe and his resilience. As the riders of the 2021 Tour de France emerge through the clouds and struggle up the slopes of the Tourmalet, we’ll be reminded of the power of courage and tenacity, traits which epitomise the greatest race in cycling.</span></p>\n\n<p><em>Title image by<span> </span><a href=\"https://www.instagram.com/danielhughesuk/?hl=en\">Daniel Hughes</a><span> </span>and available as a print<span> </span><strong><a href=\"https://www.rouleur.cc/products/tourmalet-daniel-hughes\">here</a></strong> </em></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"58cc59048c38655acc077d7e9e2988f231cba82991736a683dc9f1b39375be1c","category":"Cycling"}