{"title":"Best power meters in 2021 | Top-rated power meters and buyer’s guide","link":"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/","date":1631028300000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2016/05/PM-Group-Test_Collage_FotoJet-21c9359.jpg?quality=45&amp;resize=620,413\" />                                            <p>Once the reserve of professional riders, power meters have gained significant traction across the recreational side of cycling in recent years.</p>\n<p>With massively increased competition in the power meter market and the advent of immersive indoor cycling apps such as <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a>, <a href=\"https://www.bikeradar.com/reviews/training/training-software/trainerroad-training-software-review/\">TrainerRoad</a> and <a href=\"https://www.bikeradar.com/reviews/training/training-software/the-sufferfest-training-centre-app-review/\">The Sufferfest</a>, more and more cyclists are understanding the benefits of training and racing with power.</p>\n<p>We’ve reviewed seven products to bring you our definitive guide to the best power meters available in 2021.</p>\n<h2>What is a power meter?</h2>\n<p>A power meter is, in simple terms, a set of moving scales that measure your power output and is measured as a calculation of torque (how hard you’re pushing the pedals) multiplied by <a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">cadence</a> (how fast the pedals are turning – or revolutions per minute).</p>\n<p>Your power is measured in watts (one watt equals 1 joule per second), giving you a precise calculation of how much energy you’re putting through the pedals at any given moment.</p>\n<p>With this knowledge, you can calculate your training load, target precise effort levels through your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zones</a>, track improvements in your fitness, determine how many calories you’re burning, and more.</p>\n<p>Combine this data with information from a cycling computer and <a href=\"https://www.bikeradar.com/reviews/training/gadgets/heart-rate-monitors/\">heart rate monitor</a>, and it can be a very powerful tool in the right hands.</p>\n<h2>What we tested</h2>\n<p>We tested seven power meters from leading brands through the first six months of 2021, and this list of the best power meters brings together the most reliable and user-friendly power meters we tested.</p>\n<p>Power meters from across the price spectrum have been included as well as different types, from crank-based power meters and spider-mounted power meters to pedal power meters.</p>\n<p>We focused our testing on power meters that measure total power, rather than single-sided power meters, (which measure power output from one leg and double it to estimate total power) because these give the most accurate picture of your power output.</p>\n<p>While single-sided power meters are typically cheaper, they also assume your power balance (the percentage of total power each leg is producing) is perfectly even at all times. Our experience using dual-sided power meters (which measure power output from each leg independently) shows this isn’t the case, though.</p>\n<p>Our testing took into account ease of installation, how each power meter performed on the bike while riding, and whether it’s likely to stand up to long-term use. We have also tested the accuracy of all the power meters listed here. More on this below.</p>\n<h2>Power meter accuracy and how we tested it</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> BikeRadar’s technical writer, Simon Bromley, tested each power indoors on an Elite Direto XR smart trainer, with results also validated outdoors on his Giant TCR long-term test bike.</span></figcaption><span></span></div>\n<p>It’s crucial that any device used to measure something is accurate, so we have rigorously tested all the power meters included in this list.</p>\n<p>Most manufacturers will claim their power meters are accurate to within +/- 1 to 2 per cent. Typically, the more expensive a power meter, the tighter the claimed margin of error will be (though, again, this is not always the case).</p>\n<p>As with any measurement device, accuracy should be a given, but there are occasionally differences between what a brand claims and what the product delivers.</p>\n<p>How have we determined the accuracy of a given power meter? We tested multiple power meters from a wide variety of brands to cross-reference against one another, which enables us to put those claimed accuracy levels to the test.</p>\n<p>While we don’t expect every number to match up exactly, accurate power meters should agree very closely on the power you are producing at any given moment.</p>\n<p>Also, each power meter was tested on a series of indoor rides, with data also validated on outdoor rides.</p>\n<p>When riding inside, we measured power from three sources – two on-bike power meters (for example, power meter pedals and power meter cranks and an <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/elite-direto-xr-smart-trainer-review/\">Elite Direto XR smart trainer</a> – while outside, we always used two on-bike power meters simultaneously (again, using power meters measuring power from different locations on the bike).</p>\n<p>When used to record data simultaneously, we can quickly determine whether the lines on the graph (a trace of your power output across a ride) match up or not. With three power sources in the mix (power meter pedals, power meter cranks and a smart trainer, for example), we can start to get a feel for which – if any – are the outliers.</p>\n<p>With time and lots of riding, we can build up a catalogue of evidence to say whether or not a power meter is able to consistently produce accurate data that you can trust.</p>\n<p>Finally, a word on consistency.</p>\n<p>Consistency is a key attribute of a power meter because you need to be able to trust that changes in your day-to-day power output are genuine changes to how hard you’re turning the pedals (and not simply noise in the data). This is how you know whether or not your training is working, for example.</p>\n<p>It’s vital a power meter be both consistent and accurate, though.</p>\n<p>A consistently inaccurate power meter is like a ruler with an inaccurate scale. Perhaps fine in isolation, but not much use for comparing to any other source.</p>\n<p>If you ever upgrade to another power meter in the future, for example, then having used an inaccurate power meter can render historical performance comparisons meaningless.</p>\n<p>Likewise, if the inaccuracy manifests as an underestimation of your true total power, you could find yourself at a significant disadvantage compared to your competitors when <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-racing/\">racing on Zwift</a> or other <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">indoor cycling apps</a>.</p>\n<h2>How to choose the best power meter</h2>\n<p>Buying a power meter can be a minefield, with a wide range of brands offering products at a variety of price points.</p>\n<p>You also have single-sided and dual-sided power meters, and a decision to make as to where you want to place the unit and, in turn, measure power in the bike.</p>\n<p>If you want to learn more about power meters and what to look out for when buying one, keep reading until the end for our buyer’s guide or click the link below. Otherwise, you can listen to the podcast below.</p>\n<ul><li><a href=\"#buyers-guide\">Jump to our power meter buyer’s guide</a></li>\n</ul>\n<section><div>\n        <h2>Best power meters in 2021</h2>\n<ul><li><strong>Favero Assioma Duo:</strong> £639 / $815 / €695</li>\n<li><strong>Garmin Rally RS200:</strong> £969.99 / $1,099.99 / €1,099.99</li>\n<li><strong>Quarq DFour DUB: </strong>£549 / $595 / €619</li>\n<li><strong>Stages Power LR Shimano Ultegra R8000:</strong> £715 / $789.99 / €849 </li>\n<li><strong>Verve InfoCrank Classic: </strong>£1,281.84 / $1,778.76 / €1,471.02</li>\n</ul><p>\n\n    </p></div>\n    </section><h3>Favero Assioma Duo power meter pedals</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The pods on the Favero Assioma spindles house the power meter electronics.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<ul><li>£639 / $815 / €695 as tested</li>\n<li>Accurate power readings and rechargeable battery</li>\n<li>Cleats aren’t the best</li>\n</ul><p>The Favero Assioma Duo power meter pedals give accurate and consistent power readings for the left and right sides, even when switched between bikes, thanks to the power meter electronics housed in pods on each pedal.</p>\n<p>The pedals have rechargeable batteries with a claimed 50-hour battery life. This is a real win when compared to other power meter pedals that rely on coin cell batteries.</p>\n<p>Favero has its own dedicated smartphone app that lets you update the pedal firmware, check battery levels and access product support.</p>\n<p>Favero provides its own cleat system with these pedals, which is similar to <a href=\"https://www.bikeradar.com/brand/look/\">Look</a>. Unfortunately, the cleats don’t offer a huge amount of adjustability and are slightly slippery to walk on.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/power-meters/favero-assioma-duo-power-meter-pedals-review/\">Read the full Favero Assioma Duo power meter pedals review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Garmin Rally RS200 power meter pedals</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Garmin Rally RS200 power meter pedals are really best in class.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<ul><li>£969.99 / $1,099.99 / €1,099.99 as tested</li>\n<li>Best in class cleat compatibility and accurate data</li>\n<li>Premium price tag</li>\n</ul><p>Garmin’s Rs200 Rally pedals are the first Shimano-native power meter pedals, meaning they can be used with Shimano SPD-SL cleats, which makes them a good option if you’re already using Shimano road pedals.</p>\n<p>Our testing found the readings from the Rs200 Rally pedals to be accurate, although it did take a few seconds for the pedals to start transmitting the data. But this will only really be an issue for track or hill climb cyclists, where every second counts.</p>\n<p>The price tag might be off-putting to some but this is comparable to many other power meters and these are class leaders in many ways.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/power-meters/garmin-rally-rs200-power-meter-pedals-review/\">Read our full Garmin Rally RS200 power meter pedals review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Quarq DFour DUB power meter</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The spider-based power meter is compatible with many drivetrains.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<ul><li>£549 / $595 / €619 as tested</li>\n<li>Compatible with most drivetrains</li>\n<li>Accurate and reliable power and cadence data</li>\n</ul><p>The Quarq DFour DUB is a spider-based power meter that integrates with <a href=\"https://www.bikeradar.com/news/srams-new-cranks-will-fit-any-bike-you-like/\">SRAM’s DUB</a> crank and bottom bracket.</p>\n<p>Thanks to SRAM DUB’s compatibility with other drivetrains, this power meter will work with pretty much all other drivetrains on the market and is easy to install. Just make sure you have the right <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket</a>.</p>\n<p>The power meter measures total power produced by both legs and it proved accurate in testing, as did its cadence readings. There was a small delay before the data was picked up by our tester’s cycling computer, but only by a couple of seconds.</p>\n<p>The power meter might not have the same advanced features as others, but it provides all the data most cyclists will need.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/power-meters/quarq-dfour-dub-power-meter-review/\">Read our full Quarq DFour DUB power meter review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Stages Power LR Shimano Ultegra R8000 power meter</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Stages Ultegra R8000 LR power meter introduces little extra weight to the Shimano crankset.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<ul><li>£715 / $789.99 / €849 as tested</li>\n<li>Maintains the same front shifting performance as Shimano</li>\n<li>No dual-sided SRAM or Campagnolo cranksets</li>\n</ul><p>Built around <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-ultegra-r8000-groupset-review/\">Shimano Ultegra R800o</a>, this left/right power meter from Stages offers a fit-and-forget solution that retains the same shifting performance as standard Shimano cranksets.</p>\n<p>In testing, the dual-sided power meter held up well, delivering data that was in line with other benchmark power meters. That said, pedalling with one leg did cause a delay in data feedback, but this will only really be an issue for cyclists completing one-legged drills.</p>\n<p>There is a coin cell battery in each crank arm to power the separate power meter internals. These are easy to replace and the casing stops water from getting in.</p>\n<p>The only real thing to note with this power meter is that the left/right dual-side power meter option from Stages is not available for SRAM or Campagnolo cranksets.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/power-meters/stages-power-lr-shimano-ultegra-r8000-review/\">Read our full Shimano Ultegra R8000 LR power meter review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Verve InfoCrank Classic power meter</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Verve InfoCrank Classic is built like a tank.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<ul><li>£1,281.84 / $1,778.76 / €1,471.02 as tested</li>\n<li>Accurate power data and robust build quality</li>\n<li>No Bluetooth support and relatively heavy</li>\n</ul><p>The Verve InfoCrank Classic power meter is built around the brand’s own crank arms, which have a robust build quality.</p>\n<p>When it comes to data accuracy, the power meter is almost faultless and worked consistently throughout our testing with no data dropouts.</p>\n<p>The power meter has a sample rate of 256-hertz. This is far beyond what most people will ever need, but will provide others with an incredibly in-depth look at their power output. It also needs no zero-offsets, apart from when being installed on a new bike or after its batteries are changed, making this a very hassle-free option.</p>\n<p>The power meter uses four coin cell batteries – two in each arm – for a claimed battery life of 500 hours.</p>\n<p>The cranks are relatively heavy and the Verve’s own chainrings don’t shift quite as well as Shimano, but overall this is a reliable, robust, hassle-free power meter that provides accurate data making it feel like a proper tool.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/power-meters/verve-infocrank-classic-review/\">Read our full Verve InfoCrank Classic power meter review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<hr /><h2>Also consider…</h2>\n<p>The following power meters scored fewer than four out of five stars in testing so haven’t been included in our main list, but they might just tick the right boxes for you.</p>\n<h3>Power2Max NG Road power meter</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>3.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<div>\n    <img /></div><div><figcaption><span><i></i> The Power2Max NG Road is a spider-based power meter available with a wide range of different cranks and axles.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<ul><li>€990 (spider only) as tested</li>\n<li>Highly customisable option for road and off-road bikes</li>\n<li>Generally accurate but zero-offset function unreliable</li>\n</ul><p>The Power2Max NG Road is a modular, spider-based power meter that can be set up with a wide range of cranks and chainrings for use on and off-road. It also has a good battery life and one of the best warranties available.</p>\n<p>On paper, this premium power meter looks great, but in testing, we found a few niggly things that hold it back.</p>\n<p>Generally, it is user friendly and trouble-free, but there were issues with the zero-offset function and occasional power spikes. These spikes didn’t knock our confidence in the data in the grand scheme of things, which was generally accurate, but they could be frustrating for shorter intervals.</p>\n<p>There is much to like here, but there are many other power meters these days that come without the issues we experienced.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/power-meters/power2max-ng-road-review/\">Read our full Power2Max NG road power meter review</a></li>\n</ul><h2>Also tested…</h2>\n<ul><li>Rotor INspider power meter – full review to come</li>\n</ul><hr /><h2>Power meter buyer’s guide | What to consider</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> SRAM AXS chainset with Quarq’s precise dual-sided power meter.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>When it comes to getting a power meter on your bike, there are now more options than ever before and a wide range of price points, so choosing the best power meter for your needs can be tricky.</p>\n<p>With manufacturers making a range of complicated claims, knowing which stand up to scrutiny is vital. As with any measurement device, accuracy is critical. After that, comes ease of use and reliability.</p>\n<p>And, while prices have certainly come down, a power meter can still be a significant investment.</p>\n<p>Choose well, though, and you should be rewarded with years of reliable service. Luckily, we’re here to help you do just that.</p>\n<h3>Do you really need a power meter?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Power meters are an essential for pro riders, but do you need one?</span></figcaption><span> <i>ANP Sport / Getty Images</i></span></div>\n<p>Power meters are all the rage right now and are arguably a <a href=\"https://www.bikeradar.com/features/cycling-innovations/\">tech innovation that has changed road cycling</a>, but do you actually need one?</p>\n<p>A power meter is, first and foremost, a tool designed to improve training and racing. If you don’t plan on doing targeted training sessions, testing your fitness (whether that be through an <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">FTP test</a> or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/critical-power/\">Critical Power</a>) or using it to pace yourself during races or big rides, a power meter perhaps isn’t worth the outlay.</p>\n<p>Of course, it may be that you just want to know how much power you produce relative to everyone else – and there’s nothing wrong with that.</p>\n<h3>How do power meters work?</h3>\n<p>Power meters typically work by measuring the force on a component (pedal axle, crank arm, spider) using strain gauges. They then convert this to power by multiplying it by the angular velocity (or cadence) of that component. As we’ve already covered, power is measured in watts.</p>\n<p>This data is transmitted wirelessly to a head unit via the ANT+ wireless frequency, and some power meters also have Bluetooth for pairing with a smartphone.</p>\n<p>Most power meters are relatively easy to use: you pair it with your head unit the first time you use it, then just ride. On subsequent rides, your head unit will remember the power meter and deliver data as soon as you start riding.</p>\n<p>However, most power meters will also require you to perform a zero-offset at regular intervals, so it knows to report zero when no torque is being applied to the pedals.</p>\n<h3>Crank vs spider vs pedal power meters</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Pedal power meters are a popular choice with people looking to swap a power meter between bikes.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>If you’ve decided you do want a power meter, the first thing to consider is where you want it on your bike. Typically, crank, spider and pedal power meters are the most common options.</p>\n<p>What kind of riding you do and what compromises you’re willing to make with bike components will, to an extent, narrow your options considerably.</p>\n<p>If you only need power data on a road bike, then the options are wide. If you want to use the same power meter across multiple bikes and for multiple disciplines, your options become more limited.</p>\n<p>A power meter based around one of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-pedals/\">best road bikes pedals</a> wouldn’t be ideal for use on your <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bike</a> or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">mountain bike</a>, for example.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Quarq DFour DUB is an example of a spider-based power meter. It’s designed to integrate with Shimano Dura-Ace R9100 chainrings, but can be used with any 4-bolt 110 BCD chainrings.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Ultimately, there’s some level of compromise with every power meter – there is no ‘one size fits all’ solution for every bike and type of riding.</p>\n<p>Take crank-based and spider-based versus pedal-based power meters, for example. Pedal threads are the same on practically every crankset, meaning pedal-based power meters can be attached to almost any bike, with no modifications required.</p>\n<p>A crank-based or spider-based power meter, on the other hand, might require you to swap the bottom bracket on your bike in order to make it compatible with the new axle.</p>\n<p>If you have multiple bikes that you want to measure power on, the cost of converting them all to the same <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket standard</a> could quickly add up.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> As the name suggested, the Infocrank is a crank-based power meter.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Cranks also take a few minutes longer to swap between bikes than pedals, and the bolt-circle diameter might be too large for use on a mountain bike if you wish to use chainrings smaller than 34 teeth.</p>\n<p>With pedal-based power meters, though, you’re limited to using the pedal body types that the power meter is compatible with. For some models that may just be one road pedal standard, but even for those with interchangeable pedal bodies, not every cleat and pedal system is catered for.</p>\n<h3>Head unit</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> An ANT+ compatible bike computer is the best way to capture power meter data.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Once you have a power meter, you’ll need something to capture all of the data being transmitted.</p>\n<p>While many power meter brands offer dedicated apps for recording data on a smartphone, a dedicated ANT+ compatible cycling computer is a better option. Many of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">best bike computers</a> will support this connectivity.</p>\n<p>If you’re planning on looking at your data while riding, it can be useful to have a cycling computer with a reasonably large screen.</p>\n<p>Squeezing multiple data fields into a single page can be difficult and can lead to information overload. You don’t want to spend the entirety of every ride <a href=\"https://chrisfroomelookingatstems.tumblr.com/\" target=\"_blank\">staring at your stem</a>.</p>\n<h3>How much should you spend?</h3>\n<p>While prices have generally come down as competition has increased, a power meter is still a significant investment.</p>\n<p>As with anything, cheaper options often come with compromises compared to more expensive options.</p>\n<p>The largest compromise offered by many power meter brands comes in the form of single-sided power meters. Because they only measure the power output of a single leg (this figure is then doubled to estimate total power), and therefore only require half the electronics, they tend to be significantly cheaper.</p>\n<p>It follows then that true dual-sided power meters are typically the more expensive options, with spider-based power meters often sitting somewhere in the middle. This isn’t always the case, though.</p>\n<p>The biggest disadvantage of single-sided power meters is that the accuracy of the total power data produced depends on your left/right power balance. Any imbalance introduces a further margin of error, reducing the precision with which your metrics are measured.</p>\n<p>To give a practical example, if your right leg is stronger than your left, but you have a left-only power meter, your power meter will underestimate your total power (and vice versa).</p>\n<p>Not only does this reduce the accuracy of your performance data (personal records, training load, calories burned and so on), it would also be a performance disadvantage in a Zwift race (as already mentioned) unless you have another, more accurate, power source, such as one of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">best smart trainers</a>.</p>\n<p>Ultimately, how much this matters will depend on what you want from your power meter and how much you’re willing to spend.</p>\n<h3>What data do you need?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> We tested all the power meters in this best list against other power meters to make sure the data was accurate.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>At a basic level, every power meter should deliver accurate and reliable power and cadence data.</p>\n<p>Beyond that, though, many power meters now offer a range of advanced metrics such as left/right power balance, pedal smoothness and torque effectiveness. Let’s look at what these things tell us.</p>\n<h4>Left/right power balance</h4>\n<p>Left/right power balance is a measure (or estimation, depending on which power meter you use) of how much power each leg is contributing to the total power being produced. This is usually displayed on head units as a percentage split.</p>\n<p>True dual-sided power meters consist of two separate power meters that measure each leg independently and combine the data from each to give a precise total power.</p>\n<p>If you do have a large imbalance, perhaps due to injury or poor bike fit, this may be something you can target to improve with the use of a dual-sided power meter.</p>\n<p>For better or worse, humans are generally not symmetrical, so having a left/right power imbalance is not unusual. In our experience, left/right balance is also a moving target, with the percentage contribution from each leg changing from second to second depending on variables such as effort level and riding position.</p>\n<p>It’s for this reason single-sided power meters are potentially subject to an additional (and unknown) margin of error.</p>\n<h4>Pedal smoothness</h4>\n<p>Pedal smoothness measures how smoothly force is applied throughout each full, 360-degree rotation of the crank.</p>\n<p>A perfectly smooth pedal stroke, where the power is applied evenly throughout the entire rotation, would give a pedal smoothness reading of 100 per cent, with each leg being assigned a separate score. Most cyclists, though, will see a pedal smoothness reading of between 10 and 40 per cent.</p>\n<p>Though there are claims that improving pedal smoothness can improve your performance, a 100 per cent pedal smoothness score isn’t desirable.</p>\n<p>This is because the majority of the force should be generated on the downstroke, to take advantage of the <a href=\"https://www.bikeradar.com/advice/fitness-and-training/muscles-used-in-cycling/\">biggest muscle groups</a> in your lower half, the glutes and quadriceps.</p>\n<h4>Torque effectiveness</h4>\n<p>Torque effectiveness measures how much of the force (torque) being generated is pushing the pedal or crank arm forward. Like pedal smoothness, this is measured as a percentage and each leg is measured separately.</p>\n<p>A torque effectiveness of 100 per cent for both legs would mean all your effort is going into pushing the pedals forward, though this is difficult to achieve in practice.</p>\n<p>Matt Rowe, of Rowe and King cycle coaching, says we should be <a href=\"https://youtu.be/J3i5uu0eaVY\" target=\"_blank\">aiming for a torque effectiveness of above 60 per cent</a>, but, regardless of where you currently sit, it’s claimed that improving this metric may make your pedal stroke more efficient.</p>\n<h3>Post-ride analysis</h3>\n<p>Once you’ve finished your ride, you’ll need to have access to dedicated software to review the data. Fortunately, there are many options available (some of which make it on our list of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-apps/\">best cycling apps</a>).</p>\n<p>You can use these programmes to calculate your training load and progress, track how many calories you’re burning, review your personal records and more. There’s a practically endless list of metrics to track and evaluate.</p>\n<p>Those with <a href=\"https://www.bikeradar.com/advice/buyers-guides/garmin-edge-bike-computers-buyers-guide-to-all-the-models/\">Garmin Edge</a> cycling computers, for example, can use the company’s online platform, Garmin Connect. This free service presents a variety of metrics in an easy-to-follow format and incorporates insights into your current fitness and training load via its Training Status feature.</p>\n<p><a href=\"https://www.bikeradar.com/brand/strava/\">Strava</a> offers a similar package, but these features are reserved for subscribers to its premium service.</p>\n<p>Those working with a professional <a href=\"https://www.bikeradar.com/advice/5-tips-for-finding-the-right-coach/\">cycling coach</a> may be best served by TrainingPeaks. This service offers a vast array of in-depth analysis tools, for you and your coach to use to monitor your fitness. Your coach can also set future workouts via the platform too.</p>\n<p>For those who like open source (free!) software, Golden Cheetah offers an offline software package that incorporates a huge range of data analysis tools.</p>\n<p>While the user interface isn’t as modern as many online or premium tools, it’s a powerful programme that offers amazing functionality.</p>","author":"Simon Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"58d9f594cefd28fc8d6a37cf3506f64acfe35e30b82d510c0c03ab85331d3e9d","category":"Cycling"}