{"title":"Silent, stiff, and svelte: The Tenways CGO600 Pro e-bike reviewed","link":"https://arstechnica.com/?p=1947821","date":1686826816000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/bike-800x538.jpg\" alt=\"Picture of a bike\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/bike.jpg\">Enlarge</a> <span>/</span> The Tenways CGOPro 600 e-bike. (credit: Eric Bangeman)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>When it comes to e-bikes, sometimes less is more. That's the philosophy of <a href=\"https://us.tenways.com/\">Tenways</a>, a 2-year-old Dutch e-bike manufacturer that has recently crossed the Atlantic to have a go at the US market. All four of their bikes are easy on the eyes, but the $1,899 <a href=\"https://us.tenways.com/pages/cgo600-pro\">CGO600 Pro</a> really grabbed my attention due to its sleek lines and gorgeous looks.</p>\n<p>Tenways markets the CGO600 Pro as \"The Lightweight Champion.\" It's a 37 lb (16.8 kg) bike built to get you from point A to point B with minimal fuss—or gears, as the CGO600 Pro is a single-speed specimen. The assistance comes from a 360 W rear hub motor powered by a 36 V, 10 Ah Li-ion battery. That's good for up to 53 miles of range, a number that jibes well with my experience riding the bike. There's also no chain—the CGO600 Pro uses a carbon belt-drive system, which cuts way back on maintenance, runs quieter, and has a longer life than a chain.</p>\n<p>The CGO600 Pro really looks more like a flesh-powered hybrid than an e-bike. Absent is the chunky look of e-bikes like the <a href=\"https://arstechnica.com/cars/2023/01/doing-it-all-a-foldable-mountain-e-bike-with-extra-fat-tires/\">Cyrusher XF690 Maxs</a> or <a href=\"https://arstechnica.com/cars/2022/08/no-gimmicks-no-problems-the-low-fuss-reasonably-priced-e-bike/\">Velotric Discovery 1</a>. By contrast, the CGO600 Pro looks streamlined and svelte, ready to eat up the miles. The less-is-more design philosophy carries over to the LCD display, which is about the size of a Lego brick and is mounted near the handgrip on the left side of the handlebar. The downtube is slimmer than those on most e-bikes, with a removable battery accounting for the mass. The motor is located in the rear hub.</p></div><p><a href=\"https://arstechnica.com/?p=1947821#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1947821&amp;comments=1\">Comments</a></p>","author":"Eric Bangeman","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"58db30fd88b6f0de07010a36b3ac954098f265cc459d80354c2e76d9fa5f7d37","category":"Tech"}