{"title":"Exploring the formation mechanism of ferulic acid/hydroxypropyl‐β‐cyclodextrin inclusion complex: spectral analyses and computer simulation","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13482?af=R","date":1720851246000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The biological functions of ferulic acid (FA) have garnered significant interest but its limited solubility and stability have led to low bioavailability. Hydroxypropyl-<i>β</i>-cyclodextrin (HP-<i>β</i>-CD), with its distinctive hollow structure, offers the potential for encapsulating hydrophobic molecules. The formation of an inclusion complex between FA and HP-<i>β</i>-CD may therefore be a viable approach to address the inherent limitations of FA. To investigate the underlying mechanism of the FA/HP-<i>β</i>-CD inclusion complex formation, a combination of spectral analyses and computer simulation was employed.</p>\n<h2>RESULTS</h2>\n<p>The disappearance of the characteristic peaks of FA in Fourier transform infrared spectroscopy (FTIR) and X-ray diffraction (XRD) confirmed the formation of an inclusion complex between FA and HP-<i>β</i>-CD. Thermogravimetry-derivative thermogravimetry (TG-DTG) studies demonstrated that the thermal stability of FA was enhanced due to the encapsulation of FA within HP-<i>β</i>-CD. Molecular dynamics simulation also provided evidence that FA successfully penetrated the HP-<i>β</i>-CD cavity, primarily driven by van der Waals interactions. The formation of the complex resulted in more compact HP-<i>β</i>-CD structures. The bioavailability of FA was also strengthened through the formation of inclusion complexes with HP-<i>β</i>-CD.</p>\n<h2>CONCLUSIONS</h2>\n<p>The findings of this study have contributed to a deeper understanding of the interactions between FA and HP-<i>β</i>-CD, potentially advancing a delivery system for FA and enhancing the bioavailability of insoluble active components. © 2024 Society of Chemical Industry.</p>","author":"Junli Lv, \nMengmeng Tan, \nJiali Zou, \nYueying Yun, \nYan Ren, \nFucheng Guo, \nGuoze Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"58dcd46ecabf7fde0880ba7d425871cb7e23e7e696cf6e34d8dceae4bf8c9ce5","category":"Environment"}