{"title":"Epigenetic and Coping Mechanisms of Stress in Affective Disorders: a Scoping Review","link":"https://www.preprints.org/manuscript/202404.0105/v1","date":1711976057000,"content":"This review aims to explore the intricate relationship between epigenetic mechanisms, stress, and affective disorders, focusing on how early life experiences and coping mechanisms contribute to susceptibility to mood disorders. Epigenetic factors play a crucial role in regulating gene expression without altering the DNA (deoxyribonucleic acid) sequence, and recent research has revealed associations between epigenetic changes and maladaptive responses to stress or psychiatric disorders. A scoping review of 33 studies employing the PRISMA-S (Preferred Reporting Items for Systematic Reviews and Meta-Analyses – Statement) guidelines investigates the role of stress-induced epigenetic mechanisms and coping strategies in affective disorders' occurrence, development, and progression. The analysis encompasses various stress factors, including childhood trauma, work-related stress, and dietary deficiencies, alongside epigenetic changes such as DNA methylation and altered gene expression. Findings indicate that specific stress-related genes frequently exhibit epigenetic changes associated with affective disorders. Moreover, the review examines coping mechanisms in patients with bipolar disorder and major depressive disorder, revealing mixed associations between coping strategies and symptom severity. While active coping is correlated with better outcomes, emotion-focused coping may exacerbate depressive or manic episodes. Overall, this review underscores the complex interplay between genetic predisposition, environmental stressors, coping mechanisms, and affective disorders. Understanding these interactions is essential for developing targeted interventions and personalized treatment strategies for individuals with mood disorders. However, further research is needed to elucidate specific genomic loci involved in affective disorders and the clinical implications of coping strategies in therapeutic settings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"58de83f37190783057d941fecfe646582d7b8b6e64616f01d1c7912f8e03dcad","category":"Interdisciplinary"}