{"title":"How to Automatically Toggle iPhone Orientation Lock for Specific Apps","link":"https://www.macrumors.com/how-to/auto-toggle-orientation-lock-iphone/","date":1685364253000,"content":"Tired of toggling your iPhone's Orientation Lock for certain apps? Keep reading to learn how you can make iOS do it for you automatically.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/orientation-lock.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nIn iOS, many apps display a different view when you rotate your iPhone from portrait to landscape orientation. Depending on the app and the way you use it, this behavior isn't always desirable, which is why Apple includes the Orientation Lock option in Control Center. \r<br />\n\r<br />\nHowever, certain apps work more usefully with Orientation Lock disabled – think YouTube or the Photos app, where rotating your device to landscape orientation makes for a better fullscreen viewing experience. \r<br />\n\r<br />\nIf you tend to keep the lock on, you have to disable it in Control Center each time you open these kinds of apps to get the fullscreen experience. Then when you close the app, you have to remember to turn Orientation Lock back on, which isn't ideal. Fortunately, there is a simple personal automation you can create that will take over this process for you for specific apps, so you don't have to keep going in and out of Control Center any more.\r<br />\n\r<br />\nThe following steps show you how it's done.\r<br />\n<ol><li>Open the Shortcuts app on your iPhone and select the <strong>Automation</strong> tab.</li>\r<br />\n<li>Tap the <strong>plus symbol</strong> in the top-right corner of the screen.\r<br />\n</li><li>Tap <strong>Create Personal Automation</strong>.</li>\r<br />\n<li>Scroll down and select <strong>App</strong>.\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/toggle-activation-lock-apps.jpg\" alt=\"shortcuts\" width=\"5143\" height=\"3064\" />\r<br />\n</li><li>Make sure <strong>Is Opened</strong> and <strong>Is Closed</strong> are both checked, then tap the blue <strong>Choose</strong> option. </li>\r<br />\n<li>Select the apps that you want the automation to work with (we’re selecting YouTube and Photos), then tap <strong>Done</strong>.</li>\r<br />\n<li>Tap <strong>Next</strong>.</li>\r<br />\n<li>Tap <strong>Add Action</strong>.\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/orientation-lock-apps.jpg\" alt=\"shortcuts\" width=\"5146\" height=\"2992\" />\r<br />\n</li><li>Start typing \"Set Orientation Lock\" into the search field, then select the script in the search results when it appears.</li>\r<br />\n<li>Tap <strong>Next</strong> in the top-right of the Actions screen.</li>\r<br />\n<li>Toggle off the switch next to <strong>Ask Before Running</strong>, then tap <strong>Don’t Ask</strong> in the confirmation prompt.</li>\r<br />\n<li>Tap <strong>Done</strong> to finish.\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/toggle-orientation-lock-automation.jpg\" alt=\"shortcuts\" width=\"5099\" height=\"2987\" /></li></ol>Your automation will now be saved in the Shortcuts app, and will be activated the next time you open or close any of the apps you selected for it to work with. Bear in mind that if Orientation Lock is already disabled and you open one of the selected apps, the lock will be turned back on, which is likely the reverse effect that you intended.<div>Tag: <a href=\"https://www.macrumors.com/guide/shortcuts/\">Shortcuts</a></div><br />This article, \"<a href=\"https://www.macrumors.com/how-to/auto-toggle-orientation-lock-iphone/\">How to Automatically Toggle iPhone Orientation Lock for Specific Apps</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/how-to-automatically-toggle-iphone-orientation-lock-for-specific-apps.2390795/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"58ed976a75417981b796d6b69e24ab0f68bac4b8a3ed947555265c74cf2428b1","category":"Apple"}