{"title":"Should a Mac or iPhone user update to Wi-Fi 6 or 6E router at home?","link":"https://www.macworld.com/article/2079811/wi-fi-6-or-6e-router.html","date":1696496400000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The Wi-Fi Alliance, which sets the certification process for industry-standard Wi-Fi gear, created a new branding system a few years ago for all the generations of Wi-Fi that had ever appeared. Previously, Wi-Fi was typically identified by the IEEE engineering standards group’s obscure working group numbers, like 802.11n or 802.11ac. To make it simpler to mix and match gear and know what generation you were using, the Alliance labeled products Wi-Fi 4, 5, and 6. (The earliest 802.11 standards were so out of date that they didn’t get numbered but are, by inference, 1, 2, and 3.)</p>\n\n\n\n<p>Wi-Fi 4, 5, and 6 represented generations of standards, each faster and more capable of covering areas of homes and offices with the highest speeds. The most recent updates focused on simultaneously delivering maximum bandwidth to multiple mobile devices, like iPhones.</p>\n\n\n\n<p>All three of these Wi-Fi versions could manage signals across two frequency bands, or ranges of spectrum, that are allocated to carry uses that don’t require licenses, unlike cellular networks. Wi-Fi 4, 5, and 6 operated in the 2.4 gigahertz (GHz) and 5GHz bands. (Many countries around the world offer the same or nearly the same allocations, although the United States has generally led with the biggest chunks opened up.) As those standards improved, most of the gains were in an ever-larger space reserved by governments in the 5GHz band for general consumer and business use. This now allows multi-gigabit-per-second throughput—an incredible gain over the original 11 Mbps in the first Wi-Fi flavor.</p>\n\n\n\n<h2>What is Wi-Fi 6E?</h2>\n\n\n\n<p>Equipment makers want to increase Wi-Fi performance and flexibility, and regulatory authorities in several countries (including the United States) opened up even more frequencies for use to add the potential of higher bandwidth and less interference, this time in the 6GHz. (Wi-Fi 6 and 6GHz have nothing in common.)</p>\n\n\n\n<p>This led the Wi-Fi Alliance to break their simple numbering scheme and added Wi-Fi 6E to distinguish between the “regular” Wi-Fi 6, which works over 2.4GHz and 5GHz bands, and the “new” 6GHz devices: the E stands awkwardly for “plus 6GHz.” I understand the reasoning, but it’s surely confusing.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/Wi-Fi_HaLow_frequency_band_graphic-1.png?w=1200\" alt=\"Wi-Fi standards stack\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/Wi-Fi_HaLow_frequency_band_graphic-1.png?quality=50&amp;strip=all 3785w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Wi-Fi_HaLow_frequency_band_graphic-1.png?resize=300%2C175&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Wi-Fi_HaLow_frequency_band_graphic-1.png?resize=768%2C449&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Wi-Fi_HaLow_frequency_band_graphic-1.png?resize=1200%2C701&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Wi-Fi_HaLow_frequency_band_graphic-1.png?resize=1536%2C898&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Wi-Fi_HaLow_frequency_band_graphic-1.png?resize=2048%2C1197&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"701\" /><figcaption><p>The simple 4, 5, 6 of Wi-Fi numbering has become more baroque, with 6E.</p></figcaption></figure><p>Wi-Fi Alliance</p></div>\n\n\n\n<h2>What does this all mean, performance-wise?</h2>\n\n\n\n<p>Apple has either led or kept pace with most Wi-Fi generations as they’ve appeared, and that includes Wi-Fi 6E. The latest iPhone 15 and 15 Max have Wi-Fi 6, while the 15 Pro and 15 Pro Max have a slight edge with Wi-Fi 6E. M-series Apple silicon Macs mostly have Wi-Fi 6 built-in; some newer models have 6E.</p>\n\n\n\n<p>If you’re still using a Wi-Fi 5 network in your home, you likely don’t need to upgrade unless:</p>\n\n\n\n<ul>\n<li>You have dead spots where you can’t seem to get any coverage, or it’s spotty or frustrating.</li>\n\n\n\n<li>You see a huge difference in speed in different parts of your house, particularly while streaming or transferring files.</li>\n\n\n\n<li>You have gigabit internet service and aren’t seeing close to that data rate when you test from your devices.</li>\n</ul>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/blog_20220118-1.png\" alt=\"Wi-Fi 6 GHz spectrum chart\" width=\"549\" height=\"314\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/blog_20220118-1.png?quality=50&amp;strip=all 549w, https://b2c-contenthub.com/wp-content/uploads/2023/09/blog_20220118-1.png?resize=300%2C172&amp;quality=50&amp;strip=all 300w\" /><figcaption><p>For those interested in the gory details, the 6GHz band offers a ton of spectrum and channels in the United States; fewer in the European Union.</p></figcaption></figure><p>Wi-Fi Alliance</p></div>\n\n\n\n<p>You can easily do some informal checks on internet speed and network performance using <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.speedtest.net/&amp;xcust=1-1-2079811-1-0-0&amp;sref=https://www.macworld.com/feed\">Speedtest</a>, which has native apps for iOS/iPadOS, macOS, and other operating systems. While you’re always subject to the variation in speed of your Internet connection, performing throughput tests repeatedly in different locations will help you spot real problems.</p>\n\n\n\n<p>You can also consult this previous column, “<a href=\"https://www.macworld.com/article/605118/test-internet-speed-quality.html\">How to test your Mac’s internet speed and quality</a>,” for tools built into macOS or that you can install.</p>\n\n\n\n<p>In macOS, there’s a simple way to reveal current Wi-Fi router connection quality and speed: hold down the Option key while selecting the Wi-Fi menu to see some raw interface details, notably the “Tx Rate.” The Tx Rate is the negotiated data rate between your Mac and the router to which it’s connected. With a modern Mac and a high-speed Wi-Fi 5 network, you should always see a Tx Rate in the upper 100s of Mbps. Testing on my Mac mini right now, about 8 feet from a Wi-Fi 6 router, I see a Tx Rate of 1,200 Mbps (1.2 Gbps); on a Wi-Fi 5 router, you will see 866 Mbps when close to a router.</p>\n\n\n\n<p>If you meet any of the criteria above and currently have a mid-priced Wi-Fi 5 network setup, upgrading to Wi-Fi 6 or 6E hardware will offer a boost, although you’ll see it almost solely in streaming media between devices on your network or streaming and downloading files from or to the internet. You might see from 20 to 200 percent faster throughput in the worst-performing areas of your home.</p>\n\n\n\n<p>In most cases, your internet connection and the speed of servers on the internet will limit your performance more than a modern Wi-Fi 5 network.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/maxresdefault-1.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Wi-Fi 6E benefits\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/maxresdefault-1.jpg?quality=50&amp;strip=all 1280w, https://b2c-contenthub.com/wp-content/uploads/2023/09/maxresdefault-1.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/maxresdefault-1.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/maxresdefault-1.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/maxresdefault-1.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/09/maxresdefault-1.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>The Alliance touts lots of improvements with 6E—you’ll experience them best if you have an older, congested network that you can already feel the effects of heavy bandwidth use on.</p></figcaption></figure><p>Wi-Fi Alliance</p></div>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Jeff.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nNetworking</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"58ef66a2b3859d68d970cea331d6677aa797fbe895010526f6851c648ca17fbb","category":"Apple"}