{"title":"Application of response surface methodology to optimize chromium (VI) removal from aqueous solution using pre‐treated sawdust","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14434?af=R","date":1717582748000,"content":"<h2>Abstract</h2>\n<p>Increased chromium usage in industrial applications as chromium III and chromium VI, include metal plating, steel alloys, leather processing, medical applications, and chromium dyeing operations, has resulted in water pollution by Cr (VI) ions, which being toxic and carcinogenic has developed into significant environmental and health problems. The purpose of this research is to remove Cr (VI) ions from synthetic wastewater utilising modified sawdust as an inexpensive adsorbent. Two modified sawdust samples were produced, one using sodium hydroxide and one using sulfuric acid. The experimentation, based on several batch systems, has been undertaken at 25–65°C with 0.5–1.5 g/L sawdust dosage. These conditions were applied to remove Cr (VI) ions at concentrations of 1–6 ppm at pH values from 3 to 10. The results have shown that adsorption onto sawdust followed an intraparticle diffusion mechanism with various rate parameters from 0.65 to 5.24 mg g<sup>−1</sup> min, for treated and untreated sawdust. The distribution coefficient kc$$ \\left({k}_c\\right) $$, enthalpy ΔH$$ \\left(\\Delta H\\right) $$, thermodynamic standard free energy ΔG$$ \\left(\\Delta G\\right) $$, and entropy ΔS$$ \\left(\\Delta S\\right) $$ were determined from a number of temperature studies. Kinetic studies showed that the pseudo-second order model gave the optimum correlation to the experimental results. The Freundlich and Langmuir isotherms were applied to analyse the experimental equilibrium results. The optimised conditions for the adsorption process were obtained using the D-optimal design method, and the maximum removal percentage of 100%, was determined at pH = 3, <i>T</i> = 25°C, adsorbent dosage = 1.5 g/L, and an initial Cr (VI) concentration = 5.72 ppm.</p>","author":"Samin Sirusbakht, \nLeila Vafajoo, \nGordon McKay, \nPrakash Parthasarathy","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"590a0f0c839782a5f2f249f3ddca055183ab473e52c558669104848a28855785","category":"Environment"}