{"title":"Atari เข้าซื้อ Digital Eclipse สตูดิโอรีมาสเตอร์เกมย้อนยุค ในราคา 20 ล้านดอลลาร์สหรัฐ","link":"https://www.blognone.com/node/136496","date":1698751696000,"content":"<div><div><div><p>Atari เข้าซื้อกิจการ Digital Eclipse ผู้พัฒนาเกมที่เป็นที่รู้จักจากการรีมาสเตอร์เกมย้อนยุค เช่น Teenage Mutant Ninja Turtles: The Cowabunga Collection, Disney Classic Games Collection และ Atari 50: The Anniversary Collection ด้วยมูลค่า 20 ล้านดอลลาร์สหรัฐ</p>\n<p>การซื้อกิจการคาดว่าจะเสร็จสิ้นภายในไม่กี่วันข้างหน้า โดย Atari จ่ายเงินค่าตอบแทนเบื้องต้นจำนวน 6.5 ล้านดอลลาร์ เป็นเงินสด 4 ล้านดอลลาร์ และหุ้นสามัญที่ออกใหม่มูลค่า 2.5 ล้านดอลลาร์ และอาจได้รับผลตอบแทนตามอัตราการชำระมูลค่ากิจการตามผลการดำเนินงานสูงถึง 13.5 ล้านดอลลาร์ ที่สามารถชำระเป็นเงินสดได้ในระยะเวลา 10 ปีข้างหน้า</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/31bb979206115af653db52384ef7bb10.png\" /></p>\n<p>ในหน้า FAQ บนเว็บไซต์ของ Digital Eclipse กล่าวว่าจะสตูดิโอยังคงมีอิสระในการแสวงหาโปรเจ็กต์ร่วมกับค่ายอื่นได้เหมือนเดิม ซึ่ง Digital Eclipse มีโปรเจ็กต์ที่ไม่ได้เปิดตัวหลายโปรเจ็กต์ที่ไม่ได้อิงกับเกมของ Atari และเกมเหล่านี้จะพัฒนาต่อไปตามแผนที่วางไว้</p>\n<p>Digital Eclipse มีแผนที่จะพัฒนาเกมชุด Gold Master Series ที่เป็นสารคดีวิดีโอเกมเกี่ยวกับเกมย้อนยุคผนวกรวมกับตัวเกมเวอร์ชันรีมาสเตอร์ และเทคนิคต่าง ๆ ที่ใช้เกมยุคนั้นต่อ ซึ่งเกมแรกคือ The Making of Karateka ที่วางขายไปเมื่อ 29 สิงหาคมที่ผ่านมา</p>\n<p>นอกจากนี้ยังมีซีรี่ส์ Digital Eclipse Arcade และการรีมาสเตอร์เกม Wizardry: Provide Grounds of the Mad Overlord ที่อยู่ในระหว่างการพัฒนา การซื้อกิจการครั้งนี้ของ Atari อาจจะทำให้พัฒนาเกมเหล่านี้ได้ง่ายขึ้นเล็กน้อย</p>\n<p>ก่อนหน้านี้ Atari ได้ซื้อกิจการของ Nightdive Studios สตูดิโอเกมที่เน้นรีมาสเตอร์เกมจากปลายยุค 90s ในราคา 10 ล้านดอลลาร์ และซื้อชุมชนเกมย้อนยุคอย่าง Atariage ไปเมื่อต้นปี โดย Atari มองว่า Digital Eclipse และ Nightdive มี DNA ที่สอดคล้องไปกับวิสัยทัศน์ของ Atari</p>\n<p>ที่มา - <a href=\"https://www.gamesindustry.biz/atari-to-acquire-digital-eclipse-in-20m-deal\">Games Industry.biz</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/atari\">Atari</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"590eeeadd4ef8e8fdf98183a46cd617d794bc01128753a593a7666ae7b8fabb3","category":"Thai"}