{"title":"243 Effects of body weight change in pre-production Duroc boars on semen collection training, semen production parameters, and longevity in a commercial boar stud","link":"https://academic.oup.com/jas/article/102/Supplement_2/194/7664985?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Our objective was to assess the effects of percentage body weight (BW) change in developing Duroc boars on semen collection training, semen production parameters, and longevity in a commercial boar stud. Retrospectively, 164 boars were divided into one of three groups based on their percentage BW change from arrival to the boar stud until the end of the 42-d isolation period. The one-third of boars that had the greatest percentage of BW change during the isolation period gained 36.1% to 10.1% (TOP). The middle one-third of boars that were intermediate in percentage BW change during isolation gained 9.7% to 2.6% (MIDDLE). The final group consisted of one-third of boars that either minimally gained or lost BW (2.5% to -9.5% change in BW; BOTTOM). During the isolation period boars in the TOP group lost the least amount of backfat (indicated by ultrasound or caliper score; <span>P</span> &lt; 0.05), while boars in the BOTTOM group lost the most backfat. Average boar age at the time of successfully becoming a working boar (successfully mounting the collection dummy and producing an ejaculate with a motility ≥ 70% and percent normal morphology ≥ 65%) and the proportion of boars that were successful at become working boars did not differ between groups (<span>P</span> &gt; 0.05). Among working boars, the concentration of sperm in ejaculates tended to differ (<span>P</span> = 0.0740) between groups (Table). Boars in the TOP group had a greater percentage of sperm with normal morphology (<span>P</span> = 0.0337) than boars in the BOTTOM group. There was a group by production week interaction (<span>P</span> &lt; 0.0001) for semen ejaculate volume, total number of sperm, and total number of sperm with normal morphology. Boars in the TOP and MIDDLE groups produced more total sperm and normal sperm than the BOTTOM group from wk 8 to 20 of being working boars, resulting in production of considerably more doses for artificial insemination. During their time as working boars, removal from the stud by cull or death was not different between groups (<span>P</span> &gt;0.05). There was also no difference (<span>P</span> &gt; 0.05) between groups on the average week of removal from the stud, with each group having boars most frequently removed at wk 22 of production. While percentage BW change during isolation did not affect semen collection training and longevity in the stud, the increase in production of total normal sperm in the TOP and MIDDLE groups compared with the BOTTOM group could have substantial economic benefits for boar stud. Our study suggests that managing boars individually to ensure they stay in a positive metabolic state is ideal for optimal semen production at a boar stud.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"591042c5728d8532eef4387509e977ede04e48715c9c8c7b13be8c3f026bd5d5","category":"Environment"}