{"title":"Feds open new Tesla probe after two Model Y steering wheels come off","link":"https://arstechnica.com/?p=1922527","date":1678289315000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/5e5dbc1b-c39c-403f-8de1-5661476dae5b-800x533.jpg\" alt=\"Tesla Model Y interior\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/5e5dbc1b-c39c-403f-8de1-5661476dae5b.jpg\">Enlarge</a> <span>/</span> Even Tesla says you should keep your hands on the steering wheel, but it helps if that wheel is actually connected to the steering column. (credit: Tesla)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Tesla has yet another federal headache to contend with. On March 4, the National Highway Traffic Safety Administration's Office of Defects Investigation <a href=\"https://static.nhtsa.gov/odi/inv/2023/INOA-PE23003-5769.PDF\">opened a preliminary investigation</a> after two reports of Tesla Model Y steering wheels detaching in drivers' hands while driving.</p>\n<p>NHTSA's ODI says that in both cases, the model year 2023 Model Ys each required repairs on the production line that involved removing their steering wheels. The wheels were refitted but were only held in place by friction—Tesla workers never replaced the retaining bolt that affixes the steering wheel to the steering column. In 2018, Ford <a href=\"https://arstechnica.com/cars/2018/03/ford-recalls-1-3-million-cars-for-steering-wheels-that-might-fall-off/\">had to recall more than 1.3 million vehicles</a> after an incorrectly sized bolt resulted in a similar problem.</p>\n<p>The ODI document states that \"sudden separation occurred when the force exerted on the steering wheel overcame the resistance of the friction fit while the vehicles were in motion\" and that both incidents occurred while the electric vehicles still had low mileage.</p></div><p><a href=\"https://arstechnica.com/?p=1922527#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1922527&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"23e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5911965822dfc440db88630bf55f30287e25dc1219311a716fad09","category":"Tech"}