{"title":"97 Effects of crude protein content and supplementing probiotics in late gestation and lactation sow diets on performance of sows and suckling pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/30/7664903?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to investigate the effects of crude protein (CP) content and supplementation with Bacillus-based probiotics (PRO) in late gestation and lactation sow diets on performance of sows and suckling pigs. Pregnant sows (n = 120; 60 gilts and 60 2+ parity) were assigned to 4 dietary treatments in a 2 x 2 factorial arrangement (2 CP levels, with or without probiotics) from d 85 of gestation to d 21 of lactation. The experiment was conducted in 4 consecutive periods (half sows and half gilts per period). The diets consisted of 1) a corn-soybean meal (SBM)-based low CP (LCP; 12% CP) diet; 2) LCP + 0.05% probiotic (LCP-PRO); 3) a corn-SBM-based high CP (HCP; 15% CP) diet; and 4) HCP + 0.05% probiotic (HCP-PRO). The diets were formulated for 2 phases: gestation (d 85 – 115) and lactation (d 1 – 21). Sow body weight (BW) and backfat thickness were recorded on d 85 and 111 of gestation and on d 1 and 21 of lactation. Sow blood and milk were sampled on d 1 and 21 of lactation to analyze plasma urea nitrogen (PUN) concentration, and milk fat, protein, and lactose, respectively. Data were analyzed using the PROC MIXED of SAS. The statistical model included diet as fixed effect and period as random effect. There were no significant effects of CP and PRO on sow BW or backfat thickness. There was an interaction (<span>P</span> &lt; 0.05) between CP and PRO on the number of stillbirths, where the number of stillbirths did not differ between LCP and LCP-PRO groups, while the number decreased in sows fed HCP-PRO diet compared with HCP diet. Sows fed LCP diets had reduced (<span>P</span> &lt; 0.05) PUN concentrations on d 1 and d 21 of lactation compared with those fed HCP diets. However, no difference was found in fat, protein, or lactose content in both colostrum (d 1) and milk (d 21). Piglets from the sows fed LCP diets showed heavier (<span>P</span> &lt; 0.05) birth weights (1.58, 1.57, 1.53, and 1.52 kg for diets 1 to 4) than those in HCP groups, however, the average daily gain (ADG) of week 1 (188, 166, 187, and 187 g for diets 1 to 4) was less (<span>P</span> &lt; 0.05) for piglets in LCP groups than HCP groups. No other effects were observed on piglet growth. In conclusion, CP and PRO did not affect sow BW and backfat thickness. There was an interaction effect of CP and PRO on reproductive performance, where stillbirths did not differ between LCP and LCP-PRO groups; however, stillbirths decreased with PRO in HCP diet. Moreover, feeding LCP diets to sows did not influence milk nutrient contents and overall growth performance in suckling piglets.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"59279cea1f47c0fb47625fdbb529af33b3b6500ba76b5284be8cf8e26440aec5","category":"Environment"}