{"title":"Assessing capacities to strengthen intersectoral collaboration in Territorial Public Health Councils in the Republic of Moldova","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303821","date":1717077600000,"content":"<p>by Oleg Lozan, Valentin Mîţa, Daniela Demişcan, Tatjana Buzeti, Peter Beznec, Valeriu Sava, Ala Curteanu, Constantin Rîmiş, Robert Canavan, Helen Prytherch</p>\r\nBackground <p>The government of the Republic of Moldova, endorsed the principle of Health in All Policies (HiAP) through its health sector reforms to address the rising burden of non-communicable diseases and health inequalities. Territorial Public Health Councils (TPHCs) were created to ensure the coordination and management of the population’s health in their respective district. This study assessed the capacities of the TPHCs to identify areas in need of support for strengthening their intersectoral collaboration role in public health at local level.</p> Methods <p>A mixed-method approach, using qualitative and quantitative techniques, was used to compare the perceptions of all TPHC members (n = 112) and invitees (n = 53) to council meetings from 10 districts covering all geographical areas of Moldova. The quantitative information was obtained using a cross-sectional survey, while the qualitative aspects were assessed within focus group discussions (FGDs).</p> Results <p>Half of all TPHC members, including 75% from groups with a non-medical background, did not attend a public health course within the last three years. Overall, groups with a medical background were more aware of the legislation that governs TPHC activity and intersectoral collaboration compared with those with a non-medical background. The FGDs of TPHC meetings revealed that members had an insufficient level of understanding of intersectoral collaboration to solve public health issues and lacked clarity about their place and role within the TPHC.</p> Conclusions <p>HiAP implementation was found to be suboptimal with insufficient capacity at local level. TPHC members’ ability to deal with public health issues were severely impaired by a general lack of knowledge and understanding of how to utilize the TPHC platform for maximum benefit. Reforming TPHC regulation is required in addition to extensive capacity building for TPHC members to increase member understanding of their roles as intended by TPHC regulations, including the facilitation of intersectoral collaborations.</p>","author":"Oleg Lozan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5928b3bf8c14e6464c8d90c8bce3718720d557c22011b058bbf22ebaa589c80c","category":"Interdisciplinary"}