{"title":"Relationship and Predictive Value of Netrin-1 Expression and Ultrasonic Blood Flow Parameters with the Severity of Cervical Intraepithelial Neoplasia","link":"https://www.preprints.org/manuscript/202410.0907/v1","date":1728642343000,"content":"Objective: To analyze the relationship and predictive value of Netrin-1 expression and ultrasonic blood flow parameters with the severity of cervical intraepithelial neoplasia (CIN). Methods: The receiver operating characteristic (ROC) curve analysis was used to evaluate the predictive value of Netrin-1 expression and ultrasonic blood flow parameters for the severity of cervical intraepithelial neoplasia. Results: FI, VI, and VFI levels increased sequentially, and the differences in levels between grade II, III patients, and the control group were statistically significant (P &lt; 0.05). Netrin-1 was negatively correlated with ultrasonic blood flow parameters FI, VI, and VFI (r = -0.287, -0.309, -0.298, P &lt; 0.05). The results of multifactorial logistic regression analysis showed that Netrin-1 positivity was a protective factor for CIN III lesions, while FI, VI, and VFI were risk factors for CIN III lesions. The AUC area of Netrin-1 was 0.712, with a sensitivity and specificity of 76.4% and 79.5%, respectively, which were higher than those of other indicators (P &lt; 0.05). Conclusion: Netrin-1 is under-expressed in CIN patients, while ultrasonic blood flow parameters FI, VI, and VFI are over-expressed, and both are closely related to the severity of the patient's lesions. Netrin-1 is negatively correlated with ultrasonic blood flow parameters FI, VI, and VFI. Netrin-1 positivity is a protective factor for CIN III lesions, while FI, VI, and VFI are risk factors for CIN III lesions. The expression levels of both have a certain predictive guiding role in the early screening, diagnosis, and prevention of cervical cancer.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"592cc74777cb7f76839d11a7e2b03bc18de5d272f9a76d98d29c2da8ed18b090","category":"Interdisciplinary"}