{"title":"Why home favourites will thrive on revamped women’s Tour Down Under route","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/why-home-favourites-will-do-well-on-revamped-women-s-tour-down-under-route","date":1704789001000,"content":"\n      <p><span>January means one thing for avid cycling fans – the Tour Down Under – and most importantly, the start of another year of racing. It is a race that allows riders to demonstrate their early form, kicking off the year with a potential stage win or overall title before the Women’s WorldTour calendar heads to the Middle East and then Europe, where it’ll be a few degrees cooler than on the warm southern coast of Australia. </span></p>\n<div></div>\n<div></div>\n<p><span>While the race’s location in Adelaide is a long way for those who live in Europe and the US, for some, this is a race which is much closer to home, giving the Aussie riders the chance to race in front of home crowds with friends and family cheering them on from the sidelines. This factor has played heavily into the Women’s Tour Down Under’s previous winners, having been won by Australians on all occasions bar one year, 2020, when Ruth Edwards (Human Powered Health) won the overall title.</span></p>\n<p><span>FDJ-Suez rider Grace Brown, who also claimed her fourth National Time Trial Championship title this week, donned the ochre leader’s jersey last year after she won the final stage, stopping rampant Tour Down Under winner Amanda Spratt (Lidl-Trek) from taking a fourth overall victory by just 10 seconds. All three of the stage race’s previous winners will be on the start for this year’s race, which starts on Friday January 12, 2024, and they’ll all be hoping to get a good result. But this year’s route comes with a few new twists, and they might benefit the native riders more than anyone else. </span></p>\n<p><em><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-09327.jpg?v=1704460595\" /></span></em><em><span>Grace Brown during stage three of the 2023 edition</span></em></p>\n<p><span>Stage three of this year’s route will feature a climb that has become a defining feature of the men’s race, but it will be the first introduction to Willunga Hill for the Women’s WorldTour peloton. The climb is three kilometres long with an average gradient of 7.4%, which peaks to double digital gradients of 15.6%. It’s a decisive climb in the men’s race, and that could prove the same in the women’s race. As the finish to the final stage of the entire race, it should add another element of drama to naming the overall winner. It’s a perfectly plausible scenario that we could see Spratt and Brown fighting it out on the slopes  of Willunga Hill to the bitter end for the title, but there are certainly some other contenders who could take advantage of stage three’s summit finish.</span></p>\n<p><span>The only Australian WorldTour team, Liv-Jayco-Alula, are armed with a squad that might just be able to take the reins from fellow Aussie winners. Newly-signed Ella Wyllie will be a favourite amongst the team for the Zwift young rider’s jersey and a top-10 placing on the GC. She placed second in the youth category last year and eighth overall. She also came second in the youth category at the Tour de France Femmes in 2023 after an impressive performance throughout the week-long race. The 21-year-old rider is one of the best on the climbs and could take full advantage of the peaks that come up over the three stages, albeit she does excel more on the long, mountain climbs rather than the shorter, more punchy style ones of which this race boasts. </span></p>\n<p><span>However, her team-mate Ruby Roseman-Gannon is a rider who could lead the Australian team to victory. She placed fourth overall last year and has just won her second Australian Criterium Championships as well as crowning herself the Australian National Champion on the road too, demonstrating her early form. Alex Manly will also be another Aussie who could have a successful race, having won stage two of last year’s race from Birdwood to Uraidla. Manly could ride to victory on stage two once again, but this year, the route goes from Glenelg to Stirling and features the Cherry Blossoms climb – a three kilometre climb reaching over 15% gradients, before a circuit around the town of Stirling. Stage two also welcomes the women’s Tour Down Under longest-ever route, sitting at 104.2km in length. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-09023.jpg?v=1704460627\" /></span><em><span>Alex Manly celebrating her stage win with her team-mates last year</span></em></p>\n<p><span>Stage one is the flattest of them all, with only 1,483 metres of climbing across 93km, and Georgia Baker could be a contender for this stage. She came third in last year's opening stage and is one of Australia’s better sprinters in the women’s peloton. Finishing in Campbelltown, the closing kilometres finishes with a descent down into the town before a sprint to the line. If it comes down to a bunch sprint, which looks most likely, we expect Baker to be in with a chance of victory here. However, she’ll have to bring her absolute best and hope the home crowds will provide her with that final kick as she’ll be up against American riders Chloe Dygert (Canyon//SRAM) and Megan Jastrab (Team DSM-Firmenich PostNL), both of whom are excellent sprinters. </span></p>\n<p><span>Ally Wollaston (AG Insurance-Soudal Team), Tiffany Cromwell (Canyon//SRAM), Sarah Gigante (AG Insurance-Soudal Team), and Lauretta Hanson (Lidl-Trek) will be other Aussie riders looking to make the most of their time here, especially Gigante who won the first queen of Willunga Hill title in 2021 at the Santos Festival of Cycling and will want to try to hold onto her crown. </span></p>\n<p><span>Despite some strong Australian riders on the start line, including two riders who have dominated the race’s top spot over the race’s history, there are also plenty of other riders making their way across the water to test their early season form. One rider in particular, Cecilie Uttrup Ludwig (FDJ-Suez), who will be making her first appearance in the race, will be a rider who could be in contention for the overall title. While she may not have the home advantage like her team-mate and previous race winner Grace Brown, she is a strong rider who will suit a course like this, especially with the short, sharp climbs and circuit finish throughout the three days of racing.  </span></p>\n<p><span>As the anticipation builds for the Women’s Tour Down Under, the question lingers:  will we see another Australian taking the top step of the podium once again with this revamped route, or will we see a replay of the 2020 edition with a surprise win from a rider outside the country? Thankfully, we’ve not got long until we find out. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"592f3cca1b7838664c5824b92983b33b75b0f4395847803bf02cdfe6b87f16ba","category":"Cycling"}