{"title":"Science lives here: take a virtual tour of the Royal Institution in London","link":"https://arstechnica.com/?p=1990405","date":1703593811000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/royal24-800x600.jpg\" alt=\"The exterior of the Royal Institution\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/royal24.jpg\">Enlarge</a> <span>/</span> The Royal Institution was founded in 1799 and is still located in the same historic building at 21 Albermarle Street in London. (credit: <a href=\"https://creativecommons.org/licenses/by-sa/3.0/\">Griffindor/CC BY-SA 3.0</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>If you're a fan of science, and especially science history, no trip to London is complete without visiting the <a href=\"https://www.rigb.org\">Royal Institution</a>, browsing the extensive collection of artifacts housed in the <a href=\"https://www.rigb.org/visit/faraday-museum\">Faraday Museum</a> and perhaps taking in an evening lecture by <a href=\"https://www.youtube.com/watch?v=BRudidBcfXk\">one of</a> the many esteemed scientists routinely featured—including the hugely popular annual <a href=\"https://www.rigb.org/christmas-lectures\">Christmas lectures</a>. (The lecture theater may have been overhauled to meet the needs of the 21st century but walking inside still feels a bit like stepping back through time.) So what better time than the Christmas season to offer a virtual tour of some of the highlights contained within the historic walls of 21 Albemarle Street?</p>\n<p>The Royal Institution was founded in 1799 by a group of leading British scientists. This is where <a href=\"https://en.wikipedia.org/wiki/Thomas_Young_(scientist)\">Thomas Young</a> explored the wave theory of light (at a time when the question of whether light was a particle or wave <a href=\"https://cocktailpartyphysics.com/the-photon-has/\">was hotly debated</a>); <a href=\"https://en.wikipedia.org/wiki/John_Tyndall\">John Tyndall</a> conducted experiments in radiant heat; Lord Rayleigh discovered argon; <a href=\"https://en.wikipedia.org/wiki/James_Dewar\">James Dewar</a> liquified hydrogen and invented the forerunner of the thermos; and father-and-son duo <a href=\"https://en.wikipedia.org/wiki/William_Henry_Bragg\">William Henry</a> and <a href=\"https://en.wikipedia.org/wiki/Lawrence_Bragg\">William Lawrence Bragg</a> invented x-ray crystallography.</p>\n<p>No less than 14 Nobel laureates have conducted ground-breaking research <a href=\"https://en.wikipedia.org/wiki/Royal_Institution\">at the Institution</a> over the ensuing centuries, but the 19th century physicist <a href=\"https://en.wikipedia.org/wiki/Michael_Faraday\">Michael Faraday</a> is a major focus. In fact, there is a full-sized replica of Faraday's magnetic laboratory—where he made so many of his seminal discoveries—in the original basement room where he worked, complete with an old dumbwaiter from when the room was used as a servant's hall. Its arrangement is based on an 1850s painting by one of Faraday's friends and the room is filled with objects used by Faraday over the course of his scientific career.</p></div><p><a href=\"https://arstechnica.com/?p=1990405#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1990405&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"593182e60b8dddc29d68cb65a31080e00106e092fbff443893f9f268b6c16817","category":"Tech"}