{"title":"Kuurne-Brussels-Kuurne 2021: Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/kuurne-brussels-kuurne-2021-preview","date":1614458203000,"content":"\n      <p><span style=\"font-weight: 400;\">Many consider the Belgian opening weekend, beginning 27th February, to be the bona fide start of a new cycling season. The weekend's events kicks-off with <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad-2021-preview\">Omloop Het Nieuwsblad</a> on Saturday and close with Kuurne-Brussels-Kuurne on Sunday.</span></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><span style=\"font-weight: 400;\">KBK is categorised as a 1.HC event, so doesn't quite hold the same prestige as Omloop – a WorldTour race. Nonetheless, some of cycling’s greats have won here, including Mark Cavendish, Johan Museeuw and Tom Boonen.</span></p>\n<p><span style=\"font-weight: 400;\">Glancing through the history books, Belgians have the advantage here. A Belgian rider has won 52 of the 72 editions throughout <span>Kuurne-Brussels-Kuurne's</span> rich history. </span>That trend has been bucked lately, though, only two Belgians have won on home soil since 2010.</p>\n<p class=\"p1\"><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\"><em><strong>Related – The 2021 Men's Early Season: The Rouleur Racing Guide</strong></em></a><br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\"><em><strong>Related – The Women's 2021 Early Season: The Rouleur Racing Guide</strong></em></a></p>\n<p><span style=\"font-weight: 400;\">In 2020, the most recent edition, Kasper Asgreen formed a breakaway with Roy Jans and <span>Boris Vallée</span> at the 30km to go mark. Asgreen was the strongest of the group and dropped his companions with 10km remaining. The Dane’s lead fell steadily to the bunch, but he was strong enough to hold on for victory just three seconds ahead of the fast-closing pack. </span></p>\n<p><span style=\"font-weight: 400;\">In 2019, Bob Jungels won for Quick-Step in a markedly similar fashion.</span></p>\n<h4><b>Route</b></h4>\n<p><span style=\"font-weight: 400;\">As the race's name suggests, the riders will start and finish in Kuurne. In between, a series of cobbles and climbs will greet the participants. The 2021 race route has only recently been released, and <a href=\"https://twitter.com/laflammerouge16\" target=\"_blank\" rel=\"noopener noreferrer\">La Flamme Rouge</a> has created the route profile below:</span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/kuurne-bruxelles-kuurne-2021_1024x1024.png?v=1614458163\" alt=\"\"></span></p>\n<p>In 2020, the race was just over 200km in total, with the Kruisberg coming at the 123km mark and the Oude Kwaremont 20km later. </p>\n<p><span style=\"font-weight: 400;\">Despite any of the day's potential difficulties, the road will be largely flat for the final 50km, with two laps around <span>Kortrijk </span>and Kuurne to finish. This allows time for early escapees to be caught, chasers to make their way back on if there is any hesitation in the peloton, and new attacks to form.<br></span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad-2021-preview\">Related – Omloop Het Nieuwsblad Preview</a></strong></em></p>\n<h4><b>Contenders</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Politt_1024x1024.jpg?v=1613410501\" alt=\"Nils Politt\"></b></p>\n<p><em><span style=\"font-weight: 400;\">Nils Politt at the 2019 World Championships. (Image credit: Charlie Forgham-Bailey / SWpix)</span></em></p>\n<p><span>The racers will essentially be split into two groups. </span>Some teams will look for the race to be decided in a mass sprint, others will look to launch a series of long-range attacks, and some will try a combination of the two. </p>\n<p><span>Taking place in Belgium's late Winter, it goes without saying that vile weather is often inflicted on the riders. This mean that the winner must remain comfortable in rain, wind and cold conditions.</span></p>\n<p><span style=\"font-weight: 400;\">The winner of Kuurne-Brussels-Kuurne came from Deceuninck-Quick-Step in both 2019 and 2020. Bob Jungels has now left the team for AG2R Citroen, but </span><b>Kasper Asgreen</b><span style=\"font-weight: 400;\"> will look to make it back-to-back wins this year.</span></p>\n<p><span style=\"font-weight: 400;\">Deceuninck will be one of the dominant teams throughout the race. </span><b>Yves Lampaert,</b><span style=\"font-weight: 400;\"> <strong>Zdeněk Štybar</strong></span><span style=\"font-weight: 400;\"> or indeed Kasper Asgreen are all great options for the Belgian outfit. The team will make it difficult over the cobbles and hills before launching a series of moves up the road in the final kilometres. It would be astounding if a small group forms at the head of the race late on without a DQS rider involved.</span></p>\n<p><span style=\"font-weight: 400;\">AG2R Citroen have turned their attention to the classics with their signings for the 2021 season. </span><b>Greg Van Avermaet</b><span style=\"font-weight: 400;\"> partners</span><b> Oliver Naesen</b><span style=\"font-weight: 400;\">, who together form an ominous duo. The 2019 winner will not be on the startline for his new team, though, Bob Jungels will ride the French classics instead.</span></p>\n<p><b>Jasper Stuyven</b><span style=\"font-weight: 400;\"> and </span><b>Mads Pedersen</b><span style=\"font-weight: 400;\"> form another very strong partnership, this time for Trek-Segafredo. Both are quick in a sprint and can ride a long, difficult race — Stuyven won at Omloop last year after beating Yves Lampaert in a sprint, whilst Mads Pedersen became World Champion after defeating Matteo Trentin to the line in Yorkshire. </span></p>\n<p><b>Peter Sagan</b><span style=\"font-weight: 400;\"> is a former winner in Kuurne — he won in 2017 — but will not be partaking this season. The Slovak had planned to be present at the opening weekend in Belgium after skipping the classics in 2020, but will miss the races after contracting COVID-19. Although it is said that Sagan is recovering well, the start of his season has been pushed back. That puts </span><b>Nils Politt</b><span style=\"font-weight: 400;\"> in pole-position to lead BORA-hansgrohe. He has already displayed strong legs this season, claiming third place at <span>Étoile de Bessèges</span> earlier in February.</span></p>\n<p><span style=\"font-weight: 400;\"><strong>Mathieu van der Poel</strong> had chosen to race the UAE Tour where he would miss the chance to ride Omloop or KBK. However, a positive Covid-19 test forced the entire Alpecin-Fenix team to leave early. Although he will not be riding Omloop, Van der Poel will be present at Kuurne-Brussels-Kuurne. He only rode one stage in the UAE and was victorious, it would come as little surprise if he makes it two in a row here.</span></p>\n<p><span style=\"font-weight: 400;\">Team DSM bring an intriguing team to Belgium, they will be led by <strong>Søren Kragh Andersen</strong></span><span style=\"font-weight: 400;\"><strong> </strong>and </span><b>Tiesj Benoot</b><span style=\"font-weight: 400;\">. Neither rider possesses a rapid sprint finish, their best chance lies in long-range attack. However, Team DSM do have a quick finisher in the form of </span><b>Nils Eekhoff</b><span style=\"font-weight: 400;\">. The 23-year-old won the 2019 U23 World Championships in Yorkshire but was denied the rainbow bands after he'd drafted behind a team car earlier in the day, leading to his controversial disqualification. He could be a dark horse.</span></p>\n<p><b><span>Stefan Küng</span> </b><span style=\"font-weight: 400;\">has successfully transitioned from a pure time-trialist into a very capable classics man, too. He finished in the top-five at Gent-Wevelgem and on the podium at the Binckbank Tour last season. In grim weather conditions at the Yorkshire 2019 World Championships, he claimed the bronze medal, proving that adverse weather conditions cause him no issues.</span></p>\n<p><span style=\"font-weight: 400;\">Should Kuurne-Brussels-Kuurne come down to a mass-sprint, there is one name to look out for <span>—</span> </span><b>Arnaud D<span>é</span>mare</b>. The French Champion claimed 12 sprint victories in 2019, including four Giro d'Italia stages. He didn't start this season in the same formidable form, though, failing to win a stage at the Tour de la Provence. In spite of that, Démare will be the irrefutable favourite if he is in the front group entering the final kilometres. </p>\n<p>Other strong sprinters set to race KBK include<b> Alex Kristoff</b><span style=\"font-weight: 400;\"> — who loves bleak weather conditions — </span><b>Tim Merlier, Sonny Colbrelli, John Degenkolb </b>and<b> Bryan Coquard. </b></p>\n<h4><b>Prediction</b></h4>\n<p><span style=\"font-weight: 400;\">Deceuninck-Quick-Step have found the winning formula at Kuurne-Brussels-Kuurne in recent times, and we don’t expect that to change this year. After his win at Driedaagse Brugge-De Panne last season, </span><b>Yves Lampaert</b><span style=\"font-weight: 400;\"> will make it three times in a row for Deceuninck. Look out for <strong>Nils Eekhoff</strong>, though, he could spring a surprise.</span></p>\n<p><i><span style=\"font-weight: 400;\">(Cover image: </span></i><i><span style=\"font-weight: 400;\">Russell Ellis / SWpix</span></i><i><span style=\"font-weight: 400;\">)</span></i></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"5932dc73a08a4a5e5b2877c6513d481e79a479903bdfb5c6b463aeb425b9ef12","category":"Cycling"}