{"title":"Climate regulates the effect of land‐use change on the diversity of soil microbial functional groups and soil multifunctionality","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14722?af=R","date":1720606720000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3b2c1c1a-db40-4390-9882-f8c9879c8304/jpe14722-toc-0001-m.png\" alt=\"Climate regulates the effect of land-use change on the diversity of soil microbial functional groups and soil multifunctionality\" />\n<p>Taken together, our findings highlight the important effects of land-use change, climate and their interactions on microbial diversity and multifunctionality and suggest that effective land-use management and climate change mitigation strategies should be adopted to protect biodiversity and ecosystem function in the Yangtze River Basin.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAlthough studies have explored how soil microbial diversity and soil multifunctionality respond to land-use change at local scales, they have rarely been explored at larger scales and across different climatic and soil environmental conditions.\n\nBy sampling 40 paired sites of land-use change from natural forests to agricultural lands (including croplands and orchards) along the middle and lower Yangtze River, combined with a global meta-analysis, we investigated the effects of land-use change and climate on the alpha and beta diversity of soil bacterial and fungal functional groups (FGs) and their associated soil multifunctionality at a regional scale.\n\nOur results showed that land-use change strongly changed the diversity of soil bacterial and fungal FGs and decreased multifunctionality, which was supported by our meta-analysis at a global scale. Direct effects of land-use change and climate and their interaction, together with changes in soil environmental variables, were the main determinants of the land-use change-induced changes in the diversity of soil bacterial or fungal FGs. The land-use change-induced decrease in multifunctionality was mainly associated with the direct effect of forest conversion, soil fertility and diversity of fungal FGs. Furthermore, climate also regulated the effects of land-use change on multifunctionality by affecting soil fertility and fungal FGs diversity along the Yangtze River.\n\n<i>Synthesis and applications</i>. Taken together, our findings highlight the important effects of land-use change, climate and their interactions on microbial diversity and multifunctionality and suggest that effective land-use management and climate change mitigation strategies should be adopted to protect biodiversity and ecosystem function in the Yangtze River Basin.\n</p>","author":"Xuan Zhou, \nJinshan Cai, \nJingwen Xu, \nShengen Liu, \nBing Wang, \nHuiling Zhang, \nLinyan Yue, \nLiji Wu, \nYing Wu, \nDima Chen","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"5934c2bca15cb83e07866260cdb8b05283ebfbe4903989439a1976d25cd14c95","category":"Environment"}