{"title":"Elon Musk's SpaceX to Launch Satellites for Apple's Emergency SOS Feature on iPhones","link":"https://www.macrumors.com/2023/09/01/spacex-emergency-sos-iphone-satellites/","date":1693601887000,"content":"Apple satellite partner Globalstar is paying Elon Musk's SpaceX to launch new satellites that will be used to update the communication network for the Emergency SOS via Satellite <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> feature, reports <em><a href=\"https://www.nola.com/news/business/globalstar-hires-spacex-to-launch-satellites/article_e00a5ebe-482e-11ee-9b68-8f4354d91d75.html\">Nola</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/11/Emergency-SOS-Satellite-YouTube.jpeg\" alt width=\"1280\" height=\"720\" />\r<br />\nGlobalstar will pay SpaceX $64 million according to the details of the arrangement, which were disclosed in an SEC filing. Payments will be made from 2023 to 2025, which is when SpaceX plans to launch the satellites.\r<br />\n\r<br />\nApple introduced Emergency SOS via Satellite last year alongside the new <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> models. The technology allows the ‌iPhone 14‌, ‌iPhone 14‌ Plus, <a href=\"https://www.macrumors.com/roundup/iphone-14-pro/\">iPhone 14 Pro</a>, and ‌iPhone 14 Pro‌ Max to contact emergency services when no WiFi or cellular connection is available.\r<br />\n\r<br />\nGlobalstar is Apple's partner for the initiative, handling the satellites that allow the feature to function. Apple at launch said that Emergency SOS via Satellite would be free for two years, and so far has not provided insight into what it might eventually cost.\r<br />\n\r<br />\nThe $64 million that Globalstar is paying SpaceX is likely just a fraction of the cost of running the satellites, and that cost is being passed along to Apple, so it stands to reason that Apple will eventually be charging at least a small fee for those who want to use the SOS option.\r<br />\n\r<br />\nGlobalstar has agreed to allocate 85 percent of its current and future network capacity to Apple's iPhones, with Globalstar providing and maintaining all personnel, software, satellite systems, and more, while also maintaining minimum quality and coverage standards. Prior to when the ‌iPhone 14‌ models launched, Globalstar bought $327 million worth of satellite equipment from a Canadian company, with Apple loaning Globalstar $252 million.\r<br />\n\r<br />\nEmergency SOS via Satellite <a href=\"https://support.apple.com/en-us/HT213426\">is available in</a> the United States, Canada, France, Germany, Ireland, the UK, Austria, Belgium, Italy, Luxembourg, the Netherlands, Australia, New Zealand, and Portugal.<div>Tag: <a href=\"https://www.macrumors.com/guide/emergency-sos-via-satellite/\">Emergency SOS via Satellite</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/01/spacex-emergency-sos-iphone-satellites/\">Elon Musk's SpaceX to Launch Satellites for Apple's Emergency SOS Feature on iPhones</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/elon-musks-spacex-to-launch-satellites-for-apples-emergency-sos-feature-on-iphones.2400252/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"59383851cbce006a1b3a90fcca3f894d05f8c8fe37206cb6cb2af936a4505471","category":"Apple"}