{"title":"iOS 17 Reminders App Can Automatically Sort Your Groceries Into Categories","link":"https://www.macrumors.com/2023/06/07/ios-17-reminders-grocery-sorting/","date":1686170865000,"content":"When creating a list in the Reminders app in <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, you can select a \"Groceries\" list option that will cause your <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> to automatically organize every food item added into categories for easier shopping.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/ios-17-reminders-app.jpg\" alt width=\"5459\" height=\"3071\" />\r<br />\nGrocery items like produce, milk, and breads are automatically organized under different headers as you add them to your shopping list. Fruits and vegetables, for example, get organized under \"Produce,\" while oatmeal and cereal go under \"Breads &amp; Cereals.\"\r<br />\n\r<br />\nCategories include Produce, Breads &amp; Cereals, Frozen Foods, Snacks &amp; Candy, Meat, Dairy, Eggs &amp; Cheese, Bakery, Baking Items, Household Items, Personal Care &amp; Health, and Wine, Beer &amp; Spirits.\r<br />\n\r<br />\nCategories are customizable and you can add your own sections, or rearrange the order that sections are shown in the list.\r<br />\n\r<br />\nIf the ‌iPhone‌ doesn't recognize where an item should go, it remains uncategorized. It does recognize specific brands and types of food like \"Sour Patch Kids,\" but some items like tofu are questionably categorized (Dairy, Eggs &amp; Cheese).\r<br />\n\r<br />\nWhile sections are turned on by default for the Grocery list option, any Reminder list that you create in ‌iOS 17‌ can have sections added to it. You'll need to manually add sections and organize items into them, but the option exists for better list management.\r<br />\n\r<br />\nThere is a new column view that lets you see the sections you've created side-by-side, and this is in addition to the standard list view.\r<br />\n\r<br />\nWith interactive widgets in ‌iOS 17‌, a reminder can be checked off directly from a widget without having to open the app, which is a convenient change. Other new additions include options to receive early reminders up to six months before a reminder becomes due, and tools for creating reminders from suggestions.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/07/ios-17-reminders-grocery-sorting/\">iOS 17 Reminders App Can Automatically Sort Your Groceries Into Categories</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-reminders-app-can-automatically-sort-your-groceries-into-categories.2392127/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"593e71f3d8d4f13104e500b108f0b32786278ea923a37d26fe1bd43fb390c77c","category":"Apple"}