{"title":"From toy to tool: DALL-E 3 is a wake-up call for visual artists—and the rest of us","link":"https://arstechnica.com/?p=1972468","date":1700137203000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/dalle3_composite_hero_5-800x450.jpg\" alt=\"An composite of three DALL-E 3 AI art generations: an oil painting of Hercules fighting a shark, an photo of the queen of the universe, and a marketing photo of &quot;Marshmallow Menace&quot; cereal.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/dalle3_composite_hero_5.jpg\">Enlarge</a> <span>/</span> A composite of three DALL-E 3 AI art generations: an oil painting of Hercules fighting a shark, a photo of the queen of the universe, and a marketing photo of \"Marshmallow Menace\" cereal. (credit: DALL-E 3 / Benj Edwards)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In October, OpenAI launched its newest AI image generator—DALL-E 3—<a href=\"https://openai.com/blog/dall-e-3-is-now-available-in-chatgpt-plus-and-enterprise\">into wide release</a> for ChatGPT subscribers. DALL-E can pull off media generation tasks that would have seemed absurd just two years ago—and although it can inspire delight with its unexpectedly detailed creations, it also brings trepidation for some. Science fiction forecast tech like this long ago, but seeing machines upend the creative order feels different when it's actually happening before our eyes.</p>\n\n<p>\"It’s impossible to dismiss the power of AI when it comes to image generation,\" says <a href=\"https://arstechnica.com/author/aurich-lawson/\">Aurich Lawson</a>, Ars Technica's creative director. \"With the rapid increase in visual acuity and ability to get a usable result, there’s no question it’s beyond being a gimmick or toy and is a legit tool.\"</p>\n<p>With the advent of AI image synthesis, it's looking increasingly like the future of media creation for many will come through the aid of creative machines that can replicate any artistic style, format, or medium. Media reality is becoming completely fluid and malleable. But how is AI image synthesis getting more capable so rapidly—and what might that mean for artists ahead?</p></div><p><a href=\"https://arstechnica.com/?p=1972468#p3\">Read 43 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1972468&amp;comments=1\">Comments</a></p>","author":"Benj Edwards","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"59486583b822a0bfa86ac06c163e39a77900ead4f7ff8c762b91e7185bcc79d5","category":"Tech"}