{"title":"COVID-19 vaccine acceptance and associated factors among pregnant and lactating women attending maternity care clinics in refugee camps in Jordan","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305314","date":1718114400000,"content":"<p>by Alaa Dalky, Tamara Osama Quran, Sawsan Abuhammad, Haneen Mahyoub Al-Faraj, Salam Bani Hani, Mohammed ALBashtawy, Imad Rasheed Abu Khader, Mohammed Jallad, Basma Salameh</p>\r\nBackground <p>Despite the advantages of vaccination in preventing maternal and fetal problems, there were many concerns in the medical community regarding vaccine safety for pregnant women, and this has put obstetricians in a challenging situation when it comes to advising their pregnant patients on whether to obtain the vaccine</p> Aim <p>This study was performed to define the level of acceptance of COVID-19 vaccination and assess the impact of COVID-19 attitudes and knowledge on vaccine acceptance between pregnant and lactating Syrian women who are seeking prenatal care services at the clinics in Azraq refugee camp in Jordan.</p> Method <p>A quantitative, cross-sectional study utilizing a non-probability convenience sample. A validated and reliable self-administered questionnaire consisting of four sections was used.</p> Results <p>A total of 412 pregnant/lactating women was recruited The acceptance rate of the COVID-19 vaccine among participants was 86.5%. There was a significant positive moderate association between respondents’ attitudes and knowledge around the COVID-19 vaccine and their acceptance of the vaccine (r = .468, p &lt; .001, r = .357, p &lt; .001), respectively.</p> Conclusion <p>To effectively mitigate the COVID-19 pandemic and achieve collective protection, decision-makers must intensify the efforts in promoting the importance of maternal vaccination, especially in vulnerable communities that suffer the most from pandemic outcomes.</p>","author":"Alaa Dalky","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"594b532c5ccb7c87524bd9f1f18041af1f91b6be3bf59343a33888792578d000","category":"Interdisciplinary"}