{"title":"Sustainable Extraction and Recovery of Copper from PCBs Using Aqua Regia and Its Constituents","link":"https://www.preprints.org/manuscript/202408.0751/v1","date":1723458800000,"content":"The growing use of electronic devices in modern society has sparked concerns about managing e-waste on a global level. Coupled with ever-increasing copper demand, it poses both challenges and potential opportunities for sustainable resource management. The study reinspects the established process of recycling copper with aqua regia from waste PCB &amp; also optimizes the extraction procedure of different aqua regia samples. This research also analyzes the impacts of temperature leaching duration and stirring speed. The results reveal that using a stirring speed of 500 rpm and a leaching time of one hour, the results show that a 1:3 ratio of HNO₃ to HCl in aqua regia produces the best copper extraction efficiency, reaching 72.2% at 180°C. Reduced extraction efficiencies were observed when compared with separate HCl and HNO₃ applications, essentially highlighting the joint effects of utilizing both acids encompassed in the aqua regia solution. Variations suggested by discrepancies found in the temperature range of 140°C to 150°C and overlapping error margins in data on extraction time call for further research. The study also raises concerns about the potential environmental impacts of traditional copper mining and refining processes &amp; attempts to mitigate these effects by recycling copper more efficiently using optimum aqua regia solution. Aqua regia can be the economic &amp; sustainable solution in countries where copper and other valuable metal recovery is rare due to the expensive and complex nature of existing technologies. Developing safer and more sustainable extraction technologies, optimizing process conditions, &amp; researching the selective recovery of other important metals from WPCB should be emphasized in future studies. Addressing these problems will be critical for developing the practical applicability of copper extraction from electronic waste","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"59506f686a1406a94f9ac7033fe5e60f5ceecda836cc3cfc1c7433b0ae501817","category":"Interdisciplinary"}