{"title":"Political Bias in AI-Language Models: A Comparative Analysis of ChatGPT-4, Perplexity, Google Gemini, and Claude","link":"https://www.preprints.org/manuscript/202407.1274/v1","date":1721100350000,"content":"Artificial intelligence (AI) driven language models have seen a rapid rise in development, deployment, and adoption over the last few years. This surge has sparked many discussions about their societal and political impact, including political bias. Bias is a crucial topic in the context of large models due to its far-reaching consequences on technology, politics, and society. It significantly influences public perception, decision-making, political discourse, and AI policy governance and ethics. This study investigates political bias through a comparative analysis of four prominent AI models: ChatGPT-4, Perplexity, Google Gemini, and Claude.Through a comprehensive analysis by systematically and categorically evaluating their responses to politically and ideologically charged tests and prompts, utilizing the Pew Research Center’s Political Typology Quiz, the Political Compass assessment, and ISideWith political party quiz, this study identifies significant ideological leanings and the nature of political bias within these models. The findings revealed that ChatGPT-4 and Claude exhibit a liberal bias, Perplexity is more conservative, while Google Gemini adopts more centrist stances. The presence of such biases underscores the critical need for transparency in AI development and the incorporation of diverse training datasets, regular audits, and user education to mitigate these biases. This analysis also advocates for more robust practices and comprehensive frameworks to assess and reduce political bias in AI, ensuring these technologies contribute positively to society and support informed, balanced, and inclusive public discourse, which will point towards neutrality.The results of this study add to the ongoing discourse about the ethical implications and development of AI models, highlighting the critical need to build trust and integrity in AI models. Additionally, future research directions have been outlined to explore and address the complex issue of bias in AI.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"59554a810a39d154364e17f9280f6dfec486c02ccef1b0f27f741b9d2c10e988","category":"Interdisciplinary"}