{"title":"From oligotrophy to dystrophy: the ontogeny of a humic lake in an extrazonal boreal taiga in Central Europe","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3598?af=R","date":1707392995000,"content":"<h2>ABSTRACT</h2>\n<p>While humic lakes are common in northern Europe, in central Europe they are rare and our understanding of their ontogeny is insufficient. Here, we present the reconstruction of the development of a humic lake in the Tatra Mountains (Slovakia) over the last 8000 years using chironomids along with diatoms, pollen and non-pollen palynomorphs. The compositional changes in aquatic proxies suggest three developmental stages. Since its formation the lake has been oligotrophic (phase 1), and its chemistry was controlled by subsurface waters rich in base cations buffering the effect of acid humic substances from forest and peat that were already present in the catchment. The beginning of the transition to phase 2 (~4400 cal a <span>bp</span>) is marked by simultaneous alterations in all proxies. Climate change combined with the local geochemistry was able to alter the limnological conditions supporting unique chironomid assemblages that have no analogues in recent Carpathian lakes. At <i>~</i>3400 cal a \n<span>bp</span> the lake shifted to a phase when acidophilic/acidotolerant taxa indicate characteristic humic lake conditions (phase 3). Some chironomid taxa appearing <i>~</i>2000 years ago for the first time indicate a dystrophic state in which the lake has remained until now. Human activities have been detected in the area since the Aeneolithic but had no direct influence on the lake.</p>","author":"Peter Bitušík, \nTímea Chamutiová, \nMarina Vidhya, \nŠárka Horáčková, \nRadovan Pipík, \nDušan Starek, \nRastislav Milovský, \nLucia Žatková, \nLadislav Hamerlík","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"5956044db364c0f2e9a486f1e2bdd53a3b70dfc4724f938a28148285fa5d9eba","category":"Environment"}