{"title":"Ewan responds to critics after early departure from Giro","link":"https://cyclingtips.com/2021/05/ewan-responds-to-critics-after-early-departure-from-giro/","date":1621287186000,"content":"<p>Amid criticism from none other than cycling legend Eddy Merckx, Caleb Ewan took to social media on Monday to explain why he pulled out of the Giro d’Italia before the first rest day.</p>\n\n\n\n<p>“To the people who think I’ve disrespected the race, I’m sorry you feel that way,” Ewan said. “If you saw the hard work and dedication I’ve put into my preparation to honor this race and perform at my best I’m sure you wouldn’t think the same. I’m more disappointed than anyone.”</p>\n\n\n\n<p>As he had <a href=\"https://cyclingtips.com/2021/05/step-1-in-caleb-ewans-ambitious-2021-plan-win-a-stage-of-the-giro/\" target=\"_blank\">told CyclingTips ahead of the race</a> that he might do, Ewan abandoned the Giro on Saturday stage 8, a day after picking up his second stage win in the race. At the time, his Lotto Soudal team said that he was experiencing knee pain.</p>\n\n\n\n<p>On Sunday, Merckx expressed disapproval with Ewan’s departure in a column for Het Nieuwsblad.</p>\n\n\n\n<p>“I find his statement a total lack of professionalism and lack of respect for the Giro and the sport of cycling,” Merckx said. “He deserves a sanction: take away all the bonuses. Former Tour boss Félix Lévitan would have said: ‘you won’t be at this race next year.'”</p>\n\n\n\n<p>Eddy Merckx’s son Axel Merckx, who runs the Hagens Berman Axeon team, also weighed in, saying that “to just leave, without any real proof of knee pain, that’s a total lack of respect towards the organization.”</p>\n\n\n\n<p>Ewan is of course not the first sprinter to leave a Grand Tour after the first several sprint stages. Mario Cipollini, who won more Giro stages than any rider in history, finished only six of the 14 Giri he raced. Ewan’s early departure was not a surprise, either, considering his comments ahead of the race suggesting that he might do so. After all, Ewan is aiming to win one stage in all three Grand Tours this year, and knows he must conserve some strength to be competitive in both the upcoming Tour de France and Vuelta a España.</p>\n\n\n\n<p>That said, in his post to social media on Monday, Ewan emphasized that his knee pain was very much an issue as well.</p>\n\n\n\n<p>“I’ve done some stuff with my positioning to help the knee pain I’ve felt since the start of stage 8,” he wrote. “Once it’s completely gone I’ll resume my training to prepare for the Tour. Honestly it’ll be hard to watch the sprint today at the @giroditalia and also on the 13th stage as I felt my form was coming into its best.”</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/ewan-responds-to-critics-after-early-departure-from-giro/\">Ewan responds to critics after early departure from Giro</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"595c3daad9c03580ddf032d69594acfa96ac80268c9d1ee5ca60810aee7cf1c6","category":"Cycling"}