{"title":"Evaluation of Patients Monitored Due to SARS-CoV-2 Infection in Terms of Long-COVID-19 Syndrome","link":"https://www.preprints.org/manuscript/202410.1795/v1","date":1729732562000,"content":"Objectives: Persistent symptoms following acute COVID-19 infection, collectively termed Long COVID syndrome, have been increasingly reported. However, data on the prevalence and characteristics of Long COVID remain limited. This study aimed to evaluate the occurrence and presentation of Long COVID syndrome in individuals in-fected with COVID-19 and monitored in outpatient, ward, or intensive care settings. Methods: Patients diagnosed with COVID-19 and followed up at the Department of In-fectious Diseases and Clinical Microbiology, Çukurova University Faculty of Medicine, for a minimum of four weeks post-infection were included in this study. Demographic data, including age, gender, and comorbidities, were recorded. Patients were followed up for 12 months, with symptom assessment at baseline and 1, 3, 6, and 12 months post-infection. Functional status was evaluated using the Post-COVID-19 Functional Status (PCFS) scale, and quality of life was assessed using the SF-36 Health Survey question-naire. Results: 134 patients (71 males, 54.2%) participated in the study, with a mean age of 43.7±15.3 years (median: 45, range: 18-83). The distribution of patients across care settings was as follows: 51.1% outpatient, 35.9% ward, and 13% intensive care unit (ICU). Fatigue during exertion was the most frequently reported Long COVID symptom across all follow-up timepoints. Patients treated in the ICU experienced a higher burden of Long COVID symptoms compared to those in outpatient or ward settings. Furthermore, the PCFS scale revealed significantly poorer quality of life and functional status in patients treated in the ICU and wards than those receiving outpatient care. Conclusions: Long COVID syndrome poses a significant ongoing health concern, particularly for patients requiring intensive care during acute COVID-19 infection. Our findings underscore the importance of vigilant monitoring for long-term sequelae, particularly concerning quality of life and functional status, in all individuals recovering from SARS-CoV-2 infection.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"595e8a9ee6022441707b65e2dc358f65730f02a1ed3afad0c4a9ebf545876e24","category":"Interdisciplinary"}