{"title":"ผู้ก่อตั้ง Telegram ซัดแรง ใช้ไอโฟนเหมือนเป็น “ทาสดิจิทัล” ของแอปเปิ้ล","link":"https://www.blognone.com/node/122774","date":1621514833000,"content":"<div><div><div><p>Pavel Durov ผู้ก่อตั้งและซีอีโอแอป Telegram แชร์บทความ <a href=\"https://www.blognone.com/node/122728\">The New York Times เรื่องแอปเปิ้ลไม่เข้ารหัสเซิฟเวอร์ในจีน</a> บน <a href=\"https://t.me/s/durov/161\">Telegram Chanel ของเขาเอง</a> พร้อมพิมพ์ข้อความวิจารณ์หลายย่อหน้า</p>\n<p>Durov บอกว่าแอปเปิ้ลเก่งเรื่องขายอุปกรณ์ล้าสมัยที่ราคาแพงเกินเหตุให้กับลูกค้าที่ถูกล็อกอยู่ในระบบ ทุกครั้งที่เขาใช้ไอโฟน หรือแอปบน iOS เขารู้สึกเหมือนกลับไปอยู่ในยุคกลาง หน้าจอก็มีอัตรารีเฟรชแค่ 60Hz เทียบแอนดรอยด์ที่ไป 120Hz แล้วไม่ได้</p>\n<p>เขาระบุว่าส่วนที่แย่ที่สุดไม่ใช่ฮาร์ดแวร์ แต่เป็นเรื่องที่แอปเปิ้ลทำให้ผู้ใช้เหมือนเป็น “ทาสดิจิทัล” ที่ดาวน์โหลดและใช้งานได้แค่แอปที่แอปเปิ้ลยอมให้ใช้บน App Store เท่านั้น จะแบคอัพข้อมูลก็ทำได้แค่บน iCloud และไม่แปลกใจที่ทำไมพรรคคอมมิวนิสต์จีนถึงชอบแนวทางของแอปเปิ้ล</p>\n<p>Telegram เป็นแอปที่ให้ความสำคัญต่อข้อมูลผู้ใช้มาเป็นอันดับต้นๆ ทำให้ผู้ประท้วงต่อต้านรัฐในหลายๆ ประเทศนิยมใช้สื่อสาร รวมถึงการประท้วงในฮ่องกงที่ทำให้<a href=\"https://www.blognone.com/node/110324\">แอปถูกโจมตีแบบ DDoS โดยมีต้นทางจากประเทศจีน</a> นอกจากนี้ Telegram <a href=\"https://www.blognone.com/node/117329\">ยังปฏิเสธคำขอด้านข้อมูลของรัฐบาลฮ่องกง</a> เนื่องจากกังวลด้านความเป็นส่วนตัวในข้อมูลของผู้ใช้</p>\n<p>อย่างไรก็ตามแนวทางการปกป้องข้อมูลนี้ก็ทำให้ Telegram กลายเป็นแอปที่มีการทำผิดกฎหมายบ่อยครั้งโดยมีทั้ง<a href=\"https://www.blognone.com/node/120819\">บอทปล่อยขายข้อมูลหลุดจาก Facebook</a> <a href=\"https://www.blognone.com/node/119176\">บอทสร้างภาพเปลือย</a> <a href=\"https://www.blognone.com/node/120671\">แชนแนลปลุกระดมความรุนแรงในสหรัฐช่วงหลังเลือกตั้ง</a> และล่าสุดก็เป็นอีกหนึ่งแอปที่<a href=\"https://www.blognone.com/node/122766\">กลุ่มชาวอิสราเอลหัวรุนแรงใช้ปลุกระดมการต่อต้านชาวปาเลสไตน์</a> ซึ่ง Telegram คงต้องเร่งแก้ไขปัญหาเหล่านี้ต่อไป</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7f4446072728482d26399dd4c85a31c5.png\" /></p>\n<p>ที่มา - <a href=\"https://t.me/s/durov/161\">Durov’s Telegram Channel</a> via <a href=\"https://androidauth.wpengine.com/telegram-apple-digital-slave-1227646/\">Android Authority</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/telegram\">Telegram</a></div><div><a href=\"/topics/apple\">Apple</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"596d91b26cffeca9473d57e0a67dd65e748b3b66f3769e70d5d4382b02dd2723","category":"Thai"}