{"title":"‘You can steal with your eyes’ - Remco Evenepoel plans for observation and defensive riding at the Vuelta a España","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/you-can-steal-with-your-eyes-remco-evenpoel-s-plans-of-observation-and-defensive-riding-at-la-vuelta-a-espana","date":1692898407000,"content":"\n      <p><span>All talk ahead of this year’s <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> is of Jumbo-Visma’s supremely strong line-up, and with three-time Vuelta winner Primož Roglič and twice <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> winner Jonas Vingegaard in their ranks, it’s easy to see why. Throw in the likes of Sepp Kuss and Wilco Kelderman as super-domestiques and this is a team that looks like it is going to be very difficult to get the beating of. That is, of course, unless you’re defending Vuelta champion and individual time trial world champion, Remco Evenepoel.</span></p>\n<div></div>\n<p><span>Speaking a few days before the race will kick off with a team time trial in Barcelona, the Soudal - Quick-Step rider appeared calm and confident, despite going up against two of the best Grand Tour riders in the peloton over the next three weeks. Evenepoel made his tactics clear: it is not he or his team’s job to make the race in this year’s Vuelta, he will leave that to the nailed-on favourites from the squad in yellow and black. Soudal - Quick-Step are here to watch and learn, letting things play out on the road in front of them with their cards close to their chests.</span></p>\n<p><span>“In the first nine days, we would not like to have the leader's jersey and if by accident, we get it, we would try to give it away as fast and as easily as possible to a rider which shouldn't be the most dangerous one for the final GC,” Evenepoel commented confidently when asked about how his team would handle it if he was to wear the red jersey in the opening week of the race.<img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20220902VUE02005-Unipublic___Sprint_Cycling_Agency_1_1024x1024.jpg?v=1692894777\" /><em><span>Image: ASO/Unipublic/Sprint Cycling Agency</span></em></span></p>\n<p><span>“There's teams where you only see big names and they can take all the pressure and workload on their shoulders,” Evenepoel commented. “For us, we can ride a bit more defensively. I can just discover again how I'm doing longer climbs and higher altitude climbs against the best GC riders of the last few months. With Jonas in the bunch and then  <span>Primož</span>, it’s just comparing my level with their level.”</span></p>\n<p><span>Although already a Grand Tour winner and world champion himself, Evenepoel appeared open to the idea that he still has plenty to learn when it comes to racing over three weeks, suggesting that learning from Vingegaard would be a benefit of racing against the Jumbo-Visma rider at the Vuelta this year. Rather than fearing the stronger start list of the race, the Belgian rider believes he can use it as an asset to his future performances.</span></p>\n<p><span>“You can steal with your eyes. [Vingegaard] knows how to win the Tour de France so he probably also knows how to win this Vuelta. It's a bit of trying to copy as much as possible and take it in my backpack for next year’s Tour and also during the next three weeks and during one week WorldTour races next year,” he said. “It's something exciting. I think it's only a good thing for the sport of cycling, for the Vuelta and for everybody. It's always a big challenge when you see a big name like that at the start line but I’m happy he’s here.”<img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20220910VUE01022-UNIPUBLIC___Charly_Lopez_1024x1024.jpg?v=1692894874\" /><em>Image: ASO/Unipublic/Charly Lopez</em></span></p>\n<p><span>Although Vingegaard,  <span>Roglič</span> and Evenepoel are the stand-out favourites for taking the overall victory at the Vuelta a España this year, the 23-year-old also pointed to the extremely high quality start list of the race, quick to note that there were other riders in contention for the red jersey, too. After his own misfortune at the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> earlier this year when he was forced to leave the race after contracting Covid-19, Evenepoel is also acutely aware of the risks that come in stage races – it is not only strength that will decide the winner, luck plays an important role too.</span></p>\n<p><span>“It's difficult to predict a Grand Tour but for sure, I think it will be a very high level. Everybody's riding on a high level.  <span>Primož</span> just won Burgos. Jonas is Jonas. I became world champion in the time trial so it also means I am in good shape,” Evenepoel said. “The other guys are also doing very well in the last couple of weeks. [Aleksandr] Vlasov is ready. [João] Almeida is always ready. [Juan] Ayuso is exactly the same. G [Geraint Thomas] for sure will also be ready, Team Ineos, they will all be ready so it's going to be a very high level in the bunch. I think with the heat and with the difficult course you can also expect for some guys to fall out of the mix pretty soon.”</span></p>\n<p><span>Evenepoel’s demeanour ahead of the Vuelta is certainly a good sign that the Belgian is taking a mature and measured approach to the race. The hot-headed and sometimes scrappy rider we’ve seen in years gone by seems to be long gone, and Evenepoel is, as he has been for the entire season, presenting as a rider in utter control of how he wants to approach his racing and career. Despite his glittering list of results from the past seasons, Evenepoel still appears to have his feet on the ground, feeling no pressure to try and take on Jumbo-Visma in this year’s Vuelta and with an understanding that he still has time to learn his craft. It could be that this approach is exactly what he needs to come out on top.</span></p>\n<p><span><em>Cover image: ASO/Billy Ceusters</em></span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"596fde569ec708ddea0e9c9e47809c5cf91ad1d1068c7e7e2a5d6c9053820305","category":"Cycling"}