{"title":"Monitoring plastic pollution using bioindicators: a global review and recommendations for marine environments","link":"http://pubs.rsc.org/en/Content/ArticleLanding/2024/VA/D4VA00174E","date":null,"content":"<div><p><img src=\"/services/images/RSCpubs.ePlatform.Service.FreeContent.ImageService.svc/ImageService/image/GA?id=D4VA00174E\" /></p></div><div><i><b>Environ. Sci.: Adv.</b></i>, 2024, Advance Article<br /><b>DOI</b>: 10.1039/D4VA00174E, Critical Review</div><div><img alt=\"Open Access\" src=\"http://sod-a.rsc-cdn.org/pubs.rsc-uat.org/content/NewImages/open_access_blue.png\" /> Open Access</div><div><a href=\"http://creativecommons.org/licenses/by-nc/3.0/\" target=\"_blank\"> <img src=\"http://sod-a.rsc-cdn.org/pubs.rsc-uat.org/content/NewImages/CCBY-NC.png\" alt=\"Creative Commons Licence\" /></a>  This article is licensed under a <a href=\"http://creativecommons.org/licenses/by-nc/3.0/\" target=\"_blank\">Creative Commons Attribution-NonCommercial 3.0 Unported Licence.</a></div><div>Matthew S. Savoca, Neil Angelo Abreo, Andres H. Arias, Laura Baes, Matteo Baini, Elisa Bergami, Susanne Brander, Miquel Canals, C. Anela Choy, Ilaria Corsi, Bavo De Witte, Camila Domit, Sarah Dudas, Emily M. Duncan, Claudia E. Fernández, Maria Cristina Fossi, Ostin Garcés-Ordóñez, Brendan J. Godley, Daniel González-Paredes, Victoria González Carman, Bonnie M. Hamilton, Britta Denise Hardesty, Sang Hee Hong, Shirel Kahane-Rapport, Lauren M. Kashiwabara, Mariana Baptista Lacerda, Guillermo Luna-Jorquera, Clara Manno, Sarah E. Nelms, Cristina Panti, Diego J. Pérez-Venegas, Christopher K. Pham, Jennifer F. Provencher, Sara Purca, Harunur Rashid, Yasmina Rodríguez, Conrad Sparks, ChengJun Sun, Martin Thiel, Catherine Tsangaris, Robson G. Santos<br />Monitoring the movement of plastic into marine food webs is central to understanding and mitigating the plastic pollution crisis.<br />To cite this article before page numbers are assigned, use the DOI form of citation above.<br />The content of this RSS Feed (c) The Royal Society of Chemistry</div>","author":"","siteTitle":"RSC - Environ. Sci.: Adv. latest articles","siteHash":"03ccf36977b4ca3c64769fd408d3ccb21f9db3742fc21631d55a53145dba424f","entryHash":"596f1919c3c70fbb41ac902e2a0d5ecdeca9fce18461a34cbd2edc91db57b7b3","category":"Environment"}