{"title":"Modulating Pain Signaling: The Impact of Tefluthrin, Telmisartan, and KB-R7943 on Voltage-Gated Na+ Currents","link":"https://www.preprints.org/manuscript/202409.0011/v1","date":1725259494000,"content":"Tefluthrin (Tef) is categorized as a type-I pyrethroid insecticide, telmisartan (Tel) functions as an angiotensin II receptor blocker, and KB-R7943 was identified as an inhibitor of Na+-Ca2+ exchange process. However, the influence of these compounds on the amplitude and gating properties of voltage-gated Na+ current (INa) in neurons associated with pain signaling remains unclear. In cultured dorsal root ganglion (DRG) neurons, whole-cell current recordings revealed that Tef or Tel increased the peak amplitude of INa, concomitant with an elevation in the time constant of INa inactivation, particularly in the slow component. Conversely, exposure to KB-R7943 resulted in a depression in INa, coupled with a decrease in the slow component of the inactivation time constant of INa. Theoretical simulations and bifurcation analyses were performed on a modeled interneuron in the spinal dorsal horn. The occurrence of INa inactivation accentuated the subthreshold oscillations (SO) in the membrane potential. With an increase in applied current, SO became more pronounced, accompanied by the emergence of high-frequency spiking (HF) with a frequency of approximately 150 Hz. Moreover, an elevation in INa conductance further intensified both SO and HF. Consequently, through experimental and in silico studies, this work reflects that Tef, Tel, or KB-R7943 significantly impacts the magnitude and gating properties of INa in neurons associated with pain signaling. The alterations in INa magnitude and gating in these neurons suggest a close relationship with pain transmission.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5975769da90c30fdf7066cd28ba180579247e844ece8621070242e9faae01401","category":"Interdisciplinary"}