{"title":"Perinatal mortality in German dairy cattle: Unveiling the importance of cow-level risk factors and their interactions using a multifaceted modelling approach","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302004","date":1713362400000,"content":"<p>by Yury Zablotski, Katja Voigt, Martina Hoedemaker, Kerstin E. Müller, Laura Kellermann, Heidi Arndt, Maria Volkmann, Linda Dachrodt, Annegret Stock</p>\r\n\r\nPerinatal mortality (PM) is a common issue on dairy farms, leading to calf losses and increased farming costs. The current knowledge about PM in dairy cattle is, however, limited and previous studies lack comparability. The topic has also primarily been studied in Holstein-Friesian cows and closely related breeds, while other dairy breeds have been largely ignored. Different data collection techniques, definitions of PM, studied variables and statistical approaches further limit the comparability and interpretation of previous studies. This article aims to investigate the factors contributing to PM in two underexplored breeds, Simmental (SIM) and Brown Swiss (BS), while comparing them to German Holstein on German farms, and to employ various modelling techniques to enhance comparability to other studies, and to determine if different statistical methods yield consistent results. A total of 133,942 calving records from 131,657 cows on 721 German farms were analyzed. Amongst these, the proportion of PM (defined as stillbirth or death up to 48 hours of age) was 6.1%. Univariable and multivariable mixed-effects logistic regressions, random forest and multimodel inference via brute-force model selection approaches were used to evaluate risk factors on the individual animal level. Although the balanced random forest did not incorporate the random effect, it yielded results similar to those of the mixed-effect model. The brute-force approach surpassed the widely adopted backwards variable selection method and represented a combination of strengths: it accounted for the random effect similar to mixed-effects regression and generated a variable importance plot similar to random forest. The difficulty of calving, breed and parity of the cow were found to be the most important factors, followed by farm size and season. Additionally, four significant interactions amongst predictors were identified: breed—calving ease, breed—season, parity—season and calving ease—farm size. The combination of factors, such as secondiparous SIM breed on small farms and experiencing easy calving in summer, showed the lowest probability of PM. Conversely, primiparous GH cows on large farms with difficult calving in winter exhibited the highest probability of PM. In order to reduce PM, appropriate management of dystocia, optimal heifer management and a wider use of SIM in dairy production are possible ways forward. It is also important that future studies are conducted to identify farm-specific contributors to higher PM on large farms.","author":"Yury Zablotski","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"59767b8b1e6997ba416084f7e1328a6f650a4b240b1f135c3e4962ea28edeaed","category":"Interdisciplinary"}