{"title":"The anti‐hyperplasia effect of polysaccharide from Prunella vulgaris L. on mammary gland hyperplasia in rats through regulation of the AKT‐FOXO3a signaling pathway and intestinal flora","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13652?af=R","date":1718351117000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p><i>Prunella vulgaris</i> L., a medicinal and edible homologous plant, is often used to treat conditions such as breast hyperplasia, thyroid enlargement and lymphatic tuberculosis. Research has demonstrated that it is particularly effective in the treatment of mammary gland hyperplasia (MGH). However, the material basis and mechanism of its efficacy are still unclear.</p>\n<h2>RESULTS</h2>\n<p>Our results showed that in rats with MGH, polysaccharide from <i>Prunella vulgaris</i> L. (PVP) led to a reduction in the levels of estradiol, prolactin and malondialdehyde, while simultaneously increasing the concentrations of progesterone (P), superoxide dismutase (SOD), manganese superoxide dismutase (MnSOD) and catalase (CAT) in the serum. In addition, results obtained from 16S rRNA sequencing demonstrated that PVP had the capacity to increase the richness and diversity of the intestinal microbiota in MGH rats, as well as modify the structure of the microbiota. Correlation analysis revealed that the levels of P, SOD, MnSOD and CAT were positively associated with <i>Allobaculum</i>, <i>Romboutsia</i>, <i>Faecalibaculum</i> and <i>Clostridium</i>, while negatively correlated with <i>Turicibacter</i>.</p>\n<h2>CONCLUSIONS</h2>\n<p>The mechanism of PVP in treating MGH might be through inhibiting the phosphorylation of the AKT-FOXO3a signaling pathway and then activating the expression of downstream antioxidant enzymes, such as MnSOD and CAT. At the same time, PVP could restore intestinal flora homeostasis in rats with MGH by regulating the flora changes of <i>Allobaculum</i>, <i>Romboutsia</i>, <i>Clostridium</i> and <i>Faecalibaculum</i>, thereby reducing oxidative stress in rats with MGH. © 2024 Society of Chemical Industry.</p>","author":"Hong Zhao, \nYongyi Yang, \nYingming Zhou, \nHan Wen, \nChen Chen, \nChangxu Li, \nYao Feng, \nLili Li, \nXiaoliang Li","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"5978f1170605b216c2e5e9eaaf6933ea3310bb28f6cfd07445db3ccca6847966","category":"Environment"}