{"title":"Grazing Effects of Xenocypris davidi Bleeker (Cyprinidae, Cypriniformes) on Filamentous Algae and the Consequent Effects on Intestinal Microbiota","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/1985865?af=R","date":1685170800000,"content":"<p>Filamentous algae are present in seawater and freshwater ecosystems worldwide. Their growth poses a serious threat to water environments and fishery production, especially Chinese mitten crab and red swamp crayfish culturing. To explore safe and ecological treatment methods, we comparatively studied the grazing effects of <i>Xenocypris davidi</i> Bleeker on <i>Cladophora</i> (one species) and <i>Spirogyra</i> (two species) in indoor glass tanks and examined the intestinal microbiota related to digestion and absorption. The results showed that the fish was more receptive to <i>Spirogyra</i> than to <i>Cladophora</i>, and the intake rates of different species of <i>Spirogyra</i> varied. Fish weight increased slightly after feeding with <i>Spirogyra</i>, and the levels of total nitrogen and total phosphorus in water increased significantly (<i>p</i> &lt; 0.05) relative to the initial values. Intestinal microbiota diversity and richness varied after feeding with three filamentous algal species, and the similarity increased after feeding with two <i>Spirogyra</i> species. The microbial species detected in this study belonged to 40 phyla and 838 genera. The clustering characteristics of different groups and subgroups were obvious based on the microbial phylum composition. Significant differences in the relative abundance rates of eight nutrition-related metabolism functions were found among groups and subgroups (<i>p</i> &lt; 0.05). The correlations between intestinal microbiota and metabolism functions were analyzed, and some meaningful correlations were revealed. The results presented in this study provided a meaningful reference on the control of the overgrowth of filamentous algae in aquaculture waters by the biomanipulation method.</p>","author":"Yongtao Tang, \nChen Wang, \nHanjun Jiang, \nLiangjie Zhao, \nChen Qian, \nXusheng Guo, \nYunfei Sun, \nBoping Tang, \nFujun Xuan, \nYongxu Cheng, \nMahmoud Dawood","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"5979ddfe8f44a398c66c69e4ede5def7d88fae944adf10401d98c65873245709","category":"Environment"}