{"title":"Forget multiple cameras—Sharp phone has one giant 1-inch camera sensor","link":"https://arstechnica.com/?p=1765409","date":1621269960000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/44.jpg\" /></div>\n        <p>\n          On the back, you get a single giant camera, a time-of-flight sensor, and an LED flash. That's it.                      [credit:\n                        Sharp                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Is filling the back of a smartphone with several small camera lenses really the best camera solution? Sharp is bucking the multi-camera trend with the <a href=\"https://jp.sharp/k-tai/aquos-r6/\">Aquos R6</a>, a phone with—get this—a single massive camera on the back. Sharp is skipping all the wide-angle zoom lenses out there and going with a giant 1-inch camera sensor instead. This is either the single biggest smartphone camera sensor ever or it's tied for the largest ever, depending on how you categorize 2014's <a href=\"https://www.cnet.com/reviews/panasonic-lumix-cm1-review/\">Panasonic Lumix CM1</a>, which isn't so much a \"phone\" as it is a point-and-shoot camera that runs Android and can make phone calls.</p>\n<p>Sharp is not talking about its camera sensor supplier, but there's a good chance the part is from fellow Japanese company Sony, which has had a 1-inch \"IMX800\" sensor circulating around the rumor mill for some time. Sony is the leading smartphone camera sensor manufacturer, so don't be surprised to see <a href=\"https://www.androidpolice.com/2021/03/12/huawei-p50-leak-shows-the-same-massive-camera-bump-as-its-pro-bro/\">a few more</a> 1-inch sensor phones this year. The rest of the specs look pretty good, too. The phone comes with Android 11, a Snapdragon 888 SoC, 12GB of RAM, 128GB of storage, a 5000 mAh battery, a microSD slot, a headphone jack, and a USB-C port.</p>\n<p>The display is a Sharp-made OLED with a whopping 240 Hz refresh rate. Sharp has made 240 Hz displays before, but it says this one is the \"world's first\" display to have a dynamic refresh rate that goes from 1 Hz to 240 Hz, depending on the content.</p></div><p><a href=\"https://arstechnica.com/?p=1765409#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1765409&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"597ae4195b81ff1c23c474dcb87e1585b094a64b6a0fdf8244acf2d17b9b967f","category":"Tech"}