{"title":"Forest composition shapes seed‐rodent interactions in a gradient of broadleaves and conifers","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2664.14711?af=R","date":1723007870000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b8050425-abbd-4b8c-8889-5beb1abde846/jpe14711-toc-0001-m.png\" alt=\"Forest composition shapes seed-rodent interactions in a gradient of broadleaves and conifers\" />\n<p>This work provides evidence of how forest composition can affect plant–animal interactions without necessarily altering animal communities or population densities. Specifically, we found no differences between forests with native and non-native conifer trees regarding small mammal community, seed-rodent interactions or seed fate. Furthermore, rodents may provide a service in mixed forests by primarily preying upon seeds of Fagus sylvatica, a superior-competitive species, and thus mitigate beech dominance over conifer species.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nNon-native tree species and mixed forests have been increasingly employed in forestry practice as a safeguard against climate change and as a tool to foster biodiversity while providing economic benefits. Though these changes in forest composition may affect animal communities and ecosystem processes, they are seldom studied through a plant–animal interaction perspective.\n\nHere we investigated how forests with varying proportions of a native broadleaf (<i>Fagus sylvatica</i>) and two conifers (introduced <i>Pseudotsuga menziesii</i> and native <i>Picea abies</i>) affect rodents and their interactions with seeds. We surveyed terrestrial small mammal communities, estimated species' densities, assessed seed preference by rodents, collected data on environmental variables (understory density and tree basal area), measured <i>Fagus sylvatica</i> seed production and tracked 1200 seeds of <i>Fagus sylvatica</i> in 20 different forest plots in northern Germany in a mast and non-mast year for <i>Fagus sylvatica</i>.\n\nForest composition influenced the interactions between rodents and seeds. In forests with a lower proportion of broadleaves, beech seeds were harvested faster and in greater quantities, had diminished survival and were less often cached. These results are in agreement with three other findings: (a) seed fate responded to the proportion of broadleaves and conifers irrespective of conifer tree identity, (b) rodents preferred nutritious beech seeds over small conifer seeds, and (c) higher proportions of seeds were harvested during the period when beech seeds were scarce (non-mast year).\n\n<i>Synthesis and applications</i>: This work provides evidence of how forest composition can affect plant–animal interactions without necessarily altering animal communities or population densities. Specifically, we found no differences between forests with native and non-native conifer trees regarding small mammal community, seed-rodent interactions or seed fate. Furthermore, rodents may provide a service in mixed forests by primarily preying upon seeds of <i>Fagus sylvatica</i>, a superior-competitive species, and thus mitigate beech dominance over conifer species.\n</p>","author":"Pedro Mittelman, \nScott M. Appleby, \nNiko Balkenhol","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"59809270e8f4c772bb89078c79822c37ed16d9819b0f546b0765a836572abec1","category":"Environment"}