{"title":"Predictors of delayed initiation of breast milk and exclusive breastfeeding in Ethiopia: A multi-level mixed-effect analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301042","date":1712152800000,"content":"<p>by Gossa Fetene Abebe, Menen Tilahun, Hana Tadesse, Abdu Seid, Tariku Yigremachew, Anteneh Messele Birhanu, Desalegn Girma</p>\r\nBackground <p>Despite the well-established benefits of early initiation of breastfeeding and exclusive breastfeeding for the first six months to promote optimal neonatal and child health, evidence indicates that in Ethiopia, a significant number of newborns initiate breastfeeding late, do not adhere to exclusive breastfeeding (EBF) for the recommended duration, and instead are fed with bottles.</p> Objective <p>To determine the proportion of delayed initiation of breast milk, exclusive breastfeeding, and its individual and community-level predictors among mothers in Ethiopia.</p> Methods <p>A secondary data analysis was done using the 2019 Ethiopian Mini Demographic Health Survey data. We examined a weighted sample of 2,012 children born within the past 24 months and 623 children aged 0–5 months at the time of the survey. The data analysis was done using STATA version 15. To understand the variation in delayed initiation and exclusive breastfeeding, statistical measures such as the Intraclass correlation coefficient, median odds ratio, and proportional change in variance were calculated. We employed a multilevel mixed-effects logistic regression model to identify predictors for each outcome variable. Statistical significance was determined with a p-value &lt; 0.05.</p> Results <p>The proportion of delayed initiation of breast milk and exclusive breastfeeding were 24.56 and 84.5%, respectively. Women aged 34–49 years old (AOR = 0.33: 95% CI; 0.15–0.72), having a television in the house (AOR = 0.74: 95%CI; 0.33–0.97), delivered by cesarean section (AOR = 3.83: 95% CI; 1.57–9.32), and resided in the Afar regional state (AOR = 1.43: 95%CI; 1.03–12.7) were significantly associated with delayed initiation of breast milk. On the other hand, attended primary education (AOR = 0.67: 95%CI; 0.35–0.99), secondary education (AOR = 0.34: 95%CI; 0.19–0.53), women whose household headed by male (AOR = 0.68; 95% CI; 0.34–0.97), and rural residents (AOR = 1.98: 95%CI; 1.09–3.43) were significantly associated with exclusive breastfeeding practice.</p> Conclusion <p>Health promotion efforts that encourage timely initation of breast milk and promote EBF, focused on young mothers, those who gave birth through cesarean section, and those residing in urban and the Afar regional state. Furthermore, government health policymakers and relevant stakeholders should consider these identified predictors when revising existing strategies or formulating new policies.</p>","author":"Gossa Fetene Abebe","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"59827e1ba827cb5d127cfd689dbd380fec96a3b693d70788e3b2cb9d132c7024","category":"Interdisciplinary"}