{"title":"What wireless Rival eTap AXS might mean for SRAM’s mechanical groupsets","link":"https://cyclingtips.com/2021/02/what-wireless-rival-etap-axs-might-mean-for-srams-mechanical-groupsets/","date":1613003005000,"content":"<p>Within the annals of the United States Federal Communications Commission filings we recently discovered that Shimano’s <a href=\"https://cyclingtips.com/2021/02/shimano-gets-wireless-certification-is-dura-ace-r9200-near/\" target=\"_blank\" rel=\"noreferrer noopener\">next generation of Dura-Ace Di2</a> is almost certainly going to be at least semi-wireless. But also hidden inside was an important filing for SRAM, in particular news that the long-awaited third tier of the company’s wireless road groupset — Rival eTap AXS — may finally be coming to fruition.</p>\n\n\n\n<p>Given the generally excellent performance, reliability, and ease-of-installation of both the Red and Force versions of AXS, the idea that all of that might be available at dramatically lower price points is enticing. However, SRAM also has a long history of offering a broad range of mechanical drivetrains as well. So what does a wireless electronic version of Rival mean for that side of things?</p>\n\n\n\n<h2><strong>12-speed for sure</strong></h2>\n\n\n\n<p>It can easily be argued that SRAM does the trickle-down thing better than anyone in terms of carrying the functionality of higher-end offerings to lower price points, and while we don’t have any concrete information on what the upcoming Rival eTap AXS groupset will look like, the consistent history of SRAM’s road hierarchy should provide a reliable roadmap.</p>\n\n\n\n<p>First and foremost, Rival eTap AXS is almost guaranteed to move to the latest 12-speed format, utilizing the same cassette spacing, XDR freehub body, and proprietary chain geometry as Force eTap AXS and Red eTap AXS — and with few exceptions, all of it should be cross-compatible.</p>\n\n\n\n<p>Considering the wide range of user types that are likely to find appeal in the more attainable price point that Rival eTap AXS would offer, it seems likely that it’ll also include a broad selection of gearing options, including 1x and 2x setups, and the <a href=\"https://cyclingtips.com/2020/05/sram-force-wide/\" target=\"_blank\" rel=\"noreferrer noopener\">&#8220;Wide&#8221; variant</a> that was recently added to the Force range.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-2-1340x754.jpg\" alt=\"\" class=\"wp-image-480093\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-2-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-2-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-2-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-2-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-2.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Assuming Rival eTap AXS really comes to fruition, a 12-speed cassette is virtually guaranteed.</figcaption></figure>\n\n\n\n<p>Another virtual guarantee is the inclusion of SRAM&#8217;s Orbit hydraulic pulley clutch for improved chain control, a key element if SRAM plans to offer a 1x variant.</p>\n\n\n\n<p>A longstanding SRAM strategy is sharing a lot of parts across multiple groupset levels to help amortize costs, and that should be in full effect here. I expect every last bit that carries an electron will be wholly carried over (wireless transceivers, motors, batteries, chips, etc.). The lone exception could be that the Rival eTap AXS levers might not have accessory ports for things like remote buttons, but that would hardly be a dealbreaker.</p>\n\n\n\n<p>Otherwise, it should mostly be a matter of different materials and finishes.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-3-1340x754.jpg\" alt=\"\" class=\"wp-image-480095\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-3-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-3-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-3-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-3-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-3.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>My guess is that a Rival eTap AXS rear derailleur would use the &#8220;Max&#8221; format as stock &#8211; and it might not even offer the standard one.</figcaption></figure>\n\n\n\n<p>Whereas Red and Force use a lot of carbon fiber and aluminum, expect to see a lot more aluminum, steel, and plastic in Rival. Based on past Rival iterations, hollow-forged aluminum crankarms seem like a safe bet, along with aluminum derailleur links and pulley cage plates. Rival has at times used bushings instead of ball bearings, too, and some of the adjustability that graces the higher-end groups might be left behind.</p>\n\n\n\n<p>In other words, just as before, Rival eTap AXS should end up being a fair bit heavier than Force and Red, and it might lack some of the niceties of those higher-end groupsets, but by and large, my guess is that you’ll likely have a hard time differentiating between the three with your eyes closed.&nbsp;</p>\n\n\n\n<h2>AXS bodes well for OEM</h2>\n\n\n\n<p>In general, AXS has been an absolute boon for SRAM in terms of OEM spec. Not only does it work well, but it’s perceived by buyers as being on the cutting edge of technology. SRAM has also done an excellent job of staying in front of the curve in terms of offering the gear ratios that consumers want and need, particularly as the drop-bar market continues to rapidly evolve.&nbsp;</p>\n\n\n\n<p>AXS offers a lot of benefits in terms of production, too. Thanks to that fully wireless format, bike assembly is nearly as quick as externally routed mechanical bikes used to be, and not having to account for physical connections opens up possibilities on the design side as well. From a product manager’s standpoint, the ability to mix and match AXS road and mountain bike components is a big plus, especially with the boom in bikepacking and adventure bikes.&nbsp;</p>\n\n\n\n<p>Integrated suspension lockouts? Electronically actuated dropper posts? Smartphone apps that tell you what gears you’re actually using? AXS offers all of that. Mechanical? Not so much.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-4-1340x754.jpg\" alt=\"\" class=\"wp-image-480098\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-4-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-4-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-4-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-4-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-4.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>All of the electronic bits are likely to be carried over wholly intact from other AXS road groupsets.</figcaption></figure>\n\n\n\n<p>The success of AXS has been especially significant given how SRAM’s mechanical road groupsets have struggled to maintain market share during the waning years of their product cycles, and it’s worth pointing out that this success has come at the upper end of the pricing spectrum.&nbsp;</p>\n\n\n\n<p>That still leaves a lot of the market unaddressed as far as electronic drivetrains are concerned, but if SRAM is able to offer Rival eTap AXS at a price that can compete with Shimano’s ubiquitous Ultegra mechanical groupset, we’ll have a real fight on our hands.&nbsp;</p>\n\n\n\n<h2>Function is one thing; weight is another</h2>\n\n\n\n<p>As impressive as AXS is in many ways, it’s less so when it comes to the scale (which is perhaps a little ironic given that the Red 22 rim-brake mechanical groupset was one of the lightest off-the-shelf options for quite some time). As compared to Dura-Ace Di2, Red eTap AXS packs on about 130 g of extra weight, and in fact, it’s not much lighter than Ultegra Di2 (at least in disc-brake form).&nbsp;</p>\n\n\n\n<p>It gets a bit uglier when you look at Force eTap AXS, though, which is not only about 350 g heavier than Red eTap AXS (and, thus, a lot heavier than Ultegra Di2), but also about 130 g heavier than Shimano’s mechanical 105 disc-brake groupset, which is vastly less expensive.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-5-1340x754.jpg\" alt=\"\" class=\"wp-image-480101\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-5-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-5-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-5-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-5-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-5.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Aside from the cage materials and finish, there isn&#8217;t a whole lot of difference between the Red eTap AXS and Force eTap AXS front derailleurs. The Rival eTap AXS front derailleur would likely be very similar as well, albeit everything would be heavier. Photo: Dave Everett.</figcaption></figure>\n\n\n\n<p>Historically, Rival has generally been a couple of hundred grams heavier still than similar Force variants, with much of that gain centered around the use of hollow-forged aluminum crankarms instead of carbon fiber ones. Assuming that trend continues with the wireless electronic variants, that means Rival eTap AXS will almost certainly be … heavy.</p>\n\n\n\n<p>That said, will most people care? I’m not so sure.&nbsp;</p>\n\n\n\n<p>As I’ve already said, it’s hardly a secret that Red eTap AXS and Force eTap AXS weigh more than the competition, but other features still make both highly appealing to an awful lot of people. Wireless is undeniably cool, and the prospect of robotically perfect shifting that requires virtually no maintenance (aside from staying on top of battery charging) will undoubtedly draw a lot of people in — extra grams and all.</p>\n\n\n\n<p>Just like Red eTap AXS and Force eTap AXS have been very popular despite their weight disadvantages, I strongly suspect it’ll be the same with Rival eTap AXS. And mark my words: if SRAM builds it, people will buy it, even if it is heavy (which it certainly will be).</p>\n\n\n\n<h2>Going all-in on wireless</h2>\n\n\n\n<p>That Rival eTap AXS will be a sale success seems beyond doubt. But the far bigger question is what SRAM plans to do with the remnants of its once-bustling mechanical drivetrain business.&nbsp;</p>\n\n\n\n<p>Electronic drivetrains may be all the rage currently, but it’s important to remember that mechanical drivetrains are generally far more affordable, easier to service, and for a given price point, a lot lighter, too — especially the way that SRAM does them. Given all of that, it would seem logical that SRAM would also want to have a range of mechanical options in its catalog to go along with the electronic stuff.</p>\n\n\n\n<p>SRAM was on a roll in the late 2000s and early 2010s. Alberto Contador and Andy Schleck won the Tour de France in 2009 and 2010 on SRAM-equipped bikes, and the company’s mechanical groupsets were seemingly everywhere. However, Shimano has done a much better job than SRAM of keeping its mechanical options fresh since then.</p>\n\n\n\n<p>For example, Dura-Ace R9100 was introduced in 2016, and both Ultegra R8000 and 105 R7000 came in 2018.&nbsp;</p>\n\n\n\n<p>In comparison, the last redesign of SRAM’s flagship Red 22 groupset came in 2013 (just a year after Dura-Ace 9000). Force 22 came out in 2014, and Rival 22 in 2015. Mixed in the middle of all of that was SRAM’s push toward mechanical 1x drivetrains, but even those were based on existing product, and none of it has received much attention since.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-18-1340x754.jpg\" alt=\"\" class=\"wp-image-480131\" width=\"1022\" height=\"575\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-18-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-18-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-18-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-18-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-18.jpg 1920w\" sizes=\"(max-width: 1022px) 100vw, 1022px\" /><figcaption>How old are some of SRAM&#8217;s mechanical road bits? On the one hand, while it&#8217;s refreshing that SRAM still offers a 10-speed variant, this lever body dates back to 2006. However, even the 11-speed stuff (like this rear derailleur) is getting pretty long in the tooth, and SRAM doesn&#8217;t seem too upset about it. Photo: SRAM.</figcaption></figure>\n\n\n\n<p>One could hypothesize that SRAM lacked the necessary R&amp;D funds to stay on top of updating those products. After all, the global recession in the late 2000s smashed the company’s plans for a big IPO-fueled expansion, and there was a disastrous recall in 2013 that hit shortly after the release of the company’s first road disc-brake groupsets that sucked about US$15 million out of the company&#8217;s coffers.&nbsp;</p>\n\n\n\n<p>But then again, development of SRAM’s first-generation Red eTap wireless groupset was occurring behind the scenes throughout, and by all accounts, it was a raging success when it debuted in 2015.</p>\n\n\n\n<p>What if SRAM hadn’t been updating its mechanical groupsets not because it couldn’t afford to, but rather it made the strategic decision to cede the mechanical portion of the market to Shimano?&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-14-1340x754.jpg\" alt=\"\" class=\"wp-image-480125\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-14-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-14-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-14-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-14-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-14.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>One of SRAM&#8217;s last major developments on the mechanical road front was a push toward single-chainring drivetrains. The idea was controversial and different in terms of scope, but the parts used were just adaptations of existing stuff.</figcaption></figure>\n\n\n\n<p>In fairness to SRAM, the bet hasn’t gone wrong — at least at the upper ends of the market where electronic has dominated. In the meantime, Shimano has slowly been wiping the spec sheets clean of SRAM further downstream with its workhorse mechanical groups, and SRAM seems to be making the long-term bet (and safely so, I’d guess) that the lower price Rival eTap AXS will help the company regain some of that from the opposite direction.</p>\n\n\n\n<p>What that unfortunately means for SRAM mechanical groups, though, isn’t exactly encouraging.</p>\n\n\n\n<p>Shimano’s mechanical groups may have <a href=\"https://www.instagram.com/thanksshimano/\" target=\"_blank\" rel=\"noreferrer noopener\">faults of their own</a>, but they’re still absolutely smashing it when it comes to OEM spec. Go ahead and try to find a nicer road bike from a major brand built with a SRAM group that doesn’t have batteries attached to it; you’ll be looking for a while. But then again, while mechanical Ultegra is seemingly everywhere, mechanical Dura-Ace is far more difficult to find. It should also be mentioned that the entire industry is trending toward electronic at the upper end of the price spectrum, with an increasing number of bikes being developed with no provision for mechanical drivetrains whatsoever.&nbsp;</p>\n\n\n\n<p>In other words, as much as a fervent subset of users might still be crossing their fingers that SRAM has a big mechanical release waiting in the wings, it just doesn’t seem to make much business sense.</p>\n\n\n\n<p>That said, the cleverly modular design of SRAM’s mechanical groupsets suggests that it might not take a massive amount of development resources to adapt the current offerings for use with the latest AXS 12-speed electronic drivetrains, so maybe the numbers aren’t as bleak as they might seem. To my untrained eye, all it’d require are new ratchet rings, new rear derailleurs, and updated front derailleur cages; the rest can be borrowed from the existing AXS family.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"910\" src=\"https://cyclingtips.com/wp-content/uploads/2020/12/Ratio-Technology-12-speed-SRAM-retrofit-kit-5-1340x910.jpg\" alt=\"\" class=\"wp-image-352735\" srcset=\"https://cyclingtips.com/wp-content/uploads/2020/12/Ratio-Technology-12-speed-SRAM-retrofit-kit-5-1340x910.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2020/12/Ratio-Technology-12-speed-SRAM-retrofit-kit-5-650x442.jpg 650w, https://cyclingtips.com/wp-content/uploads/2020/12/Ratio-Technology-12-speed-SRAM-retrofit-kit-5-190x129.jpg 190w, https://cyclingtips.com/wp-content/uploads/2020/12/Ratio-Technology-12-speed-SRAM-retrofit-kit-5-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2020/12/Ratio-Technology-12-speed-SRAM-retrofit-kit-5.jpg 1600w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>The modular design of SRAM&#8217;s DoubleTap road levers makes them quite easy to adapt and upgrade. Shown here is an aftermarket 12-speed ratchet from UK outfit Ratio Technology. One would think that it should be pretty easy for SRAM to do something similar itself, although it remains to be seen whether something like that will actually happen. Photo: Ratio Technology.</figcaption></figure>\n\n\n\n<p>Imagine a Red 24 groupset with the expanded range offerings of Red eTap AXS, but the ease of service, low weight, and lower cost of a mechanical setup. Or better yet, a Force 24 groupset that offers the same functionality with a few extra grams and a lot more money left in your pocket. Or perhaps a Rival 24 setup that delivered all of that performance at a price point that mere mortals could afford without taking out a bank loan?&nbsp;</p>\n\n\n\n<p>Wouldn’t that be sweet?</p>\n\n\n\n<p>I’ll count myself as one that still holds some hope for at least one more update to SRAM’s mechanical road groupsets, even if it’s a somewhat modest one, and the optimistic side of me would like to believe that SRAM’s engineers are diligently working in the shadows to get this done. However, the light is fading for my more cynical side, and unfortunately, my cynical side is usually right.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-gallery columns-1 is-cropped wp-block-gallery__slider\"><ul class=\"blocks-gallery-grid\"><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-6-1340x754.jpg\" alt=\"\" data-id=\"480104\" data-full-url=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-6.jpg\" data-link=\"https://cyclingtips.com/sram-rival-etap-axs-implications-6/\" class=\"wp-image-480104\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-6-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-6-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-6-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-6-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-6.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption class=\"blocks-gallery-item__caption\">The SRAM Red eTap AXS rear derailleur uses all sorts of advanced materials to help reduce weight, such as aggressively pared-down aluminum bits and carbon fiber. While the core functional pieces are likely to be shared with Rival eTap AXS, that derailleur would do without all the exotic bits and will certainly be a fair bit heavier.</figcaption></figure></li><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-7-1340x754.jpg\" alt=\"\" data-id=\"480107\" data-full-url=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-7.jpg\" data-link=\"https://cyclingtips.com/sram-rival-etap-axs-implications-7/\" class=\"wp-image-480107\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-7-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-7-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-7-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-7-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-7.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption class=\"blocks-gallery-item__caption\">Don&#8217;t expect to see any carbon fiber on Rival eTap AXS, but the lever shape will almost certainly be shared.</figcaption></figure></li><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-8-1340x754.jpg\" alt=\"\" data-id=\"480110\" data-full-url=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-8.jpg\" data-link=\"https://cyclingtips.com/sram-rival-etap-axs-implications-8/\" class=\"wp-image-480110\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-8-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-8-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-8-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-8-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-8.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption class=\"blocks-gallery-item__caption\">SRAM&#8217;s current generation of the Rival mechanical groupset is one of the best buys out there when it comes to saving weight on a budget (provided you leave the heavy crank behind). But unfortunately, the pending arrival of Rival eTap AXS doesn&#8217;t bode well for SRAM&#8217;s mechanical road groupsets on the whole.</figcaption></figure></li><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-9-1340x754.jpg\" alt=\"\" data-id=\"480113\" data-full-url=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-9.jpg\" data-link=\"https://cyclingtips.com/i-wouldnt-expect-to-see-this-stroke-adjustment-on-a-rival-etap-axs-lever/\" class=\"wp-image-480113\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-9-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-9-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-9-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-9-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-9.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption class=\"blocks-gallery-item__caption\">I wouldn&#8217;t expect to see this stroke adjustment on a Rival eTap AXS lever.</figcaption></figure></li><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-10-1340x754.jpg\" alt=\"\" data-id=\"480116\" data-full-url=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-10.jpg\" data-link=\"https://cyclingtips.com/sram-rival-etap-axs-implications-10/\" class=\"wp-image-480116\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-10-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-10-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-10-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-10-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-10.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption class=\"blocks-gallery-item__caption\">Will the new Rival eTap AXS lever have ports for satellite controls? Leaving those off would provide some motivation for people to move up to a higher-end version.</figcaption></figure></li><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-11-1340x754.jpg\" alt=\"\" data-id=\"480117\" data-full-url=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-11.jpg\" data-link=\"https://cyclingtips.com/sram-rival-etap-axs-implications-11/\" class=\"wp-image-480117\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-11-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-11-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-11-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-11-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-11.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption class=\"blocks-gallery-item__caption\">Whereas Red and Force feature crankarms made of carbon fiber, a new Rival crank would almost certainly be aluminum.</figcaption></figure></li><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-13-1340x754.jpg\" alt=\"\" data-id=\"480120\" data-full-url=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-13.jpg\" data-link=\"https://cyclingtips.com/sram-rival-etap-axs-implications-13/\" class=\"wp-image-480120\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-13-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-13-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-13-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-13-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-13.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption class=\"blocks-gallery-item__caption\">Moving to a 12-speed format for Rival would probably mean switching to an XDR freehub body. However, SRAM has stuck to 11-tooth sprockets on its least-expensive mountain bike groupsets, so it&#8217;s possible that Rival might do that as well.</figcaption></figure></li><li class=\"blocks-gallery-item\"><figure><img loading=\"lazy\" width=\"1340\" height=\"754\" src=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-17-1340x754.jpg\" alt=\"\" data-id=\"480128\" data-full-url=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-17.jpg\" data-link=\"https://cyclingtips.com/sram-rival-etap-axs-implications-17/\" class=\"wp-image-480128\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-17-1340x754.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-17-650x366.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-17-190x107.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-17-16x9.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/02/SRAM-Rival-eTap-AXS-implications-17.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption class=\"blocks-gallery-item__caption\">As good as performance value has been with Rival, the aluminum crankset has always been the outlier in terms of how closely it compared with Force and Red. Where most of the other bits didn&#8217;t vary too much from its more expensive brethren, the crank was always disproportionately heavy. Photo: SRAM.</figcaption></figure></li></ul></figure>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/what-wireless-rival-etap-axs-might-mean-for-srams-mechanical-groupsets/\">What wireless Rival eTap AXS might mean for SRAM’s mechanical groupsets</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"5987dbdcbf80b764b6902a36836821612ff764ca18adafaf7df6833f7cd0f12d","category":"Cycling"}