{"title":"Mathieu van der Poel plans a busy year again","link":"https://cyclingtips.com/2021/12/mathieu-van-der-poel-plans-a-busy-year-again/","date":1638434546000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/CORVOS_00033604-226-650x433.jpg\" /></div><h2>Mathieu van der Poel plans a busy year again</h2><p>\n</p><p>The back pains that hampered Mathieu van der Poel since his crash at the Olympic Games seem over opening the road to a season with potentially three World Championships: cyclocross, mountain bike and road. He also returns to the Tour de France in 2022 although specific yellow or green goals for that race haven’t been set yet.</p>\n\n\n\n<p>“That crash in Tokyo was a huge deception for Mathieu because it was a goal he had worked on for many years,” Roodhooft tells De Telegraaf newspaper. “That mental blow bothered him for a while and then the back pain followed. It took all the fun out of his riding because it was a constant battle against the pain. But I don’t hear him about his back anymore which is a good sign. He does his core exercises and the team expects that it won’t bother him again in the long run. We are on schedule.”</p>\n\n\n\n<p>Van der Poel starts his build up to a new season in the Spanish sun at Benicassím this week. He will return to cyclocross in front of his home crowd on Saturday 18 December at Rucphen, the Netherlands but due to the COVID measures no public is allowed anymore. “Next to it being a home race we also chose that moment because it would give Mathieu enough time to rest and enough time to prepare for the World Championships in Fayetteville.”</p>\n\n\n\n<p>After the Spring Classics Van der Poel starts his preparation for the Tour de France where he won a stage and wore the yellow jersey for six days this year. Naturally the expectations for 2022 are high. While Wout van Aert indicated in Het Laatste Nieuws he aims for the green jersey next year, Van der Poel’s team manager Christoph Roodhooft hasn’t set goals just yet.</p>\n\n\n\n<p>“It’s no use to talk about specific goals for a green or a yellow jersey,” Roodhooft said. “We know all too well that goals can be shattered in pieces before you even start. We didn’t factor his back issues either.” </p>\n\n\n\n<p>Van der Poel does plan to ride mountain bike again in 2022 but Roodhooft doesn’t want to say whether he will take part in the World Championships in Les Gets, France in the cross country race. “We have a planning but our first focus is on cyclocross right now,” the Alpecin-Fenix team manager concludes.</p>\n\n\n\n<p></p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/mathieu-van-der-poel-plans-a-busy-year-again/\">Read More</a>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"598db585c1eca96a13c8d79a92c2ad5d8909a73d57f5866116fbd2bb1d1d9c61","category":"Cycling"}