{"title":"No clear evidence of a difference between individuals who self-report an absence of auditory imagery and typical imagers on auditory imagery tasks","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300219","date":1712152800000,"content":"<p>by Zoë Pounder, Alison F. Eardley, Catherine Loveday, Samuel Evans</p>\r\n\r\nAphantasia is characterised by the inability to create mental images in one’s mind. Studies investigating impairments in imagery typically focus on the visual domain. However, it is possible to generate many different forms of imagery including imagined auditory, kinesthetic, tactile, motor, taste and other experiences. Recent studies show that individuals with aphantasia report a lack of imagery in modalities, other than vision, including audition. However, to date, no research has examined whether these reductions in self-reported auditory imagery are associated with decrements in tasks that require auditory imagery. Understanding the extent to which visual and auditory imagery deficits co-occur can help to better characterise the core deficits of aphantasia and provide an alternative perspective on theoretical debates on the extent to which imagery draws on modality-specific or modality-general processes. In the current study, individuals that self-identified as being aphantasic and matched control participants with typical imagery performed two tasks: a musical pitch-based imagery and voice-based categorisation task. The majority of participants with aphantasia self-reported significant deficits in both auditory and visual imagery. However, we did not find a concomitant decrease in performance on tasks which require auditory imagery, either in the full sample or only when considering those participants that reported significant deficits in both domains. These findings are discussed in relation to the mechanisms that might obscure observation of imagery deficits in auditory imagery tasks in people that report reduced auditory imagery.","author":"Zoë Pounder","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"599bd30b063588ba353446547bcebb8d1d9df7e85c14e5297d46788bffee27c3","category":"Interdisciplinary"}