{"title":"Sam Altman ออกสื่อครั้งแรกหลังเรื่องราววุ่นวายที่ OpenAI - ย้ำการพัฒนา AI ที่ปลอดภัยและเป็นประโยชน์กับโลก","link":"https://www.blognone.com/node/137191","date":1702381956000,"content":"<div><div><div><p>Sam Altman ซีอีโอ OpenAI ปรากฏตัวต่อสาธารณะครั้งแรกหลังจากเกิดเรื่องราวภายใน ที่เขาถูกบอร์ดไล่ออก และกลับมาเป็นซีอีโออีกครั้ง โดยเข้าร่วมงานสัมมนาที่จัดโดยองค์กร Operation HOPE ซึ่งเป็นการพูดคุยถึงอนาคตของ AI</p>\n<p>Sam ยืนยันว่า AI จะทำให้โลกก้าวหน้าขึ้นไปอีก โดยเฉพาะการพัฒนาด้านสุขภาพและการศึกษา ที่ผ่านมาคนมักนึกถึง AI ในหน้าตาแบบภาพยนตร์ Terminator แต่ภารกิจของ OpenAI คือก้าวข้ามสิ่งเหล่านั้น และแสดงให้โลกเห็นถึงโอกาสใหม่ ๆ จาก AI</p>\n<p>เมื่อถามถึงอันตรายของ AI เขาบอกว่า เรื่องนี้เราไม่ต้องจินตนาการมากก็ได้ เพราะ OpenAI ก็ทำงานในรูปแบบที่ถูกจับตามองตลอดอยู่แล้ว สิ่งที่บริษัทให้ความสำคัญคือการสร้าง AI ที่ปลอดภัย แต่เราก็ไม่สามารถสร้าง AI ที่ปลอดภัยได้ในระบบปิด สิ่งที่ทำคือการเผยแพร่มันออกไปในวงกว้าง ส่วนข้อกังวลว่า AI จะถูกนำไปใช้ในทางที่ไม่ดี เขาก็ยืนยันว่าสุดท้ายเราก็ต้องเผยแพร่มันออกมา</p>\n<p>เขายังพูดถึงวิวัฒนาการของ AI ในปีที่ผ่านมาซึ่งค่อนข้างก้าวหน้ารวดเร็ว ว่าการเปลี่ยนแปลงรอบนี้แตกต่างจากยุคสมัยสมาร์ทโฟนหรืออินเทอร์เน็ต ซึ่งยอมรับว่าค่อนข้างน่ากลัว ตอนนี้ OpenAI ก็เหมือนวิ่งเข้าใส่พายุทอร์นาโดที่ยังไม่มีทีท่าจะหยุด</p>\n<p>ในงานสัมมนานี้ Sam ไม่ได้พูดถึงประเด็นที่เขาถูกบอร์ดบริษัทไล่ออก และประเด็นว่าโครงสร้างองค์กร OpenAI จะเป็นอย่างไรต่อไป</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/articles/2023-12-12/sam-altman-defends-ai-thrust-days-after-retaking-openai-s-helm\">Bloomberg</a> ภาพ <a href=\"https://operationhope.org/operation-hope-and-clark-atlanta-university-host-chatgpt-creator-and-openai-ceo-sam-altman-to-discuss-the-future-of-artificial-intelligence-in-the-black-community/\">Operation HOPE</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5f6db4902da16c20c3a20b2051428713.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sam-altman\">Sam Altman</a></div><div><a href=\"/topics/openai\">OpenAI</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"599b2a6e34a28a68858323bca0416e4cad526ff7d2a04791ac80532cdabe2559","category":"Thai"}