{"title":"Google passkeys are a no-brainer. You’ve turned them on, right?","link":"https://arstechnica.com/?p=1937113","date":1683553821000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/passkey-target-illustration-800x450.jpg\" alt=\"Google passkeys are a no-brainer. You’ve turned them on, right?\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/passkey-target-illustration.jpg\">Enlarge</a> (credit: Aurich Lawson | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>By now, you’ve likely heard that passwordless Google accounts have <a href=\"https://arstechnica.com/gadgets/2023/05/passwordless-google-accounts-are-here-you-can-now-switch-to-passkey-only/\">finally arrived</a>. The replacement for passwords is known as \"passkeys.\"</p>\n<p>There are many misconceptions about passkeys, both in terms of their usability and the security and privacy benefits they offer compared with current authentication methods. That’s not surprising, given that passwords have been in use for the past 60 years, and passkeys are so new. The long and short of it is that with a few minutes of training, passkeys are easier to use than passwords, and in a matter of months—once a dozen or so industry partners finish rolling out the remaining pieces—using passkeys will be easier still. Passkeys are also vastly more secure and privacy-preserving than passwords, for reasons I'll explain later.</p>\n<h2>What is a passkey anyway?</h2>\n<p>This article provides a primer to get people started with Google's implementation of passkeys and explains the technical underpinnings that make them a much easier and more effective way to protect against account takeovers. A handful of smaller sites—specifically, PayPal, Instacart, Best Buy, Kayak, Robinhood, Shop Pay, and Cardpointers—have rolled out various options for logging in with passkeys, but those choices are more proofs of concept than working solutions. Google is the first major online service to make passkeys available, and its offering is refined and comprehensive enough that I’m recommending people turn them on today.</p></div><p><a href=\"https://arstechnica.com/?p=1937113#p3\">Read 26 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1937113&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"59a69f7fc5cee906c930daec61e3903773d153321703845e9d4ed175a15596b9","category":"Tech"}