{"title":"Hospitalization and mortality outcomes among adult persons living with HIV in a tertiary hospital in South-western Nigeria: A cross-sectional study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003487","date":1720706400000,"content":"<p>by Ayanfe Omololu, Asukwo Onukak, Mfon Effiong, Olaide Oke, Samson E. Isa, Abdulrazaq G. Habib</p>\r\n\r\nHIV infection continues to be a major public health issue, with significant morbidity and mortality especially in resource poor areas. Infection with HIV results in an increased risk of opportunistic infections and other complications, which may lead to hospital admission and death. Morbidity and mortality patterns among hospitalized persons living with HIV (PLHIV) have been well documented in high income countries, but there is paucity of such data in Nigeria. We investigated the reasons for hospitalization and predictors of death among adult PLHIV at the Federal Medical Center (FMC) Abeokuta, Nigeria. This was a hospital based cross-sectional study carried out over a 15-month period between January 2018 and March 2019. All consenting hospitalized adult PLHIV who met the inclusion criteria were enrolled into the study. Causes of hospitalization and death were obtained and analyzed. Over the study period, 193 hospitalizations of PLHIV were studied. Although a number of clinical syndromes were documented, Sepsis and Tuberculosis were the commonest causes of hospitalization and mortality. Mortality rate was 37(19.2%) for outcomes on day 30, with anaemia [OR 3.00 (95% C.I: 1.04–8.67)], poor adherence with Cotrimoxazole [OR 4.07 (95% C.I: 1.79–9.28)], poor adherence with cART [OR 13.40 (95% C.I: 3.92–45.44)], and a longer duration of fever [OR 3.34 (95% C.I: 1.10–9.99)] being predictors of mortality. Part of the study’s limitation was resource-constraint of some of the indigent patient which affected their ability to access some diagnostic investigations and get optimal care thereby impacting on their outcome. Despite the upscaling of cART, opportunistic infections and sepsis remain common causes of hospitalization and death in adult PLHIV. More attention should therefore be placed on early diagnosis, prevention of immunosuppression and sepsis through timely administration and adherence to cART and other prophylactic measures.","author":"Ayanfe Omololu","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"59a821f9fc2c160a818fa809276d4f211bc6747d79be3fb9f2dd5aee15159510","category":"Environment"}