{"title":"Chrome can now organize your tab bar for you","link":"https://arstechnica.com/?p=1997812","date":1706034069000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/Chrome_Gen-AI_Tier-1_Blog-Header-1-800x333.png\" alt=\"Chrome can now organize your tab bar for you\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/Chrome_Gen-AI_Tier-1_Blog-Header-1.png\">Enlarge</a> (credit: Google)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>You there! Reader! Be honest: How many tabs do you have open right now? Is your tab bar an unsalvageable mess with so many tabs you can barely read them? Soon, desktop Chrome might have a solution for you: automatically created tab groups, thanks to the power of AI.</p>\n<p>Google's<a href=\"https://blog.google/products/chrome/google-chrome-generative-ai-features-january-2024/\"> latest blog post</a> details the new AI feature in Chrome 121, one of which will \"organize similar tabs\" by scanning your tab bar and automatically create smartly named tab groups. The tab menu in Chrome will soon be tabbed itself, with \"All tabs\" showing the usual list of tabs and a second \"Organize tabs\" section with a button that will automatically group your tabs. Google says you'll be able to right-click on your tabs and hit \"organize,\" too.</p>\n<p>The example gif grabs a bunch of Pixel 8 tabs, gives them a colored tab group, and names them \"Google Pixel,\" complete with an emoji in the name. Tab groups became a part of Chrome <a href=\"https://arstechnica.com/gadgets/2020/05/hands-on-with-google-chromes-slick-new-tab-grouping-feature/\">in 2020</a>, and if you've never tried them, they're pretty useful. All the tab groups take on a colored highlight across your grouped tabs, and clicking on the tab group name will collapse the group.</p></div><p><a href=\"https://arstechnica.com/?p=1997812#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1997812&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"59a9cc5422253539cd02f34da514e79b87bedb87f642fab763ccc0196719cd55","category":"Tech"}