{"title":"A startup allegedly “hacked the world.” Then came the censorship—and now the backlash.","link":"https://arstechnica.com/?p=2000875","date":1706902003000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/security_indian_hackers_coverup-800x450.jpg\" alt=\"A startup allegedly “hacked the world.” Then came the censorship—and now the backlash.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/security_indian_hackers_coverup.jpg\">Enlarge</a> (credit: <a href=\"https://www.wired.com/story/appin-training-centers-lawsuits-censorship/\">WIRED staff/Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Hacker-for-hire firms like <a href=\"https://www.wired.com/story/nso-group-lobbying-israel-hamas-war/\">NSO Group</a> and <a href=\"https://www.wired.com/2015/07/hacking-team-breach-shows-global-spying-firm-run-amok/\">Hacking Team</a> have become notorious for enabling their customers to spy on vulnerable members of civil society. But as far back as a decade ago in India, a startup called Appin Technology and its subsidiaries allegedly played a similar cyber-mercenary role while attracting far less attention. Over the past two years, a collection of people with direct and indirect links to that company have been working to keep it that way, using a campaign of legal threats to silence publishers and anyone else reporting on Appin Technology’s alleged hacking past. Now, a loose coalition of anti-censorship voices is working to make that strategy backfire.</p>\n<p></p><div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/wired-logo.png\" /></div>For months, lawyers and executives with ties to Appin Technology and to a newer organization that shares part of its name, called the Association of Appin Training Centers, have used lawsuits and legal threats to carry out an aggressive censorship campaign across the globe. These efforts have demanded that more than a dozen publications amend or fully remove references to the original Appin Technology’s alleged illegal hacking or, in some cases, mentions of that company’s co-founder, Rajat Khare. Most prominently, a lawsuit against Reuters brought by the Association of Appin Training Centers resulted in a stunning order from a Delhi court: It demanded that Reuters take down its article based on a blockbuster investigation into Appin Technology that had <a href=\"https://ddosecrets.com/wiki/Appin_Uncensored\" target=\"_blank\">detailed its alleged targeting and spying</a> on opposition leaders, corporate competitors, lawyers, and wealthy individuals on behalf of customers worldwide. Reuters “temporarily” removed its article in compliance with that injunction and is fighting the order in Indian court.\n<p>As Appin Training Centers has sought to enforce that same order against a slew of other news outlets, however, resistance is building. Earlier this week, the digital rights group the Electronic Frontier Foundation (EFF) sent a response—published <a href=\"https://www.muckrock.com/news/archives/2024/feb/01/global-censorship-appin-reuters/\" target=\"_blank\">here</a>—pushing back against Appin Training Centers’ legal threats on behalf of media organizations caught in this crossfire, including the tech blog Techdirt and the investigative news nonprofit MuckRock.</p></div><p><a href=\"https://arstechnica.com/?p=2000875#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2000875&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"59bf12318d6cb0e9a2975a04d1e22c44ec7041101c16de253a9f41161ec1188e","category":"Tech"}