{"title":"watchOS 10.1 brings important features, fixes, and security updates","link":"https://www.macworld.com/article/2116305/watchos-10-1-is-out-now-adding-namedrop-double-tap-and-more.html","date":1698319934000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple has released watchOS 10.1, which adds the new Double Tap feature that was heavily promoted as a key benefit of the <a href=\"https://www.macworld.com/article/1472709/apple-watch-series-9-rumors-specs-features-price-release.html\">Apple Watch Series 9 and Ultra 2</a>. It also adds NameDrop support, both iPhone-to-Watch and Watch-to-Watch. That requires at least an Apple Watch SE2, Series 7, or Ultra. It also includes several bug fixes and security updates.</p>\n\n\n\n<h2>watchOS 10.1: Release notes</h2>\n\n\n\n<p>Apple’s official release notes for watchOS 10.1 are as follows.</p>\n\n\n\n<blockquote>\n<p>watchOS 10.1 includes new features, improvements, and bug fixes, including:</p>\n\n\n\n<ul>\n<li>Double tap gesture can be used to perform the primary action in notifications and most apps so you can answer a call, play and pause music, stop a timer, and more (Available on Apple Watch Series 9 and Apple Watch Ultra 2)</li>\n\n\n\n<li>NameDrop allows you to exchange contact information with someone new by simply bringing your Apple Watch near their iPhone with iOS 17 or Apple Watch (Available on Apple Watch SE 2, Apple Watch Series 7 and later, and Apple Watch Ultra)</li>\n\n\n\n<li>My Card is available as a complication for quick access to NameDrop</li>\n\n\n\n<li>Fix for bug that causes the climate section in the Home app to be blank</li>\n\n\n\n<li>Addresses an issue that causes a white selection border to be unexpectedly displayed after turning off AssistiveTouch</li>\n\n\n\n<li>Fixes an issue where cities may not sync between iPhone and watch in Weather</li>\n\n\n\n<li>Resolves an issue where the scroll bar may unexpectedly be visible on the display</li>\n\n\n\n<li>Fix for bug that causes elevation to be incorrect for some users<br />For information on the security content of Apple software updates, please visit this website: <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/kb/HT201222&amp;xcust=1-1-2116305-1-0-0&amp;sref=https://www.macworld.com/feed\">https://support.apple.com/kb/HT201222</a></li>\n</ul>\n</blockquote>\n\n\n\n<h2>watchOS 10.1: New features</h2>\n\n\n\n<p><strong>Double tap:</strong> The new gesture for the Apple Watch Series 9 and Ultra 2 has arrived, letting you perform simple actions, such as answering calls and pausing music, without needing to touch the screen</p>\n\n\n\n<p><strong>NameDrop:</strong> Easily exchange contact information by bringing your watch near an iPhone running iOS 17 or another Apple Watch.</p>\n\n\n\n<h2>watchOS 10.1: Bug fixes and security updates</h2>\n\n\n\n<p>Most notably, the watchOS 10.1 update fixes the weather complication bug that has plagued users. The complication will now show the proper temperature. The update also brings <a href=\"https://www.macworld.com/article/2116474/ios-17-1-macos-14-1-security-updates-siri-find-my-weather-webkit.html\">several security patches</a> for Find My, Weather, Siri, and other apps and system services.</p>\n\n\n\n<h2>watchOS 10.1: How to install</h2>\n\n\n\n<p>To install watchOS 10.1, it’s best to first update the associated iPhone to <a href=\"https://www.macworld.com/article/2084154/ios-17-1-beta-release-date-new-features.html\">iOS 17.1</a>. </p>\n\n\n\n<p>Then follow these steps:</p>\n\n\n\n<ol>\n<li>Open the <em>Watch</em> app on your iPhone.</li>\n\n\n\n<li>In the <em>My Watch</em> tab, select <em>General</em>.</li>\n\n\n\n<li>Select <em>Software Update</em>.</li>\n\n\n\n<li>Follow the on-screen instructions to update your Apple Watch.</li>\n</ol>\n\n\n\n<p>You’ll want to put your Apple Watch on a charger until the update process is completed.</p>\n\n\n\n<p>To update your Apple Watch directly on the watch itself, follow these steps:</p>\n\n\n\n<ol>\n<li>Make sure that your watch is connected to Wi-Fi.</li>\n\n\n\n<li>On your watch, open the <em>Settings</em> app.</li>\n\n\n\n<li>Tap <em>General</em> &gt; <em>Software Update</em>.</li>\n\n\n\n<li>Tap Install if a software update is available, then follow the onscreen instructions.</li>\n</ol>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"59cb54e420b38dbf2d1bc416638b91c5905c0a9a77243771cd230e847bc1bcc7","category":"Apple"}