{"title":"Traffic Noise Impacts Glucocorticoid Response, Activity, and Growth in Two Species of Tadpoles","link":"https://academic.oup.com/icb/article/64/1/15/7670604?rss=1","date":1715385600000,"content":"<span><div>Synopsis</div>There is a large body of evidence linking increased noise to negative health effects for animals. Anthropogenic noise induces behavioral and physiological reactions across a range of taxa and increased traffic noise affects glucocorticoid (GC) hormones associated with the stress response in amphibians. GCs help to maintain homeostasis while balancing energetic trade-offs between reproduction, growth, and activity. Stressors during early development can impact fitness at later life stages. We measured growth, activity, and GCs in response to high levels of traffic noise in two tadpole species that differ in life history: <span>Acris crepitans</span> and <span>Rana berlandieri</span>. We predicted that earlier exposures to traffic noise will slow down the development and alter the behavior and GC concentrations differently than later exposures. Subjects were initially either exposed to natural levels of traffic noise for 8 days (early exposure) or a white noise control (later exposure), then the treatment was switched. Activity was measured via focal sampling and tadpoles were categorized as active if movement was detected. Tadpoles exposed to white noise initially maintained mass and activity throughout the experiment and early exposure to traffic noise had a greater impact on mass, activity, and GCs. Tadpoles exposed to traffic noise initially lost mass, with <span>A. crepitans</span> regaining mass but not <span>R. berlandieri</span>. When exposed earlier to traffic noise, <span>R. berlandieri</span> increased movement when shifted to the white noise treatment while <span>A. crepitans</span> did not significantly change activity. <span>Acris creptians</span> had higher corticosterone release rates compared to <span>R. berlandieri</span>, and in both species, release rates were higher for tadpoles exposed to noise earlier. The longer-lived <span>R. berlandieri</span> allocated more of their energetic resources into activity, while the shorter-lived <span>A. crepitans</span> allocated energy toward growth. <span>Rana berlandieri</span> and <span>A. crepitans</span> utilized different coping strategies to contend with early exposure to traffic noise, potentially due to differences in life histories. Our findings suggest that these tadpoles employ different coping mechanisms to modulate stress responses in noise-polluted environments, and these mechanisms could influence their fitness later in life. Further study is needed to understand the impact in more sensitive tadpole species.</span>","author":"","siteTitle":"Integrative and Comparative Biology Current Issue","siteHash":"715dd1b0fb4f45600bceadb227e9b7fdf8bd9d1d7a2fd3d5e0399d2c1f410646","entryHash":"59cbf6ffd6fe46017e4e62b52ceb9da5a2cc6c991035cd463954001df70a79b5","category":"Environment"}