{"title":"How to increase your average cycling speed: 16 tips to ride faster","link":"https://www.bikeradar.com/advice/fitness-and-training/average-speed-cycling/","date":1678726800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Liv-EnviLiv-5-f23d072.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Liv-EnviLiv-5-f23d072.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Liv-EnviLiv-5-f23d072.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Liv-EnviLiv-5-f23d072.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Liv-EnviLiv-5-f23d072.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Liv-EnviLiv-5-f23d072.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Liv-EnviLiv-5-f23d072.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Liv-EnviLiv-5-f23d072.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Liv-EnviLiv-5-f23d072.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Liv-EnviLiv-5-f23d072.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Katherine Moore climbing on the Liv EnviLiv Advanced 1 women's aero road bike\" title=\"Liv EnviLiv_-5\" />                                            <p>Average speed is a key number for cyclists – it’s easy to understand and to use as a benchmark for your performance on the bike.</p>\n<p>There are, however, lots of variables that affect your average speed. Comparing one rider’s speed to the next – or even your own speed from one day to another – isn’t always helpful</p>\n<p>Still, going faster on the bike is something many of us want to achieve, so what can you do to improve your average speed on the bike?</p>\n<p>When the great Italian cyclist Fausto Coppi was asked how to become a champion, it’s said he answered “pedal, pedal”.</p>\n<p>The Campionissimo’s maxim from the 1950s still holds good, with pro riders putting in tens of thousands of kilometres a year on their bikes. But there’s more to going fast than riding lots.</p>\n<p>We asked <a href=\"https://www.bikeradar.com/features/pro-bike/joss-lowden-argon-18-electron-pro/\">Joss Lowden</a>, British National time trial champion and former women’s Hour Record holder, for her expert tips.</p>\n<h2>What is a good average speed?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> We cyclists love stats such as average speed.</span></figcaption><span> <i>Russell Burton </i></span></div>\n<p>Let’s start with a question that many riders often have. What is a good average speed?</p>\n<p>As always, it depends on a lot of things.</p>\n<p>That includes the bike you’re riding. You’ll typically go faster on a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bike</a> with a drop handlebar and skinny tyres than on a flat-bar <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hybrid-bikes/\">hybrid bike</a> with chunky tyres or a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">mountain bike</a> designed for riding off-road.</p>\n<p>Where you ride matters too.</p>\n<p>Hillier terrain will often bring your average speed down, as will <a href=\"https://www.bikeradar.com/features/how-to-ride-into-a-headwind/\">riding into a headwind</a> and wet weather or tricky conditions.</p>\n<p>Even how smooth the tarmac is can make a difference. Professionals used to racing in continental Europe have been known to complain about how much slower the tar-and-gravel UK roads are when they ride the Tour of Britain.</p>\n<p>Crucial though is your level of fitness. A beginner might struggle to keep up an average speed of 10mph/16kph over an hour or two on a road bike.</p>\n<p>Ride consistently and get fitter, and you should be able to maintain a mileage per hour in the mid-teens (around 15.5mph/25kph) over several hours – Strava reckons that’s the average speed for rides logged.</p>\n<p>To hit an average speed of 20mph/32kph, you’ll probably have had to put in lots of systematic training. Since it takes eight times as much effort to overcome air resistance at 20mph as it does at 10mph, that’s a big increase in <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-train-with-power/\">power output</a>.</p>\n<p>The winner of the men’s <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> consistently averages 25mph/40kph riding more than 2,000 miles/3,500km over three weeks, although they do have help from riding with teammates and in a group.</p>\n<h2>How to increase your average cycling speed?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Lowden is one of the world’s fastest riders.</span></figcaption><span> <i>Alex Livesey/Getty Images</i></span></div>\n<p>Lowden, who races at WorldTour level on the road for UnoX, says riding faster boils down to when and where you deliver power, your bike handling, your route and your equipment.</p>\n<p>Now we’ll expand on these areas and suggest more ways that’ll help increase the average speed of your rides.</p>\n<h3>1. Use your energy efficiently</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Brake when it’s required for safety but don’t waste your hard-earned speed.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Knowing when to pedal is important. There’s no point in hammering up to a red traffic light then having to stop, put a foot down, then start again, when a better-timed approach would see you ride through with less effort.</p>\n<p>Avoiding unnecessary braking is just as important. Lowden says: “You don’t have to brake just because a car goes past on the other side of the road or if you come into a roundabout where there is nothing coming and you can maintain a straight line.”</p>\n<p>She says your safety should be your priority, but she adds: “Every time you brake you write off the energy you have put in to get to that speed, so you want to hold on to it.”</p>\n<p>Laying off the brakes is easier if you know <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-corner-with-confidence/\">how to corner with confidence</a>.</p>\n<p>We often hit our maximum speed on descents, so capitalising on gravity’s assistance can raise average cycling speed.</p>\n<p>On an undulating road, a faster descent will give you more momentum to get you part way up the next uphill, too. Gauge it right and you might make it to the top of the next ridge without too much of a drop in speed. Starting a climb from a low speed will be harder and slower.</p>\n<p>Former men’s Hour Record holder Alex Dowsett says it can be better to adopt an aero tuck than pedal on long descents. You’ll go faster and save energy for the climbs, where you’ll get more reward for your watts.</p>\n<p>Lowden agrees, adding: “You want to minimise the amount of time you spend going slowly.</p>\n<p>“So pushing on when it’s slow uphill, into a headwind or on bad road surfaces and recovering when it’s fast will use your energy most effectively to give you the fastest speed.”</p>\n<p>But before bombing over the other side of a hill, make sure you’re aware of <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-descend-safely-on-a-road-bike/\">how to descend safely on a road bike</a>.</p>\n<h3>2. Ride in a group</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Riders at the back of the bunch conserve vastly more energy than those close to the front.</span></figcaption><span> <i>Tim de Waele/Getty Images</i></span></div>\n<p>Riding in a group can be a surefire way to improve your average speed.</p>\n<p>If you’re with other riders, there’s the incentive to keep up, so that even if you’re starting to flag you’ll hang in and keep going.</p>\n<p>Likewise, if you’re feeling fresh you can set the pace and help your fellow riders to keep going faster.</p>\n<p>The main benefit of riding in a group, however, is the drafting effect.</p>\n<p>Tucked in behind other riders, it’s estimated that you can save up to 40 per cent of the effort required to ride up front. <a href=\"https://www.bikeradar.com/features/how-to-perfect-your-drafting/\">Drafting effectively</a> and safely takes practice, so again more miles will make you better.</p>\n<p>Lowden says sitting close to the wheel in front will usually save you watts, but in a crosswind, the most sheltered place will be on either side. For example, when the wind’s blowing left to right, you should be slight to the right of the rider in front.</p>\n<p>She recommends sharing turns on the front and pushing harder into the wind, then recovering when you’re on the wheel.</p>\n<p>Clubs are a great way to find fellow cyclists to ride with. Most will organise group rides of different speeds, so you can pick one that you can keep up with and move up to a faster group as your speed and experience increase.</p>\n<p>If you’re new to cycling in a bunch, we’ve got advice on <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-in-a-group/\">how to ride in a group</a>.</p>\n<h3>3. Work on your cadence</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Pedalling a higher cadence saves your legs for intense efforts.</span></figcaption><span> <i>Andy Lloyd / Our Media</i></span></div>\n<p>It’s not just about pedalling more. Pedalling faster can help you ride faster, too. There’s less strain on your muscles and, once you get efficient at it, pedalling faster should be less tiring.<a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\"> </a></p>\n<p><a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">Cadence</a>, if you’re not familiar, is just the number of times you turn the pedals per minute.</p>\n<p>There’s no ‘perfect’ cadence but trained amateur riders typically ride at around 80 to 90rpm, while some pro riders may ride with a cadence approaching 100rpm.</p>\n<p>It’s also about developing ‘<em>souplesse</em>‘ – a smooth, efficient riding style that puts down power through more of the pedal stroke, not just when pushing down.</p>\n<h3>4. Get more aero (like a tortoise)</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Elbows at right angles to your arms can be the most aero position.</span></figcaption><span> <i>Yogamaya von Bromley / Immediate Media</i></span></div>\n<p>Getting more aero is a major factor in riding faster. Around three-quarters of drag comes from you, not your bike, so you don’t have to spend a fortune on a new <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-aero-road-bike/\">aero bike</a> or deep-section wheels to ride faster.</p>\n<p>Wind resistance rather than friction takes over as the dominant factor slowing you down once you get above 10mph/16kph, so even at lower speeds aerodynamics are important.</p>\n<p>The main thing you can do to improve your aerodynamic performance is to reduce your frontal profile and work on the <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-faster-without-pedaling-harder/\">position of your arms</a>.</p>\n<p>“Sitting upright is like a big wind block whereas getting forward and low on the bike with elbows in and head tucked in (think like a tortoise) is going to be faster,” Lowden explains.</p>\n<p>She says that in general riding with your hands on the hoods with your elbows at a right angle is likely to be more aerodynamic than holding the drops.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> On downhills, holding the drops can afford more control of the bike.</span></figcaption><span> <i>Luc Claessen/Getty Images</i></span></div>\n<p>“But when you are descending really fast you will want to be on the drops for stability and better cornering,” she adds.</p>\n<p>Riders used to slam their stems to get lower at the front of the bike, but this is not necessarily faster, according to Lowden.</p>\n<p>A higher stack might make you faster because you’ll be more comfortable and better able to maintain a flat back and right angle at the elbows.</p>\n<p>Physios often advise riders experiencing <a href=\"https://www.bikeradar.com/advice/fitness-and-training/it-band-injuries-and-cycling-what-you-need-to-know/\">hip pain</a> to <a href=\"https://www.bikeradar.com/advice/workshop/how-to-adjust-your-handlebar-height/\">raise their handlebars</a> as well. This opens up the hip angle and reduces hip joint impingement – often the cause of hip pain.</p>\n\n<h3>5. Use your bike’s gears more efficiently</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Avoid cross-chaining and use your gears wisely.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>Poor use of gears can also sap speed. If you find yourself spinning before you change up a gear, or grinding a low gear as you hit a climb, you’ll be using more effort than if you’ve got your gear right for the terrain.</p>\n<p>So learning <a href=\"https://www.bikeradar.com/news/the-complete-guide-to-bicycle-gears-bicycle-transmissions-explained/\">how to use your bike’s gears</a>, reading the road ahead and preparing for what’s up front can help you ride faster.</p>\n<p>A straight chainline is also more efficient and therefore faster than an angled chainline so avoid cross-chaining.</p>\n<p>This is when you run the large chainring with the largest cassette sprocket or the smallest to smallest. Generally, it’s better to ride in a gear near the middle of your cassette for a straight chainline.</p>\n<p>Match your gearing to the terrain you ride. If you ride mostly on the flat using the big chain ring and a harder gear lower down the cassette, Lowden says you should consider putting on a bigger chain ring. Then you’ll spend more time in the middle of the cassette.</p>\n<h3>6. Keep track</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A power meter gets the most out of your interval sessions and gauges your longer efforts.</span></figcaption><span> <i>Canyon</i></span></div>\n<p>On a longer ride, it’s easy to drop off the pace, while if you’ve just climbed a hill it’s tempting to ease off a bit until you feel recovered.</p>\n<p>A bike computer will help you keep an eye on your current and average speeds and see if they’re beginning to drop. The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">best power meters</a> deliver reliable and consistent data than can help pace intervals and measure your effort on longer rides.</p>\n<p>Just having the number displayed can subconsciously encourage you to up your tempo and features such as Garmin’s Courses will tell you if you’re riding a particular route slower or faster than normal.</p>\n<p><a href=\"https://www.bikeradar.com/features/routes-and-rides/strava-tips-20-of-the-best/\">Strava</a> is also a great way to see how you’re doing against your own past performance and against others. You can choose a particular segment and use that to benchmark your fitness.</p>\n<p>The Strava Live feature, compatible with some <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">GPS bike computers</a>, will also give you an indication of how fast you’re riding a particular segment, compared to your previous best time and the fastest recorded time for that segment, called a <a href=\"https://www.bikeradar.com/advice/heres-how-to-take-a-strava-kom-qom/\">KOM or QOM</a>.</p>\n<h3>7. Train indoors</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Indoor training can bring many benefits.</span></figcaption><span></span></div>\n<p>A good way to work on your cadence, fitness and speed outdoors, is to get on a turbo trainer and ride indoors.</p>\n<p>While <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-vs-outdoor-cycle-training/\">it isn’t the be-all and end-all</a>, there are many <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-cycling-benefits/\">benefits of indoor cycling</a>.</p>\n<p>For a start, it’s a more controlled environment than riding out on the road, so you can train more effectively without worrying about the weather, traffic or terrain.</p>\n<p>If you use a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a>, you can also use power to track your training, while these days there’s a wide range of<a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\"> indoor training apps</a>, such as<a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\"> Zwift</a>, to provide motivation and workouts to follow, which brings us on to…</p>\n\n<h3>8. Try intervals</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Intervals aren’t always fun but they help you go faster.</span></figcaption><span> <i>Sam Voaden / Our Media</i></span></div>\n<p>While you’re on your turbo, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">interval training</a> is a great way to increase your fitness, particularly if you’re short on time.</p>\n<p>If <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-your-best-ever-time-trial/\">time trials</a> are your goal, Lowden suggests doing hard turbo sessions and endurance work in your TT position.</p>\n<p>“This is a really good way to improve your ability to deliver power in the position you will race in,” she says.</p>\n<p>You can ride intervals on the road too, but make sure you choose a safe place and stay alert to other road users.</p>\n<p>As a road workout, Lowden recommends ‘over/unders’, where your power output repeatedly rises over and then falls just below your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">Functional Threshold Power</a>.</p>\n<p>She says the session is good to do with a mate. Ride hard on the front for two minutes and then on the wheel of your friend, where your power dips a touch.</p>\n<p>Ride this way for 12 minutes, recover in zone 1 of your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zones</a> for four to five minutes then do another one or two blocks.</p>\n<p>Remember to maintain a mix of intervals. Do sprint sessions involving blocks of 40 or 30 seconds hard followed by 20 to 30 seconds’ recovery. And don’t neglect long endurance rides, adds Lowden.</p>\n<h3>9. Ride off-road</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Off-road skills, including bike handling, should speed up your road riding.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>If you’re a road cyclist, riding off-road can improve your pedalling efficiency and technique. Stomp on the pedals on a muddy or gravelly climb and you’ll go nowhere. You need to put the power down smoothly to keep going.</p>\n<p>Off-road riding improves your balance and bike handling skills, and the efforts tend to be more punchy than road riding, which can improve your fitness in a similar way to intervals. You’ll also <a href=\"https://www.bikeradar.com/advice/fitness-and-training/muscles-used-in-cycling/\">work different muscles</a> when you venture away from the tarmac.</p>\n<p>Top mountain bike riders have been shown to be some of the most efficient pedallers. Many MTB stars, such as <a href=\"https://www.bikeradar.com/features/pro-bike/2022-uci-gravel-world-championships-podium-bikes/\">Pauline Ferrand-Prévot</a>, have won world championships on the road too.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/skills/technique/cyclocross-skills/\">cyclocross skills</a> of riders such as Zoe Bäckstedt and <a href=\"https://www.bikeradar.com/features/pro-bike/tom-pidcock-world-champions-edition-pinarello-crossista-f/\">Tom Pidcock</a> have contributed to their road victories. They have the power, acceleration and descending skills to break away solo.</p>\n<h3>10. Practise climbs</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> You stand to gain more speed by going hard on hills.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>Many people struggle on climbs and that can make a big dent in your average speed.</p>\n<p>Hill repetitions are a good way to <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-faster-climbing/\">get better at climbing</a>. Choose a hill that will take you a few minutes to climb and try climbing it, staying seated as much as possible. Take a break at the top if necessary, ride to the bottom and repeat for a few more turns, until you’ve had enough.</p>\n<p>Keep practising and you’ll find your hill-climbing strength and speed increase, and you’ll need less recovery time once you reach the top of an uphill stretch.</p>\n<h3>11. Plan the right route</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Thorough route planning pays dividends in terms of speed.</span></figcaption><span> <i>Komoot </i></span></div>\n<p>A tailwind can make an amazing difference to how easy riding feels. That’s particularly true if you’re getting towards the end of a ride and feel a bit tired.</p>\n<p>Checking the weather forecast on a breezy day and planning where to ride, so that you ride out into a headwind while you’re fresh and pick up a following wind on the way back.</p>\n<p>But avoiding riding into headwinds at all will be faster, says Lowden.</p>\n<p>“It will be slower if you ride directly into a headwind even if you get a direct tailwind home.</p>\n<p>“Think about how sailing boats travel and ‘tac’ to use the crosswinds. You can do the same by plotting your routes to use cross winds and minimising direct headwinds,” she adds.</p>\n<p>While A roads or wide, fast roads aren’t the safest or most scenic, narrow lanes, tight corners and junctions will lower your average speed.</p>\n<p>Lowden likes A roads for these reasons and because they allow her to keep the steady pressure on the pedals required for endurance rides. But she admits riding on these roads has drawbacks.:</p>\n<p>“Smaller lanes and descents will improve your bike handling more than just bashing an A road,” she says.</p>\n<h3>12. Get your feeding down</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> High-carb energy products are essential to maintain high speed.</span></figcaption><span> <i>Dave Caudery / Our Media </i></span></div>\n<p>Keeping <a href=\"https://www.bikeradar.com/advice/nutrition/12-cycling-nutrition-truths-analysed/\">properly fed and watered</a> when riding is important. At worst, you can suffer from the dreaded <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-avoid-bonking-on-a-bike-ride/\">bonk</a>, where you completely run out of energy and slow to a crawl. But even a two per cent loss of body water has been shown to reduce your efficiency, so it’s important to stay hydrated.</p>\n<p>Lowden says you should calculate how many carbohydrates you need for the session and fuel accordingly. A moderate session might require 60g per hour while an intense one might call for 90g/hr. The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-energy-bars/\">best energy bars </a>and <a href=\"https://www.bikeradar.com/advice/nutrition/best-energy-gels-for-cycling/\">gels</a> usually contain between 20-25g per serving.</p>\n<p>She stresses the importance of <a href=\"https://www.bikeradar.com/advice/nutrition/what-to-eat-drink-recover-hard-rides/\">eating a good meal after a hard ride</a> to aid recovery for the next session.</p>\n<p>“I like to time all my sessions or rides to finish going into a meal so I get home, shower and have lunch straight away,” she adds.</p>\n<h3>13. Upgrade your tyres</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Quality tyres will get you round faster, and in greater comfort.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>We’ve predominantly focused on free (or low-cost) ways to improve your average speed, but there are smaller changes to your equipment that can make a significant difference.</p>\n<p>Faster tyres are surprisingly effective and cost-efficient. The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">best road bike tyres</a> will ride significantly quicker than cheaper alternatives. Some brands cut costs on tyres when speccing a build, so switching to faster rubber can be an easy way to upgrade your road bike.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A fast-rolling mountain bike tyre will be faster, but you’ll give up on control and grip.</span></figcaption><span> <i>David Arthur / Immediate Media</i></span></div>\n<p>Choosing tyres for the conditions can also pay dividends when it comes to average speed. Using a mountain bike tyre designed for muddy, winter conditions will likely slow you down if you’re riding dry, summer trails.</p>\n<p>Many of the latest bikes will come with <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless-ready</a> wheels and tyres. Tubeless tyres can be <a href=\"https://www.bikeradar.com/features/tubeless-tyres-pro-peloton/\">more efficient</a> than using tubes, due to the elimination of the friction between the <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tube</a> and the tyre casing. Latex tubes are more efficient than some tubeless tyres, but have some drawbacks.</p>\n<p>Tyre pressure is important too, so it’s important to keep your tyres correctly inflated.</p>\n<p>The right tyre pressure for your bike will balance speed, comfort, grip and puncture resistance. Want to know more? We’ve got guides to <a href=\"https://www.bikeradar.com/advice/workshop/road-bike-tyre-pressure/\">road bike tyre pressure</a> and <a href=\"https://www.bikeradar.com/advice/workshop/trail-tech-mountain-bike-tyre-pressure-all-you-need-to-know/\">mountain bike tyre pressure</a>.</p>\n<h3>14. Go Lycra</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A well-fitting jersey is an easy aero gain.</span></figcaption><span> <i>Max Wilman / Our Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/features/tunnel-testing-clothing-pearl-izumis-ongoing-aero-design/\">Aero clothing</a> can help your average speed, too. Close-fitting Lycra jerseys won’t flap in the wind like baggy kit, which can act like a sail and slow you down.</p>\n<p>The necessity to <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-layering-up-for-winter-cycling/\">layer up for winter cycling</a> makes being aero harder in the cold.</p>\n<p>Lowden recommends ensuring your kit fits as well as it can. Then, if it is cold, go for a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-gilets/\">cycling gilet</a> instead of a long-sleeved <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-cycling-jackets/\">winter cycling jacket</a>. The looser, thicker material on the arms will probably be slower.</p>\n<p>At the marginal gains end of the performance spectrum, clothing can make a significant difference. Time trialists will wear a skinsuit to cut through the wind, while the best riders will test its effect on drag in a wind tunnel.</p>\n<p>Kit such as the <a href=\"https://www.bikeradar.com/features/best-aero-road-helmets-8-tested-and-rated/\">best aero bike helmets</a> and shoe covers may reduce your drag without spending a fortune, while you can even get<a href=\"https://www.bikeradar.com/news/rule-28-aero-socks/\"> aero socks</a>.</p>\n<p>Lowden says aero <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-overshoes/\">overshoes</a> “are likely to help if you want to take your kit to the next level”.</p>\n<h3>15. Maintain your bike</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Immersive chain waxing will save you watts if you have the patience.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/features/clean-your-bike-in-7-simple-steps/\">Cleaning your bike</a> may not be a particularly fun job, but it can make a real difference to your efficiency.</p>\n<p>A <a href=\"https://www.bikeradar.com/advice/workshop/how-to-clean-a-bike-chain/\">clean chain</a> with the <a href=\"https://www.bikeradar.com/advice/buyers-guides/chain-lubes/\">right chain lube</a> will have less friction than one caked in grime. You could achieve further efficiency savings by learning <a href=\"https://www.bikeradar.com/advice/workshop/how-to-wax-a-chain/\">how to wax a bike chain</a>.</p>\n<p>A rubbing brake or rim that is out of true will slow you down, while worn <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-pads/\">brake pads</a> will be less effective, so you’ll need to slow down more gradually, again lowering your speed.</p>\n<p>So keep everything well maintained and you should find a bonus dose of free speed on your rides.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"59cba6ddb1b3fb34cc920553ca5ee6d45dc2f430a865cc4ce9ac74","category":"Cycling"}