{"title":"Ameliorating and Therapeutic Impact of Curcumin Nanoparticles Against Aluminum Oxide Nanoparticles Induced Kidney Toxicity, DNA Damage, Oxidative Stress, PCNA and TNFα Alteration in Male Rats","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24392?af=R","date":1722936541000,"content":"<h2>ABSTRACT</h2>\n<p>Aluminum oxide nanoparticles (Al<sub>2</sub>O<sub>3</sub> NPs) are among the most extensively utilized nanoparticles in nanotechnology and that have negative impacts on the environment. Therefore, the intention of this work is to investigate the protective and therapeutic effects of curcumin in nanoform <b>(</b>Cur NPs) against Al<sub>2</sub>O<sub>3</sub> NPs induced kidney toxicity, oxidative stress, DNA damage, and changes in necrosis factor alpha (TNFα) and proliferating cell nuclear antigen (PCNA) expressions in male rats. Fifty healthy adult male were divided into five groups [G1, control; G2, received 50 mg/kg/day for 4 weeks of Cur NPs orally; G3, received 6 mg/kg BW orally for 4 weeks of Al<sub>2</sub>O<sub>3</sub> NPs; G4, (Cur NPs + Al<sub>2</sub>O<sub>3</sub> NPs) received Cur NPs and Al<sub>2</sub>O<sub>3</sub> NPs at a dose similar to G2 and G3, respectively for 4 weeks; G5, (Al<sub>2</sub>O<sub>3</sub> NPs + Cur NPs) received Al<sub>2</sub>O<sub>3</sub> NPs at a dose similar to G3 for 4 weeks then received Cur NPs at a dose similar to G2 for another 4 weeks]. Current results revealed that Al<sub>2</sub>O<sub>3</sub> NPs induced a significant elevation in serum urea, creatinine, chloride, calcium, kidney malondialdehyde (MDA), DNA damage, injury, TNFα and PCNA expressions and a significant depletion in serum potassium, kidney superoxide dismutase (SOD), glutathione (GSH) as compared to control. On the other hand, treatments of Al<sub>2</sub>O<sub>3</sub> NPs with Cur NPs induced modulation in all altered parameters and improved kidney functions and structure, with best results for the Al<sub>2</sub>O<sub>3</sub> NPs + Cur NPs than Cur NPs + Al<sub>2</sub>O<sub>3</sub> NPs. In conclusion, Cur NPs has the capacity to mitigate the renal toxicity induced by Al<sub>2</sub>O<sub>3</sub> NPs in male albino rats.</p>","author":"Ehab Tousson, \nIbrahim E. T. El‐Sayed, \nHebatalla Nashaat Elsharkawy, \nAmira S. Ahmed","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"59ce0e4058741795e57a40a5814368fa796247370f0683db43bb50560956aff0","category":"Environment"}