{"title":"MacRumors Giveaway: Win a Custom Apple Pencil 2 From ColorWare","link":"https://www.macrumors.com/2024/02/09/macrumors-giveaway-colorware-apple-pencil/","date":1707501625000,"content":"For this week's giveaway, we've teamed up with <a href=\"https://www.colorware.com/\">ColorWare</a> to offer <em>MacRumors</em> readers a chance to win <a href=\"https://www.colorware.com/p-1466-colorware-apple-number-2-pencil.aspx?c=variant-15y\">a custom Apple Pencil 2</a> that's been painted to look like an actual number 2 pencil.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/colorware-apple-2-pencil-1.jpg\" width=\"2560\" height=\"1536\" />\r<br />\nColorWare is a company that makes custom-painted Apple products and accessories, and ordering from ColorWare is essentially the only way to get a non-standard color for AirPods, the <a href=\"https://www.macrumors.com/guide/apple-pencil/\">Apple Pencil</a>, the Magic Mouse, and AirTags.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/colorware-apple-2-pencil-2.jpg\" width=\"2000\" height=\"1000\" />\r<br />\nOccasionally, ColorWare comes out with super fun special edition products, such as the new <a href=\"https://www.colorware.com/p-1466-colorware-apple-number-2-pencil.aspx?c=variant-15y\">ColorWare Apple Number 2 Pencil</a>. This is an ‌Apple Pencil‌ 2 that has a black tip, yellow body, painted-on eraser, and other detailing for a faithful rendering of a number 2 pencil.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/colorware-apple-2-pencil-3.jpg\" width=\"2000\" height=\"1000\" />\r<br />\nColorWare is making a limited number of the Apple Number 2 Pencils, and they're priced at $215. That's an $86 premium over the $129 price tag, but the extra cost is worth it for a unique design that will make your <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> stand out. To get the pencil-like effect, ColorWare has combined matte, metallic, and glossy paints for the pencil, and it comes in a special edition box.\r<br />\n\r<br />\nColorWare has been designing and selling custom-painted devices for more than two decades, and it has perfected the steps needed for a gorgeous, durable finish. ColorWare uses a multi-step coating process that includes a primer, the application of a proprietary color formula, and an X2 liquid plastic coating that protects the color. All ColorWare products are warrantied for 12 months.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/colorware-apple-2-pencil-4.jpg\" width=\"2000\" height=\"1000\" />\r<br />\nThe Apple Number 2 Pencil is set to ship out from ColorWare in March, and two lucky <em>MacRumors</em> readers will be among the first to get them. To enter to win our giveaway, use the widget below and enter an email address. Email addresses will be used solely for contact purposes to reach the winner(s) and send the prize(s). You can earn additional entries by subscribing to our <a href=\"https://my.leadpages.net/leadbox/145ef7173f72a2%3A104a9fa76b46dc/5754903989321728/\">weekly newsletter</a>, subscribing to our <a href=\"https://www.youtube.com/user/macrumors\">YouTube channel</a>, following us on <a href=\"https://twitter.com/macrumors\">Twitter</a>, following us on <a href=\"https://www.instagram.com/macrumors/\">Instagram</a>, following us on <a href=\"https://www.threads.net/@macrumors\">Threads</a>, or visiting the <em>MacRumors</em> <a href=\"https://www.facebook.com/MacRumors\">Facebook page</a>.\r<br />\n\r<br />\nDue to the complexities of international laws regarding giveaways, only <strong>U.S. residents who are 18 years or older, UK residents who are 18 years or older, and Canadian residents (excluding Quebec) who have reached the age of majority in their province or territory are eligible to enter</strong>. All federal, state, provincial, and/or local taxes, fees, and surcharges are the sole responsibility of the prize winner. To offer feedback or get more information on the giveaway restrictions, please refer to <a href=\"http://forums.macrumors.com/threads/macrumors-giveaways-why-are-they-only-open-to-u-s-residents.1918337/\">our Site Feedback section</a>, as that is where discussion of the rules will be redirected.\r<br />\n\r<br />\n<div><a href=\"https://gleam.io/Vz0dx/colorware-giveaway\">ColorWare Giveaway</a>\r<br />\n</div>The contest will run from today (February 9) at 09:00 a.m. Pacific Time through 09:00 a.m. Pacific Time on February 16. The winners will be picked randomly on or shortly after February 16 and will be contacted by email. The winners will have 48 hours to respond and provide a shipping address before new winners are chosen.<div>Tag: <a href=\"https://www.macrumors.com/guide/giveaway/\">Giveaway</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/09/macrumors-giveaway-colorware-apple-pencil/\">MacRumors Giveaway: Win a Custom Apple Pencil 2 From ColorWare</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/macrumors-giveaway-win-a-custom-apple-pencil-2-from-colorware.2419025/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"59dcdb1e8c504b705793988dcba8793dbd7d4fbb87b2f06796dbc1758104b883","category":"Apple"}