{"title":"Regional and temporal variation in escape history of Norwegian farmed Atlantic salmon","link":"https://academic.oup.com/icesjms/article/81/1/119/7456025?rss=1","date":1701302400000,"content":"<span><div>Abstract</div>Each year thousands of farmed Atlantic salmon escape from seawater net pens, and introgression has been documented in a range of wild populations. Due to greater experience in the wild, escapees that have been on the run for a longer period, and successfully transitioned to a wild diet (classified: “early escapees”), could potentially have a higher spawning success and contribute more to introgression than those that have been on the run for a shorter period and/or have not transitioned to a wild diet (classified: “recent escapees”). This is the first study to examine how the escape history of farmed Atlantic salmon captured in multiple rivers and coastal fisheries, varies in time and space. During 2011–2021, adult farmed escaped salmon were captured in four rivers and at six coastal sites in Norway. The level of linoleic acid, a terrestrial fatty acid high in commercial salmon feeds but low in the natural diet of wild salmon, was used to classify the farmed salmon as early or recent escapees. We observed temporal declines in the relative proportions of escaped vs. wild salmon in the catches, and the relative proportion of early vs. recent escapees in the most southern river (driven by samples from 2011 to 2015). Overall, 14% of the escaped salmon caught in the period were classified as early escapees. The relative proportion of early escapees was lower in the two southernmost rivers (21.2% and 6.30%), as compared to the coastal fisheries (40.9%) and the northernmost river (77.6%). Both aquaculture–management regulations and production strategies have likely influenced these observations.</span>","author":"","siteTitle":"ICES Journal of Marine Science Current Issue","siteHash":"54f8cca1acc450a23f886e7003c55f387c2b0793320a665b1e27fbbf191461e5","entryHash":"59e08f4c436925e62d8c300ea83e34ec8dd929cdb282dd1632ac91d641dd363d","category":"Environment"}