{"title":"Archaeologists may have found ruins of fabled entrance to Zapotec underworld","link":"https://arstechnica.com/?p=1951723","date":1688594827000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>An archaeological research expedition has uncovered evidence of a legendary subterranean labyrinth under the ruins of Mitla in Oaxaca, Mexico, believed by the ancient Zapotecs to be an entrance to the underworld they called Lyobaa. </p></div>\n<p>In 1674, a priest named Francisco de Burgoa published his account of visiting the ruins of the <a href=\"https://en.wikipedia.org/wiki/Zapotec_peoples\">Zapotec</a> city of <a href=\"https://en.wikipedia.org/wiki/Mitla\">Mitla</a> in what is now <a href=\"https://en.wikipedia.org/wiki/Oaxaca\">Oaxaca</a> in southern Mexico. He described a vast underground temple with four interconnected chambers, the last of which featured a stone door leading into a deep cavern. The Zapotec believed this to be the entrance to the underworld known as Lyobaa (\"place of rest\"). Burgoa claimed that Spanish missionaries who explored the ruins sealed all entrances to the temple, and local lore has long held that the entrance lies under the main altar of a Catholic church built over the ruins.</p>\n<p>An international team of archaeologists <a href=\"https://www.arxproject.org/lyobaa\">recently announced</a> that they found evidence for this fabled underground labyrinth under the ruins—right where the legends said it should be—after conducting scans of the site using ground penetrating radar (GPR), electrical resistivity tomography (ERT), and seismic noise tomography (SNT).  The team also found evidence of an earlier construction stage of a palace located in another part of the site.</p>\n<p>Mitla is one of the most significant archaeological sites in Oaxaca Valley. It was an important religious center, serving as a sacred burial site—hence its name, which derives from Mictlan (\"place of the dead\" or \"underworld\"). The unique structures at Mitla feature impressively intricate mosaics and geometric designs on all the tombs, panels, friezes, and walls, made with small polished stone pieces fitted together without using mortar.</p></div><p><a href=\"https://arstechnica.com/?p=1951723#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1951723&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"59f80a6566cac4751adc789674735e79c20ecdddfa3f9d754144e3aca7b749a2","category":"Tech"}