{"title":"PSVII-30 Assessing writing and visual models as a pedagogical strategy for creating individual learning paths in animal nutrition","link":"https://academic.oup.com/jas/article/102/Supplement_3/819/7757628?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Self-directed learning harnesses intrinsic drive of students to create and preserve knowledge fostering comprehension of broader concepts and real-world applicability. Principles of animal nutrition, a required course in animal science curricula nationwide, is foundational to sustainable management of livestock and companion animals. Mastery of the principles governing nutrient digestion and metabolism is imperative as students progress into upper-level classes and pursue careers in the agriculture field. In this study, 304 students, enrolled in an upper-level animal nutrition class were invited to participate in an honors contract, entailing the completion of the “Explorer” project to earn honors credit. Throughout the semester, students (n = 27) researched a unique herbivore or omnivore, to create novel visual models illustrating nutrient digestion and metabolism (e.g., carbohydrates, lipids, proteins). We hypothesized that explaining these processes and models through writing would build confidence and proficiency in lecture material. The honors cohort convened weekly for 1 h sessions on campus; meetings offered scientific writing seminars, collaborative brainstorming activities, and project feedback. A Likert scale survey was generated and administered using Qualtrics software during the last weekly meeting to those who completed the “Explorer” project (88.8% response rate). Additionally, participating students completed a learning reflection addressing prompts regarding engagement, critical thinking, comparison with lecture writing assignments, and proposed design modifications. An open coding methodology was employed, utilizing MAXQDA Analytics Pro (Version 24.1.0) to analyze reflections qualitatively. Subsequently, the AI assist feature was used to enhance inter-coder reliability by generating summaries and sub-codes that aided in the exploration of common themes across reflections. Our analysis revealed that writing to learn in a nutrition course provided an authentic avenue for scientific expression, fostering skills such as communication, time management, research, comprehension of literature, and effective citation usage. Information gathering improved confidence in their ability to interpret and integrate concepts from lectures and external sources. Incorporating group activities and peer-reviews bolstered project efficacy, motivating students to revise, incorporate feedback, and consider alternative perspectives iteratively. Moreover, the learner-generated drawing enhanced critical thinking by encouraging students to dissect processes thoroughly. In conclusion, the combination of creating visual models alongside written explanations proved highly effective in simplifying complex nutritional concepts, facilitating deeper comprehension, and providing a high-impact learning experience. Future research should focus on peer teaching following similar writing activities to further improve student engagement and foster avenues for autonomy. Efforts should be made to encourage participation from a more diverse range of students that represent all backgrounds in animal science.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"59fcd36b6b8e4f579f0b6dd6a3c93534a625b1a6dd66ef9489c82109a2e6620c","category":"Environment"}