{"title":"Ecotoxicological Research on the Toxic Impact of Zinc Oxide and Silver Nanoparticles on Oreochromis mossambicus","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24365?af=R","date":1720585239000,"content":"<h2>ABSTRACT</h2>\n<p>Silver nanoparticles (AgNPs) and Zinc oxide nanoparticles (ZnONPs) have been widely used and are eventually been discharged into the natural aquatic ecosystem. The current study examined and correlated the toxicity of AgNPs and ZnONPs on the Mozambique tilapia, <i>Oreochromis mossambicus</i>. Lethal concentration (LC<sub>50</sub>) was determined with four different concentrations (0.05, 0.10, 0.15, and 0.20 mg/L) of AgNPs and ZnONPs; subsequently, the fishes were exposed to sublethal concentrations for a period of 21 days, and the oxidative stress and antioxidant and nonantioxidant parameters were studied. Results revealed oxidative stress evinced by increased lipid peroxidation (LPO) protein carbonyl activity (PCA), glutathione-S-transferase (GST), glutathione peroxidase (GPx), superoxide dismutase (SOD), catalase (CAT) activity, metallothionein (MT) activity, and reduced glutathione in chronic exposure compared with acute exposure. Nonspecific immunological characteristics such as lysozyme (LYZ), myeloperoxidase (MPO), and respiratory burst activity (RBA) were also noticed in the serum. Furthermore, severe histological damages including damages in telangiectasia and epithelial cell hyperplasia were found in the combined treated group with Ag and ZnONPs than in individual treatments. When Ag and ZnONPs were combined, a reduction in the accumulation of Ag was observed in the liver, which increased drastically in individual exposure. The current findings highlight the importance of taking into account the combined exposure and correlation of NPs, their bioavailability, and toxicity in the aquatic ecosystem.</p>","author":"Ashokkumar Sibiya, \nJeyaraj Jeyavani, \nDharmaraj Ramesh, \nSundaresan Bhavaniramya, \nBaskaralingam Vaseeharan","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"59fe49df16853ace53981a14aec1068cbc758149dbb72c902554b0efe84104cc","category":"Environment"}