{"title":"206 Evaluation of the effect of oral administration of bivalent VHH constructs in weaned piglets challenged with enterotoxigenic Escherichia coli F4+","link":"https://academic.oup.com/jas/article/102/Supplement_2/2/7664862?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Following the European restriction on the use of antibiotics and zinc oxide (ZnO) in livestock, the search for novel and sustainable strategies to reduce the incidence of enteric infections in piglets caused by <span>Escherichia coli</span> (colibacillosis) has increased. Among them, the ongoing development of bivalent V<sub>H</sub>H constructs designed to bind toxins and/or virulence factors of pathogens, appears to hold potential. The aim of this study was to evaluate the effect of in-feed administration of bivalent V<sub>H</sub>H constructs designed to bind to heat-labile enterotoxin (LT) and F4 fimbria of enterotoxigenic <span>E. coli</span> (ETEC) in orally challenged piglets. A total of 96, 21-d old, weaned piglets were assigned to three experimental diets: control diet (CTR); diet supplemented with 3,100 ppm ZnO (ZnO); or diet supplemented with 1.71 kg/MT bivalent V<sub>H</sub>H constructs (V<sub>H</sub>H). Animals on the V<sub>H</sub>H treatment also received an oral booster dose (15 mgּ pig<sup>-</sup>1ּ d<sup>-1</sup>) of the same product just before the challenge and one d later. Pigs were orally challenged with ETEC F4<sup>+</sup> (4.62×10<sup>9</sup> colony forming unit/animal), 1 wk after weaning (d 28). Data on growth, feed intake and clinical health signs of the animals were recorded throughout the 15 d of the study. On d 4 and 8 post inoculation (PI), fecal samples, digestive contents, and ileal scrapings were taken for microbiological plate counts of lactobacilli and ETEC in selective media. Ileal tissue samples were also taken for histomorphology. After the challenge, animals in the supplemented groups (ZnO and V<sub>H</sub>H) showed statistically greater growth rates than the CTR (28, 112 and 106 g/d (0-4 PI period) for CTR, ZnO and V<sub>H</sub>H, respectively, <span>P</span> = 0.018; Table 1). The experimental ZnO and V<sub>H</sub>H groups showed numerical reductions in the incidence of diarrhea at d 2 PI (60, 29 and 40 % for CTR, ZnO and V<sub>H</sub>H, <span>P</span> = 0.107), in agreement with reduced fecal ETEC counts also registered at d 8 PI in the V<sub>H</sub>H group compared with CTR (5.77 vs. 7.21 cfu/g, <span>P</span> = 0.046), and also greater lactobacilli/ETEC ratio (d 8 PI: 1.52 vs. 1.20, <span>P</span> = 0.071). Histomorphology of ileal samples showed significantly greater numbers of intraepithelial lymphocytes cells (IEL) with V<sub>H</sub>H supplementation compared with ZnO, with CTR showing intermediate values (8.06, 5.80 and 9.46 cell nº/villi for CTR, ZnO and V<sub>H</sub>H respectively, <span>P</span> = 0.045). The results from this study suggest that bivalent V<sub>H</sub>H constructs can reduce the negative effects of an oral ETEC F4<sup>+</sup> challenge through reducing their growth in the gut, improving intestinal mucosa architecture and function, and increasing piglet growth rate. With results similar to those observed in pigs supplemented with ZnO, bivalent V<sub>H</sub>H constructs appear as a promising alternative technology for the management of post-weaning colibacillosis.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5a16694f55dcefd2dbf153eaa268f1a240ed209e26e43ce750279e0814207dd8","category":"Environment"}