{"title":"Not-So-FineWoven iPhone Case 'Browning Like a Rotten Banana'","link":"https://www.macrumors.com/2024/02/26/finewoven-iphone-cases-brown-like-rotten-banana/","date":1708955781000,"content":"Apple's $59 FineWoven cases for iPhone 15 <a href=\"https://www.macrumors.com/2023/09/21/apples-finewoven-iphone-cases-poor-reviews/\">took heavy flak</a> when they were released last September for being subpar compared to the leather Apple cases they replaced. Now, <em>The Wall Street Journal</em> columnist Joanna Stern has distilled customers' ire by <a href=\"https://x.com/JoannaStern/status/1761072266639458745\">sharing</a> her own experience with the case after five months of use.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/finewoven-case-stern.jpeg\" width=\"3000\" height=\"1999\" /><div><em>Image credit: Joanna Stern</em></div>\r<br />\nFrom <a href=\"https://techthings.cmail20.com/t/d-e-eosyk-irijhkzjj-r/\">Stern's newsletter</a>:\r<br />\n<blockquote>There it is, everyone. My iPhone 15 Pro Max's FineWoven case after five months of use. The edges are peeling, the fabric is scratched up like an old CD and it's browning like a rotten banana. I've been waiting for the CDC to show up at my house to declare it a biomedical concern.\r<br />\nSome of you will say: \"JOANNA! How gross are you?\" Others—those who bought this case for $59 when it came out in September—will likely say: \"Yep. Same issues here.\"\r<br />\n\r<br />\n[...]\r<br />\n\r<br />\nEarly on, tech news sites like <a href=\"https://techthings.createsend1.com/t/d-l-eosyk-irijhkzjj-t/\">The Verge</a> complained about scratches in the fabric. At online retailers, the people who gave the case one or two stars all point out the same issues—peeling edges, scratches, proclivity to get dirty. <a href=\"https://techthings.createsend1.com/t/d-l-eosyk-irijhkzjj-i/\">On Best Buy</a>, many say they'll never buy an Apple case again and that it’s the worst product Apple's ever made. <a href=\"https://techthings.createsend1.com/t/d-l-eosyk-irijhkzjj-d/\">Same on Amazon</a>.\r<br />\n\r<br />\nAn Apple spokesman said that the company's cases are engineered at the highest standard to protect iPhones and that the FineWoven case's durable microtwill will protect an iPhone for years.</blockquote>An <a href=\"https://support.apple.com/en-us/HT204172\">Apple support document</a> offers advice about cleaning its FineWoven cases, but the section's small print admits that \"The material may look different and show wear over time as the fibers get compressed with normal use\" and that \"some scratches may diminish over time.\"\r<br />\n\r<br />\nResponding to Stern's five-month review, <em>Daring Fireball</em>'s John Gruber created <a href=\"https://twitter.com/gruber/status/1761517510111695133\">identical polls</a> across multiple social media platforms asking FineWoven case owners for their opinion, and respondents appear to have overwhelmingly voted in agreement that \"It's a piece of junk.\"\r<br />\n\r<br />\n<div><blockquote><p>If you own an Apple FineWoven iPhone case and have used it regularly for the last few months:<a href=\"https://t.co/4XQ7cu7nlB\">https://t.co/4XQ7cu7nlB</a></p>— John Gruber (@gruber) <a href=\"https://twitter.com/gruber/status/1761517510111695133\">February 24, 2024</a></blockquote> </div>\r<br />\nDespite the continued bad publicity almost six months on from the cases' debut, Apple still appears unwilling to admit that its leather alternative material is a letdown. But in the court of public opinion, all the evidence suggests this is an open and shut case: FineWoven is just bad. <div>Tag: <a href=\"https://www.macrumors.com/guide/finewoven/\">FineWoven</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/26/finewoven-iphone-cases-brown-like-rotten-banana/\">Not-So-FineWoven iPhone Case 'Browning Like a Rotten Banana'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/not-so-finewoven-iphone-case-browning-like-a-rotten-banana.2420436/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5a174009f37f82967b621e400dc6fb4250f5a03232ce674f480c23cc5a997fe3","category":"Apple"}