{"title":"Mangroves of Malaysia: a comprehensive review on ecosystem functions, services, restorations, and potential threats of climate change","link":"http://link.springer.com/10.1007/s10750-023-05431-z","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>Mangroves stand as unique blue-carbon ecosystems in intertidal tropical and subtropical coastal regions, renowned for their significant contributions to vital ecosystem services like coastal provisions and protection. Mangrove coverage in Malaysia ranks sixth globally, representing nearly 5% of the entire worldwide mangrove ecosystem. Despite the crucial role that mangroves play in Malaysia's ecosystem, a comprehensive review of their status, structures, functions, services, and restoration efforts, as well as their vulnerability to changing climates, has been lacking. Our review indicated that sediment carbon stocks in Malaysian mangrove forests span from 0.8 to 352 megagrams of carbon per hectare (hereafter referred to as Mg C ha<sup>−1</sup>). There has been an increasing research interest in ecosystem services, especially those related to mangrove ecotourism. Natural factors, coastal reclamations, and coastal pollution are considered to be the primary drivers of mangrove ecosystem degradation in Malaysia. Substantial restoration initiatives have been implemented in the country, involving assisted biotic restoration and the transplantation of mangrove seedlings into the restored sites. Mangroves confront impending climate change challenges, which encompass rising sea levels, increasing storms, climate warming, and coastal erosion. This study carries implications for the functioning of coastal ecosystems and provides valuable insights for coastal resource managers.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"5a1d3e32a347bffcdc379e9bfa988a2eac225d4c7c7a539d046742c6ce306e21","category":"Environment"}