{"title":"Rice powder template for hausmannite Mn<sub>3</sub>O<sub>4</sub> nanoparticles and its application to aqueous zinc ion battery","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305611","date":1718632800000,"content":"<p>by Nusrat Tazeen Tonu, Parbhej Ahamed, Mohammad Abu Yousuf</p>\r\n\r\nIn this study, a simple calcination route was adopted to prepare hausmannite Mn<sub>3</sub>O<sub>4</sub> nanoparticles using rice powder as soft bio-template. Prepared Mn<sub>3</sub>O<sub>4</sub> was characterized by Fourier Transform Infra-Red Spectroscopy (FTIR), Field Emission Scanning Electron Microscopy (FESEM), Energy Dispersive X-ray microanalysis (EDX), Powder X-Ray Diffraction (XRD), Transmission Electron Microscopy (TEM), Brunauer-Emmett-Teller (BET) and Solid state UV-Vis spectroscopic techniques. Mn-O stretching in tetrahedral site was confirmed by FTIR and Raman spectra. % of Mn and O content supported Mn<sub>3</sub>O<sub>4</sub> formation. The crystallinity and grain size was found to be 68.76% and 16.43 nm, respectively; tetragonal crystal system was also cleared by XRD. TEM clarified the planes of crystal formed which supported the XRD results and BET demonstrated mesoporous nature of prepared Mn<sub>3</sub>O<sub>4</sub> having low pore volume. Low optical band gap of 3.24 eV of prepared Mn<sub>3</sub>O<sub>4</sub> nanoparticles indicated semiconductor property and was used as cathode material to fabricate CR-2032 coin cell of Aqueous Rechargeable Zinc Ion Battery (ARZIB). A reversible cyclic voltammogram (CV) showed good zinc ion storage performance. Low cell resistance was confirmed by Electrochemical Impedance Spectroscopy (EIS). The coin cell delivered high specific discharge capacity of 240.75 mAhg<sup>-1</sup> at 0.1 Ag<sup>-1</sup> current density. The coulombic efficiency was found to be 99.98%. It also delivered excellent capacity retention 94.45% and 64.81% after 300 and 1000 charge-discharge cycles, respectively. This work offers a facile and cost effective approach for preparing cathode material of ARZIBs.","author":"Nusrat Tazeen Tonu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5a33bee3587daa12cf8b0c5d9a699ce320ec16b88410ba2983c32914639a914c","category":"Interdisciplinary"}