{"title":"Epidemiological and Clinical Characteristics of Hypertensive Obese Patients:\nAn Analysis of Obesity Subtypes","link":"https://www.preprints.org/manuscript/202409.0503/v1","date":1725608430000,"content":"Abstract \nIntroduction: Arterial hypertension and obesity are two major risk factors for cardiovascular morbidity and mortality closely linked. The objective of this study was to describe the epidemiological and clinical characteristics of hypertensive patients according to their level of obesity as proposed by the classification of the World Health Organization (WHO).                     \nPatients and Methods: Retrospective study (January 2022-April 2023) involving 230 hypertensive and obese adult patients whose mean age was 52.5 ± 12.05 years [Extremes: 24-85 years] followed on an outpatient basis and classified into 3 Classes according to their body mass index (BMI). Epidemiological, clinical parameters and cardiovascular risk stratification were analyzed. The relevance of the risk stratification method was analyzed by area under the curve (AUC). Statistical analysis was performed using SPPS version 26 software (SPSS Inc., Chicago, IL, USA). \nResults: Classes 1 (n=170; 73.9%), 2 (n=43; 18.7%) and 3 (n=17; 7.4%) were identified. There were significantly more women than men in Class 3 (9.7% versus 2.7%; p=0.001). The risk of being diabetic (OR=0.135;95%CI=0.034–0.541;p=0.005), of having angina pain (OR=0.084;95%CI=0.009–0.790;p=0.030) or developing chronic renal failure (OR=2.416;95%CI=1.471–85.268;p=0.020) was significantly higher in Class 3 than in Class 1. According to cardiovascular risk stratification, 152 patients (66.1%) were at high and very high risk. The level of cardiovascular risk of our patients was not related to the degree of obesity based on body mass index (p=0.32). The risk stratification method was relevant (AUC˃0.70;p˂0.001).                     \nConclusion: Morbid obesity exposes hypertensives more to cardiovascular, renal and metabolic complications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5a3407b7e7f6f76b66546f9369d260cb65584b91b5d0f16e86973d621ebdfcde","category":"Interdisciplinary"}