{"title":"Mophie's 3-in-1 Travel Charger With MagSafe Returns to Apple Store","link":"https://www.macrumors.com/2023/08/01/mophies-travel-charger-returns/","date":1690899694000,"content":"Mophie has resolved the <a href=\"https://www.macrumors.com/2023/07/18/mophies-travel-charger-pulled/\">intermittent charging issues</a> plaguing its 3-in-1 Travel Charger with <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a>, and the accessory is now once again available to purchase on <a href=\"https://www.apple.com/shop/product/HPTA2ZM/A/mophie-3-in-1-travel-charger-with-magsafe\">Apple</a> and <a href=\"https://www.jdoqocy.com/click-462641-10673346?url=https%3A%2F%2Fwww.zagg.com%2F3-in-1-travel-charger-magsafe-apple%3Fsku%3D401308654\">ZAGG's</a> websites. The accessory was removed from both storefronts in mid July following widespread reports from users unable to get their <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, AirPods, and Apple Watch to hold a charge on the device.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/mophie-charger-1.jpg\" alt width=\"2000\" height=\"1124\" />\r<br />\nAccording to a statement from Mophie, the company will send out a firmware update kit to all current owners of the Travel Charger within the next two weeks. If you do own the accessory, you should be receiving an email from Mophie soon with instructions on how to get the kit.\r<br />\n\r<br />\nIf you haven't heard from Mophie, you can email travelcharger@mophie.com and speak to Mophie's customer service. The kit is free and only one kit is needed regardless of how many Travel Chargers you own. The kit comprises one USB-C dongle that plugs into the USB-C port at the base of the charger and should take no longer than two minutes to update.\r<br />\n\r<br />\nTrouble with the Travel Charger began sometime in June, when users in Apple's discussions community and other forums began talking about charging issues with the accessory. Many users noticed that the device was not providing a consistent charge to anything sitting on it, be it an ‌iPhone‌, AirPods, or Apple Watch. Because of this, the Travel Charger was unavailable to purchase since mid July.\r<br />\n\r<br />\nNow that the problem has been addressed, you can purchase the accessory once again from Apple or ZAGG for $149.95.\r<br />\n\r<br />\n<em>(Thanks, Jens!)</em>\r<br />\n\r<br />\n<em><small>Note: MacRumors is an affiliate partner with ZAGG. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.</small></em><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/01/mophies-travel-charger-returns/\">Mophie's 3-in-1 Travel Charger With MagSafe Returns to Apple Store</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/mophies-3-in-1-travel-charger-with-magsafe-returns-to-apple-store.2397447/\">Discuss this article</a> in our forums<br /><br />","author":"Mitchel Broussard","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5a35b02d7e736c5169eeebe254ec93eee007abc829777972ef1d6a87a15a30b5","category":"Apple"}