{"title":"Association of frailty with adverse outcomes in surgically treated geriatric patients with hip fracture: A meta-analysis and trial sequential analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305706","date":1718978400000,"content":"<p>by Xiaomeng Dong, Xiuguo Zhang, Fang Hu, Shuhong Yang, Zengchao Hong, Qian Geng</p>\r\nObjective <p>Some studies have associated frailty and prognostic outcomes in geriatric hip fracture patients, but whether frailty can predict postoperative outcomes remains controversial. This review aims to assess the relationship between frailty and adverse postoperative outcomes in geriatric patients with hip fracture.</p> Methods <p>Based on electronic databases, including PubMed, Embase, Web of Science, Cumulative Index to Nursing and Allied Health Literature, the Cochrane Library, Chinese National Knowledge Infrastructure, and WanFang Data, we systematically searched for studies that investigated the association between frailty and adverse outcomes among patients aged 60 or over after hip fracture surgery. Stata 17.0 and Trial Sequential Analysis viewer software were used to obtain pooled estimates and verify whether the sample size was sufficient and the evidence robust.</p> Results <p>Twenty-one studies involving 49,196 patients were included for quantitative analysis. Compared with nonfrail patients, frail patients had a higher risk of inpatient mortality (risk ratio [RR] = 1.93, 95% confidence interval [CI]: 1.66–2.23), 30-day mortality (RR = 2.13, 95% CI: 1.23–3.70), and 1-year mortality (RR = 2.44, 95% CI: 1.47–4.04). Frailty can significantly predict postoperative complications (RR = 1.76, 95% CI: 1.38–2.23), including delirium, pneumonia, cardiac complications, urinary tract infection, and surgical site infection; the association between frailty and deep venous thrombosis/pulmonary embolism and acute kidney injury needs further analysis. Trial sequential analysis showed that the findings regarding mortality were reliable and robust.</p> Conclusion <p>This meta-analysis provides detailed information indicating that frailty is a substantial predictor of mortality and selected postoperative complications.</p>","author":"Xiaomeng Dong","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5a396392d88525158e4d52c7dd128bb56f0b7991ba4bc804d9dcbd2f2abbafd5","category":"Interdisciplinary"}