{"title":"Construction of the Collection and Billing Process through Process Mining and Business Intelligence. A Case Study of the Colombian Pharmaceutical Sector","link":"https://www.preprints.org/manuscript/202408.0818/v1","date":1723464120000,"content":"In most organizations there is an information system where data is recorded regarding events, activities, times, and variables associated with the execution of all organizational processes; this information is generally not used to its maximum potential, limited only to the registration of processes. With process mining, a field of engineering research, responsible for the design of processes through mining algorithms, it is possible to characterize bottlenecks, reprocessing, and opportunities for improvement in organizational processes. In this article, the construction of the collection and billing process is carried out in a case study of the Colombian Pharmaceutical sector supported by process mining and business intelligence. The objective of this research is oriented to the construction of the real process of a case study of the pharmaceutical sector in Colombia supported by the alpha mining algorithm, within the framework of process mining and business intelligence to facilitate decision-making at an organizational level. The result of this research is the proposal of a methodology to implement process mining in organizations in the pharmaceutical sector in Colombia supported by the Design Science Research (DSR) methodology and the construction of the real process in the billing and collection case study in the pharmaceutical sector supported by process mining, business intelligence is also used to complement the points of improvement of the accounting process in the case study. In conclusion, the artifact built in DSR shows a rigorous methodology from obtaining data, and types of documents that make up the knowledge base to proceeding to the application of the alpha mining algorithm that built the real billing and collection process of the case study, in which points of reprocessing and activities susceptible to improvements in the case study are evident. As a contribution, this article develops an alternative approach that contributes to the knowledge gap related to the actual construction of billing and collection processes in organizations, which generates an impact an alternative paradigm in the construction of organizational processes, by proposing a methodology that Builds a billing and collection process through process mining complemented by business intelligence","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5a406edb50ebb391515f0a134ea88fe43cc4bbb67b48c89c24212b9e5e0e1a32","category":"Interdisciplinary"}