{"title":"33 1-Carbon metabolism: Methionine and more","link":"https://academic.oup.com/jas/article/102/Supplement_2/16/7664931?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Methionine, via S-adenosylmethionine, has an important role in the post-translational methylation of Arg, Lys, and His in proteins, methylation of DNA and RNA, and methylation of serotonin (to melatonin), noradrenaline (to adrenaline), and guanidinoacetate (to creatine). After the methyl-group of Met is transferred to an acceptor, the resulting homocysteine can transfer its sulfur group to Ser yielding Cys. Homocysteine can also be remethylated back to Met in the so-called Met salvage pathway, which requires betaine or N<sup>5</sup>-methyl tetrahydrofolate (THF) as a 1-carbon donor. Methionine is, thus, not necessarily the dietary source of 1-carbon in methylation reactions. N<sup>5</sup>-methyl THF is one of the “1-carbon flavors” of THF and the catabolism of Ser, Gly, His, and formate (e.g., from Trp catabolism) results in the formation of 1-carbon metabolites linked to THF. These amino acids (and choline and betaine) are thus potential dietary sources of 1-carbon groups, of which only Ser and Gly can be synthesized de novo. In recent years, there has been an increased interest in the role of Ser and Gly in 1-carbon metabolism. Glycine has the unique property that it is able to accept and donate 1-carbon groups and the high concentration of Gly in plasma may be indicative for its 1-carbon buffering capacity. Glycine is also one of the few non-essential amino acids for which the retention (e.g., for collagen synthesis) largely exceeds the dietary intake. However, the de novo synthesis of Gly has been considered “a weak link in metabolism” because it is always associated with the synthesis of a 1-carbon group, and the capacity of the animal to dispose of excess 1-carbon groups may be limited. An excess supply of 1-carbon groups may therefore lead to a dietary requirement for Gly.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5a4407e46be66fb273df9bbf0a9565866ff0a2370f055de8d861bf00d6959705","category":"Environment"}