{"title":"Prenatal exposure to an environmentally relevant phthalate mixture alters serum cytokine levels and inflammatory markers in the F1 mouse ovary","link":"https://academic.oup.com/toxsci/article/201/1/26/7703278?rss=1","date":1719878400000,"content":"<span><div>Abstract</div>Phthalates are used as plasticizers and solvents in consumer products. Virtually 100% of the US population has measurable exposure levels to phthalates, however, the mechanisms by which prenatal exposure to phthalate mixtures affects reproductive health in the offspring remain unclear. Thus, this study tested the hypothesis that prenatal exposure to an environmentally relevant phthalate mixture promotes inflammation in F1 ovarian tissue. Pregnant CD-1 dams were dosed orally with vehicle control (corn oil) or phthalate mixture (20 μg/kg/d, 200 μg/kg/d, 200 mg/kg/d, 500 mg/kg/d). Pregnant dams delivered pups naturally and ovaries and sera from the F1 females were collected at postnatal day (PND) 21, PND 60, 3 mo, and 6 mo. Sera were used to measure levels of C-reactive protein (CRP). Ovaries and sera were used for cytokine array analysis. RNA was isolated from F1 ovaries and used to quantify expression of selected cytokine genes. Prenatal exposure to the mixture significantly increased the levels of CRP at 200 µg/kg/d on PND 21 compared with controls. The mixture altered 6 immune factors in sera at PND 21 and 33 immune factors in the ovary and sera at 6 mo compared with controls. The mixture increased ovarian expression of cytokines at PND 21 and decreased ovarian expression of cytokines at 6 mo compared with controls. These data suggest that prenatal exposure to a phthalate mixture interferes with the immune response in F1 female mice long after initial exposure.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"5a47a7e03079bb47742596ce9779d4f21839babfa5761b81c94a91db8ec07c08","category":"Environment"}