{"title":"Melatonin protects zebrafish pancreatic development and physiological rhythms from sodium propionate‐induced disturbances via the hypothalamic–pituitary–thyroid axis","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13565?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The widespread use of sodium propionate as a preservative in food may affect public health. We aimed to assess the effects of sodium propionate on circadian rhythms and pancreatic development in zebrafish and the possible underlying mechanisms.</p>\n<h2>RESULTS</h2>\n<p>In this experiment, we analyzed the relationship between circadian rhythms and pancreatic development and then revealed the role of the thyroid endocrine system in zebrafish. The results showed that sodium propionate interfered with the rhythmic behavior of zebrafish, and altered the expression of important rhythmic genes. Experimental data revealed that pancreatic morphology and developmental genes were altered after sodium propionate exposure. Additionally, thyroid hormone levels and key gene expression associated with the hypothalamic–pituitary–thyroid axis were significantly altered. Melatonin at a concentration of 1 μmol L<sup>−1</sup>, with a mild effect on zebrafish, observably alleviated sodium propionate-induced disturbances in circadian rhythms and pancreatic development, as well as regulating the thyroid system.</p>\n<h2>CONCLUSION</h2>\n<p>Melatonin, while modulating the thyroid system, significantly alleviates sodium propionate-induced circadian rhythm disturbances and pancreatic developmental disorders. We further revealed the deleterious effects of sodium propionate as well as the potential therapeutic effects of melatonin on circadian rhythm, pancreatic development and the thyroid system. © 2024 Society of Chemical Industry.</p>","author":"Yixin Xu, \nShuhui Zhang, \nYehua Bao, \nJialu Luan, \nZhenhua Fu, \nMingzhu Sun, \nXin Zhao, \nXizeng Feng","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"5a486ef5ad35d323f1974857a6227570b429b7026de07b06ac348ffa30b4103a","category":"Environment"}