{"title":"PSVI-17 Inclusion of glutathione precursor to diet of sows from d 114of lactation through to weaning d 21 improves serum hormone concentrations and piglet performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/321/7664973?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Glutathione (GSH) is a critical endogenous antioxidant found in all eukaryotic cells and has a critical role in maintaining redox homeostasis. Greater GSH concentrations protect cellular damage, tissue degeneration, and disease progression in various models but very limited study exists in swine model. Thus, we aimed to examine the effect of GSH supplementation on lactating sows and their suckling performance. From d 114 of lactation to 21 d of weaning, a total of 40 multiparous sows (Landrace x Yorkshire, parity 2.4) were assigned to one of four dietary treatments. The test treatments were: CON, a basal diet and a basal diet supplemented with 0.1%, 0.2%, and 0.3% GSH precursors. Experimental data (reproductive performance, growth performance, and blood profile) was analyzed by the general linear model (GLM) procedure with individual sow and their progenies as an experimental unit. Orthogonal polynomial regression was conducted to determine the linear and quadratic effects of 0.1%, 0.2%, and 0.3% GSH precursors in pigs. Piglets born to sows fed GSH precursors showed linearly increased body weight and total average daily gain (<span>P</span> &lt; 0.05) at the end of weaning d 21. Moreover, dietary GSH showed linearly increased (<span>P</span> &lt; 0.05) GSH and GSH/GSSG (oxidized glutathione) ratio in sow blood at the end of lactation d 14 and d 21. Whereas, at the end of weaning serum cortisol concentration of sows was significantly reduced by GSH precursor supplementation. In conclusion, adding 0.3% of GSH supplement to lactating sow diet would be beneficial to enhance the immune status and performance of both sows and their progenies respectively.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5a4ebfb1d2ea0c0be4c532cceb7852fc629d9e331579e829aa45dacdfee73d99","category":"Environment"}