{"title":"iOS 17 Lets You Create a Voice That Sounds Like You","link":"https://www.macrumors.com/2023/06/05/ios-17-personal-voice/","date":1686004666000,"content":"With the first <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> beta, Apple has introduced a new accessibility feature called Personal Voice. First highlighted <a href=\"https://www.macrumors.com/2023/05/17/ios-17-personal-voice-feature/\">earlier this year</a>, Personal Voice is designed to allow you to use artificial intelligence to create a replica of your voice.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/ios-17-personal-voice-1.jpg\" alt width=\"2000\" height=\"1299\" />\r<br />\nThe feature is aimed at those who are at risk of losing their ability to speak, with Personal Voice offering these individuals the chance to \"create a voice that sounds like them\" for communication purposes.\r<br />\n\r<br />\nPersonal Voice is available in the initial ‌iOS 17‌ beta, so developers can begin testing it right away. It can be found under Accessibility &gt; Personal Voice. Creating a Personal Voice is process that takes around an hour. Recording requires a quiet place with little to no background noise, with Apple instructing users to speak naturally at a consistent volume while holding the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> approximately six inches from the face.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/ios-17-personal-voice-2.jpg\" alt width=\"2000\" height=\"1299\" />\r<br />\nIf there is too much background noise in your location, Apple will warn you that you need to find a quieter place to record.\r<br />\n\r<br />\nPersonal Voice requires you to read a series of sentences aloud, after which your ‌iPhone‌ will generate and store your Personal Voice. The Personal Voice can then be used with the Live Speech feature, which allows users to type-to-speak in <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>, the Phone app, and other communication apps.\r<br />\n\r<br />\nPersonal Voice will be available to the general public when Apple releases the first public beta of ‌iOS 17‌. Apple has said that ‌iOS 17‌ will be available to public beta testers next month.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/05/ios-17-personal-voice/\">iOS 17 Lets You Create a Voice That Sounds Like You</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-lets-you-create-a-voice-that-sounds-like-you.2391735/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5a5a6ebde230eec158303ba5ddd7e27df61ff14c33d8bebeae6bec7c6af38e33","category":"Apple"}