{"title":"How to use your Mac to snap pictures or scan documents with your iPhone or iPad","link":"https://www.macworld.com/article/357363/how-to-use-your-mac-to-snap-pictures-or-scan-documents-with-your-iphone-or-ipad.html","date":1632733200000,"content":"<div>\n<section><div></div></section><p>If you’re like me, you are constantly trying to bridge the gap between paper and digital documents. While I’ve managed to decrease the amount of paper that comes in, it’s not zero, and often government agencies, medical offices, and my children’s schools are insistent on having forms that must be filled out “by hand.”</p>\n\n\n\n<p>Your iPhone is often the best camera you have with you, and it’s also the best scanner for your Mac. You can perform powerful tricks in transforming paper to bits with your iPhone by itself, using software like Adobe Scan, JotNot Pro, PDFPen, or Evernote—or even Apple’s Notes app.</p>\n\n\n\n<p>But you can save a step and use a bigger screen for editing and other tasks by selecting an option you might not have known existed. It’s easiest to demonstrate in the built-in Preview app. Launch Preview and choose <em>File &gt; Import from iPhone &gt; Take Photo</em> or <em>Scan Documents</em>. The two options differ significantly:</p>\n\n\n\n<ul><li><strong>Take Photo</strong> lets you capture a single image. After you tap the shutter button, you have the options Retake and Use Photo. If you select the latter, the photo is transferred to your Mac and opened in Preview.</li><li><strong>Scan Documents</strong> recognizes rectangles that appear to be paper documents or photographs, and works best when capturing these against a high-contrast backdrop. Your iPhone or iPad will capture images continuously as it finds paper boundaries until you tap Save. The set of images is loaded by Preview as a single document best saved as a PDF.</li></ul><p>You’ll find this feature in a host of Apple apps and some third-party apps that tap into the same system-level feature. This includes Messages, the iWork suit of Keynote, Numbers, and Pages, and Mail.</p>\n\n\n\n<p>Apple leans on Continuity for this feature, so your iPhone (or iPad) has to be logged into the same iCloud account, and both your Mac and the mobile device must have both Bluetooth and Wi-Fi enabled.</p>\n\n\n\n<p>Starting with the upcoming macOS Monterey, you’ll get the added advantage that any image or images brought into Preview and many other Apple programs <a href=\"https://www.macworld.com/article/351669/macos-monterey-how-to-live-text-look-up-photos-quick-look-safari.html\">will automatically recognize text</a> within the image and let you select and copy it.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5a775e0050f0406418f11e9ea73575f308676a922d8d2803ad92bf0fb30ecd27","category":"Apple"}