{"title":"AirPower prototype reveals mysteries behind Apple’s failed charging mat","link":"https://www.macworld.com/article/352748/airpower-prototype-reveals-mysteries-behind-apples-failed-charging-mat.html","date":1628257655000,"content":"<div>\n<section><div></div></section><p>AirPower has been something of a mythical beast since Apple first teased its existence at the iPhone X launch event in September 2017. Even after <a href=\"https://www.macworld.com/article/230469/apple-airpower-features-specs-price-faq.html\">Apple canceled the innovative tri-charging mat in March 2019</a>, rumors have persisted of its ongoing development at Apple, with <a href=\"https://www.macworld.com/article/348015/apple-ipad-ipad-mini-ipad-pro-bezels-home-button-wireless-charging-airpower.html\">Bloomberg reporting as recently as June</a> that Apple hasn’t abandoned the project.</p>\n\n\n\n<p>Now we may have our first look at the AirPower in the wild. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/1nsane_dev/status/1423277245381054472&amp;xcust=1-1-352748-1-0-0&amp;sref=https://www.macworld.com/feed\">Italian Twitter user Giulio Zompetti</a> has posted a video of the charging mat in action after securing a prototype from a Chinese e-waste supplier. The unit is far from a final product and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2021/8/5/22611234/apple-airpower-wireless-charger-working-prototype&amp;xcust=1-1-352748-1-0-0&amp;sref=https://www.macworld.com/feed\">Zompetti told The Verge</a> that it “lacks all of its exterior housing.” However, he says the dearth of refinement shows off the “beautiful and heavy stainless steel chassis.”</p>\n\n\n\n<figure><div>\n<blockquote><p>AirPower <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/bv8gi0NiiL&amp;xcust=1-1-352748-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/bv8gi0NiiL</a></p>— Giulio Zompetti (@1nsane_dev) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/1nsane_dev/status/1423277245381054472?ref_src=twsrc%5Etfw&amp;xcust=1-1-352748-1-0-0&amp;sref=https://www.macworld.com/feed\">August 5, 2021</a></blockquote></div></figure><p>After some fiddling, Zompetti was able to get it in working order, but it only charged other prototype devices. As he explains, it’s an engineering prototype, so “not meant for plug and play” like Apple’s other devices. As Zompetti told The Verge, “When I connected my serial lightning cable to it, I could see some chars on the log, so once I fixed the BAUD rate, I was able to read a comprehensible log.” From there, he was able to get two prototype devices to change simultaneously, complete with Apple’s charging animation.</p>\n\n\n\n<p>Apple canceled the AirPower charging mat in 2019 after being unable to “achieve our high standards” with its development. Rumors suggested that Apple struggled to solve heating issues with close proximity of the device’s charging coils. For what it’s worth, Zompetti said he “wasn’t able to reproduce the issue” with overheating.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/airpower-apple.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<p>Apple has since released the magnetic MagSafe charging mechanism for the iPhone 12 but has yet to develop technology like what was promised in AirPower. Apple’s main selling point was “a generous active charging area” that let you place numerous devices anywhere on a mat to charge them. Other manufacturers have made <a href=\"https://www.macworld.com/article/234636/nomad-base-station-pro-review.html\">pseudo-copycat charging pads</a> that can charge three devices at once, but none are able to charge the Apple Watch, as AirPower was supposed to do.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5a8fc39b389feea68159395e893c4d7ae7f5b76b23b1a54d60693fec21029a00","category":"Apple"}