{"title":"Characterizing fuel flammability in a tropical dry community forest in Eastern India using laboratory and remote sensing based approaches","link":"http://link.springer.com/10.1007/s42965-023-00309-6","date":1725148800000,"content":"<h3>Abstract</h3>\n                    <p>Characterizing forest fuel properties in terms of their distribution and flammability behaviour offers useful information for effective fire management. Satellite images provide synoptic images capturing the vegetation state and their change including burn area loss, enabling stratification, and narrowing down the search for further investigation on ground or laboratory. The study investigated the flammability of various forest fuels including sal, teak, bamboo and grass species, by analysing different fuel variables such as moisture content (MC), volatile matter (VM), ash content (AC), fixed carbon (FC), higher heating value (HHV) and minimum ignition temperature (MIT), and exploring the intrinsic relationships between and among them. The teak wood showed low MC (5.08%), high VM (81.91%), low AC (1.1%), high HHV (19.93 MJ/kg), high CF (93.82) indicating high sustainability, combustibility and consumability characteristics. Teak indicated higher flammability characteristics compared to sal, while grass indicated higher sustainability and combustibility characteristics compared to bamboo. Overall woody species (sal and teak) indicated high ignitability and sustainability characteristics over grass and bamboo. Among the plant components, leaves indicated high ignitability, wood indicated high sustainability, combustibility and consumability, and barks indicated low flammability characteristics. This study registers a maiden and early attempt using satellite and laboratory-based analysis to characterize the flammability properties of dominant species of tropical dry forests in eastern India.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"5a90e2799988462d988fff9b5068baa44790fe57ac4406fda4bfd54d379741c2","category":"Environment"}