{"title":"Influence of contrasting cultivation altitudes on the physicochemical, digestive, and functional properties of four Musa starches produced in Cameroon","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.12651?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Bananas and plantains are important food sources for many people in the world. Their high starch content places them among the highest energy providers. This study aimed to determine the effects of altitude on banana starch properties in Cameroon. A dessert banana, a cooking banana, a plantain cultivar, and a plantain-like hybrid were grown at low and high altitudes (respectively at 80 m and 1300 m above sea level).</p>\n<h2>RESULTS</h2>\n<p>Starch analyses showed an increase in moisture and pH values against a drop in total titratable acidity and dry matter content with respect to altitude. Amylose content, as well as water absorption capacity, oil absorption capacity and syneresis of high-altitude plantain and plantain-like hybrid, were significantly higher. Starch digestibility was low and ranged between 13.4% and 37.9% after 2 h of incubation. High-altitude plantain starches contained more amylose and were more resistant to enzymatic hydrolysis.</p>\n<h2>CONCLUSION</h2>\n<p>Starches from CARBAP K74 and Kelong mekintu, grown at high altitude, showed good water and oil absorption capacities, low digestibility, and high resistance. The adequate properties of these banana starches predispose them for use as thickeners and gelling agents as well as ingredients for the formulation of low-calorie foods. This study highlights the importance of altitude when discussing banana and plantain starch properties. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Gérard Ngoh Newilah, \nPascal Wambo, \nCédric Kendine Vepowo, \nAnnie Takam Ngouno, \nSolange Ulrich Manjia Ngoungoure, \nJonas Tembe Tembe, \nMama Nkouandou, \nEric Ngombi Ngombi, \nElie Fokou, \nFrançois‐Xavier Etoa, \nDominique Dufour","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"5a9367ae1e752fee39fb9f54ded3b42e387bfe9f97225f42edc2b266f6c40169","category":"Environment"}