{"title":"Cryo-EM structure of HQNO-bound alternative complex III from the anoxygenic phototrophic bacterium Chloroflexus aurantiacus","link":"https://academic.oup.com/plcell/article/36/10/4212/7595673?rss=1","date":1706659200000,"content":"<span><div>Abstract</div>Alternative complex III (ACIII) couples quinol oxidation and electron acceptor reduction with potential transmembrane proton translocation. It is compositionally and structurally different from the cytochrome <span>bc</span><sub>1</sub>/<span>b</span><sub>6</sub><span>f</span> complexes but functionally replaces these enzymes in the photosynthetic and/or respiratory electron transport chains (ETCs) of many bacteria. However, the true compositions and architectures of ACIIIs remain unclear, as do their structural and functional relevance in mediating the ETCs. We here determined cryogenic electron microscopy structures of photosynthetic ACIII isolated from <span>Chloroflexus aurantiacus</span> (<span>Ca</span>ACIIIp), in apo-form and in complexed form bound to a menadiol analog 2-heptyl-4-hydroxyquinoline-N-oxide. Besides 6 canonical subunits (ActABCDEF), the structures revealed conformations of 2 previously unresolved subunits, ActG and I, which contributed to the complex stability. We also elucidated the structural basis of menaquinol oxidation and subsequent electron transfer along the [3Fe–4S]-6 hemes wire to its periplasmic electron acceptors, using electron paramagnetic resonance, spectroelectrochemistry, enzymatic analyses, and molecular dynamics simulations. A unique insertion loop in ActE was shown to function in determining the binding specificity of <span>Ca</span>ACIIIp for downstream electron acceptors. This study broadens our understanding of the structural diversity and molecular evolution of ACIIIs, enabling further investigation of the (mena)quinol oxidoreductases–evolved coupling mechanism in bacterial energy conservation.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"5a96955ec0fcde4f83f7b7ebbf98a2dc31a1a3d06358c5e8fcad7b9821fbd29e","category":"Environment"}