{"title":"Implementing Ethical Procurement Standards: Experiences and Challenges in Different Sectors","link":"https://www.preprints.org/manuscript/202407.0615/v1","date":1720432059000,"content":"Implementing ethical procurement standards is increasingly recognized as pivotal for organizations aiming to align their practices with principles of social responsibility and sustainability. This qualitative research explores the experiences, challenges, strategies, and impacts associated with ethical procurement across diverse sectors. Motivations for adopting ethical procurement include enhancing corporate reputation, meeting stakeholder expectations, and complying with regulatory frameworks. However, organizations face significant challenges such as balancing ethical considerations with cost-efficiency pressures, navigating complex regulatory landscapes, and ensuring transparency across global supply chains. Strategies for overcoming these challenges emphasize effective supplier relationship management, leveraging technological innovations for transparency, and investing in supplier capacity-building. The study reveals that ethical procurement practices contribute to organizational resilience by improving risk management, enhancing stakeholder engagement, and fostering innovation in procurement processes. Moreover, ethical procurement supports sustainable development goals by promoting environmental sustainability, supporting social equity through fair labor practices, and contributing to economic development. Future research directions include exploring the impact of emerging technologies on ethical procurement, promoting global collaboration for unified standards, and evaluating the long-term sustainability of ethical procurement initiatives.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5aa7dd25274b63fac23d0df279e4d1b119c058ceaf44e24c40566ca6c3473706","category":"Interdisciplinary"}