{"title":"Putting theory to the test: An integrated computational/experimental chemostat model of the tragedy of the commons","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300887","date":1712757600000,"content":"<p>by Bryan K. Lynn, Patrick De Leenheer, Martin Schuster</p>\r\n\r\nCooperation via shared public goods is ubiquitous in nature, however, noncontributing social cheaters can exploit the public goods provided by cooperating individuals to gain a fitness advantage. Theory predicts that this dynamic can cause a Tragedy of the Commons, and in particular, a ‘Collapsing’ Tragedy defined as the extinction of the entire population if the public good is essential. However, there is little empirical evidence of the Collapsing Tragedy in evolutionary biology. Here, we experimentally demonstrate this outcome in a microbial model system, the public good-producing bacterium <i>Pseudomonas aeruginosa</i> grown in a continuous-culture chemostat. In a growth medium that requires extracellular protein digestion, we find that <i>P</i>. <i>aeruginosa</i> populations maintain a high density when entirely composed of cooperating, protease-producing cells but completely collapse when non-producing cheater cells are introduced. We formulate a mechanistic mathematical model that recapitulates experimental observations and suggests key parameters, such as the dilution rate and the cost of public good production, that define the stability of cooperative behavior. We combine model prediction with experimental validation to explain striking differences in the long-term cheater trajectories of replicate cocultures through mutational events that increase cheater fitness. Taken together, our integrated empirical and theoretical approach validates and parametrizes the Collapsing Tragedy in a microbial population, and provides a quantitative, mechanistic framework for generating testable predictions of social behavior.","author":"Bryan K. Lynn","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5ab09c36611398fbcc09951f0f8bb25259416e110652ad96b7243a821049750f","category":"Interdisciplinary"}