{"title":"U.K. Abandons, for Now, Legislation That Would Have Banned End-to-End Encryption","link":"https://www.ft.com/content/770e58b1-a299-4b7b-a129-bded8649a43b","date":1694019378000,"content":"\n<p>Cristina Criddle, Anna Gross, and John Aglionby, reporting from London for The Financial Times (<a href=\"https://twitter.com/OpenRightsGroup/status/1699450898680873364\">paywall-circumventing Twitter link</a>):</p>\n\n<blockquote>\n  <p>The UK government has conceded it will not use controversial\npowers in the online safety bill to scan messaging apps for\nharmful content until it is “technically feasible” to do so,\npostponing measures that critics say threaten users’ privacy.</p>\n\n<p>In a statement to the House of Lords on Wednesday afternoon,\njunior arts and heritage minister Lord Stephen Parkinson sought to\nmark an eleventh-hour effort to end a stand-off with tech\ncompanies, including WhatsApp, that have threatened to pull their\nservices from the UK over what they claimed was an intolerable\nthreat to millions of users’ privacy and security.</p>\n\n<p>Parkinson said that Ofcom, the tech regulator, would only require\ncompanies to scan their networks when a technology is developed\nthat is capable of doing so. Many security experts believe it\ncould be years before any such technology is developed, if ever.</p>\n</blockquote>\n\n<p><em>No, Thursday’s out. How about never — <a href=\"https://www.newyorker.com/cartoons/bob-mankoff/the-story-of-how-about-never\">is never good for you</a>?</em></p>\n\n<blockquote>\n  <p>WhatsApp, owned by Facebook’s parent Meta, and Signal, another\npopular encrypted messaging app, are among those that have\nthreatened to exit the UK market should they be ordered to weaken\nencryption, a widely used security technology that allows only\nthe sender and recipient of messages to view a message’s\ncontents. [...]</p>\n\n<p>Officials have privately acknowledged to tech companies that there\nis no current technology able to scan end-to-end encrypted\nmessages that would not also undermine users’ privacy, according\nto several people briefed on the government’s thinking.</p>\n</blockquote>\n\n<p>This isn’t the worst reporting on encryption and lawmakers’ fantasies about “backdoors only accessible by the good guys”, but it’s fundamentally misleading. End-to-end encryption’s meaning is right there in its name. There’s no dial that can be adjusted from “weak” to “strong”. There’s no option for content inspection between end points. It’s not about choosing not to allow eavesdroppers, it’s about implementing protocols where it’s technically impossible to inspect content between sender and receiver.</p>\n\n<p>The actual math is far more complex, but ultimately this boils down to the U.K. acknowledging that 2 + 2 can only equal 4.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/09/06/uk-encryption-win\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"5abaeb2496b121828476b38cf98ea450c9b6e52a07936a85b70b196eced89b19","category":"Tech"}