{"title":"Race history: Diot outsprints Muller to claim Paris-Brest-Paris in 1951","link":"https://www.cyclist.co.uk/in-depth/diot-paris-brest-paris-1951","date":1698765722000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/diot-paris-brest-paris-1951\">Race history: Diot outsprints Muller to claim Paris-Brest-Paris in 1951</a></p>\n\n<p>It was in the Paris suburb of Trappes, with 1,160km already in his legs, that disaster struck Édouard Muller.</p>\n\n\n\n<p>The date was 9th September 1951 and the 32-year-old Frenchman had been at the head of the Paris-Brest-Paris Classic alongside compatriot Maurice Diot for the past 300km. Along with another Frenchman, Charles Joly, the two men had hit the front of the race at Vitré in the Ille-et-Vilaine department of Brittany. They had worked together well, getting the necessary gap and then measuring their efforts, salvaging what strength they had left, ready for the final act in this epic tale.</p>\n\n\n\n<p>When Joly finally fell away with around 100km to go, Diot and Muller became inextricably locked, riding on in tandem until the very end of their ordeal. But now, racing through the outer reaches of France’s capital city bound for the finish at the Parc des Princes track, just 22km away, Muller felt his rear tyre puncture.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/il-lombardia-history\">Remembering the first Il Lombardia in 1905</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/elsy-jacobs-cyclist\">Race history: Jacobs secures a historic rainbow jersey in 1958</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/nicole-cooke-cyclist\">Pro race history: Nicole Cooke tames Mont Ventoux</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>As Muller dismounted and mechanics rushed to his aid, so Diot was left alone at the front of the race. There was no other rider within striking distance; all Diot had to do was carry on at the same pace and a notable solo victory was in the bag. But that wasn’t in this race’s script. Instead, as reported in the next day’s <em>Le Miroir des Sports</em>, ‘Left alone at the front, Maurice Diot slowed down.’</p>\n\n\n\n<p>Soon, a relieved Muller was back on Diot’s wheel. Perhaps there was a small nod of understanding and appreciation between the two men as they again joined forces and picked up the pace, readying themselves for the now inevitable sprint.</p>\n\n\n\n<p>The two men raced into the Parc des Princes, and in front of the packed stands Diot made his bid for glory, coming off the final bend while Muller hesitated, seemingly trying to force a track-like sprint. It was to prove a mistake, with Diot narrowly prevailing on the line. Watch the film of the sprint and you can see that Muller appears to stop pedalling in the final metres, presumably resigned to his fate.</p>\n\n\n\n<p>‘Diot clearly won after profiting from a tactical error made by the reputedly quick Muller,’ reported <em>Le Miroir des Sports</em>. ‘Riding 51×14 Muller “stopped” the sprint instead of launching his big effort and Diot, quicker, with a thrust like [seven-time World Champion track sprinter Jef] Scherens, got ahead of him by half a length on the line.’</p>\n\n\n\n<p>Following the race the two men embraced in front of the cameras.</p>\n\n\n\n<p>‘After a 300km breakaway in which we united our efforts it would not have been right to have profited from a puncture and abandoned him to his fate,’ Diot said. ‘I believe my victory won “normally” is more beautiful.’</p>\n\n\n\n<p>Not that anyone knew it at the time, but Maurice Diot had just entered the history books as the winner of the last Paris-Brest-Paris.</p>\n\n\n\n<h2>School of suffering</h2>\n\n\n\n<p>That final sprint had come a little less than 39 hours after the 34 riders of the 1951 Paris-Brest-Paris had rolled out from the Rue du Commandant-Guilbaud at midnight and into the gloom of the Parisian night. A glance at the race summary later published by <em>Le Miroir des Sports</em> highlights that what followed was no ordinary race. Solo moves came from Maurice Bertrand, Robert Chapatte and Pierre Brambilla before the final selection. Nothing strange there, perhaps, but it is the length of those efforts – 130km, 150km, 215km and 325km respectively – that makes for startling reading.</p>\n\n\n\n<p>‘Paris-Brest-Paris is the school of suffering,’ Diot said after his historic victory. ‘Compared to this trial, others seem gentle.’</p>\n\n\n\n<p>Diot’s win came 60 years after the inaugural event. In 1891, inspired by the success of the first Bordeaux-Paris race – 570km long and won by Britain’s George Pilkington Mills – Pierre Giffard of <em>Le Petit Journal</em> quickly announced an even tougher test.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"970\" height=\"347\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-300x107.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-768x275.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1536x550.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-750x269.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1140x408.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4.jpg 1818w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p>‘<em>La Course du Petit Journal: de Paris a Brest et retour: 1,200 kilomètres</em>,’ ran the headline of the front-page story he published on 11th June 1891. ‘Mills and his comrades have shown the absolute speed the machine of the future, the little bicycle, can offer at the feet of man,’ Giffard wrote. ‘I dream of a more conclusive test, more French to be honest, an event where absolute speed would not be everything… where intelligence, wisdom, prudence and skill would also count.’</p>\n\n\n\n<p>That first Paris-Brest-Paris would be a race for French nationals only, open to both amateurs and professionals, who had to finish on the same machine as they started. Giffard whipped up interest via a series of articles, illustrated with drawings of heroic cyclists suffering in wind and rain, searching for food and a bed, before returning to Paris and toasting their achievement.</p>\n\n\n\n<p>More than 200 riders started the race on the morning of 6th September 1891, sent on their way by military bands as they passed the great monuments of Paris. The winner, Charles Terront, rolled back into the capital a little under 72 hours later, having not slept.</p>\n\n\n\n<p>The race had enthralled those who had poured from their homes in the dead of night to watch these pioneering souls tear through the towns and villages of northwest France, captivated by the hyperbolic accounts of <em>Le Petit Journal</em>’s breathless reports.</p>\n\n\n\n<p>The race was a success, but such was its scale that it would only be held every ten years. Maurice Garin won the second edition in 1901, while Emile Georget triumphed in 1911, later admitting he had fallen asleep on the road. Indeed, sleep would become a recurring theme for those that raced the event.</p>\n\n\n\n<p>‘It’s not the distance that scares me,’ Belgian cyclist Emile Joly said in 1931. ‘It’s sleep. Sacred sleep.’</p>\n\n\n\n<p>Meanwhile that year’s winner, Hubert Opperman, later recalled in an interview with <em>Sporting Cyclist</em> that, ‘It’s on that second night that you really learn what fluctuation of energy is… that you find yourself becoming colder, when, in fact, it’s not really colder.’</p>\n\n\n\n<p>After Diot’s popular win in 1951, organisers considered holding the race every five years, only to fail to persuade enough professionals to ride. A 1961 edition was scheduled but times had changed. Riders had any number of lucrative and prestigious races to target and couldn’t afford to structure a whole season gambling on such a huge undertaking. And so, after just seven editions, the professional event folded. Today Paris-Brest-Paris lives on as a prestigious <em>randonnée</em>.</p>\n\n\n\n<p><strong>• This article originally appeared in issue 144 of <em>Cyclist </em>magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/diot-paris-brest-paris-1951\">Race history: Diot outsprints Muller to claim Paris-Brest-Paris in 1951</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"5ac18dceb67bb2f8dae547413b586ead06d3ecc073396849eeec8bd51f835e48","category":"Cycling"}