{"title":"iFixit แกะ iPhone 15 Pro Max แล้ว ด้านในเปลี่ยนแปลงไม่มาก เปิดจากกระจกฝาหลังได้แล้ว","link":"https://www.blognone.com/node/135930","date":1695686379000,"content":"<div><div><div><p>iFixit แกะ iPhone 15 Pro Max เป็นที่เรียบร้อยแล้ว การเปลี่ยนแปลงสำคัญในแง่ซ่อมแซมคือโครงที่ออกแบบใหม่ ทำให้สามารถเปิดได้ 2 ด้าน นั่นคือเพิ่มการเปิดจากกระจกด้านหลัง<a href=\"https://www.blognone.com/node/130494\">แบบเดียวกับ iPhone 14 และ iPhone 14 Plus</a> เมื่อปีที่แล้ว</p>\n<p>ชิ้นส่วนอื่นที่พบในการแกะ แบตเตอรี่ iPhone 15 Pro Max อยู่ที่ 4422 mAh เพิ่มขึ้น 2.3% จาก iPhone 14 Pro Max เช่นเดียวกับ iPhone 15 Pro ที่เพิ่มขึ้น 2.3% จาก iPhone 14 Pro เป็น 3274 mAh ซึ่ง iFixit มองว่าเพิ่มมาน้อยไปเมื่อเทียบกับชิป A17 Pro ที่ดูใช้พลังงานมากขึ้น</p>\n<p>ส่วนของกล้อง iFixit พบว่าเลนส์เทเลเป็นส่วนที่เปลี่ยนแปลงชัดเจน เพื่อรองรับการซูมออปติคัล 3x และ 5x ขณะที่เลนส์หลักและเลนส์อัลตร้าไวด์เหมือนเดิม การปรับปรุงเรื่องถ่ายภาพจึงน่าจะเป็นการทำงานของชิป A17 Pro และส่วนซอฟต์แวร์กล้องมากกว่า สุดท้ายเป็นเมนบอร์ดที่ใช้การออกแบบเหมือนรุ่นเดิม รวมถึงใช้โมเด็ม Snapdragon X70 ของ Qualcomm</p>\n<p>iFixit ให้คะแนนซ่อมแซมทุกรุ่นในตระกูล iPhone 15 รวมถึง iPhone 15 และ iPhone 15 Plus ที่ <strong>4 เต็ม 10</strong> ซึ่งเท่ากับ<a href=\"https://www.blognone.com/node/135839\">คะแนนปรับลด</a>ของ iPhone 14 ก่อนหน้านี้ จากเหตุผลเดียวกันคือมีคู่มือ มีชิ้นส่วนให้เปลี่ยน แต่การยืนยันอะไหล่กับระบบมีความยุ่งยากซับซ้อน</p>\n<p>ที่มา: <a href=\"https://www.ifixit.com/News/82867/iphone-15-teardown-reveals-software-lockdown\">iFixit</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0c71d8f78aad2f8878e187c2b406c9ca.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ifixit\">iFixit</a></div><div><a href=\"/topics/iphone-15-pro\">iPhone 15 Pro</a></div><div><a href=\"/topics/iphone-15\">iPhone 15</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5ac55c39973f892288a986bb98d849a3c265b52a0e057a55db98e72e4f20ce32","category":"Thai"}