{"title":"Evaluating the cost and operational context for national human papillomavirus (HPV) vaccine delivery in three regions of Ethiopia","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003357","date":1721052000000,"content":"<p>by Mercy Mvundura, Amare Bayeh, Meseret Zelalem, Yohannes Lakew, Adugna Dhufera, Belayneh Dagnew, Rose Slavkovsky, D. Scott Lamontagne</p>\r\n\r\nCervical cancer is the second leading cause of cancer deaths among women in Ethiopia. Human papillomavirus (HPV) vaccination is a primary prevention method for cervical cancer and was introduced in Ethiopia in 2018. We conducted a cross-sectional, mixed-methods study to understand the operational context for the HPV vaccination program and the associated costs in three regions of Ethiopia. Operations research provided insights on the frequency and intensity with which HPV vaccination program activities were done, focusing on activities conducted to vaccinate the cohort receiving its first dose in October 2019 and second dose in January 2021. Microcosting was used to estimate the costs to the health system for these activities. Data collection using structured questionnaires was done at 60 health facilities, 17 woredas, and 9 zones/sub-cities that were randomly selected from three purposively selected regions and the national level. Financial costs (monetary outlays) and economic costs (financial costs plus opportunity costs of resource use) were estimated in 2019 US$. Health facilities delivered an average of 411 HPV vaccine doses during the reference period, ranging from a mean of 86 to 606 across the three regions. Aggregated across all levels of the health system, the estimated financial cost per dose across the pooled sample was $2.23, and the economic cost per dose was $7.19, excluding the cost of vaccines and supplies. There were regional variations in these estimates, with mean financial cost per dose ranging from $1.17 to $7.18 and mean economic cost per dose ranging from $5.80 to $18.13 across the three regions. Regional variations exist in the service volume, frequency, and intensity of conducting HPV vaccination activities, as reflected in the estimated costs of delivery. Data generated from this study can be used to inform program planning and budgeting, taking into account regional variations, for effective utilization of resources.","author":"Mercy Mvundura","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"5ac59f7f0d33cc2abfc292516d9fc486f8a36d9dcf0d129b8ec49a19dea2f300","category":"Environment"}