{"title":"81 Effects of udder quarter location on colostrum yield, nutrients, and immunoglobulin G in beef heifers","link":"https://academic.oup.com/jas/article/102/Supplement_2/248/7664984?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>We hypothesized that colostrum total nutrients and immunoglobulin G (IgG) would not be affected by side of the udder, but that they would be greater in the rear versus the front half of the udder due to difference in volume of colostrum produced. Complete colostrum yield was collected individually from each quarter pre-suckling [40.5 ± 21.0 min (SD)] from fall-calving crossbred beef heifers (body weight = 472 ± 34 kg; body condition score (= 5.3 ± 0.4) that were either individually-fed 100% (control; n = 12) or 70% (nutrient restricted; n = 12) of NASEM metabolizable energy and metabolizable protein requirements from d 160 of gestation to calving. Analysis of colostrum lactose, protein, triglycerides, and free glucose was performed using colorimetric assays on a UV-visible light microplate reader. Colostrum IgG was analyzed using a commercially available ELISA kit. Quarter yield, nutrient or IgG concentration, and total nutrients or IgG were analyzed using the mixed procedure of SAS with fixed effects of udder location, nutritional plane, and their interaction in the model. Nutritional plane was not part of the current objective, but was included to account for variation in colostrum yield due to nutrient restriction, as we have previously reported. Separate statistical comparisons were made between the front and rear quarters and between the right and left quarters of the udder, with each quarter considered a sampling unit within each experimental unit (half) for both analyses. The interaction of udder location × nutritional plane did not affect (<span>P</span> ≥ 0.11) any variable. Nutrient restriction decreased (<span>P</span> ≤ 0.03) colostrum yield, total lactose, and total free glucose compared with controls. Front quarters produced less volume (<span>P</span> &lt; 0.001; 36.2% of total); total lactose, protein, and free glucose (<span>P</span> ≤ 0.02; 34.3 to 43.3%); and total IgG (<span>P</span> &lt; 0.001; 33.7%) than rear quarters. Front quarters tended to produce less (<span>P</span> = 0.07; 43.3%) total triglycerides than rear quarters. Lactose concentration was 10.5% greater (<span>P</span> = 0.05) in front compared with rear quarters, but other nutrient or IgG concentrations were not affected (<span>P</span> ≥ 0.18). Udder side did not affect total volume (<span>P</span> = 0.78), total nutrients (<span>P</span> ≥ 0.36), or total IgG (<span>P</span> = 0.79). The left side represented 50.7% of the total volume and 50.1 to 53.4% of total nutrients and IgG produced. Concentration of nutrients and IgG also were not affected (<span>P</span> ≥ 0.31) by udder side. In conclusion, colostrum did not differ between udder sides, but, relative to front quarters, rear quarters produced greater nutrient and IgG yield due to greater colostrum volume with minimal differences in nutrient or IgG concentrations.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5ac72ea974514f7e0d4b52c5db37bc0c3d673ec3a6f155e2dfefe534c11d5e24","category":"Environment"}