{"title":"Glutathionylation of a glycolytic enzyme promotes cell death and vigor loss during aging of elm seeds","link":"https://academic.oup.com/plphys/article/195/4/2596/7651142?rss=1","date":1713398400000,"content":"<span><div>Abstract</div>Seed deterioration during storage is a major problem in agricultural and forestry production and for germplasm conservation. Our previous studies have shown that a mitochondrial outer membrane protein VOLTAGE-DEPENDENT ANION CHANNEL (VDAC) is involved in programmed cell death-like viability loss during the controlled deterioration treatment (CDT) of elm (<span>Ulmus pumila</span> L.) seeds, but its underlying mechanism remains unclear. In this study, we demonstrate that the oxidative modification of GLYCERALDEHYDE-3-PHOSPHATE DEHYDROGENASE (GAPDH) is functioned in the gate regulation of VDAC during the CDT of elm seeds. Through biochemical and cytological methods and observations of transgenic material [Arabidopsis (<span>Arabidopsis thaliana</span>), <span>Nicotiana benthamiana</span>, and yeast (<span>Saccharomyces cerevisiae</span>)], we demonstrate that cysteine S-glutathionylated <span>Up</span>GAPDH1 interacts with <span>Up</span>VDAC3 during seed aging, which leads to a mitochondrial permeability transition and aggravation of cell death, as indicated by the leakage of the mitochondrial proapoptotic factor cytochrome <span>c</span> and the emergence of apoptotic nucleus. Physiological assays and inductively coupled plasma mass spectrometry analysis revealed that GAPDH glutathionylation is mediated by increased glutathione, which might be caused by increases in the concentrations of free metals, especially Zn. Introduction of the Zn-specific chelator TPEN [(N,N,N′,N′-Tetrakis (2-pyridylmethyl)ethylenediamine)] significantly delayed seed aging. We conclude that glutathionylated <span>Up</span>GAPDH1 interacts with <span>Up</span>VDAC3 and serves as a proapoptotic protein for VDAC-gating regulation and cell death initiation during seed aging.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"5ad31be3ece2c5bead58eb1fe889cd984e09e2d6069d6b2a5b827cea1703814d","category":"Environment"}