{"title":"Daytime land surface temperature and its limits as a proxy for surface air temperature in a subtropical, seasonally wet region","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000278","date":1727877600000,"content":"<p>by Nkosi Muse, Amy Clement, Katharine J. Mach</p>\r\n\r\nLand surface temperatures (LSTs) captured via satellite remote sensing are widely used as a proxy for the surface air temperatures (SATs) experienced outdoors, a key component of human heat exposure. However, LST’s accuracy in capturing SAT can vary through space and time across climate types and geographies and has been less explored in subtropical, seasonally wet regions (where summer precipitation exceeds 570 mm). Utilizing daytime (11 AM/12 PM local time, ET/EST) Landsat 8 remote sensing data, this study derived LST and evaluated its spatiotemporal patterns, as well as its relationship with SAT retrieved from local weather stations, using the case of Miami-Dade County, Florida, USA. Over 2013–2022, a surface urban heat island effect is distinctly present (mean SUHII = 3.43°C)—most intense during spring months rather than summer months (mean spring SUHII = 4.09°C). As such, LST peaks in May/June as opposed to July/August for many other parts of the northern hemisphere. In contrast, Miami-Dade SAT is greatest in August, and the strength of its relationship with LST varies by season. LST and SAT are most correlated in winter (<i>R</i> = 0.91) and spring (<i>R</i> = 0.59) months and least correlated during the wetter fall (<i>R</i> = 0.40) months. The relationship between LST and SAT during the summer is statistically insignificant. In this subtropical region with a seasonally wet climate, LST effectively reflects the spatial heterogeneity of the urban thermal landscape, consistent with the literature across urban regions globally. However, because the strength of the LST-SAT relationship considerably weakens during wet season months, LST data therefore have limits as a proxy for the heat exposure people experience outdoors annually, as they may not accurately represent the magnitude of localized potential heat risks. These findings underscore important considerations in using LST data to identify urban heat exposures and inform potential adaptive responses in seasonally wet, subtropical-to-tropical regions.","author":"Nkosi Muse","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"5ad9cdec1085cf9b019df5bd66760fa623e47addf9b5a5652945565d162648a2","category":"Environment"}