{"title":"Interaction between <i>CD244</i> and <i>SHP2</i> regulates inflammation in chronic obstructive pulmonary disease via targeting the MAPK/NF-κB signaling pathway","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312228","date":1729260000000,"content":"<p>by Xiaobing Gao, Suhua Shao, Xi Zhang, Changjie Li, Qianqian Jiang, Bo Li</p>\r\n\r\nThis study delved into the interplay between <i>CD244</i> and <i>Src Homology 2 Domain Containing Phosphatase-2</i> (<i>SHP2</i>) in chronic obstructive pulmonary disease (COPD) pathogenesis, focusing on apoptosis and inflammation in cigarette smoke extract (CSE)-treated human bronchial epithelial (HBE) cells. Analysis of the GSE100153 dataset identified 290 up-regulated and 344 down-regulated differentially expressed genes (DEGs). Weighted gene co-expression network analysis (WGCNA) highlighted the turquoise module had the highest correlation with COPD samples. Functional enrichment analysis linked these DEGs to critical COPD processes and pathways like neutrophil degranulation, protein kinase B activity, and diabetic cardiomyopathy. Observations on CD244 expression revealed its upregulation with increasing CSE concentrations, suggesting a dose-dependent relationship with inflammatory cytokines (IL-6, IL-8, TNF-α). CD244 knockdown mitigated CSE-induced apoptosis and inflammation, while overexpression exacerbated these responses. Co-immunoprecipitation (Co-IP) confirmed the physical interaction between CD244 and SHP2, emphasizing their regulatory connection. Analysis of Concurrently, the Nuclear Factor-kappa B (NF-κB) and Mitogen-activated protein kinase (MAPK) signaling pathways showed that modulating CD244 expression impacted key pathway components (p-JNK, p-IKKβ, p-ERK, p-P38, p-lkBα, p-P65), an effect reversed upon SHP2 knockdown. These findings underscore the pivotal role of the CD244/SHP2 axis in regulating inflammatory and apoptotic responses in CSE-exposed HBE cells, suggesting its potential as a therapeutic target in COPD treatment strategies.","author":"Xiaobing Gao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5ae087bd158882a26c9a9f6889fbf8bca51b021747a4d6b7b78ae0b66ba7c862","category":"Interdisciplinary"}