{"title":"Shifting trait coordination along a soil‐moisture‐nutrient gradient in tropical forests","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14679?af=R","date":1729490982000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/9109e0c4-112b-4e03-83bf-4d3ea397e74e/fec14679-toc-0001-m.png\" alt=\"Shifting trait coordination along a soil-moisture-nutrient gradient in tropical forests\" />\n<p>Illustration of the French Guiana tropical forest landscape. Author Antia Iglesias Fernandez. Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/09/shifting-trait-coordination-along-a-soil-moisture-nutrient-gradient-in-tropical-forests/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSoil nutrients and water availability are strong drivers of tropical tree species distribution across scales. However, the physiological mechanisms underlying environmental filtering along these gradients remain incompletely understood. Previous studies mostly focused on univariate variation in structural traits, but a more integrative approach combining multiple physiological traits is needed to fully portray species functional strategies.\n\nWe measured nine leaf functional traits related to trees' resource capture and hydraulic strategies for 552 individuals belonging to 21 tropical tree species across an environmental gradient in Amazonian forests. Our sampling included generalist and specialist species from <i>terra firme</i> (TF) and seasonally flooded (SF) forests. We tested the influence of the topographic wetness index, a proxy for soil moisture and nutrient gradients, on each trait separately and on the trait integration through multivariate indices computed from the eigenvalues of a principal component analysis on the traits of the species. Finally, we evaluated intraspecific trait variability (ITV) for generalists and specialists by calculating the coefficient of variation for each trait.\n\nResults showed that (1) the environment had a greater influence on trait syndromes than single trait variation. Moreover, (2) SF specialist species expressed a stronger leaf trait coordination than TF specialist species. Furthermore, (3) the ability of generalist species to occupy a broader range of environments was not reflected by a larger ITV than specialist species but by the capacity to change trait coordination across environments.\n\nOur work highlights the need to investigate functional strategies as multidimensional syndromes in physiological trait space to fully understand and predict species distribution along environmental gradients.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/09/shifting-trait-coordination-along-a-soil-moisture-nutrient-gradient-in-tropical-forests/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>Résumé</h2>\n<p>\n\nLes nutriments du sol et la disponibilité de l'eau sont des facteurs importants de la distribution des espèces d'arbres tropicaux à différentes échelles. Cependant, les mécanismes physiologiques à l'origine du filtrage environnemental le long de ces gradients restent mal compris. Les études précédentes se sont principalement concentrées sur la variation des traits de façon individuelle. Cependant, pour décrire pleinement les stratégies fonctionnelles des espèces, une approche plus intégrative, qui combine un ensemble de traits physiologiques (syndrome de trait) est nécessaire.\n\nDans cette étude, nous avons mesuré neuf traits fonctionnels foliaires liés à l'acquisition des ressources et à la gestion de l'eau des arbres, sur 552 individus appartenant à 21 espèces d'arbres tropicaux, le long d'un gradient environnemental. L'échantillonnage comprend des espèces généralistes et spécialistes des forêts de terra firme et des forêts de bas-fond en Guyane française. Nous avons utilisé un indice d'humidité topographique (TWI) comme indicateur de l'humidité et de l'accumulation des nutriments du sol. Nous avons testé l'influence de TWI sur chacun des traits séparément et de façon conjointe. Nous avons comparé la coordination des traits pour les espèces généralistes et spécialistes en fonction du TWI, grâce à des indices multivariés, obtenus en utilisant la gamme des valeurs propres d'une analyse en composantes principales sur les traits de l'espèce. Enfin, nous avons évalué la variabilité intraspécifique des traits (ITV) pour les généralistes et les spécialistes en calculant le coefficient de variation pour chaque trait.\n\nLes résultats illustrent que (1) l'environnement a une plus grande influence sur le syndrome de traits que sur la variation des traits pris un par un. De plus, (2) les espèces spécialistes des bas-fond ont une plus forte coordination entre les traits que les spécialistes de terra firme. Enfin, (3) la capacité des espèces généralistes à occuper une plus large gamme d'environnements se traduit par leur capacité à changer la coordination de leurs traits à travers différents environnements plutôt que par une ITV plus importante que celle des espèces spécialistes.\n\nNotre travail plaide en faveur de l'utilisation de syndromes de traits pour étudier les stratégies fonctionnelles et comprendre les mécanismes de distribution des espèces le long des gradients environnementaux.\n</p>","author":"Marion Boisseaux, \nDaniela Nemetschek, \nChristopher Baraloto, \nBenoit Burban, \nAngela Casado‐Garcia, \nJocelyn Cazal, \nJeanne Clément, \nGéraldine Derroire, \nClaire Fortunel, \nJean‐Yves Goret, \nJonathan Heras, \nGaelle Jaouen, \nIsabelle Maréchaux, \nChristine Scoffoni, \nGhislain Vieilledent, \nJason Vleminckx, \nSabrina Coste, \nHeidy Schimann, \nClément Stahl","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"5ae4745928ed3b37e36ce44bf611d0284a57ad68256f58b340febbf39766ddd6","category":"Environment"}