{"title":"Spotify, Epic Games, and Others Argue Apple's App Store Changes Do Not Comply With DMA","link":"https://www.macrumors.com/2024/03/01/spotify-epic-games-apple-dma-complaint/","date":1709320503000,"content":"Spotify, <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, Deezer, Paddle, and several other developers and EU associations today <a href=\"https://newsroom.spotify.com/2024-03-01/a-letter-to-the-european-commission-on-apples-lack-of-dma-compliance/\">sent a joint letter</a> to the European Commission to complain about Apple's \"proposed scheme for compliance\" with the Digital Markets Act (DMA).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/03/App-Store-Unfair-Feature-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe 34 companies and associations do not believe Apple's plans \"meet the law's requirements.\" Apple's changes \"disregard both the spirit and letter of the law\" and if left unchanged, will \"make a mockery of the DMA,\" according to the letter. Several specific components of Apple's plan are highlighted, including the Core Technology Fee, the Notarization process, and the terms that developers must accept.\r<br />\n<ul>\r<br />\n \t<li>Apple's requirement to stay with the current <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> terms or opt in to new terms provides developers with \"an unworkable choice\" that adds complexity and confusion. The letter suggests that neither option is DMA compliant and would \"consolidate Apple's stronghold over digital markets.\"</li>\r<br />\n \t<li>The Core Technology Fee and transaction fees will hamper competition and will prevent developers from agreeing to the \"unjust terms.\"</li>\r<br />\n \t<li>Apple is using \"unfounded privacy and security concerns\" to limit user choice. The \"scare screens\" that Apple plans to show users will \"mislead and degrade the user experience.\"</li>\r<br />\n \t<li>Apple is not allowing sideloading, and it is making the installation and use of new app stores \"difficult, risky and financially unattractive for developers.\"</li>\r<br />\n</ul>\r<br />\nThe companies and associations are urging the European Union to take \"swift, timely and decisive action against Apple.\" The way the European Commission responds to Apple's proposal \"will serve as a litmus test of the DMA and whether it can deliver for Europe's citizens and economy.\"\r<br />\n\r<br />\nApple is required to comply with the Digital Markets Act by March 7, and the app ecosystem changes baked are baked in to iOS 17.4. We are expecting to see iOS 17.4 released early next week, and that is when alternative app marketplaces, alternative payment methods, and the new terms that Apple has designed for developers will go into effect.\r<br />\n\r<br />\nIn support of the changes that it is implementing, Apple today <a href=\"https://www.macrumors.com/2024/03/01/apple-whitepaper-alternative-app-marketplaces/\">published a whitepaper</a> outlining the risks that it is attempting to mitigate with the Notarization process and other requirements alternative app marketplaces and the apps installed through those marketplaces must submit to.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/spotify/\">Spotify</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/01/spotify-epic-games-apple-dma-complaint/\">Spotify, Epic Games, and Others Argue Apple's App Store Changes Do Not Comply With DMA</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/spotify-epic-games-and-others-argue-apples-app-store-changes-do-not-comply-with-dma.2420823/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5ae5ea6bd198d726258b7cbc6cd83fd347279db110debdf776b266d57757c545","category":"Apple"}