{"title":"Factors predicting participation in organised sports during adolescence: A two-year longitudinal perspective","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310853","date":1726840800000,"content":"<p>by Gwennyth E. Spruijtenburg, Femke van Abswoude, Hidde Bekhuis, Bert Steenbergen</p>\r\nBackground <p>Participation in youth sports is a major determinant of current and future health, yet participation rates are declining. It is of great importance to examine the factors that potentially influence adolescents’ levels of participation in organised sports.</p> Aim <p>First, we examined change in participation over two years from the start of secondary education. Second, we examined whether a combination of factors (i.e. motives, barriers, perceived competence, encouragement and motor skills) based on the Youth Physical Activity Promotion model was associated with participation after one year. Third, we examined whether the associations between each of the factors and participation in organised sports changed over time.</p> Methods <p>Data were collected on three occasions between October 2020 and November 2022 using questionnaires, motor skill test items and anthropometric measurements. We analysed data from 204 Dutch adolescents (11 to 14 years) using dependent <i>t</i> tests, Cochran’s <i>Q</i> test and multilevel linear fixed effects regression models.</p> Results <p>First, participation in organised sports was stable during the first years of secondary education. Second, adolescents who reported higher motives, higher perceptions of competence and more encouragement spent more time in organised sports one year later. Barriers and motor skills did not predict participation. Third, relationships of each of the six factors with participation remained stable over time.</p> Conclusion <p>Although participation in organised sports is often considered to decline during the first years of secondary education, it can be stable for a significant portion of the population. Motives, perceived competence, and encouragement seem crucial to stimulate adolescents’ participation in organised sports.</p>","author":"Gwennyth E. Spruijtenburg","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5ae607f07ff2b30f9f34edce222679fbbaa48d48f6dd1b6b5a3988afe03f54a4","category":"Interdisciplinary"}