{"title":"iOS 17.3 beta 3 is released, after pulling beta 2 last week","link":"https://www.macworld.com/article/2169796/ios-17-3-beta-features-release-stolen-device-protection.html","date":1704829002000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>As expected, Apple began beta testing iOS 17.3 the day after <a href=\"https://www.macworld.com/article/2164433/ios-17-2-features-little-improvements.html\">iOS 17.2</a> was released. The new beta is expected to re-introduce collaborative playlists in <a href=\"https://www.macworld.com/article/2164226/apple-music-wont-get-collaborative-playlists-until-next-year.html\">Apple Music</a> (removed in a late beta of iOS 17.2) and could bring other remaining iOS 17 features such as <a href=\"https://www.macworld.com/article/2168672/airplay-in-hotel-rooms-officially-delayed-until-2024.html\">AirPlay in supporting hotels</a>. </p>\n\n\n\n<p>Perhaps the most interesting part of IOS 17.3 is a previously unannounced feature called Stolen Device Protection. When enabled, the feature will make it harder to perform certain actions, including changing your Apple ID password, passcode, or viewing your other passwords, when away from a familiar place. With just your iPhone passcode (which could be obtained simply by watching a user enter it), a thief can change the Apple ID password and wipe your iPhone, but Stolen Device Protection adds the layer of Face ID or Touch ID when away from your home, work, or other trusted location.</p>\n\n\n\n<p><em><strong>Update 01/09/24: </strong>After a boot loop bug caused Apple to quickly pull the release of iOS 17.3 beta 2 last week, Apple has released beta 3.</em></p>\n\n\n\n<h2>iOS 17.3: new features</h2>\n\n\n\n<p>We’re still discovering new features and changes in iOS 17.3, so this section will be updated frequently. Here’s what has been discovered so far.</p>\n\n\n\n<p><strong>Stolen Device Protection:</strong> A new optional security feature that limits what can be done on your iPhone with just your six-digit passcode when not at a familiar location like your home or work. The intent is to make it harder for thieves to access important information on your iPhone or lock you out of your Apple ID. Find it under <em>Settings</em> &gt; <em>Face ID &amp; Passcode</em>.</p>\n\n\n\n<p><strong>Apple Music collaborative playlists:</strong> After being pulled from iOS 17.2 beta 4, the feature is back in the first beta of iOS 17.3. </p>\n\n\n\n<h2>1OS 17.3: How to install the public beta</h2>\n\n\n\n<p>If you want to be among the first to test iOS 17.3, you can sign up for the public beta test. The process for installing a beta has changed since iOS 16.4. Here’s how the new process works now:</p>\n\n\n\n<ol>\n<li>Click Sign Up on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/&amp;xcust=1-1-2169796-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Beta page</a> and register with your Apple ID.</li>\n\n\n\n<li>Log in to the Beta Software Program.</li>\n\n\n\n<li>Click <em>Enroll your iOS device</em>.</li>\n\n\n\n<li>Open the <em>Settings</em> app, tap <em>General</em>, then <em>Software Update</em>.</li>\n\n\n\n<li>In the Beta Updates section, select the iOS Public Beta.</li>\n</ol>\n\n\n\n<p>It may take a few moments after registering for the beta option to appear in Software Update.</p>\n\n\n\n<h2>iOS 17.3: How to install the developer beta</h2>\n\n\n\n<p>You’ll need to be registered as an Apple developer. Beginning with iOS 17, you don’t need to be in the $99 per year developer program to access the developer beta. A free developer account will do. You can get one via Xcode or the Apple Developer app in iOS. Here’s how to do it via the Apple Developer app:</p>\n\n\n\n<ol>\n<li>Download the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/apple-developer/id640199958&amp;xcust=1-1-2169796-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Developer App</a> from the App Store.</li>\n\n\n\n<li>Open the app.</li>\n\n\n\n<li>Tap on Account.</li>\n\n\n\n<li>Sign in using your usual Apple ID.</li>\n</ol>\n\n\n\n<p>If you want to sell applications to the App Store you’ll need to pay $99/£79 per year for a paid account. Sign up for the Apple Developer Program (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/enroll/&amp;xcust=1-1-2169796-1-0-0&amp;sref=https://www.macworld.com/feed\">here</a>) or through Apple’s Developer App. You can <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/support/compare-memberships&amp;xcust=1-1-2169796-1-0-0&amp;sref=https://www.macworld.com/feed\">compare the free and paid accounts here</a>.</p>\n\n\n\n<p>Registered developers can choose to get the Public Beta instead by selecting <em>iOS Public Beta</em> in the Software Update screen. It may take a little time after registering as a developer for the option to appear in Software Updates.</p>\n\n\n\n<p>Some developers have an Apple ID registered for developer access that is different from the Apple ID associated with their personal Apple account and data. To use a different Apple ID for beta access than is used throughout the rest of iOS, open <em>Settings</em> &gt; <em>General</em> &gt; <em>Software Update</em> &gt; <em>Beta Updates</em> and select the Apple ID at the bottom of the screen.</p>\n\n\n\n<p>Find out everything you need to know about iOS 17 in our <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17 superguide</a>.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5ae8a15f910aef17babeb7eba39b709d332b3d0d5856aff583a82c7bef83982b","category":"Apple"}