{"title":"The right amygdala and migraine: Analyzing volume reduction and its relationship with symptom severity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301543","date":1711980000000,"content":"<p>by Shota Kosuge, Yuri Masaoka, Hideyo Kasai, Motoyasu Honma, Kouzou Murakami, Nobuyuki Yoshii, Keiko Watanabe, Takaaki Naito, Miku Kosuge, Misa Matsui, Daiki Shoji, Syunsuke Sakakura, Hidetomo Murakami, Masahiko Izumizaki</p>\r\n\r\nThis study aimed to explore the relationship between gray matter volume changes and various clinical parameters in patients with migraine, focusing on symptom severity, quality of life, and states of depression and anxiety. Using a case-control design, we examined 33 patients with migraine, with or without aura, and 27 age-matched healthy subjects. We used magnetic resonance imaging to assess the volumes of 140 bilateral brain regions. Clinical evaluations included the Migraine Disability Assessment, the Migraine Specific Quality of Life Questionnaire, the Center for Epidemiologic Studies Depression scale, Spielberger’s State and Trait Anxiety scales, and the Japanese version of the Montreal Cognitive Assessment. We compared the scores of these measures between migraine patients and healthy controls to examine the interplay between brain structure and clinical symptoms. Significant volumetric differences were observed in the pallidum and amygdala between migraine patients and healthy individuals. The reduction in the right amygdala volume correlated significantly with migraine severity as measured by the Migraine Disability Assessment. Path analysis revealed a model where Migraine Disability Assessment scores were influenced by Migraine Specific Quality of Life Questionnaire outcomes, which were further affected by depression, anxiety, and a low right pallidum volume. Our findings suggest that the chronicity and severity of migraine headaches specifically affect the right amygdala. Our path model suggests a complex relationship whereby migraine disability is strongly influenced by quality of life, which is, in turn, affected by psychological states, such as anxiety and depression.","author":"Shota Kosuge","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5aeaa2c43b18e3b47b284e030ff9529b80e2f33999e2e177ce10dcfe5f35177e","category":"Interdisciplinary"}