{"title":"Incidence of Metaphorical Virtual Classrooms and Interactive Learning Objects in the Interaction of Online Students","link":"https://www.preprints.org/manuscript/202403.1613/v1","date":1711517019000,"content":"This study explored the incidence of metaphorical virtual classrooms and interactive learning objects in the interaction of students in online mode. The main objective was to analyze how these digital tools, driven by a set of strategies to promote their use, affect the interaction of students in the virtual classroom system and their derived effects. To this end, the latest version of Moodle was implemented in conjunction with gamification plugins and interactive tools in the higher education institution used as a case study. The methodology consisted of data collection through ordinal instruments applied to the teachers and student performance metrics gathered using a plugin developed to extract accurate metrics of each student's usage and performance through direct queries to the Moodle database and its processing through a neural network. This facilitated the collection of standardized data on the actual metrics of each virtual classroom at the end of the teaching of each subject from both the previous LMS and the newly implemented one. This data was then analyzed using advanced statistical techniques, including Mahalanobis distances, confirmatory factor analysis, and the Wilcoxon signed-rank test. These methods provided a compelling comparison between the old and new systems, revealing significant improvements in the metrics and factors evaluated. The results showed a significant improvement in teachers' perceptions of the usability of the virtual classroom system and an increase in students' academic performance, interaction, progress, and time spent learning in virtual contexts. These results provide solid empirical evidence of the added value of these educational tools as effective strategies for improving student interaction, performance, and motivation in online education.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5aee55f5928c7960d06fd00e924a02255a8084ff66bf8ca4c96bc8a46342f256","category":"Interdisciplinary"}