{"title":"Metal and oxidative potential exposure through particle inhalation and oxidative stress biomarkers: a 2-week pilot prospective study among Parisian subway workers","link":"http://link.springer.com/10.1007/s00420-024-02054-2","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <span>\n                      <h3>Objective</h3>\n                      <p>In this pilot study on subway workers, we explored the relationships between particle exposure and oxidative stress biomarkers in exhaled breath condensate (EBC) and urine to identify the most relevant biomarkers for a large-scale study in this field.</p>\n                    </span>\n                    <span>\n                      <h3>Methods</h3>\n                      <p>We constructed a comprehensive occupational exposure assessment among subway workers in three distinct jobs over 10 working days, measuring daily concentrations of particulate matter (PM), their metal content and oxidative potential (OP). Individual pre- and post-shift EBC and urine samples were collected daily. Three oxidative stress biomarkers were measured in these matrices: malondialdehyde (MDA), 8-hydroxy-2′deoxyguanosine (8-OHdG) and 8-isoprostane. The association between each effect biomarker and exposure variables was estimated by multivariable multilevel mixed-effect models with and without lag times.</p>\n                    </span>\n                    <span>\n                      <h3>Results</h3>\n                      <p>The OP was positively associated with Fe and Mn, but not associated with any effect biomarkers. Concentration changes of effect biomarkers in EBC and urine were associated with transition metals in PM (Cu and Zn) and furthermore with specific metals in EBC (Ba, Co, Cr and Mn) and in urine (Ba, Cu, Co, Mo, Ni, Ti and Zn). The direction of these associations was both metal- and time-dependent. Associations between Cu or Zn and MDA<sub>EBC</sub> generally reached statistical significance after a delayed time of 12 or 24 h after exposure. Changes in metal concentrations in EBC and urine were associated with MDA and 8-OHdG concentrations the same day.</p>\n                    </span>\n                    <span>\n                      <h3>Conclusion</h3>\n                      <p>Associations between MDA in both EBC and urine gave opposite response for subway particles containing Zn versus Cu. This diverting Zn and Cu pattern was also observed for 8-OHdG and urinary concentrations of these two metals. Overall, MDA and 8-OHdG responses were sensitive for same-day metal exposures in both matrices. We recommend MDA and 8-OHdG in large field studies to account for oxidative stress originating from metals in inhaled particulate matter.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"5af462f8fe76abddd7a2c70dac8586ef5673c1d44406aa9fc46b7d8d92613ac7","category":"Environment"}