{"title":"Quantitative Evaluations of Pumping-Induced Land Subsidence and Mitigation Strategies by Integrated Remote Sensing and Site-Specific Hydrogeological Observations","link":"https://www.preprints.org/manuscript/202408.1292/v1","date":1724150805000,"content":"Land subsidence is an environmental hazard occurring gradually over time, potentially posing significant threats to the structural stability of civilian buildings and essential infrastructures. This study presented a workflow using the SBAS-PSInSAR approach to analyze surface deformation in the Choushui River fluvial plain (CRFP) based on Sentinel-1 SAR images and validated against precise leveling. Integrating InSAR results with hydrogeological data, such as groundwater levels, multilayer compactions, and borehole loggings, a straightforward model was proposed to estimate appropriate groundwater level drops to minimize further subsidence. The results showed a huge subsidence bowl centered in Yunlin, with maximal sinking at an average 60 mm/year rate. High-resolution subsidence maps enable the quantitative analyses of the safety issues for Taiwan High Speed Rail (THSR) across the considerable subsidence areas. In addition, the analysis of hydrogeological data revealed that half of the major compaction in the study area occurred at shallow depths. Based on a maximal subsidence control rate of 40 mm/year specified in the CRFP, the model results indicated that the groundwater level drops from wet to dry seasons needed to be maintained from 3-5 m for the shallowest aquifer and 4 – 6 m for aquifers 3 and 4. The workflow demonstrated the compatibility of InSAR with traditional geodetic methods and the effectiveness of integrating multiple data sources to assess the complex nature of land subsidence in the CRFP.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5b1041ddc4cd51eb0001b77d9a97d3d7ab39b5d9f68f665083071be9ff0835dd","category":"Interdisciplinary"}