{"title":"The toxicity of chlorine dioxide to clownfish and its bactericidal capability to pathogenic strains of vibrio spp.","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13957?af=R","date":1720633956000,"content":"<h2>Abstract</h2>\n<p>Global ornamental fish transportation ranging from hours to days can produce multiple stress factors impact fish health and cause mortality. Clownfish, particularly <i>Amphiprion ocellaris</i>, are among the most traded saltwater ornamental fish. <i>Vibrio</i> includes several pathogenic strains that affect aquatic animals. Consequently, prophylactic treatment of the water or fish is recommended. In this study, six <i>Vibrio</i> strains including <i>V. alginolyticus</i>, <i>V. parahaemolyticus</i> and <i>V. harveyi</i> isolated from sick <i>A. ocellaris</i> and one <i>V. harveyi</i> strain from a sick East Asian fourfinger threadfin (<i>Eleutheronema rhadinum</i>) were tested for their sensitivity to a popular disinfectant, chlorine dioxide (ClO<sub>2</sub>). The results showed that 0.25 ppm ClO<sub>2</sub> effectively suppressed five of the seven tested <i>Vibrio</i> strains for 24 h; however, 0.1 ppm ClO<sub>2</sub> is safer for <i>A. ocellaris</i>. Meanwhile, ClO<sub>2</sub> 2.5 ppm reduced the bacterial counts to below 3.3 × 10<sup>5</sup> CFU/mL for 24 hours. The LC<sub>50</sub> of ClO<sub>2</sub> for <i>A. ocellaris</i> was 0.87 ppm at 10 min and 0.72 ppm at 24 h post treatment. Mild changes in water quality, including dissolved oxygen (DO), temperature and pH, were recorded during the trial. More research is necessary to understand the sensitivity of various aquatic animal pathogens to ClO<sub>2</sub> and its toxicity to different aquatic animals.</p>","author":"Chia‐Te Lin, \nJuan‐Ting Liu, \nPei‐Chi Wang, \nShih‐Chu Chen","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"5b14e37d8b1b1a05d84556f395b737b046afb727325d78e0dc50b5696ef17a99","category":"Environment"}