{"title":"Evidence of increasing wildfire damage with decreasing property price in Southern California fires","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300346","date":1713967200000,"content":"<p>by Erin Conlisk, Van Butsic, Alexandra D. Syphard, Sam Evans, Megan Jennings</p>\r\n\r\nAcross the Western United States, human development into the wildland urban interface (WUI) is contributing to increasing wildfire damage. Given that natural disasters often cause greater harm within socio-economically vulnerable groups, research is needed to explore the potential for disproportionate impacts associated with wildfire. Using Zillow Transaction and Assessment Database (ZTRAX), hereafter “Zillow”, real estate data, we explored whether lower-priced structures were more likely to be damaged during the most destructive, recent wildfires in Southern California. Within fire perimeters occurring from 2000–2019, we matched property price data to burned and unburned structures. To be included in the final dataset, fire perimeters had to surround at least 25 burned and 25 unburned structures and have been sold at most seven years before the fire; five fires fit these criteria. We found evidence to support our hypothesis that lower-priced properties were more likely to be damaged, however, the likelihood of damage and the influence of property value significantly varied across individual fire perimeters. When considering fires individually, properties within two 2003 fires–the Cedar and Grand Prix-Old Fires–had statistically significantly decreasing burn damage with increasing property value. Occurring in 2007 and later, the other three fires (Witch-Poomacha, Thomas, and Woolsey) showed no significant relationship between price and damage. Consistent with other studies, topographic position, slope, elevation, and vegetation were also significantly associated with the likelihood of a structure being damaged during the wildfire. Driving time to the nearest fire station and previously identified fire hazard were also significant. Our results suggest that further studies on the extent and reason for disproportionate impacts of wildfire are needed. In the meantime, decision makers should consider allocating wildfire risk mitigation resources–such as fire-fighting and wildfire structural preparedness resources–to more socioeconomically vulnerable neighborhoods.","author":"Erin Conlisk","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5b18bb8e941c510201eb3d930ea00ebb10061b4ce4bfe8b430081fbe41c90b82","category":"Interdisciplinary"}