{"title":"Socioeconomic and environmental factors associated with dengue fever incidence in Guatemala: Rising temperatures increase dengue risk","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308271","date":1722520800000,"content":"<p>by Kasem U. Salim, Francisco S. Álvarez, Alec M. Chan-Golston, Colleen C. Naughton, Ricardo Cisneros, Andrea Joyce</p>\r\n\r\nDengue fever is a mosquito-borne illness that infects 390 million people annually. Dengue outbreaks in Guatemala have been occurring more often and at increased rates since the first dengue outbreak in Guatemala in the 1970s. This study will examine environmental and socioeconomic factors associated with dengue in Guatemala at the municipality (county) level. Socioeconomic factors included population density, Mayan population, economic activity, and attending school. Environmental factors included average minimum annual temperature and annual precipitation. The relationship between environmental and socioeconomic variables and dengue fever incidence was initially evaluated through univariate zero-inflated negative binomial models, and then again through three zero-inflated multivariate negative binomial regression models. For all three models, elevation was considered a predictor of zero-inflation. In the combined model, there was a positive relationship between minimum temperature, economic activity and dengue fever incidence, and a negative relationship between population density, Mayan population and dengue fever. Predicted rates of dengue fever incidence and adjusted confidence intervals were calculated after increasing minimum yearly temperature by 1°C and 2°C. The three municipalities with the highest minimum yearly temperature (El Estor, Iztapa, and Panzós) and the municipality of Guatemala, all had an increase in the magnitude of the risk of dengue fever incidence following 1°C and 2°C increase in temperature. This research suggests that these socioeconomic and environmental factors are associated with risk of dengue in Guatemala. The predicted rates of dengue fever also highlight the potential effect that climate change in the form of increasing temperature can have on dengue in Guatemala.","author":"Kasem U. Salim","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5b1a11fcccaa18695e22f5a5680c0647642a10cf480b08583f8c58e92f4c3b63","category":"Interdisciplinary"}