{"title":"An Extreme Learning Machine Stock Price Prediction Algorithm Based on the Optimisation of the Crown Porcupine Optimisation Algorithm with an Adaptive Bandwidth Kernel Function Density Estimation Algorithm","link":"https://www.preprints.org/manuscript/202408.1116/v1","date":1723754850000,"content":"This paper aims to explore the potential application of Extreme Learning Machines (ELM) in stock price prediction and optimise the ELM model by combining the Crown Porcupine Optimisation Algorithm and the Adaptive Bandwidth Kernel Function Density Estimation Algorithm. Specifically, the model's root mean square error (RMSE) on the test set is 0.018, which shows its good prediction accuracy. Meanwhile, the correlation coefficient R reaches 0.968, proving the model's effectiveness in predicting stock prices. In addition, the coefficient of determination R² of the training set and test set are 0.987 and 0.954, respectively, which are not much different, indicating that the model has good generalisation ability and is not prone to overfitting. This is crucial for practical application, as it implies that the model fits the existing data well and makes accurate predictions for future data. In terms of other evaluation metrics such as Mean Absolute Error (MAE), Root Mean Square Error (RMSE) and Mean Absolute Percentage Error (MAPE), the performance is excellent in both the training and test sets. Together, these results indicate that after optimising the ELM by introducing the crown porcupine optimisation algorithm and the adaptive bandwidth kernel function density estimation algorithm, the model can effectively capture the changing stock price pattern, thus achieving efficient and accurate stock price prediction. In summary, this study not only demonstrates the great potential of ELM in stock price prediction but also highlights the importance of improving the model performance through advanced algorithm optimisation, which provides a new way of thinking and methodology for financial market analysis. This strongly supports investors' decision-making and lays the foundation for related research.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5b25925c3776b2ddf899a9bb3204f3b7384f2522300cdbaed52a4ac9e83d215a","category":"Interdisciplinary"}