{"title":"Mind to move: Differences in running biomechanics between sensing and intuition shod runners","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300108","date":1712152800000,"content":"<p>by Cyrille Gindre, Aurélien Patoz, Bastiaan Breine, Thibault Lussiana</p>\r\n\r\nDelving into the complexities of embodied cognition unveils the intertwined influence of mind, body, and environment. The connection of physical activity with cognition sparks a hypothesis linking motion and personality traits. Hence, this study explored whether personality traits could be linked to biomechanical variables characterizing running forms. To do so, 80 runners completed three randomized 50-m running-trials at 3.3, 4.2, and 5m/s during which their running biomechanics [ground contact time (<i>t</i><sub>c</sub>), flight time (<i>t</i><sub>f</sub>), duty factor (DF), step frequency (SF), leg stiffness (<i>k</i><sub>leg</sub>), maximal vertical ground reaction force (<i>F</i><sub>max</sub>), and maximal leg compression of the spring during stance (Δ<i>L</i>)] was evaluated. In addition, participants’ personality traits were assessed through the Myers-Briggs Type Indicator (MBTI) test. The MBTI classifies personality traits into one of two possible categories along four axes: extraversion-introversion; sensing-intuition; thinking-feeling; and judging-perceiving. This exploratory study offers compelling evidence that personality traits, specifically sensing and intuition, are associated with distinct running biomechanics. Individuals classified as <i>sensing</i> demonstrated a more grounded running style characterized by prolonged <i>t</i><sub>c</sub>, shorter <i>t</i><sub>f</sub>, higher DF, and greater Δ<i>L</i> compared to <i>intuition</i> individuals (<i>p</i>≤0.02). Conversely, <i>intuition</i> runners exhibited a more dynamic and elastic running style with a shorter <i>t</i><sub>c</sub> and higher <i>k</i><sub>leg</sub> than their <i>sensing</i> counterparts (<i>p</i>≤0.02). Post-hoc tests revealed a significant difference in <i>t</i><sub>c</sub> between <i>intuition</i> and <i>sensing</i> runners at all speeds (<i>p</i>≤0.02). According to the definition of each category provided by the MBTI, <i>sensing</i> individuals tend to focus on concrete facts and physical realities while <i>intuition</i> individuals emphasize abstract concepts and patterns of information. These results suggest that runners with sensing and intuition personality traits differ in their ability to use their lower limb structures as springs. <i>Intuition</i> runners appeared to rely more in the stretch-shortening cycle to energetically optimize their running style while <i>sensing</i> runners seemed to optimize running economy by promoting more forward progression than vertical oscillations. This study underscores the intriguing interplay between personality traits of individuals and their preferred movement patterns.","author":"Cyrille Gindre","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5b40012caabb5fd6642f07b69d3ba0fdb50c2312c2a772f9e297cc618d00a33b","category":"Interdisciplinary"}