{"title":"Effects of BNT162b2 mRNA Covid-19 vaccine on vascular function","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302512","date":1714485600000,"content":"<p>by Takayuki Yamaji, Takahiro Harada, Yu Hashimoto, Yukiko Nakano, Masato Kajikawa, Kenichi Yoshimura, Chikara Goto, Yiming Han, Aya Mizobuchi, Farina Mohamad Yusoff, Shinji Kishimoto, Tatsuya Maruhashi, Ayumu Nakashima, Yukihito Higashi</p>\r\n\r\nThe effects of Covid-19 vaccines on vascular function are still controversial. We evaluated the effects of BNT162b2 vaccine (BioNTech and Pfizer) on endothelial function assessed by flow-mediated vasodilation (FMD) and vascular smooth muscle function assessed by nitroglycerine-induced vasodilation (NID). This study was a prospective observational study. A total of 23 medical staff at Hiroshima University Hospital were enrolled in this study. FMD and NID were measured before vaccination and two weeks and six months after the 2<sup>nd</sup> dose of vaccination. FMD was significantly smaller two weeks after the 2<sup>nd</sup> dose of vaccination than before vaccination (6.5±2.4% and 8.2±2.6%, p = 0.03). FMD was significantly larger at six months than at two weeks after the 2<sup>nd</sup> dose of vaccination (8.2±3.0% and 6.5±2.4%, p = 0.03). There was no significant difference between FMD before vaccination and that at six months after the 2<sup>nd</sup> dose of vaccination (8.2±2.6% to 8.2±3.0%, p = 0.96). NID values were similar before vaccination and at two weeks, and six months after vaccination (p = 0.89). The BNT162b2 Covid-19 vaccine temporally impaired endothelial function but not vascular smooth muscle function, and the impaired endothelial function returned to the baseline level within six months after vaccination.","author":"Takayuki Yamaji","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5b464184fa92c4eca19bfe7cf46bc92fda8fe62a29a075b81183853f2a9c25a4","category":"Interdisciplinary"}