{"title":"Personality, sex and capture biases: Challenges for predator monitoring and management","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2664.14724?af=R","date":1721299968000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/5de8a616-3d8b-471c-ae03-46ce3c658318/jpe14724-toc-0001-m.png\" alt=\"Personality, sex and capture biases: Challenges for predator monitoring and management\" />\n<p>Targeting recalcitrant individuals may pose a considerable problem if a failure to trigger a trap result in a long-term and generalised avoidance of devices. We emphasise the importance of accounting for inter-individual differences in responses to devices, addressing the motivations of recalcitrant individuals during fieldwork and accounting for these differences during data interpretation.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe behaviour of vertebrate pests, such as invasive species and nuisance native animals, towards control devices present a major challenge for wildlife managers. Physical devices, such as live capture or kill-traps, serve as essential management tools, yet the efficacy of these devices can be compromised when some individuals fail to engage with devices, risking the failure of an entire management operation. A more nuanced understanding of how behavioural variability within target populations influences interactions with different device types is needed to improve the detectability of recalcitrant individuals that fail to engage with devices and are subsequently missed by research and management activities.\n\nWe tested the behavioural responses of 28 wild-caught stoats <i>Mustela erminea</i>, a highly successful invader in Aotearoa New Zealand, to three devices representing a range of styles commonly used for mesopredator research and management (box trap, tunnel trap and head-up trap).\n\nWe assessed the influence of stoat personality, sex and device type on susceptibility to devices (probability and latency to trigger) and found all had independent and interactive effects. In general, stoats which were shyer, less active, less exploratory and less neophiliac (low attraction to novelty) took significantly longer to trigger devices and had significantly lower probabilities of triggering devices.\n\nThe influence of boldness on the probability of stoats triggering devices during first encounter differed significantly by trap type, and the box and tunnel traps targeted opposite ends of the personality spectrum.\n\nTrap recalcitrance (avoidance of the standard control measures) was greatest in shy female stoats and females generally had lower susceptibility to all devices compared to males.\n\n<i>Synthesis and applications</i>: Targeting recalcitrant individuals may pose a considerable problem if a failure to trigger a trap result in a long-term and generalised avoidance of devices. We emphasise the importance of accounting for inter-individual differences in responses to devices, addressing the motivations of recalcitrant individuals during fieldwork and accounting for these differences during data interpretation.\n</p>","author":"Kyla C. Johnstone, \nCatherine Price, \nPatrick M. Garvey","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"5b48efee57530fdb5652870f6c96a96c60cfe1156796c3eb24d9e5ad9e9bbc58","category":"Environment"}