{"title":"Improving human activity classification based on micro-doppler signatures of FMCW radar with the effect of noise","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308045","date":1722520800000,"content":"<p>by NgocBinh Nguyen, MinhNghia Pham, Van-Sang Doan, VanNhu Le</p>\r\n\r\nNowadays, classifying human activities is applied in many essential fields, such as healthcare, security monitoring, and search and rescue missions. Radar sensor-based human activity classification is regarded as a superior approach in comparison to other techniques, such as visual perception-based methodologies and wearable gadgets. However, noise usually exists throughout the process of extracting raw radar signals, decreasing the quality and reliability of the extracted features. This paper presents a novel method for removing white Gaussian noise from raw radar signals using a denoising algorithm before classifying human activities using a deep convolutional neural network (DCNN). Specifically, the denoising algorithm is used as a preprocessing step to remove white Gaussian noise from the input raw radar signal. After that, a lightweight Cross-Residual Convolutional Neural Network (CRCNN) with adaptable cross-residual connections is suggested for classification. The analysis results show that the denoising algorithm with a range-bin interval of 3 and a cut-threshold value of 3 achieves the best denoising effect. When the denoising algorithm was applied to the dataset, CRCNN improved the right classification rate by up to 10% compared to the recognition results achieved with the original noise-added dataset. Additionally, a comparison of the CRCNN with the denoising algorithm solution with six cutting-edge DCNNs was conducted. The experimental results reveal that the proposed model greatly outperforms the others.","author":"NgocBinh Nguyen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5b495b53cf973b656e070ddefdd2be51903cde873dc2b770e5d4412c67c5b34f","category":"Interdisciplinary"}