{"title":"Selectivities of Carbon Dioxide Over Ethane in Three Methylimidazolium- Based Ionic Liquids: Experimental Data and Modeling","link":"https://www.preprints.org/manuscript/202408.0811/v1","date":1723454928000,"content":"This work focused on the solubility of ethane in three promising ionic liquids {1-Hexyl-3-methylimidazolium bis(trifluormethylsulfonyl) imide [HMIM][Tf2N], 1-Butyl-3-methyl-imidazolium dimethyl-phosphate [BMIM][DMP] and 1-Propyl-3- methylimidazolium bis(trifluoromethyl-sulfonyl)-imide [PMIM][Tf2N]}. The solubilities were measured at 303.15 K to 343.15 K and pressures up to 1.4 MPa using a gravimetric microbalance. The overall ranking of ethane solubility in the ionic liquids from highest to lowest is the following: [HMIM][Tf2N] &gt; [PMIM][Tf2N] &gt; [BMIM][DMP]. The Peng- Robinson equation of state was used to model the experimental data using three different mixing rules: van der Waals one, van der Waals two and Wong-Sandler mixing rules combined with the Non-Random Two-Liquid model. The average absolute deviations for the three mixing rules for the ionic liquids at the three temperatures were (4.39, 2.45 and 2.45) %, respectively. Henry’s Law constants for ethane in [BMIM] [DMP] were the highest (lowest solubility) amongst other ionic liquids studied in this work. The selectivity of CO2 over C2H6 was estimated at the three temperatures and the overall ranking of the selectivity was in the following order: [PMIM][Tf2N] &gt; [BMIM][DMP] &gt; [HMIM][Tf2N]&gt; Selexol. Selexol, a widely used physical solvent in gas sweetening has better selectivity than the three ionic liquids studied. [PMIM][Tf2N], a promising solvent, has the highest selectivity among the three ILs studied, and would therefore be the best choice if in addition to carbon dioxide capture, ethane co-absorption was to be avoided. The enthalpy and entropy of solvation at infinite dilution were also estimated.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5b519bea8df98e50ca774ffbc46d721e8304d5c2e926f0838e89e1e81d22e4ec","category":"Interdisciplinary"}