{"title":"Temperature sensitivity of detrital photosynthesis","link":"https://academic.oup.com/aob/article/133/1/17/7492908?rss=1","date":1703376000000,"content":"<span><div>Abstract</div><div>Background and Aims</div>Kelp forests are increasingly considered blue carbon habitats for ocean-based biological carbon dioxide removal, but knowledge gaps remain in our understanding of their carbon cycle. Of particular interest is the remineralization of detritus, which can remain photosynthetically active. Here, we study a widespread, thermotolerant kelp (<span>Ecklonia radiata</span>) to explore detrital photosynthesis as a mechanism underlying temperature and light as two key drivers of remineralization.<div>Methods</div>We used meta-analysis to constrain the thermal optimum (<span>T</span><sub>opt</sub>) of <span>E. radiata</span>. Temperature and light were subsequently controlled over a 119-day <span>ex situ</span> decomposition experiment. Flow-through experimental tanks were kept in darkness at 15 °C or under a subcompensating maximal irradiance of 8 µmol photons m<sup>−2</sup> s<sup>−1</sup> at 15, 20 or 25 °C. Photosynthesis of laterals (analogues to leaves) was estimated using closed-chamber oxygen evolution in darkness and under a saturating irradiance of 420 µmol photons m<sup>−2</sup> s<sup>−1</sup>.<div>Key Results</div><span>T</span><sub>opt</sub> of <span>E. radiata</span> is 18 °C across performance variables (photosynthesis, growth, abundance, size, mass and fertility), life stages (gametophyte and sporophyte) and populations. Our models predict that a temperature of &gt;15 °C reduces the potential for <span>E. radiata</span> detritus to be photosynthetically viable, hence detrital <span>T</span><sub>opt</sub> ≤ 15 °C. Detritus is viable under subcompensating irradiance, where it performs better than in darkness. Comparison of net and gross photosynthesis indicates that elevated temperature primarily decreases detrital photosynthesis, whereas darkness primarily increases detrital respiration compared with optimal experimental conditions, in which detrital photosynthesis can persist for ≥119 days.<div>Conclusions</div><span>T</span><sub>opt</sub> of kelp detritus is ≥3 °C colder than that of the intact plant. Given that <span>E. radiata</span> is one of the most temperature-tolerant kelps, this suggests that photosynthesis is generally more thermosensitive in the detrital phase, which partly explains the enhancing effect of temperature on remineralization. In contrast to darkness, even subcompensating irradiance maintains detrital viability, elucidating the accelerating effect of depth and its concomitant light reduction on remineralization to some extent. Detrital photosynthesis is a meaningful mechanism underlying at least two drivers of remineralization, even below the photoenvironment inhabited by the attached alga.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"5b630ccabe14508971a56d60add91ea7c962cb46a6508b6cefe46b1cd6c50f17","category":"Environment"}