{"title":"Advances in Nanotechnology for Sustainable Agriculture: A Review of Climate Change Mitigation","link":"https://www.preprints.org/manuscript/202406.1570/v1","date":1719225122000,"content":"Currently, one of the main challenges is the mitigation of the effects of climate change on the agricultural sector. Conventional agriculture, with the intensive use of herbicides and pesticides to control weeds and pests, and the improper use of mineral fertilizers, contributes to climate change by causing increased greenhouse gases and groundwater pollution. Therefore, more innovative technologies must be used to overcome these problems. One possible solution is nanotechnology, which has the potential to revolutionize the conventional agricultural system. Active nanoparticles can be used both as a direct source of micronutrients and as a delivery platform for bioactive agrochemicals to improve crop growth, yield and quality. The use of nanoparticle formulations, including nanopesticides, nanoherbicides, nano-fertilizers and nano-emulsions, has been extensively studied to improve crop health and shelf life of agricultural products. Comprehensive knowledge of the interactions between plants and nanoparticles opens up new opportunities to improve cropping practices through the enhancement of properties such as disease resistance, crop yield, and nutrient use. The main objective of this review is to analyze the main effects of climate change on conventional agricultural practices, such as the use of pesticides, herbicides and fertilizers. It also focuses on how the introduction of nanoparticles into conventional practices can improve the efficiency of chemical pest control and crop nutrition. Finally, this review examines in depth the last 10 years (2014-2024) of scientific literature regarding the use of nanoparticles in agriculture to mitigate the effects of climate change.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5b65d7dbb4c057dbd1b9466ed47602ccfbcbd92fa3b589073259f2c3b228bb57","category":"Interdisciplinary"}