{"title":"Transnasal Brain Sampling for Human Rabies Confirmation","link":"https://www.preprints.org/manuscript/202406.0683/v1","date":1718095048000,"content":"Rabies remains a significant global threat, yet accurate estimations of its impact are hindered by the lack of confirmatory diagnoses. Postmortem confirmation of rabies traditionally involves invasive brain tissue testing, a process met with resistance from deceased patients' families, impeding consent. This paper presents and evaluates an innovative yet unpublished transnasal approach for postmortem brain tissue collection, offering a minimally invasive, easier, faster, and safer method. This method preserves the cadaver's integrity, potentially easing family reluctance towards autopsies. The limited testing of both human and animal rabies in Ghana highlights the challenges in diagnosing this fatal disease. Scarce diagnostic resources and the complexity of obtaining brain tissue samples exacerbate the issue. Cultural and religious beliefs surrounding autopsies contribute to familial hesitation, viewing these procedures as disruptive and disfiguring, further complicating consent. The transnasal technique involves approaching the brain tissue through the nostrils and cribriform plate without any superficial manipulation of the patient's head and face, thereby preserving aesthetics and natural features of the person. Technological advancements and seamless One Health collaboration among governmental, non-governmental, and research entities locally and globally culminated in Ghana's first confirmed rabies diagnosis using this method of brain tissue collection. This success emphasizes the efficiency and feasibility of transnasal brain collection approach and the invaluable role of the One Health approach and collaborative efforts in overcoming diagnostic challenges in rabies control.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5b673560197deda68f5b4d613e08efe08a19b0ec428016aa7c2f1bf4b750f503","category":"Interdisciplinary"}