{"title":"The generation of ROS by exposure to trihalomethanes promotes the I&kappa;B&alpha;/NF-kB/p65 complex dissociation in human lung fibroblast","link":"https://www.preprints.org/manuscript/202407.0790/v2","date":1720686250000,"content":"Disinfection by-products to obtain drinking water, such as CH2Cl2, CHCl3, and BrCHCl2, elicit cytotoxicity and hyperproliferation in human lung fibroblasts (MRC-5). Enzymes of their biotransformation modulate these damages and can generate toxic metabolites. However, it is unknown that the response to oxidative stress is involved in cellular hyperproliferation modulated by nuclear factor-kappa B (NF-κB). Hence, MRC-5 cells were treated with these compounds to evaluate ROS, lipid peroxidation, phospho-NF-κB/p65 (Ser536) levels, CAT, SOD, and GPx activities. Further, the interactions of halomethanes and ROS with IκBα/NF-κB/p65 complex were analyzed by molecular docking. The correlation among biomarkers showed positive relationships between the prooxidant damage with the antioxidant response, particularly in cells treated with CH2Cl2, and BrCHCl2. Furthermore, negative relationships among ROS with levels of NF-κB/p65 in cells treated with CH2Cl2, and CHCl3 were detected. The estimated relative free energy of binding using thermodynamic integration with the p65 subunit of NF-κB was -3.3 kcal/mol for BrCHCl2; -3.5 kcal/mol for both CHCl3 and O2•, and -3.6 kcal/mol for H2O2. The chloride and bromide are in close contact with the IPT domain residues, particularly in the RHD region involved in DNA binding. Ser281 is located in the same domain, allowing this protein's phosphorylation. Similarly, both ROS are in contact with IPT domain into region RHD and H2O2 as side-chain oxygen with Leu280, adjacent to the phosphorylation site of p65. However, a negative correlation among ROS with phospho- NF-κB/p65 suggests ROS's steric hindrance on the C-terminal domain of NF-κB/p65 is involved in antioxidant response.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5b6c343030cfe3a56681293fac061be77c540671928488caeb351b64d1250ad3","category":"Interdisciplinary"}