{"title":"The Demise of the Spirit of Primitive Federalism of Confucianism: From Duke of Zhou, Confucius to Dong Zhongshu","link":"https://www.preprints.org/manuscript/202410.0790/v1","date":1728551683000,"content":"This study examines the evolution and eventual decline of the spirit of primitive federalism within Confucianism, tracing its trajectory from the time of the Duke of Zhou and Confucius to the significant reinterpretations by Dong Zhongshu. The Duke of Zhou's establishment of a confederation-like system (fengjian) and the \"Zhou ritual norms\" laid the groundwork for a political structure that embraced diversity and distributed power among vassal states, reflecting a proto-federalist concept. Confucius's teachings continued this legacy, advocating for a return to the balanced systems of the Duke's era, where both the central government and local states shared responsibilities and rights. Transformation happened under Emperor Wu of Han, where Dong Zhongshu re-envisioned the role of feudal lords as administrative extensions of a centralized government, effectively eroding local autonomy and shifting towards a unified, centralized system. This ideological shift involved the suppression of alternative philosophies and the establishment of Confucianism as the state's dominant ideology, leading to a reinterpretation of Confucianism that supported an authoritarian framework and cultural assimilation, thus diminishing the rights of the people. In intrinsic tensions between centralized authority and the pursuit of a more decentralized and inclusive form of governance, Confucian theory was transformed from a federalist theory promoting diversity, and advocating decentralization, to one that legitimized a centralized, unified, and authoritarian system. This cannot help but be lamented as a pity of Confucianism.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5b70ef1be909cf8805376edd108bccedb10644cf8e58e81687c4fac548ffc42b","category":"Interdisciplinary"}