{"title":"Unravelling the life‐history patterns and habitat preferences of the Japanese eel (Anguilla japonica) in the Pearl River, China","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15303?af=R","date":1709090576000,"content":"<h2>Abstract</h2>\n<p>Eels have fascinated biologists for centuries due to their amazing long-distance migrations between freshwater habitats and very distant ocean spawning areas. The migratory life histories of the Japanese eel, <i>Anguilla japonica</i>, in the waters of south China are not very clear despite its ecological importance, and the need for fishery regulation and management. In this study, strontium (Sr) and calcium (Ca) microchemical profiles of the otoliths of silver eels were measured by X-ray electron probe microanalysis based on data collected from different habitats (including freshwater and brackish habitats), in the large subtropical Pearl River. The corresponding habitat preference characteristics were further analysed using redundancy analysis (RDA). A total of 195 Japanese eels were collected over 6 years. The collected individuals ranged from 180 to 771 mm in total length and from 8 to 612 g in body weight. Two-dimensional pictures of the Sr:Ca concentrations in otoliths revealed that the <i>A. japonica</i> in the Pearl River are almost entirely river eels, spending the majority of their lives in fresh water without exposure to salt water, while the catadromous migration time has delayed about 1 month in the Pearl River estuary in the past 20 years. RDA analysis further indicated that juveniles and adults preferred water with high salinity and high tide levels. Youth preferred habitats with high river fractals. Our findings contribute to a growing body of evidence showing that the eels are extremely scarce currently and conservation measures against them are imminent, including the protection of brackish and freshwater areas where they live in south China.</p>\n<h2>摘要</h2>\n<p>几个世纪以来，鳗鲡因其在淡水栖息地和海洋产卵区之间的长距离洄游而吸引了无数生物学家，但其在中国南方水系的洄游生活史并不十分清楚，尽管这具有重要的生态学意义。基于从大型亚热带河流——珠江水系不同生境 (包括淡水和半咸水)采集的鳗鲡数据，本研究采用X射线电子技术对银鳗耳石中锶 (Sr) 和钙 (Ca)的微化学特征进行了测定分析，同时采用冗余分析方法 (RDA)进一步分析了其相应的栖息地偏好。在6年的采样时间里，共采集日本鳗鲡 195 尾，全长介于 180-771 mm，体重介于 8-612 g。耳石中 Sr:Ca 浓度显示，珠江水系中的日本鳗鲡几乎全为河鳗，即一生中大部分时间都在淡水中度过。但是在过去的 20 年时间里，日本鳗鲡在珠江口的降海产卵时间推迟了约 1 个月。RDA分析进一步表明，幼鱼和成鱼偏向栖息于高盐度和高潮位的水体，而青年个体则更偏向栖息于河流分形较高的水体。我们的研究表明，珠江水系鳗鲡资源极为稀少，针对它们的保护措施，包括保护它们在中国南部的半咸水和淡水栖息地，迫在眉睫。</p>","author":"Fangmin Shuai, \nHaiyan Li, \nJie Li, \nTao Jiang, \nJian Yang, \nWanling Yang","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"5b77df15441c33688ecc6101ef11d4481a09408cc5a6c79b61e431c31f1c4b18","category":"Environment"}