{"title":"Canyon fills out the Spectral family with aluminium, 650b and mullet options","link":"https://www.bikeradar.com/news/2022-canyon-spectral/","date":1635238828000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/10/3-Wheelsizes-Credit-Roo-Fowler-f0d594e.jpg?quality=45&amp;resize=620,413\" />                                            <p>With Canyon’s Spectral <a href=\"https://www.bikeradar.com/news/canyon-spectral-2021/\">receiving a new carbon 29er frame a year ago</a>, the direct-sales brand has now expanded the Spectral range to include alloy versions of the 29er, as well as a completely updated 27.5in bike, in both materials, and a pair of mullet (mixed wheel size) options.</p>\n<p>The new bikes tie in nicely with the CF 29 models launched last year, with 150mm of travel at the back, paired with 160mm forks, along with updated (and suitably progressive) <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-bike-geometry-and-handling/\">mountain bike geometry</a>.</p>\n<p>Canyon’s confidence in its trail bike shows too, with them rated for use at Enduro World Series races.</p>\n<p>I was also impressed with the carbon Spectral when it launched last year – you can read my <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/canyon-spectral-29-cf-7-review/\">Canyon Spectral 29 CF 7 review</a>, while I’ve also had a chance to form some initial impressions for a first ride review of the <a href=\"https://www.bikeradar.com/reviews/canyon-spectral-cf8-cllctv-review/\">new mullet-wheeled Canyon Spectral CF8 CLLCTV</a>.</p>\n<p>Otherwise, let’s get into the tech details of the expanded Spectral family.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The 2021 Spectral CF remains in the range, with updated colours and specs – this is the one we rode earlier this year</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<h2>Three wheel size options</h2>\n<p>The 27.5in carbon frames take lessons from the 29er, and have been adapted for the smaller wheels with geometry to suit.</p>\n<p>Much like the CF 29, there’s geometry adjustment via a flip-chip that steepens (or slackens) angles by 0.5 degrees and adds or subtracts 8mm from the bottom bracket height.</p>\n<p>So why <a href=\"https://www.bikeradar.com/mtb/mountain-bike-wheel-sizes-26in-650b-and-29in-explained/\">three wheel size options</a>? Well, Canyon reckons the 29er is more confident, more stable and has more grip, all thanks to the bigger wheels. However, the 27.5 bike is more agile and precise, and has a more playful ‘character’.</p>\n<p>Thus, the mullet version gets the front end benefits of the big wheel – rollover abilities and grip – while the smaller wheel at the back gives the bike more agility than the full 29er achieves.</p>\n<p>Likewise, smaller riders who want the control of a 29er might not get buzzed on their backsides as much on the mullet.</p>\n<p><strong>Our first look at the Spectral CF 29 launched last year</strong></p>\n\n<h2>Alloy ahoy!</h2>\n<p>When it comes to alloy bikes, instead of just taking the carbon tube profiles and bending alloy to look the same, Canyon believes that its alloy frames deserve just as much attention.</p>\n<p>As such, both the <a href=\"https://www.bikeradar.com/features/quick-guide-to-bike-frame-materials/#:~:text=Most%20bike%20frames%20are%20constructed,aluminium%20to%20form%20each%20alloy.\">carbon and alloy frames</a> got their own engineers to develop them.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Canyon’s Spectral AL 5 is the entry-level model.</span></figcaption><span> <i>Roo Fowler / Canyon</i></span></div>\n<p>This means the alloy frames have been designed from the ground up, without having to entirely match the organic lines of the carbon frame.</p>\n<p>Tubes have lower radius bends in them and, overall, the tubes are straighter, which helps give the right balance of stiffness and weight.</p>\n<p>There’s an expectation that the alloy bikes will offer better value than their carbon counterparts and, as such, features like flip-chip geometry adjustments aren’t included.</p>\n<p>However, Canyon saw fit to give the alloy bikes the seat angle from the carbon bikes’ steep setting (76.5 degrees) and the head angle from the carbon’s slack setting (64 degrees) – the best of both worlds.</p>\n<h2>An easy life</h2>\n<p>As we saw with the CF 29 last year, pivot hardware is replaceable in the carbon frames, so that damage to the frame’s main tubes can’t be mangled if you make a mistake when spannering.</p>\n<p>The alloy frames don’t get replaceable hardware, though, they get steel inserts instead.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> SRAM’s UDH is becoming more and more popular.</span></figcaption><span> <i>Roo Fowler / Canyon</i></span></div>\n<p>Other neat touches include <a href=\"https://www.bikeradar.com/news/sram-universal-derailleur-hanger/\">SRAM’s UDH</a> (Universal Derailleur Hanger), a 600ml bottle and side-loading cage, as well as rivets under the top tube to hang on-bike storage pouches.</p>\n<p>Carbon bikes get full front to rear internal routing, while the alloy bikes are internal at the front and external at the rear.</p>\n<p>The entire four-bar suspension linkages can be stripped with just a 5 and a 6mm Allen key, while both carbon and alloy pivot points have grease-fill ports to ensure longevity.</p>\n<p>The carbon bikes get a double-sealed bearing, while alloy ones get regular bearings.</p>\n<p>Claimed weights for the carbon frames are 2.6kg, while the alloy frames come in at a touch over 3kg for a medium 29er.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Rivets under the top tube mean you can carry spares easily.</span></figcaption><span> <i>Markus Greber / Canyon</i></span></div>\n<h2>Super fancy CFR</h2>\n<p>As we’ve seen with other Canyon models, including the <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/canyon-exceed-cfr-team-review/\">Exceed CFR</a> cross-country bike, Canyon’s carbon engineers have been able to get a little more extravagant with their bikes.</p>\n<p>The CFR models are all no-holes-barred versions with higher quality, no-expense-spared carbon, and slightly ‘better’ layups used on the top models.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Chainstay protection is designed to keep the bike quiet.</span></figcaption><span> <i>Roo Fowler / Canyon</i></span></div>\n<p>The Spectral CFR framesets weigh around 300g less than the standard bikes, both thanks to the higher modulus carbon and even lightweight paint.</p>\n<h2>Triple Phase suspension</h2>\n<p>Canyon’s take on the <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-mountain-bike-rear-suspension-systems/\">four-bar suspension linkage</a> gives the bikes their Triple Phase Suspension characteristic.</p>\n<p>It describes pretty much what every brand aims for: supple at the start, composed and supportive in the mid and progressive towards the end.</p>\n<p>Our experience of the linkage system suggests that Canyon has it right, with testers often commenting on just how competent Canyon’s suspension is.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The mulleted CF8 CLLCTV gets a rowdy coil shock as part of the package.</span></figcaption><span> <i>Roo Fowler / Canyon</i></span></div>\n<p>On the Spectral, there’s a focus on giving increased anti-squat early in the stroke, so that the bikes pedal well. Then, later on, there’s a touch more progression to give confidence on bigger hits. At least that’s what Canyon claims.</p>\n<h2>Canyon Spectral geometry</h2>\n<p>With three wheel options, the geometry chart for the Spectral is pretty lengthy. As such, we’ve picked out a few pertinent numbers that we think are the most relevant.</p>\n<p>It’s worth noting that the bikes range from XS to XL, but there’s no XL 27.5in bike and no XS 29er. Figures mentioned below are for a size Large and numbers are shared between the wheel sizes unless stated.</p>\n<p>The seat tube is a standard 460mm, with 30mm jumps between sizes. Head tubes vary by 10mm per size, with a Large 29er getting a 115mm head tube, while it’s 145mm on the 27.5in bike.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The G5 dropper can be adjusted by 25mm, in 5mm increments.</span></figcaption><span> <i>Roo Fowler / Canyon</i></span></div>\n<p>Chainstays are 437mm across all 29er sizes, and 432mm on all the 27.5in bikes and the mullet. The bottom bracket sits either 28 or 36mm below the axle, depending on the position of the geometry chip.</p>\n<p>Stack on the 29er is 628mm, while on the 27.5in it’s 631mm. They all get a 485mm reach – nice and long.</p>\n<p>Angles sit at 64 or 64.5 degrees (geo chip dependant), while the seat tube angles vary from around 76 to 78 degrees, depending on the geometry chip and how high your saddle is (as effective seat angles decrease the higher the saddle is positioned).</p>\n<h2>Canyon Spectral Young Hero</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Built for smaller riders, the Young Hero has suspension set up for lighter shredders.</span></figcaption><span> <i>Roo Fowler / Canyon</i></span></div>\n<p>This is a special version of the Spectral designed for kids.</p>\n<p>It gets 140mm of rear-wheel travel and 150mm at the front, as well as 27.5in wheels. It’s designed for riders from 143 to 160cm tall, and the kinematics in the suspension is designed to work well with lighter riders.</p>\n<p>Many suspension products don’t work well with lighter weights, so Canyon has adjusted the kinematics to make sure regular shocks will work properly with lighter riders.</p>\n<h2>Canyon Spectral models and pricing</h2>\n<p>There are eight models in the range, with some versions coming with both 27.5in and 29in wheels, one mullet option, the Young Hero (27.5in only) and CFR (29in only).</p>\n<p>All bikes come kitted out with Canyon’s own G5 finishing kit, including a new dropper that gives 25mm of travel adjustment in 5mm increments, adjustable easily on the trail should you wish.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Canyon’s G5 kit is designed for hard chargers.</span></figcaption><span> <i>Roo Fowler / Canyon</i></span></div>\n<p>We’ve selected our pick of the bunch, and if you want to see details of the mullet Spectral CF8 CLLCTV, check out our <a href=\"https://www.bikeradar.com/reviews/canyon-spectral-cf8-cllctv-review/\">Spectral CF8 CLLCTV first ride review</a>.</p>\n<h3>Canyon Spectral Young Hero specification highlights and price</h3>\n<ul><li><strong>Fork: </strong>RockShox Recon Silver</li>\n<li><strong>Shock: </strong>RockShox Deluxe Select+</li>\n<li><strong>Brakes: </strong>SRAM Guide T</li>\n<li><strong>Wheels:</strong> Shimano MT400 / RaceFace AR25</li>\n<li><strong>Tyres: </strong>Maxxis Minion DHF 2.3in / Maxxis Agressor 2.3in</li>\n<li><strong>Drivetrain: </strong>SRAM SX Eagle</li>\n<li><strong>Price: </strong>£1,849 / €1,849</li>\n</ul><h3>Canyon Spectral 6 specification highlights and price</h3>\n<ul><li><strong>Fork: </strong>RockShox Lyrik Select+</li>\n<li><strong>Shock: </strong>RockShox Super Deluxe Select+</li>\n<li><strong>Brakes: </strong>SRAM Code R</li>\n<li><strong>Wheels: </strong>DT Swiss MTB LN</li>\n<li><strong>Tyres: </strong> Maxxis Minion DHRII 2.4in front and rear</li>\n<li><strong>Drivetrain: </strong>SRAM GX</li>\n<li><strong>Price: </strong>£2,999 / €3,099</li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The CF8 sits in the middle of the carbon range and costs £4,399 / €4,549</span></figcaption><span> <i>Roo Fowler / Canyon</i></span></div>\n<h3>Canyon Spectral CF7 specification highlights and price</h3>\n<ul><li><strong>Fork:</strong> Fox 36 Rhythm</li>\n<li><strong>Shock: </strong>Fox Float X Performance</li>\n<li><strong>Brakes:</strong> Shimano SLX</li>\n<li><strong>Wheels: </strong>DT Swiss XM1900</li>\n<li><strong>Tyres: </strong>Maxxis Minion DHRII 2.4in front and rear</li>\n<li><strong>Drivetrain: </strong>Shimano SLX</li>\n<li><strong>Price: </strong>£3,399 / €3,599</li>\n</ul><h3>Canyon Spectral CFR specification highlights and price</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Top of the range is the CFR, with 29″ only wheels.</span></figcaption><span> <i>Roo Fowler / Canyon</i></span></div>\n<ul><li><strong>Fork: </strong>Fox 36 Factory</li>\n<li><strong>Shock: </strong>Fox Float X Factory</li>\n<li><strong>Brakes: </strong>Shimano XTR</li>\n<li><strong>Wheels: </strong>DT Swiss XMC1200</li>\n<li><strong>Tyres: </strong>Maxxis Minion DHRII 2.4in front and rear</li>\n<li><strong>Drivetrain: </strong>Shimano XTR</li>\n<li><strong>Price: £</strong>6,499 / €6,699</li>\n</ul>","author":"Tom Marvin","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"5b8ed8bcc85a369afe4ed16378cbde3e3f974df3324145839ef01e9fb96a2259","category":"Cycling"}