{"title":"Revealing the spoilage characteristics of refrigerated prepared beef steak by advanced bioinformatics tools","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13605?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Although microorganisms are the main cause of spoilage in prepared beef steaks, very few deep spoilage mechanisms have been reported so far. Aiming to unravel the mechanisms during 12 days of storage at 4 °C affecting the quality of prepared beef steak, the present study investigated the changes in microbial dynamic community using a combined high-throughput sequencing combined and bioinformatics. In addition, gas chromatography-mass spectrometry combined with multivariate statistical analysis was utilized to identify marker candidates for prepared steaks. Furthermore, cloud platform analysis was applied to determine prepared beef steak spoilage, including the relationship between microbiological and physicochemical indicators and volatile compounds.</p>\n<h2>RESULTS</h2>\n<p>The results showed that the dominant groups of <i>Pseudomonas</i>, <i>Brochothrix thermosphacta</i>, <i>Lactobacillus</i> and <i>Lactococcus</i> caused the spoilage of prepared beef steak, which are strongly associated with significant changes in physicochemical properties and volatile organic compounds (furan-2-pentyl-, pentanal, 1-octanol, 1-nonanol and dimethyl sulfide). Metabolic pathways were proposed, among which lipid metabolism and amino acid metabolism were most abundant.</p>\n<h2>CONCLUSION</h2>\n<p>The present study is helpful with respect to further understanding the relationship between spoilage microorganisms and the quality of prepared beef steak, and provides a reference for investigating the spoilage mechanism of dominant spoilage bacteria and how to extend the shelf life of meat products. © 2024 Society of Chemical Industry.</p>","author":"Wendi Zhang, \nYongsheng Ni, \nYong Xie, \nLijun Tan, \nJinsong Zhao, \nXiao min Li, \nCong Li, \nBaocai Xu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"5b90e4314451fe66535d5b6f6559d8c8d4dc1e9858656f75625fc0d2c81ba189","category":"Environment"}