{"title":"Strength Evaluation of Lime-Stabilized Fly Ash for Pavement Construction in Layered Systems","link":"http://link.springer.com/10.1007/978-981-97-8237-6_2","date":1735689600000,"content":"<h3>Abstract</h3>\n                  <p>The safe disposal of fly ash generated by coal-fired thermal power plants presents a significant challenge. To tackle this issue, the utilization of fly ash in geotechnical construction has emerged as a cost-effective and efficient solution. This study is centered on the evaluation of the strength parameters of lime-stabilized fly ash in layered systems, with the aim of addressing the limitations of the commonly used mixing method for incorporating fly ash into soil. Laboratory experiments were conducted to investigate the behavior of lime-stabilized fly ash under various conditions and enhance its specific qualities. These experiments included unconfined compression tests, Proctor compaction tests, California Bearing Ratio (CBR) tests, and laboratory model tests for load-bearing and distribution testing. These tests offered a controlled environment for exploring the relationships between strength parameters and predicting the performance of lime-stabilized fly ash in real-world scenarios. The findings of this research contribute to our understanding of the behavior and performance of lime-stabilized fly ash in geotechnical applications. The study provides insights into the suitability of lime-stabilized fly ash for various construction purposes, such as highway and railway embankments, landfills, road bases, and sub-bases. In summary, this study demonstrates the potential of lime-stabilized fly ash as a viable alternative and feasible method for large-scale construction, addressing both the safe disposal of fly ash and the enhancement of soft ground strength. The outcomes of this study have significant implications for both the industry and environmental conservation, enabling the sustainable management of fly ash with optimized cost and time efficiency.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"5b9568f2c279aa108726356cd7e3e0e7db8d608ae5402677c7b25216c627d430","category":"Environment"}