{"title":"Effects of natural treatments on the varroa mite infestation levels and overall health of honey bee (<i>Apis mellifera</i>) colonies","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302846","date":1715090400000,"content":"<p>by Laura Narciso, Martina Topini, Sonia Ferraiuolo, Giovanni Ianiro, Cinzia Marianelli</p>\r\n\r\nThe survival of the honey bee (<i>Apis mellifera</i>), which has a crucial role in pollination and ecosystem maintenance, is threatened by many pathogens, including parasites, bacteria, fungi and viruses. The ectoparasite <i>Varroa destructor</i> is considered the major cause of the worldwide decline in honey bee colony health. Although several synthetic acaricides are available to control Varroa infestations, resistant mites and side effects on bees have been documented. The development of natural alternatives for mite control is therefore encouraged. The study aims at exploring the effects of cinnamon and oregano essential oils (EOs) and of a mixed fruit cocktail juice on mite infestation levels and bee colony health. A multi-method study including hive inspection, mite count, molecular detection of fungal, bacterial and viral pathogens, analysis of <i>defensin-1</i>, <i>hymenoptaecin</i> and <i>vitellogenin</i> immune gene expression, colony density and honey production data, was conducted in a 20-hive experimental apiary. The colonies were divided into five groups: four treatment groups and one control group. The treatment groups were fed on a sugar syrup supplemented with cinnamon EO, oregano EO, a 1:1 mixture of both EOs, or a juice cocktail. An unsupplemented syrup was, instead, used to feed the control group. While <i>V</i>. <i>destructor</i> affected all the colonies throughout the study, no differences in mite infestation levels, population density and honey yield were observed between treatment and control groups. An overexpression of <i>vitellogenin</i> was instead found in all EO-treated groups, even though a significant difference was only found in the group treated with the 1:1 EO mixture. Viral (DWV, CBPV and BQCV), fungal (<i>Nosema ceranae</i>) and bacterial (<i>Melissococcus plutonius</i>) pathogens from both symptomatic and asymptomatic colonies were detected.","author":"Laura Narciso","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5b972a999a8943e07ba5655207f78f5c502f7bdc67f25bcbeef34f2c487d4774","category":"Interdisciplinary"}