{"title":"Scale morphology is a promising, additional tool for exploring the taxonomy and ecology of freshwater fishes","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12826?af=R","date":1711612784000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/758bfdac-20aa-4cd2-b947-c1406694f57a/faf12826-toc-0001-m.png\" alt=\"Scale morphology is a promising, additional tool for exploring the taxonomy and ecology of freshwater fishes\" />\n<p>The shape and relative size of the fish scales provide useful information on both taxonomy and environmental needs.</p>\n<br />\n<h2>Abstract</h2>\n<p>It has long been recognized that presence–absence, localisation, size, number and shape of fish scales can be important taxonomic features. Although there are some notes on the relationship between scale morphology and ecological needs, in the absence of a sufficiently large and detailed database, the morphological variability of fish scales and the factors responsible for this variability have not yet been explored in detail. For this reason, a database—which contains the shape and relative size data of 193 freshwater fish taxa of 14 orders, originated from five biogeographic realms—has been built. Database analyses showed that both the scale shape and relative size are proper taxonomic indicators. They can be used to separate higher taxonomic categories (e.g., orders), and by the simultaneous analysis of shape and size scale morphology, we showed increased sensitivity for species-level detachments. Our results suggest that while both the shape and the size of the fish scales are genetically determined, they are also useful descriptors of the niche segregation (habitat use, flow preference) of close relative species. Scale morphology is a promising additional tool to specify the environmental preferences of lesser known or close relative recent and extinct fish species. And also can be of great help in such cases when only the scales are available for taxonomic identification, for example, in the research field of archaeology and palaeontology.</p>","author":"Bálint Bánó, \nAleksey Bolotovskiy, \nBoris Levin, \nGeorge M. T. Mattox, \nMauricio Cetra, \nIstván Czeglédi, \nPéter Takács","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"5ba02d5770ed01bd5d5c04824dbb401f550c5f7bc6a7653478f67025ababb1cf","category":"Environment"}