{"title":"Insights into the natural and cultural history of Typha orientalis (Raupō) in Aotearoa New Zealand","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000240","date":1727272800000,"content":"<p>by Xun Li, Rewi Newnham, Marcus J. Vandergoes, Valerie van den Bos, Jamie D. Howarth, Andrew Rees, Lizette Reyes, Chris Clowes, Erica M. Crouch, Rose Gregersen, Susanna A. Wood, Reece Martin, Riki Ellison, Tūmai Cassidy, Rawiri Smith, Charlotte Šunde, Roger Tremain, Te Aomania Te Koha</p>\r\n\r\nA new multi-proxy paleo database for lake ecosystem and catchment change in Aotearoa New Zealand points to the potential resource and ecosystem service roles of <i>Typha orientalis</i> (raupō). In the context of chronic wetland degradation in Aotearoa New Zealand over the past century, this iconic yet enigmatic wetland plant can be viewed, alternately, as an invasive threat; a valuable cultural and economic resource; and a natural, indigenous agent for bioremediation. Our investigation reconstructs the history of <i>raupō</i> over the past ~1000 years, based on 92 new pollen records generated from lake sites across Aotearoa New Zealand. At almost every site where raupō is present today, its expansion is promoted to varying extents during periods of human activity and at 87% of sites investigated, raupō shows its maximum palynological abundance post human arrival. Multiple patterns of response over time point to a range of hydrological, trophic, and cultural scenarios that are conducive for raupō expansion, raising prospects for its potential role in mitigating the ecological impacts of disturbance. Raupō expansion, promoted by anthropogenic forest clearances and associated sediment and nutrient flux, would in turn have provided new opportunities for its use as a valuable food and material resource, prompting further questions as to the extent it was deliberately managed by indigenous populations. As both a benefactor from, and provider for, expanding populations, raupō may be regarded as a human associate in Aotearoa New Zealand prehistory. As well as being indigenous to Aotearoa New Zealand, <i>T</i>. <i>orientalis</i> also occurs naturally in Australia and east Asia and shares the intrinsic ecological and morphological attributes of the ~40 species or hybrids of <i>Typha</i> that span most of the planet. This work therefore may encourage wider application of the genus as a biocultural asset informed from its local natural history.","author":"Xun Li","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"5ba1a6f6c47af146e13a4bffe47e5c50f1349086d8cd59ebf5768647e7f3b5b1","category":"Environment"}