{"title":"Changing the focus: Facilitating engagement in physical activity for people living with mild dementia in a local community—Protocol for a pre-post mixed methods feasibility study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307018","date":1726236000000,"content":"<p>by Den-Ching A. Lee, Michele Callisaya, Claudia Meyer, Morag E. Taylor, Katherine Lawler, Pazit Levinger, Susan Hunter, Dawn Mackey, Elissa Burton, Natasha Brusco, Terry P. Haines, Christina Ekegren, Amelia Crabtree, Lisa Licciardi, Keith D. Hill</p>\r\n\r\nThis study aims to address and improve the low physical activity levels among people with mild dementia by implementing a novel shared decision-making and motivational support program, named \"Changing the Focus\". It will utilise a pre-post mixed methods approach, aiming to recruit 60 community living older people with mild dementia and their care-partners. The shared decision-making process will involve the person living with dementia, their care-partner, and a research therapist, using a purpose-designed discussion tool including factors such as preferred physical activities, health status, local opportunities and program accessibility. This process aims to identify personalised local physical activity opportunities. Participants will be supported with the help of a research therapist to engage in targeted community-based physical activities for 12-months, to progress towards the recommended physical activity guidelines of 150 minutes per week. The intervention provided by the research therapist will include three home visits (baseline, 6- and 12-months) and seven motivational support phone calls (within the first six months). Research therapists may provide additional home visits and support calls as needed. Primary outcomes include program participation (participants living with dementia continuing with the program after 12-months), total physical activity time per week (measured using the Active Australia Survey at baseline, 6- and 12- months) and program acceptability (assessed through semi-structured interviews with participants, care-partners, referrers, and physical activity providers). Secondary outcomes include physical performance, mental health, wellbeing measures, and impact on care-partners (evaluated through physical tests or validated scales at baseline, 6- and 12-months). Other implementation aspects include reach, maintenance, safety (falls, other adverse events) and an economic evaluation. Results will inform feasibility, potential benefits, and challenges associated with this innovative shared decision-making and supported physical activity program for people living with mild dementia. Findings will guide future large-scale studies and contribute to enhancing physical activity opportunities for this population.","author":"Den-Ching A. Lee","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5ba133e9beb5e55b3856c79e61199ad5328b66860083bee5d2c5e19693879575","category":"Interdisciplinary"}