{"title":"The systematics of the amphidromous shrimp Macrobrachium tenellum (Smith, 1871) (Decapoda: Caridea: Palaemonidae) from the Mexican Pacific slope","link":"https://academic.oup.com/jcb/article/doi/10.1093/jcbiol/ruae013/7625441?rss=1","date":1710115200000,"content":"<span><div>Abstract</div>We had previously revised the systematics of four species of <span>Macrobrachium</span><a href=\"#CIT0064\">Spence Bate, 1868</a> from the Pacific coast of Mexico, including the Baja California Peninsula (BCP): <span>M. americanum</span><a href=\"#CIT0064\">Spence Bate, 1868</a>, <span>M. digueti</span> (<a href=\"#CIT0009\">Bouvier, 1895</a>), <span>M. hobbsi</span> Nates &amp; Villalobos in <a href=\"#CIT0070\">Villalobos Hiriart &amp; Nates Rodríguez, 1990</a>, and <span>M. occidentale</span> Holthuis, 1950. Genetic analyses of the mitochondrial markers 16S ribosomal RNA (16S) and cytochrome oxidase I (COI) of individuals of these morphological species from BCP have shown that, even facing the Gulf of California (Sea of Cortés) as an apparent marine ecological barrier, they are conspecific to their respective genetic lineages (species) found from the Pacific slope of mainland Mexico. We discuss the systematics of the fifth species of <span>Macrobrachium</span> from the Mexican Pacific slope, <span>M. tenellum</span> (<a href=\"#CIT0063\">Smith, 1871</a>) to test the hypothesis that individuals of the putative <span>M. tenellum</span> from BCP belong to the same species from the Pacific slope of mainland Mexico. We revised the morphological characters of taxonomic importance using material obtained in the field and voucher material deposited in Mexican scientific collections, and performed molecular genetic analyses with newly generated fragments of the mitochondrial markers 16S and COI. We conclude, as in our previous studies on <span>Macrobrachium</span> species of the region, that the examined specimens of the putative <span>M. tenellum</span> from BCP belong to the same species found on the Pacific slope of mainland Mexico, and that oceanic dispersal is responsible for the distribution of the species of <span>Macrobrachium</span> in the peninsula rather than by vicariant events.</span>","author":"","siteTitle":"Journal of Crustacean Biology Current Issue","siteHash":"8ca07ea220dbc7082c62912ab6b47a7a5a309f6e19a7257844b27bf0267b5f04","entryHash":"5ba28e61f45eb93406b60ea3c6b9b22c16944974c047b24ba57461c5fc8c8c67","category":"Environment"}