{"title":"PSVI-8 Dietary Fusarium mycotoxin exposure to late gestation and lactating sows does not impact reproductive performance but attenuates the acute phase response","link":"https://academic.oup.com/jas/article/102/Supplement_3/536/7757666?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Mycotoxins are toxic metabolites from molds that can contaminate cereal grains in the field and during storage. Pigs are very sensitive to deoxynivalenol (DON) and other Fusarium mycotoxins, and their diets contain high proportions of cereals and fibrous cereal byproducts such as dried distillers grains. This puts them at an increased risk for negative physiological effects. The primary objective of this study was to assess the physiological response of sows exposed to Fusarium mycotoxins in late gestation in terms of reproductive performance and immune function, and to determine if maternal exposure impacted piglet growth and immune function. The secondary objective was to evaluate the mitigation efficacy of two mycotoxin binder products. Sows (n = 44) were randomly allocated into 4 treatment groups (n = 11): negative control (NC), positive control containing 2.85 ppm DON (PC), PC + mycotoxin binder TOXO-XL (XL), or PC + mycotoxin binder TOXO-HP (HP). The sow diets were fed from 70 d of gestation until piglet weaning at post-partum d (ppd) 21. Sow feed intake, body weight (BW), litter birth characteristics (number born alive, stillborn, and mummied), as well as piglet BW, feed intake, number weaned, and survivability until ~56 d of age were recorded. Sows were immunized intramuscularly with lipopolysaccharide (LPS) to assess the acute-phase response across treatments on ppd 22, and serum samples were collected for cytokine analysis by multiplex immunoassay. One male and one female piglet from each litter were also immunized intramuscularly with LPS on ppd 28, and serum samples were collected for cytokine analysis. Though PC treatment tended to affect sow feed intake during lactation compared with NC (<span>P</span> = 0.08), there were no differences for sow feed intake during gestation, sow BW, piglet birth weight, litter birth weight, piglet average daily gains, or piglet feed conversion ratio post-weaning. The sow LPS challenge induced inflammation as evidenced by increased expression of pro-inflammatory cytokines [tumor necrosis factor (TNF) α, interleukin (IL)-1A, IL-1B, IL-6). The PC sows had attenuated cytokine expression 2 h post-challenge compared with NC sows in terms of IL-1A, IL-1B, IL-2, IL-4, IL-10, IL-12, and IL-18 expression (<span>P</span> &lt; 0.05). The addition of TOXO-HP to the feed provided a moderate improvement in the expression of IL-1A (<span>P</span> = 0.08), IL-10 (<span>P</span> = 0.08), and IL-12 (<span>P</span> = 0.09) compared with PC. Piglet acute-phase response data reflected similar trends to the sow data with piglets from PC sows having attenuated cytokine expression, but it did not reach statistical significance. Overall, 2.85 ppm DON contaminated diets did not significantly affect sow production measures, but it did attenuate the sow acute phase response to LPS. The addition of TOXO-HP provided a mild but not significant remediation in the acute phase response, demonstrating its potential for use in contaminated feed.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5bb7c6d4c90f45aec948af6e37e192ca640be5430c3b60d51c671859e1c12b1d","category":"Environment"}