{"title":"The degradation of a nonylphenol isomer in water and soil of typical sewage irrigation area in China","link":"https://onlinelibrary.wiley.com/doi/10.1111/wej.12910?af=R","date":1704940489000,"content":"<h2>Abstract</h2>\n<p>Nonylphenols (NPs), one of the known endocrine disrupting organic pollutants, had received full attention for their estrogenic potency and ubiquitous distribution in the environment. Due to its chemical properties and compositions of technical nonylphenols (tNPs), which was persistent and soil environments for a long time and affect the ecosystem vigorously, degradation behaviour of a nonylphenol isomer (NP<sub>38</sub>) and the para-substituded nonylphenols (4-NPs) in water and soil was compared in this study. The results showed that the 4-NPs and NP<sub>38</sub> could be degraded under the mercury lamp in ultrapure water, 90% of 4-NPs and NP<sub>38</sub> were photodegradated in 2 h, but the removal rate of the 4-NPs was slightly faster than the NP<sub>38</sub>. The NP<sub>38</sub> was almost completely decay under the UV in 120 min. The active species (NO<sub>3</sub>\n<sup>−</sup> and Fe<sup>3+</sup>) were benefit for the photogradation of NP<sub>38</sub> and presented higher efficiency under the higher concentration. The biodegradable curves of the 4-NPs and NP<sub>38</sub> in the SS (The soil from sewage irrigation area) were similar, 84% of the NP<sub>38</sub> was removed after 20 days later in SS, the 62.25% of the NP<sub>38</sub> was remained after 60 days later in CS (the soil was from the groundwater irrigation area), but the removal rate of the NP<sub>38</sub> was nearly two times to the 4-NPs in the CS, and the structure of the nonylphenol isomers with α-quaternary had influenced on its degradation in soils. The study was helpful for better understanding the migration and transformation behaviour of NPs and provided scientific basis for accurate assessment of environmental risk of NPs from the sewage irrigation area.</p>","author":"Min Liu, \nLiangyuan Zhao, \nWei Deng, \nCaixiang Zhang, \nXiaoping Liao, \nHuawei Huang, \nCheng Han, \nYuan Hu, \nMengmeng Wu","siteTitle":"Wiley: Water and Environment Journal: Table of Contents","siteHash":"b8106c59269b0bf6595ebcba72d4376e8b07e3df9f0e7d2a7b1cfbc109aa602a","entryHash":"5bc5d9dc2b50d058bf36a50ad1da3a8986b79e286c5ad5b1514262bc0b6017e2","category":"Environment"}