{"title":"Development of LA-MRSA Loads in Pigs and Pig Stables during the Fattening Period","link":"https://www.preprints.org/manuscript/202409.0481/v1","date":1725601098000,"content":"Livestock-associated methicillin-resistant Staphylococcus aureus (LA-MRSA) is widespread in European pig production, and although it is not an important food-borne pathogen, it constitutes a potential occupational hazard to farm workers and possibly to their household members. Farm workers can be exposed to LA-MRSA via direct contact with pigs and via airborne transmission. Bacteria can then be carried home in the nose or on the skin, potentially exposing household members. Therefore, it is important to consider LA-MRSA in a one-health context, studying human exposure by investigating LA-MRSA levels in pigs and in the farm environment, air, and dust. \nIn the present investigation, we quantified LA-MRSA levels in nasal swab samples, air samples, and dust, collected at three different time points in a farm rearing pigs from appr. 30 kg until slaughter. Sampling was repeated across seven batches of pigs, resulting in the analysis of 504 nasal swab samples, together with air and dust samples. LA-MRSA was cultured and quantified on MRSA2 agar plates. \nOur findings revealed a significant batch-to-batch variation and a significant decrease of 94.1 % in LA-MRSA levels during the rearing period. Despite this decrease, all nasal swab samples tested positive, with the highest level reaching 353,000 cfu in a sample. In the 42 air samples collected, we found low to moderate LA-MRSA levels, with a maximum of 568 and an average of 63 cfu/m3. In the 28 dust samples collected during the second and third sampling periods, LA-MRSA counts were high, reaching up to 37,272 cfu/g, with an average of 17,185 cfu/g. The results indicate that while LA-MRSA levels in pigs gradually decrease with age and reach low levels before slaughter, the bacterium remains highly abundant in dust, which may pose an occupational hazard to farm workers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5bcbb64466db2d9dd4af0e5ec17d01f25fc30ccf969a9facd0ad2fbbde614fdd","category":"Interdisciplinary"}