{"title":"Quantifying the impacts of management and herbicide resistance on regional plant population dynamics in the face of missing data","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14608?af=R","date":1715145339000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/76ae19a4-f66c-4ccd-a5f4-27275025883e/jpe14608-toc-0001-m.png\" alt=\"Quantifying the impacts of management and herbicide resistance on regional plant population dynamics in the face of missing data\" />\n<p>As we demonstrate that high herbicide resistance levels can produce extremely severe weed infestations, monitoring herbicide resistance is a priority for farmers across Western Europe. Furthermore, developing non-chemical control methods is essential to control current weed populations, and prevent further resistance evolution. We recommend that planning interventions that centre on crop rotation and incorporate spring sewing and cultivation to provide the best reductions in weed densities. More generally, by directly accounting for missing data our framework permits the analysis of management practices with data that would otherwise be severely compromised.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nA key challenge in the management of populations is to quantify the impact of interventions in the face of environmental and phenotypic variability. However, accurate estimation of the effects of management and environment, in large-scale ecological research is often limited by the expense of data collection, the inherent trade-off between quality and quantity, and missing data.\n\nIn this paper we develop a novel modelling framework, and demographically informed imputation scheme, to comprehensively account for the uncertainty generated by missing population, management, and herbicide resistance data. Using this framework and a large dataset (178 sites over 3 years) on the densities of a destructive arable weed (<i>Alopecurus myosuroides</i>) we investigate the effects of environment, management, and evolved herbicide resistance, on weed population dynamics.\n\nIn this study we quantify the marginal effects of a suite of common management practices, including cropping, cultivation, and herbicide pressure, and evolved herbicide resistance, on weed population dynamics.\n\nUsing this framework, we provide the first empirically backed demonstration that herbicide resistance is a key driver of population dynamics in arable weeds at regional scales. Whilst cultivation type had minimal impact on weed density, crop rotation, and earlier cultivation and drill dates consistently reduced infestation severity.\n\n<i>Synthesis and applications</i>: As we demonstrate that high herbicide resistance levels can produce extremely severe weed infestations, monitoring herbicide resistance is a priority for farmers across Western Europe. Furthermore, developing non-chemical control methods is essential to control current weed populations, and prevent further resistance evolution. We recommend that planning interventions that centre on crop rotation and incorporate spring sewing and cultivation to provide the best reductions in weed densities. More generally, by directly accounting for missing data our framework permits the analysis of management practices with data that would otherwise be severely compromised.\n</p>","author":"Robert M. Goodsell, \nDavid Comont, \nHelen Hicks, \nJames Lambert, \nRichard Hull, \nLaura Crook, \nPaolo Fraccaro, \nKatharina Reusch, \nRobert P. Freckleton, \nDylan Z. Childs","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"5bcc9c26e431017cc0a7e906987b285b2c9567b282255a759a2a5b4ac6bb044b","category":"Environment"}