{"title":"Non‐Invasive Prediction of Barramundi (Lates calcarifer) Flesh Lightness Using Near‐Infrared Spectroscopy","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/1524148?af=R","date":1728994768000,"content":"<p>Barramundi (<i>Lates calcarifer</i>) is an important aquaculture species extensively farmed throughout its natural distribution of Australia and Southeast Asia, as well as being increasingly farmed in the Middle East, USA, and Europe. Barramundi has a firm, pink-white flesh; however, fillets from farmed barramundi often exhibit grey colouration. This grey colouration detracts from its market appeal, leading to challenges in consumer acceptance and competitiveness of the product against other white fillet fish. Selective breeding, environmental manipulation, and dietary adjustments are being investigated to reduce grey flesh colouration. Yet, the absence of a rapid, noninvasive approach to predict greyness in flesh means that large numbers of samples cannot be quickly evaluated, and issues cannot be mitigated preharvest and noninvasively to preserve the fish. To address this issue, rapid analysis of flesh greyness was developed using noninvasive near-infrared (NIR) spectroscopy through the fish skin. Thirty fish were purchased from a barramundi farm, filleted, and divided into 3 cm sections, yielding a total of 335 samples from both dorsal and ventral fillet regions. NIR spectral data were obtained from the skin side of all samples, and colouration data were collected from the flesh side of the same samples. Data were randomised into a training set (256 spectra) and a validation set (79 spectra). Predictive models were developed using flesh colour as the training input for skin NIR spectra. The refined partial least squares regression model explained 78% of the variation in the medial flesh colour (R<sup>2</sup>\n<sub>pe</sub> of 0.776, an RMSEP of 2.820, and an RPD<sub>pe</sub> of 2.122) demonstrating the ability to adequately predict the flesh quality through skin spectra. This highlights the potential of NIR spectroscopy as a dependable, noninvasive tool, enabling the rapid evaluation of large samples and offering the potential to address flesh colouration issues in barramundi preharvest.</p>","author":"Weiyu Chen, \nDean R. Jerry, \nRonald D. White, \nLeo Nankervis, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"5bcd546d5bbebb3ea2070c5bbd127a5089e6d11b7880749209a0728b83bbc23c","category":"Environment"}