{"title":"Three-Dimensional Printed Customized Scaffolds Covered with Decellularized Bone Extracellular Matrix for Open-Wedge High-Tibial Osteotomy","link":"https://www.preprints.org/manuscript/202407.2529/v1","date":1722408824000,"content":"Void fillers are required for osseous gaps generated after orthopedic procedures as medial open-wedge high-tibial osteotomy (MOWHTO) to provide sufficient structural support and a rapid osteosynthesis. We developed a novel three-dimensional (3D) printing-based platform technology using the customized 3D scaffolds covered with polycaprolactone (PCL)/β-tri-calcium phosphates (β-TCP)/bone decellularized extracellular matrix (dECM) for use as bone substitute scaffold, which can be effectively exploited to estimate the calculated correction angle with preoperative simulations. PCL/β-TCP/bone dECM scaffolds demonstrated significantly higher cell contain levels in cell seeding efficiency, excellent proliferation capacity, and promotion of early osteogenic differentiation compared with PCL/β-TCP scaffolds. The scaffolds promoted bone mineralization at the early time points of an in vivo study (8 weeks) and exhibited biodegradable properties (38% for 16 weeks). The correction angle measured after osteotomy using 3D printed scaffolds was estimated with high accuracy with low errors (10.3° ± 0.9°), was and was not significantly different even in the presence of lateral cortical hinge fractures. The customized 3D scaffold enriched with PCL/β-TCP/bone dECM yielded excellent cell seeding efficiency, proliferation capacity, early osteogenic differentiation, and bone mineralization outcomes. It is expected to solve the disadvantages related with bone union in MOWHTO, and to replace autografts in the future.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5bdbf0ebe0c5ad6de7043edba62b70b22919ed4f751ac0731749c5c8aa1c62c2","category":"Interdisciplinary"}