{"title":"Triphenyl phosphate interferes with the synthesis of steroid hormones through the PPARγ/CD36 pathway in human trophoblast JEG‐3 cells","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24186?af=R","date":1715774307000,"content":"<h2>Abstract</h2>\n<p>Triphenyl phosphate (TPhP), a chemical commonly found in human placenta and breast milk, has been shown to disturb the endocrine system. Our previous study confirmed that TPhP could accumulate in the placenta and interference with placental lipid metabolism and steroid hormone synthesis, as well as induce endoplasmic reticulum (ER) stress through PPARγ in human placental trophoblast JEG-3 cells. However, the molecular mechanism underlying this disruption remains unknown. Our study aimed to identify the role of the PPARγ/CD36 pathway in TPhP-induced steroid hormone disruption. We found that TPhP increased lipid accumulation, total cholesterol, low- and high-density protein cholesterol, progesterone, estradiol, glucocorticoid, and aldosterone levels, and genes related to steroid hormones synthesis, including <i>3βHSD1</i>, <i>17βHSD1</i>, <i>CYP11A</i>, <i>CYP19</i>, and <i>CYP21</i>. These effects were largely blocked by co-exposure with either a PPARγ antagonist GW9662 or knockdown of CD36 using siRNA (siCD36). Furthermore, an ER stress inhibitor 4-PBA attenuated the effect of TPhP on progesterone and glucocorticoid levels, and siCD36 reduced ER stress-related protein levels induced by TPhP, including BiP, PERK, and CHOP. These findings suggest that ER stress may also play a role in the disruption of steroid hormone synthesis by TPhP. As our study has shed light on the PPARγ/CD36 pathway's involvement in the disturbance of steroid hormone biosynthesis by TPhP in the JEG-3 cells, further investigations of the potential impacts on the placental function and following birth outcome are warranted.</p>","author":"Yuting Chen, \nQian Liu, \nYao Wang, \nMengzhu Jiang, \nJing Zhang, \nYuguo Liu, \nXiaoxun Lu, \nHuanwen Tang, \nXiaoshan Liu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"5bdece40d845951327dd32b8d5729a923776ca5b06633b2d2b73baae8d049400","category":"Environment"}