{"title":"Sega รู้สึกเป็นเกียรติที่ Xbox หรือบริษัทอื่น ๆ สนใจเข้าซื้อกิจการแต่ไม่ขายอยู่ดี","link":"https://www.blognone.com/node/136794","date":1700203136000,"content":"<div><div><div><p>แม้จะมีข่าวลืออย่างต่อเนื่องว่า Sega จะเป็นรายต่อไปที่ Xbox จะเข้ากิจการ แต่ Shuji Utsumi ซีโอโอของ Sega ระบุว่าบริษัทไม่ได้มองหาผู้ที่ซื้อจะมาซื้อกิจการแต่อย่างใด ในความเป็นจริง Sega กำลังขยาย และมองหาการเข้าซื้อกิจการอื่นที่เป็นไปได้แทน ถึงกระนั้น Sega ก็รู้สึกเป็นเกียรติที่บริษัทอื่น ๆ มากมายที่ต้องการเข้ามาซื้อกิจการ</p>\n<p>ในระหว่าง Microsoft ต่อสู้กับ FTC ในศาล กรณีซื้อเข้ากิจการ Activision Blizzard ทำให้มีข้อมูลมากมายของ Microsoft หลุดออกมา หนึ่งในอีเมลที่เปิดเผยแสดงให้เห็นว่าในปี 2021 Phil Spencer หัวหน้า Xbox ขอให้ Satya Nadella ซีอีโอของ Microsoft และ Amy Hood ซีเอฟโอของ Microsoft อนุมัติเพื่อให้เขาได้เริ่มพูดคุยเรื่องการซื้อ Sega เพื่อช่วยเร่งการเติบโตของ Game Pass แต่จากข้อมูลของ Sega, ข้อตกลง และข้อเสนออื่น ๆ การเข้าซื้อบริษัทไม่น่าจะเกิดขึ้นได้แล้ว</p>\n<p>ในการให้สัมภาษณ์กับ CNBC คุณ Shuji Utsumi ซีโอโอของ Sega ได้ปฏิเสธข้อสันนิษฐานที่ว่า Xbox หรือใครก็ตามจะเข้าซื้อ Sega โดยบอกว่า มีบริษัทหลายแห่งสนใจเข้าซื้อกิจการจริง ซึ่ง Sega รู้สึกเป็นเกียรติ แต่ Sega เองก็มีทรัพย์สินทางปัญญา และศักยภาพอยู่แล้ว เพราะงั้นจึงคิดว่าการเข้ามาซื้อกิจการไม่น่าจะเกิดขึ้นได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/dda332281f2924d4cf008cff361b5685.png\" /></p>\n<p>ล่าสุด Sega เหมือนจะมีแผนของตัวเองอยู่แล้ว จากการ<a href=\"https://www.blognone.com/node/136778\">เตรียมหยิบแฟรนไชส์อื่น ๆ มาดัดแปลง</a> หลังประสบความสำเร็จกับภาพยนตร์ Sonic</p>\n<p>ที่มา - <a href=\"https://kotaku.com/sega-xbox-spencer-merger-buyout-microsoft-sonic-persona-1851028452\"></a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sega\">Sega</a></div><div><a href=\"/topics/xbox\">Xbox</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5be5c8280bb8eac26e638fb044b1618d9be38c20ca329803f3aa8b8c20c0bcf7","category":"Thai"}