{"title":"The impact of sire breed on feedlot performance and carcass characteristics of beef × Holstein steers","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae043/7634116?rss=1","date":1711152000000,"content":"<span><div>Abstract</div>Dairy herds are mating a portion of cows to beef cattle semen to create a value-added calf. Objectives of this study were to compare the feedlot performance and carcass characteristics of beef × Holstein steers by breed when sires represented bulls with commercially available semen. Three groups of single-born, male calves (<span>n</span> = 262) born to Holstein dams on 10 Pennsylvania dairies were sourced during 3 yr. Steers were sired by seven beef breeds: Angus, Charolais, Limousin, Hereford, Red Angus, Simmental, and Wagyu. Steers were picked up within a week of age and raised at two preweaned calf facilities until weaning (8 ± 1 wk of age) under similar health and management protocols. Steers were then transported to a commercial calf growing facility where they were managed as a single group until 10 ± 2 mo of age when they were moved to be finished at the Pennsylvania Department of Agriculture’s Livestock Evaluation Center feedlot. Groups of steers were selected for slaughter based on body weight. Carcass characteristics were evaluated by trained personnel and a three-rib section of the longissimus muscle (LM) was collected from each carcass for Warner-Bratzler shear force (WBSF) evaluation and intramuscular fat determination. Steers sired by all sire breeds except for Limousin had greater average daily gain (ADG; 1.62 to 1.76 kg/d) than Wagyu × Holstein steers (1.39 kg/d; <span>P</span> &lt; 0.05). Angus-sired steers had an 8.6% greater ADG than Red Angus-sired steers (<span>P</span> &lt; 0.05). Angus, Charolais (1.73 kg/d), and Simmental-sired steers (1.68 kg/d) also had greater ADG than Limousin-sired steers (1.55 kg/d; <span>P</span> &lt; 0.05). Wagyu × Holstein steers spent 5 to 26 more days on feed (<span>P</span> &lt; 0.05) than Limousin × Holstein, Simmental × Holstein, Angus × Holstein, and Charolais × Holstein steers. Angus and Charolais-sired steers were also on feed for 19 and 21 d fewer, respectively, than Limousin-sired steers (<span>P</span> &lt; 0.05). Red Angus-sired steers had greater marbling scores than Simmental and Limousin-sired steers and Angus and Charolais-sired steers had greater marbling scores than Limousin-sired steers (<span>P</span> &lt; 0.05). Angus, Limousin, and Hereford-sired steers produced the most tender LM as evaluated by WBSF; Angus-sired carcasses (3.82 kg) were more tender than Charolais (4.30 kg) and Simmental-sired carcasses (4.51 kg; <span>P</span> &lt; 0.05). Limousin and Hereford-sired steers (3.70 and 3.83 kg, respectively) also had more tender steaks than Simmental-sired steers.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"5be81ec17efe87a95ae7438b488436c27b27fa8530ff135fe5895c6ba3eb6e40","category":"Environment"}