{"title":"Build Back Better – The Result","link":"https://markpeak.net/build-back-better-the-result/","date":1676792950000,"content":"<p>เคยเขียนเรื่องแผน Build Back Better การฟื้นฟูเศรษฐกิจของ Joe Biden ไปแล้วหลายครั้ง (<a href=\"https://www.the101.world/biden-american-jobs-plan/\">Joe Biden’s Plan</a>, <a href=\"https://markpeak.net/uk-new-deal/\">UK New Deal</a>) และเคยเขียนบทความอย่างละเอียดใน the101.world ครั้งหนึ่ง</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.the101.world/biden-american-jobs-plan/\">\n\t\t\t\t\t<img src=\"https://www.the101.world/wp-content/uploads/2021/04/20210407-Isriya-fb.png\" alt=\"American Jobs Plan เปิดแผนลงทุนโครงสร้างพื้นฐานครั้งใหญ่ของ โจ ไบเดน\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.the101.world/biden-american-jobs-plan/\">\n\t\t\tAmerican Jobs Plan เปิดแผนลงทุนโครงสร้างพื้นฐานครั้งใหญ่ของ โจ ไบเดน\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.the101.world/biden-american-jobs-plan/\">\n\t\t\t<p>อิสริยะ ไพรีพ่ายฤทธิ์ ชวนสำรวจแผน American Jobs Plan เพื่อดูว่าสหรัฐฯ ยุค โจ ไบเดน มีวิธีลงทุนในโครงสร้างพื้นฐานแห่งศตวรรษที่ 21 อย่างไร</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://www.the101.world/wp-content/uploads/2021/03/cropped-the101-logo-32x32.png\" alt=\"The 101 World\" />\t\tThe 101 World\t</div>\n</div>\n<p>ตอนนี้เวลาผ่านมาถึงปี 2023 แล้ว เลยอยากรู้ความคืบหน้าของแผน Build Back Better ว่าเป็นอย่างไรบ้าง</p>\n<p>ตัวแผนใหญ่ Build Back Better ถูกซอยออกมาเป็น 3 แผนย่อยคือ</p>\n<ul>\n<li><strong>American Rescue Plan (ARP)</strong> แผนการฟื้นฟูเศรษฐกิจเร่งด่วนจาก COVID-19</li>\n<li><strong>American Jobs Plan (AJP)</strong> แผนการลงทุนในโครงสร้างพื้นฐานที่ถูกทอดทิ้งมานาน พ่วงไปกับการจ้างงานโดยรัฐ</li>\n<li><strong>American Families Plan (AFP)</strong> แผนนโยบายด้านสังคม สวัสดิการต่างๆ</li>\n</ul>\n<p><strong>แผน ARP</strong> ที่เป็นเรื่องเร่งด่วน ทุกคนเห็นตรงกัน ผ่านการโหวตของสภาอย่างรวดเร็ว (เสนอเดือนมกราคม 2021 <a href=\"https://en.wikipedia.org/wiki/American_Rescue_Plan_Act_of_2021\">ผ่านเป็นกฎหมาย</a>มีนาคม 2021) มูลค่างบประมาณ $1.9 trillion ส่วนใหญ่ใช้ไปกับการจ่ายเงินกระตุ้นเศรษฐกิจ (stimulus check $1400)</p>\n<p><strong>แผน AJP</strong> ที่ตามมาในเดือนมีนาคม 2021 ไม่ได้ง่ายแบบนั้น ข้อเสนอแรกเริ่มคือ Biden เสนอลงทุน $2.3 trillion แต่ก็มีการถกเถียงกันทั้งในแง่เนื้อหา (ว่าควรลงทุนกับโครงสร้างพื้นฐานอะไรบ้าง) และขนาดของการลงทุน</p>\n<p>แผน AJP ผ่านการเจรจาต่อรองในสภา และลดขนาดลงมาเรื่อยๆ จนสุดท้ายขนาดการลงทุนลดลงเหลือ $1.2 trillion (ลดลงเหลือครึ่งหนึ่ง) กฎหมายใหม่ใช้ชื่อว่า <a href=\"https://en.wikipedia.org/wiki/Infrastructure_Investment_and_Jobs_Act\">Infrastructure Investment and Jobs Act</a> เสร็จในเดือนพฤศจิกายน 2021 ใช้เวลาประมาณครึ่งปีกว่าๆ</p>\n<p><strong>แผน AFP</strong> เป็นเรื่องที่ดราม่าที่สุด เพราะมีไอเดียเรื่องสวัสดิการหลายอย่างที่ไม่เคยทำในสังคมอเมริกัน (แค่ Infrastructure ที่เห็นตรงกันว่าควรทำ ยังตีกันเละเทะว่าจะทำอะไร) Biden เสนอร่างกฎหมายในเดือนเมษายน 2021 แต่มาออกเป็นกฎหมายได้สำเร็จในเดือนสิงหาคม 2022 ใช้เวลาเกือบปีครึ่ง</p>\n<p>ไอเดียแรกเริ่มของ AFP ใช้เงิน $1 trillion (+ $800 billion เป็นส่วนลดภาษี) เพื่ออุดหนุนสวัสดิการเรื่องเด็ก ครอบครัว ชุมชน สุขภาพ แต่หลังจากแผน AJP โดนหั่นลงมากในสภา ทำให้ฝ่ายพรรคเดโมแครตนำไอเดียบางอย่างที่ถูกหั่นออกจาก AJP (เช่น พลังงานสะอาด การเปลี่ยนแปลงสภาพอากาศ) มารวมร่างเข้ากับ AFP ในชื่อใหม่ว่า <a href=\"https://en.wikipedia.org/wiki/Build_Back_Better_Act\">Build Back Better Act</a> (BBB) มูลค่า $3.5 trillion ก้อนใหญ่ที่สุดในทั้งสามก้อนที่เสนอ</p>\n<p>แต่มีหรือที่รีพับลิกันจะยอม เลยต่อรองเงินก้อนนี้ลงมาเหลือ $2.2 trillion กฎหมายผ่านสภาล่างในเดือนกันยายน 2021 ซึ่งถือว่าใช้เวลาไม่นานนัก</p>\n<p>แต่การต่อสู้ในสภาสูงกลับเป็นอีกเรื่อง ปัจจัยหนึ่งคือเสียงในสภาสูงนั้นเป็น 50:50 พอดี (เดโมแครตมีเสียงของ Kamala Harris ในฐานะประธานวุฒิสภาอีก 1 เสียงสำหรับชี้ขาด) แต่พอเจอพวกเดียวกันเองไม่เอาด้วยคือ Joe Manchin วุฒิสมาชิกของเดโมแครตเอง ทำให้เสียงไม่พอ ร่างกฎหมายจึงพังไปในช่วงปีใหม่ 2022</p>\n<p>นอกจากนี้ ช่วงปลายปี 2021 เอง สถานการณ์เศรษฐกิจในอเมริกาก็พลิกผันอย่างมาก เพราะเริ่มเจอปัญหาเงินเฟ้อซึ่งเป็นผลจากการกระตุ้นเศรษฐกิจ แนวคิดหรือมุมมองของนักการเมืองสหรัฐจึงเปลี่ยนไปเป็นไม่กล้าลงทุนเยอะเพราะกลัวเงินยิ่งเฟ้อ</p>\n<p>หลังจากนั้นในปี 2022 มีการเจรจากันใหม่ระหว่างฝั่ง Biden และ Manchin โดยยอมถอดส่วน climate ออกเพื่อให้ Manchin สนับสนุนร่างกฎหมายให้ผ่าน (แต่สุดท้าย Manchin ก็ยอมนำ climate กลับเข้ามาบางส่วน) กลายเป็นกฎหมาย <a href=\"https://en.wikipedia.org/wiki/Inflation_Reduction_Act_of_2022\">Inflation Reduction Act of 2022</a> มูลค่าเหลือ $738 billion โดยมีส่วนที่เกี่ยวกับสังคมน้อยมาก เงินถูกนำไปใช้เรื่องพลังงาน, ภาษี และนำเงินจากการขึ้นภาษีไปลดการขาดดุลงบประมาณ (deficit reduction) แทน</p>\n<p>กฎหมายผ่านวุฒิสภาด้วยการลงมติ 51:50 โดยต้องใช้เสียงของ Harris ชี้ขาด</p>\n<p></p>\n<p>หากดูจากกรอบงบประมาณที่ตั้งไว้ตอนแรก $1.9 + $2.3 + $1 = $5.2 trillion</p>\n<p>รัฐบาล Biden สามารถผลักดันให้ผ่านได้ $1.9 + $1.2 + $0.738 = $3.838 trillion</p>\n<p>คิดเป็นความสำเร็จประมาณ 73.8% ก็ถือว่าประสบความสำเร็จในระดับหนึ่ง โดยมีทั้งส่วนที่ได้พลัง COVID ช่วยให้ผ่านง่าย และส่วนสวัสดิการสังคมที่แทบไม่ผ่านเลย</p>The post <a href=\"https://markpeak.net/build-back-better-the-result/\">Build Back Better – The Result</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"f21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"5bf56d4740b37901ab9cd203c34b1d88bcd07baf672825e46b0d59","category":"Thai"}