{"title":"รวมรีวิว Steam Deck OLED หลายสื่อชมดีขึ้นทุกจุด แม้เครื่องไม่แรงขึ้น","link":"https://www.blognone.com/node/136682","date":1699613439000,"content":"<div><div><div><p>Valve เพิ่งเปิดตัว <a href=\"https://www.blognone.com/node/136670\">Steam Deck OLED</a> ต่อสาธารณะไป แต่สื่อต่างประเทศหลายสำนักได้เครื่องไปรีวิวกันอย่างละเอียดเรียบร้อยแล้ว หลายสื่อชมไปในทางเดียวกันว่าหน้าจอ OLED ของ Steam Deck รุ่นใหม่นี้ทำออกมาดีมาก รวมถึงชมด้านแบตเตอรี่ที่ใช้งานได้นานขึ้น และลำโพงที่ดังกว่าโมเดลก่อนหน้าเล็กน้อย โดยรวมแล้วเป็นการอัพเกรดที่คุ้มค่า แต่น่าเสียดายที่ไม่มีรุ่น OLED ในรุ่นความจุเริ่มต้น 256GB โดยมีตัวอย่างการรีวิวจากสื่อต่าง ๆ ดังนี้</p>\n<p><a href=\"https://www.theverge.com/23951655/steam-deck-oled-review\"><strong>The Verge</strong></a> 8/10 : Steam Deck OLED อาจเป็นเครื่องเกมคอนโซลรุ่นปรับปรุงที่ดีที่สุดเท่าที่เคยมีมา มันเป็นเครื่องเกมที่แก้ไขตามข้อเรียกร้องหลาย ๆ อย่าง ในขณะที่ราคาสูงขึ้นแค่ 20 ดอลลาร์เมื่อเทียบโมเดลก่อนหน้า มันไม่ใช่แค่การเปลี่ยนหน้าจอใหม่ แต่อย่างอื่นก็ได้รับการปรับปรุง ไม่ว่าจะเป็นแบตเตอรี่ใหม่, ชิปใหม่, การระบายความร้อนแบบใหม่ , อัตรารีเฟรช 90Hz และการเปลี่ยนแปลงที่สำคัญอื่น ๆ อีกนับ 10 รายการ ทำให้ Steam Deck OLED เป็นเครื่องเกมที่ดีมาก จนไม่จำเป็นต้องซื้อ Steam Deck รุ่นดั้งเดิมอีกต่อไป แต่กระนั้นเครื่องก็ยังไม่แรงพอที่จะเล่นเกมระดับ AAA ของยุคนี้ และเกมที่เป็น HDR ยังมีไม่เยอะ</p>\n<p><a href=\"https://www.engadget.com/steam-deck-oled-review-its-just-better-180038030.html\"><strong>Engadget</strong></a> : เป็นการอัพเกรดคล้ายกับ Switch OLED แต่เป็นการปรับปรุงที่ชาญฉลาด และจับต้องได้ จอแสดงผลที่อัปเดตเป็นจุดเด่นของเครื่องรุ่นนี้ ในขณะที่การชาร์จที่เร็วขึ้น, เสาอากาศที่ได้รับการปรับปรุง และการสัมผัสที่ราบรื่นยิ่งขึ้นถือเป็นของแถมที่ดีทีเดียว ที่สำคัญกว่านั้นคือ Valve ได้ต่ออายุสินค้าตัวเองให้ยืนยาวในตลาดเครื่องเกมพีซีพกพา และก็ทำให้โล่งใจที่ได้เห็น Steam Deck เป็นปู่ย่าตายายของพีซีแบบพกพา สำหรับตอนนี้ OLED คือการก้าวครึ่งก้าวก่อนจะไปถึง Steam Deck 2 ซึ่งมันอาจเป็นรุ่นสุดท้ายของตระกูลนี้ เว้นแต่ว่า Valve จะนับเลข 3 เป็น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/7c1e135e87d579a82640be4cba1faecb.png\" /></p>\n<p><a href=\"https://www.wired.com/review/valve-steam-deck-oled/\"><strong>Wired</strong></a> 7/10 : อยากจะบอกว่า Steam Deck OLED ทำให้ Steam Deck เป็นเครื่องเกมพีซีพกพาที่น่าประทับใจแล้ว Valve ได้เปลี่ยนแปลงรายละเอียดบางอย่าง เช่น ก้านปุ่ม Trigger มีการออกแบบที่ยึดเกาะมากขึ้น และ ได้รับการปรับแต่งเพื่อการตอบสนองที่ดีขึ้น แม้แต่ทัชแพดทั้ง 2 ฝั่งก็ยังแม่นยำยิ่งขึ้น แต่น้ำหนักที่เบาลง 30 กรัมหรือประมาณ 5% ไม่ได้ทำให้รู้สึกว่าเบาลงเท่าไหร่ หน้าจอ OLED ทำให้ภาพสดใสขึ้น, สว่างมากขึ้น และแสดงสีดำได้ดำสนิท และอัตราการรีเฟรช 90Hz ทำให้เกมที่ใช้กราฟิกน้อย ๆ และในหน้าเมนูของ Steam Deck ดูนุ่มนวลขึ้น ประสิทธิภาพในการเล่นไม่ได้ต่างจากรุ่นเก่าเท่าไหร่ แต่แบตเตอรี่อึดขึ้นมาก ไม่ต้องเสียบไปเล่นไปบ่อย ๆ แบบรุ่นก่อนแล้ว แต่แอบน่าเสียดายที่พลังกราฟิกน้อยกว่าคู่แข่งบางรุ่น  และ OLED มีแต่ความจุระดับกลาง และบนสุด</p>\n<p><a href=\"https://www.rockpapershotgun.com/steam-deck-oled-review\"><strong>Rock Paper Shotgun</strong></a> : แม้มันจะไม่ใช่ Steam Deck 2 แต่เป็นเครื่องเกมที่ยอดเยี่ยมมาก นี่คือ Steam Deck เวอร์ชันที่เบากว่า สว่างกว่า ใช้งานได้ยาวนานกว่า และบางครั้งก็ทำงานได้เร็วกว่าบน SteamOS โหมดพกพาเมื่อเทียบกับรุ่นก่อน หน้าจอ OLED เป็นการอัพเกรดที่ก้าวกระโดด ในขณะที่รุ่นเก่าหน้าจอวัดขอบเขตสีได้ที่ sRGB 63.7% รุ่น OLED วัดได้ที่ 93.8% ยกตัวอย่างเกม Ratchet &amp; Clank: Rift Apart ที่ไม่มี HDR เอฟเฟกต์การบานของดวงอาทิตย์จะครอบงำทั้งหน้าจอ ทำให้ส่วนใหญ่ภาพดูจืดจางไป เมื่อใช้ HDR ดวงอาทิตย์จะสว่างขึ้น แต่เอฟเฟ็กต์แสงจะดีขึ้น ทำให้สีมีความลึก และสมบูรณ์ยิ่งขึ้น อัตรารีเฟรช 90Hz ทำให้บางเกมประสิทธิภาพดีขึ้น เช่น เกม F1 22 ได้ 60fps ในรุ่นเก่าแต่รุ่นใหม่ได้ 86fps ในการตั้งค่ากราฟิกเท่ากัน แต่ผิดหวังที่ไม่มีรุ่น OLED ในความจุ 256GB หรือ 64GB</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c96e45d0d6f31a9007978c6ea1c9613d.png\" /></p>\n<p><a href=\"https://www.pcgamer.com/steam-deck-oled-review/\"><strong>PC Gamer</strong></a> 89/100 : ถ้า Steam Deck คือร่างเบต้า Steam Deck OLED ก็คือร่างที่เสร็จสมบูรณ์แล้ว มันไม่ใช่รุ่น 2 ไม่ใช่รุ่น Pro แต่มันเครื่องเกมพีซีพกพาที่ดีที่สุดเครื่องหนึ่งในตลาดปัจจุบันที่ระดับราคาไล่เลี่ยกัน ราคาคุ้มค่า, หน้าจอ OLED แจ่ม, งานประกอบน่าประทับใจ, แบตเตอรี่อึดขึ้น และชาร์จเร็วขึ้น ทำให้ประสบการณ์การเล่นดีขึ้นมาก ความสว่างสูงสุด 1,000 nits ทำให้การเข้าสู่พื้นที่เปิดของ Elden Ring โดยไม่ปรับการตั้งค่าของคุณอย่างเหมาะสม มันจะเหมือนกับว่ามีคนเปิดโหมดแสงใส่หน้าแบบมันช่างจ้าซะเหลือเกิน และ DCI-P3 110% ทำให้สีสันสดใสขึ้นมาก และเมื่อเปิดใช้งาน HDR อย่างในเกม Diablo 4 สีของภาพทำให้แยกตัวละครออกจากฉากได้อย่างชัดเจน ทำเอาลำบากใจที่จะกลับไปใช้หน้าจอพีซีแบบเดิม ๆ ที่ไม่สามารถแสดงรายละเอียดได้ระดับนี้เลย</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/steam-deck\">Steam Deck</a></div><div><a href=\"/topics/valve\">Valve</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5bff115e8aba0b5f7026d34ac92fb7b4e6feacbe378f1b23c360b5f52d2d84ff","category":"Thai"}