{"title":"Phylogenetic Conflict Between Species Tree and Maternally Inherited Gene Trees in a Clade of Emberiza Buntings (Aves: Emberizidae)","link":"https://academic.oup.com/sysbio/article/73/2/279/7503792?rss=1","date":1703808000000,"content":"<span><div>Abstract</div>Different genomic regions may reflect conflicting phylogenetic topologies primarily due to incomplete lineage sorting and/or gene flow. Genomic data are necessary to reconstruct the true species tree and explore potential causes of phylogenetic conflict. Here, we investigate the phylogenetic relationships of 4 <span>Emberiza</span> species (Aves: Emberizidae) and discuss the potential causes of the observed mitochondrial non-monophyly of <span>Emberiza godlewskii</span> (Godlewski’s bunting) using phylogenomic analyses based on whole genome resequencing data from 41 birds. Analyses based on both the whole mitochondrial genome and ~39 kilobases from the non-recombining W chromosome reveal sister relationships between each the northern and southern populations of <span>E. godlewskii</span> with <span>E. cioides</span> and <span>E. cia</span>, respectively. In contrast, the monophyly of <span>E. godlewskii</span> is reflected by the phylogenetic signal of autosomal and Z chromosomal sequence data as well as demographic inference analyses, which—in combination—support the following tree topology: ([{<span>E. godlewskii</span>, <span>E. cia</span>}, <span>E. cioides</span>], <span>E. jankowskii</span>). Using D-statistics, we detected multiple gene flow events among different lineages, indicating pervasive introgressive hybridization within this clade. Introgression from an unsampled lineage that is sister to <span>E. cioides</span> or introgression from an unsampled mitochondrial + W chromosomal lineage of <span>E. cioides</span> into northern <span>E. godlewskii</span> may explain the phylogenetic conflict between the species tree estimated from genome-wide data versus mtDNA/W tree topologies. These results underscore the importance of using genomic data for phylogenetic reconstruction and species delimitation.</span>","author":"","siteTitle":"Systematic Biology Current Issue","siteHash":"ff28aeeb9b03783edee2039c6a58e13e932a0eb216cc2d8b21d5a99c6800e59a","entryHash":"5c08c662ca89c89668295081832bfd60753644dfafc946360cd7bcc97c189bf8","category":"Environment"}