{"title":"Changes in the medical admissions and mortality amongst children in four South African hospitals following the COVID-19 pandemic: A five-year review","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002829","date":1726668000000,"content":"<p>by Kimesh Loganathan Naidoo, Jienchi Dorward, Kogielambal Chinniah, Melissa Lawler, Yugendhree Nattar, Christian Bottomley, Moherndran Archary</p>\r\n\r\nVulnerable children from poor communities with high HIV and Tuberculosis(TB) burdens were impacted by COVID-19 lockdowns. Concern was raised about the extent of this impact and anticipated post-pandemic surges in mortality. Interrupted time series segmented regression analyses were done using routinely collected facility-level data of children admitted for medical conditions at four South African referral hospitals. Monthly admission and mortality data over 60 months from 01 April 2018 to 31 January 2023 was analysed using models which included dummy lockdown level variables, a dummy post-COVID period variable, Fourier terms to account for seasonality, and excess mortality as a proxy for healthcare burden. Of the 45 015 admissions analysed, 1237(2·75%) demised with significant decreases in admissions during all the lockdown levels, with the most significant mean monthly decrease of 450(95%, CI = 657·3, -244·3) p&lt;0·001 in level 5 (the most severe) lockdown. There was evidence of loss of seasonality on a six-month scale during the COVID periods for all admissions (p = 0·002), including under-one-year-olds (p = 0·034) and under-five-year-olds (p = 0·004). No decreases in mortality accompanied decreased admissions. Post-pandemic surges in admissions or mortality were not identified in children with acute gastroenteritis, acute pneumonia and severe acute malnutrition.During the COVID-19 pandemic, paediatric admissions in 4 hospitals serving communities with high levels of HIV, TB and poverty decreased, similar to global experiences; however, there was no change in in-hospital mortality. No post-pandemic surge in admissions or mortality was documented. Differences in the impact of pandemic control measures on the transmission of childhood infections and access to health care may account for differing outcomes seen in our setting compared to the global experiences. Further studies are needed to understand the impact of pandemic control measures on healthcare provision and transmission dynamics and to better inform future responses amongst vulnerable child populations.","author":"Kimesh Loganathan Naidoo","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"5c09a80136236e66d50ff12f884bda1c1fd7dbf01d0e4f2ba2781013876a74a8","category":"Environment"}