{"title":"Determination of gas flux of growing steers under intensive grazing conditions","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae119/7727994?rss=1","date":1722902400000,"content":"<span><div>ABSTRACT</div>Ruminants produce one-third of the anthropogenic methane (<strong>CH</strong><sub><strong>4</strong></sub>) emissions worldwide, and 47% of the CH<sub>4</sub> emissions result from ruminants under grazing conditions. However, there is limited information regarding the appropriate number of visits to accurately determine enteric CH<sub>4</sub> emissions using the automated head-chamber system (<strong>AHCS</strong>) from growing beef cattle under intensive grazing conditions. Data from one experiment were analyzed to determine the number of visits to assess gas flux (CH<sub>4</sub>, carbon dioxide [<strong>CO</strong><sub><strong>2</strong></sub>], and oxygen [<strong>O</strong><sub><strong>2</strong></sub>]) from Angus-crossbreed steers grazing in a pivot-irrigated improved pasture. A total of 110 steers (324 ± 37.3 kg initial body weight) were selected and divided into two blocks. Steers were under intensive grazing management for 84 d. Depending on forage availability, steers were rotated at 2- to 4-d intervals. Pastures were predominately composed of cool-season forages. Two different databases using the same animals (<span>n</span> = 16) were defined to calculate the gas flux using the first 100 visits to an AHCS with 2 or more or 3 or more minutes of visitation length. The mean gas flux was estimated as the average for increasing (forward) or decreasing (reverse) the gas flux of 5-visit intervals starting with the first or the last 5 visits and increasing or decreasing until the full 100-visit dataset was utilized, respectively. Spearman and Pearson correlations were computed between the maximum visits and each shortened visit interval. Concurrently, the residual variance and the residual variance change were determined for each interval by fitting a mixed model. The minimum number of visits was defined when correlations with the total visits were greater than 0.95, and the residual variance was stabilized. The results indicated that the minimum number of visits needed to determine CH<sub>4</sub> production varied between 45 and 70, while CO<sub>2</sub> production and O<sub>2</sub> consumption varied between 45 and 50 according to the visitation length. Additionally, steers that visited the AHCS for 2 or more minutes in visit duration required a greater number of visits than those that visited for 3 or more minutes. Thus, based on the average daily visitation in this experiment (1.4 visit/d), the assessment of CH<sub>4</sub> emissions requires 32 d, while CO<sub>2</sub> production and O<sub>2</sub> consumption require between 32 and 36 d using 3 or more minutes of visit length from growing steers under intensive grazing conditions.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"5c0ee1dc68ac43d0efb8219c74b5b034f61fa05bcde8180ad0fa3f4ad1f9ba35","category":"Environment"}