{"title":"Physiological condition infers habitat choice in juvenile sockeye salmon","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae011/7638782?rss=1","date":1711929600000,"content":"<span><div>Abstract</div>The amount of time that juvenile salmon remain in an estuary varies among and within populations, with some individuals passing through their estuary in hours while others remain in the estuary for several months. Underlying differences in individual physiological condition, such as body size, stored energy and osmoregulatory function, could drive individual variation in the selection of estuary habitat. Here we investigated the role of variation in physiological condition on the selection of estuarine and ocean habitat by sockeye salmon (<span>Oncorhynchus nerka</span>) smolts intercepted at the initiation of their 650-km downstream migration from Chilko Lake, Fraser River, British Columbia (BC). Behavioural salinity preference experiments were conducted on unfed smolts held in fresh water at three time intervals during their downstream migration period, representing the stage of migration at lake-exit, and the expected timing for estuary-entry and ocean-entry (0, 1 and 3 weeks after lake-exit, respectively). In general, salinity preference behaviour varied across the three time periods consistent with expected transition from river to estuary to ocean. Further, individual physiological condition did influence habitat choice. Smolt condition factor (K) and energy density were positively correlated with salinity preference behaviour in the estuary and ocean outmigration stages, but not at lake-exit. Our results suggest that smolt physiological condition upon reaching the estuary could influence migratory behaviour and habitat selection. This provides evidence on the temporally dependent interplay of physiology, behaviour and migration in wild juvenile Pacific salmon, with juvenile rearing conditions influencing smolt energetic status, which in turn influences habitat choice during downstream migration. The implication for the conservation of migratory species is that the relative importance of stopover habitats may vary as a function of initial condition.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"5c0ecd08da45814d7e053e90277f95cd7dcf89b14dc3d8a48ee6e664d78bae3e","category":"Environment"}