{"title":"Morphological Variability of Four Anabas testudineus (Bloch 1792) Varieties, Cultured in Pond Aquaculture Systems in Bangladesh","link":"https://onlinelibrary.wiley.com/doi/10.1111/lre.12459?af=R","date":1721383416000,"content":"<h2>ABSTRACT</h2>\n<p>Due to having high market demand and consumer preference, four varieties of <i>Anabas testudineus</i> (indigenous, Thai, Thai-Vietnam, and Vietnamese) have been extensively cultured in Bangladesh over the last few decades. But high similarities in their morphometric traits make population differentiation difficult. The present study used phenotypic markers for their discrimination based on traditional morphometry and truss network measurement. We conducted a study of morphometric variability through the traditional morphometry and truss network systems based on 120 specimens of four varieties of <i>A</i>. <i>testudineus</i> cultured in a coastal region of Bangladesh. Significant (<i>p &lt;</i> 0.05) variation was observed in the analysis of variance (ANOVA) for all the measured traits. In each of the truss network and morphometric measurements, three discriminant functions (DF) were found with 100% variability, which accounted for 89.7% and 65.7% for DF1; 9.7% and 25.7% for DF2 and 0.6% and 8.7% for DF3, respectively. In principal component analysis (PCA), four PCs were observed for traditional morphometry with a total variance of 97.44%, while in the truss network system, the total variance was 98.53% in five PCs. Overall, the investigation found four distinct stocks for indigenous, Thai, Thai × Vietnamese and Vietnamese varieties. The outcomes of this study might be useful for differentiating these four varieties of climbing perch population, genetic study, management and conservation of this fishery at home and abroad.</p>","author":"Ashif Mahmud, \nMd. Anwar Hossain Mondal, \nMd. Abu Hanif, \nShaharior Hossen, \nZahid Parvez Sukhan","siteTitle":"Wiley: Lakes & Reservoirs: Science, Policy and Management for Sustainable Use: Table of Contents","siteHash":"0c37a2f8fab2f38bae7a8df98c682fefad0ef1d621f3013d69fd39589935ccea","entryHash":"5c1bf1c67600b11e986b942b133f75f77b006728d8fccbe3ba616254119dbfe1","category":"Environment"}