{"title":"หน่วยงานกำกับดูแลสหราชอาณาจักร มีคำตัดสินขัดขวางดีล Microsoft - Activision","link":"https://www.blognone.com/node/133571","date":1682512192000,"content":"<div><div><div><p>หน่วยงานกำกับดูแลการแข่งขันของสหราชอาณาจักร (Competition and Markets Authority - CMA) ออกคำตัดสินการพิจารณาดีลไมโครซอฟท์ เสนอซื้อกิจการ Activision Blizzard ระบุว่า CMA จะขัดขวางดีลควบรวมกิจการดังกล่าว</p>\n<p>CMA ให้เหตุผลโดยเน้นไปที่ธุรกิจคลาวด์เกมมิ่ง บอกว่าไมโครซอฟท์มีส่วนแบ่งตลาดนี้อยู่ 60-70% การได้เกมของ Activision เพิ่มเติมมาเป็นเอ็กคลูซีฟ จะยิ่งเพิ่มอำนาจในตลาดมากขึ้น อีกทั้งไมโครซอฟท์ก็มีบริการเชื่อมต่อครบทั้ง Xbox, ระบบปฏิบัติการ Windows บนพีซี และยังมีแพลตฟอร์มคลาวด์ Azure ด้วย</p>\n<p>ก่อนหน้านี้ CMA ให้ความเห็นต่อดีลดังกล่าวในมุมของตลาดคอนโซล <a href=\"https://www.blognone.com/node/133162\">บอกว่าไม่กระทบการแข่งขัน</a></p>\n<p>CMA มองว่าแผนการตลาดหลังการควบรวมเกิดขึ้น ไมโครซอฟท์สามารถผลักดันเกมดังของ Activision ไม่ว่าจะเป็น Call of Duty, Overwatch หรือ World of Warcraft ให้มีเฉพาะบนคลาวด์เกมมิ่งเท่านั้น หรือมีราคาที่ถูกกว่าการซื้อเกมช่องทางอื่น ซึ่งจะเพิ่มความแข็งแกร่งให้ไมโครซอฟท์</p>\n<p>ทั้งนี้คำตัดสินของ CMA เป็นมุมมองเฉพาะในตลาดสหราชอาณาจักร อาจไม่ส่งผลต่อดีลนี้ในภาพใหญ่ แต่จะสร้างแรงกดดันให้กับหน่วยงานกำกับดูแลอื่นที่กำลังพิจารณาดีลนี้ทั้ง <a href=\"https://www.blognone.com/node/132874\">EU</a> ของยุโรป และ <a href=\"https://www.blognone.com/node/131791\">FTC ของสหรัฐ</a></p>\n<p>ตัวแทนของ Activision แถลงต่อคำตัดสินดังกล่าวว่า CMA ขาดความเข้าใจในตลาดเกม และรูปแบบบริการคลาวด์เกมมิ่ง บริษัทจะร่วมมือกับไมโครซอฟท์เพื่อเดินหน้าให้กลับคำตัดสิน</p>\n<p>ที่มา: <a href=\"https://www.axios.com/2023/04/26/uk-antitrust-regulators-microsoft-activision-blizzard\">Axios</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/035d67487144ecdab7120fc6ec59af1a.jpg\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/cma\">CMA</a></div><div><a href=\"/topics/antitrust\">Antitrust</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/activision\">Activision</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/cloud-gaming\">Cloud Gaming</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5c1e47e1f5d51b745e7f2f727af19a84e33a3c3716d2141c9c54e2ce92c8f5b9","category":"Thai"}