{"title":"Seasonal Early Warning of Impacts of Harmful Algal Blooms on Farmed Shellfish in Coastal Waters of Scotland","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR034889?af=R","date":1727760888000,"content":"<h2>Abstract</h2>\n<p>Harmful Algal Blooms (HABs) can produce phycotoxins that accumulate in shellfish and subsequently poison aquatic predators and human consumers, potentially causing significant economic impacts to the shellfish aquaculture industry. HAB events are challenging to foresee as they are driven by complex inter-annual and seasonal changes in physical, chemical and biological factors. Accounting for these environmental drivers and their interactions in statistical models allows for the development of HAB early warning systems. Typically, these have a forecasting horizon of 1–2 weeks, allowing shellfish businesses and regulators to increase monitoring intensity and take evasive action, including harvesting suspensions to protect consumer health. However, there is critical need for longer-term predictions of risk, to enable more proactive mitigation, business planning, harvest scheduling and supply chain management. We present a statistical framework for providing seasonal-scale early warnings of the occurrence and impacts of <i>Dinophysis spp.</i> HABs on shellfish aquaculture in Scotland, UK. We use penalized smooth functions of winter-spring daily sea surface temperature to predict the severity and impact of ensuing summer blooms, including the percentage of toxicity measurements exceeding the harvesting closure threshold, as well as the anticipated start, end, and overall duration of closures. We illustrate the application of this framework to two Scottish aquaculture regions: One with a high spatial concentration of harvesting sites (Shetland) and one with more dispersed sites (West Scotland and the Hebrides). Through a comprehensive yearly prediction experiment, we demonstrate considerable skill in predicting the impact of unseen HAB seasons at a regional level.</p>","author":"O. Stoner, \nT. Economou, \nA. R. Brown","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"5c3301db5e48913ca901607e6547ab34b8b0eed9dbe92e940c003ac87e92399f","category":"Environment"}