{"title":"Specialized to issue recall and stop-ride notice on Tarmac SL7 bikes","link":"https://cyclingtips.com/2021/10/specialized-tarmac-sl7-recall/","date":1633966571000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/Specialized-Tarmac-SL7-review-18-of-25-650x434.jpg\" /></div><h2>Specialized to issue recall and stop-ride notice on Tarmac SL7 bikes</h2><p>\n</p><p>Specialized looks set to issue a safety recall and stop-ride notice on all of its Tarmac SL7 bikes amidst concerns of a potential steerer tube failure.</p>\n\n\n\n<p>A leaked safety recall notice from Specialized suggests “harsh frontal impacts, e.g., impacting a deep pothole with significant force, may put extraordinary stress on headset components and may initiate a crack in the fork’s steerer tube.” The new Tarmac design’s integrated cable routing features a round steerer tube, but an unconventional headset compression ring that may be acting as a stress concentrator in some situations. </p>\n\n\n\n<p>In the leaked recall notice, Specialized asks riders to “stop riding your Tarmac SL7 and bring it to your nearest authorised Specialized retailer.” The recall notice also lays out a remedy for affected customers: “Your retailer will replace the current expander plug with a new extended plug and upgrade the compression ring to the newer-style, two-piece compression ring if your bike is not already equipped with one.” </p>\n\n\n\n<p>Presumably, retailers will also replace any damaged forks, although it’s unclear exactly how dealers are to evaluate them given that damage to carbon fibre structures isn’t always visible on the surface.</p>\n\n\n\n<p>The leaked notice explicitly lists the new Tarmac SL7 and bikes sold between July 2020 and September 2021 as the only models affected. The previous generation Tarmac SL6 and the now discontinued Venge are seemingly unaffected.</p>\n\n\n\n<p>More to follow.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/specialized-tarmac-sl7-recall/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"5c36f593d1ff4f91d31f27c85dd550f54a025e833d0ecee42f266c3bb89c7fa3","category":"Cycling"}