{"title":"How to prep a HomePod for sale","link":"https://www.macworld.com/article/1924006/prepare-homepod-sale.html","date":1685955600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The HomePod and HomePod mini are unique creatures in Apple’s line-up: unlike nearly all other hardware Apple sells, these assistants/speakers are not permanently locked to your iCloud account nor to a paired iPhone or iPad. An iPhone, iPad, Mac, or Watch has Activation Lock enabled if you turn on Find My. Most Beats and Apple audio devices, as well as all Find My devices (AirTags and third-party), use what Apple now calls Find My Lock–Find My Lock connects a device without a visible interface to your Apple ID, and the lock can only be disabled via an iPhone or iPad in the Find My app. (Audio devices can be used with other hardware but they remain trackable by the original owner, as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://defector.com/into-thin-airpods&amp;xcust=1-1-1924006-1-0-0&amp;sref=https://www.macworld.com/feed\">reporter Casey Johnston looked into</a> when she lost hers.)</p>\n\n\n\n<p>A HomePod or HomePod mini has no such lock. This means that if they’re stolen, someone can perform a reset and put one right back into use.</p>\n\n\n\n<p>If you intentionally hand yours off as a sale, gift, or donation, you should still go through the steps to remove it from your account and perform a hard reset. First, you can avoid any potential of someone else having access to playlists, songs, and other potentially private data associated with your account. Second, it’s always better to wipe anything associated with yourself from hardware before it leaves your ownership.</p>\n\n\n\n<p>Apple makes it fairly simple.</p>\n\n\n\n<p>First, in a Home app in iOS, iPadOS, or macOS:</p>\n\n\n\n<ol><li>Find your HomePod or HomePod mini.</li><li>Click or tap it to reveal settings.</li><li>Click or tap the gear icon.</li><li>Click or tap Reset HomePod and follow the prompts.</li></ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/mac911-home-homepod-remove-sbs.png?w=1200\" alt srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/mac911-home-homepod-remove-sbs.png?quality=50&amp;strip=all 1741w, https://b2c-contenthub.com/wp-content/uploads/2023/05/mac911-home-homepod-remove-sbs.png?resize=300%2C181&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/mac911-home-homepod-remove-sbs.png?resize=768%2C464&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/05/mac911-home-homepod-remove-sbs.png?resize=1200%2C725&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/05/mac911-home-homepod-remove-sbs.png?resize=1536%2C928&amp;quality=50&amp;strip=all 1536w\" width=\"1200\" height=\"725\" /><figcaption>Click  to remove a HomePod and you receive a warning about precisely what happens next.</figcaption></figure></div>\n\n\n\n<p>Now, after those steps are completed:</p>\n\n\n\n<ol><li>Unplug your HomePod for 10 seconds.</li><li>Plug it back in, and after a brief moment, place your finger on the top of the HomePod and keep it there. (Apple says to wait 10 seconds first, but I’m not sure it matters in testing.)</li><li>Eventually, the HomePod will show a spinning white pattern. This will change to a solid red when the reset is triggered. Keep holding down.</li><li>The device will say that it’s about to reset. You’ll hear three beeps. After the last of those beeps, you can remove your finger.</li></ol>\n\n\n\n<p>Your HomePod or HomePod is now fully removed from your account and ready for its next life.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by a Macworld reader.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nHomePod</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5c40dfd31bf23fabb51612ac982e6a97a9bfde8c6421844ebd0f9f14ecdb16ab","category":"Apple"}