{"title":"Broad Chain-Length Specificity of the Alkane-Forming Enzymes NoCER1A and NoCER3A/B in Nymphaea odorata","link":"https://academic.oup.com/pcp/article/65/3/428/7510583?rss=1","date":1707436800000,"content":"<span><div>Abstract</div>Many terrestrial plants produce large quantities of alkanes for use in epicuticular wax and the pollen coat. However, their carbon chains must be long to be useful as fuel or as a petrochemical feedstock. Here, we focus on <span>Nymphaea odorata</span>, which produces relatively short alkanes in its anthers. We identified orthologs of the Arabidopsis alkane biosynthesis genes <span>AtCER1</span> and <span>AtCER3</span> in <span>N. odorata</span> and designated them <span>NoCER1A, NoCER3A</span> and <span>NoCER3B</span>. Expression analysis of <span>NoCER1A</span> and <span>NoCER3A/B</span> in Arabidopsis <span>cer</span> mutants revealed that the <span>N. odorata</span> enzymes cooperated with the Arabidopsis enzymes and that the NoCER1A produced shorter alkanes than AtCER1, regardless of which CER3 protein it interacted with. These results indicate that AtCER1 frequently uses a C30 substrate, whereas NoCER1A, NoCER3A/B and AtCER3 react with a broad range of substrate chain lengths. The incorporation of shorter alkanes disturbed the formation of wax crystals required for water-repellent activity in stems, suggesting that chain-length specificity is important for surface cleaning. Moreover, cultured tobacco cells expressing <span>NoCER1A</span> and <span>NoCER3A/B</span> effectively produced C19–C23 alkanes, indicating that the introduction of the two enzymes is sufficient to produce alkanes. Taken together, our findings suggest that these <span>N. odorata</span> enzymes may be useful for the biological production of alkanes of specific lengths. 3D modeling revealed that CER1s and CER3s share a similar structure that consists of N- and C-terminal domains, in which their predicted active sites are respectively located. We predicted the complex structure of both enzymes and found a cavity that connects their active sites.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"5c41d9073fa2972ef7c0db5735d1275a5bfde8b82e31bd9c51bbc3b40ff59781","category":"Environment"}