{"title":"Robust Strain Analysis of Complex Heterostructures by Whole Pattern Fitting","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.924/7720072?rss=1","date":1721779200000,"content":"<span>Four-dimensional scanning transmission electron microscopy (4D-STEM), where a two dimensional diffraction pattern is acquired at each position as the electron beam is rastered over the sample, has become an important tool for obtaining nanoscale structural information [<a href=\"#ozae044.924-B1\">1</a>]. In particular, the local interatomic spacing is easily probed by operating in the nanobeam mode, with a small semiconvergence angle, and analyzing the Bragg spots in the diffraction patterns. A variety of methods have been described for robust analysis of these Bragg patterns to determine the lattice spacing [<a href=\"#ozae044.924-B2\">2</a>, <a href=\"#ozae044.924-B3\">3</a>], but in general these methods suffer systematic errors in the presence of diffuse background scattering and have difficulty analyzing patterns with multiple overlapping lattices. Here, we present a new method for 4D-STEM diffraction pattern analysis that simultaneously models the entire pattern, including background and amorphous scattering contributions. In our approach, which we call “whole pattern fitting” (WPF), we construct a model which takes in the parameters of interest (such as lattice vectors, diffraction disk intensities, etc.) and returns a simulated diffraction pattern. The input parameters of the model are then optimized by minimizing the difference between the simulated pattern and each experimental one. Our implementation of this method in py4DSTEM [<a href=\"#ozae044.924-B4\">4</a>] provides several basic model components which can be mixed and matched to fully describe the experimental patterns.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"5c42c71afd501d568bbfbf4eb2b7732a2ee67bad1019c183838a41deead5e7e9","category":"Environment"}