{"title":"Judge OKs new MacBook lawsuit, says Apple had ‘exclusive knowledge’ of defects","link":"https://www.macworld.com/article/342301/judge-oks-new-macbook-lawsuit-says-apple-had-exclusive-knowledge-of-defects.html","date":1617380152000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>It&rsquo;s been a rough couple of weeks for the MacBook. In late March, a judge allowed <a href=\"https://www.macworld.com/article/340288/macbook-pro-air-butterfly-keyboard-problems-stuck-keys-class-action-suit-payments.html\">a class-action suit involving the butterfly keyboard to proceed</a>, affecting nearly every Apple laptop made since 2016. Now the same judge says Apple deliberately sold laptops with display issues.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.law360.com/articles/1370714/apple-must-face-trimmed-defective-laptop-display-suit&amp;xcust=1-1-342301-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">As reported by Law360</a>, the new lawsuit is decidedly more narrow than the keyboard one, only referring to the 15-inch MacBook Pro from 2016, but it still could end up costing Apple millions of dollars. The issue stems from the ribbon cable that connects the display to the logic board. According to teardowns, Apple incorporated the cable into the display, making it impossible to repair. On top of that, Apple used &ldquo;thin, fragile flex cables&rdquo; that were prone to tearing. When it tore, it subjected the screen to a so-called &ldquo;stage lighting&rdquo; effect that showed bright stripes across the bottom of the screen or stopped working altogether.</p>\n\n\n\n<p>To its credit, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/13-inch-macbook-pro-display-backlight-service&amp;xcust=1-1-342301-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">Apple did launch a repair program for the 13-inch MacBook Pro</a> that covered this exact issue. However, it didn&rsquo;t include the 15-inch model with the same ribbon cable design. That didn&rsquo;t help Apple&rsquo;s case as U.S. District Judge Edward Davila found that &ldquo;the allegations of pre-release testing in combination with the allegations of substantial customer complaints are sufficient to show that Apple had exclusive knowledge of the alleged defect.&rdquo;</p>\n\n\n\n<p>The judge claims that Apple&rsquo;s internal testing and customer complaints were sufficient evidence to conclude that Apple knew that laptops were faulty and could fail. In a 2019 report, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.ifixit.com/News/12903/flexgate&amp;xcust=1-1-342301-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">iFixit clearly pinpointed the problem</a> to the flex cable and said Apple was &ldquo;effectively turning a $6 problem into a $600 disaster.&rdquo; It added that the issue &ldquo;could have been avoided entirely if so many sacrifices weren&rsquo;t made for the thin-and-light form factor.&rdquo; </p>\n\n\n\n<p>The complaint also alleges that Apple routinely deleted Apple Support Community posts related to the issue. The judge didn&rsquo;t rule on the veracity of those claims, which Apple attempted to squash as irrelevant, but concluded, &ldquo;If Apple deleted comments on its website from consumers complaining about display issues attributable to the alleged defect, that suggests that Apple had knowledge of the alleged defect, superior to that of plaintiffs or potential class members.&rdquo;</p>\n\n\n\n<p>There is no information yet on how to join the class-action or when the case will proceed in court.</p>\n</div></body></html>","author":"Michael Simon","siteTitle":"Google silicon could turn the Pixel into the iPhone biggest competitor","siteHash":"845b35ef5bc2ddfaa008518eedb9033f664423bfda890a9666e8caa95d6201be","entryHash":"5c4543a62cafdd6abbbe8553a1acb3ba27dfd6eeca6d67d7d27d3db4256f5ff6","category":"Apple"}