{"title":"An empirical analysis of the demand for family planning satisfied by modern methods among married or in-union women in Nigeria: Application of multilevel binomial logistic modelling technique","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300744","date":1711029600000,"content":"<p>by Emomine Odjesa, Friday Ebhodaghe Okonofua</p>\r\nBackground <p>Given the health and economic benefits of family planning (FP), Nigeria’s very low demand for FP satisfied by modern methods (mDFPS) of less than 50% is therefore a major public health concern, especially considering the global target aimed at achieving an mDFPS of at least 75% by year 2030 for all countries. In view of this, together with recognising the possible contextual nature of health outcomes, this study aimed to empirically analyse the mDFPS among married or in-union women of reproductive age (WRA) in Nigeria.</p> Materials and methods <p>A multilevel binomial logistic model with two levels of analysis was used: individual and community levels. Secondary cross-sectional data were obtained from the 2018 Nigeria Demographic and Health Survey, and analyses were performed using Stata 15.0. The analytical sample size was 9,122 WRA nested in a total of 1,072 communities.</p> Results <p>The mDFPS was approximately 31.0%. The median odds ratio (MOR) estimated from the final multilevel model was 2.245, which was greater than the adjusted odds ratio (aOR) for most of the individual-level variables, suggesting that the unexplained/residual between-community variation in terms of the odds of women having their mDFPS was more relevant than the regression effect of most of the individual-level variables. This was with the exception of the regression effects of the following individual-level variables: women’s husbands that had higher education level in comparison to their counterparts who had husbands with no formal education (aOR = 2.539; 95% CI = 1.896 to 3.399; p&lt;0.001); and women from the Yoruba ethnic group in comparison to their counterparts from the Hausa/Fulani/Kanuri ethnic group (aOR = 2.484; 95% CI = 1.654 to 3.731; p value&lt;0.001). However, other individual-level variables with positive statistically significant regression effects on mDFPS were: women who mentioned that money for accessing health care was not a problem; women’s empowerment in relation to the visitation of family and relatives; and women being exposed to FP messages through various media sources, all in comparison to their respective counterparts. On the other hand, at the community level, women in communities where a high percentage of them had at least a secondary education had statistically significant greater odds of having mDFPS than women in communities with lower education levels (aOR = 1.584; 95% CI = 1.259 to 1.991; p&lt;0.001). We found similar findings regarding women residing in communities with exposure to FP messages through various media sources. However, using the 80% interval ORs (80% IORs) as a supplemental statistical measure for further understanding the regression effects of community-level variables showed that all of the 80% IORs had a value of ‘1’, signifying considerable uncertainty in the regression effects of all community-level variables due to the substantial residual variation existing between communities.</p> Conclusions <p>Our study showed that to achieve the dire increase in mDFPS in Nigeria, policy interventions aimed at improving the education level of both females and males, especially beyond the secondary school level, should be implemented. Additionally, all of the various media sources should be extensively utilised, both at the individual and the community level, by the Nigerian government to spread information on the importance of women having their mDFPS.</p>","author":"Emomine Odjesa","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5c48c864e0f28e377e2dab35d9fcd424f8074ab34f072661252788e20e2cd151","category":"Interdisciplinary"}