{"title":"Improving LiFe0.4Mn0.6PO4 Nanoplates Performances by a Dual Modification Strategy toward Practical Application of Li-Ion Batteries","link":"https://www.preprints.org/manuscript/202405.1101/v1","date":1715853014000,"content":"A novel composite consisting of fluorine-doped carbon and graphene double-coated LiMn0.6Fe0.4PO4 (LMFP) nanorods, synthesized via a facile low temperature solvothermal method that employs a hybrid glucose and polyvinylidene fluoride as carbon and fluorine sources. As revealed by physicochemical characterization, F-doped carbon coating and graphene form a ‘point-to-surface’ conductive network, facilitating rapid electron transport and mitigating electrochemical polarization. Furthermore, the uniform thickness of the F-doped carbon coating alters the growth of nanoparticles and prevents direct contact between the material and the electrolyte, thereby enhancing structural stability. Strong electronegative F− is beneficial to inhibit the structural changes of LMFP caused by Li-insertion/extraction during charge/discharge, which effectively reduces the Jahn-Teller effect, and inhibits Mn dissolution. The distinctive architecture of LMFP/C-F/G cathode material exhibits excellent electrochemical properties, exhibiting an initial discharge capacity of 163.1 mAh g−1 at 0.1 C and a constant Coulombic efficiency of 99.7% over 100 cycles. Notably, LMFP/C-F/G cathode material achieves an impressive energy density of 607.6 Wh kg−1 , surpassing that of commercial counterparts. Moreover, it delivers a reversible capacity of 90.3 mAh g−1 at a high current rate of 5 C. The high-capacity capability and energy density of the prepared materials give them great potential for use in next-generation lithium-ion batteries.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5c502357b573f771c0bfb5eb28519da7d25ca2a5559adb2ae01e096d51e6948a","category":"Interdisciplinary"}