{"title":"Poc launches Elicit Clarity, its lightest ever glasses weighing just 23g","link":"https://www.cyclist.co.uk/news/10233/poc-elicit-clarity-sunglasses","date":1636029920000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>4 Nov 2021</span></div>    </div></div><p>\nUsing a clever truss design along the arms, Poc's Elicity Clarity glasses boast big lenses and super low weight</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/11/poc_elicit_clarity_1.jpg?itok=CtGso_0j\" />  </div>\n<div>\n      <p> Poc has launched the new Elicit Clarity sunglasses, its lightest ever pair weighing in at a claimed 23g.</p>\n<p>With lenses growing so much in the last decade, brands have had to react by trimming grams wherever they can and these are not only frameless but built with carefully designed truss-structured arms that aim to balance low weight and strong support.</p>\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/11/poc_elicit_clarity_2.jpg\" />  </div>\n</div>\n<p>They've been made with a polyamide called Grilamid that's used not only for its weight-saving properties but for its flex fatigue strength and impact resistance.</p>\n<p>Alongside that it has snap-in hinges that make swapping out the lenses easy and allows for the arms to detach in a crash to keep damage to a minimum.</p>\n<p>Meanwhile the lens – which is one curved piece for optimum coverage and weight – features Poc's sharpness-enhancing Clarity technology, hence the name, as well as UV400, Ri-Pel and anti-scratch treatments that prevent lens damage from dirt, water and salt among other things and protect from UVA and UVB.</p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/11/poc_elicit_clarity_3.png\" />  </div>\n</div>\n<p>Poc's head of product Oscar Huss said, 'We know that grams matter, so we set ourselves the challenge of creating the lightest performance eyewear we could, balanced with a large modern shield lens for enhanced coverage, visibility and protection.</p>\n<p>'The simplest way to cut weight would have been to make the lens smaller but this does not match the expectations of modern performance eyewear, especially protection and visibility.'</p>\n<p>You may have already spotted the glasses in the wild as EF Education-Nippo's Mitch Docker has been wearing them during the pro season including at Paris-Roubaix as well as his Length of Sweden ride and was heavily involved in their testing.</p>\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/11/mitch_docker_poc_elicit_clarity_paris_roubaix_gruber_images.jpg\" />  </div>\n</div>\n<p>Docker said, 'The lightness means I hardly notice them and they are beautifully balanced. I am a fan of bigger lenses and I have ridden the Elicit's in almost every weather condition, including my last race, Paris-Roubaix, which was very messy but they handled it all.'</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/10222/lemond-prolog-ebike\">In the Drops: LeMond e-bike, Maap kit, Brompton jacket, POC Omne Eternal helmet and Snail Mail</a></div>      <div><a href=\"/news/9263/poc-ventral-lite-poc-launches-lightest-ever-helmet\">Poc Ventral Lite: Poc launches lightest ever helmet</a></div>      <div><a href=\"/buying-guides/1511/buyers-guide-cycling-sunglasses\">Best cycling sunglasses: look good on the bike</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 120: on sale now!</a></div>    </div></div><p>\nAvailable from the spring, they'll come in white, black, orange, pink, purple and yellow and included in the price – a rather hefty €240 (approx. £205) – is a spare clear lens for all-year-round use and an extra nosepiece to switch out for sizing.</p>\n<p>For more information visit <a href=\"https://www.pocsports.com/collections/sunglasses-performance\" target=\"_blank\">pocsports.com</a> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/glasses\">Glasses</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"5c59ca8a4306ce7918bf16abe8d380cb9fadd5231572ffbf6818e4b57158448b","category":"Cycling"}