{"title":"COVID-19 and influenza vaccine-hesitancy subgroups","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308159","date":1722348000000,"content":"<p>by Karl O. Mäki, Linda C. Karlsson, Johanna K. Kaakinen, Philipp Schmid, Stephan Lewandowsky, Jan Antfolk, Anna Soveri</p>\r\n\r\nHealth communicators are faced with the challenge that people can hesitate vaccines for different reasons. Our aim was to identify and describe the qualities of distinct COVID-19 and influenza vaccine-hesitancy subgroups to facilitate the development of tailored vaccine-hesitancy communication. In two studies, we used agglomerative hierarchical cluster analysis to identify COVID-19 (N = 554) and influenza (N = 539) vaccine-hesitancy subgroups in the general population based on nine vaccine hesitancy-related variables (intent to get vaccinated, perceived vaccine safety, perceived vaccine efficacy, perceived disease threat, perceived vaccination responsibility, perceived vaccination convenience, distrust in authorities, conspiracy mentality, and reliance on anecdotal testimonies). We identified and described six distinct COVID-19 vaccine-hesitancy subgroups (<i>the Vaccination Positive</i>, <i>the Ambivalent</i>, <i>the Fearing Skeptic</i>, <i>the Unconvinced</i>, <i>the Constrained Skeptic</i>, and <i>the Vaccination Opponent</i>), and three influenza vaccine-hesitancy subgroups (<i>the Vaccination Positive</i>, <i>the Complacent</i>, and <i>the Vaccination Opponent</i>), with different levels of hesitancy. We discuss the implications of the results for health communicators. Our results shed light on the (dis)similarities between people who hesitate COVID-19 and influenza vaccines and suggest that there is greater variety in hesitancy concerning COVID-19 vaccinations than influenza vaccinations. These findings can be used to design and test tailored vaccination messages.","author":"Karl O. Mäki","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5c5d8a57f243ef2c88f9028b10cf83e6b57d398be4d787162afa83c0e84cbfee","category":"Interdisciplinary"}