{"title":"[ลือ] Mark Zuckerberg ยังไม่เคาะชื่อใหม่ Facebook, ชื่อที่เป็นไปได้คือ Horizon และ Meta","link":"https://www.blognone.com/node/125400","date":1634808499000,"content":"<div><div><div><p>เว็บไซต์ Platformer ให้ข้อมูลเพิ่มเติมในประเด็น<a href=\"https://www.blognone.com/node/125372\">ข่าวลือว่า Facebook จะเปลี่ยนชื่อบริษัท</a> ว่าตอนนี้ Mark Zuckerberg ยังไม่ตกลงใจว่าจะเลือกชื่ออะไรดี ส่วนช่วงเวลาประกาศชื่อใหม่เป็นไปได้ตั้งแต่วันจันทร์หน้า (25 ต.ค.) ซึ่งเป็นการแถลงผลประกอบการประจำไตรมาส ไปจนถึงงาน Oculus Connect ในวันพฤหัสหน้า (28 ต.ค.)</p>\n<p>ไอเดียเรื่องการเปลี่ยนชื่อบริษัท Facebook มีมานานตั้งแต่ปี 2016 โดย Antonio Lucio อดีตหัวหน้าฝ่ายการตลาด (CMO) ในเวลานั้น ที่อยากเปลี่ยนชื่อบริษัทให้ต่างจากชื่อบริการ แต่ไอเดียนี้ไม่ได้รับการตอบรับ</p>\n<p>ส่วนการกลับมาของไอเดียเปลี่ยนชื่อบริษัทรอบนี้ เกิดจากสองปัจจัย ปัจจัยแรกคือชื่อเสียงของบริษัทที่ย่ำแย่ลงเรื่อยๆ โดนนักการเมืองเพ่งเล็งอยู่เสมอ และปัจจัยที่สองคือแอพ Facebook เริ่มไม่ใช่อนาคตของบริษัท (แม้ยังทำเงินมหาศาล) เพราะวัยรุ่นยุคใหม่นิยมไปใช้ Instagram มากกว่าแทน</p>\n<p>ชื่อที่เป็นไปได้ที่ถูกพูดถึงคือ <a href=\"https://www.blognone.com/node/112183\">Horizon ซึ่งปัจจุบันใช้กับบริการโซเชียลแบบ VR</a> (Horizon Worlds และ <a href=\"https://www.blognone.com/node/124342\">Horizon Workrooms</a>) เพราะมีความหมายไปถึง<a href=\"https://www.blognone.com/node/123906\">วิสัยทัศน์ใหม่ Metaverse ที่บริษัทต้องการมุ่งไป</a> ส่วนอีกชื่อหนึ่งคือ Meta โดยมีคนค้นพบว่าบริษัทในเครือข่ายของ Chan Zuckerberg Initiative (CZI) เป็นเจ้าของโดเมน meta.com อยู่ในตอนนี้ด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7140facf1f040bc7afc26ecc3557761c.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.platformer.news/p/why-facebook-is-rebranding\">Platformer</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/rumor\">Rumor</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5c5da197474ffa68e1ea3dcb9dbd55a0581f61a1029db9eb0398335b182b7ede","category":"Thai"}