{"title":"5 road bike tech trends that turned out to be dead ends","link":"https://www.bikeradar.com/features/road-bike-tech-that-failed/","date":1617984043000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/Magura-hydraulic-TT-rim-brake-Delaney-aabc723.jpg?quality=90&amp;resize=620,413\" />                                            <p>Being an early adopter in cycling means you get to be first to ride exciting new tech. There is a downside though in that sometimes new concepts just don’t catch on, and they get abandoned by the wayside.</p>\n<p>Road bike tech has undergone seismic changes in recent years, with <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">disc brakes</a>, electronic shifting and other new tech disrupting the status quo and taking over at the top end.</p>\n<p>These advances have brought great benefits to riders, but spawned numerous orphaned, obsolete or simply downright inelegant products. Here are our top five road tech dead ends.</p>\n<h2>1. Hydraulic rim brakes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Hydraulic rim brakes have existed for decades but never took off for road bikes.</span></figcaption><span> <i>James Huang / Immediate Media</i></span></div>\n<p>Hydraulic rim brakes for road bikes are a good idea that arguably came at the wrong moment.</p>\n<p>A little background first: hydraulic rim brakes as a concept have been around for decades, and plenty of mountain bikers had Maguras in the nineties before disc brakes took over.</p>\n<p>They were well regarded and, remarkably, you can still buy versions of them today – they’re still moderately popular on trekking/touring bikes on the continent.</p>\n<p>There was even a version for drop bars at one stage (<em>Cyclocross</em> <em>Magazine</em> has a nice write-up <a href=\"https://www.cxmagazine.com/tbt-magura-hydraulic-cantilever-brake-drop-bar-lever-hs66-hs77-rim\" target=\"_blank\">here</a>), but it was a brake lever only, not an integrated shift/brake lever. Oh, and <a href=\"https://www.bikeradar.com/reviews/components/brakes/brake-calipers/magura-rt8-tt-hydraulic-brakes-review/\">Magura made them for time trial and triathlon bikes too</a>.</p>\n<p>When <a href=\"https://www.bikeradar.com/news/sram-red-22-11-speed-hydraulic-mechanical-group-full-details/\">SRAM launched its new Red and Force road groupsets in 2013</a> they came in standard rim brake, hydraulic rim brake and hydraulic disc brake variants.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> SRAM dared to dream with its hydraulic rim brakes, but they never caught on.</span></figcaption><span> <i>Oli Woodman / Immediate Media</i></span></div>\n<p>The hydraulic rim brakes were praised for their feel and modulation – the two key claimed advantages over a standard cable rim brake – but it seems like hardly anyone actually bought them. The same could be said of Rotor’s hydraulic rim brakes, which formed part of the ultra-niche <a href=\"https://www.bikeradar.com/news/hands-on-rotors-new-uno-hydraulic-road-groupset/\">Uno hydraulic-shifting groupset</a>.</p>\n<p>If ever hydraulic rim brakes for the road could have had a moment, this was it, but they never caught on and, with the dominance of discs, they never will.</p>\n<p>The problem with hydraulic rim brakes is not that they’re bad, it’s just that conventional hydraulic disc brakes offer much the same advantages and none of the downsides.</p>\n<p>A hydraulic rim brake has the more onerous maintenance requirements of any hydraulic braking system, but braking is still liable to suffer in wet or muddy conditions.</p>\n<p>Discs, on the other hand, perform well in all conditions and, if you just want the simplicity and low weight of rim brakes, good old cables still work just fine.</p>\n<h2>2. Hydraulic converters</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Hope V-Twin hydraulic disc brakes</span></figcaption><span> <i>Joseph Branston / Immediate Media</i></span></div>\n<p>In a very similar vein, hydraulic converters for road brakes were a stepping-stone technology that has all but died out, mourned by few.</p>\n<p>The principle made sense in a world before dedicated hydraulic road levers were widely available.</p>\n<p>If you wanted discs on your road or cyclocross bike – gravel wasn’t even a term then – your options were <a href=\"https://www.bikeradar.com/features/why-its-time-to-consign-cable-disc-brakes-to-history/\">cable-operated discs</a> or a converter that let you operate hydraulic brakes via your standard road levers.</p>\n<p>There were a handful of these converters on the market including the <a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/hope-v-twin-hydraulic-disc-brakes-review/\">Hope V-Twin</a>, a device that nestled underneath your bike’s stem.</p>\n<p>Giant persisted with its similar Conduct system until very recently, as a way to give its most affordable road bikes hydraulics. Again, it worked fine, but it never felt like an elegant solution.</p>\n<p>TRP offered (and still offers) the <a href=\"https://www.bikeradar.com/reviews/components/brakes/brake-calipers/trp-hy-rd-road-disc-brakes-first-ride-review/\">HY/RD, a hydraulic caliper that’s cable-actuated</a>, and there was at least one competitor on the market from <a href=\"https://www.bikeradar.com/reviews/components/brakes/brake-calipers/juin-tech-r1-disc-brakes-review/\">Juin Tech</a>. If you’re dead-set on running cable levers but want the benefits of hydraulic braking, this is surely the neatest way to go about it.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> TRP HY/RDs offer the self-adjustment of hydraulics, but work with standard brake levers without adding too much chunky hardware.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<h2>3. Shoe-based power meters</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Sadly, the “wearable” power meter never came to fruition.</span></figcaption><span> <i>Brim Brothers</i></span></div>\n<p>Imagine if your power meter were built into your shoes, meaning you could record power data on every bike you jumped on.</p>\n<p>That was the promise of the Brim Brothers DPMX, which was pitched as “the world’s first wearable power meter”.</p>\n<p>After years of teasers, Brim Brothers <a href=\"https://www.bikeradar.com/news/brim-brothers-pulls-plug-on-zone-dpmx-power-meter/\">launched on Kickstarter in February 2016</a>, promising riders a product as early as July the same year. After raising over €180,000, the brand collapsed, taking backers’ money with it – surely the ultimate tech dead end?</p>\n<p>Of course, in this case, the underlying concept still appeals. A power meter is a significant investment and one that isn’t permanently installed on a bike makes a lot of sense; it’s the reason recent products like <a href=\"https://www.bikeradar.com/news/garmin-rally-power-meter-pedals/\">Garmin’s Rally RS200</a> and <a href=\"https://www.bikeradar.com/reviews/training/power-meters/favero-assioma-duo-power-meter-pedals-review/\">Favero’s Assioma pedals</a> have made such an impact.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Power meter pedals like the Garmin Rally are hot property right now.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>It’s been demonstrated time and time again that making a reliable and consistently accurate power meter is actually very difficult.</p>\n<p>Could the shoe-based option still have merit? Perhaps.</p>\n<h2>4. Quick-release disc frames and post-mount brakes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The first generation of drop-bar disc bikes used post-mount brake calipers and standard quick-release skewers.</span></figcaption><span> <i>Josh Patterson / Immediate Media</i></span></div>\n<p>Brakes have rather dominated this list because the knock-on effects of the evolving tech have been so profound.</p>\n<p>It’s hard to pick out exactly which of the many new and newly-abandoned standards matters most, but perhaps two of the biggest upsets have been the abandonment of quick-release (QR) skewers and the move to flat-mount brakes.</p>\n<p>Road bikes had quick releases for the better part of a century because they were a simple and highly effective way to retain a wheel, and allowed for rapid wheel changes too.</p>\n<p>Thru-axles, however, offer increased stiffness, improved wheel security and more consistent disc rotor alignment. So their takeover has been all but inevitable – even though they are invariably slower to install or remove than quick releases.</p>\n<p>As a result, the first generation of road disc frames is now somewhat orphaned by its quick-release compatible dropouts. Mercifully, many wheels that ship with thru-axle hubs can be converted to QR, but that may not always be the case.</p>\n<p>To rub salt in the wound, road thru-axle standards have jumped around a bit too – many early road bikes came with a 15mm front / 12mm rear combo, but 12mm / 12mm is now the norm.</p>\n<p>There are even a handful of drop-bar bikes such as the <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/focus-atlas-6-8-review/\">Focus Atlas</a> with Boost mountain bike-style spacing, and <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-axle-standards/\">don’t get us started on the number of thru-axle thread standards out there</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Nominal thru-axle sizes have almost settled down, but different thread standards mean compatibility is still far from simple.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Brake calipers underwent a similar upheaval. The first wave of disc road bikes used post-mount calipers just like mountain bikes, but in 2014 Shimano launched the <a href=\"https://www.bikeradar.com/news/shimano-introduces-new-road-disc-brake-standard/\">flat-mount standard</a> that’s now more-or-less universal.</p>\n<p>The latest <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road and gravel groupsets</a> are flat mount-only so if you’re building up an older frameset, you’re going to have mix and match components, perhaps borrowing from brands’ mountain bike ranges. <a href=\"https://www.bikeradar.com/features/opinion/bike-industry-mtb-standards/\">Standards are fun, eh?</a></p>\n<h2>5. 1× road bike drivetrains</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> 3T’s Strada was a really interesting piece of design and it rode superbly, but it didn’t launch a new wave of 1× road bikes.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>We know this one will be controversial and maybe it won’t age well, but despite some headline-grabbing product launches and the increasing popularity of 1× in the gravel segment, 1× for the road has stubbornly failed to catch on.</p>\n<p><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/3t-strada-first-ride-review/\">3T made waves back in 2017 when it launched the Strada</a>, a 1×-only aero road bike with tyre clearances that were generous by the standards of the time.</p>\n<p>The brand also promised to solve the problem of 1× road gearing with <a href=\"https://www.bikeradar.com/news/1x-for-the-road-just-got-a-lot-more-interesting/\">smart new cassette ratios</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> 3T’s cassettes group gears slightly differently to mainstream options to improve the 1× experience.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>This was to be the future of road cycling and <a href=\"https://www.bikeradar.com/features/pro-bike/aqua-blue-sport-unveil-3t-strada-for-2018/\">3T even sponsored pro team Aqua Blue Sport to prove the tech</a>.</p>\n<p>Despite public interest in the bikes and praise for the brand’s forward-thinking, riders publicly complained about being forced to compete on 1× and amid other shenanigans, the team folded.</p>\n<p>Meanwhile, the buying public seemingly had little appetite for 1× road bikes, perhaps because while 1× drivetrains offer clear advantages when you’re riding off-road, it’s less clear-cut on tarmac.</p>\n<p>Range and gear spacing remain an issue and current options still tend to compromise to some extent on one or the other.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> 1× hasn’t gone mainstream on the road, but the options for gravel such as Campagnolo’s Ekar groupset have got better and better.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Saying that, <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-force-etap-axs-review/\">SRAM’s latest 12-speed groupsets</a> get closer than most to offering a truly useful 1× option for the road. And <a href=\"https://www.bikeradar.com/reviews/components/groupsets/campagnolo-ekar-groupset-review/\">Campagnolo’s Ekar groupset</a> does an arguably even better job, although its gearing is focused on gravel riding – there’s no pure road option at the moment.</p>\n<p>Could 1× for the road still have legs? Watch this space.</p>\n<p>Those are our top five picks – do you think we missed any? Let us know in the comments.</p>","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"5c62cd54435537f62cc386d12b5ebc0e651e19c7e7d8937b895d2aa748dee088","category":"Cycling"}