{"title":"Decision Analysis Approaches on the Collection Methods of Polyethylene Terephthalate Waste","link":"https://www.preprints.org/manuscript/202409.1420/v1","date":1726724363000,"content":"The rising challenge of polyethylene terephthalate (PET) waste necessitates efficient collection methods to mitigate environmental impacts. The Analytic Hierarchy Process (AHP) is one of the Multi-Criteria Decision Analysis (MCDA) approaches utilized in this study. The Technique for Order of Preference by Similarity to the Ideal Solution (TOPSIS) was used to rank each alternative according to the objective weight that AHP had produced. Also, sensitivity analysis was performed to determine how robust the findings were when considering equal weights and entropy weights to maximize PET waste collection techniques. The alternative achieved the objective of obtaining the best collection method, Threshold Plastic Bottle Waste Collection (Tpbw), out of all the three alternatives considered. Another MCDA approach, VIseKriterijumska Optimizacija I Kompromisno Resenje (VIKOR), was used to compare the results and validate the ranking result achieved by the TOPSIS method. The VIKOR technique's validation of the TOPSIS approach showed that the outcomes were highly consistent. Data for the study were gathered from the archives of waste management companies on possible practices of plastic waste collection addressing costs, environmental impacts, social acceptance, feasibility, and efficiency. The findings provide a prioritized framework for enhancing PET waste collection strategies, contributing to sustainable waste management. Many criteria are considered when deciding the best collecting method for PET waste recycling, making it challenging. By using criteria importance, multi-criteria decision analysis (MCDA) was applied in this study, and the objective weight of the criteria was determined using the analytic hierarchy process (AHP). The five criteria considered in this study are Initial investment cost, Operational cost, Transportation cost, Environmental risk, Employment potential, and the objective weights allocated to them. AHP results 0.4952, 0.1997, 0.1565, 0.0870, and 0.0616 are respectively determined.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5c664b26b49469333a49f3e2d808fd173f5a9d740dc42770e9a08733e8d330e3","category":"Interdisciplinary"}