{"title":"Temperature‐dependent dispersal and ectotherm species' distributions in a warming world","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14054?af=R","date":1708939779000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/874fb1fa-e605-4681-8fdc-6f2450a6565c/jane14054-toc-0001-m.png\" alt=\"Temperature-dependent dispersal and ectotherm species' distributions in a warming world\" />\n<p>This paper presents, for the first time, a model in which all aspects of dispersal: emigration, transfer and settlement, are temperature-dependent. It finds that tropical ectotherms can expand their distributions polewards to a greater degree than temperate ectotherms. Tropical ectotherms have an advantage when moving to cooler climates because they experience lower within-patch and dispersal mortality, and their higher thermal optima and maximal birth rates allow them to take advantage of the warmer parts of the year. Previous theory has shown that tropical ectotherms are more successful in invading and adapting the temperate climates than vice versa. This study provides the key missing piece, by showing how temperature-dependent dispersal could facilitate both invasion and adaptation.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nDispersal is a crucial component of species' responses to climate warming. Warming-induced changes in species' distributions are the outcome of how temperature affects dispersal at the individual level. Yet, there is little or no theory that considers the temperature dependence of dispersal when investigating the impacts of warming on species' distributions.\n\nHere I take a first step towards filling this key gap in our knowledge. I focus on ectotherms, species whose body temperature depends on the environmental temperature, not least because they constitute the majority of biodiversity on the planet. I develop a mathematical model of spatial population dynamics that explicitly incorporates mechanistic descriptions of ectotherm life history trait responses to temperature. A novel feature of this framework is the explicit temperature dependence of all phases of dispersal: emigration, transfer and settlement.\n\nI report three key findings. First, dispersal, regardless of whether it is random or temperature-dependent, allows both tropical and temperate ectotherms to track warming-induced changes in their thermal environments and to expand their distributions beyond the lower and upper thermal limits of their respective climate envelopes. In the absence of dispersal mortality, warming does not alter these new distributional limits.\n\nSecond, an analysis based solely on trait response data predicts that tropical ectotherms should be able to expand their distributions polewards to a greater degree than temperate ectotherms. Analysis of the dynamical model confirms this prediction. Tropical ectotherms have an advantage when moving to cooler climates because they experience lower within-patch and dispersal mortality, and their higher thermal optima and maximal birth rates allow them to take advantage of the warmer parts of the year. Previous theory has shown that tropical ectotherms are more successful in invading and adapting the temperate climates than vice versa. This study provides the key missing piece, by showing how temperature-dependent dispersal could facilitate both invasion and adaptation.\n\nThird, dispersal mortality does not affect the poleward expansion of ectotherm distributions. But, it prevents both tropical and temperate ectotherms from maintaining sink populations in localities that are too warm to be viable in the absence of dispersal. Dispersal mortality also affects species' abundance patterns, causing a larger decline in abundance throughout the range when species disperse randomly rather than in response to thermal habitat suitability. In this way, dispersal mortality can facilitate the evolution of dispersal modes that maximize fitness in warmer thermal environments.\n</p>","author":"Priyanga Amarasekare","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"5c66632fb31c13ec1824ef827da4735348404d0d4c3bf8cea88490b7ecb9ccd3","category":"Environment"}