{"title":"New iodine-based plasma thruster tested in orbit","link":"https://arstechnica.com/?p=1813845","date":1637177279000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/iodine_propulsion_system_image_2.image-jpeg-800x534.jpeg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/iodine_propulsion_system_image_2.image-jpeg.jpeg\">Enlarge</a> <span>/</span> A demo version of the new thruster in operation. (credit: ThrustMe)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Most people are probably familiar with iodine through its role as a disinfectant. But if you stayed awake through high school chemistry, then you may have seen a demonstration where powdered iodine was heated. Because its melting and boiling points are very close together at atmospheric pressures, iodine will readily form a purple gas when heated. At lower pressures, it'll go directly from solid to gas, a process called sublimation.</p>\n<p>That, as it turns out, could make it the perfect fuel for a form of highly efficient spacecraft propulsion hardware called ion thrusters. While it has been considered a promising candidate for a while, a commercial company called ThrustMe is now reporting that it has demonstrated an iodine-powered ion thruster in space for the first time.</p>\n<h2>Ion power</h2>\n<p>Rockets rely on chemical reactions to expel a large mass of material as quickly as possible, allowing them to generate enough thrust to lift something into space. But that isn't the most efficient way to generate thrust—we end up trading efficiency in order to get the rapid expulsion needed to overcome gravity. Once in space, that need for speed goes away; we can use more efficient means of expelling material, since a slower rate of acceleration is acceptable for shifting things between different orbits.</p></div><p><a href=\"https://arstechnica.com/?p=1813845#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1813845&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5c70eca473cf4088077506fb4e75c6416a385d4554081d1acd6cbfc660cd9226","category":"Tech"}