{"title":"What is the evidence that counter‐wildlife crime interventions are effective for conserving African, Asian and Latin American wildlife directly threatened by exploitation? A systematic map","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12323?af=R","date":1713239997000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/b30ff8bb-124e-45b9-93f0-e609409ba64a/eso312323-toc-0001-m.png\" alt=\"What is the evidence that counter-wildlife crime interventions are effective for conserving African, Asian and Latin American wildlife directly threatened by exploitation? A systematic map\" />\n<p>Results of our systematic map indicate that despite a relatively large evidence base on the effectiveness of counter-wildlife crime (CWC) interventions for conserving wildlife, most interventions have not been rigorously evaluated. Studies often lacked comparators and experimental designs. We also identify several knowledge gaps that deserve further study, including further investigations in Latin America, on plants, birds and reptiles, for non-patrol-based CWC interventions, and in relation to biological, and the combination of biological and human well-being outcomes. Our assessment of the evidence base provides important first steps towards improving our understanding of CWC intervention effectiveness and making evidence-informed management and funding decisions.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nCounter-wildlife crime (CWC) interventions—those that directly protect target wildlife from illegal harvest/persecution, detect and sanction rule-breakers, and interdict and control illegal wildlife commodities—are widely applied to address biodiversity loss. This systematic map provides an overview of the literature on the effectiveness of CWC interventions for conserving African, Asian and Latin American wildlife directly threatened by exploitation, including human–wildlife conflicts that trigger poaching.\n\nFollowing our systematic map protocol (Rytwinski, Öckerman, et al., 2021), we compiled peer-reviewed and grey literature and screened articles using pre-defined inclusion criteria. Included studies were coded for key variables of interest, from which we produced a searchable database, interactive map and structured heatmaps.\n\nA total of 530 studies from 477 articles were included in the systematic map. Most studies were from Africa and Asia (81% of studies) and focused on African and Asian elephants (16%), felids (14%) and turtles and tortoises (11%). Most evaluations of CWC interventions targeted wildlife products (rather than species) and the transfer of those products along the wildlife crime continuum (40% of cases). Population/species outcomes were most commonly measured via indicators of threat reduction (65% of cases) and intermediate outcomes (25%).\n\nWe identified knowledge clusters where studies investigated the links between (1) patrols and other preventative actions to increase detection and population abundance and (2) information analysis and sharing and wildlife crime/trade levels. However, the effectiveness of most interventions was not rigorously evaluated. Most investigations used post-implementation monitoring only (e.g. lacking a comparator), and no experimental designs were found. We identified several key knowledge gaps including a paucity of studies by geography (Latin America), taxonomy (plants, birds and reptiles), interventions (non-patrol-based CWC interventions) and outcomes (biological and the combination of biological and human well-being outcomes).\n\nOur map reveals an opportunity to improve the rigour and documentation of CWC intervention evaluations, which would enable the evidence-based selection of effective approaches to improve wildlife conservation and national security.\n</p>","author":"T. Rytwinski, \nM. J. Muir, \nJ. R. B. Miller, \nA. Smith, \nL. A. Kelly, \nJ. R. Bennett, \nS. L. A. Öckerman, \nJ. J. Taylor, \nA. M. Lemieux, \nR. S. A. Pickles, \nM. L. Gore, \nS. F. Pires, \nA. Pokempner, \nH. Slaughter, \nD. P. Carlson, \nD. N. Adhiasto, \nI. Arroyo Quiroz, \nS. J. Cooke","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"5c72a847431dba1137148431172cd599ad61923db66cfecfda1a0c6c45c79e9e","category":"Environment"}