{"title":"Apple Pay Later is finally available–but only to ‘randomly selected’ users in the U.S.","link":"https://www.macworld.com/article/1674426/apple-pay-later-available-randomly-selected-users.html","date":1680022393000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple Pay Later, a buy now,-pay later interest-free service announced at WWDC in June 2022, finally began rolling out today, but for the time being, will be open only to the lucky few. And we mean lucky in the literal sense, because Apple says the first people allowed to use the service have been selected at random.</p>\n\n\n\n<p>In a press release, the company says that starting March 28, it “will begin inviting select users to access a pre-release version of Apple Pay Later, with plans to offer it to all eligible users in the coming months.” Select can mean a lot of things (and implies some form of criteria) but in the small print, it clarifies that invitations will be sent to “randomly selected users.” In fact, we suspect that both are true to some extent. It would make sense for Apple to randomly pick invitees from a pool of those who pre-qualify according to a variety of criteria, potentially including past financial activities and/or credit rating.</p>\n\n\n\n<p>One of the qualifying criteria, at any rate, is that you must be 18 or older to use it (19 in Alabama). Another is that you must be a U.S. citizen or resident since Apple is launching the service in its home territory only at first. (Though not in all 50 states: Hawaii, Nevada, New Mexico, North Carolina, Wisconsin, and the U.S. territories are all currently excluded.) We don’t know when the service will spread to the remaining states or to other countries, if at all, nor indeed when it will graduate from “pre-release” to full release. Apple only says it “plans to offer it to all eligible users in the coming months.”</p>\n\n\n\n<p>Beyond these trivial details, however, there’s <a href=\"https://www.macworld.com/article/1507134/apple-pay-later-service-is-getting-ready-for-its-public-release.html\">much about the service</a> to intrigue. It’s a simply structured loan service that splits the cost of purchases into four equal payments: the first must be paid immediately, and the remaining three at two-week intervals. That’s the initial structure, anyway. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2022-06-08/apple-will-handle-the-lending-itself-with-new-pay-later-service&amp;xcust=1-1-1674426-1-0-0&amp;sref=https://www.macworld.com/feed\">Bloomberg reports</a> that a longer-term Apple Pay Monthly plan is in the works as well.</p>\n\n\n\n<p>The service is not limited to the purchase of Apple products, but there is a long list of items that are forbidden, including gambling, cryptocurrency, pornography, tobacco, and gift cards. This includes a blanket ban on “Any goods or services deemed unacceptable by us.”</p>\n\n\n\n<p>As long as the payments are made on time, there are no interest or fees at the consumer end. If payments are missed, however, Apple will be handling the financing itself under a new Apple Financing LLC rather than working with partners such as Goldman Sachs, which handles the Apple Card.</p>\n\n\n\n<p>Apple has published a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT212967&amp;xcust=1-1-1674426-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">support document</a> explaining how to apply for and use Apple Pay Later, but unless Tim Cook sends you a golden ticket, you won’t be able to try the service out for yourself until later this year. Which for reasons of financial prudence might not be a bad thing.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5c735ccdeba1e5f6001be31e5f0ae2964f7a3c6c10079f879f4b0b143bb92c13","category":"Apple"}