{"title":"Winter GPS tagging reveals home ranges during the breeding season for a boreal-nesting migrant songbird, the Golden-crowned Sparrow","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305369","date":1718200800000,"content":"<p>by Autumn R. Iverson, Diana L. Humple, Renée L. Cormier, Thomas P. Hahn, Theadora A. Block, Daizaburo Shizuka, Bruce E. Lyon, Alexis S. Chaine, Emily J. Hudson, Elisha M. Hull</p>\r\n\r\nDetermining space use for species is fundamental to understanding their ecology, and tracking animals can reveal insights into their spatial ecology on home ranges and territories. Recent technological advances have led to GPS-tracking devices light enough for birds as small as ~30 g, creating novel opportunities to remotely monitor fine-scale movements and space use for these smaller species. We tested whether miniaturized GPS tags can allow us to understand space use of migratory birds away from their capture sites and sought to understand both pre-breeding space use as well as territory and habitat use on the breeding grounds. We used GPS tags to characterize home ranges on the breeding grounds for a migratory songbird with limited available breeding information, the Golden-crowned Sparrow (<i>Zonotrichia atricapilla</i>). Using GPS points from 23 individuals across 26 tags (three birds tagged twice), we found home ranges in Alaska and British Columbia were on average 44.1 ha (95% kernel density estimate). In addition, estimates of territory sizes based on field observations (mean 2.1 ha, 95% minimum convex polygon [MCP]) were three times smaller than 95% MCPs created using GPS tags (mean 6.5 ha). Home ranges included a variety of land cover classes, with shrubland particularly dominant (64–100% of home range cover for all but one bird). Three birds tracked twice returned to the same breeding area each year, supporting high breeding site fidelity for this species. We found reverse spring migration for five birds that flew up to 154 km past breeding destinations before returning. GPS-tracking technology allowed for critical ecological insights into this migratory species that breeds in very remote locations.","author":"Autumn R. Iverson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5c7857397026a19fff1f5b0c89837439f0265874bbcee80918a8c3db6321e539","category":"Interdisciplinary"}