{"title":"Epic Games Not Satisfied With Ruling in Case Against Apple, Files Appeal","link":"https://www.macrumors.com/2021/09/13/epic-games-files-appeal-against-apple-ruling/","date":1631523773000,"content":"<a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> has filed an appeal against the ruling in its case against Apple, further prolonging the already year-long legal battle between the two companies. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/app-store-blue-banner-epic-1.jpg\" />\r\n<br />\r\nThe ruling, <a href=\"https://www.macrumors.com/2021/09/10/epic-games-vs-apple-decision/\">announced on Friday</a>, sided with Apple on nine out of the ten counts that ‌Epic Games‌ had presented against the company. Epic, from the start, had alleged that Apple is anti-competitive and that it should open up its devices to third-party app stores, third-party in-app payment methods, and more. The judge said that while the trial showed that Apple \"is engaging in anticompetitive conduct under California’s competition laws,\" ‌Epic Games‌ failed to prove the company is an illegal monopolist or that it violates anti-trust laws.\r\n<br />\r\n\r\n<br />\r\nThe judge most notably ordered Apple not to prohibit developers from adding links to external websites for in-app purchases. A week before the ruling was announced, Apple revealed similar changes to <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> policy, but <a href=\"https://www.macrumors.com/2021/09/01/apple-reader-app-changes-japan-ftc/\">limited to just \"reader\" apps</a>, such as Spotify, Netflix, and others. The judge's ruling requires that Apple extends that privilege to all ‌App Store‌ apps.\r\n<br />\r\n\r\n<br />\r\n‌Epic Games‌' appeal, filed late on Sunday, doesn't provide specifics on what the game developer aims to appeal. Given the outcome of the ruling, however, it's likely it will reattempt to convince a judge that Apple should allow third-party app stores and \"sideloading\" on its devices, that Apple is a monopolist, and that the termination of its developer account was unlawful and that Fortnite should be reinstated onto the ‌App Store‌. \r\n<br />\r\n\r\n<br />\r\nWhile ‌Epic Games‌ has filed its appeal, signaling its dissatisfaction with the ruling, Apple has called it a \"resounding victory.\" Apple has not stated it plans to appeal the verdict, and per the current court order, the company has 90 days before it must allow all apps to link to external websites for in-app purchases. <div>Tag: <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/13/epic-games-files-appeal-against-apple-ruling/\">Epic Games Not Satisfied With Ruling in Case Against Apple, Files Appeal</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/epic-games-not-satisfied-with-ruling-in-case-against-apple-files-appeal.2310530/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=AqcED7VMrMA:oNGuA1c9bPY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=AqcED7VMrMA:oNGuA1c9bPY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/AqcED7VMrMA\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5c7ad58aebd5d8662d61427a33e985011df33d99813695a6f4168706f5564ab1","category":"Apple"}