{"title":"Study: Nematodes use electric fields to hitch rides on bumblebees","link":"https://arstechnica.com/?p=1948727","date":1687814255000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<figure>\n    <div>\n        A nematode (<em>C. elegans</em>) jumps onto a bumblebee along an electrical field to hitch a ride. Credit: Chiba et al., 2023    </div>\n        <figcaption>\n        <div>A nematode (<em>C. elegans</em>) jumps onto a bumblebee along an electrical field to hitch a ride. Credit: Chiba et al., 2023 </div>\n    </figcaption>\n    </figure>\n<p>Japanese scientists working with nematodes (<em>C. elegans</em>) noticed one day that several cultivated worms in the lab mysteriously kept ending up attached to the lids of Petri dishes instead of the dog food agar where they were initially placed. Intrigued, they conducted experiments to figure out how the worms were getting from one point to the other in less than a second.</p>\n<p>The researchers found that, rather than crawling up the walls of the dish, the worms were leaping from the bottom of the plate to the lid—and they were using electric fields to do so. They could even leap from the Petri dish onto a bumblebee, both individually and in large clusters. The team described their work in a <a href=\"https://www.cell.com/current-biology/fulltext/S0960-9822(23)00674-7\">new paper</a> published in the journal Current Biology.</p>\n<p>“Pollinators, such as insects and hummingbirds, are known to be electrically charged, and it is believed that pollen is attracted by the electric field formed by the pollinator and the plant,” <a href=\"https://www.eurekalert.org/news-releases/992727\">said co-author Takuma Sugi</a>, a biophysicist at Hiroshima University in Japan. “However, it was not completely clear whether electric fields are utilized for interactions between different terrestrial animals.”</p></div><p><a href=\"https://arstechnica.com/?p=1948727#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1948727&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5c7de1d7419850bf3b251807e70818751246940399066fdaa26b372af5499e78","category":"Tech"}