{"title":"First Evidence of Widespread Occurrence and Bioaccumulation of the Antiandrogenic Fluorescent Dye 7-(dimethylamino)-4-methylcoumarin and 7-(dimethylamino)-4-methylcoumarin in Dongjiang River Basin, South China","link":"https://www.preprints.org/manuscript/202410.1441/v1","date":1729245582000,"content":"Despite the widespread application of antiandrogenic fluorescent dye synthetic coumarins in both industrial and consumer products, little is known about their occurrence in the aquatic ecosystem. In this study, concentrations of two synthetic coumarins, namely 7-(dimethylamino)-4-methylcoumarin (DACM) and 7-diethylamino-4-methylcoumarin (R-ADMC), were determined in abiotic (water, sediment) and biotic (plant, plankton and fish) samples (n=208) collected from a subtropical freshwater ecosystem, Dongjiang River basin, in southern China. DACM was the predominant compound found in the sediment, plant, algae, zooplankton, and fish muscle samples, with median concentrations at 0.189, 0.421, 0.832, 0.798, and 0.335 ng/g dry wt., respectively, although it was not detected in any surface water sample. For R-ADMC, the median concentrations observed in the surface water, sediment, plant, algae, zooplankton, and fish muscle samples were 0.105 ng/L, 0.012, 0.051, 0.009, 0.008, and 0.181 ng/g, dry wt., respectively. The bioaccumulation factor (BAF) values of DACM and R-ADMC in the algae, zooplankton and fish muscle exceeded 5000 L/kg, suggesting that the two coumarins may have significant bioaccumulation potentials in aquatic biota. Additionally, the mean daily intake (EDI) of coumarins through fish consumption was estimated as 0.27 ng/kg bw/day for toddlers in urban. This is the first field study to document widespread occurrence of the synthetic coumarins in aquatic ecosystems and to elucidate bioaccumulation potential of coumarins in aquatic organisms.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5c82b2e34d30b2e3e360eab21bd0842fbeb90cc50dc18260061aac63011f38c1","category":"Interdisciplinary"}