{"title":"Apple Launches All-in-One Web Page With Privacy Labels for Its Own Apps","link":"https://www.macrumors.com/2021/03/11/apple-launches-privacy-labels-page/","date":1615485605000,"content":"Apple today updated its privacy website with <a href=\"https://www.apple.com/privacy/labels/\">a new \"Labels\" section</a> that brings privacy labels for all of Apple's apps together in one place, making it easier for users to learn about how Apple apps handle their personal data.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-privacy-labels-website.jpg\" alt=\"\" width=\"1600\" height=\"900\" class=\"aligncenter size-full wp-image-788417\" />\r\n<br/>\r\nApple already provided privacy labels for its apps <a href=\"https://www.macrumors.com/2020/12/14/app-store-privacy-labels-ios-14-3/\">since the feature launched last year</a>, but on individual support pages, so this new \"Labels\" section makes it easier to view the labels all in one place, and in alphabetical order. Privacy labels are available for Apple's apps across iOS, iPadOS, macOS, watchOS, and tvOS, so some apps like GarageBand appear more than once. Apple has also included labels for developer tools like Xcode and even the App Store itself, providing a very comprehensive level of privacy information.\r\n<br/>\r\n\r\n<br/>\r\nApple emphasizes that users will not find any data under \"Data Used to Track You\" for its apps, as Apple does not track users. Apple says it holds itself to a higher standard than it does for all other developers, who will be permitted to track users if they obtain their permission via the App Tracking Transparency framework that <a href=\"https://www.macrumors.com/2021/01/28/app-tracking-transparency-required-soon/\">will be enforced as of iOS 14.5</a>.\r\n<br/>\r\n\r\n<br/>\r\nApple introduced privacy labels on the App Store in December, providing users with a broad overview of the data types an app may collect, and whether the information is used to track them or is linked to their identity or device. These labels appear in App Store listings for third-party apps and downloadable Apple apps like Apple Podcasts, while built-in apps that cannot be removed like Messages have labels on Apple's website.\r\n<br/>\r\n\r\n<br/>\r\nApple has required developers to fill out the privacy labels when submitting new apps and app updates to the App Store since early December, but the labels <a href=\"https://www.macrumors.com/2021/01/29/app-store-privacy-labels-accuracy-report/\">function on an honor system</a>. Apple previously said it \"conducts routine and ongoing audits of the information provided\" and works with developers to correct any inaccuracies, adding that apps that fail to come into compliance may ultimately face removal from the App Store.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/privacy/\">privacy</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/11/apple-launches-privacy-labels-page/\">Apple Launches All-in-One Web Page With Privacy Labels for Its Own Apps</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-launches-all-in-one-web-page-with-privacy-labels-for-its-own-apps.2287987/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Y2gfflIS-Hw:Yr4_WF_stuQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Y2gfflIS-Hw:Yr4_WF_stuQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/Y2gfflIS-Hw\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5c8294bbb1385582a797e67bb6c451680f9ef9f6834b5a8d647a930476712c51","category":"Apple"}