{"title":"The treatment of oily wastewater by thermo‐responsive calcium alginate capsules immobilized Pseudomonas aeruginosa","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11022?af=R","date":1713942000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/aa6652c8-c12c-494e-88ac-0e41ce021f87/wer11022-toc-0001-m.png\" alt=\"The treatment of oily wastewater by thermo-responsive calcium alginate capsules immobilized Pseudomonas aeruginosa\" />\n<p>A microfluidic strategy of smart calcium alginate (CA) capsules is presented to immobilize <i>Pseudomonas aeruginosa</i>. The smart CA capsules immobilized with bacteria treat model wastewater containing soybean oil or diesel and display favorable fermentation ability.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>A microfluidic strategy of smart calcium alginate (CA) capsules is presented to immobilize <i>Pseudomonas aeruginosa</i> to treat oil slicks effectively. The capsule wall is embedded with poly (<i>N</i>-isopropyl acrylamide) sub-microspheres as thermo-responsive switches. CA capsules, with a diameter of 3.26 mm and a thin wall thickness about 12.8 μm, have satisfying monodispersity, cavity structure, and dense surface structures. The capsules possess excellent encapsulation of bacteria, which are fixed in a restricted space and become more aggregated. It overcomes the disadvantages of a long fermentation production cycle, easy loss of bacteria, and susceptibility to shear effect. The smart CA capsules immobilized with bacteria treat model wastewater containing soybean oil or diesel and display favorable fermentation ability. The capsules can effectively treat oil slicks with high concentration, and it is an economical way for processing oily wastewater.</p>\n<h2>Practitioner Points</h2>\n<p>\nA thermo-responsive calcium alginate capsule was prepared by microfluidic strategy.\n<i>Pseudomonas aeruginosa</i> is environmentally friendly in treating oil slicks.\nThe capsules, immobilized bacteria, treat oil slicks effectively.\nThis study provides an economical way for processing different oily water.\n</p>","author":"Yin‐liang Lin, \nMing‐xin Zhao, \nYa‐lan Yu, \nSheng‐li Liu, \nMin Li, \nA‐li Jiang, \nMin Deng","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"5c8a06abb9c783f1e6af9280eaa417b0042f933da4082f5b25612d77cc8b6917","category":"Environment"}