{"title":"Morpho-physiological and yield traits for selection of drought tolerant Urochloa grass ecotypes","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae034/7688865?rss=1","date":1717632000000,"content":"<span><div>Abstract</div>Drought has become more recurrent and causes a substantial decline in forage yields leading to strain on feed resources for livestock production. This has intensified the search for drought-tolerant forages to promote sustainable livestock production. The objective of this study was to identify drought-tolerant <span>Urochloa</span> grasses and to discern their morpho-physiological and yield traits to water stress as well as the relationship between these traits and indices of drought resistance. The results showed that the ecotypes, water regimes and their interaction significantly influenced all the studied morpho-physiological and yield traits. There was a significant decrease in plant height, number of leaves and tillers, dry matter yield, relative water content, photosystem II and efficiency of photosystem II with an increase in non-photochemical quenching. The principal component analysis revealed that the performance of <span>Urochloa</span> grass ecotypes was different under water sufficient (WS) and water deficit conditions. Drought tolerance indicators (mean productivity, geometric mean productivity, tolerance index and stress tolerance index) were most effective in identifying <span>Urochloa</span> ecotypes with high biomass production under both water deficient and WS conditions. Ecotypes K17, K7, Kisii, Busia and Kakamega were the most drought tolerant, Basilisk, K6, K10, K19 and Toledo were moderately tolerant whereas, CIAT6385, CIAT16449, K13, K5 and K9 were drought sensitive. The five drought-tolerant <span>Urochloa</span> ecotypes should be tested for sustainable biomass production under field conditions and used in breeding programmes to develop high-yielding drought-tolerant varieties.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"5c9c262ef791472effe7f806168fc7e5a2865f26d04f7ec67cf37c07860d1086","category":"Environment"}