{"title":"285 Impact of feeding strategies on semen concentration, motility, and morphology of the mature AI boar","link":"https://academic.oup.com/jas/article/102/Supplement_2/229/7664743?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this experiment was to determine if varying feeding strategies of maintenance requirements of boars impacts semen concentration, motility, morphology, and cortisol of the working boar. This experiment was conducted at Purdue University over two 9-wk periods with 1-wk before each 9-wk period serving as baseline for analysis. Boars (n = 28; Acuity and Topig Norvsin) from two age groups (9 and 15 mo) and two genetics (maternal and terminal) were used. Boars were blocked by breed and age and randomly allocated to receive one of three feed intake levels of a corn-soybean meal-based diet formulated to meet NRC (2012) maintenance requirements: HIGH (150% maintenance, n = 9); MAIN (100% maintenance, n = 10); and LOW (80% maintenance, n = 9) during the first 9-wk period. During the second 9-wk period remaining HIGH and LOW boars were crossed-over to opposite treatments (HIGH-LOW, n = 9; LOW-HIGH, n = 7), and maintenance boars were unchanged (MAIN-MAIN, n = 8). Semen was collected once/wk using the gloved hand method and 3 mL of ejaculate was diluted in 27 mL of extender (Androhep Plus, Minitube). Semen concentration (Nucleocounter SP-100), motility (Computer Assisted Sperm Analysis, CASA, CEROS II), and sperm cell morphology (phase-contrast, bright-field microscopy) were analyzed. Data were analyzed using PROC MIXED in SAS 9.4 with boar as experimental unit with main effects of feed intake and age with phase (3-wk period) as repeated measure. Significance was determined at <span>P</span> &lt; 0.05 and a trend 0.05 &lt; <span>P</span> ≤ 0.10. Three-way interactions for the first 9-wk period of feed intake*age*phase was observed for total sperm (<span>P</span> &lt; 0.10) and total normal sperm (<span>P</span> &lt; 0.05) with old boars fed HIGH treatment increasing sperm production, but old boars fed MAIN and LOW decreasing sperm production while young boars had minimal changes in sperm production regardless of feeding levels in the first 9-wk period. No other interactions or main effects were observed for the first period. During the second 9-wk period two-way interactions were observed for total sperm (FI*Age; <span>P</span> &lt; 0.05) and total normal sperm (FI*Age; <span>P</span> &lt; 0.01) with old LOW-HIGH boars having the highest total sperm and total normal sperm concentrations and young LOW-HIGH boars having the least total sperm and total normal sperm concentrations. HIGH-LOW fed boars had the greatest decrease in semen volume compared with the other treatments (FI*Phase; P &lt; 0.01). Boars fed MAIN had minimal impacts on semen parameters compared with HIGH and LOW feed intake treatments. HIGH and LOW feed intake was observed to impact semen parameters in old boars faster than young boars with neither age being able to return to their baseline semen parameters observed at the start of the trial. Future research is needed with varying ages and feed intakes to better understand how nutritional strategies impact semen quantity and quality in the boar stud.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5ca3cce548a64286ea6b8306086e37a63fc88082d4834095e137b2717ef71142","category":"Environment"}