{"title":"Seafloor bioturbation intensity on the deep sea: More complex than organic matter","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12632?af=R","date":1721470430000,"content":"<h2>Abstract</h2>\n<p>Deep-sea benthic communities are strongly controlled by the quantity and quality of organic matter sinking from the ocean surface. The interaction between benthic fauna and seafloor sediments mainly occurs through bioturbation that modifies substrate properties (e.g., geochemical profiles). The intensity of the bioturbation has long been linked with organic matter and measured as a diffusive process by considering the vertical particle reworking (endobenthic bioturbation), disregarding the seafloor horizontal mixing (epibenthic bioturbation). Here, a novel approach to quantify horizontal mixing is presented: Seafloor Bioturbation Intensity (SBI). SBI calculations were based on seafloor image datasets from eight stations that reflected different environmental conditions in the north-western Pacific (e.g., chlorophyll <i>a</i>, silicate). To calculate SBI, we characterized the area occupied by all different types of traces (i.e., lebensspuren) related to epibenthic bioturbation, trace makers, and their ingested sediment thickness. Our results showed a weak negative correlation between organic matter and SBI. This relationship contrast with the traditionally held view on vertical bioturbation intensity, where a dominant positive correlation is expected. It is demonstrated that lebensspuren morphotypes contributed differently to SBI. Not all morphotypes—and, by extension, their corresponding trace makers—are equally controlled by the same environmental factors. This investigation does not dismiss the importance of organic matter content, but emphasizes the importance of other environmental variables that need to be considered when determining the long-term relation between epibenthic fauna and bioturbation intensity. Finally, we emphasize the importance of characterizing horizontal bioturbation for approaching global biogeochemical cycles and conservational strategies.</p>","author":"Olmo Miguez‐Salas, \nHanieh Saeedi, \nAngelika Brandt, \nTorben Riehl","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"5ca5427c4e0175278e78a96dd1cad3a3b62708dca59dab0c3e9548ee1006ac85","category":"Environment"}