{"title":"HBO Max signs “adult” cartoon series based on Scooby-Doo’s Velma","link":"https://arstechnica.com/?p=1741216","date":1612995407000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/velma-clone-high-800x367.jpg\" alt=\"This artist's approximation imagines Velma from the &lt;em&gt;Scooby-Doo&lt;/em&gt; series getting chummy with the &lt;em&gt;Clone High&lt;/em&gt; cast. We doubt that such a crossover will happen, but animation nerds can dream, right?\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/velma-clone-high.jpg\" class=\"enlarge-link\" data-height=\"435\" data-width=\"948\">Enlarge</a> <span class=\"sep\">/</span> This artist's approximation imagines Velma from the <em>Scooby-Doo</em> series getting chummy with the <em>Clone High</em> cast. We doubt that such a crossover will happen, but animation nerds can dream, right? (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://arstechnica.com/author/aurich-lawson/\">WarnerMedia / Aurich Lawson</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>One of HBO Max's biggest differentiators in the video-streaming scramble has been its animation family, which includes a glut of established \"mature\" cartoons from families like Adult Swim and DC Universe. A Wednesday announcement sees WarnerMedia moving aggressively on that front with a whopping seven new series orders on top of existing series in development.</p>\n<p>Today, the company's Hanna-Barbera family announced one of its biggest nudge-nudge, wink-wink series ideas since off-kilter fare like <em>Space Ghost</em>: a series, simply named <em>Velma,</em> about the \"origins\" of <em>Scooby-Doo</em> mainstay Velma Dinkley.</p>\n<h2>Suggestive Scooby stuff, from Gunn to Max</h2>\n<p>WarnerMedia's press release says the series' first ordered season will offer \"an original and humorous spin that unmasks the complex and colorful past of one of America’s most beloved mystery solvers,\" then confirms Mindy Kaling (<em>The Office</em>) as the voice of Velma. Kaling will also serve as an executive producer of the show. The announcement doesn't include information on other cast members or writers/directors, simply doubling down on a suggestive description: \"an adult animated comedy series.\"</p></div><p><a href=\"https://arstechnica.com/?p=1741216#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1741216&comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5cb43d3a9b7c9b9a60cd7876810dbe430e3ea950072e14beb034dedf8e6ac3b3","category":"Tech"}