{"title":"Google ประกาศเพิ่มโดเมน TLD .zip และ .mov - นักวิจัยกังวลปัญหาความปลอดภัย","link":"https://www.blognone.com/node/133917","date":1684554525000,"content":"<div><div><div><p>ก่อนหน้านี้กูเกิล<a href=\"https://blog.google/products/registry/8-new-top-level-domains-for-dads-grads-tech/\">ประกาศเพิ่มโดเมนระดับใหญ่สุด</a>หรือ Top-Level Domain (TLD) เพิ่มเติมอีก 8 ชื่อ ได้แก่ .dad, .esq, .prof, .phd, .nexus, .foo และอีกสองชื่อที่เป็นประเด็นในข่าวนี้คือ .zip และ .mov</p>\n<p>โดยผู้เชี่ยวชาญและนักวิจัยความปลอดภัยไซเบอร์หลายคน แสดงความกังวลว่าชื่อ zip และ mov นี้ อาจถูกใช้จดเป็นโดเมนเพื่อทำเว็บฟิชชิ่งหรือฝังมัลแวร์ได้ เนื่องจากสามารถทำให้ผู้ใช้งานสับสนง่าย ทั้งนี้โดเมน .zip และ .mov ได้รับการอนุมัติให้ใช้งานได้ตั้งแต่ปี 2014 แต่เพิ่งเปิดให้สมัครจดโดเมนได้ทั่วไปเมื่อต้นเดือนที่ผ่านมา</p>\n<p>วิธีการหลอกล่อให้กดลิงก์ ทำได้ในรูปแบบการแสร้งว่าส่งไฟล์ที่เป็น .zip หรือ .mov ให้ผ่านช่องทางต่าง ๆ แต่จริง ๆ แล้วเมื่อกดลิงก์แทนที่จะดาวน์โหลดไฟล์ กลับเป็นการเข้าไปตาม url นั้นแทน เป็นต้น ถึงแม้วิธีดังกล่าวอาจต้องลงทุนมาก (จดโดเมน เพื่อหลอกส่งไฟล์) แต่นักวิจัยจาก Silent Push Labs ก็เริ่มพบเว็บฟิชชิ่งที่ใช้โดเมนกลุ่มนี้แล้ว อีกวิธีการคือใส่ delimiter แทรกไปใน url หลัก เพื่อให้เข้าลิงก์ที่ต้องการแทน เช่น การใส่ @ ใน GitHub</p>\n<p>อย่างไรก็ตามนักวิจัยหลายคนก็เริ่มชิงจดโดเมน .zip ในชื่อที่คาดว่าจะถูกใช้ฟิชชิ่ง เช่น update.zip, financialstatement.zip, setup.zip, attachment.zip หรือ officeupdate.zip โดยหวังใช้เป็นช่องทางเผยแพร่ความรู้การป้องกันการถูกโจมตีไปในตัวด้วย</p>\n<p>ขณะที่ความเห็นของตัวแทนกูเกิล ที่ให้บริการจดโดเมนชุดดังกล่าว มองว่าความกังวลนี้ไม่ใช่เรื่องใหม่ โดยยกตัวอย่างโดเมน command.com ซึ่งเป็นสินค้าของ 3M แต่ก็เป็นชื่อคำสั่งของ MS DOS ด้วย สิ่งที่สามารถป้องกันปัญหานี้ได้คือแอพพลิเคชันที่เข้าถึง เช่น กูเกิลก็เพิ่มเครื่องมือต่าง ๆ ตรวจสอบและป้องกันสำหรับผู้ใช้งานอยู่แล้ว</p>\n<p>ที่มา: <a href=\"https://www.bleepingcomputer.com/news/security/new-zip-domains-spark-debate-among-cybersecurity-experts/\">Bleeping Computer</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/7d21f8e0d75bfd80e2aaae252f92600e.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/web-security\">Web Security</a></div><div><a href=\"/topics/domain-name\">Domain Name</a></div><div><a href=\"/topics/cybersecurity\">Cybersecurity</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5cb7381baa4d2a59f10bc89b481606e716ccf5663c51f74592c88991f70c974e","category":"Thai"}