{"title":"Multi-Host Pathogen Transmission and the Disease-Diversity Relationship","link":"https://www.preprints.org/manuscript/202110.0295/v5","date":1724121358000,"content":"Disease transmission in wildlife is linked to ecosystem and human health, and host community structure can mediate pathogen spread.  Here, we decompose the well-known susceptible-infected (SI) compartmental models of disease transmission for multi-host communities to explore the disease-biodiversity relationship. We examine the parameters involved in interspecific transmission and link them to the multi-host outbreak potential, R0. We partition R0 into its separate elements that can be associated with either the recipient or donating host, and show how this allows us to identify maintenance versus spillover hosts, allowing us to quantify separate stages of spillover into a novel, recipient host.  We further suggest that the evolutionary relatedness between donating and recipient host may play a role in the probability a pathogen establishes in a novel species, as illustrated by the observed phylogenetic signal in the host-breadth of multi-host pathogens. We discuss how anthropogenic changes to the environment and wildlife communities, such as the reduction and fragmentation of wildlife habitat, might alter the mode and dynamics of disease transmission. This discussion contributes to the ongoing debate on the relationship between disease incidence and biodiversity. Through a synthesis of classic ecological theory, we illustrate how pathogens can affect host populations through phenomena such as in/direct symbioses, that can save a pathogen from extinction or suppress competing host species, but we highlight how host diversity can simultaneosuly influence the survival and success of the pathogen, suggesting a complex feedback between hosts and parasites in multi-host communities. Our review provides a guide to common derivations of interspecific transmission, and underscores the critical connections between community and disease-ecology.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5cb84659b68275f0e750e104b41da86d2ea478499c2ca02056f95b1bcfbb8d01","category":"Interdisciplinary"}