{"title":"Tropical bloom‐forming mesoalgae Cladophoropsis sp. and Laurencia sp.—responses to ammonium enrichment and a simulated heatwave","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13435?af=R","date":1712751025000,"content":"<h2>Abstract</h2>\n<p>Algal blooms are increasing worldwide, driven by elevated nutrient inputs. However, it is still unknown how tropical benthic algae will respond to heatwaves, which are expected to be more frequent under global warming. In the present study, a multifactorial experiment was carried out to investigate the potential synergistic effects of increased ammonium inputs (25 μM, control at 2.5 μM) and a heatwave (31°C, control at 25°C) on the growth and physiology (e.g., ammonium uptake, nutrient assimilation, photosynthetic performance, and pigment concentrations) of two bloom-forming algal species, <i>Cladophoropsis</i> sp. and <i>Laurencia</i> sp. Both algae positively responded to elevated ammonium concentrations with higher growth and chlorophyll <i>a</i> and lutein concentrations. Increased temperature was generally a less important driver, interacting with elevated ammonium by decreasing the algaes' %N content and N:P ratios. Interestingly, this stress response was not captured by the photosynthetic yield (<i>F</i>v/<i>F</i>m) nor by the carbon assimilation (%C), which increased for both algae at higher temperatures. The negative effects of higher temperature were, however, buffered by nutrient inputs, showing an antagonistic response in the combined treatment for the concentration of VAZ (violaxanthin, antheraxanthin, zeaxanthin) and thalli growth. Ammonium uptake was initially higher for <i>Cladophoropsis</i> sp. and increased for <i>Laurencia</i> sp. over experimental time, showing an acclimation capacity even in a short time interval. This experiment shows that <i>both algae</i> benefited from increased ammonium pulses and were able to overcome the otherwise detrimental stress of increasingly emerging temperature anomalies, which provide them a strong competitive advantage and might support their further expansions in tropical marine systems.</p>","author":"Anna Fricke, \nFelix Bast, \nAgustín Moreira‐Saporiti, \nGiovanni Martins Bussanello, \nFlower E. Msuya, \nMirta Teichberg","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"5cc2788de846637ca3bd4d97057b5e21226937f13e7edb061bd771e0bf67ca17","category":"Environment"}