{"title":"Not just candy: A herbivore‐induced defence‐related plant protein in honeydew enhances natural enemy fitness","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14605?af=R","date":1719203325000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/eb688d65-48d8-4d46-ab17-4d4c55021c21/fec14605-toc-0001-m.png\" alt=\"Not just candy: A herbivore-induced defence-related plant protein in honeydew enhances natural enemy fitness\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/06/07/not-just-candy-a-plant-protein-in-insect-honeydew-boosts-a-parasitic-wasps-fitness/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nHerbivore feeding often increases secondary metabolite production in plants. These herbivore-induced plant proteins might end up in honeydew excreted by phloem-feeding insects. This is important because honeydew is one of the most abundant and accessible carbohydrate sources for natural enemies in many agroecosystems and these proteins can thus mediate many tri-trophic interactions.\n\nHere, we hypothesized that defensive metabolites induced in the phloem by herbivory accumulate in the honeydew excreted by phloem-feeding insects and, consequently, affect the fitness of the herbivores' natural enemies that feed on it.\n\nWe used a tri-trophic system consisting of citrus plants, the mealybug <i>Planococcus citri</i> and its primary parasitoid <i>Anagyrus vladimiri</i>. First, we assessed <i>A. vladimiri</i> fitness when fed on <i>P. citri</i> honeydew. We then collected honeydew of seven phloem-feeding insects, including <i>P. citri</i>, and analysed their protein content. Finally, we analysed the effect of superoxide dismutase (SOD), an antioxidant enzyme associated with plant defences that was commonly found in the analysed honeydews, on <i>A. vladimiri</i> fitness.\n\nThe fitness of <i>A. vladimiri</i> increased when fed on honeydew compared to a sucrose-based diet, demonstrating that honeydew can contain compounds that benefit natural enemies. Proteomic analyses showed that defence-related plant proteins were present in honeydew of seven phloem-feeding insects analysed. Among these, the enzyme SOD was present in honeydew of all of them. Moreover, the levels of SOD were 10-fold higher in the phloem of plants infested by <i>P. citri</i> than in that of uninfested plants. SOD was also actively excreted in <i>P. citri</i> honeydew, and we proved that it increases the fecundity of the parasitoid <i>A. vladimiri</i>.\n\nWe conclude that enzymatic proteins induced by herbivory in the phloem and involved in plant defence, accumulate in the honeydew excreted by phloem-feeding insects and, contrary to the current paradigm, at least some of these can have positive effects on the third trophic level.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/06/07/not-just-candy-a-plant-protein-in-insect-honeydew-boosts-a-parasitic-wasps-fitness/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>Resumen</h2>\n<p>\n\nAl alimentarse de las plantas, los insectos herbívoros suelen inducir en éstas la producción de metabolitos secundarios. Estos compuestos pueden terminar en la melaza que excretan los propios insectos que se han alimentado del floema. Esto es importante porque la melaza es una de las fuentes de carbohidratos más abundantes y accesibles para los enemigos naturales en la mayoría de agroecosistemas y, por tanto, estos metabolitos pueden modular numerosas interacciones tritróficas.\n\nEn este estudio, se planteó si los metabolitos inducidos por los insectos herbívoros que se alimentan del floema se acumulan en la melaza que excretan y, en consecuencia, afectan los parámetros biológicos de los enemigos naturales que se alimentan de esta melaza.\n\nLas especies seleccionadas para este estudio fueron los cítricos como plantas, la cochinilla <i>Planococcus citri</i> como herbívoro que se alimenta de floema y excreta melaza y su parasitoide primario <i>Anagyrus vladimiri</i>. Primero, se evaluó la longevidad y fecundidad de <i>A. vladimiri</i> cuando se alimentó de melaza de <i>P. citri</i>. Luego, se recolectó melaza de siete especies de insectos que se alimentan del floema, incluyendo <i>P. citri</i>, y se analizó su contenido de proteínas. Finalmente, se evaluó el efecto de la proteína superóxido dismutasa (SOD) en la longevidad y fecundidad de <i>A. vladimiri</i>. Esta enzima, de reconocido efecto antioxidante y asociada con las defensas de las plantas, se encontró en todas las melazas analizadas.\n\nLa longevidad y fecundidad de <i>A. vladimiri</i> fue mayor cuando se alimentó de melaza que cuando lo hizo de una dieta basada sólo en azúcares, demostrando que la melaza puede contener otros compuestos que benefician a los enemigos naturales. Los análisis proteómicos mostraron que había proteínas vegetales relacionadas con la defensa en la melaza excretada por las siete especies de insectos. Entre ellas, la enzima SOD, con niveles expresión diez veces más altos en el floema de plantas infestadas por <i>P. citri</i> que en plantas no infestadas. Al añadir SOD a una dieta basada en azúcares, la fecundidad del parasitoide <i>A. vladimiri</i> aumentó de forma significativa.\n\nEste estudio concluye que las proteínas enzimáticas inducidas en la defensa de las plantas, se acumulan en la melaza excretada por insectos que se alimentan del floema y, contrariamente al paradigma actual, algunas de estas enzimas tienen efectos positivos en el tercer nivel trófico.\n</p>","author":"Pablo Urbaneja‐Bernat, \nCesar Rodriguez‐Saona, \nM. Luz Valero, \nJoel González‐Cabrera, \nAlejandro Tena","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"5cc544aa9df530dff847a50bc0841161dde686a30f29e06a0b90e3c86319dce1","category":"Environment"}