{"title":"Enhancing Employees' Social Responsibility: The Roles of Continuous Improvement, Organization Identification, and Perceived Organization Support","link":"https://www.preprints.org/manuscript/202409.1053/v1","date":1726199477000,"content":"Social responsibility is imperative for its important function in the growth of societies and organizations. However, the research on corporate social responsibility (OSR) has predominantly focused on the actions of organizations. Not much has been discussed regarding the employee's behaviours in promoting the development of social responsibility within organizations. CI is known for its significant role in the organization's various outcomes, Although a conceptualization and some empirical support have been provided for its relationship with the behaviour of employees, However, the effect of CI on employee socially responsible behaviours has not yet been investigated. In this article, following OC and OI theories, we improve the research model which can describe mechanisms underpinning through which CI, OI and POS support actions for employees' social responsibility. Data was collected from members of service professionals in Saudi Arabia and examined using Structural Equation Modeling- Partial Least Squares. The findings indicated that CI actions and activities develop the skills that motivate employees to support social responsibility inside and outside the organization. Moreover, our research paper explained the mechanism under which CI activities reshape employees' socially responsible manners. The current study is among the first to look at how to modify the socially responsible behaviour of employees across organizations, which can be a starting point for transforming those employees into a sustainable society.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5cc68e1ebfea9ae42c610d22be826568930a3abbbe186090d366f2dedea13cf9","category":"Interdisciplinary"}