{"title":"Identification SNPs in vitellogenin gene and their association with ovarian development and growth of Macrobrachium nipponense","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16117?af=R","date":1668758400000,"content":"<h2>Abstract</h2>\n<p>In this study, the correlation analysis between gonadosomatic index and growth traits of <i>M. nipponense</i> was carried out for the first time. The results proved that short sexual maturity <i>M. nipponense</i> had a significant negatively effect on the female prawn size (<i>p</i> &lt; 0.01) but had almost no effect on the male (<i>p</i> &gt; 0.05). The full-length Vitellogenin gene of <i>M. nipponense</i> (<i>Mn-Vg</i>) were applied to detect polymorphism and the correlation between SNP and ovarian development. The total length of <i>Mn-Vg</i> was 10,038 bp, including 14 exons and 13 introns. 31 candidate SNP loci of <i>Mn-Vg</i> were identified and the genetic diversity of these loci in the <i>M. nipponense</i> population was moderate polymorphism. The correlation between <i>Mn-Vg</i> SNPs and ovarian development was further investigated. 6 SNPs were significantly correlated with female GSI. The genotype CC in C+948A, GG in G+1209A, AG in A+1879G, TT and AT in T+4458A, AT in A+7080A and AA in A+9435G are significantly associated with rapid ovary maturation. Further statistical analysis results between SNPs and female growth index showed five SNP loci were significantly associated with female growth traits. Three of them significantly associated with ovarian maturation (C+948A, T+4458A and A+9435G). By comparison, genotype TT in T+4458A was significantly positively correlated with both ovary development and growth traits. The results will provide a basis for marker-assisted breeding of <i>M. nipponense</i>, as well as sustainable development of aquaculture and large-scale breeding.</p>","author":"Sufei Jiang, \nYiwei Xiong, \nZixi Xia, \nJisheng Wang, \nWenyi Zhang, \nDan Cheng, \nYongsheng Gong, \nYan Wu, \nHui Qiao, \nHongtuo Fu","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"5ccde11c46ecebd3dc3fcb2c5fa313c0d4599a6777db2dd7d3196504a9a7a397","category":"Environment"}