{"title":"1 Use of the GreenFeed bait system to assist in measuring fecal output and digesta kinetics","link":"https://academic.oup.com/jas/article/102/Supplement_1/76/7617990?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>With increased use of automated feeders, like the bait dispenser on an automated head chamber system (AHCS; GreenFeed; C-Lock Inc., Rapid City, SD), more scientists are investigating ways to use this equipment. Scientist with the Agricultural Research Service initially conducted an experiment to determine if dosing titanium dioxide (TiO<sub>2</sub>) through an AHCS is an alternative to the traditional hand-fed dosing method for estimating fecal output (FO). The AHCS used had a 2-hopper bait dispensing system, where one hopper contained alfalfa pellets marked with 1% TiO<sub>2</sub> and the other contained alfalfa pellets. During the morning (0800), hand-fed heifers received 32 g of TiO<sub>2</sub>-marked pellets, whereas AHCS-dosed heifers also received 32 g of marked pellets during their first visit each day. A two one-sided t-test indicated the FO estimates were similar (P = 0.04), but the AHCS dosed heifers had greater (P &lt; 0.01) variability; this difference in FO variability is probably due to the increased variability in dosing time (0615 ± 6.2 h). This research has highlighted the potential for dosing cattle with a marker through the AHCS, but conventional fecal marker methods assume steady-state concentration. Our research has shown that errors associated with external marker methods are not highly associated with analytical techniques but are most influenced by dose size and sampling inaccuracy. Hence, ad libitum use of an AHCS results in non-steady-state fecal concentrations. To determine whether reliable FO estimates could be obtained under conditions of irregular but known dose times, we designed 2 experiments where the steady-state assumptions were relaxed, and fit known time measured fecal concentrations to multi-dose digesta kinetics models to estimate FO. In these experiments we used individually penned, rumen fistulated Dexter steers and limit-fed a diet of hay and protein supplement. First, after a 7-d dietary acclimation, steers were given a dose of TiO<sub>2</sub> through the rumen fistula and again on d 14, and over 120 h after each dose, 14 spaced fecal samples were collected. In Exp. 2, steers received the first of 6 daily doses, then on d 7 no dose, and on days 8 to 12 daily dosing resumed. Beginning on d 7, when dosing was skipped, fecal sampling began and over a 120-h period 14 fecal samples were collected. For Exp. 1, marker concentration data were fit to a G2 digesta kinetics model and for Exp. 2, concentration data were fit to a multi-dose G2 digesta kinetics model assuming identical digesta kinetics for each dose and the concentration over time as the sum of each pulse. Measured FO in Exp. 2 was 11% greater than the estimates obtained from fitting measured concentrations to multi-dose digesta kinetics models.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5cd4554ebd5f1d0b6134a6c180c8468eb476ae69df508e34e0d26fa36a9df6e0","category":"Environment"}