{"title":"iMessage will reportedly dodge EU regulations, won’t have to open up","link":"https://arstechnica.com/?p=1989111","date":1701895678000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/imessage-800x450.jpg\" alt=\"iMessage will reportedly dodge EU regulations, won’t have to open up\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/imessage.jpg\">Enlarge</a> (credit: Jakub Porzycki/NurPhoto via Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Android users' hopes that Apple's iMessage would be forced to open up in the European Union have been dashed. <a href=\"https://www.bloomberg.com/news/articles/2023-12-06/apple-imessage-set-to-avoid-eu-s-digital-dominance-crackdown?srnd=technology-vp\">Bloomberg reports</a> that iMessage won't qualify for the EU's new \"Digital Markets Act,\" allowing Apple to keep iMessage exclusive to Apple users.</p>\n<p>The EU is deciding what should and shouldn't be under the new rules set out by the \"Digital Markets Act.\" The idea is that Big Tech \"gatekeepers\" will be subject to certain <a href=\"https://commission.europa.eu/strategy-and-policy/priorities-2019-2024/europe-fit-digital-age/digital-markets-act-ensuring-fair-and-open-digital-markets_en\">interoperability, fairness, and privacy</a> rules. So far the wide-ranging rules have targeted 22 different services, including app stores on iOS and Android, browsers like Chrome and Safari, the Android, iOS, and Windows OSes, ad platforms from Google, Amazon, and Meta, video sites YouTube and TikTok, and instant messaging apps like WhatsApp and Facebook Messenger.</p>\n<p>Google recently <a href=\"https://arstechnica.com/gadgets/2023/11/google-argues-imessage-should-be-regulated-by-the-eus-digital-markets-act/\">rolled out a campaign</a> to implore the EU to qualify iMessage for regulation, as Android's iMessage incompatibility is a big deal in the US. iMessage hasn't made the list, though, and that's despite meeting the popularity metrics of 45 million monthly active EU users. In the EU and most other parts of the world, the dominant messaging platform is WhatsApp, and with the Digital Market Act's focus on business usage, not general consumers, iMessage will just squeak by. Right now the EU is \"investigating\" a handful of borderline additions to the Digital Markets Act, with a deadline in February 2024.</p></div><p><a href=\"https://arstechnica.com/?p=1989111#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1989111&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5ce6007aa0ea2fe4f0368789e1be91277a729cff960cb4dc452d481c15bb0291","category":"Tech"}