{"title":"Research on convective cooling and thermal protection characteristics of integrated dual-sided deflector system","link":"https://www.preprints.org/manuscript/202404.1760/v1","date":1714128479000,"content":"Based on the goals of \"high reliability, high frequency, rapid launch, and low cost\" for space launch site, and drawing inspiration from the design principles of SpaceX's Starship launch test facility, an integrated dual-sided deflector system for convective cooling and thermal protection is presented. The interaction process between the gas jet and liquid water jet and its effect on the flow field environment are thoroughly studied using numerical calculation methods. Furthermore, Regarding the phase-change heat transfer issue in a compressible gas-liquid two-phase flow and the varying distribution of different bubble shapes and sizes at the gas-liquid interface, a modified Lee model is derived. The rationality and accuracy of the phase-change mass-transfer coefficient values can be improved by adjusting the equivalent diameter and shape factor of the bubbles. The research results demonstrate that compared to the classical Lee model, the modified Lee model can achieve a higher numerical accuracy in predicting the heat and mass transfer processes in gas-liquid two-phase flows. Through comparative analysis with traditional dual-sided deflector and conventional cooling system, the integrated dual-sided deflector system for convective cooling and thermal protection exhibits significant performance advantages in gas flow regulation, flow field environment improvement and erosion protection in the near-ground region of the launch site. Particularly, regarding the thermal environment of the dual-sided deflector, it not only achieves effective flow deflection, but also mitigates the degree of erosion caused by the gas jet on the deflector. This conclusion can provide theoretical references for the thermal protection design of commercial launch vehicle system at space launch site.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5cf3cc142610469e466669a369d378545ab52661e04cc8575449f569f0391a1c","category":"Interdisciplinary"}