{"title":"How To Get Web Design Clients Fast (Part 2)","link":"https://smashingmagazine.com/2021/04/web-design-clients-fast-part2/","date":1618484400000,"content":"<p>In <a href=\"https://www.smashingmagazine.com/2021/03/web-design-clients-fast-part1/\">part 1</a>, we explained how to use a monthly recurring revenue (MRR) model to grow your web design business. In this second part, we’ll explain how to use proven sales techniques to keep scaling your business profitably.</p>\n<p>If you’re an agency owner, you know that you need customers to grow. No matter how big your dreams are, customers are the lifeblood of your business. But you’re probably wondering — how do you attract quality, high-paying clients?</p>\n<p>We started our design agency from zero. Two and a half years later, that same business generated $50,000 USD in monthly revenue, and today, it’s many times that size and still growing — all thanks to the <strong>sales techniques</strong> you’re about to read.</p>\n<p>The secret to any successful company is sales, and that applies to design businesses too. Some people are worried about their lack of experience, especially since real-world sales techniques aren’t taught in school. But don’t worry. Sales savvy is like anything else — a skill that you can learn. If you’re ready to learn how to get web design clients fast, keep reading.</p>\n<h3>How To Set (and Reach) Ambitious Sales Goals</h3>\n<p>To set a sales objective, choose a target monthly recurring revenue number and deadline. You can base this on your ideal income or what you currently make with one-off clients. For example, your goal could be earning $7,000 USD per month within 24 months after you kick-off. Then divide that figure by your average price. So if you charge $100 per month, you’ll need 70 customers.</p>\n<p>When you start, you’ll probably convert about 2–3% of your leads, so you’ll need to contact 33 people for each new customer. So a goal of 70 customers for $7,000 USD per month means reaching 2,300–4,600 leads. (This number may be higher or lower depending on your <strong>sales skills and lead quality</strong>.)</p>\n<p>Thousands of leads probably sounds like a lot! But it’s manageable if you break it down. Each month, you’ll need to contact about 100–200 leads. If you work Monday–Friday, that’s just 5–10 leads a day. Stick with that goal and have an accountability system to track how well you’re doing.</p>\n<p>Focus on hitting those lead goals every day or week, even if you don’t see immediate results. Sometimes you’ll close a prospect the same day, but it will more likely take a few days or even weeks of follow-up, explanations, and demos before you finally win them over.</p>\n<p>If you don’t work consistently on your goals, it will be frustrating down the line. If you pitch 40 prospects the first week, then 5 the next week, then 15, then 40 again, you’ll have a patchy funnel and inconsistent growth. Put in <strong>consistent work</strong>, and you’ll see continual progress that will snowball over time.</p>\n<p>Once you have your goal set, where should you look for those MRR clients? Here are the best strategies we’ve learned.</p>\n<h3>Nine Places To Find Web Design Clients</h3>\n<p>When you’re just starting, you should try different methods to get clients. As you gain more experience, you’ll learn where to focus your efforts, and you’ll get better at converting those clients. Cold pitching a potential client might work best for you, while digital marketing does well for someone else.</p>\n<h4>1. Use Personal Connections</h4>\n<p>Chances are, you already know someone who could become a new web design client—or you know someone who knows someone. Share what you’re doing with friends, family, neighbors, and especially any local business owners you know.</p>\n<p>You never know which referral might get you another client.</p>\n<h4>2. Sell With Your Website</h4>\n<p>Do you want a salesperson that is always working, never gets tired, and can sell to thousands of clients at once? Then you’ll want to make sure your current website is at its very best. If you’re using a basic theme, switch to a modern custom design. Web design clients will judge your design skills by the quality of your own site, so make sure it’s always looking good. </p>\n<p>For our agency, we’re continually improving our website to keep it up-to-date and modern. We also include a portfolio of sites we’ve designed so that prospects can see the kind of quality we offer.</p>\n<h4>3. Ask For Referrals</h4>\n<p>You’ve worked insanely hard to get the customers you have. Why not leverage your trust with them for even more profit and sales? Ask a happy client to tell their hairdresser, favorite restaurant, plumber, dentist, lawyer, and other local businesses. Then check up on those leads and convince them to hire you as a web designer.</p>\n<p>Remember, referring a friend is the best way past clients can thank you. To <strong>get referrals</strong>, you’ll need to ask! As a bonus, thank your customers or friends for a referral. A surprise gift for a referral goes a long way.</p>\n<p>Some referral gifts we recommend are:</p>\n<ul>\n<li>10% off your next site update,</li>\n<li>Free website health check,</li>\n<li>One month free of charge,</li>\n<li>$100 Amazon voucher.</li>\n</ul>\n<h4>4. Partner With Other Businesses</h4>\n<p>Another strategy to grow your client list is to partner with related businesses, like SEO firms or ad agencies. When you can find a great company in a related but non-competitive niche, reach out and form a partnership. You <strong>recommend clients</strong> to them, and they’ll recommend clients to you.</p>\n<p>Everyone wins. Your customers get helpful services, and both of you will benefit from the referrals you share.</p>\n<h4>5. Use Content Marketing</h4>\n<p>You can also use inbound marketing to attract customers to you with content instead of going to them. Blogging on your own site gives you credibility, especially if you focus on writing about solutions for the biggest problems your clients have. New customers already see you as the expert because they’ve read a blog post. Write articles that cover the basic principles of building an <strong>online presence</strong> and growing a customer base.</p>\n<p>The second strategy is guest posting. For example, you can write about best practices for a restaurant website and post them on a blog where restaurant owners get the latest news for their business. Educational content establishes you as an authority and opens you up to <strong>a new audience</strong> eager to learn about their industry. Writing for other sites has helped us a lot — you’re reading one of those articles now!</p>\n<p><strong>Note</strong>: <em>We go into more detail on using content marketing in our <a href=\"https://www.sitejet.io/en/10-ways-to-get-more-web-design-clients-fast\">free guide to finding web design clients</a>.</em></p>\n<h4>6. Post On Social Media</h4>\n<p>We’ve seen success promoting our content on social media. The two that have worked the best for us have been Facebook and LinkedIn, but feel free to experiment with others. Various industries will have a preferred social media platform, so learn about this for your niche and target accordingly.</p>\n<p>Organic social media works best as a part of your strategy alongside other methods. It might not bring in leads itself, but a strong social media presence helps convert <strong>potential clients</strong> who need a good reason to choose you. If you’re doing well on social networks, it can help with that decision-making process and close the deal.</p>\n<p>The most important content you can share solves your customer’s problems. And it isn’t just about selling — think of how to teach your customers to take advantage of new digital technologies. For example, you can teach restaurants how to set up a QR code for a digital menu. In addition to helpful content, we recommend sharing sites you’ve designed and using hashtags your target customer will recognize. But make sure to keep your feed professional — don’t post pictures of what you ate for breakfast!</p>\n<h4>7. Test Paid Ads</h4>\n<p>The reality is that you won’t keep growing with free methods after a certain point. That’s why we recommend using paid ads as you grow. We’ve used various platforms, from Google Ads to job boards. We’ve also seen a lot of success in offering an email newsletter with multiple opt-ins.</p>\n<p>You can also try Facebook Ads and a more complex sales funnel system, complete with a landing page to collect web design leads. Paid ads have brought in lots of new customers for us.</p>\n<h4>8. Build A Network</h4>\n<p>An effective way of getting new clients is by building your professional network. First, connect with other founders in person. If you’re not already involved in your local community of business leaders, start as soon as possible. You’ll get <strong>valuable advice</strong> and business contacts that can lead to more sales in the future.</p>\n<p>One of the best places to do this is networking events, like local community business leader meetups. You’ll meet lots of potential clients and get leads for many more. Don’t pitch these contacts, just build relationships. Care about their business and learn what they’re looking for. When they need a website, they’ll know who to turn to.</p>\n<p>As the world has gone remote, look for virtual events as well. Check out local business leader Facebook groups, digital summits, and other opportunities to connect remotely.</p>\n<h4>9. Do Cold Outreach</h4>\n<p>Last but not least is cold outreach. You’ll need to research a target audience, find a potential client, and reach out with a phone call introducing yourself. Cold outreach has been the main way we’ve built our agency. It’s a lot of hard work, but the results speak for themselves!</p>\n<p>The best way to make a sale is by positioning a business website as the solution to a challenge your prospect faces, like restaurants wanting new customers or losing foot traffic to national chain competitors.</p>\n<p>We’ll go into cold outreach more in the next section, but these three principles are a great starting point:</p>\n<ul>\n<li><strong>Build rapport with your prospect.</strong><br />Know their name and understand their business, and always look for a personal connection. Honestly care about their success.</li>\n<li><strong>Be an expert.</strong><br />Asking insightful questions is a great way to be knowledgeable without showing off. Help your prospect consider new opportunities in their business they wouldn’t have thought of if it wasn’t for you.</li>\n<li><strong>Get a commitment.</strong><br />Before you hang up the phone, try your best to get the prospect to close or else agree to talk later.</li>\n</ul>\n<p>With these points in mind, you can use the following script to make the sale.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/aa497f97-9ec1-4a47-892f-aceaee174433/1-web-design-clients-fast.jpg\" /></p>\n<h3>Our Most Effective Sales Strategy</h3>\n<p>We’ll walk through the template we’ve used to convert hundreds of cold leads into happy customers. This successful sales technique boils down to five key steps.</p>\n<h4>Step 1: Build Rapport And Understanding</h4>\n<p>Before you jump into a sales pitch, show you care about the business owner and want them to succeed. Start by introducing yourself with your name. Make sure you’re talking to the owner or decision-maker before moving on.</p>\n<p>Next, draw a connection to their business—the more personal, the better. Maybe you ate at the client’s restaurant recently, saw one of their delivery vans, or found them on the internet (this neutral intro always works if you don’t have anything specific to point out).</p>\n<p>Here’s a version of the script we might use:</p>\n<blockquote><p>Hi, it’s Dave Smith speaking!<br /><br />Am I speaking to Lisa Samuelson? Great!<br /><br />Some friends had dinner at Lisa’s Diner a few weeks ago and gave you very high praise.</p></blockquote>\n\n<h4>Step 2: Create Demand By Showing How You Can Help</h4>\n<p>Your goal here is to offer a way to bring in new paying customers without extra work. Who wouldn’t take you up on that deal? Most of the time, business owners don’t want a website—they want the results a website will bring, like better visibility, high search rankings, more customers, more job applicants, and so on.</p>\n<p>You can develop your versions of the following and include a relevant case study from a previous client. For example, a painter specializing in complete house exteriors might tire of requests for small interior jobs. A specialized website can filter their prospects and bring them better business.</p>\n<p>Here’s a basic script our team has developed:</p>\n<blockquote><p>Well, Lisa, I run a firm here in CITY that helps business owners become more successful in the digital world with high-quality, full-service websites.<br /><br />We realized most business owners don’t have the time or tech skills to build and maintain their own website. As a result, they have an outdated site or no site and lose potential customers every day.<br /><br />We believe business owners should focus on their business. We handle every part of your site, from updates to domain, hosting, email, and even search engine optimization if you want.</p></blockquote>\n\n<h4>Step 3: Show Why You’re The Best Option</h4>\n<p>Up next, you’ll need to show why the prospect must choose you. Cover the advantages of the recurring revenue model here and explain your fees. Explain that you deliver top-quality modern websites combined with outstanding service, all at affordable prices.</p>\n<p>Here are the best talking points you can use:</p>\n<blockquote><p>We run a technology that allows us to deliver top-quality modern websites combined with outstanding service, all at affordable prices.<br /><br />Unlike traditional agencies or web designers, you don’t pay us thousands upfront, only to get a website to maintain on your own that will be technically outdated in two years.<br /><br />For a one-time setup fee of $499 USD and a monthly charge of just $99 USD, we’ll create a professional site, update the content, do technical maintenance, keep your domain name current, host the site, and keep your email accounts running.<br /><br />We have a 20% discount on the monthly fee when billed annually.</p></blockquote>\n\n<h4>Step 4: Tailor Your Pitch To Their Business</h4>\n<p>The next step is to understand their business and show you care about it. The more you find out about the client’s business and problems, the better you’ll be able to tailor your sales pitch!</p>\n<p>Here are the best types of questions to use and how to show how a website will help:</p>\n<ul>\n<li><strong>What is the greatest challenge in your industry/for your business?</strong><br />However they respond, explain how a website will help! You can help them find employees, acquire customers, and stand apart from the competition.</li>\n<li><strong>Who is currently responsible for your website/web presence?</strong><br />Most of the time, it’s not in the hands of a professional. Ask questions to show why this is a problem, like asking what their backup plan is in case of a server crash or how they’re keeping the site updated for more recent devices, standards, and best practices. Explain how your team has experience handling website problems and will always treat them like professionals.</li>\n<li><strong>Do you know how many visits your current website has?</strong><br />If they do, show what you can do to increase this. If not, explain how your site will provide them with valuable data to find more customers and grow their business.</li>\n<li><strong>Do you know what percentage of customers in your industry are on mobile devices?</strong><br />Find out this number in advance. If the prospect’s website isn’t mobile responsive, point out that they’re missing out on a considerable number of customers.</li>\n</ul>\n<p>Gathering data upfront from your customer and asking the right questions will show that you are a pro. You’ll demonstrate that you really care and thus build trust.</p>\n<h4>Step 5: Close The Sale</h4>\n<p>The most important part of the sales process is closing. Move the prospect to make a firm commitment to start working with you. If they aren’t ready to start immediately, offer a smaller next step, like scheduling a later meeting or sharing testimonials. Always make sure a decision-maker is participating in the next meeting!</p>\n<p>Up next, we’ll look at some closing strategies that can help you seal the deal with clients.</p>\n<h3>Proven Closing Strategies To Finalize The Sale</h3>\n<p>When you reach the end of a call with a potential client, your job is simple—get them to pay for your web design services. But while the idea is simple, getting a prospect to sign up can be very difficult in practice. To help, here are some techniques we’ve used to close more deals faster.</p>\n<h4>Share References And Portfolio Pieces</h4>\n<p>One of the best ways to convince a prospect is by showing them a previous site you’ve designed for a similar client or letting them talk to a current client of yours. Keep portfolio sites for the various verticals you target, like salons, restaurants, dentist offices, and the like. With permission, you can also share the contact information of a current happy customer.</p>\n<h4>Design First, Charge Later</h4>\n<p>One technique that worked well for us at the beginning was doing web design first, then charging later. Charging later works best if you don’t have an extensive portfolio or are branching into a new web design niche without relevant work samples. (For example, if you have a dozen restaurant websites but want to land a new hairdresser client.)</p>\n<p>To use this strategy, you’ll first design a draft of the new website. Then if the client likes it, they’ll pay the upfront design fee and move forward. This strategy involves more work for you upfront, but it proves to the client that you can build great sites and understand their business. And if they don’t like the website? Not to worry—you’ve created a portfolio piece you can use for another customer down the road.</p>\n<h4>Waive The Setup Fee</h4>\n<p>Another strategy you can use is waiving the setup fee. This fee can be a significant barrier for many new clients since they have to pay $500 USD (or whatever your setup fee is) before seeing results. Instead, just charge your monthly recurring payment. You’ll make less money in the short term, but you’ll be more likely to win over an ideal client to stay with you for a while.</p>\n<p>If you don’t want to design a site for free like the previous suggestion, this is a great middle option that gives the client a great site with less risk but still lets you get paid for your work.</p>\n<h4>Show Your Process</h4>\n<p>You can also build trust by showing your web design process, from draft to design to publication. Doing this as the final stage before you ask for a sale can help create confidence in the prospect’s mind about what you have to offer. People don’t trust what they don’t understand, so show the steps and build trust.</p>\n<h4>Automatic Payments</h4>\n<p>This tip applies once you close a sale and want to make sure you still get paid every month: use automatic billing. If you have to ask for payment every month, it’s a constant reminder of what they’re paying. But if you have a credit card on file or use a payment processor that charges your clients automatically each month, you can count on steady, regular cashflow.</p>\n<p>It’s also a timesaver for everyone—your client doesn’t have to spend time paying yet another bill, and you can rest easy knowing you don’t have to follow up for a missed payment.</p>\n<h4>Teach And Build A Relationship</h4>\n<p>If all else fails and the perfect prospect doesn’t want to sign up at the last minute, never burn the bridge. Don’t let the rejection get to you, and remember you’re a website expert, but also friendly and accessible and willing to help your clients understand what’s going on.</p>\n<p>Take the chance to explain what a client might want to look for if they decide to launch a website later. Explain what features are most important based on your knowledge. If a client doesn’t want a website now, there still may be opportunities in the future. Build trust, strengthen the relationship, and play the long game.</p>\n<h3>Now It’s Your Turn To Find Web Design Clients</h3>\n<p>Over the last few years, we’ve been privileged to work with so many incredible clients—all following the ideas and suggestions outlined above. The real secret was, of course, putting in hard work and focusing on growth goals. The sales techniques mentioned above helped us then convert those prospects into paying customers.</p>\n<p>We also used internal software that we recently released <a href=\"https://www.sitejet.io/en?utm_source=smashing&amp;utm_medium=referral&amp;utm_campaign=article-part2\">Sitejet</a> to speed up the process and become more profitable. We designed Sitejet to help agencies grow with MRR clients by cutting site creation time by as much as 70% and streamlining client interactions. It’s created to help designers grow their business and give back time for what you love: being creative.</p>\n<p>Anyone can successfully grow their design agency. As we explained in the <a href=\"https://www.smashingmagazine.com/2021/03/web-design-clients-fast-part1/\">first part</a> of this series, starting takes motivation and an effective pricing model and mindset. And as we shared in this second part, growth comes once you combine proven techniques with lots of hard work! Good luck—and we can’t wait to hear your stories in the comments to this article!</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"5cfbd78a3d7162ac628f2624a22fa19f90d797f086d7ec0afc7cfcdc3a50cb5d","category":"Tech"}