{"title":"Niantic's 'Harry Potter: Wizards Unite' Augmented Reality Game Shutting Down","link":"https://www.macrumors.com/2021/11/02/niantic-harry-potter-ar-game-shutting-down/","date":1635890680000,"content":"Niantic has experienced major success with augmented reality game Pokémon Go, a title that still has a loyal fanbase, but unfortunately, its Harry Potter-themed game has not fared as well. Harry Potter: Wizards Unite is <a href=\"https://www.harrypotterwizardsunite.com/en/\">going to be shut down</a> on January 31, 2022 as a result.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/wizards-unite-harry-potter.jpg\" />\r\n<br />\r\nFirst introduced <a href=\"https://www.macrumors.com/2019/06/20/harry-potter-wizards-unite-launches/\">in June 2019</a>, Harry Potter: Wizards Unite allows players to join the Statute of Secrecy Task Force to explore Wizarding World locations in the real world, similar to Pokémon Go.\r\n<br />\r\n\r\n<br />\r\nPlayers need to go to landmark locations in the real world to track down magical artifacts, creatures, and enemies to battle and level up. The game uses augmented reality to project portals and other items onto real-life landscapes, and there are real-time cooperative elements involved.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2019/06/harry-potter-wizards-unite.jpg\" />\r\n<br />\r\nThe game will be removed from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> on December 6, 2021, which is also when in-game purchases will be disabled. As a last hurrah, starting on November 2, several changes will be implemented to make gameplay more fun.\r\n<br />\r\n\r\n<br />\r\nDaily assignments will provide increased rewards, potion brewing time will be cut in half, the daily cap on sending and opening gifts will be removed, and various items and ingredients will appear on the map more frequently.\r\n<br />\r\n\r\n<br />\r\nNovember and December will also see the launch of several events involving Dolores Umbridge, Lucius Malfoy, Bellatrix LeStrange, and Voldemort, along with a holiday event. The game will wrap up, with the Calamity coming to an end before the app is shut down for good.\r\n<br />\r\n\r\n<br />\r\nPlayers who invested money in the game will not be able to get a refund, but they will be able to spend their remaining balances and use their items before the January end date.<br />This article, \"<a href=\"https://www.macrumors.com/2021/11/02/niantic-harry-potter-ar-game-shutting-down/\">Niantic's 'Harry Potter: Wizards Unite' Augmented Reality Game Shutting Down</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/niantics-harry-potter-wizards-unite-augmented-reality-game-shutting-down.2321480/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=055KI9h1bEs:SaWaOIX7UU8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=055KI9h1bEs:SaWaOIX7UU8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/055KI9h1bEs\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5d031df95ac844238187bdae86ad526d218ff1e51331a99c29a1d47e41e3af42","category":"Apple"}