{"title":"Zipp’s new 404 is slightly less aero but faster and cheaper than before","link":"https://www.bikeradar.com/news/zipp-404-wheel-range/","date":1624370438000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Zipps-new-404-range-11-2d130c3.jpg?quality=90&amp;resize=620,413\" />                                            <p>Hot on the heels of its revamped 303 line with the more budget-friendly <a href=\"https://www.bikeradar.com/news/zipp-303-s/\" target=\"_blank\">303 S wheelset</a>, all-rounder <a href=\"https://www.bikeradar.com/news/zipp-303-firecrest-disc-2021/\" target=\"_blank\">303 Firecrest aero wheelset</a> and new pro-level premium <a href=\"https://www.bikeradar.com/news/zipp-353-nsw/\" target=\"_blank\">353 NSW</a>, Zipp has now brought the same technology to the 404 series – a wheelset aimed firmly at fast road riding and racers alike.</p>\n<p>Zipp has also added an updated pure aero option to the range too, the 858 NSW Tubeless disc wheelset, but we have to admit to being slightly disappointed that it hasn’t released a price-busting 404 S, but we guess you can’t have everything.</p>\n<p>As well as being lighter and stronger, Zipp’s new hookless shape is claimed to be cleaner and greener with less waste of expensive carbon fibre. That has meant savings in production and, unusually for 2021, a reduction in price.</p>\n<p>The new 404 Firecrest retails at £1,600 a pair – <a href=\"https://www.bikeradar.com/reviews/components/wheels/wheel-sets/zipp-404-firecrest-carbon-clincher-review/\" target=\"_blank\">previously they were £2,400</a> – a not inconsiderable £800 saving. The new 454 NSW is a much pricier affair at £3,200, but even that is a £190 saving over the previous generation <a href=\"https://www.bikeradar.com/reviews/components/wheels/wheel-sets/zipp-454-nsw-carbon-clincher-disc-brake-review/\" target=\"_blank\">454 NSW</a>.</p>\n<section><div>\n        <h2>What you should know about the new 404 series</h2>\n<ul><li>It has the same <a href=\"https://www.bikeradar.com/features/hookless-rims-road-tubeless/\">hookless rim</a> technology as the 303 series</li>\n<li>The 23mm internal rim width is optimised for 25mm tyres</li>\n<li>The premium 454 NSW wheelset features the ultra-low friction Cognition V2 freehub</li>\n<li>The 454s come in both tubeless and tubular versions</li>\n<li>The 404/454/858 are all now disc-only wheelsets</li>\n<li>The new 454 NSW is a 1lb (454g) lighter than the previous model</li>\n<li>The new 404 Firecrest is £800 cheaper than the previous model</li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Wind tunnel vs real world</h2>\n<p>The 454 NSW (NSW stands for Nest speed works, Zipp’s advanced engineering department) sees the latest interpretation of Zipp’s biomimicry-derived Sawtooth rim profile.</p>\n<p>Zipp says its engineers looked for instances of how nature achieved speed, control and efficiency, and found the humpback whale’s fast and graceful movements were thanks to the tubercles on its pectoral fins (nice to think Zipp’s engineers were fans of David Attenborough’s <em>Blue Planet</em>).</p>\n<p>These structures inspired Zipp’s engineers to, for the first time, systematically apply biomimicry to solve the complex challenge of designing a wheel, with the undulating Hyperfoil nodes that reduce both aerodynamic drag and side force.</p>\n<p>The waved shape blends a minimum height of 53mm and a maximum of 58mm, creating a rim that’s claimed to have the aero benefits of a deep 58mm wheel with fewer drawbacks when it comes to side wind stability.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Sawtooth profile of the 454 certainly looks different on the bike.</span></figcaption><span> <i>Zipp</i></span></div>\n<p>In the past, aerodynamics have been the sole concern for Zipp, however this new generation of wheels sees a new approach.</p>\n<p>Zipp’s development still involves a lot of wind tunnel time, but the testing for this new range was far more focused on real-world conditions. That meant a partnership with aero-testing pioneers Aerolab, using its real-world recording kit to validate Zipp’s design direction.</p>\n<p>Zipp’s engineers tell us that years of working in wind tunnels helped them to understand what makes a rider go fast, but that real-world testing showed where this can create losses elsewhere – with the strange phenomenon of how a very aero wheel can make a rider slower.</p>\n<h3>Total System Efficiency</h3>\n<p>Zipp’s calls its new approach TSE – Total System Efficiency – with the end goal being speed. The barriers to speed were defined as wind resistance, gravity, rolling resistance and vibration losses.</p>\n<p>Comparing the new 404 against the previous model, Zipp found the older model with its narrower rim shape to be aerodynamically superior, with the new rim design having 0.9W more drag (the old 404 has less frontal area).</p>\n<p>But, when you factor in gravity, the new 404 is 350g lighter, slightly reducing total system weight. Zipp also states that ride quality improvements from the new rim construction and laminate of the carbon means better vibration absorption, and it claims rolling resistance has been brought down too thanks to an improved tyre profile on the new rims.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Zipps-new-404-range-01-af4b660.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Zipp’s new 404 Firecrest is now a disc-only wheelset.</span>\n    </figcaption><span>\n                    <i>Warren Rossiter / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Zipps-new-404-range-02-c2f7d89.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Zipp’s new 58mm deep 404 uses the same construction method as the excellent 303 Firecrest.</span>\n    </figcaption><span>\n                    <i>Warren Rossiter / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Zipps-new-404-range-03-1a0b89d.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The 404s are available with a 12-speed compatible XDR freehub or a SRAM/Shimano 10-/11-speed compatible option.</span>\n    </figcaption><span>\n                    <i>Warren Rossiter / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Zipps-new-404-range-04-be63d54.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Zipp claims the dimpled surface of the 404 Firecrest makes a big difference when it comes to aero performance and stability.</span>\n    </figcaption><span>\n                    <i>Warren Rossiter / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Zipps-new-404-range-05-018d938.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The new hookless rim design is lighter, stronger and greener to produce.</span>\n    </figcaption><span>\n                    <i>Warren Rossiter / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nZipp’s real-world testing was with a rider/system total weight of 85kg and Zipp’s RT25 tyres inflated to the recommended pressures of 77psi front/82psi rear on the old 404 and 454 wheels and a lower 65psi front/69psi rear on the new wider design.\n<p>On the old design, Zipp says riding at 40kph would require 290 watts on the 404 and 288 watts on the 454. With the new wheelsets, that was 286 watts on the 404 and 278 watts on the 454, making for a saving of 4 watts for the 404 and 10 watts for the 454.</p>\n<p>Zipp recommends tyre pressures be defined by wheel choice, tyre choice, rider weight and total system weight. The brand’s own <a href=\"https://axs.sram.com/guides/tire/pressure\" target=\"_blank\">tyre pressure calculator</a> gives youo a handy starting point for working out your optimal pressures front and rear.</p>\n<p>Zipp also claims that because of the new 404 range’s wider and hookless rim the interface between tyre and rim has a much smoother transition, the rim to tyre interface creates a rim/tyre shape that is better than before, mitigating the losses of the wider rim shape.</p>\n<p>It’s perhaps no small coincidence that the 454 NSW (along with the updated 858) launches on the week of the <a href=\"https://www.bikeradar.com/official-tour-de-france-guide-2021/\">Tour de France</a> Grand Depart, with a tubular version alongside the hookless tubeless model. The Tubular model weighs a claimed 1,463g (683g front, 780g rear), which is actually 105g heavier for the pair than the hookless tubeless model.</p>\n<h2>Under pressure</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Zipps-new-404-range-09-fbc8843.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The 404 rim has a 23mm internal width, which Zipp say is optimal for 25mm wide tyres.</span>\n    </figcaption><span>\n                    <i>Warren Rossiter / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Zipps-new-404-range-08-38b992c.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>A Pirelli P-Zero TLR 28mm tyre comes up at 28.3mm on the 404s (at 65psi).</span>\n    </figcaption><span>\n                    <i>Warren Rossiter / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Zipps-new-404-range-07-9046c79.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Our rear wheel complete with tubeless tape, valve and disc lockring tipped the scales at 824g (XDR freehub).</span>\n    </figcaption><span>\n                    <i>Warren Rossiter / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Zipps-new-404-range-06-bf5026f.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Our front wheel complete with tubeless tape, valve and disc lockring tipped the scales at 703g.</span>\n    </figcaption><span>\n                    <i>Warren Rossiter / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nWe asked Zipp why it is now putting so much emphasis on tyre pressures for its wheels and it said that tyre pressures for the road have been overlooked and ignored for far too long.\n<p>Aside from grip and rolling you down the road, a tyre provides suspension for the rider. No mountain biker worth their salt would neglect setting up the suspension on their bike for their weight and, with the advent of tubeless tech and the advantages that it brings, neither should roadies.</p>\n<p>As a key element to ride experience, especially comfort and speed, we should pay more attention to our pressures.</p>\n<p>Zipp claims tyre pressure is very important and recommends the best tyre size for its 404 series: if you’re a 90kg+ rider (and that includes me) it recommends moving up to a 28mm tyre, whereas sub-90kg riders should look to a 25mm.</p>\n<h2>Zipp 858 NSW</h2>\n<p>Zipp’s much more wind-resistance biased 808 series has got a new premium model, the 858 NSW.</p>\n<p>This super-deep aero wheel shares the same humpback whale inspired Sawtooth rim design as the 454. In fact, the 858 NSW rim shape came much later than the original 454, so the new 2021 model keeps the same rim shape as the previous generation: an 18mm internal and hooked rim design. The key difference is the new Cognition hub.</p>\n<p>Like the 454 NSW, the 858s feature Zipp’s directly printed graphics (called impress), so they should stay looking good for a long time with no stickers to peel or fade.</p>\n<p>The rear Cognition DB V2 hub with Axial Clutch V2 technology reduces drag by magnetically disengaging the ratchet mechanism when coasting. The Axial Clutch V2’s wave spring acts to reengage the ratchet mechanism quickly and consistently once the rider starts pedalling. It’s also lighter than the previous generation, and Zipp claims it’s more durable too.</p>\n<h2>Test set</h2>\n<p>We’ve got the new 404 Firecrests in for test and the 454s on the way. Our test pair weighs in at 703g front and 824g rear including tubeless tape, rotor lockrings and tubeless valves.</p>\n<h2>Weights and measures (and prices too)</h2>\n<p>The new 404 will likely be the most popular choice in the new range, but the 454 NSW’s impressive stats may tempt plenty and the aero obsessed may find the 858s hard to resist.</p>\n<h3>454 NSW Tubeless DB stats</h3>\n<ul><li><strong>Front:</strong> £1,425 / $1,800 / €1,600</li>\n<li><strong>Rear:</strong> £1,775 / $2,220 / €2,000</li>\n<li><strong>Wheelset:</strong> 1,358g</li>\n<li><strong>Front:</strong> 631g</li>\n<li><strong>Rear:</strong> 727g</li>\n<li><strong>Warranty</strong>: Lifetime</li>\n</ul><h3>454 NSW Tubular DB stats</h3>\n<ul><li><strong>Front:</strong> £1,425 / $1,800 / €1,600</li>\n<li><strong>Rear:</strong> £1,775 / $2,200 / €2,000</li>\n<li><strong>Wheelset:</strong> 1,463g</li>\n<li><strong>Front:</strong> 631g</li>\n<li><strong>Rear:</strong> 727g</li>\n<li><strong>Warranty: </strong>Lifetime</li>\n</ul><h3>404 Firecrest Tubeless DB</h3>\n<ul><li><strong>Front:</strong> £780 / $925 / €875</li>\n<li><strong>Rear:</strong> £820 / $975 / €925</li>\n<li><strong>Wheelset:</strong> 1,450g</li>\n<li><strong>Front:</strong> 660g</li>\n<li><strong>Rear:</strong> 790g</li>\n<li><strong>Warranty: </strong>Lifetime</li>\n</ul><h3>858 NSW Tubeless DB</h3>\n<ul><li><strong>Front:</strong> £1,786 / $2,000 / €2,000</li>\n<li><strong>Rear:</strong> £2,144 / $2,400 / €2,400</li>\n<li><strong>Wheelset:</strong> 1,773g</li>\n<li><strong>Front:</strong> 838g</li>\n<li><strong>Rear:</strong> 935g</li>\n<li><strong>Warranty: </strong>Lifetime</li>\n</ul><p>Zipp’s new lifetime warranty, for all wheels and components bearing the new Zipp logo, covers against impact damage under normal use – so you wouldn’t be covered using an 858 for an enduro downhill section, but any normal road racing or similar is fine – with a full replacement policy.</p>","author":"Warren Rossiter","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"5d0d1592342080a6127be5af29d78aaa215bf54f08bf48ed8b3cba098c65b397","category":"Cycling"}