{"title":"Developing a habitat suitability index with field data and hydraulic models","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4345?af=R","date":1721114370000,"content":"<h2>Abstract</h2>\n<p>Linking habitat availability with hydraulic models integrates river engineering in the ecological field. Field observation for species presence and physical habitat availability mapping is inherently limited due to time and access constraints for field data collection. This study leverages hydraulic modeling to supplement larval fish population monitoring data, effectively expanding mapped physical habitat and allowing for monitoring bias analysis. The inundation extents and character of streamflow from hydraulic modeling were used to refine habitat suitability indices relative to total habitat availability from discrete fish monitoring events. Given the flexibility in hydraulic modeling to simulate a range of flows, the habitat suitability index is then translated to an effective habitat curve according to areal inundation and hydrologic frequency. With this framework, forecasting the impacts of long-term trends, such as geomorphic or hydrologic change, can be reasonably and quantitatively assessed. This manuscript uses a case study of Rio Grande silvery minnow monitoring at restoration sites where the floodplain has been lowered via earthwork. Comparisons are made for habitat suitability indices developed from field observation data alone and field observation supplemented by hydraulic modeling. Known biases of field sampling data (targeting slow, shallow areas where fish are most often found) were confirmed based on simulated hydraulic conditions across entire restoration sites. In the case of Rio Grande silvery minnow, a heavily studied species, such field monitoring biases are an effective use of resources. However, this framework may be helpful for assessing alternative management approaches and monitoring strategies of species that are less studied.</p>","author":"Aubrey Harris, \nAnjali Mulchandani, \nMark Stone","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"5d128d5042d1392370d2ebb19707748a517c71ec36e7c6777d6b436b0d206d19","category":"Environment"}