{"title":"Sunday บริษัทอินชัวร์เทคสัญชาติไทย รับเงินลงทุน Series B มูลค่า 45 ล้าน มี Tencent ร่วมด้วย","link":"https://www.blognone.com/node/124570","date":1630643549000,"content":"<div><div><div><p><a href=\"https://www.easysunday.com/about\">Sunday</a> กลุ่มบริษัทอินชัวร์เทค หรือเทคโนโลยีประกันภัยสัญชาติไทย ได้รับเงินลงทุน Series B มูลค่า 45 ล้าน จาก Tencent, SCB 10X, Vertex Growth, Vertex Ventures Southeast Asia &amp; India, Quona Capital, Aflac Ventures และ Z Venture Capital หลังบริษัทมีรายได้เติบโตเป็นเท่าตัว นับตั้งแต่ปี 2020</p>\n<p>Sunday เป็นกลุ่มบริษัทเทคโนโลยีประกันภัยที่ก่อตั้งในปี 2017 ปัจจุบันมีลูกค้ากว่า 1.6 ล้านคน ให้บริการประกันรถยนต์และประกันท่องเที่ยวที่สามารถซื้อได้แบบออนไลน์ รวมไปถึงประกันสุขภาพแบบกลุ่มสำหรับองค์กร Sunday Health for Business โดยมุ่งเน้นด้านการเป็นประกันแบบ “สั่งตัด” ที่สามารถปรับแต่ง ซื้อเฉพาะส่วนที่ลูกค้าต้องการได้</p>\n<p>Sunday ยังมีการใช้ AI และแมชชีนเลิร์นนิ่ง เพื่อประมวลผลการทำประกันรถยนต์และประกันสุขภาพแบบกลุ่ม เพื่อประเมินความเสี่ยง และปรับราคาแบบอัตโนมัติ รวมถึงมีแผนเปิด Suntech บริการด้านดาต้า เทคโนโลยี และแพลตฟอร์มในอนาคต</p>\n<p>บริษัทระบุว่าเงินทุนรอบ Series B จะถูกนำไปใช้ในการขยายฐานลูกค้าไปยังประเทศอินโดนีเซีย ขยายตลาดค้าปลีก (Retail) ในกลุ่มผลิตภัณฑ์ประกันสุขภาพ การรับประกันอุปกรณ์อิเล็กทรอนิกส์ และประกันภัยรถยนต์ผ่านแพลตฟอร์มออนไลน์ รวมถึงการให้บริการลูกค้าประกันสุขภาพกลุ่ม กลุ่มลูกค้าองค์กร SMEs และพาร์ทเนอร์</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/0121827621858e86d96805249368b366.jpg\" /><em>ภาพจาก <a href=\"https://techcrunch.com/2021/09/02/bangkok-based-insurtech-sunday-banks-45m-series-b-from-investors-like-tencent/\">Sunday</a></em></p>\n<p>ที่มา - <a href=\"https://www.easysunday.com/blog/sunday-insurtech-raises-series-b-round-en/\">Sunday</a> via <a href=\"https://techcrunch.com/2021/09/02/bangkok-based-insurtech-sunday-banks-45m-series-b-from-investors-like-tencent/\">Techcrunch</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sunday\">Sunday</a></div><div><a href=\"/topics/insurtech\">InsurTech</a></div><div><a href=\"/topics/insurance\">Insurance</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5d159c816316d70e3db3848552f70539891eebafe7a2c0ee343b1461cabe7735","category":"Thai"}