{"title":"482 Using growth implants in suckling beef calves enhanced vaccine response against Infectious Bovine Rhinotracheitis","link":"https://academic.oup.com/jas/article/102/Supplement_3/170/7757452?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This study aimed to evaluate vaccine response, growth performance, and immunity of beef calves under different implant strategies. Crossbreed beef calves [n = 90; 39 ± 2.3 kg of body weight (BW) and 80 d of age] were stratified by birth BW and age and were randomly assigned (30 per treatment) to 1 of 3 treatments in a randomized complete block design: 1) implanted with 100 mg progesterone and 10 mg estradiol benzoate (Synovex C, SC, Zoetis Inc.), 2) implanted with 150 mg trenbolone acetate and 21 mg estradiol benzoate (Synovex One Grower, SG, Zoetis Inc.), or 3) no implant (CON). After treatment allocation (d 0) and until weaning (d 151 ± 13.4), all calves were raised alongside their dams and received the same vaccine protocol (Bovi-Shield Gold One Shot and Ultrabac 7) on d 0 and at weaning. Following weaning, calves were allocated to a single pen and received ad libitum total mixed ration until d 60 post-weaning. Body weight and blood samples were collected on d 0, 14, weaning, and on d 14 and 60 post-weaning. Plasma was analyzed for insulin-like growth factor (IGF-1), cortisol, and β-hydroxybutyric acid (BHBA), while serum and whole blood samples were analyzed for serum antibody titers and complete blood count, respectively. Activity budget was recorded for 5 d following weaning with an accelerometer device. A treatment effect (<span>P</span> = 0.01) was detected for serum infectious bovine rhinotracheitis titers, with serum titers being greater in SG than in CON and SC. The SC calves had greater IGF-1 (<span>P</span> = 0.03) compared with CON but not with SG. There was a treatment × day interaction (<span>P</span> = 0.01) for leukocytes where SC was greater than CON but not than SG on the weaning day. Haptoglobin was less (<span>P</span> = 0.02) in SG calves compared with SC and CON. A treatment × day interaction was detected for BHBA (<span>P</span> = 0.04), with SC having decreased concentrations on d 14 post-vaccines compared with SG and CON, while CON was less than SG but not than SC at weaning. Hematocrits were less in SG (<span>P</span> = 0.03) than in SC and CON. There were no differences (<span>P</span> &gt; 0.05) in step count, lying and standing time. Average daily gain (ADG) from d 0 to weaning was greater (<span>P</span> &lt; 0.01) in SG calves compared with CON, but not SC, and ADG from weaning to d 60 post-weaning was greater (<span>P</span> = 0.03) for both SC and SG compared with CON. Weaning weight was greater in SC and SG calves (<span>P</span> ≤ 0.01) and on d 14 and 60 post-weaning compared with CON. In summary, implanting suckling beef calves enhanced immune response and improved growth performance before and after weaning.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5d2765d46fc711263a14e341b693aa37bf74fdab4699e2c749e76269f25d6ffc","category":"Environment"}