{"title":"New algorithm finds lots of gene-editing enzymes in environmental DNA","link":"https://arstechnica.com/?p=1987932","date":1701522034000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/image-800x573.png\" alt=\"A dark blue background with light blue ribbons, and yellow nucleic acids in front.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/image.png\">Enlarge</a> <span>/</span> The protein structure of CAS, shown with nucleic acids bound. (credit: <a href=\"https://directorsblog.nih.gov/2014/03/06/popular-genome-editing-tool-gets-its-close-up/\">Bang Wong, Broad Institute</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>CRISPR—Clustered Regularly Interspaced Short Palindromic Repeats—is the microbial world’s answer to adaptive immunity. Bacteria don’t generate antibodies when they are invaded by a pathogen and then hold those antibodies in abeyance in case they encounter that same pathogen again, the way we do. Instead, they incorporate some of the pathogen’s DNA into their own genome and link it to an enzyme that can use it to recognize that pathogenic DNA sequence and cut it to pieces if the pathogen ever turns up again.</p>\n<p>The enzyme that does the cutting is called Cas, for CRISPR associated. Although the CRISPR-Cas system evolved as a bacterial defense mechanism, it has been harnessed and adapted by researchers as a powerful tool for genetic manipulation in laboratory studies. It also has demonstrated agricultural uses, and the first CRISPR-based therapy was just approved in the UK to treat sickle-cell disease and transfusion-dependent beta-thalassemia.</p>\n<p>Now, researchers have developed a new way to search genomes for CRISPR-Cas-like systems. And they’ve found that we may have a lot of additional tools to work with.</p></div><p><a href=\"https://arstechnica.com/?p=1987932#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1987932&amp;comments=1\">Comments</a></p>","author":"Diana Gitig","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5d2c2fc450da56e4b519003cebbecc550ba36f83588d54c8f542d36836198389","category":"Tech"}