{"title":"No puncheur's paradise: Were the Basque Country climbs underestimated at the Tour de France?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/all-about-gc-men-how-the-puncheurs-underestimated-the-basque-countrys-difficulty-at-the-tour-de-france","date":1688326222000,"content":"\n      \n<div>\n<p>When the routes for the two opening stages of the 2023 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> in the Basque Country were first announced, it looked set to be a happy hunting ground for the current golden generation of classics stars. </p>\n<div></div>\n<p><span>These stages seemed perfectly attuned to their specific strengths of superstars Wout van Aert (Jumbo-Visma), Mathieu van der Poel (Alpecin-Deceuninck), Julian Alaphilippe (Soudal-QuickStep) and Tom Pidcock Ineos Grenadiers), and, while climbing stars Tadej Pogačar (UAE Team Emirates) and Jonas Vingeagaard (Jumbo-Visma) can never be discounted on any stage that features uphills, this quartet were generally perceived as the top favourites for both the weekend’s stages. The parcours didn’t feature the kind of long climbing efforts in the nearby Pyrenees that would have taken them out of contention and nor were they easy enough for the sprinters, even those with more capable climbing legs, to stay in contention by the finish. </span></p>\n<p><span>The opening weekend now behind us, it appears we underestimated the difficulty of the parcours. That’s a pretty easy mistake to make when it comes to the Basque country, which, with its constant undulations and unacknowledged hills, is generally harder in reality than it looks on paper. Many of the riders were taken by surprise, too: sprinter and classics specialist Mads Pedersen (Lidl-Trek) confidently announced himself as among the favourites to take the yellow jersey after the opening stage, only to retract upon realising how tough the parcours really was.</span></p>\n<p><span>It turned out the parcours here was much tougher and more climber-friendly than in Brittany at the 2021 edition when those aforementioned puncheurs were the protagonists. On that occasion, Alaphilippe dropping Van Aert during an uphill finish to Landerneau to take the opening stage and yellow jersey, and Van der Poel then launching an unstoppable attack on Mûr-de-Bretagne the following day on his Tour debut to win the stage, and pay a touching tribute to his recently deceased grandfather and Tour de France legend Raymond Poulidor. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_3266_1024x1024.jpg?v=1688325996\" alt />These same riders will be lamenting their lack of success in this year’s equivalent opening stages. With an average gradient of 10% and lasting two kilometres, the Côte de Pike at the climax of the opening stage had looked a least superficially similar (albeit a fair bit steeper) to the Mûr-de-Bretagne that Van der Poel conquered two years ago, but he found the gradients too hard going this time, slipping back on the climb to finish in the second group. By today’s stage, he seemed resigned to the fact that the terrain here was too hard for him, and sat up from the very bottom of the Jaizkibel to rest up and preserve his energy rather than try against the odds to hang on in there. He’ll now focus on leading out Alpecin-Deceuninck teammate Jasper Philipsen in the upcoming sprint stages.</span></p>\n<p>In theory, these climbs should have been much better suited to the lighter Alaphilippe, especially considering how he triumphed on similar roads at the San Sebastian classic in 2018. But despite showing hints of returning to his best at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/criterium-du-dauphine-all-you-need-to-know\">Critérium du Dauphiné</a> last month, where he won an uphill sprint at La Chaise-Dieu and even made the top ten overall, Alaphilippe hasn’t been at the same level he was during the 2018 season for some time now, and was also well short of the pace during the weekend. He seemed confident on the opening stage, sticking right to the front on the lower slopes of Côte, but overestimated his strength and ultimately slid back until he was dropped. He was less visible today but suffered the same fate of being dropped, finishing in the third group on the road 2-25 behind the leaders. It’s hopefully too premature to make grand statements, especially for a rider still only 31 and on the mend from serious injury, but it’s possible we’ll never see Alaphilippe at his very peak again.</p>\n<p><span>Pidcock, by contrast, certainly has his best years ahead of him, and did fare better this weekend. But he too fell short of expectations on stage one, unable to stick with the lead group on stage one on the kind of steep slopes you would have expected to suit him. He did much better today on the Jaizkibel, but Van Aert immediately covered his attack in the closing stages, and he had to settle for fourth in the ensuing sprint.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-05101_1024x1024.jpg?v=1688326177\" alt />The one rider of the quartet who did excel on both stages was Van Aert, and his failure to take victory was, if anything, a tactical misjudgement rather than lack of legs. He was the only rider of the four to stay in the elite lead group on Côte de Pike, but found the gradients simply too steep to follow the moves of pure climbers Adam and Simon Yates. Stage two suited him better, and appeared to be going perfectly to plan when he made it over Jaizkibel in the select lead group. But being the obvious superior sprinter in the group made life difficult for him by prompting everyone else to attack, and one of those moves, by Victor Lafay (Cofidis) under the kilometre to go banner, stuck, meaning he had to settle for second-place. Whether or not his team leader Jonas Vingegaard should have done him a favour and helped chase down Lafay has been the<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/opinion-stage-two-was-a-missed-opportunity-wout-van-aert-deserves-better-from-his-team\"> subject of intense debate</a> ever since.</p>\n<p><span>So what now for these riders during the rest of the Tour? The route is, on the whole, tricky for them, with not many stages pitched in between the high mountains of the Alps and the Pyrenees, and flat stages in-between for the bunch sprints, for them to target. These were the two stages that were supposed to be for them, and they’ve come and gone with none of them managing to take a stage victory. </span></p>\n<p><span>Pidcock and Alaphilippe are both candidates to get into breakaways during the mountain stages (from which they’ve both won before), and Van Aert, when not doing domestique duty for Vingegaard, is still a candidate for pretty much every stage. But you still sense that no other stages will be quite as stacked in their favour as these two stages had, at least initially, appeared to be. They’re all going to have to race aggressively and smartly if they are to achieve the kind of success they’d hoped for going into the Tour.</span></p>\n<div></div>\n</div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"5d2d26d52389ca433bbee1c2509263caa5176672316047ddc175562212941c77","category":"Cycling"}