{"title":"Water restriction alters seed bank traits and ecology in Atlantic Forest seasonal forests under climate change","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17494?af=R","date":1725692400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/38b12c67-e077-4829-be9f-76475299b6c4/gcb17494-toc-0001-m.png\" alt=\"Water restriction alters seed bank traits and ecology in Atlantic Forest seasonal forests under climate change\" />\n<p>The research explores how the soil seed bank, crucial for forest regeneration, may be affected by projected climate change. In a seasonal forest within the Atlantic Forest, seed germination, ecological attributes, and functional traits were evaluated under different climate scenarios and water levels. The results indicate that water scarcity, especially in future warmer scenarios, could significantly reduce seed viability and the forests' regeneration capacity. This suggests that the persistence of prolonged droughts may compromise the structure and resilience of seasonal forests in the future.</p>\n<p>Resumo Grafico: A pesquisa explora como o banco de sementes do solo, crucial para a regeneraçao florestal, pode ser afetado pelas mudanças climaticas projetadas. Em uma floresta sazonal na Mata Atlantica, a germinaçao de sementes, atributos ecologicos e caracteristicas funcionais foram avaliadas sob diferentes cenarios climaticos e niveis de agua. Os resultados indicam que a escassez de agua, especialmente em cenarios futuros mais quentes, pode reduzir significativamente a viabilidade das sementes e a capacidade de regeneraçao das florestas. Isso sugere que a persistencia de secas prolongadas pode comprometer a estrutura e a resiliencia das florestas sazonais no futuro.</p>\n<br />\n<h2>Abstract</h2>\n<p>The soil seed bank (SSB) is one of the key mechanisms that ensure the perpetuity of forests, but how will it behave in the scenarios projected for the future climate? Faced with this main question, still little explored in seasonal tropical forests, this study evaluated the germination, ecological attributes, and functional traits of the SSB in a seasonal forest in the Atlantic Forest. Forty-eight composite samples of the SSB were collected from 12 plots, distributed across four treatments, each with 12 replicates. The samples were placed in two climate-controlled greenhouses, establishing two environments of controlled climatic conditions, both with two levels of water, as follows: Cur: current scenario without water restriction; Cur_WR: current scenario with water restriction; RCP8.5: future scenario without water restriction; RCP8.5_WR: future scenario with water restriction. The germinants were identified, and their ecological attributes and functional traits were obtained. Leaf area and biomass production, differences in abundance, richness, and diversity were evaluated, along with analysis of variance to assess the interaction between water levels and scenarios. All ecological attributes and functional traits evaluated drastically decreased in the future projection with water restriction, with this restriction being the main component influencing this response. The increased temperature in the future scenario significantly raised water consumption compared to the current scenario. However, persistent water restrictions in the future could undermine the resilience of seasonal forests, hindering seed germination in the soil. Richness and abundance were also adversely affected by water scarcity in the future scenario, revealing a low tolerance to the projected prolonged drought. These changes found in the results could alter the overall structure of seasonal forests in the future, as well as result in the loss of the regeneration potential of the SSB due to decreased seed viability and increased seedling mortality.</p>\n<p>Resumo O banco de sementes do solo (SSB) é um dos principais mecanismos que garantem a perpetuidade das florestas, mas como ele se comportará nos cenários projetados para o clima futuro? Diante dessa questão principal, ainda pouco explorada em florestas tropicais sazonais, este estudo avaliou a germinação, atributos ecológicos e traços funcionais do SSB em uma floresta sazonal na Mata Atlântica. Quarenta e oito amostras compostas do SSB foram coletadas de 12 parcelas, distribuídas em quatro tratamentos, cada uma com 12 réplicas. As amostras foram colocadas em duas estufas com controle climático, estabelecendo dois ambientes de condições climáticas controladas, ambos com dois níveis de água, conforme segue: Cur: cenário atual sem restrição hídrica; Cur_WR: cenário atual com restrição hídrica; RCP8.5: cenário futuro sem restrição hídrica; RCP8.5_WR: cenário futuro com restrição hídrica. Os germinantes foram identificados e seus atributos ecológicos e traços funcionais foram obtidos. Área foliar e produção de biomassa, diferenças na abundância, riqueza e diversidade foram avaliadas, juntamente com análise de variância para avaliar a interação entre níveis de água e cenários. Todos os atributos ecológicos e traços funcionais avaliados diminuíram drasticamente na projeção futura com restrição hídrica, sendo essa restrição o principal componente influenciando essa resposta. O aumento da temperatura no cenário futuro elevou significativamente o consumo de água em comparação com o cenário atual. No entanto, a restrição hídrica persistente no futuro pode comprometer a resiliência das florestas sazonais, dificultando a germinação de sementes no solo. Riqueza e abundância também foram adversamente afetadas pela escassez de água no cenário futuro, revelando uma baixa tolerância à seca prolongada projetada. Essas mudanças encontradas nos resultados podem alterar a estrutura geral das florestas sazonais no futuro, além de resultar na perda do potencial de regeneração do SSB devido à diminuição da viabilidade das sementes e ao aumento da mortalidade das plântulas.</p>","author":"Patrícia Borges Dias, \nSustanis Horn Kunz, \nJosé Eduardo Macedo Pezzopane, \nTalita Miranda Teixeira Xavier, \nJoão Paulo Fernandes Zorzanelli, \nJoão Vitor Toledo, \nLhoraynne Pereira Gomes, \nRodrigo Gomes Gorsani","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"5d2df9c44de97c10fba15aec5704bf7b80131393eefc3bc8b7ef27324a09b0ce","category":"Environment"}