{"title":"Exploring Sustainable Procurement Practices: A Qualitative Study of Supplier Selection Criteria","link":"https://www.preprints.org/manuscript/202406.0548/v1","date":1718004244000,"content":"This qualitative study explores sustainable procurement practices and supplier selection criteria, delving into the complexities, challenges, and opportunities of integrating sustainability considerations into procurement decisions. Through in-depth interviews with procurement professionals from diverse industries, the research uncovers key themes such as the multifaceted nature of sustainable procurement criteria, the challenge of assessing and managing suppliers' sustainability performance, the importance of collaboration and communication, and the influence of regulatory and market pressures. Findings reveal that sustainable procurement involves a comprehensive approach that considers environmental, social, and ethical factors alongside traditional criteria like cost and quality. Assessing suppliers' sustainability performance emerges as a significant challenge, necessitating robust assessment processes and technological solutions to enhance transparency and traceability. Collaboration and communication with suppliers are identified as critical enablers of sustainable procurement, fostering trust and mutual understanding. Regulatory mandates and market demands drive organizational commitments to sustainability, shaping supplier selection criteria and procurement strategies. Despite challenges, sustainable procurement offers benefits such as enhanced risk management, cost savings, innovation, and reputation enhancement. Overall, sustainable procurement represents a strategic approach that contributes to positive environmental and social outcomes, supporting a more sustainable and equitable future for organizations and society.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5d34ec7a34a8a1d275e7153a9cacb0dbab9f68263c98c4da9a9a10200c2607d9","category":"Interdisciplinary"}