{"title":"Epic Games Asks Apple to Restore Fortnite in South Korea Following Ban on In-App Purchase Requirement","link":"https://www.macrumors.com/2021/09/09/epic-games-fortnite-south-korea/","date":1631232046000,"content":"<a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> today said that it has asked Apple to reinstate its Fortnite developer account because it intends to release Fortnite in South Korea.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/fortnite_apple_featured.jpg\" />\r\n<br />\r\nSouth Korea in late August <a href=\"https://www.macrumors.com/2021/08/31/south-korea-passes-app-store-bill/\">passed a bill</a> that bans Apple from requiring developers to use its in-app purchase system. The bill forces Apple (and Google) to let developers use third-party payment methods to make purchases.\r\n<br />\r\n\r\n<br />\r\n‌Epic Games‌ now says that it intends to release Fornite in Korea and offer both Epic payment and Apple payment options side-by-side \"in compliance with the new Korean law.\"\r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>Epic has asked Apple to restore our Fortnite developer account. Epic intends to re-release Fortnite on iOS in Korea offering both Epic payment and Apple payment side-by-side in compliance with the new Korean law.</p>— Fortnite (@FortniteGame) <a href=\"https://twitter.com/FortniteGame/status/1436105346184056832?ref_src=twsrc%5Etfw\">September 9, 2021</a></blockquote> </div>\r\n<br />\r\nFortnite has been unavailable on iOS devices since Apple <a href=\"https://www.macrumors.com/2020/08/13/apple-removes-fortnite-from-app-store/\">pulled the app</a> in August 2020. Apple removed the app from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> after ‌Epic Games‌ added a direct payment option that skirted Apple's in-app purchase requirements, and since then, the two have been embroiled in a bitter legal battle.\r\n<br />\r\n\r\n<br />\r\n‌Epic Games‌ attempted to get a judge to require Apple to allow Fortnite on the ‌App Store‌ while the lawsuit played out, but the judge refused because the situation that caused Fortnite to be banned was of ‌Epic Games‌' own making.\r\n<br />\r\n\r\n<br />\r\nWhen South Korea passed its updated Telecommunications Business Act banning Apple from requiring in-app purchases, Apple said that it would put users at risk of fraud and undermine privacy protections.<blockquote>The Telecommunications Business Act will put users who purchase digital goods from other sources at risk of fraud, undermine their privacy protections, make it difficult to manage their purchases, and features like \"Ask to Buy\" and Parental Controls will become less effective. We believe user trust in App Store purchases will decrease as a result of this legislation -- leading to fewer opportunities for the over 482,000 registered developers in Korea who have earned more than KRW8.55 trillion to date with Apple.</blockquote>It is not yet clear if Apple will be willing to reinstate the Fortnite developer account and allow ‌Epic Games‌ to distribute Fortnite in South Korea.\r\n<br />\r\n\r\n<br />\r\nApple and ‌Epic Games‌ <a href=\"https://www.macrumors.com/2021/05/24/epic-games-v-apple-trial-ends/\">faced off in a trial</a> that took place earlier this year, and we are still awaiting a final ruling from the judge overseeing the case. ‌Epic Games‌ argued that iOS should be opened up to competing app stores, but it is unlikely that Apple will be required to implement such a drastic change.<div>Tags: <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, <a href=\"https://www.macrumors.com/guide/fortnite/\">Fortnite</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/09/epic-games-fortnite-south-korea/\">Epic Games Asks Apple to Restore Fortnite in South Korea Following Ban on In-App Purchase Requirement</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/epic-games-asks-apple-to-restore-fortnite-in-south-korea-following-ban-on-in-app-purchase-requirement.2310218/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=lC9sOZWBK9s:1wUyIWqpFYA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=lC9sOZWBK9s:1wUyIWqpFYA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/lC9sOZWBK9s\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5d3c42f7e8bed18f6c5430becce6abc530938923289d7fa3f241b8a0cbae4d3e","category":"Apple"}