{"title":"Muze ผู้พัฒนาระบบ Omni-Channel และ OTT เบื้องหลังแบรนด์ใหญ่ เฟ้นหานักพัฒนาร่วมทีม","link":"https://www.blognone.com/node/123638","date":1625813059000,"content":"<div><div><div><p>โควิด-19 ดันยอดตัวเลขอีคอมเมิร์ซโตสูง รายได้อีคอมเมิร์ซของประเทศไทยในปีที่ผ่านมาสูงกว่าปีก่อนหน้าถึง 22.1% แต่ในขณะเดียวกันธุรกิจค้าปลีกก็ต้องเผชิญกับความท้าทายจากการปรับตัวสู่ดิจิทัลเพราะลูกค้าหน้าร้านลดลง ช่องทางการขายออนไลน์กลายเป็นช่องทางสำคัญสำหรับแบรนด์ในการสร้างยอดขาย ดังนั้นแบรนด์ที่ปรับตัวเร็ว สามารถสร้างแพลตฟอร์มการขายได้อย่างทันท่วงทีจึงได้เปรียบในสถานการณ์อันท้าทายนี้</p>\n<p>ในบทความนี้ Blognone จะพาไปรู้จัก Muze ผู้พัฒนาระบบ Omni-Channels หรือระบบรองรับการขายทั้งออฟไลน์และออนไลน์ ที่อยู่เบื้องหลังความสำเร็จของแบรนด์ใหญ่ๆ อย่าง McGroup รวมไปถึงยังเป็นเบื้องหลังผู้พัฒนาระบบ OTT ให้ บีอีซี เวิลด์ มาแล้ว ซึ่งกลายเป็นส่วนสำคัญต่อการเติบโตทางธุรกิจสวนกระแสตลาดในตอนนี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/4a0fad96b39f99799f5e60c84ab7f845.jpeg\" /></p>\n<h3>วิสัยทัศน์ Muze ใช้เทคโนโลยีสร้าง Impact ให้แบรนด์ได้</h3>\n<p>Muze ก่อตั้งโดย คุณบี พีรณัฎฐ์ ทูลแสงงาม โดยเริ่มตั้งบริษัทมาตั้งแต่สมัยที่เริ่มมีการเขียนแอปบน iPhone  ด้วยการพัฒนา Muze Mobile Music Player Application ที่มียอดดาวน์โหลดใช้งานกว่า 1 ล้านครั้ง เมื่อเวลาผ่านไป Muze ค่อยๆ ปรับตัวทางธุรกิจ ปัจจุบันหันมาจับตลาดอีคอมเมิร์ซ โดยพัฒนาระบบร้านค้าออนไลน์ในชื่อว่า inCart ด้วยระบบจัดการสินค้า สต็อกสินค้า ออเดอร์ โปรโมชั่น หน้าจอบริหารลูกค้า มาพร้อมกับระบบชำระเงินให้กับบริษัทคู่ค้า ให้สามารถอยู่รอด ปรับตัวและแข่งขันได้ในยุคดิจิทัล</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/597f0b26d6e8fd4d40374381fa0c8c5f.jpeg\" /></p>\n<p>ผลงานที่น่าจดจำของ Muze คือ ร่วมพัฒนา Omni-Channels กับ McGroup แบรนด์กางเกงยีนส์รายใหญ่ของไทย จนสามารถสร้างยอดขายเฉพาะ Online Omni-Channels มากกว่า 500 ล้านบาทต่อปี ส่งผลให้รายได้เติบโตถึง 6.9% แม้เป็นช่วงล็อกดาวน์ครั้งแรก</p>\n<p>นอกจากนี้ยังร่วมงานกับบริษัท บีอีซี เวิลด์ จำกัด (มหาชน) หรือ BEC พัฒนาแพลตฟอร์ม CH3plus เป็นช่องทางสตรีมมิ่ง ตอบโจทย์คนดูที่เปลี่ยนพฤติกรรมไปดูสตรีมมิ่งกันมากขึ้น และพัฒนาระบบหลังบ้าน BEC จัดไลฟ์คอนเสิร์ต ‘Gulf The Next Stage’ คอนเสิร์ตเอ็กซ์คลูซีฟบน CH3plus ผลักดันให้ยอดผู้ใช้งานรายเดือน (Monthly Active User - MAU) โตขึ้นกว่า 200% และจำนวนสมาชิกในช่วงไตรมาสที่ 4 ปี 2563 ถึง ไตรมาสที่ 1 ของปี 2564 เติบโตขึ้นถึง 50%</p>\n<p><strong>“Muze ไม่เพียงสร้างโซลูชั่นให้ลูกค้าเท่านั้น แต่ยังส่งทีมเข้าไปร่วมทำงานกับลูกค้าตั้งแต่ต้น เพื่อให้แน่ใจว่าลูกค้านำโซลูชั่นไปใช้แล้วประสบความเร็จ มีโอกาสเติบโตทั้งในแง่ยอดขายและผู้ใช้งาน เรียกได้ว่าทำงานกับลูกค้าจนแทบจะเป็นทีมเดียวกัน”</strong> คุณบี พีรณัฎฐ์ ทูลแสงงาม ผู้ก่อตั้งและผู้บริหารบริษัท Muze กล่าว</p>\n<h3>สร้างความเชื่อใจระหว่างทีมงานและลูกค้า</h3>\n<p>คุณบีบอกว่า แม้ Muze จะเป็นบริษัท Tech ขนาดเล็กมีพนักงานประมาณ 60 กว่าคน แต่มีทีมงานที่ช่วยผลิตงานออกมาสำเร็จได้ “เรามีทีมเทคโนโลยีที่แข็งแกร่งและเชี่ยวชาญในสายงานของตัวเอง มีประสบการณ์มาอย่างโชกโชนในการแก้ปัญหาให้องค์กรใหญ่ๆ”</p>\n<p>ที่ Muze ผู้บริหารพยายามสร้างบรรยากาศของความเชื่อใจ เชื่อว่าทุกคนมีความรับผิดชอบ เมื่อเราเชื่อว่าทีมงานรับผิดชอบในส่วนของเขา เพื่อนร่วมงานก็เชื่อว่าเราจะรับผิดชอบในส่วนของเราเช่นกัน ผลลัพธ์คือ Product/Project ที่เราสร้างจะมีคุณภาพ และสามารถทำได้เสร็จตามแผนที่วางไว้เมื่อทีมงานมีความเชื่อใจกัน ลูกค้าก็จะเชื่อใจผลงานของบริษัทเราด้วย</p>\n<h3>วัฒนธรรมองค์กร เน้นปรับตัวรับสิ่งใหม่ได้เร็ว</h3>\n<p>คุณบีมองว่า เทคโนโลยีทุกวันนี้เปลี่ยนเร็วมาก สิ่งที่คนเรียนมา 1-2 ปี อาจเก่าไปแล้ว ธุรกิจที่เคยทำเงินก็โดน Disrupt กันเป็นว่าเล่น ดังนั้น Muze จึงเน้นสร้างวัฒนธรรมองค์กรที่เอื้อต่อการปรับตัวเร็ว เช่น ให้นักพัฒนาซอฟต์แวร์สามารถศึกษาเรียนรู้เทคโนโลยีใหม่ๆ ให้เหมาะกับงานอยู่เสมอ มีโครงการรีสกิลและอัพสกิล ทักษะด้านเทคโนโลยีในการพัฒนาผลิตภัณฑ์ (Technical Skill) มี Review Code Session ให้ทีมงานเสริมทักษะการเขียนและออกแบบโครงสร้างโค้ดโดยตรงจาก CTO และทักษะการทำงานกับคนหลากหลายรูปแบบ (Human Skill)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3ae024c4c02eda940e44be6231f24d19.png\" /></p>\n<p>เพื่อให้เกิดการเรียนรู้สิ่งใหม่ของบุคลากร ความยืดหยุ่นหรือ Flexibility ก็เป็นสิ่งสำคัญ Muze ดำเนินแนวทางเช่นเดียวกับบริษัทชั้นนำระดับโลกทำที่เรียกว่า Work Life Harmony ให้ชีวิตการทำงานกับชีวิตส่วนตัวมีสมดุลที่เหมาะสม ช่วงที่ประเทศไทยสถานการณ์โควิด-19 ดีขึ้น ก็ใช้โมเดลทำงานแบบไฮบริด เข้าออฟฟิศ 3 วันต่อสัปดาห์</p>\n<p>หรือแม้แต่ตอนที่สถานการณ์โรคระบาดกลับมาวิกฤตอีกครั้ง จำเป็นต้องปรับการทำงานแบบ WFH 100%  Muze สามารถปรับตัวได้เร็ว เพราะกระบวนการพัฒนาอาศัยโครงสร้าง CI/CD (Continuous integration and continuous delivery) บนคลาวด์ทั้งหมด ทำให้ทีมงานทำงานได้ต่อเนื่องจากทุกที่ นอกจากนี้ก็มีเปิดการประชุมเล่นเกมร่วมกันผ่าน Discord บ้าง เพื่อไม่ให้เหงาเกินไป</p>\n<h3>เปิดรับนักพัฒนาซอฟต์แวร์มาร่วมทีม Muze Career Day</h3>\n<p>ตอนนี้ Muze กำลังมีรายได้เติบโตจากปี 2020 เกือบ 2 เท่าตัว แม้อยู่ในช่วงวิกฤตเศรษฐกิจก็ตาม บริษัทกำลังอยู่ระหว่างเปิดรับพนักงานใหม่</p>\n<p>Muze กำลังมองหาคนรุ่นใหม่ที่มีความสนใจทำงานในบริษัทเทคโนโลยี ไม่จำเป็นต้องเชี่ยวชาญใน Tech Stack ทุกตัวที่ Muze ใช้ ขอเพียงโดดเด่นในภาษาโปรแกรมใดภาษาหนึ่ง และพร้อมที่จะเรียนรู้ไปด้วยกัน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b0641cc5f32d001c0f9ea0beeb267de0.png\" /></p>\n<p>ใครที่อยากมีส่วนร่วมสร้างโปรเจคระดับแนวหน้าของเมืองไทย  มองหาพื้นที่ที่ได้แสดงศักยภาพ เรียนรู้สิ่งใหม่ๆและพัฒนาตัวเองตลอดเวลา สามารถสมัครงานเข้ามาที่ Muze ได้ หรือเข้าไปลงทะเบียนร่วมงาน “Muze Career Day” ได้แล้วตั้งแต่วันนี้ที่ 1 กรกฏาคม 2564 โดยงานจะจัดขึ้นวันที่ 15 กรกฎาคม 2564 เวลา 19.00 น.- 20.30 น. ผ่านทาง <a href=\"https://www.facebook.com/muze.innovation\">Facebook Live เพจ Muze Innovation</a> โดยจะเปิดให้ลงทะเบียนตั้งแต่ 18.30 น. เป็นต้นไป ต้องการข้อมูลเพิ่มเติมสอบถามได้ที่ 094 464 6554 หรือ Inbox สอบถามได้ที่เพจ<a href=\"https://www.facebook.com/muze.innovation/\">เฟซบุ๊ก Muze Innovation</a> หรือลงทะเบียน online ได้ที่ <a href=\"https://www.jotform.com/form/211799085576471\">jotform.com/form</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/startup\">Startup</a></div><div><a href=\"/topics/e-commerce\">E-commerce</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5d42d28afdafba8429eee7b8c18c89616c02038a836ff653ffe57b156b744308","category":"Thai"}