{"title":"Strong large‐scale structure–function coupling in benthic bacteria is mediated by algae in a geodiverse river network","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12690?af=R","date":1727805570000,"content":"<h2>Abstract</h2>\n<p>Benthic bacteria in stream ecosystems drive organic matter mineralization. However, knowledge on how this ecosystem function is driven by bacterial community composition in interaction with environmental conditions and organic matter resources is poor. This is especially true when considering the regional scale of river networks, at which environmental conditions vary in a scale-dependent manner and are spatially structured due to asymmetrical water flow. Similarly, organic matter resources may have a terrestrial origin in remote headwaters or be sourced locally from algae living in close proximity to bacteria in benthic biofilms. We investigated benthic biofilm meta-community structure and function across the &gt; 6700 km<sup>2</sup> river network of the near-natural Vjosa in Albania and Greece and found a strong control of the benthic algal community on bacterial community composition (13.4% of variability explained). In addition, bacterial community composition has linkages to water chemistry, which itself is strongly shaped by the diverse geology in the catchment, and to dispersal, shaping metacommunity structure as a neutral process. Notably, bacterial community composition explained the largest single fraction of variability (31.5%) in extracellular enzymatic activities, while there was no dependency of enzyme ratios on organic matter nor environmental conditions. Synergistic effects between bacteria and algae accounted for additional 47.3% of variability in heterotrophic functioning, emphasizing the importance of algal–bacterial interactions in benthic biofilms. Our findings shed new light on bacterial structure–function coupling highlighting the importance of algal–bacterial interactions at the river network scale.</p>","author":"Lukas Thuile Bistarelli, \nThomas Fuß, \nFranziska Walther, \nLuca Zoccarato, \nLauren Talluto, \nAnna M. Romaní, \nHans‐Peter Grossart, \nGabriel A. Singer","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"5d44a2faa2adb2128c7d33a1e469388346d8fed3ed4fcc6c6d2fff0ce85a51b4","category":"Environment"}