{"title":"Unraveling Circular Conundrums with a Cheeky Twist: Proposal for a New Way of Measuring Circular Economy Efforts","link":"https://www.preprints.org/manuscript/202410.1148/v1","date":1728987250000,"content":"This study addresses the challenge of evaluating circularity within the procurement-to-waste sys-tem boundaries, exemplified by single-use in-flight drinking cups provided on SWISS International Air Lines Ltd. flights. A comprehensive review of academic literature, market-based tools, and po-litical regulations highlights the absence of adequate methodologies for assessing circularity within these specific system boundaries. Existing approaches, primarily designed at the product level, are often either excessively complex or focused solely on waste management. To address this gap, the research proposes an extension to the Circularity Mass Utilisation Index (CMU), currently imple-mented at the European Union level. The traditional CMU does not account for circular inflow, thereby neglecting procurement decisions. In response, this study introduces an extended version of the CMU, expressed as: CMU Extended = (Circular Inflow + Circular Outflow) / (2 * Total Material Use). This modification enables a more holistic evaluation of circularity by incorporating both in-flows and outflows of materials in relation to total material use. Empirical testing demonstrated the applicability of this extended CMU in the context of SWISS, allowing for an efficient assessment of circularity for single-use in-flight drinking cups. From these initial results, we hypothesize that this ratio is expected to be broadly applicable beyond the airline industry, providing a valuable tool for businesses seeking to measure circularity within similar system boundaries.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5d5833afd78c832400bb99b750742519c763695fcea79790f622eb2eee06e5b3","category":"Interdisciplinary"}