{"title":"Determinants and prevalence of zero-dose children in Somalia: Analysis of the 2020 Health Demographic Survey data","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002612","date":1719928800000,"content":"<p>by Said A. Mohamoud, Mohamed Abdullahi Ali-Salad, Ahmed Said Bile, Neha S. Singh, Amina J. Mahmud, Barni Nor</p>\r\n\r\nDespite global progress in childhood vaccination coverage, fragile and humanitarian countries, with high burden of infectious diseases, continue to report a significant number of zero-dose and under-vaccinated children. Efforts to equitably reach zero-dose children remain thus critical. This study assesses the prevalence and determinants of zero-dose children in fragile context of Somalia. We used secondary data from 2020 Somali Health and Demographic Survey (SHDS) to determine status of unvaccinated children aged between 12 to 23 months. Variables related to socio-demographic, household, health seeking, and community level factors were extracted from the SHDS data. Variables that were shown to be significantly associated with zero-dose children at p&lt; 0.05 in the single logistic regression analysis were identified and included in a final multiple logistic regression analysis. A total of 2,304 women and their children aged between 12–23 months were used to determine the prevalence and determinants of zero dose children in Somalia. Approximately 60.2% of the children were zero dose children and did not receive any dose of the four basic routine vaccines. Children living in rural and nomadic areas were more likely to be zero dose (aOR 1.515, 95% CI: 1.189–1.93). Mother with primary education and above (aOR 0.519, 95% CI: 0.371–0.725), those who attended antenatal care (aOR 0.161, 95% CI: 0.124–0.209) and postnatal care (aOR 0.145, 95% CI: 0.085–0.245) and listen frequently to radio (aOR 2.212, 95% CI: 1.106–4.424) were less likely to have children with zero dose than with their counterparts. Majority of children under two years of age in Somalia are reported to be zero dose children. Context and population specific interventions that target vulnerable mothers and their children, in rural and nomadic areas, and from lower wealth quintile index families with no education and adequate access to antenatal and postnatal care remain critical.","author":"Said A. Mohamoud","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"5d597583b8f4af9d58614c2563debb799c4ac46c460ad577a73cd3e0b7f832e2","category":"Environment"}