{"title":"Status and prospects of the ornamental fish industry in Kenya","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.172?af=R","date":1716706800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e3a4397c-0df3-4e5b-8fe4-47a7d9ae4624/aff2172-gra-0001-m.png\" alt=\"Status and prospects of the ornamental fish industry in Kenya\" /><p>This paper sought to identify the existing opportunities for enhancing the production and trade of ornamental fish in the country. The findings reveal that there are opportunities for the collection of native freshwater ornamental fish species from the vast freshwater resources in the country; for the culture of marine ornamental fish; for public aquariums as centres of recreation, conservation, research and education; and for employment and development of support industries. \n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Kenya is a major player in the global ornamental trade, exporting substantial quantities of ornamental fish to the global market. The sector plays an important role in the country's economy through foreign exchange. However, the country's ornamental fish industry has not fully developed to generate more economic benefits. This paper sought to identify the existing opportunities for enhancing the production and trade of ornamental fish in the country. The findings reveal that there are opportunities for collection of native freshwater ornamental fish species from the vast freshwater resources in the country; for the culture of marine ornamental fish; for public aquariums as centres of recreation, conservation, research and education; and for employment and development of support industries. The findings also show that there are international legislations and national policies that create an enabling environment for the growth of the industry. To unlock the full potential of the industry, training and research, investment and infrastructure development, quality assurance, collaboration and networking, and environmental sustainability strategies need to be put in place. This will ensure Kenya's position as a key player in the global ornamental fish trade.</p>","author":"Jonathan M. Munguti, \nJimmy B. Mboya, \nJacob O. Iteba, \nJames G. Kirimi, \nKevin O. Obiero, \nDomitila N. Kyule, \nMary A. Opiyo, \nFrancis K. Njonge","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"5d6014c2ef68aaa47d7d3fcc5fd29eeccf86505b25330eda978956a2fbf81623","category":"Environment"}