{"title":"Nitrogen availability regulates the effects of a simulated marine heatwave on carbon sequestration and phycosphere bacteria of a marine crop","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12487?af=R","date":1708528481000,"content":"<h2>Abstract</h2>\n<p>Great hope has been pinned on seaweed cultivation as being a potent way of removing CO<sub>2</sub> to reduce rates of sea surface warming and acidification. Marine heatwaves and nitrogen pollution in coastal ecosystems are serious current issues that need to be better understood to inform decision making and policy. Here, we investigated the effects of a simulated heatwave and nitrogen pollution on carbon sequestration by an important seaweed crop species and its phycosphere bacteria. <i>Gracilaria lemaneiformis</i> was grown in ambient and high nitrogen conditions (14 and 200 <i>μ</i>M L<sup>−1</sup>). Photosynthetic rate, seaweed biomass and particulate organic carbon accumulation were significantly increased in “high nitrogen-no heatwave” conditions. In “ambient nitrogen heatwave” conditions, the expression of genes related to photosynthesis was down regulated and the seaweeds lost more dissolved organic carbon (DOC) to the surrounding water, resulting in more refractory dissolved organic carbon (RDOC). In “high nitrogen heatwave” conditions, photosynthetic gene expression was upregulated; bacterial abundance was also increased that can explain the reduced DOC and RDOC accumulation. The simulated heatwave reduced bacterial diversity while high nitrogen alleviated this effect. These findings suggest that the economically important alga <i>G</i>. <i>lemaneiformis</i> may lose more DOC and RDOC to nearshore waters during marine heatwave events, enhancing carbon sequestration, while nitrogen enrichment has a counteractive effect.</p>","author":"Meijia Jiang, \nJason M. Hall‐Spencer, \nLin Gao, \nZengling Ma, \nGuang Gao","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"5d6cbe445c97278e49b45ca2059737a8db37d4e2ea77b98a0926384f95ef9cb5","category":"Environment"}