{"title":"Hidden reference in tvOS 17.4 teases Apple’s new smart home platform","link":"https://www.macworld.com/article/2221616/homeos-reference-new-apple-operating-system.html","date":1706622719000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>While everyone is talking about the new <a href=\"https://www.macworld.com/article/2218208/ios-17-4-beta-eu-app-store-changes-features-install.html\">App Store rules</a> that allow sideloading and third-party payments, Apple may be hiding something far more interesting in the latest round of beta software. A snippet of code in tvOS 17.4 beta 1 hints that Apple is continuing to work on a new operating system called homeOS.</p>\n\n\n\n<p>Software code spelunker Aaron Perris at <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2024/01/29/tvos-17-4-homeos-mention/&amp;xcust=1-1-2221616-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MacRumors</a> reported the discovery of a reference to homeOS in the new beta OS for Apple TV. The writer doesn’t offer further detail of the context in which that branding is mentioned, but speculates that it could refer to one of the smart-home products Apple is rumored to be working on.</p>\n\n\n\n<p>The two main rumors in this area concern an iPad-like device that will serve as a <a href=\"https://www.macworld.com/article/1477957/smart-home-rumors-wall-display-apple-tv.html\">central hub</a> for a smart home and a <a href=\"https://www.macworld.com/article/676817/homepod-with-screen-rumours-and-release-date.html\">HomePod with a screen</a>. One or both of these devices could benefit from a bespoke software operating system catering to their specific needs.</p>\n\n\n\n<p>As things stand, one would assume they would run either tvOS or HomePod‌ Software, which is in turn based on tvOS. (When it first launched, the HomePod ran a modified version of iOS instead, but Apple switched it over a couple of years later.) But it would likely make more sense to create a dedicated platform, probably still closely related to tvOS, with smart-home devices in mind.</p>\n\n\n\n<p>Speculation about a new smart-home OS began back in 2021 when <a href=\"https://www.macworld.com/article/678035/new-apple-job-advert-hints-at-homeos-launch-plans.html\">two Apple job adverts</a> mentioned homeOS among new employees’ duties. It was strongly implied that this was something new rather than a rebranding of tvOS–one possible theory at the time–since tvOS and homeOS were mentioned separately in the advert. The fact that Apple promptly removed the references from its site also suggested that something significant was being alluded to.</p>\n\n\n\n<p>In terms of timing, the public release of tvOS 17.4 is expected sometime around March, which as MacRumors observes would be a convenient time for the announcement of new hardware. That, after all, is when Apple likes to hold a <a href=\"https://www.macworld.com/article/1484151/apple-spring-2023-event-date-time-how-to-watch-rumors.html\">spring event</a>.</p>\n\nSmart Home</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5d6ef683158a2e03407b4f31433a2e50219acd8e8ef7c0a7091e81c5a05f80d4","category":"Apple"}