{"title":"Decarbonisation of Small-Scale Railway Earthwork Interventions Using PAS 2080 Life-Cycle Methodology","link":"http://link.springer.com/10.1007/978-981-97-8237-6_20","date":1735689600000,"content":"<h3>Abstract</h3>\n                  <p>Transport is responsible for about 23% of global energy-related CO<sub>2</sub> emissions (also referred to as carbon or GHGs), in addition to those associated with building and maintaining the infrastructure. Thus, the transport sector must rapidly accelerate its decarbonisation efforts to help countries limit their emissions to meet Nationally Determined Contributions established in response to the Paris Agreement. This is especially important given IPCC estimates that the 1.5ʡC line of global warming will be crossed in the early 2030s. Transportation sector CO<sub>2</sub> emissions are attributable to the infrastructure (mainly in construction, maintenance, and repair) and vehicles using it. Both areas will require urgent attention. The carbon emissions associated with the construction and maintenance of railway infrastructure are currently not well understood, hence meaningful whole life-cycle analysis of railway geotechnical assets is problematic. Filling this knowledge gap requires measurement of the CO<sub>2</sub> and carbon footprint associated with railway assets and identification of hot spots. This paper outlines tangible steps that can be taken, aligned to PAS 2080 life-cycle stages, for several types of mainline railway earthworks over differing temporal scales of earthwork interventions to decarbonise these interventions and help reach net zero. Research, based on a dataset of 50 small-scale mainline railway earthwork case studies in Great Britain, has found that for differing temporal interventions the carbon hotspots were in differing PAS 2080 life-cycle stages thereby requiring a range of different solutions to deliver decarbonisation.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"5d88c0a688cae464c71a6d2dd39fd51e8b61f8d4b51a54bfd3e2649b4b205cb6","category":"Environment"}