{"title":"Google warns that NSO hacking is on par with elite nation-state spies","link":"https://arstechnica.com/?p=1821631","date":1639830647000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/nso-group-hq-800x534.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/nso-group-hq.jpg\">Enlarge</a> <span>/</span> A man walks by the building entrance of Israeli cyber company NSO Group at one of its branches in the Arava Desert on November 11, 2021, in Sapir, Israel. (credit: Amir Levy | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Israeli spyware developer NSO Group has <a href=\"https://www.wired.com/story/nso-group-spyware-pegasus-state-department/\">shocked</a> the global security community for years with <a href=\"https://www.wired.com/2017/04/total-takeover-iphone-spyware-lurks-android/\">aggressive</a> and <a href=\"https://www.wired.com/story/whatsapp-hack-phone-call-voip-buffer-overflow/\">effective</a> <a href=\"https://www.wired.com/story/nso-group-hacks-ios-android-observability/\">hacking tools</a>that can target both Android and iOS devices. The company's products have been so abused by its customers around the world that NSO Group now faces sanctions, high-profile lawsuits, and an uncertain future. But a <a href=\"https://googleprojectzero.blogspot.com/2021/12/a-deep-dive-into-nso-zero-click.html\">new analysis</a> of the spyware maker's ForcedEntry iOS exploit—deployed in a number of targeted attacks against activists, dissidents, and journalists this year—comes with an even more fundamental warning: Private businesses can produce hacking tools that have the technical ingenuity and sophistication of the most elite government-backed development groups.</p>\n<p>Google's Project Zero bug-hunting group analyzed ForcedEntry using a sample provided by researchers at the University of Toronto's Citizen Lab, which <a href=\"https://citizenlab.ca/2021/08/bahrain-hacks-activists-with-nso-group-zero-click-iphone-exploits/\">published extensively</a> this year about targeted attacks utilizing the exploit. Researchers from Amnesty International also <a href=\"https://www.amnesty.org/en/latest/research/2021/07/forensic-methodology-report-how-to-catch-nso-groups-pegasus/\">conducted important research</a> about the hacking tool this year. The exploit mounts a zero-click, or interactionless, attack, meaning that victims don't need to click a link or grant a permission for the hack to move forward. Project Zero found that ForcedEntry used a series of shrewd tactics to target Apple's iMessage platform, bypass protections the company added in recent years to make such attacks more difficult, and adroitly take over devices to install NSO's flagship spyware implant Pegasus.</p>\n<p>Apple released a series of patches in September and October that mitigate the ForcedEntry attack and harden iMessage against future, similar attacks. But the Project Zero researchers write in their analysis that ForcedEntry is still “one of the most technically sophisticated exploits we've ever seen.” NSO Group has achieved a level of innovation and refinement, they say, that is generally assumed to be reserved for a small cadre of nation-state hackers.</p></div><p><a href=\"https://arstechnica.com/?p=1821631#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1821631&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5d8c9b96be3ae91ca64ba6152f92509bc5a7ffb45d3b690b1d9b1422de6f38e2","category":"Tech"}