{"title":"TAS2R38 Genotype Does Not Affect SARS-CoV-2 Infection in Primary Ciliary Dyskinesia","link":"https://www.preprints.org/manuscript/202406.0885/v1","date":1718249829000,"content":"(1) Background: Several chronic respiratory diseases could be a risk factor for acquiring SARS-CoV-2 infection: among them, Primary Ciliary Dyskinesia (PCD) is a rare (about 1:10.000) inherited ciliopathy (MIM 242650) characterized by recurrent upper and lower respiratory tract infections due to a dysfunctioning of the respiratory cilia; We aimed to investigate if some polymorphisms of the TAS2R38 bitter taste receptor correlate with an increased prevalence of SARS-CoV-2 infection and severity of symptoms in a cohort of PCD subjects; (2) Methods: Patients answered several questions about possible SARS-CoV-2 infection, experienced symptoms and vaccinations; in case of infection, they also filled out a SNOT-22 and ARTIQ questionnaires; (3) Results: Forty PCD adult patients (mean age 36.6 ± 16.7 years, 23 females) participated to the study, out of which 30 % had tested positive for COVID-19 during the last four years; most of them reported a mildly symptomatic disease. We found no differences in age or sex, but a statistic significant difference (p=0.03) was observed in body mass index (BMI), that was higher in the COVID-acquired group (23.2 ± 3.3 vs 20.1 ± 4.1 kg/m2). Genotyping for TAS2R38 polymorphisms showed a prevalence of 28.6% PAV/PAV, 48.6% PAV/AVI and 22.8% AVI/AVI individuals in our cohort. In contrast to our hypothesis, we did not observe a protective role of PAV allele towards SARS-CoV-2 infection; (4) Conclusions: Our findings suggest that subjects with PCD may not be at increased risk of severe outcomes from COVID-19 and the TAS2R38 bitter taste receptor genotype type does not affect SARS-CoV-2 infection.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5d8d923ec673ab3a5e11af3bd7989cb3a522cad820dd1132344b0f0a28f93d05","category":"Interdisciplinary"}