{"title":"Sorry Apple, most people will never use any of the new features coming in iOS 17","link":"https://www.macworld.com/article/1965112/iphone-users-dont-know-new-features.html","date":1687633556000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>I have spent the last couple of decades writing about new features in Apple’s operating systems. Tens of thousands of words about new items, large and small, that enhance the experience of using a Mac, iPhone, iPad, and other Apple devices. And yet this past weekend, I was reminded that most users simply don’t notice new features, even when they’ve been available for years.</p>\n\n\n\n<p>If you’re reading this column right now, you’re one of the most well-educated people on the planet about Apple stuff. But your friends, family, co-workers, and acquaintances? They might never know about flashy new operating-system features unless you personally show them off. It’s one of Apple’s most vexing problems: keeping devices relatively simple while also trying to make complex new features discoverable.</p>\n\n\n\n<h2>Lunch of discovery</h2>\n\n\n\n<p>My family spent the last few days attending my daughter’s college graduation. After a walk around a funky Oregon neighborhood, my wife and I dropped into a bakery restaurant for lunch. The place was busy, and we found a table and sat down, and waited for our order to arrive. I set my iPhone 14 Pro down on the table, and she gestured at the always-on lock screen, gently ribbing me for using nature pictures on my lock screen instead of pictures of our children.</p>\n\n\n\n<p>I explained that the lock screen is set to shuffle between nature photos in my library, based on machine learning, and it quickly became clear that she’d never tried to edit her lock screen, a feature introduced in iOS 16 last fall. (Also missing from her lock screen are another banner feature of iOS 16, lock screen widgets.)</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/08/iPhone-always-on-lock-screen.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPhone always on lock screen\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/08/iPhone-always-on-lock-screen.jpg?quality=50&amp;strip=all 1246w, https://b2c-contenthub.com/wp-content/uploads/2022/08/iPhone-always-on-lock-screen.jpg?resize=300%2C209&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/08/iPhone-always-on-lock-screen.jpg?resize=768%2C535&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/08/iPhone-always-on-lock-screen.jpg?resize=1200%2C836&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/08/iPhone-always-on-lock-screen.jpg?resize=1240%2C868&amp;quality=50&amp;strip=all 1240w\" width=\"1200\" height=\"836\" /><figcaption>iOS 16 introduced the always-on display, but do people really take advantage of it?</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>If you don’t read websites about Apple features, how are users supposed to intuit these changes? To edit a lock screen, you have to lock your phone and then long press on the lock screen–a pretty unnatural sequence of events.</p>\n\n\n\n<p>In iOS 17, Apple is introducing <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/wwdc23/10229&amp;xcust=1-1-1965112-1-0-0&amp;sref=https://www.macworld.com/feed\">a new feature for app developers called TipKit</a>, which brings a unified way for all apps to provide helpful advice about features their users may not miss. It’s a great idea, but Apple itself seems to really struggle when it comes to getting users to embrace new features.</p>\n\n\n\n<p>But it gets worse.</p>\n\n\n\n<h2>Face the music</h2>\n\n\n\n<p>Once I explained to her that she could literally create a lock screen that shuffled among photos of her kids, as identified by machine learning–not a set of images she selected herself–she was enthusiastic. Unfortunately, my next discovery was that Apple’s shiny new feature was backed by a bunch of rickety technologies that couldn’t rise to the challenge.</p>\n\n\n\n<p>To do a Photo Shuffle of people on the lock screen, you pick their faces from your Photos Library–but my wife had never spent any time in the People album in the Photos app on her iPhone, merging faces together and assigning them names. (Why would she? The People album is buried on iPhone. Name and face assignments don’t sync across a shared photo library, so all of my work classifying faces on my Mac don’t extend to her.)</p>\n\n\n\n<p>Worse, Photo Shuffle’s method of offering people to display appears utterly broken. It offered my wife a small number of faces, most of whom were completely random and fairly uncommon. She’s got hundreds, if not thousands, of pictures of me and our kids on her phone, and yet we weren’t among the faces offered. And if the faces you’re looking for aren’t in Photo Shuffle’s very small list of options, there’s no recourse. You’re stuck.</p>\n\n\n\n<p>So, off to Photos to spend five minutes doing a quick pass through her photo library to identify her family members by name, mark them as favorites, and clean things up by merging duplicate entries together. Unfortunately, whatever process provides the list of faces in Photo Shuffle apparently doesn’t get updated with any priority–when I came back to it at the end of our lunch, none of the family members had appeared in her Photo Shuffle options. So much for that clever idea.</p>\n\n\n\n<h2>How many apps?</h2>\n\n\n\n<p>The other thing I discovered at lunch was that, despite Apple’s innovations in iOS features over the last few years, my wife remained set in the behaviors she had learned when she started using the iPhone. In other words, Apple made changes to make the experience better–but they just never registered with her.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/ios14-app-library-hero.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOs 14 App Library\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/ios14-app-library-hero.jpg?quality=50&amp;strip=all 3950w, https://b2c-contenthub.com/wp-content/uploads/2021/04/ios14-app-library-hero.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2021/04/ios14-app-library-hero.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2021/04/ios14-app-library-hero.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2021/04/ios14-app-library-hero.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2021/04/ios14-app-library-hero.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2021/04/ios14-app-library-hero.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2021/04/ios14-app-library-hero.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption>The App Library was introduced with iOS 14, but how many “non-power” users know about it?</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>Let me get specific: this is about apps. My wife has pages and pages of apps on her home screen. We’re at a wedding, and there’s an app you need to download to contribute photos to the happy couple. It gets downloaded and stays forever. Need to pay to park in a new city? Download an app and keep it forever. And they’re all getting tacked on to the end of the last page of her home screen, forever.</p>\n\n\n\n<p>(In fact, she complained that she hated dragging apps she actually wanted all the way from the last page forward onto the first page. I pointed out that she could now hold the wiggling app with one finger while rapidly swiping with another in order to quickly change pages, which blew her mind–because she was still following the old behavior of dragging the app icon to the left side of the screen and waiting for the page to scroll. Another new feature she never knew about!)</p>\n\n\n\n<p>Turns out, she uses one or two pages of apps and searches for everything else. She’s got a few folders from back when she made an attempt to organize her phone, but at some point, she gave up and went to search. I ended up deleting several pages of her home screen and showing her how to use App Library.</p>\n\n\n\n<p>The truth is, her behavior–a page or two of key apps and then using search to find apps in the junk drawer–is probably the way most people use their iPhones. Apple knows it, which is why they added App Library and stopped requiring people to put every app they’ve downloaded somewhere on the home screen. But if my wife is any indication, that new feature just never registered.</p>\n\n\n\n<p>I don’t have any answers here. I recognize how hard a problem it is to make new iPhone features discoverable and how hard it is to change ingrained user behavior. The new TipKit APIs suggest that Apple continues to wrestle with the issue.</p>\n\n\n\n<p>In the meantime, I’ll keep writing (and Macworld will keep publishing) articles about what the new features are. And you, dear reader, will presumably share them with your friends and family. So far as I can tell, we may be the best way Apple has of getting its message out.</p>\n\niOS, iPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5da97cc95c37e2e43160aa484d670d653f48b4d8e08cee20e44ac83ea3b44e96","category":"Apple"}