{"title":"A sublime landscape: New model explains Pluto’s lumpy plains","link":"https://arstechnica.com/?p=1821388","date":1639747301000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/nh-mountainousshorline-800x863.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/nh-mountainousshorline.jpg\">Enlarge</a> <span>/</span> The polygons of Sputnik Planitium. (credit: <a href=\"https://www.nasa.gov/image-feature/the-mountainous-shoreline-of-sputnik-planum\">NASA/JHUAPL/SwRI</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Expectations for active geology on Pluto were pretty low prior to the arrival of the New Horizons probe. But the photos that came back from the dwarf planet revealed a world of mountains, ridges, and... strange lumpy things that don't have an obvious Earthly analog. One of the more prominent oddities was the plain of Sputnik Planitia, filled with nitrogen ice that was divided into polygonal shapes separated by gullies that were tens of meters deep.</p>\n<p>Scientists quickly came up with a partial explanation for these structures: convection, where heat differences cause deeper, warmer nitrogen ices to bubble through the soft material toward the surface. The problem is that the planet has no obvious sources of heat deep inside. Now, however, a group of European researchers is suggesting that the convection could be driven by surface cooling, rather than heat from the planet's interior. The secret is the sublimation of nitrogen ices directly into vapors.</p>\n<h2>Lacking heat</h2>\n<p>Explaining the formations on small, icy bodies like Pluto is difficult because scientists expect that they lack the heat sources that drive plate tectonics, like those on Earth. These icy bodies are small enough that any heat generated by the collisions that built them, and the dwarf planet, dissipated long ago. And they don't have enough metallic materials for radioisotopes to provide ongoing heat generation. The few exceptions to this, like Europa and Enceladus, are heated by gravitational interactions with the giant planets they orbit, but that's not an option for Pluto, either.</p></div><p><a href=\"https://arstechnica.com/?p=1821388#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1821388&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5dad39b0986b1da9d5f8f6e7b2f882f51f9f990a1df17649db88ef8dd1cadbc3","category":"Tech"}