{"title":"Xiaomi เปิดตัว HyperOS บอกว่าเป็นลูกผสมระหว่างลินุกซ์ และ Vela ระบบปฏิบัติการ IoT","link":"https://www.blognone.com/node/136431","date":1698379965000,"content":"<div><div><div><p>Xiaomi เปิดตัวระบบปฏิบัติการใหม่ HyperOS <a href=\"https://www.blognone.com/node/136255\">ตามนัดหมาย</a> โดยระบุว่าจะเป็นระบบปฏิบัติการเดียวสำหรับสินค้าทุกตัวของ Xiaomi ตั้งแต่อุปกรณ์พกพา รถยนต์ อุปกรณ์สมาร์ทโฮม ภายใต้วิสัยทัศน์ใหม่ของบริษัท \"Human x Car x Home\"</p>\n<p>มาถึงจุดนี้แล้วหลายคนอาจสงสัยว่าตกลงแล้วมันคือระบบปฏิบัติการอะไรกันแน่ คำอธิบายของ Xiaomi บอกว่าแกนหลักของมันใช้เคอร์เนลลินุกซ์ ผสมกับระบบปฏิบัติการ Xiaomi Vela ที่พัฒนาขึ้นเอง (Vela เป็นการนำ<a href=\"https://nuttx.apache.org/\">ระบบปฏิบัติการเรียลไทม์ Apache NuttX</a> สำหรับอุปกรณ์ IoT มาดัดแปลงต่อ โดย <a href=\"https://iot.mi.com/vela\">Xiaomi เปิดตัว Vela มาตั้งแต่ปี 2020</a>)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/9288cd05412e1c0e6ee8b3b6d248e46d.jpg\" /></p>\n<p>หลายคนอาจสงสัยต่ออยู่ดีว่า การนำเคอร์เนล 2 ระบบปฏิบัติการมารวมกันมันทำได้จริงๆ หรือ เรื่องนี้ Xiaomi ยังไม่ตอบตรงๆ สิ่งที่พออธิบายได้ดีที่สุดในขณะนี้คือ Lei Jun ซีอีโอได้โพสต์โชว์แผนภาพสถาปัตยกรรมของ HyperOS โดยส่วนของ Kernel เขียนไว้ว่า Linux + Xiaomi Vela ดังภาพ (ซึ่งก็ยังไม่ตอบคำถามอยู่ดี)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e949955f3ef726f3843672c46be90bea.jpg\" /></p>\n<blockquote><p>Our team of more than 5,000 researchers and developers have poured their heart into this project. I'm incredibly grateful for the team's exceptional efforts! <a href=\"https://twitter.com/hashtag/XiaomiHyperOS?src=hash&amp;ref_src=twsrc%5Etfw\">#XiaomiHyperOS</a> <a href=\"https://t.co/QEJFlkvBPy\">pic.twitter.com/QEJFlkvBPy</a></p>\n<p>— Lei Jun (@leijun) <a href=\"https://twitter.com/leijun/status/1716764952013451688?ref_src=twsrc%5Etfw\">October 24, 2023</a></p></blockquote>\n<p>จุดนี้ชวนให้สงสัยว่า ตกลงแล้ว HyperOS คือ \"ชุด\" ของระบบปฏิบัติการ 2 ตัวภายใต้แบรนด์เดียวกันหรือไม่ ดังเช่น <a href=\"https://www.blognone.com/node/123024\">HarmonyOS ของ Huawei ที่จริงๆ แล้วมันคือ Android และ LiteOS ภายใต้แบรนด์เดียวกัน</a></p>\n<p>ข้อมูลอื่นของ HyperOS ตามที่แสดงไว้บนหน้าเว็บของ Xiaomi เองได้แก่</p>\n<ul>\n<li>เริ่มพัฒนามาตั้งแต่ปี 2017 โดยมีเป้าหมายคือเชื่อมระบบ IoT เข้าด้วยกันเป็นระบบเดียว</li>\n<li>รองรับโปรเซสเซอร์กว่า 200 แบบ, ระบบไฟล์ 20 แบบ, ครอบคลุมอุปกรณ์หลายร้อยชนิด และรุ่นย่อยหลายพัน SKU</li>\n<li>ทำงานกับแรมหลายขนาด ตั้งแต่ 64KB ไปจนถึง 24GB</li>\n<li>รองรับการทำงานแบบโมดูล ตัดมาเฉพาะส่วนที่ใช้งานกับฮาร์ดแวร์นั้นๆ ทำให้ระบบปฏิบัติการมีขนาดเล็ก ตัวอย่างที่ยกมาคือ 8.75GB บนสมาร์ทโฟน</li>\n<li>ปรับแต่งประสิทธิภาพมาดี กินทรัพยากรน้อย เล่นเกมบนสมาร์ทโฟนได้ลื่นกว่า เฟรมเรตนิ่งกว่า กินพลังงานน้อยกว่าบน Stock Android (เขียนแบบนี้จริงๆ)</li>\n<li>มีฟีเจอร์ชื่อ HyperConnect ให้อุปกรณ์ต่างๆ สื่อสารกันเอง ควบคุมและสั่งการอุปกรณ์ได้ง่าย ตัวอย่างที่ยกมาคือ ดูกล้องในรถจากมือถือ, ควบคุมกล้องหลังสมาร์ทโฟนจากโน้ตบุ๊ก รองรับการแจ้งเตือน การรันแอพ การคัดลอก clipboard ข้ามอุปกรณ์</li>\n<li>ฟีเจอร์ด้าน AI ชื่อ HyperMind คาดเดาความต้องการของผู้ใช้งาน เช่น เปิดไฟในห้องให้อัตโนมัติหลังปลดล็อกประตูห้อง</li>\n<li>ฟีเจอร์ด้านความปลอดภัย มีระบบปฏิบัติการความปลอดภัย trusted execution environment (TEE) แยกจากระบบปฏิบัติการหลัก ช่วยป้องกันข้อมูลสำคัญ</li>\n</ul>\n<p>HyperOS จะถูกใช้งานในสินค้าใหม่ของปีนี้ ได้แก่ Xiaomi 14 Series, Xiaomi Watch S3, Xiaomi TV S Pro 85\" miniLED เป็นต้น</p>\n<p>เว็บไซต์ Xiaomi ไม่พูดถึงความเข้ากันได้ของ HyperOS กับ Android (มีแต่คำว่าลินุกซ์ ไม่มีคำว่า Android) ส่วน <a href=\"https://www.theverge.com/2023/10/26/23933855/xiaomi-14-pro-launch-china-hyper-os-camera-price\">เว็บไซต์ The Verge</a> เรียก HyperOS ที่อยู่ในมือถือ Xiaomi 14 ว่าเป็น \"a new Android skin\"</p>\n<p>ที่มา - <a href=\"https://www.mi.com/global/discover/article?id=3047\">Xiaomi</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/xiaomi\">Xiaomi</a></div><div><a href=\"/topics/operating-system\">Operating System</a></div><div><a href=\"/topics/linux\">Linux</a></div><div><a href=\"/topics/internet-things\">Internet of Things</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5db0176da76966b063d169243e6aeca741aa54b087b679317376a885c0fa7e83","category":"Thai"}