{"title":"Demand for mental health support services among health professionals in Vietnam: Lesson from COVID-19 Pandemic","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305869","date":1719237600000,"content":"<p>by Nguyen Hoang Thanh, Than Manh Hung, Tran Nguyen Ngoc, Bui Van San, Doan Quoc Hung, Nguyen Dinh Hung, Vu Duc Binh, Le Hong Trung, Le Van Tinh, Nguyen Thanh Nam, Pham Huy Tan, Pham Tran Anh Khoa, Pham Ngoc Thach, Nguyen Tuan Khanh, Cao Duc Chinh, Nguyen Vu Trung, Tran Thi Mai Thi, Pham Ba Hien, Tran Anh Long, Nguyen Van Thuong, Nguyen Van Thanh, Tran Xuan Thang, Lai Duc Truong, Vu Quang Hieu, Satoko Otsu</p>\r\nBackground <p>This study aimed to measure the preferences for mental health support among health professionals, their willingness to support the mental health of colleagues and associated factors.</p> Method <p>A descriptive cross-sectional study was performed from August to October 2022 within five hospitals located in Hanoi, Vietnam. A total of 244 health professionals participated in the study. Data on socio-economic status, health and COVID-19-related characteristics, Depression Anxiety Stress Scale (DASS-21); and preferences for mental health support services were collected by using a structured self-reported questionnaire. Multivariate logistic regression models were utilized to identify associated factors with the demand for mental support services.</p> Results <p>13.9%, 17.1% and 8.6% reported having at least mild depression, anxiety and stress, respectively. There 13.9% did not seek any mental health support during the COVID-19 pandemic. The most common support included talking with friends (52.9%), family (50.8%), colleagues (47.6%) and using social networks/Internet (43.5%). There 31.1% had been aware of mental health services, but only 18.0% used this service at least once. Regarding preferences, 47.3% had a demand for mental support services, and the most preferred service was providing coping skills (25.9%), followed by skills to support others against mental problems (22.2%). Major sources of support included psychiatrists (34.4%), colleagues (29.1%) and family (27.9%). The main preferred channels for support included telephone/mobile phone (35.7%) and Internet (20.9%). Only 12.3% were willing to provide mental support for colleagues during the pandemic. Age, education, perceived mental health status, ever seeking any mental service, and DASS-21 depression score were associated with demand for mental support services.</p> Conclusion <p>This study found a lack of awareness of mental health services for health professionals, as well as moderate levels of demand for this service in this population. Raising awareness and developing tailored mental health support services are important to enhancing the mental well-being of health professionals in Vietnam to prepare for the next pandemic.</p>","author":"Nguyen Hoang Thanh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5dbeb8694ebcba41325dd41a2a697085aa0fb5fc5318267c0d567e09680ae8aa","category":"Interdisciplinary"}