{"title":"Ranking the top-5 Milan-San Remo raids","link":"https://www.cyclingtips.com/2023/03/ranking-the-top-5-milan-san-remo-raids/","date":1679316930000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1474379207.jpg?width=1200\" alt=\"Ranking the top-5 Milan-San Remo raids\" /></figure><p>Mathieu van der Poel pulled off a dramatic heist Saturday at Milan-San Remo in what’s the latest in a growing list of race-breaking raids at the Italian monument.</p>\n<p>The script is changing at the Italian monument, and Van der Poel wasn’t going to try his luck in a sprint. He attacked over the top off the Poggio, and then picked and danced the way to the Via Roma to win in exulting fashion.</p>\n<p>Milan-San Remo is a race that’s seeing an interesting rewrite of its winning blueprint over the past two decades.</p>\n<p>For years, Milan-San Remo was the “sprinter’s classic,” one that Erik Zabel and Óscar Freire could win on numerous occasions, and that every sprinter from Mario Cipollini to Alessandro Petacchi would mark on their calendars.</p>\n<p>Hyped as the easiest race to finish, yet the hardest to win, San Remo is a unique race on the calendar that’s open to a wide spectrum of riders.</p>\n<p>What makes San Remo so alluring is that it is one of the few races on the calendar where riders like grand tour riders Tadej Pogačar will be facing off against the likes of Belgian barnstormer Wout van Aert, pure sprinter Caleb Ewan, downhill daredevil Matej Mohorič, time trial man Filippo Ganna, and Ardennes wizard Julian Alaphilippe.</p>\n<p>And any one of them would have legitimate chances of victory.</p>\n<p>The course hasn’t changed in decades since the Poggio and the Cipressa were included in the 1960s and 1980s, respectively. What has changed is how the course is raced.</p>\n<p>Because the Cipressa-Poggio combo isn’t demanding enough to create a natural selection, riders and teams have tried different things over the years to try to break the sprinter’s stranglehold on the race.</p>\n<p>In fact, it’s been since 2016 that the last pure sprinter with Arnaud Démare won down the Via Roma. There’s been a different winner every year since Óscar Freire won his last of three titles in 2010.</p>\n<p>Every year riders attack at different points on both sides of the Poggio to try to disrupt the sprinter’s train.</p>\n<p>That tug-of-war between sprinters and attackers is what makes San Remo must-see TV.</p>\n<p>Van der Poel’s impeccable victory Saturday is the latest in a string of San Remo raiders. How does his stack up to the top attackers over the past 15 years? Let’s dig in.</p>\n<h2>5. Simon Gerrans — 2012</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-141490022.jpg?width=730\" alt width=\"1024\" height=\"825\" /><figcaption><span>Gerrans came past Cancellara to claim victory.</span> (Photo: Bryn Lennon/Getty Images)</figcaption></figure>\n<p>The Australian didn’t win a lot across his career, but when he did, they were big ones.</p>\n<p>In what was GreenEdge’s premier season, Gerrans was a student of the game who was paying close attention to how San Remo was being raced and won.</p>\n<p>In just his second start at La Primavera, Gerrans followed the attacking Fabian Cancellara and Vincenzo Nibali over the top of the Poggio. There was quite a stir at the time over accusations that Gerrans simply sucked Cancellara’s wheel as Spartacus powered down the Poggio, and pipped him in the sprint.</p>\n<p>A closer look revealed that Gerrans took a few key pulls that assured that the leading trio would arrive to fend off the fast-charging peloton led by Peter Sagan. Nibali knew he had no chance, but Gerrans snatched the win that took a mix of guts and measured smarts.</p>\n<h2>4. Jasper Stuyven — 2021</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1231828572.jpg?width=730\" alt width=\"1024\" height=\"683\" /><figcaption><span>Stuyven fended off the bunch by a whisker.</span> (Photo: TOMMASO PELAGALLI/AFP via Getty Images)</figcaption></figure>\n<p>The Belgian nearly man secured his biggest win of his career by deciding not to wait for the sprint and to take his chances.</p>\n<p>The big classics bruiser made it over the top of the Poggio with the elite group, and used his pure brawn to power away on the descent. It was a highly risky move, but one taken straight out of the Cancellara play book.</p>\n<p>Riding alone can often help riders carry more speed through the corners than a chasing group, and Stuyven used to his advantage carve out the most slender of leads. The Trek-Segafredo man held on by a whisker to post up as a desperate Caleb Ewan threw his bike across the line.</p>\n<h2>3. Vincenzo Nibali — 2018</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-933058552.jpg?width=730\" alt width=\"1024\" height=\"683\" /><figcaption><span>Nibali had time to sit up and celebrate his solo victory.</span> (Photo: MARCO BERTORELLO/AFP via Getty Images)</figcaption></figure>\n<p>The Italian grand tour star also sensed he could pull a San Remo raid.</p>\n<p>Third place in 2012 opened his eyes to the new tactical playbook that was creeping into the peloton. The “Shark of Messina” knew he’d stand no chance against the sprinters or even a reduced bunch sprint, so he bolted clear near the top of the Poggio.</p>\n<p>Renowned as one of the best descenders in the peloton, Nibali dropped like a rock to keep the chasing peloton at bay.</p>\n<p>His gap was big enough that he could celebrate his win in the closing meters as Caleb Ewan once again would be stymied at the line.</p>\n<h2>2. Matej Mohorič — 2022</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1239325368-2.jpg?width=730\" alt width=\"1024\" height=\"683\" /><figcaption><span>Mohorič used a dropper post to dive to victory in 2022.</span> (Photo: MARCO BERTORELLO/AFP via Getty Images)</figcaption></figure>\n<p>Perhaps inspired by Nibali’s theatrics, the Slovenian downhill demon also used his superb descending skills to press the advantage.</p>\n<p>Deploying a dropper-post, a device that lowers the seat height most commonly used in mountain biking, Mohorič attacked out of an elite group after cresting the Poggio. After barreling through the upper switchbacks, Mohorič opened up a few seconds on the chasers that would prove decisive.</p>\n<p>The Slovenian dipped and carved his way through the steepest part of the Poggio, barely missing out on crashing on a few occasions. Racing on his absolute limit, Mohorič hit the red kite with the reduced bunch breathing down his neck.</p>\n<p>Mohorič kept it upright to win after one of San Remo’s most spectacular downhill attacks.</p>\n<h2>1. Fabian Cancellara — 2008</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-990384240.jpg?width=730\" alt width=\"1024\" height=\"680\" /><figcaption><span>Cancellara was among the first riders in a new generation who dared to rewrite the San Remo script.</span> (Photo: Tim De Waele/Getty Images)</figcaption></figure>\n<p>Fabian Cancellara was the first of a new generation of riders to challenge the sprinters’ grip on the Italian monument.</p>\n<p>Matching his unbridled power and elite bike-handling skills, Cancellara would become the rider who helped to break the mold on how San Remo could be race and how it might be won.</p>\n<p>A relatively big group powered over the Poggio, and sensing that he could have a chance on the descent, Cancellara surged to the front and attacked near the bottom of the Poggio to carry momentum onto the flats.</p>\n<p>At the time, Cancellara was coming off back-to-back world time trial championships, and he turned on the turbos to open a five-second gap on the desperately chasing sprinters. His burst of speed and power carried him to the line for his lone San Remo win, though he’d knock on the door a few more times, with three more subsequent second places.</p>\n<p>Cancellara’s raid set the tone that continues to be the model for how to race and win Milan-San Remo, the easiest monument to finish, but the hardest to win.</p>","author":"Andrew Hood","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"5dc81b28386fc20fe8ae4585e2529a6c0c8715787f033c58bbbafc9fc2ea782b","category":"Cycling"}