{"title":"Tour of Britain 2021: British Conti teams have plenty to play for","link":"https://www.cyclist.co.uk/in-depth/10048/tour-of-britain-2021-british-conti-teams-have-plenty-to-play-for","date":1630597331000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>4 Sep 2021</span></div>    </div></div><p>\nAll five home UCI Continental teams in the field after disrupted domestic season</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/09/ribble_weldtite.jpg?itok=-QnkDgCf\" />  </div>\n<div>\n      <p> <strong>Photo</strong>: Ribble Weldtite Pro Cycling</p>\n<p>A frequent sight at the Tour of Britain is that of the British UCI Continental teams lighting it up at the head of the race, jumping into breakaways and racking up points in the jersey competitions.</p>\n<p>One different aspect this year is the way in which they have taken to the start line. Usually their classification process is through points accumulated through finishing positions at various races throughout the season, or ‘rounds’ – a scenario which will return in 2022.</p>\n<p>For example, in 2018 such events included the Chorley Grand Prix, Rutland-Melton CiCLE Classic, Tour de Yorkshire, Tour Series and the Lincoln Grand Prix. JLT Condor qualified through 49 points, with ONE Pro Cycling and Madison Genesis on 42 and Canyon Eisberg on 39.</p>\n<p>Unfortunately three of those four teams are no longer in existence, though others have risen to the fore. At the Tour of Britain this year will be Canyon dhb SunGod (formerly Canyon Eisberg), Ribble Weldtite Pro Cycling (pictured above), Saint Piran, SwiftCarbon Pro Cycling and Trinity Racing.</p>\n<p>Organisers Sweetspot and British Cycling invited all five of the British UCI Continental teams due to the lack of racing opportunities caused by the Covid-19 pandemic.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/913/tour-of-britain-route-riders-live-tv-guide-all-you-need-to-know\">Tour of Britain 2021: Route, teams and all you need to know</a></div>      <div><a href=\"/news/10035/how-to-watch-tour-of-britain-tv-coverage-2021\">How to watch Tour of Britain: TV Coverage 2021</a></div>    </div></div><p>\nDescribing their preparation for the Tour of Britain, SwiftCarbon Pro Cycling Team Principal Carolyn Nelson revealed they were each asked to complete at least one UCI race beforehand. But their early season plans were scuppered after the stage races of Tour of Normandie and Loir et Cher e Provost alongside one-day events in Belgium and Holland were cancelled.</p>\n<p>‘It’s fair to say it’s been a very different year. We held a number of team training camps and meet ups at our Yorkshire base, and these have provided opportunities for the team to get to know one another and ride together. Not the same as racing, but the best alternative given the situation.</p>\n<p>‘Through our links with Portugal – our principal sponsor, SwiftCarbon is based in Porto – we received invites to the Volta ao Alentejo and the Volta a Portugal Santander.</p>\n<p>‘Just as we were about to set off for Alentejo, the travel rules changed. Portugal moved from a green to an amber country, and one of the team tested positive for Covid so we had to withdraw.</p>\n<p>‘We successfully took part in the 12-day Volta a Portugal Santander in August. However, competing against World Tour and Pro Tour teams who have been racing since early spring, in the searing heat of Portugal with a hilly parcours was always going to be tough, but we returned home with lots of great racing in the legs.’</p>\n<h3>Team effort</h3>\n<p>Ribble Weldtite Pro Cycling Team Principal Tom Timothy also explained their preparation for the Tour of Britain through races in Norway and Slovenia before the start line in Cornwall, championing the importance of the team staff effort too.</p>\n<p>‘Coronavirus has made things difficult, but we’ve really made sure to give the riders a calendar that will prepare them for the race, competing in events like the Tour of Norway and Tour of Slovenia.</p>\n<p>‘It’s a testament to our back room staff how smoothly this has all gone with guys like Colin Sturgess and James Huntly helping on the road and it’s been a real team effort. ‘</p>\n<p>Also in Cornwall as the Tour of Britain kicks off will be the county’s home team, Saint Piran. Given that fact, expect to see them making a noise in the opening stages.</p>\n<p>The first day is a 180km route out of Penzance that surely has their name all over it in terms of being in the breakaway at least. The riders will scale three category three climbs and two intermediate sprints before the finish in Bodmin.</p>\n<p>‘It’s our moment in the sun so we will be burning a few matches in the first few days. Visibility is key for us, but the standard is so high these days.</p>\n<p>‘The Tour of Britain is tough. I feel proud we are giving Steve Lampier his dream, a Cornish rider on Cornish roads in a world class event.’</p>\n<p>Ribble Weldtite Pro Cycling, Saint Piran and Trinity Racing will all be making their debuts at the race. A lot of discourse surrounding Continental teams rubbing shoulders with their WorldTour compatriots is centred around what they can learn from those higher up in the ranks.</p>\n<p>On the flipside, however, there’s still a lot that can be shared both ways. James Shaw will be alongside his Ribble Weldtite Pro Cycling teammates, fresh from his impressive fifth place positions on general classification standings at Norway and Slovenia alongside World Tour opposition. </p>\n<p>Tom Timothy said, ‘I think as a team we obviously had limited resources compared to a World Tour team, but conversely that means we really make sure to get the absolute best out of everything we have. I think this approach has really paid dividends, highlighted by James Shaw’s results in both the Tour of Norway and Slovenia, beating World Tour opposition with a hire car in the convoy due to Covid travel restrictions!’</p>\n<p>When asked on what they’re looking forward to the most, Carolyn Nelson cited the fans and – not to jinx it – potentially the weather.</p>\n<p>‘We’re looking forward to the support of the fans who we’ve sorely missed. There is nothing more spine-tingling than being in the team car following the race up epic climbs. I am also looking forward to the predicted heat wave, as our time in Portugal means we’ve already had some good acclimatisation to racing in hot conditions.’</p>\n<p>The Tour of Britain will hopefully run more smoothly than a hire car in the team convoy, but one thing is for sure. The British UCI Continental teams may be lining up on 5<sup>th</sup> September after a completely different year than normal, but for those making their debut or arriving once more, they can’t wait to get going.</p>\n<p>And also, never underestimate them. Leave them on too loose a leash at your own peril… </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/events\">Events</a></div>    </div></div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"5dc9d42216845c2272605911b525457af01fd2d0a538f52536d7b762423c57e8","category":"Cycling"}