{"title":"A Physicochemical Framework for Saturated-Unsaturated Behavior of Low Plasticity Compacted Clays","link":"http://link.springer.com/10.1007/s10706-023-02655-7","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>This research develops a physicochemical framework to understand the saturated–unsaturated behavior of low plasticity compacted clays. Test results indicate that matric suction covers the entire range of the water retention curve thereby allowing the determination of air entry and residual suction values. In contrast, osmotic suction is operative within a limited range such that it increased eight-fold and bounced back to a lower value. The swell-shrink path is a <em>j</em>-shaped curve for deionized water and has two cascading <em>j</em>-shaped curves for concentrated brine. The identical paths from 100 to 70% saturation are due to osmotic-induced consolidation whereas the remainder is governed by matric suction. On the contrary, transient swelling exhibits <em>s</em>-shaped curves for both fluids and comprises initial (ion hydration to develop a diffuse double layer), primary (formation of water menisci within the soil pores), and secondary (saturation of some clay particles in smaller pores) stages. Furthermore, the effect of pore fluid on consolidation is subdued as indicated by the compression index (0.13) and the rebound index (0.04). During consolidation, hydraulic conductivity decreased showing an initial steep slope (0.16) and a final mild slope (0.06); values for concentrated brine were lower than the deionized water by five times and ten times, respectively. The identical stress–strain trends showed no distinct peaks and values for concentrated brine were ~ 12% higher than those with deionized water. These findings illustrate that physicochemical interactions in low plasticity compacted clays govern the two independent stress state variables (applied stress and soil suction) thereby affecting soil behavior.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"5de00d8cf37085a9564687335179e1ebd55afba150668f46a6d420013379aadc","category":"Environment"}