{"title":"Getting to the bottom of how red flour beetles absorb water through their butts","link":"https://arstechnica.com/?p=1926094","date":1703683858000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/beetle-butt-TOP-800x536.jpg\" alt=\"Who &lt;em&gt;doesn't&lt;/em&gt; thrill to the sight of a microscopic cross-section of a beetle's rectum? You're welcome.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/beetle-butt-TOP.jpg\">Enlarge</a> <span>/</span> Who <em>doesn't</em> thrill to the sight of a microscopic cross-section of a beetle's rectum? You're welcome. (credit: Kenneth Veland Halberg)</p>  </figure>\n\n\n\n\n      <p><em>There's rarely time to write about every cool science-y story that comes our way. So this year, we're once again running a special Twelve Days of Christmas series of posts, highlighting one science story that fell through the cracks in 2023, each day from December 25 through January 5. Today: red flour beetles can use their butts to suck water from the air, helping them survive in extremely dry environments. Scientists are honing in on the molecular mechanisms behind this unique ability.</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p>The humble <a href=\"https://en.wikipedia.org/wiki/Red_flour_beetle\">red flour beetle</a> (<em>Tribolium castaneum</em>) is a common pantry pest feeding on stored grains, flour, cereals, pasta, biscuits, beans, and nuts. It's a remarkably hardy creature, capable of surviving in harsh arid environments due to its unique ability to extract fluid not just from grains and other food sources, but also from the air. It does this by opening its rectum when the humidity of the atmosphere is relatively high, absorbing moisture through that opening and converting it into fluid that is then used to hydrate the rest of the body.</p>\n<p>Scientists have known about this ability for more than a century, but biologists are finally starting to get to the bottom (ahem) of the underlying molecular mechanisms, according to a <a href=\"https://www.pnas.org/doi/10.1073/pnas.2217084120\">March paper</a> published in the Proceedings of the National Academies of Science. This will inform future research on how to interrupt this hydration process to better keep red flour beetle populations in check, since they are highly resistant to pesticides. They can also withstand even higher levels of radiation than the cockroach.</p></div><p><a href=\"https://arstechnica.com/?p=1926094#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1926094&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5de0a7efa1cfa9a0fcfc41af5c9b93eedeb2f8b983b2f7ab942b70f5f0c4e2a5","category":"Tech"}