{"title":"Energy Literacy and Justice: The Path to Inclusivity","link":"https://www.preprints.org/manuscript/202405.1920/v1","date":1716961228000,"content":"This study explores the crucial roles of energy literacy, transition, and justice in addressing the global climate crisis. Through a systematic bibliometric survey and thematic analysis of existing literature, we identify a scarcity in research (&lt;0.1%, n = 17,773) concurrently integrating the three crucial terms: energy literacy; energy transition; and energy justice. This study emphasizes the importance of energy literacy in empowering societies to make informed decisions, which is essential for facilitating equitable energy transitions and achieving sustainability goals. We delve into the interconnections between energy literacy and energy justice, proposing the integration of these concepts into educational systems, including social media platforms to foster an understanding of energy systems, their environmental impacts, and socio-economic implications. Emphasizing the strategic use of social media, the study also introduces the ‘COMPEL Justice’ framework—Communities Prepared for Energy Literacy and Justice—which aims to enhance public engagement and participation in energy transition initiatives. By analyzing publications from various academic and governmental sources, we provide insights into the challenges and opportunities that lie in promoting energy literacy and justice, particularly in the context of global efforts to mitigate climate change and enhance energy equity. Finally, exemplary application and implications associated with the adoption of the proposed framework within the context of oil-producing regions (e.g., Louisiana in the United States) are presented.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5debc3466b8016032aaa4de97b3aed6d9c3edc6ab55a1b9f7ecb9508e7d78dda","category":"Interdisciplinary"}