{"title":"PSVI-20 The effect of a probiotic feed additive on average daily gain and feed intake","link":"https://academic.oup.com/jas/article/102/Supplement_2/318/7664708?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Probiotic feed additive use in the swine industry has become increasingly popular as a substitute for antibiotic feed additives. This is due to the overuse of antibiotics in swine diets that has led to antibiotic residues in animal products and bacterial resistance. For this reason, we decided to feed a probiotic to prevent illnesses associated with the transition from the nursery to finisher phase. The objective of this study was to determine the effect that Fastrack probiotic had on the health and performance of post-weaning feeder pigs. The trial was conducted using feeder pigs weighing 39 kg ± 2.2 kg. To evaluate the effect of the probiotic on health, average daily gain, and feed intake, a contemporary group of pigs was split evenly into two pens. The pigs were housed in an outdoor pen with ad libitum access to water and feed coming from a Smidley automatic feeder. The feeders were filled once a week, and the pens were sanitized using the farms SOP for pen sanitation. The pigs were on trial for a total of 45 d with general health observations taken daily and body weights measured on d 0, 23, and 45. The results showed that the pigs in the probiotic pen were healthier throughout the duration of the trial with fewer individual treatments recorded. Also, there was a numerical difference in the average daily gain of the probiotic group compared with the control, with the probiotic group weighing approximately 0.45kg more than the control. There was no difference in the feed conversion rate of the pens.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5deb8fac16193e28d54fbdf2e76ce5277ba071cac7af8e01da8f7f1fe977396b","category":"Environment"}