{"title":"Sam Bennett to leave Deceuninck-Quick-Step","link":"https://cyclingtips.com/2021/05/sam-bennett-to-leave-deceuninck-quick-step/","date":1620558937000,"content":"<p>Deceuninck-Quick-Step team manager Patrick Lefevere confirmed today that Sam Bennett will leave the team at the end of the season after both parties were unable to reach an agreement financially, Wielerflits reports.</p>\n\n\n\n<p>According to Lefevere, the financial demands from the Bennett camp were too much. “He doesn’t want to leave, but I don’t have as much money as certain people,” the Belgian team manager told Wielerflits from Italy at the Giro d’Italia.</p>\n\n\n\n<p>“It used to be two days of negotiations during TDF but now I am under siege by managers for two days. I had to go from meeting to meeting. Whether it is purely a matter of money? You should ask him (Bennett, ed.) “Maybe his manager wants that [more money]”, says Lefevere. The door is now permanently closed.</p>\n\n\n\n<p>“At a certain point I cannot be convinced anymore. I have to flip the switch. The fact that these types of riders leave is life. As pros they have to earn as much money as possible. But look at the sprinters who left us. Some riders come walking back, ” referring to Mark Cavendish.</p>\n\n\n\n<p>The 30-year-old Irishman signed a contract with the Deceuninck-Quick-Step at the end of 2019 and has since taken 14 professional victories. Last year he won two stage victories and the green jersey at the Tour de France, and this year Bennett already produced seven wins, including two at <a href=\"http://Lefevere already announced in his regular column for Het Nieuwsblad on Saturday that João Almeida\" target=\"_blank\">Volta ao Algarve</a> last week. </p>\n\n\n\n<p>Lefever also confirmed in his Saturday in his Nieuwsbad column that Joao Almeida will also leave the team at the end of the season.</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/sam-bennett-to-leave-deceuninck-quick-step/\">Sam Bennett to leave Deceuninck-Quick-Step</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"CyclingTips","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"5dec55052ba25d4af4cebd9be00eb6df998728dff767ff5569141d765533be58","category":"Cycling"}