{"title":"With NASA’s mobile launcher on the move, here’s a road map to Artemis II","link":"https://arstechnica.com/?p=1961382","date":1692358202000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/ml1-1-800x595.jpg\" alt=\"NASA's mobile launcher for the first three Artemis Moon missions.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/ml1-1.jpg\">Enlarge</a> <span>/</span> NASA's mobile launcher for the first three Artemis Moon missions. (credit: Stephen Clark/Ars Technica)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>NASA's repaired and upgraded mobile launch platform moved back to its launch pad at the Kennedy Space Center this week. This marks a transition from refurbishment after the launch of the Artemis I mission last year into preparations for Artemis II—the Moon program's first flight with astronauts.</p>\n<p>The giant structure sustained <a href=\"https://arstechnica.com/science/2022/11/nasas-new-rocket-blows-the-doors-off-its-mobile-launch-tower/\">more damage than expected</a> during the first launch of NASA's Space Launch System rocket last November. The 380-foot-tall (116-meter) launch tower has been parked just north of the iconic Vehicle Assembly Building since January, undergoing repairs and modifications to prepare it for its next use on Artemis II.</p>\n<p>That work is now largely complete, and NASA's Apollo-era crawler-transporter began moving the launch platform back to Launch Complex 39B on Wednesday for about four months of testing. Then, if all goes well, NASA will declare the structure ready for stacking of the SLS Moon rocket for Artemis II.</p></div><p><a href=\"https://arstechnica.com/?p=1961382#p3\">Read 42 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1961382&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5dee8deec8c795cbd8f42990f85bfd72fa40d565013843c3f0f4e755f3526470","category":"Tech"}