{"title":"Notebookcheck ตั้งคำถาม ทำไม ThinkPad รุ่นแพง คีย์บอร์ดถึงห่วยลงเรื่อยๆ","link":"https://www.blognone.com/node/122820","date":1621826837000,"content":"<div><div><div><p>เว็บไซต์รีวิวโน้ตบุ๊กชื่อดัง Notebookcheck ออกมาวิจารณ์แนวทางของ Lenovo ที่ปรับคีย์บอร์ดของ ThinkPad รุ่นใหม่ๆ ให้มีระยะกดปุ่ม (key travel) สั้นลง จากเดิม 1.8 มิลลิเมตรมาเหลือ 1.5 มิลลิเมตร ส่งผลต่อประสิทธิภาพของการพิมพ์</p>\n<p>Notebookcheck ตั้งข้อสังเกตว่าทิศทางของ Lenovo จะปรับระยะกดปุ่มให้สั้นลง เฉพาะใน ThinkPad รุ่นราคาแพงคือ X1 Carbon (เริ่มใน Gen 7 ส่วน <a href=\"https://www.blognone.com/node/120526\">Gen 9 ตัวล่าสุด</a>ยังเท่าเดิม แถมปรับความสูงและขนาดปุ่มบางปุ่มให้ลดลง) ส่วน ThinkPad X1 Extreme รุ่นปัจจุบัน (Gen 3) ยังเป็นระยะ 1.8 มิลลิเมตรอยู่ แต่คาดว่ารุ่นหน้า Gen 4 จะลดมาเหลือ 1.5 มิลลิเมตรเช่นกัน ในขณะที่รุ่นราคาถูกกว่าคือซีรีส์ T หรือ L กลับยังใช้คีย์บอร์ดตัวเดิมอยู่</p>\n<p>Notebookcheck บอกว่าในเครื่องที่มีขนาดเล็กหรือบางมากๆ อย่าง <a href=\"https://www.blognone.com/node/118710\">ThinkPad X1 Nano</a> หรือ <a href=\"https://www.blognone.com/node/120524\">X1 Titanium Yoga</a> การลดระยะคีย์บอร์ดเป็นสิ่งที่ยอมรับได้ แต่ความหนาของ X1 Carbon แทบไม่เปลี่ยนแปลงเลยในช่วงหลัง จึงเกิดคำถามว่าทำไม Lenovo ถึงต้องลดระยะกดปุ่มลง ทางเว็บไซต์ยังเสนอว่าถ้าเพิ่มความหนาของเครื่องอีกเล็กน้อย แลกกับการกดปุ่มที่ดีขึ้น ลูกค้ากลุ่มนี้น่าจะชอบมากขึ้นด้วยซ้ำ ส่วนลูกค้าที่อยากได้บางมากๆ ก็มีทางเลือกใหม่คือ X1 Nano แทนแล้ว</p>\n<p>ผู้เขียนบทความสรุปว่า คีย์บอร์ดของ ThinkPad รุ่นใหม่ๆ ยังถือว่าดีอยู่ และดีกว่าโน้ตบุ๊กยี่ห้ออื่นๆ แต่ประเด็นสำคัญคือ ถ้าเทียบกับรุ่นเก่าแล้วคุณภาพแย่ลง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d8fcbadebba3f533bc928ea9c185ff4e.jpg\" /></p>\n<p>ThinkPad X1 Carbon Gen 9 ภาพจาก Lenovo</p>\n<p>ที่มา - <a href=\"https://www.notebookcheck.net/Why-does-Lenovo-sabotage-its-flagship-ThinkPad-X1-series.540479.0.html\">Notebookcheck</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/thinkpad\">ThinkPad</a></div><div><a href=\"/topics/notebook\">Notebook</a></div><div><a href=\"/topics/keyboard\">Keyboard</a></div><div><a href=\"/topics/lenovo\">Lenovo</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5e1207678d622ee013a82f2520ae06133c16baa666f39856ac860032925b3da4","category":"Thai"}