{"title":"The doodle dilemma: How the physical health of ‘Designer-crossbreed’ Cockapoo, Labradoodle and Cavapoo dogs’ compares to their purebred progenitor breeds","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306350","date":1724853600000,"content":"<p>by Gina T. Bryson, Dan G. O’Neill, Claire L. Brand, Zoe Belshaw, Rowena M. A. Packer</p>\r\n\r\nBooming UK ownership of designer-crossbreed dogs resulting from intentional crossing of distinct purebred breeds is often motivated by perceived enhanced health, despite limited evidence supporting a strong ’hybrid vigour’ effect in dogs. Improved evidence on the relative health of designer-crossbreed dogs could support prospective owners to make better acquisition decisions when choosing their new dog. This study used a cross-sectional survey of UK owners of three common designer-crossbreeds (Cavapoo, Cockapoo, and Labradoodle) and their progenitor breeds (Cavalier King Charles Spaniel, Cocker Spaniel, Labrador Retriever, and Poodle) to collect owner-reported health disorder information. The authors hypothesised that designer-crossbred breeds have lower odds of common disorders compared to their progenitor breeds. Multivariable analysis accounted for confounding between breeds: dog age, sex, neuter status, and owner age and gender. The odds for the 57 most common disorders were compared across the three designer-crossbreeds with each of their two progenitor breeds (342 comparisons). Valid responses were received for 9,402 dogs. The odds did not differ statistically significantly between the designer-crossbreeds and their relevant progenitor breeds in 86.6% (n = 296) of health comparisons. Designer-crossbreeds had higher odds for 7.0% (n = 24) of disorders studied, and lower odds for 6.4% (n = 22). These findings suggest limited differences in overall health status between the three designer-crossbreeds and their purebred progenitors, challenging widespread beliefs in positive hybrid vigour effects for health in this emerging designer-crossbreed demographic. Equally, the current study did not suggest that designer-crossbreeds have poorer health as has also been purported. Therefore, owners could more appropriately base acquisition decisions between designer-crossbreeds and their purebred progenitors on other factors important to canine welfare such as breeding conditions, temperament, conformation and health of parents.","author":"Gina T. Bryson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5e1dff122cb8b2b60bc155e402ef68e5ca8fba49a327940b70f3a4888183a59c","category":"Interdisciplinary"}