{"title":"No matter how Apple spins it, people have stopped buying Macs","link":"https://www.macworld.com/article/2130070/mac-sales-slump-revenue-services-growth.html","date":1699525800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Last week, Apple reported its <a href=\"https://www.macworld.com/article/2124873/apple-q4-2023-earnings-loss-iphone-mac-sales.html\">financial results</a>, and they were the kind that answered the question, “Under what circumstances would financial analysts look askance at nearly $90 billion in revenue and $23 billion in profit?” (Answer: When that company is Apple, and it’s posted lower year-over-year revenue numbers in five of the last six quarters.)</p>\n\n\n\n<p>After a couple of years of growth so sudden and massive that cosmologists are analyzing it for <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Inflation_(cosmology)&amp;xcust=1-1-2130070-1-0-0&amp;sref=https://www.macworld.com/feed\">clues to the inflationary period during the first few moments of the universe</a>, Apple has spent the year-plus… flat. Very huge and profitable flat, but flat nonetheless. Wall Street, so focused on growth, is a little perplexed.</p>\n\n\n\n<p>As is tradition, Apple CEO Tim Cook and CFO Luca Maestri hopped on a conference call with financial analysts after the results. And they let the rest of us listen in like little sneaky eavesdroppers. Here are a few of the things I took from what Apple’s execs had to say.</p>\n\n\n\n<h2>A false comparison</h2>\n\n\n\n<p>There’s no real way to gloss over the fact that Mac sales went down 34 percent versus the year-ago quarter. And yet, for some reason, Maestri and Cook got out their <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.pbs.org/kenburns/mark-twain/tom-sawyer&amp;xcust=1-1-2130070-1-0-0&amp;sref=https://www.macworld.com/feed\">Tom Sawyer paintbrushes</a> and got to work.</p>\n\n\n\n<p>Maestri said the Mac sales drop was “driven by challenging market conditions and compounded by a difficult compare in our own business, whereby last year we experienced supply disruptions from factory shutdowns in the June quarter, and were subsequently able to fulfill significant pent-up demand during the September quarter. We also had a difference in launch timing, with the MacBook Air launching earlier this year in the June quarter compared to the September quarter last year.”</p>\n\n\n\n<p>That’s the “nut of it,” as Cook echoed: it’s not really fair to compare this year’s fourth quarter to last year’s because during the summer of 2022, there was a factory shutdown in China, and when it came back online there was pent-up Mac demand. And okay, there’s truth in there: last year’s fourth quarter was the single biggest Mac quarter ever, and there’s nowhere to go from there but down.</p>\n\n\n\n<p>But by using this excuse, Cook and Maestri are deflecting attention from the real, incontrovertible numbers: Mac revenue for fiscal 2023 was $29.4 billion, down 27 percent from the previous year’s record $40.2 billion. That’s a “tough compare” that includes both the quarter where the Mac was affected by factory shutdowns and the quarter where Apple sold a whole bunch of Macs in order to fulfill demand. Put them together, and it’s still a stupendous drop in sales. This year’s Mac revenue number was also down 20 percent from fiscal 2021 when Apple sold $35.2 billion in Macs. So it’s a dramatic drop from the last two years of Mac sales, no matter how you slice it.</p>\n\n\n\n<p>But here’s the thing: look back to Mac revenue in 2019 and 2020, before the Mac sales surge driven by the Covid pandemic and the switch to Apple silicon. In those years, Mac revenue was $25.7 billion and $28.6 billion, respectively. If you think of the last couple of years as an aberration, the Mac is back where it was–in fact, it’s up 2.6 percent from fiscal 2020.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/apple-Q423-annual-mac-revenue.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Q42023 annual Mac revenue\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/apple-Q423-annual-mac-revenue.jpg?quality=50&amp;strip=all 1924w, https://b2c-contenthub.com/wp-content/uploads/2023/11/apple-Q423-annual-mac-revenue.jpg?resize=300%2C190&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/11/apple-Q423-annual-mac-revenue.jpg?resize=768%2C485&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/11/apple-Q423-annual-mac-revenue.jpg?resize=1200%2C758&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/11/apple-Q423-annual-mac-revenue.jpg?resize=1536%2C971&amp;quality=50&amp;strip=all 1536w\" width=\"1200\" height=\"758\" /></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=http://www.sixcolors.com&amp;xcust=1-1-2130070-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Jason Snell</a></div>\n\n\n\n<p>I get that Cook and Maestri are focused on the current results and also probably think of Wall Street as much more focused on the short-term picture than the long-term, but I can’t help but feel that their entire approach to the Mac sales shortfall as some sort of temporary quirk missed a larger point. A strong case can be made that Apple had two extraordinary years of Mac sales that added a huge number of new Mac users and boosted the Mac installed base to record heights. And while a lot of existing Mac users bought new Macs in 2021 and 2022, clearly there’s still an appetite for the Mac: In 2023, the numbers returned to the same ballpark they were in pre-pandemic, rather than falling off a cliff.</p>\n\n\n\n<p>Maybe Cook and Maestri just want to grit their teeth and wait for the moment to pass. After all, the year-ago quarter of Mac sales was the last enormous one. Starting next time, in fiscal 2024, they’ll only have to compare their sales to the relatively lower numbers of fiscal 2023. It’s sure to be a much easier comparison.</p>\n\n\n\n<h2>What’s in that Services pile?</h2>\n\n\n\n<p>The constant bright spot in Apple results for the past few years has been the Services line, which just… keeps… going… up. After a few quarters of single-digit growth, Services ran into another growth spurt, going up 16 percent to $22.3 billion in revenue. (It’s almost the size of the Mac, iPad, and Wearables lines <em>combined</em>.)</p>\n\n\n\n<p>On top of that, Services is <em>very profitable</em>. We always think about how Apple steadfastly makes sure that its hardware has healthy profit margins–that’s why they’re not cheap!–and indeed, this past quarter, products had a gross margin of 36.6 percent. That’s really great.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/financials-q42023-services.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple services q423\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/financials-q42023-services.jpg?quality=50&amp;strip=all 1360w, https://b2c-contenthub.com/wp-content/uploads/2023/11/financials-q42023-services.jpg?resize=300%2C184&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/11/financials-q42023-services.jpg?resize=768%2C472&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/11/financials-q42023-services.jpg?resize=1200%2C737&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"737\" /></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.sixcolors.com&amp;xcust=1-1-2130070-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Jason Snell</a></div>\n\n\n\n<p>The Services profit margin was 70.9 percent. It’s not even close. Like revenue, the Services profit margin was way up over the last quarter. Why? All Maestri said in his prepared remarks was that it was “due to a different mix,” which basically means that there was more of some <em>really</em> profitable stuff and less of some slightly less profitable stuff. Fortunately, analyst Amit Daryanani of Evercore wanted to know more, so he asked Maestri for more details. Maestri’s first response was 200 words of evasion:</p>\n\n\n\n<blockquote>\n<p>We had a really strong quarter across the board, because both geographically and from a product category standpoint we saw very significant growth. I mentioned the records on a geographic basis. And from a category standpoint, literally we set records in each one of the big categories. We had all-time record for App Store, for advertising, for cloud, video, AppleCare, payments, and a September quarter record for music. So it’s hard to pick one in particular because they all did well. And really then, we step back and we think about, why is it that our service business is doing well? And it’s because we have an installed base of customers that continues to grow at a very nice pace and the engagement in our ecosystem continues to grow. We have more transacting accounts, we have more paid accounts, we have more subscriptions on the platform, and we continue to add. We continue to add content and features, we’re adding a lot of content on TV+, new games on Apple Arcade, new features, new storage plans for iCloud. So it’s a combination of all these things and the fact that the engagement in the ecosystem is improving and therefore it benefits every service category.</p>\n<cite>Apple CFO Luca Maestri</cite></blockquote>\n\n\n\n<p>Curious. You have a big win in services, not just in growth but in profitability, and all you want to say is, “Well, things are setting records, and the mix changed; what more can we say?”</p>\n\n\n\n<p>As Stratechery’s Ben Thompson <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://stratechery.com/2023/apple-earnings-shopify-earnings/&amp;xcust=1-1-2130070-1-0-0&amp;sref=https://www.macworld.com/feed\">quipped</a>: “So just to recap, Apple’s Services revenue saw a step-change increase in revenue with increased margin, and Apple executives don’t want to talk about it.” Like Ben, I wonder if maybe the dynamic includes changes to the money Apple makes on Google search referrals, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cnbc.com/2020/10/21/apple-services-success-story-bolstered-by-huge-google-payments.html&amp;xcust=1-1-2130070-1-0-0&amp;sref=https://www.macworld.com/feed\">which are a large part of the Services line</a> that Apple never, ever, ever talks about in these calls. And of course, right now Google is on trial and that search deal is <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cnbc.com/2023/09/26/apple-exec-eddy-cue-testify-google-trial-about-19-billion-search-deal.html&amp;xcust=1-1-2130070-1-0-0&amp;sref=https://www.macworld.com/feed\">one of the big topics of conversation</a>.</p>\n\n\n\n<p>So as much as Apple wants to promote how well it’s doing, maybe ix-nay on the oogle-gay right now?</p>\n\n\n\n<h2>Secrets of Apple’s success</h2>\n\n\n\n<p>I write a lot of articles that make an assumption about how Apple plans its product strategy, so it’s nice when an Apple executive reinforces that the assumption is based in reality. Apple keeps older products on sale for longer because, over time, they become much more profitable.</p>\n\n\n\n<p>Here’s Maestri explaining the strategy last week on the analyst call, responding to a question by Krish Sankar of T.D. Cowen: “When we launch new products, the cost structures of those products tend to be higher than the products that they replace. It happens because we’re always adding new technologies, new features, and then we work through the cost curve over the life cycle of the product and we tend to get benefits as time goes by.”</p>\n\n\n\n<p>This is, for example, why Apple launched a 10th-generation iPad last year and kept the old 9th-generation iPad around. But next year, that 10th-generation model will probably end up dropping in price and kicking the 9th-generation one into oblivion. The reason is that last year, Apple couldn’t price the new iPad low enough to sell it at the low price of the older model. Next year, after a year-plus of sales, Apple will finally be able to bend the cost curve enough to lower the price.</p>\n\n\n\n<h2>So you’re saying there’s a chance</h2>\n\n\n\n<p>Over time, these analyst calls have become tightly scripted, and Cook and Maestri are rarely caught off guard. But sometimes, even a scripted answer can provide insight that we might not otherwise get. I really enjoyed Cook’s response (scripted or not) when analyst Harsh Kumar of Piper Sandler used one of his two quarterly questions to ask Cook if he regretted investing in Apple silicon (!) and if he might consider going back to a third-party chip supplier in the future (!!):</p>\n\n\n\n<p>“It’s really enabled us to build products that we could not build without doing it ourselves,” Cook said. “And as you know, we like to own the primary technologies in the products that we ship. And arguably silicon is at the heart of the primary technologies. And so, no, I don’t see going back. I am happier today than I was yesterday, than I was last week, that we made the transition that we’ve made, and I see the benefit every day of it.”</p>\n\n\n\n<p>And with that, Intel and Qualcomm threw their bouquets of roses into the trash and stormed out of the senior prom.</p>\n\nApple Inc, Mac, Streaming Media</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5e1dedfc188d4bb4b45b1555a5ff02f2caff78111c2524fa9ec3be5e41f5219e","category":"Apple"}