{"title":"Arabic translation and cultural adaptation of a training load and player monitoring in high-level football questionnaire: A cognitive interview study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302006","date":1713362400000,"content":"<p>by Abdulmalek K. Bursais</p>\r\nBackground <p>Understanding the current practice and the associated challenges in applying monitoring tools is essential to improving football performance in the Middle East, thus the purpose was to translate and culturally adapt a published questionnaire that assessed the practice and perception of High-Level football teams toward Training Load and Player Monitoring to be used in the Arabic context, aiming to contribute to the enhancement of football performance, player welfare, and training quality in the region.</p> Method <p>A total of 15 Arabic-speaking coaches (mean age 42.6 ± 9.9 years; mean experience 10.9 ± 5.7 years; 53.3% football coaches and 46.7% strength &amp; conditioning coaches) were conveniently selected to participate in this study. The current research followed a systematic cross-cultural adaptation process, which included forward translation, synthesis, back-translation, expert panel review, and pre-testing through cognitive interviewing. Three rounds of cognitive interviews were conducted with the 15 participants. Descriptive statistics, including means with standard deviations and frequencies with percentages, were reported for the participants’ characteristics.</p> Result <p>With some minor linguistic modifications to the questionnaire by the expert committee (i.e., adjustments such as <i>Sport Scientist</i> to <i>Sport Science Specialist</i>), the instrument was translated and culturally adapted into Arabic. All participants confirmed that the resulting Arabic versions of the training load and player monitoring in high-level football questionnaires were appropriate and fully understandable for Arabic speakers in conveying the intended meanings of the items in each.</p> Conclusion <p>The training load and player monitoring in the high-level football questionnaire was successfully translated and culturally adapted into Arabic and are now ready for use in the Arabic context, offering an opportunity for comprehensive research and enabling tailored performance optimization strategies, which could ultimately lead to advancements in player development and welfare within Arabic-speaking football communities.</p>","author":"Abdulmalek K. Bursais","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5e26653ced626e8000ec50d051171d3289691d99295030d551f046a8eed38a9c","category":"Interdisciplinary"}