{"title":"หนัง Starship Troopers ได้รับความนิยมเพิ่มอีกครั้ง หลังเกม Helldivers 2 ฮิต","link":"https://www.blognone.com/node/138296","date":1708429939000,"content":"<div><div><div><p>มีผู้ใช้งานใน X พบว่าภาพยนตร์เรื่อง Starship Troopers กลับมาได้รับความนิยมอีกครั้ง เพราะติดอันดับภาพยนตร์ออนไลน์ที่คนยอดนิยมดูที่สุด จากอันดับ 109 ขึ้นมาเป็นอันดับ 15 ในช่วงวันที่ 15-18 กุมภาพันธ์ที่ผ่านมา โดยวัดจากยอด Engagement ของภาพยนตร์ใน Television Stats เว็บไซต์ติดตามข้อมูลกับอันดับซีรีส์ และภาพยนตร์</p>\n<p>สาเหตุหลักที่ Helldivers 2 ช่วยให้ Starship Troopers กลับมารับความนิยมอีกครั้ง เพราะตัวเกมมีบรรยากาศคล้ายคลึงกับเรื่องราวใน Starship Troopers จนมีผู้เล่นบางส่วนกล่าวขอบคุณเกม Helldivers 2 ที่ทำให้พวกเขารู้จักภาพยนตร์เรื่องนี้ด้วย</p>\n<p>ด้าน Johan Pilestedt ผู้กำกับเกม และซีอีโอของ Arrowhead รู้สึกเหลือเชื่อที่เกมนี้ทำให้ Starship Troopers กลับมามีกระแสอีกครั้งในรอบหลายปี โดย Pilestedt เคยบอกว่าเกมได้แรงบันดาลใจจากภาพยนตร์ และหนังสือที่ตัวเขาในวัยเด็กชอบ (ส่วนหนึ่งน่าจะมาจาก Starship Troopers และ The Terminator)</p>\n<p>Starship Troopers หรือ สงครามหมื่นขาล่าล้างจักรวาล เป็นภาพยนตร์ปี 1997 จากนวนิยายชื่อเดียวกันในปี 1959 เป็นเรื่องราวเกี่ยวกับทหารหนุ่มชื่อ Johnny Rico เข้าเกณฑ์ทหาร ท่ามกลางฉากหลังสงครามระหว่างดวงดาวระหว่างมนุษยชาติกับสายพันธุ์แมลงที่รู้จักกันในชื่อ Arachnids โดยเรื่องราวตั้งอยู่ในศตวรรษที่ 23</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f29b03f846056868b9d53051f34cda78.png\" /><em>ภาพประกอบจากภาพยนตร์เรื่อง Starship Troopers</em></p>\n<p><em>ตัวอย่างภาพยนตร์เรื่อง Starship Troopers</em></p>\n<p>ที่มา - <a href=\"https://televisionstats.com/m/starship-troopers\">Television Stat</a>, <a href=\"https://twitter.com/Pilestedt/status/1759592958603464960\">Johan Pilestedt</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/helldivers\">Helldivers</a></div><div><a href=\"/topics/playstation\">PlayStation</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/movie-0\">Movie</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5e26979d63d863300c20616ca6ebc2ff18178244267ed22a05a938cd2ca93edd","category":"Thai"}