{"title":"Optimizing fabrication and performance of liquid‐processed carbon nanotube photodetectors on various substrates","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300121?af=R","date":1723441144000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/53e52813-4216-491b-8c48-2062043e3933/appl202300121-gra-0001-m.png\" alt=\"Optimizing fabrication and performance of liquid-processed carbon nanotube photodetectors on various substrates\" /><p>Carbon nanotubes (CNTs) have attracted interest for optoelectronic applications due to their unique electronic and optoelectronic properties. In this work, we have produced and test UV-sensitive devices using MWCNTs deposited from a liquid solution on two different substrates (Si<sub>3</sub>N<sub>4</sub> and SiO<sub>2</sub>), trying to combine this modern material with traditional silicon technology producing low-cost and high-performance UV photodetectors. The optical characterization results demonstrate a similar optical performance for both devices with an equivalent quantum efficiency at approximately 50%.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Carbon nanotubes (CNTs) have attracted interest for optoelectronic applications due to their unique electronic and optoelectronic properties. In particular, multiwall (MW) CNTs film acts as perfect photo-collector surface with the possibility to tune the absorbance by controlling the film thickness. In this work, we demonstrate two types of hybrid Si-MWCNTs photodetectors. The MWCNTs are solution-processed and deposited on n-silicon substrate covered by two different dielectrics (Si<sub>3</sub>N<sub>4</sub> or SiO<sub>2</sub>). The MWCNTs/SiO<sub>2</sub>/n-Si device is used here as reference, since the SiO<sub>2</sub>/Si system is the most widely investigated structure in microelectronics. The electrical and optical characteristics of the reference device are compared with the corresponding of our basic MWCNTs/Si<sub>3</sub>N<sub>4</sub>/n-Si device. The MWCNTs are deposited on the substrate with the drop casting technique. Optical performance of the SiO<sub>2</sub> device is comparable to the Si<sub>3</sub>N<sub>4</sub> device thus revealing a quite interesting response under UV illumination. The Si<sub>3</sub>N<sub>4</sub> device exhibited a peak equivalent quantum efficiency (EQE) of 57% at 3 μW of source illumination power, thus demonstrating a superior performance as compared to the SiO<sub>2</sub> device (EQE of up to 55%, which is also promising for future applications). This performance can be attributed to the great absorption in UV region of CNTs layer. Apart from this technological goal, we also investigated how MWCNTs/Si<sub>3</sub>N<sub>4</sub> or MWCNTs/SiO<sub>2</sub> heterojunctions perform using standard electrical characterization techniques and how the presence of the CNTs change the dielectric characteristics of both substrates.</p>","author":"Vasileios Lionas, \nDimitrios Velessiotis, \nGeorge Pilatos, \nKonstantinos Giannakopoulos, \nAristotelis Kyriakis, \nNikolaos Glezos, \nDimitrios Skarlatos","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"5e31f1605735efc36b90a48d0308992f9988a9e50f65aa1cda36150848840c54","category":"Environment"}