{"title":"Development and Evaluation of ABI-171, a New Fluoro Catechin Derivative, for the Treatment of Idiopathic Pulmonary Fibrosis (IPF)","link":"https://www.preprints.org/manuscript/202410.0267/v1","date":1728008328000,"content":"The persistent challenge of IPF, characterized by disease progression and high mortality, underscores the urgent need for innovative therapeutic strategies. We have developed a novel small molecule – catechin derivative ABI-171 – selectively targeting DYRK1A and PIM1 kinases,  crucial in the pathogenesis of fibrotic processes. We employed the Bleomycin-induced (intratracheal) mouse model of pulmonary fibrosis (PF) to evaluate the therapeutic efficacy of ABI-171. Mice with induced PF were treated QD with ABI-171 either prophylactically or therapeutically using oral and intranasal routes. Pirfenidone (100mg/kg, TID) and Epigallocatechin gallate (EGCG, 100 mg/kg, QD), a natural catechin currently in a Phase 1 clinical trial, were used as reference compounds. ABI-171, administered prophylactically, led to a significant reduction in hydroxyproline levels and fibrotic tissue formation compared to the control group. Treatment with ABI-171 improved body weight, indicating mitigation of disease-related weight loss. Additionally, ABI-171 demonstrated anti-inflammatory activity, reducing lymphocyte and neutrophil infiltration. In the therapeutic setting, ABI-171, administered 7 days post-induction, reduced mortality rates (P = 0.04) compared with the bleomycin and EGCG control groups. ABI-171 also ameliorated the severity of lung injuries assessed by improved Masson’s trichrome scores when administered both orally and intranasally. ABI-171 significantly decreases bleomycin-induced PF and improves survival in mice, showcasing promising therapeutic potential beyond current medications like Pirfenidone and EGCG for patients with IPF. Based on these results, further studies with ABI-171 are ongoing in preclinical studies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5e37087922e9c4fb500857e1b4be579a53c7c5b7213ae781228460a6873b90e0","category":"Interdisciplinary"}