{"title":"Facebook’s Right-Wing Outrage Machine, CrowdTangle, and Kevin Roose","link":"https://www.nytimes.com/2021/07/14/technology/facebook-data.html","date":1626297574000,"content":"\n<p>Facebook owns a data analytics service called CrowdTangle. CrowdTangle allows journalists and researchers to examine and study the “engagement” of link posts on Facebooks. NYT columnist Kevin Roose has been using CrowdTangle’s engagement data to publish the excellent <a href=\"https://twitter.com/FacebooksTop10\">@FacebooksTop10</a> account on Twitter, which lists the 10 top-performing posts on Facebook every day. Unsurprisingly, most days, the list is dominated by right-wing commentators.</p>\n\n<p>Roose today has a long column — incredibly well-sourced — that digs into Facebook’s response to this imbroglio, which, unsurprisingly, has been to treat it as a <em>perception</em> problem rather than a <em>product</em> problem:</p>\n\n<blockquote>\n  <p>Mr. Zuckerberg is right about one thing: Facebook is not a giant\nright-wing echo chamber.</p>\n\n<p>But it does <em>contain</em> a giant right-wing echo chamber — a kind of\nAM talk radio built into the heart of Facebook’s news ecosystem,\nwith a hyper-engaged audience of loyal partisans who love liking,\nsharing and clicking on posts from right-wing pages, many of which\nhave gotten good at serving up Facebook-optimized outrage bait at\na consistent clip.</p>\n\n<p>CrowdTangle’s data made this echo chamber easier for outsiders to\nsee and quantify. But it didn’t create it, or give it the tools it\nneeded to grow — Facebook did — and blaming a data tool for\nthese revelations makes no more sense than blaming a thermometer\nfor bad weather.</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/07/14/roose-facebook-perception-problem\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"5e4214abcdb8a79bfea33431b0d8ef8fb0e929168a87daa89bff232fae68b49b","category":"Tech"}