{"title":"Environmentally-Sustainable Apparel Purchasing Behavior of Ethiopian Consumers: An Extended Model of Theory of Planned Behavior","link":"https://www.preprints.org/manuscript/202408.2066/v1","date":1724842505000,"content":"Nowadays, there is an increasing concern about environmental challenges ranging from emissions to overconsumption. Most of the environmental problems today are direct consequences of human consumption. Understanding the factors that affect consumer purchasing decisions is critical to developing demand for and commitment to sustainable consumption. In this regard, this study aims to explore the environmentally sustainable consumption behavior of Ethiopian consumers by using an extended model of the theory of planned behavior. Data were collected using a self-administered questionnaire having open and closed-ended questions. A total of 523 Ethiopian consumers were selected using convenience sampling technique. Structural equation modeling with AMOS V.26.0. was applied for data analysis. The findings show that Ethiopian consumers have very low awareness about the impact of their clothing consumption and disposal. Their consideration of sustainability attributes during purchasing decisions is also low. The structural equation model analysis showed that all variables had a positive and significant effect on the dependent variables at p&lt;0.05, except the effect of personal norms on an environmentally responsible purchasing intention. These results provide additional evidence on the  role of environmental labels in purchasing sustainable apparel products. The results of the study allow a better understanding of the factors determining sustainable consumption behavior and suggest practical solutions to their producers. As theory-building activities, with implications for the conceptualization of sustainable consumption behavior are sparse in the literature, this work has also been able to detect sustainable consumption behavior trends and practices by using the availability of a sustainable apparel product and consumers price perceptions of environmentally responsible apparel as a mediating effect of intention and behavior in developing countries, particularly Ethiopia.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5e464ac1aafb0af6dfb78ed0ee797c20f87b0d475ed3fda9e91d562ec9cbb298","category":"Interdisciplinary"}