{"title":"No WIMPS! Heavy particles don’t explain gravitational lensing oddities","link":"https://arstechnica.com/?p=1933677","date":1682107270000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/image-2-800x821.jpeg\" alt=\"Image of many galaxies, with some distorted streaks near the center.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/image-2.jpeg\">Enlarge</a> <span>/</span> The red arcs at the right of center are background galaxies distorted by gravitational lensing. The number, location, and degree of distortion of these images depends on the distribution of dark matter in the foreground. (credit: <a href=\"https://www.nasa.gov/image-feature/goddard/2021/hubble-views-a-faraway-galaxy-through-a-cosmic-lens\">ESA/Hubble &amp; NASA, A. Newman, M. Akhshik, K. Whitaker</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Decades after it became clear that the visible Universe is built on a framework of dark matter, we still don't know what dark matter actually is. On large scales, a variety of evidence points toward what are called WIMPs: weakly interacting massive particles. But there are a variety of details that are difficult to explain using WIMPs, and decades of searching for the particles have turned up nothing, leaving people open to the idea that something other than a WIMP comprises dark matter.</p>\n<p>One of the <a href=\"https://arstechnica.com/science/2014/09/exploring-the-monstrous-creatures-at-the-edges-of-the-dark-matter-map/\">many candidates</a> is <a href=\"https://arstechnica.com/science/2016/11/using-the-universe-to-calculate-the-mass-of-a-dark-matter-candidate/\">something called an axion</a>, a force-carrying particle that was proposed to solve a problem in an unrelated area of physics. They're much lighter than WIMPs but have other properties that are consistent with dark matter, which has sustained low-level interest in them. Now, a new paper argues that there are features in a gravitational lens (largely the product of dark matter) that are best explained by axion-like properties.</p>\n<h2>Particle or wave?</h2>\n<p>So, what's an axion? On the simplest level, it's an extremely light particle with no spin that acts as a force carrier. They were originally proposed to ensure that quantum chromodynamics, which describes the behavior of the strong force that holds protons and neutrons together, doesn't break the conservation of charge parity. Enough work was done to make sure axions were compatible with other theoretical frameworks, and <a href=\"https://arstechnica.com/science/2015/01/if-dark-matter-is-really-axions-we-could-find-out-soon/\">a few searches</a> were done to try to detect them. But axions have mostly languished as one of a number of potential solutions to a problem that we haven't figured out how to resolve.</p></div><p><a href=\"https://arstechnica.com/?p=1933677#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1933677&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5e4a6b0f141f74186001451ce03dea387cc096c24787b3a8cf95f75261765165","category":"Tech"}