{"title":"Readability of Fin Clipping during the Growing Season: Case Study on the Pikeperch (Sander lucioperca)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/9788279?af=R","date":1724737691000,"content":"<p>Fin clipping is a common method of fish marking to distinguish between particular cohorts, yet a comparison of specific marks/clips has yet to be thoroughly conducted. Nine ponds were stocked with pikeperch (<i>Sander lucioperca</i>, L., 20 specimens each) in spring 2023, and different fins or parts of fins were clipped in each pond. The regeneration and readability of different 1-year-old pikeperch fins after fin-clipping were investigated by repeated recaptures at monthly intervals during the growing season (April–October). Although prey fish were absent in all ponds and the pikeperch grew slowly, fin regeneration was relatively rapid. Readability naturally decreased as the season progressed. Better readability was observed when the soft fin rays were cut off. In cases where only the hard fin rays were cut off, readability decreased rapidly over the course of the season. In general, the best readability was found for the pelvic fin when the entire fin or its posterior part was cut off as well as for the anterior and posterior part of the second dorsal fin. Conversely, the worst readability was found for the anterior part of the pelvic fin and both the anterior and posterior parts of the first dorsal fin. The readability of the anal fin section can be described as average. The degree of regeneration (ratio between regenerated and original fin parts) was usually above 50% at the end of the growing season and due to the limited food supply in all ponds, the survival rate between stocking and harvesting was never above 40% (10%–40%).</p>","author":"Tomáš Jůza, \nLenka Kajgrová, \nMartin Bláha, \nJan Škrabánek, \nVladislav Draštík, \nLuboš Kočvara, \nPetr Blabolil, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"5e5f035693f084bbf5449e2cce8e2f81c2d9bca12bc0dfb6d56d8d4932955a58","category":"Environment"}