{"title":"The 2023 Kia EV6 GT: We determine its fun formula","link":"https://arstechnica.com/?p=1922811","date":1678378074000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/0307_kia_ev6GT_review-5-800x533.jpg\" alt=\"A red Kia EV6 GT\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/0307_kia_ev6GT_review-5.jpg\">Enlarge</a> <span>/</span> Can a 400-mile road trip up the California coast tell us whether the EV6 GT adds enough smiles to justify its added expense over the regular—and already excellent—EV6? </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>We are emotionally connected to our cars. Even when we buy something that's purely utilitarian, we can't be expected to spend that much time with an object without feeling… something. Even hatred of a car, truck, or SUV shows that we're attached in a tangible way to a vehicle. But when we talk about driving, we generally gravitate toward fun and the joy of the open road.</p>\n<p>This brings us to <a href=\"https://arstechnica.com/cars/2022/12/an-electric-kia-thats-faster-than-a-lamborghini-the-2023-ev6-gt-driven/\">the 2023 Kia EV6 GT</a>. The sportier, quicker EV6 burst onto the scene with a video of the EV besting supercars in the quarter-mile. It kept up with those it couldn't beat, thanks to a zero-to-60 time of 3.4 seconds. It's 576 hp (430 kW) and 545 lb-ft (738 Nm) of torque fast. It's \"I bet you didn't think a station wagon that's masquerading as an SUV could blow the doors off a Lambo\" fast. Kia is selling one thing with this car: fun.</p>\n<p>What is fun worth? Sure, you're dropping more cash on the quickest EV6. Paying more for a performance variant is expected. That's not the real cost of the EV6 GT, though. What you're paying in is range, and that translates to more time on a trip. This might be the faster Kia, but you'll be hitting more charging stations.</p></div><p><a href=\"https://arstechnica.com/?p=1922811#p3\">Read 27 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1922811&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"23e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5e5f691de867ff5d55808869f9ae587ab3bca9e4b8ca055410e84f","category":"Tech"}