{"title":"Pro bike: Kiel Reijnen’s battered and bruised Trek Checkpoint SLR gravel bike","link":"https://www.cyclingtips.com/2023/03/pro-bike-kiel-reijnens-battered-and-bruised-trek-checkpoint-slr-gravel-bike/","date":1679724013000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/03/L1000507.jpg?width=1200\" alt=\"Pro bike: Kiel Reijnen's battered and bruised Trek Checkpoint SLR gravel bike\" /></figure><p>If you’ve yet to catch my recent chit-chat with Kiel Reijnen, where he kindly dished out all the valuable tips you need to not just be better at gravel riding but how to look as stylish as the mullet man himself on a bike, let’s just class it as a vid full of life lessons. <a href=\"https://www.cyclingtips.com/2023/03/pro-gravel-tips-with-kiel-reijnen/\" target=\"_blank\">Click here</a> for that one. Trust me, you won’t be disappointed, and you never know. You may learn a thing or two about goldfish, cougars and why you should hang out more with your mates.</p>\n<p>Ok, have you done that? Good, so I’ll carry on.</p>\n<p><strong>Also watch: </strong><a href=\"https://www.cyclingtips.com/2023/03/pro-bike-check-tom-pidcocks-training-bike/\" target=\"_blank\">Pro bike check: Tom Pidcock’s training bike</a></p>\n<p>While I had Kiel on hand in Portugal, where we were for the recent SRAM Force AXS groupset launch, I didn’t just nag him for an interview; I also got him to one side to run through the bike he uses for his gravel exploits.</p>\n<p>Since “retiring” from the pro road peloton, he’s become a gravel convert, racing the world over. Just don’t call him a privateer.</p>\n<p>Sponsored by Trek, just like in his road days and SRAM, he has a pretty sweet set-up. But boy, oh boy, is his bike beat up. So if you want to see what a full-time gravel guy’s rig looks like after a season of abuse, then hit that play button. Oh, and there’s also a bumbag/fanny pack discussion.</p>\n<p>What’s not to like?!</p>\n<p><strong>Also watch: </strong><a href=\"https://www.cyclingtips.com/2023/03/pro-gravel-tips-with-kiel-reijnen/\" target=\"_blank\">Pro Gravel Tips with Kiel Reijnen</a></p>\n<div></div>\n<p> </p>","author":"Dave Everett","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"5e69ecd783ef2be4596c491ffa7baf9c4c1e0ceeb1f701a2754b5a84ad30d877","category":"Cycling"}