{"title":"Embrace the Analog: Hunter’s Affinity Anthem with Campagnolo Chorus 12 Speed – Hunter Kelley","link":"https://theradavist.com/2021/11/embrace-the-analog-hunters-affinity-anthem-with-campagnolo-chorus-12-speed/?utm_source=rss&utm_medium=rss&utm_campaign=embrace-the-analog-hunters-affinity-anthem-with-campagnolo-chorus-12-speed","date":1635940841000,"content":"<p>In an age where rubbing disc brakes, dead electronic shifting, and fussy integrated cockpits rule the market, the idea of a simple bike with none of the above starts to look very appealing. A steel frame with a mechanical groupset has an analog quality to it that is hard to beat. It has undeniable panache, aero and weight don’t matter. I introduce to you my <a href=\"https://affinitycycles.com/\" target=\"_blank\">Affinity Anthem</a>, a stainless steel workhorse of a bike mated to a groupset that is as timeless as they come.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Radavist-Affinity-Anthem-HK-24.jpeg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/10/Radavist-Affinity-Anthem-HK-26.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Never heard of Affinity? <a href=\"https://affinitycycles.com/\" target=\"_blank\">Affinity</a> is a New York City brand with bikes designed in Brooklyn and produced overseas. Previously they only focused on track bikes but this Affinity Anthem is their first road-going one. It’s made with 2205 stainless steel, features internal cabling, has a large T47 BB, and is covered in a bead-blasted finish, giving it an almost titanium look. My favorite detail is the seat tube graphic, which is polished stainless steel that was not bead blasted.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Radavist-Affinity-Anthem-HK-3.jpeg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/10/Radavist-Affinity-Anthem-HK-6.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The Anthem was released by Affinity at the beginning of 2020 and I lusted after it ever since. However, because the release came at the height of the pandemic, buying a frameset was the last thing on my priority list. Nearly a year later and a <a href=\"https://www.theproscloset.com/collections/frames?tags=framematerial-steel%2Cframematerial-titanium&amp;page=1\" target=\"_blank\">used frameset</a> popped up on <a href=\"https://www.theproscloset.com/\" target=\"_blank\">The Pro’s Closet</a>, for a great price I may add. I knew what I had to do.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Radavist-Affinity-Anthem-HK-19.jpeg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/10/Radavist-Affinity-Anthem-HK-17.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I went with <a href=\"https://www.campagnolo.com/US/en\" target=\"_blank\">Campagnolo</a> for this build as stocking shortages from Shimano and SRAM proved difficult. The Campagnolo Chorus 12 speed groupset made far more sense, and I was excited to try a groupset from a brand I’ve never used before.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Radavist-Affinity-Anthem-HK-23.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Campagnolo shifting is different than other manufacturers’, especially with its use of thumb shifters. It takes some getting used to but then it becomes second nature. The tactile feedback from a mechanical groupset, especially a Campagnolo one, will never be beaten by an electronic one. Mark my words.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Radavist-Affinity-Anthem-HK-2.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Now, onto the parts. Upfront is a 50/34 crankset paired to a 12-32 cassette. With the frame being steel, that gear range helps to offset some of the extra weight. Wheels are Campagnolo Zonda C17s with Veloflex tires mounted (thank you to my roommate Patrick for the hookup). The seatpost clamp and stem are aluminum offerings from Thomson, while the seat post, bottle cages, and front derailleur mount are carbon components from Parlee. This bike is a solid mix of Italian and American-derived components.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/Radavist-Affinity-Anthem-HK-4.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>While this bike is no featherweight weighing in at 19.7 pounds (pedals, cages, computer mount) it provides such a smooth and steady ride that the weight penalty can easily be forgiven. </p>\n<p>#steelisreal #savetherimbrake</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"5e727869a2bee80eec8cd09b209df1444cb180d72341eb9815109f8fba33727f","category":"Cycling"}