{"title":"Bloomberg, at Long Last, Follows up on ‘The Big Hack’, and It’s Nothing but a Pile of Sophistic Horseshit","link":"https://www.bloomberg.com/features/2021-supermicro/","date":1613182207000,"content":"\n<p>Well, holy shit, two years and four months after publishing “The Big Hack”, Bloomberg has finally followed up. The follow up is even from the same two reporters, Jordan Robertson and Michael Riley.</p>\n\n<p>It’s a 4,000-word exercise in journalistic sophistry. It creates the illusion of something being there, but there is nothing there. The only good purpose this report could serve is as source material for a class on critical thinking. Bloomberg headlined this followup “The Long Hack: How China Exploited a U.S. Tech Supplier”, but it’s looking ever more like a long con on Bloomberg’s part.</p>\n\n<p>The <a href=\"https://daringfireball.net/2018/10/bloomberg_the_big_hack\">original story’s key allegations</a> — what made it a blockbuster — were that Chinese government operatives had surreptitiously added “phone home” chips to server components made by a company named Supermicro, and that Apple and Amazon were among the companies who’d been breached by these compromised servers. Apple and Amazon adamantly refuted the entire story, in unambiguous language. Bloomberg’s original report offered no firsthand evidence of these compromised servers. <a href=\"https://daringfireball.net/linked/2019/10/07/bloombergs-big-crap\">In the years since</a>, no one has ever discovered any evidence of such compromised servers.</p>\n\n<p>Today’s follow-up from Bloomberg offers no evidence either.</p>\n\n<p>Regarding Apple and Amazon, today’s report offers the following (again, in a 4,000+ word story):</p>\n\n<blockquote>\n  <p>Bloomberg Businessweek first reported on China’s meddling with\nSupermicro products in October 2018, in an article that focused on\naccounts of added malicious chips found on server motherboards in\n2015. That story said Apple Inc. and Amazon.com Inc. had\ndiscovered the chips on equipment they’d purchased. Supermicro,\nApple and Amazon publicly called for a retraction. U.S. government\nofficials also disputed the article.</p>\n</blockquote>\n\n<p>No other paragraph in the story mentions either Apple or Amazon. Bloomberg <em>still</em> hasn’t retracted their allegations regarding Apple or Amazon. Yet they still haven’t produced one shred of evidence supporting their allegations. Apple and Amazon aside, they still haven’t produced one shred of evidence regarding these surreptitious “phone home” chips on Supermicro components.</p>\n\n<p>Shameful.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Bloomberg, at Long Last, Follows up on ‘The Big Hack’, and It’s Nothing but a Pile of Sophistic Horseshit’\"  href=\"https://daringfireball.net/linked/2021/02/12/bloomberg-big-con\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"5e75e6ff5ee699bdcb773753b1dd38b2111129f166e39d061798b0a6e8c6a127","category":"Tech"}