{"title":"317 Microbial interventions to improve gut health in neonatal ruminants","link":"https://academic.oup.com/jas/article/102/Supplement_3/177/7757105?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Colonization and establishment of a balanced and healthy gut microbiome during the neonatal period can directly and indirectly influence animals by affecting the development and metabolism, nutrition absorption, barrier and immune functions, and endocrine and neuron transmitter secretions. Therefore, neonatal period represents a crucial window of time in animal’s life that induces long-term developmental and immune memory. Therefore, alterations in the early gut microbial composition and colonization trajectories lead to long-term negative effects on animals’ production and health. While the rapidly developing gut microbial community is affected by various external factors due to its instability, it provides a great opportunity for microbial intervention to alter microbial colonization trajectories and their subsequent impact on gut health. Recent advance research has been successful in restoring altered gut microbial communities by using microbial interventions such as vaginal seeding, fecal microbial transplantation, probiotics, and prebiotics. However, there is a lack of understanding on the long-term effects of these interventions on gut health in neonatal ruminants. Direct fed microbes (live naturally existing microbes that can improve health and production performance) with psychobiotic function (a type of probiotic that affect cognitive and behavioral functions of the host via the gut-brain axis) can be one of the novel microbiome solutions to target and alter the microbiome dysbiosis. The use of direct fed microbes, postbiotics and psychobiotics and their potential implications in improving calf health and productivity leads to a novel solution to the manipulation of the gut microbiome in calves.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5e76feb655364d6d12b0a20873c0c9761735bccf2b5ad4485fad3e33d9fef93b","category":"Environment"}