{"title":"“There hasn’t been a push to identify patients in the emergency department”—Staff perspectives on automated identification of candidates for pre-exposure prophylaxis (PrEP): A qualitative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300540","date":1710424800000,"content":"<p>by Samantha A. Devlin, Amy K. Johnson, Kimberly A. Stanford, Sadia Haider, Jessica P. Ridgway</p>\r\n\r\nAutomated algorithms for identifying potential pre-exposure prophylaxis (PrEP) candidates are effective among men, yet often fail to detect cisgender women (hereafter referred to as “women”) who would most benefit from PrEP. The emergency department (ED) is an opportune setting for implementing automated identification of PrEP candidates, but there are logistical and practical challenges at the individual, provider, and system level. In this study, we aimed to understand existing processes for identifying PrEP candidates and to explore determinants for incorporating automated identification of PrEP candidates within the ED, with specific considerations for ciswomen, through a focus group and individual interviews with ED staff. From May to July 2021, we conducted semi-structured qualitative interviews with 4 physicians and a focus group with 4 patient advocates working in a high-volume ED in Chicago. Transcripts were coded using Dedoose software and analyzed for common themes. In our exploratory study, we found three major themes: 1) Limited PrEP knowledge among ED staff, particularly regarding its use in women; 2) The ED does not have a standardized process for assessing HIV risk; and 3) Perspectives on and barriers/facilitators to utilizing an automated algorithm for identifying ideal PrEP candidates. Overall, ED staff had minimal understanding of the need for PrEP among women. However, participants recognized the utility of an electronic medical record (EMR)-based automated algorithm to identify PrEP candidates in the ED. Facilitators to an automated algorithm included organizational support/staff buy-in, patient trust, and dedicated support staff for follow-up/referral to PrEP care. Barriers reported by participants included time constraints, hesitancy among providers to prescribe PrEP due to follow-up concerns, and potential biases or oversight resulting from missing or inaccurate information within the EMR. Further research is needed to determine the feasibility and acceptability of an EMR-based predictive HIV risk algorithm within the ED setting.","author":"Samantha A. Devlin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5e866af41a750ba4a1f24993a0ca9129421ed33c2715e30edf120f2ddfa6c87a","category":"Interdisciplinary"}