{"title":"Star Trek Day celebrates 55 years with Picard, Prodigy trailers, and more","link":"https://arstechnica.com/?p=1793340","date":1631314005000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Paramount+ celebrated 55 years of Trek on Star Trek Day 2021, a live-streamed event held at the Skirball Cultural Center in Los Angeles, California, on September 8, 2021. </p></div>\n<p>It's been 55 years since the television debut of <a href=\"https://en.wikipedia.org/wiki/Star_Trek:_The_Original_Series\"><em>Star Trek: The Original Series</em></a> (<em>TOS</em>), and the franchise continues to expand its reach in film and television, bringing delight to new generations of fans. Paramount+ marked the occasion with <a href=\"https://www.startrek.com/day\">Star Trek Day 2021</a>, a live-streamed event staged (and taped for posterity) at the Skirball Cultural Center in Los Angeles.</p>\n<p>Co-hosted by Wil Wheaton (aka Wesley Crusher on <em>Star Trek: The Next Generation</em>) and actress Mica Burton (daughter of LeVar Burton), the event featured a live orchestra and back-to-back panels with cast members and creatives from the new generation of Star Trek TV shows: <em>Star Trek: Discovery, Star Trek: Picard, Star Trek: Strange New Worlds</em>, and <em>Star Trek Prodigy</em>. These events were interspersed with \"legacy moments\" featuring such iconic past cast members as George Takei (Hikaru Sulu, <em>TOS</em>), Cirroc Lofton (Jake Sisco, <em>Star Trek: Deep Space Nine</em>), Anthony Montgomery (Ensign Travis Mayweather, <em>Star Trek: Enterprise</em>), and Garrett Wang (Ensign Harry Kim, S<em>tar Trek: Voyager</em>).</p>\n<p>The event also marked the launch of a month-long \"Boldly Go\" campaign in honor of <em>Star Trek</em> creator Gene Roddenberry. Fans worldwide are invited to submit photos and videos about their hopes for the next 100 years. The Roddenberry Foundation will work with its campaign partners to combine the submissions into a piece of artwork that will eventually be auctioned off, with the proceeds going to support various nonprofits. The artwork will also be etched onto a network of satellites slated to be launched in 2022—\"a first-of-its-kind space-based art installation.\"</p></div><p><a href=\"https://arstechnica.com/?p=1793340#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1793340&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5e977696424c85471413fd187ef07ba51d2d8960ea1dad531759aaaa3cadc316","category":"Tech"}