{"title":"Would You Let Siri Help to Write Your Messages?","link":"https://www.macrumors.com/2024/02/26/siri-generative-ai-google-gemini-messages/","date":1708950715000,"content":"As part of its <a href=\"https://www.macrumors.com/guide/apple-gpt/\">generative AI push</a>, Apple is expected to feature tight integration between <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> and the Messages app in <a href=\"https://www.macrumors.com/roundup/ios-18/\">iOS 18</a>. We won't have a fuller idea about how that will work until Apple previews its next major software update at WWDC in June, but in the meantime, Google has just <a href=\"https://blog.google/products/android/new-android-features-february-2024/\">announced</a> its own equivalent feature for Android.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/gemini-google-messages.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nIn an update for the beta version of Google Messages arriving this week, users will be able to interact with Google's Gemini chatbot (previously called \"Bard\") right inside the app, where it can help to draft messages, brainstorm ideas, plan events, or simply allow for a \"fun conversation.\" Google says the feature is only available to English-language Messages users for now.\r<br />\n\r<br />\nAndroid Auto is also getting an AI assistant that can automatically summarize long texts or busy group chats while users are driving. It will also suggest relevant replies and actions that users can tap once to send a message, share their ETA, or start a call. We have not heard rumors mention AI in relation to <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a>, so whether or not Apple has similar features in the works is unknown.\r<br />\n\r<br />\n‌iOS 18‌ and iPadOS 18 will include a \"slew of new AI features,\" according to a <a href=\"https://www.macrumors.com/2024/02/16/ios-18-slew-of-new-ai-features/\">recent report</a> by <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>. The report claims Apple is training both ‌Siri‌ and Spotlight search on large language models, with the goal of improving each feature's ability to answer complex questions accurately. The revamped version of Spotlight could also offer deeper integration with \"specific\" functions and features in apps.\r<br />\n\r<br />\nGurman says that one of the tentpole AI features Apple is developing is an improved interaction between ‌Siri‌ and the Messages app, which would let ‌Siri‌ auto-complete sentences more effectively and answer complex questions. Apple has also explored AI-powered features that would allow users to automatically generate playlists in <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> and presentation slides in the Keynote app. Some new AI features announced later on in the year could well be exclusive to <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a> models, which are rumored to get a <a href=\"https://www.macrumors.com/2024/02/14/iphone-16-upgraded-neural-engine-rumor/\">\"significantly\" upgraded Neural Engine</a>.\r<br />\n\r<br />\nAccording to the latest data from TF International Securities, Apple's weekly smartphone sales in the Chinese market have declined by 30-40% in recent weeks, which is said to be partly due to rival Chinese smartphones <a href=\"https://www.digitimes.com/news/a20240223PD204/apple-ai-ios-china-smartphone-iphone-sales.html\">already offering generative AI features</a> of their own.<div>Tags: <a href=\"https://www.macrumors.com/guide/google/\">Google</a>, <a href=\"https://www.macrumors.com/guide/apple-gpt/\">Apple GPT</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/26/siri-generative-ai-google-gemini-messages/\">Would You Let Siri Help to Write Your Messages?</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/would-you-let-siri-help-to-write-your-messages.2420429/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5e9935cf1bfc74b2df82a1a562e37e2d182238d23bcb07d5a74ad1ade8026920","category":"Apple"}