{"title":"[ลือ] Google Pixel 8 จะมีระยะเวลาอัพเดตนานกว่าซัมซุง เทียบเท่า iPhone","link":"https://www.blognone.com/node/135481","date":1693275168000,"content":"<div><div><div><p>เว็บไซต์ 9to5google อ้างข้อมูลจากแหล่งข่าวว่า Pixel 8 ที่จะเปิดตัวในช่วงเดือนกันยายน-ตุลาคม จะมีระยะเวลาอัพเดตระบบปฏิบัติการที่ยาวนานขึ้นกว่าเดิม ตอนนี้ยังไม่มีตัวเลขออกมา แต่กูเกิลตั้งเป้าว่า \"นานกว่าซัมซุง\" และ \"เทียบเท่า iPhone\" เลยทีเดียว</p>\n<p>นโยบายอัพเดตระบบปฏิบัติการของ Pixel ตอนนี้คือ <a href=\"https://www.blognone.com/node/125367\">อัพเดตแพตช์ 5 ปี อัพเกรดระบบปฏิบัติการ 3 รุ่น</a> เริ่มใช้ตั้งแต่ Pixel 6 ที่ออกในปี 2021 แต่หลังจากนั้นในปี 2022 ซัมซุงเกทับด้วยตัวเลขเหนือกว่าคือ <a href=\"https://www.blognone.com/node/127093\">แพตช์ 5 ปี และระบบปฏิบัติการ 4 รุ่น</a> เริ่มใช้กับ Galaxy S21</p>\n<p>ส่วน iPhone แม้ไม่มีนโยบายประกาศมาชัดๆ ว่านานกี่ปี แต่ถ้ายกเคสตัวอย่างคือ iPhone XS ออกปี 2018 มาพร้อม iOS 12 ตอนนี้ยังจะได้อัพเป็น iOS 17 อยู่ด้วย (ระบบปฏิบัติการ 5 รุ่น) หรือถ้านับตามแพตช์ความปลอดภัย iPhone 6S ออกปี 2015 แม้หยุดอัพเกรดระบบปฏิบัติการแล้ว ยังได้แพตช์อยู่ (นานเกือบ 8 ปี)</p>\n<p>หากข่าวของ 9to5google เป็นจริง แปลว่ากูเกิลต้องอัพเดตระบบปฏิบัติการมากกว่า 5 รุ่นถึงชนะซัมซุงและเทียบเท่า iPhone ส่วนระยะเวลาอัพเดตแพตช์ย่อมต้องนานกว่านั้นอีก</p>\n<p>โลกของ Android มีข้อยกเว้นอยู่บ้างคือ <a href=\"https://www.blognone.com/node/126688\">NVIDIA Shield ที่อัพเดตนานถึง 8 ปี</a> แต่เหตุผลเป็นเพราะ NVIDIA เป็นเจ้าของชิป Tegra K1/X1 เอง สามารถควบคุมการอัพเดตซอฟต์แวร์ได้เองหมด ต่างจากมือถือ Android ยี่ห้ออื่นๆ ที่มักใช้ชิปของบริษัทอื่น (เช่น Qualcomm) ที่มีระยะเวลาซัพพอร์ตชิปเก่าจำกัด การที่กูเกิลออกแบบชิป Tensor ของตัวเองย่อมจะช่วยแก้ปัญหาเรื่องระยะเวลาอัพเดตได้เช่นกัน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c2718693af86c87e4e6a2c02368156c4.jpg\" /></p>\n<p>ที่มา - <a href=\"https://9to5google.com/2023/08/28/google-pixel-8-android-os-updates/\">9to5google</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-pixel-8\">Google Pixel 8</a></div><div><a href=\"/topics/google-pixel\">Google Pixel</a></div><div><a href=\"/topics/rumors\">Rumors</a></div><div><a href=\"/topics/android\">Android</a></div><div><a href=\"/topics/google\">Google</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5e9a69f3d05a213f0f10c4c95be66628072e1d4dc10e55b2e2af705264154e1b","category":"Thai"}