{"title":"8GB RAM in M3 MacBook Pro Proves the Bottleneck in Real-World Tests","link":"https://www.macrumors.com/2023/11/10/8gb-ram-in-m3-macbook-pro-proves-the-bottleneck/","date":1699624050000,"content":"Apple's new MacBook Pro models are powered by cutting-edge M3 Apple silicon, but the base configuration 14-inch model starting at $1,599 comes with just 8GB of working memory. In 2012, Apple launched the first MacBook Pro with Retina display, which also started with 8GB of RAM. Of course, Apple now uses integrated chips with unified memory architecture, which is why the company feels confident in arguing that 8GB on a Mac is <a href=\"https://www.macrumors.com/2023/11/08/8gb-ram-m3-macbook-pro-like-16-gb-pc/\">comparable to 16GB on rival systems</a>. \r<br />\n\r<br />\n<div></div>\r<br />\nBut not everyone is convinced. Apple's decision not to equip base models with at least 16GB of RAM in late 2023 has proved incongruous to many users, including Vadim Yuryev, co-host of the YouTube channel <a href=\"https://www.youtube.com/watch?v=hmWPd7uEYEY\">Max Tech</a>. Yuryev decided to perform several real-world tests on two 14-inch M3 MacBook Pro models, one with 8GB and the other upgraded to 16GB of unified memory. The embedded video above has all the results.  \r<br />\n\r<br />\nPerhaps unsurprisingly, Yuryev saw significant performance improvements across the board using the 16GB machine under both middling and heavier workloads. The 8GB model suffered double-digit losses in Cinebench benchmarks, and took several minutes longer to complete photo-merging jobs in Photoshop as well as media exports in Final Cut and Adobe Lightroom Classic.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/max-tech-8gb-16gb-mbp2.jpg\" width=\"2491\" height=\"1400\" />\r<br />\nThese tests were conducted as single operations with nothing else running, but also repeated with browser tabs, YouTube videos, spreadsheets, emails, and the like, open in the background to simulate typical real-world multi-tasking scenarios. As expected, the performance gap between the two machines widened further as the 8GB increasingly relied on its SSD swap file, while all-round responsiveness took a hit. Yuryev even reported crashes on the 8GB model during Blender rendering and a Final Cut export.\r<br />\n\r<br />\nNotably, Blender's raytracing acceleration was available as an option on the 16GB models, but was conspicuously absent on the 8GB MacBook Pro for an identical rendering job, suggesting the reduced memory pool actually prevents the GPU cores from utilizing certain features. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/max-tech-8gb-16gb-mbp1.jpg\" width=\"2490\" height=\"1401\" />\r<br />\nTests like these present a dilemma for customers looking to purchase a new MacBook Pro (or a new 8GB iMac, for that matter). Settling for 8GB appears to hinder the M3 chip's performance, but choosing 16GB or 24GB configuration options at checkout costs an extra $200 and $400, respectively, and Apple's machines cannot be upgraded at a later date because of their unified memory architecture. \r<br />\n\r<br />\nAfter factoring in the extra $200 for 16GB on a 14-inch M3 MacBook Pro, an M3 Pro model with 18GB and several other extra features is only $200 more at $1,999. More galling perhaps is the fact that rival laptops at similar ballpark prices (Microsoft Surface or Lenovo Thinkpad, for example) come with at least 16GB of memory as standard. Apple customers are expected to pay $200 extra each jump up, which surely includes a healthy markup, however much Apple pays its RAM suppliers.\r<br />\n\r<br />\nIs Apple's 8GB starting configuration for a $1,599 MacBook Pro really acceptable in 2023? And has the company's memory pricing policy affected your own purchase options? Let us know in the comments.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">MacBook Pro 14 &amp; 16\" </a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_16\">14\" &amp; 16\" MacBook Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macbook-pro.90\">MacBook Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/10/8gb-ram-in-m3-macbook-pro-proves-the-bottleneck/\">8GB RAM in M3 MacBook Pro Proves the Bottleneck in Real-World Tests</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/8gb-ram-in-m3-macbook-pro-proves-the-bottleneck-in-real-world-tests.2410564/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5ea68128293dffc9c893ff745dad1e04a731bb94ec8cad1c88c1a83d99e796e6","category":"Apple"}