{"title":"165 Comparing corn earlage to a blend of corn silage and grain when fed at two different inclusions for finishing cattle","link":"https://academic.oup.com/jas/article/102/Supplement_2/210/7664713?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>An experiment was conducted to evaluate the effects of feeding earlage as the sole source of roughage and grain in a finishing diet when compared with corn silage plus grain at equal forage NDF inclusions in the diet. Crossbred yearling steers [n = 216; initial body weight (BW) = 471 ± 14.1kg] were fed one of 4 experimental diets in a 2 × 2 factorial treatment arrangement with roughage type and forage inclusion being the 2 factors. Treatment diets were formulated for earlage to provide all the grain the diet (74%) which provided 14.8% forage and was compared with 29.6% corn silage and 44.4% corn as a 50:50 blend of dry rolled corn (DRC) and high moisture corn (HMC). The other two diets were formulated for corn silage to provide a standard roughage inclusion for finishing diets (i.e., corn silage at 15% to supply 7.5% forage in the diet). To match 7.5% roughage with earlage providing all the roughage, another diet included earlage at 37%, with an additional 37% corn included as the 50:50 blend of HMC and DRC. All diets included 20% wet distiller’s grains (WDGS) and 6% supplement. The two inclusions of forage were either 7.5 or 14.8% forage as either earlage or corn silage. Earlage was assumed to provide 20% forage and corn silage to provide 50% forage, on a DM basis. Cattle were stratified into 3 BW blocks, then assigned randomly assigned to pens within block, and treatment assigned randomly to pens. A total of 24 pens containing 9 steers in each were used with pen as the experimental unit. Feeding performance, carcass characteristics and liver abscess prevalence were evaluated using the MIXED procedure of SAS with BW block and treatment being fixed effects. No interactions between roughage type or forage inclusion were observed for performance or carcass traits (<span>P</span> &gt; 0.13) except for marbling or liver abscesses (<span>P</span> &lt; 0.09). When cattle were fed a diet with corn silage as the roughage source, greater dry matter intakes (DMI) and average daily gain (ADG) were observed (<span>P</span> ≤ 0.01), but feed efficiency was not significantly different (<span>P</span> = 0.35). However, when evaluating effects of NDF inclusion, cattle fed 7.5% forage in the diet were 6.8% more efficient than cattle fed 14.8% forage and tended to have greater gain (<span>P</span> = 0.10), but no significant differences were observed for intake (<span>P</span> = 0.11). These data suggest that cattle fed earlage will eat and gain less than cattle fed a blend of corn silage and grain when estimated forage is equivalent, and when earlage is fed as the sole source of grain, cattle will be less efficient than when conventional roughage inclusions are fed.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5eb507f11fd0db40dbc9e5c2abad77934b8d8d8a20a85daa79a4566cfc9382d7","category":"Environment"}