{"title":"Body mass index gets smack down: AMA calls out harms and “racist exclusion”","link":"https://arstechnica.com/?p=1947915","date":1686777089000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-875568858-800x496.jpeg\" alt=\"Body mass index gets smack down: AMA calls out harms and “racist exclusion”\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-875568858-scaled.jpeg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/the-hospital-j-m-de-los-rios-a-weighing-scale-in-the-news-photo/875568858?adppopup=true\">Getty | Thierry Monasse</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Body mass index has for decades been used as a shorthand for assessing body fat and weight-related health risks. But for about just as long, critics have noted the simple calculation is laden with problems; BMI doesn’t actually measure fat mass, account for its distribution, or how those differ by age, gender, ethnicity, race, and how those differences affect health risks. Calculations and cutoffs are largely based on past generations of non-Hispanic white people. And BMI classifications mislead people on their individual risks of disease and death and can lead to substandard care for eating disorders.</p>\n<p>Now, it seems the hefty criticism has finally reached a critical mass. During the annual meeting of the American Medical Association (AMA) this week in Chicago, physicians and medical students voted to adopt <a href=\"https://www.ama-assn.org/system/files/a23-refcomm-d-annotated.pdf\">a strongly worded policy</a> acknowledging the calculation's \"significant limitations\" and \"historical harms,\" including \"racist exclusion.\" While the massive medical group acknowledged that BMI remains useful for population-level trends and associations, the policy called for doctors to become familiar with the calculation's problems and explore alternative measurements for diagnosing obesity and assessing health risks.</p>\n<p>\"There are numerous concerns with the way BMI has been used to measure body fat and diagnose obesity, yet some physicians find it to be a helpful measure in certain scenarios,\" AMA Immediate Past President Jack Resneck, Jr., said in <a href=\"https://www.ama-assn.org/press-center/press-releases/ama-adopts-new-public-health-policies-improve-health-nation-6\">a statement</a>. \"It is important for physicians to understand the benefits and limitations of using BMI in clinical settings to determine the best care for their patients.\"</p></div><p><a href=\"https://arstechnica.com/?p=1947915#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1947915&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5ec23a98ffaa742052b45d8cf4995688ea3e5276c7b4d6c4bd31f45135ab593c","category":"Tech"}