{"title":"Numerical Study of Concrete: A Mesoscopic Scale Simulation Methodology","link":"https://www.preprints.org/manuscript/202405.0719/v1","date":1715358685000,"content":"This study is dedicated to understanding and simulating the mechanical properties of concrete, with a specific focus on the mesoscopic scale. Investigating concrete at this level involves examining its composition as a heterogeneous amalgamation comprising mortar, aggregates, and the interfacial transition zone (ITZ). Such an approach provides a detailed examination of the material's behavior and attributes. Numerical models are utilized, leveraging the finite element method (FEM), to examine the behavior of concrete. The study employs MATLAB programming to develop three-dimensional models, subsequently subjected to FEM analysis. Various mesoscopic Representative Volume Elements (RVEs) are formulated, encompassing varied shapes and dimensions. The MATLAB framework generates input files for numerical FEM simulations, replicating compression strength tests. As complexity increases with the inclusion of the ITZ, prismatic RVEs are developed. The proposed mesoscopic model establishes a foundational framework for a numerical simulation methodology tailored to laboratory compression tests. It provides detailed insights into concrete behavior, elucidating deformation, and fracture mechanisms. Although not a complete substitute for experimental methods, these models offer a cost-effective and expeditious alternative, pinpointing vulnerable areas and exploring the implications of additional materials on concrete behavior. Experimental data and virtual tests pave the way for mitigating carbon footprint and improving concrete sustainability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5ec88180fb293f4db79f6112e2ce8a7ab5fa3b6e61c199b60ea7a24b294c1bf0","category":"Interdisciplinary"}