{"title":"Assessing the importance of landscape, anthropogenic and spatial factors in predicting urban nesting sites: the Columbidae of the city of Rabat (Morocco) as a case study","link":"https://academic.oup.com/jue/article/doi/10.1093/jue/juae012/7691474?rss=1","date":1717804800000,"content":"<span><div>Abstract</div>To adequately control the urban bird populations, the determinants of nest habitat selection must be identified and its processes well understood. In this study, we investigated this issue with regard to <span>Columba palumbus</span> (WP) and <span>Streptopelia decaocto</span> (CD) in the city of Rabat, Morocco. We used data from landscape composition, anthropogenic presence, and spatial structure, to identify the best predictors that cause variation in the CD (84 nests) and WP (141) nest occurrence using generalized linear mixed models and variation partitioning analyses (VP). Our results show that WP nest occurrence was positively associated with urban park cover and long distances to agricultural areas and negatively with short distances to roads. Significant interactions between the average noise intensity and the number of passers-by/5 min and between maximum NDVI and density of roads also explain WP nest occurrence. In CD, the nest occurrence was positively associated with covers of built-up areas and parks, the density of roads, and average noise intensity, and negatively with short distances to roads and the number of passers-by/5 min. The VP revealed that the joint effect of landscape composition and space was the most robust in explaining the WP nests occurrence, whereas the pure fraction of space and the joint effect of human presence and space were the most robust in CD. As CD and WP nest in several Mediterranean cities, it would be worthwhile to test the generality of our results using the same analytical approach in other urban areas.</span>","author":"","siteTitle":"Journal of Urban Ecology Current Issue","siteHash":"b2629340d80db12a388ca36fcbfe9116474ee0004e4144e67708fd2b8d69c975","entryHash":"5ec852160d91bd0de84b26d26af16e560ccf7dcbc1ec477e3cf424ed6457581f","category":"Environment"}