{"title":"Associations between Lantana camara L. (Verbenaceae) and common native species in an African savanna","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12375?af=R","date":1728260964000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/7f67e6cd-723f-4c8a-bcda-1c07094030e7/eso312375-toc-0001-m.png\" alt=\"Associations between Lantana camara L. (Verbenaceae) and common native species in an African savanna\" />\n<p>We explored associations between <i>Lantana camara</i> and common native species in Queen Elizabeth National Park, Uganda. The floristic composition of invaded areas differed significantly from that of noninvaded areas, with several palatable species rare or absent from <i>L. camara</i>-invaded areas. Our observations indicate the presence of potential recovery constraints that will need to be overcome after <i>L. camara</i> has been removed.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\n<i>Lantana camara</i> L. (Verbenaceae) is recognised as a problematic invasive alien plant species in many parts of the world. To eradicate or control this global invader, we need to understand the drivers of its spread and impacts and the potential for native recovery after the invader has been removed.\n\nHere, we tested for species associations between <i>L. camara</i> and native plant species and large herbivores in Queen Elizabeth National Park, Uganda. We inventoried 40,100-m<sup>2</sup> nested plots spread over a 1 × 1-km grid cell in the park's savanna landscape, with 11 plots located in uninvaded areas. Most of the plots (30 of 40) had been affected by fire.\n\n<i>Lantana camara</i> covered 29 (73%) plots, 11 (38%) of which were in open grassland. Of the large herbivores that frequented areas free of <i>L. camara</i>, the Ugandan kob <i>Adenota kob thomasi</i> Sclater tended to avoid the areas invaded. The floristic composition of invaded areas differed significantly from that of noninvaded areas, with several palatable species rare or absent from <i>L. camara</i>-invaded areas.\n\n<i>Practical implication</i>: These observations indicate the presence of potential recovery constraints that will need to be overcome after <i>L. camara</i> has been removed. Sustained efforts will be needed to suppress the invader and subsequently enrich and bolster native recovery.\n</p>","author":"Fredrick Ssali, \nRobert Baluku, \nGilbert Drileyo, \nMoses Muhumuza","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"5ecf04994b524e8c993db8bee4673224cc46aa79279af1a1d2551be2fdfe7313","category":"Environment"}