{"title":"CO2‐induced seawater acidification impairs the stinging cells of a jellyfish","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12616?af=R","date":1719998052000,"content":"<h2>Abstract</h2>\n<p>CO<sub>2</sub>-induced seawater acidification has been shown to modify predator–prey interactions in many marine taxa. Scyphozoans play an important role in the trophic dynamics of marine ecosystems during their blooms in coastal waters; however, the impacts of seawater acidification on the predation behavior of these animals are poorly understood. Here, we aimed to examine the impact of a decrease in seawater pH on the feeding behavior and growth of ephyrae (juvenile medusae) of the scyphozoan <i>Aurelia coerulea</i>. Combining bulk and single-cell RNA sequencing approaches, we assessed transcriptomic changes of ephyrae under a laboratory-based pH 7.6 condition. We found that the feeding rates and growth of ephyrae were significantly inhibited by a decrease in seawater pH. Furthermore, transcriptome analysis showed that a decline in pH significantly reduced the expression of genes related to toxins and nematocyst structure in ephyrae. These findings were further confirmed by single-cell transcriptomic analyses and revealed that low pH impaired the toxin activity and energy metabolism of stinging cells. The pH recovery experiment indicated that moving ephyrae from seawater with pH 7.6 into seawater with pH 8.1 greatly restored their feeding, growth, and toxin-related and nematocyst structure–related gene expression. However, exposure to pH 7.6 for 23 d could not recover the decrease in the feeding and growth of ephyrae. Together, these findings indicate that CO<sub>2</sub>-induced acidification compromised the stinging cells of <i>A. coerulea</i> ephyrae, with concomitant negative consequences on predation and growth that are likely to alter predator–prey interactions, with consequent effects on community structure and ecosystem.</p>","author":"Tingting Sun, \nYongxue Li, \nSaijun Peng, \nFanghan Wang, \nLei Wang, \nJianmin Zhao, \nZhijun Dong","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"5ed03e8f66c81eff57d0e231fd48f27b9ce78326d47af8612edbec6a7a792a9b","category":"Environment"}