{"title":"Run-in with teammate derails Gaviria’s hopes on Giro stage 2","link":"https://cyclingtips.com/2021/05/run-in-with-teammate-derails-gavirias-hopes-on-giro-stage-2/","date":1620582925000,"content":"<p>Juan Sebastián Molano led the pack in the last few hundred meters on Sunday’s second stage of the Giro d’Italia as UAE-Team Emirates hoped to set up Fernando Gaviria for the sprint, but things didn’t exactly go according to plan for the squad as the final moments of the day. Instead of helping launch Gaviria to victory, Molano instead helped close a narrow window on his own teammate, who fortunately managed to stay upright despite running into the barriers.</p>\n\n\n\n<p>Gaviria would finish 24th on the day as Tim Merlier (Qhubeka-Assos) took the win ahead of Giacomo Nizzolo (Qhubeka-Assos) and Elia Viviani (Cofidis).</p>\n\n\n\n<p>“These are race situations, they happen and you have to keep trying,” Gaviria said after the stage.</p>\n\n\n<blockquote>\n<p>Close-up of <a href=\"https://twitter.com/hashtag/FernandoGaviria?src=hash&amp;ref_src=twsrc%5Etfw\">#FernandoGaviria</a> falling into the barriers after colliding with his own teammate in the sprint. <a href=\"https://twitter.com/hashtag/Giro104?src=hash&amp;ref_src=twsrc%5Etfw\">#Giro104</a> <a href=\"https://t.co/BJyRCYrK5D\">pic.twitter.com/BJyRCYrK5D</a></p>\n<p>— CyclingTips (@cyclingtips) <a href=\"https://twitter.com/cyclingtips/status/1391423980955848704?ref_src=twsrc%5Etfw\">May 9, 2021</a></p></blockquote>\n<p> </p>\n\n\n<p>Molano was at the head the field in the final 250 meters of the 179 km stage from Stupingi to Novara, but Gaviria was not immediately behind his teammate at first, with Viviani tucked in behind Molano as Merlier started to wind up his sprint with Gaviria just behind him. Merlier launched on the left side as the road curved slightly, while Gaviria tried to launch through a narrow gap on Molano’s right.</p>\n\n\n\n<p>As Merlier pulled to the front, however, Molano drifted slightly to his right, leaving Gaviria no room to get by. Gaviria made contact with his teammate as he pulled even and the collision drove him into the barriers. He skillfully avoided crashing, but the incident took him out of contention for the stage.</p>\n\n\n\n<p>Afterward, Gaviria was optimistic despite the miscue.</p>\n\n\n\n<p>“We have to analyze what we can improve. It could have been worse. We did not fall,” he said.</p>\n\n\n\n<p>“There is nothing to worry about and we will try again.”</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/run-in-with-teammate-derails-gavirias-hopes-on-giro-stage-2/\">Run-in with teammate derails Gaviria’s hopes on Giro stage 2</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"5ed0b5061a15deaf71e63edb0a921c7e4cc0deb2d2980e3a2be4f52514bf5f5f","category":"Cycling"}