{"title":"Tidal ปรับระบบสมาชิกใหม่ เพิ่มสมาชิกฟรีมีโฆษณา, จ่ายเงินฟัง lossless เริ่มต้น 129 บาทต่อเดือน","link":"https://www.blognone.com/node/125918","date":1637318074000,"content":"<div><div><div><p>บริการสตรีมมิ่งเพลง Tidal ประกาศปรับแพลนครั้งใหญ่ โดยรอบนี้ Tidal เพิ่มแพลนสตรีมมิ่งแบบฟรีมีโฆษณาเป็นครั้งแรก และปรับ Tidal HiFi แยกเป็น 2 แบบ</p>\n<p>สำหรับแผนฟรีมีโฆษณา Tidal เรียกว่า Tidal Free ซึ่งแพลนนี้จะมีให้บริการเฉพาะในสหรัฐฯ เท่านั้น คุณภาพสตรีมมิ่งเพลงจะอยู่ที่ 160kbps</p>\n<p>ส่วนถัดไปเป็น Tidal HiFi สำหรับฟังเพลงคุณภาพ Lossless มีให้เลือก 2 แบบ คือ Tidal HiFi และ Tidal HiFi Plus โดย Tidal HiFi (หรือ Standard Plan เดิม) คิดราคา 9.99 ดอลลาร์ต่อเดือน หรือ 129 บาทต่อเดือนในไทย ให้คุณภาพเสียงสูงสุดถึง 1,411kbps พร้อมฟีเจอร์ Tidal Connect และ My Activity ให้ข้อมูลอินไซด์เกี่ยวกับการฟังเพลง ส่วน Tidal HiFi Plus ราคา 19.99 ดอลลาร์ต่อเดือนหรือ 258 บาทต่อเดือนในไทย จะได้ฟีเจอร์เพิ่มคือคอนเทนต์เสียงพรีเมียมจาก Tidal, ระบบ Dolby Atmos, Sony 360 Audio และ Master Quality Authenticated (MQA)</p>\n<p>การปรับแผนสตรีมมิ่งแบบใหม่ของ Tidal นี้เนื่องจากก่อนหน้านี้บริการเพลงคุณภาพสูงถือเป็นจุดเด่นของ Tidal แต่ปัจจุบันคู่แข่งรายใหญ่ทั้ง Spotify และ Apple Music ต่างก็มีบริการเพลงคุณภาพสูงให้ฟังโดยไม่เก็บค่าใช้จ่ายเพิ่ม จึงเป็นที่มาให้ Tidal ต้องปรับแพลนเพื่อให้เหมาะสมกับคู่แข่งในท้องตลาด</p>\n<p>นอกจากฝั่งผู้ใช้งานแล้ว Tidal ยังปรับแผนการจ่ายเงินทางฝั่งศิลปินด้วย โดย Tidal ระบุว่าจะมีการเปลี่ยนแปลงใหญ่ ๆ อยู่สองเรื่อง</p>\n<p>เรื่องแรก คือการจ่ายเงินตรงถึงศิลปิน (direct-to-artist payments) คือค่าสมาชิกจากผู้สมัคร HiFi Plus จะถูกกันไว้ 10% เพื่อแบ่งให้ศิลปินที่ฟัง (ยิ่งฟังเพลงของใครมาก ศิลปินยิ่งได้ส่วนนี้มาก) พร้อมรายงานให้ทราบด้วยว่าจ่ายศิลปินคนไหนไปเท่าไร ซึ่งโมเดลการจ่ายเงินนี้จะเป็นการจ่ายเพิ่มเติมจากเดิมที่แพลตฟอร์มจ่ายให้ศิลปินเป็นปกติ</p>\n<p>ส่วนถัดไปคือ Tidal จะปรับค่าลิขสิทธิ์ใหม่เรียกว่า fan-centered royalties ค่าสตรีมมิ่งจากผู้ใช้ HiFi Plus จะไม่ถูกนำไปคิดรวม แต่จะคิดเป็นกิจกรรมการสตรีมมิ่งที่เกิดขึ้นจริงและจ่ายเงินค่าลิขสิทธิ์เพลงให้ศิลปิน และแสดงให้ผู้ใช้ทราบว่าสตรีมมิ่งใครไปและแพลตฟอร์มจ่ายเงินออกไปเท่าไร โดยฟีเจอร์นี้จะเปิดให้ใช้งานในปีหน้า</p>\n<p>ที่มา - <a href=\"https://www.theverge.com/2021/11/17/22787051/tidal-free-hifi-plus-announced-features-artist-payments\">The Verge</a>, <a href=\"https://www.gsmarena.com/tidal_announces_new_free_tier_drops_hifi_tier_down_to_10-news-51890.php\">GSM Arena</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/79e7e87d7047f3c523c64c08682fd8bf.png\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/26ea907aa647e38dbcc564664900af27.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tidal\">Tidal</a></div><div><a href=\"/topics/music-streaming\">Music Streaming</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5ed41112d5abbdfe60952f63082271c99b2c4be6069397958bac69cdfd721618","category":"Thai"}