{"title":"Google Cloud เปิดตัว TPU v5e รุ่นใหม่ เน้นประสิทธิภาพต่อราคาดีกว่า TPU v4 สองเท่า","link":"https://www.blognone.com/node/135515","date":1693396356000,"content":"<div><div><div><p>Google Cloud เปิดตัวชิปประมวลผลปัญญาประดิษฐ์ Cloud TPU v5e เวอร์ชันใหม่ที่อัพเกรดจาก <a href=\"https://www.blognone.com/node/133357\">TPU v4 ซึ่งเริ่มใช้มาตั้งแต่ปี 2020</a></p>\n<p>ตอนนี้ยังมีรายละเอียดของ TPU v5e ออกมาไม่มากนัก แต่มันเป็น TPU เวอร์ชันคัสตอม (ตัวท้าย e) ที่เน้นประสิทธิผลเรื่องต้นทุน (cost-efficiency) กว่า TPU รุ่นปกติ จากตัวเลขของกูเกิลระบุว่ามีประสิทธิภาพต่อดอลลาร์ในการเทรนโมเดล LLM ดีกว่า TPU v4 สูงสุดราว 2 เท่า และประสิทธิภาพต่อดอลลาร์ในการรันโมเดลดีกว่าสูงสุด 2.5 เท่า</p>\n<p>นอกจากเรื่องต้นทุนแล้ว การเช่า TPU v5e บนคลาวด์กูเกิลเพื่อทำงาน AI ยังรองรับการรันบนชิประดับหลายหมื่นตัว ทะลุข้อจำกัดของ TPU v4 ที่รันได้สูงสุด 3,072 ตัว (slice vs multislice) ซึ่งเป็นเทคนิคที่กูเกิลใช้เทรนโมเดล PaLM มาก่อน ตอนนี้เปิดให้ลูกค้าภายนอกเช่าใช้งานแล้ว</p>\n<p>TPU v5 ยังปรับแต่งมาสำหรับเฟรมเวิร์คยอดนิยม เช่น JAX, PyTorch, TensorFlow รวมถึงรองรับ PyTorch/XLA 2.1 เวอร์ชันหน้าด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/7632f968b45c90c7df8d10d224ec54af.jpg\" /></p>\n<p>ส่วนคนที่ยังต้องการรันงานด้วยจีพียูแบบดั้งเดิม กูเกิลยังเปิดให้บริการ VM ประเภทใหม่ A3 ที่มีจีพียู NVIDIA H100 รุ่นใหม่ล่าสุดอย่างเป็นทางการ (GA) หลังจากเริ่มเปิดทดสอบมาตั้งแต่ช่วงเดือนมีนาคม</p>\n<p>A3 VM ใช้ซีพียู Xeon Scalable Gen 4 สองตัว, จีพียู NVIDIA H100 จำนวน 8 ตัว, หน่วยความจำ 2TB ตัวอย่างลูกค้าที่นำไปรันงานจริงแล้วคือ Midjourney ที่บอกว่าเร็วกว่าการใช้จีพียู NVIDIA A100 รุ่นก่อนถึง 2 เท่า</p>\n<p>ที่มา - <a href=\"https://cloud.google.com/blog/products/compute/announcing-cloud-tpu-v5e-and-a3-gpus-in-ga\">Google</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-cloud\">Google Cloud</a></div><div><a href=\"/topics/tpu\">TPU</a></div><div><a href=\"/topics/gpu\">GPU</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/cloud-computing\">Cloud Computing</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5eea140885cbfecf9a08addaadf3b117433002bdd81a4288ebff0f2483689e32","category":"Thai"}