{"title":"Amazon named its “labyrinthine” Prime cancellation process after Homer’s Iliad","link":"https://arstechnica.com/?p=1949330","date":1687379812000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/getty-amazon-logo-800x533.jpg\" alt=\"An Amazon company logo displayed on a sign at a tech fair.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/getty-amazon-logo-scaled.jpg\">Enlarge</a> <span>/</span> An Amazon logo at the Viva Tech fair in Paris, France, on Thursday, June 15, 2023. (credit: Getty Images | Bloomberg)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Federal Trade Commission sued Amazon today, claiming the online giant violated US law by tricking consumers into signing up for the $14.99-per-month Amazon Prime subscription service and making it annoyingly difficult to cancel.</p>\n<p>\"For years, Defendant Amazon.com, Inc. has knowingly duped millions of consumers into unknowingly enrolling in its Amazon Prime service,\" the FTC alleged in a <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.wawd.323520/gov.uscourts.wawd.323520.1.0_1.pdf\">complaint</a> filed in US District Court for the Western District of Washington. \"Specifically, Amazon used manipulative, coercive, or deceptive user-interface designs known as 'dark patterns' to trick consumers into enrolling in automatically renewing Prime subscriptions.\"</p>\n<p>The FTC said that until recent changes spurred by the agency's investigation, Amazon required Prime customers who wanted to cancel to go through a \"four-page, six-click, fifteen-option cancellation process.\" For example, Amazon's \"End Membership\" button did not actually end membership in Prime, the FTC said. Clicking \"End Membership\" redirected consumers to Amazon's actual, extremely tedious process for canceling, the FTC said.</p></div><p><a href=\"https://arstechnica.com/?p=1949330#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1949330&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5efb48c2a83cc740059c7156a14d122c0c227bfa709620f33859c4ae7578a4d6","category":"Tech"}