{"title":"Waymo Self-Driving Car","link":"https://markpeak.net/waymo/","date":1692156630000,"content":"<p>ถัดจากตอนของ <a href=\"https://markpeak.net/chris-urmson-aurora/\">Chris Urmson แห่งบริษัท Aurora</a> ก็มาต่อกันที่บริษัทรถยนต์ไร้คนขับอีกแห่งคือ Waymo ซึ่งเป็นบริษัทลูกของ Alphabet (และ Urmson เองก็เคยเป็นหัวหน้าทีมรถไร้คนขับที่นี่ก่อนลาออกไป)</p>\n<p>ผู้ให้สัมภาษณ์คือ Tekedra Mawakana ซึ่งปัจจุบันเป็น Co-CEO ของ Waymo รับผิดชอบงานส่วนอื่นๆ ที่ไม่ใช่ฝั่ง tech</p>\n<p>เธอเรียนจบและทำงานในสายกฎหมาย แล้วเข้ามาทำงานกับ Waymo ในด้าน public policy เมื่อปี 2017, ได้โปรโมทเป็น COO ในปี 2019 และ Co-CEO ในปี 2021 หลัง <a href=\"https://www.blognone.com/node/122020\">John Krafcik CEO คนเดิมลงจากตำแหน่ง</a></p>\n<p>แนวทางของ Waymo ต่างไปจาก Aurora ตรงที่ Waymo เน้นไปที่รถยนต์นั่ง ให้บริการแท็กซี่ไร้คนขับ Waymo One ในเขตเมือง ส่วน Aurora โฟกัสไปที่รถบรรทุกระหว่างเมือง ถ้าจะให้เทียบ คู่แข่งโดยตรงของ Waymo คือ Cruise ของ GM มากกว่า</p>\n<p></p>\n<p> </p>\n<p><strong>การทำงานของ Waymo</strong></p>\n<ul>\n<li>รถยนต์ที่ใช้จำเป็นต้องมีพวงมาลัยอยู่ เพราะติดเรื่องกฎระเบียบรถยนต์เดิม ไม่สามารถเอาออกได้</li>\n<li>รถของ Waymo มีความระมัดระวังสูงมาก มีถุงปลิวมา หรือมีลูกบอลเด้งมา จะหยุดทันที และจะขับต่อจนกว่าจะมั่นใจจริงๆ (เช่น ไม่มีเด็กวิ่งตามบอลมา) ผลคือคนบ่นว่าใช้เวลาขับข้ามแยกใหญ่ๆ นาน</li>\n<li>ปัญหาอีกอย่างของรถยนต์ไร้คนขับคือ เวลาไปถึงแยกที่ไม่มีไฟแดง ตามกฎหมายอเมริกาคือคันที่ไปถึงแยกจะได้เลี้ยวก่อน แต่เมื่อคันหนึ่งไม่มีมนุษย์นั่งอยู่ด้วย คนขับรถอีกคันเห็นเข้าว่าไม่มีคนขับ ก็จะแย่งเลี้ยวก่อน (แม้ว่ามาทีหลังก็ตาม)</li>\n<li>PUDO = Pickups and drop-offs เป็นจุดสำคัญของรถยนต์ไร้คนขับที่ต้องพัฒนา ตัวอย่างเช่น กดเรียกรถไปห้าง รถจะรู้ได้ไงว่าจะต้องไปส่งตรงประตูไหน</li>\n<li>การคิดราคาของ Waymo มองว่าตัวเองให้บริการแบบพรีเมียม ดังนั้นจะแพงกว่า Uber Premium หรือ Lyft Premium เล็กน้อย จุดเด่นคือให้ประสบการณ์การนั่งที่ดีสม่ำเสมอ สะอาด ปลอดภัย คนขับไม่ชวนคุย</li>\n</ul>\n<p><strong>เมืองและกฎระเบียบ</strong></p>\n<ul>\n<li>เลือกให้บริการที่ Phoenix ก่อนเพราะกฎระเบียบเอื้อ ตอนนี้ไปรับส่งคนที่สนามบินได้แล้ว เป็นเมืองแรกที่ทำได้, แคลิฟอร์เนียกฎระเบียบยากกว่าเท็กซัส ตอนนี้ให้บริการที่ซานฟรานซิสโกแล้ว กำลังขยายไปแอลเอ ที่ขับยากกว่า ซับซ้อนกว่า ต้องขึ้นไฮเวย์ด้วย</li>\n<li>อุบัติเหตุเกิดขึ้น 18 ครั้ง ไม่รุนแรง โดย 10 ครั้งเป็นฝ่ายอื่นวิ่งเข้ามาชนรถของ Waymo ที่อยู่นิ่ง, 8 ครั้งเป็นฝ่ายอื่นมาชน Waymo ที่กำลังวิ่ง, 0 ครั้งเกิดขึ้นที่ทางแยก (ซึ่งเป็นจุดที่เกิดอุบัติเหตุเยอะที่สุดบนท้องถนน) สรุปว่า Waymo ยังไม่เคยไปชนคนอื่นเลย</li>\n<li>เมืองที่ Waymo ให้บริการจำเป็นต้องมีแผนที่ 3D ความละเอียดสูงของเมืองนั้นด้วย ละเอียดระดับมิลลิเมตร เพื่อให้รถยนต์เห็นและเข้าใจสภาพแวดล้อมทั้งหมด</li>\n</ul>\n<p><strong>เป้าหมายปลายทาง</strong></p>\n<ul>\n<li>Waymo มองตัวเองว่าเป็น a technology company building the driver ไม่ได้ทำรถเอง ทำรถร่วมกับพาร์ทเนอร์บริษัทรถ ตอนนี้คนขับอัตโนมัติถือเป็นเวอร์ชัน 5 แล้ว</li>\n<li>Waymo Driver ซอฟต์แวร์คนขับของ Waymo เป็น generalized คือขับรถได้ทุกประเภท ไม่ได้แยกย่อย และเป้าหมายคือการขายซอฟต์แวร์ให้บริษัทรถ</li>\n<li>คนขับของ Waymo คือคนขับที่มีประสบการณ์ขับรถมากกว่าคนขับรถส่วนใหญ่ที่มีใบขับขี่ด้วยซ้ำ คนขับเป็น always-on ทำงานได้ตลอดเวลา</li>\n</ul>\n<p></p>The post <a href=\"https://markpeak.net/waymo/\">Waymo Self-Driving Car</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"5eff360bd56078a3b41e932c1d95f8dae9a2800b56dbab285b6688fe5ca9d5eb","category":"Thai"}