{"title":"Cloudflare ปล่อย HAR Sanitizer ล้างกุญแจก่อนแชร์ ป้องกันระบบซัพพอร์ตมีช่องโหว่แบบ Okta","link":"https://www.blognone.com/node/136424","date":1698341768000,"content":"<div><div><div><p>Cloudflare ปล่อยโครงการโอเพนซอร์ส HAR File Sanitizer สำหรับล้างข้อมูลสำคัญก่อนแชร์ไฟล์ request จากเบราว์เซอร์ <a href=\"https://www.blognone.com/node/136335\">หลังเกิดช่องโหว่ในระบบซัพพอร์ตของ Okta จนมีองค์กรถูกแฮกจำนวนมาก</a></p>\n<p>HAR หรือ HTTP Archive เป็นไฟล์ log ของเบราว์เซอร์ที่เรียกไปยังเซิร์ฟเวอร์ โดยทั่วไปสามารถสั่งเซฟได้จาก Developer Tools ของเบราว์เซอร์ต่างๆ เนื่องจากมีข้อมูลครบถ้วนว่าเบราว์เซอร์เรียก URL ใดและได้รับข้อมูลอะไรบ้าง จึงเป็นทางที่ได้รับความนิยมในการดีบั๊กปัญหาให้กับผู้ใช้ แต่ไฟล์ HAR จะมีข้อมูลสำคัญติดไปด้วยเสมอ ไม่ว่าจะเป็น session token, cookie หรือบางครั้งก็มี username/password ติดไปด้วย แม้ว่าหลายครั้งฝ่ายซัพพอร์ตที่ต้องการไฟล์ HAR อาจจะต้องการดูเพียงข้อมูลอื่นๆ เช่น response ที่แสดงข้อความผิดพลาด, DNS มีปัญหา</p>\n<p>หากคนร้ายได้ไฟล์ HAR ไปแล้ว และ token ต่างๆ ในไฟล์ยังไม่หมดอายุก็สามารถปลอมตัวเป็นเหยื่อได้ทันที โดยกระบวนการยืนยันตัวตนหลายขั้นตอนไม่ช่วยอะไรเพราะโทเค็นเหล่านั้นได้มาหลังการยืนยันตัวตนสำเร็จแล้ว</p>\n<p>HAR File Sanitizer จะลบ cookie ที่เกี่ยวกับ session ออกทั้งหมด รวมถึง JWT ต่างๆ ที่โปรแกรมจะลบส่วนลายเซ็นออก เพื่อให้ JWT ใช้งานไม่ได้แต่ยังอ่านข้อมูลใน JWT ได้อยู่ ในอนาคตทาง Cloudflare จะรองรับข้อมูลจากระบบยืนยันตัวตนอื่นๆ เพื่อให้แน่ใจว่าล้างข้อมูลที่ใช้ปลอมตัวเป็นเจ้าของ session ได้ครบ เหลือไว้แต่ข้อมูลสำหรับดีบั๊ก</p>\n<p>ที่มา - <a href=\"https://blog.cloudflare.com/introducing-har-sanitizer-secure-har-sharing/\">Cloudflare</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/d530d49d1817cfed0ca136ce2f3bd1d3.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/cloudflare\">Cloudflare</a></div><div><a href=\"/topics/privacy\">Privacy</a></div><div><a href=\"/topics/security\">Security</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5f059fbabb9102efb9c6597f1f2cf6346f892694241034a4f4b85af26c0b046b","category":"Thai"}