{"title":"Assessing the carrying capacity of Mercenaria mercenaria using a steady linear food web model in two pond‐culture ecosystems","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16142?af=R","date":1668758400000,"content":"<h2>Abstract</h2>\n<p>The Ecopath model was used to construct energy flow models of two pond ecosystems: <i>Mercenaria mercenaria</i>–fish–halophyte polyculture and <i>M. mercenaria</i> monoculture. Carrying capacities (CCs) of <i>M. mercenaria</i> were evaluated using energy flow models. <i>Lateolabrax maculatus</i> and <i>M. mercenaria</i> showed the highest biomass in the polyculture and monoculture ecosystems, respectively, and zoobenthos represented the highest trophic levels (TLs) in both ecosystems. Energy transfer efficiency between TLs I and II, total system throughput, and primary production were significantly higher under polyculture than under monoculture. Imported food strongly affected the energy flow structure of polyculture ecosystem. The dominant food chains in the polyculture and monoculture ecosystems were detritus and predatory food chains, respectively. The ecological and production CC under polyculture (1458.84 and 1632.51 g m<sup>−2</sup>, respectively) were 10.14- and 8.25-fold higher than those under monoculture (143.87 and 197.99 g m<sup>−2</sup>, respectively). Polyculture is better suited for <i>M. mercenaria</i> than monoculture because of higher resource utilization efficiency and <i>M. mercenaria</i> CC. Estimating the CC of <i>M. mercenaria</i> using Ecopath models can help improve the aquaculture management; however, it should be considered that the Ecopath model cannot simulate inorganic processes, so caution should be exercised while using the estimated CC-based Ecopath model.</p>","author":"Jie Feng, \nTao Zhang, \nHao Song, \nZheng‐lin Yu, \nMei‐jie Yang, \nZhi Hu, \nCong Zhou, \nPu Shi, \nWei Zhao, \nLiang Zhao, \nPeng‐peng Hu, \nPei‐zhen Ma, \nXiang‐li Tian, \nJian Liang, \nYong‐jun Guo, \nHai‐zhou Li, \nWei‐dong Li, \nTao Bai","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"5f0811c6c80f750482345fce0d04208f5e6a37fbba6365227a4ee0642c7cee7b","category":"Environment"}