{"title":"Heathland management affects soil response to drought","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14641?af=R","date":1714021266000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/06c52140-fd4b-4277-9794-cd4771f79850/jpe14641-toc-0001-m.png\" alt=\"Heathland management affects soil response to drought\" />\n<p>Understanding ecosystem response to drought is crucial for maintaining biodiversity and mitigating climate change feedbacks. Heathlands are threatened by high nitrogen deposition, a lack of management and an increasing frequency of drought. Our results emphasize the importance of frequent mowing (decadal) as a management practice that promotes a younger and more <i>Calluna</i>-dominated plant community for reducing soil C losses under future climate change-induced drought conditions. The active management of heathlands is essential not only for keeping above-ground vegetation dynamics, but also for maintaining below-ground soil nutrient and carbon pools.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nDrought can affect ecosystem functioning by altering plant–soil interactions, posing a significant threat to vulnerable ecosystems like heathlands. In heathlands, ongoing nitrogen deposition increases the dominance of fast-growing grasses over the slow-growing shrub <i>Calluna vulgaris</i>. These changes above-ground can influence soil dynamics and heathlands' responses to drought. Here, we assessed whether the legacy effects of drought on heathland soils depended on mowing times as a management practice commonly used to regenerate <i>Calluna</i> and decrease the abundance of fast-growing grasses.\n\nUsing a long-term field experiment, we investigated if soil response to drought differed under <i>Calluna</i> and grasses, as well as under <i>Calluna</i> plants of different growth stages through different mowing times. We hypothesized that drought would decrease soil C and nutrient pools underneath grasses and younger <i>Calluna</i> plants through its impact on soil microbial communities.\n\nOur results show that long-term drought decreased soil C but only underneath grasses and old <i>Calluna</i>, while under young <i>Calluna</i>, soil C increased under drought when compared to control conditions. Bacterial and fungal community composition differed between drought and control and were affected by the growth stage of <i>Calluna</i> but not by plant growth strategies. Furthermore, drought and <i>Calluna</i> growth stage-induced changes in bacterial communities directly affected total soil C and indirectly by reducing microbial C, which was positively related to total soil C.\n\n<i>Synthesis and applications</i>. Understanding ecosystem response to drought is crucial for maintaining biodiversity and mitigating climate change feedbacks. Heathlands are threatened by high nitrogen deposition, a lack of management and an increasing frequency of drought. Our results emphasize the importance of frequent mowing (decadal) as a management practice that promotes a younger and more <i>Calluna</i>-dominated plant community for reducing soil C losses under future climate change-induced drought conditions. The active management of heathlands is essential not only for keeping above-ground vegetation dynamics, but also for maintaining below-ground soil nutrient and carbon pools.\n</p>\n<h2>Samenvatting</h2>\n<p>\n\nDroogte beïnvloedt het functioneren van ecosystemen door veranderende interacties tussen planten en bodems, wat gevolgen kan hebben voor kwetsbare ecosystemen zoals heide, waar stikstofdepositie zorgt voor een toename in snel-groeiende grassen 10 koste van langzaam-groeiende <i>Calluna vulgaris</i>. Deze veranderingen bovengronds kunnen gevolgen hebben voor de bodem en het effect van droogte op heidevegetatie. Hier testten we of het effect van droogte op heidebodems afhangt van de timing van maaien. Maaien is een veelgebruikte beheersmaatregel om <i>Calluna</i> te verjongen en vergrassing te verminderen.\n\nWij onderzochten in een langjarig droogte experiment of het effect van droogte op de bodem afhangt van de plantensoort—snel-groeiend gras of langzaam-groeiende <i>Calluna</i>—en van het groeistadium van <i>Calluna</i> als gevolg van verschillend maaibeheer. Onze hypothese was dat droogte een negatief effect heeft op bodem koolstof en nutriënten onder grassen en jonge <i>Calluna</i> planten, door veranderingen in de bodem-microbiële gemeenschap.\n\nOnze resultaten laten zien dat chronische droogte de hoeveelheid bodemkoolstof vermindert onder grassen en oude <i>Calluna</i>, terwijl onder jonge <i>Calluna</i> bodemkoolstof toenam vergeleken met controlecondities. Bacterie- en schimmelgemeenschappen verschilden in droogte- en controleplots en tussen groeistadia van <i>Calluna</i>, maar niet tussen <i>Calluna</i> en grassen. De veranderingen in bacteriegemeenschappen door droogte en maaibeheer beïnvloedden bodemkoolstof direct, maar ook indirect door een lagere microbiële biomassa.\n\n<i>Synthese en toepassing</i>. Voor het behoud van biodiversiteit en het mitigeren van klimaatverandering is het van cruciaal belang dat we begrijpen hoe ecosystemen reageren op droogte. Heidevelden worden bedreigd door stikstofdepositie, toenemende droogte, en onvoldoende beheer. Onze resultaten benadrukken het belang van regelmatig (grofweg elke tien jaar) maaibeheer om bodemkoolstofverliezen onder toenemende droogte te voorkomen door het promoten van een jonge, <i>Calluna</i>-gedomineerde vegetatie. Actief heidebeheer is niet alleen belangrijk voor het behouden van de karakteristieke bovengrondse biodiversiteit, maar ook voor het veiligstellen van bodemkoolstof en -nutriëntenvoorraden.\n</p>","author":"Mariana Gliesch, \nLeonardo Hinojosa Sanchez, \nEvelien Jongepier, \nCelia Martin, \nYahan Hu, \nAlbert Tietema, \nFranciska T. de Vries","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"5f16a36c1c7d1cac2b7fe619dc70165cf0956ea818c74b15ae85bd84ba874681","category":"Environment"}