{"title":"Interactions between proteins and phenolics: effects of food processing on the content and digestibility of phenolic compounds","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13275?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<p>Phenolic compounds have recently become one of the most interesting topics in different research areas, especially in food science and nutrition due to their health-promoting effects. Phenolic compounds are found together with macronutrients and micronutrients in foods and within several food systems. The coexistence of phenolics and other food components can lead to their interaction resulting in complex formation. This review article aims to cover the effects of thermal and non-thermal processing techniques on the protein–phenolic interaction especially focusing on the content and digestibility of phenolics by discussing recently published research articles. It is clear that the processing conditions and individual properties of phenolics and proteins are the most effective factors in the final content and intestinal fates of phenolic compounds. Besides, thermal and non-thermal treatments, such as high-pressure processing, pulsed electric field, cold plasma, ultrasonication, and fermentation may induce alterations  in those interactions. Still, new investigations are required for different food processing treatments by using a wide range of food products to enlighten new functional and healthier food product design, to provide the optimized processing conditions of foods for obtaining better quality, higher nutritional properties, and health benefits. © 2024 Society of Chemical Industry.</p>","author":"Elifsu Nemli, \nGulay Ozkan, \nBusra Gultekin Subasi, \nHumeyra Cavdar, \nJose M. Lorenzo, \nChao Zhao, \nEsra Capanoglu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"5f1d9898d5d92c0c45225184264983f367bad0d8b9ed88a828e32e60d3023654","category":"Environment"}