{"title":"PSI-16 Evaluation of protein quality of defatted black soldier fly (Hermetia illucens) larvae meal compared with traditional protein sources for dogs and cats","link":"https://academic.oup.com/jas/article/102/Supplement_3/481/7757621?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>There is increased interest in the use of insects, such as black soldier fly (<span>Hermetia illucens</span>) larvae meal (BSFLM), as an alternative protein source in pet foods. However, additional information is needed to determine how BSFL protein quality compares with traditional pet food protein sources. Thus, the objectives of this study were to determine the chemical composition, amino acid digestibility, and protein quality of defatted BSFLM in comparison with whole egg powder (WEP) and chicken meal (CM) using the precision-fed cecectomized rooster assay. Fifteen cecectomized roosters (n = 5 per substrate) were randomly allocated to the test substrates BSFLM, CM, and WEP. After 26 h of feed withdrawal, 20 g of substrates were crop-fed and excreta were collected for 48 h. Digestible indispensable amino acid score (DIAAS)-like values were calculated using the Association of American Feed Control Officials (AAFCO), The European Pet Food Industry Federation (FEDIAF), and National Research Council (NRC) reference values for different life stages of dogs and cats. Data were analyzed using SAS Proc Mixed 9.4 with <span>P</span> ≤ 0.05 significance. On a dry matter basis, CM had the greatest crude protein (70.2%), followed by BSFLM (59.8%), and WEP (51.2%). In general, WEP had greater amino acid digestibility than BSFLM and CM. BSFLM (84%) and CM (84%) had comparable arginine digestibility, but less than WEP (92%). Lysine digestibility was greater for BSFLM (80%) in contrast with CM (74%), but less than WEP (91%). DIAAS-like values were calculated, revealing methionine + cysteine as the first limiting amino acids for growing puppies and adult dogs in BSFLM according to AAFCO, FEDIAF, and NRC, whereas for CM threonine was the first limiting amino acid based on AAFCO, and phenylalanine + tyrosine based on NRC and FEDIAF. NRC identified methionine and cysteine as limiting for all test substrates in adult dogs. Methionine and cysteine were limiting for growing kittens for BSFLM among AAFCO, FEDIAF, and NRC. For CM and WEP, phenylalanine and tyrosine was the first-limiting amino acid by NRC and FEDIAF. For adult cats, phenylalanine and tyrosine were the limiting amino acid for BSFLMand CM according to AAFCO and FEDIAF, with NRC identifying it as limiting across all protein sources. In summary, methionine and cysteine and/or phenylalanine and tyrosine were the primary limiting amino acids among the protein sources evaluated. In general, BSFLM had comparable indispensable standardized amino acid digestibility to CM.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5f20acd3969ef88656aa654907c868b9f3a4632082090b352f4577b25b9d0dc1","category":"Environment"}