{"title":"PSXII-13 Heavy metal and nutrient concentration in non- and livestock-mortality compost","link":"https://academic.oup.com/jas/article/102/Supplement_3/727/7757908?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Composting is a viable disposal option for livestock-mortalities and offal; however, is illegal in California due to the perceived risk of disease transfer, heavy metal and nutrient leaching into ground water. Objectives were to determine heavy metal and nutrient concentration in non- and livestock-mortality compost. The trial was conducted at the CSU, Chico composting facility where treatments included: 1) non-mortality (i.e., control; n = 3), 2) whole carcass (n = 3), 3) bone-in offal (n = 3) and 4) boneless offal compost (n = 3). Carcass and offal materials were bovine, porcine, and ovine. Carbon, nitrogen, and stock materials were similarly sourced. Control compost was produced using dairy manure and bedding materials in the windrow method while carcass and offal treatments were produced using the mounding method. Decomposition of soft tissue occurred from d 1 to 45 for bone-in and boneless offal mounds and from d 1 to 90 for the whole carcass mounds. Each decomposition period was followed by a 15-d pathogen reduction period where temperatures were maintained at or above 55°C. Compost samples (n = 3 per treatment) were collected on d 15 of the pathogen reduction period for heavy metal and nutrient analysis. All heavy metal concentrations were below regulatory limits. Data were analyzed as a completely randomized design with analysis of variance and Tukey mean separation tests. Results indicate no difference (<span>P</span> &gt; 0.05) among treatments for arsenic, cadmium, chromium, copper, lead, mercury, molybdenum, nickel, selenium, and zinc. No difference was detected among treatments for phosphorus, nitrogen, or pH (<span>P</span> &gt; 0.05). Percent organic matter was greater in conventional vs. bone-in and boneless offal (31.42 ± 2.05 % vs. 25.00 ± 2.10 % and 26.17 ± 2.30 %; <span>P</span> = 0.009). Similarly, potassium was greater in conventional vs. bone-in and boneless offal (4.25 ± 1.4 mg/kg vs. 2.5 ± 1.2 mg/kg and 2.0 ± 1.0 mg/kg; <span>P</span> &lt; 0.0001). Results suggest minimal heavy metal accumulation in non- and livestock-mortality compost and indicate that bone-in and boneless compost may contribute less organic matter and potassium compared with non-mortality compost.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5f25d8845d8decb15d4efe12feed43722a9650bb8c26febe45499551960a4bd1","category":"Environment"}