{"title":"Velotric T1 e-bike review: Slick, barely-an-ebike look hides some real power","link":"https://arstechnica.com/?p=1953746","date":1691155966000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Velotric-T1-with-background-800x388.jpg\" alt=\"Velotric T1 e-bike against gray background\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Velotric-T1-with-background-scaled.jpg\">Enlarge</a> (credit: Velotric)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>I can't get over how good the <a href=\"https://www.velotricbike.com/products/velotric-thunder-1-ebike?variant=41729522729143\">T1</a> looks. It's a beautiful bike, especially in the two-tone frosted blue color of my test ride. It's so smoothly contoured, devoid of wires and generally eye-catching that, for once, I'm more afraid of it getting stolen for its looks than for the powerful motor and battery that are well-hidden inside it. So it's a good thing the Thunder 1 comes with a number of anti-theft features installed.</p>\n<p>Over weeks of testing, the $1,800 T1 (initially the \"Thunder 1\" at launch, since renamed by Velotric) has been a fun ride. The bike has a responsive torque-sensing motor and a wide range of power options paired with actual gears. The app is about as reliable as any other Bluetooth-based single-device app (i.e., not wholly), but it provides useful data, configuration, and anti-theft options. Most of the cables, settings, and other obvious parts of an e-bike can't be seen. You just ride and notch the assist up or down when you want.</p>\n<p>You can't entirely forget the T1 is an e-bike, as every time you look down while riding, you see a thumbprint sensor. But riding it around on a steady power level and shifting gears—with it looking for all the world like a standard flat-bar bike—you can get most of the benefits of electric assist with very few of its signifiers. It quietly flattens hills and shortens miles.</p></div><p><a href=\"https://arstechnica.com/?p=1953746#p3\">Read 33 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1953746&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5f2b499c562cdf91c3308a53e10f91dccec74265a4c25af2898e824b094260cc","category":"Tech"}