{"title":"UCI's Professional Cycling Council approves changes to bottle rule","link":"https://www.cyclist.co.uk/news/9491/ucis-professional-cycling-council-approves-changes-to-bottle-rule","date":1618410196000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>14 Apr 2021</span></div>    </div></div><p>\nChanges to sanctions of new litter rule that led to disqualification of Michael Schär at the Tour of Flanders just needs UCI green light</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2020/10/in_praise_of_bidons_1.jpg?itok=ui-AN6Yy\" />  </div>\n<div>\n      <p> The Professional Cycling Council has approved amendments to the sanctions involved in the new littering rule that requires riders to discard bottles and waste in dedicated zones.</p>\n<p>Representatives of both men's and women's riders and their teams, race organisers and the UCI confirmed that while the rules themselves will remain, the sanctions placed on offending riders are to be changed following formal approval from the UCI Management Committee.</p>\n<p>Once it gets the go-ahead, the punishment at one-day races will be an initial fine and a deduction of UCI points with disqualification coming after a second infringement. At stage races the first offence will draw a fine and a deduction of points, the second will result in a one minute time penalty and the third will lead to disqualification.</p>\n<p>The UCI says all fines collected – which range from 100 to 500 Swiss francs depending on the class of the event – will go towards UCI's Environmental Strategy.</p>\n<p>This comes after AG2R-Citroën's Michael Schär was controversially disqualified from the Tour of Flanders after discarding an empty bidon next to a row of fans.</p>\n<p>This then led to an outcry from fellow riders including Alex Dowsett emphasising cycling's accessibility and the impact of gifting bottles to young fans.</p>\n<div>\n<blockquote>\n<p>This %uD83D%uDC47%uD83C%uDFFC <a href=\"https://t.co/8lglERViqT\">pic.twitter.com/8lglERViqT</a></p>\n<p>— Alex Dowsett (@alexdowsett) <a href=\"https://twitter.com/alexdowsett/status/1379007876807659520?ref_src=twsrc%5Etfw\">April 5, 2021</a></p></blockquote>\n</div>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 113: on sale now!</a></div>      <div><a href=\"/news/9068/thinking-about-a-cycling-holiday-in-2021-cyclist-tours-can-help\">Thinking about a cycling holiday later this year? Cyclist Tours can help</a></div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2021: All we know so far</a></div>    </div></div><p>\nUCI President David Lappartient said of the changes, 'The implementation of measures in 2021 aiming to reinforce rider safety is the object of careful assessment, and the UCI has pursued its consultations with all concerned.</p>\n<p>'Following these numerous exchanges with the different stakeholders, it was judged appropriate to adapt the sanctions for the new rules concerning the discarding of water bottles and waste outside dedicated litter zones.</p>\n<p>'The UCI is pleased that a solution acceptable to all parties could be found, which maintains the essential: the safety of riders and the public and cycling's environmental responsibility.'</p>\n<p>Should the changes be approved they are likely to come into place on Saturday, just in time for Sunday's Amstel Gold Race. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"5f2d7881e740e62764f147062ef1de904b591ff44515a6b98787812c48163139","category":"Cycling"}