{"title":"Autophagy Promotes Cell Death Induced by Hydrogen Peroxide in Physcomitrium patens","link":"https://academic.oup.com/pcp/article/65/2/269/7455291?rss=1","date":1701216000000,"content":"<span><div>Abstract</div>The autophagy-defective mutants (<span>atg5</span> and <span>atg7</span>) of <span>Physcomitrium patens</span> exhibit strong desiccation tolerance. Here, we examined the effects of H<sub>2</sub>O<sub>2</sub> on wild-type (WT) and autophagy-defective mutants of <span>P. patens</span>, considering that desiccation induces reactive oxygen species (ROS). We found that <span>atg</span> mutants can survive a 30-min treatment with 100 mM H<sub>2</sub>O<sub>2</sub>, whereas WT cannot, implying that autophagy promotes cell death induced by H<sub>2</sub>O<sub>2</sub>. Concomitant with cell death, vacuole collapse occurred. Intracellular H<sub>2</sub>O<sub>2</sub> levels in both WT and <span>atg5</span> increased immediately after H<sub>2</sub>O<sub>2</sub> treatment and subsequently reached plateaus, which were higher in WT than in <span>atg5</span>. The ROS scavenger N-acetylcysteine lowered the plateau levels in WT and blocked cell death, suggesting that higher H<sub>2</sub>O<sub>2</sub> plateau caused cell death. The uncoupler of electron transport chain (ETC) carbonyl cyanide <span>m</span>-chlorophenylhydrazone also lowered the H<sub>2</sub>O<sub>2</sub> plateaus, showing that ROS produced in the ETC in mitochondria and/or chloroplasts elevated the H<sub>2</sub>O<sub>2</sub> plateau. The autophagy inhibitor 3-methyladenine lowered the H<sub>2</sub>O<sub>2</sub> plateau and the cell death rate in WT, suggesting that autophagy occurring after H<sub>2</sub>O<sub>2</sub> treatment is involved in the production of ROS. Conversely, the addition of bovine serum albumin, which is endocytosed and supplies amino acids instead of autophagy, elevated the H<sub>2</sub>O<sub>2</sub> plateau in <span>atg5</span> cells, suggesting that amino acids produced through autophagy promote H<sub>2</sub>O<sub>2</sub> generation. These results clearly show that autophagy causes cell death under certain stress conditions. We propose that autophagy-derived amino acids are catabolized using ETCs in mitochondria and/or chloroplasts and produce H<sub>2</sub>O<sub>2</sub>, which in turn promotes the cell death accompanying vacuole collapse.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"5f34b659cf417c84aae28b65843e98afd9e1fd561819405a8600ba45a80397a6","category":"Environment"}