{"title":"Using macroinvertebrate‐based biotic indices and diversity indices to assess water quality: A case study on the Karasu Stream (Kastamonu, Türkiye)","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2627?af=R","date":1710913800000,"content":"<h2>Abstract</h2>\n<p>Biomonitoring is an approach that uses indicators or sentinel species to assess the health or pollution of an environment, combining diversity based on specific taxonomic groups with the taxa's indicator of pollution into a single index or score. Benthic macroinvertebrates are among the most preferred and valuable indicators of the biotic index. Our study aims to evaluate water quality and ecological status using biotic and diversity indices based on benthic macroinvertebrates. The macroinvertebrate samples used in this study were collected seasonally from 16 stations determined in Karasu Stream. These samples consist of 14,747 specimens belonging to 9 orders and 40 families of Insecta, Malacostraca, Hirudinea and Oligochaeta. In addition, some physicochemical parameters were measured at the stations. The data obtained were analysed using the Turkey-Biological Monitoring Working Group (TR-BMWP), Average Score per Taxon (ASPT), Family Biotic Index (FBI), Ephemeroptera, Plecoptera and Trichoptera (EPT) taxon richness index, and Shannon–Wiener, Simpson and Hill's diversity indices. Our results showed that the last six stations of Karasu Stream were under pressure due to various anthropogenic effects. According to biotic indexes, the ecological quality status of the water in the stations was determined to be high or good in the first 10 stations and average, poor or bad in the last 6 stations. The results of our study showed that TR-BMWP, FBI and EPT indices are more reliable in determining water quality than the ASPT index and reflect the environmental situation better. Since the TR-BMWP index is adapted to macroinvertebrate taxa distributed in Türkiye, it can be used as a suitable tool for evaluating other rivers' water quality in Türkiye.</p>","author":"Abdulhamed M. Omar Etriieki, \nİbrahim Küçükbasmacı","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"5f34ff25f517286969979703cbeb3f14a9056e2c63a90830385d00296edea88f","category":"Environment"}