{"title":"Dynamic Spatial and Temporal Analysis of Natural Disasters in Chikwawa District, Lower Shire Valley, Malawi","link":"https://www.preprints.org/manuscript/202407.0127/v1","date":1719841328000,"content":"This study analyzed the dynamic spatial and temporal distribution of natural disasters in Traditional Authorities Ngabu and Lundu in Chikwawa District in the Lower Shire Valley. The study assessed the vulnerability of people to disasters, evaluated the value of losses and damages incurred when disasters strike and to locate disaster hotspots. The mixed design that embraces qualitative and quantitative approaches was used. Data collection methods such as in-depth interviews, Focus Group Discussion, documentary review, structured interview and Participatory Geographical Information Systems (P-GIS) were employed. The study revealed that farming with 64%, 37% and 76% done before, during and after disasters respectively, was the main adaptive capacity to floods and drought in T/A Ngabu. In T/A Lundu, community members also valued farming with 58%, 55% and 70% done before, during and after disasters respectively. The study found that Traditional Environmental Knowledge Systems (TEKS) were highly valued in T/As Ngabu with 90% and Lundu 81%. The study also unveiled those disasters led to losses of human lives and livestock and damages to properties, environment and critical infrastructures. However, some community members still remained in the disaster-prone areas for farming, fishing, protecting the chieftaincy and ancestral reasons. The study also showed that CBDRM was highly adopted. However, disasters continued to occur and losses were increasing. Generally, CBDRM could be effective through multisectoral approach and good legal institutional framework. Therefore, the research recommends that further studies similar to this, should use GIS in assessing the efficacy of CBDRM approaches to produce hazard maps that will be used as models for disaster risk reduction in Chikwawa District in the Lower Shire Valley.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5f39aee3ccf6e4df2e45aec04b2d4a655ffae9cc6bd52c5f991d1a680da6b090","category":"Interdisciplinary"}