{"title":"56 Metabolic status of respiratory disease challenged beef steers altered by intranasal Zn and vitamin A treatments","link":"https://academic.oup.com/jas/article/102/Supplement_2/203/7664787?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Bovine respiratory disease (BRD) is a major cause of morbidity and mortality in the cattle industry. Increasing the ability of a calf to respond to disease is of interest due to the loss of production during disease. Zinc and vitamin A (VA) are key micronutrients involved in many immunologic processes such as cell signaling and mucosal immunity. Angus crossbred steers [n = 48; body weight (BW) = 333 ± 4.2 kg] were utilized in this 14-d BRD challenge investigating intranasal (IN) treatments of Zn and VA. Steers were split into two groups (n = 24) with identical disease challenge and sample collection schedules. Before disease challenge, steers were housed at the Iowa State University Beef Nutrition farm (BNF). Steers were weighed on d -2 and -1 of viral challenge and trucked for 6 h before delivery to the Iowa State University Animal Resource Station. On d 0, steers were challenged with an aerosol inoculation with 10<sup>4</sup> TCID<sub>50</sub> BRSV followed by 5x10<sup>8</sup> CFU of <span>Mannheimia haemolytica</span> on d 5. On d 4, steers received IN treatments of Zn (ZN; ZnO nanoparticles), VA (VA), Zn and VA (VA+ZN), or control with no IN treatment (CON). For trace mineral and VA analysis, liver biopsies were collected on d -9 and 20 and plasma collected on d 0, 4 (trace mineral only), 5, 7 and 14. Steers were tested for viral shedding on d 0, 4, 5, 7, 10 and 14. RNA was isolated from bronchioalveolar lavage (BAL) cells (d 0 and 7) for gene expression related to inflammation, VA and trace mineral metabolism. Statistical analysis was completed using the GLIMMIX and MIXED procedures in SAS 9.4. Throughout the study, viral shedding was not affected by intranasal treatment (<span>P</span> ≥ 0.59). There were no group × TRT × day effects for plasma trace minerals (Cu, Zn, Fe) or VA concentrations (<span>P</span> ≥ 0.18). Intranasal VA prevented a decrease in plasma VA on d 5, after which all treatments were similar (<span>P</span> &lt; 0.01). There were no TRT × day effects for plasma Zn and Cu (<span>P</span> ≥ 0.50). Post challenge, liver VA was increased in VA treated steers compared with steers not treated with VA (<span>P</span> = 0.04). Liver Mn tended to be increased post challenge in IN ZN treated steers (<span>P</span> = 0.08). IN Zn treated steers tended to have lesser expression of IL-10 in BAL cells on d 7 post infection (<span>P</span> = 0.07). Local IN supplementation of Zn and VA can have systemic and local affects on respiratory disease challenged steers and may support increased response to disease.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5f3e0c8a3c19c15916c3b3c900014e6a6a1b32e43e7b1bd884799a490f491529","category":"Environment"}