{"title":"Impact of the COVID‐19 Pandemic on Influenza Vaccination Coverage in Latin America: Mexico and Central America","link":"https://www.preprints.org/manuscript/202410.1505/v1","date":1729262094000,"content":"Influenza behavior depends on several characteristics: the agent itself, the host response, and environmental changes that determine seasonality, presentation, disease severity, lethality, and intensity of contagion. Vulnerable populations, such as the elderly, people with underlying diseases, and incomplete vaccination status, can influence disease presentation and epidemiology. These information changes are necessary for existing surveillance systems. Special surveillance of human and animal diseases is necessary, considering recent outbreaks and epidemic waves of viral diseases such as avian influenza. This study analyzed the impact of the COVID-19 pandemic on influenza vaccination coverage in Mexico and Central America. We used existing data and information in the countries and what was reported to WHO and UNICEF on administrative coverage of influenza vaccination reported by the countries, and the PAHO surveillance databases for influenza and other respiratory viruses. Influenza vaccine application varies in Central American countries and Mexico. Vaccination schedules have been adapted following WHO and PAHO recommendations, and considering the epidemiological, organizational conditions and financial realities of each country. Surveillance systems must be prepared for a possible “tridemic” in humans involving influenza, SARS-CoV-2 and respiratory syncytial virus (RSV). Influenza-associated disease was considerably affected during the COVID-19 pandemic. Given the preventive measures implemented, cases were unusually low during 2021-22, but cases increased sharply in 2022-23 caused by influenza A and influenza A H1N1 pdm09, with some isolated cases of influenza B.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5f4bd261e7d7638261be93c20f9712e8ddbdb6f7af0a7f14d8b1379bc574c5c6","category":"Interdisciplinary"}