{"title":"Activision Blizzard sued by state agency over alleged widespread discrimination","link":"https://arstechnica.com/?p=1782211","date":1626933777000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1085037702-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1085037702.jpg\">Enlarge</a> <span>/</span> Sign on facade of Activision's Los Angeles offices. (credit: Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>On Wednesday, a California State agency <a href=\"https://news.bloomberglaw.com/daily-labor-report/activision-blizzard-sued-by-california-over-frat-boy-culture\">filed a lawsuit against the game publisher Activision Blizzard</a> over allegations of rampant sexual discrimination and sexual harassment. The nature of this harassment is so widespread, the lawsuit says, that women who have worked for the game maker \"almost universally confirmed that working for Defendants was akin to working in a frat house\"—which, according to this lawsuit, means a workplace full of inebriated men who sexually harassed their female colleagues without being punished for it.</p>\n<p><a href=\"https://aboutblaw.com/YJw\">The 29-page lawsuit</a> claims that across the entire corporation, pay disparity led to women receiving \"less total compensation than their male counterparts while performing substantially similar work.\" It includes multiple alleged examples of Activision Blizzard slowing promotions for women in favor of male counterparts, even when those women had longer tenures and a superior review record at the company, and added that women of color were \"particularly targets of Defendants' discriminatory practices.\"</p>\n<h2>A direct report to Blizzard’s president</h2>\n<p>The full lawsuit includes a lengthy list of violations of both sexual discrimination and sexual harassment statutes, including many that single out unnamed Activision Blizzard staffers, and they range from explicit to repugnant. The lawsuit describes one particularly extreme example of alleged harassment—and says the sufferer eventually took her own life.</p></div><p><a href=\"https://arstechnica.com/?p=1782211#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1782211&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5f4d5d49217fdf9b913446f7e945dc697a321688c56baf4567aa70be2bb8520d","category":"Tech"}