{"title":"The Brits riding the 2023 Tour de France","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-brits-riding-the-2023-tour-de-france","date":1688125132000,"content":"\n      <p><span>Great Britain have had exceptional success in the past two decades at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> with the former Team Sky gang dominating the yellow jersey for most of the 2010s. Despite only a handful of riders each year making their way to France for the prestigious Grand Tour, Great Britain is the fifth highest winning country at the Tour. </span></p>\n<div></div>\n<p><span>Bradley Wiggins was the first ever British rider to win the Tour title in 2012, before Chris Froome followed in Wiggins' footsteps, taking the title in 2013. This started a streak of Tour wins for GB, with Froome winning the title in 2015, 2016 and 2017, before Geraint Thomas took the title from his teammate in 2018. </span></p>\n<p><span>Thomas was the last Brit to win the Tour, but he also came within touching distance in 2019 when he finished second to his team-mate Egan Bernal and last year placed third behind Jonas Vingegaard and Tadej Pogačar. However, the Welshman won’t be at this year’s Tour having just raced the Giro d’Italia in May, where he placed second with his Ineos Grenadiers team. </span></p>\n<p><span>Stage wins have also been a prominent feature of GB's success, with the likes of Simon Yates, Steve Cummings, and Tom Pidcock among those to have recently won at the Tour. But it's Mark Cavendish who is largely responsible for GB's success on that front, having taken an astonishing 34 stage wins so far in his career.</span></p>\n<p><span>There's plenty to cheer about when it comes to the Brits at this year’s Tour de France too, so we've put together a list of all the British riders, their strengths, and how we can expect them to make their mark throughout the three weeks of racing. </span></p>\n<h3>Mark Cavendish, Astana Qazaqstan </h3>\n<p><span>Having announced his retirement at this year’s <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, this will be Mark Cavendish’s last Tour de France. But this year’s race provides a unique opportunity for the Manx rider to write his name in the history books, if successful. Currently on par with Eddy Merckx, if Cavendish can secure himself one last stage win, he’ll have won the most Tour stages in the race’s history. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_SWpix_Giro_2982.jpg?v=1687853641\" alt /><em><span>Mark Cavendish won the final stage of this year's Giro d'Italia </span></em></span></p>\n<p><span>Throughout the Giro, Cavendish came tantalisingly close to a stage win placing fourth, third and eighth. However, it was only on the final stage in Rome that he finally secured a victory, proving that he still has the winning fire within him. He’s only raced once since at the ZLM Tour in June, placing ninth in the GC. But his Astana team are putting everything into Cavendish’s potential record-breaking win and have brought former team-mate Mark Renshaw into the team as an advisor for his final tour. Renshaw was Cavendish’s lead-out man for nine seasons, and has joined Astana as sprint consultant. Can it be one last dance for the Manx missile? </span></p>\n<h3>Adam Yates, UAE Team Emirates</h3>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-04919.jpg?v=1687855928\" alt /></b></p>\n\n<p><span><em>Adam Yates has thrived in week-long stage races this year</em></span></p>\n<p><span>Adam Yates is a very talented climber, and he proved this with his second place at the Critérium du Dauphiné this month, challenging Vingegaard for the title. He also achieved first place at the Tour de Romandie and third place at the UAE Tour at the start of the season. However, with two-time Tour de France winner Tadej Pogačar on his team, Yates will most probably be taking on the role as domestique for the Slovenian. </span></p>\n<p><span>He could be in contention for a stage victory however, if given the opportunity, something he is yet to achieve despite this being his seventh Tour appearance. While he is strong in the high mountains, he’ll have to tread carefully with the time trial as he hasn’t had a very consistent record against the clock. So far this year, he’s placed third and eighth in the TT stages and will need to produce the same results if he is looking to secure a respectable GC result. </span></p>\n<h3>Simon Yates, Jayco Alula</h3>\n<p>Both the Yates brothers will be on this year's start line, flying the British flag. But unlike his brother, Simon Yates will be taking the spotlight for his Jayco-Alula team as he aims for the GC. His best finishing position in the Tour was back in 2017, when he placed seventh, so he'll be hoping to have a better result this year. He has also secured two stage wins in the 2019 edition. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-07014.jpg?v=1687856089\" alt /><em>Simon Yates started his season with a bang, taking second overall at the Santos Tour Down Under and a stage victory </em></p>\n\n<p><span>Yates last Tour appearance was in 2021, but he did not finish stage 13 (unlucky for some) and had to withdraw from the race. </span>Over the past five years, Yates has opted to race the Giro, but this year he has taken a different approach to Grand Tours this year, focusing more on training than racing. His last race was the Tour de Romandie in April, but he had to withdraw after stage one due to stomach problems. Before that, Yates came fourth in Paris-Nice and ninth in the Itzulia Basque Country. As we haven't seen the British rider in action since April, it's unclear what his current form is like and we will only know when he lines up for the Grand Départ in the Basque Country. </p>\n<h3>Tom Pidcock, Ineos Grenadiers </h3>\n<p>In his Tour de France debut, Tom Pidcock wowed cycling fans with his memorable win on the Alpe d'Huez as well as placing second in the youth classification. He'll be looking to develop this at this year's race, hunting down more stage wins to add to his palmarès. </p>\n<p>Pidcock is an exciting talent for not only the Ineos Grenadiers, but also for British fans. He continued to showcase his strength with a remarkable win at Strade Bianche in March and a second-place finish at Liège-Bastogne-Liège behind world champion Remco Evenepoel. In the lead-up to the Tour, Pidcock raced in the Tour de Suisse where he placed 22nd in the overall. The 23-year-old rider is a strong climber and excellent descender, so he'll make for exciting viewing. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1241897533_9a445386-6510-4dd3-a32f-8facb34d112a.jpg?v=1687857645\" alt /><em>Tom Pidcock during the Alpe d'Huez stage at the 2022 Tour de France </em></p>\n<h3>\n<strong>Fred Wright, Bahrain-Victorious </strong><em><br /></em>\n</h3>\n<p>Newly crowned British road champion Fred Wright will be making his third appearance at the Tour de France this year for his Bahrain-Victorious team. Wright had an impressive ride last year, coming second on stage 13 after narrowly missing out on the win to Mads Pedersen and taking eighth in the individual time trial on the penultimate stage. With his first professional win under his belt, he'll have to confidence to put himself in the right place and go for glory. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-02687.jpg?v=1687858663\" alt /></p>\n<h3><strong>Ben Turner, Ineos Grenadiers </strong></h3>\n<p>Ben Turner will be making his Tour de France debut for the Ineos Grenadiers, so he'll be working to help his team go for stage wins and potentially a GC result while gaining as much experience as possible. The 24-year-old hasn't had much luck this year with several DNF results, including at the Critérium du Dauphinè where he had an unfortunate crash during the individual time trial. He has not raced since then, missing the National Championships last week. The next time we will see Turner will be in Bilbao and this will tell us how he has recovered from the Dauphiné. </p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-02426.jpg?v=1688039348\" alt /></div>\n<p><em>Ben Turner hasn't had the best start to the season with a number of DNFs, but he'll be looking to change his luck</em></p>\n<h3>James Shaw, EF Education-EasyPost</h3>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-07406_34a39dd3-77d7-4ea2-901e-83aca5236401.jpg?v=1688110465\" alt /></div>\n<div>\n\n<em>James Shaw came third in last year's time trial national championships</em>\n</div>\n<div></div>\n<div></div>\n<p></p><div>James Shaw is another debutant at this year's Tour after being picked by his EF Education-EasyPost team with whom he's now been with for two years. His solid performance at the Critérium du Dauphiné proved he was ready to take on a Grand Tour of this level, securing a respectable 24th place in the GC and 15th in the mountains classification. Taking full advantage of his good form, he then came eight place in the men's National Championships road race and will be looking to continue this run going forward in the Tour. With this being his first appearance, Shaw will be looking to soak up every moment while working hard for his teammates, including Richard Carapaz, Magnus Cort and Neilson Powless who will all be going for their own victories. </div>\n<div></div>\n<div></div>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"5f5410bf973c4f0e30b88a5937bf27b0cebfcf63b5ac5d0bd7207f94003a0724","category":"Cycling"}