{"title":"Apple Responds to Meta's Plan to Charge 30% Fee on Boosted Posts Purchased Through App Store","link":"https://www.macrumors.com/2024/02/15/apple-responds-to-meta-boosted-posts-fee/","date":1708022351000,"content":"In October 2022, Apple <a href=\"https://www.macrumors.com/2022/10/24/apple-updates-app-store-review-guidelines-2/\">updated its App Store Review Guidelines</a> to clarify that sales of \"boosted\" posts in social media apps must use the App Store's in-app purchase system. Apple thereby receives up to a 30% cut of these sales.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/03/Facebook-Feature.jpg\" width=\"2250\" height=\"1266\" />\r<br />\nAs a result of that clarification, Meta today <a href=\"https://www.facebook.com/business/news/new-ways-for-small-business-to-boost-and-avoid-apple-service-charges\">announced</a> that it will soon charge advertisers a 30% fee when they purchase boosted posts through the Facebook and Instagram apps for iOS. This policy will allow Meta to offset the amount that it will owe Apple for each sale — it is essentially passing on the added cost to its customers. Advertisers who purchase boosted posts through the iOS apps will also now be required to pay in advance, whereas Meta typically collects payment for boosted posts after they are shown.\r<br />\n\r<br />\nMeta said this change will take effect in the U.S. later this month, and in additional countries later this year. Advertisers can avoid the 30% fee and prepayment by purchasing boosted posts on the web at Facebook.com and Instagram.com.\r<br />\n\r<br />\n\"We are required to either comply with Apple's guidelines, or remove boosted posts from our apps,\" said Meta, in a press release today. \"We do not want to remove the ability to boost posts, as this would hurt small businesses by making the feature less discoverable and potentially deprive them of a valuable way to promote their business.\"\r<br />\n\r<br />\nMeta <a href=\"https://www.macrumors.com/2022/10/25/facebook-apple-app-store-guidelines-ads/\">previously said</a> that \"Apple continues to evolve its policies to grow their own business while undercutting others in the digital economy.\"\r<br />\n\r<br />\nMillions of small businesses use boosted posts on Facebook and Instagram, according to Meta. A boosted post is a key advertising tool for businesses, allowing them to reach larger audiences on Facebook and Instagram in exchange for payment.\r<br />\n\r<br />\n<h2>Apple Responds</h2>\r<br />\nIn response to Meta's announcement, Apple said App Store apps have always been required to use its in-app purchase system for the sale of digital goods and services.\r<br />\n\r<br />\n\"We have always required that purchases of digital goods and services within apps must use In-App Purchase,\" said Apple, in a statement shared with <em>MacRumors</em> today. \"Boosting, which allows an individual or organization to pay to increase the reach of a post or profile, is a digital service — so of course In-App Purchase is required. This has always been the case and there are many examples of apps that do it successfully.\"\r<br />\n\r<br />\nIf boosted posts have always been considered a digital service, it is unclear why Apple has allowed Meta to directly charge advertisers for many years, and it did not respond when we asked for an explanation. At a minimum, it appears that Apple has allowed Meta to circumvent the App Store's in-app purchase system for boosted posts since clarifying its App Store Review Guidelines in October 2022. That grace period is clearly ending now.\r<br />\n\r<br />\nAs part of its response, Apple said it has indeed given Meta ample opportunity to comply with the App Store Review Guidelines as they are currently written.\r<br />\n\r<br />\nApple added that businesses have the option to use the Meta Ads Manager app on iOS to set up and pay for their ad campaigns without using the App Store's in-app purchase system, as this app complies with the App Store Review Guidelines, which permit apps designed for the sole purpose of managing ad campaigns to offer direct payment options.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/meta/\">Meta</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/15/apple-responds-to-meta-boosted-posts-fee/\">Apple Responds to Meta's Plan to Charge 30% Fee on Boosted Posts Purchased Through App Store</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-responds-to-metas-plan-to-charge-30-fee-on-boosted-posts-purchased-through-app-store.2419553/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5f621618c4b8227b41b85668b19d172691ad021ff23fb2a46e2ca75230aaced2","category":"Apple"}