{"title":"The inevitability of disc brakes","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-inevitability-of-disc-brakes","date":1627556934000,"content":"\n      <p><span>The great disc brake debate has finally been settled. Disc brakes have taken over the recent past and present, and they are indeed the future of road racing. Let sleeping dogs lie, right? </span></p>\n<p><span>Wait a second. </span></p>\n<p><span>Tadej Pogacar won the Tour de France in 2020 riding a Colnago equipped with rim brakes. Egan Bernal won the 2019 Tour de France on a Pinarello — equipped with rim brakes. In 2018, Geraint Thomas made the final lap around Paris on his yellow Pinarello, which was also equipped with rim stoppers. </span></p>\n<p><em><span>2017, Froome, rim brakes.</span></em></p>\n<p><em><span>2016, Froome, rim brakes.</span></em></p>\n<p><em><span>2015, Froome, rim brakes.</span></em></p>\n<p><span>Perhaps the dogs aren’t sleeping just yet.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1228486298_1024x1024.jpg?v=1627490495\" /></span></p>\n<p>The 2021 Tour de France presented a big opportunity for disc brake die-hards to finally put the debate to bed. The top contenders largely made the switch to disc brakes, save for a few holdouts like Pogacar — who rode both a rim-brake-equipped bike and a disc-equipped bike at the 2021 Tour de France. Even Chris Froome, while no longer the threat for yellow he once was, has taken on the Tour with a disc-equipped Factor bike.</p>\n<p><span>So what’s the verdict? Are disc brakes still as inevitable as we’ve been told? Or do rim brakes still hold sway over the peloton? </span></p>\n<p><span>Sorry, rim brakers. You’re still the exception, and discs will rule. Here’s why.</span></p>\n<h4>Winners make the rules</h4>\n<p><span>Aside from Pogacar, every Tour de France winner since 2015 has come from the same team: Ineos-Grenadiers (then Team Sky). That explains some of the rim brake dominance on the top step: Ineos-Grenadiers is the last WorldTour team to swear off disc brakes entirely. </span></p>\n<p><span>Every other team runs disc brakes across the board, or a mix of disc and rim brakes. Of course, the 2020 winner came from a team that runs a mix of disc and rim brakes, so rim brake dominance of the top step has remained unbroken. </span></p>\n<p><span>Perhaps that’s a fluke. Pogacar’s 2021 Tour de France win means rim brakes will still remain relevant at Le Tour for at least another year. But the champ rolled through Paris on a disc-equipped bike.</span></p>\n<h4>All it takes is one win</h4>\n<p><span>Disc brakes were a tough sell for riders who approach new tech with a skeptical eye. But when one rider finds success on new tech, you can make a safe bet others will follow, and quickly. </span></p>\n<p><span>Enter Tom Boonen. </span></p>\n<p><span>The legendary Belgian rider won a stage of the Vuelta de San Juan in Argentina in 2017, becoming the first rider to win a major UCI Pro race on a disc-equipped bike. Not long after, Marcel Kittel etched his name in the history books, becoming the first rider to win a Tour de France stage on a disc-equipped bike. Both riders crossed the line on Shimano-equipped Specialized bikes. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1329376096_1024x1024.jpg?v=1627492074\" /></span></p>\n<p><em><span>Tadej Pogacar rode a mixture of disc and rim brakes at the 2021 Tour de France. Photo: Chris Graythen/Getty Images</span></em></p>\n<p><span>Losing is a great motivator. The switch to disc brakes happened quickly among the big sprinters in the peloton. Other types of riders began to dabble on certain stages. </span></p>\n<p><span>But then the crashes happened, and social media became a potent tool against disc brakes. Gory images of sliced-up legs and burned flesh made the rounds, though the claims of disc brake carnage during these crashes seemed dubious at best. Still, it was enough to scare away many riders.</span></p>\n<p><span>The disc brake debate continued heatedly for years after that, but for sprinters in the peloton, discs became a foregone conclusion. Of course they would use them; the weight penalty didn’t matter as much to them, but the braking power certainly did. Once the UCI re-banned and then un-banned them, discs seemed to have taken hold permanently.</span></p>\n<p><span>“For sure I could have used the disc brakes in my two participations in a rainy and wet and muddy Paris Roubaix,” says retired pro Jens Voigt. “They would have made a huge difference for my control over the bike and ability to brake in the rain. Plus, it's less likely that mud gets all clogged up on the top of the fork or the rear frame where the rim brake is mounted.”</span></p>\n<p><span>Voigt is certain disc brakes have taken a firm enough grasp on bike design that they will all but eliminate the use of rim brakes, but he’s also clear they aren’t without their drawbacks. “Disc brakes in the rain often make that noise when a little sand grain gets caught in them,” he says,  “and that is super annoying because it kills your brain knowing that there is some unwanted extra friction on your bike while you already pedal as hard as you can.”</span></p>\n<p><span>Perhaps it’s that potential for drag, aerodynamic or otherwise, that led to climbers avoiding discs for so long. More likely however, weight was, and still is, the primary concern. </span></p>\n<p><span>But should it be? </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1312077644_1024x1024.jpg?v=1627492280\" /></span></p>\n<p><em>Disc brakes are becoming increasingly ubiquitous across the WorldTour. Photo: Stuart Franklin/Getty Images</em></p>\n<h4>Generation Disc</h4>\n<p><span>The newest crop of youngsters cutting their teeth in the WorldTour today were raised on disc brakes. Adopting them for the road seemed completely natural, even for the climbers.</span></p>\n<p><span>That’s because disc brakes opened up more frame design options, many of which allowed manufacturers to create even lighter bikes. Suddenly the disc brake weight penalty wasn’t much of a penalty, given the UCI has maintained its 6.8kg weight minimum rule. </span></p>\n<p><span>“I actually started using disc brakes pretty early since I mountain-biked in my early days,” says 25-year-old Joris Nieuwenhuis of Team DSM. “Then when it started becoming popular in cyclocross, we also started using them quite early.”</span></p>\n<p><span>Nieuwenhuis raced the Tour de France with Team DSM in 2021 on a Shimano-equipped Scott bike, and to the young Dutch rider, the benefits of disc brakes have always been obvious. “In 2017 I had my first road bike that had disc brakes,” he says. “I always wondered why they didn’t start riding them on the road since it was a huge improvement, in my opinion. </span></p>\n<p><span>“I felt much more in control with my bike, which is of course a bit more of a must in mountain bikes and cyclocross. But doing good technical downhills on the road can also make or break your performance. If I had to buy a bike for myself, it would for sure be a disc-brake-equipped bike.”</span></p>\n<p><span>His 22-year-old teammate Mark Donovan just started using disc brakes this year, but he agrees with Nieuwenhuis’s assessment. “It seems pretty clear that they are the better option now,” he says. “I think there's not really many downsides. You also have a load more tyre clearance. In terms of using them in the wet in the bunch, it does just show why they are so they are superior.”</span></p>\n<p><span>Young riders weren’t the only ones who already knew disc brakes were the answer. The global power in road groupsets, Shimano, had known well before most of those young guns had even been born.</span></p>\n<h4>Manufacturers lead the way</h4>\n<p><span>“We have the first disc brake for bikes on display in our museum,” says Hennie Stamsnijder, Shimano’s Sports Marketing Manager. “It was 50 years ago. We already had a patent. It took us a long time to convince people it was the way to go. When we went to disc brakes we completely took over the market because we knew from 50 years ago that’s how they worked.”</span></p>\n<p><span>That first disc brake was the B700, according to Hunt Wheels US Marketing Manager Samuel Johnson. “I used to work for Shimano, so I have a ton of fun facts about Shimano history,” he says. “The very first disc brake from Shimano was 1972. It was the B700. The hub basically required this proprietary 36-spoke wheel — so incredibly heavy. They're overbuilt, with a solid steel rotor. The eight-pound system was basically just the rotor, the caliper, and the mounting hardware.”</span></p>\n<p><span>Shimano refined its disc brake designs over the decades, and as mountain bikers embraced the more powerful brakes, cyclocross and road riders lagged behind because disc brakes — while no longer eight-pound beasts anymore — were still heavier and more complex than rim brakes.</span></p>\n<p><span>It wasn’t until just a few years ago that disc brakes became light enough to even enter the conversation for road bike designers. And even then, disc brakes presented other drawbacks — logistical ones, as well as aerodynamic ones. </span></p>\n\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/P158_First-DA_1024x1024.jpg?v=1627492566\" /></span></p>\n<p><em><span>Shimano's first iteration of Dura-Ace, since then groupset technology has come on considerably, from shifting to braking</span></em></p>\n<p><span>Since disc brake calipers stick out from the frame and from the fork, the protrusion could cause ‘dirty’ air that leads to aerodynamic drag. Shimano solved this problem by redesigning the way calipers mount to the bike. Flat-mount disc brake calipers position themselves flush against the frame and fork, neatly tucking behind the leading edge of the fork. Drag in the rear gets reduced too. </span></p>\n<p><span>The rotors have changed too. Smaller diameter rotors work well with feathery road bikes, and new designs have filled in the gaps between the mount and the rotor perimeter, eliminating even more potential for drag. </span></p>\n<p><span>Perhaps most significantly, disc brakes have opened up other design opportunities that effectively eliminate any of the negative drag aspects disc brakes may pose. Wheels and tyres have become wider, ostensibly reducing drag in several ways. And frame designs have changed dramatically, since engineers are no longer bound by rim brake calipers, narrower wheels and tyres, and even narrower axle widths.  </span></p>\n<p><span>“I think it's pretty well known that disc is faster than rim brake,” says Johnson, though he qualifies that statement by noting it’s just as dependent on frame design. Manufacturers know this, too, and disc brakes have largely become a known design parameter. “That's why the World tour is using it. That's why triathletes who are among the most concerned about aerodynamics have all adopted that; they wouldn't use it if it wasn't faster.”</span></p>\n<p><span>So why are there still rim brake devotees? Stamsnijder thinks it’s a bit of apathy from riders. “Sometimes it's frustrating for us as a sports marketing team, you are on the road talking to some riders and there is still this kind of sentiment that they don’t want it. They think: why should I do it? Rim brakes are working well for me.” By this logic, says Stamsnijder, everyone should still be using downtube shifters. </span></p>\n<p><span>The skeptics come around eventually, though.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/total-integration-total-revolution-how-shimano-s-sti-shifting-changed-cycling\">Related – How Shimano's STI Shifters Changed Cycling</a></strong></em></p>\n<h4>Team Strategy</h4>\n<p><span>Once the shift to disc brakes began, it was only a matter of time until teams had to make a difficult decision: allow riders to choose rim or disc, or simply go one or the other across the board. That decision became necessary to make as a matter of strategy: team cars can only hold so much equipment.</span></p>\n<p><span>Allowing riders to choose whether they want to ride rim brakes or disc brakes meant teams would have to carry spare wheels and bikes of both types. Car racks on top of team cars would need retrofitting to accommodate the bikes of the day. Service course trucks would need more supplies to accommodate two braking systems. </span></p>\n<p><span>Teams hate complications. Simplicity leads to efficiency. The decisions were inevitable. With all the strongest winds blowing toward disc brake use, most teams followed those breezes. Others resisted for a while then relented. Only Ineos-Grenadiers remains completely disc-free. </span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1323367686-_1_1024x1024.jpg?v=1627492775\" /></p>\n<p><em>Team Ineos is the only WorldTour team to stick resolutely to rim brake-equipped bikes. Photo: Tim de Waele/Getty Images</em></p>\n<p><span>“Since the team talks a lot about marginal gains, I am sure the use of rim brakes versus disc brakes has been tested, and scientific research has been done,” says Voigt. “And it seems for them it works. Looking back at this season, before the Tour de France, the last four big stage races were all won by Ineos-Grenadiers: the Tour Romandie with Geraint Thomas, the Giro with Egan Bernal, the Dauphine Libere with Richie Porte, and the Tour de Suisse with Richard Carapaz. But — and there is always a but — they have been involved in a lot of crashes in this year’s Tour. Bad luck, or because of rim brakes?”</span></p>\n<p><span>Still, Voigt notes that Pogacar uses rim brakes on the climbs, and disc brakes only on the flat stages. That indicates, to him, that Pogacar may very well prefer rim brakes and only uses disc brakes when the stage is less consequential to his overall victory chances.</span></p>\n<h4>Are rim brakes dead?  </h4>\n<p><span>Rim brakes will never die, but the future of road racing is disc-equipped.</span></p>\n<p><span>“The young guys want disc brakes,” says Stamsnijder. “Rim braking will fade away, for sure. You can see how many huge stacks of riders there used to be when there was a crash. You don’t see that the last few years nearly as much. There are a few guys on the floor but the rest of the peloton is able to brake in time.”</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-angels-in-the-blue-overalls\">Related – The Angels in Blue Overalls: Behind Shimano's Neutral Support</a></strong></em></p>\n<p><span>Nieuwenhuis agrees that rim brakes’ time has passed. “</span><span>They can make disc brake bikes at 6.8kg, probably even lighter if they want. That was always the biggest factor why a team didn’t ride discs. I don’t see myself going to rim brakes ever again.”</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1329226189-_1_1024x1024.jpg?v=1627556617\" /></p>\n<p><em><span>Mark Cavendish on disc brakes. Photo: Tim de Waele/Getty Images</span></em></p>\n<p><span>Voigt says he chatted with Roger Kluge, Caleb Ewan’s leadout man, about the inevitability of disc brakes. “Kluge says disc brakes are here to stay,” says Voigt. </span></p>\n<p><span>According to Kluge, “they brake better and are more reliable. In a hectic bunch sprint, I feel safer knowing that I have disc brakes on my bike.\" </span></p>\n<p><span>Maybe those dogs aren’t sleeping just yet. But it’s bed time and those eyes all appear to be drooping quickly. Once they doze off, there’s no doubt we should let the sleeping dogs of rim brakes lie. </span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"5f66a3b1fa21c43a71a5e26d7decad506a7a4d885fa12234ca77e928474f9817","category":"Cycling"}