{"title":"ห้ามแต่เขา เราทำได้ Apple เพิ่มโฆษณาแอปจากข้อมูลผู้ใช้ หลังให้ Google, Facebook ต้องขออนุญาตเก็บข้อมูล","link":"https://www.blognone.com/node/122618","date":1620706365000,"content":"<div><div><div><p>หลัง Apple บังคับแอปต่างๆ ว่า<a href=\"https://www.blognone.com/node/122063\">ต้องขออนุญาตผู้ใช้งานก่อนติดตามข้อมูลผู้ใช้</a> ตามนโยบาย App Tracking Transparency ของ iOS 14.5 และทำให้การเก็บข้อมูลของ Google และ Facebook ทำได้ยากขึ้น โดยอ้างว่า<a href=\"https://www.blognone.com/node/120159\">ทั้งหมดทำไปเพื่อผู้ใช้งาน</a> ล่าสุด Apple ได้เปิดขายโฆษณาในหมวด Search ของ App Store ซะเอง โดยยิงโฆษณาจากข้อมูลที่เก็บมาจากผู้ใช้</p>\n<p>ก่อนหน้านี้ Apple ใช้ข้อมูลที่เก็บจากพฤติกรรมดาวน์โหลดและใช้งานแอปของผู้ใช้ <a href=\"https://searchads.apple.com/privacy/\">เพื่อแสดงโฆษณาใน Apple Search อยู่แล้ว</a> แต่สิ่งที่เพิ่มขึ้นล่าสุดนี้คือช่องโฆษณาแอปด้านบนสุดของหมวด Suggested ซึ่งนักพัฒนาแอปจะสามารถซื้อโฆษณาเจาะกลุ่ม (targeted ads) ตามข้อมูลผู้ใช้จาก Apple ได้</p>\n<p>ข้อแตกต่างของการเก็บข้อมูลนี้คือ Apple ระบุใน<a href=\"https://searchads.apple.com/privacy/\">นโยบายความเป็นส่วนตัวของ Search Ads</a> ว่าจะไม่แชร์ข้อมูลกับบริษัทอื่น และจะไม่สร้างโปรไฟล์สำหรับใช้ในการยิงโฆษณา แต่จะใช้การแบ่งผู้ใช้ออกเป็นกลุ่ม (segment) ต่างๆ ตามพฤติกรรมการใช้งานแอป และผู้ซื้อโฆษณาจะสามารถยิงโฆษณาเจาะกลุ่มได้ เมื่อมีผู้ใช้ที่มีพฤติกรรมคล้ายกันอยู่ในกลุ่มนั้นเกิน 5,000 คนขึ้นไป</p>\n<p>เห็นได้ชัดว่า Apple เองก็ใช้ข้อมูลจากผู้ใช้เพื่อยิงโฆษณาเช่นกัน แม้จะมีข้อแตกต่างด้านการเก็บข้อมูลและแชร์ข้อมูลจาก Google และ Facebook แต่การออกนโยบาย App Tracking Transparency เพื่อทำให้แอปอื่นเก็บข้อมูลผู้ใช้ได้ยากขึ้น ก่อนจะเพิ่มช่องทางขายโฆษณาใหม่ในเวลาไม่นาน ก็ค่อนข้างน่าสงสัย และมีทีท่าว่า Apple อาจเพิ่มช่องทางโฆษณาบนแพลตฟอร์ม iOS ที่ตัวเองครอบครองข้อมูลผู้ใช้มากสุดแค่เพียงผู้เดียวมากขึ้นในอนาคต</p>\n<p>ที่มา - <a href=\"https://mobiledevmemo.com/apple-robbed-the-mobs-bank/\">Mobile Dev Memo</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e53a3fef2e9ec40a236bd4d2cfe58de3.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/app-store\">App Store</a></div><div><a href=\"/topics/privacy\">Privacy</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5f6abe700bb859ff39d39e135b86e49e1b0dc2c11bfdba3c9ce9344cc0fd77a6","category":"Thai"}