{"title":"M3 Ultra Mac Studio Rumored to Launch in Mid-2024, But No Sign of New Mac Pro","link":"https://www.macrumors.com/2024/01/05/m3-ultra-mac-studio-to-launch-in-mid-2024/","date":1704456551000,"content":"A new <a href=\"https://www.macrumors.com/roundup/mac-studio/\">Mac Studio</a> model with the M3 Ultra chip—which could be more powerful than expected—will launch in mid-2024, according to a new report.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/M3-Mac-Pro-and-Studio-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe report comes from Taiwanese research firm <a href=\"https://www.trendforce.com/news/2024/01/04/news-tsmc-reportedly-attracts-influx-of-3nm-customers-predicts-production-capacity-utilization-to-surge-to-80-by-year-end/\">TrendForce</a> citing <a href=\"https://www.icsmart.cn/72181/\"><em>ICsmart</em></a>. The current ‌Mac Studio‌, which contains <a href=\"https://www.macrumors.com/guide/m2/\">M2</a> Max and ‌M2‌ Ultra chip options, was introduced at WWDC in June 2023. With TrendForce forecasting another mid-year update for the ‌Mac Studio‌, a repeat appearance at WWDC seems likely this year.\r<br />\n\r<br />\nThe <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a> is the only other Mac model that contains an \"Ultra\" Apple silicon chip, so its absence from today's report discussing the M3 Ultra is noticeable. While, logically, the ‌Mac Pro‌ should receive an update to add the M3 Ultra chip alongside the ‌Mac Studio‌, just like it received the ‌M2‌ Ultra chip last year, there have been no rumors to suggest this will be the case again this year as of yet.\r<br />\n\r<br />\nInterestingly, TrendForce claims that the M3 Ultra chip will be fabricated with TSMC's N3E node, just like the A18 chip that is expected to debut in the <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a> lineup later in the year. This means it would be Apple's first N3E chip. The M3, M3 Pro, and M3 Max chips are fabricated with TSMC's N3B process, just like the A17 Pro. N3E is an enhanced version of TSMC's <a href=\"https://www.macrumors.com/guide/3nm/\">3nm</a> process, offering slightly better performance and higher production yield. \r<br />\n\r<br />\nIt would be somewhat odd for Apple to make the M3 Ultra its first N3E chip, since Apple's \"Ultra\" chips comprise two \"Max\" chips linked via its UltraFusion chip interconnect technology, meaning that an N3E M3 Ultra would effectively be two M4 Max chips. To date, each generation of Apple's custom silicon chips have used the same fabrication process across the lineup, since the chip architecture is simply scaled up. Using different nodes in the same family of chips, especially on the \"Ultra\" chip variant, would be an unprecedented move.\r<br />\n\r<br />\nThe only explanation if Apple does opt for this route would be that the company plans to introduce the M4, M4 Pro, and M4 Max chips sooner rather than later, perhaps in late 2024, and would want to ensure that the M3 Ultra ‌Mac Studio‌ remains competitive with the newer chips. Even so, in this instance, it would surely be more straightforward to brand the chip \"M4 Ultra\" and skip the M3 Ultra entirely. \r<br />\n\r<br />\nAs a result, this part of the report should be treated with some skepticism. Nevertheless, a mid-year time frame for the launch of a new ‌Mac Studio‌ seems likely. \r<br />\n<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/mac-studio/\">Mac Studio</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/trendforce/\">TrendForce</a>, <a href=\"https://www.macrumors.com/guide/apple-silicon/\">Apple Silicon</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Mac-Studio\">Mac Studio (Neutral)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/mac-studio.237\">Mac Studio</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/05/m3-ultra-mac-studio-to-launch-in-mid-2024/\">M3 Ultra Mac Studio Rumored to Launch in Mid-2024, But No Sign of New Mac Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/m3-ultra-mac-studio-rumored-to-launch-in-mid-2024-but-no-sign-of-new-mac-pro.2415524/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5f6bfbda083544c8337dfb9c92ea546d9233df868d4788915ad3881fcaa723e8","category":"Apple"}