{"title":"Disregard of aquatic shrews in the Environmental Impact Assessment reports regarding hydropower dams in the Nepal Himalayas","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4238?af=R","date":1709626003000,"content":"<h2>Abstract</h2>\n<p>The rate of hydropower dam construction on rivers is increasing in emerging economies in South Asia, to achieve economic development goals. These large infrastructure projects are likely to have many negative consequences on freshwater species but have not yet received much consideration. Among freshwater small mammalian species, water shrews are seriously impacted by these large structures. This paper aims to determine if water shrews have been considered during the Environmental Impact Assessment (EIA) of these hydro dam project sites, as well as present the sightings of the water shrews from Nepalese rivers with hydropower potential. We reviewed 44 EIA reports of such projects in Nepal using a set of four criteria and 15 questions to analyze the methods of impact assessment for mammals and the reports on the presence of water shrews in each built area. The study found that the number of mammal species reported during the EIA varied from five to 55 species but no relationships between the hydropower structure's size and any water shrew species were considered in the studies. In almost all EIA reports, the term aquatic ecosystem was prioritized over the term aquatic small mammals, and the latter was not considered in the assessment. The major reason for not considering these species is probably due to the lack of robust methods to capture small mammals such as shrews, or due to survey methods focused only on terrestrial mammals. The Aquatic Animal Protection Act was fully reviewed and assured to be followed in a majority of the reports, yet the monitoring parameters and indicators were not available for aquatic small mammals. Ignoring the presence of these mammals while constructing hydropower plants is a serious threat to their persistence. We also reported the Himalayan water shrew in the Barun River and the elegant water shrew in the Upper Tamakoshi River of Nepal. Therefore, a better understanding of these species among hydropower developers, and all concerned agencies, is essential.</p>","author":"Sagar Dahal, \nKaustuv Raj Neupane, \nBashu Dev Baral, \nSimon Poulton","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"5f6d0ad7047d1bccda94c0ceb96506846cd08b34babf47a7938b5650b0332513","category":"Environment"}