{"title":"Change in the prevalence of anemia in children aged 6–59 months using the new World Health Organization 2024 criteria","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15239?af=R","date":1729100392000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/c184cb5a-3dc3-490a-8319-1549070796af/nyas15239-gra-0001-m.png\" alt=\"Change in the prevalence of anemia in children aged 6–59 months using the new World Health Organization 2024 criteria\" />\n<p>This study assesses the impact of the WHO 2024 guidelines on anemia prevalence in children aged 6–59 months across 48 countries, comparing the CDC 1989 and WHO 2024 criteria. Notable shifts in prevalence and the level of public health significance were observed, especially in high-altitude regions. These results underscore the importance of targeted public health interventions to address anemia and taking into account altitude-related variations and population-specific challenges for more effective strategies. \n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The World Health Organization (WHO) has published new hemoglobin cutoff points for defining anemia and its measurement. This change could impact the prevalence of anemia, particularly in countries with populations living in high-altitude areas. This study estimates the national prevalences of anemia in children aged 6–59 months using Centers for Disease Control and Prevention (CDC) 1989 and WHO 2024 criteria. Data from 406,106 children in 48 countries (45 Demographic and Health Surveys [DHS Program] and 3 Andean [Ecuador, Bolivia, and Peru]) were analyzed. The pooled prevalence of anemia was 61.4% according to the WHO 2024 criteria. Three countries showed changes in anemia prevalence, with shifts of 10 or more percentage points (Uganda, Rwanda, and Jordan). Across all the studied countries, the prevalence of anemia was higher at greater altitudes, rural areas, and children from households of low wealth quintiles, regardless of the criteria used. Moreover, changes in anemia prevalence were identified when stratified by altitude of residence, showing differences in the levels of public health significance across various political–administrative regions in Andean countries. Overall, these findings provide valuable insights into the epidemiology of anemia and highlight the need for continued surveillance and targeted interventions to effectively address this global health challenge.</p>","author":"Akram Hernández‐Vásquez, \nRodrigo Vargas‐Fernández, \nJamee Guerra Valencia","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"5f71d9f6560e7c5b398207e9b917952a89931ae0bf36771c5ff65566170ee103","category":"Environment"}