{"title":"Utility of neuromelanin-sensitive MRI in the diagnosis of dementia with Lewy bodies","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309885","date":1725890400000,"content":"<p>by Yuta Inagawa, Shoya Inagawa, Naoto Takenoshita, Ryo Yamamoto, Akito Tsugawa, Mana Yoshimura, Kazuhiro Saito, Soichiro Shimizu</p>\r\nObjective <p>Dementia with Lewy bodies (DLB) is recognized as the second most common cause of degenerative dementia in older people with Alzheimer’s disease (AD), and distinguishing between these 2 diseases may be challenging in clinical practice. However, accurate differentiation is important because these 2 diseases have different prognoses and require different care. Recently, several studies have reported that neuromelanin-sensitive MRI can detect neurodegeneration in the substantia nigra pars compacta (SNc). DLB patients are considered to demonstrate degeneration and a reduction of dopaminergic neurons in the SNc. Therefore, neuromelanin-sensitive MRI may be useful for the diagnosis of DLB. Therefore, in this study, we aimed to investigate the usefulness of neuromelanin-sensitive MRI in the distinguishing DLB from AD.</p> Methods <p>A total of 21 probable DLB and 22 probable AD patients were enrolled. All participants underwent both DaT-SPECT and neuromelanin-sensitive MRI. A combined model of neuromelanin-sensitive MRI and Dopamine transporter single-photon emission computed tomography (DaT-SPECT) was created using logistic regression analysis (forced entry method).</p> Results <p>There was no difference in the diagnostic utility of neuromelanin-sensitive MRI and DaT-SPECT in distinguishing DLB from AD. There was no significant correlation between the results of neuromelanin-sensitive MRI and DaT-SPECT in DLB patients. The combination of neuromelanin-sensitive MRI and DaT-SPECT demonstrated higher diagnostic performance in distinguishing between DLB and AD compared with neuromelanin-sensitive MRI alone. Additionally, although the combination of both modalities showed a larger AUC compared with DaT-SPECT alone, the difference was not statistically significant.</p> Conclusions <p>Neuromelanin-sensitive MRI may be equally or even more useful than DaT-SPECT in the clinical differentiation of DLB from AD. Furthermore, the combination of neuromelanin-sensitive MRI and DaT-SPECT may be a highly sensitive imaging marker for distinguishing DLB from AD.</p>","author":"Yuta Inagawa","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5f8cf6eecd639c58bd09bb938f6f67939d6a8d9ee012f9e18471767f5c93ac71","category":"Interdisciplinary"}