{"title":"Meet the Newest AWS Heroes – March 2023","link":"https://aws.amazon.com/blogs/aws/meet-the-newest-aws-heroes-march-2023/","date":1678386561000,"content":"<p>The <a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\">AWS Heroes</a> are passionate AWS experts who are dedicated to sharing their in-depth knowledge within the community. They inspire, uplift, and motivate the global AWS community, and today, we’re excited to announce and recognize the newest Heroes in 2023!</p> \n<h2>Aidan Steele – Melbourne, Australia</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/aidan-steele/\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/03/07/hero_aiden_steele-175x263-1.png\" width=\"175\" height=\"263\" /></a> Serverless Hero <a href=\"https://aws.amazon.com/developer/community/heroes/aidan-steele\" target=\"_blank\">Aidan Steele</a> is a Senior Engineer at Nightvision. He is an avid AWS user, and has been using the first platform and EC2 since 2008. Fifteen years later, EC2 still has a special place in his heart, but his interests are in containers and serverless functions, and blurring the distinction between them wherever possible. He enjoys finding novel uses for AWS services, especially when they have a security or network focus. This is best demonstrated through his open source contributions on GitHub, where he shares interesting use cases via hands-on projects.</p> \n<h2>Ananda Dwi Rahmawati – Yogyakarta, Indonesia</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/ananda-rahmawati/\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/03/07/hero_ananda_dwi_rahmawati-175x263-1.png\" width=\"175\" height=\"263\" /></a> Container Hero <a href=\"https://aws.amazon.com/developer/community/heroes/ananda-rahmawati\" target=\"_blank\">Ananda Dwi Rahmawati</a> is a Sr. Cloud Infrastructure Engineer, specializing in system integration between cloud infrastructure, CI/CD workflows, and application modernization. She implements solutions using powerful services provided by AWS, such as Amazon Elastic Kubernetes Service (EKS), combined with open source tools to achieve the goal of creating reliable, highly available, and scalable systems. She is a regular technical speaker who delivers presentations using real-world case studies at several local community meetups and conferences, such as Kubernetes and OpenInfra Days Indonesia, AWS Community Day Indonesia, AWS Summit ASEAN, and many more.</p> \n<h2>Wendy Wong – Sydney, Australia</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/wendy-wong/\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/03/07/hero_wendy_wong-175x263-1.png\" width=\"175\" height=\"263\" /></a> Data Hero <a href=\"https://aws.amazon.com/developer/community/heroes/wendy-wong\" target=\"_blank\">Wendy Wong</a> is a Business Performance Analyst at Service NSW, building data pipelines with AWS Analytics and agile projects in AI. As a teacher at heart, she enjoys sharing her passion as a Data Analytics Lead Instructor for General Assembly Sydney, writing technical blogs on dev.to. She is both an active speaker for AWS analytics and an advocate of diversity and inclusion, presenting at a number of events: AWS User Group Malaysia, Women Who Code, AWS Summit Australia 2022, AWS BuildHers, AWS Innovate Modern Applications, and many more.</p> \n<h2>Learn More</h2> \n<p>If you’d like to learn more about the new Heroes or connect with a Hero near you, please visit the <a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\"> AWS Heroes website</a> or browse the <a href=\"https://aws.amazon.com/developer/community/heroes/content-library/\" target=\"_blank\">AWS Heroes Content Library</a>.</p> \n<p>— <a href=\"https://twitter.com/taylorjacobsen\" target=\"_blank\">Taylor</a></p>","author":"Taylor Jacobsen","siteTitle":"AWS News Blog","siteHash":"117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"5f935d2e3af97b89bfc4b9e255c8a487931e090a069092eda34d36","category":"Tech"}