{"title":"CSS Generators","link":"https://smashingmagazine.com/2021/03/css-generators/","date":1615807800000,"content":"<p>Last week, we looked at <a href=\"https://www.smashingmagazine.com/2021/03/css-auditing-tools/\">CSS Auditing tools</a>, and this week around we’ll be looking at useful generators for everything CSS: from gradients to drop-shadows and bezier curves to triangles and type scales. Just a few useful tools for your toolbelt, to keep close.</p>\n<div>\n    <h4>More On CSS:</h4>\n    <ul>\n    <li><a href=\"https://www.smashingmagazine.com/2021/03/css-auditing-tools/\">CSS Auditing Tools</a></li>\n    <li><a href=\"https://www.smashingmagazine.com/2021/02/things-you-can-do-with-css-today/\">Things You Can Do With CSS Today</a></li>\n    <li><a href=\"https://www.smashingmagazine.com/2021/02/useful-chrome-firefox-devtools-tips-shortcuts/\">Useful DevTools Tips and Shortcuts</a></li>\n    <li>Also, <a href=\"/the-smashing-newsletter/\">subscribe to our newsletter</a> to not miss the next ones.</li>\n</ul>\n</div>\n\n<h3>CSS Shadows Generator</h3>\n<p>Looking for a tool that’ll automatically generate CSS code for really <strong>smooth, layered box-shadows</strong>? Well, you’re going to love <a href=\"https://brumm.af/shadows\">SmoothShadow</a>. Inspired by an article written by <a href=\"https://tobiasahlin.com/blog/layered-smooth-box-shadows/\">Tobias Ahlin Bjerrome</a>, this nifty tool was created to help anyone generate the code they need on the spot.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/29c59032-7213-4d9a-b5d4-6653c2d7c456/1-css-generators.png\" /></p>\n<p>Once you’ve given it a try, it will be difficult to not use it. The little tool allows you to visually design a layered smooth box-shadow, but also tweak alpha, offset and blur with individual easing curves. And it gets even better: The creator of the tool, <a href=\"https://twitter.com/funkensturm\">Philipp Brumm</a>, has also released SmoothShadow as a <a href=\"https://www.figma.com/community/plugin/788830704169694737/SmoothShadow\">Figma plugin</a>, so you can optimize your workflow just like you’ve always wanted to.</p>\n\n\n<h3>CSS Border-Radius Generator</h3>\n<p>When we think about <code>border-radius</code>, we usually think about a few straightforward values — perhaps 8px or 11px, or maybe 16px. However, <code>border-radius</code> can be quite <a href=\"https://9elements.com/blog/css-border-radius/\">fancy</a>, and <a href=\"https://9elements.github.io/fancy-border-radius/#30.30.30.33--.\">fancy-border-radius</a> generator allows you to generate them easily. The tool provides a visualization of not only plain round shapes, but also organic shapes, by using eight values combined. Essentially, what we are creating are overlapping ellipses that build the final shape. The tool is also available as <a href=\"https://github.com/9elements/fancy-border-radius\">CLI tool</a>, so you can run it locally as well.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/67998e7d-f168-4b4e-9b3c-aea3c7bffe2b/2-css-generators.png\" /></p>\n<h3>Cubic-Bezier Curves Generator</h3>\n<p>Sometimes an animation just doesn’t feel right, does it? Perhaps the duration is off, or the easing is quirky, and figuring it out might take quite some time. With Lea Verou’s <a href=\"https://cubic-bezier.com/\">cubic-bezier</a>, you can <strong>preview and compare animations</strong>, slow them down and even adjust them visually. And then copy-paste the CSS snippet to plug into your project right away.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3b04b7c5-9cb5-4bb9-be2d-f9273e31871c/3-css-generators.png\" /></p>\n<p>And if you need basic or complex CSS @keyframe animations, <a href=\"https://keyframes.app/\">Keyframes.app</a> provides a <strong>visual timeline editor</strong> similar to video-editing software. You can add steps, change sizing and position, apply transforms and color changes and get the CSS to copy-paste as well. Ah and not to forget the <a href=\"https://developers.google.com/web/tools/chrome-devtools/inspect-styles/animations\">Animation panel in Chrome</a> and <a href=\"https://developer.mozilla.org/en-US/docs/Tools/Page_Inspector/How_to/Work_with_animations\">Firefox</a> for debugging as well.</p>\n<h3>Easing Gradients</h3>\n<p>With gradients, we often rely on linear gradients, transitioning from one color to another. However, linear gradients have hard edges where they start or end. There is a way to make the gradients slightly better, with easing functions. So Andreas Larsen has built a little editor, <a href=\"https://larsenwork.com/easing-gradients/\">Easing Gradients Editor</a>, that allows us to create and preview easing gradients in CSS. The tool is also available as a <a href=\"https://github.com/larsenwork/sketch-easing-gradient#readme\">Sketch plugin</a> and a <a href=\"https://github.com/larsenwork/postcss-easing-gradients\">PostCSS plugin</a>. You can use a color picker, but unfortunately can't add an actual HEX color value yet.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9ae9e757-68f6-4ea4-a75f-a8f2d6533a72/c0zoib50.png\" /></p>\n<h3>Data Visualization Color Palettes</h3>\n<p>Sometimes you need very specific type of color for a very specific task. For example, if you are working on a data visualization project — e.g. pie charts, grouped bar charts, maps — you probably need a series of colors that are <em>visually equidistant</em>. That’s when <a href=\"https://learnui.design/tools/data-color-picker.html#palette\">LearnUI Data Color Picker</a> can become very useful. In such cases, it’s better to use a <strong>range of hues,</strong> so users can identify the differences faster. It’s indeed easier to distinguish <em>yellow from orange</em> than <em>blue from blue-but-15%-lighter</em>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/af649c50-abf1-4214-9e6c-493c3c4ad872/4-css-generators.png\" /></p>\n<p>With the tool, you choose how many colors you need and whether you need a light or a dark background color, and choose whether you want a default palette, a single hue palette, or a divergent color scale. Once you have it, you can copy hex values and export them as SVG to use in Sketch, Figma or Adobe XD.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b268276-9d44-4aa5-bc13-3d376cc1f60a/4b-css-generators.png\" /></p>\n<p>LearnUI also provides an <a href=\"https://learnui.design/tools/accessible-color-generator.html\">accessible color generator</a> and a quite fancy gradient generator, with different gradient types, interpolation, angle, easing and how smooth you’d like the gradient to be.</p>\n<h3>From CSS Color Shades To Triangles and Fake Data</h3>\n<p>Imagine that you just need to find CSS triangle styles for elements and pseudo-elements. Or perhaps refine the color palette a bit by exploring <strong>tints and shades</strong> of a given color. Or perhaps generate a linear and radial CSS gradient for a section of the page. There is no need to do it all manually or try to find those CSS snippets all over the web. You can always find them on <a href=\"https://omatsuri.app/\">Omatsuri</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/27d30187-536e-4944-882a-2651fa5f33a6/5-css-generators.jpg\" /></p>\n<p>Omatsuri means <em>festival</em> in Japanese, and the site is a lovely little festival of open-source browser tools for everyday use. On the site, you’ll find a <a href=\"https://omatsuri.app/triangle-generator\">triangle generator,</a> a color shades generator, a gradient generator, page dividers, SVG compressor, <strong>SVG → JSX converter</strong>, a fake data generator, CSS cursors, and keyboard event codes. Designed and built by Vitaly Rtishchev and Vlad Shilov. The <a href=\"https://github.com/rtivital/omatsuri\">source code of the site</a> is available as well.</p>\n<h3>CSS Overlay With High Contrast Generator</h3>\n<p>If you want to make text better stand out against a background image, there’s a little trick: You can use a CSS <code>linear-gradient</code> overlay with a certain opacity on top of the image to improve color contrast. <a href=\"https://twitter.com/addyosmani/status/1365735686838493187\">Spotify</a>, for example, uses the technique.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4a813689-6e6e-4444-805a-8ae2830273f9/6-css-generators.png\" /></p>\n<p>While all of this only requires one line of code, there’s still one question left to be answered: How to determine the opacity to use for the overlay? The <a href=\"https://codepen.io/yaphi1/pen/oNbEqGV\">Optimal Overlay Finder</a> helps you find out. You upload an image, enter your text and choose your overlay and text colors, and the tool shows you a preview of what the overlay looks like when applied to your image, as well as the optimal overlay opacity. A small detail that goes a long way.</p>\n<h3>CSS Color Palette Generator</h3>\n<p>There are plenty of fantastic tools to generate your color palette, but <a href=\"https://coolors.co/\">Coolors.co</a> is a little nifty tool that does just enough to generate palettes and explore different shades of a color. You can create a palette from the photo or a collage of photos, test for color blindness and quickly adjust hue, saturation, brightness and temperature. Obviously, it also features <a href=\"https://coolors.co/palettes/trending\">trending color palettes</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ae2e3c82-3484-4581-88cd-2ecc52282573/7-css-generators.png\" /></p>\n<p>You can also produce a <a href=\"https://coolors.co/gradient-palette/\">gradient palette</a> between two colors and <a href=\"https://coolors.co/gradient-maker/fcf3c4-f962a0-aa96f9\">create and export your own gradient</a> as CSS. The tool is available as an iOS app, Adobe add-on and Chrome extension.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0c142156-9777-4fdb-9902-5f918c3bc485/8-css-generators.png\" /></p>\n<p>And if you need something slightly more sophisticated for gradients in your toolbox, <a href=\"https://cssgradient.io/\">CSSGradient.io</a> is another tool for all your gradient needs — be it lineal or radial gradients, <a href=\"https://cssgradient.io/color-shades/\">color shades</a> or gradient backgrounds.</p>\n<p>Also, <a href=\"https://colordesigner.io/gradient-generator\">Gradient Generator</a> generates 1 to 40 stepped gradients from two colors of your choice. Each gradient is automatically presented in HEX, HSL, and RGB formats — all you need to do is simply click on the value, and it will be copied to your clipboard right away.</p>\n<h3>CSS Color Gradients Generator</h3>\n<p>Hand-picking colors to make a color gradient requires design experience and a good understanding of color harmony. If you need a gradient for a background or for UI elements but don’t feel confident enough to tackle the task yourself (or if you’re in a hurry), the <a href=\"https://mybrandnewlogo.com/color-gradient-generator\">color gradient generator</a> which the folks at My Brand New Logo have created has got your back.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3f1e06d9-0162-4a6d-ae11-56a07295f12b/9-css-generators.png\" /></p>\n<p>Powered by color gradient algorithms, the generator creates well-balanced gradients based on a color you select. There are four different styles of gradients that go from subtle to a mother-of-pearl effect and an intense, deep color gradient. You can adjust the gradient with sliders and, once you’re happy with the result, copy-paste the generated CSS code to use it in your project.</p>\n<h3>CSS Type Scale Generator</h3>\n<p>So what if you want to create a reliable typographic system that works well both on mobile and on desktop? Usually you would rely on established typographic scales, that provide a typographic hierarchy for everything from paragraphs to captions and headings. <a href=\"https://type-scale.com/\">Type-Scale</a> by Jeremy Church is a fantastic little tool that helps you build a typographic scale and export it in CSS. Small scales are usually a good fit for mobile views, medium scales could work well for the desktop view, and large scales could work well for marketing sites.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0216afda-fc55-4d57-9928-885a89d01f7b/10-css-generators.png\" /></p>\n<p>The tool provides 8 pre-defined harmonious type scales (but you can define a custom one as well), from Major Third to Perfect Fifth and generate a sequence of font sizes with a particular geometric incrementation ratio. You can adjust the settings such as <code>line-height</code> and body weight, refine the preview text and get the generated CSS — or edit it with a type specimen on CodePen. Alternatively, you can check Tim Brown’s good ol’ <a href=\"https://www.modularscale.com/\">ModularScale.com</a> as well.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/68f9f6c6-8ece-49a0-b283-efc4ad7332d6/11-css-generators.png\" /></p>\n<p>Another lovely tool is a <a href=\"https://www.layoutgridcalculator.com/typographic-scale/\">Typographic Scale Calculator</a> by <a href=\"http://www.jeanlou.net/\">Jean-Lou Desire</a> which, unlike Tim’s and Jeremy’s tools, generates a <a href=\"https://alistapart.com/article/more-meaningful-typography\">modular scale</a> using three defining properties (the initial term, the increment ratio, and the number of sizes in the scale) similar to the musical scale. The result is a smoother sizing for designers, with a few more options to compose more values from — e.g. for smaller side notes or large blockquotes.</p>\n<h3>CSS Capsize Generator</h3>\n<p>To minimize disorienting and expensive layout shifts during loading, we need to match the fallback font against the web font. Monica Dinculescu’s <a href=\"https://meowni.ca/font-style-matcher/\">font-style-matcher</a> allows us to minimize the jarring shift by matching the fallback font and the intended webfont’s x-heights and widths and we could make use of <a href=\"https://simonhearne.com/2021/layout-shifts-webfonts/\">f-mods</a> to do the same thing with new CSS properties.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b66dd29c-4998-47b4-a8fa-aa4c3a114ae6/12-css-generators.png\" /></p>\n<p>By default, many fonts come with pre-defined margins and leadings, so if a fallback font and a web font are different, the entire layout will change significantly. <a href=\"https://seek-oss.github.io/capsize/\">Capsize</a> adjusts the font-size, so that the height of capital letters is a multiple of your grid. It does so by trimming the space above capital letters and below the baseline. So by keeping the same line-height in a fallback font and a web font, the tool generates “magic numbers” to make sure that the switch is seamless.</p>\n<h3>CSS Complex Selectors Generator</h3>\n<p>Imagine that you need to create a table of items. You might want to keep them on the same row if there are 3 or fewer items, but then spanning two full lines for 6 and 8 items, while being just a list of cards with 10 items and more. How would you build it? While many of these situations can be fixed with CSS Grid and Flexbox, sometimes you might end up with a quite complex situation which would need a quite complex CSS selector.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e94e9f0d-2808-4e40-ae62-50d4d23ee991/13-css-generators.png\" /></p>\n<p>For this purpose, Drew Minns has built a generator for <a href=\"https://quantityqueries.com/\">Quantity Selectors</a> — complex CSS selectors that allow styles to be applied to elements based on the number of siblings. For example, when you want to apply styles to all elements when there are <strong>at least</strong> 5 items and siblings, or at most 10, or perhaps between 3 to 5 items.</p>\n<p>The final selector might not be easy to understand though, so it’s worth making sure that you provide a proper explanation in the code of what it’s supposed to target.</p>\n<h3>CSS <code>clip-path</code> Generator</h3>\n<p>Thanks to the <code>clip-path</code> property, we can create <a href=\"https://twitter.com/mikaelainalem/status/1358492344602025985\">complex shapes in CSS</a> by clipping an element to a basic shape, be it a simple circle, a fancy polygon, or even an SVG source. The CSS <code>clip-path</code> maker <a href=\"https://bennettfeely.com/clippy/\">Clippy</a> is a visual tool that helps you <strong>create and customize clip-paths</strong> right in your browser.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1eeb51d6-4a17-4774-ac1c-fbfe6def32cb/14-css-generators.png\" /></p>\n<p>To start off, you select a shape and a demo background from Clippy’s menu. You can then drag the shape’s points to create any shape you like — the color-coded CSS will not only reflect your changes instantly but also highlight them to help you understand how your choices influence the code.</p>\n<p>If the whole <code>clip-path</code> thing still feels a bit abstract to you or if you’re looking for a cool example of how to use it in an actual project, be sure to check out the <a href=\"https://codepen.io/ainalem/pen/QWGNzYm\">pop-out effect</a> that Mikael Ainalem created with <code>clip-path</code>.</p>\n<h3>CSS Grid Layout Generator</h3>\n<p>CSS Grid Layout can be <a href=\"https://www.smashingmagazine.com/2020/01/understanding-css-grid-container/\">quite</a> <a href=\"https://www.smashingmagazine.com/2020/01/understanding-css-grid-lines/\">straightforward</a>, but sometimes you might want to play with the Grid properties to figure out what just the right behavior would be for your layout. To get started, we can use Sarah Drasner’s <a href=\"https://cssgrid-generator.netlify.app/\">CSS Grid Generator</a>, Drew Minns’ <a href=\"https://griddy.io/\">Griddy</a>, Ali Alaa’s <a href=\"https://alialaa.github.io/css-grid-cheat-sheet/\">CSS Grid Cheat Sheet Generator</a> and LenioLabs’ <a href=\"https://grid.layoutit.com/\">LayoutIt</a> — they all allow you to define the grid and containers on the grid, as well as gaps, and it generates the CSS right away. If you need more guidance around Flexbox, <a href=\"https://www.flexboxpatterns.com/\">Flexbox Patterns</a> contains plenty of examples to play with.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7c43d0fd-5a77-49db-a031-4f2f7cafe81d/15-css-generators.png\" /></p>\n<p>Or you could use single line of CSS solutions. Una Kravets has built <a href=\"http://1linelayouts.glitch.me/\">1-Line Layouts</a>, a collection of ten modern CSS layout and sizing techniques. Starting out with the biggest mystery of all (centering) and covering everything from the <strong>classic Holy Grail Layout</strong> and the “Deconstructed Pancake” to applying <code>clamp()</code> and respecting aspect ratio, Una’s collection is full of little tidbits that are bound to make your life as a developer easier.</p>\n<p>Each technique comes with a demo, a CodePen to tinker with, and information on browser support. Una also recorded a <strong>video</strong> in which she explains every one-line wonder in greater detail. No matter if you’re a beginner or a pro, this resource will sure come in handy.</p>\n<h3>CSS Compound Grids Generator</h3>\n<p><a href=\"https://www.smashingmagazine.com/2019/07/inspired-design-decisions-pressing-matters/\">Compound grids</a> offer enormous flexibility and a lot of room for creativity. Made up of two or more grids of any type (column, modular, symmetrical, and asymmetrical) on one page, they can occupy separate areas or overlap.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/52c2464c-e8ed-4291-a06f-e9b95497b1b7/16-css-generators.png\" /></p>\n<p>A little tool to help you generate compound grids and save time drawing endless variations now comes from Michelle Barker: the <a href=\"https://codepen.io/michellebarker/full/zYOMYWv\">compound grid generator</a>. All you need to do is enter the number of columns for each of your grids, and they’ll be merged into a compound grid. A great addition to your digital toolbox. And if you need to create a modular grid, multicolumn grid or manuscript grid for your print project, <a href=\"https://www.layoutgridcalculator.com/online/\">Modular Grid Calculator</a> provides a thorough explanation on achieve it in InDesign.</p>\n<h3>CSS Filters and Blend Modes Generator</h3>\n<p>The CSS <code>drop-shadow</code> filter has excellent support but is rather underrated — a real shame given the fact that it could save you a lot of time hacking around with <code>box-shadow</code>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/dfe67708-fdba-49a3-9ce2-ddb20c92d600/17-css-generators.png\" /></p>\n<p>As Michelle Barker explains in a <a href=\"https://css-irl.info/drop-shadow-the-underrated-css-filter/\">blog post</a>, <code>drop-shadow</code> lets you use values for x-offset, y-offset, blur radius, and color — just like its more prominent sibling <code>box-shadow</code>. However, there’s one big advantage: the shadow does not correspond to the bounding box of an element (which is often where the hacking begins when using <code>box-shadow</code>) but to the non-transparent parts of an image. Perfect if you want to apply a drop shadow to a transparent PNG or SVG logo, for example, or even a clipped shape.</p>\n<p>There are <a href=\"https://css-tricks.com/almanac/properties/f/filter/\">plenty of CSS filters</a> out there, so if you need to find just the right set of filters for your project, Mads Stoumann’s <a href=\"https://codepen.io/stoumann/pen/MWeNmyb\">CSS Filter Editor</a> for testing out all <strong>supported filters</strong>, along with some presents that Mads has provided as well. Obviously, the CSS is generated on the fly as well.</p>\n<p>Beyond filters, there are also plenty of options for <a href=\"https://css-tricks.com/basics-css-blend-modes/\">CSS blend modes</a>. If you’d like to preview how some of the visual effects could work together, you can use Rick Metzger’s <a href=\"https://cssduotone.com/\">CSS Duotone Generator</a>. The tool includes options for zooming, spacing, blur and image opacity, but also all blend modes for foreground and background images. Of course, the tool also generates HTML and CSS.</p>\n<h3>Blurred Image Placeholders Generator</h3>\n<p>An image placeholder is an efficient way to improve a site’s perceived performance when an image is loading. On his quest to find the fastest and best-looking image placholders for the web, Joe Bell decided to come up with a solution himself. The result: <a href=\"https://plaiceholder.co/\">Plaiceholder</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f05aea7c-a0b2-4193-93f9-5dbde46ea3ff/18-css-generators.png\" /></p>\n<p>Powered by a collection of Node.js helpers, Plaiceholder turns your images into lightweight, blurred placeholder images. There are several approaches to choose from: CSS (which is recommended), SVG, Base 64, <a href=\"https://blurha.sh/\">Blurhash</a>, and the experimental <a href=\"https://github.com/joe-bell/blurhash-to-css\">Blurhash to CSS</a>.</p>\n<h3>CSS Animations Generator</h3>\n<p>It’s quite easy to tell a difference between an animation that seems to be a bit off, and an animation that is done just well. But adjusting the keyframes animations or transitions manually can be quite time-consuming. <a href=\"https://animista.net/\">Animista</a> provides a <strong>library of animations and transitions</strong> that you can use out of the box. There are plenty of presets for entrances and exits, text highlights, button actions and background effects. Once you’ve defined an animation you can copy-paste the CSS snippet of the animation, along with the code generated by Autoprefixer.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4fe272ca-8cbc-41ec-9b35-9076f70a98ad/19-css-generators.png\" /></p>\n<p><a href=\"https://www.csswand.dev/\">CSS Wand</a> provides <strong>hover and loading animations</strong>, but you can also use <a href=\"https://github.com/hakimel/Ladda\">Ladda animations</a> (buttons with built-in loading indicators) and <a href=\"https://epic-spinners.epicmax.co/\">Eric Spinners</a> (with Vue.js integration). And perhaps you’d like to add a whimsical twist on hover transitions with <a href=\"https://www.joshwcomeau.com/react/boop/\">Boop!</a> — just keep in mind to <a href=\"https://www.joshwcomeau.com/snippets/html/scale-with-pseudoelements/\">scale with pseudo-elements</a> and respect motion preferences for users who opt-in for reduced motion.</p>\n<h3>CSS Doodles Generator</h3>\n<p>We can bring the most sophisticated layouts to life with CSS, but we can also generate playful artworks and doodles. Yuan Chuan has built <a href=\"https://css-doodle.com/\"></a>, a web component for <strong>drawing patterns with CSS</strong>. The component includes plenty of utility functions and shorthand properties to play with. As a result, the component generates a grid of <code>div</code>s along with the plain CSS. The source code is also <a href=\"https://github.com/css-doodle/css-doodle\">available on GitHub</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6c7c8607-7e04-4007-bd6b-6c1325492500/21-css-generators.png\" /></p>\n<h3>Useful Little Web Dev Helpers</h3>\n<p>If you need a few more tools in your life, luckily, there are a lot of good ’ol web developers collecting their favorite <strong>useful tools all in one place</strong> named <a href=\"https://tiny-helpers.dev/\">Tiny Helpers</a>. Maintained by Stefan Judis, you’re sure to find all sorts of tools: from APIs, accessibility and color, to fonts, performance, regular expressions, SVG, and Unicode.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a70059a2-74cd-4cf6-a8a5-701e777154b2/20-css-generators.png\" /></p>\n<p>Of course, there are many more shared on other platforms, such as the very useful <a href=\"https://twitter.com/JoshWComeau/status/1212416797254832130\">Twitter thread by Josh W. Comeau</a> but also by <a href=\"https://twitter.com/stefanjudis/status/1216788482972168193\">Stefan Judis</a> himself. Whatever it is that you’ve been eager to find that will help you get work done better and faster, you’re bound to find it there!</p>\n<h3>Wrapping Up</h3>\n<p>There are <em>literally</em> <a href=\"https://uitest.com/\">hundreds</a> of resources out there, and we hope that some of the ones listed here will prove to be useful in your day-to-day work — and most importantly help you avoid some time-consuming, routine tasks. Happy generating!</p>\n<div>\n    <h4>More On CSS:</h4>\n    <ul>\n    <li><a href=\"https://www.smashingmagazine.com/2021/03/css-auditing-tools/\">CSS Auditing Tools</a></li>\n    <li><a href=\"https://www.smashingmagazine.com/2021/02/things-you-can-do-with-css-today/\">Things You Can Do With CSS Today</a></li>\n    <li><a href=\"https://www.smashingmagazine.com/2021/02/useful-chrome-firefox-devtools-tips-shortcuts/\">Useful DevTools Tips and Shortcuts</a></li>\n    <li>Also, <a href=\"/the-smashing-newsletter/\">subscribe to our newsletter</a> to not miss the next ones.</li>\n</ul>\n</div>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"5f967997c446b83ec4619318a714ff3c9149a551b71a354669cfa3fbe8b16f3c","category":"Tech"}