{"title":"Kaliningrad – The Westernmost of Russia","link":"https://markpeak.net/kaliningrad/","date":1634136578000,"content":"<p>เขียนเรื่อง<a href=\"https://markpeak.net/russian-premier-league/\">ลีกฟุตบอลรัสเซีย</a> เลยสงสัยเรื่อง<a href=\"https://en.wikipedia.org/wiki/Kaliningrad_Oblast\">พื้นที่เมืองคาลินินกราด (Kaliningrad)</a> ด้านตะวันตกสุดของรัสเซีย ซึ่งเป็นพื้นที่แยกมาจากแผ่นดินใหญ่ (exclave) ของรัสเซีย ถูกล้อมโดยประเทศโปแลนด์และลิธัวเนีย</p>\n<p>ประเทศในแถบนั้นคือ ลิธัวเนีย ลัตเวีย เอสโตเนีย เบลารุส เป็นประเทศเกิดใหม่ที่เพิ่งแยกตัวจากสหภาพโซเวียต หลังโซเวียตล่มสลายในปี 1991</p>\n<p>คำถามคือคาลินินกราดอยู่ในวงล้อมตรงนั้น ทำไมไม่แยกตัวจากโซเวียตด้วย ทำไมยังเป็นส่วนหนึ่งของรัสเซียอยู่</p>\n<p>คำตอบของเรื่องนี้ต้องย้อนที่มาทางประวัติศาสตร์สักหน่อย</p>\n<p>พื้นที่ตรงนี้ไม่ใช่พื้นที่ของรัสเซียแต่ดั้งเดิม โดยคาลินินกราดมีชื่อเดิมคือ Konigsberg ซึ่งเป็นส่วนหนึ่งของปรัสเซีย (Prussia คือแคว้นของชาวเยอรมันก่อนตั้งประเทศเยอรมนี) แถมยังเคยเป็นเมืองหลวงของปรัสเซียซะด้วย (1525-1701) ก่อนที่พรมแดนของปรัสเซียจะขยายไปทางตะวันตก และย้ายเมืองหลวงไปทางตะวันตกกว่าเดิม (ซึ่งก็คือเบอร์ลิน)</p>\n<p>ดังนั้นประชากรของ Konigsberg เป็นชาวเยอรมัน โดยถือเป็น “เกาะเยอรมัน” ท่ามกลางดินแดนของชาวโปแลนด์ที่อยู่ใกล้ๆ (โปแลนด์ก็เข้าๆ ออกๆ ในฐานะดินแดนของปรัสเซีย-เยอรมันเช่นกัน) และชาวลิธัวเนียที่อยู่ติดกัน นักปรัชญาคนดังอย่าง Immanuel Kant ก็เกิดที่นี่</p>\n<p>การเปลี่ยนแปลงสำคัญเกิดขึ้นในช่วงท้ายสงครามโลกครั้งที่สอง เมื่อกองทัพแดงยึดดินแดนทางตะวันออกของเยอรมนีได้ทั้งหมด (และเป็นฝ่ายที่ยึดเบอร์ลินได้) ในข้อตกลงที่ Potsdam ช่วงปลายสงคราม สหภาพโซเวียตจึงได้ดินแดนแถบนี้ไปเกือบทั้งหมด (ยกเว้นโปแลนด์)</p>\n<p>ในช่วงที่โซเวียตบุกตีดินแดนแถบนี้ ชาวเยอรมันที่อาศัยอยู่ใน Konigsberg ก็หนีข้ามทะเล ข้ามโปแลนด์มาอยู่ที่เยอรมันตะวันออก สิ่งที่โซเวียตทำจึงเป็นการย้ายคนรัสเซียของตัวเองเข้ามาอาศัย แล้วเปลี่ยนชื่อเป็น Kaliningrad ทำให้ประชากรเชื้อสายเยอรมันแทบไม่เหลือแล้ว กลายเป็นคนรัสเซียเกือบหมด</p>\n<p>เท่ากับว่า Konigsberg เปลี่ยนจากเกาะเยอรมัน มาเป็น Kaliningrad ที่เป็นเกาะรัสเซีย โดยยังมีชาวโปแลนด์และลิทัวเนียล้อมไว้เหมือนเดิม</p>\n<p>โซเวียตเคยเสนอให้ลิทัวเนียรวม Kaliningrad ไปด้วย แต่ลิธัวเนียไม่เอาเพราะเป็นคนละเผ่ากัน (555) พอถึงยุคโซเวียตล่มสลาย ลิทัวเนียแยกประเทศ จึงไม่สนใจเอา Kaliningrad ไปด้วยอยู่ดี โปแลนด์ก็ไม่เอา ทำให้ Kaliningrad ยังมีสถานะเป็น “เกาะรัสเซีย” จนถึงทุกวันนี้</p>\n<p>ดูในคลิปของช่อง History Matters ก็อธิบายไว้เข้าใจง่ายดี</p>\n<p></p>\n<p> </p>The post <a href=\"https://markpeak.net/kaliningrad/\">Kaliningrad – The Westernmost of Russia</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"5f9d15f37284597a4b2d7ef7a1838d6ccf0997c25d2943ce4cbab4164cf8da51","category":"Thai"}