{"title":"เศรษฐา ทวีสิน หารือ Google และ Microsoft ก่อนการประชุม APEC ที่กำลังมาถึง","link":"https://www.blognone.com/node/136518","date":1698832280000,"content":"<div><div><div><p>นายเศรษฐา ทวีสิน นายกรัฐมนตรีคนปัจจุบันของประเทศไทยโพสต์ใน X ว่าได้เข้าร่วมหารือกับบริษัทเทคโนโลยีชื่อดังอย่าง Google และ Microsoft เพื่อเตรียมความพร้อมในการลงนาม MOU (แต่ไม่บอกว่าเป็น MOU อะไร) และการประชุม APEC ที่กำลังจะจัดในเมืองซาน ฟรานซิสโก ประเทศสหรัฐอเมริกา</p>\n<p>จากการพูดคุย Google มีความตั้งใจที่จะเดินหน้าให้การสนับสนุนการเปลี่ยนผ่านประเทศไทยสู่ยุคเศรษฐกิจดิจิทัล และความต้องการใช้ AI ที่เกิดขึ้นในหลายภาคส่วน จะทำให้เกิดการขยายตัวทางเศรษฐกิจ โดยนายเศรษฐา ทวีสิน เชื่อว่าประเทศไทยมีความพร้อมที่จะรองรับการลงทุนจาก Google</p>\n<p>ส่วนทาง Microsoft ก็เห็นศักยภาพในประเทศไทย ทั้งในด้านความพร้อม Clean energy และสิทธิประโยชน์ในการลงทุน รวมถึงการนำ AI มาเพิ่ม Productivity ของภาครัฐ และการเพิ่มทักษะการพัฒนา AI ของคนไทย Microsoft เชื่อว่า AI จะทำให้นโยบายต่าง ๆ ของรัฐบาลสามารถมี Insights ที่มากขึ้นได้ และสร้าง Impact ให้กับประชาชนได้จริง ๆ</p>\n<p><em>รูปภาพจากบัญชี X ของ นายเศรษฐา ทวีสิน</em><br />\n<img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/659bff90fead8b05433116be1192d26a.jpg\" /></p>\n<p>ก่อนหน้านี้นายเศรษฐา ทวีสิน <a href=\"https://www.blognone.com/node/135883\">เคยพบกับ Elon Musk และทีมงานทั้งจาก Tesla, SpaceX และ Starlink เมื่อเดือนกันยายน</a> โดยแลกเปลี่ยนมุมมองเกี่ยวกับโลกอนาคตที่ใช้พลังงานสะอาดมาแล้วด้วย</p>\n<blockquote><p>พบปะกับทีม Google เพื่อหารือการเตรียมความพร้อมสำหรับการประชุมเอเปค และการเตรียมลงนาม MOU ที่กำลังจะมาถึงนี้ครับ จากการพูดคุย Google มีความตั้งใจที่จะเดินหน้าให้การสนับสนุนการเปลี่ยนผ่านประเทศไทยสู่ยุคเศรษฐกิจดิจิทัล และความต้องการใช้ AI ที่เกิดขึ้นในหลายภาคส่วน… <a href=\"https://t.co/PFlw368htD\">pic.twitter.com/PFlw368htD</a></p>\n<p>— Srettha Thavisin (@Thavisin) <a href=\"https://twitter.com/Thavisin/status/1719615421605929466?ref_src=twsrc%5Etfw\">November 1, 2023</a></p></blockquote>\n<blockquote><p>Microsoft นำโดย คุณ Ahmed Mazhari - President Microsoft Asia เข้ามาพูดคุย เพื่อเตรียมการในการลงนาม MOU ที่กำลังจะเกิดขึ้นในการเดินทางไปร่วมประชุม APEC ในเมืองซาน ฟรานซิสโก ทาง Microsoft เห็นศักยภาพในประเทศไทย ทั้งในด้านของความพร้อมของ Clean energy และสิทธิประโยชน์ในการลงทุน… <a href=\"https://t.co/YDViLanLm0\">pic.twitter.com/YDViLanLm0</a></p>\n<p>— Srettha Thavisin (@Thavisin) <a href=\"https://twitter.com/Thavisin/status/1719580952509501821?ref_src=twsrc%5Etfw\">November 1, 2023</a></p></blockquote>\n<p>ที่มา - <a href=\"https://twitter.com/Thavisin\">X.com</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/thailand\">Thailand</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5f9e37d58eaaad07f5e5671edf21137941c7003a8f56c7fcaefe65bea16f2a90","category":"Thai"}