{"title":"Biological Carbon Sequestration: From Deep History to the Present Day","link":"https://www.preprints.org/manuscript/202405.1683/v1","date":1716788542000,"content":"In the global carbon cycle, atmospheric carbon emissions, both ‘natural’ and anthropogenic, are balanced by carbon uptake (i.e. sequestration) that mostly occurs via photosynthesis, plus a much smaller proportion via geological processes. Since the formation of the Earth about 4.54 billion years ago the ratio between emitted and sequestered carbon has varied considerably with atmospheric CO2 levels ranging from 100,000 ppm to a mere 100 ppm. Over this time, a huge amount of carbon has been sequestered due to photosynthesis and essentially removed from the cycle, being buried as fossil deposits of coal, oil and gas. Relatively low atmospheric CO2 levels were the norm for the past 10 million years, and during the past million years they averaged about 220 ppm. More recently, the Holocene epoch, starting ~11,700 years ago, has been a period of unusual climatic stability with relatively warm, moist conditions and low atmospheric CO2 levels of between 260 and 280 ppm. During the Holocene, stable conditions facilitated a social revolution with domestication of crops and livestock leading to urbanisation and development of complex technologies. As part of the latter process, immense quantities of sequestered fossil carbon have recently been used as energy sources, resulting in a particularly rapid increase in CO2 emissions after 1950 CE to the current value of 424 ppm, with further rises to &gt;800 ppm predicted by 2100. This is already perturbing the previously stable Holocene climate and threatening future food production and social stability. Today, the global carbon cycle has been shifted such that carbon sequestration is no longer keeping up with recent anthropogenic emissions. In order to address this imbalance it is important to understand the roles of high-capacity carbon sequestration systems, such as natural forests and tropical croplands, and to devise strategies to facilitate net CO2 uptake.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5fa4a559d11128796563a98ffab313870ecdf3d98887fc5a00a1eead00b98392","category":"Interdisciplinary"}