{"title":"‘Inside the AI Factory: The Humans That Make Tech Seem Human’","link":"https://www.theverge.com/features/23764584/ai-artificial-intelligence-data-notation-labor-scale-surge-remotasks-openai-chatbots","date":1687813372000,"content":"\n<p>Josh Dzieza, in a splendid investigative report co-published by The Verge <a href=\"https://nymag.com/intelligencer/article/ai-artificial-intelligence-humans-technology-business-factory.html\">and New York Magazine</a>:</p>\n\n<blockquote>\n  <p>For Joe’s students, it was work stripped of all its normal\ntrappings: a schedule, colleagues, knowledge of what they were\nworking on or whom they were working for. In fact, they rarely\ncalled it work at all — just “tasking.” They were taskers.</p>\n\n<p>The anthropologist David Graeber defines “bullshit jobs” as\nemployment without meaning or purpose, work that should be\nautomated but for reasons of bureaucracy or status or inertia is\nnot. These AI jobs are their bizarro twin: work that people want\nto automate, and often think is already automated, yet still\nrequires a human stand-in. The jobs have a purpose; it’s just that\nworkers often have no idea what it is. [...]</p>\n\n<p>This tangled supply chain is deliberately hard to map. According\nto people in the industry, the companies buying the data demand\nstrict confidentiality. (This is the reason Scale cited to explain\nwhy Remotasks has a different name.) Annotation reveals too much\nabout the systems being developed, and the huge number of workers\nrequired makes leaks difficult to prevent. Annotators are warned\nrepeatedly not to tell anyone about their jobs, not even their\nfriends and co-workers, but corporate aliases, project code names,\nand, crucially, the extreme division of labor ensure they don’t\nhave enough information about them to talk even if they wanted to.\n(Most workers requested pseudonyms for fear of being booted from\nthe platforms.) Consequently, there are no granular estimates of\nthe number of people who work in annotation, but it is a lot, and\nit is growing. A recent Google Research paper gave an\norder-of-magnitude figure of “millions” with the potential to\nbecome “billions.”</p>\n</blockquote>\n\n<p>Evocative artwork by Richard Parry accompanying the piece at The Verge, too.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/26/inside-the-ai-factory\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"5fa8484b1700d040dc523c3848c6fd966bee691d23451e61af0efabb4b47d880","category":"Tech"}