{"title":"Beeper: Multi-Service Multi-Platform Messaging App That Supports iMessage","link":"https://www.beeperhq.com/","date":1612557276000,"content":"\n<p>Beeper is a new $10/month app/service that aims to provide a unified chat app for 15 messaging platforms (and counting) — including iMessage. From their FAQ:</p>\n\n<blockquote>\n  <p><em>How in the world did you get iMessage to work on Android and\nWindows?</em></p>\n\n<p>This was a tough one to figure out! Beeper has two ways of\nenabling Android, Windows and Linux users to use iMessage: we send\neach user a Jailbroken iPhone with the Beeper app installed which\nbridges to iMessage, or if they have a Mac that is always\nconnected to the internet, they can install the Beeper Mac app\nwhich acts as a bridge. This is not a joke, it really works!</p>\n</blockquote>\n\n<p>The idea of a single app with support for multiple messaging services harks back to <a href=\"https://adium.im/\">Adium</a> — and even Apple’s own iChat, <a href=\"https://en.wikipedia.org/wiki/IChat#Supported_protocols\">which supported several services back in the day</a> (AIM, Jabber, Yahoo, ICQ, and more). One of Beeper’s founders is Eric Migicovsky, who created <a href=\"https://daringfireball.net/search/pebble\">the Pebble smartwatch</a> back in 2013. When Beeper was announced two weeks ago, <a href=\"https://twitter.com/ericmigi/status/1351934418961661959\">he tweeted to confirm that the jailbroken old iPhone trick was no joke</a>, with photos.</p>\n\n<p>Running the Beeper app on an always-on Mac as a bridge for iMessage is reasonable — and is how <a href=\"https://airmessage.org/\">AirMessage</a>, an unofficial (needless to say) iMessage client for Android works. Sending users old iPhones running old jailbroken versions of iOS is delightfully clever, but — scaling issues aside (what happens if Beeper gets hundreds of thousands of users, let alone millions?) — is a security nightmare. It strikes me as utterly irresponsible.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Beeper: Multi-Service Multi-Platform Messaging App That Supports iMessage’\"  href=\"https://daringfireball.net/linked/2021/02/05/beeper\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"5fb066c8df6091f33bb6101682cc1f483d1dab14990af6ac0ec85d01619b61e4","category":"Tech"}