{"title":"249 A nutritional solution based on calcidiol (25-OH-D3, HyD) and triterpenoid improves growth performance in grower-finisher pigs fed low Ca and P diets without compromising bone health","link":"https://academic.oup.com/jas/article/102/Supplement_2/146/7664922?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Nutritional strategies to realize the genetic potential of modern pigs without compromising welfare while reducing environmental impact are critical for success in the swine industry today. By harnessing the potential of 25-OH-D<sub>3</sub>, it is possible to fine-tune mineral utilization, thereby allowing for the reduction of excessive calcium (Ca) and phosphorus (P), while promoting bone development and muscle deposition in finisher pigs [1]. A study was conducted using 60 male pigs [initial body weight (BW) = 29.9 kg ± 0.5 kg] to evaluate the effect of reducing dietary Ca and P and supplementing with 25-OH-D<sub>3</sub> and triterpenoid, on growth, bone and blood characteristics. Pigs entered the experimental room at 10 wk of age and were randomly allocated to one of six pens in groups of 10. Pigs had a 2-wk adaptation where they were offered a grower diet (NE:12.3MJ, CP:17.5%) before receiving their respective treatments from 12 wk (NE:11.5MJ, CP:16.19%). Three experimental diets were evaluated for 7 wk; Positive control: 0.7% total Ca, 0.36% total P, vit D<sub>3</sub> at 1,500 IU/kg feed (PC), negative control: PC diet + 30% reduced Ca and 10% reduced P (NC), and NC diet with 1,500 IU D<sub>3</sub>, in calcidiol form (25-OH-D3, HyD) and triterpenoid (NC+). Pigs had ad libitum access to feed which was recorded individually via automated electronic feeders. At slaughter, blood was collected, and body and carcass composition scans were taken from pigs using dual-energy x-ray absorptiometry (DXA) and metacarpals were collected. Data were analyzed in JMP17.0 using one-way ANOVA, including treatment as a main effect and 10-wk weight as a covariate, with pig as the experimental unit. Table 1 shows the results. Pigs offered NC+ tended to have a heavier slaughter weight compared with NC, with PC being intermediate (<span>P</span> = 0.08). There were no differences in feed-intake, but NC+ increased average daily gain compared with NC (<span>P</span> = 0.03), and NC+ tended to be more efficient (<span>P</span> = 0.08). The DXA-scan demonstrated that bone mineral density and content in NC+ pigs were comparable with PC and NC. Additionally, reducing Ca and P in NC resulted in reduced ash, Ca and P in the metacarpals. Interestingly, NC+ had similar bone P content to PC, indicating that NC+ allows for reduced Ca and P, without compromising bone composition. As expected, NC+ had greater 25-OH-D<sub>3</sub> blood concentrations (<span>P</span> &lt; 0.001). Although there was no difference in blood for Ca, P concentrations were greater in NC+ compared with other groups (<span>P</span> = 0.007), suggesting that NC+ allowed for greater P circulating concentrations, despite being reduced in the diet. In conclusion, supplementing a reduced Ca and P diet with calcidiol and triterpenoid can enhance weight gain and feed-conversion as well as improving blood 25-OH-D<sub>3</sub> and bone P concentrations. The use of this solution shows that diets can be formulated to be more sustainable without compromising performance or bone-health.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5fc30f72e70294e234cffb0d0fb8d4d22fb65daecd0a46c3426a264cc7b6ec53","category":"Environment"}