{"title":"The epidemiology of gestational diabetes, gestation hypertension, and anemia in North Palestine from 2018 to 2020: A retrospective study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301145","date":1711720800000,"content":"<p>by Basma Damiri, Haytham Abumohsen, Souad BelKebir, Mahmoud Hamdan, Lubna Saudi, Hiba Hindi, Rawnaq Abdaldaem, Baraa Bustami, Abeer Almusleh, Osama Yasin</p>\r\nBackground <p>In Palestine, women face a challenging environment and a demanding lifestyle, which puts them at a higher risk of experiencing complications during pregnancy. This study aimed to examine the risk factors linked with abnormal hemoglobin (Hb) levels, gestational diabetes (GD), and gestational hypertension (GH) among pregnant women. The results was compared between women residing in cities or villages areas and those in refugee camps.</p> Methods <p>Medical records (N = 7889) for pregnant women at primary healthcare centers in the North West Bank were reviewed for sociodemographic and medical data along with the reported fasting blood sugar, hemoglobin, and blood pressure in the first and second trimesters from July 2018 to July 2020. However, only 6640 were included in the analysis as 1249 were excluded for having multiple pregnancy or lost to follow up. Complications and risk factors were defined according to the available global guidelines. Then, descriptive analysis was used to show the percentages of different risk factors and complications among them. The correlation between the several characteristics and variables with these complications was assessed by calculating the odds ratios (OR) using logistic regression. P-values of &lt;0.05 were considered significant.</p> Results <p>The prevalence of adolescent pregnancy was the highest among women living in rural areas (9.8%) and grand multigravidity among refugee women (22%). The overall prevalence of anemia was higher in the second-trimester (16.2%) than in the first-trimester (11.2%), with anemic women in the first-trimester being more likely to be anemic in the second-trimester (OR = 8.223, P-value&lt;0.001). Although anemia was less common in the first-trimester among refugees than among women living in urban areas (OR = 0.768, P-value = 0.006), it was more prevalent in the second-trimester (OR = 1.352, P-value&lt;0.001). Moreover, refugee women were at lower risk than women living in urban areas of having GD (OR = 0.687, P-value&lt;0.001) and diabetes mellitus (OR = 0.472, P-value&lt;0.001) in the second-trimester. GH was associated with GD (OR = 1.401, P-value = 0.003) and DM (OR = 1.966, P-value&lt;0.001).</p> Conclusion <p>The findings of this study provide evidence-based data on the considerable prevalence of pregnancy complications, anemia, GD, and GH among Palestinian pregnant women living in the north of the West Bank. Multi gravida, gestational age, Hb levels, and the type of settings were strong predictors of pregnancy complications. Therefore, a national plan is needed to ensure adequate maternal care for all, especially disadvantaged women, those in rural areas and refugee camps.</p>","author":"Basma Damiri","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5fc88db049d742e9947fb56724177de9e15677a18a4934d063724ed7bd82bde4","category":"Interdisciplinary"}