{"title":"Let the National Park Service Know We Want e-Bikes","link":"https://bikerumor.com/national-parks-e-bike-policy-comments/","date":1689685551000,"content":"<p>The National Park Service is reviewing its rules around e-bike usage on park property, which includes maintained, improved, and unimproved roads, plus bike trails and paths.</p>\n\n\n\n<p>Currently, NPS regulations allow park superintendents to allow e-bikes on roads and trails where regular bicycles are allowed, but this review could allow them the authority to open up more public areas (but not “wilderness” areas) to e-bike use, helping increase access to more people.</p>\n\n\n\n<p>The benefit of expanding where e-bikes can go is that it will help more people explore further beyond the areas immediately adjacent to parking lots, which can relieve congestion. With more and more parks implementing timed and limited entry for cars, allowing people to ride bikes to popular trailheads and destinations means more access while reducing vehicular traffic.</p>\n\n\n\n<p>The <a href=\"https://parkplanning.nps.gov/showFile.cfm?projectID=117364&amp;MIMEType=application%252Fpdf&amp;filename=NPS%20Programmatic%20ebike%20EA%20June%202023%2Epdf&amp;sfid=658485\" target=\"_blank\">Programmatic Environmental Assessment</a> (PDF) is available for review and details which class e-bikes (1/2/3) are allowed where, and which recommendations against Class 2 (throttle only) on bike paths and trails. <a href=\"https://www.nps.gov/orgs/1207/public-input-potential-impacts-of-e-bikes.htm?eid=129827#:~:text=The%20comment%20period%20is%20open,and%20providing%20healthy%20recreation%20opportunities.\" target=\"_blank\">Summary and more links at NPS.gov</a>.</p>\n\n\n\n<p>You can <a href=\"https://parkplanning.nps.gov/document.cfm?parkID=442&amp;projectID=117364&amp;documentID=129840\" target=\"_blank\">comment here</a> and let them know that you support e-bikes in our National Parks. Not sure what to say? Use People For Bikes’ suggested comment, which you can <a href=\"https://docs.google.com/document/d/15caJVOb1vRKqsaAXB_8ZOtM4qiVjeGeSagBELaxQrDc/edit?eid=129827\" target=\"_blank\">copy/paste here</a> (DOC).</p>\n<p>The post <a href=\"https://bikerumor.com/national-parks-e-bike-policy-comments/\">Let the National Park Service Know We Want e-Bikes</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Tyler Benedict","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"5fcf1d5f11e2d53f2117f9f22e5739f226f1722d7c76b9069e101ed6d2052208","category":"Cycling"}