{"title":"Sexual dysfunction among people with mental illness in Africa: A systematic review and meta-analysis study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308272","date":1722434400000,"content":"<p>by Setegn Fentahun, Mamaru Melkam, Gebresilassie Tadesse, Gidey Rtbey, Fantahun Andualem, Yilkal Abebaw Wassie, Gebremariam Wulie Geremew, Tekletsadik Tekleslassie Alemayehu, Tewodros Denekew Haile, Tilahun Nega Godana, Berihun Agegn Mengistie, Mulualem Kelebie, Girum Nakie, Techilo Tinsae, Girmaw Medfu Takelle</p>\r\nBackground <p>Sexual dysfunction is the most frequent health problem among psychiatric patients. This could be the result of both the nature of the illness itself and the side effects of prescribed psychotropic medications. It also significantly affects an individual’s general well-being, interpersonal relationships, self-esteem, and treatment outcomes. Therefore, the current systematic review and meta-analysis was conducted to determine the combined prevalence of sexual dysfunction and its correlated factors among people with mental illness.</p> Methods <p>We retrieved eligible primary studies using various search databases like PubMed, EMBASE, Science Direct, African Journal Online, Google Scholar, and Psychiatry Online. The report of this systematic review was reported following the Preferred Reporting Items for Systematic Review and Meta-Analysis (PRISMA) guidelines. We used standardized data extraction checklists and STATA version 14 for data extraction and analysis, respectively. The I-squared statistics test was used to check statistical heterogeneity within the included articles. Publication bias was assessed using a funnel plot and the Egger test. To estimate the overall prevalence and correlated factors of sexual dysfunction, a random effects model meta-analysis was employed.</p> Results <p>In this meta-analysis, a total of 15 primary studies with 2849 psychiatric patients were included. The overall pooled prevalence of sexual dysfunction among psychiatric patients in Africa was 58.42% (95% CI: 49.55, 67.28). Having older age (OR = 1.92, 95% CI: 1.28, 2.87), longer duration of illness (OR = 2.60, 95% CI: 1.14, 5.93), history of relapse (OR = 3.51, 95% CI: 1.47, 8.43), poor quality of life (OR = 3.89, 95% CI: 2.15, 7.05), and antipsychotic medications (OR = 2.99, 95% CI: 1.84, 4.86) were significantly associated with sexual dysfunction.</p> Conclusion <p>This meta-analysis revealed that approximately two-thirds of psychiatric patients in Africa are affected by sexual dysfunction. Therefore, the findings of this study recommend that when evaluating psychiatric patients, health professionals should focus more on sexual dysfunction. It is also essential to promote awareness and incorporate sexual health assessment and intervention into mental health services to reduce the overall burden of the problem.</p>","author":"Setegn Fentahun","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"5fcf1a58b468352927303095257341edc857f849bc4c2f686bfdf4f9678a8b56","category":"Interdisciplinary"}