{"title":"Warming and increased precipitation alter soil carbon cycling in a temperate desert steppe of Inner Mongolia","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae003/7655325?rss=1","date":1713571200000,"content":"<span><div>Abstract</div>Warming and precipitation are key global change factors driving soil carbon (C) dynamics in terrestrial ecosystems. However, the effects of warming and altered precipitation on soil microbial diversity and functional genes involved in soil C cycling remain largely unknown. We investigated the effects of warming and increased precipitation on soil C cycling in a temperate desert steppe of Inner Mongolia using metagenomic sequencing. We found that warming reduced plant richness, Shannon–Wiener and Simpson index. In contrast, increased precipitation significantly influenced Shannon–Wiener and Simpson index. Warming reduced soil microbial species by 5.4% while increased precipitation and warming combined with increased precipitation led to increases in soil microbial species by 23.3% and 2.7%, respectively. The relative abundance of Proteobacteria, which involve C cycling genes, was significantly increased by warming and increased precipitation. Warming significantly reduced the abundance of <span>GAPDH</span> (Calvin cycle) and <span>celF</span> (cellulose degradation) while it enhanced the abundance of <span>glxR</span> (lignin degradation). Increased precipitation significantly enhanced the abundance of <span>pgk</span> (Calvin cycle), <span>coxL</span> (carbon monoxide oxidation), <span>malZ</span> (starch degradation), and <span>mttB</span> (methane production). Moreover, a wide range of correlations among soil properties and C cycling functional genes was detected, suggesting the synergistic and/or antagonistic relationships under scenario of global change. These results may suggest that warming is beneficial to soil C storage while increased precipitation negatively affects soil C sequestration. These findings provide a new perspective for understanding the response of microbial communities to warming and increased precipitation in the temperate desert steppe.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"5fcffecdf66ae765dae0e5c63eb1f3f18e50d50ab54041b2b5805dee6c8477b3","category":"Environment"}