{"title":"PSIV-23 Transcriptomic analysis revealed the mechanisms of resilience and susceptibility to nonalcoholic steatohepatitis in dairy goats under high-concentrate diet","link":"https://academic.oup.com/jas/article/102/Supplement_3/467/7757706?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Liver health is vital for growth and health of ruminants, which can directly affect their performance. High-concentrate diet (HCD) feeding, a common practice to meet the energy requirements for animal production and growth, has been known to induce liver damage, including nonalcoholic fatty liver (NAFL) and nonalcoholic steatohepatitis (NASH) in ruminants. To date, the regulatory mechanisms of liver metabolic dysfunctions in ruminants induced by HCD are not well defined. To elucidate molecular regulatory mechanisms underlying liver dysfunction in ruminants, we compared liver transcriptome and single-cell transcriptome of dairy goats that had varied responses to the HCD, aiming to underpin the key mechanisms behind resilience and susceptibility to NASH in ruminants. After feeding 30 dairy goats with low-concentrate diet (LCD, n = 15, defined as Con) or high-concentrate diet (HCD, n = 15) for 6 wk, 10 of them developed NASH (defined as NASH), while the other 5 did not showed any NASH symptom (defined as NASH-tolerance, NASH-T) under HCD. Liver tissues were collected to extract RNA. The paired-end RNA-seq library was sequenced with a NovaSeq6000 sequencer (Illumina). Real-time quantitative PCR was conducted to verify the significantly different genes among groups. Liver single-cell transcriptome was performed using 10×Genomics Chromium system. Liver transcriptome analysis revealed that the expression level of genes involved in the interleukin (IL)-17 signaling pathway, including IL-17A (<span>P</span> = 0.035; 0.001), Act1 (<span>P</span> = 0.036; 0.002), FOSB (<span>P</span> = 0.041; 0.048) and IL-1β (<span>P</span> = 0.022; 0.002) in the NASH group were significantly greater than those in the Con and NASH-T groups. Hepatic single-cell RNA sequencing identified seven cell types in the liver, including hepatocytes, macrophages, T cells, endothelial cell, natural killer (NK) cell, hepatic stellate cells (HSCs), B cells. In T cell subset, significantly decreased T helper 17 (TH17) cells and increased regulatory T (Treg) cells were detected in the NASH group compared with Con and NASH-T groups. In TH17 cell, the expression levels of IL-17A (<span>P</span> = 0.004; 0.009) and IL-23R (<span>P</span> = 0.007; 0.01; the surface antibodies of TH17 cells) in NASH group were significantly greater than those in the Con and NASH-T groups. The expression levels of Foxp3 (<span>P</span> &lt; 0.001; 0.013), IL-2R (<span>P</span> &lt; 0.001; 0.001), CTLA-4 (<span>P</span> = 0.005; 0.017) and CD127 (<span>P</span> = 0.004; 0.009; the surface antibodies of Treg cells) in NASH group were significantly less than those in the Con and NASH-T groups. Our results revealed the role of liver immune cells in maintaining tolerance to NASH in dairy goats under HCD, which provides new understanding in pathogenesis of NASH under HCD. Further studies are needed to identify major factors that drive the changes of ratio of TH17/Treg cell.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"5fcfca2b4f8e0a674a3e93face9a20be6c312a4e783705e59f1367e9b986c5fd","category":"Environment"}