{"title":"Mesoscale Eddies and their Impact on Primary Productivity in the Bay of Bengal","link":"https://www.preprints.org/manuscript/202406.1583/v1","date":1719222861000,"content":"Mesoscale eddies wield a significant influence on primary productivity in marine ecosystems by regulating nutrient availability, vertical mixing, and phytoplankton growth dynamics. In this study, we tracked and analyzed the effects of mesoscale eddies on net primary productivity (NPP) across the Bay of Bengal (BoB) using remote sensing data. Dividing the Bay into six zones based on mesoscale eddy frequency and distribution, our analysis identified 1880 anticyclonic eddies and 1972 cyclonic eddies during January 2010–March 2020 monitoring period. Cyclonic eddies predominantly occurred in the western part of the bay - along the east coast of the Indian Peninsula; while anticyclonic eddies were also observed, albeit in lesser proportions. Among eddies lasting one-week, anticyclonic eddies comprised approximately 48.81%, while cyclonic eddies constituted approximately 51.19% of the total. Analysis of the NPP distribution across the months revealed intriguing patterns. Mean values of NPP fluctuated throughout the year, with the highest value observed in August (748.51 mg C/m2/day) and the lowest in May (519.26 mg C/m2/day). The findings indicate a complex relationship between eddy distribution and NPP, with Zones 1 and 2 exhibiting a higher occurrence of cyclonic eddies, correlating with greater NPP and its variability. Conversely, Zones 3 and 5 display increased eddy activity despite fewer cyclonic eddies and lower NPP levels. Zone 6 shows reduced eddy activity and NPP, while Zone 4 presents moderate eddy activity alongside lower NPP. In contrast, Zones 3 to 5 exhibit lower NPP levels despite exhibiting heightened eddy activity. This study contributes valuable insights into the dynamics of ocean circulation and the impacts of eddies on NPP, which can inform fisheries management strategies, advances climate resilience measures, expands scientific knowledge, and guides policies related to conservation and sustainable resource utilization.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5fcfe1ef97555048d56c40bfdd71fc6325d0ae3b9843d5a7ecafb31b5c293ace","category":"Interdisciplinary"}