{"title":"Long-term effect of air pollution on COPD exacerbations: AIREPOC cohort in Bogota, Colombia","link":"https://www.preprints.org/manuscript/202410.0075/v1","date":1727786983000,"content":"(1)Background: Evidence on the association between air pollution and the risk of exacerbations of chronic obstructive pulmonary disease (COPD) is scarce and inconsistent. We aimed to analyze the association between long-term exposure to particulate matter with a diameter of less than 2.5 µm (PM2.5) and nitrogen dioxide (NO2) and exacerbation of COPD (COPD-E) in Bogotá, Colombia; (2) Methods: Retrospective cohort study of 722 COPD patients in the AIREPOC program of the Colombian Pneumological Foundation between 2018 and 2021. Exposure to PM2.5 and NO2 was estimated for residential locations using the inverse squared distance weighted regression (IDWR) method. Hazard Ratios (HR) were calculated for the first COPD-E during follow-up using Cox models, adjusted for meteorological, demographic, and clinical variables; (3) Results: COPD-E was associated with long-term exposure to PM2.5 (HR:1.03, 95%CI: 1.02-1.05) and NO2 (HR:1.05, 95%CI: 1.03-1.07) controlling for the effect of quality of life, history of COPD-E, Forced Expiratory Volume in One Second (FEV1) pre-bronchodilator and exposure to solar radiation. An association was found between COPD-E and concentrations ≥ 25µg/m3 of NO2 (HR:1.49, 95%CI: 1.12-1.98) but not with concentrations ≥15 µg/m3 of PM2.5; (4) Conclusions: This study suggests that people with COPD exposed to higher concentrations of PM2.5 and NO2 had an increased risk of COPD-E. Solar radiation was also associated with an increased risk of COPD-E. The results highlight the importance of continuing efforts to reduce air pollution.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"5fcf89a53711531d91cc468b5b12b3385aac036bca4fde0b055e0612ff302f20","category":"Interdisciplinary"}