{"title":"What’s new in the first Android 12 Developer Preview","link":"https://arstechnica.com/?p=1743550","date":1613777445000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/6-2-800x450.jpg\" alt=\"This green circle (we added the background) is the Android 12 logo, we guess. \"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/6-2.jpg\" class=\"enlarge-link\" data-height=\"871\" data-width=\"1548\">Enlarge</a> <span class=\"sep\">/</span> This green circle (we added the background) is the Android 12 logo, we guess.  </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The first Android 12 developer preview hit the streets Thursday, and we've played with it for a day. There's not a lot to see in this release—at least not at first. Most of the interesting bits are hidden, and the developer community is slowly enabling them. Many changes are half-finished alpha tweaks that will look different in the final release; after all, Google says these releases are for \"testing and feedback.\"</p>\n<p>This first release of Android 12 is meant to get some APIs and other changes in front of people for feedback, but it's also designed to not spill the beans too much on what the final build of Android 12 will look like. With that in mind, many of the features in an earlier <a href=\"https://arstechnica.com/gadgets/2021/02/android-12-leak-appears-to-show-major-redesign-with-color-changing-ui/\">Android 12 leak</a> seem right on the money. This public release is a sanitized build with a lot of stuff turned off, but the more we flip on hidden flags and catch hints in the documentation, the more this build looks like a solid halfway point between Android 11 and those leaked Android 12 screenshots.</p>\n<h2>The notification panel</h2>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/7-2-980x1085.jpg\" alt=\"\"></div>\n        <p>\n          The top back bar is gone, all the colors are a little different (and bluer), and the background is less transparent.                       [credit:\n                        Ron Amadeo                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Google can never let an Android release go by without some notification changes, and this year it looks like we're getting a fresh design and a few other tweaks. Like everything else in the preview, we're only getting a half-finished look at things here.</p></div><p><a href=\"https://arstechnica.com/?p=1743550#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1743550&comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5fe400c5f6e8f3dc22197aa95d4ea3cfeea412895e77c7eeda51c7dbd674e183","category":"Tech"}