{"title":"Landscape patterns drive provision of nature's contributions to people by mobile species","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14764?af=R","date":1724759054000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/2f710835-21e5-4768-b4d8-bf9d8744adf0/jpe14764-toc-0001-m.png\" alt=\"Landscape patterns drive provision of nature's contributions to people by mobile species\" />\n<p>Our novel approach for spatial prediction can be applied to any of nature's contributions to people (NCP), and extended to identify trade-offs and synergies among multiple NCP. For example, the negative NCP of possum density trades off with multiple known positive NCP from indigenous forests, including culturally significant non-material NCP, and material NCP produced by exotic forests. We recommend that landscape management plans to maximise these positive NCP in future scenarios also consider how the risk of possum density may dampen net NCP provision. To minimise this negative NCP, our results support trap deployment in both indigenous and exotic forest.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPredicting how nature's contributions to people (NCP) vary spatially remains a challenge. For NCP provided by mobile species, it is unclear how predictions need to account for the influence of multiple habitat types that act as sources, sinks and potential distractors of the NCP-providing species. Existing approaches that do not account for these effects may inaccurately predict outcomes in real landscapes.\n\nTo move beyond these limitations, we transfer quantitative inference approaches from movement ecology to explore how spatial habitat patterns determine the negative NCP of the invasive common brushtail possum <i>Trichosurus vulpecula</i> in New Zealand. We used a Bayesian model to investigate how the size of, and distance from, grassland and indigenous and exotic forest patches together contribute to relative possum density (measured by capture probability across a trapping network) in a heterogeneous 11,000-ha landscape.\n\nWe found that indigenous and exotic forest area were the most important factors in determining possum density. Although capture probability declined with increasing grassland area, the addition of grassland did not improve the relative model fit above one with indigenous forest as the only habitat.\n\nWe expected differences in predicted possum density at habitat boundaries, for example, due to preferential foraging at edges. We found that indigenous and exotic forests contributed to capture probability interactively, such that capture probability at the between-habitat edge was lower than expected, given the habitat area. We also found that models allowing for non-linear habitat effects of exotic forests or grasslands, but not indigenous forests, were significantly better at predicting possum density than simpler models.\n\n<i>Synthesis and applications</i>. Our novel approach for spatial prediction can be applied to any of nature's contributions to people (NCP), and extended to identify trade-offs and synergies among multiple NCP. For example, the negative NCP of possum density trades off with multiple known positive NCP from indigenous forests, including culturally significant non-material NCP, and material NCP produced by exotic forests. We recommend that landscape management plans to maximise these positive NCP in future scenarios also consider how the risk of possum density may dampen net NCP provision. To minimise this negative NCP, our results support trap deployment in both indigenous and exotic forest.\n</p>","author":"Sophie A. O'Brien, \nDean P. Anderson, \nSandra Lavorel, \nHao Ran Lai, \nNatalie de Burgh, \nJason M. Tylianakis","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"5ff384fe584c21e7ef40888f1ed1cc0ea89dae42f984300dadd1205b31ba18ce","category":"Environment"}