{"title":"เรารักกัน เราชนะ ตัวอย่างความสำเร็จของ Red Hat กับ Microsoft Azure ขายของด้วยกัน","link":"https://www.blognone.com/node/123086","date":1623208188000,"content":"<div><div><div><p>ไมโครซอฟท์ในอดีตเป็นศัตรูกับโลกโอเพนซอร์สมายาวนาน แต่ท่าทีของไมโครซอฟท์ช่วงหลังก็เปลี่ยนไปมาก ในปี 2019 เราเห็นข้อตกลงช็อกโลกอย่าง <a href=\"https://www.blognone.com/node/109663\">ไมโครซอฟท์ช่วย Red Hat ขาย OpenShift บน Azure</a> รวมถึงการออก SQL Server บนลินุกซ์ เป็นต้น</p>\n<p>สัปดาห์ที่ผ่านมา Red Hat ออกมาเล่าตัวอย่างความสำเร็จของความร่วมมือนี้ โดยลูกค้าคือบริษัทลอจิสติกส์ Andreani Logistics Group จากอเมริกาใต้ ที่เจอปัญหาดีมานด์พุ่งสูงขึ้นมาจาก COVID-19 จึงหาวิธีสเกลระบบไอทีของตัวเอง และลงเอยด้วยการเลือกใช้ Red Hat OpenShift รันบน Microsoft Azure</p>\n<p>Andreani เป็นลูกค้าของทั้ง OpenShift และ Azure อยู่ก่อนแล้ว แต่แยกโครงการกัน เมื่อทั้งสองบริษัทจับมือกันออกโซลุชัน ทำให้ Andreani ตัดสินใจย้ายระบบจาก OpenShift แบบ on-premise มารันบน Azure Red Hat OpenShift ได้ไม่ยากนัก ผลของการย้ายคือรองรับโหลดที่เพิ่มขึ้นได้ดีขึ้น และการเพิ่มคลัสเตอร์ใหม่ใช้เวลาน้อยลงมาก จาก 3-4 สัปดาห์แบบ on-premise มาเหลือเพียง 1 ชั่วโมงบนคลาวด์</p>\n<p>ความร่วมมือของ Red Hat กับ Azure ยังสะท้อนให้เห็น<a href=\"https://www.blognone.com/node/116131\">ยุทธศาสตร์ของ Red Hat ที่ปัจจุบันเป็นบริษัทลูกของ IBM แต่ก็สามารถเลือกจับมือกับพาร์ทเนอร์ที่เป็นคู่แข่งของ IBM ได้ด้วย</a>  ในขณะที่ <a href=\"https://www.blognone.com/node/119170\">IBM ยุคใหม่จะใช้เทคโนโลยีของ Red Hat เป็นแกนกลาง</a> แล้วเพิ่มซอฟต์แวร์หรือบริการของตัวเองเข้ามา</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/5c8e71f40e5254a2cd228fc1fadafd59.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.redhat.com/en/blog/how-red-hat-and-microsoft-helped-andreani-logistics-group-address-rapid-increase-demand\">Red Hat</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/red-hat\">Red Hat</a></div><div><a href=\"/topics/openshift\">OpenShift</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/microsoft-azure\">Microsoft Azure</a></div><div><a href=\"/topics/enterprise\">Enterprise</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"5ff54afaa4a0e09ba5dfcc4ec217981ed8ebde734bd291866092477b0637b47c","category":"Thai"}