{"title":"Carry‐over effects of seasonal migration on reproductive success through breeding site retention in a partially migratory bird","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14092?af=R","date":1715839704000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6e1e4445-60ac-4192-b15f-67515729d88f/jane14092-toc-0001-m.png\" alt=\"Carry-over effects of seasonal migration on reproductive success through breeding site retention in a partially migratory bird\" />\n<p>We show that migration and dispersal, two key ecological processes and important movement decisions, can be interlinked: migration can have carry-over effects on reproductive success through nest site retention and hence reproductive dispersal propensity.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nUnderstanding the maintenance and dynamics of phenotypic polymorphisms requires unpicking key ecological mechanisms shaping the fitness costs and benefits of expressing alternative phenotypes, generating selection. Seasonal migration versus year-round residence expressed in partially migratory populations represents one common polymorphism that can experience strong selection through differential reproductive success. Yet, key hypothesised pathways that could generate such selection remain to be empirically tested.\n\nOne hypothesis is that migratory tactics affect subsequent reproductive success through carry-over effects on breeding site retention and resulting breeding dispersal. By remaining in breeding areas all year round, residents could retain their preferred breeding site between years, and consequently have higher reproductive success. Conversely, migrants that escape harsh non-breeding season conditions could return in better condition, with high resource holding potential, and outcompete residents to retain their site. Such effects could further depend on migration timing and vary between years. Yet, such pathways have not been quantified, precluding empirical parameterisation of partial migration theory.\n\nWe used 4 years of breeding and non-breeding season data from partially migratory European shags (<i>Gulosus aristotelis</i>) to test whether the three most frequent migratory tactics in this population (full resident, early migrant departing soon after breeding, and late migrant departing in late autumn) differed in their breeding site retention; whether site retention predicted reproductive success; and hence whether effects of migratory tactic on reproductive success were explicable through site retention.\n\nOverall, residents were much more likely to retain their breeding site between years than both early and late migrants, and site retention was associated with increased reproductive success. Yet, these effects varied somewhat among years: late migrants were always least likely to retain their site but had variable relative reproductive success. Path analyses revealed that effects of migratory tactic on reproductive success were only partly attributable to breeding site retention.\n\nThese results indicate that multiple mechanisms underlie reproductive selection on migratory tactics, potentially contributing to maintaining behavioural polymorphisms. Yet, the clear associations between migratory tactics and local breeding dispersal reveal that these movements can be strongly interlinked across seasons, shaping overall spatioseasonal dynamics in partially migratory systems.\n</p>","author":"Jennifer Morinay, \nFrancis Daunt, \nTim I. Morley, \nSarah R. Fenn, \nSarah J. Burthe, \nJane M. Reid","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"6002ee765eb5a996425e569dad898943d6c3313fd512e6b7c33ec6fd1c2049fd","category":"Environment"}