{"title":"35 Role and mechanism of supplemental methionine in metabolic stress of broilers raised at high ambient temperature or stock density","link":"https://academic.oup.com/jas/article/102/Supplement_2/17/7664819?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Current poultry production practices may render fast-growing broilers prone to metabolic stresses induced by high ambient temperatures and(or) high stocking densities. As the first limiting amino acid of broilers fed corn-soy diets, methionine also serves as a free radical scavenger. Our laboratory has explored metabolic effects and biochemical mechanisms of supplemental methionine in grower and finisher diets for broilers raised at high temperature or high stock density. In Experiment 1, a total of 360 male, 1 d-old Cornish cockerel chicks were fed four diets (10 pens/treatment, 9 chicks/pen): 100 or 130% required methionine in the diets as DL-methionine (DL-MET) or 2-hydroxy-4-(methylthio)butanoate (HMTBA). The room was maintained at 4 to 13<sup>o</sup>C above the suggested thermoneutral temperature. The 130% DL-MET and HMTBA diets enhanced (<span>P</span> &lt; 0.05) hepatic GSH concentrations of growers and plasma ferric reducing ability of finishers than the 100% diets. The DL-MET-fed growers had greater (<span>P</span> &lt; 0.05%) muscle GSH and hepatic unsaturated fatty acid concentrations than those fed HMTBA. The methionine form and concentration exerted an interaction effect (<span>P</span> &lt; 0.05) on the expression of inflammation-related genes in the liver of finishers. In Experiment 2, we determined if 30% extra DL-MET alleviated adverse effects of a greater stocking density on broilers. A total of 560 male, 1 d-old Cornish cockerels were housed at two stocking densities (9 and 12 birds/m<sup>2</sup>) and fed two concentrations of DL-MET (grower: 2.90 or 3.77 g/kg and finisher: 2.60 or 3.38 g/kg). The high stocking density decreased (<span>P</span> &lt; 0.05) body weight and growth performance of growers and(or) finishers. Those differences were largely removed or attenuated by the 130% DL-MET diet. There were interaction effects (<span>P</span> &lt; 0.05) between dietary DL-MET concentrations and stocking densities on activities of glutathione S-transferase in the liver of growers and the breast, thigh, and adipose tissue of finishers as well as on activities of glutathione peroxidase and superoxide dismutase in the thigh of growers. The 130% DL-MET diet decreased (<span>P</span> &lt; 0.05) hepatic gene expression of heat shock protein 90 (18%) and malondialdehyde concentrations in the thigh and breast of finishers (35%). In summary, the high ambient temperature-induced metabolic responses of broilers were mediated by the extra methionine supplementation. That function varied with the chicken age and(or) tissue and the methionine form. Meanwhile, the 30% extra DL-MET addition partially reversed adverse effects caused by the greater stocking density, partially via improving tissue redox status. (This research was supported in part by Evonik Nutrition &amp; Care GmbH, and was published: J. Anim. Sci. 97:4883-4894; J. Anim. Sci. 98:skaa092. doi: 10.1093/jas/skaa092).</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6004e7e99715ca605de6f3ded89b85a4ff63a39aa04db9d4f41b0e39dc546200","category":"Environment"}