{"title":"Sonos เปิดตัวซาวด์บาร์ Sonos Beam Gen 2 รองรับ Dolby Atmos และ eARC","link":"https://www.blognone.com/node/124771","date":1631712684000,"content":"<div><div><div><p>Sonos ผู้ผลิตเครื่องเสียงจากสหรัฐอเมริกาเปิดตัวซาวด์บาร์ Sonos Beam Gen 2 ภาคต่อจาก Sonos Beam รุ่นแรกที่ออกมาในปี 2018 โดยคราวนี้มาพร้อมกับการรองรับระบบเสียง Dolby Atmos และการเชื่อมต่อ HDMI แบบ eARC</p>\n<p>หน้าตาของ Sonos Beam Gen 2 แทบจะเหมือนรุ่นแรกเกือบทุกจุด ต่างกันเพียงตะแกรงลำโพงด้านหน้าที่เปลี่ยนจากหุ้มด้วยผ้าเป็นพลาสติกเจาะรู ส่วนขนาดและน้ำหนักยังเท่าเดิมเป๊ะ รวมถึงปุ่มระบบสัมผัสด้านบนก็ยังมีเหมือนเดิม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1019c8371fe52d1e6492750ac22fb8f5.jpg\" /></p>\n<p>ด้านฟีเจอร์ของ Sonos Beam Gen 2 ถูกปรับปรุงในส่วนหลักๆ หลายจุด อย่างแรกคือรองรับ Dolby Atmos เหมือน Sonos Arc รุ่นพี่ รวมถึงการเชื่อมต่อก็ได้อัพเกรดจาก HDMI ARC เป็น eARC แล้ว ทำให้แบนด์วิดท์สูงขึ้นกว่าเดิม แปลว่าเสียง Dolby Atmos จะวิ่งด้วยฟอร์แมท Dolby TrueHD แทนที่จะเป็น Dolby Digital Plus ที่รองรับใน ARC ธรรมดา อย่างไรก็ตาม บริการสตรีมมิงทุกเจ้าในปัจจุบันยังเป็น Dolby Digital Plus อยู่ดี หากจะใช้งานเต็มประสิทธิภาพต้องขยับไปเล่นผ่านบลูเรย์แทน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2caefdc3351182f1b6abdd5f55679d24.jpg\" /></p>\n<p>ซีพียูใน Sonos Beam Gen 2 ยังเร็วขึ้นกว่าเดิม 40% ส่วนดอกลำโพงก็เพิ่มจาก 3 ดอกเป็น 5 ดอก โดย 4 ดอกเป็นวูฟเฟอร์ และ 1 ดอกเป็นทวีตเตอร์อยู่ตรงกลาง ทั้งนี้ลำโพงทั้ง 5 ดอกเป็นแบบยิงออกตรงๆ ไม่มียิงขึ้นเพดานเหมือน Sonos Arc</p>\n<p>นอกจากนี้ฟีเจอร์ที่ควรจะมีก็ยังคงอยู่ครบเหมือนเดิม เช่น Apple AirPlay 2, Google Assistant, Amazon Alexa และพอร์ตแลน</p>\n<p>ราคาของ Sonos Beam Gen 2 ตั้งไว้ที่ 449 ดอลลาร์สหรัฐ หรือราว 15,000 บาท (ไม่รวมภาษีของแต่ละรัฐ) แพงกว่ารุ่นเดิมอยู่ 50 ดอลลาร์สหรัฐ มีให้เลือกสองสีเช่นเดิมคือขาวและดำ เริ่มเปิดให้สั่งจองแล้ววันนี้ และจะวางตลาดวันที่ 5 ตุลาคมนี้</p>\n<p>ที่มา - <a href=\"https://www.whathifi.com/advice/sonos-beam-gen-2-vs-sonos-beam-how-does-the-new-dolby-atmos-sonos-soundbar-compare\">What Hi-Fi?</a><br />\n<em>ภาพทั้งหมดโดย Sonos</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6d7634ab35da42550e84e40ae968abbf.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sonos\">Sonos</a></div><div><a href=\"/topics/dolby-atmos\">Dolby Atmos</a></div><div><a href=\"/topics/smart-speaker\">Smart Speaker</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"600a682bb47e01846fe08d3436ac044a227e10d3b06fbed9acf3ad1e5865b171","category":"Thai"}