{"title":"Detecting Co-Seismic Landslides in GEE using Machine-Learning Algorithms on combined Multispectral and RADAR Imagery","link":"https://www.preprints.org/manuscript/202404.0724/v1","date":1712801530000,"content":"Landslides, resulting from disturbances in slope equilibrium, pose a significant threat to landscapes, infrastructure, and human life. Triggered by factors such as intense precipitation, seismic activities, or volcanic eruptions, these events can cause extensive damage and endanger nearby communities. A comprehensive understanding of landslide characteristics, including spatio-temporal patterns, dimensions, and morphology, is vital for effective landslide-disaster management. Existing Remote Sensing approaches mostly use either optical or Synthetic Aperture Radar (SAR) sensors. Integrating information from both these types of sensors promises greater accuracy for identifying and locating landslides. \nThis study proposes a novel approach, the ML-LaDeCORsat (Machine Learning-based coseismic Landslide Detection using Combined Optical and Radar Satellite Imagery), that integrates freely available Sentinel-1, Palsar-2, and Sentinel-2 imagery data, along with relevant spectral indices and suitable bands using machine-learning-based classification for coseismic landslide detection implemented in Google Earth Engine (GEE). The approach includes a robust and reproducible training and validation strategy. Using landslides from four different earthquake case studies, we demonstrate the superiority of our approach over existing solutions in coseismic landslide iden-tification and localization, providing a detection accuracy of 87-92%. ML-LaDeCORsat can be adapted to other landslide events (GEE script is provided). Transfer learning experiments proofed that our model can be applied to other coseismic landslide events without the need for additional training data. Our novel approach therefore facilitates quick and reliable identification of co-seismic landslides, highlighting its potential to contribute towards more effective disaster management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"601880c9a2275915750e7210c2ac0634fea2c66f43b1e1cb712da9a7f3cff323","category":"Interdisciplinary"}