{"title":"Transformation of DIY Geiger Counter Kits into a Muon Detector for Educational and Scientific Exploration","link":"https://www.preprints.org/manuscript/202405.1721/v1","date":1716796567000,"content":"Any Geiger counter can be used as an effective cosmic ray detector on its own. In fact, it is known that even in the absence of a radioactive source, the instrument detects what is known as background radiation, which consists of various types of ionizing particles present in the environment. Remarkably, it is estimated that up to 15% of this background radiation is attributable to cosmic rays, high-energy particles originating from outer space. The remaining radiation detected by the Geiger counter originates from terrestrial sources, such as natural radioactivity in the ground and in the air. The main goal of this project is to build a muon detector for scientific and educational purposes using two commercial DIY Geiger counter kits and just a few additional components. To identify cosmic radiation from terrestrial radiation and improve the accuracy of cosmic ray measurements, the use of a coincident circuit is essential. This coincident circuit was introduced in cosmic ray physics by Walther Bothe and Bruno Rossi in the early 1930s and allows for the detection of a subatomic particle passing through two or more sensors, thereby reducing false positives and enhancing the reliability of cosmic ray detection.The following idea is an alternative to our AMD5 detectors, instruments that we have been using for years to teach and perform scientific experiments in the cosmic ray field under the umbrella of the ADA project (2023 Particles, Arcani et al.). The resulting device offers a reliable and cheap solution for the same goal, making it a valuable tool for both educational purposes and even scientific surveys.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"601939accca1d49910ffe6d1db9cadcbeb2679c993a6767f002d61eebd3c0a10","category":"Interdisciplinary"}