{"title":"OMI/NOMI: Time for a New Classification of Acute Myocardial Infarction","link":"https://www.preprints.org/manuscript/202407.1220/v2","date":1724425922000,"content":"Forty percent of patients with acute coronary occlusion myocardial infarction (OMI) do not present with STEMI criteria, which delays their treatment and increases morbidity and mor-tality. The need to identify these patients promptly is crucial, and this sets the stage for the pro-posed reclassification. Many of these patients can be identified by other ECG and clinical fea-tures. Background/Objectives: We sought to evaluate STEMI/NSTEMI cases that result in OMI and the consequences of delayed revascularization immediately among NSTEMI patients who have ACO (NSTEMI-OMI). Methods: The study is a retrospective analysis conducted on 334 pa-tients who underwent coronary angiography for acute coronary syndrome at UHC ‘‘Mother Te-resa,’’ Tirana, Albania, during January-May 2023. OMI was defined as an acute culprit lesion with TIMI 0-2 flow, or TIMI 3 flow with highly elevated troponin (cTnI&gt;10.0 ng/mL, hs-cTnI&gt;5000 ng/L). Ejection fraction (EF), total ischemia time, hospital day stay and complications were com-pared between groups. Results: There were 334 patients included of whom NSTEMI-OMI were 98 patients (29.3%) of patients with ACS. 96 patients (40%) of OMI patients did not fulfill the STEMI criteria. Only 11 patients (11%) of STEMI(-)OMI had PCI performed within the first 12 hours vs 76 patients (77%) of STEMI(+)OMI, p&lt;0.001. There was no difference in the percent of patients requiring PCI between the STEMI(+)OMI 98 patients (93%) and STEMI(-)OMI 87 patients (89%) (p&lt;0.001). The overall in-hospital mortality was 19 patients (5.7 %), with subgroup mortality of 14 patients (4.2%) STEMI(+)OMI, two patients (0.6%) STEMI(+) NOMI, three patients (0.9%) STEMI(-)OMI, 0% STEMI(-)NOMI, (p=0.013). Patients with mechanical complications were: 67 patients (46.8%) STEMI(+)OMI and 45 patients (46.4%) STEMI(-)OMI. 26 patients (18.5%) STEMI(+)OMI and 13 patients (13.1%) STEMI(-)OMI developed electrical complications. Conclusions STEMI(-)OMI patients had significant delays in catheterization, yet had angiographic findings, rate of PCI, and complications similar to STEMI(+)OMI. These data add further support to refocusing the paradigm of acute MI to improve recognition and rapid reperfusion of all OMIs, rather than only those with STEMI criteria.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"602a4e263faaec31249224abf3183ba25a36900e74f1d4af234b5395ab02d4af","category":"Interdisciplinary"}