{"title":"Microplastic pollution promotes soil respiration: A global‐scale meta‐analysis","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17415?af=R","date":1721034302000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/dc7bd198-2723-4045-809a-33cac7ab45b3/gcb17415-toc-0001-m.png\" alt=\"Microplastic pollution promotes soil respiration: A global-scale meta-analysis\" />\n<p>Microplastic (MP) pollution is a significant global environmental challenge with the potential to impact soil carbon dynamics, necessitating a systematic assessment of its effects on soil respiration. We provide evidence that MPs increased the soil C pool (in part very likely because plastic-carbon was captured as soil C) and microbial biomass thereby promoting soil CO<sub>2</sub> emission. This study enhances our understanding of how MPs influence soil CO<sub>2</sub> emissions by regulating the soil microbiome and underscores potential feedback mechanisms related to climate impacts at the Earth system level, thereby providing guidance for future research and policy development.</p>\n<br />\n<h2>Abstract</h2>\n<p>Microplastic (MP) pollution likely affects global soil carbon (C) dynamics, yet it remains uncertain how and to what extent MP influences soil respiration. Here, we report on a global meta-analysis to determine the effects of MP pollution on the soil microbiome and CO<sub>2</sub> emission. We found that MP pollution significantly increased the contents of soil organic C (SOC) (21%) and dissolved organic C (DOC) (12%), the activity of fluorescein diacetate hydrolase (FDAse) (10%), and microbial biomass (17%), but led to a decrease in microbial diversity (3%). In particular, increases in soil C components and microbial biomass further promote CO<sub>2</sub> emission (25%) from soil, but with a much higher effect of MPs on these emissions than on soil C components and microbial biomass. The effect could be attributed to the opposite effects of MPs on microbial biomass vs. diversity, as soil MP accumulation recruited some functionally important bacteria and provided additional C substrates for specific heterotrophic microorganisms, while inhibiting the growth of autotrophic taxa (e.g., <i>Chloroflexi</i>, <i>Cyanobacteria</i>). This study reveals that MP pollution can increase soil CO<sub>2</sub> emission by causing shifts in the soil microbiome. These results underscore the potential importance of plastic pollution for terrestrial C fluxes, and thus climate feedbacks.</p>","author":"Shuling Zhao, \nMatthias C. Rillig, \nHaijian Bing, \nQingliang Cui, \nTianyi Qiu, \nYongxing Cui, \nJosep Penuelas, \nBaiyan Liu, \nShiqi Bian, \nFazel Abdolahpur Monikh, \nJing Chen, \nLinchuan Fang","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"60352abe8f9120e22fd7d3f45f2062339072de0ff8e729874ecf71db4b177878","category":"Environment"}