{"title":"The curious case of the brie made from nuts that caused a multi-state outbreak","link":"https://arstechnica.com/?p=1942447","date":1685059303000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-473486116-800x533.jpeg\" alt=\"Some real brie cheese in Paris. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-473486116-scaled.jpeg\">Enlarge</a> <span>/</span> Some real brie cheese in Paris.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/picture-shows-a-brie-de-meaux-cheese-displayed-in-a-light-news-photo/473486116?adppopup=true\">Getty | FRANCOIS GUILLOT/AFP</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Niche plant-based foods are often touted for their health benefits—but one benefit that may be less obvious is that they can help keep outbreaks from mushrooming.</p>\n<p>Such was the case with a small <em>Salmonella</em> outbreak from late 2020 to early 2021, outlined Thursday in <a href=\"https://www.cdc.gov/mmwr/volumes/72/wr/mm7221a4.htm?s_cid=mm7221a4_w\">a study published by the Centers for Disease Control and Prevention's Morbidity and Mortality Weekly Report</a>. The outbreak involved an unusual plant-based food that carried unusual bacteria. And starting with just two cases, health officials could identify the source and spur a product recall before standard outbreak measures were triggered—squashing an outbreak that could have festered across the country.</p>\n<p>The food at the outbreak's center was cashew brie—a vegan brie alternative—and the first two cases identified were in Tennessee. The two people reported eating the same brand of cashew brie at the same restaurant before falling ill. And clinical isolates found they had the same rare serotype of <em>Salmonella</em>—<em>S. </em>Duisburg. Health officials conducted whole genome sequencing of the offending bacteria and entered them into a <a href=\"https://www.ncbi.nlm.nih.gov/pathogens/isolates\">national repository of pathogen isolates</a> collected for disease surveillance. There were three genetically related matches: two isolates from California and one from Florida.</p></div><p><a href=\"https://arstechnica.com/?p=1942447#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1942447&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"60459df49585352fad9004bf3251b1c2d7f248fae71108296b05ae5a23c3cf31","category":"Tech"}