{"title":"Ericsson ซื้อกิจการ Vonage บริษัท VoIP สำหรับองค์กร มูลค่า 6.2 พันล้านดอลลาร์","link":"https://www.blognone.com/node/125974","date":1637672663000,"content":"<div><div><div><p>Ericsson ประกาศซื้อกิจการ Vonage บริษัท VoIP สัญชาติอเมริกันในราคา 6.2 พันล้านดอลลาร์ จ่ายด้วยเงินสดทั้งหมด คาดว่ากระบวนการจะเสร็จสิ้นในครึ่งแรกของปี 2022</p>\n<p>Vonage ก่อตั้งในปี 2001 ถือเป็นบริษัทโทรศัพท์ผ่านอินเทอร์เน็ตยุคแรกๆ โดยให้บริการทั้งระบบโทรศัพท์บ้านและสำนักงาน บริษัทขายหุ้น IPO เข้าตลาดหลักทรัพย์ในปี 2006 (ตัวย่อ VG) และค่อยๆ เติบโตผ่านการซื้อกิจการ และการขยายธุรกิจมายังกลุ่มลูกค้าองค์กร เช่น ระบบคอลล์เซ็นเตอร์ และ unified communication</p>\n<p>Ericsson ระบุว่าต้องการผลิตภัณฑ์สำหรับตลาดองค์กรที่หลากหลาย ซึ่ง Vonage ตอบโจทย์ในฐานะบริการสื่อสารที่ต่อยอดอยู่บนเครือข่าย 4G/5G ซึ่งเป็นธุรกิจหลักของ Ericsson อีกที เป้าหมายของ Ericsson คือต้องการให้ลูกค้า (โอเปอเรเตอร์) ที่ลงทุนกับเครือข่าย 4G/5G ไปแล้ว สามารถพัฒนาบริการใหม่ๆ มาทำเงินให้คุ้มกับค่าลงทุนโครงข่ายที่จ่ายไปแล้วมากขึ้น</p>\n<p>ปัจจุบัน Vonage มียอดขาย 1.4 พันล้านดอลลาร์ในรอบ 12 เดือน (นับถึง 30 กันยายน 2021) มีพนักงาน 2,200 คน มีลูกค้า 120,000 บริษัท และมีนักพัฒนามากกว่า 1 ล้านคนเข้ามาใช้งานผ่าน API ด้านการสื่อสารของ Vonage Communications Platform (VCP) และซีอีโอคนปัจจุบัน Rory Read เคยเป็นซีอีโอของ AMD มาก่อน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/627eaef0a0a9ec324987658aaed3277a.png\" /></p>\n<p>ที่มา - <a href=\"https://www.ericsson.com/en/press-releases/2021/11/ericsson-to-acquire-vonage-for-usd-6.2-billion-to-spearhead-the-creation-of-a-global-network-and-communication-platform-for-open-innovation\">Ericsson</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ericsson\">Ericsson</a></div><div><a href=\"/topics/acquisition\">Acquisition</a></div><div><a href=\"/topics/voip\">VoIP</a></div><div><a href=\"/topics/enterprise\">Enterprise</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"6053fc2e6b7cfbcdeea75781e57ced1d0e6670b51e837861c8191a54c083e261","category":"Thai"}