{"title":"Apple Not Trying Hard Enough to Protect Users Against Surveillance, Researchers Say","link":"https://www.macrumors.com/2021/07/23/apple-not-trying-hard-to-protect-users/","date":1627047992000,"content":"Following the news of widespread commercial hacking spyware on targeted iPhones, a large number of security researchers are now saying that Apple could do more to protect its users (via <em><a href=\"https://www.wired.com/story/nso-group-hacks-ios-android-observability/\">Wired</a></em>).\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/tim-cook-privacy.jpg\" />\r\n<br />\r\nEarlier this week, it was reported that journalists, lawyers, and human rights activists around the world had been targeted by governments using phone <a href=\"https://www.macrumors.com/2021/07/19/pegasus-spyware-imessage-targets-activists/\">malware made by the surveillance firm NSO Group</a> known as \"Pegasus.\"\r\n<br />\r\n\r\n<br />\r\nNow, security researchers are stating that Apple could and should do more to protect its users against advanced surveillance tools like Pegasus. Independent security researcher Cedric Owens told <em>Wired</em>:<blockquote>It definitely shows challenges in general with mobile device security and investigative capabilities these days. I also think seeing both Android and iOS zero-click infections by NSO shows that motivated and resourced attackers can still be successful despite the amount of control Apple applies to its products and ecosystem.</blockquote>The security community has frequently criticized Apple for its limits on the ability to conduct forensic investigations into the security of iOS and the use of monitoring tools. A greater level of access to the operating system itself would, they claim, help to catch attacks and vulnerabilities more easily. For example, combating spyware like Pegasus would need access to read a device's filesystem, the ability to examine which processes are running, access to system logs, and more.\r\n<br />\r\n\r\n<br />\r\nAndroid also places limits on \"observability,\" but the locked-down nature of iOS, in particular, has drawn the ire of security researchers because Apple has heavily leaned into its focus on privacy and strong security protections, especially compared to other platforms. SentinelOne threat researcher Juan Andres Guerrero-Saade commented:<blockquote>The truth is that we are holding Apple to a higher standard precisely because they're doing so much better. Android is a free-for-all. I don't think anyone expects the security of Android to improve to a point where all we have to worry about are targeted attacks with zero-day exploits.</blockquote>\r\n<br />\r\n\r\n<br />\r\nJohns Hopkins University cryptographer Matthew Green similarly said: \"Apple is trying, but the problem is they aren't trying as hard as their reputation would imply.\" iOS security researcher Will Strafach suggested that there are many options open for Apple to allow observation and imaging of iOS devices to catch bad actors in a safe environment.\r\n<br />\r\n\r\n<br />\r\nOn the other hand, there is a level of concern in the security community that more openness and an increased number of system indicators could inadvertently give attackers more leverage. For example, there are already suspicious applications on macOS that antivirus tools cannot fully remove since the system gives them a heightened level of trust, potentially by mistake. It is likely that any new system privileges in iOS would likewise be used by rogue analysis tools.\r\n<br />\r\n\r\n<br />\r\nNevertheless, the discovery of Pegasus and its severity is prompting discourse around device security and calls for Apple to do more to prevent surveillance, as well as discussion around the potential need for a government-supported global ban on private spyware.<div>Tag: <a href=\"https://www.macrumors.com/guide/security/\">security</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/23/apple-not-trying-hard-to-protect-users/\">Apple Not Trying Hard Enough to Protect Users Against Surveillance, Researchers Say</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-not-trying-hard-enough-to-protect-users-against-surveillance-researchers-say.2305216/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=itvHwnYp0bw:ouhIVEFmDko:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=itvHwnYp0bw:ouhIVEFmDko:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/itvHwnYp0bw\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"60545751e0fcb0bb012cc6de7cb835797153e2e783c1ed2a1ed31041e38000f6","category":"Apple"}