{"title":"Design of Digital Twin Cutting Experiment System for Shearer","link":"https://www.preprints.org/manuscript/202404.1672/v1","date":1714123677000,"content":"This study presents an advanced Simulated Shearer Machine Cutting Experiment System enhanced with digital twin technology. Central to this system is a simulated shearer drum, designed based on similarity theory to mirror the operational dynamics of actual mining cutters accurately. The setup incorporates a modified machining center equipped with sophisticated sensors that monitor various parameters such as cutting states, forces, torque, vibration, temperature and sound. These sensors are crucial for precisely simulating the shearer cutting actions. The integration of digital twin technology is pivotal, featuring a real-time data management layer, a dynamic simulation mechanism model layer, and an application service layer that facilitates virtual experiments and algorithm refinement. This multifaceted approach allows for in-depth analysis of simulated coal cutting, utilizing sensor data to comprehensively evaluate the shearer's performance. The study also includes tests on simulated coal samples. The system effectively conducts experiments and captures cutting condition signals via the sensors. Through time-domain analysis of these signals, gathered while cutting materials of varying strengths, it is determined that the cutting force signal characteristics are particularly distinct. By isolating the cutting force signal as a key feature, the system can effectively distinguish between different cutting modes. This capability provides a robust experimental basis for coal-rock identification research, offering significant insights into the nuances of shearer operation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"60571611c52caeecc0df3f2d8a39604faf950a25856bc3832822d7fbf694a439","category":"Interdisciplinary"}