{"title":"A Transformative Technology Linking Patient’s mRNA Expression Profile to Anticancer Drug Efficacy","link":"https://www.preprints.org/manuscript/202406.0085/v1","date":1717636180000,"content":"As precision medicine such as targeted therapy and immunotherapy often have limited accessibility, low response rate and evolved resistance, it is urgent to develop simple, low-cost, and quick-turnaround personalized diagnostic technologies for drug response prediction with high sensitivity, speed, and accuracy. Major challenges of drug response prediction strategies employing digital database modeling are the scarcity of labeled clinical data, applicable only to a few classes of drugs, and losing the resolution at the individual patient level. Although these challenges have been partially addressed by large-scale cancer cell line datasets and more patient-relevant cell-based systems, the integration of different data types and data translation from pre-clinical to clinical utilities are still far-fetched. To overcome current limitations of precision medicine with a clinically proven drug response prediction assay, we have developed an innovative and proprietary technology based on in vitro patient testing and in silico data analytics. First, a patient-derived gene expression signature was established via transcriptomic profiling of cell-free mRNA (cfmRNA) from the patient’s blood. Second, a gene-to-drug data fusion and overlaying mechanism to transfer data was performed. Finally, a semi-supervised method was used for database searching, matching, annotation and ranking of drug efficacies from a pool of ~700 approved, investigational or clinical trial drug candidates. A personalized drug response report can be delivered to inform clinical decision within a week. The PGA (Patient-derived Gene expression-informed Anticancer drug efficacy) test has significantly improved patient outcomes when compared to the treatment plans without PGA support. Implementation of PGA, which combines patient-unique cfmRNA fingerprints with drug mapping power, has the potential to identify treatment options when patients are no longer responding to therapy and when standard-of-care is exhausted.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6058beaa2609f8cd53413fdb1db8cc786259286ac032cd6d53192457e288ea96","category":"Interdisciplinary"}