{"title":"Inequalities in the demand and unmet need for contraception among women in four regions of Ethiopia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308476","date":1725976800000,"content":"<p>by Tigist Shumet Wasiyhun, Nigatu Regassa Geda</p>\r\nBackground <p>Unmet need for family planning is a major cause of unwanted pregnancies, which may contribute to the death of mothers and children. The aim of this study is to examine inequalities in the demand and unmet need for contraception among women in four regions (i.e., Afar, Benishangul-Gumzu, Gambela and Somali regions) of Ethiopia.</p> Methods <p>The study utilized data from the 2016 Ethiopian Demographic Health Survey (EDHS), collected from 3,343 women of reproductive age 15–49 years situated in these study regions. Multilevel binary and multivariable logistic regression analysis, concentration index, and multivariate decomposition analysis were employed.</p> Results <p>The study revealed that women’s employment status, education level, household wealth index, total number of children ever born, and husband’s working status had a statistically significant association with the demand for contraception. Furthermore, women’s educational level, household size, wealth index and husband’s working status had statistically significant association with unmet need for contraception. The results of the concentration index indicated that illiteracy among respondents (56%), being in the richest economic status/ wealth index (41%) and non-working status of respondents (21%) contributed substantially to the inequality in the demand for contraception use. Illiteracy of the husband (197%) and the household size less than or equal to five (184%) contributed positively, but illiteracy of respondent (-249%) and unemployment status of respondents (-119%) contributed negatively to the existing inequality in unmet need for contraception.</p> Conclusion <p>The findings of this study highlight the presence of unacceptably high inequality in the demand and unmet need for contraception among women in the four study regions. Policymakers should give due attention to reducing existing socio-economic inequality to address the high unmet need for family planning and increase demand for contraception in these regions. The study strongly recommends implementing multidimensional and multisectoral approaches, which will significantly reduce inequalities in the outcome variables.</p>","author":"Tigist Shumet Wasiyhun","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"605d34a800681a2e7a84ad0ff166c6701e662123d83f8dc14d80aef08321247b","category":"Interdisciplinary"}