{"title":"Current Status and Challenges of Disaster Response and Rehabilitation Measures for Vulnerable Populations in Kagoshima Prefecture, Japan: A Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202408.1456/v1","date":1724156427000,"content":"Kagoshima Prefecture, Japan, is highly vulnerable to natural disasters, and requires effective disaster response and rehabilitation measures, particularly for vulnerable populations. This study aimed to investigate the current state of disaster preparedness in municipalities and identify gaps in support for vulnerable populations during disasters. A cross-sectional survey was conducted from January to March 2023, targeting officers in disaster countermeasures-related municipal departments. The survey assessed municipality awareness of vulnerable populations, understanding of their support needs, and the status of support systems during emergency evacuations. Overall, 51.2% of municipalities responded, of whom 86.4% were aware of vulnerable populations in their areas. However, only 54.5% had a clear understanding of their support needs. A small proportion of municipalities (18.2%–36.4%) had comprehensive support systems in place for vulnerable populations during emergency evacuations. Only 4.5% of municipalities were familiar with the concept of disaster rehabilitation, but 63.6% expressed interest in discussing evacuation plans with medical professionals. The findings reveal significant gaps in municipalities’ awareness and preparedness on disaster rehabilitation measures for vulnerable populations. This highlights the need for increased training, resources, and collaboration between local governments and healthcare professionals to ensure the safety and well-being of vulnerable populations during disasters.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"605ef223b91e8c2cbc37a859cc29cc4169b849eb175a090f816d8a04f92d2af3","category":"Interdisciplinary"}