{"title":"Assessment of Compliance to Preventive Measures Against Covid-19 Using Who Checklist Among Secondary Schools in Nnewi North Local Government Area of Anambra State, Nigeria","link":"https://www.preprints.org/manuscript/202410.1851/v1","date":1729695824000,"content":"Introduction – Coronavirus Disease of 2019 (Covid-19) is arguably the greatest global health threat of our time. Immediately the pandemic was declared by WHO, countries around the world took broad public health and social measures (PHSM), including closure of schools, to prevent the spread of the SARS-CoV-2 virus, which causes COVID-19. [1] The COVID-19 pandemic posed an enormous risk to the health and safety of learners, teachers, parents, school administrators, education practitioners, and the wider community. Schools provide not just learning and social support for students but also, crucially, childcare, without which many parents cannot return to work. However, reopening schools carried the public health risk of viral resurgence. Parents and teachers are understandably wary as the students and staff are affected by the disease and the false information surrounding the disease. As the COVID-19 crisis becomes more protracted, there is a growing need to ensure that concerned stakeholders have appropriate mechanisms and capabilities to cope with their evolving local situations. Aim – It assessed the compliance to COVID-19 preventive measures among secondary schools in Nnewi North LGA of Anambra state, Nigeria using WHO checklist. Setting and design – This was a facility-based cross-sectional observational survey. It involved day schools, boarding schools, all boys schools, all girls schools, mixed schools, government schools, private schools, missionary schools, urban schools, and rural schools. A total area population study was done and involved all thirty-one (31) secondary schools within Nnewi North local government area of Anambra state. Data was collected through school surveys and observations of compliance measures, both done during the same school visit. Informed consent was obtained from the principal of each school or their representative before carrying out the study in their facilities. Observations and NCDC guidelines based on WHO guidelines was used to measure compliance in secondary schools. The assessment was based on the concept of indications (i.e. moments in a staff-student / student-student/ staff-staff interaction) that present an infection. Results – Out of the schools sampled, 12 schools (38.71%) had good compliance, 9 schools (29.03%) had moderate compliance, and 10 schools (32.26%) had poor compliance. The finding of this study thus revealed that the overall compliance level toward COVID-19 preventive and control measures among secondary schools in Nnewi-North LGA of Anambra state was 38.71%. This is a very poor compliance level because strict high-level compliance is required to prevent and control the COVID-19 pandemic. The possible reason for this low compliance level may be due to fatigue and reluctance from the establishments’ side and inadequate enforcement of the COVID-19 preventive and control measures from the concerned government authorities’ side. Conclusions – The common restraining factors against compliance to standard COVID-19 preventive measures included the fact that the students are children and thus wouldn’t always wear their masks at all times, school ownership, attitude towards, and risk perception of COVID-19 and these factors significantly influenced the adherence of each school towards COVID-19 mitigation measures.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"60661bb8f0246ce0ddbaf545fdb493f1b48572e9db4635cc42d89021d1306ee2","category":"Interdisciplinary"}