{"title":"PSV-19 Uncovering breed-origin allele effects and their role in thermotolerance through genome-wide association study in Brangus cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/518/7757670?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>In subtropical and tropical environments, beef cattle production faces significant challenges due to heat stress, affecting animal welfare and productivity. To mitigate these effects, producers have turned to crossbreeding and the development of composite breeds like Brangus, which combine the desirable carcass and meat quality traits of European taurine cattle with the thermotolerance of Indicine breeds. However, the genetic underpinnings of thermotolerance in these composite populations are not well understood, owing to the complex nature of measuring related traits and the genetic intricacies arising from crosses of distinct populations. This study aims to identify key quantitative trait loci (QTL) related to thermotolerance, employing an approach that integrates genetic markers alongside the marker’s breed of origin of alleles (BOA) in Brangus heifers. Data were collected on histological sweat gland area (SWA), hair length (HL), and thermal stress slope as a measure of the increase in body temperature from a low to a high temperature-humidity index (TSS), from 2,233 Brangus heifers genotyped with the 250K functional chip. BOA was determined using LAMP-LD software, using Angus and Brahman cattle from the University of Florida’s multibreed Angus-Brahman project as a reference population. We conducted a genome-wide association study (GWAS) incorporating BOA-specific effects, revealing several genes with BOA-specific effects. Notably, the CGGBP1 gene exhibited a significant effect on TSS only when alleles originated from Brahman. Conversely, the PLK1 gene was significant for TSS when alleles originated from Angus. Both CGGBP1 and PLK1 interact with heat shock proteins during heat stress, these findings reveal different genetic mechanisms for controlling internal body temperature. For HL, a significant Brahman-specific effect was found near the PRLR gene, which is known as the gene controlling the SLICK hair phenotype in Criollo cattle. For SWA, an Angus-specific significant association was found with the PDE4D gene. PDE4D interacts with the cAMP pathway which regulates sweat gland growth and sweat production. These findings underline the genetic complexity of thermotolerance in composite cattle and the crucial role of BOA in identifying key QTL. The study offers novel insights into the genetic mechanisms of thermotolerance, providing a foundation for breeding strategies aimed at improving heat resilience in cattle in subtropical and tropical environments.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"606d4b9fa3fa91c844edb0245b24ab9a288d05131cc5c4e394d9b549f2bc95ca","category":"Environment"}