{"title":"Terraform ephemeral workspaces public beta now available","link":"https://www.hashicorp.com/blog/terraform-ephemeral-workspaces-public-beta-now-available","date":1692633600000,"content":"<p>Everyone working in IT understands the challenge of finding and turning off infrastructure that gets spun up and forgotten about. It's an ongoing issue that unnecessarily inflates IT costs. </p>\n\n<p>Back in June at <a href=\"https://www.hashicorp.com/blog/new-terraform-cloud-capabilities-to-import-view-and-manage-infrastructure\">HashiDays 2023</a>, we previewed the upcoming ephemeral workspaces feature, which is aimed at helping organizations manage the cleanup of old and unwanted resources accumulated over time. Today, the wait is over. </p>\n\n<p>The public beta of ephemeral workspaces for Terraform Cloud Plus is now available. It allows customers to schedule a time to automatically destroy non-production resources, eliminating the need for manual cleanup, reducing infrastructure costs, and streamlining workspace management. </p>\n\n<h2>Benefits of ephemeral workspaces</h2>\n\n<p>This new feature benefits infrastructure teams in three ways:</p>\n\n<p><strong>Cost savings</strong>: Ephemeral workspaces not only reduce infrastructure costs, they also give more time back to infrastructure teams since they don’t have to hunt down or manually delete unused resources as often.</p>\n\n<p><strong>Increased efficiency</strong>: Administrators can set time-to-live (TTL) settings on workspaces through the API or UI, which simplifies management and testing.</p>\n\n<p><strong>Improved security</strong>: Workspaces that are not being actively watched or have been forgotten pose a security risk. Automatically destroying unused workspaces helps organizations meet compliance requirements and reduces the potential attack surface of your infrastructure.</p>\n\n<h2>Using ephemeral workspaces</h2>\n\n<p>It is easy to use ephemeral workspaces. Just set a date and time for when you would like the workspace to be de-provisioned. Auto-destroy settings can be found in Workspace Settings under the section in the sidebar called Destruction and Deletion.</p>\n<img src=\"https://www.datocms-assets.com/2885/1692301401-auto-destroy-full.png\" alt=\"Auto\" /><p>The status of the auto-destroy setting shows up in the sidebar on your workspace's overview page, alongside settings like Execution mode and Auto apply. The auto-destroy status displays as Off if not configured. If configured, the status shows when the next auto-destroy is planned for. If, for any reason, the scheduled destroy run fails, the sidebar status will link to the failed run, where the run output will provide further details. </p>\n<img src=\"https://www.datocms-assets.com/2885/1692303073-auto-destroy-overview.png\" alt=\"Auto\" /><p>Once the configured auto-destroy time is reached, Terraform will automatically run a destroy plan and apply it to destroy your managed resources. Notifications can be configured to send an auto destroy reminder before a <code>destroy</code> run is triggered and auto destroy results to indicate the success or failure of the <code>destroy</code> run.</p>\n\n<h3>Getting started with Terraform Cloud</h3>\n\n<p>Terraform Cloud is designed to standardize workflows from Day 1 infrastructure provisioning to Day 2 operations and beyond. It helps organizations optimize infrastructure investments and improve operational efficiency. Ephemeral workspaces further builds on this optimization.</p>\n\n<p>Try the new ephemeral workspaces today — and if you are new to Terraform, <a href=\"https://app.terraform.io/public/signup/account\">sign up for Terraform Cloud</a> and <a href=\"https://www.hashicorp.com/contact-sales?interest=terraform\">contact sales for a trial</a> of Terraform Cloud Plus.</p>\n","author":"Yushuo Huang","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"606e15283b28c26eebc08715a4a249da37cb60426f6ebe70365eca1782809381","category":"Tech"}