{"title":"Population-based cohort across stroke life course in India-The NIMHANS-NH-SKAN stroke project: A study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310309","date":1727877600000,"content":"<p>by Pradeep S. Banandur, Gautham Melur Sukumar, Banavaram Anniappan Arvind, Srijithesh P. R., Binu V. S., Santosh Loganathan, Nandakumar Dalavaikodihalli Nanjaiah, Thimappa Hegde, Komal Prasad, Lavanya Garady, Akashanand Akashanand, Palak Poddar, Meenakshi Jayabalan, Isha Madan, Upashana Medhi, Arpitha Arun</p>\r\nBackground <p>Stroke is a leading cause of death and disability worldwide. In India, it is the fourth leading cause of death and fifth leading cause of disability, posing a major public health concern. National surveys reveal an increasing trend in stroke risk factors such as tobacco use, physical activity, alcohol use, hypertension, and dyslipidemia. However, knowledge regarding the combined effect of these risk factors and their various combinations is limited. Understanding the individual, combined, and synergistic effects of known risk factors, along with new risk factors, is essential to address gaps in stroke epidemiology. This study aims to examine the effect of various risk factors of acute stroke and their association with stroke occurrence and its outcomes (survival, disability and quality of life).</p> Methods <p>This retrospective-prospective cohort will be conducted in one taluka of Kolara district and two urban wards of Bengaluru with a total population of ~400,000. All stroke-free individuals above 30 years of age ~200,000 individuals in the selected sites will be participants of stroke-free period and all first ever stroke patients in the community will be part of stroke and post-stroke period respectively. The study subjects will be recruited through a complete house-to-house survey at baseline and undergo annual follow-ups during the stroke-free period, with specific assessments at defined time points during the stroke and post-stroke period for a period of one year. Efforts are implemented to minimize loss to follow-up, including community engagement, a helpline number, and hospital-based surveillance.</p> Discussion <p>This large population-based cohort study addressing stroke epidemiology in the country, is one -of-its-kind, attempting to fill certain critical gaps in the natural history, management, and outcomes of stroke in India. This research has the potential to provide important insights into the effect of novel risk factors of stroke and various combinations of risk factors of stroke. Furthermore, the development of a stroke risk predictability calculator will add value to the existing Indian National Programme for Prevention &amp; Control of Non-Communicable Diseases (NP-NCD) and offers a model for similar countries once developed.</p>","author":"Pradeep S. Banandur","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"606f5fe38e25a22cbaac698daf0038d21536d358c0dc6dd0f4d24c4b56aa905e","category":"Interdisciplinary"}