{"title":"Facilitators to Earlier Presentation among Women Diagnosed with Early Stage Breast Cancer Disease; a Systematic Narrative Review of Literature","link":"https://www.preprints.org/manuscript/202408.1561/v1","date":1724301313000,"content":"Abstract Introduction The survival rates of women with stage 0 or 1 breast cancer stands at almost 100% and around 93% for stage 2. As the disease advances with decreasing survival, the rate detoriates to 72% for stage 3 and about 22% for stage 4 (ACS, 2018). Undoubtedly, earlier presentation is synonymous with better prognosis and survival. In fact data indicates that early stage breast cancer diagnoses has 90% survival rate as compared to 27% for the advanced states (ACS, 2018). In this regard, governmental and non-governmental agencies are working tirelessly towards the realization of improved breast cancer care and survival through early presentation and detection. For instance, the Sustainable Development Goal (SDG) Target 3.4 seeks to reduce by one third, premature mortality from cancers and other non-communicable diseases through prevention and treatment. Clearly, early presentation, diagnoses and treatment will assist in the realization of the SDG target 3.4 goal. To achieve this, research must be focused on early presentation among women with breast cancer.. However, current studies have focused mainly on advanced breast cancer regarding treatment, symptoms experience (emotional and psychological), coping and support systems, and the reasons for delayed diagnoses and treatment.  Objective In this review, it is argued that, rather than focusing on advanced breast cancer which has been adequately explored, the attention has to be on what measures or approaches promote early presentations among Ghanaian women. Methods The review included all primary studies that provided answers to the phenomenon of interest. It included both quantitative and qualitative studies. Search scope encompassed studies within the last ten years; thus from 2010 to 2020 irrespective of the country of study.Studies were included if: The paper is of a primary study; the study population included women with early BC or BC symptoms; the study outcome is the association between early stage breast cancer and earlier presentation; the study has a comprehensive data analysis protocol; the results of the studies are unique.A thorough literature search was conducted using the following electronic database: Google scholar and Pubmed. Google scholar alert on new studies was subscribed. This gave update on newly published papers for appraisal and possible inclusion.Manual identified of other potentially eligible publications by searching the reference lists of retrieved studies was also done. After a thorough search, this review included studies from several countries around the Globe such as Ireland, London, Turkey, Iran, Ghana, Kenya, Ethiopia etc Data Collection  The title and or abstract of all retrieved papers were independently scanned through to establish which studies should be further evaluated. The full texts of these potential articles were then assessed. Extraction The Cochrane extraction form for data extraction was resorted to. From each eligible article, the following study identifiers/information were extracted: author(s), first author, year, title, objective, article type, location, setting, study design and method, sample size, instruments used, and results.  Results Prompt help seekers mainly self-discovered their BC, and this occurred through accidental touch, after menstruation, through breastfeeding, during grooming, and while taking their bath.Notably, women who were termed prompt help seekers had higher seriousness perception of their symptoms. This was likened to their level of understanding and awareness, as well as periodic examination and comparison. Similarly, women who knew they were at risk for breast on account of family history, and increased incidence of BC in their localities, labeled their initial symptoms as requiring prompt attention.Following interpretation and labeling of symptoms, the participants generally resorted to symptom monitoring until the onset of additional and or intense symptoms. Though most women thought of benign growths, a few feared it could be malignant. These emotional reactions led the women to purposively seek clarification by selectively consulting others. Further, participants opened up to social acquaintances such as family relationships, people with prior experience of breast disease, and in some few instances health professionals. Some women also resorted to media items to better their understanding. Remarkably, prompt help seekers sort for help within one month. Last but not least, some women first communed with their creator after discovery and labeling based on their spiritual affiliations.Also, researchers should consider conducting surveys to assess the BC risks for specific smaller groups. This would help tailor specific educational interventions to promote earlier presentation and treatment among the vulnerable.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"606f2ec58b8573dcb27b9e632676cf29068d509ec9e6878cb5776efcd875fe45","category":"Interdisciplinary"}