{"title":"From Good To Great In Dashboard Design: Research, Decluttering And Data Viz","link":"https://smashingmagazine.com/2021/11/dashboard-design-research-decluttering-data-viz/","date":1636639200000,"content":"<p>Even if it’s a blessing in disguise, discarding elements of your work is no fun. Tossing out suboptimal parts of our design can be a daunting task, especially after you’ve invested hours of work into it. But make no mistake, this is a bias most designers are prone to. We can get too attached to things we’ve created, despite them not providing any real value to our users. Here lies the difference between <em>okay</em> and <em>great</em> dashboard design. The former is fairly easy to achieve. The latter isn’t.</p>\n<p>I’ve compiled a few things that I’ve learned throughout my career with regard to dashboard design. In this article, we’ll talk about research, decluttering, and data visualization, as well as how these things can make your dashboard design better.</p>\nDefinition\n<p>A dashboard is a part of an application that displays global information about the app’s usage or any other external data. They come in different kinds, from relatively simplistic one-layered dashboards like this one:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a846211d-35b3-44b0-97b0-1dc98854332b/image-1-one-layered-dashboard.png\" /></p>\n<p>While others are more complex and multilayered ones like the one below:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a0918f69-3d8b-4b02-a153-792ff50b7541/image-2-a-more-complex-dashboard.png\" /></p>\n<p>The recommendations we will provide in this article apply to a wide range of dashboards, regardless of their complexity.</p>\n<p>Before diving into our arguments, first, let’s sort out what I mean by “mediocre” and “great”. These terms imply a value system that isn’t exactly conventional, so I owe you an explanation.</p>\nMediocre vs Great Dashboard Design\n<p>The difference between “mediocre” and “great”, I believe, lies in the process. There’s also a continuum involved between these two categories. In the context of this article, the axes of this continuum are as follows:</p>\n<ul>\n<li>Sourcing inspiration (copying),</li>\n<li>Research (referred to in the next section as “homework”),</li>\n<li>Design Validation (substantiating design decisions with data),</li>\n<li>Data Visualization,</li>\n<li>Color Palette.</li>\n</ul>\n<table>\n    <thead>\n        <tr>\n            <th></th>\n      <th>Mediocre</th>\n            <th>Great</th>\n        </tr>\n    </thead>\n    <tbody>\n        <tr>\n      <td><strong>Sourcing inspiration</strong></td>\n            <td>✅</td>\n      <td>✅</td>\n        </tr>\n    <tr>\n            <td><strong>Research</strong></td>\n            <td>Limited and fragmented</td>\n      <td>Consistent and purposeful</td>\n        </tr>\n    <tr>\n            <td><strong>Design Validation</strong></td>\n            <td>Limited to internal stakeholders</td>\n      <td>Inclusive of both internal and end-users</td>\n        </tr>\n    <tr>\n            <td><strong>Data Visualization</strong></td>\n            <td>Heavily focused on aesthetics and trends</td>\n      <td>Data viz solutions are consistent with its purpose; a good balance between efficiency and complexity;</td>\n        </tr>\n    <tr>\n            <td><strong>Color palette</strong></td>\n            <td>Arbitrary / trend-based</td>\n      <td>Utilizable of color connotations, and alignment with brand values</td>\n        </tr>\n    </tbody>\n</table>\n\n<p><em>(Throughout this article, all references to mediocrity are based on these distinctions)</em></p>\n<p>Now that we’ve sorted out the definitions, let’s quickly give an overview of my arguments. In this article, I suggest that, as opposed to mediocre dashboards, great ones require:</p>\n<ul>\n<li>Research,</li>\n<li>A healthy dose of cluttering &amp; decluttering,</li>\n<li>A thought-through color palette.</li>\n</ul>\n<p>First, let’s break down research, or “homework” as I like to call it. How do you even do “homework” as a designer? Is it ok to copy someone else’s work as long as you don’t make it obvious? Or do you start from scratch every time? — Let’s think this through.</p>\nDoing Your Own Homework VS Copying Your Peers\n<p>Sure, there’s always the option of copying and tweaking what your competitors already offer. Or, if there are no close equivalents, you can just “Frankenstein” the elements together from similar dashboards. This indeed sounds easier than “reinventing the wheel”. “<em>Good artists copy, great artists steal,</em>” as Picasso’s quote goes — but, unfortunately, this approach is likely to doom your design to mediocrity. Let me elaborate.</p>\n<p>A quick disclaimer: if what you’re looking for is to learn, then by all means copy great designs and try to learn from them. However, if you’re working on commercial / “real” projects, then copying alone doesn’t do.</p>\n<p>First of all, theoretically speaking, you could strike gold by copying great dashboards. There’s a catch, however. What is the likelihood that your source of inspiration is well-researched, practical, and most importantly <em>applicable to your particular situation</em>? Are the dashboards you’ve found worth stealing? Who knows. If you ask me, however, I wouldn’t bet on it. This ties in well with the ideas Austin Kleon outlined in his book <em>Steal like an artist</em>. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e8649c90-1a4d-44b8-ae3b-c913091364f3/image-3-is-it-worth-stealing.png\" /></p>\n<p>Secondly, when you’re sourcing inspiration, all you see is the end product: a colorful nice-looking dashboard. Rarely can you find inspiration accompanied by a thorough analysis of the process, research, and decision-making involved. This leads to something akin to a cargo cult, i.e. replicating the patterns you see without understanding why. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3d3f7ed5-688a-4b44-809d-b9228f05825b/image-4-dashboard-cargo-cult.png\" /></p>\n<p>Finally, another unfortunate side effect of merely copying is that it’s not consistent. You can’t play the odds and win every time. That’s not to say that a “proper” <a href=\"https://adamfard.com/ux-design-process\">design process</a> is foolproof. I believe that following the principles I outline in this article will make your designs consistently better, so you can “strike gold” with a higher degree of reliability and replicability.</p>\n<p> Simply put, following a proper process and having a command of design principles, as opposed to mindlessly copying, gives you a better chance of coming up with usable designs with fewer iterations and useability testing sessions.</p>\n<p>So how do you strike a balance between “copying” and “doing your own homework”? Here’s what I think. On top of “stealing” (ahem.. looking for inspiration), also <strong>talk to your users</strong>.</p>\n<p>I 👏 can’t 👏 stress 👏 this 👏enough.</p>\n<p>I bet we’re all (myself included) tired of hearing this mantra. “Talking to users” is like exercising or eating healthy — everyone knows they should do more of it, but few actually do it.</p>\n<blockquote>“People ignore design that ignores people”.<br /><br />— <a href=\"https://frankchimero.com/\">Frank Chimero</a></blockquote>\n\n<p>Is there a worse way to ignore users than excluding them from the conversation altogether?</p>\n<p>Alright, talking to users is important. That much is clear. What isn’t self-explanatory though is how exactly this communication should take place — let’s go over a couple of activities to examine a couple of ways.</p>\n<h3>User interviews:</h3>\n<p>Here are a few questions worth looking into when designing a dashboard. </p>\n<ul>\n<li>What information do users need the most?</li>\n<li>What is the purpose of this dashboard?</li>\n<li>What do users consult this dashboard for?</li>\n<li>How do they go about looking for this information currently?</li>\n</ul>\n<p><a href=\"https://www.toptal.com/designers/data-visualization/dashboard-design-best-practices\">In this piece</a>, Stelian Suboti, a UI &amp; UX designer with more than 7 years of experience, the author claims that:</p>\n<p> Truly valuable insight can come out of a short user research phase with just five users — and it will save an enormous amount of time down the line.</p>\n<p>Doing research (user interviews in this case) is the first step of the design thinking process (empathy), as well as the UX process in general. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e48d7b20-fe13-427e-8e91-4cbdd9d29ebd/image-5-usability-testing.png\" /></p>\n<h3>Card-Sorting</h3>\n<blockquote>“Card sorting by its very nature, is a method you would use when you want to discover categories, groups, or interrelationships. Use this method when you want to know how users respond to visual cues and you want to capture the similarities and differences.”<br /><br />— <a href=\"https://think.design/user-design-research/card-sorting/\">Think Design</a></blockquote>\n\n<p>As we’ve just learned, card sorting helps us understand how users group and categorize information. In practical terms, card sorting looks something like this 👇  </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/04b68278-5886-4e2e-8880-55d5c56963ba/18-dashboard-design-research-decluttering-data-viz.png\" /></p>\n<p>You generally want to split your dashboard into “atoms”, bits of information of the smallest size, so that the participants can establish the relationships among these elements. This is how you could build the information hierarchy within the dashboard that’s consistent with users’ mental models. </p>\n<h3>Usability Testing</h3>\n<p><a href=\"https://adamfard.com/blog/usability-testing\">Usability testing</a> is arguably the most important and insightful research activity you can conduct with regard to dashboard design. Playing by ear and skipping this step altogether just might be the biggest cardinal sin of UX design.</p>\n<p>Here’s what Nielsen Norman Group, the world’s leading product design authority, <a href=\"https://www.nngroup.com/articles/usability-testing-101/\">has to say</a> about usability testing: </p>\n<blockquote>“Even the best UX designers can’t design a perfect — or even good enough — user experience without <a href=\"https://www.nngroup.com/articles/parallel-and-iterative-design/\">iterative design</a> driven by observations of real users and of their interactions with the design.”</blockquote>\n\n<p>In practical terms, you would want to conduct usability testing sessions after card sorting and user interviews. The latter two activities blended with your own assumptions should result in early dashboard versions. These rough ideas will then need to be tested and iterated on from sketches, and low-fi wireframes all the way to a high-fidelity prototype.</p>\n<p>Now that we discussed the research methods, we can safely move on to my second argument, which is all about decluttering. How do you know if your dashboard is cluttered? Does the “less is more” principle work every time? — These are the topics we’re tackling next.</p>\nTo Declutter Or Not To Declutter\n<p>In a conventional sense, decluttering is nearly synonymous with simplifying. Moreover, the practice of “keep it simple stupid” (KISS) has become somewhat of a design truism. The simpler the better, right? I wish it was that simple (no pun intended). </p>\n<p>A cluttered design, by definition, overwhelms its users. That’s not to say that an app can’t have a learning curve. Adobe products are probably a textbook definition of what “overwhelming a first-time user” means. </p>\n<p>Let’s take a look at the following dashboard:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/39a2f2a8-1da7-4ecb-a963-37be2ecb978e/10-dashboard-design-research-decluttering-data-viz.png\" /></p>\n<p>This is an excellent example of what might be considered “cluttered”. A closer look at the dashboard will tell you that it has to do with stock (index) price movement, trading volume, economic events, etc. If you think that this looks intimidating — you’re right. For an average user, it probably is. I’d wager, though, that the people qualified to use this kind of software actually benefit from this complexity — it allows them to work efficiently. Obscuring much of the information presented in this dashboard will only result in unnecessary clicks and excessive friction.</p>\n<p>Now let’s try to take a look at something seemingly decluttered and “clean”. By the way, this particular dashboard, designed by <a href=\"https://www.uplabs.com/bhojendra\">Bhojendra Rauniyar</a>, won in the minimal dashboard challenge by UpLabs. Congrats to Bhojendra!</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1f8f2fa3-e0a3-4582-9737-f0a304b22455/26-dashboard-design-research-decluttering-data-viz.png\" /></p>\n<p>Before I start critiquing the dashboard above, here’s a disclaimer. First of all, this is a dribbble shot, so we can’t be certain whether it’s an isolated piece of design or a part of a product. Secondly, I don’t have access to the designer to ask for his rationale behind certain design decisions. Thirdly, I do not know whether this design has been tested and the full context of its usage. As such, all I have left is to speculate and assume. I hope, for educational purposes, that will do.</p>\n<p>Let’s start with the chart. It compares client ratings with earnings. I’m left to wonder though what values define these two categories? The values have to be the same since both curves are on the same graph. So do we measure earnings in average rating or rating in dollars? Additionally, there are no labels for the scale, so I can’t even be sure of the units of measurement. What would probably be more useful is having separate graphs for key metrics with clear labels, i.e. to introduce “extra complexity”.</p>\n<p>Additionally, the stats alone are not very valuable. Is earning “5k” in “1.8k” hours a good result? How does that compare to my peers? What are my dynamics?</p>\n<p>That’s not to say that the dashboard I mentioned first is perfect and the second one is bad. You could argue that both of these require further work. My point is that decluttering for the sake of decluttering is a poor design maxim. </p>\n<p>Cluttered apps are unnecessarily overwhelming and hard to navigate. How do you know if an app is all of the above? Presto! That’s right, you talk to the users and have usability testing sessions with them. Other than usability testings, there are a few other practices that will help ensure that your interface is not cluttered:</p>\n<ul>\n<li>Clear information hierarchy;</li>\n<li>The use of modals or panels;</li>\n<li>On-hover interactions;</li>\n<li>Two to three colors;</li>\n<li>White space, plenty of it.</li>\n</ul>\n<p>Now that we went through research and cluttering, we can move on to data visualization. Data visualization is irreplaceable for many reasons. It allows you to:</p>\n<ul>\n<li>See patterns,</li>\n<li>Compare data,</li>\n<li>Articulate the information visually,</li>\n<li>Track data dynamics.</li>\n</ul>\n<p>Does this ring a bell? Exactly — this is pretty much everything that a dashboard should do. It’s no coincidence that almost all dashboards feature graphs and charts. Therefore, being competent at data visualization directly translates into being a competent dashboard designer. Let’s zoom in on that.</p>\nStep Up Your Data Visualization Game\n<p>There are multiple types of charts available, thus we need to choose wisely. The sunburst chart does look awesome, but is it as clear and transparent as the pie chart? Perhaps. That really does depend on your users. Types of charts aside, there are also colors, their semantics and so many other things that add to the complexity of data visualization in dashboard design. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/92f9d4a7-02cb-4f94-be65-cca9d7b75605/image-9-types-of-charts.png\" /></p>\n<p>In this section, I will do my best to outline some of the data visualization best practices and their application in dashboard design. Let’s start with colors. </p>\n<p>This section is largely based on the research of <a href=\"https://clauswilke.com/\">Claus O. Wilke</a>, Professor in Molecular Evolution at The University of Texas at Austin, and the author of <em>Fundamentals of Data Visualization</em>.</p>\n<h3>Color In Dashboard Design</h3>\n<p>Let’s address the issue with numbers first. How many colors should you use in UI design and dashboard design in particular? — Frankly, there’s no magic number of colors that works no matter what. However, if I were to recommend you a number, it would be 5. That doesn’t include shades if the intensity of the color represents a value or semantic colors if you need them (e.g. red for error messages or green for success messages). </p>\n<p>Why 5? Well, there’s a 6:3:1 “golden” rule of visual design. These numbers represent the proportion among three brand colors: main, secondary, and accent. However, you should remember that on top of these three colors, you’re likely going to need some variation of white and black for text and its background.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/866b7b67-1262-4d5d-850c-10ca99fce0c4/20-dashboard-design-research-decluttering-data-viz.png\" /></p>\n<p>Another thing to use colors for is to distinguish among different entities. Here are a few common color palettes.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ef47a0c3-e8aa-4475-91a3-461106d4e492/16-dashboard-design-research-decluttering-data-viz.png\" /></p>\n<p>Use monochromatic color palettes if showing information within a single category. That way you can introduce another dimension to your chart that’s easy to read. For example, the more intense the colors, the higher the value and vice versa.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b6477891-29e7-4be2-ac35-57fbfc5d32e4/2-dashboard-design-research-decluttering-data-viz.png\" /></p>\n<p>Here’s an example:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ad00201d-4bce-49e2-9b76-0e7692cf58bd/23-dashboard-design-research-decluttering-data-viz.png\" /></p>\n<p>What you can also do is pick two colors to represent the opposite ends of a spectrum. That way you can easily tell apart values that belong to different extremes. Here’s an example:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3057ebfc-5285-400b-adfa-e1b10cbf4ae3/image-13-map-of-the-us.png\" /></p>\n<p>Here are a few color palettes for this approach you can choose:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/23451848-6f12-4ead-8fae-ca3fd4349a55/image-14-diverging-color-schemes.png\" /></p>\n<h3>Beware Of Colors Semantics</h3>\n<p>Now that we went through the approaches you can take with using colors, it should also be noted that colors elicit subconscious reactions. These reactions are often referred to as “color semantics”.</p>\n<p>When comparing 2 groups, using colors like red and green (because of the semantics associated with these colors) might lead to misrepresentation. Red, for instance, is often associated with danger, failure, and poor performance.</p>\n<p>Take a look at the graphs below, which illustrate the math performance of two classes. We might automatically assume that students on the graph on the left in Class A are performing poorly, due to the fact that the values are represented with red. Red, especially in combination with green, often elicits such an interpretation.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5f0c0dbe-e0cf-4b89-8f25-d3f404bf0492/image-15-semantics.png\" /></p>\n<p>However, there are cases where this semantic difference can be used to our advantage like in the example below, i.e. using red to display performance that’s below average, and green for above. Also, note that it’s more natural for people to instinctively associate values on top as greater than those below. The graph below illustrates the last point.  </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/76741025-e3f0-429b-84c7-b57ebcbb84ad/image-16-semantics.png\" /></p>\n<p>As you can see, green represents students who perform above average, while red is reserved for those who underperform. Semantic color cues make this chart a lot more readable than it would otherwise be with another color scheme.</p>\n<h3>On Which Charts To Use</h3>\n<p>Data visualization can induce a fair amount of friction when done incorrectly. Make sure to choose the most suitable type of chart to deliver the right kind of data. Below, you’ll find a more or less comprehensive list of charts you can use to represent the information featured in your dashboard, depending on the roles they fulfill.</p>\n<p><strong>NB:</strong> <em>Most charts serve more than one purpose. For instance, a pie chart is used to compare values, show composition, and data distribution. As such, I will mention these charts multiple times depending on the use case. However, I will only give a brief explanation for each chart once.</em></p>\n<h4>Compare</h4>\n<ul>\n<li><strong>Pie</strong><br />Typically used to represent fractions of a whole. Pie charts work great whenever you need to compare a relatively low number of segments that are comparable in terms of their size. Conversely, having too many segments or tiny segments makes the chart too hard to read. A major con of pie charts is their inability to show changes over time.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9b08e220-e727-4a8f-b0f9-e50711798fa6/image-17-piechart-example.png\" /></p>\n<ul>\n<li><strong>Stacked Bar</strong><br />Especially useful when comparing categories. Just like the pie charts, the more complex they get (more series &amp; categories), the harder they are to read. An advantage that stacked bar charts have over pie charts is the ability to see changes over time. Another thing to look out for is that when you have series that vary in their value, it gets harder to compare them visually. For example, take a look at the example below, it’s not obvious whether the orange series for “Eyebrow pencil” is larger or smaller than that of “Foundation”.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3125451a-b8a8-42c6-b937-9f8ca5f855f4/image-18-stacked-bar.png\" /></p>\n<ul>\n<li><strong>Mekko</strong><br />Perfect for visualizing the differences of certain categories within multiple dimensions. Just like the rest of the charts we’ve gone over so far, they’re easy to read but get increasingly harder to grasp once the categories and dimensions start to pile up. Additionally, you should avoid using Mekko charts if the differences among elements are too drastic.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8df8b988-de1d-4b29-9cc7-954c081ecd98/image-19-mekko-chart.png\" /></p>\n<ul>\n<li><strong>Stacked Column</strong><br />A great way to show comparisons between categories. You might have noticed that this chart type bears a strong resemblance to a stacked bar chart. Though there are differences in naming, you should know that horizontal bars usually go from highest to lowest value (or vice versa), while vertical ones imply another order rationale.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/38d4f80a-afab-4f75-b73f-4b60bda6fbfb/image-20-stacked-bar.png\" /></p>\n<ul>\n<li><strong>Area</strong><br />A really common way of representing quantitative data. Often used to show the increase or decrease of various data series over time. The major con of this type of visualization is that it’s hard to connect a specific point of the graph to a value on both axes. And, as always, the more information you cram in, the less readable it becomes. Finally, if the graphs overlap, then one area will go over another and vice versa. Therefore, area charts are good for helping see the big picture without too much regard for being extremely precise.<br />You might also notice a similarity between area and line charts. The former should be used when there’s an emphasis on a part-to-whole relationship.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/54deac20-0e74-4b63-9e99-e6e2d0a1220b/image-21-area-chart.png\" /></p>\n<ul>\n<li><strong>Waterfall</strong><br />This kind of chart is often used in the financial industry to display the movement of value and its incremental path towards an endpoint. These charts, not being all too common, might not be the most intuitive to read, so they should better be reserved for professionals who deal with waterfall charts often.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1e860a8f-aadb-40c8-b97b-48b6ed1ee3fe/image-22-waterfall.png\" /></p>\n<ul>\n<li><strong>Line</strong><br />A good choice when you’re looking to present a series of values. These values (also called markers) are typically connected by straight line segments. The line chart mimics the disadvantages of the area chart, except for the color overlapping problem.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bc2ce2da-354d-4b9e-a6cc-3ad9b20018d0/image-23-line-chart.png\" /></p>\n<p><strong>Showcase the composition:</strong></p>\n<ul>\n<li>Pie,</li>\n<li>Stacked Bar,</li>\n<li>Mekko,</li>\n<li>Stacked Column,</li>\n<li>Waterfall.</li>\n</ul>\n<p><strong>Distribution of Data:</strong></p>\n<ul>\n<li><strong>Scatter Plot</strong><br />A great way to emphasize the relationships between one or multiple numeric variables and/or their distribution across two axes. The major problem with using scatter plots for UX purposes, it’s that this type of chart is considerably harder to read than all of the other ones we’ve discussed so far. As such, scatter plots should be reserved for experienced users only.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4245128b-06f6-4b21-9725-7c3488983be3/image-24-scatter-plot.png\" /></p>\n<ul>\n<li><strong>Mekko</strong></li>\n<li><strong>Column</strong></li>\n<li><strong>Bubble</strong><br />Commonly used to present financial data. Bubble charts are similar to scatter plots, however, they provide a more in-depth understanding of the data, since they have 3 axes. </li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c031f0a5-dabd-4f19-b419-83687814287d/image-25-bubble.png\" /></p>\n<p><strong>Correlation and relationship between values:</strong></p>\n<ul>\n<li>Scatter Plot,</li>\n<li>Bubble,</li>\n<li>Line.</li>\n</ul>\n<p>If we were to summarize the charts above in a matrix, it would look something like this.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/34049c21-7972-4c93-bca9-1eefc3065797/image-26-types-of-chart-usage.png\" /></p>\n<p>It is only fitting that we summarized the types of charts and their usage as an infographic. 😄</p>\n<p>Be advised though, that I’ve indicated what these charts are <strong>generally</strong> used for. Theoretically, if you wanted to, you could do a bubble chart, where each bubble is a pie chart. Voila, your bubble chart can now also show the composition of each bubble. Of course, it’s easier said than done, because usually, bubbles vary in their size drastically. Anyhow, you get the idea: the matrix is a general guideline, but you can get more creative with charts if you want to at your own discretion.</p>\n<h3>Balancing Between The Complexity And Efficiency</h3>\n<p>So here’s a thing. As you might have noticed, lots of charts can be used for similar purposes. That doesn’t mean, however, that these charts are equally good for a certain task.</p>\n<p>Generally, once you narrow down your choice to a few charts that seem to work best, you then want to make sure that they’re the least complex they could be. Below, I’ve outlined some of the charts we’ve mentioned by the degree of their complexity and efficiency.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/84eb4f9a-d22d-4512-bf06-4158e20c6299/image-27-complexity-vs-efficiency.png\" /></p>\n<p>In a nutshell, you want to maximize efficiency and minimize complexity. This is the top-left quadrant. These charts are easy enough to be understood by middle school students. You should stick to those for the “consumer” persona, i.e. an average Joe. The more you move toward the right, the more reasons you should have to believe your users would be comfortable with reading them.</p>\nWhat’s Next?\n<p>In case you’d like to continue learning about dashboards and the aspects of their design, here are some resources my team and I have found helpful (to an increasing degree of complexity):</p>\n<h3>Articles</h3>\n<ul>\n<li><a href=\"https://uxplanet.org/data-heavy-applications-how-to-design-perfect-charts-c0c893fef6de\">Data-heavy applications: How to design perfect charts</a></li>\n<li><a href=\"https://towardsdatascience.com/top-16-types-of-chart-in-data-visualization-196a76b54b62\">Top 16 Types of Chart in Data Visualization</a></li>\n<li><a href=\"https://www.justinmind.com/blog/dashboard-design-best-practices-ux-ui/\">Dashboard Design: best practices and examples</a></li>\n<li><a href=\"https://www.geckoboard.com/best-practice/dashboard-design/\">How to design and build a great dashboard</a></li>\n<li><a href=\"https://adamfard.com/blog/dashboard-ui\">Dashboard UI Design: 14 Best Practices for Stakeholders</a></li>\n</ul>\n<h3>Books</h3>\n<ul>\n<li><a href=\"https://www.refactoringui.com/book\">Refactoring UI</a></li>\n<li><a href=\"https://www.amazon.com/Beautiful-Visualization-Looking-through-Practice/dp/1449379869#customerReviews\">Beautiful Visualization: Looking at Data through the Eyes of Experts (Theory in Practice)</a></li>\n<li><a href=\"https://www.amazon.com/Functional-Art-introduction-information-visualization/dp/0321834739\">Functional Art, The: An introduction to information graphics and visualization (Voices That Matter)</a></li>\n</ul>\n<h3>Scientific papers</h3>\n<ul>\n<li><a href=\"https://ieeexplore.ieee.org/document/4272046\">Visualization Criticism - The Missing Link Between Information Visualization and Art</a></li>\n<li><a href=\"https://www.sciencedirect.com/science/article/pii/S2666389920301896\">Principles of Effective Data Visualization</a></li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"6074a374d655c45d41b5c3065b7649c87ba255e4182f10e5975f67d700a63ece","category":"Tech"}