{"title":"Contributions of Tropical Cyclones and Atmospheric Rivers to Extreme Precipitation Trends Over the Northeast US","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004370?af=R","date":1712631890000,"content":"<h2>Abstract</h2>\n<p>The Northeast United States (NEUS) has faced the most rapidly increasing occurrences of extreme precipitation within the US in the past few decades. Understanding the physics leading to long-term trends in regional extreme precipitation is essential but the progress is limited partially by the horizontal resolution of climate models. The latest fully coupled 25-km GFDL (Geophysical Fluid Dynamics Laboratory) SPEAR (<b>S</b>eamless system for <b>P</b>rediction and <b>EA</b>rth system <b>R</b>esearch) simulations provide a good opportunity to study changes in regional extreme precipitation and the relevant physical processes. Here, we focus on the contributions of changes in synoptic-scale events, including atmospheric rivers (AR) and tropical cyclone (TC)-related events, to the trend of extreme precipitation in the fall season over the Northeast US in both the recent past and future projections using the 25-km GFDL-SPEAR. In observations, increasing extreme precipitation over the NEUS since the 1990s is mainly linked to TC-related events, especially those undergoing extratropical transitions. In the future, both AR-related and TC-related extreme precipitation over the NEUS are projected to increase, even though the numbers of TCs in the North Atlantic are projected to decrease in the SPEAR simulations using the SSP5-8.5 projection of future radiative forcing. Factors such as enhancing TC intensity, strengthening TC-related precipitation, and/or westward shift in Atlantic TC tracks may offset the influence of declining Atlantic TC numbers in the model projections, leading to more frequent TC-related extreme precipitation over the NEUS.</p>","author":"Bor‐Ting Jong, \nHiroyuki Murakami, \nThomas L. Delworth, \nWilliam F. Cooke","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"60773290c0a4da8820f9bda12bb5bb59403baddf6ef93e2d2a032ef459553015","category":"Environment"}