{"title":"Development of a root-zone temperature control system using air-source heat pump and its impact on the growth and yield of paprika","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae047/7758058?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>By developing and implementing a local temperature control system, such as a root zone, with a high energy efficiency heat source, we can ensure both yield and energy efficiency against extreme temperatures. This system, designed with practicality in mind, has a remarkably positive impact on paprika plants’ growth and yield in greenhouse cultivation. In the summer season, paprika plants were grown with no cooling, nutrient solution cooling (NSC) and the combination of NSC and substrate surround cooling (SSC) (NSC + SSC). In the case of SSC, cooled water circulated through the pipe surrounding the substrate to lower the substrate temperature. The cooling system maintains the nutrient solution temperature at 18 °C and the circulating water temperature at the system in the winter season; the paprika plants were grown with no heating (NH), nutrient solution heating (NSH) and the combination of NSH and substrate surround heating (SSH) (NSH + SSH). The heating system maintains the nutrient solution temperature at 25 °C and the circulating water temperature at 30 °C. In the summer, the root fresh and dry weights, stem fresh and dry weights, stem length and node number were increased in the NSC + SSC. In the winter season, the stem fresh and dry weights, leaf area and leaf fresh and dry weights were increased in the NSH + SSH. In both seasons, root-zone temperature control increased the fruit quality and yield. The result indicates that this easy-to-install root-zone temperature control system can be applied to the commercial greenhouse to secure paprika growth and yield in year-round cultivation.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"6085657a5ab29a96ebcec3d21033c7b1da13623a0f1f13ce55ed794c5d88517a","category":"Environment"}