{"title":"The next big thing comes to those who wait","link":"https://www.macworld.com/article/358405/macalope-next-big-thing-wait.html","date":1632218400000,"content":"<div>\n<section><div></div></section><p>Apple <a href=\"https://www.macworld.com/article/234814/iphone-13-features-specs-price-release.html\">announced the iPhone 13 </a>lineup last week, touting cameras, longer battery life, different colors. A lot of people have said this wasn’t a very exciting iPhone announcement and, you know what? It’s true. iPhone announcements just <em>aren’t</em> that exciting anymore.</p>\n\n\n\n<p>And that’s okay.</p>\n\n\n\n<p>Smartphones are a mature business. If your smartphone announcement is exciting at this stage of the game, it’s probably because of either a technical problem, one of your phones or presenters caught fire, or your dancing hyenas broke loose and went on a five-day rampage through a major metropolitan area.</p>\n\n\n\n<p>Sorry, Cleveland!</p>\n\n\n\n<p>Think back to personal computer announcements in the 2000s. PCs were a mature business. The most innovative announcement was the MacBook Air in 2008 and pundits yawned because it wasn’t as exciting as the iPhone announcement the previous year. It was still just a keyboard attached to a screen. The Macalope has said it before but he’ll say it again: announcements like the original iPhone are exceedingly rare. And even when they happen, pundits often fail to appropriately take note of it. The <a href=\"https://www.macworld.com/article/151855/29ipod.html\">iPod</a> and <a href=\"https://www.macworld.co.uk/review/original-apple-watch-review-3544044/\">Apple Watch</a> were roundly derided when they were announced, yet both turned out to be incredibly popular devices that took over their categories.</p>\n\n\n\n<p>The Macalope has an <a href=\"https://www.macworld.com/article/234921/iphone-12-mini-review-a-concentration-not-a-reduction.html\">iPhone 12 mini</a> (best phone) and he’ll probably eventually get a 13 mini, but he’s not in desperate need of a better camera and slightly longer battery life.</p>\n\n\n\n<p>Although, that blue is nice.</p>\n\n\n\n<p>Even while this furry observer is not rushing to get a new iPhone…</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.applemust.com/morgan-stanley-says-iphone-13-sees-strong-weekend-demand/&amp;xcust=1-1-358405-1-0-0&amp;sref=https://www.macworld.com/feed\">“Morgan Stanley says iPhone 13 sees strong weekend demand”</a></p>\n\n\n\n<blockquote><p>…iPhone builds point to 20% Y/Y growth, suggesting strong growth in sales this year.</p></blockquote>\n\n\n\n<p>That’s a pretty decent percentage increase considering how many iPhones Apple sells. So, to a certain degree, Apple doesn’t massively update the iPhone every year because it doesn’t <em>have</em> to massively update the iPhone every year. Why mess with what works? They still sell pretty well anyway. Other than the mini which you Philistines don’t seem to appreciate and that’s on you.</p>\n\n\n\n<p>THAT’S ON YOU.</p>\n\n\n\n<p>Ahem.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>None of this means <a href=\"https://www.macworld.com/article/357962/apple-next-big-thing-iphone-13-event.html\">Apple is out of ideas</a>. If Apple were to announce a big new thing, it probably wouldn’t do it at an iPhone event. The company could conceivably make a bigger iPhone splash if it made a major form factor change, like releasing a flip phone, but currently, it doesn’t have to. Other vendors have made minor ripples by announcing flip phones but it has to date been hard to see them as anything other than overpriced gimmicks. Analyst Ming-Chi Kuo now suggests that Apple’s first foldable phone <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/09/20/kuo-iphones-with-under-screen-touch-id-now-coming-in-2023-foldable-iphone-in-2024/&amp;xcust=1-1-358405-1-0-0&amp;sref=https://www.macworld.com/feed\">might come in 2024</a> (this after saying <a href=\"https://www.macworld.com/article/345077/the-iphone-15-might-have-a-foldable-screen.html\">it would be 2023</a>) so if you’re bored by the current lineup of incredibly competent phones at a startling array of price points, just wait.</p>\n\n\n\n<p>This brings the horny one to his current favorite rumor-based Schrödinger’s piñata (it may or may not be full of candy) that he just came up with: the reason rumors are pointing to the 13 mini being the last mini are not simply that the minis aren’t selling as well as the other models, it’s that Apple feels a foldable iPhone will fit the bill as a small phone.</p>\n\n\n\n<p>Look, you have your coping mechanisms, the Macalope has his, okay?</p>\n\n\n\n<p>The holy trinity of Apple rumors used to be the tablet, the phone, and the set-top box. The set-top box was rumored since the late 1990s and only arrived in 2007. We waited years for these devices to arrive as we witnessed progressive, if not always astounding, upgrades to Macs. Now we wait for a self-driving car, AR glasses, and maybe a flip phone. It’s not buttering Apple’s bread to suggest that a self-driving car might reasonably take a bit longer than the Apple TV. No one ever crashed an Apple TV into a sidewalk bistro.</p>\n\n\n\n<p>Except for Karl.</p>\n\n\n\n<p>Freakin’ Karl, man.</p>\n\n\n\n<p>They say good things come to those who wait. Then again, they also say waiting is the hardest part. It’s a quandary.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"608691e6efead5e3635ff52c5c11e21657fa3c461285453a38776d38c338a7f7","category":"Apple"}