{"title":"iOS 17.4: Using Apple's New Podcast Transcript Feature","link":"https://www.macrumors.com/how-to/view-search-transcripts-podcasts-app/","date":1706698945000,"content":"In iOS 17.4, currently in beta, Apple is adding audio transcripts to the Podcasts app for <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, meaning you'll be able to read along to your favorite podcasts as they are spoken.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/podcast-app-transcript.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nApple is adding support for auto-generated transcripts in its Podcasts app, offering users another way to enjoy podcast content rather than simply listening to what is being said. \r<br />\n\r<br />\nIf you're familiar with lyrics in <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>, it's very similar. When playing a podcast, simply tap the speech bubble icon at the bottom-left corner of the fullscreen media playback screen. \r<br />\n\r<br />\nTap the auto-generated transcript that appears to make it fill the screen. The transcript automatically scrolls and highlights the text currently being spoken as the episode plays, or you can scroll through the transcript manually, and even tap on a sentence to jump to that point in the podcast. Text selections can also be highlighted for copying and pasting elsewhere.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/Friday-26-Jan-2024-15-54-44.jpg\" width=\"2738\" height=\"2716\" />\r<br />\nIn addition, a Search button at the bottom of the screen lets you search the transcript for specific words or phrases and jump to that point in the transcript, where you can then tap to skip to the audio track. \r<br />\n\r<br />\nTranscripts can also be accessed from the Up Next section in the Home tab. Simply press and hold a podcast episode to reveal the View Transcript option in the dropdown menu. And if you're on the episode details page, tap the ellipsis (three dots) button top-right to reveal the same option.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/podcasts-app-transcripts-1.jpg\" alt=\"podcasts\" width=\"2738\" height=\"1511\" />\r<br />\nAs of writing, not all podcast episodes have transcripts right now, but Apple says that transcripts for back catalog episodes are being added over time. Transcripts are available in English, French, German, and Spanish, and podcast hosts also have the option to upload their own transcripts rather than using the automatically generated version.\r<br />\n\r<br />\nThe transcripts feature is coming as part of Apple's iOS 17.4 update, which available to developers at the current time. Apple plans to release it to the public in March. <div>Tag: <a href=\"https://www.macrumors.com/guide/apple-podcasts/\">Apple Podcasts</a></div><br />This article, \"<a href=\"https://www.macrumors.com/how-to/view-search-transcripts-podcasts-app/\">iOS 17.4: Using Apple's New Podcast Transcript Feature</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-4-using-apples-new-podcast-transcript-feature.2417947/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6096a964ad9527327de6db1c5e98ebf4374b97563b475c72867bae1659edad13","category":"Apple"}