{"title":"Optimal measurement method for anterior instability on stress radiographs in anterior cruciate ligament tear: Considering the effect of static anterior tibial subluxation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310428","date":1726581600000,"content":"<p>by Joo Hyung Han, Chong-Hyuk Choi, Min Jung, Kwangho Chung, Sungjun Kim, Taeho Ha, Sung-Hwan Kim</p>\r\nIntroduction <p>Accurate assessment of anterior cruciate ligament (ACL) function is vital for guiding treatment. Nevertheless, the presence of tibial subluxation in the neutral position of a patient with an ACL injury may potentially introduce a confounding factor. This study aims to investigate whether tibial subluxation in the neutral position affects the diagnosis of anterior instability in patients with ACL injuries, potentially impacting the reliability and diagnostic accuracy of stress radiography.</p> Methods <p>This study included 88 patients: 30 with acute complete ACL tears (acute group), 28 with chronic complete ACL tears (chronic group), and 30 patients who underwent knee arthroscopic surgery other than ACL reconstruction (control group). Side-to-side differences (SSD) in stress radiography were measured using the Telos load status and the SSD of the gap between the Telos load and unload statuses. Diagnostic accuracy of the two methods was assessed using areas under the receiver operating characteristic curves (AUCs).</p> Results <p>The load SSD (5.92 ± 5.28 mm) was higher than the load-unload SSD (4.27 ± 5.99 mm) in the chronic group (<i>P</i> = 0.017). The load SSD demonstrated a significantly higher diagnostic value than that of the load-unload SSD in the combined group (AUC = 0.920 vs. 0.830; <i>P</i> = 0.012) and chronic group (AUC = 0.913 vs. 0.754; <i>P</i> = 0.002). After adjusting the symptoms for radiographic duration from 6 to 3 months in the chronic group, the load SSD exhibited a significantly higher diagnostic value (AUC = 0.902) than that of the load-unload SSD (AUC = 0.740; <i>P</i> &lt; 0.001).</p> Conclusion <p>The load SSD provides superior diagnostic accuracy compared to the load-unload SSD in ACL tear cases, where static anterior tibial subluxation may result in false negatives. Although load-unload SSD may have diagnostic value within the first 3 months post-injury, the load SSD method provides a reliable assessment of ACL function for patients beyond this timeframe.</p>","author":"Joo Hyung Han","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"609b96b7a5e3e1346dab53d611e1ed17f89c0d6afe621954b6a51e1e30f8be6e","category":"Interdisciplinary"}