{"title":"Early‐season mass‐flowering crop cover dilutes wild bee abundance and species richness in temperate regions: A quantitative synthesis","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14566?af=R","date":1709702618000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/fa31a73a-ca89-4041-8e42-b0b173a45e18/jpe14566-toc-0001-m.png\" alt=\"Early-season mass-flowering crop cover dilutes wild bee abundance and species richness in temperate regions: A quantitative synthesis\" />\n<p>Our results confirm that increasing early-season mass-flowering crop cover dilutes wild pollinators in crop habitats during bloom. We find that dilution effects were absent late in the season. While mass-flowering crop cultivation alone is unlikely to be sufficient for maintaining pollinators, as part of carefully designed diverse crop rotations or mixtures combined with the preservation of permanent non-crop habitats, it might provide valuable supplementary food resources for pollinators in temperate agroecosystems, particularly later in the season when alternative flower resources are scarce.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPollinators benefit from increasing floral resources in agricultural landscapes, which could be an underexplored co-benefit of mass-flowering crop cultivation. However, the impacts of mass-flowering crops on pollinator communities are complex and appear to be context-dependent, mediated by factors such as crop flowering time and the availability of other flower resources in the landscape. A synthesis of research is needed to develop management recommendations for effective pollinator conservation in agroecosystems.\n\nBy combining 22 datasets from 13 publications conducted in nine temperate countries (20 European, 2 North American), we investigated if mass-flowering crop flowering time (early or late season), bloom state (during or after crop flowering) and extent of non-crop habitat cover in the landscape moderated the effect of mass-flowering crop cover on wild pollinator abundance and species richness in mass-flowering crop and non-crop habitats.\n\nDuring bloom, wild bee abundance and richness are negatively related to mass-flowering crop cover. Dilution effects were predominant in crop habitats and early in the season, except for bumblebees, which declined with mass-flowering crop cover irrespective of habitat or season. Late in the season and in non-crop habitats, several of these negative relationships were either absent or reversed. Late-season mass-flowering crop cover is positively related to honeybee abundance in crop habitats and to other bee abundance in non-crop habitats. These results indicate that crop-adapted species, like honeybees, move to forage and concentrate on late-season mass-flowering crops at a time when flower availability in the landscape is limited, potentially alleviating competition for flower resources in non-crop habitats. We found no evidence of pollinators moving from mass-flowering crop to non-crop habitats after crop bloom.\n\n<i>Synthesis and applications</i>: Our results confirm that increasing early-season mass-flowering crop cover dilutes wild pollinators in crop habitats during bloom. We find that dilution effects were absent late in the season. While mass-flowering crop cultivation alone is unlikely to be sufficient for maintaining pollinators, as part of carefully designed diverse crop rotations or mixtures combined with the preservation of permanent non-crop habitats, it might provide valuable supplementary food resources for pollinators in temperate agroecosystems, particularly later in the season when alternative flower resources are scarce.\n</p>","author":"L. G. A. Riggi, \nC. A. Raderschall, \nT. P. M. Fijen, \nJ. Scheper, \nH. G. Smith, \nD. Kleijn, \nA. Holzschuh, \nG. Aguilera, \nI. Badenhausser, \nS. Bänsch, \nN. Beyer, \nE. J. Blitzer, \nR. Bommarco, \nB. Danforth, \nJ. P. González‐Varo, \nH. Grab, \nG. Le Provost, \nK. Poveda, \nS. G. Potts, \nM. Rundlöf, \nI. Steffan‐Dewenter, \nT. Tscharntke, \nM. Vilà, \nC. Westphal, \nÅ. Berggren, \nO. Lundin","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"609f49f8f0a6e015adad99c169915222f5d1753339f16fcdf20737c7f452096a","category":"Environment"}