{"title":"BBEdit 14","link":"https://www.barebones.com/support/bbedit/notes-14.0.html","date":1628516854000,"content":"\n<p>To me, version 14 feels like the biggest major release of BBEdit in many years. For programmers, there’s a major new feature: <a href=\"https://www.barebones.com/support/bbedit/lsp-notes.html\">Language Server Protocol (LSP) support</a>, that, basically, adds a slew of IDE-style functionality for code completion, refactoring, and linting. There are also new language modules for R, Go, Lisp, and Rust.</p>\n\n<p>For everyone, there’s a new “notes” feature. From the release notes:</p>\n\n<blockquote>\n  <p>You know that thing where you have a whole bunch of untitled\ndocuments open, because it’s so easy to make one and type some\nnotes, and then just leave it open? And you rely on BBEdit’s\namazing crash recovery and document restoration to not lose\nyour carefully kept notes? You can keep doing that if you want,\nbut we have a new feature to make the whole thing faster and\neasier: Notes.</p>\n\n<p>Notes are mostly like ordinary text documents, except that you\ndon’t have to remember to save them or even make up a name if you\ndon’t want to. BBEdit keeps notes all together in a “notebook”.\nNotes exist on disk as text files; there’s no secret file format\ninvolved. […]</p>\n\n<p>There are many ways to make a note, so you can use whatever fits\nyour workflow and style.</p>\n</blockquote>\n\n<p>Notes default to Markdown, but you can change that to whatever you want (of course).</p>\n\n<p>See also:</p>\n\n<ul>\n<li><p><a href=\"https://sixcolors.com/post/2021/07/bbedit-14-0-arrives-with-notes-and-lsp-support/\">Jason Snell</a>, who wrote a nifty AppleScript that lets him drag an image into a Markdown file in BBEdit 14, and have it (a) upload that file to his server in the background, and (b) insert the Markdown syntax to reference that just-uploaded file.</p></li>\n<li><p><a href=\"https://micro.coyotetracks.org/2021/07/19/bbedit-and-why.html\">Watts Martin</a>, who has a good overview of where BBEdit 14 stands compared to several popular competing programming text editors.</p></li>\n</ul>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/08/09/bbedit-14\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"60a1c90de6a70e02451af27897e18142df36046ac3b54e8777b78b68a9d04a0c","category":"Tech"}