{"title":"What to Expect From Apple's September 12 Event: iPhone 15, Apple Watch Ultra 2, USB-C AirPods and More","link":"https://www.macrumors.com/guide/what-to-expect-apple-fall-event-2023/","date":1694209687000,"content":"Apple's iPhone-centric 2023 fall event is set to begin in just a few days. We've been hearing rumors about what we can expect to see for months now, so we have a good idea of what's coming.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThis guide highlights everything that we're expecting to see Apple debut at its \"Wonderlust\" event on September 12.\r<br />\n\r<br />\n<h2><a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15 and iPhone 15 Plus</a></h2>\r<br />\nApple will continue with its four-iPhone lineup in 2023, and the standard <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> models will be available in 6.1 and 6.7-inch sizes, similar to last year. The ‌iPhone 15‌ and ‌iPhone 15‌ Plus will look almost identical to the <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> and ‌iPhone 14‌ Plus, with one major exception - a USB-C port.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/iPhone-15-Colors-Mock-2-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nRather than a Lightning port, the ‌iPhone 15‌ models will adopt USB-C, which will allow iPhones, iPads, and Macs to share a charger and a charging cable. Apple is making this change due to regulatory changes in Europe that require electronics to have a standardized charging port, but USB-C technology will be implemented worldwide.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/05/iPhone-15-to-Switch-From-Lightning-to-USB-C-in-2023-feature.jpg\" alt width=\"2621\" height=\"1475\" />\r<br />\nLast year's iPhones continued to have a notch, but that's being eliminated with the ‌iPhone 15‌ and ‌iPhone 15‌ Plus. Instead, the new iPhones will adopt the <a href=\"https://www.macrumors.com/guide/dynamic-island/\">Dynamic Island</a> that Apple first used for the <a href=\"https://www.macrumors.com/roundup/iphone-14-pro/\">iPhone 14 Pro</a> and ‌iPhone 14 Pro‌ Max, freeing up more display space.\r<br />\n\r<br />\nThough the ‌iPhone 15‌ and ‌iPhone 15‌ Plus will get the ‌Dynamic Island‌, other display technology like the ProMotion refresh rate and always-on display will remain limited to the Pro models. There's one other small design change, which has to do with the glass back. Frosted glass has historically been a feature for the Pro <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> lineup, but the ‌iPhone 15‌ and ‌iPhone 15‌ Plus are expected to have a frosted glass back instead of a glossy glass back.\r<br />\n\r<br />\nApple is planning new colors for the ‌iPhone 15‌ lineup, and rumors so far suggest that we will see blue, a coral shade that's a cross between orange and pink, a light greenish yellow color, white, and black. We could see color-matched braided USB-C cables to go along with each new ‌iPhone‌.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/usbc-colored-iphone-15-cables.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nCamera technology will see a significant update with the ‌iPhone 15‌ and ‌iPhone 15‌ Plus adopting a 48-megapixel Main camera with an f/1.6 aperture for higher-resolution images and improved quality in low lighting situations. There will also be a 12-megapixel Ultra Wide camera, but this is the same camera in the ‌iPhone 14‌ models with no updates.\r<br />\n\r<br />\nNew Qualcomm 5G modem chips are expected and we could see improved signal, lower latency, and better power efficiency. Apple is developing a new A17 chip for the <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> models, but the standard ‌iPhone 15‌ models will get the A16 chip that's currently in the ‌iPhone 14 Pro‌ and Pro Max.\r<br />\n\r<br />\nWe have so far heard no rumors of improvements to battery life, WiFi speeds, or RAM for the standard ‌iPhone 15‌ models, and pricing is expected to remain the same.\r<br />\n\r<br />\nMore on what to expect from the ‌iPhone 15‌ can be <a href=\"https://www.macrumors.com/roundup/iphone-15/\">found in our iPhone 15 roundup</a>.\r<br />\n\r<br />\n<h2><a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro and iPhone 15 Pro Max</a></h2>\r<br />\nMost of the exciting new changes and feature additions this year are coming to the Pro ‌iPhone‌ models rather than the standard ‌iPhone 15‌ models. As with last year, we are expecting two Pro iPhones, the 6.1-inch ‌iPhone 15 Pro‌ and the 6.7-inch ‌iPhone 15 Pro‌ Max.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/iPhone-15-Pro-Colors-Mock-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThe ‌iPhone 15 Pro‌ models are expected to have some minor design updates, with Apple introducing notably thinner, curved bezels and a new titanium material for the chassis. Rather than stainless steel, the ‌iPhone 15 Pro‌ and Pro Max will feature titanium in colors that include silver, titanium gray, black, and dark blue. Titanium will have a more matte finish than stainless steel, plus the ‌iPhone 15 Pro‌ models could be 10 percent lighter because titanium weighs less than steel.\r<br />\n\r<br />\nWhile there were rumors of volume button changes that Apple was experimenting with, the volume button update did not pan out and there will be no change there. Apple is, however, expected to swap the mute switch for a mute button that will have multiple functions much like the Action button on the <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra</a>.\r<br />\n\r<br />\nCode in <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> suggests the button will be able to toggle on Silent Mode, activate the Camera, turn on the Flashlight, activate a Shortcut, turn on a Focus mode, launch the Translate app, start a Voice Memo, and more.\r<br />\n\r<br />\nLike the ‌iPhone 15‌ models, the ‌iPhone 15 Pro‌ models will get USB-C, but the Pro models are rumored to support faster USB 3.2 (20Gb/s) or Thunderbolt (40Gb/s) transfer speeds. Some of the ‌iPhone 15‌ models (likely the Pro models) are rumored to support charging speeds up to 35W.\r<br />\n\r<br />\nApple is making minor improvements to the Wide Angle and Telephoto cameras of both Pro models to boost low-light performance, but the Main 48-megapixel camera isn't expected to see any improvements. The ‌iPhone 15 Pro‌ Max will get the biggest new camera feature, a periscope zoom function for the telephoto lens. Optical zoom right now is limited to 3x, but with periscope technology, Apple is expected to bring that to 5x or 6x zoom.\r<br />\n\r<br />\nWhile the standard ‌iPhone 15‌ models will use the A16 chip, the ‌iPhone 15 Pro‌ and ‌iPhone 15 Pro‌ Max will be equipped with the A17 chip, built on a new 3-nanometer process. This will be the first chip in several years built on a new node, and it should bring notable performance and efficiency improvements. An increase in battery life is expected. \r<br />\n\r<br />\nApple will use the same 5G Qualcomm chip across its entire ‌iPhone 15‌ lineup, and there are also rumors of a new \"U2\" Ultra Wideband chip that will integrate with the Vision Pro headset coming out next year. The Pro models will get Wi-Fi 6E, the newest and fastest Wi-Fi protocol that works with the 6GHz band. Up to 2TB of storage might be available, and the Pro models will have 8GB RAM, up from 6GB in last year's Pro models. \r<br />\n\r<br />\nThe ‌iPhone 15 Pro‌ and Pro Max have a rich feature set, and rumors suggest it's going to bring a price increase. Multiple sources have said Apple is planning a price hike, but it's not yet clear how much. The new models could be $100 more expensive, which would see the ‌iPhone 15 Pro‌ starting at $1,099 and the ‌iPhone 15 Pro‌ Max starting at $1,199.\r<br />\n\r<br />\nMore information on what to expect from the ‌iPhone 15 Pro‌ and ‌iPhone 15 Pro‌ Max <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">can be found in our roundup</a>.\r<br />\n\r<br />\n<h2><a href=\"https://www.macrumors.com/guide/apple-watch-series-9/\">Apple Watch Series 9</a></h2>\r<br />\nThere's a new Apple Watch coming this year, but there's not much to look forward to with this iterative update. We are not expecting any new design changes or new health-related features.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/Apple-Watch-Series-9-Pink-Aluminum-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nIn fact, the refresh will focus on the internals, mainly a new processor. There's going to be a new S9 chip that's built on the A15 technology, and it will be the first notable update to the Apple Watch chip since the Apple Watch Series 6.\r<br />\n\r<br />\nPerformance will be improved on the <a href=\"https://www.macrumors.com/guide/apple-watch-series-9/\">Apple Watch Series 9</a>, and we could also see an increase in battery life. The ‌Apple Watch Series 9‌ is also <a href=\"https://www.macrumors.com/2023/09/08/series-9-and-ultra-2-to-feature-sensors-and-more/\">expected to include</a> an updated optical heart rate sensor and a new \"U2\" Ultra Wideband chip that will offer better location precision.\r<br />\n\r<br />\nThere might be a new pinkish color for the aluminum version of the Series 9, and Apple might be planning to introduce a new type of band with woven fabric and a magnetic buckle. There have also been rumors that leather bands are being phased out in favor of more eco-friendly options.\r<br />\n\r<br />\nMore on the Series 9 and what we're expecting can be found in our <a href=\"https://www.macrumors.com/guide/apple-watch-series-9/\">Apple Watch Series 9 guide</a>.\r<br />\n\r<br />\n<h2><a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/#whats_next_for_the_apple_watch_ultra\">Apple Watch Ultra 2</a></h2>\r<br />\nThe ‌Apple Watch Ultra‌ is expected to get a refresh in 2023, but we are not expecting new functionality. The device will get <a href=\"https://www.macrumors.com/2023/09/08/series-9-and-ultra-2-to-feature-sensors-and-more/\">the same S9 chip</a> that's coming to the ‌Apple Watch Series 9‌, the updated Ultra Wideband chip, and the new heart rate sensor, but if any other features are planned, we don't know about them.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/apple-watch-ultra-blue.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nOne leaker has suggested the second-generation ‌Apple Watch Ultra‌ might be lighter than the first-generation, but it is not yet clear if this is accurate. One change might be a new color option, with rumors pointing toward a black titanium shade.\r<br />\n\r<br />\nFor more information, check out our <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/#whats_next_for_the_apple_watch_ultra\">Apple Watch Ultra guide</a>.\r<br />\n\r<br />\n<h2>USB-C AirPods</h2>\r<br />\nThe <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> 2 are expected to be updated with a USB-C charging case to replace the current Lightning case, a change that will coincide with the ‌iPhone 15‌'s adoption of a USB-C port instead of a Lightning port.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/airpods-pro-2-red.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nNo other hardware changes will be included, so count on the same ‌AirPods Pro‌ 2 as before but with an updated charging port.\r<br />\n\r<br />\n<h2>New iPhone Cases</h2>\r<br />\nAccording to multiple sources, Apple <a href=\"https://www.macrumors.com/2023/08/17/apple-may-not-offer-leather-cases-for-iphone-15/\">doesn't plan to manufacture</a> leather cases for the ‌iPhone 15‌ lineup, and will instead adopt a more environmentally friendly material.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/apple-finewoven-case-colors.jpg\" alt width=\"4800\" height=\"2700\" />\r<br />\nThere is a rumor that the new material will be made of a woven material and <a href=\"https://www.macrumors.com/2023/08/30/iphone-15-finewoven-case-rumors/\">will be called</a> \"FineWoven,\" but it is as of yet unclear if that is accurate.\r<br />\n\r<br />\n<h2>Other Possibilities</h2>\r<br />\nWith some of the fall events, there are wildcard products that may or may not be refreshed in September, but this year, there's not much we're expecting beyond the ‌iPhone‌ and Apple Watch.\r<br />\n\r<br />\n<h3>11th-Generation iPad</h3>\r<br />\nThere have been no rumors about a new low-cost <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, but Apple has historically refreshed the tablet on an annual basis. It's possible we're going to see an 11th-generation ‌iPad‌, but not guaranteed.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/purple-ipad.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\n\r<br />\n<h2>Possibly Coming Later This Year</h2>\r<br />\nThe ‌iPhone 15‌ models and ‌Apple Watch Series 9‌ may not be the last products we see in 2023. The first M3 Macs could be introduced before the end of the year, with Apple rumored to be <a href=\"https://www.macrumors.com/2023/07/17/apple-m3-macs-october-event/\">planning to introduce</a> an M3 13-inch <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>, M3 13-inch MacBook Pro, and M3 <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a>. <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> says M3 Macs are coming this year, but Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> says no M3 Macs <a href=\"https://www.macrumors.com/2023/09/08/kuo-first-m3-macbooks-unlikely-2023/\">will be unveiled</a> until 2024, so it's unclear what might happen.\r<br />\n\r<br />\nIf new Macs are coming in 2023, Apple could hold an October event or could release the M3 Macs via press release later in the year.\r<br />\n\r<br />\n<em>Bloomberg</em>'s ‌Mark Gurman‌ also believes there is a possibility that a new <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a> will be released in 2023. If so, we could perhaps see it in October.\r<br />\n\r<br />\n<h2>Not Coming Yet</h2>\r<br />\nWith the exception of the 11th-generation ‌iPad‌, no other iPads are getting a refresh in 2023. The <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> and <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a> are going to get updated, but not until 2024.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/12/m3-feature-black.jpg\" alt width=\"1810\" height=\"1018\" />\r<br />\n<ul><li><a href=\"https://www.macrumors.com/2023/09/04/what-not-to-expect-apple-september-iphone-15-event/\">What <em>Not</em> to Expect at Apple’s ‘Wonderlust’ September 12 Event</a></li></ul>\r<br />\n<h2>How to Watch</h2>\r<br />\nApple's \"Wonderlust\" event will start at 10:00 a.m. Pacific Time on Tuesday, September 12. Apple will <a href=\"https://www.apple.com/apple-events/\">livestream the event on its website</a> and <a href=\"https://www.youtube.com/watch?v=ZiP1l7jlIIA\">on YouTube</a>, plus the livestream will be available through the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> app on supported devices.\r<br />\n\r<br />\n<div></div>\r<br />\nFor those unable to watch the livestream, MacRumors will be providing full event coverage on MacRumors.com and the <a href=\"https://twitter.com/macrumorslive\">MacRumorsLive Twitter account</a>, plus we'll have a deeper look into all the announcements later in the week.<br />This article, \"<a href=\"https://www.macrumors.com/guide/what-to-expect-apple-fall-event-2023/\">What to Expect From Apple's September 12 Event: iPhone 15, Apple Watch Ultra 2, USB-C AirPods and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/what-to-expect-from-apples-september-12-event-iphone-15-apple-watch-ultra-2-usb-c-airpods-and-more.2400848/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"60a549c92af98a585e3d276307e3cc64ce6276c081ca141420a266b16aa8069d","category":"Apple"}