{"title":"Remote sensing in forestry: current challenges, considerations and directions","link":"https://academic.oup.com/forestry/article/97/1/11/7159227?rss=1","date":1683676800000,"content":"<span><div>Abstract</div>Remote sensing has developed into an omnipresent technology in the scientific field of forestry and is also increasingly used in an operational fashion. However, the pace and level of uptake of remote sensing technologies into operational forest inventory and monitoring programs varies notably by geographic region. Herein, we highlight some key challenges that remote sensing research can address in the near future to further increase the acceptance, suitability and integration of remotely sensed data into operational forest inventory and monitoring programs. We particularly emphasize three recurrent themes: (1) user uptake, (2) technical challenges of remote sensing related to forest inventories and (3) challenges related to map validation. Our key recommendations concerning these three thematic areas include (1) a need to communicate and learn from success stories in those geographic regions where user uptake was successful due to multi-disciplinary collaborations supported by administrative incentives, (2) a shift from regional case studies towards studies addressing ‘real world’ problems focusing on forest attributes that match the spatial scales and thematic information needs of end users and (3) an increased effort to develop, communicate, and apply best-practices for map and model validation including an effort to inform current and future remote sensing scientists regarding the need for and the functionalities of these best practices. Finally, we present information regarding the use of remote sensing for forest inventory and monitoring, combined with recommendations where possible, and highlighting areas of opportunity for additional investigation.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"60aa63478aaaa4c44e46794d5a79d07bdc002ecfc1455ffeb36206b0e48fa1f6","category":"Environment"}