{"title":"Annemiek van Vleuten solos to victory at the Tour of Flanders","link":"https://cyclingtips.com/2021/04/annemiek-van-vleuten-solos-to-victory-at-the-tour-of-flanders/","date":1617553832000,"content":"<p>Annemiek van Vleuten (Movistar) soloed to her second career Tour of Flanders victory on Sunday. Ten years after she took her first title, Van Vleuten attacked a group of favorites over the top of the Paterberg and held on to take the victory in Oudenaarde. Behind the European champion, Lisa Brennauer (Ceratizit-WNT) and Grace Brown (Team BikeExchange) sprinted to second and third, respectively. </p>\n\n\n\n<p>&#8220;I think I was waiting for nine years after my 2011 victory,&#8221; Van Vleuten said at the finish. &#8220;It was so cool to re-watch that and then to do it again, and especially for my new team Movistar I am super super proud. The girls worked super hard for me and to finish it off like this &#8230; I think we will celebrate big tonight.&#8221;</p>\n\n\n\n<h2>How it happened</h2>\n\n\n\n<p>A number of riders tried for an early break in selections as small as one and as large as five, but nothing stuck. As the race took on the Valenberg with under 62 km to go they remained groupo compacto. </p>\n\n\n\n<p>With so many climbs and challenging sections throughout the race, splits started showing as the race started the final 50 km. Over the Berg Ten Houte, a number of riders were caught out, and although much of the race regrouped before the Kanarieberg, weaknesses had appeared in the peloton. </p>\n\n\n\n<p>Van Vleuten put in her first dig of the day on the Kanarieberg. With 45 km to go a group of favorites emerged. Cecilie Uttrup Ludwig (FDJ Nouvelle Aquitaine Futuroscope) and Anna van der Breggen (SD Worx) were quick to jump on Van Vleuten&#8217;s attack. Behind the world champion, Kasia Niewiadoma (Canyon-SRAM), Elisa Longo Borghini (Trek-Segafredo), Marta Cavalli (FDJ Nouvelle Aquitaine Futuroscope), Marianne Vos (Jumbo-Visma) and a handful of other riders remained on the wheel of Van Vleuten.</p>\n\n\n\n<p>A group of chasers loomed behind the leaders, and the race came back together with 43 km to go. </p>\n\n\n\n<p>Audrey Cordon-Ragot was the next to attack. The French national champion was able to get a bit of freedom from the chasing group as the race continued towards the Taaienberg. Cordon-Ragot hit the climb with 17 seconds on the chasing group. She was able to gain time on the run into the Kruisberg/Hotond and with 33 km to go the gap had grown to over 40 seconds.</p>\n\n\n\n<p>A few attacks peppered the chase before the Kruisberg/Hotond, and as the lone leader hit the base of the cobbled climb she saw a 50-second advantage over the group behind. </p>\n\n\n\n<p>In between the Kruisberg/Hotond and the Oude Kwaremont, Soraya Paladin (Liv Racing) attempted to bridge to Cordon-Ragot. After dangling in front of the peloton for a few kilometers, Paladin was brought back, and with the penultimate climb in sight, the race picked up steam. </p>\n\n\n\n<p>Cordon-Ragot was brought back as the race reached the base of the Oude Kwaremont and Van der Breggen took over at the front. Unfortunately for Belgian fans everywhere, race favourite Lotte Kopecky (Liv Racing) suffered a mechanical at the base of the crucial climb, just as splits began to form ahead of her. </p>\n\n\n\n<p>Van der Breggen took control of the speed, followed by Brown, Uttrup Ludwig, Van Vleuten, Longo Borghini, Cavalli, Brennauer, and Demi Vollering (SD Worx). Behind, Vos and Niewiadoma struggled to hang on. </p>\n\n\n\n<p>On the final climb of the day, Van Vleuten took over control of the race. The European champion crested the top of the climb with a small gap on Van der Breggen and Brennauer. With 10 km to go Van Vleuten was charging to the finish with an 11 second lead on the chasing group of seven. </p>\n\n\n\n<p>The chase was only partially committed as the gap hovered around 11 seconds for a few kilometres, but into the final 2 km, Van Vleuten had distanced herself from those behind. </p>\n\n\n\n<p>Van Vleuten had ample time to celebrate her second Ronde van Vlaanderen victory, ten years after the first, as Brennauer sprinted to second ahead of Brown mere seconds behind the winner. </p>\n\n\n\n<h3>Results</h3>\n\n\n\n<p>1 VAN VLEUTEN Annemiek (Movistar) <br>2 BRENNAUER Lisa (Ceratizit-WNT) <br>3 BROWN Grace (Team BikeExchange) <br>4 LONGO BORGHINI Elisa (Trek-Segafredo)<br>5 VOLLERING Demi (SD Worx)<br>6 CAVALLI Marta (FDJ Nouvelle Aquitaine Futuroscope)<br>7 LUDWIG Cecilie Uttrup (FDJ Nouvelle Aquitaine Futuroscope)<br>8 VAN DER BREGGEN Anna (SD Worx)<br>9 BUJAK Eugenia (Alé BTC Ljubljana) <br>10 FAULKNER Kristen (Team TIBCO &#8211; SVB) </p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/04/annemiek-van-vleuten-solos-to-victory-at-the-tour-of-flanders/\">Annemiek van Vleuten solos to victory at the Tour of Flanders</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"60b15ff2bb0fe777e31cbce4e48f62e02fb7bb6d63c1c5d52245f00f54f8e7a3","category":"Cycling"}