{"title":"Apple acquires content-aware AI video compression startup","link":"https://www.macworld.com/article/1674030/apple-acquires-waveone-ai-video-compression.html","date":1680010717000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple acquired a startup specializing in AI-based video compression earlier this year, it has emerged, but it isn’t yet clear how the company plans to use the technology.</p>\n\n\n\n<p>As is generally the case when Apple makes an acquisition, there has been no official announcement from Cupertino, nor have the terms of the deal been disclosed. In this case, however, a co-founder at the acquired firm, WaveOne, wrote about the acquisition on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.linkedin.com/posts/bob-stankosh-2736794_after-almost-2-years-at-waveone-last-week-activity-7028343745553014785-hFq_/&amp;xcust=1-1-1674030-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">LinkedIn</a>, in a post that <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://techcrunch.com/2023/03/27/apple-acquired-a-startup-using-ai-to-compress-videos/&amp;xcust=1-1-1674030-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">TechCrunch</a> discovered and reported on this week:</p>\n\n\n\n<p>“Last week we finalized the sale of the company to Apple. We started our journey at WaveOne, realizing that machine learning and deep learning video technology could potentially change the world. Apple saw this potential and took the opportunity to add it to their technology portfolio.”</p>\n\n\n\n<p>Aside from the LinkedIn announcement, which evidently didn’t make much of a splash when it was originally posted, TechCrunch has also spotted that several former WaveOne employees now work on machine learning at Apple. Despite a lack of official comment from Apple itself, the cat is very much out of the bag.</p>\n\n\n\n<p>In a profile of WaveOne back in 2020, TechCrunch explained how the company was using machine-learning hardware like Apple’s Neural Engine to accelerate and streamline video compression on mobile devices. </p>\n\n\n\n<p>What we don’t know for sure is how Apple sees the acquisition playing into its long-term strategy, although there are obvious ways the company could benefit. AI is an area of growing importance within the tech sector, but most companies are focusing on (or talking about focusing on) creative tools along the lines of ChatGPT, and improved smart assistants. WaveOne’s work, meanwhile, is on the machine learning side and focuses on pragmatic solutions to specific problems. As TechCrunch explains, WaveOne’s flagship invention was a “content-aware” method for analyzing video files and learning the best way to compress them–prioritizing faces at the expense of boring background elements, for example.</p>\n\n\n\n<p>As useful as it is, that’s hardly likely to feed into <a href=\"https://www.macworld.com/article/1662031/apple-siri-language-generation-ai-chatgpt.html\">developments to Siri</a>, or to help pave the way to a ChatGPT competitor. But optimizing Apple’s TV+ streaming service by reducing its data by just a few percent could lead to major cost savings or improvements to resolution or framerates.</p>\n\nStreaming Media</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"60b4f7a4d8c115cf52363baae84574e83f13a6811a76a61cb620b93f46877175","category":"Apple"}