{"title":"Colnago is auctioning ‘digital artwork’ of eight historic bikes – starting at €5,515","link":"https://www.bikeradar.com/news/colnago-nft-auction/","date":1620303055000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Colnago_C64_NFT_side_sx-49e8542.jpg?quality=45&amp;resize=620,413\" />                                            <p><span>Non-fungible tokens, or NFTs, are the latest hot digital tech. They use blockchain technology to create unique digital artwork that is verifiably authentic and tradeable – and the amount of money being spent is staggering.  </span></p>\n<p>Last<span> month, an NFT artwork was sold at auction by Christie’s for $69 million. </span><span>Now Colnago has got in on the act, with an auction of a one-off NFT artwork on the <a href=\"https://opensea.io/accounts/colnago\" target=\"_blank\">OpenSea platform</a>.</span></p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Colnago C35 Chrono: UCI-legal? We think not.</span></figcaption><span></span></div>\n<p><span>The Colnago C64 NFT artwork will feature eight key models from Colnago’s past, including the C35 Chrono team time-trial bike from 1994, which had an aero 20in front wheel, the Colnago Concept from 1988 with carbon fibre lugs and an internal gearbox, and Tadej Pogačar’s 2020 <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a>-winning <a href=\"https://www.bikeradar.com/reviews/colnago-v3rs-review/\">V3Rs</a>. </span></p>\n<p><span>The Colnago C64 NFT auction will open on 11 May 2021 with a starting price of €5,515, chosen because it’s the retail price of a custom-painted <a href=\"https://www.bikeradar.com/reviews/components/bike-frames/road-bike-frames/colnago-c64-first-ride-review/\">Colnago C64</a> frameset. This is all digital artwork, remember.</span></p>\n<p><span>The auction will close on 25 May, with the highest bidder having exclusive rights in perpetuity to the artwork.</span></p>\n<p><span>Manolo Bertocchi, head of marketing at Colnago says: “We developed a digital C64 that is truly a celebration of the most important innovations and victories in Colnago’s history including the first carbon bike and the first concept bike to feature an internal transmission.</span></p>\n<p><span>“The greatest thing about this is that our C64 NFT will never be replicated by us as a physical frame – it will only be digital.”</span></p>\n<p><span>You’ll have to decide whether that’s a suitable substitute for a real Colnago.</span></p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The 1988 Colnago Concept came with an internal gearbox.</span></figcaption><span></span></div>\n<section><div>\n        <h2>Colnago C64 NFT artwork auction</h2>\n<p>Colnago is creating eight ‘digital artworks’ as part of the C64 NFT auction.</p>\n<h3>Colnago Concept</h3>\n<p>First designed in 1988 in collaboration with Ferrari, it featured a lugged carbon fibre frame, a gearbox integrated with the crankset, three-spoke carbon fibre wheels (designed by Enzo Ferrari), an adjustable stem and hydraulic braking.</p>\n<h3>Colnago Bititan</h3>\n<p>The Bititan was a descendent of the Colnago Carbitubo and featured a titanium split down tube. Abraham Olano won the 1995 UCI Road World Championship on this bike.</p>\n<h3>Colnago C59</h3>\n<p>A replica of the custom C59 ridden by Anthony Charteau into Paris to commemorate his King of the Mountains win at the 2010 Tour de France.</p>\n<h3>Colnago C35 Crono TTT</h3>\n<p>Another bike designed in collaboration with Ferrari and presented on the Fiorano circuit. Designed with aerodynamics at the forefront, with a monocoque carbon frame and small 20in front wheel. Used by the Italian quartet to win the team time trial at the Palermo World Championships in 1994.</p>\n<h3>Colnago Super Profil</h3>\n<p>A bike that went through multiple iterations and featured crimped tubes. Ridden to victory in the 1982 UCI Road World Championships at Goodwood by Beppe Saronni, and subsequently at the Giro di Lombardia, Milan-San Remo and Giro d’Italia in 1983.</p>\n<h3>Colnago Oval CX</h3>\n<p>The bike that, in 1994, Tony Rominger rode to set the hour record on the Bordeaux velodrome. Made from steel Oval CX tubing squashed vertically to improve aerodynamics and with a small 26in front wheel to allow Rominger to adopt a tucked position. The bike also featured a 60-tooth chainring.</p>\n<h3>Colnago V3Rs</h3>\n<p>The special edition V3Rs with custom paint created for Tadej Pogačar’s victory in the 2020 Tour de France.</p>\n<h3>Colnago C40</h3>\n<p>A frame that anticipated the future, according to Colnago, with carbon fibre lugs and tubes (plus alloy rear dropouts) that allowed for a made-to-measure frame. The first carbon frame to win Paris-Roubaix (Franco Ballerini, 1995), with four subsequent wins until 2000: once again with Ballerini, two with Johan Museeuw and one with Andrea Tafi.</p>\n<p>\n\n    </p></div>\n    </section>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"60b655848460de9267ece16e8a79a2da9285ab75ba1641dbdb5d60e51c01793b","category":"Cycling"}