{"title":"Research on the Synergistic Effects and Driving Mechanisms of Urban Agglomeration Spatial Expansion: A Case Study of Beibu Gulf in Guangxi, China","link":"https://www.preprints.org/manuscript/202409.1829/v1","date":1727162428000,"content":"The spatial expansion of urban agglomerations is a direct manifestation of regional urbanization, reflecting the changes in scale and morphological characteristics of urban in temporal and spatial dimensions, which affects the efficiency of regional urbanization. This study employed a range of analytical techniques, including the urban spatial intensity index, center-of-gravity model, synergy index, inverse distance weighting interpolation method, and Geodetector, to examine the spatiotemporal evolution pattern and driving factors of the Beibu Gulf Urban Agglomeration in Guangxi, China between 2012 and 2022. The findings indicate that: (1) The Beibu Gulf Urban Agglomeration in Guangxi has been in a stable expansion trend over the past decade. However, the polarization effect of the central city space has gradually weakened, and the spatial expansion differences between cities have gradually narrowed, indicating an extensional development mode. (2) The economic and social gravity centers show a tendency of \"eastward and southward\" migration, which is opposite to the direction of the urban gravity center's displacement. The displacement directions of population and ecological gravity centers are roughly consistent with that of urban center. The distribution of economic and social resources are not aligned with the configuration of urban development, and the trajectory of the center of gravity of various development dimensions has shifted. (3) Economic and social expansion is significantly faster than population and ecology, but slower than urban expansion. The intensity of urban expansion is inconsistent with the distribution of synergies. The spatial differences in synergies between cities are gradually narrowing. The central city's radiation-driven role is insufficient. The development of nodal cities is less than expected. However, the benefits of urbanization in coastal cities are constantly being strengthened. (4) The disposable income of urban residents and per capita arable land area are the primary driving forces of urban expansion, while population density and urban green space area are significant contributors to urban expansion. Based on the above findings, it is recommended that the Beibu Gulf Urban Agglomeration of Guangxi should continue to enhance the scale efficiency of population agglomeration, optimize economic development and industrial resource allocation, promote urban-rural integration, strengthen inter-city connections, optimize spatial layout, and improve the overall production and living efficiency of regional cities and towns.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"60c219f8b1e5b6f5d044fa9d3b781e98587331154defc020144e1ff5310086ba","category":"Interdisciplinary"}