{"title":"Outcomes of different steroid dosing regimens in critical Covid-19 pneumonia at a Kenyan hospital: A retrospective cohort study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307265","date":1724162400000,"content":"<p>by John Otieno Odhiambo, Jasmit Shah, Nancy Kunyiha, Charles Makasa, Felix Riunga</p>\r\nBackground <p>Among therapeutic options for severe and critical COVID- 19 infection, dexamethasone six milligrams once daily for ten days has demonstrated mortality benefit and is guideline recommended at this dose. In practice, variable doses of steroids have been used, especially in critical care settings. Our study aimed to determine the pattern of steroid dosing and outcomes in terms of critical care mortality, occurrence of dysglycaemias, and occurrence of superadded infections in patients with critical COVID-19.</p> Methods <p>A retrospective cohort study was carried out on all eligible patients admitted to the Aga Khan University Hospital, Nairobi, with critical COVID-19 between 1<sup>st</sup> March 2020 and 31<sup>st</sup> December 2021. The intervention of interest was corticosteroids quantified as the average daily dose in milligrams of dexamethasone. A steroid dose of six milligrams once a day was compared to high dose steroid dosing, which was defined as any dose greater than this. The primary outcome measure was ICU mortality and secondary outcomes included occurrence of dysglycaemias, superadded infections and duration of critical care admission.</p> Results <p>The study included 288 patients. The median age was 61.2 years (IQR: 49.7, 72.5), with 71.2% of patients being male. The most common comorbidities were diabetes mellitus (60.7%), hypertension (58%), and heart disease (12.2%). The average oxygen saturation and C-reactive protein at admission were 82% [IQR: 70.0–89.0]and 113.0 [IQR: 54.0–186.0], respectively. Fifty-eight percent of patients received a standard dose (6mg) of steroids. The mortality rate was higher in the high-dose group compared to the standard-dose group; however, the difference was not statistically significant (47.9% vs 43.7% p = 0.549). The two most common steroid associated adverse effects were uncomplicated hyperglycemia (62.2%) and superimposed bacterial pneumonia (20.1%). The high-dose group had a higher incidence of uncomplicated hyperglycemia compared to the standard-dose group (63.6% vs 61.1%). However, the incidence of diabetic ketoacidosis was lower in the high dose group (0.6% vs 6.6%). Oxygen saturation at admission was associated with survival where it was lower among non-survivor patients with critical COVID-19.</p> Conclusion <p>The study found that high-dose steroids in the treatment of critically ill patients with COVID-19 pneumonia did not confer any mortality benefit and were associated with an increased risk of dysglycemia and superimposed infections.</p>","author":"John Otieno Odhiambo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"60c498b12b1e6873d182e6890acf9c77ab17d38b15c80490f36b9488f5ffe66f","category":"Interdisciplinary"}