{"title":"Neuropeptide Y receptor activation preserves inner retinal integrity through PI3K/Akt signaling in a glaucoma mouse model","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae299/7721204?rss=1","date":1721952000000,"content":"<span><div>Abstract</div>Neuropeptide Y (NPY), an endogenous peptide composed of 36 amino acids, has been investigated as a potential therapeutic agent for neurodegenerative diseases due to its neuroprotective attributes. This study investigated the neuroprotective effects of NPY in a mouse model of glaucoma characterized by elevated intraocular pressure (IOP) and progressive retinal ganglion cell degeneration. Elevated IOP in mice was induced through intracameral microbead injections, accompanied by intravitreal administration of NPY peptide. The results demonstrated that NPY treatment preserved both the structural and functional integrity of the inner retina and mitigated axonal damage and degenerative changes in the optic nerve under high IOP conditions. Further, NPY treatment effectively reduced inflammatory glial cell activation, as evidenced by decreased expression of glial fibrillary acidic protein and Iba-1. Notably, endogenous NPY expression and its receptors (NPY-Y1R and NPY-Y4R) levels were negatively affected in the retina under elevated IOP conditions. NPY treatment restored these changes to a significant extent. Molecular analysis revealed that NPY mediates its protective effects through the mitogen-activated protein kinase (MAPK) and PI3K/Akt signaling pathways. These findings highlight the therapeutic potential of NPY in glaucoma treatment, underscoring its capacity to preserve retinal health, modulate receptor expression under stress, reduce neuroinflammation, and impart protection against axonal impairment.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"60c686e5c0519fbeefcad669c8dbfeefbe252ae2bd65be2f735e7a71ab310c22","category":"Interdisciplinary"}