{"title":"A 3E analysis of a multi‐power generation system employing CO2, LNG, and Organic Rankine cycles","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14349?af=R","date":1704282330000,"content":"<h2>Abstract</h2>\n<p>One avenue in increasing the energy efficiency of energy systems is through utilizing the thermal energy of flue gases of industrial plants. On this thread, herein, a novel combined cascade cycle for heat recovery of flue gases of an industrial plant is proposed comprising of an organic Rankine cycle (ORC), high-pressure transcritical CO<sub>2</sub> cycle, transcritical CO<sub>2</sub> cycle, and a liquefied natural gas (LNG) regasification cycle. System analysis is conducted using energy, exergy, and eco-exergy equations. The optimization is carried out using the TOPSIS multi-objective method. Exergy efficiency, net output work, and cost are identified as the optimization objectives. The optimization process focused on fine-tuning variables including the vapor generator pinch point temperature, ORC turbine inlet pressure, ORC condenser pressure, and ORC condenser pinch point temperature, with optimal values gauged at 19.31°C, 29.59 bar, 1.413 bar, and 14.52°C, respectively. The preheater had the largest exergy destruction share, followed by the heat exchanger unit. The analysis showed that the ORC condenser pressure and temperature difference between two working fluids in the heat exchanger were the most critical parameters in the proposed cycle, significantly affecting the system performance. Accordingly, the exergy efficiency, net output work, and cost values in the optimal state were equal to 15.2%, 6416 kW, and 0.7457 $/s, respectively. The advantages of the proposed system include efficient heat recovery through the coupling of the multiple cycles and enhanced energy conversion pertinent to a wider range of temperatures, maximizing the overall energy extraction from the waste heat.</p>","author":"Daryoush Dadpour, \nMahdi Deymi‐Dashtebayaz, \nMostafa Delpisheh, \nSeyed Ali Naghibi Fard","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"60cf785a583b42f773eb50da17c36869bf78a1b97b368d0e3a2d8359ec419731","category":"Environment"}