{"title":"Velio Festival: searching for cycling paradise","link":"https://www.cyclist.co.uk/news/9726/velio-festival-searching-for-cycling-paradise","date":1623059407000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>8 Jun 2021</span></div>    </div></div><p>\nLocated at Cholmondeley Castle in Cheshire, it's everything you'd want from a three-day festival but with a whole load of added cycling</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/06/velio_1.jpeg?itok=FEWp1pnv\" />  </div>\n<div>\n      <p> Looking for a (hopefully) post-<a href=\"/tags/coronavirus\">Covid</a> paradise? You're in luck. From 17th to 20th September, <a href=\"https://velio.cc/\" target=\"_blank\">Velio Festival</a> takes cycling festivals up a gear.</p>\n<p>With all the music, comedy, food, talks and activities you'd want from a standard three-day festival and a whole load of cycling on top, it is quite literally the best of both worlds.</p>\n<p>Whether you want to chill out and take it slow with cycling talks, workshops, demos and exclusive bike releases or rock out the show with music from Everything Everything, Sister Sledge, The Futureheads, The Bootleg Beatles and Fleetmac Wood, it's all kicking off.</p>\n<p>Set against the backdrop of Cholmondeley Castle in Cheshire, there will be 3km, 14km, 30km, 60km and 100km rides to do including Velutopia, which the organiser describe as 'the world's most immersive cycling experience – a closed roads route with actors, music, commentary, a finish line party, spectator podium and fancy dress.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/06/velio_2.jpg?itok=fmW_c5sO\" />  </div>\n</div>\n<p>There will also be an indoor cycling arena with bike fittings, maintenance, coaches and physios also on offer to enhance your experience and if you're worried about bringing your bike there is safe and insured bike storage and bike rental available.</p>\n<p>The entertainment doesn't stop at the music though, with comedy from Jason Manford, Shappi Khorsandi, Marcus Brigstocke and more, as well as the quite frankly ridiculous but immense fun of Bongo's Bingo, and of course Mr Motivator will be doing his thing.</p>\n<p>If that's not for you, there are also DJs, brass bands, film screenings, kids' entertainment or even wellness activities including yoga, meditation, dog therapy, hot tubs, guided walks, wild swimming, organised runs and paddleboarding.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/review/9613/3t-exploro-racemax-boost-gravel-e-bike\">3T launches Exploro RaceMax Boost e-gravel bike</a></div>      <div><a href=\"/3t/strada/3942/3t-strada-review\">3T Strada Review</a></div>      <div><a href=\"/reviews/8257/3t-exploro-racemax-first-ride-review\">3T Exploro RaceMax review</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 115: on sale now!</a></div>    </div></div><p>\nAnd what would a cycling festival be without food and drink? Well, nothing. Thankfully, Velio has 'banquets' from award winning chefs, a boozy brunch, Sunday lunch, wine tasting, cocktail bars and leaving the best for last, a huge coffee programme that's still to be announced.</p>\n<p>Whether you want to camp, which is included with tickets, glamp or stay in your motorhome, Velio accomodates for you (and will pre-erect a tent for you if you don't need <em>that </em>hassle). </p>\n<p>Velio says it's trying to reinvent the wheel and while we can't confirm that to be true yet, it is virtually guaranteed to be a <em>wheely</em> good time.</p>\n<p>For more information and to book tickets now visit <a href=\"https://velio.cc/\" target=\"_blank\">velio.cc</a> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/events\">Events</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"60d1a48bf61115cc1708f70f57b1cffd123f94bd4b213b6d624613a81cb178d6","category":"Cycling"}