{"title":"Early Metabolomic Profiling as a Predictor of Renal Function Six Months after Kidney Transplantation","link":"https://www.preprints.org/manuscript/202410.0257/v1","date":1727947605000,"content":"Background: Kidney transplantation is the therapy of choice for patients with advanced chronic kidney disease; however, predicting graft outcomes remains a significant challenge. Early identification of reliable biomarkers could enhance post-transplant management and improve long-term outcomes. This study aimed to identify metabolomic biomarkers within the first week post-kidney transplantation that predict renal function at six months. Methods: We conducted a prospective study involving 50 adult patients who received deceased donor kidney transplants. Plasma samples collected one-week post-transplant were analyzed using liquid chromatography-mass spectrometry in a semi-targeted metabolomic approach. A Partial Least Squares-Discriminant Analysis (PLS-DA) model identified metabolites associated with serum creatinine &amp;gt;1.5 mg/dL at six months. Metabolites were selected based on a Variable Importance in Projection (VIP) score &amp;gt;1.5, which was used to optimize model performance. Results: The PLS-DA model demonstrated strong predictive performance with an area under the curve (AUC) of 0.958. The metabolites negatively associated with serum creatinine &amp;gt;1.5 mg/dL were 3-methylindole, guaiacol, histidine, 3-indolepropionic acid, and α-lipoic acid. Conversely, metabolites positively associated with worse kidney graft outcomes included homocarnosine, 5-methylcytosine, xanthosine, choline, phenylalanine, kynurenic acid, and L-kynurenine. Conclusions: Early metabolomic profiling post-transplantation shows promise in predicting renal function. Identifying metabolites with antioxidant and anti-inflammatory properties, as well as those that are harmful and could be targeted therapeutically, underscores their potential clinical significance. The link between several metabolites and the tryptophan pathway suggests that further specific evaluation of this pathway is warranted. These biomarkers can enhance patient management and graft survival.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"60d3d20e734f508346ce5f7ebc9ea1aca0ea616e8bc59002ec69867aba7b2ea4","category":"Interdisciplinary"}