{"title":"Juvenile downstream migration patterns of an anadromous fish, allis shad (Alosa alosa), before and after the population collapse in the Gironde system, France","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15647?af=R","date":1712853919000,"content":"<h2>Abstract</h2>\n<p>Diadromous fish have exhibited a dramatic decline since the end of the 20th century. The allis shad (<i>Alosa alosa</i>) population in the Gironde-Garonne-Dordogne (GGD) system, once considered as a reference in Europe, remains low despite a fishing ban in 2008. One hypothesis to explain this decline is that the downstream migration and growth dynamics of young stages have changed due to environmental modifications in the rivers and estuary. We retrospectively analysed juvenile growth and migration patterns using otoliths from adults caught in the GGD system 30 years apart during their spawning migration, in 1987 and 2016. We coupled otolith daily growth increments and laser ablation inductively-coupled plasma mass spectrometry measurements of Sr:Ca, Ba:Ca, and Mn:Ca ratios along the longest growth axis from hatching to an age of 100 days (i.e., during the juvenile stage). A back-calculation allowed us to estimate the size of juveniles at the entrance into the brackish estuary. Based on the geochemistry data, we distinguished four different zones that juveniles encountered during their downstream migration: freshwater, fluvial estuary, brackish estuary, and lower estuary. We identified three migration patterns during the first 100 days of their life: (a) Individuals that reached the lower estuary zone, (b) individuals that reached the brackish estuary zone, and (c) individuals that reached the fluvial estuary zone. On average, juveniles from the 1987 subsample stayed slightly longer in freshwater than juveniles from the 2016 subsample. In addition, juveniles from the 2016 subsample entered the brackish estuary at a smaller size. This result suggests that juveniles from the 2016 subsample might have encountered more difficult conditions during their downstream migration, which we attribute to a longer exposure to the turbid maximum zone. This assumption is supported by the microchemical analyses of the otoliths, which suggests based on wider Mn:Ca peaks that juveniles in 2010s experienced a longer period of physiological stress during their downstream migration than juveniles in 1980s. Finally, juveniles from the 2016 subsample took longer than 100 days to exit the lower estuary than we would have expected from previous studies. Adding a new marker (i.e., Ba:Ca) helped us refine the interpretation of the downstream migration for each individual.</p>","author":"Elodie Boussinet, \nDavid José Nachón, \nAldo Sottolichio, \nAude Lochet, \nStefan Stoll, \nGilles Bareille, \nHelene Tabouret, \nChristophe Pécheyran, \nMarie‐Laure Acolas, \nFrançoise Daverat","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"60dc6b8073fa7a72826f9bfcf56ec096d2bdfc5c3bb604dd38ed6c275154dae8","category":"Environment"}