{"title":"Towers and power: A complete history of Apple’s pro Macs (and Mac Pros)","link":"https://www.macworld.com/article/670425/complete-history-of-pro-macs-apple-lisa-quadra.html","date":1686040200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple has a rich, if checkered, history of releasing new Macs for hardcore computing professionals. Now that the Mac Pro has had a long-awaited revamp to Apple Silicon, let’s remember the days when pro Macs were towering beasts using more metal than the Guggenheim Museum in Bilbao and more plastic than a nursery full of Lego bricks.</p>\n\n\n\n<p>Today some pro Mac users are happy with a flimsy bit of aluminum like the <a href=\"https://www.macworld.com/article/1480091/mac-mini-m2-pro-review.html\">Mac mini</a>. Wimps. We demand something that looks like it contains a nuclear reactor. It needs to be bigger than a suitcase with warning stickers all over it, hotter than a barbeque and noisier than a drag car. Yes, something like the old Power Mac G5. Here’s a look at Apple’s beefy, bodacious, and behemoth pro Macs over the years.</p>\n\n\n\n<h2>Apple I (1976-1977) </h2>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3443854/apple-1-computer.jpg\" alt=\"Apple I computer\" title=\"Apple I computer\" loading=\"lazy\" /></figure></div>\n\n\n\n<p>Apple’s first computer wasn’t technically a “Mac,” of course. The Apple I’s users didn’t work in Final Cut, Aperture or Adobe Creative Suite. Indeed they would have fainted at the very thought of MacPaint. And it’s hard to call them “professional”. Some of them looked like they’d lived wild in a forest for the previous half of their lives—and that was just the guys from Apple. </p>\n\n\n\n<p>The <strong>Apple I</strong> was no slouch, but it wasn’t pro by today’s definition. It was invented by Homebrew Computer Club members Steve Wozniak and Steve Jobs—and we all know that “homebrew” is by definition not professional. These computer hobbyists weren’t pioneering pro machines, they were turning pro machines into personal computers for the home.</p>\n\n\n\n<p>So we’re including it here as an homage—and plus, the Apple I was certainly big enough to qualify for tower status. It was so open to user tinkering you had to build the case yourself from bits of wood.</p>\n\n\n\n<h2>Apple III (1980-1983)  </h2>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3443854/apple-III-computer.jpg\" alt=\"Apple III computer\" title=\"Apple III computer\" loading=\"lazy\" /></figure></div>\n\n\n\n<p>While the Apple I looked like a Victorian dressing table, the Apple II looked like a smart electric typewriter. While used professionally, it doesn’t quite pass the grade at looking powerful enough for true Pro status. The <strong>Apple III</strong>, on the other hand, looked much more impressive and cost at least $4,000. Rather than allow users to install upgrades within its case you could buy extras that stacked on top of the computer increasing its height to the extent that you had to put extra cushions on your chair.</p>\n\n\n\n<p>The Apple III Plus featured a built-in clock but even that advanced feature was not enough to save it from the scrapheap.</p>\n\n\n\n<h2>Lisa (1983-1985)</h2>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3443854/Apple-lisa.jpg\" alt=\"Apple Lisa computer\" title=\"Apple Lisa computer\" loading=\"lazy\" /></figure></div>\n\n\n\n<p>At $10,000, the pre-Mac <strong>Lisa</strong> was Apple’s most expensive computer and aimed at large businesses. So far, so pro. Sadly, that’s where its pro credentials fade away as it was a closed all-in-one system that looked like ET’s head rather than an imperial Walker from Star Wars.</p>\n\n\n\n<p>Just before it was driven off to the landfill, Apple rebranded the Lisa as Macintosh XL, which is certainly a more Pro name.</p>\n\n\n\n<h2>Apple IIgs (1986-1992)</h2>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3443854/apple-iigs.jpg\" alt=\"Apple IIgs computer\" title=\"Apple IIgs computer\" loading=\"lazy\" /></figure></div>\n\n\n\n<p>1986’s <strong>Apple IIgs</strong> was the first Apple computer to nail the deep-box look (it had learned well from the Mac) and allowed you to swap in and out various third-party expansions, including 8MB of RAM and a processor upgrade that pumped iron at 18MHz. With an M.</p>\n\n\n\n<h2>Mac II  (1987-1990)</h2>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3443854/mac-II.jpg\" alt=\"Apple Mac II computer\" title=\"Apple Mac II computer\" loading=\"lazy\" /></figure></div>\n\n\n\n<p>The original Mac looked way too friendly to be a professional machine. It had a goofy smile and said “Hello.” We had to wait three years before we got the super-expandable <strong>Mac II</strong> that came in a case the size of a Christmas hamper. </p>\n\n\n\n<p>It didn’t say Hello. It barged past you, knocking you to the floor, and it didn’t look back to apologize. It boasted six (six!) NuBus slots for extra bits and pieces, such as a new graphics card that could display colors. If you wanted one with 1MB of RAM and a 40MB hard disk it would set you back $5,500.</p>\n\n\n\n<p>The Mac II had many iterations before it was retired. The <strong>Mac IIx</strong> and <strong>Mac IIcx</strong> were in a smaller box with just three NuBus slots but still cost a small fortune. 1989’s <strong>Mac IIici</strong> was a box so high that it was nearly a cube. If Steve Jobs had still been at Apple I’m sure it would have been. It was the first Mac to have built in-color video circuitry and despite costing $6,700 was one of the most popular Macs ever.</p>\n\n\n\n<p>Finally, the <strong>Mac IIfx</strong> was the Daddy of the pro Macs, costing a minimum of $12,000 and accommodating two floppy drives and eight high-speed 64-pin RAM slots. It also had a range of cool codenames, including Stealth, BlackBird, F-16, F-19 and Weed-Whacker. If that’s not pro, we don’t know what is.</p>\n\n\n\n<h2>Quadra (1991-1994)  </h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Macintosh-Quadra-950.jpg?quality=50&amp;strip=all\" alt=\"Apple Macintosh Quadra 950\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Macintosh-Quadra-950.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Macintosh-Quadra-950.jpg?resize=300%2C188&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Macintosh-Quadra-950.jpg?resize=768%2C480&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"640\" /></figure><p>Apple</p></div>\n\n\n\n<p>Frank Casanova, who sported a curious Brian May-like head of hair, was the brains behind the IIfx and his Quadra range continued the pro features. This time around, the case expanded vertically in proper tower fashion, starting with the <strong>Quadra 700</strong>. The name Quadra was in part chosen from the major quadriceps muscle group to show off its strength. We’ll ignore the wimpy-looking Quadra 605/610, but bow before the 700, mini-tower <strong>Quadra 800</strong>, and mighty $7,500 <strong>Quadra 900/950</strong> machines, which had three internal bays and stood 18.6 inches high—a sequoia among computer saplings.</p>\n\n\n\n<h2>Mac clones (1995-1997)</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Power-Computing-Mac-clone.jpg?quality=50&amp;strip=all\" alt=\"Power Computing Mac Clone tower\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Power-Computing-Mac-clone.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Power-Computing-Mac-clone.jpg?resize=300%2C188&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Power-Computing-Mac-clone.jpg?resize=768%2C480&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"640\" /></figure><p>Power Computing</p></div>\n\n\n\n<p>Apple made the decision to let other manufacturers make and sell Mac hardware too late to stop crappy Windows PCs from taking over the world. And it then made the mistake of letting the Mac clone makers produce pro computers—such as the <strong>Power Computing PowerTower Pro</strong>—more powerful than Apple’s own and with a proper Pro Power name. On his return to Apple Steve Jobs took one look and quickly killed off the clones, and we were back with a not-so-brilliant range of professional Macs to choose from. (But not for long.)</p>\n\n\n\n<h2>Power Mac (1994-1998)  </h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-9500.jpg?quality=50&amp;strip=all\" alt=\"Apple Power Mac 9500 tower\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-9500.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-9500.jpg?resize=300%2C188&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-9500.jpg?resize=768%2C480&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"640\" /></figure><p>Apple</p></div>\n\n\n\n<p>The first Power Macs looked much like the Quadras they replaced but packed new PowerPC processors. The <strong>Power Mac 8500</strong> was big but, at a mere 15 inches in height, no match for the near-19-inch <strong>Quadra 900</strong>. Even the <strong>Power Mac 9500</strong> measured just 17 inches tall, but it was the most expandable Mac yet, with six PCI slots and seven internal drive bays. Seven! Unlike today where Apple hates the thought of users tinkering under the bonnet, the 9500 didn’t even ship with a graphics card. You <em>had</em> to add your own.</p>\n\n\n\n<p>The later <strong>Power Mac 9600</strong> came in a new-look case, which at 9.7 inches was the widest Mac tower ever, and was the easiest to get inside to add up to six drives, 12 memory chips, and six PCI cards.</p>\n\n\n\n<h2>Power Mac G3 (1998-1999)</h2>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3443854/PowerMac_G3_open-500.jpg\" alt=\"Blue and white Power Mac G3 open\" title=\"Blue and white Power Mac G3 open\" loading=\"lazy\" /></figure></div>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/158791/10g3first_look.html\" target=\"_blank\"><strong>Blue &amp; White Power Mac G3</strong></a> came in easy-to-open iMac-like colored polycarbonate. The Apple logo was squeezed in between the giant “G” and “3” and reminded many of a child’s toy. And it kind of was. The G3 had just four RAM slots, no SCSI, and a very forgettable keyboard and mouse.</p>\n\n\n\n<h2>Power Mac G4 (1999-2004)</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-G4-designs.jpg?quality=50&amp;strip=all\" alt=\"Three types of Apple Power Mac G4\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-G4-designs.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-G4-designs.jpg?resize=300%2C130&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-G4-designs.jpg?resize=768%2C333&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"444\" /></figure><p>Apple</p></div>\n\n\n\n<p>Predictably, Apple followed up the Power Mac G3 with the <a href=\"https://www.macworld.com/article/159541/g4feature.html\" target=\"_blank\"><strong>Power Mac G4</strong></a>. (We’ll ignore the very non-tower <a href=\"https://www.macworld.com/article/159792/cube.html\" target=\"_blank\"><strong>Power Mac G4 Cube</strong></a>.)</p>\n\n\n\n<p>Apple went a bit nuts with the Power Mac G4, launching several variations on its tower design, starting with <strong>Graphite</strong>, moving to <strong>QuickSilver</strong>, and ending up with <strong>Mirrored Drive Doors</strong> with faux air holes. However, the Power Mac G4 looked more impressive and boasted internal FireWire, two separate USB buses, and up to 1.5GB of RAM. And some models were so noisy they earned the nickname “Windtunnel”, giving it extra pro points. Finally, in 2000, it became the first PC to feature Gigabit Ethernet as a standard feature.</p>\n\n\n\n<h2>Power Mac G5 (2003-2005)</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-G5-inside.jpg?quality=50&amp;strip=all\" alt=\"Inside the Apple Power Mac G5\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-G5-inside.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-G5-inside.jpg?resize=300%2C173&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Power-Mac-G5-inside.jpg?resize=768%2C444&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"591\" /></figure><p>Apple</p></div>\n\n\n\n<p>The <strong><a href=\"https://www.macworld.com/article/177665/powermacg5rev.html\" target=\"_blank\">Power Mac G5</a> </strong>really looked the part of a proper professional Mac. Its industrial aluminum case screamed Pro and it looked as good with its door off as on. </p>\n\n\n\n<p>Want more Pro cred? The G5 ran so hot, that the case was divided into four separate thermal zones, each with its own cooling system—in case it melted your desk. Its nine fans occasionally allowed you to pretend that you worked on the deck of an aircraft carrier in a state of emergency.</p>\n\n\n\n<h2>Mac Pro (2006-2013)</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2006.jpg?quality=50&amp;strip=all\" alt=\"Apple Mac Pro 2006 inside\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2006.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2006.jpg?resize=300%2C156&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2006.jpg?resize=768%2C399&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"532\" /></figure><p>Apple</p></div>\n\n\n\n<p>At last, a pro Mac actually named <a href=\"https://www.macworld.com/article/181099/macprofaq.html\" target=\"_blank\"><strong>Mac Pro</strong></a>. Apple had already started calling its skinny laptops Pro instead of Power, so it was long overdue for the far-sturdier desktop behemoths. </p>\n\n\n\n<p>The Mac Pro’s aluminum-enclosure design was little changed from 2003’s Power Mac G5 and, at 20.1 inches, was the tallest Mac tower yet. You could take the side off and use it as the roof for a small building.  The Mac Pro dumped the G5 processor for Intel’s more pro-sounding dual- and quad-core Intel Xeon chips, with city-sized names such as Woodcrest, Clovertown, and Harpertown. </p>\n\n\n\n<p>But, aside from the speedy chips and cheese grater design, it was barely updated and lacked then-current technologies such as SATA III, USB 3, and Thunderbolt, despite some of these being available in punier non-Pro Macs.</p>\n\n\n\n<h2>Pro Mac history: 17in MacBook Pro (2006-2012)</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-MacBook-Pro-17-inch.jpg?quality=50&amp;strip=all\" alt=\"Apple MacBook Pro 17in 2006\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-MacBook-Pro-17-inch.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-MacBook-Pro-17-inch.jpg?resize=300%2C173&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-MacBook-Pro-17-inch.jpg?resize=768%2C442&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"589\" /></figure><p>Apple</p></div>\n\n\n\n<p>Apple had been calling its top-end MacBooks “Pro” since 2006, but it was the frankly giant 17-inch model that truly deserved the title. While all the other MacBook Pro models could be used by amateurs who hog tables at Starbucks, the <a href=\"https://www.macworld.com/article/180036/17mbpro.html\" target=\"_blank\"><strong>17-inch MacBook Pro</strong></a> was a beast fit only for the professional—specifically one with a big backpack and strong shoulders.</p>\n\n\n\n<p>Its “unibody” enclosure was a single piece of aluminum, roughly the size of a jumbo jet’s emergency exit door. It had an option for a matte anti-glare display, for pro designers who flinched at the sight of a glossy screen that everyone else would have cooed over. Proper.</p>\n\n\n\n<h2>Mac Pro (2013-2019)</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2013-cylinder.jpg?quality=50&amp;strip=all\" alt=\"Apple Mac Pro 2013 cylinder back and front\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2013-cylinder.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2013-cylinder.jpg?resize=300%2C226&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2013-cylinder.jpg?resize=768%2C579&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"771\" /></figure><p>Apple</p></div>\n\n\n\n<p>Every now and again Apple design legend Jony Ive would tire of refining the same old Mac cases and enclosures, and demand to be allowed to show off with something so wacky that everyone would resume bowing at his Clarks Wallabees shoes.</p>\n\n\n\n<p>In 2013, Apple gave him a shot at making the <strong>Mac Pro</strong> look like nothing else ever designed by anyone on Earth, and he came up with something like a shiny trash can from space. Making it just 9.9 inches tall and just 6.6 inches in diameter—less than an eighth of the size of the old Mac Pro—Ive had outdone himself. Even the silly Power Mac G4 Cube looked sensible next to it.</p>\n\n\n\n<p>Its very noncylindrical and massive Mac Pro predecessor boasted four hard-drive bays, two optical-drive bays, and four PCI Express slots, and you could even add a RAID card to set up an internal RAID array. Its cylindrical predecessor, on the other hand, had none of these professional expansion muscles, just a handful of slots at the back so the rest of your desk was ruined by a multitude of ugly, non-Apple boxes (that all, of course, cost a whole bunch extra).</p>\n\n\n\n<p>In our <a href=\"https://www.macworld.com/article/222619/mac-pro-late-2013-review-apples-new-mac-pro-really-is-for-pros.html\">Macworld review</a> we described how the new Mac Pro “may be exactly what you want (a state-of-the-art, multi-core-processor, workstation-GPU computer that doesn’t waste space and resources on expandability you may never use), or nothing like what you need (a workhorse tower with tons of bays and slots for expansion).” </p>\n\n\n\n<p>Even Ive walked away from the design with nary a glance back at his wonder-child, with the unloved cylinder holding the record for the least updated Apple product of all time at a staggering 2,182 days—just short of the duration of World War 2. </p>\n\n\n\n<h2>Pro Mac history: iMac Pro (2017-2021)</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-iMac-Pro.jpg?quality=50&amp;strip=all\" alt=\"Apple iMac Pro black back and side views\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-iMac-Pro.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-iMac-Pro.jpg?resize=300%2C189&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-iMac-Pro.jpg?resize=768%2C483&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"643\" /></figure><p>Apple</p></div>\n\n\n\n<p>In April 2017 Apple held its hands up about how useless the cylinder Mac Pro design was and promised us a totally redesigned Mac Pro. At the time, Apple’s senior vice president of Software Engineer, Craig Federighi admitted that “we designed ourselves into a thermal corner.”</p>\n\n\n\n<p>In the meantime, Apple rolled out the <a href=\"https://www.macworld.com/article/667595/imac-pro-review.html\" target=\"_blank\"><strong>iMac Pro</strong></a>—which looked just like a 27-inch iMac but in a highly attractive Space Gray color with accessories to match. Some (very wealthy) people bought the iMac Pro just to get their hands on the shiny Space Gray mouse.</p>\n\n\n\n<p>Sadly, it suffered the same non-expandability as the alien wastebasket. Its solid-state drive was non-user-replaceable as the SSD modules were paired cryptographically with Apple’s T2 chip. It never received an update before it was retired in 2021. There are rumors, however, that a <a href=\"https://www.macworld.com/article/349270/imac-pro-release-date-display-price.html\">new iMac Pro</a> might be in the works.</p>\n\n\n\n<p>The iMac Pro was certainly powerful, but despite its name, it was still really just a powerful iMac.</p>\n\n\n\n<h2>Mac Pro (2019)</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2019.jpg?quality=50&amp;strip=all\" alt=\"Apple Mac Pro 2019 front and side images\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2019.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2019.jpg?resize=300%2C233&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Pro-2019.jpg?resize=768%2C595&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"794\" /></figure><p>Apple</p></div>\n\n\n\n<p>Embarrassed by its cylinder Mac Pro, Apple went back to the drawing board—actually 2006’s original Mac Pro drawing board, which itself was just the drawing board used for the Power Mac G5. Apple didn’t waste its drawing boards.</p>\n\n\n\n<p>The new <a href=\"https://www.macworld.com/article/667603/mac-pro-2019-first-look-review.html\" target=\"_blank\"><strong>Mac Pro</strong></a> was again a hulking metallic beast. Like 2006’s Mac Pro, it had holes at the front; this time with the cheesegrater side for really hard cheese, unlike the 2006 soft-cheesegrater look that could handle only crumbly cheddar. Fully loaded, the new Mac Pro cost nearly $55,000, an expense claim even a banker would choke on, although that does include a set of $400 stainless steel wheels.</p>\n\n\n\n<h2>Mac Studio (2022)</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Studio-Screen.jpg?quality=50&amp;strip=all\" alt=\"Apple Mac Studio and screen\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Studio-Screen.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Studio-Screen.jpg?resize=300%2C156&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Apple-Mac-Studio-Screen.jpg?resize=768%2C399&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"532\" /></figure><p>Apple</p></div>\n\n\n\n<p>It might not have the word Pro in its name, but with an Ultra processor and a dull case, the <a href=\"https://www.macworld.com/article/622515/mac-studio-m1-max-review.html\" target=\"_blank\"><strong>Mac Studio</strong></a> is every bit a pro device. In 2023, the M1 Ultra was updated to an M2 Ultra.</p>\n\n\n\n<p>If it followed Apple’s other loose naming conventions it might be called a Mac mini Pro or a Fat Mini Pro.</p>\n\n\n\n<p>It’s the fastest processor Apple makes and performs even better than a maxed-out 2019 Mac Pro costing 10 times as much. Until the Mac Pro got its Apple silicon makeover, the Mac Studio was Apple’s fastest Mac and the best option for pros. </p>\n\n\n\n<h2>Mac Pro (2023)</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Mac-Pro-M2-Ultra-.jpg?quality=50&amp;strip=all\" alt=\"Mac PRo M2 Ultra\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Mac-Pro-M2-Ultra-.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Mac-Pro-M2-Ultra-.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Mac-Pro-M2-Ultra-.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Mac-Pro-M2-Ultra-.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"683\" /></figure><p>Apple</p></div>\n\n\n\n<p>Apple took years to update its 2019 Mac Pro with its Silicon processor technology—I pray that no one recently forked out $55,000 for the old one with ye olde Intel inside.</p>\n\n\n\n<p>Armed with a 24-core CPU, 76-core GPU M2 Ultra processor and 192GB of RAM, Apple says that it is 3x faster than the Intel version that it still looks like—but costs just $12,299 fully equipped as a rack mount or $100 cheaper with stainless steel frame with wheels. Find out more about the <strong><a href=\"https://www.macworld.com/article/347010/new-mac-pro-2023.html\" target=\"_blank\">new Mac Pro</a></strong> here.</p>\n\n\n\n<div></div>\n\n\nMac, Mac Pro</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"60e16291f54da1c968ea6e64e37339d204808b40b44348d1d73adf7eb296aa48","category":"Apple"}