{"title":"Flow and sediment measurement for the Three Gorges Project","link":"https://onlinelibrary.wiley.com/doi/10.1002/rvr2.76?af=R","date":1711081279000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c40b2767-675e-4d3e-a10c-5e542fd62094/rvr276-gra-0001-m.png\" alt=\"Flow and sediment measurement for the Three Gorges Project\" /><p>The flow and sediment measurement of the Three Gorges Project (TGP) is mainly introduced in this paper. It includes the general situation of the TGP, the distribution of the hydrological network, the measurement factors, the new measurement technology, and the sediment changes in the reservoir and downstream after the impoundment of the TGP.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Flow and sediment problem is one of the key factors which affect the dispatching operation and life of the Three Gorges Project (TGP). Many approaches have been employed to research the flow and sediment problems of the TGP during its demonstration, planning, design, construction and operation, and many important results have been obtained. To understand the progress of flow and sediment measurement in China's representative projects and the experience of sediment observation in super large reservoirs, the flow and sediment measurement of the TGP is mainly introduced in this paper. It includes the general situation of the TGP, the distribution of the hydrological station network, the measurement factors, the new measurement technology, and the sediment changes in the reservoir and downstream after the impoundment of the TGP. The sediment measurement results show that the basic situation of sediment problems is good, and these sediment problems may probably accumulate, develop, and transform over time, so they should be paid continuous attention.</p>","author":"Guanglei Duan, \nYanbo Peng","siteTitle":"Wiley: River: Table of Contents","siteHash":"0b74d58d2572beb2996093d38ec1aeffad4d7646e8152f056f56cbe7cdd98b36","entryHash":"60e62c6f71a70813f5f84c5178a0851549f9ff719d56ba9358f1f1c4063e265c","category":"Environment"}