{"title":"France Pushes to Widen EU Regulations on Big Tech Companies","link":"https://www.macrumors.com/2021/02/15/france-pushes-to-widen-eu-regulations-on-big-tech/","date":1613401809000,"content":"France is pushing for changes to the EU's upcoming regulations on big tech companies, including <a href=\"https://www.macrumors.com/2020/10/12/apple-reportedly-on-eu-hit-list-of-big-tech/\">Apple, Google, Amazon, and Facebook</a>, that would make it easier for governments to penalize bad behavior and widen controls on content, according to a new report by the <em><a href=\"https://www.ft.com/content/5e41d0cf-a83c-4817-997e-a353858137ab?shareType=nongift\">Financial Times</a></em>.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/11/european-parliament.jpg\" alt=\"\" width=\"1920\" height=\"1132\" class=\"aligncenter size-full wp-image-772282\" />\r\n<br/>\r\n\r\n<br/>\r\nThe Digital Services Act, <a href=\"https://www.macrumors.com/2020/12/15/eu-introduces-strict-rules-on-big-tech-companies/\">presented in December 2020</a>, is designed to tackle illegal online content in the European Union by obliging big tech companies to quickly remove it, or face hefty fines.\r\n<br/>\r\n\r\n<br/>\r\nFrance now wants to change the Digital Services Act by allowing every individual EU member state to have the right to fine big tech companies and force them to remove content on their platforms. Currently, only EU countries where tech companies are headquartered can enforce the EU's laws.\r\n<br/>\r\n\r\n<br/>\r\nFor example, Apple, Google, and Facebook have European headquarters in the Republic of Ireland. This means that, as it stands, only Ireland can sanction these companies or make requests for the removal of content. France's proposition would give all 27 EU member states the ability to punish or control big tech companies in the exact same way Ireland can.\r\n<br/>\r\n\r\n<br/>\r\nThere is, however, concern among EU officials that the French proposals would erode the EU's precious single market. The single market is an agreement designed to make it easy for people, goods, services, and money to move between EU member states, as though it is a single country. Under France's plans, big tech companies would be subject to 27 authorities, instead of just one.\r\n<br/>\r\n\r\n<br/>\r\nFrance is also pushing for other changes to the Digital Services Act that would allow it to \"include other types of problematic content,\" including \"harmful content and disinformation,\" broadening the parameters of the \"illegal content\" that the Digital Services Act is proposing to control.\r\n<br/>\r\n\r\n<br/>\r\nThe Digital Services Act comes hand-in-hand with the <a href=\"https://www.macrumors.com/2020/10/01/eu-plan-ban-pre-installing-apps-force-data-sharing/\">Digital Markets Act</a>, which demands that big tech companies share metrics with competitors, ensure that all apps are uninstallable, and do not preference their own apps and services. Companies that fail to do so may face large fines, as high as ten percent of the company's worldwide annual turnover, or even forced disinvestment.\r\n<br/>\r\n\r\n<br/>\r\nApple has already gone some way to meeting the rules set out in the Digital Markets Act. For example, as of iOS 10, Apple has allowed users to <a href=\"https://www.macrumors.com/2016/06/13/delete-preinstalled-ios-apps/\">uninstall default apps</a>. Likewise, last year, Apple <a href=\"https://www.macrumors.com/2019/09/09/apple-adjusts-app-store-search-algorithm/\">adjusted its App Store search algorithm</a> so that fewer of its own apps appear at the top of search results. Nevertheless, Apple will be equally obligated to meet the demands of the legislation, including sharing its internal metrics and data, when the act comes into law.\r\n<br/>\r\n\r\n<br/>\r\nIn recent weeks, France's minister for the digital economy, Cedric O, has met with senior EU officials, including the European commissioner in charge of the upcoming big tech regulations, Thierry Breton, to make the case for these significant changes to the Digital Services Act.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/europe/\">Europe</a>, <a href=\"https://www.macrumors.com/guide/france/\">France</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/15/france-pushes-to-widen-eu-regulations-on-big-tech/\">France Pushes to Widen EU Regulations on Big Tech Companies</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/france-pushes-to-widen-eu-regulations-on-big-tech-companies.2284777/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ETxFTYHdXg4:XgHdooJW68A:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ETxFTYHdXg4:XgHdooJW68A:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ETxFTYHdXg4\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"60f2e0252e3e0de96d3901707ffbbfb88d5f385c1e94db9c702f4fb0faafa37e","category":"Apple"}