{"title":"Webb telescope spots hints that Eris, Makemake are geologically active","link":"https://arstechnica.com/?p=2004297","date":1708358116000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/eris-makemake-icy-dwarf-planet-800x557.jpg\" alt=\"Image of two small planets, one more reddish, the second very white.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/eris-makemake-icy-dwarf-planet-scaled.jpg\">Enlarge</a> <span>/</span> Artist's conceptions of what the surfaces of two dwarf planets might look like. (credit: <a href=\"https://www.swri.org/press-release/swri-scientists-find-evidence-of-geothermal-activity-within-icy-dwarf-planets\">SWRI</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Active geology—and the large-scale chemistry it can drive—requires significant amounts of heat. Dwarf planets near the far edges of the Solar System, like Pluto and other Kuiper belt objects, formed from frigid, icy materials and have generally never transited close enough to the sun to warm up considerably. Any heat left over from their formation was likely long since lost to space.</p>\n<p>Yet Pluto turned out to be a world rich in geological features, some of which implied ongoing resurfacing of the dwarf planet's surface. Last week, researchers reported that the same might be true for other dwarf planets in the Kuiper Belt. Indications come thanks to the capabilities of the Webb telescope, which was able to resolve differences in the hydrogen isotopes found on the chemicals that populate the surface of Eris and Makemake.</p>\n<h2>Cold and distant</h2>\n<p>Kuiper Belt objects are natives of the distant Solar System, forming far enough from the warmth of the Sun that many materials that are gasses in the inner planets—things like nitrogen, methane, and carbon dioxide—are solid ices. Many of these bodies formed far enough from the gravitational influence of the eight major planets that they have never made a trip into the warmer inner Solar System. In addition, because there was much less material that far from the Sun, most of the bodies are quite small.</p></div><p><a href=\"https://arstechnica.com/?p=2004297#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2004297&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"60ffebd2eb27a5eac91083d0b67d3823adcaadfc4af809ceb0f8222acd817db5","category":"Tech"}