{"title":"Impact of corporate environmental uncertainty on environmental, social, and governance performance: The role of government, investors, and geopolitical risk","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309559","date":1724767200000,"content":"<p>by Xiao Guo, Pengfei Cheng, Baekryul Choi</p>\r\n\r\nCorporations face multifaceted environmental uncertainties (EU) in today’s dynamic global economic environment. Such uncertainties profoundly affect corporate operations and pose significant challenges to their environmental, social, and governance (ESG) performance. Therefore, using data from Chinese A-share listed corporations from 2009 to 2021, we empirically analyze the impact of the EU on ESG performance. The results demonstrate that the EU significantly negatively impacts ESG performance, indicating that corporations frequently find it difficult to implement and maintain high-standard ESG policies and practices effectively. Additionally, they reveal that the EU inhibits the improvement of ESG performance by increasing corporate financing constraints (KZ). Lastly, this study explores the role of government subsidies (GOV), investor attention (IA), and geopolitical risks (GPR) as moderating variables. We discover that GOV can mitigate the negative impact of the EU on KZ because they provide additional resources that help corporations maintain their ESG in uncertain environments. Furthermore, IA can reduce the adverse impact of KZ on ESG. Positive moderating effects result from ESG issues; the capital they provide effectively reduces corporate KZ, thus enabling corporations to maintain good ESG performance despite operating in highly uncertain environments. However, due to the increased asymmetry of information in economic markets caused by geopolitical tensions, GPR exacerbates the negative impact of the EU on ESG performance, thus leading to an increase in KZ. These findings offer new perspectives on understanding how these moderating effects affect corporate ESG strategies.","author":"Xiao Guo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"60ff87ec0a42231f35bbfe2956959dbec43ea3433335afdd95d086b86bffa473","category":"Interdisciplinary"}