{"title":"The Nothing Phone 2a is a light-up budget phone for $349","link":"https://arstechnica.com/?p=2007892","date":1709665054000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/16x9-5-980x551.jpg\" /></div>\n          <p>\n            The Nothing Phone 2a in black.                           [credit:\n                              Nothing                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Hot off the <a href=\"https://arstechnica.com/gadgets/2023/11/nothings-imessage-app-was-a-security-catastrophe-taken-down-in-24-hours/\">embarrassing implosion</a> of its messaging app, the upstart hardware company Nothing is back to making phones again. This time it's a budget device, the \"<a href=\"https://us.nothing.tech/pages/phone-2a\">Nothing Phone 2a,</a>\" which is being sold in Europe for 329 euros and <em>sort of</em> coming to the US for $349 on a \"Developer program\" with limited carrier support.</p>\n<p>Just like the bigger Nothing Phone 2, this has a unique rear design full of lights and faux-mechanical cladding embedded under the clear back. On this model, that clear back is plastic, while the front is glass. There is some aluminum somewhere in the mid-frame, but the sides are plastic.</p>\n<p>As usual with Nothing phones, it's very odd to be able to <em>see</em> the screw heads on the back but not access them because of the glued-on rear cover. In a world where everyone, Nothing included, pitches \"more sustainable\" devices, you could be both good-looking and repairable with a design like this, if you just didn't entomb the screws under a clear cover. The phone only has IP54 dust and water resistance, meaning it can't handle much more than rain, so it's not like the glue construction is doing much. Still, it's nice to see a budget phone with some design work put into it, even if it is this phony faux-repairable design language.</p></div><p><a href=\"https://arstechnica.com/?p=2007892#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2007892&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"61044aee59b9ac404233834d41c69ac3f8ef1cd96c03cd3d7a931ffa1613b082","category":"Tech"}