{"title":"Yes, the military is serious about rocketing supplies around the planet","link":"https://arstechnica.com/?p=1769904","date":1622833234000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/51171019709_19e6fc54b3_k-800x485.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/51171019709_19e6fc54b3_k.jpg\">Enlarge</a> <span>/</span> A SpaceX Starship prototype takes flight in April, 2021. (credit: <a href=\"http://www.spacex.com/\">SpaceX</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The Air Force confirmed a strong interest in delivery of cargo around the world—by rockets—during an hourlong conference call with reporters on Friday. Military officials said they were elevating the cargo initiative to become the newest \"Vanguard Program,\" indicating a desire to move the concept from an experimental state into an operational capability.</p>\n<p>\"This idea has been around since the dawn of spaceflight,\" said Dr. Greg Spanjers, an Air Force scientist and the Rocket Cargo Program Manager. \"It's always been an intriguing idea. We've looked at it about every 10 years, but it's never really made sense. The reason we're doing it now is because it looks like technology may have caught up with a good idea.\"</p>\n<p><a href=\"https://arstechnica.com/science/2021/06/the-us-military-is-starting-to-get-really-interested-in-starship/\">Ars first reported</a> about the \"Rocket Cargo\" program in the Air Force's budget request on Monday. As part of its $200 billion annual budget, the Air Force is seeking $47.9 million to leverage emerging commercial rocket capabilities to launch cargo from one location and land elsewhere on Earth.</p></div><p><a href=\"https://arstechnica.com/?p=1769904#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1769904&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6114ddda730e391da698c5dddb5bd5c42c099ec28c309d12ba56f245fdc69f00","category":"Tech"}