{"title":"Impacts of integration of mola with prawn–carp gher farming: An approach to enhance household fish consumption and family income","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13066?af=R","date":1722826820000,"content":"<h2>Abstract</h2>\n<p>This study investigated the production performance, household fish consumption, and commercial feasibility of prawn–carp–mola mixed gher farming system. Three treatments with different species compositions were compared: prawn + rohu, prawn + mola, and prawn + rohu + mola, each having different stocking densities. The results indicated that the integration of mola improved the utilization of feed protein by prawns. However, mola inclusion did not significantly affect the growth of prawn and rohu or the production system's cost. Mola inclusion led to a significant increase in the gross production, household consumption, and sale of mola, prawn, and rohu. It also increased gross returns, income above variable cost, and net returns to land, family labor, and management. In addition, the inclusion of mola significantly increased household consumption by increasing the intake of nutrient-rich mola and overall fish consumption. This improvement in food consumption contributed to ensuring the nutritional requirements and food security of impoverished rural farmers, especially women and children. Consequently, the integration of small fish mola in prawn–carp gher farming systems is recommended as a beneficial practice for wider adoption, effectively addressing household nutrition security at the rural level and improving the livelihoods of farmers.</p>","author":"Shikder Saiful Islam, \nSaikat Ranjan Mondal, \nJoyanta Bir, \nWasim Sabbir, \nMd. Abul Kalam Azad, \nMd. Abdul Wahab, \nRussell Borski, \nKhandaker Anisul Huq","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"611537b26daa27988f6421a48adfc7cb5fad9c8cadfdf1d9385d2573bee58ad5","category":"Environment"}