{"title":"A management framework for sudden water pollution: A systematic review output","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11012?af=R","date":1710313200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c31a99d4-9c06-4486-a550-c08be648f5ee/wer11012-toc-0001-m.png\" alt=\"A management framework for sudden water pollution: A systematic review output\" />\n<p>As an output, this review proposed a management framework for sudden water pollution and a guideline for hydrodynamic model selection. Thus, where a one-dimensional model may apply to small stream, multidimensional models are better for larger rivers.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Numerous sudden water pollution (SWP) incidents have occurred frequently in recent years, constituting a potential risk to human, socio-economic, and ecological health. This paper systematically reviews the current literature, with the view to establishing a management framework for SWP incidents. Only 39 of the 327 downloaded articles were selected, and the ROSES protocol was utilized in this review. The results indicated industries, mining sites, and sewage treatment plants as key SWP contributors through accidental leakages, traffic accidents, illegal discharge, natural disasters, and terrorist attacks. These processes also presented five consequences, including the contamination of drinking water sources, disruption of drinking water supply, ecological damage, loss of human life, and agricultural water pollution. Meanwhile, five mitigation strategies included reservoir operation, real-time monitoring, early warning, and chemical and biological treatments. Although an advancement in mitigation strategies against SWP was observed in this review, previous studies reported only a few prevention strategies. Considering that this review provided an SWP-based management framework and a hydrodynamic model selection guideline, which provide a foundation for implementing proactive measures against the SWP. These guidelines and the SWP-based management framework require practical field trials for future studies.</p>\n<h2>Practitioner Points</h2>\n<p>\nSudden water pollution increases with industrial growth but decrease with awareness.\nHuman and ecosystem health and social economy are the endpoint receptacles.\nMitigation strategies include reservoir dispatch, early warning, and treatments.\nDPSIR model forms the basis for proving proactive measures against sudden pollution.\nThis review provides a guideline for the selection hydrodynamic models application.\n</p>","author":"Nura Bello, \nNor Rohaizah Jamil, \nLey Juen Looi, \nNg Keng Yap","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"6115383573862b1536c74ec146071496e21b9871ad558919f2046806bf94400a","category":"Environment"}