{"title":"Highlights From Microsoft’s Fall Surface Event","link":"https://www.theverge.com/2021/9/22/22684950/microsoft-surface-event-biggest-announcements-pro-8-duo-studio-laptop","date":1632439565000,"content":"\n<p>Nice supercut video from The Verge squeezing Microsoft’s Surface event yesterday into eight minutes. A few thoughts:</p>\n\n<p>It seems like Microsoft is letting the Surface division stand on its own, brand-wise. They’re not distancing themselves from Microsoft in any way, but branding wise they’re just letting the products be the “Surface Whatever”, not the “Microsoft Surface Whatever”. There’s even a moment in the event, regarding the folding Duo 2 phone, when a guy says it has “the most precise and reliable hinge mechanism ever engineered at Surface”. I.e. that it was “Surface” who engineered that hinge, not “Microsoft”. I think Surface works as a Microsoft sub-brand like that.</p>\n\n<p>Speaking of the Surface Duo 2 — their folding phone with two screens — they’re now just calling it what they should have called it all along: a phone. It’s a very interesting and unique form factor, but it’s a big folding phone, not a small folding tablet. It supposedly has real cameras this time, too. Starting price: $1,500.</p>\n\n<p>The new Surface Laptop Studio looks really dumb to me. I don’t understand why one would ever want to use it in either of the new folding positions. I guess maybe if you really want to draw on it, you might want to fold it flat, but if you really want to draw that much, why not buy the Surface Pro 8 that detaches from the keyboard? This design <a href=\"https://www.theverge.com/2021/9/23/22688432/microsoft-surface-laptop-studio-book-3-specs-step-backwards\">just seems dumb</a>.</p>\n\n<p>The Surface Slim Pen 2 introduces haptic feedback, to simulate the feel of a pen on paper. I love stuff like that.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/09/23/surface-event-highlights\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"6117f5666d9105078bf7645051fda980f3874f967abcb3f1b6a00ed3e817a4e7","category":"Tech"}