{"title":"Research on the brewing technology of Dangshen Huangjiu with low biogenic amines and high functional factors","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13503?af=R","date":1718692178000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Biogenic amines (BA) are hazardous components in Huangjiu (HJ). To ensure the quality of Dangshen Huangjiu (DSHJ), an orthogonal experiment L<sub>9</sub> (3<sup>3</sup>) was proposed to optimize the process by the main brewing factors (pre-fermentation temperature, pre- and post-fermentation time) that may affect BA and functional factors in DSHJ. DSHJ was produced with low BA content and high functional factors. Gas chromatography–ion mobility spectrometry combined with a multivariate statistical method (GC-IMS-MSM) was used to analyze the volatile components in the brewing process of DSHJ.</p>\n<h2>RESULTS</h2>\n<p>The optimum brewing process parameters of DSHJ were as follows: pre-fermentation temperature, 28 °C; pre-fermentation time, 9 days; post-fermentation time, 18 days. The average content of BA in DSHJ was 33.12 mg L<sup>−1</sup>, and the sensory score, total phenol content and DPPH free radical scavenging rate of DSHJ were significantly higher than those of HJ. A total of 14 esters, 7 acids, 7 alcohols, 1 ketone, 5 aldehydes and 1 pyrazine in DSHJ and HJ were identified by GC-IMS. There were no significant differences (<i>P</i> &gt; 0.05) in DSHJ and HJ in the soaking rice and saccharification stage. 11 components, such as ethyl acetate, and 12 components, such as acetic acid, were the different components of HJ and DSHJ in pre-fermentation and post-fermentation stages, respectively. In the post-fermentation stage, the contents of 8 components in DSHJ such as ethyl acetate were higher than in HJ.</p>\n<h2>CONCLUSION</h2>\n<p>The preparation process parameters of DSHJ optimized by orthogonal experiments can ensure that DSHJ has the advantages of low BA content, high total phenol content and good antioxidant activity. Sensory score and GC-IMS-MSM analysis found that DSHJ prepared using the optimal process had the characteristics of good taste and rich aroma. © 2024 Society of Chemical Industry.</p>","author":"Yingrui Gao, \nYanping Wang, \nLinhai Hu, \nNan Wang, \nFang Cui, \nShiping Ying, \nFangdi Hu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"6122521f44faa6ec7d4b0d2a76c29063da799b99a44eec2ace35c646e3776196","category":"Environment"}