{"title":"59 Effects of serial harvest on growth and carcass characteristics of beef x dairy crossbred steers","link":"https://academic.oup.com/jas/article/102/Supplement_2/204/7664785?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Beef x dairy crossbred feedlot steers [n = 707; body weight (BW) at initial processing = 148 kg] were utilized in a randomized complete block design to evaluate effects of three serial harvest endpoints on growth performance and carcass characteristics. Allocation to treatment occurred after 204 d-on-feed (DOF), at which point steers weighed 484 kg (SEM = 3.2 kg). Treatments consisted of three serial harvest endpoints: 326, 347, and 368 DOF, as measured from initial processing at 148 kg. Twelve pens, with approximately 59 steers/pen and four pens/treatment were utilized. Final BW measured 696, 730, and 744 kg at 326, 347, and 368 DOF, and increased (<span>P</span> &lt; 0.01) with DOF. Dry matter intake (DMI) from allocation to harvest did not differ among treatments (11.4 kg/d; <span>P</span> = 0.36). Average daily gain (ADG) from allocation to harvest measured 1.82, 1.79, and 1.64 kg at 326, 347, and 368 DOF, respectively and was greater (<span>P</span> &lt; 0.01) at 326 and 347 DOF than at 368 DOF. Feed efficiency (FE) from allocation to harvest measured 0.162, 0.151, and 0.143 at 326, 347, and 368 DOF, respectively and was greater (<span>P</span> &lt; 0.01) at 326 and 347 DOF than at 368 DOF. Hot carcass weight (HCW) measured 438, 459, and 472 kg at 326, 347, and 368 DOF, respectively and increased (<span>P</span> &lt; 0.01) with DOF. Across the 42-d serial harvest period live and carcass ADG averaged 1.09 and 0.78 kg, respectively, with a carcass transfer of 71.6%. Backfat thickness measured 1.35, 1.63, and 1.47 cm at 326, 347, and 368 d, respectively and was greater (<span>P</span> &lt; 0.01) at 347 and 368 d than at 326 d. Marbling score measured 508, 529, and 550 at 326, 347, and 368 DOF, respectively and was greater (<span>P</span> = 0.03) at 368 and 347 DOF than at 326 DOF. Distribution of USDA quality grades (QG) did not differ (<span>P</span> = 0.45) among treatments and averaged 6.3% Prime and 83.1% Choice. Ribeye area and dressing percentage (<span>P</span> = 0.11) did not differ among treatments. Distribution of USDA yield grades (YG) was affected by treatment (<span>P</span> &lt; 0.01), with a shift toward more YG 4 and 5 carcasses with increasing DOF. Liver abscess occurrence averaged 62.9% and did not differ (<span>P</span> = 0.61) among treatments. Results from this experiment indicate a BW gain of 1.09 kg/d and a HCW gain of 0.78 kg/d across the 42-d serial harvest period. There were no differences in DMI as DOF progressed but ADG and FE decreased in the longest-fed cattle. Distribution of QG was not affected by DOF, but YG increased with increasing DOF.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6125c732f4a631210c72212d748f08bf9df24a9c797015c16e11e6ee475ad6af","category":"Environment"}