{"title":"Origin of the Yueguang gold deposit in Xinhua, Hunan Province, South China: insights from fluid inclusion and hydrogen–oxygen stable isotope analysis","link":"http://link.springer.com/10.1007/s11631-023-00663-1","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>The Yueguang gold deposit is located in Fengjia, Xinhua County, Hunan Province, South China. It represents a recently discovered small-scale gold deposit situated in the southwestern region of the Jiangnan Orogenic Belt, west of the Baimashan granitic batholith. In order to discern the characteristics of the ore-forming fluids, the underlying mineralization processes, and establish a foundation for the origin of the Yueguang gold deposit fluid inclusion microthermometry, as well as quartz hydrogen and oxygen isotope analysis, have been carried out on samples obtained from various stages of mineralization. The hydrothermal mineralization stages within the Yueguang gold deposit can be categorized into three stages: (i) the barren, pre-ore quartz-pyrite stage (Stage I), the quartz-pyrite-gold stage (Stage II), and the post-ore quartz-carbonate stage (Stage III), with the second stage being the main mineralization stage. The fluid inclusions identified in samples from the main mineralization stage can predominantly be described with the NaCl–H<sub>2</sub>O and CO<sub>2</sub>–NaCl–H<sub>2</sub>O systems. These inclusions display homogenization temperatures ranging from 158.8 to 334.9 °C, and the fluid salinity ranges from 0.3% to 4.0% (wt.% NaCl equiv.). Laser Raman spectroscopy analysis of individual inclusions further reveals the presence of gas-phases such as CO<sub>2</sub>, CH<sub>4</sub>, and N<sub>2</sub>. Isotopic analysis indicates δ<sup>18</sup>O fluid values ranging from 3.95 to 6.7 ‰ and δD<sub>H2O</sub> values ranging from − 71.9 to − 55.7 ‰. These results indicate that the ore-forming fluid of the Yueguang gold deposit belongs to metamorphic hydrothermal fluids of middle-low temperature and low salinity. In the process of ore formation, gold is transported in the form of Au (HS)<sup>2−</sup> complexes, with gold deposition being driven by fluid immiscibility. Therefore, the Yueguang gold deposit is categorized as an orogenic gold deposit dominated by metamorphic hydrothermal fluid. It may become a new target for gold exploration in the Baimashan region, central Hunan Province.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"6128ee518725a2799d709bdc9364b19c7f890b885b54203740115383ef741533","category":"Environment"}