{"title":"<i>Toxoplasma gondii</i> rhoptry discharge factor 3 is essential for invasion and microtubule-associated vesicle biogenesis","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002745","date":1723557600000,"content":"<p>by Rouaa Ben Chaabene, Matthew Martinez, Alessandro Bonavoglia, Bohumil Maco, Yi-Wei Chang, Gaëlle Lentini, Dominique Soldati-Favre</p>\r\n\r\nRhoptries are specialized secretory organelles conserved across the Apicomplexa phylum, essential for host cell invasion and critical for subverting of host cellular and immune functions. They contain proteins and membranous materials injected directly into the host cells, participating in parasitophorous vacuole formation. <i>Toxoplasma gondii</i> tachyzoites harbor 8 to 12 rhoptries, 2 of which are docked to an apical vesicle (AV), a central element associated with a rhoptry secretory apparatus prior to injection into the host cell. This parasite is also equipped with 5 to 6 microtubule-associated vesicles, presumably serving as AV replenishment for iterative rhoptry discharge. Here, we characterized a rhoptry protein, rhoptry discharge factor 3 (RDF3), crucial for rhoptry discharge and invasion. RDF3 enters the secretory pathway, localizing near the AV and associated with the rhoptry bulb. Upon invasion, RDF3 dynamically delocalizes, suggesting a critical role at the time of rhoptry discharge. Cryo-electron tomography analysis of RDF3-depleted parasites reveals irregularity in microtubule-associated vesicles morphology, presumably impacting on their preparedness to function as an AV. Our findings suggest that RDF3 is priming the microtubule-associated vesicles for rhoptry discharge by a mechanism distinct from the rhoptry secretory apparatus contribution.","author":"Rouaa Ben Chaabene","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"6130bb26b6d024bb04931aade326819aaf2e827edab32ed03beb4e9bd8642446","category":"Environment"}