{"title":"Anatomy of the olfactory system and potential role for chemical communication in the sound‐producing Lusitanian toadfish, Halobatrachus didactylus","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15751?af=R","date":1713418792000,"content":"<h2>Abstract</h2>\n<p>The current study investigated the structure and function of the olfactory system of the Lusitanian toadfish, <i>Halobatrachus didactylus</i>, using histology and electrophysiology (electro-olfactogram [EOG]), respectively. The olfactory system consists of a digitated anterior peduncle, of unknown function, containing the inhalant nostril. This then leads to a U-shaped olfactory chamber with the olfactory epithelium—identified by G<sub>αolf</sub>-immunoreactivity—on the ventral surface. A large lacrimal sac is connected to this tube and is likely involved in generating water movement through the olfactory chamber (this species is largely sedentary). The exhalent nostril lies by the eye and is preceded by a bicuspid valve to ensure one-way flow of water. As do other teleosts, <i>H. didactylus</i> had olfactory sensitivity to amino acids and bile acids. Large-amplitude EOG responses were evoked by fluid from the anterior and posterior testicular accessory glands, and bile and intestinal fluids. Anterior gland and intestinal fluids from reproductive males were significantly more potent than those from non-reproductive males. Male urine and skin mucus proved to be the least potent body fluids tested. These results suggest that chemical communication—as well as acoustic communication—may be important in the reproduction of this species and that this may be mediated by the accessory glands and intestinal fluid.</p>","author":"Teresa Modesto, \nBeatriz Neves Gregório, \nGonçalo Marcelino, \nNathalie Marquet, \nRita A. Costa, \nPedro M. Guerreiro, \nZélia Velez, \nPeter C. Hubbard","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"6138ccd8f8ba83e2fbb0f9342585b2eee7e7b47a813928cf45428ca1c719ea65","category":"Environment"}