{"title":"What We Know About the Apple Vision Pro Hardware So Far","link":"https://www.macrumors.com/2023/06/07/apple-vision-hardware/","date":1686182969000,"content":"With the <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> not set to launch until 2024, there's a lot that we don't know about it. Apple has given us a rough overview of the hardware that's inside, but hasn't gone into detail on the different components or specifications.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/apple-vision-pro-chips.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nWhat the headset weighs is unknown, for example, and there's no word on just how many cameras and sensors are inside. We aggregated the limited information that we do know about the headset's hardware for those who are interested.\r<br />\n\r<br />\n<h2>Enclosure</h2>\r<br />\n<ul>\r<br />\n \t<li>There's a three-dimensionally formed laminated glass display that attaches to a curved aluminum alloy frame.</li>\r<br />\n \t<li>There is a thermal system that quietly moves air through the Vision Pro to deliver performance and keep heat down.</li>\r<br />\n</ul>\r<br />\n<h2>Displays</h2>\r<br />\n<ul>\r<br />\n \t<li>There are two custom micro-OLED displays that provide \"more pixels than a 4K TV\" to each eye (23 million total). Apple says they're the size of a postage stamp.</li>\r<br />\n \t<li>There is a three-element lens that makes the display feel like it's \"everywhere you look.\"</li>\r<br />\n \t<li>An \"EyeSight\" external display shows other people when you're using a less immersive augmented reality mode by displaying your eyes, or lets them know you're fully immersed and unaware of your surroundings. This display also provides a recording indicator when you're capturing video with the camera.</li>\r<br />\n<li>There's a <a href=\"https://developer.apple.com/videos/play/wwdc2023/10071\">90Hz refresh rate</a>, with a special 96Hz refresh rate available for 24fps video.</li>\r<br />\n \t<li>For those who wear glasses, Zeiss Optical Inserts with your prescription can be magnetically attached to the lenses inside the headset.</li>\r<br />\n</ul>\r<br />\n<h2>Cameras</h2>\r<br />\n<ul>\r<br />\n \t<li>The headset has 12 cameras and five sensors for monitoring for hand gestures and mapping the environment. There were rumors that the headset would also look at leg movements, but that's not something Apple has mentioned. Two of the cameras transmit more than a billion pixels per second to the display to depict the world around you clearly, while others are for head tracking, hand tracking, and real-time 3D mapping. There are infrared flood illuminators that enhance hand tracking in low-light conditions.</li>\r<br />\n \t<li>There's a camera that's able to take 3D photos and videos.</li>\r<br />\n \t<li>LiDAR depth sensors can determine the size and location of the objects in the room around you, and can also scan your face to create a digital Persona that's used in <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>.</li>\r<br />\n \t<li>Inside the headset, there are four infrared cameras and LED lights. The lights project invisible light patterns onto each eye, and this system is used for iris scanning for authentication and also for accurate eye tracking so the headset can tell where you're looking for navigation purposes.</li>\r<br />\n</ul>\r<br />\n<h2>Straps and Bands</h2>\r<br />\n<ul>\r<br />\n \t<li>Audio straps on each side include speakers that support spatial audio. They are described as dual-driver audio pods that are positioned next to each ear, with the ability to analyze the room's acoustic properties to adapt the sound to match the space. Six microphones are included as well.</li>\r<br />\n \t<li>There's a detachable braided headband that has a fit adjustment dial.</li>\r<br />\n \t<li>The magnetic Light Seal, which comes in multiple shapes and sizes, holds the headset to the face and blocks out light.</li>\r<br />\n</ul>\r<br />\n<h2>Buttons</h2>\r<br />\n<ul>\r<br />\n \t<li>The Digital Crown on the top right of the headset can bring up the Home View when it's pressed, or control the level of immersion when turned. Immersion level can be adjusted when you're using \"Environments,\" aka virtual reality scenes where you can do things like watch television. You can opt to use a full fake environment that makes the screen larger than life, or have the TV show you're watching overlaid in your real room for less immersion.</li>\r<br />\n \t<li>A button at the top left can be used to take spatial videos and spatial photos.</li>\r<br />\n</ul>\r<br />\n<h2>Cables</h2>\r<br />\n<ul>\r<br />\n \t<li>There is a single woven braided power cable that attaches magnetically to the left side of the headset. The cable can be plugged into a power source or plugged into an external battery for use on the go.</li>\r<br />\n \t<li>The headset seems to ship with an external battery so you don't need to be tethered while you use it. The battery is designed to fit in a pocket.</li>\r<br />\n</ul>\r<br />\n<h2>Chips</h2>\r<br />\n<ul>\r<br />\n \t<li>There are two chips inside the ‌Apple Vision Pro‌. The <a href=\"https://www.macrumors.com/guide/m2/\">M2</a>, which is the same chip that's in the Mac lineup, is the main chip that handles the processing. The ‌M2‌ runs visionOS, executes computer vision algorithms, and provides graphical content.</li>\r<br />\n \t<li>A second R1 chip is responsible for all of the information that's coming in from the cameras, sensors, and microphones. It is able to stream images to the displays within 12 milliseconds, and Apple has said this chip is able to provide a \"virtually lag-free\" view of the world.</li>\r<br />\n</ul>\r<br />\nAs we get closer to launch, we'll likely learn more about the headset's capabilities and the specifics on the components Apple is using, but we may be waiting until after it becomes available for a full teardown and peek inside.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/07/apple-vision-hardware/\">What We Know About the Apple Vision Pro Hardware So Far</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/what-we-know-about-the-apple-vision-pro-hardware-so-far.2392146/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"613b1bbc2bfbc6b94540527b854d2b97812c8dca84f22ac9b2c1ab1eab839707","category":"Apple"}