{"title":"Prevalence and determinants of prehospital delay among stroke patients in mainland China: A systematic review and meta-analysis of the study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312551","date":1729778400000,"content":"<p>by Hui Deng, Xiangming Wang, Li Yin, Xianzhi Li, Yuehui Zhang</p>\r\nBackground <p>Prehospital delay is one of the most serious problems in the treatment of stroke patients. In China, although hospitals at all levels have promoted the construction of stroke centers, pre-hospital delays are still very common. As the primary cause of death and disability, stroke not only brings great harm to patients themselves, but also brings a heavy burden on social progress and economic development, it is important to understand the prevalence and determinants of prehospital delay among stroke patients. Therefore, this review aims to determine the pooled prevalence and determinants of prehospital delay in mainland China.</p> Methods <p>A systematic review of eligible articles will be conducted using preferred reporting items for systematic reviews and meta-analysis (PRISMA) guidelines. A comprehensive literature search will be conducted in PubMed, Embase, Cochrane, web of science, China National Knowledge Infrastructure (CNKI), Wanfang, Weipu (VIP) and Chinese Biomedicine Iiterature databas (CBM) databases. The quality of the articles included in the review will be evaluated using the Newcastle-Ottawa Scale (NOS). The pooled prevalence of prehospital delay, and odds ratio and their 95% confidence intervals for relevant influencing factors, will be calculated using RevMan 5.3 software. The existence of heterogeneity among studies will be assessed by computing p-values of Higgins’s I<sup>2</sup> test statistics and Cochran’s Q-statistics. Sensitivity analysis and subgroup analysis will be conducted based on study quality to investigate the possible sources of heterogeneity. Publication bias will be evaluated by funnel chart and by Egger’s regression test. This review protocol has been registered PROSPERO (CRD42023484580).</p> Discussion <p>By collecting and summarizing information on prehospital delay among stroke patients can be a step towards a better understanding of the prevalence of prehospital delay among stroke patients in mainland China and how the associated factors influence the prevalence of prehospital delay. Therefore, a rapid, accurate diagnosis Stroke, timely pre-hospital first aid, the treatment process forward, for the patient It has great significance. This summarized finding at the national level will provide new clues for intervention to reduce the rate of pre-hospital delay of stroke patients, and is expected to further improve the treatment effect of stroke patients.</p>","author":"Hui Deng","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"615b9f365124439b5494d072082e96b3bbccad68182936b6a29eda733fbeeb86","category":"Interdisciplinary"}