{"title":"PSLBI-17 Total sulfur amino acid requirements across the canine life cycle in Labrador Retrievers using the indicator amino acid oxidation (IAAO) technique","link":"https://academic.oup.com/jas/article/102/Supplement_3/629/7757798?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Methionine and cysteine are the principal sulfur-containing amino acids that are incorporated into proteins, although homocysteine and taurine also have important physiological roles in canines. As limited studies have been conducted for total sulfur-containing amino acids (TSAA) requirements across the canine life cycle, our objective was to determine the minimum requirements (MR) for TSAA at 4 life stages using the indicator amino acid oxidation (IAAO) technique. Labrador Retrievers (n = 24) were used in feeding studies to evaluate the changing requirements of TSAA as dogs mature: 6 puppies aged 10 to 14 wk, 6 puppies &gt;14 wk to 9 mos, 6 adults 2 to 5 yr (yr), and 6 seniors &gt; 8yr. Following a 2-d adaptation to a TSAA-adequate basal diet (TSAA = 1.12% dry matter), dogs underwent individual IAAO studies. In brief, all dogs were randomly fed one of six test diets with varying levels of TSAA ranging from deficient to sufficient (final TSAA content in experimental diets were 0.41, 0.46, 0.51, 0.98, 1.05, and 1.12% dry matter, with indispensable amino acids formulated at 1.6x NRC values). The test diet was divided into 13 equal meals; at the 5th meal, a tracer amino acid was included (a bolus L-[1-<sup>13</sup>C] phenylalanine based on body weight was first given, followed by [1-<sup>13</sup>C] Phe doses every 30 spanning 4 h). Breath samples were collected via a respiration mask every 30 min. Total CO<sub>2</sub> production was determined via indirect calorimetry and production of <sup>13</sup>CO<sub>2</sub> at each dose was measured by enrichment of <sup>13</sup>C in breath samples via isotope ratio mass spectrometry (IRMS). Results for IRMS data were converted to atom percent excess (APE) and analyzed using segmented linear regression. The Four Rivers mean and population requirements for TSAA were estimated to be 1.55 ± 0.069 g/1,000 kcal (mean ± 2 SD) for puppies 10 to 14 wk, 1.53 ± 0.21 g/1,000 kcal (mean ± 2 SD) for puppies 14 wk to 9 mo, 1.4 ± 0.30 g/1000 kcal (mean ± 2 SD) for adults 2 to 5 yr, and 1.27 ± 0.23 g/1,000 kcal (mean ± 2 SD) for seniors. These results may contribute to the formulation of diets that meet the age-appropriate requirements of TSAA for large-breed dogs at all life stages.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"615cf4f1fbfa5de6ba74f847419d2e6e1f817e48a639d6ce2e5e8fbe19a37ad3","category":"Environment"}