{"title":"Exogenous methylglyoxal alleviates drought-induced ‘plant diabetes’ and leaf senescence in maize","link":"https://academic.oup.com/jxb/article/75/7/1982/7485675?rss=1","date":1703030400000,"content":"<span><div>Abstract</div>Drought-induced leaf senescence is associated with high sugar levels, which bears some resemblance to the syndrome of diabetes in humans; however, the underlying mechanisms of such ‘plant diabetes’ on carbon imbalance and the corresponding detoxification strategy are not well understood. Here, we investigated the regulatory mechanism of exogenous methylglyoxal (MG) on ‘plant diabetes’ in maize plants under drought stress applied via foliar spraying during the grain-filling stage. Exogenous MG delayed leaf senescence and promoted photoassimilation, thereby reducing the yield loss induced by drought by 14%. Transcriptome and metabolite analyses revealed that drought increased sugar accumulation in leaves through inhibition of sugar transporters that facilitate phloem loading. This led to disequilibrium of glycolysis and overaccumulation of endogenous MG. Application of exogenous MG up-regulated glycolytic flux and the glyoxalase system that catabolyses endogenous MG and glycation end-products, ultimately alleviating ‘plant diabetes’. In addition, the expression of genes facilitating anabolism and catabolism of trehalose-6-phosphate was promoted and suppressed by drought, respectively, and exogenous MG reversed this effect, implying that trehalose-6-phosphate signaling in the mediation of ‘plant diabetes’. Furthermore, exogenous MG activated the phenylpropanoid biosynthetic pathway, promoting the production of lignin and phenolic compounds, which are associated with drought tolerance. Overall, our findings indicate that exogenous MG activates defense-related pathways to alleviate the toxicity derived from ‘plant diabetes’, thereby helping to maintain leaf function and yield production under drought.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"615d013c882bc34455a7b24334d3382a119edea8e83213175082caad5e1763e7","category":"Environment"}