{"title":"A commander’s lament on the loss of a historic SpaceX rocket","link":"https://arstechnica.com/?p=1993381","date":1704245888000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/20240102f9booster-800x467.jpg\" alt=\"One of the most historic rockets in SpaceX's fleet toppled over Christmas Day on the return trip to Cape Canaveral, Florida, following its previous mission.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/20240102f9booster.jpg\">Enlarge</a> <span>/</span> One of the most historic rockets in SpaceX's fleet toppled over Christmas Day on the return trip to Cape Canaveral, Florida, following its previous mission. (credit: <a href=\"https://www.youtube.com/watch?v=FTw5xuq2swo\">LabPadre</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Falcon 9 rocket that launched NASA astronauts Doug Hurley and Bob Behnken on SpaceX's first crew mission in 2020 launched and landed for the 19th and final time just before Christmas, then tipped over on its recovery ship during the trip back to Cape Canaveral, Florida.</p>\n<p>This particular booster, known by the tail number B1058, was special among SpaceX's fleet of reusable rockets. It was the fleet leader, having tallied 19 missions over the course of more than three-and-a-half years. More importantly, it was the rocket that <a href=\"https://arstechnica.com/science/2020/05/todays-the-day-weather-permitting-america-is-returning-to-space/\">thundered into space on May 30, 2020</a>, on a flight that made history on several counts.</p>\n<p>It was the first time a commercial rocket and spacecraft launched people into orbit, and ended a nine-year gap in America's ability to send astronauts into orbit from US soil, following the retirement of the space shuttle. This mission, known as Demo-2 and launched by SpaceX under contract with NASA, ended US reliance on Russian rockets to send crews to the International Space Station.</p></div><p><a href=\"https://arstechnica.com/?p=1993381#p3\">Read 20 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1993381&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"61678badf6570b8123dbe5c05ad8340cc990f966c210886a0a3ca933bb36c11a","category":"Tech"}