{"title":"Influence of the SARS-COV2 pandemic on access to healthcare services among people living with HIV and its subsequent effects on antiretroviral therapy uptake in Malawi","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003665","date":1725544800000,"content":"<p>by Thulani Maphosa, Malocho Phoso, Lucky Makonokaya, Louiser Kalitera, Rhoderick Machekano, Alice Maida, Rachel Kanyenda Chamanga, Godfrey Woelk</p>\r\n\r\nThe global disruption caused by the SARS-CoV-2 pandemic profoundly affected healthcare systems, particularly impacting People Living with Human Immunodeficiency Virus (PLHIV). This study investigated the repercussions of SARS-CoV-2 infection on access to human immunodeficiency virus (HIV) care and antiretroviral therapy (ARV) in Malawi, emphasizing the critical need to sustain uninterrupted HIV services during health crises. Employing mobile phone-based syndromic surveillance, this study assessed the influence of SARS-CoV-2 on healthcare access for PLHIV across nine districts supported by the Elizabeth Glaser Pediatric AIDS Foundation (EGPAF). Telephone-based interviews were conducted to analyze demographic factors, challenges encountered in accessing HIV services, and adherence to ARV medication, illuminating the pandemic’s effects on ARV uptake. The findings revealed that approximately 3.9% (n = 852) of 21981 participants faced obstacles in accessing crucial HIV services during the pandemic, resulting in approximately 1.2% (n = 270) reporting multiple missed doses of ARV medication in a particular month. After adjusting for various variables, males exhibited a higher likelihood of service inaccessibility than females (Adjusted Odds Ratio [AOR] = 1.39, 95% CI: 1.20–1.60, p &lt; 0.001). Age also played a significant role, with individuals aged 35–49 years and those aged 50 years or older demonstrating reduced odds of service failure compared with the reference group aged 18–34 years. Only a small proportion of PLHIV reported disruption in HIV care access, which may be because Malawi did not initiate stringent travel restrictions during the SARS-CoV-2 pandemic. Nonetheless, enduring challenges have been observed in retaining younger PLHIV and men in HIV-care settings. Thus, targeted strategies are imperative for effectively engaging and sustaining these populations in HIV care during and after health crises.","author":"Thulani Maphosa","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"6168c2a0f09cfd384875122c484fdfcf8475251602110d26bedb5da0da1c48ee","category":"Environment"}