{"title":"Strategic Transformation and Sustainability: Unveiling the EFQM Model 2025","link":"https://www.preprints.org/manuscript/202408.0107/v1","date":1722550467000,"content":"The EFQM Model, established in 1991, serves as a framework for organizational excellence, helping achieve sustainable success through an integrated management system. The model's evo-lution is driven by the need to adapt to global trends, threats, and technological innovations such as: digital transformation, employee engagement and well-being, remote work, agile performance management, diversity, equity and inclusion (DEI), sustainability, AI, and big data. The new EFQM Model 2025, presented in Istanbul in June 2024, introduces significant changes, emphasiz-ing sustainability, innovation, and technology. These changes are analyzed based on the logic of three questions: Why, How, and What.\nWhy: There is a necessity for better alignment of organizations with contemporary challenges through flexibility, risk resilience, and innovation capabilities in a dynamic business environ-ment, including alignment with the UN Sustainable Development Goals (SDGs).\nHow: The model introduces an integrated approach to performance management and transfor-mation, incorporating advanced technologies such as AI and data analytics. \nWhat: Implementing the EFQM Model 2025 enhances organizational adaptability, innovation, and flexibility, improving financial, operational, and strategic outcomes. \nBetter alignment with sustainability goals leads to long-term value and social responsibility. Improved stakeholder engagement methods enhance understanding and satisfaction. The use of advanced technologies supports innovation and operational efficiency, while better strategic and operational performance and risk management ensures greater stability and the ability to anticipate future challenges.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6174139dda96b558bdc8f33884cb8d5d34db639a8f991182f81a4fa5dc164fc2","category":"Interdisciplinary"}