{"title":"Capacity for delivery of paediatric emergency care and the current use of emergency triage, assessment and treatment in health facilities in the Busoga region, Uganda—A mixed methods study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003666","date":1725458400000,"content":"<p>by Goda Laucaityte, Fredrik Wikander Fahnehjelm, Dorothy Akongo, Emmanuel Tenywa, Karl Hildebrand, Moses Kyangwa, Racheal Kwagala Ssemwogerere, William Mugowa Waibi, Helena Hildenwall</p>\r\n\r\nThe implementation of structured guidelines, such as the World Health Organisation’s Emergency Triage, Assessment and Treatment has been shown to reduce in-hospital mortality, addressing the high burden of early in-hospital deaths. We evaluated the capacity to provide paediatric emergency care at higher-level health facilities in the Busoga sub-region, Uganda, and explored healthcare workers’ perceptions of quality care. This assessment aimed to inform policy and facilitate the implementation of guidelines. A comprehensive mixed-methods study was conducted, comprising a facility audit, a survey of healthcare providers to assess their knowledge, and focus group discussions with facility staff. The study included all public and private not-for-profit facilities that provide in-patient paediatric care in Busoga. Quantitative data were analysed using descriptive statistics and linear regression, while thematic analysis with the framework method approach was applied to qualitative data. A total of 14 focus group discussions, 14 facility audits, and 100 surveys with healthcare providers were conducted. Essential equipment for paediatric emergencies and staff shortages were identified as primary barriers to quality care and key contributors to worker demotivation. Referrals were one of the main challenges, with only 25% of facilities accessing a fuelled ambulance. Knowledge scores were higher among healthcare professionals who had undergone emergency management training and participated in refresher courses (mean 13.2, 95% CI 11.6–14.8, compared to 9.2, 95% CI 8.0–10.3). Participants who felt well-prepared achieved markedly higher scores on knowledge surveys than those feeling unprepared (mean 12.2, 95% CI 11.2–13.1, versus mean 8.5, 95% CI 7.3–9.7). Qualitative discussions demonstrated positive attitudes of healthcare workers toward ETAT guidelines. Results underscore the importance of focused training with refresher sessions to enhance health workers’ knowledge and confidence in managing paediatric emergency cases. However, substantial limitations in staffing numbers and the availability of necessary equipment need to be addressed for overall quality of care improvement.","author":"Goda Laucaityte","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"618f01be911ed207f81ccb37dadca015499e62cfa462db59647fdb95610a615f","category":"Environment"}