{"title":"Pomegranate's (Punica granatum L.) fruit quality and nutrient content are influenced by soil fraction × root architecture interaction","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12889?af=R","date":1712896825000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/58f01f90-f660-436d-bca8-bcb79ae694f5/aab12889-toc-0001-m.png\" alt=\"Pomegranate's (Punica granatum L.) fruit quality and nutrient content are influenced by soil fraction × root architecture interaction\" />\n<p>Very little is known about how soil type × root architecture interaction affects fruits' yield and quality. This study provides some insights into the characteristics of clay and clay loam soil and the alteration of fruit quality and nutrient insertion of shallow and deep-rooted pomegranate varieties according to the soil type. Findings indicate that shallow-rooted varieties set more fruit under clayey conditions, but fruits get smaller and quality drops. Regardless of the rooting attitude, pomegranates yielded lower in clayey soil compared to clay loam. We also discussed the nutrient contents of pomegranates influenced by soil and root architecture.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Among the most important factors influencing plant nutrient uptake and water access are soil fraction and root architecture. However, little is known about how soil fraction × root architecture interaction affects woody plants. This study considered the differentiation of soil fertility parameters on layers through the root zone of two different soils and the quality and nutrient responses of three newly bred pomegranate varieties to soil fractions based on root architecture in clay and clay loam orchards. According to the findings, increasing clay content in the deeper layers has a negative impact on soil fertility, organic matter, phosphorus (P), and potassium (K). In clayey conditions, pomegranate varieties yielded lower in a range of 2.74% to 6.10% and significantly lower macro and micronutrient insertion. Conversely, the shallow-rooted variety accumulated significantly more boron (B) and P and set 50% more fruits in the clayey orchards. Soil fractions × root architecture significantly altered fruit quality characteristics, nutrient ingredients, and their relationships supported by a relatively low linear relationship in the Mantel test (<i>r</i> = 0.42). This study suggests that pomegranate tree responses to soil fractions are determined by root architecture. A proper approach to obtaining high-quality and nutritionally fortified pomegranates will incorporate appropriate cultivation techniques, such as suitable fertigation regime regulation, harvest date optimization, and soil organic matter enrichment, to provide uniform nutrient uptake based on the soil type and variety's root architecture.</p>","author":"Ferhad Muradoğlu, \nEmrah Güler, \nGökhan Akkuş, \nİbrahim Başak, \nOlaniyi Amos Fawole","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"61944b527eafe0b9196d34cf3a5cdb5b4d93c50435b8237179db7c32a9b682e1","category":"Environment"}