{"title":"Review of Fourth-Order Maximum Entropy Based Predictive Modelling and Illustrative Application to a Nuclear Reactor Benchmark: II. Best-Estimate Predicted Values and Uncertain-ties for Model Responses and Parameters","link":"https://www.preprints.org/manuscript/202403.1488/v1","date":1711437722000,"content":"This work continues the review and illustrative application to energy systems of the “Fourth-Order Best-Estimate Results with Reduced Uncertainties Predictive Modeling” (4th-BERRU-PM) methodology. The 4th-BERRU-PM methodology uses the Maximum Entropy (MaxEnt) principle to incorporate fourth-order experimental and computational information, in-cluding fourth (and higher) order sensitivities of computed model responses with respect to model parameters. The 4th-BERRU-PM methodology yields the fourth-order MaxEnt posterior distribution of experimentally measured and computed model responses and parameters, in the combined phase-space of model responses and parameters. The 4th-BERRU-PM methodology encompasses fourth-order sensitivity analysis (SA) and uncertainty quantification (UQ), which were reviewed in the accompanying work (Part 1), as well as fourth-order data assimilation (DA) and model calibration (MC) capabilities, which will be reviewed and illustrated in this work (Part 2). The applicability of the 4th-BERRU-PM methodology to energy systems is illustrated by using the Polyethylene-Reflected Plutonium (acronym: PERP) OECD/NEA reactor physics benchmark, which is modeled using the linear neutron transport Boltzmann equation, involving 21976 im-precisely known parameters. This benchmark is representative of “large-scale computations” such as those involved in the modeling of energy systems. The result (“response”) of interest for the PERP benchmark is the leakage of neutrons through the outer surface of this spherical benchmark, which can be computed numerically and measured experimentally. The impact of the high-order sensitivities of the response with respect to the PERP model parameters is quantified for “high-precision” parameters (2% standard deviations) and “medium-precision” parameters (5% standard deviations). Analyzing the best-estimate results with reduced uncertainties for the 1st- through 4th-order moments (mean values, covariance, skewness, and kurtosis) produced by the 4th-BERRU-PM methodology for the PERP benchmark indicates that, even for systems mod-eled by linear equations (e.g., the PERP benchmark), retaining only first-order sensitivities is insufficient for reliable predictive modeling (including SA, UQ, DA, MC). At least second-order sensitivities should be retained in order to obtain reliable predictions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"61973a9265510e35015ed1af2069b9b5f95230bd3363acf314273d86b4e0c0a7","category":"Interdisciplinary"}