{"title":"Pixel walking along the boreal forest–Arctic tundra ecotone: Large scale ground‐truthing of satellite‐derived greenness (NDVI)","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17374?af=R","date":1718169506000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/0ebd88ee-91fe-4bf3-b426-9621716bee33/gcb17374-toc-0001-m.png\" alt=\"Pixel walking along the boreal forest–Arctic tundra ecotone: Large scale ground-truthing of satellite-derived greenness (NDVI)\" />\n<p>Using ~640 km of vegetation transects and ~24,000 Landsat pixels across Alaska's central Brooks Range, we demonstrate novel methods and analyses for improving ecological interpretation of satellite-observed vegetation greenness. Satellite observations, which are essential for monitoring changes at ecosystem scales, require field data for interpretation. By collecting data at large spatial scales we relate ground-based observations to satellite measurements.</p>\n<br />\n<h2>Abstract</h2>\n<p>In this Technical Advance, we describe a novel method to improve ecological interpretation of remotely sensed vegetation greenness measurements that involved sampling 24,395 Landsat pixels (30 m) across 639 km of Alaska's central Brooks Range. The method goes well beyond the spatial scale of traditional plot-based sampling and thereby more thoroughly relates ground-based observations to satellite measurements. Our example dataset illustrates that, along the boreal-Arctic boundary, vegetation with the greatest Landsat Normalized Difference Vegetation Index (NDVI) is taller than 1 m, woody, and deciduous; whereas vegetation with lower NDVI tends to be shorter, evergreen, or non-woody. The field methods and associated analyses advance efforts to inform satellite data with ground-based vegetation observations using field samples collected at spatial scales that closely match the resolution of remotely sensed imagery.</p>","author":"Russell E. Wong, \nLogan T. Berner, \nPatrick F. Sullivan, \nChristopher S. Potter, \nRoman J. Dial","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"619add9fd6475c7c35c1d8a2c886848918bea0391f4c1ca0fb3c567386fab477","category":"Environment"}