{"title":"Multiple Chat GPT instances combine to figure out chemistry","link":"https://arstechnica.com/?p=1992320","date":1703099683000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1445732386-800x532.jpg\" alt=\"Image of a lab with chemicals, but no people present.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1445732386.jpg\">Enlarge</a> <span>/</span> The lab's empty because everyone's relaxing in the park while the AI does their work. (credit: <a href=\"https://www.gettyimages.com/detail/photo/copy-space-of-laboratory-royalty-free-image/1445732386?phrase=chemistry+lab\">Fei Yang</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Despite rapid advances in artificial intelligence, AIs are nowhere close to <a href=\"https://arstechnica.com/science/2023/08/what-does-it-take-to-get-ai-to-work-like-a-scientist/\">being ready to replace humans</a> for doing science. But that doesn't mean that they can't help automate some of the drudgery out of the daily grind of scientific experimentation. For example, a few years back, researchers put an AI in control of automated lab equipment and taught it to <a href=\"https://arstechnica.com/science/2018/07/ai-plus-a-chemistry-robot-finds-all-the-reactions-that-will-work/\">exhaustively catalog all the reactions</a> that can occur among a set of starting materials.</p>\n<p>While useful, that still required a lot of researcher intervention to train the system in the first place. A group at Carnegie Mellon University has now figured out how to get an AI system to teach itself to do chemistry. The system requires a set of three AI instances, each specialized for different operations. But, once set up and supplied with raw materials, you just have to tell it what type of reaction you want done, and it'll figure it out.</p>\n<h2>An AI trinity</h2>\n<p>The researchers indicate that they were interested in understanding what capacities large language models (LLMs) can bring to the scientific endeavor. So all of the AI systems used in this work are LLMs, mostly GPT-3.5 and GPT-4, although some others—Claude 1.3 and Falcon-40B-Instruct—were tested as well. (GPT-4 and Claude 1.3 performed the best.) But, rather than using a single system to handle all aspects of the chemistry, the researchers set up distinct instances to cooperate in a division of labor setup and called it \"Coscientist.\"</p></div><p><a href=\"https://arstechnica.com/?p=1992320#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1992320&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"619da75ce5aeb6713450297125a4d42447e5fa73c67963af1178210ee3b68ef9","category":"Tech"}