{"title":"Mark Cavendish: 'I'm carrying on because I’m happy, loving the sport, just how I started'","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/mark-cavendish-aiming-for-further-greatness-in-2024","date":1702896303000,"content":"\n      <p>The question comes right at the end, after the answers about why he reversed his decision to retire, the strength of Astana-Qazaqstan’s sprint team, and a reflection on that Bordeaux stage at July’s <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>. Usually, Mark Cavendish shirks these kinds of questions; they’re too self-indulgent for his liking. But this time he embraces it, and reaches for a headline-worthy quote.</p>\n<div></div>\n<div></div>\n<p>“What do you think when people say you’re the greatest of all time?” comes the inquiry. Cavendish smiles, and thinks for a few seconds in the way that Cavendish does, digging deep for the right response. “They are nice words to hear, very humbling,” he begins. “I grew up watching the greats of this sport [and] I always dreamt that one day if there was a book of great riders in cycling, my name could be in that book.”</p>\n<p>Cavendish knows his name is in that book. All such books, in fact. A winner of 162 professional races, the best sprinter the sport has ever known, the Briton’s story isn’t done yet. It was meant to be – it was supposed to be all over at the end of 2023, a 35th Tour de France stage win in the bag, and a happy retirement having begun in earnest.</p>\n<p><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/moving-forward-tao-geoghegan-harts-begins-new-chapter-at-lidl-trek\"><em>Read more: Moving forward: Tao Geoghegan Hart's new chapter at Lidl-Trek</em></a></strong></p>\n<p>But then less than 24 hours after almost winning stage seven of July’s Tour, narrowly beaten not just by Jasper Philipsen but a jumping chain, Cavendish was in tears, his collarbone fractured and laying on a hospital bed. He couldn’t retire now, cried the cycling world.</p>\n<p>Of course he couldn’t. “Alex [Vinokourov, Astana-Qazaqstan’s general manager] asked me straight after I got back from hospital if I wanted to carry on,” Cavendish reveals. “That’s nice, that’s a team boss who has been a champion, rode a bike, understands.”</p>\n<p><img alt=\"Mark Cavendish 2023 Tour de France\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_1698_1.jpg?v=1702896210\" /></p>\n<p><em>Cavendish won't ride the Giro again 2024 with the Tour his key focus </em></p>\n<p>The decision wasn’t formally ratified until early October, but the Manx Missile knew all along he’d be hanging around – he was even texting Michael Mørkøv from his hospital bed, begging him to swap Soudal–Quick-Step for Astana. The Dane has.</p>\n<p>“The biggest factor was knowing I was valued,” Cavendish explains. “It’s been a rather few years since I felt valued as a rider for racing, and off the bike as a team-mate. It’s ironic that the reason I wanted to stop was because I was happy, enjoying cycling; I could finish cycling knowing that I was in love with the sport, the same as I was when I started.</p>\n<p>“It’s ironic then that I am carrying on because I’m happy, loving the sport, just how I started. It took a while, [it] was just knowing when I came back from my injury more than anything.” His children, all four of them, were influential. “The ultimate call was the kids,” he laughs. “‘I’m stopping’. They said, ‘what do you mean you’re stopping?’ ‘I’m not going to be a bike rider.’ ‘Well, no, you can’t do that.’ That was quite a big factor, I have to set an example for them. My philosophy has been: never quit. That’s been my fundamental first thing. Ok you have to stop your career at some point, but if they [kids] are like why stop, but why should I stop?”</p>\n<p>So here he is, carrying on for one more season, about to begin his 20th year as a professional cyclist. “I don’t think I have to do anything else in cycling,” he states, rather obviously. His palmarès speaks for itself. “I can just enjoy it [and] that’s a nice place to be.” Second in Bordeaux, allied with a stage 21 victory at May’s <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, gave him the confidence he’s still got the speed, even if he will be 39 at July’s Tour.</p>\n<p>“If I was far off, it would be a different story,” he says. “We went into [the Tour] with a team that was relatively new and working together. We [showed we] belong there in the sprints. To make that [step] in a couple of short months, even coming away without a win, was a massive win for us as a team, and it gives us something to work on. All these factors definitely played into the decision.”</p>\n<p>On paper at least, his chances of success in 2024 have been markedly improved; Mørkøv joined, so too did Davide Ballerini and his former coach Vasilis Anastopoulos, all from Quick-Step. The band from 2021’s Tour, a quartet who produced just as many unfancied stage wins, is back together. And this time they’re joined by Cees Bol, Max Kanter, Ide Schelling, and, in the sports director car, the Australian who provided him with a hand sling for so many victories in the early years - Mark Renshaw. “He’s the best leadout man in the world,” Cavendish says of Mørkøv. “Anyone who has Michael Mørkøv has a better chance of winning in the Tour de France. It’s great. Just like Renshaw was, he’s the calm to my not so calm.”</p>\n<p>How much of an input did Cavendish have in recruiting Astana’s new sprint team? “Honestly, I didn’t have too much to say in it,” he says. “I’m not the boss here.” Many would disagree: Cavendish is the boss. But he did accept that having the old crew back together is going to be a big advantage. “It always helps. You don’t have to look at what races you can work together to build upon. You can hit the ground running. It’s definitely a benefit.”</p>\n<p>He’ll begin his season at February’s Tour of Colombia, the race coming at the end of a block at altitude. Sleeping and training high is a modern-day prerequisite of a cyclist. “I haven’t really done that much altitude in my career, but it’s something you have to do now. It’s not like you’re getting the benefit from doing it; you are just not so much at the level [required] if you don’t do it now.”</p>\n<p><img alt=\"Michael Morkov, Mark Cavendish\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_4244.jpg?v=1702896037\" /></p>\n<p><em>Mørkøv will join Cavendish at Astana in 2024</em></p>\n<p>Cavendish will then almost certainly compete at the UAE Tour – a race he has previously likened to as the sprinter’s World Championships. Scheldeprijs will follow, but an eighth appearance at the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> is probably off the cards. “I had a lot of race days this year,” a nod to a disrupted winter that meant he was racing to find form. “I wasn’t racing this year to try to prove myself, to get selected for the Tour de France; I could work on being good at the Tour de France, which is how it always was in my career. It gives you a lot more comfort during the season and you can do what you need to do.”</p>\n<p>His team-mates, and coaches talk about him possibly being able to win more than 10 races in the 2024 season. He’s certainly got the support he craved, and the firepower to match. “Astana-Qazaqstan historically hasn’t focused on sprints, but we’ve got a team boss in Alex and management who know bike racing. It’s not like they’re clueless; it’s just that we’ve never really been in that direction.”</p>\n<p>For two decades Cavendish has been part of cycling’s fabric, his wins, defeats, achievements and travails all inscribed in the sport’s annals. “I am very fortunate that I’ve had a career [for] so long.” But he’s not done just yet. He’s still got a little bit more history to pen. “I have massive confidence,” he signs off.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"619d42bd9c66887434313639208e18562ecfa7dc0856d80f4ad2541b410d7a5b","category":"Cycling"}