{"title":"Quantitative characterization of microstructure and research on spatial variation characteristics of loess of different strata in Luochuan, Shaanxi, China","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303089","date":1715349600000,"content":"<p>by Yupeng Chang, Shaoqing Yuan</p>\r\n\r\nThe complete sequence of loess strata in Luochuan has become a typical section in loess strata, and is the main focus of research for many scholars studying loess. We were based on the theory of aeolian loess and established a set of quantitative index parameters for loess microstructure through our previous research, such as equivalent diameter, sphericity, morphology ratio, orientation angle Phi, orientation angle Theta, pore Eq-Radius, throat Eq-Radius and throat channelLength. Through the quantitative characterization of various index parameters of the Luochuan loess, we found that the probability density of each index parameter meets a specific distribution well, and in terms of spatial dimension, it shows that as the depth of the strata increases, the average particle size and the mode of pore Eq-Radius, throat Eq-Radius and throat channelLength generally increase, while the mode of particle morphology ratio generally decreases. In addition, loess particles in deeper strata are less prone to vertical sedimentation and tend to deposit gently or horizontally. Most particles in different strata are distributed in a northwest or southwest direction. During the formation period of strata, the main cause for spatial differences is the material carrying force. We conducted a statistical analysis on the correlation between the macroscopic physical properties of loess and its microstructure index parameters. Specifically, we found a positive correlation between loess density and the average particle size and the mode of particle equivalent diameter, Additionally, we found a negative correlation between loess liquid limit and plastic limit, and the mode of particle morphology ratio. Furthermore, there was a negative correlation between permeability coefficient and the mode of pore Eq-Radius, throat Eq-Radius, and throat channelLength.","author":"Yupeng Chang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"61a21a697ce64e2bd65821ee725826521cc5b9c04e54dbbad59eb16485f23901","category":"Interdisciplinary"}