{"title":"Cost–benefit analysis of ecosystem modeling to support fisheries management","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15741?af=R","date":1719289824000,"content":"<h2>Abstract</h2>\n<p>Mathematical and statistical models underlie many of the world's most important fisheries management decisions. Since the 19th century, difficulty calibrating and fitting such models has been used to justify the selection of simple, stationary, single-species models to aid tactical fisheries management decisions. Whereas these justifications are reasonable, it is imperative that we quantify the value of different levels of model complexity for supporting fisheries management, especially given a changing climate, where old methodologies may no longer perform as well as in the past. Here we argue that cost-benefit analysis is an ideal lens to assess the value of model complexity in fisheries management. While some studies have reported the benefits of model complexity in fisheries, modeling costs are rarely considered. In the absence of cost data in the literature, we report, as a starting point, relative costs of single-species stock assessment and marine ecosystem models from two Australian organizations. We found that costs varied by two orders of magnitude, and that ecosystem model costs increased with model complexity. Using these costs, we walk through a hypothetical example of cost-benefit analysis. The demonstration is intended to catalyze the reporting of modeling costs and benefits.</p>","author":"Matthew H. Holden, \nEva E. Plagányi, \nElizabeth A. Fulton, \nAlexander B. Campbell, \nRachel Janes, \nRobyn A. Lovett, \nMontana Wickens, \nMatthew P. Adams, \nLarissa Lubiana Botelho, \nCatherine M. Dichmont, \nPhilip Erm, \nKate J. Helmstedt, \nRyan F. Heneghan, \nManuela Mendiolar, \nAnthony J. Richardson, \nJacob G. D. Rogers, \nKate Saunders, \nLiam Timms","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"61a4c79a1186060a061a01c74e6adbcad5010536e30d207cbd32b8dfa71cc3b2","category":"Environment"}