{"title":"Validation of key components in designing a social skills training content using virtual reality for high functioning autism youth—A Fuzzy Delphi method","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301517","date":1712239200000,"content":"<p>by Mohd Akif Farhan Ahmad Basri, Wan Salwina Wan Ismail, Norazlin Kamal Nor, Noorlaili Mohd Tohit, Mohammad Nazir Ahmad, Nur Saadah Mohamad Aun, Tuti Iryani Mohd Daud</p>\r\n\r\nThe use of virtual reality in social skills training for high functioning autism spectrum disorder (HFASD) youth has been found to be engaging and enjoyable. Despite the promising results, previous literature indicates that there has been no consensus on the social skills target in the training content. There is also limited research on how evidence-based strategies like cognitive and behaviour techniques are instantiated into the VR environment to teach social skills. The aim of this study is to determine the key components to design a social skills training content using virtual reality for youths with HFASD. The Fuzzy Delphi method (FDM) was used to obtain expert consensus on social skills difficulties and cognitive behavioral techniques included in the content in three phases. In phase 1, a questionnaire was developed from in-depth interviews and scientific literature review. The in-depth interviews were conducted with 13 HFASD youth, 7 parents and 6 experts. In phase 2, 3 experts rated the relevance of the items in the questionnaire using an item-level content validity index (I-CVI) assessment. In phase 3, the questionnaire was distributed to 10 experts to rate their level of agreement on each component using a 7-point Likert scale. Components that received a value above 75%, threshold value (d) ≤ 0.2, fuzzy score (A) ≥ α - cut value = 0.5 and higher rank based on defuzzification score were prioritized to be included in the content. Items that received higher expert consensus on social skills difficulties included assessing non-verbal responses, initiating, maintaining, and leaving conversations, emotional difficulties and difficulties in perspective taking. Cognitive and behavioral techniques that received higher expert consensus were psychoeducation, modelling, relaxation techniques, reinforcements, and perspective-taking questions. These key components can be used as a framework for the development of virtual learning content for social skills training in future studies.","author":"Mohd Akif Farhan Ahmad Basri","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"61ba689d7587434ea92d4f90415623178c34acd95d8de60a1578c9a438d6403e","category":"Interdisciplinary"}