{"title":"A phylogeny-informed characterisation of global tetrapod traits addresses data gaps and biases","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002658","date":1720706400000,"content":"<p>by Mario R. Moura, Karoline Ceron, Jhonny J. M. Guedes, Rosana Chen-Zhao, Yanina V. Sica, Julie Hart, Wendy Dorman, Julia M. Portmann, Pamela González-del-Pliego, Ajay Ranipeta, Alessandro Catenazzi, Fernanda P. Werneck, Luís Felipe Toledo, Nathan S. Upham, João F. R. Tonini, Timothy J. Colston, Robert Guralnick, Rauri C. K. Bowie, R. Alexander Pyron, Walter Jetz</p>\r\n\r\nTetrapods (amphibians, reptiles, birds, and mammals) are model systems for global biodiversity science, but continuing data gaps, limited data standardisation, and ongoing flux in taxonomic nomenclature constrain integrative research on this group and potentially cause biased inference. We combined and harmonised taxonomic, spatial, phylogenetic, and attribute data with phylogeny-based multiple imputation to provide a comprehensive data resource (TetrapodTraits 1.0.0) that includes values, predictions, and sources for body size, activity time, micro- and macrohabitat, ecosystem, threat status, biogeography, insularity, environmental preferences, and human influence, for all 33,281 tetrapod species covered in recent fully sampled phylogenies. We assess gaps and biases across taxa and space, finding that shared data missing in attribute values increased with taxon-level completeness and richness across clades. Prediction of missing attribute values using multiple imputation revealed substantial changes in estimated macroecological patterns. These results highlight biases incurred by nonrandom missingness and strategies to best address them. While there is an obvious need for further data collection and updates, our phylogeny-informed database of tetrapod traits can support a more comprehensive representation of tetrapod species and their attributes in ecology, evolution, and conservation research.","author":"Mario R. Moura","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"61c3375c4cc8adead6a0659683be11d2c7b642e07701c389661a8c6ec50ef2c2","category":"Environment"}