{"title":"Eocene‐Oligocene Intensification of the Deep Western Boundary Current in the North Atlantic Ocean","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004731?af=R","date":1712309524000,"content":"<h2>Abstract</h2>\n<p>The role played by ocean circulation in major transitions in Earth's climate is debated. Here, we investigate the physical evolution of the Deep Western Boundary Current (DWBC) in the western North Atlantic Ocean through the late Eocene-to-mid Oligocene (35−26 Ma) using terrigenous grain size and geochemistry records of marine sediment cores. Our records cover the most pivotal transition in Cenozoic climate history, the Eocene-Oligocene Transition (EOT; ∼33.7 Ma), when Earth first became sufficiently cool to sustain large ice sheets on Antarctica. To assess changes in deep-water circulation in the northwest Atlantic across the EOT, we assembled sortable silt (10–63 μm) grain-size and Nd, Hf, and Pb radiogenic isotope records at two Integrated Ocean Drilling Program (IODP) drill sites on the Newfoundland ridges (Sites U1406 and U1411). These records reveal an overall gradual increase in sortable silt abundance (SS%) at both sites with no change in sediment provenance. We interpret a steady, long-term invigoration of the DWBC, likely driven by deepening of the Greenland-Scotland Ridge and resultant enhanced inflow of waters sourced from deep-water production sites in the Nordic Seas to the North Atlantic Ocean. Our results do not support abrupt and widespread invigoration of bottom current activity in the North Atlantic synchronous with accelerated cooling and Antarctic ice growth at the EOT. Instead, our records suggest that the DWBC started to intensify before this pivotal event in Cenozoic climate history (at ∼35 Ma) and then further strengthened gradually across the EOT (∼34 Ma) and through the early-to-mid Oligocene (∼34‒26 Ma).</p>","author":"Andrew M. Parent, \nKristin D. Chilton, \nTim E. van Peer, \nSteven M. Bohaty, \nJames F. Spray, \nHowie D. Scher, \nPaul A. Wilson, \nBrian W. Romans","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"61c851aeb237cacb8059e03f81d7f5108b9265fd040cd80337bccbea5f9f3b73","category":"Environment"}