{"title":"Novel Extracellular Exosome Promoting Tumor Aggressiveness and Metastasis in Gynecologic Cancer","link":"https://www.preprints.org/manuscript/202409.2374/v1","date":1727693335000,"content":"Cancer-derived extracellular exosomes (EXs) promote tumor metastasis. This study investigates novel EXs influencing tumor aggressiveness and metastasis in gynecologic cancer. Data from ES2-derived EXs on aggressive ES2 cells and ascites-derived mesenchymal-type ovarian carcinoma stromal progenitor cells (MSC-OCSPCs) were analyzed using LC-MS/MS and integrated with TCGA survival analysis. Two novel EXs, UBE2NL and HIST2H3PS2, were identified in more aggressive ES2-derivatives and MSC-OCSPCs cells, but not in less aggressive SKOV3 cells. High UBE2NL and HIST2H3PS2 expression in EOC tissues was associated with advanced-stage carcinoma (p&amp;lt;0.01) and shorter overall survival (p&amp;lt;0.01). Besides, high HIST2H3PS2 expression in endometrial cancer (EC) tissues was also associated with shorter overall survival (p&amp;lt;0.001) in all stages and advanced stages (p&amp;lt;0.0001). In vitro, SKOV3 cells overexpressing UBE2NL or HIST2H3PS2 exhibited significantly greater invasion ability than controls (p&amp;lt;0.001), further enhanced by their respective EXs (p&amp;lt;0.001). In contrast, ES2 knockdown UBE2NL reduced invasion ability than ES2 cells (p&amp;lt;0.001). In vivo, mice injected with ES2/shUBE2NL cells had a higher survival rate (p&amp;lt;0.001) and fewer disseminated tumors (p&amp;lt;0.05); in contrast, those injected with SKOV3/HIST2H3PS2 cells showed greater tumor dissemination (p&amp;lt;0.01) and more severe ascites (p&amp;lt;0.05) than controls. Tumor dissemination increased in mice receiving SKOV3/HIST2H3PS2 cells with EXs than those controls (p&amp;lt;0.05). These findings suggest that UBE2NL and HIST2H3PS2 expression and EXs contribute to tumor aggressiveness and metastasis in gynecologic cancer.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"61ca399f6ed985c1a5866fcd38b0c54a3d44ed6a9561563614a8a06292fd694a","category":"Interdisciplinary"}