{"title":"Apple Previews iOS 17 Accessibility Features Ahead of WWDC","link":"https://www.macrumors.com/2023/05/16/apple-previews-ios-17-accessibility-features/","date":1684239472000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2023/05/apple-previews-live-speech-personal-voice-and-more-new-accessibility-features/\">previewed</a> a wide range of new accessibility features for the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and Mac that are set to arrive later this year.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Apple-accessibility-iPad-iPhone-14-Pro-Max-Home-Screen.jpg\" alt width=\"1960\" height=\"1400\" />\r<br />\nApple says that the \"new software features for cognitive, speech, and vision accessibility are coming later this year,\" which strongly suggests that they will be part of <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, iPadOS 17, and macOS 14. The new operating systems are expected to be previewed at WWDC in early June before launching in the fall.\r<br />\n\r<br />\n<h3>Assistive Access</h3>\r<br />\nAssistive Access distills ‌iPhone‌ and ‌iPad‌ apps and experiences to their core features. The mode includes a customized experience for Phone and <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>, which are combined into a single Calls app, as well as Messages, Camera, <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a>, and Music. The feature offers a simplified interface with high contrast buttons and large text labels, as well as tools to help tailor the experience. For example, users can choose between a more visual, grid-based layout for their <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a> and apps, or a row-based layout for users who prefer text.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/assistive-access-mode-apps.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\n\r<br />\n<h3>Live Speech and Personal Voice Advance Speech Accessibility</h3>\r<br />\nLive Speech on the ‌iPhone‌, ‌iPad‌, and Mac allows users to type what they want to say and have it spoken out loud during phone and ‌FaceTime‌ calls, as well as in-person conversations. Users can also save commonly used phrases to chime into conversations quickly. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/live-speech.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nUsers at risk of losing their ability to speak, such as those with a recent diagnosis of amyotrophic lateral sclerosis (ALS), can use Personal Voice to create a digital voice that sounds like them. Users simply need to read along with a randomized set of text prompts to record 15 minutes of audio on an ‌iPhone‌ or ‌iPad‌. The feature uses on-device machine learning to keep users' information secure and private, and integrates with Live Speech so users can speak with their Personal Voice.\r<br />\n\r<br />\n<h3>Detection Mode in Magnifier and Point and Speak</h3>\r<br />\nIn the Magnifier app, Point and Speak helps users interact with physical objects that have several text labels. For example, while using a household appliance, Point and Speak combines input from the Camera app, the LiDAR Scanner, and on-device machine learning to announce the text on buttons as users move their finger across the keypad.\r<br />\n\r<br />\n<div></div>\r<br />\n\r<br />\nPoint and Speak is built into the Magnifier app on ‌iPhone‌ and ‌iPad‌, works with VoiceOver, and can be used with other Magnifier features such as People Detection, Door Detection, and Image Descriptions to help users navigate their physical environment more effectively.\r<br />\n\r<br />\n<h3>Other Features</h3>\r<br />\n<ul>\r<br />\n\t<li>Deaf or hard-of-hearing users can pair Made for ‌iPhone‌ hearing devices directly to a Mac with specific customization options.</li>\r<br />\n\t<li>Voice Control gains phonetic suggestions for text editing so users who type with their voice can choose the right word out of several that might sound similar, like \"do,\" \"due,\" and \"dew.\"</li>\r<br />\n\t<li>Voice Control Guide helps users learn tips and tricks about using voice commands as an alternative to touch and typing.</li>\r<br />\n\t<li>Switch Control can now be activated to turn any switch into a virtual video game controller.</li>\r<br />\n\t<li>Text Size is now easier to adjust across Mac apps including Finder, Messages, Mail, Calendar, and Notes.</li>\r<br />\n\t<li>Users who are sensitive to rapid animations can automatically pause images with moving elements, such as GIFs, in Messages and Safari.</li>\r<br />\n\t<li>Users can customize the speed at which <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> speaks to them, with options ranging from 0.8x to 2x.</li>\r<br />\n\t<li>Shortcuts gains a new \"Remember This\" action, helping users with cognitive disabilities create a visual diary in the Notes app.</li>\r<br />\n</ul><div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/accessibility/\">Accessibility</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/16/apple-previews-ios-17-accessibility-features/\">Apple Previews iOS 17 Accessibility Features Ahead of WWDC</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-previews-ios-17-accessibility-features-ahead-of-wwdc.2389667/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"61cd0500d99b9070435c39047e0c303d567ffd1a327128c7d69eecd3a7abe968","category":"Apple"}