{"title":"Comparative evaluation of selected concentrations of sodium hypochlorite on the outcome of endodontic therapy among Ghanaians","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306693","date":1720447200000,"content":"<p>by Akua B. Konadu, Patrick C. Ampofo, Moses L. Akyeh, Sandra A. Hewlett, Kofi Osei-Tutu, Ebenezer A. Nyako</p>\r\nBackground <p>Endodontic treatment is one of the main dental treatments to manage inflamed or infected root canal systems of teeth. The success of endodontic treatment principally depends on eradicating microorganisms in the root canal by chemo-mechanical debridement with irrigation solutions like sodium hypochlorite (NaOCl). NaOCl has been used in concentrations ranging from 0.5% to 5.25%. This study determined the antimicrobial effectiveness of selected concentrations (0.5%, 1.0%, 2.6%, and 5.2%) of NaOCl in endodontic treatment.</p> Methods <p>The study sites were the University of Ghana Dental School (UGDS) and Noguchi Memorial Institute for Medical Research (NMIMR). Sixty infected single-rooted single-canal teeth were used. Before (S<sub>1</sub>) and after (S<sub>2</sub>), root canal samples during the endodontic treatment with the selected concentrations of NaOCl were examined via anaerobic and aerobic cultures. The isolates were identified using Matrix Assisted Laser Desorption Ionization-Time Of Flight Mass Spectrometry (MALDI-TOF MS).</p> Results <p>All S<sub>1</sub> samples were positive for cultivable bacteria. Fifty-three (53) different microbial species belonging to 20 different microbial genera were isolated. <i>Streptococcus viridans</i> was the most frequently isolated microbe. There were zero isolates in the root canals irrigated with 2.6% and 5.2% NaOCl. Two teeth had isolates in the groups irrigated with the lower concentrations (0.5% and 1.0%) of NaOCl. The persistent bacteria were one species each of <i>Streptococcus mitis</i> and <i>Streptococcus oralis</i>, respectively.</p> Conclusion <p>Root canal treatments using chemo-mechanical preparation with the selected concentrations (0.5%, 1.0%, 2.6%, and 5.2%) of NaOCl were effective in significantly reducing the microbial load, and for the 5.2% and 2.6% concentrations, in eliminating all the microorganisms.</p>","author":"Akua B. Konadu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"61cf8ac5a4f2f8bab7adfe389850d7c3081604a3ae7f3feee4872edaa15ef5d3","category":"Interdisciplinary"}