{"title":"Dissociation of transcription factor MYB94 and histone deacetylases HDA907/908 alleviates oxidative damage in poplar","link":"https://academic.oup.com/plphys/article/196/1/181/7689886?rss=1","date":1717718400000,"content":"<span><div>Abstract</div>Drought is one of the major threats to forest productivity. Oxidation stress is common in drought-stressed plants, and plants need to maintain normal life activities through complex reactive oxygen scavenging mechanisms. However, the molecular links between epigenetics, oxidation stress, and drought in poplar (<span>Populus</span>) remain poorly understood. Here, we found that <span>Populus</span> plants overexpressing <span>PtrMYB94</span>, which encodes an R2R3-MYB transcription factor that regulates the abscisic acid signaling pathway, displayed increased tolerance to extreme drought stress via upregulation of <span>embryogenic cell phosphoprotein 44</span> (<span>PtrECPP44</span>) expression. Further investigation revealed that PtrMYB94 could recruit the histone deacetylases PtrHDA907/908 to the promoter of <span>PtrECPP44</span> and decrease acetylation at lysine residues 9, 14, and 27 of histone H3, leading to relatively low transcriptional expression levels under normal conditions. Drought induced the expression of <span>PtrMYB94</span> while preventing interaction of PtrMYB94 with PtrHDA907/908, which relaxed the chromatin structure and facilitated the binding of RNA polymerase II to the <span>PtrECPP44</span> promoter. The upregulation of <span>PtrECPP44</span> helped poplar alleviate oxidative damage and maintain normal cell activities. This study establishes a PtrMYB94-PtrECPP44 transcriptional regulatory module modified by PtrHDA907/908 in modulating drought-induced oxidative stress recovery. Therefore, our study reveals an oxidative regulatory mechanism in response to drought stress and provides insights into molecular breeding for stress resistance in poplar.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"61d19b12f687f32d4d5317496954fa9182c5dc1a27def8ce64a835bcff26a617","category":"Environment"}