{"title":"Agricultural exposures and DNA damage in PBMC of female farmers measured using the alkaline comet assay","link":"http://link.springer.com/10.1007/s00420-024-02049-z","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <span>\n                      <h3>Objective</h3>\n                      <p>Several studies investigated the link between agricultural occupational exposures and DNA damage, in an attempt to bring elements of biological plausibility to the increased cancer risk associated with them. However, only a few of these studies focused on females.</p>\n                    </span>\n                    <span>\n                      <h3>Methods</h3>\n                      <p>The comet assay was performed on PBMC (Peripheral Blood Mononuclear Cells) samples from 245 females working in open field farming and cattle raising, located in the Normandy area of France. Individual questionnaires on tasks performed were administered at the time of sampling to directly assess exposures. Environmental exposures were issued from a questionnaire assessing the farm productions. Linear regression analyses were done using the DNA damage scores.</p>\n                    </span>\n                    <span>\n                      <h3>Results</h3>\n                      <p>Regarding direct exposures, several tasks associated with exposure to potentially harmful chemicals were not associated with DNA damage, but a longer duration of use of herbicide on meadows (<em>p</em> = 0.05) or of cleaning and upkeep of agricultural equipment (<em>p</em> = 0.06) revealed higher DNA damage levels, although the number of exposed women was low. Several indirect and/or environmental exposures were associated with DNA damage in multivariate analyses: a larger surface of meadows (<em>p</em> = 0.006) or the presence of poultry (<em>p</em> = 0.03) was associated with less DNA damage, while the presence of swine (<em>p</em> = 0.01) was associated with higher DNA damage. Smokers and former smokers had less DNA damage than non-smokers (<em>p</em> = 0.0008 and <em>p</em> = 0.03).</p>\n                    </span>\n                    <span>\n                      <h3>Conclusions</h3>\n                      <p>We report modified levels of DNA damage for those environmentally exposed to meadows, poultry and pig farming, underlining the need for a better knowledge of the potential health risks experienced by females in this setting.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"61d335f5ada7b29cc4b60735616c9c44568ebe06add3c5ec25fa978448939554","category":"Environment"}