{"title":"Genetic characterization of 2 Ceutorhynchus (Coleoptera: Curculionidae) weevils with mitogenomes and insights into the phylogeny and evolution of related weevils","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae038/7636139?rss=1","date":1711497600000,"content":"<span><div>Abstract</div>The rape stem weevil (<span>Ceutorhynchus asper</span> Roel.) and its close relatives primarily breed on cruciferous plants and cause severe damage to rapeseed production. However, their genetic and molecular information is still scarce. Here, we generated mitogenomes for both <span>C. asper</span> and <span>Ceutorhynchus albosuturalis.</span> The lengths of the 2 mitochondrial genomes are 14,207 bp (<span>C. asper</span>) and 15,373 bp (<span>C. albosuturalis</span>), and both weevils exhibit identical numbers of protein-coding genes with the absence of trnI. A + T contents for both mitogenomes are high (80% and 79.9%, respectively). Haplotype and genetic distance analyses showed that the genetic differentiation of <span>C. asper</span> populations in northwestern China is low. Based on 5 datasets from mitogenomes, phylogenetic analyses with maximum-likelihood and Bayesian methods show that both species (<span>C. asper</span> and <span>C. albosuturalis</span>) fall in the CCCMS clade (Curculioninae, Conoderinae, Cossoninae, Molytinae, and Scolytinae) of Curculionidae and belong to clades H and I of the genus <span>Ceutorhynchus</span>, respectively. Larvae of the clade H weevils mainly are borers in petioles or stems of cruciferous plants, while larvae of the clade I weevils mainly inhabit the fruits of the same plants, suggesting that ecological niche specialization can play a critical role in the diversification of <span>Ceutorhynchus</span> species. This study generates baseline molecular and genetic information for future research of <span>Ceutorhynchus</span>-related taxa and provides insights into the phylogeny and evolution of Curculionidae.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"61dc2606f2c036aad064e9055cb548e29b22eb50dc68a1d03316c7c49d5edd4a","category":"Environment"}