{"title":"HashiCorp Vault Integrates with ServiceNow for Credential Management","link":"https://www.hashicorp.com/blog/hashicorp-vault-integrates-with-servicenow-for-credential-management","date":1633536000000,"content":"<p>HashiCorp is pleased to announce that HashiCorp Vault is now integrated with ServiceNow for seamless consumption of Vault secrets. HashiCorp Vault is an identity-based security solution that leverages trusted sources of identity to keep secrets and application data secure. This new integration — now available in the <a href=\"https://store.servicenow.com/sn_appstore_store.do#!/store/application/3ee1c80c1b257010c216ebd56e4bcb33/0.1.0?referer=%2Fstore%2Fsearch%3Flistingtype%3Dallintegrations%25253Bancillary_app%25253Bcertified_apps%25253Bcontent%25253Bindustry_solution%25253Boem%25253Butility%25253Btemplate%26q%3Dhashicorp&amp;sl=sh\">ServiceNow App Store</a> — enables operators and practitioners to easily access credentials stored in Vault from ServiceNow to streamline secure discovery and workflow automation to third-party systems.</p><img src=\"https://www.datocms-assets.com/2885/1633466711-servicenow-integrations-store.png\" /><h2><a href=\"#vault-credential-resolver-for-discovery\">»</a><a></a>Vault Credential Resolver for Discovery</h2>\n<p>This <a href=\"https://www.vaultproject.io/docs/platform/servicenow\">new integration</a> enables ServiceNow to query Vault as an external credential resolver and retrieve secrets from Vault. This integration enables organizations to use Vault as their centralized secrets store for ServiceNow workflows to reduce secret sprawl while leveraging Vault’s granular access and audit capabilities. ServiceNow administrators can easily install Vault Credential Resolver on their ServiceNow instance to quickly retrieve credentials from Vault through the ServiceNow MID server. See the Vault Credential Resolver <a href=\"https://www.vaultproject.io/docs/platform/servicenow/installation\">installation guide</a> to learn how to enable Vault to communicate with ServiceNow MID to consume secrets directly from Vault.</p>\n<h2><a href=\"#expanded-integrations-between-hashicorp-and-servicenow\">»</a><a></a>Expanded Integrations Between HashiCorp and ServiceNow</h2>\n<p>This announcement follows an existing <a href=\"https://www.hashicorp.com/blog/announcing-servicenow-integration-for-terraform-enterprise\">integration between HashiCorp Terraform Cloud and ServiceNow</a> that provides provisioning automation through infrastructure as code, ensuring security, compliance, and cost-sensitive policy enforcement. That integration lets users access <a href=\"https://store.servicenow.com/sn_appstore_store.do#!/store/application/a3f7fe62dbe033009ba2f8fdbf96192a/2.0.0?referer=%2Fstore%2Fsearch%3Flistingtype%3Dallintegrations%25253Bancillary_app%25253Bcertified_apps%25253Bcontent%25253Bindustry_solution%25253Boem%25253Butility%26q%3Dterraform&amp;sl=sh\">Terraform through the ServiceNow App Store</a> to accelerate development of ServiceNow workflows.</p>\n<p>Now, with this integration between Vault and ServiceNow, organizations can scale workflows in the cloud efficiently and securely. By centralizing secrets management for API keys, database credentials, and so on, Vault ensures that addressing security issues will not hinder the development of critical business applications and workflows that drive growth.</p>\n<p>Brian Emerson, Vice President of Products, ITOM, at ServiceNow, said, “HashiCorp has been a tremendous partner to ServiceNow by making it easy for our joint customers to connect the workflow automation power of the Now Platform with the infrastructure workflow capabilities of Terraform Enterprise. Now, practitioners, teams, and global businesses can easily scale critical ServiceNow workflows in a way that strengthens their security posture.”</p>\n<h2><a href=\"#see-this-integration-in-action\">»</a><a></a>See This Integration in Action</h2>\n<p>To learn more about this new integration between HashiCorp Vault and ServiceNow and how it helps streamline secrets management, join <a href=\"https://www.hashicorp.com/events/webinars/using-hashicorp-vault-as-a-centralized-credential-resolver-from-servicenow\">our upcoming webinar</a> on Tuesday, October 26th, 2021 at 10 a.m. PT.</p>","author":"Megan LaFlamme","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"61dcfe1d501400e31e7342f1df7b12d2fe8e6d1da789be7a83f83beb807be6f7","category":"Tech"}