{"title":"New NASA satellite to continue half a century of changing Earth observations","link":"https://arstechnica.com/?p=1798530","date":1632749631000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/lakepowellquad_oli_2021120.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/lakepowellquad_oli_2021120.jpg\">Enlarge</a> <span>/</span> Natural color images from March 1999, April 2005, May 2011, and April 2021 by Landsat satellites chronicle the shrinking Lake Powell reservoir and Lower Colorado River. (credit: NASA/USGS)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>A Delta rocket launched the small Earth Resources Technology Satellite in July 1972 with a simple mission: to capture multi-spectral imagery of the planet and assess changes over time.</p>\n<p>Data from the polar-orbiting satellite proved so useful that NASA and the US Geological Survey renamed the vehicle Landsat 1 in 1975, and the organizations have since launched a succession of increasingly sophisticated \"Landsat\" satellites to continue observations. As a result, we now have a nearly half-century long record of changes to the planet's surface—from farms and forests to glaciers and urban areas.</p>\n<p>While the data from the Landsat missions has proved invaluable, it has also been somewhat depressing. The satellites have amassed an impartial record of tropical deforestation in the Amazon, verifying the claims of environmental protection organizations. They have also cataloged increasing water scarcity in the Western United States and chronicled ice losses across the vast majority of Earth's glaciers.</p></div><p><a href=\"https://arstechnica.com/?p=1798530#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1798530&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"61ddd0170cef125a7e7d089837cdf0a900ecf67b3dfc6990d7b73bc3a8dffd43","category":"Tech"}