{"title":"Regulation of LaeA and Velvet Proteins on the Production of Mycotoxins and Other Fungal Secondary Metabolites","link":"https://www.preprints.org/manuscript/202407.1280/v1","date":1721109536000,"content":"Fungi are rich sources of secondary metabolites of agrochemical, pharmaceutical and food importances, such as mycotoxins, antibiotics and antitumor agents. Secondary metabolites play vital roles in fungal pathogenesis, growth and development, oxidative status modulation, and adaptation/resistance to various environmental stresses. LaeA contains an S-adenosylmethionine binding site and displays methyltransferase activity. The members of velvet proteins include VeA, VelB, VelC, VelD and VosA, for each member with a velvet domain. LaeA and velvet proteins can form multimeric complexes such as VosA-VelB and VelB-VeA-LaeA. They belong to global regulators and are mainly impacted by light. One of their most important functions is to regulate gene expression that are responsible for secondary metabolite biosynthesis. The aim of this mini-review is to represent the newest cognition on the biosynthetic regulation of mycotoxins and other fungal secondary metabolites by LaeA and velvet proteins. In most cases, LaeA and velvet proteins positively regulated production of fungal secondary metabolites. The regulated fungal species mainly belong to the toxigenic fungi from the genera of Alternaria, Aspergillus, Botrytis, Fusarium, Magnaporthe, Monascus, and Penicillium for the production of mycotoxins. We can control secondary metabolite production to inhibit the production of harmful mycotoxins while promoting the production of useful metabolites by global regulation of LaeA and velvet proteins in fungi. Furthermore, the regulation by LaeA and velvet proteins should be a practical strategy in activating silent biosynthetic gene clusters (BGCs) in fungi to obtain previously undiscovered metabolites.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"61ecce1250b3353e012cd7d959d0593c2ee5d15bf01c789bb78ef64ed8b0218a","category":"Interdisciplinary"}