{"title":"Savouring the 2023 season with Ned Boulting","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/ned-boulting-on-the-2023-road-book","date":1702575716000,"content":"\n      <p><span>Sport. It is a worldwide phenomenon. Pick a point anywhere in the world, and you can talk about sports, whether that's football, cricket, tennis, cycling, badminton, or darts. There is so much to discuss for each and every sport and its individual heroes and heroines. And that is because sport creates stories.</span></p>\n<p><span>For hundreds of years, sport has been colouring our lives, sometimes in good ways and sometimes in not-so-good ways. It has also evolved as new champions take the reins, new trends and technologies come to light, and more people take the chance at becoming number one.</span></p>\n<div></div>\n<div></div>\n<p><span>One man who can share a story or two is Ned Boulting, especially when it comes to football, darts or cycling. He has been a journalist and broadcaster for almost three decades now and has been witness to the peaks and troughs of sporting legends over the years. However, it is in cycling that he has really made a name for himself having commentated on the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> for the British broadcasting channel ITV4 for 20 years, as well as now commentating on the Tour of Britain and <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>. He also hosts the podcast, </span><i><span>Never Strays Far</span></i><span>, with David Millar and Pete Kennaugh, has published a number of books about cycling, and is one of the Rouleur magazine columnists. </span></p>\n<p><span>Ned has seen the rhymes and rhythms of the road racing scene change throughout the years. He has witnessed the rise and fall of cyclists, the dramatic twists and turns, and the prevalence of great young riders who have dominated the seasons. And for the last six years, he has been documenting the season in a hefty, red book entitled, </span><i><span>The Road Book</span></i><span>.</span></p>\n<p><span>“It wasn’t my idea actually,” Boulting said when asked about his reason for creating the book. Instead, it was a friend of his who had been working within cycling but had come from a football and athletics background who suggested to Boulting a book of this style, something similar to the Cricket’s<em> Wisden </em>almanack which has been produced and printed for 160 years.</span></p>\n<p><span>“He just felt that this sport was tailor-made for a publication like this because it is such a hard sport to contain,” Boulting added. “It is so full of differences, anomalies, and peculiarities, but it is actually quite esoteric and patterns emerge over the years. So, to pull it all together in a beautiful kind of hardback form and then pop it away for posterity seemed to be a good idea that would do great service to a sport that a lot of people admire greatly but don’t always understand.”</span></p>\n<p><span>With sheer determination, Boulting got the first edition over the line in 2018, and despite being turned away by the big publication houses, Boulting and his team found a way of making it work. Six years later, the sixth edition has recently been published and features day-by-day race reports, in-depth essays from some of cycling’s most esteemed writers, obituaries, historical results, end-of-season team rankings, plus much more, in the book’s 938 pages.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/117_Launch_Evening_VIA_by_Alessandra_Bucci_-7243.jpg?v=1702378061\" /><em><span>Ned Boulting at a Rouleur event in London (Alessandra Bucci)</span></em></span></p>\n<p><span>Boulting’s favourite essay from the sixth edition he said is Kate Wagner’s piece titled, <em>The Pogačar Complex</em>. Tadej Pogačar is a rider who has featured heavily in the last few editions thanks to his impressive rise to become one of the greatest cyclists of this generation, but Boulting felt it was the right time to really get under the skin of Pogačar. “It’s strange that I picked the one year where he doesn’t win a Grand Tour to focus on Tadej,” Boulting laughed. “But I think that we collectively got to know a lot more about Tadej Pogačar through his failure than we probably knew before. And I think that is best summed up in the moment that we all witnessed during the Tour de France, where the team radio flashed up, and he said, ‘I’m dead. I’m gone’. We actually heard his words in the middle of the race, which in the 100, 120-year history, was completely unprecedented. To get almost live audio from a great champion like Tadej Pogačar conceding the Tour de France in the middle of the race was a genuinely historic moment, and I think Kate’s piece will be one I’ll go back to for many years to come.”</span></p>\n<p><span>Looking back over the years is the essence of <em>The Road Book</em> and one that Boulting set out to achieve when he began publishing it, although he admitted that he wished he had been able to start earlier or have someone produce a book like this back in 1903 when iconic races like the Tour de France began. But he acknowledged that “you have to start somewhere”. Nonetheless, throughout the six editions, there is a detailed calibration of what is happening in the world of road racing during that time, and the recent inclusion of a cyclocross section and the significant rise in women’s races since 2018 demonstrates cycling’s evolution, even just within the past six years.</span></p>\n<p><span>One thing that doesn’t change, however, is how the book is produced and published. The paper is the same, the beautiful pillar-box red cover is the same, the illustrations are done by the same person, and so are the photographs. This is not a coincidence, Boulting wanted to purposely keep everything in<em> The Road Book</em> the same, a contradiction to the changing peloton. He said, “<em>The Road Book</em> has a timeless quality, and while road racing may change, the way we deal with it and the respect we give to the book doesn’t change.” </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/117_Launch_Evening_VIA_by_Alessandra_Bucci_-7049.jpg?v=1702378095\" /><em><span>The Road Book illustrations by Matthew Green are printed onto postcards for people to keep (Alessandra Bucci)</span></em></span></p>\n<p><span>A big part of Boulting’s role in <em>The Road Book</em> is to edit the full edition, cover to cover, but he also contributes a big portion of the book’s words, from the 15-page editor’s introduction, which gives a sweeping view of the entire season, to the 350-word daily race reports, to the small chunks of writing that introduce each section of the book like the obituaries or the gallery. It is no easy task, and it’s certainly a true labour of love. This is especially true because as soon as one edition is printed and in the hands of its readers, Boulting sets about working on the next edition, predicting almost what will happen in the upcoming season commissioning the writers for each of the eight essays. “Then you’re in the lap of the Gods,” Boulting laughed.</span></p>\n<p><span>In 2018, <em>The Road Book</em> featured winning words from riders such as Chris Froome, who had won that year’s <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, and Geraint Thomas, who won the prestigious yellow jersey. They also had Anna van der Breggen be awarded the female rider of the year award in the front pages of the book. In the most recent edition, the pages featured Tadej Pogačar, Demi Vollering, Mathieu van der Poel, Jonas Vingegaard, Lotte Kopecky, a new generation of riders with new ways of winning. Boulting added that even just from 2018 to 2023 people would think the words in the book were speaking about a different sport from a completely different era because of how things have moved and developed in such a short space of time. But this is what makes <em>The Road Book</em> so unique to Boulting, the fact that every person can pick up the book and relive the narratives. </span></p>\n<h3><b>A look back on the 2023 season</b></h3>\n<p><b>Favourite moment of the season? </b></p>\n<p><span>“I was lucky enough to be there in Rome when [Mark] Cavendish pulled off that last victory. As with great stories, you always have to set it in context, and in the context of Cavendish’s entire career, that had great significance because he had never not won a stage at the Giro d’Italia and he did it as the last possible moment. But also, in the context of the Giro, what he had been through to get to that point in Rome to give himself that chance with 100 metres to go at the end of the Grand Tour was extraordinary, because make no mistake, that was a brutal edition of the Giro d’Italia. Remember the rain in the middle week, the Covid cases, it was awful, it was hard as hell. The mental resilience of that man to give himself that last chance just backs up everything that we think we know about him. Then, of course, the kind of fairytale recruitment of Geraint Thomas as this kind of ad hoc lead-out. </span></p>\n<p><span>“And again, a detail that emerges from his account [in the 2023 Road Book], that I didn’t know about until he gave me his account, was that the race route took him straight past an apartment that he used to own in the middle of Rome, near the Colosseum. You forget how much Mark Cavendish is bound up with Italy, and his origin story, if you like, goes right back to racing in Italy. So, for me, that was the moment of racing that was charged with more emotion than any other moment.”  </span></p>\n<p><b>A rider that surprised him the most? </b></p>\n<p><span>“I had no idea Demi Vollering was going to be as dominant as she actually was. I know that she didn’t win the Vuelta, and I know she didn’t go to the Giro, but the one that really mattered to her was the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> and she demolished Annemiek van Vleuten at the Tour de France. I wasn’t prepared for that, the rapidity of the changing of the guard. I knew it was Van Vleuten’s last season, but I didn’t know that a chasm would open up between her departing shape and Vollering, who surely is the great champion for years to come now. And I didn’t know Vollering was that much of a beast on the long form climbs up to altitude as well! </span></p>\n<p><span>“And in the men’s peloton, the men’s rider who surprised me but perhaps in a different direction was Wout van Aert appeared to be human in 2023. He tried to ride like he did in 2022 but couldn’t quite back it up. He had some notable victories, but he wasn’t quite the marauding presence that he seemed to be throughout 2022. One of his most significant wins strangely came at the Tour of Britain, which, in the grand scheme of things, is not the most important race on the calendar, but his determination to come away at the end of it, I mean he turned himself inside out to win that. And it said a lot about him. So he was interesting to me this year and I am fascinated to see what he does next year.” </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-107125.jpg?v=1702378361\" /><em>Wout van Aert on the podium at the 2023 Tour of Britain (SWPix.com)</em></span></p>\n<p><b>A rider who didn’t live up to expectations? </b></p>\n<p><span>“I hated watching Sam Bennett ride in 2023. I thought it was agonising. I’ve very rarely seen a rider more uncomfortable in his profession than Sam Bennett looked in 2023 – it looked like he’d rather be anywhere else than at the start of a bike race, let alone at the business end of it. He’s a lovely guy, Sam, and I hope that one amazing year he had when he took the green jersey in 2020, wasn’t it. </span></p>\n<p><span>“In the women’s I guess for similar reasons perhaps, but I felt deflated watching Annemiek van Vleuten. She massively underperformed in the Classics. I mean, historically underperformed. She hasn’t been that mediocre for seven or eight years. But she was because we all thought she had stacked all her chips on the Col du Tourmalet, and in the end, she was powerless by her own frank admission. She didn’t have anything left. And I will propose a point of view I will never forget, seeing her as a fan in Glasgow for the women’s <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uci-road-world-championship-2023-route-all-you-need-to-know-about-the-routes-for-the-men-s-and-womens-races\">World Championships</a> road race in that final selection of elite riders on the finishing circuit, but nowhere near the front and actually dropped on her own quite early on. That was a tough watch. I felt for her that that's the way in the end it all finished.” </span></p>\n<p><b>Which riders does he think will make <em>The Road Book</em> awards page in 2024? </b></p>\n<p><span>“I think it’ll be Tadej Pogačar. We forget too easily that he came to the 2023 Tour de France off the back of an injury and wasn’t fit. I think he’ll win the Tour de France next year, so we will celebrate that by making him the male rider of the year. </span></p>\n<p><span>“I would like to see Marlen Ruisser do something extraordinary with what remains of her career. I think she made huge strides in 2023, but I wonder whether with her, she can’t pull off a string of really notable achievements, and I see absolutely no reason why she isn’t going to win <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a>. So, I would like to see Marlen Ruisser as the women’s rider of the year in 2024. And by the way, there is a fascinating essay written about her by a Dutch journalist called Marijn de Vries in the 2023 <em>Road Book</em>.”</span></p>\n<p><a href=\"https://www.rouleur.cc/collections/books/products/the-road-book-2023-signed-edition-ned-boulting\"><em><strong>Buy a signed edition of the 2023 Road Book from the Rouleur Emporium</strong></em></a></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"61ee0f76a9fead49ed90ae5c329ff27a480b38af8439fde748278a97ca05e8bf","category":"Cycling"}