{"title":"Mental Detours Part Two: The Italy Divide to Rome and a Dolomites Mini-Tour – Hailey Moore","link":"https://theradavist.com/bikepacking-italy-divide-dolomites/","date":1707220823000,"content":"<p><em>In part two of her Reportage from bike touring in Italy, <a href=\"https://theradavist.com/tag/hailey-moore/\" target=\"_blank\">Hailey Moore</a> writes about arriving in Rome and feeling the weight of history in the Eternal City. She and Anton Krupicka also tack on a three-day multi-sport tour in the Dolomite mountains. <span></span></em></p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1367\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04775.jpg?fit=1200,1367&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04775.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/DSC04775.jpg?resize=1200,801&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04775.jpg?resize=2000,1335&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04775.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04775.jpg?resize=1536,1025&amp;quality=75 1536w\" /></p>\n<p><em>Overlooking Florence</em></p>\n<p>We left Florence under the breeze-less oppression of a mid-afternoon sun and entered the rolling vineyard-scapes of Tuscany. After a couple hours of ticking off climb after punchy climb, a ripping two-track descent led us into the town Greve in Chianti. Our morning of sightseeing had set an unhurried tone for the day and we decided to stop for a pre-dinner plate of fries and cold drinks at La Cantina in town.</p>\n<p>As we were leaning the bikes against a wall outside of the restaurant’s patio, a man who had an owner’s air of authority approached us with menus and motioned for us to bring the bikes inside the patio’s boundary, while cradling a phone between his shoulder and ear and continuing his conversation in Italian. We’d gotten used to our bikes being seen as nuisances by many of the establishments we’d stopped at (from hotels, to restaurants) along the route, so to feel that this man was taking the safety of our bikes into consideration immediately put us at ease.</p>\n<p>The man seated us and doled out menus like a card dealer, with about the same level of attention you might give to the task of folding laundry while talking on the phone. With nothing more than a vague wave of a hand, he walked away, leaving us laughing about his intense nonchalance. But when our server arrived, in addition to a carafe of water she came bearing two glasses of white wine and said they were courtesy of the owner. The unexpected hospitality continued with two slices of a cheesecake-like dessert at the end of our meal. I think these small kindnesses always amount to more than the giver can know, and the random stop proved to be one of the more lasting memories of the trip.</p>\n<p><img loading=\"lazy\" width=\"3021\" height=\"2455\" src=\"https://media.theradavist.com/uploads/2024/02/IMG_2536.jpg?fit=1200,2455&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/IMG_2536.jpg?w=3021&amp;quality=75 3021w, https://media.theradavist.com/uploads/2024/02/IMG_2536.jpg?resize=1200,975&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/IMG_2536.jpg?resize=2000,1625&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/IMG_2536.jpg?resize=768,624&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/IMG_2536.jpg?resize=1536,1248&amp;quality=75 1536w, https://media.theradavist.com/uploads/2024/02/IMG_2536.jpg?resize=2048,1664&amp;quality=75 2048w\" /> <img loading=\"lazy\" width=\"3024\" height=\"4032\" src=\"https://media.theradavist.com/uploads/2024/02/IMG_7643.jpeg?fit=1200,4032&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/IMG_7643.jpeg?w=3024&amp;quality=75 3024w, https://media.theradavist.com/uploads/2024/02/IMG_7643.jpeg?resize=1200,1600&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/IMG_7643.jpeg?resize=2000,2667&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/IMG_7643.jpeg?resize=768,1024&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/IMG_7643.jpeg?resize=1152,1536&amp;quality=75 1152w, https://media.theradavist.com/uploads/2024/02/IMG_7643.jpeg?resize=1536,2048&amp;quality=75 1536w\" /></p>\n<p><em>Surprise wine and cake for us weary travelers</em></p>\n<p>We finished the half day of riding with the 1,000-foot climb up to Panzano—where we passed a couple L’Eroica after-party gatherings—and the ensuing descent, before finding a roomy pull-off on a gravel road to pitch the tent. While riding in Slovenia the week prior, we’d been warned to keep an eye out for bears—which, for us Coloradoans, was at least a familiar threat—and while we hadn’t received the same cautionary advice in Italy, we had been told about the <a href=\"https://www.nationalgeographic.com/animals/article/wild-boars-are-wreaking-havoc-in-europe-spurring-creative-solutions\" target=\"_blank\">proliferating population of wild boars</a>. Wild boars!? I thought. Yikes! We don’t have grizzlies in Colorado, but I’ve seen my fair share of black bears, ambling through garbage-can lined alleys, and feel <em>mostly</em> confident that, given a wide berth, they will pay you no mind. However, I felt altogether less sure about the notion of encountering a wild boar, and couldn’t help but be reminded of <a href=\"https://theradavist.com/the-bird-was-a-butterfly-ana-orenz-on-recovering-from-injury/\" target=\"_blank\">Ana Orenz’s untimely and devastating encounter with a sounder of boars</a> during the Trans Pyrenees race a few years back.</p>\n<p>Looking at the elevation profile for the miles ahead, the route’s changeable nature seemed guaranteed to continue and we’d flagged the pull-off (using Google Maps terrain view) as the best-looking option for a flat spot to sleep. But as we rolled past the dark rows of an orchard about a half mile before our pull-off, I suddenly saw the coarse outline of a creature retreating through the trees. I turned my head with just enough time to wonder at the stiff-legged canter—ruling out dog or bear—and to catch a glimpse of a thick, protruding snout. I was all but certain it had been a boar.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1536\" src=\"https://media.theradavist.com/uploads/2024/02/IMG_2559.jpg?fit=1200,1536&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/IMG_2559.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/IMG_2559.jpg?resize=1200,900&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/IMG_2559.jpg?resize=2000,1500&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/IMG_2559.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/IMG_2559.jpg?resize=1536,1152&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04829.jpg?fit=1200,1369&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04829.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/DSC04829.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04829.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04829.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04829.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p><em>Chianti gravel</em></p>\n<p>Tony didn’t see it and teased me endlessly as we pitched the tent and as I insisted on stowing anything we had with a scent—food and toiletries—in a dry bag hung from the top of a tall fence on the opposite side of the road from our pull-off. Laying on my back in my sleeping bag, I’d all but assured myself that the orchard floor would provide plenty of furtive feasting for the animal and I could stop worrying, but then I heard the sound of loud clomping and splashing disturb the nearby creek. As if in response, a strange, shrill, hooting call descended from the trees overhead and all the birds in the wooded grove followed suit in voicing their protest to this disruption. Darkness amplifies sound, and on this night, the unfamiliarity of it all amplified my heart rate. Based on his slow heavy breathing, I could tell that Tony was unbothered and already asleep, but it would be some time before I could block out the echoes of the night and drift off.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04826.jpg?fit=1200,1369&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04826.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/DSC04826.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04826.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04826.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04826.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p><em>Toto we’re not in Kansas</em></p>\n<p>Over the next two days, we continued our ride to Rome. Highlights included a detour through some of the L’Eroica course—traversing a section of Flint Hills-esque steep and undulating rollers on sun-bleached gravel—logging our first 100-mile day of the trip, a shower at a quaint lakeside campground, catching a distant view of Maxiumus’s house from the movie Gladiator, and, of course, finally making it to Rome. The route we took, a GPX track from the Italy Divide race a couple year’s back, was the most direct option but this, in turn, made for some unnerving, high-traffic riding, especially as we approached the outskirts of the city. Maybe we should have done more due diligence in searching for a less stressful option, but there’s something to be said for being able to put your trust in a supposedly vetted route. Fortunately, vehicles are smaller in Europe than in the US, so even when we were trying to keep our wheels within a razor-thin shoulder, drivers were courteous and we never felt buzzed by any of the cars whizzing by.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04841.jpg?fit=1200,1369&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04841.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/DSC04841.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04841.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04841.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04841.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p><em>The Pantheon</em></p>\n<h3>When in Rome</h3>\n<p>Occasionally the stones in the sidewalk shifted under our feet as we walked back to the hotel from dinner on our first night in Rome—how long they have been rocking in those street-bed cradles, who’s to say? A warm-lit trattoria—burrata with cherry tomatoes and anchovies, fried squash blossoms, cacio e pepe, and carbonara—felt like a fitting celebratory meal. Still, I couldn’t help but notice the couple sitting next to us were French; also tourists. The servers seemed used to it though. I suppose it’s the same way when you go to New York City in the US; it’s hard to know where the locals go.</p>\n<p>The next day, we fought the desire for a slow morning and frantically made plans for how to make the most of our next 24 hours in Rome. Leaving the bikes at the hotel, we decided that our main focus for the day would be a tour of the Vatican City and we’d try to detour past other sites on our walk to and from the Roman Catholic enclave. True to last-minute form, we found tickets for a guided tour en route; our spots in the tour group cost four times as much as the standard entry fee to the VC, but local intel had warned us that simply going in as individuals might result in wasting half the day waiting in line just to get inside the complex. With some amount of reluctance, we decided to lean into going full tourist mode.</p>\n<p><img loading=\"lazy\" width=\"1242\" height=\"2000\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04876.jpg?fit=1200,2000&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04876.jpg?w=1242&amp;quality=75 1242w, https://media.theradavist.com/uploads/2024/02/DSC04876.jpg?resize=1200,1932&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04876.jpg?resize=768,1237&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04876.jpg?resize=954,1536&amp;quality=75 954w\" /> <img loading=\"lazy\" width=\"1369\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04833.jpg?fit=1200,2048&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04833.jpg?w=1369&amp;quality=75 1369w, https://media.theradavist.com/uploads/2024/02/DSC04833.jpg?resize=1200,1795&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04833.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04833.jpg?resize=1027,1536&amp;quality=75 1027w\" /></p>\n<p><em>The streets of Rome</em></p>\n<p>Even as we speed-walked the five miles to the tour group’s meeting site, the weight of Rome’s history started sinking in. Passing the Pantheon and the excavation site of Trajan’s Market, and innumerable other ancient monuments, I felt a hair-raising connectedness to the past in a way I’d never before experienced. The sheer volume of remaining architecture made walking through Rome feel like an immersive museum experience—complete with street signs leading you to the next site—but I also think the impact of Rome’s past hit harder due to its depth. In the US, we think something is historic when it has survived a couple centuries; in Rome, the scale of time is measured in millenia.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1364\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04877.jpg?fit=1200,1364&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04877.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/DSC04877.jpg?resize=1200,799&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04877.jpg?resize=2000,1332&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04877.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04877.jpg?resize=1536,1023&amp;quality=75 1536w\" /></p>\n<p><em>A slice of the Colosseum</em></p>\n<p>I’m embarrassed to admit that I felt a small amount of relief when we arrived at the tour service meetup spot to find a handful of guides organizing visitors into different groups—there were so many competing options to choose from online that I’d been halfway worried we’d given money to a scam (because this can happen; for instance, we were told after the fact that any business hawking tickets for just the Sistine Chapel is a scam, as you have to purchase entry to the Vatican City as a whole, which then grants you access to all of the sites that it comprises).</p>\n<p>The tour itself proved to be one of the more bizarre cultural experiences that I’ve ever taken part in. From being herded into our tour group in the crowd-clogged streets outside the Vatican’s walls, to the requisite security checkpoint inside them, the tour felt akin to the total submission that one voluntarily consents to during airport travel: your say over personal space and time are no longer your own until you come out the other side.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04842.jpg?fit=1200,1369&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04842.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/DSC04842.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04842.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04842.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04842.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p><em>The Vatican as seen from the Tiber River</em></p>\n<p>In retrospect, I can’t be 100% sure of our guide’s name, but “Lucas” sticks out in my memory for some reason, so I’ll call him Lucas. As Lucas explained the routine—prepping us for the security checkpoint, cautioning women to cover their shoulders when inside the Vatican, and showing us the yellow flag that he would carry and we should follow to all stay together—he had the decidedly-defeated air of a camp counselor who has served one too many terms trying to be Captain Enthusiasm. Although young—perhaps no older than early 30s—Lucas’s walk was more of a stooped shuffle. His head sort of lolled forward and the main body of the backpack he shouldered looked impossibly uncomfortable and heavy; evidently he couldn’t be bothered to tension the straps and the pack hung low, covering most of his backside. His collective appearance was strongly tortoise-esque.</p>\n<p>As we passed the snaking throngs of suckers waiting to gain access to the Vatican—armed with folding chairs and sustenance, like hopeful concert-goers of yore camped out and counting down for tickets to go on sale—the “Skip the Line” name our of tour group immediately validated itself, and the premium price we’d paid to skip said line ourselves. One hour after rendez-vousing with our group a few blocks from the VC, for what was advertised as a three-hour tour, we finally emerged from the security checkpoint and into the first courtyard of the Vatican’s inner sanctum.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1337\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04845-2.jpg?fit=1200,1337&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04845-2.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04845-2.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04845-2.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04845-2.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p><em>Approaching the Vatican; we weren’t the only ones here for a tour</em></p>\n<p>Here, Lucas paused for a team huddle. Indeed, this aside felt like a strategic briefing as Lucas said he needed to “lower expectations” before going on to explain what our defensive tactics should be upon reaching the Sistine Chapel at the end of the tour. In a stern voice, he told us that the chapel would be very crowded but under no circumstances should we feel pressured to move on before we got our full ten minutes of allotted time. He told us that the move was to beeline straight for the center of the hall upon entering; if we lingered on the edges of the crowds, the guards might force us to the exit at the rear of the chapel prematurely. Because the chapel would be so congested, he also used our huddle to reveal the contents of his pack and pulled out a hefty picture book. Its pages (many of which expanded) depicted all of the panels in the Sistine Chapel and Lucas gave us a Cliff Notes-style run-through of the most significant scenes. Throughout this abbreviated analysis, Lucas relied heavily on the common Italian filler word, “allora,” often closing his eyes for several seconds as he extended its syllables. These lapses, that always seemed to stretch a beat too long, reminded me of an article I’d read about how a certain type of penguin survives almost completely on <a href=\"https://www.science.org/doi/10.1126/science.adh0771\" target=\"_blank\">four-second micro-naps</a>.</p>\n<p>After our huddle, the tour commenced with mostly outdoor exhibits; relocated atriums and tympanums, among other architectural feats, and statue-filled courtyards where I remembered the marble-cast writhing of the <em>Laocoön</em> and his sons from the pages of art history textbooks. The open air portion of the tour felt scholarly and refreshing, but ultimately short-lived.</p>\n<p><img loading=\"lazy\" width=\"3024\" height=\"4032\" src=\"https://media.theradavist.com/uploads/2024/02/IMG_2699.jpeg?fit=1200,4032&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/IMG_2699.jpeg?w=3024&amp;quality=75 3024w, https://media.theradavist.com/uploads/2024/02/IMG_2699.jpeg?resize=1200,1600&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/IMG_2699.jpeg?resize=2000,2667&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/IMG_2699.jpeg?resize=768,1024&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/IMG_2699.jpeg?resize=1152,1536&amp;quality=75 1152w, https://media.theradavist.com/uploads/2024/02/IMG_2699.jpeg?resize=1536,2048&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2865\" height=\"3820\" src=\"https://media.theradavist.com/uploads/2024/02/IMG_2698.jpeg?fit=1200,3820&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/IMG_2698.jpeg?w=2865&amp;quality=75 2865w, https://media.theradavist.com/uploads/2024/02/IMG_2698.jpeg?resize=1200,1600&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/IMG_2698.jpeg?resize=2000,2667&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/IMG_2698.jpeg?resize=768,1024&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/IMG_2698.jpeg?resize=1152,1536&amp;quality=75 1152w, https://media.theradavist.com/uploads/2024/02/IMG_2698.jpeg?resize=1536,2048&amp;quality=75 1536w\" /></p>\n<p><em>Inside the Vatican (left); Laocoön statue (right)</em></p>\n<p>Soon we were entrapped in a maze of halls and again densely packed among the, literally, thousands of other visitors. Inside, I found my focus shifting from reflecting on the art to just trying not to lose the yellow beacon, limply hanging from Lucas’s shoulder as he weaved ahead in the distance. It would have been impossible to take in everything during a single day, and the tour quickly turned into glancing mentions of the greatest hits, with Lucas occasionally stopping to point out something of apparent significance. While we stopped for a few minutes to ponder pre-GPS, 20-foot tall woven maps of Italy, I absorbed the entirety of the Etruscan period through osmosis, with no more time than to simply walk past the early ornate pots.</p>\n<p>At the risk of sounding blasphemous, attempting to keep sight of Lucas’s sun-colored flag and being told what was important enough to stop and consider felt like organized religion in a nutshell. Only our savior could show us the way to our divine destination (the Sistine Chapel) and along the way there was no time for free-thinking, only following. The galleries themselves were packed with human chattel all searching for the same enlightened end, and the stairwells between were rank with human exhaust. Our only hope of escaping this prison of sweat and farts and bad breath was to put our faith in Lucas.</p>\n<p>We did finally reach the Sistine Chapel; it was magnificently crowded and it was also simply magnificent. Gazing at the panels on the walls (contributions from other Italian artists that predate the final ceiling frescoes) and overhead, I tried to imagine the singularity of belief that made such works of art possible. Or, for some of the artists, maybe it was just a job that allowed them to exercise their craft. We weren’t keeping track of the time and, at some point, Tony and I made our way to the exit at the back of the chapel. We found Lucas looking slightly perturbed as he told us he’d almost left us since we’d been inside for over ten minutes. I hadn’t realized he was serious about that part.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1152\" src=\"https://media.theradavist.com/uploads/2024/02/IMG_7811.jpg?fit=1200,1152&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/IMG_7811.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/IMG_7811.jpg?resize=1200,675&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/IMG_7811.jpg?resize=2000,1125&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/IMG_7811.jpg?resize=768,432&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/IMG_7811.jpg?resize=1536,864&amp;quality=75 1536w\" /></p>\n<p><em>Inside St. Peter’s Basilica</em></p>\n<p>The organized portion of the tour ended at the doors of Saint Peter’s Basilica, where we were given the option of some DIY wandering through the Baroque-styled church. The interior is unequivocally the most lavish space I’ve ever entered, supported by ornate columns, playing host to a massive gilded altar of sorts, and features at the center an intricately adorned dome. In the context of the sprawling interior, Michelangelo’s <em>Pièta</em> appears to sit quaintly in the corner. Just as I was ready to suggest we find our way out of the VC altogether, Tony proposed a trip to the basement, where the remains of St. Peter are said to rest, along with the tombs of deceased popes.</p>\n<p>We descended the stairs and I again felt that prickling epiphany I’d had in the streets; we were in the literal heart of one of the most impactful forces of human history and yet, behind the glass and sarcophagi these men would turn to dust like the rest of us. Why exalt the dust?</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1337\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04875.jpg?fit=1200,1337&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04875.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04875.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04875.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04875.jpg?resize=1536,1027&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2000\" height=\"1337\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04872.jpg?fit=1200,1337&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04872.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04872.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04872.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04872.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p><em>A dome I don’t know (left); The Trevie Fountain (right), my favorite stop on our Rome sightseeing tour</em></p>\n<p>When we emerged into the forecourt, my head felt fuzzy, like when you’ve been watching TV for too long. I couldn’t stop thinking about the totality of resources and human energy that were spent to build the basilica, much less the Vatican City as a whole. Saint Peter’s alone took roughly 120 years to construct; with the average life expectancy for that time being between 30-40 years, it’s not far-fetched to imagine the project consuming three or four or five generations of workers. Agnostically speaking, all of these structures are a testament to human ingenuity and a desire for beauty; taken religiously, they’re a, quite literally, awesome testament to our search for meaning. Whether that meaning is real or manufactured remains with the beholder.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1337\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04898.jpg?fit=1200,1337&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04898.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04898.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04898.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04898.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p><em>Day one in the Dolomites, approaching Canazei</em></p>\n<h3>A Weekend in the Dolomites</h3>\n<p>Two days later and a long train ride later, Tony and I found ourselves back in Trento leaving the city again but this time heading north, to the Dolomites. While we’d felt compelled to spend much of our time in Italy absorbing the history and culture of its most-famed cities, we couldn’t countenance leaving without a foray into the mountains.</p>\n<p>The first day, we steadily rode up-valley for 65 miles to reach the small ski-resort town of Canazei, <span>at the head of the Val di </span><span>Fassa</span>. After climbing quiet roads, we were treated to nearly 30 miles of bike path with grand views of the surrounding Selle group of peaks. Heading into the alpine, at least in this northeasterly direction, you can feel the Germanic influence pretty immediately; for dinner that night, we stopped into a hotel restaurant (one of the two places open in the comparatively dead weeks before ski season) that served spaetzle and other German fare, alongside wood-fired pies.</p>\n<p><img loading=\"lazy\" width=\"1337\" height=\"2000\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04889.jpg?fit=1200,2000&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04889.jpg?w=1337&amp;quality=75 1337w, https://media.theradavist.com/uploads/2024/02/DSC04889.jpg?resize=1200,1795&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04889.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04889.jpg?resize=1027,1536&amp;quality=75 1027w\" /> <img loading=\"lazy\" width=\"1337\" height=\"2000\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04911.jpg?fit=1200,2000&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04911.jpg?w=1337&amp;quality=75 1337w, https://media.theradavist.com/uploads/2024/02/DSC04911.jpg?resize=1200,1795&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04911.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04911.jpg?resize=1027,1536&amp;quality=75 1027w\" /></p>\n<p><em>Alpine towns and high mountains </em></p>\n<p>It felt like fall settled in overnight; the next morning had a new brisk bite, a welcome shift after an extended summer. We tried to make quick work riding up the 2,500-foot climb of Passo Pordoi, as we had more than riding on the weekend’s agenda. Back in Trento, we’d swapped our city sandals for running shoes as during our weekend in the Dolomites we were looking forward to mixing in some more vertical foot travel. On the Passo Pordoi saddle, we changed shoes, stashed our bikes and began the steep march up Piz Boé, the highest point in the Selle group at 3,152 meters (10,341 feet). The bleached rock underfoot made the trail up feel lunar, and the summit afforded clear views of the surrounding jagged peaks and toothy ridgelines. After spending the past week and change popping in and out of cities, it felt right to be back in the mountains.</p>\n<p><img loading=\"lazy\" width=\"1536\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2024/02/IMG_2857.jpg?fit=1200,2048&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/IMG_2857.jpg?w=1536&amp;quality=75 1536w, https://media.theradavist.com/uploads/2024/02/IMG_2857.jpg?resize=1200,1600&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/IMG_2857.jpg?resize=768,1024&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/IMG_2857.jpg?resize=1152,1536&amp;quality=75 1152w\" /> <img loading=\"lazy\" width=\"2048\" height=\"1536\" src=\"https://media.theradavist.com/uploads/2024/02/IMG_2926.jpg?fit=1200,1536&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/IMG_2926.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/IMG_2926.jpg?resize=1200,900&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/IMG_2926.jpg?resize=2000,1500&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/IMG_2926.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/IMG_2926.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p><em>The Up (left) and Down (right) of Piz Boé</em></p>\n<p>We scurried back down, retrieved the bikes, and toasted our summit tag with cappuccinos at the pass restaurant—we’d need the caffeine boost, too, as we still had another stiff climb to ride before making it to our evening’s destination, Cortina. We topped out Passo Falzarego midafternoon; the two passes for the day totaled around 5,500’ of vertical gain on the bike, but our “bonus” 3,200-foot jaunt up Piz Boé meant my legs were feeling the cumulative effort. While I was glad to know it would be all downhill into Cortina, we were also under the ambitious time-constraint of needing to return to Trento the very next day. Whatever elevation we lost now, we’d be making up in less than 24 hours.</p>\n<p><img loading=\"lazy\" width=\"1369\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04993.jpg?fit=1200,2048&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04993.jpg?w=1369&amp;quality=75 1369w, https://media.theradavist.com/uploads/2024/02/DSC04993.jpg?resize=1200,1795&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04993.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04993.jpg?resize=1027,1536&amp;quality=75 1027w\" /> <img loading=\"lazy\" width=\"1369\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04983.jpg?fit=1200,2048&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04983.jpg?w=1369&amp;quality=75 1369w, https://media.theradavist.com/uploads/2024/02/DSC04983.jpg?resize=1200,1795&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04983.jpg?resize=768,1149&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04983.jpg?resize=1027,1536&amp;quality=75 1027w\" /></p>\n<p><em>Riding up Passo Pordoi and Piz Boé as seen from where we left the bikes</em></p>\n<p>During the last day-and-a-half of riding, I’d already been bowled over—many times—by the striking profiles and impressive relief of the Dolomites. But nothing I’d seen thus far compared to the views on our descent into Cortina.</p>\n<p>The mountains that flank Cortina rise swiftly and precipitously, their craggy demeanor standing in stark contrast to the late-summer lushness of the valley beneath. The bucolic meadows down low feel safe and inviting, while the peaks behind challenge you to leave the realm of known comforts.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2024/02/DSC05016.jpg?fit=1200,1369&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC05016.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/DSC05016.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC05016.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC05016.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC05016.jpg?resize=1536,1027&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2048\" height=\"1369\" src=\"https://media.theradavist.com/uploads/2024/02/DSC05018.jpg?fit=1200,1369&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC05018.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/DSC05018.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC05018.jpg?resize=2000,1337&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC05018.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC05018.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p><em>Dropping into Cortina</em></p>\n<p>Over dinner that night, we contemplated the feasibility of our original plan: we still wanted to make it up another summit on foot, via an intermediately-rated via ferrata, but our planned return route to Trento (with three new-to-us passes) seemed unrealistic. We ultimately decided to end the riding portion of our time in Italy with a mega day—an early wake-up to summit Punta Fiames via the Ferrata Strobel, then reverse course to return to Trento the way we had come, which would still entail 100 miles of riding and (re)summiting Passo Falzrego and Passo Pordoi. So far, we’d been taking the trip at vacation pace—we could afford to empty the tank on our last day.</p>\n<p>The next morning, we reached the first section of technical climbing on Ferrata Strobel before first light—we were actually ahead of schedule! By headlamp, we tentatively made our way up the polished rock, interspersed by the fixed wrought-iron stakes and ladders that distinguish via ferrata travel from traditional rock climbing. That we were the only visitors on the mountain added to the aura of our spectacular position above Cortina. Topping out, we felt giddy that we’d actually pulled off a second summit tag and not even the death scree-gully descent could bring down the mood.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1536\" src=\"https://media.theradavist.com/uploads/2024/02/IMG_3068.jpg?fit=1200,1536&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/IMG_3068.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/IMG_3068.jpg?resize=1200,900&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/IMG_3068.jpg?resize=2000,1500&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/IMG_3068.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/IMG_3068.jpg?resize=1536,1152&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2048\" height=\"1981\" src=\"https://media.theradavist.com/uploads/2024/02/IMG_3095.jpg?fit=1200,1981&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/IMG_3095.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/02/IMG_3095.jpg?resize=1200,1161&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/IMG_3095.jpg?resize=2000,1935&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/IMG_3095.jpg?resize=768,743&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/IMG_3095.jpg?resize=1536,1486&amp;quality=75 1536w\" /></p>\n<p><em>Approach and summit of Punta Fiames </em></p>\n<p>Naturally, we celebrated with second breakfast in town before settling in for the long return ride to Trento. We were still riding high from the morning’s excursion all the way up Passo Falzrego, but the immediate double-whammy of Passo Pordoi felt like a slog. Although it would be a net 70-mile descent from atop Pordoi, we knew there would still be plenty of pedal-y miles on the false-flat bike path and rolling sections that followed. Back on the bikes, we put our heads down, plugged in some podcasts, and got to work.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1337\" src=\"https://media.theradavist.com/uploads/2024/02/DSC04971.jpg?fit=1200,1337&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/DSC04971.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/DSC04971.jpg?resize=1200,802&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/DSC04971.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/DSC04971.jpg?resize=1536,1027&amp;quality=75 1536w\" /></p>\n<p><em>Descending Passo Pordoi on day three</em></p>\n<p>Sunrise is my favorite time of day to be outside in almost any capacity—running, climbing, skiing—but finding sunset while out riding always feels like a spiritual experience. For all of their frescoes, inlaid marble, and reaching domes, the grandeur of man-made structures like St. Peter’s Basilica is incomparable to that of the mountains’ natural cathedrales, and the humbling respect I feel for the latter is involuntary, unprescribed. As we rode into the dark on the last night of our tour, ironically, I felt the most transported from my body when I was so completely present in it—in this way, a singular focus on forward motion strips away less-than-perfect worldly distractions, at least for a short while.</p>\n<p>A few hours later, night had fallen, but we were back in Trento and meeting a friend for one of the best pizzas of the whole trip. Eight days of riding the Italy Divide from Trento to Rome had cemented in me an appreciation for Italian culture and history; our additional three days in the Dolomites are what make me want to come back.</p>\n<p><em>In case you missed it, find Part One of Hailey’s trip report <a href=\"https://theradavist.com/italy-divide-bike-tour/\" target=\"_blank\">here</a>. </em></p>\n<p>The post <a href=\"https://theradavist.com/bikepacking-italy-divide-dolomites/\">Mental Detours Part Two: The Italy Divide to Rome and a Dolomites Mini-Tour</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"Hailey Moore","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"61f17cff000306b15008871ce848e775b4c4612d7ce016ebea06febcc41935c0","category":"Cycling"}