{"title":"Economic burden of varicella in Bangkok, Thailand: A multicenter medical chart review study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003099","date":1718200800000,"content":"<p>by Salome Samant, Manjiri Pawaskar, Sujittra Chaisavaneeyakorn, Supitcha Kamolratanakul, Sujane Limpadanai, Bianca Jackson, Jennifer Stephens, Isaya Sukarom, Kulkanya Chokephaibulkit</p>\r\n\r\nOur multicenter, medical chart review, cost-of-illness study used a micro-costing approach to evaluate the economic burden associated with varicella in Bangkok, Thailand, from a societal perspective. We reviewed medical charts of adults and children with a primary diagnosis of varicella (2014–2018) from 4 hospitals in Bangkok. Reported healthcare resource utilization and missed school or workdays were extracted from medical charts. Mean direct, indirect, and total costs per patient were estimated for overall, adult, and pediatric patients (2020 USD). Of the 200 children and 60 adults, 99.6%, 5.4%, and 5.4% had a varicella-related outpatient visit, emergency department visit, and hospitalization, respectively. The mean direct medical cost was 33 USD for pediatric and adult patients. The mean cost of outpatient visits (8 vs 13 USD, <i>P</i>&lt;0.001) and medications (7 vs 9 USD, <i>P</i>&lt;0.001) was significantly lower among pediatric patients. Forty-eight children reported a mean of 5.8 school days lost, and 32 adult patients reported a mean of 7.4 workdays lost. The mean total cost per varicella patient was 89 USD, with the mean total cost higher for adult than pediatric patients (145 vs 72 USD, <i>P</i>&lt;0.001). Indirect cost accounted for 63% of the total cost per patient (54% for pediatric patients and 77% for adult patients). There is a substantial economic burden associated with patients seeking varicella-related healthcare in Thailand, including considerable indirect costs.","author":"Salome Samant","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"61f3527e7e16b0316a3dd69cecd46ec45f24f9392915f774b2b548e052ac96a6","category":"Environment"}