{"title":"SGLT2 Inhibitors vs. GLP-1 Receptor Agonists in Reducing Heart Failure Hospitalizations in Type-2 Diabetes. A Systematic Review and Meta-Analysis","link":"https://www.preprints.org/manuscript/202410.0929/v1","date":1728658751000,"content":"Background: Cardiovascular comparisons between glucagon-like peptide-1 receptor agonists (GLP-1 RAs) and Sodium-glucose co-transporter-2 (SGLT-2) inhibitors in type 2 diabetes(T2D) remain an area of interest. Thus, the purpose of this meta-analysis is to compare the impact of these two drug classes on major CV outcomes, such as heart failure hospitalization(HHF), major adverse cardiovascular events (MACE), CV mortality, myocardial infarction, stroke, and all-cause mortality, with an emphasis on heart failure hospitalizations. Methods: PubMed (including MEDLINE), Google Scholar, Cochrane Central Library, PLOSONE, and Science Direct databases were searched for studies that compared GLP-1 RAs and SGLT-2 inhibitors in patients with type 2 diabetes. Six cohort studies were selected for the analysis. Odds ratios (OR) with 95% CI were calculated and a random-effects model was used to estimate the hazard ratios (HR) of the studies. The quality of the studies was evaluated using the Newcastle-Ottawa Scale (NOS), and publication bias was assessed using funnel plots and Egger’s test. Results: Pooled analysis demonstrated a significant reduction in heart failure hospitalizations with SGLT-2 inhibitors compared to GLP-1 RAs (HR: 0.78 [0.62–0.98], I² = 87%, p &lt; 0.01). Cardiovascular mortality was also significantly reduced by SGLT-2 inhibitors (HR: 0.74 [0.31–1.67], I² = 87%, p &lt; 0.01), and a modest reduction was observed for all-cause mortality (HR: 0.85 [0.44–1.64], I² = 17%, p = 0.27). While SGLT-2 inhibitors appeared to slightly reduce the risk of myocardial infarction (HR: 0.83 [0.74–0.92], I² = 0%, p = 0.85), no significant difference was observed for MACE (HR: 0.91 [0.82–1.01], I² = 0%, p = 0.70) or stroke (HR: 0.88 [0.77–1.00], I² = 0%, p = 0.85). Conclusions: Compared to GLP-1 receptor agonists, SGLT-2 inhibitors were more effective in lowering heart failure hospitalizations and cardiovascular mortality in patients with type 2 diabetes. It was also found that all-cause mortality and myocardial infarction were moderately reduced using oral agents. However, the differences were not significant for MACE or stroke. These results imply that SGLT-2 inhibitors may potentially provide better cardiovascular benefits, especially with respect to heart failure and cardiovascular mortality, than GLP-1 RA. Further research should be conducted to determine the effects of the long-term use of these therapies on stroke and other cardiovascular events.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"61fe08f8523c9ee54834ad2c00a239ddf7ec0333d65e51db58b8e41d390d79f8","category":"Interdisciplinary"}