{"title":"38 Assessment of retained ownership extension programming in southeastern beef cattle herds","link":"https://academic.oup.com/jas/article/102/Supplement_1/9/7617920?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Retained ownership is a marketing strategy that involves maintaining ownership of cattle through the feedyard stage. This strategy deviates from the traditional marketing time for many Southeast U.S. cow-calf producers, which is usually centered around weaning. Selected benefits of retained ownership for the producer includes capturing information on improved genetics and being able to take full advantage of health and management programs. Producers are often unaware of how calves perform further down the production line, leaving valuable information on the table as far as management styles and genetic selection goes. Extension programs such as Alabama’s Pasture to Rail and Arkansas’ Grass to Grid were developed to help producers retain ownership on beef calves and learn how their cattle perform in the feedyard phase. These programs provide opportunities for producers to receive feedback about the profitability of the cattle they are producing, learn more about the cattle industry beyond their sector, and investigate the use of other marketing strategies. Once cattle are marketed, producers receive data on their cattle such as average daily gain, estimated feed conversion, detailed carcass data, and health performance metrics. Extension educators can help producers analyze and understand how management and genetic selection affected these outcomes and changes that could be made to their operation. These programs have also been utilized in integrated Extension research. Between the years 2018 and 2023, the Alabama Pasture to Rail Program supported data collection on 667 calves through two different studies. Data collected in these studies are currently being used to update Extension recommendations on management strategies and potential of Alabama feeder calves. Feedback from facilitators and participants in these programs is often favorable for producer implementation but limitations are still faced by Extension personnel. A survey of county agents in Arkansas was recently conducted on programs such as Grass to Grid. Of the 45 agents that responded with active beef cattle programming in their county only 8% indicated that they had active participation in the Grass to Grid Program. An additional 13% of agents did indicate that they thought their county programming and producers would benefit from programming such as Grass to Grid. Limitations to the program were listed as market viability, producer buy in and turn-around results from the feedyard currently being used. Extension programming such as retained ownership programs have a place in helping producers build more sustainable programs. However, it is important to acknowledge the strengths, weaknesses and opportunities that must be addressed for producers and Extension personnel if they are to remain a function and useful tool.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"61ffb4730224ed23753cbcbd55124df3fc863653f94d0d03a3dae65fec28b711","category":"Environment"}