{"title":"The enduring nature of cranberry production in a changing climate: The interplay of extreme weather, knowledge networks, and adaptation","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000350","date":1716904800000,"content":"<p>by Tara L. Pisani Gareau, Lijing Gao, Brian J. Gareau</p>\r\n\r\nAnthropogenic climate change is causing critical issues in agriculture, including cranberry production; however, in a previous study the majority of Massachusetts cranberry growers were less likely to see global warming as a threat than the general US population, and more still reported to be little worried about such warming. This research aims to determine the influence of weather and professional information disseminated to cranberry growers on their climate change adaptation. The authors used a mixed-methods, interdisciplinary approach, including content analysis of around 300 issues of UMass Extension’s Cranberry Station monthly newsletter—a widely trusted source of information in the cranberry grower “network of knowledge”—along with historical weather data from 1974 to 2020, and interview and survey data. Despite infrequent usage of direct communication on climate change and adaptation, UMass Extension’s communication on weather challenges in general showed a small but significant increase when monthly temperature anomalies increased. Meanwhile, anomalous monthly precipitation was negatively associated with total chemical mentions (linked to chemical use behavior). Climate impacts such as increased weeds, water issues (e.g., heavy rainfall, water scarcity), and heat waves ruining harvests were important to growers, leading to the adoption of both conventional (e.g., increased strategic flooding, barge sanding due to lack of ice) and emerging (e.g., smart irrigation, solar panel installations for added income) adaptive strategies. Growers demonstrate climate and technological optimism, believing that other growers are hit worse by climate change than themselves and that cranberry plant resilience, better weather forecasting, and improved irrigation technology will allow them to handle future weather challenges. The prioritization of immediate needs over the more abstract, long-term challenge of climate change by growers and the supporting system underscores the imperative to explore the socio-environmental dynamics that shape their climate responses in cranberry production.","author":"Tara L. Pisani Gareau","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"6204805a080daf94e458d18f68808fe7a083dcd9b4e76224265680193444cc7a","category":"Environment"}