{"title":"Species richness estimation of the Afrotropical Darwin wasps (Hymenoptera, Ichneumonidae)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307404","date":1722261600000,"content":"<p>by Noah Meier, Mikhaila Gordon, Simon van Noort, Terry Reynolds, Michal Rindos, Filippo Di Giovanni, Gavin R. Broad, Tamara Spasojevic, Andrew Bennett, Davide Dal Pos, Seraina Klopfstein</p>\r\n\r\nSpecies richness is one of the fundamental metrics of biodiversity. Estimating species richness helps spotlight taxonomic groups that are particularly under-studied, such as the highly diverse Darwin wasps. The only available estimate of the number of Darwin wasps in the Afrotropics proposed almost 11,000 species, compared to the 2,322 recorded species. However, it relied exclusively on the ratio of morphospecies to described species in Henry Townes’ personal collection. We provide an updated estimate of the Afrotropical Darwin wasp species, using empirical data from multiple sources, including the increase in species numbers following generic revisions, morphospecies sorting in natural history collections, and diversity patterns of better-studied insects (butterflies) for extrapolation. Our analyses suggest that our knowledge of Darwin wasps is highly incomplete, with only 13–22% of species known in the five most extensively studied countries in the Afrotropics. We estimate 9,206–15,577 species of Darwin wasps within the entire Afrotropics, with the highest concentration expected in the Equatorial Afrotropics and Madagascar. Due to data constraints, our approach tends to underestimate diversity at each step, rendering the upper estimate (15,577 species) more realistic. We highlight reasons contributing to the gap between recorded and estimated species richness, including logistical and financial factors, as well as post-colonial influences.","author":"Noah Meier","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"620cf7827c38b3e117fe5e893a047b582ee8b8704db46abdd57ba7b8c7c0ab01","category":"Interdisciplinary"}