{"title":"Incision and rock uplift along the Lower Seine River since Marine Isotope Stage 8","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3640?af=R","date":1723011794000,"content":"<h2>ABSTRACT</h2>\n<p>The study of alluvial terraces helps in reconstructing the past geometries of rivers and makes it possible to assess the rate and pattern of fluvial incision and bedrock uplift. The fluctuations of river base levels are particularly variable and complex during the Late Quaternary in the lower course of rivers due to the interplay of responses to sea-level fluctuations, tectonics and glacio-isostasy. In this paper, the geometry and chronology of Manoir Brésil, an outcrop of alluvial terraces of the Lower Seine River, northern France, are investigated through a multidisciplinary study. Fluvial incision during MIS 8 in the Lower Seine in relation to sea-level drop is recorded by an erosional surface cut into the chalk bedrock. This surface is covered by MIS 7 tidal deposits and then by younger, mostly periglacial colluvium (head). Manoir Brésil is therefore considered to be a chronological equivalent of the nearby, well-studied Tourville-la-Rivière outcrop. The deposits are affected by post-MIS 7 cryoturbation processes. Based on the local elevation of MIS 7 tidal deposits and erosional surfaces at Manoir Brésil, a minimum bedrock uplift rate of 25–40 m/Ma and an erosion rate of 125 m/Ma during glacial periods can be proposed. A regional correlation of the MIS 8 erosional surface is increasingly deformed by uplift towards the North, making it difficult to correlate the fluvial deposits along the Seine without precise chronological control. We interpret this regional tilt as the result of isostasy rebound after glaciations, consistent with the distribution of the elevations of MIS 5e and MIS 7 marine deposits along the English Channel.</p>","author":"Diana Chourio‐Camacho, \nJean‐Louis Grimaud, \nHélène Tissoux, \nPaul Bessin, \nPierre Voinchet, \nEmmanuel Vartanian, \nMark Noble, \nPascal Bertran","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"620db3643bc576ad1dfcda41c8b87fa06e544eef3635072460f2972502952b88","category":"Environment"}