{"title":"พี่ไม่ขอเสี่ยง, Nexus Mods ประกาศลบ Mod ทั้งหมดของ Palworld ที่เกี่ยวข้องกับ Pokemon ออก","link":"https://www.blognone.com/node/137869","date":1706177364000,"content":"<div><div><div><p>Nexus Mods แพลตฟอร์มเกี่ยวกับ Mod เกมบนพีซีออกมาประกาศประเด็นระหว่างเกม Palworld กับ Pokemon ผ่านเว็บไซต์ว่า Nexus Mods รู้สึกไม่สบายใจที่ปล่อยให้มี Mod ของเกม Palworld ที่นำเอาองค์ประกอบของ Pokemon มาใส่ในเกมเผยแพร่บนเว็บไซต์ของตน แม้ว่าไอเดียการนำ Pokemon เข้ามาอยู่ในโลกของ Palworld จะดูน่าสนใจก็ตาม</p>\n<p>Nexus Mods ระบุว่า Nintendo มีประวัติการยื่นคำร้องต่อกฎหมาย DMCA และการลบเนื้อหาที่แฟน ๆ สร้างขึ้นเองอย่างไร้ความปรานีมาโดยตลอด เมื่อพิจารณาจากความคล้ายคลึงของ Palworld กับ Pokemon การเผยแพร่เนื้อหาที่เพิ่มตัวละครหรือทรัพย์สินที่มีลิขสิทธิ์ของ Pokemon เข้าไปในเกมน่าจะทำให้เสี่ยงต่อการถูกดำเนินคดีทางกฎหมายอย่างแน่นอน Nexus Mods จึงคิดว่ามันไม่คุ้มค่าที่จะเสี่ยงที่จะอนุญาตให้แชร์เนื้อหานี้ในเว็บไซต์</p>\n<p>ถึงแม้จะลบ Mod ประเภทนี้ออกแต่ Nexus Mods จะยังคงสนับสนุนการดัดแปลง Palworld ในทุกวิถีทางที่สามารถทำได้ และเปิดตัว Palworld Vortex Extension ตัวจัดการ Mod ที่สร้างโดย Nexus Mods เพื่ออำนวยความสะดวกให้ Mod เกม Palworld ได้อย่างสะดวก</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/a02189a8bcd3505e9ddaf955ac8f8f9f.png\" /><em>รูปจาก Mod ของ Toasted Shoes ที่ถูก Nintendo ขู่ฟ้องเมื่อวันก่อน</em></p>\n<p>ก่อนหน้านี้ <a href=\"https://www.blognone.com/node/137862\">The Pokémon Company ออกคำแถลงจะตรวจสอบการละเมิดทรัพย์สินทางปัญญาเกม Palworld ว่าใช้องค์ประกอบของ Pokémon หรือไม่</a> หลังจากที่<a href=\"https://www.blognone.com/node/137823\">ขู่ฟ้องนัก Mod โมเดล Pokémon ไปใส่ในเกม Palworld</a></p>\n<p>ที่มา - <a href=\"https://www.nexusmods.com/news/14924\">Nexus Mods</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/palworld\">Palworld</a></div><div><a href=\"/topics/pokemon\">Pokemon</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"620e0d54e0f52a6bc689db1ba9d87657763c9cad574c9b2cf17b07a268b680e5","category":"Thai"}