{"title":"UK Ride: a taste of Yorkshire","link":"https://www.cyclist.co.uk/in-depth/9800/uk-ride-a-taste-of-yorkshire","date":1624892799000,"content":"<span>\n      <span><a href=\"/authors/trevor-ward\">Trevor Ward</a></span>\n  </span><div>  \n  <div>      <div><span>5 Jul 2021</span></div>    </div></div><p>\nTough climbs and top-notch food make a hard but rewarding trip to Yorkshire</p>\n<div>\n      <p> <strong>Tough climbs and top-notch food make a hard but rewarding trip to Yorkshire</strong></p>\n<p><strong>Words</strong>: Trevor Ward <strong>Photography</strong>: Henry Iddon</p>\n<p>A subtle warning is served with my steamed turbot, courgette tempura and smoked pike roe at the Michelin-starred Angel at Hetton on the eve of my bike ride around the Yorkshire Dales. 'Chef’s fast up those hills,' says the masked waitress, before topping up my glass of Macabeo-Verdejo Spanish white.</p>\n<p>By the time the next course arrives – Nidderdale lamb with caramelised onion, shitake, broad bean and local pak choi – the warnings are more direct.</p>\n<p>Waiter Tom, whose tall, lean physique betrays his membership of nearby Skipton CC where a crash in a criterium curtailed his racing career, tells me: 'Chef’s got a set of legs on him. You’ll struggle to keep up with him on the climbs.'</p>\n<p>As he pours me a glass of Negroamaro Italian red, he adds: 'But you’ll enjoy the descent from Halton Gill. It’s long and gradual with beautiful views.'</p>\n<p>As I’m finishing my dessert – date and honey biscuit, compressed and frozen peach with peach kernel Chantilly – I see another masked member of staff approaching and half expect them to dramatically draw a finger across their throat and tell me I don’t stand a chance against 'chef'. But instead, they simply want to know what time I’d like my bike ready in the morning.</p>\n<p>'Chef' is Michael Wignall, who as a teenager was persuaded by his parents to give up his dream of becoming a professional BMX racer and go to catering college instead. He has since blazed a trail of Michelin stars and AA rosettes at restaurants across England before arriving in the Yorkshire village of Hetton three years ago, but has never given up his love of riding bikes.</p>\n<p>Before our meal, he’d shown me around his new, million-pound kitchen and outlined his plans for an 'Alpine-style bike livery and tool station' for the use of any guests turning up with their £12k Pinarellos.</p>\n<p>I’m due to join him for a ride tomorrow and he assures me he’ll be riding at 'social pace'. His wiry, compact frame – plus the conspiratorial warnings of his staff – put me on alert, however.</p>\n<p></p><div><div>\n  <a href=\"/in-depth/9802/a-gourmet-ride-in-yorkshire-photos#26\"><p><span>Image 27 of</span> 33</p><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/06/cyc_dales_053.jpg?itok=YrUFYTKm\" /></a></div>\n<p><span>Image 27 of </span>33</p>\n</div> <p></p>\n<p>My apprehension is heightened the next morning with the arrival of Michael’s neighbour, Ian Weatherill, co-founder and managing director of nearby Hope Technology – supplier of the 40 bike frames that Jason and Laura Kenny and the rest of the British track cycling squad will be riding at the Tokyo Olympics this summer – and his son, Will.</p>\n<p>Both are accomplished racers in various cycling disciplines. Both are on board machines resembling weapons of war, all sculpted carbon and polished titanium.</p>\n<p>Between them, my three cycling companions boast assorted Michelin stars, an MBE and a degree from Cambridge. There will be no shortage of conversation during our ride. It’s just a pity most of it will be conducted on one-in-four gradients with me struggling to hold on to the wheel in front.</p>\n<p></p><div><div>\n  <a href=\"/in-depth/9802/a-gourmet-ride-in-yorkshire-photos#5\"><p><span>Image 6 of</span> 33</p><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/06/cyc_dales_013.jpg?itok=D1dQqdpE\" /></a></div>\n<p><span>Image 6 of </span>33</p>\n</div> <p></p>\n<p>There’s time for some brief, 'getting-to-suss-out-each-other' small talk before the first climb of the day up to Malham Cove. Ian’s business – in common with the rest of the bike industry – has boomed during the pandemic to such an extent he’s had to take on extra staff at his factory in the Lancashire town of Barnoldswick.</p>\n<p>'We have 19,000 sets of disc brakes on back order,' he says. 'That’s a 16-week wait for the dealers we supply. The situation with the global supply chain is so bad, I’ve actually seen second-hand chains for sale on eBay!'</p>\n<p>Conversation is temporarily put on hold as the road ramps up past the curving, natural amphitheatre of limestone on our right. The narrow road twists upwards between drystone walls before emerging on to a plateau next to Malham Tarn.</p>\n<p></p><div><div>\n  <a href=\"/in-depth/9802/a-gourmet-ride-in-yorkshire-photos#8\"><p><span>Image 9 of</span> 33</p><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/06/cyc_dales_018.jpg?itok=uj8aKs5K\" /></a></div>\n<p><span>Image 9 of </span>33</p>\n</div> <p></p>\n<p>Ian is doing a lot of clipping in and out of his pedals. 'I’m testing a set of prototype pedals and cleats we’ve designed,' he says. 'They’re titanium and aimed at gravel and MTB bikes, but we reckon more roadies are buying them these days because the shoes are so much easier to walk in. Our factory CX team has been testing them all year and reckon they have much better mud clearance than a certain rival’s.'</p>\n<p>We can see the next climb zigzagging steeply up the side of a hill but are denied a decent run-up to it by a closed gate. It’s just over a kilometre at a constant gradient of 7%. Once over the cattle grid at the top we get endless views of the deep valley to our right. A group of paragliders – a flock, a fleet, a flight? – is hanging in the clear sky high above dramatic limestone escarpments.</p>\n<h3>Crossing the line</h3>\n<p>At the bottom of the descent is the pretty village of Arncliffe where Ian points out a solid white line painted across the road next to the river.</p>\n<p>'That’s one of the \"finish lines\" we have around here,' he says. 'There are lots of unofficial weekend races that attract local riders like the Brownlee brothers and <a href=\"/tags/tom-pidcock\">Tom Pidcock</a>.'</p>\n<p>The road now begins a long drag along the valley floor until we turn left over a stone bridge and the climb of Halton Gill begins. True to the warnings I received from his staff last night, 'chef' takes no prisoners on these climbs.</p>\n<p>He is still carrying his form from a block of training for this year’s Maratona dles Dolomites gran fondo, where he was due to race the full distance – 138km with 4,000 metres of climbing – two days after cooking a gala dinner for VIP guests.</p>\n<p>Despite the plan being scuppered by <a href=\"/tags/coronavirus\">coronavirus</a> travel restrictions, Michael has retained his fitness and is making short work of today’s hills.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/06/cyc_dales_008.jpg?itok=rK8MgoaI\" />  </div>\n</div>\n<p>The rolling plateau at the top gives great views of the flat-topped bulk of Pen-y-Ghent, one of the peaks scaled in the fearsome Three Peaks Cyclocross race. From here, it’s a thrilling descent into the market town of Settle and lunch at Ye Olde Naked Man Café.</p>\n<p>I’m about to choose a burger and chips when Ian, pointing across the busy town square, warns me the hardest climb of the day starts immediately around that corner. Tuna mayo sandwich it is, then.</p>\n<p>As leaders in their respective fields, I ask Michael and Ian if there are any parallels between the worlds of haute cuisine and high technology.</p>\n<p>'Definitely,' says Michael. 'Cooking is all about experimenting. You have to be brave enough to try something different, that’s what sets a good chef apart from the others.</p>\n<p>'Cooking is a science and you have to understand that science – how heat changes the structure of food, how chemistry-influenced equipment can be used to separate liquids more efficiently. Technology means I can now revisit recipes from 20 years ago and do them better.'</p>\n<h3>Food for thought</h3>\n<p>Referring to one of the eight courses on last night’s Tasting Menu – described as 'Winslade, pickled Thai shallots, minus 8 vinegar and oats' – Michael said his goal had been to 'condense the flavour of a ploughman’s lunch into two spoonfuls'. I assured him he had succeeded and then wondered if this form of science could be employed by pro cycling team chefs to make their mid-race snacks more interesting for riders.</p>\n<p>'It’s definitely doable,' he says.</p>\n<p>For Hope Technology, however, the science is limited by <a href=\"/tags/uci\">UCI</a> regulations. At least for road bikes.</p>\n<p>'It’s different for track bikes, where we have done all kinds of experiments with aerodynamics. We are also looking at moving into the triathlon market, where there aren’t as many rules,' says Ian, who in 2019 was awarded an MBE for his services 'to business, innovation and the local community.'</p>\n<p>His son Will, who has just completed an engineering degree at Cambridge University, puts it more bluntly: 'I get bored with road bikes, they just don’t evolve quickly enough. The only big thing of recent years has been disc brakes, and we’ve been making them for mountain bikes since the ‘90s.'</p>\n<p></p><div><div>\n  <a href=\"/in-depth/9802/a-gourmet-ride-in-yorkshire-photos#15\"><p><span>Image 16 of</span> 33</p><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/06/cyc_dales_032.jpg?itok=YWWjziEB\" /></a></div>\n<p><span>Image 16 of </span>33</p>\n</div> <p></p>\n<p>It’s time to clip back in and complete our loop of this rugged and beautiful corner of Yorkshire. We cross the square and are faced with a gentle, cobbled incline that gradually shrugs off the last of Settle’s buildings. The cobbles soon give way to tarmac but any feelings of relief are cancelled out by the road suddenly tilting upwards and a sign declaring 20%.</p>\n<p>At nearly four kilometres long, and with just a brief section of false flat halfway, I can taste my tuna sandwich all the way to the top. If only Michael’s scientific and culinary expertise could concoct a filling lunch that consisted of only two mouthfuls, post-prandial bike rides would be a lot more fun, I wish I had the breath to say to him.</p>\n<p>The descent takes us into yet another picture-postcard village of stone cottages and manicured greens before we begin the final, undulating stretch back to the Angel.</p>\n<p></p><div><div>\n  <a href=\"/in-depth/9802/a-gourmet-ride-in-yorkshire-photos#31\"><p><span>Image 32 of</span> 33</p><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/06/cyc_dales_060.jpg?itok=jEJrwBFJ\" /></a></div>\n<p><span>Image 32 of </span>33</p>\n</div> <p></p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2021: Everything you need to know</a></div>      <div><a href=\"/news/8632/how-to-watch-and-live-stream-the-tour-de-france-2021\">How to watch and live stream the Tour de France 2021</a></div>      <div><a href=\"/in-depth/9838/gallery-bikes-of-the-tour-de-france-2021\">Gallery: Bikes of the Tour de France 2021</a></div>    </div></div><p>\nDespite the 60km-plus and 1,400 metres of climbing in my legs, I manage to keep up with Michael during this final section and learn how he developed his passion for food.</p>\n<p>'My parents were travellers, they took us all over Europe and the world from our home in Preston,' he says. 'When I was four, we travelled by camper van to Istanbul. That’s where I had my first espresso. That’s where this all started from.'</p>\n<p>But it almost ended there too. 'I had blonde hair and blue eyes. When my parents took me to the souk, a lot of Turks wanted to buy me.' Fortunately for lovers of fine food and great cycling, their offers were turned down.</p>\n<p></p><div><div>\n  <a href=\"/in-depth/9802/a-gourmet-ride-in-yorkshire-photos#32\"><p><span>Image 33 of</span> 33</p><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/06/cyc_dales_063.jpg?itok=T1VpAKst\" /></a></div>\n<p><span>Image 33 of </span>33</p>\n</div> <p></p>\n<p>For details of food and accommodation packages at the Michelin-starred Angel at Hetton, visit <a href=\"https://angelhetton.co.uk/\" target=\"_blank\">angelhetton.co.uk</a>  <br />\nTo download this route: <a href=\"https://www.strava.com/activities/5474218567\" target=\"_blank\">strava.com/activities/5474218567</a>   <br />\nThanks to Pinarello UK for providing the bike </p>\n  </div>\n<div>  \n  <div>      <div>\n<div>\n\n          &lt;&gt;<span><a href=\"/in-depth/9802/a-gourmet-ride-in-yorkshire-photos\">A Gourmet Ride in Yorkshire photos</a></span>&lt;/&gt;\n      \n  \n  <div>\n\n    \n    \n    <div><span>\n      <span><a href=\"/in-depth\">In-depth</a></span>\n  </span><div>  \n  <div>      <div><span>28 Jun 2021</span></div>    </div></div><div>\n        <div><ul><li><a href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.cyclist.co.uk%2Fin-depth%2F9802%2Fa-gourmet-ride-in-yorkshire-photos\">\r\n  <span>\r\n      \r\n          \r\n      \r\n  </span>\r\n  <span>facebook</span>\r\n</a>\r\n</li>\n<li><a href=\"http://twitter.com/home?status=A%20Gourmet%20Ride%20in%20Yorkshire%20photos%20https%3A%2F%2Fwww.cyclist.co.uk%2Fin-depth%2F9802%2Fa-gourmet-ride-in-yorkshire-photos\">\r\n  <span>\r\n      \r\n      \r\n      \r\n  </span>\r\n  <span>twitter</span>\r\n</a>\r\n</li>\n<li><a href=\"https://plus.google.com/share?url=A%20Gourmet%20Ride%20in%20Yorkshire%20photos%20https%3A%2F%2Fwww.cyclist.co.uk%2Fin-depth%2F9802%2Fa-gourmet-ride-in-yorkshire-photos\">\r\n  <span>\r\n      \r\n          \r\n            \r\n              \r\n              \r\n            \r\n          \r\n      \r\n  </span>\r\n  <span>google+</span>\r\n</a>\r\n</li>\n<li><a href=\"mailto:?subject=A%20Gourmet%20Ride%20in%20Yorkshire%20photos&amp;body=https%3A%2F%2Fwww.cyclist.co.uk%2Fin-depth%2F9802%2Fa-gourmet-ride-in-yorkshire-photos\">\r\n  <span>\r\n      \r\n          \r\n        \r\n  </span>\r\n  <span>email</span>\r\n</a>\r\n</li>\n</ul></div>  </div>\n</div><p>\nPhotos: Henry Iddon</p>\n<div>  \n  <div>      <div><div>\n  <a href=\"/in-depth/9802/a-gourmet-ride-in-yorkshire-photos#0\"><p><span>Image 1 of</span> 33</p><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/06/cyc_dales_003.jpg?itok=Stik6WqS\" /></a></div>\n</div>    </div></div><div><h4><span>Read more about:</span></h4><div><div>  \n  <div>      <div><a href=\"/destinations\">Destinations</a></div>    </div></div></div></div>  </div>\n\n  \n</div>\n</div>    </div></div><div>  \n  <div>      <div><a href=\"/destinations\">Destinations</a></div>    </div></div>","author":"jackew","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"621e4718e531b3a905e536d66be9d8ba29c2eb7164351084f5e2f8bd4c1adcbe","category":"Cycling"}