{"title":"Potential and Limits of the Synergy Between Cheiloscopy and Rugoscopy in Forensic Odontology","link":"https://www.preprints.org/manuscript/202406.0684/v1","date":1718077808000,"content":"Aim: The aim of this study is to evaluate the possibility of discriminating between the two sexes through the simultaneous use of cheiloscopy and palatine rugoscopy. Materials and methods: 80 palate and lip impressions (40 male and 40 female) were analyzed. The palate impressions were acquired using both analogue and digital methods. The lip impres-sions were first acquired analogically and then scanned. The morphology of the palatine rugae in the palate impressions was analyzed, with the exclusion of segmental rugae. The lip prints were analyzed in sextants and the morphology of the lip wrinkles was evaluated. Results: Palatine rugoscopy shows that women have more curvy rugae than men and that men have more rugae on the left side than on the right. Cheiloscopy gave no statistically significant re-sults. Discussion: Palatine rugoscopy showed some differences between the sexes, however, these re-sults were not solid enough for reliable sex discrimination. Differences between the results of dif-ferent studies can be attributed to ethnic and methodological variations. Cheiloscopy, on the other hand, did not provide statistically significant results for sex discrimination. Conclusions: Given the scant results obtained from palatine rugoscopy and the lack of statisti-cally relevant results in cheiloscopy, together with a lack of concordance among the data found in literature, it is believed that it is not possible to discriminate between the two sexes by using the two methods contemporarily. Further research is needed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"622580285f06e85652fd6b59b31398129aec2eb3ae40d9e62a92005afcffcb2b","category":"Interdisciplinary"}