{"title":"Contrary to expectation: The surface urban heat island intensity is increasing in population shrinking region while decreasing in population growing region-A comparative analysis from China","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300635","date":1710770400000,"content":"<p>by Luofu Liu, Wei Zhang</p>\r\n\r\nExploring the complex relationship between population change and surface urban heat island (SUHI) effect has important practical significance for the ecological transformation development of shrinking cities in the context of the prevalence of urban shrinkage and the global climate change. This paper compares the population change and SUHI effect between population shrinking region (Northeast Region, NR) and population growing region (Yangtze River Delta, YRD) in China, and explores their differences in driving mechanisms, using GIS spatial analysis and Geodetector model. Our results indicated that there are significant differences in population changes and SUHI intensity between these two regions. About 72.22% of the cities in the NR were shrinking, while their SUHI intensities increased by an average of 1.69°C. On the contrary, the urban population in the YRD shows a linear growth trend, while their SUHI intensities decreased by 0.11°C on average. The results of bivariate Moran’s I index also indicated that the spatial correlation between the urban population changes and the SUHI intensity changes are not significant in the above regions. Furthermore, there are significant differences in the primary drivers of SUHI variations between these two regions. In the NR, underlying surface changes, including the changes of green coverage and built-up areas, are the most important driving factors. However, atmospheric environment changes, such as carbon dioxide emission and sulfur dioxide emission, are the key drivers in the YRD. Northam’s theory of three-stage urbanization and environmental Kuznets curve hypothesis are powerful to explain these differences.","author":"Luofu Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"622e4f71628df2d74341b3a58f84caf99a571a672322bc1139b3532f35b4449c","category":"Interdisciplinary"}