{"title":"Anna van der Breggen: The Conclusion to a Supreme Career","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/anna-van-der-breggen-the-conclusion-to-a-supreme-career","date":1633524496000,"content":"\n      <p>The year is 2021, and <strong>Anna van der Breggen</strong> is one of the world's leading cyclists. The Dutchwoman’s achievements throughout her '21 campaign include her second victory at Omloop Het Nieuwsblad, a seventh La Flèche Wallonne title in a row and a fourth Giro d'Italia Donne crown.</p>\n<p><span>Despite her extraordinary performances, the 2021 season will be Van der Breggen’s last as a professional rider. Although she's dismounting, she isn’t leaving the sport altogether; Van der Breggen will swap the peloton for the team car in 2022 as she moves into a sports director role with her current employer, SD Worx.</span></p>\n<div></div>\n<p><span>Considering her phenomenal results alongside her age — Van der Breggen is 31 years old — for onlookers, her decision could be a puzzling one. However, o</span><span>ne of the major factors that has influenced Van der Breggen’s decision to retire is her desire to start a family.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/pages/rouleur-live\">See Van der Breggen at Rouleur Live 2021</a></em></strong></p>\n<p><span>Van der Breggen explained her decision in March. “It is a big factor for me to quit cycling at this point [starting a family]. I’m married and my husband is nine years older than I am, so that also plays a role, and it’s a decision of us both.”</span></p>\n<p><span><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW1_3861-min_1024x1024.jpg?v=1633435751\" />Anna van der Breggen at the European Championships in 2020. (Image credit: </span></i><i><span>Alex Whitehead/SWpix)</span></i></span></p>\n<p><span>Some of the top female cyclists have had children before <span>successfully</span> returning to the forefront of the peloton. Lizzie Deignan gave birth to her first child, Orla, in 2018. She returned to racing in 2019, where since, she has won Liège-Bastogne-Liège Femmes and the inaugural Paris-Roubaix Femmes.</span></p>\n<p><span>Van der Breggen has acknowledged that returning to the peloton after starting a family is possible, but also explained the challenges this would involve. “Coming back into cycling [after starting a family], I think it is possible, but you also need to feel that motivation, which is probably hard when you have a kid at home.</span></p>\n<p><span>The list of Van der Breggen’s accomplishments is seemingly endless. Her seven consecutive victories in a row at La Flèche Wallonne show explosive power on one of the most punishing finishes in cycling — the Mur de Huy, while her four Giro Donne victories demonstrates her incredible consistency. But which victory does she savour the most?</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/luck-number-7-anna-van-der-breggen-is-the-queen-of-huy\">Related: Queen of Huy</a></em></strong></p>\n<p><span>“I</span><span>t was really special to be a double world champion last year [in 2020], that is the most special.” </span></p>\n<p><span>After winning the time-trial for the first time in her career two days prior to the 2020 road race, Van der Breggen attacked on the Imola circuit with more than 41 kilometres left. Here, she used those time trialling skills to extend her lead, winning the road race by a phenomenal one minute and twenty seconds. The time trial was introduced at the women's world championships in 1994, and since,</span><span> <span>Jeannie Longo is the only other women to achieve the double aside from Van der Breggen.</span></span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_8713-min_1024x1024.jpg?v=1633448539\" /></span><em><span>Van der Breggen becomes the double world champion in Imola, 2020 (Image credit: Simon Wilkinson/SWpix)</span></em></p>\n<p><span>With Chantal van den Broek-Blaak also planning to retire in 2022, SD Worx have enhanced their roster with some of the brightest talents in the sport. Liège-Bastogne-Liège Femmes winner Demi Vollering has had an increasingly prominent role this season, whilst the promising Kata Blanka Vas signed with SD Worx late in the 2021 campaign. The 20-year-old was fourth in the women’s road race at Flanders 2021. Lotte Kopecky and Marlen Reusser will also join the team for the 2022 season.</span></p>\n<p><span>Ahead of her full-time role in the team car in 2022, Van der Breggen told <a href=\"https://www.cyclingnews.com/features/anna-van-der-breggen-the-next-chapter-begins-now/\" target=\"_blank\">cyclingnews</a> </span><span>that she’s looking forward to nurturing the young talent in the SD Worx squad.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/pages/rouleur-live\">Rouleur Live Tickets</a></em></strong></p>\n<p><span>\"<span>We have a lot of young riders on our team. I don't want them to have that kind of pressure, to be the star of the team. It's nice that there are more of them, and we need to grow in the future. It's nice to get to know them and help them learn how to be good riders.\"</span></span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_6946-min_1024x1024.jpg?v=1633435768\" />Anna van der Breggen’s racing career concluded at the 2021 World Championships in Flanders. (Image credit: Alex Broadway/SWpix)</span></i></p>\n<p><span>Her fourth title at the Giro d’Italia Donne, a race that only Fabiana Luperini has won more, will be the final victory of Van der Breggen’s gleaming career. After finishing third in the time trial at the Tokyo 2020 Olympic Games, Van der Breggen eased her workload and the self-inflicted performance pressures that come with racing at the very top.</span></p>\n<p><span>Now, it’s time for her to focus on her new career, where she'll remain very much a key member of the SD Worx setup. </span>“For me, it’s a good thing that I can continue in another way. My knowledge is not gone. I can help young girls. That’s something I‘m really looking forward to.”</p>\n<p><em>See Anna van der Breggen in London this November at<span> </span><a href=\"https://www.rouleur.cc/pages/rouleur-live\">Rouleur Live</a></em></p>\n<p><i><span>Cover image: </span></i><i><span>Alex Broadway/SWpix</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"62376ffcd78c86ea0958fe215c1c58b343759c9fbaf23e1ce3363330d342e6f4","category":"Cycling"}