{"title":"'Every detail is studied' - Christophe Laporte on what gives Jumbo-Visma the edge","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/it-s-important-not-to-take-things-for-granted-christophe-laporte-on-an-unbeatable-season-with-jumbo-visma","date":1697813141000,"content":"\n      For every generation of cycling, there is a team that dominates, creating an addictive winning combination that takes each rider higher. Such teams like Renault-Gitane or La Vie Claire had that DNA in the 1980s, while the CSC team or Team Sky provide more recent examples. <br />\n<div></div>\n<div></div>\n<p><br />Today, that team is clearly Jumbo-Visma. The Dutch squad was a constant force in the Classics, not to mention the winners of all three Grand Tours this year. While the spotlight is on the team’s big stars, much of their success is built on their ability to elevate every rider. Perhaps no rider reflects the team’s metamorphosis better than Frenchman Christophe Laporte. <br /><br />Laporte came to the team two years ago. At the time, Laporte had yet to win a major Classic, and the team had yet to win the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>. His presence mirrors Jumbo-Visma’s rise to the summit of sport. He has since won Classics like Gent-Wevelgem, not to mention the recent European Championships, and he has provided key support to the team’s first Tour de France victories in 2022 and 2023. <br /><br />At Cofidis, Laporte earned a reputation as a punchy sprinter, but he was far from being one of the world’s best one-day riders. “This is a team that really does everything at 100%. Every detail is studied,” Laporte told <em>Rouleur</em> before the Grand Prix Cycliste de Quebec in September. “And then there is the atmosphere in the team, a certain confidence that has installed itself. We know that when we start a race, we are racing for victory. We don’t go into a race asking questions. We are going to win. There is a real snowball effect, and it is so inspiring.”<br /><br />According to Laporte, the biggest difference at Jumbo-Visma is the repetition of extended altitude camps and a real focus on nutrition and material. “Before at Cofidis, we didn’t really do them [altitude camps], but here with Jumbo, we do two camps of three weeks and a two-week camp in the first half of the season. We do two three-week camps in February and May, and then directly after the Critérium du Dauphiné, we leave for a two-week camp just before the Tour de France. That’s a lot, but it makes a difference. The same is true with nutrition. We actually have an application that calculates the nutritional value of everything we eat.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg14_Cristophe_Laporte_Rouleur_2023.jpg?v=1697802067\" /><br />For Laporte, the biggest sacrifice was the time away from home. “I have two boys, and the time you spend away from them is not time that you can recuperate elsewhere. That has really been hard. But at the same time, I know now that you simply cannot duplicate the benefits of a three-week altitude camp at home. There are no distractions at an altitude camp. It is just ride, rest and eat. And you really improve.”<br /><br />“We are very, very happy with Christophe. He is an incredibly good teammate,” said sports director Frans Massen. “He’s a special guy. He’s a really nice guy, and he has got a big engine. When he came to the team, he was already very good, but was a little rough around the edges and there were details where he could improve. But he has been a really good fit in the team. He is really easy to be around, and if you saw how much he was pulling in the Tour de France, you understand what kind of engine he has. He did simply a fantastic Tour de France. He can also win races himself, however, big races like Ghent-Wevelgem.<br /><br />Interestingly, when Laporte opted to leave Cofidis, many, including himself, speculated on whether he would have much opportunity to ride for himself on a team that was built around Wout van Aert in the Classics, but Laporte quickly proved himself and has become a strong ally to Van Aert rather than a simple support rider. <br /><br />“Coming to the team, I quickly understood that I was going to work with Wout and not simply for Wout. As a result, I have more chances of winning with Wout on my team than if I was simply the sole leader on the team,” he said.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg01_laporte02_dauphine_2023.jpg?v=1697802088\" /><br />This strength in numbers was never more apparent than in the spring Classics when the two riders powered away from the field in Ghent-Wevelgem, with Laporte winning under the encouraging eye of Van Aert.<br /><br />“That was such a special moment,” Laporte said, speaking of his victory in the historic Belgian Classic. “We were already in the front group at E3, and Wout won. But at Ghent-Wevelgem, we were off, alone, for 50km in difficult weather conditions. Already that was special. And then towards the end, with about two kilometres remaining, Wout said to me, <span>‘</span>This one’s for you today!<span>’ T</span>hat was a really emotional moment. And it shows what kind of leader he is. Wout is just really generous. It has been an amazing couple of years riding with him. I’ve had a lot of other great moments with guys on the team, but with Wout, we have really lived some special moments together.”<br /><br />While Laporte understands that the team is still in the midst of an upward spiral, one where winning is infectious, he also understands that nothing is given. “It won’t last forever. It never does. But it is really important that we keep looking for ways to improve. We are always discussing what things are working, but also what things we can improve on.<br /><br />“Right now, we're in that phase where everything is clicking, and it is really exciting. It’s important not to take things for granted. It’s not because we win that everything is perfect. You have to keep asking questions.”</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"623e77810f92b7cc8b132a800c21e28bfe3b4b4b134f0893e5ffad4554a665f9","category":"Cycling"}