{"title":"ชีวิตกระแดะ","link":"https://markpeak.net/snob/","date":1623310375000,"content":"<p>เห็นโพสต์ของพรรคเพื่อไทย ที่สรุปการบรรยายของ พันศักดิ์ วิญญรัตน์ ในโครงการ The Change Maker เอาไว้เมื่อเดือนมีนาคม</p>\n<p>ในฐานะที่เคยพูดคุยกับ อ.พันศักดิ์ มาบ้าง เคยฟังเรื่องเหล่านี้แล้วหลายครั้ง เลยคัดลอกมาจดบันทึกไว้</p>\n<p></p>\n<blockquote>\n<ol>\n<li>พันศักดิ์เริ่มต้นการบรรยายด้วยคำถามว่า ทำอย่างไรให้คิดไอเดียออก? “พวกคุณต้องฝึกต้องเทรนตัวเองให้สังเกตและฟังความต้องการ ความกระแดะของคนอื่นและแปรมันมาเป็นระบบคิดให้ได้”</li>\n<li>กุญแจสำคัญของการคิดสร้างสรรค์เชิงนโยบายคือ หาความต้องการนอกเหนือปัจจัย 4 เพราะมันคือหัวใจของการพัฒนาเศรษฐกิจ ซึ่งอาจารย์พันศักดิ์ นิยามสิ่งนี้ว่าคือ ‘ชีวิตกระแดะ’</li>\n<li>โจทย์สำคัญในตอนนี้คือตอบสนอง ‘ชีวิตกระแดะ’ ในโลกโควิด-19 “คุณต้องเสนอว่าจะอยู่กับโควิดได้อย่างไร? ต้องอธิบายให้ได้ว่าใครจะมาเมืองไทย เขากลัวอะไรกัน อุตสาหกรรมที่สำคัญที่สุดในอนาคตคือ อุตสาหกรรมตอบสนองการกลัวความตาย ซึ่งมีมูลค่าทางเศรษฐกิจที่ใหญ่มหาศาล”</li>\n<li>อาจารย์พันศักดิ์ อธิบายเพิ่มเติมว่า “สิ่งที่สำคัญของมนุษย์คือการทำมาหากิน ไอ้การทำมาหากินด้วยความคิดสร้างสรรค์มันต้องการสัมผัสด้วยตัวเป็นๆ ต้องการเจอหน้า สื่อสารกันด้วยประสาทสัมผัสต่างๆ ในช่วงเวลาโควิดสิ่งเหล่านี้คือสินทรัพย์ที่มีคุณค่ามหาศาลเพราะมันอยู่ใน DNA มนุษย์ เราต้องการการสื่อสาร” ซึ่งหน้าที่ของคนคิดนโยบายคือแปรสินทรัพย์เหล่านี้ออกมาให้เป็นนโยบายให้ได้</li>\n<li>หนึ่งในเคล็ดลับอาจารย์พันศักดิ์บอกว่าความคิดสร้างสรรค์จะทำงานมากขึ้น เมื่อมีข้อจำกัด “ถ้ามันมีปัญหาเป็นเงื่อนไขที่ทำให้เกิดความสร้างสรรค์ มันจะมีพลังมากกว่าเพราะมันต้องปฏิบัติได้จริง เพื่อแก้ปัญหาให้กับทุกฝ่ายในข้อจำกัด”<br />\n“ผมไม่ชอบคำว่า ‘ทุกวิกฤติเป็นโอกาส’ ผมว่ามัน bullshit แต่ผมว่าในทุกวิกฤตมันท้าทายจิตวิญญาณและจิตสำนึกของท่าน (…) ‘ความคิดที่จะแก้ปัญหา’ มันเป็นความคิดสร้างสรรค์ที่คุณมีต่อปัญหาที่คุณหลีกเลี่ยงไม่ได้ แต่ในเวลาที่ชีวิตไม่มีปัญหา เราก็ใช้แค่คำว่า creativity แล้วใส่จริตเข้าไปเฉยๆ แต่ไม่มีเนื้อหาของ innovation”</li>\n</ol>\n</blockquote>\n<p>อีกคำที่เคยได้ยินบ่อยๆ คือคำว่า <a href=\"https://en.wikipedia.org/wiki/Snob\">snob</a> ที่หมายถึง “ความกระแดะ” ของผู้ดีอังกฤษสมัยก่อน แต่มิติที่พูดถึงจะออกไปในเชิง ความรุ่มรวยในการใช้ชีวิตที่เหนือจากปัจจัย 4 (ถ้ายกตัวอย่างสมัยนี้ก็อย่างเช่น กินกาแฟคั่วเอง ฯลฯ) ซึ่งไม่ใช่เรื่องผิดอะไร แต่เป็นจุดที่เราใช้ประโยชน์ในการสร้างมูลค่าทางเศรษฐกิจ (value creation) ขึ้นมาได้</p>\n<p>หมายเหตุ: โพสต์เก่าที่เคยเขียนถึง อ.พันศักดิ์ <a href=\"https://markpeak.net/deng-yingchao/\">เติ้งอิ่งเชา</a> และ <a href=\"https://markpeak.net/match-your-future/\">ร่วมลงทุนอนาคต</a></p>\n<p>ภาพประกอบ: <a href=\"https://www.pexels.com/photo/woman-wearing-black-cap-holding-bottle-on-white-speedboat-during-daytime-209978/\">Pexels</a></p>The post <a href=\"https://markpeak.net/snob/\">ชีวิตกระแดะ</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"6240ee0f654f8e5244f50708e042f6d63afc94fb4a5ee4c857fc8ddc0eb6c426","category":"Thai"}