{"title":"An ecological vulnerability index to assess impacts of offshore wind facilities on migratory songbirds","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14799?af=R","date":1728899330000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/2de4ff40-b121-4fbb-a35d-c931fe531c00/jpe14799-toc-0001-m.png\" alt=\"An ecological vulnerability index to assess impacts of offshore wind facilities on migratory songbirds\" />\n<p>Our methodology is readily applicable to other regions where offshore wind (OSW) development is planned and songbird migration is common, allowing research and monitoring activities to be targeted to species most likely to be negatively affected by OSW facility encounters.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAs offshore wind (OSW) energy expands globally, migratory songbirds are at risk of mortality from collisions with turbine blades, though the magnitude of this threat and which species are most vulnerable, remains poorly understood. Ecological vulnerability indices are commonly used to assess species' susceptibility to harmful factors, with results used to direct scarce research and monitoring resources to species showing relatively high vulnerability. These indices are based on the traits that elevate a species risk to adverse impacts (sensitivity), the overlap in occurrence between a species and the potentially harmful agent (exposure) and the influence of this exposure on the species' local or global persistence (resilience).\n\nWe modified ecological vulnerability indices for seabirds to assess vulnerability of migratory songbirds to OSW related mortality. As a pertinent case study, we considered songbirds that fly across the Northwest Atlantic during their autumn migration. We utilized readily available information on each species' migratory behaviour, life history, and conservation status to calculate an index score that could range from 1 (lowest vulnerability) to 125 (highest vulnerability).\n\nWe found scores of 3 to 55.2 for the 101 songbird species evaluated, with New World warblers (Parulidae) over-represented among the highest scoring species. We found the scores to be sensitive to uncertainty in index components, highlighting the importance of considering scoring uncertainty when evaluating ecological vulnerability indices. Finally, we found that for seven of the top 10 highest scoring species, modest improvements in population trends had the potential to lower the scores substantially.\n\n<i>Synthesis and applications</i>. Our methodology is readily applicable to other regions where offshore wind (OSW) development is planned and songbird migration is common, allowing research and monitoring activities to be targeted to species most likely to be negatively affected by OSW facility encounters.\n</p>","author":"Leon A. Green‐Tkacenko, \nMichael C. Allen, \nJulie L. Lockwood","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"62457077c982a2861c7fc2ab2d1ceae7fabddb5d3e8fd30eaf48db2ead4208ee","category":"Environment"}