{"title":"Tips And Tricks For Evaluating UX/UI Designers","link":"https://smashingmagazine.com/2021/10/tips-tricks-evaluating-ux-ui-designers/","date":1634302800000,"content":"<p>When a company’s digital representation lacks a dedicated UX/UI design team, it can be hard to produce something that stands out from the crowd. The best designers and agencies have a touch of magic about them, transforming your company’s goals, customers’ demands, user specifications, and design instruments into a beneficial experience for both users and businesses. It may seem enchanting how well-designed apps or websites can boost your sales, but it takes far more than a handful of fairy dust to make users enjoy their interactions. </p>\n<p>The reason we pay so much attention to design (as we do to any other detail in the process of project completion) is that it plays one of the crucial roles in your business success. <strong>To get decent ROI in the digital sphere, you need both a great product and a great design.</strong> The two are interdependent. If your design is flawless but your service lacks essential features, don’t expect design to cover for them. And vice versa. </p>\n<p>Yet, providing your customers with a well-designed digital solution gives them a chance to appreciate your product to its fullest. That happens when your app/website/system is efficient. And memorable. And easy to understand. And reliable. And carefully arranged. And elaborate. And forms an immediate emotional connection with the users. And urges them to come back again. <em>That’s why</em> you need a good UI/UX designer. Or, better yet, a team.</p>\n<p>This article is about the essentials of evaluating potential designers and design agencies you wish to hire. Getting this right is more important than ever, for a couple of reasons: </p>\n<ol>\n<li>The global pandemic situation has reshaped the way business is conducted, especially online.</li>\n<li>Even once COVID-driven economic conditions cease to exist in the (hopefully) near future, outsourcing will remain a better option for many companies, both in terms of financial resources and worldwide talent engagement.</li>\n</ol>\n<p>Every selection process starts with understanding how important it is to have an expert who “gets” your end-users, who can collect all the needs, don’ts, wants, shoulds, and must-haves to ensure you communicate with customers fluently. Then, you start wondering HOW to find out if you have chosen the right person for the job. </p>\n<p><strong>NB:</strong> <em>Following your gut may be helpful in making some business decisions, BUT this is not the case here.</em></p>\n<p>The ultimate goal is to ensure your app/website can provide its users with the most value possible as seamlessly as possible. So, you expect your designer/design agency to be equally as efficient, cutting, and customer-centered in terms of design and UX. </p>\n<p>When it comes to the decision-making process, many businesses make the same mistake over and over again. They apply the same methods used to hire entirely different roles, or allow themselves to trust their instincts. </p>\n<p>This article exists to prevent those things from happening. <strong>Intuition is not the best adviser when selecting or outsourcing a UX/UI designer</strong>. The key to successful hiring requires a different strategy: a list of strict requirements and versatile aspects to assess. The latter would help you pass a more objective and qualified verdict on the candidate’s ability to help your company thrive.</p>\nKnow What YOU Want Before Evaluating A Designer\n<p>I don’t want to give you a set of “designer evaluation criteria” straight away, and the reason is this: it’s not the best place to start. Stage one is about identifying what your company needs from a certain digital product. Before selecting a UX/UI designer/design agency, you have to sit down and <strong>list all the requirements and deliverables.</strong> This will help you understand what qualities you are actually looking for in your future employee. </p>\n<p>Where deliverables are concerned, include the ones you may have in both the research and the production phase of your collaboration. The former may require user experience research, user behavior analysis, brand positioning, and market niche analysis. The latter will include prototyping, usability, and interaction design testing, as well as building wireframes and exploring user journeys. </p>\n<p>Using such tools is financially effective, helping to <a href=\"https://www.mckinsey.com/business-functions/marketing-and-sales/our-insights/best-of-both-worlds-customer-experience-for-more-revenues-and-lower-costs\">reduce your costs of service by 15-20%</a>. Mapping out user journeys in detail helps to track both minor and global issues inherent in your company, as well as analyze your target audience preferences, attitudes, dislikes, and fads. This creates a whole new pool of production and marketing opportunities for your business. </p>\n<p>At present, customer satisfaction is certainly a priority. In 2021, it’s not just advisable, but compulsory to <strong>invest in customer experience</strong> as with high-quality software development available literally anywhere and at different costs, successful interaction with your customer is the real game-changer. </p>\n<p>To be more precise in terms of software requirements, try to define:</p>\n<ul>\n<li>the type of the software itself and the environments where it will be applied;</li>\n<li>tasks, features, and functions your software should be able to perform;</li>\n<li>similar apps/websites/platforms that might prompt what you like and what you would or wouldn’t expect to get.</li>\n</ul>\n<p>In addition, keep in mind usability and affordability reconciliation as well as checking if you meet both standards. Finally, highlight the project’s scope, define timelines, and prepare all the legal papers to be fully armed before you move on. </p>\n<p>Once the actual cooperation begins, you and your designer/design agency will have to adjust, revise, and re-define these deliverables and requirements in a more precise manner. So, why bother now? If this seems either too strenuous or irrelevant at this point, remember this: the more specifications you provide to your potential designing partner, the easier the selection process will appear. And the fewer obstacles you will encounter when you work together.</p>\nSkill Sets For Evaluation\n<p>The next step is finalizing a list of hard and soft skills you wish your designer to have. This step, if carefully planned, is essential to the success of your project. The main obstacle at this stage is the variety of skills and their importance in the course of project implementation. Thus, we have made a <a href=\"https://smashingmagazine.com/provide/cheatsheet-delection-assessment-process.pdf\">downloadable cheatsheet</a> for you to use in the course of the transparent assessment of:</p>\n<ul>\n<li><a href=\"#ux-processes\">UX processes</a>,</li>\n<li><a href=\"#project-skills\">Project skills</a>,</li>\n<li><a href=\"#personal-qualities\">Personal qualities</a>.</li>\n</ul>\n<p>How or where can you use them efficiently? Through analyzing the designers’ previous projects, asking questions at the interviews, or analyzing test tasks and preliminary proposals. The key focus should be on the level of the necessary skills a potential candidate has. By rating them you can make a data-driven decision and base it on the factual representation of the desired qualities. </p>\n<h3>UX Processes</h3>\n<p>To start with, here’s a set of the universal UX processes crucial to the successful completion of any design-based project whether or not it is carried out by a remote-work team.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5efa0f9c-6e5a-4f24-b418-f803676fb660/1-tips-tricks-evaluating-ux-ui-designers.png\" /></p>\n<p>To make your evaluation more accurate, here’s a brief explanation of the processes themselves, reasons why they are necessary, and tips on how to check them. You can use this table to mark the level of their excellence in your potential candidate/agency.</p>\n<table>\n  <thead>\n    <tr>\n      <th>Process</th>\n      <th>What to evaluate</th>\n      <th>Why is it important</th>\n      <th>How to assess</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td><strong>User research</strong></td>\n      <td>Understanding the needs, emotions, perception, and experience of the end-users. Examine target audiences in detail (their age, background, qualifications, interests, possible disability issues etc.)</td>\n      <td>Minimizes the risk of designing the wrong product for the wrong people.</td>\n      <td>Ask what research methods they use and how they affect the final outcome.</td>\n    </tr>\n    <tr>\n      <td><strong>Information architecture</strong></td>\n      <td>Presenting information efficiently for users, anticipating their future actions to make navigation through apps and websites easy.</td>\n      <td>This makes users’ interactions with your digital product easy and enjoyable.</td>\n      <td>Check the designer’s previous works to see how the parts fit together. Examine how relevant or compatible they are.</td>\n    </tr>\n    <tr>\n      <td><strong>Visual design</strong></td>\n      <td>Using visual elements (fonts, color, background, size, etc) through contrast, proximity, or repetition to convey the functionality of a particular page.</td>\n      <td>Allows you to accentuate and prioritize tasks and messages.</td>\n      <td>Opt for designers you admire, respect, trust, and feel they take into consideration your thoughts on the visual design as well as guide you since it is not a rare occasion that what you want as a client does not always work best for the end-customer.</td>\n    </tr>\n    <tr>\n      <td><strong>Prototyping</strong></td>\n      <td>Creating a concept to make adjustments and receive feedback from experts involved.</td>\n      <td>Testing the elements of a digital product before it is finalized is essential, giving you examples of how the app/website will work and look.</td>\n      <td>Ask the designers if their clients have access to a clickable prototype.</td>\n    </tr>\n    <tr>\n      <td><strong>Usability evaluation</strong></td>\n      <td>Testing the product to make sure the maximum level of understanding has been reached.</td>\n      <td>Allows you to identify any failures or shortcomings and improve them.</td>\n      <td>Ask designers for examples of how they test their products to check they fit the end-users.</td>\n    </tr>\n    <tr>\n      <td><strong>Interaction design</strong></td>\n      <td>Designing how the end-product may feel, look, and interact with the customer.</td>\n      <td>Creates a feedback loop for how beneficial or wanted different features may be to the end-user.</td>\n      <td>Examine previous works and see if the design makes sense and behaves in the expected way.</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Bear in mind that although it seems rather optional for the UX/UI designer to master development skills, they appear to be quite handy when it comes to a holistic approach. It is advisable for your designer team to have at least basic knowledge of HTML/CSS and understand how front-end/code/styles work, as well as to be able to use the console and make any adjustments if necessary. All this helps ensure the designing process runs smoothly without rough interruptions, missing significant points, or misunderstanding between the development and the design teams.</p>\n<p>These skills may seem purely technical. In fact, they are first and foremost focused on creating a user-oriented digital solution driven by understanding. In terms of its value for your company, according to recent statistics, the top 10 most empathetic companies managed to <a href=\"https://hbr.org/2016/12/the-most-and-least-empathetic-companies-2016\">increase their value more than twice</a>. Surprisingly, in the goal-oriented and pragmatic world of the 21st century, empathy appears to be in high demand. No wonder involving emotional impact into your business activities contributes to enhanced employee relations, higher productivity, and, finally, more revenue. Creating an emphatic environment in which company culture and values, leadership, ethical issues, and brand representation in the public eye matter means investing in your future as a viable and prospective manager.</p>\n<p>To sum up, first, you study the processes mentioned above and examine how they are represented in the designer’s works and vision. Next, you check if their qualities correspond to the project requirements you have previously defined. If so, you will reach the highest degree of understanding. What we see as the background for successful cooperation with your designer/agency is clearly defined by one of our clients in the following feedback.</p>\n<h3>Project Skills</h3>\n<p>The second list examines <strong>project management</strong>. They turn out to be even more influential when you think of outsourcing services. That is because the efficient functioning of a remote team demands a higher degree of understanding of the following issues.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/97ac3dd3-0228-4c70-a452-f2e4507583ba/2-tips-tricks-evaluating-ux-ui-designers.png\" /></p>\n<table>\n  <thead>\n    <tr>\n      <th>Skill</th>\n      <th>What to evaluate</th>\n      <th>Why it is important</th>\n      <th>How to assess</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td><strong>Problem setting and strategic thinking</strong></td>\n      <td>If the designer/design agency can identify and prioritize problems.</td>\n      <td>You can’t fix problems that haven’t been spotted. An eye for them allows you to be proactive in finding solutions.</td>\n      <td>Ask if certain “must-do” issues are valid or not. The experiences they have will show how versatile their vision is.</td>\n    </tr>\n    <tr>\n      <td><strong>Systematic approach</strong></td>\n      <td>Whether the candidate understands how products should both meet a need and fit into the user’s life.</td>\n      <td>All the pieces need to fit together for a product to excel. Having a front-to-back outlook helps make that possible.</td>\n      <td>Evaluate their attention to details as well as the bigger picture. Do they connect smoothly?</td>\n    </tr>\n    <tr>\n      <td><strong>Innovation, idea generation, and creativity</strong></td>\n      <td>What the designer/design agency considers creative or innovative in their previous works and how they see your project implementation.</td>\n      <td>Processes are important, but so too is lateral thinking. You need to know they can think outside the box while still incorporating your vision.</td>\n      <td>Designers should explain their ideas and solutions in a “why-what for-so what” mode to help you understand the validity of our design decisions.</td>\n    </tr>\n    <tr>\n      <td><strong>Proactivity</strong></td>\n      <td>How the designer (or a team leader) initiates ideas, motivates workers, coordinates the remote team, and interacts with your in-house employees.</td>\n      <td>A healthy working culture leads to better work (and happier people). You want those who collaborate, motivate, and inspire.</td>\n      <td>Keep a close eye on whether your approaches towards work management are compatible enough. Otherwise you may get an opponent rather than a partner.</td>\n    </tr>\n    <tr>\n      <td><strong>Experience</strong></td>\n      <td>If the designer/design agency has enough experience both in UX/UI design and the area of your interest.</td>\n      <td>As in any line of work, you want people who know what they’re doing, who you trust to bring something to the table you can’t.</td>\n      <td>The indicators for this skill are not the number of years or projects completed but the actual digital solutions produced. Think quality, not quantity. A talented, inexperienced team can still offer great solutions.</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Good UX/UI designers look for a special approach towards every client and audience, as well as the solution to the task. They never explore just one path but study a number of options that may make your users’ lives easier. </p>\n<p>In order to make your judgment as objective as possible, do not forget that you may engage your team for versatile opinions. Also, try assessing the skill sets during interviews by inquiring, discussing, and comparing your visions of the issues.</p>\n<h3>Personal Qualities</h3>\n<p>To make outsourcing cooperation both efficient and effective, never underestimate personal qualities. If anything, they could be the decision triggers in the final stage of your evaluation. The following points will help you understand if you wish to <strong>work with a certain remote designer/team</strong> and if they can bring value to your company.  </p>\n<p><em>How or where can you evaluate these criteria efficiently?</em> Through online interviews, team presentations, back-and-forth messaging, and work sessions. </p>\n<p>For those who doubt the value of personal qualities, here are some numbers. <a href=\"https://www.forbes.com/sites/blakemorgan/2019/09/24/50-stats-that-prove-the-value-of-customer-experience/?sh=736cf0bb4ef2\">Forbes</a> points out that companies excelling at user experience have 1.5 times more engaged employees than those who are less customer-focused. Certainly, it is difficult to analyze such requirements as these are not easily translated into revenue numbers. Yet, to stand out from hundreds of competitors, you need to get out of the so-called “commodity trap” with dozens of similar (if not the same) products and services available here and now. Here, customer experience seems to be the only option to the rescue.</p>\n<p>So, what customer-oriented skills need to be assessed are as follows.</p>\n<table>\n  <thead>\n    <tr>\n      <th>Skill</th>\n      <th>What to evaluate</th>\n      <th>Why it is important</th>\n      <th>How to assess</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td><strong>Communication</strong></td>\n      <td>The ability to present and explain ideas clearly and concisely, listening to and following conversations. In short, to work in an agile environment.</td>\n      <td>These qualities indicate whether your team will be easy to reach, understand, and exchange feedback with. It is important to adjust to ever-changing requirements, and in a timely manner.</td>\n      <td>If the designer/team can articulate their ideas to you, they can “talk” to your customers and translate your needs into a digital solution.</td>\n    </tr>\n    <tr>\n      <td><strong>Collaboration and empathy</strong></td>\n      <td>How they cooperate with other team members; how they deal with conflicts and resolve disagreements; how flexible and open to feedback they are.</td>\n      <td>If they have these traits, they will be able work with all the people involved in the work process, promote their decisions, support users, and make the product correspond to their needs.</td>\n      <td>Empathy is the core ingredient in creating a successful UX design. Remember it is the end-user who will interact and enjoy (or not) the outcome of their work. Will candidates meet those needs?</td>\n    </tr>\n    <tr>\n      <td><strong>Cultural contribution</strong></td>\n      <td>They understand, respect, and represent your company’s values. They are passionate about working with you.</td>\n      <td>A good team is capable of inspiring people they work with. If their vision of values is too different from yours, the product will be far from what you expect.</td>\n      <td>As a sign of respect towards a new client, we show our interest by studying the company and its brand values in advance.</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Now you are fully equipped with the refined lists of skills and qualities you should pay attention to in your evaluation. Once you study or even edit them to suit your needs and ideas, you are ready for the next stage.</p>\nNavigating Interviews\n<p>Once you have the game plan for precise evaluation, your next step is the actual face-to-face (or, rather, camera-to-camera) discussion. In order to filter the talent pool efficiently, start the interview prepared. Remote hiring goes far beyond random inquiries about the candidate’s qualities and experience. It requires a structured list of questions, issues, and topics to discuss. </p>\n<p>Beware also of possible technical failures like poor internet connection or not preparing relevant data in advance. Assign times and meeting links to all candidates. Be there on time. Such details will help keep the whole process smooth.</p>\n<p>What concerns the list of questions you may ask, always think of their content as well as: </p>\n<ul>\n<li><strong>The number of questions.</strong><br />Have enough to allow for substantive discussions while still keeping to the interview window.</li>\n<li>Giving the <strong>proper chance for the candidates</strong> to talk themselves.<br />This way they wouldn’t feel like they are being interrogated.</li>\n</ul>\n<p>The latter is crucial. In our company, we like to provide candidates with the opportunity to give as much input as possible. Examine your potential designer’s speech to see how good they are at explaining their tasks or technical specifications. Our experience shows that the better designers present their vision orally, the more usability they will bring to the product. </p>\n<p>Here are several more points that are much more tricky in their essence.</p>\n<ul>\n<li>Many articles on this topic tell you to ask about the <strong>tools and workflow</strong> of the designer/agency. However, do not expect to get a clear checklist to validate the right candidate. On the contrary, you should just make sure the tools match the ones your team prefers. While the workflow is examined to see if your approaches are compatible.</li>\n<li>Ask the designer/team to <strong>present a project or product</strong> they really enjoyed. This will show how passionate they are about the design in general and working on your project in particular. Your potential employee would be thrilled to give very specific details. Even better, if they explain how this experience might relate to your cooperation.</li>\n<li>Never underestimate the <strong>designer’s questions</strong> about your company/project in return. If they are truly interested, they want to know detailed and relevant(!) information on the target audience, main KPIs, business models, testing methods you apply, and much more. </li>\n</ul>\nMistakes To Avoid\n<p>Our experience of providing outsourcing services before, during, and hopefully after the COVID-19 era has provided us with a number of insights. Here are some ideas on what to steer clear of in your evaluation. </p>\n<ul>\n<li><strong>If your budget is big enough, opt for an agency.</strong><br />When compared to freelancers, the former will definitely offer more expertise. Once you vote for an all-in-one option, this person should be either in charge of every stage and process or you may get a limited amount of functions performed. </li>\n<li><strong>Questions you ask are valuable.</strong><br />Sensible re-defining or re-stating may be the key to getting the clarity we need. Sometimes, even the source of new discoveries.</li>\n<li><strong>Look for initiative as well humility.</strong><br />The latter is usually presented as one of the most valuable qualities of a UX/UI designer. However, its significance could be exaggerated. In some cases, it is vital for the designer/team to take the initiative in introducing ideas or justifying important decisions. </li>\n<li><strong>Prioritizing skills is a dead-end approach.</strong><br />You need to evaluate all the necessary skills. Yet, a comprehensive vision is the key to success. Rather than focus on many specific traits, evaluate their combination and compatibility as a whole set.  </li>\n<li><strong>Overestimating portfolios is risky.</strong><br />The number of projects does not correspond to the level of expertise. At <a href=\"https://linkupst.com/\">LinkUp Studio</a>, we offer our clients an overview of the cases related to their project and urge them to look at qualitative achievements. The problems we have solved, the insights and solutions we have offered, and how the latter altered one’s business. Such presentations help future work partners see our holistic approach and the value we bring to their ideas. </li>\n<li><strong>Do not confuse the initial proposal with the in-depth research which comes after you sign up with the agency.</strong><br />Some clients wish to get a preliminary analysis of their project. And that makes sense. A commercial offer presents rough project scope and cost estimation. That is justified for both parties in the process of negotiations. However, further analysis (a.k.a. discovery stage) involves a range of experts like business analysts, designers, developers. So, it should not be expected free of charge as a part of your ballpark estimate.  </li>\n</ul>\n<p>We hope our experience and useful tips uncovered will fully equip you for a conscious designer evaluation. All in all, the keys to making a successful hire are strict criteria to follow a holistic approach towards the assessment process which includes the following stages:</p>\n<ol>\n<li>Identify your company’s precise requirements and deliverables.</li>\n<li>Make the lists of hard and soft skills your designers should possess as well as rate their importance for a particular project in mind.</li>\n<li>Prepare for and conduct interviews to make the right choice.</li>\n<li>Enjoy your cooperation.</li>\n</ol>\n<p>Choosing the proper UI/UX designer is the key to providing your customers with an excellent user experience through incorporating your company’s aims and your client's needs into the design process. The latter being efficient, understandable, reliable, emotionally appealing, and properly devised is the very task of a UI/UX designer you are about to start evaluating. </p>\n<p>To help you make this process pain- and stress-free, we have developed a cheat sheet to come in handy during the selection and assessment process. You can <a href=\"https://smashingmagazine.com/provide/cheatsheet-delection-assessment-process.pdf\">download it here</a>.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"624ac0dc045eaf5e32dc0d0a1b8616f3e58eb35273754f0edaa8568a87cc57b8","category":"Tech"}