{"title":"An innovative irrigation system for farming towards environmental sustainability in India","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14500?af=R","date":1729163306000,"content":"<h2>Abstract</h2>\n<h2>Purpose</h2>\n<p>This work presents an innovative irrigation method designed to assist small-scale farmers. Irrigation is crucial for agriculture, serving as the most essential input for all types of crops. Implementing a cost-effective irrigation method can maximize farmers' output. In small-scale farming, manual irrigation methods are commonly used to reduce costs. Therefore, a technology-enhanced manual irrigation system will benefit marginal and small farmers.</p>\n<h2>Design/Methodology/Approach</h2>\n<p>This work introduces a new irrigation system that incorporates an epicyclic gear train along with a simple gear train arrangement. This system is designed to be attached to a farm's hand pump. The plunger rod with the piston is a crucial component of the hand pump, as its reciprocating motion lifts water from underground. An increased number of reciprocating motions of the plunger rod results in a greater amount of water being lifted from the well.</p>\n<h2>Findings</h2>\n<p>The designed model, when used with the hand pump, maximizes output with minimal manual effort. This system is environmentally friendly and operates without any external power sources.</p>\n<h2>Statement of Novelty</h2>\n<p>Lifting water from underground using a hand pump typically requires devices powered by external sources such as petrol, diesel, or electricity, which incur costs. Consequently, farmers using these methods for irrigation face financial burdens. It has been observed that more than 50% of the total income of small and medium-scale farmers is spent on irrigation. To address these issues, the designed model has been introduced. Its novelty lies in the use of an optimal transmission system featuring simple and epicyclic gear trains, as well as an energy-efficient design facilitated by the inclusion of a flywheel. These features ensure smooth operation and improved efficiency.</p>\n<h2>Statement of Industrial Relevance</h2>\n<p>This system is suitable for both agricultural purposes and curing work in construction. There is a significant market for this innovative design, as it serves as an optimal solution for agriculture and water supply systems without relying on external power sources. Our product is expected to sell quickly in the market. Many industries in India are developing agricultural products, but this system stands out due to its uniqueness, ensuring no difficulties in marketing. The implementation is straightforward, as the necessary input materials are readily available. Once commercialized, the system is projected to reach its breakeven point within 2 months, after which it will generate profit.</p>\n<h2>Originality/Value</h2>\n<p>There can be a diverse group of individuals participating in organizing this event. This group includes not only physically strong men and women but also children, individuals with disabilities, and those who may be weak or average in physical strength. In essence, physical strength is not a limitation for participating in this endeavor.</p>","author":"Ramesh Chandra Nayak, \nManmatha K. Roul","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"624b4dc2699729cd8f97bb400cb61e7db7c8cd76ffa9c5c6305da2b884dbd774","category":"Environment"}