{"title":"What I learned about cars watching all 8 Fast & Furious movies in 4 days","link":"https://arstechnica.com/?p=1544021","date":1619792813000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/08/Universal_FF2_YenkoCamaro-li-800x340.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/08/Universal_FF2_YenkoCamaro-li.png\">Enlarge</a> <span>/</span> LOOKS LIKE THEM DUKE BOYS ARE AT IT AGAIN (credit: <a href=\"https://www.universalpictures.com/\">Universal Pictures</a>)</p>  </figure><p><em>This week, Universal Pictures <a href=\"https://www.fastfridayscreenings.com/\">announced</a> that a different <em>Fast and Furious</em> movie will be in theaters once a week starting today, leading up to the franchise's <a href=\"https://arstechnica.com/gaming/2021/04/fast-and-furious-9-drops-a-new-trailer-ahead-of-june-25-release/\">newest sequel</a> on June 25. The best part of the announcement? The showings are free. (The second-best part of the announcement is how often it refers to the <em>F&amp;F</em> movies as a \"saga.\")\n\nAs we previously learned, once a week for this series is arguably a saner way to devour so much vehicular mayhem than the four-day gauntlet we endured—and we've resurfaced that 2019 article below. If health or safety precautions make Universal's latest promotion inaccessible to you as of late, never fear: we're riding again, much like the Duke boys, with a look back at all the engine-gunning, Corona-drinking, window-smashing fun so that you don't feel left out.</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p>As of last week, I had never seen any movies in the <em>Fast &amp; Furious</em> franchise. I probably missed the first one in 2001 because I was planning my wedding or something else equally pedestrian. Then, before I knew it, there were seven more, and I had no chance of catching up.</p>\n<p>But now the franchise has lasted longer than any of our president's marriages and has just birthed its <a href=\"https://arstechnica.com/gaming/2019/08/hobbs-and-shaw-a-mclaren-a-mcguffin-banter-and-plenty-of-action/\">first spin-off feature</a>. So I have taken it upon myself to shotgun all eight movies in four days and report back to you what they have taught me about cars.</p></div><p><a href=\"https://arstechnica.com/?p=1544021#p3\">Read 45 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1544021&amp;comments=1\">Comments</a></p>","author":"Peter Opaskar","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"624cd0bad19d9dff3ab5f53245b5e4bd37ff6f1803ab9f04b6dafae8f6ee2bd7","category":"Tech"}