{"title":"Fayetteville 2022 race director steps down","link":"https://cyclingtips.com/2021/04/fayetteville-2022-race-director-steps-down/","date":1619035164000,"content":"<p>Brook Watts has decided to step down from his role as organizer of the 2022 Cyclocross World Championships, which are set to take place in Fayetteville, Arkansas.</p>\n\n\n\n<p>Watts announced the news on Wednesday in the wake of recent anti-transgender legislation passed by the state government.</p>\n\n\n\n<p>In March, Arkansas passed SB-354, which prevents transgender girls and women from participating on school sports teams consistent with their gender identity. At the time, Watts said that the bill was “discriminatory and hateful,” while asking fans to “take action in another way” in response to the bill besides boycotting.</p>\n\n\n\n<p>In April, Arkansas passed a law preventing transgender youth from receiving gender-affirming medical care. The governor of Arkansas, Asa Hutchinson, vetoed the bill, but the state legislature overrode that veto. USA Cycling put out a statement opposing “any and all discriminatory legislative efforts that aim to limit an athlete’s access to competition, specifically the recently passed anti-transgender legislation in Arkansas,” but the plans to hold Worlds there in 2022 continued.</p>\n\n\n\n<p>On Wednesday, Watts said in a statement that he would be stepping away from his role as race director for the event.</p>\n\n\n\n<p>“It is with the greatest disappointment that I share with the cyclocross community today that I will no longer be participating as the race organizer of the 2022 Cyclocross World Championships,” he said. “The situation in Arkansas remains problematic and unfortunately, I don’t see any satisfactory solution. I have sincerely but unsuccessfully attempted to work out my concerns and differences with the constituents. However, regrettably, they were not successful.” </p>\n\n\n\n<p>Watts has been part of the US cyclocross scene for over 40 years and has played a role in the development of the sport in the US. He travels to Belgium, the heartland of the sport, every winter to enjoy cyclocross and its vibrant and unique culture. His aim was to bring that culture to Fayetteville and mix it with the uniqueness of the American cyclocross community. </p>\n\n\n\n<p>He travelled back and forth to Arkansas many times to develop and design the course for the 2022 championships, an event he will now not be part of anymore. </p>\n\n\n\n<p>“In departing from my position as race organizer I feel like I’ve left a mark by designing a unique World Championships worthy course as well as a cyclocross park that will serve aspiring future champions,” Watts said. </p>\n\n\n\n<p>“I remain dedicated to continuing to use my position of influence in the cyclocross community to fight for equity in racing and to ensure that the sport is accepting and welcoming to all. I hope you will see this does not compromise my 40+ year love for cyclocross, but rather, one that demonstrates my commitment to making the sport even better.”</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/04/fayetteville-2022-race-director-steps-down/\">Fayetteville 2022 race director steps down</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"62504e13019aa148b5fcc4f87a22f7bb5ab4a472edcc614b338b1393ab810e21","category":"Cycling"}