{"title":"Here's How Apple Plans to Display Vision Pro in Retail Stores","link":"https://www.macrumors.com/2023/12/15/apple-vision-pro-retail-store-display/","date":1702672473000,"content":"As early 2024 approaches, so does the launch date of Apple's first headworn wearable, the <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a>. Apple has promised that the headset will come out in the early months of the year, with current rumors suggesting we could see it before March.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/vision-pro-display-1.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nWith a release fast approaching, Apple is preparing to offer the Vision Pro in its retail stores in the United States, and a filing from an intellectual property database discovered by <em>MacRumors</em> contributor Aaron Perris gives us some insight into how Apple will display the Vision Pro.\r<br />\n\r<br />\nBased on the design images, Apple is preparing a sleek stand for the headset, with the stand set to match other Apple product displays. The curved stand will hold the Vision Pro up in the air, making the display, headband, and other components easy to see from all angles.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/vision-pro-display-2.jpg\" width=\"2000\" height=\"1450\" />\r<br />\nVision Pro headsets will be plugged into an accompanying battery back, which will be stored underneath the headset on the bottom portion of the stand. Apple will not try to hide the battery pack in any way, based on the images. Vision Pro stands will be placed on a mat, with two headsets per mat.\r<br />\n\r<br />\nApple prepares dedicated areas for all of its products, so we can expect the same treatment for the Vision Pro. Flagship retail stores will have hands-on areas where customers can test out the headset, but stores that are not flagships will only have one or two headsets on hand and it is not clear if they will be offering demos.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/vision-pro-display-3.jpg\" width=\"2000\" height=\"2331\" />\r<br />\nApple is bringing <a href=\"https://www.macrumors.com/2023/10/22/apple-to-host-secretive-vision-pro-training-event/\">retail employees to Cupertino</a> in January to train them on how to prepare their stores for the Vision Pro and how to sell the device to customers. The Vision Pro is Apple's most complex device to date. It requires fitted headbands and light seals to work properly, and some customers will require custom prescription lenses.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/vision-pro-headset-display-4.jpg\" width=\"2000\" height=\"609\" />\r<br />\nThere are an increasing number of signs suggesting customers will be required to visit an Apple retail location in order to purchase a Vision Pro headset. According to <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>, Apple will take orders online, but it sounds like customers are going to be <a href=\"https://www.macrumors.com/2023/12/11/apple-to-push-vision-pro-customers-to-pick-up/\">pushed into in-store pickup</a> so that an Apple employee can provide the right headband, light seal, and optional prescription lenses.\r<br />\n\r<br />\nApple plans to limit sales of the Vision Pro to customers in the United States to start with, before expanding availability to other countries in late 2024. The Vision Pro is set to be priced at $3,500, and Apple is reportedly expecting to <a href=\"https://www.macrumors.com/2023/11/20/apple-vision-pro-likely-launch-march-2024/\">make fewer than 400,000 units</a> in 2024.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/15/apple-vision-pro-retail-store-display/\">Here's How Apple Plans to Display Vision Pro in Retail Stores</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/heres-how-apple-plans-to-display-vision-pro-in-retail-stores.2413847/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6279cca4c4f0460ac92930efb655ffa5ba4e97382121ecea2fe856f96da1f2e4","category":"Apple"}