{"title":"Effect of Omega-3 Polyunsaturated Fatty Acid Supplementation on Clinical Outcome of Atopic Dermatitis in Children","link":"https://www.preprints.org/manuscript/202407.1619/v1","date":1721620633000,"content":"The use of omega-3 fatty acids (omega-3 FA) in the treatment of atopic dermatitis (AD) is an area of ongoing research. Some studies suggest that dietary supplementation with omega-3 FA can help manage symptoms of AD by reducing lesion severity, skin inflammation, dryness and itching, while other show no significant beneficial effect. The aim of this study was to evaluate the effect of omega-3 FA form fish oil in combination with GLA form blackcurrant seed oil in children with AD. \nThis is a longitudinal, prospective, randomized, triple blind, placebo-controlled parallel clinical trial. The study was conducted during the 2-year period from autumn, winter, and spring avoiding the summer when AD usually improves. Children were randomized to receive the active study product (Mega Kid®) containing specific blend of omega-3 and omega-6 fatty acids or placebo. Primary outcomes were change in severity of AD measured using SCORing Atopic Dermatitis (SCORAD) patient oriented SCORAD (PO-SCORAD) and the difference in TCS use. Secondary outcomes were change in itch intensity, sleep quality and Family Dermatology Life Quality Index (FDLQI).\nData were analyzed for 52 children (26 in the intervention group and 26 in the placebo group). In children receiving active product intention-to-treat analysis showed that after 4 months of treatment, there was a significant decrease in the SCORAD index (from median 42 to 25, p &lt; 0.001) and use of topical corticosteroids (from median 30 to 10 mg/day, p &lt; 0.001) but also significant improvement in itch, sleep quality and overall quality of life. \nOmega-3 fatty acids in combination with GLA and vitamin D has a great beneficial effect in treatment of atopic dermatitis in children. Therefore, we can conclude that supplementation with this specific combination could be considered a safe and effective intervention that can significantly reduce the severity of AD in pediatric patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"62908ac7409bed4fc8f8f62ff7e5df187a8937156aa6cf984be6f014ad3e2e54","category":"Interdisciplinary"}