{"title":"Freeze Casting Biomimetic Materials: X-Ray Tomoscopy Reveals the Dynamics of Ice Templating and Structure Formation","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.471/7719669?rss=1","date":1721779200000,"content":"<span>The physics of ice-crystal growth from the liquid phase and the complex dynamics of microstructure formation by ice-templating during the directional solidification of aqueous solutions and slurries, also termed freeze casting, has to date received comparatively little research attention. Recent advances in synchrotron-based X-ray tomoscopy, which is time-resolved X-ray tomography, enable us now to investigate in situ under well-defined experimental conditions the formation of the hierarchical architecture of biomimetic, freeze-cast materials. We can quantify in 3D ice crystal growth at high spatial and temporal resolution and observe the ice-templating mechanisms which determine the morphology of the performance-defining honeycomb-like material structure with lamellar cell walls that frequently are decorated with a range of unilateral surface features. Analyzing the tomoscopy data, we can determine, which features of the freeze-cast materials are templated by the slow faceted growth along the c-axis of the hexagonal ice-crystal, and which by the slightly anisotropic fast crystal growth along the preferred a-axis and the t-axes, both of which are characterized by atomically rough ice-water interfaces. Additionally, we can observe, which role secondary instabilities play in the formation of cell wall surface features. Important advantages which in situ X-ray tomography offers over post-mortem imaging and state-of-the-art simulation techniques are that the dynamics of the structural evolution can be monitored over several minutes in a sample volume of several cubic millimeters so that also transient phenomena are captured [<a href=\"#ozae044.471-B2\">2</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"6293ecf84de7ed88d46866636dd5cac986112b8acb9f2ab2706af742ee2da58f","category":"Environment"}