{"title":"Improving O&amp;M Simulations by Integrating Vessel Motions for Floating Wind Farms","link":"https://www.preprints.org/manuscript/202410.1082/v1","date":1728913567000,"content":"This study introduces an integrated methodology that incorporates vessel motion dynamics into the evaluation of operations and maintenance (O&amp;M) costs for floating offshore wind turbines (FOWTs). By combining UWiSE, a discrete-event simulation tool, with SafeTrans, a voyage simulation software, the methodology accounts for vessel motion effects during offshore operations. The approach was demonstrated through a numerical case study at two wind farm sites, Marram Wind and Celtic Sea C, with a fictive wind farm layout of 100 × 15 MW NREL turbine on a UMaine VolturnUS-S platform. Three Major Component Replacement (MCR) strategies were assessed: Tow-to-Port (T2P), Floating-to-Floating (FTF), and Self-Hoisting Crane (SHC). The T2P strategy resulted in the highest O&amp;M costs—94 k€/MW/year at Marram Wind and 97 k€/MW/year at Celtic Sea C—due to extended MCR durations (90-180 days), leading to lower availability (90%-94%). In contrast, the FTF and SHC strategies, which are still under development, demonstrate significantly lower costs and reduced downtime. The SHC strategy, in particular, has proven to be the most cost-effective, achieving up to a 64% reduction in costs while increasing availability to 97%-98%. The integrated approach incorporates vessel dynamics, accounting for factors such as wave direction, wave period, and vessel response to varying sea states. This allows for greater flexibility in setting operational limits, potentially permitting higher limits in favorable conditions where vessel motion impact is reduced. However, in scenarios where dynamic vessel responses lead to increased motions—such as when waves approach from the side  or when the wave period is close to the vessel's natural roll period—more restrictive limits may be necessary, even if significant wave heights are lower. This flexibility or restriction highlights the importance of incorporating motion-based dynamics for emerging technologies in the evolving FOWT O&amp;M market.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"62a568a248ba2a1fad36aec0e857811d2f227438b523d881641fab50e3d7297a","category":"Interdisciplinary"}