{"title":"Functional comparison of human and murine equilibrative nucleobase transporter 1","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311519","date":1727964000000,"content":"<p>by Chan S. Kim, Aaron L. Sayler, Hannah Dean, Nicholas M. Ruel, James R. Hammond</p>\r\n\r\n6-Mercaptopurine (6-MP) maintenance therapy is the mainstay for various types of leukemia and inflammatory bowel disease. 6-MP is associated with numerous adverse effects including gastrointestinal intolerance, myelotoxicity, and hepatotoxicity. This can lead to therapy discontinuation which is associated with a higher risk of relapse. Drug transporter expression is a known factor contributing to patient variability in drug response and toxicity. We have established that the <i>SLC43A3</i>-encoded equilibrative nucleobase transporter 1 (ENBT1) mediates the transport of 6-MP into human lymphocytes and human embryonic kidney 293 (HEK293) cell lines transfected with <i>SLC43A3</i>. ENBT1 is known to be expressed in the gastrointestinal tract, bone marrow, and the liver. However, the relationship between ENBT1 and 6-MP-associated adverse events, and its pharmacokinetics, is unknown. To validate the use of mouse models (e.g. slc43a3-null mice) for exploring this relationship, we assessed the functional similarities between human and murine ENBT1 using HEK293 cells transfected with the respective <i>SLC43A3</i>/<i>slc43a3</i> constructs, and the leukemia cell lines MOLT-4 (human) and L1210 (murine). Based on <i>in silico</i> analyses of structural similarities between transporters, we hypothesized that human and murine ENBT1 will have similar 6-MP transport/inhibition kinetics and a similar impact on 6-MP-induced cytotoxicity. We show herein that <i>mslc43a3</i>-encoded mouse ENBT1 transports both [<sup>3</sup>H]6-MP and [<sup>3</sup>H]adenine with kinetics similar to those of <i>hSLC43A3</i>-encoded human ENBT1. Both are also similarly distributed in mouse and human tissues. Therefore, data obtained from mouse models where ENBT1 is disrupted or modified may provide clinically relevant insights on its roles in modulating the actions of 6-MP.","author":"Chan S. Kim","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"62a6be7adac4c917884f7442a2de44d12ae836dcd7d4adf3aafa7ea91f1fe795","category":"Interdisciplinary"}