{"title":"L-carnitine: A novel approach in management of acute cholinesterase inhibitor insecticide poisoning","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae104/7710317?rss=1","date":1720569600000,"content":"<span><div>Abstract</div>Cholinesterase inhibitors (ChEIs) insecticide poisoning is a serious global health concern that results in hundreds of thousands of fatalities each year. Although inhibition of the cholinesterase enzyme is the main mechanism of ChEI poisoning, oxidative stress is considered the mechanism underlying the related complications. The study aimed to assess the oxidative status of the patients with ChEI insecticide poisoning and the role of L-carnitine as adjuvant therapy in their management. Human studies on the efficacy and safety of L-carnitine in treating insecticide poisoning are limited despite its growing research interest as a safe antioxidant. This prospective study was conducted on eighty patients with acute ChEIs insecticide poisoning admitted to Alexandria Poison Center, Alexandria Main University Hospital, Egypt. Patients were allocated into two equal groups randomly. The L-carnitine (LC) group received the conventional treatment (atropine &amp; toxogonin) and LC and the standard treatment (ST) group received the standard treatment only. Outcome measures were fatality rate, the total administered dose of atropine &amp; toxogonin, length of hospital stay, and the requirement for ICU admission or mechanical ventilation. The study results revealed that malondialdehyde (MDA) significantly decreased in the LC group. Cholinesterase enzyme levels increased significantly after treatment in the LC group than in the ST group. The LC group needed lower dosages of atropine and toxogonin than the ST group. Also, the LC group showed no need for ICU admission or mechanical ventilation. The study concluded that LC can be considered a promising adjuvant antioxidant treatment in acute ChEIs pesticide poisoning.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"62a7b22c2ae7a2e06f3821be8ddf603f7ca6963ed1de7e42a51b1018f21e10ba","category":"Environment"}