{"title":"Apple reveals how it converts developers to the Vision Pro cause","link":"https://www.macworld.com/article/2041437/apple-developers-vision-pro-labs.html","date":1692884226000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple this week published an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/news/?id=5nn2hddv&amp;xcust=1-1-2041437-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">article</a> extolling the effectiveness of its Vision Pro developer labs, a worldwide program of training and hands-on sessions with the company’s upcoming mixed-reality headset. With Vision Pro still something of an unknown quantity ahead of its first-gen launch at some point next year, the labs program appears to be a powerful tool for winning converts to the cause.</p>\n\n\n\n<p>It’s often said that hardware products live or die based on the support they are able to generate among third-party software developers. (Microsoft legend Steve Ballmer knew this all too well, once going viral with a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/watch?v=XxbJw8PrIkc&amp;xcust=1-1-2041437-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">video</a> in which he marched around on stage sweating through his shirt and repeating the word “developers” over and over again. The guy knew what mattered most.) Until Apple launched the App Store–and persuaded devs to fill it with millions of apps–the iPhone was merely a nicely designed smartphone with good PR.</p>\n\n\n\n<p>If Vision Pro is to prosper, Apple needs widespread support from devs working on visionOS software. Which is easier said than done, because Vision Pro is completely different from all the products Apple has launched in the past. That’s where the new labs program comes in.</p>\n\n\n\n<p>In the article, enthusiastic participants from big-name software firms testify that, whatever state their Vision Pro development plans were in beforehand, the labs session helped them to reach a more complete understanding of how customers will experience software using Apple’s new headset. Michael Simmons, head of the firm that made Fantastical, called the session “a proving ground” and reports that “experiencing spatial computing… helped us start thinking not just about left to right or up and down, but beyond borders at all.” David Smith, the name behind Widgetsmith, said he had been “staring at this thing in the simulator for weeks and getting a general sense of how it works, but that was in a box. The first time you see your own app running for real, that’s when you get the audible gasp.”</p>\n\n\n\n<p>It should be noted that participants have to apply for a place at the labs and must therefore be at least somewhat intrigued by the prospect of developing for the new ecosystem before signing up. This won’t be an effective weapon in evangelizing to those who are entirely unconvinced. But Apple clearly knows how important it is to get developers excited about the new platform–and then, by publishing articles like this one, getting potential customers excited too. There’s a lot riding on next year’s <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Vision Pro launch</a>.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"62a931a5b4534c9249b4644ba5cfe295edb185795768af427676a73c543ccf69","category":"Apple"}