{"title":"Maternal Obesity Alters Placental and Umbilical Cord Plasma Oxidative Stress, a Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202408.2208/v1","date":1724987589000,"content":"Maternal obesity has been found to be impaired oxidative status in placenta and newborn which can lead to adverse pregnancy outcomes and long-term adverse influence on metabolic programming in the offspring. This study aimed to investigate the role of maternal obesity on maternal and umbilical cord plasma oxidative status and placental oxidative adaptation. Maternal obesity (n=20) defined as pre-pregnancy BMI ≥ 25 kg/m2 and maternal lean (n=20) defined as pre-pregnancy BMI &lt; 25 kg/m2 were recruited into this study. Both groups were matched by gestational age at delivery. Maternal blood, umbilical cord blood and placental tissue were collected to assess nutritional content (cholesterol, triglyceride, and protein), oxidative stress marker (MDA and protein carbonyl) and antioxidant activity (SOD and catalase). Placenta protein expression (SOD2, catalase, UCP2 and Nrf2) was evaluated by western blot analysis. Catalase activity in maternal plasma significantly increased in maternal obesity group (p = 0.0200) with an increased trend in MDA and protein carbonyl levels. Umbilical cord plasma triglyceride, protein carbonyl and catalase activity significantly increased in maternal obesity compared with that in maternal lean (p = 0.0462, 0.0485, and 0.0348, respectively). Although placenta protein expression analysis exhibited significant decreased SOD2 (p = 0.0169) and catalase (p = 0.0067), accompanied by Nrf2 downregulation (p = 0.0453). An increased mitochondrial antioxidant UCP2 expressions was observed (p = 0.0143). Hence, our study provided evidence that maternal obesity is associated with placental and fetal oxidative stress with the parallel increased placental antioxidant UCP2 expression.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"62b3cae10360851d9215b79f25e52cccd85009553b2e0eeb87c3c3b7b1d9511e","category":"Interdisciplinary"}