{"title":"How to run your favorite iPhone and iPad apps on an M1 or M2 Mac","link":"https://www.macworld.com/article/615147/how-to-run-iphone-ipad-apps-m1-mac.html","date":1678951800000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>The M-series processors used in Apple’s latest Macs are based on technology first developed for the company’s iPhone and iPad. (In fact, some iPads use the same M1 and M2 processors.) Because of this, the M-series chips bring to the Mac the ability to run iPhone and iPad apps.</p>\n\n\n\n<p>Why would you want to run an iPhone or iPad app on a Mac in the first place? Well, it’s possible that there is no Mac equivalent of the app you want to use. Or maybe you like using a particular app, regardless of the hardware it is running on. Whatever the reason, it’s a great way to use the tools you want.</p>\n\n\n\n<p>To run an iPhone or iPad app, your Mac must have an M1 processor or later. If you have an Intel-based Mac, it’s a lot trickier. <a href=\"https://www.macworld.co.uk/how-to/iphone-ipad-apps-mac-3512222/\">You have to use an emulator</a>, an app that simulates iOS or iPadOS.</p>\n\n\n\n<h2>How to get iPhone/iPad apps on your Mac</h2>\n\n\n\n<p>iPhone and iPad apps are acquired through the App Store, so logically, it follows that you use the Mac App Store to get those apps onto your Mac. Keep in mind that a developer may choose not to make their iPhone/iPad app available for M-series Macs, so every app on your iPhone won’t automatically be on your Mac. For example, Pokémon Go is not available for M-series Macs (sorry, trainers).</p>\n\n\n\n<div>\n<div><div><div>At a glance </div></div><ul><li><span>Time to complete: </span><span>  2 minutes</span></li><li>Tools required: App Store</li><li>Materials required: Mac with an M1 or M2 chip</li></ul></div>\n\n\n\n<div>\n<div><span>1.</span>\n<h3>iPhone/iPad apps you own</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/02/mac-app-store-purchased-iphone-apps.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"App Store purchased apps\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n<div>\n<div>\n<ol><li>Launch the App Store app on your Mac. (It’s located in the Applications folder.)</li><li>If you already bought the app for your iPhone or iPad, you can find it if you click on your account in the lower left corner, and then under the <em>Account</em> heading, click on the <em>iPhone &amp; iPad Apps</em> button. </li><li>Find the app you want, and then click on the iCloud download button to download it to your Mac</li></ol>\n</div>\n</div>\n</div>\n\n\n\n<div><span>2.</span>\n<h3>Getting new iPhone/iPad apps</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/02/mac-app-store-iphone-app-search.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"App Store search\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n<div>\n<div>\n<ol><li>Launch the App Store app on your Mac.</li><li>Search for the app or the type of app you want like you normally do. </li><li>After performing the search, look at the taps under the “Results for” heading. The button on the left ,”Mac Apps”, will be selected. Click “iPhone &amp; iPad Apps” next to it.</li><li>The results switch over to iPhone and iPad apps. Find the app you want, and then click the <em>Get</em> or the price button. If you are buying an app, you’ll go through the purchasing process.</li></ol>\n</div>\n</div>\n</div>\n\n\n\n<div><span>3.</span>\n<h3> How to use iPhone/iPad apps on your Mac</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/02/threes-apps-store.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Threes App Store\" loading=\"lazy\" /></figure><p>Apple</p></div>\n\n\n\n<div>\n<div>\n<p>Apps are downloaded to the Mac’s Applications folder and can be launched like any other Mac app. </p>\n\n\n\n<p>Remember though, that these apps were not originally designed for the Mac, so there may be some quirks in the interface or how the app is displayed. In the App Store, the descriptions for each app have labels to tell you what platform the app was designed for. Many apps will also have a label that says, “Not verified for macOS,” which means you may encounter performance or interface issues while using it.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>4.</span>\n<h3>Adjust the interface controls</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/02/touch-alternatives.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Touch Alternatives\" loading=\"lazy\" /></figure><p>Apple</p></div>\n\n\n\n<div>\n<div>\n<p>These apps were made with a touchscreen in mind. Most of the time, you’ll just point and click instead of tap to use the app, but Apple does allow you to adjust the input settings so you can have more control, such as tilt and Multi-Touch.</p>\n\n\n\n<p>In the app, go to the app’s preferences, which is located in the menu bar as [<em>App name</em>] &gt; <em>Preferences</em>. A Touch Alternatives window will open, and you’ll see the keyboard combinations you can use for the input controls used on an iPhone or iPad. Click the <em>On</em> button to activate the <em>Touch Alternatives</em>.</p>\n\n\n\n<p>You’re also about to customize game settings with keyboard and trackpad options in the Game Control tab.</p>\n</div>\n</div>\n</div>\n</div>\n</div>\n\nMac, Mobile Apps</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"62b7a2bd95c2716252b0981349ff75476186ea3cfc9a65c389a9c9a9914d05b8","category":"Apple"}