{"title":"Stop at Nothing","link":"https://markpeak.net/stop-at-nothing/","date":1635999927000,"content":"<p>อ่าน<a href=\"https://medium.com/@IGLevine/so-lots-of-people-have-responded-to-my-encouragement-to-get-into-the-industry-asking-how-do-i-get-e2d0cd738733\">บล็อกของ Ken Levine</a> ผู้กำกับและผู้สร้างเกมตระกูล BioShock แล้วประทับใจมาก</p>\n<p>หลังจากประสบความสำเร็จสูงสุดกับ BioShock Infinite ในปี 2014 เขาก็บอกว่าหมดพลัง กระทบทั้งสุขภาพกายและความสัมพันธ์กับผู้คน การสร้างเกมขนาดใหญ่ที่ใช้คน 150 คนไม่ใช่แนวทางของเขา</p>\n<p>เขาจึงเลือกปิดสตูดิโอ Irrational Games ไปซะอย่างนั้น แล้วไปเปิดสตูดิโอใหม่ที่ขนาดเล็กลงคือ Ghost Story Games ในปี 2017 (ยังอยู่ในสังกัด Take-Two เพราะ Take-Two ง้อ) เพื่อทำเกมเน้นเนื้อเรื่องที่มีขนาดเล็กลง แต่จนมาถึงตอนนี้ยังไม่มีผลงานเกมใหม่ออกมา</p>\n<p>บล็อกของ Levine เขียนในปี 2016 ในช่วงที่ชื่อเสียงโด่งดัง เขาบอกว่ามีคนเข้ามาถามเยอะมากว่า “อยากเข้ามาทำงานในวงการเกม ทำอย่างไรดี”</p>\n<p>เขาเลยเล่าประสบการณ์ส่วนตัวว่า ทำอย่างไรถึงได้มาทำงานในสายงานเกมได้ คำตอบเป็นเรื่องเล่าแบบคลาสสิกที่ว่า “สู้เข้าไปอย่าได้ถอย”</p>\n<p>Stop at nothing</p>\n<p></p>\n<p>ชีวิตของ Levine มาจากสายเขียนบทหนัง เขาเริ่มสนใจเรื่องนี้ในไฮสกูล ทำละครเวทีกับเพื่อน ดังเช่นวัยรุ่นที่มีความฝันคนอื่นๆ เขาพยายามทุกทาง ไปทำงานเป็นช่างไม้ในโรงละคร ตีซี้กับคนเขียนบท เข้าหาสตูดิโอหนัง แต่ก็ไม่สำเร็จเลย</p>\n<p>ความล้มเหลวทำให้เขาท้อแท้ ไปติดผู้หญิง สูบกัญชา หันไปทำอาชีพติดตั้งคอมพิวเตอร์ตามบ้านไปวันๆ เขาพยายามกลับมาทำงานครีเอทีฟใหม่อีกครั้ง ทำบอร์ดเกม แต่ลึกๆ เขารู้ว่าตัวเองยอมแพ้แล้ว</p>\n<blockquote><p>I had thrown in the towel. I was no longer Ken Levine, the guy who would stop at nothing.</p>\n<p>I was Ken Levine the guy who did half-assed IT work.</p></blockquote>\n<p>เขาเป็นแบบนี้อยู่ 7 ปีจนอายุเกือบ 30 ก็ตระหนักว่า ถ้าไม่ลุกขึ้นมาทำอะไรสักอย่าง ความฝันจะไม่มีวันเป็นจริง และจะไม่มีใครมาช่วยให้ความฝันของเขาเป็นจริงด้วย เขาคิดได้ว่าเขาต้องทำเกม</p>\n<p>ตอนนั้นคือปี 1995 ยังไม่มีอินเทอร์เน็ต เขาไม่รู้อะไรเกี่ยวกับการทำเกมเลยสักนิด เลยไปยืนอ่านตามนิตยสารเกมดูว่ามีประกาศรับสมัครงานหรือไม่ สุดท้ายเขาไปได้งานที่บริษัทเกมชื่อ Looking Glass (ปัจจุบันปิดไปแล้ว)</p>\n<p>Levine เล่าว่าเขากลับมาเป็น the guy who would stop at nothing อีกครั้ง เขาเรียนรู้ทุกสิ่ง คุยกับทุกคน เสือกทุกเรื่อง เขาพยายามออกแบบเกม เรื่องราว ไปนำเสนอหัวหน้าทั้งๆ ที่ไม่ได้รับคำสั่ง ฮีโร่ของเขาคือ Doug Church (ผู้กำกับ System Shock ที่เป็นต้นแบบของ BioShock) ซึ่งบางครั้งเขาต้องนั่งรอ Church เข้าออฟฟิศตอน 5 ทุ่ม เพื่อพูดคุยและเรียนรู้จากยอดฝีมือ</p>\n<blockquote><p>Doug taught me the power of failure. Of trying ideas, investing heavily in them for days or weeks or months. And then beings strong enough to say, “Is this the best we can do?” Boom. Smash. Months of work in the trash. Best lesson I ever learned.</p></blockquote>\n<p>เขาเรียนรู้ว่าวิธีทำเกมให้ดีมีเพียงหนึ่งเดียว</p>\n<blockquote><p>To stop at nothing to make something great.</p></blockquote>\n<p>บริษัทเกมที่ดีต้องการเพียงแค่ talent and hard work เท่านั้น แต่เราจะรู้ได้อย่างไรว่าใครคือ talent แต่มี talent อย่างเดียวก็ไม่พออีก เบื้องหลังของเกมในตำนานเต็มไปด้วยหยาดเหงื่อและน้ำตา</p>\n<blockquote><p>Nobody in the history of gaming has ever made something great by osmosis. Behind every Half Life, Minecraft and Uncharted, there are OCEANS of blood, sweat and tears. Ask Gabe, ask Notch, ask Amy.</p></blockquote>\n<p>คำแนะนำของ Levine คือให้สู้ต่อ ก้าวข้ามอุปสรรคทั้งปวง เป็นเรื่องที่รู้ๆ กันอยู่แล้ว แต่วิธีการเขียนของเขาฮึกเหิมมาก</p>\n<blockquote><p>I am the product of every great teacher I’ve ever had. Every person I’ve worked with on every play, movie and game. Of parents who told me the value of hard work.<br />\nBut most of all, I’m the product of failure. Of getting knocked down and standing up again.</p>\n<p>People will stand in your way. If you don’t allow them to stop you, you will FORGET those people. They will become as memorable the guy who sat two rows behind you when you first saw Star Wars.</p>\n<p>You will be rejected. You will be belittled. You will wonder “What the fuck am I doing here?”</p>\n<p>But if you have the talent and the work ethic, you will never be stopped.</p></blockquote>\n<p>หมายเหตุ นอกเหนือจากความฮึกเหิม ตอนท้าย Levine มีคำแนะนำจริงๆ หลายข้อ อันที่คิดว่าน่าสนใจคือ คนทำงานครีเอทีฟจริงๆ จังๆ ต้องฝึกฝนทำงานของตัวเอง สั่งสมมานานแล้วถึงจะมีคนจ้าง</p>\n<blockquote><p>If you’ve never done creative work on your own time, nobody is going to hire you to do creative work for them. Get writing, drawing, coding NOW. I don’t care if you don’t have time. I wrote and put on plays when I had crappy day jobs. If you want to find your way out of that crappy day job, invest in yourself.</p></blockquote>The post <a href=\"https://markpeak.net/stop-at-nothing/\">Stop at Nothing</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"62c1782468de92cbe8a0c70f9fbfb72c7b4ddc84d01f01316544ec950638b26d","category":"Thai"}