{"title":"The seasonal variation and ecological risk of microplastics in the Lower Ganges River, Bangladesh","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11103?af=R","date":1723964400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1556c721-c2e6-4aa1-aed2-050019f87be9/wer11103-toc-0001-m.png\" alt=\"The seasonal variation and ecological risk of microplastics in the Lower Ganges River, Bangladesh\" />\n<p>Microplastic (MP) pollution was observed throughout the year in the lower Ganges River water, with the highest and lowest abundance recorded during the monsoon and post-monsoon seasons, respectively. The study revealed a correlation between MP abundance and discharge and rainfall in the river water.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Microplastic (MP) pollution has gained considerable attention in various ecosystems; however, it has received relatively less attention in freshwater-riverine environments than in other ecosystems. The Ganges River Delta, one of the world's most densely populated areas, is a potential source of MP pollution in the freshwater ecosystem. MPs were identified throughout the year in the lower Ganges River water. Seasonally, the highest abundance was observed during the monsoon (14.66 ± 2.06 MPs/L), followed by the pre-monsoon (13.46 ± 1.75 MPs/L) and post-monsoon (11.50 ± 0.40 MPs/L). Throughout the year, MP discharge was estimated at 4.12 × 10<sup>12</sup> to 2.17 × 10<sup>13</sup> MPs/year. Fourier transformed infrared spectroscopy identified plastic polymers in the water, like ethylene vinyl acetate, polystyrene, polypropylene, polyethylene, and nylon. Moderate contamination by MPs was assessed throughout the year. Significant correlations between MP abundance and both rainfall and discharge were observed. It is essential to implement preventative measures in the Ganges River Basin to mitigate MP pollution before the situation worsens.</p>\n<h2>Practitioner Points</h2>\n<p>\nThroughout the year, MP concentration ranged from 10.67 to 20.33 MPs/L\nThe highest MP occurrence was observed in the monsoon season (14.66 ± 2.06 MPs/L)\nThe lowest abundance was detected in the post-monsoon period (11.50 ± 0.40 MPs/L)\nThere was a moderate level of MP contamination in the lower Ganges River water\nIt was shown that discharge and rainfall were correlated with MP abundance\n</p>","author":"Md. Anamul Hassan, \nMabia Hossain Shetu, \nOsman Miah, \nFahmida Parvin, \nMashura Shammi, \nShafi M. Tareq","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"62c5566d1887c53598de6c22bae69e2d39085fbe6638d79fe2f00fd6ff73df5d","category":"Environment"}