{"title":"Philippa York mural unveiled in East Dunbartonshire","link":"https://www.cyclist.co.uk/news/9743/philippa-york-mural-unveiled-in-east-dunbartonshire","date":1623749494000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>15 Jun 2021</span></div>    </div></div><p>\nTribute funded by East Dunbartonshire Council depicts an image of York, originally by Graham Watson, in the polka dot jersey she won in 1984</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/06/philippa_york_mural.jpg?itok=utDb3t5I\" />  </div>\n<div>\n      <p> A tribute to Scottish cycling legend Philippa York has been unveiled in East Dunbartonshire.</p>\n<p>The mural, recreating an image taken by Graham Watson showing York – then Robert Millar – in the polka dot jersey she won in 1984, has been funded by East Dunbartonshire Council to recognise York's achievements and inspirational story.</p>\n<p>Painted by Scottish artist Rogue Oner on the side of a building owned by Campsie Golf Club at the foot of the Crow Road in Lennoxtown, it will act as a gateway to the Campsie Fells, where York would train in her heyday.</p>\n<p>The idea for the mural came from Drew Wilson, a former pro cyclist who represented Scotland at three Commonwealth Games and now owns VisualBikeFit, and was supported through the process by councillor Stewart MacDonald and ward councillor Gary Pews.</p>\n<p>York, now a journalist, said, 'I love it. It's a really striking piece of work and full credit to Rogue Oner for capturing the essence of the moment.</p>\n<p>'When I wanted an extra hard finish to a training ride then I'd include a visit to the Campsies and a climb of the Crow Road before heading back into Glasgow, so for the mural to be placed at the foot of the climb is rather fitting.</p>\n<p>'I think, or at least hope, people will see it as inspirational. Cycling can be for pleasure, fitness, travel or sporting competition, but the important message is that it is accessible to everyone.</p>\n<p>'I started cycling because I wanted to get out of the city and see things. I didn't intend to be a racer. You can enjoy cycling and go whatever speed you want to go. For me it was a way to see outside of where I was, then I ended up racing... and history was made.'</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/cyclistjunior\">Win a Specialized Jett kid's bike with Cyclist Junior</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 115: on sale now!</a></div>    </div></div><p>\nYork's records, winning the King of the Mountains and finishing fourth at the 1984 <a href=\"/tags/tour-de-france\">Tour de France</a> as well as winning the same classification alongside a second place finish at the 1987 <a href=\"/tags/giro-ditalia\">Giro d'Italia</a> both stood as the best place British finishes at Grand Tours until 2011.</p>\n<p>She was the first British rider to win a major Tour classification.</p>\n<p>Councillor Vaughan Moody, joint leader of the council, said, 'We're delighted to officially unveil this stunning tribute to a genuine sporting legend. Philippa is an inspiration and this mural will help to encourage people of all ages to follow their own paths to success and happiness.' </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"62cab81b4f94741c3b1845e8bb966bc317be0ac8beee243d70ca82a87f9ae04e","category":"Cycling"}