{"title":"Sciadonic acid ameliorates cyclophosphamide‐induced immunosuppression by modulating the immune response and altering the gut microbiota","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13271?af=R","date":1712732400000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Cyclophosphamide (Cy) is a frequently used chemotherapeutic drug, but long-term Cy treatment can cause immunosuppression and intestinal mucosal damage. The intestinal mucosal barrier and gut flora play important roles in regulating host metabolism, maintaining physiological functions and protecting immune homeostasis. Dysbiosis of the intestinal flora affects the development of the intestinal microenvironment, as well as the development of various external systemic diseases and metabolic syndrome.</p>\n<h2>RESULTS</h2>\n<p>The present study investigated the influence of sciadonic acid (SA) on Cy-induced immunosuppression in mice. The results showed that SA gavage significantly alleviated Cy-induced immune damage by improving the immune system organ index, immune response and oxidative stress. Moreover, SA restored intestinal morphology, improved villus integrity and activated the nuclear factor κB signaling pathway, stimulated cytokine production, and reduced serum lipopolysaccharide (LPS) levels. Furthermore, gut microbiota analysis indicated that SA increased t beneficial bacteria (<i>Alistipes</i>, <i>Lachnospiraceae_NK4A136_group</i>, <i>Rikenella</i> and <i>Odoribacter</i>) and decreased pathogenic bacteria (<i>norank-f-Oscillospiraceae</i>, <i>Ruminococcus</i> and <i>Desulfovibrio</i>) to maintain intestinal homeostasis.</p>\n<h2>CONCLUSION</h2>\n<p>The present study provided new insights into the SA regulation of intestinal flora to enhance immune responses. © 2024 Society of Chemical Industry.</p>","author":"Lin Chen, \nQihong Jiang, \nShiwei Yao, \nChenkai Jiang, \nHongling Lu, \nWenjun Hu, \nShaofang Yu, \nMingqian Li, \nYongcai Feng, \nChin Ping Tan, \nXingwei Xiang, \nGuoxin Shen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"62ca86402b3cd8ada19173b0bd6a2d64acf8ad1ccddf2a0413ea7c75f34d21c5","category":"Environment"}