{"title":"Rurality and patients’ hospital experience: A multisite analysis from a US healthcare system","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308564","date":1723125600000,"content":"<p>by Iman Fawad, Karen M. Fischer, Hanieh Sadat Tabatabaei Yeganeh, Kristine T. Hanson, Laurie L. Wilshusen, Yousif M. Hydoub, Trevor J. Coons, Tafi L. Vista, Michael J. Maniaci, Elizabeth B. Habermann, Sagar B. Dugani</p>\r\nBackground <p>The association between rurality of patients’ residence and hospital experience is incompletely described. The objective of the study was to compare hospital experience by rurality of patients’ residence.</p> Methods <p>From a US Midwest institution’s 17 hospitals, we included 56,685 patients who returned a post-hospital Hospital Consumer Assessment of Healthcare Providers and Systems (HCAHPS) survey. We defined rurality using rural-urban commuting area codes (metropolitan, micropolitan, small town, rural). We evaluated the association of patient characteristics with top-box score (favorable response) for 10 HCAHPS items (six composite, two individual, two global). We obtained adjusted odds ratios (aOR [95% CI]) from logistic regression models including patient characteristics. We used key driver analysis to identify associations between HCAHPS items and global rating (combined <i>overall rating of hospital</i> and <i>recommend hospital</i>).</p> Results <p>Of all items, <i>overall rating of hospital</i> had lower odds of favorable response for patients from metropolitan (0.88 [0.81–0.94]), micropolitan (0.86 [0.79–0.94]), and small towns (0.90 [0.82–0.98]) compared with rural areas (global test, <i>P</i> = .003). For five items, lower odds of favorable response was observed for select areas compared with rural; for example, <i>recommend hospital</i> for patients from micropolitan (0.88 [0.81–0.97]) but not metropolitan (0.97 [0.89–1.05]) or small towns (0.93 [0.85–1.02]). For four items, rurality showed no association. In metropolitan, micropolitan, and small towns, men vs. women had higher odds of favorable response to most items, whereas in rural areas, sex-based differences were largely absent. Key driver analysis identified <i>care transition</i>, <i>communication about medicines</i> and <i>environment</i> as drivers of global rating, independent of rurality.</p> Conclusions <p>Rural patients reported similar or modestly more favorable hospital experience. Determinants of favorable experience across rurality categories may inform system-wide and targeted improvement.</p>","author":"Iman Fawad","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"62ce8336fec2d2e246d0a8f22d2545da43e5f6e4edab77b467e483e6edca7662","category":"Interdisciplinary"}