{"title":"WWDC 2021: June 7–11, Entirely Online Again","link":"https://www.apple.com/newsroom/2021/03/apples-worldwide-developers-conference-is-back-in-its-all-online-format/","date":1617134789000,"content":"\n<p>Apple Newsroom:</p>\n\n<blockquote>\n  <p>Apple today announced it will host its annual Worldwide Developers\nConference (WWDC) June 7 through 11, in an all-online format. Free\nfor all developers, WWDC21 will offer unique insight into the\nfuture of iOS, iPadOS, macOS, watchOS, and tvOS. […] Apple also\nannounced that this year’s <a href=\"https://developer.apple.com/wwdc21/swift-student-challenge/\">Swift Student Challenge</a>, an\nopportunity for young developers to demonstrate their coding\nskills by creating a Swift playground, is now accepting\nsubmissions.</p>\n</blockquote>\n\n<p>No surprise that WWDC will be entirely online again this year. There’s simply no way the COVID situation will be at “safe for in-person conferences” levels by June. The big question is whether they plan on going back to a live event <em>next</em> year.</p>\n\n<p>The invitation artwork consists of a diverse bunch of Memoji characters, peeking at a MacBook display as the hinge opens. (One of them is wearing a hearing aid.) It’s a clear callback to the Craig Federighi hero shot in the M1 announcement event <a href=\"https://9to5mac.com/2021/03/30/apple-references-craig-federighi-meme-for-wwdc-2021-artwork-but-with-a-twist/\">that launched a thousand memes</a>. But the other thing: <a href=\"https://twitter.com/deirdresm/status/1376948785134268417\">every single one of the Memoji characters is wearing glasses</a>, with the contents of the MacBook screen reflected in them. Does this mean Apple’s glasses product is getting announced at WWDC? I’d say that’s possible, but wouldn’t read too much into it. I think it’s more likely that the reflection in the glasses is just part of the art direction for the image. But it’s also not credible to think that Apple didn’t know people will read into this — at the very least it’s a deliberate tease. (Glasses could be the sort of thing Apple pre-announces half a year in advance of shipping, like the iPhone and Apple Watch, because they don’t have to worry about cannibalizing the sales of an existing product they sell. And they might want to get developers working on AR apps for the device. Not saying that’s likely, just saying it’s possible, especially if they want to have AR apps ready on day one.)</p>\n\n<blockquote>\n  <p>“We love bringing our developers together each year at WWDC to\nlearn about our latest technologies and to connect them with Apple\nengineers,” said Susan Prescott, Apple’s vice president of\nWorldwide Developer Relations and Enterprise and Education\nMarketing.</p>\n</blockquote>\n\n<p>That second-paragraph executive quote <a href=\"https://www.apple.com/newsroom/2020/03/apples-wwdc-2020-kicks-off-in-june-with-an-all-new-online-format/\">previously went to Phil Schiller</a>. Prescott first appeared on stage (I believe) <a href=\"https://daringfireball.net/2016/09/thoughts_and_observation_iphone_7_event\">at an event in 2016</a>, when she was running product marketing for the iWork apps, and has been on stage a few times since. Her promotion to VP of worldwide developer relations follows <a href=\"https://www.bloombergquint.com/business/apple-s-longtime-app-store-developer-relations-chief-retires\">the retirement of Ron Okamoto</a>. Okamoto had been in that position since 2001, and though he never had a high public profile — I don’t recall him ever appearing on stage (or on screen) — he was incredibly influential. The scope of Apple’s “worldwide developer relations” expanded quite a bit, to say the least, from 2001 to 2020.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/03/30/wwdc-2021\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"62d0eb6c0f2ee5c5346cec9f5c98878f6cd48b048628026e9170eb7556e03d21","category":"Tech"}