{"title":"The evolution of positive allometry and exaggerated traits in a diverse beetle clade","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14532?af=R","date":1715144986000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/daec20e9-b734-4a52-901c-dd270f15c53a/fec14532-toc-0001-m.png\" alt=\"The evolution of positive allometry and exaggerated traits in a diverse beetle clade\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/08/the-evolution-of-positive-allometry-and-exaggerated-traits-in-a-diverse-beetle-clade/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nUnderstanding variation in trait allometry and the drivers of variation in sexually selected traits is a major theme in evolutionary biology. The static allometries of sexually selected traits are often positive due to disproportional investment by large individuals into trait size. Comparative studies of weapon allometry are rare, and typically focus on variation along a single dimension (e.g. length), despite weapons often diverging dramatically in shape. Furthermore, studies predominantly focus on groups where weapons have evolved as novel structures (e.g. horns), despite most weapons arising from modifications of existing structures.\n\nWe test the hypothesis that sexual selection drives variation in static allometry using a phylogenetic comparative approach with 59 brentine weevil species showing remarkable variation in trait exaggeration and sexual size dimorphism (SSD).\n\nContrasting two dimensions of head size exaggeration (a sexually selected trait) and elytron length (a nonsexual trait), positive static allometry was common across both measures of male head size, but not females, and there was positive covariance between male head static allometry and SSD across species. Positive static allometry for male elytron length was less common, but did show positive covariance with SSD, possibly due to the function of wings as compensatory structures for bearing large weapons.\n\nOur findings support the hypothesis that sexual selection drives the evolution of allometries both within and among species, and that the modification of existing structures to be used as weapons does not limit the potential for positive static allometry.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/08/the-evolution-of-positive-allometry-and-exaggerated-traits-in-a-diverse-beetle-clade/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Christina J. Painting, \nMatthew R. E. Symonds, \nGregory I. Holwell","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"62d294a7b2ca1cd7bb18b89c8da9228880296e132794d181d536d15744551aca","category":"Environment"}