{"title":"Antibacterial and gut health effects of Amomum tsao‐ko in aquatic feed: A sustainable alternative to chemical antibiotics","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15809?af=R","date":1717053643000,"content":"<h2>Abstract</h2>\n<p><i>Amomum tsao-ko</i> Crevost et Lemarie (Zingiberaceae), an aromatic plant, has been considered to have diverse medicinal values and economic significance. It has been reported to possess antibacterial, antioxidant, and antidiabetic effects. With the increasing risk of diseases in aquaculture, there is a need for alternative solutions to chemical antibiotics. Plant extracts have shown promise as natural feed additives for aquatic animals. In this study, the antibacterial effect of <i>Amomum tsao-ko</i> crude extracts was evaluated using the Oxford cup method. The extracts exhibited significant antimicrobial activity against <i>Salmonella typhimurium</i> and <i>Salmonella enteritidis</i>. Furthermore, the addition of <i>Amomum tsao-ko</i> to fish feed resulted in notable changes in the gut structure of zebrafish and tilapia. The length and morphology of intestinal villi were enhanced, promoting improved digestion. Analysis of the gut microbial community revealed that <i>Amomum tsao-ko</i> supplementation induced key changes in the gut microbial community composition of both zebrafish and tilapia. Notably, a 1% inclusion of <i>Amomum tsao-ko</i> resulted in a marked rise in Proteobacteria levels in zebrafish, which diminished at 10% dosage. The supplement elicited mixed reactions among other bacterial phyla like Actinobacteria and Verrucomicrobiota. Fluctuations were also observed at the genus level, pointing to the concentration of <i>Amomum tsao-ko</i> playing a pivotal role in influencing the structure of intestinal bacteria. The findings of this study suggest that <i>Amomum tsao-ko</i> has antibacterial properties and can positively influence the gut health of fish. The potential use of <i>Amomum tsao-ko</i> as a natural feed additive holds promise for improving aquaculture practices and reducing reliance on chemical antibiotics. Further research is needed to explore the full potential and applications of <i>Amomum tsao-ko</i> in fish feed development.</p>","author":"Weiyao Peng, \nGuohui Liao, \nLianzhang Wu, \nJian Zhang, \nJuncai He, \nPenghui Gao, \nYunsheng Cha, \nShengjun You, \nMei Huang, \nJilan Zhou, \nYuqiu He, \nYi Yang, \nPing Li, \nJian Yan","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"62e08e080e93372be8f7619d20a71d30f14091ecca1c772dc6450acb3583dca5","category":"Environment"}