{"title":"Viral load non-suppression status among women exposed to Dolutegravir-based versus Efavirenz-based regimens in Ethiopia: A before-and-after study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305331","date":1718028000000,"content":"<p>by Wolde Facha, Takele Tadesse, Eskinder Wolka, Ayalew Astatkie</p>\r\nBackground <p>High viral load during pregnancy and breastfeeding period is the risk factor for vertical transmission of human immunodeficiency virus (HIV). Currently, Dolutegravir (DTG)-based regimens are recommended to attain adequate viral load suppression (VLS) among women. However, its effect on VLS has not been investigated among women in PMTCT care in Ethiopia.</p> Objective <p>This study aimed to investigate the rate of viral load non-suppression among women exposed to DTG-based versus Efavirenz (EFV)-based regimens in Ethiopia.</p> Methods <p>An uncontrolled before-and-after study design was conducted among 924 women (462 on EFV-based and 462 on DTG-based regimens) enrolled in PMTCT care from September 2015 to February 2023. The outcome variable was the viral load (VL) non-suppression among women on PMTCT care. A modified Poisson regression model was employed, and the proportion was computed to compare the rate of VL non-suppression in both groups. The risk ratio (RR) with a 95% confidence interval (CI) was calculated to assess viral load non-suppression among women on DTG-based and EFV-based regimens by adjusting for other variables.</p> Results <p>The overall rate of non-suppressed VL was 16.2% (95% CI: 14.0–18.8%). Mothers on DTG-based regimens had approximately a 30% (adjusted risk ratio (aRR): 0.70; 95% CI: 0.52–0.94) lesser risk of developing non-suppressed VL than women on EFV-based regimens. Besides, older women were 1.38 times (aRR: 1.38; 95% CI: 1.04–1.83); mothers who did not disclose their HIV status to their partners were 2.54 times (aRR: 2.54; 95% CI: 1.91–3.38); and mothers who had poor or fair adherence to antiretroviral (ARV) drugs were 2.11 times (aRR: 2.11; 95% CI: 1.45–3.07) at higher risk of non-suppressed VL.</p> Conclusion <p>Women on DTG-based regimens had a significantly suppressed VL compared to those on EFV-based regimens. Thus, administering DTG-based first-line ART regimens should be strengthened to achieve global and national targets on VLS.</p>","author":"Wolde Facha","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"62e321e5d21a20a57db55423c0973a2a8ba77e788f2c0a9216762cce113c65a6","category":"Interdisciplinary"}