{"title":"Preview: What you need to know about stage 7 of the Vuelta a España","link":"https://cyclingtips.com/2021/08/preview-what-you-need-to-know-about-stage-7-of-the-vuelta-a-espana/","date":1629389573000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2021-vuelta-profile-stage7-650x332.jpeg\" /></div><h2>Preview: What you need to know about stage 7 of the Vuelta a España</h2><p>\n</p><p><strong>Date: </strong>Friday August 20<br /><strong>Start: </strong>Gandia<br /><strong>Finish: </strong>Balcon de Alicante<br /><strong>Distance: </strong>152 km</p>\n\n\n\n<p>The Vuelta’s technical director Fernando Escartín describes this as the race’s “first true mountain stage”. In all there are six categorised climbs: two Cat 3s, two Cat 2s, and two Cat 1s. It’s a tough day in Valencia that starts with almost 10 km of climbing and ends with 8.4 km at 6.2%.</p>\n\n\n\n<p>The final ascent isn’t huge, but it should have some GC implications. The stage itself, however, is likely to go to the break. It’s hard to see any of the GC teams taking full control of the day on this profile.</p>\n\n\n\n<p><strong>Who’s it for: </strong>Probably breakaway riders. Expect a break to form on the early climb and to go the distance.</p>\n\n\n\n<p><strong>Dane Cash’s picks: </strong><em>This early in the race, there haven’t been all that many top climbers who have dropped out of GC contention yet, so there aren’t any obvious ace ascenders who are likely to try to get into the break. For me, Ion Izagirre and his brother Gorka are two great picks to win from the early move. So is Joe Dombrowski, who came close on stage 2 behind Rein Taaramäe, another contender. Maximilian Schachmann, who dropped relatively early on stage 6, could try his luck on stage 7, and so could Damiano Caruso. If the stage comes down to the GC riders, it’s hard to look past Primož Roglič, but the entire Movistar trio of Alejandro Valverde, Enric Mas, and Miguel Ángel López has been in the mix on both of the tough climbing stages so far in this Vuelta.</em></p>\n\n\n\n<figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/2021-vuelta-profile-stage7.jpeg\" /></figure>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/stage7.jpeg\" /></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/08/preview-what-you-need-to-know-about-stage-7-of-the-vuelta-a-espana/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"62e5034622c070cde9491b33999cc1461080b1574e824054935b9303423a290e","category":"Cycling"}