{"title":"Foxconn to Lose Top-Tier iPhone Assembly Allocation for First Time","link":"https://www.macrumors.com/2023/05/18/foxconn-loses-top-tier-iphone-assembly/","date":1684408780000,"content":"In a blow to Foxconn, Apple is expected to hand key iPhone 16 production responsibilities to Luxshare, significantly boosting the supply chain partner's profit growth over the next two years, according to Apple analyst Ming-Chi Kuo.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/iPhone-16-Mock-Header-1.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nIn his latest <a href=\"https://medium.com/@mingchikuo/立訊精密可望在未來數年受益於印度設廠與iphone事業利潤顯著提升-luxshare-expects-to-benefit-from-the-establishment-of-a-factory-89e382a980eb\">Medium blog post</a>, Kuo said Apple has already given Luxshare new product introduction (NPI) approval for next year's iPhone 16 Pro Max, which is a significant win for the supplier, given that Foxconn has consistently won the highest-end iPhone assembly NPI in previous years.\r<br />\n\r<br />\nThe approval followed Apple's decision to transfer some iPhone 14 Pro Max orders from Foxconn to Luxshare to diversify supply and mitigate risk, following the <a href=\"https://www.macrumors.com/2022/11/23/violent-protests-iphone-factory-china/\">protests and riots</a> that broke out in Foxconn's largest iPhone factory in Zhengzhou, China, in November 2022.\r<br />\n\r<br />\nLuxshare's production yield improvement schedule for the iPhone 14 Pro Max subsequently proved better than expected, leading Apple to award NPI to the company for the 2024 model. That means Apple believes Luxshare's R&amp;D and production capabilities have reached the level of a first-tier supplier, according to Kuo.\r<br />\n\r<br />\nThe analyst believes that Apple will now negotiate with the Indian government to help Luxshare set up production lines in India, with the possibility of floating the idea of a joint venture to offset concerns from investors about the geopolitical situation being unfavorable for the assembler.\r<br />\n\r<br />\nLuxshare's iPhone business should see significant profit growth, says Kuo, with the company expected to ship 45–50 million iPhones in 2023, up from approximately 20 million in 2022, indicating Apple's increasing faith in and reliance on the assembler.\r<br />\n\r<br />\nApple wants to triple its iPhone production capacity in India within the next two years, as part of a larger plan to diversify its supply chain out of China and into other parts of the world. According to <a href=\"https://www.livemint.com/companies/news/apple-looks-to-triple-iphone-production-in-india-by-2025-11670774507686.html\">one report</a>, Apple has instructed Foxconn, Pegatron, and Wistron, three of its biggest suppliers, to increase their capacity and manpower in the country.\r<br />\n\r<br />\nAs things stand, production allocation for next year's iPhone 16 series is allocated to Luxshare (iPhone 16 Pro Max), Foxconn (iPhone 16 and iPhone 16 Pro), and Pegatron (iPhone 16 Plus).<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/foxconn/\">Foxconn</a>, <a href=\"https://www.macrumors.com/guide/india/\">India</a>, <a href=\"https://www.macrumors.com/guide/luxshare/\">Luxshare</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/18/foxconn-loses-top-tier-iphone-assembly/\">Foxconn to Lose Top-Tier iPhone Assembly Allocation for First Time</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/foxconn-to-lose-top-tier-iphone-assembly-allocation-for-first-time.2389863/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"62e69a192ce35f8d5fc6589ab4ac9a60cc69aafecb23fc0634981af315a166e0","category":"Apple"}