{"title":"Geospatial and Temporal Patterns of Natural and Man-made (Technological) Disasters (1900-2024): Insights from Different Perspectives","link":"https://www.preprints.org/manuscript/202408.0175/v1","date":1722828038000,"content":"This pioneering study explores the geospatial and temporal patterns of natural and human-induced disasters from 1900 to 2024, providing essential insights into their global distribution and impacts. Utilizing the comprehensive international EM-DAT database, our analysis reveals significant trends and disparities in disaster occurrences and their widespread consequences. Results showed a dramatic escalation in both natural and man-made (technological) disasters over the decades, with notable surges in the 1991-2000 and 2001-2010 periods. A total of 25,836 disasters were recorded worldwide, of which 69.41% were natural disasters (16,567) and 30.59% were man-made (technological) disasters (9,269). The most significant increase in natural disasters occurred from 1961-1970, while man-made (technological) disasters surged substantially from 1981-1990. Seasonal trends reveal that floods peak in January and July, while storms are most frequent in June and October. Droughts and floods are the most devastating in terms of human lives, while storms and earthquakes cause the highest economic losses. The most substantial economic losses were reported during the 2001-2010 period, driven by catastrophic natural disasters in Asia and North America. Our research highlights Asia as the most disaster-prone continent, accounting for 41.75% of global events, with natural disasters making up 61.89% of these events. Oceania, despite experiencing fewer total disasters, shows a remarkable 91.51% of these as natural disasters. Africa is notable for its high incidence of man-made (technological) disasters, which constitute 43.79% of the continent's disaster events. Europe, representing 11.96% of total disasters, exhibits a balanced distribution but tends towards natural disasters at 64.54%. Examining specific countries, China, India, and the United States emerged as the most frequently affected by both natural and man-made (technological) disasters. The impact of these disasters has been immense, with economic losses reaching their highest during the decade of 2010-2020, largely due to natural disasters. The human toll has been equally significant, with Asia recording the most fatalities and Africa the most injuries. Particularly, the decade from 2001 to 2010 experienced the greatest economic losses, primarily driven by natural disasters in Asia and North America. These insights highlight the urgent need for tailored disaster risk management strategies that address the distinct challenges and impacts in various regions. By understanding historical disaster patterns, policymakers and stakeholders can better anticipate and manage future risks, ultimately safeguarding lives and economies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"62ecc25a9489cbe016e380e0e63d478aa963daf89887993f79dab4d105f4f2bc","category":"Interdisciplinary"}