{"title":"A once-quiet battle to replace the space station suddenly is red hot","link":"https://arstechnica.com/?p=1807353","date":1635417954000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/zarya1-800x501.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/zarya1.jpg\">Enlarge</a> <span>/</span> Backdropped against clouds, the Russian <em>Zarya</em> module approaches Space Shuttle <em>Endeavour</em> and NASA's <em>Unity</em> module in 1998. (credit: <a href=\"https://www.nasa.gov/\">NASA</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The sprawling International Space Station—so long a beacon of hope, unity, and technological achievement; so gleaming and bright it can be seen from a city's downtown as it passes overhead—is nearer the end of its life than the beginning. And time is running out to replace the station before it's gone.</p>\n<p>Its first component, the Russian-built <em>Zarya</em> power and propulsion module, was launched in 1998. The other core pieces of the station were all sent spaceward by 2001. The backbone of the International Space Station, therefore, has spent two decades in space—a harsh environment of wild temperature swings, micrometeoroid impacts, torsional strains, and more.</p>\n<p>In recent years, signs of aging have become more apparent, particularly with cracks spreading across the <em>Zvezda</em> module. And more than the hardware is coming apart. The political forces that drove the formation of the space station partnership, principally the desire of the United States and Russia to work together after the Soviet breakup, have given way to a zealous anti-Americanism in Moscow and suspicions in Washington, DC. The partnership remains intact for now, thanks to healthy working relationships among astronauts, cosmonauts, and engineers. But politically, <a href=\"https://arstechnica.com/science/2021/08/russias-space-program-just-threw-a-nasa-astronaut-under-the-bus/\">the rhetoric is at times toxic</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1807353#p3\">Read 45 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1807353&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"62f1998cef8956f61ddb898e8d936dac8f4cf62bd44d24d6125cce557ff90185","category":"Tech"}