{"title":"What is the environmental impact of your bike rides?","link":"https://www.cyclist.co.uk/in-depth/9917/what-is-the-environmental-impact-of-your-bike-rides","date":1627032517000,"content":"<span>\n      <span><a href=\"/authors/trevor-ward\">Trevor Ward</a></span>\n  </span><div>  \n  <div>      <div><span>23 Jul 2021</span></div>    </div></div><p>\nFrom what you eat to how much you fly, everything to do with cycling has a carbon footprint. But there are ways to reduce yours</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/02/cyclist_bigride_iow_extra_2.jpg?itok=zwORoot5\" />  </div>\n<div>\n      <p> The recent images of wildfires in the US and Siberia, deadly deluges in Europe and Chinese train commuters up to their shoulders in floodwater, have reopened the debate about global warming just months before a United Nations Climate Change Conference (COP26) takes place in Glasgow.</p>\n<p>As cyclists, it’s easy for us to lean back smugly and think that we are doing our bit to reduce carbon emissions and protect the planet. In reality, however, it’s not that simple.</p>\n<p>For example, if you own a high-end bike with all the latest components, consume gels and train indoors, your impact on the environment is probably greater than you think. Subtle details such as how you fuel up to whether you shower after your ride will also determine how eco-friendly your cycling is.</p>\n<p>Every activity or object leaves a carbon footprint on the environment. The size of that footprint is determined by the amount of climate-warming greenhouse gases – chief of which is Co2, or carbon dioxide – emitted by that activity or in the sourcing, production, transportation and packaging of that particular object.</p>\n<p>Picking an apple from a tree for your mid-ride snack is far less damaging for the planet than eating a punnet of blueberries flown in from Chile, for example.</p>\n<p>Professional rider Mike Woods recently recognised the contradictions of his sport by pledging to make his 2021 season carbon-neutral.</p>\n<p>'Cycling is an amazing way to get around, explore, keep fit and has very little direct impact on the environment,' said the <a href=\"/tags/israel-start-up-nation\">Israel Start-Up Nation</a> rider.</p>\n<p>'But as a professional cyclist, it’s another story. I fly to races regularly and have a convoy of cars and trucks following my every move. I sit on a massive bus at the end of each stage, and go through countless plastic bottles and packaged goods. I consume vast volumes of food, including large quantities of meat, and go through far more clothing than the average person.'</p>\n<p>We spoke to a number of experts, ranging from best-selling authors to environmental advocates – all of them bike riders – about how cyclists can reduce their carbon footprint even more.</p>\n<h3>What you eat</h3>\n<p>'All that energy on a bike has to come from the food you eat and that in turn has a carbon footprint,' says Mike Berners-Lee, university professor and climate consultant, in his book, <em><a href=\"https://www.waterstones.com/book/how-bad-are-bananas/mike-berners-lee/9781788163811\">How Bad Are Bananas? The Carbon Footprint of Everything</a>.</em></p>\n<p><em></em>'Bananas, of course, are brilliant, but cycling along using calories from cheeseburgers is equivalent to driving the same distance in a [fuel] efficient car.'</p>\n<p>The Co2 emissions associated with a 4oz cheeseburger during its journey from farm to table add up to a whopping 3.2kg compared to 110g for a banana, according to Berners-Lee (who, incidentally, is the brother of Tim, inventor of the World Wide Web).</p>\n<p>The good news is that a home-baked cake at the café stop is probably better for the planet than energy bars and gels.</p>\n<p>'These are mostly just sugar wrapped in expensive plastic that goes to landfill or ends up on the roadside, and for the average cyclist are completely pointless,' says Mike Hayes, a road racer-turned-long distance bikepacker and sustainable lifestyle advocate who chronicles his adventures at <a href=\"https://www.seasurfdirt.com/\" target=\"_blank\">seasurfdirt.com</a>.</p>\n<p>'Instead, you should go to your local bulk foods shop, buy a load of oats, dried fruits and other things, and make your own. There are loads of recipes online.'</p>\n<p>And if you’re a fan of porridge and it’s slow-releasing energy benefits, you’ll lessen your carbon footprint significantly by cooking it the traditional Scottish way – using water instead of dairy milk.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2019/10/big-ride-romania-04.jpg?itok=vVmVAH1T\" />  </div>\n</div>\n<h3>What you drink</h3>\n<p>If you are part of the modern tribe of cycling coffee connoisseurs, consider switching to compostable pods for your Nespresso machine.</p>\n<p>Whether drinking tea or coffee, it’s the cow’s milk that has the biggest environmental impact – the raising of farm animals is carbon-intensive, plus cows produce methane, another damaging greenhouse gas – so consider switching to oat or soya milk, or taking it black.</p>\n<p>Fill your bidons with tap water, whose carbon footprint is 1,000 times smaller than that of bottled water, says Berners-Lee.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/9845/nic-dlamini-the-hero-cycling-needs\">Nic Dlamini: the hero cycling needs</a></div>      <div><a href=\"/news/7538/watch-south-african-pro-nic-dlaminis-arm-broken-in-clash-with-park-rangers-during-training\">Watch: South African pro Nic Dlamini's arm broken in clash with park rangers during training ride</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 116: on sale now!</a></div>      <div><a href=\"/news/2104/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\">Vuelta a Espana 2021: Route, start list, live TV guide and all we know so far</a></div>    </div></div><h3>What you wear</h3>\n<p>Merino baselayers or jerseys don’t have to be washed as often. 'Everyone should be aware, by now, of the payload of plastic released into the environment when washing synthetic clothes,' says Hayes.</p>\n<p>When you do fill your washing machine, reducing the temperature from 60C to 30C will almost halve your carbon footprint (and still get your kit clean). That footprint can be made even smaller by using a washing line or indoor clothes rack rather than tumble dryer to dry your kit.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2017/12/steel_bikes_cinelli_nemo_tig_01.jpg?itok=1j2gMZNd\" />  </div>\n</div>\n<h3>What you ride</h3>\n<p>Does your new bike have to be a carbon frame? 'Carbon is extremely energy intensive to produce, about 15 times more so than steel,' says Hayes.</p>\n<p>When green activist and author Kate Rawles rode the length of South America to highlight man’s threat to biodiversity, she did it on a bamboo bicycle called Woody.</p>\n<p>'It’s not just sustainable material for a bike frame, it’s a plant, i.e. entirely renewable and biodegradable, and a very fast growing one which absorbs a lot of Co2 from the atmosphere – more than the average tree, in fact,' she says.</p>\n<p>Then there’s the components. Do you really need an electronic groupset? You may be pleased with the marginal gains, but you are contributing to supply chains that are damaging the planet.</p>\n<p>'Mining lithium for batteries is environmentally destructive and energy intensive, while the manufacture of electronics requires energy, toxic chemicals, heavy metals and so on,' says Hayes.</p>\n<h3>Sweat is good</h3>\n<p>'Sweat being a negative thing is a western construct designed to sell shampoos and cosmetics,' says Hayes. 'Heating water is about the most energy intensive thing you can do in the home. It’s not necessary to shower after every ride. Sometimes a basin of cold water and flannel will do.'</p>\n<p>When you do shower, keep it short. 'Shorter showers can save 350kg of Co2 emissions a year – as much as a return flight from London to Milan,' says Berners-Lee.</p>\n<h3>Ride don’t drive</h3>\n<p>It requires planning and commitment, but it’s possible to ditch the car for basic utilitarian purposes. Berners-Lee says <a href=\"/buying-guides/4528/best-folding-bikes-travel-smarter\">buying a folding bike so he could commute by train</a> was 'one of the best decisions I ever made'. He estimates that a congested, 16km commute by car creates 16kg of carbon emissions.</p>\n<p>'It’s a useful reminder that motorists should treat cyclists with the respect they deserve for helping to cut everybody else’s emissions and wasted time,' he says. (Assuming they haven’t fuelled up with a cheeseburger or bowl of Chilean blueberries, that is….)</p>\n<p>Driving to the start of a ride seems a contradiction in terms. Jon Owen, cycling club member and chairman of Kendal Town Council’s environmental committee, says we should take inspiration from history.</p>\n<p>'It’s brilliant to see the renewed interest in things like <a href=\"/in-depth/7010/blast-from-the-past-the-rough-stuff-fellowship\">the Rough Stuff Fellowship</a> where people had amazing adventures on their bikes involving nothing more than a train journey,' he says. 'Instead of driving to the club ride, why not treat it as a warm up and pootle to the start like everyone used to? You can slowly change the mainstream by rocking up without your car.'</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2020/04/100_climbs_spain_mallorca_cap_de_formentor_juan_trujillo_andrades_1.jpg?itok=20XxFdwJ\" />  </div>\n</div>\n<h3>Ration your flights</h3>\n<p>This is a toughie for those of us who enjoy the challenges and scenery of Europe’s famous mountain ranges and haven’t got the time to make the journey by train.</p>\n<p>Kate Rawles travelled by cargo ship for her South American ride, chronicled in her book, <em>The Life Cycle</em>, and says: 'My carbon footprint was around 50kg instead of two tonnes for a return flight. If you can’t imagine totally quitting flying, as I can’t yet, then rationing your flights is a really useful way forward. Since 2006, I’ve only flown once every three years.'</p>\n<p>Mike Hayes says multiple short flights are worse for the planet than one long-haul flight because aircraft burn up more fuel climbing than cruising. 'Flying multiple times a year to ride a bike is just bad, so when you do fly, make it count – take a sabbatical and ride across a continent or something,' he says.</p>\n<h3>Care and repair</h3>\n<p>A bit of TLC can go a long way with your bike and kit, meaning you won’t have to replace them as often. 'There’s no reason why a well-maintained bike shouldn’t notch up more than 100,000 kilometres,' says Hayes.</p>\n<p>Earlier this year, Decathlon introduced its ‘Second Life’ initiative aimed at reducing waste by selling refurbished bikes at discounted prices. The move, it said, would reduce its annual carbon footprint by 40,000kg.</p>\n<p>'Consumption of stuff is a huge issue in relation to both the climate and ecological crises,' says Rawles. 'Anything we can do to consume less is a definite win for the environment. Don’t be lured into buying a new shiny bike or kit if you don’t need it. The most sustainable bike is a second-hand one.'</p>\n<p>Hayes recommends learning how to use a sewing machine or making friends with someone who can. 'Being able to fix a tear, patch a hole or replace a zip is a really valuable thing in being sustainable,' he says.</p>\n<p>If fixing that hole in your £180 lycra bibshorts is beyond you, patching your old innertubes can have an equally beneficial impact.</p>\n<h3>Recyle or resell</h3>\n<p>As part of its commitment to become carbon-neutral by 2025, clothing brand Rapha recently introduced a jersey and bibshorts made from recycled polyester sourced from plastic bottles. If they can do it, so can you.</p>\n<p>Instead of binning your worn-out tyres, donate them to a recycling scheme such as <a href=\"https://www.recyclebiketyres.com/\" target=\"_blank\">recyclebiketyres.com</a> or <a href=\"https://www.recycleandbicycle.co.uk/about/\" target=\"_blank\">recycleandbicycle.co.uk</a>, and save them from joining the tens of thousands that end up in landfill every year.</p>\n<p>Don’t throw away components or clothing that you’ve outgrown. Owen says: 'I’ve always shifted my stuff on. There’s always someone looking for that Garmin model you’ve outgrown. And there’s always someone selling the model you’re after. It’s a win-win for the environment and the individual.'</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/02/cyclist_bigride_iow_hires_6.jpg?itok=2VhDhoTG\" />  </div>\n</div>\n<h3>Outside is free</h3>\n<p>Using an indoor cycling training app can produce up to 90g of Co2 emissions per hour, equivalent to travelling a mile by train.</p>\n<p>'The internet is a vast emitter of Co2 in the form of the energy required to drive the servers, power the infrastructure and so on,' says Hayes. 'What can you do to reduce it? How about going outside?'</p>\n<h3>Shop slowly</h3>\n<p>Support <a href=\"/in-depth/476/in-praise-of-local-bike-shops\">your local bike shop</a> where you can, says Hayes, but if you must buy online, be patient and don’t choose express delivery.</p>\n<p>'The growth in express/next day delivery forces many more vans that are only partially filled onto the roads,' he says. 'As with so many things in life, simply slowing down is more efficient and kinder to the planet.'</p>\n<h3>Don’t litter</h3>\n<p>You would think it’s so simple, yet hedgerows and verges bear evidence of selfish, unthinking cyclists, whether it’s discarded gel wrappers or innertubes. And before you say, 'Oh, I only throw away banana skins', consider this: a banana may be one of the most carbon-efficient foods available – grown in natural sunlight, transported by boat, no packaging required – but its skin can take two years to decompose.</p>\n<p>Do you really want to leave your ugly signature on the environment for that length of time?</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/9845/nic-dlamini-the-hero-cycling-needs\">Nic Dlamini: the hero cycling needs</a></div>      <div><a href=\"/news/7538/watch-south-african-pro-nic-dlaminis-arm-broken-in-clash-with-park-rangers-during-training\">Watch: South African pro Nic Dlamini's arm broken in clash with park rangers during training ride</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 116: on sale now!</a></div>      <div><a href=\"/news/2104/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\">Vuelta a Espana 2021: Route, start list, live TV guide and all we know so far</a></div>    </div></div><p>\n<em>A new, updated version of</em> <a href=\"https://www.waterstones.com/book/how-bad-are-bananas/mike-berners-lee/9781788163811\" target=\"_blank\">How Bad Are Bananas? The Carbon Footprint of Everything</a> <em>by Mike Berners-Lee is published by Profile Books</em>. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div>","author":"jackew","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"62fc87daaed98b67b4ffd6a021b4e01372d7fed11dd83f0c5e242fa64129d27a","category":"Cycling"}