{"title":"Experimental Design of C. oleifera diseases and pest Segmentation Based on CDM-DeeplabV3+ with A Residual Attention ASPP and Dual Attention Encoder","link":"https://www.preprints.org/manuscript/202410.0402/v1","date":1728280841000,"content":"In order to deepen students' understanding of the deep learning network development and application process, this paper designed a deep learning-based teaching experiment simulation method for C. oleifera diseases and pest segmentation. The experimental process includes training data collection and preprocessing, network model training, result verification and analysis, etc., throughout the whole process of deep learning-based image segmentation task development. To this end, CDM-DeeplabV3+ network was proposed to segment C. oleifera leaf diseases fast and accurately, which was composed of a Residual Attention ASPP(CBAM-ASPP) and Dual Attention Encoder (DAM-Encoder). CBAM-ASPP obtained multiscale information by extending to five dilated convolutions and focused on the edge features using Convolutional Block Attention Module. The DAM-Encoder structure, which was connected with CBAM-ASPP in parallel, highlighted the tiny features by combining global and local features. Then, the C. oleifera diseases and pest dataset was built, and the model was compared with the traditional segmentation models DeeplabV3+, UNet, HrNetV2 and PSPNet. The experimental results show that the mIoU of CDM-DeeplabV3+ reaches 85.63%, which is 5.82% higher than that of the original model and the model parameters are reduced by nearly five times, proving the effectiveness and feasibility of segmenting pests and diseases on C. oleifera. The design of the experimental teaching content is inspired by the scientific research experiments of artificial intelligence, following the frontier of the discipline and easy to realize, reflecting the teaching concept of the integration of science and education.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"62fd08c528468e44d57ab543eab8cbeab96dd02f30fce01be454200669d97a4a","category":"Interdisciplinary"}