{"title":"Compounding effects of human activities and climatic changes on the river water temperature evolution mechanism for ecological effects","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4335?af=R","date":1719812031000,"content":"<h2>Abstract</h2>\n<p>Understanding the drivers and ecological effects of river water temperature (<i>T</i>\n<sub>w</sub>) change remains a complex and challenging task in the field of ecohydrology. We developed the extreme-point symmetric mode decomposition to quantitatively identify the trend, period and mutation of water temperature (<i>T</i>\n<sub>w</sub>). The sparrow search algorithm-long short-term memory model was constructed to reconstruct the historical <i>T</i>\n<sub>w</sub> to quantitatively identify the effects of human activities (HA) and climate change (CC) at different time scales. The random forest method was used to analyse the contribution rates of different meteorological factors and to clarify the main factors. Our results demonstrate that the <i>T</i>\n<sub>w</sub> had a cooling trend in the 1980s, and the other decades have a warming trend, and the annual <i>T</i>\n<sub>w</sub> distribution shows an obvious ‘unimodal’ distribution. The interannual <i>T</i>\n<sub>w</sub> has a short period of 2–3a, 6–12a and a long period of 10–15a. At the interannual scale, as the distance from estuaries decreases, the influence of HA gradually diminishes, and only the great <i>T</i>\n<sub>w</sub> is governed by CC. Contributions from HA and CC to <i>T</i>\n<sub>w</sub> vary at the seasonal and monthly scales due to geographical differences. In Cuntan, the contribution of HA to <i>T</i>\n<sub>w</sub> is greater than that of climatic factors. The contribution rates of climatic and HA in the three regions of Yichang, Hankou and Datong also exhibit their respective characteristics and fluctuation patterns. The maximum temperature is the most important factor affecting the change of <i>T</i>\n<sub>w</sub>. Abnormal <i>T</i>\n<sub>w</sub> changes result in delayed spawning and characteristic reproduction <i>T</i>\n<sub>w</sub> attainment dates for the Four Major Chinese Carps and <i>Acipenser sinensis</i>.</p>","author":"Ning He, \nWenxian Guo, \nXuyang Jiao, \nHongxiang Wang","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"6300eb35dcff9114711a9870f89370a16306d38ef78d6a944f2d8413d1973ffb","category":"Environment"}