{"title":"Using butterfly survey data to model habitat associations in urban developments","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14583?af=R","date":1706184903000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/48b546ec-2829-427f-99b8-d0ab073c0b2b/jpe14583-toc-0001-m.png\" alt=\"Using butterfly survey data to model habitat associations in urban developments\" />\n<p>Improving biodiversity is now part of legislation governing new construction projects from England and Wales. However, predicting quantitative changes from hypothetical land-use modifications remains challenging. Our models provide the foundation through which butterfly abundance could be integrated into an urban biodiversity assessment tool, providing species- and community-level statistics to non-specialists from the urban planning and design sector. This would allow them to hone configurations for built surfaces, private gardens, greenspaces and wildlife areas and assess their capacity to provide residents with the intended access to nature.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nOne approach for measuring the potential biodiversity in new urban construction projects is through ecological models that predict how wildlife will respond. For the United Kingdom, such models have only been developed for birds, but to maximise the extent to which models represent overall biodiversity, species from different indicator groups must be considered.\n\nHere, we assess this possibility for butterflies by combining citizen science survey data with high-resolution digital maps. We derive detailed characteristics of urban landscapes around survey sites using previously established methods and quantify their relationship to counts of adults of 18 butterfly species in urban and peri-urban settings.\n\nHigher butterfly counts were found when traversing urban sites with larger areas of semi-natural grassland, other managed greenspaces and adjacent arable land. Most of the butterfly community were found to have negative relationships with highly built-up or fragmented landscapes.\n\nWe found high species-specificity for different details of urban form, particularly in habitat elements such as gardens, vegetation around railways and grass verges.\n\n<i>Policy implications</i>. Improving biodiversity is now part of legislation governing new construction projects from England and Wales. However, predicting quantitative changes from hypothetical land-use modifications remains challenging. Our models provide the foundation through which butterfly abundance could be integrated into an urban biodiversity assessment tool, providing species- and community-level statistics to non-specialists from the urban planning and design sector. This would allow them to hone configurations for built surfaces, private gardens, greenspaces and wildlife areas and assess their capacity to provide residents with the intended access to nature.\n</p>","author":"Joseph E. J. Cooper, \nKate E. Plummer, \nIan Middlebrook, \nGavin M. Siriwardena","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"6300ad342e5b854c7243e0e83c2521d54df482d88db5a908a9c57b0e2c0c4815","category":"Environment"}