{"title":"Thermo‐economic analysis of gas‐to‐wire: A case for utilizing gas flaring in the Niger Delta region of Nigeria","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14391?af=R","date":1722427964000,"content":"<h2>Abstract</h2>\n<p>This work investigated the thermo-economics of gas-to-wire as a gas flaring mitigation option in a selected gas production facility, in the Niger Delta region of Nigeria, which flares 294 thousand standard cubic feet of natural gas, daily. The thermodynamics and economics aspects of the gas-to-wire plant were modeled, and implemented in the Engineering Equation Solver software. The thermodynamics was carried out to ascertain the technical feasibility of the proposed plant, while the economics analysis was done to ensure its cost competitiveness. The findings suggested that 19.2 MW of electricity could be generated from the flare gases. This could be achieved at a life cycle cost of 19.24 billion naira, and a unit cost of energy of 13.47 naira per kWh. Parametric simulation of interest rate, excess combustion air, exit temperature of flue gases, and expansion ratio of gas turbine were also done. Furthermore, the proposed power plant could meet the electricity needs of not less than 60,000 households in Delta State where the gas production facility is located at 550 kWh electricity per capita. The study has shown that gas-to-wire is one of the viable approaches to tackle gas flaring activities in Nigeria, to meet both the energy demand of its people and to preserve the environment. Thus, it is recommended that the Federal Government of Nigeria should give gas-to-wire a priority in its gas flaring utilization agenda.</p>","author":"Smith Orode Otuagoma, \nOgheneakpobo Jonathan Eyenubo, \nKesiena Owebor, \nEbimene Ezekiel Ebisine, \nUfuoma Jeffery Okieke, \nStella Igho Ubara","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"6306ad97f1bee8fbd1bd580a50cea03141ba54bfa4a9ef7898d4c3e3f2b79fa9","category":"Environment"}