{"title":"Vaccination Against Sars-cov-2 And Its Outcomes On Incidence, Lethality And Mortality From Covid-19 In The City Of S&atilde;o Paulo, Brazil","link":"https://www.preprints.org/manuscript/202410.1885/v1","date":1729757918000,"content":"Background/Objectives: to analyze the effects of vaccination against SARS-CoV-2 on the incidence, lethality and mortality from COVID-19, in the city of S達o Paulo, in the period 2020-2022.\nMethods: this is a population-based time series study, with official public data, relating to the period from 2020 to 2022. The population data were extracted from the Municipal Health Department of S達o Paulo, according to the geographic division of the Regional Health Coordination (CRS). The Prais-Winsten regression model was used, calculating the percentage variation of daily change (DPC). This procedure made it possible to classify the trend of epidemiological rates as increasing, decreasing or stationary.\nResults: the city of S達o Paulo recorded that 17% of its total population was infected at least once by the SARS CoV-2 virus, with a fatal outcome in 0.4% of its total population. When comparing the differences between the CRS, it was observed that the North region had a higher lethality rate at the beginning of the pandemic, decreasing significantly over the period. The Central region, in 2021, showed an increasing trend different from the other regions. Regarding mortality, the North, Center and West coordinators showed decreasing trends in all periods analyzed, unlike the East, Southeast and South coordinators, which in 2020 showed stationary trends.\nConclusions: there was a reduction in the epidemiological outcomes of COVID-19 after the mass application of vaccination against SARS-CoV-2. Strategies to increase vaccination coverage should be implemented in all regions of the city of S達o Paulo, especially in those with high social vulnerability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"630a10fe327a9c0f4bdc361a1aa25dbf54c2d365b7c18bb2758a68af4c92bc94","category":"Interdisciplinary"}