{"title":"The Incidence, Aetiology and Clinical Course of Serious Infections Complicating Biological and Targeted Synthetic Disease-Modifying Antirheumatic Drug Therapy in Patients with Rheumatoid Arthritis in Tropical Australia","link":"https://www.preprints.org/manuscript/202409.2430/v1","date":1727762798000,"content":"Introduction: Patients receiving biological and targeted synthetic disease-modifying antirheumatic drugs (b/tsDMARDs) for rheumatological conditions are at an increased risk of serious, potentially life-threatening, infection. However, the incidence, aetiology and clinical course of serious infection in patients receiving b/tsDMARDs in tropical settings are incompletely defined.\nMethods: We retrospectively reviewed all patients with rheumatoid arthritis receiving b/tsDMARDs between October 2012 and October 2021, at Cairns Hospital in tropical Australia.  The incidence, aetiology, and clinical course of serious infections (those requiring admission to hospital or parenteral antibiotics) was determined. \nResults: 310 patients had 1468 patient-years of b/tsDMARD therapy during the study period; 74/310 (24%) had 147 serious infections translating to an overall risk of 10.0 episodes of serious infection per 100-patient-years.  The respiratory tract (50/147, 34%) and skin (37/147, 25%) were the most frequently affected sites. A pathogen was identified in 59/147 (40%) episodes and was most commonly Staphylococcus aureus (24/147, 16%). Only 2/147 (1%) were confirmed “tropical infections”: 1 case of Burkholderia pseudomallei and 1 case of mixed B. pseudomallei and community-acquired Acinetobacter baumannii infection. Overall, 13/147 (9%) episodes of serious infection required Intensive Care Unit admission (0.9 per 100-patient-years of b/tsDMARD therapy) and 4/147 (3%) died from their infection (0.3 per 100-patient-years of b/tsDMARD therapy). The burden of comorbidity and co-administration of prednisone were the strongest predictors of death or a requirement for ICU admission. \nConclusion: The risk of serious infection in patients taking b/tsDMARDs in tropical Australia is higher than in temperate settings, but this is not explained by an increased incidence of traditional tropical pathogens.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"63192bfe3105c08ee5932711b25d261513c7f2ebdc35c76401eb5b1007c4f1a7","category":"Interdisciplinary"}