{"title":"254 Nutrient intake, rumen fermentation and growth performance of Hu sheep fed extruded rapeseed straw as a replacement for peanut vine","link":"https://academic.oup.com/jas/article/102/Supplement_3/356/7757238?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The objective of this study was to investigate the effects of extruded rapeseed straw (ERS) as a replacement for peanut vine (PV) on nutrient intake, rumen fermentation, and growth performance of Hu sheep of China. Male Hu sheep [n = 36; body weight (BW) = 19.5 ± 1.0 kg] were randomly assigned to one of three experimental diets: 1) 0% ERS (Control): 100% PV, no ERS; 2) 50% ERS: 50% ERS+50% PV; or 3) 100% ERS: 100% ERS, no PV. The preliminary trial period was 10 d, and the formal trial period was 90 d. Feed intake was recorded once daily, and weighing was conducted every 30 d. Over all periods, substituting of PV with ERS had no effect on intake of starter feed, metabolizable energy (ME), digestible energy (DE), but had greater total intake energy (GE; <span>P</span> &lt; 0.05). Also, 50% ERS had greater fecal energy but decreased urinary energy compared with control group. Compared with the control, 100% ERS resulted heavier BW and average BW gain per day (ADG) during d 61 to 90 of the experiment (<span>P</span> &lt; 0.05), together with greater feed efficiency (<span>P</span> &lt; 0.05). Compared with control, the rumen concentration of NH3-N increased for 50% ERS and the rumen pH was higher (<span>P</span> &lt; 0.05). When compared with PV, total volatile fatty acids concentrations, propionate and valerate concentrations, and the molar proportions of ruminal acetate were less in ERS groups (<span>P</span> &lt; 0.05), while the concentrations of acetate, isobutyric, isovaleric acid and acetate propionate were greater when substituting of PV with ERS in 50% and 100% (<span>P</span> &lt; 0.05). Concentration of butyrate was not different among treatments. Body measurements were not affected by the treatments. In conclusion, substitution of PV with ERS may improve nitrogen utilization efficiency and rumen fermentation in Hu sheep, also slightly improve growth performance during later fattening period without negative affect on energy intake.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"631aac5e3233db5db46fff9e8b266fb6fcc6ef5ac66d8b86bae8c88d7a38e684","category":"Environment"}