{"title":"Using of the Weibull distribution in developing global solar radiation forecasting models","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14380?af=R","date":1709121336000,"content":"<h2>Abstract</h2>\n<p>In this study, a solar radiation prediction model was developed using the Weibull distribution function (WDF). The main purpose of this study is to develop a new model for solar radiation (SR) estimation using the WDF and to bring this model to the literature. Although the WDF is widely used in wind energy forecasting due to its compatibility with wind speed data, it has not been used before in solar radiation forecasting model development. In this study, it is aimed to make SR estimation with the WDF for the first time. SR data for all regions where this new model was developed and its performance was examined were obtained from the General Directorate of Meteorology. In order to decide the success of these developed models, five different statistical metrics (RPE, MPE, MAPE, SSRE, and <i>t</i>-stat) were discussed in the study. When the results are evaluated in general, it is seen that the new developed model has an acceptable performance. According to all test results in the region where the model was developed, it is seen that the new developed model showed the best performance with 0.0353, 0.4068, 7.1851, 0.1144, and 0.0162 values, respectively. The performance of this new developed model was observed in three different regions. When the statistical test results in these regions were examined, it was seen that the new model developed had a similar performance to the popular solar forecasting models widely used in the literature.</p>","author":"Ayşe Gül Kaplan, \nYusuf Alper Kaplan","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"63207d7a3f00e916bfb025a96f96e3cc87750b80f35065cb22e3e02ee6b2f6dd","category":"Environment"}