{"title":"IGN พรีวิว RE4 บน iPhone 15 Pro บอกไม่ประทับใจ ได้ 30fps แบบไม่นิ่ง, Remote Play ยังดีกว่า","link":"https://www.blognone.com/node/136890","date":1700641308000,"content":"<div><div><div><p>Apple เปิดตัว iPhone 15 Pro ชูจุดเด่นที่ชิป A17 Pro มีความแรงระดับเล่นเกมคอนโซลในมือถือได้ พร้อมเปิดตัวเกม Resident Evil Village และ 4 Remake สำหรับ iOS ซึ่งทาง IGN ได้ทดลองเล่น Resident Evil 4 บน iPhone 15 Pro แล้ว</p>\n<p>IGN บอกว่าเทคนิค MetalFX ของ Apple ที่ทำงานคล้ายกับ DLSS ของ NVIDIA ยังต้องพัฒนามากกว่าแค่มีอัลกอริทึ่มที่ดี ถ้าจะเล่นเกมอย่าง Resident Evil 4 หรือ Death Stranding และระบุว่าประสบการณ์ที่ได้รับจากการเล่นเกมระดับนี้บนมือถือนั้นไม่ค่อยน่าประทับใจนัก</p>\n<p>เกม Resident Evil 4 บน iPhone 15 Pro นั้นมีอาการกระตุกตลอดในช่วงเล็งปืนหรือการโหลดเข้าฉากต่าง ๆ ในเกม และตัวเกมก็เหมือนค้างไปเลยตอนชาวบ้านกำลังบีบคอ Leon แถมการเล่นโดยการแตะหน้าจอนั้นทำให้อยากปิดเกมทิ้งไปเลย ซึ่งคอนโทรลเลอร์เสริมแก้ไขปัญหานี้ได้แต่ก็ต้องจ่ายเงินเพิ่ม</p>\n<p>IGN แนะนำว่าถ้าจะเล่นแบบ Resident Evil 4 บน iPhone จริง ๆ ควรเปิดแอป Remote Play แล้วสตรีมเกมจากคอนโซลหรือพีซีน่าจะให้ประสบการณ์ที่ดีกว่าการเล่นตรง ๆ ที่ 30fps แบบไม่นิ่งบน iPhone 15 Pro</p>\n<p>หลังจาก IGN ปล่อยบทความและวิดิโอนี้ Hideo Kojima ผู้สร้างเกม Death Stranding ก็ออกมา Repost ผ่าน X ของตนด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/47e7ac58fbc1cab45fc2b61a258ee1d9.png\" /><em>ภาพจาก X ของ Hideo Kojima</em></p>\n<p>ที่มา - <a href=\"https://www.ign.com/articles/i-played-resident-evil-4-on-the-iphone-15-pro-i-didnt-like-it\">IGN</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/resident-evil\">Resident Evil</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/ign\">IGN</a></div><div><a href=\"/topics/iphone-15-pro\">iPhone 15 Pro</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"63211333ccf450d6abdda6107b22cf8b3c9d451712a9e83d3bb85fa609c6f30b","category":"Thai"}