{"title":"Integrating Building Information Modeling (BIM) and Life Cycle Cost Analysis (LCCA) to Evaluate  the Economic Benefits of Designing Aging-in-Place Homes at the Conceptual Stage","link":"https://www.preprints.org/manuscript/202405.0681/v1","date":1715562156000,"content":"This paper presents a methodology for the integration of Building Information Modeling (BIM) and Life Cycle Cost Analysis (LCCA) to assess the economic implications of designing aging-in-place (AIP) homes at the conceptual stage. With the global increase in the aging population, there is an increased demand for housing solutions tailored to the needs of elderly individuals. Focusing on the importance of the early phase of design, this study aims to improve the process of making efficient decisions by providing a comprehensive assessment of the life cycle costs associated with AIP homes. The study introduces a semi-automated model for the economic evaluation of AIP homes, enabling the estimation of costs throughout the houses’ entire life cycle, from design and construction to operation, maintenance, and eventual renovation or disposal. The said model facilitates the exploration of the long-term economic feasibility of design’s related decisions with an emphasis on the importance of considering the life cycle costs early during the design process to optimize the functionality and economic viability. By investing in accessible and universal design features upfront, the initial costs for modifications can lead to long-term savings by reducing the need for extensive retrofits. The model can easily do comparison between different design alternatives in terms of their lifecycle costs, allowing designers to assess the financial impact of using important features in their design such as wider doorways, accessible bathrooms, and elevators. Overall, this study provides valuable insights for designers and homeowners about the economic aspects of designing AIP homes as a support for efficient decision-making during the early stages of the design process.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"634373aeec730878d0c9aa86bac95aa9f8631a5547f2c003acd624eabb308dc0","category":"Interdisciplinary"}