{"title":"How Effective Were Isolation and Quarantine Strategies during the COVID-19 Pandemic: Challenges and Lessons Learned So Far?","link":"https://www.preprints.org/manuscript/202406.1647/v1","date":1719205142000,"content":"Isolation, quarantine, and contact tracing were some of the most critical and commonly employed non-pharmaceutical interventions to control the COVID-19 pandemic. However, the effectiveness of these strategies after their implementation depends upon many factors such as the country's population, availability of sufficient resources to diagnose and effectively isolate the infected individuals, and feasibility, and acceptability of isolation and quarantine policy by the public. This narrative review aims to appraise the current evidence on the correct implementation strategies and shortcomings made in the isolation and quarantine strategies during the COVID-19 pandemic. PubMed, SCOPUS, EMBASE, and Web of Science citation index with the following keywords were searched: Pandemic, COVID-19, Coronavirus, Quarantine, and Isolation. The results showed that quarantine and isolation of COVID-19 patients were more effective than late adoption (5-fold versus 2.6-fold)’. Around 90% of outbreaks could have been managed if 80% of contacts were monitored, traced, and isolated within 4 days. For each new case of COVID-19, around thirty-six individuals should have been traced. When the percentage of individuals without symptoms is greater than 30%, isolation and contact tracing alone cannot contain the infection. The delay between the onset of symptoms and isolation is the most important factor determining whether an outbreak is controllable. The ideal day for testing should start on the 6th of the quarantine. However, this evidence is mostly based on mathematical modeling studies, and evidence for its effectiveness in real scenarios is required. Symptom-based isolation strategy should not be considered the sole criterion for considering isolation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"634be949f5db74ef35b452e3aa9ba50a56af58fb9dbecbcd3b4f1c181d37796d","category":"Interdisciplinary"}