{"title":"Binary Biomass-Based Electrolyte Films for High-Performance All-Solid-State Supercapacitor","link":"https://www.preprints.org/manuscript/202408.2278/v1","date":1725121183000,"content":"A binary biomass-based solid electrolyte film (LSE) was successfully synthesized through the incorporation of lignin nanoparticles (LNP) with sodium alginate (SA). The impact of the mass ratio of SA to LNP on the microstructure, porosity, electrolyte absorption capacity, ionic conductivity, and electrochemical properties of the LSE was thoroughly investigated. The results indicated that as the proportion of SA increased from 5% to 15% LNP, the pore structure of the LSE became increasingly uniform and abundant. Consequently, enhancements were observed in porosity, liquid absorption capacity, ionic conductivity, and overall electrochemical performance. Notably, at a SA amount of 15% LNP, the ionic conductivity of resultant LSE-15 was recorded at 14.10 mS cm1, with porosity and liquid absorption rates reaching 308% and 58.4%, respectively. LSE-15 was employed as a solid electrolyte, while LNP-based carbon aerogel (LCA) served as the two electrodes in the construction of a symmetric all-solid-state supercapacitor (SSC). The SSC device demonstrated exceptional electrochemical storage capacity, achieving a specific capacitance of 197 F g1 at 0.5 A g1, along with maximum energy and power density of 27.33 W h kg1 and 4998 W kg1, respectively. Furthermore, the SSC device exhibited highly stable electrochemical performance under extreme conditions, including compression, bending, and both series and parallel connections. Therefore, the development and application of the binary biomass-based solid electrolyte film in supercapacitors represent a promising strategy for harnessing high-value biomass resources in the field of energy storage.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6353f16d184587fe2d120811aec56ac83a59058b1e4215bbdb9c1beb93ac78a7","category":"Interdisciplinary"}