{"title":"Leaked Surface Pro 8 specs include Thunderbolt ports and a 120 Hz screen","link":"https://arstechnica.com/?p=1796659","date":1632147072000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/surfacepro8.jpeg\" /><p>Alleged Surface Pro 8 leak shows a device with a larger screen, Thunderbolt ports, and a 120 Hz screen.  (credit: <a href=\"https://twitter.com/Shadow_Leak/status/1439546343190638597\">Twitter/Shadow_Leak</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Just days ahead of Microsoft's next Surface hardware event, <a href=\"https://twitter.com/Shadow_Leak/status/1439546343190638597?ref_src=twsrc%5Etfw\">Twitter user @Shadlow_Leak</a> has posted what appears to be a leaked retail listing showing some key specs of a new Surface Pro device (via <a href=\"http://-rumors\">The Verge</a>). According to the listing, the new convertible tablet appears to ditch USB-C and USB-A ports in favor of a pair of Thunderbolt 4 ports, and it also adds 11th-gen Intel Core processors, a 13-inch screen with a 120 Hz refresh rate, and a user-replaceable SSD like the ones in <a href=\"https://docs.microsoft.com/en-us/surface/surface-ssd-removal-guide\">some other current Surface devices</a>.</p>\n\n<p>The renders show a Surface with a design similar to the current Surface Pro 7, just with a notably larger screen and smaller bezels than the current Surface Pro 7. Take this with a larger grain of salt—the \"screens\" in these press renders are often superimposed on the devices after the fact, and they've been <a href=\"https://arstechnica.com/gadgets/2013/11/a-nexus-8-mysterious-tablet-pictured-in-kitkat-promotional-material/\">known to get the screen size wrong</a>. Still, a larger screen with smaller bezels lines up with other Surface Pro 8 rumors that have been circulating, as well as general design trends in the PC industry.</p>\n<p>A larger screen for the Surface Pro 8 would make this the biggest overhaul of the hardware since <a href=\"https://arstechnica.com/gadgets/2014/05/hands-on-using-microsofts-surface-pro-3-as-a-laptop-on-my-lap/\">2014's Surface Pro 3</a>. Microsoft has been intentionally conservative about updating the device's design over the years in order to maintain compatibility with existing chargers, keyboard covers, and accessories. <a href=\"https://arstechnica.com/gadgets/2019/10/hands-on-with-microsofts-barrage-of-new-surface-devices/\">2019's Surface Pro X</a> introduced a refined design, but that tablet is only available with ARM processors rather than x86 chips from Intel or AMD, limiting compatibility and performance for many existing Windows apps.</p></div><p><a href=\"https://arstechnica.com/?p=1796659#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1796659&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"635b4d382a430e19d62d62f4b4ff3a2dd40272e0d076ca33b730f837841addfb","category":"Tech"}