{"title":"Can we use big batteries to power our trains?","link":"https://arstechnica.com/?p=1812140","date":1636646425000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-170584697-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-170584697.jpg\">Enlarge</a> <span>/</span> An eastbound manifest freight swoops through an S curve in Lombard Canyon, just east of Toston, Montana, on September 11, 2011. The tracks here snake along the Missouri River between Toston and Lombard. (credit: <a href=\"https://www.gettyimages.com/detail/photo/snaking-the-missouri-river-royalty-free-image/170584697?adppopup=true\">Mike Danneman / Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>With the rapid pace of development in electric vehicles, we will likely get to a place where eliminating carbon emissions from one form of transport is possible. But cleaning up the remaining major modes—planes, trains, and ships—appears to be considerably more challenging. A new analysis suggests we have a good idea of how to improve one of those.</p>\n<p>The study, performed by California-based researchers, looks at the possibility of electrifying rail-based freight. It finds that the technology is pretty much ready, and under the right circumstances, the economics are on the verge of working out. Plus, putting giant batteries on freight cars has the potential to create some interesting side benefits.</p>\n<h2>Giving freight a jolt</h2>\n<p>Right now, most freight in the US is moved by diesel-powered locomotives. In a typical year, these locomotives produce about 35 million tonnes of carbon dioxide, and the rest of the pollutants they make are estimated to cause 1,000 premature deaths and $6.5 billion in health damages.</p></div><p><a href=\"https://arstechnica.com/?p=1812140#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1812140&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6373f6915dfce508461406b26a152aa1d6f7034a7a9d872bfa63c2d4425c277b","category":"Tech"}