{"title":"Does Enterprises&rsquo; Digital Transformation Enhance Carbon Neutrality Performance?: The Evidence from 30 Providences and Municipalities in China","link":"https://www.preprints.org/manuscript/202406.0542/v1","date":1718004469000,"content":"This study examines if enterprises’ digital transformation enhances their sustainable development capabilities and reduces carbon emissions, thus enhancing carbon neutrality performance and implementing the \"dual-carbon\" strategy. It specifically explores the impact of Chinese firms’ digital transformation on carbon neutrality performance in 30 provinces and municipalities in China from 2011 to 2021. Based on the Difference-in-Difference method and spatial econometric modeling, this study finds a U-shaped relationship between enterprise digital transformation and carbon performance, with spatial spillover effects. It also finds that converting environmental charges into taxes can significantly improve carbon performance. In terms of the mechanism of action, digital transformation affects carbon performance by influencing energy use efficiency and adjusting the level of industrial structure advancement and rationalization. In terms of heterogeneity, this U-shaped relationship exists only in the eastern and central regions, and the significance is more substantial in the east; in addition, the impact of enterprise digital transformation on carbon performance is more evident in regions with higher R&amp;D intensity and higher economic development levels. These findings imply that the government should further encourage and guide enterprise digital transformation, monitor the effects of environmental protection policies and select and implement carbon emission reduction strategies according to local conditions to improve carbon performance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6374c0b874b848deb9bf45187577bd07f5fc46553b7a5921fe9548c0a02129ff","category":"Interdisciplinary"}