{"title":"Comparative study of wake mean flows with submerged macroroughness elements","link":"http://link.springer.com/10.1007/s11600-024-01354-y","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>Large roughness elements (LREs) play a crucial role in river and stream restoration, influencing flow patterns, inducing turbulence and enhancing habitat suitability. Despite their widespread use, uncertainties exist in the literature concerning the spatial variation of three-dimensional (3D) mean flow characteristics. This study attempts to address this gap by conducting a comparative analysis of three simplified LREs—quasi-spherical boulder, artificial vegetation patch, and wooden log—focusing on their effects on downstream mean flow characteristics. The findings of this research reveal notable deviations in streamwise, transverse, and vertical downstream velocity profiles for each LRE compared to reference velocity profiles. These deviations eventually tend to realign with the reference velocity profiles. Each LRE exhibited a distinctive trend for downstream depth-averaged velocity in each direction. The reach averaged shear velocity downstream of the boulder was the highest among the three LREs, followed by the wooden log and then the vegetation patch. The streamwise velocity profiles for each LRE do not adhere to the typical logarithmic velocity distribution of von Karman–Prandtl. Particularly, the wooden log generates the largest wake zone and exhibits a higher streamwise velocity deficit compared to other LREs. Moreover, it demonstrates the highest divergence from reference transverse velocity, resulting in an extended recirculation zone. These observations suggest that the use of wooden logs has the potential to enhance habitat diversity in natural streams and can be effectively integrated into stream restoration projects aimed at improving aquatic ecosystems, thereby contributing to the sustainable management of river environments.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"637520eaf7889f5a85497496ef483382466a2776b71b0eac7ad8435a640e6ee9","category":"Environment"}