{"title":"New – Set Up Your AWS Notifications in One Place","link":"https://aws.amazon.com/blogs/aws/new-set-up-your-aws-notifications-in-one-place/","date":1683135359000,"content":"<p>Today we are launching <strong>AWS User Notifications</strong>, a single place in the AWS console to set up and view AWS notifications across multiple AWS accounts, Regions, and services.</p> \n<p>You can centrally set up and view notifications from over 100 AWS services, such as <a href=\"https://aws.amazon.com/s3\">Amazon Simple Storage Service</a> (Amazon S3) objects events, <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud</a> (Amazon EC2) instance state changes, <a href=\"https://health.aws.amazon.com/health/home\">AWS Health Dashboard</a> events, <a href=\"https://aws.amazon.com/cloudwatch\">Amazon CloudWatch</a> alarms, or <a href=\"https://aws.amazon.com/premiumsupport/\">AWS Support</a> case updates in a consistent, human-friendly format. You can also configure delivery channels—email, chat, and push notifications to the AWS console mobile app, where you can receive these notifications.</p> \n<p>Alternatively, you can view notifications in the <a href=\"https://console.aws.amazon.com/\">AWS Management Console</a> by clicking the bell icon!</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/03/2023-aws-user-notifications-1.jpg\" alt /></p> \n<p>Choose <strong>See all notifications</strong> to find all your configured notifications in the <strong>Notification Center</strong>. You can filter notifications in your accounts by services, display a detailed notification view with human-readable messages, and access deep links to the relevant console resource pages.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/03/2023-aws-user-notifications-2.jpg\" alt /></p> \n<p><strong><u>Configure Notifications the Way You Want</u></strong><br /> To receive your notifications, set up notification configurations. If this is your first time using the service, you will be prompted to first set up at least one notification hub.</p> \n<p>Notification hubs are the Regions your notifications are stored and processed in or replicated to. You are required to select at least one notification hub before you can create notification configurations. You can also edit notification hubs from <strong>Notification hubs</strong> in the navigation pane.</p> \n<p>Currently, you can select up to three Regions.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/01/31/2023-aws-user-notifications-3.jpg\" alt width=\"2250\" height=\"802\" /></p> \n<p>Next, choose <strong>Notification configurations</strong> and <strong>Create notification configuration</strong> to specify what event will generate a notification. You can select the services, create event rules that you want to be notified about, and set up how often you are notified in your communication channels.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/03/2023-aws-user-notifications-4.jpg\" alt /></p> \n<p>Next, enter a name and description for your configuration. Here is an example to get all notifications for Amazon EC2 instance state changes.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/03/2023-aws-user-notifications-5.jpg\" alt /></p> \n<p>In the <strong>Event rules</strong> section, use the <strong>Pattern builder</strong> to create one or more event rules to specify which events generate notifications. Choose your AWS service name as the event source, the type of events as the source of the matching pattern, and the Regions the events will be sourced from.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/03/2023-aws-user-notifications-6.jpg\" alt /></p> \n<p>You can select any <a href=\"https://aws.amazon.com/eventbridge\">Amazon EventBridge</a> events, like CloudWatch alarm state change, and configure them to generate notifications. Currently, more than 100 AWS services emit <a href=\"https://docs.aws.amazon.com/eventbridge/latest/userguide/eb-service-event.html\">events to Amazon EventBridge</a>.</p> \n<p>Optionally, use the <strong>Advanced filter</strong> to further customize the event rules using a JSON format with <a href=\"https://docs.aws.amazon.com/eventbridge/latest/userguide/eb-event-patterns.html\">EventBridge event patterns</a>. For example, you can create a rule to only generate notifications for EC2 instances with the <code>production</code> tag.</p> \n<pre><code>{\n    \"detail\": {\n    \"tag\": [\"production\"]\n     }\n}\n</code></pre> \n<p>You can also define the cadence of when you want to receive the notifications. Choose either <strong>Receive fewer notifications</strong> only to receive a few daily notifications or <strong>Reduce notification delivery time</strong> to get high-priority notifications.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/03/2023-aws-user-notifications-7.jpg\" alt /></p> \n<p>Configure delivery channels where you want the notifications to be sent, such as specific email addresses or AWS Chatbot. You can get notifications in chat clients like Slack and Amazon Chime via AWS Chatbot. Also, you can enable push notifications in the <a href=\"https://aws.amazon.com/console/mobile/\">AWS Console Mobile Application</a> as one of the delivery channels.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/05/2023-aws-user-notifications-8.jpg\" alt /></p> \n<p>Choose <strong>Create notification configuration</strong> after reviewing your configuration and confirming the details.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/04/03/2023-aws-user-notifications-9.jpg\" alt /></p> \n<p>If you would like to receive notifications from multiple accounts, see the instructions for <a href=\"https://docs.aws.amazon.com/eventbridge/latest/userguide/eb-cross-account.html\">Sending and receiving Amazon EventBridge events between AWS accounts</a> in the Amazon EventBridge User Guide. Once you’ve completed setting up a receiver account, create a notification configuration that reacts to events.</p> \n<p><strong><u>Now Available</u></strong><br /> AWS User Notifications are now available in US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Osaka), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Paris), Europe (Stockholm), and South America (São Paulo) Regions, and you can start using it today.</p> \n<p>To use User Notifications in Regions added after March 2019, such as Africa (Cape Town), Asia Pacific (Hong Kong), Asia Pacific (Hyderabad), Asia Pacific (Jakarta), Asia Pacific (Melbourne), Europe (Milan), Europe (Spain), Europe (Zurich), Middle East (Bahrain), and Middle East (UAE), enable them in your account. To learn more, see <a href=\"https://docs.aws.amazon.com/general/latest/gr/rande-manage.html\">Managing AWS Regions</a> in the AWS Reference guide.</p> \n<p>For more information, see the <a href=\"https://docs.aws.amazon.com/notifications/latest/userguide/what-is-service.html?trk=af9c54f5-62f3-4043-a5b1-2dce1e04b7c8&amp;sc_channel=el\">AWS User Notifications Guide</a>, and please send feedback to <a href=\"https://repost.aws/?trk=fc48db34-296c-42af-bd0d-a89fd53950ae&amp;sc_channel=el\">AWS re:Post for AWS User Notifications</a> or through your usual AWS support contacts.</p> \n<p>– <a href=\"https://twitter.com\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"638a94e3fd3dc0561b389a3e8f96edadd94b05f31ba09d8b00a79faf7b124baa","category":"Tech"}