{"title":"Cross-Cultural Validation of Neuropsychological Assessments and their Clinical Applications in Cognitive Behavioral Therapy: A Scoping Analysis","link":"https://www.preprints.org/manuscript/202407.1719/v1","date":1721666468000,"content":"This systematic review explores the cross-cultural validation of neuropsychological assessments and their clinical applications in cognitive behavioral therapy (CBT), focusing on culturally adapted CBT (CA-CBT) across diverse populations and settings. Methods: Following the PRISMA guidelines, a comprehensive search was conducted in multiple academic databases, including PubMed, PsycINFO, Scopus, and Web of Science. Keywords related to cognitive-behavioral therapy, cultural adaptation, and specific populations were used. Inclusion criteria encompassed randomized controlled trials (RCTs) and pilot studies that assessed CA-CBT for various mental health conditions. Results: The review included studies involving Chinese Americans, Latino caregivers, Syrian refugees, Jordanian children, Malaysian Muslims, Afghan refugees, Iraqi women, Japanese children and adolescents, and Tanzanian and Kenyan children. CA-CBT demonstrated significant effectiveness in reducing symptoms of depression, anxiety, PTSD, and psychosis. For instance, Research has shown that CA-CBT is more effective than standard CBT in reducing depressive symptoms among Chinese Americans and significantly lowering PTSD symptoms in Syrian refugee women. The method has been well-received and feasible in diverse populations, such as Jordanian children and Afghan refugees. Long-term benefits are promising, with sustained improvements reported in various studies. Additionally, digital and remote delivery methods have demonstrated potential for expanding the accessibility of CA-CBT. Conclusions: CA-CBT is a valuable and effective intervention for diverse cultural populations, significantly improving mental health outcomes. However, future research must address limitations such as small sample sizes, short follow-up periods, and variability in assessment tools. Studies should include larger and more diverse sample sizes, longer follow-up periods, rigorous control groups, and comprehensive outcome measures to further validate and enhance the application of CA-CBT across different cultural contexts.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"638b27c42da7b2daaf19262c1b8c6ecde9d027e54a17e84df9f5f5338685bd6f","category":"Interdisciplinary"}