{"title":"Age of Empires and live ants used to test theoretical ideas on combat","link":"https://arstechnica.com/?p=1964101","date":1693337684000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-532401687-800x535.jpg\" alt=\"Two small ants face each other and touch antennas.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-532401687.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/linepithema-humile-royalty-free-image/532401687?phrase=argentine+ant&amp;adppopup=true\">Jesús Alberto Ramírez Viera</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Anyone who has played a real-time strategy game probably ponders this question when preparing for a fight: Is it better to have a huge number of relatively weak units or a smaller number of extremely powerful ones? But the question predates computer games and virtual war machines. Theoreticians started tackling the problem in response to the real-world carnage of World War I, where it was posed as a question of army size versus fighting strength.</p>\n<p>In the years since, the ideas developed for human warfare have been adapted to apply to non-human combatants, most notably social insects, which can mobilize large forces when engaging in combat. In the early 1990s, researchers who studied ants argued that finding the right balance between force size and capability depended partly on the environment. Complex environments, they theorized, favored smaller numbers of capable units that could occupy key terrain. Simpler environments, by contrast, would allow massive waves of weak units to <a href=\"https://www.dictionary.com/e/slang/zerg-rush/\">Zerg rush</a> an outnumbered opponent.</p>\n<p>That idea has been difficult to test empirically. But three researchers from the University of Western Australia (Samuel Lymbery, Bruce Webber, and Raphael Didham) have now put it to the test, using a combination of <em>Age of Empires</em> and live ants.</p></div><p><a href=\"https://arstechnica.com/?p=1964101#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1964101&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6397db52967ad6fcd9f5679334ba60882b5bc69d6bf9f69da52ce1103dbf6a1c","category":"Tech"}