{"title":"The first Apple Store union wants workers to get tips","link":"https://www.macworld.com/article/1809071/apple-store-baltimore-union-contract-negotiation-overtime-vacation-tips.html","date":1683215522000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Despite <a href=\"https://www.macworld.com/article/707145/macalope-wage-hikes-apple-store-union.html\">Apple’s objections</a>, the Baltimore Apple Store last year became the first in the country to unionize, and now we’re getting a glimpse into the negotiations for the next contract. Among the proposals by union representatives: higher pay and tips for “a job well done.”</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2023-05-03/apple-s-unionized-store-workers-seek-tips-and-higher-holiday-pay&amp;xcust=1-1-1809071-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">a Bloomberg report</a>, the International Association of Machinists and Aerospace Workers entered into negotiations with Apple this week by submitting its first series of proposals to management. Among the union’s requests are fairly standard proposals: 10 percent pay raises, changes to the company’s vacation policy, bereavement leave, and overtime.</p>\n\n\n\n<p>But the most controversial inclusion is a new tipping system, which would prompt customers to leave gratuities of 3 percent, 5 percent, or a custom amount for any in-store transactions. According to the union, tips “will allow thankful patrons the ability to express gratitude for a job well done without any obligations.” The union says tips would be pooled and “dispersed to members of the bargaining unit biweekly based on any hours worked.”</p>\n\n\n\n<p>Tipping prompts are commonplace for food delivery and service but aren’t generally collected at retail stores, where workers traditionally get paid a higher wage. Apple Store workers reportedly make a minimum of $22 per hour following <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.wsj.com/articles/apple-boosting-pay-budget-for-workers-amid-tight-labor-market-11653527996&amp;xcust=1-1-1809071-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">a 2022 pay raise</a>. The union is also seeking double pay for employees who work more than eight hours a day or 40 hours a week, and up to 34 weeks of severance pay following layoffs.</p>\n\n\n\n<p>The union appears to know that the tipping policy is a nonstarter and said in a statement that the proposal merely represents the first phase of negotiations, with the goal of reaching “an acceptable contract for the membership to ratify.”</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"63997996c664762c1a8bfd95c7aeec8ac7bb6b805c8432f5da858ddd07e7eac3","category":"Apple"}