{"title":"Epic Games vs. Apple Judgment Allows App Store Developers to Link to Alternative Payment Methods","link":"https://www.macrumors.com/2021/09/10/epic-games-vs-apple-decision/","date":1631288583000,"content":"A decision was reached today in the high-profile Epic Games v. Apple trial, with U.S. District Judge Yvonne Gonzalez Rogers ruling that Apple's anti-steering conduct is anti-competitive, and ruling in favor of Apple on all other counts.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/app-store-blue-banner-epic-1.jpg\" />\r\n<br />\r\nIn a 185-page ruling, Judge Rogers said \"the Court cannot ultimately conclude that Apple is a monopolist under either federal or state antitrust laws,\" but she said the trial \"did show that Apple is engaging in anticompetitive conduct under California's competition laws.\" Rogers concluded that \"Apple's anti-steering provisions hide critical information from consumers and illegally stifle consumer choice\":<blockquote>Having defined the relevant market as digital mobile gaming transactions, the Court next evaluated Apple's conduct in that market. Given the trial record, the Court cannot ultimately conclude that Apple is a monopolist under either federal or state antitrust laws. While the Court finds that Apple enjoys considerable market share of over 55% and extraordinarily high profit margins, these factors alone do not show antitrust conduct. Success is not illegal. The final trial record did not include evidence of other critical factors, such as barriers to entry and conduct decreasing output or decreasing innovation in the relevant market. The Court does not find that it is impossible; only that Epic Games failed in its burden to demonstrate Apple is an illegal monopolist.\r\n<br />\r\n\r\n<br />\r\nNonetheless, the trial did show that Apple is engaging in anticompetitive conduct under California's competition laws. The Court concludes that Apple’s anti-steering provisions hide critical information from consumers and illegally stifle consumer choice. When coupled with Apple's incipient antitrust violations, these anti-steering provisions are anticompetitive and a nationwide remedy to eliminate those provisions is warranted.</blockquote>Judge Rogers thus issued a permanent injunction that requires Apple to let U.S. developers direct customers to payment options other than Apple's in-app purchase system:<blockquote>Apple Inc. and its officers, agents, servants, employees, and any person in active concert or participation with them (\"Apple\"), are hereby permanently restrained and enjoined from prohibiting developers from (i) including in their apps and their metadata buttons, external links, or other calls to action that direct customers to purchasing mechanisms, in addition to In-App Purchasing and (ii) communicating with customers through points of contact obtained voluntarily from customers through account registration within the app.</blockquote>Apple already <a href=\"https://www.macrumors.com/2021/09/01/apple-reader-app-changes-japan-ftc/\">announced last week</a> that, starting in early 2022, it would allow developers of \"reader\" apps like Netflix, Spotify, and the Amazon Kindle app to include an in-app link to their website for users to set up or manage an account. If this ruling is upheld, however, Apple will be required to extend this allowance to all types of apps. The ruling also ensures that developers would be able to explicitly mention alternative payment options.\r\n<br />\r\n\r\n<br />\r\nThe saga began in August 2020, when Apple removed Fortnite from the App Store after Epic Games introduced a direct payment option in the app, in defiance of the App Store rules. In an orchestrated move, Epic Games promptly <a href=\"https://www.macrumors.com/2020/08/13/apple-removes-fortnite-from-app-store/\">filed a lawsuit against Apple</a>, accusing Apple of having a monopoly over the sale of apps and in-app purchases through the App Store. (See our <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">timeline of events surrounding the trial</a> for more details.)\r\n<br />\r\n\r\n<br />\r\nJudge Rogers ruled that Epic Games shall pay damages equal to 30% of the $12,167,719 in revenue that Epic Games collected from users in the Fortnite app on iOS through the direct payment option between August 2020 and October 2020, plus 30% of any such revenue Epic Games collected from November 1, 2020 through the date of judgment, plus interest.\r\n<br />\r\n\r\n<br />\r\nApple is likely to appeal the decision. We've reached out to the company for comment and we will update this story if we hear back.\r\n<br />\r\n\r\n<br />\r\n<strong>Update:</strong> Apple has issued the following statement, as <a href=\"https://twitter.com/nickstatt/status/1436359448272900101\">shared by Nick Statt</a>: <blockquote>Today the Court has affirmed what we've known all along: the App Store is not in violation of antitrust law. As the Court recognized 'success is not illegal.' Apple faces rigorous competition in every segment in which we do business, and we believe customers and developers choose us because our products and services are the best in the world. We remain committed to ensuring the App Store is a safe and trusted marketplace that supports a thriving developer community and more than 2.1 million U.S. jobs, and where rules apply equally to everyone.</blockquote>The court documents associated with the ruling are embedded below.\r\n<br />\r\n\r\n<br />\r\n<div><p><a href=\"https://www.scribd.com/document/524418803/Epic-Games-v-Apple-Judgment-and-Permanent-Injunction#from_embed\">Epic Games v. Apple: Judgme...</a> by <a href=\"https://www.scribd.com/user/212523051/MacRumors#from_embed\">MacRumors</a></p></div><div><p><a href=\"https://www.scribd.com/document/524428007/Full-Findings-of-the-Court-in-Epic-Games-v-Apple#from_embed\">Full Findings of the Court ...</a> by <a href=\"https://www.scribd.com/user/212523051/MacRumors#from_embed\">MacRumors</a></p></div><div>Tag: <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/10/epic-games-vs-apple-decision/\">Epic Games vs. Apple Judgment Allows App Store Developers to Link to Alternative Payment Methods</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/epic-games-vs-apple-judgment-allows-app-store-developers-to-link-to-alternative-payment-methods.2310292/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=tV_fE62oWpM:4dEZ738k2ws:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=tV_fE62oWpM:4dEZ738k2ws:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/tV_fE62oWpM\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"63ab9739a00dbd99039f9929580cf3a9cb1b5e3e8947c2cf7c61a5400ee1029a","category":"Apple"}