{"title":"bHLH transcription factors cooperate with chromatin remodelers to regulate cell fate decisions during <i>Arabidopsis</i> stomatal development","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002770","date":1723816800000,"content":"<p>by Ao Liu, Andrea Mair, Juliana L. Matos, Macy Vollbrecht, Shou-Ling Xu, Dominique C. Bergmann</p>\r\n\r\nThe development of multicellular organisms requires coordinated changes in gene expression that are often mediated by the interaction between transcription factors (TFs) and their corresponding <i>cis</i>-regulatory elements (CREs). During development and differentiation, the accessibility of CREs is dynamically modulated by the epigenome. How the epigenome, CREs, and TFs together exert control over cell fate commitment remains to be fully understood. In the <i>Arabidopsis</i> leaf epidermis, meristemoids undergo a series of stereotyped cell divisions, then switch fate to commit to stomatal differentiation. Newly created or reanalyzed scRNA-seq and ChIP-seq data confirm that stomatal development involves distinctive phases of transcriptional regulation and that differentially regulated genes are bound by the stomatal basic helix–loop–helix (bHLH) TFs. Targets of the bHLHs often reside in repressive chromatin before activation. MNase-seq evidence further suggests that the repressive state can be overcome and remodeled upon activation by specific stomatal bHLHs. We propose that chromatin remodeling is mediated through the recruitment of a set of physical interactors that we identified through proximity labeling—the ATPase-dependent chromatin remodeling SWI/SNF complex and the histone acetyltransferase HAC1. The bHLHs and chromatin remodelers localize to overlapping genomic regions in a hierarchical order. Furthermore, plants with stage-specific knockdown of the SWI/SNF components or HAC1 fail to activate specific bHLH targets and display stomatal development defects. Together, these data converge on a model for how stomatal TFs and epigenetic machinery cooperatively regulate transcription and chromatin remodeling during progressive fate specification.","author":"Ao Liu","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"63b61c1cd27f4c204d622ce4eaaf25abc178646fca2d66c28ebc72df2a115023","category":"Environment"}