{"title":"Energy efficiency of grazing Hereford heifers classified by paternal residual feed intake","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae005/7628928?rss=1","date":1710374400000,"content":"<span><div>Abstract</div>Residual feed intake (RFI) has become a widely spread index of feed efficiency. Although most of beef cattle systems in the world are pasture based, RFI evaluation and research is usually performed in confinement conditions. In this context, residual heat production (RHP) estimated as the difference between actual and expected heat production (HP), could allow to identify efficient animals. Thus, the aim of this work was to evaluate the relationship between paternal estimated breeding values (EBV) for RFI and beef heifer efficiency, measured as RHP, as well as its association with heifers’ productive and reproductive performance on grazing conditions. Seventy-one 25 ± 0.8-mo-old and seventy-four 24 ± 0.7-mo-old Hereford heifers were managed as contemporary groups in spring 2019 and 2020, respectively. Heifers were sired by 10 RFI-evaluated bulls and classified into three groups according to the paternal EBV for RFI: five bulls of low RFI (high efficiency, pHE), two bulls of medium RFI (medium efficiency), and three bulls of high RFI (low efficiency, pLE). The experimental period lasted 70 d prior to their first insemination where HP was determined by the heart rate-O<sub>2</sub> pulse technique. In addition, reproductive performances during the first and second breeding and calving seasons were recorded. Heifers’ RHPs expressed as MJ/d and kJ/kg of body weight (BW)<sup>0.75</sup>/d were positively correlated with paternal RFI EBVs (<span>P </span>&lt; 0.05; <span>r</span> &gt; 0.60). Moreover, BW and average daily gain (ADG) were greater (<span>P</span> &lt; 0.01) for pHE than pLE heifers while expressed as units of BW<sup>0.75</sup>/d, neither total HP nor metabolizable energy (ME) intake differed between groups, but pHE heifers had greater retained energy (RE; <span>P</span> &lt; 0.01) and lower RHP (<span>P </span>&lt; 0.05) than pLE ones. Gross energy efficiency (RE/ME intake) was greater (<span>P </span>&lt; 0.001) for pHE than pLE heifers while the HP/ADG and RHP/ADG were reduced (<span>P</span> &lt; 0.05) and feed-to-gain ratio (ADG/DM intake) tended to be greater (<span>P</span> = 0.07) for pHE than pLE heifers. In addition, during the first breeding and calving seasons, small but significant <span>(P </span>&lt; 0.01) differences in reproductive responses between groups suggested an earlier pregnancy in pHE heifers than the pLE group, differences that disappeared during the second breeding and calving seasons. Thus, heifers sired by high-efficiency bulls measured as RFI were more efficient measured as RHP in grazing conditions, without significant differences in reproductive performance.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"63b62bd4fc88d7edee09bb0cdd0c9676fd390b2f55f376600736838b4b254905","category":"Environment"}