{"title":"Fighting for change: Afghan Women’s Cycling Team","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/challenging-paradigms-on-two-wheels-women-in-afghanistan","date":1635264377000,"content":"\n      <p>For decades, Afghan women have been depicted hiding beneath their burkas – faceless, voiceless and lacking identities of their own. This has been especially true since 1996, when the Taliban seized Kabul and took control over much of the country, causing the position of Afghan women to suffer an extreme setback. Today, prejudice against women poses a tougher challenge for the Afghan Women’s Cycling Team than any competition. Despite the fact that incessant war is slowing down significant advances in all aspects of Afghan society, keeping up the struggle – and keeping their feet on the pedals – is the only option for these women.</p>\n<div></div>\n\n<p><span>It’s a cloudy October morning and the streets of Kabul begin to stir with the loud, impersonal voice coming from the mosque on Wazir Akbar Khan Street. Ahmad and I have been waiting for the Afghan Women’s Cycling Team for over half an hour. Ahmad, who has been my programme assistant over the last few months, is starting to get nervous. Spending so much time on the street with a foreign woman is dangerous. </span></p>\n<p><span>This sense of risk is compounded by the fact that we are close to the US embassy, from which diplomatic and military vehicles – favourite targets of the Taliban – may emerge at any moment. I’m anxious too. The idea of accompanying the women’s cycling team on their training ride towards Jalalabad – 150 kilometres east of Kabul, across an unpaved and deserted rocky mountain road – would never have passed the security standards of the company I work for. I have had to lie and accept the risks. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/P1100684_1024x1024.jpg?v=1635262162\" /><br />Eventually a battered Jeep with a pile of bikes on its roof rack appears and pulls up beside us. A seemingly endless stream of people emerges from the vehicle, like a scene from a silent comedy. Everything that happens captures my attention; to see a woman in tight-fitting sportswear in the middle of the Afghan capital, where roughly 40% of women still use the burka, is a remarkable sight. While the women wait for their turn to collect their bikes, they methodically tend to the final details: carefully putting on their head scarf, helmet and gloves.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/iris-slappendel-interview\">Related: \"We can change the culture of the sport\" Iris Slappendel Interview</a></em></strong></p>\n<p><span>Some of them even touch up their makeup. I’m impressed by the pride and confidence exhibited by these women in their every gesture. It’s true that that they lack the technologically advanced and innovatively designed equipment that other national teams are often furnished with. However, by simply pedalling through the streets, these women are challenging the existing social paradigm of exclusion and repression of the female sex head-on. Each training session is a race towards change in the political and cultural perspectives of Afghanistan. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/P1100752_1024x1024.jpg?v=1635262491\" /></span></p>\n\n<p><span>The group sets off. These women, all pedalling at the same pace, project an image that many in this Afghan city consider a provocation. People turn to watch them pass, cars slow down and some men shout at them. The cyclists, well aware of what is going on around them, ignore the men’s words with dignity and aplomb. But as I watch from the window of the car, my heart shrinks. Verbal and physical abuse towards women is common on the streets of Kabul. For that reason I’d decided, several months ago, to minimise such incidents by never going out without my abaya – the typical black tunic worn in the Persian Gulf countries.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/big-idea\">Related: What's the big idea?</a></em></strong></p>\n<p><span>Paradoxically, I discovered that I actually found it pleasurable to cover myself up to my ears. Now, to my relief, we go past an industrial estate; the tension fades, the pack stretches out and the training ride begins in earnest. <br /><br /><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/P1100724_1024x1024.jpg?v=1635247640\" />During the course of the day we had the opportunity to speak to Nahid, the team’s newest member. She is a young business student who was invited to join the national team after she had created a women’s amateur cycling group online. “It all began on Facebook,” she explains between selfies, her face lit up by a charming smile. “My friends and I created a group for girls who wanted to go cycling around the city. We wanted to have fun, while promoting a cycling culture among women. It was hard for us to get organized at first, because we had no bikes. Then we managed to persuade some friends to rent their bikes to us for 50 AFN (0.70 €) a day.” </span></p>\n\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/P1100787_1024x1024.jpg?v=1635262519\" />Approximately 65% of the population of Afghanistan is under 25. It is a young society which, thanks to smartphones and social networks, has found a space for social interaction which was previously unthinkable. Facebook is so important for young people that Roshan, the main telephone company, provides, for just one dollar a month, the only data plan – possibly in the whole world – which serves exclusively to connect users to Facebook. Women like Nahid have taken advantage of this virtual space to carry out social activism.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/this-is-l39ion\">Related: Inside L39ION of Los Angeles, cycling's most exciting team</a></em></strong></p>\n<p><span>She told me that she used to write a blog about women’s rights, but points out that virtual activism on its own is not enough. In order to make progress, words must be translated into specific action: from online to offline. “A blog entry can go unnoticed or only reach a reduced audience,” she affirms. “But when we cycle through the streets everyone sees what we’re capable of.” <br /><br /><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/b75P1100658_1024x1024.jpg?v=1635247717\" />The women’s team is used to attracting attention and the riders are aware of the risks they take each time they go out to train. Sometimes they prefer to come back with the men’s team, making it easier for them to go unnoticed. Abdul Sadeq, a 60-year-old Afghan, is their enthusiastic coach and the founder and president of the Afghan Cycling Foundation. As he prepares to give the first instructions of the day, he tells us that when he took it upon himself to set up the women’s team he couldn’t persuade any of their families. He’d had to ask his daughter to train with them for a few months in order to lead by example. “Women in Afghanistan aren’t as fit as men because they have fewer opportunities to train, but they make up for it with passion and enthusiasm. They are stronger mentally.” He tells me this with a proud look on his face. </span></p>\n<p><span>In time, the women’s team has established itself and it is now made up of 24 women. Some of them have had the opportunity to compete internationally. If any of these women make it that far, they might even take part in the Rio Olympics, thus becoming the first riders to represent Afghanistan in an official competition.</span></p>\n\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/P1100411_1024x1024.jpg?v=1635247764\" />While Abdul drives – and in between calling instructions to the riders – he chats to the girl acting as his co-pilot. Ahmad patiently interprets for me each time I ask him to. Abdul and the girl speak about music, TV, her family, her studies, her parents, university and so on. Eventually, in response to my insistent requests for translations, Ahmad says: “They’re just talking about ordinary things because they’re good friends.”</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/guiding-lights\">Related: Guiding Lights, The Cyclists' Alliance new mentor programme</a></em></strong></p>\n<p>It is this type of sincere connection between individuals, as they go about their day-to-day lives, that is driving social change in Afghanistan. Such relationships transcend prejudices relating to age, sex, ethnicity and even imposed religious norms. Based on mutual respect, humility and understanding, the honest bond between the coach and his riders is testament to the fact that the pursuit for women’s rights involves a constant pedalling forward. A more inclusive and friendlier society is possible if it is built upon a foundation of participation and compromise from men and women alike. <br /><br /><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/P1100796_1024x1024.jpg?v=1635248356\" />As we head back to Kabul a torrential rain decides to put a stop to the day’s training. Despite the confusion and lack of visibility we manage to find the riders sheltering by the side of the road. Ahmad helps load up the bikes while I organize the Jeep and get everyone settled in to their seats. It might seem as if we are ending the day as it began: a battered Jeep, an endless stream of people squeezed into it, a pile of bikes on the roof rack. But the truth is that after spending the day with this group of riders nothing seems the same; the anxiety and fear have been washed away by the wellspring of courage, exertion and teamwork.</p>\n<p>Many of my own prejudices regarding the future of Afghanistan have been left behind on the road to Jalalabad. It may well be that this team will win an important international prize one day, but meanwhile, here in Afghanistan, they are already wearing the yellow jersey during the first stage of the race towards social inclusion. As Master Murakami has written: “In long-distance running the only opponent you have to beat is yourself, the way you used to be.”</p>\n<p><em>*The photographs taken for this report are credited to a photographer who has prefered to remain anonymous</em></p>\n<p><em>*Translation from Spanish by Benjamin Palmer  </em></p>\n<p><strong><em>This article first appeared in Issue 6 of<a href=\"https://www.rouleur.cc/es/pages/volata-home\"> Volata Magazine</a></em></strong></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"63b727c528397d9498786b534f1450e75c9e4e2ea7620c3a67da284ce757c76f","category":"Cycling"}