{"title":"Stakeholders&rsquo; Perceptions of the Peer-to-Peer Energy Trading Model Using Blockchain Technology in Indonesia","link":"https://www.preprints.org/manuscript/202408.1838/v1","date":1724722354000,"content":"The energy transition towards Net Zero Emission by 2060 hinges on the renewable energy power plants in Indonesia. Good practices in several countries suggest a peer-to-peer (P2P) energy trading system using blockchain technology, supported by renewable energy (solar panels), an innovation to provide equal access to sustainable electricity while reducing the impact of climate change. The P2P energy trading concept has a higher social potential than the conventional electricity buying and selling approach, such as that of PLN (the grid management concept), but does not have a sharing element. This model implements a solar-powered mini-grid system and produces a Smart Contract that facilitates electricity network users to buy, sell, and trade electricity in rural areas via smartphones. This study aims to analyze the stakeholders' perceptions of the peer-to-peer (P2P) energy trading model using blockchain technology in Gumelar District, Banyumas Regency, Central Java Province, Indonesia. The stakeholders include households, the Ministry of Energy and Mineral Resources (ESDM), the State Electricity Company (PLN), the Institute for Essential Services Reform (IESR), Awina Company, and IPB University. The strength factors of this model are the freedom to generate and sell electricity (0.1) and transparency in electricity usage and sales by disclosing the amount, duration, and price of electricity (0.1). Regarding weakness factors, this model is primarily suitable for the lower middle class residing in rural or remote areas (0.02). Additionally, the intermittent electricity production to meet the substantial demand is a weakness (0.03). The opportunity factor for the model is the increase in public awareness and cooperation in using environmentally friendly, pollution-free electricity (0.12). Furthermore, there is an opportunity for additional income (0.12) and new business investment (0.12). Regarding threat factors, the model faces significant threats from the implementation aspect involving multiple parties (0.04). There is a potential threat in the form of losses for state utilities such as PLN or individuals who have already established electricity infrastructure if this program is implemented on a large scale (0.04). This model is located at the coordinate point (-0.40; 0.31), placing it in quadrant II. This indicates that the model should apply the Stability Strategy and focus on the Selective Maintenance Strategy for improvement. The stability strategy goal is to maintain the current situation by leveraging opportunities and addressing weaknesses. For effectiveness and efficiency, the strategy emphasizes fostering collaboration with PLN, which holds the legal authority as the sole utility company in Indonesia with an extensive electricity network, as well as advocating for regulations that support the independent purchase and sale of solar-powered electricity, particularly in areas without PLN network coverage.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"63b9765f1a4b84a4f87792431d30a94a6ca746c65f8c2d85a42bcd412a70e93d","category":"Interdisciplinary"}