{"title":"A Clubhouse bug let people lurk in rooms invisibly","link":"https://arstechnica.com/?p=1759717","date":1619187971000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/clubhouse-list-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/clubhouse-list.jpg\">Enlarge</a> (credit: Sam Whitney | Wired | Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p><span>“Basically, I'm going</span> to keep talking to you, but I’m going to disappear,\" longtime security researcher Katie Moussouris told me in a private Clubhouse room in February. “We'll still be talking, but I'll be gone.” And then her avatar vanished. I was alone, or at least that's how it seemed. “That’s it,\" she said from the digital beyond. \"That's the bug. I am a fucking ghost.”</p>\n<p>It's been more than a year since the audio social network Clubhouse debuted. In that time, its <a href=\"https://www.wired.com/story/inside-clubhouse-audio-app-paul-davison-rohan-seth/\">explosive growth</a> has come with a panoply of <a href=\"https://www.wired.com/story/clubhouse-privacy-security-growth/\">security, privacy, and abuse issues</a>. That includes a <a href=\"https://www.lutasecurity.com/post/new-clubhouse-security-vulnerabilities-could-happen-to-any-growing-unicorn\">newly disclosed</a> pair of vulnerabilities, discovered by Moussouris and now fixed, that could have allowed an attacker to lurk and listen in a Clubhouse room undetected or verbally disrupt a discussion beyond a moderator's control.</p>\n<p>The vulnerability could also be exploited with virtually no technical knowledge. All you needed was two iPhones that had Clubhouse installed and a Clubhouse account. (Clubhouse is still only available on iOS.) To launch the attack, you would first log in to your Clubhouse account on Phone A and then join or start a room. Then you'd log in to your Clubhouse account on Phone B—which would automatically log you out on Phone A—and join the same room. That's where the problems started. Phone A would show a login screen but wouldn't fully log you out. You'd still have a live connection to the room you were in. Once you “left” that same room on Phone B, you would disappear but could maintain your ghost connection on Phone A.</p></div><p><a href=\"https://arstechnica.com/?p=1759717#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1759717&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"63ba641cdd4cf0d1b737b3b36db5812c0ab55a186084fd69abf90b42a297badb","category":"Tech"}