{"title":"The influence of salinity on egg incubation and early larval development of the flameback angelfish Centropyge aurantonotus","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16130?af=R","date":1668758400000,"content":"<h2>Abstract</h2>\n<p>Larval mortality constitutes the major bottleneck in <i>Centropyge</i> species aquaculture. Marine fish eggs and larvae are sensitive to abiotic conditions variations, as salinity. Captive natural spawning of <i>Centropyge aurantonotus</i> were used to evaluate effects of salinity on eggs and larvae up to 72 hours post hatch (hph). Eggs were transferred from 33‰ to 10‰, 15‰, 20‰, 25‰, 30‰, 35‰ and 40‰ salinity, 27 ± 0.2°C. Buoyancy, water column distribution, incubation period and hatching rate were evaluated in eggs. For larvae, swimming behaviour, water column distribution, survival rates, standard length, yolk sac and oil drop volume, conversion rate of yolk sac in growth, pigmentation, deformities, mouth size and eye diameter were examined. The buoyancy was positive at salinities &gt;30‰, positive to neutral at 30‰ and negative at &lt;30‰. Neutrally buoyant eggs and larvae showed greater water column distribution than positive and negatively buoyant ones. Swimming behaviour was active in positive and neutral buoyancy. Incubation period was inversely proportional to salinity increase. Hatching rate was higher at 30‰, when compared to 10‰ and 15‰. At 10‰–25‰, deformities and high mortality rates of larvae were observed. Between 30‰ and 40‰, larvae of 72 hph showed no deformities, active swimming behaviour, higher survival rate (~87%), greater mouth size (~129.81 μm) and eye diameter (~170.1 μm) than 10‰ and 15‰. Salinities between 30‰ and 40‰ were adequate for rearing <i>C. aurantonotus</i> eggs and larvae up to 72 hph, 30‰ salinity increased their water column distribution and optimized hatching rate and adverse effects occurs at 10‰–25‰.</p>","author":"Ksenia Skorupa, \nRaoani Cruz Mendonça, \nSergio Leandro Araújo‐Silva, \nDanillo dos Santos Santana, \nJonathas Rodrigo dos Santos Pinto, \nMônica Yumi Tsuzuki","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"63bfa25d7a08c17d41dfea2dbbc086d86317b98a23ab484bc97e0a01bb1de9d5","category":"Environment"}