{"title":"Limited effects of culling on the behavior of invasive lionfish (Pterois miles) in the Mediterranean","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15686?af=R","date":1707779408000,"content":"<h2>Abstract</h2>\n<p>Invasive species pose serious threats to ecosystems. To reduce ecological and economic consequences of invasions, efforts are made to control invaders and evaluating the effects of such efforts is paramount. Lionfishes (<i>Pterois volitans</i> and <i>Pterois miles</i>) are native to the Indo-Pacific Ocean and pose a major threat to local ecosystems in the invaded Atlantic and Mediterranean. Culling via spearfishing is a widespread measure to limit lionfish population size in invaded ranges. However, like most hunted fishes, lionfish alter their behavior after repeated culling, potentially decreasing the effectiveness of future culls. Previous studies on lionfish in the Caribbean have shown that lionfish are less bold after repeated culling. However, the impact of culling on lionfish in their newest invasive range, the Mediterranean, remains enigmatic. To determine the behavioral changes in response to culling in this second area of invasion, we tested for effects of culling on the behavior of lionfish in Cyprus, a region heavily impacted by the lionfish invasion in the Mediterranean. We compared the response of lionfish to an approaching free diver holding a metal pole (imitating a spear fisher) between protected areas where spearfishing is restricted and areas where culls are frequently conducted. We also assessed whether activity, hiding pattern, and site fidelity differed between these culled and unculled sites. Overall, we found limited effects of culling on the traits measured, indicating surprising resistance to culling-induced behavioral changes in Mediterranean lionfish. Future studies should monitor invasive lionfish population densities and the effects of culling in more detail to tailor management plans and reduce the negative effects of these fish in specific invaded ranges.</p>","author":"Elizabeth W. Phillips, \nDavide Bottacini, \nAnna N. M. Schoonhoven, \nYnze J. J. Kamstra, \nHannah De Waele, \nCarlos Jimenez, \nLouis Hadjioannou, \nAlexander Kotrschal","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"63cbfd1987b1e762fa51e7bfdbf791a7760cefc498123cdf9f221c19ec75620f","category":"Environment"}