{"title":"183 Comparison of presynchronization and OvSynch protocols following fixed-time breeding in lactating dairy cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/313/7757425?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Current study was carried out to compare two presynch-OvSynch protocols with standard OvSynch protocol in postpartum Holstein dairy cattle. Postpartum cows (n = 473) were randomly divided into one of the three protocols: I) G7G-OvSynch (n = 159), cows were subjected to PGF2α followed by GnRH 48 h later. After 7 d post-GnRH injection, standard OvSynch protocol was introduced, II) G7GM-OvSynch (n = 162), cows were subjected to the same protocol as in group I) except one extra PGF2α at 12 h interval in Ovsynch part, and III) standard OvSynch protocol (n = 152). The progesterone (P4) profile was subjected to d 30 and d 60 post FTAI. Ovarian status was monitored at the 1<sup>st</sup> GnRH, PG, and 2<sup>nd</sup> GnRH injection of the breeding part. Pregnancy/ AI was diagnosed on d 30,60, and 90 post-FTAI, and pregnancy loss was also on d 60 and 90 post-FTAI. Pregnancy data were analyzed using the Chi-square test and plasma P4 profile by ANOVA using SAS. Ovulatory follicle diameter (mean ± SD) was 15.44 ± 1.24 in G7G-Ovsynch, 15.21 ± 1.36 in G7GM-OvSynch, and 14.90 ± 1.02 in OvSynch, respectively (<span>P</span> &gt; 0.05). Plasma P4 profile (ng/mL; Mean ± SD) on d 30 post TAI was 6.50 ± 1.39,7.01 ± 1.13 and in 6.49 ± 1.32 G7G-OvSynch, G7GM-Ovsynch and OvSynch groups, respectively (<span>P</span> = 0.09). On d 60 post TAI, P4 profile was recorded to be 7.75 ± 1.20, 7.58 ± 1.36 and 6.80 ± 0.96 in G7G-OvSynch, G7GM-OvSynch and OvSynch, respectively (<span>P</span> &lt; 0.05). P/AI on d 30 was 51.57% (83/159), 57.41% (93/162) and 42.76% (65/152) G7G-Ovsynch, G7GM-OvSynch, and OvSynch, respectively (<span>P</span> = 0.033). Similarly, AI on d 60 and d 90 post FTAI was 44.65% (1/159):51.85% (84/162), 38.16% (58/152): 43.40% (69/159) and 51.23% (83/162):36.18% (55/152) in G7G-Ovsynch, G7GM-OvSynch, and OvSynch protocols (<span>P</span> = 0.051: 0.027), respectively. Pregnancy loss on d 60 and d 90 post FTAI was 13.41%: 2.90%, 9.68%: 1.20% and 10.77%: 5.20% in G7G-Ovsynch, G7GM-OvSynch, and OvSynch, respectively (<span>P</span> = 0.73: 0.35). Although statistically non-significant (<span>P</span> = 0.56), overall pregnancy loss on d 90 post-FTAI was also numerically greater in the G7G-OvSynch (15.85%) protocol as compared with G7GM-OvSynch (10.75%) and OvSynch (15.38%). We concluded that the G7GM-OvSynch protocol has resulted in an increased P/AI, P4 profile in comparison with G7G-OvSynch and OvSynch. Similarly, pregnancy loss was also less in the G7GM-Ovsynch protocol, which makes it a protocol of choice for postpartum dairy cows.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"63d0754ec20bd18cbe08ba2c6f521ccc5c2c533948909df68959d89b667ccd76","category":"Environment"}