{"title":"Melanoma Brain Metastases Patient-Derived Organoids: an in Vitro Platform for Drug Screening","link":"https://www.preprints.org/manuscript/202407.0598/v1","date":1720422263000,"content":"Background and aims: Brain metastases are prevalent in the late stages of malignant melanoma. Multimodal therapy remains challenging. Patient-derived organoids (PDOs) represent a valuable pre-clinical model, faithfully recapitulating key aspects of the original tumor, including the heterogeneity and the mutational status. This study aimed to establish PDOs from melanoma brain metastases (MBM-PDOs) and to test the feasibility of using them as a model for in vitro targeted-therapy drug testing.Methods: Surgical resection samples from eight patients with melanoma brain metastases were used to establish MBM-PDOs. Samples were enzymatically dissociated followed by seeding into low-attachment plates to generate floating organoids. The MBM-PDOs were characterized genetically, histologically, immunohistologically and compared with the parental tissue. The MBM-PDO cultures were exposed to dabrafenib (BRAF inhibitor) and trametinib (MEK inhibitor) followed by cell viability assessment.Results: Seven out of eight cases were successfully cultivated, maintaining the histological, immunhistological phenotype, and the mutational status of the parental tumors. Five out of seven cases harbored BRAF V600E mutations and were responsive to BRAF and MEK inhibitors in vitro. Two out of seven cases were BRAF wild type, one case harboring an NRAS mutation and the other harboring a KIT mutation, and both were resistant to BRAF and MEK inhibitor therapy. Conclusion:We successfully established PDOs from melanoma brain metastases surgical specimens, which exhibited a consistent histological and mutational profile with the parental tissue. Using FDA-approved BRAF and MEK inhibitors, our data demonstrates the feasibility of employing MBM-PDOs for targeted-therapy in vitro testing.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"63ed0cb24b3628326393ca2be2c4b1e4a4c9f6419e297a9a9086e9d31bfe63c8","category":"Interdisciplinary"}