{"title":"82 Effects of a red-clover containing mineral on heifer behavior and fertility","link":"https://academic.oup.com/jas/article/102/Supplement_1/27/7617933?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Heat stress reduces reproductive efficiency in beef cattle. Recent evidence suggests that supplementation of red clover can alleviate the physiological impacts of fescue toxicosis which could decrease heat stress. Our objective was to determine the effect of supplementing heifers grazing endophyte-infected tall fescue (E+ TF) with a conventional mineral containing red-clover leaf. We hypothesized that heifers supplemented with the red-clover leaf mineral would have greater conception rates to AI (CRAI) in times of possible heat stress compared with heifers supplemented with conventional mineral. A grazing study was conducted from May – August in 2021, 2022, and 2023. Yearling beef heifers (n = 32, 36, 40 heifers yr<sup>-1</sup>, respectively) were blocked by body weight, hair coat score and color into 4 grazing blocks that were assigned to 1 of 2 treatments (2 blocks treatment<sup>-1</sup>): 1. conventional non-medicated loose mineral control (0%-RC), or 2. conventional loose mineral + 20% wt/wt red clover leaf (20%-RC). Mineral treatments were provided in ground, 3-compartment mineral feeders ad libitum. Each grazing block was assigned to four, 0.8- ha. pastures consisting of predominantly E+ TF and were rotationally managed over the course of the study. Each year estrus was synchronized suitable for fixed time AI in May and all heifers resynchronized in June. In addition, each heifer was fitted with an ear-tag sensor (CowManager SensOor, Agis Automatisering BV, Harmelen, the Netherlands) for continuous behavioral monitoring (including high activity and activity). The CRAI were analyzed with the GLIMMIX procedure of SAS using the binomial distribution link logit function (v.9.4., SAS Inst. Inc., Cary, NC). Total daily activity and high activity reported by CowManger during May and June were analyzed by the MIXED procedure with repeated measures of SAS. The CRAI were similar for 20%-RC (67.30 ± 9.80%) and 0%-RC (60.70 ± 9.80%) heifers following the first service of AI (P = 0.51) during a thermoneutral period in May. In contrast, CRAI was greater (P = 0.02) for 20%-RC heifers (48.67 ± 13.47%) than CM (15.10 ± 13.47%) in June when temperatures increased to potential heat stress levels. Overall, conception rate after two rounds of AI for 20%-RC (78.30 ± 9.30%) heifers tended to be greater (P = 0.08) than CM (62.20 ± 9.30 %). While high activity (associated with estrous behavior) reported by CowManager did not differ between treatments (20%-RC: 203.94; 0%-RC: 213.90; SEM: 8.65 min d<sup>-1</sup>; P = 0.25), normal daily activity of 20%-RC heifers (150.69 ± 10.40 min d<sup>-1</sup>) tended to be greater (P = 0.06) than CM (126.33 ± 8.65 min d<sup>-1</sup>). Results of this study suggest supplementing red-clover containing mineral may mitigate negative effects of consuming E+ TF including decreased conception rates during times of heat stress.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"63ed43415bd91dc68bee17ae43b4db7604b668d443a8ee930b4f39b545c14f38","category":"Environment"}