{"title":"‘It’s hard to wrap my head around’ - Derek Gee on his breakthrough Giro, bird-watching, and the next chapter","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/it-s-hard-to-wrap-my-head-around-derek-gee-on-his-breakthrough-giro-bird-watching-and-the-next-chapter","date":1686668247000,"content":"\n      <p><span>“I'd love to sit here and say I believed in myself before the race but I probably didn't. If you take my results from the season before the Giro, that's almost what I was expecting, to be a mid-pack – towards the back of the pack – kind of rider. I was hoping to just make it to Rome.”</span></p>\n<div></div>\n<p><span>Some people renamed this year’s <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> the Gee-ro in his honour. Despite not taking any stage wins in the end, it was Derek Gee’s name that was trending on Twitter when the race concluded. From a relatively unknown rider at the start of the race, he became one of the Giro’s key protagonists, loved and respected by many for his boundless enthusiasm and zeal in the face of foul weather and tough mountains. People wanted Gee for interviews, for photos, for autographs. Articles were written, posts were published in admiration. For the man himself, it was all a little bit strange.</span></p>\n<p><span>“It was a really weird experience,” Gee says, speaking from back home in Canada a few weeks after the Giro d’Italia has concluded. “Usually the only stuff that's written about me is by a Canadian cycling outlet as they’re the only ones who want to speak to me. Just be scrolling Twitter and seeing someone's written something about me, it was a very strange experience. At first it was like, wait a minute, that's not how this works.”</span></p>\n<p><span>It was on stage eight that the Italian whirlwind which has changed Gee’s life forever started to build. Finding himself in the winning breakaway on the rolling roads to Fossombrone, the Israel-Premier Tech rider finished in second place on the stage behind the Irishman Ben Healy, surprising not only himself, but fans and his own team with his performance.</span></p>\n<p><span>“At the end of that stage, I was like, my Giro is a success. From this point on, it doesn't matter what happens. It was my biggest result by a massive margin. It honestly felt like I had won a stage. That's how happy I was. Especially because Ben Healy was so far up the road, it wasn't a second place where I felt like I had lost the stage, I managed to finish in the best place that I could have,” Gee says. “After that, I assumed nothing would happen for the rest of the race.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-SWpix-Giro-3072_1024x1024.jpg?v=1686657949\" alt />The 25-year-old’s assumption could not have ended up being further from the reality of the next two weeks of racing. Two days later on stage 10, Gee finished in second place once again, this time behind prolific breakaway specialist Magnus Cort. Then, on the shortened stage to Crans-Montana, the Canadian rider secured a fourth place on the category one climb to the finish. The next day it was a second place behind Nico Denz on the flatter roads to Cassano Magnago, then another fourth place on stage 18 and another second place on stage 19. By the time he reached Rome, Gee was also second in the points classification and second in the mountains classification, not to mention 22nd on the general classification. It was some Grand Tour debut, alright.</span></p>\n<p><span>“I was just happy to be there and thought, why not take every opportunity?” Gee reflects. “Part of it was circumstance too, the fact that the team lost our GC guy, which was unfortunate, but I think we made the best of it. It gave us all a little more freedom to go for stages. The stages got harder and harder as the race went on. So I thought, you know, I’ve got nothing to save the legs for I might as well go all in. And then it was the same thought process the next day and the next day and the next day.”</span></p>\n<p><span>Gee’s performances were not only impressive for his relentless ambition to keep trying to make it into the breakaway consistently when the opportunity came, but also for the huge variety of stages in which he was able to perform. Weighing 75kg, Gee – who comes from track racing originally – still was able to climb with some of the very best in the mountains, as well as pull hard turns on the flat roads. How does he do it?</span></p>\n<p><span>“I honestly have no idea,” he laughs. “At 75 kilos, it's pretty clear I'm not a climber but I think I think the biggest thing was just that I was able to recover really well. I still had good legs on stage 19 and the other mountain stages were all pretty far into the race. I don't think I could have replicated those performances in the first week. I don't have those numbers to be up there with the best climbers when everyone's fresh. I think it was just a case of we're really far into the race. It's been raining for two weeks. Everyone's pretty rundown and I think I just recovered really well. That's why I was able to perform in the mountains when maybe, physiologically, it didn't make a lot of sense.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-Giro-2842_1024x1024.jpg?v=1686657965\" alt />Despite his results which undoubtedly exceeded anyone’s expectations of him during the race, there is no ignoring the underlying niggle that second place is perhaps one of the most frustrating positions to finish in sport. Gee’s Giro was impressive, but to be so close to the stage win on so many occasions comes with a slight sting.</span></p>\n<p><span>“The closest one was the stage with Nico Denz but I really wasn't the strongest. It looks like if I had launched my sprint a little earlier I could have had him but he just started to fade. I was full sprinting the whole time I was only able to come out of the wheel because he was fading towards the line. It wasn't bad timing or anything on my part,” Gee says. “The Magnus Cort one I think about a lot. I think, what if I had waited for the sprint? But then if I had waited for the sprint, and not attacked and lost anyway, I would have been saying, of course I'm going to lose that sprint, I should have tried something earlier. It's really hard looking back because if you lose it, you always think you made a mistake. But if I had lost it a different way, I would have been thinking the exact same thing.”</span></p>\n<p><span>Although there was no victory, Gee’s performances were impressive enough to earn him a five year contract extension with Israel-Premier Tech, a team which he sees as the perfect place to develop as a rider thanks to its Canadian roots. “Canadian management is really important to me,” Gee says.</span></p>\n<p><span>It’s fair to say that he exudes national pride for his country. When he secured his breakthrough result on stage eight of the Giro d’Italia, it wasn’t a pay bonus or contract extension Gee was thinking of, but instead, the opportunity to race in Canada’s premier WorldTour races at the end of the season.</span></p>\n<p><span>“The first thing I did as soon as I got a couple of results at the Giro was ask to be put on the Quebec, Montreal roster. To me, those are the biggest races of the year. I went to the first editions in 2010 and I've always wanted to race them, and they weren't on my calendar this year. Hopefully I'll be there racing in front of the home crowd,” Gee says.</span></p>\n<p><span>It was fellow Canadian rider Mike Woods, someone who Gee was inspired by growing up, who pushed for the younger rider to be in Israel-Premier Tech’s team for the Giro d’Italia this year altogether. “They added me to Tirreno-Adriatico and I was riding well there, helping Mike,” Gee explains. “Mike was the one who went to management and said, hey, he’s riding really well, I think we should try and get him a Grand Tour this year. I'm really grateful for that, that’s how I got the opportunity.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography--Giro-d_Italia-2023---Stage-14-01660_1024x1024.jpg?v=1686657988\" alt />The opportunity to ride in a Grand Tour is one thing, but Gee’s opportunity to turn professional almost slipped out of his grasp altogether a few years ago, when he considered leaving racing for good.</span></p>\n<p><span>“Growing up, I wanted to go pro more than anything. I watched the Tour when I was six years old. I had a poster of Alessandro Petacchi on my wall. When I got to second year junior, I had some success but I didn't believe that I could go pro. I wanted a real job,” Gee says. The Canadian rider decided to go to university to study Life Sciences with the aim of going to medical school instead of pursuing a career on the bike.</span></p>\n<p><span>“It took me stepping away for this semester at university to realise that I liked cycling a whole lot more than I liked full-time education. Pretty quickly I realised I missed racing.”</span></p>\n<p><span>Gee returned to join the Canadian track programme in 2016 and his career progressed from there with the aim of making it to the Olympics in 2020. After that, the road racing came. Gee signed with Canadian Continental Team, XSpeed United Continental and his results got him noticed by Israel-Premier Tech’s development team who he rode for in 2022. It was in February last year that Gee signed a contract with the WorldTour team, with the coaches at Israel quickly spotting his potential after he secured a fifth place finish on the time trial stage of Gran Camiño.</span></p>\n<p><span>“They offered me three years and said: we don't know what kind of rider you're going to be. It will probably take you a couple of years to get used to this level of racing and get results but we're going to offer you a long term contract and just put you in a variety of different races to see where your strengths are. That was really appealing to me,” Gee explains.</span></p>\n<p><span>Now signed with the team until 2028, Israel-Premier Tech are undoubtedly delighted that they took a chance on the kid from Ottawa a few years ago, who is one of their brightest hopes for the future.</span></p>\n<p><span>For Gee, the rest of the season will see a focus on the track racing at the World Championships, as well as those coveted Candian WorldTour races he dreams of winning on home soil at the end of the year.</span></p>\n<p><span>There’s also the challenge of dealing with his newfound fame and the expectations that come with that. “It's hard to wrap my head around. I still think of myself as the rider from before the Giro. I’m trying to understand how the Giro has changed where my limits are. I think the next couple of years will be figuring that out,” he says.</span></p>\n<p><span>It doesn’t seem like remaining level-headed is going to be a challenge for the Canadian who is charmingly humble in all of his answers to my probing questions. He speaks about how bird watching is a favourite past-time of his, and he keeps a list of every bird he sees. Since he’s been home in Canada recovering from the Giro, Gee says he’s been doing “a whole lot of nothing,” enjoying cafe rides with friends and a slice of normality again.</span></p>\n<p><span>Still, there are some reminders at home about his newfound fame: “I’ve been sitting at a coffee shop with my buddy and telling him about the race when someone comes up and asks for a picture,” Gee says. “Also like cyclists turning around on their ride to come catch up to me and just say, hey I’m a big fan and what you did at the Giro was really cool. That's all definitely new and weird to me.”</span></p>\n<p><span>The Giro d’Italia has undoubtedly introduced the cycling world to Gee and confirmed that he is one of the most talented riders of his generation. Still, though, with his focus on track riding combined with his ability to climb in the high mountains, the future of Gee’s career is a bit of a mystery. Will he go for Grand Tours? One-day races? Olympic medals on the velodrome? It remains to be seen. </span></p>\n<p><span>One thing is for sure, though, there’s a lot more to come from Derek Gee.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"63f0b440a7be1f5d416d78b337aaf007aae2132660e1503b00ad755262eb4a22","category":"Cycling"}