{"title":"KCNK1 promotes proliferation and metastasis of breast cancer cells by activating lactate dehydrogenase A (LDHA) and up-regulating H3K18 lactylation","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002666","date":1718978400000,"content":"<p>by Xiangchan Hou, Jiawei Ouyang, Le Tang, Pan Wu, Xiangying Deng, Qijia Yan, Lei Shi, Songqing Fan, Chunmei Fan, Can Guo, Qianjin Liao, Yong Li, Wei Xiong, Guiyuan Li, Zhaoyang Zeng, Fuyan Wang</p>\r\n\r\nBreast cancer is the most prevalent malignancy and the most significant contributor to mortality in female oncology patients. Potassium Two Pore Domain Channel Subfamily K Member 1 (KCNK1) is differentially expressed in a variety of tumors, but the mechanism of its function in breast cancer is unknown. In this study, we found for the first time that KCNK1 was significantly up-regulated in human breast cancer and was correlated with poor prognosis in breast cancer patients. KCNK1 promoted breast cancer proliferation, invasion, and metastasis in vitro and vivo. Further studies unexpectedly revealed that KCNK1 increased the glycolysis and lactate production in breast cancer cells by binding to and activating lactate dehydrogenase A (LDHA), which promoted histones lysine lactylation to induce the expression of a series of downstream genes and LDHA itself. Notably, increased expression of LDHA served as a vicious positive feedback to reduce tumor cell stiffness and adhesion, which eventually resulted in the proliferation, invasion, and metastasis of breast cancer. In conclusion, our results suggest that KCNK1 may serve as a potential breast cancer biomarker, and deeper insight into the cancer-promoting mechanism of KCNK1 may uncover a novel therapeutic target for breast cancer treatment.","author":"Xiangchan Hou","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"63f862f5f8db6904ce57d062d6cfe967cb387227e69e5c1fb5599e4fef178180","category":"Environment"}