{"title":"Submerged rigid vegetation effects on flow hydrodynamics within the pool morphology","link":"https://onlinelibrary.wiley.com/doi/10.1002/rvr2.101?af=R","date":1727108157000,"content":"<h2>Abstract</h2>\n<p>This research is centered on a comprehensive investigation into the impact of turbulence on the movement and dispersion of materials within a three-dimensional (3D) bedform, specifically when there is a continuous presence of rigid vegetation submerged in the flow. To achieve our research objectives, we conducted extensive velocity measurements within a channel featuring this submerged vegetation. The measurements were carried out using an Acoustic Doppler Velocimeter (ADV). Additionally, our study delved into the intricate structures and turbulent characteristics of the flow, considering the coexistence of submerged vegetation and a 3D gravel pool. This pool featured entrance and exit slopes measuring 3 and 2.5°, respectively. Our experimental setup took place in a straight flume, measuring 14 m in length, 0.9 m in width, and 0.6 m in depth. The flume was equipped with transparent side walls to facilitate observations. Furthermore, our investigation extended to the spatial variations in velocity and turbulence distributions. We analyzed various parameters including turbulence kinetic energy, integral turbulence lengths, dispersion coefficients, and advective transport. The results revealed that integral length scales offer key insights into turbulent eddy behavior. In the presence of vegetation and a 3D bedform, turbulent eddies undergo notable changes, flattening in the longitudinal direction and expanding in the transverse and vertical directions. Moreover, longitudinal advection is notably higher compared to flows without vegetation in a uniform flow or bare channel, especially for <i>z</i>/<i>H</i> &gt; 0.2. This indicates that the presence of vegetation and a 3D bedform leads to an increase in turbulent kinetic energy (<i>k</i> values) that surpasses the reduction in the time-averaged velocity component (“<i>U</i>”) in the <i>U</i> × <i>k</i> term, thereby enhancing longitudinal advection.</p>","author":"Kourosh Nosrati, \nHossein Afzalimehr, \nHamidreza Raeisifar, \nMohammad Nazari‐Sharabian, \nMoses Karakouzian","siteTitle":"Wiley: River: Table of Contents","siteHash":"0b74d58d2572beb2996093d38ec1aeffad4d7646e8152f056f56cbe7cdd98b36","entryHash":"63fbe33c92d8cb9233e9155a0ae3c24e1993e37e7f18d5d0107f22e02d4dee5a","category":"Environment"}