{"title":"Unpacking the ‘black box’ of suicide: A latent class analysis predicting profiles of suicidal ideation in a longitudinal cohort of adolescent girls from India","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003130","date":1715176800000,"content":"<p>by Anushka R. Patel, Kelly E. Dixon, Abhijit Nadkarni</p>\r\nIntroduction <p>Indian women account for 37% of global suicide-related deaths. As suicide is a growing concern among adolescent girls, identifying the social determinants of suicide with this group targeted prevention. We selected social determinants that include intersectional identities and broader syndemics; we then used longitudinal data from a prospective cohort of adolescent girls from Northern India to classify them into unique profiles across multiple socioecological levels.</p> Methods <p>Girls aged 10–19 (<i>N</i> = 11,864) completed self-report questionnaires measuring socio-demographic and trauma exposure variables. At three-year follow-up, they were asked to indicate current suicidal ideation (SI). We conducted latent class analysis (LCA) to classify profiles and then predicted risk of current SI at three-year follow-up.</p> Results <p>LCA supported a four-class solution: a ‘privileged’ class (Class 1; <i>n</i> = 1,470), a ‘modal’ class (Class 2; <i>n</i> = 7,449), an ‘intergenerational violence’ class (Class 3; <i>n</i> = 2,113), and a ‘psychological distress’ class (Class 4; <i>n</i> = 732). Classes significantly predicted odds ratios (OR) for SI at follow up; women in Class 4 were associated with the greatest likelihood of SI (OR 1.84, 95% CI 1.38, 2.47), suggesting that psychological distress factors confer greatest risk.</p> Conclusion <p>Results of the distinct classes of risk and protective factors indicate targets for policy-level interventions. Disrupting cycles of psychological distress and substance use, increasing access to behavioral interventions, and intervening to mitigate intergenerational violence may be particularly impactful with this population.</p>","author":"Anushka R. Patel","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"63fe4a431cca3c13b8d7a779fb6d2020daa218dac5134afd775b441cffd0fe3c","category":"Environment"}