{"title":"VEGF, but Not BDNF, Prevents the Downregulation of KCC2 Induced by Axotomy in Extraocular Motoneurons","link":"https://www.preprints.org/manuscript/202408.1125/v1","date":1723727392000,"content":"The potassium-chloride cotransporter KCC2 is the main extruder of Cl- in neurons. It plays a fundamental role in the activity of the inhibitory neurotransmitters (GABA and glycine) since low levels of KCC2 promote intracellular Cl- accumulation leading to a depolarizing activity of GABA and glycine. Downregulation of this cotransporter occurs in neurological disorders characterized by hyperexcitability, such as epilepsy, neuropathic pain and spasticity. KCC2 is also downregulated after axotomy. If muscle reinnervation is allowed, KCC2 levels recover in motoneurons. Therefore, we argued that target-derived neurotrophic factors might be involved in the regulation of KCC2 expression. For this purpose, we performed the axotomy of extraocular motoneurons by monocular enucleation of adult rats, and a pellet containing either VEGF or BDNF was chronically implanted in the orbit. Double confocal immunofluorescence of ChAT and KCC2 was carried out in brainstem sections. Axotomy led to a KCC2 decrease in the neuropil and soma of extraocular motoneurons, peaking at 15 days post-lesion, with the exception of abducens motoneuron somata. VEGF administration prevented the axotomy-induced KCC2 downregulation. By contrast, BDNF either maintained or reduced KCC2 levels following axotomy suggesting BDNF is involved in the axotomy-induced KCC2 downregulation in extraocular motoneurons. The finding that VEGF prevents KCC2 decrease opens new possibilities for the treatment of neurological disorders coursing with neuronal hyperactivity due to KCC2 downregulation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6407d1ecfade7e51c92f8a0e8cdcac464955e6bba79791834e8f3b70b1511778","category":"Interdisciplinary"}