{"title":"Debriefing the Tour of Britain 2021","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/debriefing-the-tour-of-britain-2021","date":1631550556000,"content":"\n      <p><span><span>A stunning edition of the Tour of Britain is in the books. A star-studded field, which featured Wout Van Aert,</span></span><span><span> Julian Alaphilippe,</span></span><span><span> Mark Cavendish and the retiring </span></span><span>André Greipel, meant </span><span><span>the race was always going to become one of the</span></span><span><span> most memorable in recent history.</span></span></p>\n<div></div>\n<p><span>After Chris Harper crashed out on stage 2, Team Jumbo-Visma were reduced to five riders. A critical loss, particularly with the stage 3 team time trial in mind. The Dutch outfit shed 20 seconds to the Ineos Grenadiers, whose roster boasted the likes of Rohan Dennis, <span>Michał </span>Kwiatkowski and Richie Porte riding in support of Ethan Hayter.</span></p>\n<p><span>Despite losing ground in the TTT, </span><span>Van Aert regained control on the infamously steep Great Orme headland in Northern Wales. After exchanging the leader's jersey with Hayter again</span><span>, Van Aert entered the final stage with a four-second deficit to the talented Brit.</span><span> With a sprint stage on the cards, bonus seconds would decide the eventual winner.</span></p>\n<p><span>Van Aert claimed his fourth stage of the race i<span>n Aberdeen, sealing overall victory</span>. In addition to winning the Tour of Britain at the first attempt, Van Aert equalled </span>Edvald Boasson Hagen’s race record for stage wins in a single edition. Ethan Hayter finished second overall, just six seconds behind Van Aert — he finished every stage in the top six, <span>bar stage 8</span>. Defending World Champion Julian Alaphilippe rounded out the podium.</p>\n<h4><b>Wout Van Aert confirms Flanders favourite status</b></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1338650800-min_1024x1024.jpg?v=1631539096\" /><em>Wout Van Aert wears the leader's jersey at the Tour of Britain (<span>Image credit: Harry Trump/Getty Images)</span></em></p>\n<p><span>Two weeks on from his victory at the Tour of Britain, Van Aert will lineup on home soil as a marked man. Prior to the race, the Belgian hadn't competed since Tokyo 2020 in July, but his performance has<span> cemented his status as the man to beat in Flanders.</span></span></p>\n<p><span>Julian Alaphilippe — <span>one of Van Aert’s primary rivals for the World Championships</span> — </span>is bidding to become the first back-to-back winner of the men's road race since Peter Sagan completed his three-peat in 2017. However, based on the Tour of Britain, Van Aert has a clear edge over Alaphilippe. Even on the Frenchman's specialist terrain: hills, Van Aert was able to resist <span>Alaphilippe</span>’s attacks on the <span>Great Orme</span> before sprinting to victory.</p>\n<p>Wout Van Aert is the clear favourite to become the World Champion in two weeks, which is only amplified by his performance at the Tour of Britain.</p>\n<h4><strong>Carlos Rodriguez Shines for the Ineos Grenadiers </strong></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1331648974-min_1024x1024.jpg?v=1631542145\" /></b><em>Carlos Rodriguez finished tenth overall at the Tour of Britain (Image credit: Gonzalo Arroyo Moreno/Getty Images)</em></p>\n<p><span>In a first-rate Ineos Grenadiers lineup, the two youngest riders demanded the limelight. Aside from the ever-consistent Ethan Hayter, 20-year-old Carlos Rodriguez made an impression.</span></p>\n<p><span>The Spaniard is a rising star of the pro peloton. He contributed to one of the stages of the season when he won solo on the mountainous stage 9 of the Tour de l’Avenir. Now on very different terrain — the Tour of Britain doesn’t boast a replica of the Col d’Iseran — Rodriguez continues to excel.</span></p>\n<p><span>Although he never had a chance to ride for himself, Rodriguez became Hayter’s right-hand man. This was particularly evident on stage 6, which finished in Gateshead. Here, a series of attacks exploded the peloton. Rodriguez was the single Ineos domestique to make the ten-rider selection, where he rode splendidly for Hayter. Rodriguez was forced to the front of the group often, where he neutralised attacks from Julian Alaphilippe and Mike Woods.</span></p>\n<p><span>Opportunities can be difficult to come by in a deep Ineos Grenadiers squad. Nonetheless, Carlos Rodriguez’ ever-improving ability on all terrain makes him one to watch closely.</span></p>\n<h4><b>Ethan Hayter's increasing chances with Team GB</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1339281309-min_1024x1024.jpg?v=1631538959\" /></b></p>\n<p><em>Ethan Hayter outsprints Giacomo Nizzolo to win stage 5 of the Tour of Britain in Warrington (Image credit: Alex Livesey/Getty Images)</em></p>\n<p><span>With eight victories to his name in 2021, Ethan Hayter is enjoying a phenomenal campaign. Prior to the Tour of Britain, Hayter won stages at the Volta Algarve, Vuelta a Andalucia and the Tour of Norway. After adding a stage victory in Warrington, Hayter’s eight victories place him among the top ten riders in the win column this season.</span></p>\n<p>Although Hayter is a rider for all terrains, he boasts a venomous sprint finish, which he used to defeat Giacomo Nizzolo and Mark Cavendish on stage 5. This ability means he can place himself in reduced groups, where he is often one of the fastest riders left.</p>\n<p><span>This leaves us questioning whether Hayter could have a primary role to play at the upcoming World Championships.</span></p>\n<p><b>Great Britain’s World Championships Lineup</b></p>\n<ul>\n<li><span>Tom Pidcock</span></li>\n<li><span>Luke Rowe</span></li>\n<li><span>Mark Cavendish</span></li>\n<li><span>Ben Swift</span></li>\n<li><span>Connor Swift</span></li>\n<li><span>Fred Wright</span></li>\n<li><span>Jake Stewart</span></li>\n<li><span>Ethan Hayter</span></li>\n</ul>\n<p><span>Although Team GB boast a deep squad, Tom Pidcock is the leader on paper — particularly after he outsprinted Wout Van Aert and Matteo Trentin at Brabantse Pijl earlier this season. The World Championships occur on similar terrain, so naturally, Pidcock is a contender. However, his form has waned since winning mountain bike gold at Tokyo 2020. Alternatively</span>, the recency of Hayter's form means he could be a key player for Team GB in Flanders.</p>\n<p><em><span>Cover image: Alex Livesey/Getty Images</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6408ba20c6095294c51768a6aecf524db8953b9557dadce036f059e4de6e2046","category":"Cycling"}