{"title":"&ldquo;Physical Activity Is Not the Answer to Everything, but It Is to a Lot&rdquo;: Stakeholders&rsquo; Perceived Determinants of Implementing Physical Activity Interventions for Older Adults: An Interview Study Using the Consolidated Framework for Implementation Res","link":"https://www.preprints.org/manuscript/202406.2017/v1","date":1719632188000,"content":"Although many physical activity (PA) interventions for older adults have proven ef-fective in controlled research settings, optimal implementation in real life remains challenging. This study identifies determinants perceived by stakeholders when im-plementing community-based PA interventions for older adults. We interviewed 31 stakeholders guided by the Consolidated Framework for Implementation Research (CFIR). Results showed that stakeholders are very specific about the role they can play in implementation making collaboration between stakeholders crucial. Barriers and motivators were identified in the CFIR intervention characteristics domain (relative advantage, complexity and costs, evidence quality and strength, and adaptability and trialability), in the outer setting domain (cosmopolitism, patient needs, and external policy and incentives), in the inner setting domain (implementation climate, relative priority, compatibility and organizational incentives and rewards) and in the individ-ual characteristics domain (knowledge and beliefs, and other personal attributes). An overarching theme was the stakeholders' emphasis on aiming for broad health goals in interventions, as they perceive PA as a means to reach these goals rather than an end in itself. Another overarching theme requiring attention in future implementation ef-forts is the need to tailor implementation efforts to the specific needs of older adults as the end users of the intervention.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"640f3b70d35c9617d081b63b7cf2ab20fcc0ede116d2c1cd8beadc7fabc2c142","category":"Interdisciplinary"}