{"title":"Effectiveness of Family Coping Interventions in Improving Problem-Solving Skills in the Care of Children and Adolescent Cancer Survivors during and after Treatment: A Scoping Review","link":"https://www.preprints.org/manuscript/202404.1790/v1","date":1714369664000,"content":"(1) Context: Cancer triggers significant changes in family dynamics. It is noteworthy that coping and problem-solving skills, particularly in situations involving cancer in children and adolescents, have not been adequately explored in the context of family adaptation. This study aims to analyze the effectiveness of family interventions in coping to improve problem-solving skills in parents and/or caregivers of children and adolescents during and after oncological treatment. (2) Methods: This is a scoping review following the recommendations of the Joanna Briggs Institute and the Systematic Reviews and Meta-Analyses Extension for Scoping Review (PRISMA-ScR), from 2014 to 2024, in the databases LILACS, CINAHL, SCOPUS, Web of Science, and PUBMED. (3) Results: Forty-five studies were eligible. Coping strategies were categorized as follows: (1) positive attitudes (including a sense of courage and hope, family support to enhance resilience, and future planning), (2) caregiver empowerment (involving acceptance of diagnosis, emotional distancing, and coping through religiosity), and (3) communication skills (encompassing professional communication, horizontal dialogue with healthcare teams, and sincere communication with friends and family). (4) Conclusions: Over time, families develop coping and problem-solving strategies that influence changes in family functioning patterns, aiding them in accepting, reinterpreting, and reframing ideas and feelings associated with neoplasia.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"641077ef0fa92396e5997fe988d08965b76bc0154693710f5796bf677fdf0d40","category":"Interdisciplinary"}