{"title":"Comparative time-series multi-omics analyses suggest H1.2 involvement in anoxic adaptation and cancer resistance","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002778","date":1724421600000,"content":"<p>by Juan Du, Weiqiang Liu, Meng Li, Zihao Li, Xuanjing Li, Yichen Dai, Gaoming Liu, Xiao Wang, Pingfen Zhu, Vadim N. Gladyshev, Xuming Zhou</p>\r\n\r\nThe naked mole rat (NMR), <i>Heterocephalus glaber</i>, is known as the longest-lived rodent and is extraordinarily resistant to hypoxia and cancer. Here, both NMR embryonic fibroblasts (NEFs) and their mouse counterparts (MEFs) were subjected to anoxic conditions (0% O<sub>2</sub>, 5% CO<sub>2</sub>). A combination of comparative transcriptomics and proteomics was then employed to identify differentially expressed genes (DEGs). Notably, we observed distinct levels of histone H1.2 (encoded by <i>HIST1H1C</i>) accumulation between NEFs and MEFs. Subsequent mechanistic analyses showed that higher H1.2 expression in NEFs was associated with the lower expression of its inhibitor, <i>PARP1</i>. Additionally, we discovered that H1.2 can directly interact with HIF-1α PAS domains, thereby promoting the expression of HIF-1α through facilitating the dimerization with HIF-1β. The overexpression of H1.2 was also found to trigger autophagy and to suppress the migration of cancer cells, as well as the formation of xenograft tumors, via the NRF2/P62 signaling pathway. Moreover, an engineered H1.2 knock-in mouse model exhibited significantly extended survival in hypoxic conditions (4% O<sub>2</sub>) and showed a reduced rate of tumor formation. Collectively, our results indicate a potential mechanistic link between H1.2 and the dual phenomena of anoxic adaptation and cancer resistance.","author":"Juan Du","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"6410b47fd43bdeb3b244acd08d6bdae78fea92cbb57c0445eab4505b0c85b36b","category":"Environment"}