{"title":"An Approach to Studying Emotional Responses to Sustainability Materials Taking Natural Wood and Artificial Boards as Examples","link":"https://www.preprints.org/manuscript/202410.1317/v1","date":1729101241000,"content":"Natural wood is generally perceived as expensive, while wood-based boards are cheap, but re-search has yet to explain definitively why these two materials receive such disparate evaluations. This study aimed to uncover the reasons behind this phenomenon by proposing an emo-tion-driven approach to material research. We collected 10 types of natural wood and artificial boards as experimental samples and tested 20 subjects' subjective evaluation of the samples and physiological indicators (electroencephalography and electrodermal activity). Through data analysis, we identified the relationships between the subjective and physiological data and the impact of material composition on these data. Specifically, we observed significant correlations between subjective and physiological data; however, no correlation was found between subjective and physiological valence. We also discovered that the components of materials significantly influence participants' subjective and physiological emotions. For example, materials with a rough texture elicited higher positive affectivity than those with a smooth texture, materials with coarse and mixed textures elicited higher positive affectivity than those with fine textures, and the brighter materials evoke more positive emotions in participants. This study revealed how material components influence participants' emotions and, more importantly, analyzed the processing techniques behind these components, providing a theoretical basis for the future development of high-value-added products made from wood-based boards.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"642d28af152aec6856b558534565b0d6a75972ec1cde057d21a4032c91762e2e","category":"Interdisciplinary"}