{"title":"Wilderness Parking: The Myth of Wilderness – Spencer Harding","link":"https://theradavist.com/2021/09/wilderness-parking-the-myth-of-wilderness/?utm_source=rss&utm_medium=rss&utm_campaign=wilderness-parking-the-myth-of-wilderness","date":1630584043000,"content":"<p>“Native lands, the places where California Indian tribes had interacted closely with the landscape for generations, were designated as unpopulated ‘wilderness’ areas to conform to Euro-American notions of idealized, pristine conditions that supposedly existed before contact. This assertion was, in part, built upon the idea that Native peoples were not and had not interacted in any meaningful way with significant portions of California. These systematic attempts to attack the very existence of California Indians were a means by which white settlers set out to exterminate, control, and dominate the land, flora, and fauna of Native California.” Baldy 2</p>\n<p>I’m here to share my journey toward a better understanding of the context of our public lands with the hope that it will inspire you to learn more as well. As a young bike tourist, I was shocked at the manner in which people were engaging with our public lands and held many ableist and entitled views about enjoying such places.  Originally enraged by the almost being killed by rental RVs on the road, I later became enthralled with the vignettes plastered on their sides. As I started to dig into some reading about the origins of wilderness areas and the terrible atrocities committed that created them, I became starkly aware of how little I understood of our county’s history and the formation of our public lands.  Much of the writing I was able to find disproportionately deals with our National Park system which is almost unanimously managed as wilderness areas which isn’t something that we encounter much as cyclists, especially if you are trying to ride off-road. Nonetheless, the park system became the archetype for how we manage public lands and thus is important for understanding the rest of our non-NPS lands and our broader definitions of “nature” and “wilderness.”</p>\n<p>This is an incomplete story, fragmented and open-ended. I tried to write a more complete essay (twice) and I failed. I hope these quotes and images help to tell the story of how fabricated our ideas of wilderness are and the unbelievable amount of pain that was caused in order to create the idea of wilderness. I’m no expert, nor is this the whole story. I have done my best to center Indigenous authors when possible, but I found that most of the academic writing on the subject to be penned by white male authors.  I stand on no high horse writing this piece nor do I hope that it will alleviate any guilt or anxiety inherent in my complacency in the system that has allowed and perpetuates it, but I can shine a light on the issue as a start.<span></span></p>\n<p>“The easy adoption of decolonization as a metaphor (and nothing else) is a form of this anxiety because it is a premature attempt at reconciliation. The absorption of decolonization by settler social justice frameworks is one way the settler, disturbed by her own settler status, tries to escape or contain the unbearable searchlight of complicity, of having harmed others just by being one’s self. The desire to reconcile is just as relentless as the desire to disappear the Native; it is a desire to not have to deal with this (Indian) problem anymore.” E. Tuck &amp; K.W. 9</p>\n<p>“We are still America. We know the rumors of our demise. We spit them out. They die soon.” Joy Harjo</p>\n<hr />\n<p>“The Critiques we offer — whether of environmentalism in particular or of American ideas of nature in general — are intended to encourage greater reflection about the complicated and contradictory ways in which modern human beings conceive of their place in nature.” Cronon 20</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-7.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“The settler, if known by his actions and how he justifies them, sees himself as holding dominion over the earth and its flora and fauna, as the anthropocentric normal, and as more developed, more human, more deserving than other groups or species. The settler is making a new ‘home’ and that home is rooted in a homesteading worldview where the wild land and wild people were made for his benefit.” E. Tuck &amp; K.W. Yang 6</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-3.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Wilderness hides its unnaturalness behind a mask that is all the more beguiling because it seems so natural. as we gaze into the mirror it holds up for us, we too easily imagine that what we behold is Nature when in fact we see the reflection of our own unexamined longing and desires.” Cronon 1</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-10.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Who reads an American book? Or goes to an American play? or looks at an American picture or statue? His answer was readily apparent: no one that mattered; no one European.  Even the most spirited followers of Thomas Jefferson could not be blind to the problem his argument faced.  If America was to compensate with scenic nationalism, it had better find something truly great.” Runte 14</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-21.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“The removal of Indians to create an ‘uninhabited wilderness’ -uninhabited as never before in the human history of the place reminds us just how invented, just how constructed, the American wilderness really is.”  Cronon</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-11.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“The depth of racism toward American Indians during this period may be seen in an action by President Ulysses S. Grant. In 1874, two years after signing Yellowstone National Park into existence, Grant pocket vetoed a Congressional bill outlawing bison killing. Grant would have seen the remnants of the bison herds hunted to extinction, so long as the western tribes would starve as a result.”  Kantor 10</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-1.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Advocates for Yellowstone may have thought they were preserving a wilderness area. But it is more accurate to say that they were inventing it. In Yellowstone’s case, creating wilderness meant rendering the Native Americans, who laid claim to the area, invisible when, in fact, they had long used it for hunting, fishing, and other means of survival.” Steinberg 150</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-28.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“This shift de-peopled the landscape, not just in fact, but more incredibly, in the minds of the general population. In less than a century, conservation advocates had gone from viewing the Indian peoples inhabiting lands they wished to save as a critical, even admirable component to viewing Indian inhabitants as a blight on the landscape of true wilderness.” Kantor 9</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-4.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“In search of untrodden, pristine landscapes, Grinnel relied on Blackfeet guides and followed countless Indian trails to discover area that he described as ‘absolutely virgin ground…with no sign of previous passage.’ The irony of such statements was lost on Grinnell…” Spence 78</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-18.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Secretary of the Interior Lucius Lamar felt the new national parks should be managed to preserve ‘wilderness,’ in his mind defined as uncut forests and plentiful game animals. Because Indians hunted animals and set fires, preservationists came to view them as incapable of appreciating the natural world.” Kantor 10</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-13.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Many of our national parks-in fact most of them- went through periods of indiscriminate logging, burning, livestock grazing, hunting, and predator control. Once that area became our national parks, they again ‘shifted abruptly to a regime of equally unnatural protection lightning fires, from insect outbreaks, absence of natural controls of ungulates,  and in some areas elimination of normal fluctuations of water levels.”  Runte 178</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-15.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Defining the value of wilderness in terms of animals and trees led advocates of preservation to view Indians as inherently incapable of appreciating the natural world. Hardly a key component of the wilderness condition, native peoples instead represented the one great flaw in the western landscape.” Spence 62</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-19.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Unfortunately, the fallacy of ‘unpeopled wilderness’ is codified in two of America’s most prominent pieces of conservation legislation, the National Park Service Organic Act of 1916′ and the Wilderness Act of 1964.” Kantor 4</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-22.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“The social circumstances that produced a society that enables a relatively small percentage of people to pursue extreme experiences in the wilderness include, ironically, the estrangement of people who used to live quite intimately in those same environments. The American model [for nature parks] had its origin in John Muir’s Yosemite, created by excluding the Miwok Indians, followed by the eviction of the Ute and Navajo Indians from Bryce and Zion.” Krakoff 49</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-17.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“The virgin land of the national park, showcasing nature alone, is an illusion. National parks do not preserve what the West was; they preserve a West which never was. Their creation required a complete shift of the cultural paradigm of wilderness. The original national park was to preserve the western wilderness complete as the earliest white explorers saw it. American Indian inhabitants were an important part of this vision. However, the great shift occurred, and wilderness grew apart from humans in the view of the American preservation movement. In fact, American Indians, in their subsistence use, were seen as even less capable of appreciating nature than non-whites. Justified, albeit poorly, by manifest destiny, Indian tribes were sent to their reservation ‘islands’ to die a slow death. Meanwhile, the national park became a potent symbol of natural beauty and national pride.” Kantor 23</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-25.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“The dilemma for preservationists, McFarland reminded him, was that the automobile was needed to protect natural wonders, let alone wilderness.” Runte 143</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-20.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Rather than being untouched by man, the wild of Yellowstone now requires the constant management of the park’s rangers. Also, it is quite possible that the indigenous population was essential to the evolution and balance of the Yellowstone ecosystem.” Hopson 15</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-9.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“By the time Americans as a whole came to understand the argument that Yosemite Valley had reached or exceeded its desirable limits of growth, the forces of development had themselves become entrenched as part of the Yosemite experience. Henceforth the removal of roads, houses, hotels, and campgrounds seemed to threaten both tradition and history. Certainly, the suggestion that Yosemite Valley be turned ‘back to nature’ bore distinct notes of futility and improbability.” Runte 10</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-5.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“When ‘nature’ becomes an object for visual consumption, to appreciated by the connoisseur’s eye sweeping over an expanse of landscape, there is a good chance it has already left the realm of first-hand experience and entered the category of constructed experience we can appropriately call simulation.  Ironically, then, many of the experiences that contemporary American’s most readily identify with nature- mountain views seen from conveniently located lookouts, graded trails traversed along gurgling streams, great national parks like Yosemite visited with reservations made months in advance could equally well be considered simulation.”  Hayles/Cronon 411</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-27.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Most obviously, such models (NPS) are doomed to failure when they are applied in foreign countries and thrust upon citizens who have a completely different belief system or cultural history. Following such a course amounts to cultural imperialism when it is exported internationally, raising a number of concerns.”  Hopson 7</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-24.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“As Luther Standing Bear observed in the early 1930s, ‘Only to the white man was nature a ‘wilderness,’ and only to him was the land ‘infested’ with ‘wild’ animals and ‘savage’ people. To us it was tame.’ ” Spence 133</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Rather than idolize wilderness as a nonhuman landscape, where a person can be nothing more than ‘A visitor who does not remain,’ national parks might provide important lessons about the degree to which cultural values and actions have always shaped the natural world.” Spence 139</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-16.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“The insight that we construct nature is powerful, and powerfully demonstrated by the consumption of wilderness. Yet the insight that we value nature (as problematic as that term may be) precisely because it makes us feel connected to the universal is equally forceful, and equally evident in the consumption of wilderness.” Krakoff 51</p>\n<p><img src=\"https://media.theradavist.com/uploads/2020/09/WILDERNESS-PARKING-26.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“Why should we care about nature? Because we are a part of it, and because it is nonetheless separate and distinct enough from us in the objective facts of its existence that if we are not able care-takers, much of what we seek to and in ourselves, even in the most commercialized forms of wilderness travel, will be lost. Then we will be left only with remnants of what we once considered to be nature, and therefore if the intuitions of the secular prophets and all of the latter-day-followers are correct, remnants even of ourselves.” Krakoff 53</p>\n<p> </p>\n<hr />\n<p>This issue isn’t going away because I wrote an article about it.  I will need to constantly be educating myself.  I will need to put my money where my mouth is.  I’m not going to even try to set out guidelines for decolonization as those are conversations and advice that will need to come from Indigenous people according to their guidance or demands.</p>\n<p>I have compiled a bibliography for the quotes I used in this piece below.  Secondly, I would refer you to <a href=\"https://www.instagram.com/indigenouswomenhike/?hl=en\">Indigenous Women Hike</a>, they have a great set of book recommendations and were a source of information when writing this article. Likewise, <a href=\"https://cyclistazine.com/\">Cyclista Zine</a> has another amazing set of resources for further reading. If you use their resources please pay them for their work.</p>\n<p>My own profits from this article will be donated to The <a href=\"https://www.naafnow.org/\">Native American Advancement Foundation.</a>  I would encourage others to look into local organizations that benefit Indigenous populations in their area or places they recreate.</p>\n<p> </p>\n<hr />\n<p><em>*I understand many people find the word Indian to be an offensive term and thus I have only used it when quoted. *</em></p>\n<p><small><em>Works Cited:</em><br />\n<em>Baldy, Cutcha Risling. “Why We Gather: Traditional Gathering in Native Northwest California and the Future of Bio-Cultural Sovereignty.” Ecological Processes, vol. 2, no. 1, 2013, doi:10.1186/2192-1709-2-17.</em><br />\n<em>Cronon, William. The Trouble with Wilderness: or, Getting Back to the Wrong Nature. Norton, 1995.</em><br />\n<em>Cronon, William. Uncommon Ground: Rethinking the Human Place in Nature. W.W. Norton, 1995.</em><br />\n<em><a href=\"http://scholarship.law.umt.edu/cgi/viewcontent.cgi?article=1267&amp;context=plrlr\" target=\"_blank\">Ethnic Cleansing and America’s Creation of National Parks</a></em><br />\n<em><a href=\"http://lawweb.colorado.edu/profiles/pubpdfs/krakoff/KrakoffMountainsHarvardLR.pdf\" target=\"_blank\">MOUNTAINS WITHOUT HANDRAILS . . . WILDERNESS WITHOUT</a></em><br />\n<em>Runte, Alfred. National Parks: the American Experience. Taylor Trade Publishing, 2010.</em><br />\n<em>Spence, Mark David. Dispossessing the Wilderness: Indian Removal and the Making of the National Parks. Oxford University Press, 2000.</em><br />\n<em>Steinberg, Theodore. Down to Earth: Nature’s Role in American History. Oxford University Press, 2019.</em><br />\n<em>Tuck, Eve and K. Wayne Yang. Decolonization is Not a Metaphor. Decolonization: Indigeneity, Education &amp; Society Vol. 1, No. 1, 2012, pp. 1-40</em><br />\n<em><a href=\"http://lawpublications.barry.edu/cgi/viewcontent.cgi?article=1003&amp;context=ejejj\" target=\"_blank\">The Wilderness Myth: How the Failure of the American</a></em></small></p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"6432c9669ea07ddb58f9c22f2603cebba4b0b57370b302abca0d96fcf7d11cfb","category":"Cycling"}