{"title":"The Yin and Yang of Self-Regulation in Developing Vertebrates. An Energetics Perspective","link":"https://academic.oup.com/icb/article/63/6/1099/7232504?rss=1","date":1690416000000,"content":"<span><div>Synopsis</div>All living organisms are thermodynamic open systems constantly exchanging energy with the environment to maintain organization and structure. In a state of nonequilibrium they undergo a back-and-forth pattern of self-regulation and dysregulation in energy exchange. This state of dynamic nonequilibrium can be observed during vertebrate development in which high phenotypic variation and plasticity exists, especially in the presence of stressors. While investigations of the effects of stressors on mechanisms of self-regulation are usually measured by systemic changes (e.g. metabolic rate) between baseline (control) and stimulus (or stressor), real-world stressors do not switch on and off in predictable patterns, rarely occur alone, and can be acute (short-term) or chronic (long-term). In this short review, application of two processes underlying self-regulation and dysregulation are explored, (1) allostasis, stability through change or the processes underlying self-regulation and, (2) metastasis, instability through change or the processes underlying dysregulation, to understand the effects of environmental stressors on the energetics of fish early life history stages (embryos and larvae). In mammalian physiology, allostasis theory was developed to maximize the probability of survival under stress, while reducing or limiting somatic damage. Yet, allostatic responses have energetic costs. Multiple stress responses over time result in systemic somatic damage accompanied by a loss of resilience due to an inability to self-regulate. Allostatic costs and their systemic effects on neuroendocrine, metabolic, cardiovascular, and immune systems are cumulative and understood for adults but not yet for earlier stages. Developing stages with greater challenges for allostatic self-regulation than older stages because of limited resources have higher growth rates, smaller aerobic scopes, elevated metabolic costs, tight energy budgets, and employ compensatory versus additive energy budgets. Along with high mortality, early stages are expected to exhibit decreased physiological resilience and increased vulnerability in response to stressors, but little examination of energetic strategies to preserve functional stability in the face of stressors exists. While dysregulation/metastatic processes are more difficult to document in development, they increase our understanding of how organisms exposed to chronic/multiple stressors may reach allostatic overload leading to either, (1) systemic dysfunction and/or death or possibly, (2) novel physiological adaptive states. Evaluation of factors driving the yin and yang of self-regulation and dysregulation will provide knowledge of factors triggering or retarding metastatic processes, thus identifying those that prevent or reduce their affects, important in a world undergoing rapid global change.</span>","author":"","siteTitle":"Integrative and Comparative Biology Current Issue","siteHash":"715dd1b0fb4f45600bceadb227e9b7fdf8bd9d1d7a2fd3d5e0399d2c1f410646","entryHash":"6437ce93dda0eadac3f39c87256a92bd4b437e7deca88b4b718ead171d0737a5","category":"Environment"}