{"title":"WWDC 2021 preview: iOS 15, macOS 12, Macs, and much more","link":"https://www.macworld.com/article/347851/wwdc-2021-ios-15-macos-12-watchos-8-tvos-15-macbook-pro-mac-mini-apple-silicon-m1x.html","date":1622803500000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s annual week-long conference for developers kicks off on June 7 with a keynote address at 10am PT. As it was last year, due to COVID-19, the event will be virtual this year. If you want to watch live, there are several ways, which <a href=\"https://www.macworld.com/article/342028/wwdc-2021-how-to-watch-ios-15-macos-12-macbook-pro-june-7.html\">you can find here</a>. </p>\n\n\n\n<p>Most of the biggest news and announcements that impact regular users will be outlined in the keynote and it should be a great show. Apple always showcases the features of its up-and-coming operating systems at this event, but often releases (or announces) new hardware as well. Here’s all the stuff we expect to see at WWDC ’21.</p>\n\n\n\n<h2>iOS 15 and iPadOS 15</h2>\n\n\n\n<p>Apple’s most significant product is iOS. It runs on over a billion iPhones, and brings new capabilities to more users and developers every year than anything else Apple makes. Changes to iOS policies can shift entire industries—just look at what’s happening with <a href=\"https://www.macworld.com/article/344420/app-tracking-transparency-privacy-ad-tracking-iphone-ipad-how-to-change-settings.html\">App Tracking Transparency</a>.</p>\n\n\n\n<p>While Apple now talks about iOS and iPadOS as separate entities, they are still so similar and follow the same track so much, that we’re lumping them together. Most of the features that iOS gets, iPadOS gets. We never know exactly what to expect from these updates until Apple gets on stage, but we’ve heard <a href=\"https://www.macworld.com/article/342667/ios-15-features-appearance-apps-privacy-always-on-lock-screen-security-wishlist-release-beta.html\">a few rumors</a>. Apple is said to be re-working notifications on the lock screen to give users more control and handling alerts in different ways depending on your activity. Messages is rumored to get more features (as it usually does), and we might see food tracking as part of the Fitness app. </p>\n\n\n\n<p>Apple is said to be introducing some new home screen changes specifically for iPadOS, where you’ll be able to place widgets anywhere on the home screen, even replacing all app icons if you want. We’re hoping to see some major features and enhancements to iPadOS to take advantage of the M1 processor in the iPad Pro.</p>\n\n\n\n<p>Apple already <a href=\"https://www.macworld.com/article/346966/apple-announces-a-host-of-new-accessibility-features-across-many-of-its-devices-and-services.html\">announced a bunch of accessibility features</a>, many of which will be part of iOS 15, macOS 12, and watchOS 8.</p>\n\n\n\n<h2>macOS 12</h2>\n\n\n\n<p>We know very little about what to expect from macOS 12. <a href=\"https://www.macworld.com/article/342964/macos-12-features-appearance-apps-control-center-widgets-wishlist-release-beta.html\">We have our wishlist</a>, of course, but there have been precious few leaks so far. With Apple’s transition away from Intel to Apple Silicon, macOS may start to take on more features that are only available on those products, beyond the ability to run some iPhone and iPad apps.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/macos-12-wishlist.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Why shouldn’t macOS have Wallet? Or Fitness+? Or Shortcuts?</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>We’d like to see more consolidation and crossover between macOS and iOS where it makes sense. For example, why not have the Fitness app, complete with Apple Fitness+? And we’ve wanted Shortcuts on Mac ever since it debuted in iOS 12.</p>\n\n\n\n<h2>watchOS 8</h2>\n\n\n\n<p>We’ve got plenty of items on our <a href=\"https://www.macworld.com/article/342942/watchos-8-wishlist-5-ways-to-improve-apple-watch-in-the-next-big-os-update.html\">wishlist for watchOS 8</a> (why can’t my watch notify me if I leave my phone somewhere?). We haven’t heard rumors about what actually <em>is</em> in the new update, however. Most of the gossip about upcoming Apple Watch features are tied to the actual next-generation Apple Watch hardware (<a href=\"https://www.macworld.com/article/346955/apple-watch-series-7-might-get-its-first-major-redesign.html\">Series 7</a>), which is said to feature a redesigned case and perhaps include noninvasive blood glucose measurement.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/apple-watch-s7-rumors02.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>We don’t know what features watchOS 8 will bring. Most of the Apple Watch rumors we hear are about new hardware, expected this fall.</figcaption></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/watch?v=oBJm1_Ctxg0&amp;xcust=1-1-347851-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Front Page Tech</a></div>\n\n\n\n<h2>tvOS 15</h2>\n\n\n\n<p>Apple keeps tweaking its Apple TV interface, and that probably won’t stop anytime soon. We’re unsure what new features we can expect from tvOS 15, but it wouldn’t be surprising to see the Home app make an appearance as Apple expands its efforts to make HomeKit more useful. Also, the Fitness app is only for Fitness+, but it could expand to let you see all your past workout history as it does on your iPhone.</p>\n\n\n\n<h2>New MacBook Pros with the M1X SoC</h2>\n\n\n\n<p>Apple doesn’t always announce new hardware at WWDC, but the most persistent and reliable rumors suggest we’ll hear about <a href=\"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-wwdc-apple-silicon-touch-bar-sd-card-reader-magsafe-price-release.html\">a new MacBook Pro</a>. Apple is said to be working on 14-inch and 16-inch models with an updated design. The star of the show will be a new Apple silicon processor perhaps called the M1X. It will be like the M1, but with double the high-performance CPU cores (going from 4 to 8), two to four times the GPU cores (from 8 to 16 or even 32), and maximum RAM up to a whopping 64GB. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/macbook-pro-rumors-graphic.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>Some say that the new MacBook Pros will have mini-LED displays, others say that isn’t coming until later in the year. It’s possible that Apple will announce the MacBook Pros at WWDC but they won’t be available for a few months, or we might just hear about one model with other models announced later.</p>\n\n\n\n<h2>A high-end Mac mini with M1X</h2>\n\n\n\n<p>Apple already updated the Mac mini with the M1 processor, but it still sells the more expensive Intel-based model as well. A new rumor suggests the imminent release of a <a href=\"https://www.macworld.com/article/347466/2021-mac-mini-design-processor-m1x-gpu-ram-storage-price-release.html\">newly redesigned Mac mini</a> with the same M1X processor used in the rumored MacBook Pros. In addition to this new much faster system-on-chip, the new Mac mini is said to be slimmer with a sort of “plexiglass” top, and will sport additional Thunderbolt/USB4 ports. It may also use the same magnetic power connector found on the new <a href=\"https://www.macworld.com/article/347534/24-inch-imac-review-apple-design-display-colors-storage-upgradability-price.html\">24-inch iMac</a>.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/mac-mini-graphic.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>If the price is right, this could be the ultimate tiny, quiet PC for Mac enthusiasts that bring their own keyboard, mouse, and monitor to the party.</p>\n\n\n\n<h2>Don’t forget developer sessions!</h2>\n\n\n\n<p>WWDC is, of course, a developers conference. It kicks off with an exciting keynote full of great info for regular Apple fans, but the conference is a week-long affair full of sessions and labs meant for developers to learn how to use Apple’s tools and technologies. This will include new frameworks and APIs for the upcoming operating systems, and changes to existing ones.</p>\n\n\n\n<p>Most of this stuff is way beyond the scope of what everyday users should concern themselves with, but there are often little hidden nuggets in there; small but important details that aren’t big enough to find their way into the keynote, but you’ll definitely want to know about.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"643b186760b7526c3c6674a22b479517ee7ff19c7e1366780465ea1f9730b54b","category":"Apple"}