{"title":"COVID-19, vaccination and migraine: Causal association or epiphenomenon?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308151","date":1724076000000,"content":"<p>by Hailun Jiang, Chao Zhang, Xianggang Meng, Shihao Chi, Danqi Huang, Shizhe Deng, Guang Tian, Zhihong Meng</p>\r\nBackground <p>Diverse studies have revealed discrepant evidence concerning the causal association between Corona Virus Disease 2019 (COVID-19) and COVID-19 vaccination in relation to migraines. Investigating the correlation between the former two factors and migraines can facilitate policymakers in the precise formulation of comprehensive post-pandemic interventions while urging the populace to adopt a judicious perspective on COVID-19 vaccination.</p> Methods <p>We undertook a Mendelian randomization (MR) study. The primary assessment of the causal relationship between the three different COVID-19 exposures and migraine was conducted using the standard inverse variance weighted (IVW) approach. In the supplementary analysis, we also employed two methodologies: the weighted median estimator (WME) and the MR-Egger regression. Ultimately, the reliability and stability of the outcomes were assessed via Cochran’s Q test, the leave-one-out method, the MR-Egger intercept test, and the MR pleiotropy residual sum and outlier (MR-PRESSO) test.</p> Results <p>The results indicate an absence of correlation between genetically predicted COVID-19 (①Very severe respiratory confirmed COVID-19: odds ratio [OR], 1.0000881; 95%CI, 0.999748–1.000428; p = 0.6118; ②Hospitalized COVID-19: OR, 1.000024; 95%CI, 0.9994893–1.000559; p = 0.931;③SARS-CoV-2 infection: OR, 1.000358; 95%CI, 0.999023–1.001695; p = 0.5993) and the risk of migraine. Furthermore, the MR-Egger regression and WME also yielded no evidence of COVID-19 elevating the risk of migraine occurrence. Sensitivity analysis affirmed the robustness and consistency of all outcomes.</p> Conclusions <p>The results of this study do not offer genetic evidence to substantiate a causal relationship between COVID-19 and migraines. Thus, the deduction drawn from COVID-19 genetic data is that COVID-19 vaccination is unlikely to exert an impact on the occurrence of migraines, though this conclusion warrants further investigation.</p>","author":"Hailun Jiang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"643bbf5b312790e4c3ec11d90e57e0302b7fbef22df7310d7337d64898d089b9","category":"Interdisciplinary"}