{"title":"Apple unveils ninth-gen iPad with a better screen, slimmer design, same price","link":"https://www.macworld.com/article/357617/ipad-ninth-generation-design-display-specs-price.html","date":1631640931000,"content":"<div>\n<section><div></div></section><p>Alongside the iPhone 13 and Apple Watch Series 7, Apple on Tuesday took the wraps off the new <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/09/apples-most-popular-ipad-delivers-even-more-performance-and-advanced-features/&amp;xcust=1-1-357617-1-0-0&amp;sref=https://www.macworld.com/feed\">ninth-generation iPad</a>, which brings an enhanced screen, faster processor, and a slimmer design for the same $329 price tag.</p>\n\n\n\n<p>The new entry-level iPad looks a lot like the old iPad Air, with slightly slimmer bezels all around, but still sporting a larger top bezel and chin with Touch ID button. There’s a 10.2-inch fully laminated True Tone display, and a faster A13 Bionic processor that brings a 20-percent speed bump over the A12 in the eighth-gen model. The iPad is the only tablet Apple sells that still has a home button with Touch ID.</p>\n\n\n\n<p>Around the back, the rear camera has improved autofocus and low-light performance and the front camera is now a 12MP ultra-wide camera and the new Center Stage feature on the iPad Pro. With Center Stage, the camera will keep the subject in the center of the frame by following you as you move around the room. Like before, it also comes with support for the first-gen Apple Pencil and Smart Keyboard support. </p>\n\n\n\n<p>The new ninth-gen iPad starts at 64GB of storage, double the storage of before, and is available in silver and space gray for the same $329. Preorders start today and will begin shipping next week.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"643e269a7e3453bb39b389dcd5cc50ae7ccf9bf50bb018ebada1c5f16fc4335b","category":"Apple"}