{"title":"Review: Nanoleaf's Wood-Style Hexagons Add Attractive Accent Lighting to Any Room","link":"https://www.macrumors.com/review/nanoleaf-wood-style-elements-hexagons/","date":1625849466000,"content":"<a href=\"https://nanoleaf.me\">Nanoleaf</a> in June unveiled its new <a href=\"https://nanoleaf.me/en-US/products/nanoleaf-elements/\">Elements Wood Look Hexagons</a>, which are a departure from all of the prior light panels that Nanoleaf has designed. The Nanoleaf Elements feature a textured wood-like material that can be lit up with cool or warm white light, and when off, they appear to be simple wood panels, offering a more natural look than the white plastic of prior versions.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/nanoleaf-elements-night-time.jpg\" />\r\n<br />\r\nThe Nanoleaf Elements panels are <em>not</em> real wood and are still made from a plastic material, but there is a wood-like veneer. When not lit up, the Nanoleaf Elements look reasonably enough like wood from a distance, and it's definitely a different aesthetic than the plain plastic of other Nanoleaf light panels.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-wood-design.jpg\" />\r\n<br />\r\nWhenever I do a Nanoleaf review there are always comments about what the white plastic looks like when not activated, so people who find that tacky may prefer this more subtle wood look that better blends into the home when the lights are not turned on. It's softer, calmer, and less obtrusive than the bright colors of other Nanoleaf options.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-wood-design-lights-off.jpg\" />\r\n<br />\r\nSince the Nanoleaf Elements have a wood finish, Nanoleaf has limited them to shades of white light. Unlike other Nanoleaf products, these can only be set to temperatures between 1500K (warm yellow light) and 4000K (cool blue light). There is no option to choose colors, which makes these a much more subtle lighting option than the standard Hexagons and other light panels.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-wall-white-light.jpg\" />\r\n<br />\r\nI like color so I'm a big fan of Nanoleaf's standard light panels that can be set to millions of colors, but I do appreciate the soft lighting look of the Nanoleaf Elements. Since there's a wood pattern veneer over the lights, these panels do not get as bright as the standard panels and they're best for accent lighting. They provide enough light to replace a lamp that's on the dimmer side, but you're not going to be able to use them for any kind of task lighting.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-yellow-light-wall.jpg\" />\r\n<br />\r\nThe Nanoleaf Elements have a true hexagon shape with an LED in each corner, and each LED can be individually controlled in scenes and designs, which is a departure from other Nanoleaf light panels. Because each LED can be controlled, you can make one part of a panel brighter than another, which adds another dimension of interest to the plain warm/cool lighting schemes.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-lighting-pattern.jpg\" />\r\n<br />\r\nI have trouble noticing this feature when just creating a standard static lighting scene, but it's more obvious when trying to make different effects like a fire-style light or a flickering candle-like light. It makes the lighting patterns of the Nanoleaf Elements distinctly different than standard Nanoleaf panels.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-app-scene-creator.jpg\" />\r\n<br />\r\nDesign wise, the Nanoleaf Elements Hexagons are identical to the Nanoleaf Hexagon and Triangle light panels released last year, offering the simple snap-in linking and the removable mounting plate that makes it much easier to get them off of the wall. The Hexagons come with the mounting plate already in place, so you just have to remove the adhesive backing and stick them to the wall in your desired pattern. If you don't know what you want, the Nanoleaf app has a useful Layout Assistant for generating designs.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-panel-design.jpg\" />\r\n<br />\r\nNanoleaf Elements connect to a home through a 2.4GHz WiFi connection and use <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a>, so setup is as simple as scanning a ‌HomeKit‌ code. All of the panels are the same in functionality, but there's power connector that you need to plug in somewhere and a control module, which also has some touch based control options.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-connector.jpg\" />\r\n<br />\r\nAside from the different veneer and the white light only color options, the Elements are otherwise identical to other Nanoleaf products. They're controlled through the Nanoleaf app (though can also be turned on/off through ‌HomeKit‌ and you can use them in ‌HomeKit‌ scenes), and there are features like touch responsiveness, rhythm music syncing to make them activate while music is playing, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-app-main-interface.jpg\" />\r\n<br />\r\nThey're designed to use Elements-specific scenes, but Nanoleaf has a wide selection of community-sourced scenes for its other panels, so there is a built-in feature for converting any standard scene into an Elements scene, which works okay. It's all white light, so sometimes it's hard to tell a difference between scenes, but the Nanoleaf-created scenes are unique.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-convert-pattern.jpg\" />\r\n<br />\r\nI've been using Nanoleaf panels since the first Aurora triangles came out years ago, and they're still some of my favorite HomeKit-enabled lights. There are occasional connectivity issues with most ‌HomeKit‌ products, but even my original panels are still functioning like new years later and my Nanoleaf experience has always been largely hassle free. The Nanoleaf Elements are no exception and have worked well during the weeks that I have tested them.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-white-light.jpg\" />\r\n<br />\r\nNanoleaf <a href=\"https://www.macrumors.com/2021/07/08/nanoleaf-thread-shapes-elements-light-panels/\">recently added</a> Thread border router support to its Elements panels, offering improved connectivity compared to Bluetooth and WiFi. Thread is a low power mesh network for smart devices, communicating with other Thread-enabled devices and boosting signals between them. Many modern smart home devices are adding Thread integration, so it's great to see Nanoleaf adopting the technology as well.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/nanoleaf-warm-light.jpg\" />\r\n<br />\r\n<h2>Bottom Line</h2>\r\n<br />\r\nThe Nanoleaf Elements are quite different from Nanoleaf's prior products and may appeal to a new audience - those who are looking for a more subtle ambient lighting solution that looks good on or off.\r\n<br />\r\n\r\n<br />\r\nThe wood paneling design looks attractive even if the Nanoleaf Elements are not activated, and the individual LED control offers unique functionality you won't get with other Nanoleaf products. That said, these are not going to appeal to those who love the vibrant colors of the standard Nanoleaf products, and I do feel that the cost is prohibitive at $300 for seven panels. Comparatively, the Hexagons are $200, so Nanoleaf's more refined, and grown-up lighting panels are going to cost you more money.\r\n<br />\r\n\r\n<br />\r\n<h2>How to Buy</h2>\r\n<br />\r\nA set of seven Nanoleaf Elements panels can be <a href=\"https://nanoleaf.me/en-US/products/nanoleaf-elements/#nanoleaf-shop\">purchased from the Nanoleaf website</a> for $299.99. Three panel expansion packs can be bought for $99.99.\r\n<br />\r\n\r\n<br />\r\n<em><small>Note: Nanoleaf provided MacRumors with a set of Nanoleaf Elements for the purpose of this review. No other compensation was received.</small></em><br />This article, \"<a href=\"https://www.macrumors.com/review/nanoleaf-wood-style-elements-hexagons/\">Review: Nanoleaf's Wood-Style Hexagons Add Attractive Accent Lighting to Any Room</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-nanoleafs-wood-style-hexagons-add-attractive-accent-lighting-to-any-room.2303760/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=UHE0yth5vx8:yTr6M8Za3HI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=UHE0yth5vx8:yTr6M8Za3HI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/UHE0yth5vx8\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6444427fe43620a83d76c69caee6693fc77b036beba4e5655f470bf5997e8716","category":"Apple"}