{"title":"Understanding the movement and dispersal patterns of released Fopius arisanus (Hymenoptera: Braconidae) parasitoids in a papaya orchard","link":"https://academic.oup.com/ee/article/53/3/364/7650015?rss=1","date":1713398400000,"content":"<span><div>Abstract</div>Implementation of augmentative biological control requires estimates of parasitoid dispersal from the release point to determine appropriate release density, spacing, and timing. This study evaluated the movement patterns of <span>Fopius arisanus</span> Sonan (Hymenoptera: Braconidae) parasitoids, which have historically been used to control invasive tephritid fruit flies. The wasps were released from the central point, and dispersal was monitored over time using parasitism in sentinel fruit and trap captures at 40 points radiating out from the center (15–240 m). The releases were conducted 4 times during June, July, September, and November 2006. The data showed that there were large declines in dispersal by distance. Parasitism was greatest closest to the release point, within 30 m. Parasitism was also greatest within the first 24 h of the release. After 1 wk, parasitism decreased from 41% to 1.5% within 30 m. These data correlated strongly with trap capture data, which also showed that parasitoid movement favored the SE region of our release site, roughly corresponding to the overall prevailing winds. Wind speed, relative humidity, and temperature all affected parasitoid movement during our trial, indicating the complex environmental factors that can affect release success. This is the first report of dispersal metrics for <span>F. arisanus</span>. Our findings are in agreement with other similar studies on braconid movement generally and suggest that frequent, high-density releases are most effective since the dispersal of <span>F. arisanus</span> is limited and retention in the environment is low. We discuss our results in the context of international augmentative biological control release programs.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"64530b6738b78c68762d907ea2190e3421edceafe7a1391c757cbfe19b13170b","category":"Environment"}