{"title":"Instagram และ Twitter ลบโพสต์เหตุปะทะที่เกิดกับชาวปาเลสไตน์ อ้างเป็นความผิดพลาดทางเทคนิค","link":"https://www.blognone.com/node/122652","date":1620875041000,"content":"<div><div><div><p>เหตุการณ์โลกที่กำลังตึงเครียดในช่วงนี้คือการปะทะกันระหว่างชาวปาเลสไต์และตำรวจอิสราเอล ซึ่งเป็นความตึงเครียดที่มีมานาน ชาวปาเลสไตน์ที่อาศัยอยู่ในย่าน Sheikh Jarrah โพสต์ภาพที่พวกเขาโดนขับไล่ในโซเชียลมีเดีย และพวกเขาพบว่ารูปและวิดีโอโดนลบออกจาก Instagram และบัญชี Twitter ของชาวปาเลสไตน์บางรายถูกระงับ ซึ่งทั้งสองแพลตฟอร์มออกมาตอบทีหลังว่าเป็นความผิดพลาดทางระบบอัตโนมัติ</p>\n<p>7amleh องค์กรไม่แสวงหาผลกำไรที่เน้นงานด้านโซเชียลมีเดีย ได้รับการร้องเรียนมากกว่า 200 เรื่องเกี่ยวกับโพสต์ที่ถูกลบและบัญชีที่ถูกระงับ ซึ่งเกี่ยวข้องกับโพสต์เหตุการณ์ปะทะ</p>\n<p>Instagram และ Twitter กล่าวว่าบัญชีดังกล่าว “ถูกระงับเนื่องจากระบบอัตโนมัติของเราเกิดข้อผิดพลาด” และปัญหาได้รับการแก้ไขและคืนสถานะเนื้อหาแล้ว “เราเสียใจมากที่เกิดเหตุการณ์นี้ขึ้น โดยเฉพาะอย่างยิ่งกับผู้ที่อยู่ในโคลอมเบีย, เยรูซาเล็มตะวันออกและชุมชนพื้นเมืองที่รู้สึกว่านี่เป็นการปิดกั้นเสียงและเรื่องราวของพวกเขาโดยเจตนา ซึ่งนั่นไม่ใช่เจตนาของเราแต่อย่างใด” Instagram กล่าว</p>\n<p>7amleh, Access Now และกลุ่มสิทธิทางดิจิทัลอื่นๆ รวมตัวเรียกร้องให้โซเชียลมีเดีย ใช้นโยบายการกลั่นกรองเนื้อหาที่โปร่งใส และการอ้างว่าเป็นความผิดพลาดเชิงเทคนิคนั้นไม่ใช่สิ่งที่ยอมรับได้อีกต่อไป</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f495b390f8a2696fd556d18a46bbb5d9.jpg\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f850b26a1b793ef548b7b9898de7d342.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.reuters.com/article/israel-palestinians-socialmedia-idUSL8N2MU624\">Reuters</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/instagram\">Instagram</a></div><div><a href=\"/topics/twitter\">Twitter</a></div><div><a href=\"/topics/hate-crime\">Hate crime</a></div><div><a href=\"/topics/palestine\">Palestine</a></div><div><a href=\"/topics/israel\">Israel</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"645d98013f3d1bf947778a6f911f06d5e59709ce90f34f720211a76efd1a2fc9","category":"Thai"}