{"title":"112 Nutritional, feed safety, and environmental benefits and limitations of using soybean co-products in swine diets","link":"https://academic.oup.com/jas/article/102/Supplement_2/185/7664694?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Various types of soybean co-products are used in swine diets which have benefits and limitations related to protein quality, environmental impact, and feed safety. To address these concerns for sustainable pork production, methodologies have evolved. Soybean processing and storage methods affecting protein oxidation have been studied less than lipid oxidation. Protein carbonyl concentrations were measured and compared among diverse samples of soybeans and soybean meal from different regions of the US and processed by mechanical or solvent extraction. Mechanically extracted soybean meal had greater concentrations of protein carbonyls than solvent extracted soybean meal which were associated with a greater concentration of residual oil. Soybeans and their co-products also contain antioxidants that may protect against more extensive lipid and protein oxidation. Understanding the interactions between natural antioxidants and oxidation of lipid and proteins in soy co-products is important for optimizing nutritional efficiency and health in sustainable pork production systems. Because soybean meal is a major component of swine diets, its origin and environmental footprint affects the environmental impact of feed, manure, and pork production. Using a spatially explicit lifecycle assessment of feed ingredients and regional manure management programs, we compared the effect of using four feeding programs on greenhouse gas (GHG) emissions, land use, and embedded water consumption in 3 major U.S. pork production regions assuming they would provide equal growth performance and carcass composition. Although environmental impacts varied among regions, the corn-soybean meal feeding program resulted in the greatest land and water use of all grower-finisher feeding programs, and more GHG emissions than feeding low protein amino acid supplemented (LP) diets and diets containing 8% supermarket food waste, but less overall GHG emissions than the distiller’s dried grains with solubles (DDGS) feeding program. Results from a subsequent study showed that feeding corn-soybean meal diets optimized growth performance and carcass composition while simultaneously reducing impacts on climate change, marine and freshwater eutrophication, and fossil resource use compared with feeding DDGS and LP diets. Lastly, the extended survival of infectious agents such as African swine fever virus in feed ingredients has important implications for biosecurity and prevention of transboundary transmission of swine diseases. We developed a risk-free in situ surrogate non-animal assay (RISNA) to estimate survival of ASFV in various feed ingredients and conditions, and results indicate greater thermal stability than previously observed, and comparable extended survival among corn- and soybean-based ingredients. These new insights will be useful in revising feed biosecurity protocols to prevent introduction and transmission of ASFV in feed supply chains. In conclusion, holistic assessments of feed ingredients, like our evaluation of soybean co-products, are needed to achieve a more sustainable, One Health approach to pork production.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"647cf552a3b94d317c2133db9b713490d97b795d4e88de8901efa12f32d1860b","category":"Environment"}