{"title":"Distributed Wearable Ultrasound Sensors Predicts Isometric Ground Reaction Force","link":"https://www.preprints.org/manuscript/202407.0616/v1","date":1720486510000,"content":"Rehabilitation from musculoskeletal injuries focuses on reestablishing and monitoring muscle activation patterns to accurately produce force. The aim of this study is to explore the use of a novel low-powered wearable distributed Simultaneous Musculoskeletal Assessment with Real-Time Ultrasound (SMART-US) device to predict force during an isometric squat task. Participants (N=5) performed maximum isometric squats under two medical imaging techniques; clinical musculoskeletal motion mode (m-mode) ultrasound on the dominant vastus lateralis and SMART-US sensors placed on the rectus femoris, vastus lateralis, medial hamstring, and vastus medialis. Ultrasound features were extracted, and a linear ridge regression model was used to predict ground reaction force. The performance of ultrasound features to predict measured force was tested using either the Clinical M-mode, SMART-US sensors on the vastus lateralis (SMART-US: VL), rectus femoris (SMART-US: RF), medial hamstring (SMART-US: MH), and vastus medialis (SMART-US: VMO) or utilized all four SMART-US sensors (Distributed SMART-US). Model training showed that the Clinical M-mode and the Distributed SMART-US model were both significantly different from the SMART-US: VL, SMART-US: MH, SMART-US:RF, and SMART-US:VMO models (p&lt;0.05). Model validation showed that the Distributed SMART-US model had an R2 of 0.80 ±0.04 and was significantly different from SMART-US: VL but not from the Clinical M-mode model. In conclusion, a novel wearable distributed SMART-US system can predict ground reaction force using machine learning, demonstrating the feasibility of wearable ultrasound imaging for ground reaction force estimation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"64815d07f2ab50ed9419e9b6cf5f9ed76d8a064d7b0d5f4e74afe9f923a8de09","category":"Interdisciplinary"}