{"title":"Ancient massacre site yields its victims’ DNA","link":"https://arstechnica.com/?p=1749167","date":1615561650000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/unnamed-800x847.jpg\" alt=\"Ancient massacre site yields its victims’ DNA\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/unnamed.jpg\" class=\"enlarge-link\" data-height=\"866\" data-width=\"818\">Enlarge</a> </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Archaeologists working near the small Croatian village of Potočani made a grim discovery in 2007. In a shallow pit, just a meter deep and two meters wide, they found the jumbled bones of at least 41 people. Radiocarbon dating on several of the bones revealed that they’d been in the pit for around 6,200 years. The dead included men, women, and children, from toddlers to the elderly, and it was clear that they had died violently.</p>\n<p>Thirteen of the 41 people in the pit had taken lethal blows to the sides or backs of their skulls from a mix of different weapons. Based on the shape of the injuries, these probably included stone hammers, wooden clubs, and copper axes.</p>\n<p>“The position and morphology (appearance) of the wounds strongly suggest that these people didn't run from their attackers,” archaeologist Mario Novak, of Croatia’s Institute for Anthropological Research, told Ars, “but were most probably kneeling or lying with their hands tied.” That evidence, along with the presence of so many women and children in the group, told archaeologists that they hadn’t unearthed the aftermath of a battle, but a massacre.</p></div><p><a href=\"https://arstechnica.com/?p=1749167#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1749167&comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6487a73ccbcf6ae4168808b2dc7860cea9a083a4ebdcb9d1301e1c89bf2e0cf5","category":"Tech"}