{"title":"Rasagiline Confers Neuroprotection to PC12 Cell Cultures Exposed to Oxygen-Glucose Deprivation/Reoxygenation Insult by Activating the Akt/Nrf2 Redox-Signaling Pathway and by Decreasing the Nuclear Translocation of Glyceraldehyde-3-Phosphate Dehydroge","link":"https://www.preprints.org/manuscript/202406.1966/v1","date":1719816053000,"content":"Rasagiline (Azilect®) is a selective monoamine oxidase B (MAO-B) inhibitor that provides symp-tomatic benefit in Parkinson’s disease (PD) treatment and found to exert preclinical neuroprotec-tive effects. Here, we investigated the neuroprotective signaling pathways of rasagiline in the PC12 neuronal cultures exposed to an ischemic-like insult. Exposure of neurons to oxy-gen-glucose deprivation for 4 h followed by 18 h of reoxygenation caused 40% aponecrotic cell death. Rasagiline induced dose-dependent neuroprotection by decreasing cell death and produc-tion of the neurotoxic reactive oxygen species, and reducing the nuclear translocation of glycer-aldehyde-3-phosphate dehydrogenase (GAPDH). Rasagiline increased protein kinase B (Akt) phosphorylation and decreased protein expression of the ischemia-induced α-synuclein protein, in correlation to the neuroprotective effect. Treatment with rasagiline induced nuclear shuttling of transcription factor Nrf2 and increased the mRNA levels of the antioxidant enzymes heme oxy-genase-1, (NAD (P) H- quinone dehydrogenase, and catalase. These results indicate that rasagiline provides neuroprotection in the ischemic neuronal cultures with inhibition of α-synuclein and GAPDH-mediated aponecrotic cell death, and via mitochondrial protection, as by increasing mi-tochondria-specific antioxidant enzymes by a mechanism involving the Akt/Nrf2 redox-signaling pathway. These findings may be exploited for neuroprotective drug development in PD and stroke therapy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"648c6855f20e5d0169fab79084486daeccfa16c0835bae55e3774f6f709135d2","category":"Interdisciplinary"}