{"title":"Comparison of Foraging Interactive D-prime and Angular Indication Measurement Stereo with different methods to assess stereopsis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305036","date":1717768800000,"content":"<p>by Sonisha Neupane, Jan Skerswetat, Peter J. Bex</p>\r\nPurpose <p>Stereopsis is a critical visual function, however clinical stereotests are time-consuming, coarse in resolution, suffer memorization artifacts, poor repeatability, and low agreement with other tests. Foraging Interactive D-prime (FInD) Stereo and Angular Indication Measurement (AIM) Stereo were designed to address these problems. Here, their performance was compared with 2-Alternative-Forced-Choice (2-AFC) paradigms (FInD Stereo only) and clinical tests (Titmus and Randot) in 40 normally-sighted and 5 binocularly impaired participants (FInD Stereo only).</p> Methods <p>During FInD tasks, participants indicated which cells in three 4*4 charts of bandpass-filtered targets (1,2,4,8c/° conditions) contained depth, compared with 2-AFC and clinical tests. During the AIM task, participants reported the orientation of depth-defined bars in three 4*4 charts. Stereoscopic disparity was adaptively changed after each chart. Inter-test agreement, repeatability and duration were compared.</p> Results <p>Test duration was significantly longer for 2-AFC (mean = 317s;79s per condition) than FInD (216s,18s per chart), AIM (179s, 60s per chart), Titmus (66s) or RanDot (97s). Estimates of stereoacuity differed across tests and were higher by a factor of 1.1 for AIM and 1.3 for FInD. No effect of stimulus spatial frequency was found. Agreement among tests was generally low (R<sup>2</sup> = 0.001 to 0.24) and was highest between FInD and 2-AFC (R<sup>2</sup> = 0.24;p&lt;0.01). Stereoacuity deficits were detected by all tests in binocularly impaired participants.</p> Conclusions <p>Agreement among all tests was low. FInD and AIM inter-test agreement was comparable with other methods. FInD Stereo detected stereo deficits and may only require one condition to identify these deficits. AIM and FInD are response-adaptive, self-administrable methods that can estimate stereoacuity reliably within one minute.</p>","author":"Sonisha Neupane","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6496935729e2eaa69a85b696982a6c25066e884353f06b56f9296964f8039249","category":"Interdisciplinary"}