{"title":"Peloton’s Seatpost Recall, Zwift’s Curious Steering Rebirth, and GoPro Price Drop","link":"https://www.dcrainmaker.com/2023/05/pelotons-seatpost-recall-zwifts-curious-steering-rebirth-and-gopro-price-drop.html","date":1683884141000,"content":"<p>Things have been heating up this week in the sports tech space – albeit, not all of the heating has been of the new product variety. Still, here’s a few things I found worthy to dive into deeper.</p>\n<h3><span>Peloton Seat Post Recall: </span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/05/clip_image001.jpg\"><img title=\"clip_image001\" src=\"https://media.dcrainmaker.com/images/2023/05/clip_image001_thumb.jpg\" alt=\"clip_image001\" width=\"720\" height=\"480\" /></a></p>\n<p>Despite a generally positive quarterly earnings report last week from Peloton in terms of user growth, the company has immediately found itself back in the bad news territory after first announcing a pause on deliveries, followed up 24hrs later by a recall on the base Peloton bike, specifically due to the seat post (seen above, on my <a href=\"https://www.dcrainmaker.com/2022/11/peloton-bike-in-depth-review-long-term.html/\">base Peloton Bike</a>). This is the least expensive of the two models, and has been paused due to a safety issue and coordination with the CPSC. This particular model has been around nearly a decade, so this isn’t some sort of new product.</p>\n<p>The issue stems from the seat post, specifically the welds. There have been sporadic reports on Peloton Facebook and Reddit groups over the years of the seatpost snapping or separating during use. The company has confirmed the exact number of reported breaks and injuries to date:</p>\n<blockquote><p>“Peloton has identified 35 reports of seat posts breaking out of 2,160,000 units sold in the US. There have been 13 reports of injuries, including a wrist fracture, lacerations and bruises.”</p></blockquote>\n<p>Peloton says this impacts “original Peloton model Bikes sold from January 2018 to May 2023 in the US” – and that it does not impact non-US models.</p>\n<p>I’m slightly perplexed as to how the Peloton Bike+ isn’t included in this, since it appears virtually identical – at least in the initially sold model I have. Perhaps it’s changed slightly since then. Below is my <a href=\"https://www.dcrainmaker.com/2021/02/peloton-bike-plus-in-depth-review.html\">Peloton Bike+</a> seatpost (my base Peloton Bike is a US model, which I bought second-hand in January 2020 in the US, but was sold about a year prior. My Peloton Bike+ model was bought in Europe at launch of that model):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/05/clip_image0016-1.jpg\"><img title=\"clip_image001[6]\" src=\"https://media.dcrainmaker.com/images/2023/05/clip_image0016_thumb-1.jpg\" alt=\"clip_image001[6]\" width=\"720\" height=\"480\" /></a></p>\n<p>Obviously, there must be some internal difference, or weld difference that’s not visible.</p>\n<p>Either, all Peloton users should have received an e-mail in the last 12 hours with details on the recall, though you can also just <a href=\"https://www.onepeloton.com/replacement/checkout\">visit their site for details</a>. Peloton will be sending out replacement seat posts (the seat post easily slides in, so it’s a 2-second fix). You can ‘order’ them at that site.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/05/SeatPost.png\"><img title=\"SeatPost\" src=\"https://media.dcrainmaker.com/images/2023/05/SeatPost_thumb.png\" alt=\"SeatPost\" width=\"722\" height=\"349\" /></a></p>\n<p>In my case, since I live in the Netherlands now with it (and they won’t ship replacements there – just other currently supported Peloton countries), I’ll just order it to a hotel in the US. I’ve got some travel coming up, so that’s easy enough.</p>\n<h3><span>Zwift Steering Rebirth:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/05/EliteSterzoSmartPlatform.jpg\"><img title=\"EliteSterzoSmartPlatform\" src=\"https://media.dcrainmaker.com/images/2023/05/EliteSterzoSmartPlatform_thumb.jpg\" alt=\"EliteSterzoSmartPlatform\" width=\"720\" height=\"480\" /></a></p>\n<p>Zwift’s had a lot of news related to new features lately, including launching the previously announced Coffee Stop feature this week (check out GPLAMA’s video on how it <a href=\"https://www.youtube.com/watch?v=dbkYPUxnemM\">actually works now that it’s out</a>). The latest update is now (finally!) taking advantage of Apple Silicon Mac M1/M2 graphics via Metal.</p>\n<p>However, perhaps the most curious (pretty substantial) update in the latest update is a massive shift in the usage of steering. From here on, all events – including races, will have steering enabled by default. As <a href=\"https://zwiftinsider.com/update-1-39-0-110983/\">initially reported by Zwift Insider</a>, steering is now enabled by default for all events:</p>\n<blockquote><p>“Zwift has supported steering for years, but it’s been disabled in most events. With this update, <strong>steering is now enabled by default for all events.”</strong></p></blockquote>\n<p>Further, atop that, two more notable changes:</p>\n<blockquote><p>1) Zwift has “temporarily closed” their original off-road steering tester course, <a href=\"https://www.dcrainmaker.com/2019/09/zwift-demonstrates-mountain-biking-steering-at-eurobike.html\">Repack Ridge</a>, while it works on “exciting improvements”</p>\n<p>2) Zwift has also revamped the pairing screen to now prominently include steering as one of the ‘main’ pillars of the game:</p></blockquote>\n<p>Setting aside the hilarity of ‘closing’ a section of digital road in a game for work, the shift to include the pairing screen is quite notable. Up till now, it’s literally been a side-show. Compare these before and after screenshots of the pairing screen (previously steering was down to the left), where steering is now ‘front and center’:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/05/clip_image0018-1.jpg\"><img title=\"clip_image001[8]\" src=\"https://media.dcrainmaker.com/images/2023/05/clip_image0018_thumb-1.jpg\" alt=\"clip_image001[8]\" width=\"313\" height=\"177\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/05/clip_image001-1.png\"><img title=\"clip_image001\" src=\"https://media.dcrainmaker.com/images/2023/05/clip_image001_thumb-1.png\" alt=\"clip_image001\" width=\"381\" height=\"177\" /></a></p>\n<p>Now, one has to remember that up till now, Zwift has done their darndest to kill their own kitten. Within hours of launching true steering with the <a href=\"https://www.dcrainmaker.com/2020/08/zwift-steering-elite-sterzo-smart.html\">Elite Sterzo Smart years ago</a>, Zwift backtracked and turned it off by default. Up till announcement, the on-record plan was that steering was on by default for all events. However, just a few hours of people screaming and that plan changed to be off by default. And immediately, Zwift killed their own baby.</p>\n<p>Adding to their attempts to induce failure, Zwift has limited steering to just a single device from Elite via exclusivity contract. They then ‘opened up’ that to smart bikes via buttons, but only if you signed a (silly expensive) licensing agreement. There were basically no takers initially, and eventually Wahoo came <a href=\"https://www.dcrainmaker.com/2021/01/zwift-rolls-out-steering-to-wahoo-kickr-smart-bike.html\">onboard with the KICKR Bike</a> – though it doesn’t sound like they paid anything. That was later followed by a few others. However, even when new companies like JetBlack tried to introduce their dedicated steering products, Zwift also dragged its feet on bothering to certify them – for nearly a year after initial announcement. Seriously.</p>\n<p>I mean, I don’t know if Zwift could have tried any harder to kill steering. They sabotaged it within the events/racing community by forcing it off by default, they sabotaged it within the industry by either charging crazy fees or not bothering to certify devices once interest gained. And then they sabotaged it marketing-wise to consumers by basically never mentioning it.</p>\n<p>Yet here we are, and randomly nearly years later Zwift has:</p>\n<blockquote><p>1) Turned it on by default overnight</p>\n<p>2) Disabled their test steering course to ‘improve’ it</p>\n<p>3) Made steering a prominent feature on the main pairing screen</p></blockquote>\n<p>Now, I know some people don’t like steering. Some argue it’s a “tax” to win in racing. As without it, you’d be at a disadvantage. Setting aside that Zwift themselves has noted that steering actually makes winning a race harder (as if you forget to turn on the ideal line, you’ll fall off the line/group).</p>\n<p>Still, the reality is that Zwift racing is a game. It’s not an FTP test. It already has gamification (which was also <a href=\"https://www.youtube.com/watch?v=rRN-asSOv7w\">just recently revamped this past week</a>), and steering is one more element of that. If we took away gamification, you end up with the FTP-test style time trial that are some other platforms. Nobody actually wants that.</p>\n<p>Ideally, Zwift needs to figure out how to make a steering device that’s super cheap. Akin to the <a href=\"https://www.dcrainmaker.com/2021/02/kommander-review-zwift-control-for-your-handlebars.html\">Kommander buttons</a>, but produced at huge scale like <a href=\"https://www.dcrainmaker.com/2018/06/zwift-acquires-milestone-charts-entry-into-hardware-realm.html\">Zwift’s Run Pod</a> (which they basically gave away). Do that, combine it with a good/interesting user experience, and they’ve got a winner. Only time will tell though if that’s in the cards, or if steering will soon be left to die by the roadside again.</p>\n<h3><span>GoPro Price Drop:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/05/GoProHero11-Black-and-Mini.jpg\"><img title=\"GoProHero11-Black-and-Mini\" src=\"https://media.dcrainmaker.com/images/2023/05/GoProHero11-Black-and-Mini_thumb.jpg\" alt=\"GoProHero11-Black-and-Mini\" width=\"720\" height=\"480\" /></a></p>\n<p>Finally, a quickie – GoPro has reduced prices on their GoPro cameras, saying they’re doing so to bring it back in line with pre-COVID pricing. Specifically, the following (basically everything is $100 lower):</p>\n<p>– HERO11 Black to $399<br />\n– HERO11 Black Mini to $299<br />\n– HERO10 Black to $349<br />\n– HERO9 Black is $249<br />\n– HERO11 Black Creator Edition to $599<br />\n– GoPro MAX (360 Cam) stays at $499</p>\n<p>As part of this though, they’re no longer giving a $100 discount for becoming a GoPro subscriber via GoPro.com – in short, in their earnings call they said that they no longer feel the need to use that carrot, and that they’re seeing people finding value in the GoPro Subscription as-is, saying:</p>\n<blockquote><p>“And eliminating camera discounts at the time of purchase at GoPro.com. Thanks to the strength of in-app subscriber conversion of retail consumers, as well as improvements in subscriber retention, we believe we can generate more subscribers with growth in retail sales than if we continue our pandemic-driven strategy of focusing primarily on GoPro.com sales for subscriber growth.”</p></blockquote>\n<p>And to drive that carrot a bit more, GoPro is reducing the price of the first year of the GoPro subscription:</p>\n<blockquote><p>“GoPro is also making its very popular GoPro Subscription more accessible with introductory $24.99 pricing for the first year and $49.99 upon annual renewal thereafter.”</p></blockquote>\n<p>In case you’re curious, in terms of camera sales, GoPro has beat their sales expectations by 10%, though overall camera sales remained flat year over year. This makes sense to me, while there was excitement for a GoPro Mini product, the overwhelming feeling is that the Hero 11 Black Mini just kinda missed the mark. There was nothing technically wrong with it, but that people simply wanted something smaller. Basically, GoPro actually packed too much camera/specs into it, at the cost of size (and the size really wasn’t much different).</p>\n<p>I’d love to see GoPro take another stab at the Mini, ideally with making some sacrifices to considerably shrink the size. On the flip side, the Hero 11 Black (main camera) continues to be my daily driver. Works great, and no complaints. So being $100 cheaper on the regular, is great.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"649b9bc28fc5daf132ecf0fef29a5295a259ff5713ec4289b7c25f18744543e5","category":"Cycling"}