{"title":"The Optimal Concentrations of Ethanolic-Extracted Propolis for a Reduction of Nosema ceranae Infection in Western Honey Bees, Apis mellifera","link":"https://www.preprints.org/manuscript/202403.0609/v1","date":1710190079000,"content":"Ethanolic extracts of propolis collected from Apis mellifera hives have been shown to reduce Nosema ceranae infection in honey bee workers. This study aimed to determine the propolis concentration that optimizes the control of N. ceranae infection in honey bee workers. Newly emerged worker bees were individually fed 2 μL of 50% sucrose solution (w/v) containing 105 N. ceranae spores per bee, and treated with 0%, 25%, 50%, and 75% ethanolic extracted propolis in 50% sucrose solution (v/v). The treated bees were maintained in cages at 34 ± 2˚C and 55 ± 5% RH throughout the study. The number of dead bees was counted and removed from the cages daily for 30 days to generate survival curves. The number of N. ceranae spores per bee (infectivity) was quantified using a hemocytometer, and the number of infected bees per hundred bees (infection rate) was determined. The survival rates of N. ceranae infected bees fed 25%, 50%, and 75% propolis (NP1, NP2, NP3, respectively) were significantly higher than those of infected bees not fed propolis (NO). Furthermore, the infectivity and infection rates of NP2 and NP3 groups were significantly lower than those of the NO group. The infectivity and infection rates of the NP1 group were not different than those of the NO group. Our data suggest that 50% and 75% propolis extracts are appropriate concentrations for treating N. ceranae infection in honey bees. Ethanolic extracted propolis can be an alternative treatment for N. ceranae infection in Western honey bees.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"64a6bc636a97b875c92d757952281724b3556dd23c7e5ad47f46d9e9118a8b96","category":"Interdisciplinary"}