{"title":"Dan Moren’s iPadOS 15 Wish List","link":"https://www.macworld.com/article/347967/wwdc-2021-ipados-15-ipad-pro-home-screen-widgets-pro-apps-multitasking-keyboard-shortcuts.html","date":1622833667000,"content":"\n<p>Dan Moren, writing at Macworld:</p>\n\n<blockquote>\n  <p>Multitasking on the iPad is, to put it generously, a mess. Split\nView and Slide Over, first introduced in 2015’s iOS 9 and refined\na couple of times over the years, have always had the feeling of a\nband-aid slapped over a mortal wound. Their limitations (like the\ndance of getting an app that’s not in your dock into Split View)\nand awkward gestures (how many times have you activated Slide Over\nwhen you meant to simply swipe) feel cumbersome, especially\ncompared to the multitasking we’ve always had on the Mac.</p>\n\n<p>So I’m hoping that 2021 is the year that Apple finally cracks\nmultitasking on the iPad. I’m not sure exactly what that looks\nlike; there are those who argue for the wholesale transplant of\nmacOS’s windowing system, but that seems as though it might be\nanother imprecise fit borne out of convenience rather than actual\nappropriateness. Fundamentally, though, the iPad has always been\nbuilt around the idea of one app on the screen at any time, and\nit’s clear that simply won’t do in a world where people expect to\nbe able to run multiple apps at once.</p>\n</blockquote>\n\n<p>It’s amazing how often I make a slide-over Safari “window” on iPad without wanting to. And then I’m stuck with a new Safari instance with no actual tabs. You can get into Slide Over inadvertently, and if you do, it’s <em>hard</em> to undo it. It’s like instantly creating detritus you need to clean up. iPadOS is the only GUI system I’m aware of that has “windows” that don’t have close buttons.</p>\n\n<p>My wife uses her iPad Pro more than any other device. She <em>loves</em> it. But Slide Over was driving her nuts until I showed her how to turn it off. “Why is that on by default?” she asked.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/06/04/moren-ipados-15-wishlist\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"64ae32a5dee0ac187a781391a237784c4dbce12beff99b0b3cf26ab69048b0e9","category":"Tech"}