{"title":"How to install the iOS 17 beta on your iPhone","link":"https://www.macworld.com/article/671198/how-to-install-ios-beta.html","date":1686138008000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Every June at <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC</a>, Apple announces and demonstrates the next version of iOS for your iPhone, but the final version doesn’t actually launch until the fall (usually around September). What if you don’t want to wait that long to try out the new features? You need to install the beta!</p>\n\n\n\n<p>During the months between June and September Apple works on the upcoming version (which in 2023 is <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17</a>) with help from developers and public testers. If you want to try out the new operating system it’s easy to get onboard. </p>\n\n\n\n<p>In this article, we walk you through the steps required to get the latest iOS beta. We explain how to join Apple’s beta programs, and how to install and run an iOS beta on your iPhone. </p>\n\n\n\n<p>If you become a beta tester you can continue to receive early software updates even after the final version launches. Development of iOS continues after the September release with a number of “point releases” (e.g. iOS 16.1, iOS 16.2, etc.) that add additional <a href=\"https://www.macworld.com/article/1063790/ios-16-features-not-in-launch-icloud-photo-library-live-activities.html\">features that weren’t available at launch</a> and fix bugs/address security flaws.</p>\n\n\n\n<p>Development of iOS 16 continues with the most recent developer beta being <a href=\"https://www.macworld.com/article/1923832/ios-16-6-beta-features-release-date.html\">iOS 16.6</a> which arrived on May 19, 2023 followed by the public beta on 22 May.  </p>\n\n\n\n<p>If you want to install the full version of iOS 16 on your iPhone (not the beta version) we explain <a href=\"https://www.macworld.com/article/670944/how-to-update-ios-on-your-iphone.html\">how to install iOS 16 on your iPhone</a> in a separate article. </p>\n\n\n\n<p><em>June 7: Added details of how to get the iOS 17 Developer Beta with a free Apple developer account. </em></p>\n\n\n\n<h2>iOS 17 beta release date</h2>\n\n\n\n<p>The first version of the developer beta of iOS 16 arrived after the WWDC 2023 keynote on June 5, 2023. It is normal for Apple to release the first beta following the keynote so that developers can immediately start testing to make sure their apps work.</p>\n\n\n\n<p>Normally the Developer Beta is tied to a paid-for developer account (which costs $99/£79 a year). However, in 2023 Apple has changed this so that if you have any developer account, even if you aren’t paying for it, you can get the developer beta of iOS 17. For this reason people who have a basic free developer account are seeing the iOS 17 developer beta already.  </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-beta-download.jpg?quality=50&amp;strip=all&amp;w=994\" alt=\"How to get iOS beta\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-beta-download.jpg?quality=50&amp;strip=all 1170w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-beta-download.jpg?resize=248%2C300&amp;quality=50&amp;strip=all 248w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-beta-download.jpg?resize=768%2C928&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-beta-download.jpg?resize=994%2C1200&amp;quality=50&amp;strip=all 994w\" width=\"994\" height=\"1200\" /></figure><p>Foundry</p></div>\n\n\n\n<p>However, we don’t recommend you install the developer beta if you aren’t a developer. Instead our recommendation is to wait a few more weeks until the public beta of iOS arrives. </p>\n\n\n\n<p>The first public beta version of iOS 16 came on July 11, 2022, so we expect a similar timescale for iOS 17, perhaps July 10, 2023.</p>\n\n\n\n<h2>How to get the iOS 17 beta</h2>\n\n\n\n<p>If you are a developer you can get access to the developer beta – even if you aren’t a paid-up member of the Apple Developer Program. </p>\n\n\n\n<p>If you want to enrol as a developer, which you would need to do if you want to sell any apps you design, you can do so <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/enroll/&amp;xcust=1-1-671198-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">here</a>. It costs $99/£79 a year. </p>\n\n\n\n<p>If you just want a free Apple Developer account then you can get this via Xcode or the Apple Developer app in iOS. Download the Apple Developer app from the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/gb/app/apple-developer/id640199958&amp;xcust=1-1-671198-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">iOS App Store</a> and log in via the Account tab. </p>\n\n\n\n<p>If you want to get the public beta you need to join Apple’s beta programs on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/sp/betaprogram/welcome&amp;xcust=1-1-671198-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple’s website</a>. Read this for more information: <a href=\"https://www.macworld.com/article/674359/how-to-join-apples-beta-program-and-try-out-new-software.html\">How to become an Apple beta tester.</a></p>\n\n\n\n<h2>How to install the iOS 17 Developer Beta</h2>\n\n\n\n<p>Each stage of iOS’s development cycle is rolled out to developers first, and then to public beta testers afterwards. If you’re a developer and need to test your apps against the most up-to-date version of the OS possible, this is the version to run.</p>\n\n\n\n<p>You’ll need an Apple developer account. This can either be a paid membership, which costs $99/£79 a year, or you can create a free Apple Developer account using your Apple ID. </p>\n\n\n\n<p><strong>Full Apple Developer Account: </strong>If you want a full, paid for, Apple Developer account enter your details on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/&amp;xcust=1-1-671198-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Apple Developer Program website</a>. Click on Enroll &gt; Click Start Your Enrollment &gt; Log in with your Apple ID and password &gt; Verify using two factor authentication &gt; Confirm your personal information &gt; Select what best describes what you develop apps as, e.g. Individual and click Continue &gt; Review and accept the legal agreement. Check the box and click on Continue. At this point you would need to pay £79 a year and click Purchase. </p>\n\n\n\n<p><strong>Free Apple Developer Account:</strong> If you just want a free developer account download the Apple Developer app from the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/app/apple-developer/id640199958&amp;xcust=1-1-671198-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">iOS App Store</a> &gt; Open the Apple Developer app &gt; Tap on Account &gt; Tap on Sign In &gt; Sign in using your usual Apple ID.</p>\n\n\n\n<p>All set with your Apple Developer account? Okay! Here’s how to install the iOS developer beta:</p>\n\n\n\n<ol><li>Back up your iPhone (because this is a beta you are testing!) </li><li>Open Settings app.</li><li>Tap <em>General</em>. </li><li>Tap Software Update.</li><li>In the Beta Updates section, select the <em>iOS Developer Beta</em>.</li></ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-beta-download.jpg?quality=50&amp;strip=all&amp;w=994\" alt=\"How to get iOS beta\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-beta-download.jpg?quality=50&amp;strip=all 1170w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-beta-download.jpg?resize=248%2C300&amp;quality=50&amp;strip=all 248w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-beta-download.jpg?resize=768%2C928&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Apple-beta-download.jpg?resize=994%2C1200&amp;quality=50&amp;strip=all 994w\" width=\"994\" height=\"1200\" /></figure><p>Foundry</p></div>\n\n\n\n<p>Developers can choose to get the Public Beta instead by selecting iOS Public Beta in the Software Update screen.</p>\n\n\n\n<p>Prior to iOS 16.4, it was necessary to download and activate a beta profile to your device. From iOS 16.4 onwards, Apple will simply check to see if your Apple ID is a registered developer and provide access in the Software Update menu. You may need to restart your iPhone for the option to appear.</p>\n\n\n\n<p>Some developers have an Apple ID registered for developer access that is different from the Apple ID associated with their personal Apple account and data. To use a different Apple ID for beta access than is used throughout the rest of iOS, open <em>Settings</em> &gt; <em>General</em> &gt; <em>Software Update</em> &gt; <em>Beta Updates</em> and select the Apple ID at the bottom of the screen.</p>\n\n\n\n<h2>How to install the iOS 17 Public Beta</h2>\n\n\n\n<p>The developer beta is, as the name suggests, is intended for developers only, but Apple does offer a beta testing program for members of the public who would like to test out the new features. The public betas always lag behind the developer ones. Beginning with iOS 16.4, you no longer need to download and activate a profile to get the beta. You simply need to enroll, and select the beta from the software updates section in Settings.</p>\n\n\n\n<p>You can install the iOS public beta using the following instructions.</p>\n\n\n\n<ol><li>Click Sign Up on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/sp/betaprogram/&amp;xcust=1-1-671198-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Beta page</a> and register with your Apple ID.</li><li>Log in to the Beta Software Program.</li><li>Click Enroll your iOS device.</li><li>Open the <em>Settings</em> app, tap <em>General</em>, then <em>Software Update</em>.</li><li>In the Beta Updates section, select the <em>iOS Public Beta</em>.</li></ol>\n\n\n\n<p>Prior to iOS 16.4, you had to download and activate a beta profile. Now, Apple’s servers will simply check your Apple ID to see if it is registered for the Public (or Developer) beta before providing access. You may need to restart your iPhone for the option to appear.</p>\n\n\n\n<p>Some users have an Apple ID registered for beta access that is different from the Apple ID associated with their personal Apple account and data. To use a different Apple ID for beta access than is used throughout the rest of iOS, open <em>Settings</em> &gt; <em>General</em> &gt; <em>Software Update</em> &gt; <em>Beta Updates</em> and select the Apple ID at the bottom of the screen.</p>\n\n\n\n<p>If, on the other hand, you want to uninstall the beta and stop receiving beta updates read this: <a href=\"https://www.macworld.com/article/1067004/how-to-remove-ios-beta-iphone.html\">How to remove an iOS beta from your iPhone</a>.</p>\n\n\n\n<h2>What’s a beta?</h2>\n\n\n\n<p>Betas are pre-release testing versions. Every iOS update goes through the beta phase before it’s officially launched, from small tweaks such as 15.5.1 to the full-version game-changers like iOS 16.</p>\n\n\n\n<p>There are developer betas (for registered software developers only), and public betas (for anyone who’s keen). Both types go through multiple versions—probably half a dozen—before a major launch.</p>\n\n\n\n<h2>Risks and precautions</h2>\n\n\n\n<p>Note first of all that betas are test versions of upcoming software. They are by definition unfinished, and while they should include most or all of the features in the finished product, there will be cosmetic differences and, inevitably, some glitches and problems that will need to be fixed. The glitches and problems are why Apple bothers to beta-test iOS in the first place.</p>\n\n\n\n<p>In other words, don’t expect a perfect user experience. In particular, don’t expect existing apps (including ones that you may rely on) to work perfectly with the new version. In extreme cases you may even find that your device is bricked by the beta, and cannot be used until the next beta comes along and hopefully fixes the problem. It’s not uncommon for early beta software to exhibit problems like excessive battery drain, too.</p>\n\n\n\n<p>The closer we get to the final launch and iOS version, the more polished and feature-complete we can expect the available betas to become. The counter to that, of course, is there will less time left to wait for the official launch, so you won’t be gaining so much by installing a beta.</p>\n\n\n\n<p>Assuming you decide to go ahead, we can’t stress enough how important it is to <a href=\"https://www.macworld.com/article/671444/how-to-back-up-an-iphone-or-ipad.html\">back up your iPhone</a> before you install an iOS beta, or better still, use a secondary device rather than your main iPhone. You won’t lose everything if something goes wrong while the beta is installing, and you’ll be able to <a href=\"https://www.macworld.com/article/672761/how-to-downgrade-ios-14-on-iphone.html\">go back to the last version</a> should you find that you don’t like the new software after all, or that it’s too buggy.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"64b329b8db7e60231f497d5b9a9845df0cc3a132904484a53b334c154a67fbf0","category":"Apple"}