{"title":"Data-Driven Sparse Sensor Placement Optimization on Wings for Flight-by-Feel: Bioinspired Approach and Application","link":"https://www.preprints.org/manuscript/202409.0216/v1","date":1725347142000,"content":"This research explores the feasibility of a data-driven optimization algorithm for placing sparse arrays of artificial hair-cell airflow velocity sensors to enable agile and robust flight-by-feel control of unmanned aircraft. The Sparse Sensor Placement Optimization for Prediction (SSPOP) algorithm exploits the information-rich features of large flow datasets to find a near-optimal set of locations for flow sensors on a wing. The flow information from these sensors can be used to predict flight state parameters such as the angle of attack, mimicking the fly-by-feel control systems observed in nature. We evaluate the effectiveness of this approach for a blunt-edged 45∘ swept delta wing. Exploiting the information in the complex airflow patterns over this wing, the SSPOP algorithm selects a sensor location design point (DP) which reliably ranks within the top 1% of all possible DPs by root mean square error in angle of attack prediction. This performance was consistent across models of various artificial hair lengths, and one model with variable hair lengths. This bioinspired dimension-reducing method for sensor placement optimization exhibits reliability and flexibility benefits when compared with a conventional greedy search algorithm and gradient-based optimization using auto-differentiation. The successful application of SSPOP in complex 3D flows paves the way for experimental evaluation of data-driven sparse sensor placement optimization for artificial hair-cell airflow sensors and is a major step toward biomimetic flight-by-feel.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"64ba695d3b0b15f1c717a7da7f680acbf29a65b6c68c70fc02d1cf8b44bf307f","category":"Interdisciplinary"}