{"title":"AppleCare+ FAQ: What you need to know about Apple’s extended warranty","link":"https://www.macworld.com/article/230521/applecare-warranty-faq.html","date":1624022920000,"content":"\n<div>\n<section><div></div></section><p>Your Apple gear wasn’t cheap. And if you drop your iPhone, your iPad stops turning on, or you smack your Apple Watch into something and shatter it, getting it repaired probably won’t be cheap either.</p>\n\n\n\n<p>Apple includes a one-year limited warranty with all hardware so if there’s a manufacturing defect, you’ll be covered. To also protect against accidental damage plus extend the original warranty for longer and enjoy free tech support, you can opt to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/support/products/?afid=p239%7C321564&amp;cid=aos-us-aff-ir&amp;xcust=1-1-230521-0-0-0&amp;sref=https://www.macworld.com/feed\">purchase AppleCare+</a>. Here’s what it is, what it covers, and what you can expect to pay. Is AppleCare+ worth it? Only you can decide for your own situation, but this should be everything you need to know to make a smart choice.</p>\n\n\n\n<p><em><strong>Updated 06/18/21:</strong> Apple has lowered the price of AppleCare+ for some Macs.</em></p>\n\n\n\n<h2>AppleCare+ overview</h2>\n\n\n\n<p>If you’ve never even heard of AppleCare, start here! Otherwise, feel free to skip to the sections that cover your particular devices.</p>\n\n\n\n<h3>How is AppleCare+ different from the warranty Apple products come with?</h3>\n\n\n\n<p>AppleCare is Apple’s term for its warranty programs. Every Apple device comes with a certain stretch of AppleCare warranty service and phone/chat support for free, typically one year for the warranty and 90 days of phone support. You can pay to extend that protection for longer, which is called AppleCare+.</p>\n\n\n\n<h3>Do I have to buy AppleCare+ at the same time as the product?</h3>\n\n\n\n<p>No. If you already know you want it, buying AppleCare+ with the product is a good idea, just so you don’t forget. When you’re shopping at the Apple store and Apple.com, you’ll be offered AppleCare+ at checkout, and authorized Apple resellers can offer AppleCare+ too.</p>\n\n\n\n<p>But you have some time to decide. Generally you get 60 days from the purchase date to buy AppleCare+ (only 30 days if you’re in Japan), and Apple has a page where you can <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://checkcoverage.apple.com/&amp;xcust=1-1-230521-0-0-0&amp;sref=https://www.macworld.com/feed\">check your exact device’s eligibility</a>.</p>\n\n\n\n<p>The latest iPhones and iPads will show you an AppleCare+ signup prompt right there near the top of Settings, if you’re still eligible. You can tap on it to see how many days remain, and purchase AppleCare+ (with or without Loss and Theft protection) right on your device.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/10/applecare-settings-100813425-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/10/applecare-settings-100813425-large.jpg\" /></a><figcaption><p>If your new iPhone or iPad is eligible for AppleCare+, you’ll see a signup prompt near the top of the Settings app.</p>\n</figcaption></figure></div>\n\n\n\n<p>Still, to buy AppleCare+ after the fact you generally have to run a diagnostic test on the device in question, so Apple knows it’s in good working order. And no matter when you buy your AppleCare+ plan, the coverage starts from the day you bought your device. So you don’t get an “extra” two months of coverage if you wait two months to buy the plan.</p>\n\n\n\n<p>If you want to buy an AppleCare+ plan after the 60-day period has ended, you can bring your device into an Apple Store for an inspection up to a year after purchase. If the technician allows it, you’ll be able to sign up in person.</p>\n\n\n\n<h3>How do I buy AppleCare+ for products I didn’t buy directly from Apple?</h3>\n\n\n\n<p>The easiest way is online. Apple’s site has a page to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://checkcoverage.apple.com&amp;xcust=1-1-230521-0-0-0&amp;sref=https://www.macworld.com/feed\">Check Your Service and Support Coverage</a>. Enter your device’s serial number and it’ll tell you if you can still buy AppleCare+ and walk you through the process of purchasing and registering your plan.</p>\n\n\n\n<p>Keep in mind that buying an AppleCare+ plan after the fact often means you have to complete a diagnostic test on the device. After all, Apple has to make sure you’re not trying to buy coverage on a device that’s already broken. So do it right away, just in case.</p>\n\n\n\n<h3>Can you buy AppleCare+ for refurbished products?</h3>\n\n\n\n<p>You can! Apple offers a range of <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/refurbished&amp;subid1=1-1-230521-0-0-0\">refurbished items</a> on its website, and they’re all backed by the same one-year warranty as new products. Plus, you can buy AppleCare+ for a refurbished item just as you can with a new one.</p>\n\n\n\n<h3>How do I check how much time is left on my AppleCare plan?</h3>\n\n\n\n<p>Head to Apple’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://checkcoverage.apple.com&amp;xcust=1-1-230521-0-0-0&amp;sref=https://www.macworld.com/feed\">Check Your Service and Support Coverage</a> page and enter your device’s serial number. You’ll find out how much time you have left on your AppleCare plan, and if you can still buy AppleCare+ for this device.</p>\n\n\n\n<h3>If there’s no Apple store near me, is AppleCare+ a bad idea?</h3>\n\n\n\n<p>No, you can still use AppleCare+ if you can’t make it to the Apple store. You have several options, actually.</p>\n\n\n\n<ul><li><strong>Apple retail stores.</strong> If you can get to an Apple store, you can even <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/retail/geniusbar/&amp;xcust=1-1-230521-0-0-0&amp;sref=https://www.macworld.com/feed\">make a reservation</a> for AppleCare+ service.</li><li><strong>Drop off at the UPS Store.</strong> Apple can provide you with a Repair ID number for an iPhone, iPad, or iPod needing service, and you can take it to any UPS Store in the U.S., which will ship the device to Apple at no cost to you. When Apple finishes the repair, you get the device back in the mail, again with no shipping fee.</li><li><strong>Direct mail.</strong> Alternatively, Apple will send you a box and shipping labels for you to ship any Apple product back to them for repair. Apple pays the shipping both ways.</li><li><strong>Onsite service.</strong> If the problem is with a desktop Mac, Apple can sometimes even send an authorized repair technician to you.</li><li><strong>DIY.</strong> If the problem is relatively small, Apple can sometimes just send you a part, like a new iPhone charger or Apple TV remote.</li></ul><h3>Do I have to pay for AppleCare+ up front?</h3>\n\n\n\n<p>Not anymore! Apple offers a monthly recurring payment plan for AppleCare+ over a 24-month period. Pricing varies depending on the cost of AppleCare+ for your device, but for a $199 plan you’ll pay $9.99 per month, or for a $299 plan you’ll pay $14.99 per month. </p>\n\n\n\n<p>You’ll eventually end up paying more for AppleCare+ if you pay monthly, in other words.</p>\n\n\n\n<h3>How am I supposed to survive without my device while Apple is repairing it?</h3>\n\n\n\n<p>Apple offers an Express Replacement Service for the iPhone, iPad, and Apple Watch. When you use Express Replacement, Apple goes ahead and sends you a new device right away, and you don’t have to mail in your broken device until you receive it. Conditions apply, but ask Apple about it when you contact them and they can let you know if you qualify.</p>\n\n\n\n<h3>What if I sell the product before AppleCare+ runs out?</h3>\n\n\n\n<p>AppleCare is transferable! If you’re selling an Apple product before the included AppleCare plan expires, the buyer gets the remaining protection. If you buy an extended AppleCare+ plan and then sell the product, the remaining time left in the AppleCare+ goes along with it. So AppleCare+ can be a selling point when you’re unloading your used devices on the secondary market!</p>\n\n\n\n<p>To transfer an AppleCare plan, you have to provide the buyer with your proof of purchase (receipt), the plan confirmation and contract, and also notify Apple by email, fax, or mail. Apple needs to know the plan’s agreement number, the device’s serial number, and the new owner’s contact info. Full details are in the terms and conditions.</p>\n\n\n\n<h3>Does AppleCare cover loss or theft?</h3>\n\n\n\n<p>There is a special AppleCare+ with Theft and loss plan, but it’s only for iPhone.  This plan allows for two incidents of accidental damage, theft, or loss coverage.</p>\n\n\n\n<p>Some cell carriers and third-party insurance companies offer plans that do cover loss or theft, but AppleCare+ only covers defects and accidental damage.</p>\n\n\n\n<h3>Is AppleCare+ only for U.S. customers?</h3>\n\n\n\n<p>No! Apple provides global coverage for most Apple devices (iPhone, iPad, Apple Watch, Mac, iPod, Apple TV, and Apple displays). Service options do vary between countries, but any AppleCare service is always performed by authorized techs with genuine Apple parts.</p>\n\n\n\n<p>Obviously, you should always read the full agreement before you purchase any warranty or insurance.</p>\n\n\n\n<h3>Can I cancel an AppleCare+ plan?</h3>\n\n\n\n<p>Yes, you can. If it’s within 30 days of purchasing the plan, you’ll get a full refund minus any service you received. Outside of 30 days, you’ll get a prorated refund, minus any service, minus a fee of $25 or 10 percent of the prorated refund, whichever is less. Call Apple at 1–800-MY-APPLE to ask how.</p>\n\n\n\n<h2>AppleCare+ for iPhone</h2>\n\n\n\n<p>The iPhone is covered in glass, easy to drop, and goes everywhere with you. No wonder iPhones break so frequently! Here’s the skinny on buying some extra protection.</p>\n\n\n\n<h3>How much does AppleCare+ cost for iPhone?</h3>\n\n\n\n<p>It varies by the device. Here’s the pricing.</p>\n\n\n\n<h3><strong>iPhone 12 Pro, 12 Pro Max, 11 Pro, 11 Pro Max, XS, XS Max, and X</strong></h3>\n\n\n\n<p>Standard AppleCare+: one-time fee of $200 or $10 per month.</p>\n\n\n\n<p>Including loss and theft protection: $270 or $13.50 per month.</p>\n\n\n\n<h3><strong>iPhone 12, 12 Mini, 11, XR, and 8 Plus</strong></h3>\n\n\n\n<p>Standard AppleCare+: $150 or $8 per month.</p>\n\n\n\n<p>Including loss and theft protection: $220 or $11.50 per month.</p>\n\n\n\n<h3><strong>iPhone 8</strong></h3>\n\n\n\n<p>Standard AppleCare+: $130 or $6 per month.</p>\n\n\n\n<p>Including loss and theft protection: $200 or $9.50 per month. </p>\n\n\n\n<h3><strong>iPhone SE</strong></h3>\n\n\n\n<p>Standard AppleCare+: $80 or $4 per month.</p>\n\n\n\n<p>Including loss and theft protection: $150 or $8 per month.</p>\n\n\n\n<p>All <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/support/products/iphone/&amp;xcust=1-1-230521-0-0-0&amp;sref=https://www.macworld.com/feed\">AppleCare+ plans for iPhone</a> include two years of coverage and tech support.</p>\n\n\n\n<h3>I bought my iPhone with the iPhone Upgrade Program. Doesn’t that have AppleCare+ included for free?</h3>\n\n\n\n<p>It’s included, but it’s not free. The cost of the two-year AppleCare+ plan is divided among the 24 loan payments you agree to pay. (But at least you aren’t charged interest.)</p>\n\n\n\n<p>If you upgrade your phone after a year, your two-year loan starts over again, but you still get the second year of AppleCare+ on the new phone. Read the <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/iphone/iphone-upgrade-program/join&amp;subid1=1-1-230521-0-0-0\">iPhone Upgrade Program terms</a> for more detail. The iPhone Upgrade Program is a loan, so again, be sure to read all the fine print before you sign up.</p>\n\n\n\n<h3>What does AppleCare+ for iPhone cover?</h3>\n\n\n\n<p>For the iPhone, AppleCare+ extends your warranty coverage from one year to two, and extends phone and chat support from 90 days to the full two years as well.</p>\n\n\n\n<p>You also get up to two incidents of accidental damage coverage per year for a relatively low service fee. If you’ve only damaged the screen, a screen replacement is only $29. But if the iPhone has other damage, the fee is $99. iPhones are eligible for the Express Replacement Service, letting you request a replacement device in the mail before you send your original damaged device in for repair.</p>\n\n\n\n<p>So let’s say you drop your iPhone on the corner, which breaks the screen but also dents the enclosure enough that Apple can’t fix just the screen—that’s a $99 repair. If the screen shatters but the rest of the phone is relatively unscathed, $29.</p>\n\n\n\n<p>The warranty against defects covers the phone as well as the battery and the included headphones and accessories. Accidental damage can include almost anything, such as water damage, drops, running the thing over, your kid pours paint into the Lightning port—as long as you only have two incidents (or less) in the two year coverage period.</p>\n\n\n\n<h3>What is AppleCare+ with Loss and Theft?</h3>\n\n\n\n<p>If your main concern is loss or theft, you have to opt specifically for the AppleCare+ with Theft and Loss plan. This plan allows for two incidents of accidental damage, theft, or loss coverage per year.</p>\n\n\n\n<p>You might also want to check your homeowner’s and renter’s insurance policies to see if they cover stolen electronics. Some cell phone service providers’ own insurance plans cover loss and theft, but it’s relatively rare.</p>\n\n\n\n<h3>Should I get it?</h3>\n\n\n\n<p>If you’re going to buy AppleCare+ on anything, it’s probably going to be your iPhone. But it’s not always a slam dunk. Depending on the age of your iPhone and how expensive some future repair might be, you may end up spending more for AppleCare+ and a repair than just a straight repair cost.</p>\n\n\n\n<p>Really it depends on how careful you are with your iPhone. Do you use a case? Avoid action sports? Rarely drop your phone? Or are you a total klutz who’s broken every phone you’ve ever owned? Be honest with yourself and proceed accordingly.</p>\n\n\n\n<p>An Apple Watch is another prime candidate for AppleCare+, if for no other reason than because it’s on the outside of your wrist where it can constantly bump and scrape on things.</p>\n\n\n\n<h2>AppleCare+ for iPad</h2>\n\n\n\n<p>Whether you agree that an iPad can replace a laptop, its AppleCare+ plan certainly is cheaper than AppleCare+ for a Mac—and iPads are eligible for Apple’s speedy Express Replacement Service too.</p>\n\n\n\n<h3>How much does AppleCare+ cost for iPad?</h3>\n\n\n\n<ul><li>iPad Pro: $129</li><li>iPad, iPad Air, and iPad mini: $69</li></ul><h3>What does AppleCare+ for iPad cover?</h3>\n\n\n\n<p>AppleCare+ extends an iPad’s hardware warranty from one year to two. Tech support is extended from 90 days to two years, so you can call or chat with an Apple rep to get help with iOS, iCloud, and Apple apps.</p>\n\n\n\n<p>You also get two incidents of accidental damage coverage per year, with a service fee of $49 for most damage, plus tax. AppleCare+ covers the iPad as well as its battery and included accessories like the power brick.</p>\n\n\n\n<h3>What doesn’t AppleCare+ for iPad cover?</h3>\n\n\n\n<p>Loss and theft. The AppleCare+ with Theft and Loss plan is only available with the iPhone. Check with your homeowner’s or renter’s insurance to see if those policies offer you any protection.</p>\n\n\n\n<h3>Should I get it?</h3>\n\n\n\n<p>This answer might hinge on how you use your iPad. My iPad, for example, almost never leaves my house—but I also share it with a 6-year-old who doesn’t always treat it like an expensive and fragile device. Still, our iPad is mostly for entertainment, so I’m living (dangerously?) without AppleCare+.</p>\n\n\n\n<p>On the other hand, if I was a road warrior with an iPad Pro that I relied on every day to make my living, I’d be more likely to shell out the $99 for AppleCare+, which, again, is cheaper than AppleCare+ for most iPhones or any Macs.</p>\n\n\n\n<h2>AppleCare+ for Macs and Apple displays</h2>\n\n\n\n<p>Apple doesn’t sell its own Apple-branded displays anymore, and AppleCare+ for Macs might seem like a bargain if you’ve ever paid hundreds to get a laptop serviced—or overkill if you’re an iMac user who’s never run into a problem.</p>\n\n\n\n<h3>How much does AppleCare+ cost for Macs?</h3>\n\n\n\n<p>For Macs, AppleCare+ offers three years of service protection and phone support, and the price varies by model.</p>\n\n\n\n<ul><li>Mac mini: $99</li><li>iMac: $169</li><li>iMac Pro: $169</li><li>Mac Pro: $299</li><li>MacBook: $249</li><li>MacBook Air: $199</li><li>13-inch MacBook Pro (Intel): $269</li><li>13-inch MacBook Pro (M1): $249</li><li>15-inch MacBook Pro: $379</li></ul><p>Apple also had a separate AppleCare+ plan for the Pro Display XDR, which costs $499.</p>\n\n\n\n<h3>What does AppleCare+ for Macs cover?</h3>\n\n\n\n<p>The plan extends the original warranty from one year to three years, which covers you for defects that aren’t your fault. Phone and chat support is extended from 90 days to three years as well.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/support/products/mac.html&amp;xcust=1-1-230521-0-0-0&amp;sref=https://www.macworld.com/feed\">AppleCare+ for Macs</a> also includes two incidents of accidental damage per year for a lower service fee than you would pay for an out-of-warranty repair. If you damage just the screen or the Mac’s enclosure, it’s $99, and all other damage is $299, plus tax.</p>\n\n\n\n<p>For Macs, your computer is covered, plus the battery, power adapter and other included accessories.</p>\n\n\n\n<h3>What doesn’t AppleCare+ for Macs cover?</h3>\n\n\n\n<p>It doesn’t cover loss or theft. Your homeowner’s or renter’s insurance might, depending on your policy.</p>\n\n\n\n<h3>Can I extend my coverage?</h3>\n\n\n\n<p>Apple allows you to extend your AppleCare+ coverage for Mac indefinitely, in one-year increments, after your initial three years of coverage have expired. If you choose to extend your coverage, you’ll automatically be billed annually for additional one-year extensions.</p>\n\n\n\n<h3>Should I get it?</h3>\n\n\n\n<p>For Macs, AppleCare+ makes more sense if you’re buying a laptop and you’re worried about the screen, or you just tend to be rough on your computers. Desktop Macs probably aren’t as important to cover, since the likelihood of, say, dropping one is a lot less. Still, Macs have a long life, so you may decide three years of (transferable) protection is worth the extra cost.</p>\n\n\n\n<h2>AppleCare+ for Apple Watch</h2>\n\n\n\n<p>Apple offers two tiers of AppleCare+ for the Apple Watch. Since they cost so much, the special edition watches (Edition, Hermès, and ceramic) already come with two years of warranty support, AppleCare+ extends that to a third year.</p>\n\n\n\n<h3>How much does AppleCare+ cost for Apple Watch?</h3>\n\n\n\n<p>For the more common watches, it costs $49 or $79, depending on the Series.</p>\n\n\n\n<ul><li>Apple Watch Series SE is $49.</li><li>Apple Watch Series 6 $79.</li></ul><p>Fancier editions like the Hermes, Titanium, or Ceramic watches may have different AppleCare+ pricing, however.</p>\n\n\n\n<h3>What does AppleCare+ for Apple Watch cover?</h3>\n\n\n\n<p>The cheaper Apple Watches come with 90 days of tech support and a one-year limited warranty. AppleCare+ extends both to two years for $49.</p>\n\n\n\n<p>The more expensive watches already include two years of limited warranty and tech support. A $99 AppleCare+ plan extends both for a third year.</p>\n\n\n\n<p>All Apple Watches are eligible for Express Replacement Service, so you aren’t without an Apple Watch while you wait for your repair. The plan covers the watch, its battery, the magnetic charging cable, and the power adapter. Apple Watch Editions came with a fancy magnetic charging dock that’s also covered.</p>\n\n\n\n<p>AppleCare+ for all Apple Watches covers up to two incidents of accidental damage per year. The service fees are $69 for regular and Nike+ models, and $79 for Edition and Hermès models, plus tax.</p>\n\n\n\n<h3>What doesn’t AppleCare+ for Apple Watch cover?</h3>\n\n\n\n<p>Loss and theft! Are you noticing the pattern?</p>\n\n\n\n<h3>Should I get it?</h3>\n\n\n\n<p>It’s pretty difficult to get an Apple Watch repaired anywhere <em>but</em> the Apple store, as we found out. The Apple Watch is designed to be tough, so most users hopefully shouldn’t have problems. But if you’re paranoid or accident-prone, or you just love the idea of Express Replacement Service so you never miss a step, AppleCare+ is there.</p>\n\n\n\n<h2>AppleCare+ for Apple TV</h2>\n\n\n\n<p>Your Apple TV is probably the last thing you’d buy an extended warranty for, but Apple is happy to sell you one! </p>\n\n\n\n<h3>How much is AppleCare+ for Apple TV?</h3>\n\n\n\n<p>It’s only $29, both for the regular Apple TV and the brand-new 4K edition. That gets you two years of warranty coverage and tech support.</p>\n\n\n\n<h3>What does the AppleCare+ Apple TV cover?</h3>\n\n\n\n<p>The Apple TV itself, the Siri Remote, and even the Apple AirPort router you use with it, if you bought it within two years of the Apple TV. Tech support by phone or chat includes help with setup, connecting to Wi-Fi, iCloud, renting or buying from iTunes, AirPlay, and even connecting to third-party streaming services. You also get coverage for accidental damage (spills, drops, earthquakes, fires) or cosmetic damage. But since it just sits there that’s unlikely to be used. Each incident has a service fee of $15.</p>\n\n\n\n<h3>What doesn’t it cover?</h3>\n\n\n\n<p>Loss and theft, including losing the remote. (But if the remote stops working, that’s covered.) </p>\n\n\n\n<h3>Should I get it?</h3>\n\n\n\n<p>Nah. I mean, you could. But you probably don’t need to, because it’s a box that sits under your TV and doesn’t go anywhere.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"64db8beb5fe886d2e223135056d3fbe776a2fffcb8e50e4b77395468b14c29a5","category":"Apple"}