{"title":"Enhancing Chinese Celery Production in IoT‐Controlled Hydroponic Systems: A Comparative Study on the Effects of Temperature and Light Regulation","link":"https://www.preprints.org/manuscript/202405.1726/v1","date":1716808497000,"content":"This study explores the potential of a deep-water hydroponic system integrated with Internet of Things (IoT) technology to enhance the production of Chinese celery (Apium graveolens), a popular leafy vegetable with culinary and medicinal properties. Traditional soil cultivation of Chinese celery can take 75-90 days and is susceptible to fungal diseases. To address these challenges, a 2 x 6 meter hydroponic greenhouse was designed and constructed to accommodate 1,000 plants. The study investigated the effects of two key factors on celery growth and yield: daily light exposure (660 nm wavelength, 6:00-11:00 p.m.) and internal temperature regulation using a fog sprayer when temperatures surpassed 35°C. The experiment was conducted in four separate hydroponic houses, each with different factor controls: House 1 (light and temperature), House 2 (temperature only), House 3 (light only), and House 4 (natural conditions). The IoT-based system maintained optimal water conductivity and pH levels, monitored through the Blynk application and regulated by an ESP32 microcontroller. Sensor data, including water conductivity, pH, internal temperature, humidity, and water temperature, were collected throughout the study. Results revealed significant differences in weight and final yield among the houses, with House 1 achieving the highest yield, 13.91% higher than House 4. A comparison between Houses 2 and 3 indicated that temperature played a more critical role than light in celery cultivation under similar conditions. An economic analysis demonstrated the cost-effectiveness of investing in the automated control system, with House 1 being 14% more profitable than House 4 and a breakeven point achieved at 27 months. This research highlights the benefits of IoT-controlled hydroponic systems in elevating Chinese celery production towards sustainable and efficient practices, offering valuable insights for modern agriculture.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"64f12feb4932a971f265724e7053618312805eb58092a2512d97825acd2f598b","category":"Interdisciplinary"}