{"title":"SET DOMAIN GROUP 711-mediated H3K27me3 methylation of cytokinin metabolism genes regulates organ size in rice","link":"https://academic.oup.com/plphys/article/194/4/2069/7329088?rss=1","date":1698105600000,"content":"<span><div>Abstract</div>Organ size shapes plant architecture during rice (<span>Oryza sativa</span>) growth and development, affecting key factors influencing yield, such as plant height, leaf size, and seed size. Here, we report that the rice Enhancer of Zeste [E(z)] homolog SET DOMAIN GROUP 711 (OsSDG711) regulates organ size in rice. Knockout of <span>OsSDG711</span> produced shorter plants with smaller leaves, thinner stems, and smaller grains. We demonstrate that OsSDG711 affects organ size by reducing cell length and width and increasing cell number in leaves, stems, and grains. The result of chromatin immunoprecipitation followed by deep sequencing (ChIP-seq) using an antitrimethylation of histone H3 lysine 27 (H3K27me3) antibody showed that the levels of H3K27me3 associated with cytokinin oxidase/dehydrogenase genes (<span>OsCKX</span>s) were lower in the <span>OsSDG711</span> knockout line <span>Ossdg711</span>. ChIP-qPCR assays indicated that OsSDG711 regulates the expression of <span>OsCKX</span> genes through H3K27me3 histone modification. Importantly, we show that OsSDG711 directly binds to the promoters of these <span>OsCKX</span> genes. Furthermore, we measured significantly lower cytokinin contents in <span>Ossdg711</span> plants than in wild-type plants. Overall, our results reveal an epigenetic mechanism based on OsSDG711-mediated modulation of H3K27me3 levels to regulate the expression of genes involved in the cytokinin metabolism pathway and control organ development in rice. <span>OsSDG711</span> may be an untapped epigenetic resource for ideal plant type improvement.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"64fb86a53e0edb898246bfdd0cab7ded6f3eb9bfc021dda07ae38c288ea98f1f","category":"Environment"}