{"title":"Tour de France logistics provider used 50,000 litres of ‘green diesel’ at this year’s race","link":"https://www.cyclist.co.uk/news/tour-de-france-xpo-logistics-hvo","date":1690562355000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/news/tour-de-france-xpo-logistics-hvo\">Tour de France logistics provider used 50,000 litres of ‘green diesel’ at this year’s race</a></p>\n\n<p>The <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\" target=\"_blank\">Tour de France</a> is an enormous operation and wouldn’t function without an enormous fleet of vehicles supporting teams, organisers, TV, photographers, medics, mechanics and the <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-caravan\" target=\"_blank\">caravan</a>. There’s also the task of transporting all the barriers, podiums, arches, signage and start and finish villages, that’s where XPO Logistics comes in.</p>\n\n\n\n<p>XPO has been an official technical partner of the Tour de France since 1980, ensuring all logistical paraphernalia at the Tour – and more recently the Tour de France Femmes – is in place for each day, before promptly being shipped to their next destination. For the men’s race that’s 34 trucks and more than 70 drivers transporting 690 tons of equipments every day, covering 3,404km.</p>\n\n\n\n<p>It’s a big part of what the Tour de France needs to function, however historically it’s also been a huge part of what makes the race a massive polluter. </p>\n\n\n\n<figure><img width=\"970\" height=\"546\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-x-XPO-2023-HVO-970x546.jpg\" alt=\"white lorry with writing on the side\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-x-XPO-2023-HVO-970x546.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-x-XPO-2023-HVO-300x169.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-x-XPO-2023-HVO-768x432.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-x-XPO-2023-HVO-1536x864.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-x-XPO-2023-HVO-2048x1152.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-x-XPO-2023-HVO-750x422.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-x-XPO-2023-HVO-1140x641.jpg 1140w\" /><figcaption>XPO Logistics</figcaption></figure>\n\n\n\n<p><em>Cyclist </em><a href=\"https://www.cyclist.co.uk/in-depth/the-hidden-cost-of-the-tour\" target=\"_blank\">reported last year</a> that the Tour de France emitted 216,388 tons of carbon dioxide equivalents (with one ton approximately what a 4,100km flight emits per passenger) in 2021, when it was last audited. </p>\n\n\n\n<p>It’s a huge amount, however it shows a 40% reduction since 2013 and another audit is due this year. XPO has been part of that mission to get the numbers down and this year committed to running its entire fleet on biodegradable hydrotreated vegetable oil (HVO), which it claims would save around 110 tons of carbon dioxide, before switching a few of its fleet for electric vehicles once the race reached Paris.</p>\n\n\n\n<p>‘Across our entire business we’re always looking at how we can try to reduce our impact on the planet,’ says XPO’s UK and Ireland managing director Dan Myers, who is a cyclist himself and has competed at the Grand Fondo World Championships. ‘For example, 100% of our electricity in the UK is Tier 1 renewables, so we won’t take energy from things such as biomass burning. It’s all either wind, wave, hydro or solar.</p>\n\n\n\n<p>‘When it comes to the physical movement of goods there are a number of options available to us. We’ve got gas trucks, which are less carbon-intensive than diesel trucks. We have the opportunity of looking at electric vehicles, although they come with certain limitations such as charging requirements and range issues. And then you’ve got alternative fuels, like HVO.’</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/what-is-greenwashing-cycling\">What is greenwashing and how does it impact cycling?</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/the-hidden-cost-of-the-tour\">Examining the environmental impact of the Tour de France</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/what-is-the-environmental-impact-of-your-bike-rides\">What’s the environmental impact of riding your bike?</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>HVO is known as ‘green diesel’ or ‘renewable diesel’ as it’s fossil-free but very similar to diesel and can therefore be used as a drop-in replacement for diesel in trucks, tankers, boats and more. HVO is claimed to reduce up to 90% of CO2 as well as reduced nitrogen oxide and particulates. It’s made from cooking oils, waste from food processing and non-food grade crops. </p>\n\n\n\n<p>‘It’s a very easy adoption for most in our industry,’ says Myers. ‘There is a premium associated with it, though, because the production capacity isn’t where it would need to be. We’re happy to pay that premium but there comes a point where it’s more challenging. Effectively that’s the solution we’ve adopted for primarily for the Tour. It’s about 100 tonnes of CO2 that the transfer from diesel to HVO will save for the Tour, and we also do the Tour Femmes as well, which I think is closer to around 13 tonnes of CO2 saved.’</p>\n\n\n\n<p>Infrastructure does make things tricky, as it’s currently just not possible to fuel XPO’s fleet fully on HVO for all three weeks, however XPO has a network of fuel stations that it used to ensure the majority was HVO. Its 34-vehicle fleet was refuelled three times during the race, using almost 50,000L of HVO – each truck having capacity for 400-600L and autonomy for 1,000-1,500km – and XPO says where it was absolutely necessary to use diesel it injected the equivalent in HVO into its station network.</p>\n\n\n\n<p>While XPO Logistics is only a single cog in the Tour de France’s huge machine, it’s essential for the future of the race that these steps are taken.</p>\n\n\n\n<p><strong>Read more: <a href=\"https://www.cyclist.co.uk/in-depth/the-hidden-cost-of-the-tour\" target=\"_blank\">Examining the environmental impact of the Tour de France</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/news/tour-de-france-xpo-logistics-hvo\">Tour de France logistics provider used 50,000 litres of ‘green diesel’ at this year’s race</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Will Strickson &#124; Deputy Website Editor","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"65049929afa74ecee6f3e8850e45c17a7fd5e3285f01a4f26919254e12cff5df","category":"Cycling"}