{"title":"Marcel Kittel on the new generation of sprinters, mental health and the perfect sprint","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/marcel-kittel-on-the-new-generation-of-sprinters-mental-health-and-the-perfect-sprint","date":1637083612000,"content":"\n      <p><span>Two and a half years have passed since Marcel Kittel took part in a competitive bike race. The </span><span>German finished 99th at Scheldeprijs in April 2019, a race he won five times between 2012 and 2017. Weeks after</span><span>, Kittel announced that he would be taking a break from racing. Although the initial intention was to return to the pro peloton, he announced his retirement months later. </span>We sat down with Kittel at Rouleur Live 2021.</p>\n<div></div>\n<p><span>“</span><span>I’m really happy with my life now and I’m enjoying my time after my career. I’m looking back on a beautiful chapter in my life being a professional cyclist”, said Kittel. “And now it’s time for family. I have two beautiful kids, I’m a student, I’m still working in the cycling industry. It feels like my life is very rich now and full of new experiences.</span><span>”</span></p>\n<p><span>Now able to reflect on his career in hindsight, Kittel dissected his fourteen victories at the Tour de France, explaining the day his team executed the perfect sprint.</span></p>\n<p><span><span>“The perfect sprint that I did in my career is, in my opinion, the one that we did on stage three of the Tour de France in London in 2014”, remembers Kittel.</span></span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/sw01_TDF_Stage3-min_1024x1024.jpg?v=1636673829\" />Marcel Kittel wins stage 3 of the 2014 Tour de France, the perfect sprint. (Image credit: Alex Broadway/SWpix)</span></i></p>\n<p><span>Team Giant - Shimano took to the front of the peloton in the final few kilometres, entering the final corner and passing Buckingham Palace at the head of the bunch. Tom Veelers — Kittel’s leadout man — was released here, dropping Kittel off with 150 metres left. Peter Sagan had been glued to Kittel’s wheel throughout the finale, but could only cling onto his draft to hold on for second place, while Kittel powered to one of four wins he'd claim at the 2014 Tour de France.</span></p>\n<p><span>“We finished right in front of Buckingham Palace. It was a perfect finish line, we did a perfect leadout as a team, and it was a perfect finish with all of the spectators, I’m really proud of that one,” reflected Kittel.</span></p>\n<p><span>Marcel still watches plenty of pro cycling, even though he admitted that he doesn’t plan his life around the TV schedule, trying to cram in as many races as possible. He provided some insight into the new generation of sprinters, revealing who has made an impression on him this season. </span><span>“I think someone that was impressive, or is potentially very impressive, is David Dekker from Jumbo-Visma. He’s a strong, young rider who wants to show himself.” </span></p>\n<p><span>Dekker joined Jumbo-Visma in 2021 and finished second twice at the UAE Tour. He also headed to his first Grand Tour at the Giro d’Italia.</span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Rouleur-LIve-Saturday-h-6_1024x1024.jpg?v=1637083566\" /></span></i></p>\n<p><i><span>Image credit: Sean Hardy</span></i></p>\n<p><span>Mental health is being talked about more than ever, not only in cycling, but across the entire sports landscape — </span><a href=\"https://racing.trekbikes.com/stories/trek-segafredo-women/why-trek-segafredo-is-adding-a-psychologist-to-its-performance-team\" target=\"_blank\"><span>Trek-Segafredo have recently hired a dedicated sports psychologist</span></a><span>, Dr. Elisabetta Borgia. </span>Kittel spoke of the importance of mental health in cycling, and just how much it can impact performance.</p>\n<p><span>“It’s very important because mental health means you are in balance. And that consists of physical performance and also mental performance, you need to be able to bring both together to be successful. So we have to talk about it simply because of that reason, but also because cycling is such a hard sport — there is no other sport that has so many racedays, over four, five, six hours a day. And you need to somehow be able to process that to get through it and keep up the motivation for every day, and so mental health plays a huge role,\" explained Kittel.</span></p>\n<p><span>“The race is won, in the end, not only by the physical performance but especially by the mental performance. So, it’s important to prepare riders for it but also the whole lifestyle — being so many days away from home is very demanding and there is simply no space left for your private life — how do you balance that? That’s something that you can learn by yourself, I learned it the hard way. But it’s also something that you can give as a sports director or a sports psychologist.” </span></p>\n<p><span>To conclude our discussion, we asked Kittel if he could give a piece of advice to hi</span><span>mself as a neo-pro, what would he say?</span></p>\n<p><span>“</span><span>One thing. It would be: enjoy every second of your professional career, but also of your life.” </span></p>\n<p><i><span>Cover image: Sean Hardy</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6510c72193f4ce13e1169450be158d04e193084f1d517ad08c13cbeb614f3731","category":"Cycling"}