{"title":"Light weights are as effective as heavy weights for muscle activation in the Hammerobics exercise","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308640","date":1726581600000,"content":"<p>by Koji Murofushi, Tomoki Oshikawa, Koji Kaneoka, Hiroshi Akuzawa, Sho Mitomo, Genki Hatano, Hidetaka Furuya, Kenji Hirohata, Kazuyoshi Yagishita</p>\r\nPurpose <p>We previously reported that a Hammerobics exercise using weights can enhance trunk and lower extremity muscles, some studies suggested that training effects could also be expected without heavy weights. If the muscle activity induced by Hammerobics swinging with a ’light plastic ball’ equals or surpasses that of the isometric static squat and synchronized squat with a heavy ball, this training approach could alleviate joint strain, fostering an exercise regimen universally accessible across generations, benefit for workouts sports and rehabilitation.</p> Methods <p>Fifteen healthy men participated in this study. By using surface electromyography, muscle activities for the abductor hallucis, tibialis anterior, tibialis posterior, peroneus longus, rectus femoris, biceps femoris long head, semitendinosus, gluteus maximus, multifidus, and internal oblique muscles were measured during a light Hammerobics synchronized squat (HSS-light), Hammerobics synchronized squat, and conventional isometric squat, and statistically compared.</p> Results <p>The front-to-back tibialis anterior activity of HSS-light was significantly higher than that of conventional isometric squat. The activities of all other muscles, except for the multifidus, were not significantly different between these exercises in the front-to-back and back-to-front phases. Compared to the Hammerobics synchronized squat, the light Hammerobics synchronized squat showed no differences in front-to-back tibialis anterior, rectus femoris, biceps femoris long head, and internal oblique activities and back-to-front abductor hallucis, tibialis anterior, rectus femoris, and internal oblique activities.</p> Conclusion <p>The HSS-light could stimulate muscles to the same level as the conventional isometric squat without weight bearing. While the HSS-light was less effective than the Hammerobics synchronized squat, there was no significant difference in internal oblique, rectus femoris, and tibialis anterior activities between these exercises. Hence, the HSS-light is an exercise method that can be viable approach to promoting accessible workouts sports and rehabilitation.</p>","author":"Koji Murofushi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6510d95bd71882651a1575e82ca103b8887069831fccb0f6d9cf7c153bd100c5","category":"Interdisciplinary"}