{"title":"New customization options for Terraform Cloud projects","link":"https://www.hashicorp.com/blog/new-customization-options-for-terraform-cloud-projects","date":1691521200000,"content":"<p>Organizations trying to scale quickly and securely are sometimes forced to choose between productivity and security. This conundrum is especially common when applying policy sets and assigning user permissions. So how can organizations empower users with a self-service model, while also enforcing policies across the organization? Customization is the answer.</p>\n\n<p>Today, we are excited to introduce two new improvements to HashiCorp Terraform Cloud: customizable project permissions and policy assignment, to help organizations scale securely by providing more granular customization options for adherence to internal policies and external regulations. These updates empower teams to manage their infrastructure effectively.</p>\n\n<h2>Customizable project permissions</h2>\n\n<p>Back in January, we introduced a new organizational structure in Terraform Cloud called <a href=\"https://www.hashicorp.com/blog/terraform-cloud-adds-projects-to-organize-workspaces-at-scale\">projects</a>, allowing teams to safely self-manage groups of related workspaces with four predefined roles: Admin, Maintain, Write, and Read at the project level. But as organizations look to delegate more responsibility to help their platform teams achieve scale, they need more flexibility to customize permissions, to avoid giving users unnecessary privileges because no predefined role meets their exact needs. </p>\n\n<p>Customizable project permissions for Terraform Cloud Standard and Plus (coming soon to Terraform Enterprise) let organizations tailor project-level permissions, in addition to the predefined roles, to maintain the least-privilege approach and reduce risks.</p>\n\n<p>Administrators can assign teams one of the four predefined roles at a project level, or use the new custom option to pick and choose the appropriate level of permissions to assign out to a team. Examples include workspace permissions, such as the ability to execute runs or view state files that apply to all workspaces in the project.</p>\n<img src=\"https://www.datocms-assets.com/2885/1691447437-screenshot-2023-07-27-at-1-44-11-pm.png\" alt=\"Customizable\" /><h2>Customizable policy assignment</h2>\n\n<p>According <a href=\"https://www.hashicorp.com/state-of-the-cloud#secrets-management-and-access-control-becoming-key-security-issues\">HashiCorp 2023 State of Cloud Strategy Survey</a>, security is ranked as the #1 multi-cloud success factor. That’s why many customers see policy enforcement as the first line of defense to ensure their infrastructure is secure and compliant.</p>\n\n<p>However, globally enforced policy sets can’t make exceptions for individual workspaces, leaving administrators no choice but to manually apply policy sets to workspaces one at a time. So newly created workspaces, such as those created through <a href=\"https://developer.hashicorp.com/terraform/tutorials/cloud/no-code-provisioning\">no-code provisioning</a> workflows, can become security gaps since policies won’t be enforced automatically.</p>\n\n<p>Customizable policy assignment for Terraform Cloud (coming soon to Terraform Enterprise), allows organizations to assign policy sets at the project level in addition to the previously available organization or workspace levels, maintaining security and compliance with more flexibility. Policies are applied to all current and future workspaces in a project, making self-service provisioning achievable without sacrificing the protection offered by policy guardrails.</p>\n<img src=\"https://www.datocms-assets.com/2885/1691447471-screenshot-2023-07-27-at-1-54-15-pm.png\" alt=\"Customizable\" /><p>Coming in early September, another new capability will allow a list of workspaces to be excluded from a policy set. This is helpful when a single workspace may have a policy failure and the organization needs to make a temporary exception for that workspace to unblock its owners from provisioning infrastructure while investigating the policy issue.</p>\n<img src=\"https://www.datocms-assets.com/2885/1691447490-screenshot-2023-07-27-at-1-56-33-pm.png\" alt=\"Soon\" /><h2>Try Terraform Cloud today</h2>\n\n<p>Terraform is the industry standard for provisioning and managing any infrastructure. With more customization options in project permissions and policy assignment, organizations can now tailor solutions based on their specific needs to scale confidently. They no longer need to choose between security and productivity.</p>\n\n<p>Try these new features today — and if you are new to Terraform, <a href=\"https://app.terraform.io/public/signup/account\">sign up for Terraform Cloud</a> and get started using the Free offering. For more information, check out the <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/users-teams-organizations/permissions#project-permissions\">documentation for project permissions </a>and the <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/policy-enforcement/manage-policy-sets\">documentation for policy set assignment</a>.</p>\n","author":"Sarah Hernandez","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"651109a870335eacce6ac4b80763509ffc9d20b75bc49d16cbfcadaf42f40132","category":"Tech"}