{"title":"Determination of site‐specific nitrogen cycle reaction kinetics allows accurate simulation of in situ nitrogen transformation rates in a large North American estuary","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12628?af=R","date":1720232065000,"content":"<h2>Abstract</h2>\n<p>Nitrogen (N) bioavailability affects phytoplankton growth and primary production in the aquatic environment. N bioavailability is partly determined by biological N cycling processes that either transform N species or remove fixed N. Reliable estimates of their kinetic parameters can help understand the distribution of N cycling processes. However, available estimates of kinetic parameters are often derived from microbial isolates and may not be representative of the natural environment. Observations are particularly lacking in estuarine and coastal waters. We conducted isotope tracer addition incubations to evaluate substrate affinities of nitrification, denitrification and anammox in the Chesapeake Bay water column. The half-saturation constant for ammonia oxidation ranged from 0.38 to 0.75 <i>μ</i>M ammonium, substantially higher than observed in the open oceans. Half-saturation constants for denitrification—0.92–1.86 <i>μ</i>M nitrite or 1.15 <i>μ</i>M nitrate—were within the lower end or less than those reported for other aquatic environments and for denitrifier isolates. Interestingly, water column denitrification potential was comparable to that of sedimentary denitrification, highlighting the contribution of the water column to N removal during anoxia. Mostly undetectable anammox rates prevented us from deriving the half-saturation constants, suggesting a low affinity of anammox. Using these substrate kinetics, we were able to predict in situ N cycling rates and explain the vertical distribution of N nutrient concentrations. Our newly derived substrate kinetics parameters can be useful for improving model representation of N nutrient dynamics in estuarine and coastal waters, which is critical for assessing the ecosystem productivity and function.</p>","author":"Weiyi Tang, \nSamantha G. Fortin, \nNaomi Intrator, \nJenna A. Lee, \nMoriah A. Kunes, \nAmal Jayakumar, \nBess B. Ward","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"651391d9b80a4e3c73233a415fc9e9fb06f857d6e444bdd20b8e48e661cf2eab","category":"Environment"}