{"title":"Utilization of functional feed additives to produce cost‐effective, ecofriendly aquafeeds high in plant‐based ingredients","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12824?af=R","date":1702540257000,"content":"<h2>Abstract</h2>\n<p>Fishmeals (FM) are the most superior protein sources in aquafeed. World-wide growing demand and limited supply of FM limit its use as sole protein sources in aquafeed and force fish nutritionists to develop alternate protein-based aquafeeds. However, increasing alternate proteins over a certain percentage reduces fish performance. Many attempts have been made (viz., manipulation of processing technology of feed ingredients and feed formulations, supplementation strategy) to overcome the negative effects of increasing alternative protein inclusion in aquafeeds. Among them, supplementation of functional feed additives (FuFAs) has received promising attention. Recently, several FuFA (nucleotides, organic acid, probiotics, prebiotics, and certain amino acids) have been administrated in alternative protein-based aquafeeds and demonstrate increased efficiency of alternative protein utilization along with improved fish growth and health performances. However, numerous gaps remain in existing knowledge about the administration of exogenous FuFA in alternative protein-based aquafeeds, including the effects on digestion, age/size-related responses, species variations, absorption, metabolism, and influences on physiological responses. Application of biochemical and molecular technologies is important to better understand the underlying mechanisms of FuFA functions in alternate protein-based aquafeed to improve fish and shrimp performance. Efforts are also needed by researchers and industrialists regarding production technologies to reduce functional feed supplement costs. Moreover, in-depth research knowledge is needed considering the use of functional feeds to combat fish diseases and reduce dependence on antibiotics and chemical therapeutants, thereby making aquaculture more eco-friendly.</p>","author":"Md. Sakhawat Hossain, \nBrian C. Small, \nVikas Kumar, \nRonald Hardy","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"651bd7998f8d9850192e6b344586e794b973c6be2d1bd6b38cedd10a9485ed48","category":"Environment"}