{"title":"External endpoints and testing of task states now available in AWS Step Functions","link":"https://aws.amazon.com/blogs/aws/external-endpoints-and-testing-of-task-states-now-available-in-aws-step-functions/","date":1701052614000,"content":"<p>Now <a href=\"https://aws.amazon.com/step-functions\">AWS Step Functions</a> HTTPS endpoints let you integrate third-party APIs and external services to your workflows. HTTPS endpoints provide a simpler way of making calls to external APIs and integrating with existing SaaS providers, like <a href=\"https://stripe.com/\" target=\"_blank\">Stripe</a> for handling payments, <a href=\"https://github.com/\" target=\"_blank\">GitHub</a> for code collaboration and repository management, and <a href=\"https://www.salesforce.com/\" target=\"_blank\">Salesforce</a> for sales and marketing insights. Before this launch, customers needed to use an AWS Lambda function to call the external endpoint, handling authentication and errors directly from the code.</p> \n<p>Also, we are announcing a new capability to test your task states individually without the need to deploy or execute the state machine.</p> \n<p>AWS Step Functions is a visual workflow service that makes it easy for developers to build distributed applications, automate processes, orchestrate microservices, and create data and machine learning (ML) pipelines. Step Functions integrates with over 220 AWS services and provides features that help developers build, such as built-in error handling, real-time and auditable workflow execution history, and large-scale parallel processing.</p> \n<p><span><strong>HTTPS endpoints<br /> </strong></span>HTTPS endpoints are a new resource for your task states that allow you to connect to third-party HTTP targets outside AWS. Step Functions invokes the HTTP endpoint, deliver a request body, headers, and parameters, and get a response from the third-party services. You can use any preferred HTTP method, such as GET or POST.</p> \n<p>HTTPS endpoints use <a href=\"https://docs.aws.amazon.com/eventbridge/latest/APIReference/API_Connection.html\" target=\"_blank\">Amazon EventBridge connections</a> to manage the authentication credentials for the target. This defines the authorization type used, which can be a basic authentication with a username and password, an API key, or OAuth. EventBridge connections use <a href=\"https://aws.amazon.com/secrets-manager/\" target=\"_blank\">AWS Secrets Manager</a> to store the secret. This keeps the secrets out of the state machine, reducing the risks of accidentally exposing your secrets in logs or in the state machine definition.</p> \n<p><span><strong>Getting started with HTTPS endpoints<br /> </strong></span>To get started with HTTPS endpoints, first you need to <a href=\"https://docs.aws.amazon.com/eventbridge/latest/userguide/eb-api-destinations.html#eb-api-destination-connection\" target=\"_blank\">create an EventBridge connection</a>. Then you need to create a new <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a> role and give permissions so your state machine can access the connection resource, get the secret from Secrets Manager, and get permissions to invoke an HTTP endpoint.</p> \n<p>Here are the policies that you need to include in your state machine execution role:</p> \n<div> \n <pre><code>{\n    \"Version\": \"2012-10-17\",\n    \"Statement\": [\n        {\n            \"Effect\": \"Allow\",\n            \"Action\": [\n                \"secretsmanager:GetSecretValue\",\n                \"secretsmanager:DescribeSecret\"\n            ],\n            \"Resource\": \"arn:aws:secretsmanager:*:*:secret:events!connection/*\"\n        }\n    ]\n}\n{\n    \"Version\": \"2012-10-17\",\n    \"Statement\": [\n        {\n            \"Sid\": \"RetrieveConnectionCredentials\",\n            \"Effect\": \"Allow\",\n            \"Action\": [\n                \"events:RetrieveConnectionCredentials\"\n            ],\n            \"Resource\": [\n                \"arn:aws:events:us-east-2:123456789012:connection/oauth_connection/aeabd89e-d39c-4181-9486-9fe03e6f286a\"\n            ]\n        }\n    ]\n}\n{\n    \"Version\": \"2012-10-17\",\n    \"Statement\": [\n        {\n            \"Sid\": \"InvokeHTTPEndpoint\",\n            \"Effect\": \"Allow\",\n            \"Action\": [\n                \"states:InvokeHTTPEndpoint\"\n            ],\n            \"Resource\": [\n                \"arn:aws:states:us-east-2:123456789012:stateMachine:myStateMachine\"\n            ]\n        }\n    ]\n}\n</code></pre> \n</div> \n<p>After you have everything ready, you can create your state machine. In your state machine, add a new task state to call a third-party API. You can configure the <strong>API endpoint</strong> to point to the third-party URL you need, set the correct HTTP <strong>method</strong>, pick the connection Amazon Resource Name (ARN) for the connection you created previously as the <strong>authentication</strong> for that endpoint, and provide a <strong>request body </strong>if needed. In addition, all these parameters can be set dynamically at runtime from the state JSON input.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/13/https_new-image00-1.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/13/https_new-image00-1.png\" alt=\"Call a third party API\" width=\"1636\" height=\"1482\" /></a></p> \n<p>Now, making external requests with Step Functions is easy, and you can take advantage of all the configurations that Step Functions <a href=\"https://docs.aws.amazon.com/step-functions/latest/dg/concepts-error-handling.html#error-handling-fallback-states\" target=\"_blank\">provides to handle errors</a>, such as retries for transient errors or momentary service unavailability, and <a href=\"https://aws.amazon.com/blogs/compute/introducing-aws-step-functions-redrive-a-new-way-to-restart-workflows/\">redrive for errors</a> that require longer investigation or resolution time.</p> \n<p><span><strong>Test state<br /> </strong></span>To accelerate feedback cycles, we are also announcing a new capability to test individual states. This new feature allows you to test states independently from the execution of your workflow. This is particularly useful for testing endpoints configuration. You can change the input and test the different scenarios without the need to deploy your workflow or execute the whole state machine. This new feature is available in all task, choice, and pass states.</p> \n<p>You will see the testing capability in the Step Functions Workflow Studio when you select a task.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/09/https_image02.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/09/https_image02.png\" alt=\"Test state button\" width=\"1748\" height=\"560\" /></a></p> \n<p>When you choose the <strong>Test state</strong>, you will be redirected to a different view where you can test the task state. You can test that the state machine role has the right permissions, the endpoint you want to call is correctly configured, and verify that the data manipulations work as expected.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/https_new-image01.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/21/https_new-image01.png\" alt=\"How to test a state\" width=\"2274\" height=\"1470\" /></a></p> \n<p><span><strong>Availability<br /> </strong></span>Now, with all the features that Step Functions provides, it’s never been easier to build state machines that can solve a wide variety of problems, like payment flows, workflows with manual inputs, and integration to legacy systems. Using Step Functions HTTPS endpoints, you can directly integrate with popular payment platforms while ensuring that your users’ credit cards are only charged once and errors are handled automatically. In addition, you can test this new integration even before you deploy the state machine using the new test state feature.</p> \n<p>These new features are available in all AWS Regions except Asia Pacific (Hyderabad), Asia Pacific (Melbourne), AWS Israel (Tel Aviv), China, and GovCloud Regions.</p> \n<p>To get started you can try the “Generate Invoices using Stripe” <a href=\"https://signin.aws.amazon.com/signin?redirect_uri=https%3A%2F%2Fus-east-1.console.aws.amazon.com%2Fstates%2Fhome%3Fregion%3Dus-east-1%26state%3DhashArgs%2523%252FsampleProjects%26isauthcode%3Dtrue&amp;client_id=arn%3Aaws%3Aiam%3A%3A015428540659%3Auser%2Fstates&amp;forceMobileApp=0&amp;code_challenge=SwDIs8O0-5_Z6BIhTAHm9ZP7S6Q0sPo_-GhmA3AaRoI&amp;code_challenge_method=SHA-256\">sample project from Step Functions in the AWS Managment Console</a> or check out the <a href=\"https://docs.aws.amazon.com/step-functions/latest/dg/welcome.html\">AWS Step Functions Developer Guide</a> to learn more.</p> \n<p>— <a href=\"https://twitter.com/mavi888uy\" target=\"_blank\">Marcia</a></p>","author":"Marcia Villalba","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"652490892eef5e673a48eff7f911d4f1991cad4f7a56b5d868d205c611db5384","category":"Tech"}