{"title":"Second-gen AirTag set for starring role in Vision Pro ecosystem","link":"https://www.macworld.com/article/2017989/second-gen-airtag-starring-role-vision-pro-ecosystem.html","date":1691057925000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>In a brief and cryptic tweet, the widely respected industry pundit Ming-Chi Kuo has hinted that the second-gen version of Apple’s AirTag tracker will play an important role in the evolving Vision Pro ecosystem.</p>\n\n\n\n<p>Quote-tweeting a summer 2022 post in which he praised the <a href=\"https://www.macworld.com/article/346345/apple-airtag-review.html\">original AirTag</a>‘s sales numbers and cautiously suggested that they could be grounds for a second model, the analyst upgraded this to a firmer prediction that AirTag 2 “will likely go to mass production in 4Q24.” That’s still a long way off, of course, and it’s worth bearing in mind that mass production generally pre-dates actual shipments to customers by a matter of months. (The original AirTags had reportedly entered mass production <a href=\"https://www.macworld.com/article/675041/apples-airtags-already-in-mass-production.html\">by September 2020</a>, but didn’t come out until spring 2021.) Realistically we won’t be seeing the second AirTag model until 2025.</p>\n\n\n\n<figure><div>\n<blockquote><p>預測更新：<br />1. AirTag 2可能將在4Q24量產。<br />2. 我相信空間運算是Apple想建立的新生態，欲以Vision Pro為核心整合其他裝置，包括AirTag 2。<br />==<br /><br />Prediction update: <br />1. AirTag 2 will likely go to mass production in 4Q24.<br />2. I believe that spatial computing is a new ecosystem that Apple wants… <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/GXkDIYLz84&amp;xcust=1-1-2017989-1-0-0&amp;sref=https://www.macworld.com/feed\">https://t.co/GXkDIYLz84</a></p>— 郭明錤 (Ming-Chi Kuo) (@mingchikuo) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1686754705693888512?ref_src=twsrc%5Etfw&amp;xcust=1-1-2017989-1-0-0&amp;sref=https://www.macworld.com/feed\">August 2, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>But when it does finally arrive–roughly four years after its predecessor, based on this report–the AirTag 2 could be headed for an expanded role in Apple’s product line-up. Kuo speculates that the device will be integrated into the company’s spatial computing ecosystem, with the upcoming <a href=\"https://www.macworld.com/article/1944516/apple-vision-pro-hands-on-feaures-design-fit.html\">Vision Pro headset</a> as its centerpiece.</p>\n\n\n\n<p>It’s unclear from Kuo’s tweet how exactly the AirTag will fit in with Vision Pro, given that its predecessor has such a tight mission and feature set: it’s simply a Bluetooth tracker, and its job is to be found. Replies to the tweet discuss the possibility that headset users will be able to see the tracker’s location in three dimensions using augmented reality, rather than having to interpret the two-dimensional mapping on an iPhone screen, or following the sound from its speaker. This ought to make finding a lost object easier in a multi-storey building, but one wonders if the additional step of putting on the headset will feel worthwhile for such a simple job. Then again, it’s difficult pre-launch to grasp how seamlessly Vision Pro is going to fit into our lives; perhaps putting it on will come to feel as natural as pulling the iPhone out of a pocket.</p>\n\nAccessories</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"652b5c8d36f2613d8664bb8fc561855bafc27fd907272791ecaa338e49ce6abd","category":"Apple"}