{"title":"34 A survey of the Oklahoma State University Cowculator user preferences","link":"https://academic.oup.com/jas/article/102/Supplement_1/5/7617943?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>The Oklahoma State University Cowculator is a free, easy to use model designed to assist cattle producers in making informed decisions regarding the nutrition of their herd. The Cowculator operates as a spreadsheet-based model, which collects information from the 2016 National Academy of Science, Engineering, and Medicine’s Nutrient Requirements for Beef Cattle, previous editions of the book, and previous research data. Producers have the option to adjust animal characteristics, feed and forage values, and diet composition to fit certain production objectives. In 2022, a Qualtrics survey was developed to determine perception of users of the program and their likes and dislikes. When users download the program, they are required to enter their name, email address, and zip code. A link to the survey was emailed to each address registered within the Cowculator database, with an email reminder sent out 30 days later. The survey yielded 233 responses. According to user download data, in 2022 the Cowculator was downloaded 2,090 times from 41 states and 53 countries. Based on email addresses ending in “.edu” the program was downloaded by faculty or students from 135 different universities, colleges, or other technical institutions. Of the respondents, 60% identified as beef cattle producers, 16% as industry professionals (e.g., consultants, veterinarians), 11% as extension personnel, 7% as research or teaching faculty, and 6% as students. Regarding the type of enterprise which the program was used for, 52% responded with cow/calf, 33% growing or stocker cattle, and 15% finishing cattle. The survey indicated that 88% of respondents were able to utilize the program effectively to evaluate or modify their nutrition program, while 16% indicated they were not successful in using the program. The survey asked respondents to give their opinion on the accuracy of the program. 69% indicated that it yielded “mostly accurate” projections, 23% responded with “very accurate”, and 5% perceived the program to be inaccurate or marginally accurate. Users of the program estimated the average annual benefit of the program to be $1,500. The respondents were asked to select what they liked about the program and what they felt needed improvement. It was indicated that the most liked features were that the program was free and that it was easy to use. The features that were indicated as needing improvement where the limited pre-added list of feedstuffs and the lack of availability of a simplified app version of the program. The results of this survey provide valuable insights regarding user demographics, as well as what can further be adjusted within the Cowculator to best fit the needs of the users.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"653235f3fb4974f2cd6a6db0500165b5a6aab0db029706f4b9139f24c8bff83b","category":"Environment"}