{"title":"Simulating cardiac fluid dynamics in the human heart","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae392/7754726?rss=1","date":1725926400000,"content":"<span><div>Abstract</div>Cardiac fluid dynamics fundamentally involves interactions between complex blood flows and the structural deformations of the muscular heart walls and the thin valve leaflets. There has been longstanding scientific, engineering, and medical interest in creating mathematical models of the heart that capture, explain, and predict these fluid–structure interactions (FSIs). However, existing computational models that account for interactions among the blood, the actively contracting myocardium, and the valves are limited in their abilities to predict valve performance, capture fine-scale flow features, or use realistic descriptions of tissue biomechanics. Here we introduce and benchmark a comprehensive mathematical model of cardiac FSI in the human heart. A unique feature of our model is that it incorporates biomechanically detailed descriptions of all major cardiac structures that are calibrated using tensile tests of human tissue specimens to reflect the heart’s microstructure. Further, it is the first FSI model of the heart that provides anatomically and physiologically detailed representations of all four cardiac valves. We demonstrate that this integrative model generates physiologic dynamics, including realistic pressure–volume loops that automatically capture isovolumetric contraction and relaxation, and that its responses to changes in loading conditions are consistent with the Frank–Starling mechanism. These complex relationships emerge intrinsically from interactions within our comprehensive description of cardiac physiology. Such models can serve as tools for predicting the impacts of medical interventions. They also can provide platforms for mechanistic studies of cardiac pathophysiology and dysfunction, including congenital defects, cardiomyopathies, and heart failure, that are difficult or impossible to perform in patients.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"653819e4da5a773c519f5e9431fb67681c47fd1568d775be3580fef4e927a257","category":"Interdisciplinary"}