{"title":"109 Dam and calf influences on colostrum yield and quality in beef cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/276/7757439?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>To determine factors affecting colostrum yield and quality, data from 148 cow-calf pairs over 6 experiments were combined. In each experiment, single rear quarter colostrum yield was obtained post-calving but pre-suckling. Colostrum IgG was determined by ELISA, and colostrum lactose, triglycerides (as a measure of total fat), and protein were determined by colorimetric analyses. Total IgG and nutrients were calculated as the concentration multiplied by single-quarter yield. Calf birth weight and expelled placental dry weight were also collected post-calving. Mixed linear models (experiment as a random effect) were used to determine the effects of dam age (primiparous: 2 yr, young: 3 to 4 yr, mature: ≥ 5 yr), dam peripartum body condition score (BCS; thin: &lt; 5, moderate: 5 to 5.99, fleshy: ≥ 6), and calf sex on colostrum yield (single-quarter colostrum weight) and quality. Pearson correlation coefficients were also determined for colostrum yield with dam pre-calving body weight (BW), calf birth weight, calf birth weight relative to dam BW, whole placental dry weight, and gestation length. Mature dams had the greatest (<span>P</span> ≤ 0.03) and primiparous dams had the least (<span>P</span> ≤ 0.001) colostrum yield and total lactose. Colostrum from primiparous dams had greater (<span>P</span> = 0.03) IgG concentration than mature and greater (<span>P</span> ≤ 0.001) protein concentration than young and mature. Mature dams had greater (<span>P</span> ≤ 0.02) total IgG, total protein, and total triglycerides compared with both primiparous and young. Colostrum yield was less (<span>P</span> ≤ 0.04) for thin than moderate and fleshy dams. Total IgG was unaffected (<span>P</span> = 0.11) by dam BCS; however, thin dams had greater (<span>P</span> ≤ 0.04) IgG concentration than moderate and fleshy. Lactose concentration and total lactose were less (<span>P</span> ≤ 0.02) in colostrum from thin compared with moderate dams. Protein concentration was greater (<span>P</span> = 0.001) in thin than moderate dams, but thin dams had less (<span>P</span> ≤ 0.02) total protein compared with moderate and fleshy. Dam BCS did not affect (<span>P</span> ≥ 0.59) colostrum triglyceride concentration or total triglycerides. Colostrum yield and quality were not affected (<span>P</span> ≥ 0.22) by calf sex. Pre-calving dam BW was positively correlated with colostrum yield (r = 0.46, <span>P</span> &lt; 0.001). Colostrum yield was also positively correlated with calf birth weight (r = 0.31, <span>P</span> &lt; 0.001) and whole placental dry weight (r = 0.26, <span>P</span> = 0.007), but tended to be negatively correlated with calf birth weight relative to dam BW (r = -0.14, <span>P</span> = 0.09). Gestation length had no relationship (<span>P</span> = 0.31) with colostrum yield. Overall, colostrum yield and quality are negatively affected in young and thin beef dams. In addition, both dam and calf weight have positive relationships with colostrum yield, likely mediated by endocrine action associated with placental size.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6544e6eac9804e5c59c83539f7ddb727f8e21ff4d9da1470474b2988995d0668","category":"Environment"}