{"title":"Did the Natural Selection of Humans and of Animals Occur during a &ldquo;Pregnancy&rdquo; of Time, Space, Matter and Life?","link":"https://www.preprints.org/manuscript/202402.0034/v4","date":1715751825000,"content":"The theories of Evolution and Big Bang have brought a major impact upon the scientific and societal perception upon the origins, abilities and roles of mankind on Earth. It is conclusively evident that Mother Nature and the physical realm is autonomous and all phenomena in the world occur without an imposition against the “free will” of such events and patterns. Nevertheless, this extent of freedom does not imply that life on Earth represents an accident and has no purpose. By careful analysis of ancient religious texts, it can be suggested even otherwise, that it is especially free will that is offered as a gift from outside of the physical dimensions of existence, with the purpose of a continuous edification and improvement of the overall life conditions and of the human perception. It may be that the multi-generational focus on improvement and progress have been misattributed as a long-term evolution of species, that humans came from animal ancestors and that there is a blurred line associating humans with animals. Furthermore, it may be that scientists based their suggestions that no outside Creator would have brought the Earth into existence on physical perspectives, when the extra-dimensional process of Creation implies that all elements of the physical existence undergo a process of Creation from the outside, where time, space and physical matter do not exist, in spite of such elements possibly reflecting unseen elements of the meta-physical world. Finally, there is the following example that deserves attention within the scientific community; just because all living cells - human, animal and plant - contain DNA chromosomes, ribosomes, mitochondria and a plasma membrane, it does not indicate that humans are animals, just as this does not indicate that plants are animals. In Science, there is a golden statement, that correlation does not imply causation. This example is in complete agreement with the verses of the Book of Genesis in the Holy Scriptures regarding the origins of life; namely, that animals could have been created by an Author of all life on Earth so that man would experience companionship. Another major accordance with the teachings of the Holy Scriptures is the fact that life emerged from the water, and not from the soil, although the soil constituted the second principal means of the commencement and extension of life. Namely, after life first emerged in the seas and the oceans from bacteria, a few bacteria were passed from the marine water into the nearby soil on islands and surrounding land through the circulatory air above the sea level. Afterward, the first life forms emerged from the soil, via the transferred bacteria. Eastern Orthodox Christianity regards water as the principal environment of both physical and spiritual birth. Overall, an improved scientific perception of the timeline of life on Earth may be reached via an approach that combines molecular biology with quantum physics, given that the three layers of Science - Biology, Chemistry and Physics - together with their foundational layer of Mathematics, are in fact situated in a relationship of complete harmony.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6544200c89a33c367a7b22ac4b905047a5d04dc9aa208795a47245532241460d","category":"Interdisciplinary"}