{"title":"Stat3 Inhibitors TTI-101 and SH5-07 Suppress Bladder Cancer Cell Survival In 3D Tumor Models","link":"https://www.preprints.org/manuscript/202407.1450/v1","date":1721218734000,"content":"Bladder cancer (BC) is one of the most lethal genitourinary malignancies owing to its propensity for recurrence and poor survival. The biochemical pathway, signal transducer and activator of transcription 3 (STAT3), has gained significance as a molecular pathway that promotes proliferation, invasion, and chemoresistance. In this study, we explored the targeting of STAT3 with TTI-101 and SH5-07 in bladder cancer (BCa) and elucidated the mechanisms in three-dimensional (3D) spheroid and tumoroid models. We optimized the growth of spheroids from human, rat, and mouse BCa cell lines (J82, NBT-II, and MB49, respectively), and tumoroids from BBN (N-butyl-N-(4-hydroxybutyl)-nitrosamine) induced rat bladder tumors. Cell viability was assessed using MTT and trypan blue assays. ATP production, ROS production, and calcium AM (CA)/EtBr staining were used to measure the spheroid and organoid inhibition and mitochondrial function. Western blot analysis was performed to evaluate the pharmacodynamic markers involved in cell proliferation, apoptosis, cancer stem cells (CSCs), and STAT3 signaling in BCa. We found that targeting STAT3 (using TTI-101 and SH5-07) significantly reduced the proliferation of BCa spheroids, and tumoroids, which was accompanied by decreased expression of pSTAT3, Cyclin D1, and PCNA. Our data also demonstrated that treatment with STAT3 inhibitors induced ROS production and cell death in BCa spheroids and organoids. STAT3 inhibition induced cell death was associated with the activation of caspase 3/7 and PARP cleavage. Moreover, TTI-101 and SH5-07 targets cancer stem cells by downregulating the expression of CD44 and CD133 in 3D models. This study provides the first evidence for the prevention of bladder cancer with small-molecule inhibitors TTI101 and SH5-07 via suppression of CSCs and STAT3 signaling.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6546dd32ccbc54c968a6294c7ebd1f79d0d0b6d40663cab7b3b3472d9172fa84","category":"Interdisciplinary"}