{"title":"Lachlan Morton has already completed his Alt Tour","link":"https://www.cyclist.co.uk/rapha/9877/lachlan-morton-has-already-completed-his-alt-tour","date":1626174102000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>13 Jul 2021</span></div>    </div></div><p>\nEF Education-Nippo's resident endurance rider finished his unsupported Tour de France five days before the peloton</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/07/the_alt_tour_day_18_5_credit_rapha.jpg?itok=BW6lT6NP\" />  </div>\n<div>\n      <p> It's often said that cycling's all about suffering but some cyclists like to suffer more than most. Lachlan Morton is clearly one of those people.</p>\n<p>Having set out on the same day as the Grand Depart to beat the <a href=\"/tags/tour-de-france\">Tour de France</a> to Paris, riding the same route plus all the transfers completely unsupported, he arrived at the finish at 05:30 this morning – Tuesday.</p>\n<p>Not only was he five days ahead of the Tour, but he completed 2,400km and 15,000 vertical metres extra, with his grand total coming to 5,550km and over 65,000m of climbing. He also did nearly the whole thing in sandals.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/07/the_alt_tour_day_18_2_credit_rapha.jpg?itok=4tkNkqr3\" />  </div>\n</div>\n<p>Just to add one final chapter of pain, Morton rode the final 579km in one, 19-hour go, trudging on through the night to replicate one of the epic stages of the first Tour in 1903.</p>\n<p>Along the way he's inspired people around France and around the world while raising a fortune for World Bicycle Relief. The current total raised is £379,119 and to donate and help Morton reach his new £400,000 target (the initial target was smashed very quickly), visit <a href=\"https://give.worldbicyclerelief.org/campaign/ef-rapha-for-wbr/c329966\" target=\"_blank\">give.worldbicyclerelief.org</a>.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2021: Everything you need to know</a></div>      <div><a href=\"/news/8632/how-to-watch-and-live-stream-the-tour-de-france-2021\">How to watch and live stream the Tour de France 2021</a></div>      <div><a href=\"/news/9808/who-has-abandoned-the-tour-de-france\">Who has abandoned the Tour de France 2021?</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 116: on sale now!</a></div>    </div></div><p>\nAllison Dufosee, World Bicycle Relief UK CEO, said, 'Everybody at World Bicycle Relief has been blown away at Lachlan's mammoth effort on our behalf.</p>\n<p>'When considering a challenge, thoughts are usually about the distance and how long that will take. However, the thousands of recipients of the bicycles that Lachlan has raised through incredible global generosity have no choice about the time or distance of their challenge.</p>\n<p>'They race from the moment the run rises until sunset. The addition of a Buffalo Bicycle into the hands of a child will raise up that girl, boy, family and community, giving mobility to those who have only ever walked.'</p>\n<p>Maybe he can auction off his trusty sandals to get to that target. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"654715b21d6105c20d5f039d692ed556d8c14a9ad5d890e8d2d7079f71bb133e","category":"Cycling"}