{"title":"180 Dietary milk fat globule membrane alters intestinal microbiota of neonatal piglet following lipopolysaccharide challenge and marker of neuroinflammation","link":"https://academic.oup.com/jas/article/102/Supplement_2/133/7664896?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Early life stress exposure can increase morbidity and reduce animal wellbeing throughout life. Dysregulated gut function has been associated with neurological changes, and neurological changes affect gut homeostasis. Maternal milk is the gold-standard for yielding developmental benefits to offspring. Identification of milk components has led to an understanding of the bioactive nutrients important in neonatal development. Components of the milk fat globule membrane (MFGM) contribute immensely to neonatal gut health and neurodevelopment. However, mechanisms of actions are still being defined. The objective is to understand how dietary MFGM modulates the gut microbiota, blood-brain barrier tight junctions, and brain inflammatory markers following lipopolysaccharide (LPS) challenge. Piglets (n = 24, one-d-old) were assigned to soy (CON) or MFGM phospholipid supplemented diet (0.75% wt/wt) ± LPS (100 µg/kg body weight) in a 2 × 2 factorial design (n = 6 animals•diet<sup>-1</sup>•challenge<sup>-1</sup>.). Piglets were fed for 21 d and 6 animals/diet received saline or LPS injections 4 h before euthanasia. Colonic microbiota was characterized through 16s rRNA gene sequencing, while hypothalamus samples were collected to evaluate brain barrier function and inflammation-related genes using RT-qPCR. Microbiota data were processed using QIIME2 with DADA2 plugin and analyzed for alpha-diversity, beta-diversity, and differential abundance in R software. Gene transcription data were analyzed by a 2 × 2 experimental factorial design using the PROC MIXED procedure of SAS. Principal coordinates analysis indicated that MFGM-fed groups exhibited an observable separation from CON-fed groups in terms of microbial community structures (<span>P</span> &lt; 0.05). Firmicutes_A, Bacteroidota, and Firmicutes_D were the predominant phyla across all treatments, with average proportions to be 52.21 %, 24.36 %, and 18.46 %, respectively. At genus level, MFGM + Saline group down-regulated <span>Corynebacterium</span> by 88.00 % (q &lt; 0.05) and Unclassified <span>Muribaculaceae</span> by 73.33 % (0.050.05). However, there was an MFGM × LPS interaction (<span>P</span> &lt; 0.05) observed for nuclear factor of kappa light polypeptide gene enhancer in B cells inhibitor alpha, in which MFGM attenuated the LPS-induced increase in mRNA relative abundance (3.62 and 2.39 ± 0.38). In conclusion, dietary MFGM altered neonatal piglet intestinal microbiota and an important signaling molecule of the neuroinflammatory response following LPS challenge.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"65517210024a64c7cdf41e808e540269a1f68690fabe0167b8d75cff3a0e2ca1","category":"Environment"}