{"title":"Assessment of photodynamic therapy with annatto and led for the treatment of halitosis in mouth-breathing children: Randomized controlled clinical trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307957","date":1725372000000,"content":"<p>by Laura Hermida Bruno, Amanda Rafaelly Honório Mandetta, Ana Paula Taboada Sobral, Marcela Leticia Leal Gonçalves, Elaine Marcilio Santos, Ana Laura Fossati, Juliana Maria Altavista Sagretti Gallo, Pamella de Barros Motta, Alessandro Melo Deana, Anna Carolina Ratto Tempestini Horliana, Lara Jansiski Motta, Raquel Agnelli Mesquita Ferrari, Kristianne Porta Santos Fernandes, Sandra Kalil Bussadori</p>\r\nObjective <p>To assess the effectiveness of antimicrobial photodynamic therapy (aPDT) employing an annatto-based (20%) dye combined with blue LED for the treatment of halitosis in mouth-breathing children.</p> Materials and methods <p>Fifty-two children six to twelve years of age with diagnoses of mouth breathing and halitosis (score of ≥ 3 on portable breath meter) Breath Alert™ (Tanita Corporation®-Japan), were randomly allocated to two groups (n = 26). Group 1: brushing, dental floss and aPDT applied to middle third of the dorsum of the tongue. Group 2: brushing, dental floss and tongue scraper. Breath meter results before, immediately after treatment as well as seven and 30 days after treatment were compared. The hypothesis of normality in the data was discarded by the Shapiro-Wilk test (p &lt; 0.05) and for statistical analysis the Wilcoxon and Mann-Whitney tests were used.</p> Results <p>A significant difference was found between the pre-treatment reading and all other readings (p &lt; 0.05) in both groups, suggesting the effectiveness of the proposed treatments. No significant difference was found between the post-treatment reading and two follow-up readings, suggesting the maintenance of the effect of treatment over time (p &gt; 0.05). However, significant differences were found between groups for all post-treatment assessments (p &lt; 0.0001 for all comparisons), indicating greater effectiveness with aPDT. No association was found between the initial reading and the presence of coated tongue.</p> Conclusion <p>Antimicrobial photodynamic therapy using annatto and blue LED proved to be a viable therapeutic option for the treatment of halitosis in mouth-breathing children.</p>","author":"Laura Hermida Bruno","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"65551f6eee2f1abb20245c438fecfc172511583ea83d6861cafdcb0d74c0267a","category":"Interdisciplinary"}