{"title":"Effects of ultrasonic power on drying kinetics and product quality of licorice extract during ultrasound‐assisted vacuum drying","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13283?af=R","date":1712768606000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Licorice extract is an important raw material for food additives and medicine. The quality of licorice extract is dictated by the drying process. The commonly used drying methods of licorice extract are not efficient in obtaining high-quality products so alternative techniques need to be developed and researched. In this study, ultrasound-assisted vacuum drying (UAVD) was first utilized to improve drying efficiency and produce a higher-quality product. The changes in water mobility of licorice extract during drying were characterized using low-field nuclear magnetic resonance. In addition, the effects of ultrasonic power on the drying dynamics, the contents of liquiritin and glycyrrhizic acid, the antioxidant capacity and the microstructure formation of licorice extract during the whole drying process were investigated.</p>\n<h2>RESULTS</h2>\n<p>The drying times for licorice extract to reach equilibrium moisture content were reduced by 9.09–69.70% with UAVD at 40–200 W compared with that without ultrasonic treatment (0 W). Moreover, the proportions of bound water and semi-bound water in fresh concentrate were 3.75% and 96.25%. It was also found that high ultrasonic power promoted the flow of water and the formation of porous structure in licorice extract, which led to the improvement of drying efficiency. The contents of liquiritin (2.444%) and glycyrrhizic acid (6.514%) were retained to a large degree in the dried product at an ultrasonic power of 80 W. The DPPH inhibition rate of UAVD samples with different ultrasonic powers ranged from 84.07 ± 0.46% to 90.65 ± 0.22%.</p>\n<h2>CONCLUSION</h2>\n<p>UAVD has the advantages of high efficiency and low energy consumption, which may be an alternative technology for vacuum drying widely used in industry. © 2024 Society of Chemical Industry.</p>","author":"Xuecheng Wang, \nXiaohui Wang, \nYutian Zhang, \nYaqi Wang, \nYuanhui Li, \nYaokun Xiong, \nMing Yang, \nXiaorong Luo, \nZhenfeng Wu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"6567f58df2001dda914e98a01574090b715ebfd6a51a773f9c36e1e55ee6b079","category":"Environment"}