{"title":"Long noncoding RNA MALAT1 as a ceRNA drives mouse fibroblast activation via the miR-335-3p/P2ry2 axis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308723","date":1723471200000,"content":"<p>by Mengjie Chen, Jieying Peng, Guanghao Zhu, Cunhui Qian, Zhi Xiao, Xianmin Song, Haojun Yu, Rushi Huang, Wei Wang, Hongliang Zheng, Yafeng Yu</p>\r\n\r\nFibrosis is a complex pathological process that can lead to the permanent loss of biological function, with P2ry2 playing a crucial role in this process. Long non-coding RNAs (lncRNAs) have been reported to play an critically important role in the fibrotic process. However, it remains unclear whether lncRNAs can regulate fibrosis through P2ry2. In this study, we detected the expression of the long non-coding RNA metastasis-associated lung adenocarcinoma transcript 1 (lnc-MALAT1). We investigated the expression patterns of lnc-MALAT1 and P2ry2 in denervated skeletal muscle, a classical model of fibrosis. Additionally, we utilized a TGF-β-mediated fibrosis model in NIH/3T3 cells to examine the effects of lnc-MALAT1 and P2ry2 on fibroblast activation and the underlying regulatory mechanisms in vitro. Our results demonstrated that the expression levels of lnc-MALAT1 and P2ry2 were consistently elevated in denervated skeletal muscle, correlating with the degree of fibrosis. In vitro experiments confirmed the regulatory effect of lnc-MALAT1 on P2ry2. Furthermore, we identified miR-335-3p as a potential key molecule in the regulatory relationship of lnc-MALAT1/P2ry2. Dual luciferase reporter assays and AGO2-RIP verified the molecular sponging effect of lnc-MALAT1 on miR-335-3p. Additionally, we validated the regulation of the lnc-MALAT1/miR-335-3p/P2ry2 axis through experimental approaches. In conclusion, our study identified a crucial role of lnc-MALAT1/miR-335-3p/P2ry2 axis in fibroblast activation, providing a promising treatment option against the fibrosis.","author":"Mengjie Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"656e9c55a045a7c05263ff24bdb246d8e2b71c7fbf77b44ed51fd1a2afcab16e","category":"Interdisciplinary"}