{"title":"Preview: What you need to know about the elite men’s TT at Flanders Worlds","link":"https://cyclingtips.com/2021/09/preview-what-you-need-to-know-about-the-elite-mens-tt-at-flanders-worlds/","date":1631898201000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/worldstt-650x433.jpg\" /></div><h2>Preview: What you need to know about the elite men's TT at Flanders Worlds</h2><p>\n</p><p>The much-anticipated 2021 UCI Road World Championships will get underway on Sunday in Flanders, and it will be elite men’s time trial that kicks off the festivities.</p>\n\n\n\n<p>A flat course in West Flanders awaits what is, somewhat surprisingly, a pretty open field of contenders. There will be plenty of big names in attendance, but two days out, it’s hard to name anyone as the out-and-out favorite, which should make for a great show.</p>\n\n\n\n<p>Here’s what you need to know about the race.</p>\n\n\n\n<h2>The Route</h2>\n\n\n\n<p>The elite men’s time trial at Flanders Worlds will cover 43.3 km, starting in Knokke-Heist along the North Sea. Over the course of that journey, riders will head in a mostly southerly direction from the coast, take a short loop starting and ending at Dudzele, and then continue on towards the finish line in historic Bruges.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/men-elite-individual-time-trial_map_and_profile-1340x1889.jpg\" /></figure>\n\n\n\n<p>TT courses at Worlds tends to be geared towards the specialists, and this year’s race is no exception; in fact, it’s quite the opposite of an exception, with a parcours as flat as a pancake that is sure to favor the big engines. The weather, however, will present at least a little bit of uncertainty.</p>\n\n\n\n<p>As of Friday, there is at least some chance of rain on Sunday’s forecast, which also calls for some wind out of the East. Some of the twists and turns along the route could get a bit trickier if riders are rolling on rain-slicked roads, so keep an eye on the weather.</p>\n\n\n\n<h2>The Contenders</h2>\n\n\n\n<p>As Worlds TTs go, this year’s race is a surprisingly tough one to predict. There are a few big favorites, but none of them stands out as the clear top contender, head and shoulders above the rest. Meanwhile, there are also a few star players that won’t be lining up at all.</p>\n\n\n\n<p>Starting with the big names missing out, Primoz Roglič (Slovenia), who just won an Olympic gold medal in the discipline, <a href=\"https://cyclingtips.com/2021/09/olympic-tt-champ-roglic-wont-race-worlds-tt/\" target=\"_blank\">won’t be participating</a>. Roglič’s Jumbo-Visma teammate Tom Dumoulin (Netherlands), who rode to silver in Toyko, will also miss out after a collision with a car left him with a <a href=\"https://cyclingtips.com/2021/09/tom-dumoulins-season-is-over-after-he-was-hit-by-a-driver-during-a-ride/\" target=\"_blank\">broken wrist</a>. As of Friday, it doesn’t look like two-time world champ Rohan Dennis (Australia) will be riding in the TT either.</p>\n\n\n\n<p>With those non-starters out of the way, the four riders that do stand out most on this startlist are defending champion <strong>Filippo Ganna</strong> (Italy), European champ <strong>Stefan Küng</strong> (Switzerland), and a dynamic Belgian duo of <strong>Wout Van Aert</strong> and <strong>Remco Evenepoel</strong>. Time trials can often be a rather predictable affair, but we’re happy to report that we’re having a hard time feeling overly confident about any one of those four over the others – they all seem pretty closely matched.</p>\n\n\n\n<p>Ganna <a href=\"https://cyclingtips.com/2020/09/filippo-ganna-wins-his-first-world-time-trial-title-daily-news-digest/\" target=\"_blank\">won last year’s race</a>, of course, and he looked great early on this season, winning time trial stages at the Etoile de Bessèges and the UAE Tour and then adding two more Giro d’Italia TT wins to his long list of results there. He has not won since then, however, and he was bested at the European Championships. He’s a slight bookies’ favorite here, but there are reasons to like the rest of the field.</p>\n\n\n\n<p>Küng was the rider who topped Ganna at the Euros, going eight seconds faster over that 22.4 km course in Trento, Italy, and the big Swiss engine should find the flat, longer Worlds course to his liking. He looks as strong as ever right now, having beaten most of the top rivals for this title last week. There’s little reason to doubt Küng here, except maybe for the fact that he has yet to deliver a victory in his career in a TT at an event as big as a Grand Tour, let alone Worlds.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/kung-1340x893.jpg\" /><figcaption>Stefan Küng of Switzerland en route to victory in the men’s TT at the European Championships.</figcaption></figure>\n\n\n\n<p>Van Aert, who counts a Tour de France TT victory to his name, <em>has</em> taken plenty of top-tier wins in his career. He also rode to second (ahead of Küng but behind Ganna) in the Worlds TT last year in Imola. He looks to be on flying form coming off of an overall win at the Tour of Britain too. Unlike Ganna or Küng, however, Van Aert has multiple priorities this week; he is the oddsmakers’ number one favorite for the road race next weekend, and he will have been preparing accordingly. In other words, he <em>could</em> win both events, but it also wouldn’t be a huge surprise to see him just a hair off of his best on Sunday with the next goal in mind.</p>\n\n\n\n<p>His compatriot Evenepoel is another rider to watch, and another question mark. Evenepoel rode to runner-up honors in the Worlds TT back in 2019 when he was just 19 years old, and he has two TT wins to his name already this season. His third-place finish in the Euros TT was a sign of good form. He could also be in the mix for the road race, but he probably has a better chance in the TT, which has always been a strong suit for him. That said, he “only” finished ninth in the Olympic TT, and his wins so far in 2021 have come in smaller races, so it’s hard to know what we should expect here.</p>\n\n\n\n<p>Beyond that quartet of favorites, Tour de France champ <strong>Tadej Pogačar</strong> (Slovenia) is the biggest name on the start list. With TT victories at each of the past two Tours de France, he’s not a rider to be underestimated. The flat course will suit others better, but don’t be stunned to see him in the mix for the win. There’s not a lot that the two-time Tour winner can’t do.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/pogacartt-1340x893.jpg\" /><figcaption>Tadej Pogačar in time trial mode on stage 20 of the 2021 Tour de France.</figcaption></figure>\n\n\n\n<p>Getting deeper into the list of outsiders, there’s rising star Stefan Bissegger, who will give Switzerland another medal contender behind Küng, and Kasper Asgreen, who will give the Danes reason to hope. Edoardo Affini could have some success for Italy; he was second and third, respectively, in the Giro’s two time trials this year. Also keep an eye on Remi Cavagna (France), Michal Kwiatkowski (Poland), Brandon McNulty (United States), and Tony Martin (Germany), who may not be the powerhouse he once was, but who is a four-time world champ and the reigning German national champ.</p>\n\n\n\n<p>We’ll see how all of the aforementioned riders go in less than 48 hours, as Sunday will see the TT kicking off what should be an entertaining week in a place that you can always count on to deliver great bike racing.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/preview-what-you-need-to-know-about-the-elite-mens-tt-at-flanders-worlds/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"65738823221cbab5d05570abe79f8d21980e1b67a08aec01b5c46d79aaa89b36","category":"Cycling"}