{"title":"SpaceX may attempt to launch Starship SN11 on Friday","link":"https://arstechnica.com/?p=1752419","date":1616776567000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/SN11-Mar-22-2021-0952-980x654.jpg\" alt=\"\"></div>\n        <p>\n          SpaceX's Starship SN11 on Pad B in South Texas awaiting launch. In the distance, the first Super Heavy booster prototype (BN1) continues stacking operations.                      [credit:\n                        Trevor Mahlmann                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>SpaceX appears set to fly the latest prototype of its Starship vehicle—dubbed SN11—as early as Friday afternoon. Local residents have been informed of the test as part of a mandatory evacuation of Boca Chica Village.</p>\n<p>This test flight to about 10 km would be the fourth attempt by SpaceX to launch a full-scale version of its Starship vehicle to a high altitude and then land it. During the first two attempts, the vehicle failed just before landing, resulting in a crash. During a third flight, <a href=\"https://arstechnica.com/science/2021/03/starship-goes-up-starship-goes-down-but-is-the-program-moving-forward/\">on March 3</a>, the vehicle landed and stabilized itself but then exploded about 10 minutes later due to a fuel leak.</p>\n\n<p>The latest Starship prototype has come together quickly. It rolled to the launch pad on March 8 and underwent its first static fire test on March 22. During this test, one of the three Raptor engines apparently misfired, so it had to be replaced. Once this was done, SpaceX completed a second static fire test on Friday morning.</p></div><p><a href=\"https://arstechnica.com/?p=1752419#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1752419&comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6574a306056ae06ce90d85775ba5d4678b4632ac490f06a1253a017e52e4d0f6","category":"Tech"}