{"title":"Application of Experimental Configurations of Seismic and Electric Tomographic Techniques to the Investigation of Complex Geological Structures","link":"https://www.preprints.org/manuscript/202407.2295/v1","date":1722243697000,"content":"The main purpose of this study is the determination of the optimal data acquisition and processing parameters of electric and seismic tomographic techniques, for the investigation of complex geological environments. Two different study areas, in central-east Peloponnese and SW Attica were selected, where a detailed geological mapping and surface geophysical survey were carried out. The applied geophysical survey included the application of electrical resistivity tomography (ERT) and seismic refraction tomography (SRT). The geoelectrical measurements were acquired with different arrays and electrode configurations. Moreover, various types of seismic sources were used at seventeen shot locations along the seismic arrays. For the processing of geoelectrical data, clustered datasets were created increasing the depth of investigation and the discriminatory capability. The seismic data processing included: (a) creation of synthetic models and seismic records to determine the effectiveness and capabilities of the technique, (b) spectral analysis of the seismic records to determine the optimal seismic source type and (c) inversion of the field data to create representative subsurface velocity models. The results of the two techniques successfully delineated the complex subsurface structure that characterizes these two geological environments. The application of the ERT combined with the SRT, are the two dominant, high-resolution techniques for the elucidation of complex subsurface structures.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6574df99100c5199befa839f4b662866fe2ea8aff3db3665b26c14edefb3046e","category":"Interdisciplinary"}