{"title":"Google Slides adds live collaborative mouse pointers","link":"https://arstechnica.com/?p=1969316","date":1695143810000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/google-workspace-800x450.jpg\" alt=\"Google Slides adds live collaborative mouse pointers\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/google-workspace.jpg\">Enlarge</a> (credit: Google)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google Slides, Google's PowerPoint competitor, is getting a fun new collaborative feature: <a href=\"https://workspaceupdates.googleblog.com/2023/09/collaborate-more-seamlessly-with-live-pointers-google-slides.html\">live mouse pointers</a>. When multiple people are editing a presentation, they'll be able to see everyone else's mouse cursor, as if they've suddenly booted up a remote desktop instance.</p>\n<p>Google Docs and Sheets have long had multiple typing indicators for each person, representing what sentence or cell they're working on. That sort of thing doesn't work well for presentations, though, which often involve images and rearranging things on a free-form layout. Slides will now offer live remote mouse pointers from other people participating in an edit, which will smoothly move around the screen just like a real mouse. This doesn't seem particularly useful without some other form of communication, but if you're on a voice or video call, the live cursor could let you easily point to things while you explain them.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/5-1.jpg\"><img alt=\"Google Slides with multiple multicolored mouse pointers. \" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/5-1-980x618.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/5-1.jpg\">Google Slides with multiple multicolored mouse pointers. </a> (credit: Google)</p></div>\n<p>Unlike Docs and Sheets collaborative indicators, each person must individually opt-in to sharing their pointer location. There's now a pointer button in the top-right corner that will turn on sharing, or it can be turned on via the menu at \"View &gt; Live pointers &gt; show my pointer.\" If the idea of brightly colored mouse pointers dancing across the screen sounds too distracting, the option to hide other people's mouse cursors altogether can be found at \"View &gt; Live pointers &gt; show collaborator pointers.\"</p></div><p><a href=\"https://arstechnica.com/?p=1969316#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1969316&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6577502907449ee07c2bb0b61f41dd88e0281d9090d54bbac3550b66a029681e","category":"Tech"}