{"title":"PSII-17 Effect of dietary β-mannanase supplementation on energy and nutrient utilization in diets fed to broiler chickens: A meta-analysis","link":"https://academic.oup.com/jas/article/102/Supplement_3/706/7757643?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Beta-mannan (β-mannan) is a polysaccharide composed of repeating units of mannose, galactose, and glucose. The increased amount of β-mannan is present in various plant protein sources such as soybean meal, palm kernel meal, copra meal, and guar meal. β-mannan is considered an antinutritional factor for non-ruminant animals. Endo-β-mannanase enzymes are endo-hydrolases that can cleave the internal glycosidic bonds of the mannan backbone. As a result, β-mannanase is used to break down β-mannan in animal feeds, thereby aiming to reduce its potential anti-nutritional effects. Previous research has demonstrated that dietary β-mannanase supplementation improves energy and nutrient utilization in broiler diets possibly by decreasing digesta viscosity in the gastrointestinal tract. However, results from previous studies have been inconsistent, mainly due to variable experimental conditions including animals, experimental design, and environment. Meta-analysis is a useful method to comprehensively evaluate and integrate various results from previous studies, thereby providing reliable and practical insights. Therefore, the objective of this study was to conduct the meta-analysis to evaluate the effect of dietary β-mannanase supplementation on digesta viscosity, and energy and nutrient utilization in diets for broiler chickens. Through an extensive literature search conducted on Scopus, PubMed, Web of Science, and Google Scholar between January 2003 and December 2023, we identified 10 eligible studies. The meta-analysis was performed using the “metafor” package in R software version 4.1.3. (R Core Team, 2023), and the standardized mean difference (SMD) and its 95% confidence interval (CI) were calculated using the random effect model. The results revealed that dietary β-mannanase supplementation increased apparent total tract retention (ATTR) of dry matter (SMD = 1.84; 95% CI: 0.46 to 3.21; <span>P</span> = 0.016), gross energy (SMD = 2.16; 95% CI: 1.19 to 3.12; <span>P</span> = 0.001), and nitrogen-corrected apparent metabolizable energy (AME<sub>n</sub>) in broiler diets (SMD = 3.38; 95% CI: 1.63 to 5.14; <span>P</span> = 0.002; Table 1). Moreover, dietary β-mannanase supplementation increased apparent ileal digestibility (AID) of gross energy (SMD = 6.65; 95% CI: 3.78 to 9.53; <span>P</span> = 0.002) and nitrogen (SMD = 1.41; 95% CI: 0.55 to 2.27; <span>P</span> = 0.006) in broiler diets (Figures 1 and 2). Finally, digesta viscosity (SMD = -3.35; 95% CI: -4.69 to -2.02; <span>P</span> &lt; 0.001) in broiler chickens was decreased by dietary β-mannanase supplementation. In conclusion, the current meta-analysis indicates that dietary β-mannanase supplementation improves the overall utilization of energy and nutrients in diets with decreasing digesta viscosity in broiler chickens.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"657a026269ea815c53a76c7c7fbd6170ff7f8532b51d03315b8c52ac28a0592d","category":"Environment"}