{"title":"The zinc absorption of the novel peptide‐Zn complex in Caco‐2 cells: effects of soybean peptides charge and hydrophobicity","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13744?af=R","date":1721129417000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The supplemental effect of zinc depends not only on adequate intake, but also on how efficiently it is absorbed in the small intestine. In the present study, weak hydrophobic peptides (WHP), strong hydrophobic peptides (SHP), positively charged peptides (PCP) and negatively charged peptides (NCP) were isolated from soybean peptides (SP). The peptide-Zn complexes (PCP-Zn, NCP-Zn, WHP-Zn, SHP-Zn and SP-Zn) were prepared to compare their promotion zinc absorption capacity in the Caco-2 cells monolayers model.</p>\n<h2>RESULTS</h2>\n<p>We found that the carboxyl, carbonyl and amino groups in peptide were the primary binding sites of Zn. Compared with zinc sulfate, the peptide-Zn complexes with different charge and hydrophobic peptides could improve zinc solubility at different pH. NCP-Zn had a lower Zn-binding capacity but a higher zinc absorption capacity compared to that of PCP-Zn in Caco-2 cells. In addition, the capacity of PCP-Zn to promote zinc absorption was lower than the control group (SP-Zn). There were no significant differences in transport rates, retention rates and uptake rates of WHP-Zn, SHP-Zn and SP-Zn. NCP-Zn could improve the activity of Zn-related enzymes, and the expression levels of <i>PepT1</i> and <i>ZnT1</i> were higher than other peptide-Zn complexes.</p>\n<h2>CONCLUSION</h2>\n<p>The promotion zinc absorption capacity of peptide-Zn complexes was not completely dependent on the Zn-binding capacity, but also depended on the charge and hydrophobicity of peptides. © 2024 Society of Chemical Industry.</p>","author":"Rongxin Wang, \nQing Huang, \nSuyin Zhu, \nCuina Xie, \nQingzhu Zeng, \nYang Yuan","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"65825633ddbc0449ef0bf88347214637337ca6cff1321a7c04d68e9c382a5ab7","category":"Environment"}