{"title":"5 small iOS 17 features that will make a big difference (and 1 that won’t)","link":"https://www.macworld.com/article/1801556/ios-17-small-features-app-library-control-center-search-focus-sideloading.html","date":1683196200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It’s a big moment when Apple unveils a new version of iOS at <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC</a> each summer. After all, this software is running on a billion-odd iPhones and can fundamentally change the way they all behave: iOS updates add new features, correct flaws and UI issues, improve reliability (hopefully), and generally enhance the iPhone experience. All this without costing a penny to install.</p>\n\n\n\n<p>In 2023, rumormongers would have us believe, the new features part of that equation will be relatively minor, with development work on the company’s mixed-reality headset apparently costing so many engineer hours that the iOS 17 project had to be <a href=\"https://www.macworld.com/article/1448952/ios-17-macos-14-fewer-major-changes.html\">scaled back</a>. Multiple pundits have warned that, while some smaller new features will be included, there won’t be a “tentpole improvement” to base an event around like iOS 16’s customizable Lock Screen.</p>\n\n\n\n<p>But this isn’t a disaster. Not for Apple, which will be spending most of the event talking about the headset anyway, and not for iPhone owners, who will still get a great update. Because the real value you get from an iOS update is not a heavily hyped tentpole feature. It comes instead from the sum total of small tweaks that improve the overall experience in numerous ways. In fact, it’s arguable that so-called “maintenance updates” are better for the user, because they’re less prone to break things and focus on the small details that matter most.</p>\n\n\n\n<p>With that in mind, here are five of the smaller changes we’re expecting this year, and why (assuming the info is correct) they will make a difference to your iPhone experience (plus one that won’t change things as much as people think). For full coverage of everything we know about this year’s iPhone update, check out our <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17 superguide</a>.</p>\n\n\n\n<h2>Customizable App Library folders</h2>\n\n\n\n<p>Introduced in iOS 14, the <a href=\"https://www.macworld.com/article/234405/how-to-use-the-app-library-on-your-iphone.html\">App Library</a> is a single screen containing all of your iPhone’s apps, organized by category for ease of discovery. Apple recognized that it needed to offer a streamlined way to navigate iOS as users installed more and more apps on more and more screens, and demanded the ability to hide apps from the traditional home screen view.</p>\n\n\n\n<p>The App Library, then, makes a lot of sense as a navigational concept, but its categories leave much to be desired. Scrolling through mine, there’s a mixture of the useful (Games, Social, and Music are all self-explanatory), the flawed (such as the subtle distinction between Productivity &amp; Finance and Business, and the bizarrely wide-ranging Information &amp; Reading), and the deeply unhelpful (Utilities, and all-time classic Other). My colleague Jason has two Fender guitar apps on his iPhone, and these have somehow ended up in different folders… and neither of them is suitable. I don’t use App Library much, mostly because it’s a confusing mess.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/iOS-17-features-App-Library-category.jpg?quality=50&amp;strip=all\" alt=\"iOS 17 features: App Library category\" width=\"416\" height=\"900\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/iOS-17-features-App-Library-category.jpg?quality=50&amp;strip=all 554w, https://b2c-contenthub.com/wp-content/uploads/2023/04/iOS-17-features-App-Library-category.jpg?resize=139%2C300&amp;quality=50&amp;strip=all 139w\" /><figcaption>As if anyone gets information from Reddit.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>As of the launch of iOS 17, however, I may no longer have that excuse; one rumor suggests Apple will allow us to create our own custom categories. Further details are scant. Does this simply mean, in the App Library as in our home screens, we’ll be able to create a folder, call it whatever we like, and add apps to it manually? The power of the concept is that users with hundreds of apps don’t have to manually sort and organize, so we hope instead that iOS 17 lets us create custom category <em>rules</em> that apply to our app collections en masse.</p>\n\n\n\n<h2>Smarter search</h2>\n\n\n\n<p>The main alternative to the App Library, if you have a lot of apps, is to navigate via search. Swipe down from any home screen and you’ll open the Spotlight screen, where Siri suggests various apps and actions it thinks might be of interest, and where you can enter a search term and be shown apps, contacts, photos, settings, web pages and many more items that fit.</p>\n\n\n\n<p>With App Library not doing it for me, Spotlight is how I navigate to a whole host of apps that haven’t quite qualified for a position on my first couple of home screens. But it’s apparently going to get better with the launch of iOS 17: the Twitter leaker <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/analyst941/status/1646244634144776193&amp;xcust=1-1-1801556-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">@analyst941</a> has claimed we’ll see “heavily improved search/Spotlight” in the update.</p>\n\n\n\n<p>As with App Library, the details are minimal so far, but as good as Spotlight already is, there are two main areas where it could be improved. First, the search function itself could become better, either by getting smarter about understanding typos (although it can already understand some, such as “gaem” as a mistyping of “game”) or knowing to search within apps such as Notes and Messages when it’s most relevant. And second, the AI behind Siri Suggestions could be improved so it has a better chance of predicting what you want to do at a given moment. Either way, a useful navigational hub will become even more useful, and I can’t wait.</p>\n\n\n\n<h2>Controllable Control Center</h2>\n\n\n\n<p>Nobody likes wading through iOS’s Settings app, and Control Center is a brilliant way to skip that hassle and jump straight to your most frequently used toggles. But its design is tired, and customization remains limited. (The top half is set in stone; for the bottom half, you get to pick from a list of 23 additional controls.) This may all change in iOS 17.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/iOS-17-features-Control-Center.jpg?quality=50&amp;strip=all\" alt=\"iOS 17 features: Control Center\" width=\"416\" height=\"900\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/iOS-17-features-Control-Center.jpg?quality=50&amp;strip=all 554w, https://b2c-contenthub.com/wp-content/uploads/2023/04/iOS-17-features-Control-Center.jpg?resize=139%2C300&amp;quality=50&amp;strip=all 139w\" /><figcaption>It’s all rather 2017.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>An anonymous <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/04/05/ios-17-control-center-changes-rumor/&amp;xcust=1-1-1801556-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MacRumors</a> forum user with one successful past prediction reckons Apple is going to revamp Control Center in 2023, and that this will be so significant that it will be a highlight of the iOS 17 announcement.</p>\n\n\n\n<h2>Focused Focus</h2>\n\n\n\n<p>Apple has run a surprising “use your iPhone less” strategy in recent years, encouraging customers to limit their screen time and reduce distractions while sleeping, working, exercising, and above all driving. A key part of this admirable effort is the iPhone’s Focus modes, which enable you to fine-tune notifications, alerts, auto-responses, and even the layout of your home and lock screens in a precise way that suits and focuses your attention on a particular activity.</p>\n\n\n\n<p>As of iOS 16, there are four pre-scripted Focus modes–Driving, Fitness, Sleep, and Work–plus the all-purpose Do Not Disturb. You can customize each of these, and set up your own Personal mode with a separate set of options, which makes Focus an impressively powerful tool… if you put the time in. But Apple is at its best when doing the work for you, and we look forward to seeing the additional pre-written Focus filters which sources predict will be added in iOS 17.</p>\n\n\n\n<p>I would like to propose a Drinking mode, which prevents you from sending messages to selected “danger” contacts, surfaces contact details for taxis and pizza restaurants, and automatically lowers brightness and volume the next morning.</p>\n\n\n\n<h2>Precision flashlighting</h2>\n\n\n\n<p>Activate the iPhone’s flashlight with a tap from Control Center, and it’s either on or off. Power users will know, however, that you can long-press the icon to make it expand into an adjustable flashlight with four levels of brightness. Pro tip for you there.</p>\n\n\n\n<p>But who’s willing to settle for a poxy four levels of brightness? Not me! I want the “infinitely adjustable flashlight brightness” that one Weibo source says will be offered in iOS 17. Game changer.</p>\n\n\n\n<h2>But sideloading? Not so much</h2>\n\n\n\n<p>I’m being a tiny bit facetious about the granular flashlight, which will be frequently useful to a very small minority of users and only very occasionally useful to the rest of us. But I bet it makes more of a difference than sideloading.</p>\n\n\n\n<p>Sideloading is when a phone owner installs software via non-official channels, which in the case of iOS means a source other than Apple’s App Store. At the moment that requires you to jailbreak the iPhone, a relatively technical and arguably risky process that is likely to void your warranty and, if you’re not careful, could lead to malware finding its way onto your device. But all that is set to change as of the launch of iOS 17.</p>\n\n\n\n<p>As a result of political, legal, and PR pressure, Apple is widely expected to open up the iPhone this year and allow <a href=\"https://www.macworld.com/article/1434394/ios-17-third-party-app-stores-browsers-payment-systems-camera-nfc.html\">third-party app stores</a>, a momentous concession from a company facing growing accusations of anticompetitive behavior. On a corporate level this would be a huge step… but for the average iPhone owner, I suspect, it will change very little.</p>\n\n\n\n<p>The problem is that Apple, whose engineers and designers will create the structure in which third-party stores exist, is actively incentivized to make it work badly in order to maximize revenues via the official store. And so, much as the Self Service Repair program which Apple doesn’t want you to use ended up being, surprise surprise, <a href=\"https://www.macworld.com/article/694482/apple-self-service-repair-store-iphone-display-battery.html\">difficult and expensive</a>, sideloading is sure to be as clunky and unintuitive as Apple can make it. And I’m pretty certain that iPhone owners, who are used to a smooth, simple, and user-friendly experience, will either avoid it altogether or try it once and vow never to return. (Many, indeed, will never hear that it’s possible.)</p>\n\n\n\n<p>The theory is that increased competition from third parties will push devs to lower their prices on the official App Store, and Apple to reduce its cut and relax its stricter policies. But that only works if people are actually using the new option in volume, and I just <a href=\"https://www.macworld.com/article/1435742/third-party-app-stores-iphone-sideloading.html\">can’t see that happening</a>.</p>\n\n\n\n<p>Oh, and sideloading might be <a href=\"https://www.macworld.com/article/1794764/sorry-u-s-iphone-users-sideloading-in-ios-17-will-likely-be-limited-to-europe.html\">limited to Europe</a>, so there’s that too.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"658b5cc2a486200a714b6b4b5af43dac9668fa3323d5c08361bd6ec79f5a11a3","category":"Apple"}