{"title":"Impact of planning horizon length on traits in an economic breeding goal and ranking of selection candidates in beef cattle","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae090/7686754?rss=1","date":1717372800000,"content":"<span><div>Abstract</div>In beef production herds, unique situations such as breeding system, economic parameters, and current phenotypic performance can affect the emphasis of traits in the breeding goal and consequently the weighting of traits within a selection index. An often overlooked component of breeding goals is the planning horizon, or the time span to consider the economic impact of a selection decision, that varies between enterprises. A platform for constructing economic selection indexes (iGENDEC) was used to determine the impact of planning horizon length, breeding system, and sale endpoint on the relative emphasis of traits in the breeding goal and the re-ranking of selection candidates. As part of this investigation, the adjustment of phenotypic means for hot carcass weight and planning horizons were used to determine the impact of the relative emphasis on hot carcass weight as its mean approached a predetermined discount threshold. General-purpose indexes were created for animals sold at weaning and slaughter for three breeding systems with six different planning horizons (2, 5, 10, 20, 30, and 50 yr). As planning horizon increased, the relative emphasis on weaning weight or hot carcass weight, which affected revenue, decreased while the relative emphasis on stayability and mature weight increased. As the phenotypic mean for hot carcass weight approached and surpassed a predetermined discount threshold, the relative emphasis decreased before increasing again, once the mean weight surpassed the threshold. Rank correlations between indexes with different sale endpoints was 0.71 ± 0.1. Within a slaughter endpoint, re-ranking occurred between short and long planning horizons (<span>r</span> = 0.78 ± 0.09) while that of a weaning endpoint was less substantial (<span>r</span> = 0.85 ± 0.10). Jacard index scores between indexes with different planning horizons ranged from 39.7% to 87.9% and from 47.9% to 78.7% for weaning and carcass endpoints, respectively, for the top 5% of selection candidates. These results illustrate that the determination of a planning horizon can impact the rank of selection candidates and increases in net profit.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"65ae800b891f3bec0bcdbcba15e60d4dcdcc7965b28ce1c6be6bf4ca88eb4f99","category":"Environment"}