{"title":"Establishing the relationship between wildfire smoke and performance metrics on finished beef cattle in Western Rangelands","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae022/7618780?rss=1","date":1709510400000,"content":"<span><div>Abstract</div>Identifying causal relationships is complicated. Researchers usually overlook causality behind relationships which can generate misleading associations. Herein, we carefully examine the parametric relationship and causality between wildfire smoke exposure and animal performance and behavior metrics over a period of 2 yr in Reno, Nevada. The animals in the 2020 smoke season were grain-finished (<span>n</span> = 12) and grass-finished (<span>n</span> = 12), whereas the animals during the 2021 season were fed under the same diet but finished with either a hormonal implant (<span>n</span> = 9), or without (<span>n</span> = 9). The dataset included daily records of feed intake (<strong>FI</strong>), body weight (<strong>BW</strong>), water intake (<strong>WI</strong>), average daily gain (<strong>ADG</strong>), and WI behavior (time spent drinking [<strong>TSD</strong>]; water intake events [<strong>WIE</strong>]; no-WIE [<strong>NWIE]</strong>). Variable tree length Bayesian additive regression trees (<strong>BART</strong>) were utilized to investigate the relationships between air quality index (<strong>AQI</strong>), particulate matter 2.5 μm (<strong>PM</strong><sub><strong>2.5</strong></sub>) and 10 μm (<strong>PM</strong><sub><strong>10</strong></sub>), NO<sub>2</sub>, SO<sub>2</sub>, Ozone, and CO levels in the air (sensors &lt; 1.6 km from animals) with the animal data. Additionally, linear mixed models with a 7-d lag were used to evaluate parametric relationships among the same variables. All statistical analyses were performed on R Statistical Software (<a href=\"#CIT0032\">R Core Team 2023</a>). Under the linear mixed model with a 7-d lag, significant positive and negative associations were found for all parameters examined (<span>P</span> &lt; 0.05). Negative associations were found between FI, WI, ADG, BW, WIE, NWIE, TSD, and PM<sub>2.5</sub> (<span>P</span> &lt; 0.05) for at least one animal group. Positive linear associations between wildfire smoke parameters and the metrics evaluated were more variable and dependent on year, treatment, and smoke parameters. When examining the credible intervals and the variable importance in the BART, relationships were more difficult to identify. However, some associations were found for Ozone, AQI, NO<sub>2</sub>, CO, and PM<sub>10</sub> (<span>P</span> &lt; 0.05). Overall, our results carefully examine the relationship between smoke parameters and cattle performance and present interesting pathways previously unexplored that could guide early culling/finishing of animals to avoid economic losses associated with performance decrease in response to wildfire smoke exposure. Though interesting associations are found under linear mixed models, causality is difficult to establish, which highlights the need for controlled exposure experiments.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"65b21e494fba2f8c7d9a1f73416ff4ab70aa21e13ac748267407711936117c20","category":"Environment"}