{"title":"Fueling a greener tomorrow: The impact of energy diversification on green growth","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12508?af=R","date":1718623116000,"content":"<h2>Abstract</h2>\n<p>Motivated by the necessity of attaining carbon neutrality and striking a balance between clean and conventional energy sources, the emphasis is on how urgent it is to combat climate change and make the switch to sustainable energy systems. In this context, the current study aims to examine the effects of energy diversification on green growth, considering such complementary factors as green technology, human capital, remittance inflows, foreign direct investment inflows, trade openness, and gross fixed capital formation. An empirical analysis is conducted by framing a green growth function in the panel data framework which is analyzed using the dynamic standard correlated model for the BRICS nations (Brazil, Russia, India, China, and South Africa) for the period between 1995 and 2020. The results show that (i) energy diversification exerts a dampening effect on the trajectory of green growth, (ii) the process of green growth was affected due to green technology and foreign direct investment inflows, (iii) underscores the pivotal role of human capital and gross fixed capital formation in bolstering the green growth trajectory, (iv) despite their potential relevance, remittance inflows and trade openness exhibit negligible impact within the framework of the green growth function, thus underscoring their limited contribution to the overarching sustainable development. The practical policy recommendations and invaluable insights provided by these empirical findings are instrumental in fostering green growth among the BRICS countries. Moreover, it contributes to the discourse on sustainable development by providing a solid foothold for informing the development of relevant policies in similar situations around the world.</p>","author":"Shreya Pal, \nMuhammed Ashiq Villanthenkodath, \nMohd Arshad Ansari","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"65b36d86579a458c3f1a9b8165dbc21b8db525a99abd7b16aba20159c644e736","category":"Environment"}