{"title":"The mitochondrial orf117Sha gene desynchronizes pollen development and causes pollen abortion in Arabidopsis Sha cytoplasmic male sterility","link":"https://academic.oup.com/jxb/article/75/16/4851/7668809?rss=1","date":1715385600000,"content":"<span><div>Abstract</div>Cytoplasmic male sterility (CMS) is of major agronomical relevance in hybrid breeding. In gametophytic CMS, abortion of pollen is determined by the grain genotype, while in sporophytic CMS, it is determined by the mother plant genotype. While several CMS mechanisms have been dissected at the molecular level, gametophytic CMS has not been straightforwardly accessible. We used the gametophytic Sha-CMS in Arabidopsis to characterize the cause and process of pollen abortion by implementing <span>in vivo</span> biosensing in single pollen and mitoTALEN mutagenesis. We obtained conclusive evidence that <span>orf117Sha</span> is the CMS-causing gene, despite distinct characteristics from other CMS genes. We measured the <span>in vivo</span> cytosolic ATP content in single pollen, followed pollen development, and analyzed pollen mitochondrial volume in two genotypes that differed only by the presence of the <span>orf117Sha</span> locus. Our results showed that the Sha-CMS is not triggered by ATP deficiency. Instead, we observed desynchronization of a pollen developmental program. Pollen death occurred independently in pollen grains at diverse stages and was preceded by mitochondrial swelling. We conclude that pollen death is grain-autonomous in Sha-CMS and propose that mitochondrial permeability transition, which was previously described as a hallmark of developmental and environmental-triggered cell death programs, precedes pollen death in Sha-CMS.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"65ba26fd32a777c5a1f3d121a26dbf2ed9e24c0cd41ea71483f528f1350274d6","category":"Environment"}