{"title":"Unveiling the Antifungal Potential of Trans-Cinnamaldehyde: A Comparative Study Against Biofilm and Planktonic Forms of Candida spp.","link":"https://www.preprints.org/manuscript/202410.0148/v1","date":1727867193000,"content":"Biofilm-associated infections caused by Candida species represent a significant clinical challenge due to their inherent resistance to antifungal therapies. This study evaluates the antifungal efficacy of trans-Cinnamaldehyde, a natural compound derived from Cinnamomum cassia, in comparison to the widely used antifungal agent Nystatin, against both planktonic and biofilm forms of Candida albicans, Candida glabrata, and Candida tropicalis. Biofilms were established in 96-well polystyrene plates and treated with various concentrations of trans-Cinnamaldehyde and Nystatin. The Minimum Biofilm Inhibitory Concentration (MBIC) and planktonic minimum inhibitory concentration (PMIC) were determined using the MTT assay and Scanning Electron Microscopy (SEM) was employed to assess structural changes in biofilms. The results demonstrated that Nystatin exhibited superior antifungal efficacy across all tested species, particularly in biofilm inhibition, with MBIC50 values as low as 0.0015 mg/mL for C. albicans and C. glabrata. In contrast, trans-Cinnamaldehyde showed moderate antifungal activity with MBIC50 values of 0.16 mg/mL for C. albicans and C. glabrata and higher resistance observed in C. tropicalis (MBIC50 of 0.32 mg/mL). SEM analysis revealed significant biofilm disruption in C. albicans following exposure to trans-Cinnamaldehyde, but C. tropicalis exhibited more resilient biofilm structures. Overall, while Nystatin remains the gold standard for antifungal treatment, trans-Cinnamaldehyde presents potential as an adjunctive treatment, particularly for biofilm-related infections in C. albicans and C. glabrata. Further research is required to explore synergistic effects between trans-Cinnamaldehyde and conventional antifungal agents and to optimize its therapeutic application in clinical settings. This study reused measurement results data from our previous publication to include in tables and charts.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"65bcc484fcd1903ef85480b39da89472b918b3fc4d22ddf7fc38e637e62dca7e","category":"Interdisciplinary"}