{"title":"Interannual Variation of Half-Hourly Extreme Precipitation in Africa: The Assessment of the Warmest Decade (2011–2020) Since the Beginning of Observations","link":"http://link.springer.com/10.1007/s41748-024-00375-3","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Africa is experiencing widespread extreme precipitation. However, the continent remains understudied regarding extreme precipitation variation, particularly at high temporal resolution. This study assessed the changes in spatial distribution, frequency, and intensity of half-hourly violent precipitation (≥ 50 mm/h) in Africa during 2011–2020. The data were sourced from the Integrated MultisatellitE Retrievals for Global Precipitation Measurement (IMERG) program. The results reflect that the 50–60 mm/h precipitation category was the most densely spatially distributed with less-discernable interannual changes. There was a strong interannual variation in the spatial distribution of the 60–70 mm/h and ≥ 70 mm/h precipitation categories. There was a general decrease in the frequency of occurrence of violent precipitation in all regions, except in North Africa (NA). Among the study regions, NA had the broadest precipitation intensity distribution extended to high values and consequently, on average, the most intense violent precipitation, followed by Southern Africa (SA) and Southwest Indian Ocean (SWIO). The regions in the tropics, i.e., West Africa (WA), Central Africa (CA), and East Africa (EA), had a relatively narrow intense violent precipitation distribution. The results further illustrate that the strength of climate variability modes has a strong influence in the distribution, frequency, and intensity of violent precipitation over the continent particularly the ≥ 70 mm/h precipitation category. This study underscores a need for a strengthened capacity in forecasting climate variability modes impacting on Africa, augmentation of continental precipitation observation network, and improved extreme precipitation adaptation infrastructure.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"65c2084734c9f8a8ebc4959e62b070aec5a216363f349353dad840308f190386","category":"Environment"}