{"title":"Cerebrospinal Fluid Total, Phosphorylated and Oligomeric A-synuclein in Parkinson&rsquo;s Disease. A Systematic Review, Meta-Analysis and Meta-Regression Study","link":"https://www.preprints.org/manuscript/202408.2030/v1","date":1724845296000,"content":"Background: Diagnostic accuracy of Parkinson’s disease (PD), a synucleinopathy, based on diagnostic criteria is suboptimal. A biomarker for synucleinopathies is pivotal both from a clinical and from a research aspect. CSF a-synuclein has been extensively studied over the past two decades as a candidate biomarker of synucleinopathies. Herein we present data on studies focusing on total, phosphorylated and oligomeric CSF a-synuclein in PD. Methods: Pubmed, Scopus and Web of Science were searched for studies with &amp;gt;10 PD patients and control subjects, with data (mean, SD) on total, phosphorylated or oligomeric a-synuclein. Cohen’s d, as a measure of effect size, was calculated for all a-synuclein forms. Subgroup analysis and meta-regression were performed in an effort to explain between-study heterogeneity. Results: Thirty studies on total, six studies on oligomeric and one study on phosphorylated a-synuclein were included. Total a-synuclein was decreased and oligomeric a-synuclein increased in PD patients vs. controls. Effect size was medium for total and high for oligomeric a-synuclein. A-syn forms provided suboptimal combined sensitivity/specificity for the differentiation of PD from controls. There was significant between-study heterogeneity. PD cohort characteristics (sex, age, disease duration, UPDRS, H&amp;amp;Y) and study characteristics (study design, healthy vs. neurological controls, control for CSF blood contamination, method of a-syn measurement) could not account for between-study heterogeneity. Publication bias was limited. Conclusions: CSF a-synuclein levels lack sufficient accuracy to be used as biomarkers for PD. Standardization of (pre)analytical variables may improve the discriminatory power of a-synuclein forms in the future.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"65c82d81eb9bdbfc8b6b419fe7b0f70a44d9e0f81b3df13c0cfc553e41d60bdb","category":"Interdisciplinary"}