{"title":"What Apple deals to expect from Amazon Prime Big Deal Days","link":"https://www.macworld.com/article/2072830/amazon-prime-big-deal-days-airpods-ipad-macbook-apple-watch-iphone.html","date":1695046414000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It was only two months ago when Amazon held its annual Prime Day event, but the online retail giant isn’t done with the sales. On Tuesday, October 10 Amazon will kick off another two days of sales called Prime Big Deal Days, so if you’re looking for new Apple gear, you’ll probably want to mark your calendars. Here’s what we expect to see for Apple sales during the two-day extravaganza:</p>\n\n\n\n<h2>AirPods</h2>\n\n\n\n<p>AirPods are almost always on sale at Amazon, so you’ll definitely be able to score some savings. Right now, Amazon is selling the <a href=\"https://www.amazon.com/dp/B0BDHWDR12/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">AirPods Pro with a Lightning case for $200</a>, the 3rd-gen AirPods for $150, and the 2nd-gen AirPods for $99, all excellent prices at or near all-time lows. The <a href=\"https://www.amazon.com/dp/B0CHWRXH8B/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">newer AirPods Pro with a USB-C case are $249</a>, so look for the discounts on those during Prime Big Deal Days, as well as deeper clearance savings on any remaining stock of the Lightning model.</p>\n\n\n\n<h2>MacBook</h2>\n\n\n\n<p>Apple isn’t expected to announce any new MacBooks before October, so the savings will probably be close to what we’ve regularly seen the rest of the year: <a href=\"https://www.macworld.com/article/2009893/get-your-back-to-school-shopping-done-early-with-this-750-macbook-air-deal.html\">$250 off the M1 MacBook Air</a> and <a href=\"https://www.macworld.com/article/2024007/take-200-off-the-15-inch-macbook-air-in-new-all-time-low-discount.html\">$200 off the M2 MacBook Air</a>. However, we could see all-time low prices on the 14-inch and 16-inch MacBook Pro models, which got price cuts <a href=\"https://www.macworld.com/article/1372789/take-500-off-the-10-core-macbook-pro-in-this-incredible-early-black-friday-sale.html\">up to $500 last year</a>.</p>\n\n\n\n<h2>iPad</h2>\n\n\n\n<p>Apple doesn’t have any new iPads in the pipeline, so Amazon will likely offer massive savings on the current models. It’s common to see <a href=\"https://www.macworld.com/article/2027835/the-ipad-mini-is-100-off-just-in-time-for-back-to-school.html\">discounts of $100 on the iPad Air and iPad mini</a> during major sales events, and it’s possible prices are even lower during Prime Big Deal Days, especially on the Pro models that are <a href=\"https://www.macworld.com/article/2054153/ipad-pro-14-inch-oled-display-4tb-storage-agic-keyboard.html\">rumored to get an overhaul</a> in 2024.</p>\n\n\n\n<h2>Apple Watch</h2>\n\n\n\n<p>The Apple Watch Series 9 arrives on Friday, September 22, so it’s very possible that the first significant discounts arrive during Prime Big Deal Days. However, it’s more likely that the remaining Series 8 models will be the ones with the biggest savings as Amazon looks to clear out remaining stock. During the July sale, the <a href=\"https://www.macworld.com/article/1988802/save-120-on-any-apple-watch-series-8-in-this-amazing-prime-day-blowout-sale.html\">Apple Watch Series 8 was up to $120 off</a>, so we could see prices drop as much as $150 on the less-popular colors.</p>\n\n\n\n<h2>iPhone</h2>\n\n\n\n<p>After a longstanding Cricket partnership, Amazon has teamed up with Dish Network to offer the iPhone 15 models locked to the Boost Infinite network, which piggybacks on AT&amp;T’s and T-Mobile’s networks. We don’t know of any deals yet, but <a href=\"https://www.amazon.com/dp/B0CHBNXW6C/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">the Amazon listing</a> says the Boost Infinite plan costs $60 a month and “includes unlimited talk, text, and data on any iPhone 15 family model up to $1,000” with the ability to upgrade to the latest iPhone every year. Prime Big Deals Days would be a perfect time to promote the new service along with a discount for new subscribers.</p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"65cda87036272e0f36c7d8d8f43c51b18894c02e61d063c1349d2f4fcadfdb6e","category":"Apple"}