{"title":"The 2024 Kia EV9, an electric three-row SUV designed with the US in mind","link":"https://arstechnica.com/?p=1997322","date":1705679162000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/21758_2024_EV9-800x533.jpg\" alt=\"A blue Kia EV9 drives along a forest road in California\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/21758_2024_EV9-scaled.jpg\">Enlarge</a> <span>/</span> The 2024 Kia EV9 takes many of the things people love about the Telluride but does them on one of the best purpose-built EV platforms in the industry. (credit: Kia)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>American car buyers love purchasing way more car than they need. Have a kid and a dog? You'd better get a Suburban. Need to tow a Hobie Cat to the lake once or twice a year? Get a full-size diesel four-wheel drive pickup. Looking at an EV for your family? Well, it had better do 400 miles at a time and charge in 15 minutes, despite you having a six-mile commute. This mentality would make a cynic say that Kia's EV9 is a pointless exercise, but that cynic would be wrong.</p>\n<p>The 2024 Kia EV9 is ostensibly a three-row, midsize electric SUV that in its most efficient form—the Wind RWD Long-Range trim—will do a claimed 304 miles (489 km) of range, but it's also Kia's flagship model and the vehicle that seems to give us the best look at the formerly cheap-and-cheerful brand's more upscale future.</p>\n<p>The EV9 is the latest vehicle based on <a href=\"https://arstechnica.com/cars/2020/12/everything-we-know-about-hyundai-and-kias-new-electric-vehicle-platform/\">the E-GMP platform</a> that underpins the <a href=\"https://arstechnica.com/cars/2021/12/the-hyundai-ioniq-5-is-the-best-ev-weve-driven-in-2021/\">Ioniq 5</a>, <a href=\"https://arstechnica.com/cars/2022/01/kias-new-ev6-electric-crossover-goes-straight-to-the-head-of-the-pack/\">EV6</a>, and <a href=\"https://arstechnica.com/cars/2022/08/the-2023-genesis-gv60-is-a-strong-contender-for-ev-of-the-year/\">Genesis GV60</a>. Like those vehicles, it features a skateboard-style chassis and is available in rear- or all-wheel drive. Power ranges from 201 hp (150 kW) in the entry-level Wind RWD model to 379 hp (283 kW) in the Land AWD and GT-Line models. There are two available battery packs, with the smaller coming in at 76.1 kWh and the long-range pack rated at 99.8 kWh.</p></div><p><a href=\"https://arstechnica.com/?p=1997322#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1997322&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"65cd40207fcd2173103853f39b56a2e4b2975122b09bff13bfd2285e34a96f3a","category":"Tech"}