{"title":"SpaceX will soon fire up its massive Super Heavy booster for the first time","link":"https://arstechnica.com/?p=1780171","date":1626284572000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/ElonMusk_SuperHeavy_CROPPED-800x593.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/ElonMusk_SuperHeavy_CROPPED.jpeg\">Enlarge</a> <span>/</span> A Super Heavy booster rolled out of SpaceX's production facilities in South Texas earlier this month. (credit: <a href=\"https://www.spacex.com/\">Elon Musk</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>SpaceX seems to have gone a long time without launching—or blowing up—a rocket at its South Texas launch site. A little more than two months have passed since the company launched its SN15 Starship prototype to an altitude of 10 km before <a href=\"https://arstechnica.com/science/2021/05/spacex-successfully-lands-a-starship-test-flight/\">safely landing</a> the vehicle on May 5.</p>\n<p>The SpaceX engineering team apparently got the data it needed from that test flight, because the company scrapped plans to fly its next prototype (the SN16) in favor of moving toward higher flights. Accordingly, activity at the so-called \"Starbase\" facility near Boca Chica, Texas, has focused on building up capabilities for an orbital launch attempt of the Starship system.</p>\n<p>During the last two months SpaceX has constructed a massive launch tower to support a full stack of the Super Heavy booster and the Starship upper stage. The company has also built several new large tanks as part of the ground-support equipment that fuels the massive vehicles with liquid oxygen and methane.</p></div><p><a href=\"https://arstechnica.com/?p=1780171#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780171&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"65d3f6ccb85812554105167dfef3abf77d93ea63c295e0d370713bf0c8050a55","category":"Tech"}