{"title":"A Study on Metallurge Process of Fe-P Applicable to Motor Core for XEV","link":"https://www.preprints.org/manuscript/202409.0234/v1","date":1725411242000,"content":"This study explores the application of AncorLam HR (Höganäs, Sweden), a soft magnetic composite (SMC) material, in the stator core of an axial flux permanent magnet (AFPM) drive motor. Building on previous research that provided mechanical and thermal properties of AncorLam HR, the study focuses on analyzing how the manufacturing process affects the motor core's shape. A bulk prototype was created based on Case 3, which demonstrated the least deviation in density and internal stress. The prototypes were produced under the specified conditions of SPM 7 and 90°C, resulting in an average density and simulation density error of 0.54%, which confirms the effectiveness of the process. To further verify the reliability, the microstructure of the AncorLam HR powder and the resulting bulk prototype was analyzed. Scanning electron microscopy (SEM) measurements at 5mm, 20mm, and 25mm on Sample 2, which had the highest density, confirmed the consistency between simulation and prototype density trends. Additionally, electron backscatter diffraction (EBSD) analysis revealed a random orientation of the powder, while X-ray diffraction (XRD) showed consistent iron (Fe) peaks at 44.9°, 65.0°, and 82.3° in both the powder and bulk prototypes, indicating no significant change in the internal phase structure. Further analysis using energy-dispersive spectroscopy (EDS) and transmission electron microscopy (TEM) identified that the phosphorus (P) content was eliminated during the molding process, which led to the destruction of the insulating layer, a critical performance factor for SMC materials. In AFPM motor simulations, the average torque was measured at 34.5 mN·m, with core loss increasing as frequency increased. The observation of iron loss spikes during motor startup indicates the need for further research to optimize material selection. This study confirms the viability of using AncorLam HR in electric vehicle motor cores and provides essential data for improving the performance of AFPM motors. Future research should prioritize optimizing SMC materials to enhance the performance and efficiency of AFPM motor applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"65d3a822eb58992e6d1e6751e125d4bd225ab43af341b3ae9cb815009ecac64f","category":"Interdisciplinary"}