{"title":"Effects of bottom‐up factors on growth and toxin content of a harmful algae bloom dinoflagellate","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12576?af=R","date":1718718951000,"content":"<h2>Abstract</h2>\n<p>The toxin-producing dinoflagellate <i>Alexandrium pseudogonyaulax</i> has become increasingly abundant in northern European waters, replacing other <i>Alexandrium</i> species. <i>A. pseudogonyaulax</i> produces goniodomins and lytic substances, which can be cytotoxic toward other organisms, including fish, but we still know little about the environmental conditions influencing its growth and toxicity. Here, we investigated the impacts of different nitrogen sources and light intensities, common bottom-up drivers of bloom formation, on the growth and toxin content of three <i>A. pseudogonyaulax</i> strains isolated from the Danish Limfjord. While the growth rates were significantly influenced by nitrogen source and light intensity, the intracellular toxin contents only showed strong differences between the exponential and stationary growth phases. Moreover, the photophysiological response of <i>A. pseudogonyaulax</i> showed little variation across varying light intensities, while light-harvesting pigments were significantly more abundant under low light conditions. This study additionally highlights considerable physiological variability between strains, emphasizing the importance of conducting laboratory experiments with several algal strains. A high physiological plasticity toward changing abiotic parameters points to a long-term establishment of <i>A. pseudogonyaulax</i> in northern European waters.</p>","author":"Kristof Möller, \nSilke Thoms, \nUrban Tillmann, \nBernd Krock, \nFlorian Koch, \nIlka Peeken, \nCédric L. Meunier","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"65db30d79bd2e3d03e29902f75071e4bc125fea8442337ebe046ad0a16c4be1d","category":"Environment"}