{"title":"กูเกิลและแอปเปิลบล็อคอัพเดตแอปติดตามโควิดของอังกฤษ หลังพยายามให้ผู้ใช้เช็คอินก่อนเข้าร้านค้า","link":"https://www.blognone.com/node/122146","date":1618225982000,"content":"<div><div><div><p>กูเกิลและแอปเปิลร่วมกันบล็อคการอัพเดตแอป NHS COVID-19 ที่ใช้สอบสวนโรค (contact tracing) COVID-19 หลังจากทาง NHS เพิ่มฟีเจอร์สแกน QR หน้าร้านค้าต่างๆ เข้าไปในแอป ทำให้แอปทำผิดข้อตกลงการใช้งานฟีเจอร์ Exposure Notification API</p>\n<p>แอปเปิลและกูเกิลเปิดฟีเจอร์ Exposure Notification API ให้รัฐบาลหลายชาติใช้งาน โดยมีจุดเด่นสำคัญคือ API นี้จะเปิดทางให้แอปสามารถแลกเปลี่ยนแพ็กเก็ต Bluetooth กับโทรศัพท์ที่อยู่ใกล้กันได้แม้จะไม่ได้เปิดแอปทำงานบนหน้าจอ (foreground) ก็ตาม อย่างไรก็ดีทั้งสองบริษัท<a href=\"https://www.blognone.com/node/116153\">ห้ามไม่ให้หน่วยงานที่ใช้งาน API นี้เก็บข้อมูลพิกัดผู้ใช้จากช่องทางอื่นๆ ลงในแอปอีก</a> เมื่อแอป NHS COVID-19 พยายามเพิ่มฟีเจอร์นี้จึงกลายเป็นการละเมิดข้อตกลงไป</p>\n<p>ตอนนี้ NHS COVID-19 ใช้งานในอังกฤษและเวลส์ ส่วนสก็อตแลนด์นั้นใช้แอปของตัวเอง และเมื่อต้องการให้ประชาชนเช็คอินจุดที่ใช้บริการก็แยกแอป Check In Scotland ออกจากแอป Protect Scotland เพื่อไม่ให้ละเมิดข้อตกลงกับกูเกิลและแอปเปิล</p>\n<p>NHS เคยพยายามพัฒนาแอปสอบสวนโรค<a href=\"https://www.blognone.com/node/116022\">โดยไม่พึ่ง Exposure Notification API มาก่อน</a> แต่กลับพบว่าได้ข้อมูลจำกัดมากจนใช้งานจริงไม่ได้ และต้องเปลี่ยนแนวทางในที่สุด</p>\n<p>ที่มา - <a href=\"https://www.bbc.com/news/technology-56713017\">BBC</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7dba7b027dbd52d5bb5901a89899021b.jpg\" /></p>\n<p>ภาพโดย <a href=\"https://pixabay.com/photos/iphone-smartphone-apps-apple-inc-410324/\">JESHOOTS-com</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/nhs\">NHS</a></div><div><a href=\"/topics/united-kingdom\">United Kingdom</a></div><div><a href=\"/topics/covid-19\">COVID-19</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/google\">Google</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"65dee4485e8a94fc67bab3eab25dbfcfe768b71ca4fcd3aa6bdf27e6d1629706","category":"Thai"}