{"title":"Breeding birds of high-elevation mixed-conifer forests have declined in national parks of the southwestern U.S. while lower-elevation species have increased, with responses to drought varying by habitat","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duae007/7607832?rss=1","date":1707868800000,"content":"<span><div>Abstract</div>Climate change is considered a major driver of recent avian population declines, particularly in the drought-stricken southwestern United States. Predicting how bird populations will respond requires understanding the climatic drivers influencing population density across the region’s diverse habitats. We modelled breeding-season densities of 50 bird species in relation to spring and summer drought and the timing of North American monsoon rainfall over a 12-year period (2007–2018) and across 4 habitats comprising an approximately 1,500 m elevational gradient. We estimated annual breeding-season population density in relation to climate in the previous year by fitting a Bayesian hierarchical <span>N</span>-mixture model to point-count data from each of 6 national parks on the Colorado Plateau. Specifically, we asked whether (1) population trends were stable, increasing, or decreasing in the focal parks; (2) breeding densities were affected by drought or the timing of monsoon rains; and (3) climatic effects differed across habitat types and among species that molt on the breeding grounds, the nonbreeding grounds, or stopover to molt in the monsoon region of northwestern Mexico (molt migrants). Population trends varied with habitat. Species of high-elevation mixed-conifer forest declined over the study period, matching regional Breeding Bird Survey trends, likely in response to climate-related habitat loss and disturbance. By contrast, lower-elevation pinyon-juniper and grassland-shrubland species density generally increased. Effects of drought varied by habitat with elevation: mixed-conifer species responded positively to drought in the previous year, likely due to earlier snowmelt and breeding phenology, whereas pinyon-juniper species were unaffected, and grassland-shrubland species responded negatively, perhaps due to reduced nest survival. Later arrival of monsoon rains, a common prediction of climate models, had a positive effect on grassland bird densities, but a negative effect on molt-migrant densities. Late monsoon rains may result in a phenological mismatch between migration timing and the pulse of resources required to molt.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"65df2c411baee04317d176472eb42d7d0e1178b5ceb2309272b6eb6ec2a92aaa","category":"Environment"}