{"title":"WhatsApp, Signal, and Other Secure Messaging Platforms Write Open Letter to the UK Government Defending End-to-End Encryption","link":"https://blog.whatsapp.com/an-open-letter","date":1681948556000,"content":"\n<p>From an open letter signed by the leaders of WhatsApp, Signal, Viber, and a few other secure services:</p>\n\n<blockquote>\n  <p>Proponents say that they appreciate the importance of encryption\nand privacy while also claiming that it’s possible to surveil\neveryone’s messages without undermining end-to-end encryption. The\ntruth is that this is not possible.</p>\n\n<p>We aren’t the only ones who share concerns about the UK Bill. The\nUnited Nations has warned that the UK Government’s efforts to\nimpose backdoor requirements constitute “a paradigm shift that\nraises a host of serious problems with potentially dire\nconsequences”. Even the UK Government itself has acknowledged the\nprivacy risks that the text of the Bill poses, but has said its\n“intention” isn’t for the Bill to be interpreted this way.</p>\n\n<p>Global providers of end-to-end encrypted products and services\ncannot weaken the security of their products and services to suit\nindividual governments. There cannot be a “British internet,” or a\nversion of end-to-end encryption that is specific to the UK.</p>\n\n<p>The UK Government must urgently rethink the Bill, revising it to\nencourage companies to offer more privacy and security to its\nresidents, not less. Weakening encryption, undermining privacy,\nand introducing the mass surveillance of people’s private\ncommunications is not the way forward.</p>\n</blockquote>\n\n<p>I’m glad to see these companies defending end-to-end encryption, but this letter dances around the repercussions of this proposed legislation in the U.K. What they mean in the third paragraph quoted above is that if the legislation passes, people in the U.K. won’t be able to use WhatsApp or Signal or any other end-to-end encrypted service. Apple isn’t a signatory of the letter, but I think iMessage would be banned too.</p>\n\n<p>Some reports are portraying this as though these services would begrudgingly comply if the law passes, but they <em>can’t</em>. End-to-end encryption is inherent to the protocols. If end-to-end encrypted messaging is banned in the U.K., it won’t mean that WhatsApp, Signal, et al will somehow switch to insecure protocols in order to comply — it will mean that people in the U.K. can’t use these apps.</p>\n\n<p>It’s tough, messaging-wise, because coming right out and saying that <em>sounds</em> like these companies <em>won’t</em> comply, by choice. Laypeople seemingly can’t be made to understand that a “good-guys-only back door” is cryptographically impossible. But that’s the truth. <a href=\"https://www.statista.com/statistics/1311229/whatsapp-usage-messaging-app-users-by-country/\">WhatsApp is incredibly popular in the U.K.</a> — the message should not be that U.K. lawmakers are trying to weaken WhatsApp’s encryption, but rather that U.K. lawmakers are going to make WhatsApp illegal.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/04/19/whatsapp-signal-uk-open-letter\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"65df1b3c6852660a58842c34ab61587d844a5494dfdd38de0951f76fb9c3ec8d","category":"Tech"}