{"title":"Site Characterisation, Deep Basement Support, Construction, and Deformation Control","link":"http://link.springer.com/10.1007/s10706-023-02634-y","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>Deep basement construction is characterised by a deformation challenge for the excavation pit and adjacent structures. Basement construction is an unavoidable problem in urban areas. A case is found in a Triumph Unit building block project, where a 14 m basement will be constructed near the existing structures. Conducting a site survey engineering analysis before the deep basement excavation is essential to guarantee safety during basement construction. Site survey engineering analysis is vital in recommending a suitable support structure for the basement pit during excavation. Therefore, this paper takes the Triumph Unit high-rise building basement excavation project as a practical application of site survey engineering analysis on the actual construction site. Geotechnical and groundwater characterisation were achieved through field and laboratory tests. The study revealed that the site was suitable for construction of bored piles as enclosure structure. It also recommended application of steel bracing material enhanced with a hydraulic servo system as basement excavation internal support structure. The recommended support structure is applied to the actual excavation. The excavation-induced deformation with respect to the recommended support structure application is strictly monitored and controlled. The measured project site results show the effectiveness of site survey engineering analysis in recommending a suitable deep basement excavation support system that controls the excavation-induced deformation desirably.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"660e4c71f2105a6997a78348c48c17a5e6a2c2d313a5fa750ad17a697438c23b","category":"Environment"}