{"title":"Shroud waving self-determination: A qualitative analysis of the moral and epistemic dimensions of obstetric violence in the Netherlands","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0297968","date":1713794400000,"content":"<p>by Rodante van der Waal, Inge van Nistelrooij</p>\r\n\r\nObstetric violence is an urgent global problem. Recently, several studies have appeared on obstetric violence in the Netherlands, indicating that it is a more widespread phenomenon in Dutch maternity care than commonly thought. At the same time, there has been very little public outrage over these studies. The objective of this qualitative research is to gain insight into the working and normalization of obstetric violence by focusing on the moral and epistemic injustices that both facilitate obstetric violence and make it look acceptable. Following the study design of Responsive Evaluation, interviews, homogenous, and heterogenous focus groups were done in three phases, with thirty-one participants, consisting of ten mothers, eleven midwives, five doulas and five midwives in training. All participants were already critically engaged with the topic, which was a selection criterion to be able to bring the existing depth of knowledge on this topic of people in the field to the fore. Data was analyzed through Thematic Analysis. We elaborate on two groups of results. First, we discuss the forms of obstetric violence most commonly mentioned by the participants, which were vaginal examinations, episiotomies, and pelvic floor support. Second, we demonstrate two major themes that concern practices related to moral and epistemic injustice: 1) ‘Playing the dead baby card’, with the sub-themes ‘shroud waving’, ‘hidden agenda’, and ‘normalizing obstetric violence’; and 2) ‘Troubling consent’, with sub-themes ‘not being asked for consent’, ‘saying “yes”‘, ‘saying “no”‘, and ‘giving up resistance’. While epistemic injustice has been analyzed in relation to obstetric violence, moral injustice has not yet been conceptualized as a fundamental part of both the practice and the justification of obstetric violence. This research hence contributes not only to the better understanding of obstetric violence in the Netherlands, but also to a further theorization of this specific form of gender-based violence.","author":"Rodante van der Waal","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"66163925dd57047cbf61843d78b45a2713ab7aa0fc9d6546a3b40e1a530f668a","category":"Interdisciplinary"}