{"title":"U.S. FTC Commits to Fighting Against Unlawful Repair Restrictions","link":"https://www.macrumors.com/2021/07/21/ftc-right-to-repair-policy-statement/","date":1626894766000,"content":"The United States Federal Trade Commission <a href=\"https://www.ftc.gov/news-events/press-releases/2021/07/ftc-ramp-law-enforcement-against-illegal-repair-restrictions\">today announced</a> that it is committed to devoting more of its resources to fight against unlawful repair restrictions in a move that has the potential to impact Apple in the future.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-independent-repair-program.jpg\" />\r\n<br />\r\nEarlier this month, U.S. President Joe Biden <a href=\"https://www.macrumors.com/2021/07/06/biden-ftc-right-to-repair/\">called on the FTC</a> to create new right to repair rules that will prevent manufacturers from limiting consumers and businesses from repairing their own electronic devices. The FTC today followed up with a policy statement [<a href=\"https://www.ftc.gov/system/files/documents/public_statements/1592330/p194400repairrestrictionspolicystatement.pdf\">PDF</a>] and said that it plans to prioritize investigations into unlawful repair restrictions.<blockquote>Restricting consumers and businesses from choosing how they repair products can substantially increase the total cost of repairs, generate harmful electronic waste, and unnecessarily increase wait times for repairs. In contrast, providing more choice in repairs can lead to lower costs, reduce e-waste by extending the useful lifespan of products, enable more timely repairs, and provide economic opportunities for entrepreneurs and local businesses.</blockquote>The FTC is urging the public to submit complaints and provide information to aid in its enforcement of right to repair options, and it will consider filing suit against those who violate the Magnuson-Moss Warranty Act in addition to scrutinizing repair restrictions for violation of antitrust laws.\r\n<br />\r\n\r\n<br />\r\nThe FTC also plans to monitor private litigation to look for opportunities to investigate unfair repair practices, working with state law enforcement and policymakers to update existing laws and regulations.<blockquote>The Commission will bring an interdisciplinary approach to this issue, using resources and expertise from throughout the agency to combat unlawful repair restrictions. The FTC will also closely coordinate with state law enforcement and policymakers to ensure compliance and to update existing law and regulation to advance the goal of open repair markets.</blockquote>In a statement, FTC Chair Lina Khan said that the FTC has a \"range of tools\" that can be used to \"root out unlawful repair restrictions\" and the new policy statement commits the FTC to \"move forward on this issue with new vigor.\"\r\n<br />\r\n\r\n<br />\r\nIt's not yet clear how Apple might be impacted, but the company has fought against <a href=\"https://www.macrumors.com/2021/05/20/apple-right-to-repair-lobbying-efforts/\">Right to Repair bills</a> that have been proposed in multiple U.S. states. Apple claims that allowing independent repair shops to work on Apple devices without oversight could lead to security, safety and quality issues.<div>Tags: <a href=\"https://www.macrumors.com/guide/ftc/\">FTC</a>, <a href=\"https://www.macrumors.com/guide/right-to-repair/\">Right to Repair</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/21/ftc-right-to-repair-policy-statement/\">U.S. FTC Commits to Fighting Against Unlawful Repair Restrictions</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/u-s-ftc-commits-to-fighting-against-unlawful-repair-restrictions.2305024/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Hgl0YCkSMsc:DfHT0w_BzdY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Hgl0YCkSMsc:DfHT0w_BzdY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/Hgl0YCkSMsc\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"661918baea22c9b8e768d06cf82509eea756ef6f29db5e887c921b568be3256d","category":"Apple"}