{"title":"Biotic assemblages of gelatinous zooplankton in the Gulf of Mexico and adjacent waters: An evolutionary biogeographic approach","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307933","date":1722261600000,"content":"<p>by José María Ahuatzin-Hernández, Juan J. Morrone, Víctor M. Vidal-Martínez</p>\r\n\r\nGelatinous zooplankton constitutes a polyphyletic group with a convergent evolutionary history and poorly known biogeographical patterns. In the Gulf of Mexico, a region with complex geological, hydrological, and biotic histories, the study of this group has been limited to taxonomical and ecological aspects. In this study, we implemented a track analysis to identify distributional patterns of gelatinous zooplankton in the Gulf of Mexico and adjacent waters based on a dataset of 6067 occurrence records corresponding to Hydrozoa, Scyphozoa, Cubozoa, Ctenophora, Chaetognatha, Thaliacea, and Appendicularia. Information was compiled from the Global Biodiversity Facility Information (GBIF) and Ocean Biodiversity Information System (OBIS) databases and peer-reviewed literature. Individual tracks were constructed by joining the minimum distance between the occurrence localities of each taxon using a minimum spanning tree algorithm. We identified generalized tracks using parsimony analysis of endemicity with progressive character elimination (PAE-PCE). The areas where different generalized tracks overlapped were considered to represent panbiogeographical nodes. Seven generalized tracks (two with nested patterns) and six panbiogeographical nodes were recognized, mainly in neritic zones. The distributional patterns of gelatinous zooplankton allowed us to identify four biogeographic areas, supporting previously proposed biogeographic schemes. Gelatinous zooplankton in the Gulf of Mexico showed a convergent spatial distribution that can be explained by vicariant and dispersal events. The historical biogeography of the gelatinous biotas of the Gulf of Mexico has been little studied compared to ecological approaches, and the lack of integrative studies considering historical patterns is evident. This type of research is fundamental to understanding the evolutionary history of natural resources from a spatial perspective, identifying sites of biodiversity and endemism, and establishing a biogeographic baseline of the region for further studies.","author":"José María Ahuatzin-Hernández","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"661a5554f050dd31b8f6e8f8970133463b4d7dd828b24a126c2af0a3086651ad","category":"Interdisciplinary"}