{"title":"Prevalence of physical violence against people in insecure migration status: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300189","date":1711548000000,"content":"<p>by Alexandria Innes, Sophie Carlisle, Hannah Manzur, Elizabeth Cook, Jessica Corsi, Natalia V. Lewis</p>\r\nObjectives <p>This study summarised evidence on the prevalence of interpersonal, community and state physical violence against people in insecure migration status.</p> Methods <p>We conducted a systematic review and meta-analysis of primary studies that estimated prevalence of physical violence against a population in insecure migration status. We searched Embase, Social Policy and Practice, Political Science Complete, SocINDEX and Web of Science Social Sciences Citation Index for reports published from January 2000 until 31 May 2023. Study quality was assessed using an adapted version of the Joanna Briggs assessment tool for cross-sectional studies. Two reviewers carried out screening, data extraction, quality assessment and analysis. Meta-analysis was conducted in Stata 17, using a random effects model and several exploratory subgroup analyses.</p> Results <p>We retrieved 999 reports and included 31 retrospective cross-sectional studies with 25,997 migrants in insecure status. The prevalence estimate of physical violence was 31.16% (95% CI 25.62–36.70, p &lt; .00). There was no statistically significant difference in the estimates for prevalence of violence for men (35.30%, 95% CI 18.45–52.15, p &lt; .00) and for women (27.78%, 95% CI 21.42–34.15, p &lt; .00). The highest point estimate of prevalence of violence was where insecure status was related to employment (44.40%, 95% CI 18.24–70.57, p &lt; .00), although there were no statistically significant difference in the subgroup analysis. The prevalence of violence for people in undocumented status was not significantly different (29.13%, 95% CI 19.86–38.41, p &lt; .00) than that for refugees and asylum seekers (33.29%, 95% CI 20.99–45.59, p &lt; .00). The prevalence of violence in Asia was 56.01% (95% CI 22.47–89.55, p &lt; .00). Europe had the lowest point prevalence estimate (17.98%, 95% CI 7.36–28.61, p &lt; .00), although the difference was not statistically significant. The prevalence estimate during the migration journey was 32.93% (95% CI 24.98–40.88, p &lt; .00). Intimate partner violence attached to insecure status was estimated at 29.10%, (95% CI 8.37–49.84, p = .01), and state violence at 9.19% (95% CI 6.71–11.68, p &lt; .00).</p> Conclusions <p>The prevalence of physical violence is a concern among people in a range of insecure migration statuses. Prevalence of violence is not meaningfully higher for people in undocumented status than for people in other types of insecure status.</p> Review registration <p>PROSPERO (CRD42021268772).</p>","author":"Alexandria Innes","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"662073399d6955ba4838bd149abc90fb1f2b3021507c9ecb91d7759c6acd5559","category":"Interdisciplinary"}