{"title":"Adaptive resource management: Achieving functional eradication of invasive snakes to benefit avian conservation","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14597?af=R","date":1708334967000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/2d7f14cd-58a8-49f9-8f8a-3c19f0a7191c/jpe14597-toc-0001-m.png\" alt=\"Adaptive resource management: Achieving functional eradication of invasive snakes to benefit avian conservation\" />\n<p>We suggest that using adaptive resource management to evaluate each phase of action in relation to established goals allowed us to measure outcomes to reduce uncertainty in the application of control tools for wildlife conservation goals. Through this approach we creating a documented and successful approach for removing snakes inside a snake-exclusion barrier and observed an avian response.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nNatural resource management often co-occurs with considerable uncertainty. One approach to mitigating uncertainty is through adaptive resource management (ARM), a specialized form of structured decision-making that modifies management decisions or actions through monitoring and implementation.\n\nHere, we present a case study on the attempted eradication of an invasive brown treesnake (<i>Boiga irregularis</i>) in a 5-ha enclosure on Guam with uncertainty in approach. We applied an ARM process across three field phases of snake removal and evaluated whether (1) eradication was achievable and (2) eradication was necessary to achieve an avian response. Field phases included the application of aerial toxic baits, toxicant baiting large mouse and birds, trapping with live mouse and bird lures and hand capture.\n\nWe found that each removal technique improved control by either removing many individuals or targeting a subset of individuals that resisted prior control approaches. Although the effort did not result in eradication, the evaluation of identified indicators allowed for timely adjustments to removal using the ARM process.\n\nThe snake removal efforts yielded an avian response in the treatment area after integrating live birds as snake lures, suggesting functional eradication of snakes may be possible. We also, however, observed a release of invasive rodents following snake control, with birds being more sensitive to the presence of snakes than rodents.\n\n<i>Synthesis and applications</i>. We suggest that using adaptive resource management to evaluate each phase of action in relation to established goals allowed us to measure outcomes and was successful in eliminating uncertainty in the application of control tools for wildlife conservation. We were able to create a documented and successful approach towards removing snakes inside a snake-exclusion barrier by following the ARM process.\n</p>","author":"Melia G. Nafus, \nAmanda Reyes, \nThomas Fies, \nScott M. Goetz","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"66257ca9ee2f9431ba15892be38bb52d5f84c024d32683ae5a96ef39fccf3450","category":"Environment"}