{"title":"Daily Telescope: Two galaxies colliding 300 million light-years from Earth","link":"https://arstechnica.com/?p=1983483","date":1699966836000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/ARP-273-800x450.jpg\" alt=\"Behold, it is Arp 273.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/ARP-273.jpg\">Enlarge</a> <span>/</span> Behold, it is Arp 273. (credit: James Peirce)</p>  </figure>\n\n\n\n\n      <p><em>Welcome to the <a href=\"https://arstechnica.com/tag/daily-telescope/\">Daily Telescope</a>. There is a little too much darkness in this world and not enough light, a little too much pseudoscience and not enough science. We'll let other publications offer you a daily horoscope. At Ars Technica, we're going to take a different route, finding inspiration from very real images of a universe that is filled with stars and wonder.</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p>Good morning. It's November 14, and today's photograph is drop-dead gorgeous. It features an astronomical feature known as Arp 273—so named because it was part of an atlas of peculiar galaxies compiled by American astronomer Halton Arp six decades ago.</p>\n<p>In this case, Arp 273 is not one but two galaxies located about 300 million light-years from Earth. The two spiral galaxies are in the process of interacting with one another, and astronomers using the Hubble Space Telescope <a href=\"https://phys.org/news/2011-04-galactic-rose-highlights-hubble-21st.html\">believe</a> the distinct signs of intense star formation in the nucleus of the smaller galaxy were probably triggered by the encounter with the larger one.</p></div><p><a href=\"https://arstechnica.com/?p=1983483#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1983483&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"66333de7c352511fbafe3573182585d35d36bcb1f2095b45da142158b073d9f8","category":"Tech"}