{"title":"Bullguard Antivirus for Mac review: Protection that feels like an afterthought","link":"https://www.macworld.com/article/345562/bullguard-antivirus-for-mac-review-protection-that-feels-like-an-afterthought.html","date":1624348800000,"content":"\n<div>\n<section><div></div></section><div><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Able to identify common Mac malware </li></ul></div><div><h3>Cons</h3><ul><li>Mac implementation feels like an afterthought</li><li>Unhelpful support</li><li>Spots problems but doesn’t offer any tools or advice on what to do</li></ul></div></div></div><h3>Our Verdict</h3><p>Bullguard for Mac is unbelievably simple virus protection—perhaps too simple. If you already own a Windows license your Mac is a secondary machine, it might be worth it to add Bullguard to your Mac. </p>\n</div><h3>Price When Reviewed</h3><p>$23.99 per month</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Bullguard</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>US$23.99</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bullguard.com/products/bullguard-antivirus.aspx&amp;xcust=1-1-345562-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t<div>\n\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t</div>\n\t\t\n\n\n<p>It’s often surprising how different and basic a Mac antivirus product can be compared to its Windows counterpart. Perhaps it’s because the comparative market size doesn’t merit the same level of development time, or just that macOS users don’t flock to antivirus the way Windows users do.</p>\n\n\n\n<p>Whatever the reason, one look at Bullguard’s antivirus product and the immediate impression you’ll come away with is, “that’s it?”</p>\n\n\n\n<p>Before diving deep into this, a note: Bullguard was recently acquired by Avira. A few months before that, Avira itself was snapped up by NortonLifeLock. In other words, Bullguard is now owned by a subsidiary of Norton, and that may translate into a complete overhaul of Bullguard at some point. Then again, with three different antivirus brands under one roof, you have to wonder how long all of these different products will last.</p>\n\n\n\n<p><em>Note: This review is part of our <a href=\"https://www.macworld.com/article/3263722/best-antivirus-for-mac\">best antivirus roundup</a>. Go there for details about competing products and how we tested them.</em></p>\n\n\n\n<h2>Basic protection</h2>\n\n\n\n<p>Bullguard for Mac is unbelievably simple—perhaps too simple. The primary window consists of a green check mark that says whether your Mac is safe, and then there’s a scanning panel, a real-time protection panel, a quarantine panel underneath that, and then links to support and your account right at the bottom.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/BullguardAntivirus1.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>BullGuard</p></div>\n\n\n\n<p>Click on Custom Scan and a Finder window appears letting you choose a folder to scan. Otherwise, clicking the scan button starts a full scan. If you select the Settings cog in the upper right corner, it opens a preferences window with very straightforward (and minimal) settings for the antivirus. This window also contains the quarantine and application logs. </p>\n\n\n\n<p>As for protection, we had to rely on our own tests as Bullguard hasn’t had its Mac product tested by the antivirus reports we track. On the Windows side, however, Bullguard is doing very well. It scored 100 percent and 99.2 percent from <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.av-test.org/en/antivirus/home-windows/windows-10/february-2021/bullguard-internet-security-21.0-211107/&amp;xcust=1-1-345562-0-0-0&amp;sref=https://www.macworld.com/feed\">AV-Test in January and February 2021</a> respectively for its zero-day tests. It also scored 100 percent in AV-test’s widespread and prevalent malware test during the same period. AV-Comparatives and SE Labs haven’t tested Bullguard for Windows in recent months.</p>\n\n\n\n<p>In my own spot check of common malware for Mac, Bullguard had no trouble identifying the samples and quarantining them as soon as they were unzipped. </p>\n\n\n\n<p>With that basic test out of the way we went hunting for live malware, and ran across a fake Flash installer on a torrenting website. After downloading the fake Flash DMG Bullguard spotted and wiped out some live malware right away. However, I was still able to install the phony Flash program. </p>\n\n\n\n<p>Admittedly, this scenario is already questionable, because to get to this point you have to first authorize your Mac to install software that isn’t signed by the developer. Then you have to be naive enough to trust that all the malware that was just spotted by the antivirus didn’t come from the file you just downloaded. Then you have to ignore a number of other warnings from the OS before finally installing the questionable program. </p>\n\n\n\n<p>With so many roadblocks thrown up it’s reasonable to assume most users wouldn’t get this far. Still, I pressed on to see what would happen, and it uncovered a problem. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/BullguardAntivirusDual.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>BullGuard</p></div>\n\n\n\n<p>After the “Flash” install was complete I carried out a full scan to see what we had, and Bullguard detected four threats. That’s excellent. What wasn’t excellent, however, was that Bullguard didn’t take any action against these threats. On top of that, despite the scan window showing four detected threats, the primary window continued to show a green check mark stating that the Mac was safe. </p>\n\n\n\n<h2>Support wasn’t much help</h2>\n\n\n\n<p>With four infections and exactly zero user-facing details about what to do with this infection, my next move was to click the Support link and get some help via chat from the company. </p>\n\n\n\n<p>That didn’t work out, so I searched for the email support address to get help that way. After two emails and a day and a half, Bullguard got back to me. The company’s support staff advised me to download and install EtreCheck, a free Mac diagnostic scanner, and then send the company the resulting report. </p>\n\n\n\n<p>I did so and while I waited for Bullguard to respond, I noticed that EtreCheck showed the exact location of the problematic files. I promptly deleted those using the command line (malicious files often don’t show up in Finder), ran a scan, and was still stuck with one problematic file somewhere on the machine.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/BullguardAntivirusScan.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>BullGuard</p></div>\n\n\n\n<p>After another few scans and some of my own troubleshooting I was able to find the problematic file that Bullguard kept flagging. Trouble was, it was already in the antivirus’ quarantine section. Why it continued to flag it as problematic, I don’t know.</p>\n\n\n\n<p>During this whole ordeal, Bullguard support wasn’t much help other than advising me to use EtreCheck. The actual resolution came about because I knew what to look for and where thanks to EtreCheck. Meanwhile, Bullguard’s customer service was offering very basic advice such as disabling browser plugins and running more full scans. </p>\n\n\n\n<p>This was ultimately a very simple problem with some basic but annoying adware stuck on the machine. The files may or may not have been a threat depending on which window you choose to believe. But a lot of these problems could’ve been avoided. Bullguard antivirus for Mac, at the very least, should’ve been able to tell me where the troublesome files were or how to remove them. Also advising users to employ a third-party program to troubleshoot such a basic problem is not the best sign. </p>\n\n\n\n<p>Bullguard Antivirus for Mac costs $24.99 per year for a single device. It can also be added to your machines as part of Bullguard Internet Security, which covers 3 devices for a year for $60 or Bullguard Premium Protection, which covers 10 devices for a year for $99.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/BullguardSettings.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>BullGuard</p></div>\n\n\n\n<h2>Bottom line</h2>\n\n\n\n<p>Bullguard for Mac is very basic, to the point that this protection feels like an afterthought. If the Macs in your life are also an afterthought and most of your home is running Windows then adding Bullguard to your Mac because you have an extra license is worth it for protection against mainstream threats.</p>\n\n\n\n<p>If, however, you’re a house full of Macs looking to invest in an antivirus suite there are better options out there right now.</p>\n</div>","author":"Ian Paul","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6634987a1d634f191a08631574c42ca3e656647917174e05b1f1edd046f89c74","category":"Apple"}