{"title":"Influence of Mozambique Channel eddies on larval loss of two shallow-water commercial shrimp species","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000414","date":1717423200000,"content":"<p>by Bernardino S. Malauene, Christophe Lett, Francis Marsac, Pierrick Penven, Silvia Abdula, Coleen L. Moloney, Michael J. Roberts</p>\r\n\r\nThe shallow-water shrimp fishery is an important social and economic sector in Mozambique. However, catches of shrimps have been declining over the last decades, presumably due to poor recruitment. Climate change has been proposed as a potential cause of increased mesoscale eddy activity over the Mozambique Channel, which may have played a role in poor shrimp recruitment. Indeed, stronger eddies could transport matter, including increased numbers of shrimp larvae, from the coast to unfavourable offshore areas. In this study we used a biophysical model to investigate the influence of eddies on the dispersal of larvae of two commercial shrimp species (<i>Penaeus indicus</i> and <i>Metapenaeus monoceros</i>) from their spawning areas on the Sofala Bank. We found some 5 large events of offshore or southward transport loss (&gt;10% loss) from the Sofala Bank caused by eddies, occurring sporadically. The northern and central Sofala Bank areas were the most affected by larvae lost offshore. Simulations revealed that temperature-induced larval mortality, associated with cold-core cyclonic eddies, could also play a role in larval loss of up to 40%, which is greater than the larval transport loss associated with the eddy circulation. However, when they survived, larvae transported offshore could travel long distances (600–1600 km in 15 days), potentially promoting connectivity with other stocks in the region.","author":"Bernardino S. Malauene","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"6638d1f9c4684535713bb9a4475535f54b93eaf91bd27b5db7d2117fb5e34dad","category":"Environment"}