{"title":"The Impact of High-Salt Diet and Diuretics on the Development of the Aestival Phenomenon in Patients with Chronic Heart Failure","link":"https://www.preprints.org/manuscript/202410.1292/v1","date":1729154985000,"content":"Background: Chronic heart failure (CHF) often necessitates the use of high doses of diuretics, which can lead to side effects such as worsening renal function and electrolyte imbalances. Methods: A total of 102 patients (median age 75 years) were included in the study and divided into two groups based on the level of diuretic therapy. The diuretic group received the following average doses: furosemide — 39.1 ± 22.1 mg, torasemide — 7.4 ± 3 mg, and spironolactone — 42 ± 12.4 mg. Biochemical analyses were performed on days 1 and 7 of hospitalization, with measure-ments of sodium, potassium, glucose, urea, and plasma osmolality (eOSM). Results: By day 7, the plasma osmolality in the diuretic group increased from 300 [297; 304] to 302.2 [298.3; 305.8] mOsm/L (p = 0.039). Urea levels in the diuretic group rose to 7.95 [5.65; 9.90] mmol/L by day 7, while remaining stable in the non-diuretic group at 5.90 [5.05; 7.50] mmol/L (p = 0.012). The proportion of urea to plasma osmolality (PropUrea/eOSM) in the diuretic group in-creased to 2.63% [1.89; 3.28] compared to 2.00% [1.70; 2.50] in the non-diuretic group (p = 0.011). The proportion of sodium to plasma osmolality (PropNa/eOSM) in the diuretic group decreased to 46.46% [46.02; 46.74], compared to 46.68% [46.33; 46.89] in the non-diuretic group (p = 0.050). Analysis of PropNa/eOSM and PropUrea/eOSM on day 7 without considering salt intake yielded statistically significant results, though they were less robust compared to models including salt intake. For example, in the PropUrea/eOSM model, the odds ratio (OR) was 3.01 (95% CI 1.74, 5.89; p &lt; 0.001), and in the PropNa/eOSM model, the OR was 0.19 (95% CI 0.07, 0.43; p &lt; 0.001). Conclusion: The study confirmed that high salt intake and active diuretic therapy significantly influence the biochemical parameters of patients with chronic heart failure (CHF), contributing to the develop-ment of the aestivation phenomenon. This is characterized by an increase in nonionic osmolytes such as urea, which may represent a physiological adaptation to stress. Patients receiving diuret-ics and following a high-salt diet exhibited significant changes in plasma osmolality and urea levels, indicating a physiological adaptation that may worsen prognosis by increasing the risk of sarcopenia and cachexia. Further research is needed to better understand these mechanisms and develop strategies to mitigate the negative effects.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6638d4723ea7c6aba1726d208cd09c99d1d224f0182c78e103ff9b8610a3a6ad","category":"Interdisciplinary"}