{"title":"Steve Jobs’ 5 most memorable Apple products (and one more thing)","link":"https://www.macworld.com/article/540488/steve-jobs-top-apple-products.html","date":1633435491000,"content":"<div>\n<section><div></div></section><p>Steve Jobs’ impact was so significant that it’s difficult to find the words to describe his influence on business, technology, and society, even <a href=\"https://www.macworld.com/article/214635/former-apple-ceo-steve-jobs-dies-at-56.html\">10 years after his death</a>. It’s hard to even narrow down the products released under his watch to a list of just five. But we tried anyway. Here’s our list of the most memorable products released during Steve Jobs’ tenure with Apple.</p>\n\n\n\n<hr /><p>Apple has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://youtu.be/CeSAjK2CBEA&amp;xcust=1-1-540488-1-0-0&amp;sref=https://www.macworld.com/feed\">posted a film</a> titled <em>Celebrating Steve</em> to commemorate the anniversary of Jobs’ death. </p>\n\n\n\n<figure><div>\n\n</div></figure><hr /><h2>Apple II</h2>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/apple-ii.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Apple II</p></figcaption></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Apple_II#/media/File:Apple_II_typical_configuration_1977.png&amp;xcust=1-1-540488-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">FozzTexx/Wikipedia</a></div>\n\n\n\n<p>Everyone remembers the Mac (see item two on this list), but the <a href=\"https://www.macworld.com/article/181214/pcworld25.html\">Apple II</a> is the first product that really got Apple going as a business. The first mass-produced computer by the company in 1977, the Apple II succeeded the Apple I, which was not a success. Steve Wozniak was the brains behind its technical implementation, but Jobs saw the importance of having a design that was approachable to everyone, not just computer nerds.</p>\n\n\n\n<p>The Apple II also established Apple’s method of success. It wasn’t the first personal computer on the market or even the first from Apple, but it was an ideal combination of features and design that worked extremely well and was better than anything else on the market. It <a href=\"https://www.macworld.com/article/181214/pcworld25.html\">worked so well</a> that Apple sold the Apple II line for more than 15 years.</p>\n\n\n\n<h2>Macintosh</h2>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/macworld-issue-macintosh.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/194539/machistory.html\">making of the Mac</a> has been widely covered, so here’s a quick overview. Apple was riding on the success of the Apple II, but it needed to work on its eventual successor. Apple had two GUI platforms in development that could follow up the Apple II: Lisa and the Macintosh. After being forced out of the Lisa project, Jobs went to work on the Mac team. Lisa failed, and, well, if you don’t know the rest, you can figure it out.</p>\n\n\n\n<p>Some may argue that, if you consider the dominance of Windows PCs, the Mac was only a modest success. But every major product Apple has released has its roots in the original Mac. Apple—and possibly the entire PC industry—wouldn’t be where it is today without it.</p>\n\n\n\n<h2>Mac OS X</h2>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/mac-os-x-aqua.jpg?quality=50&amp;strip=all\" /></figure><p>Apple</p></div>\n\n\n\n<p>It’s not the first version of the Macintosh operating system, but Mac OS X is the most important version. It came at a time when the current OS MacOS 9, was out of date, and <a href=\"https://www.macworld.com/article/340370/an-act-of-desperation-20-years-ago-formed-the-building-block-for-the-modern-mac.html\">Apple desperately need a modern version</a>. After several stops and starts, Apple started looking outside of its doors to find what it needed—and hit pay dirt. </p>\n\n\n\n<p>Years earlier, Steve Jobs had left Apple to start a new company called NeXT. It wasn’t a mainstream success on the level of Apple, but it got people’s attention, particularly its object-oriented NeXTSTEP operating system. So when Apple started shopping for a new OS, it was hard to ignore Jobs’ company. In 1997, Apple bought NeXT, bringing Jobs back to a leadership role and setting the foundation for the transformation of both Apple and the Mac.</p>\n\n\n\n<p>OS X wasn’t important just for Mac hardware. When Apple released the iPhone, it proudly proclaimed that its operating system was based on OS X. It’s a testament to Steve’s genius and legacy, and the fuel that makes Apple hardware run.</p>\n\n\n\n<h2>iPod</h2>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/ipad-silhouette-ad.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Original iPod</p> </figcaption></figure><p>Apple</p></div>\n\n\n\n<p>The late 1990s saw the emergence of digital music and the MP3 player. While numerous players were on the market, Jobs thought Apple could make a better one, and the company released its first non-Mac product since the Newton called iPod in 2001. A product that the company originally thought would be a <a href=\"https://www.macworld.com/article/182072/ipodhalo-2.html\">nice complement</a> to its Macs, the iPod sold in the millions and carried Apple’s growth right up until the iPhone arrived in 2007.</p>\n\n\n\n<p>The iPod also had a major influence on Apple’s product development, since it was the first hub device that demonstrated tight integration between a device (iPod), software (iTunes), and an online service (iTunes Music Store). That integration is key with the iPhone, iPad, Apple Watch, and Mac, and no doubt it’ll be part of whatever Apple comes up with in the future.</p>\n\n\n\n<h2>iPhone</h2>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/original-iPhone-wallpaper.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>You’re probably quite familiar with the <a href=\"https://www.macworld.com/article/183056/iphone-5.html\">iPhone’s origins</a>, so we won’t dive into its history other than to say it’s Apple’s singular most groundbreaking product, even more than the Mac. It’s not just the most important product made under Steve Jobs, it’s Apple’s most important product ever and one of the most significant tech products of all time. Yes, the iPhone stands on the shoulders of the other products in this list, but it has created its own legacy and dramatically changed the landscape. Years from now, when we eventually move beyond phones as our primary devices, the iPhone will be the basis for the future, cementing Steve Jobs’ legacy long after the products he designed are in the history books.</p>\n\n\n\n<h2>One more thing</h2>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/steve-jobs-one-more-thing.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<p>While Steve will always be remembered for the devices he brought into the world, it was his showmanship that perhaps made the biggest impact. The products were always great, but it’s his introductions that will always be remembered: pulling the MacBook Air out of an envelope, the iMac rising out of the stage, removing the iPad nano from his jeans pocket, and of course, <a href=\"https://www.macworld.co.uk/news/one-more-thing-3793072/\">all of those One More Things</a>. But what stands out the most is the iPhone keynote. When Steve took the stage at Macworld San Francisco in January 2007, the world had no idea that everything was about to change. But Steve knew. That keynote was nothing less than a masterpiece on the level of <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwitjtiSlrLzAhUDVd8KHR18D9wQwqsBegQIBhAB&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DPLIAp5nr0q0&amp;usg=AOvVaw1Jxtw06XdqMroTGU5CR5Pj&amp;xcust=1-1-540488-1-0-0&amp;sref=https://www.macworld.com/feed\">Queen at Wembley Stadium</a> or <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwiemby1kLLzAhXxTN8KHUKnAMMQwqsBegQIAhAB&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DfIQMktyP90s&amp;usg=AOvVaw1pMoSf68_rrkLrojzaFHIE&amp;xcust=1-1-540488-1-0-0&amp;sref=https://www.macworld.com/feed\">Led Zeppelin at Royal Albert Hall</a>. Apple events are still must-see TV, but nothing will ever compare to Steve’s command of the stage, the crowd, and the next big thing.</p>\n\n\n\n<p></p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"66423ae0862728655f20d82d2299e1d83c71ea0d5f8a2d923c6367223a6f8e5a","category":"Apple"}