{"title":"PSLBII-27 Investigating the emergence of antimicrobial resistance in Mycoplasma bovis from feedlot cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/674/7757510?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Bovine respiratory disease (BRD) is the most significant disease affecting feedlot cattle in North America. <span>Mycoplasma bovis</span> is among the main BRD pathogenic bacteria. Infection control of <span>M. bovis</span> is hampered by a lack of effective vaccines and increasing antimicrobial resistance (AMR). Integrative and conjugative elements (ICEs) have been documented as a mechanism of horizontal gene transfer (HGT) in mycoplasmas. Mycoplasma ICEs (MICE) do not carry AMR genes but have been associated with the HGT of genes that confer AMR through point mutations. Hence, there is a need to gain a better understanding of the role of MICE in <span>M. bovis</span> AMR. Randomly selected <span>M. bovis</span> isolates (n = 54) collected from Western Canadian feedlot cattle (AB and SK) underwent whole-genome sequencing by short-reads (Illumina), with a subset (n = 6) selected based on AMR and ICE profiles for Oxford Nanopore long-read sequencing. Sequences were screened for the presence of MICE. MICE circularization (cMICE) is the first step of conjugation, and an in-house collection of 472 <span>M. bovis</span> field isolates (feedlot cattle just from AB) was screened by PCR for the presence of cMICE as a proxy for conjugation capabilities. Environmental conditions that could impact cMICE quantity, including growth phase, temperature, cell density, pH, starvation, UV light, CO<sub>2</sub> concentration, and sub-inhibitory concentrations of mitomycin C were investigated by qPCR, followed by growth of <span>M. bovis</span> isolates under the most favorable conditions identified for cMICE-detection and screening by a high throughput qPCR method that eliminated the need for DNA extraction. Nineteen different mating pairs were carried out and 4 different environmental factors were tested for their possible impact on conjugation occurrence (incubation time, incubation volume, conjugation parent proportions, atmosphere). All isolates carried MICEs with 23/54 having a structure/sequence comparable to previously described functional MICE in mycoplasma, 43/54 possessing non-functional ICE, and 23 having &gt;1 ICE. The presence of more than one MICE/genome suggests a lack of MICE (entry) exclusion systems in <span>M. bovis</span>, a trait that may promote the flow of genetic information among M. bovis isolates including AMR. Even though some factors including growth phase (early stationary phase) and pH (9.0) generated greater levels (≥1.5 fold) of cMICE, none of the examined parameters were statistically significant. However, as early stationary growth phase generated the greatest cMICE quantity (2.3 fold), <span>M. bovis</span> isolates were cMICE-screened at this growth stage for the expeditious identification of M. bovis conjugation candidates. A total of 25.7% <span>M. bovis</span> were cMICE-positive. Of 19 mating pairs tested, transconjugants were recovered from only 2 different mating pairs, possibly reflective of the need for further optimization of conjugation conditions.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6645f7fea1a0da6d080924600e62708639a6fd0bc4085ba706c6da3baa240b90","category":"Environment"}