{"title":"Introducing the Mountains issue","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-the-mountains-issue","date":1626370403000,"content":"\n      \n<p><a href=\"https://www.rouleur.cc/pages/subscribe\" target=\"_blank\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Mockup_Issue-105_blue_8905b8a2-a170-4f43-b780-77682becb5cc_1024x1024.jpg?v=1626342483\" /></a></p>\n<p><span>Being in the mountains is like pressing a reset button for me. The air is fresh, the horizon boundless, the trickle of a stream supplants the traffic roar or phone notification ping to which I’m accustomed. It’s reconnecting with something primeval.</span></p>\n<p><span>I always feel smaller there, as if reminded of my place in things. Sometimes, these peaks inspire reflection on my life; on others, I just enjoy the silence and the sights around me.</span></p>\n<p><span>The mountains made me dream. As a child, first reading about Hillary and Norgay on Everest, then as a cycling fan. Seeing those memorable battles broadcast on TV in my suburban living room, spindly climbers fighting through the mist or between thick snow walls. Those peaks seemed even more distant and lofty than they really are, as if they existed in another realm. </span></p>\n<p><span>So naturally, one of my fondest memories is a first trip to conquer them, on an Alpine cycling holiday as a teenager. Famous mountains like the Lautaret and Galibier, passing under my wheels, reached under my own steam. Pure awe.</span></p>\n<p><span>Dreaming too hard can be dangerous though. I remember racing up to hairpin 11 of Alpe d’Huez, which is effectively halfway, inside half an hour, thinking I was about to do it in under 60 minutes, which is a really good time. A decent first attempt before going for Marco Pantani’s record when I’m older, I reasoned. Nobody had really told me about pacing or the crucial fact that the bends get further apart the higher up you go. I blew spectacularly and crawled to the top.</span></p>\n<p>The climb up can be hard, especially when you overcook it early, but it’s always worth it. Whether big or small, verdant or barren, mountains are veritable theatres for struggle, resilience, joy, relief, satisfaction, inspiration. The stories in our latest edition tap into those emotions and evoke many more. <a href=\"https://www.rouleur.cc/pages/subscribe\" target=\"_blank\">Subscribe now</a> to get your copy.</p>\n<p><span>Andy McGrath | Editor of Rouleur magazine</span></p>\n<p>---</p>\n<h4>A look inside the Issue</h4>\n<p><a href=\"https://www.rouleur.cc/pages/subscribe\" target=\"_blank\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/blog_issue_images_2_1024x1024.jpg?v=1626342784\" /></a></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"66510be69f0fa05b1a6f9e55ab165a0f6829febeed0799ec5c749e17b5c128cf","category":"Cycling"}