{"title":"Women in Supply Chain Leadership: Barriers and Opportunities","link":"https://www.preprints.org/manuscript/202406.0499/v1","date":1717763621000,"content":"This study explores the barriers and opportunities faced by women in supply chain leadership, a field traditionally dominated by men. Through in-depth interviews and thematic analysis, it uncovers the pervasive cultural and societal biases that undermine women's perceived competence and suitability for leadership roles. These biases, often rooted in deep-seated stereotypes, influence hiring and promotion decisions, creating significant obstacles for women. Structural and organizational barriers, such as the lack of formal diversity policies, flexible working arrangements, and adequate mentorship, further hinder women's career progression. The dual burden of professional and domestic responsibilities also disproportionately affects women, limiting their availability for work-related travel and extended hours, which are often required in supply chain roles. Despite these challenges, the study identifies several pathways to promote gender diversity in supply chain leadership. Organizational commitment to diversity and inclusion, flexible working policies, and comprehensive mentorship programs are crucial in supporting women's advancement. Education and professional development opportunities are essential in equipping women with the necessary skills for leadership roles. Additionally, fostering an inclusive corporate culture that values diverse perspectives and addresses discrimination is vital for creating a supportive environment. Broader societal and policy-level changes, such as government and industry initiatives promoting gender diversity, are also necessary. The integration of emerging areas like sustainability, entrepreneurship, emotional intelligence, marketing, and supplier relationship management offers new opportunities for women to contribute to the industry's evolution. By addressing these barriers and leveraging the identified opportunities, it is possible to create a more inclusive and equitable supply chain industry, benefiting both the industry and society.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"666e54844efd35169fae3701953f3a5885a37b9d7f82fa3ca8a5c581ea2c61d8","category":"Interdisciplinary"}