{"title":"Apple pulls the plug on its cheapest Music subscription plan","link":"https://www.macworld.com/article/2123198/apple-music-voice-subscription-plan-siri-discontinued.html","date":1698868997000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p><em>Updated at 1:30 p.m. Pacific with a reference to Apple’s support document and information for current Voice Plan subscribers.</em></p>\n\n\n\n<p>Back in 2021, Apple introduced the <a href=\"https://www.macworld.com/article/560393/apple-music-voice-siri-airpods-iphone-future.html\">Apple Music Voice Plan</a> as a cheap entry into the music streaming service. This $5 plan forced users to use Siri to access Apple Music. It’s restrictive but cheap, and if you weren’t the type to fire up the Apple Music app and peruse its contents, it was the perfect plan, offering full access to the Apple Music library.</p>\n\n\n\n<p>Two years later, the Apple Music Voice Plan has met its demise. As first reported by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://macmagazine.com.br/post/2023/11/01/silenciosamente-apple-mata-assinatura-voice-do-apple-music/&amp;xcust=1-1-2123198-1-0-0&amp;sref=https://www.macworld.com/feed\">MacMagazine</a> (a Brazilian site in Portuguese), Apple has removed references to the Voice Plan from its <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2123198-1-0-0&amp;u=https://www.apple.com/apple-music/\">Apple Music website</a>. Now, the only plans available are the Student ($5.99/£5.99 monthly), Individual ($10.99/£10.99 monthly), and Family ($16.99/£16.99 monthly) plans. Apple Music is also included in <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2123198-1-0-0&amp;u=https://www.apple.com/uk/apple-one/\">Apple One</a> plans, which recently received their own price hike.</p>\n\n\n\n<p>Apple has posted a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT212798&amp;xcust=1-1-2123198-1-0-0&amp;sref=https://www.macworld.com/feed\">support document regarding the cancelation of the Voice Plan</a>, stating that the company is, “focused on delivering the best, most robust music experience possible for our customers,” and that, “All Apple Music plans already work seamlessly with Siri, and we will continue to optimize this experience.”</p>\n\n\n\n<p>According to the document, current subscribers to the Voice Plan will not be auto-renewed and the plan will close at the end of their billing cycle. The user will get a notification before the cycle ends on what plans they can switch to.</p>\n\n\n\n<p>The Voice Plan seemed like a good idea when it was introduced. Not only was it a cheap way to get Apple Music, but it seemed suited for Apple’s HomePod, HomePod mini, Apple Watch, and CarPlay. It also seemed like a fit for the upcoming Apple Vision Pro. But the Voice Plan has many restrictions, such as no Dolby audio support, it didn’t display lyrics, and it had to be always connected to the internet.</p>\n\n\n\n<p>Apple doesn’t release subscriber numbers and data, so no one outside of Apple knows how many people used the Voice Plan. But since Apple discontinued it, likely there weren’t many. To access the plan, you needed a Siri-enabled device to use it—HomePod, AirPods, iPhone, etc.—so <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2123198-1-0-0&amp;u=https://www.apple.com/lae/apple-music/android-download/\">Android phones</a> and <a href=\"https://click.linksynergy.com/deeplink?id=*l6kYCuH720&amp;mid=24542&amp;u1=1-1-2123198-1-0-0&amp;murl=https://apps.microsoft.com/detail/apple-music-preview/9PFHDD62MXS1?hl=en-us&amp;gl=US\">Windows PCs</a> were out of the question. </p>\n\nStreaming Media</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6675e13a08e13b62d622a68e8950c5ec27b8bb967961f180bdd6c2c44cdb9463","category":"Apple"}