{"title":"Modeling of culture conditions by culture system, glucose and propionic acid and their impact on metabolic profile in IPEC-J2","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307411","date":1721311200000,"content":"<p>by Shirko Marcel Shokr, Stefan Kahlert, Jeannette Kluess, Johannes Hradsky, Sven Dänicke, Hermann-Josef Rothkötter, Constanze Nossol</p>\r\n\r\nThe microbiological environment and their corresponding secreted metabolite spectrum are an essential modulator of the enterocyte function, effecting the whole organism. Intestinal porcine jejunal epithelial cell line (IPEC-J2) is an established in vitro model for differentiation of enterocytes in different cell culture models. An improved oxygen supply seems to be the main reason for differentiation in an air-liquid-interface culture, but this has not yet been conclusively clarified. In this context, the nutrition of the cell and its influence on the metabolism is also of crucial importance. The interest in short-chain fatty acids (SCFAs) has grown steadily in recent years due to their clinical relevance in certain diseases such as multiple sclerosis and other inflammatory diseases, but not much is known of FFAR2 and FFAR3 (free fatty acid receptor 2 and 3) in pigs. We want to address the questions: 1. about the distribution of FFAR2 and FFAR3 <i>in vivo</i> and <i>in vitro</i> in <i>sus scrofa</i> 2. whether there is an influence of propionic acid, glucose content and cultivation on metabolism of enterocytes? The morphological analysis of FFAR2 and FFAR3 <i>in vivo</i> was investigated through immunostaining of frozen sections of the porcine gut segments jejunum, ileum and colon. Both receptors are expressed along the gut and were found in the smooth muscle cells of the <i>tunica muscularis</i> and <i>lamina muscularis mucosae</i>. Furthermore, a high expression of FFAR2 and a low expression of FFAR3 in the enteric nerve system was also observed in jejunum, ileum and colon of <i>sus scrofa</i>. In addition, FFAR2 and FFAR3 within the vessels was investigated. FFAR3 showed a strong expression on endothelial cells of veins and lymphatic vessels but was not detectable on arteries. Furthermore, we demonstrate for the first time, FFAR2 and FFAR3 in IPEC-J2 cells on RNA- and protein level, as well as with confocal microscopy. In addition, ENO1 and NDUFA4 were investigated on RNA-level in IPEC-J2 cells as 2 important genes, which play an essential role in metabolism. Here, NDUFA4 is detected in the model animal <i>sus scrofa</i> as well as in the porcine cell line IPEC-J2. A potential impact of propionic acid and/or glucose and/or cultivation method on the metabolism of the cells was tested with the Seahorse analyzer. Here, a significant higher ECAR was observed in the SMC than in the OCR. In summary, we were able to show that the cultivation system appears to have a greater influence than the medium composition or nutrition of the cells. However, this can be modulated by incubation time or combination of different SCFAs.","author":"Shirko Marcel Shokr","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"667a355d832b7bfad9eea9ec0c2969f4668eac00d58d009b2608639fc6218bef","category":"Interdisciplinary"}